{"newsArray":[{"article_id":"0e451c25b1fac34a7fcd861037b5697c","title":"All Blacks v Namibia: All Blacks look to adapt after copping le boot from France at World Cup 2023","link":"https://www.nzherald.co.nz/sport/all-blacks-v-namibia-all-blacks-look-to-adapt-after-copping-le-boot-from-france-at-world-cup-2023/QZP3NJUV4ZGXBFFXDYLKCGFZZU/","keywords":null,"creator":null,"video_url":null,"description":"World rugby’s elite nations are now well-versed in the blueprint to beat the All Blacks.","content":"By Liam Napier in Lyon World rugby’s elite nations are now well-versed in the blueprint to beat the All Blacks . Slow the pace by any means necessary, minimise ball in play time, maintain discipline and kick, kick, kick. How the All Blacks adapt and adjust to these frustrating squeeze tactics could define their teetering World Cup campaign. Internal team data-driven analysis has emerged from RTE Sport’s Bernard Jackman that reveals France’s successive wins over the All Blacks, with their World Cup-opening success coming on the back of their 2021 victory in Paris, is based on tactical methods adopted by Ireland and the Springboks in recent years. Everyone who viewed the All Blacks’ opening World Cup defeat noted France’s determination to kick at almost every opportunity – even from valuable turnover possession and when attacking in the All Blacks half. French flair predominantly gave way to le boot. This strategy is based on tactics Ireland and South Africa used in victories against the All Blacks where both teams largely opted to hold the ball for no longer than 20 seconds or three phases. Teams who adopt this tactic tend to beat the All Blacks. Attacking-minded sides, such as Australia, who often retain the ball for 40 seconds or longer tend to play into the All Blacks’ hands and lose. The other less surprising statistic is that opposition who maintain their discipline, and give up seven penalties or fewer, enjoy a 75 per cent success rate against the All Blacks. France conceded four penalties in their latest victory. Watch: Can the ABs still win the World Cup? Our experts answer your questions It’s no coincidence the world’s top three ranked nations are essentially playing the All Blacks in a similar vein that centres on set piece strength, discipline, peppering the All Blacks with kicks which challenges them to make the running of the game, to counterattack and take risks from the backfield. “Teams without the ball are going a long way to winning some of these test matches at the moment. They’re kicking a lot, forcing a lot of mistakes,” All Blacks second five-eighth Jordie Barrett said astutely, noting George Ford kicked 27 points as England overcame their one-man disadvantage for 78 minutes against Argentina. Barrett offered further evidence by pointing to Wales making a World Cup-record 252 tackles in their win over Fiji. When the All Blacks defeated the Wallabies 38-7 in Melbourne this year the ball was in play for over 40 minutes. When they were humbled by South Africa at Twickenham the figure dropped to 33 minutes. The All Blacks clearly want to lift the pace and tempo at this World Cup. The heat, which imposed one water break each half on the opening weekend, hasn’t helped that desire but those measures won’t be in place as the sweltering temperatures in France ease in the coming weeks. One way to keep the ball in play more is to kick less. The All Blacks have addressed elements of their kicking against France after Ian Foster conceded his side lacked ambition during their concerning final quarter fade at Stade de France. “We found in our game there was only 27 minutes of ball in play which is pretty crazy in an 80-minute match,” Barrett said. “We’d like that number to be higher to bring fatigue into the game and potentially reduce those water breaks so we can use that to our advantage a little bit more but we’ve got to adapt. “It’s different, it’s a World Cup, and you’re going to get tested. Later on in the tournament there will be different factors and whoever adapts better on the night when it becomes sudden death will go a long way. A lot more ball in play is needed. Rugby World Cup 2023 results so far “As the tournament goes on you have to adapt against different opposition, the conditions, Northern Hemisphere teams, the referees. We’ve got to keep getting better.” The All Blacks know they won’t have it all their own way at this World Cup. They also know it won’t be the last time they confront the successful blueprint France, Ireland and South Africa have adopted. As scrum coach Greg Feek explained, playing at pace and attempting to speed up contests remains the All Blacks’ modus operandi. There are elements such as regaining forward punch they can control, though, and others they can’t. “Some of it is talking to the referee if there’s guys going down or taking time to get into a lineout. There’s certain things that contribute to that,” Feek said. “There’s water breaks as well. Yes, we would like to play more footy. We want to get our game going, get into a fast pace that suits our style that we love to play.” Dane Coles, attending his third World Cup, appreciates more than most the All Blacks must find a way through slow, kick-heavy slugfests if they are to transform their prospects. “We always back our fitness but you might not get the ball in play you want at this World Cup,” Coles said. “It comes back to holding on to the pill, being disciplined, building pressure, defending really well on our line. There’s a number of things that can help that.” Liam Napier has been a sports journalist since 2010, and his work has taken him to World Cups in rugby, netball and cricket, boxing world title fights and Commonwealth Games. Get full coverage of the Rugby World Cup .","pubDate":"2023-09-13 00:04:09","image_url":"https://www.nzherald.co.nz/resizer/GOASdVNUkRCVceWt3Pfl4F5x_5I=/300x300/smart/filters:quality(70)/cloudfront-ap-southeast-2.images.arcpublishing.com/nzme/B2ZUOVKA65H5HLJRRWZINKZ43U.JPG","source_id":"nzherald","source_priority":7971,"country":["new zealand"],"category":["sports"],"language":"english"},{"article_id":"ad683c43ad6906d0e69dc99d19e1ef64","title":"गौतम गंभीर ने श्रीलंका के खिलाफ टीम इंडिया की जीत पाकिस्तान से बेहतर बताया, जानिए वजह","link":"https://hindi.oneindia.com/news/sports/cricket/gautam-gambhir-says-win-against-sri-lanka-is-way-better-than-pakistan-818485.html","keywords":null,"creator":null,"video_url":null,"description":"श्रीलंका के खिलाफ भारत की जीत को गौतम गंभीर ने पाकिस्तान के खिलाफ जीत से बेहतर बताया है। उन्होंने कहा कि","content":"एशिया कप में सुपर फोर के मुकाबले में भारत ने पाकिस्तान के खिलाफ जबरदस्त जीत दर्ज की। मैच में जिस तरह से भारतीय बल्लेबाजों ने पहले पाकिस्तान की पेस बैटरी की क्लास लगाई और उसके बाद गेंदबाजों ने पूरी टीम को 128 रन के स्कोर पर समेट दिया, उसकी हर कोई तारीफ कर रहा है। इस जीत को ऐतिहासिक जीत माना जा रहा है और पाकिस्तान के खिलाफ अबतक की सबसे बड़ी जीत कहा जा रहा है। लेकिन पूर्व क्रिकेट गौतम गंभीर को ऐसा नहीं लगता है। जिस तरह से श्रीलंका के खिलाफ भारत ने 41 रन से जीत दर्ज की उसकी तारीफ करते हुए गौतम गंभीर ने इस जीत को पाकिस्तान के खिलाफ जीत से कहीं बेहतर कहा है। बता दें कि श्रीलंका के खिलाफ भारत ने सिर्फ 213 रन बनाए थे, लेकिन श्रीलंका की टीम सिर्फ 172 रन के ही स्कोर पर सिमट गई। टीम इंडिया की जत पर गौतम गंभीर ने कहा कि श्रीलंका के खिलाफ भारतीय टीम की जीत को पाकिस्तान के खिलाफ जीत से कहीं बेहतर बताया है। उन्होंने कहा कि कई लोग मेरी इस बात से राजी नहीं होंगे। ये जीत मेरे लिए पाकिस्तान से ज्यादा बेहतर जीत थी। यह मैच टीम को ज्यादा आत्मविश्वास देगा। 217 रन का लक्ष्य श्रीलंका में डिफेंड करना काफी मनोबल बढ़ाएगा, इसका फायदा एशिया कप के फाइनल और विश्वकप में देखने को मिलेगा। इस जीत से कप्तान रोहित शर्मा का भी भरोसा बढ़ा होगा। बता दें कि टॉस जीतकर पहले बल्लेबाजी करने उतरी भारतीय टीम की शुरुआत काफी जबरदस्त हुई। रोहित शर्मा ने जबरदस्त 53 रनों की पारी खेली। वहीं शुभमन गिल 19 रन ही बना सके। लेकिन रोहित और गिल के आउट होने के बाद विराट कोहली सिर्फ 3 रन के स्कोर पर सिमट गए। वहीं ईशान किशन ने 33 रन और केएल राहुल ने 39 रनों की पारी खेली जिसकी मदद से टीम का स्कोर 213 रन पहुंचा। हालांकि श्रीलंका के बल्लेबाजों ने अच्छा प्रदर्शन करते हुए मैच में खुद को बनाए रखा। लेकिन कुलदीप यादव ने श्रीलंका के बल्लेबाजों की अच्छी क्लास लगाई और टीम के 4 बल्लेबाजों को पवेलियन पहुंचाया। जिसकी बदौलत भारत ने मैज में 41 रन से जीत दर्ज की।","pubDate":"2023-09-12 23:20:13","image_url":null,"source_id":"oneindia","source_priority":12404,"country":["india"],"category":["sports"],"language":"hindi"},{"article_id":"3b10e987f3a778f33d2476d4f9e53bcb","title":"Dane Vilas and Luke Wells put Lancashire in front heading into final day","link":"https://www.watfordobserver.co.uk/sport/national/23785441.dane-vilas-luke-wells-put-lancashire-front-heading-final-day/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"Luke Wells fell three runs short of a hundred at Old Trafford.","content":"Vilas’ 124 and 97 from opener Luke Wells at Old Trafford laid the foundation, with George Bell’s unbeaten 56 easing the home side past the visitors’ first-innings total of 194. They ended a rain-affected day on 330 for five with Jayant Yadav and Joshua de Caires having taken two wickets each. CLOSE | We'll return tomorrow 🤝 James (38) and Clarke (61) share a stoic 39-over partnership to keep the game alive, with Notts now trailing by four. — Nottinghamshire CCC (@TrentBridge) Joe Clarke steered Nottinghamshire to within four runs of making Kent bat again after the home side enforced the follow-on at Canterbury. Clarke finished day three on 61 not out having put on 99 with number seven Lyndon James, who was unbeaten on 38, as the visitors reached 177 for five having being dismissed for 265 first time around. Aron Nijjar had earlier claimed career-best figures of four for 67 as Kent piled on the pressure after posting 446. Northamptonshire’s hopes of digging themselves out of relegation trouble were dealt a major blow as the third day of their clash with Warwickshire was washed out. 𝙂𝙀𝙏 𝙄𝙉, 𝙇𝙀𝙐𝙎!! 💯 Du Plooy goes to his century just two balls after tea! It comes off 151 balls including 13 fours. DER: 392-8; Watt (15*), leading by 15. Watch LIVE⤵️ — Derbyshire CCC (@DerbyshireCCC) Relentless rain at Edgbaston prevented them from building upon their first-innings total of 142 for four in reply to 250 as hopes of a crucial victory faded. In Division Two, Derbyshire skipper Leus du Plooy posted an unbeaten century on a day when bad light hampered the visitors’ progress at Gloucestershire. Du Plooy had resumed on 44 from a total of 261 for six and was still there on 103 at stumps, with his side having advanced to 398 for nine to hold a 21-run first-innings lead. Yorkshire’s Matthew Revis delivered career-best bowling figures of five for 50 to force Glamorgan to follow on at Sophia Gardens. Bad light ends play on Day 3 with Byrom on 52 and Northeast on 45 standing firm. Glamorgan 120/2 trailing by 107 | — Glamorgan Cricket 🏏 (@GlamCricket) The 21-year-old’s efforts helped to dismiss the home side for 273 in their first innings as they chased a total of 500. However, Glamorgan rallied before play ended five overs short because of bad light, with Eddie Byrom and Sam Northeast putting on 90 for the third wicket to take the Welsh side to 120 for two, still 107 runs adrift. An unbeaten century from Colin Ackermann kept Leicestershire in the hunt for an unlikely victory over Sussex. Ackermann was 103 not out at stumps on day three at Hove with his side on 221 for three and requiring a further 278 for victory. The home side had earlier declared on 344 for nine having added 110 to their overnight total.","pubDate":"2023-09-12 19:14:16","image_url":"https://www.watfordobserver.co.uk/resources/images/17220731/?type=app&htype=0","source_id":"watfordobserver","source_priority":435041,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"7b7618a8e8a9ecc8bd28693169061f4b","title":"Dane Vilas and Luke Wells put Lancashire in front heading into final day","link":"https://www.andoveradvertiser.co.uk/sport/national/23785441.dane-vilas-luke-wells-put-lancashire-front-heading-final-day/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"Luke Wells fell three runs short of a hundred at Old Trafford.","content":"Vilas’ 124 and 97 from opener Luke Wells at Old Trafford laid the foundation, with George Bell’s unbeaten 56 easing the home side past the visitors’ first-innings total of 194. They ended a rain-affected day on 330 for five with Jayant Yadav and Joshua de Caires having taken two wickets each. CLOSE | We'll return tomorrow 🤝 James (38) and Clarke (61) share a stoic 39-over partnership to keep the game alive, with Notts now trailing by four. — Nottinghamshire CCC (@TrentBridge) Joe Clarke steered Nottinghamshire to within four runs of making Kent bat again after the home side enforced the follow-on at Canterbury. Clarke finished day three on 61 not out having put on 99 with number seven Lyndon James, who was unbeaten on 38, as the visitors reached 177 for five having being dismissed for 265 first time around. Aron Nijjar had earlier claimed career-best figures of four for 67 as Kent piled on the pressure after posting 446. Northamptonshire’s hopes of digging themselves out of relegation trouble were dealt a major blow as the third day of their clash with Warwickshire was washed out. 𝙂𝙀𝙏 𝙄𝙉, 𝙇𝙀𝙐𝙎!! 💯 Du Plooy goes to his century just two balls after tea! It comes off 151 balls including 13 fours. DER: 392-8; Watt (15*), leading by 15. Watch LIVE⤵️ — Derbyshire CCC (@DerbyshireCCC) Relentless rain at Edgbaston prevented them from building upon their first-innings total of 142 for four in reply to 250 as hopes of a crucial victory faded. In Division Two, Derbyshire skipper Leus du Plooy posted an unbeaten century on a day when bad light hampered the visitors’ progress at Gloucestershire. Du Plooy had resumed on 44 from a total of 261 for six and was still there on 103 at stumps, with his side having advanced to 398 for nine to hold a 21-run first-innings lead. Yorkshire’s Matthew Revis delivered career-best bowling figures of five for 50 to force Glamorgan to follow on at Sophia Gardens. Bad light ends play on Day 3 with Byrom on 52 and Northeast on 45 standing firm. Glamorgan 120/2 trailing by 107 | — Glamorgan Cricket 🏏 (@GlamCricket) The 21-year-old’s efforts helped to dismiss the home side for 273 in their first innings as they chased a total of 500. However, Glamorgan rallied before play ended five overs short because of bad light, with Eddie Byrom and Sam Northeast putting on 90 for the third wicket to take the Welsh side to 120 for two, still 107 runs adrift. An unbeaten century from Colin Ackermann kept Leicestershire in the hunt for an unlikely victory over Sussex. Ackermann was 103 not out at stumps on day three at Hove with his side on 221 for three and requiring a further 278 for victory. The home side had earlier declared on 344 for nine having added 110 to their overnight total.","pubDate":"2023-09-12 19:14:16","image_url":"https://www.andoveradvertiser.co.uk/resources/images/17220731/?type=app&htype=0","source_id":"andoveradvertiser","source_priority":6475270,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"16241145a4569b4615450fd6bd3ff357","title":"Dutch court sentences ex-Pakistani cricketer to 12 years over reward for death of far-right lawmaker","link":"https://www.nzherald.co.nz/sport/dutch-court-sentences-ex-pakistani-cricketer-to-12-years-over-reward-for-death-of-far-right-lawmaker/R7ZWMBNJ2NH3ZPEPIWML4EWZCU/","keywords":null,"creator":null,"video_url":null,"description":"A Dutch court has sentenced a former Pakistani cricketer to 12 years in prison.","content":"A Dutch court has sentenced a former Pakistani cricketer to 12 years in prison over allegations that he had offered a reward for the death of firebrand anti-Islam Dutch lawmaker Geert Wilders. The suspect, identified by Wilders as Khalid Latif, is accused of offering a bounty of about 21,000 euros ($23,000) to anybody who killed Wilders. Latif did not appear in the high-security courtroom near Amsterdam’s Schiphol Airport for the trial and he was not represented by a lawyer. He is believed to be in Pakistan, which has no extradition agreement with the Netherlands. Prosecutors did not name Latif, but said in a statement that a video posted online in 2018 showed a famous Pakistan cricketer offering the money for killing Wilders. The lawmaker, who was present for the verdict, has lived under around-the-clock protection for years because of repeated threats to his life sparked by his fierce criticism of Islam. Advertisement Advertise with NZME. “The court has now ruled that a long-term unconditional term of imprisonment is the only suitable punishment for these types of offenses,” a statement said. The alleged bounty offer came after Wilders said he would organize a competition of cartoons of the Prophet Muhammad. Many Muslims consider any depictions of Muhammad to be blasphemous. Ultimately, the contest was not held, but the plan sparked outrage in the Muslim world. Wilders said he was “very happy” with the verdict. “But of course, he is not here and it’s only real justice when he will be arrested, apprehended and extradited to the Netherlands,” he said of Latif. “I lost my whole personal freedom for almost 19 years now,” Wilders said, adding that he and his wife have had to live in safe houses and military barracks. “The only freedom I have is my freedom of speech and my freedom of thought.” Advertisement Advertise with NZME. An international warrant has been issued for Latif’s arrest. Dutch prosecutors have said they have been trying to contact him since 2018, first as a witness and then to answer the charges. However, they said they hadn’t received any reply from the Pakistani authorities. In 2017, Latif was banned for five years from all forms of cricket for his role in a match-fixing scandal in the Pakistan Super League. Save share Share this article facebook copy link twitter linkedin reddit email","pubDate":"2023-09-12 18:54:26","image_url":"https://www.nzherald.co.nz/resizer/7oPbHwUgNXpwbcw6IsztUAUvhF4=/300x300/smart/filters:quality(70)/cloudfront-ap-southeast-2.images.arcpublishing.com/nzme/SSS7IMPOC5CZHNL5JIOAK5YV2Y.jpg","source_id":"nzherald","source_priority":7971,"country":["new zealand"],"category":["sports"],"language":"english"},{"article_id":"a313bd620ac5f863f725aa850d01f639","title":"Alice Davidson-Richards says England ‘really frustrated’ as rain ruins ODI","link":"https://www.times-series.co.uk/sport/national/23785407.alice-davidson-richards-says-england-really-frustrated-rain-ruins-odi/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"Davidson-Richards and Charlie Dean were England’s only changes from the side that thumped Sri Lanka by seven wickets in the series opener.","content":"The all-rounder took a couple of wickets in her first England appearance in nine months as Sri Lanka were left teetering on 106 for nine after 30.5 overs before rain wiped out any more prospect of play. Despite a “really frustrating” outcome – with England denied the chance to move into an unassailable 2-0 lead in the three-match series – Davidson-Richards is happy to be back in the international ranks. She joined the group on Monday after gaining some perspective over the weekend, watching a club cricket game on Saturday which freed her up to make a ton in the Rachael Heyhoe Flint Trophy 24 hours later. “It’s been quite a fun few days,” she said. “I went to some club cricket on Saturday and remembered how wonderful cricket is in its actual true form, which put me in quite a nice position. “I’ve tried to bring that (attitude) into here. If I put pressure on myself that’s when it tends to go a bit t*ts up. It was just remembering how relaxed I was when I was playing club cricket. “I was watching mates I used to play with when I was 15 and just see people play just for the fun – you retire after (scoring) 30 and if you haven’t made 30 after 10 overs, you got bunked off as well. “On Sunday, I was just envisioning playing on that little club ground and remember how stress-free it was. I think that really helped calm my brain down and not let Alice get in the way of Alice.” Davidson-Richards, who was drafted in for the lone Ashes Test but went unused, initially put off answering the phone call that would have informed her of her England recall as she was out cycling. “I could see it coming, I was like ‘I’ll just deal with this afterwards’,” she said. “I was out on the bike ride in the countryside, it was quite hilly.” Davidson-Richards and Charlie Dean were England’s only changes from the side that thumped Sri Lanka by seven wickets. The tourists were coincidentally all out for 106 in the north-east on Saturday. Off-spinner Dean also impressed with figures of 7-3-12-2, including the key wicket of Sri Lanka captain Chamari Athapaththu, whose run-a-ball 34 was ended after being beaten by an arm ball and given lbw. Sri Lanka were 53 for two after nine overs but Athapaththu’s dismissal before the end of the powerplay took the wind out of the tourists’ sails and they gradually unravelled before rain had the final say. Lauren Filer also took a two wickets, with England’s fringe players, having been given an opportunity in these white-ball matches at the end of the summer, building a case for increasing involvement. “The best teams come from environments where there’s a lot of competition for places,” Davidson-Richards said. “You don’t want the same people being picked every single time, you want people pushing the XI that are there. I’m doing my job if I’m making it difficult for them to pick an XI. “Charlie Dean is exactly the same, if you’re leaving her out then you’re probably in quite a good place because she’s an unbelievable player. “The more people we can get up to that level, the better for the England team and we’ll keep pushing each other on.” As for what she is expecting when the teams head to Grace Road for Thursday’s final ODI, Davidson-Richards added: “Hopefully similar but without rain. “This was really frustrating. It’s frustrating we got ourselves into a really great position only for it to rain.”","pubDate":"2023-09-12 18:10:48","image_url":"https://www.times-series.co.uk/resources/images/17220688/?type=app&htype=0","source_id":"time_series","source_priority":668753,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"19849756b83cea5a6af66c2acac24b69","title":"Alice Davidson-Richards says England ‘really frustrated’ as rain ruins ODI","link":"https://www.andoveradvertiser.co.uk/sport/national/23785407.alice-davidson-richards-says-england-really-frustrated-rain-ruins-odi/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"Davidson-Richards and Charlie Dean were England’s only changes from the side that thumped Sri Lanka by seven wickets in the series opener.","content":"The all-rounder took a couple of wickets in her first England appearance in nine months as Sri Lanka were left teetering on 106 for nine after 30.5 overs before rain wiped out any more prospect of play. Despite a “really frustrating” outcome – with England denied the chance to move into an unassailable 2-0 lead in the three-match series – Davidson-Richards is happy to be back in the international ranks. She joined the group on Monday after gaining some perspective over the weekend, watching a club cricket game on Saturday which freed her up to make a ton in the Rachael Heyhoe Flint Trophy 24 hours later. “It’s been quite a fun few days,” she said. “I went to some club cricket on Saturday and remembered how wonderful cricket is in its actual true form, which put me in quite a nice position. “I’ve tried to bring that (attitude) into here. If I put pressure on myself that’s when it tends to go a bit t*ts up. It was just remembering how relaxed I was when I was playing club cricket. “I was watching mates I used to play with when I was 15 and just see people play just for the fun – you retire after (scoring) 30 and if you haven’t made 30 after 10 overs, you got bunked off as well. “On Sunday, I was just envisioning playing on that little club ground and remember how stress-free it was. I think that really helped calm my brain down and not let Alice get in the way of Alice.” Davidson-Richards, who was drafted in for the lone Ashes Test but went unused, initially put off answering the phone call that would have informed her of her England recall as she was out cycling. “I could see it coming, I was like ‘I’ll just deal with this afterwards’,” she said. “I was out on the bike ride in the countryside, it was quite hilly.” Davidson-Richards and Charlie Dean were England’s only changes from the side that thumped Sri Lanka by seven wickets. The tourists were coincidentally all out for 106 in the north-east on Saturday. Off-spinner Dean also impressed with figures of 7-3-12-2, including the key wicket of Sri Lanka captain Chamari Athapaththu, whose run-a-ball 34 was ended after being beaten by an arm ball and given lbw. Wickets falling at Northants 😍 She does it all, Charlie Dean 👏 — England Cricket (@englandcricket) Sri Lanka were 53 for two after nine overs but Athapaththu’s dismissal before the end of the powerplay took the wind out of the tourists’ sails and they gradually unravelled before rain had the final say. Lauren Filer also took a two wickets, with England’s fringe players, having been given an opportunity in these white-ball matches at the end of the summer, building a case for increasing involvement. “The best teams come from environments where there’s a lot of competition for places,” Davidson-Richards said. “You don’t want the same people being picked every single time, you want people pushing the XI that are there. I’m doing my job if I’m making it difficult for them to pick an XI. “Charlie Dean is exactly the same, if you’re leaving her out then you’re probably in quite a good place because she’s an unbelievable player. “The more people we can get up to that level, the better for the England team and we’ll keep pushing each other on.” As for what she is expecting when the teams head to Grace Road for Thursday’s final ODI, Davidson-Richards added: “Hopefully similar but without rain. “This was really frustrating. It’s frustrating we got ourselves into a really great position only for it to rain.”","pubDate":"2023-09-12 18:10:48","image_url":"https://www.andoveradvertiser.co.uk/resources/images/17220688/?type=app&htype=0","source_id":"andoveradvertiser","source_priority":6475270,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"eb5c682a03b3981608548432e6ab9f4f","title":"Alice Davidson-Richards says England ‘really frustrated’ as rain ruins ODI","link":"https://www.watfordobserver.co.uk/sport/national/23785407.alice-davidson-richards-says-england-really-frustrated-rain-ruins-odi/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"Davidson-Richards and Charlie Dean were England’s only changes from the side that thumped Sri Lanka by seven wickets in the series opener.","content":"The all-rounder took a couple of wickets in her first England appearance in nine months as Sri Lanka were left teetering on 106 for nine after 30.5 overs before rain wiped out any more prospect of play. Despite a “really frustrating” outcome – with England denied the chance to move into an unassailable 2-0 lead in the three-match series – Davidson-Richards is happy to be back in the international ranks. She joined the group on Monday after gaining some perspective over the weekend, watching a club cricket game on Saturday which freed her up to make a ton in the Rachael Heyhoe Flint Trophy 24 hours later. “It’s been quite a fun few days,” she said. “I went to some club cricket on Saturday and remembered how wonderful cricket is in its actual true form, which put me in quite a nice position. “I’ve tried to bring that (attitude) into here. If I put pressure on myself that’s when it tends to go a bit t*ts up. It was just remembering how relaxed I was when I was playing club cricket. “I was watching mates I used to play with when I was 15 and just see people play just for the fun – you retire after (scoring) 30 and if you haven’t made 30 after 10 overs, you got bunked off as well. “On Sunday, I was just envisioning playing on that little club ground and remember how stress-free it was. I think that really helped calm my brain down and not let Alice get in the way of Alice.” Davidson-Richards, who was drafted in for the lone Ashes Test but went unused, initially put off answering the phone call that would have informed her of her England recall as she was out cycling. “I could see it coming, I was like ‘I’ll just deal with this afterwards’,” she said. “I was out on the bike ride in the countryside, it was quite hilly.” Davidson-Richards and Charlie Dean were England’s only changes from the side that thumped Sri Lanka by seven wickets. The tourists were coincidentally all out for 106 in the north-east on Saturday. Off-spinner Dean also impressed with figures of 7-3-12-2, including the key wicket of Sri Lanka captain Chamari Athapaththu, whose run-a-ball 34 was ended after being beaten by an arm ball and given lbw. Wickets falling at Northants 😍 She does it all, Charlie Dean 👏 — England Cricket (@englandcricket) Sri Lanka were 53 for two after nine overs but Athapaththu’s dismissal before the end of the powerplay took the wind out of the tourists’ sails and they gradually unravelled before rain had the final say. Lauren Filer also took a two wickets, with England’s fringe players, having been given an opportunity in these white-ball matches at the end of the summer, building a case for increasing involvement. “The best teams come from environments where there’s a lot of competition for places,” Davidson-Richards said. “You don’t want the same people being picked every single time, you want people pushing the XI that are there. I’m doing my job if I’m making it difficult for them to pick an XI. “Charlie Dean is exactly the same, if you’re leaving her out then you’re probably in quite a good place because she’s an unbelievable player. “The more people we can get up to that level, the better for the England team and we’ll keep pushing each other on.” As for what she is expecting when the teams head to Grace Road for Thursday’s final ODI, Davidson-Richards added: “Hopefully similar but without rain. “This was really frustrating. It’s frustrating we got ourselves into a really great position only for it to rain.”","pubDate":"2023-09-12 18:10:48","image_url":"https://www.watfordobserver.co.uk/resources/images/17220688/?type=app&htype=0","source_id":"watfordobserver","source_priority":435041,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"08965aec730ddf6e7595c63e1bf4eeb1","title":"Dunith Wellalage sets records ablaze with magical spell","link":"https://thenorthlines.com/dunith-wellalage-sets-records-ablaze-with-magical-spell/","keywords":["Cricket","Sports"],"creator":["Northlines"],"video_url":null,"description":"Agencies Dunith Wellalage has always been marked for bigger things on a cricket field in Lankan circles, and on Tuesday he underlined his credentials with a brilliant five-for against India in the Asia Cup Super 4 match in Colombo. Those who know Wellalage would not have been surprised one bit as cricket is in the […] The post Dunith Wellalage sets records ablaze with magical spell appeared first on Northlines.","content":"Agencies Dunith Wellalage has always been marked for bigger things on a cricket field in Lankan circles, and on Tuesday he underlined his credentials with a brilliant five-for against India in the Asia Cup Super 4 match in Colombo. Those who know Wellalage would not have been surprised one bit as cricket is in the blood of the 20-year-old, who hails from Moratuwa, the fertile cricket base of Sri Lanka. His father Suranga Wellalage was a wicketkeeper batsman himself, and had once appeared in a few matches for the Prince of Wales team before diverting his career. But it was his son's destiny to climb the ladder, and represent the country from age-group to top-flight cricket. “I first saw him in a school match while he was playing for St Sebastian's. The boy had wonderful timing and was a natural talent. He was very handy with the ball too,” said Roger Wijesuriya, the former Sri Lankan cricketer. Soon, Wellalage shifted his base to St Joseph's College in Colombo seeking a better, more established cricket facility. The school has an illustrious alumni list that includes Sri Lankan cricketers like Angelo Mathews, Dimuth Karunaratne and Thissara Perera. “Once he enrolled into the school, we decided to give him as much opportunity to grow as a cricketer. He was a hard-working kid with a clear vision about his career. “We just helped him along, and he was a heavy-scorer and took wickets regularly for his school side. He was easily a step or two ahead of other boys around,” said Wijesuriya who mentored and coached Wellalage at the school. However, Wellalage first made an impression at a big stage during the U-19 World Cup in the West Indies. That tournament had given the cricketing world several talented kids apart from Wellalage. The likes of Dewald Brevis and Indian youngsters Yash Dhull and Raj Angad Bawa hogged limelight in that tournament. “Yeah! It was a breakout tournament for him. It gave him the confidence that he can do well for his country on big stages. It kind of mentally prepared him as he always had the skills,” he said. In that U-19 World Cup, Wellalage emerged the highest wicket-taker, grabbing 17 wickets from six matches, besides scoring 264 runs with a hundred. Wellalage also became the first Sri Lankan captain to score a hundred in the Under-19 World Cup during that tournament. The Sri Lanka senior team debut did not take long as he was given the cap during the first ODI against Australia at Pallekele earlier this June. His maiden international wicket was Steve Smith, no less. Now at the Premadasa Stadium, Wellalage has added some more hefty names to that list – Rohit Sharma, Virat Kohli, KL Rahul, Hardik Pandya and Shubman Gill. “He has made a good beginning. But he still has a long way to go. But I am sure that this boy is the future flag-bearer of Sri Lankan cricket,” said Wijesuriya, who has seen several young talents up close.The post Dunith Wellalage sets records ablaze with magical spell appeared first on Northlines.","pubDate":"2023-09-12 17:47:26","image_url":null,"source_id":"thenorthlines","source_priority":2728360,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"35a29ab98d802182c4e7cd7f79b825eb","title":"India beat Sri Lanka by 41 runs in super four match to enter final of Asia Cup","link":"http://www.newindianexpress.com/sport/cricket/2023/sep/12/india-beat-sri-lanka-by-41-runs-in-super-four-match-to-enter-final-of-asia-cup-2614200.html","keywords":null,"creator":null,"video_url":null,"description":"India defeated Sri Lanka by 41 runs in a super four match to secure their place in the final of the Asia Cup here on Tuesday. COLOMBO: Indian bowlers produced a splendid collective effort to carry their team to a 41-run win over a spirited Sri Lanka in a Super 4 match, and into the Asia Cup final here on Tuesday. Rohit Sharma's fifty (53 off 48 balls) was the cornerstone of India's sub-par 213 after Lankan spinners Dunith Wellalage (5/40) and Charith Asalanka (4/18) bamboozled them. But India, guided by Kuldeep Yadav's 4 for 43, bowled out Sri Lanka for 172. India, who entered the final with four points, will either face Sri Lanka or Pakistan in the summit clash on Sunday. The hosts will face Pakistan in a crunch match on Thursday. The insipid effort of their batsmen made it mandatory for the Indian bowlers to be on the money from ball one, and Jasprit Bumrah led the way. Bumrah took the ball away from Pathum Nissanka and the healthy edge was snaffled behind the wicket by a diving KL Rahul. Kusal Mendis looked in fine touch but he failed to keep his drive off a slow, full delivery from Bumrah down. Substitute fielder Suryakumar Yadav took the catch at covers and umpires gave Mendis out after a quick check with the TV umpire for bump ball. Mohammed Siraj soon got into act, cramping Dimuth Karunaratne for room and his cut did not go beyond Shubman Gill at second slip. Sri Lanka were 25 for 3 at that stage and Kuldeep took a couple of quick wickets to further dent their chase, reducing them to 99 for six. However, Wellalage (42 not out) and Dhananjaya de Silva (41 off 66 balls) added 63 runs for an enterprising seventh wicket alliance to revive Lankan hopes. But a moment of indiscretion ended the stand as De Silva tried to clear the infield off Jadeja only to give a simple catch to Gill at the edge of the circle. From that point, Wellalage, who batted exceptionally well under pressure against a fancied opponent, tried to bridge the gap. But the task was a tad too hard to achieve with a one man show. Earlier, left-arm spinner Wellalage and offie Asalanka did not allow Indian batters to settle into any sort of rhythm, as they knifed through their line-up taking nine wickets among them. But before Lankan spinners exploited the generous turn and grip on the Premadasa pitch, India started their innings in a blazing fashion. Rohit added 80 runs for the opening wicket with Gill, and that remained the brightest phase of Indian innings. Watching Rohit and Gill adding those runs in just 12 overs rekindled the memories of India's blitz against Pakistan on Monday, when they posted a massive 356 for two. During his innings, the Indian captain also went past a significant personal milestone, becoming the sixth Indian batsmen to score 10000 runs in ODIs. The landmark came in a befitting fashion too, as Rohit lifted pacer Kasun Rajita over his head for a majestic six. Other Indian batsmen to reach the mark are: Sachin Tendulkar, Sourav Ganguly, Rahul Dravid, Virat Kohli and MS Dhoni. Indeed, a magnificent company to be in! However, the introduction of Wellalage changed the whole complexion of the game, as the spinner halted Indian batsmen's early charge. Gill was the first batsman to depart. The opener played a forward defence without entirely covering the line and once the ball beat his bat, Gill's fate was sealed. Wellalage, a former under-19 captain of his country, then went on to show why he has been spoken so highly in Lankan cricketing circles. The 20-year-old bowled a straight, quick delivery and Rohit could not bring his bat down on time, as the ball rearranged his timber. But Wellalage wasn't finished. He added the wickets of Virat Kohli, KL Rahul, who added 63 runs for the seventh wicket with Ishan Kishan, and Hardik Pandya to his kitty for his maiden five-wicket haul in ODI cricket. None of the following batsmen could effectively negate the uneven bounce and turn on the pitch, as Asalanka wreaked havoc in India's middle and late order. His delivery to dismiss Ravindra Jadeja would carry a lot of repeat value. The ball reared from the length, turned and bounced viciously to take an edge of Jadeja's bat before nestling in stumper Kusal Mendis' gloves. India inched past the 200-run mark as Axar Patel made a precious 26, and the total proved just enough on the night.","content":"COLOMBO: Indian bowlers produced a splendid collective effort to carry their team to a 41-run win over a spirited Sri Lanka in a Super 4 match, and into the Asia Cup final here on Tuesday. Rohit Sharma's fifty (53 off 48 balls) was the cornerstone of India's sub-par 213 after Lankan spinners Dunith Wellalage (5/40) and Charith Asalanka (4/18) bamboozled them. But India, guided by Kuldeep Yadav's 4 for 43, bowled out Sri Lanka for 172. India, who entered the final with four points, will either face Sri Lanka or Pakistan in the summit clash on Sunday. The hosts will face Pakistan in a crunch match on Thursday. The insipid effort of their batsmen made it mandatory for the Indian bowlers to be on the money from ball one, and Jasprit Bumrah led the way. Bumrah took the ball away from Pathum Nissanka and the healthy edge was snaffled behind the wicket by a diving KL Rahul. Kusal Mendis looked in fine touch but he failed to keep his drive off a slow, full delivery from Bumrah down. Substitute fielder Suryakumar Yadav took the catch at covers and umpires gave Mendis out after a quick check with the TV umpire for bump ball. Mohammed Siraj soon got into act, cramping Dimuth Karunaratne for room and his cut did not go beyond Shubman Gill at second slip. Sri Lanka were 25 for 3 at that stage and Kuldeep took a couple of quick wickets to further dent their chase, reducing them to 99 for six. However, Wellalage (42 not out) and Dhananjaya de Silva (41 off 66 balls) added 63 runs for an enterprising seventh wicket alliance to revive Lankan hopes. But a moment of indiscretion ended the stand as De Silva tried to clear the infield off Jadeja only to give a simple catch to Gill at the edge of the circle. From that point, Wellalage, who batted exceptionally well under pressure against a fancied opponent, tried to bridge the gap. But the task was a tad too hard to achieve with a one man show. Earlier, left-arm spinner Wellalage and offie Asalanka did not allow Indian batters to settle into any sort of rhythm, as they knifed through their line-up taking nine wickets among them. But before Lankan spinners exploited the generous turn and grip on the Premadasa pitch, India started their innings in a blazing fashion. Rohit added 80 runs for the opening wicket with Gill, and that remained the brightest phase of Indian innings. Watching Rohit and Gill adding those runs in just 12 overs rekindled the memories of India's blitz against Pakistan on Monday, when they posted a massive 356 for two. During his innings, the Indian captain also went past a significant personal milestone, becoming the sixth Indian batsmen to score 10000 runs in ODIs. The landmark came in a befitting fashion too, as Rohit lifted pacer Kasun Rajita over his head for a majestic six. Other Indian batsmen to reach the mark are: Sachin Tendulkar, Sourav Ganguly, Rahul Dravid, Virat Kohli and MS Dhoni. Indeed, a magnificent company to be in! However, the introduction of Wellalage changed the whole complexion of the game, as the spinner halted Indian batsmen's early charge. Gill was the first batsman to depart. The opener played a forward defence without entirely covering the line and once the ball beat his bat, Gill's fate was sealed. Wellalage, a former under-19 captain of his country, then went on to show why he has been spoken so highly in Lankan cricketing circles. The 20-year-old bowled a straight, quick delivery and Rohit could not bring his bat down on time, as the ball rearranged his timber. But Wellalage wasn't finished. He added the wickets of Virat Kohli, KL Rahul, who added 63 runs for the seventh wicket with Ishan Kishan, and Hardik Pandya to his kitty for his maiden five-wicket haul in ODI cricket. None of the following batsmen could effectively negate the uneven bounce and turn on the pitch, as Asalanka wreaked havoc in India's middle and late order. His delivery to dismiss Ravindra Jadeja would carry a lot of repeat value. The ball reared from the length, turned and bounced viciously to take an edge of Jadeja's bat before nestling in stumper Kusal Mendis' gloves. India inched past the 200-run mark as Axar Patel made a precious 26, and the total proved just enough on the night.","pubDate":"2023-09-12 17:46:00","image_url":null,"source_id":"newindianexpress","source_priority":15406,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"0e451c25b1fac34a7fcd861037b5697c","title":"All Blacks v Namibia: All Blacks look to adapt after copping le boot from France at World Cup 2023","link":"https://www.nzherald.co.nz/sport/all-blacks-v-namibia-all-blacks-look-to-adapt-after-copping-le-boot-from-france-at-world-cup-2023/QZP3NJUV4ZGXBFFXDYLKCGFZZU/","keywords":null,"creator":null,"video_url":null,"description":"World rugby’s elite nations are now well-versed in the blueprint to beat the All Blacks.","content":"By Liam Napier in Lyon World rugby’s elite nations are now well-versed in the blueprint to beat the All Blacks . Slow the pace by any means necessary, minimise ball in play time, maintain discipline and kick, kick, kick. How the All Blacks adapt and adjust to these frustrating squeeze tactics could define their teetering World Cup campaign. Internal team data-driven analysis has emerged from RTE Sport’s Bernard Jackman that reveals France’s successive wins over the All Blacks, with their World Cup-opening success coming on the back of their 2021 victory in Paris, is based on tactical methods adopted by Ireland and the Springboks in recent years. Everyone who viewed the All Blacks’ opening World Cup defeat noted France’s determination to kick at almost every opportunity – even from valuable turnover possession and when attacking in the All Blacks half. French flair predominantly gave way to le boot. This strategy is based on tactics Ireland and South Africa used in victories against the All Blacks where both teams largely opted to hold the ball for no longer than 20 seconds or three phases. Teams who adopt this tactic tend to beat the All Blacks. Attacking-minded sides, such as Australia, who often retain the ball for 40 seconds or longer tend to play into the All Blacks’ hands and lose. The other less surprising statistic is that opposition who maintain their discipline, and give up seven penalties or fewer, enjoy a 75 per cent success rate against the All Blacks. France conceded four penalties in their latest victory. Watch: Can the ABs still win the World Cup? Our experts answer your questions It’s no coincidence the world’s top three ranked nations are essentially playing the All Blacks in a similar vein that centres on set piece strength, discipline, peppering the All Blacks with kicks which challenges them to make the running of the game, to counterattack and take risks from the backfield. “Teams without the ball are going a long way to winning some of these test matches at the moment. They’re kicking a lot, forcing a lot of mistakes,” All Blacks second five-eighth Jordie Barrett said astutely, noting George Ford kicked 27 points as England overcame their one-man disadvantage for 78 minutes against Argentina. Barrett offered further evidence by pointing to Wales making a World Cup-record 252 tackles in their win over Fiji. When the All Blacks defeated the Wallabies 38-7 in Melbourne this year the ball was in play for over 40 minutes. When they were humbled by South Africa at Twickenham the figure dropped to 33 minutes. The All Blacks clearly want to lift the pace and tempo at this World Cup. The heat, which imposed one water break each half on the opening weekend, hasn’t helped that desire but those measures won’t be in place as the sweltering temperatures in France ease in the coming weeks. One way to keep the ball in play more is to kick less. The All Blacks have addressed elements of their kicking against France after Ian Foster conceded his side lacked ambition during their concerning final quarter fade at Stade de France. “We found in our game there was only 27 minutes of ball in play which is pretty crazy in an 80-minute match,” Barrett said. “We’d like that number to be higher to bring fatigue into the game and potentially reduce those water breaks so we can use that to our advantage a little bit more but we’ve got to adapt. “It’s different, it’s a World Cup, and you’re going to get tested. Later on in the tournament there will be different factors and whoever adapts better on the night when it becomes sudden death will go a long way. A lot more ball in play is needed. Rugby World Cup 2023 results so far “As the tournament goes on you have to adapt against different opposition, the conditions, Northern Hemisphere teams, the referees. We’ve got to keep getting better.” The All Blacks know they won’t have it all their own way at this World Cup. They also know it won’t be the last time they confront the successful blueprint France, Ireland and South Africa have adopted. As scrum coach Greg Feek explained, playing at pace and attempting to speed up contests remains the All Blacks’ modus operandi. There are elements such as regaining forward punch they can control, though, and others they can’t. “Some of it is talking to the referee if there’s guys going down or taking time to get into a lineout. There’s certain things that contribute to that,” Feek said. “There’s water breaks as well. Yes, we would like to play more footy. We want to get our game going, get into a fast pace that suits our style that we love to play.” Dane Coles, attending his third World Cup, appreciates more than most the All Blacks must find a way through slow, kick-heavy slugfests if they are to transform their prospects. “We always back our fitness but you might not get the ball in play you want at this World Cup,” Coles said. “It comes back to holding on to the pill, being disciplined, building pressure, defending really well on our line. There’s a number of things that can help that.” Liam Napier has been a sports journalist since 2010, and his work has taken him to World Cups in rugby, netball and cricket, boxing world title fights and Commonwealth Games. Get full coverage of the Rugby World Cup .","pubDate":"2023-09-13 00:04:09","image_url":"https://www.nzherald.co.nz/resizer/GOASdVNUkRCVceWt3Pfl4F5x_5I=/300x300/smart/filters:quality(70)/cloudfront-ap-southeast-2.images.arcpublishing.com/nzme/B2ZUOVKA65H5HLJRRWZINKZ43U.JPG","source_id":"nzherald","source_priority":7971,"country":["new zealand"],"category":["sports"],"language":"english"},{"article_id":"ad683c43ad6906d0e69dc99d19e1ef64","title":"गौतम गंभीर ने श्रीलंका के खिलाफ टीम इंडिया की जीत पाकिस्तान से बेहतर बताया, जानिए वजह","link":"https://hindi.oneindia.com/news/sports/cricket/gautam-gambhir-says-win-against-sri-lanka-is-way-better-than-pakistan-818485.html","keywords":null,"creator":null,"video_url":null,"description":"श्रीलंका के खिलाफ भारत की जीत को गौतम गंभीर ने पाकिस्तान के खिलाफ जीत से बेहतर बताया है। उन्होंने कहा कि","content":"एशिया कप में सुपर फोर के मुकाबले में भारत ने पाकिस्तान के खिलाफ जबरदस्त जीत दर्ज की। मैच में जिस तरह से भारतीय बल्लेबाजों ने पहले पाकिस्तान की पेस बैटरी की क्लास लगाई और उसके बाद गेंदबाजों ने पूरी टीम को 128 रन के स्कोर पर समेट दिया, उसकी हर कोई तारीफ कर रहा है। इस जीत को ऐतिहासिक जीत माना जा रहा है और पाकिस्तान के खिलाफ अबतक की सबसे बड़ी जीत कहा जा रहा है। लेकिन पूर्व क्रिकेट गौतम गंभीर को ऐसा नहीं लगता है। जिस तरह से श्रीलंका के खिलाफ भारत ने 41 रन से जीत दर्ज की उसकी तारीफ करते हुए गौतम गंभीर ने इस जीत को पाकिस्तान के खिलाफ जीत से कहीं बेहतर कहा है। बता दें कि श्रीलंका के खिलाफ भारत ने सिर्फ 213 रन बनाए थे, लेकिन श्रीलंका की टीम सिर्फ 172 रन के ही स्कोर पर सिमट गई। टीम इंडिया की जत पर गौतम गंभीर ने कहा कि श्रीलंका के खिलाफ भारतीय टीम की जीत को पाकिस्तान के खिलाफ जीत से कहीं बेहतर बताया है। उन्होंने कहा कि कई लोग मेरी इस बात से राजी नहीं होंगे। ये जीत मेरे लिए पाकिस्तान से ज्यादा बेहतर जीत थी। यह मैच टीम को ज्यादा आत्मविश्वास देगा। 217 रन का लक्ष्य श्रीलंका में डिफेंड करना काफी मनोबल बढ़ाएगा, इसका फायदा एशिया कप के फाइनल और विश्वकप में देखने को मिलेगा। इस जीत से कप्तान रोहित शर्मा का भी भरोसा बढ़ा होगा। बता दें कि टॉस जीतकर पहले बल्लेबाजी करने उतरी भारतीय टीम की शुरुआत काफी जबरदस्त हुई। रोहित शर्मा ने जबरदस्त 53 रनों की पारी खेली। वहीं शुभमन गिल 19 रन ही बना सके। लेकिन रोहित और गिल के आउट होने के बाद विराट कोहली सिर्फ 3 रन के स्कोर पर सिमट गए। वहीं ईशान किशन ने 33 रन और केएल राहुल ने 39 रनों की पारी खेली जिसकी मदद से टीम का स्कोर 213 रन पहुंचा। हालांकि श्रीलंका के बल्लेबाजों ने अच्छा प्रदर्शन करते हुए मैच में खुद को बनाए रखा। लेकिन कुलदीप यादव ने श्रीलंका के बल्लेबाजों की अच्छी क्लास लगाई और टीम के 4 बल्लेबाजों को पवेलियन पहुंचाया। जिसकी बदौलत भारत ने मैज में 41 रन से जीत दर्ज की।","pubDate":"2023-09-12 23:20:13","image_url":null,"source_id":"oneindia","source_priority":12404,"country":["india"],"category":["sports"],"language":"hindi"},{"article_id":"3b10e987f3a778f33d2476d4f9e53bcb","title":"Dane Vilas and Luke Wells put Lancashire in front heading into final day","link":"https://www.watfordobserver.co.uk/sport/national/23785441.dane-vilas-luke-wells-put-lancashire-front-heading-final-day/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"Luke Wells fell three runs short of a hundred at Old Trafford.","content":"Vilas’ 124 and 97 from opener Luke Wells at Old Trafford laid the foundation, with George Bell’s unbeaten 56 easing the home side past the visitors’ first-innings total of 194. They ended a rain-affected day on 330 for five with Jayant Yadav and Joshua de Caires having taken two wickets each. CLOSE | We'll return tomorrow 🤝 James (38) and Clarke (61) share a stoic 39-over partnership to keep the game alive, with Notts now trailing by four. — Nottinghamshire CCC (@TrentBridge) Joe Clarke steered Nottinghamshire to within four runs of making Kent bat again after the home side enforced the follow-on at Canterbury. Clarke finished day three on 61 not out having put on 99 with number seven Lyndon James, who was unbeaten on 38, as the visitors reached 177 for five having being dismissed for 265 first time around. Aron Nijjar had earlier claimed career-best figures of four for 67 as Kent piled on the pressure after posting 446. Northamptonshire’s hopes of digging themselves out of relegation trouble were dealt a major blow as the third day of their clash with Warwickshire was washed out. 𝙂𝙀𝙏 𝙄𝙉, 𝙇𝙀𝙐𝙎!! 💯 Du Plooy goes to his century just two balls after tea! It comes off 151 balls including 13 fours. DER: 392-8; Watt (15*), leading by 15. Watch LIVE⤵️ — Derbyshire CCC (@DerbyshireCCC) Relentless rain at Edgbaston prevented them from building upon their first-innings total of 142 for four in reply to 250 as hopes of a crucial victory faded. In Division Two, Derbyshire skipper Leus du Plooy posted an unbeaten century on a day when bad light hampered the visitors’ progress at Gloucestershire. Du Plooy had resumed on 44 from a total of 261 for six and was still there on 103 at stumps, with his side having advanced to 398 for nine to hold a 21-run first-innings lead. Yorkshire’s Matthew Revis delivered career-best bowling figures of five for 50 to force Glamorgan to follow on at Sophia Gardens. Bad light ends play on Day 3 with Byrom on 52 and Northeast on 45 standing firm. Glamorgan 120/2 trailing by 107 | — Glamorgan Cricket 🏏 (@GlamCricket) The 21-year-old’s efforts helped to dismiss the home side for 273 in their first innings as they chased a total of 500. However, Glamorgan rallied before play ended five overs short because of bad light, with Eddie Byrom and Sam Northeast putting on 90 for the third wicket to take the Welsh side to 120 for two, still 107 runs adrift. An unbeaten century from Colin Ackermann kept Leicestershire in the hunt for an unlikely victory over Sussex. Ackermann was 103 not out at stumps on day three at Hove with his side on 221 for three and requiring a further 278 for victory. The home side had earlier declared on 344 for nine having added 110 to their overnight total.","pubDate":"2023-09-12 19:14:16","image_url":"https://www.watfordobserver.co.uk/resources/images/17220731/?type=app&htype=0","source_id":"watfordobserver","source_priority":435041,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"7b7618a8e8a9ecc8bd28693169061f4b","title":"Dane Vilas and Luke Wells put Lancashire in front heading into final day","link":"https://www.andoveradvertiser.co.uk/sport/national/23785441.dane-vilas-luke-wells-put-lancashire-front-heading-final-day/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"Luke Wells fell three runs short of a hundred at Old Trafford.","content":"Vilas’ 124 and 97 from opener Luke Wells at Old Trafford laid the foundation, with George Bell’s unbeaten 56 easing the home side past the visitors’ first-innings total of 194. They ended a rain-affected day on 330 for five with Jayant Yadav and Joshua de Caires having taken two wickets each. CLOSE | We'll return tomorrow 🤝 James (38) and Clarke (61) share a stoic 39-over partnership to keep the game alive, with Notts now trailing by four. — Nottinghamshire CCC (@TrentBridge) Joe Clarke steered Nottinghamshire to within four runs of making Kent bat again after the home side enforced the follow-on at Canterbury. Clarke finished day three on 61 not out having put on 99 with number seven Lyndon James, who was unbeaten on 38, as the visitors reached 177 for five having being dismissed for 265 first time around. Aron Nijjar had earlier claimed career-best figures of four for 67 as Kent piled on the pressure after posting 446. Northamptonshire’s hopes of digging themselves out of relegation trouble were dealt a major blow as the third day of their clash with Warwickshire was washed out. 𝙂𝙀𝙏 𝙄𝙉, 𝙇𝙀𝙐𝙎!! 💯 Du Plooy goes to his century just two balls after tea! It comes off 151 balls including 13 fours. DER: 392-8; Watt (15*), leading by 15. Watch LIVE⤵️ — Derbyshire CCC (@DerbyshireCCC) Relentless rain at Edgbaston prevented them from building upon their first-innings total of 142 for four in reply to 250 as hopes of a crucial victory faded. In Division Two, Derbyshire skipper Leus du Plooy posted an unbeaten century on a day when bad light hampered the visitors’ progress at Gloucestershire. Du Plooy had resumed on 44 from a total of 261 for six and was still there on 103 at stumps, with his side having advanced to 398 for nine to hold a 21-run first-innings lead. Yorkshire’s Matthew Revis delivered career-best bowling figures of five for 50 to force Glamorgan to follow on at Sophia Gardens. Bad light ends play on Day 3 with Byrom on 52 and Northeast on 45 standing firm. Glamorgan 120/2 trailing by 107 | — Glamorgan Cricket 🏏 (@GlamCricket) The 21-year-old’s efforts helped to dismiss the home side for 273 in their first innings as they chased a total of 500. However, Glamorgan rallied before play ended five overs short because of bad light, with Eddie Byrom and Sam Northeast putting on 90 for the third wicket to take the Welsh side to 120 for two, still 107 runs adrift. An unbeaten century from Colin Ackermann kept Leicestershire in the hunt for an unlikely victory over Sussex. Ackermann was 103 not out at stumps on day three at Hove with his side on 221 for three and requiring a further 278 for victory. The home side had earlier declared on 344 for nine having added 110 to their overnight total.","pubDate":"2023-09-12 19:14:16","image_url":"https://www.andoveradvertiser.co.uk/resources/images/17220731/?type=app&htype=0","source_id":"andoveradvertiser","source_priority":6475270,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"16241145a4569b4615450fd6bd3ff357","title":"Dutch court sentences ex-Pakistani cricketer to 12 years over reward for death of far-right lawmaker","link":"https://www.nzherald.co.nz/sport/dutch-court-sentences-ex-pakistani-cricketer-to-12-years-over-reward-for-death-of-far-right-lawmaker/R7ZWMBNJ2NH3ZPEPIWML4EWZCU/","keywords":null,"creator":null,"video_url":null,"description":"A Dutch court has sentenced a former Pakistani cricketer to 12 years in prison.","content":"A Dutch court has sentenced a former Pakistani cricketer to 12 years in prison over allegations that he had offered a reward for the death of firebrand anti-Islam Dutch lawmaker Geert Wilders. The suspect, identified by Wilders as Khalid Latif, is accused of offering a bounty of about 21,000 euros ($23,000) to anybody who killed Wilders. Latif did not appear in the high-security courtroom near Amsterdam’s Schiphol Airport for the trial and he was not represented by a lawyer. He is believed to be in Pakistan, which has no extradition agreement with the Netherlands. Prosecutors did not name Latif, but said in a statement that a video posted online in 2018 showed a famous Pakistan cricketer offering the money for killing Wilders. The lawmaker, who was present for the verdict, has lived under around-the-clock protection for years because of repeated threats to his life sparked by his fierce criticism of Islam. Advertisement Advertise with NZME. “The court has now ruled that a long-term unconditional term of imprisonment is the only suitable punishment for these types of offenses,” a statement said. The alleged bounty offer came after Wilders said he would organize a competition of cartoons of the Prophet Muhammad. Many Muslims consider any depictions of Muhammad to be blasphemous. Ultimately, the contest was not held, but the plan sparked outrage in the Muslim world. Wilders said he was “very happy” with the verdict. “But of course, he is not here and it’s only real justice when he will be arrested, apprehended and extradited to the Netherlands,” he said of Latif. “I lost my whole personal freedom for almost 19 years now,” Wilders said, adding that he and his wife have had to live in safe houses and military barracks. “The only freedom I have is my freedom of speech and my freedom of thought.” Advertisement Advertise with NZME. An international warrant has been issued for Latif’s arrest. Dutch prosecutors have said they have been trying to contact him since 2018, first as a witness and then to answer the charges. However, they said they hadn’t received any reply from the Pakistani authorities. In 2017, Latif was banned for five years from all forms of cricket for his role in a match-fixing scandal in the Pakistan Super League. Save share Share this article facebook copy link twitter linkedin reddit email","pubDate":"2023-09-12 18:54:26","image_url":"https://www.nzherald.co.nz/resizer/7oPbHwUgNXpwbcw6IsztUAUvhF4=/300x300/smart/filters:quality(70)/cloudfront-ap-southeast-2.images.arcpublishing.com/nzme/SSS7IMPOC5CZHNL5JIOAK5YV2Y.jpg","source_id":"nzherald","source_priority":7971,"country":["new zealand"],"category":["sports"],"language":"english"},{"article_id":"a313bd620ac5f863f725aa850d01f639","title":"Alice Davidson-Richards says England ‘really frustrated’ as rain ruins ODI","link":"https://www.times-series.co.uk/sport/national/23785407.alice-davidson-richards-says-england-really-frustrated-rain-ruins-odi/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"Davidson-Richards and Charlie Dean were England’s only changes from the side that thumped Sri Lanka by seven wickets in the series opener.","content":"The all-rounder took a couple of wickets in her first England appearance in nine months as Sri Lanka were left teetering on 106 for nine after 30.5 overs before rain wiped out any more prospect of play. Despite a “really frustrating” outcome – with England denied the chance to move into an unassailable 2-0 lead in the three-match series – Davidson-Richards is happy to be back in the international ranks. She joined the group on Monday after gaining some perspective over the weekend, watching a club cricket game on Saturday which freed her up to make a ton in the Rachael Heyhoe Flint Trophy 24 hours later. “It’s been quite a fun few days,” she said. “I went to some club cricket on Saturday and remembered how wonderful cricket is in its actual true form, which put me in quite a nice position. “I’ve tried to bring that (attitude) into here. If I put pressure on myself that’s when it tends to go a bit t*ts up. It was just remembering how relaxed I was when I was playing club cricket. “I was watching mates I used to play with when I was 15 and just see people play just for the fun – you retire after (scoring) 30 and if you haven’t made 30 after 10 overs, you got bunked off as well. “On Sunday, I was just envisioning playing on that little club ground and remember how stress-free it was. I think that really helped calm my brain down and not let Alice get in the way of Alice.” Davidson-Richards, who was drafted in for the lone Ashes Test but went unused, initially put off answering the phone call that would have informed her of her England recall as she was out cycling. “I could see it coming, I was like ‘I’ll just deal with this afterwards’,” she said. “I was out on the bike ride in the countryside, it was quite hilly.” Davidson-Richards and Charlie Dean were England’s only changes from the side that thumped Sri Lanka by seven wickets. The tourists were coincidentally all out for 106 in the north-east on Saturday. Off-spinner Dean also impressed with figures of 7-3-12-2, including the key wicket of Sri Lanka captain Chamari Athapaththu, whose run-a-ball 34 was ended after being beaten by an arm ball and given lbw. Sri Lanka were 53 for two after nine overs but Athapaththu’s dismissal before the end of the powerplay took the wind out of the tourists’ sails and they gradually unravelled before rain had the final say. Lauren Filer also took a two wickets, with England’s fringe players, having been given an opportunity in these white-ball matches at the end of the summer, building a case for increasing involvement. “The best teams come from environments where there’s a lot of competition for places,” Davidson-Richards said. “You don’t want the same people being picked every single time, you want people pushing the XI that are there. I’m doing my job if I’m making it difficult for them to pick an XI. “Charlie Dean is exactly the same, if you’re leaving her out then you’re probably in quite a good place because she’s an unbelievable player. “The more people we can get up to that level, the better for the England team and we’ll keep pushing each other on.” As for what she is expecting when the teams head to Grace Road for Thursday’s final ODI, Davidson-Richards added: “Hopefully similar but without rain. “This was really frustrating. It’s frustrating we got ourselves into a really great position only for it to rain.”","pubDate":"2023-09-12 18:10:48","image_url":"https://www.times-series.co.uk/resources/images/17220688/?type=app&htype=0","source_id":"time_series","source_priority":668753,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"19849756b83cea5a6af66c2acac24b69","title":"Alice Davidson-Richards says England ‘really frustrated’ as rain ruins ODI","link":"https://www.andoveradvertiser.co.uk/sport/national/23785407.alice-davidson-richards-says-england-really-frustrated-rain-ruins-odi/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"Davidson-Richards and Charlie Dean were England’s only changes from the side that thumped Sri Lanka by seven wickets in the series opener.","content":"The all-rounder took a couple of wickets in her first England appearance in nine months as Sri Lanka were left teetering on 106 for nine after 30.5 overs before rain wiped out any more prospect of play. Despite a “really frustrating” outcome – with England denied the chance to move into an unassailable 2-0 lead in the three-match series – Davidson-Richards is happy to be back in the international ranks. She joined the group on Monday after gaining some perspective over the weekend, watching a club cricket game on Saturday which freed her up to make a ton in the Rachael Heyhoe Flint Trophy 24 hours later. “It’s been quite a fun few days,” she said. “I went to some club cricket on Saturday and remembered how wonderful cricket is in its actual true form, which put me in quite a nice position. “I’ve tried to bring that (attitude) into here. If I put pressure on myself that’s when it tends to go a bit t*ts up. It was just remembering how relaxed I was when I was playing club cricket. “I was watching mates I used to play with when I was 15 and just see people play just for the fun – you retire after (scoring) 30 and if you haven’t made 30 after 10 overs, you got bunked off as well. “On Sunday, I was just envisioning playing on that little club ground and remember how stress-free it was. I think that really helped calm my brain down and not let Alice get in the way of Alice.” Davidson-Richards, who was drafted in for the lone Ashes Test but went unused, initially put off answering the phone call that would have informed her of her England recall as she was out cycling. “I could see it coming, I was like ‘I’ll just deal with this afterwards’,” she said. “I was out on the bike ride in the countryside, it was quite hilly.” Davidson-Richards and Charlie Dean were England’s only changes from the side that thumped Sri Lanka by seven wickets. The tourists were coincidentally all out for 106 in the north-east on Saturday. Off-spinner Dean also impressed with figures of 7-3-12-2, including the key wicket of Sri Lanka captain Chamari Athapaththu, whose run-a-ball 34 was ended after being beaten by an arm ball and given lbw. Wickets falling at Northants 😍 She does it all, Charlie Dean 👏 — England Cricket (@englandcricket) Sri Lanka were 53 for two after nine overs but Athapaththu’s dismissal before the end of the powerplay took the wind out of the tourists’ sails and they gradually unravelled before rain had the final say. Lauren Filer also took a two wickets, with England’s fringe players, having been given an opportunity in these white-ball matches at the end of the summer, building a case for increasing involvement. “The best teams come from environments where there’s a lot of competition for places,” Davidson-Richards said. “You don’t want the same people being picked every single time, you want people pushing the XI that are there. I’m doing my job if I’m making it difficult for them to pick an XI. “Charlie Dean is exactly the same, if you’re leaving her out then you’re probably in quite a good place because she’s an unbelievable player. “The more people we can get up to that level, the better for the England team and we’ll keep pushing each other on.” As for what she is expecting when the teams head to Grace Road for Thursday’s final ODI, Davidson-Richards added: “Hopefully similar but without rain. “This was really frustrating. It’s frustrating we got ourselves into a really great position only for it to rain.”","pubDate":"2023-09-12 18:10:48","image_url":"https://www.andoveradvertiser.co.uk/resources/images/17220688/?type=app&htype=0","source_id":"andoveradvertiser","source_priority":6475270,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"eb5c682a03b3981608548432e6ab9f4f","title":"Alice Davidson-Richards says England ‘really frustrated’ as rain ruins ODI","link":"https://www.watfordobserver.co.uk/sport/national/23785407.alice-davidson-richards-says-england-really-frustrated-rain-ruins-odi/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"Davidson-Richards and Charlie Dean were England’s only changes from the side that thumped Sri Lanka by seven wickets in the series opener.","content":"The all-rounder took a couple of wickets in her first England appearance in nine months as Sri Lanka were left teetering on 106 for nine after 30.5 overs before rain wiped out any more prospect of play. Despite a “really frustrating” outcome – with England denied the chance to move into an unassailable 2-0 lead in the three-match series – Davidson-Richards is happy to be back in the international ranks. She joined the group on Monday after gaining some perspective over the weekend, watching a club cricket game on Saturday which freed her up to make a ton in the Rachael Heyhoe Flint Trophy 24 hours later. “It’s been quite a fun few days,” she said. “I went to some club cricket on Saturday and remembered how wonderful cricket is in its actual true form, which put me in quite a nice position. “I’ve tried to bring that (attitude) into here. If I put pressure on myself that’s when it tends to go a bit t*ts up. It was just remembering how relaxed I was when I was playing club cricket. “I was watching mates I used to play with when I was 15 and just see people play just for the fun – you retire after (scoring) 30 and if you haven’t made 30 after 10 overs, you got bunked off as well. “On Sunday, I was just envisioning playing on that little club ground and remember how stress-free it was. I think that really helped calm my brain down and not let Alice get in the way of Alice.” Davidson-Richards, who was drafted in for the lone Ashes Test but went unused, initially put off answering the phone call that would have informed her of her England recall as she was out cycling. “I could see it coming, I was like ‘I’ll just deal with this afterwards’,” she said. “I was out on the bike ride in the countryside, it was quite hilly.” Davidson-Richards and Charlie Dean were England’s only changes from the side that thumped Sri Lanka by seven wickets. The tourists were coincidentally all out for 106 in the north-east on Saturday. Off-spinner Dean also impressed with figures of 7-3-12-2, including the key wicket of Sri Lanka captain Chamari Athapaththu, whose run-a-ball 34 was ended after being beaten by an arm ball and given lbw. Wickets falling at Northants 😍 She does it all, Charlie Dean 👏 — England Cricket (@englandcricket) Sri Lanka were 53 for two after nine overs but Athapaththu’s dismissal before the end of the powerplay took the wind out of the tourists’ sails and they gradually unravelled before rain had the final say. Lauren Filer also took a two wickets, with England’s fringe players, having been given an opportunity in these white-ball matches at the end of the summer, building a case for increasing involvement. “The best teams come from environments where there’s a lot of competition for places,” Davidson-Richards said. “You don’t want the same people being picked every single time, you want people pushing the XI that are there. I’m doing my job if I’m making it difficult for them to pick an XI. “Charlie Dean is exactly the same, if you’re leaving her out then you’re probably in quite a good place because she’s an unbelievable player. “The more people we can get up to that level, the better for the England team and we’ll keep pushing each other on.” As for what she is expecting when the teams head to Grace Road for Thursday’s final ODI, Davidson-Richards added: “Hopefully similar but without rain. “This was really frustrating. It’s frustrating we got ourselves into a really great position only for it to rain.”","pubDate":"2023-09-12 18:10:48","image_url":"https://www.watfordobserver.co.uk/resources/images/17220688/?type=app&htype=0","source_id":"watfordobserver","source_priority":435041,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"08965aec730ddf6e7595c63e1bf4eeb1","title":"Dunith Wellalage sets records ablaze with magical spell","link":"https://thenorthlines.com/dunith-wellalage-sets-records-ablaze-with-magical-spell/","keywords":["Cricket","Sports"],"creator":["Northlines"],"video_url":null,"description":"Agencies Dunith Wellalage has always been marked for bigger things on a cricket field in Lankan circles, and on Tuesday he underlined his credentials with a brilliant five-for against India in the Asia Cup Super 4 match in Colombo. Those who know Wellalage would not have been surprised one bit as cricket is in the […] The post Dunith Wellalage sets records ablaze with magical spell appeared first on Northlines.","content":"Agencies Dunith Wellalage has always been marked for bigger things on a cricket field in Lankan circles, and on Tuesday he underlined his credentials with a brilliant five-for against India in the Asia Cup Super 4 match in Colombo. Those who know Wellalage would not have been surprised one bit as cricket is in the blood of the 20-year-old, who hails from Moratuwa, the fertile cricket base of Sri Lanka. His father Suranga Wellalage was a wicketkeeper batsman himself, and had once appeared in a few matches for the Prince of Wales team before diverting his career. But it was his son's destiny to climb the ladder, and represent the country from age-group to top-flight cricket. “I first saw him in a school match while he was playing for St Sebastian's. The boy had wonderful timing and was a natural talent. He was very handy with the ball too,” said Roger Wijesuriya, the former Sri Lankan cricketer. Soon, Wellalage shifted his base to St Joseph's College in Colombo seeking a better, more established cricket facility. The school has an illustrious alumni list that includes Sri Lankan cricketers like Angelo Mathews, Dimuth Karunaratne and Thissara Perera. “Once he enrolled into the school, we decided to give him as much opportunity to grow as a cricketer. He was a hard-working kid with a clear vision about his career. “We just helped him along, and he was a heavy-scorer and took wickets regularly for his school side. He was easily a step or two ahead of other boys around,” said Wijesuriya who mentored and coached Wellalage at the school. However, Wellalage first made an impression at a big stage during the U-19 World Cup in the West Indies. That tournament had given the cricketing world several talented kids apart from Wellalage. The likes of Dewald Brevis and Indian youngsters Yash Dhull and Raj Angad Bawa hogged limelight in that tournament. “Yeah! It was a breakout tournament for him. It gave him the confidence that he can do well for his country on big stages. It kind of mentally prepared him as he always had the skills,” he said. In that U-19 World Cup, Wellalage emerged the highest wicket-taker, grabbing 17 wickets from six matches, besides scoring 264 runs with a hundred. Wellalage also became the first Sri Lankan captain to score a hundred in the Under-19 World Cup during that tournament. The Sri Lanka senior team debut did not take long as he was given the cap during the first ODI against Australia at Pallekele earlier this June. His maiden international wicket was Steve Smith, no less. Now at the Premadasa Stadium, Wellalage has added some more hefty names to that list – Rohit Sharma, Virat Kohli, KL Rahul, Hardik Pandya and Shubman Gill. “He has made a good beginning. But he still has a long way to go. But I am sure that this boy is the future flag-bearer of Sri Lankan cricket,” said Wijesuriya, who has seen several young talents up close.The post Dunith Wellalage sets records ablaze with magical spell appeared first on Northlines.","pubDate":"2023-09-12 17:47:26","image_url":null,"source_id":"thenorthlines","source_priority":2728360,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"35a29ab98d802182c4e7cd7f79b825eb","title":"India beat Sri Lanka by 41 runs in super four match to enter final of Asia Cup","link":"http://www.newindianexpress.com/sport/cricket/2023/sep/12/india-beat-sri-lanka-by-41-runs-in-super-four-match-to-enter-final-of-asia-cup-2614200.html","keywords":null,"creator":null,"video_url":null,"description":"India defeated Sri Lanka by 41 runs in a super four match to secure their place in the final of the Asia Cup here on Tuesday. COLOMBO: Indian bowlers produced a splendid collective effort to carry their team to a 41-run win over a spirited Sri Lanka in a Super 4 match, and into the Asia Cup final here on Tuesday. Rohit Sharma's fifty (53 off 48 balls) was the cornerstone of India's sub-par 213 after Lankan spinners Dunith Wellalage (5/40) and Charith Asalanka (4/18) bamboozled them. But India, guided by Kuldeep Yadav's 4 for 43, bowled out Sri Lanka for 172. India, who entered the final with four points, will either face Sri Lanka or Pakistan in the summit clash on Sunday. The hosts will face Pakistan in a crunch match on Thursday. The insipid effort of their batsmen made it mandatory for the Indian bowlers to be on the money from ball one, and Jasprit Bumrah led the way. Bumrah took the ball away from Pathum Nissanka and the healthy edge was snaffled behind the wicket by a diving KL Rahul. Kusal Mendis looked in fine touch but he failed to keep his drive off a slow, full delivery from Bumrah down. Substitute fielder Suryakumar Yadav took the catch at covers and umpires gave Mendis out after a quick check with the TV umpire for bump ball. Mohammed Siraj soon got into act, cramping Dimuth Karunaratne for room and his cut did not go beyond Shubman Gill at second slip. Sri Lanka were 25 for 3 at that stage and Kuldeep took a couple of quick wickets to further dent their chase, reducing them to 99 for six. However, Wellalage (42 not out) and Dhananjaya de Silva (41 off 66 balls) added 63 runs for an enterprising seventh wicket alliance to revive Lankan hopes. But a moment of indiscretion ended the stand as De Silva tried to clear the infield off Jadeja only to give a simple catch to Gill at the edge of the circle. From that point, Wellalage, who batted exceptionally well under pressure against a fancied opponent, tried to bridge the gap. But the task was a tad too hard to achieve with a one man show. Earlier, left-arm spinner Wellalage and offie Asalanka did not allow Indian batters to settle into any sort of rhythm, as they knifed through their line-up taking nine wickets among them. But before Lankan spinners exploited the generous turn and grip on the Premadasa pitch, India started their innings in a blazing fashion. Rohit added 80 runs for the opening wicket with Gill, and that remained the brightest phase of Indian innings. Watching Rohit and Gill adding those runs in just 12 overs rekindled the memories of India's blitz against Pakistan on Monday, when they posted a massive 356 for two. During his innings, the Indian captain also went past a significant personal milestone, becoming the sixth Indian batsmen to score 10000 runs in ODIs. The landmark came in a befitting fashion too, as Rohit lifted pacer Kasun Rajita over his head for a majestic six. Other Indian batsmen to reach the mark are: Sachin Tendulkar, Sourav Ganguly, Rahul Dravid, Virat Kohli and MS Dhoni. Indeed, a magnificent company to be in! However, the introduction of Wellalage changed the whole complexion of the game, as the spinner halted Indian batsmen's early charge. Gill was the first batsman to depart. The opener played a forward defence without entirely covering the line and once the ball beat his bat, Gill's fate was sealed. Wellalage, a former under-19 captain of his country, then went on to show why he has been spoken so highly in Lankan cricketing circles. The 20-year-old bowled a straight, quick delivery and Rohit could not bring his bat down on time, as the ball rearranged his timber. But Wellalage wasn't finished. He added the wickets of Virat Kohli, KL Rahul, who added 63 runs for the seventh wicket with Ishan Kishan, and Hardik Pandya to his kitty for his maiden five-wicket haul in ODI cricket. None of the following batsmen could effectively negate the uneven bounce and turn on the pitch, as Asalanka wreaked havoc in India's middle and late order. His delivery to dismiss Ravindra Jadeja would carry a lot of repeat value. The ball reared from the length, turned and bounced viciously to take an edge of Jadeja's bat before nestling in stumper Kusal Mendis' gloves. India inched past the 200-run mark as Axar Patel made a precious 26, and the total proved just enough on the night.","content":"COLOMBO: Indian bowlers produced a splendid collective effort to carry their team to a 41-run win over a spirited Sri Lanka in a Super 4 match, and into the Asia Cup final here on Tuesday. Rohit Sharma's fifty (53 off 48 balls) was the cornerstone of India's sub-par 213 after Lankan spinners Dunith Wellalage (5/40) and Charith Asalanka (4/18) bamboozled them. But India, guided by Kuldeep Yadav's 4 for 43, bowled out Sri Lanka for 172. India, who entered the final with four points, will either face Sri Lanka or Pakistan in the summit clash on Sunday. The hosts will face Pakistan in a crunch match on Thursday. The insipid effort of their batsmen made it mandatory for the Indian bowlers to be on the money from ball one, and Jasprit Bumrah led the way. Bumrah took the ball away from Pathum Nissanka and the healthy edge was snaffled behind the wicket by a diving KL Rahul. Kusal Mendis looked in fine touch but he failed to keep his drive off a slow, full delivery from Bumrah down. Substitute fielder Suryakumar Yadav took the catch at covers and umpires gave Mendis out after a quick check with the TV umpire for bump ball. Mohammed Siraj soon got into act, cramping Dimuth Karunaratne for room and his cut did not go beyond Shubman Gill at second slip. Sri Lanka were 25 for 3 at that stage and Kuldeep took a couple of quick wickets to further dent their chase, reducing them to 99 for six. However, Wellalage (42 not out) and Dhananjaya de Silva (41 off 66 balls) added 63 runs for an enterprising seventh wicket alliance to revive Lankan hopes. But a moment of indiscretion ended the stand as De Silva tried to clear the infield off Jadeja only to give a simple catch to Gill at the edge of the circle. From that point, Wellalage, who batted exceptionally well under pressure against a fancied opponent, tried to bridge the gap. But the task was a tad too hard to achieve with a one man show. Earlier, left-arm spinner Wellalage and offie Asalanka did not allow Indian batters to settle into any sort of rhythm, as they knifed through their line-up taking nine wickets among them. But before Lankan spinners exploited the generous turn and grip on the Premadasa pitch, India started their innings in a blazing fashion. Rohit added 80 runs for the opening wicket with Gill, and that remained the brightest phase of Indian innings. Watching Rohit and Gill adding those runs in just 12 overs rekindled the memories of India's blitz against Pakistan on Monday, when they posted a massive 356 for two. During his innings, the Indian captain also went past a significant personal milestone, becoming the sixth Indian batsmen to score 10000 runs in ODIs. The landmark came in a befitting fashion too, as Rohit lifted pacer Kasun Rajita over his head for a majestic six. Other Indian batsmen to reach the mark are: Sachin Tendulkar, Sourav Ganguly, Rahul Dravid, Virat Kohli and MS Dhoni. Indeed, a magnificent company to be in! However, the introduction of Wellalage changed the whole complexion of the game, as the spinner halted Indian batsmen's early charge. Gill was the first batsman to depart. The opener played a forward defence without entirely covering the line and once the ball beat his bat, Gill's fate was sealed. Wellalage, a former under-19 captain of his country, then went on to show why he has been spoken so highly in Lankan cricketing circles. The 20-year-old bowled a straight, quick delivery and Rohit could not bring his bat down on time, as the ball rearranged his timber. But Wellalage wasn't finished. He added the wickets of Virat Kohli, KL Rahul, who added 63 runs for the seventh wicket with Ishan Kishan, and Hardik Pandya to his kitty for his maiden five-wicket haul in ODI cricket. None of the following batsmen could effectively negate the uneven bounce and turn on the pitch, as Asalanka wreaked havoc in India's middle and late order. His delivery to dismiss Ravindra Jadeja would carry a lot of repeat value. The ball reared from the length, turned and bounced viciously to take an edge of Jadeja's bat before nestling in stumper Kusal Mendis' gloves. India inched past the 200-run mark as Axar Patel made a precious 26, and the total proved just enough on the night.","pubDate":"2023-09-12 17:46:00","image_url":null,"source_id":"newindianexpress","source_priority":15406,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"0e451c25b1fac34a7fcd861037b5697c","title":"All Blacks v Namibia: All Blacks look to adapt after copping le boot from France at World Cup 2023","link":"https://www.nzherald.co.nz/sport/all-blacks-v-namibia-all-blacks-look-to-adapt-after-copping-le-boot-from-france-at-world-cup-2023/QZP3NJUV4ZGXBFFXDYLKCGFZZU/","keywords":null,"creator":null,"video_url":null,"description":"World rugby’s elite nations are now well-versed in the blueprint to beat the All Blacks.","content":"By Liam Napier in Lyon World rugby’s elite nations are now well-versed in the blueprint to beat the All Blacks . Slow the pace by any means necessary, minimise ball in play time, maintain discipline and kick, kick, kick. How the All Blacks adapt and adjust to these frustrating squeeze tactics could define their teetering World Cup campaign. Internal team data-driven analysis has emerged from RTE Sport’s Bernard Jackman that reveals France’s successive wins over the All Blacks, with their World Cup-opening success coming on the back of their 2021 victory in Paris, is based on tactical methods adopted by Ireland and the Springboks in recent years. Everyone who viewed the All Blacks’ opening World Cup defeat noted France’s determination to kick at almost every opportunity – even from valuable turnover possession and when attacking in the All Blacks half. French flair predominantly gave way to le boot. This strategy is based on tactics Ireland and South Africa used in victories against the All Blacks where both teams largely opted to hold the ball for no longer than 20 seconds or three phases. Teams who adopt this tactic tend to beat the All Blacks. Attacking-minded sides, such as Australia, who often retain the ball for 40 seconds or longer tend to play into the All Blacks’ hands and lose. The other less surprising statistic is that opposition who maintain their discipline, and give up seven penalties or fewer, enjoy a 75 per cent success rate against the All Blacks. France conceded four penalties in their latest victory. Watch: Can the ABs still win the World Cup? Our experts answer your questions It’s no coincidence the world’s top three ranked nations are essentially playing the All Blacks in a similar vein that centres on set piece strength, discipline, peppering the All Blacks with kicks which challenges them to make the running of the game, to counterattack and take risks from the backfield. “Teams without the ball are going a long way to winning some of these test matches at the moment. They’re kicking a lot, forcing a lot of mistakes,” All Blacks second five-eighth Jordie Barrett said astutely, noting George Ford kicked 27 points as England overcame their one-man disadvantage for 78 minutes against Argentina. Barrett offered further evidence by pointing to Wales making a World Cup-record 252 tackles in their win over Fiji. When the All Blacks defeated the Wallabies 38-7 in Melbourne this year the ball was in play for over 40 minutes. When they were humbled by South Africa at Twickenham the figure dropped to 33 minutes. The All Blacks clearly want to lift the pace and tempo at this World Cup. The heat, which imposed one water break each half on the opening weekend, hasn’t helped that desire but those measures won’t be in place as the sweltering temperatures in France ease in the coming weeks. One way to keep the ball in play more is to kick less. The All Blacks have addressed elements of their kicking against France after Ian Foster conceded his side lacked ambition during their concerning final quarter fade at Stade de France. “We found in our game there was only 27 minutes of ball in play which is pretty crazy in an 80-minute match,” Barrett said. “We’d like that number to be higher to bring fatigue into the game and potentially reduce those water breaks so we can use that to our advantage a little bit more but we’ve got to adapt. “It’s different, it’s a World Cup, and you’re going to get tested. Later on in the tournament there will be different factors and whoever adapts better on the night when it becomes sudden death will go a long way. A lot more ball in play is needed. Rugby World Cup 2023 results so far “As the tournament goes on you have to adapt against different opposition, the conditions, Northern Hemisphere teams, the referees. We’ve got to keep getting better.” The All Blacks know they won’t have it all their own way at this World Cup. They also know it won’t be the last time they confront the successful blueprint France, Ireland and South Africa have adopted. As scrum coach Greg Feek explained, playing at pace and attempting to speed up contests remains the All Blacks’ modus operandi. There are elements such as regaining forward punch they can control, though, and others they can’t. “Some of it is talking to the referee if there’s guys going down or taking time to get into a lineout. There’s certain things that contribute to that,” Feek said. “There’s water breaks as well. Yes, we would like to play more footy. We want to get our game going, get into a fast pace that suits our style that we love to play.” Dane Coles, attending his third World Cup, appreciates more than most the All Blacks must find a way through slow, kick-heavy slugfests if they are to transform their prospects. “We always back our fitness but you might not get the ball in play you want at this World Cup,” Coles said. “It comes back to holding on to the pill, being disciplined, building pressure, defending really well on our line. There’s a number of things that can help that.” Liam Napier has been a sports journalist since 2010, and his work has taken him to World Cups in rugby, netball and cricket, boxing world title fights and Commonwealth Games. Get full coverage of the Rugby World Cup .","pubDate":"2023-09-13 00:04:09","image_url":"https://www.nzherald.co.nz/resizer/GOASdVNUkRCVceWt3Pfl4F5x_5I=/300x300/smart/filters:quality(70)/cloudfront-ap-southeast-2.images.arcpublishing.com/nzme/B2ZUOVKA65H5HLJRRWZINKZ43U.JPG","source_id":"nzherald","source_priority":7971,"country":["new zealand"],"category":["sports"],"language":"english"},{"article_id":"ad683c43ad6906d0e69dc99d19e1ef64","title":"गौतम गंभीर ने श्रीलंका के खिलाफ टीम इंडिया की जीत पाकिस्तान से बेहतर बताया, जानिए वजह","link":"https://hindi.oneindia.com/news/sports/cricket/gautam-gambhir-says-win-against-sri-lanka-is-way-better-than-pakistan-818485.html","keywords":null,"creator":null,"video_url":null,"description":"श्रीलंका के खिलाफ भारत की जीत को गौतम गंभीर ने पाकिस्तान के खिलाफ जीत से बेहतर बताया है। उन्होंने कहा कि","content":"एशिया कप में सुपर फोर के मुकाबले में भारत ने पाकिस्तान के खिलाफ जबरदस्त जीत दर्ज की। मैच में जिस तरह से भारतीय बल्लेबाजों ने पहले पाकिस्तान की पेस बैटरी की क्लास लगाई और उसके बाद गेंदबाजों ने पूरी टीम को 128 रन के स्कोर पर समेट दिया, उसकी हर कोई तारीफ कर रहा है। इस जीत को ऐतिहासिक जीत माना जा रहा है और पाकिस्तान के खिलाफ अबतक की सबसे बड़ी जीत कहा जा रहा है। लेकिन पूर्व क्रिकेट गौतम गंभीर को ऐसा नहीं लगता है। जिस तरह से श्रीलंका के खिलाफ भारत ने 41 रन से जीत दर्ज की उसकी तारीफ करते हुए गौतम गंभीर ने इस जीत को पाकिस्तान के खिलाफ जीत से कहीं बेहतर कहा है। बता दें कि श्रीलंका के खिलाफ भारत ने सिर्फ 213 रन बनाए थे, लेकिन श्रीलंका की टीम सिर्फ 172 रन के ही स्कोर पर सिमट गई। टीम इंडिया की जत पर गौतम गंभीर ने कहा कि श्रीलंका के खिलाफ भारतीय टीम की जीत को पाकिस्तान के खिलाफ जीत से कहीं बेहतर बताया है। उन्होंने कहा कि कई लोग मेरी इस बात से राजी नहीं होंगे। ये जीत मेरे लिए पाकिस्तान से ज्यादा बेहतर जीत थी। यह मैच टीम को ज्यादा आत्मविश्वास देगा। 217 रन का लक्ष्य श्रीलंका में डिफेंड करना काफी मनोबल बढ़ाएगा, इसका फायदा एशिया कप के फाइनल और विश्वकप में देखने को मिलेगा। इस जीत से कप्तान रोहित शर्मा का भी भरोसा बढ़ा होगा। बता दें कि टॉस जीतकर पहले बल्लेबाजी करने उतरी भारतीय टीम की शुरुआत काफी जबरदस्त हुई। रोहित शर्मा ने जबरदस्त 53 रनों की पारी खेली। वहीं शुभमन गिल 19 रन ही बना सके। लेकिन रोहित और गिल के आउट होने के बाद विराट कोहली सिर्फ 3 रन के स्कोर पर सिमट गए। वहीं ईशान किशन ने 33 रन और केएल राहुल ने 39 रनों की पारी खेली जिसकी मदद से टीम का स्कोर 213 रन पहुंचा। हालांकि श्रीलंका के बल्लेबाजों ने अच्छा प्रदर्शन करते हुए मैच में खुद को बनाए रखा। लेकिन कुलदीप यादव ने श्रीलंका के बल्लेबाजों की अच्छी क्लास लगाई और टीम के 4 बल्लेबाजों को पवेलियन पहुंचाया। जिसकी बदौलत भारत ने मैज में 41 रन से जीत दर्ज की।","pubDate":"2023-09-12 23:20:13","image_url":null,"source_id":"oneindia","source_priority":12404,"country":["india"],"category":["sports"],"language":"hindi"},{"article_id":"3b10e987f3a778f33d2476d4f9e53bcb","title":"Dane Vilas and Luke Wells put Lancashire in front heading into final day","link":"https://www.watfordobserver.co.uk/sport/national/23785441.dane-vilas-luke-wells-put-lancashire-front-heading-final-day/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"Luke Wells fell three runs short of a hundred at Old Trafford.","content":"Vilas’ 124 and 97 from opener Luke Wells at Old Trafford laid the foundation, with George Bell’s unbeaten 56 easing the home side past the visitors’ first-innings total of 194. They ended a rain-affected day on 330 for five with Jayant Yadav and Joshua de Caires having taken two wickets each. CLOSE | We'll return tomorrow 🤝 James (38) and Clarke (61) share a stoic 39-over partnership to keep the game alive, with Notts now trailing by four. — Nottinghamshire CCC (@TrentBridge) Joe Clarke steered Nottinghamshire to within four runs of making Kent bat again after the home side enforced the follow-on at Canterbury. Clarke finished day three on 61 not out having put on 99 with number seven Lyndon James, who was unbeaten on 38, as the visitors reached 177 for five having being dismissed for 265 first time around. Aron Nijjar had earlier claimed career-best figures of four for 67 as Kent piled on the pressure after posting 446. Northamptonshire’s hopes of digging themselves out of relegation trouble were dealt a major blow as the third day of their clash with Warwickshire was washed out. 𝙂𝙀𝙏 𝙄𝙉, 𝙇𝙀𝙐𝙎!! 💯 Du Plooy goes to his century just two balls after tea! It comes off 151 balls including 13 fours. DER: 392-8; Watt (15*), leading by 15. Watch LIVE⤵️ — Derbyshire CCC (@DerbyshireCCC) Relentless rain at Edgbaston prevented them from building upon their first-innings total of 142 for four in reply to 250 as hopes of a crucial victory faded. In Division Two, Derbyshire skipper Leus du Plooy posted an unbeaten century on a day when bad light hampered the visitors’ progress at Gloucestershire. Du Plooy had resumed on 44 from a total of 261 for six and was still there on 103 at stumps, with his side having advanced to 398 for nine to hold a 21-run first-innings lead. Yorkshire’s Matthew Revis delivered career-best bowling figures of five for 50 to force Glamorgan to follow on at Sophia Gardens. Bad light ends play on Day 3 with Byrom on 52 and Northeast on 45 standing firm. Glamorgan 120/2 trailing by 107 | — Glamorgan Cricket 🏏 (@GlamCricket) The 21-year-old’s efforts helped to dismiss the home side for 273 in their first innings as they chased a total of 500. However, Glamorgan rallied before play ended five overs short because of bad light, with Eddie Byrom and Sam Northeast putting on 90 for the third wicket to take the Welsh side to 120 for two, still 107 runs adrift. An unbeaten century from Colin Ackermann kept Leicestershire in the hunt for an unlikely victory over Sussex. Ackermann was 103 not out at stumps on day three at Hove with his side on 221 for three and requiring a further 278 for victory. The home side had earlier declared on 344 for nine having added 110 to their overnight total.","pubDate":"2023-09-12 19:14:16","image_url":"https://www.watfordobserver.co.uk/resources/images/17220731/?type=app&htype=0","source_id":"watfordobserver","source_priority":435041,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"7b7618a8e8a9ecc8bd28693169061f4b","title":"Dane Vilas and Luke Wells put Lancashire in front heading into final day","link":"https://www.andoveradvertiser.co.uk/sport/national/23785441.dane-vilas-luke-wells-put-lancashire-front-heading-final-day/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"Luke Wells fell three runs short of a hundred at Old Trafford.","content":"Vilas’ 124 and 97 from opener Luke Wells at Old Trafford laid the foundation, with George Bell’s unbeaten 56 easing the home side past the visitors’ first-innings total of 194. They ended a rain-affected day on 330 for five with Jayant Yadav and Joshua de Caires having taken two wickets each. CLOSE | We'll return tomorrow 🤝 James (38) and Clarke (61) share a stoic 39-over partnership to keep the game alive, with Notts now trailing by four. — Nottinghamshire CCC (@TrentBridge) Joe Clarke steered Nottinghamshire to within four runs of making Kent bat again after the home side enforced the follow-on at Canterbury. Clarke finished day three on 61 not out having put on 99 with number seven Lyndon James, who was unbeaten on 38, as the visitors reached 177 for five having being dismissed for 265 first time around. Aron Nijjar had earlier claimed career-best figures of four for 67 as Kent piled on the pressure after posting 446. Northamptonshire’s hopes of digging themselves out of relegation trouble were dealt a major blow as the third day of their clash with Warwickshire was washed out. 𝙂𝙀𝙏 𝙄𝙉, 𝙇𝙀𝙐𝙎!! 💯 Du Plooy goes to his century just two balls after tea! It comes off 151 balls including 13 fours. DER: 392-8; Watt (15*), leading by 15. Watch LIVE⤵️ — Derbyshire CCC (@DerbyshireCCC) Relentless rain at Edgbaston prevented them from building upon their first-innings total of 142 for four in reply to 250 as hopes of a crucial victory faded. In Division Two, Derbyshire skipper Leus du Plooy posted an unbeaten century on a day when bad light hampered the visitors’ progress at Gloucestershire. Du Plooy had resumed on 44 from a total of 261 for six and was still there on 103 at stumps, with his side having advanced to 398 for nine to hold a 21-run first-innings lead. Yorkshire’s Matthew Revis delivered career-best bowling figures of five for 50 to force Glamorgan to follow on at Sophia Gardens. Bad light ends play on Day 3 with Byrom on 52 and Northeast on 45 standing firm. Glamorgan 120/2 trailing by 107 | — Glamorgan Cricket 🏏 (@GlamCricket) The 21-year-old’s efforts helped to dismiss the home side for 273 in their first innings as they chased a total of 500. However, Glamorgan rallied before play ended five overs short because of bad light, with Eddie Byrom and Sam Northeast putting on 90 for the third wicket to take the Welsh side to 120 for two, still 107 runs adrift. An unbeaten century from Colin Ackermann kept Leicestershire in the hunt for an unlikely victory over Sussex. Ackermann was 103 not out at stumps on day three at Hove with his side on 221 for three and requiring a further 278 for victory. The home side had earlier declared on 344 for nine having added 110 to their overnight total.","pubDate":"2023-09-12 19:14:16","image_url":"https://www.andoveradvertiser.co.uk/resources/images/17220731/?type=app&htype=0","source_id":"andoveradvertiser","source_priority":6475270,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"16241145a4569b4615450fd6bd3ff357","title":"Dutch court sentences ex-Pakistani cricketer to 12 years over reward for death of far-right lawmaker","link":"https://www.nzherald.co.nz/sport/dutch-court-sentences-ex-pakistani-cricketer-to-12-years-over-reward-for-death-of-far-right-lawmaker/R7ZWMBNJ2NH3ZPEPIWML4EWZCU/","keywords":null,"creator":null,"video_url":null,"description":"A Dutch court has sentenced a former Pakistani cricketer to 12 years in prison.","content":"A Dutch court has sentenced a former Pakistani cricketer to 12 years in prison over allegations that he had offered a reward for the death of firebrand anti-Islam Dutch lawmaker Geert Wilders. The suspect, identified by Wilders as Khalid Latif, is accused of offering a bounty of about 21,000 euros ($23,000) to anybody who killed Wilders. Latif did not appear in the high-security courtroom near Amsterdam’s Schiphol Airport for the trial and he was not represented by a lawyer. He is believed to be in Pakistan, which has no extradition agreement with the Netherlands. Prosecutors did not name Latif, but said in a statement that a video posted online in 2018 showed a famous Pakistan cricketer offering the money for killing Wilders. The lawmaker, who was present for the verdict, has lived under around-the-clock protection for years because of repeated threats to his life sparked by his fierce criticism of Islam. Advertisement Advertise with NZME. “The court has now ruled that a long-term unconditional term of imprisonment is the only suitable punishment for these types of offenses,” a statement said. The alleged bounty offer came after Wilders said he would organize a competition of cartoons of the Prophet Muhammad. Many Muslims consider any depictions of Muhammad to be blasphemous. Ultimately, the contest was not held, but the plan sparked outrage in the Muslim world. Wilders said he was “very happy” with the verdict. “But of course, he is not here and it’s only real justice when he will be arrested, apprehended and extradited to the Netherlands,” he said of Latif. “I lost my whole personal freedom for almost 19 years now,” Wilders said, adding that he and his wife have had to live in safe houses and military barracks. “The only freedom I have is my freedom of speech and my freedom of thought.” Advertisement Advertise with NZME. An international warrant has been issued for Latif’s arrest. Dutch prosecutors have said they have been trying to contact him since 2018, first as a witness and then to answer the charges. However, they said they hadn’t received any reply from the Pakistani authorities. In 2017, Latif was banned for five years from all forms of cricket for his role in a match-fixing scandal in the Pakistan Super League. Save share Share this article facebook copy link twitter linkedin reddit email","pubDate":"2023-09-12 18:54:26","image_url":"https://www.nzherald.co.nz/resizer/7oPbHwUgNXpwbcw6IsztUAUvhF4=/300x300/smart/filters:quality(70)/cloudfront-ap-southeast-2.images.arcpublishing.com/nzme/SSS7IMPOC5CZHNL5JIOAK5YV2Y.jpg","source_id":"nzherald","source_priority":7971,"country":["new zealand"],"category":["sports"],"language":"english"},{"article_id":"a313bd620ac5f863f725aa850d01f639","title":"Alice Davidson-Richards says England ‘really frustrated’ as rain ruins ODI","link":"https://www.times-series.co.uk/sport/national/23785407.alice-davidson-richards-says-england-really-frustrated-rain-ruins-odi/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"Davidson-Richards and Charlie Dean were England’s only changes from the side that thumped Sri Lanka by seven wickets in the series opener.","content":"The all-rounder took a couple of wickets in her first England appearance in nine months as Sri Lanka were left teetering on 106 for nine after 30.5 overs before rain wiped out any more prospect of play. Despite a “really frustrating” outcome – with England denied the chance to move into an unassailable 2-0 lead in the three-match series – Davidson-Richards is happy to be back in the international ranks. She joined the group on Monday after gaining some perspective over the weekend, watching a club cricket game on Saturday which freed her up to make a ton in the Rachael Heyhoe Flint Trophy 24 hours later. “It’s been quite a fun few days,” she said. “I went to some club cricket on Saturday and remembered how wonderful cricket is in its actual true form, which put me in quite a nice position. “I’ve tried to bring that (attitude) into here. If I put pressure on myself that’s when it tends to go a bit t*ts up. It was just remembering how relaxed I was when I was playing club cricket. “I was watching mates I used to play with when I was 15 and just see people play just for the fun – you retire after (scoring) 30 and if you haven’t made 30 after 10 overs, you got bunked off as well. “On Sunday, I was just envisioning playing on that little club ground and remember how stress-free it was. I think that really helped calm my brain down and not let Alice get in the way of Alice.” Davidson-Richards, who was drafted in for the lone Ashes Test but went unused, initially put off answering the phone call that would have informed her of her England recall as she was out cycling. “I could see it coming, I was like ‘I’ll just deal with this afterwards’,” she said. “I was out on the bike ride in the countryside, it was quite hilly.” Davidson-Richards and Charlie Dean were England’s only changes from the side that thumped Sri Lanka by seven wickets. The tourists were coincidentally all out for 106 in the north-east on Saturday. Off-spinner Dean also impressed with figures of 7-3-12-2, including the key wicket of Sri Lanka captain Chamari Athapaththu, whose run-a-ball 34 was ended after being beaten by an arm ball and given lbw. Sri Lanka were 53 for two after nine overs but Athapaththu’s dismissal before the end of the powerplay took the wind out of the tourists’ sails and they gradually unravelled before rain had the final say. Lauren Filer also took a two wickets, with England’s fringe players, having been given an opportunity in these white-ball matches at the end of the summer, building a case for increasing involvement. “The best teams come from environments where there’s a lot of competition for places,” Davidson-Richards said. “You don’t want the same people being picked every single time, you want people pushing the XI that are there. I’m doing my job if I’m making it difficult for them to pick an XI. “Charlie Dean is exactly the same, if you’re leaving her out then you’re probably in quite a good place because she’s an unbelievable player. “The more people we can get up to that level, the better for the England team and we’ll keep pushing each other on.” As for what she is expecting when the teams head to Grace Road for Thursday’s final ODI, Davidson-Richards added: “Hopefully similar but without rain. “This was really frustrating. It’s frustrating we got ourselves into a really great position only for it to rain.”","pubDate":"2023-09-12 18:10:48","image_url":"https://www.times-series.co.uk/resources/images/17220688/?type=app&htype=0","source_id":"time_series","source_priority":668753,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"19849756b83cea5a6af66c2acac24b69","title":"Alice Davidson-Richards says England ‘really frustrated’ as rain ruins ODI","link":"https://www.andoveradvertiser.co.uk/sport/national/23785407.alice-davidson-richards-says-england-really-frustrated-rain-ruins-odi/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"Davidson-Richards and Charlie Dean were England’s only changes from the side that thumped Sri Lanka by seven wickets in the series opener.","content":"The all-rounder took a couple of wickets in her first England appearance in nine months as Sri Lanka were left teetering on 106 for nine after 30.5 overs before rain wiped out any more prospect of play. Despite a “really frustrating” outcome – with England denied the chance to move into an unassailable 2-0 lead in the three-match series – Davidson-Richards is happy to be back in the international ranks. She joined the group on Monday after gaining some perspective over the weekend, watching a club cricket game on Saturday which freed her up to make a ton in the Rachael Heyhoe Flint Trophy 24 hours later. “It’s been quite a fun few days,” she said. “I went to some club cricket on Saturday and remembered how wonderful cricket is in its actual true form, which put me in quite a nice position. “I’ve tried to bring that (attitude) into here. If I put pressure on myself that’s when it tends to go a bit t*ts up. It was just remembering how relaxed I was when I was playing club cricket. “I was watching mates I used to play with when I was 15 and just see people play just for the fun – you retire after (scoring) 30 and if you haven’t made 30 after 10 overs, you got bunked off as well. “On Sunday, I was just envisioning playing on that little club ground and remember how stress-free it was. I think that really helped calm my brain down and not let Alice get in the way of Alice.” Davidson-Richards, who was drafted in for the lone Ashes Test but went unused, initially put off answering the phone call that would have informed her of her England recall as she was out cycling. “I could see it coming, I was like ‘I’ll just deal with this afterwards’,” she said. “I was out on the bike ride in the countryside, it was quite hilly.” Davidson-Richards and Charlie Dean were England’s only changes from the side that thumped Sri Lanka by seven wickets. The tourists were coincidentally all out for 106 in the north-east on Saturday. Off-spinner Dean also impressed with figures of 7-3-12-2, including the key wicket of Sri Lanka captain Chamari Athapaththu, whose run-a-ball 34 was ended after being beaten by an arm ball and given lbw. Wickets falling at Northants 😍 She does it all, Charlie Dean 👏 — England Cricket (@englandcricket) Sri Lanka were 53 for two after nine overs but Athapaththu’s dismissal before the end of the powerplay took the wind out of the tourists’ sails and they gradually unravelled before rain had the final say. Lauren Filer also took a two wickets, with England’s fringe players, having been given an opportunity in these white-ball matches at the end of the summer, building a case for increasing involvement. “The best teams come from environments where there’s a lot of competition for places,” Davidson-Richards said. “You don’t want the same people being picked every single time, you want people pushing the XI that are there. I’m doing my job if I’m making it difficult for them to pick an XI. “Charlie Dean is exactly the same, if you’re leaving her out then you’re probably in quite a good place because she’s an unbelievable player. “The more people we can get up to that level, the better for the England team and we’ll keep pushing each other on.” As for what she is expecting when the teams head to Grace Road for Thursday’s final ODI, Davidson-Richards added: “Hopefully similar but without rain. “This was really frustrating. It’s frustrating we got ourselves into a really great position only for it to rain.”","pubDate":"2023-09-12 18:10:48","image_url":"https://www.andoveradvertiser.co.uk/resources/images/17220688/?type=app&htype=0","source_id":"andoveradvertiser","source_priority":6475270,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"eb5c682a03b3981608548432e6ab9f4f","title":"Alice Davidson-Richards says England ‘really frustrated’ as rain ruins ODI","link":"https://www.watfordobserver.co.uk/sport/national/23785407.alice-davidson-richards-says-england-really-frustrated-rain-ruins-odi/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"Davidson-Richards and Charlie Dean were England’s only changes from the side that thumped Sri Lanka by seven wickets in the series opener.","content":"The all-rounder took a couple of wickets in her first England appearance in nine months as Sri Lanka were left teetering on 106 for nine after 30.5 overs before rain wiped out any more prospect of play. Despite a “really frustrating” outcome – with England denied the chance to move into an unassailable 2-0 lead in the three-match series – Davidson-Richards is happy to be back in the international ranks. She joined the group on Monday after gaining some perspective over the weekend, watching a club cricket game on Saturday which freed her up to make a ton in the Rachael Heyhoe Flint Trophy 24 hours later. “It’s been quite a fun few days,” she said. “I went to some club cricket on Saturday and remembered how wonderful cricket is in its actual true form, which put me in quite a nice position. “I’ve tried to bring that (attitude) into here. If I put pressure on myself that’s when it tends to go a bit t*ts up. It was just remembering how relaxed I was when I was playing club cricket. “I was watching mates I used to play with when I was 15 and just see people play just for the fun – you retire after (scoring) 30 and if you haven’t made 30 after 10 overs, you got bunked off as well. “On Sunday, I was just envisioning playing on that little club ground and remember how stress-free it was. I think that really helped calm my brain down and not let Alice get in the way of Alice.” Davidson-Richards, who was drafted in for the lone Ashes Test but went unused, initially put off answering the phone call that would have informed her of her England recall as she was out cycling. “I could see it coming, I was like ‘I’ll just deal with this afterwards’,” she said. “I was out on the bike ride in the countryside, it was quite hilly.” Davidson-Richards and Charlie Dean were England’s only changes from the side that thumped Sri Lanka by seven wickets. The tourists were coincidentally all out for 106 in the north-east on Saturday. Off-spinner Dean also impressed with figures of 7-3-12-2, including the key wicket of Sri Lanka captain Chamari Athapaththu, whose run-a-ball 34 was ended after being beaten by an arm ball and given lbw. Wickets falling at Northants 😍 She does it all, Charlie Dean 👏 — England Cricket (@englandcricket) Sri Lanka were 53 for two after nine overs but Athapaththu’s dismissal before the end of the powerplay took the wind out of the tourists’ sails and they gradually unravelled before rain had the final say. Lauren Filer also took a two wickets, with England’s fringe players, having been given an opportunity in these white-ball matches at the end of the summer, building a case for increasing involvement. “The best teams come from environments where there’s a lot of competition for places,” Davidson-Richards said. “You don’t want the same people being picked every single time, you want people pushing the XI that are there. I’m doing my job if I’m making it difficult for them to pick an XI. “Charlie Dean is exactly the same, if you’re leaving her out then you’re probably in quite a good place because she’s an unbelievable player. “The more people we can get up to that level, the better for the England team and we’ll keep pushing each other on.” As for what she is expecting when the teams head to Grace Road for Thursday’s final ODI, Davidson-Richards added: “Hopefully similar but without rain. “This was really frustrating. It’s frustrating we got ourselves into a really great position only for it to rain.”","pubDate":"2023-09-12 18:10:48","image_url":"https://www.watfordobserver.co.uk/resources/images/17220688/?type=app&htype=0","source_id":"watfordobserver","source_priority":435041,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"08965aec730ddf6e7595c63e1bf4eeb1","title":"Dunith Wellalage sets records ablaze with magical spell","link":"https://thenorthlines.com/dunith-wellalage-sets-records-ablaze-with-magical-spell/","keywords":["Cricket","Sports"],"creator":["Northlines"],"video_url":null,"description":"Agencies Dunith Wellalage has always been marked for bigger things on a cricket field in Lankan circles, and on Tuesday he underlined his credentials with a brilliant five-for against India in the Asia Cup Super 4 match in Colombo. Those who know Wellalage would not have been surprised one bit as cricket is in the […] The post Dunith Wellalage sets records ablaze with magical spell appeared first on Northlines.","content":"Agencies Dunith Wellalage has always been marked for bigger things on a cricket field in Lankan circles, and on Tuesday he underlined his credentials with a brilliant five-for against India in the Asia Cup Super 4 match in Colombo. Those who know Wellalage would not have been surprised one bit as cricket is in the blood of the 20-year-old, who hails from Moratuwa, the fertile cricket base of Sri Lanka. His father Suranga Wellalage was a wicketkeeper batsman himself, and had once appeared in a few matches for the Prince of Wales team before diverting his career. But it was his son's destiny to climb the ladder, and represent the country from age-group to top-flight cricket. “I first saw him in a school match while he was playing for St Sebastian's. The boy had wonderful timing and was a natural talent. He was very handy with the ball too,” said Roger Wijesuriya, the former Sri Lankan cricketer. Soon, Wellalage shifted his base to St Joseph's College in Colombo seeking a better, more established cricket facility. The school has an illustrious alumni list that includes Sri Lankan cricketers like Angelo Mathews, Dimuth Karunaratne and Thissara Perera. “Once he enrolled into the school, we decided to give him as much opportunity to grow as a cricketer. He was a hard-working kid with a clear vision about his career. “We just helped him along, and he was a heavy-scorer and took wickets regularly for his school side. He was easily a step or two ahead of other boys around,” said Wijesuriya who mentored and coached Wellalage at the school. However, Wellalage first made an impression at a big stage during the U-19 World Cup in the West Indies. That tournament had given the cricketing world several talented kids apart from Wellalage. The likes of Dewald Brevis and Indian youngsters Yash Dhull and Raj Angad Bawa hogged limelight in that tournament. “Yeah! It was a breakout tournament for him. It gave him the confidence that he can do well for his country on big stages. It kind of mentally prepared him as he always had the skills,” he said. In that U-19 World Cup, Wellalage emerged the highest wicket-taker, grabbing 17 wickets from six matches, besides scoring 264 runs with a hundred. Wellalage also became the first Sri Lankan captain to score a hundred in the Under-19 World Cup during that tournament. The Sri Lanka senior team debut did not take long as he was given the cap during the first ODI against Australia at Pallekele earlier this June. His maiden international wicket was Steve Smith, no less. Now at the Premadasa Stadium, Wellalage has added some more hefty names to that list – Rohit Sharma, Virat Kohli, KL Rahul, Hardik Pandya and Shubman Gill. “He has made a good beginning. But he still has a long way to go. But I am sure that this boy is the future flag-bearer of Sri Lankan cricket,” said Wijesuriya, who has seen several young talents up close.The post Dunith Wellalage sets records ablaze with magical spell appeared first on Northlines.","pubDate":"2023-09-12 17:47:26","image_url":null,"source_id":"thenorthlines","source_priority":2728360,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"35a29ab98d802182c4e7cd7f79b825eb","title":"India beat Sri Lanka by 41 runs in super four match to enter final of Asia Cup","link":"http://www.newindianexpress.com/sport/cricket/2023/sep/12/india-beat-sri-lanka-by-41-runs-in-super-four-match-to-enter-final-of-asia-cup-2614200.html","keywords":null,"creator":null,"video_url":null,"description":"India defeated Sri Lanka by 41 runs in a super four match to secure their place in the final of the Asia Cup here on Tuesday. COLOMBO: Indian bowlers produced a splendid collective effort to carry their team to a 41-run win over a spirited Sri Lanka in a Super 4 match, and into the Asia Cup final here on Tuesday. Rohit Sharma's fifty (53 off 48 balls) was the cornerstone of India's sub-par 213 after Lankan spinners Dunith Wellalage (5/40) and Charith Asalanka (4/18) bamboozled them. But India, guided by Kuldeep Yadav's 4 for 43, bowled out Sri Lanka for 172. India, who entered the final with four points, will either face Sri Lanka or Pakistan in the summit clash on Sunday. The hosts will face Pakistan in a crunch match on Thursday. The insipid effort of their batsmen made it mandatory for the Indian bowlers to be on the money from ball one, and Jasprit Bumrah led the way. Bumrah took the ball away from Pathum Nissanka and the healthy edge was snaffled behind the wicket by a diving KL Rahul. Kusal Mendis looked in fine touch but he failed to keep his drive off a slow, full delivery from Bumrah down. Substitute fielder Suryakumar Yadav took the catch at covers and umpires gave Mendis out after a quick check with the TV umpire for bump ball. Mohammed Siraj soon got into act, cramping Dimuth Karunaratne for room and his cut did not go beyond Shubman Gill at second slip. Sri Lanka were 25 for 3 at that stage and Kuldeep took a couple of quick wickets to further dent their chase, reducing them to 99 for six. However, Wellalage (42 not out) and Dhananjaya de Silva (41 off 66 balls) added 63 runs for an enterprising seventh wicket alliance to revive Lankan hopes. But a moment of indiscretion ended the stand as De Silva tried to clear the infield off Jadeja only to give a simple catch to Gill at the edge of the circle. From that point, Wellalage, who batted exceptionally well under pressure against a fancied opponent, tried to bridge the gap. But the task was a tad too hard to achieve with a one man show. Earlier, left-arm spinner Wellalage and offie Asalanka did not allow Indian batters to settle into any sort of rhythm, as they knifed through their line-up taking nine wickets among them. But before Lankan spinners exploited the generous turn and grip on the Premadasa pitch, India started their innings in a blazing fashion. Rohit added 80 runs for the opening wicket with Gill, and that remained the brightest phase of Indian innings. Watching Rohit and Gill adding those runs in just 12 overs rekindled the memories of India's blitz against Pakistan on Monday, when they posted a massive 356 for two. During his innings, the Indian captain also went past a significant personal milestone, becoming the sixth Indian batsmen to score 10000 runs in ODIs. The landmark came in a befitting fashion too, as Rohit lifted pacer Kasun Rajita over his head for a majestic six. Other Indian batsmen to reach the mark are: Sachin Tendulkar, Sourav Ganguly, Rahul Dravid, Virat Kohli and MS Dhoni. Indeed, a magnificent company to be in! However, the introduction of Wellalage changed the whole complexion of the game, as the spinner halted Indian batsmen's early charge. Gill was the first batsman to depart. The opener played a forward defence without entirely covering the line and once the ball beat his bat, Gill's fate was sealed. Wellalage, a former under-19 captain of his country, then went on to show why he has been spoken so highly in Lankan cricketing circles. The 20-year-old bowled a straight, quick delivery and Rohit could not bring his bat down on time, as the ball rearranged his timber. But Wellalage wasn't finished. He added the wickets of Virat Kohli, KL Rahul, who added 63 runs for the seventh wicket with Ishan Kishan, and Hardik Pandya to his kitty for his maiden five-wicket haul in ODI cricket. None of the following batsmen could effectively negate the uneven bounce and turn on the pitch, as Asalanka wreaked havoc in India's middle and late order. His delivery to dismiss Ravindra Jadeja would carry a lot of repeat value. The ball reared from the length, turned and bounced viciously to take an edge of Jadeja's bat before nestling in stumper Kusal Mendis' gloves. India inched past the 200-run mark as Axar Patel made a precious 26, and the total proved just enough on the night.","content":"COLOMBO: Indian bowlers produced a splendid collective effort to carry their team to a 41-run win over a spirited Sri Lanka in a Super 4 match, and into the Asia Cup final here on Tuesday. Rohit Sharma's fifty (53 off 48 balls) was the cornerstone of India's sub-par 213 after Lankan spinners Dunith Wellalage (5/40) and Charith Asalanka (4/18) bamboozled them. But India, guided by Kuldeep Yadav's 4 for 43, bowled out Sri Lanka for 172. India, who entered the final with four points, will either face Sri Lanka or Pakistan in the summit clash on Sunday. The hosts will face Pakistan in a crunch match on Thursday. The insipid effort of their batsmen made it mandatory for the Indian bowlers to be on the money from ball one, and Jasprit Bumrah led the way. Bumrah took the ball away from Pathum Nissanka and the healthy edge was snaffled behind the wicket by a diving KL Rahul. Kusal Mendis looked in fine touch but he failed to keep his drive off a slow, full delivery from Bumrah down. Substitute fielder Suryakumar Yadav took the catch at covers and umpires gave Mendis out after a quick check with the TV umpire for bump ball. Mohammed Siraj soon got into act, cramping Dimuth Karunaratne for room and his cut did not go beyond Shubman Gill at second slip. Sri Lanka were 25 for 3 at that stage and Kuldeep took a couple of quick wickets to further dent their chase, reducing them to 99 for six. However, Wellalage (42 not out) and Dhananjaya de Silva (41 off 66 balls) added 63 runs for an enterprising seventh wicket alliance to revive Lankan hopes. But a moment of indiscretion ended the stand as De Silva tried to clear the infield off Jadeja only to give a simple catch to Gill at the edge of the circle. From that point, Wellalage, who batted exceptionally well under pressure against a fancied opponent, tried to bridge the gap. But the task was a tad too hard to achieve with a one man show. Earlier, left-arm spinner Wellalage and offie Asalanka did not allow Indian batters to settle into any sort of rhythm, as they knifed through their line-up taking nine wickets among them. But before Lankan spinners exploited the generous turn and grip on the Premadasa pitch, India started their innings in a blazing fashion. Rohit added 80 runs for the opening wicket with Gill, and that remained the brightest phase of Indian innings. Watching Rohit and Gill adding those runs in just 12 overs rekindled the memories of India's blitz against Pakistan on Monday, when they posted a massive 356 for two. During his innings, the Indian captain also went past a significant personal milestone, becoming the sixth Indian batsmen to score 10000 runs in ODIs. The landmark came in a befitting fashion too, as Rohit lifted pacer Kasun Rajita over his head for a majestic six. Other Indian batsmen to reach the mark are: Sachin Tendulkar, Sourav Ganguly, Rahul Dravid, Virat Kohli and MS Dhoni. Indeed, a magnificent company to be in! However, the introduction of Wellalage changed the whole complexion of the game, as the spinner halted Indian batsmen's early charge. Gill was the first batsman to depart. The opener played a forward defence without entirely covering the line and once the ball beat his bat, Gill's fate was sealed. Wellalage, a former under-19 captain of his country, then went on to show why he has been spoken so highly in Lankan cricketing circles. The 20-year-old bowled a straight, quick delivery and Rohit could not bring his bat down on time, as the ball rearranged his timber. But Wellalage wasn't finished. He added the wickets of Virat Kohli, KL Rahul, who added 63 runs for the seventh wicket with Ishan Kishan, and Hardik Pandya to his kitty for his maiden five-wicket haul in ODI cricket. None of the following batsmen could effectively negate the uneven bounce and turn on the pitch, as Asalanka wreaked havoc in India's middle and late order. His delivery to dismiss Ravindra Jadeja would carry a lot of repeat value. The ball reared from the length, turned and bounced viciously to take an edge of Jadeja's bat before nestling in stumper Kusal Mendis' gloves. India inched past the 200-run mark as Axar Patel made a precious 26, and the total proved just enough on the night.","pubDate":"2023-09-12 17:46:00","image_url":null,"source_id":"newindianexpress","source_priority":15406,"country":["india"],"category":["sports"],"language":"english"}]}