{"newsArray":[{"title":"Rabada six-for leads South Africa to victory over West Indies","link":"http://island.lk/rabada-six-for-leads-south-africa-to-victory-over-west-indies-2/","keywords":["Sports","Featured"],"creator":["Thilina Walpola"],"video_url":null,"description":"West Indies threatened to turn the tables on South Africa by rolling them over for 116 on the third morning at SuperSport Park, but their own batters collapsed in similar spectacular fashion, chasing 247. Kagiso Rabada was chiefly responsible for that collapse, bagging 6 for 50 to dismiss them for 159 and seal South Africa’s […]","content":"West Indies threatened to turn the tables on South Africa by rolling them over for 116 on the third morning at SuperSport Park, but their own batters collapsed in similar spectacular fashion, chasing 247. Kagiso Rabada was chiefly responsible for that collapse, bagging 6 for 50 to dismiss them for 159 and seal South Africa’s victory inside three days on a track that offered variable bounce. Jermaine Blackwood’s thrilling counterattack – 79 off 93 balls – raised West Indies’ hopes, but Rabada found a little extra kick off the pitch to take him out and ensure the new era under captain Temba Bavuma and coach Shukri Conrad began with a victory in Centurion, where the South Africa women’s team that reached the T20 World Cup final five days ago was also in attendance. It was Roach who had set the scene for the day with his 11th five-for in Test cricket – and first away from home since 2017. He also surpassed Joel Garner’s tally of 259 to become West Indies’ fifth-highest wicket-taker in Test cricket. Just before lunch, Roach was warmly welcomed back by his team-mates, Jimmy Adams, West Indies’ director of cricket, and Brian Lara, the team mentor. However, the mood and tempo of the match changed quickly when Rabada struck either side of the lunch break. After having captain Kraigg Brathwaite caught down the leg side for a duck, he drew an outside edge from No. 3 Raymon Reifer. Tagenarine Chanderpaul kept playing and missing at full balls, but wasn’t particularly flustered against that length. It was the short ball that bothered him. He fell on his backside twice while trying to deal with them and then when he dared to hook a head-high bouncer from Marco Jansen, he could only top-edge it to midwicket for 10. Roston Chase misjudged an inswinger from Jansen and was castled after offering no shot. Then, when debutant Gerald Coetzee produced extra bounce to get rid of Kyle Mayers, West Indies were 33 for 5 in the 15th over. Blackwood came in and hoicked the seventh ball he faced, off Rabada, over square leg for four. He continued to regularly pump the ball over the top, running away to a 51-ball half-century. At the other end, Joshua Da Silva was more circumspect and contributed 17 to a 58-run sixth-wicket partnership before he fell to Rabada Blackwood, though, went after South Africa’s premier seamer and shanked him over his head for an imposing four. When Anrich Nortje shifted his angle to around the wicket, he ramped him over deep third for four. Jason Holder also operated at almost a run-a-ball in a 37-run seventh-wicket stand with Blackwood before Rabada had him nicking behind with a perfectly-pitched delivery. Though Rabada looked like wasn’t at his best earlier in the day, floating some balls in the lower 130-kph range, his seven-over spell post tea, in which he dismissed both Holder and Blackwood, was perhaps the most decisive passage of play. The day had started on a more promising note for West Indies. Roach struck with his first ball to cut Aiden Markram’s innings short at 47 off 58. He went wide of the crease, tricked Markram into playing for the inward angle from over the wicket but got it to straighten late off the seam and graze the outside edge. Marais Erasmus, the on-field umpire, didn’t rule Markram out initially, but he opted to walk back to the dressing room. In his next over, Roach went wide of the crease again, but this time he beat Jansen’s outside edge and hit the top of the off stump. Roach also helped snip the South African tail, but Coetzee’s spunky cameo (20 off 15 balls) pushed their lead closer to 250. Markram aside, Coetzee was the only South Africa batter to score more than 10 runs in their second innings. He then combined and Rabada, Jansen and Norje with the ball to compensate for their batting collapse and wrap the game up before drinks on the third afternoon. West Indies ( ) Published on By Canada Soccer has reached an interim funding agreement with its women’s national team players amid a dispute over equal pay.The deal reflects the men’s team’s terms with game-by-game incentives and results-based compensation. The women’s team had threatened to boycott a camp in April if demands over funding and pay inequality are not met.A final collective bargaining deal with both the men’s and women’s sides remains under negotiation. “Canada Soccer has announced that a deal in principle has been reached with the Women’s National Team Players on an interim funding agreement for 2022,” the Canada Soccer Association (CSA) said in a statement on Thursday. The women’s team’s last agreement with CSA expired in 2021. In February, Canada’s women called off a planned strike because of the governing body’s threats of legal action, but they protested during the recent SheBelieves Cup by wearing purple T-shirts with the phrase “enough is enough” before their matches. “This is about respect, this is about dignity, and this is about equalising the competitive environment in a world that is fundamentally unequal,” Canada Soccer’s general secretary Earl Cochrane said. “We have been consistent and public about the need to have fairness and equal pay be pillars of any new agreements with our players, and we are delivering on that today.” Earlier this week, Canada Soccer president Nick Bontis announced his resignation, a decision welcomed by the Canadian Soccer Players’ Association (CSPA) and Canadian Men’s National Soccer Team Players’ Association (CMNSTPA) as “one necessary step” in ensuring the future success of the national teams.In a joint statement, the CSPA and CMNSTPA asked Canada Soccer for “transparent and comprehensive access” to financial records in light of recent funding cuts. They also want immediate action from the governing body to address the unauthorised use of player images, as well as financial restraints imposed by CSA’s agreement with Canada Business Soccer.Canada’s men went on strike in June 2022 after accusing CSA of “disrespect” over World Cup prize money and have said they “wholeheartedly support” the women’s side. The CSA spent $11m (£6.72m) on the men’s programme in 2021 and $5.1m (£3.11m) on the women’s programme.The women’s players said the “disgusting” discrepancy between the programmes became apparent at last year’s men’s World Cup. They are looking for the same backing for this year’s Women’s World Cup as the men received before Qatar, where they competed in the tournament for the first time in 37 years.Canada’s women, who are sixth in the world rankings and won Olympic gold in 2021, are in Group B for the World Cup, which takes place from 20 July to 20 August in Australia and New Zealand. Published on By Left-arm spinner Yuri Koththigoda excelled with a match bag of nine wickets as Richmond beat D.S. Senanayake College by an innings and 43 runs in the Under 19 traditional cricket encounter which ended before tea at Dombagoda on Friday. Koththigoda teamed up with Maheesha de Silva to rattle D.S. Senanayake for a meager total of 57 runs in the first innings. In their essay Richmond posted 233 runs with Janeth Kaushal top scoring with 61 runs. Batting for the second time DSS were bowled out for 133 runs. This time Koththigoda shared eight wickets with Sharon Abhishek to record their fifth outright victory of the season. At Reid Avenue, paceman Ranuka Malaviarachchi troubled Cambrians taking four early wickets. Royal restricted Prince of Wales to 136 runs before Dasis Manchanayake top scored with 91 runs for the home team to reach 185 for five wickets at stumps. Meanwhile, at Sooriyawewa, Maliyadewa topped 400 runs against Mahinda as Gayana Weerasinghe scored 149 runs inclusive of 17 fours and two sixes. In another traditional match, which ended in a draw, St. Anne’s took first innings honours against St. Joseph Vaz’s as Mahima Kotuwila scored a century to propel their total to 358 runs at Kurunegala. Richmond Maliyadeva top 400 runs at Sooriyawewa Maliyadeva 415 for 7 in 100 overs (Chamathkar Hettiarachchi 48, Pasindu Menaka 34, Chandupa Abeysinghe 38, Amesh Tennakoon 64, Gayana Weerasinghe 149, Jayamin Muthukumarana 38; Shehan Hasaranga 4/84) Published on By World number one Novak Djokovic continued his perfect start to 2023 by beating Hubert Hurkacz to reach the Dubai Tennis Championships semi-finals.The 35-year-old Serb took his record to 15-0 so far this year with a 6-3 7-5 win over Poland’s Hurkacz. Djokovic, who is chasing a sixth win in Dubai, was to face Daniil Medvedev for a place in Saturday’s final.Australian Open finalist Medvedev defeated Borna Coric 6-3 6-2 to stay on track for a third title this year. Meanwhile, defending champion Andrey Rublev beat Botic van de Zandschulp to progress.The second seed defeated his Dutch opponent 6-3 7-6 (7-3) and will play Alexander Zverev in the last four as the German overcame Lorenzo Sonego 7-5 6-4. Djokovic needed just 71 minutes to see off Hurkacz and is looking in fine form as he looks to win his third tournament of the year. “I found the rhythm on my serve throughout the second set,” he said. “I’m really glad with how I played under pressure.” Meanwhile, Djokovic is waiting for a response on his application for an exemption to visa rules on vaccines in order to enter the United States before the Masters 1000 event in Indian Wells, which begins on 8 March. The draw for that tournament takes place on Monday, and Djokovic said: “Whatever the decision is before the draw, if I’m not allowed I’m going to pull out, of course, before the draw.”","pubDate":"2023-03-04 00:01:03","image_url":null,"source_id":"island","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Canada women agree interim funding deal in equal pay dispute","link":"http://island.lk/canada-women-agree-interim-funding-deal-in-equal-pay-dispute/","keywords":["Sports"],"creator":["Thilina Walpola"],"video_url":null,"description":"Canada Soccer has reached an interim funding agreement with its women’s national team players amid a dispute over equal pay.The deal reflects the men’s team’s terms with game-by-game incentives and results-based compensation. The women’s team had threatened to boycott a camp in April if demands over funding and pay inequality are not met.A final collective […]","content":"Canada Soccer has reached an interim funding agreement with its women’s national team players amid a dispute over equal pay.The deal reflects the men’s team’s terms with game-by-game incentives and results-based compensation. The women’s team had threatened to boycott a camp in April if demands over funding and pay inequality are not met.A final collective bargaining deal with both the men’s and women’s sides remains under negotiation. “Canada Soccer has announced that a deal in principle has been reached with the Women’s National Team Players on an interim funding agreement for 2022,” the Canada Soccer Association (CSA) said in a statement on Thursday. The women’s team’s last agreement with CSA expired in 2021. In February, Canada’s women called off a planned strike because of the governing body’s threats of legal action, but they protested during the recent SheBelieves Cup by wearing purple T-shirts with the phrase “enough is enough” before their matches. “This is about respect, this is about dignity, and this is about equalising the competitive environment in a world that is fundamentally unequal,” Canada Soccer’s general secretary Earl Cochrane said. “We have been consistent and public about the need to have fairness and equal pay be pillars of any new agreements with our players, and we are delivering on that today.” Earlier this week, Canada Soccer president Nick Bontis announced his resignation, a decision welcomed by the Canadian Soccer Players’ Association (CSPA) and Canadian Men’s National Soccer Team Players’ Association (CMNSTPA) as “one necessary step” in ensuring the future success of the national teams.In a joint statement, the CSPA and CMNSTPA asked Canada Soccer for “transparent and comprehensive access” to financial records in light of recent funding cuts. They also want immediate action from the governing body to address the unauthorised use of player images, as well as financial restraints imposed by CSA’s agreement with Canada Business Soccer.Canada’s men went on strike in June 2022 after accusing CSA of “disrespect” over World Cup prize money and have said they “wholeheartedly support” the women’s side. The CSA spent $11m (£6.72m) on the men’s programme in 2021 and $5.1m (£3.11m) on the women’s programme.The women’s players said the “disgusting” discrepancy between the programmes became apparent at last year’s men’s World Cup. They are looking for the same backing for this year’s Women’s World Cup as the men received before Qatar, where they competed in the tournament for the first time in 37 years.Canada’s women, who are sixth in the world rankings and won Olympic gold in 2021, are in Group B for the World Cup, which takes place from 20 July to 20 August in Australia and New Zealand. Published on By Left-arm spinner Yuri Koththigoda excelled with a match bag of nine wickets as Richmond beat D.S. Senanayake College by an innings and 43 runs in the Under 19 traditional cricket encounter which ended before tea at Dombagoda on Friday. Koththigoda teamed up with Maheesha de Silva to rattle D.S. Senanayake for a meager total of 57 runs in the first innings. In their essay Richmond posted 233 runs with Janeth Kaushal top scoring with 61 runs. Batting for the second time DSS were bowled out for 133 runs. This time Koththigoda shared eight wickets with Sharon Abhishek to record their fifth outright victory of the season. At Reid Avenue, paceman Ranuka Malaviarachchi troubled Cambrians taking four early wickets. Royal restricted Prince of Wales to 136 runs before Dasis Manchanayake top scored with 91 runs for the home team to reach 185 for five wickets at stumps. Meanwhile, at Sooriyawewa, Maliyadewa topped 400 runs against Mahinda as Gayana Weerasinghe scored 149 runs inclusive of 17 fours and two sixes. In another traditional match, which ended in a draw, St. Anne’s took first innings honours against St. Joseph Vaz’s as Mahima Kotuwila scored a century to propel their total to 358 runs at Kurunegala. Richmond Maliyadeva top 400 runs at Sooriyawewa Maliyadeva 415 for 7 in 100 overs (Chamathkar Hettiarachchi 48, Pasindu Menaka 34, Chandupa Abeysinghe 38, Amesh Tennakoon 64, Gayana Weerasinghe 149, Jayamin Muthukumarana 38; Shehan Hasaranga 4/84) Published on By World number one Novak Djokovic continued his perfect start to 2023 by beating Hubert Hurkacz to reach the Dubai Tennis Championships semi-finals.The 35-year-old Serb took his record to 15-0 so far this year with a 6-3 7-5 win over Poland’s Hurkacz. Djokovic, who is chasing a sixth win in Dubai, was to face Daniil Medvedev for a place in Saturday’s final.Australian Open finalist Medvedev defeated Borna Coric 6-3 6-2 to stay on track for a third title this year. Meanwhile, defending champion Andrey Rublev beat Botic van de Zandschulp to progress.The second seed defeated his Dutch opponent 6-3 7-6 (7-3) and will play Alexander Zverev in the last four as the German overcame Lorenzo Sonego 7-5 6-4. Djokovic needed just 71 minutes to see off Hurkacz and is looking in fine form as he looks to win his third tournament of the year. “I found the rhythm on my serve throughout the second set,” he said. “I’m really glad with how I played under pressure.” Meanwhile, Djokovic is waiting for a response on his application for an exemption to visa rules on vaccines in order to enter the United States before the Masters 1000 event in Indian Wells, which begins on 8 March. The draw for that tournament takes place on Monday, and Djokovic said: “Whatever the decision is before the draw, if I’m not allowed I’m going to pull out, of course, before the draw.” Published on By India’s bid to defend 75 on the third day of the Indore Test started on the right note with R Ashwin striking off the second delivery of the day. After getting one to rip past Usman Khawaja’s outside edge in the first ball, he had him caught behind off the next ball with a similar delivery. Khawaja’s review went in vain, but that proved to be India’s lone moment of joy on the final day. While Travis Head and Marnus Labuschagne were kept on a tight leash for over ten overs by Ravindra Jadeja and Ashwin, the duo began to find a good measure of the spinners after settling in. Head began the charge by taking on Ashwin for a four and a six in the same over, which was backed up by Labuschagne’s loft off Jadeja as well. The sudden run flow put the spinners off, who had also got the ball changed at the tenth over mark. But even as Ashwin operated unchanged from one end, Australia began to press the accelerator. Head clobbered Umesh Yadav through the cover area for another boundary to get close to a fifty but before he could have a shot at it, Labuschagne finished the game off by lofting Ashwin over midwicket. The win gave Australia their first win of the series, and condemned India to their third home defeat in six years, two of which have come against a Steve Smith-led Australia. The victory also sealed Australia’s position in the World Test Championship final at the Oval in June this year. Australia ( )","pubDate":"2023-03-03 23:40:53","image_url":null,"source_id":"island","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Koththigoda rattles DSS as Richmond record fifth win","link":"http://island.lk/koththigoda-rattles-dss-as-richmond-record-fifth-win/","keywords":["Sports"],"creator":["Thilina Walpola"],"video_url":null,"description":"Under 19 Cricket by Reemus Fernando Left-arm spinner Yuri Koththigoda excelled with a match bag of nine wickets as Richmond beat D.S. Senanayake College by an innings and 43 runs in the Under 19 traditional cricket encounter which ended before tea at Dombagoda on Friday. Koththigoda teamed up with Maheesha de Silva to […]","content":"Left-arm spinner Yuri Koththigoda excelled with a match bag of nine wickets as Richmond beat D.S. Senanayake College by an innings and 43 runs in the Under 19 traditional cricket encounter which ended before tea at Dombagoda on Friday. Koththigoda teamed up with Maheesha de Silva to rattle D.S. Senanayake for a meager total of 57 runs in the first innings. In their essay Richmond posted 233 runs with Janeth Kaushal top scoring with 61 runs. Batting for the second time DSS were bowled out for 133 runs. This time Koththigoda shared eight wickets with Sharon Abhishek to record their fifth outright victory of the season. At Reid Avenue, paceman Ranuka Malaviarachchi troubled Cambrians taking four early wickets. Royal restricted Prince of Wales to 136 runs before Dasis Manchanayake top scored with 91 runs for the home team to reach 185 for five wickets at stumps. Meanwhile, at Sooriyawewa, Maliyadewa topped 400 runs against Mahinda as Gayana Weerasinghe scored 149 runs inclusive of 17 fours and two sixes. In another traditional match, which ended in a draw, St. Anne’s took first innings honours against St. Joseph Vaz’s as Mahima Kotuwila scored a century to propel their total to 358 runs at Kurunegala. Richmond Maliyadeva top 400 runs at Sooriyawewa Maliyadeva 415 for 7 in 100 overs (Chamathkar Hettiarachchi 48, Pasindu Menaka 34, Chandupa Abeysinghe 38, Amesh Tennakoon 64, Gayana Weerasinghe 149, Jayamin Muthukumarana 38; Shehan Hasaranga 4/84) Published on By West Indies threatened to turn the tables on South Africa by rolling them over for 116 on the third morning at SuperSport Park, but their own batters collapsed in similar spectacular fashion, chasing 247. Kagiso Rabada was chiefly responsible for that collapse, bagging 6 for 50 to dismiss them for 159 and seal South Africa’s victory inside three days on a track that offered variable bounce. Jermaine Blackwood’s thrilling counterattack – 79 off 93 balls – raised West Indies’ hopes, but Rabada found a little extra kick off the pitch to take him out and ensure the new era under captain Temba Bavuma and coach Shukri Conrad began with a victory in Centurion, where the South Africa women’s team that reached the T20 World Cup final five days ago was also in attendance. It was Roach who had set the scene for the day with his 11th five-for in Test cricket – and first away from home since 2017. He also surpassed Joel Garner’s tally of 259 to become West Indies’ fifth-highest wicket-taker in Test cricket. Just before lunch, Roach was warmly welcomed back by his team-mates, Jimmy Adams, West Indies’ director of cricket, and Brian Lara, the team mentor. However, the mood and tempo of the match changed quickly when Rabada struck either side of the lunch break. After having captain Kraigg Brathwaite caught down the leg side for a duck, he drew an outside edge from No. 3 Raymon Reifer. Tagenarine Chanderpaul kept playing and missing at full balls, but wasn’t particularly flustered against that length. It was the short ball that bothered him. He fell on his backside twice while trying to deal with them and then when he dared to hook a head-high bouncer from Marco Jansen, he could only top-edge it to midwicket for 10. Roston Chase misjudged an inswinger from Jansen and was castled after offering no shot. Then, when debutant Gerald Coetzee produced extra bounce to get rid of Kyle Mayers, West Indies were 33 for 5 in the 15th over. Blackwood came in and hoicked the seventh ball he faced, off Rabada, over square leg for four. He continued to regularly pump the ball over the top, running away to a 51-ball half-century. At the other end, Joshua Da Silva was more circumspect and contributed 17 to a 58-run sixth-wicket partnership before he fell to Rabada Blackwood, though, went after South Africa’s premier seamer and shanked him over his head for an imposing four. When Anrich Nortje shifted his angle to around the wicket, he ramped him over deep third for four. Jason Holder also operated at almost a run-a-ball in a 37-run seventh-wicket stand with Blackwood before Rabada had him nicking behind with a perfectly-pitched delivery. Though Rabada looked like wasn’t at his best earlier in the day, floating some balls in the lower 130-kph range, his seven-over spell post tea, in which he dismissed both Holder and Blackwood, was perhaps the most decisive passage of play. The day had started on a more promising note for West Indies. Roach struck with his first ball to cut Aiden Markram’s innings short at 47 off 58. He went wide of the crease, tricked Markram into playing for the inward angle from over the wicket but got it to straighten late off the seam and graze the outside edge. Marais Erasmus, the on-field umpire, didn’t rule Markram out initially, but he opted to walk back to the dressing room. In his next over, Roach went wide of the crease again, but this time he beat Jansen’s outside edge and hit the top of the off stump. Roach also helped snip the South African tail, but Coetzee’s spunky cameo (20 off 15 balls) pushed their lead closer to 250. Markram aside, Coetzee was the only South Africa batter to score more than 10 runs in their second innings. He then combined and Rabada, Jansen and Norje with the ball to compensate for their batting collapse and wrap the game up before drinks on the third afternoon. West Indies ( ) Published on By Canada Soccer has reached an interim funding agreement with its women’s national team players amid a dispute over equal pay.The deal reflects the men’s team’s terms with game-by-game incentives and results-based compensation. The women’s team had threatened to boycott a camp in April if demands over funding and pay inequality are not met.A final collective bargaining deal with both the men’s and women’s sides remains under negotiation. “Canada Soccer has announced that a deal in principle has been reached with the Women’s National Team Players on an interim funding agreement for 2022,” the Canada Soccer Association (CSA) said in a statement on Thursday. The women’s team’s last agreement with CSA expired in 2021. In February, Canada’s women called off a planned strike because of the governing body’s threats of legal action, but they protested during the recent SheBelieves Cup by wearing purple T-shirts with the phrase “enough is enough” before their matches. “This is about respect, this is about dignity, and this is about equalising the competitive environment in a world that is fundamentally unequal,” Canada Soccer’s general secretary Earl Cochrane said. “We have been consistent and public about the need to have fairness and equal pay be pillars of any new agreements with our players, and we are delivering on that today.” Earlier this week, Canada Soccer president Nick Bontis announced his resignation, a decision welcomed by the Canadian Soccer Players’ Association (CSPA) and Canadian Men’s National Soccer Team Players’ Association (CMNSTPA) as “one necessary step” in ensuring the future success of the national teams.In a joint statement, the CSPA and CMNSTPA asked Canada Soccer for “transparent and comprehensive access” to financial records in light of recent funding cuts. They also want immediate action from the governing body to address the unauthorised use of player images, as well as financial restraints imposed by CSA’s agreement with Canada Business Soccer.Canada’s men went on strike in June 2022 after accusing CSA of “disrespect” over World Cup prize money and have said they “wholeheartedly support” the women’s side. The CSA spent $11m (£6.72m) on the men’s programme in 2021 and $5.1m (£3.11m) on the women’s programme.The women’s players said the “disgusting” discrepancy between the programmes became apparent at last year’s men’s World Cup. They are looking for the same backing for this year’s Women’s World Cup as the men received before Qatar, where they competed in the tournament for the first time in 37 years.Canada’s women, who are sixth in the world rankings and won Olympic gold in 2021, are in Group B for the World Cup, which takes place from 20 July to 20 August in Australia and New Zealand. Published on By World number one Novak Djokovic continued his perfect start to 2023 by beating Hubert Hurkacz to reach the Dubai Tennis Championships semi-finals.The 35-year-old Serb took his record to 15-0 so far this year with a 6-3 7-5 win over Poland’s Hurkacz. Djokovic, who is chasing a sixth win in Dubai, was to face Daniil Medvedev for a place in Saturday’s final.Australian Open finalist Medvedev defeated Borna Coric 6-3 6-2 to stay on track for a third title this year. Meanwhile, defending champion Andrey Rublev beat Botic van de Zandschulp to progress.The second seed defeated his Dutch opponent 6-3 7-6 (7-3) and will play Alexander Zverev in the last four as the German overcame Lorenzo Sonego 7-5 6-4. Djokovic needed just 71 minutes to see off Hurkacz and is looking in fine form as he looks to win his third tournament of the year. “I found the rhythm on my serve throughout the second set,” he said. “I’m really glad with how I played under pressure.” Meanwhile, Djokovic is waiting for a response on his application for an exemption to visa rules on vaccines in order to enter the United States before the Masters 1000 event in Indian Wells, which begins on 8 March. The draw for that tournament takes place on Monday, and Djokovic said: “Whatever the decision is before the draw, if I’m not allowed I’m going to pull out, of course, before the draw.”","pubDate":"2023-03-03 23:40:16","image_url":null,"source_id":"island","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Djokovic beats Hurkacz to reach semi-finals in Dubai","link":"http://island.lk/djokovic-beats-hurkacz-to-reach-semi-finals-in-dubai/","keywords":["Sports"],"creator":["Thilina Walpola"],"video_url":null,"description":"World number one Novak Djokovic continued his perfect start to 2023 by beating Hubert Hurkacz to reach the Dubai Tennis Championships semi-finals.The 35-year-old Serb took his record to 15-0 so far this year with a 6-3 7-5 win over Poland’s Hurkacz. Djokovic, who is chasing a sixth win in Dubai, was to face Daniil Medvedev […]","content":"World number one Novak Djokovic continued his perfect start to 2023 by beating Hubert Hurkacz to reach the Dubai Tennis Championships semi-finals.The 35-year-old Serb took his record to 15-0 so far this year with a 6-3 7-5 win over Poland’s Hurkacz. Djokovic, who is chasing a sixth win in Dubai, was to face Daniil Medvedev for a place in Saturday’s final.Australian Open finalist Medvedev defeated Borna Coric 6-3 6-2 to stay on track for a third title this year. Meanwhile, defending champion Andrey Rublev beat Botic van de Zandschulp to progress.The second seed defeated his Dutch opponent 6-3 7-6 (7-3) and will play Alexander Zverev in the last four as the German overcame Lorenzo Sonego 7-5 6-4. Djokovic needed just 71 minutes to see off Hurkacz and is looking in fine form as he looks to win his third tournament of the year. “I found the rhythm on my serve throughout the second set,” he said. “I’m really glad with how I played under pressure.” Meanwhile, Djokovic is waiting for a response on his application for an exemption to visa rules on vaccines in order to enter the United States before the Masters 1000 event in Indian Wells, which begins on 8 March. The draw for that tournament takes place on Monday, and Djokovic said: “Whatever the decision is before the draw, if I’m not allowed I’m going to pull out, of course, before the draw.” Published on By Canada Soccer has reached an interim funding agreement with its women’s national team players amid a dispute over equal pay.The deal reflects the men’s team’s terms with game-by-game incentives and results-based compensation. The women’s team had threatened to boycott a camp in April if demands over funding and pay inequality are not met.A final collective bargaining deal with both the men’s and women’s sides remains under negotiation. “Canada Soccer has announced that a deal in principle has been reached with the Women’s National Team Players on an interim funding agreement for 2022,” the Canada Soccer Association (CSA) said in a statement on Thursday. The women’s team’s last agreement with CSA expired in 2021. In February, Canada’s women called off a planned strike because of the governing body’s threats of legal action, but they protested during the recent SheBelieves Cup by wearing purple T-shirts with the phrase “enough is enough” before their matches. “This is about respect, this is about dignity, and this is about equalising the competitive environment in a world that is fundamentally unequal,” Canada Soccer’s general secretary Earl Cochrane said. “We have been consistent and public about the need to have fairness and equal pay be pillars of any new agreements with our players, and we are delivering on that today.” Earlier this week, Canada Soccer president Nick Bontis announced his resignation, a decision welcomed by the Canadian Soccer Players’ Association (CSPA) and Canadian Men’s National Soccer Team Players’ Association (CMNSTPA) as “one necessary step” in ensuring the future success of the national teams.In a joint statement, the CSPA and CMNSTPA asked Canada Soccer for “transparent and comprehensive access” to financial records in light of recent funding cuts. They also want immediate action from the governing body to address the unauthorised use of player images, as well as financial restraints imposed by CSA’s agreement with Canada Business Soccer.Canada’s men went on strike in June 2022 after accusing CSA of “disrespect” over World Cup prize money and have said they “wholeheartedly support” the women’s side. The CSA spent $11m (£6.72m) on the men’s programme in 2021 and $5.1m (£3.11m) on the women’s programme.The women’s players said the “disgusting” discrepancy between the programmes became apparent at last year’s men’s World Cup. They are looking for the same backing for this year’s Women’s World Cup as the men received before Qatar, where they competed in the tournament for the first time in 37 years.Canada’s women, who are sixth in the world rankings and won Olympic gold in 2021, are in Group B for the World Cup, which takes place from 20 July to 20 August in Australia and New Zealand. Published on By Left-arm spinner Yuri Koththigoda excelled with a match bag of nine wickets as Richmond beat D.S. Senanayake College by an innings and 43 runs in the Under 19 traditional cricket encounter which ended before tea at Dombagoda on Friday. Koththigoda teamed up with Maheesha de Silva to rattle D.S. Senanayake for a meager total of 57 runs in the first innings. In their essay Richmond posted 233 runs with Janeth Kaushal top scoring with 61 runs. Batting for the second time DSS were bowled out for 133 runs. This time Koththigoda shared eight wickets with Sharon Abhishek to record their fifth outright victory of the season. At Reid Avenue, paceman Ranuka Malaviarachchi troubled Cambrians taking four early wickets. Royal restricted Prince of Wales to 136 runs before Dasis Manchanayake top scored with 91 runs for the home team to reach 185 for five wickets at stumps. Meanwhile, at Sooriyawewa, Maliyadewa topped 400 runs against Mahinda as Gayana Weerasinghe scored 149 runs inclusive of 17 fours and two sixes. In another traditional match, which ended in a draw, St. Anne’s took first innings honours against St. Joseph Vaz’s as Mahima Kotuwila scored a century to propel their total to 358 runs at Kurunegala. Richmond Maliyadeva top 400 runs at Sooriyawewa Maliyadeva 415 for 7 in 100 overs (Chamathkar Hettiarachchi 48, Pasindu Menaka 34, Chandupa Abeysinghe 38, Amesh Tennakoon 64, Gayana Weerasinghe 149, Jayamin Muthukumarana 38; Shehan Hasaranga 4/84) Published on By India’s bid to defend 75 on the third day of the Indore Test started on the right note with R Ashwin striking off the second delivery of the day. After getting one to rip past Usman Khawaja’s outside edge in the first ball, he had him caught behind off the next ball with a similar delivery. Khawaja’s review went in vain, but that proved to be India’s lone moment of joy on the final day. While Travis Head and Marnus Labuschagne were kept on a tight leash for over ten overs by Ravindra Jadeja and Ashwin, the duo began to find a good measure of the spinners after settling in. Head began the charge by taking on Ashwin for a four and a six in the same over, which was backed up by Labuschagne’s loft off Jadeja as well. The sudden run flow put the spinners off, who had also got the ball changed at the tenth over mark. But even as Ashwin operated unchanged from one end, Australia began to press the accelerator. Head clobbered Umesh Yadav through the cover area for another boundary to get close to a fifty but before he could have a shot at it, Labuschagne finished the game off by lofting Ashwin over midwicket. The win gave Australia their first win of the series, and condemned India to their third home defeat in six years, two of which have come against a Steve Smith-led Australia. The victory also sealed Australia’s position in the World Test Championship final at the Oval in June this year. Australia ( )","pubDate":"2023-03-03 23:40:08","image_url":null,"source_id":"island","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Head leads last leg of Australia’s victory march","link":"http://island.lk/head-leads-last-leg-of-australias-victory-march-2/","keywords":["Sports"],"creator":["Thilina Walpola"],"video_url":null,"description":"India’s bid to defend 75 on the third day of the Indore Test started on the right note with R Ashwin striking off the second delivery of the day. After getting one to rip past Usman Khawaja’s outside edge in the first ball, he had him caught behind off the next ball with a similar […]","content":"India’s bid to defend 75 on the third day of the Indore Test started on the right note with R Ashwin striking off the second delivery of the day. After getting one to rip past Usman Khawaja’s outside edge in the first ball, he had him caught behind off the next ball with a similar delivery. Khawaja’s review went in vain, but that proved to be India’s lone moment of joy on the final day. While Travis Head and Marnus Labuschagne were kept on a tight leash for over ten overs by Ravindra Jadeja and Ashwin, the duo began to find a good measure of the spinners after settling in. Head began the charge by taking on Ashwin for a four and a six in the same over, which was backed up by Labuschagne’s loft off Jadeja as well. The sudden run flow put the spinners off, who had also got the ball changed at the tenth over mark. But even as Ashwin operated unchanged from one end, Australia began to press the accelerator. Head clobbered Umesh Yadav through the cover area for another boundary to get close to a fifty but before he could have a shot at it, Labuschagne finished the game off by lofting Ashwin over midwicket. The win gave Australia their first win of the series, and condemned India to their third home defeat in six years, two of which have come against a Steve Smith-led Australia. The victory also sealed Australia’s position in the World Test Championship final at the Oval in June this year. Australia ( ) Published on By Canada Soccer has reached an interim funding agreement with its women’s national team players amid a dispute over equal pay.The deal reflects the men’s team’s terms with game-by-game incentives and results-based compensation. The women’s team had threatened to boycott a camp in April if demands over funding and pay inequality are not met.A final collective bargaining deal with both the men’s and women’s sides remains under negotiation. “Canada Soccer has announced that a deal in principle has been reached with the Women’s National Team Players on an interim funding agreement for 2022,” the Canada Soccer Association (CSA) said in a statement on Thursday. The women’s team’s last agreement with CSA expired in 2021. In February, Canada’s women called off a planned strike because of the governing body’s threats of legal action, but they protested during the recent SheBelieves Cup by wearing purple T-shirts with the phrase “enough is enough” before their matches. “This is about respect, this is about dignity, and this is about equalising the competitive environment in a world that is fundamentally unequal,” Canada Soccer’s general secretary Earl Cochrane said. “We have been consistent and public about the need to have fairness and equal pay be pillars of any new agreements with our players, and we are delivering on that today.” Earlier this week, Canada Soccer president Nick Bontis announced his resignation, a decision welcomed by the Canadian Soccer Players’ Association (CSPA) and Canadian Men’s National Soccer Team Players’ Association (CMNSTPA) as “one necessary step” in ensuring the future success of the national teams.In a joint statement, the CSPA and CMNSTPA asked Canada Soccer for “transparent and comprehensive access” to financial records in light of recent funding cuts. They also want immediate action from the governing body to address the unauthorised use of player images, as well as financial restraints imposed by CSA’s agreement with Canada Business Soccer.Canada’s men went on strike in June 2022 after accusing CSA of “disrespect” over World Cup prize money and have said they “wholeheartedly support” the women’s side. The CSA spent $11m (£6.72m) on the men’s programme in 2021 and $5.1m (£3.11m) on the women’s programme.The women’s players said the “disgusting” discrepancy between the programmes became apparent at last year’s men’s World Cup. They are looking for the same backing for this year’s Women’s World Cup as the men received before Qatar, where they competed in the tournament for the first time in 37 years.Canada’s women, who are sixth in the world rankings and won Olympic gold in 2021, are in Group B for the World Cup, which takes place from 20 July to 20 August in Australia and New Zealand. Published on By Left-arm spinner Yuri Koththigoda excelled with a match bag of nine wickets as Richmond beat D.S. Senanayake College by an innings and 43 runs in the Under 19 traditional cricket encounter which ended before tea at Dombagoda on Friday. Koththigoda teamed up with Maheesha de Silva to rattle D.S. Senanayake for a meager total of 57 runs in the first innings. In their essay Richmond posted 233 runs with Janeth Kaushal top scoring with 61 runs. Batting for the second time DSS were bowled out for 133 runs. This time Koththigoda shared eight wickets with Sharon Abhishek to record their fifth outright victory of the season. At Reid Avenue, paceman Ranuka Malaviarachchi troubled Cambrians taking four early wickets. Royal restricted Prince of Wales to 136 runs before Dasis Manchanayake top scored with 91 runs for the home team to reach 185 for five wickets at stumps. Meanwhile, at Sooriyawewa, Maliyadewa topped 400 runs against Mahinda as Gayana Weerasinghe scored 149 runs inclusive of 17 fours and two sixes. In another traditional match, which ended in a draw, St. Anne’s took first innings honours against St. Joseph Vaz’s as Mahima Kotuwila scored a century to propel their total to 358 runs at Kurunegala. Richmond Maliyadeva top 400 runs at Sooriyawewa Maliyadeva 415 for 7 in 100 overs (Chamathkar Hettiarachchi 48, Pasindu Menaka 34, Chandupa Abeysinghe 38, Amesh Tennakoon 64, Gayana Weerasinghe 149, Jayamin Muthukumarana 38; Shehan Hasaranga 4/84) Published on By World number one Novak Djokovic continued his perfect start to 2023 by beating Hubert Hurkacz to reach the Dubai Tennis Championships semi-finals.The 35-year-old Serb took his record to 15-0 so far this year with a 6-3 7-5 win over Poland’s Hurkacz. Djokovic, who is chasing a sixth win in Dubai, was to face Daniil Medvedev for a place in Saturday’s final.Australian Open finalist Medvedev defeated Borna Coric 6-3 6-2 to stay on track for a third title this year. Meanwhile, defending champion Andrey Rublev beat Botic van de Zandschulp to progress.The second seed defeated his Dutch opponent 6-3 7-6 (7-3) and will play Alexander Zverev in the last four as the German overcame Lorenzo Sonego 7-5 6-4. Djokovic needed just 71 minutes to see off Hurkacz and is looking in fine form as he looks to win his third tournament of the year. “I found the rhythm on my serve throughout the second set,” he said. “I’m really glad with how I played under pressure.” Meanwhile, Djokovic is waiting for a response on his application for an exemption to visa rules on vaccines in order to enter the United States before the Masters 1000 event in Indian Wells, which begins on 8 March. The draw for that tournament takes place on Monday, and Djokovic said: “Whatever the decision is before the draw, if I’m not allowed I’m going to pull out, of course, before the draw.”","pubDate":"2023-03-03 23:40:05","image_url":null,"source_id":"island","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"PSG’s Lionel Messi receives threatening note after family’s store attacked in Argentina","link":"http://island.lk/psgs-lionel-messi-receives-threatening-note-after-familys-store-attacked-in-argentina/","keywords":["Sports"],"creator":["Thilina Walpola"],"video_url":null,"description":"Gunmen left a threatening message for Paris Saint-Germain forward Lionel Messi after attacking a supermarket owned by his in-laws in Rosario, Argentina, Rosario police confirmed on Thursday.Fourteen shots were reportedly fired at the shutters and front door of the food store “Unico,” which is located in the Lavalle district of Rosario, in the early hours […]","content":"Gunmen left a threatening message for Paris Saint-Germain forward Lionel Messi after attacking a supermarket owned by his in-laws in Rosario, Argentina, Rosario police confirmed on Thursday.Fourteen shots were reportedly fired at the shutters and front door of the food store “Unico,” which is located in the Lavalle district of Rosario, in the early hours of Thursday by two individuals on a motorbike. Nobody was injured in the early morning attack, and it was unclear why assailants would target Messi or the Unico supermarket in the country’s third-largest city of Rosario, owned by the family of his wife, Antonela Roccuzzo. Police also said the attackers left a threatening note written on a piece of cardboard that said: “Messi, we are waiting for you. Javkin is a drug dealer. He is not going to look after you.” An investigation is underway. Pablo Javkin is the mayor of Rosario, the largest city in the central province of Santa Fe, 300 kilometres (186 miles) north of Buenos Aires in Argentina.After Thursday’s incident, Javkin spoke to reporters about the increase in violence in Rosario and the shortage of police and lack of protection in the city. Javkin’s concerns are not new. He had voiced his frustration earlier this week about the lack of protection and the need for more police officers in a city where crime is on the rise.Javkin tweeted: “Rosario is 300km from Buenos Aires, it is near. We want to get all the resources against crime that Argentina has to take care of us, to protect this city that gives the country glory and science, countryside and art, federalism and union.” Neither Messi, who on Monday won Best FIFA Men’s Player after captaining Argentina to the 2022 World Cup trophy, nor his wife — both are from Rosario — has commented on the incident. Widely considered the greatest soccer player of all time, Messi currently plays for Paris Saint-Germain and spends much of his time overseas, although he often visits Rosario, where he has a home in the suburb of Funes. The French team posted a photo on social media of Messi training on Thursday morning. In Rosario, prosecutor Federico Rébola said that authorities were reviewing security camera footage and that the investigation was “preliminary.” It was the first time Messi’s in-laws had received this kind of threat, he added. Celia Arena, justice minister for Santa Fe province, where Rosario is located, said the attack amounted to “terrorism” by a “mafia” group meant to intimidate the broader population. “The aim is to deliberately cause terror in the population and discourage those of us who are fighting against criminal violence, knowing that it will be an event of global significance,” Arena wrote in a social media post. Javkin, a center-left politician in opposition to the ruling Peronist coalition, appeared to throw suspicion of complicity for the attack on both criminal gangs and federal security officials. “I doubt everyone, even those who are supposed to protect us,” Javkin said in an interview with a local radio station. He said he had recently had “very strong discussions” with members of the federal security forces over the past couple of weeks demanding that they crack down on the city’s crime. “Where are the ones who need to take care of us?” Javkin said. “It’s clear that those who have the weapons and have the possibility of investigating the criminals aren’t doing it, and it’s very easy for any gang to carry out something like this.” The federal government’s security minister, Aníbal Fernández, said that drug-related violence was not a recent phenomenon in the city and that Thursday’s attack was typical of what has happened there “for the last 20 years.” He said that the incident was an example of how drug traffickers “have won” in Rosario and that “we have to reverse that.” Opposition politicians blamed President Alberto Fernández’s administration for the continuing violence in Rosario. His predecessor, Mauricio Macri, characterized the events as a warning that the country cannot “coexist” with drug traffickers. Messi, 35, is currently renegotiating a contract with PSG that ends this year amid speculation that the soccer superstar could decide to end his career playing for one of the local Rosario clubs, Newell’s. Messi could travel to Argentina later this month to join the national squad in playing two friendly matches. One takes place March 23 against Panama in Buenos Aires, while the other one will be five days later against Curacao in the northern city of Santiago del Estero. (ESPN) Published on By West Indies threatened to turn the tables on South Africa by rolling them over for 116 on the third morning at SuperSport Park, but their own batters collapsed in similar spectacular fashion, chasing 247. Kagiso Rabada was chiefly responsible for that collapse, bagging 6 for 50 to dismiss them for 159 and seal South Africa’s victory inside three days on a track that offered variable bounce. Jermaine Blackwood’s thrilling counterattack – 79 off 93 balls – raised West Indies’ hopes, but Rabada found a little extra kick off the pitch to take him out and ensure the new era under captain Temba Bavuma and coach Shukri Conrad began with a victory in Centurion, where the South Africa women’s team that reached the T20 World Cup final five days ago was also in attendance. It was Roach who had set the scene for the day with his 11th five-for in Test cricket – and first away from home since 2017. He also surpassed Joel Garner’s tally of 259 to become West Indies’ fifth-highest wicket-taker in Test cricket. Just before lunch, Roach was warmly welcomed back by his team-mates, Jimmy Adams, West Indies’ director of cricket, and Brian Lara, the team mentor. However, the mood and tempo of the match changed quickly when Rabada struck either side of the lunch break. After having captain Kraigg Brathwaite caught down the leg side for a duck, he drew an outside edge from No. 3 Raymon Reifer. Tagenarine Chanderpaul kept playing and missing at full balls, but wasn’t particularly flustered against that length. It was the short ball that bothered him. He fell on his backside twice while trying to deal with them and then when he dared to hook a head-high bouncer from Marco Jansen, he could only top-edge it to midwicket for 10. Roston Chase misjudged an inswinger from Jansen and was castled after offering no shot. Then, when debutant Gerald Coetzee produced extra bounce to get rid of Kyle Mayers, West Indies were 33 for 5 in the 15th over. Blackwood came in and hoicked the seventh ball he faced, off Rabada, over square leg for four. He continued to regularly pump the ball over the top, running away to a 51-ball half-century. At the other end, Joshua Da Silva was more circumspect and contributed 17 to a 58-run sixth-wicket partnership before he fell to Rabada Blackwood, though, went after South Africa’s premier seamer and shanked him over his head for an imposing four. When Anrich Nortje shifted his angle to around the wicket, he ramped him over deep third for four. Jason Holder also operated at almost a run-a-ball in a 37-run seventh-wicket stand with Blackwood before Rabada had him nicking behind with a perfectly-pitched delivery. Though Rabada looked like wasn’t at his best earlier in the day, floating some balls in the lower 130-kph range, his seven-over spell post tea, in which he dismissed both Holder and Blackwood, was perhaps the most decisive passage of play. The day had started on a more promising note for West Indies. Roach struck with his first ball to cut Aiden Markram’s innings short at 47 off 58. He went wide of the crease, tricked Markram into playing for the inward angle from over the wicket but got it to straighten late off the seam and graze the outside edge. Marais Erasmus, the on-field umpire, didn’t rule Markram out initially, but he opted to walk back to the dressing room. In his next over, Roach went wide of the crease again, but this time he beat Jansen’s outside edge and hit the top of the off stump. Roach also helped snip the South African tail, but Coetzee’s spunky cameo (20 off 15 balls) pushed their lead closer to 250. Markram aside, Coetzee was the only South Africa batter to score more than 10 runs in their second innings. He then combined and Rabada, Jansen and Norje with the ball to compensate for their batting collapse and wrap the game up before drinks on the third afternoon. West Indies ( ) Published on By Canada Soccer has reached an interim funding agreement with its women’s national team players amid a dispute over equal pay.The deal reflects the men’s team’s terms with game-by-game incentives and results-based compensation. The women’s team had threatened to boycott a camp in April if demands over funding and pay inequality are not met.A final collective bargaining deal with both the men’s and women’s sides remains under negotiation. “Canada Soccer has announced that a deal in principle has been reached with the Women’s National Team Players on an interim funding agreement for 2022,” the Canada Soccer Association (CSA) said in a statement on Thursday. The women’s team’s last agreement with CSA expired in 2021. In February, Canada’s women called off a planned strike because of the governing body’s threats of legal action, but they protested during the recent SheBelieves Cup by wearing purple T-shirts with the phrase “enough is enough” before their matches. “This is about respect, this is about dignity, and this is about equalising the competitive environment in a world that is fundamentally unequal,” Canada Soccer’s general secretary Earl Cochrane said. “We have been consistent and public about the need to have fairness and equal pay be pillars of any new agreements with our players, and we are delivering on that today.” Earlier this week, Canada Soccer president Nick Bontis announced his resignation, a decision welcomed by the Canadian Soccer Players’ Association (CSPA) and Canadian Men’s National Soccer Team Players’ Association (CMNSTPA) as “one necessary step” in ensuring the future success of the national teams.In a joint statement, the CSPA and CMNSTPA asked Canada Soccer for “transparent and comprehensive access” to financial records in light of recent funding cuts. They also want immediate action from the governing body to address the unauthorised use of player images, as well as financial restraints imposed by CSA’s agreement with Canada Business Soccer.Canada’s men went on strike in June 2022 after accusing CSA of “disrespect” over World Cup prize money and have said they “wholeheartedly support” the women’s side. The CSA spent $11m (£6.72m) on the men’s programme in 2021 and $5.1m (£3.11m) on the women’s programme.The women’s players said the “disgusting” discrepancy between the programmes became apparent at last year’s men’s World Cup. They are looking for the same backing for this year’s Women’s World Cup as the men received before Qatar, where they competed in the tournament for the first time in 37 years.Canada’s women, who are sixth in the world rankings and won Olympic gold in 2021, are in Group B for the World Cup, which takes place from 20 July to 20 August in Australia and New Zealand. Published on By Left-arm spinner Yuri Koththigoda excelled with a match bag of nine wickets as Richmond beat D.S. Senanayake College by an innings and 43 runs in the Under 19 traditional cricket encounter which ended before tea at Dombagoda on Friday. Koththigoda teamed up with Maheesha de Silva to rattle D.S. Senanayake for a meager total of 57 runs in the first innings. In their essay Richmond posted 233 runs with Janeth Kaushal top scoring with 61 runs. Batting for the second time DSS were bowled out for 133 runs. This time Koththigoda shared eight wickets with Sharon Abhishek to record their fifth outright victory of the season. At Reid Avenue, paceman Ranuka Malaviarachchi troubled Cambrians taking four early wickets. Royal restricted Prince of Wales to 136 runs before Dasis Manchanayake top scored with 91 runs for the home team to reach 185 for five wickets at stumps. Meanwhile, at Sooriyawewa, Maliyadewa topped 400 runs against Mahinda as Gayana Weerasinghe scored 149 runs inclusive of 17 fours and two sixes. In another traditional match, which ended in a draw, St. Anne’s took first innings honours against St. Joseph Vaz’s as Mahima Kotuwila scored a century to propel their total to 358 runs at Kurunegala. Richmond Maliyadeva top 400 runs at Sooriyawewa Maliyadeva 415 for 7 in 100 overs (Chamathkar Hettiarachchi 48, Pasindu Menaka 34, Chandupa Abeysinghe 38, Amesh Tennakoon 64, Gayana Weerasinghe 149, Jayamin Muthukumarana 38; Shehan Hasaranga 4/84)","pubDate":"2023-03-03 23:40:02","image_url":null,"source_id":"island","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Sampath Bank sponsors ‘93rd Battle of the Maroons’","link":"http://island.lk/sampath-bank-sponsors-93rd-battle-of-the-maroons/","keywords":["Sports"],"creator":["Thilina Walpola"],"video_url":null,"description":"Sampath Bank which has always identified and dedicated their interests towards the betterment of sports in Sri Lanka will sponsor the 93rd annual inter – school encounter between Ananda College and Nalanda College will be held at the Sinhalese Sports Club (SSC) Grounds in Colombo. The sponsorship check was handed over at a ceremony held […]","content":"Sampath Bank which has always identified and dedicated their interests towards the betterment of sports in Sri Lanka will sponsor the 93rd annual inter – school encounter between Ananda College and Nalanda College will be held at the Sinhalese Sports Club (SSC) Grounds in Colombo. The sponsorship check was handed over at a ceremony held recently Published on By West Indies threatened to turn the tables on South Africa by rolling them over for 116 on the third morning at SuperSport Park, but their own batters collapsed in similar spectacular fashion, chasing 247. Kagiso Rabada was chiefly responsible for that collapse, bagging 6 for 50 to dismiss them for 159 and seal South Africa’s victory inside three days on a track that offered variable bounce. Jermaine Blackwood’s thrilling counterattack – 79 off 93 balls – raised West Indies’ hopes, but Rabada found a little extra kick off the pitch to take him out and ensure the new era under captain Temba Bavuma and coach Shukri Conrad began with a victory in Centurion, where the South Africa women’s team that reached the T20 World Cup final five days ago was also in attendance. It was Roach who had set the scene for the day with his 11th five-for in Test cricket – and first away from home since 2017. He also surpassed Joel Garner’s tally of 259 to become West Indies’ fifth-highest wicket-taker in Test cricket. Just before lunch, Roach was warmly welcomed back by his team-mates, Jimmy Adams, West Indies’ director of cricket, and Brian Lara, the team mentor. However, the mood and tempo of the match changed quickly when Rabada struck either side of the lunch break. After having captain Kraigg Brathwaite caught down the leg side for a duck, he drew an outside edge from No. 3 Raymon Reifer. Tagenarine Chanderpaul kept playing and missing at full balls, but wasn’t particularly flustered against that length. It was the short ball that bothered him. He fell on his backside twice while trying to deal with them and then when he dared to hook a head-high bouncer from Marco Jansen, he could only top-edge it to midwicket for 10. Roston Chase misjudged an inswinger from Jansen and was castled after offering no shot. Then, when debutant Gerald Coetzee produced extra bounce to get rid of Kyle Mayers, West Indies were 33 for 5 in the 15th over. Blackwood came in and hoicked the seventh ball he faced, off Rabada, over square leg for four. He continued to regularly pump the ball over the top, running away to a 51-ball half-century. At the other end, Joshua Da Silva was more circumspect and contributed 17 to a 58-run sixth-wicket partnership before he fell to Rabada Blackwood, though, went after South Africa’s premier seamer and shanked him over his head for an imposing four. When Anrich Nortje shifted his angle to around the wicket, he ramped him over deep third for four. Jason Holder also operated at almost a run-a-ball in a 37-run seventh-wicket stand with Blackwood before Rabada had him nicking behind with a perfectly-pitched delivery. Though Rabada looked like wasn’t at his best earlier in the day, floating some balls in the lower 130-kph range, his seven-over spell post tea, in which he dismissed both Holder and Blackwood, was perhaps the most decisive passage of play. The day had started on a more promising note for West Indies. Roach struck with his first ball to cut Aiden Markram’s innings short at 47 off 58. He went wide of the crease, tricked Markram into playing for the inward angle from over the wicket but got it to straighten late off the seam and graze the outside edge. Marais Erasmus, the on-field umpire, didn’t rule Markram out initially, but he opted to walk back to the dressing room. In his next over, Roach went wide of the crease again, but this time he beat Jansen’s outside edge and hit the top of the off stump. Roach also helped snip the South African tail, but Coetzee’s spunky cameo (20 off 15 balls) pushed their lead closer to 250. Markram aside, Coetzee was the only South Africa batter to score more than 10 runs in their second innings. He then combined and Rabada, Jansen and Norje with the ball to compensate for their batting collapse and wrap the game up before drinks on the third afternoon. West Indies ( ) Published on By Canada Soccer has reached an interim funding agreement with its women’s national team players amid a dispute over equal pay.The deal reflects the men’s team’s terms with game-by-game incentives and results-based compensation. The women’s team had threatened to boycott a camp in April if demands over funding and pay inequality are not met.A final collective bargaining deal with both the men’s and women’s sides remains under negotiation. “Canada Soccer has announced that a deal in principle has been reached with the Women’s National Team Players on an interim funding agreement for 2022,” the Canada Soccer Association (CSA) said in a statement on Thursday. The women’s team’s last agreement with CSA expired in 2021. In February, Canada’s women called off a planned strike because of the governing body’s threats of legal action, but they protested during the recent SheBelieves Cup by wearing purple T-shirts with the phrase “enough is enough” before their matches. “This is about respect, this is about dignity, and this is about equalising the competitive environment in a world that is fundamentally unequal,” Canada Soccer’s general secretary Earl Cochrane said. “We have been consistent and public about the need to have fairness and equal pay be pillars of any new agreements with our players, and we are delivering on that today.” Earlier this week, Canada Soccer president Nick Bontis announced his resignation, a decision welcomed by the Canadian Soccer Players’ Association (CSPA) and Canadian Men’s National Soccer Team Players’ Association (CMNSTPA) as “one necessary step” in ensuring the future success of the national teams.In a joint statement, the CSPA and CMNSTPA asked Canada Soccer for “transparent and comprehensive access” to financial records in light of recent funding cuts. They also want immediate action from the governing body to address the unauthorised use of player images, as well as financial restraints imposed by CSA’s agreement with Canada Business Soccer.Canada’s men went on strike in June 2022 after accusing CSA of “disrespect” over World Cup prize money and have said they “wholeheartedly support” the women’s side. The CSA spent $11m (£6.72m) on the men’s programme in 2021 and $5.1m (£3.11m) on the women’s programme.The women’s players said the “disgusting” discrepancy between the programmes became apparent at last year’s men’s World Cup. They are looking for the same backing for this year’s Women’s World Cup as the men received before Qatar, where they competed in the tournament for the first time in 37 years.Canada’s women, who are sixth in the world rankings and won Olympic gold in 2021, are in Group B for the World Cup, which takes place from 20 July to 20 August in Australia and New Zealand. Published on By Left-arm spinner Yuri Koththigoda excelled with a match bag of nine wickets as Richmond beat D.S. Senanayake College by an innings and 43 runs in the Under 19 traditional cricket encounter which ended before tea at Dombagoda on Friday. Koththigoda teamed up with Maheesha de Silva to rattle D.S. Senanayake for a meager total of 57 runs in the first innings. In their essay Richmond posted 233 runs with Janeth Kaushal top scoring with 61 runs. Batting for the second time DSS were bowled out for 133 runs. This time Koththigoda shared eight wickets with Sharon Abhishek to record their fifth outright victory of the season. At Reid Avenue, paceman Ranuka Malaviarachchi troubled Cambrians taking four early wickets. Royal restricted Prince of Wales to 136 runs before Dasis Manchanayake top scored with 91 runs for the home team to reach 185 for five wickets at stumps. Meanwhile, at Sooriyawewa, Maliyadewa topped 400 runs against Mahinda as Gayana Weerasinghe scored 149 runs inclusive of 17 fours and two sixes. In another traditional match, which ended in a draw, St. Anne’s took first innings honours against St. Joseph Vaz’s as Mahima Kotuwila scored a century to propel their total to 358 runs at Kurunegala. Richmond Maliyadeva top 400 runs at Sooriyawewa Maliyadeva 415 for 7 in 100 overs (Chamathkar Hettiarachchi 48, Pasindu Menaka 34, Chandupa Abeysinghe 38, Amesh Tennakoon 64, Gayana Weerasinghe 149, Jayamin Muthukumarana 38; Shehan Hasaranga 4/84)","pubDate":"2023-03-03 23:40:00","image_url":null,"source_id":"island","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Shane Warne death anniversary: Adam Gilchrist, Ed Sheeran and Bill Lawry remember cricket legend","link":"https://247newsaroundtheworld.com/sports/shane-warne-death-anniversary-adam-gilchrist-ed-sheeran-and-bill-lawry-remember-cricket-legend/","keywords":["Sports"],"creator":["247 News Around The World"],"video_url":null,"description":"247 News Around The World 247 News Around The World Today marks the first anniversary of Shane Warne’s passing, who died from… The post Shane Warne death anniversary: Adam Gilchrist, Ed Sheeran and Bill Lawry remember cricket legend appeared first on 247 News Around The World.","content":"Today marks the first anniversary of Shane Warne’s passing, who died from a heart attack while attending a wellness retreat in Thailand in news the cricket world has still not recovered from. He was only 52 years old, and the news of his death caused shockwaves around the globe, triggering a massive outpouring of grief and love, which still resonates profoundly today. Adam Gilchrist was one of Warne’s closest friends and he paid tribute to his great mate one year on from his passing. ‘It is still quite hard to believe, isn’t it?’ Gilchrist said in an interview with ABC Radio. ‘A bloke we thought was invincible, to think not only is he gone but it has been a year on.’ Warne, the late Andrew Symonds celebrate the good times during their time together in the Australian Test cricket team Warne and Gilchrist pose for a portrait at the Junction Oval and celebrate a wicket in the Australian ODI team ‘I think what made so many people [love him] … although they didn’t know Shane, I think the fact he was such a character, he was almost reflective of what every grade cricket club has around in their team,’ he said. ‘They have a guy that works all week does their job and then goes to training a couple of those nights and then just lives for the weekend to go and play cricket with his mates.’ It was that rawness, that sense that Warne was a real person – warts and all – that endeared him to so many. ‘He’s very real. The fact that he found his way into a bit of trouble here and there off the field, that made him even more real,’ Gilchrist said. ‘He wasn’t infallible, he made mistakes like the rest of us. ‘I think that is what made him so engaging to people. Although he was a Hollywood type status personality, he could still engage with, for want of a better term, the common people. ‘He would go out the back of the commentary box to have a dart or just sit and next thing you know he is teaching a kid how to bowl leg spin because an enquiring dad came up and asked him. ‘Yet he could mix with royalty as well. He was intriguing and I think everyone felt a level of engagement with him at some point.’ Warne talks to a group of fans in tsunami-hit Galle cricket stadium. He always had the time to engage with fans around the world Australian fans show their support for Warne on day two of the fourth Ashes Test match between Australia and England at the Melbourne Cricket Ground in 2006 There are so many memories that Gilchrist and Aussie Test cricket fans will never forget, like the Gatting ball and his 700th Test wicket. Gilchrist said it was a privilege to be one of only two wicketkeepers, including Ian Healy, to ever keep wicket to Warne as Test match level. ‘It was mesmerising,’ he said. ‘In one Shane Warne delivery you could almost sum up his entire personality and character. ‘Standing and waiting at the top of his mark, waiting and pausing until it felt like perhaps the whole cricketing world for that one moment was honing in on him. ‘Starting a mind game and a battle with the batter at the other end. ‘He was all up for a battle. He was a very aggressive type that like a challenge. ‘You mention the Gatting ball, I reckon I kept wicket to 100 or more very, very similar deliveries.’ Former Australian and Rajasthan Royals player Shane Warne talks with children from the Rajasthan Royals UK academy Another close associate of Warnie that shared his stories with the cricket legend was Tom Malone, the former boss of Wide World of Sports. One anecdote that Malone shared highlight Warnie’s giving nature, involving the late Kerry Packer, a tour of India and a mobile phone. ‘His first contract wasn’t actually for money, but Kerry gave him a phone for a tour of India,’ Malone told Ben Fordham on 2GB. ‘Warnie, as generous as he was, let all the team use the phone while they were touring India. ‘So when he got back I think the bill for the phone was about $50,000USD. So Kerry said ‘well you’re not getting a phone again, we will put you on a salary’. There was also the brief career of Warnie the sports newsreader. ‘He then got him to read the 11am news one day in Melbourne for sports update,’ Malone said. ‘As Warnie tells the story, Kerry rang him the next day straight afterwards and said “I think you better stick to spin bowling”.’ A SNAPSHOT OF GREATNESS Widely regarded as one of cricket’s greatest bowlers in history, Warne was selected as one of five Wisden Cricketers of the Century in 2000 by a panel of cricket experts. He was the only specialist bowler and the only one who was still playing at the time. Warne made his Test debut in 1992 and went on to take over 1,000 wickets in Tests and One Day Internationals (ODIs). Until 2007, his record of 708 Test wickets was the highest number of wickets taken by any bowler in Test cricket. He was also named one of the Wisden Cricketers of the Year in the 1994 Wisden Cricketers’ Almanack and was the Wisden Leading Cricketer in the World in both 1997 and 2004. While Warne’s partying antics were well reported during his career, there was one time the legendary leg-spinner sacrificed a night on the tiles to help his great mate and fellow commentator Bill Lawry. When Channel Nine lost the rights to the cricket in 2018, a party was held in Sydney for the end of an era with all past and present commentators invited. ‘He was actually flying from overseas that morning, straight into Melbourne,’ Malone said. ‘Turned around quickly and said “how is Bill Lawry coming up?” ‘At this point Bill was 79 or 80 and was not commentating or moving around the country as much. Bill Lawry and Shane Warne are two of the greatest Victorians to ever play the game of cricket ‘He said “I’ll bring Bill up” and he chaperoned Bill, he brought Bill up on the plane, got him from the airport to Channel Nine. ‘Warnie would have liked to kick on, because a few of the others kicked on until well into the night. ‘But Warnie said ‘no I have to accompany Bill back home’. ‘Once you had Warnie’s trust, you had it for life. ‘The way he looked after people, he was big on manners, big on kindness and generosity. ‘He really was an incredible individual.’ Sheeran and Warne were unlikely friends, showing the level of reach the great Aussie leg-spinner had Summer, Brooke and Jackson Warne got to meet Sheeran on his tour of Australia and the singer paid tribute to their father at his MCG concert During his first concert in Melbourne on Thursday night, Ed Sheeran honoured his friend Shane Warne by performing The A-Team in front of a crowd of 100,000 at the MCG. Sheeran acknowledged Warne’s absence, remarking that the venue was special to him, before dedicating the song to ‘Shane and his kids.’ ‘Being in the MCG tonight and not having my friend Shane Warne here to watch this … I know this venue was really, really special to him,’ Sheeran said. Warne’s children Brooke, Jackson, and Summer were present at the concert, with Brooke sharing the performance on her Instagram and expressing her love for both Ed and her late father. ‘Love you Ed and miss you Dad,’ she posted. Post source: Daily mail","pubDate":"2023-03-03 20:52:40","image_url":null,"source_id":"247newsaroundtheworld","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"\"मुझे एमएस धोनी से इसकी सबसे कम उम्मीद थी\", कार्तिक ने किया अपनी कमेंट्री को लेकर खुलासा","link":"https://sports.ndtv.com/hindi/cricket/i-least-expected-this-ms-dhoni-dinesh-karthik-reveals-about-his-commentary-3832518#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"IPL 2023: अंतरराष्ट्रीय कमेंट्री में खुद को स्थापित कर चुके दिनेश कार्तिक (Dinesh Karthik) शुरू होने वाली आईपीएल में आरसीबी के लिए खेलते दिखायी पड़ेंगे.","content":"भारत के पूर्व विकेटकीपर दिनेश कार्तिक आईपीएल में खेलते दिखेंगे रॉयल चैलेंजर्स बेंगलोर के विकेटकीपर-बल्लेबाज ने दिनेश कार्तिक ने कहा कि विश्व कप विजेता पूर्व भारतीय कप्तान महेंद्र सिंह धोनी (MS Dhoni) उनकी कमेंट्री का ‘काफी लुत्फ उठाते' हैं. भारत-ऑस्ट्रेलिया टेस्ट श्रृंखला में फिलहाल कामेंट्री कर रहे 37 वर्षीय कार्तिक (Dinesh Karthik) आगामी आईपीएल (IPL 2023) में मैदान पर आरसीबी का प्रतिनिधित्व करते हुए दिखेंगे. कार्तिक ने ‘आरसीबी पॉडकास्टर' पर कहा कि धोनी से मिले तारीफ के एक-एक शब्दों ने उनके लिए कमेंट्री को और खास बना दिया. कार्तिक ने कहा, ‘मुझे कमेंट्री के जो थोड़े बहुत मौके मिले है, मैंने उसका आनंद लिया. मुझे लगता है कि मुझे खेल के बारे में बोलने, विश्लेषण करने में बहुत मजा आ रहा है. मैं इस तरह से वर्णन करना चाहता हूं कि इस खेल को देखने वाले हर व्यक्ति के लिए कुछ सार्थक हो.' उन्होंने कहा, ‘आप जानते हैं, मैंने हमेशा अपने तरीके से एक स्थिति से बाहर निकलने की कोशिश की और इसे उस तरह से स्पष्ट करने की कोशिश की, जिस तरह से मैंने सोचा था.' भारत के लिए खेल के तीनों प्रारूपों में खेल चुके कार्तिक ने कहा, ‘मुझे सबसे बड़ी प्रशंसा उस व्यक्ति से मिली जिसकी मुझे सबसे कम उम्मीद थी. मैं धोनी की बात कर रहा हूं. उन्होंने मुझे कहा, ‘मैंने वास्तव में कमेंट्री का आनंद लिया. बहुत-बहुत अच्छा. आप शानदार कर रहे है.' आरसीबी के लिए पिछले सत्र में 183 के शानदार स्ट्राइक रेट से 330 रन बनाने वाले इस खिलाड़ी ने कहा, ‘इस पर मुझे सुखद आश्चर्य हुआ. मैंने उन्हें शुक्रिया कहा. आप जानते है कि यह मेरे लिए बड़ी बात है. वह खेल पर करीब से नजर रखते हैं. इसलिए उनसे ऐसी बातें सुनना वास्तव में अच्छा थाय और मुझे खुशी है कि उन्होंने मेरी कमेंट्री का आनंद लिया. * * पढ़ें देश-विदेश की ख़बरें अब हिन्दी में ( ) | (Elections 2023) के लाइव अपडेट के लिए हमें फॉलो करें और जानें इलेक्शन रिज़ल्ट्स (Election Results) सबसे पहले | लाइव खबर देखें: फॉलो करे:","pubDate":"2023-03-03 18:34:35","image_url":"https://c.ndtvimg.com/2023-03/b12hp268_dinesh-karthik-806_625x300_02_March_23.jpg","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Solid gold: NRL season opener showed the benefit of finding a winner","link":"https://www.theage.com.au/sport/solid-gold-nrl-season-opener-showed-the-benefit-of-finding-a-winner-20230303-p5cp3q.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":["Sport"],"creator":["Peter FitzSimons"],"video_url":null,"description":"Harry Grant’s match-winner on Thursday night capped a cracking return for the NRL.","content":"You’re right, that was a cracking opener for the NRL season, one that could barely have been scripted better. It was a see-sawing game, with the score at 12-12 at the end of regulation time. The deadlock was only broken in golden point when the Storm hooker Harry Grant scored a barn- burning beauty with a touch of Toutai Kefu’s famous “Inspector Gadget” try two decades ago about it – with, even as three men hit him well out from the line, the impossibly long hand reaching out to plonk it down. Game over. And the Storm win their opening round match for the 20th time in a row . Every now and then you see criticism of the golden point finish. This climax showed how wrong-headed that talk is. Imagine that great match had finished with a 12-12 draw, bearing in mind the famous dictum that “a draw is likely kissing your sister.” Instead, we had this superb sporting theatre, with a fabulous climax. Just when you think most professional sport is corporate soullessness in boots and running shoes, this happens. During the week, no less than the Barmy Army made a moving gesture by putting a wonderful rendition of West Side Story’s signature tune Maria on Twitter , while tagging Australian cricket captain Pat Cummins and noting “‘Maria’ from West Side Story in support of Pat Cummins, who’s mother Maria has entered palliative care.” The Barmy Army in action. Credit: Jessica Hromas Cummins graciously replied, writing, “This is amazing @TheBarmyArmy , thankyou. Mum loved watching this and felt very touched.” Maria Cummins is, as readers might remember, a good egg. I have noted here a couple of times the story of the little boy on summer holidays a few years ago, who was noted by the neighbours to spend hours on end out in the backyard either hitting a ball on the end of a rope hanging from a tree or bowling a tennis ball against the garage door. The immediate neighbours got his name and address, and shortly after he got home, he received a package in the post from “P. Cummins”, with a nice note from the Australian fast bowler, and two signed match shirts, with some signed posters. The neighbours were Peter and Maria Cummins. Syd Fischer, who died earlier this week, aged 95? I knew him a very little, and just a few years ago used to run into him at the gym we both frequented, even though he’d already cracked 90. As a businessman in this town, he will be remembered as a singularly tough ... fellow. As a sailor, he was an enormous contributor to Australian excellence, competing in no fewer than 40 Sydney to Hobart races, and his eight iterations of Ragamuffins were ubiquitous in many of them. Syd Fischer ahead of the 1992 Sydney to Hobart. Credit: Craig Golding Yachts he skippered won line honours for the Hobart race twice in 1988 and 1990 and the whole shooting match on handicap in 1992. In 2015, he became the oldest competitor in the race when competitor at the age of 87. As to Americas Cup campaigns, he competed in five, and in an obituary this week, the Australian Sailing website noted “In addition to his own achievements, Fischer was also noted for launching the America’s Cup careers of some of today’s most famous Australian yachtsmen, in particular Jimmy Spithill, lain Murray and Hugh Treharne, who was tactician aboard the 1983 Cup winner, Australia I.” A quarter-century ago, Fischer built an America’s Cup campaign around Spithill’s skill, making him the youngest skipper in Cup history. “He’s a 20-year-old with a 40-year-old head,” Fischer said. “He’s cool. I met him when he was still at school. I remember thinking, this is a kid who’s really with it. He’s not some petulant, spoilt brat. He’s just a good ordinary Aussie – a bit like a Kiwi, I guess.” As near as I can work out, Fischer took much the same approach to sailing as he did in the building business. When asked once about his notoriously tough approach in both he didn’t back down. “Well, if I meet an arsehole I can be an arsehole, too. It’s as simple as that.” Vale Syd. Whatever else, an Australian original. No, no, no, I won’t snarl unpleasantly and with unseemly joy over the fact that the first televised ratings of Greg Norman’s LIV Golf series for 2023 were lower than a snake’s belly button, and you can’t make me. Can I, however, just express a little wonder in tune with the international golf media, that the ratings were that low? In sports-mad America, it is nigh on inconceivable that a televised tournament boasting several world-class golf stars, could pull just two – count ’em, two – households per 1000. That, friends, is just higher than a test pattern. Greg Norman at the LIV Golf event in Mexico. Credit: Getty Images What does it mean? I’ll go with the bleeding obvious, please Tony Barber. I say it is a comprehensive rejection of everything that LIV stands for, starting with a tournament financed by the brutal Saudi regime, fronted by Norman, and boasting an entirely different format that the golf community clearly just don’t want. As this column has noted there was never any complaint in the first place about the way it works at the Masters, the British Open et al, with a staggered start, a cut of the lowest half of the field after two days and the final, wonderful build to the back nine on Sunday. Instead of this tried-and-true traditional format, Norman pioneered golf where there is no halfway cut; everyone gets prize money; players are in made-up “teams”; there are shotgun starts so all 18 holes have golfers ready to tee off when the broadcast begins – and if I’m Arthur, you must be Martha, but no-one is quite sure, so what else is on? “LIV had a real opportunity to draw in viewers considering the weak field in the PGA Tour over the weekend,” the New York Post commented, “and flopped spectacularly.” Good! The Storm’s Cameron Munster when asked after Thursday night’s match if the compound fracture of his finger would require surgery: “You’re asking the wrong bloke. I’m a footballer.” Dan Wolen from USA Today after the first televised round of LIV Golf for 2023 drew ratings just slightly higher than a test pattern: “ Can you really call it ‘Golf But Louder’ when you’d need a stethoscope to determine if this tour even has a pulse?” Eamon Lynch writes in Golfweek : “Norman’s LIV Golf has a solitary anchor that prevents it from being dashed on the rocks of commercial reality, the Public Investment Fund of Saudi Arabia ...” North Melbourne coach Alastair Clarkson , to a female reporter Tarryn Thomas: “Your time will come.” Called out on it, Clarkson apologised. The last words of Australian captain Meg Lanning before the World T20 final against South Africa in Cape Town: “Let’s f---ing go!” They did, and beat the South Africans by 19 runs. Australian surfing star Molly Picklum: “Surfing-wise, I do feel like I can compete with the best in the world. And then competitive-wise, you’ve just got to make that shift when it’s your idols ... Beating people like that, who are so intelligent when it comes to competition and strategy, and they’re also the strongest women surfers in the world, that gets me excited.” Tommy Fury after defeating Jake Paul in the most irrelevant event ever: “Tonight, I make my own legacy. I am Tommy Fury.” Thanks, Scoop. Lawyer Michel Margalit on the planned concussion class action against the AFL: “The former players have told us heartbreaking stories of the impact that concussion sustained playing in the AFL has had on their personal lives, their families and their career after their footy ended. Players often enter into AFL careers as teenagers, without the life experience or perspective to understand the life-long debilitating impacts of concussion. These players need to be protected and adequately cared for if injured.” Storm coach Craig Bellamy: “I’m pretty sure this is gonna be my last year as a head coach. I’ll still be around the club a bit in a part-time role at the end of this year, but nothing’s really changed. I’m not quite sure when the club wants a definite answer, but I want to give [them] plenty of time to find a new coach ... I can’t see anything changing this year as to me not retiring at the end of the year.” Novak Djokovic on breaking Steffi Graf’s record for most weeks as world No. 1: “It’s surreal to be that many weeks No. 1, to match Graf - one of the all-time greats. Just being amongst these legendary names is flattering. I’m proud of it.” He is at 378 weeks and counting. Ben Stokes on losing to New Zealand by one run: “That game as a whole, in terms of what Test cricket’s about, was just incredible. Sometimes things don’t happen the way you want them to but it was a good one, wasn’t it?” Steve Smith on captaining the Test side in the absence of Pat Cummins: “It normally brings the best out of me.” And it did. Sonny Bill Williams: “I’m a simple guy, my biggest learnings have come from my biggest mistakes. If you look up growth in the dictionary, I’m sure my name is underneath it.” Australia . Won the women’s T20 title for the third time in a row and the sixth time in the past seven editions. Riding the Dolphins ... Wayne Bennett. Credit: John Shakespeare Manchester United . Won the English League Cup, their first trophy since 2017. Dolphins . First new NRL team since Titans in 2007. Their first match, with Wayne Bennett in charge, is against the Roosters on Sunday. Waratahs . Back on the horse later on Saturday against the Fijian Drua. Ange Postecoglou . Won another trophy with Celtic. New Zealand. Just the fourth side to win a match when following on and also only did so by one run. Twitter: @Peter_Fitz Stream the NRL Premiership 2023 live and free on 9Now . Sports news, results and expert commentary. Sign up for our Sport newsletter .","pubDate":"2023-03-03 18:22:00","image_url":null,"source_id":"theage","category":["sports"],"country":["australia"],"language":"english"},{"title":"Rabada six-for leads South Africa to victory over West Indies","link":"http://island.lk/rabada-six-for-leads-south-africa-to-victory-over-west-indies-2/","keywords":["Sports","Featured"],"creator":["Thilina Walpola"],"video_url":null,"description":"West Indies threatened to turn the tables on South Africa by rolling them over for 116 on the third morning at SuperSport Park, but their own batters collapsed in similar spectacular fashion, chasing 247. Kagiso Rabada was chiefly responsible for that collapse, bagging 6 for 50 to dismiss them for 159 and seal South Africa’s […]","content":"West Indies threatened to turn the tables on South Africa by rolling them over for 116 on the third morning at SuperSport Park, but their own batters collapsed in similar spectacular fashion, chasing 247. Kagiso Rabada was chiefly responsible for that collapse, bagging 6 for 50 to dismiss them for 159 and seal South Africa’s victory inside three days on a track that offered variable bounce. Jermaine Blackwood’s thrilling counterattack – 79 off 93 balls – raised West Indies’ hopes, but Rabada found a little extra kick off the pitch to take him out and ensure the new era under captain Temba Bavuma and coach Shukri Conrad began with a victory in Centurion, where the South Africa women’s team that reached the T20 World Cup final five days ago was also in attendance. It was Roach who had set the scene for the day with his 11th five-for in Test cricket – and first away from home since 2017. He also surpassed Joel Garner’s tally of 259 to become West Indies’ fifth-highest wicket-taker in Test cricket. Just before lunch, Roach was warmly welcomed back by his team-mates, Jimmy Adams, West Indies’ director of cricket, and Brian Lara, the team mentor. However, the mood and tempo of the match changed quickly when Rabada struck either side of the lunch break. After having captain Kraigg Brathwaite caught down the leg side for a duck, he drew an outside edge from No. 3 Raymon Reifer. Tagenarine Chanderpaul kept playing and missing at full balls, but wasn’t particularly flustered against that length. It was the short ball that bothered him. He fell on his backside twice while trying to deal with them and then when he dared to hook a head-high bouncer from Marco Jansen, he could only top-edge it to midwicket for 10. Roston Chase misjudged an inswinger from Jansen and was castled after offering no shot. Then, when debutant Gerald Coetzee produced extra bounce to get rid of Kyle Mayers, West Indies were 33 for 5 in the 15th over. Blackwood came in and hoicked the seventh ball he faced, off Rabada, over square leg for four. He continued to regularly pump the ball over the top, running away to a 51-ball half-century. At the other end, Joshua Da Silva was more circumspect and contributed 17 to a 58-run sixth-wicket partnership before he fell to Rabada Blackwood, though, went after South Africa’s premier seamer and shanked him over his head for an imposing four. When Anrich Nortje shifted his angle to around the wicket, he ramped him over deep third for four. Jason Holder also operated at almost a run-a-ball in a 37-run seventh-wicket stand with Blackwood before Rabada had him nicking behind with a perfectly-pitched delivery. Though Rabada looked like wasn’t at his best earlier in the day, floating some balls in the lower 130-kph range, his seven-over spell post tea, in which he dismissed both Holder and Blackwood, was perhaps the most decisive passage of play. The day had started on a more promising note for West Indies. Roach struck with his first ball to cut Aiden Markram’s innings short at 47 off 58. He went wide of the crease, tricked Markram into playing for the inward angle from over the wicket but got it to straighten late off the seam and graze the outside edge. Marais Erasmus, the on-field umpire, didn’t rule Markram out initially, but he opted to walk back to the dressing room. In his next over, Roach went wide of the crease again, but this time he beat Jansen’s outside edge and hit the top of the off stump. Roach also helped snip the South African tail, but Coetzee’s spunky cameo (20 off 15 balls) pushed their lead closer to 250. Markram aside, Coetzee was the only South Africa batter to score more than 10 runs in their second innings. He then combined and Rabada, Jansen and Norje with the ball to compensate for their batting collapse and wrap the game up before drinks on the third afternoon. West Indies ( ) Published on By Canada Soccer has reached an interim funding agreement with its women’s national team players amid a dispute over equal pay.The deal reflects the men’s team’s terms with game-by-game incentives and results-based compensation. The women’s team had threatened to boycott a camp in April if demands over funding and pay inequality are not met.A final collective bargaining deal with both the men’s and women’s sides remains under negotiation. “Canada Soccer has announced that a deal in principle has been reached with the Women’s National Team Players on an interim funding agreement for 2022,” the Canada Soccer Association (CSA) said in a statement on Thursday. The women’s team’s last agreement with CSA expired in 2021. In February, Canada’s women called off a planned strike because of the governing body’s threats of legal action, but they protested during the recent SheBelieves Cup by wearing purple T-shirts with the phrase “enough is enough” before their matches. “This is about respect, this is about dignity, and this is about equalising the competitive environment in a world that is fundamentally unequal,” Canada Soccer’s general secretary Earl Cochrane said. “We have been consistent and public about the need to have fairness and equal pay be pillars of any new agreements with our players, and we are delivering on that today.” Earlier this week, Canada Soccer president Nick Bontis announced his resignation, a decision welcomed by the Canadian Soccer Players’ Association (CSPA) and Canadian Men’s National Soccer Team Players’ Association (CMNSTPA) as “one necessary step” in ensuring the future success of the national teams.In a joint statement, the CSPA and CMNSTPA asked Canada Soccer for “transparent and comprehensive access” to financial records in light of recent funding cuts. They also want immediate action from the governing body to address the unauthorised use of player images, as well as financial restraints imposed by CSA’s agreement with Canada Business Soccer.Canada’s men went on strike in June 2022 after accusing CSA of “disrespect” over World Cup prize money and have said they “wholeheartedly support” the women’s side. The CSA spent $11m (£6.72m) on the men’s programme in 2021 and $5.1m (£3.11m) on the women’s programme.The women’s players said the “disgusting” discrepancy between the programmes became apparent at last year’s men’s World Cup. They are looking for the same backing for this year’s Women’s World Cup as the men received before Qatar, where they competed in the tournament for the first time in 37 years.Canada’s women, who are sixth in the world rankings and won Olympic gold in 2021, are in Group B for the World Cup, which takes place from 20 July to 20 August in Australia and New Zealand. Published on By Left-arm spinner Yuri Koththigoda excelled with a match bag of nine wickets as Richmond beat D.S. Senanayake College by an innings and 43 runs in the Under 19 traditional cricket encounter which ended before tea at Dombagoda on Friday. Koththigoda teamed up with Maheesha de Silva to rattle D.S. Senanayake for a meager total of 57 runs in the first innings. In their essay Richmond posted 233 runs with Janeth Kaushal top scoring with 61 runs. Batting for the second time DSS were bowled out for 133 runs. This time Koththigoda shared eight wickets with Sharon Abhishek to record their fifth outright victory of the season. At Reid Avenue, paceman Ranuka Malaviarachchi troubled Cambrians taking four early wickets. Royal restricted Prince of Wales to 136 runs before Dasis Manchanayake top scored with 91 runs for the home team to reach 185 for five wickets at stumps. Meanwhile, at Sooriyawewa, Maliyadewa topped 400 runs against Mahinda as Gayana Weerasinghe scored 149 runs inclusive of 17 fours and two sixes. In another traditional match, which ended in a draw, St. Anne’s took first innings honours against St. Joseph Vaz’s as Mahima Kotuwila scored a century to propel their total to 358 runs at Kurunegala. Richmond Maliyadeva top 400 runs at Sooriyawewa Maliyadeva 415 for 7 in 100 overs (Chamathkar Hettiarachchi 48, Pasindu Menaka 34, Chandupa Abeysinghe 38, Amesh Tennakoon 64, Gayana Weerasinghe 149, Jayamin Muthukumarana 38; Shehan Hasaranga 4/84) Published on By World number one Novak Djokovic continued his perfect start to 2023 by beating Hubert Hurkacz to reach the Dubai Tennis Championships semi-finals.The 35-year-old Serb took his record to 15-0 so far this year with a 6-3 7-5 win over Poland’s Hurkacz. Djokovic, who is chasing a sixth win in Dubai, was to face Daniil Medvedev for a place in Saturday’s final.Australian Open finalist Medvedev defeated Borna Coric 6-3 6-2 to stay on track for a third title this year. Meanwhile, defending champion Andrey Rublev beat Botic van de Zandschulp to progress.The second seed defeated his Dutch opponent 6-3 7-6 (7-3) and will play Alexander Zverev in the last four as the German overcame Lorenzo Sonego 7-5 6-4. Djokovic needed just 71 minutes to see off Hurkacz and is looking in fine form as he looks to win his third tournament of the year. “I found the rhythm on my serve throughout the second set,” he said. “I’m really glad with how I played under pressure.” Meanwhile, Djokovic is waiting for a response on his application for an exemption to visa rules on vaccines in order to enter the United States before the Masters 1000 event in Indian Wells, which begins on 8 March. The draw for that tournament takes place on Monday, and Djokovic said: “Whatever the decision is before the draw, if I’m not allowed I’m going to pull out, of course, before the draw.”","pubDate":"2023-03-04 00:01:03","image_url":null,"source_id":"island","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Canada women agree interim funding deal in equal pay dispute","link":"http://island.lk/canada-women-agree-interim-funding-deal-in-equal-pay-dispute/","keywords":["Sports"],"creator":["Thilina Walpola"],"video_url":null,"description":"Canada Soccer has reached an interim funding agreement with its women’s national team players amid a dispute over equal pay.The deal reflects the men’s team’s terms with game-by-game incentives and results-based compensation. The women’s team had threatened to boycott a camp in April if demands over funding and pay inequality are not met.A final collective […]","content":"Canada Soccer has reached an interim funding agreement with its women’s national team players amid a dispute over equal pay.The deal reflects the men’s team’s terms with game-by-game incentives and results-based compensation. The women’s team had threatened to boycott a camp in April if demands over funding and pay inequality are not met.A final collective bargaining deal with both the men’s and women’s sides remains under negotiation. “Canada Soccer has announced that a deal in principle has been reached with the Women’s National Team Players on an interim funding agreement for 2022,” the Canada Soccer Association (CSA) said in a statement on Thursday. The women’s team’s last agreement with CSA expired in 2021. In February, Canada’s women called off a planned strike because of the governing body’s threats of legal action, but they protested during the recent SheBelieves Cup by wearing purple T-shirts with the phrase “enough is enough” before their matches. “This is about respect, this is about dignity, and this is about equalising the competitive environment in a world that is fundamentally unequal,” Canada Soccer’s general secretary Earl Cochrane said. “We have been consistent and public about the need to have fairness and equal pay be pillars of any new agreements with our players, and we are delivering on that today.” Earlier this week, Canada Soccer president Nick Bontis announced his resignation, a decision welcomed by the Canadian Soccer Players’ Association (CSPA) and Canadian Men’s National Soccer Team Players’ Association (CMNSTPA) as “one necessary step” in ensuring the future success of the national teams.In a joint statement, the CSPA and CMNSTPA asked Canada Soccer for “transparent and comprehensive access” to financial records in light of recent funding cuts. They also want immediate action from the governing body to address the unauthorised use of player images, as well as financial restraints imposed by CSA’s agreement with Canada Business Soccer.Canada’s men went on strike in June 2022 after accusing CSA of “disrespect” over World Cup prize money and have said they “wholeheartedly support” the women’s side. The CSA spent $11m (£6.72m) on the men’s programme in 2021 and $5.1m (£3.11m) on the women’s programme.The women’s players said the “disgusting” discrepancy between the programmes became apparent at last year’s men’s World Cup. They are looking for the same backing for this year’s Women’s World Cup as the men received before Qatar, where they competed in the tournament for the first time in 37 years.Canada’s women, who are sixth in the world rankings and won Olympic gold in 2021, are in Group B for the World Cup, which takes place from 20 July to 20 August in Australia and New Zealand. Published on By Left-arm spinner Yuri Koththigoda excelled with a match bag of nine wickets as Richmond beat D.S. Senanayake College by an innings and 43 runs in the Under 19 traditional cricket encounter which ended before tea at Dombagoda on Friday. Koththigoda teamed up with Maheesha de Silva to rattle D.S. Senanayake for a meager total of 57 runs in the first innings. In their essay Richmond posted 233 runs with Janeth Kaushal top scoring with 61 runs. Batting for the second time DSS were bowled out for 133 runs. This time Koththigoda shared eight wickets with Sharon Abhishek to record their fifth outright victory of the season. At Reid Avenue, paceman Ranuka Malaviarachchi troubled Cambrians taking four early wickets. Royal restricted Prince of Wales to 136 runs before Dasis Manchanayake top scored with 91 runs for the home team to reach 185 for five wickets at stumps. Meanwhile, at Sooriyawewa, Maliyadewa topped 400 runs against Mahinda as Gayana Weerasinghe scored 149 runs inclusive of 17 fours and two sixes. In another traditional match, which ended in a draw, St. Anne’s took first innings honours against St. Joseph Vaz’s as Mahima Kotuwila scored a century to propel their total to 358 runs at Kurunegala. Richmond Maliyadeva top 400 runs at Sooriyawewa Maliyadeva 415 for 7 in 100 overs (Chamathkar Hettiarachchi 48, Pasindu Menaka 34, Chandupa Abeysinghe 38, Amesh Tennakoon 64, Gayana Weerasinghe 149, Jayamin Muthukumarana 38; Shehan Hasaranga 4/84) Published on By World number one Novak Djokovic continued his perfect start to 2023 by beating Hubert Hurkacz to reach the Dubai Tennis Championships semi-finals.The 35-year-old Serb took his record to 15-0 so far this year with a 6-3 7-5 win over Poland’s Hurkacz. Djokovic, who is chasing a sixth win in Dubai, was to face Daniil Medvedev for a place in Saturday’s final.Australian Open finalist Medvedev defeated Borna Coric 6-3 6-2 to stay on track for a third title this year. Meanwhile, defending champion Andrey Rublev beat Botic van de Zandschulp to progress.The second seed defeated his Dutch opponent 6-3 7-6 (7-3) and will play Alexander Zverev in the last four as the German overcame Lorenzo Sonego 7-5 6-4. Djokovic needed just 71 minutes to see off Hurkacz and is looking in fine form as he looks to win his third tournament of the year. “I found the rhythm on my serve throughout the second set,” he said. “I’m really glad with how I played under pressure.” Meanwhile, Djokovic is waiting for a response on his application for an exemption to visa rules on vaccines in order to enter the United States before the Masters 1000 event in Indian Wells, which begins on 8 March. The draw for that tournament takes place on Monday, and Djokovic said: “Whatever the decision is before the draw, if I’m not allowed I’m going to pull out, of course, before the draw.” Published on By India’s bid to defend 75 on the third day of the Indore Test started on the right note with R Ashwin striking off the second delivery of the day. After getting one to rip past Usman Khawaja’s outside edge in the first ball, he had him caught behind off the next ball with a similar delivery. Khawaja’s review went in vain, but that proved to be India’s lone moment of joy on the final day. While Travis Head and Marnus Labuschagne were kept on a tight leash for over ten overs by Ravindra Jadeja and Ashwin, the duo began to find a good measure of the spinners after settling in. Head began the charge by taking on Ashwin for a four and a six in the same over, which was backed up by Labuschagne’s loft off Jadeja as well. The sudden run flow put the spinners off, who had also got the ball changed at the tenth over mark. But even as Ashwin operated unchanged from one end, Australia began to press the accelerator. Head clobbered Umesh Yadav through the cover area for another boundary to get close to a fifty but before he could have a shot at it, Labuschagne finished the game off by lofting Ashwin over midwicket. The win gave Australia their first win of the series, and condemned India to their third home defeat in six years, two of which have come against a Steve Smith-led Australia. The victory also sealed Australia’s position in the World Test Championship final at the Oval in June this year. Australia ( )","pubDate":"2023-03-03 23:40:53","image_url":null,"source_id":"island","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Koththigoda rattles DSS as Richmond record fifth win","link":"http://island.lk/koththigoda-rattles-dss-as-richmond-record-fifth-win/","keywords":["Sports"],"creator":["Thilina Walpola"],"video_url":null,"description":"Under 19 Cricket by Reemus Fernando Left-arm spinner Yuri Koththigoda excelled with a match bag of nine wickets as Richmond beat D.S. Senanayake College by an innings and 43 runs in the Under 19 traditional cricket encounter which ended before tea at Dombagoda on Friday. Koththigoda teamed up with Maheesha de Silva to […]","content":"Left-arm spinner Yuri Koththigoda excelled with a match bag of nine wickets as Richmond beat D.S. Senanayake College by an innings and 43 runs in the Under 19 traditional cricket encounter which ended before tea at Dombagoda on Friday. Koththigoda teamed up with Maheesha de Silva to rattle D.S. Senanayake for a meager total of 57 runs in the first innings. In their essay Richmond posted 233 runs with Janeth Kaushal top scoring with 61 runs. Batting for the second time DSS were bowled out for 133 runs. This time Koththigoda shared eight wickets with Sharon Abhishek to record their fifth outright victory of the season. At Reid Avenue, paceman Ranuka Malaviarachchi troubled Cambrians taking four early wickets. Royal restricted Prince of Wales to 136 runs before Dasis Manchanayake top scored with 91 runs for the home team to reach 185 for five wickets at stumps. Meanwhile, at Sooriyawewa, Maliyadewa topped 400 runs against Mahinda as Gayana Weerasinghe scored 149 runs inclusive of 17 fours and two sixes. In another traditional match, which ended in a draw, St. Anne’s took first innings honours against St. Joseph Vaz’s as Mahima Kotuwila scored a century to propel their total to 358 runs at Kurunegala. Richmond Maliyadeva top 400 runs at Sooriyawewa Maliyadeva 415 for 7 in 100 overs (Chamathkar Hettiarachchi 48, Pasindu Menaka 34, Chandupa Abeysinghe 38, Amesh Tennakoon 64, Gayana Weerasinghe 149, Jayamin Muthukumarana 38; Shehan Hasaranga 4/84) Published on By West Indies threatened to turn the tables on South Africa by rolling them over for 116 on the third morning at SuperSport Park, but their own batters collapsed in similar spectacular fashion, chasing 247. Kagiso Rabada was chiefly responsible for that collapse, bagging 6 for 50 to dismiss them for 159 and seal South Africa’s victory inside three days on a track that offered variable bounce. Jermaine Blackwood’s thrilling counterattack – 79 off 93 balls – raised West Indies’ hopes, but Rabada found a little extra kick off the pitch to take him out and ensure the new era under captain Temba Bavuma and coach Shukri Conrad began with a victory in Centurion, where the South Africa women’s team that reached the T20 World Cup final five days ago was also in attendance. It was Roach who had set the scene for the day with his 11th five-for in Test cricket – and first away from home since 2017. He also surpassed Joel Garner’s tally of 259 to become West Indies’ fifth-highest wicket-taker in Test cricket. Just before lunch, Roach was warmly welcomed back by his team-mates, Jimmy Adams, West Indies’ director of cricket, and Brian Lara, the team mentor. However, the mood and tempo of the match changed quickly when Rabada struck either side of the lunch break. After having captain Kraigg Brathwaite caught down the leg side for a duck, he drew an outside edge from No. 3 Raymon Reifer. Tagenarine Chanderpaul kept playing and missing at full balls, but wasn’t particularly flustered against that length. It was the short ball that bothered him. He fell on his backside twice while trying to deal with them and then when he dared to hook a head-high bouncer from Marco Jansen, he could only top-edge it to midwicket for 10. Roston Chase misjudged an inswinger from Jansen and was castled after offering no shot. Then, when debutant Gerald Coetzee produced extra bounce to get rid of Kyle Mayers, West Indies were 33 for 5 in the 15th over. Blackwood came in and hoicked the seventh ball he faced, off Rabada, over square leg for four. He continued to regularly pump the ball over the top, running away to a 51-ball half-century. At the other end, Joshua Da Silva was more circumspect and contributed 17 to a 58-run sixth-wicket partnership before he fell to Rabada Blackwood, though, went after South Africa’s premier seamer and shanked him over his head for an imposing four. When Anrich Nortje shifted his angle to around the wicket, he ramped him over deep third for four. Jason Holder also operated at almost a run-a-ball in a 37-run seventh-wicket stand with Blackwood before Rabada had him nicking behind with a perfectly-pitched delivery. Though Rabada looked like wasn’t at his best earlier in the day, floating some balls in the lower 130-kph range, his seven-over spell post tea, in which he dismissed both Holder and Blackwood, was perhaps the most decisive passage of play. The day had started on a more promising note for West Indies. Roach struck with his first ball to cut Aiden Markram’s innings short at 47 off 58. He went wide of the crease, tricked Markram into playing for the inward angle from over the wicket but got it to straighten late off the seam and graze the outside edge. Marais Erasmus, the on-field umpire, didn’t rule Markram out initially, but he opted to walk back to the dressing room. In his next over, Roach went wide of the crease again, but this time he beat Jansen’s outside edge and hit the top of the off stump. Roach also helped snip the South African tail, but Coetzee’s spunky cameo (20 off 15 balls) pushed their lead closer to 250. Markram aside, Coetzee was the only South Africa batter to score more than 10 runs in their second innings. He then combined and Rabada, Jansen and Norje with the ball to compensate for their batting collapse and wrap the game up before drinks on the third afternoon. West Indies ( ) Published on By Canada Soccer has reached an interim funding agreement with its women’s national team players amid a dispute over equal pay.The deal reflects the men’s team’s terms with game-by-game incentives and results-based compensation. The women’s team had threatened to boycott a camp in April if demands over funding and pay inequality are not met.A final collective bargaining deal with both the men’s and women’s sides remains under negotiation. “Canada Soccer has announced that a deal in principle has been reached with the Women’s National Team Players on an interim funding agreement for 2022,” the Canada Soccer Association (CSA) said in a statement on Thursday. The women’s team’s last agreement with CSA expired in 2021. In February, Canada’s women called off a planned strike because of the governing body’s threats of legal action, but they protested during the recent SheBelieves Cup by wearing purple T-shirts with the phrase “enough is enough” before their matches. “This is about respect, this is about dignity, and this is about equalising the competitive environment in a world that is fundamentally unequal,” Canada Soccer’s general secretary Earl Cochrane said. “We have been consistent and public about the need to have fairness and equal pay be pillars of any new agreements with our players, and we are delivering on that today.” Earlier this week, Canada Soccer president Nick Bontis announced his resignation, a decision welcomed by the Canadian Soccer Players’ Association (CSPA) and Canadian Men’s National Soccer Team Players’ Association (CMNSTPA) as “one necessary step” in ensuring the future success of the national teams.In a joint statement, the CSPA and CMNSTPA asked Canada Soccer for “transparent and comprehensive access” to financial records in light of recent funding cuts. They also want immediate action from the governing body to address the unauthorised use of player images, as well as financial restraints imposed by CSA’s agreement with Canada Business Soccer.Canada’s men went on strike in June 2022 after accusing CSA of “disrespect” over World Cup prize money and have said they “wholeheartedly support” the women’s side. The CSA spent $11m (£6.72m) on the men’s programme in 2021 and $5.1m (£3.11m) on the women’s programme.The women’s players said the “disgusting” discrepancy between the programmes became apparent at last year’s men’s World Cup. They are looking for the same backing for this year’s Women’s World Cup as the men received before Qatar, where they competed in the tournament for the first time in 37 years.Canada’s women, who are sixth in the world rankings and won Olympic gold in 2021, are in Group B for the World Cup, which takes place from 20 July to 20 August in Australia and New Zealand. Published on By World number one Novak Djokovic continued his perfect start to 2023 by beating Hubert Hurkacz to reach the Dubai Tennis Championships semi-finals.The 35-year-old Serb took his record to 15-0 so far this year with a 6-3 7-5 win over Poland’s Hurkacz. Djokovic, who is chasing a sixth win in Dubai, was to face Daniil Medvedev for a place in Saturday’s final.Australian Open finalist Medvedev defeated Borna Coric 6-3 6-2 to stay on track for a third title this year. Meanwhile, defending champion Andrey Rublev beat Botic van de Zandschulp to progress.The second seed defeated his Dutch opponent 6-3 7-6 (7-3) and will play Alexander Zverev in the last four as the German overcame Lorenzo Sonego 7-5 6-4. Djokovic needed just 71 minutes to see off Hurkacz and is looking in fine form as he looks to win his third tournament of the year. “I found the rhythm on my serve throughout the second set,” he said. “I’m really glad with how I played under pressure.” Meanwhile, Djokovic is waiting for a response on his application for an exemption to visa rules on vaccines in order to enter the United States before the Masters 1000 event in Indian Wells, which begins on 8 March. The draw for that tournament takes place on Monday, and Djokovic said: “Whatever the decision is before the draw, if I’m not allowed I’m going to pull out, of course, before the draw.”","pubDate":"2023-03-03 23:40:16","image_url":null,"source_id":"island","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Djokovic beats Hurkacz to reach semi-finals in Dubai","link":"http://island.lk/djokovic-beats-hurkacz-to-reach-semi-finals-in-dubai/","keywords":["Sports"],"creator":["Thilina Walpola"],"video_url":null,"description":"World number one Novak Djokovic continued his perfect start to 2023 by beating Hubert Hurkacz to reach the Dubai Tennis Championships semi-finals.The 35-year-old Serb took his record to 15-0 so far this year with a 6-3 7-5 win over Poland’s Hurkacz. Djokovic, who is chasing a sixth win in Dubai, was to face Daniil Medvedev […]","content":"World number one Novak Djokovic continued his perfect start to 2023 by beating Hubert Hurkacz to reach the Dubai Tennis Championships semi-finals.The 35-year-old Serb took his record to 15-0 so far this year with a 6-3 7-5 win over Poland’s Hurkacz. Djokovic, who is chasing a sixth win in Dubai, was to face Daniil Medvedev for a place in Saturday’s final.Australian Open finalist Medvedev defeated Borna Coric 6-3 6-2 to stay on track for a third title this year. Meanwhile, defending champion Andrey Rublev beat Botic van de Zandschulp to progress.The second seed defeated his Dutch opponent 6-3 7-6 (7-3) and will play Alexander Zverev in the last four as the German overcame Lorenzo Sonego 7-5 6-4. Djokovic needed just 71 minutes to see off Hurkacz and is looking in fine form as he looks to win his third tournament of the year. “I found the rhythm on my serve throughout the second set,” he said. “I’m really glad with how I played under pressure.” Meanwhile, Djokovic is waiting for a response on his application for an exemption to visa rules on vaccines in order to enter the United States before the Masters 1000 event in Indian Wells, which begins on 8 March. The draw for that tournament takes place on Monday, and Djokovic said: “Whatever the decision is before the draw, if I’m not allowed I’m going to pull out, of course, before the draw.” Published on By Canada Soccer has reached an interim funding agreement with its women’s national team players amid a dispute over equal pay.The deal reflects the men’s team’s terms with game-by-game incentives and results-based compensation. The women’s team had threatened to boycott a camp in April if demands over funding and pay inequality are not met.A final collective bargaining deal with both the men’s and women’s sides remains under negotiation. “Canada Soccer has announced that a deal in principle has been reached with the Women’s National Team Players on an interim funding agreement for 2022,” the Canada Soccer Association (CSA) said in a statement on Thursday. The women’s team’s last agreement with CSA expired in 2021. In February, Canada’s women called off a planned strike because of the governing body’s threats of legal action, but they protested during the recent SheBelieves Cup by wearing purple T-shirts with the phrase “enough is enough” before their matches. “This is about respect, this is about dignity, and this is about equalising the competitive environment in a world that is fundamentally unequal,” Canada Soccer’s general secretary Earl Cochrane said. “We have been consistent and public about the need to have fairness and equal pay be pillars of any new agreements with our players, and we are delivering on that today.” Earlier this week, Canada Soccer president Nick Bontis announced his resignation, a decision welcomed by the Canadian Soccer Players’ Association (CSPA) and Canadian Men’s National Soccer Team Players’ Association (CMNSTPA) as “one necessary step” in ensuring the future success of the national teams.In a joint statement, the CSPA and CMNSTPA asked Canada Soccer for “transparent and comprehensive access” to financial records in light of recent funding cuts. They also want immediate action from the governing body to address the unauthorised use of player images, as well as financial restraints imposed by CSA’s agreement with Canada Business Soccer.Canada’s men went on strike in June 2022 after accusing CSA of “disrespect” over World Cup prize money and have said they “wholeheartedly support” the women’s side. The CSA spent $11m (£6.72m) on the men’s programme in 2021 and $5.1m (£3.11m) on the women’s programme.The women’s players said the “disgusting” discrepancy between the programmes became apparent at last year’s men’s World Cup. They are looking for the same backing for this year’s Women’s World Cup as the men received before Qatar, where they competed in the tournament for the first time in 37 years.Canada’s women, who are sixth in the world rankings and won Olympic gold in 2021, are in Group B for the World Cup, which takes place from 20 July to 20 August in Australia and New Zealand. Published on By Left-arm spinner Yuri Koththigoda excelled with a match bag of nine wickets as Richmond beat D.S. Senanayake College by an innings and 43 runs in the Under 19 traditional cricket encounter which ended before tea at Dombagoda on Friday. Koththigoda teamed up with Maheesha de Silva to rattle D.S. Senanayake for a meager total of 57 runs in the first innings. In their essay Richmond posted 233 runs with Janeth Kaushal top scoring with 61 runs. Batting for the second time DSS were bowled out for 133 runs. This time Koththigoda shared eight wickets with Sharon Abhishek to record their fifth outright victory of the season. At Reid Avenue, paceman Ranuka Malaviarachchi troubled Cambrians taking four early wickets. Royal restricted Prince of Wales to 136 runs before Dasis Manchanayake top scored with 91 runs for the home team to reach 185 for five wickets at stumps. Meanwhile, at Sooriyawewa, Maliyadewa topped 400 runs against Mahinda as Gayana Weerasinghe scored 149 runs inclusive of 17 fours and two sixes. In another traditional match, which ended in a draw, St. Anne’s took first innings honours against St. Joseph Vaz’s as Mahima Kotuwila scored a century to propel their total to 358 runs at Kurunegala. Richmond Maliyadeva top 400 runs at Sooriyawewa Maliyadeva 415 for 7 in 100 overs (Chamathkar Hettiarachchi 48, Pasindu Menaka 34, Chandupa Abeysinghe 38, Amesh Tennakoon 64, Gayana Weerasinghe 149, Jayamin Muthukumarana 38; Shehan Hasaranga 4/84) Published on By India’s bid to defend 75 on the third day of the Indore Test started on the right note with R Ashwin striking off the second delivery of the day. After getting one to rip past Usman Khawaja’s outside edge in the first ball, he had him caught behind off the next ball with a similar delivery. Khawaja’s review went in vain, but that proved to be India’s lone moment of joy on the final day. While Travis Head and Marnus Labuschagne were kept on a tight leash for over ten overs by Ravindra Jadeja and Ashwin, the duo began to find a good measure of the spinners after settling in. Head began the charge by taking on Ashwin for a four and a six in the same over, which was backed up by Labuschagne’s loft off Jadeja as well. The sudden run flow put the spinners off, who had also got the ball changed at the tenth over mark. But even as Ashwin operated unchanged from one end, Australia began to press the accelerator. Head clobbered Umesh Yadav through the cover area for another boundary to get close to a fifty but before he could have a shot at it, Labuschagne finished the game off by lofting Ashwin over midwicket. The win gave Australia their first win of the series, and condemned India to their third home defeat in six years, two of which have come against a Steve Smith-led Australia. The victory also sealed Australia’s position in the World Test Championship final at the Oval in June this year. Australia ( )","pubDate":"2023-03-03 23:40:08","image_url":null,"source_id":"island","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Head leads last leg of Australia’s victory march","link":"http://island.lk/head-leads-last-leg-of-australias-victory-march-2/","keywords":["Sports"],"creator":["Thilina Walpola"],"video_url":null,"description":"India’s bid to defend 75 on the third day of the Indore Test started on the right note with R Ashwin striking off the second delivery of the day. After getting one to rip past Usman Khawaja’s outside edge in the first ball, he had him caught behind off the next ball with a similar […]","content":"India’s bid to defend 75 on the third day of the Indore Test started on the right note with R Ashwin striking off the second delivery of the day. After getting one to rip past Usman Khawaja’s outside edge in the first ball, he had him caught behind off the next ball with a similar delivery. Khawaja’s review went in vain, but that proved to be India’s lone moment of joy on the final day. While Travis Head and Marnus Labuschagne were kept on a tight leash for over ten overs by Ravindra Jadeja and Ashwin, the duo began to find a good measure of the spinners after settling in. Head began the charge by taking on Ashwin for a four and a six in the same over, which was backed up by Labuschagne’s loft off Jadeja as well. The sudden run flow put the spinners off, who had also got the ball changed at the tenth over mark. But even as Ashwin operated unchanged from one end, Australia began to press the accelerator. Head clobbered Umesh Yadav through the cover area for another boundary to get close to a fifty but before he could have a shot at it, Labuschagne finished the game off by lofting Ashwin over midwicket. The win gave Australia their first win of the series, and condemned India to their third home defeat in six years, two of which have come against a Steve Smith-led Australia. The victory also sealed Australia’s position in the World Test Championship final at the Oval in June this year. Australia ( ) Published on By Canada Soccer has reached an interim funding agreement with its women’s national team players amid a dispute over equal pay.The deal reflects the men’s team’s terms with game-by-game incentives and results-based compensation. The women’s team had threatened to boycott a camp in April if demands over funding and pay inequality are not met.A final collective bargaining deal with both the men’s and women’s sides remains under negotiation. “Canada Soccer has announced that a deal in principle has been reached with the Women’s National Team Players on an interim funding agreement for 2022,” the Canada Soccer Association (CSA) said in a statement on Thursday. The women’s team’s last agreement with CSA expired in 2021. In February, Canada’s women called off a planned strike because of the governing body’s threats of legal action, but they protested during the recent SheBelieves Cup by wearing purple T-shirts with the phrase “enough is enough” before their matches. “This is about respect, this is about dignity, and this is about equalising the competitive environment in a world that is fundamentally unequal,” Canada Soccer’s general secretary Earl Cochrane said. “We have been consistent and public about the need to have fairness and equal pay be pillars of any new agreements with our players, and we are delivering on that today.” Earlier this week, Canada Soccer president Nick Bontis announced his resignation, a decision welcomed by the Canadian Soccer Players’ Association (CSPA) and Canadian Men’s National Soccer Team Players’ Association (CMNSTPA) as “one necessary step” in ensuring the future success of the national teams.In a joint statement, the CSPA and CMNSTPA asked Canada Soccer for “transparent and comprehensive access” to financial records in light of recent funding cuts. They also want immediate action from the governing body to address the unauthorised use of player images, as well as financial restraints imposed by CSA’s agreement with Canada Business Soccer.Canada’s men went on strike in June 2022 after accusing CSA of “disrespect” over World Cup prize money and have said they “wholeheartedly support” the women’s side. The CSA spent $11m (£6.72m) on the men’s programme in 2021 and $5.1m (£3.11m) on the women’s programme.The women’s players said the “disgusting” discrepancy between the programmes became apparent at last year’s men’s World Cup. They are looking for the same backing for this year’s Women’s World Cup as the men received before Qatar, where they competed in the tournament for the first time in 37 years.Canada’s women, who are sixth in the world rankings and won Olympic gold in 2021, are in Group B for the World Cup, which takes place from 20 July to 20 August in Australia and New Zealand. Published on By Left-arm spinner Yuri Koththigoda excelled with a match bag of nine wickets as Richmond beat D.S. Senanayake College by an innings and 43 runs in the Under 19 traditional cricket encounter which ended before tea at Dombagoda on Friday. Koththigoda teamed up with Maheesha de Silva to rattle D.S. Senanayake for a meager total of 57 runs in the first innings. In their essay Richmond posted 233 runs with Janeth Kaushal top scoring with 61 runs. Batting for the second time DSS were bowled out for 133 runs. This time Koththigoda shared eight wickets with Sharon Abhishek to record their fifth outright victory of the season. At Reid Avenue, paceman Ranuka Malaviarachchi troubled Cambrians taking four early wickets. Royal restricted Prince of Wales to 136 runs before Dasis Manchanayake top scored with 91 runs for the home team to reach 185 for five wickets at stumps. Meanwhile, at Sooriyawewa, Maliyadewa topped 400 runs against Mahinda as Gayana Weerasinghe scored 149 runs inclusive of 17 fours and two sixes. In another traditional match, which ended in a draw, St. Anne’s took first innings honours against St. Joseph Vaz’s as Mahima Kotuwila scored a century to propel their total to 358 runs at Kurunegala. Richmond Maliyadeva top 400 runs at Sooriyawewa Maliyadeva 415 for 7 in 100 overs (Chamathkar Hettiarachchi 48, Pasindu Menaka 34, Chandupa Abeysinghe 38, Amesh Tennakoon 64, Gayana Weerasinghe 149, Jayamin Muthukumarana 38; Shehan Hasaranga 4/84) Published on By World number one Novak Djokovic continued his perfect start to 2023 by beating Hubert Hurkacz to reach the Dubai Tennis Championships semi-finals.The 35-year-old Serb took his record to 15-0 so far this year with a 6-3 7-5 win over Poland’s Hurkacz. Djokovic, who is chasing a sixth win in Dubai, was to face Daniil Medvedev for a place in Saturday’s final.Australian Open finalist Medvedev defeated Borna Coric 6-3 6-2 to stay on track for a third title this year. Meanwhile, defending champion Andrey Rublev beat Botic van de Zandschulp to progress.The second seed defeated his Dutch opponent 6-3 7-6 (7-3) and will play Alexander Zverev in the last four as the German overcame Lorenzo Sonego 7-5 6-4. Djokovic needed just 71 minutes to see off Hurkacz and is looking in fine form as he looks to win his third tournament of the year. “I found the rhythm on my serve throughout the second set,” he said. “I’m really glad with how I played under pressure.” Meanwhile, Djokovic is waiting for a response on his application for an exemption to visa rules on vaccines in order to enter the United States before the Masters 1000 event in Indian Wells, which begins on 8 March. The draw for that tournament takes place on Monday, and Djokovic said: “Whatever the decision is before the draw, if I’m not allowed I’m going to pull out, of course, before the draw.”","pubDate":"2023-03-03 23:40:05","image_url":null,"source_id":"island","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"PSG’s Lionel Messi receives threatening note after family’s store attacked in Argentina","link":"http://island.lk/psgs-lionel-messi-receives-threatening-note-after-familys-store-attacked-in-argentina/","keywords":["Sports"],"creator":["Thilina Walpola"],"video_url":null,"description":"Gunmen left a threatening message for Paris Saint-Germain forward Lionel Messi after attacking a supermarket owned by his in-laws in Rosario, Argentina, Rosario police confirmed on Thursday.Fourteen shots were reportedly fired at the shutters and front door of the food store “Unico,” which is located in the Lavalle district of Rosario, in the early hours […]","content":"Gunmen left a threatening message for Paris Saint-Germain forward Lionel Messi after attacking a supermarket owned by his in-laws in Rosario, Argentina, Rosario police confirmed on Thursday.Fourteen shots were reportedly fired at the shutters and front door of the food store “Unico,” which is located in the Lavalle district of Rosario, in the early hours of Thursday by two individuals on a motorbike. Nobody was injured in the early morning attack, and it was unclear why assailants would target Messi or the Unico supermarket in the country’s third-largest city of Rosario, owned by the family of his wife, Antonela Roccuzzo. Police also said the attackers left a threatening note written on a piece of cardboard that said: “Messi, we are waiting for you. Javkin is a drug dealer. He is not going to look after you.” An investigation is underway. Pablo Javkin is the mayor of Rosario, the largest city in the central province of Santa Fe, 300 kilometres (186 miles) north of Buenos Aires in Argentina.After Thursday’s incident, Javkin spoke to reporters about the increase in violence in Rosario and the shortage of police and lack of protection in the city. Javkin’s concerns are not new. He had voiced his frustration earlier this week about the lack of protection and the need for more police officers in a city where crime is on the rise.Javkin tweeted: “Rosario is 300km from Buenos Aires, it is near. We want to get all the resources against crime that Argentina has to take care of us, to protect this city that gives the country glory and science, countryside and art, federalism and union.” Neither Messi, who on Monday won Best FIFA Men’s Player after captaining Argentina to the 2022 World Cup trophy, nor his wife — both are from Rosario — has commented on the incident. Widely considered the greatest soccer player of all time, Messi currently plays for Paris Saint-Germain and spends much of his time overseas, although he often visits Rosario, where he has a home in the suburb of Funes. The French team posted a photo on social media of Messi training on Thursday morning. In Rosario, prosecutor Federico Rébola said that authorities were reviewing security camera footage and that the investigation was “preliminary.” It was the first time Messi’s in-laws had received this kind of threat, he added. Celia Arena, justice minister for Santa Fe province, where Rosario is located, said the attack amounted to “terrorism” by a “mafia” group meant to intimidate the broader population. “The aim is to deliberately cause terror in the population and discourage those of us who are fighting against criminal violence, knowing that it will be an event of global significance,” Arena wrote in a social media post. Javkin, a center-left politician in opposition to the ruling Peronist coalition, appeared to throw suspicion of complicity for the attack on both criminal gangs and federal security officials. “I doubt everyone, even those who are supposed to protect us,” Javkin said in an interview with a local radio station. He said he had recently had “very strong discussions” with members of the federal security forces over the past couple of weeks demanding that they crack down on the city’s crime. “Where are the ones who need to take care of us?” Javkin said. “It’s clear that those who have the weapons and have the possibility of investigating the criminals aren’t doing it, and it’s very easy for any gang to carry out something like this.” The federal government’s security minister, Aníbal Fernández, said that drug-related violence was not a recent phenomenon in the city and that Thursday’s attack was typical of what has happened there “for the last 20 years.” He said that the incident was an example of how drug traffickers “have won” in Rosario and that “we have to reverse that.” Opposition politicians blamed President Alberto Fernández’s administration for the continuing violence in Rosario. His predecessor, Mauricio Macri, characterized the events as a warning that the country cannot “coexist” with drug traffickers. Messi, 35, is currently renegotiating a contract with PSG that ends this year amid speculation that the soccer superstar could decide to end his career playing for one of the local Rosario clubs, Newell’s. Messi could travel to Argentina later this month to join the national squad in playing two friendly matches. One takes place March 23 against Panama in Buenos Aires, while the other one will be five days later against Curacao in the northern city of Santiago del Estero. (ESPN) Published on By West Indies threatened to turn the tables on South Africa by rolling them over for 116 on the third morning at SuperSport Park, but their own batters collapsed in similar spectacular fashion, chasing 247. Kagiso Rabada was chiefly responsible for that collapse, bagging 6 for 50 to dismiss them for 159 and seal South Africa’s victory inside three days on a track that offered variable bounce. Jermaine Blackwood’s thrilling counterattack – 79 off 93 balls – raised West Indies’ hopes, but Rabada found a little extra kick off the pitch to take him out and ensure the new era under captain Temba Bavuma and coach Shukri Conrad began with a victory in Centurion, where the South Africa women’s team that reached the T20 World Cup final five days ago was also in attendance. It was Roach who had set the scene for the day with his 11th five-for in Test cricket – and first away from home since 2017. He also surpassed Joel Garner’s tally of 259 to become West Indies’ fifth-highest wicket-taker in Test cricket. Just before lunch, Roach was warmly welcomed back by his team-mates, Jimmy Adams, West Indies’ director of cricket, and Brian Lara, the team mentor. However, the mood and tempo of the match changed quickly when Rabada struck either side of the lunch break. After having captain Kraigg Brathwaite caught down the leg side for a duck, he drew an outside edge from No. 3 Raymon Reifer. Tagenarine Chanderpaul kept playing and missing at full balls, but wasn’t particularly flustered against that length. It was the short ball that bothered him. He fell on his backside twice while trying to deal with them and then when he dared to hook a head-high bouncer from Marco Jansen, he could only top-edge it to midwicket for 10. Roston Chase misjudged an inswinger from Jansen and was castled after offering no shot. Then, when debutant Gerald Coetzee produced extra bounce to get rid of Kyle Mayers, West Indies were 33 for 5 in the 15th over. Blackwood came in and hoicked the seventh ball he faced, off Rabada, over square leg for four. He continued to regularly pump the ball over the top, running away to a 51-ball half-century. At the other end, Joshua Da Silva was more circumspect and contributed 17 to a 58-run sixth-wicket partnership before he fell to Rabada Blackwood, though, went after South Africa’s premier seamer and shanked him over his head for an imposing four. When Anrich Nortje shifted his angle to around the wicket, he ramped him over deep third for four. Jason Holder also operated at almost a run-a-ball in a 37-run seventh-wicket stand with Blackwood before Rabada had him nicking behind with a perfectly-pitched delivery. Though Rabada looked like wasn’t at his best earlier in the day, floating some balls in the lower 130-kph range, his seven-over spell post tea, in which he dismissed both Holder and Blackwood, was perhaps the most decisive passage of play. The day had started on a more promising note for West Indies. Roach struck with his first ball to cut Aiden Markram’s innings short at 47 off 58. He went wide of the crease, tricked Markram into playing for the inward angle from over the wicket but got it to straighten late off the seam and graze the outside edge. Marais Erasmus, the on-field umpire, didn’t rule Markram out initially, but he opted to walk back to the dressing room. In his next over, Roach went wide of the crease again, but this time he beat Jansen’s outside edge and hit the top of the off stump. Roach also helped snip the South African tail, but Coetzee’s spunky cameo (20 off 15 balls) pushed their lead closer to 250. Markram aside, Coetzee was the only South Africa batter to score more than 10 runs in their second innings. He then combined and Rabada, Jansen and Norje with the ball to compensate for their batting collapse and wrap the game up before drinks on the third afternoon. West Indies ( ) Published on By Canada Soccer has reached an interim funding agreement with its women’s national team players amid a dispute over equal pay.The deal reflects the men’s team’s terms with game-by-game incentives and results-based compensation. The women’s team had threatened to boycott a camp in April if demands over funding and pay inequality are not met.A final collective bargaining deal with both the men’s and women’s sides remains under negotiation. “Canada Soccer has announced that a deal in principle has been reached with the Women’s National Team Players on an interim funding agreement for 2022,” the Canada Soccer Association (CSA) said in a statement on Thursday. The women’s team’s last agreement with CSA expired in 2021. In February, Canada’s women called off a planned strike because of the governing body’s threats of legal action, but they protested during the recent SheBelieves Cup by wearing purple T-shirts with the phrase “enough is enough” before their matches. “This is about respect, this is about dignity, and this is about equalising the competitive environment in a world that is fundamentally unequal,” Canada Soccer’s general secretary Earl Cochrane said. “We have been consistent and public about the need to have fairness and equal pay be pillars of any new agreements with our players, and we are delivering on that today.” Earlier this week, Canada Soccer president Nick Bontis announced his resignation, a decision welcomed by the Canadian Soccer Players’ Association (CSPA) and Canadian Men’s National Soccer Team Players’ Association (CMNSTPA) as “one necessary step” in ensuring the future success of the national teams.In a joint statement, the CSPA and CMNSTPA asked Canada Soccer for “transparent and comprehensive access” to financial records in light of recent funding cuts. They also want immediate action from the governing body to address the unauthorised use of player images, as well as financial restraints imposed by CSA’s agreement with Canada Business Soccer.Canada’s men went on strike in June 2022 after accusing CSA of “disrespect” over World Cup prize money and have said they “wholeheartedly support” the women’s side. The CSA spent $11m (£6.72m) on the men’s programme in 2021 and $5.1m (£3.11m) on the women’s programme.The women’s players said the “disgusting” discrepancy between the programmes became apparent at last year’s men’s World Cup. They are looking for the same backing for this year’s Women’s World Cup as the men received before Qatar, where they competed in the tournament for the first time in 37 years.Canada’s women, who are sixth in the world rankings and won Olympic gold in 2021, are in Group B for the World Cup, which takes place from 20 July to 20 August in Australia and New Zealand. Published on By Left-arm spinner Yuri Koththigoda excelled with a match bag of nine wickets as Richmond beat D.S. Senanayake College by an innings and 43 runs in the Under 19 traditional cricket encounter which ended before tea at Dombagoda on Friday. Koththigoda teamed up with Maheesha de Silva to rattle D.S. Senanayake for a meager total of 57 runs in the first innings. In their essay Richmond posted 233 runs with Janeth Kaushal top scoring with 61 runs. Batting for the second time DSS were bowled out for 133 runs. This time Koththigoda shared eight wickets with Sharon Abhishek to record their fifth outright victory of the season. At Reid Avenue, paceman Ranuka Malaviarachchi troubled Cambrians taking four early wickets. Royal restricted Prince of Wales to 136 runs before Dasis Manchanayake top scored with 91 runs for the home team to reach 185 for five wickets at stumps. Meanwhile, at Sooriyawewa, Maliyadewa topped 400 runs against Mahinda as Gayana Weerasinghe scored 149 runs inclusive of 17 fours and two sixes. In another traditional match, which ended in a draw, St. Anne’s took first innings honours against St. Joseph Vaz’s as Mahima Kotuwila scored a century to propel their total to 358 runs at Kurunegala. Richmond Maliyadeva top 400 runs at Sooriyawewa Maliyadeva 415 for 7 in 100 overs (Chamathkar Hettiarachchi 48, Pasindu Menaka 34, Chandupa Abeysinghe 38, Amesh Tennakoon 64, Gayana Weerasinghe 149, Jayamin Muthukumarana 38; Shehan Hasaranga 4/84)","pubDate":"2023-03-03 23:40:02","image_url":null,"source_id":"island","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Sampath Bank sponsors ‘93rd Battle of the Maroons’","link":"http://island.lk/sampath-bank-sponsors-93rd-battle-of-the-maroons/","keywords":["Sports"],"creator":["Thilina Walpola"],"video_url":null,"description":"Sampath Bank which has always identified and dedicated their interests towards the betterment of sports in Sri Lanka will sponsor the 93rd annual inter – school encounter between Ananda College and Nalanda College will be held at the Sinhalese Sports Club (SSC) Grounds in Colombo. The sponsorship check was handed over at a ceremony held […]","content":"Sampath Bank which has always identified and dedicated their interests towards the betterment of sports in Sri Lanka will sponsor the 93rd annual inter – school encounter between Ananda College and Nalanda College will be held at the Sinhalese Sports Club (SSC) Grounds in Colombo. The sponsorship check was handed over at a ceremony held recently Published on By West Indies threatened to turn the tables on South Africa by rolling them over for 116 on the third morning at SuperSport Park, but their own batters collapsed in similar spectacular fashion, chasing 247. Kagiso Rabada was chiefly responsible for that collapse, bagging 6 for 50 to dismiss them for 159 and seal South Africa’s victory inside three days on a track that offered variable bounce. Jermaine Blackwood’s thrilling counterattack – 79 off 93 balls – raised West Indies’ hopes, but Rabada found a little extra kick off the pitch to take him out and ensure the new era under captain Temba Bavuma and coach Shukri Conrad began with a victory in Centurion, where the South Africa women’s team that reached the T20 World Cup final five days ago was also in attendance. It was Roach who had set the scene for the day with his 11th five-for in Test cricket – and first away from home since 2017. He also surpassed Joel Garner’s tally of 259 to become West Indies’ fifth-highest wicket-taker in Test cricket. Just before lunch, Roach was warmly welcomed back by his team-mates, Jimmy Adams, West Indies’ director of cricket, and Brian Lara, the team mentor. However, the mood and tempo of the match changed quickly when Rabada struck either side of the lunch break. After having captain Kraigg Brathwaite caught down the leg side for a duck, he drew an outside edge from No. 3 Raymon Reifer. Tagenarine Chanderpaul kept playing and missing at full balls, but wasn’t particularly flustered against that length. It was the short ball that bothered him. He fell on his backside twice while trying to deal with them and then when he dared to hook a head-high bouncer from Marco Jansen, he could only top-edge it to midwicket for 10. Roston Chase misjudged an inswinger from Jansen and was castled after offering no shot. Then, when debutant Gerald Coetzee produced extra bounce to get rid of Kyle Mayers, West Indies were 33 for 5 in the 15th over. Blackwood came in and hoicked the seventh ball he faced, off Rabada, over square leg for four. He continued to regularly pump the ball over the top, running away to a 51-ball half-century. At the other end, Joshua Da Silva was more circumspect and contributed 17 to a 58-run sixth-wicket partnership before he fell to Rabada Blackwood, though, went after South Africa’s premier seamer and shanked him over his head for an imposing four. When Anrich Nortje shifted his angle to around the wicket, he ramped him over deep third for four. Jason Holder also operated at almost a run-a-ball in a 37-run seventh-wicket stand with Blackwood before Rabada had him nicking behind with a perfectly-pitched delivery. Though Rabada looked like wasn’t at his best earlier in the day, floating some balls in the lower 130-kph range, his seven-over spell post tea, in which he dismissed both Holder and Blackwood, was perhaps the most decisive passage of play. The day had started on a more promising note for West Indies. Roach struck with his first ball to cut Aiden Markram’s innings short at 47 off 58. He went wide of the crease, tricked Markram into playing for the inward angle from over the wicket but got it to straighten late off the seam and graze the outside edge. Marais Erasmus, the on-field umpire, didn’t rule Markram out initially, but he opted to walk back to the dressing room. In his next over, Roach went wide of the crease again, but this time he beat Jansen’s outside edge and hit the top of the off stump. Roach also helped snip the South African tail, but Coetzee’s spunky cameo (20 off 15 balls) pushed their lead closer to 250. Markram aside, Coetzee was the only South Africa batter to score more than 10 runs in their second innings. He then combined and Rabada, Jansen and Norje with the ball to compensate for their batting collapse and wrap the game up before drinks on the third afternoon. West Indies ( ) Published on By Canada Soccer has reached an interim funding agreement with its women’s national team players amid a dispute over equal pay.The deal reflects the men’s team’s terms with game-by-game incentives and results-based compensation. The women’s team had threatened to boycott a camp in April if demands over funding and pay inequality are not met.A final collective bargaining deal with both the men’s and women’s sides remains under negotiation. “Canada Soccer has announced that a deal in principle has been reached with the Women’s National Team Players on an interim funding agreement for 2022,” the Canada Soccer Association (CSA) said in a statement on Thursday. The women’s team’s last agreement with CSA expired in 2021. In February, Canada’s women called off a planned strike because of the governing body’s threats of legal action, but they protested during the recent SheBelieves Cup by wearing purple T-shirts with the phrase “enough is enough” before their matches. “This is about respect, this is about dignity, and this is about equalising the competitive environment in a world that is fundamentally unequal,” Canada Soccer’s general secretary Earl Cochrane said. “We have been consistent and public about the need to have fairness and equal pay be pillars of any new agreements with our players, and we are delivering on that today.” Earlier this week, Canada Soccer president Nick Bontis announced his resignation, a decision welcomed by the Canadian Soccer Players’ Association (CSPA) and Canadian Men’s National Soccer Team Players’ Association (CMNSTPA) as “one necessary step” in ensuring the future success of the national teams.In a joint statement, the CSPA and CMNSTPA asked Canada Soccer for “transparent and comprehensive access” to financial records in light of recent funding cuts. They also want immediate action from the governing body to address the unauthorised use of player images, as well as financial restraints imposed by CSA’s agreement with Canada Business Soccer.Canada’s men went on strike in June 2022 after accusing CSA of “disrespect” over World Cup prize money and have said they “wholeheartedly support” the women’s side. The CSA spent $11m (£6.72m) on the men’s programme in 2021 and $5.1m (£3.11m) on the women’s programme.The women’s players said the “disgusting” discrepancy between the programmes became apparent at last year’s men’s World Cup. They are looking for the same backing for this year’s Women’s World Cup as the men received before Qatar, where they competed in the tournament for the first time in 37 years.Canada’s women, who are sixth in the world rankings and won Olympic gold in 2021, are in Group B for the World Cup, which takes place from 20 July to 20 August in Australia and New Zealand. Published on By Left-arm spinner Yuri Koththigoda excelled with a match bag of nine wickets as Richmond beat D.S. Senanayake College by an innings and 43 runs in the Under 19 traditional cricket encounter which ended before tea at Dombagoda on Friday. Koththigoda teamed up with Maheesha de Silva to rattle D.S. Senanayake for a meager total of 57 runs in the first innings. In their essay Richmond posted 233 runs with Janeth Kaushal top scoring with 61 runs. Batting for the second time DSS were bowled out for 133 runs. This time Koththigoda shared eight wickets with Sharon Abhishek to record their fifth outright victory of the season. At Reid Avenue, paceman Ranuka Malaviarachchi troubled Cambrians taking four early wickets. Royal restricted Prince of Wales to 136 runs before Dasis Manchanayake top scored with 91 runs for the home team to reach 185 for five wickets at stumps. Meanwhile, at Sooriyawewa, Maliyadewa topped 400 runs against Mahinda as Gayana Weerasinghe scored 149 runs inclusive of 17 fours and two sixes. In another traditional match, which ended in a draw, St. Anne’s took first innings honours against St. Joseph Vaz’s as Mahima Kotuwila scored a century to propel their total to 358 runs at Kurunegala. Richmond Maliyadeva top 400 runs at Sooriyawewa Maliyadeva 415 for 7 in 100 overs (Chamathkar Hettiarachchi 48, Pasindu Menaka 34, Chandupa Abeysinghe 38, Amesh Tennakoon 64, Gayana Weerasinghe 149, Jayamin Muthukumarana 38; Shehan Hasaranga 4/84)","pubDate":"2023-03-03 23:40:00","image_url":null,"source_id":"island","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Shane Warne death anniversary: Adam Gilchrist, Ed Sheeran and Bill Lawry remember cricket legend","link":"https://247newsaroundtheworld.com/sports/shane-warne-death-anniversary-adam-gilchrist-ed-sheeran-and-bill-lawry-remember-cricket-legend/","keywords":["Sports"],"creator":["247 News Around The World"],"video_url":null,"description":"247 News Around The World 247 News Around The World Today marks the first anniversary of Shane Warne’s passing, who died from… The post Shane Warne death anniversary: Adam Gilchrist, Ed Sheeran and Bill Lawry remember cricket legend appeared first on 247 News Around The World.","content":"Today marks the first anniversary of Shane Warne’s passing, who died from a heart attack while attending a wellness retreat in Thailand in news the cricket world has still not recovered from. He was only 52 years old, and the news of his death caused shockwaves around the globe, triggering a massive outpouring of grief and love, which still resonates profoundly today. Adam Gilchrist was one of Warne’s closest friends and he paid tribute to his great mate one year on from his passing. ‘It is still quite hard to believe, isn’t it?’ Gilchrist said in an interview with ABC Radio. ‘A bloke we thought was invincible, to think not only is he gone but it has been a year on.’ Warne, the late Andrew Symonds celebrate the good times during their time together in the Australian Test cricket team Warne and Gilchrist pose for a portrait at the Junction Oval and celebrate a wicket in the Australian ODI team ‘I think what made so many people [love him] … although they didn’t know Shane, I think the fact he was such a character, he was almost reflective of what every grade cricket club has around in their team,’ he said. ‘They have a guy that works all week does their job and then goes to training a couple of those nights and then just lives for the weekend to go and play cricket with his mates.’ It was that rawness, that sense that Warne was a real person – warts and all – that endeared him to so many. ‘He’s very real. The fact that he found his way into a bit of trouble here and there off the field, that made him even more real,’ Gilchrist said. ‘He wasn’t infallible, he made mistakes like the rest of us. ‘I think that is what made him so engaging to people. Although he was a Hollywood type status personality, he could still engage with, for want of a better term, the common people. ‘He would go out the back of the commentary box to have a dart or just sit and next thing you know he is teaching a kid how to bowl leg spin because an enquiring dad came up and asked him. ‘Yet he could mix with royalty as well. He was intriguing and I think everyone felt a level of engagement with him at some point.’ Warne talks to a group of fans in tsunami-hit Galle cricket stadium. He always had the time to engage with fans around the world Australian fans show their support for Warne on day two of the fourth Ashes Test match between Australia and England at the Melbourne Cricket Ground in 2006 There are so many memories that Gilchrist and Aussie Test cricket fans will never forget, like the Gatting ball and his 700th Test wicket. Gilchrist said it was a privilege to be one of only two wicketkeepers, including Ian Healy, to ever keep wicket to Warne as Test match level. ‘It was mesmerising,’ he said. ‘In one Shane Warne delivery you could almost sum up his entire personality and character. ‘Standing and waiting at the top of his mark, waiting and pausing until it felt like perhaps the whole cricketing world for that one moment was honing in on him. ‘Starting a mind game and a battle with the batter at the other end. ‘He was all up for a battle. He was a very aggressive type that like a challenge. ‘You mention the Gatting ball, I reckon I kept wicket to 100 or more very, very similar deliveries.’ Former Australian and Rajasthan Royals player Shane Warne talks with children from the Rajasthan Royals UK academy Another close associate of Warnie that shared his stories with the cricket legend was Tom Malone, the former boss of Wide World of Sports. One anecdote that Malone shared highlight Warnie’s giving nature, involving the late Kerry Packer, a tour of India and a mobile phone. ‘His first contract wasn’t actually for money, but Kerry gave him a phone for a tour of India,’ Malone told Ben Fordham on 2GB. ‘Warnie, as generous as he was, let all the team use the phone while they were touring India. ‘So when he got back I think the bill for the phone was about $50,000USD. So Kerry said ‘well you’re not getting a phone again, we will put you on a salary’. There was also the brief career of Warnie the sports newsreader. ‘He then got him to read the 11am news one day in Melbourne for sports update,’ Malone said. ‘As Warnie tells the story, Kerry rang him the next day straight afterwards and said “I think you better stick to spin bowling”.’ A SNAPSHOT OF GREATNESS Widely regarded as one of cricket’s greatest bowlers in history, Warne was selected as one of five Wisden Cricketers of the Century in 2000 by a panel of cricket experts. He was the only specialist bowler and the only one who was still playing at the time. Warne made his Test debut in 1992 and went on to take over 1,000 wickets in Tests and One Day Internationals (ODIs). Until 2007, his record of 708 Test wickets was the highest number of wickets taken by any bowler in Test cricket. He was also named one of the Wisden Cricketers of the Year in the 1994 Wisden Cricketers’ Almanack and was the Wisden Leading Cricketer in the World in both 1997 and 2004. While Warne’s partying antics were well reported during his career, there was one time the legendary leg-spinner sacrificed a night on the tiles to help his great mate and fellow commentator Bill Lawry. When Channel Nine lost the rights to the cricket in 2018, a party was held in Sydney for the end of an era with all past and present commentators invited. ‘He was actually flying from overseas that morning, straight into Melbourne,’ Malone said. ‘Turned around quickly and said “how is Bill Lawry coming up?” ‘At this point Bill was 79 or 80 and was not commentating or moving around the country as much. Bill Lawry and Shane Warne are two of the greatest Victorians to ever play the game of cricket ‘He said “I’ll bring Bill up” and he chaperoned Bill, he brought Bill up on the plane, got him from the airport to Channel Nine. ‘Warnie would have liked to kick on, because a few of the others kicked on until well into the night. ‘But Warnie said ‘no I have to accompany Bill back home’. ‘Once you had Warnie’s trust, you had it for life. ‘The way he looked after people, he was big on manners, big on kindness and generosity. ‘He really was an incredible individual.’ Sheeran and Warne were unlikely friends, showing the level of reach the great Aussie leg-spinner had Summer, Brooke and Jackson Warne got to meet Sheeran on his tour of Australia and the singer paid tribute to their father at his MCG concert During his first concert in Melbourne on Thursday night, Ed Sheeran honoured his friend Shane Warne by performing The A-Team in front of a crowd of 100,000 at the MCG. Sheeran acknowledged Warne’s absence, remarking that the venue was special to him, before dedicating the song to ‘Shane and his kids.’ ‘Being in the MCG tonight and not having my friend Shane Warne here to watch this … I know this venue was really, really special to him,’ Sheeran said. Warne’s children Brooke, Jackson, and Summer were present at the concert, with Brooke sharing the performance on her Instagram and expressing her love for both Ed and her late father. ‘Love you Ed and miss you Dad,’ she posted. Post source: Daily mail","pubDate":"2023-03-03 20:52:40","image_url":null,"source_id":"247newsaroundtheworld","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"\"मुझे एमएस धोनी से इसकी सबसे कम उम्मीद थी\", कार्तिक ने किया अपनी कमेंट्री को लेकर खुलासा","link":"https://sports.ndtv.com/hindi/cricket/i-least-expected-this-ms-dhoni-dinesh-karthik-reveals-about-his-commentary-3832518#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"IPL 2023: अंतरराष्ट्रीय कमेंट्री में खुद को स्थापित कर चुके दिनेश कार्तिक (Dinesh Karthik) शुरू होने वाली आईपीएल में आरसीबी के लिए खेलते दिखायी पड़ेंगे.","content":"भारत के पूर्व विकेटकीपर दिनेश कार्तिक आईपीएल में खेलते दिखेंगे रॉयल चैलेंजर्स बेंगलोर के विकेटकीपर-बल्लेबाज ने दिनेश कार्तिक ने कहा कि विश्व कप विजेता पूर्व भारतीय कप्तान महेंद्र सिंह धोनी (MS Dhoni) उनकी कमेंट्री का ‘काफी लुत्फ उठाते' हैं. भारत-ऑस्ट्रेलिया टेस्ट श्रृंखला में फिलहाल कामेंट्री कर रहे 37 वर्षीय कार्तिक (Dinesh Karthik) आगामी आईपीएल (IPL 2023) में मैदान पर आरसीबी का प्रतिनिधित्व करते हुए दिखेंगे. कार्तिक ने ‘आरसीबी पॉडकास्टर' पर कहा कि धोनी से मिले तारीफ के एक-एक शब्दों ने उनके लिए कमेंट्री को और खास बना दिया. कार्तिक ने कहा, ‘मुझे कमेंट्री के जो थोड़े बहुत मौके मिले है, मैंने उसका आनंद लिया. मुझे लगता है कि मुझे खेल के बारे में बोलने, विश्लेषण करने में बहुत मजा आ रहा है. मैं इस तरह से वर्णन करना चाहता हूं कि इस खेल को देखने वाले हर व्यक्ति के लिए कुछ सार्थक हो.' उन्होंने कहा, ‘आप जानते हैं, मैंने हमेशा अपने तरीके से एक स्थिति से बाहर निकलने की कोशिश की और इसे उस तरह से स्पष्ट करने की कोशिश की, जिस तरह से मैंने सोचा था.' भारत के लिए खेल के तीनों प्रारूपों में खेल चुके कार्तिक ने कहा, ‘मुझे सबसे बड़ी प्रशंसा उस व्यक्ति से मिली जिसकी मुझे सबसे कम उम्मीद थी. मैं धोनी की बात कर रहा हूं. उन्होंने मुझे कहा, ‘मैंने वास्तव में कमेंट्री का आनंद लिया. बहुत-बहुत अच्छा. आप शानदार कर रहे है.' आरसीबी के लिए पिछले सत्र में 183 के शानदार स्ट्राइक रेट से 330 रन बनाने वाले इस खिलाड़ी ने कहा, ‘इस पर मुझे सुखद आश्चर्य हुआ. मैंने उन्हें शुक्रिया कहा. आप जानते है कि यह मेरे लिए बड़ी बात है. वह खेल पर करीब से नजर रखते हैं. इसलिए उनसे ऐसी बातें सुनना वास्तव में अच्छा थाय और मुझे खुशी है कि उन्होंने मेरी कमेंट्री का आनंद लिया. * * पढ़ें देश-विदेश की ख़बरें अब हिन्दी में ( ) | (Elections 2023) के लाइव अपडेट के लिए हमें फॉलो करें और जानें इलेक्शन रिज़ल्ट्स (Election Results) सबसे पहले | लाइव खबर देखें: फॉलो करे:","pubDate":"2023-03-03 18:34:35","image_url":"https://c.ndtvimg.com/2023-03/b12hp268_dinesh-karthik-806_625x300_02_March_23.jpg","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Solid gold: NRL season opener showed the benefit of finding a winner","link":"https://www.theage.com.au/sport/solid-gold-nrl-season-opener-showed-the-benefit-of-finding-a-winner-20230303-p5cp3q.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":["Sport"],"creator":["Peter FitzSimons"],"video_url":null,"description":"Harry Grant’s match-winner on Thursday night capped a cracking return for the NRL.","content":"You’re right, that was a cracking opener for the NRL season, one that could barely have been scripted better. It was a see-sawing game, with the score at 12-12 at the end of regulation time. The deadlock was only broken in golden point when the Storm hooker Harry Grant scored a barn- burning beauty with a touch of Toutai Kefu’s famous “Inspector Gadget” try two decades ago about it – with, even as three men hit him well out from the line, the impossibly long hand reaching out to plonk it down. Game over. And the Storm win their opening round match for the 20th time in a row . Every now and then you see criticism of the golden point finish. This climax showed how wrong-headed that talk is. Imagine that great match had finished with a 12-12 draw, bearing in mind the famous dictum that “a draw is likely kissing your sister.” Instead, we had this superb sporting theatre, with a fabulous climax. Just when you think most professional sport is corporate soullessness in boots and running shoes, this happens. During the week, no less than the Barmy Army made a moving gesture by putting a wonderful rendition of West Side Story’s signature tune Maria on Twitter , while tagging Australian cricket captain Pat Cummins and noting “‘Maria’ from West Side Story in support of Pat Cummins, who’s mother Maria has entered palliative care.” The Barmy Army in action. Credit: Jessica Hromas Cummins graciously replied, writing, “This is amazing @TheBarmyArmy , thankyou. Mum loved watching this and felt very touched.” Maria Cummins is, as readers might remember, a good egg. I have noted here a couple of times the story of the little boy on summer holidays a few years ago, who was noted by the neighbours to spend hours on end out in the backyard either hitting a ball on the end of a rope hanging from a tree or bowling a tennis ball against the garage door. The immediate neighbours got his name and address, and shortly after he got home, he received a package in the post from “P. Cummins”, with a nice note from the Australian fast bowler, and two signed match shirts, with some signed posters. The neighbours were Peter and Maria Cummins. Syd Fischer, who died earlier this week, aged 95? I knew him a very little, and just a few years ago used to run into him at the gym we both frequented, even though he’d already cracked 90. As a businessman in this town, he will be remembered as a singularly tough ... fellow. As a sailor, he was an enormous contributor to Australian excellence, competing in no fewer than 40 Sydney to Hobart races, and his eight iterations of Ragamuffins were ubiquitous in many of them. Syd Fischer ahead of the 1992 Sydney to Hobart. Credit: Craig Golding Yachts he skippered won line honours for the Hobart race twice in 1988 and 1990 and the whole shooting match on handicap in 1992. In 2015, he became the oldest competitor in the race when competitor at the age of 87. As to Americas Cup campaigns, he competed in five, and in an obituary this week, the Australian Sailing website noted “In addition to his own achievements, Fischer was also noted for launching the America’s Cup careers of some of today’s most famous Australian yachtsmen, in particular Jimmy Spithill, lain Murray and Hugh Treharne, who was tactician aboard the 1983 Cup winner, Australia I.” A quarter-century ago, Fischer built an America’s Cup campaign around Spithill’s skill, making him the youngest skipper in Cup history. “He’s a 20-year-old with a 40-year-old head,” Fischer said. “He’s cool. I met him when he was still at school. I remember thinking, this is a kid who’s really with it. He’s not some petulant, spoilt brat. He’s just a good ordinary Aussie – a bit like a Kiwi, I guess.” As near as I can work out, Fischer took much the same approach to sailing as he did in the building business. When asked once about his notoriously tough approach in both he didn’t back down. “Well, if I meet an arsehole I can be an arsehole, too. It’s as simple as that.” Vale Syd. Whatever else, an Australian original. No, no, no, I won’t snarl unpleasantly and with unseemly joy over the fact that the first televised ratings of Greg Norman’s LIV Golf series for 2023 were lower than a snake’s belly button, and you can’t make me. Can I, however, just express a little wonder in tune with the international golf media, that the ratings were that low? In sports-mad America, it is nigh on inconceivable that a televised tournament boasting several world-class golf stars, could pull just two – count ’em, two – households per 1000. That, friends, is just higher than a test pattern. Greg Norman at the LIV Golf event in Mexico. Credit: Getty Images What does it mean? I’ll go with the bleeding obvious, please Tony Barber. I say it is a comprehensive rejection of everything that LIV stands for, starting with a tournament financed by the brutal Saudi regime, fronted by Norman, and boasting an entirely different format that the golf community clearly just don’t want. As this column has noted there was never any complaint in the first place about the way it works at the Masters, the British Open et al, with a staggered start, a cut of the lowest half of the field after two days and the final, wonderful build to the back nine on Sunday. Instead of this tried-and-true traditional format, Norman pioneered golf where there is no halfway cut; everyone gets prize money; players are in made-up “teams”; there are shotgun starts so all 18 holes have golfers ready to tee off when the broadcast begins – and if I’m Arthur, you must be Martha, but no-one is quite sure, so what else is on? “LIV had a real opportunity to draw in viewers considering the weak field in the PGA Tour over the weekend,” the New York Post commented, “and flopped spectacularly.” Good! The Storm’s Cameron Munster when asked after Thursday night’s match if the compound fracture of his finger would require surgery: “You’re asking the wrong bloke. I’m a footballer.” Dan Wolen from USA Today after the first televised round of LIV Golf for 2023 drew ratings just slightly higher than a test pattern: “ Can you really call it ‘Golf But Louder’ when you’d need a stethoscope to determine if this tour even has a pulse?” Eamon Lynch writes in Golfweek : “Norman’s LIV Golf has a solitary anchor that prevents it from being dashed on the rocks of commercial reality, the Public Investment Fund of Saudi Arabia ...” North Melbourne coach Alastair Clarkson , to a female reporter Tarryn Thomas: “Your time will come.” Called out on it, Clarkson apologised. The last words of Australian captain Meg Lanning before the World T20 final against South Africa in Cape Town: “Let’s f---ing go!” They did, and beat the South Africans by 19 runs. Australian surfing star Molly Picklum: “Surfing-wise, I do feel like I can compete with the best in the world. And then competitive-wise, you’ve just got to make that shift when it’s your idols ... Beating people like that, who are so intelligent when it comes to competition and strategy, and they’re also the strongest women surfers in the world, that gets me excited.” Tommy Fury after defeating Jake Paul in the most irrelevant event ever: “Tonight, I make my own legacy. I am Tommy Fury.” Thanks, Scoop. Lawyer Michel Margalit on the planned concussion class action against the AFL: “The former players have told us heartbreaking stories of the impact that concussion sustained playing in the AFL has had on their personal lives, their families and their career after their footy ended. Players often enter into AFL careers as teenagers, without the life experience or perspective to understand the life-long debilitating impacts of concussion. These players need to be protected and adequately cared for if injured.” Storm coach Craig Bellamy: “I’m pretty sure this is gonna be my last year as a head coach. I’ll still be around the club a bit in a part-time role at the end of this year, but nothing’s really changed. I’m not quite sure when the club wants a definite answer, but I want to give [them] plenty of time to find a new coach ... I can’t see anything changing this year as to me not retiring at the end of the year.” Novak Djokovic on breaking Steffi Graf’s record for most weeks as world No. 1: “It’s surreal to be that many weeks No. 1, to match Graf - one of the all-time greats. Just being amongst these legendary names is flattering. I’m proud of it.” He is at 378 weeks and counting. Ben Stokes on losing to New Zealand by one run: “That game as a whole, in terms of what Test cricket’s about, was just incredible. Sometimes things don’t happen the way you want them to but it was a good one, wasn’t it?” Steve Smith on captaining the Test side in the absence of Pat Cummins: “It normally brings the best out of me.” And it did. Sonny Bill Williams: “I’m a simple guy, my biggest learnings have come from my biggest mistakes. If you look up growth in the dictionary, I’m sure my name is underneath it.” Australia . Won the women’s T20 title for the third time in a row and the sixth time in the past seven editions. Riding the Dolphins ... Wayne Bennett. Credit: John Shakespeare Manchester United . Won the English League Cup, their first trophy since 2017. Dolphins . First new NRL team since Titans in 2007. Their first match, with Wayne Bennett in charge, is against the Roosters on Sunday. Waratahs . Back on the horse later on Saturday against the Fijian Drua. Ange Postecoglou . Won another trophy with Celtic. New Zealand. Just the fourth side to win a match when following on and also only did so by one run. Twitter: @Peter_Fitz Stream the NRL Premiership 2023 live and free on 9Now . Sports news, results and expert commentary. Sign up for our Sport newsletter .","pubDate":"2023-03-03 18:22:00","image_url":null,"source_id":"theage","category":["sports"],"country":["australia"],"language":"english"},{"title":"Rabada six-for leads South Africa to victory over West Indies","link":"http://island.lk/rabada-six-for-leads-south-africa-to-victory-over-west-indies-2/","keywords":["Sports","Featured"],"creator":["Thilina Walpola"],"video_url":null,"description":"West Indies threatened to turn the tables on South Africa by rolling them over for 116 on the third morning at SuperSport Park, but their own batters collapsed in similar spectacular fashion, chasing 247. Kagiso Rabada was chiefly responsible for that collapse, bagging 6 for 50 to dismiss them for 159 and seal South Africa’s […]","content":"West Indies threatened to turn the tables on South Africa by rolling them over for 116 on the third morning at SuperSport Park, but their own batters collapsed in similar spectacular fashion, chasing 247. Kagiso Rabada was chiefly responsible for that collapse, bagging 6 for 50 to dismiss them for 159 and seal South Africa’s victory inside three days on a track that offered variable bounce. Jermaine Blackwood’s thrilling counterattack – 79 off 93 balls – raised West Indies’ hopes, but Rabada found a little extra kick off the pitch to take him out and ensure the new era under captain Temba Bavuma and coach Shukri Conrad began with a victory in Centurion, where the South Africa women’s team that reached the T20 World Cup final five days ago was also in attendance. It was Roach who had set the scene for the day with his 11th five-for in Test cricket – and first away from home since 2017. He also surpassed Joel Garner’s tally of 259 to become West Indies’ fifth-highest wicket-taker in Test cricket. Just before lunch, Roach was warmly welcomed back by his team-mates, Jimmy Adams, West Indies’ director of cricket, and Brian Lara, the team mentor. However, the mood and tempo of the match changed quickly when Rabada struck either side of the lunch break. After having captain Kraigg Brathwaite caught down the leg side for a duck, he drew an outside edge from No. 3 Raymon Reifer. Tagenarine Chanderpaul kept playing and missing at full balls, but wasn’t particularly flustered against that length. It was the short ball that bothered him. He fell on his backside twice while trying to deal with them and then when he dared to hook a head-high bouncer from Marco Jansen, he could only top-edge it to midwicket for 10. Roston Chase misjudged an inswinger from Jansen and was castled after offering no shot. Then, when debutant Gerald Coetzee produced extra bounce to get rid of Kyle Mayers, West Indies were 33 for 5 in the 15th over. Blackwood came in and hoicked the seventh ball he faced, off Rabada, over square leg for four. He continued to regularly pump the ball over the top, running away to a 51-ball half-century. At the other end, Joshua Da Silva was more circumspect and contributed 17 to a 58-run sixth-wicket partnership before he fell to Rabada Blackwood, though, went after South Africa’s premier seamer and shanked him over his head for an imposing four. When Anrich Nortje shifted his angle to around the wicket, he ramped him over deep third for four. Jason Holder also operated at almost a run-a-ball in a 37-run seventh-wicket stand with Blackwood before Rabada had him nicking behind with a perfectly-pitched delivery. Though Rabada looked like wasn’t at his best earlier in the day, floating some balls in the lower 130-kph range, his seven-over spell post tea, in which he dismissed both Holder and Blackwood, was perhaps the most decisive passage of play. The day had started on a more promising note for West Indies. Roach struck with his first ball to cut Aiden Markram’s innings short at 47 off 58. He went wide of the crease, tricked Markram into playing for the inward angle from over the wicket but got it to straighten late off the seam and graze the outside edge. Marais Erasmus, the on-field umpire, didn’t rule Markram out initially, but he opted to walk back to the dressing room. In his next over, Roach went wide of the crease again, but this time he beat Jansen’s outside edge and hit the top of the off stump. Roach also helped snip the South African tail, but Coetzee’s spunky cameo (20 off 15 balls) pushed their lead closer to 250. Markram aside, Coetzee was the only South Africa batter to score more than 10 runs in their second innings. He then combined and Rabada, Jansen and Norje with the ball to compensate for their batting collapse and wrap the game up before drinks on the third afternoon. West Indies ( ) Published on By Canada Soccer has reached an interim funding agreement with its women’s national team players amid a dispute over equal pay.The deal reflects the men’s team’s terms with game-by-game incentives and results-based compensation. The women’s team had threatened to boycott a camp in April if demands over funding and pay inequality are not met.A final collective bargaining deal with both the men’s and women’s sides remains under negotiation. “Canada Soccer has announced that a deal in principle has been reached with the Women’s National Team Players on an interim funding agreement for 2022,” the Canada Soccer Association (CSA) said in a statement on Thursday. The women’s team’s last agreement with CSA expired in 2021. In February, Canada’s women called off a planned strike because of the governing body’s threats of legal action, but they protested during the recent SheBelieves Cup by wearing purple T-shirts with the phrase “enough is enough” before their matches. “This is about respect, this is about dignity, and this is about equalising the competitive environment in a world that is fundamentally unequal,” Canada Soccer’s general secretary Earl Cochrane said. “We have been consistent and public about the need to have fairness and equal pay be pillars of any new agreements with our players, and we are delivering on that today.” Earlier this week, Canada Soccer president Nick Bontis announced his resignation, a decision welcomed by the Canadian Soccer Players’ Association (CSPA) and Canadian Men’s National Soccer Team Players’ Association (CMNSTPA) as “one necessary step” in ensuring the future success of the national teams.In a joint statement, the CSPA and CMNSTPA asked Canada Soccer for “transparent and comprehensive access” to financial records in light of recent funding cuts. They also want immediate action from the governing body to address the unauthorised use of player images, as well as financial restraints imposed by CSA’s agreement with Canada Business Soccer.Canada’s men went on strike in June 2022 after accusing CSA of “disrespect” over World Cup prize money and have said they “wholeheartedly support” the women’s side. The CSA spent $11m (£6.72m) on the men’s programme in 2021 and $5.1m (£3.11m) on the women’s programme.The women’s players said the “disgusting” discrepancy between the programmes became apparent at last year’s men’s World Cup. They are looking for the same backing for this year’s Women’s World Cup as the men received before Qatar, where they competed in the tournament for the first time in 37 years.Canada’s women, who are sixth in the world rankings and won Olympic gold in 2021, are in Group B for the World Cup, which takes place from 20 July to 20 August in Australia and New Zealand. Published on By Left-arm spinner Yuri Koththigoda excelled with a match bag of nine wickets as Richmond beat D.S. Senanayake College by an innings and 43 runs in the Under 19 traditional cricket encounter which ended before tea at Dombagoda on Friday. Koththigoda teamed up with Maheesha de Silva to rattle D.S. Senanayake for a meager total of 57 runs in the first innings. In their essay Richmond posted 233 runs with Janeth Kaushal top scoring with 61 runs. Batting for the second time DSS were bowled out for 133 runs. This time Koththigoda shared eight wickets with Sharon Abhishek to record their fifth outright victory of the season. At Reid Avenue, paceman Ranuka Malaviarachchi troubled Cambrians taking four early wickets. Royal restricted Prince of Wales to 136 runs before Dasis Manchanayake top scored with 91 runs for the home team to reach 185 for five wickets at stumps. Meanwhile, at Sooriyawewa, Maliyadewa topped 400 runs against Mahinda as Gayana Weerasinghe scored 149 runs inclusive of 17 fours and two sixes. In another traditional match, which ended in a draw, St. Anne’s took first innings honours against St. Joseph Vaz’s as Mahima Kotuwila scored a century to propel their total to 358 runs at Kurunegala. Richmond Maliyadeva top 400 runs at Sooriyawewa Maliyadeva 415 for 7 in 100 overs (Chamathkar Hettiarachchi 48, Pasindu Menaka 34, Chandupa Abeysinghe 38, Amesh Tennakoon 64, Gayana Weerasinghe 149, Jayamin Muthukumarana 38; Shehan Hasaranga 4/84) Published on By World number one Novak Djokovic continued his perfect start to 2023 by beating Hubert Hurkacz to reach the Dubai Tennis Championships semi-finals.The 35-year-old Serb took his record to 15-0 so far this year with a 6-3 7-5 win over Poland’s Hurkacz. Djokovic, who is chasing a sixth win in Dubai, was to face Daniil Medvedev for a place in Saturday’s final.Australian Open finalist Medvedev defeated Borna Coric 6-3 6-2 to stay on track for a third title this year. Meanwhile, defending champion Andrey Rublev beat Botic van de Zandschulp to progress.The second seed defeated his Dutch opponent 6-3 7-6 (7-3) and will play Alexander Zverev in the last four as the German overcame Lorenzo Sonego 7-5 6-4. Djokovic needed just 71 minutes to see off Hurkacz and is looking in fine form as he looks to win his third tournament of the year. “I found the rhythm on my serve throughout the second set,” he said. “I’m really glad with how I played under pressure.” Meanwhile, Djokovic is waiting for a response on his application for an exemption to visa rules on vaccines in order to enter the United States before the Masters 1000 event in Indian Wells, which begins on 8 March. The draw for that tournament takes place on Monday, and Djokovic said: “Whatever the decision is before the draw, if I’m not allowed I’m going to pull out, of course, before the draw.”","pubDate":"2023-03-04 00:01:03","image_url":null,"source_id":"island","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Canada women agree interim funding deal in equal pay dispute","link":"http://island.lk/canada-women-agree-interim-funding-deal-in-equal-pay-dispute/","keywords":["Sports"],"creator":["Thilina Walpola"],"video_url":null,"description":"Canada Soccer has reached an interim funding agreement with its women’s national team players amid a dispute over equal pay.The deal reflects the men’s team’s terms with game-by-game incentives and results-based compensation. The women’s team had threatened to boycott a camp in April if demands over funding and pay inequality are not met.A final collective […]","content":"Canada Soccer has reached an interim funding agreement with its women’s national team players amid a dispute over equal pay.The deal reflects the men’s team’s terms with game-by-game incentives and results-based compensation. The women’s team had threatened to boycott a camp in April if demands over funding and pay inequality are not met.A final collective bargaining deal with both the men’s and women’s sides remains under negotiation. “Canada Soccer has announced that a deal in principle has been reached with the Women’s National Team Players on an interim funding agreement for 2022,” the Canada Soccer Association (CSA) said in a statement on Thursday. The women’s team’s last agreement with CSA expired in 2021. In February, Canada’s women called off a planned strike because of the governing body’s threats of legal action, but they protested during the recent SheBelieves Cup by wearing purple T-shirts with the phrase “enough is enough” before their matches. “This is about respect, this is about dignity, and this is about equalising the competitive environment in a world that is fundamentally unequal,” Canada Soccer’s general secretary Earl Cochrane said. “We have been consistent and public about the need to have fairness and equal pay be pillars of any new agreements with our players, and we are delivering on that today.” Earlier this week, Canada Soccer president Nick Bontis announced his resignation, a decision welcomed by the Canadian Soccer Players’ Association (CSPA) and Canadian Men’s National Soccer Team Players’ Association (CMNSTPA) as “one necessary step” in ensuring the future success of the national teams.In a joint statement, the CSPA and CMNSTPA asked Canada Soccer for “transparent and comprehensive access” to financial records in light of recent funding cuts. They also want immediate action from the governing body to address the unauthorised use of player images, as well as financial restraints imposed by CSA’s agreement with Canada Business Soccer.Canada’s men went on strike in June 2022 after accusing CSA of “disrespect” over World Cup prize money and have said they “wholeheartedly support” the women’s side. The CSA spent $11m (£6.72m) on the men’s programme in 2021 and $5.1m (£3.11m) on the women’s programme.The women’s players said the “disgusting” discrepancy between the programmes became apparent at last year’s men’s World Cup. They are looking for the same backing for this year’s Women’s World Cup as the men received before Qatar, where they competed in the tournament for the first time in 37 years.Canada’s women, who are sixth in the world rankings and won Olympic gold in 2021, are in Group B for the World Cup, which takes place from 20 July to 20 August in Australia and New Zealand. Published on By Left-arm spinner Yuri Koththigoda excelled with a match bag of nine wickets as Richmond beat D.S. Senanayake College by an innings and 43 runs in the Under 19 traditional cricket encounter which ended before tea at Dombagoda on Friday. Koththigoda teamed up with Maheesha de Silva to rattle D.S. Senanayake for a meager total of 57 runs in the first innings. In their essay Richmond posted 233 runs with Janeth Kaushal top scoring with 61 runs. Batting for the second time DSS were bowled out for 133 runs. This time Koththigoda shared eight wickets with Sharon Abhishek to record their fifth outright victory of the season. At Reid Avenue, paceman Ranuka Malaviarachchi troubled Cambrians taking four early wickets. Royal restricted Prince of Wales to 136 runs before Dasis Manchanayake top scored with 91 runs for the home team to reach 185 for five wickets at stumps. Meanwhile, at Sooriyawewa, Maliyadewa topped 400 runs against Mahinda as Gayana Weerasinghe scored 149 runs inclusive of 17 fours and two sixes. In another traditional match, which ended in a draw, St. Anne’s took first innings honours against St. Joseph Vaz’s as Mahima Kotuwila scored a century to propel their total to 358 runs at Kurunegala. Richmond Maliyadeva top 400 runs at Sooriyawewa Maliyadeva 415 for 7 in 100 overs (Chamathkar Hettiarachchi 48, Pasindu Menaka 34, Chandupa Abeysinghe 38, Amesh Tennakoon 64, Gayana Weerasinghe 149, Jayamin Muthukumarana 38; Shehan Hasaranga 4/84) Published on By World number one Novak Djokovic continued his perfect start to 2023 by beating Hubert Hurkacz to reach the Dubai Tennis Championships semi-finals.The 35-year-old Serb took his record to 15-0 so far this year with a 6-3 7-5 win over Poland’s Hurkacz. Djokovic, who is chasing a sixth win in Dubai, was to face Daniil Medvedev for a place in Saturday’s final.Australian Open finalist Medvedev defeated Borna Coric 6-3 6-2 to stay on track for a third title this year. Meanwhile, defending champion Andrey Rublev beat Botic van de Zandschulp to progress.The second seed defeated his Dutch opponent 6-3 7-6 (7-3) and will play Alexander Zverev in the last four as the German overcame Lorenzo Sonego 7-5 6-4. Djokovic needed just 71 minutes to see off Hurkacz and is looking in fine form as he looks to win his third tournament of the year. “I found the rhythm on my serve throughout the second set,” he said. “I’m really glad with how I played under pressure.” Meanwhile, Djokovic is waiting for a response on his application for an exemption to visa rules on vaccines in order to enter the United States before the Masters 1000 event in Indian Wells, which begins on 8 March. The draw for that tournament takes place on Monday, and Djokovic said: “Whatever the decision is before the draw, if I’m not allowed I’m going to pull out, of course, before the draw.” Published on By India’s bid to defend 75 on the third day of the Indore Test started on the right note with R Ashwin striking off the second delivery of the day. After getting one to rip past Usman Khawaja’s outside edge in the first ball, he had him caught behind off the next ball with a similar delivery. Khawaja’s review went in vain, but that proved to be India’s lone moment of joy on the final day. While Travis Head and Marnus Labuschagne were kept on a tight leash for over ten overs by Ravindra Jadeja and Ashwin, the duo began to find a good measure of the spinners after settling in. Head began the charge by taking on Ashwin for a four and a six in the same over, which was backed up by Labuschagne’s loft off Jadeja as well. The sudden run flow put the spinners off, who had also got the ball changed at the tenth over mark. But even as Ashwin operated unchanged from one end, Australia began to press the accelerator. Head clobbered Umesh Yadav through the cover area for another boundary to get close to a fifty but before he could have a shot at it, Labuschagne finished the game off by lofting Ashwin over midwicket. The win gave Australia their first win of the series, and condemned India to their third home defeat in six years, two of which have come against a Steve Smith-led Australia. The victory also sealed Australia’s position in the World Test Championship final at the Oval in June this year. Australia ( )","pubDate":"2023-03-03 23:40:53","image_url":null,"source_id":"island","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Koththigoda rattles DSS as Richmond record fifth win","link":"http://island.lk/koththigoda-rattles-dss-as-richmond-record-fifth-win/","keywords":["Sports"],"creator":["Thilina Walpola"],"video_url":null,"description":"Under 19 Cricket by Reemus Fernando Left-arm spinner Yuri Koththigoda excelled with a match bag of nine wickets as Richmond beat D.S. Senanayake College by an innings and 43 runs in the Under 19 traditional cricket encounter which ended before tea at Dombagoda on Friday. Koththigoda teamed up with Maheesha de Silva to […]","content":"Left-arm spinner Yuri Koththigoda excelled with a match bag of nine wickets as Richmond beat D.S. Senanayake College by an innings and 43 runs in the Under 19 traditional cricket encounter which ended before tea at Dombagoda on Friday. Koththigoda teamed up with Maheesha de Silva to rattle D.S. Senanayake for a meager total of 57 runs in the first innings. In their essay Richmond posted 233 runs with Janeth Kaushal top scoring with 61 runs. Batting for the second time DSS were bowled out for 133 runs. This time Koththigoda shared eight wickets with Sharon Abhishek to record their fifth outright victory of the season. At Reid Avenue, paceman Ranuka Malaviarachchi troubled Cambrians taking four early wickets. Royal restricted Prince of Wales to 136 runs before Dasis Manchanayake top scored with 91 runs for the home team to reach 185 for five wickets at stumps. Meanwhile, at Sooriyawewa, Maliyadewa topped 400 runs against Mahinda as Gayana Weerasinghe scored 149 runs inclusive of 17 fours and two sixes. In another traditional match, which ended in a draw, St. Anne’s took first innings honours against St. Joseph Vaz’s as Mahima Kotuwila scored a century to propel their total to 358 runs at Kurunegala. Richmond Maliyadeva top 400 runs at Sooriyawewa Maliyadeva 415 for 7 in 100 overs (Chamathkar Hettiarachchi 48, Pasindu Menaka 34, Chandupa Abeysinghe 38, Amesh Tennakoon 64, Gayana Weerasinghe 149, Jayamin Muthukumarana 38; Shehan Hasaranga 4/84) Published on By West Indies threatened to turn the tables on South Africa by rolling them over for 116 on the third morning at SuperSport Park, but their own batters collapsed in similar spectacular fashion, chasing 247. Kagiso Rabada was chiefly responsible for that collapse, bagging 6 for 50 to dismiss them for 159 and seal South Africa’s victory inside three days on a track that offered variable bounce. Jermaine Blackwood’s thrilling counterattack – 79 off 93 balls – raised West Indies’ hopes, but Rabada found a little extra kick off the pitch to take him out and ensure the new era under captain Temba Bavuma and coach Shukri Conrad began with a victory in Centurion, where the South Africa women’s team that reached the T20 World Cup final five days ago was also in attendance. It was Roach who had set the scene for the day with his 11th five-for in Test cricket – and first away from home since 2017. He also surpassed Joel Garner’s tally of 259 to become West Indies’ fifth-highest wicket-taker in Test cricket. Just before lunch, Roach was warmly welcomed back by his team-mates, Jimmy Adams, West Indies’ director of cricket, and Brian Lara, the team mentor. However, the mood and tempo of the match changed quickly when Rabada struck either side of the lunch break. After having captain Kraigg Brathwaite caught down the leg side for a duck, he drew an outside edge from No. 3 Raymon Reifer. Tagenarine Chanderpaul kept playing and missing at full balls, but wasn’t particularly flustered against that length. It was the short ball that bothered him. He fell on his backside twice while trying to deal with them and then when he dared to hook a head-high bouncer from Marco Jansen, he could only top-edge it to midwicket for 10. Roston Chase misjudged an inswinger from Jansen and was castled after offering no shot. Then, when debutant Gerald Coetzee produced extra bounce to get rid of Kyle Mayers, West Indies were 33 for 5 in the 15th over. Blackwood came in and hoicked the seventh ball he faced, off Rabada, over square leg for four. He continued to regularly pump the ball over the top, running away to a 51-ball half-century. At the other end, Joshua Da Silva was more circumspect and contributed 17 to a 58-run sixth-wicket partnership before he fell to Rabada Blackwood, though, went after South Africa’s premier seamer and shanked him over his head for an imposing four. When Anrich Nortje shifted his angle to around the wicket, he ramped him over deep third for four. Jason Holder also operated at almost a run-a-ball in a 37-run seventh-wicket stand with Blackwood before Rabada had him nicking behind with a perfectly-pitched delivery. Though Rabada looked like wasn’t at his best earlier in the day, floating some balls in the lower 130-kph range, his seven-over spell post tea, in which he dismissed both Holder and Blackwood, was perhaps the most decisive passage of play. The day had started on a more promising note for West Indies. Roach struck with his first ball to cut Aiden Markram’s innings short at 47 off 58. He went wide of the crease, tricked Markram into playing for the inward angle from over the wicket but got it to straighten late off the seam and graze the outside edge. Marais Erasmus, the on-field umpire, didn’t rule Markram out initially, but he opted to walk back to the dressing room. In his next over, Roach went wide of the crease again, but this time he beat Jansen’s outside edge and hit the top of the off stump. Roach also helped snip the South African tail, but Coetzee’s spunky cameo (20 off 15 balls) pushed their lead closer to 250. Markram aside, Coetzee was the only South Africa batter to score more than 10 runs in their second innings. He then combined and Rabada, Jansen and Norje with the ball to compensate for their batting collapse and wrap the game up before drinks on the third afternoon. West Indies ( ) Published on By Canada Soccer has reached an interim funding agreement with its women’s national team players amid a dispute over equal pay.The deal reflects the men’s team’s terms with game-by-game incentives and results-based compensation. The women’s team had threatened to boycott a camp in April if demands over funding and pay inequality are not met.A final collective bargaining deal with both the men’s and women’s sides remains under negotiation. “Canada Soccer has announced that a deal in principle has been reached with the Women’s National Team Players on an interim funding agreement for 2022,” the Canada Soccer Association (CSA) said in a statement on Thursday. The women’s team’s last agreement with CSA expired in 2021. In February, Canada’s women called off a planned strike because of the governing body’s threats of legal action, but they protested during the recent SheBelieves Cup by wearing purple T-shirts with the phrase “enough is enough” before their matches. “This is about respect, this is about dignity, and this is about equalising the competitive environment in a world that is fundamentally unequal,” Canada Soccer’s general secretary Earl Cochrane said. “We have been consistent and public about the need to have fairness and equal pay be pillars of any new agreements with our players, and we are delivering on that today.” Earlier this week, Canada Soccer president Nick Bontis announced his resignation, a decision welcomed by the Canadian Soccer Players’ Association (CSPA) and Canadian Men’s National Soccer Team Players’ Association (CMNSTPA) as “one necessary step” in ensuring the future success of the national teams.In a joint statement, the CSPA and CMNSTPA asked Canada Soccer for “transparent and comprehensive access” to financial records in light of recent funding cuts. They also want immediate action from the governing body to address the unauthorised use of player images, as well as financial restraints imposed by CSA’s agreement with Canada Business Soccer.Canada’s men went on strike in June 2022 after accusing CSA of “disrespect” over World Cup prize money and have said they “wholeheartedly support” the women’s side. The CSA spent $11m (£6.72m) on the men’s programme in 2021 and $5.1m (£3.11m) on the women’s programme.The women’s players said the “disgusting” discrepancy between the programmes became apparent at last year’s men’s World Cup. They are looking for the same backing for this year’s Women’s World Cup as the men received before Qatar, where they competed in the tournament for the first time in 37 years.Canada’s women, who are sixth in the world rankings and won Olympic gold in 2021, are in Group B for the World Cup, which takes place from 20 July to 20 August in Australia and New Zealand. Published on By World number one Novak Djokovic continued his perfect start to 2023 by beating Hubert Hurkacz to reach the Dubai Tennis Championships semi-finals.The 35-year-old Serb took his record to 15-0 so far this year with a 6-3 7-5 win over Poland’s Hurkacz. Djokovic, who is chasing a sixth win in Dubai, was to face Daniil Medvedev for a place in Saturday’s final.Australian Open finalist Medvedev defeated Borna Coric 6-3 6-2 to stay on track for a third title this year. Meanwhile, defending champion Andrey Rublev beat Botic van de Zandschulp to progress.The second seed defeated his Dutch opponent 6-3 7-6 (7-3) and will play Alexander Zverev in the last four as the German overcame Lorenzo Sonego 7-5 6-4. Djokovic needed just 71 minutes to see off Hurkacz and is looking in fine form as he looks to win his third tournament of the year. “I found the rhythm on my serve throughout the second set,” he said. “I’m really glad with how I played under pressure.” Meanwhile, Djokovic is waiting for a response on his application for an exemption to visa rules on vaccines in order to enter the United States before the Masters 1000 event in Indian Wells, which begins on 8 March. The draw for that tournament takes place on Monday, and Djokovic said: “Whatever the decision is before the draw, if I’m not allowed I’m going to pull out, of course, before the draw.”","pubDate":"2023-03-03 23:40:16","image_url":null,"source_id":"island","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Djokovic beats Hurkacz to reach semi-finals in Dubai","link":"http://island.lk/djokovic-beats-hurkacz-to-reach-semi-finals-in-dubai/","keywords":["Sports"],"creator":["Thilina Walpola"],"video_url":null,"description":"World number one Novak Djokovic continued his perfect start to 2023 by beating Hubert Hurkacz to reach the Dubai Tennis Championships semi-finals.The 35-year-old Serb took his record to 15-0 so far this year with a 6-3 7-5 win over Poland’s Hurkacz. Djokovic, who is chasing a sixth win in Dubai, was to face Daniil Medvedev […]","content":"World number one Novak Djokovic continued his perfect start to 2023 by beating Hubert Hurkacz to reach the Dubai Tennis Championships semi-finals.The 35-year-old Serb took his record to 15-0 so far this year with a 6-3 7-5 win over Poland’s Hurkacz. Djokovic, who is chasing a sixth win in Dubai, was to face Daniil Medvedev for a place in Saturday’s final.Australian Open finalist Medvedev defeated Borna Coric 6-3 6-2 to stay on track for a third title this year. Meanwhile, defending champion Andrey Rublev beat Botic van de Zandschulp to progress.The second seed defeated his Dutch opponent 6-3 7-6 (7-3) and will play Alexander Zverev in the last four as the German overcame Lorenzo Sonego 7-5 6-4. Djokovic needed just 71 minutes to see off Hurkacz and is looking in fine form as he looks to win his third tournament of the year. “I found the rhythm on my serve throughout the second set,” he said. “I’m really glad with how I played under pressure.” Meanwhile, Djokovic is waiting for a response on his application for an exemption to visa rules on vaccines in order to enter the United States before the Masters 1000 event in Indian Wells, which begins on 8 March. The draw for that tournament takes place on Monday, and Djokovic said: “Whatever the decision is before the draw, if I’m not allowed I’m going to pull out, of course, before the draw.” Published on By Canada Soccer has reached an interim funding agreement with its women’s national team players amid a dispute over equal pay.The deal reflects the men’s team’s terms with game-by-game incentives and results-based compensation. The women’s team had threatened to boycott a camp in April if demands over funding and pay inequality are not met.A final collective bargaining deal with both the men’s and women’s sides remains under negotiation. “Canada Soccer has announced that a deal in principle has been reached with the Women’s National Team Players on an interim funding agreement for 2022,” the Canada Soccer Association (CSA) said in a statement on Thursday. The women’s team’s last agreement with CSA expired in 2021. In February, Canada’s women called off a planned strike because of the governing body’s threats of legal action, but they protested during the recent SheBelieves Cup by wearing purple T-shirts with the phrase “enough is enough” before their matches. “This is about respect, this is about dignity, and this is about equalising the competitive environment in a world that is fundamentally unequal,” Canada Soccer’s general secretary Earl Cochrane said. “We have been consistent and public about the need to have fairness and equal pay be pillars of any new agreements with our players, and we are delivering on that today.” Earlier this week, Canada Soccer president Nick Bontis announced his resignation, a decision welcomed by the Canadian Soccer Players’ Association (CSPA) and Canadian Men’s National Soccer Team Players’ Association (CMNSTPA) as “one necessary step” in ensuring the future success of the national teams.In a joint statement, the CSPA and CMNSTPA asked Canada Soccer for “transparent and comprehensive access” to financial records in light of recent funding cuts. They also want immediate action from the governing body to address the unauthorised use of player images, as well as financial restraints imposed by CSA’s agreement with Canada Business Soccer.Canada’s men went on strike in June 2022 after accusing CSA of “disrespect” over World Cup prize money and have said they “wholeheartedly support” the women’s side. The CSA spent $11m (£6.72m) on the men’s programme in 2021 and $5.1m (£3.11m) on the women’s programme.The women’s players said the “disgusting” discrepancy between the programmes became apparent at last year’s men’s World Cup. They are looking for the same backing for this year’s Women’s World Cup as the men received before Qatar, where they competed in the tournament for the first time in 37 years.Canada’s women, who are sixth in the world rankings and won Olympic gold in 2021, are in Group B for the World Cup, which takes place from 20 July to 20 August in Australia and New Zealand. Published on By Left-arm spinner Yuri Koththigoda excelled with a match bag of nine wickets as Richmond beat D.S. Senanayake College by an innings and 43 runs in the Under 19 traditional cricket encounter which ended before tea at Dombagoda on Friday. Koththigoda teamed up with Maheesha de Silva to rattle D.S. Senanayake for a meager total of 57 runs in the first innings. In their essay Richmond posted 233 runs with Janeth Kaushal top scoring with 61 runs. Batting for the second time DSS were bowled out for 133 runs. This time Koththigoda shared eight wickets with Sharon Abhishek to record their fifth outright victory of the season. At Reid Avenue, paceman Ranuka Malaviarachchi troubled Cambrians taking four early wickets. Royal restricted Prince of Wales to 136 runs before Dasis Manchanayake top scored with 91 runs for the home team to reach 185 for five wickets at stumps. Meanwhile, at Sooriyawewa, Maliyadewa topped 400 runs against Mahinda as Gayana Weerasinghe scored 149 runs inclusive of 17 fours and two sixes. In another traditional match, which ended in a draw, St. Anne’s took first innings honours against St. Joseph Vaz’s as Mahima Kotuwila scored a century to propel their total to 358 runs at Kurunegala. Richmond Maliyadeva top 400 runs at Sooriyawewa Maliyadeva 415 for 7 in 100 overs (Chamathkar Hettiarachchi 48, Pasindu Menaka 34, Chandupa Abeysinghe 38, Amesh Tennakoon 64, Gayana Weerasinghe 149, Jayamin Muthukumarana 38; Shehan Hasaranga 4/84) Published on By India’s bid to defend 75 on the third day of the Indore Test started on the right note with R Ashwin striking off the second delivery of the day. After getting one to rip past Usman Khawaja’s outside edge in the first ball, he had him caught behind off the next ball with a similar delivery. Khawaja’s review went in vain, but that proved to be India’s lone moment of joy on the final day. While Travis Head and Marnus Labuschagne were kept on a tight leash for over ten overs by Ravindra Jadeja and Ashwin, the duo began to find a good measure of the spinners after settling in. Head began the charge by taking on Ashwin for a four and a six in the same over, which was backed up by Labuschagne’s loft off Jadeja as well. The sudden run flow put the spinners off, who had also got the ball changed at the tenth over mark. But even as Ashwin operated unchanged from one end, Australia began to press the accelerator. Head clobbered Umesh Yadav through the cover area for another boundary to get close to a fifty but before he could have a shot at it, Labuschagne finished the game off by lofting Ashwin over midwicket. The win gave Australia their first win of the series, and condemned India to their third home defeat in six years, two of which have come against a Steve Smith-led Australia. The victory also sealed Australia’s position in the World Test Championship final at the Oval in June this year. Australia ( )","pubDate":"2023-03-03 23:40:08","image_url":null,"source_id":"island","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Head leads last leg of Australia’s victory march","link":"http://island.lk/head-leads-last-leg-of-australias-victory-march-2/","keywords":["Sports"],"creator":["Thilina Walpola"],"video_url":null,"description":"India’s bid to defend 75 on the third day of the Indore Test started on the right note with R Ashwin striking off the second delivery of the day. After getting one to rip past Usman Khawaja’s outside edge in the first ball, he had him caught behind off the next ball with a similar […]","content":"India’s bid to defend 75 on the third day of the Indore Test started on the right note with R Ashwin striking off the second delivery of the day. After getting one to rip past Usman Khawaja’s outside edge in the first ball, he had him caught behind off the next ball with a similar delivery. Khawaja’s review went in vain, but that proved to be India’s lone moment of joy on the final day. While Travis Head and Marnus Labuschagne were kept on a tight leash for over ten overs by Ravindra Jadeja and Ashwin, the duo began to find a good measure of the spinners after settling in. Head began the charge by taking on Ashwin for a four and a six in the same over, which was backed up by Labuschagne’s loft off Jadeja as well. The sudden run flow put the spinners off, who had also got the ball changed at the tenth over mark. But even as Ashwin operated unchanged from one end, Australia began to press the accelerator. Head clobbered Umesh Yadav through the cover area for another boundary to get close to a fifty but before he could have a shot at it, Labuschagne finished the game off by lofting Ashwin over midwicket. The win gave Australia their first win of the series, and condemned India to their third home defeat in six years, two of which have come against a Steve Smith-led Australia. The victory also sealed Australia’s position in the World Test Championship final at the Oval in June this year. Australia ( ) Published on By Canada Soccer has reached an interim funding agreement with its women’s national team players amid a dispute over equal pay.The deal reflects the men’s team’s terms with game-by-game incentives and results-based compensation. The women’s team had threatened to boycott a camp in April if demands over funding and pay inequality are not met.A final collective bargaining deal with both the men’s and women’s sides remains under negotiation. “Canada Soccer has announced that a deal in principle has been reached with the Women’s National Team Players on an interim funding agreement for 2022,” the Canada Soccer Association (CSA) said in a statement on Thursday. The women’s team’s last agreement with CSA expired in 2021. In February, Canada’s women called off a planned strike because of the governing body’s threats of legal action, but they protested during the recent SheBelieves Cup by wearing purple T-shirts with the phrase “enough is enough” before their matches. “This is about respect, this is about dignity, and this is about equalising the competitive environment in a world that is fundamentally unequal,” Canada Soccer’s general secretary Earl Cochrane said. “We have been consistent and public about the need to have fairness and equal pay be pillars of any new agreements with our players, and we are delivering on that today.” Earlier this week, Canada Soccer president Nick Bontis announced his resignation, a decision welcomed by the Canadian Soccer Players’ Association (CSPA) and Canadian Men’s National Soccer Team Players’ Association (CMNSTPA) as “one necessary step” in ensuring the future success of the national teams.In a joint statement, the CSPA and CMNSTPA asked Canada Soccer for “transparent and comprehensive access” to financial records in light of recent funding cuts. They also want immediate action from the governing body to address the unauthorised use of player images, as well as financial restraints imposed by CSA’s agreement with Canada Business Soccer.Canada’s men went on strike in June 2022 after accusing CSA of “disrespect” over World Cup prize money and have said they “wholeheartedly support” the women’s side. The CSA spent $11m (£6.72m) on the men’s programme in 2021 and $5.1m (£3.11m) on the women’s programme.The women’s players said the “disgusting” discrepancy between the programmes became apparent at last year’s men’s World Cup. They are looking for the same backing for this year’s Women’s World Cup as the men received before Qatar, where they competed in the tournament for the first time in 37 years.Canada’s women, who are sixth in the world rankings and won Olympic gold in 2021, are in Group B for the World Cup, which takes place from 20 July to 20 August in Australia and New Zealand. Published on By Left-arm spinner Yuri Koththigoda excelled with a match bag of nine wickets as Richmond beat D.S. Senanayake College by an innings and 43 runs in the Under 19 traditional cricket encounter which ended before tea at Dombagoda on Friday. Koththigoda teamed up with Maheesha de Silva to rattle D.S. Senanayake for a meager total of 57 runs in the first innings. In their essay Richmond posted 233 runs with Janeth Kaushal top scoring with 61 runs. Batting for the second time DSS were bowled out for 133 runs. This time Koththigoda shared eight wickets with Sharon Abhishek to record their fifth outright victory of the season. At Reid Avenue, paceman Ranuka Malaviarachchi troubled Cambrians taking four early wickets. Royal restricted Prince of Wales to 136 runs before Dasis Manchanayake top scored with 91 runs for the home team to reach 185 for five wickets at stumps. Meanwhile, at Sooriyawewa, Maliyadewa topped 400 runs against Mahinda as Gayana Weerasinghe scored 149 runs inclusive of 17 fours and two sixes. In another traditional match, which ended in a draw, St. Anne’s took first innings honours against St. Joseph Vaz’s as Mahima Kotuwila scored a century to propel their total to 358 runs at Kurunegala. Richmond Maliyadeva top 400 runs at Sooriyawewa Maliyadeva 415 for 7 in 100 overs (Chamathkar Hettiarachchi 48, Pasindu Menaka 34, Chandupa Abeysinghe 38, Amesh Tennakoon 64, Gayana Weerasinghe 149, Jayamin Muthukumarana 38; Shehan Hasaranga 4/84) Published on By World number one Novak Djokovic continued his perfect start to 2023 by beating Hubert Hurkacz to reach the Dubai Tennis Championships semi-finals.The 35-year-old Serb took his record to 15-0 so far this year with a 6-3 7-5 win over Poland’s Hurkacz. Djokovic, who is chasing a sixth win in Dubai, was to face Daniil Medvedev for a place in Saturday’s final.Australian Open finalist Medvedev defeated Borna Coric 6-3 6-2 to stay on track for a third title this year. Meanwhile, defending champion Andrey Rublev beat Botic van de Zandschulp to progress.The second seed defeated his Dutch opponent 6-3 7-6 (7-3) and will play Alexander Zverev in the last four as the German overcame Lorenzo Sonego 7-5 6-4. Djokovic needed just 71 minutes to see off Hurkacz and is looking in fine form as he looks to win his third tournament of the year. “I found the rhythm on my serve throughout the second set,” he said. “I’m really glad with how I played under pressure.” Meanwhile, Djokovic is waiting for a response on his application for an exemption to visa rules on vaccines in order to enter the United States before the Masters 1000 event in Indian Wells, which begins on 8 March. The draw for that tournament takes place on Monday, and Djokovic said: “Whatever the decision is before the draw, if I’m not allowed I’m going to pull out, of course, before the draw.”","pubDate":"2023-03-03 23:40:05","image_url":null,"source_id":"island","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"PSG’s Lionel Messi receives threatening note after family’s store attacked in Argentina","link":"http://island.lk/psgs-lionel-messi-receives-threatening-note-after-familys-store-attacked-in-argentina/","keywords":["Sports"],"creator":["Thilina Walpola"],"video_url":null,"description":"Gunmen left a threatening message for Paris Saint-Germain forward Lionel Messi after attacking a supermarket owned by his in-laws in Rosario, Argentina, Rosario police confirmed on Thursday.Fourteen shots were reportedly fired at the shutters and front door of the food store “Unico,” which is located in the Lavalle district of Rosario, in the early hours […]","content":"Gunmen left a threatening message for Paris Saint-Germain forward Lionel Messi after attacking a supermarket owned by his in-laws in Rosario, Argentina, Rosario police confirmed on Thursday.Fourteen shots were reportedly fired at the shutters and front door of the food store “Unico,” which is located in the Lavalle district of Rosario, in the early hours of Thursday by two individuals on a motorbike. Nobody was injured in the early morning attack, and it was unclear why assailants would target Messi or the Unico supermarket in the country’s third-largest city of Rosario, owned by the family of his wife, Antonela Roccuzzo. Police also said the attackers left a threatening note written on a piece of cardboard that said: “Messi, we are waiting for you. Javkin is a drug dealer. He is not going to look after you.” An investigation is underway. Pablo Javkin is the mayor of Rosario, the largest city in the central province of Santa Fe, 300 kilometres (186 miles) north of Buenos Aires in Argentina.After Thursday’s incident, Javkin spoke to reporters about the increase in violence in Rosario and the shortage of police and lack of protection in the city. Javkin’s concerns are not new. He had voiced his frustration earlier this week about the lack of protection and the need for more police officers in a city where crime is on the rise.Javkin tweeted: “Rosario is 300km from Buenos Aires, it is near. We want to get all the resources against crime that Argentina has to take care of us, to protect this city that gives the country glory and science, countryside and art, federalism and union.” Neither Messi, who on Monday won Best FIFA Men’s Player after captaining Argentina to the 2022 World Cup trophy, nor his wife — both are from Rosario — has commented on the incident. Widely considered the greatest soccer player of all time, Messi currently plays for Paris Saint-Germain and spends much of his time overseas, although he often visits Rosario, where he has a home in the suburb of Funes. The French team posted a photo on social media of Messi training on Thursday morning. In Rosario, prosecutor Federico Rébola said that authorities were reviewing security camera footage and that the investigation was “preliminary.” It was the first time Messi’s in-laws had received this kind of threat, he added. Celia Arena, justice minister for Santa Fe province, where Rosario is located, said the attack amounted to “terrorism” by a “mafia” group meant to intimidate the broader population. “The aim is to deliberately cause terror in the population and discourage those of us who are fighting against criminal violence, knowing that it will be an event of global significance,” Arena wrote in a social media post. Javkin, a center-left politician in opposition to the ruling Peronist coalition, appeared to throw suspicion of complicity for the attack on both criminal gangs and federal security officials. “I doubt everyone, even those who are supposed to protect us,” Javkin said in an interview with a local radio station. He said he had recently had “very strong discussions” with members of the federal security forces over the past couple of weeks demanding that they crack down on the city’s crime. “Where are the ones who need to take care of us?” Javkin said. “It’s clear that those who have the weapons and have the possibility of investigating the criminals aren’t doing it, and it’s very easy for any gang to carry out something like this.” The federal government’s security minister, Aníbal Fernández, said that drug-related violence was not a recent phenomenon in the city and that Thursday’s attack was typical of what has happened there “for the last 20 years.” He said that the incident was an example of how drug traffickers “have won” in Rosario and that “we have to reverse that.” Opposition politicians blamed President Alberto Fernández’s administration for the continuing violence in Rosario. His predecessor, Mauricio Macri, characterized the events as a warning that the country cannot “coexist” with drug traffickers. Messi, 35, is currently renegotiating a contract with PSG that ends this year amid speculation that the soccer superstar could decide to end his career playing for one of the local Rosario clubs, Newell’s. Messi could travel to Argentina later this month to join the national squad in playing two friendly matches. One takes place March 23 against Panama in Buenos Aires, while the other one will be five days later against Curacao in the northern city of Santiago del Estero. (ESPN) Published on By West Indies threatened to turn the tables on South Africa by rolling them over for 116 on the third morning at SuperSport Park, but their own batters collapsed in similar spectacular fashion, chasing 247. Kagiso Rabada was chiefly responsible for that collapse, bagging 6 for 50 to dismiss them for 159 and seal South Africa’s victory inside three days on a track that offered variable bounce. Jermaine Blackwood’s thrilling counterattack – 79 off 93 balls – raised West Indies’ hopes, but Rabada found a little extra kick off the pitch to take him out and ensure the new era under captain Temba Bavuma and coach Shukri Conrad began with a victory in Centurion, where the South Africa women’s team that reached the T20 World Cup final five days ago was also in attendance. It was Roach who had set the scene for the day with his 11th five-for in Test cricket – and first away from home since 2017. He also surpassed Joel Garner’s tally of 259 to become West Indies’ fifth-highest wicket-taker in Test cricket. Just before lunch, Roach was warmly welcomed back by his team-mates, Jimmy Adams, West Indies’ director of cricket, and Brian Lara, the team mentor. However, the mood and tempo of the match changed quickly when Rabada struck either side of the lunch break. After having captain Kraigg Brathwaite caught down the leg side for a duck, he drew an outside edge from No. 3 Raymon Reifer. Tagenarine Chanderpaul kept playing and missing at full balls, but wasn’t particularly flustered against that length. It was the short ball that bothered him. He fell on his backside twice while trying to deal with them and then when he dared to hook a head-high bouncer from Marco Jansen, he could only top-edge it to midwicket for 10. Roston Chase misjudged an inswinger from Jansen and was castled after offering no shot. Then, when debutant Gerald Coetzee produced extra bounce to get rid of Kyle Mayers, West Indies were 33 for 5 in the 15th over. Blackwood came in and hoicked the seventh ball he faced, off Rabada, over square leg for four. He continued to regularly pump the ball over the top, running away to a 51-ball half-century. At the other end, Joshua Da Silva was more circumspect and contributed 17 to a 58-run sixth-wicket partnership before he fell to Rabada Blackwood, though, went after South Africa’s premier seamer and shanked him over his head for an imposing four. When Anrich Nortje shifted his angle to around the wicket, he ramped him over deep third for four. Jason Holder also operated at almost a run-a-ball in a 37-run seventh-wicket stand with Blackwood before Rabada had him nicking behind with a perfectly-pitched delivery. Though Rabada looked like wasn’t at his best earlier in the day, floating some balls in the lower 130-kph range, his seven-over spell post tea, in which he dismissed both Holder and Blackwood, was perhaps the most decisive passage of play. The day had started on a more promising note for West Indies. Roach struck with his first ball to cut Aiden Markram’s innings short at 47 off 58. He went wide of the crease, tricked Markram into playing for the inward angle from over the wicket but got it to straighten late off the seam and graze the outside edge. Marais Erasmus, the on-field umpire, didn’t rule Markram out initially, but he opted to walk back to the dressing room. In his next over, Roach went wide of the crease again, but this time he beat Jansen’s outside edge and hit the top of the off stump. Roach also helped snip the South African tail, but Coetzee’s spunky cameo (20 off 15 balls) pushed their lead closer to 250. Markram aside, Coetzee was the only South Africa batter to score more than 10 runs in their second innings. He then combined and Rabada, Jansen and Norje with the ball to compensate for their batting collapse and wrap the game up before drinks on the third afternoon. West Indies ( ) Published on By Canada Soccer has reached an interim funding agreement with its women’s national team players amid a dispute over equal pay.The deal reflects the men’s team’s terms with game-by-game incentives and results-based compensation. The women’s team had threatened to boycott a camp in April if demands over funding and pay inequality are not met.A final collective bargaining deal with both the men’s and women’s sides remains under negotiation. “Canada Soccer has announced that a deal in principle has been reached with the Women’s National Team Players on an interim funding agreement for 2022,” the Canada Soccer Association (CSA) said in a statement on Thursday. The women’s team’s last agreement with CSA expired in 2021. In February, Canada’s women called off a planned strike because of the governing body’s threats of legal action, but they protested during the recent SheBelieves Cup by wearing purple T-shirts with the phrase “enough is enough” before their matches. “This is about respect, this is about dignity, and this is about equalising the competitive environment in a world that is fundamentally unequal,” Canada Soccer’s general secretary Earl Cochrane said. “We have been consistent and public about the need to have fairness and equal pay be pillars of any new agreements with our players, and we are delivering on that today.” Earlier this week, Canada Soccer president Nick Bontis announced his resignation, a decision welcomed by the Canadian Soccer Players’ Association (CSPA) and Canadian Men’s National Soccer Team Players’ Association (CMNSTPA) as “one necessary step” in ensuring the future success of the national teams.In a joint statement, the CSPA and CMNSTPA asked Canada Soccer for “transparent and comprehensive access” to financial records in light of recent funding cuts. They also want immediate action from the governing body to address the unauthorised use of player images, as well as financial restraints imposed by CSA’s agreement with Canada Business Soccer.Canada’s men went on strike in June 2022 after accusing CSA of “disrespect” over World Cup prize money and have said they “wholeheartedly support” the women’s side. The CSA spent $11m (£6.72m) on the men’s programme in 2021 and $5.1m (£3.11m) on the women’s programme.The women’s players said the “disgusting” discrepancy between the programmes became apparent at last year’s men’s World Cup. They are looking for the same backing for this year’s Women’s World Cup as the men received before Qatar, where they competed in the tournament for the first time in 37 years.Canada’s women, who are sixth in the world rankings and won Olympic gold in 2021, are in Group B for the World Cup, which takes place from 20 July to 20 August in Australia and New Zealand. Published on By Left-arm spinner Yuri Koththigoda excelled with a match bag of nine wickets as Richmond beat D.S. Senanayake College by an innings and 43 runs in the Under 19 traditional cricket encounter which ended before tea at Dombagoda on Friday. Koththigoda teamed up with Maheesha de Silva to rattle D.S. Senanayake for a meager total of 57 runs in the first innings. In their essay Richmond posted 233 runs with Janeth Kaushal top scoring with 61 runs. Batting for the second time DSS were bowled out for 133 runs. This time Koththigoda shared eight wickets with Sharon Abhishek to record their fifth outright victory of the season. At Reid Avenue, paceman Ranuka Malaviarachchi troubled Cambrians taking four early wickets. Royal restricted Prince of Wales to 136 runs before Dasis Manchanayake top scored with 91 runs for the home team to reach 185 for five wickets at stumps. Meanwhile, at Sooriyawewa, Maliyadewa topped 400 runs against Mahinda as Gayana Weerasinghe scored 149 runs inclusive of 17 fours and two sixes. In another traditional match, which ended in a draw, St. Anne’s took first innings honours against St. Joseph Vaz’s as Mahima Kotuwila scored a century to propel their total to 358 runs at Kurunegala. Richmond Maliyadeva top 400 runs at Sooriyawewa Maliyadeva 415 for 7 in 100 overs (Chamathkar Hettiarachchi 48, Pasindu Menaka 34, Chandupa Abeysinghe 38, Amesh Tennakoon 64, Gayana Weerasinghe 149, Jayamin Muthukumarana 38; Shehan Hasaranga 4/84)","pubDate":"2023-03-03 23:40:02","image_url":null,"source_id":"island","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Sampath Bank sponsors ‘93rd Battle of the Maroons’","link":"http://island.lk/sampath-bank-sponsors-93rd-battle-of-the-maroons/","keywords":["Sports"],"creator":["Thilina Walpola"],"video_url":null,"description":"Sampath Bank which has always identified and dedicated their interests towards the betterment of sports in Sri Lanka will sponsor the 93rd annual inter – school encounter between Ananda College and Nalanda College will be held at the Sinhalese Sports Club (SSC) Grounds in Colombo. The sponsorship check was handed over at a ceremony held […]","content":"Sampath Bank which has always identified and dedicated their interests towards the betterment of sports in Sri Lanka will sponsor the 93rd annual inter – school encounter between Ananda College and Nalanda College will be held at the Sinhalese Sports Club (SSC) Grounds in Colombo. The sponsorship check was handed over at a ceremony held recently Published on By West Indies threatened to turn the tables on South Africa by rolling them over for 116 on the third morning at SuperSport Park, but their own batters collapsed in similar spectacular fashion, chasing 247. Kagiso Rabada was chiefly responsible for that collapse, bagging 6 for 50 to dismiss them for 159 and seal South Africa’s victory inside three days on a track that offered variable bounce. Jermaine Blackwood’s thrilling counterattack – 79 off 93 balls – raised West Indies’ hopes, but Rabada found a little extra kick off the pitch to take him out and ensure the new era under captain Temba Bavuma and coach Shukri Conrad began with a victory in Centurion, where the South Africa women’s team that reached the T20 World Cup final five days ago was also in attendance. It was Roach who had set the scene for the day with his 11th five-for in Test cricket – and first away from home since 2017. He also surpassed Joel Garner’s tally of 259 to become West Indies’ fifth-highest wicket-taker in Test cricket. Just before lunch, Roach was warmly welcomed back by his team-mates, Jimmy Adams, West Indies’ director of cricket, and Brian Lara, the team mentor. However, the mood and tempo of the match changed quickly when Rabada struck either side of the lunch break. After having captain Kraigg Brathwaite caught down the leg side for a duck, he drew an outside edge from No. 3 Raymon Reifer. Tagenarine Chanderpaul kept playing and missing at full balls, but wasn’t particularly flustered against that length. It was the short ball that bothered him. He fell on his backside twice while trying to deal with them and then when he dared to hook a head-high bouncer from Marco Jansen, he could only top-edge it to midwicket for 10. Roston Chase misjudged an inswinger from Jansen and was castled after offering no shot. Then, when debutant Gerald Coetzee produced extra bounce to get rid of Kyle Mayers, West Indies were 33 for 5 in the 15th over. Blackwood came in and hoicked the seventh ball he faced, off Rabada, over square leg for four. He continued to regularly pump the ball over the top, running away to a 51-ball half-century. At the other end, Joshua Da Silva was more circumspect and contributed 17 to a 58-run sixth-wicket partnership before he fell to Rabada Blackwood, though, went after South Africa’s premier seamer and shanked him over his head for an imposing four. When Anrich Nortje shifted his angle to around the wicket, he ramped him over deep third for four. Jason Holder also operated at almost a run-a-ball in a 37-run seventh-wicket stand with Blackwood before Rabada had him nicking behind with a perfectly-pitched delivery. Though Rabada looked like wasn’t at his best earlier in the day, floating some balls in the lower 130-kph range, his seven-over spell post tea, in which he dismissed both Holder and Blackwood, was perhaps the most decisive passage of play. The day had started on a more promising note for West Indies. Roach struck with his first ball to cut Aiden Markram’s innings short at 47 off 58. He went wide of the crease, tricked Markram into playing for the inward angle from over the wicket but got it to straighten late off the seam and graze the outside edge. Marais Erasmus, the on-field umpire, didn’t rule Markram out initially, but he opted to walk back to the dressing room. In his next over, Roach went wide of the crease again, but this time he beat Jansen’s outside edge and hit the top of the off stump. Roach also helped snip the South African tail, but Coetzee’s spunky cameo (20 off 15 balls) pushed their lead closer to 250. Markram aside, Coetzee was the only South Africa batter to score more than 10 runs in their second innings. He then combined and Rabada, Jansen and Norje with the ball to compensate for their batting collapse and wrap the game up before drinks on the third afternoon. West Indies ( ) Published on By Canada Soccer has reached an interim funding agreement with its women’s national team players amid a dispute over equal pay.The deal reflects the men’s team’s terms with game-by-game incentives and results-based compensation. The women’s team had threatened to boycott a camp in April if demands over funding and pay inequality are not met.A final collective bargaining deal with both the men’s and women’s sides remains under negotiation. “Canada Soccer has announced that a deal in principle has been reached with the Women’s National Team Players on an interim funding agreement for 2022,” the Canada Soccer Association (CSA) said in a statement on Thursday. The women’s team’s last agreement with CSA expired in 2021. In February, Canada’s women called off a planned strike because of the governing body’s threats of legal action, but they protested during the recent SheBelieves Cup by wearing purple T-shirts with the phrase “enough is enough” before their matches. “This is about respect, this is about dignity, and this is about equalising the competitive environment in a world that is fundamentally unequal,” Canada Soccer’s general secretary Earl Cochrane said. “We have been consistent and public about the need to have fairness and equal pay be pillars of any new agreements with our players, and we are delivering on that today.” Earlier this week, Canada Soccer president Nick Bontis announced his resignation, a decision welcomed by the Canadian Soccer Players’ Association (CSPA) and Canadian Men’s National Soccer Team Players’ Association (CMNSTPA) as “one necessary step” in ensuring the future success of the national teams.In a joint statement, the CSPA and CMNSTPA asked Canada Soccer for “transparent and comprehensive access” to financial records in light of recent funding cuts. They also want immediate action from the governing body to address the unauthorised use of player images, as well as financial restraints imposed by CSA’s agreement with Canada Business Soccer.Canada’s men went on strike in June 2022 after accusing CSA of “disrespect” over World Cup prize money and have said they “wholeheartedly support” the women’s side. The CSA spent $11m (£6.72m) on the men’s programme in 2021 and $5.1m (£3.11m) on the women’s programme.The women’s players said the “disgusting” discrepancy between the programmes became apparent at last year’s men’s World Cup. They are looking for the same backing for this year’s Women’s World Cup as the men received before Qatar, where they competed in the tournament for the first time in 37 years.Canada’s women, who are sixth in the world rankings and won Olympic gold in 2021, are in Group B for the World Cup, which takes place from 20 July to 20 August in Australia and New Zealand. Published on By Left-arm spinner Yuri Koththigoda excelled with a match bag of nine wickets as Richmond beat D.S. Senanayake College by an innings and 43 runs in the Under 19 traditional cricket encounter which ended before tea at Dombagoda on Friday. Koththigoda teamed up with Maheesha de Silva to rattle D.S. Senanayake for a meager total of 57 runs in the first innings. In their essay Richmond posted 233 runs with Janeth Kaushal top scoring with 61 runs. Batting for the second time DSS were bowled out for 133 runs. This time Koththigoda shared eight wickets with Sharon Abhishek to record their fifth outright victory of the season. At Reid Avenue, paceman Ranuka Malaviarachchi troubled Cambrians taking four early wickets. Royal restricted Prince of Wales to 136 runs before Dasis Manchanayake top scored with 91 runs for the home team to reach 185 for five wickets at stumps. Meanwhile, at Sooriyawewa, Maliyadewa topped 400 runs against Mahinda as Gayana Weerasinghe scored 149 runs inclusive of 17 fours and two sixes. In another traditional match, which ended in a draw, St. Anne’s took first innings honours against St. Joseph Vaz’s as Mahima Kotuwila scored a century to propel their total to 358 runs at Kurunegala. Richmond Maliyadeva top 400 runs at Sooriyawewa Maliyadeva 415 for 7 in 100 overs (Chamathkar Hettiarachchi 48, Pasindu Menaka 34, Chandupa Abeysinghe 38, Amesh Tennakoon 64, Gayana Weerasinghe 149, Jayamin Muthukumarana 38; Shehan Hasaranga 4/84)","pubDate":"2023-03-03 23:40:00","image_url":null,"source_id":"island","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Shane Warne death anniversary: Adam Gilchrist, Ed Sheeran and Bill Lawry remember cricket legend","link":"https://247newsaroundtheworld.com/sports/shane-warne-death-anniversary-adam-gilchrist-ed-sheeran-and-bill-lawry-remember-cricket-legend/","keywords":["Sports"],"creator":["247 News Around The World"],"video_url":null,"description":"247 News Around The World 247 News Around The World Today marks the first anniversary of Shane Warne’s passing, who died from… The post Shane Warne death anniversary: Adam Gilchrist, Ed Sheeran and Bill Lawry remember cricket legend appeared first on 247 News Around The World.","content":"Today marks the first anniversary of Shane Warne’s passing, who died from a heart attack while attending a wellness retreat in Thailand in news the cricket world has still not recovered from. He was only 52 years old, and the news of his death caused shockwaves around the globe, triggering a massive outpouring of grief and love, which still resonates profoundly today. Adam Gilchrist was one of Warne’s closest friends and he paid tribute to his great mate one year on from his passing. ‘It is still quite hard to believe, isn’t it?’ Gilchrist said in an interview with ABC Radio. ‘A bloke we thought was invincible, to think not only is he gone but it has been a year on.’ Warne, the late Andrew Symonds celebrate the good times during their time together in the Australian Test cricket team Warne and Gilchrist pose for a portrait at the Junction Oval and celebrate a wicket in the Australian ODI team ‘I think what made so many people [love him] … although they didn’t know Shane, I think the fact he was such a character, he was almost reflective of what every grade cricket club has around in their team,’ he said. ‘They have a guy that works all week does their job and then goes to training a couple of those nights and then just lives for the weekend to go and play cricket with his mates.’ It was that rawness, that sense that Warne was a real person – warts and all – that endeared him to so many. ‘He’s very real. The fact that he found his way into a bit of trouble here and there off the field, that made him even more real,’ Gilchrist said. ‘He wasn’t infallible, he made mistakes like the rest of us. ‘I think that is what made him so engaging to people. Although he was a Hollywood type status personality, he could still engage with, for want of a better term, the common people. ‘He would go out the back of the commentary box to have a dart or just sit and next thing you know he is teaching a kid how to bowl leg spin because an enquiring dad came up and asked him. ‘Yet he could mix with royalty as well. He was intriguing and I think everyone felt a level of engagement with him at some point.’ Warne talks to a group of fans in tsunami-hit Galle cricket stadium. He always had the time to engage with fans around the world Australian fans show their support for Warne on day two of the fourth Ashes Test match between Australia and England at the Melbourne Cricket Ground in 2006 There are so many memories that Gilchrist and Aussie Test cricket fans will never forget, like the Gatting ball and his 700th Test wicket. Gilchrist said it was a privilege to be one of only two wicketkeepers, including Ian Healy, to ever keep wicket to Warne as Test match level. ‘It was mesmerising,’ he said. ‘In one Shane Warne delivery you could almost sum up his entire personality and character. ‘Standing and waiting at the top of his mark, waiting and pausing until it felt like perhaps the whole cricketing world for that one moment was honing in on him. ‘Starting a mind game and a battle with the batter at the other end. ‘He was all up for a battle. He was a very aggressive type that like a challenge. ‘You mention the Gatting ball, I reckon I kept wicket to 100 or more very, very similar deliveries.’ Former Australian and Rajasthan Royals player Shane Warne talks with children from the Rajasthan Royals UK academy Another close associate of Warnie that shared his stories with the cricket legend was Tom Malone, the former boss of Wide World of Sports. One anecdote that Malone shared highlight Warnie’s giving nature, involving the late Kerry Packer, a tour of India and a mobile phone. ‘His first contract wasn’t actually for money, but Kerry gave him a phone for a tour of India,’ Malone told Ben Fordham on 2GB. ‘Warnie, as generous as he was, let all the team use the phone while they were touring India. ‘So when he got back I think the bill for the phone was about $50,000USD. So Kerry said ‘well you’re not getting a phone again, we will put you on a salary’. There was also the brief career of Warnie the sports newsreader. ‘He then got him to read the 11am news one day in Melbourne for sports update,’ Malone said. ‘As Warnie tells the story, Kerry rang him the next day straight afterwards and said “I think you better stick to spin bowling”.’ A SNAPSHOT OF GREATNESS Widely regarded as one of cricket’s greatest bowlers in history, Warne was selected as one of five Wisden Cricketers of the Century in 2000 by a panel of cricket experts. He was the only specialist bowler and the only one who was still playing at the time. Warne made his Test debut in 1992 and went on to take over 1,000 wickets in Tests and One Day Internationals (ODIs). Until 2007, his record of 708 Test wickets was the highest number of wickets taken by any bowler in Test cricket. He was also named one of the Wisden Cricketers of the Year in the 1994 Wisden Cricketers’ Almanack and was the Wisden Leading Cricketer in the World in both 1997 and 2004. While Warne’s partying antics were well reported during his career, there was one time the legendary leg-spinner sacrificed a night on the tiles to help his great mate and fellow commentator Bill Lawry. When Channel Nine lost the rights to the cricket in 2018, a party was held in Sydney for the end of an era with all past and present commentators invited. ‘He was actually flying from overseas that morning, straight into Melbourne,’ Malone said. ‘Turned around quickly and said “how is Bill Lawry coming up?” ‘At this point Bill was 79 or 80 and was not commentating or moving around the country as much. Bill Lawry and Shane Warne are two of the greatest Victorians to ever play the game of cricket ‘He said “I’ll bring Bill up” and he chaperoned Bill, he brought Bill up on the plane, got him from the airport to Channel Nine. ‘Warnie would have liked to kick on, because a few of the others kicked on until well into the night. ‘But Warnie said ‘no I have to accompany Bill back home’. ‘Once you had Warnie’s trust, you had it for life. ‘The way he looked after people, he was big on manners, big on kindness and generosity. ‘He really was an incredible individual.’ Sheeran and Warne were unlikely friends, showing the level of reach the great Aussie leg-spinner had Summer, Brooke and Jackson Warne got to meet Sheeran on his tour of Australia and the singer paid tribute to their father at his MCG concert During his first concert in Melbourne on Thursday night, Ed Sheeran honoured his friend Shane Warne by performing The A-Team in front of a crowd of 100,000 at the MCG. Sheeran acknowledged Warne’s absence, remarking that the venue was special to him, before dedicating the song to ‘Shane and his kids.’ ‘Being in the MCG tonight and not having my friend Shane Warne here to watch this … I know this venue was really, really special to him,’ Sheeran said. Warne’s children Brooke, Jackson, and Summer were present at the concert, with Brooke sharing the performance on her Instagram and expressing her love for both Ed and her late father. ‘Love you Ed and miss you Dad,’ she posted. Post source: Daily mail","pubDate":"2023-03-03 20:52:40","image_url":null,"source_id":"247newsaroundtheworld","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"\"मुझे एमएस धोनी से इसकी सबसे कम उम्मीद थी\", कार्तिक ने किया अपनी कमेंट्री को लेकर खुलासा","link":"https://sports.ndtv.com/hindi/cricket/i-least-expected-this-ms-dhoni-dinesh-karthik-reveals-about-his-commentary-3832518#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"IPL 2023: अंतरराष्ट्रीय कमेंट्री में खुद को स्थापित कर चुके दिनेश कार्तिक (Dinesh Karthik) शुरू होने वाली आईपीएल में आरसीबी के लिए खेलते दिखायी पड़ेंगे.","content":"भारत के पूर्व विकेटकीपर दिनेश कार्तिक आईपीएल में खेलते दिखेंगे रॉयल चैलेंजर्स बेंगलोर के विकेटकीपर-बल्लेबाज ने दिनेश कार्तिक ने कहा कि विश्व कप विजेता पूर्व भारतीय कप्तान महेंद्र सिंह धोनी (MS Dhoni) उनकी कमेंट्री का ‘काफी लुत्फ उठाते' हैं. भारत-ऑस्ट्रेलिया टेस्ट श्रृंखला में फिलहाल कामेंट्री कर रहे 37 वर्षीय कार्तिक (Dinesh Karthik) आगामी आईपीएल (IPL 2023) में मैदान पर आरसीबी का प्रतिनिधित्व करते हुए दिखेंगे. कार्तिक ने ‘आरसीबी पॉडकास्टर' पर कहा कि धोनी से मिले तारीफ के एक-एक शब्दों ने उनके लिए कमेंट्री को और खास बना दिया. कार्तिक ने कहा, ‘मुझे कमेंट्री के जो थोड़े बहुत मौके मिले है, मैंने उसका आनंद लिया. मुझे लगता है कि मुझे खेल के बारे में बोलने, विश्लेषण करने में बहुत मजा आ रहा है. मैं इस तरह से वर्णन करना चाहता हूं कि इस खेल को देखने वाले हर व्यक्ति के लिए कुछ सार्थक हो.' उन्होंने कहा, ‘आप जानते हैं, मैंने हमेशा अपने तरीके से एक स्थिति से बाहर निकलने की कोशिश की और इसे उस तरह से स्पष्ट करने की कोशिश की, जिस तरह से मैंने सोचा था.' भारत के लिए खेल के तीनों प्रारूपों में खेल चुके कार्तिक ने कहा, ‘मुझे सबसे बड़ी प्रशंसा उस व्यक्ति से मिली जिसकी मुझे सबसे कम उम्मीद थी. मैं धोनी की बात कर रहा हूं. उन्होंने मुझे कहा, ‘मैंने वास्तव में कमेंट्री का आनंद लिया. बहुत-बहुत अच्छा. आप शानदार कर रहे है.' आरसीबी के लिए पिछले सत्र में 183 के शानदार स्ट्राइक रेट से 330 रन बनाने वाले इस खिलाड़ी ने कहा, ‘इस पर मुझे सुखद आश्चर्य हुआ. मैंने उन्हें शुक्रिया कहा. आप जानते है कि यह मेरे लिए बड़ी बात है. वह खेल पर करीब से नजर रखते हैं. इसलिए उनसे ऐसी बातें सुनना वास्तव में अच्छा थाय और मुझे खुशी है कि उन्होंने मेरी कमेंट्री का आनंद लिया. * * पढ़ें देश-विदेश की ख़बरें अब हिन्दी में ( ) | (Elections 2023) के लाइव अपडेट के लिए हमें फॉलो करें और जानें इलेक्शन रिज़ल्ट्स (Election Results) सबसे पहले | लाइव खबर देखें: फॉलो करे:","pubDate":"2023-03-03 18:34:35","image_url":"https://c.ndtvimg.com/2023-03/b12hp268_dinesh-karthik-806_625x300_02_March_23.jpg","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Solid gold: NRL season opener showed the benefit of finding a winner","link":"https://www.theage.com.au/sport/solid-gold-nrl-season-opener-showed-the-benefit-of-finding-a-winner-20230303-p5cp3q.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":["Sport"],"creator":["Peter FitzSimons"],"video_url":null,"description":"Harry Grant’s match-winner on Thursday night capped a cracking return for the NRL.","content":"You’re right, that was a cracking opener for the NRL season, one that could barely have been scripted better. It was a see-sawing game, with the score at 12-12 at the end of regulation time. The deadlock was only broken in golden point when the Storm hooker Harry Grant scored a barn- burning beauty with a touch of Toutai Kefu’s famous “Inspector Gadget” try two decades ago about it – with, even as three men hit him well out from the line, the impossibly long hand reaching out to plonk it down. Game over. And the Storm win their opening round match for the 20th time in a row . Every now and then you see criticism of the golden point finish. This climax showed how wrong-headed that talk is. Imagine that great match had finished with a 12-12 draw, bearing in mind the famous dictum that “a draw is likely kissing your sister.” Instead, we had this superb sporting theatre, with a fabulous climax. Just when you think most professional sport is corporate soullessness in boots and running shoes, this happens. During the week, no less than the Barmy Army made a moving gesture by putting a wonderful rendition of West Side Story’s signature tune Maria on Twitter , while tagging Australian cricket captain Pat Cummins and noting “‘Maria’ from West Side Story in support of Pat Cummins, who’s mother Maria has entered palliative care.” The Barmy Army in action. Credit: Jessica Hromas Cummins graciously replied, writing, “This is amazing @TheBarmyArmy , thankyou. Mum loved watching this and felt very touched.” Maria Cummins is, as readers might remember, a good egg. I have noted here a couple of times the story of the little boy on summer holidays a few years ago, who was noted by the neighbours to spend hours on end out in the backyard either hitting a ball on the end of a rope hanging from a tree or bowling a tennis ball against the garage door. The immediate neighbours got his name and address, and shortly after he got home, he received a package in the post from “P. Cummins”, with a nice note from the Australian fast bowler, and two signed match shirts, with some signed posters. The neighbours were Peter and Maria Cummins. Syd Fischer, who died earlier this week, aged 95? I knew him a very little, and just a few years ago used to run into him at the gym we both frequented, even though he’d already cracked 90. As a businessman in this town, he will be remembered as a singularly tough ... fellow. As a sailor, he was an enormous contributor to Australian excellence, competing in no fewer than 40 Sydney to Hobart races, and his eight iterations of Ragamuffins were ubiquitous in many of them. Syd Fischer ahead of the 1992 Sydney to Hobart. Credit: Craig Golding Yachts he skippered won line honours for the Hobart race twice in 1988 and 1990 and the whole shooting match on handicap in 1992. In 2015, he became the oldest competitor in the race when competitor at the age of 87. As to Americas Cup campaigns, he competed in five, and in an obituary this week, the Australian Sailing website noted “In addition to his own achievements, Fischer was also noted for launching the America’s Cup careers of some of today’s most famous Australian yachtsmen, in particular Jimmy Spithill, lain Murray and Hugh Treharne, who was tactician aboard the 1983 Cup winner, Australia I.” A quarter-century ago, Fischer built an America’s Cup campaign around Spithill’s skill, making him the youngest skipper in Cup history. “He’s a 20-year-old with a 40-year-old head,” Fischer said. “He’s cool. I met him when he was still at school. I remember thinking, this is a kid who’s really with it. He’s not some petulant, spoilt brat. He’s just a good ordinary Aussie – a bit like a Kiwi, I guess.” As near as I can work out, Fischer took much the same approach to sailing as he did in the building business. When asked once about his notoriously tough approach in both he didn’t back down. “Well, if I meet an arsehole I can be an arsehole, too. It’s as simple as that.” Vale Syd. Whatever else, an Australian original. No, no, no, I won’t snarl unpleasantly and with unseemly joy over the fact that the first televised ratings of Greg Norman’s LIV Golf series for 2023 were lower than a snake’s belly button, and you can’t make me. Can I, however, just express a little wonder in tune with the international golf media, that the ratings were that low? In sports-mad America, it is nigh on inconceivable that a televised tournament boasting several world-class golf stars, could pull just two – count ’em, two – households per 1000. That, friends, is just higher than a test pattern. Greg Norman at the LIV Golf event in Mexico. Credit: Getty Images What does it mean? I’ll go with the bleeding obvious, please Tony Barber. I say it is a comprehensive rejection of everything that LIV stands for, starting with a tournament financed by the brutal Saudi regime, fronted by Norman, and boasting an entirely different format that the golf community clearly just don’t want. As this column has noted there was never any complaint in the first place about the way it works at the Masters, the British Open et al, with a staggered start, a cut of the lowest half of the field after two days and the final, wonderful build to the back nine on Sunday. Instead of this tried-and-true traditional format, Norman pioneered golf where there is no halfway cut; everyone gets prize money; players are in made-up “teams”; there are shotgun starts so all 18 holes have golfers ready to tee off when the broadcast begins – and if I’m Arthur, you must be Martha, but no-one is quite sure, so what else is on? “LIV had a real opportunity to draw in viewers considering the weak field in the PGA Tour over the weekend,” the New York Post commented, “and flopped spectacularly.” Good! The Storm’s Cameron Munster when asked after Thursday night’s match if the compound fracture of his finger would require surgery: “You’re asking the wrong bloke. I’m a footballer.” Dan Wolen from USA Today after the first televised round of LIV Golf for 2023 drew ratings just slightly higher than a test pattern: “ Can you really call it ‘Golf But Louder’ when you’d need a stethoscope to determine if this tour even has a pulse?” Eamon Lynch writes in Golfweek : “Norman’s LIV Golf has a solitary anchor that prevents it from being dashed on the rocks of commercial reality, the Public Investment Fund of Saudi Arabia ...” North Melbourne coach Alastair Clarkson , to a female reporter Tarryn Thomas: “Your time will come.” Called out on it, Clarkson apologised. The last words of Australian captain Meg Lanning before the World T20 final against South Africa in Cape Town: “Let’s f---ing go!” They did, and beat the South Africans by 19 runs. Australian surfing star Molly Picklum: “Surfing-wise, I do feel like I can compete with the best in the world. And then competitive-wise, you’ve just got to make that shift when it’s your idols ... Beating people like that, who are so intelligent when it comes to competition and strategy, and they’re also the strongest women surfers in the world, that gets me excited.” Tommy Fury after defeating Jake Paul in the most irrelevant event ever: “Tonight, I make my own legacy. I am Tommy Fury.” Thanks, Scoop. Lawyer Michel Margalit on the planned concussion class action against the AFL: “The former players have told us heartbreaking stories of the impact that concussion sustained playing in the AFL has had on their personal lives, their families and their career after their footy ended. Players often enter into AFL careers as teenagers, without the life experience or perspective to understand the life-long debilitating impacts of concussion. These players need to be protected and adequately cared for if injured.” Storm coach Craig Bellamy: “I’m pretty sure this is gonna be my last year as a head coach. I’ll still be around the club a bit in a part-time role at the end of this year, but nothing’s really changed. I’m not quite sure when the club wants a definite answer, but I want to give [them] plenty of time to find a new coach ... I can’t see anything changing this year as to me not retiring at the end of the year.” Novak Djokovic on breaking Steffi Graf’s record for most weeks as world No. 1: “It’s surreal to be that many weeks No. 1, to match Graf - one of the all-time greats. Just being amongst these legendary names is flattering. I’m proud of it.” He is at 378 weeks and counting. Ben Stokes on losing to New Zealand by one run: “That game as a whole, in terms of what Test cricket’s about, was just incredible. Sometimes things don’t happen the way you want them to but it was a good one, wasn’t it?” Steve Smith on captaining the Test side in the absence of Pat Cummins: “It normally brings the best out of me.” And it did. Sonny Bill Williams: “I’m a simple guy, my biggest learnings have come from my biggest mistakes. If you look up growth in the dictionary, I’m sure my name is underneath it.” Australia . Won the women’s T20 title for the third time in a row and the sixth time in the past seven editions. Riding the Dolphins ... Wayne Bennett. Credit: John Shakespeare Manchester United . Won the English League Cup, their first trophy since 2017. Dolphins . First new NRL team since Titans in 2007. Their first match, with Wayne Bennett in charge, is against the Roosters on Sunday. Waratahs . Back on the horse later on Saturday against the Fijian Drua. Ange Postecoglou . Won another trophy with Celtic. New Zealand. Just the fourth side to win a match when following on and also only did so by one run. Twitter: @Peter_Fitz Stream the NRL Premiership 2023 live and free on 9Now . Sports news, results and expert commentary. Sign up for our Sport newsletter .","pubDate":"2023-03-03 18:22:00","image_url":null,"source_id":"theage","category":["sports"],"country":["australia"],"language":"english"}]}