{"newsArray":[{"title":"Mum on the run: why cricket WAG Candice Warner looks so great","link":"https://www.cairnspost.com.au/news/nsw/cricket-wag-candice-warner-returns-to-racing-in-surf-life-savings-summer-of-surf/news-story/e29f861e231200f8856eed247c23e3a5","keywords":["Cricket news and galleries","NSW News and Photos","Sport news and galleries"],"creator":null,"video_url":null,"description":"Candice Warner looks as strong and fit as she did in her heyday as an ironwoman - and she’s got three little girls to thank for it.","content":null,"pubDate":"2022-01-05 23:14:00","full_description":null,"image_url":null,"source_id":"cairnspost"},{"title":"Ashes 2021-22 fourth Test, day two: Australia v England – live! - The Guardian","link":"https://news.google.com/__i/rss/rd/articles/CBMibWh0dHBzOi8vd3d3LnRoZWd1YXJkaWFuLmNvbS9zcG9ydC9saXZlLzIwMjIvamFuLzA2L2FzaGVzLTIwMjEtMjItZm91cnRoLXRlc3QtZGF5LXR3by1hdXN0cmFsaWEtdi1lbmdsYW5kLWxpdmXSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Ashes 2021-22 fourth Test, day two: Australia v England – live!  The Guardian‘Dead set freak’: Double blow rocks Aussies  NEWS.com.auAussie top order get starts before England seamers strike | Men's Ashes 2021-22  cricket.com.auAustralia 3-126 in rain-hit fourth Test  Daily LiberalDay one of SCG Ashes Test spoiled by rain as cricket's customs get in the way of the game  ABC NewsView Full coverage on Google News","content":null,"pubDate":"2022-01-05 22:36:27","image_url":null,"source_id":"google"},{"title":"Bumrah and Jansen in a fiery encounter!","link":"https://www.cairnspost.com.au/sport/cricket/bumrah-and-jansen-in-a-fiery-encounter/video/7445157f75ddb80aaa55030526ed3aba","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket: After facing a few short deliveries in a row, India's Jasprit Bumrah took exception to South African quick Marco Jansen, the pair exchanging words at the wicket.","content":null,"pubDate":"2022-01-05 20:56:09","full_description":null,"image_url":null,"source_id":"cairnspost"},{"title":"‘Learn to take it, kid’: Indian star called out as umpires intervene in spiteful Test clash - Fox Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMinQFodHRwczovL3d3dy5mb3hzcG9ydHMuY29tLmF1L2NyaWNrZXQvcmFiYWRhLWhpdHMtYmFjay1mb3ItdGhlLXByb3RlYXMtYWZ0ZXItZmllcnktY29uZnJvbnRhdGlvbi1oYWx0ZWQtYnktdW1waXJlcy9uZXdzLXN0b3J5Lzg5ZTgxZDhjOGVkYWE1ZjY4MjA1NjIzOTFlN2ZlMmJi0gGdAWh0dHBzOi8vd3d3LmZveHNwb3J0cy5jb20uYXUvY3JpY2tldC9yYWJhZGEtaGl0cy1iYWNrLWZvci10aGUtcHJvdGVhcy1hZnRlci1maWVyeS1jb25mcm9udGF0aW9uLWhhbHRlZC1ieS11bXBpcmVzL25ld3Mtc3RvcnkvODllODFkOGM4ZWRhYTVmNjgyMDU2MjM5MWU3ZmUyYmI?oc=5","keywords":null,"creator":null,"video_url":null,"description":"‘Learn to take it, kid’: Indian star called out as umpires intervene in spiteful Test clash  Fox SportsThakur's record haul lights up controversial day two  cricket.com.auCaptain Elgar scenting victory over India  7NEWSThakur 7-61 but South Africa lead by 27  Bega District NewsProteas in strong position as second Test heats up  cricket.com.auView Full coverage on Google News","content":null,"pubDate":"2022-01-05 20:48:45","image_url":null,"source_id":"google"},{"title":"Australian cricket captains list: Which cricket team has had most number of Test captains?","link":"https://thesportsrush.com/cricket-news-australian-cricket-captains-list-which-cricket-team-has-had-most-number-of-test-captains/","keywords":["Cricket","Australia"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Australian cricket captains list: A rich Australian Cricketing legacy has been witness to several captains over the years across all formats. The Australian men’s Cricket team have been amongst the top Cricketing nations for quite some decades now. Having recently won the T20 World Cup in 2021 when it was least expected of them, the… The post Australian cricket captains list: Which cricket team has had most number of Test captains? appeared first on The SportsRush.","content":"Australian cricket captains list: A rich Australian Cricketing legacy has been witness to several captains over the years across all formats. The Australian men’s Cricket team have been amongst the top Cricketing nations for quite some decades now. Having recently won the T20 World Cup in 2021 when it was least expected of them, the Aussies have time and again proved their fellow competing nations that they could write them off at their own peril, even if the side has been through the most tumultuous times in their rich Cricketing history. The five-time 50-Over world champions continue to be one of the deadest sides in world Cricket producing some of the finest Cricketers with each successive generation. The team has witnessed a dominating phase especially under the reigns of former skipper Steve Waugh (1999-2004) and then under Ricky Ponting (in both the ODIs and Tests) from 2004-2010. Most Test wins as captain: Graeme Smith 53 Ricky Ponting 48 Steve Waugh 41 Virat Kohli 40#Cricket — Saj Sadiq (@SajSadiqCricket) December 30, 2021 Let’s have a look at the Australian men’s Cricket team captains list, starting with the Test format. Australian cricket captains list in Test matches Captain’s name Tenure DW Gregory 1877-1879 WL Murdoch 1880-1890 TP Horan 1885-1885 HH Massie 1885-1885 JM Blackham 1885-1894 HJH Scott 1886-1886 PS McDonnell 1887-1888 G Giffen 1894-1895 GHS Trott 1896-1898 J Darling 1899-1905 H Trumble 1902-1902 MA Noble 1903-1909 C Hill 1910-1912 SE Gregory 1912-1912 WW Armstrong 1920-1921 HL Collins 1921-1926 W Bardsley 1926-1926 J Ryder 1928-1929 WM Woodfull 1930-1934 VY Richardson 1935-1936 DG Bradman 1936-1948 WA Brown 1946-1946 AL Hassett 1949-1953 AR Morris 1951-1954 IWG Johnson 1954-1956 RR Lindwall 1956-1956 ID Craig 1957-1958 R Benaud 1958-1963 RN Harvey 1961-1961 RB Simpson 1964-1978 BC Booth 1965-1966 WM Lawry 1968-1971 BN Jarman 1968-1968 IM Chappell 1971-1975 GS Chappell 1975-1983 GN Yallop 1978-1979 KJ Hughes 1979-1984 AR Border 1984-1994 MA Taylor 1994-1999 SR Waugh 1999-2004 AC Gilchrist 2000-2004 RT Ponting 2004-2010 MJ Clarke 2011-2015 SR Watson 2013-2013 SPD Smith 2014-2021 TD Paine 2018-2021 PJ Cummins 2021-2022   ALSO READ: Most wickets in an Ashes series As far as teams with most number of Test captains are concerned, England is way ahead of the rest of the Test playing nations, with Australia taking up the second spot. Team No.of captains England 81 Australia 47 West Indies 37 South Africa 37 Pakistan 34 India 34 New Zealand 30 Sri Lanka 17 Zimbabwe 12 Bangladesh 11 Afghanistan 6 Australian cricket captains in ODIs Australia men’s Cricket side have had a total of 26 ODI captains till date. Player Span WM Lawry 1971-1971 IM Chappell 1972-1975 GS Chappell 1975-1983 RB Simpson 1978-1978 GN Yallop 1979-1979 KJ Hughes 1979-1984 DW Hookes 1983-1983 AR Border 1985-1994 RJ Bright 1986-1986 GR Marsh 1987-1991 MA Taylor 1992-1997 IA Healy 1996-1997 SR Waugh 1997-2002 SK Warne 1998-1999 AC Gilchrist 2001-2007 RT Ponting 2002-2012 MEK Hussey 2006-2007 MJ Clarke 2008-2015 CL White 2011-2011 SR Watson 2012-2013 GJ Bailey 2013-2015 SPD Smith 2015-2018 DA Warner 2016-2016 AJ Finch 2017-2020 TD Paine 2018-2018 AT Carey 2021-2021 List of T20I Australian captains Off the total 11 T20I captains Australia men’s side have had till date, Aaron Finch has led in 56* of them till date- the most by an Aussie in this format. Player Span AJ Finch 2014-2021 GJ Bailey 2012-2014 MJ Clarke 2007-2010 RT Ponting 2005-2009 DA Warner 2016-2018 SPD Smith 2015-2016 MS Wade 2020-2021 CL White 2011-2011 AC Gilchrist 2007-2007 BJ Haddin 2009-2009 SR Watson 2016-2016 The post Australian cricket captains list: Which cricket team has had most number of Test captains? appeared first on The SportsRush.","pubDate":"2022-01-05 19:30:49","full_description":null,"image_url":null,"source_id":"thesportsrush"},{"title":"Cricket-India&#039;s Rahane confident 240-run target will test South Africa","link":"https://www.thestar.com.my/sport/cricket/2022/01/06/cricket-india039s-rahane-confident-240-run-target-will-test-south-africa","keywords":null,"creator":null,"video_url":null,"description":"JOHANNESBURG (Reuters) - India’s Ajinkya Rahane believes his side have set South Africa an imposing total to win the second test despite the home team being almost halfway to their target with just two wickets down. Read full story","content":null,"pubDate":"2022-01-05 19:08:00","image_url":"https://apicms.thestar.com.my/uploads/images/2022/01/06/1432950.jpg","source_id":"thestar_my"},{"title":"Australia 126-3 after rainswept Day 1 of 4th Ashes test","link":"https://www.thehansindia.com/sports/cricket/australia-126-3-after-rainswept-day-1-of-4th-ashes-test-723339","keywords":["Sports,Today NewsPaper,Cricket"],"creator":["The Hans India"],"video_url":null,"description":"The fourth Ashes test sprung to life late on Day 1 after sweeping showers threatened to dampen the prospects of both teams for a positive start at the Sydney Cricket Ground.","content":"England's Joe Root, and James Anderson wait for umpires Rod Tucker, and Paul Reiffel replace a deformed ball during their Ashes cricket test match against Australia in Sydney on Wednesday England's Joe Root, and James Anderson wait for umpires Rod Tucker, and Paul Reiffel replace a deformed ball during their Ashes cricket test match against Australia in Sydney on Wednesday Sydney: The fourth Ashes test sprung to life late on Day 1 after sweeping showers threatened to dampen the prospects of both teams for a positive start at the Sydney Cricket Ground. After rain delays permitted only 21 completed overs in the opening two sessions Wednesday, runs and wickets came more frequently in the final passage of play as Australia reached 126-3 at stumps. Steve Smith was unbeaten on six and Usman Khawaja was four not out when rain ended play for the day.Veteran seamer Stuart Broad, recalled to the England team after being omitted for the third test in Melbourne, went someway to vindicating his selection by dismissing Warner and generally appearing the most threatening bowler in the England attack. England has lost the series but is still aiming to take something from the tour by winning an Ashes test in Australia for the first time in almost a decade. ","pubDate":"2022-01-05 18:27:59","full_description":null,"image_url":"https://assets.thehansindia.com/h-upload/2022/01/05/500x300_1144418-ashes-test.jpg","source_id":"thehansindia"},{"title":"Ebadot stars as Bangladesh beats New Zealand by 8 wickets","link":"https://www.thehansindia.com/sports/cricket/ebadot-stars-as-bangladesh-beats-new-zealand-by-8-wickets-723338","keywords":["Sports,Today NewsPaper,Cricket"],"creator":["The Hans India"],"video_url":null,"description":"Fast bowler Ebadot Hossain took a career-best 6-46 as Bangladesh beat World Test Champion New Zealand by eight wickets in the first cricket test Wednesday, capturing its first-ever win in New Zealand.","content":"Mount Maunganui: Fast bowler Ebadot Hossain took a career-best 6-46 as Bangladesh beat World Test Champion New Zealand by eight wickets in the first cricket test Wednesday, capturing its first-ever win in New Zealand. Ebadot had bowled Bangladesh to the brink of a famous victory by the end of the fourth day when he had figures of 4-39. He broke down the last of New Zealand's resistance with two quick wickets as the home team was dismissed in its second innings for 169, its lowest score against Bangladesh.New Zealand trailed by 130 runs on the first innings, leaving Bangladesh to score only 40 for victory. It lost two wickets in doing so but current captain Mominul Haque, top-scorer in the first innings, and former captain Mushfiqur Rahim were at the crease when Bangladesh reached 42-2. It was only Bangladesh's sixth test win away from home and its first test win over a team ranked in the top 5 ranked team: New Zealand is ranked No. 2 and Bangladesh No. 9. The result also brought to an end New Zealand's unbeaten streak in its last 17 tests at home.  ","pubDate":"2022-01-05 18:24:30","full_description":null,"image_url":"https://assets.thehansindia.com/h-upload/2022/01/05/500x300_1144392-ebadot.jpg","source_id":"thehansindia"},{"title":"Current weather in Sydney Cricket Ground: What is the weather prediction for Australia vs England SCG Test Day 2?","link":"https://thesportsrush.com/cricket-news-current-weather-in-sydney-cricket-ground-what-is-the-weather-prediction-for-australia-vs-england-scg-test-day-2/","keywords":["Cricket","Ashes","Australia","England"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Current weather in Sydney Cricket Ground: The SportsRush presents before you the weather prediction for Day 2 of fourth AUS vs ENG Test. The first day of the ongoing fourth Ashes 2021-22 Test between Australia and England in Sydney allowed for only 46.5 overs of play as as many as five rain breaks forced the… The post Current weather in Sydney Cricket Ground: What is the weather prediction for Australia vs England SCG Test Day 2? appeared first on The SportsRush.","content":"Current weather in Sydney Cricket Ground: The SportsRush presents before you the weather prediction for Day 2 of fourth AUS vs ENG Test. The first day of the ongoing fourth Ashes 2021-22 Test between Australia and England in Sydney allowed for only 46.5 overs of play as as many as five rain breaks forced the players to return to their respective pavilions frequently. It was Australia captain Pat Cummins who had won the toss and chosen to bat after a delayed start in the morning session. Despite opening batters Marcus Harris (38) and David Warner (30) getting off to individual starts, the home team lost two wickets in quick succession to end the day at 126/3 in 46.5 overs. Both new to the crease, Australia vice-captain Steven Smith and veteran batter Usman Khawaja will resume their innings on Day 2. Playing a Test match after more than a couple of years, 35-year old Khawaja will be looking forward to prove a thing or two at the Sydney Cricket Ground. Current weather in Sydney Cricket Ground As was the case on Wednesday, Thursday is also highly likely to witness rain playing spoilsport for the second time in a row in Sydney. According to AccuWeather, there’s a “Severe Warning for Thunderstorm” in the city for Day 2 of fourth Ashes 2021-22 Test. By now, it is self-descriptive that clouds will make their presence felt throughout the day over the SCG. As far as the rain probability is concerned, it is on the higher side (58%) in the morning session itself. Stuart Broad > Andy Dufresne#Ashes pic.twitter.com/B0lUfTdCSj — Cricket on BT Sport (@btsportcricket) January 5, 2022 While the same will drop down to 30% between 2-3 PM (local time), it will again rise to 40% by the time the last hour of play commences at the SCG. In such a scenario, players are quite likely to be seen moving to-and-fro between the ground and dressing rooms. Hourly SCG weather radar 10:00 AM – 24 degree (Mostly Cloudy). 11:00 AM – 24 degree (Showers). 12:00 PM – 25 degree (Mostly Cloudy). 01:00 PM – 25 degree (Mostly Cloudy). 02:00 PM – 26 degree (Intermittent Clouds). 03:00 PM – 26 degree (Mostly Cloudy). 04:00 PM – 25 degree (Mostly Cloudy). 05:00 PM – 25 degree (Showers). 06:00 PM – 24 degree (Mostly Cloudy). The post Current weather in Sydney Cricket Ground: What is the weather prediction for Australia vs England SCG Test Day 2? appeared first on The SportsRush.","pubDate":"2022-01-05 18:22:47","full_description":null,"image_url":null,"source_id":"thesportsrush"},{"title":"Grand final spot up for grabs in Albany and Districts Cricket Association’s Twenty20 competition","link":"https://thewest.com.au/news/albany-advertiser/grand-final-spot-up-for-grabs-in-albany-and-districts-cricket-associations-twenty20-competition-c-5181036","keywords":null,"creator":["Taj Stubber"],"video_url":null,"description":"The top two teams after the five rounds will meet in the grand final on Turf North on Sunday at 2pm.","content":null,"pubDate":"2022-01-05 18:00:00","full_description":null,"image_url":"https://images.thewest.com.au/publication/C-5181036/c471e1795bff74247a887a62c7f56ace43fb43b5-16x9-x167y383w4816h2709.jpg","source_id":"thewest"},{"title":"Grand final spot up for grabs in Albany and Districts Cricket Association’s Twenty20 competition","link":"https://thewest.com.au/news/albany-advertiser/grand-final-spot-up-for-grabs-in-albany-and-districts-cricket-associations-twenty20-competition-c-5181036","keywords":null,"creator":["Taj Stubber"],"video_url":null,"description":"The top two teams after the five rounds will meet in the grand final on Turf North on Sunday at 2pm.","content":null,"pubDate":"2022-01-05 18:00:00","full_description":null,"image_url":"https://images.thewest.com.au/publication/C-5181036/c471e1795bff74247a887a62c7f56ace43fb43b5-16x9-x167y383w4816h2709.jpg","source_id":"thewest"},{"title":"Bunbury the “perfect location” for T20 showpiece event, according to star Marist all-rounder Brayden Clarke","link":"https://thewest.com.au/news/south-west/bunbury-the-perfect-location-for-t20-showpiece-event-according-to-star-marist-all-rounder-brayden-clarke-c-5177759","keywords":null,"creator":["Jackson Barrett"],"video_url":null,"description":"Southern Smash championship winner Brayden Clarke has added his voice to growing calls from players for the South West to host its own bonanza of cricket’s shortest format.","content":null,"pubDate":"2022-01-05 18:00:00","full_description":null,"image_url":"https://images.thewest.com.au/publication/C-5177759/c2d837732fb8029ab52797acd367ff8e3c370549-16x9-x0y313w6000h3375.jpg","source_id":"thewest"},{"title":"New giant Bradbury cricket bat to be unveiled at Narrikup Cricket Club","link":"https://thewest.com.au/news/albany-advertiser/new-giant-bradbury-cricket-bat-to-be-unveiled-at-narrikup-cricket-club-c-5195042","keywords":null,"creator":["Taj Stubber"],"video_url":null,"description":"Narrikup Cricket Club will also be hosting a Twenty20 tournament with the Pilbara Lions Cricket Club this weekend.","content":null,"pubDate":"2022-01-05 18:00:00","full_description":null,"image_url":"https://images.thewest.com.au/publication/C-5195042/3c2f4e4070c15fc63f998b8829ddff66918cb4e2-16x9-x0y189w2016h1134.jpg","source_id":"thewest"},{"title":"Pujara believes talks of his and Rahane's lack of runs were 'outside noise' - ESPNcricinfo","link":"https://news.google.com/__i/rss/rd/articles/CBMijAFodHRwczovL3d3dy5lc3BuY3JpY2luZm8uY29tL3N0b3J5L3NhLXZzLWluZC0yMDIyLTJuZC10ZXN0LXB1amFyYS1iZWxpZXZlcy10YWxrcy1vZi1oaXMtYW5kLXJhaGFuZS1zLWxhY2stb2YtcnVucy13ZXJlLW91dHNpZGUtbm9pc2UtMTI5NTU5MNIBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Pujara believes talks of his and Rahane's lack of runs were 'outside noise'  ESPNcricinfoIND vs SA: Watch - Umpire Denies And Then Gives Ajinkya Rahane Out After Kagiso Rabada Appeals  Cricket AddictorIndian Batters Perform When Their Backs Are To The Wall: Ashok Malhotra  NDTVIndia vs South Africa, 2nd Test, Highlights Score Updates, Day 3: Elgar, Van der Dussen Lead Fightback Agains  India.comAfter his bat does the talking, Pujara adds: ‘Form is temporary, class is permanent’  The Indian ExpressView Full coverage on Google News","content":null,"pubDate":"2022-01-05 17:56:00","image_url":null,"source_id":"google"},{"title":"James Anderson rejects talk of big overhaul in English cricket despite Ashes debacle","link":"https://www.thehindu.com/sport/cricket/james-anderson-rejects-talk-of-big-overhaul-in-english-cricket-despite-ashes-debacle/article38138742.ece","keywords":null,"creator":["PTI"],"video_url":null,"description":"I think you don’t need to look too deep into it and start changing the wheel,” Anderson said","content":null,"pubDate":"2022-01-05 17:43:08","full_description":null,"image_url":null,"source_id":"thehindu"},{"title":"Form is temporary but class is permanent and it's true for Rahane and myself: Pujara - Times of India","link":"https://news.google.com/__i/rss/rd/articles/CBMitAFodHRwczovL3RpbWVzb2ZpbmRpYS5pbmRpYXRpbWVzLmNvbS9zcG9ydHMvY3JpY2tldC9pbmRpYS1pbi1zb3V0aC1hZnJpY2EvZm9ybS1pcy10ZW1wb3JhcnktYnV0LWNsYXNzLWlzLXBlcm1hbmVudC1hbmQtaXRzLXRydWUtZm9yLXJhaGFuZS1hbmQtbXlzZWxmLXB1amFyYS9hcnRpY2xlc2hvdy84ODcxODc3MS5jbXPSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Form is temporary but class is permanent and it's true for Rahane and myself: Pujara  Times of IndiaIND vs SA: Watch - Umpire Denies And Then Gives Ajinkya Rahane Out After Kagiso Rabada Appeals  Cricket AddictorIndia vs South Africa, 2nd Test, Highlights Score Updates, Day 3: Elgar, Van der Dussen Lead Fightback Agains  India.comIndian Batters Perform When Their Backs Are To The Wall: Ashok Malhotra  NDTVAfter his bat does the talking, Pujara adds: ‘Form is temporary, class is permanent’  The Indian ExpressView Full coverage on Google News","content":null,"pubDate":"2022-01-05 17:24:00","image_url":null,"source_id":"google"},{"title":"IND vs SA: Watch - Rishabh Pant Mocks Rassie Van der Dussen After He Forgets Where His Guard Is - Cricket Addictor","link":"https://news.google.com/__i/rss/rd/articles/CBMidWh0dHBzOi8vY3JpY2tldGFkZGljdG9yLmNvbS9jcmlja2V0L3ZpZGVvcy93YXRjaC1yaXNoYWJoLXBhbnQtbW9ja3MtcmFzc2llLXZhbi1kZXItZHVzc2VuLWFmdGVyLWhlLWZvcmdldHMtaGlzLWd1YXJkL9IBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"IND vs SA: Watch - Rishabh Pant Mocks Rassie Van der Dussen After He Forgets Where His Guard Is  Cricket AddictorSunil Gavaskar Slams Rishabh Pant: 'Has To Be Some Sense Of Responsibility'  NDTV Sports'If you have half knowledge, keep your mouth shut': Stump mic records Pant's heated exchange with van der Dussen - Watch  Hindustan TimesDifficult for Pant to be sure of Van der Dussen catch: Dinesh Karthik  Cricbuzz‘Zabardast captain hai ye’ – Rishabh Pant taunts Dean Elgar after DRS timer runs out for Keegan Petersen’s LBW verdict  CricTrackerView Full coverage on Google News","content":null,"pubDate":"2022-01-05 16:08:53","image_url":null,"source_id":"google"},{"title":"India vs South Africa 2021-22: Advantage South Africa As Dean Elgar Leads Rear-Guard Effort - News18","link":"https://news.google.com/__i/rss/rd/articles/CBMijwFodHRwczovL3d3dy5uZXdzMTguY29tL2NyaWNrZXRuZXh0L25ld3MvaW5kaWEtdnMtc291dGgtYWZyaWNhLTIwMjEtMjItYWR2YW50YWdlLXNvdXRoLWFmcmljYS1hcy1kZWFuLWVsZ2FyLWxlYWRzLXJlYXItZ3VhcmQtZWZmb3J0LTQ2MjY3MDcuaHRtbNIBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"India vs South Africa 2021-22: Advantage South Africa As Dean Elgar Leads Rear-Guard Effort  News18What is Shardul Thakur? | Cricbuzz.com - Cricbuzz  CricbuzzIND vs SA: Watch - Virat Kohli, Rahul Dravid Clap As Shardul Thakur Smashes A Four Off Marco Jansen  Cricket AddictorWho are you? Wicket falls if you just bowl: Ashwin`s hilarious remark for Shardul caught on stump-mic  WION‘Just the Kind of Player You Want in Your Team’: Gavaskar Lauds Shardul Thakur for His Heroics in Johannesb  News18View Full coverage on Google News","content":null,"pubDate":"2022-01-05 15:51:36","image_url":null,"source_id":"google"},{"title":"India vs South Africa, 2nd Test, Day 3 Highlights: South Africa 118/2 At Stumps On Day 3, Need 122 More To Win - NDTV Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMikQFodHRwczovL3Nwb3J0cy5uZHR2LmNvbS9zb3V0aC1hZnJpY2EtdnMtaW5kaWEtMjAyMS0yMi9pbmRpYS12cy1zb3V0aC1hZnJpY2EtMm5kLXRlc3QtZGF5LTMtbGl2ZS1zY29yZS11cGRhdGVzLWluZC12cy1zYS1qb2hhbm5lc2J1cmctdGVzdC0yNjg5ODE40gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"India vs South Africa, 2nd Test, Day 3 Highlights: South Africa 118/2 At Stumps On Day 3, Need 122 More To Win  NDTV SportsIND vs SA: Watch - Umpire Denies And Then Gives Ajinkya Rahane Out After Kagiso Rabada Appeals  Cricket AddictorIndia vs South Africa, 2nd Test, Live Score Updates, Day 3: South Africa 34/0 at tea, need 206 more to win against India  Times of IndiaIndian Batters Perform When Their Backs Are To The Wall: Ashok Malhotra  NDTVIndia falters at 188-6, leads South Africa by 161  Associated PressView Full coverage on Google News","content":null,"pubDate":"2022-01-05 15:38:54","image_url":null,"source_id":"google"},{"title":"Giles’s scattergun broadsides suggest a man who has gone as far as he can | Andy Bull","link":"https://www.theguardian.com/sport/2022/jan/05/giless-scattergun-broadsides-suggest-a-man-who-has-gone-as-far-as-he-can","keywords":["Ashley Giles","England cricket team","Sport","Ashes 2021-22","The Ashes","Cricket"],"creator":["Andy Bull"],"video_url":null,"description":"The ECB managing director of cricket came across as thin-skinned and indignant as he attempted to explain Ashes failureBack in 2005, Ashley Giles played what is still one of my favourite Test innings, when he made 59 on the fifth day of the fifth Test at the Oval. It was his top-score in Test cricket at the time his team needed it the most. And because it was played in the shade of Kevin Pietersen’s 158 at the other end, it went almost unnoticed. Which felt characteristic. Giles always seemed like that team’s Guildenstern, a steady lower-order bat and a spinner who often didn’t turn the ball at all. We called him the Wheelie Bin because of his ungainly action, or the King of Spain, because of a misprint on a souvenir mug.He hated the nicknames, and, understandably enough, resented the idea that he was being laughed at. Because, of course, he took his game seriously. He had to. Giles operated on the reaches of his own talent, and it was hard work out there. There was a prickliness to him that occasionally burst into the open. Like the time he marched into the press box in 2007 and confronted a journalist who had teased him in print for having the “temerity to remark that Tendulkar’s batting prowess had waned a little”. Giles didn’t like that at all. The journalist explained he was only being ironic. “What’s irony?” Giles shouted. Continue reading...","content":null,"pubDate":"2022-01-05 15:30:36","full_description":"B ack in 2005, Ashley Giles played what is still one of my favourite Test innings, when he made 59 on the fifth day of the fifth Test at the Oval. It was his top-score in Test cricket at the time his team needed it the most. And because it was played in the shade of Kevin Pietersen’s 158 at the other end, it went almost unnoticed. Which felt characteristic. Giles always seemed like that team’s Guildenstern , a steady lower-order bat and a spinner who often didn’t turn the ball at all. We called him the Wheelie Bin because of his ungainly action, or the King of Spain, because of a misprint on a souvenir mug. He hated the nicknames, and, understandably enough, resented the idea that he was being laughed at. Because, of course, he took his game seriously. He had to. Giles operated on the reaches of his own talent, and it was hard work out there. There was a prickliness to him that occasionally burst into the open. Like the time he marched into the press box in 2007 and confronted a journalist who had teased him in print for having the “temerity to remark that Tendulkar’s batting prowess had waned a little”. Giles didn’t like that at all. The journalist explained he was only being ironic. “ What’s irony ?” Giles shouted. You could hear some of that side of him in his latest interviews in Australia where, as the England and Wales Cricket Board’s managing director of cricket, he had to try to explain how and why England had managed to make such a mess of an Ashes series for which they had spent two years planning. It was an odd interview, which contained criticisms of previous England teams (“In the 90s that was accepted as normal for England leaderships and they got away with it, we set our standards much higher than that”), of “armchair selectors”, of England’s spinners (“We’ve got to have a spin resource that allows us to bowl much more overs of spin”), fast bowlers (“We need a variation in our bowling attack but we need pace”), and batsmen (“With first innings scores of 147, 236, 185, we’re not winning many Test matches”), as well as digs at county cricket (“I think there is a dearth of leadership and in the county game”) and the international schedule. Giles also said he was at peace with the idea that he was accountable for it all. He just didn’t sound like he believed it. He came across as thin-skinned and indignant that he wasn’t being given more credit for his own modest achievements. “When I came into the job we were fifth in the world in Test cricket, third in the world in Twenty20 cricket and No 1 in the world in ODIs. We’re now fourth, first in T20 and second in ODIs.” Now Giles is working on his review of what went wrong. He said he didn’t want to go into his ideas for “how I want to take this team forward and improve our red ball cricket”, but he still gave a good idea of what his conclusions are likely to be. “It’s been an extraordinary year and I think we can look at the cricket-specific stuff but we also need to look at the other stuff, particularly having 18 scheduled Test matches,” he said. “It’s a huge amount of cricket we’re playing and in a time of Covid it’s been pretty horrendous at times.” The players are reaching “their very top limit” of what they can deal with. On top of that, Giles said, what is needed now is systemic change, collective responsibility, and collective solutions. “We can make whatever changes we want. You can change me, change the head coach, change the captain. But we’re only setting up future leaders for failure.” Which underplays the degree to which getting the leadership team in place could transform the sport in this country. In the short term, the difference between a good side and a bad one often is as simple as a change in the coach and the team culture. Just ask Eddie Jones. And the simple truth is, everything is better in English cricket when the England team are winning. If Giles is right and more systemic change is needed, the pressing question is whether, given his track record in the job, he is the right man to lead it, given that he made such a mess of the (well-intentioned) rotation policy, and the mistake of binning the head selector to load more responsibility onto the coach. Same goes for Tom Harrison, the ECB’s chief executive, who, though not directly responsible for the England team’s performance, has had a hand in the congested schedule, the collapse of the Pakistan tour , the mismanagement of the racism scandal , and who also blew a ridiculous amount on a needless launch of a divisive new competition, the Hundred , which is now the single greatest obstacle to sorting out the first-class cricket schedule. And yet Harrison continues. As for Giles, he looks now like he did as a player; a man trying hard to prove he can do it but who has gone as far as he can on the talents he has. “This is a good bunch of guys here,” the 48-year-old said. No one ever said they weren’t. No one ever said that was the point, either.","image_url":"https://i.guim.co.uk/img/media/b26054492c64e0b6052c41d50ffc19b0ed3ac8e6/0_110_3500_2100/master/3500.jpg?width=460&quality=85&auto=format&fit=max&s=17b0fee0e6579aaee8afa524bd49cb62","source_id":"theguardian"},{"title":"“He’s just playing as a sledger boy”: Rishabh Pant sledges Rassie van der Dussen during IND vs SA Johannesburg Test","link":"https://thesportsrush.com/cricket-news-hes-just-playing-as-a-sledger-boy-rishabh-pant-sledges-rassie-van-der-dussen-during-ind-vs-sa-johannesburg-test/","keywords":["Cricket","India tour of South Africa 2021-22","Rassie van der Dussen","rishabh pant"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Rishabh Pant sledges Rassie van der Dussen as latter comes to bat during South Africa’s chase versus India in 2nd Test match at Johannesburg. During Day 3 of the second Test match between India and South Africa at The Wanderers in Johannesburg, India’s wicketkeeper-batter Rishabh Pant tried to get under Proteas right-handed batter Rassie van… The post “He’s just playing as a sledger boy”: Rishabh Pant sledges Rassie van der Dussen during IND vs SA Johannesburg Test appeared first on The SportsRush.","content":"Rishabh Pant sledges Rassie van der Dussen as latter comes to bat during South Africa’s chase versus India in 2nd Test match at Johannesburg. During Day 3 of the second Test match between India and South Africa at The Wanderers in Johannesburg, India’s wicketkeeper-batter Rishabh Pant tried to get under Proteas right-handed batter Rassie van der Dussen’s skin as the latter came on to bat during the second innings. Van der Dussen came out in the middle after the fall of the first innings half-centurion Keegan Petersen’s wicket, who was dismissed leg before wicket off Ravichanderan Ashwin’s bowling at the score of 28. With the spinner operating, and Pant standing right up and close to the stumps, the 24-year-old had got a perfect opportunity to give it back to van der Dussen, who had sparked off an argument with the wicketkeeper-batter earlier during Pant’s short-lived first innings stay at the crease. Rishabh Pant sledges Rassie van der Dussen The moment the 32-year-old arrived at the turf to bat, Rishabh Pant began with his verbal ding-dong from behind the stumps. Moreover, the fellow close-in fielders around van der Dussen joined in with Pant to troll the right-hander. “Playing as a sledger”- Pant began his sledging with these words, perhaps referring to Rassie’s celebration right at his face after he was dismissed by Kagiso Rabada for naught earlier in the day. Pant followed the aforementioned dig with several other such comments like-“Batting at number four, no idea of his guard after playing 5 balls.” Or “Easy to talk when you’re there…..”- perhaps referring to his Forward Short-Leg fielding position. pic.twitter.com/MOBXfJSrGJ — Cric Zoom (@cric_zoom) January 5, 2022 “Batting at no. 4 and after 5-6 balls he has no idea where his guard is” – Rishab Pant to Rassie Van Der Dussen.#SAvIND — Prajakta (@18prajakta) January 5, 2022   Rassie took one for the team cos Pant didn’t perform but now he has to cop the same treatment as well — Born Sinner (@justkholii__) January 5, 2022 ‘He is just playing as a sledger boy.. come on’ – Rishabh Pant to Rassie — Kanav Bali (@Concussion__Sub) January 5, 2022 For more Cricket related news, click here.           The post “He’s just playing as a sledger boy”: Rishabh Pant sledges Rassie van der Dussen during IND vs SA Johannesburg Test appeared first on The SportsRush.","pubDate":"2022-01-05 15:27:15","full_description":null,"image_url":null,"source_id":"thesportsrush"},{"title":"IND vs SA: Watch: \"You Guys Are Giving Me Heart Attack Every Over\" - Umpire Marais Erasmus To Indian Players On Day 3 - Cricket Addictor","link":"https://news.google.com/__i/rss/rd/articles/CBMid2h0dHBzOi8vY3JpY2tldGFkZGljdG9yLmNvbS9jcmlja2V0L3ZpZGVvcy93YXRjaC15b3UtZ3V5cy1naXZlLWhlYXJ0LWF0dGFjay1ldmVyeS1vdmVyLW1hcmFpcy1lcmFzbXVzLXRvLWluZGlhLXBsYXllcnMv0gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"IND vs SA: Watch: \"You Guys Are Giving Me Heart Attack Every Over\" - Umpire Marais Erasmus To Indian Players On Day 3  Cricket AddictorWas Rassie van der Dussen handed a raw deal? | Cricbuzz.com - Cricbuzz  Cricbuzz'If you have half knowledge, keep your mouth shut': Stump mic records Pant's heated exchange with van der Dussen - Watch  Hindustan Times‘Keep your mouth shut’ – Rishabh Pant throws away his wicket while indulging in needless talks with Rassie van der Dussen  CricTrackerDifficult for Pant to be sure of Van der Dussen catch: Dinesh Karthik  CricbuzzView Full coverage on Google News","content":null,"pubDate":"2022-01-05 14:46:46","image_url":null,"source_id":"google"},{"title":"Cricket: ODI crosses a half Century","link":"https://www.thehindubusinessline.com/news/sports/cricket-odi-crosses-a-half-century/article38132240.ece","keywords":null,"creator":["AJ Vinayak"],"video_url":null,"description":"ODI came into existence because of rains. The first ODI match was meant to be the third Ashes Test in 1971","content":null,"pubDate":"2022-01-05 14:14:28","full_description":null,"image_url":null,"source_id":"thehindubusinessline"},{"title":"Ex-India Cricketer Blames \"1-On-1 Coaching\" For Batting Struggles","link":"https://sports.ndtv.com/cricket/india-vs-south-africa-2nd-test-former-india-cricketer-blames-1-on-1-coaching-for-the-teams-batting-struggles-2690896","keywords":null,"creator":null,"video_url":null,"description":"South Africa vs India, 2nd Test: The former India cricketer blamed \"1-on-1 coaching\" for the Indian cricket team's batting struggles.","content":null,"pubDate":"2022-01-05 14:00:10","full_description":"With the Indian batting unit failing to shine in the ongoing Test series in South Africa , many fans and experts have been left enraged by the form of the likes of Cheteshwar Pujara, Ajinkya Rahane and Rishabh Pant. During the ongoing second Test match, Pujara was dismissed for three runs off 33 balls and Rahane lost his wicket in the next delivery of the same over for a golden duck in the first innings. The duo did pay back the selectors' trust during the second innings to some extent, registering half-centuries and helping India set the Proteas a 240-run target. Meanwhile, Pant could only muster 17 runs off 43 balls in the first innings and was sent packing for a three-ball duck in the second innings as India went on to get bowled out for 266. Former India cricketer Vinod Kambli shared his perspective on the situation and blamed \"1-on-1 coaching\". He also blamed personal coaching for getting too \"commercial\". Taking to social media platform Koo, Kambli wrote, \"We actually cannot blame the big players who are battling with their poor form. In today's era, Personal coaches are earning like anything but its getting commercial day by day bluffing their first duty. I will not take names but i am against 1-on-1 coaching.\" \"This is the right time to improve things because it is a question of the future of the country's team. Its our Indian cricket team\", he further added. Promoted The visitors are also without red-ball captain Virat Kohli, who has been ruled out of the match due to a back spasm. He was seen practicing in the venue ahead of the first session on Day 3. India won the first Test by 113 runs in Centurion and a victory in the second match will help them seal a 2-0 win in the three-match series.","image_url":"https://c.ndtvimg.com/2022-01/02m79a1_india-sa-afp_625x300_05_January_22.jpg?im=FeatureCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv"},{"title":"Schedule Revised For West Indies Women's Team's Tour Of South Africa","link":"https://sports.ndtv.com/cricket/cricket-south-africa-csa-announces-revised-schedule-for-bilateral-series-against-west-indies-womens-team-2690835","keywords":null,"creator":null,"video_url":null,"description":"The West Indies women's cricket team's upcoming bilateral tour of South Africa will take place from January 25 to February 6.","content":null,"pubDate":"2022-01-05 13:34:09","full_description":"Cricket South Africa (CSA) on Wednesday announced a revised schedule for the upcoming bilateral series against West Indies, consisting of a warm-up match and four ODIs. The tour is scheduled to take place between January 25 and February 6 and all matches will be hosted at the Imperial Wanderers Stadium in Johannesburg in \"a bio-secure environment\". The statement also added that the venue was close to the hotel where both teams would be staying. \"Cricket South Africa (CSA) is pleased to confirm a revised schedule for the inbound tour featuring the Momentum Proteas and the West Indies, consisting of five matches, including a warm-up clash and four Women's One-Day Internationals (ODI), taking place between 25 January - 06 February,\" the press release said. \"To accommodate the concerns and request of Cricket West Indies (CWI), CSA has resolved to host all matches in a bio-secure environment (BSE) at the Imperial Wanderers Stadium in Johannesburg, a venue close to the hotel which has been secured for exclusive use due to the ongoing pandemic,\" it further added. Promoted Both teams will be using the matches to prepare for the upcoming 2022 ICC Women's World Cup. The tournament will be hosted in New Zealand from March 4-April 3. The first ODI match will be held on January 28, followed by the second match on January 31. The third match will be held on February 3 and the fourth game on February 6.","image_url":"https://c.ndtvimg.com/2022-01/euolg7f_south-africa-instagram_120x90_05_January_22.jpg","source_id":"ndtv"},{"title":"Aussie top order get starts before England seamers strike | Men's Ashes 2021-22 - cricket.com.au","link":"https://news.google.com/__i/rss/rd/articles/CBMiK2h0dHBzOi8vd3d3LnlvdXR1YmUuY29tL3dhdGNoP3Y9MXQ3VnNIU1VKRXPSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Aussie top order get starts before England seamers strike | Men's Ashes 2021-22  cricket.com.auAustralia vs England, 4th Ashes Test, Day 1: Australia 126/3 at stumps on rain-hit opening day  Times of IndiaStuart Broad’s a world-class bowler, love it when we are out against each other: David Warner  CricTrackerRain and Omicron temper a buoyant crowd on day one of the Sydney Test  Sydney Morning HeraldEngland offer a glimpse of how Plan A might have looked  ESPNcricinfoView Full coverage on Google News","content":null,"pubDate":"2022-01-05 13:30:01","image_url":null,"source_id":"google"},{"title":"Ex-Zimbabwe cricketer Grant Flower joins Sussex as batting coach","link":"https://timesofindia.indiatimes.com/sports/cricket/news/former-zimbabwe-cricketer-grant-flower-joins-sussex-as-batting-coach/articleshow/88715179.cms","keywords":null,"creator":null,"video_url":null,"description":"Sussex Cricket on Wednesday announced the appointment of former Zimbabwe cricketer Grant Flower as the club's batting coach. Flower joins Sussex after two years as batting coach for the Sri Lanka national side. He performed the same role for Pakistan between 2014 and 2019 and for Zimbabwe between 2010 and 2014.","content":null,"pubDate":"2022-01-05 13:28:39","full_description":null,"image_url":null,"source_id":"toi"},{"title":"England: Ashley Giles calls for 'systematic changes' after shameful Ashes defeat","link":"https://zeenews.india.com/cricket/england-ashley-giles-calls-for-systematic-changes-after-shameful-ashes-defeat-2425612.html","keywords":null,"creator":null,"video_url":null,"description":"England Cricket Board director Ashley Giles apologised for the Ashes defeat and expressed his emotions on how England can improve.","content":null,"pubDate":"2022-01-05 13:02:00","full_description":null,"image_url":null,"source_id":"zeenews"},{"title":"The Ashes: England take two wickets in final session to check Australia's progress in Sydney - Sky Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMikAFodHRwczovL3d3dy5za3lzcG9ydHMuY29tL2NyaWNrZXQvbmV3cy8xMjEyMy8xMjUwOTI3Ny90aGUtYXNoZXMtZW5nbGFuZC10YWtlLXR3by13aWNrZXRzLWluLWZpbmFsLXNlc3Npb24tdG8tY2hlY2stYXVzdHJhbGlhcy1wcm9ncmVzcy1pbi1zeWRuZXnSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"The Ashes: England take two wickets in final session to check Australia's progress in Sydney  Sky SportsAussie top order get starts before England seamers strike | Men's Ashes 2021-22  cricket.com.auEngland bowlers rally against Australia on rain-interrupted opening day  The GuardianAustralia 3-126 in rain-hit fourth Test  Daily LiberalBetting tips for Australia vs England: fourth Test preview and odds  Telegraph.co.ukView Full coverage on Google News","content":null,"pubDate":"2022-01-05 12:45:00","image_url":null,"source_id":"google"},{"title":"Highest 4th innings successful run chase: What is the highest run chase in Johannesburg Test matches?","link":"https://thesportsrush.com/cricket-news-highest-4th-innings-successful-run-chase-what-is-the-highest-run-chase-in-johannesburg-test-matches/","keywords":["Cricket","India","India tour of South Africa 2021-22","South Africa"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Highest 4th innings successful run chase: South Africa will have to chase a record third-highest total at this venue to win this match. During the third day of the second Test of the ongoing India’s tour of South Africa in Johannesburg, South Africa managed to bundle out India for 266 in 60.1 overs. Resuming from… The post Highest 4th innings successful run chase: What is the highest run chase in Johannesburg Test matches? appeared first on The SportsRush.","content":"Highest 4th innings successful run chase: South Africa will have to chase a record third-highest total at this venue to win this match. During the third day of the second Test of the ongoing India’s tour of South Africa in Johannesburg, South Africa managed to bundle out India for 266 in 60.1 overs. Resuming from their overnight score of 85/2 in 20 overs, senior batters Ajinkya Rahane (58) and Cheteshwar Pujara (53) scored individual half-centuries in a 111-run partnership for the third wicket to hand India with a massive advantage in the morning session. Apart from this pair, India also lost wicket-keeper batter Rishabh Pant (0) and spinner Ravichandran Ashwin (16) in quick succession before the lunch break. Post lunch, batter Hanuma Vihari (40*) and all-rounder Shardul Thakur (28) contributed with pivotal innings which powered India in excess of the 250-run mark. South Africa, who had gained a 27-run first innings lead on Day 2, will have to chase a 240-run target to avoid their first-ever home Test series against India. Highest run chase in Johannesburg Test matches It is worth mentioning that a 240-run chase (if it happens) will be the third-highest at the Wanderers. The record for the highest run-chase in a Johannesburg Test is held by Australia who had sealed a 310-run chase with only a couple of wickets in hand at this venue a decade ago. Team Runs Overs Year Opposition Australia 310/8 86.5 2011 South Africa Australia 294/8 91.4 2006 South Africa South Africa 220/6 47.3 2006 New Zealand South Africa 164/6 62.4 1998 West Indies South Africa 67/0 13.2 2021 Sri Lanka Highest 4th innings successful run chase The current record for highest fourth innings chase in Test cricket lies with West Indies, who had sealed a 418-run target against Australia in Antigua 19 years ago. The second-highest run-chase in Test cricket had come 14 years ago when South Africa had chased down a 414-run target in Perth. The record for the highest-ever fourth innings score rests with England, who had scored a mammoth 654/5 in a 696-run chase during their tour of South Africa in 1939 in Durban. South Africa’s highest-ever fourth-innings score at home is a monumental 450/7 in 136 overs in a 458-run chase against India in Johannesburg in 2013. The post Highest 4th innings successful run chase: What is the highest run chase in Johannesburg Test matches? appeared first on The SportsRush.","pubDate":"2022-01-05 12:41:07","full_description":null,"image_url":null,"source_id":"thesportsrush"}]}