{"newsArray":[{"title":"Cricket-Black Caps tweak 2021 squad for T20 World Cup","link":"https://www.thestar.com.my/sport/cricket/2022/09/20/cricket-black-caps-tweak-2021-squad-for-t20-world-cup","keywords":null,"creator":null,"video_url":null,"description":"(Reuters) - New Zealand have named a largely settled 15-man party for the Twenty20 World Cup in Australia with Finn Allen and Michael Bracewell the only players who did not feature in the squad that made the final in 2021. Read full story","content":null,"pubDate":"2022-09-19 23:54:00","image_url":null,"source_id":"thestar_my","country":["malaysia"],"category":["sports"],"language":"english"},{"title":"Finch wants to play on beyond T20 World Cup","link":"https://www.cairnspost.com.au/sport/cricket/finch-wants-to-play-on-beyond-t20-world-cup/video/0a717fff2b10575a8b541a20dc0e0b0c","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket: Australian skipper Aaron Finch has indicated he has no desire to step away from cricket following the conclusion of the T20 World Cup.","content":null,"pubDate":"2022-09-19 22:09:19","image_url":null,"source_id":"cairnspost","country":["australia"],"category":["sports"],"language":"english"},{"title":"Nitschke to lead women's cricket's new era","link":"https://thewest.com.au/sport/cricket/nitschke-to-lead-womens-crickets-new-era-c-8295402","keywords":null,"creator":["Scott Bailey"],"video_url":null,"description":"Cricket Australia have put their faith in Shelley Nitschke to oversee the national women's team for the next four years, ahead of a crucial period for the side.","content":"Shelley Nitschke has been appointed Australia's women's cricket team head coach, charged with leading the next generation after being handed a four-year deal. Nitschke was told this week that she would replace former mentor Matthew Mott in a full-time capacity, after serving as interim leader since his exit in May. In the time since, Nitschke has guided Australia to Commonwealth Games gold and every single trophy available to them now sits in their cabinet. The period has also included the ushering in of two new assistants, with Ben Sawyer also leaving to take up a role in New Zealand. But Nitschke has long been aware she faces an era of transition not seen since Shane Warne, Glenn McGrath, Justin Langer and John Buchanan all left the men's set-up at the same time. Selecting a new leader will be among her first jobs, with vice-captain Rachael Haynes retiring last week and skipper Meg Lanning on indefinite personal leave. The likes of Alyssa Healy and Ellyse Perry are also both beyond the age of 30, while Australia enter an era of solely defending titles rather than building towards regaining them. \"I'm honoured to have been given this opportunity to lead the team full-time and to continue to build on the legacy created by Matthew Mott,\" Nitschke said on Tuesday. \"While I enjoyed my time working as assistant coach, I feel the time is right to step up and lead this group in what's shaping as a new era with a new-look coaching group and the retirement of Rachael Haynes. \"The loss of Rach will no doubt be felt, but it presents a great opportunity for others to put their hands up both from a leadership perspective as well as with the bat and in the field.\" Nitschke played 122 matches for Australia across all three formats between 2005 and 2011, taking 153 wickets as a finger-spinner and scoring more than 3000 runs. She then transitioned into coaching in South Australia, before taking on an assistant role under Mott in the national set up in 2018 and later coaching the Perth Scorchers. \"We're delighted to appoint Shelley as head coach of our world champion women's team,\" high performance manager Ben Oliver said. \"She did an outstanding job in an interim capacity during the Commonwealth Games and was the clear stand-out candidate in the recruitment process. \"Shelley is an incredibly well-respected coach with a proven track record.\" Sign up for our emails","pubDate":"2022-09-19 22:02:44","image_url":"https://images.thewest.com.au/publication/C-8295402/e0850856e204c3c538303c30dfd34d60d61baf92-16x9-x0y0w1280h720.jpg","source_id":"thewest","country":["australia"],"category":["sports"],"language":"english"},{"title":"Aussie cricket legend’s exciting new gig","link":"https://www.cairnspost.com.au/sport/cricket/shelley-nitschke-appointed-head-coach-of-allconquering-australian-womens-cricket-team/news-story/861550e4dea18d0d5d879f8ebadeedb4","keywords":["Cricket news and galleries","Kayo","Sport news and galleries","Womens Cricket"],"creator":null,"video_url":null,"description":"Former Australian cricketer Shelley Nitschke has officially replaced Matthew Mott as head coach of the all-conquering national women’s team on a four-year deal, keeping her in the role until 2027.","content":null,"pubDate":"2022-09-19 22:01:00","image_url":null,"source_id":"cairnspost","country":["australia"],"category":["sports"],"language":"english"},{"title":"SA20 auction: Tristan Stubbs the biggest buy, Donavon Ferreira also creates stir - ESPNcricinfo","link":"https://news.google.com/__i/rss/rd/articles/CBMicGh0dHBzOi8vd3d3LmVzcG5jcmljaW5mby5jb20vc3Rvcnkvc2EyMC1hdWN0aW9uLXRyaXN0YW4tc3R1YmJzLWJpZ2dlc3QtYnV5LWRvbmF2b24tZmVycmVpcmEtY3JlYXRlcy1zdGlyLTEzMzU2MDXSAX1odHRwczovL3d3dy5lc3BuY3JpY2luZm8uY29tL3N0b3J5L3NhMjAtYXVjdGlvbi10cmlzdGFuLXN0dWJicy1iaWdnZXN0LWJ1eS1kb25hdm9uLWZlcnJlaXJhLWNyZWF0ZXMtc3Rpci0xMzM1NjA1P3BsYXRmb3JtPWFtcA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"SA20 auction: Tristan Stubbs the biggest buy, Donavon Ferreira also creates stir  ESPNcricinfoSA20 League 2023 Player List Auction LIVE Updates: Deal Elgar, Temba Bavuma go unsold; Adil Rashid joins Pretoria Capitals  Zee NewsSA20 Auction: Tristan Stubbs bags the highest bid in maiden auction | Cricbuzz.com - Cricbuzz  CricbuzzGraeme Smith believes SA20 will strengthen SA cricket as IPL did for India  News24SA20 Players Auction Live Updates: Full List Of Players Sold And Unsold So Far  NDTV SportsView Full coverage on Google News","content":null,"pubDate":"2022-09-19 19:59:50","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Will take very brave man to write Kohli off: Aaron Finch","link":"https://kashmirreader.com/2022/09/20/will-take-very-brave-man-to-write-kohli-off-aaron-finch/","keywords":["SPORTS"],"creator":["Press Trust of India"],"video_url":null,"description":"MOHALI: Australia skipper Aaron Finch on Monday said it will take a very brave man to write Virat Kohli off and what the former India captain has achieved in the last 15 years is just “ridiculous”. Kohli overcame a prolonged lean patch at the Asia Cup earlier this month and also scored his 71st international […]","content":"MOHALI: Australia skipper Aaron Finch on Monday said it will take a very brave man to write Virat Kohli off and what the former India captain has achieved in the last 15 years is just “ridiculous”. Kohli overcame a prolonged lean patch at the Asia Cup earlier this month and also scored his 71st international century. The hundred was his first since November 2019. “It will be a very brave man to write Virat Kohli off. At any stage, he has shown for 15 years now that he is one of the greatest players of all time,” Finch said on the eve of the series-opener against India. “Particularly in T20 cricket, he’s someone who has developed and grown his game over such a long period that you always plan and prepare the best when you’re coming up against him. “He is super and has 71 international centuries. That’s just ridiculous,” Finch said in a virtual media interaction. Finch will be in focus during the series after he announced his retirement from ODIs following his struggles with the bat. He will be expected to be at his best ahead of the T20 World Cup at home. “Over a long period of time, you get pretty comfortable with criticism but in T20 cricket, I feel my form has been really good for quite a while now. I think if you separate the ODI form and the T20 form, then they’re totally different, they’re two different formats of the game,” said Finch. Australia will go about their plans here with one eye on the World Cup at home where the conditions will be very different. The Finch-led side go into the ICC event as defending champions. “Every decision that we make, I think, has one eye towards the World Cup and seeing the wicket yesterday, it looked like there was quite a bit of grass on it,” Finch said. “And we know in Mohali, the ball can swing around and it can carry through quite a bit, so I think we will be mindful of not being too narrow-minded in terms of our focus. “What we’ve tried to do over the last sort of six-eight-ten months is make sure that everything that we’re doing in the T20 space ties back into the World Cup and, for us, it’s about making sure that once we get there that we’ve had plenty of different combinations of teams that we can play.” Australia have rested a lot of senior players including David Warner, Marcus Stoinis and Mitchell March for the India series. T20 globetrotter Tim David, who has played international cricket for Singapore, is set to make his Australia debut. He is being seen as the x factor in the squad. Finch confirmed that Steve Smith will bat at number three on Tuesday. PTI Will take very brave man to write Kohli off: Aaron Finch added by Press Trust of India on 1:24 am September 20, 2022 View all posts by Press Trust of India → Press Trust of India Facebook Twitter WhatsApp Email Print Related","pubDate":"2022-09-19 19:54:41","image_url":null,"source_id":"kashmirreader","country":["india"],"category":["sports"],"language":"english"},{"title":"England and Pakistan to use T20I series to gauge World Cup readiness","link":"https://kashmirreader.com/2022/09/20/england-and-pakistan-to-use-t20i-series-to-gauge-world-cup-readiness/","keywords":["SPORTS"],"creator":["KR Desk"],"video_url":null,"description":"KARACHI: England will kick off their first tour of Pakistan in 17 years on Tuesday with the first of a seven-match Twenty20 series which assumes even more importance for both sides ahead of the World Cup in Australia next month. England were initially scheduled to tour Pakistan last year but it did not materialise because […]","content":"KARACHI: England will kick off their first tour of Pakistan in 17 years on Tuesday with the first of a seven-match Twenty20 series which assumes even more importance for both sides ahead of the World Cup in Australia next month. England were initially scheduled to tour Pakistan last year but it did not materialise because of security concerns. Jos Buttler’s men were only given the green light to tour this year after a security team evaluated the situation on the ground. England will play four matches in Karachi and three in Lahore before returning in December to play three tests in the second leg of the tour. With Buttler set to miss the Karachi leg as he recovers from a knee injury, the side will be led by Moeen Ali, whose grandfather came to England from Pakistan after the second World War. “It is going to be memorable playing in front of the Pakistani crowds and also an immense honour to deputize for Jos Buttler, while he recovers from injury, and captain England,” Moeen wrote in his column for the Daily Mail. “Of course, this tour is important for cricket and it is also crucial for us as a side. “Seven T20s will be a stern test in these conditions and a good pointer for where we are, ahead of the World Cup in Australia next month,” added the all-rounder. England last toured Pakistan in 2005 but at least 10 members of the current squad have some experience of local conditions courtesy of their Pakistan Super League (PSL) stints. One of them, Alex Hales, will be particularly keen to impress after his three-year absence from international cricket due to an off-field issue. Pakistan, meanwhile, will look to shrug off the disappointment of losing to Sri Lanka in the Asia Cup final earlier this month. Skipper Babar Azam’s slump in form, and their overall batting approach in 20-overs cricket, have been major talking points and Pakistan will look to iron out the kinks during the course of the series. England begin their Twenty20 World Cup campaign against Afghanistan in Perth on Oct. 22, a day before Pakistan’s opener against arch-rivals India in Melbourne. England and Pakistan to use T20I series to gauge World Cup readiness added by KR Desk on 1:24 am September 20, 2022 View all posts by KR Desk → KR Desk Facebook Twitter WhatsApp Email Print Related","pubDate":"2022-09-19 19:54:23","image_url":null,"source_id":"kashmirreader","country":["india"],"category":["sports"],"language":"english"},{"title":"Legends League Cricket 2022 Points Table: Updated standings after Gujarat Giants vs Manipal Tigers Match 3","link":"https://www.sportskeeda.com/cricket-news/news-legends-league-cricket-2022-points-table-updated-standings-gujarat-giants-vs-manipal-tigers-match-3?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Cricket News"],"creator":["Sportz Connect"],"video_url":null,"description":null,"content":"Gujarat Giants locked horns against the Manipal Tigers in the third match of the Legends League Cricket 2022 on Monday, September 19. Bharat Ratna Shri Atal Bihari Vajpayee Ekana Cricket Stadium in Lucknow hosted this encounter. Bowling first, the Giants did a fine job of restricting the Tigers to 120 at the end of their 20 overs. Ravikant Shukla was the top-scorer for the Tigers with 32. Ashok Dinda and Tillakaratne Dilshan picked up two wickets each for the Giants. The Giants, while chasing, kept losing wickets at regular intervals but managed to hold their nerves to win the game by two wickets in the 18th over. The Tigers tried hard but failed to defend the total. With this win, the Giants have grabbed their second win of the Legends League Cricket 2022. They have now taken their tally to four points and sit comfortably at the top of the table. The Manipal Tigers lost their opening fixture and failed to bounce back as they suffered another loss. They sit in third position in the points table and need to bring out their A-game to register their first win of the competition. The Bhilwara Kings won their first game of the tournament and as a result are placed second in the points table. They have two points to their name and will look to move to the top the next time they take the field. India Capitals are reeling at the bottom of the table after losing their opening game of the competition. The fourth game of the Legends League Cricket 2022 will see India Capitals take on the Bhilwara Kings on Wednesday, September 21. This will be the last fixture at Bharat Ratna Shri Atal Bihari Vajpayee Ekana Cricket Stadium in Lucknow before the action shifts to Delhi. India Capitals will be eyeing their first win of the competition, whereas the Bhilwara Kings will be looking to carry forward their winning momentum. We can expect another cracking contest on Wednesday. Q. 0 votes so far","pubDate":"2022-09-19 19:24:50","image_url":"https://static.sportskeeda.com/editor/2022/09/88917-16636119464695-1920.jpg","source_id":"sportskeeda","country":["india"],"category":["sports"],"language":"english"},{"title":"SA20 League 2023 Player Auction Highlights: Tristan Stubbs, Rilee Roussow and Marco Jansen stars of auction - Zee News","link":"https://news.google.com/__i/rss/rd/articles/CBMipAFodHRwczovL3plZW5ld3MuaW5kaWEuY29tL2NyaWNrZXQvbGl2ZS11cGRhdGVzL3NhMjAtbGVhZ3VlLTIwMjMtcGxheWVyLWF1Y3Rpb24taGlnaGxpZ2h0cy10cmlzdGFuLXN0dWJicy1yaWxlZS1yb3Vzc293LWFuZC1tYXJjby1qYW5zZW4tc3RhcnMtb2YtYXVjdGlvbi0yNTExOTEwL2FtcNIBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"SA20 League 2023 Player Auction Highlights: Tristan Stubbs, Rilee Roussow and Marco Jansen stars of auction  Zee NewsSA20 Auction: Tristan Stubbs bags the highest bid in maiden auction | Cricbuzz.com - Cricbuzz  CricbuzzSA20 auction full Squads highlights list of sold unsold players SA20 auction latest player updates squads list  SportstarGraeme Smith believes SA20 will strengthen SA cricket as IPL did for India  News24SA20 auction: Tristan Stubbs the biggest buy, Donavon Ferreira also creates stir  ESPNcricinfoView Full coverage on Google News","content":null,"pubDate":"2022-09-19 18:34:14","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Pakistan cricket team's new jersey for ICC T20 World Cup launched - Check Photos","link":"https://zeenews.india.com/cricket/pakistan-cricket-teams-new-jersey-for-icc-t20-world-cup-launched-check-photos-2512092.html","keywords":null,"creator":null,"video_url":null,"description":"Afridi was ruled out of the Asia Cup after being advised a 4-6 weeks rest by the medical team following an injury to the right knee ligament. He had copped an injury while fielding during the first Test against Sri Lanka in Galle in July.","content":"Pakistan Team's jersey for the upcoming ICC T20 World Cup 2022 was unveiled on Monday. The Pakistan Cricket Board took to Instagram to reveal the jersey in a video and captioned it: \"The Big Reveal! Presenting the official Pakistan T20I Thunder Jersey'22.\" The front of the jersey has two shades of green -light and dark- while the sleeves feature dark forest green colour. The Babar Azam-led Pakistan will take on India in their tournament opener on October 23. Pakistan Cricket Board on Thursday announced a 15-member squad for the ICC Men's T20 World Cup 2022 in Australia which set the return of star pacer Shaheen Shah Afridi to the team. ___ ___ ______! Presenting the official Pakistan T20I Thunder Jersey'22 _ Order the official __ shirt now at https://t.co/A91XbZsSbJ #GreenThunder pic.twitter.com/BX5bdspqt1 — Pakistan Cricket (@TheRealPCB) September 19, 2022 Afridi was ruled out of the Asia Cup after being advised a 4-6 weeks rest by the medical team following an injury to the right knee ligament. He had copped an injury while fielding during the first Test against Sri Lanka in Galle in July. Fakhar Zaman, Mohammad Haris and Shahnawaz Dahani have been named as the three travelling reserves. The same team, sans Shaheen Afridi and Fakhar Zaman, will play in the seven-match T20I series against England. Before the World Cup Pakistan will lock horns with England for a seven-match T20Is series at home. The National Stadium will host matches on September 20, 22, 23 and 25, before action will move to Lahore, where the remaining three T20Is will be played on September 28 and 30, and October 2 at the Gaddafi Stadium. T20 World Cup squad: Babar Azam (c), Shadab Khan (vc), Asif Ali, Haider Ali, Haris Rauf, Iftikhar Ahmed, Khushdil Shah, Mohammad Hasnain, Mohammad Nawaz, Mohammad Rizwan, Mohammad Wasim, Naseem Shah, Shaheen Shah Afridi, Shan Masood and Usman Qadir. Reserves: Fakhar Zaman, Mohammad Haris and Shahnawaz Dahani.","pubDate":"2022-09-19 18:18:00","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"IND vs AUS 1st T20I: Virat Kohli sweats for an hour with ball in Mohali, can he fill the void of extra pacer?","link":"https://www.indiatvnews.com/sports/cricket/ind-vs-aus-1st-t20i-virat-kohli-sweats-for-an-hour-with-ball-in-mohali-can-he-fill-the-void-of-extra-pacer-ind-vs-aus-virat-kohli-bowling-2022-09-19-809706","keywords":null,"creator":null,"video_url":null,"description":"The Indian cricket team could have a major boost in the bowling department and it's not the return of any marquee pacer but it is Virat Kohli that could solve the problem. The former India captain was seen sweating at the Punjab Cricket Association (PCA) stadium for one hour with the ball as team India prepare for the three-match T20I series against Australia.","content":"The Indian cricket team could have a major boost in the bowling department and it's not the return of any marquee pacer but it is that could solve the problem. The former India captain was seen sweating at the Punjab Cricket Association (PCA) stadium for one hour with the ball as team India prepare for the three-match T20I series against Australia. The former Indian captain took to the nets on Monday as 's men prepare for the huge clash on Tuesday. The Indian team is already without for the series after he contracted Covid-19 on Sunday. As a result, he was ruled out of the series and although has been named as a replacement for him, Virat still had a lot to offer than with the bat. In pictures posted by the PCA's Twitter handle Virat along with Ravichandran Ashwin was seen sweating under the lights. The Indian team could need the services of the 33-year-old if the Indian fall short of balling options. Virat is a part-time bowler and has the needed variety to trouble the batters. The Indian batter's batting stat is well-known to the world, but his bowling is something that could be a surprise package. While he has 71 international tons to his name, he also has eight wickets at the highest level. Virat has scalped four wickets each in the T20I and ODI format with a best of 13/1. While bowling is Plan B, batting will be Virat's top priority as he currently needs 62 more runs to go level with Rahul Dravid for most international runs. He is currently India's third-highest scorer on the international stage with 24002 runs. Overall he ranks seventh for most runs on the international stage. Virat needs one more hundred to go past Ricky Ponting to be the outright second highest scorer of most centuries on the international stage, as both are locked on 71 hundreds. India play Australia in the first T20I on Tuesday evening as the Men in Blue get set for the T20 World Cup in less than a month's time.","pubDate":"2022-09-19 17:57:00","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"Can Virat Kohli break Sachin Tendulkar's record of 100 centuries? Ricky Ponting says THIS - Check Here","link":"https://zeenews.india.com/cricket/can-virat-kohli-break-sachin-tendulkars-record-of-100-centuries-ricky-ponting-says-this-check-here-2512067.html","keywords":null,"creator":null,"video_url":null,"description":"Ahead of the Asia Cup, Kohli had taken a month-long break from cricket, making sure not to touch the bat during that period.","content":"It took Virat Kohli 1,020 days to move from 70 to 71st international century -- when he smashed a stunning 122 not out off 61 balls against Afghanistan in the recent Asia Cup. In doing so, the former India captain equalled Australia skipper Ricky Ponting's record of 71 international tons, moving to joint second behind Sachin Tendulkar (100) in the list of players with most hundreds. The inordinately long dry spell and advancing age make Ponting think Kohli may not able to surpass Tendulkar's record of 100 centuries, now that he has ended the run drought with his latest century. In the latest episode of The ICC Review, Ponting said he will \"never say never\" when it comes to Kohli, he would have been more sure if the question was asked three years ago. Historic 52 ball 100 for Virat Kohli against Australia pic.twitter.com/R9qtUhbELc — Ratnadeep (@_ratna_deep) September 19, 2022 \"If you would have asked me three years ago, I'd have said yes,\" said Ponting when asked if he could reach Tendulkar's tally. But the fact that it has slowed down as much as it did yeah, I still think that it is possible for him, there's no doubt. \"I still think he has got a number of years ahead of him, but I guess to still be 30 international hundreds behind, that's a lot. That's five or six Test hundreds a year maybe for the next three or four years. If you throw a couple of one-day ones, maybe the odd T20 ones on top of it,\" Ponting said in response to a question by Sanjana Ganesh in the cricket podcast. \"Look, I'll never say never with Virat, because you know once he gets on a bit of a roll, you know how hungry he is and how keen for success he is. I'll never say never that's for sure,\" he said. Team India was 48-5 but the way he was batting it looked liked he was playing on different pitch Delightful to watch @sachin_rt #SachinTendulkar #CricketTwitter pic.twitter.com/HyNaNYIoxw — ____ ______ (@Loyalsachfan01) September 19, 2022 Ahead of the Asia Cup, Kohli had taken a month-long break from cricket, making sure not to touch the bat during that period. The break clearly helped as a fresh and rejuvenated Kohli finished the Asia Cup as the second-highest run-scorer with 276 runs in five matches at a strike rate of 147.59, which included two fifties and a hundred. \"It's (the century) taken a bit longer, the last couple of years because he has been in that century-making drought if you like, it has taken a bit longer to get to me than I thought it was going to. \"But look, he is obviously one of the all-time greats and there's still a long time to go in his career. It was good to see him back in the runs.\" Kohli's 71st century and recent success in Asia Cup have put the Indian team management in a dilemma. While Kohli has played the majority of his T20I career at No.3 and excelled at it, the century poses the question if India should consider opening with him in the fast-approaching ICC Men's T20 World Cup 2022. In the nine matches where Kohli has opened for India in T20Is, he has scored 400 runs at an average of 57.14 and that, too, at a whopping strike rate of 161.29, said a report on the ICC website. \"The question we're going to keep asking is - well I'm sure, the Indian selectors are asking the same question - does that create more of a problem than we thought with Virat getting that 100 openings the batting? What are we going to do now going into the World Cup? \"So there are a few other questions that are probably raised on the back of that magnificent 100 that he made. He was even on record saying that he was surprised himself that the first 100 back was actually in a (T20I) game. He thought that that'd be the last option he'd have to score his first hundred in a couple of years,\" said Ponting. With India set to play two white-ball series -- three T20Is against Australia and take on South Africa in three ODIs and T20Is -- before the T20 World Cup, Kohli will get ample opportunities to add to the 71st century by the year-end. This will not only take him closer to Tendulkar's record but also prove that the latest hundred was not a flash in the pan and the former India captain has really regained his form.","pubDate":"2022-09-19 17:46:00","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"Shane Warne children slam 'beyond disrespectful' TV drama","link":"https://www.iol.co.za/sport/cricket/international/shane-warne-children-slam-beyond-disrespectful-tv-drama-a7059227-a4e0-46ae-b0dd-887ac05b5f4a","keywords":null,"creator":["AFP"],"video_url":null,"description":"A television mini-series dramatising the life of the late Shane Warne was described as ‘beyond disrespectful’ by the Australian cricket legend's children.","content":null,"pubDate":"2022-09-19 17:32:29","image_url":"https://image-prod.iol.co.za/16x9/800?source=https://xlibris.public.prod.oc.inl.infomaker.io:8443/opencontent/objects/8dec2afa-bc3a-52ef-a40c-9b9484c4aa61&operation=CROP&offset=0x82&resize=1089x612","source_id":"iol","country":["south africa"],"category":["sports"],"language":"english"},{"title":"Gujarat Giants vs Manipal Tigers, Legends League Cricket LIVE: Thisara Perera Keeps Gujarat Giants Ahead In 121-Run Chase vs Manipal Tigers - NDTV Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMicWh0dHBzOi8vc3BvcnRzLm5kdHYuY29tL2NyaWNrZXQvZ3VqYXJhdC1naWFudHMtdnMtbWFuaXBhbC10aWdlcnMtbGVnZW5kcy1sZWFndWUtY3JpY2tldC0yMDIyLWxpdmUtdXBkYXRlcy0zMzU3ODUy0gF3aHR0cHM6Ly9zcG9ydHMubmR0di5jb20vY3JpY2tldC9ndWphcmF0LWdpYW50cy12cy1tYW5pcGFsLXRpZ2Vycy1sZWdlbmRzLWxlYWd1ZS1jcmlja2V0LTIwMjItbGl2ZS11cGRhdGVzLTMzNTc4NTIvYW1wLzE?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Gujarat Giants vs Manipal Tigers, Legends League Cricket LIVE: Thisara Perera Keeps Gujarat Giants Ahead In 121-Run Chase vs Manipal Tigers  NDTV SportsGujarat Giants vs Manipal Tigers Live Streaming Details- When And Where To Watch Legends League Cricket 2022 Match 3 Match Live In India?  Cricket AddictorKaizzen bags communication & digital marketing mandate for LNJ Bhilwara Kings  Exchange4MediaBhilwara Kings vs Manipal Tigers, Legends League Cricket Highlights: Bhilwara Kings Beat Manipal Tigers By 3 Wickets In Thriller  NDTV SportsMNT vs BHK Highlights: Yusuf & Tino Best power Bhilwara Kings to 3-wicket win over Manipal Tigers: Watch Highlights  InsideSportView Full coverage on Google News","content":null,"pubDate":"2022-09-19 17:01:20","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Moeen Ali proud to lead England in Pakistan as T20 World Cup looms","link":"https://www.theguardian.com/sport/2022/sep/19/moeen-ali-england-cricket-pakistan-t20-world-cup","keywords":["Pakistan v England 2022","England cricket team","Pakistan cricket team","Sport","Cricket"],"creator":["Andy Bull in Karachi"],"video_url":null,"description":"The all-rounder will captain the side in his mother’s birthplace and says England must move on from the Eoin Morgan eraMoeen Ali has been waiting for this tour. He has been dreaming about it ever since he felt he had earned his place in the England team. But he never imagined he would be captain when it finally happened. “It’s a great honour regardless of who it’s against,” Moeen says, “but to do it in Pakistan when the team are coming back here, that’s amazing for me personally, especially when I have family who migrated from here back in the day.” His grandfather moved to England from Kashmir after the second world war, and his mother was born here. He spent time playing here as a child, and again, more recently, in the Pakistan Super League.“I’m somebody that wants to play cricket in every nation,” Moeen says, “and Pakistan especially, after so long.” It’s been 17 years since England were last here. His decision to play in the PSL in 2020 was, he says, because he wanted to help play his part in “putting Pakistan cricket back on the map”. He sees this tour as an extension of that. “I wanted to be part of this. It’s a big thing when England come to Pakistan, more than any other country, England’s the one that the Pakistan fans really love to see coming here.” Continue reading...","content":"M oeen Ali has been waiting for this tour. He has been dreaming about it since he felt he had earned his place in the England team. But he never imagined he would be captain when it finally happened. “It’s a great honour regardless of who it’s against,” Moeen says, “but to do it in Pakistan when the team are coming back here, that’s amazing for me personally, especially when I have family who migrated from here back in the day.” His grandfather moved to England from Kashmir after the second world war and his mother was born here. He spent time playing here as a child and again, more recently, in the Pakistan Super League. Jos Buttler and England aware of debt to Pakistan on first tour since 2005 Read more “I’m somebody that wants to play cricket in every nation,” Moeen says, “and Pakistan especially, after so long.” It has been 17 years since England were last here. His decision to play in the PSL in 2020 was, he says, because he wanted to help play his part in “putting Pakistan cricket back on the map”. He sees this tour as an extension of that. “I wanted to be part of this. It’s a big thing when England come to Pakistan, more than any other country, England’s the one that the Pakistan fans really love to see coming here.” His phone has not stopped ringing since he arrived. He has an uncle who lives here and plenty of friends too. “I’ve had so many messages”– most of them asking if he can help dig up tickets – “that it’s a bit of a killer for me.” But he is happy to have the distraction. He is obviously frustrated with the tight security for the tour and the way he and the team are sealed off from the city in Karachi. He brought his wife and children out when he was playing in the PSL and they spent time visiting friends and going to cafes. In between training this week he has been stuck in the team room, reading, chatting, playing cards. He says the restrictions are going to shape his decision about whether or not to make himself available for the Test matches here in December. He had seemed enthusiastic when Brendon McCullum floated the idea of picking him earlier in the summer but he seems to have pulled back from that. “I’m not sure yet,” he says. “I want to see how this goes. I don’t like being stuck in a hotel for so long so I’m going to see how I cope with this as well.” Moeen and England players take a breather from training at the National Stadium in Karachi. Photograph: Alex Davidson/Getty Images It was frustrating for him that England pulled out of their planned tour here last year but he is phlegmatic about it now. “Obviously there was still a little bit of Covid then, so you don’t know what the restrictions might have been. At least now everybody can come. I’m a big believer that when things aren’t easy, if you have a bit of patience, then they become easy.” That idea seems to be on his mind. It comes up again when he is talking about the state of the team before the T20 World Cup next month. “It’s not my style to be desperate for something,” Moeen says. “It is important we don’t put pressure on ourselves and say: ‘We are going to win a World Cup.’ We have been such a good side over the last two or three years but we have missed out too, which is about weight of expectation. I think we need to focus on one game. Let’s play our best cricket and not worry about the end result. That will take care of itself. The World Cup in 2019 was different. We were the favourites, but I don’t think we are favourites now. I think we are one of the better sides, not favourites.” Quick Guide Possible teams for first T20 Show England: Alex Hales, Will Jacks, Dawid Malan, Harry Brook, Phil Salt (wk), Moeen Ali (capt), Sam Curran, David Willey, Adil Rashid, Richard Gleeson, Olly Stone Pakistan: Babar Azam (capt), Shan Masood, Mohammad Haris (wk), Iftikhar Ahmed, Mohammad Nawaz, Khushdil Shah, Asif Ali, Shadab Khan, Haris Rauf, Naseem Shah, Mohammad Hasnain Was this helpful? Thank you for your feedback. England have brought an odd squad here. It has been picked with one eye on the World Cup and the other on bringing new players through for the years after. It includes four players – Jos Buttler, Chris Woakes, Mark Wood, and Reece Topley – who will miss the opening game on Tuesday because they are working their way back to fitness in time for the World Cup, and six more – Will Jacks, Tom Helm, Jordan Cox, Luke Wood, Ben Duckett and Olly Stone – who were not picked for the tournament. All that uncertainty means Moeen has taken on a different role. This is Buttler’s team but it is clear, listening to Moeen here, that he is leading, too, and not just at the toss. Sign up to The Spin Free weekly newsletter Subscribe to our cricket newsletter for our writers' thoughts on the biggest stories and a review of the week’s action Privacy Notice: Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. He has some strong ideas about what went wrong this summer, when the team lost series against South Africa and India . “This summer was quite poor for us. We didn’t play very well at all.” He says they spent too much time talking about the way they used to do things when Eoin Morgan was captain. “‘We used to do this’, ‘We used to do that’ or ‘The reason why we were so good was this’. We have to move on from that now. It is not easy for Jos coming in and taking over from Eoin but it is Jos’s side now. I think this is going to be the starting point. You are going to see a real change in the way the side goes about things.” They will still want to be “brave and be aggressive, like we always have been” but “there also needs to be more of a method to it”, he says. “This summer we were going out and trying to be really aggressive and we were being bowled out.” It’s hardest for the more inexperienced players. “They’ve seen the way we’ve played over the last four or five years and they think they need to come in and go bang, bang, bang with the bat. But actually it doesn’t need to be that. We need to get that balance right.” Pakistan are in a similar position, with Shaheen Shah Afridi and Fakhar Zaman out injured and three debutants in this format in their squad, including Shan Masood, who made so many runs for Derbyshire this summer. “Both teams are probably on the same level at the moment. We’ve got players missing, they’ve got a couple missing, they’re also having a bit of a transition even though they’re playing well, I’m expecting a really hard series, a tight series.” And an exciting series. It is the nature of T20 that games come and go but he, at least, will surely remember these seven long after they are over.","pubDate":"2022-09-19 17:00:03","image_url":"https://i.guim.co.uk/img/media/797e354d47b81fec4be3ca0fc2185b4fab48b0fd/351_409_4779_2868/master/4779.jpg?width=460&quality=85&auto=format&fit=max&s=99ba6a1875d6952e7d939a76edbb7f8b","source_id":"theguardian","country":["united kingdom","india","singapore","canada"],"category":["sports"],"language":"english"},{"title":"Sri Lanka Part Ways With Tom Moody Ahead Of T20 World Cup 2022","link":"https://sports.ndtv.com/cricket/sri-lanka-part-ways-with-tom-moody-ahead-of-t20-world-cup-2022-3359107","keywords":null,"creator":null,"video_url":null,"description":"Former Sri Lanka head coach Moody was appointed director of cricket in February last year to help prepare the team for the T20 World Cup and the 50-over version in India in 2023.","content":null,"pubDate":"2022-09-19 16:38:33","image_url":"https://c.ndtvimg.com/2021-02/4eueb0mg_tom-moody-sri-lanka-twitter_625x300_28_February_21.jpg?im=FaceCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Bangladesh Pacer Rubel Hossain Retires From Test Cricket","link":"https://sports.ndtv.com/cricket/bangladesh-pacer-rubel-hossain-retires-from-test-cricket-3359001","keywords":null,"creator":null,"video_url":null,"description":"Hossain made his Test format debut in 2009 and represented Bangladesh in 27 Tests over the span of 13 years","content":null,"pubDate":"2022-09-19 16:03:32","image_url":"https://i.ndtvimg.com/i/2017-09/rubel-hossain-afp_436x327_61505811808.jpg?im=FaceCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"LLC 2022 - Want To Entertain Fans Once Again With My Batting: Sehwag","link":"https://sports.ndtv.com/cricket/legends-league-cricket-2022-want-to-entertain-fans-once-again-with-my-batting-virender-sehwag-3358991","keywords":null,"creator":null,"video_url":null,"description":"Following a dazzling start, Virender Sehwag-led Gujarat Giants lookto build on the winning momentum in the Legends League Cricket 2022.","content":null,"pubDate":"2022-09-19 16:00:12","image_url":"https://c.ndtvimg.com/2020-07/e69s8msg_virender-sehwag-instagram_625x300_31_July_20.jpg?im=FeatureCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Match Preview - India vs Australia, Australia in India 2022, 1st T20I - ESPNcricinfo","link":"https://news.google.com/__i/rss/rd/articles/CBMidWh0dHBzOi8vd3d3LmVzcG5jcmljaW5mby5jb20vc2VyaWVzL2F1c3RyYWxpYS1pbi1pbmRpYS0yMDIyLTEzMjc0OTcvaW5kaWEtdnMtYXVzdHJhbGlhLTFzdC10MjBpLTEzMjc1MDMvbWF0Y2gtcHJldmlld9IBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Match Preview - India vs Australia, Australia in India 2022, 1st T20I  ESPNcricinfo'I'm working on it' - Rahul on strike-rate | Cricbuzz.com - Cricbuzz  CricbuzzAustralia Tour of India 2022: IND vs AUS Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update  Cricket AddictorAussies hit the track in Mohali ahead of India T20 series | India v Australia 2022  cricket.com.auSmith to bat at No. 3 in India T20Is in Mitch Marsh's absence  ESPNcricinfoView Full coverage on Google News","content":null,"pubDate":"2022-09-19 15:48:00","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"IND v AUS: Virat Kohli is 'one of the greatest players of all-time,' says Aaron Finch ahead of 1st T20I","link":"https://www.thehansindia.com/sports/cricket/ind-v-aus-virat-kohli-is-one-of-the-greatest-players-of-all-time-says-aaron-finch-ahead-of-1st-t20i-762332","keywords":["Sports,Cricket"],"creator":["Ishka"],"video_url":null,"description":"Virat Kohli recently recorded his maiden T20I centuryIndia and Australia are set to play a three-match seriesThe first T20I is on Tuesday in Mohali","content":"Virat Kohli recently recorded his maiden T20I century Australia skipper Aaron Finch has hailed Virat Kohli , calling the Indian batsman \"one of the greatest players of all time.\" Finch's comments came in a pre-match conference on Monday ahead of the first T20I between India and Australia in Mohali. After failing to score an international century for nearly three years, Kohli ended the drought in the recently concluded Asia Cup. He scored an unbeaten 122 against Afghanistan, which was also his maiden T20I hundred. Finch also said that it would take a very brave man to write Kohli off on any given day considering what the Indian star has achieved in the last 15 years. ''It would be a very brave man to write Virat Kohli off. At any stage, he has shown for 15 years now that he is one of the greatest players of all time,'' Finch told reporters ahead of the first T20I against India. ''Particularly in T20 cricket, he's someone who has developed and grown his game over such a long period that you always plan and prepare the best when you're coming up against him. He is super and has 71 international centuries. That's just ridiculous,'' added Finch in the same conference. Finch, who has been struggling with the bat for some time now, recently announced retirement from ODIs. Australia's three-match ODI series against New Zealand at home was Finch's final in the 50-over format for Australia. While the hosts clinched the series 3-0, Finch managed just 10 runs, including a duck in the second game. \"Over a long period of time, you get pretty comfortable with criticism, but in T20 cricket, I feel my form has been really good for quite a while now. I think if you separate the ODI form and the T20 form, then they're totally different, they're two different formats of the game. 'Every decision that we make, I think, has one eye towards the World Cup and seeing the wicket yesterday, it looked like there was quite a bit of grass on it. ''And we know in Mohali, the ball can swing around and it can carry through quite a bit, so I think we will be mindful of not being too narrow-minded in terms of our focus. 'What we've tried to do over the last sort of six-eight-ten months is make sure that everything that we're doing in the T20 space ties back into the World Cup and, for us, it's about making sure that once we get there that we've had plenty of different combinations of teams that we can play,'' added Finch. In the lead-up to the T20 World Cup, which is scheduled to begin on Oct. 16 in Australia, Finch and Co have toured India for a three-match T20I series. The matches will be played in Mohali (Sept. 20), Nagpur (Sept. 23), and Hyderabad (Sept. 25).","pubDate":"2022-09-19 15:34:57","image_url":"https://assets.thehansindia.com/h-upload/2022/09/19/500x300_1312976-virat-kohli.jpg","source_id":"thehansindia","country":["india"],"category":["sports"],"language":"english"},{"title":"India vs Australia: Want to improve as an opening batsman, says KL Rahul","link":"https://www.thehansindia.com/sports/cricket/india-vs-australia-want-to-improve-as-an-opening-batsman-says-kl-rahul-762331","keywords":["Sports,Cricket"],"creator":["Ishka"],"video_url":null,"description":"KL Rahul has a strike rate of 122.22 in 61 T20Is for IndiaHe managed just 132 runs in 5 games in the Asia CupIndia are set to host Australia in a three-match T20I series","content":"KL Rahul has a strike rate of 122.22 in 61 T20Is for India KL Rahul has said he is working to improve as an opening batsman and make more impact on the team ahead of the T20 World Cup 2022. The ICC T20 World Cup this year is going to take place in Australia and will begin on Oct. 16. The final will be played on Nov. 13. Rahul received criticism following his poor run in the Asia Cup, where India failed to make it to the semi-final. He managed to score just 132 runs in five innings and was majorly slammed for his lower strike rate of around 122.22. Notably, Rahul has an average strike rate of 140.91 in the 61 T20Is for India. \"Look, obviously something that every player wants to work on. No one is perfect, everybody is working towards something, and obviously strike rates are taken on an overall basis. You never see when a batter has played at a certain strike rate, whether it was important to play for him to play at a 200 strike rate or whether the team could still have won with him playing at 120-130. These are the things that no one analyses,\" Rahul told reporters on the eve of the series opener against Australia. In the lead-up to the T20 World Cup, India are set to host Australia and South Africa in the white-ball series. The first T20I between India and Australia is scheduled to be played on Tuesday (Sept. 20) at Punjab Cricket Association IS Bindra Stadium in Mohali. The two sides will play a three-match T20I series. \"Yes, it is something that I am working at, the roles that have been defined for each player in the last 10-12 months have been very clear, and everyone is working towards it. And, I am just working towards how I can better myself as an opening batter and how I can have an impact on my team whenever I go out to bat,\" Rahul added in the same conference. Rahul, who recently returned after recovering from surgery and covid-19, also pointed out that head coach Rahul Dravid and skipper Rohit Sharma have created a safe environment where players are not scared to commit mistakes or fail. \"There can be criticism about many things. But the most important thing for a player is what his captain, coach, and teammates think of him in the dressing room. Only we know what role is expected of each player. Everyone is trying to give their best, but not everyone can succeed in each game. It is the kind of environment we have created where players are not scared to commit mistakes or fail,\" added Rahul. Rahul has so far played six T20Is in Australia, the location of the upcoming T20 World Cup. His numbers aren't very convincing as he has scored 108 runs at a poor strike rate of 112.50 and an average of 21.60.","pubDate":"2022-09-19 15:30:18","image_url":"https://assets.thehansindia.com/h-upload/2022/09/19/500x300_1312975-kl-rahul.jpg","source_id":"thehansindia","country":["india"],"category":["sports"],"language":"english"},{"title":"Sri Lanka to relieve director of cricket Tom Moody ahead of T20 World Cup 2022","link":"https://www.indiatoday.in/sports/cricket/story/sri-lanka-to-relieve-director-of-cricket-tom-moody-ahead-of-t20-world-cup-2022-2002132-2022-09-19?utm_source=rss","keywords":null,"creator":null,"video_url":null,"description":"Sri Lanka to relieve director of cricket Tom Moody ahead of T20 World Cup","content":null,"pubDate":"2022-09-19 15:00:01","image_url":null,"source_id":"indiatoday","country":["india"],"category":["sports"],"language":"english"},{"title":"National Stadium Karachi pitch report today match: Pakistan vs England 1st T20 pitch report Karachi","link":"https://thesportsrush.com/cricket-news-national-stadium-karachi-pitch-report-today-match-pakistan-vs-england-1st-t20-pitch-report-karachi/","keywords":["Cricket","England tour of Pakistan 2022"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"National Stadium Karachi pitch report today match: The SportsRush brings you the pitch report of Pakistan vs England 1st T20. Karachi’s National Stadium is set to host the 1st T20I of the 7-match T20I series between England and Pakistan on Tuesday. The first 4 T20Is will be played in Karachi, and the last three will… The post National Stadium Karachi pitch report today match: Pakistan vs England 1st T20 pitch report Karachi appeared first on The SportsRush.","content":"National Stadium Karachi pitch report today match: The SportsRush brings you the pitch report of Pakistan vs England 1st T20. Karachi’s National Stadium is set to host the 1st T20I of the 7-match T20I series between England and Pakistan on Tuesday. The first 4 T20Is will be played in Karachi, and the last three will be played in Lahore. England will be led by Jos Buttler in this series, and they have some incredible hitters in their ranks. Jason Roy has been dropped from the team, whereas Alex Hales has made his comeback to the team. Pakistan would want to take advantage of their home conditions in this series. National Stadium Karachi pitch report today match Karachi’s national stadium is a batters’ paradise, and both sets of batters will enjoy their time batting on this very track. This stadium last hosted a T20I match in December 2021, and a fresh pitch is expected for the 1st T20I between England and Pakistan. This is a flat track, where there is absolutely no help for any kind of bowlers. The batters can play their shots easily as they can trust the bounce of this wicket, and there are absolutely no demons available on this very track. A high-scoring encounter is always anticipated at this very venue. The outfield of this ground is quite fast, and it will be very difficult for the fielders to stop the ball from reaching the boundary ropes. This ground’s boundaries are also not that big, and the batters can easily clear the fences. There are some incredible set of batters in both sides. Our Men’s team have landed in Karachi ahead of our historic IT20 series against Pakistan. pic.twitter.com/TQEnKzaRpl — England Cricket (@englandcricket) September 15, 2022 A total of 5 T20Is have been played at this very ground, where four games have been won by the teams batting first. The average 1st innings T20I score at this venue is 189 runs. In the last 3-match T20I series between Pakistan and West Indies, the average 1st innings score was 193 runs. Both captains would want to chase after winning the toss in this match. The post National Stadium Karachi pitch report today match: Pakistan vs England 1st T20 pitch report Karachi appeared first on The SportsRush.","pubDate":"2022-09-19 13:50:20","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"India vs Australia head to head in T20: IND vs AUS T20 head to head records","link":"https://thesportsrush.com/cricket-news-india-vs-australia-head-to-head-in-t20-ind-vs-aus-t20-head-to-head-records/","keywords":["Cricket","Australia","Australia tour of India 2022","India"],"creator":["Dixit Bhargav"],"video_url":null,"description":"India vs Australia head to head in T20: The SportsRush presents for you the Head to Head statistics for first IND vs AUS T20I. The first T20I of Australia’s tour of India will be played in Mohali tomorrow. The match will kick-start India’s home international season which will also involve them travelling to Australia, New… The post India vs Australia head to head in T20: IND vs AUS T20 head to head records appeared first on The SportsRush.","content":"India vs Australia head to head in T20: The SportsRush presents for you the Head to Head statistics for first IND vs AUS T20I. The first T20I of Australia’s tour of India will be played in Mohali tomorrow. The match will kick-start India’s home international season which will also involve them travelling to Australia, New Zealand and Bangladesh in the subsequent months. The two teams will be resuming their T20I rivalry less than a couple of years after they last faced each other in Sydney. As far as playing in India is concerned, the last India-Australia T20I had been played in Bengaluru over three and a half years ago. Both the teams have been practicing at the Punjab Cricket Association IS Bindra Stadium for a few days now. With neither of them confirming their Playing XI on the eve of the match, the exact combinations will be revealed at the toss tomorrow. ALSO READ: Pitch report of India vs Australia 1st T20I at PCA Stadium, Mohali That being said, fans can expect a few surprising changes especially in the visitors’ lineup. For the unversed, first-choice T20I players namely Mitchell Marsh, David Warner, Mitchell Starc and Marcus Stoinis haven’t traveled to India for this series. India vs Australia head to head in T20 Total number of matches played: 24 Matches won by IND: 13 Matches won by AUS: 9 Matches played at Punjab Cricket Association IS Bindra Stadium: 1 (IND 1, AUS 0) Matches played in India: 7 (IND 4, AUS 3) Matches played in Asia: 9 (IND 5, AUS 4) IND average score against AUS: 156 AUS average score against IND: 154 Most runs for IND: 718 (Virat Kohli) Most runs for AUS: 440 (Aaron Finch) Most wickets for IND: 15 (Jasprit Bumrah) Most wickets for AUS: 4 (Pat Cummins and Glenn Maxwell) Most catches for IND: 9 (Virat Kohli) Most catches for AUS: 5 (Aaron Finch and Glenn Maxwell) Scenes from today afternoon when @imVkohli @BhuviOfficial and @surya_14kumar left for team India’s practice session ahead of #IndvsAus T20I match scheduled for tomorrow.@BCCI @gulzarchahal #1stT20I #pcanews #punjab #cricket #teamindia #indiancricketteam #punjabcricketnews pic.twitter.com/OG7V2H3CCA — Punjab Cricket Association (@pcacricket) September 19, 2022 NOTE: Only players part of current squads have been considered above (most runs, wickets and catches). The post India vs Australia head to head in T20: IND vs AUS T20 head to head records appeared first on The SportsRush.","pubDate":"2022-09-19 13:44:13","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Snake enters ex-Australian cricketer Mitchell Johnson’s hotel room in Lucknow","link":"https://www.tribuneindia.com/news/sports/snake-enters-ex-australian-cricketer-mitchell-johnsons-hotel-room-in-lucknow-433319","keywords":null,"creator":null,"video_url":null,"description":"IANS Lucknow, September 19 Former Australian cricketer Mitchell Johnson has had an interesting encounter at his hotel room here after he spotted a snake near the door of his room here. The former left-arm seamer, who is currently in India to play in the Legends League Cricket, shared the image of the snake on his Instagram handle, saying, \"Anyone knows what type of snake this is?? Just hanging out in my room door.\" Johnson (40), who retired from international cricket in 2015 after claiming 313 Test wickets and 239 ODI scalps from 73 and 153 outings, respectively, is playing for the Jacques Kallis-led India Capitals in the Legends League Cricket, and featured in the game against Gujarat Giants in Kolkata on Saturday. In another post, Johnson wrote: \"Found a better pic of this snake's head. Still unsure what it is exactly. Interesting stay so far in Lucknow, India.\" The Legends League Cricket has brought former star players together under one banner. Johnson, who is representing India Capitals in the tournament, dismissed Gujarat Giants skipper Virender Sehwag on Saturday, but the latter won the match by three wicket with the Aussie quick returning with figures of 1/22 in three overs. India Capitals will next play against Bhilwara Kings here on Wednesday. --IANS","content":null,"pubDate":"2022-09-19 13:39:33","image_url":"https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/9/2022_9$largeimg_361552941.jpeg","source_id":"tribuneindia","country":["india"],"category":["sports"],"language":"english"},{"title":"LLC Live: Unbeaten Gujarat Giants Face Manipal Tigers","link":"https://sports.ndtv.com/cricket/gujarat-giants-vs-manipal-tigers-legends-league-cricket-2022-live-updates-3357852","keywords":null,"creator":null,"video_url":null,"description":"Gujarat Giants vs Manipal Tigers, Legends League Cricket Score: Gujarat Giants won their opening match of the tournament, while Manipal Tigers suffered a loss.","content":"Gujarat Giants vs Manipal Tigers, Legends League Cricket LIVE: Ravikant Shukla and Swapnil Asnodkar have opened the Manipal Tigers' innings. Gujarat Giants skipper Virender Sehwag has won the toss and opted to bowl first against Manipal Tigers. Unbeaten Gujarat Giants take on Manipal Tigers in the third match of ongoing Legends League Cricket. Both the teams met with contrasting results in their opening games. Gujarat had defeated India Capitals by 3 wickets in the tournament opener, while Manipal lost to Bhilwara Kings by an equal margin in their first match of the ongoing LLC season. Monday's match gives Gujarat a chance to consolidate their top spot in the table. Meanwhile, Manipal Tigers will also fancy their chances in the game to improve their position in the points table.","pubDate":"2022-09-19 13:22:39","image_url":"https://c.ndtvimg.com/2022-09/rg4sr3m8_gujarat-giants-twitter_120x90_19_September_22.jpg","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Rahul: 'No one is perfect; strike rate is something I am working at' - ESPNcricinfo","link":"https://news.google.com/__i/rss/rd/articles/CBMihwFodHRwczovL3d3dy5lc3BuY3JpY2luZm8uY29tL3N0b3J5L2luZC12cy1hdXMtMjAyMi0xc3QtdDIwaS1rbC1yYWh1bC1uby1vbmUtaXMtcGVyZmVjdC1zdHJpa2UtcmF0ZS1pcy1zb21ldGhpbmctaS1hbS13b3JraW5nLWF0LTEzMzU1NjLSAZQBaHR0cHM6Ly93d3cuZXNwbmNyaWNpbmZvLmNvbS9zdG9yeS9pbmQtdnMtYXVzLTIwMjItMXN0LXQyMGkta2wtcmFodWwtbm8tb25lLWlzLXBlcmZlY3Qtc3RyaWtlLXJhdGUtaXMtc29tZXRoaW5nLWktYW0td29ya2luZy1hdC0xMzM1NTYyP3BsYXRmb3JtPWFtcA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Rahul: 'No one is perfect; strike rate is something I am working at'  ESPNcricinfoAustralia Tour of India 2022: IND vs AUS Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update  Cricket AddictorAussies hit the track in Mohali ahead of India T20 series | India v Australia 2022  cricket.com.auSmith to bat at No. 3 in India T20Is in Mitch Marsh's absence  ESPNcricinfoIND vs AUS, 1st T20I: When and where to watch men in blue clash against mighty Aussies | DETAILS  India TV NewsView Full coverage on Google News","content":null,"pubDate":"2022-09-19 13:14:37","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Prințul William moștenește ducatul de Cornwall, vechi de 685 de ani, de la regele Charles și devine cel mai mare proprietar de terenuri din Marea Britanie.","link":"https://www.obiectivtulcea.ro/printul-william-mosteneste-ducatul-de-cornwall-vechi-de-685-de-ani-de-la-regele-charles-si-devine-cel-mai-mare-proprietar-de-terenuri-din-marea-britanie/","keywords":["sport"],"creator":["Sidony Cato"],"video_url":null,"description":"Londra, Marea Britanie: Noul Prinț de Wales a devenit cel mai mare proprietar privat de...","content":"Londra, Marea Britanie: Noul Prinț de Wales a devenit cel mai mare proprietar privat de pământ al Marii Britanii de când a moștenit imensul Ducat de Cornwall, de 130.000 de acri, de la tatăl său, noul rege Charles. Cu toate acestea, regele în vârstă de 73 de ani nu are lipsă de locuri de locuit și se spune că are cel puțin nouă palate notabile. Averea netă privată a Prințului William a crescut acum la peste 1,3 miliarde de dolari în 23 de județe, inclusiv ferme, dezvoltări rezidențiale, șapte castele, păduri, linii de coastă, proprietăți comerciale și acum datorită proprietății private de 685 de ani. A primit-o de la tatăl său. Reclame Regele Charles nu este departe de fiul său, deoarece deține o poșetă decentă fie direct de la regina, care include Balmoral și Sandringham, fie ca parte a unei proprietăți a Coroanei, cum ar fi Palatul Buckingham sau Castelul Windsor. Anterior deținuse Birkhall în moșia Balmoral, moștenită de la Regina Mamă; Casa Dumfries și Castelul Mey, repere scoțiane deținute de trustul său caritabil; Și doi Roman Bolthol. Citiți mai departe pentru a afla mai multe despre obiectele de colecție ale Prințului de Wales. Reclame Citeste mai mult Adio lui Gan Gan: Prințul George și Prințesa Charlotte vor merge în spatele sicriului Reginei la înmormântare Ghicitorul care a prezis moartea reginei folosind sparanghel spune că prințul William va fi rege anul viitor Reclame stadion de cricket oval Anglia este renumită pentru inventarea multor sporturi mondiale, cum ar fi hochei, fotbal și cricket. În septembrie 1880, țara a găzduit și primul său meci internațional de cricket de testare pe acest teren de cricket. Terenul de cricket oval a fost inițial un petic de varză și o grădină de piață. De atunci, meciul de testare final al sezonului englez se mai joacă în mod tradițional acolo. Prințul William a preluat acum noul proprietar al prestigiosului teren de cricket istoric. Reclame O vedere generală în timpul celui de-al patrulea meci LV = Test de blocare: Ziua 3 între Anglia și India la Kia Oval pe 4 septembrie 2021 în Londra, Anglia (Mike Hewitt/Getty Images) castele legendare Castelul Tintagel, locul de naștere al Regelui Arthur, se află în capul unei promenade denivelate și datează din secolul al V-lea. Pe lângă Tintagel, Prințul de Wales deține și castelele Launceston și Restormel, precum și 270 de monumente antice, inclusiv Castelul Lydford din secolul al XII-lea din Devon, Castelul Maiden din Dorset și ruinele Castelului Berkhamsted, Hertfordshire. Reclame închisoare clasa C Prințul de Wales deține, de asemenea, infama sau infama închisoare Dartmoor, o închisoare de clasa C în care au petrecut timp prizonieri notorii precum gangsterul londonez Frank „The Mad Axeman” Mitchell și Jack „the Hat” McVitie. În prezent, închisoarea deține 640 de prizonieri. În plus, prințul William deține și 70.000 de acri în Devon. Reclame Criminalul englez Frank Mitchell, sau „The Rotten Madman”, înconjurat de doi foști gardieni ai închisorii, și-a revenit după ce a evadat de la Spitalul Broadmoor, 1958. Tipărit după o evadare mai recentă din Dartmoor pe 15 decembrie 1966 (Keystone/Hulton Archive/Getty Images ) Milioane de păduri Numai Prințul de Wales deține 4.300 de acri de pădure gestionată, inclusiv 2.200 de acri în Cornwall. Lemnul este una dintre componentele primare utilizate pentru realizarea pervazurilor, ramelor ferestrelor și grinzilor pentru proprietățile restaurate. Așchii de lemn sunt colectați pentru a fuma alimente produse local. În Marea Britanie, Greenscombe Wood din Valea Tamar este unul dintre cele patru locuri în care se găsește fluturele rar Heath Fritillary. Reclame Ferma galeza Se presupune, de asemenea, că Prințul William a deținut casa tatălui său din Țara Galilor la Llwynywermod, lângă Brecon Beacons. Regele Charles și Camilla vizitează adesea ferma de 192 de acri și conțin două căsuțe de vacanță. Reclame Highgrove Preluarea ducatului de către Prințul William a însemnat că el era noul proprietar al Highgrove, lângă Tetbury. De asemenea, îi oferă posibilitatea de a încasa chiria unei case de la tatăl său în secolul al XVIII-lea. Se pare că Prințul de Wales a muncit din greu pentru a-și restaura grădina, care a fost un proiect foarte pasionat. El ține albinele acolo și vinde pachete din mierea lor cu 25 de dolari o dată. Reclame Regele Charles, participă la un eveniment de așezare a gardurilor vii la Highgrove Estate pe 4 decembrie 2021, lângă Tetbury, Gloucestershire, Anglia (Peter Nicholls-WPA Pool/Getty Images) Magazinul Waitrose Prințul William deține parcul Trigora din Truro, Cornwall, inclusiv un magazin Waitrose, un centru de reciclare a deșeurilor menajere și o parcare pentru 1.379. Reclame window.pg=window.pg||[];pg.acq=pg.acq||[]; // build consent queue pg.acq.push(function() { /*New GA TAG [START]*/ var script = document.createElement('script'); script.src=\"https://www.googletagmanager.com/gtag/js?id=G-X8G4J73LMY\"; script.setAttribute('async', ''); document.head.appendChild(script); window.dataLayer = window.dataLayer || []; function gtag(){ dataLayer.push(arguments); } gtag('js', new Date()); gtag('config', 'G-X8G4J73LMY'); /*New GA TAG [END]*/ (function (i, s, o, g, r, a, m) { i['GoogleAnalyticsObject'] = r; i[r] = i[r] || function () { (i[r].q = i[r].q || []).push(arguments) }, i[r].l = 1 * new Date(); a = s.createElement(o), m = s.getElementsByTagName(o)[0]; a.async = 1; a.src = g; m.parentNode.insertBefore(a, m) })(window, document, 'script', 'https://www.google-analytics.com/analytics.js', 'ga'); ga('create', 'UA-101800260-1', 'auto', 'articles') ga('create', 'UA-67136960-1', 'auto', 'articles1') ga('create', 'UA-101800260-7', 'auto', 'nonia') window.gaSendEvent = function(eventCat, eventLbl, eventAction) { var fields = {eventCategory: eventCat, eventAction: eventAction ? eventAction : 'click', eventLabel: eventLbl , location: document.location.href , source: document.location.pathname, destination: $(this).attr('href')} ga('articles.send', 'event', fields); ga('articles1.send', 'event', fields); ga('nonia.send', 'event', fields); } window.onload = function () { window.triggerGA; }; !function(f,b,e,v,n,t,s) {if(f.fbq)return;n=f.fbq=function(){n.callMethod? n.callMethod.apply(n,arguments):n.queue.push(arguments)}; if(!f._fbq)f._fbq=n;n.push=n;n.loaded=!0;n.version='2.0'; n.queue=[];t=b.createElement(e);t.async=!0; t.src=v;s=b.getElementsByTagName(e)[0]; s.parentNode.insertBefore(t,s)}(window,document,'script', 'https://connect.facebook.net/en_US/fbevents.js'); fbq('init', '430778077119553'); fbq('track', 'PageView'); }); var generateClientId = function () { return 'xxxxxxxx-xxxx-4xxx-yxxx-xxxxxxxxxxxx'.replace(/[xy]/g, function (c) { var r = Math.random() * 16 | 0, v = c == 'x' ? r : (r & 0x3 | 0x8); return v.toString(16); }); } var getCookie = function (name) { var nameEQ = name + \"=\"; var ca = document.cookie.split(';'); for (var i = 0; i < ca.length; i++) { var c = ca[i]; while (c.charAt(0) == ' ') c = c.substring(1, c.length); if (c.indexOf(nameEQ) == 0) return c.substring(nameEQ.length, c.length); } return null; } var setCookie = function (cname, cvalue, expMin) { var d = new Date(); d.setTime(d.getTime() + (expMin * 60 * 1000)); var expires = \"expires=\" + d.toUTCString(); document.cookie = cname + \"=\" + cvalue + \";\" + expires + \";path=/\"; } window.getClientId = function () { var _user_id = getCookie(\"user_id\"); if (_user_id) { return _user_id; } else { return generateClientId(); } } window.getSessionId = function () { var maxAge = 30 * 60; // add 30 min to the current time var _sessionId = getCookie(\"session_id\"); if (_sessionId) { return _sessionId; } else { return generateClientId(); } } window.user_id = window.getClientId(); window.document.cookie=\"user_id=\" + window.user_id + ';path=/'; Sidony Cato„Creator. Rezolvator de probleme premiat. Evanghelist muzical. Introvertit incurabil”.","pubDate":"2022-09-19 13:10:58","image_url":null,"source_id":"obiectivtulcea","country":["romania"],"category":["sports"],"language":"romanian"},{"title":"IND vs AUS tomorrow match pitch report Mohali: Punjab Cricket Association Stadium pitch report batting or bowling","link":"https://thesportsrush.com/cricket-news-ind-vs-aus-tomorrow-match-pitch-report-mohali-punjab-cricket-association-stadium-pitch-report-batting-or-bowling/","keywords":["Cricket","Australia tour of India 2022","Mohali stadium"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"IND vs AUS tomorrow match pitch report Mohali: The SportsRush brings you the pitch report of IND vs AUS 1st T20I. Mohali’s PCA Stadium is set to host the 1st T20I of the 3-match T20I between India and Australia on Tuesday. This stadium is hosting a T20I match after an interval of over 3 years,… The post IND vs AUS tomorrow match pitch report Mohali: Punjab Cricket Association Stadium pitch report batting or bowling appeared first on The SportsRush.","content":"IND vs AUS tomorrow match pitch report Mohali: The SportsRush brings you the pitch report of IND vs AUS 1st T20I. Mohali’s PCA Stadium is set to host the 1st T20I of the 3-match T20I between India and Australia on Tuesday. This stadium is hosting a T20I match after an interval of over 3 years, so there is a lot of buzz about the same. Both sides would want to finalize their playing combination ahead of the T20 World Cup next month. The defending champions Australia are without some of their key players, and this is a great chance for them to get their options tested. Team India will also welcome the pace duo of Jasprit Bumrah and Harshal Patel in the series. IND vs AUS tomorrow match pitch report Mohali The pitch at the PCA Stadium in Mohali is one of the most liveliest pitches in India where the pacers have enjoyed bowling. However, in the last few years, the nature of the pitch has changed a bit, and this pitch has also supported the batters in the recent past. However, with all being said, this pitch will provide assistance to the pacers. Australian captain Aaron Finch said that the Mohali’s pitch will be offering some movement to the pacers, and the initial overs of the game will be crucial for both sides. Once set, the batters will be able to play their shots properly, and the true nature of the wicket will assist their shot-making. #TeamIndia had their first training session ahead of the #INDvAUS series at the IS Bindra Stadium, Mohali, yesterday. Snapshots from the same pic.twitter.com/h2g0v85ArH — BCCI (@BCCI) September 19, 2022 The outfield of this ground is very fast, and this will please the batters. Once placed in the gap, it will be very tough for the bowlers to stop the ball from reaching the boundary. Although, the bigger boundaries at this stadium will provide a cushion for the bowlers. The spinners can take advantage in the middle-overs. A total of 5 T20Is have been played at this very stadium, where three of the matches have been won by the chasing teams. The average 1st innings T20I score has been 178 runs, whereas the average 1st innings score in T20 Domestic games has been 166 rns. Both captains will prefer to chase here. The post IND vs AUS tomorrow match pitch report Mohali: Punjab Cricket Association Stadium pitch report batting or bowling appeared first on The SportsRush.","pubDate":"2022-09-19 12:57:41","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Nagpur Cricket Stadium capacity: VCA Stadium capacity of spectators for India vs Australia T20 match","link":"https://thesportsrush.com/cricket-news-nagpur-cricket-stadium-capacity-vca-stadium-capacity-of-spectators-for-india-vs-australia-t20-match/","keywords":["Cricket","Australia","Australia tour of India 2022","India"],"creator":["Samanvay Jain"],"video_url":null,"description":"Nagpur Cricket Stadium capacity: VCA Stadium (Vidarbha Cricket Association Stadium) will be hosting an India-Australia T20I next week. The Vidarbha Cricket Association (VCA) is preparing to host the second T20 International of the three-match series against the World T20 Champions Australia on September 23 at its swanky Jamtha Stadium in Nagpur. General public will be… The post Nagpur Cricket Stadium capacity: VCA Stadium capacity of spectators for India vs Australia T20 match appeared first on The SportsRush.","content":"Nagpur Cricket Stadium capacity: VCA Stadium (Vidarbha Cricket Association Stadium) will be hosting an India-Australia T20I next week. The Vidarbha Cricket Association (VCA) is preparing to host the second T20 International of the three-match series against the World T20 Champions Australia on September 23 at its swanky Jamtha Stadium in Nagpur. General public will be able to purchase tickets beginning September 18 on the online platform Paytm. The ground, located at Jamtha on the southern outskirts of Nagpur, was inaugurated in 2008, replacing the old Vidarbha Cricket Association Ground as the city’s main stadium. The qualities of the stadium have been praised by the International Cricket Council. VCA Stadium is the home ground for the Vidarbha and Central Zone teams for the domestic Ranji Trophy and Duleep Trophy tournaments, respectively. Before Covid-19 struck India, it had hosted most T20I matches by any stadium in India. The Stadium has hosted 6 Tests, 9 ODIs and 12 T20Is international matches. The VCA stadium in Jamtha will be hosting an international T20 match after almost three years. Under the newly installed LED floodlights, the game will be a night match, providing better visibility to players on the ground as well as a seamless viewing experience for the television audience. Nagpur Cricket Stadium capacity VCA Stadium, which has a capacity of allowing 44,000 spectators, has made ample free parking arrangements near the stadium. Spectators can avail of the same free of cost. The VCA has also set aside a number of tickets for differently-abled persons and their attendants. They will have to produce Govt ID/Certificate while buying the tickets. Both teams will arrive in Nagpur on a chartered flight on September 21 and will have a practice session on September 22. The Australian team will practice under floodlights at the Jamtha Stadium from 1 to 4 p.m., while Team India will practice from 5 to 8 p.m. The post Nagpur Cricket Stadium capacity: VCA Stadium capacity of spectators for India vs Australia T20 match appeared first on The SportsRush.","pubDate":"2022-09-19 12:48:17","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"}]}