{"newsArray":[{"title":"Bangladesh vs Sri Lanka 2nd Test Live Telecast Channel in India and Bangladesh: When and where to watch BAN vs SL Mirpur Test?","link":"https://thesportsrush.com/cricket-news-bangladesh-vs-sri-lanka-2nd-test-live-telecast-channel-in-india-and-bangladesh-when-and-where-to-watch-ban-vs-sl-mirpur-test/","keywords":["Cricket","Bangladesh","Sri Lanka","Sri Lanka tour of Bangladesh 2022"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Bangladesh vs Sri Lanka 2nd Test Live Telecast: The SportsRush presents before you the timing and live streaming details of the 2nd BAN vs SL Test. The second Test match of the ongoing Sri Lanka’s tour of Bangladesh will commence at the Shere Bangla National Stadium in less than two hours from now. Despite a… The post Bangladesh vs Sri Lanka 2nd Test Live Telecast Channel in India and Bangladesh: When and where to watch BAN vs SL Mirpur Test? appeared first on The SportsRush.","content":"Bangladesh vs Sri Lanka 2nd Test Live Telecast: The SportsRush presents before you the timing and live streaming details of the 2nd BAN vs SL Test. The second Test match of the ongoing Sri Lanka’s tour of Bangladesh will commence at the Shere Bangla National Stadium in less than two hours from now. Despite a few brilliant individual batting performances in the first Test in Chattogram, neither of the two teams were able to induce a result. With ICC World Test Championship points up for grabs, both Bangladesh and Sri Lanka would be keen to win both this match and the two-match series. v He’s done it! So well deserved! @mushfiqur15 has taken his team to a solid lead with an elegant hundred. Talk about reliability! Catch Day 4 of the @BCBtigers vs @OfficialSLC Test match, LIVE on #FanCode. https://t.co/UBuoElYSnG#BANvSL pic.twitter.com/JHDFG7qyIv — FanCode (@FanCode) May 18, 2022 Bangladesh, who’ve played the maximum number of Tests in Mirpur by virtue of being the hosts, have won six and lost 13 out of 22 appearances at this venue. Sri Lanka, on the other hand, have won all their three Test matches here in the past. Sri Lanka, who’ve also won two and lost zero out of their last five Tests against Bangladesh, would be banking on these numbers ahead of this match. Readers must note that the visitors have never lost a Test match in Bangladesh. Bangladesh vs Sri Lanka 2nd Test Live Telecast Channel in India and Bangladesh As has been the case for international cricket in West Indies, New Zealand, Bangladesh and some other nations in the recent years, Sri Lanka’s tour of Bangladesh 2022 isn’t available for television viewing in India either. Having said that, streaming platform Fan Code is streaming the same at a nominal price. Fans, who wish to buy a pass for the second Test, will have to pay a 25% discounted price of INR 15 on the website or mobile application of FanCode. As far as local fans in Bangladesh are concerned, they will be able to follow this match on Gazi TV and T Sports. Meanwhile, fans of the Sri Lankan cricket team back home are highly likely to be able to watch the Dhaka Test on Dialog TV and Peo TV. Date – 23/05/2022 – 27/05/2022. Match start Time – 09:30 AM (India and Sri Lanka) and 10:00 AM (local). TV Channel – Not available (India), Gazi TV and T Sports (Bangladesh) and Dialog TV and Peo TV (Sri Lanka). Online platform – FanCode (India). The post Bangladesh vs Sri Lanka 2nd Test Live Telecast Channel in India and Bangladesh: When and where to watch BAN vs SL Mirpur Test? appeared first on The SportsRush.","pubDate":"2022-05-23 02:17:49","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Pujara Tests positive for India","link":"https://www.tribuneindia.com/news/sports/pujara-tests-positive-for-india-397309","keywords":null,"creator":null,"video_url":null,"description":"New Delhi, May 22 Jammu and Kashmir pace sensation Umran Malik today earned an expected India call-up for the upcoming five-match T20 International home series against South Africa, which starts on June 9. Cheteshwar Pujara Malik has picked up 21 wickets in 13 games for Sunrisers Hyderabad in the IPL, but it's his ability to bowl over 150km/h thunderbolts consistently that has caught the imagination of all, and there have been calls for his immediate selection for top-flight cricket. Punjab Kings' death overs specialist Arshdeep Singh has also earned his maiden national call-up. Regular captain Rohit Sharma, star batter Virat Kohli, and pacers Jasprit Bumrah and Mohammed Shami have been rested for the white-ball series in which Rishabh Pant will be the vice-captain to stand-in captain KL Rahul. Sharma, Kohli, Bumrah, Ravichandran Ashwin and Ravindra Jadeja will fly to England on June 15 for the Birmingham Test against England, to be played from July 1 to 5. This Test is part of last year's series, which was called off after the Indian camp was hit by the Covid virus, with India leading 2-1. They will be joined by Cheteshwar Pujara, who has earned a recall to the 17-member Indian Test team after a stupendous show in the English County Championship for Sussex. The 34-year-old Pujara scored 720 runs in five Division 2 games for Sussex, which included two double hundreds and two hundreds. This forced the selection committee to give him a call-up for the fifth match of the Test series. The squad doesn't have any new faces from the one that was picked last year. A notable omission from the Test squad was Mayank Agarwal, who had a poor tour of South Africa, where he scored only 135 runs in six innings with only one half-century. Impressive Pandya All-rounder Hardik Pandya, who has successfully led new franchise Gujarat Titans into the IPL playoffs and has been consistent with the bat, besides bowling a few overs at brisk pace, is included in the T20I team. In the case of Pandya, it was never a question of whether he'd make a comeback but when he'd be recalled. — PTI Pujara for Sussex in April-May vs Derbyshire 6 amp; 201*vs Wrocestershire 109 amp; 12vs Durham 203vs Middlesex 16 amp; 170*vs Leicestershire 3 Test squad Rohit Sharma (captain), KL Rahul (vice-captain) Shubman Gill, Virat Kohli, Shreyas Iyer, Hanuma Vihari, Cheteshwar Pujara, Rishabh Pant (wk), KS Bharat (wk), Ravindra Jadeja, Ravichandran Ashwin, Shardul Thakur, Mohd Shami, Jasprit Bumrah, Mohd Siraj, Umesh Yadav, Prasidh Krishna T20I squad KL Rahul (captain), Ruturaj Gaikwad, Ishan Kishan, Deepak Hooda, Shreyas Iyer, Rishabh Pant (vice-captain) (wk), Dinesh Karthik (wk), Hardik Pandya, Venkatesh Iyer, Yuzvendra Chahal, Kuldeep Yadav, Axar Patel, Ravi Bishnoi, Bhuvneshwar Kumar, Harshal Patel, Avesh Khan, Arshdeep Singh, Umran Malik","content":null,"pubDate":"2022-05-23 01:35:18","image_url":"https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/5/2022_5$largeimg_1462829859.JPG","source_id":"tribuneindia","country":["india"],"category":["sports"],"language":"english"},{"title":"'SL series an opportunity to regain confidence'","link":"https://www.thenews.com.pk/print/959949-sl-series-an-opportunity-to-regain-confidence","keywords":null,"creator":null,"video_url":null,"description":"KARACHI: Pakistan women cricket team pacer Diana Baig on Sunday said that the home series against Sri Lanka is a good opportunity for the hosts to “regain” confidence which the brigade lost due to poor show in the World Cup and a few series after that.“Our performance in the...","content":"KARACHI: Pakistan women cricket team pacer Diana Baig on Sunday said that the home series against Sri Lanka is a good opportunity for the hosts to “regain” confidence which the brigade lost due to poor show in the World Cup and a few series after that. .ads_between_content{ height:auto; width:auto; clear: both; text-align: center; } .ads_between_content .story_ads{ } /*@media (max-width:600px){ .ads_between_content{ float:none; margin:0px auto; text-align: center; } }*/ “Our performance in the World Cup was not good which shook our confidence. The series against Sri Lanka is a new opportunity and we are trying to put the past behind and regain our confidence by winning the home series,” Diana told reporters here at the Southend Club Cricket Stadium. “We are trying to focus on the current series and not talk about our past experience,” Diana was quick to add. She said that they are absolutely “focussed” to win the series. “Our last year was not good. We will try to take advantage of home conditions and put in our best to win this series. We all are focussed to win this series,” the Hunza-born 26-year-old right-armer said. “Training is going well. It’s very hot and we are trying to keep ourselves hydrated. We are trying to utilise maximum possible time for training,” the bowler said. Diana was part of the FairBreak Invitational T20 Global league held in Dubai recently. And she said it was a competitive event and she did try to learn from this opportunity. “FairBreak was a competitive event and we played pressure games there and was a good experience,” said Diana. “The event in Dubai had cultural diversity and it was great to meet players of the rest of the world. We learnt from each other and exchanged ideas,” she said. “I interacted with many fast bowlers from around the world. I talked with them about game plan, how they plan in the start and in the death overs but I think there is not enough gap between us and overseas pacers. Our Fatima Sana is a good bowler and she is rated among the world’s top fast bowlers. Maybe overseas bowlers play leagues and so have more experience,” she said. It’s very hot in Karachi and as matches will begin at 2pm the players will have to demonstrate top level of fitness. But Diana believes that they will manage. “As players we don’t focus on these things, whether it is cold or hot. We will have to manage it ourselves and as players we want to bring ourselves in top fitness so that we could survive on the field. We are in such a shape that we will be able to cope with any kind of conditions,” said Diana. “We will try our level best and fight,” she was quick to add. The first game of the three match T20I series between Pakistan and Sri Lanka will begin here at the Southend Club Ground with the opener on Tuesday (tomorrow). The second game will be held on May 26 and it will be followed by the final show on May 28. The three-match ODI series will be held from June 1-5. This is after 17 years that Sri Lanka are touring Pakistan.","pubDate":"2022-05-23 01:00:00","image_url":null,"source_id":"thenews","country":["pakistan"],"category":["sports"],"language":"english"},{"title":"Police allegedly bitten and punched at Richmond v Essendon Dreamtime AFL match","link":"https://www.perthnow.com.au/news/police-allegedly-bitten-and-punched-at-richmond-v-essendon-dreamtime-afl-match-c-6899829","keywords":null,"creator":["Adelaide Lang"],"video_url":null,"description":"A police officer was allegedly bitten while trying to eject a drunk AFL fan from the Melbourne Cricket Ground on Saturday.","content":"A police officer was allegedly bitten while trying to eject a drunk AFL fan from the Melbourne Cricket Ground during the Richmond v Essendon Dreamtime match on Saturday night, where the rowdy crowd behaviour led to the expulsion of 50 people. The officer was allegedly bitten by a 21-year-old man who became aggressive while he was being led out of the ground after being found drunk at the food stall. Police also sprayed a 36-year-old man with capsicum spray and arrested him after he allegedly punched a police officer who approached him about urinating outside the hallowed sports ground. In addition, a 19-year-old woman is expected to be charged in relation to an alleged assault near the entry gates before the Dreamtime game even began. However, the trouble wasn’t limited to the stands. Two men were ejected from the game and charged $363 each for running on the playing field at quarter time. Victoria Police blamed “pre-loading” fans attending the game drunk for the “disappointing” unruly behaviour of the crowd. Inspector Jamie Templeton said the disruptive behaviour ruined the night for the vast majority of fans who were well behaved. “(It) was disappointing to see so many spectators engage in disruptive behaviour last night,” he said. “We did see what appeared to be higher levels of alcohol consumption and aggression. It was noticeable that ‘pre-loading’ of alcohol prior to the game was significant in contributing to more incidents of poor crowd behaviour than usual.” Inspector Templeton said police would be investigating alcohol consumption at the MCG and could possibly limit the supply of alcohol at the venue. Police say the raucous behaviour continued after the game, with an alleged assault outside the venue at 10.40pm in which three men were injured. A football fan was allegedly attacked with a didgeridoo in a ferocious attack following the Dreamtime clash. Police are investigating the incident on the footpath between the MCG and Birrarung Marr in which one man was hospitalised for non-life threatening injuries. In footage captured by an onlooker, the man is knocked to the ground after being hit in the head with a didgeridoo.","pubDate":"2022-05-22 23:15:14","image_url":"https://images.perthnow.com.au/publication/C-6899829/d86bac5e571a340068b12eb86ffddf274d07c188-16x9-x0y0w2048h1152.jpg","source_id":"perthnow","country":["australia"],"category":["sports"],"language":"english"},{"title":"PHOTO FOCUS - 19 photos from Scarborough Cricket Club 1st XI v Castleford Cricket Club","link":"https://www.thescarboroughnews.co.uk/sport/cricket/photo-focus-19-photos-from-scarborough-cricket-club-1st-xi-v-castleford-cricket-club-3704350","keywords":["Sport"],"creator":["Andy Bloomfield"],"video_url":null,"description":"Scarborough Cricket Club 1st XI eased to a nine-wicket home win against Castleford in the YPLN Premier on Saturday.","content":null,"pubDate":"2022-05-22 19:19:18","image_url":"https://www.thescarboroughnews.co.uk/webimg/QVNIMTI1Nzg5MDEx.jpg?width=1024&auto=webp","source_id":"thescarboroughnews","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Umran Malik, Arshdeep Singh receive maiden India call-up ahead of South Africa series","link":"https://www.thehansindia.com/sports/umran-malik-arshdeep-singh-receive-maiden-india-call-up-ahead-of-south-africa-series-744207","keywords":["Sports"],"creator":["Ishka"],"video_url":null,"description":"Umran Malik has picked up 21 wickets in IPL 2022Arshedeep Singh has 10 wickets to his nameIndia and South Africa are set to play 5 T20Is","content":"Umran Malik, Arshdeep Singh receive maiden India call-up ahead of South Africa series Umran Malik and Arshdeep Singh received their maiden India call-up as the Board of Control for Cricket in India (BCCI) announced squads on Sunday for a home T20I series against South Africa. KL Rahul was named captain for India's upcoming five-match T20I series against South Africa, with Rishabh Pant his deputy. The games are scheduled to take place in Delhi, Cuttack, Vishakapatnam, Rajkot, and Bengaluru. Sunrisers Hyderabad (SRH) fast bowler Umran has had a fine run, having picked up 21 wickets in 13 games. Jammu and Kashmir's Umran has consistently clocked 150 km/h. While he has been a tad expensive, he has made regular breakthroughs, including an incredible five-wicket haul against the table-toppers Gujarat Titans (GT). Back in 2021, Umran came in SRH as T.Natarajan's replacement, who had tested positive for COVID-19. Later, the Orange Army retained the seamer, along with captain Kane Williamson and Abdul Samad ahead of the IPL 2022 mega auction. While Arshdeep is not a big wicket-taker, but the Punjab Kings (PBKS) medium pacer is known for his economical spells. He has 10 wickets in 13 games at an economy of 7.71. Both Malik and Arshdeep are currently in action at Wankhede Stadium as SRH and PBKS are playing their final game of IPL 2022. Arshdeep, who played the 2018 U19 World Cup in New Zealand, featured in two games as Prithvi Shaw and Co had preferred the trio of Shivam Mavi, Kamlesh Nagarkoti and Ishan Porel in their fast bowling department. BCCI's selection committee has also named India's 17-member Test squad for the fifth rescheduled Test against England to be played at Edgbaston, Birmingham from July 1-5. India currently lead the Test series 2-1. India's Test squad: Rohit Sharma (c), KL Rahul (vc) Shubman Gill, Virat Kohli, Shreyas Iyer, Hanuma Vihari, Cheteshwar Pujara, Rishabh Pant (wk), KS Bharat (wk), Ravindra Jadeja, Ravichandran Ashwin, Shardul Thakur, Mohd Shami, Jasprit Bumrah, Mohd Siraj, Umesh Yadav, Prasidh Krishna India's T20I squad: KL Rahul (c), Ruturaj Gaikwad, Ishan Kishan, Deepak Hooda, Shreyas Iyer, Rishabh Pant (vc)(wk), Dinesh Karthik (wk), Hardik Pandya, Venkatesh Iyer, Yuzvendra Chahal, Kuldeep Yadav, Axar Patel, Ravi Bishnoi, Bhuvneshwar Kumar, Harshal Patel, Avesh Khan, Arshdeep Singh, Umran Malik","pubDate":"2022-05-22 17:43:45","image_url":"https://assets.thehansindia.com/h-upload/2022/05/22/500x300_1293599-umran.jpg","source_id":"thehansindia","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL 2022, SRH vs PBKS Highlights: Liam Livingstone, Harpreet Brar Steer PBKS To 5-Wicket Win Over SRH - NDTV Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMif2h0dHBzOi8vc3BvcnRzLm5kdHYuY29tL2lwbC0yMDIyL2lwbC0yMDIyLXNyaC12cy1wYmtzLWxpdmUtc2NvcmUtdXBkYXRlcy1zdW5yaXNlcnMtaHlkZXJhYmFkLXZzLXB1bmphYi1raW5ncy1saXZlLXNjb3JlLTI5OTg5OTPSAYUBaHR0cHM6Ly9zcG9ydHMubmR0di5jb20vaXBsLTIwMjIvaXBsLTIwMjItc3JoLXZzLXBia3MtbGl2ZS1zY29yZS11cGRhdGVzLXN1bnJpc2Vycy1oeWRlcmFiYWQtdnMtcHVuamFiLWtpbmdzLWxpdmUtc2NvcmUtMjk5ODk5My9hbXAvMQ?oc=5","keywords":null,"creator":null,"video_url":null,"description":"IPL 2022, SRH vs PBKS Highlights: Liam Livingstone, Harpreet Brar Steer PBKS To 5-Wicket Win Over SRH  NDTV SportsLive Cricket Score - SRH vs PBKS, Match 70, IPL 2022 | Cricbuzz.com - Cricbuzz  CricbuzzSRH vs PBKS IPL 2022 Highlights: Punjab Kings Defeat Sunrisers Hyderabad by 5 Wickets  News18IPL News Live Updates: Punjab Kings beat Sunrisers Hyderabad by five wickets to finish sixth  Economic TimesSRH vs PBKS Dream11 Prediction Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update- Tata IPL 2022  Cricket AddictorView Full coverage on Google News","content":null,"pubDate":"2022-05-22 17:33:27","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Rayudu likely to join Baroda next domestic season; BCA eyes Deepak Hooda return","link":"https://sportstar.thehindu.com/cricket/ambati-rayudu-to-play-for-baroda-domestic-cricket-deepak-hooda-return/article38496626.ece","keywords":null,"creator":["Shayan Acharya"],"video_url":null,"description":"Baroda Cricket Association secretary also informed that the association is trying to bring back its 'home boy' Deepak Hooda for the next season.","content":"Ambati Rayudu may been seen in action for Baroda in the Ranji Trophy next season. This comes a week after the India international had announced his retirement from all forms of cricket after the Indian Premier League. But the Chennai Super Kings officials then swung into action and ensured that Rayudu changed his mind and decided to continue. However, Baroda Cricket Association (BCA) secretary Ajit Lele confirmed to Sportstar that the apex council is for the move, even though a final decision will only be taken after the IPL. \"Rayudu has expressed his desire to play for Hyderabad and our CEO conveyed the matter to the association. The apex council deliberated on the matter and decided to give a go ahead. However, final decision will be taken only after the IPL,\" Lele said. READ: Rohit, Kohli rested for South Africa T20s; Umran Malik earns maiden call-up; Karthik, Hardik return The secretary also informed that the BCA is trying to bring back its 'home boy' Deepak Hooda for the next season. Hooda, who is now a regular member of the Lucknow Super Giants franchise in the Indian Premier League (IPL), had parted ways with Baroda last year after an alleged fall out with Krunal Pandya. In January last year, on the eve of the Syed Mushtaq Ali Trophy, Hooda had left the team's bio-bubble after alleged confrontation with Krunal, who was then the captain of the team. The BCA handed a suspension to Hooda for misconduct. Even though he played for Punjab Kings in the IPL last season, Hooda moved to Rajasthan ahead of the domestic season and went on to lead the state team. ALSO READ: Pujara returns to India squad for England Test, Rahane ruled out with injury After a good show in white ball cricket, Hooda made his India debut against the West Indies in February this year and earned a contract with Lucknow Super Giants, where he is team-mate with Krunal.\"We have spoken to Hooda and we want to bring him back in the team for the next season. However, like Rayudu, his decision will also be finalised after the IPL gets over,\" Lele said. Even though Hooda was not available for a comment, sources close to the cricketer confirmed that the top brass of BCA have indeed spoken to him asking to come back. However, it is believed that Hooda is yet to make up his mind.","pubDate":"2022-05-22 17:23:51","image_url":null,"source_id":"sportstar","country":["india"],"category":["sports"],"language":"english"},{"title":"Sunrisers Hyderabad vs Punjab Kings Live Score Ball by Ball, IPL 2022 Live Cricket Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/sunrisers-hyderabad-vs-punjab-kings-live-score-over-match-70-t20-11-15-updates-2999245","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Sunrisers Hyderabad vs Punjab Kings from Wankhede Stadium, Mumbai. Check commentary and full scoreboard of the match.","content":"Follow the Indian Premier League 2022 live cricket score on Sports.NDTV.com . After 15.2 overs, Sunrisers Hyderabad are 97/5. Get live score, ball by ball commentary and much more. Keep track of Indian Premier League 2022 today match between Sunrisers Hyderabad and Punjab Kings. Everything related to Sunrisers Hyderabad and Punjab Kings match will be available on Sports.NDTV.com . Stay updated with Sunrisers Hyderabad vs Punjab Kings live score. Do check for Sunrisers Hyderabad vs Punjab Kings scorecard. You can get scorecard updates, match related facts. Get quick live updates with ads, Sports.NDTV.com , which is the perfect destination for live cricket score. 14.6 overs (0 Run) This is short and outside off. Romario Shepherd has a poke at it but misses. 14.5 overs (0 Run) Tossed up, on off, pushed to covers. Romario Shepherd is the next man in. 14.4 overs (0 Run) OUT! STUMPING! Brar gets another big wicket as Punjab get rid of the dangerous Markram! Beautiful piece of bowling this! A length ball, around off, it lands and turns away. Markram prods and tries to defend but gets beaten by the spin and the keeper is quick to whip the bails off. Markram was not in a comfortable position as he stumbled while playing it and the replay shows Markram was out of his line. Is this stumped? Aiden Markram looks in trouble here. The replays roll in and they show that Aiden Markram is just out of the crease. He has to walk back. 14.3 overs (0 Run) Flatter and slanting on middle. Markram backs away and punches it to the bowler. 14.2 overs (4 Runs) FOUR! Beautiful shot and a much needed one for Hyderabad! Drops it short and outside off. Markram cuts it hard and past point for a boundary. Welcome boundary. 14.1 overs (2 Runs) Floats one up, on middle, eased to long on for a couple. Harpreet Brar is back to bowl his last over. Two important wickets for him so far. 13.6 overs (1 Run) Slants it on the pads, Markram turns it to square leg and takes a single. 13.5 overs (1 Run) Length ball, outside off. Sundar guides it to third man for a single. 13.4 overs (0 Run) Bangs a bouncer, on middle. Sundar tries to ramp it away. There are not many short deliveries from Punjab. First after a quiet while. 13.3 overs (0 Run) Length and on the pads. Sundar nudges it to mid-wicket. 13.2 overs (0 Run) A yorker, on middle. Sundar jams it out on the off side but for no run. 13.1 overs (1 Run) On middle, tucked to mid-wicket for a single. Washington Sundar walks out to the middle now and it is Kagiso Rabada who is back into the attack. 12.6 overs (0 Run) OUT! CAUGHT BEHIND! Another one bites the dust and Hyderabad are loosing their control here. Too many dot balls and singles have got up to this wicket. This is a fuller-length ball, angling outside off. Pooran looks to drive but the angle was always going away and it takes the outside edge to the keeper, Jitesh Sharma who pouches it cleanly. 12.5 overs (0 Run) Length ball, outside off. Pooran cuts it nicely but finds the point fielder. 12.5 overs (1 Run) Wide! Length and down the leg side. Pooran fails in his pull shot. 12.4 overs (1 Run) Pitched up, on middle. Markram drives it straight back to Ellis who gets his hand on it but deflects it to long on. A single. 12.3 overs (1 Run) Full and on off, it is driven to long off for a single. 12.2 overs (0 Run) Length and around off. Pooran drops it towards cover. 12.1 overs (1 Run) Touch fuller and around off. Markram drives it to mid off and takes a quick single. 11.6 overs (0 Run) An arm ball, stays low and around off. Pooran blocks it out. Both the spinners have bowled really well in tandem. 11.5 overs (1 Run) Darted on the pads, tucked to mid-wicket for a quick run. 11.4 overs (1 Run) Gives more flight to this one and serves it on the pads, flicked in front of square on the leg side for a single. 11.3 overs (0 Run) Around off, pushed to mid off. 11.2 overs (1 Run) A leggie,full and outside off. Markram drives it to the left of covers where the fielder fumbles a bit and allows a single. 11.1 overs (1 Run) Fuller and slanting on middle. Pooran pushes it to long off for a single. 10.6 overs (1 Run) Flatter and spinning into Pooran. He cuts it to deep point for one more. 10.5 overs (1 Run) Outside off, cut to deep point for a single. 10.4 overs (1 Run) Full and on off, Pooran drives it to wide of long off for a single. Nicholas Pooran is the next man in. 10.3 overs (0 Run) OUT! CAUGHT! What a catch by Liam Livingstone! Perfect timing there by Liam! Too full and on middle. Sharma hangs back and tries to get underneath the ball as he lofts it over long on but doesn't get much elevation. It looked like it will go all the way but Liam Livingstone there, times his jump and plucks it out of the air. Good control from him and another set batter goes at the wrong time. 10.2 overs (1 Run) Shorter and on middle. Markram makes room and cuts it to point for a single. 10.1 overs (4 Runs) FOUR! Just over! Tossed up, outside off. Markram drives it on the up and over the man at covers for a boundary.","pubDate":"2022-05-22 14:55:51","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637888479435044820.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Prerak Mankad and Vinoo Mankad relation: Is Prerak Mankad related to Vinoo Mankad?","link":"https://thesportsrush.com/cricket-news-prerak-mankad-and-vinoo-mankad-relation-is-prerak-mankad-related-to-vinoo-mankad/","keywords":["Cricket","IPL 2022","Punjab Kings","Sunrisers Hyderabad","Indian Premier League","PBKS","Prerak Mankad","SRH","Vinoo Mankad"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Prerak Mankad and Vinoo Mankad relation: The all-rounder from Saurashtra has been handed an Indian Premier League debut tonight. Punjab Kings captain Mayank Agarwal losing the toss in their final match of the ongoing 15th season of the Indian Premier League against Sunrisers Hyderabad has resulted in them bowling first at the Wankhede Stadium. Punjab,… The post Prerak Mankad and Vinoo Mankad relation: Is Prerak Mankad related to Vinoo Mankad? appeared first on The SportsRush.","content":"Prerak Mankad and Vinoo Mankad relation: The all-rounder from Saurashtra has been handed an Indian Premier League debut tonight. Punjab Kings captain Mayank Agarwal losing the toss in their final match of the ongoing 15th season of the Indian Premier League against Sunrisers Hyderabad has resulted in them bowling first at the Wankhede Stadium. Punjab, who have won six and lost seven out of their 13 IPL 2022 matches thus far, are playing a dead-rubber at the Wankhede Stadium tonight. Currently at the seventh position on the points table, Kings could (at maximum) move a position above even if they win this match. One last time ❤️🧡 #SaddaPunjab #IPL2022 #PunjabKings #ਸਾਡਾਪੰਜਾਬ #SRHvPBKS pic.twitter.com/v0Qgs5VLxR — Punjab Kings (@PunjabKingsIPL) May 22, 2022 Wanting to provide opportunities to players, PBKS have included batter Shahrukh Khan, debutant all-rounder Prerak Mankad and fast bowler Nathan Ellis in place of batter Bhanuka Rajapaksa, all-rounder Rishi Dhawan and spinner Rahul Chahar. Mankad, 28, represents Saurashtra in domestic cricket. Having registered himself in the price category of INR 20 lakh for IPL 2022 mega auction earlier this year, Mankad was sold at his base price to Kings. Mankad, who has played in excess of 100 domestic matches across formats in his six-year old career, has a decent T20 record. In 34 matches of the shortest format, Mankad has scored 763 runs at a strike rate of 140.51. A like-for-like replacement for Rishi Dhawan tonight, Mankad’s medium-pacers have earned him 20 T20 wickets at a strike rate of 21.3. ALSO READ: Is Rishi Dhawan brother of Shikhar Dhawan? To clear the confusion, it is noteworthy that Prerak Mankad isn’t related to former India captain Vinoo Mankad by any means. Vinoo Mankad, who had played 44 Tests between 1946-1959, had three sons namely Ashok Mankad, Atul Mankad and Rahul Mankad but neither of them is related to Prerak Mankad in spite of the latter also belonging to Gujarat.","pubDate":"2022-05-22 14:34:45","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Sunrisers Hyderabad vs Punjab Kings: IPL 2022 Live Cricket Score, Live Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/sunrisers-hyderabad-vs-punjab-kings-live-score-over-match-70-t20-1-5-updates-2999097","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Sunrisers Hyderabad vs Punjab Kings from Wankhede Stadium, Mumbai. Check commentary and full scoreboard of the match.","content":"A dedicated team of experts bring you live score, live cricket score, live match update on Sports.NDTV.com . After 5.1 overs, Sunrisers Hyderabad are 32/1. The live updates of Sunrisers Hyderabad vs Punjab Kings scorecard is also available. It is the perfect platform to follow your favourite teams in Indian Premier League 2022. Keep a track on your favourite batsmen and bowlers through Indian Premier League 2022 today match, ball by ball commentary, Sunrisers Hyderabad vs Punjab Kings, Sunrisers Hyderabad vs Punjab Kings live score, Sunrisers Hyderabad vs Punjab Kings scorecard. Follow the excitement of the Indian Premier League 2022 on Sports.NDTV.com as you can follow live match updates and live cricket score through our platform. 4.6 overs (1 Run) Outside off, on a length, cut away to deep point for one more. 7 runs off the over. Hyderabad are yet to hit a double-digit over. 4.5 overs (1 Run) Follows the boundary with a single as Sharma dabs this length ball to third man. 4.4 overs (4 Runs) FOUR! Poor delivery! Serves one on the hips and Abhishek Sharma helps it away past square leg for a boundary. 4.3 overs (0 Run) Length and outside off. Sharma slaps it to the man at cover. Yet another dot. 4.2 overs (1 Run) Extra pace there, on a length and on off. Tripathi is hurried as he taps it to cover for a quick single. 4.2 overs (1 Run) Wide! A yorker but angling down the leg side. Tripathi misses his flick. 4.1 overs (0 Run) BEATEN! A length ball, outside off, it nips away. Tripathi looks to steer it down the ground but misses. 3.6 overs (0 Run) Tad fuller and around off. Sharma keeps it out towards mid off. 6 runs off the over. Punjab are using the pitch perfectly here. Not easy to bat on. 3.5 overs (0 Run) Outside off. Defended out. 3.4 overs (4 Runs) FOUR! Pulled away! Short in length and on leg. Sharma gets on top of the bounce quickly and pulls it along the ground behind square on the leg side for a boundary. 3.3 overs (2 Runs) Touch fuller and around off. Sharma guides it past the diving point fielder and to third man for a couple of runs. The throw is to the keeper's side who clips the bails off but the replay shows Sharma was well in. The umpire even look for a short run and Sharma was okay there as well. Two runs. 3.2 overs (0 Run) Around off, on a length. Sharma works it to backward point. 3.1 overs (0 Run) Length and outside off. Left alone. 2.6 overs (4 Runs) FOUR! Perfect timing and Tripathi opens his account! Full and slanting around middle. Tripathi flicks it past mid-wicket, in the gap for a boundary. 2.5 overs (0 Run) Length and on top of off. Tripathi blocks it out. Rahul Tripathi is the next man in. 2.4 overs (0 Run) OUT! CAUGHT! Rabada strikes! A full ball, on middle, it holds a bit on the surface. Garg leans and looks to flick it but closes the face of the bat too early and it takes the leading edge, high in the air and to mid off where Mayank Agarwal catches it. Again Priyam Garg didn't time that well and pays a heavy price this time. 2.3 overs (0 Run) Very full and on off. Garg on-drives it to mid on. The pitch is on the slower side. The batters are a touch struggling in their timing. 2.2 overs (1 Run) Full ball, angling around off. Sharma mistimes his push to mid off and takes a single. 2.1 overs (4 Runs) FOUR! Easy pickings! Rabada serves a straight one, on the pads. Sharma flicks it aerially and over mid-wicket for a boundary. Kagiso Rabada is into the attack now. 1.6 overs (2 Runs) Serves a slower one on the fuller side and Garg tickles it to the fine leg region for a brace. Good start from Arshdeep Singh as well. Hyderabad are off to a watchful start. 1.5 overs (1 Run) Back of a length and just outside off. Sharma cuts it to sweeper cover for a single. 1.4 overs (0 Run) A length ball, outside off, hint of away swing. Abhishek leaves it alone to the keeper. 1.3 overs (1 Run) Full again, outside off. Garg pushes it to mid off and scampers across for a quick single. 1.2 overs (0 Run) Too full and on off, pushed back to the bowler. 1.1 overs (0 Run) Singh starts with a widish yorker, outside off. Garg looks to drive but misses. Arshdeep Singh to start from the other end. He has been selected in the Indian team for the T20I series against South Africa earlier in the day. Can he celebrate it with a big performance with the ball today? 0.6 over (0 Run) Dot to end the over and five runs to start the proceedings! Around off. Sharma knocks it to cover. 0.5 over (4 Runs) FOUR! Finds the gap! Slightly short and outside off. Sharma punches it hard and through covers for a boundary. Good shot! 0.4 over (0 Run) A floated ball, around off. Sharma punches it to cover. 0.3 over (0 Run) Flatter again but this one comes with the angle. Sharma cuts it to backward point. 0.2 over (0 Run) Flatter, on a length and outside off. Sharma leaves it alone. 0.1 over (1 Run) Tossed up, full and on middle. Garg steps forward and pushes it to mid on for a single. We are all set to begin! Punjab players are in the huddle and they disperse now to take their respective positions. Abhishek Sharma and Priyam Garg are the openers for Hyderabad. Punjab will start with the spin. Liam Livingstone has a new ball in his hand. Priyam Garg will be on the strike. Here we go... Kagiso Rabada is up for a quick chat. He says the biggest motivation is leading into next season knowing what they can do as a team. Whenever they have played collectively, they have destroyed the opposition away. Adds that on paper they have a really destructive batting line-up, while with bowing they have done a decent job. Shares, there are areas for improvement, it's about re-emphasizing on basics and trying to keep things simple and trust the process. Shares that you can always learn from guys like Anil Kumble, he is a legend of the game. Mentions that individual milestones are something which comes and even two wickets in this game will be a great achievement. Mayank Agarwal, the skipper of Punjab informs that there are three changes. Adds that they wanted to mix things up and give players some chance. Tells that each game is important and they will come out and look to win this game as well. Shares that they are bowling first so they'll be aware of the target. The skipper of Hyderabad, Bhuvneshwar Kumar says that they will bat first. Tells that this pitch was used in the last game and it might get slower. Informs that they have two changes with Romario coming in for Williamson and Suchith for Natarajan. Tells that it is a dead rubber but they will play for pride and it is always good to be on the higher side on the table. Says that he is not a good fan of predicting scores but 170-180 will be a good score on this pitch. Punjab (Playing XI) - Jonny Bairstow, Shikhar Dhawan, Liam Livingstone, Mayank Agarwal (C), Jitesh Sharma (WK), Shahrukh Khan (In for Rahul Chahar), Prerak Mankad (In for Rishi Dhawan), Harpreet Brar, Kagiso Rabada, Arshdeep Singh, Nathan Ellis (In for Bhanuka Rajapaksa). Hyderabad (Playing XI) - Abhishek Sharma, Priyam Garg, Rahul Tripathi, Nicholas Pooran (WK), Aiden Markram, Washington Sundar, Romario Shepherd (In for Kane Williamson), Bhuvneshwar Kumar (C), Jagadeesha Suchith (In for T Natarajan), Umran Malik, Fazalhaq Farooqi. TOSS - Hyderabad have won the toss and they will BAT first! Bhuvneshwar Kumar will lead Hyderabad tonight as Kane Williamson is not available. PITCH REPORT - Graeme Swann says that Wankhede has short boundaries. Tells that this pitch was used last night and it is hard and there is not much grass. He expects that the pitch will turn a bit and 160 would be a good score on this pitch. Hyderabad, on the other hand, would feel that they let go of a golden chance to qualify for the playoffs. They had 5 wins from the first 7 games but the dismal show after that has led to their downfall. Their struggling skipper, Kane Williamson is not available for this match and it opens up an opportunity for them to try out other quality overseas players in their ranks. Which team will finish the season on a high? Let's find out. Toss and team sheets in a while. Punjab had a very strong team this season but despite showing flashes of brilliance, the inconsistency has led to their downfall. They have failed to deliver as a group and the lack of form of their skipper, Mayank Agarwal also did not help their cause. However, the quality of this group is unquestionable and they would hope to unleash their might for one last time this season. Hello and a warm welcome, folks! It is the last game of the league stage of the Indian T20 League 2022 where Hyderabad will go head-to-head against Punjab. The race for the playoffs was quite intense this season but it is all over now and unfortunately for these two teams, they have missed the cut. However, this provides an opportunity for both these teams to try out some fringe players and this might just be a blessing in disguise for the next season. Let's see how things pan out. ... MATCH DAY …","pubDate":"2022-05-22 13:46:09","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637888437608082568.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"\"Nothing But India's Loss\": Twitter Fumes As Rahul Tripathi, Sanju Samson Left Out Of T20I Squad vs .. - NDTV Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMikwFodHRwczovL3Nwb3J0cy5uZHR2LmNvbS9jcmlja2V0L25vdGhpbmctYnV0LWluZGlhcy1sb3NzLXR3aXR0ZXItZnVtZXMtYXMtcmFodWwtdHJpcGF0aGktc2FuanUtc2Ftc29uLWxlZnQtb3V0LW9mLXQyMGktc3F1YWQtdnMtc291dGgtYWZyaWNhLTI5OTkwNDjSAZkBaHR0cHM6Ly9zcG9ydHMubmR0di5jb20vY3JpY2tldC9ub3RoaW5nLWJ1dC1pbmRpYXMtbG9zcy10d2l0dGVyLWZ1bWVzLWFzLXJhaHVsLXRyaXBhdGhpLXNhbmp1LXNhbXNvbi1sZWZ0LW91dC1vZi10MjBpLXNxdWFkLXZzLXNvdXRoLWFmcmljYS0yOTk5MDQ4L2FtcC8x?oc=5","keywords":null,"creator":null,"video_url":null,"description":"\"Nothing But India's Loss\": Twitter Fumes As Rahul Tripathi, Sanju Samson Left Out Of T20I Squad vs ..  NDTV SportsIND vs SA: India's T20 Squad vs South Africa Announced, Umran Malik, Arshdeep Singh Get Maiden Call Ups, KL Rahul To Captain  Cricket AddictorUmran Malik, Arshdeep Singh earn maiden India call-up for South Africa T20Is | Cricbuzz.com - Cricbuzz  CricbuzzBreaking new live updates: PM Modi interacts with Thomas cup and Uber Cup badminton champions  Times of IndiaBCCI Selectors Face Umran Malik Selection Dilemma Ahead Of South Africa, Ireland And England Series  Cricket AddictorView Full coverage on Google News","content":null,"pubDate":"2022-05-22 13:42:14","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Fans lament Rahul Tripathi and Sanju Samson's snub from T20I squad vs SA - Hindustan Times","link":"https://news.google.com/__i/rss/rd/articles/CBMihAFodHRwczovL3d3dy5oaW5kdXN0YW50aW1lcy5jb20vY3JpY2tldC9mYW5zLWxhbWVudC1yYWh1bC10cmlwYXRoaS1hbmQtc2FuanUtc2Ftc29uLXMtc251Yi1mcm9tLXQyMGktc3F1YWQtdnMtc2EtMTAxNjUzMjI1MDg1Njg5Lmh0bWzSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Fans lament Rahul Tripathi and Sanju Samson's snub from T20I squad vs SA  Hindustan TimesUmran Malik, Arshdeep Singh earn maiden India call-up for South Africa T20Is | Cricbuzz.com - Cricbuzz  CricbuzzIND vs SA: India's T20 Squad vs South Africa Announced, Umran Malik, Arshdeep Singh Get Maiden Call Ups, KL Rahul To Captain  Cricket AddictorOn Umran Malik's Maiden India Call-Up, Omar Abdullah Tweets This  NDTV SportsIndia's squad for SA ft. KL Rahul (c), Hardik Pandya & Umran Malik  CricbuzzView Full coverage on Google News","content":null,"pubDate":"2022-05-22 13:40:19","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"SRH vs PBKS Live Cricket Score IPL 2022 Latest Updates: Bhuvneshwar Kumar Elects to Bat as Punjab Kings Make 3 Changes - News18","link":"https://news.google.com/__i/rss/rd/articles/CBMi3QFodHRwczovL3d3dy5uZXdzMTguY29tL2NyaWNrZXRuZXh0L25ld3Mvc3JoLXZzLXBia3MtbGl2ZS1jcmlja2V0LXNjb3JlLWlwbC0yMDIyLWxhdGVzdC11cGRhdGVzLXN1bnJpc2Vycy1oeWRlcmFiYWQtdnMtcHVuamFiLWtpbmdzLWxpdmUtc3RyZWFtaW5nLWluZGlhbi1wcmVtaWVyLWxlYWd1ZS1jb3ZlcmFnZS1oaWdobGlnaHRzLXRvZGF5LW1hdGNoLWxpdmVuZXdzLTUyMjQ2NTcuaHRtbNIBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"SRH vs PBKS Live Cricket Score IPL 2022 Latest Updates: Bhuvneshwar Kumar Elects to Bat as Punjab Kings Make 3 Changes  News18Sunrisers, Kings look to sign off on a high in dead rubber  ESPNcricinfoSRH vs PBKS Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update- Tata IPL 2022  Cricket Addictor#MIvDC | Cricbuzz Comm Box: Match 69, Mumbai v Delhi, 2nd innings  CricbuzzIPL 2022, SRH vs PBKS Live Score: SunRisers Hyderabad Win Toss, Elect To Bat vs Punjab Kings  NDTV SportsView Full coverage on Google News","content":null,"pubDate":"2022-05-22 13:39:33","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Pace sensation Umran Malik, Arshdeep selected for T20Is vs SA","link":"https://www.tribuneindia.com/news/sports/pace-sensation-umran-malik-arshdeep-selected-for-t20is-vs-sa-397109","keywords":null,"creator":null,"video_url":null,"description":"New Delhi, May 22 Jammu and Kashmir pace sensation Umran Malik on Sunday earned an expected call-up in the Indian team for the upcoming five-match T20 International home series against South Africa starting June 9. Umran has picked up 21 wickets in 13 games for Sunrisers Hyderabad in the IPL but it's his ability to bowl consistently at 95 miles per hour that has caught the imagination of all and sundry with calls for his immediate selection in top-flight cricket. Along with Umran, Punjab Kings' death overs specialist Arshdeep Singh has also earned his maiden national call-up. Regular captain Rohit Sharma, star batter Virat Kohli, pacers Jasprit Bumrah and Mohammed Shami have all been rested for the white-ball series in which Rishabh Pant will be the vice-captain. Rohit, Kohli, Bumrah, Ravichandran Ashwin and Ravindra Jadeja will all fly to England on June 15 for the one-off Test against England at Edgbaston from July 1-5 and will be joined by Cheteshwar Pujara, who has earned a recall to the 17-member Indian Test team after a stupendous show in English County Championship for Sussex. Ditto for all-rounder Hardik Pandya, who has successfully led new franchise Gujarat Titans into IPL play-offs and has been consistent with the bat, besides bowling a few overs at brisk pace. Umran pips Mohsin among bowlers but Tripathi misses out While former players and experts have all spoken in unison about Umran's selection in the national team, it wouldn't have been a cakewalk had Lucknow Super Giants pacer Mohsin Khan been fully fit. While Umran has 21 wickets (before Sunday's game), most of which came in the first phase when batters were getting used to his pace, it is understood that the selectors were far more impressed with Uttar Pradesh left-armer Mohsin, who has 13 wickets from 8 matches at an astounding economy rate of 5.93 compared to Umran's 8.93 in 13 games. However, Mohsin's dodgy hamstring made the decision easier for Chetan Sharma's committee, which also picked Arshdeep especially for his death overs bowling for Punjab Kings. Arshdeep bowls at early to mid 130s and has only 10 wickets in 13 games (before Sunday's game) but his ability to bowl the change-ups along with wide yorkers and deliveries in the block-hole has earned him a place in the squad. Arshdeep was with Indian team as net bowler in an away series against Sri Lanka last year while Umran was in the UAE, assisting the national team during T20 World Cup. The selectors more or less picked up players who have played in last two T20I series for India with Dinesh Karthik, at 36 years of age and 18 years after he first played for India, making his umpteenth comeback. Karthik's inclusion will certainly put Rishabh Pant under a bit of pressure as both are designated middle-order finishers unlike third keeping option Ishan Kishan, who is a specialist opener. As per indication in the team sheet, Karthik is second keeper and Ishan is a pure batter. If there was one player, who would feel a bit let-down, it has to be Rahul Tripathi, who, before Sunday, had scored 393 runs at a strike-rate of above 160 and had three fifty plus-scores to his credit. Tripathi, who has been consistent in the IPL, may get his chance sometime during the season but he might feel hard done by, considering Suryakumar Yadav was left out due to hand injury. Hardik back in the mix, Venkatesh remains back-up In the case of Hardik Pandya, it was never a question of how he will make a comeback for one of India's guaranteed game-changers but as to when that recall will come. The Gujarat Titans skipper scored 413 runs in 13 games at a strike-rate of 131-plus but more importantly bowled nearly 25 overs (24.3 overs), which is around a couple of overs per game. He worked up good pace, got a few wickets but more importantly will give Rohit a sixth bowling option going into the World T20 in Australia. India's spin department for the T20I series also looks menacing with three wrist spinners -- Kuldeep Yadav, Ravi Bishnoi and Yuzvendra Chahal -- in the mix along with left-arm orthodox Axar Patel. Pujara back in Test squad after bagful of County runs The 34-year-old Cheteshwar Pujara scored 720 runs in five Division two games for Sussex, which included two double hundreds and two hundreds, which forced the selection committee to give him a call-up for the 'fifth' Test of the last series. The squad doesn't have any new face from the one that was picked last year. Prasidh Krishna, who had been drafted into the Test squad during the course of last series, is back while KS Bharath is now the official second keeper in Tests after 37-year-old Wriddhiman Saha was shown the door earlier this year. Shreyas Iyer and Hanuma Vihari, who have done well for India in the little chances that they got, are there. India's Test squad: Rohit Sharma (captain), KL Rahul (vice-captain) Shubman Gill, Virat Kohli, Shreyas Iyer, Hanuma Vihari, Cheteshwar Pujara, Rishabh Pant (wk), KS Bharat (wk), Ravindra Jadeja, Ravichandran Ashwin, Shardul Thakur, Mohd Shami, Jasprit Bumrah, Mohd Siraj, Umesh Yadav, Prasidh Krishna. India's T20I squad: KL Rahul (Captain), Ruturaj Gaikwad, Ishan Kishan, Deepak Hooda, Shreyas Iyer, Rishabh Pant (vice-captain)(wk), Dinesh Karthik (wk), Hardik Pandya, Venkatesh Iyer, Yuzvendra Chahal, Kuldeep Yadav, Axar Patel, Ravi Bishnoi, Bhuvneshwar Kumar, Harshal Patel, Avesh Khan, Arshdeep Singh, Umran Malik.","content":"PTI New Delhi, May 22 Jammu and Kashmir pace sensation Umran Malik on Sunday earned an expected call-up in the Indian team for the upcoming five-match T20 International home series against South Africa starting June 9. Umran has picked up 21 wickets in 13 games for Sunrisers Hyderabad in the IPL but it's his ability to bowl consistently at 95 miles per hour that has caught the imagination of all and sundry with calls for his immediate selection in top-flight cricket. Along with Umran, Punjab Kings' death overs specialist Arshdeep Singh has also earned his maiden national call-up. Regular captain Rohit Sharma, star batter Virat Kohli, pacers Jasprit Bumrah and Mohammed Shami have all been rested for the white-ball series in which Rishabh Pant will be the vice-captain. Rohit, Kohli, Bumrah, Ravichandran Ashwin and Ravindra Jadeja will all fly to England on June 15 for the one-off Test against England at Edgbaston from July 1-5 and will be joined by Cheteshwar Pujara, who has earned a recall to the 17-member Indian Test team after a stupendous show in English County Championship for Sussex. Ditto for all-rounder Hardik Pandya, who has successfully led new franchise Gujarat Titans into IPL play-offs and has been consistent with the bat, besides bowling a few overs at brisk pace. Umran pips Mohsin among bowlers but Tripathi misses out While former players and experts have all spoken in unison about Umran's selection in the national team, it wouldn't have been a cakewalk had Lucknow Super Giants pacer Mohsin Khan been fully fit. While Umran has 21 wickets (before Sunday's game), most of which came in the first phase when batters were getting used to his pace, it is understood that the selectors were far more impressed with Uttar Pradesh left-armer Mohsin, who has 13 wickets from 8 matches at an astounding economy rate of 5.93 compared to Umran's 8.93 in 13 games. However, Mohsin's dodgy hamstring made the decision easier for Chetan Sharma's committee, which also picked Arshdeep especially for his death overs bowling for Punjab Kings. Arshdeep bowls at early to mid 130s and has only 10 wickets in 13 games (before Sunday's game) but his ability to bowl the change-ups along with wide yorkers and deliveries in the block-hole has earned him a place in the squad. Arshdeep was with Indian team as net bowler in an away series against Sri Lanka last year while Umran was in the UAE, assisting the national team during T20 World Cup. The selectors more or less picked up players who have played in last two T20I series for India with Dinesh Karthik, at 36 years of age and 18 years after he first played for India, making his umpteenth comeback. Karthik's inclusion will certainly put Rishabh Pant under a bit of pressure as both are designated middle-order finishers unlike third keeping option Ishan Kishan, who is a specialist opener. As per indication in the team sheet, Karthik is second keeper and Ishan is a pure batter. If there was one player, who would feel a bit let-down, it has to be Rahul Tripathi, who, before Sunday, had scored 393 runs at a strike-rate of above 160 and had three fifty plus-scores to his credit. Tripathi, who has been consistent in the IPL, may get his chance sometime during the season but he might feel hard done by, considering Suryakumar Yadav was left out due to hand injury. Hardik back in the mix, Venkatesh remains back-up In the case of Hardik Pandya, it was never a question of how he will make a comeback for one of India's guaranteed game-changers but as to when that recall will come. The Gujarat Titans skipper scored 413 runs in 13 games at a strike-rate of 131-plus but more importantly bowled nearly 25 overs (24.3 overs), which is around a couple of overs per game. He worked up good pace, got a few wickets but more importantly will give Rohit a sixth bowling option going into the World T20 in Australia. India's spin department for the T20I series also looks menacing with three wrist spinners -- Kuldeep Yadav, Ravi Bishnoi and Yuzvendra Chahal -- in the mix along with left-arm orthodox Axar Patel. Pujara back in Test squad after bagful of County runs The 34-year-old Cheteshwar Pujara scored 720 runs in five Division two games for Sussex, which included two double hundreds and two hundreds, which forced the selection committee to give him a call-up for the 'fifth' Test of the last series. The squad doesn't have any new face from the one that was picked last year. Prasidh Krishna, who had been drafted into the Test squad during the course of last series, is back while KS Bharath is now the official second keeper in Tests after 37-year-old Wriddhiman Saha was shown the door earlier this year. Shreyas Iyer and Hanuma Vihari, who have done well for India in the little chances that they got, are there. India's Test squad: Rohit Sharma (captain), KL Rahul (vice-captain) Shubman Gill, Virat Kohli, Shreyas Iyer, Hanuma Vihari, Cheteshwar Pujara, Rishabh Pant (wk), KS Bharat (wk), Ravindra Jadeja, Ravichandran Ashwin, Shardul Thakur, Mohd Shami, Jasprit Bumrah, Mohd Siraj, Umesh Yadav, Prasidh Krishna. India's T20I squad: KL Rahul (Captain), Ruturaj Gaikwad, Ishan Kishan, Deepak Hooda, Shreyas Iyer, Rishabh Pant (vice-captain)(wk), Dinesh Karthik (wk), Hardik Pandya, Venkatesh Iyer, Yuzvendra Chahal, Kuldeep Yadav, Axar Patel, Ravi Bishnoi, Bhuvneshwar Kumar, Harshal Patel, Avesh Khan, Arshdeep Singh, Umran Malik.","pubDate":"2022-05-22 13:35:54","image_url":"https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/5/2022_5$largeimg_1892157932.JPG","source_id":"tribuneindia","country":["india"],"category":["sports"],"language":"english"},{"title":"India announce squads for South Africa T20Is and 5th Test against England","link":"https://www.business-standard.com/article/sports/india-announce-squads-for-south-africa-t20is-and-5th-test-against-england-122052200569_1.html","keywords":null,"creator":null,"video_url":null,"description":"Board of Control for Cricket in India on Sunday announced their squads for the T20I series against South Africa and for the lone 5th Test against England.","content":"India on Sunday announced their squads for the T20I series against South Africa and for the lone 5th Test against England. Senior pro Cheteshwar Pujara, who was dropped for India's last Test series against SriLanka has been picked by the All-India Senior Selection Committee in 17-member Test squad for the fifth rescheduled Test against England to be played at Edgbaston, Birmingham from July 1-5. However, Ajinkya Rahane is still not the part of the squad while Ravindra Jadeja who was ruled off the IPL 2022 due to injury has found a place in the Test squad. Meanwhile, the likes of Rohit Sharma, Virat Kohli, Mohd Shami, Jasprit Bumrah and others have rested for the T20I series against South Africa. All-rounder Hardik Pandya, who last played for India in the T20 World Cup has made a comeback.' India's Test squad: Rohit Sharma (Captain), KL Rahul (vice-captain) Shubman Gill, Virat Kohli, Shreyas Iyer, Hanuma Vihari, Cheteshwar Pujara, Rishabh Pant (wk), KS Bharat (wk), Ravindra Jadeja, Ravichandran Ashwin, Shardul Thakur, Mohd Shami, Jasprit Bumrah, Mohd Siraj, Umesh Yadav, Prasidh Kri'hna India's T20I squad: KL Rahul (Captain), Ruturaj Gaikwad, Ishan Kishan, Deepak Hooda, Shreyas Iyer, Rishabh Pant (vice-captain)(wk), Dinesh Karthik (wk), Hardik Pandya, Venkatesh Iyer, Yuzvendra Chahal, Kuldeep Yadav, Axar Patel, Ravi Bishnoi, Bhuvneshwar Kumar, Harshal Patel, Avesh Khan, Arshdeep Singh, Umran Malik--IANS avn/inj (Only the headline and picture of this report may have been reworked by the Business Standard staff; the rest of the content is auto-generated from a syndicated feed.)","pubDate":"2022-05-22 13:24:00","image_url":"https://bsmedia.business-standard.com/_media/bs/img/article/default/1220522/thumb-122052200569.jpg","source_id":"business-standard","country":["india"],"category":["sports"],"language":"english"},{"title":"Cricket-In-form Pujara back in India squad for England test","link":"https://www.thestar.com.my/sport/cricket/2022/05/22/cricket-in-form-pujara-back-in-india-squad-for-england-test","keywords":null,"creator":null,"video_url":null,"description":"NEW DELHI (Reuters) - Batsman Cheteshwar Pujara's red-hot form for Sussex earned him a place in the India squad on Sunday for the one-off test against England in July. Read full story","content":null,"pubDate":"2022-05-22 13:16:00","image_url":"https://apicms.thestar.com.my/uploads/images/2022/05/22/1594439.jpg","source_id":"thestar_my","country":["malaysia"],"category":["sports"],"language":"english"},{"title":"Mormon crickets: Why is Oregon trying to suppress them?","link":"https://www.deseret.com/faith/2022/5/22/23124320/mormon-crickets-oregon-suppression-program-how-to-apply","keywords":null,"creator":["Hanna Seariac"],"video_url":null,"description":null,"content":"A photo of a Mormon cricket captured on June 1, 2013.Jerry Friedman, Creative Commons Last year, Oregon reportedly suffered its worst outbreak of Mormon crickets in 50 years, causing devastation to a record 10 million acres of rangeland. The state has since announced the Mormon Cricket Suppression Program, with more than $4 million dedicated to stopping the spread of crickets. What’s the history of Mormon crickets?Mormon crickets take their name from pioneers who were members of The Church of Jesus Christ of Latter-day Saints. When pioneers settled in the Salt Lake area, these critters posed a serious threat to their crops. The critters almost entirely destroyed the Latter-day Saint pioneers’ fields, but a flock of seagulls swooped in and saved the crops. This event is known as “the miracle of the gulls” and occurred in 1848. Latter-day Saint pioneers entered the Salt Lake Valley in 1847 and were astonished by the size of the crickets. William Clayton commented, “The ground seems literally alive with very large black crickets crawling around up grass and bushes.” The crickets plagued the land from 1847 until the miracle of the gulls in 1848. Farmers are recorded to have “prayed and fought and fought and prayed” for the crickets to go away. When grasshoppers seemed to pose a threat to crops several years later, the Deseret News wrote in 1855, “As for the Saints we are perfectly aware that through faith and obedience they can prevail in the grasshopper war, at least as well as they did in the cricket war of 1848.”J. L. Townsend chronicled the victory of the Saints over the Mormon crickets in his poem:“Again, each morning they returned,/As if about the task concerned/Of clearing all the land so clean/That not a cricket could be seen./And to this day, the Saints believe/The seagulls came here to achieve/A rescue from impending woes.” What are Mormon crickets?While they have the name “Mormon cricket,” they are not true crickets. They are a shield backed katydid and reside in rangeland that is dominated by sagebrush. Mormon crickets have the capacity to destroy entire fields of small grains or alfalfa. Living mostly in the western United States, Mormon crickets cannot fly since they have no wings. They can travel up to a mile a day by climbing. Jeff Knight, a Nevada entomologist, told local Nevada news site 2 News, “It can be in a sorts, biblical. We get crickets, the high numbers are 20-25 per square yard when they’re larger. When they’re small, we’ll get several hundred per square yard.” Why is Oregon trying to suppress Mormon crickets?After the devastating impact of Mormon crickets on 10 million acres of rangeland in 18 different counties, Oregon is taking early steps to ensure that the same devastation from last year does not happen this summer, per Oregon station KTVZ.These bugs “can have appetites of biblical proportions” and state officials fear past Mormon cricket invasions, according to The Columbian.In anticipation of this, Oregon passed Senate Bill 5561 in response to the outbreak to set up resources to protect the land from these Mormon crickets. The state will reimburse applicants who own rangeland up to 75% of the cost of treatment. More information about Mormon crickets can be found on Oregon’s state website here.","pubDate":"2022-05-22 13:00:00","image_url":null,"source_id":"deseret","country":["united states of america"],"category":["sports"],"language":"english"},{"title":"IND vs ENG Test Team: Pujara makes return, Rahane and Saha fail to make cut; Know details","link":"https://www.indiatvnews.com/sports/cricket/ind-vs-eng-test-team-pujara-makes-return-rahane-and-saha-fail-to-make-cut-know-details-india-vs-england-test-match-2022-05-22-778484","keywords":null,"creator":null,"video_url":null,"description":"India is set to play one remaining test match against England from 1st to 5th July at Edgbaston. The team which will be led by Rohit Sharma will be seen a return of Chesteshwar Pujara after his praise worthy performance for Sussex in County Cricket. Ajinkya Rahane who was ruled out due to injury from IPL 2022 and star player Wriddhiman Saha have not made it to the team. Prasidh Krishna is set to debut for Indian test team.","content":"India is set to play one remaining test match against England from 1st to 5th July at Edgbaston. The team which will be led by will be seen a return of Chesteshwar Pujara after his praise worthy performance for Sussex in County Cricket. who was ruled out due to injury from 2022 and star player have not made it to the team. Prasidh Krishna is set to debut for Indian test team. Rohit Sharma (Capt), (VC), , , Shreyas Iyer, Hanuma Vihari, , Rishabh Pant (wk), KS Bharat (wk), R Jadeja, R Ashwin, Shardul Thakur, Mohd Shami, , Mohd Siraj, , Prasidh Krishna","pubDate":"2022-05-22 12:53:54","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"Rahul to lead; Hardik, Malik, Arshdeep in squad for SA T20Is - ESPNcricinfo","link":"https://news.google.com/__i/rss/rd/articles/CBMinAFodHRwczovL3d3dy5lc3BuY3JpY2luZm8uY29tL3N0b3J5L2luZC12cy1zYS10MjBpLXNlcmllcy0yMDIyLWtsLXJhaHVsLXRvLWxlYWQtaGFyZGlrLXBhbmR5YS11bXJhbi1tYWxpay1hcnNoZGVlcC1pbi12aXJhdC1rb2hsaS1yb2hpdC1zaGFybWEtcmVzdGVkLTEzMTYxNzHSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Rahul to lead; Hardik, Malik, Arshdeep in squad for SA T20Is  ESPNcricinfoThe Umran Malik dilemma for India selectors | Cricbuzz.com - Cricbuzz  CricbuzzIND vs SA: India's T20 Squad vs South Africa Announced, Umran Malik, Arshdeep Singh Get Maiden Call Ups, KL Rahul To Captain  Cricket AddictorBreaking new live updates: PM Modi interacts with Thomas cup and Uber Cup badminton champions  Times of IndiaUmran Malik, Arshdeep Singh earn maiden India call-up for South Africa T20Is | Cricbuzz.com - Cricbuzz  CricbuzzView Full coverage on Google News","content":null,"pubDate":"2022-05-22 12:30:34","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"IND vs SA: India's T20 Squad vs South Africa Announced, Umran Malik, Arshdeep Singh Get Maiden Call Ups, KL Rahul To Captain - Cricket Addictor","link":"https://news.google.com/__i/rss/rd/articles/CBMitAFodHRwczovL2NyaWNrZXRhZGRpY3Rvci5jb20vc291dGgtYWZyaWNhLXRvdXItb2YtaW5kaWEtMjAyMi9pbmQtdnMtc2EtaW5kaWFzLXQyMC1zcXVhZC12cy1zb3V0aC1hZnJpY2EtYW5ub3VuY2VkLXVtcmFuLW1hbGlrLWFyc2hkZWVwLXNpbmdoLWdldC1tYWlkZW4tY2FsbC11cHMta2wtcmFodWwtdG8tY2FwdGFpbi_SAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"IND vs SA: India's T20 Squad vs South Africa Announced, Umran Malik, Arshdeep Singh Get Maiden Call Ups, KL Rahul To Captain  Cricket AddictorUmran Malik, Arshdeep Singh earn maiden India call-up for South Africa T20Is | Cricbuzz.com - Cricbuzz  CricbuzzIndia Squad announced for SA, Rohit-Virat rested for T20Is; Rahane dropped for England Test  NEWS9 liveBreaking new live updates: PM Modi interacts with Thomas cup and Uber Cup badminton champions  Times of IndiaThe Umran Malik dilemma for India selectors | Cricbuzz.com - Cricbuzz  CricbuzzView Full coverage on Google News","content":null,"pubDate":"2022-05-22 12:23:39","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"SRH vs PBKS Live Score Updates, IPL 2022: Sunrisers Hyderabad takes on Punjab Kings in last league match; playing XI, toss at 7:00 PM","link":"https://sportstar.thehindu.com/cricket/ipl/ipl-news/srh-vs-pbks-live-score-sunrisers-hyderabad-punjab-kings-full-scorecard-ipl-2022-updates/article38496366.ece","keywords":null,"creator":["Team Sportstar"],"video_url":null,"description":"PBKS vs SRH Live Cricket Score, Tata IPL 2022, Match 70: Get the IPL score updates of today's IPL match between Punjab Kings and Sunrisers Hyderabad from the Wankhede Stadium in Mumbai.","content":"Hello and welcome to Sportstar's LIVE coverage of the IPL 2022 match between Sunrisers Hyderabad and Punjab Kings from the Wankhede Stadium in Mumbai. MATCH PREVIEW Punjab Kings and Sunrisers Hyderabad will engage in a dead rubber at the Wankhede Stadium here on Saturday. With both teams out of contention for IPL playoff spots, there is nothing more than pride at stake in this final group stage encounter of the season. Punjab (12 points) could have stayed in contention if not for a 17-run loss to Delhi Capitals in its previous outing. Mayank Agarwal and his men made heavy weather of a modest 160-run target set by DC, and exited the tournament. Mayank and head coach Anil Kumble will face tough questions on why the unit failed to make the cut despite possessing genuine match-winners like Jonny Bairstow, Shikhar Dhawan, Liam Livingstone, Kagiso Rabada and others. After a promising start to the campaign, it all went pear shaped for SRH in the latter stages. SRH lost five of its last six matches to undo all the good work put in. A close three-run win over Mumbai Indians on Tuesday proved to be too little too late. SRH VS PBKS FULL SQUADS Sunrisers Hyderabad: Kane Williamson (c), Umran Malik, Abdul Samad, Washington Sundar, Nicholas Pooran (wk), T Natarajan, Bhuvneshwar Kumar, Priyam Garg, Rahul Tripathi, Abhishek Sharma, Kartik Tyagi, Shreyas Gopal, Jagdeesha Suchith, Aiden Markram, Marco Jansen, Romario Shepherd, Sean Abbott, R Samarth, Shashank Singh, Saurabh Dubey, Vishnu Vinod (wk), Glenn Phillips (wk), Fazalhaq Farooqi. Punjab Kings: Mayank Agarwal (c), Arshdeep Singh, Shikhar Dhawan, Kagiso Rabada, Jonny Bairstow (wk), Rahul Chahar, Shahrukh Khan, Harpreet Brar, Prabhsimran Singh (wk), Jitesh Sharma (wk), Ishan Porel, Liam Livingstone, Odean Smith, Sandeep Sharma, Raj Angad Bawa, Rishi Dhawan, Prerak Mankad, Vaibhav Arora, Writtick Chatterjee, Baltej Dhanda, Ansh Patel, Nathan Ellis, Atharva Taide, Bhanuka Rajapaksa (wk), Benny Howell. WHERE AND WHEN TO WATCH SRH VS PBKS IPL 2022 LIVE?","pubDate":"2022-05-22 11:55:20","image_url":null,"source_id":"sportstar","country":["india"],"category":["sports"],"language":"english"},{"title":"Kashmiri youth becomes millionaire overnight, wins Rs 2 crore jackpot in Dream11","link":"https://www.orissapost.com/kashmiri-youth-becomes-millionaire-overnight-wins-rs-2-crore-jackpot-in-dream11/","keywords":["Feature","National","Sports","Dream11","jackpot","Kashmiri Youth"],"creator":["Post News Network"],"video_url":null,"description":"Srinagar: A youth from Jammu and Kashmir’s Anantnag district became a millionaire overnight by winning Rs 2 crore in the online fantasy cricket platform Dream11. Belonging to Shalgam village in the Bijbehara area of Anantnag district, Waseem Raja said he can now treat his ailing mother. “I was fast asleep on Saturday late night, when […]","content":"Srinagar: A youth from Jammu and Kashmir’s Anantnag district became a millionaire overnight by winning Rs 2 crore in the online fantasy cricket platform Dream11. Belonging to Shalgam village in the Bijbehara area of Anantnag district, Waseem Raja said he can now treat his ailing mother. “I was fast asleep on Saturday late night, when some friends called me and informed me that I was placed at first number in Dream 11,” Waseem said. He said that he had been trying his luck since the last two years by creating fantasy teams in the IPL. “Becoming a millionaire overnight is like a dream. This will help us to overcome poverty as we belong to financially weak family. My mother is ailing and now I will able to get her treated,” he said. Videos are viral on social media in which people can be seen congratulating Waseem Raja. There is a wave of happiness in Raja’s village with the news of him becoming the winner in Dream11. Dream11 is an Indian fantasy sports platform that allows users to play fantasy cricket, hockey, football, kabaddi, and basketball. In April 2019, Dream11 became the first Indian gaming company to become a unicorn.  ","pubDate":"2022-05-22 10:55:22","image_url":"https://www.orissapost.com/wp-content/uploads/2022/05/Dream11-225x300.jpg","source_id":"orissapost","country":["india"],"category":["sports"],"language":"english"},{"title":"SRH vs PBKS Dream11 IPL 2022: Fantasy Cricket Tips, Dream 11, Probable Playing XI for Hyderabad vs Punjab","link":"https://www.indiatvnews.com/sports/cricket/srh-vs-pbks-dream11-ipl-2022-fantasy-cricket-tips-dream-11-probable-playing-xi-for-sunrisers-hyderabad-vs-punjab-kings-2022-05-22-778456","keywords":null,"creator":null,"video_url":null,"description":"SRH vs PBKS Dream11 IPL 2022: Fantasy Cricket Tips, Dream 11, Probable Playing XI for Sunrisers Hyderabad vs Punjab Kings Match Details  Sunrisers Hyderabad vs Punjab Kings","content":null,"pubDate":"2022-05-22 10:36:27","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"'Thank you, Mumbai, we will remember this one': Virat Kohli after MI's win seals RCB's playoff berth","link":"https://www.tribuneindia.com/news/ipl-2022/thank-you-mumbai-we-will-remember-this-one-virat-kohli-after-mis-win-seals-rcbs-playoff-berth-397079","keywords":null,"creator":null,"video_url":null,"description":"Mumbai, May 22\"Thank you, Mumbai, we will remember this one,\" said Virat Kohli after Royal Challengers Bangalore sneeked into the playoffs following Mumbai Indians' thrilling five-wicket win over Delhi Capitals in their last game of the IPL here.On Saturday, MI chased down a victory target of 160 in 19.1 overs to knockout Delhi from the competition and paved the way for RCB's entry as the fourth and final team in the knockout stage.\"It was unbelievable. The emotions in the changing room were unbelievable. Thank you, Mumbai, we will remember this one,\" Kohli said in a release.RCB had defeated table-toppers Gujarat Titans by eight wickets in their final league match to keep their hopes alive for a playoff, which depended on the clash between DC and MI.Delhi needed to win the match to make it to the playoffs but they came a cropper against bottom-placed MI.RCB skipper Faf Du Plessis said the entire team watched the match together and was cheering each and every move made by the Mumbai team.\"It was so good, I think first of all it was really nice to see that everyone was here from the start of the game, so we watched it together,\" he said.\"We were all shouting for every wicket that Mumbai got and then when they are chasing every boundary. It's good for everyone to watch together and then the celebration towards the end was awesome to be a part of.\" RCB will now take on third-placed Lucknow Super Giants in the Eliminator at Edens Gardens on May 25.\"The last game we played we felt almost like we played our best game of cricket of this campaign so far and that is how you want to enter the knockout stages, so we needed someone to do us a favour and Mumbai did that for us, we are very thankful for that,\" Du Plessis said.\"Obviously now the work starts again, and we get our work mode back on.\" RCB has never ever won the IPL and allrounder Glenn Maxwell feels the team is very close to achieving that dream.\"Amazing result for us tonight. There is just one small step in us going further, we are that close to making history for RCB in this tournament. We needed another team, but from now on it's all us.\"","content":null,"pubDate":"2022-05-22 09:35:33","image_url":"https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/5/2022_5$largeimg_534325290.JPG","source_id":"tribuneindia","country":["india"],"category":["sports"],"language":"english"},{"title":"Matthew Mott risks it all to try being white-ball saviour for England’s men","link":"https://www.theguardian.com/sport/2022/may/22/matthew-mott-risks-it-all-to-try-being-white-ball-saviour-for-englands-men","keywords":["England cricket team","Cricket","Sport","Australia women's cricket team","Women's cricket"],"creator":["Geoff Lemon in Melbourne"],"video_url":null,"description":"Having built a winning juggernaut with the Australian women’s side, the coach must now repeat the trick all over again In some ways it seems strange for Matthew Mott to decide that this is the moment to move jobs. Since 2015 he has been building the Australian women’s cricket team into a canary-yellow juggernaut, bristling with firepower on every deck.Faster bowlers, bigger hitters, fitter fielders, better athletes: even as other countries have raised investment in the women’s game, Australia are further ahead of the pack than ever. They may still be basking in a recent 50-over World Cup win, but there are more international trophies to target very soon. Mott has helped create a dynastic power, one poised to dominate the next few years like never before. Continue reading...","content":"I n some ways it seems strange for Matthew Mott to decide that this is the moment to move jobs. Since 2015 he has been building the Australian women’s cricket team into a canary-yellow juggernaut, bristling with firepower on every deck. Faster bowlers, bigger hitters, fitter fielders, better athletes: even as other countries have raised investment in the women’s game, Australia are further ahead of the pack than ever. They may still be basking in a recent 50-over World Cup win , but there are more international trophies to target very soon. Mott has helped create a dynastic power, one poised to dominate the next few years like never before. McCullum brings appealing simplicity but English cricket has structural problems | Andy Bull Read more Coaching an England men’s team, even in a position that only covers limited-overs cricket, is a different prospect. A sport media culture fed on football manager stories will offer less goodwill, more causticity and a strong chance of a curtailed tenure. It is curious why this was the challenge that drew Mott’s interest. While plenty of coaches treat women’s sport as a career stepping stone to men’s equivalents, he never has. Mott did his apprenticeship in men’s first-class cricket at New South Wales and Glamorgan before winning the Australian job, where he signed three contracts while exceeding seven years in charge. He had comfortably the best job in women’s cricket and didn’t want the travel demands of all formats for a men’s team. It was only England splitting the job into separate white and red-ball coaches that won him over. For all that his international Eoin Morgan is impressive now, he needed patience at the start. His Australian team started in 2015 with an Ashes win in England, but in the next two years lost the final of the T20 World Cup, the semi-final of the 50-over World Cup and the last two matches of a home Ashes to turn a series lead into a tie. Given the relative strengths in women’s cricket, Australia saw winning as par. Mott could have been moved along. Instead he was allowed to reshape the team. He wanted to embolden players who he thought were great frontrunners but fumbled under rare instances of pressure. Mott as a player was solid and low-key, an opening bat who spent 10 Sheffield Shield seasons knocking out modest tallies of runs. As a coach he has a similar temperament, the quiet counsel for a phlegmatic captain like Meg Lanning, the pair a couple of steely eyed old timers, squinting against the glare while leaning on a fence rail and chewing a stalk of grass. Matthew Mott celebrates with Australia’s captain, Meg Lanning, and the wicketkeeper Alyssa Healy after beating England in the World Cup final. Photograph: Hannah Peters/Getty Images He creates a sense of calm around a team, but combines it with ambition for players more talented than he was. The wicketkeeper Alyssa Healy had a parlous batting record, but ability that Mott believed in. He told her she would open for an extended period and should attack without fear. She has since made thousands of runs and been the team’s big-stage performer. Beth Mooney was peripheral as Healy’s understudy, but has been trusted with increasingly important jobs and delivered repeatedly. Tahlia McGrath has had a similar run in recent times. At the same time, he has shown flexibility and a willingness to make difficult calls. At the turning point in 2017, Mott moved on from players who the game had caught up with and brought through a new generation from the domestic Big Bash League. A far stronger squad approach has followed, with options available for all conditions. Selections change accordingly. Ellyse Perry, Megan Schutt, Jess Jonassen, Ash Gardner, Amanda Wellington: players who would be all-format locks for any other team havebeen rested, rotated, recused or recessed. In the meantime, Australia have won three World Cups, dealt out two Ashes thrashings and in five years of 50-over matches have lost one out of 39. So what can he do for England’s men? All of the above. Take a setup that is better than most and streamline it. Set high ambitions with a plan for achieving them. Demand that a team with claims to superiority delivers on the promise. England have been used to winning but also require transition. The champions of 2019 are up against the clock: Jason Roy, Jonny Bairstow, Moeen Ali, Jos Buttler, Adil Rashid. Spanning formats will stretch Ben Stokes and Joe Root thin. Jofra Archer and Mark Wood can’t avoid injury . Eoin Morgan is hanging on by his fingernails, surely no longer than the T20 World Cup later this year. Mott’s job is to go beyond one group of players who have been good for one generation, turning them into a winning culture that transcends personnel. The Spin: sign up and get our weekly cricket email. His four-year contract says that England’s administrators are thinking in the longer term and Mott’s own history says that he doesn’t mind sticking around for an extended period. The only person who this might not suit is Morgan, the captain who until recently looked most likely to graduate to the job himself when he retired as a player. But the situation has changed. If Mott can do with his new job something approaching what he did with his previous one, it will be a hell of a spectacle for everyone. If he can’t, he might end up wistfully watching the fireworks that the Australian women’s players keep shooting into the sky.","pubDate":"2022-05-22 07:00:41","image_url":"https://i.guim.co.uk/img/media/d65e1d684dc53f5a39235d0d672b1cd4c33acd64/0_0_3858_2315/master/3858.jpg?width=460&quality=85&auto=format&fit=max&s=2f770f6f423a4b717ad3b1e34a2144e3","source_id":"theguardian","country":["united kingdom","india","singapore","canada"],"category":["sports"],"language":"english"},{"title":"Hayden, Gavaskar feel Tripathi, Varma could be in squad for South Africa T20Is","link":"https://www.sentinelassam.com/sports/cricket/hayden-gavaskar-feel-tripathi-varma-could-be-in-squad-for-south-africa-t20is-593155","keywords":["Sports,Cricket"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"Rohit Sharma rightly mentioned that he could be an all-format player for India","content":"Apart from the young Indian bowlers making a splash in IPL 2022 , the batters haven't been behind. Mumbai Indians may have had a forgettable campaign but they unearthed a bright spot in teenage batter Tilak Varma . Just like Mumbai, Sunrisers Hyderabad didn't enjoy the best of times in the tournament but saw Rahul Tripathi being consistent and hard-hitting with his stroke-play. The Hyderabad-based Varma has been Mumbai's leading run-getter in the tournament, making 376 runs in 13 matches at an average of 37.60 and strike rate of 131.46. Likewise, Tripathi has been Hyderabad's highest run-scorer in IPL 2022, making 393 runs in 13 matches at an average of 39.30 and a strike rate of 161.72. With the sheen of IPL 2022 set to make way for India's resumption of the road to Men's T20 World Cup in Australia later this year, the five-match home T20I series against South Africa from June 9 to 19 becomes extremely important in deciding the combinations. India are already on a 13-match winning streak in the format and would look to extend that against the Proteas. Legendary India batter Sunil Gavaskar, while giving his opinion on Cricket Live show on Star Sports, thinks Varma, who played in the 2020 Men's U19 World Cup, could be an all-format India cricketer and a call-up to the series against South Africa might be the start of it. \"Tilak Varma has got the basics right. With all the right basics you've got to marry the temperament and that marriage we have seen is very good at the moment (in the case of Tilak Varma). I hope that he carries on.\" \"Rohit Sharma rightly mentioned that he could be an all-format player for India. So now it's up to him to work that little bit extra, get his fitness going, get a little tighter as far as the technique is concerned and prove Rohit right.\" Former Australia cricketer Matthew Hayden opined that Tripathi has it in him to be a member of the Indian team not just for the South Africa series but for the World Cup as well. \"I just love his ability to go hard upfront. The way Tripathi is taking the responsibility to strike the ball hard is brilliant. I think he has the real potential in the future to go all the way to the international level.\" \"He's a dangerous striker of the ball, someone who plays on both sides of the wicket. His ability to play short-pitched balls at ease impresses me in particular.\" IANS Also Read: Mbappe to stay at PSG as Real Madrid withdraw offer Also Watch:","pubDate":"2022-05-22 06:59:06","image_url":"https://assets.sentinelassam.com/h-upload/2022/05/22/348428-da9bb65384d8479554e5200854f29828-pjvmfa-400x300.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"Indian men's compound team clinch Gold","link":"https://www.sentinelassam.com/sports-news/indian-mens-compound-team-clinch-gold-593150","keywords":["Sports"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"The three medals on Saturday took India’s final tally at the stage 2 of the Archery World Cup 2022 to five.","content":"The Indian mens compound team of Abhishek Verma , Rajat Chauhan and Aman Saini defeated France to win the gold medal at the Archery World Cup 2022 stage 2, here on Saturday. India came back from behind to outscore the French team of Quentin Baraer, Jean Phillipe Boulch and Adrien Gontier 232-230 for the gold medal. This was the Indian trio's second straight World Cup gold after clinching the top spot in Stage 1 in Antalya, Turkey. Interestingly, France were on the losing side then as well. Meanwhile, former Asian champion Abhishek Verma also won the compound mixed team bronze with Avneet Kaur. The Indian pair beat Turkey's Emircan Haney and Ayse Suzer 156-155 in the third-place play-off. India had the opportunity to add another gold to their tally but Mohan Bhardwaj fell short in the individual men's compound final, going down to top seed Mike Schloesser. Mohan, who was 42nd after the qualification round, lost 141-149 in the decider. The three medals on Saturday took India's final tally at the stage 2 of the Archery World Cup 2022 to five. Earlier, women's compound team comprising Avneet Kaur, Muskan Kirar and Priya Gurjar and the women's recurve team of Ridhi, Komalika Bari and Ankita Bhakat had won a bronze each. However, India's individual recurve archers failed to get on the podium. Jayanta Talukdar was the only one to reach the top eight in the men's recurve. IANS Also Read: State Cricket Academy inducts 31 cricketers Also Watch:","pubDate":"2022-05-22 06:41:07","image_url":"https://assets.sentinelassam.com/h-upload/2022/05/22/348418-jpg.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"State Cricket Academy inducts 31 cricketers","link":"https://www.sentinelassam.com/north-east-india-news/local-sports/state-cricket-academy-inducts-31-cricketers-593146","keywords":["Sports,Local Sports"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"During the residential programme, the young players will be nurtured and groomed to become valuable assets of Assam in the years to ensue","content":"31 young cricketers today inducted into the highly ambitious and result-oriented residential programme of State Cricket Academy (SCA), Assam under the aegis of Assam Cricket Association . These 31 players, who are within the age bracket of 13-15 years, were selected through open trials conducted by SCA, Assam in the month of April, 2022 in various parts of the State. During the residential programme, the young players will be nurtured and groomed to become valuable assets of Assam in the years to ensue. Moreover, all major expenses of the players including their coaching, accommodation, and education will be borne by SCA until they attain the age of 18. The induction ceremony, held today at the Conference Hall of ACA Stadium, Barsapara, Guwahati was attended by Romen Dutta, President, Assam Cricket Association; Devajit Saikia, Secretary, Assam Cricket Association; Rajinder Singh, Chairman, SCA, Assam and Ganesh Dutt Chugh, Technical Director, SCA, Assam. Speaking at the event, Romen Dutta termed the SCA Residential Programme exceptional, and asserted that the programme would prove to be highly instrumental in finding quality players to represent Assam. He later interacted with the budding players, and wished them luck. Devajit Saikia, Secretary, Assam Cricket Association, in his address, held that the SCA Residential Programme was nothing short of revolutionary in nature, and was a major initiative of Assam Cricket Association in its relentless endeavour to develop the game of Cricket and cricketers. Also Read: City closes in on sixth title; Champions League spot up for grabs Also Watch:","pubDate":"2022-05-22 06:23:04","image_url":"https://assets.sentinelassam.com/h-upload/2022/05/22/348412-cricket-bat-ball.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"MI beat DC, RCB qualify for play-offs","link":"https://www.sentinelassam.com/sports/cricket/mi-beat-dc-rcb-qualify-for-play-offs-593141","keywords":["Sports,Cricket"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"Royal Challengers Bangalore joined Gujarat Titans, Rajasthan Royals, and Lucknow Super Giants in the playoffs.","content":"Clinical batting by Ishan Kishan (48), Dewald Brevis (37) and a brilliant 11-ball 34 by Tim David helped Mumbai Indians beat Delhi Capitals by five wickets and deny the Rishabh Pant-led side a place in the playoffs. In a match that they have to win to qualify for the playoffs, Delhi Capitals were asked to bat first by Mumbai Indians skipper Rohit Sharma on a pitch that offered bounce to the seamers and turn to spinners, here on Saturday. They got off to a poor stand (31/3), recovered in the middle overs but slumped towards the end again as they ended with a below-par score of 159/7 in 20 overs thanks mainly to Rovman Powell (43) and Rishabh Pant (39), who rescued the team with a 75-run partnership for the fifth wicket. Chasing 160 to win, Mumbai rode on crucial knocks by Kishan, Brevis, and David as they reached 160/5 in 19.1 overs to record their fourth win and end on eight points, the same as Chennai Super Kings but were placed last in the table on net run rate. Delhi Capitals slumped to their seventh defeat in 14 matches, finishing with 14 points, and fifth place in the table. But they had themselves to blame as they succumbed to nerves and some good bowling by Jasprit Bumrah as they got a sub-par score. Royal Challengers Bangalore joined Gujarat Titans, Rajasthan Royals, and Lucknow Super Giants in the playoffs. With the pitch still offering something to the bowlers, Delhi had their chances and did manage to put Mumbai in a spot of bother, but poor effort in the field and some good batting by Ishan Kishan (48 off 35 balls, 4x3, 6x4), Dewald Brevis (37) and Tim David (34) helped them. Ishan Kishan was the more aggressive of the Mumbai Indian openers as he struck two fours and a six in Anrich Nortje in the second over. But Rohit Sharma failed to click in the last match for Mumbai Indians as he got out for 2, caught by Shardul Thakur off Nortje. Kishan and Dewald Brevis added 51 runs for the second wicket before Kishan got out, David Warner pocketing a skier off a ball going leg-side. Kishan struck 48 off 36 deliveries, hitting three fours and four sixes in the process. He hit Shardul Thakur, Kuldeep Yadav anbd Axar Patel to a six apiece before getting out two short of a half-century. Brevis, the South African U-19 player who came into the playing XI in place of Tristian Stubbs, ?blasted three sixes during his 33-ball 37 and added 50 runs for the fourth wicket with Tim David but was bowled by Shardul Thakur as Delhi tried to claw their way back into the match. Brief scores: Delhi Capitals 159/7 in 20 overs (Rishabh Pant 39, Rovman Powell 43, Axar Patel 19 ?not out; Jasprit Bumrah 3/25, Ramandeep Singh 2/29) ?lost to Mumbai Indians ?160/5 in 19.1 overs (Ishan Kishan 48, Dewald Brevis 37, Tim David 34, Tilak Varma 21; Shardul Thakur 2/31, Anrich Nortje 2/37) by 5 wickets. IANS Also Read: Pietersen gives thumbs down to county cricket, blames it for England's Test woes Also Watch:","pubDate":"2022-05-22 06:14:35","image_url":"https://assets.sentinelassam.com/h-upload/2022/05/22/348404-1935582-mi.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"}]}