{"newsArray":[{"title":"Aus v West Indies 2nd T20I highlights","link":"https://www.cairnspost.com.au/sport/cricket/aus-v-west-indies-2nd-t20i-highlights/video/db8ff814729f910dce5db40ff3e3fdbf","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket: Catch all the action from the second T20I as Australia looked to wrap up the series against the West Indies.","content":"Cricket: Catch all the action from the second T20I as Australia looked to wrap up the series against the West Indies.","pubDate":"2022-10-07 22:18:27","image_url":null,"source_id":"cairnspost","country":["australia"],"category":["sports"],"language":"english"},{"title":"T20 World Cup: Bumrah, Jadeja’s absence opens opportunity to unearth new champions, says Shastri","link":"https://kashmirreader.com/2022/10/08/t20-world-cup-bumrah-jadejas-absence-opens-opportunity-to-unearth-new-champions-says-shastri/","keywords":["SPORTS"],"creator":["Press Trust of India"],"video_url":null,"description":"CHENNAI: Former India coach Ravi Shastri feels the absence of Jasprit Bumrah and Ravindra Jadeja at the T20 World Cup will affect the team but it also opens up an opportunity to “unearth a new champion”. Both Bumrah and Jadeja will miss the showpiece event Down Under later this month owing to injuries. While Jadeja […]","content":"CHENNAI: Former India coach Ravi Shastri feels the absence of Jasprit Bumrah and Ravindra Jadeja at the T20 World Cup will affect the team but it also opens up an opportunity to “unearth a new champion”. Both Bumrah and Jadeja will miss the showpiece event Down Under later this month owing to injuries. While Jadeja was ruled out due to a knee injury, a back injury has put Bumrah out of contention for the World Cup, dealing a major blow to India’s chances at the marquee event. “Bumrah not being there, Jadeja not being there – it hampers the side – but it’s an opportunity to unearth a new champion,” Shastri said at the launch of Coaching Beyond, his new initiative with B Arun and R Sridhar. “(Bumrah’s injury) is unfortunate. There’s so much cricket being played, and people get injured. He is injured, but it’s an opportunity for somebody else. There is nothing you can do with injury,” he added. While a replacement for Bumrah has not been named yet, head coach Rahul Dravid has indicated Mohammad Shami could replace his teammate if he gains full fitness after recovering from COVID-19. Shami, who is on the stand-by list for the ICC event alongside Deepak Chahar, hasn’t played competitive cricket since July and was forced to miss the six home games against Australia and South Africa after contracting COVID-19. But Shastri feels the veteran pacers success and experience in Australia will benefit India. “Precisely, his experience (in Australian conditions is his strength). India have been there a lot in the last six years and he has been an integral part of all those tours. So that experience (of having done well in Australia) counts.” The 60-year-old feels despite the injuries, the Indian team has enough depth to go deep into the tournament Down Under. “I think we have got enough strength and we have a good team. If you make it to the semi-finals, it could be anyone’s tournament. “So, the endeavour would be to start well, get to the semis, and then you have got enough strength to probably win the (World) Cup.” PTI Press Trust of Indiakashmirreader.com","pubDate":"2022-10-07 18:47:07","image_url":null,"source_id":"kashmirreader","country":["india"],"category":["sports"],"language":"english"},{"title":"THIS 1983 World Cup winner likely to replace Sourav Ganguly as BCCI President","link":"https://zeenews.india.com/cricket/roger-binny-likely-to-replace-sourav-ganguly-as-bcci-president-sources-2519192.html","keywords":null,"creator":null,"video_url":null,"description":"As per sources, Sourav Ganguly is likely going to become India's representative for the International Cricket Council Chairman's post.","content":"Former Indian cricketer and member of the 1983 World Cup winning team Roger Binny is likely to be the next BCCI President replacing Sourav Ganguly as per the sources in BCCI. Binny has previously served as a member of the BCCI selection committee. The former pacer Roger Binny is said to be the frontrunner to replace Ganguly as the BCCI president and Jay Shah is expected to continue as the BCCI secretary. Former India cricketer Roger Binny frontrunner to replace Sourav Ganguly as next BCCI President, official decision to be taken soon: Sources (file photos) pic.twitter.com/iOE52UYxCt — ANI (@ANI) October 7, 2022 Roger Binny's name appeared on the BCCI's Draft Electoral Rolls (put up on the BCCI website) for the October 18 elections and the Annual General Meeting as a representative of the Karnataka State Cricket Association (KSCA) on Thursday instead of KSCA secretary Santosh Menon. All these led to speculation of former seamer being the frontrunner for the post of BCCI President. As per sources, Sourav Ganguly is likely going to become India's representative for the International Cricket Council Chairman's post. The nominations can be filled on October 11 and 12, the scrutiny of the nominations will take place on October 13 and the candidates can withdraw their nominations latest by October 14. The elections will be held here on October 18.","pubDate":"2022-10-07 17:59:00","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"“90 percent pe hain”: Ramiz Raja opens up on Shaheen Afridi’s chances of playing IND vs PAK T20 World Cup match in Melbourne","link":"https://thesportsrush.com/cricket-news-90-percent-pe-hain-ramiz-raja-opens-up-on-shaheen-afridis-chances-of-playing-ind-vs-pak-t20-world-cup-match-in-melbourne/","keywords":["Cricket","MCG","ramiz raja","Shaheen Shah Afridi","T20 World Cup 2022"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Ramiz Raja opens up on Shaheen Afridi’s availability for the high-octane India-Pakistan clash during the T20 World Cup match at MCG. Pakistan Cricket Board (PCB) chief Ramiz Raja has come up with a massive update on Pakistan’s champion left-arm pacer Shaheen Afridi’s availability during the much anticipated India versus Pakistan T20 World Cup clash, set… The post “90 percent pe hain”: Ramiz Raja opens up on Shaheen Afridi’s chances of playing IND vs PAK T20 World Cup match in Melbourne appeared first on The SportsRush.","content":"Ramiz Raja opens up on Shaheen Afridi’s availability for the high-octane India-Pakistan clash during the T20 World Cup match at MCG. Pakistan Cricket Board (PCB) chief Ramiz Raja has come up with a massive update on Pakistan’s champion left-arm pacer Shaheen Afridi’s availability during the much anticipated India versus Pakistan T20 World Cup clash, set to take place on October 23, at the iconic Melbourne Cricket Ground (MCG). Shaheen’s chances of featuring in the clash is not only a massive talking point amongst the Pakistan Cricket fans, but also from the Indian team fans’ point of view as well, especially after Jasprit Bumrah was officially ruled out of the entire World Cup due to back injury a few days days ago. As for Shaheen, the left-arm pacer has been out of international Cricket action since he suffered a serious right knee injury during the Test series against Sri Lanka in July. Ramiz Raja opens up on Shaheen Afridi’s availability for IND-Pak T20 World Cup tie PCB chief Ramiz Raja, on Friday, during an interaction with ‘The Dawn’, claimed to have spoken to Shaheen Afridi, who has assured the former of a rather guaranteed participation against the World Cup tie against India, and the whole of the T20 World Cup in Australia. As per Raja, Afridi is, as of now 90% fit as per reports from the medical team, with Shaheen even going further to take the percentage number to 110, and assuring the PCB chief to even partake in the two practice matches ahead of the clash against India. “Shaheen se mere parso baat hui thi. Woh keh rahein hain ki bade arse me nehi huya hu. So progress bohit acha hai. Doctors ne videos bhijwayi hui he. 90 per cent pe hain. Wohi samajhte he ki woh fit he and battle ready honge (Had talked to Shaheen the day before. He remarked that injury as such has taken place after quite long, but the progress has been good. As per videos from the doctors, he is 90% fit as of now, and will be battle ready,)” remarked Ramiz Raja, as quoted by the media outlet Hindustan Times. For those unaware, Afridi was referred to London by PCB’s medical team, where he had undergone his rehab process after he failed to recover from his injury on time. The post “90 percent pe hain”: Ramiz Raja opens up on Shaheen Afridi’s chances of playing IND vs PAK T20 World Cup match in Melbourne appeared first on The SportsRush.","pubDate":"2022-10-07 17:43:46","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Pakistan holds women sports event despite opposition from clerics","link":"https://www.laprensalatina.com/pakistan-holds-women-sports-event-despite-opposition-from-clerics/","keywords":["Sports","EFE","PAKISTAN WOMEN"],"creator":["Online News Editor"],"video_url":null,"description":"Islamabad, Oct 7 (EFE).- Hundreds of female athletes in Pakistan’s conservative Gilgit Baltistan (GB) participated in their first-ever regional sports event amid tight security against strong opposition from conservative local clerics and religious organizations. The three-day sporting gala, which concluded Friday, was nearly canceled after local religious leaders accused the GB government of “spreading vulgarity” … The post Pakistan holds women sports event despite opposition from clerics appeared first on La Prensa Latina Media.","content":"Islamabad, Oct 7 (EFE).- Hundreds of female athletes in Pakistan’s conservative Gilgit Baltistan (GB) participated in their first-ever regional sports event amid tight security against strong opposition from conservative local clerics and religious organizations. The three-day sporting gala, which concluded Friday, was nearly canceled after local religious leaders accused the GB government of “spreading vulgarity” by organizing the sports event for women. However, the name of the event was changed from “GB Women’s Fair 2022” to “Women’s Meena Bazaar” (meaning ladies’ market), a day before it commenced. All men, including officials, were barred from entering Gilgit city’s Lalak Jan stadium, the venue for the event. GB Information Minister Fateh Ullah said more than 2,000 girls from different schools and colleges competed in seven sports disciplines, including cricket, football and hockey. “There are no healthy activities for the girls in the area so they are facing health issues like high blood pressure and others so the games are important for them,” he underlined. The government now plans to hold it every year, he added. “No man could enter the stadium because it was a ‘women only’ event keeping in view the local customs,” Ullah told EFE. The minister said women police were in charge of security inside the stadium, while regular security forces guarded it from outside, and the army was on standby for any contingency. “There were no direct threats but local clerics and religious organizations had opposed holding the event which could have lead to anything,” Ullah added. The minister revealed that conservative elements had come together to protest outside the stadium on the first day of the event, but local administration officials held talks with them to address their concerns. “We assured them that the event will be conducted in accordance with Islamic values and local customs.” The event also featured different food stalls and informational desks to spread awareness on environmental issues, climate change, mental and physical health, handicrafts and entrepreneurship. Social media users praised the regional government for holding the event successfully and not bowing down to the pressure from conservative elements. Noted journalists and civil society members shared pictures from the event and thanked the participants for making the country “proud.” Pakistani society remains oppressive towards women, especially in the most conservative rural areas, and feminist activism is often described as vulgar and is subject to attacks by extremists. EFE aa/sc","pubDate":"2022-10-07 17:00:02","image_url":null,"source_id":"laprensalatina","country":["cuba"],"category":["sports"],"language":"english"},{"title":"It shows the character of...: Pakistan women's cricket team's captain Bismah Maroof says THIS after win over India - Watch","link":"https://zeenews.india.com/cricket/india-women-vs-pakistan-women-asia-cup-2022-pakistan-womens-cricket-teams-captain-bismah-maroof-says-this-after-win-over-india-2519181.html","keywords":null,"creator":null,"video_url":null,"description":"Deepti Sharma bowled exceptionally and was the quick of the Indian bowlers as she bagged three wickets giving away just 27 runs. For Pakistan Nida Dar was the highest scorer while Bismah Maroof also contributed with 32 runs in 35 balls.","content":"Pakistan's captain Bismah Maroof appreciated her fielders for putting in effort and complimented the bowlers after the 13-run win against India in the Asia Cup on Friday. The Pakistani claimed that the fielding effort from her side was the difference in today's win as the team fielded wonderfully and took essential catches in the match to back the brilliant bowling from their bowlers today. _ _____ ____ ______ _ _ Watch the Pakistan players review the brilliant 13-run victory over India in the ACC #WomensAsiaCup2022 #BackOurGirls pic.twitter.com/ebQasMQPsJ — Pakistan Cricket (@TheRealPCB) October 7, 2022 \"I think bowlers need support from the fielders. Today, everyone was diving and putting in effort and that was the difference in the match today,\" said Maroof. She also complimented the team's character as they held their nerve in pressure situations to win the match. \"It shows the character of our team, we didn't assess the conditions well. We wanted to execute our plans well and that paid for us today,\" said the Pakistani captain. Maroof talked about the team's strategy going forward in the match and said, \"We were thinking about our team so that we can execute our plans well. Thinking of putting good score so that our bowlers could defend it because the bowlers have been bowling beautifully in the tournament. We just wanted our batters to apply well.\" When asked about her all-important partnership with Nida Dar after Pakistan lost quick wickets, she said that the duo was looking to play to their strengths and back their abilities to ensure a partnership. \"We were talking about making a partnership and to take calculative risks. Nida knew she could hit big and she backed herself. That's what we were talking about in the middle,\" explained the winning captain. Nida Dar's unbeaten innings of 56 powered Pakistan to a decent total of 137/6 against India at the Sylhet International Cricket Stadium on Friday in the ongoing Asia Cup clash. Deepti Sharma bowled exceptionally and was the quick of the Indian bowlers as she bagged three wickets giving away just 27 runs. For Pakistan Nida Dar was the highest scorer while Bismah Maroof also contributed with 32 runs in 35 balls. Pakistan captain Bismah Maroof won the toss and opted to bat first in the match. The team made two changes, leaving out Kainat Imtiaz and Diana Baig for left-arm spinner Sadia Iqbal and Aiman Anwer. India and Pakistan are now tied on points in the Asia cup with India taking the pole position based on net run rate.","pubDate":"2022-10-07 16:35:00","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"Warner and David set platform before Starc cleans up | Australia v West Indies 2022 - cricket.com.au","link":"https://news.google.com/__i/rss/rd/articles/CBMiK2h0dHBzOi8vd3d3LnlvdXR1YmUuY29tL3dhdGNoP3Y9NUtyZXF3SGo1Q3PSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Warner and David set platform before Starc cleans up | Australia v West Indies 2022  cricket.com.auSmith's T20 World Cup hopes hang by a thread as 'incredible' David shines again  ESPNcricinfoDavid, Warner and Starc script Australia's 2-0 sweep | Cricbuzz.com - Cricbuzz  Cricbuzz'Never seen a shot like it': Smith on Mayers six | Alinta News Wrap  cricket.com.auRecent Match Report - Australia vs West Indies 2nd T20I 2022/23  ESPNcricinfoView Full coverage on Google News","content":null,"pubDate":"2022-10-07 15:30:00","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"AUS vs WI: Warner, David were the 'difference,' says Finch after Australia seal series 2-0","link":"https://www.thehansindia.com/sports/cricket/aus-vs-wi-warner-david-were-the-difference-says-finch-after-australia-seal-series-2-0-764503","keywords":["Sports,Cricket"],"creator":["Ishka"],"video_url":null,"description":"Australia defeated West Indies by 31 runs in 2nd T20I on FridayDavid Warner was MoM for scoring 75 off 41Australia are scheduled to next take on England in 3 T20Is","content":"Australia defeated West Indies by 31 runs in 2nd T20I on FridayAustralia defeated West Indies by 31 runs in 2nd T20I on FridayAaron Finch heaped praise on David Warner and Tim David after Australia defeated West Indies in the second T20I on Friday and sealed the series 2-0. Finch said Warner and David were \"the difference in the game,\" which Australia won by 31 runs at the Gabba, Brisbane. Warner, who was named the Player of the Match, struck 10 fours and three sixes in his knock of 41-ball 75, while David his three sixes and four fours in his knock of 42 off 20 deliveries. In reply to Australia's 178 for 7, West Indies were restricted at 147 for 8 in 20 overs. Mitchell Starc was the best of the lot for the hosts as he picked up 4 for 20 in his quota of four overs. Pat Cummins bagged two wickets, while Adam Zamp and Cameron Green claimed a scalp each. \"The difference in the game was Davey and Tim David with the bat on a wicket that had its challenges. You are always learning, there is a method to everything that we do and it is not just you who come out and change something on that particular day. There will be challenges (in the England series), few guys are flying out, few guys are staying behind and it is about managing ourselves before the World Cup,\" said Finch in the post-match presentation. After losing the T20I series in India 2-1, Australia bounced back with a clean sweep victory of 2-0 at home over West Indies. Finch and Co have one more series lined up, a three-match T20I series against England, before the beginning of the T20 World Cup. The event will be played Down Under and will begin on Oct. 16. After the game on Friday, Warner hailed Green, saying the all-rounder will have a \"big impact in the future.\"\"It was a fantastic all-round performance. Well executed by the bowlers, they bowled a nice line and length. I had a good little break and looking forward to going to Perth. A little bit like myself when I first started, he's (Green) going to have a big impact in the future,\" said Warner.What a shot from David Warner, total class. pic.twitter.com/NJFNQIXb2e— Johns. (@CricCrazyJohns) October 7, 2022 Australia, who will directly compete in the Super 12s, are a part of Group 1 at the T20 World Cup 2022, along with Afghanistan, England, and New Zealand. Meanwhile, West Indies are going to play in the Group stage first, and to qualify for the Super 12, they will have to win the battle in Group B or finish as runners up.AUS vs WI: Our batsmen 'did not convert starts,' says Nicholas PooranWest Indies skipper Nicholas Pooran said that his batters \"did not convert\" their starts but he also believes that his side will be ready by the time of the group stage of the T20 World Cup. \"Tough to lose. They played better cricket than us. Our bowlers did well to pull them back and keep them below 180. The batsmen got starts but did not convert and we lost wickets in the middle overs. An important week coming up for us. As a group, we are understanding how to play in these conditions and are playing like a team. By the time of the World Cup Qualifiers we will be ready,\" said Pooran.Australia will be in action again on Sunday (Oct. 9) when they take on England in the first T20I at Perth Stadium.","pubDate":"2022-10-07 14:10:35","image_url":"https://assets.thehansindia.com/h-upload/2022/10/07/500x300_1315352-aus-vs-wi.jpg","source_id":"thehansindia","country":["india"],"category":["sports"],"language":"english"},{"title":"Harbhajan Singh alleges corruption in Punjab Cricket Association; writes detailed letter to CM Bhagwant Mann","link":"https://www.indiatvnews.com/sports/cricket/harbhajan-singh-alleges-corruption-in-punjab-cricket-association-writes-detailed-letter-to-cm-bhagwant-mann-2022-10-07-814487","keywords":null,"creator":null,"video_url":null,"description":"Veteran Indian cricketer and Punjab Cricket Association's Chief Advisor Harbhajan Singh has written a letter to the association alleging the presence of illegal activities by office-bearers.","content":"Veteran Indian cricketer and Punjab Cricket Association's Chief Advisor Harbhajan Singh has written a letter to the association alleging the presence of illegal activities by office-bearers. The letter has been sent to CM Bhagwant Mann and Arvind Kejriwal. He, however, hasn't mentioned the names of the office-bearers. \"The crux of the matter is PCA is trying hard to induct 150 members with voting rights to tilt the balance in their favour and these inductions are being done without the assent of apex council/general body or without consulting the Chief Advisor (Singh),\" he wrote in his letter. Harbhajan added that the above-mentioned activities are against the BCCI constitution and the guidelines of PCA. \"Therefore, these are against the BCCI constitution, guidelines of PCA and violations of transparency and ethical norms of the sports bodies. To hide their illegal activities, they are not organising formal meetings of the PCA and are taking all decisions suo moto which serve their selfish motives,\" he wrote. In conversation with PTI, Harbhajan alleged that he has been receiving these complaints for 10-15 days and he has been kept in the dark about many policy decisions. When asked about his letter, Harbhajan told PTI, \"I have been receiving complaints for a good 10-15 days about how the top functionary is going about its job. I have been appointed chief advisor and has been repeatedly kept in the dark about many policy decisions. He ended by saying that the concerned defaulters have already taken subscription amounts from 60-70 people. \"Today, I was told that they have already taken membership subscription amounts from 60- to 70 people. The process needs to be stopped immediately. I had no option but to individually write to the members and also inform the Chief Minister.\" Harbhajan Singh is one of the most decorated Indian cricketers and his letter holds immense weight. It will be interesting to see how the authorities react to his letter.","pubDate":"2022-10-07 13:59:39","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"2nd ODI IND vs SA: JSCA International Stadium Complex Ranchi matches all result list","link":"https://thesportsrush.com/cricket-news-2nd-odi-ind-vs-sa-jsca-international-stadium-complex-ranchi-matches-all-result-list/","keywords":["Cricket","India","ranchi","Ranchi Stadium","South Africa","South Africa tour of India 2022"],"creator":["Dixit Bhargav"],"video_url":null,"description":"JSCA International Stadium Complex Ranchi matches: International cricket will return to Ranchi after almost 11 months. India and South Africa have reached Ranchi for the second of the ongoing three-match ODI series. Players landing in the city were confirmed after some of them uploaded photos across their respective social media handles. Having last hosted an… The post 2nd ODI IND vs SA: JSCA International Stadium Complex Ranchi matches all result list appeared first on The SportsRush.","content":"India and South Africa have reached Ranchi for the second of the ongoing three-match ODI series. Players landing in the city were confirmed after some of them uploaded photos across their respective social media handles. Having last hosted an international match in the form of an India-New Zealand T20I right after the ICC T20 World Cup last year, JSCA International Stadium Complex will be hosting an ODI after more than three and a half years. The last ODI at this venue was played between India and Australia in March 2019. Although India had ended up losing the match by 32 runs, it is fondly remembered for former India captain Mahendra Singh Dhoni playing his last international match in India, that too at this home ground. ☀️🏊 — Shubman Gill (@ShubmanGill) After on the eve of the match at his residence, it was Dhoni who had to his teammates before the match as the Indian team wore them as a tribute for the martyred soldiers of Pulwama attack earlier that year. From first hosting an international match in 2013, Ranchi has hosted a total of five ODIs. By virtue of being the hosts, India have played all these matches winning and losing on a couple of occasions each. With India not winning a Ranchi ODI in almost last eight years now, it is high time that they return to winning ways at this venue. A victory on Sunday will not just prevent a third consecutive ODI loss here but also prevent the home team from losing the series after having lost the first ODI in Lucknow yesterday.","pubDate":"2022-10-07 13:46:52","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Harbhajan Singh writes to PCA members, alleges illegal activities by office-bearers","link":"https://www.tribuneindia.com/news/sports/harabhajan-singh-writes-to-pca-members-alleges-illegal-activities-by-office-bearers-439075","keywords":null,"creator":null,"video_url":null,"description":"Mohali, October 7 Former India cricketer Harbhajan Singh, who is Punjab Cricket Association's chief adviser, has alleged that \"illegal activities\" are being carried out by certain office-bearers in the state body. Harbhajan, though, didn't mention the name of the office-bearers in his letter, which was sent to PCA members and district units of the body. Harbhajan, also a Rajya Sabha MP, also sent a detailed letter about \"malpractices\" by the current regime to CM Bhagwant Mann and Aam Aadmi Party's national convenor and Delhi CM Arvind Kejriwal. \"The crux of the matter is PCA is trying hard to induct 150 members with voting rights to tilt the balance in their favour and these inductions are being done without assent of apex council/general body or without consulting the Chief Advisor (Singh),\" he wrote in his letter . \"Therefore, these are against BCCI constitution, guidelines of PCA and violations of transparency and ethical norms of the sports bodies. \"To hide their illegal activities, they are not organising formal meetings of the PCA and are taking all decisions suo moto which serve their selfish motives,\" he further wrote. When asked about his letter, Harbhajan told PTI, \"I have been receiving complaints for a good 10-15 days about how the top functionary is going about its job. I have been appointed chief advisor and has been repeatedly kept in the dark about many policy decisions. \"Today, I was told that they have already taken membership subscription amount from 60- to 70 people. The process needs to be stopped immediately. I had no option but to individually write to the members and also inform the Chief Minister.\"","content":"PTI Mohali, October 7 Former India cricketer Harbhajan Singh, who is Punjab Cricket Association’s chief adviser, has alleged that “illegal activities” are being carried out by certain office-bearers in the state body. Harbhajan, though, didn’t mention the name of the office-bearers in his letter, which was sent to PCA members and district units of the body. Harbhajan, also a Rajya Sabha MP, also sent a detailed letter about “malpractices” by the current regime to CM Bhagwant Mann and Aam Aadmi Party’s national convenor and Delhi CM Arvind Kejriwal. “The crux of the matter is PCA is trying hard to induct 150 members with voting rights to tilt the balance in their favour and these inductions are being done without assent of apex council/general body or without consulting the Chief Advisor (Singh),” he wrote in his letter . “Therefore, these are against BCCI constitution, guidelines of PCA and violations of transparency and ethical norms of the sports bodies. “To hide their illegal activities, they are not organising formal meetings of the PCA and are taking all decisions suo moto which serve their selfish motives,” he further wrote. When asked about his letter, Harbhajan told PTI, “I have been receiving complaints for a good 10-15 days about how the top functionary is going about its job. I have been appointed chief advisor and has been repeatedly kept in the dark about many policy decisions. “Today, I was told that they have already taken membership subscription amount from 60- to 70 people. The process needs to be stopped immediately. I had no option but to individually write to the members and also inform the Chief Minister.”","pubDate":"2022-10-07 13:40:06","image_url":"https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/10/2022_10$largeimg_950058694.jpg","source_id":"tribuneindia","country":["india"],"category":["sports"],"language":"english"},{"title":"Blame game in Indian women's cricket team, Harmanpreet Kaur says THIS after defeat against Pakistan - Check","link":"https://zeenews.india.com/cricket/india-women-vs-pakistan-women-asia-cup-2022-blame-game-in-indian-womens-cricket-team-harmanpreet-kaur-says-this-after-defeat-against-pakistan-2519115.html","keywords":null,"creator":null,"video_url":null,"description":"India now have less than 24 hours to regroup and make a turnaround against hosts and defending champions Bangladesh, a side they lost to in the 2018 Women's Asia Cup final.","content":null,"pubDate":"2022-10-07 13:17:00","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"TNCA to host Bangladesh Cricket Board XI at Chepauk for two four-day games, three one-dayers","link":"https://sportstar.thehindu.com/cricket/domestic/tnca-vs-bcb-xi-schedule-tamil-nadu-cricket-association-bangladesh-cricket-board-chepauk-chennai-bcci-sports-ministy/article65980807.ece","keywords":null,"creator":["\n        Shayan Acharya  \n    "],"video_url":null,"description":"According to the original schedule, two four-day matches are scheduled to be played between October 12 and 22. It will be followed by three one-dayers on October 27, 29, and 31, respectively.","content":null,"pubDate":"2022-10-07 12:57:58","image_url":null,"source_id":"sportstar","country":["india"],"category":["sports"],"language":"english"},{"title":"Smith's T20 World Cup hopes hang by a thread as 'incredible' David shines again - ESPNcricinfo","link":"https://news.google.com/__i/rss/rd/articles/CBMikgFodHRwczovL3d3dy5lc3BuY3JpY2luZm8uY29tL3N0b3J5L2F1cy12cy13aS0ybmQtdDIwaS0yMDIyLTIzLXN0ZXZlbi1zbWl0aHMtdDIwLXdvcmxkLWN1cC1ob3Blcy1oYW5nLWJ5LWEtdGhyZWFkLWFzLXRpbS1kYXZpZC1zaGluZXMtYWdhaW4tMTMzODczNdIBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Smith's T20 World Cup hopes hang by a thread as 'incredible' David shines again  ESPNcricinfoWest Indies seek top-order runs, series parity | Cricbuzz.com - Cricbuzz  Cricbuzz'Never seen a shot like it': Smith on Mayers six | Alinta News Wrap  cricket.com.auRecent Match Report - Australia vs West Indies 2nd T20I 2022/23  ESPNcricinfoAUS vs WI, 2nd T20I: David Warner, Mitchell Starc Star as Australia Beat West Indies by 31 Runs  News18View Full coverage on Google News","content":null,"pubDate":"2022-10-07 12:56:15","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Harbhajan Singh alleges illegal activities by Punjab Cricket Association chief, writes strongly-worded letter","link":"https://www.indiatoday.in/sports/cricket/story/harbhajan-singh-punjab-cricket-illegal-activities-bcci-2009482-2022-10-07?utm_source=rss","keywords":null,"creator":null,"video_url":null,"description":"Harbhajan Singh alleges illegal activities by Punjab Cricket Association chief","content":null,"pubDate":"2022-10-07 12:55:57","image_url":null,"source_id":"indiatoday","country":["india"],"category":["sports"],"language":"english"},{"title":"IND W vs BAN W pitch report: Sylhet International Cricket Stadium pitch report batting or bowling","link":"https://thesportsrush.com/cricket-news-ind-w-vs-ban-w-pitch-report-sylhet-international-cricket-stadium-pitch-report-batting-or-bowling/","keywords":["Cricket","Women's Asia Cup 2022"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"IND W vs BAN W pitch report: The SportsRush brings you the pitch report of the Women’s Asia Cup match between India and Bangladesh. India Women will take on Bangladesh Women in the league game of the Women’s Asia Cup 2022 at the Sylhet International Ground in Sylhet. Both teams have played well in the… The post IND W vs BAN W pitch report: Sylhet International Cricket Stadium pitch report batting or bowling appeared first on The SportsRush.","content":"IND W vs BAN W pitch report: The SportsRush brings you the pitch report of the Women’s Asia Cup match between India and Bangladesh. India Women will take on Bangladesh Women in the league game of the Women’s Asia Cup 2022 at the Sylhet International Ground in Sylhet. Both teams have played well in the tournament so far, and they would want to stay in the top half of the table. After 3 successive wins, the Indian team lost their last match to their arch-rivals Pakistan. The batting of the side failed big time in the last match, where they made a lot of experiments. However, the hitting of Richa Ghosh at the end is a big positive for the side. Team India would want to get a win here. Bangladesh registered a massive win over the Malaysia side in the last match, and they would want to continue their good form. They have currently won two of their three games in the tournament so far and are currently at the 3rd position in the table. IND W vs BAN W pitch report The pitches in the Women’s Asia Cup 2022 have been heavily supporting the spinners, and the case remained the same at the Sylhet International Stadium as well. The initial 9 games were played on the outer oval, and the last four games have been played at the main stadium. Out of 4 games at the Sylhet International Stadium, the teams batting first have won three of them. The average 1st innings score has been just 122 runs. So, it is clear that batting has been really tough on this ground and batting first has been the mantra to win matches so far. With more matches being played at the same venue, the pitch won’t ease out in this match as well. The spinners will again dominate the proceedings on this slow & low track. It has been seen that the counter-attacking batters have been able to score runs here. Both captains may look to bat upon winning the toss. The post IND W vs BAN W pitch report: Sylhet International Cricket Stadium pitch report batting or bowling appeared first on The SportsRush.","pubDate":"2022-10-07 12:53:06","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"IND W vs BAN W T20 2022 records: India Women vs Bangladesh Women T20 head to head record","link":"https://thesportsrush.com/cricket-news-ind-w-vs-ban-w-t20-2022-records-india-women-vs-bangladesh-women-t20-head-to-head-record/","keywords":["Cricket","Bangladesh Women","India Women","Women's Asia Cup 2022"],"creator":["Dixit Bhargav"],"video_url":null,"description":"India Women vs Bangladesh Women T20 head to head: The SportsRush presents for you the Head to Head statistics for IND-W vs BAN-W T20I. India Women and Bangladesh Women will contest in Women’s Asia Cup 2022 Match 15 in Sylhet tomorrow. Having completed their fourth match of the tournament against Pakistan at the same venue… The post IND W vs BAN W T20 2022 records: India Women vs Bangladesh Women T20 head to head record appeared first on The SportsRush.","content":"India Women vs Bangladesh Women T20 head to head: The SportsRush presents for you the Head to Head statistics for IND-W vs BAN-W T20I. India Women and Bangladesh Women will contest in Women’s Asia Cup 2022 Match 15 in Sylhet tomorrow. Having completed their fourth match of the tournament against Pakistan at the same venue an hour ago, India will take the field for the second time in as many days. Table-toppers despite losing to Pakistan today, India have won three and lost one match thus far in the tournament. Bangladesh, on the other hand, are at the third position and have won two and lost one out of their three matches till now. For some strange reason, overall India vs Bangladesh T20I head-to-head record is quite similar to that of India vs Pakistan before today’s match. While Pakistan have defeated India in the shortest format after six and a half years, Bangladesh haven’t done so in over four years. Readers must note that India and Bangladesh will be facing each other for the first time since ICC Women’s T20 World Cup 2020. Their last T20I against each other had resulted in an 18-run Indian victory at the WACA over two and a half years ago. India Women vs Bangladesh Women T20 head to head record Total number of matches played: 12 Matches won by IND-W: 10 Matches won by BAN-W: 2 Matches played in Bangladesh: 4 (IND-W 4, BAN-W 0) Matches played in Asia: 11 (IND-W 9, BAN-W 2) Matches played at Sylhet International Cricket Stadium: 0 (IND-W 0, BAN-W 0) IND-W average score against BAN-W: 119 BAN-W average score against IND-W: 94 Most runs for IND-W: 284 (Harmanpreet Kaur) Most runs for BAN-W: 155 (Salma Khatun) Most wickets for IND-W: 2 (Rajeshwari Gayakwad and Harmanpreet Kaur) Most wickets for BAN-W: 11 (Salma Khatun) Most catches for IND-W: 4 (Harmanpreet Kaur) Most catches for BAN-W: 4 (Jahanara Alam) NOTE: Only players part of current squads have been considered above (most runs, wickets and catches). The post IND W vs BAN W T20 2022 records: India Women vs Bangladesh Women T20 head to head record appeared first on The SportsRush.","pubDate":"2022-10-07 12:52:41","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Cricket-Warner, Starc help Australia sweep T20 series v Windies","link":"https://www.channelnewsasia.com/sport/cricket-warner-starc-help-australia-sweep-t20-series-v-windies-2994986","keywords":null,"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2022-10-07 12:51:16","image_url":null,"source_id":"channelnewsasia","country":["singapore"],"category":["sports"],"language":"english"},{"title":"Harbhajan alleges illegal activities by Punjab Cricket Association president","link":"https://sportstar.thehindu.com/cricket/harbhajan-singh-punjab-cricket-association-pca-complaint-president-illegal-activity-gulzar-inder-chahal/article65980676.ece","keywords":null,"creator":["\n        Team Sportstar  \n    "],"video_url":null,"description":"Harbhajan said he has been receiving complaints from various stakeholders and cricket lovers.","content":null,"pubDate":"2022-10-07 12:30:53","image_url":null,"source_id":"sportstar","country":["india"],"category":["sports"],"language":"english"},{"title":"“Little bit like myself”: David Warner compares Cameron Green to himself; predicts big impact for him in future","link":"https://thesportsrush.com/cricket-news-little-bit-like-myself-david-warner-compares-cameron-green-to-himself-predicts-big-impact-for-him-in-future/","keywords":["Cricket","Cameron Green","David Warner","West Indies tour of Australia 2022"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"Australian opener David Warner has predicted a big future for Cameron Green and said that Green is a bit like himself. Australia white-washed West Indies by 2-0 in the 2-match T20I series by registering a brilliant 31-run victory in the 2nd T20I in Brisbane. A brilliant batting performance courtesy of David Warner and Tim David,… The post “Little bit like myself”: David Warner compares Cameron Green to himself; predicts big impact for him in future appeared first on The SportsRush.","content":"Australian opener David Warner has predicted a big future for Cameron Green and said that Green is a bit like himself. Australia white-washed West Indies by 2-0 in the 2-match T20I series by registering a brilliant 31-run victory in the 2nd T20I in Brisbane. A brilliant batting performance courtesy of David Warner and Tim David, followed by some excellent bowling performances helped the Aussies in registering a huge win. Australia managed to score 178 runs in the first innings courtesy of two ‘Davids’, David Warner and Tim David. Warner smashed 74 runs in 41 balls with the help of 10 boundaries and 3 sixes, whereas Tim David scored 42 runs in 20 balls. Both of them absolutely smashed the bowlers. ALSO READ: Tim David muscles Obed McCoy for a 110-metre six In reply, West Indies could only score 147 runs in their 20-over quota. Mitchell Starc scalped 4 wickets, and he got equal support from the rest of the bowlers as well. Johnson Charles finished as the highest run-scorer of the West Indies with 29 runs. David Warner compares Cameron Green to himself Australian opener David Warner won the Player of the Match trophy for his brilliant half-century in the match. Warner was at his very best, and he played some eye-pleasing shots during his innings. After winning the trophy, Warner said that the bowlers executed the plans really well, and it was a fantastic performance. Warner also predicted a brilliant future for the young all-rounder Cameron Green. He said that Green is a bit like him, and he will create a big impact in the future. Green got the opportunity to open in the absence of Warner in the India T20Is and now he has opened with Warner a couple of times. David Warner is Player of the Match and Player of the Series #AUSvWI pic.twitter.com/L5ZpSOWEEp — cricket.com.au (@cricketcomau) October 7, 2022 “It was a fantastic all-round performance. Well executed by the bowlers, they bowled a nice line and length,” David Warner said after winning the Player of the Match trophy to the broadcaster. “I had a good little break and looking forward to going to Perth. A little bit like myself when I first started, he’s (Green) going to have a big impact in the future.” Despite some brilliant performances, Aaron Finch has confirmed that Green won’t be added to the T20 World Cup squad if there is no injury concerns for the current players. The post “Little bit like myself”: David Warner compares Cameron Green to himself; predicts big impact for him in future appeared first on The SportsRush.","pubDate":"2022-10-07 12:25:32","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Super Starc inspires with ripping catch after rookie’s ‘baseball bat blast’ lifts Aussies - Fox Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMitAFodHRwczovL3d3dy5mb3hzcG9ydHMuY29tLmF1L2NyaWNrZXQvYXVzdHJhbGlhL2F1c3NpZXMtaW4tYW5vdGhlci1iYXR0aW5nLW9yZGVyLW1peHVwLWFzLXNtaXRoLXJldHVybnMtZmluY2gtc3RpbGwtbm90LW9wZW5pbmctdDIwaS1saXZlL25ld3Mtc3RvcnkvMDBlNTUxYzIxYTJmZmQ1NThmN2QwYWY1Yjg4YTQ1ZWTSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Super Starc inspires with ripping catch after rookie’s ‘baseball bat blast’ lifts Aussies  Fox SportsAustralia defeats West Indies by 31 runs in second T20 international  ABC News'Never seen a shot like it': Smith on Mayers six | Alinta News Wrap  cricket.com.auAussies ‘shooting themselves in the foot’ by ‘burning’ Smith ahead of T20 World Cup: Clarke  Fox SportsAustralia to lean on World Cup heroes as Cameron Green faces prospect of missing World Cup  Wide World of SportsView Full coverage on Google News","content":null,"pubDate":"2022-10-07 11:55:00","image_url":null,"source_id":"google","country":["australia"],"category":["sports"],"language":"english"},{"title":"IND-W vs PAK-W Women's Asia Cup T20 2022: PAK hand IND first loss of tournament; emerge victorious by 13 runs","link":"https://www.indiatvnews.com/sports/cricket/ind-w-vs-pak-w-women-s-asia-cup-t20-2022-pak-hand-ind-first-loss-of-tournament-emerge-victorious-by-13-runs-2022-10-07-814447","keywords":null,"creator":null,"video_url":null,"description":"IND-W vs PAK-W Women's Asia Cup T20 2022: The Pakistan women's cricket team on Friday handed India their first loss of the tournament as they defeated the women in blue by 13 runs. The Indian team lost wickets at regular intervals and fell short of the 138-run target at Sylhet International Cricket Stadium, Sylhet. For Pakistan, Nida Dar starred with a brilliant all-round show that won her then Player of the match award too.","content":null,"pubDate":"2022-10-07 11:40:52","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"Supergiants, who own INR 7,090 crore worth Lucknow IPL franchise, appoint Gautam Gambhir as Global Mentor","link":"https://thesportsrush.com/cricket-news-supergiants-who-own-inr-7090-crore-worth-lucknow-ipl-franchise-appoint-gautam-gambhir-as-global-mentor/","keywords":["Cricket","Gautam Gambhir","Lucknow Super Giants"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"INR 7,090 crore worth Lucknow IPL franchise have appointed Gautam Gambhir as the global mentor of Supergiants. Ahead of the IPL 2022, BCCI contested a bid to sell two new franchises where RPSG Group were the highest bidders, and they took the Lucknow franchise. Lucknow Super Giants became the most expensive franchise in the history… The post Supergiants, who own INR 7,090 crore worth Lucknow IPL franchise, appoint Gautam Gambhir as Global Mentor appeared first on The SportsRush.","content":"INR 7,090 crore worth Lucknow IPL franchise have appointed Gautam Gambhir as the global mentor of Supergiants. Ahead of the IPL 2022, BCCI contested a bid to sell two new franchises where RPSG Group were the highest bidders, and they took the Lucknow franchise. Lucknow Super Giants became the most expensive franchise in the history of the competition with a bid of INR 7090 crores. Lucknow Super Giants made it to the playoffs of the IPL in their very first season. The coaching staff of the side was full of some star names. Andy Flower was the head coach of the side, whereas Gautam Gambhir was the team’s mentor. Both of them are praised for their performances. The Super Giants family is now going global, and they have bought a team in the South Africa T20 League as well. Lance Klusener will be the head coach of Durban Super Giants, but Gautam Gambhir has been retained as the mentor of the squad. Supergiants appoint Gautam Gambhir as Global Mentor The Super Giants have confirmed that former Indian batter Gautam Gambhir will be the global mentor of the franchise. Gambhir has also thanked the franchise for showing faith in him and said that it’s a proud moment for him to see the Super Giants leave a global imprint. “As a Global mentor of Super Giants I look forward to some added responsibility. My intensity and passion to win have just got International wings,” Gautam Gambhir said. “It will be a proud moment to see the Super Giants family leave a global imprint. I thank the Super Giants family for showing that faith in me. Guess it’s time for some more sleepless nights.” Designations change, spirit remains the same. Let’s conquer the world Super Giants! Many thanks Dr.Goenka & entire RPSG family! @rpsggroup — Gautam Gambhir (@GautamGambhir) October 7, 2022 Gambhir knows how to win titles, KKR bought him in IPL 2011, and he won a couple of IPL titles with KKR in 2012 and 2014. He recently led the India Capitals in the Legends League Cricket 2022, and they also won the title. The post Supergiants, who own INR 7,090 crore worth Lucknow IPL franchise, appoint Gautam Gambhir as Global Mentor appeared first on The SportsRush.","pubDate":"2022-10-07 11:40:49","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Lance Klusener resigns as batting coach of Zimbabwe; Here's why","link":"https://www.indiatvnews.com/sports/cricket/lance-klusener-resigns-as-batting-coach-of-zimbabwe-cricket-here-s-why-2022-10-07-814443","keywords":null,"creator":null,"video_url":null,"description":"Zimbabwe's batting coach, Lance Klusener has resigned from his post, said Zimbabwe Cricket in a statement on Friday.","content":null,"pubDate":"2022-10-07 11:33:01","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"“We were trying to give chances to other batters”: Harmanpreet Kaur explains why she batted at Number 7 vs Pakistan in Asia Cup match","link":"https://thesportsrush.com/cricket-news-we-were-trying-to-give-chances-to-other-batters-harmanpreet-kaur-explains-why-she-batted-at-number-7-vs-pakistan-in-asia-cup-match/","keywords":["Cricket","Harmanpreet Kaur","India Women","Pakistan Women","Women's Asia Cup 2022"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Harmanpreet Kaur: The Indian captain’s decision to bat down the order backfired at the Sylhet International Cricket Stadium today. Pakistan Women have defeated India Women for the first time in six years in the shortest format. Only their third T20I win against India, a 13-run victory has come as the best response to critics after… The post “We were trying to give chances to other batters”: Harmanpreet Kaur explains why she batted at Number 7 vs Pakistan in Asia Cup match appeared first on The SportsRush.","content":"Harmanpreet Kaur: The Indian captain’s decision to bat down the order backfired at the Sylhet International Cricket Stadium today. Pakistan Women have defeated India Women for the first time in six years in the shortest format. Only their third T20I win against India, a 13-run victory has come as the best response to critics after Pakistan lost to Thailand yesterday. Chasing a 138-run target, India were bundled out for a disappointing 124 in 19.4 overs as unnecessary experimentation cost them a match against their arch-rivals. The biggest unwanted consequence of tinkering with their combination was observed in the form of captain Harmanpreet Kaur (12) batting as low as No. 7. With India failing to find any sort of momentum due to frequent fall of wickets, Kaur was expected to bat at her usual No. 4 position. Her absence in the middle amid a struggling batting order was perplexing, to say the least. Harmanpreet Kaur explains why she batted at Number 7 vs Pakistan in Asia Cup match Batting for the 121st time in this format, it was the first-ever instance of Kaur batting at No. 7. With India needing 73 runs to win off 47 balls upon her arrival in the 13th over, Kaur hit a solitary boundary at a strike rate of 100 before getting out in the 17th over at the Sylhet International Cricket Stadium today. Excellent spirit shown by team Pakistan against India. Very good team selection for the conditions, excellent batting by @CoolNidadar and brilliant team effort in the field. Well done team #pakvsind #AsiaCup — Sana Mir ثناء میر (@mir_sana05) October 7, 2022 Being asked about a personal demotion in the batting order during the post-match presentation ceremony, Kaur explained the reason behind doing the same. The 33-year old player didn’t hesitate from admitting that the move backfired for them. “In the middle, we were trying to give chances to other batters because you have to do that as the tournament goes on, but it backfired. It was a chaseable target. In the middle-overs, we were not able to take singles and rotate the strike. We played too many dot balls,” Kaur told the host broadcaster. The post “We were trying to give chances to other batters”: Harmanpreet Kaur explains why she batted at Number 7 vs Pakistan in Asia Cup match appeared first on The SportsRush.","pubDate":"2022-10-07 11:31:34","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Starc takes 'unbelievable' catch in World Cup tune-up","link":"https://wwos.nine.com.au/cricket/australia-v-west-indies-second-t20-match-mitchell-starc-catch-video-caught-and-bowled/c14ace4c-6e41-48d8-b0e4-1484aa0d0000","keywords":null,"creator":["wwos"],"video_url":null,"description":"Australian quick M﻿itchell Starc took a phenomenal catch in the second T20 against the West Indies at the Gabba.","content":"Mitchell Starc lodged an early contender for catch of the summer as Australia rounded out its T20 series against the West Indies 2-0 on Friday night, winning the second game by 31 runs . Steaming in bowling to Kyle Mayers in the first over of the West Indies' chase at the Gabba, Starc took an exceptional one-handed catch after the big-hitting opener cracked the ball back down the pitch. Despite the ball being on Starc's right side, the Australian quick﻿ snaffled the catch with his left hand, plucking it with incredibly quick reflexes. READ MORE: Munster reveals itch behind Storm commitment﻿ READ MORE: Cleary rejects 'harmless' Penrith jibes READ MORE: Deluge causes disaster for Supercars stars The catch dealt the West Indies an early blow in their pursuit of 179 runs to win.﻿ \"﻿What a catch from Mitchell Starc!\" Brendon Julian said on the Fox Cricket broadcast. \"That is unbelievable.\" Brad Haddin﻿ was stunned. \"That's very hard to do at six foot five﻿ on your follow-through,\" the former gloveman said. \"Look at that catch and (those) reflexes from Mitchell Starc ... outstanding piece of athleticism there.\" Mark Waugh, among Australia's greatest fielders in history﻿, had high praise. \"That's a classic catch if I've ever seen one.\" Starc was the best of Australia's bowlers on the night, taking 4-20 from four overs. David Warner had set up the victory with a knock of 75 runs from 41 balls, including 10 fours and three sixes.﻿ Tim David was another considerable contributor in an innings of 40 off 20, including four fours and three sixes, building his case for T20 World Cup selection. While Aaron Finch had batted at No.4 and compiled 58 from 53 in the first match of the series, the Australian skipper walked to the middle at No.3 on Friday night and only managed 15. Australia again experimented with Cameron Green at the top of the order, with the young all-rounder only mustering one run. The Australians are now set for a three-match T20 series against England, with the first game to be played in Perth and the final two in Canberra. Australia will meet New Zealand at the SCG on October 22 in its opening match of the T20 World Cup.﻿ For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here !","pubDate":"2022-10-07 11:13:45","image_url":"https://vms-network-images-prod.s3-ap-southeast-2.amazonaws.com/2022/10/459027/pickerimage.jpg","source_id":"nine","country":["australia"],"category":["sports"],"language":"english"},{"title":"Mitchell Starc takes 'unbelievable' catch in T20 tune-up against West Indies - Wide World of Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMimwFodHRwczovL3d3b3MubmluZS5jb20uYXUvY3JpY2tldC9hdXN0cmFsaWEtdi13ZXN0LWluZGllcy1zZWNvbmQtdDIwLW1hdGNoLW1pdGNoZWxsLXN0YXJjLWNhdGNoLXZpZGVvLWNhdWdodC1hbmQtYm93bGVkL2MxNGFjZTRjLTZlNDEtNDhkOC1iMGU0LTE0ODRhYTBkMDAwMNIBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Mitchell Starc takes 'unbelievable' catch in T20 tune-up against West Indies  Wide World of SportsAustralia defeats West Indies by 31 runs in second T20 international  ABC News'Never seen a shot like it': Smith on Mayers six | Alinta News Wrap  cricket.com.auSuper Starc inspires with ripping catch after rookie’s ‘baseball bat blast’ lifts Aussies  Fox SportsAustralia vs West Indies second T20 live scores, stats, results and commentary from Gabba  ABC NewsView Full coverage on Google News","content":null,"pubDate":"2022-10-07 11:09:51","image_url":null,"source_id":"google","country":["australia"],"category":["sports"],"language":"english"},{"title":"T20 World Cup: Rohit Sharma's Team India kick start 'Special Training Camp' at WACA Ground - Check Post","link":"https://zeenews.india.com/cricket/t20-world-cup-rohit-sharmas-team-india-kick-start-special-training-camp-at-waca-ground-check-post-2519056.html","keywords":null,"creator":null,"video_url":null,"description":"India play their first match on October 23 at the famous Melbourne Cricket Ground against arch-rivals Pakistan. This is the most crucial match for the Indian side as a defeat in it could put them in deep waters to qualify.","content":null,"pubDate":"2022-10-07 11:06:00","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"Pakistan Cricket Board (PCB) announces four-team women's league","link":"https://www.sentinelassam.com/sports/cricket/pakistan-cricket-board-pcb-announces-four-team-womens-league-616820","keywords":["Sports,Cricket"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"PCB announced the start of the inaugural women’s league, which will run alongside season eight of the Pakistan Super League (PSL)","content":"LAHORE: The Pakistan Cricket Board (PCB) on Thursday announced the start of the inaugural women's league, which will run alongside season eight of the Pakistan Super League (PSL) at the Pindi Cricket Stadium, Rawalpindi, from March 3-18 next year. \"I am delighted to announce the women's league. This league will attract young women cricketers to this great sport and help our current players further enhance their skills when they will get to share dug-outs with the overseas players. The league will feature present and past trailblazers in women's cricket in what promises to be an exciting 13-match event,\" said PCB Chairman Ramiz Raja in an official statement. The final of the inaugural women's league, set to join the world of women's T20 franchise cricket, will be a standalone fixture between the top-two sides following 12 league matches and will take place a day before the final of PSL's season eight. Some matches of the women's league will take place before season eight fixtures of PSL, which will be running from February 9 to March 19. \"To amplify the coverage and promotion of this initiative, some of the matches will precede the HBL Pakistan Super League 8 matches. \"This event is aligned to our strategy of making Pakistan a stronger cricket playing nation across all formats and genders. We are not only creating attractive brands to strengthen our cricket economy, but through this tournament are also providing career opportunities to our women cricketers,\" added Raja. In the inaugural women's league, four city-based sides, each comprising 12 local and six foreign players, will compete for the biggest prize in Pakistan women's domestic calendar on a double-league format. \"The more our women cricketers will participate in high-pressure events, the more they will learn. The PCB is a strong proponent of empowering women to shine brighter. By engaging our women, which form 49 per cent of the country's population, we will enhance the economic and social prosperity of our country,\" concluded Raja. IANS Also Read: West Indies allrounder Rahkeem Cornwall hammers 205 off 77 balls in Atlanta Open T20 Also Watch:","pubDate":"2022-10-07 11:03:20","image_url":"https://assets.sentinelassam.com/h-upload/2022/10/07/398823-gettyimages-1386821150.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"“What a catch by Mitchell Starc”: Mitchell Starc grabs blinder to dismiss Kyle Mayers in Brisbane T20I","link":"https://thesportsrush.com/what-a-catch-by-mitchell-starc-mitchell-starc-grabs-blinder-to-dismiss-kyle-mayers-in-brisbane-t20i/","keywords":["Cricket","Videos","Australia","Kyle Mayers","Mitchell Starc","West Indies","West Indies tour of Australia 2022"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Mitchell Starc grabs blinder: The Australian spearhead put on display swift reflexes to pick his first wicket today. During the second T20I of West Indies’ tour of Australia 2022 in Brisbane, Australia have set West Indies a 179-run target after being asked to bat first by visiting captain Nicholas Pooran. Opening batter David Warner emerged… The post “What a catch by Mitchell Starc”: Mitchell Starc grabs blinder to dismiss Kyle Mayers in Brisbane T20I appeared first on The SportsRush.","content":"Mitchell Starc grabs blinder: The Australian spearhead put on display swift reflexes to pick his first wicket today. During the second T20I of West Indies’ tour of Australia 2022 in Brisbane, Australia have set West Indies a 179-run target after being asked to bat first by visiting captain Nicholas Pooran. Opening batter David Warner emerged as the pick of the Australian batters after top-scoring with his 75 (41) comprising of 10 fours and three sixes. Warner, who batted at a strike rate of 182.92, scored his 23rd T20I half-century, 11th under captain Aaron Finch (15), sixth at home and fifth against West Indies. Australia losing three wickets within 13 deliveries put them in a spot of bother in the middle overs before batter Tim David stitched a rescue act. Coming in to bat at No. 6 in the 13th over, David scored a counterattacking 42 (20) inclusive of four fours and three sixes at a strike rate of 210. West Indies new ball bowler Alzarri Joseph was their best bowler at the Gabba tonight on the back of bowling figures of 4-0-21-3. Other than Joseph, pacer Obed McCoy and all-rounder Odean Smith picked two and one wicket respectively. Mitchell Starc grabs blinder to dismiss Kyle Mayers Australia spearhead Mitchell Starc didn’t take a lot of time before drawing first blood in the second innings. It was only on the fifth ball that Starc bowled that he sent West Indies all-rounder Kyle Mayers (6) back to the pavilion. Wanting to hit a low full-toss down the ground, Mayers failed to time the ball in the best possible manner. As luck would have it, Mayers also found himself on the receiving end of a stunning fielding display. With the ball travelling at some speed, Starc practically had no time before bending down and catching the ball. However, the lanky pacer managed to do both with help of both his hands to highlight his swift reflexes. HOW?! Starc scoops up a classic caught and bowled to send Mayers packing! #AUSvWI pic.twitter.com/xMUT394zob — cricket.com.au (@cricketcomau) October 7, 2022 A 50-run second-wicket partnership between Johnson Charles and Brandon King has laid a foundation for West Indies but they will have to bat at their best to score at more than 10 runs per over in the last 12 overs. The post “What a catch by Mitchell Starc”: Mitchell Starc grabs blinder to dismiss Kyle Mayers in Brisbane T20I appeared first on The SportsRush.","pubDate":"2022-10-07 10:51:32","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"}]}