{"newsArray":[{"title":"David Warner slams CA for lack of help","link":"https://www.thetimesofbengal.com/sports/david-warner-slams-ca-for-lack-of-help/","keywords":["Sports"],"creator":["admin"],"video_url":null,"description":"David Warner on Saturday slammed Cricket Australia (CA) for his or her lack of help The post David Warner slams CA for lack of help appeared first on The Times of Bengal.","content":"David Warner on Saturday slammed Cricket Australia (CA) for his or her lack of help throughout his management ban enchantment, including that the difficulty affected his psychological well being forward of the primary Check in opposition to South Africa. Warner had been handed a lifetime management ban due to his position within the 2018 ball tempering scandal. The 36-year-old had launched an enchantment in opposition to the ban earlier this 12 months and each Warner and CA wished a closed-door listening to. Nonetheless, the board-appointed unbiased commissioners forcing Warner to withdraw his enchantment earlier this month. Additionally learn: Aussie Steve Smith backs David Warner to regain kind “Main into the Perth Check, my psychological well being most likely wasn’t the place I wanted it to be at to be 100 per cent,” Warned mentioned forward of his one hundredth Check. “If I had it my means we’d have had all of it sorted. From the CA viewpoint, I didn’t actually have any help. My teammates and the employees in our workforce had been completely wonderful, and my household and mates—they actually acquired me by that interval,” he added. This story has been sourced from a 3rd get together syndicated feed, companies. Mid-day accepts no accountability or legal responsibility for its dependability, trustworthiness, reliability and knowledge of the textual content. Mid-day administration/mid-day.com reserves the only real proper to change, delete or take away (with out discover) the content material in its absolute discretion for any motive in any respect Source link The post David Warner slams CA for lack of help appeared first on The Times of Bengal.","pubDate":"2022-12-25 03:55:29","image_url":null,"source_id":"the_tob","country":["india"],"category":["sports"],"language":"english"},{"title":"100th Test match – Warner creates a record","link":"https://thenewsglory.com/100th-test-match-warner-creates-a-record/","keywords":["Sports","100th Test match","Cricket","David Warner","Warner"],"creator":["The News Glory"],"video_url":null,"description":"Melbourne: Australian cricketer David Warner is waiting to make a record by playing 100th test match. The cricket test match between Australia and South Africa will begin on December 26 at the Melbourne Stadium. Test matches played on the day after Christmas Day are known as Boxing Day Tests. Accordingly, this Test also becomes a […]","content":"Melbourne: Australian cricketer David Warner is waiting to make a record by playing 100th test match. The cricket test match between Australia and South Africa will begin on December 26 at the Melbourne Stadium. Test matches played on the day after Christmas Day are known as Boxing Day Tests. Accordingly, this Test also becomes a Boxing Day Test match. This match will be the 100th Test for David Warner who has played 99 Tests so far. David Warner said in Melbourne, “I am happy that this will be my 100th Test match. Cricket Australia’s (CA) ban on me captaining Australia in Tests is still in place. The Cricket Australia organization should answer this,” he said. Warner has played 99 Tests so far and has accumulated 7,922 runs. This includes 24 cents and 34 half-cents.","pubDate":"2022-12-25 03:31:49","image_url":null,"source_id":"thenewsglory","country":["india"],"category":["sports"],"language":"english"},{"title":"India vs Bangladesh 2nd Take a look at Day 4 Dwell Cricket Rating Updates Commentary Highlights: India wants 100 runs","link":"https://www.thetimesofbengal.com/sports/india-vs-bangladesh-2nd-take-a-look-at-day-4-dwell-cricket-rating-updates-commentary-highlights-india-wants-100-runs/","keywords":["Sports"],"creator":["admin"],"video_url":null,"description":"To get the latest sports news updates, Subscribe to us. Source link The post India vs Bangladesh 2nd Take a look at Day 4 Dwell Cricket Rating Updates Commentary Highlights: India wants 100 runs appeared first on The Times of Bengal.","content":"To get the latest sports news updates, Subscribe to us. Source link The post India vs Bangladesh 2nd Take a look at Day 4 Dwell Cricket Rating Updates Commentary Highlights: India wants 100 runs appeared first on The Times of Bengal.","pubDate":"2022-12-25 03:31:32","image_url":null,"source_id":"the_tob","country":["india"],"category":["sports"],"language":"english"},{"title":"Sunil Gavaskar Questions India’s Slip Fielding Approach In 2nd Take a look at Towards Bangladesh As Virat Kohli Drops Catches | Cricket Information","link":"https://www.thetimesofbengal.com/sports/sunil-gavaskar-questions-indias-slip-fielding-approach-in-2nd-take-a-look-at-towards-bangladesh-as-virat-kohli-drops-catches-cricket-information/","keywords":["Sports"],"creator":["admin"],"video_url":null,"description":"The third day of the second Take a look at between India and Bangladesh was The post Sunil Gavaskar Questions India’s Slip Fielding Approach In 2nd Take a look at Towards Bangladesh As Virat Kohli Drops Catches | Cricket Information appeared first on The Times of Bengal.","content":"The third day of the second Take a look at between India and Bangladesh was witness to some poor fielding by Indian gamers on Saturday. Bangladesh set India a 145-run goal in Mirpur. Litton (73) top-scored for them because the hosts notched 231 within the second innings. Litton rode his luck in an innings the place he was dropped twice by Kohli – first off Axar Patel after which Ravichandran Ashwin. Each of them have been robust probabilities. He was stationed on the slips. Former India captain Sunil Gavaskar was in no way impressed with the slip-catching strategy of Staff India. Gavaskar stated whereas commentating for official broadcasters Sony Sports activities Community how Indians do not “crouch low for spinners. They stand too upright with arms on knees. It is stunning that their coach is Rahul Dravid, who might be the one Indian with greater than 200 catches and an ideal catcher…” The legendary batter was additionally not in favour of Axar Patel being despatched forward of Virat Kohli at No. 4. India have been tottering at 45/4 at stumps, whereas Kohli gone. “It would not ship good alerts to Kohli. To the world’s greatest batsman that you simply bat down. Except Kohli himself requested for it; then it is completely different matter. We do not know what occurred in change room. But it surely’s arduous to know. Axar has performed nicely, after all,” Gavaskar stated. “No matter left-hander or not, let Rishabh Pant come into bat subsequent tomorrow. Let this left-hand right-hand experiment cease.” India at present lead the two-match sequence in opposition to 1-0 after profitable the primary Take a look at comfortably. Featured Video Of The Day “It Feels Nice”: Indian Girls’s Hockey Staff Captain On Profitable FIH Nations Cup Trophy Matters talked about on this article Source link The post Sunil Gavaskar Questions India’s Slip Fielding Approach In 2nd Take a look at Towards Bangladesh As Virat Kohli Drops Catches | Cricket Information appeared first on The Times of Bengal.","pubDate":"2022-12-25 03:07:38","image_url":null,"source_id":"the_tob","country":["india"],"category":["sports"],"language":"english"},{"title":"Cricket-Australia&#039;s Boland retains spot for Boxing Day test","link":"https://www.thestar.com.my/sport/cricket/2022/12/25/cricket-australia039s-boland-retains-spot-for-boxing-day-test","keywords":null,"creator":null,"video_url":null,"description":"(Reuters) - Scott Boland will retain his spot in Australia's team for their Boxing Day test against South Africa in Melbourne after an \"underdone\" Josh Hazlewood failed to fully recover from a side strain, skipper Pat Cummins said on Sunday. Read full story","content":null,"pubDate":"2022-12-25 03:06:00","image_url":"https://apicms.thestar.com.my/uploads/images/2022/12/25/1876279.jpg","source_id":"thestar_my","country":["malaysia"],"category":["sports"],"language":"english"},{"title":"IND vs BAN | Kohli’s poor average – India struggling to avoid defeat","link":"https://thenewsglory.com/ind-vs-ban-kohlis-poor-average-india-struggling-to-avoid-defeat/","keywords":["Sports","Bangladesh","Bangladesh team","Goalie","India","Indian team","Test cricket"],"creator":["The News Glory"],"video_url":null,"description":"Mirpur: Team India is struggling to avoid defeat in the 2nd Cricket Test against Bangladesh. The Indian team, which played with a target of 145 runs to win, is stumbling by scoring 45 runs for the loss of 4 wickets. The Indian team is playing in one-day cricket series and test series after touring Bangladesh. […]","content":"Mirpur : Team India is struggling to avoid defeat in the 2nd Cricket Test against Bangladesh. The Indian team, which played with a target of 145 runs to win, is stumbling by scoring 45 runs for the loss of 4 wickets. The Indian team is playing in one-day cricket series and test series after touring Bangladesh. After losing the ODI series 1-2, the Indian team won the first Test. In this case, the 2nd Test started in Mirpur on 22nd. Batting first, Bangladesh were bowled out for 227 runs in the first innings. After this, the Indian team who played the first innings reached 314 runs with Rishabh Pant (93) and Shreyas Iyer (87) half-centuries. With this, the Indian team took a lead of 87 runs in the first innings. After playing the 2nd innings, Bangladesh scored 7 runs without losing a wicket at the end of the 2nd day. In this case, the 3rd day’s match was held yesterday. While opener Shando fell for 5 runs, another opener Zakir Hasan scored 51 runs. Axar Patel, Mohammad Siraj, Unadgad, Ashwin and Umesh Yadav kept Bangladesh wickets falling. Liton Das scored 73, Nurul Hasan scored 31 and Tashkin Ahmed added 31 runs. Bangladesh were bowled out for 231 runs as other players were bowled out by meager runs. On the Indian side, Axar Patel took 3 wickets, Siraj and Ashwin took 2 wickets each, Umesh Yadav and Unathkat took one wicket each. After that, the Indian team played with the target of winning if they score 145 runs. In the beginning Captain K.L. Rahul was dismissed by Bangladesh captain Shakib Al Hasan for 2 runs. Subman Gill 7, Cheteshwar Pujara 6 and Virat Kohli were out for one run before the Indian team recovered from the shock. Due to this, the Indian team lost 4 important wickets for 37 runs. At the end of the game, the Indian team scored 45 runs for the loss of 4 wickets and was struggling to avoid defeat. Axar Patel 26, Jayadev Unathgat 3 runs in the field. Cricket commentators say that it will be difficult for the Indian team to reach the target of 145 runs with 2 days left to play. India need only 100 more runs to win. In the 2nd innings, Mehdi Hasan took 3 wickets and Shakib took one wicket. Kohli’s Worst Average: Virat Kohli has worst average in Tests in 2022. He has averaged just 26.50 runs per innings this year. He averaged 19.33 runs in 2020, 22.44 runs in 2011 and 28.21 runs in 2021. From 2012 to 2019, he averaged more than 40 runs for 8 years in a row. His poor form this year has disappointed his fans. KL Rahul continues to stumble: KL Rahul, who has taken over as captain in the Test matches due to Rohit Sharma’s injury, continues his poor form as he is bowled out for 2 runs in the 2nd innings. In the last 6 innings he has scored runs at the rate of 12, 10, 22, 23, 10, 2.","pubDate":"2022-12-25 02:45:37","image_url":null,"source_id":"thenewsglory","country":["india"],"category":["sports"],"language":"english"},{"title":"India vs Bangladesh 2nd Take a look at, Day 4 Reside Updates: India Want 100 Runs To Win, Bangladesh Six Wickets | Cricket Information","link":"https://www.thetimesofbengal.com/sports/india-vs-bangladesh-2nd-take-a-look-at-day-4-reside-updates-india-want-100-runs-to-win-bangladesh-six-wickets-cricket-information/","keywords":["Sports"],"creator":["admin"],"video_url":null,"description":"India vs Bangladesh 2nd Take a look at Day 4 Reside: The second Take a The post India vs Bangladesh 2nd Take a look at, Day 4 Reside Updates: India Want 100 Runs To Win, Bangladesh Six Wickets | Cricket Information appeared first on The Times of Bengal.","content":"India vs Bangladesh 2nd Take a look at Day 4 Reside: The second Take a look at is poised for a tense end with India needing 100 runs to win and hosts Bangladesh needing six wickets. Bangladesh spinners, led by their talismanic skipper Shakib Al Hasan and younger Mehidy Hasan Miraz, compelled Indian batters to press the panic button in a difficult chase of 145 because the guests ended an attractive third day’s play, tottering at 45 for 4. In the event that they overhaul 145, it will likely be third highest profitable fourth innings chase at this floor as the highest three successful scores are 209, 205 and 103. Earlier, Bangladesh’s decrease middle-order, led by Litton Das (73 off 98 balls), counter-attacked to take their second innings rating to 231. (LIVE SCORECARD) India (Enjoying XI):KL Rahul(c), Shubman Gill, Cheteshwar Pujara, Virat Kohli, Rishabh Pant(w), Shreyas Iyer, Axar Patel, Ravichandran Ashwin, Jaydev Unadkat, Umesh Yadav, Mohammed Siraj Bangladesh (Enjoying XI):Najmul Hossain Shanto, Zakir Hasan, Mominul Haque, Litton Das, Mushfiqur Rahim, Shakib Al Hasan(c), Nurul Hasan(w), Mehidy Hasan Miraz, Taijul Islam, Khaled Ahmed, Taskin Ahmed Listed below are the LIVE updates of Day 4 of the 2nd Take a look at Match between India and Bangladesh straight from Shere Bangla Nationwide Stadium, in Mirpur Featured Video Of The Day IPL Public sale 2023: Sam Curran Turns into Most Costly Purchase As Groups Splash The Money Matters talked about on this article Source link The post India vs Bangladesh 2nd Take a look at, Day 4 Reside Updates: India Want 100 Runs To Win, Bangladesh Six Wickets | Cricket Information appeared first on The Times of Bengal.","pubDate":"2022-12-25 02:43:32","image_url":null,"source_id":"the_tob","country":["india"],"category":["sports"],"language":"english"},{"title":"Cummins confirms Boland’s inclusion for Boxing Day","link":"https://www.cairnspost.com.au/sport/cricket/cummins-confirms-bolands-inclusion-for-boxing-day/video/43de2c02c196875d2cd60ff4eff9cb8d","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket: Australia have confirmed Scott Boland will retain his spot in the playing XI ahead of an underdone Josh Hazlewood for the Boxing Day Test against South Africa.","content":null,"pubDate":"2022-12-25 01:27:21","image_url":null,"source_id":"cairnspost","country":["australia"],"category":["sports"],"language":"english"},{"title":"Proteas looking to prey on ‘mental demons’ during Boxing Day Test","link":"https://www.cairnspost.com.au/sport/cricket/proteas-looking-to-prey-on-mental-demons-during-boxing-day-test/video/8639a66654ed1398d257731e7237ea15","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket: South African captain Dean Elgar is hopeful that his side can exploit any mental demons lingering in Australia's batting lineup following their performance in the First Test.","content":null,"pubDate":"2022-12-25 01:27:20","image_url":null,"source_id":"cairnspost","country":["australia"],"category":["sports"],"language":"english"},{"title":"Cricket: India in trouble in second test against Bangladesh","link":"https://www.nzherald.co.nz/sport/cricket-india-in-trouble-in-second-test-against-bangladesh/CYFZOCWP3NB7FM34QXP2SKNYUI/","keywords":null,"creator":null,"video_url":null,"description":"Nobody expected India to be in trouble chasing 145 for victory.","content":"Off-spinner Mehidy Hasan Miraz claimed 3-12 on day three to boost Bangladesh’s chances of a stunning series-levelling win by reducing India to 45-4 as the touring team chased a victory target of 145 in the second cricket test. Promoted all-rounder Axar Patel was unbeaten on 26 for India, who won the first test by 188 runs, on a tricky, turning surface in Mirpur, while nightwatchman Jaydev Unadkat was three not out. Bangladesh have never beaten India in a test, losing 10 tests - all by comfortable margins - and drawing two, with this promising to be the tighest test yet between the two subcontinent nations. Four of the Indian top five were out for single figures after captain Shakib Al Hasan made the initial breakthrough by dismissing KL Rahul for two. Advertisement Advertise with NZME. Mehidy then got in on the act, having Cheteshwar Pujara stumped for six. Mehidy also had Shubman Gill stumped by Nurul Hasan for seven before removing talisman Virat Kohli for one as he was caught at short leg. ”The wicket is difficult but if one of the batters can play a long innings we can win,” India paceman Mohammed Siraj said, with India still favourites to knock off the 100 further runs required, but in a slightly perilous position few expected going into the chase. Advertisement Advertise with NZME. ”Axar looks positive. We hope he will carry on and then we have Shreyas Iyer and Rishabh Pant who are in form.” Earlier, Liton Das hit 73 and Zakir Hasan, playing in his second test, made 51 as Bangladesh were bowled out for 231 in their second innings. Liton was dropped twice by Kohli, who also spilled a chance off Nurul (31). Liton put on 46 with Nurul and 60 with Taskin Ahmed, who scored 31 not out, after Bangladesh had been reduced to 113-6. After resuming on 7-0, Bangladesh made a poor start to the day when off-spinner Ravichandran Ashwin trapped opener Najmul Hossain lbw for five. Advertisement Advertise with NZME. But Liton and Zakir held the innings together as left-arm spinner Axar worked his way through the batting order with 3-68. ”It’s important to win the game and draw the series,” Liton said. “We know batting in the fourth innings is always tougher on this wicket so we are confident of winning. They still need 100 runs and things won’t be easy. If we can take two wickets early it will be our game.” - AP Save share Share this article facebook copy link twitter linkedin reddit email","pubDate":"2022-12-25 00:05:00","image_url":"https://www.nzherald.co.nz/resizer/861gaUsZA6SFAbVFVmCs5FlIE_4=/300x300/smart/filters:quality(70)/cloudfront-ap-southeast-2.images.arcpublishing.com/nzme/UN42SJNNEJAUVGM5Z3QVTQXLV4.JPG","source_id":"nzherald","country":["new zealand"],"category":["sports"],"language":"english"},{"title":"India vs Bangladesh: Mehidy Hasan, Litton Das bring hosts back in the game as Kohli, Rahul flop","link":"https://www.firstpost.com/photos/india-vs-bangladesh-mehidy-hasan-litton-das-bring-hosts-back-in-the-game-as-kohli-rahul-flop-11869131.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"India vs Bangladesh: Mehidy Hasan, Litton Das bring hosts back in the game as Kohli, Rahul flop","content":"Photos India vs Bangladesh: Mehidy Hasan, Litton Das bring hosts back in the game as Kohli, Rahul flop India ended day 3 on 45/4 as Mehidy Hasan picked three big wickets, including Virat Kohli. FirstCricket Staff December 25, 2022 02:17:15 IST 1 /7 Mehidy Hasan Miraz (right) was the wrecker-in-chief on Saturday as the spinner took three crucial wickets to leave Bangladesh struggling at 45/4 while chasing a paltry 145 on a deteriorating Mirpur surface on Day 3 of India vs Bangladesh 2nd Test. AP 2 /7 Earlier in the morning, Zakir Hasan scored a half-century top of the order to take Bangladesh past 100 runs but wickets kept tumbling at the other end. By the time Zakir departed at 51, the hosts were 102/5. AP 3 /7 It appeared to be a meek surrender from the rest of the Bangladesh top-order as they were 113/6. AP 4 /7 Litton Das, however, scored a crucial 73 and stitched important stands with Nurul Hasan (31) and Taskin Ahmed (31) to take Bangladesh to a crucial 231 while leaving India 145 to chase. AP 5 /7 India never looked in the hunt as chasing 145 looked massive with early wickets. Stand-in captain KL Rahul was disappointing with a 2-run innings as Bangladesh counterpart Shakib Al Hasan removed him. AFP 6 /7 Cheteshwar Pujara (6) and Shubman Gill (7) suffered similar dismissals as Mehidy Hasan took the game to the Indian top-order. AFP 7 /7 Mehidy did further damage as he claimed the prize scalp of Virat Kohli (1) but the bowler’s wild celebration didn’t please the Indian batter, who had a few things to say to Bangladeshi before walking back to the pavilion. AFP","pubDate":"2022-12-24 20:49:18","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/12/Mehidy-Hasan-India-vs-Bangladesh-2nd-Test.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Cricket: Neil Wagner and Black Caps ready to break drought in first test against Pakistan","link":"https://www.nzherald.co.nz/sport/cricket-neil-wagner-and-black-caps-ready-to-break-drought-in-first-test-against-pakistan/M3NAQC62JZGQ5GEKNX5DMVO5AY/","keywords":null,"creator":null,"video_url":null,"description":"After a period of terror, dashed hopes and frustrations, New Zealand are back in Pakistan.","content":"The last time New Zealand played a test match in Pakistan, Inzamam-ul-Haq scored a triple ton before Shoaib Akhtar took 6-11 as the tourists were dismissed for 73. Five days after Pakistan completed an innings-and-324-run victory, a suicide bomber killed 14 people near the Karachi hotel hosting the Black Caps and the tour was abruptly abandoned. Tomorrow, 20 years since their hasty trip home, New Zealand have returned to don the whites in Pakistan for the 22nd time, resolving a period of terror, caution, dashed hopes and frustrations. The first of two long-awaited tests is set to begin at the National Stadium in Karachi, while the second test has been moved from Multan to Karachi, and been brought forward a day to January 2 due to deteriorating weather conditions. But tomorrow, cricket will once more take focus and the Black Caps will aim to fare a bit better than Stephen Fleming’s side managed two decades ago. The nations have since contested 17 tests, 11 in New Zealand and six in the United Arab Emirates, for eight years Pakistan’s international-cricket outpost following a 2009 attack on the Sri Lankan team. The Black Caps were the last test side welcomed to the UAE - when the tourists claimed a 2-1 series victory in 2018 - and last year almost ended their absence in Pakistan. A last-minute security alert from the New Zealand government, however, saw the players depart the eve of the first ODI, prompting a mixed reaction from their opponents. But finally, New Zealand will tomorrow become the fifth team to again play test cricket in the country, a privilege and challenge that Neil Wagner is embracing. Advertisement Advertise with NZME. “We were very warmly welcomed,” Wagner said. “Pakistan is a pretty proud nation, and coming here you see the excitement on all their faces to have test cricket again. “It’s obviously different to come over here - it’s everyone’s first time playing in Pakistan. There were a few guys who were here on the previous tour that didn’t take place, and they got some experience training on the wickets in the conditions over here, but everything is pretty new to us. “It’s an exciting challenge to play in conditions you don’t always get.” The home side will head into the test somewhat better prepared for those conditions, having played on the same field earlier this week. Unfortunately for Pakistan, that action came as England completed a historic series sweep, so any advantage would be limited. Wagner and his Black Caps teammates, on the other hand, have not sent down a red ball in anger since June - when their own 3-0 defeat by England concluded - forming a prolonged spell on the sidelines for the test specialist. “Pakistan have had a couple of hit outs here against England so they’ll be well prepared,” Wagner said. “For us, it’s just exciting to play test cricket again. “We’ve played a couple of games domestically back home, but it’s been a while off. We weren’t playing too much cricket over the winter, so it’s about getting the body right. “It’s been nice playing with Northern Districts and getting some results with the team there, but it’s nice to be back with the lads and see everyone’s faces again after a while away.” Advertisement Advertise with NZME. Wagner will likely join new skipper Tim Southee and Matt Henry in a three-pronged pace attack tomorrow, supplemented by Ajaz Patel and either the part-time pace of Daryl Mitchell or spin of Michael Bracewell or Glenn Phillips. England’s initiative on docile pitches produced three results in this month’s series and, against a depleted Pakistan side, the onus will be on the Black Caps to do likewise. It’s luck for the visitors, then, they have just the man to call if aggression is required. “It’s not an easy place to come as a fast bowler,” Wagner said. “When there’s not a lot on offer for seamers, it’s a different sort of role. “If it is running in and banging it in short and creating pressure that way, or if it’s bowling long overs to make the spinners effective - whichever way it’s exciting to get the nod and try to play a role.” Save share Share this article Reminder, this is a Premium article and requires a subscription to read. facebook copy link twitter linkedin reddit email","pubDate":"2022-12-24 20:30:00","image_url":"https://www.nzherald.co.nz/resizer/4pxszQtIHabmJ278B8xzzRrYHeo=/300x300/smart/filters:quality(70)/cloudfront-ap-southeast-2.images.arcpublishing.com/nzme/STQZSB4WQFGNLK5IAYVN2HFZHA.jpg","source_id":"nzherald","country":["new zealand"],"category":["sports"],"language":"english"},{"title":"Bangladesh vs India Live Cricket Score, Quick Scorecard and Summary - Hindustan Times","link":"https://news.google.com/__i/rss/rd/articles/CBMiaGh0dHBzOi8vd3d3LmhpbmR1c3RhbnRpbWVzLmNvbS9jcmlja2V0L2xpdmUtc2NvcmVjYXJkLWJhbmdsYWRlc2gtdnMtaW5kaWEtbGl2ZS1zY29yZS1iYWluMTIyMjIwMjIyMTgzMjUv0gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Bangladesh vs India Live Cricket Score, Quick Scorecard and Summary  Hindustan TimesCricbuzz Chatter: 2nd Test, Day 3: Can #India still win the match vs #Bangladesh?  CricbuzzLIVE Score India vs Bangladesh, 2nd Test, Dhaka: BAN On Top After IND Lose 4 Wickets  Cricket Country NewsPHOTOS: Mirpur Test set for a thrilling finish  Rediff.comBangladesh chasing stunning test victory with India on 45-4  The Associated Press - en EspañolView Full coverage on Google News","content":null,"pubDate":"2022-12-24 20:22:01","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"India stare at defeat as Bangladesh spinners get into action","link":"https://kashmirreader.com/2022/12/25/india-stare-at-defeat-as-bangladesh-spinners-get-into-action/","keywords":["SPORTS"],"creator":["Press Trust of India"],"video_url":null,"description":"Mirpur: Bangladesh spinners, led by their talismanic skipper Shakib Al Hasan and young Mehidy Hasan Miraz, forced Indian batters to press the panic button in a tricky chase of 145 as the visitors ended an engaging third day’s play, tottering at 45 for 4 in the second Test here on Saturday. Having dominated for the […]","content":"Mirpur: Bangladesh spinners, led by their talismanic skipper Shakib Al Hasan and young Mehidy Hasan Miraz, forced Indian batters to press the panic button in a tricky chase of 145 as the visitors ended an engaging third day’s play, tottering at 45 for 4 in the second Test here on Saturday. Having dominated for the better part of two and half days, Bangladesh’s lower middle-order, led by Litton Das (73 off 98 balls) and supported by Nurul Hasan Sohan (31 off 29 balls) and Taskin Ahmed (31 off 46 balls), counter-attacked to take their second innings score to 231, giving their bowlers something to defend. If India happen to lose this game, the 118 runs scored by the last four Bangladeshi pairs would haunt them as much as not using a third spinner in Kuldeep Yadav on a track that became increasingly venomous as the match progressed. If they overhaul 145, it will be third highest successful fourth innings chase at this ground as the top three winning scores are 209, 205 and 103. KL Rahul (2), who had a horrendous game as a skipper as well as batter, would like to forget this game in a hurry while the stodgy Cheteshwar Pujara (6) suffered his downfall because of his anxiousness to negate any turn on offer. Shubman Gill (7) had his worse day on the tour, increasing India’s worry. In case of Rahul, he tentatively poked a Shakib (1/21 in 6 overs) delivery that turned enough to kiss the outside edge of his bat into the keeper’s gloves. Pujara, for the second time, came out to play the delivery from Mehidy Hasan Miraz (3/12 in 8 overs) before it could turn. The ball hit his bat and pad before a crawling Nurul effected a smart stumping. However, the pitch was showing its true colours and there was turn and bounce with the ball skidding occasionally as well as keeping low, making batting that much more difficult. In fact, India’s head coach Rahul Dravid, with his tactic of sending night watchman Axar Patel (26 batting) with more than 15 overs left, made it clear that there was a certain sense of nervousness as to what happens if Virat Kohli (1 off 22 balls) would get dismissed in the third evening itself. While Gill was stumped off a doosra, becoming Miraz’s second victim, Kohli had no choice but to come out late in the evening as the pitch, at times, was starting to resemble a snake pit with deliveries hissing past the willow. Just like it happens on turners, the close-in fielders started applying more pressure on batters as well as umpires with Kohli needing a DRS to save himself from getting adjudged leg before to Taijul Islam. But he was just a delivery away from getting dismissed as Miraz bowled a lovely flighted delivery drawing Kohli forward and got a classical bat-pad dismissal for Mominul Haque standing at forward short-leg. With Kohli not inspiring highest level of confidence, Rishabh Pant, who has shown how to bat on this track, could again play the decisive role and help India manage to log home full points and prevent Bangladesh from winning their first game against India in 22 years of bilateral Test cricket. At stumps, Axar and night watchman Jaydev Unadkat (3 batting) were at the crease. But in the first two sessions, it was Axar Patel (3/58) along with Mohammed Siraj (2/41) and Ravichandran Ashwin (2/66) who had Bangladesh on the mat at 113 for 6 before Nurul came out and attacked the spinners in his little cameo. At the other end, Litton was celebrating his maiden IPL contract with some lusty blows and the 60-odd run stand with Taskin during which India also dropped a few catches which proved costly. While the Indian team management can claim that the bowlers did their job getting Bangladesh out for 227 and 231 in the two innings but they would be the first to admit that any score in excess of 120 odd on this track would always be a tricky game. Jaydev Unadkat (1/17), the third seamer India used as they were “confused” looking at the greenish tinge, was used for only nine overs out of the 70.2 that they bowled. —PTI India stare at defeat as Bangladesh spinners get into action added by Press Trust of India on 1:42 am December 25, 2022 View all posts by Press Trust of India → Press Trust of India Facebook Twitter WhatsApp Email Print Related","pubDate":"2022-12-24 20:12:22","image_url":null,"source_id":"kashmirreader","country":["india"],"category":["sports"],"language":"english"},{"title":"Shahid Afridi to head new selection committee of Pakistan Cricket Board","link":"https://kashmirreader.com/2022/12/25/shahid-afridi-to-head-new-selection-committee-of-pakistan-cricket-board/","keywords":["SPORTS"],"creator":["KR Desk"],"video_url":null,"description":"KARACHI: Former captain Shahid Afridi will head the new interim selectors committee for the Pakistan Cricket Board (PCB), officials said on Saturday, the latest change since the team was thrashed by England. The PCB underwent a major overhaul on Thursday when a 14-member management committee took over after Ramiz Raja was sacked as chairman. The […]","content":"KARACHI: Former captain Shahid Afridi will head the new interim selectors committee for the Pakistan Cricket Board (PCB), officials said on Saturday, the latest change since the team was thrashed by England. The PCB underwent a major overhaul on Thursday when a 14-member management committee took over after Ramiz Raja was sacked as chairman. The main committee, headed by former chairman Najam Sethi, also dismissed chief selector Mohammad Wasim before appointing Afridi. Former players Abdul Razzaq and Rao Iftikhar were also named selectors, the PCB said. The changes follow Pakistan’s first-ever 3-0 home whitewash by England this month. “I feel honoured to have been assigned this responsibility,” said Afridi, who retired from international cricket in 2017. “We need to get back to our winning ways and I have no doubts that through meritocratic and strategic selection decisions, we will help the national side to perform.” Afridi played 27 Tests, 398 one-day and 99 Twenty 20 international for Pakistan in a career remembered for his hard-hitting batting. Pakistan are currently involved in a two-match Test series against New Zealand with the first match in Karachi starting from Monday. —Agencies Shahid Afridi to head new selection committee of Pakistan Cricket Board added by KR Desk on 1:42 am December 25, 2022 View all posts by KR Desk → KR Desk Facebook Twitter WhatsApp Email Print Related","pubDate":"2022-12-24 20:12:13","image_url":null,"source_id":"kashmirreader","country":["india"],"category":["sports"],"language":"english"},{"title":"PCB trying to bring back Mickey Arthur as Pakistan head coach: Sources","link":"https://kashmirreader.com/2022/12/25/pcb-trying-to-bring-back-mickey-arthur-as-pakistan-head-coach-sources/","keywords":["SPORTS"],"creator":["Press Trust of India"],"video_url":null,"description":"KARACHI: The cricket management committee of the Pakistan Cricket Board (PCB) headed by Najam Sethi is trying to convince South African Mickey Arthur to return as head coach of the national team, according to sources. A well-informed source told PTI that Sethi had approached Arthur who is presently attached with the Derbyshire team in England. […]","content":"KARACHI: The cricket management committee of the Pakistan Cricket Board (PCB) headed by Najam Sethi is trying to convince South African Mickey Arthur to return as head coach of the national team, according to sources. A well-informed source told PTI that Sethi had approached Arthur who is presently attached with the Derbyshire team in England. Arthur was Pakistan head coach between 2016 and 2019 and saw the team win the Champions Trophy in 2017 with Sarfaraz Ahmed as captain. “Efforts are on to bring back Arthur and some other options are also being looked at and they are all foreigners,” the source said. The development came after the committee under Sethi decided to bring in a foreigner to manage the national side as current head coach Saqlain Mushtaq is stepping down from his role after the home series against New Zealand. Sethi said a foreign coach was the best option for the Pakistan team. “We have seen in the past when Mickey Arthur was the coach that a foreigner does not bring excess baggage with him and is willing to make no compromises in team interest,” Sethi told the media after a meeting of the committee. —PTI PCB trying to bring back Mickey Arthur as Pakistan head coach: Sources added by Press Trust of India on 1:41 am December 25, 2022 View all posts by Press Trust of India → Press Trust of India Facebook Twitter WhatsApp Email Print Related","pubDate":"2022-12-24 20:11:54","image_url":null,"source_id":"kashmirreader","country":["india"],"category":["sports"],"language":"english"},{"title":"Messi – the immortal genius","link":"https://www.thetimesofbengal.com/sports/messi-the-immortal-genius/","keywords":["Sports"],"creator":["admin"],"video_url":null,"description":"There was virtually a way of inevitability to it. Lionel Messi needed to win the The post Messi – the immortal genius appeared first on The Times of Bengal.","content":"There was virtually a way of inevitability to it. Lionel Messi needed to win the soccer World Cup. Like Sachin Tendulkar needed to win the cricket World Cup. Like Roger Federer needed to win the Wimbledon. Like Tiger Woods needed to win the Masters. Like Usain Bolt needed to win the Olympic 100m gold.\r When you’re the most effective, you deserve the most effective. Messi has been the world’s greatest footballer of his era, by some margin. After main Argentina to its first World Cup in 36 years, he might even stake a declare to being the most effective ever. Not that he would care. What he cared about was successful the World Cup. We noticed how a lot it meant to him when he stole that kiss on the Cup earlier than it was offered to Argentina.\r The kiss and the completely satisfied smile on his face confirmed why the FIFA World Cup is the planet’s best present. The Olympic Video games could also be grander, the depth of a gripping cricket Check could also be unparalleled, however there may be nothing fairly just like the soccer World Cup.\r Little marvel all the world turns its consideration to this unimaginable event as soon as each 4 years. You simply wouldn’t wish to miss a recreation at a World Cup. Come to consider it, even the pandemic spared it. However the controversies didn’t.\r There have been debates about bribery allegations (to get the rights because the host), human rights, equal rights, homophobia, the ban on alcohol… however no one would argue concerning the high quality of soccer witnessed in Qatar.\r It was a World Cup of surprises. Nothing spices up a event like a shocking end result (Saudi Arabia 2 Argentina 1; Japan 2 Spain 1; Morocco 2 Belgium 0; Morocco1 Portugal 0… take your decide).\r Residing as much as expectations Nevertheless it was additionally a World Cup that lived as much as expectations in some ways. Mbappe was tipped to be one of many stars. He actually was. It was simply his misfortune that he was pitted – within the recreation that mattered most – towards presumably the most important star of all of the World Cups.\r For all these objectives of Mbappe, the golden boot, and that hat-trick within the closing, which single-handedly allowed France to breathe and hope, the Qatar World Cup will all the time be often called Messi’s World Cup. No person would grudge him that. Has anyone entertained the world for thus lengthy and so enchantingly the best way he has?\r Maybe not since India gained the cricket World Cup in 2011 at residence have so many individuals wished one workforce to triumph – primarily for one man – in a significant worldwide event. Tendulkar had achieved nearly the whole lot with a cricket bat. He was even praised by Sir Don Bradman. However, he hadn’t gained the World Cup. It was his final probability.\r And India gained, beating Sri Lanka within the closing, that too on Tendulkar’s residence floor in Mumbai, to regain the World Cup after a spot of 28 years. The good man himself made solely 18, however he was the event’s second highest-scorer and had two a whole lot.\r After the ultimate, one bought the primary glimpse of Virat Kohli’s commendable communication abilities. “He has carried the burden of the nation for 21 years, it was time we carried him,” he stated of the Indian gamers carrying Tendulkar on their shoulders in the course of the victory lap.\r Kings once more: Messi’s Argentina triumphed in Qatar 2022, 36 years after Maradona’s Mexico excessive.| Photograph Credit score:AFP Messi’s burden has been no much less. Argentina’s inhabitants could also be lower than 4 per cent of India’s, however soccer is a much more world sport than cricket. And Messi has followers all around the world. In our time, solely the opposite Argentine nice, Diego Maradona, has maybe been liked as a lot.\r It was, after all, Maradona who final took the World Cup residence to Argentina, in 1986. Simply as that Argentine workforce was constructed round him, the one in Qatar was extra about Messi.\r Maradona, nonetheless, was solely 25 when he landed in Mexico for the World Cup as Argentina’s captain. He would go on to play in two extra. For Messi, this was the final probability.\r He had come very shut in 2014. He took Argentina all the best way to the ultimate, which was gained by Germany by way of a objective scored by Mario Gotze in extra-time. Messi was named the event’s greatest participant.\r Shock announcement Messi had all these league titles, the Ballon d’Or awards, the golden sneakers and golden balls, Copa America and all these mesmerising objectives too, however he didn’t have the cup that mattered most in soccer. That was why he determined to return again after saying his retirement from worldwide soccer in 2016.\r It was evident that he took that call after the frustration of dropping the Copa America closing to Chile that yr; he had missed a penalty within the shootout. He additionally hadn’t gained any vital event with Argentina even at the moment (his first Copa America triumph got here solely final yr).\r A few months after he surprised the world, Messi reversed his choice, a lot to the aid of Argentina and the remainder of the world. Nevertheless it wasn’t an enormous shock, actually. You don’t retire at 29.\r Two years later, Messi led Argentina on the World Cup in Russia. However he was in for an additional disappointment as Argentina misplaced to France 3-4 within the spherical of 16. Who would have thought that the 2 groups would produce one other high-scoring thriller 4 years later and that too within the title conflict?\r The Qatar finale has been described by many as the best World Cup closing ever. Some, together with those that have performed on the World Cup, have referred to as it the most effective soccer recreation ever. That could be debatable, however in our residing reminiscence, we could wrestle to consider one other closing just like the one we have been lucky to observe on December 18. Messi needed to rating within the closing. He did, twice the truth is. He had additionally scored in Argentina’s 3-0 victory within the semifinal towards Croatia. Nevertheless it was the best way he arrange the workforce’s third objective in that recreation — for Julian Alvarez — that confirmed his genius.\r He was proving, for the umpteenth time, that he was no atypical mortal. It could be secure to say that the world could not see one other participant like him.\r Source link The post Messi – the immortal genius appeared first on The Times of Bengal.","pubDate":"2022-12-24 19:04:59","image_url":null,"source_id":"the_tob","country":["india"],"category":["sports"],"language":"english"},{"title":"Shahid Afridi-led Choice Committee Provides 3 Bowlers In Pakistan Squad For NZ collection | Cricket Information","link":"https://www.thetimesofbengal.com/sports/shahid-afridi-led-choice-committee-provides-3-bowlers-in-pakistan-squad-for-nz-collection-cricket-information/","keywords":["Sports"],"creator":["admin"],"video_url":null,"description":"Hours after being named because the interim chief selector by the Pakistan Cricket Board, Shahid The post Shahid Afridi-led Choice Committee Provides 3 Bowlers In Pakistan Squad For NZ collection | Cricket Information appeared first on The Times of Bengal.","content":"Hours after being named because the interim chief selector by the Pakistan Cricket Board, Shahid Afridi on Saturday added three bowlers to the nationwide squad for the two-match residence Take a look at collection towards New Zealand, starting in Karachi on Monday. The PCB mentioned Afridi, after talking to captain Babar Azam, added pacers Mir Hamza and Shahnawaz Dahani and off-spinner Sajid Khan to the squad. The Board mentioned the choice so as to add the three bowlers was made following a gathering of the interim choice committee, which was chaired by Afridi. Captain Babar Azam joined the assembly. Afridi mentioned the selectors had a superb dialogue on the squad and agreed there was a have to strengthen the bowling division to present the group the most effective likelihood of taking 20 wickets in a match nearly. “As such, and taking into account current kind and performances, we have now added quick bowlers Mir Hamza and Shahnawaz Dahani, and off-spinner Sajid Khan,” Adridi mentioned. “I’m assured the inclusion of three further bowling sources will give Babar Azam extra choices to discipline the most effective out there squad for the primary Take a look at.” Whereas Hamza and Sajid have performed in Exams, Dahani has represented Pakistan in white-ball codecs. Earlier within the day, former captain Afridi was named the interim chief selector of the Pakistan males’s nationwide group. The interim committee of selectors included former gamers Abdul Razzaq, Rao Ifthikar Ahmed, and Haroon Rasheed. Each Afridi and Haroon are members of the cricket administration committee of the PCB, headed by Najam Sethi, appointed to run the affairs of the sport within the nation for the subsequent 4 months. Pakistan Take a look at squad: Babar Azam (captain), Abdullah Shafique, Abrar Ahmed, Hasan Ali, Imam-ul-Haq, Kamran Ghulam, Mir Hamza, Mohammad Nawaz, Mohammad Rizwan, Mohammad Wasim Jnr, Naseem Shah, Noman Ali, Sajid Khan, Salman Ali Agha, Sarfaraz Ahmed, Saud Shakeel, Shahnawaz Dahani, Shan Masood and Zahid Mehmood. Featured Video Of The Day IPL Public sale 2023: Sam Curran Turns into Most Costly Purchase As Groups Splash The Money Matters talked about on this article Source link The post Shahid Afridi-led Choice Committee Provides 3 Bowlers In Pakistan Squad For NZ collection | Cricket Information appeared first on The Times of Bengal.","pubDate":"2022-12-24 18:28:48","image_url":null,"source_id":"the_tob","country":["india"],"category":["sports"],"language":"english"},{"title":"Brother’s sacrifice behind Vivrant becoming IPL millionaire","link":"https://thenorthlines.com/brothers-sacrifice-behind-vivrant-becoming-ipl-millionaire/","keywords":["Jammu","Jammu Kashmir","Sports"],"creator":["Northlines"],"video_url":null,"description":"NL Corresspondent Jammu, Dec 24: Jammu and Kashmir’s Vivrant Sharma, bought by SunRisers Hyderabad for Rs 2.6 crore, is now excited to work with legendary West Indies cricketer Brian Lara, who is the head coach of SRH Brothers sacrificing their careers for their younger siblings is not new in Indian cricket. On Friday, the latest […] The post Brother’s sacrifice behind Vivrant becoming IPL millionaire appeared first on Northlines.","content":"NL Corresspondent Jammu, Dec 24: Jammu and Kashmir ’s Vivrant Sharma, bought by SunRisers Hyderabad for Rs 2.6 crore, is now excited to work with legendary West Indies cricketer Brian Lara, who is the head coach of SRH Brothers sacrificing their careers for their younger siblings is not new in Indian cricket . On Friday, the latest IPL millionaire Vivrant Sharma credited brother Vikrant for the biggest achievement of his career — a Rs 2.6 crore pay cheque to don the Sunrisers Hyderabad (SRH) jersey in the 2023 edition of the league. Two years after he started walking in the footsteps of his elder brother, Jammu & Kashmir’s left-handed batter Vivrant lost his father Sushant to kidney failure. The Sharmas were suddenly left with no one to take care of the chemical business . And 26-year-old Vikrant, a university-level pace bowler hoping to make it to the Ranji side, found himself shelving his cricketing plans to take care of the family business. But Vikrant promised Vivrant all possible help to further his cricketing ambitions. Such was Vikrant’s influence that Vivrant, initially a right-hander, changed his stance and technique and became a “leftie”. “My cricket would have come to a halt but Vikrant ensured that it continued as he took over the family business and started living his dreams through me,” an emotional Vivrant told PTI, moments after he was bought by SRH after a bidding war with Kolkata Knight Riders. “It’s all because of my brother’s sacrifice. I would not have been here otherwise. I was not good at studies, but Vikrant ensured I continued to focus on cricket and keep making progress,” said Vivrant. “I miss my father a lot. I’m sure he would be happy for me. I just spoke to my mother and brother in Trikuta Nagar (in Jammu) and they became emotional. I hope I can make full use of the opportunity,” said Vivrant. The 23-year-old also thanked his Jammu and Kashmir team-mates, Umran Malik and Abdul Samad for their support. An all-rounder, Vivrant was a net bowler for SRH last year and appeared for trials at KKR, but failed to impress either of the two sides last season. Having entered the auction pool at a base price of Rs 20 lakh, Vivrant was nervous in his hotel room in Ahmedabad on Friday, a day after Jammu and Kashmir were beaten by Gujarat inside three days in their Ranji Trophy group match. But as the bidding war between SRH and KKR intensified, there was soon jubilation in his room. “Never expected such an amount. I was expecting somebody would pick me as I had a very good white-ball season,” said Vivrant, who made headlines in the Vijay Hazare Trophy with his 124-ball 154 against Uttarakhand. The knock had propelled Jammu and Kashmir to their maiden knockout berth in the history of the tournament. He also scored a 62-ball 69 as J&K chased down 343 against defending Ranji champions Madhya Pradesh as he finished as the team’s second-highest scorer in the 50-over tournament, with 395 runs at an average of 56.42. He scored two half centuries in the Syed Mushtaq Ali Trophy, aggregating 128 runs at a strike rate of 145.45. The leg-spinner was also the team’s top wicket-taker with six wickets at an economy of 4.80. A die-hard Yuvraj Singh fan, Vivrant said, “I’ve been following him since childhood; he has an aura about him. I got a chance to meet him once when he was playing at Palam (in Delhi) and I clicked a photo with him.” He also thanked former mentor and ex- India pace bowler Irfan Pathan. “Being a left-hander himself, Irfan too has influenced me a lot. He is a player’s coach and is still in touch with us. I’m sure he will be very happy today.” Vivrant made his senior debut two seasons back after making the cut through age-group tournaments and has not looked back since. A clean striker of the ball, the J&K opener is now excited to work with legendary West Indies cricketer Brian Lara, who is the head coach of SRH. “There are a lot of expectations (from me). I just want to stay grounded and keep learning,” he said.","pubDate":"2022-12-24 17:59:46","image_url":null,"source_id":"thenorthlines","country":["india"],"category":["sports"],"language":"english"},{"title":"Patcrick Vieira Slams Emiliano Martinez’s ‘Silly’ World Cup Celebrations | Soccer Information","link":"https://www.thetimesofbengal.com/sports/patcrick-vieira-slams-emiliano-martinezs-silly-world-cup-celebrations-soccer-information/","keywords":["Sports"],"creator":["admin"],"video_url":null,"description":"Crystal Palace supervisor Patrick Vieira believes Aston Villa goalkeeper Emiliano Martinez‘s “silly” celebrations have tarnished The post Patcrick Vieira Slams Emiliano Martinez’s ‘Silly’ World Cup Celebrations | Soccer Information appeared first on The Times of Bengal.","content":"Crystal Palace supervisor Patrick Vieira believes Aston Villa goalkeeper Emiliano Martinez‘s “silly” celebrations have tarnished Argentina’s World Cup ultimate win. Martinez was a key determine in Argentina’s victory over France. He made a wonderful save to disclaim Randal Kolo Muani in extra-time after which denied Kingsley Coman within the shoot-out in Qatar as Argentina received an exciting ultimate. However the keeper was then seen making a crude gesture after successful the golden glove trophy for the perfect goalkeeper on the match. Then, throughout Argentina’s victory parade in Buenos Aires, he was seen holding a child doll with its face coated by {a photograph} of France star striker Kylian Mbappe, who scored a hat-trick within the ultimate however nonetheless completed on the shedding facet. Vieira, a World Cup winner with France in 1998, was unimpressed by Martinez’s antics. “Among the footage I noticed from the Argentinian goalkeeper, I believe, take away just a little bit what Argentina achieved on the World Cup,” stated Vieira a pre-match press convention forward of Palace’s Premier League match in opposition to London rivals Fulham. “I do not suppose they actually wanted that. You may’t management generally individuals’s emotional choices. However that was a silly resolution, I believe, from Martinez to do this,” he added. Martinez will return to Birmingham subsequent week, with Villa supervisor Unai Emery intending to speak to the 30-year-old about his controversial behaviour. “When you might have large emotion, generally it’s troublesome to regulate it,” Emery stated. “I’ll converse to him subsequent week about some celebrations however I respect that he’s now below the nationwide group and when he can be with us, he’s our duty then we will talk about it.” French sports activities minister Amelie Oudea-Casteran was scathing about Martinez’s conduct, saying: “I discover it pitiful. It is simply vulgar, inappropriate, actually lower than the event. This Emiliano Martinez just isn’t distinguishing himself. It’s quite pathetic.” Featured Video Of The Day Anurag Thakur Felicitates Indian Blind Cricket Staff After T20 World Cup Win Matters talked about on this article Source link The post Patcrick Vieira Slams Emiliano Martinez’s ‘Silly’ World Cup Celebrations | Soccer Information appeared first on The Times of Bengal.","pubDate":"2022-12-24 17:52:51","image_url":null,"source_id":"the_tob","country":["india"],"category":["sports"],"language":"english"},{"title":"David Warner, who never thought he would play one Test, is set to play his 100th on Monday","link":"https://economictimes.indiatimes.com/news/sports/david-warner-who-never-thought-he-would-play-one-test-is-set-to-play-his-100th-on-monday/articleshow/96483159.cms","keywords":null,"creator":null,"video_url":null,"description":"For Warner things have been a roller coaster. When he made his international debut in 2009 with a whirlwind 89 off 43 balls in a T20I against South Africa, he was stamped as a white-ball specialist. He wasn’t suited for Test cricket was the argument. Who first made the argument we don’t really know. It took him two years to break the perception and make his red-ball debut for Australia against New Zealand.","content":null,"pubDate":"2022-12-24 17:30:00","image_url":"https://img.etimg.com/thumb/width-1200,imgsize-54916,resizemode-4,msid-96483159/david-warner-who-never-thought-he-would-play-one-test-is-set-to-play-his-100th-on-monday.jpg","source_id":"economictimes_indiatimes","country":["india"],"category":["sports"],"language":"english"},{"title":"Year Ender 2022: कोहली-स्मिथ से लेकर वॉर्नर-पुजारा तक, इस साल कई दिग्गजों ने खत्म किया शतकों का सूखा","link":"https://www.abplive.com/sports/cricket/players-who-ended-century-drought-in-2022-virat-kohli-david-warner-steve-smith-2290588","keywords":["Cricket"],"creator":["ABP Live"],"video_url":null,"description":"Year Ender 2022 Cricket: 2022 खत्म होने वाला है और इस साल क्रिकेट में काफी एक्शन देखने को मिला. वर्तमान समय के बेस्ट बल्लेबाजों में शामिल विराट कोहली से लेकर स्टीव स्मिथ तक ने इस साल लंबे समय से चले आ रहे शतकों के सूखे को खत्म किया. ये बल्लेबाज लगातार रन तो बना रहे थे, लेकिन शतक बनाने में सफल नहीं हो पा रहे थे. आइए जानते हैं किन बल्लेबाजों ने इस साल शतक के लंबे समय से चले आ रहे सूखे को खत्म किया है. विराट कोहली  विराट ने 22 नवंबर, 2019 को अपना 70वां इंटरनेशनल शतक लगाया था और इसके बाद कोरोना ब्रेक के कारण क्रिकेट पर ब्रेक लगा था. मैदान पर वापसी करने के बाद कोहली ने 2020 में 22 मैचों में 842 रन बनाए, लेकिन कोई शतक नहीं लगा सके. 2021 में उन्होंने 24 मैचों में 964 रन बनाए, लेकिन इस साल भी उनके बल्ले से शतक नहीं आया. 2022 का भी आधा साल बीत चुका था और कोहली शतक के लिए जूझ रहे थे. एशिया कप 2022 में अफगानिस्तान के खिलाफ कोहली ने 122 रनों की नाबाद पारी खेलते हुए लंबे समय से चले आ रहे सूखे को खत्म किया और टी20 इंटरनेशनल में अपना पहला शतक भी लगाया. नवंबर में बांग्लादेश के खिलाफ उन्होंने 113 रनों की पारी खेली और वनडे में 44वां शतक लगाया. स्टीव स्मिथ जनवरी 2021 में भारत के खिलाफ 131 रनों की पारी खेलने के बाद स्टीव स्मिथ की फॉर्म में गिरावट देखने को मिली. जुलाई 2022 में स्मिथ का इंतजार भी खत्म हुआ और उनके बल्ले से शतक निकला. श्रीलंका के खिलाफ स्मिथ ने मुश्किल परिस्थितियों में शतक लगाया. इसके बाद उन्होंने दो और शतक लगाए जिसमें एक दोहरा शतक शामिल रहा. डेविड वॉर्नर डेविड वॉर्नर ने 14 जनवरी, 2020 को भारत के खिलाफ अपना 43वां इंटरनेशनल शतक लगाया था. इसके बाद अगली 67 पारियों में वह कोई शतक नहीं लगा पाए थे. 22 नवंबर, 2022 को वॉर्नर ने 1043 दिनों से चले आ रहे सूखे को खत्म किया और इंग्लैंड के खिलाफ वनडे मैच में 106 रनों की पारी खेली. चेतेश्वर पुजारा चेतेश्वर पुजारा ने 03 जनवरी, 2019 को ऑस्ट्रेलिया के खिलाफ 193 रनों की शानदार पारी खेली थी. 2020 और 2021 में पुजारा संघर्ष करते रहे और 18 टेस्ट में 865 रन बना सके. 14 दिसंबर, 2022 को बांग्लादेश के खिलाफ पुजारा ने 1443 दिनों के सूखे को खत्म किया और नाबाद 102 रनों की पारी खेली. यह भी पढ़ें: IND vs SL: 03 जनवरी से शुरू होगी भारत और श्रीलंका के बीच टी20 सीरीज, जानें कैसे खरीद सकेंगे टिकट","content":"Year Ender 2022 Cricket: 2022 खत्म होने वाला है और इस साल क्रिकेट में काफी एक्शन देखने को मिला. वर्तमान समय के बेस्ट बल्लेबाजों में शामिल विराट कोहली से लेकर स्टीव स्मिथ तक ने इस साल लंबे समय से चले आ रहे शतकों के सूखे को खत्म किया. ये बल्लेबाज लगातार रन तो बना रहे थे, लेकिन शतक बनाने में सफल नहीं हो पा रहे थे. आइए जानते हैं किन बल्लेबाजों ने इस साल शतक के लंबे समय से चले आ रहे सूखे को खत्म किया है. विराट कोहली विराट ने 22 नवंबर, 2019 को अपना 70वां इंटरनेशनल शतक लगाया था और इसके बाद कोरोना ब्रेक के कारण क्रिकेट पर ब्रेक लगा था. मैदान पर वापसी करने के बाद कोहली ने 2020 में 22 मैचों में 842 रन बनाए, लेकिन कोई शतक नहीं लगा सके. 2021 में उन्होंने 24 मैचों में 964 रन बनाए, लेकिन इस साल भी उनके बल्ले से शतक नहीं आया. 2022 का भी आधा साल बीत चुका था और कोहली शतक के लिए जूझ रहे थे. एशिया कप 2022 में अफगानिस्तान के खिलाफ कोहली ने 122 रनों की नाबाद पारी खेलते हुए लंबे समय से चले आ रहे सूखे को खत्म किया और टी20 इंटरनेशनल में अपना पहला शतक भी लगाया. नवंबर में बांग्लादेश के खिलाफ उन्होंने 113 रनों की पारी खेली और वनडे में 44वां शतक लगाया. स्टीव स्मिथ googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); जनवरी 2021 में भारत के खिलाफ 131 रनों की पारी खेलने के बाद स्टीव स्मिथ की फॉर्म में गिरावट देखने को मिली. जुलाई 2022 में स्मिथ का इंतजार भी खत्म हुआ और उनके बल्ले से शतक निकला. श्रीलंका के खिलाफ स्मिथ ने मुश्किल परिस्थितियों में शतक लगाया. इसके बाद उन्होंने दो और शतक लगाए जिसमें एक दोहरा शतक शामिल रहा. डेविड वॉर्नर डेविड वॉर्नर ने 14 जनवरी, 2020 को भारत के खिलाफ अपना 43वां इंटरनेशनल शतक लगाया था. इसके बाद अगली 67 पारियों में वह कोई शतक नहीं लगा पाए थे. 22 नवंबर, 2022 को वॉर्नर ने 1043 दिनों से चले आ रहे सूखे को खत्म किया और इंग्लैंड के खिलाफ वनडे मैच में 106 रनों की पारी खेली. चेतेश्वर पुजारा चेतेश्वर पुजारा ने 03 जनवरी, 2019 को ऑस्ट्रेलिया के खिलाफ 193 रनों की शानदार पारी खेली थी. 2020 और 2021 में पुजारा संघर्ष करते रहे और 18 टेस्ट में 865 रन बना सके. 14 दिसंबर, 2022 को बांग्लादेश के खिलाफ पुजारा ने 1443 दिनों के सूखे को खत्म किया और नाबाद 102 रनों की पारी खेली. यह भी पढ़ें: IND vs SL: 03 जनवरी से शुरू होगी भारत और श्रीलंका के बीच टी20 सीरीज, जानें कैसे खरीद सकेंगे टिकट","pubDate":"2022-12-24 16:57:29","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2022/10/24/c75efaf810500cb7458457a693cba0df1666585615968566_original.jpg","source_id":"abplive","country":["india"],"category":["sports"],"language":"hindi"},{"title":"'I’m very surprised that we got somebody like Kane Williamson at base price,' says Ashish Nehra","link":"https://www.firstpost.com/firstcricket/sports-news/im-very-surprised-that-we-got-somebody-like-kane-williamson-at-base-price-says-ashish-nehra-11868931.html","keywords":["First Cricket News"],"creator":["Sahil Malhotra"],"video_url":null,"description":"'I’m very surprised that we got somebody like Kane Williamson at base price,' says Ashish Nehra","content":"Cricket 'I’m very surprised that we got somebody like Kane Williamson at base price,' says Ashish Nehra No other team showed interest in Kane Williamson but Gujarat Titans were convinced about getting him on board and were ready to shed even more Sahil Malhotra December 24th, 2022 22:13:40 IST Ashish Nehra in a file photo. Gujarat Titans Kochi : Gujarat Titans’ first buy of the IPL 2023 mini-auction was former Sunrisers Hyderabad captain Kane Williamson. The defending champions Titans managed to acquire the services of an elegant right-hander for the base price of Rs 2 crore. No other team showed interest in the Kiwi but the Titans were convinced about getting him on board and were ready to shed even more. “Somebody like Williamson will bring in so much experience. He is a proven player, didn’t have a couple of good IPL seasons but IPL is so fast-paced that it takes very little time for thinking and perception to change. For us, if he would have gone for much more, we would have still gone for Kane Williamson. We believe in that player and wanted to have that mix of experience and youth. Kane brings a lot to the table for any team. We are privileged that we could have him, and on top of that at base price,” Gujarat Titans head coach Ashish Nehra said at a media interaction in Kochi. IPL 2023 Complete squads: GT | SRH | RR | MI | PBKS | CSK | RCB | KKR | LSG | DC Nehra added that the team is looking at a No.3 role for Williamson, and the move is not likely to affect the template they had last season. The only possible change could be the young and talented Sai Sudarshan, who has been very consistent in the domestic circuit this year, not getting enough game time. “We are talking about somebody like Sai Sudarshan who is young and has time. And the presence of Kane Williamson will only help him. Even last year, it wasn’t that Sai Sudarshan played all games. Just imagine how much Sai would gain with the presence of Kane Williamson around him. Har player ka time aata hai… there are other young players but again there is no option but to wait for your chance,” said Nehra. With Kane expected to marshal the top order with the likes of Shubman Gill and Wriddhiman Saha (who opened for most of the last season), is there a possibility of seeing Hardik return to the finisher role? Nehra had a typical Nehra response to this. “Hardik Pandya last year also batted at No.4. I think only once he batted at No.3. If Kane Williamson would be there, he will bat at No.3 and Hardik will bat at No.4. But again these calls would be better closer to the season. And, it’s not that people who bat higher up the order can’t finish games. Even an opener can be your finisher if he bats right till the end,” quipped the former India seamer. How signing Kane at base price helped GT Titans were ready to shell out more for Kane but were lucky to seal the deal with the first and only bid at a base price of Rs 2 crore. This allowed them to go heavy on something they desperately wanted in their ranks. Ahead of the auction, Nehra had shared that a good fast bowler was on their wishlist and they managed to complete two good buys. “The price at which we got Kane allowed us to pick both (Mavi and Little) the seamers. It’s a short auction and when you talk about supply and demand, Shivam Mavi was right up there as top three bowlers. Another was Mukesh Kumar who too has gone for good money. Mavi is a good athlete and is a youngster and from where we are right now, we will give him a good opportunity and help him. And if does well, it will be good for Indian cricket also. We are looking forward to working with both Joshua Little and Shivam Mavi,” said Nehra. ‘Age is just a number’ Wriddhiman Saha, out of Test reckoning now, turned out for Tripura in the domestic circuit but hasn’t really set the stage on fire for the side he is leading this season. For their third buy of the day, Titans went aggressively for KS Bharat and managed to get him for Rs 1.2 crore. Nehra insists it is not a succession plan for Saha but just a backup to keep the options open as the second wicketkeeper in the squad, Mathew Wade, is a foreign player. “We have someone like Saha and I have always said that if you talk about any cricket and not just IPL, age is just a number. Even injuries are likely to happen and our second wicketkeeper is Matthew Wade who is a foreigner. Had Saha been 28 years old, we would have still looked for a wicketkeeper as a backup. And if you talk about KS Bharat, I don’t see anybody as experienced as KS Bharat in playing other franchises, playing India A. So we were lucky again,” said Nehra. England players dominate England players were in demand at the mini-auction. Some of the top buys were English players and the likes of Sam Curran (Rs 18.5 crore to Punjab Kings), Ben Stokes (Rs 16.25 crore to CSK), and Harry Brook (Rs 13.25 crore) took home most of the money which was spent. England have continued to dominate white-ball formats for years and Nehra feels it does make a difference but at the end of the day every franchise just wants quality and nationality is not something which is considered or taken into account. IPL 2023 Auction: Players sold/unsold “If your international team does well… England won the 50-over World Cup and also the T20 World Cup, and the way they are playing white-ball cricket. It certainly makes a difference. Every franchise doesn’t look at the country-wise way, whether it’s England or South Africa, they just want quality players in the team. And there’s no doubt about England team and players which are doing very well right now. Now there is an example of Cameron Green who has not played many T20s for Australia but is extremely talented. So teams look at talent too. So I am not surprised to see these big names and England players being the big buys,” said Nehra. From the Titans’ point of view, it was their first mini-auction and the team had already retained their core from the previous season. With the purse they had, Nehra said they were anyway not looking at someone like Sam Curran or Cameron Green and the management had a few spots in mind to fill. “First you need to see how much funds you have and what you need. Auction is not like you will get whatever six-eight players you need. Very rarely it happens but we were lucky to get what we wanted and still have some money left. We knew earlier also that we can’t go for somebody like Stokes or Green or Curran because they are going to go big. We are happy to fill the slots we wanted to fill. I’m very surprised that we got somebody like Kane Williamson at base price,” said Nehra Impact Player effect? ‘Not really’ Nehra lauded the Impact Player rule for what it brings to the table but was quick to add that Titans’ strategy due to the new tactical move didn’t change. “There is no need to have too much change in the strategy due to the Impact Player rule. When you talk about white-ball cricket, it’s difficult to say which rule is okay because if you look at the last few years, so many rules have changed in the 50-over format too. Even stats, for people who in believe stats, have kept changing with the rules. Many years back we had supersub. “This is similar to that but the only difference is that then we had to give one name and here we can choose from four names. There have been numerous rules introduced in white-ball cricket and other sports too, but as a player, an international sportsperson, I think the only thing you can do is get comfortable with the changes which are only going to make the game more exciting,” said Nehra. Read all the Latest News , Trending News , Cricket News , Bollywood News , India News and Entertainment News here. Follow us on Facebook , Twitter and Instagram . Updated Date: December 24, 2022 22:13:40 IST Tags: Ashish Nehra Gujarat Titans Ipl 2023 Auction Kane Williamson Find latest and upcoming tech gadgets online on Tech2 Gadgets. Get technology news, gadgets reviews & ratings. Popular gadgets including laptop, tablet and mobile specifications, features, prices, comparison.","pubDate":"2022-12-24 16:43:40","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/12/Ashish-Nehra.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Off-spinner among three added to Pakistan Test squad - ICC Cricket","link":"https://news.google.com/__i/rss/rd/articles/CBMiKGh0dHBzOi8vd3d3LmljYy1jcmlja2V0LmNvbS9uZXdzLzI5OTIyMjXSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Off-spinner among three added to Pakistan Test squad  ICC CricketPCB's interim selection committee adds three players to Test squad | Cricbuzz.com - Cricbuzz  CricbuzzPAK vs NZ Test 2022 Squad, Schedule, Match, Series, Squad 2022, Live Telecast Channel In India, Live Streaming In India, Broadcast Channel In India, New Zealand tour of Pakistan 2022-23  Cricket AddictorPak vs NZ: Mir Hamza, Shahnawaz Dahani, Sajid Khan added to Test squad  Geo NewsMir Hamza, Sajid Khan, Shahnawaz Dahani added to Pakistan Test squad against New Zealand  SportstarView Full coverage on Google News","content":null,"pubDate":"2022-12-24 16:27:32","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"TGS vs SSS Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update- Dream11 Nature Isle T10 - Cricket Addictor","link":"https://news.google.com/__i/rss/rd/articles/CBMiqgFodHRwczovL2NyaWNrZXRhZGRpY3Rvci5jb20vZmFudGFzeS1jcmlja2V0L3Rncy12cy1zc3MtZHJlYW0xMS1wcmVkaWN0aW9uLWZhbnRhc3ktY3JpY2tldC10aXBzLWRyZWFtMTEtdGVhbS1wbGF5aW5nLXhpLXBpdGNoLXJlcG9ydC1pbmp1cnktdXBkYXRlLWRyZWFtMTEtbmF0dXJlLWlzbGUtdDEwL9IBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"TGS vs SSS Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update- Dream11 Nature Isle T10  Cricket AddictorTGS vs SSS Dream11 Prediction: Fantasy Cricket Tips, Today's Playing XIs, Player Stats, Pitch Report for Nature Isle T10, Match 6  SportskeedaCricket Betting Tips and Cricket Match Predictions: Dream11 Nature Isle T10 2022-23 - Indian River Rowers vs Champagne Reef Divers, Match 5: 24th Dec  Cricket WorldTGS vs SSS Dream11 Prediction, Fantasy Cricket Tips, Playing XI, Pitch Report & Injury Updates For Match 6  CricTrackerBAW vs IRR Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update- Dream11 Nature Isle T10  Cricket AddictorView Full coverage on Google News","content":null,"pubDate":"2022-12-24 16:16:41","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"KL Rahul May Face T20I Axe With Chetan Sharma-led Committee Set To Select Teams For Sri Lanka Series.. - NDTV Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMikwFodHRwczovL3Nwb3J0cy5uZHR2LmNvbS9jcmlja2V0L2tsLXJhaHVsLW1heS1mYWNlLXQyMGktYXhlLXdpdGgtY2hldGFuLXNoYXJtYS1sZWQtY29tbWl0dGVlLXNldC10by1zZWxlY3QtdGVhbXMtZm9yLXNyaS1sYW5rYS1zZXJpZXMtcmVwb3J0LTM2MzU5MjbSAZkBaHR0cHM6Ly9zcG9ydHMubmR0di5jb20vY3JpY2tldC9rbC1yYWh1bC1tYXktZmFjZS10MjBpLWF4ZS13aXRoLWNoZXRhbi1zaGFybWEtbGVkLWNvbW1pdHRlZS1zZXQtdG8tc2VsZWN0LXRlYW1zLWZvci1zcmktbGFua2Etc2VyaWVzLXJlcG9ydC0zNjM1OTI2L2FtcC8x?oc=5","keywords":null,"creator":null,"video_url":null,"description":"KL Rahul May Face T20I Axe With Chetan Sharma-led Committee Set To Select Teams For Sri Lanka Series..  NDTV SportsIND vs SL: India T20 Squad for Sri Lanka  Cricket AddictorIND vs SL Series: Hardik Pandya likely to lead in Injured Rohit's absence, Kohli to be rested, BCCI source says, 'KL Rahul's days numbered' - Check details  InsideSportKL Rahul may face T20I axe with Chetan Sharma-led committee set to select teams for Sri Lanka series  DNA IndiaIND vs SL: Hardik Pandya May Lead T20I Team In Rohit Sharma's Absence, KL Rahul's T20I Days Numbered – Reports  Cricket AddictorView Full coverage on Google News","content":null,"pubDate":"2022-12-24 16:05:00","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"“Crowd Was Shouting…”: Mohammed Siraj On Ecstatic Celebration After Dismissing Litton Das | Cricket Information","link":"https://www.thetimesofbengal.com/sports/crowd-was-shouting-mohammed-siraj-on-ecstatic-celebration-after-dismissing-litton-das-cricket-information/","keywords":["Sports"],"creator":["admin"],"video_url":null,"description":"India may need been 4 wickets down in a difficult chase within the second Take The post “Crowd Was Shouting…”: Mohammed Siraj On Ecstatic Celebration After Dismissing Litton Das | Cricket Information appeared first on The Times of Bengal.","content":"India may need been 4 wickets down in a difficult chase within the second Take a look at in opposition to Bangladesh however pacer Mohammed Siraj mentioned there may be nothing to fret about as one set batter can take the staff to victory on Sunday. India on Saturday discovered themselves in a spot of trouble after a fascinating third day’s play as they had been decreased to 45 for 4 in a difficult chase of 145. “I really feel, we should not suppose an excessive amount of now as a result of we now have misplaced simply 4 wickets. We want round 80 (100) or so. We want only one batter to get set, Axar is displaying proper intent,” Siraj mentioned through the press convention. At stumps, Axar Patel (26) and Jaydev Unadkat (3) had been on the crease with India nonetheless needing one other 100 runs. “Sure, we misplaced two wickets further however Axar is ready, he’s displaying good intent. We even have Rishabh (Pant) and Shreyas (Iyer) after that, so we should not suppose an excessive amount of.” Siraj was additionally requested about his wild celebration put up dismissing Litton Das. He replied: “The gang was shouting issues that’s the reason I did that. After an LBW attraction in opposition to Taskin, I went again to fielding, and the group was shouting one thing. That is why I did that,” he mentioned within the post-match presser. “There may be nothing with Litton Das. It is a gentleman’s sport.” If India overhaul 145, it is going to be third highest profitable fourth innings chase at this floor as the highest three profitable scores are 209, 205 and 103. After India misplaced KL Rahul (2) and Cheteshwar Pujara (6), head coach Rahul Dravid determined to ship night time watchman Axar with greater than 15 overs left. “Sending Axar is administration’s name. I really feel if there’s a lefty and righty batter, then it is going to be tough for the bowlers to regulate. So, I believe due to that this name was taken,” Siraj mentioned. The 28-year-old from Hyderabad scalped two wickets — Mominul Haque (5) and Litton Das (73) — on day three as India dismissed Bangladesh for 231. “On this wicket, there may be further bounce for quick bowers, so I used to be attempting to hit the realm as arduous as doable as we had been getting further bounce, so our plan was to hit that space arduous and as you possibly can see we bought wickets.” India wasted each their DRS inside a span of 5 deliveries. The primary one was within the eighth over when Ravichandran Ashwin appeared to have trapped Najmul Hossain Shanto and skipper KL Rahul referred it to the third umpire. Within the subsequent over, Siraj was satisfied that he had bought Zakir Hasan after hitting him on the pads. As soon as once more Rahul went upstairs, solely to search out that the ball had pitched outdoors leg. “Each time the ball hits the pad as a bowler you are feeling it’s out. However it is vital for the bowler and keeper to have a dialog earlier than going for overview,” mentioned Siraj. “For the reason that batter was in entrance of me, I had satisfied for the overview nevertheless it did not occur as I assumed.” Whereas Litton Das led Bangladesh’s fightback with a 98-ball 73, Siraj felt Nurul Hasan‘s counter-attacking 29-ball 31 knock modified the momentum. “The wicketkeeper got here and began attacking and it modified the momentum and we conceded further 30 runs however it’s not one thing that we needs to be too fearful,” he mentioned. Featured Video Of The Day Anurag Thakur Felicitates Indian Blind Cricket Staff After T20 World Cup Win Subjects talked about on this article Source link The post “Crowd Was Shouting…”: Mohammed Siraj On Ecstatic Celebration After Dismissing Litton Das | Cricket Information appeared first on The Times of Bengal.","pubDate":"2022-12-24 15:52:39","image_url":null,"source_id":"the_tob","country":["india"],"category":["sports"],"language":"english"},{"title":"Telangana’s Lasya completes ICC Level-1 cricket coach course in Dubai","link":"https://telanganatoday.com/telanganas-lasya-completes-icc-level-1-cricket-coach-course-in-dubai","keywords":["Hyderabad","News","Sport","Telangana","World","Burra Lasya","Dubai","ICC","V Srinivas Goud"],"creator":["Telangana Today"],"video_url":null,"description":"Telangana's Burra Lasya completed her Level-1 Cricket Coach Course at the ICC Academy Coach Education Course","content":"Home | Sport | Telanganas Lasya Completes Icc Level 1 Cricket Coach Course In Dubai Telangana’s Lasya completes ICC Level-1 cricket coach course in Dubai Telangana's Burra Lasya completed her Level-1 Cricket Coach Course at the ICC Academy Coach Education Course By Telangana Today Updated On - 09:06 PM, Sat - 24 December 22 Hyderabad: Telangana’s Burra Lasya completed her Level-1 Cricket Coach Course at the ICC Academy Coach Education Course in Dubai. She is the first woman cricket coach from the State to complete the course. She hails from Bhupalpally district. Also Read Sports minister assures to setup cricket stadium in Karimnagar Sports Minister V Srinivas Goud congratulated Lasya at his office in Hyderabad on Saturday. The Minister hoped that Lasya would achieve more laurels and make Telangana State proud. The Minister also said that the government is supporting athletes to achieve best results. Follow Us : Tags Burra Lasya Dubai ICC V Srinivas Goud Related News Sports minister assures to setup cricket stadium in Karimnagar Physiotherapy College to set up in Mahabubnagar, classes to commence from January Dubai is second most attractive city in the world for tourism Indian fined $6,806 for drunk driving, crashing vehicle in Dubai ICC announces hosts of Under-19 global events until 2027 Greg Barclay gets second term as ICC chairman","pubDate":"2022-12-24 15:35:57","image_url":null,"source_id":"telanganatoday","country":["india"],"category":["sports"],"language":"english"},{"title":"India vs Bangladesh, Day 3: Virat Kohli’s dropped catches, Tigers’ counter attack and more key moments","link":"https://www.firstpost.com/firstcricket/sports-news/india-vs-bangladesh-day-3-virat-kohlis-dropped-catches-tigers-counter-attack-and-more-key-moments-11868481.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"India vs Bangladesh, Day 3: Virat Kohli’s dropped catches, Tigers’ counter attack and more key moments","content":"Cricket India vs Bangladesh, Day 3: Virat Kohli’s dropped catches, Tigers’ counter attack and more key moments Bangladesh have inched ahead at the end of Day 3 but India have batting left to chase the modest target of 145 on fourth Day. FirstCricket Staff December 24th, 2022 19:19:42 IST Bangladesh players were ecstatic as India lost frequent wickets in last session of Day 3. AP On the moving day of the second India vs Bangladesh Test match, the fans and the experts were really moved by the on-field action as India dominated the major part of the day and bundled the Tigers to set a target of 145 , but the hosts made a stunning comeback, dismissing four Indian batters for less than 50 runs. As the game moves to Day 4, India will still need 100 runs to win with six wickets in hand. Rishabh Pant and Shreyas Iyer are yet to come to bat and that is the only positive left for India. Bangladesh will smell blood – first Test match win over India in their history. India, on the other hand, will try to clot the blood flow – they stare at a steep situation with very little margin available to qualify for the World Test Championship Final. Stumps on Day 3️⃣ of the second #BANvIND Test. #TeamIndia move to 45/4 & require 100 runs to win with @akshar2026 & @JUnadkat at the crease. Scorecard – https://t.co/CrrjGfXPgL pic.twitter.com/d9w83R8qLt — BCCI (@BCCI) December 24, 2022 While Bangladesh look a step ahead at the end of the day, there were several key moments throughout the third day that led to the situation. We take a look at several important and key moments from Day 3. Virat Kohli’s dropped catches When India is playing, Virat Kohli is always in the headlines for his batting or his on-field antics. However, for a change, the former Indian skipper caught the limelight on Day 3 after he dropped several catches off Indian spinners in the slips during the second innings of Bangladesh. Kohli dropped at least four catches and gave a couple of lifelines to Nurul Hasan and Litton Das. Kohli’s reflexes reacted a bit late each time the batters edged the ball and that allowed batters to stay longer at the crease and add a few vital runs to their total. A 145-run target seemed easier at the end of the Tigers’ innings, but with India losing four wickets at the end of the day’s play the match is wide open. Kohli grabbing a few of those catches would surely have reduced the target. Virat Kohli dropped 4 catches and claimed one that he barely picked after one bounce – all at slips. Strange that no one in the commentary box chose to speak about it at length or question KL Rahul’s inability to replace him with someone else. #INDvsBAN — Rahul Rawat (@rawatrahul9) December 24, 2022 Litton Das plays anchor Litton Das has taken up his role quite seriously and has grown through the ranks in absence of some of the senior Bangladesh batters. While he got starts in the first three innings, he was not able to convert them big and was dismissed around 20s. However, he made sure to stick for a bit longer in the second innings and lead his team to a total worth playing for in the fourth innings. Das scored 73 runs from 98 deliveries including seven boundaries. He was quite defensive at the beginning but dropped his guard and counter-attacked against the Indian bowlers as wickets kept falling at the other end. Bangladesh’s lower order counter-attack Bangladesh lower order was excellent with the bat and gave India a taste of the manner in which they have been performing in recent times. Nurul Hasan and Taskin Ahmed both went on score 31 runs to lift their side out of the puddle. The fact that Das was the eighth wicket to fall also helped the tail to have a top-order batter to accompany and play fearlessly. Bangladesh added 118 runs for the last four wickets and stretched their lead to 144 before eventually falling out. India’s top-order collapse Mehidy Hasan Miraz has been a nemesis for India in this tour to Bangladesh and once again ripped through the Indian top order bagging three wickets of Shubman Gill (7), Cheteshwar Pujara (6), and Virat Kohli (1). While Pujara and Gill were stumped, Kohli was made to edge a short delivery while defending that was sharply caught at forward short leg by Mominul Haque. India were left tattering at 45/4 at the end of the day’s play with Axar Patel proving to be a ray of hope amidst a tunnel of darkness for the visitors. India stare into the eyes of defeat and the fact that they are hanging by a thin rope for the World Test Championship final will add pressure on them as they come out to bat on Day 4. The match will end tomorrow, but the direction in which it goes can create history. Read all the Latest News , Trending News , Cricket News , Bollywood News , India News and Entertainment News here. Follow us on Facebook , Twitter and Instagram . Updated Date: December 24, 2022 19:19:42 IST Tags: Cricket India Vs Bangladesh Find latest and upcoming tech gadgets online on Tech2 Gadgets. Get technology news, gadgets reviews & ratings. Popular gadgets including laptop, tablet and mobile specifications, features, prices, comparison.","pubDate":"2022-12-24 13:49:42","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/12/Ind-vs-Ban-Day-3-key-moments.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Who’s Rajasthan Royals’ Kerala recruit Abdul Basith – Bus driver’s son following Sanju Samson’s footsteps","link":"https://www.thetimesofbengal.com/sports/whos-rajasthan-royals-kerala-recruit-abdul-basith-bus-drivers-son-following-sanju-samsons-footsteps/","keywords":["Sports"],"creator":["admin"],"video_url":null,"description":"The venue of this yr’s IPL public sale wasn’t removed from P. Abdul Basith’s dwelling The post Who’s Rajasthan Royals’ Kerala recruit Abdul Basith – Bus driver’s son following Sanju Samson’s footsteps appeared first on The Times of Bengal.","content":"The venue of this yr’s IPL public sale wasn’t removed from P. Abdul Basith’s dwelling in Ernakulam. After attending choice trials for numerous IPL franchises, 24-year-old was hopeful of getting picked by one in every of them on the public sale at Kochi. “I had done particularly well at the trials with Rajasthan Royals and Mumbai Indians and I am delighted that I will be joining the Royals,” Basith tells Sportstar. “Sanju Samson has been one of my heroes and it feels great that I am becoming a part of his team.” Basith says he has gained by taking part in alongside Sanju within the Kerala group. “He has encouraged me a lot,” says Basith, who’s the primary from his household to play any sport. “Everyone, including my father, who works as a driver at the Ernakulam depot of the Kerala State Road Transport Corporation, has been very supportive.” That Basith hadn’t uncared for lecturers will need to have made them pleased. After doing his B.A. in Hindi from the Maharaja’s Faculty (Ernakulam), he’s doing his masters in it. It was whereas he was learning in Class VII at St. Mary’s UP Faculty that he fell in love with cricket. “I saw boys of the Kerala Cricket Association’s academy playing cricket and I too wanted to play,” he recollects. “I also got selected to the KCA’s District and State academies. Tripunithura Cricket Club too has helped me greatly develop as a player.” It was the KCA’s resolution to have all-Kerala T20 tournaments that proved a turning level for Basith, simply because it was for a number of Kerala gamers, together with off-spinner Vaisakh Chandran, who has made a sudden impression in each white and red-ball cricket. “Without tournaments like the KCA Presidents’ Cup, we would not have got a platform to show our skills,” says Basith. “Playing Ranji Trophy is another dream, and I am happy that I have been selected in Kerala’s Under-25 squad.” Basith says he has been working laborious on his power-hitting of late, with former Kerala Ranji stars Raiphi Vincent Gomez and V.A. Jagadeesh. “I am also grateful to the coaches who have helped me in various stages of my career – M.A. Sunil, N.K. Umesh, N. Bijumon and H. Pratheesh,” says the person who admires Sachin Tendulkar and Kane Williamson. “A lot of training is required if you want to be a good finisher, which has been my role with the Kerala team after I made it to the team this year.” Source link The post Who’s Rajasthan Royals’ Kerala recruit Abdul Basith – Bus driver’s son following Sanju Samson’s footsteps appeared first on The Times of Bengal.","pubDate":"2022-12-24 13:40:31","image_url":null,"source_id":"the_tob","country":["india"],"category":["sports"],"language":"english"}]}