{"newsArray":[{"title":"McCullum: Test cricket in 'big trouble' if England aren't strong","link":"https://www.skysports.com/cricket/news/12040/12622871/brendon-mccullum-says-test-cricket-in-big-trouble-if-england-are-not-strong-and-watchable","keywords":null,"creator":null,"video_url":null,"description":"Brendon McCullum wants England to revive Test cricket during his spell as men's head coach - saying the global red-ball game is in \"big trouble\" if Ben Stokes' side are not \"competitive and watchable\".","content":"Last Updated: 01/06/22 5:57pm Please use Chrome browser for a more accessible video player Brendon McCullum wants England to revive Test cricket during his spell as men's head coach - saying the global red-ball game is in \"big trouble\" if Ben Stokes' side are not \"competitive and watchable\". McCullum takes over with England having won just one of their previous 17 Test matches, slipped to sixth in the world rankings and tumbled to the foot of the World Test Championship. The former New Zealand captain told Sky Sports' Michael Atherton England are the only side who can turn around what he calls the longest form's \"slightly downward path\". June 2, 2022, 10:00am Live on McCullum's first Test in charge is against his native New Zealand, the reigning World Test champions, at Lord's from Thursday, a game you can watch live on Sky Sports Cricket from 10am. Durham fast bowler Matthew Potts will make his Test debut, joining the recalled James Anderson and Stuart Broad in the pace attack. McCullum said: \"Test cricket needs England to be strong, competitive and playing a watchable style of cricket. If not, it is in big trouble. \"I think Test cricket has been on a slightly downward path and the only people who can change that really are England. The appreciation of Test cricket in this part of the world, the history. Please use Chrome browser for a more accessible video player \"They have a real opportunity to make significant change and hopefully inspire the next generation of cricketers to want to play Test cricket rather than just T20 or the shorter forms of the game. \"I carved my path in the short version of cricket but Test cricket has always been the pinnacle for me, the pinnacle of the sport. I know how hard it is. \"I was lucky enough to play for a number of years and go through the highs and the lows. You come out the other end and still look back on it so fondly, even through all the lows you go through.\" Reflecting on his appointment, McCullum said: \"It's a great time to take over - a great challenge and one I'm looking forward to. Please use Chrome browser for a more accessible video player \"There is quite a bit of thirst for change in English cricket and the players throughout the group seem like they are ready to head in a different direction. \"With Stokesy as captain, you have someone at the forefront and we will try and mould it around his style. I think our personalities are quite similar in how we want to see the game played.\" McCullum says he will find elements of trying to beat New Zealand \"difficult\" having played a huge part in their rise as a cricketing nation, including captaining them to the 2015 Cricket World Cup final. The 40-year-old added: \"It's obviously unique that we are coming up against New Zealand first up, a team I know so well, not just tactically but personally. \"I have had a lot of involvement as captain and more recently as a friend and a bit of a mentor to some of them. That is going to be difficult, no doubt, but I've got a job to do. Please use Chrome browser for a more accessible video player \"That job is to give England the best opportunity to become the best side in the world. It's not going to happen instantly but there is a path we are going to try and go down. Trying to beat New Zealand is part of that path.\" McCullum initially looked favourite for the white-ball coach role once new managing director of England men's cricket Rob Key opted to split the positions. The New Zealander and World Cup-winning white-ball captain Eoin Morgan share a strong friendship, while his previous coaching experience has been in limited-overs cricket. McCullum said: \"The England white-ball team is looking to go from good to great. \"My skills are probably a little bit more suited to trying to pull a team out of a troubled situation and project something forward for the long term. \"The job wasn't on my radar until Rob [Key] rang me. \"I had a lot of variety in my life - media work, a bit of coaching in the IPL - but then I started to think about the opportunity and it became exciting and enticing. \"It's a risk for me but you have to take risks in life and I thought it was worth a crack. \"People would be slightly surprised a cavalier T20 player would take on the big job of coaching the England Test side but people who know me, know I like a big challenge.\" Watch the first Test between England and New Zealand live on Sky Sports Cricket from 10am on Thursday.","pubDate":"2022-06-01 21:00:00","image_url":"https://e1.365dm.com/22/05/1920x1080/brendon-mccullum-england-test-cricket_5787395.jpg?20220528214906","source_id":"skysports","country":["united states of america","united kingdom","australia"],"category":["sports"],"language":"english"},{"title":"'No one remembers' bilateral T20I series, says Shastri","link":"https://www.thehansindia.com/sports/cricket/no-one-remembers-bilateral-t20i-series-says-shastri-746301","keywords":["Sports,Today NewsPaper,Cricket"],"creator":["The Hans India"],"video_url":null,"description":"Former India coach Ravi Shastri feels that the T20 format should only be restricted to World Cups","content":"Former India coach Ravi Shastri New Delhi: Former India coach Ravi Shastri feels that the T20 format should only be restricted to World Cups -- every two years -- to create a bigger window for franchise-based T20 tournaments like the Indian Premier League (IPL). Shastri, who was India's coach for the 2021 T20 World Cup, reckoned that \"no one remembers\" bilateral series of T20Is. \"Yes, absolutely, there's too much of bilateral stuff going on in T20 cricket,\" Shastri said on ESPNcricinfo's Runorder programme. \"I've said that (before), even when I was the coach of India, I could see it happening in front of my eyes. It should go the football way, where, in T20 cricket, you just play the World Cup. Bilateral tournaments - no one remembers,\" he added. \"I don't remember a single game in the last six-seven years as coach of India, barring the World Cup. A team wins the World Cup, they will remember it. Unfortunately, we didn't, so I don't remember that either. Where I am coming from is: you play franchise cricket around the globe; each country is allowed to have their franchise cricket, which is their domestic cricket, and then, every two years, you come and play a World Cup,\" Shastri said.","pubDate":"2022-06-01 19:00:49","image_url":"https://assets.thehansindia.com/h-upload/2022/06/01/500x300_1295579-ravi-shastri.jpg","source_id":"thehansindia","country":["india"],"category":["sports"],"language":"english"},{"title":"Lord’s ready for right royal occasion as Ben Stokes begins England reign | Ali Martin","link":"https://www.theguardian.com/sport/2022/jun/01/england-cricket-new-zealand-stokes-mccullum-reign","keywords":["England v New Zealand 2022","Ben Stokes","England cricket team","New Zealand cricket team","Cricket","Sport"],"creator":["Ali Martin at Lord's"],"video_url":null,"description":"Ben Stokes starts his Test captaincy at the home of cricket against the country of his birth, New ZealandThere promises to be a great deal of pomp and pageantry at Lord’s this week, if the preparations are anything to go by. With the Queen’s Jubilee apparently upon us, the union flags have been draped around the ground and the sound checks a day before the toss – deafening renditions of the national anthem over the public address system – point to an incoming avalanche of red, white and blue.But for those well-heeled enough to afford a ticket or subscribe to Sky Sports all this will be secondary when players take the field at 11am. England versus New Zealand, the reigning world champions, over five days at the Home of Cricket? Few adornments should be required to make this a special fixture, even if MCC were busy decorating the place while trying to ride out the grumbles about pricing. Continue reading...","content":"T here promises to be a great deal of pomp and pageantry at Lord’s this week, if the preparations are anything to go by. With the Queen’s Jubilee apparently upon us, the union flags have been draped around the ground and the sound checks a day before the toss – deafening renditions of the national anthem over the public address system – point to an incoming avalanche of red, white and blue. But for those well-heeled enough to afford a ticket or subscribe to Sky Sports all this will be secondary when players take the field at 11am. England versus New Zealand, the reigning world champions , over five days at the Home of Cricket? Few adornments should be required to make this a special fixture, even if MCC were busy decorating the place while trying to ride out the grumbles about pricing. The Spin | First Test, day one, Lord’s … and you are Jimmy Anderson Read more And, of course, this is the first step in a new journey for this England team after 12 months of pain, with Ben Stokes starting out his captaincy and Brendon McCullum having crossed the divide as head coach . The pair barely knew each other before Rob Key, the new managing director, threw them together but they appear cut from similar cloth. Certainly the messages they are preaching mark a return to the simple, earthy cricketing truism of taking it a Test at a time that seemed to get lost during the previous regime. That it is the Black Caps first up for the Stokes-McCullum axis adds a further layer of poetic narrative, for those looking on at least. Stokes may have spent the first 12 years of his life on the South Island, his late father, Ged, played rugby league for the Kiwis, while his mother, Deborah, and brother, James, have made the 12,000-mile trip from Christchurch to watch in person, but any extra sentiment will be kept in check. Matthew Potts will make his Test debut after an impressive start to the season with Durham. Photograph: Paul Childs/Action Images/Reuters “I’m very proud of where I came from, and my heritage and family and all that kind of stuff,” said Stokes, looking relaxed at the first of what may be a good few pre-match press conferences to come. “But, you know, I’ve had the England shirt on over 200 times. So, at the end of the day, it’s England versus New Zealand and I’m English. In terms of any extra emotions, it would be the same if I was doing it against Australia.” It was Australia, of course, who set in motion the changes which have led to Stokes at the tiller, the 4-0 Ashes hammering over the winter – followed by a dismal 1-0 defeat in the Caribbean – bringing an end to Joe Root’s five-years in charge . Stokes, who demonstrated an early divergence from his predecessor by bluntly calling out the ticket prices , said he is not a fan of the term “red-ball reset”, however, preferring to label this week a “blank canvas” for his players, be they old or new. Sign up for The Spin. He and McCullum have opted for a similar palette as before and opted to name their final XI a day out. People often wonder why a team would show their hand to opponents before the toss but in this instance, with the bulk of the side well flagged – including returns for Jimmy Anderson and Stuart Broad, plus Ollie Pope’s rise to No 3 – it was simply a case of letting the one newcomer, Matthew Potts, settle in. A 23-year-old seamer from Sunderland who looks impressively fit and bowls a heavy ball, Potts has started this summer with Durham like a freight train. Stokes was on the field for three of the six performances that have returned 35 wickets so far and it was an ability to transcend the early season run-fest, plus a career-best seven for 40 against Glamorgan, that convinced the new Test captain that Potts was good to go. Brendon McCullum takes part in a nets session. The captains and head coaches of both sides in this series were all born in New Zealand. Photograph: Paul Childs/Action Images/Reuters Stokes said: “The one thing that really made my mind up about Potts was when he bowled us to victory against Glamorgan. He turned up on day four with a bit of a stiff side and someone in his situation, with Test selection coming round the corner, he could have just sat back and said: ‘No, I am going to just look after myself here.’ But he didn’t, he ran in and he won the game for Durham. “That’s the attitude that sets you at the next level and makes you open your eyes that this kid is ready. He’s been phenomenal: he’s an athlete and everything I expect this team to be.” Potts ahead of Craig Overton – with Jack Leach playing his first home Test since 2019 – means a long tail and, with issues over the top order a hardy perennial, much will come down to the experienced hub of Root, Jonny Bairstow and Stokes on what looks a beige, flat pitch. Quick Guide Teams for the first Test Show England Crawley, Lees, Pope, Root, Bairstow, Stokes (c), Foakes (wkt), Potts, Leach, Broad, Anderson. New Zealand (possible) Latham, Young, Williamson (c), Conway, Mitchell, De Grandhomme, Blundell (wk), Jamieson, Southee, Henry, Patel. Was this helpful? Thank you for your feedback. Root will also be adjusting to life back in the ranks but, unlike a good number to attempt this previously, it is a case of trying to keep the runs flowing from his bat after a personally golden 12 months. Stokes, who will not have an official vice-captain at first, intends to seek his advice only when required. Stokes said: “[Root] is always going to be there offering support but also said he doesn’t want to feel like he’s getting in the way. I said the same to him: ‘Mate, just concentrate on your batting now, you don’t have all the extra responsibility on your shoulders. Don’t feel like you have to come to me, just concentrate on getting your runs.’” Promoting Pope means England’s new Test era starts with middle-order muddle | Mark Ramprakash Read more The New Zealand side they meet can be viewed in one of two ways. The tourists have lost two pillars of their top seven through the retirements of Ross Taylor and BJ Watling, while Henry Nicholls makes it a third after contracting Covid-19. Trent Boult is a late arrival from India, Kane Williamson is battling for form after elbow problems and, as well as two drawn home series against South Africa and Bangladesh last season, they lost their last warm-up match against a County Select XI that featured one capped player. But then it is worth remembering that last summer, as English minds got into a funk about rest and rotation, New Zealand made six changes to their XI at Edgbaston and still claimed a thumping win and the series 1-0 . Will Young and Matt Henry, two of the architects, then stepped aside for the World Test Championship final that followed, demonstrating an enviably deep and ego-free squad at their disposal. This is one of a number of Kiwi traits the hosts are unashamedly looking to replicate as, in the words of Stokes, they try to “make England great again”. Whether this goal is achievable or not is the great unknown but it starts with the bunting already up at Lord’s.","pubDate":"2022-06-01 19:00:17","image_url":"https://i.guim.co.uk/img/media/3b48131500e6dff03d03c40430b246a96020c034/0_57_3500_2100/master/3500.jpg?width=460&quality=85&auto=format&fit=max&s=ff3cea4fb1b1784763c72c9b7042952e","source_id":"theguardian","country":["united kingdom","india","singapore","canada"],"category":["sports"],"language":"english"},{"title":"“Buy tickets or pay your leccy bill?”: High Lord’s Test ticket prices for ENG vs NZ 1st Test match angers English Cricket fans","link":"https://thesportsrush.com/cricket-news-buy-tickets-or-pay-your-leccy-bill-high-lords-test-ticket-prices-for-eng-vs-nz-1st-test-match-angers-english-cricket-fans/","keywords":["Cricket","England","Lord's Test","New Zealand","New Zealand tour of England 2022"],"creator":["Gurpreet Singh"],"video_url":null,"description":"High Lord’s Test ticket prices set by the Marylebone Cricket Club (MCC) has disappointed and angered a significant section of English fans. The iconic Lord’s Cricket Ground is all geared up to deck up in a sea of Blue, White, and Red, during the first Test between England and New Zealand, as Britain would celebrate… The post “Buy tickets or pay your leccy bill?”: High Lord’s Test ticket prices for ENG vs NZ 1st Test match angers English Cricket fans appeared first on The SportsRush.","content":"High Lord’s Test ticket prices set by the Marylebone Cricket Club (MCC) has disappointed and angered a significant section of English fans. The iconic Lord’s Cricket Ground is all geared up to deck up in a sea of Blue, White, and Red, during the first Test between England and New Zealand, as Britain would celebrate the Platinum Jubilee of Queen Elizabeth II to honour her on becoming the world’s third-longest serving monarch in recorded history. Apart from the aforementioned grand event, the English fans in particular also await to look forward to some exciting Cricketing action as Ben Stokes would lead the side for the first time as full-time Test captain, also with Brendon McCullum as the new head coach. However, with just a half-day’s time left for the commencement of the first of the three-match Test series, nearly 16,000 tickets, as per ESPNcricinfo, are yet to be sold, including 9,000 of them for Day 4 on Sunday. A huge section of the fans have blamed it on the excessively high price of the tickets on offer at a time when UK is experiencing a high cost-of-living, coupled with the ever rising rate of inflation. Majority of tickets were of the £110-160 bracket, including the Under-16 age group ones as well, with concessions only on offer in the cheapest price bracket for the latter. Lords say it’s the jubilee bank holiday that’s caused low ticket sales. But I also believe cost of tickets is a significant factor. Not just at Lord’s but across all of cricket. Buy tickets or pay your leccy bill? Not much of a choice is it. — Elizabeth Ammon (@legsidelizzy) May 30, 2022 MCC’s biggest mis-step on ticketing for the Lord’s Test is only offering concessions in the cheapest price brackets Charging £100+ for an Under-16 ticket is pure greed – made worse by the fact it takes place on a bank holiday during half-term — Matt Roller (@mroller98) May 31, 2022 Ben Stokes and Michael Vaughan react on High Lord’s Test ticket prices Skipper Ben Stokes, on Wednesday reacted on the issue at hand as well, and stood by the spectators’ concerns while asserting that the ticket prices does need to be looked at. “We want to be attracting people to come and watch us because of the cricket that we play and how successful we are. But I guess you have to look at how much it’s going to cost someone to get into the ground,” remarked Stokes. Former England skipper Michael Vaughan expressed his displeasure on the same, while also urged the ECB to reconsider allotment of two Test matches to Lord’s each summer. “You can’t keep saying, ‘we are Lord’s, we need two Test matches a year’ and then charge over £150 in the holidays, during the jubilee and during a cost-of-living crisis,” he said. “It’s scandalous that Lord’s thinks it can get away with a ticket price for one day of Test cricket that is the same as what you would charge for a season ticket for the Hundred. We have all these administrators telling us Test cricket is the pinnacle and then they do this,” he further added. The post “Buy tickets or pay your leccy bill?”: High Lord’s Test ticket prices for ENG vs NZ 1st Test match angers English Cricket fans appeared first on The SportsRush.","pubDate":"2022-06-01 18:44:21","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"India to play three ODIs, five T20Is against West Indies in July and August","link":"https://telanganatoday.com/india-to-play-three-odis-five-t20is-against-west-indies-in-july-and-august","keywords":["Cricket","News","Sport","Cricket West Indies","India","Kieron Pollard","Rohit Sharma","West Indies"],"creator":["ANI"],"video_url":null,"description":"Bridgetown: The Cricket West Indies (CWI) on Wednesday confirmed the schedule for the Men in Maroon who will play 3 ODIs and 5 T20Is against the touring team India starting from July 22. The series is highly awaited as India returns to the Caribbean after three years and will be led by new captains Rohit […]","content":"Bridgetown: The Cricket West Indies (CWI) on Wednesday confirmed the schedule for the Men in Maroon who will play 3 ODIs and 5 T20Is against the touring team India starting from July 22. The series is highly awaited as India returns to the Caribbean after three years and will be led by new captains Rohit Sharma and Nicholas Pooran, with the latter taking over the reins from Kieron Pollard. The series will be a culmination of an action-packed summer for both the teams in the buildup to the ICC Men’s T20 World Cup 2022. India’s white-ball tour will commence on July 22 in Trinidad and Tobago with three ODIs from July 22 to 27 at Queen’s Park Oval, Port of Spain and the entire series will be live-streamed exclusively on FanCode. The first T20I on Friday, July 29 will be historic as the first ever Men’s T20I to be played at the Brian Lara Cricket Academy in the south of Trinidad. Men in Blue will play total of five T20Is from July 29 to August 07, the matches will be played at Broward County Cricket Stadium and Warner Park. The final two games, in order to cater to the Indian diaspora in the United States, will be held at the Broward County Stadium in Florida on August 6 and 7. The ODI series and three T20Is will be hosted across Trinidad and Tobago and St Kitts & Nevis, with the final two T20Is scheduled for Lauderhill, Florida in the USA.   Now you can get handpicked stories from Telangana Today on Telegram everyday. Click the link to subscribe. Click to follow Telangana Today Facebook page and Twitter .","pubDate":"2022-06-01 18:07:03","image_url":null,"source_id":"telanganatoday","country":["india"],"category":["sports"],"language":"english"},{"title":"'I wouldn't have played for the country if....': Mahendra Singh Dhoni","link":"https://www.indiatvnews.com/sports/cricket/ms-dhoni-speaks-at-silver-jubilee-of-the-thiruvallur-district-cricket-association-says-cricketers-should-be-proud-of-playing-for-district-2022-06-01-781223","keywords":null,"creator":null,"video_url":null,"description":"Speaking at a ceremony to mark the silver jubilee of the Thiruvallur District Cricket Association, MS Dhoni said that cricketers should be proud of representing their district as it is the stepping stone to the higher level.","content":"Speaking at a ceremony to mark the silver jubilee of the Thiruvallur District Cricket Association, said that cricketers should be proud of representing their district as it is the stepping stone to the higher level. \"It is the first time I am part of a celebration where we are celebrating the success of a district association. I would also like to thank my district cricket association back home (Ranchi). Cricketers should be proud of representing their district. The World Cup winning captain stressed that although he is happy to have represented the country, it wouldn't have been possible if he hadn't played for his district or school. Dhoni was part of the event as the chief guest alongside former ICC Chairman and former BCCI president N Srinivasan. He also lauded Thiruvallar District Cricket Association for completing 25 years. \"Congratulations to the Thiruvallur District Cricket Association for completing 25 years. It's more than 25 years, but we are celebrating it today. I have known (RN) Baba (TDCA secretary) for a very long time. A big congrats to not only him but also others in the association,” he added. Speaking on the occasion, Srinivasan said, \"For any association to last long is not easy. The love for the game makes him (Baba) work for cricket. He has developed grounds, cricketers, and outstanding sportspersons.\" \"And, the association has taught everyone the value of sportsmanship. I wish them (the TDCA) more laurels and further greatness,\" he added. The TDCA, in association with the Tamil Nadu Sports Journalists’ Association (TNSJA), gave away scholarships to the tune of Rs 3 lakh to ten sportspersons from different disciplines in the State of Tamil Nadu with Dhoni handing over the cheques. India Cements Wholetime Director Rupa Gurunath, CSK CEO KS Viswanathan, and Tamil Nadu Cricket Association office-bearers also attended the function. A host of male and female cricketers, including India internationals Ravichandran Ashwin, , and MD Thirushkamini, congratulated the TDCA via video messages. TDCA secretary Dr R N Baba, who was the media manager of the Indian cricket team between 2012 and 2015 including the 2013 Champions Trophy and 2015 World Cup, proposed a vote of thanks. (Inputs PTI)","pubDate":"2022-06-01 18:05:41","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"MS Dhoni visits a local cricket academy in Tamil Nadu, says 'I wouldn't have played for India if..'","link":"https://zeenews.india.com/cricket/ms-dhoni-visits-a-local-cricket-academy-in-tamil-nadu-says-i-wouldnt-have-played-for-india-if-2469562.html","keywords":null,"creator":null,"video_url":null,"description":"Dhoni was speaking at a ceremony to mark the silver jubilee of the Thiruvallur District Cricket Association (TDCA) in which he participated as the chief guest alongside former ICC Chairman and former BCCI president N Srinivasan","content":"Chennai Super Kings captain MS Dhoni passed on some words of wisdom when he visited a local cricket academy in Thiruvallur district of Tamil Nadi on June 1 (Wednesday). \"It is the first time I am part of a celebration where we are celebrating the success of a district association. I would also like to thank my district cricket association back home (Ranchi). Cricketers should be proud of representing their district. I am proud of the fact that I got the chance to represent my country, but it wouldn't have happened if I hadn't played for my district or school,\" Dhoni said. He was speaking at a ceremony to mark the silver jubilee of the Thiruvallur District Cricket Association (TDCA) in which he participated as the chief guest alongside former ICC Chairman and former BCCI president N Srinivasan. #ThalaDharisanam at Namma Singara Chennai! All smiles and happy vibes _ #WhistlePodu #Yellove _ pic.twitter.com/hSFhsZul1O — Chennai Super Kings (@ChennaiIPL) June 1, 2022 Pics from today's event __ @msdhoni pic.twitter.com/lFxRmaO8FB — akshayakash (@akshayakash2636) June 1, 2022 Dhoni also lauded Thiruvallar District Cricket Association for completing 25 years. \"Congratulations to the Thiruvallur District Cricket Association for completing 25 years. It's more than 25 years, but we are celebrating it today. I have known (RN) Baba (TDCA secretary) for a very long time. A big congrats to not only him but also others in the association,? he added. Speaking on the occasion, Srinivasan said, \"For any association to last long is not easy. The love for the game makes him (Baba) work for cricket. He has developed grounds, cricketers, and outstanding sportspersons.\" \"And, the association has taught everyone the value of sportsmanship. I wish them (the TDCA) more laurels and further greatness,\" he added. The TDCA, in association with the Tamil Nadu Sports Journalists' Association (TNSJA), gave away scholarships to the tune of Rs 3 lakh to ten sportspersons from different disciplines in the State of Tamil Nadu with Dhoni handing over the cheques. India Cements Wholetime Director Rupa Gurunath, CSK CEO KS Viswanathan, and Tamil Nadu Cricket Association office-bearers also attended the function. A host of male and female cricketers, including India internationals Ravichandran Ashwin, Dinesh Karthik, and MD Thirushkamini, congratulated the TDCA via video messages. TDCA secretary Dr R N Baba, who was the media manager of the Indian cricket team between 2012 and 2015 including the 2013 Champions Trophy and 2015 World Cup, proposed a vote of thanks. With PTI inputs","pubDate":"2022-06-01 17:55:00","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"India's tour of West Indies: Know full details and schedule","link":"https://www.indiatvnews.com/sports/cricket/india-to-play-3-odis-and-5-t20is-vs-west-indies-between-july-22-to-august-7-two-games-in-florida-2022-06-01-781210","keywords":null,"creator":null,"video_url":null,"description":"India will take on the West Indies in a 3-match ODI series and a 5-match T20I series from July 22 to August 7, BCCI and Cricket West Indies announced on Wednesday.","content":"India will take on the West Indies in a 3-match ODI series and a 5-match T20I series from July 22 to August 7, BCCI and Cricket West Indies announced on Wednesday. The ODI matches will begin at 7 PM I.S.T and the T20Is will start at 8 PM I.ST. The final two T20Is will be held at the Broward County Stadium in Florida on August 6 and 7, to cater to the Indian diaspora in the United States. India will finish its white-ball leg of the UK tour on July 17, and those selected would directly leave for the West Indies from England. The ODI series and three T20Is will be hosted across Trinidad and Tobago and St Kitts & Nevis, with the final two T20Is scheduled to be held in Fort Lauderhill, Florida in the USA. The three ODIs will be played on July 22, 24 and 27 respectively at Port of Spain's (Trinidad & Tobago) iconic Queen's Park Oval and will be followed by five T20Is, two of which will be played at Florida's Fort Lauderhill. The first T20I will be held at Brian Lara Stadium (Port of Spain) on July 29 and followed by two games at St Kitt's Warner Park on August 1 and 2 respectively. The entire series will be live-streamed exclusively on FanCode. West Indies captain Nicholas Pooran said about the upcoming series, \"We have a young team that is eager to restore the brand of cricket the West Indies team is known for playing. \"As I take charge of this team, our ambition is to always be competitive, as we look to use this series to fine-tune our preparations for the upcoming T20 and 50 Over World Cups.\" Talking about this, Johnny Grave, CEO of Cricket West Indies said: \"Our four-year deal with FanCode has brought Indian cricket fans closer to CWI's live properties across multiple formats that have featured the top cricketing nations like South Africa, Pakistan, Australia and England. \"FanCode has become the go-to platform for Indian fans to consume cricket in a digital-first manner which has redefined the sports viewing experience.\" (Inputs PTI)","pubDate":"2022-06-01 17:11:23","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"India to play 3 ODIs and 5 T20Is vs West Indies between July 22-August 7","link":"https://www.business-standard.com/article/sports/india-to-play-3-odis-and-5-t20is-vs-west-indies-between-july-22-august-7-122060101432_1.html","keywords":null,"creator":null,"video_url":null,"description":"The Cricket West Indies (CWI) and the BCCI on Wednesday announced India's tour of the West Indies where the 'Men in Blue' will play three ODIs and five T20Is between July 22 and August 7. India will finish its white-ball leg of UK tour on July 17 and those selected would directly leave for the West Indies from England. The ODI series and three T20Is will be hosted across Trinidad and Tobago and St Kitts & Nevis, with the final two T20Is scheduled to be held in Fort Lauderhill, Florida in the USA. The three ODIs will be played on July 22, 24 and 27 respectively at Port of Spain's (Trinidad & Tobago) iconic Queen's Park Oval and will be followed by five T20Is, two of which will be played at Florida's Fort Lauderhill. The first T20I will be held at Brian Lara Stadium (Port of Spain) on July 29 and followed by two games at St Kitt's Warner Park on August 1 and 2 respectively. The final two games, in order to cater to the Indian diaspora in the United States, will be held at the ...","content":"The Cricket West Indies (CWI) and the BCCI on Wednesday announced India's tour of the West Indies where the 'Men in Blue' will play three ODIs and five T20Is between July 22 and August 7. India will finish its white-ball leg of UK tour on July 17 and those selected would directly leave for the West Indies from England. The ODI series and three T20Is will be hosted across Trinidad and Tobago and St Kitts & Nevis, with the final two T20Is scheduled to be held in Fort Lauderhill, Florida in the USA. The three ODIs will be played on July 22, 24 and 27 respectively at Port of Spain's (Trinidad & Tobago) iconic Queen's Park Oval and will be followed by five T20Is, two of which will be played at Florida's Fort Lauderhill. The first T20I will be held at Brian Lara Stadium (Port of Spain) on July 29 and followed by two games at St Kitt's Warner Park on August 1 and 2 respectively. The final two games, in order to cater to the Indian diaspora in the United States, will be held at the Broward County Stadium in Florida on August 6 and 7. The entire series will be live-streamed exclusively on FanCode. West Indies captain Nicholas Pooran said on the upcoming series, \"We have a young team that is eager to restore the brand of cricket the West Indies team is known for playing. \"As I take charge of this team, our ambition is to always be competitive, as we look to use this series to fine tune our preparations for the upcoming T20 and 50 Over World Cups.\" Talking about this, Johnny Grave, CEO of Cricket West Indies said: \"Our four-year deal with FanCode has brought Indian cricket fans closer to CWI's live properties across multiple formats that has featured the top cricketing nations like South Africa, Pakistan, Australia and England. \"FanCode has become the go-to platform for Indian fans to consume cricket in a digital-first manner which has redefined the sports viewing experience.\" Itinerary ODIs 1st ODI: July 22 (Queens Park Oval, Port of Spain) 2nd ODI: July 24 (Queens Park Oval, Port of Spain) 3rd ODI: July 27 (Queens Park Oval, Port of Spain) All ODI matches live from 7 pm IST T20Is 1st T20I: July 29: (Brian Lara Stadium, Port of Spain) 2nd T20I: Aug 1 (Warner Park, St Kitts & Nevis) 3rd T20I: Aug 2 (Warner Park, St Kitts & Nevis) 4th T20I: Aug 6 (Broward County Ground, Florida, USA) 5th T20I: Aug 7 (Broward County Ground, Florida, USA) All T20I matches live from 8 pm IST. (Only the headline and picture of this report may have been reworked by the Business Standard staff; the rest of the content is auto-generated from a syndicated feed.)","pubDate":"2022-06-01 17:09:00","image_url":"https://bsmedia.business-standard.com/_media/bs/img/article/default/1220601/thumb-122060101432.jpg","source_id":"business-standard","country":["india"],"category":["sports"],"language":"english"},{"title":"India to tour West Indies for 3 ODIs, 5 T20Is in July-August","link":"https://sportstar.thehindu.com/cricket/india-tour-of-west-indies-july-august-3-odis-5-t20is-cricket-schedule/article38499819.ece","keywords":null,"creator":["Team Sportstar"],"video_url":null,"description":"India is set to tour West Indies from July 22 to August 7 for three One-Day Internationals (ODIs) and five T20 Internationals (T20Is), according to press release by Cricket West Indies on Wednesday.","content":"India is set to tour West Indies from July 22 to August 7 for three One-Day Internationals (ODIs) and five T20 Internationals (T20Is), according to a press release issued by Cricket West Indies on Wednesday. INDIA TOUR OF WEST INDIES SCHEDULE July 22: First ODI - Queen's Park Oval, Trinidad. July 24: Second ODI - Queen's Park Oval, Trinidad. July 27: Third ODI - Queen's Park Oval, Trinidad. July 29: First T20I: Brian Lara Cricket Academy, Trinidad. August 1: Second T20I: Warner Park, St. Kitts. August 2: Third T20I: Warner Park, St. Kitts. August 6: Fourth T20I: Broward County Cricket Stadium, Lauderhill, Florida, USA. August 7: Fifth T20I: Broward County Cricket Stadium, Lauderhill, Florida, USA. In a full list of fixtures released on Wednesday, West Indies will also host Bangladesh and New Zealand between June and August.","pubDate":"2022-06-01 17:03:09","image_url":null,"source_id":"sportstar","country":["india"],"category":["sports"],"language":"english"},{"title":"Highlights and goals: Kuwait 2-0 Singapore in friendly - VAVEL.com","link":"https://news.google.com/__i/rss/rd/articles/CBMiPGh0dHBzOi8vd3d3LnZhdmVsLmNvbS9lbi11cy9zb2NjZXIvMjAyMi8wNi8wMS8xMTEzMjUwLWEuaHRtbNIBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Highlights and goals: Kuwait 2-0 Singapore in friendly  VAVEL.comFootball: No room for mistakes, says Hariss ahead of Lions' Asian Cup qualifiers  The Straits TimesSix Nations T20 League 2022: Full squads, Fixtures & Preview: All you need to know  Cricket WorldInternational Friendlies – Kuwait vs Singapore Preview & Prediction  The Stats ZoneCricket Betting Tips and Fantasy Cricket Match Predictions: Six Nations T20 League 2022 - Afghanistan XI vs Sri Lankan XI, Match 1: 2nd June  Cricket WorldView Full coverage on Google News","content":null,"pubDate":"2022-06-01 16:59:31","image_url":null,"source_id":"google","country":["singapore"],"category":["sports"],"language":"english"},{"title":"Sourav Ganguly resign from BCCI president: Has Sourav Ganguly resigned as president of BCCI?","link":"https://thesportsrush.com/cricket-news-sourav-ganguly-resign-from-bcci-president-has-sourav-ganguly-resigned-as-president-of-bcci/","keywords":["Cricket","BCCI","BCCI president","Sourav Ganguly"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Sourav Ganguly resign from BCCI president: Ganguly’s tweet on Wednesday evening have raised suspicions of his possible step down from the post. Board of control for Cricket in India (BCCI) president Sourav Ganguly, had took to his Twitter handle to thank all the people involved on him completing 30 years of Cricketing journey, which started… The post Sourav Ganguly resign from BCCI president: Has Sourav Ganguly resigned as president of BCCI? appeared first on The SportsRush.","content":"Sourav Ganguly resign from BCCI president: Ganguly’s tweet on Wednesday evening have raised suspicions of his possible step down from the post. Board of control for Cricket in India (BCCI) president Sourav Ganguly, had took to his Twitter handle to thank all the people involved on him completing 30 years of Cricketing journey, which started in the year 1992. However, post the aforementioned part of his tweet, Ganguly also went on to add that he is ‘planning to start something’ that might help a lot of people, while also requesting them to support him as he enters this chapter of his life. It is the last line of the piece of text that was picked up by the people on social media, which perhaps was an intimation enough that the former Indian team skipper has made up his mind to step down from the Indian Cricket team board’s Presidency post. pic.twitter.com/JrHOVvH3Vi — Sourav Ganguly (@SGanguly99) June 1, 2022 A clarification from the BCCI secretary Jay Shah minutes later, had managed to clear the fog from the speculation. Sourav Ganguly resign from BCCI president As per the news agency ANI, Jay Shah has rubbished all the unverified reports and conjectures regarding Sourav Ganguly stepping down from the post of BCCI president. Shah, in fact, went on to add that both Ganguly and him are pretty much focused on the betterment of Indian Cricket and, and the upcoming media rights auction for the next five year period of the IPL. “The rumours doing rounds about Mr. Sourav Ganguly stepping down from the post of BCCI President are factually incorrect. We have some exciting times in the form of media rights coming up and my colleagues and I are completely focused on the upcoming opportunity and safeguarding the interest of Indian cricket,” Shah told ANI. It is worth of a mention that Ganguly, who was elected as BCCI president in October 2019, is only left with a four-month contract period tenure, slated to end in September 2022. The post Sourav Ganguly resign from BCCI president: Has Sourav Ganguly resigned as president of BCCI? appeared first on The SportsRush.","pubDate":"2022-06-01 16:53:08","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Goosebumps! Trailer of documentary based on Border-Gavaskar trophy - Bandon Mein Tha Dum out now","link":"https://www.indiatvnews.com/sports/cricket/goosebumps-trailer-of-neeraj-pandey-s-documentary-based-on-border-gavaskar-trophy-bandon-mein-tha-dum-out-now-2022-06-01-781209","keywords":null,"creator":null,"video_url":null,"description":"The trailer for the much-anticipated documentary - Bandon Mein Tha Dum - which tells the story of arguably the greatest series win of modern-day cricket - India's win over Australia in the Border-Gavaskar Trophy - is out now.","content":null,"pubDate":"2022-06-01 16:44:03","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"“It’s significantly improved, which is the pleasing thing”: Kane Williamson gives update on his elbow injury ahead of ENG vs NZ 1st test","link":"https://thesportsrush.com/cricket-news-its-significantly-improved-which-is-the-pleasing-thing-kane-williamson-gives-update-on-his-elbow-injury-ahead-of-eng-vs-nz-1st-test/","keywords":["Cricket","Blackcaps","ENG vs NZ","Kane Williamson"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"Blackcaps skipper Kane Williamson has given an update on Trent Boult’s availability and his elbow injury ahead of the Lord’s test. England will take on New Zealand in the first test of the three-match test series at the Lord’s in London. This is an important series for the English team, who have just won one… The post “It’s significantly improved, which is the pleasing thing”: Kane Williamson gives update on his elbow injury ahead of ENG vs NZ 1st test appeared first on The SportsRush.","content":"Blackcaps skipper Kane Williamson has given an update on Trent Boult’s availability and his elbow injury ahead of the Lord’s test. England will take on New Zealand in the first test of the three-match test series at the Lord’s in London. This is an important series for the English team, who have just won one of their last 17 tests, whereas New Zealand are also at the 6th position in the World Test Championship. Kane Williamson is back to lead the Blackcaps after a series of elbow injuries, but there is a doubt about the availability of Trent Boult. Ahead of the match, Kane Williamson addressed the press and answered some of the questions. New Zealand’s skipper Kane Williamson is coming on the back of a very poor Indian Premier League 2022 campaign with the bat. Williamson scored just 216 runs in IPL 2022 at a dreadful average of 19.63, whereas he had a nominal strike-rate of 93.50. Williamson, who last played a test match in November 2021, missed the whole home summer of cricket due to his persistent elbow injury. Kane Williamson struggled in the practice game against the County XI as well. Ahead of the first test, Williamson has given an update on his elbow injury. Williamson said that the elbow has improved significantly and taking some time out of the game has helped him significantly. “It’s significantly improved, which is the pleasing thing,” Williamson said. “Obviously having that time out of the game was beneficial to get it back on track somewhat. Although it was a very frustrating period of grappling with it.” The reigning ICC World Test Champions gearing up for the first #ENGvNZ Test at Lord’s 💪 #WTC23 | @BLACKCAPS pic.twitter.com/K3DWvHEJ0i — ICC (@ICC) May 31, 2022 It is being said that Trent Boult can miss this match due to a lack of red-ball practice. Trent Boult recently played the IPL 2022 final on 29 June 2022 and he immediately joined the team after the match. Williamson said that the decision on Trent Boult will be taken after the final training session. “He (Boult) needs to get through training today,” Williamson said. “Trent is obviously a world-class player and we’ve got a great variety in our bowling attack.” “So, we’ll be having a look at the surface and working out what we want to go with, and that balance, and who’s all ready to go.”","pubDate":"2022-06-01 16:24:17","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Lord’s Cricket Ground weather Day 1: What is the weather forecast for 1st ENG vs NZ Test match at Lord’s in London?","link":"https://thesportsrush.com/cricket-news-lords-cricket-ground-weather-day-1-what-is-the-weather-forecast-for-1st-eng-vs-nz-test-match-at-lords-in-london/","keywords":["Cricket","England","Lord's Cricket Ground","New Zealand","New Zealand tour of England 2022"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Lord’s Cricket Ground weather Day 1: The venue would also celebrate Queen Elizabeth’s seven decades on the throne during the Test match. The iconic Lord’s Cricket Ground is all geared up to deck up in a sea of Blue, White, and Red, during the first Test between England and New Zealand, as Britain would celebrate… The post Lord’s Cricket Ground weather Day 1: What is the weather forecast for 1st ENG vs NZ Test match at Lord’s in London? appeared first on The SportsRush.","content":"Lord’s Cricket Ground weather Day 1: The venue would also celebrate Queen Elizabeth’s seven decades on the throne during the Test match. The iconic Lord’s Cricket Ground is all geared up to deck up in a sea of Blue, White, and Red, during the first Test between England and New Zealand, as Britain would celebrate the Platinum Jubilee of Queen Elizabeth II to honour her on becoming the world’s third-longest serving monarch in recorded history. The grand event would also mark the beginning of a new era for the England men’s Cricket team who would take the field under the leadership of Ben Stokes and Brendon McCullum – their new captain and head coach respectively. The Ben Stokes-led side have even named their playing 11 for the Test, which has confirmed a return back of their fast bowling duo of James Anderson and Stuart Broad, with the Durham pacer Matthew Potts set to make his debut to complete the pace bowling trio. The perfect partnership. #LoveLords | #ENGvNZ pic.twitter.com/6MRtYOmzuH — Lord’s Cricket Ground (@HomeOfCricket) June 1, 2022 New Zealand, meanwhile might begin without the services of their frontline pacer Trent Boult and Southpaw batter Henry Nicholls, with an out of form Kane Williamson in all readiness to collect some vital World Test Championship (2021-23) points for his side. The weather forecast in the coming week at the city of London does not look promising, but a breather of sorts for the fans is that the rain Gods are likely to show some mercy on the first two days of the first Test match. As per Accuweather, with a maximum temperature of 20 degree Celcius, the Thursday morning (Day 1) at the venue is likely to experience some fog initially, but will become pleasant with the sun shining nice and bright for the rest of the day. With the second day of the Test likely to remain unaffected by the weather as well, the forecast for the rest of the three days (from Saturday morning through Monday evening) is likely to interrupt the match proceedings with the chances of rain increasing to more than 80%.","pubDate":"2022-06-01 15:29:29","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"“I just want everyone to feel free under my captaincy”: Ben Stokes insists on giving freedom to every player ahead of ENG vs NZ Tests","link":"https://thesportsrush.com/cricket-news-i-just-want-everyone-to-feel-free-under-my-captaincy-ben-stokes-insists-on-giving-freedom-to-every-player-ahead-of-eng-vs-nz-tests/","keywords":["Cricket","Ben Stokes","ENG vs NZ","England vs New Zealand"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"Ben Stokes addressed a press conference ahead of the first test against New Zealand at the Lord’s Stadium in London. In less than 24 hours, the home-cricketing summer of England is set to start at the Mecca of cricket. England will face New Zealand in the first test of the 3-match series. This is an… The post “I just want everyone to feel free under my captaincy”: Ben Stokes insists on giving freedom to every player ahead of ENG vs NZ Tests appeared first on The SportsRush.","content":"Ben Stokes addressed a press conference ahead of the first test against New Zealand at the Lord’s Stadium in London. In less than 24 hours, the home-cricketing summer of England is set to start at the Mecca of cricket. England will face New Zealand in the first test of the 3-match series. This is an important series for the home team under the new duo of Brendon McCullum and Ben Stokes. This is McCullum’s first-ever assignment as an international coach, whereas Ben Stokes has replaced Joe Root as the new captain of the side. Ben Stokes insists on giving freedom to players Ahead of the first test against New Zealand at the Lord’s, Ben Stokes attended a press conference where he said that he want every player to play with freedom under him. He also highlighted the fact that he is seeing this phase as a black canvas and not a reset button. “I just want everyone to feel free under my captaincy,” Stokes said to the press. “Obviously there has been talk around the word ‘reset’, which is something I don’t particularly like. I just see this as a complete and utter blank canvas for this Test team going forward.” “I want everyone to feel free.” Ben Stokes is very relaxed and confident in his first pre-Test press conference as full-time skipper. “I’m not nervous.” #ENGvNZ pic.twitter.com/7x7WGvDaJH — Adam Collins (@collinsadam) June 1, 2022 Ben Stokes highlighted the fact that the experience of him along with Joe Root, James Anderson, Stuart Broad and Jonny Bairstow will be beneficial for the young guys. Durham’s pacer Matty Potts is making his debut in the first test, and being from Durham himself, Stokes said that Potts has done really well for the side, and he has always been the wicket-taker. “Obviously he’s a Durham lad – there’s no bias there,” Stokes said. “I’ve got to know him over the years at Durham, and he has been outstanding in the games I have played, and even before that – he has been the guy that Scott Borthwick [their captain] has turned to to take the wickets.” The post “I just want everyone to feel free under my captaincy”: Ben Stokes insists on giving freedom to every player ahead of ENG vs NZ Tests appeared first on The SportsRush.","pubDate":"2022-06-01 14:58:29","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Explained: Who is Iga Swiatek, the Polish tennis star on the verge of breaking Serena Williams' record","link":"https://www.firstpost.com/sports/explained-who-is-iga-swiatek-the-polish-tennis-star-on-the-verge-of-breaking-serena-williams-record-10745821.html","keywords":["Sports"],"creator":["FP Sports"],"video_url":null,"description":"Explained: Who is Iga Swiatek, the Polish tennis star on the verge of breaking Serena Williams' record","content":"The game of musical chairs as far as Grand Slam champions in the WTA circuit is concerned has been going over for over seven years now. Since 23-time champion Serena Williams won four back-to-back Majors in 2014-15, the women's singles events have either seen their title favourites go down, at times in straight sets, or more recently enter the tournament without a clear-cut challenger.Of course the likes of Naomi Osaka and the now-retired Ashleigh Barty, but haven't quite been able to match the kind of consistency and domination that Williams produced at her peak. have bucked the trend at times but the women's Grand Slams have lacked the spark when compared to their male counterparts.That doesn't seem to be the case at this year's French Open as Iga Swiatek seems destined for her second French Open, also her second Major overall and is on the brink of breaking Serena William's unbeaten streak.However, before we progress further on that, it's important for the unversed to know who Swiatek is.Who is Iga Swiatek?Born in Polish capital Warsaw in 2001, Iga found passion for tennis following her elder sister's footsteps. While her sister Agata said goodbye to tennis in her teens over injury issues, Iga made strong claim for professional season with the junior Wimbledon title in 2018.Her rookie season in WTA circuit saw her enter the main draw of Australian Open, which ended with a second-round exit. She left a bigger impression at the French Open later that season by reaching the fourth round. However, she was humbled by Romanian star Simona Halep, who handed her a 6-1, 6-0 defeat.Prior to the French Open, she also reached her maiden WTA final at the Ladies Open Lugano (a WTA international event) where her cross-court drop shot in quarter-finals against Kristyna Pliskova left fans in awe. The shot was later adjudged WTA Shot of the Year.Her efforts in the season saw her breach the Top 50 for the first time but a slump in form in later half of the year saw her finish the season at No 61.However, she wouldn't taste success until 2020, when the coronavirus pandemic brought the tennis world, if not the entire world, to a halt. Then ranked 54, the 19-year-old stunned the world by winning the French Open in September.On her way to the title, she exacted revenge over Halep 6-1, 6-2 in a fourth-round rematch. Halep was considered a hot favourite for the title as she was on a 17-match unbeaten run.Iga eventually defeated world No 6 Sofia Kenin in the final 6-4, 6-1 to become the first Polish to win a Major and the youngest woman to lift the Major since Monica Seles in 1992.Post the win, she also improved her ranking to No 17.Her lack of form in remaining Majors (except Wimbledon, which was cancelled) suggested she could be a one-hit wonder.And major success eluded Iga in 2021 as well with fourth round exits at all the Majors despite being seeded inside top 10.However the Poles gained much-needed confident back by winning the Italian Open (WTA 1000 event) on her favourite clay court.How an improved Swiatek took 2022 by stormKnown for having the fastest backhand on the women's circuit, even faster than some of the men, Swiatek has an overall package that suits all the courts. Of course this goes against the fact that her success has been limited to the clay court. While her ability to generate power does make her efficient in hitting winners, it also makes her susceptible to unforced errors at the same time.Entering the 2022 season, Iga came a much-improved player after a change in coach and went on to grab five titles, including her three WTA 1000 titles on the trot at the Qatar Open, Indian Wells and Miami OpenBefore the title spree, she also improved on her best fourth-round show at the Australian Open to a semi-final exit. The seventh-seed went down to Danielle Collins in straight sets in what appeared to be a meek surrender.However, the 20-year-old Pole went on to grab the top spot in WTA rankings for the first time after Australian Open champ Barty called time on her career in March.Going on a winning streakBy March, Iga was already on a 13-match unbeaten streak and has already bagged the two Masters equivalent titles (Qatar and Indian Wells).Upon her Miami 1000 title, she stretched her streak to 28 matches, while adding two more titles at the Italian Open and Stuttgart Open, before heading to French Open.How close is she to Williams' streak? Is that the longest winning streak ever?If Iga goes on to lift the French Open, she will break the 34-match winning streak held by Open era great Serena Williams, who set the record in 2013 en route to winning five titles.Serena also had a victory streak of 32 matches before that — winning 12 matches on the trot at the end of 2009 season and 20 more in 2010.However, the record of biggest winning streak lies with Serena's elder sibling Venus Williams, who won 35 matches on the trot, including two Grand Slams and an Olympic gold.This subsequently means Iga will match the seven-time Grand Slam winner's record if she goes on to lift the French Open.How far is Iga from achieving the record?At the time of writing this report on Wednesday, Iga stretched her winning streak to 33 matches by reaching the semi-finals after handing American Jessica Pegula a straight-sets defeat in the last-eight clash.On her way to the quartes, she defeated unseeded Lesia Tsurenko in the opening round 6-2, 6-0 followed by another dominant 6-0, 6-2 display over world No 43 Allison Riske.The top seed then defeated Danka Kovinic 6-3, 7-5 in the third round before surving a scare against Qinwen Zheng in a 5-7, 6-0, 6-2 to reach the quarters.She would then outplay Pegula 6-3, 6-2 in the quarter-final meeting.Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-06-01 14:37:44","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/06/Iga-Swiatek-French-Open-quarters-AP-640.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Rohit Sharma: भारतीय कप्तान को याद आए बचपन के दिन, सोशल मीडिया पर शेयर की खास तस्वीर","link":"https://www.abplive.com/sports/ipl/indian-captain-rohit-sharma-shared-his-photo-from-school-remembrering-his-childhood-days-2136723","keywords":null,"creator":["ABP Live"],"video_url":null,"description":"<p style=\"text-align: justify;\"><strong>Rohit Sharma Instagram:</strong> आईपीएल का 15वां सीजन समाप्त हो गया है. फाइनल मुकाबले में गुजरात टाइटंस ने राजस्थान रॉयल्स को हराकर पहले सीजन में ही खिताब अपने नाम किया. इस सीजन जहां नई टीमों ने शानदार प्रदर्शन किया तो वहीं चैंपियन टीमों ने निराश किया. 5 बार की आईपीएल विजेता मुंबई इंडियंस आईपीएल 2022 में आखिरी पायदार पर रही. रोहित शर्मा की कप्तानी वाली मुंबई ने 15वें सीजन में 14 में से सिर्फ 4 ही मैच जीते.</p> <p style=\"text-align: justify;\"><strong>स्कूल के दिनों को याद किया</strong><br />आईपीएल से बाहर होने के बाद मुंबई इंडियंस के कप्तान रोहित शर्मा अपने परिवार के साथ छुट्टियां मनाने निकल गए थे. इस बीच अब उन्होंने सोशल मीडिया पर अपनी एक तस्वीर शेयर की है. इसमें वह क्लास रूम में खड़े हैं. इंस्टाग्राम पर शेयर इस तस्वीर के साथ रोहित ने कैप्शन में लिखा- बैक टू स्कूल. रोहित की यह तस्वीर सोशल मीडिया पर तेजी से वायरल हो रही है. फैंस इस तस्वीर पर मिलीजुली प्रतिक्रिया दे रहे हैं.</p> <blockquote class=\"instagram-media\" style=\"background: #FFF; border: 0; border-radius: 3px; box-shadow: 0 0 1px 0 rgba(0,0,0,0.5),0 1px 10px 0 rgba(0,0,0,0.15); margin: 1px; max-width: 540px; min-width: 326px; padding: 0; width: calc(100% - 2px);\" data-instgrm-captioned=\"\" data-instgrm-permalink=\"https://www.instagram.com/p/CeQvLCUoptu/?utm_source=ig_embed&amp;utm_campaign=loading\" data-instgrm-version=\"14\"> <div style=\"padding: 16px;\"> <div style=\"display: flex; flex-direction: row; align-items: center;\"> <div style=\"background-color: #f4f4f4; border-radius: 50%; flex-grow: 0; height: 40px; margin-right: 14px; width: 40px;\">&nbsp;</div> <div style=\"display: flex; flex-direction: column; flex-grow: 1; justify-content: center;\"> <div style=\"background-color: #f4f4f4; border-radius: 4px; flex-grow: 0; height: 14px; margin-bottom: 6px; width: 100px;\">&nbsp;</div> <div style=\"background-color: #f4f4f4; border-radius: 4px; flex-grow: 0; height: 14px; width: 60px;\">&nbsp;</div> </div> </div> <div style=\"padding: 19% 0;\">&nbsp;</div> <div style=\"display: block; height: 50px; margin: 0 auto 12px; width: 50px;\">&nbsp;</div> <div style=\"padding-top: 8px;\"> <div style=\"color: #3897f0; font-family: Arial,sans-serif; font-size: 14px; font-style: normal; font-weight: 550; line-height: 18px;\">View this post on Instagram</div> </div> <div style=\"padding: 12.5% 0;\">&nbsp;</div> <div style=\"display: flex; flex-direction: row; margin-bottom: 14px; align-items: center;\"> <div> <div style=\"background-color: #f4f4f4; border-radius: 50%; height: 12.5px; width: 12.5px; transform: translateX(0px) translateY(7px);\">&nbsp;</div> <div style=\"background-color: #f4f4f4; height: 12.5px; transform: rotate(-45deg) translateX(3px) translateY(1px); width: 12.5px; flex-grow: 0; margin-right: 14px; margin-left: 2px;\">&nbsp;</div> <div style=\"background-color: #f4f4f4; border-radius: 50%; height: 12.5px; width: 12.5px; transform: translateX(9px) translateY(-18px);\">&nbsp;</div> </div> <div style=\"margin-left: 8px;\"> <div style=\"background-color: #f4f4f4; border-radius: 50%; flex-grow: 0; height: 20px; width: 20px;\">&nbsp;</div> <div style=\"width: 0; height: 0; border-top: 2px solid transparent; border-left: 6px solid #f4f4f4; border-bottom: 2px solid transparent; transform: translateX(16px) translateY(-4px) rotate(30deg);\">&nbsp;</div> </div> <div style=\"margin-left: auto;\"> <div style=\"width: 0px; border-top: 8px solid #F4F4F4; border-right: 8px solid transparent; transform: translateY(16px);\">&nbsp;</div> <div style=\"background-color: #f4f4f4; flex-grow: 0; height: 12px; width: 16px; transform: translateY(-4px);\">&nbsp;</div> <div style=\"width: 0; height: 0; border-top: 8px solid #F4F4F4; border-left: 8px solid transparent; transform: translateY(-4px) translateX(8px);\">&nbsp;</div> </div> </div> <div style=\"display: flex; flex-direction: column; flex-grow: 1; justify-content: center; margin-bottom: 24px;\"> <div style=\"background-color: #f4f4f4; border-radius: 4px; flex-grow: 0; height: 14px; margin-bottom: 6px; width: 224px;\">&nbsp;</div> <div style=\"background-color: #f4f4f4; border-radius: 4px; flex-grow: 0; height: 14px; width: 144px;\">&nbsp;</div> </div> <p style=\"color: #c9c8cd; font-family: Arial,sans-serif; font-size: 14px; line-height: 17px; margin-bottom: 0; margin-top: 8px; overflow: hidden; padding: 8px 0 7px; text-align: center; text-overflow: ellipsis; white-space: nowrap;\"><a style=\"color: #c9c8cd; font-family: Arial,sans-serif; font-size: 14px; font-style: normal; font-weight: normal; line-height: 17px; text-decoration: none;\" href=\"https://www.instagram.com/p/CeQvLCUoptu/?utm_source=ig_embed&amp;utm_campaign=loading\" target=\"_blank\" rel=\"noopener\">A post shared by Rohit Sharma (@rohitsharma45)</a></p> </div> </blockquote> <p> <script src=\"//www.instagram.com/embed.js\" async=\"\"></script> </p> <p style=\"text-align: justify;\"><strong>आईपीएल 2022 में रोहित का प्रदर्शन</strong><br />आईपीएल 2022 में रोहित शर्मा ने काफी शर्मनाक प्रदर्शन किया. उन्होंने 14 मुकाबलों में मात्र 19.14 की औसत और 120.17 के स्ट्राइक रेट से 268 रन बनाए. वह इस सीजन एक भी अर्धशतक तक नहीं जड़ सके. आईपीएल के 15वें सीजन में उनका सर्वाधिक स्कोर 48 रन रहा. रोहित ने आईपीएल 2022 में 28 चौके और 13 छक्के जड़े.</p> <p style=\"text-align: justify;\"><strong>ये भी पढ़ें...</strong></p> <p style=\"text-align: justify;\"><strong><a href=\"https://www.abplive.com/sports/ipl/flop-on-the-field-super-hit-on-social-media-virat-kohli-playoff-post-becomes-most-shared-tweet-during-ipl-2022-2136505\">IPL 2022: फील्ड पर फ्लॉप Virat Kohli सोशल मीडिया पर रहे हिट, एक ट्वीट ने बनाया रिकॉर्ड</a></strong></p> <p style=\"text-align: justify;\"><strong><a href=\"https://www.abplive.com/sports/cricket/sourav-ganguly-resigns-from-post-of-bcci-president-post-2136634\">Sourav Ganguly Resign News: सौरव गांगुली के इस्तीफे की खबर को जय शाह ने किया खारिज</a></strong></p>","content":null,"pubDate":"2022-06-01 14:24:09","image_url":null,"source_id":"abplive","country":["india"],"category":["sports"],"language":"hindi"},{"title":"England vs New Zealand 1st Test Live Telecast Channel in India and England: When and where to watch ENG vs NZ 1st Test?","link":"https://thesportsrush.com/cricket-news-england-vs-new-zealand-1st-test-live-telecast-channel-in-india-and-england-when-and-where-to-watch-eng-vs-nz-1st-test/","keywords":["Cricket","ENG vs NZ","England vs New Zealand","The Lord's"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"England vs New Zealand 1st Test Live Telecast Channel: The SportsRush brings you the broadcast details of the England vs New Zealand test series. The English home-cricketing summer is finally starting with the England vs New Zealand series. Lord’s will host the first test of the series from 2 June 2022. This is England’s first… The post England vs New Zealand 1st Test Live Telecast Channel in India and England: When and where to watch ENG vs NZ 1st Test? appeared first on The SportsRush.","content":"England vs New Zealand 1st Test Live Telecast Channel: The SportsRush brings you the broadcast details of the England vs New Zealand test series. The English home-cricketing summer is finally starting with the England vs New Zealand series. Lord’s will host the first test of the series from 2 June 2022. This is England’s first test under the leadership of Ben Stokes and the coaching of Brendon McCullum. England have also announced their playing eleven for the first test match. Matthew Potts will be making his debut in this game, whereas James Anderson and Stuart Broad are also back in the mix. The Blackcaps are the reigning champions of the World Test Championship, and they would want to improve their position in this series. Kane Williamson will play a huge part in batting, whereas Tom Latham and Devon Conway will also play a huge part for the visitors. The absence of Trent Boult can be an issue for the visitors. Smile if you’re excited for Test action tomorrow!#ENGvNZ pic.twitter.com/I7D7xvshbl — BLACKCAPS (@BLACKCAPS) June 1, 2022 England vs New Zealand 1st Test Live Telecast Channel The highly anticipated series between England and New Zealand will be televised worldwide. Sony Sports Network in India will broadcast the series between England and New Zealand. In the United Kingdom, the match will be streamed on Sky Sports, and there will be a commentary of BBC Radio 5 as well. For the fans in New Zealand, they can catch up with the event on Spark Sports, whereas Fox Cricket and Kayo Sports will broadcast the match in Australia. The fans in South Africa can watch the match live on SuperSport Cricket. Willow TV will broadcast the match live in USA and Canada. United Kingdom: Sky Sports; BBC Radio 5 New Zealand: Spark Sport India: Sony Sports Network Australia: Fox Cricket; Kayo Sports South Africa: SuperSport Cricket USA and Canada: Willow TV The post England vs New Zealand 1st Test Live Telecast Channel in India and England: When and where to watch ENG vs NZ 1st Test? appeared first on The SportsRush.","pubDate":"2022-06-01 14:21:16","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"PHOTO FOCUS - 18 photos from Bridlington Cricket Club 3rds v Forge Valley Cricket Club 2nds","link":"https://www.thescarboroughnews.co.uk/sport/cricket/photo-focus-18-photos-from-bridlington-cricket-club-3rds-v-forge-valley-cricket-club-2nds-3717591","keywords":["Sport"],"creator":["Andy Bloomfield"],"video_url":null,"description":"Bridlington CC 3rds lost out at home to Forge Valley 2nds in the Scarborough Beckett Cricket League last weekend.","content":null,"pubDate":"2022-06-01 14:07:45","image_url":"https://www.thescarboroughnews.co.uk/webimg/QVNIMTI1OTA2MzU1.jpeg?width=1200&auto=webp","source_id":"thescarboroughnews","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"IPL Time Travel Part 3: The win that made Rajasthan - Royal","link":"https://www.indiatvnews.com/sports/cricket/ipl-2022-ipl-time-travel-part-3-rajasthan-royals-2008-ipl-win-that-made-them-royal-shane-warne-sanju-samson-2022-06-01-781165","keywords":null,"creator":null,"video_url":null,"description":"Over the years, Cricket has become more than just a game. For some, it's their religion, part of their soul, their dream, their very existence. Warne's sudden death shook the very foundation of these beliefs.","content":null,"pubDate":"2022-06-01 13:42:12","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"Sourav Ganguly hints at ‘planning to start something’; Jay Shah clarifies he’s not quitting as BCCI chief","link":"https://www.firstpost.com/firstcricket/sports-news/sourav-ganguly-hints-at-planning-to-start-something-jay-shah-clarifies-hes-not-quitting-as-bcci-chief-10746561.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"Sourav Ganguly hints at ‘planning to start something’; Jay Shah clarifies he’s not quitting as BCCI chief","content":"Sourav Ganguly hinted at 'planning to start something' in a cryptic post on Twitter on Wednesday, though not offering any details on the said venture.The BCCI president, in his third year in the role and having earlier headed Cricket Association of Bengal (CAB), added that he felt the initiative would \"help a lot of people\".\"2022 marks the 30th year since the start of my journey with cricket in 1992. Since then, Cricket has given me a lot. Most importantly, it has given me the support of all of you. I want to thank every single person who has been a part of the journey, supported me, and helped me reach where I am today. pic.twitter.com/JrHOVvH3Vi— Sourav Ganguly (@SGanguly99) June 1, 2022 \"Today, I am planning to start something that I feel will probably help a lot of people. I hope you continue your support as I enter this chapter of my life,\" Ganguly wrote in the tweet, which has since led to plenty of speculation on social media about him quitting the board and likely entering politics.BCCI secretary Jay Shah, however, made it clear that Ganguly was not stepping down as the board president shortly after Ganguly's tweet.\"The rumours doing rounds about Mr Sourav Ganguly stepping down from the post of BCCI President are factually incorrect,\" BCCI secretary Jay Shah issued a statement to PTI.\"We have some exciting times in the form of media rights coming up and my colleagues and I are completely focused on the upcoming opportunity and safeguarding the interest of Indian cricket,\" Shah further stated.It is learnt that Ganguly's tweet was a promotional one for an upcoming project of his.With PTI inputsRead all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-06-01 13:32:04","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2021/03/Sourav-Ganguly-BCCI-Awards-Sportzpics-640.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Political debut or resignation: Sourav Gangluly's cryptic tweet on 'new chapter of life' sparks speculations","link":"https://www.firstpost.com/sports/political-debut-or-resignation-sourav-ganglulys-cryptic-tweet-on-new-chapter-of-life-sparks-speculations-10746601.html","keywords":["Sports"],"creator":["FP Staff"],"video_url":null,"description":"Political debut or resignation: Sourav Gangluly's cryptic tweet on 'new chapter of life' sparks speculations","content":"BCCI chief Sourav Ganguly on Wednesday sent Twitter into a frenzy with his cryptic tweet about \"starting a new chapter in his life\".\"Today, I am planning to start something that I feel will probably help a lot of people. I hope you continue your support as I enter this chapter of my life,\" Ganguly tweeted.pic.twitter.com/JrHOVvH3Vi— Sourav Ganguly (@SGanguly99) June 1, 2022The post soon sparked speculation that the Ganguly has stepped down from his post as the BCCI president.BCCI secretary Jay Shah has refuted reports that Ganguly has resigned as the president of the top governing body for cricket in India, ANI reported.Ganguly hosted Amit Shah at his Kolkata residenceNotably, Ganguly's post comes a month after he hosted Union Home Minister Amit Shah at his Kolkata residence.However, when asked about the dinner, the BCCI chief had told reporters that he was not joining the BJP.\"I have known him (Amit Shah) since 2008. While playing, I used to meet him. There's nothing more than that,\" he said.With inputs from agenciesRead all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-06-01 13:21:10","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2020/06/Sourav-Ganguly-640-AFP.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"WIS vs BAR Dream11 Prediction: Fantasy Cricket Tips, Today's Playing 11 and Pitch Report for Windies Test Championship, Match 13","link":"https://www.sportskeeda.com/fantasy-cricket-mantra/wis-vs-bar-dream11-prediction-fantasy-cricket-tips-today-s-playing-11-pitch-report-windies-test-championship-match-13?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Fantasy Cricket Mantra"],"creator":["Aman Chauhan"],"video_url":null,"description":null,"content":null,"pubDate":"2022-06-01 13:16:03","image_url":"https://static.sportskeeda.com/editor/2022/06/d264c-16540822069359-1920.jpg","source_id":"sportskeeda","country":["india"],"category":["sports"],"language":"english"},{"title":"From cricketers to fans, Here are some wonderful birthday wishes for Dinesh Karthik","link":"https://www.indiatvnews.com/sports/cricket/happy-birthday-dinesh-karthik-from-cricketers-to-fans-here-are-some-wonderful-birthday-wishes-for-dinesh-karthik-2022-06-01-781150","keywords":null,"creator":null,"video_url":null,"description":"Dinesh Karthik turned 37 on Wednesday and fans left no stones left unturned to wish their favourite finisher a happy birthday. The cricket fraternity too sent Karthik love and blessings through Twitter posts.","content":"turned 37 on Wednesday and fans left no stones left unturned to wish their favourite finisher a happy birthday. The cricket fraternity too sent Karthik love and blessings through Twitter posts. Dinesh Karthik successfully proved himself worthy of getting selected in team of India's five-match series against South Africa after playing brilliantly in IPL. The last time that Karthik played in the country's T20I team was in the year 2019.","pubDate":"2022-06-01 13:10:49","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"Ganguly has not resigned, clarifies BCCI after cryptic tweet raises speculation","link":"https://timesofindia.indiatimes.com/sports/cricket/news/sourav-ganguly-has-not-resigned-clarifies-bcci-secretary-jay-shah-after-presidents-cryptic-tweet-raised-speculation/articleshow/91944630.cms","keywords":null,"creator":null,"video_url":null,"description":"Former India skipper Sourav Ganguly on Wednesday issued a cryptic tweet about his \"new journey\" that raised speculations about his continuation as BCCI President, forcing the cricket board secretary Jay Shah to clarify that he has not resigned from his post. Ganguly in his tweet said he is embarking on a new journey, although without revealing any further details. It is learnt that Ganguly's tweet was a promotional one for an upcoming project of his.","content":"NEW DELHI: Former India skipper Sourav Ganguly on Wednesday issued a cryptic tweet about his \"new journey\" that raised speculations about his continuation as BCCI President, forcing the cricket board secretary Jay Shah to clarify that he has not resigned from his post. \"The rumours doing rounds about Mr. Sourav Ganguly stepping down from the post of BCCI President are factually incorrect,\" BCCI secretary Jay Shah issued a statement to PTI. https://t.co/JrHOVvH3Vi — Sourav Ganguly (@SGanguly99) 1654084227000 \"We have some exciting times in the form of media rights coming up and my colleagues and I are completely focused on the upcoming opportunity and safeguarding the interest of Indian cricket,\" Shah further stated. Ganguly in his tweet said he is embarking on a new journey, although without revealing any further details. \"2022 marks the 30th year since the start of my journey with cricket in 1992. Since then, cricket has given me a lot. Most importantly, it has given me the support of all of you. I want to thank every single person, who has been part of the journey, supported me, and helped me reach where I am today,\" he wrote in a brief statement. \"Today, I am planning to start something that I feel will probably help a lot of people. I hope you continue your support as I enter this chapter of life.\" Ganguly was elected BCCI President in October 2019 and still has four months left in his three-year tenure. Ganguly's tweet took the social media by storm as many, including media outlets, started speculations. It is learnt that Ganguly's tweet was a promotional one for an upcoming project of his.","pubDate":"2022-06-01 13:05:06","image_url":null,"source_id":"toi","country":["india"],"category":["sports"],"language":"english"},{"title":"I am in a good space & I am past assessing my performance: R Ashwin","link":"https://www.indiatvnews.com/sports/cricket/i-am-in-a-good-space-i-am-past-assessing-my-performance-r-ashwin-ravichandran-ashwin-ravi-ashwin-ipl-rajasthan-royals-spinner-2022-06-01-781144","keywords":null,"creator":null,"video_url":null,"description":"More than the adrenaline and the excitement that surrounds the sport, people tend to forget that cricket is also a game of angles & tactful decision-making abilities. Apart from the likes of MS Dhoni, people from all corners of the cricketing fraternity have hailed Ravichandran Ashwin as one of the sharpest minds in the game of cricket. Ravichandran Ashwin who first burst into the cricketing scenes after debuting for Chennai Super Kings in 2008 has been an integral part of India's test team for many years now. What sets R. Ashwin apart from his colleagues is his zeal to pick up new things as he keeps on adding new deliveries to his armory. Ravi Ashwin who was dropped from the Indian team white ball set up after their 2017 Champions Trophy final debacle, surprised everybody as he was picked up by the selectors for the 2021 T20 World Cup. The famous 2020-21 Border-Gavaskar Trophy will also be remembered for the Sydney test match that he along with Hanuma Vihari saved by batting the entire day.","content":null,"pubDate":"2022-06-01 13:00:28","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"Recent Match Report - SL Women vs PAK Women 1st ODI 2022 - ESPNcricinfo","link":"https://news.google.com/__i/rss/rd/articles/CBMiiwFodHRwczovL3d3dy5lc3BuY3JpY2luZm8uY29tL3Nlcmllcy9zcmktbGFua2Etd29tZW4taW4tcGFraXN0YW4tMjAyMi0xMzEwOTc2L3Bha2lzdGFuLXdvbWVuLXZzLXNyaS1sYW5rYS13b21lbi0xc3Qtb2RpLTEzMTA5ODQvbWF0Y2gtcmVwb3J00gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Recent Match Report - SL Women vs PAK Women 1st ODI 2022  ESPNcricinfoGhulam Fatima stars in Pakistan's convincing win | Cricbuzz.com - Cricbuzz  CricbuzzPK-W vs SL-W Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update- Sri Lanka Women Tour of Pakistan, 1st ODI  Cricket AddictorPAK vs SL Women: Ghulam Fatima stars as Pakistan take 1-0 lead against Sri Lanka in ODI series  Geo SuperPakistan start new IWC campaign with resounding victory  International Cricket CouncilView Full coverage on Google News","content":null,"pubDate":"2022-06-01 12:47:38","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"GT win title but Bangalore win hearts: RCB tops most-tweeted teams list","link":"https://www.firstpost.com/firstcricket/sports-news/gujarat-wins-title-but-bangalore-wins-hearts-rcb-tops-most-tweeted-teams-list-10746151.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"GT win title but Bangalore win hearts: RCB tops most-tweeted teams list","content":"With another fall in the playoffs of the latest season of the Indian Premier League, Royal Challengers Bangalore will have to wait another year to erase the 'chokers' tag by lifting their maiden title. Even the change in captaincy could not make any difference for the side. The Faf Du Plessis-led side put every possible effort this year but couldn’t make it to the final.After suffering another heart-breaking season, when the fans and the players are still having the nightmare, Twitter has come up with an exclusive statement which can make their mood a little light. According to the official statement, Royal Challengers Bangalore has become the most talked-about franchise of the 2022 season based on the engagement of their supporters on Twitter.On the other side, Bangalore’s former skipper Virat Kohli who although had a poor season with the bat and became a matter of concern for the cricket enthusiasts, has topped the list of the most tweeted players of the season. Kohli managed to score 341 runs during his 16 appearances this year at a batting average of 22.73.The statement released by Twitter mentions, “While Gujarat Titans, won the tournament trophy, Royal Challengers Bangalore won on Twitter – becoming the most Tweeted about the team of the season. The team’s former skipper, Virat Kohli, also remained the talk of the timelines on the service becoming the most tweeted about player of the season.”As per the list, Mahendra Singh Dhoni-steered Chennai Super Kings is standing in the second place and five-time champion Mumbai Indians has clinched the third spot. Other popular franchises like Kolkata Knight Riders and Rajasthan Royals have become the fourth and fifth most interacted teams respectively.After Kohli, former Indian captain MS Dhoni is placed in the second spot and Mumbai Indians’ leader Rohit Sharma is in the third place followed by Ravindra Jadeja and Faf Du Plessis in the top-five list of the players who have created much buzz across Twitter during the campaign.Read all the Latest News, Trending News, Cricket News, IPL Live Score, IPL 2022 schedule, IPL 2022 Points table and Entertainment News. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-06-01 12:42:06","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/05/RCB-6402.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Sourav Ganguly Has Not Resigned From BCCI, Says Board Secretary Jay Shah","link":"https://sports.ndtv.com/cricket/sourav-ganguly-has-not-resigned-as-bcci-president-jay-shah-3029407","keywords":null,"creator":null,"video_url":null,"description":"Sourav Ganguly played 113 Tests and 311 ODIs for India, scoring more than 18,000 runs in international cricket.","content":null,"pubDate":"2022-06-01 12:36:50","image_url":"https://c.ndtvimg.com/2021-12/vt076gao_sourav-ganguly_625x300_18_December_21.jpg?im=FeatureCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"}]}