{"newsArray":[{"title":"IPL 2023 Qualifier 1, GT vs CSK preview: Tactician Dhoni faces Gill test","link":"https://telanganatoday.com/ipl-2023-qualifier-1-gt-vs-csk-preview-tactician-dhoni-faces-gill-test","keywords":["News","Sport","Chennai Super Kings","Gujarat Titans","IPL 2023"],"creator":["PTI"],"video_url":null,"description":"Mahendra Singh Dhoni will dig deep into his reserves to counter Indian cricket's new 'Crown Prince' Shubman Gill","content":"Home | Sport | Ipl 2023 Qualifier 1 Gt Vs Csk Preview Tactician Dhoni Faces Gill Test IPL 2023 Qualifier 1, GT vs CSK preview: Tactician Dhoni faces Gill test Mahendra Singh Dhoni will dig deep into his reserves to counter Indian cricket's new 'Crown Prince' Shubman Gill By PTI Published Date - 07:40 AM, Tue - 23 May 23 PTI Photo Chennai: The astute tactician in Mahendra Singh Dhoni will dig deep into his reserves to counter Indian cricket’s new ‘Crown Prince’ Shubman Gill as four-time champions Chennai Super Kings will meet their match in current title holders Gujarat Titans in Qualifier-1 of the IPL here on Tuesday. Gill, who almost single-handedly knocked out a star-studded Royal Challengers Bangalore with a century for the keeps, has overshadowed Virat Kohli and will certainly force one of India’s greatest captains to go back to drawing board and make plans for him. Gill is in the midst of a dream season and what will be Dhoni’s tactical ploy to stop the dashing ‘Mohali Marauder’ is there to be seen. This season, Gujarat Titans haven’t played at the Chepauk, which hasn’t behaved in a singular manner during CSK’s seven home games and that prompted head coach Stephen Fleming to raise apprehensions about what to expect. What makes this battle even more interesting is the fact that GT is a team that seems closest to being a proto-type of what CSK had been all these years in IPL. A solid management and an administration team that stay in the background and never interferes in cricketing matters, which is left to the trio of Ashish Nehra, Gary Kirsten and Vikram Solanki. A captain, who swears that his understanding of leadership is cut from Dhoni’s ‘captaincy cloth’, and head coach Nehra, who just like his former teammate doesn’t believe in too many changes even if a couple of games go wrong. They don’t field players based on their auction worth – remember CSK bought Krishnappa Gowtham for nearly Rs 10 crore and he got a single game as he didn’t fit the combination. Similarly, GT has current India T20 pacer Shivam Mavi on its roster for a whopping Rs 6 crore but the team management has preferred veteran Mohit Sharma, who is executing the slower deliveries beautifully. It’s all about who fits what role. So, it becomes more interesting when two teams with similar philosophy are pitted against each other. The teams which don’t make long-term promises that are difficult to fulfil but focus on immediate process and know the roles of players required for slots. For Gujarat, tackling the slowness of the Chepauk track will be a challenge and how well they negotiate Deepak Chahar’s powerplay overs and Matheesha Pathirana’s slingers at the back-end, will determine the outcome of the match. And herein, Pandya and Nehra will find Sri Lanka skipper Dasun Shanaka’s inputs handy as he has handled both Pathirana and spinner Maheesh Theekshana for the national team. While Shanaka might be used more as an all-rounder, Titans depending on the toss can also try out left-arm spinner R Sai Kishore, who knows these conditions well. There is a chance that Irishman Joshua Little will be back in playing XI in place of Shanaka and Sai Kishore comes in place of Yash Dayal, who is yet to get back his confidence after the five sixes assault on him by his Statemate Rinku Singh. For CSK , a good start by the crack pair of Devon Conway and Ruturaj Gaikwad will be important. But at the Chepauk, even Ajinkya Rahane could become a factor while Shivam Dube would love to add to his 33 sixes for the season. Conway and Gaikwad have provided brisk and substantial starts for CSK, the middle-order hasn’t exactly got going. With GT bowling led by Mohammed Shami and Rashid Khan (24 wickets each so far), things won’t be easy for the home team’s batters, Conway and Gaikwad included. How the CSK opening duo handles the relentless Shami may prove vital and it would be important for the under-performing middle-order to step up in a crunch game. The pitches at Chepauk so far have been a bit up and down, with a few being slow in nature while some have been good to bat on. CSK head coach Fleming said as much after the win over Delhi Capitals, claiming that the team is unsure about the conditions (at home). If a sluggish pitch is rolled out for the match, the spinners in the two teams would have a huge part to play. If CSK has Ravindra Jadeja, Moeen Ali and Theekshana, the Titans boast of a line-up that includes Rashid and Noor Ahmad. Also Read IPL 2023: RCB’s campaign ends after six-wicket loss to GT, MI through IPL 2023: Ben Stokes leaves CSK to prepare for England’s upcoming home summer Follow Us : Tags Chennai Super Kings Gujarat Titans IPL 2023 Related News IPL 2023: Virat Kohli’s niggle in knee not a cause for concern, says RCB Head Coach IPL 2023: RCB’s campaign ends after six-wicket loss to GT, MI through IPL 2023: Ben Stokes leaves CSK to prepare for England’s upcoming home summer IPL 2023: RCB vs GT Live updates IPL 2023: Green century, Rohit’s fifty guide MI to eight-wicket win over SRH IPL: SRH vs MI Live updates","pubDate":"2023-05-23 02:10:04","image_url":null,"source_id":"telanganatoday","category":["sports"],"country":["india"],"language":"english"},{"title":"Islamabad Club Reds lift Islamabad Club Cricket League title","link":"https://www.nation.com.pk/23-May-2023/islamabad-club-reds-lift-islamabad-club-cricket-league-title","keywords":["Sports"],"creator":["STAFF REPORT"],"video_url":null,"description":"LAHORE - Islamabad Club Reds lifted the title of Islamabad Club Cricket League by thrashing Islamabad Club Blues by 10 wickets at Oval Cricket Ground, Islamabad.","content":"LAHORE - Islamabad Club Reds lifted the title of Islamabad Club Cricket League by thrashing Islamabad Club Blues by 10 wickets at Oval Cricket Ground, Islamabad. Majid Khan, former captain of Pakistan cricket team, was the chief guest of the final while former PCB COO Shafaqat Naghmi, Islamabad Club Cricket Committee senior member Zubair Nasir, Test cricketer Yasir Hameed and others dignities were also present there. In the final, Islamabad Club Blues scored 175-6 in 20 overs, thanks to Ashas Gill’s 89 and Raza Akram’s 25 runs, while Ahmed Taj dismissed 3 for 36. In reply, Islamabad Reds chased the target in 13th over with unbeatable opening partnership between Umer Kiyani and Salman Chaudhry of 176 runs. Umer Kayani smashed unbeatable century with 10 massive sixes and 6 fours in just 40 balls while Salman Chaudhry hammered unbeaten 72. Umar Kayani was named player of the match and tournament.","pubDate":"2023-05-22 22:21:19","image_url":null,"source_id":"nation_pk","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"Kohli feels back to his best","link":"https://www.herald.co.zw/kohli-feels-back-to-his-best/","keywords":["Sport"],"creator":["The Herald"],"video_url":null,"description":"MUMBAI. — India star Virat Kohli has issued a warning ahead of next year’s ICC Men’s T20 World Cup by declaring he is at the top of his game and feels like he is playing his best T20 cricket.","content":"India star Virat Kohli has issued a warning ahead of next year’s ICC Men’s T20 World Cup by declaring he is at the top of his game and feels like he is playing his best T20 cricket. Kohli finished as the leading run scorer at the most recent edition of the T20 World Cup in Australia when he amassed an eye-catching 296 runs for his country at a Bradmanesque average of 98.66 and a strike rate greater than 136, but was expected to face greater competition from India’s bevy of young batters in the lead-up to next year’s event in the Caribbean and USA. But the 34-year-old is showing no signs of slowing down based on his recent efforts in the Indian Premier League and has given every indication he wants to continue playing 20-over cricket for his country. The champion right-hander has scored 639 runs from 14 matches while opening the batting for Royal Challengers Bangalore, with his most recent contribution an unbeaten 101 from just 61 balls as his side fell out of the playoffs race to Gujarat Titans. “It’s more important than cricket practice.” What does Virat Kohli think about fitness? Find out. It was Kohli’s second century on the trot for his IPL franchise and the veteran said he is back playing his best when asked by former India coach Ravi Shastri at the completion of his innings. “Ya, I felt great. A lot of people feel my T20 cricket is declining, but I don’t feel like that at all,” Kohli said. “I feel I am playing my best T20 cricket again. I’m just enjoying myself, this is how I play T20 cricket. I look to hit gaps, hit a lot of boundaries and the big ones in the end if the situation allows me to. “Strike rates, all those kind of things like I said in the past as well . . . you have to read the situation and rise up to the occasion when the situation demands, and that’s some-thing I take a lot of pride in doing, and I’ve been doing it for a while now. I feel really good with my game at the moment and how I’m batting out there in the middle.” Kohli hasn’t been the only experienced campaigner performing well at the top of the order for Royal Challengers Bangalore this season, with South Africa batter Faf du Plessis also in good touch having scored 730 runs to be the leading run scorer for the tournament thus far. Kohli and du Plessis combined for a total of 939 runs across 14 innings — equalling the previous record from IPL 2016 set by Kohli and AB de Villiers’ of most runs by a pair in a T20 tournament — as Royal Challengers Bangalore narrowly missed out on a spot in the playoffs. Karthik backs du Plessis to make international comeback at World Cup. Du Plessis was full of praise for Kohli and believes his fellow opener still has plenty to offer in the shortest format of the game. “He (Kohli) has played really good cricket throughout the season,” du Plessis said. “It just shows you Virat has got a lot left in the tank in T20 cricket as he is playing really well still.” ZIMBABWE’S Warriors will be waiting anxiously for the quick resolution of ZIFA’s suspension from global football after the Confederation of African Football announced that the draw for the 2026 World Cup will be held in two months. THE Premier Soccer League are set to determine the way forward following a week of boardroom bickering which resulted in the chaos and abandonment of the league match between Sheasham and CAPS United scheduled for Mandava on Sunday. MADRID. — Soccer governing body FIFA’s president Gianni Infantino expressed his support for Real Madrid forward Vinicius Jr after he called LaLiga and Spain “racist” after receiving racial slurs from fans in Sunday’s game at Valencia’s Mestalla Stadium.","pubDate":"2023-05-22 22:01:20","image_url":null,"source_id":"herald_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"NPL expand to 14 teams, playoff fixtures announced","link":"https://www.herald.co.zw/npl-expand-to-14-teams-playoff-fixtures-announced/","keywords":["Sport"],"creator":["The Herald"],"video_url":null,"description":"The 2023/24 edition of the National Premier League (NPL) will be a grand affair featuring 14 teams following a decision by Zimbabwe Cricket to add four more participants in order to open up the top-flight club cricket competition to men’s teams from all the 10 provinces in the country.","content":"The 2023/24 edition of the National Premier League (NPL) will be a grand affair featuring 14 teams following a decision by Zimbabwe Cricket to add four more participants in order to open up the top-flight club cricket competition to men’s teams from all the 10 provinces in the country. The new qualification pathway will see nine teams qualify directly on sporting merit through their top provincial club championships, while the other five spots will be filled up through playoffs. Harare Metropolitan will have four teams securing their places directly in the NPL, followed by Bulawayo Metropolitan with two guaranteed berths. Manicaland, Masvingo and Midlands will each have one spot through direct qualification. The best teams from Mashonaland Central, Mashonaland East, Mashonaland West, Matabeleland North and Matabeleland South will have to go through NPL playoffs against clubs from the top provinces. In the first playoff match played at Kadoma Sports Club on Sunday, Kadoma Sports Club beat Kwekwe Sports Club by 220 runs to book their place in the main tournament. Four other playoff matches are scheduled to take place on 27 and 28 May at venues across the country. ZIMBABWE’S Warriors will be waiting anxiously for the quick resolution of ZIFA’s suspension from global football after the Confederation of African Football announced that the draw for the 2026 World Cup will be held in two months. THE Premier Soccer League are set to determine the way forward following a week of boardroom bickering which resulted in the chaos and abandonment of the league match between Sheasham and CAPS United scheduled for Mandava on Sunday. MADRID. — Soccer governing body FIFA’s president Gianni Infantino expressed his support for Real Madrid forward Vinicius Jr after he called LaLiga and Spain “racist” after receiving racial slurs from fans in Sunday’s game at Valencia’s Mestalla Stadium.","pubDate":"2023-05-22 22:01:10","image_url":null,"source_id":"herald_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"Morgan Topping leads the way as Northern Knights cruise to second win in Inter-pro Cup","link":"https://www.belfasttelegraph.co.uk/sport/cricket/morgan-topping-leads-the-way-as-northern-knights-cruise-to-second-win-in-inter-pro-cup/420842342.html","keywords":null,"creator":null,"video_url":null,"description":"Morgan Topping may have fallen eight runs short of a deserved century but he ensured Northern Knights made it two wins out of two in this year’s Inter-Provincial Cup, with victory over champions Munster Reds at Stormont.","content":"Topping, the 24-year old Waringstown batter, playing only his fourth List A match, showed off all his burgeoning talent to dominate the Knights’ ultimately comfortable chase and while the three wickets margin may look tight, they had 17 balls to spare and three wickets fell within 30 runs of their 270 target. Cade Carmichael, in superb form for Instonians scored his first List A 50, sharing a partnership of 87 with Topping who then added 92 with Neil Rock, fresh from his astonishing 142 off 53 balls in the National Cup on Saturday. The diminutive left hander did not have to score as quickly this time, although his 39 still came off 29 balls with seven fours and with Topping scoring at a run-a-ball, the Knights were always in control of the chase. The only worries came early when Ross Adair was caught at second slip for a duck and Ruhan Pretorius holed out to mid-on for just eight, leaving the hosts on 19 for two. James McCollum, in his last game before joining up with the Ireland squad, looked good for his 38 balls but then found Gareth Delany at deep square but that only let this Knights team show off their depth in batting. The bowling depth was highlighted in their team selection with Matthew Foster, despite taking three wickets in Dublin last week, left out on his home ground. They still had skipper Mark Adair to share the new ball with Pretorius but neither made a breakthrough as Murray Commins and Ali Frost put on 106 for the first wicket. It was Tyron Koen who ended the stand in the 25th over but Commins went on and on, bringing up his second century on the ground from 111 balls with 13 fours and a six. However, he failed to match his previous best of 125, caught at long-on off Theo van Woerkom who, like Tom Mayes before him, then took two wickets in two balls. The inter-provincial action continues today at Bready when North West Warriors host Leinster Lightning with Cian Robertson, the Instonians slow left armer, expected to make his Warriors debut, after playing one match for the Knights last season. (M Commins 114, A Frost 37, M Ford 33 not out, C Campher 26; T Mayes 3-34, T van Woerkom 3-58, T Koen 1-61) (47.1 overs, M Topping 92, C Carmichael 62, N Rock 39, J McCollum 30, M Adair 20; L McCarthy 4-67, M Granger 2-30). Knights won by three wickets.","pubDate":"2023-05-22 20:13:37","image_url":"https://s3.eu-west-1.amazonaws.com/prod-mh-ireland/a6df8035-4002-4c6b-af33-69c76f5d71c0/a2c24506-b382-4a95-a523-eaf461401918/v%20Munster%20Reds%2021.jpg","source_id":"belfasttelegraph","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"HCA league matches to commence from June 6","link":"https://telanganatoday.com/hca-league-matches-to-commence-from-june-6","keywords":["Hyderabad","News","Sport","Hyderabad Cricket Association"],"creator":["Telangana Today"],"video_url":null,"description":"The much-awaited Hyderabad Cricket Association league matches will commence from June 6, the officials informed","content":"Home | Sport | Hca League Matches To Commence From June 6 HCA league matches to commence from June 6 The much-awaited Hyderabad Cricket Association league matches will commence from June 6, the officials informed By Telangana Today Published Date - 11:45 PM, Mon - 22 May 23 Hyderabad: The much-awaited Hyderabad Cricket Association league matches will commence from June 6, the officials informed on Monday. The new format will have teams divided into A,B,C groups instead of A1, A2 and A3. A division will have 21 teams. The teams that were included in this division in 2018-19 and 2019-20 seasons were dropped. However, the Combined XI team of the districts was retained in the same group to provide a platform for the cricketers from districts. Budding Stars Cricket Club, which stood first in A2 division in the seasons 2017-18, 2018-19 and 2019-2020 and first in A1 division in 2021-22 was also retained. The bottom two teams in A division after the end of the season will be demoted to B division while top two teams from B division will be promoted to A division, the release from HCA said. Meanwhile, the teams in A Division will be split into two pools. After the league matches, Zonals will be played for finalizing the team that will represent Hyderabad in Ranji and U-23 tournaments. In the B Division, the 62 teams will be split into five pools. The top 2 from each pool will play against top 2 from the other pools to decide the ranking and the top 2 will be promoted to A Division while bottom two from each pool will play against each other and the last two teams will be relegated to C Division. The C Division, with 105 teams, will be divided into 6 pools. Top team from each pool will play against each other to decide the ranking. Top two teams from the group will be promoted to B Division. Meanwhile, the players’ registration will commence from May 24 and end on June 3. Each club/institution can register 18 players. No transfer of players nor last-minute registrations are allowed. Also Read Hyderabad cricketer Sumanth announces retirement ‘Hyderabad Cricket Association elections will be held as early as possible’ Follow Us : Tags Hyderabad Hyderabad Cricket Association Related News This home museum in Hyderabad gives 1950s’ traditional vibe Easy outing for top seeds at Asian U-14 Tennis Tournament Telangana: Elected representatives thank CM KCR for repeal of GO 111 CM KCR pays tributes to activist Bhagya Reddy Varma Hyderabad: Rohith, Nanditha emerge champions at Roller Skating Championship Hyderabad: Several restrictions on SCB roads still in place despite MoD orders","pubDate":"2023-05-22 18:15:38","image_url":null,"source_id":"telanganatoday","category":["sports"],"country":["india"],"language":"english"},{"title":"Gill-Shankar Deny RCB Wicket For 12 Overs","link":"https://thenorthlines.com/gill-shankar-deny-rcb-wicket-for-12-overs/","keywords":["Cricket","Sports"],"creator":["Northlines"],"video_url":null,"description":"NL Corresspondent   Playing only their second IPL season, Gujarat Titans seem to have cracked the code. They dominated the league stage in their debut season last year to emerge top of the standings with 10 wins from 14 games before they went on to win the title. And this year again, Gujarat are the […] The post Gill-Shankar Deny RCB Wicket For 12 Overs appeared first on Northlines.","content":"NL Corresspondent Playing only their second IPL season, Gujarat Titans seem to have cracked the code. They dominated the league stage in their debut season last year to emerge top of the standings with 10 wins from 14 games before they went on to win the title. And this year again, Gujarat are the title favourites going into the Play-Offs after they repeated their league performance from last year with 10 victories from 14 games. Their superb showing in IPL 2023 has been courtesy some excellent peformances from the likes of Shubman Gill, Rashid Khan and Mohammed Shami among others. Shubman Gill continues to enchance his reputation as the best young batter in world cricket . His second successive IPL century saw Gujarat outclass RCB by six wickets to continue their amazing record in run chases, winning 14 out of 17 matches when batting second. Mohammed Shami showed why he is the most consistent Indian bowler across formats with 24 wickets in 14 games, the same as his team-mate Rashid Khan — the best spinner in the world in T20 cricket. Having already qualified for the Play-Offs, Gujarat could have easily switched off and rested a their key players for their last league match against RCB. But the defending champions were aware that a defeat could disrupt their momentum ahead of the Play-Offs and hence went in with a full-strength team against RCB. After RCB raced to 62 for no loss in the Powerplay, Gujarat fought back with three wickets in the space of 14 balls. It was the Afghanistan spin duo who pegged back RCB in the middle overs. While left-arm wrist spinner Noor Ahmad accounted for Faf du Plessis (28) and Mahipal Lomror (1), Rashid dismissed the dangerous Glenn Maxwell for 11. In a match where all the Gujarat bowlers went for nine runs and above, Rashid stood out with his control as he picked up 1/24 in four overs. Shami also made a crucial impact as he got Michael Bracewell, who had smashed his way to 26 from 16 balls, in the 14th over to halt RCB's momentum. Yash Dayal got Dinesh Karthik caught behind off a bouncer as the veteran perishedfor his fourth duck in IPL 2023. RCB looked in danger of finishing around 180 before Virat Kohli and Anuj Rawat (23 from 15 balls) went on the attack at the end, hitting 42 from the last three overs. Gujarat went into the break on a high as they kept RCB under 200 on a flat wicket with short boundaries. Gujarat's run chase didn't get off to a bright start as Wriddhiman Saha struggled with his timing before he was dismissed by Mohammed Siraj for 12. The visitors were struggling on 35/1 in five overs and RCB fans were already dancing in the stands before Gill and Vijay Shankar turned the match on its head with their big partnership. The duo hit a couple of fours and a six off wAYNE Parnell in the sixth over to get the GT innings kickstarted after the slow start. The all-rounder played a superb ramp shot, steering the slower bouncer from Vijaykumar Vyshak over the wicket-keeper for a four and hit the next back over the bowler for another boundary.","pubDate":"2023-05-22 17:55:56","image_url":null,"source_id":"thenorthlines","category":["sports"],"country":["india"],"language":"english"},{"title":"Fear of Unknown: CSK meets ‘CSK Lite’ as Dhoni faces ‘Gill Test’","link":"https://thenorthlines.com/fear-of-unknown-csk-meets-csk-lite-as-dhoni-faces-gill-test/","keywords":["Cricket","Sports"],"creator":["Northlines"],"video_url":null,"description":"Agencies   The astute tactician in Mahendra Singh Dhoni will dig deep into his reserves to counter Indian cricket's new ‘Crown Prince' Shubman Gill as four-time champions Chennai Super Kings will meet their match in current title holders Gujarat Titans in Qualifier-1 of the IPL in Chennai on Tuesday. Gill, who almost single-handedly knocked out […] The post Fear of Unknown: CSK meets ‘CSK Lite’ as Dhoni faces ‘Gill Test’ appeared first on Northlines.","content":"Agencies The astute tactician in Mahendra Singh Dhoni will dig deep into his reserves to counter Indian cricket 's new ‘Crown Prince' Shubman Gill as four-time champions Chennai Super Kings will meet their match in current title holders Gujarat Titans in Qualifier-1 of the IPL in Chennai on Tuesday. Gill, who almost single-handedly knocked out a star-studded Royal Challengers Bangalore with a century for the keeps, has overshadowed Virat Kohli and will certainly force one of India 's greatest captains to go back to drawing board and make plans for him. Gill is in the midst of a dream season and what will be Dhoni's tactical ploy to stop the dashing ‘Mohali Marauder' is there to be seen. This season, Gujarat Titans haven't played at the Chepauk, which hasn't behaved in a singular manner during CSK's seven home games and that prompted head coach Stephen Fleming to raise apprehensions about what to expect. What makes this battle even more interesting is the fact that GT is a team that seems closest to being a proto-type of what CSK had been all these years in IPL. A solid management and an administration team that stays in the background and never interferes in cricketing matters, which is left to the trio of Ashish Nehra, Gary Kirsten and Vikram Solanki. A captain, who swears that his understanding of leadership is cut from Dhoni's ‘captaincy cloth', and head coach Nehra, who just like his former teammate doesn't believe in too many changes even if a couple of games go wrong. They don't field players based on their auction worth — remember CSK bought Krishnappa Gowtham for nearly Rs 10 crore and he got a single game as he didn't fit the combination. Similarly, GT has current India T20 pacer Shivam Mavi on its roster for a whopping Rs 6 crore but the team management has preferred veteran Mohit Sharma, who is executing the slower deliveries beautifully. It's all about who fits what role. So, it becomes more interesting when two teams with similar philosophy are pitted against each other. The teams which don't make long-term promises that are difficult to fulfil but focus on immediate process and know the roles of players required for slots. For Gujarat, tackling the slowness of the Chepauk track will be a challenge and how well they negotiate Deepak Chahar's powerplay overs and Matheesha Pathirana's slingers at the back-end, will determine the outcome of the match. And herein, Pandya and Nehra will find Sri Lanka skipper Dasun Shanaka's inputs handy as he has handled both Pathirana and spinner Maheesh Theekshana for the national team. While Shanaka might be used more as an all-rounder, Titans depending on the toss can also try out left-arm spinner R Sai Kishore, who knows these conditions well. There is a chance that Irishman Joshua Little will be back in playing XI in place of Shanaka and Sai Kishore comes in place of Yash Dayal, who is yet to get back his confidence after the five sixes assault on him by his statemate Rinku Singh. For CSK, a good start by the crack pair of Devon Conway and Ruturaj Gaikwad will be important. But at the Chepauk, even Ajinkya Rahane could become a factor while Shivam Dube would love to add to his 33 sixes for the season. Conway and Gaikwad have provided brisk and substantial starts for CSK, the middle-order hasn't exactly got going. With GT bowling led by Mohammed Shami and Rashid Khan (24 wickets each so far) things won't be easy for the home team's batters, Conway and Gaikwad included. How the CSK opening duo handles the relentless Shami may prove vital and it would be important for the under-performing middle-order to step up in a crunch game. The pitches at Chepauk so far have been a bit up and down, with a few being slow in nature while some have been good to bat on. CSK head coach Fleming said as much after the win over Delhi Capitals, claiming that the team is unsure about the conditions (at home). If a sluggish pitch is rolled out for the match, the spinners in the two teams would have a huge part to play. If CSK has Ravindra Jadeja, Moeen Ali and Theekshana, the Titans boast of a line-up that includes Rashid and Noor Ahmad. Teams (from): Chennai Super Kings: MS Dhoni (c/wk), Akash Singh, Moeen Ali, Bhagath Varma, Deepak Chahar, Devon Conway, Tushar Deshpande, Shivam Dube, Ruturaj Gaikwad, Rajvardhan Hangargekar, Ravindra Jadeja, Sisanda Magala, Ajay Mandal, Matheesha Pathirana, Dwaine Pretorius, Ajinkya Rahane, Shaik Rasheed, Ambati Rayudu, Mitchell Santner, Subhranshu Senapati, Simarjeet Singh, Nishant Sindhu, Prashant Solanki, Maheesh Theekshana. Gujarat Titans: Hardik Pandya (c), Shubman Gill, David Miller, Abhinav Manohar, Sai Sudharsan, Wriddhiman Saha, Matthew Wade, Rashid Khan, Rahul Tewatia, Vijay Shankar, Mohammed Shami, Alzarri Joseph, Yash Dayal, Pradeep Sangwan, Darshan Nalkande, Jayant Yadav, R. Sai Kishore, Noor Ahmad, Dasun Shanaka, Odean Smith, KS Bharat, Shivam Mavi, Urvil Patel, Joshua Little and Mohit Sharma. Match starts at 7.30 PM.","pubDate":"2023-05-22 17:55:08","image_url":null,"source_id":"thenorthlines","category":["sports"],"country":["india"],"language":"english"},{"title":"\"I Love How He...\": Australia Great Dissects Gill's Phenomenal Batting","link":"https://sports.ndtv.com/cricket/i-love-how-he-australia-great-dissects-shubman-gills-phenomenal-batting-in-ipl-2023-4057437","keywords":null,"creator":null,"video_url":null,"description":"Shubman Gill is currently the second highest run-getter in the IPL 2023","content":"Virat Kohli pulled off a string of records en-route his second successive century of the IPL 2023 against Gujarat Titans at the Chinnaswamy Stadium on Sunday night, but Royal Challengers Bangalore (RCB) failed to make it to the play-offs of the tournament as Titans opener Shubman Gill helped his side pull off a brilliant six-wicket win with five balls to spare, leaving the home supporters stunned. Gill not only matched Kohli shot for shot, he ended up with a better strike rate that was crucial to his team's near-perfect chase. He was ably supported by Vijay Shankar , who came in as an impact player and hammered 53 off 35 balls. His innings was laced with seven boundaries and a couple of sixes. RCB's loss meant that Mumbai Indians (MI), who had earlier in the day beaten Sunrisers Hyderabad at the Wankhede Stadium in Mumbai, moved into the plays-offs by virtue of finishing fourth on the table with 16 points. RCB, on the other hand, ended up finishing sixth in the tournament on 14 points behind Rajasthan Royals. The Titans, who topped the table with 20 points will now play Chennai Super Kings in Qualifier 1 on Tuesday while MI will lock horns with Lucknow Super Giants in the Eliminator a day later. Former Australia pacer Brett Lee was all praise for Gill, saying on JioCinema: \"He hit eight sixes. I love how he goes on the leg side. He finds power. That he can do and access because he's got strong wrists and he's got beautiful timing.\" Gill and Shankar put on a century stand and Lee said: \"123 off 71 balls, that was the partnership that broke the back of the RCB bowlers. Yes, it was a wet ball, conditions didn't really favour the bowlers but you got to give credit where credit is due. They both batted beautifully.\" Speaking about Kohli's ton, former India Test captain Anil Kumble said on JioCinema: \"You could see that passion and hunger. Today was an important innings for RCB, no other batsman was going well today. Faf du Plessis is a very good player but after he got out quick the pressure was on Virat Kohli. But with that pressure and responsibility he scored a great century.\"","pubDate":"2023-05-22 17:20:12","image_url":null,"source_id":"ndtv","category":["sports"],"country":["india"],"language":"english"},{"title":"Gill ton trumps Kohli’s 101 as Bangalore knocked out of IPL","link":"https://www.kuwaittimes.com/gill-ton-trumps-kohlis-101-as-bangalore-knocked-out-of-ipl/","keywords":["Cricket","Sports","Gill","ipl","kohli"],"creator":["Rajesh"],"video_url":null,"description":"BENGALURU: Shubman Gill hit an unbeaten 104 to trump Virat Kohli’s record century as holders Gujarat Titans knocked Royal Challengers Bangalore out of the IPL with a six-wicket victory on Sunday. The result allowed five-time winners Mumbai Indians to fill the fourth and final play-off spot after they hammered Sunrisers Hyderabad by eight wickets in … The post Gill ton trumps Kohli’s 101 as Bangalore knocked out of IPL appeared first on Kuwait Times.","content":"BENGALURU: Shubman Gill hit an unbeaten 104 to trump Virat Kohli’s record century as holders Gujarat Titans knocked Royal Challengers Bangalore out of the IPL with a six-wicket victory on Sunday. The result allowed five-time winners Mumbai Indians to fill the fourth and final play-off spot after they hammered Sunrisers Hyderabad by eight wickets in the first match of the day. Gill starred in the final group match with a 52-ball knock that steered Gujarat to victory with five balls to spare. Gill hit the winning six to raise his second straight ton. His hundred was the event’s third of the day after Cameron Green’s match-winning 100 for Mumbai and then Kohli’s 101 not out. “As a bowler, Gill doesn’t give you a chance,” Gujarat skipper Hardik Pandya said of his star batsman, who put on a key 123-run stand with Vijay Shankar, who made 53. “Other batters also get confidence from it.” Kohli hit his second successive hundred and seventh in the IPL to overtake Chris Gayle’s six and steer Bangalore to 197-5 in a match that started an hour late due to rain in Bengaluru. The effort was in vain as Kohli’s wait for an elusive IPL title goes on for another year. “A lot of people think that my T20 cricket is declining, I don’t feel like that at all. I think I am playing my best T20 cricket again,” said Kohli after an innings which featured 13 fours and a six. “I’m just enjoying myself. This is how I play T20 cricket.”   ‘Unbelievable Virat’ Mumbai will play Lucknow Super Giants, who became the third team to make the play-offs on Saturday, in the eliminator next week. Table-toppers Gujarat and second-placed Chennai Super Kings will clash in the first qualifier on Tuesday. The winner of Qualifier 1 will head straight to the final in Ahmedabad on May 28 and the loser will play the winner of the eliminator. Kohli started strongly in a 67-run opening partnership with skipper Faf du Plessis, who made 28 to stay on top of the batting chart with 730 runs. Kohli, who made a match-winning 100 in Bangalore’s previous game, had moved behind Du Plessis in the batting list with 639 runs but Gill toppled the senior star to take second spot with 674 runs. “Virat played an unbelievable knock to give us a chance and thought that was a good score,” said Du Plessis. “But Shubman played incredibly well to take the game away from us.” In the first match, Green starred for Mumbai with his first ever T20 century as he hit a 47-ball unbeaten 100 to drive his team home with two overs to spare. Green, a big buy for Mumbai for $2.11 million in the auction, stood out with eight fours and eight sixes. After Rohit Sharma’s departure, Green kept up the charge and put on an unbeaten partnership with Suryakumar Yadav, who hit 25, to register their eighth win in 14 group matches. Medium-pace bowler Akash Madhwal set up victory with figures of 4-37 to check Hyderabad to 200-5, a total that looked to go bigger but for some disciplined bowling. Hyderabad, led by Aiden Markram, took the wooden spoon in the 10-team table. — AFP The post Gill ton trumps Kohli’s 101 as Bangalore knocked out of IPL appeared first on Kuwait Times.","pubDate":"2023-05-22 16:31:19","image_url":null,"source_id":"kuwaittimes","category":["sports"],"country":["kuwait"],"language":"arabic"},{"title":"IPL 2023 Qualifier 1, GT vs CSK preview: Tactician Dhoni faces Gill test","link":"https://telanganatoday.com/ipl-2023-qualifier-1-gt-vs-csk-preview-tactician-dhoni-faces-gill-test","keywords":["News","Sport","Chennai Super Kings","Gujarat Titans","IPL 2023"],"creator":["PTI"],"video_url":null,"description":"Mahendra Singh Dhoni will dig deep into his reserves to counter Indian cricket's new 'Crown Prince' Shubman Gill","content":"Home | Sport | Ipl 2023 Qualifier 1 Gt Vs Csk Preview Tactician Dhoni Faces Gill Test IPL 2023 Qualifier 1, GT vs CSK preview: Tactician Dhoni faces Gill test Mahendra Singh Dhoni will dig deep into his reserves to counter Indian cricket's new 'Crown Prince' Shubman Gill By PTI Published Date - 07:40 AM, Tue - 23 May 23 PTI Photo Chennai: The astute tactician in Mahendra Singh Dhoni will dig deep into his reserves to counter Indian cricket’s new ‘Crown Prince’ Shubman Gill as four-time champions Chennai Super Kings will meet their match in current title holders Gujarat Titans in Qualifier-1 of the IPL here on Tuesday. Gill, who almost single-handedly knocked out a star-studded Royal Challengers Bangalore with a century for the keeps, has overshadowed Virat Kohli and will certainly force one of India’s greatest captains to go back to drawing board and make plans for him. Gill is in the midst of a dream season and what will be Dhoni’s tactical ploy to stop the dashing ‘Mohali Marauder’ is there to be seen. This season, Gujarat Titans haven’t played at the Chepauk, which hasn’t behaved in a singular manner during CSK’s seven home games and that prompted head coach Stephen Fleming to raise apprehensions about what to expect. What makes this battle even more interesting is the fact that GT is a team that seems closest to being a proto-type of what CSK had been all these years in IPL. A solid management and an administration team that stay in the background and never interferes in cricketing matters, which is left to the trio of Ashish Nehra, Gary Kirsten and Vikram Solanki. A captain, who swears that his understanding of leadership is cut from Dhoni’s ‘captaincy cloth’, and head coach Nehra, who just like his former teammate doesn’t believe in too many changes even if a couple of games go wrong. They don’t field players based on their auction worth – remember CSK bought Krishnappa Gowtham for nearly Rs 10 crore and he got a single game as he didn’t fit the combination. Similarly, GT has current India T20 pacer Shivam Mavi on its roster for a whopping Rs 6 crore but the team management has preferred veteran Mohit Sharma, who is executing the slower deliveries beautifully. It’s all about who fits what role. So, it becomes more interesting when two teams with similar philosophy are pitted against each other. The teams which don’t make long-term promises that are difficult to fulfil but focus on immediate process and know the roles of players required for slots. For Gujarat, tackling the slowness of the Chepauk track will be a challenge and how well they negotiate Deepak Chahar’s powerplay overs and Matheesha Pathirana’s slingers at the back-end, will determine the outcome of the match. And herein, Pandya and Nehra will find Sri Lanka skipper Dasun Shanaka’s inputs handy as he has handled both Pathirana and spinner Maheesh Theekshana for the national team. While Shanaka might be used more as an all-rounder, Titans depending on the toss can also try out left-arm spinner R Sai Kishore, who knows these conditions well. There is a chance that Irishman Joshua Little will be back in playing XI in place of Shanaka and Sai Kishore comes in place of Yash Dayal, who is yet to get back his confidence after the five sixes assault on him by his Statemate Rinku Singh. For CSK , a good start by the crack pair of Devon Conway and Ruturaj Gaikwad will be important. But at the Chepauk, even Ajinkya Rahane could become a factor while Shivam Dube would love to add to his 33 sixes for the season. Conway and Gaikwad have provided brisk and substantial starts for CSK, the middle-order hasn’t exactly got going. With GT bowling led by Mohammed Shami and Rashid Khan (24 wickets each so far), things won’t be easy for the home team’s batters, Conway and Gaikwad included. How the CSK opening duo handles the relentless Shami may prove vital and it would be important for the under-performing middle-order to step up in a crunch game. The pitches at Chepauk so far have been a bit up and down, with a few being slow in nature while some have been good to bat on. CSK head coach Fleming said as much after the win over Delhi Capitals, claiming that the team is unsure about the conditions (at home). If a sluggish pitch is rolled out for the match, the spinners in the two teams would have a huge part to play. If CSK has Ravindra Jadeja, Moeen Ali and Theekshana, the Titans boast of a line-up that includes Rashid and Noor Ahmad. Also Read IPL 2023: RCB’s campaign ends after six-wicket loss to GT, MI through IPL 2023: Ben Stokes leaves CSK to prepare for England’s upcoming home summer Follow Us : Tags Chennai Super Kings Gujarat Titans IPL 2023 Related News IPL 2023: Virat Kohli’s niggle in knee not a cause for concern, says RCB Head Coach IPL 2023: RCB’s campaign ends after six-wicket loss to GT, MI through IPL 2023: Ben Stokes leaves CSK to prepare for England’s upcoming home summer IPL 2023: RCB vs GT Live updates IPL 2023: Green century, Rohit’s fifty guide MI to eight-wicket win over SRH IPL: SRH vs MI Live updates","pubDate":"2023-05-23 02:10:04","image_url":null,"source_id":"telanganatoday","category":["sports"],"country":["india"],"language":"english"},{"title":"Islamabad Club Reds lift Islamabad Club Cricket League title","link":"https://www.nation.com.pk/23-May-2023/islamabad-club-reds-lift-islamabad-club-cricket-league-title","keywords":["Sports"],"creator":["STAFF REPORT"],"video_url":null,"description":"LAHORE - Islamabad Club Reds lifted the title of Islamabad Club Cricket League by thrashing Islamabad Club Blues by 10 wickets at Oval Cricket Ground, Islamabad.","content":"LAHORE - Islamabad Club Reds lifted the title of Islamabad Club Cricket League by thrashing Islamabad Club Blues by 10 wickets at Oval Cricket Ground, Islamabad. Majid Khan, former captain of Pakistan cricket team, was the chief guest of the final while former PCB COO Shafaqat Naghmi, Islamabad Club Cricket Committee senior member Zubair Nasir, Test cricketer Yasir Hameed and others dignities were also present there. In the final, Islamabad Club Blues scored 175-6 in 20 overs, thanks to Ashas Gill’s 89 and Raza Akram’s 25 runs, while Ahmed Taj dismissed 3 for 36. In reply, Islamabad Reds chased the target in 13th over with unbeatable opening partnership between Umer Kiyani and Salman Chaudhry of 176 runs. Umer Kayani smashed unbeatable century with 10 massive sixes and 6 fours in just 40 balls while Salman Chaudhry hammered unbeaten 72. Umar Kayani was named player of the match and tournament.","pubDate":"2023-05-22 22:21:19","image_url":null,"source_id":"nation_pk","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"Kohli feels back to his best","link":"https://www.herald.co.zw/kohli-feels-back-to-his-best/","keywords":["Sport"],"creator":["The Herald"],"video_url":null,"description":"MUMBAI. — India star Virat Kohli has issued a warning ahead of next year’s ICC Men’s T20 World Cup by declaring he is at the top of his game and feels like he is playing his best T20 cricket.","content":"India star Virat Kohli has issued a warning ahead of next year’s ICC Men’s T20 World Cup by declaring he is at the top of his game and feels like he is playing his best T20 cricket. Kohli finished as the leading run scorer at the most recent edition of the T20 World Cup in Australia when he amassed an eye-catching 296 runs for his country at a Bradmanesque average of 98.66 and a strike rate greater than 136, but was expected to face greater competition from India’s bevy of young batters in the lead-up to next year’s event in the Caribbean and USA. But the 34-year-old is showing no signs of slowing down based on his recent efforts in the Indian Premier League and has given every indication he wants to continue playing 20-over cricket for his country. The champion right-hander has scored 639 runs from 14 matches while opening the batting for Royal Challengers Bangalore, with his most recent contribution an unbeaten 101 from just 61 balls as his side fell out of the playoffs race to Gujarat Titans. “It’s more important than cricket practice.” What does Virat Kohli think about fitness? Find out. It was Kohli’s second century on the trot for his IPL franchise and the veteran said he is back playing his best when asked by former India coach Ravi Shastri at the completion of his innings. “Ya, I felt great. A lot of people feel my T20 cricket is declining, but I don’t feel like that at all,” Kohli said. “I feel I am playing my best T20 cricket again. I’m just enjoying myself, this is how I play T20 cricket. I look to hit gaps, hit a lot of boundaries and the big ones in the end if the situation allows me to. “Strike rates, all those kind of things like I said in the past as well . . . you have to read the situation and rise up to the occasion when the situation demands, and that’s some-thing I take a lot of pride in doing, and I’ve been doing it for a while now. I feel really good with my game at the moment and how I’m batting out there in the middle.” Kohli hasn’t been the only experienced campaigner performing well at the top of the order for Royal Challengers Bangalore this season, with South Africa batter Faf du Plessis also in good touch having scored 730 runs to be the leading run scorer for the tournament thus far. Kohli and du Plessis combined for a total of 939 runs across 14 innings — equalling the previous record from IPL 2016 set by Kohli and AB de Villiers’ of most runs by a pair in a T20 tournament — as Royal Challengers Bangalore narrowly missed out on a spot in the playoffs. Karthik backs du Plessis to make international comeback at World Cup. Du Plessis was full of praise for Kohli and believes his fellow opener still has plenty to offer in the shortest format of the game. “He (Kohli) has played really good cricket throughout the season,” du Plessis said. “It just shows you Virat has got a lot left in the tank in T20 cricket as he is playing really well still.” ZIMBABWE’S Warriors will be waiting anxiously for the quick resolution of ZIFA’s suspension from global football after the Confederation of African Football announced that the draw for the 2026 World Cup will be held in two months. THE Premier Soccer League are set to determine the way forward following a week of boardroom bickering which resulted in the chaos and abandonment of the league match between Sheasham and CAPS United scheduled for Mandava on Sunday. MADRID. — Soccer governing body FIFA’s president Gianni Infantino expressed his support for Real Madrid forward Vinicius Jr after he called LaLiga and Spain “racist” after receiving racial slurs from fans in Sunday’s game at Valencia’s Mestalla Stadium.","pubDate":"2023-05-22 22:01:20","image_url":null,"source_id":"herald_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"NPL expand to 14 teams, playoff fixtures announced","link":"https://www.herald.co.zw/npl-expand-to-14-teams-playoff-fixtures-announced/","keywords":["Sport"],"creator":["The Herald"],"video_url":null,"description":"The 2023/24 edition of the National Premier League (NPL) will be a grand affair featuring 14 teams following a decision by Zimbabwe Cricket to add four more participants in order to open up the top-flight club cricket competition to men’s teams from all the 10 provinces in the country.","content":"The 2023/24 edition of the National Premier League (NPL) will be a grand affair featuring 14 teams following a decision by Zimbabwe Cricket to add four more participants in order to open up the top-flight club cricket competition to men’s teams from all the 10 provinces in the country. The new qualification pathway will see nine teams qualify directly on sporting merit through their top provincial club championships, while the other five spots will be filled up through playoffs. Harare Metropolitan will have four teams securing their places directly in the NPL, followed by Bulawayo Metropolitan with two guaranteed berths. Manicaland, Masvingo and Midlands will each have one spot through direct qualification. The best teams from Mashonaland Central, Mashonaland East, Mashonaland West, Matabeleland North and Matabeleland South will have to go through NPL playoffs against clubs from the top provinces. In the first playoff match played at Kadoma Sports Club on Sunday, Kadoma Sports Club beat Kwekwe Sports Club by 220 runs to book their place in the main tournament. Four other playoff matches are scheduled to take place on 27 and 28 May at venues across the country. ZIMBABWE’S Warriors will be waiting anxiously for the quick resolution of ZIFA’s suspension from global football after the Confederation of African Football announced that the draw for the 2026 World Cup will be held in two months. THE Premier Soccer League are set to determine the way forward following a week of boardroom bickering which resulted in the chaos and abandonment of the league match between Sheasham and CAPS United scheduled for Mandava on Sunday. MADRID. — Soccer governing body FIFA’s president Gianni Infantino expressed his support for Real Madrid forward Vinicius Jr after he called LaLiga and Spain “racist” after receiving racial slurs from fans in Sunday’s game at Valencia’s Mestalla Stadium.","pubDate":"2023-05-22 22:01:10","image_url":null,"source_id":"herald_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"Morgan Topping leads the way as Northern Knights cruise to second win in Inter-pro Cup","link":"https://www.belfasttelegraph.co.uk/sport/cricket/morgan-topping-leads-the-way-as-northern-knights-cruise-to-second-win-in-inter-pro-cup/420842342.html","keywords":null,"creator":null,"video_url":null,"description":"Morgan Topping may have fallen eight runs short of a deserved century but he ensured Northern Knights made it two wins out of two in this year’s Inter-Provincial Cup, with victory over champions Munster Reds at Stormont.","content":"Topping, the 24-year old Waringstown batter, playing only his fourth List A match, showed off all his burgeoning talent to dominate the Knights’ ultimately comfortable chase and while the three wickets margin may look tight, they had 17 balls to spare and three wickets fell within 30 runs of their 270 target. Cade Carmichael, in superb form for Instonians scored his first List A 50, sharing a partnership of 87 with Topping who then added 92 with Neil Rock, fresh from his astonishing 142 off 53 balls in the National Cup on Saturday. The diminutive left hander did not have to score as quickly this time, although his 39 still came off 29 balls with seven fours and with Topping scoring at a run-a-ball, the Knights were always in control of the chase. The only worries came early when Ross Adair was caught at second slip for a duck and Ruhan Pretorius holed out to mid-on for just eight, leaving the hosts on 19 for two. James McCollum, in his last game before joining up with the Ireland squad, looked good for his 38 balls but then found Gareth Delany at deep square but that only let this Knights team show off their depth in batting. The bowling depth was highlighted in their team selection with Matthew Foster, despite taking three wickets in Dublin last week, left out on his home ground. They still had skipper Mark Adair to share the new ball with Pretorius but neither made a breakthrough as Murray Commins and Ali Frost put on 106 for the first wicket. It was Tyron Koen who ended the stand in the 25th over but Commins went on and on, bringing up his second century on the ground from 111 balls with 13 fours and a six. However, he failed to match his previous best of 125, caught at long-on off Theo van Woerkom who, like Tom Mayes before him, then took two wickets in two balls. The inter-provincial action continues today at Bready when North West Warriors host Leinster Lightning with Cian Robertson, the Instonians slow left armer, expected to make his Warriors debut, after playing one match for the Knights last season. (M Commins 114, A Frost 37, M Ford 33 not out, C Campher 26; T Mayes 3-34, T van Woerkom 3-58, T Koen 1-61) (47.1 overs, M Topping 92, C Carmichael 62, N Rock 39, J McCollum 30, M Adair 20; L McCarthy 4-67, M Granger 2-30). Knights won by three wickets.","pubDate":"2023-05-22 20:13:37","image_url":"https://s3.eu-west-1.amazonaws.com/prod-mh-ireland/a6df8035-4002-4c6b-af33-69c76f5d71c0/a2c24506-b382-4a95-a523-eaf461401918/v%20Munster%20Reds%2021.jpg","source_id":"belfasttelegraph","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"HCA league matches to commence from June 6","link":"https://telanganatoday.com/hca-league-matches-to-commence-from-june-6","keywords":["Hyderabad","News","Sport","Hyderabad Cricket Association"],"creator":["Telangana Today"],"video_url":null,"description":"The much-awaited Hyderabad Cricket Association league matches will commence from June 6, the officials informed","content":"Home | Sport | Hca League Matches To Commence From June 6 HCA league matches to commence from June 6 The much-awaited Hyderabad Cricket Association league matches will commence from June 6, the officials informed By Telangana Today Published Date - 11:45 PM, Mon - 22 May 23 Hyderabad: The much-awaited Hyderabad Cricket Association league matches will commence from June 6, the officials informed on Monday. The new format will have teams divided into A,B,C groups instead of A1, A2 and A3. A division will have 21 teams. The teams that were included in this division in 2018-19 and 2019-20 seasons were dropped. However, the Combined XI team of the districts was retained in the same group to provide a platform for the cricketers from districts. Budding Stars Cricket Club, which stood first in A2 division in the seasons 2017-18, 2018-19 and 2019-2020 and first in A1 division in 2021-22 was also retained. The bottom two teams in A division after the end of the season will be demoted to B division while top two teams from B division will be promoted to A division, the release from HCA said. Meanwhile, the teams in A Division will be split into two pools. After the league matches, Zonals will be played for finalizing the team that will represent Hyderabad in Ranji and U-23 tournaments. In the B Division, the 62 teams will be split into five pools. The top 2 from each pool will play against top 2 from the other pools to decide the ranking and the top 2 will be promoted to A Division while bottom two from each pool will play against each other and the last two teams will be relegated to C Division. The C Division, with 105 teams, will be divided into 6 pools. Top team from each pool will play against each other to decide the ranking. Top two teams from the group will be promoted to B Division. Meanwhile, the players’ registration will commence from May 24 and end on June 3. Each club/institution can register 18 players. No transfer of players nor last-minute registrations are allowed. Also Read Hyderabad cricketer Sumanth announces retirement ‘Hyderabad Cricket Association elections will be held as early as possible’ Follow Us : Tags Hyderabad Hyderabad Cricket Association Related News This home museum in Hyderabad gives 1950s’ traditional vibe Easy outing for top seeds at Asian U-14 Tennis Tournament Telangana: Elected representatives thank CM KCR for repeal of GO 111 CM KCR pays tributes to activist Bhagya Reddy Varma Hyderabad: Rohith, Nanditha emerge champions at Roller Skating Championship Hyderabad: Several restrictions on SCB roads still in place despite MoD orders","pubDate":"2023-05-22 18:15:38","image_url":null,"source_id":"telanganatoday","category":["sports"],"country":["india"],"language":"english"},{"title":"Gill-Shankar Deny RCB Wicket For 12 Overs","link":"https://thenorthlines.com/gill-shankar-deny-rcb-wicket-for-12-overs/","keywords":["Cricket","Sports"],"creator":["Northlines"],"video_url":null,"description":"NL Corresspondent   Playing only their second IPL season, Gujarat Titans seem to have cracked the code. They dominated the league stage in their debut season last year to emerge top of the standings with 10 wins from 14 games before they went on to win the title. And this year again, Gujarat are the […] The post Gill-Shankar Deny RCB Wicket For 12 Overs appeared first on Northlines.","content":"NL Corresspondent Playing only their second IPL season, Gujarat Titans seem to have cracked the code. They dominated the league stage in their debut season last year to emerge top of the standings with 10 wins from 14 games before they went on to win the title. And this year again, Gujarat are the title favourites going into the Play-Offs after they repeated their league performance from last year with 10 victories from 14 games. Their superb showing in IPL 2023 has been courtesy some excellent peformances from the likes of Shubman Gill, Rashid Khan and Mohammed Shami among others. Shubman Gill continues to enchance his reputation as the best young batter in world cricket . His second successive IPL century saw Gujarat outclass RCB by six wickets to continue their amazing record in run chases, winning 14 out of 17 matches when batting second. Mohammed Shami showed why he is the most consistent Indian bowler across formats with 24 wickets in 14 games, the same as his team-mate Rashid Khan — the best spinner in the world in T20 cricket. Having already qualified for the Play-Offs, Gujarat could have easily switched off and rested a their key players for their last league match against RCB. But the defending champions were aware that a defeat could disrupt their momentum ahead of the Play-Offs and hence went in with a full-strength team against RCB. After RCB raced to 62 for no loss in the Powerplay, Gujarat fought back with three wickets in the space of 14 balls. It was the Afghanistan spin duo who pegged back RCB in the middle overs. While left-arm wrist spinner Noor Ahmad accounted for Faf du Plessis (28) and Mahipal Lomror (1), Rashid dismissed the dangerous Glenn Maxwell for 11. In a match where all the Gujarat bowlers went for nine runs and above, Rashid stood out with his control as he picked up 1/24 in four overs. Shami also made a crucial impact as he got Michael Bracewell, who had smashed his way to 26 from 16 balls, in the 14th over to halt RCB's momentum. Yash Dayal got Dinesh Karthik caught behind off a bouncer as the veteran perishedfor his fourth duck in IPL 2023. RCB looked in danger of finishing around 180 before Virat Kohli and Anuj Rawat (23 from 15 balls) went on the attack at the end, hitting 42 from the last three overs. Gujarat went into the break on a high as they kept RCB under 200 on a flat wicket with short boundaries. Gujarat's run chase didn't get off to a bright start as Wriddhiman Saha struggled with his timing before he was dismissed by Mohammed Siraj for 12. The visitors were struggling on 35/1 in five overs and RCB fans were already dancing in the stands before Gill and Vijay Shankar turned the match on its head with their big partnership. The duo hit a couple of fours and a six off wAYNE Parnell in the sixth over to get the GT innings kickstarted after the slow start. The all-rounder played a superb ramp shot, steering the slower bouncer from Vijaykumar Vyshak over the wicket-keeper for a four and hit the next back over the bowler for another boundary.","pubDate":"2023-05-22 17:55:56","image_url":null,"source_id":"thenorthlines","category":["sports"],"country":["india"],"language":"english"},{"title":"Fear of Unknown: CSK meets ‘CSK Lite’ as Dhoni faces ‘Gill Test’","link":"https://thenorthlines.com/fear-of-unknown-csk-meets-csk-lite-as-dhoni-faces-gill-test/","keywords":["Cricket","Sports"],"creator":["Northlines"],"video_url":null,"description":"Agencies   The astute tactician in Mahendra Singh Dhoni will dig deep into his reserves to counter Indian cricket's new ‘Crown Prince' Shubman Gill as four-time champions Chennai Super Kings will meet their match in current title holders Gujarat Titans in Qualifier-1 of the IPL in Chennai on Tuesday. Gill, who almost single-handedly knocked out […] The post Fear of Unknown: CSK meets ‘CSK Lite’ as Dhoni faces ‘Gill Test’ appeared first on Northlines.","content":"Agencies The astute tactician in Mahendra Singh Dhoni will dig deep into his reserves to counter Indian cricket 's new ‘Crown Prince' Shubman Gill as four-time champions Chennai Super Kings will meet their match in current title holders Gujarat Titans in Qualifier-1 of the IPL in Chennai on Tuesday. Gill, who almost single-handedly knocked out a star-studded Royal Challengers Bangalore with a century for the keeps, has overshadowed Virat Kohli and will certainly force one of India 's greatest captains to go back to drawing board and make plans for him. Gill is in the midst of a dream season and what will be Dhoni's tactical ploy to stop the dashing ‘Mohali Marauder' is there to be seen. This season, Gujarat Titans haven't played at the Chepauk, which hasn't behaved in a singular manner during CSK's seven home games and that prompted head coach Stephen Fleming to raise apprehensions about what to expect. What makes this battle even more interesting is the fact that GT is a team that seems closest to being a proto-type of what CSK had been all these years in IPL. A solid management and an administration team that stays in the background and never interferes in cricketing matters, which is left to the trio of Ashish Nehra, Gary Kirsten and Vikram Solanki. A captain, who swears that his understanding of leadership is cut from Dhoni's ‘captaincy cloth', and head coach Nehra, who just like his former teammate doesn't believe in too many changes even if a couple of games go wrong. They don't field players based on their auction worth — remember CSK bought Krishnappa Gowtham for nearly Rs 10 crore and he got a single game as he didn't fit the combination. Similarly, GT has current India T20 pacer Shivam Mavi on its roster for a whopping Rs 6 crore but the team management has preferred veteran Mohit Sharma, who is executing the slower deliveries beautifully. It's all about who fits what role. So, it becomes more interesting when two teams with similar philosophy are pitted against each other. The teams which don't make long-term promises that are difficult to fulfil but focus on immediate process and know the roles of players required for slots. For Gujarat, tackling the slowness of the Chepauk track will be a challenge and how well they negotiate Deepak Chahar's powerplay overs and Matheesha Pathirana's slingers at the back-end, will determine the outcome of the match. And herein, Pandya and Nehra will find Sri Lanka skipper Dasun Shanaka's inputs handy as he has handled both Pathirana and spinner Maheesh Theekshana for the national team. While Shanaka might be used more as an all-rounder, Titans depending on the toss can also try out left-arm spinner R Sai Kishore, who knows these conditions well. There is a chance that Irishman Joshua Little will be back in playing XI in place of Shanaka and Sai Kishore comes in place of Yash Dayal, who is yet to get back his confidence after the five sixes assault on him by his statemate Rinku Singh. For CSK, a good start by the crack pair of Devon Conway and Ruturaj Gaikwad will be important. But at the Chepauk, even Ajinkya Rahane could become a factor while Shivam Dube would love to add to his 33 sixes for the season. Conway and Gaikwad have provided brisk and substantial starts for CSK, the middle-order hasn't exactly got going. With GT bowling led by Mohammed Shami and Rashid Khan (24 wickets each so far) things won't be easy for the home team's batters, Conway and Gaikwad included. How the CSK opening duo handles the relentless Shami may prove vital and it would be important for the under-performing middle-order to step up in a crunch game. The pitches at Chepauk so far have been a bit up and down, with a few being slow in nature while some have been good to bat on. CSK head coach Fleming said as much after the win over Delhi Capitals, claiming that the team is unsure about the conditions (at home). If a sluggish pitch is rolled out for the match, the spinners in the two teams would have a huge part to play. If CSK has Ravindra Jadeja, Moeen Ali and Theekshana, the Titans boast of a line-up that includes Rashid and Noor Ahmad. Teams (from): Chennai Super Kings: MS Dhoni (c/wk), Akash Singh, Moeen Ali, Bhagath Varma, Deepak Chahar, Devon Conway, Tushar Deshpande, Shivam Dube, Ruturaj Gaikwad, Rajvardhan Hangargekar, Ravindra Jadeja, Sisanda Magala, Ajay Mandal, Matheesha Pathirana, Dwaine Pretorius, Ajinkya Rahane, Shaik Rasheed, Ambati Rayudu, Mitchell Santner, Subhranshu Senapati, Simarjeet Singh, Nishant Sindhu, Prashant Solanki, Maheesh Theekshana. Gujarat Titans: Hardik Pandya (c), Shubman Gill, David Miller, Abhinav Manohar, Sai Sudharsan, Wriddhiman Saha, Matthew Wade, Rashid Khan, Rahul Tewatia, Vijay Shankar, Mohammed Shami, Alzarri Joseph, Yash Dayal, Pradeep Sangwan, Darshan Nalkande, Jayant Yadav, R. Sai Kishore, Noor Ahmad, Dasun Shanaka, Odean Smith, KS Bharat, Shivam Mavi, Urvil Patel, Joshua Little and Mohit Sharma. Match starts at 7.30 PM.","pubDate":"2023-05-22 17:55:08","image_url":null,"source_id":"thenorthlines","category":["sports"],"country":["india"],"language":"english"},{"title":"\"I Love How He...\": Australia Great Dissects Gill's Phenomenal Batting","link":"https://sports.ndtv.com/cricket/i-love-how-he-australia-great-dissects-shubman-gills-phenomenal-batting-in-ipl-2023-4057437","keywords":null,"creator":null,"video_url":null,"description":"Shubman Gill is currently the second highest run-getter in the IPL 2023","content":"Virat Kohli pulled off a string of records en-route his second successive century of the IPL 2023 against Gujarat Titans at the Chinnaswamy Stadium on Sunday night, but Royal Challengers Bangalore (RCB) failed to make it to the play-offs of the tournament as Titans opener Shubman Gill helped his side pull off a brilliant six-wicket win with five balls to spare, leaving the home supporters stunned. Gill not only matched Kohli shot for shot, he ended up with a better strike rate that was crucial to his team's near-perfect chase. He was ably supported by Vijay Shankar , who came in as an impact player and hammered 53 off 35 balls. His innings was laced with seven boundaries and a couple of sixes. RCB's loss meant that Mumbai Indians (MI), who had earlier in the day beaten Sunrisers Hyderabad at the Wankhede Stadium in Mumbai, moved into the plays-offs by virtue of finishing fourth on the table with 16 points. RCB, on the other hand, ended up finishing sixth in the tournament on 14 points behind Rajasthan Royals. The Titans, who topped the table with 20 points will now play Chennai Super Kings in Qualifier 1 on Tuesday while MI will lock horns with Lucknow Super Giants in the Eliminator a day later. Former Australia pacer Brett Lee was all praise for Gill, saying on JioCinema: \"He hit eight sixes. I love how he goes on the leg side. He finds power. That he can do and access because he's got strong wrists and he's got beautiful timing.\" Gill and Shankar put on a century stand and Lee said: \"123 off 71 balls, that was the partnership that broke the back of the RCB bowlers. Yes, it was a wet ball, conditions didn't really favour the bowlers but you got to give credit where credit is due. They both batted beautifully.\" Speaking about Kohli's ton, former India Test captain Anil Kumble said on JioCinema: \"You could see that passion and hunger. Today was an important innings for RCB, no other batsman was going well today. Faf du Plessis is a very good player but after he got out quick the pressure was on Virat Kohli. But with that pressure and responsibility he scored a great century.\"","pubDate":"2023-05-22 17:20:12","image_url":null,"source_id":"ndtv","category":["sports"],"country":["india"],"language":"english"},{"title":"Gill ton trumps Kohli’s 101 as Bangalore knocked out of IPL","link":"https://www.kuwaittimes.com/gill-ton-trumps-kohlis-101-as-bangalore-knocked-out-of-ipl/","keywords":["Cricket","Sports","Gill","ipl","kohli"],"creator":["Rajesh"],"video_url":null,"description":"BENGALURU: Shubman Gill hit an unbeaten 104 to trump Virat Kohli’s record century as holders Gujarat Titans knocked Royal Challengers Bangalore out of the IPL with a six-wicket victory on Sunday. The result allowed five-time winners Mumbai Indians to fill the fourth and final play-off spot after they hammered Sunrisers Hyderabad by eight wickets in … The post Gill ton trumps Kohli’s 101 as Bangalore knocked out of IPL appeared first on Kuwait Times.","content":"BENGALURU: Shubman Gill hit an unbeaten 104 to trump Virat Kohli’s record century as holders Gujarat Titans knocked Royal Challengers Bangalore out of the IPL with a six-wicket victory on Sunday. The result allowed five-time winners Mumbai Indians to fill the fourth and final play-off spot after they hammered Sunrisers Hyderabad by eight wickets in the first match of the day. Gill starred in the final group match with a 52-ball knock that steered Gujarat to victory with five balls to spare. Gill hit the winning six to raise his second straight ton. His hundred was the event’s third of the day after Cameron Green’s match-winning 100 for Mumbai and then Kohli’s 101 not out. “As a bowler, Gill doesn’t give you a chance,” Gujarat skipper Hardik Pandya said of his star batsman, who put on a key 123-run stand with Vijay Shankar, who made 53. “Other batters also get confidence from it.” Kohli hit his second successive hundred and seventh in the IPL to overtake Chris Gayle’s six and steer Bangalore to 197-5 in a match that started an hour late due to rain in Bengaluru. The effort was in vain as Kohli’s wait for an elusive IPL title goes on for another year. “A lot of people think that my T20 cricket is declining, I don’t feel like that at all. I think I am playing my best T20 cricket again,” said Kohli after an innings which featured 13 fours and a six. “I’m just enjoying myself. This is how I play T20 cricket.”   ‘Unbelievable Virat’ Mumbai will play Lucknow Super Giants, who became the third team to make the play-offs on Saturday, in the eliminator next week. Table-toppers Gujarat and second-placed Chennai Super Kings will clash in the first qualifier on Tuesday. The winner of Qualifier 1 will head straight to the final in Ahmedabad on May 28 and the loser will play the winner of the eliminator. Kohli started strongly in a 67-run opening partnership with skipper Faf du Plessis, who made 28 to stay on top of the batting chart with 730 runs. Kohli, who made a match-winning 100 in Bangalore’s previous game, had moved behind Du Plessis in the batting list with 639 runs but Gill toppled the senior star to take second spot with 674 runs. “Virat played an unbelievable knock to give us a chance and thought that was a good score,” said Du Plessis. “But Shubman played incredibly well to take the game away from us.” In the first match, Green starred for Mumbai with his first ever T20 century as he hit a 47-ball unbeaten 100 to drive his team home with two overs to spare. Green, a big buy for Mumbai for $2.11 million in the auction, stood out with eight fours and eight sixes. After Rohit Sharma’s departure, Green kept up the charge and put on an unbeaten partnership with Suryakumar Yadav, who hit 25, to register their eighth win in 14 group matches. Medium-pace bowler Akash Madhwal set up victory with figures of 4-37 to check Hyderabad to 200-5, a total that looked to go bigger but for some disciplined bowling. Hyderabad, led by Aiden Markram, took the wooden spoon in the 10-team table. — AFP The post Gill ton trumps Kohli’s 101 as Bangalore knocked out of IPL appeared first on Kuwait Times.","pubDate":"2023-05-22 16:31:19","image_url":null,"source_id":"kuwaittimes","category":["sports"],"country":["kuwait"],"language":"arabic"},{"title":"IPL 2023 Qualifier 1, GT vs CSK preview: Tactician Dhoni faces Gill test","link":"https://telanganatoday.com/ipl-2023-qualifier-1-gt-vs-csk-preview-tactician-dhoni-faces-gill-test","keywords":["News","Sport","Chennai Super Kings","Gujarat Titans","IPL 2023"],"creator":["PTI"],"video_url":null,"description":"Mahendra Singh Dhoni will dig deep into his reserves to counter Indian cricket's new 'Crown Prince' Shubman Gill","content":"Home | Sport | Ipl 2023 Qualifier 1 Gt Vs Csk Preview Tactician Dhoni Faces Gill Test IPL 2023 Qualifier 1, GT vs CSK preview: Tactician Dhoni faces Gill test Mahendra Singh Dhoni will dig deep into his reserves to counter Indian cricket's new 'Crown Prince' Shubman Gill By PTI Published Date - 07:40 AM, Tue - 23 May 23 PTI Photo Chennai: The astute tactician in Mahendra Singh Dhoni will dig deep into his reserves to counter Indian cricket’s new ‘Crown Prince’ Shubman Gill as four-time champions Chennai Super Kings will meet their match in current title holders Gujarat Titans in Qualifier-1 of the IPL here on Tuesday. Gill, who almost single-handedly knocked out a star-studded Royal Challengers Bangalore with a century for the keeps, has overshadowed Virat Kohli and will certainly force one of India’s greatest captains to go back to drawing board and make plans for him. Gill is in the midst of a dream season and what will be Dhoni’s tactical ploy to stop the dashing ‘Mohali Marauder’ is there to be seen. This season, Gujarat Titans haven’t played at the Chepauk, which hasn’t behaved in a singular manner during CSK’s seven home games and that prompted head coach Stephen Fleming to raise apprehensions about what to expect. What makes this battle even more interesting is the fact that GT is a team that seems closest to being a proto-type of what CSK had been all these years in IPL. A solid management and an administration team that stay in the background and never interferes in cricketing matters, which is left to the trio of Ashish Nehra, Gary Kirsten and Vikram Solanki. A captain, who swears that his understanding of leadership is cut from Dhoni’s ‘captaincy cloth’, and head coach Nehra, who just like his former teammate doesn’t believe in too many changes even if a couple of games go wrong. They don’t field players based on their auction worth – remember CSK bought Krishnappa Gowtham for nearly Rs 10 crore and he got a single game as he didn’t fit the combination. Similarly, GT has current India T20 pacer Shivam Mavi on its roster for a whopping Rs 6 crore but the team management has preferred veteran Mohit Sharma, who is executing the slower deliveries beautifully. It’s all about who fits what role. So, it becomes more interesting when two teams with similar philosophy are pitted against each other. The teams which don’t make long-term promises that are difficult to fulfil but focus on immediate process and know the roles of players required for slots. For Gujarat, tackling the slowness of the Chepauk track will be a challenge and how well they negotiate Deepak Chahar’s powerplay overs and Matheesha Pathirana’s slingers at the back-end, will determine the outcome of the match. And herein, Pandya and Nehra will find Sri Lanka skipper Dasun Shanaka’s inputs handy as he has handled both Pathirana and spinner Maheesh Theekshana for the national team. While Shanaka might be used more as an all-rounder, Titans depending on the toss can also try out left-arm spinner R Sai Kishore, who knows these conditions well. There is a chance that Irishman Joshua Little will be back in playing XI in place of Shanaka and Sai Kishore comes in place of Yash Dayal, who is yet to get back his confidence after the five sixes assault on him by his Statemate Rinku Singh. For CSK , a good start by the crack pair of Devon Conway and Ruturaj Gaikwad will be important. But at the Chepauk, even Ajinkya Rahane could become a factor while Shivam Dube would love to add to his 33 sixes for the season. Conway and Gaikwad have provided brisk and substantial starts for CSK, the middle-order hasn’t exactly got going. With GT bowling led by Mohammed Shami and Rashid Khan (24 wickets each so far), things won’t be easy for the home team’s batters, Conway and Gaikwad included. How the CSK opening duo handles the relentless Shami may prove vital and it would be important for the under-performing middle-order to step up in a crunch game. The pitches at Chepauk so far have been a bit up and down, with a few being slow in nature while some have been good to bat on. CSK head coach Fleming said as much after the win over Delhi Capitals, claiming that the team is unsure about the conditions (at home). If a sluggish pitch is rolled out for the match, the spinners in the two teams would have a huge part to play. If CSK has Ravindra Jadeja, Moeen Ali and Theekshana, the Titans boast of a line-up that includes Rashid and Noor Ahmad. Also Read IPL 2023: RCB’s campaign ends after six-wicket loss to GT, MI through IPL 2023: Ben Stokes leaves CSK to prepare for England’s upcoming home summer Follow Us : Tags Chennai Super Kings Gujarat Titans IPL 2023 Related News IPL 2023: Virat Kohli’s niggle in knee not a cause for concern, says RCB Head Coach IPL 2023: RCB’s campaign ends after six-wicket loss to GT, MI through IPL 2023: Ben Stokes leaves CSK to prepare for England’s upcoming home summer IPL 2023: RCB vs GT Live updates IPL 2023: Green century, Rohit’s fifty guide MI to eight-wicket win over SRH IPL: SRH vs MI Live updates","pubDate":"2023-05-23 02:10:04","image_url":null,"source_id":"telanganatoday","category":["sports"],"country":["india"],"language":"english"},{"title":"Islamabad Club Reds lift Islamabad Club Cricket League title","link":"https://www.nation.com.pk/23-May-2023/islamabad-club-reds-lift-islamabad-club-cricket-league-title","keywords":["Sports"],"creator":["STAFF REPORT"],"video_url":null,"description":"LAHORE - Islamabad Club Reds lifted the title of Islamabad Club Cricket League by thrashing Islamabad Club Blues by 10 wickets at Oval Cricket Ground, Islamabad.","content":"LAHORE - Islamabad Club Reds lifted the title of Islamabad Club Cricket League by thrashing Islamabad Club Blues by 10 wickets at Oval Cricket Ground, Islamabad. Majid Khan, former captain of Pakistan cricket team, was the chief guest of the final while former PCB COO Shafaqat Naghmi, Islamabad Club Cricket Committee senior member Zubair Nasir, Test cricketer Yasir Hameed and others dignities were also present there. In the final, Islamabad Club Blues scored 175-6 in 20 overs, thanks to Ashas Gill’s 89 and Raza Akram’s 25 runs, while Ahmed Taj dismissed 3 for 36. In reply, Islamabad Reds chased the target in 13th over with unbeatable opening partnership between Umer Kiyani and Salman Chaudhry of 176 runs. Umer Kayani smashed unbeatable century with 10 massive sixes and 6 fours in just 40 balls while Salman Chaudhry hammered unbeaten 72. Umar Kayani was named player of the match and tournament.","pubDate":"2023-05-22 22:21:19","image_url":null,"source_id":"nation_pk","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"Kohli feels back to his best","link":"https://www.herald.co.zw/kohli-feels-back-to-his-best/","keywords":["Sport"],"creator":["The Herald"],"video_url":null,"description":"MUMBAI. — India star Virat Kohli has issued a warning ahead of next year’s ICC Men’s T20 World Cup by declaring he is at the top of his game and feels like he is playing his best T20 cricket.","content":"India star Virat Kohli has issued a warning ahead of next year’s ICC Men’s T20 World Cup by declaring he is at the top of his game and feels like he is playing his best T20 cricket. Kohli finished as the leading run scorer at the most recent edition of the T20 World Cup in Australia when he amassed an eye-catching 296 runs for his country at a Bradmanesque average of 98.66 and a strike rate greater than 136, but was expected to face greater competition from India’s bevy of young batters in the lead-up to next year’s event in the Caribbean and USA. But the 34-year-old is showing no signs of slowing down based on his recent efforts in the Indian Premier League and has given every indication he wants to continue playing 20-over cricket for his country. The champion right-hander has scored 639 runs from 14 matches while opening the batting for Royal Challengers Bangalore, with his most recent contribution an unbeaten 101 from just 61 balls as his side fell out of the playoffs race to Gujarat Titans. “It’s more important than cricket practice.” What does Virat Kohli think about fitness? Find out. It was Kohli’s second century on the trot for his IPL franchise and the veteran said he is back playing his best when asked by former India coach Ravi Shastri at the completion of his innings. “Ya, I felt great. A lot of people feel my T20 cricket is declining, but I don’t feel like that at all,” Kohli said. “I feel I am playing my best T20 cricket again. I’m just enjoying myself, this is how I play T20 cricket. I look to hit gaps, hit a lot of boundaries and the big ones in the end if the situation allows me to. “Strike rates, all those kind of things like I said in the past as well . . . you have to read the situation and rise up to the occasion when the situation demands, and that’s some-thing I take a lot of pride in doing, and I’ve been doing it for a while now. I feel really good with my game at the moment and how I’m batting out there in the middle.” Kohli hasn’t been the only experienced campaigner performing well at the top of the order for Royal Challengers Bangalore this season, with South Africa batter Faf du Plessis also in good touch having scored 730 runs to be the leading run scorer for the tournament thus far. Kohli and du Plessis combined for a total of 939 runs across 14 innings — equalling the previous record from IPL 2016 set by Kohli and AB de Villiers’ of most runs by a pair in a T20 tournament — as Royal Challengers Bangalore narrowly missed out on a spot in the playoffs. Karthik backs du Plessis to make international comeback at World Cup. Du Plessis was full of praise for Kohli and believes his fellow opener still has plenty to offer in the shortest format of the game. “He (Kohli) has played really good cricket throughout the season,” du Plessis said. “It just shows you Virat has got a lot left in the tank in T20 cricket as he is playing really well still.” ZIMBABWE’S Warriors will be waiting anxiously for the quick resolution of ZIFA’s suspension from global football after the Confederation of African Football announced that the draw for the 2026 World Cup will be held in two months. THE Premier Soccer League are set to determine the way forward following a week of boardroom bickering which resulted in the chaos and abandonment of the league match between Sheasham and CAPS United scheduled for Mandava on Sunday. MADRID. — Soccer governing body FIFA’s president Gianni Infantino expressed his support for Real Madrid forward Vinicius Jr after he called LaLiga and Spain “racist” after receiving racial slurs from fans in Sunday’s game at Valencia’s Mestalla Stadium.","pubDate":"2023-05-22 22:01:20","image_url":null,"source_id":"herald_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"NPL expand to 14 teams, playoff fixtures announced","link":"https://www.herald.co.zw/npl-expand-to-14-teams-playoff-fixtures-announced/","keywords":["Sport"],"creator":["The Herald"],"video_url":null,"description":"The 2023/24 edition of the National Premier League (NPL) will be a grand affair featuring 14 teams following a decision by Zimbabwe Cricket to add four more participants in order to open up the top-flight club cricket competition to men’s teams from all the 10 provinces in the country.","content":"The 2023/24 edition of the National Premier League (NPL) will be a grand affair featuring 14 teams following a decision by Zimbabwe Cricket to add four more participants in order to open up the top-flight club cricket competition to men’s teams from all the 10 provinces in the country. The new qualification pathway will see nine teams qualify directly on sporting merit through their top provincial club championships, while the other five spots will be filled up through playoffs. Harare Metropolitan will have four teams securing their places directly in the NPL, followed by Bulawayo Metropolitan with two guaranteed berths. Manicaland, Masvingo and Midlands will each have one spot through direct qualification. The best teams from Mashonaland Central, Mashonaland East, Mashonaland West, Matabeleland North and Matabeleland South will have to go through NPL playoffs against clubs from the top provinces. In the first playoff match played at Kadoma Sports Club on Sunday, Kadoma Sports Club beat Kwekwe Sports Club by 220 runs to book their place in the main tournament. Four other playoff matches are scheduled to take place on 27 and 28 May at venues across the country. ZIMBABWE’S Warriors will be waiting anxiously for the quick resolution of ZIFA’s suspension from global football after the Confederation of African Football announced that the draw for the 2026 World Cup will be held in two months. THE Premier Soccer League are set to determine the way forward following a week of boardroom bickering which resulted in the chaos and abandonment of the league match between Sheasham and CAPS United scheduled for Mandava on Sunday. MADRID. — Soccer governing body FIFA’s president Gianni Infantino expressed his support for Real Madrid forward Vinicius Jr after he called LaLiga and Spain “racist” after receiving racial slurs from fans in Sunday’s game at Valencia’s Mestalla Stadium.","pubDate":"2023-05-22 22:01:10","image_url":null,"source_id":"herald_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"Morgan Topping leads the way as Northern Knights cruise to second win in Inter-pro Cup","link":"https://www.belfasttelegraph.co.uk/sport/cricket/morgan-topping-leads-the-way-as-northern-knights-cruise-to-second-win-in-inter-pro-cup/420842342.html","keywords":null,"creator":null,"video_url":null,"description":"Morgan Topping may have fallen eight runs short of a deserved century but he ensured Northern Knights made it two wins out of two in this year’s Inter-Provincial Cup, with victory over champions Munster Reds at Stormont.","content":"Topping, the 24-year old Waringstown batter, playing only his fourth List A match, showed off all his burgeoning talent to dominate the Knights’ ultimately comfortable chase and while the three wickets margin may look tight, they had 17 balls to spare and three wickets fell within 30 runs of their 270 target. Cade Carmichael, in superb form for Instonians scored his first List A 50, sharing a partnership of 87 with Topping who then added 92 with Neil Rock, fresh from his astonishing 142 off 53 balls in the National Cup on Saturday. The diminutive left hander did not have to score as quickly this time, although his 39 still came off 29 balls with seven fours and with Topping scoring at a run-a-ball, the Knights were always in control of the chase. The only worries came early when Ross Adair was caught at second slip for a duck and Ruhan Pretorius holed out to mid-on for just eight, leaving the hosts on 19 for two. James McCollum, in his last game before joining up with the Ireland squad, looked good for his 38 balls but then found Gareth Delany at deep square but that only let this Knights team show off their depth in batting. The bowling depth was highlighted in their team selection with Matthew Foster, despite taking three wickets in Dublin last week, left out on his home ground. They still had skipper Mark Adair to share the new ball with Pretorius but neither made a breakthrough as Murray Commins and Ali Frost put on 106 for the first wicket. It was Tyron Koen who ended the stand in the 25th over but Commins went on and on, bringing up his second century on the ground from 111 balls with 13 fours and a six. However, he failed to match his previous best of 125, caught at long-on off Theo van Woerkom who, like Tom Mayes before him, then took two wickets in two balls. The inter-provincial action continues today at Bready when North West Warriors host Leinster Lightning with Cian Robertson, the Instonians slow left armer, expected to make his Warriors debut, after playing one match for the Knights last season. (M Commins 114, A Frost 37, M Ford 33 not out, C Campher 26; T Mayes 3-34, T van Woerkom 3-58, T Koen 1-61) (47.1 overs, M Topping 92, C Carmichael 62, N Rock 39, J McCollum 30, M Adair 20; L McCarthy 4-67, M Granger 2-30). Knights won by three wickets.","pubDate":"2023-05-22 20:13:37","image_url":"https://s3.eu-west-1.amazonaws.com/prod-mh-ireland/a6df8035-4002-4c6b-af33-69c76f5d71c0/a2c24506-b382-4a95-a523-eaf461401918/v%20Munster%20Reds%2021.jpg","source_id":"belfasttelegraph","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"HCA league matches to commence from June 6","link":"https://telanganatoday.com/hca-league-matches-to-commence-from-june-6","keywords":["Hyderabad","News","Sport","Hyderabad Cricket Association"],"creator":["Telangana Today"],"video_url":null,"description":"The much-awaited Hyderabad Cricket Association league matches will commence from June 6, the officials informed","content":"Home | Sport | Hca League Matches To Commence From June 6 HCA league matches to commence from June 6 The much-awaited Hyderabad Cricket Association league matches will commence from June 6, the officials informed By Telangana Today Published Date - 11:45 PM, Mon - 22 May 23 Hyderabad: The much-awaited Hyderabad Cricket Association league matches will commence from June 6, the officials informed on Monday. The new format will have teams divided into A,B,C groups instead of A1, A2 and A3. A division will have 21 teams. The teams that were included in this division in 2018-19 and 2019-20 seasons were dropped. However, the Combined XI team of the districts was retained in the same group to provide a platform for the cricketers from districts. Budding Stars Cricket Club, which stood first in A2 division in the seasons 2017-18, 2018-19 and 2019-2020 and first in A1 division in 2021-22 was also retained. The bottom two teams in A division after the end of the season will be demoted to B division while top two teams from B division will be promoted to A division, the release from HCA said. Meanwhile, the teams in A Division will be split into two pools. After the league matches, Zonals will be played for finalizing the team that will represent Hyderabad in Ranji and U-23 tournaments. In the B Division, the 62 teams will be split into five pools. The top 2 from each pool will play against top 2 from the other pools to decide the ranking and the top 2 will be promoted to A Division while bottom two from each pool will play against each other and the last two teams will be relegated to C Division. The C Division, with 105 teams, will be divided into 6 pools. Top team from each pool will play against each other to decide the ranking. Top two teams from the group will be promoted to B Division. Meanwhile, the players’ registration will commence from May 24 and end on June 3. Each club/institution can register 18 players. No transfer of players nor last-minute registrations are allowed. Also Read Hyderabad cricketer Sumanth announces retirement ‘Hyderabad Cricket Association elections will be held as early as possible’ Follow Us : Tags Hyderabad Hyderabad Cricket Association Related News This home museum in Hyderabad gives 1950s’ traditional vibe Easy outing for top seeds at Asian U-14 Tennis Tournament Telangana: Elected representatives thank CM KCR for repeal of GO 111 CM KCR pays tributes to activist Bhagya Reddy Varma Hyderabad: Rohith, Nanditha emerge champions at Roller Skating Championship Hyderabad: Several restrictions on SCB roads still in place despite MoD orders","pubDate":"2023-05-22 18:15:38","image_url":null,"source_id":"telanganatoday","category":["sports"],"country":["india"],"language":"english"},{"title":"Gill-Shankar Deny RCB Wicket For 12 Overs","link":"https://thenorthlines.com/gill-shankar-deny-rcb-wicket-for-12-overs/","keywords":["Cricket","Sports"],"creator":["Northlines"],"video_url":null,"description":"NL Corresspondent   Playing only their second IPL season, Gujarat Titans seem to have cracked the code. They dominated the league stage in their debut season last year to emerge top of the standings with 10 wins from 14 games before they went on to win the title. And this year again, Gujarat are the […] The post Gill-Shankar Deny RCB Wicket For 12 Overs appeared first on Northlines.","content":"NL Corresspondent Playing only their second IPL season, Gujarat Titans seem to have cracked the code. They dominated the league stage in their debut season last year to emerge top of the standings with 10 wins from 14 games before they went on to win the title. And this year again, Gujarat are the title favourites going into the Play-Offs after they repeated their league performance from last year with 10 victories from 14 games. Their superb showing in IPL 2023 has been courtesy some excellent peformances from the likes of Shubman Gill, Rashid Khan and Mohammed Shami among others. Shubman Gill continues to enchance his reputation as the best young batter in world cricket . His second successive IPL century saw Gujarat outclass RCB by six wickets to continue their amazing record in run chases, winning 14 out of 17 matches when batting second. Mohammed Shami showed why he is the most consistent Indian bowler across formats with 24 wickets in 14 games, the same as his team-mate Rashid Khan — the best spinner in the world in T20 cricket. Having already qualified for the Play-Offs, Gujarat could have easily switched off and rested a their key players for their last league match against RCB. But the defending champions were aware that a defeat could disrupt their momentum ahead of the Play-Offs and hence went in with a full-strength team against RCB. After RCB raced to 62 for no loss in the Powerplay, Gujarat fought back with three wickets in the space of 14 balls. It was the Afghanistan spin duo who pegged back RCB in the middle overs. While left-arm wrist spinner Noor Ahmad accounted for Faf du Plessis (28) and Mahipal Lomror (1), Rashid dismissed the dangerous Glenn Maxwell for 11. In a match where all the Gujarat bowlers went for nine runs and above, Rashid stood out with his control as he picked up 1/24 in four overs. Shami also made a crucial impact as he got Michael Bracewell, who had smashed his way to 26 from 16 balls, in the 14th over to halt RCB's momentum. Yash Dayal got Dinesh Karthik caught behind off a bouncer as the veteran perishedfor his fourth duck in IPL 2023. RCB looked in danger of finishing around 180 before Virat Kohli and Anuj Rawat (23 from 15 balls) went on the attack at the end, hitting 42 from the last three overs. Gujarat went into the break on a high as they kept RCB under 200 on a flat wicket with short boundaries. Gujarat's run chase didn't get off to a bright start as Wriddhiman Saha struggled with his timing before he was dismissed by Mohammed Siraj for 12. The visitors were struggling on 35/1 in five overs and RCB fans were already dancing in the stands before Gill and Vijay Shankar turned the match on its head with their big partnership. The duo hit a couple of fours and a six off wAYNE Parnell in the sixth over to get the GT innings kickstarted after the slow start. The all-rounder played a superb ramp shot, steering the slower bouncer from Vijaykumar Vyshak over the wicket-keeper for a four and hit the next back over the bowler for another boundary.","pubDate":"2023-05-22 17:55:56","image_url":null,"source_id":"thenorthlines","category":["sports"],"country":["india"],"language":"english"},{"title":"Fear of Unknown: CSK meets ‘CSK Lite’ as Dhoni faces ‘Gill Test’","link":"https://thenorthlines.com/fear-of-unknown-csk-meets-csk-lite-as-dhoni-faces-gill-test/","keywords":["Cricket","Sports"],"creator":["Northlines"],"video_url":null,"description":"Agencies   The astute tactician in Mahendra Singh Dhoni will dig deep into his reserves to counter Indian cricket's new ‘Crown Prince' Shubman Gill as four-time champions Chennai Super Kings will meet their match in current title holders Gujarat Titans in Qualifier-1 of the IPL in Chennai on Tuesday. Gill, who almost single-handedly knocked out […] The post Fear of Unknown: CSK meets ‘CSK Lite’ as Dhoni faces ‘Gill Test’ appeared first on Northlines.","content":"Agencies The astute tactician in Mahendra Singh Dhoni will dig deep into his reserves to counter Indian cricket 's new ‘Crown Prince' Shubman Gill as four-time champions Chennai Super Kings will meet their match in current title holders Gujarat Titans in Qualifier-1 of the IPL in Chennai on Tuesday. Gill, who almost single-handedly knocked out a star-studded Royal Challengers Bangalore with a century for the keeps, has overshadowed Virat Kohli and will certainly force one of India 's greatest captains to go back to drawing board and make plans for him. Gill is in the midst of a dream season and what will be Dhoni's tactical ploy to stop the dashing ‘Mohali Marauder' is there to be seen. This season, Gujarat Titans haven't played at the Chepauk, which hasn't behaved in a singular manner during CSK's seven home games and that prompted head coach Stephen Fleming to raise apprehensions about what to expect. What makes this battle even more interesting is the fact that GT is a team that seems closest to being a proto-type of what CSK had been all these years in IPL. A solid management and an administration team that stays in the background and never interferes in cricketing matters, which is left to the trio of Ashish Nehra, Gary Kirsten and Vikram Solanki. A captain, who swears that his understanding of leadership is cut from Dhoni's ‘captaincy cloth', and head coach Nehra, who just like his former teammate doesn't believe in too many changes even if a couple of games go wrong. They don't field players based on their auction worth — remember CSK bought Krishnappa Gowtham for nearly Rs 10 crore and he got a single game as he didn't fit the combination. Similarly, GT has current India T20 pacer Shivam Mavi on its roster for a whopping Rs 6 crore but the team management has preferred veteran Mohit Sharma, who is executing the slower deliveries beautifully. It's all about who fits what role. So, it becomes more interesting when two teams with similar philosophy are pitted against each other. The teams which don't make long-term promises that are difficult to fulfil but focus on immediate process and know the roles of players required for slots. For Gujarat, tackling the slowness of the Chepauk track will be a challenge and how well they negotiate Deepak Chahar's powerplay overs and Matheesha Pathirana's slingers at the back-end, will determine the outcome of the match. And herein, Pandya and Nehra will find Sri Lanka skipper Dasun Shanaka's inputs handy as he has handled both Pathirana and spinner Maheesh Theekshana for the national team. While Shanaka might be used more as an all-rounder, Titans depending on the toss can also try out left-arm spinner R Sai Kishore, who knows these conditions well. There is a chance that Irishman Joshua Little will be back in playing XI in place of Shanaka and Sai Kishore comes in place of Yash Dayal, who is yet to get back his confidence after the five sixes assault on him by his statemate Rinku Singh. For CSK, a good start by the crack pair of Devon Conway and Ruturaj Gaikwad will be important. But at the Chepauk, even Ajinkya Rahane could become a factor while Shivam Dube would love to add to his 33 sixes for the season. Conway and Gaikwad have provided brisk and substantial starts for CSK, the middle-order hasn't exactly got going. With GT bowling led by Mohammed Shami and Rashid Khan (24 wickets each so far) things won't be easy for the home team's batters, Conway and Gaikwad included. How the CSK opening duo handles the relentless Shami may prove vital and it would be important for the under-performing middle-order to step up in a crunch game. The pitches at Chepauk so far have been a bit up and down, with a few being slow in nature while some have been good to bat on. CSK head coach Fleming said as much after the win over Delhi Capitals, claiming that the team is unsure about the conditions (at home). If a sluggish pitch is rolled out for the match, the spinners in the two teams would have a huge part to play. If CSK has Ravindra Jadeja, Moeen Ali and Theekshana, the Titans boast of a line-up that includes Rashid and Noor Ahmad. Teams (from): Chennai Super Kings: MS Dhoni (c/wk), Akash Singh, Moeen Ali, Bhagath Varma, Deepak Chahar, Devon Conway, Tushar Deshpande, Shivam Dube, Ruturaj Gaikwad, Rajvardhan Hangargekar, Ravindra Jadeja, Sisanda Magala, Ajay Mandal, Matheesha Pathirana, Dwaine Pretorius, Ajinkya Rahane, Shaik Rasheed, Ambati Rayudu, Mitchell Santner, Subhranshu Senapati, Simarjeet Singh, Nishant Sindhu, Prashant Solanki, Maheesh Theekshana. Gujarat Titans: Hardik Pandya (c), Shubman Gill, David Miller, Abhinav Manohar, Sai Sudharsan, Wriddhiman Saha, Matthew Wade, Rashid Khan, Rahul Tewatia, Vijay Shankar, Mohammed Shami, Alzarri Joseph, Yash Dayal, Pradeep Sangwan, Darshan Nalkande, Jayant Yadav, R. Sai Kishore, Noor Ahmad, Dasun Shanaka, Odean Smith, KS Bharat, Shivam Mavi, Urvil Patel, Joshua Little and Mohit Sharma. Match starts at 7.30 PM.","pubDate":"2023-05-22 17:55:08","image_url":null,"source_id":"thenorthlines","category":["sports"],"country":["india"],"language":"english"},{"title":"\"I Love How He...\": Australia Great Dissects Gill's Phenomenal Batting","link":"https://sports.ndtv.com/cricket/i-love-how-he-australia-great-dissects-shubman-gills-phenomenal-batting-in-ipl-2023-4057437","keywords":null,"creator":null,"video_url":null,"description":"Shubman Gill is currently the second highest run-getter in the IPL 2023","content":"Virat Kohli pulled off a string of records en-route his second successive century of the IPL 2023 against Gujarat Titans at the Chinnaswamy Stadium on Sunday night, but Royal Challengers Bangalore (RCB) failed to make it to the play-offs of the tournament as Titans opener Shubman Gill helped his side pull off a brilliant six-wicket win with five balls to spare, leaving the home supporters stunned. Gill not only matched Kohli shot for shot, he ended up with a better strike rate that was crucial to his team's near-perfect chase. He was ably supported by Vijay Shankar , who came in as an impact player and hammered 53 off 35 balls. His innings was laced with seven boundaries and a couple of sixes. RCB's loss meant that Mumbai Indians (MI), who had earlier in the day beaten Sunrisers Hyderabad at the Wankhede Stadium in Mumbai, moved into the plays-offs by virtue of finishing fourth on the table with 16 points. RCB, on the other hand, ended up finishing sixth in the tournament on 14 points behind Rajasthan Royals. The Titans, who topped the table with 20 points will now play Chennai Super Kings in Qualifier 1 on Tuesday while MI will lock horns with Lucknow Super Giants in the Eliminator a day later. Former Australia pacer Brett Lee was all praise for Gill, saying on JioCinema: \"He hit eight sixes. I love how he goes on the leg side. He finds power. That he can do and access because he's got strong wrists and he's got beautiful timing.\" Gill and Shankar put on a century stand and Lee said: \"123 off 71 balls, that was the partnership that broke the back of the RCB bowlers. Yes, it was a wet ball, conditions didn't really favour the bowlers but you got to give credit where credit is due. They both batted beautifully.\" Speaking about Kohli's ton, former India Test captain Anil Kumble said on JioCinema: \"You could see that passion and hunger. Today was an important innings for RCB, no other batsman was going well today. Faf du Plessis is a very good player but after he got out quick the pressure was on Virat Kohli. But with that pressure and responsibility he scored a great century.\"","pubDate":"2023-05-22 17:20:12","image_url":null,"source_id":"ndtv","category":["sports"],"country":["india"],"language":"english"},{"title":"Gill ton trumps Kohli’s 101 as Bangalore knocked out of IPL","link":"https://www.kuwaittimes.com/gill-ton-trumps-kohlis-101-as-bangalore-knocked-out-of-ipl/","keywords":["Cricket","Sports","Gill","ipl","kohli"],"creator":["Rajesh"],"video_url":null,"description":"BENGALURU: Shubman Gill hit an unbeaten 104 to trump Virat Kohli’s record century as holders Gujarat Titans knocked Royal Challengers Bangalore out of the IPL with a six-wicket victory on Sunday. The result allowed five-time winners Mumbai Indians to fill the fourth and final play-off spot after they hammered Sunrisers Hyderabad by eight wickets in … The post Gill ton trumps Kohli’s 101 as Bangalore knocked out of IPL appeared first on Kuwait Times.","content":"BENGALURU: Shubman Gill hit an unbeaten 104 to trump Virat Kohli’s record century as holders Gujarat Titans knocked Royal Challengers Bangalore out of the IPL with a six-wicket victory on Sunday. The result allowed five-time winners Mumbai Indians to fill the fourth and final play-off spot after they hammered Sunrisers Hyderabad by eight wickets in the first match of the day. Gill starred in the final group match with a 52-ball knock that steered Gujarat to victory with five balls to spare. Gill hit the winning six to raise his second straight ton. His hundred was the event’s third of the day after Cameron Green’s match-winning 100 for Mumbai and then Kohli’s 101 not out. “As a bowler, Gill doesn’t give you a chance,” Gujarat skipper Hardik Pandya said of his star batsman, who put on a key 123-run stand with Vijay Shankar, who made 53. “Other batters also get confidence from it.” Kohli hit his second successive hundred and seventh in the IPL to overtake Chris Gayle’s six and steer Bangalore to 197-5 in a match that started an hour late due to rain in Bengaluru. The effort was in vain as Kohli’s wait for an elusive IPL title goes on for another year. “A lot of people think that my T20 cricket is declining, I don’t feel like that at all. I think I am playing my best T20 cricket again,” said Kohli after an innings which featured 13 fours and a six. “I’m just enjoying myself. This is how I play T20 cricket.”   ‘Unbelievable Virat’ Mumbai will play Lucknow Super Giants, who became the third team to make the play-offs on Saturday, in the eliminator next week. Table-toppers Gujarat and second-placed Chennai Super Kings will clash in the first qualifier on Tuesday. The winner of Qualifier 1 will head straight to the final in Ahmedabad on May 28 and the loser will play the winner of the eliminator. Kohli started strongly in a 67-run opening partnership with skipper Faf du Plessis, who made 28 to stay on top of the batting chart with 730 runs. Kohli, who made a match-winning 100 in Bangalore’s previous game, had moved behind Du Plessis in the batting list with 639 runs but Gill toppled the senior star to take second spot with 674 runs. “Virat played an unbelievable knock to give us a chance and thought that was a good score,” said Du Plessis. “But Shubman played incredibly well to take the game away from us.” In the first match, Green starred for Mumbai with his first ever T20 century as he hit a 47-ball unbeaten 100 to drive his team home with two overs to spare. Green, a big buy for Mumbai for $2.11 million in the auction, stood out with eight fours and eight sixes. After Rohit Sharma’s departure, Green kept up the charge and put on an unbeaten partnership with Suryakumar Yadav, who hit 25, to register their eighth win in 14 group matches. Medium-pace bowler Akash Madhwal set up victory with figures of 4-37 to check Hyderabad to 200-5, a total that looked to go bigger but for some disciplined bowling. Hyderabad, led by Aiden Markram, took the wooden spoon in the 10-team table. — AFP The post Gill ton trumps Kohli’s 101 as Bangalore knocked out of IPL appeared first on Kuwait Times.","pubDate":"2023-05-22 16:31:19","image_url":null,"source_id":"kuwaittimes","category":["sports"],"country":["kuwait"],"language":"arabic"}]}