{"newsArray":[{"title":"Robinson warned by match referee for Khawaja abuse","link":"https://www.brisbanetimes.com.au/sport/cricket/robinson-warned-by-match-referee-for-khawaja-send-off-20230621-p5digk.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Malcolm Conn"],"video_url":null,"description":"Match referee Andy Pycroft opted against any official action following the England quick’s departing missive, while both sides were heavily penalised for slow over rates.","content":"England fast bowler Ollie Robinson has escaped with a warning following his send-off of Usman Khawaja during the first Test at Edgbaston, which Australia won in dramatic fashion on Tuesday. Match referee Andy Pycroft took no official action against Robinson and the International Cricket Council said it did not comment on referee’s decisions when questioned by this masthead. However, sources close to the match officials, who spoke on the condition of anonymity, claimed that it was considered a “borderline case”. “It was felt to be an exaggerated celebration rather than a send-off,” the source claimed. Robinson’s celebration, after bowling Khawaja for 141 on Saturday, included him saying “f--- off, you f------ p---k”. While referee Pycroft took no official action against Robinson, he fined recalled spinner Moeen Ali 25 per cent of his match free for spraying a healing agent on his damaged spinning finger, and fined every player 40 per cent of their match frees when England and Australia were found to be behind their over rates. Ollie Robinson exchanges words with Usman Khawaja on the final day of the first Test. Credit: Getty Following the Test Khawaja, who was named player of the match, claimed he did not hear Robinson. Nor did Khawaja want to discuss the exchange between him and Robinson during a drinks break on the final day. “The other day, the crowd was so loud I had no idea,” Khawaja said. “Today (Tuesday) there was nothing much in it. Just a bit of friendly banter. This game was played in pretty good spirits for most of it. “It’s not just about winning, it’s about how we win, which has changed a lot from past years I played cricket. I think the game was played in pretty good spirits. Khawaja was named player of the match on the back of his first Test century on English soil. Credit: Getty “There wasn’t much in it. There’s no point in me talking about it.” While the England players gathered in a huddle for drinks on the last afternoon, Robinson walked over to Khawaja and his batting partner Travis Head. Stump mics picked up Robinson suggesting that Khawaja was too defensive, saying “a freebie, isn’t it? A half-volley with the field up”. Khawaja replied to the bowler: “There’s rough there. Not hitting that. That’s why you’re not a batsman”. Robinson added that it was “nice to see you say something back” and Khawaja suggested Robinson should “be careful”, an apparent reference to his earlier send-off. Jimmy Anderson, once England’s chief sledger, walked over, grabbed Robinson, and guided him back to the team huddle. Umpire Marais Erasmus then walked into the England huddle during drinks and spoke to Robinson. When the huddle broke up Robinson wandered over to Khawaja, spoke to him in conciliatory fashion, and patted the Australian on the back. Khawaja later declined to say whether Robinson had apologised. The International Cricket Council’s code of conduct, section 2.5, prohibits any kind of “send-off” including “verbally abusing the dismissed batter”. It is a level one offence that can attract a fine of up to 50 per cent of a player’s match fee if the player is charged and pleads or is found guilty. England’s player match fees are £15,000 ($28,000). Robinson justified his actions after play on Sunday by claiming that former Australian captain Ricky Ponting and other Australians had abused England players in the past. “When you’re in the heat of the moment and have the passion of the Ashes, that can happen,” Robinson said. “We’ve all seen Ricky Ponting and other Aussies do the same to us. Just because the shoe’s on the other foot, it’s not received well. “It’s my first home Ashes and to get the big wicket at the time was special for me. Uzzie played unbelievably well and to get that wicket for us at the time as a team was massive. We all want that theatre of the game, don’t we, and I’m here to provide it.” Loading Ponting, who is in England commentating, was annoyed with Robinson for implicating him in the sledging furore. “A lot of this stuff happens in the heat of battle,” Ponting told Sky Sports. “The only thing I’d say with Ollie is Khawaja was 140, Robinson hadn’t looked like getting a wicket all day, and he’s just sledged probably the nicest man that’s ever walked on the planet.” Watch every ball of the 2023 Ashes series live and exclusive on Channel 9 and 9Now. Sports news, results and expert commentary. Sign up for our Sport newsletter . Save Log in , register or subscribe to save articles for later. License this article The Ashes Test cricket Australian cricket England Malcolm Conn is Chief Cricket Writer. Connect via Twitter or email . Most Viewed in Sport Loading","pubDate":"2023-06-21 21:45:40","image_url":null,"source_id":"brisbanetimes","category":["sports"],"country":["australia"],"language":"english"},{"title":"IPC Minister urges India to end politicisation and play cricket in Pakistan","link":"https://www.nation.com.pk/22-Jun-2023/ipc-minister-urges-india-to-end-politicisation-and-play-cricket-in-pakistan","keywords":["Sports"],"creator":["OUR STAFF REPORT"],"video_url":null,"description":"LAHORE-Federal Minister for Inter Provincial Coordination (IPC) Ehsan Ur Rehman Mazari has said that India is politicizing cricket by not allowing its team to visit Pakistan, adding it should end politicisation and play cricket in Pakistan.","content":"LAHORE-Federal Minister for Inter Provincial Coordination (IPC) Ehsan Ur Rehman Mazari has said that India is politicizing cricket by not allowing its team to visit Pakistan, adding it should end politicisation and play cricket in Pakistan. “India should leave its stubbornness and play cricket in Pakistan. Personally, I believe that if India does not come to Pakistan, then Pakistan should also not visit them. If India chose to play at the neutral venue, then Pakistan should also do the same. India always plays politics on cricket. If Indian teams from other disciplines can visit Pakistan, then why not its cricket team,” said Mazari while talking to media along with Zaka Ashraf at a cake-cutting ceremony on the birthday anniversary of Shaheed Benazir Bhutto at his office on Wednesday. The IPC Minister said that the PCB Management Committee’s term had ended on the night of June 19, and the decisions taken by it after that had no status. Prime Minister office on Tuesday in a notification said that the Prime Minister had nominated Zaka Ashraf and Supreme Court Advocate Mustafa Ramday as the PCB’s Board of Governors (BoG). According to the IPC Minister, the leadership of Pakistan People’s Party wanted to see Zaka Ashraf as the PCB chairman. “I had sent the summary to the Prime Minister’s House [for Zaka and Ramday’s appointment]. I am thankful to Prime Minister Shehbaz Sharif for approving that,” he said. “Now Zaka Ashraf is all set to take over the reins of Pakistan Cricket Board’s stewardship before Eid-ul-Azha as the government does not want to delay his (Zaka) appointment,” Mazari said and added that the PCB Election Commissioner would be looking after the affairs of the board till the election of the new PCB chairman. “Every effort will be made to hold the elections before Eid. It is clear that Zaka Ashraf will be the new chairman of the board, following its elections,” he asserted. Speaking on the occasion, Zaka Ashraf said: “I am deeply grateful to Prime Minister Shehbaz Sharif, Co-Chairman of PPP Asif Ali Zardari and IPC Minister Ehsan ur Rehman Mazari for reposing trusting in me.” He said the Asia Cup and the World Cup were approaching and his focus would be to prepare the national outfit for those events. In response to a question, Zaka Ashraf said that he was against the hybrid model from day one. “If the Asian Cricket Council (ACC) had given rights to the PCB to hold the Asia Cup, then the entire event should have taken place in Pakistan,” he added.","pubDate":"2023-06-21 19:45:29","image_url":"https://www.nation.com.pk/print_images/large/2023-06-22/ipc-minister-urges-india-to-end-politicisation-and-play-cricket-in-pakistan-1687376724-4600.jpg","source_id":"nation_pk","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"Shamyl Hussain hits double ton in PCB Regional Intra-District event","link":"https://www.nation.com.pk/22-Jun-2023/shamyl-hussain-hits-double-ton-in-pcb-regional-intra-district-event","keywords":["Sports"],"creator":["OUR STAFF REPORT"],"video_url":null,"description":"LAHORE-Pakistan U19 national player, Shamyl Hussain, smashed a dazzling double hundred in Pakistan Cricket Board’s (PCB) ongoing Regional Intra-District U-19 at the Karachi Company Cricket Ground.","content":"LAHORE-Pakistan U19 national player, Shamyl Hussain, smashed a dazzling double hundred in Pakistan Cricket Board’s (PCB) ongoing Regional Intra-District U-19 at the Karachi Company Cricket Ground. Ranked as national number one U19 T-20 batsman, Shamyl hit 22 scintillating fours and nine towering sixes to achieve the exceptional feat of 206 runs in 135 balls with a strike rate of 170. Boosted by this breathtaking stroke-play, his team, North Zone, that he also captains, amassed 420 runs under a sizzling sun that sent the mercury into 41 plus degrees. For much of the innings, the real opponent was scorching heat that tested stamina, patience and skill. Shamyl came good on all three counts as bowlers toiled away before a chanceless and ruthless hitting that practically ripped the leather apart. The opponents, Gilgit Baltistan, offered some resistance but lost the momentum and closed the 50 over match at 291 for 7. Shamyl also bagged two wickets in his 9 overs. No stranger to big innings and centuries, the left-handed batsman’s previous highest was 161 scored two years ago in PCB tournament. In this match, he bettered his own record and made one of the fastest double-centuries in this format. Shamyl got his national cap earlier this year in the overseas series against Bangladesh and won the T20 trophy for Pakistan with his 67 runs innings that got him the man of the match shield. His batting masterclass was well supported by his opening partner Behroz Khan who made 89. Gilgit Baltistan’s Tabrar Wali, 80 not out, was the highest run-getter and provided some relief to his team in what was a long hard day for them.","pubDate":"2023-06-21 19:44:49","image_url":"https://www.nation.com.pk/print_images/large/2023-06-22/shamyl-hussain-hits-double-ton-in-pcb-regional-intra-district-event-1687376685-1997.jpg","source_id":"nation_pk","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"Cricket fraternity lauds India A team for Women’s Emerging Teams Cup victory","link":"https://thenewsmill.com/2023/06/cricket-fraternity-lauds-india-a-team-for-womens-emerging-teams-cup-victory/","keywords":["Cricket","Sports","ANI"],"creator":["ANI"],"video_url":null,"description":"The News Mill","content":"India A women’s team clinched the Asian Cricket Council (ACC) Women’s Emerging Teams Cup defeating Bangladesh A in a low-scoring final in Mong Kok on Wednesday. India’s cricket fraternity lauded the performance and congratulated the team for its victory in the tournament held in Hong Kong. BCCI Secretary Jay Shah praised the Indian team, which won the match by 31 runs. “What a sensational victory! Congratulations to India ‘A’ women’s cricket team for winning the ACC #WomensEmergingTeamsAsiaCup! Each team showed great spirit and fought fiercely till the end. Bright days ahead for women’s cricket in Asia! @ACCMedia1 #ACC,” Jay Shah tweeted. India’s star batter Smriti Mandhana, former women’s cricket captain Mithali Raj and former bowler Jhulan Goswami also lauded the young women’s performance. Another impeccable victory for India as India A took on Bangladesh A at the #WomensEmergingTeamsAsiaCup2023 & clinched the title A proud moment for the nation — Jhulan Goswami (@JhulanG10) June 21, 2023 India A women elected to bat first in the final. They posted 127/7 in their 20 overs on the board. Huge congratulations to the Indian team on lifting the Women’s Emerging Teams Asia Cup trophy! Keep soaring high! #WomensEmergingTeamsAsiaCup pic.twitter.com/QsFzSbj4cu — Smriti Mandhana (@mandhana_smriti) June 21, 2023 Chasing 128, the Indian bowlers kept Bangladesh under pressure from ball one. Shreyanka (4/13 in four overs) was the star for Team India with the ball. Mannat Kashyap also ended with 3/20 in four overs. Kanika took 2/23 in four overs and won the ‘Player of the Match’ for her all-round show while Titas Sandhu took one wicket. Congratulations to these future Indian superstars on their victory in the #WomensEmergingTeamsAsiaCup final! Defending a fighting total, the bowlers were in top form right from the word go, denying the opponents any chance to make a comeback. This triumph marks the beginning of… pic.twitter.com/p9DnVIlYvy — Mithali Raj (@M_Raj03) June 21, 2023 Shreyanka was given the ‘Player of the Tournament’ award and was the highest wicket-taker in the tournament. (ANI)","pubDate":"2023-06-21 19:34:09","image_url":null,"source_id":"thenewsmill","category":["sports"],"country":["india"],"language":"english"},{"title":"‘Hope they’re taking us lightly’: Healy’s Ashes warning as young gun primed to open in Test debut","link":"https://www.brisbanetimes.com.au/sport/cricket/hope-they-re-taking-us-lightly-healy-s-ashes-warning-as-young-gun-primed-to-open-in-test-debut-20230620-p5di4i.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Daniel Brettig"],"video_url":null,"description":"Australia’s Ashes captain Alyssa Healy has warned England not to underestimate them, with 20-year-old Phoebe Litchfield set to open alongside Beth Mooney at Trent Bridge on Thursday.","content":"Nottingham: Australia’s Ashes captain Alyssa Healy has warned England not to underestimate an evolving side, as Phoebe Litchfield is primed for a Test debut at the top of the batting order. The 20-year-old Litchfield is set to open alongside Beth Mooney, while Healy, who has enjoyed watching Litchfield develop for NSW and Australia, slots into the middle order in recognition of her captaincy and wicketkeeping duties. Phoebe Litchfield is poised for her debut at the top of the Australian order. Credit: Getty Images Healy saved her most pointed words for England, following comments by young fast bowler Issy Wong that this may be a good time to face Australia, following the retirement of Rachael Haynes and in the enforced absence of Meg Lanning . The previous Ashes Test between the two sides finished in a memorable draw at Canberra’s Manuka Oval. The new series will start with the sole Test at Trent Bridge, offering plenty of possibilities for a result pitch. “I read the quote, and then I actually read the whole piece instead of just what she said, and it was actually a glowing endorsement for our group, but people chose to take those couple of sentences which was funny,” Healy said. Loading “I don’t think we can hide from the fact we’ve come into this Ashes series and there is no Meg Lanning, no Rachael Haynes. We’ve lost a lot of experience but I’m completely comfortable with the troops we’ve got sitting in the change room, that what they’re going to bring to this series is just as good as what we’ve ever done. “I’m hoping they’re potentially taking us a little bit lightly because I think you do that at your own detriment. The group we’ve got in the change room are incredibly good at their job, and hopefully we can show them just that.” The team’s evolution is typified not just by Litchfield, but also the emergence of Tahlia McGrath as a top-quality all-rounder and as vice-captain. Annabel Sutherland’s batting continues to grow, while Georgia Wareham and Alana King offer contrasting but dangerous wrist spin options in addition to the longstanding threats of Megan Schutt and Jess Jonassen. “We’ve made a real conscious effort when we have had opportunities to blood some young players or give them some experience or opportunity that we’ve made that decision,” Healy said. “I think that’s put us in good stead for the next 10 years, that there’s players waiting in the wings who are ready to go, they’ve tasted playing for Australia and they’ve wanted to do it again. “It’s really crucial to be looking at the future and working out some sort of succession plan and that’s been going on behind the scenes. If I look at the England team, they’ve had a really big turnover all at once, which makes them quite dangerous at the same time, because there’s a lot of unknown about their group.” Litchfield is the team’s precocious young talent, much as the likes of Healy and Ellyse Perry once were in a side stocked with older heads such as the team’s now coach Shelley Nitschke. Healy noted that Litchfield’s knowledge set her up nicely to cope with the technical and mental rigours of a Test match. “For someone so young she knows a lot about her own batting and her own technique,” Healy said. “That’s really cool and really important for someone coming into the international game, that they know a lot about their game and what they can and can’t do. I think she’s right across that, and most importantly she absolutely loves batting. Alyssa Healy and Mitchell Starc. Credit: Getty “So from our point of view, the longer she stays out there the better, because that’s exactly where she wants to be. I think she’s done a bit of top-order batting throughout her career and has the technique to do that. “On the flipside she’s got the gears that she can go up and down and through throughout the ebbs and flows of a Test match and also a one-day game. She’s got that ability to find the boundary when she needs, but also to knuckle down and tough out some gritty little periods.” As for husband Mitchell Starc’s selection status after he missed the first men’s Test at Edgbaston , Healy smiled as she chose her words carefully: “All I’ll say is there’s a lovely slope at Lord’s for a left-armer ...” Watch every ball of the 2023 Ashes series live and exclusive on Nine and 9Now. News, results and expert analysis from the weekend of sport sent every Monday. Sign up for our Sport newsletter . Save Log in , register or subscribe to save articles for later. License this article Australian cricket Cricket Australia England The Ashes Daniel Brettig is The Age's chief cricket writer and the author of several books on cricket. Connect via Twitter . Most Viewed in Sport Loading","pubDate":"2023-06-21 19:00:00","image_url":null,"source_id":"brisbanetimes","category":["sports"],"country":["australia"],"language":"english"},{"title":"Treated like adults, Australia’s cricketers now play like them","link":"https://www.brisbanetimes.com.au/sport/cricket/treated-like-adults-australia-s-cricketers-now-play-like-them-20230621-p5die4.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Daniel Brettig"],"video_url":null,"description":"Since Pat Cummins and Andrew McDonald were placed together as captain and coach last year, they have built an atmosphere of empowerment and adult decisions among their players.","content":"Birmingham: A little over an hour before play began on the final day, as ground staff worked frantically to dry off the few remaining wet spots in the outfield, Pat Cummins walked over to the indoor nets at Edgbaston. He spent nearly the whole of that last hour batting, honing a method that he had also spent plenty of his own time working on in the preceding few months between tours of India and England. Pat Cummins’ Edgbaston batting was the fruit of months of extra work. Credit: Getty Cummins did not do this because he was instructed to by any of the coaching staff, but because he knew the extra work was needed, as there was the distinct possibility that in England he would have to bat as high as No.8 in the order. The thrilling conclusion to Australia’s victory in the opening Ashes Test was vindication for that work, and also for an environment in which a seasoned group of players have been granted the room to make such choices for themselves. Since Cummins and Andrew McDonald were placed together as captain and coach of the Australian men’s side in February last year, they have concentrated on building an atmosphere of empowerment and adult decisions among their players. Often, this has been couched in joking terms by Usman Khawaja and others, as optional warm-ups and training sessions are a world away from some of the more stentorian moments of past teams, whether coached by Mickey Arthur, Darren Lehmann or Justin Langer. Loading But for a group largely composed of well-travelled players, it has extracted that little bit extra to allow for performances like Edgbaston, those at the back end of the India tour or the attritional triumph in Pakistan last year. “It’s hard to quantify it, but I think everything around what’s been done with the team, with Pat and Andrew McDonald in terms of just cutting out the fluff,” Khawaja said. “Cutting out the box-ticking stuff. Just really stripping down the game to its bare nakedness and saying what’s important. What do we think is important? How are we going to do it? “People joke about it all the time and I joked about it when we played the Ahmedabad game, but even warm-ups every morning, they’re optional now, do whatever you need to do to warm up. [I] think that kind of stuff empowers players. It’s empowered us. We take onus on ourselves. Who wants to train today? OK, you don’t want to train, fine. “I think it’s the first time for a long time that we’re actually really getting treated like adults and think that’s made a big difference.” Usman Khawaja “At the end of the day you are responsible for your own performance because that in itself impacts the team. If you are letting the team down in any way, that’s on you. But we’re all professionals and adults here and I think it’s the first time for a long time that we’re actually really getting treated like adults and think that’s made a big difference.” For Khawaja, that meant the freedom to play the Edgbaston conditions and scenario as he saw fit. “I just wanted to take it deep,” he said. “‘Little Uzzie’ inside of me was saying ‘you can expand now, you can get into second or third gear now’ but I was like ‘no, no, take it deep, take it as far deep as you can.’ “Because I knew if we could get into that last hour and had less than 100 runs we could get it, but if we lost too many wickets early that was game over for us. So I actually wanted to go a lot harder than I did in the last hour-and-a-half I was in, I wanted to start playing more shots. But I kept fighting with myself, it was just about building partnerships.” The player-driven elements of the team include strategy meetings where senior players have as much say as coaches, and selection discussions that blur the old distinctions between selectors and players. This was all part of the vision that Cummins brought to the captaincy in late 2021, following a fractious period in which the more prescriptive methods of Langer and also the former team manager Gavin Dovey rankled many. As he said shortly before taking on the job, Cummins believes that players will perform at their best if trusted to use the methods they have already honed, rather than being made to feel as though Test and international cricket requires a complete rethink. “I love the guys who I play alongside; it isn’t just a hobby or even a job,” Cummins said in 2021 . “We spend more time with this group than we do with our partners at home. So I don’t like problems festering. I don’t want to spend 70 per cent of my life on tour in an environment I’m not totally comfortable with. Self-driven: Australian batsman Usman Khawaja. Credit: Getty Images “If we’ve got a young guy who’s come into the side, I don’t think senior players or coaches changing his technique and telling him exactly how to bowl or bat are going to have as much of a positive impact as if he feels welcome, and he’s encouraged to do all the things that got him there. “If we can relieve a little bit of that pressure everyone feels playing professional sport in front of millions of people, that’s where the biggest value is to be had.” Another manifestation of the environment Cummins and McDonald have fostered is the calmer, less caustic air to the way Australia play their cricket. While this was partly forced by the ramifications of the Newlands scandal in 2018, Cummins genuinely believes it is the best way for this group of players to succeed. The sight of Khawaja being goaded by Ollie Robinson was certainly a role reversal from many past Ashes series. Ollie Robinson and Usman Khawaja during the tense final day. Credit: Getty “It’s not just about winning,” Khawaja said. “It’s about how we win, which has changed a lot from past years I played cricket.” That change in tone was discernible even in the way the team sang their victory song, Under The Southern Cross , on the Edgbaston balcony about four hours after Cummins had struck the winning runs. For some years, it had been a hyper-aggressive, yelled exhortation; now it still sounded raucous, but more joyous, and a little less desperate. Calm, composed and the winners of a close Ashes classic; this is indeed a different team, and a happier one, too. Save Log in , register or subscribe to save articles for later. License this article Australian cricket Cricket Australia England The Ashes Daniel Brettig is The Age's chief cricket writer and the author of several books on cricket. Connect via Twitter . Most Viewed in Sport Loading","pubDate":"2023-06-21 19:00:00","image_url":null,"source_id":"brisbanetimes","category":["sports"],"country":["australia"],"language":"english"},{"title":"'Every Day is a Rainbow Day for Me’ - Sir Donald Bradman","link":"https://www.dailymirror.lk/cricket/-Every-Day-is-a-Rainbow-Day-for-Me’---Sir-Donald-Bradman/315-261549","keywords":null,"creator":null,"video_url":null,"description":"Witnessing the Sri Lanka-Australia at the Adelaide Cricket Grounds the writer had the fortune to visit the world famous ’Don Bradman Museum’ located at the ground floor of the beautiful Adelaide Oval which was at the Northern end of the city.","content":"Witnessing the Sri Lanka-Australia at the Adelaide Cricket Grounds the writer had the fortune to visit the world famous 'Don Bradman Museum' located at the ground floor of the beautiful Adelaide Oval which was at the Northern end of the city. As the city of Adelaide has grown and evolved, so too has the Adelaide Oval. An indispensable part of the Adelaide's sporting and social fabric since 1870s, the oval had taken on even more importance as a centerpiece of the state's identity - a world class stadium that will be an existing home for national and international events for decades to come. The name of Donald Bradman occupies a special place in the hearts of every Australian, young and old is respected as the greatest batsman in the history of world cricket. Born in 1908 at New South Wales he began playing cricket at the age of two years. Moving on to Sydney when 18 years old, was selected to play for New South Wales state side at 19 years and made Australian debut at the age of 20 years. Representing Australia from 1928 to 1948 he ended his career with a second ball duck to give him an amazing average of 99.94 runs per an inning. If he had made four runs more the Don would have averaged 100. In 1980 after correspondence with the then Australian Prime Minister, Sir Don donated a substantial number of personal items to the state with the Library as the custodian which now known as the 'Bradman Collection'. For many years the collection was displayed at the Mortlock Library and the State Library's Institute building on North Terrace. It was transferred to the Adelaide Oval in 2008. At the entrance to the museum a big portrait of Sir Donald Bradman is displayed with a saying of his - 'I was never coached, I was never told by anyone how to hold a bat' was engraved at the right hand side of it. The personal lounge of this great cricketer with his wedding photograph, the radio set which he listened to cricket commentaries and the record player with the sofa chair is placed in the first cubicle followed by the bath tub used by Sir Donald, pictures of his young days, as cricketer meeting state heads, international cricketers and personalities hung on the walls. Every item of his cricket kit, materials used, the green baggy Australian cap, the national blazer was preserved for public viewing. On a large screen incidents related to the world famous bodyline series was shown along with a century scored by Bradman which was attracted by visitors. Don Bradman was not only a great cricketer. He was an author of several books including his autobiography and several books related to his cricketing life. Some of these books were exhibited at the museum. He had composed the then famous song \"Every Day is a Rainbow Day for Me\". The writer had the privilege of visiting every nook and corner of the Adelaide Oval including the press box, players enclosures, 3rd umpire's and match referees enclosure, the scoreboard, team conference halls, the Bradman Stand, practice wicket areas, the main playing area and all five floors of the stands accompanied by a guide. A marvelous experience for any cricket enthusiast! (Lakshman Ranasinghe in Australia)","pubDate":"2023-06-21 18:50:00","image_url":"https://bmkltsly13vb.compat.objectstorage.ap-singapore-1.oraclecloud.com/cdn.sg.dailymirror.lk/assets/uploads/image_0efcb586a2.jpg","source_id":"dailymirror","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"“I thought we could have had more intent in our batting…”: WI coach Daren Sammy ahead of WC qualifier match against Nepal","link":"https://thenewsmill.com/2023/06/i-thought-we-could-have-had-more-intent-in-our-batting-wi-coach-daren-sammy-ahead-of-wc-qualifier-match-against-nepal/","keywords":["Cricket","Sports","ANI"],"creator":["ANI"],"video_url":null,"description":"The News Mill","content":"Ahead of his side’s ICC Cricket World Cup 2023 qualifier against Nepal, West Indies head coach Daren Sammy urged his batters to score runs with more intent, despite the threats posed by new ball in the early-morning settings in Zimbabwe. West Indies, the two-time champions will take on Nepal in their Group A WC qualifier match on Thursday. WI is in the second place with one win in two matches, with two points. Nepal is in the third spot with a win and loss in two games, with a total of two points. In the powerplay, WI could manage only 41 runs in their first match against the USA and they lost their openers, Brandon King and Kyle Mayers. “We do not have a say in how the toss goes, but whenever we bat, that new ball poses a challenge. You have got to make sure that the opposition does not get too much ahead when that new ball comes. I thought we could have had more intent because that is one of the things we are talking about as a batting group – intent to score. And when I say intent to score, it is not looking for boundaries but looking for scoring opportunities and when you do that, you could score off good balls and get rotation of strike going,” said Sammy as quoted by ESPNCricinfo saying to CWI Media. “Again, it is a work in progress and we have to bowl well and keep creating opportunities. We dropped a couple of catches and that could affect us in the bigger scheme of things. But I am quite happy with the way we are going; the last six games that we have played we have taken steps in trying to play the brand of cricket we want to move forward with it. Again, it is sticking to our guns, sticking to the plans that we have, and believing and committing to the execution,” he added. Despite King and Mayers not scoring well and Shamarh Brooks being unavailable due to illness, Windies got their hold in the match back due to their middle order. Skipper Shai Hope who has slid down to number four since taking over the captaincy, Brooks’ replacement Johnson Charles, Roston Chase and Jason Holder posted half-centuries. WI posted 297 on the board and USA fell 39 runs short of the target despite a century from Gajanand Singh. Sammy expressed his happiness with progress of the line-up. Under Hope and Sammy, the two-time champions adopted an aggressive approach and had a deep batting line-up till number 11, with all-rounder Akeal Hosein being placed there. This depth helped the top and middle-order to go for their shots. “I listened to the captain after the post-match. He said ideally you may want one of them to score a big hundred, but he was happier that performances came from different batsmen in the group. You look at Brandon King, who has been playing well, did not get a score, Kyle Mayers did not get a score, so it is good signs for us that even though we were under pressure we came back strongly and ideally you would want one of those to convert it into a hundred and we, as a team, celebrate the milestones after,” said Sammy. “But yeah the guys have prepared well and they are hitting lots of balls and they understand the direction the team wants to go in as a batting group. It is early doors, but the fact that mindset is getting towards what we want to do as a team I believe that you will see improvement in days to come,” he added. Nepal, the Windies’ next opponent had a streak of improbable wins that took them to the WC qualifier. In the first match of the tournament, they defeated UAE by six wickets. Nepal head coach Monty Desai was previously WI’s batting coach under Phil Simmons. Sammy said that WI is not taking any opposition lightly in this highly-competitive event, with only two World Cup spots up for grabs. “Yeah, I guess [in] the first match against the USA, we got the ‘W’ that we wanted, which was the win. Great start to the tournament, but we have so much left in the tank. The guys came out and you could see they were not happy with the way they played, which is a good sign for us. We keep challenging ourselves and yeah in the end we have a few things we have to continue. But it is a work in progress – trying to find the identity of our cricket moving forward,” he said. “But, yeah, I was pleased with the victory. You come [up] against Nepal, a team who is on the rise and they have been playing some good cricket, so again we respect all our oppositions, but we focus on the things that we want to do as a team and focus on the brand of cricket we want to play. And it all boils down to our preparation, which we have been doing well and then on game day the execution. I have full confidence and belief in the boys – or men rather – that they will go out and do themselves and the region proud,” he concluded. (ANI)","pubDate":"2023-06-21 18:34:23","image_url":null,"source_id":"thenewsmill","category":["sports"],"country":["india"],"language":"english"},{"title":"CWC Qualifiers: Need to carry on with this confidence against Sri Lanka, Scotland, says Oman skipper Zeeshan after win over UAE","link":"https://thenewsmill.com/2023/06/cwc-qualifiers-need-to-carry-on-with-this-confidence-against-sri-lanka-scotland-says-oman-skipper-zeeshan-after-win-over-uae/","keywords":["Cricket","Sports","ANI"],"creator":["ANI"],"video_url":null,"description":"The News Mill","content":"After a five-wicket win over UAE in their ICC Cricket World Cup 2023 qualifier match, Oman captain Zeeshan Maqsood lauded his team for their performances and added that they need to carry with the confidence received from wins in their matches against Sri Lanka and Scotland. Three half-centuries from Aqib Ilyas, Shoaib Khan and Mohammad Nadeem helped Oman clinch their second successive victory in their ICC Cricket World Cup 2023 qualifier match against UAE by five wickets in Bulawayo on Wednesday. “The way the boys are playing, we are happy. They are putting so much in all departments, our preparation has been great, players are taking responsibility and that has been the key. The way Aqib and Shoaib batted was key. Later on Ayaan and Nadeem played well. When Shoaib came off and I played a bad shot, there was pressure. But on that track, if you get set bowlers cannot get you out. We have games against Sri Lanka and Scotland, we need to play well and carry that confidence forward,” said Zeeshan in a post-match presentation. Coming to the match, UAE posted 227/8 in their 50 overs after being put to bat first by Oman. Aayan Khan hit a brilliant half-century, scoring 58* in 52 balls. Also, Vriitya Aravind (49 in 84 balls) and Rameez Shahzad (38 in 51 balls) put on an 87-run stand for the third wicket after UAE was reduced to 16/2. Jay Odedra (3/31) was the pick of the bowlers for Oman. In the chase of 228, Oman was restricted to 14/2. But later, half-centuries from Aqib Ilyas (53), Shoaib Khan (52*) and Mohammad Nadeem (50*) helped Oman chase down the target with four overs and five wickets in hand. Junaid Siddique (2/31) was the standout bowler for UAE. Shoaib was given the ‘Man of the Match’ award for his fifty. Oman is at the top of the Group B point table with two wins in two matches and a total of four points. On the other hand, UAE is at the bottom with two losses in two games, with zero points. (ANI)","pubDate":"2023-06-21 18:34:10","image_url":null,"source_id":"thenewsmill","category":["sports"],"country":["india"],"language":"english"},{"title":"पीसीबी चीफ बनने से पहले ही जका अशरफ ने दिखाई अकड़, एशिया कप पर फिर लटकी तलवार","link":"https://navbharattimes.indiatimes.com/sports/cricket/cricket-news/possible-pcb-chairman-zaka-ashraf-rejects-hybrid-model-of-asia-cup/articleshow/101171543.cms","keywords":null,"creator":null,"video_url":null,"description":"एशिया कप 2023 की मेजबानी पर मथा पच्ची कम नहीं हुई है। नजम सेठी के बाद पीसीबी के संभावित अगले अध्यक्ष जका अशरफ ने हाइब्रिड मॉडल को ठुकरा दिया। जका अशरफ के इस फैसले से एक बार फिर एशिया कप को लेकर पेंच फंस गया है।","content":"पाकिस्तान क्रिकेट बोर्ड के संभावित अगले अध्यक्ष जका अशरफ ने पाकिस्तान और श्रीलंका में सितंबर को होने वाले आगामी एशिया कप के लिए नजम सेठी के ‘हाइब्रिड मॉडल’ को ठुकरा दिया है। अशरफ ने इस्लामाबाद में बुधवार को एक प्रेस कांफ्रेंस में कहा, 'पहली बात तो यह है कि मैं पहले भी एशिया कप के हाइब्रिड मॉडल को खारिज कर चुका हूं क्योंकि मैं इससे सहमत नहीं हूं। एशियाई क्रिकेट परिषद के बोर्ड ने फैसला किया था कि यह टूर्नामेंट पाकिस्तान में होगा तो यहीं होना चाहिए।' अशरफ के इस बयान के बाद भारत में इस साल के आखिर में होने वाले वनडे विश्व कप में पाकिस्तान की भागीदारी भी खटाई में पड़ गई है। समझा जाता है कि पाकिस्तान के सहमति जताने के बाद पीछे हटने से बीसीसीआई भी कड़ा रूख अपना सकता है। एसीसी के कार्यकारी बोर्ड ने हाइब्रिड मॉडल को मंजूरी दी है। अशरफ अगर अपना रूख नहीं बदलते हैं तो एशिया कप पाकिस्तान के बिना ही खेला जा सकता है। एसीसी बोर्ड के एक सदस्य ने कहा, 'एशिया कप मॉडल को एसीसी ने स्वीकार किया है और इसमें कोई बदलाव नहीं होगा। अशरफ जो चाहे, वह कहने के लिये स्वतंत्र हैं।' पाकिस्तान के प्रधानमंत्री शाहबाज शरीफ के करीबी अशरफ का पीसीबी अध्यक्ष बनना तय है चूंकि प्रधानमंत्री ही बोर्ड का मुख्य संरक्षक भी है और नियुक्तियां उनकी मर्जी से ही होती है। हाइब्रिड मॉडल को बीसीसीआई सचिव जय शाह की अध्यक्षता वाली एसीसी ने स्वीकार किया था।भारत ने साफ तौर पर कहा था कि वह पाकिस्तान खेलने नहीं जायेगा। सेठी के अध्यक्ष पद से हटते ही 48 घंटे में हालात बदल गए। सेठी ने कहा था कि वह आसिफ जरदारी और शाहबाज शरीफ के बीच मतभेद का कारण नहीं बनना चाहते और इसी वजह से अध्यक्ष पद की दौड़ से हट रहे हैं। अशरफ ने प्रेस कांफ्रेंस में कहा कि वह नहीं चाहते कि बेमानी मैच पाकिस्तान में कराये जाएं। उन्होंने कहा, 'सभी मुख्य मैच पाकिस्तान से बाहर होंगे । नेपाल और भूटान जैसी टीमें पाकिस्तान में खेलेंगे जो गलत है। मुझे नहीं पता कि बोर्ड ने पहले किस पर मंजूरी दी। मैं देखता हूं कि इतने कम समय में क्या हो सकता है। हम वही करेंगे जो पाकिस्तान के लिये बेहतर हो।’ उन्होंने यह भी कहा कि विश्व कप का मसला अभी हल नहीं हुआ है जिसके मायने हैं कि कार्यक्रम जारी करने में अभी और विलंब होगा। उन्होंने कहा, 'पाकिस्तान के सामने चुनौतियां है। कई लंबित मसले हैं। एशिया कप है और फिर विश्व कप है । मैं किसी के खिलाफ नहीं बोलना चाहता क्योंकि अभी मैने पद नहीं संभाला है। पद संभालने के बाद देखते हैं कि क्या हालात है।","pubDate":"2023-06-21 18:18:57","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Robinson warned by match referee for Khawaja abuse","link":"https://www.brisbanetimes.com.au/sport/cricket/robinson-warned-by-match-referee-for-khawaja-send-off-20230621-p5digk.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Malcolm Conn"],"video_url":null,"description":"Match referee Andy Pycroft opted against any official action following the England quick’s departing missive, while both sides were heavily penalised for slow over rates.","content":"England fast bowler Ollie Robinson has escaped with a warning following his send-off of Usman Khawaja during the first Test at Edgbaston, which Australia won in dramatic fashion on Tuesday. Match referee Andy Pycroft took no official action against Robinson and the International Cricket Council said it did not comment on referee’s decisions when questioned by this masthead. However, sources close to the match officials, who spoke on the condition of anonymity, claimed that it was considered a “borderline case”. “It was felt to be an exaggerated celebration rather than a send-off,” the source claimed. Robinson’s celebration, after bowling Khawaja for 141 on Saturday, included him saying “f--- off, you f------ p---k”. While referee Pycroft took no official action against Robinson, he fined recalled spinner Moeen Ali 25 per cent of his match free for spraying a healing agent on his damaged spinning finger, and fined every player 40 per cent of their match frees when England and Australia were found to be behind their over rates. Ollie Robinson exchanges words with Usman Khawaja on the final day of the first Test. Credit: Getty Following the Test Khawaja, who was named player of the match, claimed he did not hear Robinson. Nor did Khawaja want to discuss the exchange between him and Robinson during a drinks break on the final day. “The other day, the crowd was so loud I had no idea,” Khawaja said. “Today (Tuesday) there was nothing much in it. Just a bit of friendly banter. This game was played in pretty good spirits for most of it. “It’s not just about winning, it’s about how we win, which has changed a lot from past years I played cricket. I think the game was played in pretty good spirits. Khawaja was named player of the match on the back of his first Test century on English soil. Credit: Getty “There wasn’t much in it. There’s no point in me talking about it.” While the England players gathered in a huddle for drinks on the last afternoon, Robinson walked over to Khawaja and his batting partner Travis Head. Stump mics picked up Robinson suggesting that Khawaja was too defensive, saying “a freebie, isn’t it? A half-volley with the field up”. Khawaja replied to the bowler: “There’s rough there. Not hitting that. That’s why you’re not a batsman”. Robinson added that it was “nice to see you say something back” and Khawaja suggested Robinson should “be careful”, an apparent reference to his earlier send-off. Jimmy Anderson, once England’s chief sledger, walked over, grabbed Robinson, and guided him back to the team huddle. Umpire Marais Erasmus then walked into the England huddle during drinks and spoke to Robinson. When the huddle broke up Robinson wandered over to Khawaja, spoke to him in conciliatory fashion, and patted the Australian on the back. Khawaja later declined to say whether Robinson had apologised. The International Cricket Council’s code of conduct, section 2.5, prohibits any kind of “send-off” including “verbally abusing the dismissed batter”. It is a level one offence that can attract a fine of up to 50 per cent of a player’s match fee if the player is charged and pleads or is found guilty. England’s player match fees are £15,000 ($28,000). Robinson justified his actions after play on Sunday by claiming that former Australian captain Ricky Ponting and other Australians had abused England players in the past. “When you’re in the heat of the moment and have the passion of the Ashes, that can happen,” Robinson said. “We’ve all seen Ricky Ponting and other Aussies do the same to us. Just because the shoe’s on the other foot, it’s not received well. “It’s my first home Ashes and to get the big wicket at the time was special for me. Uzzie played unbelievably well and to get that wicket for us at the time as a team was massive. We all want that theatre of the game, don’t we, and I’m here to provide it.” Loading Ponting, who is in England commentating, was annoyed with Robinson for implicating him in the sledging furore. “A lot of this stuff happens in the heat of battle,” Ponting told Sky Sports. “The only thing I’d say with Ollie is Khawaja was 140, Robinson hadn’t looked like getting a wicket all day, and he’s just sledged probably the nicest man that’s ever walked on the planet.” Watch every ball of the 2023 Ashes series live and exclusive on Channel 9 and 9Now. Sports news, results and expert commentary. Sign up for our Sport newsletter . Save Log in , register or subscribe to save articles for later. License this article The Ashes Test cricket Australian cricket England Malcolm Conn is Chief Cricket Writer. Connect via Twitter or email . Most Viewed in Sport Loading","pubDate":"2023-06-21 21:45:40","image_url":null,"source_id":"brisbanetimes","category":["sports"],"country":["australia"],"language":"english"},{"title":"IPC Minister urges India to end politicisation and play cricket in Pakistan","link":"https://www.nation.com.pk/22-Jun-2023/ipc-minister-urges-india-to-end-politicisation-and-play-cricket-in-pakistan","keywords":["Sports"],"creator":["OUR STAFF REPORT"],"video_url":null,"description":"LAHORE-Federal Minister for Inter Provincial Coordination (IPC) Ehsan Ur Rehman Mazari has said that India is politicizing cricket by not allowing its team to visit Pakistan, adding it should end politicisation and play cricket in Pakistan.","content":"LAHORE-Federal Minister for Inter Provincial Coordination (IPC) Ehsan Ur Rehman Mazari has said that India is politicizing cricket by not allowing its team to visit Pakistan, adding it should end politicisation and play cricket in Pakistan. “India should leave its stubbornness and play cricket in Pakistan. Personally, I believe that if India does not come to Pakistan, then Pakistan should also not visit them. If India chose to play at the neutral venue, then Pakistan should also do the same. India always plays politics on cricket. If Indian teams from other disciplines can visit Pakistan, then why not its cricket team,” said Mazari while talking to media along with Zaka Ashraf at a cake-cutting ceremony on the birthday anniversary of Shaheed Benazir Bhutto at his office on Wednesday. The IPC Minister said that the PCB Management Committee’s term had ended on the night of June 19, and the decisions taken by it after that had no status. Prime Minister office on Tuesday in a notification said that the Prime Minister had nominated Zaka Ashraf and Supreme Court Advocate Mustafa Ramday as the PCB’s Board of Governors (BoG). According to the IPC Minister, the leadership of Pakistan People’s Party wanted to see Zaka Ashraf as the PCB chairman. “I had sent the summary to the Prime Minister’s House [for Zaka and Ramday’s appointment]. I am thankful to Prime Minister Shehbaz Sharif for approving that,” he said. “Now Zaka Ashraf is all set to take over the reins of Pakistan Cricket Board’s stewardship before Eid-ul-Azha as the government does not want to delay his (Zaka) appointment,” Mazari said and added that the PCB Election Commissioner would be looking after the affairs of the board till the election of the new PCB chairman. “Every effort will be made to hold the elections before Eid. It is clear that Zaka Ashraf will be the new chairman of the board, following its elections,” he asserted. Speaking on the occasion, Zaka Ashraf said: “I am deeply grateful to Prime Minister Shehbaz Sharif, Co-Chairman of PPP Asif Ali Zardari and IPC Minister Ehsan ur Rehman Mazari for reposing trusting in me.” He said the Asia Cup and the World Cup were approaching and his focus would be to prepare the national outfit for those events. In response to a question, Zaka Ashraf said that he was against the hybrid model from day one. “If the Asian Cricket Council (ACC) had given rights to the PCB to hold the Asia Cup, then the entire event should have taken place in Pakistan,” he added.","pubDate":"2023-06-21 19:45:29","image_url":"https://www.nation.com.pk/print_images/large/2023-06-22/ipc-minister-urges-india-to-end-politicisation-and-play-cricket-in-pakistan-1687376724-4600.jpg","source_id":"nation_pk","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"Shamyl Hussain hits double ton in PCB Regional Intra-District event","link":"https://www.nation.com.pk/22-Jun-2023/shamyl-hussain-hits-double-ton-in-pcb-regional-intra-district-event","keywords":["Sports"],"creator":["OUR STAFF REPORT"],"video_url":null,"description":"LAHORE-Pakistan U19 national player, Shamyl Hussain, smashed a dazzling double hundred in Pakistan Cricket Board’s (PCB) ongoing Regional Intra-District U-19 at the Karachi Company Cricket Ground.","content":"LAHORE-Pakistan U19 national player, Shamyl Hussain, smashed a dazzling double hundred in Pakistan Cricket Board’s (PCB) ongoing Regional Intra-District U-19 at the Karachi Company Cricket Ground. Ranked as national number one U19 T-20 batsman, Shamyl hit 22 scintillating fours and nine towering sixes to achieve the exceptional feat of 206 runs in 135 balls with a strike rate of 170. Boosted by this breathtaking stroke-play, his team, North Zone, that he also captains, amassed 420 runs under a sizzling sun that sent the mercury into 41 plus degrees. For much of the innings, the real opponent was scorching heat that tested stamina, patience and skill. Shamyl came good on all three counts as bowlers toiled away before a chanceless and ruthless hitting that practically ripped the leather apart. The opponents, Gilgit Baltistan, offered some resistance but lost the momentum and closed the 50 over match at 291 for 7. Shamyl also bagged two wickets in his 9 overs. No stranger to big innings and centuries, the left-handed batsman’s previous highest was 161 scored two years ago in PCB tournament. In this match, he bettered his own record and made one of the fastest double-centuries in this format. Shamyl got his national cap earlier this year in the overseas series against Bangladesh and won the T20 trophy for Pakistan with his 67 runs innings that got him the man of the match shield. His batting masterclass was well supported by his opening partner Behroz Khan who made 89. Gilgit Baltistan’s Tabrar Wali, 80 not out, was the highest run-getter and provided some relief to his team in what was a long hard day for them.","pubDate":"2023-06-21 19:44:49","image_url":"https://www.nation.com.pk/print_images/large/2023-06-22/shamyl-hussain-hits-double-ton-in-pcb-regional-intra-district-event-1687376685-1997.jpg","source_id":"nation_pk","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"Cricket fraternity lauds India A team for Women’s Emerging Teams Cup victory","link":"https://thenewsmill.com/2023/06/cricket-fraternity-lauds-india-a-team-for-womens-emerging-teams-cup-victory/","keywords":["Cricket","Sports","ANI"],"creator":["ANI"],"video_url":null,"description":"The News Mill","content":"India A women’s team clinched the Asian Cricket Council (ACC) Women’s Emerging Teams Cup defeating Bangladesh A in a low-scoring final in Mong Kok on Wednesday. India’s cricket fraternity lauded the performance and congratulated the team for its victory in the tournament held in Hong Kong. BCCI Secretary Jay Shah praised the Indian team, which won the match by 31 runs. “What a sensational victory! Congratulations to India ‘A’ women’s cricket team for winning the ACC #WomensEmergingTeamsAsiaCup! Each team showed great spirit and fought fiercely till the end. Bright days ahead for women’s cricket in Asia! @ACCMedia1 #ACC,” Jay Shah tweeted. India’s star batter Smriti Mandhana, former women’s cricket captain Mithali Raj and former bowler Jhulan Goswami also lauded the young women’s performance. Another impeccable victory for India as India A took on Bangladesh A at the #WomensEmergingTeamsAsiaCup2023 & clinched the title A proud moment for the nation — Jhulan Goswami (@JhulanG10) June 21, 2023 India A women elected to bat first in the final. They posted 127/7 in their 20 overs on the board. Huge congratulations to the Indian team on lifting the Women’s Emerging Teams Asia Cup trophy! Keep soaring high! #WomensEmergingTeamsAsiaCup pic.twitter.com/QsFzSbj4cu — Smriti Mandhana (@mandhana_smriti) June 21, 2023 Chasing 128, the Indian bowlers kept Bangladesh under pressure from ball one. Shreyanka (4/13 in four overs) was the star for Team India with the ball. Mannat Kashyap also ended with 3/20 in four overs. Kanika took 2/23 in four overs and won the ‘Player of the Match’ for her all-round show while Titas Sandhu took one wicket. Congratulations to these future Indian superstars on their victory in the #WomensEmergingTeamsAsiaCup final! Defending a fighting total, the bowlers were in top form right from the word go, denying the opponents any chance to make a comeback. This triumph marks the beginning of… pic.twitter.com/p9DnVIlYvy — Mithali Raj (@M_Raj03) June 21, 2023 Shreyanka was given the ‘Player of the Tournament’ award and was the highest wicket-taker in the tournament. (ANI)","pubDate":"2023-06-21 19:34:09","image_url":null,"source_id":"thenewsmill","category":["sports"],"country":["india"],"language":"english"},{"title":"‘Hope they’re taking us lightly’: Healy’s Ashes warning as young gun primed to open in Test debut","link":"https://www.brisbanetimes.com.au/sport/cricket/hope-they-re-taking-us-lightly-healy-s-ashes-warning-as-young-gun-primed-to-open-in-test-debut-20230620-p5di4i.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Daniel Brettig"],"video_url":null,"description":"Australia’s Ashes captain Alyssa Healy has warned England not to underestimate them, with 20-year-old Phoebe Litchfield set to open alongside Beth Mooney at Trent Bridge on Thursday.","content":"Nottingham: Australia’s Ashes captain Alyssa Healy has warned England not to underestimate an evolving side, as Phoebe Litchfield is primed for a Test debut at the top of the batting order. The 20-year-old Litchfield is set to open alongside Beth Mooney, while Healy, who has enjoyed watching Litchfield develop for NSW and Australia, slots into the middle order in recognition of her captaincy and wicketkeeping duties. Phoebe Litchfield is poised for her debut at the top of the Australian order. Credit: Getty Images Healy saved her most pointed words for England, following comments by young fast bowler Issy Wong that this may be a good time to face Australia, following the retirement of Rachael Haynes and in the enforced absence of Meg Lanning . The previous Ashes Test between the two sides finished in a memorable draw at Canberra’s Manuka Oval. The new series will start with the sole Test at Trent Bridge, offering plenty of possibilities for a result pitch. “I read the quote, and then I actually read the whole piece instead of just what she said, and it was actually a glowing endorsement for our group, but people chose to take those couple of sentences which was funny,” Healy said. Loading “I don’t think we can hide from the fact we’ve come into this Ashes series and there is no Meg Lanning, no Rachael Haynes. We’ve lost a lot of experience but I’m completely comfortable with the troops we’ve got sitting in the change room, that what they’re going to bring to this series is just as good as what we’ve ever done. “I’m hoping they’re potentially taking us a little bit lightly because I think you do that at your own detriment. The group we’ve got in the change room are incredibly good at their job, and hopefully we can show them just that.” The team’s evolution is typified not just by Litchfield, but also the emergence of Tahlia McGrath as a top-quality all-rounder and as vice-captain. Annabel Sutherland’s batting continues to grow, while Georgia Wareham and Alana King offer contrasting but dangerous wrist spin options in addition to the longstanding threats of Megan Schutt and Jess Jonassen. “We’ve made a real conscious effort when we have had opportunities to blood some young players or give them some experience or opportunity that we’ve made that decision,” Healy said. “I think that’s put us in good stead for the next 10 years, that there’s players waiting in the wings who are ready to go, they’ve tasted playing for Australia and they’ve wanted to do it again. “It’s really crucial to be looking at the future and working out some sort of succession plan and that’s been going on behind the scenes. If I look at the England team, they’ve had a really big turnover all at once, which makes them quite dangerous at the same time, because there’s a lot of unknown about their group.” Litchfield is the team’s precocious young talent, much as the likes of Healy and Ellyse Perry once were in a side stocked with older heads such as the team’s now coach Shelley Nitschke. Healy noted that Litchfield’s knowledge set her up nicely to cope with the technical and mental rigours of a Test match. “For someone so young she knows a lot about her own batting and her own technique,” Healy said. “That’s really cool and really important for someone coming into the international game, that they know a lot about their game and what they can and can’t do. I think she’s right across that, and most importantly she absolutely loves batting. Alyssa Healy and Mitchell Starc. Credit: Getty “So from our point of view, the longer she stays out there the better, because that’s exactly where she wants to be. I think she’s done a bit of top-order batting throughout her career and has the technique to do that. “On the flipside she’s got the gears that she can go up and down and through throughout the ebbs and flows of a Test match and also a one-day game. She’s got that ability to find the boundary when she needs, but also to knuckle down and tough out some gritty little periods.” As for husband Mitchell Starc’s selection status after he missed the first men’s Test at Edgbaston , Healy smiled as she chose her words carefully: “All I’ll say is there’s a lovely slope at Lord’s for a left-armer ...” Watch every ball of the 2023 Ashes series live and exclusive on Nine and 9Now. News, results and expert analysis from the weekend of sport sent every Monday. Sign up for our Sport newsletter . Save Log in , register or subscribe to save articles for later. License this article Australian cricket Cricket Australia England The Ashes Daniel Brettig is The Age's chief cricket writer and the author of several books on cricket. Connect via Twitter . Most Viewed in Sport Loading","pubDate":"2023-06-21 19:00:00","image_url":null,"source_id":"brisbanetimes","category":["sports"],"country":["australia"],"language":"english"},{"title":"Treated like adults, Australia’s cricketers now play like them","link":"https://www.brisbanetimes.com.au/sport/cricket/treated-like-adults-australia-s-cricketers-now-play-like-them-20230621-p5die4.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Daniel Brettig"],"video_url":null,"description":"Since Pat Cummins and Andrew McDonald were placed together as captain and coach last year, they have built an atmosphere of empowerment and adult decisions among their players.","content":"Birmingham: A little over an hour before play began on the final day, as ground staff worked frantically to dry off the few remaining wet spots in the outfield, Pat Cummins walked over to the indoor nets at Edgbaston. He spent nearly the whole of that last hour batting, honing a method that he had also spent plenty of his own time working on in the preceding few months between tours of India and England. Pat Cummins’ Edgbaston batting was the fruit of months of extra work. Credit: Getty Cummins did not do this because he was instructed to by any of the coaching staff, but because he knew the extra work was needed, as there was the distinct possibility that in England he would have to bat as high as No.8 in the order. The thrilling conclusion to Australia’s victory in the opening Ashes Test was vindication for that work, and also for an environment in which a seasoned group of players have been granted the room to make such choices for themselves. Since Cummins and Andrew McDonald were placed together as captain and coach of the Australian men’s side in February last year, they have concentrated on building an atmosphere of empowerment and adult decisions among their players. Often, this has been couched in joking terms by Usman Khawaja and others, as optional warm-ups and training sessions are a world away from some of the more stentorian moments of past teams, whether coached by Mickey Arthur, Darren Lehmann or Justin Langer. Loading But for a group largely composed of well-travelled players, it has extracted that little bit extra to allow for performances like Edgbaston, those at the back end of the India tour or the attritional triumph in Pakistan last year. “It’s hard to quantify it, but I think everything around what’s been done with the team, with Pat and Andrew McDonald in terms of just cutting out the fluff,” Khawaja said. “Cutting out the box-ticking stuff. Just really stripping down the game to its bare nakedness and saying what’s important. What do we think is important? How are we going to do it? “People joke about it all the time and I joked about it when we played the Ahmedabad game, but even warm-ups every morning, they’re optional now, do whatever you need to do to warm up. [I] think that kind of stuff empowers players. It’s empowered us. We take onus on ourselves. Who wants to train today? OK, you don’t want to train, fine. “I think it’s the first time for a long time that we’re actually really getting treated like adults and think that’s made a big difference.” Usman Khawaja “At the end of the day you are responsible for your own performance because that in itself impacts the team. If you are letting the team down in any way, that’s on you. But we’re all professionals and adults here and I think it’s the first time for a long time that we’re actually really getting treated like adults and think that’s made a big difference.” For Khawaja, that meant the freedom to play the Edgbaston conditions and scenario as he saw fit. “I just wanted to take it deep,” he said. “‘Little Uzzie’ inside of me was saying ‘you can expand now, you can get into second or third gear now’ but I was like ‘no, no, take it deep, take it as far deep as you can.’ “Because I knew if we could get into that last hour and had less than 100 runs we could get it, but if we lost too many wickets early that was game over for us. So I actually wanted to go a lot harder than I did in the last hour-and-a-half I was in, I wanted to start playing more shots. But I kept fighting with myself, it was just about building partnerships.” The player-driven elements of the team include strategy meetings where senior players have as much say as coaches, and selection discussions that blur the old distinctions between selectors and players. This was all part of the vision that Cummins brought to the captaincy in late 2021, following a fractious period in which the more prescriptive methods of Langer and also the former team manager Gavin Dovey rankled many. As he said shortly before taking on the job, Cummins believes that players will perform at their best if trusted to use the methods they have already honed, rather than being made to feel as though Test and international cricket requires a complete rethink. “I love the guys who I play alongside; it isn’t just a hobby or even a job,” Cummins said in 2021 . “We spend more time with this group than we do with our partners at home. So I don’t like problems festering. I don’t want to spend 70 per cent of my life on tour in an environment I’m not totally comfortable with. Self-driven: Australian batsman Usman Khawaja. Credit: Getty Images “If we’ve got a young guy who’s come into the side, I don’t think senior players or coaches changing his technique and telling him exactly how to bowl or bat are going to have as much of a positive impact as if he feels welcome, and he’s encouraged to do all the things that got him there. “If we can relieve a little bit of that pressure everyone feels playing professional sport in front of millions of people, that’s where the biggest value is to be had.” Another manifestation of the environment Cummins and McDonald have fostered is the calmer, less caustic air to the way Australia play their cricket. While this was partly forced by the ramifications of the Newlands scandal in 2018, Cummins genuinely believes it is the best way for this group of players to succeed. The sight of Khawaja being goaded by Ollie Robinson was certainly a role reversal from many past Ashes series. Ollie Robinson and Usman Khawaja during the tense final day. Credit: Getty “It’s not just about winning,” Khawaja said. “It’s about how we win, which has changed a lot from past years I played cricket.” That change in tone was discernible even in the way the team sang their victory song, Under The Southern Cross , on the Edgbaston balcony about four hours after Cummins had struck the winning runs. For some years, it had been a hyper-aggressive, yelled exhortation; now it still sounded raucous, but more joyous, and a little less desperate. Calm, composed and the winners of a close Ashes classic; this is indeed a different team, and a happier one, too. Save Log in , register or subscribe to save articles for later. License this article Australian cricket Cricket Australia England The Ashes Daniel Brettig is The Age's chief cricket writer and the author of several books on cricket. Connect via Twitter . Most Viewed in Sport Loading","pubDate":"2023-06-21 19:00:00","image_url":null,"source_id":"brisbanetimes","category":["sports"],"country":["australia"],"language":"english"},{"title":"'Every Day is a Rainbow Day for Me’ - Sir Donald Bradman","link":"https://www.dailymirror.lk/cricket/-Every-Day-is-a-Rainbow-Day-for-Me’---Sir-Donald-Bradman/315-261549","keywords":null,"creator":null,"video_url":null,"description":"Witnessing the Sri Lanka-Australia at the Adelaide Cricket Grounds the writer had the fortune to visit the world famous ’Don Bradman Museum’ located at the ground floor of the beautiful Adelaide Oval which was at the Northern end of the city.","content":"Witnessing the Sri Lanka-Australia at the Adelaide Cricket Grounds the writer had the fortune to visit the world famous 'Don Bradman Museum' located at the ground floor of the beautiful Adelaide Oval which was at the Northern end of the city. As the city of Adelaide has grown and evolved, so too has the Adelaide Oval. An indispensable part of the Adelaide's sporting and social fabric since 1870s, the oval had taken on even more importance as a centerpiece of the state's identity - a world class stadium that will be an existing home for national and international events for decades to come. The name of Donald Bradman occupies a special place in the hearts of every Australian, young and old is respected as the greatest batsman in the history of world cricket. Born in 1908 at New South Wales he began playing cricket at the age of two years. Moving on to Sydney when 18 years old, was selected to play for New South Wales state side at 19 years and made Australian debut at the age of 20 years. Representing Australia from 1928 to 1948 he ended his career with a second ball duck to give him an amazing average of 99.94 runs per an inning. If he had made four runs more the Don would have averaged 100. In 1980 after correspondence with the then Australian Prime Minister, Sir Don donated a substantial number of personal items to the state with the Library as the custodian which now known as the 'Bradman Collection'. For many years the collection was displayed at the Mortlock Library and the State Library's Institute building on North Terrace. It was transferred to the Adelaide Oval in 2008. At the entrance to the museum a big portrait of Sir Donald Bradman is displayed with a saying of his - 'I was never coached, I was never told by anyone how to hold a bat' was engraved at the right hand side of it. The personal lounge of this great cricketer with his wedding photograph, the radio set which he listened to cricket commentaries and the record player with the sofa chair is placed in the first cubicle followed by the bath tub used by Sir Donald, pictures of his young days, as cricketer meeting state heads, international cricketers and personalities hung on the walls. Every item of his cricket kit, materials used, the green baggy Australian cap, the national blazer was preserved for public viewing. On a large screen incidents related to the world famous bodyline series was shown along with a century scored by Bradman which was attracted by visitors. Don Bradman was not only a great cricketer. He was an author of several books including his autobiography and several books related to his cricketing life. Some of these books were exhibited at the museum. He had composed the then famous song \"Every Day is a Rainbow Day for Me\". The writer had the privilege of visiting every nook and corner of the Adelaide Oval including the press box, players enclosures, 3rd umpire's and match referees enclosure, the scoreboard, team conference halls, the Bradman Stand, practice wicket areas, the main playing area and all five floors of the stands accompanied by a guide. A marvelous experience for any cricket enthusiast! (Lakshman Ranasinghe in Australia)","pubDate":"2023-06-21 18:50:00","image_url":"https://bmkltsly13vb.compat.objectstorage.ap-singapore-1.oraclecloud.com/cdn.sg.dailymirror.lk/assets/uploads/image_0efcb586a2.jpg","source_id":"dailymirror","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"“I thought we could have had more intent in our batting…”: WI coach Daren Sammy ahead of WC qualifier match against Nepal","link":"https://thenewsmill.com/2023/06/i-thought-we-could-have-had-more-intent-in-our-batting-wi-coach-daren-sammy-ahead-of-wc-qualifier-match-against-nepal/","keywords":["Cricket","Sports","ANI"],"creator":["ANI"],"video_url":null,"description":"The News Mill","content":"Ahead of his side’s ICC Cricket World Cup 2023 qualifier against Nepal, West Indies head coach Daren Sammy urged his batters to score runs with more intent, despite the threats posed by new ball in the early-morning settings in Zimbabwe. West Indies, the two-time champions will take on Nepal in their Group A WC qualifier match on Thursday. WI is in the second place with one win in two matches, with two points. Nepal is in the third spot with a win and loss in two games, with a total of two points. In the powerplay, WI could manage only 41 runs in their first match against the USA and they lost their openers, Brandon King and Kyle Mayers. “We do not have a say in how the toss goes, but whenever we bat, that new ball poses a challenge. You have got to make sure that the opposition does not get too much ahead when that new ball comes. I thought we could have had more intent because that is one of the things we are talking about as a batting group – intent to score. And when I say intent to score, it is not looking for boundaries but looking for scoring opportunities and when you do that, you could score off good balls and get rotation of strike going,” said Sammy as quoted by ESPNCricinfo saying to CWI Media. “Again, it is a work in progress and we have to bowl well and keep creating opportunities. We dropped a couple of catches and that could affect us in the bigger scheme of things. But I am quite happy with the way we are going; the last six games that we have played we have taken steps in trying to play the brand of cricket we want to move forward with it. Again, it is sticking to our guns, sticking to the plans that we have, and believing and committing to the execution,” he added. Despite King and Mayers not scoring well and Shamarh Brooks being unavailable due to illness, Windies got their hold in the match back due to their middle order. Skipper Shai Hope who has slid down to number four since taking over the captaincy, Brooks’ replacement Johnson Charles, Roston Chase and Jason Holder posted half-centuries. WI posted 297 on the board and USA fell 39 runs short of the target despite a century from Gajanand Singh. Sammy expressed his happiness with progress of the line-up. Under Hope and Sammy, the two-time champions adopted an aggressive approach and had a deep batting line-up till number 11, with all-rounder Akeal Hosein being placed there. This depth helped the top and middle-order to go for their shots. “I listened to the captain after the post-match. He said ideally you may want one of them to score a big hundred, but he was happier that performances came from different batsmen in the group. You look at Brandon King, who has been playing well, did not get a score, Kyle Mayers did not get a score, so it is good signs for us that even though we were under pressure we came back strongly and ideally you would want one of those to convert it into a hundred and we, as a team, celebrate the milestones after,” said Sammy. “But yeah the guys have prepared well and they are hitting lots of balls and they understand the direction the team wants to go in as a batting group. It is early doors, but the fact that mindset is getting towards what we want to do as a team I believe that you will see improvement in days to come,” he added. Nepal, the Windies’ next opponent had a streak of improbable wins that took them to the WC qualifier. In the first match of the tournament, they defeated UAE by six wickets. Nepal head coach Monty Desai was previously WI’s batting coach under Phil Simmons. Sammy said that WI is not taking any opposition lightly in this highly-competitive event, with only two World Cup spots up for grabs. “Yeah, I guess [in] the first match against the USA, we got the ‘W’ that we wanted, which was the win. Great start to the tournament, but we have so much left in the tank. The guys came out and you could see they were not happy with the way they played, which is a good sign for us. We keep challenging ourselves and yeah in the end we have a few things we have to continue. But it is a work in progress – trying to find the identity of our cricket moving forward,” he said. “But, yeah, I was pleased with the victory. You come [up] against Nepal, a team who is on the rise and they have been playing some good cricket, so again we respect all our oppositions, but we focus on the things that we want to do as a team and focus on the brand of cricket we want to play. And it all boils down to our preparation, which we have been doing well and then on game day the execution. I have full confidence and belief in the boys – or men rather – that they will go out and do themselves and the region proud,” he concluded. (ANI)","pubDate":"2023-06-21 18:34:23","image_url":null,"source_id":"thenewsmill","category":["sports"],"country":["india"],"language":"english"},{"title":"CWC Qualifiers: Need to carry on with this confidence against Sri Lanka, Scotland, says Oman skipper Zeeshan after win over UAE","link":"https://thenewsmill.com/2023/06/cwc-qualifiers-need-to-carry-on-with-this-confidence-against-sri-lanka-scotland-says-oman-skipper-zeeshan-after-win-over-uae/","keywords":["Cricket","Sports","ANI"],"creator":["ANI"],"video_url":null,"description":"The News Mill","content":"After a five-wicket win over UAE in their ICC Cricket World Cup 2023 qualifier match, Oman captain Zeeshan Maqsood lauded his team for their performances and added that they need to carry with the confidence received from wins in their matches against Sri Lanka and Scotland. Three half-centuries from Aqib Ilyas, Shoaib Khan and Mohammad Nadeem helped Oman clinch their second successive victory in their ICC Cricket World Cup 2023 qualifier match against UAE by five wickets in Bulawayo on Wednesday. “The way the boys are playing, we are happy. They are putting so much in all departments, our preparation has been great, players are taking responsibility and that has been the key. The way Aqib and Shoaib batted was key. Later on Ayaan and Nadeem played well. When Shoaib came off and I played a bad shot, there was pressure. But on that track, if you get set bowlers cannot get you out. We have games against Sri Lanka and Scotland, we need to play well and carry that confidence forward,” said Zeeshan in a post-match presentation. Coming to the match, UAE posted 227/8 in their 50 overs after being put to bat first by Oman. Aayan Khan hit a brilliant half-century, scoring 58* in 52 balls. Also, Vriitya Aravind (49 in 84 balls) and Rameez Shahzad (38 in 51 balls) put on an 87-run stand for the third wicket after UAE was reduced to 16/2. Jay Odedra (3/31) was the pick of the bowlers for Oman. In the chase of 228, Oman was restricted to 14/2. But later, half-centuries from Aqib Ilyas (53), Shoaib Khan (52*) and Mohammad Nadeem (50*) helped Oman chase down the target with four overs and five wickets in hand. Junaid Siddique (2/31) was the standout bowler for UAE. Shoaib was given the ‘Man of the Match’ award for his fifty. Oman is at the top of the Group B point table with two wins in two matches and a total of four points. On the other hand, UAE is at the bottom with two losses in two games, with zero points. (ANI)","pubDate":"2023-06-21 18:34:10","image_url":null,"source_id":"thenewsmill","category":["sports"],"country":["india"],"language":"english"},{"title":"पीसीबी चीफ बनने से पहले ही जका अशरफ ने दिखाई अकड़, एशिया कप पर फिर लटकी तलवार","link":"https://navbharattimes.indiatimes.com/sports/cricket/cricket-news/possible-pcb-chairman-zaka-ashraf-rejects-hybrid-model-of-asia-cup/articleshow/101171543.cms","keywords":null,"creator":null,"video_url":null,"description":"एशिया कप 2023 की मेजबानी पर मथा पच्ची कम नहीं हुई है। नजम सेठी के बाद पीसीबी के संभावित अगले अध्यक्ष जका अशरफ ने हाइब्रिड मॉडल को ठुकरा दिया। जका अशरफ के इस फैसले से एक बार फिर एशिया कप को लेकर पेंच फंस गया है।","content":"पाकिस्तान क्रिकेट बोर्ड के संभावित अगले अध्यक्ष जका अशरफ ने पाकिस्तान और श्रीलंका में सितंबर को होने वाले आगामी एशिया कप के लिए नजम सेठी के ‘हाइब्रिड मॉडल’ को ठुकरा दिया है। अशरफ ने इस्लामाबाद में बुधवार को एक प्रेस कांफ्रेंस में कहा, 'पहली बात तो यह है कि मैं पहले भी एशिया कप के हाइब्रिड मॉडल को खारिज कर चुका हूं क्योंकि मैं इससे सहमत नहीं हूं। एशियाई क्रिकेट परिषद के बोर्ड ने फैसला किया था कि यह टूर्नामेंट पाकिस्तान में होगा तो यहीं होना चाहिए।' अशरफ के इस बयान के बाद भारत में इस साल के आखिर में होने वाले वनडे विश्व कप में पाकिस्तान की भागीदारी भी खटाई में पड़ गई है। समझा जाता है कि पाकिस्तान के सहमति जताने के बाद पीछे हटने से बीसीसीआई भी कड़ा रूख अपना सकता है। एसीसी के कार्यकारी बोर्ड ने हाइब्रिड मॉडल को मंजूरी दी है। अशरफ अगर अपना रूख नहीं बदलते हैं तो एशिया कप पाकिस्तान के बिना ही खेला जा सकता है। एसीसी बोर्ड के एक सदस्य ने कहा, 'एशिया कप मॉडल को एसीसी ने स्वीकार किया है और इसमें कोई बदलाव नहीं होगा। अशरफ जो चाहे, वह कहने के लिये स्वतंत्र हैं।' पाकिस्तान के प्रधानमंत्री शाहबाज शरीफ के करीबी अशरफ का पीसीबी अध्यक्ष बनना तय है चूंकि प्रधानमंत्री ही बोर्ड का मुख्य संरक्षक भी है और नियुक्तियां उनकी मर्जी से ही होती है। हाइब्रिड मॉडल को बीसीसीआई सचिव जय शाह की अध्यक्षता वाली एसीसी ने स्वीकार किया था।भारत ने साफ तौर पर कहा था कि वह पाकिस्तान खेलने नहीं जायेगा। सेठी के अध्यक्ष पद से हटते ही 48 घंटे में हालात बदल गए। सेठी ने कहा था कि वह आसिफ जरदारी और शाहबाज शरीफ के बीच मतभेद का कारण नहीं बनना चाहते और इसी वजह से अध्यक्ष पद की दौड़ से हट रहे हैं। अशरफ ने प्रेस कांफ्रेंस में कहा कि वह नहीं चाहते कि बेमानी मैच पाकिस्तान में कराये जाएं। उन्होंने कहा, 'सभी मुख्य मैच पाकिस्तान से बाहर होंगे । नेपाल और भूटान जैसी टीमें पाकिस्तान में खेलेंगे जो गलत है। मुझे नहीं पता कि बोर्ड ने पहले किस पर मंजूरी दी। मैं देखता हूं कि इतने कम समय में क्या हो सकता है। हम वही करेंगे जो पाकिस्तान के लिये बेहतर हो।’ उन्होंने यह भी कहा कि विश्व कप का मसला अभी हल नहीं हुआ है जिसके मायने हैं कि कार्यक्रम जारी करने में अभी और विलंब होगा। उन्होंने कहा, 'पाकिस्तान के सामने चुनौतियां है। कई लंबित मसले हैं। एशिया कप है और फिर विश्व कप है । मैं किसी के खिलाफ नहीं बोलना चाहता क्योंकि अभी मैने पद नहीं संभाला है। पद संभालने के बाद देखते हैं कि क्या हालात है।","pubDate":"2023-06-21 18:18:57","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Robinson warned by match referee for Khawaja abuse","link":"https://www.brisbanetimes.com.au/sport/cricket/robinson-warned-by-match-referee-for-khawaja-send-off-20230621-p5digk.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Malcolm Conn"],"video_url":null,"description":"Match referee Andy Pycroft opted against any official action following the England quick’s departing missive, while both sides were heavily penalised for slow over rates.","content":"England fast bowler Ollie Robinson has escaped with a warning following his send-off of Usman Khawaja during the first Test at Edgbaston, which Australia won in dramatic fashion on Tuesday. Match referee Andy Pycroft took no official action against Robinson and the International Cricket Council said it did not comment on referee’s decisions when questioned by this masthead. However, sources close to the match officials, who spoke on the condition of anonymity, claimed that it was considered a “borderline case”. “It was felt to be an exaggerated celebration rather than a send-off,” the source claimed. Robinson’s celebration, after bowling Khawaja for 141 on Saturday, included him saying “f--- off, you f------ p---k”. While referee Pycroft took no official action against Robinson, he fined recalled spinner Moeen Ali 25 per cent of his match free for spraying a healing agent on his damaged spinning finger, and fined every player 40 per cent of their match frees when England and Australia were found to be behind their over rates. Ollie Robinson exchanges words with Usman Khawaja on the final day of the first Test. Credit: Getty Following the Test Khawaja, who was named player of the match, claimed he did not hear Robinson. Nor did Khawaja want to discuss the exchange between him and Robinson during a drinks break on the final day. “The other day, the crowd was so loud I had no idea,” Khawaja said. “Today (Tuesday) there was nothing much in it. Just a bit of friendly banter. This game was played in pretty good spirits for most of it. “It’s not just about winning, it’s about how we win, which has changed a lot from past years I played cricket. I think the game was played in pretty good spirits. Khawaja was named player of the match on the back of his first Test century on English soil. Credit: Getty “There wasn’t much in it. There’s no point in me talking about it.” While the England players gathered in a huddle for drinks on the last afternoon, Robinson walked over to Khawaja and his batting partner Travis Head. Stump mics picked up Robinson suggesting that Khawaja was too defensive, saying “a freebie, isn’t it? A half-volley with the field up”. Khawaja replied to the bowler: “There’s rough there. Not hitting that. That’s why you’re not a batsman”. Robinson added that it was “nice to see you say something back” and Khawaja suggested Robinson should “be careful”, an apparent reference to his earlier send-off. Jimmy Anderson, once England’s chief sledger, walked over, grabbed Robinson, and guided him back to the team huddle. Umpire Marais Erasmus then walked into the England huddle during drinks and spoke to Robinson. When the huddle broke up Robinson wandered over to Khawaja, spoke to him in conciliatory fashion, and patted the Australian on the back. Khawaja later declined to say whether Robinson had apologised. The International Cricket Council’s code of conduct, section 2.5, prohibits any kind of “send-off” including “verbally abusing the dismissed batter”. It is a level one offence that can attract a fine of up to 50 per cent of a player’s match fee if the player is charged and pleads or is found guilty. England’s player match fees are £15,000 ($28,000). Robinson justified his actions after play on Sunday by claiming that former Australian captain Ricky Ponting and other Australians had abused England players in the past. “When you’re in the heat of the moment and have the passion of the Ashes, that can happen,” Robinson said. “We’ve all seen Ricky Ponting and other Aussies do the same to us. Just because the shoe’s on the other foot, it’s not received well. “It’s my first home Ashes and to get the big wicket at the time was special for me. Uzzie played unbelievably well and to get that wicket for us at the time as a team was massive. We all want that theatre of the game, don’t we, and I’m here to provide it.” Loading Ponting, who is in England commentating, was annoyed with Robinson for implicating him in the sledging furore. “A lot of this stuff happens in the heat of battle,” Ponting told Sky Sports. “The only thing I’d say with Ollie is Khawaja was 140, Robinson hadn’t looked like getting a wicket all day, and he’s just sledged probably the nicest man that’s ever walked on the planet.” Watch every ball of the 2023 Ashes series live and exclusive on Channel 9 and 9Now. Sports news, results and expert commentary. Sign up for our Sport newsletter . Save Log in , register or subscribe to save articles for later. License this article The Ashes Test cricket Australian cricket England Malcolm Conn is Chief Cricket Writer. Connect via Twitter or email . Most Viewed in Sport Loading","pubDate":"2023-06-21 21:45:40","image_url":null,"source_id":"brisbanetimes","category":["sports"],"country":["australia"],"language":"english"},{"title":"IPC Minister urges India to end politicisation and play cricket in Pakistan","link":"https://www.nation.com.pk/22-Jun-2023/ipc-minister-urges-india-to-end-politicisation-and-play-cricket-in-pakistan","keywords":["Sports"],"creator":["OUR STAFF REPORT"],"video_url":null,"description":"LAHORE-Federal Minister for Inter Provincial Coordination (IPC) Ehsan Ur Rehman Mazari has said that India is politicizing cricket by not allowing its team to visit Pakistan, adding it should end politicisation and play cricket in Pakistan.","content":"LAHORE-Federal Minister for Inter Provincial Coordination (IPC) Ehsan Ur Rehman Mazari has said that India is politicizing cricket by not allowing its team to visit Pakistan, adding it should end politicisation and play cricket in Pakistan. “India should leave its stubbornness and play cricket in Pakistan. Personally, I believe that if India does not come to Pakistan, then Pakistan should also not visit them. If India chose to play at the neutral venue, then Pakistan should also do the same. India always plays politics on cricket. If Indian teams from other disciplines can visit Pakistan, then why not its cricket team,” said Mazari while talking to media along with Zaka Ashraf at a cake-cutting ceremony on the birthday anniversary of Shaheed Benazir Bhutto at his office on Wednesday. The IPC Minister said that the PCB Management Committee’s term had ended on the night of June 19, and the decisions taken by it after that had no status. Prime Minister office on Tuesday in a notification said that the Prime Minister had nominated Zaka Ashraf and Supreme Court Advocate Mustafa Ramday as the PCB’s Board of Governors (BoG). According to the IPC Minister, the leadership of Pakistan People’s Party wanted to see Zaka Ashraf as the PCB chairman. “I had sent the summary to the Prime Minister’s House [for Zaka and Ramday’s appointment]. I am thankful to Prime Minister Shehbaz Sharif for approving that,” he said. “Now Zaka Ashraf is all set to take over the reins of Pakistan Cricket Board’s stewardship before Eid-ul-Azha as the government does not want to delay his (Zaka) appointment,” Mazari said and added that the PCB Election Commissioner would be looking after the affairs of the board till the election of the new PCB chairman. “Every effort will be made to hold the elections before Eid. It is clear that Zaka Ashraf will be the new chairman of the board, following its elections,” he asserted. Speaking on the occasion, Zaka Ashraf said: “I am deeply grateful to Prime Minister Shehbaz Sharif, Co-Chairman of PPP Asif Ali Zardari and IPC Minister Ehsan ur Rehman Mazari for reposing trusting in me.” He said the Asia Cup and the World Cup were approaching and his focus would be to prepare the national outfit for those events. In response to a question, Zaka Ashraf said that he was against the hybrid model from day one. “If the Asian Cricket Council (ACC) had given rights to the PCB to hold the Asia Cup, then the entire event should have taken place in Pakistan,” he added.","pubDate":"2023-06-21 19:45:29","image_url":"https://www.nation.com.pk/print_images/large/2023-06-22/ipc-minister-urges-india-to-end-politicisation-and-play-cricket-in-pakistan-1687376724-4600.jpg","source_id":"nation_pk","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"Shamyl Hussain hits double ton in PCB Regional Intra-District event","link":"https://www.nation.com.pk/22-Jun-2023/shamyl-hussain-hits-double-ton-in-pcb-regional-intra-district-event","keywords":["Sports"],"creator":["OUR STAFF REPORT"],"video_url":null,"description":"LAHORE-Pakistan U19 national player, Shamyl Hussain, smashed a dazzling double hundred in Pakistan Cricket Board’s (PCB) ongoing Regional Intra-District U-19 at the Karachi Company Cricket Ground.","content":"LAHORE-Pakistan U19 national player, Shamyl Hussain, smashed a dazzling double hundred in Pakistan Cricket Board’s (PCB) ongoing Regional Intra-District U-19 at the Karachi Company Cricket Ground. Ranked as national number one U19 T-20 batsman, Shamyl hit 22 scintillating fours and nine towering sixes to achieve the exceptional feat of 206 runs in 135 balls with a strike rate of 170. Boosted by this breathtaking stroke-play, his team, North Zone, that he also captains, amassed 420 runs under a sizzling sun that sent the mercury into 41 plus degrees. For much of the innings, the real opponent was scorching heat that tested stamina, patience and skill. Shamyl came good on all three counts as bowlers toiled away before a chanceless and ruthless hitting that practically ripped the leather apart. The opponents, Gilgit Baltistan, offered some resistance but lost the momentum and closed the 50 over match at 291 for 7. Shamyl also bagged two wickets in his 9 overs. No stranger to big innings and centuries, the left-handed batsman’s previous highest was 161 scored two years ago in PCB tournament. In this match, he bettered his own record and made one of the fastest double-centuries in this format. Shamyl got his national cap earlier this year in the overseas series against Bangladesh and won the T20 trophy for Pakistan with his 67 runs innings that got him the man of the match shield. His batting masterclass was well supported by his opening partner Behroz Khan who made 89. Gilgit Baltistan’s Tabrar Wali, 80 not out, was the highest run-getter and provided some relief to his team in what was a long hard day for them.","pubDate":"2023-06-21 19:44:49","image_url":"https://www.nation.com.pk/print_images/large/2023-06-22/shamyl-hussain-hits-double-ton-in-pcb-regional-intra-district-event-1687376685-1997.jpg","source_id":"nation_pk","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"Cricket fraternity lauds India A team for Women’s Emerging Teams Cup victory","link":"https://thenewsmill.com/2023/06/cricket-fraternity-lauds-india-a-team-for-womens-emerging-teams-cup-victory/","keywords":["Cricket","Sports","ANI"],"creator":["ANI"],"video_url":null,"description":"The News Mill","content":"India A women’s team clinched the Asian Cricket Council (ACC) Women’s Emerging Teams Cup defeating Bangladesh A in a low-scoring final in Mong Kok on Wednesday. India’s cricket fraternity lauded the performance and congratulated the team for its victory in the tournament held in Hong Kong. BCCI Secretary Jay Shah praised the Indian team, which won the match by 31 runs. “What a sensational victory! Congratulations to India ‘A’ women’s cricket team for winning the ACC #WomensEmergingTeamsAsiaCup! Each team showed great spirit and fought fiercely till the end. Bright days ahead for women’s cricket in Asia! @ACCMedia1 #ACC,” Jay Shah tweeted. India’s star batter Smriti Mandhana, former women’s cricket captain Mithali Raj and former bowler Jhulan Goswami also lauded the young women’s performance. Another impeccable victory for India as India A took on Bangladesh A at the #WomensEmergingTeamsAsiaCup2023 & clinched the title A proud moment for the nation — Jhulan Goswami (@JhulanG10) June 21, 2023 India A women elected to bat first in the final. They posted 127/7 in their 20 overs on the board. Huge congratulations to the Indian team on lifting the Women’s Emerging Teams Asia Cup trophy! Keep soaring high! #WomensEmergingTeamsAsiaCup pic.twitter.com/QsFzSbj4cu — Smriti Mandhana (@mandhana_smriti) June 21, 2023 Chasing 128, the Indian bowlers kept Bangladesh under pressure from ball one. Shreyanka (4/13 in four overs) was the star for Team India with the ball. Mannat Kashyap also ended with 3/20 in four overs. Kanika took 2/23 in four overs and won the ‘Player of the Match’ for her all-round show while Titas Sandhu took one wicket. Congratulations to these future Indian superstars on their victory in the #WomensEmergingTeamsAsiaCup final! Defending a fighting total, the bowlers were in top form right from the word go, denying the opponents any chance to make a comeback. This triumph marks the beginning of… pic.twitter.com/p9DnVIlYvy — Mithali Raj (@M_Raj03) June 21, 2023 Shreyanka was given the ‘Player of the Tournament’ award and was the highest wicket-taker in the tournament. (ANI)","pubDate":"2023-06-21 19:34:09","image_url":null,"source_id":"thenewsmill","category":["sports"],"country":["india"],"language":"english"},{"title":"‘Hope they’re taking us lightly’: Healy’s Ashes warning as young gun primed to open in Test debut","link":"https://www.brisbanetimes.com.au/sport/cricket/hope-they-re-taking-us-lightly-healy-s-ashes-warning-as-young-gun-primed-to-open-in-test-debut-20230620-p5di4i.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Daniel Brettig"],"video_url":null,"description":"Australia’s Ashes captain Alyssa Healy has warned England not to underestimate them, with 20-year-old Phoebe Litchfield set to open alongside Beth Mooney at Trent Bridge on Thursday.","content":"Nottingham: Australia’s Ashes captain Alyssa Healy has warned England not to underestimate an evolving side, as Phoebe Litchfield is primed for a Test debut at the top of the batting order. The 20-year-old Litchfield is set to open alongside Beth Mooney, while Healy, who has enjoyed watching Litchfield develop for NSW and Australia, slots into the middle order in recognition of her captaincy and wicketkeeping duties. Phoebe Litchfield is poised for her debut at the top of the Australian order. Credit: Getty Images Healy saved her most pointed words for England, following comments by young fast bowler Issy Wong that this may be a good time to face Australia, following the retirement of Rachael Haynes and in the enforced absence of Meg Lanning . The previous Ashes Test between the two sides finished in a memorable draw at Canberra’s Manuka Oval. The new series will start with the sole Test at Trent Bridge, offering plenty of possibilities for a result pitch. “I read the quote, and then I actually read the whole piece instead of just what she said, and it was actually a glowing endorsement for our group, but people chose to take those couple of sentences which was funny,” Healy said. Loading “I don’t think we can hide from the fact we’ve come into this Ashes series and there is no Meg Lanning, no Rachael Haynes. We’ve lost a lot of experience but I’m completely comfortable with the troops we’ve got sitting in the change room, that what they’re going to bring to this series is just as good as what we’ve ever done. “I’m hoping they’re potentially taking us a little bit lightly because I think you do that at your own detriment. The group we’ve got in the change room are incredibly good at their job, and hopefully we can show them just that.” The team’s evolution is typified not just by Litchfield, but also the emergence of Tahlia McGrath as a top-quality all-rounder and as vice-captain. Annabel Sutherland’s batting continues to grow, while Georgia Wareham and Alana King offer contrasting but dangerous wrist spin options in addition to the longstanding threats of Megan Schutt and Jess Jonassen. “We’ve made a real conscious effort when we have had opportunities to blood some young players or give them some experience or opportunity that we’ve made that decision,” Healy said. “I think that’s put us in good stead for the next 10 years, that there’s players waiting in the wings who are ready to go, they’ve tasted playing for Australia and they’ve wanted to do it again. “It’s really crucial to be looking at the future and working out some sort of succession plan and that’s been going on behind the scenes. If I look at the England team, they’ve had a really big turnover all at once, which makes them quite dangerous at the same time, because there’s a lot of unknown about their group.” Litchfield is the team’s precocious young talent, much as the likes of Healy and Ellyse Perry once were in a side stocked with older heads such as the team’s now coach Shelley Nitschke. Healy noted that Litchfield’s knowledge set her up nicely to cope with the technical and mental rigours of a Test match. “For someone so young she knows a lot about her own batting and her own technique,” Healy said. “That’s really cool and really important for someone coming into the international game, that they know a lot about their game and what they can and can’t do. I think she’s right across that, and most importantly she absolutely loves batting. Alyssa Healy and Mitchell Starc. Credit: Getty “So from our point of view, the longer she stays out there the better, because that’s exactly where she wants to be. I think she’s done a bit of top-order batting throughout her career and has the technique to do that. “On the flipside she’s got the gears that she can go up and down and through throughout the ebbs and flows of a Test match and also a one-day game. She’s got that ability to find the boundary when she needs, but also to knuckle down and tough out some gritty little periods.” As for husband Mitchell Starc’s selection status after he missed the first men’s Test at Edgbaston , Healy smiled as she chose her words carefully: “All I’ll say is there’s a lovely slope at Lord’s for a left-armer ...” Watch every ball of the 2023 Ashes series live and exclusive on Nine and 9Now. News, results and expert analysis from the weekend of sport sent every Monday. Sign up for our Sport newsletter . Save Log in , register or subscribe to save articles for later. License this article Australian cricket Cricket Australia England The Ashes Daniel Brettig is The Age's chief cricket writer and the author of several books on cricket. Connect via Twitter . Most Viewed in Sport Loading","pubDate":"2023-06-21 19:00:00","image_url":null,"source_id":"brisbanetimes","category":["sports"],"country":["australia"],"language":"english"},{"title":"Treated like adults, Australia’s cricketers now play like them","link":"https://www.brisbanetimes.com.au/sport/cricket/treated-like-adults-australia-s-cricketers-now-play-like-them-20230621-p5die4.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Daniel Brettig"],"video_url":null,"description":"Since Pat Cummins and Andrew McDonald were placed together as captain and coach last year, they have built an atmosphere of empowerment and adult decisions among their players.","content":"Birmingham: A little over an hour before play began on the final day, as ground staff worked frantically to dry off the few remaining wet spots in the outfield, Pat Cummins walked over to the indoor nets at Edgbaston. He spent nearly the whole of that last hour batting, honing a method that he had also spent plenty of his own time working on in the preceding few months between tours of India and England. Pat Cummins’ Edgbaston batting was the fruit of months of extra work. Credit: Getty Cummins did not do this because he was instructed to by any of the coaching staff, but because he knew the extra work was needed, as there was the distinct possibility that in England he would have to bat as high as No.8 in the order. The thrilling conclusion to Australia’s victory in the opening Ashes Test was vindication for that work, and also for an environment in which a seasoned group of players have been granted the room to make such choices for themselves. Since Cummins and Andrew McDonald were placed together as captain and coach of the Australian men’s side in February last year, they have concentrated on building an atmosphere of empowerment and adult decisions among their players. Often, this has been couched in joking terms by Usman Khawaja and others, as optional warm-ups and training sessions are a world away from some of the more stentorian moments of past teams, whether coached by Mickey Arthur, Darren Lehmann or Justin Langer. Loading But for a group largely composed of well-travelled players, it has extracted that little bit extra to allow for performances like Edgbaston, those at the back end of the India tour or the attritional triumph in Pakistan last year. “It’s hard to quantify it, but I think everything around what’s been done with the team, with Pat and Andrew McDonald in terms of just cutting out the fluff,” Khawaja said. “Cutting out the box-ticking stuff. Just really stripping down the game to its bare nakedness and saying what’s important. What do we think is important? How are we going to do it? “People joke about it all the time and I joked about it when we played the Ahmedabad game, but even warm-ups every morning, they’re optional now, do whatever you need to do to warm up. [I] think that kind of stuff empowers players. It’s empowered us. We take onus on ourselves. Who wants to train today? OK, you don’t want to train, fine. “I think it’s the first time for a long time that we’re actually really getting treated like adults and think that’s made a big difference.” Usman Khawaja “At the end of the day you are responsible for your own performance because that in itself impacts the team. If you are letting the team down in any way, that’s on you. But we’re all professionals and adults here and I think it’s the first time for a long time that we’re actually really getting treated like adults and think that’s made a big difference.” For Khawaja, that meant the freedom to play the Edgbaston conditions and scenario as he saw fit. “I just wanted to take it deep,” he said. “‘Little Uzzie’ inside of me was saying ‘you can expand now, you can get into second or third gear now’ but I was like ‘no, no, take it deep, take it as far deep as you can.’ “Because I knew if we could get into that last hour and had less than 100 runs we could get it, but if we lost too many wickets early that was game over for us. So I actually wanted to go a lot harder than I did in the last hour-and-a-half I was in, I wanted to start playing more shots. But I kept fighting with myself, it was just about building partnerships.” The player-driven elements of the team include strategy meetings where senior players have as much say as coaches, and selection discussions that blur the old distinctions between selectors and players. This was all part of the vision that Cummins brought to the captaincy in late 2021, following a fractious period in which the more prescriptive methods of Langer and also the former team manager Gavin Dovey rankled many. As he said shortly before taking on the job, Cummins believes that players will perform at their best if trusted to use the methods they have already honed, rather than being made to feel as though Test and international cricket requires a complete rethink. “I love the guys who I play alongside; it isn’t just a hobby or even a job,” Cummins said in 2021 . “We spend more time with this group than we do with our partners at home. So I don’t like problems festering. I don’t want to spend 70 per cent of my life on tour in an environment I’m not totally comfortable with. Self-driven: Australian batsman Usman Khawaja. Credit: Getty Images “If we’ve got a young guy who’s come into the side, I don’t think senior players or coaches changing his technique and telling him exactly how to bowl or bat are going to have as much of a positive impact as if he feels welcome, and he’s encouraged to do all the things that got him there. “If we can relieve a little bit of that pressure everyone feels playing professional sport in front of millions of people, that’s where the biggest value is to be had.” Another manifestation of the environment Cummins and McDonald have fostered is the calmer, less caustic air to the way Australia play their cricket. While this was partly forced by the ramifications of the Newlands scandal in 2018, Cummins genuinely believes it is the best way for this group of players to succeed. The sight of Khawaja being goaded by Ollie Robinson was certainly a role reversal from many past Ashes series. Ollie Robinson and Usman Khawaja during the tense final day. Credit: Getty “It’s not just about winning,” Khawaja said. “It’s about how we win, which has changed a lot from past years I played cricket.” That change in tone was discernible even in the way the team sang their victory song, Under The Southern Cross , on the Edgbaston balcony about four hours after Cummins had struck the winning runs. For some years, it had been a hyper-aggressive, yelled exhortation; now it still sounded raucous, but more joyous, and a little less desperate. Calm, composed and the winners of a close Ashes classic; this is indeed a different team, and a happier one, too. Save Log in , register or subscribe to save articles for later. License this article Australian cricket Cricket Australia England The Ashes Daniel Brettig is The Age's chief cricket writer and the author of several books on cricket. Connect via Twitter . Most Viewed in Sport Loading","pubDate":"2023-06-21 19:00:00","image_url":null,"source_id":"brisbanetimes","category":["sports"],"country":["australia"],"language":"english"},{"title":"'Every Day is a Rainbow Day for Me’ - Sir Donald Bradman","link":"https://www.dailymirror.lk/cricket/-Every-Day-is-a-Rainbow-Day-for-Me’---Sir-Donald-Bradman/315-261549","keywords":null,"creator":null,"video_url":null,"description":"Witnessing the Sri Lanka-Australia at the Adelaide Cricket Grounds the writer had the fortune to visit the world famous ’Don Bradman Museum’ located at the ground floor of the beautiful Adelaide Oval which was at the Northern end of the city.","content":"Witnessing the Sri Lanka-Australia at the Adelaide Cricket Grounds the writer had the fortune to visit the world famous 'Don Bradman Museum' located at the ground floor of the beautiful Adelaide Oval which was at the Northern end of the city. As the city of Adelaide has grown and evolved, so too has the Adelaide Oval. An indispensable part of the Adelaide's sporting and social fabric since 1870s, the oval had taken on even more importance as a centerpiece of the state's identity - a world class stadium that will be an existing home for national and international events for decades to come. The name of Donald Bradman occupies a special place in the hearts of every Australian, young and old is respected as the greatest batsman in the history of world cricket. Born in 1908 at New South Wales he began playing cricket at the age of two years. Moving on to Sydney when 18 years old, was selected to play for New South Wales state side at 19 years and made Australian debut at the age of 20 years. Representing Australia from 1928 to 1948 he ended his career with a second ball duck to give him an amazing average of 99.94 runs per an inning. If he had made four runs more the Don would have averaged 100. In 1980 after correspondence with the then Australian Prime Minister, Sir Don donated a substantial number of personal items to the state with the Library as the custodian which now known as the 'Bradman Collection'. For many years the collection was displayed at the Mortlock Library and the State Library's Institute building on North Terrace. It was transferred to the Adelaide Oval in 2008. At the entrance to the museum a big portrait of Sir Donald Bradman is displayed with a saying of his - 'I was never coached, I was never told by anyone how to hold a bat' was engraved at the right hand side of it. The personal lounge of this great cricketer with his wedding photograph, the radio set which he listened to cricket commentaries and the record player with the sofa chair is placed in the first cubicle followed by the bath tub used by Sir Donald, pictures of his young days, as cricketer meeting state heads, international cricketers and personalities hung on the walls. Every item of his cricket kit, materials used, the green baggy Australian cap, the national blazer was preserved for public viewing. On a large screen incidents related to the world famous bodyline series was shown along with a century scored by Bradman which was attracted by visitors. Don Bradman was not only a great cricketer. He was an author of several books including his autobiography and several books related to his cricketing life. Some of these books were exhibited at the museum. He had composed the then famous song \"Every Day is a Rainbow Day for Me\". The writer had the privilege of visiting every nook and corner of the Adelaide Oval including the press box, players enclosures, 3rd umpire's and match referees enclosure, the scoreboard, team conference halls, the Bradman Stand, practice wicket areas, the main playing area and all five floors of the stands accompanied by a guide. A marvelous experience for any cricket enthusiast! (Lakshman Ranasinghe in Australia)","pubDate":"2023-06-21 18:50:00","image_url":"https://bmkltsly13vb.compat.objectstorage.ap-singapore-1.oraclecloud.com/cdn.sg.dailymirror.lk/assets/uploads/image_0efcb586a2.jpg","source_id":"dailymirror","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"“I thought we could have had more intent in our batting…”: WI coach Daren Sammy ahead of WC qualifier match against Nepal","link":"https://thenewsmill.com/2023/06/i-thought-we-could-have-had-more-intent-in-our-batting-wi-coach-daren-sammy-ahead-of-wc-qualifier-match-against-nepal/","keywords":["Cricket","Sports","ANI"],"creator":["ANI"],"video_url":null,"description":"The News Mill","content":"Ahead of his side’s ICC Cricket World Cup 2023 qualifier against Nepal, West Indies head coach Daren Sammy urged his batters to score runs with more intent, despite the threats posed by new ball in the early-morning settings in Zimbabwe. West Indies, the two-time champions will take on Nepal in their Group A WC qualifier match on Thursday. WI is in the second place with one win in two matches, with two points. Nepal is in the third spot with a win and loss in two games, with a total of two points. In the powerplay, WI could manage only 41 runs in their first match against the USA and they lost their openers, Brandon King and Kyle Mayers. “We do not have a say in how the toss goes, but whenever we bat, that new ball poses a challenge. You have got to make sure that the opposition does not get too much ahead when that new ball comes. I thought we could have had more intent because that is one of the things we are talking about as a batting group – intent to score. And when I say intent to score, it is not looking for boundaries but looking for scoring opportunities and when you do that, you could score off good balls and get rotation of strike going,” said Sammy as quoted by ESPNCricinfo saying to CWI Media. “Again, it is a work in progress and we have to bowl well and keep creating opportunities. We dropped a couple of catches and that could affect us in the bigger scheme of things. But I am quite happy with the way we are going; the last six games that we have played we have taken steps in trying to play the brand of cricket we want to move forward with it. Again, it is sticking to our guns, sticking to the plans that we have, and believing and committing to the execution,” he added. Despite King and Mayers not scoring well and Shamarh Brooks being unavailable due to illness, Windies got their hold in the match back due to their middle order. Skipper Shai Hope who has slid down to number four since taking over the captaincy, Brooks’ replacement Johnson Charles, Roston Chase and Jason Holder posted half-centuries. WI posted 297 on the board and USA fell 39 runs short of the target despite a century from Gajanand Singh. Sammy expressed his happiness with progress of the line-up. Under Hope and Sammy, the two-time champions adopted an aggressive approach and had a deep batting line-up till number 11, with all-rounder Akeal Hosein being placed there. This depth helped the top and middle-order to go for their shots. “I listened to the captain after the post-match. He said ideally you may want one of them to score a big hundred, but he was happier that performances came from different batsmen in the group. You look at Brandon King, who has been playing well, did not get a score, Kyle Mayers did not get a score, so it is good signs for us that even though we were under pressure we came back strongly and ideally you would want one of those to convert it into a hundred and we, as a team, celebrate the milestones after,” said Sammy. “But yeah the guys have prepared well and they are hitting lots of balls and they understand the direction the team wants to go in as a batting group. It is early doors, but the fact that mindset is getting towards what we want to do as a team I believe that you will see improvement in days to come,” he added. Nepal, the Windies’ next opponent had a streak of improbable wins that took them to the WC qualifier. In the first match of the tournament, they defeated UAE by six wickets. Nepal head coach Monty Desai was previously WI’s batting coach under Phil Simmons. Sammy said that WI is not taking any opposition lightly in this highly-competitive event, with only two World Cup spots up for grabs. “Yeah, I guess [in] the first match against the USA, we got the ‘W’ that we wanted, which was the win. Great start to the tournament, but we have so much left in the tank. The guys came out and you could see they were not happy with the way they played, which is a good sign for us. We keep challenging ourselves and yeah in the end we have a few things we have to continue. But it is a work in progress – trying to find the identity of our cricket moving forward,” he said. “But, yeah, I was pleased with the victory. You come [up] against Nepal, a team who is on the rise and they have been playing some good cricket, so again we respect all our oppositions, but we focus on the things that we want to do as a team and focus on the brand of cricket we want to play. And it all boils down to our preparation, which we have been doing well and then on game day the execution. I have full confidence and belief in the boys – or men rather – that they will go out and do themselves and the region proud,” he concluded. (ANI)","pubDate":"2023-06-21 18:34:23","image_url":null,"source_id":"thenewsmill","category":["sports"],"country":["india"],"language":"english"},{"title":"CWC Qualifiers: Need to carry on with this confidence against Sri Lanka, Scotland, says Oman skipper Zeeshan after win over UAE","link":"https://thenewsmill.com/2023/06/cwc-qualifiers-need-to-carry-on-with-this-confidence-against-sri-lanka-scotland-says-oman-skipper-zeeshan-after-win-over-uae/","keywords":["Cricket","Sports","ANI"],"creator":["ANI"],"video_url":null,"description":"The News Mill","content":"After a five-wicket win over UAE in their ICC Cricket World Cup 2023 qualifier match, Oman captain Zeeshan Maqsood lauded his team for their performances and added that they need to carry with the confidence received from wins in their matches against Sri Lanka and Scotland. Three half-centuries from Aqib Ilyas, Shoaib Khan and Mohammad Nadeem helped Oman clinch their second successive victory in their ICC Cricket World Cup 2023 qualifier match against UAE by five wickets in Bulawayo on Wednesday. “The way the boys are playing, we are happy. They are putting so much in all departments, our preparation has been great, players are taking responsibility and that has been the key. The way Aqib and Shoaib batted was key. Later on Ayaan and Nadeem played well. When Shoaib came off and I played a bad shot, there was pressure. But on that track, if you get set bowlers cannot get you out. We have games against Sri Lanka and Scotland, we need to play well and carry that confidence forward,” said Zeeshan in a post-match presentation. Coming to the match, UAE posted 227/8 in their 50 overs after being put to bat first by Oman. Aayan Khan hit a brilliant half-century, scoring 58* in 52 balls. Also, Vriitya Aravind (49 in 84 balls) and Rameez Shahzad (38 in 51 balls) put on an 87-run stand for the third wicket after UAE was reduced to 16/2. Jay Odedra (3/31) was the pick of the bowlers for Oman. In the chase of 228, Oman was restricted to 14/2. But later, half-centuries from Aqib Ilyas (53), Shoaib Khan (52*) and Mohammad Nadeem (50*) helped Oman chase down the target with four overs and five wickets in hand. Junaid Siddique (2/31) was the standout bowler for UAE. Shoaib was given the ‘Man of the Match’ award for his fifty. Oman is at the top of the Group B point table with two wins in two matches and a total of four points. On the other hand, UAE is at the bottom with two losses in two games, with zero points. (ANI)","pubDate":"2023-06-21 18:34:10","image_url":null,"source_id":"thenewsmill","category":["sports"],"country":["india"],"language":"english"},{"title":"पीसीबी चीफ बनने से पहले ही जका अशरफ ने दिखाई अकड़, एशिया कप पर फिर लटकी तलवार","link":"https://navbharattimes.indiatimes.com/sports/cricket/cricket-news/possible-pcb-chairman-zaka-ashraf-rejects-hybrid-model-of-asia-cup/articleshow/101171543.cms","keywords":null,"creator":null,"video_url":null,"description":"एशिया कप 2023 की मेजबानी पर मथा पच्ची कम नहीं हुई है। नजम सेठी के बाद पीसीबी के संभावित अगले अध्यक्ष जका अशरफ ने हाइब्रिड मॉडल को ठुकरा दिया। जका अशरफ के इस फैसले से एक बार फिर एशिया कप को लेकर पेंच फंस गया है।","content":"पाकिस्तान क्रिकेट बोर्ड के संभावित अगले अध्यक्ष जका अशरफ ने पाकिस्तान और श्रीलंका में सितंबर को होने वाले आगामी एशिया कप के लिए नजम सेठी के ‘हाइब्रिड मॉडल’ को ठुकरा दिया है। अशरफ ने इस्लामाबाद में बुधवार को एक प्रेस कांफ्रेंस में कहा, 'पहली बात तो यह है कि मैं पहले भी एशिया कप के हाइब्रिड मॉडल को खारिज कर चुका हूं क्योंकि मैं इससे सहमत नहीं हूं। एशियाई क्रिकेट परिषद के बोर्ड ने फैसला किया था कि यह टूर्नामेंट पाकिस्तान में होगा तो यहीं होना चाहिए।' अशरफ के इस बयान के बाद भारत में इस साल के आखिर में होने वाले वनडे विश्व कप में पाकिस्तान की भागीदारी भी खटाई में पड़ गई है। समझा जाता है कि पाकिस्तान के सहमति जताने के बाद पीछे हटने से बीसीसीआई भी कड़ा रूख अपना सकता है। एसीसी के कार्यकारी बोर्ड ने हाइब्रिड मॉडल को मंजूरी दी है। अशरफ अगर अपना रूख नहीं बदलते हैं तो एशिया कप पाकिस्तान के बिना ही खेला जा सकता है। एसीसी बोर्ड के एक सदस्य ने कहा, 'एशिया कप मॉडल को एसीसी ने स्वीकार किया है और इसमें कोई बदलाव नहीं होगा। अशरफ जो चाहे, वह कहने के लिये स्वतंत्र हैं।' पाकिस्तान के प्रधानमंत्री शाहबाज शरीफ के करीबी अशरफ का पीसीबी अध्यक्ष बनना तय है चूंकि प्रधानमंत्री ही बोर्ड का मुख्य संरक्षक भी है और नियुक्तियां उनकी मर्जी से ही होती है। हाइब्रिड मॉडल को बीसीसीआई सचिव जय शाह की अध्यक्षता वाली एसीसी ने स्वीकार किया था।भारत ने साफ तौर पर कहा था कि वह पाकिस्तान खेलने नहीं जायेगा। सेठी के अध्यक्ष पद से हटते ही 48 घंटे में हालात बदल गए। सेठी ने कहा था कि वह आसिफ जरदारी और शाहबाज शरीफ के बीच मतभेद का कारण नहीं बनना चाहते और इसी वजह से अध्यक्ष पद की दौड़ से हट रहे हैं। अशरफ ने प्रेस कांफ्रेंस में कहा कि वह नहीं चाहते कि बेमानी मैच पाकिस्तान में कराये जाएं। उन्होंने कहा, 'सभी मुख्य मैच पाकिस्तान से बाहर होंगे । नेपाल और भूटान जैसी टीमें पाकिस्तान में खेलेंगे जो गलत है। मुझे नहीं पता कि बोर्ड ने पहले किस पर मंजूरी दी। मैं देखता हूं कि इतने कम समय में क्या हो सकता है। हम वही करेंगे जो पाकिस्तान के लिये बेहतर हो।’ उन्होंने यह भी कहा कि विश्व कप का मसला अभी हल नहीं हुआ है जिसके मायने हैं कि कार्यक्रम जारी करने में अभी और विलंब होगा। उन्होंने कहा, 'पाकिस्तान के सामने चुनौतियां है। कई लंबित मसले हैं। एशिया कप है और फिर विश्व कप है । मैं किसी के खिलाफ नहीं बोलना चाहता क्योंकि अभी मैने पद नहीं संभाला है। पद संभालने के बाद देखते हैं कि क्या हालात है।","pubDate":"2023-06-21 18:18:57","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"}]}