{"newsArray":[{"title":"Injury restricting Perry to batting only","link":"https://www.perthnow.com.au/sport/commonwealth-games/injury-restricting-perry-to-batting-only-c-6866942","keywords":null,"creator":["Roger Vaughan"],"video_url":null,"description":"A lower back stress fracture means Australian cricket star Ellyse Perry has been selected as a batter only for now ahead of the Commonwealth Games.","content":"A lower back stress fracture is restricting Australian cricket star Ellyse Perry to batting only ahead of the Commonwealth Games. Perry has been named in the powerful 15-player national squad for Birmingham, where women's T20 will make its Games debut. But Cricket Australia has revealed the all-rounder is nursing the injury and it's unclear for now whether she will bowl during their tour. Australia will play a T20 series against Ireland and Pakistan in Derry from July 16-23 before the Commonwealth Games. Their first Games match will be against India on July 29. \"Ellyse is recovering from a stress fracture in her lower back and is expected to play as a batter,\" team physiotherapist Kate Beerworth said. \"Her availability to bowl will be dependent on her progress in the coming weeks and on the medical advice.\" By competing at a Commonwealth Games, Perry will add to her unique sporting resume. The 31-year-old is the only Australian to have played in a cricket and a soccer World Cup, the latter in 2011 in Germany. Perry is part of the same 15-player squad that dominated the one-day World Cup earlier this year in New Zealand. The one change is the coach - Matthew Mott has left for the head role with the England men's one-day team. Assistant Shelley Nitschke will be the interim women's head coach at the Games. Australia also hold the Ashes and are the reigning T20 world champions. They will start the Games as the overwhelming gold medal favourites and will face Barbados, India and Pakistan in Group A pool matches. Group B features England, New Zealand, India and Sri Lanka, with the top two teams from the pools progressing to the semi-finals.. It will be the second time that cricket has been played at the Games - Steve Waugh's 50-over team won the silver medal at Kuala Lumpur in 1998. While Australia will be the team to beat at the Games, they are yet to win at Edgbaston. The women have lost their two Tests and sole one-day international at the ground. Squad: Meg Lanning captain, Rachael Haynes vice captain, Darcie Brown, Nicola Carey, Ashleigh Gardner, Grace Harris, Alyssa Healy, Jess Jonassen, Alana King, Tahlia McGrath, Beth Mooney, Ellyse Perry, Megan Schutt, Annabel Sutherland, Amanda-Jade Wellington.","pubDate":"2022-05-19 21:47:14","image_url":"https://images.perthnow.com.au/publication/C-6866942/ed542ed24e31baeb669f28c1ea727b99f3495b5d-16x9-x0y0w1280h720.jpg","source_id":"perthnow","country":["australia"],"category":["sports"],"language":"english"},{"title":"Jos Buttler vs CSK stats and last 5 innings list: Jos Buttler IPL record Brabourne Stadium","link":"https://thesportsrush.com/cricket-news-jos-buttler-vs-csk-stats-and-last-5-innings-list-jos-buttler-ipl-record-brabourne-stadium/","keywords":["Cricket","CSK","IPL 2022","Rajasthan Royals","chennai super kings","csk","Indian Premier League","Jos Buttler","rajasthan royals","RR"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Jos Buttler vs CSK: The highest run-scorer of this season had been dismissed for single-digit scores in his last two innings. The 68th match of the ongoing 15th season of the Indian Premier League will be played between Rajasthan Royals and Chennai Super Kings at the Brabourne Stadium on Friday. All but qualified for the… The post Jos Buttler vs CSK stats and last 5 innings list: Jos Buttler IPL record Brabourne Stadium appeared first on The SportsRush.","content":"Jos Buttler vs CSK: The highest run-scorer of this season had been dismissed for single-digit scores in his last two innings. The 68th match of the ongoing 15th season of the Indian Premier League will be played between Rajasthan Royals and Chennai Super Kings at the Brabourne Stadium on Friday. All but qualified for the playoffs this season, Rajasthan would be looking for a victory in a bid to finish as the second-ranked team on the points table. Out of contention in the playoffs race, defending champions Chennai would want to end on a winning note in what has been a forgettable season for them. Ticking off the Shot-list ✅ #Yellove #WhistlePodu 🦁💛 pic.twitter.com/8s627ysFH9 — Chennai Super Kings (@ChennaiIPL) May 19, 2022 Royals, who have won four (including two this season) and lost two out of their six matches at this venue, have maintained an impressive record over the years. Super Kings, on the other hand, have won one and lost three (including two this season) out of their four matches here. Highest run-scorer of the season, RR opening batter Jos Buttler will once again allure eyeballs especially after returning with single-digit scores in his last two matches. In what is his best-ever IPL season , Buttler would want to end the league stage with another impact-generating performance against an opposition he has done well against in the past. In six matches across four seasons against CSK, Buttler has scored 265 runs at an average of 66.25 and a strike rate of 149.72 including a couple of half-centuries. Buttler’s best against Chennai was 95* (60) in Jaipur four years ago. As far as the Cricket Club of India is concerned, Buttler has scored 105 runs across two innings which includes a century against Kolkata Knight Riders just over a month ago.","pubDate":"2022-05-19 20:39:27","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Cricket-Kohli knock keeps Bangalore&#039;s IPL playoff hopes alive","link":"https://www.thestar.com.my/sport/cricket/2022/05/20/cricket-kohli-knock-keeps-bangalore039s-ipl-playoff-hopes-alive","keywords":null,"creator":null,"video_url":null,"description":"(Reuters) - Virat Kohli rediscovered his scoring touch to smash 73 off 54 balls and lead Royal Challengers Bangalore to an eight-wicket win over table toppers Gujarat Titans on Thursday, keeping his side's playoff hopes alive. Read full story","content":null,"pubDate":"2022-05-19 19:05:00","image_url":"https://apicms.thestar.com.my/uploads/images/2022/05/20/1591361.jpg","source_id":"thestar_my","country":["malaysia"],"category":["sports"],"language":"english"},{"title":"I'm actually in happiest phase of my life, says out-of-form Kohli","link":"https://www.thehansindia.com/sports/cricket/im-actually-in-happiest-phase-of-my-life-says-out-of-form-kohli-743807","keywords":["Sports,Today NewsPaper,Cricket"],"creator":["The Hans India"],"video_url":null,"description":"In a declaration that is not commensurate with his current form, Virat Kohli says he is \"actually\" going through the \"happiest phase\" of his life, when he is not receptive to either success or failure.","content":"Virat Kohli Mumbai: In a declaration that is not commensurate with his current form, Virat Kohli says he is \"actually\" going through the \"happiest phase\" of his life, when he is not receptive to either success or failure. He is \"not finding any self-worth or value\" in what he is doing on the field now, a far cry from the man known for his intensity and passion, things that made him a cricket icon, besides his incredible range of shots with the bat in his pomp. Kohli has not scored a hundred in competitive cricket for nearly three years and current edition of IPL happens to be his worst. \"I'm actually in the happiest phase of my life. I am not finding any self-worth or value in what I do on the field. I'm way past that phase. This is a phase of evolution for me,\" Kohli told Star Sports. The former India skipper, who also gave up captaincy at Royal Challengers Bangalore last year, is enduring his worst run with the bat, leaving his millions of fans concerned. He has had a disappointing IPL-15 so far with the bat having managed only one half-century in 13 matches for RCB. Kohli has bagged three golden ducks already this season and has managed just 200 runs at an average and strike rate that fail to define a player of his calibre. At the same time though, the 33-year-old refuses to believe that the drive is not there. \"... Not to say that I don't have the same drive, my drive will never die down. The day my drive goes away, I'll not be playing this game. \"But to understand that some things are not controllable, the only controllable you have are things that you can work towards, which is working hard on the field and in life as well and from that point of view, I feel that I am in the most balanced space that I have ever been and I am happy with who I am and how I am leading my life.\" For Kohli, on-field success or failure is increasingly becoming irrelevant. \"I am not finding any source of encouragement or disappointment by what happens on the field. \"So, this has not been about myself, this is about the fact that I have not contributed to my team's cause as much as I would have wanted to or I pride myself to, and that is something that always disappoints me, not what I do as an individual. \"It's because I don't want to let my team down.\" Kohli's remarks are not in consonance with how the cricket world -- including his million fans -- is feeling for quite sometime now. The lack of runs from the modern great has been a cause of concern for fans and experts, with few including former India head coach Ravi Shastri imploring the cricketer to take a break from the game. Regarded as one of the most prolific batters in modern day cricket, Kohli's last century in international cricket came way back in 2019. Since then, he has mostly struggled, and his failure to inspire his teams to title triumphs culminated in him stepping down from RCB and India's T20 captaincy and losing the post in the Test team. Speaking about his transition from a captain to a player, Kohli said, \"To be honest, it's different. I won't say it's hard because it's something that you're involved in regularly. \"So, the good thing is that my relationship with Faf (current RCB skipper Faf du Plessis) has always been good. We also have a leadership group in the team where we all share our inputs. \"Even on the field, when Faf is on the outfield and I am inside, I make sure to look after the fielding angles and the placement, so he's given me the liberty to adjust wherever I feel that there's a need, but always keeping him in the loop obviously. \"So, it's been a different way to look at the game, but because I've done it so much in the past, it's not something that I don't know how to do.\"","pubDate":"2022-05-19 18:25:06","image_url":"https://assets.thehansindia.com/h-upload/2022/05/19/500x300_1293183-kohli.jpg","source_id":"thehansindia","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL 2022: Virat Kohli Finds Form As Royal Challengers Bangalore Beat Gujarat Titans To Stay In Play-.. - NDTV Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMiggFodHRwczovL3Nwb3J0cy5uZHR2LmNvbS9pcGwtMjAyMi9pbmRpYW4tcHJlbWllci1sZWFndWUtMjAyMi12aXJhdC1rb2hsaS1maW5kcy1mb3JtLWFzLXJjYi1iZWF0LWd0LXRvLXN0YXktaW4tcGxheS1vZmYtcmFjZS0yOTkyMDIy0gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"IPL 2022: Virat Kohli Finds Form As Royal Challengers Bangalore Beat Gujarat Titans To Stay In Play-..  NDTV SportsRCB vs GT, Preview: Road to Playoff | Game Day  Royal Challengers BangaloreLive Cricket Score - RCB vs GT, Match 67, IPL 2022 | Cricbuzz.com - Cricbuzz  CricbuzzRCB vs GT IPL 2022 Highlights: Royal Challengers Bangalore Beat Gujarat Titans By 8 Wickets  News18RCB vs GT: Everything you need to know | IPL 2022 | 12th Man TV  Royal Challengers BangaloreView Full coverage on Google News","content":null,"pubDate":"2022-05-19 18:02:54","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL 2022 Live Score RCB vs GT: Kohli roars back to form as RCB win by 8 wickets - Hindustan Times","link":"https://news.google.com/__i/rss/rd/articles/CBMikwFodHRwczovL3d3dy5oaW5kdXN0YW50aW1lcy5jb20vY3JpY2tldC9yY2ItdnMtZ3QtaXBsLTIwMjItbGl2ZS1zY29yZS1yb3lhbC1jaGFsbGVuZ2Vycy1iYW5nYWxvcmUtdnMtZ3VqYXJhdC10aXRhbnMtdG9kYXktbWF0Y2gtMTAxNjUyOTU2MDA2NDY3Lmh0bWzSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"IPL 2022 Live Score RCB vs GT: Kohli roars back to form as RCB win by 8 wickets  Hindustan TimesRCB vs GT, Preview: Road to Playoff | Game Day  Royal Challengers BangaloreRCB vs GT IPL 2022 Highlights: Royal Challengers Bangalore Beat Gujarat Titans By 8 Wickets  News18Live Cricket Score - RCB vs GT, Match 67, IPL 2022 | Cricbuzz.com - Cricbuzz  CricbuzzRCB vs GT: Everything you need to know | IPL 2022 | 12th Man TV  Royal Challengers BangaloreView Full coverage on Google News","content":null,"pubDate":"2022-05-19 17:52:29","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"McCullum believes England revival will benefit Test cricket","link":"https://sportstar.thehindu.com/cricket/mccullum-believes-england-revival-will-benefit-test-cricket/article38495220.ece","keywords":null,"creator":["AFP"],"video_url":null,"description":"Brendon McCullum will take charge of an England side that has won just one of its past 17 Tests.","content":"Newly-appointed England Test coach Brendon McCullum says improving the team's flagging fortunes will also help secure the red-ball game's international future. The former New Zealand captain will take charge of an England side that has won just one of its past 17 Tests, with fans hoping his partnership with new skipper Ben Stokes proves the catalyst for a revival. English cricket chiefs are banking on McCullum, a noted limited overs as well as Test cricketer, transferring the qualities that made him a dynamic batsman and attacking leader into his first coaching job in red-ball cricket. RELATED | England recalls Broad, Anderson for NZ Tests The 40-year-old knows something about starting in difficult circumstances -- in his first Test as New Zealand captain his team was bowled out for just 45 by South Africa at Cape Town in 2013. But after that match McCullum held a \"ground zero\" meeting with then head coach Mike Hesson and other support staff, now widely seen as the start of New Zealand's ascent to its current status as world Test champion. \"Test cricket has always been the pinnacle for me and maybe the popularity of it has somehow trended south of late,\" McCullum said in an interview with the England and Wales Cricket Board's media channels. \"If red-ball cricket is to not just sustain but to thrive, it needs England to be playing an attractive brand of Test cricket, which is competing with Australia, India, New Zealand.\" \"It's a big, lofty goal but it's what is in front of us,\" added McCullum, a huge influence on the leadership style of 2019 England World Cup-winning captain Eoin Morgan, a close friend. McCullum, whose opening assignment as England's Test coach will be a three-match series against his native New Zealand, starting at Lord's on June 2, said his aim was to get England back to the \"top of the pile\". England managing director Rob Key said on Wednesday that the new coach has more to him than playing crowd-pleasing cricket, adding that McCullum also values players who can demonstrate resilience in the longer format. McCullum promised England supporters their team would be one \"worth following\" if he and the similarly minded Stokes achieved their ambitions. \"Hopefully we can play that kind of entertaining -- I won't say cavalier, because that's probably what other people expect us to do -- cricket. \"It's a pretty simple philosophy but if we get that right, with the talent that exists in the English cricket set-up, hopefully we'll get results to go in the right direction and build something together.\"","pubDate":"2022-05-19 17:33:59","image_url":null,"source_id":"sportstar","country":["india"],"category":["sports"],"language":"english"},{"title":"Brendon McCullum believes England revival will benefit Test cricket","link":"https://www.iol.co.za/sport/cricket/international/brendon-mccullum-believes-england-revival-will-benefit-test-cricket-9cf64528-569b-4c2c-aaf5-7c96918027f2","keywords":null,"creator":["AFP"],"video_url":null,"description":"Newly-appointed England Test coach Brendon McCullum says improving the team's flagging fortunes will also help secure the red-ball game's international future.","content":null,"pubDate":"2022-05-19 17:07:33","image_url":"https://image-prod.iol.co.za/16x9/800?source=https://xlibris.public.prod.oc.inl.infomaker.io:8443/opencontent/objects/9d016b92-88d4-5a05-9efd-e7e10dcdd9fd&operation=CROP&offset=0x150&resize=5000x2809","source_id":"iol","country":["south africa"],"category":["sports"],"language":"english"},{"title":"RCB vs GT Live Cricket Score IPL 2022 Latest Updates: Virat Kohli, Faf du Plessis Provide Superb Start to RCB's Chase - News18","link":"https://news.google.com/__i/rss/rd/articles/CBMi5QFodHRwczovL3d3dy5uZXdzMTguY29tL2NyaWNrZXRuZXh0L25ld3MvbGl2ZS1jcmlja2V0LXNjb3JlLXJjYi12cy1ndC1pcGwtMjAyMi1sYXRlc3QtdXBkYXRlcy1yb3lhbC1jaGFsbGVuZ2Vycy1iYW5nYWxvcmUtdnMtZ3VqYXJhdC10aXRhbnMtbGl2ZS1zdHJlYW1pbmctaW5kaWFuLXByZW1pZXItbGVhZ3VlLWhpZ2hsaWdodHMtdG9kYXktbWF0Y2gtY292ZXJhZ2UtbGl2ZW5ld3MtNTIwNjU1NS5odG1s0gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"RCB vs GT Live Cricket Score IPL 2022 Latest Updates: Virat Kohli, Faf du Plessis Provide Superb Start to RCB's Chase  News18RCB vs GT, Preview: Road to Playoff | Game Day  Royal Challengers BangaloreRCB vs GT Dream11 Prediction Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update- Tata IPL 2022  Cricket AddictorMatch Preview - Titans vs RCB, Indian Premier League 2022, 67th Match  ESPNcricinfoRCB vs GT: Everything you need to know | IPL 2022 | 12th Man TV  Royal Challengers BangaloreView Full coverage on Google News","content":null,"pubDate":"2022-05-19 16:42:36","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL 2022 RCB vs GT Live Score Updates: Gujarat post 168/5 against Bangalore - The Indian Express","link":"https://news.google.com/__i/rss/rd/articles/CBMiW2h0dHBzOi8vaW5kaWFuZXhwcmVzcy5jb20vYXJ0aWNsZS9zcG9ydHMvaXBsL2lwbC0yMDIyLXJjYi12cy1ndC1saXZlLXNjb3JlLXVwZGF0ZXMtNzkyNTUzNi_SAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"IPL 2022 RCB vs GT Live Score Updates: Gujarat post 168/5 against Bangalore  The Indian ExpressRCB vs GT, Preview: Road to Playoff | Game Day  Royal Challengers BangaloreMatch Preview - Titans vs RCB, Indian Premier League 2022, 67th Match  ESPNcricinfoRCB vs GT Dream11 Prediction Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update- Tata IPL 2022  Cricket AddictorRCB vs GT: Everything you need to know | IPL 2022 | 12th Man TV  Royal Challengers BangaloreView Full coverage on Google News","content":null,"pubDate":"2022-05-19 15:50:56","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Royal Challengers Bangalore vs Gujarat Titans: IPL 2022 Live Cricket Score, Live Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/royal-challengers-bangalore-vs-gujarat-titans-live-score-over-match-67-t20-11-15-updates-2991408","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Royal Challengers Bangalore vs Gujarat Titans from Wankhede Stadium, Mumbai. Check commentary and full scoreboard of the match.","content":"A dedicated team of experts bring you live score, live cricket score, live match update on Sports.NDTV.com . After 15.2 overs, Gujarat Titans are 119/3. The live updates of Royal Challengers Bangalore vs Gujarat Titans scorecard is also available. It is the perfect platform to follow your favourite teams in Indian Premier League 2022. Keep a track on your favourite batsmen and bowlers through Indian Premier League 2022 today match, ball by ball commentary, Royal Challengers Bangalore vs Gujarat Titans, Royal Challengers Bangalore vs Gujarat Titans live score, Royal Challengers Bangalore vs Gujarat Titans scorecard. Follow the excitement of the Indian Premier League 2022 on Sports.NDTV.com as you can follow live match updates and live cricket score through our platform. 14.6 overs (1 Run) Drops it short and outside off, David slaps it to deep cover for a single. 9 runs off the over. 14.5 overs (6 Runs) SIX! BANG! Tossed up, in the slot. Miller gets low and heaves it all the way over long on for a biggie. The stand crosses the 50-run mark now. 14.4 overs (0 Run) Shorter and across, outside off. Miller leaves it alone. Was well inside the tramline. 14.3 overs (1 Run) Wide of off and this is hit to deep cover for a single. 14.2 overs (1 Run) Angling on the pads. Miller opens his body and pulls it to deep mid-wicket for a single. 14.1 overs (0 Run) Flatter, slower through the air and outside off. Miller looks to push but misses. Shahbaz Ahmed is back on. Harshal Patel is still off the field after he hurt his webbing while fielding in the 13th over. It remains to be seen whether he will bowl or not in this innings. He is a crucial part of Bangalore's plans in the death overs and they would like to see him on the field. 13.6 overs (1 Run) Angled into middle and leg, pushed down to long on for a single. 18 runs off the over. 13.6 overs (1 Run) WIDE! Maxwell spills this one well down the leg side and Miller almost falls over. Wide called. 13.5 overs (6 Runs) SIX! Back-to-back from David Miller! Maxwell just rushes through this delivery and drags it down on leg stump. Miller goes deep in his crease and muscles it over the mid-wicket fence for another biggie. 13.4 overs (6 Runs) SIX! Easy power from David Miller and it might just be time for him to flex his muscles. In the slot around off, Miller just swings through the line and smokes it a long way over the long off fence. 13.3 overs (0 Run) Well stopped! On off, driven hard but can't find the gap through the cover-region. 13.2 overs (3 Runs) Deft touch from Hardik Pandya! Flatter and turning in from around off, Pandya waits for it and at the last moment opens the face of the bat. Siddarth Kaul chases it from short third man and just manages to pull it inside the ropes. Three taken. 13.1 overs (1 Run) Short and outside off, Miller mistimes the cut shot to the man at deep cover and picks up a single. 12.6 overs (0 Run) On off and skidding through, Pandya leans in and blocks it out. 12.5 overs (1 Run) Around leg stump, tucked away in front of square on the leg side for a run. 12.4 overs (2 Runs) This is down the leg side and spinning further down but Miller gets cramped for room. He muscles it into the gap between long on and deep mid-wicket for a couple of runs. 12.3 overs (0 Run) Quicker this time, on off and just skidding through. Miller taps it to the man at cover-point. 12.2 overs (1 Run) Shorter this time and this is hit off the back foot towards the cover fence for one more. 12.1 overs (1 Run) On a length, around leg and turning into the left-hander. Miller backs away and pulls it towards cow corner for a single. 11.6 overs (4 Runs) FOUR! Kaul bowls another slower delivery but bowls it wide. Pandya waits for it and thumps it towards deep point. The fielder from the cover fence runs around but can't cut it off. A much-needed boundary for Gujarat. 11.5 overs (1 Run) Much better over this so far from Siddarth Kaul. Nails the wide yorker and Miller can only jam it out on the off side for a single. 11.4 overs (0 Run) Nicely bowled! Length, around middle and just a bit slower in pace. Miller waits for it and nudges it down towards short third man. Gujarat need to pick up the scoring rate now if they are to get to a defendable total. 11.3 overs (1 Run) Attempted yorker, turns out to be a low full toss on off. Pandya gets it towards deep mid-wicket and rotates the strike. 11.2 overs (1 Run) Slower delivery, on middle. Miller looks to drive but gets it off the inner half of the bat towards square leg. Single taken. 11.1 overs (1 Run) Length ball, outside off. This is punched away towards wide long off for just a single. Siddarth Kaul is back on. He went for 14 runs in his first over. 10.6 overs (1 Run) Flatter, around off. Pandya drives it down to long off for a single. 10.5 overs (4 Runs) FOUR! Nicely bowled but it produces a boundary. Fuller and on off, this one turns away after pitching. Pandya looks to defend but the ball goes off the outside edge and runs away very fine into the third man fence. 10.4 overs (0 Run) Three dots in a row now! On middle, worked away towards mid-wicket. 10.3 overs (0 Run) Flatter and quicker, around off. Pandya cuts hard but can't pierce the gap around point. 10.2 overs (0 Run) Hasaranga bowls this one with a very low-arm action and pushes it on off stump. Pandya pushes it back to the bowler. 10.1 overs (1 Run) Flatter delivery, around middle and leg. Miller eases it off the back foot towards long on for a run.","pubDate":"2022-05-19 15:03:43","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637885892129485862.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"“What a catch by Maxwell”: Glenn Maxwell’s one-handed stunner to dismiss Shubman Gill enthralls fans","link":"https://thesportsrush.com/cricket-news-what-a-catch-by-maxwell-glenn-maxwells-one-handed-stunner-to-dismiss-shubman-gill-enthralls-fans/","keywords":["Cricket","Gujarat Titans","IPL 2022","RCB","Videos","Glenn Maxwell","GT","Indian Premier League","Josh Hazlewood","Royal Challengers Bangalore","Shubman Gill"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Glenn Maxwell’s one-handed stunner: The all-rounder from Royal Challengers Bangalore grabbed a magnificent catch at the Wankhede Stadium. During the 67th match of the ongoing 15th season of the Indian Premier League between Royal Challengers Bangalore and Gujarat Titans at the Wankhede Stadium, Royal Challengers Bangalore fast bowler Josh Hazlewood drew first blood in his… The post “What a catch by Maxwell”: Glenn Maxwell’s one-handed stunner to dismiss Shubman Gill enthralls fans appeared first on The SportsRush.","content":"Glenn Maxwell’s one-handed stunner: The all-rounder from Royal Challengers Bangalore grabbed a magnificent catch at the Wankhede Stadium. During the 67th match of the ongoing 15th season of the Indian Premier League between Royal Challengers Bangalore and Gujarat Titans at the Wankhede Stadium, Royal Challengers Bangalore fast bowler Josh Hazlewood drew first blood in his first over to hand his team with an early advantage. In what was Hazlewood’s 100th T20 wicket, it wouldn’t have been possible without his Australian teammate Glenn Maxwell’s mind-blowing fielding effort in the slips. While his opening partner Wriddhiman Saha was among the boundaries from the first over itself, Gujarat Titans opening batter Shubman Gill (1) failed to find any momentum during his four-ball stay tonight. Gill, who played a Hazlewood out-swinging delivery with hard hands, would’ve initially thought of a single towards the third-man. However, a lone slip in Maxwell dived towards his right to grab a one-handed stunner whilst being airborne. With Royal Challengers captain Faf du Plessis bringing a slip for Gill on a delivery before the dismissal, Maxwell’s brilliance justified his captain’s thinking. Earlier, it was Titans captain Hardik Pandya who won the toss and chose to bat. While GT have already qualified for IPL 2022 playoffs, RCB are playing a must-win match in a bid to qualify for the next round. Again a great catch @Gmaxi_32 #Maxwell #GTvRCB #RCBvGT #RCBvsGT #GTvsRCB #GT #RCB #IPL2022 #IPL pic.twitter.com/K4xIbuOjHb — Abhishek Vijay ( [email protected] ) (@Abhi_newsanchor) May 19, 2022 What a catch by MAXWELL! #RCBvsGT #RCBvGT — Sushant Mehta (@SushantNMehta) May 19, 2022 WHAT A CATCH taken by Glenn Maxwell. Unbelievable catch. — CricketMAN2 (@ImTanujSingh) May 19, 2022 Virat Kohli’s reaction and celebration when Glenn Maxwell takes a Outstanding catch. pic.twitter.com/qS1rJjnRCy — Kohlicaptain (@Kohlicaptain_) May 19, 2022 Maxii You Beauty ❤️ What a Catch @_MAXWELL_ #RCBvGT #RCB #IPL2022 #GT @RCBTweets pic.twitter.com/YbEHD41dFH —  (@its_krishan_) May 19, 2022 Awesome catch by #Maxwell ⚡⚡ #RCBvGT pic.twitter.com/3EzMJ1AJUY — Jeetendra (@Jeetendra0908) May 19, 2022 For more cricket-related news, click here .","pubDate":"2022-05-19 14:35:16","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"McCullum hopes ‘attractive brand of Test cricket’ can see red-ball game thrive","link":"https://www.belfasttelegraph.co.uk/sport/cricket/mccullum-hopes-attractive-brand-of-test-cricket-can-see-red-ball-game-thrive-41667356.html","keywords":["Cricket"],"creator":null,"video_url":null,"description":"Brendon McCullum believes his goal of transforming the fortunes of England’s Test side as head coach can help safeguard the future of the format.","content":null,"pubDate":"2022-05-19 14:31:46","image_url":"https://www.belfasttelegraph.co.uk/sport/cricket/7f166/41667353.ece/AUTOCROP/w1240h700/bpanews_35e217d8-11d3-4d2e-a366-fea0037f169f_1","source_id":"belfasttelegraph","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"“Probably the best team man I’ve ever played with”: Shane Watson calls Andrew Symonds the best team man he ever played with","link":"https://thesportsrush.com/cricket-news-probably-the-best-team-man-ive-ever-played-with-shane-watson-calls-andrew-symonds-the-best-team-man-he-ever-played-with/","keywords":["Cricket","Andrew Symonds","Shane Watson"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"Shane Watson, the assistant coach of Delhi Capitals has called Andrew Symonds as the best team man he ever played with. The year 2022 has not been great for Australian cricket. Shane Warne and Rod Marsh passed away earlier this year, whereas the recent passing away of Andrew Symonds has shaken the whole cricketing fraternity.… The post “Probably the best team man I’ve ever played with”: Shane Watson calls Andrew Symonds the best team man he ever played with appeared first on The SportsRush.","content":"Shane Watson, the assistant coach of Delhi Capitals has called Andrew Symonds as the best team man he ever played with. The year 2022 has not been great for Australian cricket. Shane Warne and Rod Marsh passed away earlier this year, whereas the recent passing away of Andrew Symonds has shaken the whole cricketing fraternity. Andrew Symonds, who was popularly known as Roy passed away in a car accident in Townsville. Symonds won two ICC World Cups with Australia in 2003 and 2007, and he was one of the best ever white-ball all-rounders of the Australian cricket team. Symonds, who was born in the UK was adopted by a British pair, and they took him to Australia when he was just three months old. Andrew Symonds was often involved in quite a few controversies, but his stats spoke for himself. Shane Watson calls Andrew Symonds the best team man Delhi Capitals’ assistant coach Shane Watson gave an interview to NDTV, where he talked about the death of Shane Warne, Rod Marsh and Andrew Symonds. Watson said that Rod Marsh and Shane Warne had the biggest influence on his life. He called the death of Andrew Symonds heartbreaking. “Yeah, it’s been a tough couple of months to lose Rod Marsh and Shane Warne, who have been two of the biggest influences in my life, not just my career,” Watson said. “To lose those two incredible people was just so sad and tragic, now the news of Andrew Symonds passing away is just heartbreaking.” #NDTVExclusive | “Andrew Symonds was probably the best team man I ever played with”: Shane Watson (@ShaneRWatson33), Assistant Coach, Delhi Capitals pic.twitter.com/rnANSE8UI7 — NDTV (@ndtv) May 19, 2022 Shane Watson called Andrew Symonds the best team man he ever played with. He also said that he will never gonna get over the fact that Andrew Symonds is no more. “We are just not gonna get over this because he (Symonds) was probably the best team man I’ve ever played with,” Shane Watson added. “He always had your back, he was great fun, he also made sure that if people were a little bit out of line, he’ll bring them on the line.” The post “Probably the best team man I’ve ever played with”: Shane Watson calls Andrew Symonds the best team man he ever played with appeared first on The SportsRush.","pubDate":"2022-05-19 14:28:33","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Former MCC chief: I was snubbed for ECB chairman role for being 'too establishment'","link":"https://uk.sports.yahoo.com/news/former-mcc-chief-launches-bid-142347901.html?src=rss","keywords":["Business"],"creator":["The Telegraph"],"video_url":null,"description":"Gerald Corbett, the former MCC chairman, is imploring the England & Wales Cricket Board (ECB) to judge his application to be their new chair on merit after being told he was left off its shortlist earlier this year for being “too establishment”.","content":"Gerald Corbett, the former MCC chairman, is imploring the England & Wales Cricket Board (ECB) to judge his application to be their new chair on merit after being told he was left off its shortlist earlier this year for being “too establishment”.","pubDate":"2022-05-19 14:23:47","image_url":null,"source_id":"yahoo_hk","country":["hong kong"],"category":["sports"],"language":"chinese"},{"title":"As captain, Ganguly built a team; not sure if Kohli did same: Sehwag","link":"https://www.business-standard.com/article/sports/as-captain-ganguly-built-a-team-not-sure-if-kohli-did-same-sehwag-122051901176_1.html","keywords":null,"creator":null,"video_url":null,"description":"Former India batsman Virender Sehwag rates Saurav Gangulys leadership higher than anyone else in Indian cricket. Kohli as captain may remain among the best, still, he could not build a team, he said","content":null,"pubDate":"2022-05-19 14:04:00","image_url":"https://bsmedia.business-standard.com/_media/bs/img/article/default/1220519/thumb-122051901176.jpg","source_id":"business-standard","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL 2022: James Neesham Trolls Shimron Hetmyer's Bowling Video, Calls It \"Absolute Trash\" - NDTV Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMifWh0dHBzOi8vc3BvcnRzLm5kdHYuY29tL2lwbC0yMDIyL2lwbC0yMDIyLWphbWVzLW5lZXNoYW0tdHJvbGxzLXNoaW1yb24taGV0bXllcnMtYm93bGluZy12aWRlby1jYWxscy1pdC1hYnNvbHV0ZS10cmFzaC0yOTkwODI00gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"IPL 2022: James Neesham Trolls Shimron Hetmyer's Bowling Video, Calls It \"Absolute Trash\"  NDTV SportsIPL 2022 playoff scenarios explained: How RR, DC, RCB, PBKS, SRH can qualify - Firstcricket News  FirstpostRajasthan Royals vs Chennai Super Kings Match Prediction: Who Will Win The Match Between RR vs CSK? IPL 2022, Match 68, RR vs CSK  Cricket AddictorMatch Preview - Royals vs Super Kings, Indian Premier League 2022, 68th Match  ESPNcricinfoIPL 2022 Updated Points Table, Orange Cap and Purple Cap: Lucknow Super Giants enter Playoffs, Quinton de K...  Zee NewsView Full coverage on Google News","content":null,"pubDate":"2022-05-19 13:54:09","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Royal Challengers Bangalore vs Gujarat Titans Live Score Ball by Ball, IPL 2022 Live Cricket Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/royal-challengers-bangalore-vs-gujarat-titans-live-score-over-match-67-t20-1-5-updates-2991083","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Royal Challengers Bangalore vs Gujarat Titans from Wankhede Stadium, Mumbai. Check commentary and full scoreboard of the match.","content":"Follow the Indian Premier League 2022 live cricket score on Sports.NDTV.com . After 5.1 overs, Gujarat Titans are 38/1. Get live score, ball by ball commentary and much more. Keep track of Indian Premier League 2022 today match between Royal Challengers Bangalore and Gujarat Titans. Everything related to Royal Challengers Bangalore and Gujarat Titans match will be available on Sports.NDTV.com . Stay updated with Royal Challengers Bangalore vs Gujarat Titans live score. Do check for Royal Challengers Bangalore vs Gujarat Titans scorecard. You can get scorecard updates, match related facts. Get quick live updates with ads, Sports.NDTV.com , which is the perfect destination for live cricket score. 4.6 overs (1 Run) 1 run. 4.5 overs (4 Runs) FOUR! This time a misfield by Wanindu Hasaranga allows a boundary! 4.4 overs (0 Run) Back of a length, close to off. Wade looks to cut but mistimes it as he is cramped for room. 4.3 overs (6 Runs) SIX! He is taking on his Aussie teammate! Josh Hazlewood again with his test length, on off. Wade skips down the track and launches it over deep square leg for a maximum. 4.2 overs (0 Run) Goes fuller on off. Wade drives it straight to mid off. 4.1 overs (4 Runs) FOUR! Here is the first boundary for Wade and Gujarat will hope that he get's going today. Back of a length, around off. Wade stands on the back foot and pulls it through mid-wicket for a boundary. Actually it was not that short but Wade was in position early. 3.6 overs (0 Run) Width given outside off. Saha tries to cut but mistimes it to point. Just two runs off it. 3.5 overs (1 Run) A quick single as Wade nudges it to the right of mid-wicket. 3.4 overs (0 Run) On a length and on middle, tucked to mid-wicket. 3.3 overs (1 Run) Quicker one and on middle, it is hit in front of square on the leg side for a single. 3.2 overs (0 Run) Drops it short and on middle. Saha hangs back to work it to mid on. 3.1 overs (0 Run) An arm ball, sliding around off. Saha makes room and punches it to cover. Glenn Maxwell is into the attack now. 2.6 overs (0 Run) Excellent from Josh Hazlewood! Good start for him after going for runs in the previous match. Dot to end the over! On a length and on off. Wade defends off the bottom half and to the keeper. 2.5 overs (0 Run) Ripper! This is turning out to be a fabulous over from Josh! Length and angling across, outside off. Wade looks to push but pulls his bat out on time. 2.4 overs (0 Run) Touch fuller and on off. Wade blocks it on the off side. Matthew Wade walks in at number 3. 2.3 overs (0 Run) OUT! EDGED AND GONE! What a catch from Glenn Maxwell! A one-handed blinder. This is on a length and just outside off. Gill is tempted to play at it but the ball shapes away and takes the outside edge as well. Glenn Maxwell at wide first slip reacts quickly as he dives to his right, and stretches his right hand out to take a stunner. The ball sticks nicely and Bangalore have opened the wickets column. 2.2 overs (1 Run) TAP AND RUN! On a length and on off. Saha taps it in front of backward point and Gill is quick to react to Saha's call. Makes comfortably to the other side. 2.1 overs (0 Run) On a length and outside off, shaping away off the deck. Saha throws his bat at it but fails to connect. Josh Hazlewood replaces Siddarth Kaul after an expensive first over from Kaul. 1.6 overs (0 Run) A huge appeal for LBW but nothing given! Tossed up, angling around middle and leg. Gill tries to play on the leg side but gets rapped on the pads. Might be going down. 1.5 overs (0 Run) Too full and outside off. Gill pushes it back to the bowler. 1.4 overs (1 Run) Quick single! Darted on the pads, it is flicked to square leg for a sharp single. 1.3 overs (4 Runs) FOUR! Good shot! This is full and outside off. Saha kneels and drags it to sweep it past mid-wicket for a boundary. 1.2 overs (0 Run) Slightly short and around off. Saha hangs back and taps it to point. 1.1 overs (1 Run) Tossed up, on off, not much turn to start. Gill pushes it to cover. A single. Time for some spin. Shahbaz Ahmed to start from the other end. 0.6 over (4 Runs) FOUR! Classic shot from Saha and Gujarat are off to a superb start! A length ball, outside off. Saha leans and drives it through covers for a boundary. 0.5 over (0 Run) A length ball, outside off, swinging away. Saha has a feel for it but misses. 0.4 over (6 Runs) SIX! Saha is in red-hot form! Overpitched and on middle. Saha lofts it through the line and over long on for a biggie. 0.3 over (0 Run) On a length and on top of off. Saha drops it straight to point. 0.2 over (0 Run) Full and on middle. Saha works it to mid on. 0.1 over (4 Runs) FOUR! Not the best of starts from Kaul and Gujarat are underway! A half-volley, slanting on the pads. Saha flicks it to deep backward square leg for a boundary. We are all set to begin! Bangalore players have made their way out to the middle. Wriddhiman Saha and Shubman Gill are the openers for Gujarat. Saha was brilliant in the last game and Gill also seem to be in decent touch from the last few games. Siddarth Kaul to start with the ball for Bangalore. Can he make an impact on his birthday? Let's find out. So Bangalore have made a bold call to bring Siddarth Kaul in place of Mohammed Siraj. It is a fair call though as Siraj has not been at his best this season. Can Bangalore put on a spirited performance here. They need to set the tone with the ball. Let's see how things pan out. Glenn Maxwell is up for a chat. He says they have to be 100% focused, everything is not in their hands but they have to take care of things that are in control and hope to be alive in the competition. Adds that he and Patidar play in the middle order so they adopt to play spinners more. He personally just tries to adapt to whatever situation he faces. Informs, the openers need to get off to a hot start. Faf du Plessis, the skipper of Bangalore, says that they would've batted first as the wicket looks dry. Adds that the previous game was disappointed but they have to win today and Delhi need to lose their game. Informs there is one change - Siddarth Kaul comes in for Mohammed Siraj. Admits that games like this bring out characters and the experienced guys need to make sure other players fire as well. The captain of Gujarat, Hardik Pandya, says that they will bat first. Tells that with the kind of situation they are in they can test themselves by batting first. Informs that they have one change with Lockie Ferguson coming in for Alzarri Joseph. Says that they had a chat with all the boys about whether they wanted to rest but all the boys wanted to play. Tells that the pitch looks similar to the one they played against Chennai but it will play better as it is an evening game. States that captaincy has been enjoyable for him and that has helped him put his perspective more on the game and has helped him develop as a cricketer. Bangalore (Playing XI) - Virat Kohli, Faf du Plessis (C), Rajat Patidar, Glenn Maxwell, Mahipal Lomror, Dinesh Karthik (WK), Shahbaz Ahmed, Harshal Patel, Wanindu Hasaranga, Siddarth Kaul (In place of Mohammed Siraj), Josh Hazlewood. Gujarat (Playing XI) - Wriddhiman Saha (WK), Shubman Gill, Matthew Wade, Hardik Pandya (C), David Miller, Rahul Tewatia, Rashid Khan, Sai Kishore, Lockie Ferguson (In place of Alzarri Joseph), Yash Dayal, Mohammad Shami. Toss - Gujarat have won the toss and they will BAT first! Pitch Report - Graeme Smith says that the corners are the smallest part of the ground. Tells that the pitch looks good and has a nice grass covering and it is probably the hardest pitch that he has seen at the Wankhede. Mentions that the conditions are overall good for the batters and he expects another cracker of a game. Gujarat, on the other hand, have sealed the top spot in the points table and would be looking to continue the momentum forward. They might look to experiment a bit and give rest to someone like Mohammad Shami keeping his workload in mind. There is also the possibility of Rahmanullah Gurbaz getting a chance ahead of Matthew Wade who has failed to deliver so far. The pressure is on Bangalore and it was Gujarat who got the better of Bangalore in the last game between these two sides, they surely have an upper hand in this game. Can Bangalore get those two crucial points on the board? Let's find out. Toss and team sheets in a while. Bangalore have blown hot and cold this season and the lack of consistency has put them on a sticky wicket now. A win here will also not guarantee them a playoff spot as Delhi is better placed than them with a higher net run rate. However, all Bangalore can and should do in this game is to put a strong performance and do everything that is in their control in this game. Big players like Virat Kohli, Faf du Plessis and Glenn Maxwell need to step up and let's see how they go about their business tonight. Hello and a warm welcome to game number 67 and it will be Bangalore going head-to-head against the table-toppers, Gujarat. It is a must-win game for Bangalore as they already have a negative net run rate and one more slip up from their side will most probably bring curtains on their campaign. ... MATCH DAY …","pubDate":"2022-05-19 13:46:03","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637885845554419140.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"“Test cricket has always been the pinnacle for me”: Brendon McCullum aims to turn around England’s test fortunes after becoming new test coach","link":"https://thesportsrush.com/cricket-news-test-cricket-has-always-been-the-pinnacle-for-me-brendon-mccullum-aims-to-turn-around-englands-test-fortunes-after-becoming-new-test-coach/","keywords":["Cricket","Ben Stokes","Brendon McCullum","ECB"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"Brendon McCullum has called test cricket as the pinnacle, and he aims to revive the bad fortunes of England test team with Ben Stokes as captain. English cricket has entered its transition phase after a lot of new appointments. After Ben Stokes as the captain, Brendon McCullum has been announced as the new red-ball coach… The post “Test cricket has always been the pinnacle for me”: Brendon McCullum aims to turn around England’s test fortunes after becoming new test coach appeared first on The SportsRush.","content":"Brendon McCullum has called test cricket as the pinnacle, and he aims to revive the bad fortunes of England test team with Ben Stokes as captain. English cricket has entered its transition phase after a lot of new appointments. After Ben Stokes as the captain, Brendon McCullum has been announced as the new red-ball coach of the side, whereas Matthew Mott is the new white-ball coach. The test form of the English team has been terrible, and they have just won one of their last 17 games. They single-handedly lost the Ashes, whereas they disappointed in the West Indies series as well. England will now play New Zealand in their next test series. Brendon McCullum aims to revive England’s test cricket ECB have released an interview of the new test head coach Brendon McCullum. McCullum said that he is looking to play an attractive brand of cricket with England and wishes to achieve something big with the side. McCullum insisted that the test cricket will suffer if England could not possess the same challenge as other teams. He said that the test cricket is the pinnacle for him and he wants to turn around the fortunes of England, who have just won one of their last 17 test matches. “Test cricket has always been the pinnacle for me, it really has. I think the popularity of Test cricket has somewhat trended south of late,’ McCullum said. “So if Test cricket is to not just sustain but also thrive then it needs England playing an attractive brand of cricket which is competitive with Australia, India and New Zealand and that was what enthused me the most.” Welcome Brendon McCullum Can’t wait to get behind you, Stokesy and the team pic.twitter.com/6popUJrDzV — England’s Barmy Army (@TheBarmyArmy) May 12, 2022 England’s new director of cricket, Rob Key said that Ben Stokes and Brendon McCullum will make a formidable partnership together for the English team. Key said that Brendon McCullum has the habit of changing cricketing cultures, and he can do the same here as well. “I believe his appointment will be good for England’s Test team,” Rob Key said. “He has a recent history of changing cricket culture and environments for the better, and I believe he is the person to do that for England’s red-ball cricket.” The post “Test cricket has always been the pinnacle for me”: Brendon McCullum aims to turn around England’s test fortunes after becoming new test coach appeared first on The SportsRush.","pubDate":"2022-05-19 13:31:22","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"IPL 2022 RCB vs GT: Virat Kohli opens up on his bad form, says 'I'm in the happiest phase of my life' - WATCH","link":"https://zeenews.india.com/cricket/ipl-2022-rcb-vs-gt-virat-kohli-opens-up-on-his-bad-form-says-im-in-the-happiest-phase-of-my-life-watch-2465261.html","keywords":null,"creator":null,"video_url":null,"description":"Virat Kohli has not scored a century in international cricket since late 2019. But his numbers in IPL 2022 have been a huge concern: 236 runs in 13 innings at an average of 19.67 and strike-rate of 113.46, with just a fifty to his name.","content":null,"pubDate":"2022-05-19 13:17:00","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"Brendon McCullum relishing Ben Stokes connection but denies England will play 'cavalier' cricket","link":"https://uk.sports.yahoo.com/news/brendon-mccullum-relishing-ben-stokes-121753175.html?src=rss","keywords":null,"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2022-05-19 12:17:53","image_url":null,"source_id":"yahoo","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"BAN vs SL: Updated ICC World Test Championship Points Table After Bangladesh vs Sri Lanka 1st Test - Cricket Addictor","link":"https://news.google.com/__i/rss/rd/articles/CBMijgFodHRwczovL2NyaWNrZXRhZGRpY3Rvci5jb20vaWNjLXd0Yy0yMDIxLTIzL2Jhbi12cy1zbC11cGRhdGVkLWljYy13b3JsZC10ZXN0LWNoYW1waW9uc2hpcC1wb2ludHMtdGFibGUtYWZ0ZXItYmFuZ2xhZGVzaC12cy1zcmktbGFua2EtMXN0LXRlc3Qv0gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"BAN vs SL: Updated ICC World Test Championship Points Table After Bangladesh vs Sri Lanka 1st Test  Cricket AddictorThere's no value for experience in Bangladesh: Rahim | Cricbuzz.com - Cricbuzz  CricbuzzRecent Match Report - Sri Lanka vs Bangladesh 1st Test 2022  ESPNcricinfoBAN Vs SL, 1st Test: Bangladesh, Sri Lanka Play Out High-scoring Draw  Outlook India'I've seen people compare me to Bradman': Bangladesh batter's bold claim  Hindustan TimesView Full coverage on Google News","content":null,"pubDate":"2022-05-19 12:02:40","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Cricket-Sri Lanka secure draw in Bangladesh after Dickwella fifty","link":"https://www.thestar.com.my/sport/cricket/2022/05/19/cricket-sri-lanka-secure-draw-in-bangladesh-after-dickwella-fifty","keywords":null,"creator":null,"video_url":null,"description":"DHAKA (Reuters) - Niroshan Dickwella's defiant rearguard with Dinesh Chandimal frustrated Bangladesh and helped Sri Lanka eke out a draw in the opening test in Chattogram on Thursday. Read full story","content":null,"pubDate":"2022-05-19 11:43:00","image_url":"https://apicms.thestar.com.my/uploads/images/2022/05/19/1590846.jpg","source_id":"thestar_my","country":["malaysia"],"category":["sports"],"language":"english"},{"title":"Jofra Archer Injury Update: Will Jofra Archer return to cricket in England summer 2022?","link":"https://thesportsrush.com/cricket-news-jofra-archer-injury-update-will-jofra-archer-return-to-cricket-in-england-summer-2022/","keywords":["Cricket","ECB","england cricket","jofra archer"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"Jofra Archer Injury Update: England’s pacer Jofra Archer has been officially ruled out of the upcoming English cricket season. England’s pacer Jofra Archer has suffered yet another setback in his pursuit of a return to cricket. Archer, who last played a competitive game in T20 Blast 2021 has been diagnosed with a stress fracture at… The post Jofra Archer Injury Update: Will Jofra Archer return to cricket in England summer 2022? appeared first on The SportsRush.","content":"Jofra Archer Injury Update: England’s pacer Jofra Archer has been officially ruled out of the upcoming English cricket season. England’s pacer Jofra Archer has suffered yet another setback in his pursuit of a return to cricket. Archer, who last played a competitive game in T20 Blast 2021 has been diagnosed with a stress fracture at his lower back. Jofra Archer played his last international match in March 2021 against India. Archer has undergone two operations on his elbow, the latest one in December 2021. He missed the ICC T20 World Cup in UAE, whereas he also missed the Ashes series for England. In a recent interview, Jofra Archer said that he was planning to make his return in the upcoming T20 Blast for Sussex, but that won’t happen now. Jofra Archer was bought by Mumbai Indians this season for a price of INR 8 crores despite knowing the fact that he won’t play this season. ECB have confirmed that Jofra Archer won’t play again in the upcoming English summer. Jofra Archer has sustained a lower back stress fracture, and he has been officially ruled out of the upcoming season. “After being diagnosed with a stress fracture to the lower back, England and Sussex seamer Jofra Archer has been ruled out for the rest of the season. No timeframe has been set for his return. A management plan will be determined following further specialist opinion over the coming days,” ECB released a statement. I feel for Jofra Archer. It must be terribly frustrating. — Ian Raphael Bishop (@irbishi) May 19, 2022 Jofra Archer, who became eligible to play for England in 2019 played a crucial part in England’s 2019 ICC World Cup campaign. He was at this lethal best in the 2019 Ashes as well. Archer has scalped 42 test wickets in 13 games, whereas he has scalped 30 ODI wickets in 17 games. Jofra Archer made his IPL debut in 2018 and has played in three seasons for the Rajasthan Royals. He missed the IPL 2021 due to an injury. Archer has scalped 46 wickets in 35 IPL games at an economy of 7.13.","pubDate":"2022-05-19 11:11:55","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Jofra Archer ruled out for season in latest England injury setback - The Guardian","link":"https://news.google.com/__i/rss/rd/articles/CBMieGh0dHBzOi8vd3d3LnRoZWd1YXJkaWFuLmNvbS9zcG9ydC8yMDIyL21heS8xOS9qb2ZyYS1hcmNoZXItcnVsZWQtb3V0LWZvci1zZWFzb24taW4tbGF0ZXN0LWVuZ2xhbmQtaW5qdXJ5LXNldGJhY2stY3JpY2tldNIBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Jofra Archer ruled out for season in latest England injury setback  The GuardianEngland and Wales Cricket Board (ECB) - The Official Website of the ECB  ECB.co.ukJofra Archer injury: England and Sussex fast bowler ruled out for season with stress fracture in lower back  Sky SportsJofra Archer will not play again this season after suffering stress fracture in his back  The TelegraphInjured Jofra Archer ruled out for season to leave T20 World Cup place in major doubt  Evening StandardView Full coverage on Google News","content":null,"pubDate":"2022-05-19 10:47:00","image_url":null,"source_id":"google","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"RCB vs GT Dream11 IPL 2022: Fantasy Cricket Tips, Dream 11, Probable Playing XI for Bangalore vs Gujarat","link":"https://www.indiatvnews.com/sports/cricket/ipl-2022-rcb-vs-gt-dream-11-prediction-fantasy-cricket-tips-playing-xi-pitch-report-injury-updates-2022-05-19-777747","keywords":null,"creator":null,"video_url":null,"description":"RCB vs GT Dream11 IPL 2022: Fantasy Cricket Tips, Dream 11, Probable Playing XI for Royal Challengers Bangalore vs Gujarat Titans Match Details  Royal Challengers Bangalore vs Gujarat Titans","content":null,"pubDate":"2022-05-19 10:12:43","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"England quick Archer to miss entire summer","link":"https://www.perthnow.com.au/sport/cricket/england-quick-archer-to-miss-entire-summer-c-6863555","keywords":null,"creator":["Rory Dollard"],"video_url":null,"description":"Jofra Archer will miss the whole English summer of cricket after the fast bowler was diagnosed with a stress fracture of the lower back.","content":null,"pubDate":"2022-05-19 10:08:14","image_url":"https://images.perthnow.com.au/publication/C-6863555/4c147b6fb0cfcdcdb6a31aa19a1c602e78d28b95-16x9-x0y0w1280h720.jpg","source_id":"perthnow","country":["australia"],"category":["sports"],"language":"english"},{"title":"Cricket-Archer ruled out for season as England&#039;s bowling crisis deepens","link":"https://www.thestar.com.my/sport/cricket/2022/05/19/cricket-archer-ruled-out-for-season-as-england039s-bowling-crisis-deepens","keywords":null,"creator":null,"video_url":null,"description":"(Reuters) - England fast bowler Jofra Archer has been ruled out for the season with a stress fracture in his back, the country's cricket board (ECB) said on Thursday. Read full story","content":null,"pubDate":"2022-05-19 10:06:00","image_url":"https://apicms.thestar.com.my/uploads/images/2022/05/19/1590673.jpg","source_id":"thestar_my","country":["malaysia"],"category":["sports"],"language":"english"},{"title":"Jofra Archer to miss entire summer of cricket for England","link":"https://sportstar.thehindu.com/cricket/jofra-archer-to-miss-entire-summer-of-cricket-for-england/article38494860.ece","keywords":null,"creator":["AP"],"video_url":null,"description":"Archer has been ruled out of the rest of the English season, the England and Wales Cricket Board said on Thursday, meaning he will not be available to play until the end of September at the earliest.","content":null,"pubDate":"2022-05-19 09:49:22","image_url":null,"source_id":"sportstar","country":["india"],"category":["sports"],"language":"english"},{"title":"Australian cricket star and Perth Scorcher Beth Mooney signs on with WA for Women’s National Cricket League","link":"https://thewest.com.au/sport/cricket/australian-cricket-star-and-perth-scorcher-beth-mooney-signs-on-with-wa-for-womens-national-cricket-league--c-6859593","keywords":null,"creator":["Jackson Barrett"],"video_url":null,"description":"Australian star Beth Mooney loved her first two seasons with the Perth Scorchers so much, she has made the move full-time and will play for Western Australia’s WNCL side this summer.","content":"One of Australia’s greatest ever female cricketers will end a 13-year association with her home State and instead don WA’s black and gold this summer. Superstar opener Beth Mooney moved from the Brisbane Heat to the Perth Scorchers two seasons ago, and loved her time in orange so much, she has signed on to play for WA’s WNCL side as well — a welcome boost for a team which has just laboured through a COVID-impacted season on the road. Ben Smith Jackson Barrett But the WBBL’s leading run-scorer won’t be making WA her home, instead travelling from Queensland to play amid commitments abroad, including England’s The Hundred. “I just thought it was time for me to align my Big Bash club and my State organisation to the same place,” Mooney told The West Australian. “I have just been really impressed with how they go about it and I’m looking forward to being a part of that organisation. “Just working with the Perth Scorchers and everyone over there has been really exciting for me and something I am really proud of as well and proud to be a part of. “Last season was a pretty special time to be associated with the Scorchers. “I will feel completely the same about being associated with WA Cricket as well.” Mooney says a relatively open international schedule could leave the door ajar for an extended run of WNCL games, having sat out the opening rounds of the tournament for Queensland last year to give herself a break from the sport. “We might play a few more WNCL games than we have in the past couple of years which is really exciting, given I will be wearing the yellow and black,” she said. The powerful left-handed opener debuted as a fresh-faced 16-year-old for the Fire, before carving out a stellar international career, averaging an even 50 from 54 ODIs, which includes one of Australia’s most famous ever innings — an unbeaten 85 to lead Australia to the 2019 World Cup title in front of a record crowd at the MCG. She made her international debut deputising for Alyssa Healy with the gloves, before winning a spot of her own as a batter and partnering Healy at the top of the order. The 28-year-old said she held some apprehension about leaving the organisation that had helped shape her career, but was ready to take a leap, and had been wrestling with the idea since first joining the Scorchers. “Obviously when you have been somewhere for so long there is a little bit of trepidation in moving on and doing something different, but at the same time you don’t know what you don’t know either,” Mooney said. “I had been weighing it up for a little while, it was just a matter of whether or not WA were willing to make it work a little bit with me being based in Brisbane and having lots of Australian commitments. “It wasn’t in my best interests to pack up and move so I have been really overwhelmed and grateful for the support they have shown me allowing me to stay in Brisbane in my home and work with them about when I can be available in Perth throughout the season.” She finished as the leading run-scorer in the Scorchers’ championship-winning campaign last summer, forming a formidable opening partnership with New Zealand legend and WBBL captain Sophie Devine. She said while she saw herself becoming a leader in the group, which blooded a number of youngsters in its tough campaign last year, incumbent captain Chloe Piparo had her backing. “There are always opportunities to be a leader whether you have a title next to your name or not,” Mooney said. “I have probably realised that people can learn of experiences I have had playing cricket in Australia and around the world and if I can help other young girls coming through achieve some of the things I have in my career that will be pretty special for me as well. “I have got a lot of respect and time for Chloe and I think she does an outstanding job in that role. “Just being able to offer advice to Chloe and to my other teammates along the way will be plenty ... WA have said they value what I can offer them there.” Western Australia finished last summer’s campaign winless and dead last, but did get games into youngsters Molly Healy, Georgia Wyllie, Zoe Britcliffe and Maddy Darke. It came after WA cricket legend Nicole Bolton gave the sport away suddenly on the eve of the last domestic season — a top-order whole Mooney will look to fill. WA coach Shelley Nitschke has been poached as interim coach of the Australian team after Matthew Mott was appointed England’s newly-created white-ball coaching role. Nitschke will take charge on an interim basis before a full-scale search for a permanent leader is conducted, but is likely to be in the running for the full-time position, in a similar vein to men’s coach Andrew McDonald.","pubDate":"2022-05-19 09:41:00","image_url":"https://images.thewest.com.au/publication/C-6859593/0da0ee09e977b5a7eb97868e1f928d49aa023e53-16x9-x501y453w2951h1660.jpg","source_id":"thewest","country":["australia"],"category":["sports"],"language":"english"}]}