{"newsArray":[{"title":"Matthew Wade fifty in vain for Karachi in Pakistan SL","link":"https://www.perthnow.com.au/sport/cricket/matthew-wade-fifty-in-vain-for-karachi-in-pakistan-sl-c-9912913","keywords":null,"creator":["Staff Writers"],"video_url":null,"description":"Matthew Wade cracked 53 for Karachi Kings but it wasn't enough to stop them losing by 24 runs to Peshawar Zalmi in the Pakistan Super League.","content":"Australian star Matthew Wade has blasted 53 off 41 balls for Karachi Kings but it still didn't give them enough momentum in their run chase to win their Pakistan Super League clash with Peshawar Zalmi. Peshawar made a gallant recovery from a top-order collapse against fast bowler Mohammad Amir to win Wednesday's match by 24 runs. Half centuries by Rovman Powell (64), Tom Kohler-Cadmore (56 not out) and Pakistan under-19 batter Haseebullah (50) had lifted Peshawar to 5-197 after Amir's three-wicket burst had put them in deep trouble at 3-2 inside the first three overs. Karachi top-order batters yet again struggled before captain Imad Wasim's unbeaten 57 took them to 8-173. Afghanistan bowlers Azmatullah Omarzai (3-28) and Mujeeb Ur Rahman (2-28), playing their first game of the season, kept striking with regular intervals to hand Karachi their fifth defeat in the tournament in seven games. Peshawar broke into the top four with their third win in six games behind Islamabad United on net run-rate. Lahore Qalandars and Multan Sultans occupy the top two spots with eight points each. Amir's brilliant first over in his hometown after missing the last two games due to a groin injury resulted in both Mohammad Haris and captain Babar Azam getting dismissed lbw without scoring within the first five balls from the left-armer. Left-handed Saim Ayub then pulled Amir to deep square leg before Haseebullah and Kohler-Cadmore revived the innings with a 82-run stand. Karachi's run chase just couldn't get going despite Wade's half-century that featured nine boundaries. He was eventually bowled, trying to heave Mujeeb Ur Rahman out of the ground, leaving Karachi on 5-95. Left-hander Wade could earlier have been out for one but Peshawar didn't go for a caught behind television referral. Mujeeb and Omarzai claimed two wickets each and Shoaib Malik offered a tame return catch to Aamer Jamal (3-43) as Karachi lost half of their side by the 12th over for 95 runs.","pubDate":"2023-03-01 20:19:00","image_url":"https://images.perthnow.com.au/publication/C-9912913/29c1e49c294f9a817ae2cc52a8475fefbfd104e9-16x9-x0y0w1280h720.jpg","source_id":"perthnow","category":["sports"],"country":["australia"],"language":"english"},{"title":"Kuhnemann and Lyon spell India’s doom, spin hosts out for a paltry 109","link":"https://www.thehindu.com/sport/cricket/kuhnemann-and-lyon-spell-indias-doom-spin-hosts-out-for-a-paltry-109/article66569250.ece","keywords":null,"creator":null,"video_url":null,"description":"The former’s five-for well complemented by the latter’s three; Australia furthers its cause with batters turning in better collective performance to help the visitors finish the opening day on 156 for four, with Jadeja claiming all wickets","content":"There was turn, bounce and puffs of dust from the dry surface in the first hour. It was a sign of what to expect. India, electing to bat, was spun out for 109 on the opening day of the third Test of the Border-Gavaskar Trophy at the Holkar Stadium here on Wednesday. The odd delivery kept low too, but the Australians did better than expected, finishing the day at 156 for four. Ace left-arm spinner Ravindra Jadeja scalped all four. Australia, ahead by 47, holds the edge. Thursday’s first hour will be critical. Matthew Kuhnemann was Australia’s hero with five for 16. He settled on an ideal length, in the dry area of the pitch, and struck with his quicker variety of spin. On view was control, accuracy, turn and incision. Then, the pitch appeared to settle down. The Australians too batted normally without pre-meditation. Jadeja struck early, having Travis Head leg-before playing across. Then big fish Marnus Labuschagne, on zero, played on to the left-arm spinner, but it turned out to be another no-ball from Jadeja. The left-handed Usman Khawaja and Labuschagne negotiated the Indian spinners capably. There were no desperate sweeps. Both batters trusted their defence and used their feet. Labuschagne, in particular, played a lot off his backfoot, using the depth of the crease. As the partnership swelled, the Indians became desperate. Reviews were wasted and the one occasion when replay showed R. Ashwin had trapped Labuschagne leg-before, the review had not been taken. Khawaja’s cover-drives had elegance. Like Labuschagne, he was picking runs in front of the wicket, which is a good sign. He was also the dominant partner. Eventually, Jadeja ended the 96-run second-wicket partnership, castling Labuschagne (31) with low bounce. Khawaja was coasting on 60 (147b, 4x4) when he swept Jadeja into Shubman Gill’s hands at deep mid-wicket. A big strike. Steve Smith was batting with belief. However, soon after whipping Jadeja to the boundary, he nicked an away-spinner to be well held by ’keeper K.S. Bharat. Earlier, Kuhnemann gave little away, keeping it tight, Consistently turning the ball from the right-hander, he also got a few to go through straight. Rohit Sharma charged him and was fatally beaten by the away-turner and the crisp-stroking Gill edged a Kuhnemann delivery that turned from off-stump. Shreyas Iyer, denied width for the cut by Kuhnemann, played on. And Ashwin fell to a full delivery of sharp turn from the left-armer. Wily off-spinner Nathan Lyon maintained the pressure created by Kuhnemann. He spun one into Cheteshwar Pujara, who was bowled attempting to cut. Lyon spun his deliveries, and mixed his trajectory. Jadeja, promoted for a left-right combination, attempted to punch Lyon, mistimed into cover’s hands. Young off-spinner Todd Murphy chipped in too, sending back a battling Virat Kohli (22) with a quicker, fuller delivery. Bharat sparkled briefly with his slog-sweeps but fell to a Lyon delivery that held its line. Tottering at 84 for seven going into lunch, the Indian innings concluded soon despite some hefty blows from Umesh Yadav. The Test began dramatically. Replays showed Rohit was out twice in Mitchell Starc’s fiery first over, caught behind and then leg-before. The Aussies did not review on both occasions. How will the Test end? Australia is ahead but this match could go either way.","pubDate":"2023-03-01 20:15:00","image_url":null,"source_id":"thehindu","category":["sports"],"country":["india"],"language":"english"},{"title":"News24.com | Proteas skipper Bavuma caps off miserable Centurion batting return with historic Test pair","link":"https://www.news24.com/sport/Cricket/Proteas/proteas-skipper-bavuma-caps-off-miserable-centurion-batting-return-with-historic-test-pair-20230301","keywords":null,"creator":null,"video_url":null,"description":"Proteas Test skipper Temba Bavuma became the fourth member of an inglorious club of Test match leaders who bagged a pair on their leadership debut.","content":"At SuperSport Park, Centurion Proteas Test skipper Temba Bavuma became the fourth member of an inglorious club of Test match leaders who bagged a pair on their leadership debut on Wednesday. Bavuma was twice collected by West Indian paceman Alzarri Joseph on the first and second days of the first Test to join Australian Mark Taylor, Pakistan's Rashid Latif, and Bangladesh's Habibul Bashar in the not-so-distinguished group. In the first innings, Bavuma was trapped leg before after two balls by Joseph on the first afternoon, but on a high-pressured second evening, he was caught behind by Joshua da Silva to complete a miserable first game with the bat as skipper. Taylor was the first of the captaincy lot to bag a pair on leadership debut, with his blobs coming against Pakistan in Karachi in 1994. Latif was subjected to that ignominy against South Africa in Gqeberha in 1998, while Bashar, who captained a rather rudimentary Bangladeshi side, faced five balls across his pair against Zimbabwe in Harare in 2004. The trio of skippers all found themselves on the losing side, with Taylor's Australians being pipped to the post in the timeless Karachi Test that Pakistan won by one wicket. Latif's disjointed Pakistan team was subjected to a 259-run beating, while Bangladesh were beaten by 183 runs.","pubDate":"2023-03-01 19:14:49","image_url":"https://scripts.24.co.za/img/sites/sport24.png","source_id":"news24","category":["sports"],"country":["south africa"],"language":"english"},{"title":"News24.com | Anrich the Ace blitzes the Windies with 5-star bowling, but Proteas' brittle bats come tumbling down","link":"https://www.news24.com/sport/Cricket/Proteas/anrich-the-ace-blitzes-the-windies-with-5-star-bowling-but-windies-fight-back-20230301","keywords":null,"creator":null,"video_url":null,"description":"A frantic second evening in which 11 wickets fell left South Africa teetering at 47/4 after bowling out the West Indies for 212, leaving the first Test finely poised after two days.","content":"At SuperSport Park, Centurion Aiden Markram stands between the West Indies and a challenging fourth-innings chase as the visitors fought back on what was a second evening of epic wicket-taking proportions. South Africa, who were bowled out for 342 inside the first 40 minutes of the day, finished the second day on 47/4, 179 runs ahead of the West Indies, who were bowled out for 212 inside two sessions on Wednesday. The cookie crumbled with 11 wickets falling in a hectic hour-and-three-quarters during which the West Indies subsided from 169/3 to their eventual total through an electric burst of hostile fast-bowling from Anrich Nortje (5/35). While the West Indians allowed Markram (35*) to race to a 33-ball knock with six fours, they combined to rip out the rest of SA's top and middle-order to leave the Test match delicately poised. Alzarri Joseph (5/81 and 2/17) coaxed another false ramp shot to third man from Dean Elgar (1) and removed captain Temba Bavuma first ball, with Kemar Roach (1/28) doing the same to Tony de Zorzi (0)i as the hosts, weirdly, elected not to use a night-watchman. That ploy backfired badly when Keegan Petersen (7) was trapped plumb in front with what became the last ball of the day and the first of Jason Holder's (1/0) spell. It left the game finely balanced as the hosts were again failed by their batting. The Windies, who started South Africa's second innings badly, made full use of the fading light in the last 34 minutes of the play to bring themselves back into the game after a terminal collapse. South Africa's late-evening meltdown undid the diligent bowling of the afternoon and evening sessions where they first constricted, then disemboweled the West Indian batting. That South Africa earned a lead of 130 was down to Nortje's fire and brimstone, accompanied by unrelenting accuracy from the rest of the pace attack. When the West Indies were 169/3 nearly an hour after tea, it would have been easy for an attack of lesser resolve to spit the dummy. But the Proteas didn't let the West Indies out of their sight on the second afternoon and only allowed them 64 runs in 29 overs, which was in contrast to the 71 they scored when they started batting in the morning session. The Proteas did have the wickets of Kraigg Brathwaite (11) and Tagenarine Chanderpaul (22) to shout home about in the first session. Brathwaite was castled by a wonderful leg-cutter from Kagiso Rabada (2/44) that pitched on middle and off-stump and hit the top of off. Chanderpaul was marinated by some aggressive fast bowling and, by the time he had gifted Gerald Coetzee his first Test wicket when he popped a catch to Senuran Muthusamy at gully, he had long lost his nerve. However, those dismissals allowed for a punchy third-wicket stand of 64 between Raymon Reifer and Jermaine Blackwood (37), who had contrasting, but effective batting styles to combat South Africa's threat. Where the left-handed Reifer (62), whose third Test 50 came off 117 balls, eschewed anything short and waited for the ball to be absolutely full, Blackwood was happy to take the attack to the hosts. Blackwood's blade is chancy, but also feisty to a point where if it's unrestrained, it either spells trouble for the opponent or his team. He flashed hard, but once a squeeze was applied when Muthusamy was brought into the attack, he was unable to play himself out of the fielding press. This allowed Nortje to test his temperament with a bumper/yorker approach and then Blackwood inside-edged a catch to Heinrich Klaasen. While there was still some batting to come in the form of Roston Chase (22), Kyle Mayers (18), Joshua da Silva (4), and Holder (0), the West Indies' chance of scoring quickly evaporated with Blackwood's dismissal. Reifer and Chase took the score to 169, but when the former tickled an edge to Klaasen off the luckless Marco Jansen (1/64), the gap to kick the door down was prised open. Nortje, in the best way he knows, then dismembered the West Indian order when he forced Chase to edge one to Elgar at first slip. That took the West Indies to 169/5 which quickly became 179/6 when Da Silva cut a Nortje short ball straight to Jansen at point. Holder couldn't see out Nortje's over as three balls later he was pouched at second slip by Markram as the Windies slipped to 179/7. Joseph (4) provided a modicum of resistance, but when he replicated Da Silva's dismissal by picking out Jansen at point off Nortje, the Windies had subsided to 190/8. Mayers became Nortje's fifth victim when he holed out to Jansen at deep fine-leg off the fast man, before Coetzee (2/45) grabbed his second scalp when he trapped Shannon Gabriel (7) plumb in front. That left the West Indies with a hill to climb and the four late wickets will aid their cause, but with another evening collapse accelerating the game, Centurion is set for another Test that won't go the full five days. Scores in brief South Africa: 342 (Aiden Markram 115, Dean Elgar 71, Alzarri Joseph 5/81) and 49/4 (Markram 35*, Joseph 2/17, Jason Holder 0/1, Kemar Roach 1/28) West Indies: 212 (Raymon Reifer 62, Jermaine Blackwood 37, Anrich Nortje 5/35, Kagiso Rabada 2/44, Gerald Coetzee 2/45) South Africa leads by 179 runs","pubDate":"2023-03-01 19:14:49","image_url":"https://scripts.24.co.za/img/sites/sport24.png","source_id":"news24","category":["sports"],"country":["south africa"],"language":"english"},{"title":"News24.com | WATCH | Speedster Nortje recruits Anrich's army to aid Proteas' cause","link":"https://www.news24.com/sport/Cricket/Proteas/watch-speedster-nortje-recruits-anrichs-army-to-aid-proteas-cause-20230301","keywords":null,"creator":null,"video_url":null,"description":"Anrich Nortje's 5/36 was the standout performance for the Proteas as they bowled out the West Indies for 212 on the second day of the first Test at Centurion and he had the backing of a group of locals who copied his every move.","content":"Anrich Nortje's 5/36 was the standout performance for the Proteas as they bowled out the West Indies for 212 on the second day of the first Test at Centurion. READ | Anrich the Ace blitzes the Windies with 5-star bowling, but Windies fight back While support in the ground was sparse, Nortje's excellent spell saw him recruit a band of followers that quickly became known as Anrich's Army. They'll have to work on their bowling actions if they hope to make the grade, however. WATCH their antics below:","pubDate":"2023-03-01 18:53:27","image_url":"https://scripts.24.co.za/img/sites/sport24.png","source_id":"news24","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Top order collapse ‘not ideal’ as Proteas seek 250 target for Windies — Nortje","link":"https://www.citizen.co.za/sport/cricket/top-order-collapse-proteas-windies-nortje/","keywords":["Cricket","anrich nortje","centurion","proteas cricket team","west indies"],"creator":["Ross Roche"],"video_url":null,"description":"The only batter to show good form on day two was first innings centurion Aiden Markram.","content":"The Proteas need a lead of at least 250 runs on a misbehaving wicket to give them the best possible chance of winning the first Test against the West Indies at SuperSport Park in Centurion, according to fast bowler Anrich Nortje. After the Proteas were bowled out for 342 in their first innings on day two’s morning session, the Windies then responded with 212 all out, thanks in large part to Nortje’s fourth Test five wicket haul, with him finishing with figures of 5/36. This gave the South Africans a big 130-run lead, only for their top order to fall apart spectacularly as the Proteas reached the close of play on 49/4 in their second innings , with an overall lead of 179-runs. First innings centurion Aiden Markram (35no) will have the massive task of guiding the middle and lower order on day three on Thursday to try and get them to a competitive total. “It’s definitely not ideal (the top order collapse). But we still have the middle order and Aiden’s been looking really good. So we still have the batters to get us a proper lead. Hopefully we can get one or two guys in and take the lead to 250 plus,” said Nortje after the day’s play. “I don’t know if that will be enough but I think it will. It is definitely competitive, but the more we can get the better. I think 250 plus is a really good score, especially the way it (the wicket) looks like it’s misbehaving at this stage.” Nortje continued: “Hopefully on Thursday we can come up with a partnership. Having a partnership is going to be crucial for us. We bat to 11, I am at 11 so we go all the way down,” Nortje claimed with a laugh). “I’m joking. But hopefully we can get one or two partnerships and get a decent lead.” “We will take anything. Obviously runs on the board are important. But hopefully we can come out strong. The middle order has been doing well, whether it is domestically in leagues or wherever it is. So hopefully they can come out tomorrow (on Thursday) and stamp their authority.”","pubDate":"2023-03-01 18:42:12","image_url":"https://media.citizen.co.za/wp-content/uploads/2023/03/SA-Windies-Bavuma-1.jpg","source_id":"citizen","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Delhi will look to capitalise on its explosive batting, spin attack","link":"https://www.thehindu.com/sport/delhi-will-look-to-capitalise-on-its-explosive-batting-spin-attack/article66569386.ece","keywords":null,"creator":null,"video_url":null,"description":"The franchise used its IPL experience at the auction for the inaugural Women’s Premier League to put together a formidable squad","content":"Delhi Capitals knows a thing or two about auctioning cricketers. The franchise used its IPL experience at the auction for the inaugural Women’s Premier League to put together a formidable squad. It could consider itself a bit lucky that it got Meg Lanning for only ₹1.1 crore; it was one of the best buys at the auction. Besides being a run machine — she has amassed over 8,000 runs with 17 centuries in international white-ball cricket — she has been an inspiring captain for Australia, which she led to the Women’s T20 World Cup triumph on Sunday at Cape Town. Lanning is part of a strong batting line-up that includes Jemimah Rodrigues, the franchise’s biggest buy at ₹2.2 crore, and Shafali Verma, who can take any bowling attack apart in no time. South African Marizanne Kapp — another great buy at ₹1.5 crore — is a serial tournament winner and one of the game’s leading all-rounders. Young Alice Capsey of England and seasoned Australian Laura Harris are explosive options. Jasia Akhter, from Jammu & Kashmir, too, is a hard-hitter. All these batters are right-handed, though. In Taniya Bhatia, Delhi has one of India’s most talented wicketkeepers, but she will be keen to work on her strike-rate. As she tries to come back into the national team, she could not have hoped for a better stage than the WPL. Capitals have assembled a good spin attack in the form of Australian Jess Jonassen and the two experienced Yadavs — Radha and Poonam. Shikha Pandey, who has recently come back to the Indian team, and Arundhati Reddy, who is trying to do that, are among the pacers in the squad. The franchise has also bought the exciting prospect Titas Sadhu, the 18-year-old seamer who caught the eye at the Under-19 World Cup in South Africa. Tara Norris, the American who is the only player to get picked from an associate nation at the auction, offers left-arm variety in seam bowling. It may be noted that the WPL allows a team to have one cricketer from an associate country in the eleven in addition to the four overseas players. The dugout: Jemimah Rodrigues, Shafali Verma, Marizanne Kapp, Meg Lanning, Alice Capsey, Shikha Pandey, Jess Jonassen, Laura Harris, Radha Yadav, Arundhati Reddy, Taniya Bhatia, Minnu Mani, Poonam Yadav, Sneha Deepthi, Titas Sadhu, Tara Norris, Jasia Akhter and Aparna Mondal. Coach: Jonathan Batty. The schedule: March 5: vs Royal Challengers Bangalore (Brabourne Stadium) March 7: UP Warriorz (DY Patil) March 9: Mumbai Indians (DY Patil) March 11: Gujarat Giants (DY Patil) March 13: Royal Challengers Bangalore (DY Patil) March 16: Gujarat Giants (Brabourne) March 20: Mumbai Indians (DY Patil) March 21: UP Warriorz (Brabourne) (The WPL will be held in Mumbai from March 4 to 26).","pubDate":"2023-03-01 18:39:28","image_url":null,"source_id":"thehindu","category":["sports"],"country":["india"],"language":"english"},{"title":"Watched closely how Jadeja and Ashwin use the crease: Kuhnemann","link":"https://www.thehindu.com/sport/watched-closely-how-jadeja-and-ashwin-use-the-crease-kuhnemann/article66569270.ece","keywords":null,"creator":null,"video_url":null,"description":"Kuhnemann said senior bowler Lyon was very encouraging and implored him to keep things tight","content":"Cricketing tales often hang on slender threads. Journeying to India, Matthew Kuhnemann was not the first-choice left-arm spinner for Australia. That position went to Ashton Agar who was considered the second spinner in the Australian team behind Nathan Lyon. How things changed! The 26-year-old Kuhnemann, with just over 30 First Class wickets, leapfrogged over Agar in Australia’s practice sessions. The think-tank too felt Kuhnemman’s quicker variety of left-arm spin was better suited to these wickets. Kuhnemann was living a dream within a dream here on Wednesday, his first five-for in Tests being an attention-grabbing five for 16 off nine probing overs on day one of the third Test. He turned the ball, was accurate and used the crease to create the angles. “It feels really good to pick five wickets in a Test against India,” said Kuhnemann after the day’s play. Importantly, Kuhnemann said he had learnt much from watching Ravindra Jadeja and R. Ashwin bowl in the series. “I watched them closely. In particular, how they use the crease.” Kuhnemann said senior bowler Lyon was very encouraging and implored him to keep things tight. Kuhnemann said batting on this pitch was challenging. “It is a dry pitch. Some deliveries are keeping low,” he said. India’s batting coach Vikram Rathour said, “It is a challenging wicket. We needed more runs. We failed as a batting unit.” He added, “The wicket has slowed down.” Rathour said, “With the WTC points at stake, there is pressure to win home games. So there is nothing wrong in preparing such wickets and making best use of home conditions to win. But these pitches are also a double-edged sword.” Asked about India wasting reviews, he said: “You cannot always get them right.”","pubDate":"2023-03-01 18:34:00","image_url":null,"source_id":"thehindu","category":["sports"],"country":["india"],"language":"english"},{"title":"Ex-England cricketer Bresnan accused of racist language","link":"https://www.perthnow.com.au/sport/cricket/ex-england-cricketer-bresnan-accused-of-racist-language-c-9912249","keywords":null,"creator":["Staff Writers"],"video_url":null,"description":"Former England bowler Tim Bresnan is alleged to have used a racist comment towards Azeem Rafiq's sister, a disciplinary panel has heard.","content":"Tim Bresnan has been accused of using a racist comment towards Azeem Rafiq's sister while the England and Wales Cricket Board told a disciplinary panel it is \"more likely than not\" three former Yorkshire players used racist or discriminatory language. The public Cricket Discipline Commission hearing into allegations of racism from former Yorkshire player Rafiq began in London on Wednesday with the cases of England pair Matthew Hoggard and Bresnan and their one-time county teammate John Blain being heard. The trio all deny a charge of bringing the game into disrepute and allegations of using racial or discriminatory language. ECB lawyer Jane Mulcahy KC stated it is \"more likely than not\" each of the trio used the racist phrases being alleged - which included \"P***\" - due to a number of reasons, including the systemic use of racist or discriminatory language during that period at Yorkshire. During the first day of proceedings it was alleged Bresnan used a racial slur against Rafiq's sister Amna in 2014. Bresnan, Mulcahy said, is alleged to have directed the term \"fit P***\" and \"FP\" towards Asian women, including Rafiq's sister Amna at an official Yorkshire media day. He was also alleged to have referred to Rafiq and Asian teammates Adil Rashid, Ajmal Shahzad and Rana Naved-ul-Hasan as \"the brothers\" and \"you lot\". Bresnan denies the allegations. He said the term \"brothers\" was used but not in a racial or discriminatory context. He detailed his use of the term \"brothers\" or \"bro\" in WhatsApp messages or group chats as part of his defence. He also insisted he had no recollections of using the phrase \"you lot\" in a match against Derbyshire and claimed to have never met Amna Rafiq. But Mulcahy insisted for each alleged charge that \"on balance of probability, more likely than not, that he used the phrase and it was racist or discriminatory\". Former England captain Michael Vaughan, Hoggard, Bresnan, Blain, Andrew Gale and Richard Pyrah all face charges related to the use of racially discriminatory language, with Vaughan the only one set to appear in person at the hearing. Yorkshire admitted four amended charges and Gary Ballance admitted a charge which meant both were not required to participate. Mulcahy also set out the allegations against former England bowler Hoggard, which included creating and using the term \"Rafa the Kaffir\", repeated use of the word \"P***\", referring to Rafiq and other players as \"you lot\" and use of the term \"TBM\" (token black man) towards teammate Ismail Dawood. Hoggard admitted using the term \"Rafa the Kaffir\", but denied he created it and it was used in the context alleged. He admitted it did breach ECB directive 3.3. He admitted the use of the word \"P***\" but denied any racist or discriminatory intent and could not remember exactly on what occasions this occurred. He also denied it breached ECB directive. While Hoggard also admitted using the phrase \"you lot\", he denied the use of it to identify a group of ethnic minority players and denied it breached ECB directive 3.3. Hoggard did admit to using the phrase \"TBM\" or \"token black man\" and that it breached directive 3.3 but denied it had any racist or discriminatory intent. Mulcahy told the panel \"it is obvious that Hoggard has caused prejudice and/or disrepute for cricket and himself\" due to the systemic use of racist or discriminatory language at Yorkshire and the fact he admitted to using the word \"P***\".","pubDate":"2023-03-01 18:24:17","image_url":"https://images.perthnow.com.au/publication/C-9912249/bd42373cc4f0724240a69a30a115b2784168069f-16x9-x0y0w1280h720.jpg","source_id":"perthnow","category":["sports"],"country":["australia"],"language":"english"},{"title":"News24.com | Lions win CSA-Day Franchise Series thriller against WP, Dolphins make it three on the trot","link":"https://www.news24.com/sport/Cricket/Domestic/wrap-csa-4-day-franchise-series-20230226","keywords":null,"creator":null,"video_url":null,"description":"A wrap of all the collated fixtures, scores and reports from the latest round of action in the CSA 4-Day Franchise Series:","content":"A wrap of all the collated fixtures, scores and reports from the latest round of action in the CSA 4-Day Franchise Series: 26 FEBRUARY - 1 MARCH Division 1: Dolphins v Titans - Dolphins won by 7 wickets The Dolphins cruised to a convincing seven-wicket win over the Titans at Kingsmead Stadium on Wednesday morning, taking their current winning streak to three matches in the CSA 4-Day Domestic Series. Following a poor start to the campaign, the Dolphins have bounced back since the re-start and have won their last three matches in the tournament, which revitalised their chances of winning the overall crown for a second time in three seasons. After restricting the Titans to 138 all out in their second innings, the Dolphins needed 51 runs to win the match and started the final morning with ten wickets in hand and 46 runs to win. They lost the wickets of SJ Erwee, Marques Ackerman and Bryce Parsons; however, it was Khaya Zondo and first-innings hero Jason Smith who took the Dolphins to a memorable victory on their home ground. The renaissance of the Dolphins in the 4-Day series has been a positive for SJ Erwee, who has taken over the captaincy of the Dolphins in the red ball competition in the absence of Keshav Maharaj, who is with the Proteas. “We started really poorly in this competition, but it’s really nice to have three wins on the bounce now, and the guys are really rolling with this momentum,” Erwee said. “Guys are doing the hard yards and are doing the correct preparation for the opposition and the games we are playing. “The next game for us is at home again, and in our conditions, is exactly where we want to be.” The Dolphins spinners Prenelan Subrayen and Jon-Jon Smuts finished the match with combined figures of 19 for 222, with a run out being the only dismissal not going to either of the spinners in the match. Subrayen ended the match with career-best innings and match figures of 7/52 and 11/97, respectively, while Smuts took 5/67 in the second innings and ended with match figures of 8/125. Given the conditions and the pitch that was prepared for the encounter, Erwee was happy with the efforts of the spinners. “It was brilliant from Jon-Jon and Subs. They obviously know their role in the team, and they grabbed the opportunity to play in these conditions and are fulfilling their roles to the best of their abilities, and that’s all we can ask for.” Warriors v Knights - Knights won by 161 runs The Knights secured a massive 161-run against the Warriors at St Georges’ Park. Knights were off to a great start when they made a score of over 400 runs in their first innings and, in return, restricted their hosts to 134/10. Even though the visitors were bowled out for 157 in the second innings, the damage had already been done as the Warriors needed 455 runs to win. Matthew Breetzke’s century (111) had given the hosts a fighting chance, along with Rudi Second's (77), but the Warriors were bowled out for 284 on day four. Lions v Western Province - Lions won by 28 runs Bjorn Fortuin delivered a stellar performance and theLions claimed a 28-run victory against Western Province as the Cricket South Africa (CSA) 4-Day Franchise Series continued in Johannesburg. Fortuin scored an unbeaten century (123* off 143) to help the Lions to a first-innings score of 323 runs. He then followed his unbeaten ton from day one with a half-century, and with Dominic Hendricks (80), the Lions finished the second innings on 315 all out. He backed up his batting wins by claiming crucial wickets throughout the innings. With a total of nine wickets in the match, Fortuin returned 3/63 and 6/69 in the two innings. Western Province, who posted 423 in the first innings, had to chase 216 runs to win the match. A disciplined bowling unit from the Lions saw the Cape Town-based men fall 28 runs short. Efforts from Daniel Smith (61) and Edward Moore (59) were not enough, and the visitors were bowled for 187 runs.","pubDate":"2023-03-01 18:14:43","image_url":"https://scripts.24.co.za/img/sites/sport24.png","source_id":"news24","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Matthew Wade fifty in vain for Karachi in Pakistan SL","link":"https://www.perthnow.com.au/sport/cricket/matthew-wade-fifty-in-vain-for-karachi-in-pakistan-sl-c-9912913","keywords":null,"creator":["Staff Writers"],"video_url":null,"description":"Matthew Wade cracked 53 for Karachi Kings but it wasn't enough to stop them losing by 24 runs to Peshawar Zalmi in the Pakistan Super League.","content":"Australian star Matthew Wade has blasted 53 off 41 balls for Karachi Kings but it still didn't give them enough momentum in their run chase to win their Pakistan Super League clash with Peshawar Zalmi. Peshawar made a gallant recovery from a top-order collapse against fast bowler Mohammad Amir to win Wednesday's match by 24 runs. Half centuries by Rovman Powell (64), Tom Kohler-Cadmore (56 not out) and Pakistan under-19 batter Haseebullah (50) had lifted Peshawar to 5-197 after Amir's three-wicket burst had put them in deep trouble at 3-2 inside the first three overs. Karachi top-order batters yet again struggled before captain Imad Wasim's unbeaten 57 took them to 8-173. Afghanistan bowlers Azmatullah Omarzai (3-28) and Mujeeb Ur Rahman (2-28), playing their first game of the season, kept striking with regular intervals to hand Karachi their fifth defeat in the tournament in seven games. Peshawar broke into the top four with their third win in six games behind Islamabad United on net run-rate. Lahore Qalandars and Multan Sultans occupy the top two spots with eight points each. Amir's brilliant first over in his hometown after missing the last two games due to a groin injury resulted in both Mohammad Haris and captain Babar Azam getting dismissed lbw without scoring within the first five balls from the left-armer. Left-handed Saim Ayub then pulled Amir to deep square leg before Haseebullah and Kohler-Cadmore revived the innings with a 82-run stand. Karachi's run chase just couldn't get going despite Wade's half-century that featured nine boundaries. He was eventually bowled, trying to heave Mujeeb Ur Rahman out of the ground, leaving Karachi on 5-95. Left-hander Wade could earlier have been out for one but Peshawar didn't go for a caught behind television referral. Mujeeb and Omarzai claimed two wickets each and Shoaib Malik offered a tame return catch to Aamer Jamal (3-43) as Karachi lost half of their side by the 12th over for 95 runs.","pubDate":"2023-03-01 20:19:00","image_url":"https://images.perthnow.com.au/publication/C-9912913/29c1e49c294f9a817ae2cc52a8475fefbfd104e9-16x9-x0y0w1280h720.jpg","source_id":"perthnow","category":["sports"],"country":["australia"],"language":"english"},{"title":"Kuhnemann and Lyon spell India’s doom, spin hosts out for a paltry 109","link":"https://www.thehindu.com/sport/cricket/kuhnemann-and-lyon-spell-indias-doom-spin-hosts-out-for-a-paltry-109/article66569250.ece","keywords":null,"creator":null,"video_url":null,"description":"The former’s five-for well complemented by the latter’s three; Australia furthers its cause with batters turning in better collective performance to help the visitors finish the opening day on 156 for four, with Jadeja claiming all wickets","content":"There was turn, bounce and puffs of dust from the dry surface in the first hour. It was a sign of what to expect. India, electing to bat, was spun out for 109 on the opening day of the third Test of the Border-Gavaskar Trophy at the Holkar Stadium here on Wednesday. The odd delivery kept low too, but the Australians did better than expected, finishing the day at 156 for four. Ace left-arm spinner Ravindra Jadeja scalped all four. Australia, ahead by 47, holds the edge. Thursday’s first hour will be critical. Matthew Kuhnemann was Australia’s hero with five for 16. He settled on an ideal length, in the dry area of the pitch, and struck with his quicker variety of spin. On view was control, accuracy, turn and incision. Then, the pitch appeared to settle down. The Australians too batted normally without pre-meditation. Jadeja struck early, having Travis Head leg-before playing across. Then big fish Marnus Labuschagne, on zero, played on to the left-arm spinner, but it turned out to be another no-ball from Jadeja. The left-handed Usman Khawaja and Labuschagne negotiated the Indian spinners capably. There were no desperate sweeps. Both batters trusted their defence and used their feet. Labuschagne, in particular, played a lot off his backfoot, using the depth of the crease. As the partnership swelled, the Indians became desperate. Reviews were wasted and the one occasion when replay showed R. Ashwin had trapped Labuschagne leg-before, the review had not been taken. Khawaja’s cover-drives had elegance. Like Labuschagne, he was picking runs in front of the wicket, which is a good sign. He was also the dominant partner. Eventually, Jadeja ended the 96-run second-wicket partnership, castling Labuschagne (31) with low bounce. Khawaja was coasting on 60 (147b, 4x4) when he swept Jadeja into Shubman Gill’s hands at deep mid-wicket. A big strike. Steve Smith was batting with belief. However, soon after whipping Jadeja to the boundary, he nicked an away-spinner to be well held by ’keeper K.S. Bharat. Earlier, Kuhnemann gave little away, keeping it tight, Consistently turning the ball from the right-hander, he also got a few to go through straight. Rohit Sharma charged him and was fatally beaten by the away-turner and the crisp-stroking Gill edged a Kuhnemann delivery that turned from off-stump. Shreyas Iyer, denied width for the cut by Kuhnemann, played on. And Ashwin fell to a full delivery of sharp turn from the left-armer. Wily off-spinner Nathan Lyon maintained the pressure created by Kuhnemann. He spun one into Cheteshwar Pujara, who was bowled attempting to cut. Lyon spun his deliveries, and mixed his trajectory. Jadeja, promoted for a left-right combination, attempted to punch Lyon, mistimed into cover’s hands. Young off-spinner Todd Murphy chipped in too, sending back a battling Virat Kohli (22) with a quicker, fuller delivery. Bharat sparkled briefly with his slog-sweeps but fell to a Lyon delivery that held its line. Tottering at 84 for seven going into lunch, the Indian innings concluded soon despite some hefty blows from Umesh Yadav. The Test began dramatically. Replays showed Rohit was out twice in Mitchell Starc’s fiery first over, caught behind and then leg-before. The Aussies did not review on both occasions. How will the Test end? Australia is ahead but this match could go either way.","pubDate":"2023-03-01 20:15:00","image_url":null,"source_id":"thehindu","category":["sports"],"country":["india"],"language":"english"},{"title":"News24.com | Proteas skipper Bavuma caps off miserable Centurion batting return with historic Test pair","link":"https://www.news24.com/sport/Cricket/Proteas/proteas-skipper-bavuma-caps-off-miserable-centurion-batting-return-with-historic-test-pair-20230301","keywords":null,"creator":null,"video_url":null,"description":"Proteas Test skipper Temba Bavuma became the fourth member of an inglorious club of Test match leaders who bagged a pair on their leadership debut.","content":"At SuperSport Park, Centurion Proteas Test skipper Temba Bavuma became the fourth member of an inglorious club of Test match leaders who bagged a pair on their leadership debut on Wednesday. Bavuma was twice collected by West Indian paceman Alzarri Joseph on the first and second days of the first Test to join Australian Mark Taylor, Pakistan's Rashid Latif, and Bangladesh's Habibul Bashar in the not-so-distinguished group. In the first innings, Bavuma was trapped leg before after two balls by Joseph on the first afternoon, but on a high-pressured second evening, he was caught behind by Joshua da Silva to complete a miserable first game with the bat as skipper. Taylor was the first of the captaincy lot to bag a pair on leadership debut, with his blobs coming against Pakistan in Karachi in 1994. Latif was subjected to that ignominy against South Africa in Gqeberha in 1998, while Bashar, who captained a rather rudimentary Bangladeshi side, faced five balls across his pair against Zimbabwe in Harare in 2004. The trio of skippers all found themselves on the losing side, with Taylor's Australians being pipped to the post in the timeless Karachi Test that Pakistan won by one wicket. Latif's disjointed Pakistan team was subjected to a 259-run beating, while Bangladesh were beaten by 183 runs.","pubDate":"2023-03-01 19:14:49","image_url":"https://scripts.24.co.za/img/sites/sport24.png","source_id":"news24","category":["sports"],"country":["south africa"],"language":"english"},{"title":"News24.com | Anrich the Ace blitzes the Windies with 5-star bowling, but Proteas' brittle bats come tumbling down","link":"https://www.news24.com/sport/Cricket/Proteas/anrich-the-ace-blitzes-the-windies-with-5-star-bowling-but-windies-fight-back-20230301","keywords":null,"creator":null,"video_url":null,"description":"A frantic second evening in which 11 wickets fell left South Africa teetering at 47/4 after bowling out the West Indies for 212, leaving the first Test finely poised after two days.","content":"At SuperSport Park, Centurion Aiden Markram stands between the West Indies and a challenging fourth-innings chase as the visitors fought back on what was a second evening of epic wicket-taking proportions. South Africa, who were bowled out for 342 inside the first 40 minutes of the day, finished the second day on 47/4, 179 runs ahead of the West Indies, who were bowled out for 212 inside two sessions on Wednesday. The cookie crumbled with 11 wickets falling in a hectic hour-and-three-quarters during which the West Indies subsided from 169/3 to their eventual total through an electric burst of hostile fast-bowling from Anrich Nortje (5/35). While the West Indians allowed Markram (35*) to race to a 33-ball knock with six fours, they combined to rip out the rest of SA's top and middle-order to leave the Test match delicately poised. Alzarri Joseph (5/81 and 2/17) coaxed another false ramp shot to third man from Dean Elgar (1) and removed captain Temba Bavuma first ball, with Kemar Roach (1/28) doing the same to Tony de Zorzi (0)i as the hosts, weirdly, elected not to use a night-watchman. That ploy backfired badly when Keegan Petersen (7) was trapped plumb in front with what became the last ball of the day and the first of Jason Holder's (1/0) spell. It left the game finely balanced as the hosts were again failed by their batting. The Windies, who started South Africa's second innings badly, made full use of the fading light in the last 34 minutes of the play to bring themselves back into the game after a terminal collapse. South Africa's late-evening meltdown undid the diligent bowling of the afternoon and evening sessions where they first constricted, then disemboweled the West Indian batting. That South Africa earned a lead of 130 was down to Nortje's fire and brimstone, accompanied by unrelenting accuracy from the rest of the pace attack. When the West Indies were 169/3 nearly an hour after tea, it would have been easy for an attack of lesser resolve to spit the dummy. But the Proteas didn't let the West Indies out of their sight on the second afternoon and only allowed them 64 runs in 29 overs, which was in contrast to the 71 they scored when they started batting in the morning session. The Proteas did have the wickets of Kraigg Brathwaite (11) and Tagenarine Chanderpaul (22) to shout home about in the first session. Brathwaite was castled by a wonderful leg-cutter from Kagiso Rabada (2/44) that pitched on middle and off-stump and hit the top of off. Chanderpaul was marinated by some aggressive fast bowling and, by the time he had gifted Gerald Coetzee his first Test wicket when he popped a catch to Senuran Muthusamy at gully, he had long lost his nerve. However, those dismissals allowed for a punchy third-wicket stand of 64 between Raymon Reifer and Jermaine Blackwood (37), who had contrasting, but effective batting styles to combat South Africa's threat. Where the left-handed Reifer (62), whose third Test 50 came off 117 balls, eschewed anything short and waited for the ball to be absolutely full, Blackwood was happy to take the attack to the hosts. Blackwood's blade is chancy, but also feisty to a point where if it's unrestrained, it either spells trouble for the opponent or his team. He flashed hard, but once a squeeze was applied when Muthusamy was brought into the attack, he was unable to play himself out of the fielding press. This allowed Nortje to test his temperament with a bumper/yorker approach and then Blackwood inside-edged a catch to Heinrich Klaasen. While there was still some batting to come in the form of Roston Chase (22), Kyle Mayers (18), Joshua da Silva (4), and Holder (0), the West Indies' chance of scoring quickly evaporated with Blackwood's dismissal. Reifer and Chase took the score to 169, but when the former tickled an edge to Klaasen off the luckless Marco Jansen (1/64), the gap to kick the door down was prised open. Nortje, in the best way he knows, then dismembered the West Indian order when he forced Chase to edge one to Elgar at first slip. That took the West Indies to 169/5 which quickly became 179/6 when Da Silva cut a Nortje short ball straight to Jansen at point. Holder couldn't see out Nortje's over as three balls later he was pouched at second slip by Markram as the Windies slipped to 179/7. Joseph (4) provided a modicum of resistance, but when he replicated Da Silva's dismissal by picking out Jansen at point off Nortje, the Windies had subsided to 190/8. Mayers became Nortje's fifth victim when he holed out to Jansen at deep fine-leg off the fast man, before Coetzee (2/45) grabbed his second scalp when he trapped Shannon Gabriel (7) plumb in front. That left the West Indies with a hill to climb and the four late wickets will aid their cause, but with another evening collapse accelerating the game, Centurion is set for another Test that won't go the full five days. Scores in brief South Africa: 342 (Aiden Markram 115, Dean Elgar 71, Alzarri Joseph 5/81) and 49/4 (Markram 35*, Joseph 2/17, Jason Holder 0/1, Kemar Roach 1/28) West Indies: 212 (Raymon Reifer 62, Jermaine Blackwood 37, Anrich Nortje 5/35, Kagiso Rabada 2/44, Gerald Coetzee 2/45) South Africa leads by 179 runs","pubDate":"2023-03-01 19:14:49","image_url":"https://scripts.24.co.za/img/sites/sport24.png","source_id":"news24","category":["sports"],"country":["south africa"],"language":"english"},{"title":"News24.com | WATCH | Speedster Nortje recruits Anrich's army to aid Proteas' cause","link":"https://www.news24.com/sport/Cricket/Proteas/watch-speedster-nortje-recruits-anrichs-army-to-aid-proteas-cause-20230301","keywords":null,"creator":null,"video_url":null,"description":"Anrich Nortje's 5/36 was the standout performance for the Proteas as they bowled out the West Indies for 212 on the second day of the first Test at Centurion and he had the backing of a group of locals who copied his every move.","content":"Anrich Nortje's 5/36 was the standout performance for the Proteas as they bowled out the West Indies for 212 on the second day of the first Test at Centurion. READ | Anrich the Ace blitzes the Windies with 5-star bowling, but Windies fight back While support in the ground was sparse, Nortje's excellent spell saw him recruit a band of followers that quickly became known as Anrich's Army. They'll have to work on their bowling actions if they hope to make the grade, however. WATCH their antics below:","pubDate":"2023-03-01 18:53:27","image_url":"https://scripts.24.co.za/img/sites/sport24.png","source_id":"news24","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Top order collapse ‘not ideal’ as Proteas seek 250 target for Windies — Nortje","link":"https://www.citizen.co.za/sport/cricket/top-order-collapse-proteas-windies-nortje/","keywords":["Cricket","anrich nortje","centurion","proteas cricket team","west indies"],"creator":["Ross Roche"],"video_url":null,"description":"The only batter to show good form on day two was first innings centurion Aiden Markram.","content":"The Proteas need a lead of at least 250 runs on a misbehaving wicket to give them the best possible chance of winning the first Test against the West Indies at SuperSport Park in Centurion, according to fast bowler Anrich Nortje. After the Proteas were bowled out for 342 in their first innings on day two’s morning session, the Windies then responded with 212 all out, thanks in large part to Nortje’s fourth Test five wicket haul, with him finishing with figures of 5/36. This gave the South Africans a big 130-run lead, only for their top order to fall apart spectacularly as the Proteas reached the close of play on 49/4 in their second innings , with an overall lead of 179-runs. First innings centurion Aiden Markram (35no) will have the massive task of guiding the middle and lower order on day three on Thursday to try and get them to a competitive total. “It’s definitely not ideal (the top order collapse). But we still have the middle order and Aiden’s been looking really good. So we still have the batters to get us a proper lead. Hopefully we can get one or two guys in and take the lead to 250 plus,” said Nortje after the day’s play. “I don’t know if that will be enough but I think it will. It is definitely competitive, but the more we can get the better. I think 250 plus is a really good score, especially the way it (the wicket) looks like it’s misbehaving at this stage.” Nortje continued: “Hopefully on Thursday we can come up with a partnership. Having a partnership is going to be crucial for us. We bat to 11, I am at 11 so we go all the way down,” Nortje claimed with a laugh). “I’m joking. But hopefully we can get one or two partnerships and get a decent lead.” “We will take anything. Obviously runs on the board are important. But hopefully we can come out strong. The middle order has been doing well, whether it is domestically in leagues or wherever it is. So hopefully they can come out tomorrow (on Thursday) and stamp their authority.”","pubDate":"2023-03-01 18:42:12","image_url":"https://media.citizen.co.za/wp-content/uploads/2023/03/SA-Windies-Bavuma-1.jpg","source_id":"citizen","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Delhi will look to capitalise on its explosive batting, spin attack","link":"https://www.thehindu.com/sport/delhi-will-look-to-capitalise-on-its-explosive-batting-spin-attack/article66569386.ece","keywords":null,"creator":null,"video_url":null,"description":"The franchise used its IPL experience at the auction for the inaugural Women’s Premier League to put together a formidable squad","content":"Delhi Capitals knows a thing or two about auctioning cricketers. The franchise used its IPL experience at the auction for the inaugural Women’s Premier League to put together a formidable squad. It could consider itself a bit lucky that it got Meg Lanning for only ₹1.1 crore; it was one of the best buys at the auction. Besides being a run machine — she has amassed over 8,000 runs with 17 centuries in international white-ball cricket — she has been an inspiring captain for Australia, which she led to the Women’s T20 World Cup triumph on Sunday at Cape Town. Lanning is part of a strong batting line-up that includes Jemimah Rodrigues, the franchise’s biggest buy at ₹2.2 crore, and Shafali Verma, who can take any bowling attack apart in no time. South African Marizanne Kapp — another great buy at ₹1.5 crore — is a serial tournament winner and one of the game’s leading all-rounders. Young Alice Capsey of England and seasoned Australian Laura Harris are explosive options. Jasia Akhter, from Jammu & Kashmir, too, is a hard-hitter. All these batters are right-handed, though. In Taniya Bhatia, Delhi has one of India’s most talented wicketkeepers, but she will be keen to work on her strike-rate. As she tries to come back into the national team, she could not have hoped for a better stage than the WPL. Capitals have assembled a good spin attack in the form of Australian Jess Jonassen and the two experienced Yadavs — Radha and Poonam. Shikha Pandey, who has recently come back to the Indian team, and Arundhati Reddy, who is trying to do that, are among the pacers in the squad. The franchise has also bought the exciting prospect Titas Sadhu, the 18-year-old seamer who caught the eye at the Under-19 World Cup in South Africa. Tara Norris, the American who is the only player to get picked from an associate nation at the auction, offers left-arm variety in seam bowling. It may be noted that the WPL allows a team to have one cricketer from an associate country in the eleven in addition to the four overseas players. The dugout: Jemimah Rodrigues, Shafali Verma, Marizanne Kapp, Meg Lanning, Alice Capsey, Shikha Pandey, Jess Jonassen, Laura Harris, Radha Yadav, Arundhati Reddy, Taniya Bhatia, Minnu Mani, Poonam Yadav, Sneha Deepthi, Titas Sadhu, Tara Norris, Jasia Akhter and Aparna Mondal. Coach: Jonathan Batty. The schedule: March 5: vs Royal Challengers Bangalore (Brabourne Stadium) March 7: UP Warriorz (DY Patil) March 9: Mumbai Indians (DY Patil) March 11: Gujarat Giants (DY Patil) March 13: Royal Challengers Bangalore (DY Patil) March 16: Gujarat Giants (Brabourne) March 20: Mumbai Indians (DY Patil) March 21: UP Warriorz (Brabourne) (The WPL will be held in Mumbai from March 4 to 26).","pubDate":"2023-03-01 18:39:28","image_url":null,"source_id":"thehindu","category":["sports"],"country":["india"],"language":"english"},{"title":"Watched closely how Jadeja and Ashwin use the crease: Kuhnemann","link":"https://www.thehindu.com/sport/watched-closely-how-jadeja-and-ashwin-use-the-crease-kuhnemann/article66569270.ece","keywords":null,"creator":null,"video_url":null,"description":"Kuhnemann said senior bowler Lyon was very encouraging and implored him to keep things tight","content":"Cricketing tales often hang on slender threads. Journeying to India, Matthew Kuhnemann was not the first-choice left-arm spinner for Australia. That position went to Ashton Agar who was considered the second spinner in the Australian team behind Nathan Lyon. How things changed! The 26-year-old Kuhnemann, with just over 30 First Class wickets, leapfrogged over Agar in Australia’s practice sessions. The think-tank too felt Kuhnemman’s quicker variety of left-arm spin was better suited to these wickets. Kuhnemann was living a dream within a dream here on Wednesday, his first five-for in Tests being an attention-grabbing five for 16 off nine probing overs on day one of the third Test. He turned the ball, was accurate and used the crease to create the angles. “It feels really good to pick five wickets in a Test against India,” said Kuhnemann after the day’s play. Importantly, Kuhnemann said he had learnt much from watching Ravindra Jadeja and R. Ashwin bowl in the series. “I watched them closely. In particular, how they use the crease.” Kuhnemann said senior bowler Lyon was very encouraging and implored him to keep things tight. Kuhnemann said batting on this pitch was challenging. “It is a dry pitch. Some deliveries are keeping low,” he said. India’s batting coach Vikram Rathour said, “It is a challenging wicket. We needed more runs. We failed as a batting unit.” He added, “The wicket has slowed down.” Rathour said, “With the WTC points at stake, there is pressure to win home games. So there is nothing wrong in preparing such wickets and making best use of home conditions to win. But these pitches are also a double-edged sword.” Asked about India wasting reviews, he said: “You cannot always get them right.”","pubDate":"2023-03-01 18:34:00","image_url":null,"source_id":"thehindu","category":["sports"],"country":["india"],"language":"english"},{"title":"Ex-England cricketer Bresnan accused of racist language","link":"https://www.perthnow.com.au/sport/cricket/ex-england-cricketer-bresnan-accused-of-racist-language-c-9912249","keywords":null,"creator":["Staff Writers"],"video_url":null,"description":"Former England bowler Tim Bresnan is alleged to have used a racist comment towards Azeem Rafiq's sister, a disciplinary panel has heard.","content":"Tim Bresnan has been accused of using a racist comment towards Azeem Rafiq's sister while the England and Wales Cricket Board told a disciplinary panel it is \"more likely than not\" three former Yorkshire players used racist or discriminatory language. The public Cricket Discipline Commission hearing into allegations of racism from former Yorkshire player Rafiq began in London on Wednesday with the cases of England pair Matthew Hoggard and Bresnan and their one-time county teammate John Blain being heard. The trio all deny a charge of bringing the game into disrepute and allegations of using racial or discriminatory language. ECB lawyer Jane Mulcahy KC stated it is \"more likely than not\" each of the trio used the racist phrases being alleged - which included \"P***\" - due to a number of reasons, including the systemic use of racist or discriminatory language during that period at Yorkshire. During the first day of proceedings it was alleged Bresnan used a racial slur against Rafiq's sister Amna in 2014. Bresnan, Mulcahy said, is alleged to have directed the term \"fit P***\" and \"FP\" towards Asian women, including Rafiq's sister Amna at an official Yorkshire media day. He was also alleged to have referred to Rafiq and Asian teammates Adil Rashid, Ajmal Shahzad and Rana Naved-ul-Hasan as \"the brothers\" and \"you lot\". Bresnan denies the allegations. He said the term \"brothers\" was used but not in a racial or discriminatory context. He detailed his use of the term \"brothers\" or \"bro\" in WhatsApp messages or group chats as part of his defence. He also insisted he had no recollections of using the phrase \"you lot\" in a match against Derbyshire and claimed to have never met Amna Rafiq. But Mulcahy insisted for each alleged charge that \"on balance of probability, more likely than not, that he used the phrase and it was racist or discriminatory\". Former England captain Michael Vaughan, Hoggard, Bresnan, Blain, Andrew Gale and Richard Pyrah all face charges related to the use of racially discriminatory language, with Vaughan the only one set to appear in person at the hearing. Yorkshire admitted four amended charges and Gary Ballance admitted a charge which meant both were not required to participate. Mulcahy also set out the allegations against former England bowler Hoggard, which included creating and using the term \"Rafa the Kaffir\", repeated use of the word \"P***\", referring to Rafiq and other players as \"you lot\" and use of the term \"TBM\" (token black man) towards teammate Ismail Dawood. Hoggard admitted using the term \"Rafa the Kaffir\", but denied he created it and it was used in the context alleged. He admitted it did breach ECB directive 3.3. He admitted the use of the word \"P***\" but denied any racist or discriminatory intent and could not remember exactly on what occasions this occurred. He also denied it breached ECB directive. While Hoggard also admitted using the phrase \"you lot\", he denied the use of it to identify a group of ethnic minority players and denied it breached ECB directive 3.3. Hoggard did admit to using the phrase \"TBM\" or \"token black man\" and that it breached directive 3.3 but denied it had any racist or discriminatory intent. Mulcahy told the panel \"it is obvious that Hoggard has caused prejudice and/or disrepute for cricket and himself\" due to the systemic use of racist or discriminatory language at Yorkshire and the fact he admitted to using the word \"P***\".","pubDate":"2023-03-01 18:24:17","image_url":"https://images.perthnow.com.au/publication/C-9912249/bd42373cc4f0724240a69a30a115b2784168069f-16x9-x0y0w1280h720.jpg","source_id":"perthnow","category":["sports"],"country":["australia"],"language":"english"},{"title":"News24.com | Lions win CSA-Day Franchise Series thriller against WP, Dolphins make it three on the trot","link":"https://www.news24.com/sport/Cricket/Domestic/wrap-csa-4-day-franchise-series-20230226","keywords":null,"creator":null,"video_url":null,"description":"A wrap of all the collated fixtures, scores and reports from the latest round of action in the CSA 4-Day Franchise Series:","content":"A wrap of all the collated fixtures, scores and reports from the latest round of action in the CSA 4-Day Franchise Series: 26 FEBRUARY - 1 MARCH Division 1: Dolphins v Titans - Dolphins won by 7 wickets The Dolphins cruised to a convincing seven-wicket win over the Titans at Kingsmead Stadium on Wednesday morning, taking their current winning streak to three matches in the CSA 4-Day Domestic Series. Following a poor start to the campaign, the Dolphins have bounced back since the re-start and have won their last three matches in the tournament, which revitalised their chances of winning the overall crown for a second time in three seasons. After restricting the Titans to 138 all out in their second innings, the Dolphins needed 51 runs to win the match and started the final morning with ten wickets in hand and 46 runs to win. They lost the wickets of SJ Erwee, Marques Ackerman and Bryce Parsons; however, it was Khaya Zondo and first-innings hero Jason Smith who took the Dolphins to a memorable victory on their home ground. The renaissance of the Dolphins in the 4-Day series has been a positive for SJ Erwee, who has taken over the captaincy of the Dolphins in the red ball competition in the absence of Keshav Maharaj, who is with the Proteas. “We started really poorly in this competition, but it’s really nice to have three wins on the bounce now, and the guys are really rolling with this momentum,” Erwee said. “Guys are doing the hard yards and are doing the correct preparation for the opposition and the games we are playing. “The next game for us is at home again, and in our conditions, is exactly where we want to be.” The Dolphins spinners Prenelan Subrayen and Jon-Jon Smuts finished the match with combined figures of 19 for 222, with a run out being the only dismissal not going to either of the spinners in the match. Subrayen ended the match with career-best innings and match figures of 7/52 and 11/97, respectively, while Smuts took 5/67 in the second innings and ended with match figures of 8/125. Given the conditions and the pitch that was prepared for the encounter, Erwee was happy with the efforts of the spinners. “It was brilliant from Jon-Jon and Subs. They obviously know their role in the team, and they grabbed the opportunity to play in these conditions and are fulfilling their roles to the best of their abilities, and that’s all we can ask for.” Warriors v Knights - Knights won by 161 runs The Knights secured a massive 161-run against the Warriors at St Georges’ Park. Knights were off to a great start when they made a score of over 400 runs in their first innings and, in return, restricted their hosts to 134/10. Even though the visitors were bowled out for 157 in the second innings, the damage had already been done as the Warriors needed 455 runs to win. Matthew Breetzke’s century (111) had given the hosts a fighting chance, along with Rudi Second's (77), but the Warriors were bowled out for 284 on day four. Lions v Western Province - Lions won by 28 runs Bjorn Fortuin delivered a stellar performance and theLions claimed a 28-run victory against Western Province as the Cricket South Africa (CSA) 4-Day Franchise Series continued in Johannesburg. Fortuin scored an unbeaten century (123* off 143) to help the Lions to a first-innings score of 323 runs. He then followed his unbeaten ton from day one with a half-century, and with Dominic Hendricks (80), the Lions finished the second innings on 315 all out. He backed up his batting wins by claiming crucial wickets throughout the innings. With a total of nine wickets in the match, Fortuin returned 3/63 and 6/69 in the two innings. Western Province, who posted 423 in the first innings, had to chase 216 runs to win the match. A disciplined bowling unit from the Lions saw the Cape Town-based men fall 28 runs short. Efforts from Daniel Smith (61) and Edward Moore (59) were not enough, and the visitors were bowled for 187 runs.","pubDate":"2023-03-01 18:14:43","image_url":"https://scripts.24.co.za/img/sites/sport24.png","source_id":"news24","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Matthew Wade fifty in vain for Karachi in Pakistan SL","link":"https://www.perthnow.com.au/sport/cricket/matthew-wade-fifty-in-vain-for-karachi-in-pakistan-sl-c-9912913","keywords":null,"creator":["Staff Writers"],"video_url":null,"description":"Matthew Wade cracked 53 for Karachi Kings but it wasn't enough to stop them losing by 24 runs to Peshawar Zalmi in the Pakistan Super League.","content":"Australian star Matthew Wade has blasted 53 off 41 balls for Karachi Kings but it still didn't give them enough momentum in their run chase to win their Pakistan Super League clash with Peshawar Zalmi. Peshawar made a gallant recovery from a top-order collapse against fast bowler Mohammad Amir to win Wednesday's match by 24 runs. Half centuries by Rovman Powell (64), Tom Kohler-Cadmore (56 not out) and Pakistan under-19 batter Haseebullah (50) had lifted Peshawar to 5-197 after Amir's three-wicket burst had put them in deep trouble at 3-2 inside the first three overs. Karachi top-order batters yet again struggled before captain Imad Wasim's unbeaten 57 took them to 8-173. Afghanistan bowlers Azmatullah Omarzai (3-28) and Mujeeb Ur Rahman (2-28), playing their first game of the season, kept striking with regular intervals to hand Karachi their fifth defeat in the tournament in seven games. Peshawar broke into the top four with their third win in six games behind Islamabad United on net run-rate. Lahore Qalandars and Multan Sultans occupy the top two spots with eight points each. Amir's brilliant first over in his hometown after missing the last two games due to a groin injury resulted in both Mohammad Haris and captain Babar Azam getting dismissed lbw without scoring within the first five balls from the left-armer. Left-handed Saim Ayub then pulled Amir to deep square leg before Haseebullah and Kohler-Cadmore revived the innings with a 82-run stand. Karachi's run chase just couldn't get going despite Wade's half-century that featured nine boundaries. He was eventually bowled, trying to heave Mujeeb Ur Rahman out of the ground, leaving Karachi on 5-95. Left-hander Wade could earlier have been out for one but Peshawar didn't go for a caught behind television referral. Mujeeb and Omarzai claimed two wickets each and Shoaib Malik offered a tame return catch to Aamer Jamal (3-43) as Karachi lost half of their side by the 12th over for 95 runs.","pubDate":"2023-03-01 20:19:00","image_url":"https://images.perthnow.com.au/publication/C-9912913/29c1e49c294f9a817ae2cc52a8475fefbfd104e9-16x9-x0y0w1280h720.jpg","source_id":"perthnow","category":["sports"],"country":["australia"],"language":"english"},{"title":"Kuhnemann and Lyon spell India’s doom, spin hosts out for a paltry 109","link":"https://www.thehindu.com/sport/cricket/kuhnemann-and-lyon-spell-indias-doom-spin-hosts-out-for-a-paltry-109/article66569250.ece","keywords":null,"creator":null,"video_url":null,"description":"The former’s five-for well complemented by the latter’s three; Australia furthers its cause with batters turning in better collective performance to help the visitors finish the opening day on 156 for four, with Jadeja claiming all wickets","content":"There was turn, bounce and puffs of dust from the dry surface in the first hour. It was a sign of what to expect. India, electing to bat, was spun out for 109 on the opening day of the third Test of the Border-Gavaskar Trophy at the Holkar Stadium here on Wednesday. The odd delivery kept low too, but the Australians did better than expected, finishing the day at 156 for four. Ace left-arm spinner Ravindra Jadeja scalped all four. Australia, ahead by 47, holds the edge. Thursday’s first hour will be critical. Matthew Kuhnemann was Australia’s hero with five for 16. He settled on an ideal length, in the dry area of the pitch, and struck with his quicker variety of spin. On view was control, accuracy, turn and incision. Then, the pitch appeared to settle down. The Australians too batted normally without pre-meditation. Jadeja struck early, having Travis Head leg-before playing across. Then big fish Marnus Labuschagne, on zero, played on to the left-arm spinner, but it turned out to be another no-ball from Jadeja. The left-handed Usman Khawaja and Labuschagne negotiated the Indian spinners capably. There were no desperate sweeps. Both batters trusted their defence and used their feet. Labuschagne, in particular, played a lot off his backfoot, using the depth of the crease. As the partnership swelled, the Indians became desperate. Reviews were wasted and the one occasion when replay showed R. Ashwin had trapped Labuschagne leg-before, the review had not been taken. Khawaja’s cover-drives had elegance. Like Labuschagne, he was picking runs in front of the wicket, which is a good sign. He was also the dominant partner. Eventually, Jadeja ended the 96-run second-wicket partnership, castling Labuschagne (31) with low bounce. Khawaja was coasting on 60 (147b, 4x4) when he swept Jadeja into Shubman Gill’s hands at deep mid-wicket. A big strike. Steve Smith was batting with belief. However, soon after whipping Jadeja to the boundary, he nicked an away-spinner to be well held by ’keeper K.S. Bharat. Earlier, Kuhnemann gave little away, keeping it tight, Consistently turning the ball from the right-hander, he also got a few to go through straight. Rohit Sharma charged him and was fatally beaten by the away-turner and the crisp-stroking Gill edged a Kuhnemann delivery that turned from off-stump. Shreyas Iyer, denied width for the cut by Kuhnemann, played on. And Ashwin fell to a full delivery of sharp turn from the left-armer. Wily off-spinner Nathan Lyon maintained the pressure created by Kuhnemann. He spun one into Cheteshwar Pujara, who was bowled attempting to cut. Lyon spun his deliveries, and mixed his trajectory. Jadeja, promoted for a left-right combination, attempted to punch Lyon, mistimed into cover’s hands. Young off-spinner Todd Murphy chipped in too, sending back a battling Virat Kohli (22) with a quicker, fuller delivery. Bharat sparkled briefly with his slog-sweeps but fell to a Lyon delivery that held its line. Tottering at 84 for seven going into lunch, the Indian innings concluded soon despite some hefty blows from Umesh Yadav. The Test began dramatically. Replays showed Rohit was out twice in Mitchell Starc’s fiery first over, caught behind and then leg-before. The Aussies did not review on both occasions. How will the Test end? Australia is ahead but this match could go either way.","pubDate":"2023-03-01 20:15:00","image_url":null,"source_id":"thehindu","category":["sports"],"country":["india"],"language":"english"},{"title":"News24.com | Proteas skipper Bavuma caps off miserable Centurion batting return with historic Test pair","link":"https://www.news24.com/sport/Cricket/Proteas/proteas-skipper-bavuma-caps-off-miserable-centurion-batting-return-with-historic-test-pair-20230301","keywords":null,"creator":null,"video_url":null,"description":"Proteas Test skipper Temba Bavuma became the fourth member of an inglorious club of Test match leaders who bagged a pair on their leadership debut.","content":"At SuperSport Park, Centurion Proteas Test skipper Temba Bavuma became the fourth member of an inglorious club of Test match leaders who bagged a pair on their leadership debut on Wednesday. Bavuma was twice collected by West Indian paceman Alzarri Joseph on the first and second days of the first Test to join Australian Mark Taylor, Pakistan's Rashid Latif, and Bangladesh's Habibul Bashar in the not-so-distinguished group. In the first innings, Bavuma was trapped leg before after two balls by Joseph on the first afternoon, but on a high-pressured second evening, he was caught behind by Joshua da Silva to complete a miserable first game with the bat as skipper. Taylor was the first of the captaincy lot to bag a pair on leadership debut, with his blobs coming against Pakistan in Karachi in 1994. Latif was subjected to that ignominy against South Africa in Gqeberha in 1998, while Bashar, who captained a rather rudimentary Bangladeshi side, faced five balls across his pair against Zimbabwe in Harare in 2004. The trio of skippers all found themselves on the losing side, with Taylor's Australians being pipped to the post in the timeless Karachi Test that Pakistan won by one wicket. Latif's disjointed Pakistan team was subjected to a 259-run beating, while Bangladesh were beaten by 183 runs.","pubDate":"2023-03-01 19:14:49","image_url":"https://scripts.24.co.za/img/sites/sport24.png","source_id":"news24","category":["sports"],"country":["south africa"],"language":"english"},{"title":"News24.com | Anrich the Ace blitzes the Windies with 5-star bowling, but Proteas' brittle bats come tumbling down","link":"https://www.news24.com/sport/Cricket/Proteas/anrich-the-ace-blitzes-the-windies-with-5-star-bowling-but-windies-fight-back-20230301","keywords":null,"creator":null,"video_url":null,"description":"A frantic second evening in which 11 wickets fell left South Africa teetering at 47/4 after bowling out the West Indies for 212, leaving the first Test finely poised after two days.","content":"At SuperSport Park, Centurion Aiden Markram stands between the West Indies and a challenging fourth-innings chase as the visitors fought back on what was a second evening of epic wicket-taking proportions. South Africa, who were bowled out for 342 inside the first 40 minutes of the day, finished the second day on 47/4, 179 runs ahead of the West Indies, who were bowled out for 212 inside two sessions on Wednesday. The cookie crumbled with 11 wickets falling in a hectic hour-and-three-quarters during which the West Indies subsided from 169/3 to their eventual total through an electric burst of hostile fast-bowling from Anrich Nortje (5/35). While the West Indians allowed Markram (35*) to race to a 33-ball knock with six fours, they combined to rip out the rest of SA's top and middle-order to leave the Test match delicately poised. Alzarri Joseph (5/81 and 2/17) coaxed another false ramp shot to third man from Dean Elgar (1) and removed captain Temba Bavuma first ball, with Kemar Roach (1/28) doing the same to Tony de Zorzi (0)i as the hosts, weirdly, elected not to use a night-watchman. That ploy backfired badly when Keegan Petersen (7) was trapped plumb in front with what became the last ball of the day and the first of Jason Holder's (1/0) spell. It left the game finely balanced as the hosts were again failed by their batting. The Windies, who started South Africa's second innings badly, made full use of the fading light in the last 34 minutes of the play to bring themselves back into the game after a terminal collapse. South Africa's late-evening meltdown undid the diligent bowling of the afternoon and evening sessions where they first constricted, then disemboweled the West Indian batting. That South Africa earned a lead of 130 was down to Nortje's fire and brimstone, accompanied by unrelenting accuracy from the rest of the pace attack. When the West Indies were 169/3 nearly an hour after tea, it would have been easy for an attack of lesser resolve to spit the dummy. But the Proteas didn't let the West Indies out of their sight on the second afternoon and only allowed them 64 runs in 29 overs, which was in contrast to the 71 they scored when they started batting in the morning session. The Proteas did have the wickets of Kraigg Brathwaite (11) and Tagenarine Chanderpaul (22) to shout home about in the first session. Brathwaite was castled by a wonderful leg-cutter from Kagiso Rabada (2/44) that pitched on middle and off-stump and hit the top of off. Chanderpaul was marinated by some aggressive fast bowling and, by the time he had gifted Gerald Coetzee his first Test wicket when he popped a catch to Senuran Muthusamy at gully, he had long lost his nerve. However, those dismissals allowed for a punchy third-wicket stand of 64 between Raymon Reifer and Jermaine Blackwood (37), who had contrasting, but effective batting styles to combat South Africa's threat. Where the left-handed Reifer (62), whose third Test 50 came off 117 balls, eschewed anything short and waited for the ball to be absolutely full, Blackwood was happy to take the attack to the hosts. Blackwood's blade is chancy, but also feisty to a point where if it's unrestrained, it either spells trouble for the opponent or his team. He flashed hard, but once a squeeze was applied when Muthusamy was brought into the attack, he was unable to play himself out of the fielding press. This allowed Nortje to test his temperament with a bumper/yorker approach and then Blackwood inside-edged a catch to Heinrich Klaasen. While there was still some batting to come in the form of Roston Chase (22), Kyle Mayers (18), Joshua da Silva (4), and Holder (0), the West Indies' chance of scoring quickly evaporated with Blackwood's dismissal. Reifer and Chase took the score to 169, but when the former tickled an edge to Klaasen off the luckless Marco Jansen (1/64), the gap to kick the door down was prised open. Nortje, in the best way he knows, then dismembered the West Indian order when he forced Chase to edge one to Elgar at first slip. That took the West Indies to 169/5 which quickly became 179/6 when Da Silva cut a Nortje short ball straight to Jansen at point. Holder couldn't see out Nortje's over as three balls later he was pouched at second slip by Markram as the Windies slipped to 179/7. Joseph (4) provided a modicum of resistance, but when he replicated Da Silva's dismissal by picking out Jansen at point off Nortje, the Windies had subsided to 190/8. Mayers became Nortje's fifth victim when he holed out to Jansen at deep fine-leg off the fast man, before Coetzee (2/45) grabbed his second scalp when he trapped Shannon Gabriel (7) plumb in front. That left the West Indies with a hill to climb and the four late wickets will aid their cause, but with another evening collapse accelerating the game, Centurion is set for another Test that won't go the full five days. Scores in brief South Africa: 342 (Aiden Markram 115, Dean Elgar 71, Alzarri Joseph 5/81) and 49/4 (Markram 35*, Joseph 2/17, Jason Holder 0/1, Kemar Roach 1/28) West Indies: 212 (Raymon Reifer 62, Jermaine Blackwood 37, Anrich Nortje 5/35, Kagiso Rabada 2/44, Gerald Coetzee 2/45) South Africa leads by 179 runs","pubDate":"2023-03-01 19:14:49","image_url":"https://scripts.24.co.za/img/sites/sport24.png","source_id":"news24","category":["sports"],"country":["south africa"],"language":"english"},{"title":"News24.com | WATCH | Speedster Nortje recruits Anrich's army to aid Proteas' cause","link":"https://www.news24.com/sport/Cricket/Proteas/watch-speedster-nortje-recruits-anrichs-army-to-aid-proteas-cause-20230301","keywords":null,"creator":null,"video_url":null,"description":"Anrich Nortje's 5/36 was the standout performance for the Proteas as they bowled out the West Indies for 212 on the second day of the first Test at Centurion and he had the backing of a group of locals who copied his every move.","content":"Anrich Nortje's 5/36 was the standout performance for the Proteas as they bowled out the West Indies for 212 on the second day of the first Test at Centurion. READ | Anrich the Ace blitzes the Windies with 5-star bowling, but Windies fight back While support in the ground was sparse, Nortje's excellent spell saw him recruit a band of followers that quickly became known as Anrich's Army. They'll have to work on their bowling actions if they hope to make the grade, however. WATCH their antics below:","pubDate":"2023-03-01 18:53:27","image_url":"https://scripts.24.co.za/img/sites/sport24.png","source_id":"news24","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Top order collapse ‘not ideal’ as Proteas seek 250 target for Windies — Nortje","link":"https://www.citizen.co.za/sport/cricket/top-order-collapse-proteas-windies-nortje/","keywords":["Cricket","anrich nortje","centurion","proteas cricket team","west indies"],"creator":["Ross Roche"],"video_url":null,"description":"The only batter to show good form on day two was first innings centurion Aiden Markram.","content":"The Proteas need a lead of at least 250 runs on a misbehaving wicket to give them the best possible chance of winning the first Test against the West Indies at SuperSport Park in Centurion, according to fast bowler Anrich Nortje. After the Proteas were bowled out for 342 in their first innings on day two’s morning session, the Windies then responded with 212 all out, thanks in large part to Nortje’s fourth Test five wicket haul, with him finishing with figures of 5/36. This gave the South Africans a big 130-run lead, only for their top order to fall apart spectacularly as the Proteas reached the close of play on 49/4 in their second innings , with an overall lead of 179-runs. First innings centurion Aiden Markram (35no) will have the massive task of guiding the middle and lower order on day three on Thursday to try and get them to a competitive total. “It’s definitely not ideal (the top order collapse). But we still have the middle order and Aiden’s been looking really good. So we still have the batters to get us a proper lead. Hopefully we can get one or two guys in and take the lead to 250 plus,” said Nortje after the day’s play. “I don’t know if that will be enough but I think it will. It is definitely competitive, but the more we can get the better. I think 250 plus is a really good score, especially the way it (the wicket) looks like it’s misbehaving at this stage.” Nortje continued: “Hopefully on Thursday we can come up with a partnership. Having a partnership is going to be crucial for us. We bat to 11, I am at 11 so we go all the way down,” Nortje claimed with a laugh). “I’m joking. But hopefully we can get one or two partnerships and get a decent lead.” “We will take anything. Obviously runs on the board are important. But hopefully we can come out strong. The middle order has been doing well, whether it is domestically in leagues or wherever it is. So hopefully they can come out tomorrow (on Thursday) and stamp their authority.”","pubDate":"2023-03-01 18:42:12","image_url":"https://media.citizen.co.za/wp-content/uploads/2023/03/SA-Windies-Bavuma-1.jpg","source_id":"citizen","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Delhi will look to capitalise on its explosive batting, spin attack","link":"https://www.thehindu.com/sport/delhi-will-look-to-capitalise-on-its-explosive-batting-spin-attack/article66569386.ece","keywords":null,"creator":null,"video_url":null,"description":"The franchise used its IPL experience at the auction for the inaugural Women’s Premier League to put together a formidable squad","content":"Delhi Capitals knows a thing or two about auctioning cricketers. The franchise used its IPL experience at the auction for the inaugural Women’s Premier League to put together a formidable squad. It could consider itself a bit lucky that it got Meg Lanning for only ₹1.1 crore; it was one of the best buys at the auction. Besides being a run machine — she has amassed over 8,000 runs with 17 centuries in international white-ball cricket — she has been an inspiring captain for Australia, which she led to the Women’s T20 World Cup triumph on Sunday at Cape Town. Lanning is part of a strong batting line-up that includes Jemimah Rodrigues, the franchise’s biggest buy at ₹2.2 crore, and Shafali Verma, who can take any bowling attack apart in no time. South African Marizanne Kapp — another great buy at ₹1.5 crore — is a serial tournament winner and one of the game’s leading all-rounders. Young Alice Capsey of England and seasoned Australian Laura Harris are explosive options. Jasia Akhter, from Jammu & Kashmir, too, is a hard-hitter. All these batters are right-handed, though. In Taniya Bhatia, Delhi has one of India’s most talented wicketkeepers, but she will be keen to work on her strike-rate. As she tries to come back into the national team, she could not have hoped for a better stage than the WPL. Capitals have assembled a good spin attack in the form of Australian Jess Jonassen and the two experienced Yadavs — Radha and Poonam. Shikha Pandey, who has recently come back to the Indian team, and Arundhati Reddy, who is trying to do that, are among the pacers in the squad. The franchise has also bought the exciting prospect Titas Sadhu, the 18-year-old seamer who caught the eye at the Under-19 World Cup in South Africa. Tara Norris, the American who is the only player to get picked from an associate nation at the auction, offers left-arm variety in seam bowling. It may be noted that the WPL allows a team to have one cricketer from an associate country in the eleven in addition to the four overseas players. The dugout: Jemimah Rodrigues, Shafali Verma, Marizanne Kapp, Meg Lanning, Alice Capsey, Shikha Pandey, Jess Jonassen, Laura Harris, Radha Yadav, Arundhati Reddy, Taniya Bhatia, Minnu Mani, Poonam Yadav, Sneha Deepthi, Titas Sadhu, Tara Norris, Jasia Akhter and Aparna Mondal. Coach: Jonathan Batty. The schedule: March 5: vs Royal Challengers Bangalore (Brabourne Stadium) March 7: UP Warriorz (DY Patil) March 9: Mumbai Indians (DY Patil) March 11: Gujarat Giants (DY Patil) March 13: Royal Challengers Bangalore (DY Patil) March 16: Gujarat Giants (Brabourne) March 20: Mumbai Indians (DY Patil) March 21: UP Warriorz (Brabourne) (The WPL will be held in Mumbai from March 4 to 26).","pubDate":"2023-03-01 18:39:28","image_url":null,"source_id":"thehindu","category":["sports"],"country":["india"],"language":"english"},{"title":"Watched closely how Jadeja and Ashwin use the crease: Kuhnemann","link":"https://www.thehindu.com/sport/watched-closely-how-jadeja-and-ashwin-use-the-crease-kuhnemann/article66569270.ece","keywords":null,"creator":null,"video_url":null,"description":"Kuhnemann said senior bowler Lyon was very encouraging and implored him to keep things tight","content":"Cricketing tales often hang on slender threads. Journeying to India, Matthew Kuhnemann was not the first-choice left-arm spinner for Australia. That position went to Ashton Agar who was considered the second spinner in the Australian team behind Nathan Lyon. How things changed! The 26-year-old Kuhnemann, with just over 30 First Class wickets, leapfrogged over Agar in Australia’s practice sessions. The think-tank too felt Kuhnemman’s quicker variety of left-arm spin was better suited to these wickets. Kuhnemann was living a dream within a dream here on Wednesday, his first five-for in Tests being an attention-grabbing five for 16 off nine probing overs on day one of the third Test. He turned the ball, was accurate and used the crease to create the angles. “It feels really good to pick five wickets in a Test against India,” said Kuhnemann after the day’s play. Importantly, Kuhnemann said he had learnt much from watching Ravindra Jadeja and R. Ashwin bowl in the series. “I watched them closely. In particular, how they use the crease.” Kuhnemann said senior bowler Lyon was very encouraging and implored him to keep things tight. Kuhnemann said batting on this pitch was challenging. “It is a dry pitch. Some deliveries are keeping low,” he said. India’s batting coach Vikram Rathour said, “It is a challenging wicket. We needed more runs. We failed as a batting unit.” He added, “The wicket has slowed down.” Rathour said, “With the WTC points at stake, there is pressure to win home games. So there is nothing wrong in preparing such wickets and making best use of home conditions to win. But these pitches are also a double-edged sword.” Asked about India wasting reviews, he said: “You cannot always get them right.”","pubDate":"2023-03-01 18:34:00","image_url":null,"source_id":"thehindu","category":["sports"],"country":["india"],"language":"english"},{"title":"Ex-England cricketer Bresnan accused of racist language","link":"https://www.perthnow.com.au/sport/cricket/ex-england-cricketer-bresnan-accused-of-racist-language-c-9912249","keywords":null,"creator":["Staff Writers"],"video_url":null,"description":"Former England bowler Tim Bresnan is alleged to have used a racist comment towards Azeem Rafiq's sister, a disciplinary panel has heard.","content":"Tim Bresnan has been accused of using a racist comment towards Azeem Rafiq's sister while the England and Wales Cricket Board told a disciplinary panel it is \"more likely than not\" three former Yorkshire players used racist or discriminatory language. The public Cricket Discipline Commission hearing into allegations of racism from former Yorkshire player Rafiq began in London on Wednesday with the cases of England pair Matthew Hoggard and Bresnan and their one-time county teammate John Blain being heard. The trio all deny a charge of bringing the game into disrepute and allegations of using racial or discriminatory language. ECB lawyer Jane Mulcahy KC stated it is \"more likely than not\" each of the trio used the racist phrases being alleged - which included \"P***\" - due to a number of reasons, including the systemic use of racist or discriminatory language during that period at Yorkshire. During the first day of proceedings it was alleged Bresnan used a racial slur against Rafiq's sister Amna in 2014. Bresnan, Mulcahy said, is alleged to have directed the term \"fit P***\" and \"FP\" towards Asian women, including Rafiq's sister Amna at an official Yorkshire media day. He was also alleged to have referred to Rafiq and Asian teammates Adil Rashid, Ajmal Shahzad and Rana Naved-ul-Hasan as \"the brothers\" and \"you lot\". Bresnan denies the allegations. He said the term \"brothers\" was used but not in a racial or discriminatory context. He detailed his use of the term \"brothers\" or \"bro\" in WhatsApp messages or group chats as part of his defence. He also insisted he had no recollections of using the phrase \"you lot\" in a match against Derbyshire and claimed to have never met Amna Rafiq. But Mulcahy insisted for each alleged charge that \"on balance of probability, more likely than not, that he used the phrase and it was racist or discriminatory\". Former England captain Michael Vaughan, Hoggard, Bresnan, Blain, Andrew Gale and Richard Pyrah all face charges related to the use of racially discriminatory language, with Vaughan the only one set to appear in person at the hearing. Yorkshire admitted four amended charges and Gary Ballance admitted a charge which meant both were not required to participate. Mulcahy also set out the allegations against former England bowler Hoggard, which included creating and using the term \"Rafa the Kaffir\", repeated use of the word \"P***\", referring to Rafiq and other players as \"you lot\" and use of the term \"TBM\" (token black man) towards teammate Ismail Dawood. Hoggard admitted using the term \"Rafa the Kaffir\", but denied he created it and it was used in the context alleged. He admitted it did breach ECB directive 3.3. He admitted the use of the word \"P***\" but denied any racist or discriminatory intent and could not remember exactly on what occasions this occurred. He also denied it breached ECB directive. While Hoggard also admitted using the phrase \"you lot\", he denied the use of it to identify a group of ethnic minority players and denied it breached ECB directive 3.3. Hoggard did admit to using the phrase \"TBM\" or \"token black man\" and that it breached directive 3.3 but denied it had any racist or discriminatory intent. Mulcahy told the panel \"it is obvious that Hoggard has caused prejudice and/or disrepute for cricket and himself\" due to the systemic use of racist or discriminatory language at Yorkshire and the fact he admitted to using the word \"P***\".","pubDate":"2023-03-01 18:24:17","image_url":"https://images.perthnow.com.au/publication/C-9912249/bd42373cc4f0724240a69a30a115b2784168069f-16x9-x0y0w1280h720.jpg","source_id":"perthnow","category":["sports"],"country":["australia"],"language":"english"},{"title":"News24.com | Lions win CSA-Day Franchise Series thriller against WP, Dolphins make it three on the trot","link":"https://www.news24.com/sport/Cricket/Domestic/wrap-csa-4-day-franchise-series-20230226","keywords":null,"creator":null,"video_url":null,"description":"A wrap of all the collated fixtures, scores and reports from the latest round of action in the CSA 4-Day Franchise Series:","content":"A wrap of all the collated fixtures, scores and reports from the latest round of action in the CSA 4-Day Franchise Series: 26 FEBRUARY - 1 MARCH Division 1: Dolphins v Titans - Dolphins won by 7 wickets The Dolphins cruised to a convincing seven-wicket win over the Titans at Kingsmead Stadium on Wednesday morning, taking their current winning streak to three matches in the CSA 4-Day Domestic Series. Following a poor start to the campaign, the Dolphins have bounced back since the re-start and have won their last three matches in the tournament, which revitalised their chances of winning the overall crown for a second time in three seasons. After restricting the Titans to 138 all out in their second innings, the Dolphins needed 51 runs to win the match and started the final morning with ten wickets in hand and 46 runs to win. They lost the wickets of SJ Erwee, Marques Ackerman and Bryce Parsons; however, it was Khaya Zondo and first-innings hero Jason Smith who took the Dolphins to a memorable victory on their home ground. The renaissance of the Dolphins in the 4-Day series has been a positive for SJ Erwee, who has taken over the captaincy of the Dolphins in the red ball competition in the absence of Keshav Maharaj, who is with the Proteas. “We started really poorly in this competition, but it’s really nice to have three wins on the bounce now, and the guys are really rolling with this momentum,” Erwee said. “Guys are doing the hard yards and are doing the correct preparation for the opposition and the games we are playing. “The next game for us is at home again, and in our conditions, is exactly where we want to be.” The Dolphins spinners Prenelan Subrayen and Jon-Jon Smuts finished the match with combined figures of 19 for 222, with a run out being the only dismissal not going to either of the spinners in the match. Subrayen ended the match with career-best innings and match figures of 7/52 and 11/97, respectively, while Smuts took 5/67 in the second innings and ended with match figures of 8/125. Given the conditions and the pitch that was prepared for the encounter, Erwee was happy with the efforts of the spinners. “It was brilliant from Jon-Jon and Subs. They obviously know their role in the team, and they grabbed the opportunity to play in these conditions and are fulfilling their roles to the best of their abilities, and that’s all we can ask for.” Warriors v Knights - Knights won by 161 runs The Knights secured a massive 161-run against the Warriors at St Georges’ Park. Knights were off to a great start when they made a score of over 400 runs in their first innings and, in return, restricted their hosts to 134/10. Even though the visitors were bowled out for 157 in the second innings, the damage had already been done as the Warriors needed 455 runs to win. Matthew Breetzke’s century (111) had given the hosts a fighting chance, along with Rudi Second's (77), but the Warriors were bowled out for 284 on day four. Lions v Western Province - Lions won by 28 runs Bjorn Fortuin delivered a stellar performance and theLions claimed a 28-run victory against Western Province as the Cricket South Africa (CSA) 4-Day Franchise Series continued in Johannesburg. Fortuin scored an unbeaten century (123* off 143) to help the Lions to a first-innings score of 323 runs. He then followed his unbeaten ton from day one with a half-century, and with Dominic Hendricks (80), the Lions finished the second innings on 315 all out. He backed up his batting wins by claiming crucial wickets throughout the innings. With a total of nine wickets in the match, Fortuin returned 3/63 and 6/69 in the two innings. Western Province, who posted 423 in the first innings, had to chase 216 runs to win the match. A disciplined bowling unit from the Lions saw the Cape Town-based men fall 28 runs short. Efforts from Daniel Smith (61) and Edward Moore (59) were not enough, and the visitors were bowled for 187 runs.","pubDate":"2023-03-01 18:14:43","image_url":"https://scripts.24.co.za/img/sites/sport24.png","source_id":"news24","category":["sports"],"country":["south africa"],"language":"english"}]}