{"newsArray":[{"title":"मुंबई की हार में छा गए अर्जुन तेंदुलकर, IPL करियर का पहला छक्का जड़ लूट ली महफिल","link":"https://navbharattimes.indiatimes.com/sports/cricket/iplt20/news/ipl-2023-gt-vs-mi-arjun-tendulkar-six-mohit-sharma-video-/articleshow/99768922.cms","keywords":null,"creator":null,"video_url":null,"description":"IPL 2023: क्रिकेट के भगवान कहे जाने वाले सचिन तेंदुलकर के बेटे अर्जुन तेंदुलकर भी अपने पिता की तरह आईपीएल में अब जमकर सुर्खियां बटोर रहे है। उन्होंने अब गुजरात के खिलाफ गगनचुंबी छक्का जड़ महफिल लूट ली।","content":"आईपीएल 2023 का 35वां मुकाबला गुजरात टाइटंस और मुंबई इंडियंस के बीच 25 अप्रैल मंगलवार को अहमदाबाद के नरेंद्र मोदी स्टेडियम में खेला गया। यह मैच मेजबान टीम गुजरात ने 55 रन से अपने नाम कर लिया। यह टाइटंस की लगातार दूसरी जीत थी। जबकि मुंबई को इस सीजन यह चौथी हार मिली। मुंबई इंडियंस के लिए यह मैच किसी बुरे सपने से कम नहीं रहा। लेकिन इसके बावजूद महान सचिन तेंदुलकर के बेटे अर्जुन तेंदुलकर ने जमकर सुर्खियां बटोरी। सबने उन्हें गेंदबाजी करते हुए तो देखा ही है। लेकिन अब बल्लेबाजी करते हुए भी देख लिया। आईपीएल में पहली बार बल्लेबाजी कर रहे अर्जुन ने शानदार छक्का लगाया, जिसके चलते वह अब सुर्खियों में बने हुए हैं। दरअसल, मुंबई इंडियंस की पारी का अंतिम और 20वां ओवर गुजरात टाइटंस की ओर से मोहित शर्मा डाल रहे थे। उनके ओवर की पहली गेंद पर अर्जुन तेंदुलकर स्ट्राइक पर थे। अर्जुन को मोहित ने शॉट गेंद रखी, जिसको देखकर तेंदुलकर बिल्कुल भी नहीं घबराए और उन्होंने पलक झपकते ही एक शानदार पुल शॉट खेल दिया। अर्जुन के पुल शॉट में इतनी ताकत थी की गेंद सीधा सीमा-रेखा के पार चली गई। इसी के साथ अर्जुन ने अपने आईपीएल करियर का पहला छक्का भी लगा दिया। तेंदुलकर ने 73 मीटर का गगनचुंबी छक्का लगाया था। उनके इस सिक्स की वीडियो अब सोशल मीडिया पर काफी ज्यादा चर्चा में है। अर्जुन अपनी बल्लेबाजी से पहले गेंदबाजी में भी महफिल लूट ली थी। उन्होंने अपने 2 ओवर के स्पेल में महज 9 रन देकर रिद्धिमान साहा के रूप में एक बहुमूल्य विकेट चटकाया था। मुंबई इंडियंस के कप्तान रोहित शर्मा ने टॉस जीतकर पहले गेंदबाजी करने का फैसला किया था। ऐसे में उन्होंने पहले बल्लेबाजी करते हुए निर्धारित 20 ओवर में 6 विकेट के नुकसान पर 207 रन बनाए और मुंबई के सामने 208 रन का पहाड़नुमा लक्ष्य रखा। 208 रन के लक्ष्य को चेज करने उतरी मुंबई की टीम ताश के पत्तों की तरह बिखर गई। वह 20 ओवर में 9 विकेट पर सिर्फ 152 रन ही बना पाए और 55 रन से मैच हार गए।","pubDate":"2023-04-25 18:52:38","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Jonny Bairstow hits 97 for Yorkshire’s Second XI as England batter impresses on return from injury","link":"https://www.standard.co.uk/sport/cricket/jonny-bairstow-england-yorkshire-second-xi-injury-comeback-b1076701.html","keywords":["Cricket","Sport"],"creator":["Malik Ouzia"],"video_url":null,"description":"Bairstow missed England’s winter action after breaking his leg on a golf course","content":null,"pubDate":"2023-04-25 15:04:31","image_url":"https://static.standard.co.uk/2023/04/25/16/newFile.jpg?width=1200&auto=webp","source_id":"standarduk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"SL vs IRE: स्टर्लिंग-कैंफर के शतक,जयसूर्या का &#039;छक्का&#039; भी नहीं रोक पाया, आयरलैंड ने सबसे बड़ा टेस्ट स्कोर बनाया","link":"https://hindi.news18.com/news/sports/cricket-paul-stirling-curtis-campher-century-prabath-jayasuriya-5-wicket-haul-ireland-post-their-highest-test-score-sl-vs-ire-2nd-test-day-2-5987593.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"SL vs IRE 2nd Galle Test: आयरलैंड ने श्रीलंका के खिलाफ गॉल टेस्ट के दूसरे दिन इतिहास रच दिया है. मेहमान टीम ने पहली पारी में 492 रन बनाए. ये आयरलैंड का टेस्ट में सबसे बड़ा स्कोर है. आयरलैंड के लिए पॉल स्टर्लिंग और कर्टिस कैंफर ने शतक जमाया. श्रीलंका के लिए प्रभात जयसूर्या ने 5 विकेट लिए. उन्होंने 7वें टेस्ट में छठी बार पारी में 5 विकेट लेने का कारनामा किया है.","content":null,"pubDate":"2023-04-25 14:25:59","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/04/paul-stirling-16824326563x2.jpeg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"पृथ्वी शॉ को पूर्व क्रिकेटरने दिखाया आईना, फिटनेस पर खड़े किए सवाल, बोले- अगर चीजें काम नहीं कर रहीं तो...","link":"https://hindi.news18.com/news/sports/cricket-he-is-not-fit-simon-doll-criticizes-prithvi-shaw-after-see-flop-show-in-ipl-2023-dc-vs-srh-5987267.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"आईपीएल 2023 से पहले टीम इंडिया में वापसी की उम्मीद कर रहे पृथ्वी शॉ सीजन की शुरुआत से ही फेल नजर आए. जिसके बाद उन्हें पिछले मैच में प्लेइंग इलेवन से बाहर कर दिया गया था. अब न्यूजीलैंड के पूर्व क्रिकेटर ने इस खिलाड़ी की आलोचना की है.","content":null,"pubDate":"2023-04-25 14:25:18","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/04/Prithvi-Shaw-IPL-16824326803x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"&#039;सलेक्ट क्यों किया...?&#039; पूर्व भारतीय ओपनर ने WTC के लिए चुनी टीम इंडिया पर उठाए सवाल","link":"https://hindi.news18.com/news/sports/cricket-former-india-opener-aakash-chopra-questions-suryakumar-yadav-exclusion-from-wtc-final-squad-tweets-ek-match-ke-baad-drop-kyon-kiya-5986691.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"पूर्व भारतीय क्रिकेटर आकाश चोपड़ा ने 7 जून से लंदन के ओवल में शुरू होने वाले आगामी विश्व टेस्ट चैंपियनशिप (डब्ल्यूटीसी) फाइनल के लिए टीम इंडिया की टीम से सूर्यकुमार यादव को नहीं चुने जाने पर आवाज उठाई है.","content":"पूर्व भारतीय ओपनर ने टीम इंडिया के चयन पर सवाल उठाए हैं (PIC: AP) नई दिल्ली. सूर्यकुमार यादव ने इस साल की शुरुआत में भारतीय क्रिकेट टीम के लिए व्हाइट-बॉल क्रिकेट में अपने शानदार प्रदर्शन की बदौलत अपना टेस्ट डेब्यू किया था. उन्होंने फरवरी में बॉर्डर गावस्कर ट्रॉफी के पहले टेस्ट मैच में खेला और पहली पारी में 8 रन बनाए. भारत ने इस मैच में एक पारी और 132 से जीत हासिल की थी. दिलचस्प बात यह है कि एक टेस्ट खेलने और सिर्फ एक बार बल्लेबाजी करने के बावजूद सूर्यकुमार यादव बाकी पूरी सीरीज में बेंच पर बैठे रहे. अब आईसीसी वर्ल्ड टेस्ट चैंपियनशिप फाइनल के लिए भारतीय टीम का चयन हो गया है और इस टीम में सूर्यकुमार यादव को जगह नहीं मिली है. ऐसे में भारत के पूर्व ओपनर ने इस पर सवाल उठाए हैं. वर्ल्ड टेस्ट चैंपियनशिप फाइनल के लिए चुनी गई टीम में अजिंक्य रहाणे की वापसी हुई है. हाल ही में मौजूदा सत्र के लिए बीसीसीआई के सेंट्रल कॉन्ट्रेक्ट से बाहर किए जाने के एक महीने बाद अजिंक्य रहाणे ने टेस्ट टीम में वापसी की है. रहाणे फिलहाल आईपीएल में चेन्नई सुपर किंग्स के लिए खेल रहे हैं. आईपीएल के इस सीजन की शुरुआत में ही अजिंक्य रहाणे ने बल्ले से शानदार खेल दिखाया है. रहाणे ने जनवरी 2022 में अंतिम टेस्ट खेला था, इसके बाद से वह टीम से बाहर चल रहे थे. अजिंक्य रहाणे के सलेक्शन पर उठे सवाल, BCCI पर भड़के फैन्स, बोले- साबित हो गया रणजी ट्रॉफी की वैल्यू जीरो… भारत के पूर्व सलामी बल्लेबाज आकाश चोपड़ा अजिंक्य रहाणे को शामिल किए जाने से खुश हैं, लेकिन उन्होंने बीसीसीआई की चयन नीति पर बड़ा सवाल खड़ा कर दिया है. चोपड़ा को यह समझ में नहीं आ रहा है कि सूर्यकुमार यादव जैसे खिलाड़ी को एक टेस्ट पारी के आधार पर कैसे आंका जा सकता है. और अगर उसकी आवश्यकता नहीं है, तो पहले टेस्ट चयन क्यों किया गया. शुभमन गिल को देखते ही ईशान किशन ने जड़ा चांटा, गुजरात के बैटर ने लिया बदला, जानें VIRAL वीडियो की सच्चाई आकाश चोपड़ा ने ट्वीट करते हुए लिखा, ”रहाणे के लिए खुश हूं, लेकिन सूर्यकुमार यादव को शामिल करने और बाहर करने का क्या मतलब है? सलेक्ट क्यों किया… कर लिया तो एक मैच के बाद ड्रॉप क्यों किया? जसप्रीत बुमराह पर विचार नहीं किया गया, क्योंकि वह पीठ की चोट से उबर रहे हैं. वहीं, श्रेयस अय्यर ने भी हाल ही में पीठ की सर्जरी करवाई है. वर्ल्ड टेस्ट चैंपियनशिप के लिए भारतीय टीम: रोहित शर्मा (कप्तान), शुभमन गिल, चेतेश्वर पुजारा, विराट कोहली, अजिंक्य रहाणे, केएल राहुल, केएस भरत (विकेटकीपर), रविचंद्रन अश्विन, रवींद्र जडेजा, अक्षर पटेल, शार्दुल ठाकुर, मोहम्मद शमी, मोहम्मद सिराज, उमेश यादव, जयदेव उनादकट. ब्रेकिंग न्यूज़ हिंदी में सबसे पहले पढ़ें News18 हिंदी| आज की ताजा खबर, लाइव न्यूज अपडेट, पढ़ें सबसे विश्वसनीय हिंदी न्यूज़ वेबसाइट News18 हिंदी| Tags: Aakash Chopra , Ajinkya Rahane , Suryakumar Yadav , World test championship , World Test Championship Final , WTC Final 3 धुरंधरों ने कराई अजिंक्य रहाणे की टीम में वापसी, चयनकर्ताओं को किया मजबूर, बैटर ने पलट दिया सारा समीकरण बेहद स्टाइलिश हैं गौहर खान की बड़ी बहन, निभाए हैं निगेटिव रोल, क्यों बनाया था पाकिस्तानी को शौहर? कभी 10वीं,12वीं में हो गए फेल, नहीं मानी हर, बाद में बन गए IAS-IPS और क्रिकेटर","pubDate":"2023-04-25 14:08:36","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/04/Team-India-AP-16824309603x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Why is MI pacer Jofra Archer not playing against Gujarat Titans?","link":"https://www.indiatvnews.com/sports/cricket/why-is-mi-pacer-jofra-archer-not-playing-against-gujarat-titans-2023-04-25-866690","keywords":null,"creator":null,"video_url":null,"description":"Gujarat Titans host Mumbai Indians in the 35th match of the Indian Premier League (IPL) on Tuesday (April 25). It is a crucial game for both sides with the defending champions having a chance to climb to second place in table while MI have a decent opportunity to go on par with top four teams. However, the five-time champions are dealt with a blow ahead of the GT clash as Jofra Archer is not playing this game.","content":null,"pubDate":"2023-04-25 13:41:28","image_url":null,"source_id":"indiatvnews","category":["sports"],"country":["india"],"language":"english"},{"title":"3 धुरंधरों ने कराई अजिंक्य रहाणे की टीम में वापसी, चयनकर्ताओं को किया मजबूर, बैटर ने पलट दिया सारा समीकरण","link":"https://hindi.news18.com/photogallery/sports/cricket-sachin-tendulkar-to-ms-dhoni-motivate-ajinkya-rahane-for-come-back-journey-in-test-championship-final-5986735.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"25 अप्रैल मंगलवार को बीसीसीआई ने आईसीसी वर्ल्ड टेस्ट चैंपियनशिप फाइनल के लिए भारतीय टीम की घोषणा की. इस टीम में एक नाम ऐसा था जिसके होने की उम्मीद हर कोई लगा रहा था. अजिंक्य रहाणे को चयनकर्ताओं ने ऑस्ट्रेलिया के खिलाफ खेले जाने वाले फाइनल के लिए चुनी गई टीम में मौका दिया है. इंग्लैंड में खेलने के अनुभव और घरेलू प्रदर्शन के दम पर उनकी वापसी हुई है. अजिंक्य रहाणे की वापसी में 3 दिग्गजों का हाथ माना जा रहा है.","content":"25 अप्रैल मंगलवार को बीसीसीआई ने आईसीसी वर्ल्ड टेस्ट चैंपियनशिप फाइनल के लिए भारतीय टीम की घोषणा की. इस टीम में एक नाम ऐसा था जिसके होने की उम्मीद हर कोई लगा रहा था. अजिंक्य रहाणे को चयनकर्ताओं ने ऑस्ट्रेलिया के खिलाफ खेले जाने वाले फाइनल के लिए चुनी गई टीम में मौका दिया है. इंग्लैंड में खेलने के अनुभव और घरेलू प्रदर्शन के दम पर उनकी वापसी हुई है. अजिंक्य रहाणे की वापसी में 3 दिग्गजों का हाथ माना जा रहा है. इंडियन प्रीमियर लीग 2023 के बाद भारत को आईसीसी टेस्ट चैंपियनशिप फाइनल में ऑस्ट्रेलिया के खिलाफ खेलना है. टेस्ट का वर्ल्ड कप कहे जाने वाले इस टूर्नामेट में भारत ने लगातार दूसरी बाद फाइनल में जगह बनाई है. पिछली बार न्यूजीलैंड से हार कर भारत को उप विजेता बनकर संतोष करना पड़ा था. विराट कोहली की कप्तानी में चूकी टीम इंडिया रोहित शर्मा की कप्तानी में यह ट्रॉफी उठाना चाहेगी.-AP 2022 साउथ अफ्रीका दौरे के बाद टेस्ट टीम से बाहर हुए अजिंक्य रहाणे को चयनकर्ताओं ने आईसीसी टेस्ट चैंपियनशिप फाइनल के लिए चुनी गई टीम में मौका दिया है. जिस तरह से उनको बाहर किया गया था और बॉर्डर गावस्कर ट्रॉफी में भी बाहर रखा गया उससे लग रहा था अब वो कभी टीम में वापसी नहीं कर पाएंगे. अजिंक्य ने ऐसी बल्लेबाजी करके दिखाई है जिसने चयनकर्ताओँ को जगह देने पर मजबूर कर दिया.-AFP अजिंक्य रहाणे को टीम से बाहर किए जाने के बाद उनकी वापसी बहुत ही ज्यादा मुश्किल लग रही थी. खराब फॉर्म और उम्र उनकी वापसी के आड़े आ रही थी लेकिन 3 भारतीय धुरंधरों ने उनके ऐसा मोटिवेट किया जिसने उनके अंदर ऐसा ऊर्जा भरी जिसके बाद चमत्कार हो गया. अजिंक्य ने खुद महान सचिन तेंदुलकर की बातों को खुद दोहराया है.-AP सचिन तेंदुलकर की कही बातें अजिंक्य रहाणे ने कहा, आपके करियर में जो होता है उससे कभी कभी आप हद से ज्यादा तकलीफ महसूस करेंगे लेकिन आपको वैसे ही आगे बढ़ते रहना है जैसा अब तक करते रहे हैं. आपको आपका मौका जरूर मिलेगा और जब भी वो मिले उसे दोनों हाथों से लपकना है. उस वक्त तो आपको यह खेल बेहद निर्दयी लगेगा लेकिन यकीन मानिए आपको भविष्य में यही सहारा देने वाला है.-AFP अजिंक्य रहाणे की टीम इंडिया में वापसी के लिए दूसरी प्रेरणा उनके टेस्ट टीम के साथी चेतेश्वर पुजारा बने. रहाणे की तरह ही खराब फॉर्म की वजह से पुजारा को चयनकर्ताओं ने बाहर का रास्ता दिखाया था. इंग्लिश काउंटी में रनों का अंबार लगाकर उन्होंने टीम इंडिया में वापसी की और फिर बांग्लादेश दौरे पर शतक भी जमाया.-AP अजिंक्य रहाणे के लिए टीम इंडिया में वापसी का टर्निंग प्वाइंट इंडियन प्रीमियर लीग रहा. चेन्नई सुपर किंग्स की तरफ से खेलते हुए कप्तान महेंद्र सिंह धोनी के की बातों ने उनके खेलने का तरीका बदल दिया. इस सीजन में अजिंक्य रहाणे ने अब तक 199 की तूफानी स्ट्राइक रेट से बल्लेबाजी की है. 105 गेंद का सामना करते हुए 209 रन ठोक डाले हैं. -AP कभी 10वीं,12वीं में हो गए फेल, नहीं मानी हर, बाद में बन गए IAS-IPS और क्रिकेटर रेखा को जब लोगों ने कहा मोटी, रातों-रात नहीं हुआ करिश्मा, एक्ट्रेस को करना पड़ा था ये काम PHOTOS: केदारनाथ धाम के कपाट श्रद्धालुओं के दर्शन के लिए खुले, पीएम नरेन्द्र मोदी के नाम से पहली पूजा इंडियन प्रीमियर लीग 2023 के बाद भारत को आईसीसी टेस्ट चैंपियनशिप फाइनल में ऑस्ट्रेलिया के खिलाफ खेलना है. टेस्ट का वर्ल्ड कप कहे जाने वाले इस टूर्नामेट में भारत ने लगातार दूसरी बाद फाइनल में जगह बनाई है. पिछली बार न्यूजीलैंड से हार कर भारत को उप विजेता बनकर संतोष करना पड़ा था. विराट कोहली की कप्तानी में चूकी टीम इंडिया रोहित शर्मा की कप्तानी में यह ट्रॉफी उठाना चाहेगी.-AP","pubDate":"2023-04-25 13:28:24","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/04/RAHANE4-16824291953x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"GT vs MI Live Score: हार्दिक पंड्या और शुभमन गिल केपर जिम्मेदारी, 4 ओवर के बाद 23/1 गुजरात","link":"https://hindi.news18.com/news/sports/cricket-gt-vs-mi-ipl-2023-live-score-narendra-modi-stadium-ahmedabad-live-updates-5986861.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"GT vs MI Live Score: मुंबई और गुजरात की टीमें नरेंद्र मोदी स्टेडियम में आमने-सामने आ चुकी हैं. रोहित शर्मा ने टॉस जीतकर पहले गेंदबाजी करने का फैसला किया है. पिछले मैच में पंजाब किंग्स के द्वारा मुंबई को शिकस्त झेलनी पड़ी थी. वहीं, गुजरात की टीम के पास होम ग्राउंड पर एक और जीत की तलाश में होगी.","content":null,"pubDate":"2023-04-25 13:17:27","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/04/GT-MI-25-04-16824280563x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"IPL 2023 का एक नियम कप्तानों की गले की हड्डी बना, देने पड़ जा रहे लाखों रुपये, अब वॉर्नर को चूना लगा","link":"https://hindi.news18.com/news/sports/cricket-ipl-2023-slow-over-rate-became-threat-for-captains-ms-dhoni-kl-rahul-now-david-warner-penalised-paid-12-lakh-as-fine-5986807.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"IPL 2023 का एक नियम कप्तानों और टीमों के लिए जी का जंजाल जैसा बन गया है. जरा सी गलती हुई नहीं कि लाखों रुपये का जुर्माना लग जा रहा है. विराट कोहली को तो सबसे ज्यादा नुकसान हो चुका है. वहीं, केएल राहुल, एमएस धोनी भी झटका झेल चुके हैं. इस लिस्ट में दिल्ली कैपिटल्स के कप्तान डेविड वॉर्नर नया नाम हैं.","content":null,"pubDate":"2023-04-25 13:13:42","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/04/IPL-CAPTAIN-Rule.jpeg-16824289533x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"RCB vs KKR Head to Head Record in IPL History","link":"https://thesportsrush.com/cricket-news-rcb-vs-kkr-head-to-head-record-in-ipl-history/","keywords":["Cricket","IPL 2023","KKR","RCB","Indian Premier League","Kolkata Knight riders","Royal Challengers Bangalore"],"creator":["Dixit Bhargav"],"video_url":null,"description":"The 35th match of the ongoing 16th season of the Indian Premier League will begin in an hour or so from now. With the first half of the league stage coming to an end tonight, 36th match of the season between Royal Challengers Bangalore and Kolkata Knight Riders will be the first rematch of the… The post RCB vs KKR Head to Head Record in IPL History appeared first on The SportsRush.","content":"The 35th match of the ongoing 16th season of the Indian Premier League will begin in an hour or so from now. With the first half of the league stage coming to an end tonight, 36th match of the season between Royal Challengers Bangalore and Kolkata Knight Riders will be the first rematch of the season. Played around three weeks ago at the Eden Gardens, the last match between these two teams is remembered for Shardul Thakur‘s game-changing half-century powering the home team to a comprehensive 81-run victory in the first week of the competition. Knight Riders’ victory earlier this month had further bettered their lead in head-to-head records against this opposition. Having won three out of their last four matches against Royal Challengers, Kolkata have done well against them across facets including playing at the M Chinnaswamy Stadium. , Bengaluru! @rinkusingh235 | @venkateshiyer | @NitishRana_27 | #AmiKKR | #TATAIPL pic.twitter.com/WRmuPCdX6V — KolkataKnightRiders (@KKRiders) April 25, 2023 Speaking of this venue, Bangalore have won 44 and lost 42 out of their 91 home matches over the years. KKR, on the other hand, have won 10 and lost six out of their 16 matches here thus far. Going to play in Bengaluru for the first time since 2019, the visitors (9.1) even have a better average run rate than RCB (8.87) at this stadium. RCB vs KKR Head to Head Record in IPL History Total number of matches played: 32 Matches won by RCB: 14 Matches won by KKR: 18 Matches played in April: 16 (RCB 7, KKR 9) Matches played on Wednesday: 7 (RCB 3, KKR 4) Matches played at M Chinnaswamy Stadium: 11 (RCB 4, KKR 7) RCB average score against KKR: 148 KKR average score against RCB: 156 Most runs for RCB: 807 (Virat Kohli) Most runs for KKR: 364 (Andre Russell) Most wickets for RCB: 10 (Mohammed Siraj) Most wickets for KKR: 23 (Sunil Narine) Most catches for RCB: 17 (Virat Kohli) Most catches for KKR: 5 (Nitish Rana & Andre Russell) NOTE: Only players part of current squads have been considered above (most runs, wickets and catches). The post RCB vs KKR Head to Head Record in IPL History appeared first on The SportsRush.","pubDate":"2023-04-25 12:42:30","image_url":null,"source_id":"thesportsrush","category":["sports"],"country":["australia","united kingdom","india","united states of america"],"language":"english"},{"title":"मुंबई की हार में छा गए अर्जुन तेंदुलकर, IPL करियर का पहला छक्का जड़ लूट ली महफिल","link":"https://navbharattimes.indiatimes.com/sports/cricket/iplt20/news/ipl-2023-gt-vs-mi-arjun-tendulkar-six-mohit-sharma-video-/articleshow/99768922.cms","keywords":null,"creator":null,"video_url":null,"description":"IPL 2023: क्रिकेट के भगवान कहे जाने वाले सचिन तेंदुलकर के बेटे अर्जुन तेंदुलकर भी अपने पिता की तरह आईपीएल में अब जमकर सुर्खियां बटोर रहे है। उन्होंने अब गुजरात के खिलाफ गगनचुंबी छक्का जड़ महफिल लूट ली।","content":"आईपीएल 2023 का 35वां मुकाबला गुजरात टाइटंस और मुंबई इंडियंस के बीच 25 अप्रैल मंगलवार को अहमदाबाद के नरेंद्र मोदी स्टेडियम में खेला गया। यह मैच मेजबान टीम गुजरात ने 55 रन से अपने नाम कर लिया। यह टाइटंस की लगातार दूसरी जीत थी। जबकि मुंबई को इस सीजन यह चौथी हार मिली। मुंबई इंडियंस के लिए यह मैच किसी बुरे सपने से कम नहीं रहा। लेकिन इसके बावजूद महान सचिन तेंदुलकर के बेटे अर्जुन तेंदुलकर ने जमकर सुर्खियां बटोरी। सबने उन्हें गेंदबाजी करते हुए तो देखा ही है। लेकिन अब बल्लेबाजी करते हुए भी देख लिया। आईपीएल में पहली बार बल्लेबाजी कर रहे अर्जुन ने शानदार छक्का लगाया, जिसके चलते वह अब सुर्खियों में बने हुए हैं। दरअसल, मुंबई इंडियंस की पारी का अंतिम और 20वां ओवर गुजरात टाइटंस की ओर से मोहित शर्मा डाल रहे थे। उनके ओवर की पहली गेंद पर अर्जुन तेंदुलकर स्ट्राइक पर थे। अर्जुन को मोहित ने शॉट गेंद रखी, जिसको देखकर तेंदुलकर बिल्कुल भी नहीं घबराए और उन्होंने पलक झपकते ही एक शानदार पुल शॉट खेल दिया। अर्जुन के पुल शॉट में इतनी ताकत थी की गेंद सीधा सीमा-रेखा के पार चली गई। इसी के साथ अर्जुन ने अपने आईपीएल करियर का पहला छक्का भी लगा दिया। तेंदुलकर ने 73 मीटर का गगनचुंबी छक्का लगाया था। उनके इस सिक्स की वीडियो अब सोशल मीडिया पर काफी ज्यादा चर्चा में है। अर्जुन अपनी बल्लेबाजी से पहले गेंदबाजी में भी महफिल लूट ली थी। उन्होंने अपने 2 ओवर के स्पेल में महज 9 रन देकर रिद्धिमान साहा के रूप में एक बहुमूल्य विकेट चटकाया था। मुंबई इंडियंस के कप्तान रोहित शर्मा ने टॉस जीतकर पहले गेंदबाजी करने का फैसला किया था। ऐसे में उन्होंने पहले बल्लेबाजी करते हुए निर्धारित 20 ओवर में 6 विकेट के नुकसान पर 207 रन बनाए और मुंबई के सामने 208 रन का पहाड़नुमा लक्ष्य रखा। 208 रन के लक्ष्य को चेज करने उतरी मुंबई की टीम ताश के पत्तों की तरह बिखर गई। वह 20 ओवर में 9 विकेट पर सिर्फ 152 रन ही बना पाए और 55 रन से मैच हार गए।","pubDate":"2023-04-25 18:52:38","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Jonny Bairstow hits 97 for Yorkshire’s Second XI as England batter impresses on return from injury","link":"https://www.standard.co.uk/sport/cricket/jonny-bairstow-england-yorkshire-second-xi-injury-comeback-b1076701.html","keywords":["Cricket","Sport"],"creator":["Malik Ouzia"],"video_url":null,"description":"Bairstow missed England’s winter action after breaking his leg on a golf course","content":null,"pubDate":"2023-04-25 15:04:31","image_url":"https://static.standard.co.uk/2023/04/25/16/newFile.jpg?width=1200&auto=webp","source_id":"standarduk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"SL vs IRE: स्टर्लिंग-कैंफर के शतक,जयसूर्या का &#039;छक्का&#039; भी नहीं रोक पाया, आयरलैंड ने सबसे बड़ा टेस्ट स्कोर बनाया","link":"https://hindi.news18.com/news/sports/cricket-paul-stirling-curtis-campher-century-prabath-jayasuriya-5-wicket-haul-ireland-post-their-highest-test-score-sl-vs-ire-2nd-test-day-2-5987593.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"SL vs IRE 2nd Galle Test: आयरलैंड ने श्रीलंका के खिलाफ गॉल टेस्ट के दूसरे दिन इतिहास रच दिया है. मेहमान टीम ने पहली पारी में 492 रन बनाए. ये आयरलैंड का टेस्ट में सबसे बड़ा स्कोर है. आयरलैंड के लिए पॉल स्टर्लिंग और कर्टिस कैंफर ने शतक जमाया. श्रीलंका के लिए प्रभात जयसूर्या ने 5 विकेट लिए. उन्होंने 7वें टेस्ट में छठी बार पारी में 5 विकेट लेने का कारनामा किया है.","content":null,"pubDate":"2023-04-25 14:25:59","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/04/paul-stirling-16824326563x2.jpeg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"पृथ्वी शॉ को पूर्व क्रिकेटरने दिखाया आईना, फिटनेस पर खड़े किए सवाल, बोले- अगर चीजें काम नहीं कर रहीं तो...","link":"https://hindi.news18.com/news/sports/cricket-he-is-not-fit-simon-doll-criticizes-prithvi-shaw-after-see-flop-show-in-ipl-2023-dc-vs-srh-5987267.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"आईपीएल 2023 से पहले टीम इंडिया में वापसी की उम्मीद कर रहे पृथ्वी शॉ सीजन की शुरुआत से ही फेल नजर आए. जिसके बाद उन्हें पिछले मैच में प्लेइंग इलेवन से बाहर कर दिया गया था. अब न्यूजीलैंड के पूर्व क्रिकेटर ने इस खिलाड़ी की आलोचना की है.","content":null,"pubDate":"2023-04-25 14:25:18","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/04/Prithvi-Shaw-IPL-16824326803x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"&#039;सलेक्ट क्यों किया...?&#039; पूर्व भारतीय ओपनर ने WTC के लिए चुनी टीम इंडिया पर उठाए सवाल","link":"https://hindi.news18.com/news/sports/cricket-former-india-opener-aakash-chopra-questions-suryakumar-yadav-exclusion-from-wtc-final-squad-tweets-ek-match-ke-baad-drop-kyon-kiya-5986691.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"पूर्व भारतीय क्रिकेटर आकाश चोपड़ा ने 7 जून से लंदन के ओवल में शुरू होने वाले आगामी विश्व टेस्ट चैंपियनशिप (डब्ल्यूटीसी) फाइनल के लिए टीम इंडिया की टीम से सूर्यकुमार यादव को नहीं चुने जाने पर आवाज उठाई है.","content":"पूर्व भारतीय ओपनर ने टीम इंडिया के चयन पर सवाल उठाए हैं (PIC: AP) नई दिल्ली. सूर्यकुमार यादव ने इस साल की शुरुआत में भारतीय क्रिकेट टीम के लिए व्हाइट-बॉल क्रिकेट में अपने शानदार प्रदर्शन की बदौलत अपना टेस्ट डेब्यू किया था. उन्होंने फरवरी में बॉर्डर गावस्कर ट्रॉफी के पहले टेस्ट मैच में खेला और पहली पारी में 8 रन बनाए. भारत ने इस मैच में एक पारी और 132 से जीत हासिल की थी. दिलचस्प बात यह है कि एक टेस्ट खेलने और सिर्फ एक बार बल्लेबाजी करने के बावजूद सूर्यकुमार यादव बाकी पूरी सीरीज में बेंच पर बैठे रहे. अब आईसीसी वर्ल्ड टेस्ट चैंपियनशिप फाइनल के लिए भारतीय टीम का चयन हो गया है और इस टीम में सूर्यकुमार यादव को जगह नहीं मिली है. ऐसे में भारत के पूर्व ओपनर ने इस पर सवाल उठाए हैं. वर्ल्ड टेस्ट चैंपियनशिप फाइनल के लिए चुनी गई टीम में अजिंक्य रहाणे की वापसी हुई है. हाल ही में मौजूदा सत्र के लिए बीसीसीआई के सेंट्रल कॉन्ट्रेक्ट से बाहर किए जाने के एक महीने बाद अजिंक्य रहाणे ने टेस्ट टीम में वापसी की है. रहाणे फिलहाल आईपीएल में चेन्नई सुपर किंग्स के लिए खेल रहे हैं. आईपीएल के इस सीजन की शुरुआत में ही अजिंक्य रहाणे ने बल्ले से शानदार खेल दिखाया है. रहाणे ने जनवरी 2022 में अंतिम टेस्ट खेला था, इसके बाद से वह टीम से बाहर चल रहे थे. अजिंक्य रहाणे के सलेक्शन पर उठे सवाल, BCCI पर भड़के फैन्स, बोले- साबित हो गया रणजी ट्रॉफी की वैल्यू जीरो… भारत के पूर्व सलामी बल्लेबाज आकाश चोपड़ा अजिंक्य रहाणे को शामिल किए जाने से खुश हैं, लेकिन उन्होंने बीसीसीआई की चयन नीति पर बड़ा सवाल खड़ा कर दिया है. चोपड़ा को यह समझ में नहीं आ रहा है कि सूर्यकुमार यादव जैसे खिलाड़ी को एक टेस्ट पारी के आधार पर कैसे आंका जा सकता है. और अगर उसकी आवश्यकता नहीं है, तो पहले टेस्ट चयन क्यों किया गया. शुभमन गिल को देखते ही ईशान किशन ने जड़ा चांटा, गुजरात के बैटर ने लिया बदला, जानें VIRAL वीडियो की सच्चाई आकाश चोपड़ा ने ट्वीट करते हुए लिखा, ”रहाणे के लिए खुश हूं, लेकिन सूर्यकुमार यादव को शामिल करने और बाहर करने का क्या मतलब है? सलेक्ट क्यों किया… कर लिया तो एक मैच के बाद ड्रॉप क्यों किया? जसप्रीत बुमराह पर विचार नहीं किया गया, क्योंकि वह पीठ की चोट से उबर रहे हैं. वहीं, श्रेयस अय्यर ने भी हाल ही में पीठ की सर्जरी करवाई है. वर्ल्ड टेस्ट चैंपियनशिप के लिए भारतीय टीम: रोहित शर्मा (कप्तान), शुभमन गिल, चेतेश्वर पुजारा, विराट कोहली, अजिंक्य रहाणे, केएल राहुल, केएस भरत (विकेटकीपर), रविचंद्रन अश्विन, रवींद्र जडेजा, अक्षर पटेल, शार्दुल ठाकुर, मोहम्मद शमी, मोहम्मद सिराज, उमेश यादव, जयदेव उनादकट. ब्रेकिंग न्यूज़ हिंदी में सबसे पहले पढ़ें News18 हिंदी| आज की ताजा खबर, लाइव न्यूज अपडेट, पढ़ें सबसे विश्वसनीय हिंदी न्यूज़ वेबसाइट News18 हिंदी| Tags: Aakash Chopra , Ajinkya Rahane , Suryakumar Yadav , World test championship , World Test Championship Final , WTC Final 3 धुरंधरों ने कराई अजिंक्य रहाणे की टीम में वापसी, चयनकर्ताओं को किया मजबूर, बैटर ने पलट दिया सारा समीकरण बेहद स्टाइलिश हैं गौहर खान की बड़ी बहन, निभाए हैं निगेटिव रोल, क्यों बनाया था पाकिस्तानी को शौहर? कभी 10वीं,12वीं में हो गए फेल, नहीं मानी हर, बाद में बन गए IAS-IPS और क्रिकेटर","pubDate":"2023-04-25 14:08:36","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/04/Team-India-AP-16824309603x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Why is MI pacer Jofra Archer not playing against Gujarat Titans?","link":"https://www.indiatvnews.com/sports/cricket/why-is-mi-pacer-jofra-archer-not-playing-against-gujarat-titans-2023-04-25-866690","keywords":null,"creator":null,"video_url":null,"description":"Gujarat Titans host Mumbai Indians in the 35th match of the Indian Premier League (IPL) on Tuesday (April 25). It is a crucial game for both sides with the defending champions having a chance to climb to second place in table while MI have a decent opportunity to go on par with top four teams. However, the five-time champions are dealt with a blow ahead of the GT clash as Jofra Archer is not playing this game.","content":null,"pubDate":"2023-04-25 13:41:28","image_url":null,"source_id":"indiatvnews","category":["sports"],"country":["india"],"language":"english"},{"title":"3 धुरंधरों ने कराई अजिंक्य रहाणे की टीम में वापसी, चयनकर्ताओं को किया मजबूर, बैटर ने पलट दिया सारा समीकरण","link":"https://hindi.news18.com/photogallery/sports/cricket-sachin-tendulkar-to-ms-dhoni-motivate-ajinkya-rahane-for-come-back-journey-in-test-championship-final-5986735.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"25 अप्रैल मंगलवार को बीसीसीआई ने आईसीसी वर्ल्ड टेस्ट चैंपियनशिप फाइनल के लिए भारतीय टीम की घोषणा की. इस टीम में एक नाम ऐसा था जिसके होने की उम्मीद हर कोई लगा रहा था. अजिंक्य रहाणे को चयनकर्ताओं ने ऑस्ट्रेलिया के खिलाफ खेले जाने वाले फाइनल के लिए चुनी गई टीम में मौका दिया है. इंग्लैंड में खेलने के अनुभव और घरेलू प्रदर्शन के दम पर उनकी वापसी हुई है. अजिंक्य रहाणे की वापसी में 3 दिग्गजों का हाथ माना जा रहा है.","content":"25 अप्रैल मंगलवार को बीसीसीआई ने आईसीसी वर्ल्ड टेस्ट चैंपियनशिप फाइनल के लिए भारतीय टीम की घोषणा की. इस टीम में एक नाम ऐसा था जिसके होने की उम्मीद हर कोई लगा रहा था. अजिंक्य रहाणे को चयनकर्ताओं ने ऑस्ट्रेलिया के खिलाफ खेले जाने वाले फाइनल के लिए चुनी गई टीम में मौका दिया है. इंग्लैंड में खेलने के अनुभव और घरेलू प्रदर्शन के दम पर उनकी वापसी हुई है. अजिंक्य रहाणे की वापसी में 3 दिग्गजों का हाथ माना जा रहा है. इंडियन प्रीमियर लीग 2023 के बाद भारत को आईसीसी टेस्ट चैंपियनशिप फाइनल में ऑस्ट्रेलिया के खिलाफ खेलना है. टेस्ट का वर्ल्ड कप कहे जाने वाले इस टूर्नामेट में भारत ने लगातार दूसरी बाद फाइनल में जगह बनाई है. पिछली बार न्यूजीलैंड से हार कर भारत को उप विजेता बनकर संतोष करना पड़ा था. विराट कोहली की कप्तानी में चूकी टीम इंडिया रोहित शर्मा की कप्तानी में यह ट्रॉफी उठाना चाहेगी.-AP 2022 साउथ अफ्रीका दौरे के बाद टेस्ट टीम से बाहर हुए अजिंक्य रहाणे को चयनकर्ताओं ने आईसीसी टेस्ट चैंपियनशिप फाइनल के लिए चुनी गई टीम में मौका दिया है. जिस तरह से उनको बाहर किया गया था और बॉर्डर गावस्कर ट्रॉफी में भी बाहर रखा गया उससे लग रहा था अब वो कभी टीम में वापसी नहीं कर पाएंगे. अजिंक्य ने ऐसी बल्लेबाजी करके दिखाई है जिसने चयनकर्ताओँ को जगह देने पर मजबूर कर दिया.-AFP अजिंक्य रहाणे को टीम से बाहर किए जाने के बाद उनकी वापसी बहुत ही ज्यादा मुश्किल लग रही थी. खराब फॉर्म और उम्र उनकी वापसी के आड़े आ रही थी लेकिन 3 भारतीय धुरंधरों ने उनके ऐसा मोटिवेट किया जिसने उनके अंदर ऐसा ऊर्जा भरी जिसके बाद चमत्कार हो गया. अजिंक्य ने खुद महान सचिन तेंदुलकर की बातों को खुद दोहराया है.-AP सचिन तेंदुलकर की कही बातें अजिंक्य रहाणे ने कहा, आपके करियर में जो होता है उससे कभी कभी आप हद से ज्यादा तकलीफ महसूस करेंगे लेकिन आपको वैसे ही आगे बढ़ते रहना है जैसा अब तक करते रहे हैं. आपको आपका मौका जरूर मिलेगा और जब भी वो मिले उसे दोनों हाथों से लपकना है. उस वक्त तो आपको यह खेल बेहद निर्दयी लगेगा लेकिन यकीन मानिए आपको भविष्य में यही सहारा देने वाला है.-AFP अजिंक्य रहाणे की टीम इंडिया में वापसी के लिए दूसरी प्रेरणा उनके टेस्ट टीम के साथी चेतेश्वर पुजारा बने. रहाणे की तरह ही खराब फॉर्म की वजह से पुजारा को चयनकर्ताओं ने बाहर का रास्ता दिखाया था. इंग्लिश काउंटी में रनों का अंबार लगाकर उन्होंने टीम इंडिया में वापसी की और फिर बांग्लादेश दौरे पर शतक भी जमाया.-AP अजिंक्य रहाणे के लिए टीम इंडिया में वापसी का टर्निंग प्वाइंट इंडियन प्रीमियर लीग रहा. चेन्नई सुपर किंग्स की तरफ से खेलते हुए कप्तान महेंद्र सिंह धोनी के की बातों ने उनके खेलने का तरीका बदल दिया. इस सीजन में अजिंक्य रहाणे ने अब तक 199 की तूफानी स्ट्राइक रेट से बल्लेबाजी की है. 105 गेंद का सामना करते हुए 209 रन ठोक डाले हैं. -AP कभी 10वीं,12वीं में हो गए फेल, नहीं मानी हर, बाद में बन गए IAS-IPS और क्रिकेटर रेखा को जब लोगों ने कहा मोटी, रातों-रात नहीं हुआ करिश्मा, एक्ट्रेस को करना पड़ा था ये काम PHOTOS: केदारनाथ धाम के कपाट श्रद्धालुओं के दर्शन के लिए खुले, पीएम नरेन्द्र मोदी के नाम से पहली पूजा इंडियन प्रीमियर लीग 2023 के बाद भारत को आईसीसी टेस्ट चैंपियनशिप फाइनल में ऑस्ट्रेलिया के खिलाफ खेलना है. टेस्ट का वर्ल्ड कप कहे जाने वाले इस टूर्नामेट में भारत ने लगातार दूसरी बाद फाइनल में जगह बनाई है. पिछली बार न्यूजीलैंड से हार कर भारत को उप विजेता बनकर संतोष करना पड़ा था. विराट कोहली की कप्तानी में चूकी टीम इंडिया रोहित शर्मा की कप्तानी में यह ट्रॉफी उठाना चाहेगी.-AP","pubDate":"2023-04-25 13:28:24","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/04/RAHANE4-16824291953x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"GT vs MI Live Score: हार्दिक पंड्या और शुभमन गिल केपर जिम्मेदारी, 4 ओवर के बाद 23/1 गुजरात","link":"https://hindi.news18.com/news/sports/cricket-gt-vs-mi-ipl-2023-live-score-narendra-modi-stadium-ahmedabad-live-updates-5986861.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"GT vs MI Live Score: मुंबई और गुजरात की टीमें नरेंद्र मोदी स्टेडियम में आमने-सामने आ चुकी हैं. रोहित शर्मा ने टॉस जीतकर पहले गेंदबाजी करने का फैसला किया है. पिछले मैच में पंजाब किंग्स के द्वारा मुंबई को शिकस्त झेलनी पड़ी थी. वहीं, गुजरात की टीम के पास होम ग्राउंड पर एक और जीत की तलाश में होगी.","content":null,"pubDate":"2023-04-25 13:17:27","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/04/GT-MI-25-04-16824280563x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"IPL 2023 का एक नियम कप्तानों की गले की हड्डी बना, देने पड़ जा रहे लाखों रुपये, अब वॉर्नर को चूना लगा","link":"https://hindi.news18.com/news/sports/cricket-ipl-2023-slow-over-rate-became-threat-for-captains-ms-dhoni-kl-rahul-now-david-warner-penalised-paid-12-lakh-as-fine-5986807.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"IPL 2023 का एक नियम कप्तानों और टीमों के लिए जी का जंजाल जैसा बन गया है. जरा सी गलती हुई नहीं कि लाखों रुपये का जुर्माना लग जा रहा है. विराट कोहली को तो सबसे ज्यादा नुकसान हो चुका है. वहीं, केएल राहुल, एमएस धोनी भी झटका झेल चुके हैं. इस लिस्ट में दिल्ली कैपिटल्स के कप्तान डेविड वॉर्नर नया नाम हैं.","content":null,"pubDate":"2023-04-25 13:13:42","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/04/IPL-CAPTAIN-Rule.jpeg-16824289533x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"RCB vs KKR Head to Head Record in IPL History","link":"https://thesportsrush.com/cricket-news-rcb-vs-kkr-head-to-head-record-in-ipl-history/","keywords":["Cricket","IPL 2023","KKR","RCB","Indian Premier League","Kolkata Knight riders","Royal Challengers Bangalore"],"creator":["Dixit Bhargav"],"video_url":null,"description":"The 35th match of the ongoing 16th season of the Indian Premier League will begin in an hour or so from now. With the first half of the league stage coming to an end tonight, 36th match of the season between Royal Challengers Bangalore and Kolkata Knight Riders will be the first rematch of the… The post RCB vs KKR Head to Head Record in IPL History appeared first on The SportsRush.","content":"The 35th match of the ongoing 16th season of the Indian Premier League will begin in an hour or so from now. With the first half of the league stage coming to an end tonight, 36th match of the season between Royal Challengers Bangalore and Kolkata Knight Riders will be the first rematch of the season. Played around three weeks ago at the Eden Gardens, the last match between these two teams is remembered for Shardul Thakur‘s game-changing half-century powering the home team to a comprehensive 81-run victory in the first week of the competition. Knight Riders’ victory earlier this month had further bettered their lead in head-to-head records against this opposition. Having won three out of their last four matches against Royal Challengers, Kolkata have done well against them across facets including playing at the M Chinnaswamy Stadium. , Bengaluru! @rinkusingh235 | @venkateshiyer | @NitishRana_27 | #AmiKKR | #TATAIPL pic.twitter.com/WRmuPCdX6V — KolkataKnightRiders (@KKRiders) April 25, 2023 Speaking of this venue, Bangalore have won 44 and lost 42 out of their 91 home matches over the years. KKR, on the other hand, have won 10 and lost six out of their 16 matches here thus far. Going to play in Bengaluru for the first time since 2019, the visitors (9.1) even have a better average run rate than RCB (8.87) at this stadium. RCB vs KKR Head to Head Record in IPL History Total number of matches played: 32 Matches won by RCB: 14 Matches won by KKR: 18 Matches played in April: 16 (RCB 7, KKR 9) Matches played on Wednesday: 7 (RCB 3, KKR 4) Matches played at M Chinnaswamy Stadium: 11 (RCB 4, KKR 7) RCB average score against KKR: 148 KKR average score against RCB: 156 Most runs for RCB: 807 (Virat Kohli) Most runs for KKR: 364 (Andre Russell) Most wickets for RCB: 10 (Mohammed Siraj) Most wickets for KKR: 23 (Sunil Narine) Most catches for RCB: 17 (Virat Kohli) Most catches for KKR: 5 (Nitish Rana & Andre Russell) NOTE: Only players part of current squads have been considered above (most runs, wickets and catches). The post RCB vs KKR Head to Head Record in IPL History appeared first on The SportsRush.","pubDate":"2023-04-25 12:42:30","image_url":null,"source_id":"thesportsrush","category":["sports"],"country":["australia","united kingdom","india","united states of america"],"language":"english"},{"title":"मुंबई की हार में छा गए अर्जुन तेंदुलकर, IPL करियर का पहला छक्का जड़ लूट ली महफिल","link":"https://navbharattimes.indiatimes.com/sports/cricket/iplt20/news/ipl-2023-gt-vs-mi-arjun-tendulkar-six-mohit-sharma-video-/articleshow/99768922.cms","keywords":null,"creator":null,"video_url":null,"description":"IPL 2023: क्रिकेट के भगवान कहे जाने वाले सचिन तेंदुलकर के बेटे अर्जुन तेंदुलकर भी अपने पिता की तरह आईपीएल में अब जमकर सुर्खियां बटोर रहे है। उन्होंने अब गुजरात के खिलाफ गगनचुंबी छक्का जड़ महफिल लूट ली।","content":"आईपीएल 2023 का 35वां मुकाबला गुजरात टाइटंस और मुंबई इंडियंस के बीच 25 अप्रैल मंगलवार को अहमदाबाद के नरेंद्र मोदी स्टेडियम में खेला गया। यह मैच मेजबान टीम गुजरात ने 55 रन से अपने नाम कर लिया। यह टाइटंस की लगातार दूसरी जीत थी। जबकि मुंबई को इस सीजन यह चौथी हार मिली। मुंबई इंडियंस के लिए यह मैच किसी बुरे सपने से कम नहीं रहा। लेकिन इसके बावजूद महान सचिन तेंदुलकर के बेटे अर्जुन तेंदुलकर ने जमकर सुर्खियां बटोरी। सबने उन्हें गेंदबाजी करते हुए तो देखा ही है। लेकिन अब बल्लेबाजी करते हुए भी देख लिया। आईपीएल में पहली बार बल्लेबाजी कर रहे अर्जुन ने शानदार छक्का लगाया, जिसके चलते वह अब सुर्खियों में बने हुए हैं। दरअसल, मुंबई इंडियंस की पारी का अंतिम और 20वां ओवर गुजरात टाइटंस की ओर से मोहित शर्मा डाल रहे थे। उनके ओवर की पहली गेंद पर अर्जुन तेंदुलकर स्ट्राइक पर थे। अर्जुन को मोहित ने शॉट गेंद रखी, जिसको देखकर तेंदुलकर बिल्कुल भी नहीं घबराए और उन्होंने पलक झपकते ही एक शानदार पुल शॉट खेल दिया। अर्जुन के पुल शॉट में इतनी ताकत थी की गेंद सीधा सीमा-रेखा के पार चली गई। इसी के साथ अर्जुन ने अपने आईपीएल करियर का पहला छक्का भी लगा दिया। तेंदुलकर ने 73 मीटर का गगनचुंबी छक्का लगाया था। उनके इस सिक्स की वीडियो अब सोशल मीडिया पर काफी ज्यादा चर्चा में है। अर्जुन अपनी बल्लेबाजी से पहले गेंदबाजी में भी महफिल लूट ली थी। उन्होंने अपने 2 ओवर के स्पेल में महज 9 रन देकर रिद्धिमान साहा के रूप में एक बहुमूल्य विकेट चटकाया था। मुंबई इंडियंस के कप्तान रोहित शर्मा ने टॉस जीतकर पहले गेंदबाजी करने का फैसला किया था। ऐसे में उन्होंने पहले बल्लेबाजी करते हुए निर्धारित 20 ओवर में 6 विकेट के नुकसान पर 207 रन बनाए और मुंबई के सामने 208 रन का पहाड़नुमा लक्ष्य रखा। 208 रन के लक्ष्य को चेज करने उतरी मुंबई की टीम ताश के पत्तों की तरह बिखर गई। वह 20 ओवर में 9 विकेट पर सिर्फ 152 रन ही बना पाए और 55 रन से मैच हार गए।","pubDate":"2023-04-25 18:52:38","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Jonny Bairstow hits 97 for Yorkshire’s Second XI as England batter impresses on return from injury","link":"https://www.standard.co.uk/sport/cricket/jonny-bairstow-england-yorkshire-second-xi-injury-comeback-b1076701.html","keywords":["Cricket","Sport"],"creator":["Malik Ouzia"],"video_url":null,"description":"Bairstow missed England’s winter action after breaking his leg on a golf course","content":null,"pubDate":"2023-04-25 15:04:31","image_url":"https://static.standard.co.uk/2023/04/25/16/newFile.jpg?width=1200&auto=webp","source_id":"standarduk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"SL vs IRE: स्टर्लिंग-कैंफर के शतक,जयसूर्या का &#039;छक्का&#039; भी नहीं रोक पाया, आयरलैंड ने सबसे बड़ा टेस्ट स्कोर बनाया","link":"https://hindi.news18.com/news/sports/cricket-paul-stirling-curtis-campher-century-prabath-jayasuriya-5-wicket-haul-ireland-post-their-highest-test-score-sl-vs-ire-2nd-test-day-2-5987593.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"SL vs IRE 2nd Galle Test: आयरलैंड ने श्रीलंका के खिलाफ गॉल टेस्ट के दूसरे दिन इतिहास रच दिया है. मेहमान टीम ने पहली पारी में 492 रन बनाए. ये आयरलैंड का टेस्ट में सबसे बड़ा स्कोर है. आयरलैंड के लिए पॉल स्टर्लिंग और कर्टिस कैंफर ने शतक जमाया. श्रीलंका के लिए प्रभात जयसूर्या ने 5 विकेट लिए. उन्होंने 7वें टेस्ट में छठी बार पारी में 5 विकेट लेने का कारनामा किया है.","content":null,"pubDate":"2023-04-25 14:25:59","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/04/paul-stirling-16824326563x2.jpeg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"पृथ्वी शॉ को पूर्व क्रिकेटरने दिखाया आईना, फिटनेस पर खड़े किए सवाल, बोले- अगर चीजें काम नहीं कर रहीं तो...","link":"https://hindi.news18.com/news/sports/cricket-he-is-not-fit-simon-doll-criticizes-prithvi-shaw-after-see-flop-show-in-ipl-2023-dc-vs-srh-5987267.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"आईपीएल 2023 से पहले टीम इंडिया में वापसी की उम्मीद कर रहे पृथ्वी शॉ सीजन की शुरुआत से ही फेल नजर आए. जिसके बाद उन्हें पिछले मैच में प्लेइंग इलेवन से बाहर कर दिया गया था. अब न्यूजीलैंड के पूर्व क्रिकेटर ने इस खिलाड़ी की आलोचना की है.","content":null,"pubDate":"2023-04-25 14:25:18","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/04/Prithvi-Shaw-IPL-16824326803x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"&#039;सलेक्ट क्यों किया...?&#039; पूर्व भारतीय ओपनर ने WTC के लिए चुनी टीम इंडिया पर उठाए सवाल","link":"https://hindi.news18.com/news/sports/cricket-former-india-opener-aakash-chopra-questions-suryakumar-yadav-exclusion-from-wtc-final-squad-tweets-ek-match-ke-baad-drop-kyon-kiya-5986691.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"पूर्व भारतीय क्रिकेटर आकाश चोपड़ा ने 7 जून से लंदन के ओवल में शुरू होने वाले आगामी विश्व टेस्ट चैंपियनशिप (डब्ल्यूटीसी) फाइनल के लिए टीम इंडिया की टीम से सूर्यकुमार यादव को नहीं चुने जाने पर आवाज उठाई है.","content":"पूर्व भारतीय ओपनर ने टीम इंडिया के चयन पर सवाल उठाए हैं (PIC: AP) नई दिल्ली. सूर्यकुमार यादव ने इस साल की शुरुआत में भारतीय क्रिकेट टीम के लिए व्हाइट-बॉल क्रिकेट में अपने शानदार प्रदर्शन की बदौलत अपना टेस्ट डेब्यू किया था. उन्होंने फरवरी में बॉर्डर गावस्कर ट्रॉफी के पहले टेस्ट मैच में खेला और पहली पारी में 8 रन बनाए. भारत ने इस मैच में एक पारी और 132 से जीत हासिल की थी. दिलचस्प बात यह है कि एक टेस्ट खेलने और सिर्फ एक बार बल्लेबाजी करने के बावजूद सूर्यकुमार यादव बाकी पूरी सीरीज में बेंच पर बैठे रहे. अब आईसीसी वर्ल्ड टेस्ट चैंपियनशिप फाइनल के लिए भारतीय टीम का चयन हो गया है और इस टीम में सूर्यकुमार यादव को जगह नहीं मिली है. ऐसे में भारत के पूर्व ओपनर ने इस पर सवाल उठाए हैं. वर्ल्ड टेस्ट चैंपियनशिप फाइनल के लिए चुनी गई टीम में अजिंक्य रहाणे की वापसी हुई है. हाल ही में मौजूदा सत्र के लिए बीसीसीआई के सेंट्रल कॉन्ट्रेक्ट से बाहर किए जाने के एक महीने बाद अजिंक्य रहाणे ने टेस्ट टीम में वापसी की है. रहाणे फिलहाल आईपीएल में चेन्नई सुपर किंग्स के लिए खेल रहे हैं. आईपीएल के इस सीजन की शुरुआत में ही अजिंक्य रहाणे ने बल्ले से शानदार खेल दिखाया है. रहाणे ने जनवरी 2022 में अंतिम टेस्ट खेला था, इसके बाद से वह टीम से बाहर चल रहे थे. अजिंक्य रहाणे के सलेक्शन पर उठे सवाल, BCCI पर भड़के फैन्स, बोले- साबित हो गया रणजी ट्रॉफी की वैल्यू जीरो… भारत के पूर्व सलामी बल्लेबाज आकाश चोपड़ा अजिंक्य रहाणे को शामिल किए जाने से खुश हैं, लेकिन उन्होंने बीसीसीआई की चयन नीति पर बड़ा सवाल खड़ा कर दिया है. चोपड़ा को यह समझ में नहीं आ रहा है कि सूर्यकुमार यादव जैसे खिलाड़ी को एक टेस्ट पारी के आधार पर कैसे आंका जा सकता है. और अगर उसकी आवश्यकता नहीं है, तो पहले टेस्ट चयन क्यों किया गया. शुभमन गिल को देखते ही ईशान किशन ने जड़ा चांटा, गुजरात के बैटर ने लिया बदला, जानें VIRAL वीडियो की सच्चाई आकाश चोपड़ा ने ट्वीट करते हुए लिखा, ”रहाणे के लिए खुश हूं, लेकिन सूर्यकुमार यादव को शामिल करने और बाहर करने का क्या मतलब है? सलेक्ट क्यों किया… कर लिया तो एक मैच के बाद ड्रॉप क्यों किया? जसप्रीत बुमराह पर विचार नहीं किया गया, क्योंकि वह पीठ की चोट से उबर रहे हैं. वहीं, श्रेयस अय्यर ने भी हाल ही में पीठ की सर्जरी करवाई है. वर्ल्ड टेस्ट चैंपियनशिप के लिए भारतीय टीम: रोहित शर्मा (कप्तान), शुभमन गिल, चेतेश्वर पुजारा, विराट कोहली, अजिंक्य रहाणे, केएल राहुल, केएस भरत (विकेटकीपर), रविचंद्रन अश्विन, रवींद्र जडेजा, अक्षर पटेल, शार्दुल ठाकुर, मोहम्मद शमी, मोहम्मद सिराज, उमेश यादव, जयदेव उनादकट. ब्रेकिंग न्यूज़ हिंदी में सबसे पहले पढ़ें News18 हिंदी| आज की ताजा खबर, लाइव न्यूज अपडेट, पढ़ें सबसे विश्वसनीय हिंदी न्यूज़ वेबसाइट News18 हिंदी| Tags: Aakash Chopra , Ajinkya Rahane , Suryakumar Yadav , World test championship , World Test Championship Final , WTC Final 3 धुरंधरों ने कराई अजिंक्य रहाणे की टीम में वापसी, चयनकर्ताओं को किया मजबूर, बैटर ने पलट दिया सारा समीकरण बेहद स्टाइलिश हैं गौहर खान की बड़ी बहन, निभाए हैं निगेटिव रोल, क्यों बनाया था पाकिस्तानी को शौहर? कभी 10वीं,12वीं में हो गए फेल, नहीं मानी हर, बाद में बन गए IAS-IPS और क्रिकेटर","pubDate":"2023-04-25 14:08:36","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/04/Team-India-AP-16824309603x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Why is MI pacer Jofra Archer not playing against Gujarat Titans?","link":"https://www.indiatvnews.com/sports/cricket/why-is-mi-pacer-jofra-archer-not-playing-against-gujarat-titans-2023-04-25-866690","keywords":null,"creator":null,"video_url":null,"description":"Gujarat Titans host Mumbai Indians in the 35th match of the Indian Premier League (IPL) on Tuesday (April 25). It is a crucial game for both sides with the defending champions having a chance to climb to second place in table while MI have a decent opportunity to go on par with top four teams. However, the five-time champions are dealt with a blow ahead of the GT clash as Jofra Archer is not playing this game.","content":null,"pubDate":"2023-04-25 13:41:28","image_url":null,"source_id":"indiatvnews","category":["sports"],"country":["india"],"language":"english"},{"title":"3 धुरंधरों ने कराई अजिंक्य रहाणे की टीम में वापसी, चयनकर्ताओं को किया मजबूर, बैटर ने पलट दिया सारा समीकरण","link":"https://hindi.news18.com/photogallery/sports/cricket-sachin-tendulkar-to-ms-dhoni-motivate-ajinkya-rahane-for-come-back-journey-in-test-championship-final-5986735.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"25 अप्रैल मंगलवार को बीसीसीआई ने आईसीसी वर्ल्ड टेस्ट चैंपियनशिप फाइनल के लिए भारतीय टीम की घोषणा की. इस टीम में एक नाम ऐसा था जिसके होने की उम्मीद हर कोई लगा रहा था. अजिंक्य रहाणे को चयनकर्ताओं ने ऑस्ट्रेलिया के खिलाफ खेले जाने वाले फाइनल के लिए चुनी गई टीम में मौका दिया है. इंग्लैंड में खेलने के अनुभव और घरेलू प्रदर्शन के दम पर उनकी वापसी हुई है. अजिंक्य रहाणे की वापसी में 3 दिग्गजों का हाथ माना जा रहा है.","content":"25 अप्रैल मंगलवार को बीसीसीआई ने आईसीसी वर्ल्ड टेस्ट चैंपियनशिप फाइनल के लिए भारतीय टीम की घोषणा की. इस टीम में एक नाम ऐसा था जिसके होने की उम्मीद हर कोई लगा रहा था. अजिंक्य रहाणे को चयनकर्ताओं ने ऑस्ट्रेलिया के खिलाफ खेले जाने वाले फाइनल के लिए चुनी गई टीम में मौका दिया है. इंग्लैंड में खेलने के अनुभव और घरेलू प्रदर्शन के दम पर उनकी वापसी हुई है. अजिंक्य रहाणे की वापसी में 3 दिग्गजों का हाथ माना जा रहा है. इंडियन प्रीमियर लीग 2023 के बाद भारत को आईसीसी टेस्ट चैंपियनशिप फाइनल में ऑस्ट्रेलिया के खिलाफ खेलना है. टेस्ट का वर्ल्ड कप कहे जाने वाले इस टूर्नामेट में भारत ने लगातार दूसरी बाद फाइनल में जगह बनाई है. पिछली बार न्यूजीलैंड से हार कर भारत को उप विजेता बनकर संतोष करना पड़ा था. विराट कोहली की कप्तानी में चूकी टीम इंडिया रोहित शर्मा की कप्तानी में यह ट्रॉफी उठाना चाहेगी.-AP 2022 साउथ अफ्रीका दौरे के बाद टेस्ट टीम से बाहर हुए अजिंक्य रहाणे को चयनकर्ताओं ने आईसीसी टेस्ट चैंपियनशिप फाइनल के लिए चुनी गई टीम में मौका दिया है. जिस तरह से उनको बाहर किया गया था और बॉर्डर गावस्कर ट्रॉफी में भी बाहर रखा गया उससे लग रहा था अब वो कभी टीम में वापसी नहीं कर पाएंगे. अजिंक्य ने ऐसी बल्लेबाजी करके दिखाई है जिसने चयनकर्ताओँ को जगह देने पर मजबूर कर दिया.-AFP अजिंक्य रहाणे को टीम से बाहर किए जाने के बाद उनकी वापसी बहुत ही ज्यादा मुश्किल लग रही थी. खराब फॉर्म और उम्र उनकी वापसी के आड़े आ रही थी लेकिन 3 भारतीय धुरंधरों ने उनके ऐसा मोटिवेट किया जिसने उनके अंदर ऐसा ऊर्जा भरी जिसके बाद चमत्कार हो गया. अजिंक्य ने खुद महान सचिन तेंदुलकर की बातों को खुद दोहराया है.-AP सचिन तेंदुलकर की कही बातें अजिंक्य रहाणे ने कहा, आपके करियर में जो होता है उससे कभी कभी आप हद से ज्यादा तकलीफ महसूस करेंगे लेकिन आपको वैसे ही आगे बढ़ते रहना है जैसा अब तक करते रहे हैं. आपको आपका मौका जरूर मिलेगा और जब भी वो मिले उसे दोनों हाथों से लपकना है. उस वक्त तो आपको यह खेल बेहद निर्दयी लगेगा लेकिन यकीन मानिए आपको भविष्य में यही सहारा देने वाला है.-AFP अजिंक्य रहाणे की टीम इंडिया में वापसी के लिए दूसरी प्रेरणा उनके टेस्ट टीम के साथी चेतेश्वर पुजारा बने. रहाणे की तरह ही खराब फॉर्म की वजह से पुजारा को चयनकर्ताओं ने बाहर का रास्ता दिखाया था. इंग्लिश काउंटी में रनों का अंबार लगाकर उन्होंने टीम इंडिया में वापसी की और फिर बांग्लादेश दौरे पर शतक भी जमाया.-AP अजिंक्य रहाणे के लिए टीम इंडिया में वापसी का टर्निंग प्वाइंट इंडियन प्रीमियर लीग रहा. चेन्नई सुपर किंग्स की तरफ से खेलते हुए कप्तान महेंद्र सिंह धोनी के की बातों ने उनके खेलने का तरीका बदल दिया. इस सीजन में अजिंक्य रहाणे ने अब तक 199 की तूफानी स्ट्राइक रेट से बल्लेबाजी की है. 105 गेंद का सामना करते हुए 209 रन ठोक डाले हैं. -AP कभी 10वीं,12वीं में हो गए फेल, नहीं मानी हर, बाद में बन गए IAS-IPS और क्रिकेटर रेखा को जब लोगों ने कहा मोटी, रातों-रात नहीं हुआ करिश्मा, एक्ट्रेस को करना पड़ा था ये काम PHOTOS: केदारनाथ धाम के कपाट श्रद्धालुओं के दर्शन के लिए खुले, पीएम नरेन्द्र मोदी के नाम से पहली पूजा इंडियन प्रीमियर लीग 2023 के बाद भारत को आईसीसी टेस्ट चैंपियनशिप फाइनल में ऑस्ट्रेलिया के खिलाफ खेलना है. टेस्ट का वर्ल्ड कप कहे जाने वाले इस टूर्नामेट में भारत ने लगातार दूसरी बाद फाइनल में जगह बनाई है. पिछली बार न्यूजीलैंड से हार कर भारत को उप विजेता बनकर संतोष करना पड़ा था. विराट कोहली की कप्तानी में चूकी टीम इंडिया रोहित शर्मा की कप्तानी में यह ट्रॉफी उठाना चाहेगी.-AP","pubDate":"2023-04-25 13:28:24","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/04/RAHANE4-16824291953x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"GT vs MI Live Score: हार्दिक पंड्या और शुभमन गिल केपर जिम्मेदारी, 4 ओवर के बाद 23/1 गुजरात","link":"https://hindi.news18.com/news/sports/cricket-gt-vs-mi-ipl-2023-live-score-narendra-modi-stadium-ahmedabad-live-updates-5986861.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"GT vs MI Live Score: मुंबई और गुजरात की टीमें नरेंद्र मोदी स्टेडियम में आमने-सामने आ चुकी हैं. रोहित शर्मा ने टॉस जीतकर पहले गेंदबाजी करने का फैसला किया है. पिछले मैच में पंजाब किंग्स के द्वारा मुंबई को शिकस्त झेलनी पड़ी थी. वहीं, गुजरात की टीम के पास होम ग्राउंड पर एक और जीत की तलाश में होगी.","content":null,"pubDate":"2023-04-25 13:17:27","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/04/GT-MI-25-04-16824280563x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"IPL 2023 का एक नियम कप्तानों की गले की हड्डी बना, देने पड़ जा रहे लाखों रुपये, अब वॉर्नर को चूना लगा","link":"https://hindi.news18.com/news/sports/cricket-ipl-2023-slow-over-rate-became-threat-for-captains-ms-dhoni-kl-rahul-now-david-warner-penalised-paid-12-lakh-as-fine-5986807.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"IPL 2023 का एक नियम कप्तानों और टीमों के लिए जी का जंजाल जैसा बन गया है. जरा सी गलती हुई नहीं कि लाखों रुपये का जुर्माना लग जा रहा है. विराट कोहली को तो सबसे ज्यादा नुकसान हो चुका है. वहीं, केएल राहुल, एमएस धोनी भी झटका झेल चुके हैं. इस लिस्ट में दिल्ली कैपिटल्स के कप्तान डेविड वॉर्नर नया नाम हैं.","content":null,"pubDate":"2023-04-25 13:13:42","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/04/IPL-CAPTAIN-Rule.jpeg-16824289533x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"RCB vs KKR Head to Head Record in IPL History","link":"https://thesportsrush.com/cricket-news-rcb-vs-kkr-head-to-head-record-in-ipl-history/","keywords":["Cricket","IPL 2023","KKR","RCB","Indian Premier League","Kolkata Knight riders","Royal Challengers Bangalore"],"creator":["Dixit Bhargav"],"video_url":null,"description":"The 35th match of the ongoing 16th season of the Indian Premier League will begin in an hour or so from now. With the first half of the league stage coming to an end tonight, 36th match of the season between Royal Challengers Bangalore and Kolkata Knight Riders will be the first rematch of the… The post RCB vs KKR Head to Head Record in IPL History appeared first on The SportsRush.","content":"The 35th match of the ongoing 16th season of the Indian Premier League will begin in an hour or so from now. With the first half of the league stage coming to an end tonight, 36th match of the season between Royal Challengers Bangalore and Kolkata Knight Riders will be the first rematch of the season. Played around three weeks ago at the Eden Gardens, the last match between these two teams is remembered for Shardul Thakur‘s game-changing half-century powering the home team to a comprehensive 81-run victory in the first week of the competition. Knight Riders’ victory earlier this month had further bettered their lead in head-to-head records against this opposition. Having won three out of their last four matches against Royal Challengers, Kolkata have done well against them across facets including playing at the M Chinnaswamy Stadium. , Bengaluru! @rinkusingh235 | @venkateshiyer | @NitishRana_27 | #AmiKKR | #TATAIPL pic.twitter.com/WRmuPCdX6V — KolkataKnightRiders (@KKRiders) April 25, 2023 Speaking of this venue, Bangalore have won 44 and lost 42 out of their 91 home matches over the years. KKR, on the other hand, have won 10 and lost six out of their 16 matches here thus far. Going to play in Bengaluru for the first time since 2019, the visitors (9.1) even have a better average run rate than RCB (8.87) at this stadium. RCB vs KKR Head to Head Record in IPL History Total number of matches played: 32 Matches won by RCB: 14 Matches won by KKR: 18 Matches played in April: 16 (RCB 7, KKR 9) Matches played on Wednesday: 7 (RCB 3, KKR 4) Matches played at M Chinnaswamy Stadium: 11 (RCB 4, KKR 7) RCB average score against KKR: 148 KKR average score against RCB: 156 Most runs for RCB: 807 (Virat Kohli) Most runs for KKR: 364 (Andre Russell) Most wickets for RCB: 10 (Mohammed Siraj) Most wickets for KKR: 23 (Sunil Narine) Most catches for RCB: 17 (Virat Kohli) Most catches for KKR: 5 (Nitish Rana & Andre Russell) NOTE: Only players part of current squads have been considered above (most runs, wickets and catches). The post RCB vs KKR Head to Head Record in IPL History appeared first on The SportsRush.","pubDate":"2023-04-25 12:42:30","image_url":null,"source_id":"thesportsrush","category":["sports"],"country":["australia","united kingdom","india","united states of america"],"language":"english"}]}