{"newsArray":[{"title":"What’s in a toss?… Wellington Masakadza: Zimbabwe’s Cricket’s unlucky captain","link":"https://www.chronicle.co.zw/whats-in-a-toss-wellington-masakadza-zimbabwes-crickets-unlucky-captain/","keywords":["Sport"],"creator":["Chronicle Editor"],"video_url":null,"description":"Brandon Moyo Brandonmalvin9@gmail.com IN many sports, the toss is just a tradition that has to be done prior to the start of a match but has not much effect on the game. For example, in football or rugby, the toss has little or no effect in determining the match’s outcome but still has to be […]","content":"The Chronicle IN many sports, the toss is just a tradition that has to be done prior to the start of a match but has not much effect on the game. For example, in football or rugby, the toss has little or no effect in determining the match’s outcome but still has to be done regardless. However, in some sports, the toss plays a crucial role in determining how the match goes. Some may take it lightly, but it is equally important as the amount of work that is put into the field of play. The toss is one of the most important factors in a cricket match, it plays a huge role in determining the final outcome of a game. There is an old phrase that goes; “Win the toss and win the match.” In 2019, the then South African captain, Faf du Plessis saw the importance of a toss in a game after they were trounced 3-0 by India in a Test series that was played in the Asian nation. In all three matches, South Africa lost the toss. Losing the first two matches, having called wrong in both matches, du Plessis brought in a proxy captain in the third game to try and have a change of fortunes. They brought in the present skipper, Temba Bavuma but no fortunes changed, the Proteas lost the toss, eventually going on to lose the match and the series. However, winning the toss and winning the match is not a hard and fast rule, you can win the toss and go on to lose the match. Many captains, like du Plessis have been unlucky when it comes to the coin toss and back home, we have had our very own unlucky captain. Going out to the middle of the park for the first time in his career as captain of Zimbabwe at List A level, the cricketing toss gods surely turned their backs on one of their own, Wellington Masakadza. In Zimbabwe Select’s ongoing six-match one day series against the visiting Pakistan Shaheens side, Masakadza has had no luck with the coin, tossing it four times and getting it wrong on three occasions. Zimbabwe Select and the visiting Shaheens have played five matches, Masakadza has captained four of those. He lost the toss in three consecutive matches, before finally calling it right in the fourth game of series. The left-arm spinner has not had a great record with the toss, and one would say, he has bad toss luck, becoming Zimbabwe Cricket’s unlucky captain by repeatedly calling it wrong. In a twist of fate, the “win the toss and win the match,” belief however, has no place in Masakadza’s book. Toss decides fate, they said, but not for the “unlucky” 29-year-old Zimbabwean international. Zimbabwe Select won two of the three matches where Masakadza got it wrong. In the first match, the home side won by 24 runs and followed it up with an 81 runs win in the second encounter. The visitors managed to pull one back in the third match, recording a narrow five runs win (D/L method). Having the cricket gods smile at him in the fourth match and finally winning the toss, Masakadza went on to guide Zimbabwe to a thumping seven wickets win over their opponents to go 3-1 up in the series. The unlucky skipper missed Thursday’s fifth match of the series and his replacement, Sean Williams called it right but the team lost the match, leaving the series at 3-2 going into today’s decider. – @brandon_malvin","pubDate":"2023-05-26 22:04:00","image_url":null,"source_id":"chronicle_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"GT vs MI IPL 2023 Qualifier 2 Stats: Gill inches closer to Kohli's all-time record; Rohit's misery in playoffs continues","link":"https://www.firstpost.com/firstcricket/sports-news/gt-vs-mi-ipl-2023-qualifier-2-stats-gill-inches-closer-to-kohlis-all-time-record-rohits-misery-in-playoffs-continues-12653042.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"GT vs MI IPL 2023 Qualifier 2 Stats: Gill inches closer to Kohli's all-time record; Rohit's misery in playoffs continues","content":"Cricket GT vs MI IPL 2023 Qualifier 2 Stats: Gill inches closer to Kohli's all-time record; Rohit's misery in playoffs continues Shubman Gill achieved many a milestone and broke quite a few records with his 60-ball 129 that played a central role in Gujarat Titans' 62-run victory over Mumbai Indians in Qualifier 2 of IPL 2023. FirstCricket Staff May 27th, 2023 3:33:51 IST Gujarat Titans opener Shubman Gill kisses his bat after scoring his third century in four outings during Qualifier 2 of IPL 2023 agains Mumbai Indians in Ahmedabad. AP Shubman Gill smashed his third century in four outings as Gujarat Titans (GT) stormed into the final of the 2023 Indian Premier League (IPL) after trouncing Mumbai Indians (MI) by 62 runs in Qualifier 2 in Ahmedabad on Friday. IPL 2023: Full coverage | Points table | Schedule | Results | Orange Cap | Purple Cap​ Gill tore the MI attack to shreds with a knock of 129 off just 60 deliveries , smashing 10 sixes and seven fours during his stay at the crease at the Narendra Modi Stadium. His dominant knock powered GT, who had won the tournament on debut last season, to a humongous of 233/3 after being invited to bat by MI skipper Rohit Sharma. Related Articles GT vs MI IPL 2023 Qualifier 2: Gujarat Titans a strong team to beat, says Aaron Finch GT vs MI IPL 2023 Qualifier 2: Head-to-head, venue, match timings, weather report, live streaming - All you need to know Read | Shubman Gill rates 129 against MI in Qualifier 2 as his finest IPL knock Mumbai then were under pressure from the very beginning of their chase with skipper Rohit and Impact Player Nehal Wadhera departing for single-digit scores. The trio of Tilak Verma (43), Suryakumar Yadav (61) and Cameron Green (30) briefly revived Mumbai’s chase with attacking partnerships, but none of them could convert their knocks into the kind of big knock that Gill had produced earlier in the day, and take the game deep. Mohit Sharma’s dismissal of Surya proved to be the turning point and the 34-year-old seamer would later run through the remaining MI batters, returning his career-best limited-overs figures of 5/10 as Mumbai were bowled out for 171 in 18.2 overs in reply. Read | Gill hailed by Kohli, ABD after blistering 129 against MI in Qualifier 2 Along the way, there were a number of milestones reached and records broken, which we take a look at in greater detail below: — Shubman Gill became the leading run-scorer this season with his knock of 129, going past RCB skipper Faf du Plessis’ tally of 730 runs. Gill’s current tally stands at 851 runs from 16 appearances. — Gill is also third in list of most runs scored in a single IPL season, sitting behind RCB’s Virat Kohli (973 in 2016) and Jos Buttler (RR in 2022). Gill will need to score 123 or more in the final against CSK if he is to break the all-time record. — That’s not all as far as breaking King Kohli’s records go; Gill also broke the former India and RCB captain’s record for most runs in four consecutive IPL innings. Gill has collected 376 in his last four outings while Kohli had managed 351 in 2016. — Gill’s 129 is the second-highest individual score by an Indian in the IPL. The GT opener fell just three short of the record that currently belongs to KL Rahul (132 for PBKS vs RCB in 2020) — Gujarat Titans currently have a hundred per cent record as far as topping the points table and reaching the IPL final is concerned, having done so on debut last season as well. — MI skipper Rohit Sharma’s miserable run in IPL playoffs continued after getting dismissed for 8 off 7 balls, taking his tally to 316 runs at an average of 15. Rohit Sharma in #IPLPlayoffs Innings – 22 Runs – 316 Average – 15.0 Strike Rate – 107.1 — Cricbaba (@thecricbaba) May 26, 2023 — With his match-winning haul of 5/10, Mohit Sharma became only the second bowler in the history of the IPL to collect a five-for in a playoff fixture. MI’s Akash Madhwal was the first to this feat, achieving it just two days ago with a haul of 5/5 against LSG in the Eliminator. — Mohit also collected his maiden five-for in limited-overs cricket in the process. — Mohammed Shami went past Trent Boult’s record for most powerplay wickets in a single IPL season. Shami dismissed Rohit and Wadhera to take his tally to 17, going past Boult’s 16 for MI in 2020. Read all the Latest News , Trending News , Cricket News , Bollywood News , India News and Entertainment News here. Follow us on Facebook , Twitter and Instagram . Updated Date: May 27, 2023 03:33:51 IST Tags: Cricket Ipl 2023 Ipl 2023 Gt Ipl 2023 Mi Find latest and upcoming tech gadgets online on Tech2 Gadgets. Get technology news, gadgets reviews & ratings. Popular gadgets including laptop, tablet and mobile specifications, features, prices, comparison.","pubDate":"2023-05-26 22:03:51","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/05/Shubman-Gill-century-GT-MI-IPL-2023-Qualifier-2-AP-640.jpg","source_id":"firstpost","category":["sports"],"country":["india"],"language":"english"},{"title":"Make or break tie for Zimbabwe Select","link":"https://www.chronicle.co.zw/make-or-break-tie-for-zimbabwe-select/","keywords":["Sport"],"creator":["Chronicle Editor"],"video_url":null,"description":"Brandon Moyo Brandonmalvin9@gmail.com LOOKING at ending the six-match series on a high note, only one result has to be in the minds of Zimbabwe Select players, victory, when they face off against the visiting Pakistan Shaheens in the decider today at Harare Sports Club. Zimbabwe Select requires nothing but a win to secure the series, […]","content":"The Chronicle LOOKING at ending the six-match series on a high note, only one result has to be in the minds of Zimbabwe Select players, victory, when they face off against the visiting Pakistan Shaheens in the decider today at Harare Sports Club. Zimbabwe Select requires nothing but a win to secure the series, given the good start that they had. The series is standing at 3-2, with both teams desperate for a win, however, the home side will have to show more hunger. A win for the home side will be a good confidence booster, coming from a dismal performance on Thursday. A 3-3 will be as good as a series win for Pakistan Shaheens who would have come from 2-0 down to get a share of the spoils. The full-strength home side will have to bring their A game in today’s match to claim the series which is their last prior to the commencement of the upcoming Men’s Cricket World Cup qualifiers. The Zimbabwean side will also be looking at the returning Sikandar Raza, to help see the team through. Raza returned to the team on Thursday having missed out on other matches due to Indian Premier League (IPL) commitments. However, it was not a good return by the all-rounder as Zimbabwe were thumped by 177 runs and the Select side will be hoping to put their poor performance behind them. One area that the team will have to work on is their batting, which has been inconsistent especially at the top of the order. The opening batters have failed to put up any decent partnership on the board, something which they will have to work on in today’s game. Without a good foundation at the top, it puts pressure on other batters. Despite struggling at the top, the experience of batters such as Craig Ervine and Sean Williams will be crucial to the team’s campaign and will also be looking at Clive Madande to continue with his impressive form with the bat. Madande fought almost a lone battle on Thursday, top-scoring a gallant 41 runs not out. Crucial to claiming the series today will also be the bowlers who have had a good campaign so far despite the struggles in the previous match. Zimbabwean bowlers have been playing a crucial role in the team’s performance, stepping up when needed the most. The captain Wellington Masakadza, Tendai Chatara, Blessing Muzarabani and Bradley Evans have had a good campaign with a ball in hand and will, once again, be key in today’s game. Zimbabwe Cricket (ZC) organised the series as part of their preparations for the World Cup Qualifiers which start on June 18 and will be played in venues across Harare and Bulawayo. Zimbabwe was put in Group A alongside West Indies, Netherlands, Nepal and the United States of America (USA) and their matches will be played in Harare. In Group B, there will be Sri Lanka, Ireland, Scotland, Oman and the United Arab Emirates (UAE) and their group matches will be played in Bulawayo. The series decider is set to start at 09.15hrs. – @brandon_malvin","pubDate":"2023-05-26 22:03:02","image_url":null,"source_id":"chronicle_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"Ndhlovu, Sibanda bat their way to world","link":"https://www.chronicle.co.zw/ndhlovu-sibanda-bat-their-way-to-world/","keywords":["Sport"],"creator":["Chronicle Editor"],"video_url":null,"description":"Fungai Muderere fungai.muderere@bmetro.co.zw “OUR goals can only be reached through a vehicle of a plan, in which we must fervently believe, and upon which we must vigorously act. There is no other route to success.” These words are certainly ringing true into the ears of Lady Chevrons duo of all-rounder Kelis Ndhlovu and bowler Nomvelo […]","content":"The Chronicle “OUR goals can only be reached through a vehicle of a plan, in which we must fervently believe, and upon which we must vigorously act. There is no other route to success.” These words are certainly ringing true into the ears of Lady Chevrons duo of all-rounder Kelis Ndhlovu and bowler Nomvelo Sibanda who have batted their way to the world amid revelations that they have been invited to the third edition of the Fairbreak Invitational set to be played in the United States of America (USA) from September 14 to 30. It will be debut appearances for the duo where they will join Lady Chevrons captain Mary Anne Musonda at the global cricket extravaganza that undertakes to deliver equal opportunities for female cricketers from all corners of the globe. Thus, Fairbreak and USA Cricket are supporting gender equity and the advancement of women’s and girl’s cricket globally. Musona has played in all the two previous editions of the Fairbreak Invitational. Ndhlovu’ abilities cannot be doubted as she emerged the best player in both domestic tournaments played this year. She was voted Player of the Tournament in the Fifty50 Challenge and Women’s T20 Cup. Earlier this year, she captained Zimbabwe in the inaugural ICC Under-19 Women’s World Cup. She made her debut for Zimbabwe as a 16-year-old in 2022 in Namibia. In that debut series, she and Sharne Mayers hit an unbeaten 158 first wicket partnership. The inaugural Fairbreak Invitational T20 took place in partnership with Cricket Hong Kong in Dubai in May 2022. Following on from the success of Fairbreak Invitational, and with the continued support and backing of Cricket Hong Kong, the other contest was held in April this year at Kowloon Cricket Club in Hong Kong. With a follow-up tournament scheduled for September in the USA, Fairbreak Global will now be reportedly conducting two tournaments per year. Six teams comprising some of the biggest names in women’s first-class cricket and outstanding players from associate member nations around the globe, will play each other in both two-week tournaments. All matches will be broadcast internationally. Meanwhile, Musonda has had a brilliant start to Cricket Ireland’s 2023 Women Super Series T20 tournament as she is sitting on top of the batting charts with most runs scored so far. Musonda, who is playing for Scorchers, is the three-team league’s leading run scorer with 153 runs from five matches and as many innings. From the matches played, the Lady Chevrons skipper has a high score of 71 runs not out, the league’s highest individual score so far. She has a strike rate of 96,23. The 31-year-old Zimbabwean star has an average of 51 with the bat. She is one of the six overseas players taking part in the league. In second place with the most runs in the competition, Musonda is followed by Amy Hunter who has scored 126 runs in five matches at an average 31,50 and has a high score of 60 runs which is also the second highest individual score. Hunter also holds the third highest individual score of 46 runs. Musonda’s high score came on Sunday where she helped her team register a 25 runs win over Typhoons. Scorchers finished on 121/3, courtesy of the Zimbabwean’s unbeaten half century. She was supported by Gaby Lewis who fell for 20 runs. In their defence, Musonda took three catches to help her side bowl out their opponents for 96 runs in 19,2 overs. Sophie MacMahon starred with the ball for Scorchers, taking a five-wicket haul as she finished with figures of 5/12 in 3,2 overs. Ellie McGee took three scalps, giving away 17 runs in her four over spell. Typhoons’ Mary Waldron top scored with 16 runs off 20 deliveries. — @FungaiMuderere.","pubDate":"2023-05-26 22:02:50","image_url":null,"source_id":"chronicle_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"Shubman Gill says 129 against Mumbai Indians in Qualifier 2 his 'best innings so far in the IPL'","link":"https://www.firstpost.com/firstcricket/sports-news/shubman-gill-says-129-against-mumbai-indians-in-qualifier-2-his-best-innings-so-far-in-the-ipl-12653032.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"Shubman Gill says 129 against Mumbai Indians in Qualifier 2 his 'best innings so far in the IPL'","content":"Cricket Shubman Gill says 129 against Mumbai Indians in Qualifier 2 his 'best innings so far in the IPL' Shubman Gill powered Gujarat Titans to a match-winning total of 233/3 against Mumbai Indians with a 60-ball 129, his third century in four outings in Qualifier 2 of IPL 2023 on Friday. FirstCricket Staff May 27th, 2023 2:36:17 IST Gujarat Titans opener Shubman Gill celebrates after completing his third century of IPL 2023 during the Qualifier 2 clash against Mumbai Indians. Sportzpics Gujarat Titans opener Shubman Gill rated his blazing 129 off 60 balls against Mumbai Indians on Friday as his best knock in the Indian Premier League (IPL). IPL 2023: Full coverage | Points table | Schedule | Results | Orange Cap | Purple Cap​ Gill tore the Mumbai attack to shreds, smashing 10 sixes and seven fours to power Gujarat to a humongous score of 233/3 after they were asked to bat. MI, in reply, were shot out for 171 with Mohit Sharma collecting his career-best limited-overs figures of 5/10 to power GT to a second consecutive final since making their debut last season. Related Articles IPL 2023 Qualifier 2: Shubman Gill, Mohit Sharma help GT thrash MI by 62 runs, reach 2nd straight final GT vs MI IPL 2023 Qualifier 2: Shubman Gill smashes third century in four outings against hapless Mumbai attack The Punjab batter had not crossed the three-figure mark in 86 IPL matches since making his debut with the Kolkata Knight Riders (KKR) in 2018, but now has three to his name in his last four outings, all of which have resulted in victories for Gujarat. “I think this was probably my best innings so far in the IPL,” Gill said during the post-match presentation. Read | Gill hailed by Kohli, ABD after blistering 129 against MI in Qualifier 2 Gill pointed to the over in which he carted Akash Madhwal, hero of MI’s 81-run victory over Lucknow Super Giants in the Eliminator with a haul of 5/5, for three sixes that instilled belief in him that it was his day. “For me, it is playing ball to ball, over to over. The over where I hit three sixes gave me the momentum to go big. That’s when I realised it could be my day. “It was a good wicket to bat on as well. Not a conscious decision, you keep inventing as a batter but for me the belief is more important. I am coming off a good international season as well. Had a good season last time as well. When I start well, I feel confident I can score well,” Gill added. Hope Gill continues that form: Rohit Mumbai skipper Rohit Sharma heaped praise on the 23-year-old, viewed by many as the next Indian batting superstar and the heir-apparent to Virat Kohli, after the game. According to ‘Hitman’, Gill’s 129 proved to be the difference between the two sides in the penultimate match of the season and ultimately helped Gujarat add another “20-25 extra runs” on the board. He also hoped Gill would continue this form for the Indian team as well with the ODI World Cup set to take place in India later this year. “Shubman batted well, wicket was good. They got 20-25 extra. We were positive after the first-half. We have to credit Shubman. I hope he continues that form,” Rohit said after the game. In Photos: All-round GT trounce MI to setup final against CSK Rohit credited Suryakumar Yadav (61) and Cameron Green (30) for reviving Mumbai’s hopes after a poor start to their chase, but felt they needed someone to take the game deep like Gill did for them to pull off the chase successfully, which they ultimately failed to accomplish. “Greeny and Surya batted well but we lost our way. We wanted to give it a good crack, be positive. We couldn’t get going in the powerplay. We wanted one batter, like Gujarat did, and take the game deep where anything can happen on a good pitch and a ground with a small boundary. But credit to GT, who played well,” added the MI skipper. GT skipper Hardik Pandya, meanwhile, couldn’t be more proud of the way Gill conducted himself at the Narendra Modi Stadium on the big occasion. “I think the clarity and confidence he is carrying is amazing. Today’s innings was one of the finest, he never looked rushed. It felt like someone was throwing balls and he was hitting. He will be a superstar in international and franchise cricket,” Pandya added after the game. Read all the Latest News , Trending News , Cricket News , Bollywood News , India News and Entertainment News here. Follow us on Facebook , Twitter and Instagram . Updated Date: May 27, 2023 02:36:17 IST Tags: Cricket Ipl 2023 Ipl 2023 Gt Ipl 2023 Mi Find latest and upcoming tech gadgets online on Tech2 Gadgets. Get technology news, gadgets reviews & ratings. Popular gadgets including laptop, tablet and mobile specifications, features, prices, comparison.","pubDate":"2023-05-26 21:06:17","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/05/Shubman-Gill-century-GT-MI-IPL-2023-Qualifier-2-Sportzpics-640.jpg","source_id":"firstpost","category":["sports"],"country":["india"],"language":"english"},{"title":"मुंबई इंडियंस की किस्मत रूठी, टिम डेविड ने टपकाया कैच, गिल ने ठोक दिया शतक","link":"https://sports.ndtv.com/hindi/cricket/most-100-in-one-ipl-season-green-dropped-gills-catch-gill-scored-a-century-4069855#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"गिल का आईपीएल 2023 में ये तीसरा शतक है. इस पूरे सीज़न गिल शानदार फॉर्म में नज़र आए. इसी बीच मुंबई इंडियंस पर गिल का ये शतक भारी पड़ सकता है.","content":"मुंबई इंडियंस की किस्मत रूठी, ग्रीन ने टपकाया कैच, गिल ने ठोका शतक मुंबई इंडियंस और गुजरात टाइटंस के बीच अहमदाबाद में खेले जा रहे दूसरे क्वालिफायर मुकाबले में शुभमन गिल ने 49 गेंद में शानदार शतक जड़ा है. गिल का आईपीएल 2023 में ये तीसरा शतक है. इस पूरे सीज़न गिल शानदार फॉर्म में नज़र आए. इसी बीच मुंबई इंडियंस पर गिल का ये शतक भारी पड़ सकता है. क्योंकि गिल को ये शतक लगाने ये मुंबई रोक भी सकती थी.क्योंकि गिल जब 31 रन के स्कोर पर बल्लेबाज़ी कर रहे थे तभी क्रिस जॉर्डन की गेंद पर टिम डेविड ने गिल का कैच छोड़ दिया, और इसका खामियाज़ा अब मुंबई इंडियंस को भुगतना पड़ सकता है. क्योंकि गुजरात के ओपनर गिल का ये शतक मुंबई इंडियंस को आईपीएल से बाहर भी कर सकता है. इस शतक के साथ ही वे आईपीएल के एक सीज़न में सबसे ज्यादा शतक लगाने के मामले में विराट कोहली ओर जॉस बटलर के बाद तीसरे बल्लेबाज़ बने हैं. 𝗛𝗨𝗡𝗗𝗥𝗘𝗗 𝗡𝗨𝗠𝗕𝗘𝗥 𝗧𝗛𝗥𝗘𝗘 𝗙𝗢𝗥 𝗦𝗛𝗨𝗕𝗠𝗔𝗡 𝗚𝗜𝗟𝗟 🔥🔥 All of them in ONE season and he continues to impress everyone with his batting composure 👏🏻👏🏻 | | | मैच की अगर बात करें तो मुंबई के कप्तान रोहित शर्मा ने टॉस जीतकर पहले गेंदबाज़ी करने का फैसला किया. मुकाबला शुरू होने से पहले अहमदाबाद में तेज़ बारिश हुई थी. फैंस के लिए खुशखबरी ये है कि बारिश अब रुक गई है. लेकिन अगर बारिश फिर से होती है और किसी भी कंडीशन में मुकाबला रद्द होता है तो इस स्थिति में गुजरात की टीम प्वाइंट्स टेबल में टॉप पर रहने के चलते फाइनल में एंटर करेगी. बता दें कि गुजरात ने लीग स्टेज में 14 में से 10 मुकाबले जीतकर 20 अंको के साथ टेबल टॉप किया था. इसके अलावा अगर मुकबला खेला जाता है तो जीतने वाली टीम सीधे फाइनल में जाएगी और हारने वाली टीम टूर्नामेंट से बाहर हो जाएगी. बता दें कि मुंबई इंडियंस के पास 5 आईपीएल ट्रॉफी जीतने का अनुभव है वहीं गुजरात पिछले आईपीएल सीज़न की विजेता है. ऐसे में दोनों टीमों के बीच कड़ी टक्कर होने की उम्मीद है. रोहित शर्मा की अगुवाई वाली मुंबई इंडियंस फाइनल में जगह बनाना भली भांति जानती है वहीं गुजरात के कोच आशीष नेहरा भी टीम को ट्रॉफी कैसे जीतानी है, इसमें काफी एक्सपर्ट हैं. * * पढ़ें ,राजनीति,खेल समाचार, और की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-05-26 19:02:05","image_url":"https://c.ndtvimg.com/2023-05/733jrdf_shubman-gill_625x300_26_May_23.jpg","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Gujarat Titans beats Mumbai Indians to reach second consecutive final, faces CSK on Sunday","link":"https://sportstar.thehindu.com/cricket/ipl/ipl-news/gujarat-titans-beats-mumbai-indians-gt-vs-csk-ipl-2023-final-ahmedabad/article66898573.ece","keywords":null,"creator":null,"video_url":null,"description":"Gujarat Titans beat Mumbai Indians by 62 runs at the Narendra Modi Stadium in Ahmedabad to reach the IPL 2023 final on Friday.","content":"That Shubman Gill was capable of reaching stratospheric levels of batsmanship was seldom in doubt. On Friday, a packed Narendra Modi Stadium experienced it firsthand as he led Gujarat Titans (GT) to its second straight Indian Premier League final, against Chennai Super Kings, with a 62-run victory over Mumbai Indians (MI). Gill’s century (129, 60b, 7x4, 10x6), his third in four innings, was T20 batting at its purest. This was especially true of the latter half of the knock. The 23-year-old took 32 balls to get to his half-century. Off the next 28, he smashed 79 to help his side reach 233 for three. MI’s reply was off to a wretched start. Ishan Kishan didn’t come out to bat because of a concussion; Cameron Green retired hurt early on after being hit on the elbow; and Rohit Sharma was out cheaply, with Josh Little completing a fine catch at short fine-leg. GT vs MI HIGHLIGHTS Tilak Varma injected some much-needed belief with a manic 43 (14, 5x4, 3x6), which included two elegant clipped sixes and a gorgeous cover drive. Suryakumar Yadav fought too (61, 38b, 7x4, 2x6), bringing up his half-century with a characteristic scooped six off Little. But Mohit Sharma scalped the all-important wicket in the 15th over, rattling Suryakumar’s leg stump with nearly 80 runs needed. Two balls later, Mohit (5 for 10) excised Vishnu Vinod before Rashid Khan trapped Tim David in front to bring a swift end to MI’s resistance. Earlier, asked to bat first after a heavy downpour had delayed the start by 30 minutes, GT plodded along in the PowerPlay, collecting 50 runs. Chris Jordan could have had Gill for 30 in the sixth over, but a diving David dropped the chance, and MI was in for a hiding. Akash Madhwal and Piyush Chawla have been among MI’s best bowlers. But neither their form nor their pedigree mattered to Gill. In the 12th over, Madhwal was smashed for three sixes on the leg-side before Chawla was deposited over long-off, paddle hit to the boundary, and clobbered for a massive 106-metre six over deep mid-wicket. The two bled 97 runs in seven overs. Gill hit 10 maximums in all, and the 10th was worthy of a place in the Louvre. He walked down the pitch to Green and nonchalantly slapped a rising delivery over the deep mid-wicket fence. Gill finally fell, holing out to David at deep mid-wicket off Madhwal. But skipper Hardik Pandya’s unbeaten 28 (13b, 2x4, 2x6) ensured a gigantic total that MI couldn’t even sniff. Read more stories on IPL News.","pubDate":"2023-05-26 18:28:03","image_url":null,"source_id":"sportstar","category":["sports"],"country":["india"],"language":"english"},{"title":"ICC reveals prize money for World Test C’ship winner","link":"https://thefrontierpost.com/icc-reveals-prize-money-for-world-test-cship-winner/","keywords":["Sports"],"creator":["The Frontier Post"],"video_url":null,"description":"F.P. Report DUBAI: International Cricket Council (ICC) on Friday announced the prize money for the World Test Championship 2021-23 cycle with a total fund of $3.8 million to be shared between the nine teams. The winner of the World Test Championship (WTC) final between India and Australia will get a whopping amount of $1.6 million […]","content":"F.P. Report DUBAI: International Cricket Council (ICC) on Friday announced the prize money for the World Test Championship 2021-23 cycle with a total fund of $3.8 million to be shared between the nine teams. The winner of the World Test Championship (WTC) final between India and Australia will get a whopping amount of $1.6 million while the losing team will still earn $800,000. The Grand Finale at The Oval in London from 7 June will not only decide the Test champions for the next two years but also the fate of a major chunk of around 63 per cent of the total prize pool of the outgoing WTC cycle. The remaining seven teams will share $1.4 million in a manner that South Africa earns $450,000 for finishing third in the WTC standings, England bags $350,000 for finishing fourth, Sri Lanka gets $200,000 for finishing fifth. The bottom four teams, including Pakistan, pocket $100,000 each. It is pertinent to mention here that Pakistan finished seventh on the standings of the outgoing World Test Championship Cycle with a below-par percentage of 38.1. Babar Azam-led side won only four Tests, lost six and drew four out of their total 14 fixtures in the cycle. Interestingly, the prize money has not been changed from the last inaugural edition of the championship (2019-21) with a total purse of $3.8 million.","pubDate":"2023-05-26 16:39:57","image_url":null,"source_id":"thefrontierpost","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"Six former Yorkshire players sanctioned","link":"https://thefrontierpost.com/six-former-yorkshire-players-sanctioned/","keywords":["Sports"],"creator":["The Frontier Post"],"video_url":null,"description":"LONDON (Agencies): Six former Yorkshire County Cricket Club players and coaches on Friday, have been sanctioned by the Cricket Discipline Commission (CDC) panel for a suspected use of racist language. According to the ECB, the CDC has today published its decisions in relation to charges brought by the ECB against Yorkshire CCC and a number […]","content":"LONDON (Agencies): Six former Yorkshire County Cricket Club players and coaches on Friday, have been sanctioned by the Cricket Discipline Commission (CDC) panel for a suspected use of racist language. According to the ECB, the CDC has today published its decisions in relation to charges brought by the ECB against Yorkshire CCC and a number raof individuals. As per the latest development, former Yorkshire players Tim Bresnan, John Blain, Matthew Hoggard, Andrew Gale and Richard Pyrah were sanctioned for racism. Ballance, Bresnan, Gale, and Pyrah were fined as well as suspended from coaching and playing cricket for varied lengths of time, whereas Blain and Hoggard were only fined. Furthermore, all six players have been advised to attend a racism or discrimination education course at their own expense. The sanctioned individuals are able to appeal the decisions before the end of business on Friday 9 June 2023. The CDC has also confirmed that the sanction hearing for Yorkshire County Cricket Club, which has admitted four breaches of ECB Directive 3.3, will be held on Tuesday 27 June 2023. These CDC sanction decisions have been made by an independent panel consisting of Tim O’Gorman (Chair of the CDC), Mark Milliken-Smith KC and Dr Seema Patel. Earlier, former England captain and renowned commentator Michael Vaughan was cleared of racism charges by the CDC. In light of the CDC decisions, Michael Vaughan was not found liable for a breach of ECB Directive 3.3, which states: “No such person may conduct themself in a manner or do any act or omission which may be prejudicial to the interests of cricket or which may bring the game of cricket or any Cricketer or group of Cricketers into disrepute”.","pubDate":"2023-05-26 16:38:41","image_url":null,"source_id":"thefrontierpost","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"Peshawar Zalmi Talent Hunt 2023 ends successfully in Hayatabad Sports complex","link":"https://thefrontierpost.com/peshawar-zalmi-talent-hunt-2023-ends-successfully-in-hayatabad-sports-complex/","keywords":["Sports"],"creator":["The Frontier Post"],"video_url":null,"description":"F.P. Report PESHAWAR: The first and important stage of the Zalmi talent hunt 2023 organized by the Pakistan Super League franchise Peshawar Zalmi has ended, more than ten thousand young cricketers have registered in the four-day trials at the Hayatabad Sports Complex Peshawar. Peshawar Zalmi President Inzamam ul Haq, Director Cricket Mohammad Akram, Zalmi star […]","content":"F.P. Report PESHAWAR: The first and important stage of the Zalmi talent hunt 2023 organized by the Pakistan Super League franchise Peshawar Zalmi has ended, more than ten thousand young cricketers have registered in the four-day trials at the Hayatabad Sports Complex Peshawar. Peshawar Zalmi President Inzamam ul Haq, Director Cricket Mohammad Akram, Zalmi star Kamran Akmal were among the selection panel that tested the talent of the young cricketers participating in the open trials and selected the best players. Pakistan and Peshawar Zalmi captain Babar Azam also reached Peshawar on the third day of the trials and encouraged the young cricketers. Zalmi and Pakistan Rising Star Mohammad Haris were also present at the trials and encouraged the young cricketers. The young cricketers were given an opportunity to show their skills by organizing matches between Inzamam u l Haq XI, Babar Azam XI, Kamran Akmal XI and Darren Sammy XI. After the end of these matches, the fiften best young cricketers have been finalized. Peshawar Zalmi Director of Cricket Muhammad Akram said that Peshawar Zalmi will provide all possible facilities to the fiften young cricketers. Young cricketers will get training and coaching at the National Cricket Academy and the most talented young cricketers can also be given an opportunity in the emerging category of PSL 9.","pubDate":"2023-05-26 16:37:12","image_url":null,"source_id":"thefrontierpost","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"What’s in a toss?… Wellington Masakadza: Zimbabwe’s Cricket’s unlucky captain","link":"https://www.chronicle.co.zw/whats-in-a-toss-wellington-masakadza-zimbabwes-crickets-unlucky-captain/","keywords":["Sport"],"creator":["Chronicle Editor"],"video_url":null,"description":"Brandon Moyo Brandonmalvin9@gmail.com IN many sports, the toss is just a tradition that has to be done prior to the start of a match but has not much effect on the game. For example, in football or rugby, the toss has little or no effect in determining the match’s outcome but still has to be […]","content":"The Chronicle IN many sports, the toss is just a tradition that has to be done prior to the start of a match but has not much effect on the game. For example, in football or rugby, the toss has little or no effect in determining the match’s outcome but still has to be done regardless. However, in some sports, the toss plays a crucial role in determining how the match goes. Some may take it lightly, but it is equally important as the amount of work that is put into the field of play. The toss is one of the most important factors in a cricket match, it plays a huge role in determining the final outcome of a game. There is an old phrase that goes; “Win the toss and win the match.” In 2019, the then South African captain, Faf du Plessis saw the importance of a toss in a game after they were trounced 3-0 by India in a Test series that was played in the Asian nation. In all three matches, South Africa lost the toss. Losing the first two matches, having called wrong in both matches, du Plessis brought in a proxy captain in the third game to try and have a change of fortunes. They brought in the present skipper, Temba Bavuma but no fortunes changed, the Proteas lost the toss, eventually going on to lose the match and the series. However, winning the toss and winning the match is not a hard and fast rule, you can win the toss and go on to lose the match. Many captains, like du Plessis have been unlucky when it comes to the coin toss and back home, we have had our very own unlucky captain. Going out to the middle of the park for the first time in his career as captain of Zimbabwe at List A level, the cricketing toss gods surely turned their backs on one of their own, Wellington Masakadza. In Zimbabwe Select’s ongoing six-match one day series against the visiting Pakistan Shaheens side, Masakadza has had no luck with the coin, tossing it four times and getting it wrong on three occasions. Zimbabwe Select and the visiting Shaheens have played five matches, Masakadza has captained four of those. He lost the toss in three consecutive matches, before finally calling it right in the fourth game of series. The left-arm spinner has not had a great record with the toss, and one would say, he has bad toss luck, becoming Zimbabwe Cricket’s unlucky captain by repeatedly calling it wrong. In a twist of fate, the “win the toss and win the match,” belief however, has no place in Masakadza’s book. Toss decides fate, they said, but not for the “unlucky” 29-year-old Zimbabwean international. Zimbabwe Select won two of the three matches where Masakadza got it wrong. In the first match, the home side won by 24 runs and followed it up with an 81 runs win in the second encounter. The visitors managed to pull one back in the third match, recording a narrow five runs win (D/L method). Having the cricket gods smile at him in the fourth match and finally winning the toss, Masakadza went on to guide Zimbabwe to a thumping seven wickets win over their opponents to go 3-1 up in the series. The unlucky skipper missed Thursday’s fifth match of the series and his replacement, Sean Williams called it right but the team lost the match, leaving the series at 3-2 going into today’s decider. – @brandon_malvin","pubDate":"2023-05-26 22:04:00","image_url":null,"source_id":"chronicle_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"GT vs MI IPL 2023 Qualifier 2 Stats: Gill inches closer to Kohli's all-time record; Rohit's misery in playoffs continues","link":"https://www.firstpost.com/firstcricket/sports-news/gt-vs-mi-ipl-2023-qualifier-2-stats-gill-inches-closer-to-kohlis-all-time-record-rohits-misery-in-playoffs-continues-12653042.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"GT vs MI IPL 2023 Qualifier 2 Stats: Gill inches closer to Kohli's all-time record; Rohit's misery in playoffs continues","content":"Cricket GT vs MI IPL 2023 Qualifier 2 Stats: Gill inches closer to Kohli's all-time record; Rohit's misery in playoffs continues Shubman Gill achieved many a milestone and broke quite a few records with his 60-ball 129 that played a central role in Gujarat Titans' 62-run victory over Mumbai Indians in Qualifier 2 of IPL 2023. FirstCricket Staff May 27th, 2023 3:33:51 IST Gujarat Titans opener Shubman Gill kisses his bat after scoring his third century in four outings during Qualifier 2 of IPL 2023 agains Mumbai Indians in Ahmedabad. AP Shubman Gill smashed his third century in four outings as Gujarat Titans (GT) stormed into the final of the 2023 Indian Premier League (IPL) after trouncing Mumbai Indians (MI) by 62 runs in Qualifier 2 in Ahmedabad on Friday. IPL 2023: Full coverage | Points table | Schedule | Results | Orange Cap | Purple Cap​ Gill tore the MI attack to shreds with a knock of 129 off just 60 deliveries , smashing 10 sixes and seven fours during his stay at the crease at the Narendra Modi Stadium. His dominant knock powered GT, who had won the tournament on debut last season, to a humongous of 233/3 after being invited to bat by MI skipper Rohit Sharma. Related Articles GT vs MI IPL 2023 Qualifier 2: Gujarat Titans a strong team to beat, says Aaron Finch GT vs MI IPL 2023 Qualifier 2: Head-to-head, venue, match timings, weather report, live streaming - All you need to know Read | Shubman Gill rates 129 against MI in Qualifier 2 as his finest IPL knock Mumbai then were under pressure from the very beginning of their chase with skipper Rohit and Impact Player Nehal Wadhera departing for single-digit scores. The trio of Tilak Verma (43), Suryakumar Yadav (61) and Cameron Green (30) briefly revived Mumbai’s chase with attacking partnerships, but none of them could convert their knocks into the kind of big knock that Gill had produced earlier in the day, and take the game deep. Mohit Sharma’s dismissal of Surya proved to be the turning point and the 34-year-old seamer would later run through the remaining MI batters, returning his career-best limited-overs figures of 5/10 as Mumbai were bowled out for 171 in 18.2 overs in reply. Read | Gill hailed by Kohli, ABD after blistering 129 against MI in Qualifier 2 Along the way, there were a number of milestones reached and records broken, which we take a look at in greater detail below: — Shubman Gill became the leading run-scorer this season with his knock of 129, going past RCB skipper Faf du Plessis’ tally of 730 runs. Gill’s current tally stands at 851 runs from 16 appearances. — Gill is also third in list of most runs scored in a single IPL season, sitting behind RCB’s Virat Kohli (973 in 2016) and Jos Buttler (RR in 2022). Gill will need to score 123 or more in the final against CSK if he is to break the all-time record. — That’s not all as far as breaking King Kohli’s records go; Gill also broke the former India and RCB captain’s record for most runs in four consecutive IPL innings. Gill has collected 376 in his last four outings while Kohli had managed 351 in 2016. — Gill’s 129 is the second-highest individual score by an Indian in the IPL. The GT opener fell just three short of the record that currently belongs to KL Rahul (132 for PBKS vs RCB in 2020) — Gujarat Titans currently have a hundred per cent record as far as topping the points table and reaching the IPL final is concerned, having done so on debut last season as well. — MI skipper Rohit Sharma’s miserable run in IPL playoffs continued after getting dismissed for 8 off 7 balls, taking his tally to 316 runs at an average of 15. Rohit Sharma in #IPLPlayoffs Innings – 22 Runs – 316 Average – 15.0 Strike Rate – 107.1 — Cricbaba (@thecricbaba) May 26, 2023 — With his match-winning haul of 5/10, Mohit Sharma became only the second bowler in the history of the IPL to collect a five-for in a playoff fixture. MI’s Akash Madhwal was the first to this feat, achieving it just two days ago with a haul of 5/5 against LSG in the Eliminator. — Mohit also collected his maiden five-for in limited-overs cricket in the process. — Mohammed Shami went past Trent Boult’s record for most powerplay wickets in a single IPL season. Shami dismissed Rohit and Wadhera to take his tally to 17, going past Boult’s 16 for MI in 2020. Read all the Latest News , Trending News , Cricket News , Bollywood News , India News and Entertainment News here. Follow us on Facebook , Twitter and Instagram . Updated Date: May 27, 2023 03:33:51 IST Tags: Cricket Ipl 2023 Ipl 2023 Gt Ipl 2023 Mi Find latest and upcoming tech gadgets online on Tech2 Gadgets. Get technology news, gadgets reviews & ratings. Popular gadgets including laptop, tablet and mobile specifications, features, prices, comparison.","pubDate":"2023-05-26 22:03:51","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/05/Shubman-Gill-century-GT-MI-IPL-2023-Qualifier-2-AP-640.jpg","source_id":"firstpost","category":["sports"],"country":["india"],"language":"english"},{"title":"Make or break tie for Zimbabwe Select","link":"https://www.chronicle.co.zw/make-or-break-tie-for-zimbabwe-select/","keywords":["Sport"],"creator":["Chronicle Editor"],"video_url":null,"description":"Brandon Moyo Brandonmalvin9@gmail.com LOOKING at ending the six-match series on a high note, only one result has to be in the minds of Zimbabwe Select players, victory, when they face off against the visiting Pakistan Shaheens in the decider today at Harare Sports Club. Zimbabwe Select requires nothing but a win to secure the series, […]","content":"The Chronicle LOOKING at ending the six-match series on a high note, only one result has to be in the minds of Zimbabwe Select players, victory, when they face off against the visiting Pakistan Shaheens in the decider today at Harare Sports Club. Zimbabwe Select requires nothing but a win to secure the series, given the good start that they had. The series is standing at 3-2, with both teams desperate for a win, however, the home side will have to show more hunger. A win for the home side will be a good confidence booster, coming from a dismal performance on Thursday. A 3-3 will be as good as a series win for Pakistan Shaheens who would have come from 2-0 down to get a share of the spoils. The full-strength home side will have to bring their A game in today’s match to claim the series which is their last prior to the commencement of the upcoming Men’s Cricket World Cup qualifiers. The Zimbabwean side will also be looking at the returning Sikandar Raza, to help see the team through. Raza returned to the team on Thursday having missed out on other matches due to Indian Premier League (IPL) commitments. However, it was not a good return by the all-rounder as Zimbabwe were thumped by 177 runs and the Select side will be hoping to put their poor performance behind them. One area that the team will have to work on is their batting, which has been inconsistent especially at the top of the order. The opening batters have failed to put up any decent partnership on the board, something which they will have to work on in today’s game. Without a good foundation at the top, it puts pressure on other batters. Despite struggling at the top, the experience of batters such as Craig Ervine and Sean Williams will be crucial to the team’s campaign and will also be looking at Clive Madande to continue with his impressive form with the bat. Madande fought almost a lone battle on Thursday, top-scoring a gallant 41 runs not out. Crucial to claiming the series today will also be the bowlers who have had a good campaign so far despite the struggles in the previous match. Zimbabwean bowlers have been playing a crucial role in the team’s performance, stepping up when needed the most. The captain Wellington Masakadza, Tendai Chatara, Blessing Muzarabani and Bradley Evans have had a good campaign with a ball in hand and will, once again, be key in today’s game. Zimbabwe Cricket (ZC) organised the series as part of their preparations for the World Cup Qualifiers which start on June 18 and will be played in venues across Harare and Bulawayo. Zimbabwe was put in Group A alongside West Indies, Netherlands, Nepal and the United States of America (USA) and their matches will be played in Harare. In Group B, there will be Sri Lanka, Ireland, Scotland, Oman and the United Arab Emirates (UAE) and their group matches will be played in Bulawayo. The series decider is set to start at 09.15hrs. – @brandon_malvin","pubDate":"2023-05-26 22:03:02","image_url":null,"source_id":"chronicle_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"Ndhlovu, Sibanda bat their way to world","link":"https://www.chronicle.co.zw/ndhlovu-sibanda-bat-their-way-to-world/","keywords":["Sport"],"creator":["Chronicle Editor"],"video_url":null,"description":"Fungai Muderere fungai.muderere@bmetro.co.zw “OUR goals can only be reached through a vehicle of a plan, in which we must fervently believe, and upon which we must vigorously act. There is no other route to success.” These words are certainly ringing true into the ears of Lady Chevrons duo of all-rounder Kelis Ndhlovu and bowler Nomvelo […]","content":"The Chronicle “OUR goals can only be reached through a vehicle of a plan, in which we must fervently believe, and upon which we must vigorously act. There is no other route to success.” These words are certainly ringing true into the ears of Lady Chevrons duo of all-rounder Kelis Ndhlovu and bowler Nomvelo Sibanda who have batted their way to the world amid revelations that they have been invited to the third edition of the Fairbreak Invitational set to be played in the United States of America (USA) from September 14 to 30. It will be debut appearances for the duo where they will join Lady Chevrons captain Mary Anne Musonda at the global cricket extravaganza that undertakes to deliver equal opportunities for female cricketers from all corners of the globe. Thus, Fairbreak and USA Cricket are supporting gender equity and the advancement of women’s and girl’s cricket globally. Musona has played in all the two previous editions of the Fairbreak Invitational. Ndhlovu’ abilities cannot be doubted as she emerged the best player in both domestic tournaments played this year. She was voted Player of the Tournament in the Fifty50 Challenge and Women’s T20 Cup. Earlier this year, she captained Zimbabwe in the inaugural ICC Under-19 Women’s World Cup. She made her debut for Zimbabwe as a 16-year-old in 2022 in Namibia. In that debut series, she and Sharne Mayers hit an unbeaten 158 first wicket partnership. The inaugural Fairbreak Invitational T20 took place in partnership with Cricket Hong Kong in Dubai in May 2022. Following on from the success of Fairbreak Invitational, and with the continued support and backing of Cricket Hong Kong, the other contest was held in April this year at Kowloon Cricket Club in Hong Kong. With a follow-up tournament scheduled for September in the USA, Fairbreak Global will now be reportedly conducting two tournaments per year. Six teams comprising some of the biggest names in women’s first-class cricket and outstanding players from associate member nations around the globe, will play each other in both two-week tournaments. All matches will be broadcast internationally. Meanwhile, Musonda has had a brilliant start to Cricket Ireland’s 2023 Women Super Series T20 tournament as she is sitting on top of the batting charts with most runs scored so far. Musonda, who is playing for Scorchers, is the three-team league’s leading run scorer with 153 runs from five matches and as many innings. From the matches played, the Lady Chevrons skipper has a high score of 71 runs not out, the league’s highest individual score so far. She has a strike rate of 96,23. The 31-year-old Zimbabwean star has an average of 51 with the bat. She is one of the six overseas players taking part in the league. In second place with the most runs in the competition, Musonda is followed by Amy Hunter who has scored 126 runs in five matches at an average 31,50 and has a high score of 60 runs which is also the second highest individual score. Hunter also holds the third highest individual score of 46 runs. Musonda’s high score came on Sunday where she helped her team register a 25 runs win over Typhoons. Scorchers finished on 121/3, courtesy of the Zimbabwean’s unbeaten half century. She was supported by Gaby Lewis who fell for 20 runs. In their defence, Musonda took three catches to help her side bowl out their opponents for 96 runs in 19,2 overs. Sophie MacMahon starred with the ball for Scorchers, taking a five-wicket haul as she finished with figures of 5/12 in 3,2 overs. Ellie McGee took three scalps, giving away 17 runs in her four over spell. Typhoons’ Mary Waldron top scored with 16 runs off 20 deliveries. — @FungaiMuderere.","pubDate":"2023-05-26 22:02:50","image_url":null,"source_id":"chronicle_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"Shubman Gill says 129 against Mumbai Indians in Qualifier 2 his 'best innings so far in the IPL'","link":"https://www.firstpost.com/firstcricket/sports-news/shubman-gill-says-129-against-mumbai-indians-in-qualifier-2-his-best-innings-so-far-in-the-ipl-12653032.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"Shubman Gill says 129 against Mumbai Indians in Qualifier 2 his 'best innings so far in the IPL'","content":"Cricket Shubman Gill says 129 against Mumbai Indians in Qualifier 2 his 'best innings so far in the IPL' Shubman Gill powered Gujarat Titans to a match-winning total of 233/3 against Mumbai Indians with a 60-ball 129, his third century in four outings in Qualifier 2 of IPL 2023 on Friday. FirstCricket Staff May 27th, 2023 2:36:17 IST Gujarat Titans opener Shubman Gill celebrates after completing his third century of IPL 2023 during the Qualifier 2 clash against Mumbai Indians. Sportzpics Gujarat Titans opener Shubman Gill rated his blazing 129 off 60 balls against Mumbai Indians on Friday as his best knock in the Indian Premier League (IPL). IPL 2023: Full coverage | Points table | Schedule | Results | Orange Cap | Purple Cap​ Gill tore the Mumbai attack to shreds, smashing 10 sixes and seven fours to power Gujarat to a humongous score of 233/3 after they were asked to bat. MI, in reply, were shot out for 171 with Mohit Sharma collecting his career-best limited-overs figures of 5/10 to power GT to a second consecutive final since making their debut last season. Related Articles IPL 2023 Qualifier 2: Shubman Gill, Mohit Sharma help GT thrash MI by 62 runs, reach 2nd straight final GT vs MI IPL 2023 Qualifier 2: Shubman Gill smashes third century in four outings against hapless Mumbai attack The Punjab batter had not crossed the three-figure mark in 86 IPL matches since making his debut with the Kolkata Knight Riders (KKR) in 2018, but now has three to his name in his last four outings, all of which have resulted in victories for Gujarat. “I think this was probably my best innings so far in the IPL,” Gill said during the post-match presentation. Read | Gill hailed by Kohli, ABD after blistering 129 against MI in Qualifier 2 Gill pointed to the over in which he carted Akash Madhwal, hero of MI’s 81-run victory over Lucknow Super Giants in the Eliminator with a haul of 5/5, for three sixes that instilled belief in him that it was his day. “For me, it is playing ball to ball, over to over. The over where I hit three sixes gave me the momentum to go big. That’s when I realised it could be my day. “It was a good wicket to bat on as well. Not a conscious decision, you keep inventing as a batter but for me the belief is more important. I am coming off a good international season as well. Had a good season last time as well. When I start well, I feel confident I can score well,” Gill added. Hope Gill continues that form: Rohit Mumbai skipper Rohit Sharma heaped praise on the 23-year-old, viewed by many as the next Indian batting superstar and the heir-apparent to Virat Kohli, after the game. According to ‘Hitman’, Gill’s 129 proved to be the difference between the two sides in the penultimate match of the season and ultimately helped Gujarat add another “20-25 extra runs” on the board. He also hoped Gill would continue this form for the Indian team as well with the ODI World Cup set to take place in India later this year. “Shubman batted well, wicket was good. They got 20-25 extra. We were positive after the first-half. We have to credit Shubman. I hope he continues that form,” Rohit said after the game. In Photos: All-round GT trounce MI to setup final against CSK Rohit credited Suryakumar Yadav (61) and Cameron Green (30) for reviving Mumbai’s hopes after a poor start to their chase, but felt they needed someone to take the game deep like Gill did for them to pull off the chase successfully, which they ultimately failed to accomplish. “Greeny and Surya batted well but we lost our way. We wanted to give it a good crack, be positive. We couldn’t get going in the powerplay. We wanted one batter, like Gujarat did, and take the game deep where anything can happen on a good pitch and a ground with a small boundary. But credit to GT, who played well,” added the MI skipper. GT skipper Hardik Pandya, meanwhile, couldn’t be more proud of the way Gill conducted himself at the Narendra Modi Stadium on the big occasion. “I think the clarity and confidence he is carrying is amazing. Today’s innings was one of the finest, he never looked rushed. It felt like someone was throwing balls and he was hitting. He will be a superstar in international and franchise cricket,” Pandya added after the game. Read all the Latest News , Trending News , Cricket News , Bollywood News , India News and Entertainment News here. Follow us on Facebook , Twitter and Instagram . Updated Date: May 27, 2023 02:36:17 IST Tags: Cricket Ipl 2023 Ipl 2023 Gt Ipl 2023 Mi Find latest and upcoming tech gadgets online on Tech2 Gadgets. Get technology news, gadgets reviews & ratings. Popular gadgets including laptop, tablet and mobile specifications, features, prices, comparison.","pubDate":"2023-05-26 21:06:17","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/05/Shubman-Gill-century-GT-MI-IPL-2023-Qualifier-2-Sportzpics-640.jpg","source_id":"firstpost","category":["sports"],"country":["india"],"language":"english"},{"title":"मुंबई इंडियंस की किस्मत रूठी, टिम डेविड ने टपकाया कैच, गिल ने ठोक दिया शतक","link":"https://sports.ndtv.com/hindi/cricket/most-100-in-one-ipl-season-green-dropped-gills-catch-gill-scored-a-century-4069855#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"गिल का आईपीएल 2023 में ये तीसरा शतक है. इस पूरे सीज़न गिल शानदार फॉर्म में नज़र आए. इसी बीच मुंबई इंडियंस पर गिल का ये शतक भारी पड़ सकता है.","content":"मुंबई इंडियंस की किस्मत रूठी, ग्रीन ने टपकाया कैच, गिल ने ठोका शतक मुंबई इंडियंस और गुजरात टाइटंस के बीच अहमदाबाद में खेले जा रहे दूसरे क्वालिफायर मुकाबले में शुभमन गिल ने 49 गेंद में शानदार शतक जड़ा है. गिल का आईपीएल 2023 में ये तीसरा शतक है. इस पूरे सीज़न गिल शानदार फॉर्म में नज़र आए. इसी बीच मुंबई इंडियंस पर गिल का ये शतक भारी पड़ सकता है. क्योंकि गिल को ये शतक लगाने ये मुंबई रोक भी सकती थी.क्योंकि गिल जब 31 रन के स्कोर पर बल्लेबाज़ी कर रहे थे तभी क्रिस जॉर्डन की गेंद पर टिम डेविड ने गिल का कैच छोड़ दिया, और इसका खामियाज़ा अब मुंबई इंडियंस को भुगतना पड़ सकता है. क्योंकि गुजरात के ओपनर गिल का ये शतक मुंबई इंडियंस को आईपीएल से बाहर भी कर सकता है. इस शतक के साथ ही वे आईपीएल के एक सीज़न में सबसे ज्यादा शतक लगाने के मामले में विराट कोहली ओर जॉस बटलर के बाद तीसरे बल्लेबाज़ बने हैं. 𝗛𝗨𝗡𝗗𝗥𝗘𝗗 𝗡𝗨𝗠𝗕𝗘𝗥 𝗧𝗛𝗥𝗘𝗘 𝗙𝗢𝗥 𝗦𝗛𝗨𝗕𝗠𝗔𝗡 𝗚𝗜𝗟𝗟 🔥🔥 All of them in ONE season and he continues to impress everyone with his batting composure 👏🏻👏🏻 | | | मैच की अगर बात करें तो मुंबई के कप्तान रोहित शर्मा ने टॉस जीतकर पहले गेंदबाज़ी करने का फैसला किया. मुकाबला शुरू होने से पहले अहमदाबाद में तेज़ बारिश हुई थी. फैंस के लिए खुशखबरी ये है कि बारिश अब रुक गई है. लेकिन अगर बारिश फिर से होती है और किसी भी कंडीशन में मुकाबला रद्द होता है तो इस स्थिति में गुजरात की टीम प्वाइंट्स टेबल में टॉप पर रहने के चलते फाइनल में एंटर करेगी. बता दें कि गुजरात ने लीग स्टेज में 14 में से 10 मुकाबले जीतकर 20 अंको के साथ टेबल टॉप किया था. इसके अलावा अगर मुकबला खेला जाता है तो जीतने वाली टीम सीधे फाइनल में जाएगी और हारने वाली टीम टूर्नामेंट से बाहर हो जाएगी. बता दें कि मुंबई इंडियंस के पास 5 आईपीएल ट्रॉफी जीतने का अनुभव है वहीं गुजरात पिछले आईपीएल सीज़न की विजेता है. ऐसे में दोनों टीमों के बीच कड़ी टक्कर होने की उम्मीद है. रोहित शर्मा की अगुवाई वाली मुंबई इंडियंस फाइनल में जगह बनाना भली भांति जानती है वहीं गुजरात के कोच आशीष नेहरा भी टीम को ट्रॉफी कैसे जीतानी है, इसमें काफी एक्सपर्ट हैं. * * पढ़ें ,राजनीति,खेल समाचार, और की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-05-26 19:02:05","image_url":"https://c.ndtvimg.com/2023-05/733jrdf_shubman-gill_625x300_26_May_23.jpg","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Gujarat Titans beats Mumbai Indians to reach second consecutive final, faces CSK on Sunday","link":"https://sportstar.thehindu.com/cricket/ipl/ipl-news/gujarat-titans-beats-mumbai-indians-gt-vs-csk-ipl-2023-final-ahmedabad/article66898573.ece","keywords":null,"creator":null,"video_url":null,"description":"Gujarat Titans beat Mumbai Indians by 62 runs at the Narendra Modi Stadium in Ahmedabad to reach the IPL 2023 final on Friday.","content":"That Shubman Gill was capable of reaching stratospheric levels of batsmanship was seldom in doubt. On Friday, a packed Narendra Modi Stadium experienced it firsthand as he led Gujarat Titans (GT) to its second straight Indian Premier League final, against Chennai Super Kings, with a 62-run victory over Mumbai Indians (MI). Gill’s century (129, 60b, 7x4, 10x6), his third in four innings, was T20 batting at its purest. This was especially true of the latter half of the knock. The 23-year-old took 32 balls to get to his half-century. Off the next 28, he smashed 79 to help his side reach 233 for three. MI’s reply was off to a wretched start. Ishan Kishan didn’t come out to bat because of a concussion; Cameron Green retired hurt early on after being hit on the elbow; and Rohit Sharma was out cheaply, with Josh Little completing a fine catch at short fine-leg. GT vs MI HIGHLIGHTS Tilak Varma injected some much-needed belief with a manic 43 (14, 5x4, 3x6), which included two elegant clipped sixes and a gorgeous cover drive. Suryakumar Yadav fought too (61, 38b, 7x4, 2x6), bringing up his half-century with a characteristic scooped six off Little. But Mohit Sharma scalped the all-important wicket in the 15th over, rattling Suryakumar’s leg stump with nearly 80 runs needed. Two balls later, Mohit (5 for 10) excised Vishnu Vinod before Rashid Khan trapped Tim David in front to bring a swift end to MI’s resistance. Earlier, asked to bat first after a heavy downpour had delayed the start by 30 minutes, GT plodded along in the PowerPlay, collecting 50 runs. Chris Jordan could have had Gill for 30 in the sixth over, but a diving David dropped the chance, and MI was in for a hiding. Akash Madhwal and Piyush Chawla have been among MI’s best bowlers. But neither their form nor their pedigree mattered to Gill. In the 12th over, Madhwal was smashed for three sixes on the leg-side before Chawla was deposited over long-off, paddle hit to the boundary, and clobbered for a massive 106-metre six over deep mid-wicket. The two bled 97 runs in seven overs. Gill hit 10 maximums in all, and the 10th was worthy of a place in the Louvre. He walked down the pitch to Green and nonchalantly slapped a rising delivery over the deep mid-wicket fence. Gill finally fell, holing out to David at deep mid-wicket off Madhwal. But skipper Hardik Pandya’s unbeaten 28 (13b, 2x4, 2x6) ensured a gigantic total that MI couldn’t even sniff. Read more stories on IPL News.","pubDate":"2023-05-26 18:28:03","image_url":null,"source_id":"sportstar","category":["sports"],"country":["india"],"language":"english"},{"title":"ICC reveals prize money for World Test C’ship winner","link":"https://thefrontierpost.com/icc-reveals-prize-money-for-world-test-cship-winner/","keywords":["Sports"],"creator":["The Frontier Post"],"video_url":null,"description":"F.P. Report DUBAI: International Cricket Council (ICC) on Friday announced the prize money for the World Test Championship 2021-23 cycle with a total fund of $3.8 million to be shared between the nine teams. The winner of the World Test Championship (WTC) final between India and Australia will get a whopping amount of $1.6 million […]","content":"F.P. Report DUBAI: International Cricket Council (ICC) on Friday announced the prize money for the World Test Championship 2021-23 cycle with a total fund of $3.8 million to be shared between the nine teams. The winner of the World Test Championship (WTC) final between India and Australia will get a whopping amount of $1.6 million while the losing team will still earn $800,000. The Grand Finale at The Oval in London from 7 June will not only decide the Test champions for the next two years but also the fate of a major chunk of around 63 per cent of the total prize pool of the outgoing WTC cycle. The remaining seven teams will share $1.4 million in a manner that South Africa earns $450,000 for finishing third in the WTC standings, England bags $350,000 for finishing fourth, Sri Lanka gets $200,000 for finishing fifth. The bottom four teams, including Pakistan, pocket $100,000 each. It is pertinent to mention here that Pakistan finished seventh on the standings of the outgoing World Test Championship Cycle with a below-par percentage of 38.1. Babar Azam-led side won only four Tests, lost six and drew four out of their total 14 fixtures in the cycle. Interestingly, the prize money has not been changed from the last inaugural edition of the championship (2019-21) with a total purse of $3.8 million.","pubDate":"2023-05-26 16:39:57","image_url":null,"source_id":"thefrontierpost","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"Six former Yorkshire players sanctioned","link":"https://thefrontierpost.com/six-former-yorkshire-players-sanctioned/","keywords":["Sports"],"creator":["The Frontier Post"],"video_url":null,"description":"LONDON (Agencies): Six former Yorkshire County Cricket Club players and coaches on Friday, have been sanctioned by the Cricket Discipline Commission (CDC) panel for a suspected use of racist language. According to the ECB, the CDC has today published its decisions in relation to charges brought by the ECB against Yorkshire CCC and a number […]","content":"LONDON (Agencies): Six former Yorkshire County Cricket Club players and coaches on Friday, have been sanctioned by the Cricket Discipline Commission (CDC) panel for a suspected use of racist language. According to the ECB, the CDC has today published its decisions in relation to charges brought by the ECB against Yorkshire CCC and a number raof individuals. As per the latest development, former Yorkshire players Tim Bresnan, John Blain, Matthew Hoggard, Andrew Gale and Richard Pyrah were sanctioned for racism. Ballance, Bresnan, Gale, and Pyrah were fined as well as suspended from coaching and playing cricket for varied lengths of time, whereas Blain and Hoggard were only fined. Furthermore, all six players have been advised to attend a racism or discrimination education course at their own expense. The sanctioned individuals are able to appeal the decisions before the end of business on Friday 9 June 2023. The CDC has also confirmed that the sanction hearing for Yorkshire County Cricket Club, which has admitted four breaches of ECB Directive 3.3, will be held on Tuesday 27 June 2023. These CDC sanction decisions have been made by an independent panel consisting of Tim O’Gorman (Chair of the CDC), Mark Milliken-Smith KC and Dr Seema Patel. Earlier, former England captain and renowned commentator Michael Vaughan was cleared of racism charges by the CDC. In light of the CDC decisions, Michael Vaughan was not found liable for a breach of ECB Directive 3.3, which states: “No such person may conduct themself in a manner or do any act or omission which may be prejudicial to the interests of cricket or which may bring the game of cricket or any Cricketer or group of Cricketers into disrepute”.","pubDate":"2023-05-26 16:38:41","image_url":null,"source_id":"thefrontierpost","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"Peshawar Zalmi Talent Hunt 2023 ends successfully in Hayatabad Sports complex","link":"https://thefrontierpost.com/peshawar-zalmi-talent-hunt-2023-ends-successfully-in-hayatabad-sports-complex/","keywords":["Sports"],"creator":["The Frontier Post"],"video_url":null,"description":"F.P. Report PESHAWAR: The first and important stage of the Zalmi talent hunt 2023 organized by the Pakistan Super League franchise Peshawar Zalmi has ended, more than ten thousand young cricketers have registered in the four-day trials at the Hayatabad Sports Complex Peshawar. Peshawar Zalmi President Inzamam ul Haq, Director Cricket Mohammad Akram, Zalmi star […]","content":"F.P. Report PESHAWAR: The first and important stage of the Zalmi talent hunt 2023 organized by the Pakistan Super League franchise Peshawar Zalmi has ended, more than ten thousand young cricketers have registered in the four-day trials at the Hayatabad Sports Complex Peshawar. Peshawar Zalmi President Inzamam ul Haq, Director Cricket Mohammad Akram, Zalmi star Kamran Akmal were among the selection panel that tested the talent of the young cricketers participating in the open trials and selected the best players. Pakistan and Peshawar Zalmi captain Babar Azam also reached Peshawar on the third day of the trials and encouraged the young cricketers. Zalmi and Pakistan Rising Star Mohammad Haris were also present at the trials and encouraged the young cricketers. The young cricketers were given an opportunity to show their skills by organizing matches between Inzamam u l Haq XI, Babar Azam XI, Kamran Akmal XI and Darren Sammy XI. After the end of these matches, the fiften best young cricketers have been finalized. Peshawar Zalmi Director of Cricket Muhammad Akram said that Peshawar Zalmi will provide all possible facilities to the fiften young cricketers. Young cricketers will get training and coaching at the National Cricket Academy and the most talented young cricketers can also be given an opportunity in the emerging category of PSL 9.","pubDate":"2023-05-26 16:37:12","image_url":null,"source_id":"thefrontierpost","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"What’s in a toss?… Wellington Masakadza: Zimbabwe’s Cricket’s unlucky captain","link":"https://www.chronicle.co.zw/whats-in-a-toss-wellington-masakadza-zimbabwes-crickets-unlucky-captain/","keywords":["Sport"],"creator":["Chronicle Editor"],"video_url":null,"description":"Brandon Moyo Brandonmalvin9@gmail.com IN many sports, the toss is just a tradition that has to be done prior to the start of a match but has not much effect on the game. For example, in football or rugby, the toss has little or no effect in determining the match’s outcome but still has to be […]","content":"The Chronicle IN many sports, the toss is just a tradition that has to be done prior to the start of a match but has not much effect on the game. For example, in football or rugby, the toss has little or no effect in determining the match’s outcome but still has to be done regardless. However, in some sports, the toss plays a crucial role in determining how the match goes. Some may take it lightly, but it is equally important as the amount of work that is put into the field of play. The toss is one of the most important factors in a cricket match, it plays a huge role in determining the final outcome of a game. There is an old phrase that goes; “Win the toss and win the match.” In 2019, the then South African captain, Faf du Plessis saw the importance of a toss in a game after they were trounced 3-0 by India in a Test series that was played in the Asian nation. In all three matches, South Africa lost the toss. Losing the first two matches, having called wrong in both matches, du Plessis brought in a proxy captain in the third game to try and have a change of fortunes. They brought in the present skipper, Temba Bavuma but no fortunes changed, the Proteas lost the toss, eventually going on to lose the match and the series. However, winning the toss and winning the match is not a hard and fast rule, you can win the toss and go on to lose the match. Many captains, like du Plessis have been unlucky when it comes to the coin toss and back home, we have had our very own unlucky captain. Going out to the middle of the park for the first time in his career as captain of Zimbabwe at List A level, the cricketing toss gods surely turned their backs on one of their own, Wellington Masakadza. In Zimbabwe Select’s ongoing six-match one day series against the visiting Pakistan Shaheens side, Masakadza has had no luck with the coin, tossing it four times and getting it wrong on three occasions. Zimbabwe Select and the visiting Shaheens have played five matches, Masakadza has captained four of those. He lost the toss in three consecutive matches, before finally calling it right in the fourth game of series. The left-arm spinner has not had a great record with the toss, and one would say, he has bad toss luck, becoming Zimbabwe Cricket’s unlucky captain by repeatedly calling it wrong. In a twist of fate, the “win the toss and win the match,” belief however, has no place in Masakadza’s book. Toss decides fate, they said, but not for the “unlucky” 29-year-old Zimbabwean international. Zimbabwe Select won two of the three matches where Masakadza got it wrong. In the first match, the home side won by 24 runs and followed it up with an 81 runs win in the second encounter. The visitors managed to pull one back in the third match, recording a narrow five runs win (D/L method). Having the cricket gods smile at him in the fourth match and finally winning the toss, Masakadza went on to guide Zimbabwe to a thumping seven wickets win over their opponents to go 3-1 up in the series. The unlucky skipper missed Thursday’s fifth match of the series and his replacement, Sean Williams called it right but the team lost the match, leaving the series at 3-2 going into today’s decider. – @brandon_malvin","pubDate":"2023-05-26 22:04:00","image_url":null,"source_id":"chronicle_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"GT vs MI IPL 2023 Qualifier 2 Stats: Gill inches closer to Kohli's all-time record; Rohit's misery in playoffs continues","link":"https://www.firstpost.com/firstcricket/sports-news/gt-vs-mi-ipl-2023-qualifier-2-stats-gill-inches-closer-to-kohlis-all-time-record-rohits-misery-in-playoffs-continues-12653042.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"GT vs MI IPL 2023 Qualifier 2 Stats: Gill inches closer to Kohli's all-time record; Rohit's misery in playoffs continues","content":"Cricket GT vs MI IPL 2023 Qualifier 2 Stats: Gill inches closer to Kohli's all-time record; Rohit's misery in playoffs continues Shubman Gill achieved many a milestone and broke quite a few records with his 60-ball 129 that played a central role in Gujarat Titans' 62-run victory over Mumbai Indians in Qualifier 2 of IPL 2023. FirstCricket Staff May 27th, 2023 3:33:51 IST Gujarat Titans opener Shubman Gill kisses his bat after scoring his third century in four outings during Qualifier 2 of IPL 2023 agains Mumbai Indians in Ahmedabad. AP Shubman Gill smashed his third century in four outings as Gujarat Titans (GT) stormed into the final of the 2023 Indian Premier League (IPL) after trouncing Mumbai Indians (MI) by 62 runs in Qualifier 2 in Ahmedabad on Friday. IPL 2023: Full coverage | Points table | Schedule | Results | Orange Cap | Purple Cap​ Gill tore the MI attack to shreds with a knock of 129 off just 60 deliveries , smashing 10 sixes and seven fours during his stay at the crease at the Narendra Modi Stadium. His dominant knock powered GT, who had won the tournament on debut last season, to a humongous of 233/3 after being invited to bat by MI skipper Rohit Sharma. Related Articles GT vs MI IPL 2023 Qualifier 2: Gujarat Titans a strong team to beat, says Aaron Finch GT vs MI IPL 2023 Qualifier 2: Head-to-head, venue, match timings, weather report, live streaming - All you need to know Read | Shubman Gill rates 129 against MI in Qualifier 2 as his finest IPL knock Mumbai then were under pressure from the very beginning of their chase with skipper Rohit and Impact Player Nehal Wadhera departing for single-digit scores. The trio of Tilak Verma (43), Suryakumar Yadav (61) and Cameron Green (30) briefly revived Mumbai’s chase with attacking partnerships, but none of them could convert their knocks into the kind of big knock that Gill had produced earlier in the day, and take the game deep. Mohit Sharma’s dismissal of Surya proved to be the turning point and the 34-year-old seamer would later run through the remaining MI batters, returning his career-best limited-overs figures of 5/10 as Mumbai were bowled out for 171 in 18.2 overs in reply. Read | Gill hailed by Kohli, ABD after blistering 129 against MI in Qualifier 2 Along the way, there were a number of milestones reached and records broken, which we take a look at in greater detail below: — Shubman Gill became the leading run-scorer this season with his knock of 129, going past RCB skipper Faf du Plessis’ tally of 730 runs. Gill’s current tally stands at 851 runs from 16 appearances. — Gill is also third in list of most runs scored in a single IPL season, sitting behind RCB’s Virat Kohli (973 in 2016) and Jos Buttler (RR in 2022). Gill will need to score 123 or more in the final against CSK if he is to break the all-time record. — That’s not all as far as breaking King Kohli’s records go; Gill also broke the former India and RCB captain’s record for most runs in four consecutive IPL innings. Gill has collected 376 in his last four outings while Kohli had managed 351 in 2016. — Gill’s 129 is the second-highest individual score by an Indian in the IPL. The GT opener fell just three short of the record that currently belongs to KL Rahul (132 for PBKS vs RCB in 2020) — Gujarat Titans currently have a hundred per cent record as far as topping the points table and reaching the IPL final is concerned, having done so on debut last season as well. — MI skipper Rohit Sharma’s miserable run in IPL playoffs continued after getting dismissed for 8 off 7 balls, taking his tally to 316 runs at an average of 15. Rohit Sharma in #IPLPlayoffs Innings – 22 Runs – 316 Average – 15.0 Strike Rate – 107.1 — Cricbaba (@thecricbaba) May 26, 2023 — With his match-winning haul of 5/10, Mohit Sharma became only the second bowler in the history of the IPL to collect a five-for in a playoff fixture. MI’s Akash Madhwal was the first to this feat, achieving it just two days ago with a haul of 5/5 against LSG in the Eliminator. — Mohit also collected his maiden five-for in limited-overs cricket in the process. — Mohammed Shami went past Trent Boult’s record for most powerplay wickets in a single IPL season. Shami dismissed Rohit and Wadhera to take his tally to 17, going past Boult’s 16 for MI in 2020. Read all the Latest News , Trending News , Cricket News , Bollywood News , India News and Entertainment News here. Follow us on Facebook , Twitter and Instagram . Updated Date: May 27, 2023 03:33:51 IST Tags: Cricket Ipl 2023 Ipl 2023 Gt Ipl 2023 Mi Find latest and upcoming tech gadgets online on Tech2 Gadgets. Get technology news, gadgets reviews & ratings. Popular gadgets including laptop, tablet and mobile specifications, features, prices, comparison.","pubDate":"2023-05-26 22:03:51","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/05/Shubman-Gill-century-GT-MI-IPL-2023-Qualifier-2-AP-640.jpg","source_id":"firstpost","category":["sports"],"country":["india"],"language":"english"},{"title":"Make or break tie for Zimbabwe Select","link":"https://www.chronicle.co.zw/make-or-break-tie-for-zimbabwe-select/","keywords":["Sport"],"creator":["Chronicle Editor"],"video_url":null,"description":"Brandon Moyo Brandonmalvin9@gmail.com LOOKING at ending the six-match series on a high note, only one result has to be in the minds of Zimbabwe Select players, victory, when they face off against the visiting Pakistan Shaheens in the decider today at Harare Sports Club. Zimbabwe Select requires nothing but a win to secure the series, […]","content":"The Chronicle LOOKING at ending the six-match series on a high note, only one result has to be in the minds of Zimbabwe Select players, victory, when they face off against the visiting Pakistan Shaheens in the decider today at Harare Sports Club. Zimbabwe Select requires nothing but a win to secure the series, given the good start that they had. The series is standing at 3-2, with both teams desperate for a win, however, the home side will have to show more hunger. A win for the home side will be a good confidence booster, coming from a dismal performance on Thursday. A 3-3 will be as good as a series win for Pakistan Shaheens who would have come from 2-0 down to get a share of the spoils. The full-strength home side will have to bring their A game in today’s match to claim the series which is their last prior to the commencement of the upcoming Men’s Cricket World Cup qualifiers. The Zimbabwean side will also be looking at the returning Sikandar Raza, to help see the team through. Raza returned to the team on Thursday having missed out on other matches due to Indian Premier League (IPL) commitments. However, it was not a good return by the all-rounder as Zimbabwe were thumped by 177 runs and the Select side will be hoping to put their poor performance behind them. One area that the team will have to work on is their batting, which has been inconsistent especially at the top of the order. The opening batters have failed to put up any decent partnership on the board, something which they will have to work on in today’s game. Without a good foundation at the top, it puts pressure on other batters. Despite struggling at the top, the experience of batters such as Craig Ervine and Sean Williams will be crucial to the team’s campaign and will also be looking at Clive Madande to continue with his impressive form with the bat. Madande fought almost a lone battle on Thursday, top-scoring a gallant 41 runs not out. Crucial to claiming the series today will also be the bowlers who have had a good campaign so far despite the struggles in the previous match. Zimbabwean bowlers have been playing a crucial role in the team’s performance, stepping up when needed the most. The captain Wellington Masakadza, Tendai Chatara, Blessing Muzarabani and Bradley Evans have had a good campaign with a ball in hand and will, once again, be key in today’s game. Zimbabwe Cricket (ZC) organised the series as part of their preparations for the World Cup Qualifiers which start on June 18 and will be played in venues across Harare and Bulawayo. Zimbabwe was put in Group A alongside West Indies, Netherlands, Nepal and the United States of America (USA) and their matches will be played in Harare. In Group B, there will be Sri Lanka, Ireland, Scotland, Oman and the United Arab Emirates (UAE) and their group matches will be played in Bulawayo. The series decider is set to start at 09.15hrs. – @brandon_malvin","pubDate":"2023-05-26 22:03:02","image_url":null,"source_id":"chronicle_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"Ndhlovu, Sibanda bat their way to world","link":"https://www.chronicle.co.zw/ndhlovu-sibanda-bat-their-way-to-world/","keywords":["Sport"],"creator":["Chronicle Editor"],"video_url":null,"description":"Fungai Muderere fungai.muderere@bmetro.co.zw “OUR goals can only be reached through a vehicle of a plan, in which we must fervently believe, and upon which we must vigorously act. There is no other route to success.” These words are certainly ringing true into the ears of Lady Chevrons duo of all-rounder Kelis Ndhlovu and bowler Nomvelo […]","content":"The Chronicle “OUR goals can only be reached through a vehicle of a plan, in which we must fervently believe, and upon which we must vigorously act. There is no other route to success.” These words are certainly ringing true into the ears of Lady Chevrons duo of all-rounder Kelis Ndhlovu and bowler Nomvelo Sibanda who have batted their way to the world amid revelations that they have been invited to the third edition of the Fairbreak Invitational set to be played in the United States of America (USA) from September 14 to 30. It will be debut appearances for the duo where they will join Lady Chevrons captain Mary Anne Musonda at the global cricket extravaganza that undertakes to deliver equal opportunities for female cricketers from all corners of the globe. Thus, Fairbreak and USA Cricket are supporting gender equity and the advancement of women’s and girl’s cricket globally. Musona has played in all the two previous editions of the Fairbreak Invitational. Ndhlovu’ abilities cannot be doubted as she emerged the best player in both domestic tournaments played this year. She was voted Player of the Tournament in the Fifty50 Challenge and Women’s T20 Cup. Earlier this year, she captained Zimbabwe in the inaugural ICC Under-19 Women’s World Cup. She made her debut for Zimbabwe as a 16-year-old in 2022 in Namibia. In that debut series, she and Sharne Mayers hit an unbeaten 158 first wicket partnership. The inaugural Fairbreak Invitational T20 took place in partnership with Cricket Hong Kong in Dubai in May 2022. Following on from the success of Fairbreak Invitational, and with the continued support and backing of Cricket Hong Kong, the other contest was held in April this year at Kowloon Cricket Club in Hong Kong. With a follow-up tournament scheduled for September in the USA, Fairbreak Global will now be reportedly conducting two tournaments per year. Six teams comprising some of the biggest names in women’s first-class cricket and outstanding players from associate member nations around the globe, will play each other in both two-week tournaments. All matches will be broadcast internationally. Meanwhile, Musonda has had a brilliant start to Cricket Ireland’s 2023 Women Super Series T20 tournament as she is sitting on top of the batting charts with most runs scored so far. Musonda, who is playing for Scorchers, is the three-team league’s leading run scorer with 153 runs from five matches and as many innings. From the matches played, the Lady Chevrons skipper has a high score of 71 runs not out, the league’s highest individual score so far. She has a strike rate of 96,23. The 31-year-old Zimbabwean star has an average of 51 with the bat. She is one of the six overseas players taking part in the league. In second place with the most runs in the competition, Musonda is followed by Amy Hunter who has scored 126 runs in five matches at an average 31,50 and has a high score of 60 runs which is also the second highest individual score. Hunter also holds the third highest individual score of 46 runs. Musonda’s high score came on Sunday where she helped her team register a 25 runs win over Typhoons. Scorchers finished on 121/3, courtesy of the Zimbabwean’s unbeaten half century. She was supported by Gaby Lewis who fell for 20 runs. In their defence, Musonda took three catches to help her side bowl out their opponents for 96 runs in 19,2 overs. Sophie MacMahon starred with the ball for Scorchers, taking a five-wicket haul as she finished with figures of 5/12 in 3,2 overs. Ellie McGee took three scalps, giving away 17 runs in her four over spell. Typhoons’ Mary Waldron top scored with 16 runs off 20 deliveries. — @FungaiMuderere.","pubDate":"2023-05-26 22:02:50","image_url":null,"source_id":"chronicle_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"Shubman Gill says 129 against Mumbai Indians in Qualifier 2 his 'best innings so far in the IPL'","link":"https://www.firstpost.com/firstcricket/sports-news/shubman-gill-says-129-against-mumbai-indians-in-qualifier-2-his-best-innings-so-far-in-the-ipl-12653032.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"Shubman Gill says 129 against Mumbai Indians in Qualifier 2 his 'best innings so far in the IPL'","content":"Cricket Shubman Gill says 129 against Mumbai Indians in Qualifier 2 his 'best innings so far in the IPL' Shubman Gill powered Gujarat Titans to a match-winning total of 233/3 against Mumbai Indians with a 60-ball 129, his third century in four outings in Qualifier 2 of IPL 2023 on Friday. FirstCricket Staff May 27th, 2023 2:36:17 IST Gujarat Titans opener Shubman Gill celebrates after completing his third century of IPL 2023 during the Qualifier 2 clash against Mumbai Indians. Sportzpics Gujarat Titans opener Shubman Gill rated his blazing 129 off 60 balls against Mumbai Indians on Friday as his best knock in the Indian Premier League (IPL). IPL 2023: Full coverage | Points table | Schedule | Results | Orange Cap | Purple Cap​ Gill tore the Mumbai attack to shreds, smashing 10 sixes and seven fours to power Gujarat to a humongous score of 233/3 after they were asked to bat. MI, in reply, were shot out for 171 with Mohit Sharma collecting his career-best limited-overs figures of 5/10 to power GT to a second consecutive final since making their debut last season. Related Articles IPL 2023 Qualifier 2: Shubman Gill, Mohit Sharma help GT thrash MI by 62 runs, reach 2nd straight final GT vs MI IPL 2023 Qualifier 2: Shubman Gill smashes third century in four outings against hapless Mumbai attack The Punjab batter had not crossed the three-figure mark in 86 IPL matches since making his debut with the Kolkata Knight Riders (KKR) in 2018, but now has three to his name in his last four outings, all of which have resulted in victories for Gujarat. “I think this was probably my best innings so far in the IPL,” Gill said during the post-match presentation. Read | Gill hailed by Kohli, ABD after blistering 129 against MI in Qualifier 2 Gill pointed to the over in which he carted Akash Madhwal, hero of MI’s 81-run victory over Lucknow Super Giants in the Eliminator with a haul of 5/5, for three sixes that instilled belief in him that it was his day. “For me, it is playing ball to ball, over to over. The over where I hit three sixes gave me the momentum to go big. That’s when I realised it could be my day. “It was a good wicket to bat on as well. Not a conscious decision, you keep inventing as a batter but for me the belief is more important. I am coming off a good international season as well. Had a good season last time as well. When I start well, I feel confident I can score well,” Gill added. Hope Gill continues that form: Rohit Mumbai skipper Rohit Sharma heaped praise on the 23-year-old, viewed by many as the next Indian batting superstar and the heir-apparent to Virat Kohli, after the game. According to ‘Hitman’, Gill’s 129 proved to be the difference between the two sides in the penultimate match of the season and ultimately helped Gujarat add another “20-25 extra runs” on the board. He also hoped Gill would continue this form for the Indian team as well with the ODI World Cup set to take place in India later this year. “Shubman batted well, wicket was good. They got 20-25 extra. We were positive after the first-half. We have to credit Shubman. I hope he continues that form,” Rohit said after the game. In Photos: All-round GT trounce MI to setup final against CSK Rohit credited Suryakumar Yadav (61) and Cameron Green (30) for reviving Mumbai’s hopes after a poor start to their chase, but felt they needed someone to take the game deep like Gill did for them to pull off the chase successfully, which they ultimately failed to accomplish. “Greeny and Surya batted well but we lost our way. We wanted to give it a good crack, be positive. We couldn’t get going in the powerplay. We wanted one batter, like Gujarat did, and take the game deep where anything can happen on a good pitch and a ground with a small boundary. But credit to GT, who played well,” added the MI skipper. GT skipper Hardik Pandya, meanwhile, couldn’t be more proud of the way Gill conducted himself at the Narendra Modi Stadium on the big occasion. “I think the clarity and confidence he is carrying is amazing. Today’s innings was one of the finest, he never looked rushed. It felt like someone was throwing balls and he was hitting. He will be a superstar in international and franchise cricket,” Pandya added after the game. Read all the Latest News , Trending News , Cricket News , Bollywood News , India News and Entertainment News here. Follow us on Facebook , Twitter and Instagram . Updated Date: May 27, 2023 02:36:17 IST Tags: Cricket Ipl 2023 Ipl 2023 Gt Ipl 2023 Mi Find latest and upcoming tech gadgets online on Tech2 Gadgets. Get technology news, gadgets reviews & ratings. Popular gadgets including laptop, tablet and mobile specifications, features, prices, comparison.","pubDate":"2023-05-26 21:06:17","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/05/Shubman-Gill-century-GT-MI-IPL-2023-Qualifier-2-Sportzpics-640.jpg","source_id":"firstpost","category":["sports"],"country":["india"],"language":"english"},{"title":"मुंबई इंडियंस की किस्मत रूठी, टिम डेविड ने टपकाया कैच, गिल ने ठोक दिया शतक","link":"https://sports.ndtv.com/hindi/cricket/most-100-in-one-ipl-season-green-dropped-gills-catch-gill-scored-a-century-4069855#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"गिल का आईपीएल 2023 में ये तीसरा शतक है. इस पूरे सीज़न गिल शानदार फॉर्म में नज़र आए. इसी बीच मुंबई इंडियंस पर गिल का ये शतक भारी पड़ सकता है.","content":"मुंबई इंडियंस की किस्मत रूठी, ग्रीन ने टपकाया कैच, गिल ने ठोका शतक मुंबई इंडियंस और गुजरात टाइटंस के बीच अहमदाबाद में खेले जा रहे दूसरे क्वालिफायर मुकाबले में शुभमन गिल ने 49 गेंद में शानदार शतक जड़ा है. गिल का आईपीएल 2023 में ये तीसरा शतक है. इस पूरे सीज़न गिल शानदार फॉर्म में नज़र आए. इसी बीच मुंबई इंडियंस पर गिल का ये शतक भारी पड़ सकता है. क्योंकि गिल को ये शतक लगाने ये मुंबई रोक भी सकती थी.क्योंकि गिल जब 31 रन के स्कोर पर बल्लेबाज़ी कर रहे थे तभी क्रिस जॉर्डन की गेंद पर टिम डेविड ने गिल का कैच छोड़ दिया, और इसका खामियाज़ा अब मुंबई इंडियंस को भुगतना पड़ सकता है. क्योंकि गुजरात के ओपनर गिल का ये शतक मुंबई इंडियंस को आईपीएल से बाहर भी कर सकता है. इस शतक के साथ ही वे आईपीएल के एक सीज़न में सबसे ज्यादा शतक लगाने के मामले में विराट कोहली ओर जॉस बटलर के बाद तीसरे बल्लेबाज़ बने हैं. 𝗛𝗨𝗡𝗗𝗥𝗘𝗗 𝗡𝗨𝗠𝗕𝗘𝗥 𝗧𝗛𝗥𝗘𝗘 𝗙𝗢𝗥 𝗦𝗛𝗨𝗕𝗠𝗔𝗡 𝗚𝗜𝗟𝗟 🔥🔥 All of them in ONE season and he continues to impress everyone with his batting composure 👏🏻👏🏻 | | | मैच की अगर बात करें तो मुंबई के कप्तान रोहित शर्मा ने टॉस जीतकर पहले गेंदबाज़ी करने का फैसला किया. मुकाबला शुरू होने से पहले अहमदाबाद में तेज़ बारिश हुई थी. फैंस के लिए खुशखबरी ये है कि बारिश अब रुक गई है. लेकिन अगर बारिश फिर से होती है और किसी भी कंडीशन में मुकाबला रद्द होता है तो इस स्थिति में गुजरात की टीम प्वाइंट्स टेबल में टॉप पर रहने के चलते फाइनल में एंटर करेगी. बता दें कि गुजरात ने लीग स्टेज में 14 में से 10 मुकाबले जीतकर 20 अंको के साथ टेबल टॉप किया था. इसके अलावा अगर मुकबला खेला जाता है तो जीतने वाली टीम सीधे फाइनल में जाएगी और हारने वाली टीम टूर्नामेंट से बाहर हो जाएगी. बता दें कि मुंबई इंडियंस के पास 5 आईपीएल ट्रॉफी जीतने का अनुभव है वहीं गुजरात पिछले आईपीएल सीज़न की विजेता है. ऐसे में दोनों टीमों के बीच कड़ी टक्कर होने की उम्मीद है. रोहित शर्मा की अगुवाई वाली मुंबई इंडियंस फाइनल में जगह बनाना भली भांति जानती है वहीं गुजरात के कोच आशीष नेहरा भी टीम को ट्रॉफी कैसे जीतानी है, इसमें काफी एक्सपर्ट हैं. * * पढ़ें ,राजनीति,खेल समाचार, और की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-05-26 19:02:05","image_url":"https://c.ndtvimg.com/2023-05/733jrdf_shubman-gill_625x300_26_May_23.jpg","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Gujarat Titans beats Mumbai Indians to reach second consecutive final, faces CSK on Sunday","link":"https://sportstar.thehindu.com/cricket/ipl/ipl-news/gujarat-titans-beats-mumbai-indians-gt-vs-csk-ipl-2023-final-ahmedabad/article66898573.ece","keywords":null,"creator":null,"video_url":null,"description":"Gujarat Titans beat Mumbai Indians by 62 runs at the Narendra Modi Stadium in Ahmedabad to reach the IPL 2023 final on Friday.","content":"That Shubman Gill was capable of reaching stratospheric levels of batsmanship was seldom in doubt. On Friday, a packed Narendra Modi Stadium experienced it firsthand as he led Gujarat Titans (GT) to its second straight Indian Premier League final, against Chennai Super Kings, with a 62-run victory over Mumbai Indians (MI). Gill’s century (129, 60b, 7x4, 10x6), his third in four innings, was T20 batting at its purest. This was especially true of the latter half of the knock. The 23-year-old took 32 balls to get to his half-century. Off the next 28, he smashed 79 to help his side reach 233 for three. MI’s reply was off to a wretched start. Ishan Kishan didn’t come out to bat because of a concussion; Cameron Green retired hurt early on after being hit on the elbow; and Rohit Sharma was out cheaply, with Josh Little completing a fine catch at short fine-leg. GT vs MI HIGHLIGHTS Tilak Varma injected some much-needed belief with a manic 43 (14, 5x4, 3x6), which included two elegant clipped sixes and a gorgeous cover drive. Suryakumar Yadav fought too (61, 38b, 7x4, 2x6), bringing up his half-century with a characteristic scooped six off Little. But Mohit Sharma scalped the all-important wicket in the 15th over, rattling Suryakumar’s leg stump with nearly 80 runs needed. Two balls later, Mohit (5 for 10) excised Vishnu Vinod before Rashid Khan trapped Tim David in front to bring a swift end to MI’s resistance. Earlier, asked to bat first after a heavy downpour had delayed the start by 30 minutes, GT plodded along in the PowerPlay, collecting 50 runs. Chris Jordan could have had Gill for 30 in the sixth over, but a diving David dropped the chance, and MI was in for a hiding. Akash Madhwal and Piyush Chawla have been among MI’s best bowlers. But neither their form nor their pedigree mattered to Gill. In the 12th over, Madhwal was smashed for three sixes on the leg-side before Chawla was deposited over long-off, paddle hit to the boundary, and clobbered for a massive 106-metre six over deep mid-wicket. The two bled 97 runs in seven overs. Gill hit 10 maximums in all, and the 10th was worthy of a place in the Louvre. He walked down the pitch to Green and nonchalantly slapped a rising delivery over the deep mid-wicket fence. Gill finally fell, holing out to David at deep mid-wicket off Madhwal. But skipper Hardik Pandya’s unbeaten 28 (13b, 2x4, 2x6) ensured a gigantic total that MI couldn’t even sniff. Read more stories on IPL News.","pubDate":"2023-05-26 18:28:03","image_url":null,"source_id":"sportstar","category":["sports"],"country":["india"],"language":"english"},{"title":"ICC reveals prize money for World Test C’ship winner","link":"https://thefrontierpost.com/icc-reveals-prize-money-for-world-test-cship-winner/","keywords":["Sports"],"creator":["The Frontier Post"],"video_url":null,"description":"F.P. Report DUBAI: International Cricket Council (ICC) on Friday announced the prize money for the World Test Championship 2021-23 cycle with a total fund of $3.8 million to be shared between the nine teams. The winner of the World Test Championship (WTC) final between India and Australia will get a whopping amount of $1.6 million […]","content":"F.P. Report DUBAI: International Cricket Council (ICC) on Friday announced the prize money for the World Test Championship 2021-23 cycle with a total fund of $3.8 million to be shared between the nine teams. The winner of the World Test Championship (WTC) final between India and Australia will get a whopping amount of $1.6 million while the losing team will still earn $800,000. The Grand Finale at The Oval in London from 7 June will not only decide the Test champions for the next two years but also the fate of a major chunk of around 63 per cent of the total prize pool of the outgoing WTC cycle. The remaining seven teams will share $1.4 million in a manner that South Africa earns $450,000 for finishing third in the WTC standings, England bags $350,000 for finishing fourth, Sri Lanka gets $200,000 for finishing fifth. The bottom four teams, including Pakistan, pocket $100,000 each. It is pertinent to mention here that Pakistan finished seventh on the standings of the outgoing World Test Championship Cycle with a below-par percentage of 38.1. Babar Azam-led side won only four Tests, lost six and drew four out of their total 14 fixtures in the cycle. Interestingly, the prize money has not been changed from the last inaugural edition of the championship (2019-21) with a total purse of $3.8 million.","pubDate":"2023-05-26 16:39:57","image_url":null,"source_id":"thefrontierpost","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"Six former Yorkshire players sanctioned","link":"https://thefrontierpost.com/six-former-yorkshire-players-sanctioned/","keywords":["Sports"],"creator":["The Frontier Post"],"video_url":null,"description":"LONDON (Agencies): Six former Yorkshire County Cricket Club players and coaches on Friday, have been sanctioned by the Cricket Discipline Commission (CDC) panel for a suspected use of racist language. According to the ECB, the CDC has today published its decisions in relation to charges brought by the ECB against Yorkshire CCC and a number […]","content":"LONDON (Agencies): Six former Yorkshire County Cricket Club players and coaches on Friday, have been sanctioned by the Cricket Discipline Commission (CDC) panel for a suspected use of racist language. According to the ECB, the CDC has today published its decisions in relation to charges brought by the ECB against Yorkshire CCC and a number raof individuals. As per the latest development, former Yorkshire players Tim Bresnan, John Blain, Matthew Hoggard, Andrew Gale and Richard Pyrah were sanctioned for racism. Ballance, Bresnan, Gale, and Pyrah were fined as well as suspended from coaching and playing cricket for varied lengths of time, whereas Blain and Hoggard were only fined. Furthermore, all six players have been advised to attend a racism or discrimination education course at their own expense. The sanctioned individuals are able to appeal the decisions before the end of business on Friday 9 June 2023. The CDC has also confirmed that the sanction hearing for Yorkshire County Cricket Club, which has admitted four breaches of ECB Directive 3.3, will be held on Tuesday 27 June 2023. These CDC sanction decisions have been made by an independent panel consisting of Tim O’Gorman (Chair of the CDC), Mark Milliken-Smith KC and Dr Seema Patel. Earlier, former England captain and renowned commentator Michael Vaughan was cleared of racism charges by the CDC. In light of the CDC decisions, Michael Vaughan was not found liable for a breach of ECB Directive 3.3, which states: “No such person may conduct themself in a manner or do any act or omission which may be prejudicial to the interests of cricket or which may bring the game of cricket or any Cricketer or group of Cricketers into disrepute”.","pubDate":"2023-05-26 16:38:41","image_url":null,"source_id":"thefrontierpost","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"Peshawar Zalmi Talent Hunt 2023 ends successfully in Hayatabad Sports complex","link":"https://thefrontierpost.com/peshawar-zalmi-talent-hunt-2023-ends-successfully-in-hayatabad-sports-complex/","keywords":["Sports"],"creator":["The Frontier Post"],"video_url":null,"description":"F.P. Report PESHAWAR: The first and important stage of the Zalmi talent hunt 2023 organized by the Pakistan Super League franchise Peshawar Zalmi has ended, more than ten thousand young cricketers have registered in the four-day trials at the Hayatabad Sports Complex Peshawar. Peshawar Zalmi President Inzamam ul Haq, Director Cricket Mohammad Akram, Zalmi star […]","content":"F.P. Report PESHAWAR: The first and important stage of the Zalmi talent hunt 2023 organized by the Pakistan Super League franchise Peshawar Zalmi has ended, more than ten thousand young cricketers have registered in the four-day trials at the Hayatabad Sports Complex Peshawar. Peshawar Zalmi President Inzamam ul Haq, Director Cricket Mohammad Akram, Zalmi star Kamran Akmal were among the selection panel that tested the talent of the young cricketers participating in the open trials and selected the best players. Pakistan and Peshawar Zalmi captain Babar Azam also reached Peshawar on the third day of the trials and encouraged the young cricketers. Zalmi and Pakistan Rising Star Mohammad Haris were also present at the trials and encouraged the young cricketers. The young cricketers were given an opportunity to show their skills by organizing matches between Inzamam u l Haq XI, Babar Azam XI, Kamran Akmal XI and Darren Sammy XI. After the end of these matches, the fiften best young cricketers have been finalized. Peshawar Zalmi Director of Cricket Muhammad Akram said that Peshawar Zalmi will provide all possible facilities to the fiften young cricketers. Young cricketers will get training and coaching at the National Cricket Academy and the most talented young cricketers can also be given an opportunity in the emerging category of PSL 9.","pubDate":"2023-05-26 16:37:12","image_url":null,"source_id":"thefrontierpost","category":["sports"],"country":["pakistan"],"language":"english"}]}