{"newsArray":[{"title":"Perth Stadium T20 records: Optus Stadium Perth T20 records and highest innings total","link":"https://thesportsrush.com/cricket-news-perth-stadium-t20-records-optus-stadium-perth-t20-records-and-highest-innings-total/","keywords":["Cricket","Afghanistan","England","ICC T20 World Cup 2022","Perth","Perth Stadium"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Perth Stadium T20 records and highest innings total: Western Australia will be hosing its second T20I this month tomorrow. The 14th match of the ongoing eighth edition of ICC T20 World Cup will be played between England and Afghanistan at the Perth Stadium tonight. The seventh consecutive double-header day of this World Cup will be… The post Perth Stadium T20 records: Optus Stadium Perth T20 records and highest innings total appeared first on The SportsRush.","content":"The 14th match of the ongoing eighth edition of ICC T20 World Cup will be played between England and Afghanistan at the Perth Stadium tonight. The seventh consecutive double-header day of this World Cup will be the first Super 12 day featuring a couple of fascinating matches. Having hosted a T20I less than a couple of weeks ago, Perth will be hosting its second international match this month. England, who had been part of the latest match here, should be banking upon their experience of playing here both as a team and with respect to . While England had won their solitary T20I at this venue, Afghanistan will be playing their first-ever T20I in Australia on Saturday. All in losing causes, Afghanistan’s three ODIs in Australia had come during ICC Cricket World Cup 2015. With this stadium hosting only a couple of T20Is thus far, the scope for any type of records is pretty minimal. The number further reduces to zero when it comes to Afghan players. Highest T20I run-scorers at the Perth Stadium are David Warner (121), Alex Hales (84), Jos Buttler (68), Aaron Finch (64), Iftikhar Ahmed (45). Highest T20I wicket-takers at this venue are Kane Richardson (4), Nathan Ellis (3), Mark Wood (3), Sean Abbott (2), Mitchell Starc (2), Sam Curran (2) and Reece Topley (2). While the first T20I (won by team batting second) here was a low-scoring contest primarily due to a batting collapse for Pakistan, the second and latest T20I (won by team batting first) was a high-scoring contest witnessing more than 400 runs being scored. Changing room ➡ The middle All set for our opener in Perth 💪 | — England Cricket (@englandcricket) Scored by England against Australia, 208/6 in 20 overs is the highest innings total in Perth T20Is. Scored by Australia against Pakistan, 109/0 in 11.5 overs is the highest successful run-chase at this venue.","pubDate":"2022-10-21 19:50:31","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Australia aiming to win consecutive T20 World Cups","link":"https://www.iol.co.za/sport/cricket/international/australia-aiming-to-win-consecutive-t20-world-cups-f5d58692-7fa1-4798-843e-53c813b1a092","keywords":null,"creator":["Stuart Hess"],"video_url":null,"description":"Australia are bidding to become the first nation to win back-to-back T20 Cricket World Cups at this year’s tournament, which they are hosting.","content":null,"pubDate":"2022-10-21 19:14:31","image_url":"https://image-prod.iol.co.za/16x9/800?source=https://xlibris.public.prod.oc.inl.infomaker.io:8443/opencontent/objects/1bce376e-0ea5-5b8b-87e3-025d6c0b4df7&operation=CROP&offset=0x313&resize=4400x2472","source_id":"iol","country":["south africa"],"category":["sports"],"language":"english"},{"title":"Ultimate guide: Stars who will take World Cup by storm","link":"https://www.couriermail.com.au/sport/cricket/t20-world-cup-2022-players-to-watch-from-every-team/news-story/e9dec637017d5b3603696bc04f911fac","keywords":["Cricket news and galleries","Cricket World Cup","Sport news and galleries"],"creator":null,"video_url":null,"description":"Australia’s quest to retain the T20 World Cup on home soil begins with a rematch of last year’s final against New Zealand.","content":"The Super 12 is locked in after a stunning final day of the tournament’s first stage that saw Ireland upset the West Indies and Zimbabwe advance after defeating Scotland.While Aussie cricket fans have been glued to the winter footy codes, cricketers have been busy plying their trade in lucrative T20 franchise leagues across the globe, headlined by the Indian Premier League. So it wouldn’t surprise if names like Tim David, Suryakumar Yadav and Wanindu Hasaranga aren’t too familiar to some. Which players on the rise are ready to take the tournament by storm, and who has already shone in the first stage of the World Cup? We outline the players to keep on your radar across the tournament.SCBBL PROMOGROUP 1 AUSTRALIA Tim David The Singapore slogger is Australia’s World Cup wildcard, but while he is lesser-known to most Aussie cricket followers, David has been producing incredible results against the best in the world. Picked up for $1.53 million in this year’s IPL after striking at an absurd 190 strike rate in a breakout Pakistan Super League campaign, he hit a whopping 16 sixes and struck at 216.2 from the 86 balls he faced for the Mumbai Indians. The destructive middle-order batter, who goes hard from ball one, continued his form in the warm-up games, clubbing 40 off 23 against England and 42 from 20 against the West Indies. If Aussies are to go back-to-back, they need David to fire. All-rounder Cam Green, added to the squad after the freak injury to Josh Inglis, is another who can have a serious impact if called on, able to be used up the order with the bat and take wickets with the ball.AFGHANISTANRahmanullah Gurbaz Gurbaz finished as the seventh-highest run scorer at this year’s Asia Cup, taking Sri Lanka to the cleaners twice with 84 from 45 deliveries and 40 from 18. He also boasted the second highest strike rate of any of the top-10 run scorers, piling on 152 runs at a lightning 163.44. In a recent Carribean Premier League match for Guyana, Gurbaz cleared the rope six times without hitting a four on his way to 60. ENGLAND Sam CurranMost T20 fans would know of Tom Curran in this format due to his BBL success, but his brother Sam looks to be in for a big tournament if England decides to pick him. Unselected for last year’s T20 World Cup, Curran bowled with precision at the death in the first two warm-up games against Australia, finishing with 3/25 and 2/35. The left-arm seamer, who is also handy with the blade, also claimed seven wickets and conceded more than 30 runs in just one of his six matches in their recent T20 series against Pakistan. Harry Brook had limited success in his BBL stint with the Hobart Hurricanes but smashed 238 runs at a 163 strike rate in that same series, while big-hitting opener Alex Hales is back in the England side for the first time since he failed a recreational drug test in 2019. IRELAND Josh Little Little announced himself on the World Cup stage with 3/24 in Ireland’s opening match of the tournament. The paceman recorded the best-figures in this year’s The Hundred, tearing through the Oval Invicibles to take 5/13. The left-arm quick claimed the equal-second most wickets in the tournament and has a wicked short ball. He was even called up as a net bowler for the Chennai Super Kings in the IPL earlier in the year. And for those who aren’t too familiar with Irish cricket, watch out for master blaster Paul Stirling. The opener has played a whopping 312 T20 matches and led Ireland to their first Super 12 spot in 13 years with a formidable 66 from 48 deliveries in their upset win over the West Indies. All-rounder Curtis Campher went bananas with 72 off 32 balls against Scotland and also has a T20 World Cup hat-trick to his name.NEW ZEALAND Finn AllenAllen has made a breakneck start to his T20 international career at the top of the order for New Zealand, striking the ball at 160 from his 17 matches. The highlight came against associate nation Scotland in July where he smoked a 56-ball ton. The 23-year-old will form a promising pairing with Devon Conway at the top of the order for the Kiwis. Explosive middle-order batter Glenn Phillips, who recently strode out to the crease to renowned WWE wrestler John Cena’s theme song, has plenty about him on and off the field. SRI LANKA Wanindu Hasaranga One of the stars of last year’s T20 World Cup, Hasaranga is a lot of fun to watch — and he’s already begun this World Cup with a bang. Not only does he put batters in a spin with the ball, he is capable of hammering balls to the fence at the end of the innings. Hasaranga clubbed 37 off just 14 balls against Zimbabwe in their World Cup trial match, and was the leading wicket-taker in the first stage of the tournament, bagging seven at an average of nine. This included an incredible 3/8 from his four overs against the UAE. The Sri Lankan sensation, who can spin it both ways, claimed the second-most wickets in their winning Asia Cup campaign this year and was the leading wicket taker in last year’s World Cup in the UAE. GROUP 2BANGLADESHShakib Al HasanNot exactly a player on the rise, but Al Hasan sits second in the T20I all-rounder rankings and remains a world class player with bat and ball at the age of 35. In Bangladesh’s T20 tri-series against New Zealand and Pakistan, Al Hasan hit 68 (42 deliveries) and 70 (44) in successive games at No. 4, and his left-arm spin is generally tidy, conceding just 6.73 runs per over across 104 T20Is. He was the fourth-highest wicket taker in last year’s T20 World Cup. INDIA Suryakumar YadavYadav has emerged as one of the top batters in world T20 cricket as the latest Indian short-form star off the IPL production line. The middle-order batter smashed Australia around the park with knocks of 69 and 46 at nearly two runs per ball in their recent T20 series in India and took Hong Kong to the cleaners with a blistering 68 from 26 deliveries in the Asia Cup. The 32-year-old scored 303 runs from just eight matches in this year’s IPL for Mumbai and is second in the ICC T20 batting rankings. Meanwhile, a renaissance from 37-year-old Dinesh Karthik is keeping Rishabh Pant out of their T20 side with his destructive finishing at the death. PAKISTANShadab Khan Taken as a platinum player in the inaugural BBL Draft by the Hobart Hurricanes, the leg-spinning all-rounder has been shifted up the order at times as a pinch-hitter for Pakistan. Khan smashed a quick-fire 34 off 22 against New Zealand last week at No. 4, with the cameo helping them to a convincing six-week win. With the ball, Khan was the third-highest wicket taker at this year’s Asia Cup with eight wickets, putting Hong Kong in a spin with 4/8, And while all the attention is directed at T20 superstar Babar Azam, his opening partner and No. 1 ranked T20 batter Mohammad Rizwan is another threat at the top of the order.NETHERLANDS Scott EdwardsHailing from Blackburn in Melbourne’s eastern suburbs, Edwards has risen from Victorian Premier Cricket for Richmond to captaining the Netherlands at a World Cup. The ‘keeper-batter has played 46 T20Is for the Netherlands, where he currently resides, and has scored an absurd 137 from 39 balls in the European Cricket League – worth a watch on YouTube. Former Renegades and Head batter Tom Cooper is also a part of the Dutch contingent., whil Max O’Dowd was the second-ranked run scorer in the first stage of the tournament, including a gallant 71* to keep his side alive against Sri Lanka. SOUTH AFRICA Rilee RossouwRossouw, who signed a shock Kolpak deal with Hampshire in 2017, came out of international retirement mid-year and has thrived. He blasted his maiden T20I ton – off a mere 48 deliveries – against India at the beginning of the month and smoked a 96 in his second game back in the side. The 33-year-old was taken at pick 18 in the BBL Draft by the Sydney Thunder and played with the Renegades in BBL10. Giant 207cm paceman Marco Jannsen, who has been called in as a replacement for bowler Dwaine Pretorius, is another player to watch after claiming 37 wickets in his first seven Tests for the Proteas. ZIMBABWE Sikandar RazaThe 36-year-old is getting better with age. Not only has he scored 136 runs — the most in the tournament so far — at a blistering 172 strike rate, he has also proved to be valuable with his off-spin, taking five wickets. Raza finished with the second most runs in the Group B qualifiers before the tournament and hit back-to-back 60-plus totals in a recent series against Bangladesh, who he will meet again in the group stage. Ryan Burl, the man who led Zimbabwe to a historic win over Australia last month with a five-wicket haul – as a part-time leggie – is also back on Australian.","pubDate":"2022-10-21 19:00:00","image_url":null,"source_id":"couriermail","country":["australia"],"category":["sports"],"language":"english"},{"title":"Stokes criticises 'stupid' size of boundary markers after Topley blow","link":"https://www.skysports.com/cricket/news/12040/12726615/t20-world-cup-ben-stokes-critical-of-boundary-markers-after-reece-topleys-injury","keywords":null,"creator":null,"video_url":null,"description":"Ben Stokes has criticised the \"stupid\" size of cricket's boundary marking sponges after they caused Reece Topley's injury which ruled him out of England's T20 World Cup.","content":"Ben Stokes has criticised the \"stupid\" size of cricket's boundary marking sponges after they caused Reece Topley's injury which ruled him out of England's T20 World Cup. During a fielding drill before England's final warm-up against Pakistan at Brisbane on Monday, Topley suffered ligament damage to his left ankle after stepping on a padded cushion and landing awkwardly . The 6ft 7in left-arm seamer had been set for a pivotal role in Australia but will now return home to the UK after England's tournament opener against Afghanistan at Perth on Saturday. It is a cruel blow and - according to Stokes - an entirely avoidable one, for a player who has bounced back from multiple stress fractures in his back that threatened to derail his career. Commonly referred to as 'Toblerones' due to their triangular prism shapes, the foam sponges present an advertising opportunity and have become widespread instead of a traditional rope around the ground. But as they measure around 20cm in height and width, England Test captain Stokes feels the dimensions could be addressed to prevent similar incidents from happening in the future. He said: \"It's stupid. Unfortunately, it's taken one of our players to be ruled out of the World Cup [to make people notice]. Jos Buttler: England's fiery, thinking, hard-hitting captain England 'chomping at the bit' for T20 World Cup | 'Our first big moment' T20 World Cup: Here come the heavy hitters! Watch the T20 World Cup on Sky: Full fixture list and TV times \"I'm pretty sure it's something they can look at but you know what it's like - everybody wants to get their names on somewhere. \"But you look at player safety and the fact he's stood on it and it's ruptured ligaments and now he's out of the World Cup - it should be looked at. [But] I'm devastated for him. \"We are all just absolutely gutted for him that he's missed out on this World Cup because he would have been one of the first names on the team sheet.\" It is understood the England and Wales Cricket Board is not intending to raise the issue to the International Cricket Council. England white-ball captain Jos Buttler told BBC Sport: \"We practise around the boundary a lot to try and get used to it. I don't see it as any more than a freak accident.\" Please use Chrome browser for a more accessible video player Stokes has this month returned to England's T20 set-up, having been absent in the format since March 2021, and he has been given additional responsibility of batting at number four in the tournament. He missed last year's World Cup, prioritising his mental health and rehabilitation from a badly broken finger, so his most recent experience in this competition was his last over in the 2016 final, when Carlos Brathwaite unforgettably flogged four successive sixes to secure an unlikely West Indies win. Asked whether he reflects on what happened six years ago, Stokes said: \"No, no. That's gone. It was such a long time ago. I never let that kind of stuff eat me up. \"I came here not knowing where I was going to fit into the squad and then Jos made it clear the role I will be playing throughout the World Cup. He just said come in, bat four and bowl some overs. \"I've gone with the flow to be honest. I think coming back into the squad after being away from it for a while, it's exciting. \"T20 cricket is completely different, full of energy, so you just need to practice more because it's just such a different type of cricket. \"I've been putting some hard yards in and training, getting used to the flow and feel of the game and getting the hours under my belt.\" Please use Chrome browser for a more accessible video player England are seeking to unify cricket's two limited-overs World Cups, with Stokes talismanic in their 2019 50-over success, but the all-rounder insisted doing the double is not the prime motivation. \"The motivation is just to win this one and move on to the next one,\" Stokes added. \"Jos has been fantastic at leading this group of cricketers and we understand this is a new era and we shouldn't play to anyone's expectations of what's happened in the past.\" Watch England's T20 World Cup opener against Afghanistan live on Sky Sports Cricket on Saturday. Coverage begins at 11.30am ahead of midday start.","pubDate":"2022-10-21 18:42:00","image_url":"https://e2.365dm.com/22/10/1920x1080/skysports-ben-stokes-reece-topley_5938677.jpg?20221021191147","source_id":"skysports","country":["united states of america","united kingdom","australia"],"category":["sports"],"language":"english"},{"title":"Sydney Cricket Ground T20 records: Sydney Ground T20 records and highest innings total","link":"https://thesportsrush.com/cricket-news-sydney-cricket-ground-t20-records-sydney-ground-t20-records-and-highest-innings-total/","keywords":["Cricket","Australia","ICC T20 World Cup 2022","New Zealand","SCG","Sydney Cricket Ground"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Sydney Cricket Ground T20 records: Sydney will be hosting its fourth international match across formats tomorrow. Having hosted an Ashes Test and a couple of T20Is against Sri Lanka in the first two months of 2022, Sydney Cricket Ground will be hosting an international match for the first time in the ongoing Australian summer season.… The post Sydney Cricket Ground T20 records: Sydney Ground T20 records and highest innings total appeared first on The SportsRush.","content":"Having hosted an Ashes Test and a couple of T20Is against Sri Lanka in the first two months of 2022, Sydney Cricket Ground will be hosting an international match for the first time in the ongoing Australian summer season. In what will also be the first ICC T20 World Cup 2022 match at this venue, it will also be the first Super 12 match of this tournament. Australia, who will start a journey of defending their T20 World Cup title with this match, have a fantastic T20I record here on the back of winning seven and losing three out of 11 matches over the years. Set to play a Sydney T20I after four years, New Zealand will be keen to register their first T20I victory at this venue after a couple of losses in the past. Assuming that the same happens, it will be the Black Caps’ first white-ball win in this country since 2009. Highest run-scorers in Sydney T20Is are Virat Kohli (236), Shane Watson (186), Matthew Wade (155), Glenn Maxwell (154) and Shikhar Dhawan (147). As far as batters taking part in this tournament are concerned, Pathum Nissanka (109), David Warner (98), Aaron Finch (98), Steven Smith (93), Marcus Stoinis (90), Rohit Sharma (75), Hardik Pandya (62) and Babar Azam (59) have scored more than 50 runs in this format here. Highest T20I wicket-takers at the Sydney Cricket Ground are Adam Zampa (8), Josh Hazlewood (7), Andrew Tye (7), Wanindu Hasaranga (5) and Krunal Pandya (4). Kane Richardson (3), Mitchell Starc (3), Trent Boult (2), Ashton Agar (2), Chamika Karunaratne (2), Tim Southee (2), Pat Cummins (2) and Glenn Maxwell (2) are among the players who are part of various squads and have two (or more) T20I wickets at this iconic stadium. The above mentioned second and fourth highest innings totals in Sydney T20Is are also the highest successful run-chases here in this format. In fact, all the first three highest run-chases at this venue belong to India. Overall, teams batting first and second have won four and five times respectively. While one T20I had witnessed no result, the latest one had ended in a super over.","pubDate":"2022-10-21 18:28:58","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"“Luckily you’re not there”: Rashid Khan reminisces Eoin Morgan’s 2019 World Cup innings vs Afghanistan ahead of 2022 T20 World Cup match vs England","link":"https://thesportsrush.com/cricket-news-luckily-youre-not-there-rashid-khan-reminisces-eoin-morgans-2019-world-cup-innings-vs-afghanistan-ahead-of-2022-t20-world-cup-match-vs-england/","keywords":["Cricket","Afghanistan","England","Eoin Morgan","ICC T20 World Cup 2022","rashid khan"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Rashid Khan reminisces Eoin Morgan’s record-breaking innings versus Afghanistan during the 2019 ODI World Cup in England and Wales. Afghanistan will take on the title frontrunners England in the second ‘Super 12 Group 1’ match of the ongoing ICC T20 World Cup 2022, at the Perth Stadium on October 22 (Saturday). Afghanistan’s star bowling allrounder… The post “Luckily you’re not there”: Rashid Khan reminisces Eoin Morgan’s 2019 World Cup innings vs Afghanistan ahead of 2022 T20 World Cup match vs England appeared first on The SportsRush.","content":"Afghanistan will take on the title frontrunners England in the second ‘Super 12 Group 1’ match of the ongoing ICC T20 World Cup 2022, at the Perth Stadium on October 22 (Saturday). Afghanistan’s star bowling allrounder Rashid Khan will yet again have to perform to his potential best, to get past one of the strongest T20 sides in World Cricket at the moment in particular. As for Saturday’s clash between the two sides, England certainly have the wood over Afghanistan in head-to-head T20 World Cup history, having won each of their two matches during the 2012 edition (by 116 runs) and the 2016 edition (by 15 runs). Moreover, around three years ago, during the 2019 ODI World Cup match between these two sides in Manchester, England handed the strictest of the punishments to the Afghan bowlers, Rashid Khan in particular, when they posted a mammoth total of 397/6 in 50 overs, to ultimately win the match by 150 runs. England’s skipper during the 2019 World Cup, Eoin Morgan, who is now part of the for the ongoing T20 World Cup 2022 in Australia after retiring from international Cricket in June this year, had of the Afghan bowling attack during the aforementioned contest, with a scintillating century. Rashid Khan was smashed for off his 9 Overs during the innings – his worst bowling figures in ODI Cricket, with Morgan during the innings. Also, with 17 Sixes to his name, the then English skipper still holds the record for smashing the maximum number of Sixes in ODI history. Rashid, during an interaction with Morgan on the match eve, hilariously exclaimed that he’s lucky that he (Morgan) is not in the England squad for the T20 World Cup this year. While praising the quality of the present England T20 World Cup squad, Rashid managed to sneak in with the not-so-good memories he had with Morgan and his England team during the 2019 T20 World Cup. “Luckily you’re not there (both smile), which is a kind of big relief for me after what happened during the 2019 World Cup. But yeah, the batting line-up that they (England) have in the middle, be it Livingstone or Stokes, it will be a great contest, but at the same time, it will be a great learning for me as well as a responsibility in the middle to bowl to them,” exclaimed Rashid Khan. 🎙 “Luckily you’re not there, which is a big relief for me” Eoin Morgan’s brilliant innings in the 2019 World Cup still haunts Rashid Khan 😭 — Sky Sports Cricket (@SkyCricket) For more Cricket-related news, click .","pubDate":"2022-10-21 18:18:02","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Stokes slams 'stupid' big boundary markers","link":"https://www.perthnow.com.au/sport/cricket/stokes-slams-stupid-big-boundary-markers-c-8622761","keywords":null,"creator":["Staff Writers"],"video_url":null,"description":"Ben Stokes has criticised the \"stupid\" size of cricket's boundary marking sponges after they caused Reece Topley's World Cup-ending injury.","content":null,"pubDate":"2022-10-21 18:15:20","image_url":"https://images.perthnow.com.au/publication/C-8622761/c04b96463adc82ff85d107fcfdfe87e2c320488a-16x9-x0y0w1280h720.jpg","source_id":"perthnow","country":["australia"],"category":["sports"],"language":"english"},{"title":"‘What the hell is this?’ Brave experiment changed cricket forever","link":"https://www.theage.com.au/sport/cricket/what-the-hell-is-this-brave-experiment-changed-cricket-forever-20221020-p5brlb.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":["Sport / Cricket"],"creator":["Iain Payten"],"video_url":null,"description":"When Australia and New Zealand played the first T20 international in 2005, players dressed up and treated it as a “gimmick”. But the game kick-started cricket’s new future.","content":null,"pubDate":"2022-10-21 18:00:00","image_url":null,"source_id":"theage","country":["australia"],"category":["sports"],"language":"english"},{"title":"Australia vs New Zealand, T20 World Cup: When And Where To Watch Live","link":"https://sports.ndtv.com/cricket/australia-vs-new-zealand-t20-world-cup-group-1-match-when-and-where-to-watch-live-telecast-live-streaming-3453810","keywords":["Cricket"],"creator":["NDTV"],"video_url":null,"description":"The Trans-Tasman rivalry will be renewed once again when Australia face New Zealand in a T20 World Cup Group 1 fixture at the Sydney Cricket Ground on Saturday, October 23","content":"The Trans-Tasman rivalry will be renewed once again when Australia face New Zealand in a T20 World Cup Group 1 fixture at the Sydney Cricket Ground on Saturday, October 23. This match will be a replay of last year's T20 World Cup final, which Australia won at the Dubai International Stadium. The defending champions, Australia, head into the tournament with a 0-2 series defeat to England, followed by a narrow loss to India in a warm-up game. New Zealand, on other hand, lost the tri-series final at home to Pakistan, and were also beaten in their only warm-up game by South Africa. When will the Australia vs New Zealand, T20 World Cup Group 1 match be played? The Australia vs New Zealand, T20 World Cup Group 1 match will be played on Saturday, October 22. Where will the Australia vs New Zealand, T20 World Cup Group 1 match be played? The Australia vs New Zealand, T20 World Cup Group 1 match will be played at the SCG in Sydney. What time will the Australia vs New Zealand, T20 World Cup Group 1 match start? The Australia vs New Zealand, T20 World Cup Group 1 match will start at 12:30 PM IST. Which TV channels will broadcast the Australia vs New Zealand, T20 World Cup Group 1 match? The Australia vs New Zealand, T20 World Cup Group 1 match will broadcasted on the Star Sports Network. Where to follow the live streaming of the Australia vs New Zealand, T20 World Cup Group 1 match? Promoted The live streaming of the Australia vs New Zealand, T20 World Cup Group 1 match will be available on Disney+ Hotstar. (All telecast and streaming timings are as per the information received from the host broadcasters)","pubDate":"2022-10-21 17:51:51","image_url":"https://c.ndtvimg.com/2022-09/k58t2fbg_aaron-finch-kane-williamson-afp_625x300_08_September_22.jpg?im=FeatureCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"AUS vs NZ Dream11 Team Prediction, Match Preview, Fantasy Cricket Hints: Captain, Probable Playing 11s, Team News; Injury Updates For Today’s AUS vs NZ T20 World Cup 2022 match No. 13 in Sydney, 1230 PM IST, October 22","link":"https://zeenews.india.com/cricket/aus-vs-nz-dream11-team-prediction-match-preview-fantasy-cricket-hints-captain-probable-playing-11s-team-news-injury-updates-for-today-s-aus-vs-nz-t20-world-cup-2022-match-no-13-in-sydney-1230-pm-ist-october-22-2525197.html","keywords":null,"creator":null,"video_url":null,"description":"Australia vs New Zealand Dream11 Team Prediction Australia vs New Zealand T20 World Cup 2022 Match No. 13 Preview - Check My Dream11 Team, Best players list of AUS vs NZ, Australia Dream11 Team Player List, New Zealand Dream11 Team Player List, Dream11 Guru Tips, Fantasy Cricket Tips, Fantasy Cricket Tips, Fantasy Playing Tips.","content":"Australia and New Zealand will lock horns in match no. 13 of the T20 World Cup 2022 as both sides will look to begin their campaign with an impressive victory. Australia being the hosts will play their first game of the tournament on Saturday (October 22) at the Sydney Cricket Ground against Kane Williamson-led Kiwies. The defending champions led by Aaron Finch are currently sixth in the ICC T20I rankings whereas New Zealand are fifth. (AUS vs NZ Livestream details) AUS vs NZ Dream11 Team Prediction Captain: Marcus Stoinis Vice-Captain: David Warner Suggested Playing XI for AUS vs NZ Dream11 Fantasy Cricket Wicketkeepers: Devon Conway, Matthew Wade Batsmen: David Warner, Mitchell Marsh, Kane Williamson All-rounders: Michael Bracewell, Marcus Stoinis Bowlers: Mitchell Starc, Adam Zampa, Josh Hazlewood, Trent Boult Australia vs New Zealand Predicted Playing 11s Australia Probable Playing Line-up: Aaron Finch, David Warner, Tim David, Marcus Stoinis, Mitchell Marsh, Glenn Maxwell, Matthew Wade, Pat Cummins, Josh Hazlewood, Adam Zampa, Mitchell Starc New Zealand Predicted Playing Line-up: Kane Williamson, Finn Allen, Michael Bracewell, Devon Conway, Mark Chapman, James Neesham, Glenn Phillips, Trent Boult, LH Ferguson, Ish Sodhi, Tim Southee","pubDate":"2022-10-21 17:48:00","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"Cricket Scotland appoints new board members in wake of damning racism report","link":"https://www.skysports.com/cricket/news/12040/12726603/cricket-scotland-appoints-two-new-board-members-in-wake-of-damning-racism-report","keywords":null,"creator":null,"video_url":null,"description":"Cricket Scotland has appointed two new board members as it tries to turn its reputation around after a damning report found it to be institutionally racist.","content":null,"pubDate":"2022-10-21 17:46:00","image_url":"https://e1.365dm.com/22/10/1920x1080/anjan-luthra-cricket-scotland_5923556.jpg?20221007175038","source_id":"skysports","country":["united states of america","united kingdom","australia"],"category":["sports"],"language":"english"},{"title":"‘An embarrassment of riches’ – Steve Harmison previews England’s chances at the T20 World Cup and looks at the major competition as Jos Buttler’s side chase glory in Australia","link":"https://talksport.com/sport/cricket/1223853/world-cup-t20-preview-england-cricket-team-steve-harmison-ben-stokes-harry-brook/","keywords":["Cricket","Sport","Australia Cricket","Cricket World Cup","England Cricket","India Cricket","South Africa Cricket"],"creator":["Jack Cunningham"],"video_url":null,"description":null,"content":"England’s T20 ICC World Cup campaign in Australia is edging closer, and the 2010 champions are one of the favourites to lift the trophy. It’s a new era for England as Jos Buttler has replaced Eoin Morgan as white-ball captain after a sustained period of success. Buttler is set to lead his side in a major international tournament for the first time But despite dominating the shorter formats of cricket for years, Morgan never won the T20 World Cup as captain. So can his successor build on the excellent foundations and go one step further? Former England and Durham bowler Steve Harmison believes England are in contention to win. Speaking exclusively to talkSPORT.com, he said: “I think England have got a good chance. “There are a lot of question marks over England playing Pakistan seven times, but when you look at it now, there are teams around the world trying to catch up. “And when I look at the England team, they are probably the only ones at the minute hitting their stride. “They’ve got an embarrassment of riches, power at the top. They’ve got a fast bowler in Mark Wood who can change a game. They’ve got the two spinners (Moeen Ali and Adil Rashid) who are feared around the world, so I expect England to have a good tournament.” Most read in Cricket UNHAPPY Knight accuses India of 'lying' amid 'Mankad' dismissal controversy HONOUR Buttler named England white-ball captain and pays tribute to ‘inspirational’ Morgan storm Azeem Rafiq: Yorkshire cricket racism scandal timeline as fallout deepens Revealed Joe Hart on his love of cricket and why he missed World Cup game to play no mates Warne tells Samuels to get help after awful post about Stokes' wife and skin tone listen in South Africa vs England: Exclusive coverage as tourists look to wrap up series Harmy made 123 appearances for England across all formatsGetty SKY SPORTSAustralia are on home soil and are the defending champions[/caption] However, Harmison knows just how unpredictable T20 cricket can be and accepts that a few things will have to go England’s way if they are to lift the trophy for the first time since 2010. “In the shorter format, it just takes one player to come off. “T20 cricket is a lottery, and it’s about who can hold their nerve, and we have players who can handle the pressure. “But if we lose the toss against India in the semi-final or final and Rohit Sharma or Virat Kohli go and get a match-winning innings, it wouldn’t be a disappointment – we would have been beaten by a better team.” Harmison was a sublime bowler possessing great pace and produced some memorable moments for England as a player. And as a pundit, his passion for England’s current T20 team is clear, but mentioning one name makes his excitement peak. “Harry Brook is an incredible talent. “We know what Mark Wood can do, but I reckon Brook, in the next six months, is going to announce himself in world cricket. “I think the boy’s got a huge future in the game. I think he will play for England for a lot of years. “He will be the most exciting thing in this team. He’s going to bat at number four, and if he has a good time, I think England have got a great chance of winning.” Brook is only 23, but he impressed during the warm-up games against Pakistan, and Harmison can’t wait to watch him in AustraliaGetty England's T20 World Cup fixtures and possible route to the final England vs Afghanistan, 22 October – 12pm UK time, (Perth Stadium, Perth) Ireland vs England, 26 October – 5am UK time, (MCG, Melbourne) Australia vs England, 28 October – 9am UK time, (MCG, Melbourne) England vs New Zealand, 1 November – 8am UK time, (The Gabba, Brisbane) Sri Lanka vs England, 5 November – 8am UK time, (SCG, Sydney) Semi-final one, 9 November – 8am UK time, (SCG, Sydney) Semi-final two, 10 November – 8am UK time, (Adelaide Oval, Adelaide) Final, 13 November – 8am UK time, (MCG, Melbourne) Brook is an excellent talent and looks set for a key role in the England team. But despite being very excited by the Yorkshire batter, Harmison sees one of England’s stalwarts as the main man once again. “England’s key player is Ben Stokes. He’s going to bat in the top four. It looks like he’s going to open the bowling. “He has this ability to bat both ways. “If Alex Hales and Buttler come off, he can accelerate to sixth gear. “But if we lose a couple of wickets in the powerplay, Ben can also absorb the game and regroup.” But where will Stokes fit into the side? Well, Harmy thinks one of England’s main T20 players from the last few years could come out of the XI to make way for the Durham all-rounder. “I think Stokes will bat at number three, which would be a good move for England. Because as much as Dawid Malan is one of the top-ranked players in the world (in this format), we shouldn’t look too much into that because he always plays while other players are in Test matches or are rotated and rested. “I wouldn’t play Malan, I would bat Stokes at three.” Stokes was England’s hero in the 2019 ODI World CupGetty England T20 World Cup squad Jos Buttler (capt, wk), Moeen Ali, Harry Brook, Sam Curran, Alex Hales, Chris Jordan, Liam Livingstone, Dawid Malan, Tymal Mills, Adil Rashid, Phil Salt (wk), Ben Stokes, David Willey, Chris Woakes, Mark Wood Travelling reserves: Liam Dawson, Richard Gleeson, Luke Wood However, despite being one of the strongest teams in the tournament, there are plenty of other threats that could stop England along the way. “I think over the course of the group games, England and Australia will be the two that qualify from that group, and in the other, it will be India plus another. South Africa have a chance. New Zealand are always there or thereabouts.” Of course, everyone expects Australia and India to make it out of their groups because you only have to look at the respective squads to see the talent they possess. And you would think they will be the toughest competition for England and the most likely to cause Buttler’s side problems. But Harmison mentioning South Africa was slightly surprising, given they have never won the ICC T20 World Cup. However, Temba Bavuma’s side have won five of their last seven T20 games, including beating England and India. And Harmison believes they will be the team to watch. “Not many people fancy South Africa because they’ve got a lot of hit-or-miss players like David Miller and Rillee Rossouw. “My only concern for South Africa is I don’t know if they can hit the volume of runs required in the latter stages. “But if Quinton de Kock can get them off to a good start and Miller and Rossouw come off, they can be the surprise package because if Miller and Rossouw come off, it’s a different game.” South Africa could be the surprise package of this tournamentAFP So the stage is set for a thrilling tournament as all of the world’s best flock to Australia. But there is a lot of pressure on England to come back with the trophy, and pressure is a good thing because it should bring out the best in the squad. However, Harmison doesn’t think this is a must-win tournament for Buttler’s men. “You always want to win it. I don’t think there is a need to win it. England are playing some good cricket around the world in all formats. “So I don’t think England need to win it, and I don’t think people should be saying, ‘England need to win this tournament’. “But England have a great chance; you just need that bit of luck and brilliance to go all the way. England have got that bit of brilliance with bat and ball.” Perhaps that is the best way to look at this tournament because England are one of the best white-ball sides in the world, but failing to win wouldn’t mean it was a shambolic campaign. India and Australia could prove too strong, and as long as England at least make it to the semi-finals and play some great cricket, that should be enough.","pubDate":"2022-10-21 16:36:21","image_url":null,"source_id":"talksport","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Women&#039;s IPL: India&#039;s chance to raise female cricketers&#039; talent pool","link":"https://sportstar.thehindu.com/cricket/women-ipl-chance-for-female-indian-cricketers-bcci-talent-pool/article66041800.ece","keywords":null,"creator":["\n        P. K. Ajith Kumar  \n    "],"video_url":null,"description":"The timing also seems to be right for the Women’s IPL, given the rise in popularity of women’s cricket in India. Players like Smriti Mandhana, Harmanpreet Kaur and Shafali Verma have huge fan-followings. The W","content":"On the day the BCCI finally decided to conduct the Women’s IPL at its annual general meeting at the Taj Mahal Palace in Mumbai, S. Sajana was playing a T20 game on a ground that was about an hour’s drive away from the famous hotel. She is a 27-year-old from Wayanad, a hilly district in Kerala that rose to prominence after Rahul Gandhi contested and won at the last Lok Sabha elections. Her father is an autorickshaw driver. The off-spinning all-rounder once impressed Gautam Gambhir so much that he gifted her one of his bats. In about five months’ time, you may perhaps get to see her in action at the Women’s IPL. India’s female cricketers like Sajana – their number is growing fast – have been waiting for the launch of the tournament for a long time. In the past, whenever the topic of the Women’s IPL had come up, questions used to be asked about India’s depth in women’s cricket. The domestic tournaments, such as the Senior Women’s that Sajana is playing now, will tell you that the franchises will have enough players to choose from, especially when the inaugural edition of the Women’s IPL is expected to have only five teams. Just the other day a former India cricketer was talking to this correspondent about how impressed she was with the young talents at the Senior Women’s T20 tournament. She could see girls who were power-hitting with confidence and fielding superbly. She has received calls from multiple men’s IPL teams, who wanted to know about the players. Some of those IPL franchises had been considering investing in women’s teams for a while. The Women’s IPL will no doubt be a massive boost for women’s cricket in the country. It could unearth fresh talents, as we have seen at the men’s IPL, and they would get to play with and against some of the best female cricketers from around the globe. The superstars in women’s cricket have been itching to come to India for a franchise league ever since the Women’s T20 Challenge – the precursor to the Women’s IPL – was launched in 2018. Playing alongside, and against them are bound to help the Indians, especially the uncapped ones, become better. The timing also seems to be right for the Women’s IPL, given the rise in popularity of women’s cricket in India. Players like Smriti Mandhana, Harmanpreet Kaur and Shafali Verma have huge fan-followings. The Women’s IPL should bring in new fans. Read more stories on Cricket.","pubDate":"2022-10-21 16:32:45","image_url":null,"source_id":"sportstar","country":["india"],"category":["sports"],"language":"english"},{"title":"England vs Afghanistan – T20 World Cup 2022: UK start time, live stream, TV channel as Buttler’s side begin campaign","link":"https://www.thesun.co.uk/sport/20184868/england-vs-afghanistan-t20-world-cup-2022-start-time-live-stream-tv-channel/","keywords":["Cricket","Sport","Explainers","Men's T20 World Cup"],"creator":["James Orr"],"video_url":null,"description":null,"content":"ENGLAND kick off their T20 Cricket World Cup campaign against Afghanistan this weekend. Champions Australia are hosting the big tournament across seven cities. Mooen Ali and Jos Buttler are preparing for their T20 start And England captain Jos Buttler says his side are “chomping at the bit” ahead of their T20 opener. Buttler said: “We’ve had some really good games over the last 10 matches and played some really good cricket. “We’re in a good spot. Everyone is chomping at the bit to get going now. “On the eve of the tournament we’re very ready.” Read more T20 World Cup GET YOUR FIX All England's fixtures for the ICC T20 World Cup 2022 EYES ON THE PRIZE ICC T20 World Cup prize money 2022: How much do the winners get When is England vs Afghanistan? England vs Afghanistan takes place on Saturday, October 22. The T20 World Cup match starts at 12pm UK time – which is 7pm in Perth. The Perth Stadium plays host. What TV channel and live stream is England vs Afghanistan? England vs Afghanistan will be broadcast live on Sky Sports Main Event and Sky Sports Cricket. Sky begin their coverage at 11.30am. What are England’s fixtures? England have been drawn in Group 1 along with the likes of New Zealand, Afghanistan and reigning champions Australia. Fixtures: England vs Afghanistan – October 22 – PerthEngland vs Ireland – October 26 – MelbourneEngland vs Australia – October 28 – MelbourneEngland vs New Zealand – November 1 – BrisbaneEngland vs Group A winner – November 5 – Sydney England open up against Afghanistan What are the T20 World Cup 2022 groups? The first stage of the World Cup involves eight teams that had to go through qualification. And the next group stage includes teams that already qualified alongside the top four teams from stage one. Group A: Namibia, Sri Lanka, United Arab Emirates, Netherlands Group B: Ireland, Scotland, Zimbabwe, West Indies Group 1: Australia, Afghanistan, England, New Zealand, Group A winner, Group B runner-up Group 2: Bangladesh, India, Pakistan, South Africa, Group A runner-up, Group B winner Most read in Cricket EYES ON THE PRIZE ICC T20 World Cup prize money 2022: How much do the winners get GET YOUR FIX All England's fixtures for the ICC T20 World Cup 2022 CRICKET CRAZY Latest updates on the ICC T20 World Cup including confirmed teams RIP RAUF Tributes paid as legendary cricket umpire dies after suffering cardiac arrest JONNY ROTTEN LUCK Bairstow OUT of T20 World Cup after breaking leg on GOLF COURSE RIP RUDI Tributes paid to late cricket umpire Rudi Koertzen after car crash","pubDate":"2022-10-21 16:05:51","image_url":null,"source_id":"thesun","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Ben Stokes criticises ‘stupid’ size of boundary markers after Reece Topley blow","link":"https://www.belfasttelegraph.co.uk/sport/cricket/ben-stokes-criticises-stupid-size-of-boundary-markers-after-reece-topley-blow-42086104.html","keywords":["Cricket"],"creator":null,"video_url":null,"description":"Ben Stokes criticised the “stupid” size of cricket’s boundary marking sponges after they caused Reece Topley’s injury which ruled him out of England’s T20 World Cup.","content":null,"pubDate":"2022-10-21 16:00:55","image_url":"https://www.belfasttelegraph.co.uk/sport/cricket/68d70/42086100.ece/AUTOCROP/w1240h700/bpanews_46eac58c-4c4b-4fb2-8bf7-1459945a049f_1","source_id":"belfasttelegraph","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"T20 World Cup 2022, AUS vs NZ: Defending champions vs Dark Horses | PREVIEW","link":"https://www.indiatvnews.com/sports/cricket/t20-world-cup-2022-aus-vs-nz-defending-champions-vs-dark-horses-preview-2022-10-21-818001","keywords":null,"creator":null,"video_url":null,"description":"T20 World Cup 2022, AUS vs NZ: The big time is here, it is time for New Zealand to take on Australia. The rematch of last year's final that was played in the United Arab Emirates. Last time around Australia managed to outplay New Zealand and claim the World Cup for the first time. It is a new edition and Australia will want to start their campaign with new hopes and on a victorious note. The World Cup opener that will be played on October 22, 2022, will be hosted by the Sydney Cricket Ground.","content":null,"pubDate":"2022-10-21 15:52:33","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"Super 12 T20 World Cup 2022 schedule group list: T20 World Cup 2022 Groups A and B match list","link":"https://thesportsrush.com/cricket-news-super-12-t20-world-cup-2022-schedule-group-list-t20-world-cup-2022-groups-a-and-b-match-list/","keywords":["Cricket","ICC T20 World Cup 2022","Super 12"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Super 12 T20 World Cup 2022 schedule group list: The group/qualifying stage of the T20 World Cup 2022 culminated on Friday. The ongoing ICC T20 World Cup 2022 finally has all the teams confirmed for the ‘Super 12’ stage, with four remaining spots sealed after the end of the group stage of the tournament on… The post Super 12 T20 World Cup 2022 schedule group list: T20 World Cup 2022 Groups A and B match list appeared first on The SportsRush.","content":"The ongoing ICC T20 World Cup 2022 finally has all the teams confirmed for the ‘Super 12’ stage, with four remaining spots sealed after the end of the group stage of the tournament on Friday. With Sri Lanka and Netherlands having booked their respective berths on Thursday itself, the last day of the qualifying stage witnessed the two-time T20 World champions West Indies crash out of the tournament along with Scotland, who had gone past this stage during the 2021 World Cup. West Indies had no answers to the all-round display of top quality Cricket from Ireland, who made it through to the ‘Super 12’ stage after defeating the former in a one-sided contest by 9 wickets in Hobart. Later in the day, Zimbabwe got the better of Scotland by 5 wickets, to make it through to the next round as well, for the first time in T20 World Cup history. The African nation had previously been part of the T20 World Cup on a total of five occasions, but had never gone past the first round in the tournament. The aforementioned developments have meant that Zimbabwe and Netherlands will be part of the ‘Super 12 Group 2’, while Sri Lanka and Ireland will join the ‘Super 12 Group 1’. Super 12 Group 2 teams – Netherlands, Zimbabwe, Bangladesh, India, Pakistan, and South Africa. Super 12 Group 1 teams – Sri Lanka. Ireland, Afghanistan, Australia, England, New Zealand. :","pubDate":"2022-10-21 15:46:29","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"T20 World Cup: Rain May Lead To Curtailed India vs Pakistan Match - Report - NDTV Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMiXGh0dHBzOi8vc3BvcnRzLm5kdHYuY29tL3QyMC13b3JsZC1jdXAtMjAyMi9yYWluLW1heS1sZWFkLXRvLWN1cnRhaWxlZC1pbmRvLXBhay1tYXRjaC0zNDUzMTE30gFiaHR0cHM6Ly9zcG9ydHMubmR0di5jb20vdDIwLXdvcmxkLWN1cC0yMDIyL3JhaW4tbWF5LWxlYWQtdG8tY3VydGFpbGVkLWluZG8tcGFrLW1hdGNoLTM0NTMxMTcvYW1wLzE?oc=5","keywords":null,"creator":null,"video_url":null,"description":"T20 World Cup: Rain May Lead To Curtailed India vs Pakistan Match - Report  NDTV SportsIndia vs Pakistan live stream — how to watch the T20 World Cup game live  Tom's GuideT20 World Cup 2022 IND Vs PAK: Hollywood & WWE Superstar 'The Rock' Sends A Special Message.  ICC CRICKET SCHEDULEThe journey of inaugural champions India at the T20 World Cup  Mumbai IndiansHotels overbooked, ticket touts on prowl as all eyes in Melbourne on India-Pak Sunday  The Indian ExpressView Full coverage on Google News","content":null,"pubDate":"2022-10-21 14:30:19","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Watch best moments of T20 World Cup on Reels as Meta partners with ICC","link":"https://www.tribuneindia.com/news/science-technology/watch-best-moments-of-t20-world-cup-on-reels-as-meta-partners-with-icc-443501","keywords":null,"creator":null,"video_url":null,"description":"IANS New Delhi, October 21 Tech giant Meta on Friday announced that it has partnered with the International Cricket Council (ICC) to show users the best moments from the ICC Men's T20 World Cup being held in Australia on Reels. The company said that fans will be able to access match highlights and in-play clips as well as engage and create Reels with exclusive augmented reality (AR) effects and a fan anthem to support their favourite teams. \"Watching video is half the time spent on our platforms today and Reels is our fastest growing content format by far. Considering India's passion for cricket, we wanted to bring all the action to Reels, and in other interesting ways too, which make watching and engaging with cricket fun over the next month,\" Manish Chopra, Director and Head of Partnerships, Facebook India (Meta), said in a statement. According to the company, every participating team has an AR effect hosted on the T20 World Cup for fans to use in their reels and stories. For users who want to cheer for the Indian cricket team, there is also an anthem for them to use in their reels and stories called 'Balla Chalaa' produced by Ram Sampath and Sona Mohapatra. The company also mentioned that a squad of creators are travelling to Australia to create engaging content with all participating cricketers and teams. \"Digital consumption of cricket through ICC events has consistently grown with Instagram and Facebook and bringing the ICC Men's T20 World Cup to Reels will help cricket fans engage even more deeply with the sport and their favourite cricketers,\" said Finn Bradshaw, the ICC's Head of Digital. Since 2019, Meta has the rights to digital content for ICC events including match recaps, in-play key moments, and other match and feature content on Facebook, the company noted.","content":null,"pubDate":"2022-10-21 13:40:53","image_url":"https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/10/2022_10$largeimg_198622672.JPG","source_id":"tribuneindia","country":["india"],"category":["sports"],"language":"english"},{"title":"'Kya ICC exist karta hai?': Salman Butt makes explosive remark on BCCI vs PCB debate","link":"https://www.dnaindia.com/cricket/report-kya-icc-exist-karta-hai-salman-butt-makes-explosive-remark-on-bcci-vs-pcb-debate-2994744","keywords":["Sports","Cricket"],"creator":["DNA Web Team"],"video_url":null,"description":"The former Pakistan captain asked if there was any ICC to have a look at it and then called for the Pakistan Cricket Board to show some strength.","content":null,"pubDate":"2022-10-21 13:36:00","image_url":null,"source_id":"dnaindia","country":["india"],"category":["sports"],"language":"english"},{"title":"ENG vs AFG head to head in T20 history: England vs Afghanistan T20 head to head records and stats","link":"https://thesportsrush.com/cricket-news-eng-vs-afg-head-to-head-in-t20-history-england-vs-afghanistan-t20-head-to-head-records-and-stats/","keywords":["Cricket","Afghanistan","England","ICC T20 World Cup 2022"],"creator":["Dixit Bhargav"],"video_url":null,"description":"ENG vs AFG head to head in T20: The SportsRush presents for you the Head to Head statistics for ENG vs AFG T20 World Cup match. England and Afghanistan will lock horns in the shortest format after more than six and a half years in the 14th match of the ongoing eighth edition of the… The post ENG vs AFG head to head in T20 history: England vs Afghanistan T20 head to head records and stats appeared first on The SportsRush.","content":"England and Afghanistan will lock horns in the shortest format after more than six and a half years in the 14th match of the ongoing eighth edition of the ICC T20 World Cup in Perth tomorrow. Going to be only the fifth international match between these two teams, it will also be the first Group 1 Super 12 match of the tournament. Although England appear to be the favourites on paper, one thing which the recently concluded First Round of the tournament has taught us is to not take any team lightly. Afghanistan? Certainly not. Hence, fans across the globs should brace themselves for a riveting contest between the English batters and Afghan bowlers (read spinners, in particular). In their past two T20I encounters, England had emerged as the victorious side on both the occasions. Having said that, their last match during ICC World Twenty20 2016 in Delhi was a close shave as Afghanistan had scored 127/9 in 20 overs in a 143-run chase. It’s Match Day tomorrow! AfghanAtalan will take on in their ICC Men’s opener in Perth. | | | — Afghanistan Cricket Board (@ACBofficials) Only players part of current squads have been considered above (most runs, wickets and catches).","pubDate":"2022-10-21 13:09:17","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"David Warner: Will try and get to the 2024 T20 World Cup","link":"https://www.thehansindia.com/sports/cricket/david-warner-will-try-and-get-to-the-2024-t20-world-cup-766315","keywords":["Sports,Cricket"],"creator":["Ishka"],"video_url":null,"description":"David Warner made his T20I debut in 2009He is Australia’s second-leading run-scorer in T20IsWarner was named the Player of the Series at last year’s T20 World Cup","content":"David Warner made his T20I debut in 2009David Warner made his T20I debut in 2009Australia's David Warner has said he aims to play in the T20 World Cup 2024, which will be held in West Indies and the United States of America. One of the most experienced batsmen among the current players across the globe, Warner is the second leading run-scorer for Australia in the T20Is, after captain Aaron Finch. The southpaw has scored 2,850 runs in 95 T20Is at a strike rate of 142 and average of 33.92. He has struck one century and 24 fifties in the shortest format for his country. Last year, Warner was named the Player of the Series in the T20 World Cup, which the Aussies won. They defeated New Zealand in the final in Dubai and claimed their maiden T20 world title. \"I'll keep playing T20s. I'll look to try and get to the 2024 World Cup,\" Warner was quoted as saying in an interview with Sydney Morning Herald.Meanwhile, Warner, who last played in the Big Bash League (BBL) back in 2013-14, recently signed a two-year deal with Sydney Thunder, further showing his intentions of extending his career in the shortest format. \"And I've got my goal set on playing next year in the 50-over World Cup (in India). So for now, we'll see how much Test cricket I've got left in me after this summer coming up and winter away. From there, I will make up my mind about whether I'll continue to play Test cricket and all three forms.\"I don't work too much on my skills these days. I work harder to keep as fit as I can and keeping as agile as I can. They're the most important things. I think longevity in the game is an important thing. If you want to play all three forms, you've got to remain fit and strong. And I've managed to do that,\" Warner added.T20 World Cup 2022 is underway with the group stage concluding on Friday. The Super 12s phase is set to go underway tomorrow (Oct. 22) with Australia beginning their title defense by taking on Kane Williamson's BlackCaps at Sydney Cricket Ground (SCG). Warner is expected to open the hosts' innings with skipper Finch.Earlier Cricket Australia confirmed Cameron Green was added to Finch's side as a replacement for wicketkeeper-batsman Josh Inglis, who was ruled out of the T20 World Cup 2022, after suffering an injury while playing golf, just three days before Australia's opening game. Inglis was hospitalised and he also needed more than half a dozen stitches.Green, who made his T20I debut earlier this year during Australia's tour of Pakistan in Lahore, has played seven T20Is, scoring 136 runs and picking up five wickets.","pubDate":"2022-10-21 13:08:02","image_url":"https://assets.thehansindia.com/h-upload/2022/10/21/500x300_1317313-david-warner.jpg","source_id":"thehansindia","country":["india"],"category":["sports"],"language":"english"},{"title":"NZ vs AUS head to head in T20: AUS vs NZ T20 head to head record and stats","link":"https://thesportsrush.com/cricket-news-nz-vs-aus-head-to-head-in-t20-aus-vs-nz-t20-head-to-head-record-and-stats/","keywords":["Cricket","Australia","ICC T20 World Cup 2022","New Zealand"],"creator":["Dixit Bhargav"],"video_url":null,"description":"AUS vs NZ T20 head to head record: The SportsRush presents for you the Head to Head statistics for AUS vs NZ T20 World Cup match. The 13th match of ICC T20 World Cup 2022 will be played between Australia and New Zealand in Sydney tomorrow. With all the Super 12 teams getting finalized now,… The post NZ vs AUS head to head in T20: AUS vs NZ T20 head to head record and stats appeared first on The SportsRush.","content":"The 13th match of ICC T20 World Cup 2022 will be played between Australia and New Zealand in tomorrow. With all the getting finalized now, Australia-New Zealand T20I will kick-start the second and a much-awaited round of the tournament. Set to be played under a , finalists of ICC T20 World Cup 2021 will be wanting to start their journey on a winning note. Readers must note that both Australia and New Zealand will be taking the field on Saturday on the back of losing their last T20I and only official warm-up match. Facing each other for the first time since T20 World Cup 2021 final at the Dubai International Cricket Stadium, both the teams form part of a high-profile clash on a Saturday evening. As far as their overall head-to-head record in this format is concerned, Australia have a significant lead to their name. New Zealand, who are yet to win a T20I in Australia, . While their last victory down under had come in the Test format, their last white-ball victory in Australia dates back to 2009. Steve O’Keefe joining the spin group at training today to share some of his knowledge from years of playing at the for and . — BLACKCAPS (@BLACKCAPS) Only players part of current squads have been considered above (most runs, wickets and catches).","pubDate":"2022-10-21 12:37:45","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"T20 World Cup 2022: Babar Azam delivers fiery pep talk ahead of India vs Pakistan clash","link":"https://www.indiatvnews.com/sports/cricket/t20-world-cup-2022-babar-azam-delivers-fiery-pep-talk-ahead-of-india-vs-pakistan-clash-2022-10-21-817940","keywords":null,"creator":null,"video_url":null,"description":"T20 World Cup 2022: The game of cricket is beautiful in every way, be it the stories on the field, legendary victories, or heartbreaking losses. The World Cup will start on October 22, 2022, and the opener will be played between Kane Williamson's New Zealand and Australia's Aaron Finch. As of now, all the spotlight is fixed upon India vs Pakistan clash that is all set to be played on Sunday, October 23, 2022. Amidst all the ongoing tussle between the Pakistan Cricket Board (PCB) and the Board of Control for Cricket in India (BCCI), the contest between both these rivals has certainly spiced up.","content":null,"pubDate":"2022-10-21 11:55:13","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"AUS vs NZ Dream11 prediction: Fantasy cricket tips for Australia vs New Zealand, Super 12 Match 13, T20 World Cup 2022","link":"https://www.dnaindia.com/cricket/report-aus-vs-nz-dream11-prediction-fantasy-cricket-tips-for-australia-vs-new-zealand-super-12-match-13-t20-wc-2994720","keywords":["Sports","Cricket"],"creator":["DNA Web Team"],"video_url":null,"description":"The defending champions have a strong squad for the tournament and they will back themselves to win the first match.","content":null,"pubDate":"2022-10-21 11:40:00","image_url":null,"source_id":"dnaindia","country":["india"],"category":["sports"],"language":"english"},{"title":"Watch: Zimbabwe Cricketer Takes Spectacular Catch, ICC Calls Him \"Superman\" - NDTV Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMihQFodHRwczovL3Nwb3J0cy5uZHR2LmNvbS90MjAtd29ybGQtY3VwLTIwMjIvemltYmFid2UtY3JpY2tldGVyLXRha2VzLXNwZWN0YWN1bGFyLWNhdGNoLWluLXQyMC13b3JsZC1jdXAtaWNjLWNhbGxzLWhpbS1zdXBlcm1hbi0zNDUyNDIx0gGLAWh0dHBzOi8vc3BvcnRzLm5kdHYuY29tL3QyMC13b3JsZC1jdXAtMjAyMi96aW1iYWJ3ZS1jcmlja2V0ZXItdGFrZXMtc3BlY3RhY3VsYXItY2F0Y2gtaW4tdDIwLXdvcmxkLWN1cC1pY2MtY2FsbHMtaGltLXN1cGVybWFuLTM0NTI0MjEvYW1wLzE?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Watch: Zimbabwe Cricketer Takes Spectacular Catch, ICC Calls Him \"Superman\"  NDTV SportsMatch Story | T20 WC: WI crash out; Ireland & Zimbabwe qualify for Super 12  CricbuzzRecent Match Report - Scotland vs Zimbabwe 12th Match, First Round Group B 2022/23  ESPNcricinfoSCO vs ZIM Live Score and Latest Updates, T20 World Cup 2022, Match 12: Zimbabwe Beat Scotland by Five Wickets to Enter Super 12  News18SCO vs ZIM Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update- ICC T20 World Cup 2022  Cricket AddictorView Full coverage on Google News","content":null,"pubDate":"2022-10-21 11:37:47","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"T20 World Cup: Pakistan batter taken to hospital after being hit on head at nets","link":"https://www.indiatvnews.com/sports/cricket/pakistan-batter-shan-masood-taken-to-hospital-after-being-hit-on-head-at-nets-t20-world-cup-2022-2022-10-21-817934","keywords":null,"creator":null,"video_url":null,"description":"The Pakistan cricket team suffered a major setback ahead of their match against India in the T20 World Cup. Pakistan's star player Shan Masood got injured during a practice session on Friday. He was immediately rushed to the hospital for a scan.","content":null,"pubDate":"2022-10-21 11:31:24","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"T20 World Cup 2022: Zimbabwe march into Super 12 for first time after beating Scotland by 5 wickets","link":"https://www.indiatvnews.com/sports/cricket/t20-world-cup-2022-zimbabwe-march-into-super-12-for-first-time-after-beating-scotland-by-5-wickets-2022-10-21-817930","keywords":null,"creator":null,"video_url":null,"description":"T20 World Cup 2022: The Zimbabwe Cricket team has stormed into the Super 12 stage after beating the Scotland side in the round 1 stage in T20 World Cup. The Zimbabwe side got the better of Scotland by 5 wickets in the final game of round 1 stage to book a berth in Super 12 for the first time. They have finished on the top spot and have now entered in Group 2 of the Super 12 stage along with Netherlands.","content":null,"pubDate":"2022-10-21 11:23:35","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"“It’s probably Australia in their own conditions”: Jos Buttler refuses to call England favourites ahead of T20 World Cup Super 12 match vs Afghanistan","link":"https://thesportsrush.com/cricket-news-its-probably-australia-in-their-own-conditions-jos-buttler-refuses-to-call-england-favourites-ahead-of-t20-world-cup-super-12-match-vs-afghanistan/","keywords":["Cricket","England vs Afghanistan","ICC T20 World Cup 2022","Jos Buttler"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"Jos Buttler has called the home side Australia the favourites to win the ICC T20 World Cup 2022 in their home conditions. Perth’s Optus Stadium will be hosting the ICC T20 World Cup Super-12 match between England and Afghanistan on Saturday. Both sides will be starting their campaign for this match. England were the favourites… The post “It’s probably Australia in their own conditions”: Jos Buttler refuses to call England favourites ahead of T20 World Cup Super 12 match vs Afghanistan appeared first on The SportsRush.","content":"Perth’s will be hosting the ICC T20 World Cup Super-12 match between England and Afghanistan on Saturday. Both sides will be starting their campaign for this match. England were the favourites to win the tournament last year, but they lost in the semi-final to New Zealand. This team is a bit different from last year as Jos Buttler is now the new captain of the side, and Alex Hales has replaced Jason Roy as Buttler’s opening partner. Jonny Bairstow can be a for the side, but the way Harry Brook has emerged into the scene is a great sight to watch. The return of Ben Stokes is also a huge boost for the side, whereas Mark Wood and Chris Woakes are also looking in great form lately. With the kind of firepower they have in their batting, England are considered the favourites to win the ICC T20 World Cup. However, captain Jos Buttler does not think the same. He said that they are a team of talented players who can win the game on their own, but they are not the favourites. Buttler insists that it is tough to call anyone the favourites in this format of the game, but believes that the Australian side will be the strongest one as they are playing in their home conditions. However, it is interesting that England recently defeated Australia in the T20I series in Australia. “No, far from it, to be honest. We are a dangerous team with a lot of talented players, who can win games on their own and that’s a huge thing in T20 cricket,” Jos Buttler told reporters. “It’s hard to be favourites I guess and if you had to choose one, it’s probably Australia in their own conditions being reigning champions.” Talking about the Afghanistan side, Buttler said that they will treat Afghanistan as a very tough opponent. He called them a fantastic side and said that any side with Rashid Khan in it cannot be taken lightly at all. Buttler insists that the English team will give them a lot of respect. “I see them as a really tough opponent. There are some fantastic players in their team and any side with Rashid Khan in T20 cricket is going to have a big say. So, we give them huge respect and we look forward to a competitive game,” Jos Buttler added.","pubDate":"2022-10-21 11:21:24","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"T20 WC | Who is the Aussie’s back-up wicketkeeper? – Finch Interesting information","link":"https://thenewsglory.com/t20-wc-who-is-the-aussies-back-up-wicketkeeper-finch-interesting-information/","keywords":["Sports","Australia","Cricket","India","T20 WC","T20 World Cup."],"creator":["The News Glory"],"video_url":null,"description":"Australian cricket team captain Aaron Finch has revealed who will be his team’s alternate wicket keeper in the ongoing T20 World Cup. Chances are, if you ask the name of the player he recommended, it is him. Josh Inglis, the alternate wicket-keeper batsman in Australia’s World Cup squad, was injured. He has been replaced by […]","content":"Australian cricket team captain Aaron Finch has revealed who will be his team’s alternate wicket keeper in the ongoing T20 World Cup. Chances are, if you ask the name of the player he recommended, it is him. Josh Inglis, the alternate wicket-keeper batsman in Australia’s World Cup squad, was injured. He has been replaced by all-rounder Cameron Green. After that, it was said that the Australian team had taken a big risk without a replacement wicketkeeper.","pubDate":"2022-10-21 11:13:09","image_url":null,"source_id":"thenewsglory","country":["india"],"category":["sports"],"language":"english"}]}