{"newsArray":[{"title":"Labuschagne happy for McDermott’s tone","link":"https://www.cairnspost.com.au/sport/cricket/labuschagne-happy-for-mcdermotts-tone/video/553d7b588d3e6ee76a5839955a3a07c2","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket: Marnus Labuschagne could not be happier team mate Ben McDermott after he pulled off a century against Pakistan.","content":null,"pubDate":"2022-04-01 21:45:21","full_description":null,"image_url":null,"source_id":"cairnspost","country":["australia"],"category":["sports"],"language":"english"},{"title":"Victoria fights back on Day 2 of final","link":"https://www.cairnspost.com.au/sport/cricket/victoria-fights-back-on-day-2-of-final/video/c0434eed051ab96cd823daa1f4931711","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket: Victoria's bowlers have drove the fight back in Day 2 of their final at the Waca ground, Perth.","content":null,"pubDate":"2022-04-01 21:45:20","full_description":null,"image_url":null,"source_id":"cairnspost","country":["australia"],"category":["sports"],"language":"english"},{"title":"“Stephen Curry or Rocco?! I’ll drink that cricket tea”: Klay Thompson gulps down a drink on Serge Ibaka’s show after being unable to select between his Splash Brother and his dog","link":"https://thesportsrush.com/nba-news-stephen-curry-or-rocco-ill-drink-that-cricket-tea-klay-thompson-gulps-down-a-drink-on-serge-ibakas-show-after-being-unable-to-select-between-his-splash-brother-a/","keywords":["Basketball","Klay Thompson","Serge Ibaka","Stephen Curry"],"creator":["Advait Jajodia"],"video_url":null,"description":"Serge Ibaka asked Klay Thompson to pick one between the two – Golden State Warriors teammate Stephen Curry and his dog Rocco. Klay Thompson and Stephen Curry are one of the most accomplished backcourt duos in NBA history. Being teammates for more than a decade now, Klay and Steph are always in-sync on the hardwood… The post “Stephen Curry or Rocco?! I’ll drink that cricket tea”: Klay Thompson gulps down a drink on Serge Ibaka’s show after being unable to select between his Splash Brother and his dog appeared first on The SportsRush.","content":"Serge Ibaka asked Klay Thompson to pick one between the two – Golden State Warriors teammate Stephen Curry and his dog Rocco. Klay Thompson and Stephen Curry are one of the most accomplished backcourt duos in NBA history. Being teammates for more than a decade now, Klay and Steph are always in-sync on the hardwood and have an extremely solid relationship off the floor. If you are an avid GSW fan, you’d surely know Thompson’s high level of affection for his pet dog. If there is one thing Klay is seen doing more than shooting the ball into the hoop, it is spending time with Rocco. Also Read: Warriors’ Klay Thompson shows absolute confidence in Stephen Curry, Draymond Green and himself, backs them to win a ring without a 4th star It would be criminal to force Klay to select among the two – his oldest teammate or his dog. Serge Ibaka, for one, really wanted to know the answer to this question. However, Klay’s response?! Purely priceless. Klay Thompson chooses to drink a glass full of cricket tea rather than selecting between Stephen Curry and Rocco On Ibaka’s show “How Hungry Are You”, the 6-foot-10 big man asked Thompson to pick one between Steph and Rocco. Unable to select one, Klay went ahead with the forfeit without giving it much thought. What was the forfeit you may ask?! Taking a sip of a glass of cricket (yes, the insect) tea. Here, have a look at Thompson’s wholesome act. Picking one of the two was practically impossible. Hence, drinking cricket tea, irrespective of how disgusting it may sound, seemed like the best option. Wise decision, Klay. Also Read: Warriors’ Stephen Curry saves his Splash Brother from embarrassment by picking up a FaceTime call on Serge Ibaka’s show The post “Stephen Curry or Rocco?! I’ll drink that cricket tea”: Klay Thompson gulps down a drink on Serge Ibaka’s show after being unable to select between his Splash Brother and his dog appeared first on The SportsRush.","pubDate":"2022-04-01 18:43:16","full_description":"Serge Ibaka asked Klay Thompson to pick one between the two – Golden State Warriors teammate Stephen Curry and his dog Rocco. Klay Thompson and Stephen Curry are one of the most accomplished backcourt duos in NBA history. Being teammates for more than a decade now, Klay and Steph are always in-sync on the hardwood and have an extremely solid relationship off the floor. If you are an avid GSW fan, you’d surely know Thompson’s high level of affection for his pet dog. If there is one thing Klay is seen doing more than shooting the ball into the hoop, it is spending time with Rocco. Also Read: Warriors’ Klay Thompson shows absolute confidence in Stephen Curry, Draymond Green and himself, backs them to win a ring without a 4th star It would be criminal to force Klay to select among the two – his oldest teammate or his dog. Serge Ibaka , for one, really wanted to know the answer to this question. However, Klay’s response?! Purely priceless. On Ibaka’s show “ How Hungry Are You ”, the 6-foot-10 big man asked Thompson to pick one between Steph and Rocco. Unable to select one, Klay went ahead with the forfeit without giving it much thought. What was the forfeit you may ask?! Taking a sip of a glass of cricket (yes, the insect) tea. Here, have a look at Thompson’s wholesome act. Picking one of the two was practically impossible. Hence, drinking cricket tea, irrespective of how disgusting it may sound, seemed like the best option. Wise decision, Klay. Also Read: Warriors’ Stephen Curry saves his Splash Brother from embarrassment by picking up a FaceTime call on Serge Ibaka’s show","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"“Trust yourself, even when no one else does”: Amit Mishra draws lessons from Umesh Yadav wearing Purple Cap in IPL 2022","link":"https://thesportsrush.com/cricket-news-trust-yourself-even-when-no-one-else-does-amit-mishra-draws-lessons-from-umesh-yadav-wearing-purple-cap-in-ipl-2022/","keywords":["Cricket","IPL 2022","KKR","Amit Mishra","Indian Premier League","Kolkata Knight riders","Umesh Yadav"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Amit Mishra draws lessons from Umesh Yadav: The veteran Indian spinner seems to be impressed by KKR pacer’s current form. India and Kolkata Knight Riders fast bowler Umesh Yadav has once again brought to light his white-ball credentials on the back of putting on display three consecutive impact-generating performances in Indian Premier League 2022. Having… The post “Trust yourself, even when no one else does”: Amit Mishra draws lessons from Umesh Yadav wearing Purple Cap in IPL 2022 appeared first on The SportsRush.","content":"Amit Mishra draws lessons from Umesh Yadav: The veteran Indian spinner seems to be impressed by KKR pacer’s current form. India and Kolkata Knight Riders fast bowler Umesh Yadav has once again brought to light his white-ball credentials on the back of putting on display three consecutive impact-generating performances in Indian Premier League 2022. Having opened the bowling in each of the three innings so far, Yadav has successfully managed to make early inroads into the opposition’s batting lineup. In addition to picking wickets at will in the ongoing 15th season of the biggest T20 competition across the globe, Yadav not giving away many runs has worked wonders for both his IPL career and the team. In the 12 overs that he’s bowled this season so far, Yadav’s 12 wickets have come at an average of 7.37, an economy rate of 4.91 and a strike rate of 9. Amit Mishra draws lessons from Umesh Yadav wearing Purple Cap in IPL 2022 Much like his former teammate Harbhajan Singh, veteran India spinner Amit Mishra has also been impressed by Yadav. From not finding a buyer in IPL 2021 auction to finding one in the third round of IPL 2022 mega auction, Yadav’s superb IPL comeback is a story for the ages. Third-highest wicket-taker in the IPL, Mishra had himself remained unsold in the auction this year. Not appearing to be giving up on his playing days, 39-year old Mishra has drawn inspiration from Yadav’s stellar IPL 2022 campaign thus far. Umesh Yadav was not picked in initial auction rounds And today he is one of the leading wicket takers of IPL. Moral : Trust yourself, even when no one else does. #KKRvsPBKS — Amit Mishra (@MishiAmit) April 1, 2022 Mishra, the last played of whose 68 matches for India had come in a form of a T20I against England in Bengaluru five years ago, has played 19 matches across formats with both Harbhajan and Yadav in the Playing XI. Having not played competitive cricket for almost a year now, it would be interesting to see when the leg-spinner will resume playing in domestic cricket. The post “Trust yourself, even when no one else does”: Amit Mishra draws lessons from Umesh Yadav wearing Purple Cap in IPL 2022 appeared first on The SportsRush.","pubDate":"2022-04-01 17:51:11","full_description":"Amit Mishra draws lessons from Umesh Yadav: The veteran Indian spinner seems to be impressed by KKR pacer’s current form. India and Kolkata Knight Riders fast bowler Umesh Yadav has once again brought to light his white-ball credentials on the back of putting on display three consecutive impact-generating performances in Indian Premier League 2022. Having opened the bowling in each of the three innings so far, Yadav has successfully managed to make early inroads into the opposition’s batting lineup. In addition to picking wickets at will in the ongoing 15th season of the biggest T20 competition across the globe, Yadav not giving away many runs has worked wonders for both his IPL career and the team. In the 12 overs that he’s bowled this season so far, Yadav’s 12 wickets have come at an average of 7.37, an economy rate of 4.91 and a strike rate of 9. Much like his former teammate Harbhajan Singh , veteran India spinner Amit Mishra has also been impressed by Yadav. From not finding a buyer in IPL 2021 auction to finding one in the third round of IPL 2022 mega auction, Yadav’s superb IPL comeback is a story for the ages. Third-highest wicket-taker in the IPL , Mishra had himself remained unsold in the auction this year. Not appearing to be giving up on his playing days, 39-year old Mishra has drawn inspiration from Yadav’s stellar IPL 2022 campaign thus far. Umesh Yadav was not picked in initial auction rounds And today he is one of the leading wicket takers of IPL. Moral : Trust yourself, even when no one else does. #KKRvsPBKS — Amit Mishra (@MishiAmit) April 1, 2022 Mishra, the last played of whose 68 matches for India had come in a form of a T20I against England in Bengaluru five years ago, has played 19 matches across formats with both Harbhajan and Yadav in the Playing XI. Having not played competitive cricket for almost a year now, it would be interesting to see when the leg-spinner will resume playing in domestic cricket.","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"IPL 2022: Umesh Yadav, Andre Russell Star As KKR Thrash PBKS To Go Top Of Table - NDTV Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMieWh0dHBzOi8vc3BvcnRzLm5kdHYuY29tL2lwbC0yMDIyL2trci12cy1wYmtzLXVtZXNoLXlhZGF2LWFuZHJlLXJ1c3NlbGwtc3Rhci1hcy1ra3ItdGhyYXNoLXBia3MtdG8tZ28tdG9wLW9mLXRhYmxlLTI4NTc4MzLSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"IPL 2022: Umesh Yadav, Andre Russell Star As KKR Thrash PBKS To Go Top Of Table  NDTV SportsLive Cricket Score: KKR vs PBKS, Match 8, IPL 2022 | Cricbuzz.com - Cricbuzz  CricbuzzDinesh Karthik is as cool as MS Dhoni, says RCB captain  Bangalore MirrorLive match blog - Punjab Kings vs KKR 8th Match 2022 - Cricket Insights  ESPNcricinfoVirat Kohli's hilarious expression after taking Sam Billings’ catch goes viral - WATCH video  DNA IndiaView Full coverage on Google News","content":null,"pubDate":"2022-04-01 17:49:13","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Kolkata Knight Riders vs Punjab Kings Highlights: Umesh Yadav, Andre Russell fire KKR to big win over PBK - Times of India","link":"https://news.google.com/__i/rss/rd/articles/CBMixAFodHRwczovL3RpbWVzb2ZpbmRpYS5pbmRpYXRpbWVzLmNvbS9zcG9ydHMvY3JpY2tldC9pcGwvdG9wLXN0b3JpZXMva29sa2F0YS1rbmlnaHQtcmlkZXJzLXZzLXB1bmphYi1raW5ncy1oaWdobGlnaHRzLXVtZXNoLXlhZGF2LWFuZHJlLXJ1c3NlbGwtZmlyZS1ra3ItdG8tYmlnLXdpbi1vdmVyLXBia3MvYXJ0aWNsZXNob3cvOTA1OTg2OTQuY21z0gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Kolkata Knight Riders vs Punjab Kings Highlights: Umesh Yadav, Andre Russell fire KKR to big win over PBK  Times of IndiaLive match blog - Punjab Kings vs KKR 8th Match 2022 - Cricket Insights  ESPNcricinfoLive Cricket Score: KKR vs PBKS, Match 8, IPL 2022 | Cricbuzz.com - Cricbuzz  CricbuzzVirat Kohli's hilarious expression after taking Sam Billings’ catch goes viral - WATCH video  DNA IndiaIPL 2022, KKR vs PBKS HIGHLIGHTS: Russell powers Kolkata to six-wicket win  Hindustan TimesView Full coverage on Google News","content":null,"pubDate":"2022-04-01 17:37:00","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Yorkshire out to change cricket after winter spent learning from mistakes","link":"https://www.theguardian.com/sport/2022/apr/01/yorkshire-out-to-change-cricket-after-winter-spent-learning-from-mistakes","keywords":["Yorkshire","Azeem Rafiq","Cricket","Sport","Race"],"creator":["Tanya Aldred"],"video_url":null,"description":"Darren Gough says the club ‘can't forget’ the Azeem Rafiq racism scandal but want ‘to make sure it doesn’t happen again’As the ground staff brushed the remaining snow from the outfield at Headingley, Yorkshire’s senior coaching team – interim managing director of cricket, Darren Gough, head coach, Ottis Gibson, and captain, Steve Patterson – sat in the cold press box to reflect on a tumultuous six months and the upcoming season.Thursday night’s extraordinary general meeting, which overwhelmingly approved the structural changes demanded by the ECB in the wake of the Azeem Rafiq racism scandal, has given the club some financial stability after the ban from hosting international cricket was lifted. Continue reading...","content":null,"pubDate":"2022-04-01 16:34:36","full_description":"A s the ground staff brushed the remaining snow from the outfield at Headingley, Yorkshire’s senior coaching team – interim managing director of cricket, Darren Gough, head coach, Ottis Gibson, and captain, Steve Patterson – sat in the cold press box to reflect on a tumultuous six months and the upcoming season. Thursday night’s extraordinary general meeting, which overwhelmingly approved the structural changes demanded by the ECB in the wake of the Azeem Rafiq racism scandal , has given the club some financial stability after the ban from hosting international cricket was lifted . The EGM, said to be held in a business-like atmosphere, approved the appointment of Lord Patel as chair, the appointment of six non-executive directors and removed the Graves Trust’s powers, despite the disdain of the former chair, Robin Smith. Gough, clad in Kukri-sponsored kit – Yorkshire lost their deal with Nike in the winter – spoke with emotion about the future of the club he first played for in 1989 as a bustling teenager. “When I took over in January I saw almost fear in the players’ faces and confusion, but I’ll tell you what, three months later what I have seen and witnessed, is a team that work for each other. They have worked their socks off to get into a position where they are excited about the season … and I am immensely proud of them , and I told them so before we went to Dubai [on a pre-season tour.]” “They understood that not just Yorkshire, but I think cricket in general, needs to change. Sport, society, needs to change. All I can do is put things in place, along with Ottis and the players, we’ve been educated on a daily basis, by people that write articles, by reading, by watching, by communicating.” “People are going to make mistakes, they’re going to continue to make mistakes. But it’s about forgiveness, it’s about education, it’s about moving forward together to make us great again. We want to be on the front and back pages for the right reasons, and we haven’t been. We’ve got an opportunity now with the people we’ve got in place for other cricket clubs to say, that’s how we want to do it going forward. We can only try and make that happen. It’s sad what’s happened, we can never take it back, we can’t forget what’s happened, it’s about learning from it, moving forward and make sure that situation doesn’t happen again.” Yorkshire have signed Pakistan’s Haris Rauf for the first six Championship games and his countryman leg-spinner Shadab Khan for the T20 Blast. Gibson is on a mission to persuade Adil Rashid to play some red-ball cricket. The club are also trying to sign an overseas batsman, with Gary Ballance on indefinite leave with ongoing mental health problems, Tom Kohler-Cadmore an injury doubt after a concussion in the Pakistan Super League and Joe Root unlikely to play until the end of April. Visiting teams can expect to find seamer-friendly conditions awaiting them. “We’d like some help for [Haris Rauf] off the surface for sure,” said Gibson. “I don’t think our batsmen would like to hear that. He bowls 150kph anyway so he doesn’t need that much help but when teams come to play here we want to make this this place a fortress.” The club remain unsure whether or not they will be docked Championship points, a possible sanction from the independent investigation led by the Cricket Disciplinary Commission. “To do it halfway through a season wouldn’t be the best,” said Gough, “but in football they’ve done it with Derby.” Meanwhile, the African-Caribbean Engagement programme is going to expand nationwide with ECB backing. The programme, first established by Surrey in 2020 under the leadership of Ebony Rainford-Brent, and aimed at engaging young people from the black community, will expand to Nottingham, Manchester, Leeds and an additional London borough, after successful uptake in Birmingham and Bristol in 2021. “Although we started small in south London, we always envisaged this programme was going to have a big national impact,” said Rainford-Brent. “To be in six cities and on both sides of the Thames in London within two years of existence proves that our model is starting to change the game.” The ECB funding comes as part of an update to its 12-step racism and diversity action plan established in the wake of Rafiq’s allegations which will also see the expansion of the ECB’s community talent champion programme, offer a further 3,000 foundation coaching bursaries and conduct a review of dressing-room culture in professional cricket.","image_url":"https://i.guim.co.uk/img/media/fe8c553ed59bf4a51c5a6207dfa66b1aa1102f83/293_677_4913_2948/master/4913.jpg?width=460&quality=85&auto=format&fit=max&s=a95fff0a8db11c8bf9b39cc6805eeadd","source_id":"theguardian","country":["united kingdom","india","singapore","canada"],"category":["sports"],"language":"english"},{"title":"Ramiz Raja to pitch four-nation tournament including India and Pakistan at ICC meet","link":"https://zeenews.india.com/cricket/ramiz-raja-to-pitch-four-nation-tournament-including-india-and-pakistan-at-icc-meet-2449900.html","keywords":null,"creator":null,"video_url":null,"description":"Pakistan Cricket Board boss Ramiz Raja has made his mind to table a proposal for a four-nation tournament involving India at the upcoming ICC Board Meeting in which BCCI will also take part.","content":null,"pubDate":"2022-04-01 16:31:00","full_description":"Pakistan Cricket Board boss Ramiz Raja has made his mind to table a proposal for a four-nation tournament involving India at the upcoming ICC Board Meeting in which BCCI will also take part. However, as per reports, BCCI is unlikely to play ball. As per the current ICC rule, a member board can host a tri-nation tournament at the most as only the global body has the right to organize an event which involves more than three countries. But Ramiz's 'white-paper' proposes that ICC run the tournament annually with a projected revenue of USD 750 million for the parent body from media rights and other commercial activities. India have been pencilled as one of the four participating sides in the four-Nations T20 Super League Series proposal, which Ramiz plans to table at the April 10 ICC Board meeting in Dubai. Australia and England are the other participating sides in the proposal, which, if goes through, will see the Asian neighbours compete at the highest level on an annual basis. The event host, the concept (white) paper says, will be decided amongst the four participants, with each participating side to stage the tournament on a rotation basis with ICC like its other global events running the tournament. However it has been learnt that BCCI is unlikely to relent. \"Our Futures Tours & Programme (FTP) is packed. Also the fact that there are lot of factors and as of now, there is no change in policy of playing them at ICC events. Also, we don't think ICC will be ready to organize a four-nation and Raja's proposal will be turned down,\" a senior BCCI official said. India and Pakistan have played each other only in ICC or ACC events since 2012 when the last bilateral white-ball series was held. Recently, BCCI secretary Jay Shah had stated in an interview to a foreign news agency that board is currently more focussed on honouring its bilateral commitments. \"The calender is choc-a-bloc and also we need to keep players physical and mental health in mind with so much of cricket being played,' the official said. According to proposal prepared by Ramiz, \"the quadrangular series will be played on a single-league basis around September/October, which is a low cricket period due to the eve of cricket seasons in Australia, India and Pakistan, and the tail-end of the cricket season in England. \"The proposal suggests a potential revenue of USD 750 million, which the PCB boss wants to be distributed amongst the participating nations and other ICC members through a distribution model,\" a PCB source told PTI. While Ramiz wants ICC to be the organizers of such an event, PCB sources feel that it will in no way undermine the global events. \"It is not an attempt to undermine the ICC Events or the ICC Events Cycle. The ICC tried the Super Series in 2005, so there is no harm in testing waters for another event,\" the source said. With PTI inputs","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL 2022: KKR's future 'bright' under Shreyas Iyer's captaincy, says Irfan Pathan","link":"https://www.thehansindia.com/sports/cricket/ipl-2022-kkrs-future-bright-under-shreyas-iyers-captaincy-says-irfan-pathan-736121","keywords":["Sports,Cricket"],"creator":["Ishka"],"video_url":null,"description":"KKR signed Shreyas Iyer at IPL 2022 mega auctionIyer captained DC for two and a half seasonsKKR have won and lost a game each this season","content":"KKR’s future ‘bright’ under Shreyas Iyer’s captaincy, says Irfan PathanKKR’s future ‘bright’ under Shreyas Iyer’s captaincy, says Irfan PathanUnder Shreyas Iyer's captaincy, the future of Kolkata Knight Riders (KKR) is \"bright\", according to former India pacer Irfan Pathan. KKR signed Iyer at the Indian Premier League (IPL) 2022 mega auction at INR 12.25 crore with the aim of naming him their captain. After leading Delhi Capitals (DC) for two and a half seasons, Iyer lost his captaincy when he withdrew from the first phase of IPL 2021 due to an injury. In his absence, DC appointed Rishabh Pant as their captain. The franchise decided to continue with the Delhi batsman even after Iyer returned to action in the UAE phase of IPL 2021. Iyer led DC in 41 matches, winning 21, losing 18, and tying the remaining two games. Iyer started his KKR stint with a fine win over reigning champions Chennai Super Kings (CSK) last week. KKR defeated CSK by six wickets at Wankhede Stadium. However, KKR followed that with a loss to Royal Challengers Bangalore (RCB). \"Shreyas Iyer is a brilliant captain. Remember, he picked up captaincy midway through the season like Rohit Sharma who was named Mumbai Indians' captain halfway through the season in IPL 2013. For Delhi Capitals, Shreyas started well under the supervision of coach Ricky Ponting and he kept improving his decision-making skills in his first stint as captain,\" Pathan said on Star Sports' 'Cricket Live'. Iyer defended his team's fighting attitude as they took the game to the last over after posting just 124 runs in the first innings. Before the start of the second inning, Iyer inspired his side by saying \"this game is going to define our character and attitude on the field no matter we defend or not.\" Pathan also said that Iyer's captaincy skills are more apparent than now and he is a \"players' captain\". \"His captaincy moves are coming to the fore prominently in this season and we will talk more about it as the tournament progresses. He's a players' captain. He backs the players at every turn and which is a good sign of a leader. The future of Kolkata is bright under his supervision and we've seen glimpses of it in the first couple of games,\" Pathan added further. KKR are currently playing Punjab Kings (PBKS) at Wankhede Stadium.","pubDate":"2022-04-01 16:17:31","full_description":"KKR’s future ‘bright’ under Shreyas Iyer’s captaincy, says Irfan Pathan Under Shreyas Iyer 's captaincy, the future of Kolkata Knight Riders (KKR) is \"bright\", according to former India pacer Irfan Pathan. KKR signed Iyer at the Indian Premier League (IPL) 2022 mega auction at INR 12.25 crore with the aim of naming him their captain. After leading Delhi Capitals (DC) for two and a half seasons, Iyer lost his captaincy when he withdrew from the first phase of IPL 2021 due to an injury. In his absence, DC appointed Rishabh Pant as their captain. The franchise decided to continue with the Delhi batsman even after Iyer returned to action in the UAE phase of IPL 2021. Iyer led DC in 41 matches, winning 21, losing 18, and tying the remaining two games. Iyer started his KKR stint with a fine win over reigning champions Chennai Super Kings (CSK) last week. KKR defeated CSK by six wickets at Wankhede Stadium. However, KKR followed that with a loss to Royal Challengers Bangalore (RCB). \"Shreyas Iyer is a brilliant captain. Remember, he picked up captaincy midway through the season like Rohit Sharma who was named Mumbai Indians' captain halfway through the season in IPL 2013. For Delhi Capitals, Shreyas started well under the supervision of coach Ricky Ponting and he kept improving his decision-making skills in his first stint as captain,\" Pathan said on Star Sports' 'Cricket Live'. Iyer defended his team's fighting attitude as they took the game to the last over after posting just 124 runs in the first innings. Before the start of the second inning, Iyer inspired his side by saying \"this game is going to define our character and attitude on the field no matter we defend or not.\" Pathan also said that Iyer's captaincy skills are more apparent than now and he is a \"players' captain\". \"His captaincy moves are coming to the fore prominently in this season and we will talk more about it as the tournament progresses. He's a players' captain. He backs the players at every turn and which is a good sign of a leader. The future of Kolkata is bright under his supervision and we've seen glimpses of it in the first couple of games,\" Pathan added further. KKR are currently playing Punjab Kings (PBKS) at Wankhede Stadium.","image_url":"https://assets.thehansindia.com/h-upload/2022/04/01/500x300_1284793-shreyas-iyer.jpg","source_id":"thehansindia","country":["india"],"category":["sports"],"language":"english"},{"title":"Kolkata Knight Riders vs Punjab Kings Live Score Ball by Ball, IPL 2022 Live Cricket Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/kolkata-knight-riders-vs-punjab-kings-live-score-over-match-8-t20-16-20-updates-2857545","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Kolkata Knight Riders vs Punjab Kings from Wankhede Stadium, Mumbai. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-04-01 15:49:57","full_description":"A dedicated team of experts bring you live score, live cricket score, live match update on Sports.NDTV.com . After 18.2 overs, Punjab Kings are 137. The live updates of Kolkata Knight Riders vs Punjab Kings scorecard is also available. It is the perfect platform to follow your favourite teams in Indian Premier League 2022. Keep a track on your favourite batsmen and bowlers through Indian Premier League 2022 today match, ball by ball commentary, Kolkata Knight Riders vs Punjab Kings, Kolkata Knight Riders vs Punjab Kings live score, Kolkata Knight Riders vs Punjab Kings scorecard. Follow the excitement of the Indian Premier League 2022 on Sports.NDTV.com as you can follow live match updates and live cricket score through our platform. Right then, Punjab have firepower in their bowling attack but they have only 137 to defend. Needless to say, picking early wickets will be the key as it is not going to be easy once the ball gets wet. Stay tuned as the chase will begin shortly. Umesh Yadav (4-1-23-4) comes up for a chat. The speedster says he is very happy with his performance. Shares that he has not played white-ball cricket for a long time but he is pleased he is able to do well. Mentions his job is to take wickets with the new ball and that is the role given to him and he tries his best. Adds that he feels it is a chasable score, the ball is skidding onto the bat unlike the wickets before and it should be chased. The ploy to bowl out four main bowlers by the 17th over backfired a little on Kolkata. Shivam Mavi had an ordinary day and went for aplenty. Andre Russell's introduction though in the 19th over resulted in wickets and Kolkata managed to bundle out Punjab to a below-par total. After losing a crucial toss, Punjab lost their skipper cheaply as well. That didn't affect them much though as Bhanuka Rajapaksa walked in with great intensity and played a stunning cameo to hand the momentum to Punjab. His departure, followed by the wicket of Shikhar Dhawan in the last over of the Powerplay, pushed Punjab on the back foot and the Kolkata spinners then took control in their hands. Shreyas Iyer was exceptional with his bowling changes. His spinners created pressure and then he kept bringing in the pacers to cash in. Umesh Yadav finished with a 4-wicket haul while Tim Southee grabbed a couple along with a stupendous catch to dismiss the dangerous Kagiso Rabada. Another classic case of aiming too high and getting too little. The dew factor is playing with the psyche of teams. Something similar happened with Kolkata against Bangalore and this evening, Punjab also suffered a similar fate although Kagiso Rabada's knock has given them something to defend! 18.2 overs (0 Run) OUT! RUN OUT! That is the end of the innings! Kolkata do keep Punjab under 150 as they are bowled out for 137, wasting 10 balls! Can't blame Smith here, he wanted the strike. Singh did not have the presence of mind. He guides it to point. Smith is off but Singh is late in taking off. Rana picks it up and throws it to the bowler who whips the bails off. Arshdeep Singh is the last batter. 18.1 overs (0 Run) OUT! WHAT A CATCH THAT IS! Brilliant! Take a bow, Tim Southee and the stand which was probably worrying Kolkata a little has been broken. Yet again a bowling change brings about a wicket, this time though it was compulsory. A slower one on middle, Rabada is early in the swing of his bat, he hits it high up in the air behind the bowler. Long on runs in, Southee from long off too sprints in and the bowler also goes for it. It seems like it would land safely but Southee dives after making a lot of ground and snaps it with a dive. Incredible. Who will bowl the 19th over? Andre Russell to steam in... 17.6 overs (6 Runs) SIX! Over the fence! Smith gets one over, not off the middle but he will take it. End of another big over and Punjab are well on track to getting to a competitive total. Shorter and on the body, Smith looks to pull, this flies off the top edge and goes over the fine leg fence. 17 from the over, 33 in the last two. 17.6 overs (1 Run) WIDE! Another one which is very short and very wide outside off. Smith tries to play the upper cut but misses. 17.5 overs (0 Run) That has just about missed the off pole! This lands on off and straightens. Smith swings but only connects with thin air. He is struggling to put the bat on the ball. He is on 3 off 11. Probably, he should just turn the strike over to Rabada. 17.5 overs (1 Run) WIDE! The idea was not bad though! Short and well wide outside off. Smith swings really hard but misses. 17.4 overs (0 Run) Swing and a miss! That was there in the slot! Angled into the pads, length. Smith looks to heave it but misses. 17.3 overs (1 Run) He is clobbering it, just the one this time! Shorter and on middle, this is slapped down to long on for one. 17.2 overs (4 Runs) FOUR! EDGY! This one races away to the fence! Full and outside off, Rabada swings, it goes more off the toe-end and down to the third man fence. Punjab won't mind how they come, as long as they come. Now 150 also looks possible. 17.1 overs (4 Runs) FOUR! Slammed! Rabada is enjoying himself out there! What a knock this is from him! Stand and deliver! On middle, shorter. He stays leg-side of the ball and hammers it over the bowler's head for a boundary. Three overs are left to be bowled for Kolkata and only Shivam Mavi is left with overs from those who have bowled this evening. Surely, either Venkatesh Iyer or Andre Russell will have to contribute, if not both. Here is Shivam Mavi to bowl the 18th. 16.6 overs (0 Run) Two dots to end but the damage was done earlier on! A full ball outside off, Smith looks to hit it through covers but gets an inside edge onto the pads. 16 from the over! 16.5 overs (0 Run) A yorker, Smith looks to jam it out on the off side but it goes off the inner half back to the bowler. 16.4 overs (1 Run) Just a single off the freebie! Gets it right, a yorker on middle, this is jammed down to long on for one. Not a bad result for Punjab as it gets Smith on strike. 16.4 overs (1 Run) NO BALL! Pressure is getting to the experienced Southee! A high full toss from him outside off. Rabada looks to guide it but misses. Free Hit coming up as it was well over the waist. 16.3 overs (6 Runs) SIX! BANG! Over the fence! Rabada is the unsung hero here so far for Punjab. Needs to keep going though. Rabada makes room and this is full and on middle. He powers it over the bowler's head for a biggie. 16.2 overs (4 Runs) FOUR! Brilliant from Rabada again! This is right in the slot too, full and on off, Rabada lofts it over covers to fetch yet another boundary. Southee is bowling hit-me balls here. 16.1 overs (4 Runs) FOUR! Up and over! Lovely shot, very elegant and Punjab will love a few more. Full and outside off, his is lofted over covers for a boundary. Who will bowl now? Tim Southee is back to bowl his final over. 15.6 overs (1 Run) A single to end then! End of a very economical spell by Varun Chakaravarthy! On middle, this is pushed down to long on for one. 15.5 overs (0 Run) Goes past the outside edge yet again. On off, this lands and spins away. Rabada is beaten yet again as he tries to defend. 15.4 overs (0 Run) BEATEN AGAIN! Flatter and outside off, Rabada looks to push at it but is beaten. 15.3 overs (0 Run) BEATEN! Fires it on off and angles it across, Rabada looks to defend but is beaten. 15.2 overs (0 Run) Outside off, left alone. 15.1 overs (1 Run) Smith steps out and whips it towards deep square leg for one. He holds the key now, can he play a gem of a knock and take them near 135?","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637844447891525680.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"SRK daughter name: Ananya Pandey and Aryan Khan supporting KKR at Wankhede Stadium","link":"https://thesportsrush.com/cricket-news-srk-daughter-name-ananya-pandey-and-aryan-khan-supporting-kkr-at-wankhede-stadium/","keywords":["Cricket","IPL 2022"],"creator":["Gurpreet Singh"],"video_url":null,"description":"SRK daughter name: KKR co-owner Shahrukh Khan’s kids and other noted celebrities were seen in the stands during KKR vs. PBKS IPL 2022 match. During the eighth match of the ongoing 15th season of the Indian Premier League at the Wankhede Stadium in Mumbai, Kolkata Knight Riders skipper Shreyas Iyer won the Toss and along… The post SRK daughter name: Ananya Pandey and Aryan Khan supporting KKR at Wankhede Stadium appeared first on The SportsRush.","content":"SRK daughter name: KKR co-owner Shahrukh Khan’s kids and other noted celebrities were seen in the stands during KKR vs. PBKS IPL 2022 match. During the eighth match of the ongoing 15th season of the Indian Premier League at the Wankhede Stadium in Mumbai, Kolkata Knight Riders skipper Shreyas Iyer won the Toss and along expected lines, opted to field first against the Punjab Kings (PBKS). While PBKS’ star overseas pacer Kagiso Rabada is set to play the first match for his franchise, KKR have dropped their Indian wicket-keeper batter Sheldon Jackson, to accommodate an extra pacer in Shivam Mavi, perhaps to cover up for Andre Russell’s Overs with the latter injuring himself during the previous match. Continuing with his purple patch in the tournament s far, KKR speedster Umesh Yadav was right on the money yet again, getting rid of Punjab skipper Mayank Agarwal (1 off 5) in the very first Over of the match. Sri Lanka’s Bhanuka Rajapaksa (31 off 9) then got off to a flier the moment he arrived at the crease, smashing Mavi for 22 runs during the 4th Over, but eventually getting dismissed during the ultimate delivery of the Over to waste solid start. SRK daughter name Amidst all the action-packed contest between the two sides, a fair share of the limelight was also hogged by the presence of KKR co-owner and Bollywood superstar Shah Rukh Khan’s star kids. Shah Rukh Khan’s daughter Suhana Khan, and son Aryan Khan were spotted supporting their franchise from the stands at the Wankhede Stadium, along with a few of their close ones including Bollywood actor Ananya Panday. Ananya Panday & Suhana Khan are here to cheer for KKR pic.twitter.com/HAtlEnjag2 — Sohom ᴷᴷᴿ (@AwaaraHoon) April 1, 2022 Korbo Lorbo Jeetbo #KKR #SuhanaKhan #KKRvsPBKS pic.twitter.com/SSNQUfhiDw — Suhana Khan (@SuhanaKhanClub) April 1, 2022 It is worth of a mention that both Suhana and Aryan were also seen taking active part during the IPL 2022 mega auction event in Bengaluru, which took place in February. Ananya Pandey and Aryan Khan supporting KKR Prince #AryanKhan, Princess #SuhanaKhan & #AnanyaPanday in the #Wankhede Stadium supporting our Knights #KKRvsPBKS #KKRHaiTaiyaar #IPL2022 #KKR #ShahRukhKhan #SriyanOfficialGroup pic.twitter.com/4JcPqmF2x2 — Sriyan Official Group (@TeamSriyan) April 1, 2022 cameraman mood mein hai pic.twitter.com/jj7XefiLIM — gautam (@itzgautamm) April 1, 2022 For more Cricket-related news, click here. The post SRK daughter name: Ananya Pandey and Aryan Khan supporting KKR at Wankhede Stadium appeared first on The SportsRush.","pubDate":"2022-04-01 15:23:58","full_description":"SRK daughter name: KKR co-owner Shahrukh Khan’s kids and other noted celebrities were seen in the stands during KKR vs. PBKS IPL 2022 match. During the eighth match of the ongoing 15th season of the Indian Premier League at the Wankhede Stadium in Mumbai, Kolkata Knight Riders skipper Shreyas Iyer won the Toss and along expected lines, opted to field first against the Punjab Kings (PBKS). While PBKS’ star overseas pacer Kagiso Rabada is set to play the first match for his franchise, KKR have dropped their Indian wicket-keeper batter Sheldon Jackson to accommodate an extra pacer in Shivam Mavi, perhaps to cover up for Andre Russell’s Overs with the latter injuring himself during the previous match. Continuing with his purple patch in the tournament so far, KKR speedster Umesh Yadav was right on the money yet again, getting rid of Punjab skipper Mayank Agarwal (1 off 5) in the very first Over of the match. Sri Lanka’s Bhanuka Rajapaksa (31 off 9) then got off to a flier the moment he arrived at the crease, smashing Mavi for 22 runs during the 4th Over, but eventually getting dismissed during the ultimate delivery of the Over to waste solid start. Amidst all the action-packed contest between the two sides, a fair share of the limelight was also hogged by the presence of KKR co-owner and Bollywood superstar Shah Rukh Khan’s star kids. Shah Rukh Khan’s daughter Suhana Khan, and son Aryan Khan were spotted supporting their franchise from the stands at the Wankhede Stadium, along with a few of their close ones including Bollywood actor Ananya Panday. Ananya Panday & Suhana Khan are here to cheer for KKR 💜💜 pic.twitter.com/HAtlEnjag2 — Sohom ᴷᴷᴿ (@AwaaraHoon) April 1, 2022 Korbo Lorbo Jeetbo #KKR 💛 #SuhanaKhan #KKRvsPBKS pic.twitter.com/SSNQUfhiDw — Suhana Khan (@SuhanaKhanClub) April 1, 2022 It is worth of a mention that both Suhana and Aryan were also seen taking active part during the IPL 2022 mega auction event in Bengaluru, which took place in February. Prince #AryanKhan , Princess #SuhanaKhan & #AnanyaPanday in the #Wankhede Stadium supporting our Knights 💜 #KKRvsPBKS #KKRHaiTaiyaar #IPL2022 #KKR #ShahRukhKhan #SriyanOfficialGroup pic.twitter.com/4JcPqmF2x2 — Sriyan Official Group (@TeamSriyan) April 1, 2022 cameraman mood mein hai pic.twitter.com/jj7XefiLIM — gautam (@itzgautamm) April 1, 2022 For more Cricket-related news, click here .","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Bhanuka Rajapaksa retirement: Has Rajapaksa IPL player for PBKS retired from international cricket?","link":"https://thesportsrush.com/cricket-news-bhanuka-rajapaksa-retirement-has-rajapaksa-ipl-player-for-pbks-retired-from-international-cricket/","keywords":["Cricket","IPL 2022","KKR","Punjab Kings","Bhanuka Rajapaksa","Indian Premier League","Kolkata Knight riders","PBKS","Sri Lanka"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Bhanuka Rajapaksa retirement: The Sri Lankan wicket-keeper batter had announced international retirement earlier this year. During the eighth match of the ongoing 15th season of the Indian Premier League between Kolkata Knight Riders and Punjab Kings at the Wankhede Stadium, Punjab Kings wicket-keeper batter Bhanuka Rajapaksa chipped in with a crucial contribution for the second… The post Bhanuka Rajapaksa retirement: Has Rajapaksa IPL player for PBKS retired from international cricket? appeared first on The SportsRush.","content":"Bhanuka Rajapaksa retirement: The Sri Lankan wicket-keeper batter had announced international retirement earlier this year. During the eighth match of the ongoing 15th season of the Indian Premier League between Kolkata Knight Riders and Punjab Kings at the Wankhede Stadium, Punjab Kings wicket-keeper batter Bhanuka Rajapaksa chipped in with a crucial contribution for the second time in a row in his maiden season. Coming in to bat at No. 3 in the second over, getting his eyes in was the least of Rajapaksa’s priorities as he hit his first Tim Southee delivery over the cover region for a boundary. Having also hit his second ball for a boundary in the following Umesh Yadav over, Rajapaksa welcomed Kolkata Knight Riders pacer Shivam Mavi into the attack in the most brutal possible manner. A four off the first delivery was followed by as many as three consecutive sixes as the right-arm bowler looked clueless tonight. Mavi eventually had the last laugh by dismissing Rajapaksa in the same over but the same only happened after the left-handed batter scored a stroke-filled 31 (9) comprising of three fours and sixes each at a strike rate of 344.44. Bhanuka Rajapaksa retirement For the unversed, it is worth a mention that Rajapaksa had announced his international retirement earlier this year. A change made to judge the fitness criteria of a player by SLC (Sri Lanka Cricket) was the reason behind the 30-year old player opting out of international cricket. Following suggestions to reconsider his decision by many prominent Sri Lankan names including former captain Lasith Malinga, Rajapaksa withdrew his resignation only to not be considered for the subsequent tour of India. Having scored 74 in two IPL 2022 innings at a strike rate of 238.70, Rajapaksa couldn’t have pressed his case for a national recall in a better manner. While fitness standards can surely be improved, Rajapaksa’s potential has it in it to aid an already struggling Sri Lankan team. Bhanuka Rajapaksa IPL 2022 auction In what is his maiden IPL season, Punjab had bought Rajapaksa for his base price of INR 50 lakh during the mega auction held in Bengaluru earlier this year. The post Bhanuka Rajapaksa retirement: Has Rajapaksa IPL player for PBKS retired from international cricket? appeared first on The SportsRush.","pubDate":"2022-04-01 15:12:00","full_description":"Bhanuka Rajapaksa retirement: The Sri Lankan wicket-keeper batter had announced international retirement earlier this year. During the eighth match of the ongoing 15th season of the Indian Premier League between Kolkata Knight Riders and Punjab Kings at the Wankhede Stadium, Punjab Kings wicket-keeper batter Bhanuka Rajapaksa chipped in with a crucial contribution for the second time in a row in his maiden season. Coming in to bat at No. 3 in the second over, getting his eyes in was the least of Rajapaksa’s priorities as he hit his first Tim Southee delivery over the cover region for a boundary. Having also hit his second ball for a boundary in the following Umesh Yadav over, Rajapaksa welcomed Kolkata Knight Riders pacer Shivam Mavi into the attack in the most brutal possible manner. A four off the first delivery was followed by as many as three consecutive sixes as the right-arm bowler looked clueless tonight. Mavi eventually had the last laugh by dismissing Rajapaksa in the same over but the same only happened after the left-handed batter scored a stroke-filled 31 (9) comprising of three fours and sixes each at a strike rate of 344.44. For the unversed, it is worth a mention that Rajapaksa had announced his international retirement earlier this year. A change made to judge the fitness criteria of a player by SLC (Sri Lanka Cricket) was the reason behind the 30-year old player opting out of international cricket. Following suggestions to reconsider his decision by many prominent Sri Lankan names including former captain Lasith Malinga , Rajapaksa withdrew his resignation only to not be considered for the subsequent tour of India. Having scored 74 in two IPL 2022 innings at a strike rate of 238.70, Rajapaksa couldn’t have pressed his case for a national recall in a better manner. While fitness standards can surely be improved, Rajapaksa’s potential has it in it to aid an already struggling Sri Lankan team. In what is his maiden IPL season, Punjab had bought Rajapaksa for his base price of INR 50 lakh during the mega auction held in Bengaluru earlier this year.","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Kolkata Knight Riders vs Punjab Kings Live Score Ball by Ball, IPL 2022 Live Cricket Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/kolkata-knight-riders-vs-punjab-kings-live-score-over-match-8-t20-11-15-updates-2857477","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Kolkata Knight Riders vs Punjab Kings from Wankhede Stadium, Mumbai. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-04-01 14:59:40","full_description":"A dedicated team of experts bring you live score, live cricket score, live match update on Sports.NDTV.com . After 13.2 overs, Punjab Kings are 100/6. The live updates of Kolkata Knight Riders vs Punjab Kings scorecard is also available. It is the perfect platform to follow your favourite teams in Indian Premier League 2022. Keep a track on your favourite batsmen and bowlers through Indian Premier League 2022 today match, ball by ball commentary, Kolkata Knight Riders vs Punjab Kings, Kolkata Knight Riders vs Punjab Kings live score, Kolkata Knight Riders vs Punjab Kings scorecard. Follow the excitement of the Indian Premier League 2022 on Sports.NDTV.com as you can follow live match updates and live cricket score through our platform. 13.1 overs (2 Runs) 2 Wides! DRINKS! Kolkata are well and truly on top! They are almost into the tail and Punjab have not even crossed 100. Can they make quick work of the rest of the wickets? Punjab on the other hand, have to hope this pair takes them to a competitive score. Both can bat and will have to do well if their side are to get to a total around 150. An important passage awaits. 12.6 overs (0 Run) And again. Tim Southee hurls across another clever slower delivery, at 129.1 kph, Harpreet Brar feels for it and is again beaten. Top over from the Kiwi great! 12.5 overs (0 Run) Beaten! Southee serves an off cutter, around off, Brar pushes at it and misses. 12.4 overs (4 Runs) FOUR! Well played! Short in length, around off, angling in, Harpreet Brar leans back inside the crease and plays it very late to guide it towards third man for a boundary. 12.3 overs (1 Run) Width there outside off, short in length, Odean guides it down to third man for a run. 12.2 overs (0 Run) The batter has just blocked that from his crease. Odean Smith walks out to bat! He walks out with just under 8 overs to go. What can he do? 12.1 overs (0 Run) OUT! CAUGHT! Southee has two, his 250th T20 wicket and Kolkata continue to roar! Yet another great bowling change from Shreyas. The Kiwi serves it a touch short and around off at 127 kph, Khan hangs on the back foot to pull it over the leg side but gets a big top edge. Nitish Rana settles underneath it and takes the skier safely at mid-wicket. Punjab sink deeper! Change! Tim Southee comes back into the attack! 11.6 overs (6 Runs) SIX! Harpreet Brar finally connects one and connects it well. It's a sweet sixer. Fuller and outside off, Harpreet Brar gets down, fetches it from out there and hammers it all the way over mid-wicket for a flat biggie. 11.5 overs (0 Run) Hit on the pads again, third appeal in a row! The umpire shakes his head and Shreyas Iyer reviews. NOT OUT! Narine delivers it flat and around off, it skids back into the left-hander after landing. Brar plays down the wrong line as he attempts to defend off the front foot. Misses and gets rapped on the pads. The Ball Tracking shows that it's missing the leg stump. Kolkata waste one review. 11.4 overs (0 Run) Another inquiry from Narine. Fuller in length and around off, skidding in, Harpreet Brar stretches forward to sweep but misses. He is hit on the pads, Sunil appeals but the impact is outside off. 11.3 overs (0 Run) Appeal for an lbw but Narine is the only one doing so. Flighted delivery, full and around middle, skidding down, Brar tries to flick but misses. 11.2 overs (0 Run) Strides forward to a full ball again and pushes it to covers. 11.1 overs (0 Run) Slower through the air, full and outside off, Brar gets on the front foot to defend but is beaten. 10.6 overs (0 Run) Loopy delivery, full and on off, Khan also doesn't pick it up. He commits himself forward to defend and does so from the inner half of his bat. The Kolkata spinners are suffocating Punjab here with their accuracy. 10.5 overs (0 Run) Fuller and on off, driven back to the bowler. 10.4 overs (1 Run) Quicker one, the line is around off, Brar helps it in front of square on the leg side, a slight misfield and they cross. 10.3 overs (0 Run) Again Brar is beaten! Shorter this time, around off and turning away, Harpreet Brar pushes inside the line and misses. 10.2 overs (0 Run) Beaten! Brar is clueless there. Has no idea which way it will turn. Leans forward to defend but it turns the other way to beat the outside edge. 10.1 overs (0 Run) Loopy delivery, full and around off, Brar is on the front foot as he blocks.","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637844417720879989.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Kolkata Knight Riders vs Punjab Kings: IPL 2022 Live Cricket Score, Live Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/kolkata-knight-riders-vs-punjab-kings-live-score-over-match-8-t20-6-10-updates-2857402","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Kolkata Knight Riders vs Punjab Kings from Wankhede Stadium, Mumbai. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-04-01 14:57:39","full_description":"A dedicated team of experts bring you live score, live cricket score, live match update on Sports.NDTV.com . After 10.2 overs, Punjab Kings are 85/5. The live updates of Kolkata Knight Riders vs Punjab Kings scorecard is also available. It is the perfect platform to follow your favourite teams in Indian Premier League 2022. Keep a track on your favourite batsmen and bowlers through Indian Premier League 2022 today match, ball by ball commentary, Kolkata Knight Riders vs Punjab Kings, Kolkata Knight Riders vs Punjab Kings live score, Kolkata Knight Riders vs Punjab Kings scorecard. Follow the excitement of the Indian Premier League 2022 on Sports.NDTV.com as you can follow live match updates and live cricket score through our platform. 9.6 overs (0 Run) On middle, this is worked to mid-wicket. End of another top over from Narine. 9.5 overs (0 Run) Flatter and on middle, defended. 9.4 overs (1 Run) Angled into middle, Brar looks to defend, this one turns back in. It goes off the inner half through mid-wicket for one. Who will bat next? It's Harpreet Brar. 9.3 overs (0 Run) OUT! TIMBER! That is a beauty! Narine has the last laugh! Drags his length back, it lands on middle and spins away. Bawa is beaten all ends up as he looks to defend for the incoming angle but it goes past the outside edge and clips the off pole. Half the side back in the hut now. Punjab are in deep trouble now. 9.2 overs (4 Runs) FOUR! Timed brilliantly again! This should make Bawa feel a lot better, his first boundary. A half volley outside off, this is driven through covers for a boundary. 9.1 overs (2 Runs) Two more! Outside off, this is slapped through covers for two. Shahrukh Khan arrives. 8.6 overs (0 Run) OUT! TAKEN! Umesh Yadav comes on and Umesh Yadav strikes! That is a big wicket. Not sure if that was the right shot played by Liam! Yes, it may have been in the slot but the situation was not the right one to bring the big shots out. Livingstone though plays that way only. This is fuller and outside off, seems to be the slower one. Liam Livingstone swings, he does not time it that well and he holes out at long off where Southee takes it near the fence. Kolkata continue to remain on top. 8.5 overs (0 Run) That is beautifully bowled! A slower one and outside off, Liam Livingstone does not pick it, he is early in the drive, gets beaten. 8.4 overs (1 Run) Bawa is doing the right thing by turning the strike over to Liam! On middle, this is pushed down to long on for a run. 8.3 overs (1 Run) Gets away with the Free Hit! Goes full and wide outside off. Liam swings, that was in the slot, it goes off the outside edge down to third man for just a single. 8.3 overs (1 Run) Wide! Goes very wide now and outside off. Left alone. The siren goes off so it is not a wide but a NO BALL! Free-Hit coming up. 8.2 overs (4 Runs) FOUR! That has been hammered! It went just wide of the diving cover fielder but went very quickly. Outside off, this is hammered past cover and into the fence. A welcome boundary. 8.1 overs (1 Run) Yet another one! On middle, Bawa eases it down to long on for one. He is timing the ball well now. Strategic break. 8 overs of entertaining cricket and both teams have exchanged punches. Bhanuka Rajapaksa threatened to take the game away with his stunning knock but Kolkata hung in there and picked three wickets in the Powerplay. The scoring rate for Punjab is excellent at this stage but they will need a partnership to navigate them through the middle phase. Umesh Yadav returns for his third over after the break... 7.6 overs (1 Run) Another run! Bawa leans into this one and strokes it down to long off for a single. 7.5 overs (1 Run) On middle, this is nudged down to long on for one. 7.4 overs (0 Run) That really held to the surface! Flatter and on off, this one comes slowly off the surface. Liam plays a check-shot and it goes back to the bowler on the bounce. 7.4 overs (1 Run) WIDE! Slips this one down the leg side. Liam looks to flick but misses. 7.3 overs (1 Run) Angled into the pads, Bawa works it down to fine leg and takes one. 7.2 overs (0 Run) Just got in! This is slower and on off, Bawa guides it to point and wants a run. He takes off but is sent back. Bawa slips as he turns but dives to get back in safely. Direct hit would have been interesting. 7.1 overs (1 Run) On middle, this one turns back in. It is worked through mid-wicket for one. Change in bowling. It's time for Sunil Narine to show his magic with the ball. 6.6 overs (1 Run) Angled into the pads, Liam works it through square leg for a single. 6.5 overs (1 Run) Bawa gets off the mark! On off, he guides it past point for one. 6.4 overs (0 Run) Yet another dot! Flatter and on off, sticks to the surface a touch. Bawa looks to push it on the off side but it goes off the inner half to mid-wicket. 6.3 overs (0 Run) On off, this is guided to point. 6.2 overs (0 Run) Flatter and on middle, this is pushed back to the bowler. 6.1 overs (1 Run) Shorter and on middle, this is pushed down to long on for one. 5.6 overs (0 Run) Slower one and on off, Bawa pushes it to covers. A confident stroke from him to begin with, it will make him feel good as he got out on a duck in the last game. End of the first 6 and Kolkata are on top despite Punjab scoring 62 runs. As a bowling team, picking three wickets in the Powerplay is always gold. Raj Bawa will bat at number 5. 5.5 overs (0 Run) OUT! EDGED AND TAKEN! Dhawan has to walk back and Southee gets his first. Excellent change from Iyer, got Southee on for the last over of the Powerplay, he did go for a few but now gets the big fish. Rolls his fingers on this one and bowls it wide outside off. Dhawan goes after it with a big drive but there is extra bounce. It goes off the outside edge and just about carries to Sam Billings who takes a good low catch. 5.4 overs (4 Runs) FOUR! That goes just over! Dhawan steps out, and Southee bowls it wide outside off. Dhawan swings, it goes off the outer half and over point for a boundary. 5.3 overs (1 Run) Just above the mid-section! On middle, shorter, Liam Livingstone looks to pull but misses to get hit on the body. It rolls on the off side. A leg bye is taken. 5.2 overs (6 Runs) SIX! That is massive! Enough of sighters says Liam. He steps out, gets to the pitch of it and tonks it over the mid-wicket fence for a biggie. 5.1 overs (0 Run) Fuller and on middle, Liam pushes it to mid on. Good from Liam here, taking some time to get his eye in.","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637844416509285205.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL 2022, KKR vs PBKS, Live Score: PBKS In Trouble After Losing 2 Quick Wickets Against KKR - NDTV Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMiUGh0dHBzOi8vc3BvcnRzLm5kdHYuY29tL2lwbC0yMDIyL2lwbC0yMDIyLWtrci12cy1wYmtzLWxpdmUtc2NvcmUtdXBkYXRlcy0yODU3MDE50gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"IPL 2022, KKR vs PBKS, Live Score: PBKS In Trouble After Losing 2 Quick Wickets Against KKR  NDTV SportsMatch Preview - Punjab Kings vs KKR, Indian Premier League 2022, 8th Match  ESPNcricinfoKKR vs PBKS Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update- Tata IPL 2022  Cricket AddictorLive Cricket Score: KKR vs PBKS, Match 8, IPL 2022 | Cricbuzz.com - Cricbuzz  CricbuzzVirat Kohli's hilarious expression after taking Sam Billings’ catch goes viral - WATCH video  DNA IndiaView Full coverage on Google News","content":null,"pubDate":"2022-04-01 14:56:08","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL 2022, KKR vs PBKS Live Score: Rajapaksa departs after quickfire 31 - Hindustan Times","link":"https://news.google.com/__i/rss/rd/articles/CBMiuAFodHRwczovL3d3dy5oaW5kdXN0YW50aW1lcy5jb20vY3JpY2tldC9pcGwtMjAyMi1ra3ItdnMtcGJrcy1saXZlLWNyaWNrZXQtc2NvcmUta29sa2F0YS1rbmlnaHQtcmlkZXJzLXZzLXB1bmphYi1raW5ncy10MjAtaW5kaWFuLXByZW1pZXItbGVhZ3VlLW1hdGNoLTgtbGl2ZS11cGRhdGVzLTEwMTY0ODgwODc5NzMyNC5odG1s0gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"IPL 2022, KKR vs PBKS Live Score: Rajapaksa departs after quickfire 31  Hindustan TimesMatch Preview - Punjab Kings vs KKR, Indian Premier League 2022, 8th Match  ESPNcricinfoKKR vs PBKS Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update- Tata IPL 2022  Cricket AddictorWatch: Wanindu Hasaranga's Celebration Inspired By Paris Saint Germain Star Footballer Neymar Jr. In..  NDTV SportsFantasy Expert Picks: Wasim Jaffer's fantasy XI for Punjab Kings vs Kolkata Knight Riders  ESPNcricinfoView Full coverage on Google News","content":null,"pubDate":"2022-04-01 14:22:47","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Gough: Yorkshire want to be inclusive for everyone","link":"https://www.skysports.com/cricket/news/12040/12579565/darren-gough-says-yorkshire-want-to-be-inclusive-after-welcoming-changes-required-by-ecb","keywords":null,"creator":null,"video_url":null,"description":"Darren Gough says Yorkshire will be \"inclusive for everyone\" after welcoming changes required by the England and Wales Cricket Board (ECB) following racism allegations by Azeem Rafiq.","content":null,"pubDate":"2022-04-01 13:50:00","full_description":"Last Updated: 01/04/22 3:11pm Darren Gough says Yorkshire will be \"inclusive for everyone\" after welcoming changes required by the England and Wales Cricket Board (ECB) following racism allegations by Azeem Rafiq. Former Yorkshire captain Gough was appointed as managing director of cricket in January on an interim basis until the end of 2022, and revealed how Rafiq's testimony has been a wake-up call. Yorkshire County Cricket Club members have overwhelmingly voted in favour of structural changes required by the ECB that will allow international fixtures to be staged at Headingley . Please use Chrome browser for a more accessible video player \"It's been hard, but enjoyable,\" Gough said of his three months in the role. \"I think coming in and seeing the club on its knees really, and not with a great reputation, my job was to come in and purely concentrate on getting some morale back to the cricket side of things. \"Because the players, as you can imagine, were probably quite low. \"And I can remember that first conversation with them at the indoor nets, but the way they have worked for me over the last three months has been outstanding in difficult circumstances, with interim coaches. \"I think it's sport in general, and the world in general that needs to improve. Not just cricket. \"I think it was a wake-up call with Azeem's brave testimony. \"The club admitted it made huge mistakes, and now it's a case that I've come in and we're trying to make Yorkshire a club that people can be proud of. \"That people all around the world from all sports can look at us and say: 'That's how a cricket a club and an organisation should be run'. \"It's going to be hard work. We might have hiccups along the way, people might make mistakes, but it's about working together and making Yorkshire an inclusive place for all. \"It's going to take a long time to prove that we're going in the right direction. But already in three months I think the club's made huge strides.\" Lord Patel was appointed as chairman in November in view of leading the enforcement of wholescale change, and has since dismissed 16 members of the county's backroom staff including former director of cricket Martyn Moxon and first-team coach Andrew Gale. \"You can't forget what's happened, and we shouldn't forget what's happened,\" Gough added. \"But people have admitted their mistakes, and we want to make it a club people can be proud of. \"This team, from what I've seen so far, has got the right mentality, and we've got some great individuals who can help take this club forward. Please use Chrome browser for a more accessible video player \"I was delighted to get Otis [Gibson] in as head coach, who has made a big difference. \"I started in 1989, and obviously the world was a bit of a different place. From 1994 until 2004, I was very rarely here because I was always with England. \"But dressing rooms, I've always found and I've said this before, are the best places in the world. But also the most brutal places in the world. \"In everything: people having nicknames, people being called out. And people in offices all up and down the country now would probably have said stuff they wouldn't say in this day and age. \"And rightly so. It was never right, but the key word here is education. We've all been educated as we've got older and move on, and realised it's not acceptable. \"From this moment on, we'd like to believe that we can all move in the same direction - as players, coaches, members, an organisation - and make it a better place. \"We want everybody to be able to come here, and whether it be game-day experience, playing in our pathway, or playing at professional level, we want to make it inclusive for everyone.\" In November, Yorkshire and former England batsman Gary Ballance admitted using a racial slur towards Rafiq. Ballance released a statement in which he accepted he was responsible for some of the offensive and derogatory terms that Rafiq revealed he was subjected to during his time at Headingley. Please use Chrome browser for a more accessible video player The 31-year-old referenced his \"incredibly close relationship\" with Rafiq during their time together at the club, saying both men \"said things privately to each other which were not acceptable\" but made it clear he had remorse for his part in those exchanges. Gough confirmed that Ballance will remain part of the playing squad at Yorkshire, but is currently taking time out of the game for his mental health. \"The club made that decision again with Gary. But he is going to be part of our playing staff. \"Unfortunately for Gary, he's having time out of the game at the moment. \"I think everybody knows that with his mental health he wants some time out of the game, and as managing director of cricket I'd just like some respect for Gary during this period. \"It's very difficult for him, and we're going to support him in every way we possibly can. \"And when he's right to come back, he can come back and that's down to him. \"He's under no pressure from Yorkshire, we will support him in every way we can to get him back playing professional cricket.\"","image_url":"https://e1.365dm.com/21/12/1920x1080/skysports-darren-gough-yorkshire_5605808.jpg?20211205215901","source_id":"skysports","country":["united states of america","united kingdom","australia"],"category":["sports"],"language":"english"},{"title":"Kolkata Knight Riders vs Punjab Kings Live Score Ball by Ball, IPL 2022 Live Cricket Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/kolkata-knight-riders-vs-punjab-kings-live-score-over-match-8-t20-1-5-updates-2857256","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Kolkata Knight Riders vs Punjab Kings from Wankhede Stadium, Mumbai. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-04-01 13:38:10","full_description":"Follow the Indian Premier League 2022 live cricket score on Sports.NDTV.com . After 2.3 overs, Punjab Kings are 13/1. Get live score, ball by ball commentary and much more. Keep track of Indian Premier League 2022 today match between Kolkata Knight Riders and Punjab Kings. Everything related to Kolkata Knight Riders and Punjab Kings match will be available on Sports.NDTV.com . Stay updated with Kolkata Knight Riders vs Punjab Kings live score. Do check for Kolkata Knight Riders vs Punjab Kings scorecard. You can get scorecard updates, match related facts. Get quick live updates with ads, Sports.NDTV.com , which is the perfect destination for live cricket score. 2.2 overs (4 Runs) Four! 2.1 overs (1 Run) Around middle, on a length, Dhawan gives the charge and flicks it to deep mid-wicket for a single. 1.6 overs (4 Runs) FOUR! Up and over the infield! This is how Bhanuka Rajapaksa bats. It's full and outside off, the Sri Lankan gets forward and lofts it cleanly over covers for a boundary. 1.5 overs (1 Run) Goes full and around middle, Dhawan clips it away off his pads and it goes to deep square leg. They cross for a run. 1.4 overs (0 Run) Fullish and around off, once again Dhawan plays a mistimed shot to mid off. 1.3 overs (0 Run) Shortish and on off, Dhawan steps down the track to punch but mistimes it towards covers. 1.2 overs (0 Run) In the channel outside off, left alone. 1.1 overs (0 Run) Almost drags it on! Fuller in length, wide outside off, Dhawan tries to unveil a booming cover drive but gets an inside edge onto the pads. He searches for the ball for a while and then returns. Who will walk out to bat then now, also, who will bowl from the other end? Bhanuka Rajapaksa it is for Punjab whereas, Tim Southee it is for Kolkata. 0.6 over (0 Run) OUT! Trapped in front! Umesh Yadav strikes early and gets his 50th wicket in the Powerplay. Beautiful change in length. After bowling short for almost all over, Yadav decides to spear in a length ball around off. It lands and skids in at 141.2 kph, Mayank Agarwal tries to work it on the leg side but misses. He is rapped on the pads, they appeal and the finger goes up. Mayank knows that he is gone for all money and walks away without even thinking about the DRS. Early blow to Punjab! 0.5 over (0 Run) Umesh continues to be short with his length. Outside off, Mayank chops his attempted square cut to covers. 0.4 over (1 Run) Slightly short around leg, Dhawan taps it off his pads and sends it to deep mid-wicket. Shikhar is off the mark with a single. 0.3 over (1 Run) The length is short and the line is outside off, Mayank stays back and cuts it to deep point for a single. Punjab are underway! 0.2 over (0 Run) Back of a length, around middle and angling in, Mayank Agarwal works it on the leg side but fails to beat Tim Southee at square leg. 0.1 over (0 Run) Wow, Mayank wastes no time and tries to give himself room by stepping back. Umesh bowls it short and wide outside off, Agarwal flashes and misses. Yadav smiles. All in readiness now! We're done and dusted with the build-up. The players walk out to the centre. Punjab have a task to put a total on the board that can be defended in the wet conditions later in the evening. Shikhar Dhawan and Mayank Agarwal are the openers. Umesh Yadav, in scintillating form this season, will bowl the first over. Here we go... Anil Kumble, the head coach of Punjab, comes up for a chat. He says they were very confident in the last game with all the big hitters in and it was just a matter of adapting to the conditions and Shahrukh Khan and Odean Smith got them through. States they decided about the playing XI during the auction itself and they have an exciting bunch. Further adds that the overseas players are also joining now and it is a good team. Mentions they are taking one game at a time and it is good to begin with a win and they are looking forward to this game. Punjab (Playing XI) - Mayank Agarwal (C), Shikhar Dhawan, Liam Livingstone, Bhanuka Rajapaksa (WK), Odean Smith, Shahrukh Khan, Raj Bawa, Harpreet Brar, Kagiso Rabada (In for Sandeep Sharma), Arshdeep Singh, Rahul Chahar. Kolkata (Playing XI) - Ajinkya Rahane, Venkatesh Iyer, Shreyas Iyer (C), Nitish Rana, Sam Billings (WK), Andre Russell, Sunil Narine, Shivam Mavi (In for Sheldon Jackson), Umesh Yadav, Tim Southee, Varun Chakaravarthy. Mayank Agarwal, the skipper of Punjab, says they need to start well and assist the conditions and get going once they get their eye in. Mentions they are looking to tick a few boxes and will be looking to execute under pressure. Informs that Kagiso Rabada comes in and Sandeep Sharma sits out. Shreyas Iyer, the captain of Kolkata, says the reason for them bowling is the amount of dew that comes later on. Mentions the character and the attitude matter irrespective of the total they get on the board and they want to give it their all. Adds the players are focused to give their best and it has been really good in the last few games and they are looking forward to this game. Informs that Shivam Mavi comes in for Sheldon Jackson as they want to strengthen their bowling. Toss - Shreyas Iyer and Mayank Agarwal are out in the middle for the all-important toss. Given the trend so far, winning the toss could be half the battle. Iyer flips the coin, Agarwal calls 'Heads' but it has come down as 'Tails'. Kolkata elect to BOWL! We might just see Kagiso Rabada play his first game for Punjab here tonight. That will really bolster the bowling attack of Punjab. He is warming up at the moment. In fact, the fresh picture shows that the South African speedster has been given his Punjab cap. Punjab have started their campaign with a dominating win. They flexed their muscles by chasing down a 200-plus target and everyone is talking about the fearless nature of their batting group. Odean Smith has emerged as the new Jamaican giant and Kolkata are going to have their task cut out against him. Under Brendon McCullum's guidance, Kolkata themselves adopt a fearless approach while batting and this clash between two powerhouse batting line-ups will surely make the mercury rise. Stay tuned for more updates... The start time of the match is not far away, and we welcome you all for the coverage of the clash between Kolkata and Punjab at the Wankhede Stadium. So far, all the matches this season in Mumbai, across venues, have been won by the chasing team and that will make the toss very crucial. It's not been easy to bowl in the second innings and both teams would be hoping that the coin falls in their favour. Who will be lucky - Mayank or Shreyas? We will find out soon. ... MATCH DAY ...","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637844368826212056.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Watch: Pravin Tambe Chokes Up After Watching Biopic With KKR Squad - NDTV Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMiamh0dHBzOi8vc3BvcnRzLm5kdHYuY29tL2lwbC0yMDIyL3ByYXZpbi10YW1iZS1jaG9rZXMtdXAtYWZ0ZXItd2F0Y2hpbmctYmlvcGljLXdpdGgta2tyLXNxdWFkLXdhdGNoLTI4NTcxMzbSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Watch: Pravin Tambe Chokes Up After Watching Biopic With KKR Squad  NDTV SportsKaun Pravin Tambe movie review: Despite a fine knock by Shreyas Talpade, Hotstar biopic drops the ball  The Indian ExpressKaun Pravin Tambe? movie review: Engaging cricket drama based on an inspiring true story  FirstpostKaun Pravin Tambe? Review: Sports Biopic Is Both Entertaining And Engaging  NDTVKaun Pravin Tambe? Review: Shreyas Talpade’s sports saga is sincere but sluggish  Times of IndiaView Full coverage on Google News","content":null,"pubDate":"2022-04-01 13:01:37","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"ECB announces funding for young cricketers from diverse backgrounds","link":"https://sportstar.thehindu.com/cricket/ecb-announces-funding-for-young-cricketers-from-diverse-backgrounds/article38465128.ece","keywords":null,"creator":["Reuters"],"video_url":null,"description":"ECB on Friday issued an update to its action plan to tackle racism and discrimination, focused on plans to aid the progress of players from diverse or underprivileged backgrounds into professional cricket.","content":null,"pubDate":"2022-04-01 12:39:22","full_description":"The England and Wales Cricket Board (ECB) on Friday issued an update to its action plan to tackle racism and discrimination, focused on plans to aid the progress of players from diverse or underprivileged backgrounds into professional cricket. The plan was unveiled in November after a number of players, including former Yorkshire spinner Azeem Rafiq, alleged they were victims of institutional racism at their clubs. The ECB provided a first update to that plan in January. The ECB's latest update outlines plans to expand the African-Caribbean Engagement (ACE) programme, an independent charity looking to provide opportunities to cricketers from Black communities. The ACE programme, which was launched in Birmingham and Bristol in 2021, will be expanded to Nottingham, Manchester, Leeds and additional London boroughs. The update also includes an expansion to the Community Talent Champions programme, as well as the provision of 3,000 coaching bursaries and a monetary contribution to combat financial barriers from entry to the sport for young cricketers. Yorkshire gets green light to host internationals after reforms approved \"The bursaries will be targeted towards people from ethnically diverse communities, women and people with disabilities, offering the opportunity to gain the entry-level qualification required to lead coaching sessions,\" the ECB said in a statement. \"We are committing an initial amount of 1 million pounds ($1.31 million) to reduce financial barriers for young people from disadvantaged backgrounds to access the talent pathway, particularly at County Age Group level. \"We will work closely with counties over the coming months to identify ... where this funding will have the greatest impact, which could include the provision of equipment, support with travel costs, or access to facilities.\" The ECB also provided an update on its review of dressing room culture, the final report of which is due in September, saying it will be conducted by UK business management consultancy EY Lane4. The British government has supported a parliamentary committee's recommendation to limit public funding for cricket unless the sport can demonstrate continuous progress in getting rid of racism.","image_url":null,"source_id":"sportstar","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL 2022: Former India Star Criticises MS Dhoni For Running The Show Against Lucknow Super Giants - NDTV Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMimwFodHRwczovL3Nwb3J0cy5uZHR2LmNvbS9pcGwtMjAyMi9pbmRpYW4tcHJlbWllci1sZWFndWUtMjAyMi1mb3JtZXItaW5kaWEtc3Rhci1jcml0aWNpc2VzLW1zLWRob25pLWZvci1ydW5uaW5nLXRoZS1zaG93LWFnYWluc3QtbHVja25vdy1zdXBlci1naWFudHMtMjg1NzA5MtIBoQFodHRwczovL3Nwb3J0cy5uZHR2LmNvbS9pcGwtMjAyMi9pbmRpYW4tcHJlbWllci1sZWFndWUtMjAyMi1mb3JtZXItaW5kaWEtc3Rhci1jcml0aWNpc2VzLW1zLWRob25pLWZvci1ydW5uaW5nLXRoZS1zaG93LWFnYWluc3QtbHVja25vdy1zdXBlci1naWFudHMtMjg1NzA5Mi9hbXAvMQ?oc=5","keywords":null,"creator":null,"video_url":null,"description":"IPL 2022: Former India Star Criticises MS Dhoni For Running The Show Against Lucknow Super Giants  NDTV SportsLive Cricket Score: LSG vs CSK, Match 7, IPL 2022 | Cricbuzz.com - Cricbuzz  CricbuzzFleming on the dew factor: 'At no stage did CSK feel comfortable'  ESPNcricinfoIPL 2022: Lucknow turn giant killers with six-wicket win over CSK in high-scoring game  The Indian Express#LSGvCSK: कप्तान Jadeja के होते हुए Dhoni का मैच पर नियंत्रण, नहीं हैं अच्छे संकेत: Jadeja  CricbuzzView Full coverage on Google News","content":null,"pubDate":"2022-04-01 12:37:46","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL 2022: Former India Star Criticises MS Dhoni For Running The Show Against Lucknow Super Giants - NDTV Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMimwFodHRwczovL3Nwb3J0cy5uZHR2LmNvbS9pcGwtMjAyMi9pbmRpYW4tcHJlbWllci1sZWFndWUtMjAyMi1mb3JtZXItaW5kaWEtc3Rhci1jcml0aWNpc2VzLW1zLWRob25pLWZvci1ydW5uaW5nLXRoZS1zaG93LWFnYWluc3QtbHVja25vdy1zdXBlci1naWFudHMtMjg1NzA5MtIBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"IPL 2022: Former India Star Criticises MS Dhoni For Running The Show Against Lucknow Super Giants  NDTV SportsLive Cricket Score: LSG vs CSK, Match 7, IPL 2022 | Cricbuzz.com - Cricbuzz  CricbuzzFleming on the dew factor: 'At no stage did CSK feel comfortable'  ESPNcricinfo'CSK’s Calculation is Going Wrong': Gavaskar Lashes Out at Shivam Dube, Says 'He Hasn't Learnt Anything'  News18#LSGvCSK: कप्तान Jadeja के होते हुए Dhoni का मैच पर नियंत्रण, नहीं हैं अच्छे संकेत: Jadeja  CricbuzzView Full coverage on Google News","content":null,"pubDate":"2022-04-01 12:37:46","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Anya Shrubsole says England have 'nothing to lose' when they face Australia in World Cup final - Sky Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMikgFodHRwczovL3d3dy5za3lzcG9ydHMuY29tL2NyaWNrZXQvbmV3cy8yMDg3Ni8xMjU3ODY3Ny9hbnlhLXNocnVic29sZS1zYXlzLWVuZ2xhbmQtaGF2ZS1ub3RoaW5nLXRvLWxvc2Utd2hlbi10aGV5LWZhY2UtYXVzdHJhbGlhLWluLXdvcmxkLWN1cC1maW5hbNIBlgFodHRwczovL3d3dy5za3lzcG9ydHMuY29tL2FtcC9jcmlja2V0L25ld3MvMjA4NzYvMTI1Nzg2NzcvYW55YS1zaHJ1YnNvbGUtc2F5cy1lbmdsYW5kLWhhdmUtbm90aGluZy10by1sb3NlLXdoZW4tdGhleS1mYWNlLWF1c3RyYWxpYS1pbi13b3JsZC1jdXAtZmluYWw?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Anya Shrubsole says England have 'nothing to lose' when they face Australia in World Cup final  Sky SportsEngland peaking at right time in date with destiny against Australia in World Cup final  The IndependentAustralia eye seventh World Cup in 'Ashes' final  ReutersWomen's Cricket World Cup final: Sky Sports to make England vs Australia final free to watch  Sky Sports5 players to keep an eye on in the Women’s World Cup final  The IndependentView Full coverage on Google News","content":null,"pubDate":"2022-04-01 12:07:04","image_url":null,"source_id":"google","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Sky Sports to share Women's Cricket World Cup final with nation","link":"https://www.skysports.com/cricket/news/12040/12579404/womens-cricket-world-cup-final-sky-sports-to-make-england-vs-australia-final-free-to-watch","keywords":null,"creator":null,"video_url":null,"description":"Sky Sports will make the ICC Women’s Cricket World Cup final between England and Australia this Sunday available for the whole of the UK to watch on Sky Showcase (channel 106), PICK (159) and the Sky Sports YouTube channel.","content":null,"pubDate":"2022-04-01 12:00:00","full_description":"Last Updated: 01/04/22 1:00pm Sky Sports will make the ICC Women’s Cricket World Cup final between England and Australia this Sunday available for the whole of the UK to watch on Sky Showcase (channel 106), PICK (159) and the Sky Sports YouTube channel. Following England's incredible 137 run victory over South Africa yesterday, England Women are now one win away from defending the World Cup title against six-time winners Australia in the ultimate showdown with the first ball live from 2:00am on Sunday from Christchurch Australia. Everyone in the UK will be able to enjoy the live action with the build-up starting from 1:00am this Sunday on Sky Sports Main Event (401), the Sky Sports Cricket World Cup channel (404), Sky Showcase (106), PICK (159) and the Sky Sports YouTube channel. April 3, 2022, 1:00am Live on For a full preview of the match, please visit skysports/cricket Jonathan Licht, Managing Director of Sky Sports said: \"This is an exciting moment for the country where fans will hopefully get to see England lift the Cricket World Cup once again. \"We are pleased to be able to make another moment of national significant free for the whole nation to watch.\" The ICC Women's Cricket World Cup is part of a bumper day of women's sport on Sky Sports on 2nd April that will also include boxing, football, golf and netball. Sky's cricket coverage began in 1989 with the first ever ball-by-ball coverage of an overseas tour of West Indies. Over three decades Sky Sports has developed increasingly innovative and engaging coverage and invested more than £2bn in the sport helping drive better facilities, coaching and central contracts across the men's and women's game. Please use Chrome browser for a more accessible video player Last year saw Sky Sports launch The Hundred and celebrate 25 years of women's cricket. Sophie Ecclestone believes England are yet to play their best cricket ahead of the Women's World Cup final against Australia on Sunday. The spin bowler claimed a maiden international five-for as England powered into the final with a 137-run victory over South Africa in the semi-finals. Please use Chrome browser for a more accessible video player Ecclestone finished with figures of 36-6 as the Proteas were bowled for 156, in a match where Danni Wyatt top scored with a maiden World Cup century in England's 293 for eight. England opened the tournament with three consecutive losses, but a fifth-straight victory has seen Heather Knight's side set up a final with Australia, and Ecclestone believes England have not been at their best so far. \"I think when we lost three from three, there were a few tears in the changing room after the game,\" the 22-year-old spinner said. \"I think everyone was very disappointed with how we'd gone, but I think the turning point was having a few meetings to just say that we had nothing to lose now, so just put what we do in training out into a game and go out with no fear. \"We still haven't played our best cricket, so to get through to the final without playing our best cricket is obviously so good to see from this group.\"","image_url":"https://e1.365dm.com/22/04/1920x1080/skysports-womens-world-cup-final_5725188.jpg?20220401103122","source_id":"skysports","country":["united states of america","united kingdom","australia"],"category":["sports"],"language":"english"},{"title":"World of Cricket: Superstar stumper Marsh no more","link":"https://sportstar.thehindu.com/cricket/world-of-cricket-superstar-stumper-marsh-australia-pakistan/article38465066.ece","keywords":null,"creator":["Wriddhaayan Bhattacharyya"],"video_url":null,"description":"Rod Marsh suffered a heart attack in Queensland and spent the last few days in an induced coma at the Royal Adelaide Hospital.","content":null,"pubDate":"2022-04-01 11:51:16","full_description":"Caught Marsh, bowled Lillee — the phrase sums up the career of Australian great Rod Marsh, who passed away at 74. He suffered a heart attack in Queensland and spent the last few days in an induced coma at the Royal Adelaide Hospital. The wicketkeeper-batter, who kept to lethal fast bowlers such as Dennis Lillee and Jeff Thomson, held the record for the most dismissals (355) by a stumper in Test cricket for 14 years since his retirement in 1984; Ian Healy (395) surpassed him in 1998. Later, Adam Gilchrist (416) and South African Mark Boucher (555) created new records. Marsh flew behind the stumps to pluck catches from the slip cordon. He batted with a lot of intensity and had even hammered Lance Cairns for 22 runs in an over. He would sledge from behind his walrus-moustache, drink plenty of beer and keep wickets with aplomb. But he was a fair cricketer. He was the one who did not support Trevor Chappell bowling an underarm delivery to ensure victory in an ODI against New Zealand at the Melbourne Cricket Ground in 1981. Tame draw on a dead pitch Australia’s return to Pakistan for a Test series after 24 years began with a lifeless draw in Rawalpindi. The International Cricket Council rated the surface as “below average”. The match saw 1,187 runs with the loss of only 14 wickets. Imam-u-Haq scored two centuries (157 and 111 not out) in two innings. Azhar Ali (185) and Abdullah Shafique (136), too, piled centuries as Pakistan recorded 476/4 and 252/0 in its two essays. David Warner (68), Usman Khawaja (97), Marnus Labuschagne (90) and Steve Smith (78) hit vital fifties to lift Australia to 459. Pakistan’s left-arm spinner Nauman Ali was the only bowler who returned handsome figures of 6/107. Pakistan's Imam-ul-Haq walks back to pavilion after his dismissal for 157 runs during the second day of play of the first Test cricket match between Pakistan and Australia. - AFP The venue received one demerit point for the pitch. “The character of the pitch hardly changed over the course of five days. There has been no deterioration apart from the bounce getting slightly lower. In my view, this does not represent an even contest between bat and ball. In keeping with the ICC guidelines I rate this pitch as below average,” match referee Ranjan Madugalle said in his report. Australia interested to host India, Pakistan It has been a while since the last triangular series in ODI cricket. Cricket Australia is mulling over the revival of the tri-series format that hibernated in the age of T20 cricket. Pakistan Cricket Board chief Ramiz Raja had proposed an annual four-nation T20 series with India, Australia and England. Cricket Australia chief executive Nick Hockley said the board had not discussed that proposal but were open to hosting a tri-series. Pakistan and India meet only in ICC-sanctioned events due to strained relations between the countries. The last bilateral fixture was in 2012 when India hosted Pakistan for white-ball games. “I like the tri-series concept. It’s worked well in the past,” he told reporters in Rawalpindi, where Australia and Pakistan drew the first Test in their three-match series. “We’d be very open to hosting... matches. There are big communities of both India and Pakistan living in Australia. It’s a contest that everyone wants to see in world cricket, and if we can help support further opportunities we would love to do that,” he said. Zak Crawley turns the tide in Antigua The English cricket team would not like to remember 2021. In eight of the 15 Tests that year, the top five had collapsed for 67 runs or fewer. The script went according to West Indies’ plan in the first Test against England at North Sound, Antigua this fortnight. It had a healthy lead of 64 after the first two innings ; West Indies 375, England 311. When Kemar Roach trapped opener Alex Lees in front of his stumps at 24/1 in the third innings there was no expectation of an England fightback, but Zak Crawley had plans. The right-handed batter reached the three-figure mark ever since the 267 against Pakistan at the Ageas Bowl in 2020. Crawley pushed his average above 30 and hit 16 boundaries for an unbeaten 117 off 200 balls. He stitched an unbroken partnership of 193 off 324 balls with skipper Joe Root (84 not out) as the tourist ended the day with a lead of 82. The Test ended in a draw.","image_url":null,"source_id":"sportstar","country":["india"],"category":["sports"],"language":"english"},{"title":"India’s GS Lakshmi is match referee for Women’s World Cup final","link":"https://www.tribuneindia.com/news/sports/indias-gs-lakshmi-is-match-referee-for-womens-world-cup-final-382692","keywords":null,"creator":null,"video_url":null,"description":"Christchurch, April 1India's GS Lakshmi, the first woman ever in the ICC international panel of match referees, will be the match referee for the Women's World Cup final between England and Australia here on Sunday.Lakshmi also has the distinction of being the first woman match referee in men's ODIs, having stood in the role during the World Cup League 2 in the UAE in December 2020.The Women's World Cup final at the Hagley Oval will be overseen by four women match officials—the first such instance in cricket history.Australia and England are set to face off in the final after having outplayed West Indies and South Africa respectively in the semi-finals.South Africa's Lauren Agenbag and Kim Cotton of New Zealand have been named the two on-field umpires, while West Indies' Jacqueline Williams will officiate as the TV umpire.Cotton was the only match official during the 2020 Women's T20 World Cup final between Australia and India at the MCG, having stood as the on-field umpire alongside Ahsan Raza.Williams, who hails from Jamaica, became the first female to officiate as the third umpire in men's international cricket in 2020, having fulfilled the role during West Indies' three-match home T20I series against Ireland.Langton Rusere of Zimbabwe has been named the fourth umpire.\"As part of its strategic commitment to a gender-equitable sport, the ICC has focused on increasing the number of international female match officials, with women comprising eight of the 15 match officials at this event,\" the game's apex body said ahead of the summit showdown.","content":null,"pubDate":"2022-04-01 11:34:30","full_description":"PTI Christchurch, April 1 India’s GS Lakshmi, the first woman ever in the ICC international panel of match referees, will be the match referee for the Women’s World Cup final between England and Australia here on Sunday. Lakshmi also has the distinction of being the first woman match referee in men’s ODIs, having stood in the role during the World Cup League 2 in the UAE in December 2020. The Women’s World Cup final at the Hagley Oval will be overseen by four women match officials—the first such instance in cricket history. Australia and England are set to face off in the final after having outplayed West Indies and South Africa respectively in the semi-finals. South Africa’s Lauren Agenbag and Kim Cotton of New Zealand have been named the two on-field umpires, while West Indies’ Jacqueline Williams will officiate as the TV umpire. Cotton was the only match official during the 2020 Women’s T20 World Cup final between Australia and India at the MCG, having stood as the on-field umpire alongside Ahsan Raza. Williams, who hails from Jamaica, became the first female to officiate as the third umpire in men’s international cricket in 2020, having fulfilled the role during West Indies’ three-match home T20I series against Ireland. Langton Rusere of Zimbabwe has been named the fourth umpire. “As part of its strategic commitment to a gender-equitable sport, the ICC has focused on increasing the number of international female match officials, with women comprising eight of the 15 match officials at this event,” the game’s apex body said ahead of the summit showdown. #gs lakshmi #ICC #womens world cup","image_url":"https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/4/2022_4$largeimg_900265633.jpeg","source_id":"tribuneindia","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL 2022: Delhi Capitals test awaits Gujarat Titans","link":"https://www.tribuneindia.com/news/sports/ipl-2022-delhi-capitals-test-awaits-gujarat-titans-382691","keywords":null,"creator":null,"video_url":null,"description":"Pune, April 1They came out on top in the battle of newcomers but it will be a different ball game altogether for Gujarat Titans when they lock horns with Delhi Capitals in the IPL here on Saturday.Both Gujarat and DC started their campaign in the 15th edition of the lucrative league with wins and they would look to continue in the same vein at the Maharashtra Cricket Association Stadium.Injury-plagued DC will gain strength further in both bowling and batting with the likely inclusion of Lungi Ngidi, Mustafizur Rahman and Sarfaraz Khan, who have completed their three-day quarantine.The trio's return will bolster the Delhi outfit against an opponent that gave enough indications of its ability to not just compete with the best but also pull off the result it desires. In their five-wicket defeat, K L Rahul's Lucknow Super Giants came to know what the Titans are capable of.So irrespective of the four-wicket victory over five-time champions Mumbai Indians in their tournament opener, DC know it too well that they just cannot afford to take the foot off the pedal.The win against LSG first up is definitely a huge confidence booster, but in Delhi Capitals, Titans face a more seasoned opponents, who have established themselves as one of the top sides in recent years, with their swashbuckling batter-keeper Rishabh Pant as the leader on the field and Australian legend Ricky Ponting guiding them from behind the scene.With a strong top-order batting, besides a well-balanced bowling unit, the Capitals have all the tools required to embark on a winning run early on in the competition, so they certainly start as favourites against Titans.Besides, the fact that DC managed to overcome the Mumbai challenge without a few key players, including flamboyant Australian all-rounder David Warner and Mitchell Marsh and South African duo of Ngidi and Anrich Nortje, only adds to their confidence and makes the win more praiseworthy.While DC are going to strengthen their playing XI by making useful additions, the Titans on the other hand may not like to tinker with the combination that gave them their maiden win in their very first appearance.Australian recruit Matthew Wade, who was tasked with opening the batting alongside Shubman Gill, is eyeing a big one after failing to convert his 30 in the previous game into a more substantial contribution.In the absence of their top pacers, Delhi's bowling left a lot to be desired in the opener and it will look to do much better against Gujarat. Nortje hasn't played a competitive game since last year's T20 World Cup due to injury. The premier fast bowler, who missed the entire international home summer for the Proteas, was cleared to join the Capitals' setup for rehabilitation, but a timeline has not been set for his recovery and return.Teams (from):Delhi Capitals: Rishabh Pant (Captain), Axar Patel, Prithvi Shaw, Anrich Nortje, David Warner, Mitchell Marsh, Shardul Thakur, Mustafizur Rahman, Kuldeep Yadav, Ashwin Hebbar, Abhishek Sharma, Kamlesh Nagarkoti, KS Bharat, Mandeep Singh, Khaleel Ahmed, Chetan Sakariya, Lalit Yadav, Ripal Patel, Yash Dhull, Rovman Powell, Pravin Dubey, Lungi Ngidi, Vicky Ostwal, Sarfaraz Khan.Gujarat Titans: Hardik Pandya (Captain), Rashid Khan, Shubman Gill, Mohammed Shami, Lockie Ferguson, Abhinav Sadarangani, Rahul Tewatia, Noor Ahmed, Sai Kishore, Vijay Shankar, Jayant Yadav, Dominic Drakes, Darshan Nalkande, Yash Dayal, Alzarri Joseph, Pradeep Sangwan, David Miller, Wriddhiman Saha, Matthew Wade, Varun Aaron, B Sai Sudharshan.Match starts at 7:30 PM IST.","content":null,"pubDate":"2022-04-01 11:34:26","full_description":"PTI Pune, April 1 They came out on top in the battle of newcomers but it will be a different ball game altogether for Gujarat Titans when they lock horns with Delhi Capitals in the IPL here on Saturday. Both Gujarat and DC started their campaign in the 15th edition of the lucrative league with wins and they would look to continue in the same vein at the Maharashtra Cricket Association Stadium. Injury-plagued DC will gain strength further in both bowling and batting with the likely inclusion of Lungi Ngidi, Mustafizur Rahman and Sarfaraz Khan, who have completed their three-day quarantine. The trio’s return will bolster the Delhi outfit against an opponent that gave enough indications of its ability to not just compete with the best but also pull off the result it desires. In their five-wicket defeat, K L Rahul’s Lucknow Super Giants came to know what the Titans are capable of. So irrespective of the four-wicket victory over five-time champions Mumbai Indians in their tournament opener, DC know it too well that they just cannot afford to take the foot off the pedal. The win against LSG first up is definitely a huge confidence booster, but in Delhi Capitals, Titans face a more seasoned opponents, who have established themselves as one of the top sides in recent years, with their swashbuckling batter-keeper Rishabh Pant as the leader on the field and Australian legend Ricky Ponting guiding them from behind the scene. With a strong top-order batting, besides a well-balanced bowling unit, the Capitals have all the tools required to embark on a winning run early on in the competition, so they certainly start as favourites against Titans. Besides, the fact that DC managed to overcome the Mumbai challenge without a few key players, including flamboyant Australian all-rounder David Warner and Mitchell Marsh and South African duo of Ngidi and Anrich Nortje, only adds to their confidence and makes the win more praiseworthy. While DC are going to strengthen their playing XI by making useful additions, the Titans on the other hand may not like to tinker with the combination that gave them their maiden win in their very first appearance. Australian recruit Matthew Wade, who was tasked with opening the batting alongside Shubman Gill, is eyeing a big one after failing to convert his 30 in the previous game into a more substantial contribution. In the absence of their top pacers, Delhi’s bowling left a lot to be desired in the opener and it will look to do much better against Gujarat. Nortje hasn’t played a competitive game since last year’s T20 World Cup due to injury. The premier fast bowler, who missed the entire international home summer for the Proteas, was cleared to join the Capitals’ setup for rehabilitation, but a timeline has not been set for his recovery and return. Teams (from): Delhi Capitals: Rishabh Pant (Captain), Axar Patel, Prithvi Shaw, Anrich Nortje, David Warner, Mitchell Marsh, Shardul Thakur, Mustafizur Rahman, Kuldeep Yadav, Ashwin Hebbar, Abhishek Sharma, Kamlesh Nagarkoti, KS Bharat, Mandeep Singh, Khaleel Ahmed, Chetan Sakariya, Lalit Yadav, Ripal Patel, Yash Dhull, Rovman Powell, Pravin Dubey, Lungi Ngidi, Vicky Ostwal, Sarfaraz Khan. Gujarat Titans: Hardik Pandya (Captain), Rashid Khan, Shubman Gill, Mohammed Shami, Lockie Ferguson, Abhinav Sadarangani, Rahul Tewatia, Noor Ahmed, Sai Kishore, Vijay Shankar, Jayant Yadav, Dominic Drakes, Darshan Nalkande, Yash Dayal, Alzarri Joseph, Pradeep Sangwan, David Miller, Wriddhiman Saha, Matthew Wade, Varun Aaron, B Sai Sudharshan. Match starts at 7:30 PM IST.","image_url":"https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/4/2022_4$largeimg_738142997.JPG","source_id":"tribuneindia","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL 2022: KKR vs PBKS Dream11 Prediction Fantasy Cricket Tips, Probable XI","link":"https://www.indiatvnews.com/sports/cricket/ipl-2022-kkr-vs-pbks-dream11-prediction-fantasy-cricket-tips-probable-xi-2022-04-01-767129","keywords":null,"creator":null,"video_url":null,"description":"IPL 2022: KKR vs PBKS Dream11 Prediction Fantasy Cricket Tips, Probable XI Match Details","content":null,"pubDate":"2022-04-01 11:25:23","full_description":"KKR vs PBKS, 8th Match of 2022 Friday, April 1st 7:30 PM IST Wankhede Stadium, Mumbai Bhanuka Rajapaksa, , Shreyas Iyer, (C), Nitish Rana, Liam Livingstone, Andre Russell (VC), Odean Smith, , Varun Chakravarty, Arshdeep Singh , Venkatesh Iyer, Nitish Rana, Shreyas Iyer (c), Sam Billings, Sheldon Jackson (wk), Andre Russell, , , Umesh Yadav, Varun Chakravarthy Mayank Agarwal (c), Shikhar Dhawan, Liam Livingstone, Bhanuka Rajapaksa (wk), Odean Smith, Shahrukh Khan, , Arshdeep Singh, Harpreet Brar, Sandeep Sharma, Rahul Chahar Star Sports Network - Star Sports 1 and Star Sports 1HD, Star Sports Select 1 and Star Sports Select 1HD (Dugout). Hotstar Friday, April 1 7:30 PM IST Wankhede Stadium, Mumbai Andre Russell, Varun Chakravarthy, Venkatesh Iyer, Sunil Narine, Shreyas Iyer, , Nitish Rana, Shivam Mavi, Sheldon Jackson, Ajinkya Rahane, Rinku Singh, Anukul Roy, Rasikh Dar, Chamika Karunaratne, Baba Indrajith, Ashok Sharma, Pratham Singh, Abhijeet Tomar, Sam Billings, , Ramesh Kumar, Mohammed Nabi, Aman Khan, Umesh Yadav. Mayank Agarwal , Arshdeep Singh, Shikhar Dhawan, Kagiso Rabada, , Rahul Chahar, Shahrukh Khan, Harpreet Brar, Prabhsimran Singh, Jitesh Sharma, Ishan Porel, Liam Livingstone, Odean Smith, Sandeep Sharma, Raj Angad Bawa, Rishi Dhawan, Prerak Mankad, Vaibhav Arora, Writtick Chatterjee, Baltej Dhanda, Ansh Patel, Nathan Ellis, Atharva Taide, Bhanuka Rajapaksa, Benny Howell","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"‘He reminds me of Mohammad Sami. Gets a little erratic at times but has swing’ - Hindustan Times","link":"https://news.google.com/__i/rss/rd/articles/CBMipwFodHRwczovL3d3dy5oaW5kdXN0YW50aW1lcy5jb20vY3JpY2tldC9zaG9haWItYWtodGFyLWNvbXBhcmVzLXVtZXNoLXlhZGF2LXdpdGgtbW9oYW1tYWQtc2FtaS1nZXRzLWEtbGl0dGxlLWVycmF0aWMtYXQtdGltZXMtYnV0LWhhcy1zZWFtLWFuZC1zd2luZy0xMDE2NDg4MTAzNTQwMjQuaHRtbNIBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"‘He reminds me of Mohammad Sami. Gets a little erratic at times but has swing’  Hindustan Times\"He will not spare Shikhar Dhawan\" - Shoaib Akhtar tips Umesh Yadav to shine in IPL 2022 encounter between KKR and PBKS  SportskeedaIPL 2022: Back at KKR, Umesh Yadav making an impact  SportstarRCB vs KKR: Umesh Yadav Has Been Simply Outstanding, We See Him As Huge Asset - Brendon McCullum  Cricket AddictorUmesh Yadav’s white-ball course correction  Hindustan TimesView Full coverage on Google News","content":null,"pubDate":"2022-04-01 11:23:47","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Watch: Fielder Hits Batter On The Box. Don't Miss Commentator's Reaction","link":"https://sports.ndtv.com/cricket/european-cricket-series-fielder-hits-batter-on-the-box-with-a-throw-then-commentators-reaction-watch-2856873","keywords":null,"creator":null,"video_url":null,"description":"After a batter was hit on the box by a fielder's throw from the deep in the European Cricket Series, the commentator had a priceless reaction.","content":null,"pubDate":"2022-04-01 11:19:39","full_description":"The European Cricket Series often provides several entertaining moments and it was no different in the match between Indian Royals and Brothers XI Portugal on Thursday. The Royals were chasing 71 in six overs in a rain-hit match when opener MD Shaikat hit the ball towards midwicket, where the fielder misfielded. Shaikat and his opening partner Amandeep Khokhar decided to make the most of it and looked to run three. Shaikat was running to the crease at the non-striker's end, though, when disaster struck for him. As he was about to reach the crease, the throw from the fielder hit him square on the box, leaving Shaikat writhing in pain. While the batter was left hurting, the commentators burst out laughing as they saw the funny side to the incident. Even Shaikat's partner could not hide his smile as he walked over to check on him. Former England captain Michael Vaughan also found the video hilarious. He retweeted it and wrote \"Brilliant..\" Brilliant .. https://t.co/TrfqFbc0Zs Shaikat was out the very next delivery for 27 off 8. The match ended in a tie, with the Royals managing to score 70 in 6 overs. Promoted Earlier, Brothers XI Portugal scored 108/6 on the back of a 14-ball 29 from Balwinder Singh and a 13-ball 23 from Aman Manhas. Indian Royals scored 70/3 from their designated 6 overs, with Shaikat finishing as their top-scorer. Devender Mehla also chipped in with 15 off 11 as the match ended in a tie, with Brothers XI getting the Golden Ball.","image_url":"https://c.ndtvimg.com/2022-04/7p1jvv7o_ecs-throw-hits-batter-twitter_120x90_01_April_22.jpg","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"}]}