{"newsArray":[{"title":"FM vs ACE Dream11 Prediction: Fantasy Cricket Tips, Today's Playing 11, Player Stats and Pitch Report for Dubai D10 Division 1, Match 12","link":"https://www.sportskeeda.com/fantasy-cricket-mantra/fm-vs-ace-dream11-prediction-fantasy-cricket-tips-today-s-playing-11-player-stats-pitch-report-dubai-d10-division-1-match-12?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Fantasy Cricket Mantra"],"creator":["Ishaan Mahajan"],"video_url":null,"description":null,"content":null,"pubDate":"2022-11-01 21:34:14","image_url":"https://static.sportskeeda.com/editor/2022/11/a9210-16673253129867-1920.jpg","source_id":"sportskeeda","country":["india"],"category":["sports"],"language":"english"},{"title":"Cold-eyed Josball emerges at critical time for England at T20 World Cup | Barney Ronay","link":"https://www.theguardian.com/sport/blog/2022/nov/01/cold-eyed-josball-emerges-at-critical-time-for-england-at-t20-world-cup","keywords":["T20 World Cup 2022","England cricket team","New Zealand cricket team","T20 World Cup","Twenty20","Cricket","Sport"],"creator":["Barney Ronay"],"video_url":null,"description":"Key to victory against New Zealand were England’s seamers but Ben Stokes’s role in the team invites plenty of questionsThis was a very satisfying game of cricket, a mid-tournament group match in a rain-frazzled week that stayed alive for 39 of its 40 overs, played out in front of a semi-packed Gabba. In the broader sweep of things England’s 20-run defeat of New Zealand was another note in an excellent World Cup of deeper gears and genuine engagement.The lesson of these contests, which have felt jarringly real after the thin gruel of the year-round franchise circuit, is that the product works; that all the cricket is good, red or white ball, when it actually means something. Continue reading...","content":null,"pubDate":"2022-11-01 17:45:58","image_url":"https://i.guim.co.uk/img/media/745edb451fc33860cb6ae97193c3b16cd3e7e9e6/0_112_2342_1405/master/2342.jpg?width=460&quality=85&auto=format&fit=max&s=feddc0dac26d24c88a7a37c21420bc2f","source_id":"theguardian","country":["united kingdom","india","singapore","canada"],"category":["sports"],"language":"english"},{"title":"T20 Cricket: इस टूर्नामेंट में टूट गए सभी कीर्तिमान, एक ही मैच में बन गए रिकॉर्ड 501 रन","link":"https://www.indiatv.in/sports/cricket/t20-cricket-record-501-runs-in-single-match-titans-vs-knights-south-africa-domestic-tournament-2022-11-01-898475","keywords":null,"creator":null,"video_url":null,"description":"T20 Cricket: टी20 क्रिकेट के एक ही मैच में रिकॉर्ड 501 रन बनने का कारनामा देखने को मिला है।","content":null,"pubDate":"2022-11-01 17:37:34","image_url":null,"source_id":"indiatv","country":["india"],"category":["sports"],"language":"hindi"},{"title":"Ashwin and Karthik's exclusion from India's squads puts question mark over their white-ball future after T20 World Cup","link":"https://www.firstpost.com/firstcricket/sports-news/ashwin-and-karthiks-exclusion-from-indias-squads-puts-question-mark-over-their-white-ball-future-after-t20-world-cup-11553451.html","keywords":["First Cricket News"],"creator":["Amit Banerjee"],"video_url":null,"description":"Ashwin and Karthik's exclusion from India's squads puts question mark over their white-ball future after T20 World Cup","content":"While the Rohit Sharma-led Indian team and its billion-plus fans fret over weather interruptions in its remaining games as well as their qualification for the knockout stage of the T20 World Cup, the BCCI and its panel of selectors has already set its sights on the road ahead once the showpiece tournament comes to an end.The board after all, announced the squads on Monday for the tour of New Zealand as well as Bangladesh that take place after World Cup, making some interesting choices along with some shocking exclusions.🚨 NEWS 🚨: India’s squads for series against New Zealand and Bangladesh announced. #TeamIndia | #NZvIND | #BANvINDMore Details 👇https://t.co/YsToGDBozi— BCCI (@BCCI) October 31, 2022Among the big moves by the Chetan Sharma-led selection committee was giving Hardik Pandya his first big tour as captain while resting regular skipper Rohit along with other big names such as Virat Kohli and vice-captain KL Rahul. Additionally, it raised quite a few eyebrows by overlooking names such as Prithvi Shaw and Sarfaraz Khan, who have been setting the domestic circuit on fire with one blazing knock after another.What also did not go unnoticed was the absence of two senior players across the white-ball squads for the New Zealand and Bangladesh tours — Ravichandran Ashwin and Dinesh Karthik, both of whom have been getting regular game time in the ongoing T20 World Cup, and both having fought their way back after getting dropped from the white-ball setup.That perhaps is the selectors’ way of sending a message for the veteran Tamil Nadu duo, that maybe the time has come for the team to look past them when it comes to the shorter formats, and they should focus on franchise and domestic cricket, or in Ashwin’s case, the Test format.Selection reviews feat Indian cricketers pic.twitter.com/rAkk7dpTfC— mon (@4sacinom) October 31, 2022 Ashwin remains indispensable in India’s Test plans and is a tried-and-tested match-winner in home conditions. And credit should also go to him for reinventing himself in the shorter formats. Not only did Ashwin work on his variations, practicing leg-breaks in the nets besides his carrom balls and the stock off-breaks, he had also improved himself as a batter in the limited-overs cricket, forcing the selectors to sit up and take notice and even pick him over a more established limited-overs bowler such as Yuzvendra Chahal.Karthik too made a dream comeback in 2022, setting the stage on fire for Royal Challengers Bangalore during the IPL and playing a key role in its run to the playoffs, which in turn led to a clamour for his selection in the Indian team in its build-up to the World Cup. And in the first T20I against South Africa on 9 June, Karthik made his first appearance in the blue jersey since the 2019 World Cup semi-final against New Zealand. The dream would later be complete with his name featuring in India’s squad for the T20 World Cup Down Under.🗣️ 🗣️ Mr. @chetans1987, Chairman, All-India Senior Selection Committee speaks about how the workload management of the players is approached. #TeamIndia pic.twitter.com/RIYIHqslIN— BCCI (@BCCI) October 31, 2022Age, however, is not on their side and the pressure on an athlete increases drastically as the years go by when he or she goes past the 30-mark. Not everyone is able to maintain peak fitness and deliver on the field beyond 35 as Pakistan’s Misbah-ul-Haq did in the twilight of his career, or as the English pace duo of James Anderson and Stuart Broad are still doing with astonishing consistency.And the toll that the bygone years are taking on the senior players is visible — as great a bowler he is and despite his exceptional game awareness, Ashwin becomes something of a liability on the field, and the batters have shown a preference for targeting the area where he is positioned to get an extra run or three. One would then have to make up for this shortcoming with extraordinary performances with the ball, but Ashwin’s numbers in T20Is in the last three months (6 wickets; ave: 47.33; eco: 7.28) don’t exactly make him an indispensable member of the side.Always great to have such fans in the stands…it excites us like nothing else ♥️🙏🏻 https://t.co/e6lB6j97V2— DK (@DineshKarthik) October 27, 2022A similar trend can be seen with DK, who has only added to the pressure on himself with poor outings against Pakistan and South Africa and also injured himself while keeping against the Proteas which has thrown his participation in the crunch game against Bangladesh into doubt and has possibly reopened the door for Rishabh Pant.And given the sheer competition for wicketkeeping slots in Indian cricket at the moment, with the likes of Ishan Kishan and Sanju Samson also waiting in the wings besides Pant, it is always going to be tough for Karthik to stay relevant for too long.“It is not like that [the selectors are looking for other finishers]. The World Cup is going on and this is more about load management. We are focusing on who to rest and who to play. And the way he came to our side and the way he performed, he is always available to selectors but in the T20I games immediately after the World Cup, we are looking to try a different set of players.“Otherwise, the doors are open for him and he’s a brilliant player,” chief selector and former seamer Chetan Sharma had said following the announcement of the squads, justifying the decision to overlook the senior duo.For now, Ashwin and Karthik will have to make the most of whatever opportunities they get in the remainder of the India’s campaign Down Under, and hope those performances at least keep them in the selectors’ radar in the early months of 2023.Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-11-01 17:23:46","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/11/Dinesh-Karthik-Ravichandran-Ashwin-AFP-1.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"T20 World Cup 2022: Gautam Gambhir slams Pakistan captain Babar Azam for playing 'selfish' cricket","link":"https://www.sportskeeda.com/cricket-news/news-this-called-selfishness-gautam-gambhir-slams-pakistan-captain-babar-azam-playing-selfish-cricket?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Cricket News"],"creator":["Vinay Chhabria"],"video_url":null,"description":null,"content":null,"pubDate":"2022-11-01 17:07:53","image_url":"https://static.sportskeeda.com/editor/2022/11/8e149-16673027823359-1920.jpg","source_id":"sportskeeda","country":["india"],"category":["sports"],"language":"english"},{"title":"ZIM vs NED Dream11 Team Prediction, Match Preview, Fantasy Cricket Hints: Captain, Probable Playing 11s, Team News; Injury Updates For Today’s ZIM vs NED T20 World Cup 2022 Super 12 in Adelaide, 930 AM IST, November 2","link":"https://zeenews.india.com/cricket/zim-vs-ned-dream11-team-prediction-match-preview-fantasy-cricket-hints-captain-probable-playing-11s-team-news-injury-updates-for-today-s-zim-vs-ned-t20-world-cup-2022-super-12-in-adelaide-930-am-ist-november-2-2529778.html","keywords":null,"creator":null,"video_url":null,"description":"Zimbabwe vs Netherlands Dream11 Team Prediction Zimbabwe vs Netherlands T20 World Cup 2022 Super 12 Preview - Check My Dream11 Team, Best players list of ZIM vs NED, Netherlands Dream11 Team Player List, Zimbabwe Dream11 Team Player List, Dream11 Guru Tips, Fantasy Cricket Tips, Fantasy Cricket Tips, Fantasy Playing Tips.","content":"Zimbabwe will take on the Netherlands in the 34th match of the ICC T20 World Cup 2022 at Adelaide Oval, Adelaide on Wednesday. Zimbabwe are ranked fourth in the points table with one win against Pakistan and Netherlands are ranked six having lost all three matches in the Super 12 stage. Also Read: Zimbabwe vs Netherlands T20 World Cup 2022 Match No. 34 Preview, LIVE Streaming details: When and where to watch ZIM vs NED match online and on TV? Match Details Zimbabwe vs Netherlands T20 World Cup 2022 Super 12 Match No. 34 Venue: Adelaide Oval, Adelaide Date & Time: November 2 at 930 PM IST Live Streaming and TV details: Star Sports Network and Disney+ Hotstar website and app ZIM vs NED T20 World Cup 2022 Super 12 Match No. 34 Dream11 Prediction Keeper – Scott Edwards Batsmen – Max O’Dowd (C), Craig Ervine, Wesley Madhevere All-rounders – Sikandar Raza (VC), Sean Williams, Colin Ackermann Bowlers – Paul van Meekeren, Blessing Muzarabani, Richard Ngarava, Tei Chatara ZIM vs NED T20 World Cup 2022 Super 12 Match No. 34 Predicted 11 Zimbabwe: Regis Chakabva (wk), Craig Ervine ©, Wesley Madhevere, Sean Williams, Sikandar Raza, Milton Shumba, Ryan Burl, Tendai Chatara, Richard Ngarava, Brad Evans, Blessing Muzarabani Netherlands: Stephan Myburgh, Max O’Dowd, Bas de Leede, Tom Cooper, Colin Ackermann, Scott Edwards (c & wk), Roelof van der Merwe, Tim Pringle, Fred Klaassen, Paul van Meekeren, Brandon Glover, Logan van Beek Full Squad Netherlands Squad: Stephan Myburgh, Max ODowd, Tom Cooper, Colin Ackermann, Scott Edwards(w/c), Roelof van der Merwe, Tim Pringle, Logan van Beek, Fred Klaassen, Paul van Meekeren, Bas de Leede, Teja Nidamanuru, Brandon Glover, Vikramjit Singh, Shariz Ahmad, Timm van der Gugten Zimbabwe Squad: Wesley Madhevere, Craig Ervine(c), Milton Shumba, Sean Williams, Sikandar Raza, Regis Chakabva(w), Ryan Burl, Brad Evans, Richard Ngarava, Blessing Muzarabani, Tendai Chatara, Luke Jongwe, Wellington Masakadza, Tony Munyonga, Clive Madande","pubDate":"2022-11-01 16:43:00","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"Bangladesh captain Shakib Al Hasan says India have come to win World Cup, we ain't; faces netizens’ wrath","link":"https://www.tribuneindia.com/news/trending/bangladesh-captain-shakib-al-hasan-says-india-have-come-to-win-world-cup-we-aint-faces-netizens-wrath-446594","keywords":null,"creator":null,"video_url":null,"description":"Chandigarh, November 1 Bangladesh captain Shakib Al Hasan has created stir by saying that India have come to win the World Cup while they are not in fight. Ahead of the encounter between India and Bangladesh, which is scheduled to be played in Adelaide on Wednesday, Shakib issued this bizarre statement which is being perceived as disgrace for a player who is leading a significant team. \"We haven't come here to win the World Cup, but India have. If we win tomorrow, it will be an upset victory. India are favourites tomorrow,\" Shakib told reporters on the eve of the game. While Shakib had no hesitation in calling Suryakumar Yadav India's No. 1 batter in T20Is over the past year but he believed Bangladesh will need to concentrate on each and every Indian batter. \"If you aren't good, you won't be playing World Cup for India. It is a phenomenal batting order,\" he added. Shakib's statement didn't go well with cricket fans and the flamboyant all-rounded is facing massive backlash for making such a statement. We r here to do naggin dance ( source- shakib al hasan) — Harman 🇮🇳 (@Harman35673056) November 1, 2022 Shakib Al Hasan: \"India has come here to win the World Cup. We didn't come here to win the trophy.\"This cannot be the words of a commander leading a pack of players. Not a leadership trait for sure. Hugely disappointed by Shakib! #T20WorldCup #INDvBAN — Vicky Singh (@isinghvicky12) November 1, 2022 Shakib Al Hasan said, \"Two things are infinite: the universe and human stupidity; and I'm not sure about the universe.\" https://t.co/Vq9LunLTPG — —Bisma. (@nain_in_heads) November 1, 2022 omg..m shocked over shakib al hasan statement..its better to leave playing cricket..its not look good when a captain of national team talking like this😂😳 https://t.co/eaVbE8ONiF — Shaan Siddiqui (@ShaanSi89762900) November 1, 2022 Pakistan cricket fans to Shakib Al Hasan rn #INDvBAN pic.twitter.com/s8xIEPXgVX — Passionate ✨ (@TheArdentSoul) November 1, 2022 We are here for a picnic Rs Shakib Al Hasan — the Common Man (@propnetwork1) November 1, 2022 Aur maat do ipl contract Shakib ko — Durgesh kumar Jha (@djdurgesh2001) November 1, 2022 Isne pehle se hi haar maan li hai🤣 — Mr. Kautilya (@MrKautilya) November 1, 2022","content":"Tribune Web Desk Chandigarh, November 1 Bangladesh captain Shakib Al Hasan has created stir by saying that India have come to win the World Cup while they are not in fight. Ahead of the encounter between India and Bangladesh, which is scheduled to be played in Adelaide on Wednesday, Shakib issued this bizarre statement which is being perceived as disgrace for a player who is leading a significant team. \"We haven't come here to win the World Cup, but India have. If we win tomorrow, it will be an upset victory. India are favourites tomorrow,\" Shakib told reporters on the eve of the game. While Shakib had no hesitation in calling Suryakumar Yadav India's No. 1 batter in T20Is over the past year but he believed Bangladesh will need to concentrate on each and every Indian batter. \"If you aren't good, you won't be playing World Cup for India. It is a phenomenal batting order,\" he added. Shakib’s statement didn’t go well with cricket fans and the flamboyant all-rounded is facing massive backlash for making such a statement. We r here to do naggin dance ( source- shakib al hasan) Shakib Al Hasan: \"India has come here to win the World Cup. We didn't come here to win the trophy.\" This cannot be the words of a commander leading a pack of players. Not a leadership trait for sure. Hugely disappointed by Shakib! #T20WorldCup #INDvBAN Shakib Al Hasan said, \"Two things are infinite: the universe and human stupidity; and I'm not sure about the universe.\" https://t.co/Vq9LunLTPG omg..m shocked over shakib al hasan statement..its better to leave playing cricket..its not look good when a captain of national team talking like this😂😳 https://t.co/eaVbE8ONiF Pakistan cricket fans to Shakib Al Hasan rn #INDvBAN pic.twitter.com/s8xIEPXgVX We are here for a picnic Rs Shakib Al Hasan Aur maat do ipl contract Shakib ko Isne pehle se hi haar maan li hai🤣 #bangladesh #Cricket","pubDate":"2022-11-01 16:41:45","image_url":"https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/11/2022_11$largeimg_416031557.jpeg","source_id":"tribuneindia","country":["india"],"category":["sports"],"language":"english"},{"title":"Love for cricket doesn't buy you groceries: Sammy on West Indies' financial woes","link":"https://www.indiatoday.in/sports/cricket/story/love-for-cricket-doesnt-buy-you-groceries-darren-sammy-on-west-indies-crickets-financial-issues-2292105-2022-11-01?utm_source=rss","keywords":null,"creator":null,"video_url":null,"description":"Love for cricket doesn't buy you groceries: Sammy on West Indies' financial woes","content":null,"pubDate":"2022-11-01 16:27:09","image_url":null,"source_id":"indiatoday","country":["india"],"category":["sports"],"language":"english"},{"title":"Pro Kabaddi 2022 Highlights: Haryana Steelers defeat Bengaluru Bulls 29-27; Puneri Paltan beat Dabang Delhi 43-38","link":"https://www.firstpost.com/sports/pro-kabaddi-2022-live-puneri-paltan-vs-dabang-delhi-kc-haryana-steelers-vs-bengaluru-bulls-live-streaming-pkl-season-9-match-score-updates-11553201.html","keywords":["Sports"],"creator":["FP Sports"],"video_url":null,"description":"Pro Kabaddi 2022 Highlights: Haryana Steelers defeat Bengaluru Bulls 29-27; Puneri Paltan beat Dabang Delhi 43-38","content":"21:49 (IST)That's all from our Live coverage. The two matches of the day saw Haryana Steelers and Puneri Paltan reign supreme. The details below:Haryana Steelers 29-22 Bengaluru Bulls Puneri Paltan 43-38 Dabang DelhiDo tune in for tomorrow's doubleheader before a day break7:30 PM IST U Mumba vs Telugu Titans 8:30 PM IST Bengal Warriors vs Tamil Thalaivas21:45 (IST)Pro Kabaddi 2022 LIVE ScoreHaryana Steelers 29-22 Bengaluru Bulls FULL-TIME Haryana Steelers took a breather after taking 29-23 lead as minutes were left on the clock but Bulls made a last push as raider Bharat took out Bastami to weaken Steelers defence. Bulls responded quickly by taking further four points but they ran out of time.21:39 (IST)Pro Kabaddi 2022 LIVE ScoreHaryana Steelers 26-20 Bengaluru Bulls Sachin Narwal Super Raid takes out Haryana's Bastami and Nitin to allow Bengaluru Bulls a chance of getting back in the game as they soon cut down the lead to 23-20 but Bharat failed with his raid when it mattered the most as Jaideep Dahiya took him down with a Super Tackle.21:29 (IST)Pro Kabaddi 2022 LIVE ScoreHaryana Steelers 22-16 Bengaluru Bulls Bastami makes another tackle for Haryana before Neeraj takes hand touchpoint of the Iranian. Meetu then took out Neeraj with a touchpoint of his own.21:19 (IST)Pro Kabaddi 2022 LIVE ScoreHaryana Steelers 19-15 Bengaluru Bulls Bharat makes his raids count by taking back-to-back points while Bulls also responded well in the defence, allowing them to cut down the points gap to three. Amirhossein Bastami then earns two points for Haryana with back-to-back tackles.21:13 (IST)Pro Kabaddi 2022 LIVE ScoreHaryana Steelers 17-11 Bengaluru Bulls Bulls are all out! A multi raid of a do-or-die situation by Rakesh Narwal allowed the Steelers to stretch the lead. Meetu then did further damage to Bulls soon after inflict the all-out.21:06 (IST)Pro Kabaddi 2022 LIVE ScoreHaryana Steelers 11-9 Bengaluru Bulls Haryana's defensive domination allowed Steelers four-point gap while Meetu and other raiders steered them further ahead of points. But Narwal's fantastic dubki move, followed by Jaideep Dahiya dashing out Vikash cut Steelers lead to 2 points.20:57 (IST)Pro Kabaddi 2022 LIVE ScoreHaryana Steelers 7-4 Bengaluru Bulls Meetu provides early lead to Steelers with Super raid while Bharat and Saurabh Nandal keep Bulls in the game.20:07 (IST)Pro Kabaddi 2022 LIVE ScorePuneri Paltan 23-20 Dabang Delhi Puneri Paltans are all out! It happens right after the break as Naveen makes the most of Ashu Malik's good work by taking out Paltan's last-man standing in Mohit, who rather meekly surrendered to the raid.20:03 (IST)Pro Kabaddi 2022 LIVE ScorePuneri Paltan 21-14 Dabang Delhi Delhi make up ground with five points on the trot as Ashu Malik's super show from raids sparks the capital's side comeback. Paltan look to avoid an all out at the moment.19:59 (IST)Pro Kabaddi 2022 LIVE Score  Puneri Paltan 21-9 Dabang Delhi Mohit inflicts second all-out on Delhi Dabang by picking three points off his Super Raid. Paltan defense has backed up their raiders well by not allowing opening to the Delhi raiders.19:52 (IST)Pro Kabaddi 2022 LIVE ScorePuneri Paltan 15-8 Dabang Delhi Manjeet picks multiple points through raids to cut down the gap to 11-6 but Akash Shinde led Pune's charge through raiding while Sobmir has been unstoppable in defense to ensure Paltans maintain an upper hand.19:48 (IST)Pro Kabaddi 2022 LIVE ScorePuneri Paltan 7-2 Dabang Delhi Delhi are all out! Mohit takes out the solitary Delhi defender in Manjeet as Puneri Paltans take charge of the game.19:41 (IST)Pro Kabaddi 2022 LIVE ScorePuneri Paltan 4-2 Dabang Delhi Mohit earns Paltans a cushion of two points as his Super Raid takes down two Delhi defenders.19:33 (IST)Pro Kabaddi 2022 LIVE ScorePuneri Paltan 0-0 Dabang Delhi Dabang won the toss and have asked Paltan to raid first.19:32 (IST)Pro Kabaddi 2022 LIVE ScorePuneri Paltan 0-0 Dabang Delhi The match is also set to begin with both the sides facing each other for the 19th time. Puneris won nine of them and Delhi won eight while a game was tied.19:29 (IST)Pro Kabaddi 2022 Live ScorePuneri Paltan vs Dabang Delhi The line-up for the match is outPuneri Paltan: Mohammad Nabibaksh, Abhinesh Nadarajan, Sanket Sawant, Akash Shinde, Mohit Goyat, Sombir, Fazel AtrachaliDabang Delhi: Naveen Kumar, Ravi Kumar, Anil Kumar, Manjeet, Ashu Malik, Krishan, Vijay Kumar19:24 (IST)Hello and welcome to Live coverage of Pro Kabbadi matches today. There are two matches lined-up on Tuesday,Puneri Paltan vs Dabang Delhi (7:30 PM IST)Haryana Steelers vs Bengaluru Bulls (8:30 PM IST)Tuesday’s Vivo Pro Kabaddi Season 9 action offers us two exciting encounters at the Shree Shivchhatrapati Sports Complex, Balewadi in Pune. Puneri Paltan go up against Dabang Delhi K.C. in the first match and Haryana Steelers face Bengaluru Bulls in the second game.Puneri Paltan vs Dabang DelhiPuneri Paltan will be brimming with confidence as they head into the upcoming clash having stayed unbeaten in their last five games with four wins and a tie. They will look to make the most of their momentum and overwhelm a Dabang Delhi K.C. team that’s struggling at the moment. Aslam Inamdar has been their main man in attack with 71 raid points and Mohit Goyat has done well to chip in with 55 raid points. Meanwhile, Fazel Atrachali has galvanised Puneri Paltan’s defence and has scored 18 tackle points in six games. The likes of Sombir with 13 tackle points and Gaurav Khatri with 10 tackle points have also performed well when needed.After a strong start to the season that saw Dabang Delhi K.C. win their first five games, the defending champions have gone on to struggle and currently find themselves in a four-match losing slump. While they are still placed near the top of the standings, Dabang Delhi K.C. will be eager to snap their losing run soon and will need their star performers to step up on Tuesday. Naveen Kumar with 112 raid points has been the team’s talisman, while Ashu Malik and Manjeet have supported him in attack with 57 and 42 raid points respectively. Defensively, Krishan has been really impressive with 24 tackle points alongside Vishal, who has 22 tackle points to his name.(Pro Kabaddi)Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-11-01 16:20:15","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/11/Dabang-Delhi-Pro-Kabaddi.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"T20 World Cup: KL Rahul is a fantastic player, has our full support, says Rahul Dravid","link":"https://www.thehansindia.com/sports/cricket/t20-world-cup-kl-rahul-is-a-fantastic-player-has-our-full-support-says-rahul-dravid-767550","keywords":["Sports,Cricket"],"creator":["Ishka"],"video_url":null,"description":"KL Rahul has been struggling to score runsHe has scored 22 runs in the last 3 gamesIndia are set to take on Bangladesh on Wednesday","content":"KL Rahul has been struggling to score runsKL Rahul has been struggling to score runsIndia head coach Rahul Dravid has said he and captain Rohit Sharma are going to back the struggling KL Rahul ahead of their Super 12s clash with Bangladesh in the T20 World Cup 2022.Rahul, who has two T20I centuries for India, has been in poor form having scored 4, 9, and 9 so far in the three games. However, Dravid has said the World Cup has been challenging and Rahul is still suited best to open for India.\"I think he's a fantastic player and he's got a proven track record. He's done really well. I thought he's been batting superbly. These things can happen in a T20 game sometimes. It's been tough -- it's not been that easy for the sort of top-order batsmen. This tournament has been pretty challenging,\" Dravid said while addressing reporters at the press conference on Tuesday. \"I thought he was superb -- maybe a lot of you were not there, but in the practice game against Australia with Mitchell Starc and Patrick Cummins. It was a pretty good attack, and I thought he batted superbly that day, to get 50 or 60. I'm not sure exactly how much. Quite a few,\" added Dravid in the same conference.The former India captain went on to add that Rahul is \"actually playing well\" and they are aware that Rahul is \"really well suited for these kinds of conditions, these kinds of pitches.\"\"So he's actually playing really well. Just hoping it all clicks together over the next three or four games, and yeah, we know his quality, we know his ability, and he's really well suited for these kinds of conditions, these kinds of pitches. He's got a good all-around game. He's got a very good strong back-foot game which is obviously very much required in these conditions.\"So yeah, we're pretty confident and happy with the way he's hitting it,\" Dravid said further.KL Rahul at the Adelaide indoor nets pic.twitter.com/1IvolLBiyb— Vikrant Gupta (@vikrantgupta73) November 1, 2022 Speaking of the conversations with Rahul, Dravid revealed that the team has not faltered in his confidence in him.\"It's hard to get into exact details of what conversations you have with your players, but rest assured, I think both in words and in action, I think over the last year he knows he has our support. He's known that.\"There's been a lot of clarity about what our side is going to be, what our squad is going to be coming into this tournament, and we haven't wavered from that for a very long time. Yes, because we play a lot of cricket, you might see a lot of different people playing in different situations, in different games. There have been a lot of injuries, including him. He's had phases where he's unfortunately been injured,\" the head coach said.T20 World Cup 2022: A call on DK will be taken closer to the game, says Rahul DravidIn India's previous match in the T20 World Cup 2022, which ended in a loss against South Africa, wicketkeeper-batsman Dinesh Karthik walked off because of an injury, making way for Rishabh Pant to don the gloves. Dravid confirmed on Tuesday that Karthik was fine and the management would take a call to whether to play him or not closer to the game.\"He's pulled up pretty well today. It was unfortunate to have that spasm when he jumped to collect a bouncer. I think when he landed badly, he landed in a way that I think he just hurt his back a little bit. But with treatment this morning he's pulled up pretty well. He's come to training. So we'll be assessing it. \"We'll see how it goes, and we'll see how he pulls up tomorrow morning after a good practice session today. We'll put him through his paces and ensure that we've given him a good workout and then see how he pulls up tomorrow morning before making a final decision,\" added Dravid.Speaking of India's death bowling, Dravid says it was encouraging to see youngsters like Arshdeep Singh step up on occasion.\"Look, it's an area of our game that we've wanted to look to address, to look to get better at. Obviously, Bums [Jasprit Bumrah] was one of our guys who was penciled into bowl two of those overs. It was really heartening for us to see the way young Arshdeep Singh has developed over the last few months.\"If you were to ask me in November when I first took over and I had a list of bowlers in my mind, sure, Arshdeep was there, but he was -- certainly he hadn't had that kind of IPL. He had had one good IPL. But the way he's come along after that, he's come and forced his way into the side and done really well. So that's a fantastically heartening thing to see,\" India's head coach said further.India respect Bangladesh a lot, we believe they are a good team says DravidMeanwhile, Bangladesh captain Shakib Al Hasan shocked everyone when he said if his side were to beat India, it would be an upset. Reacting to the same, Dravid said that this World Cup has shown that one cannot take any team lightly.\"I think we respect them a lot. I think they're a very good team. I think this format and this World Cup has really shown us that honestly, you can't take any team lightly. Ireland showed that against England. We've seen enough games in this competition,\" Dravid, who succeeded Ravi Shastri as head coach, said.\"I think the fact that it is already such a short format. 20 overs is such a short format of the game. The margins of victory and defeat sometimes even if they're 12 runs, or 15 runs, it's actually just two hits. It's two hits one way or the other, and actually, that's the game. So it is already a shortened sort of rushed, noisy format, but it's very difficult to sometimes say who's a clear favourite in some of these games. \"On top of that, I think these conditions. I think these conditions have actually leveled the playing field to a large extent because the boundaries are certainly bigger, and some of those big hits which you sometimes expect in the subcontinent to just go for six and you just know that I'll be able to make up those runs, later on, it's not happening that easily. People are getting out,\" explained Dravid.\"I think it's really been a fantastic tournament from that perspective. Apart from the weather, I think it's been a terrific tournament in terms of just the nature of the games. No, we certainly don't take Bangladesh lightly. Our preparation, our planning will be as meticulous as it was against South Africa at Perth. No different,\" said Dravid.Following their loss to South Africa on Sunday (Oct. 30), India have dropped to second place in the Group 2 table. A victory against Bangladesh and Zimbabwe in the last two games will take them through to the semis.Touchdown Adelaide 📍 #TeamIndia | #T20WorldCup pic.twitter.com/l6GalMP0TI— BCCI (@BCCI) October 31, 2022 India and Bangladesh are scheduled to face off against each other on Wednesday (Nov. 1) at Adelaide Oval.","pubDate":"2022-11-01 15:57:08","image_url":"https://assets.thehansindia.com/h-upload/2022/11/01/500x300_1318724-kl-rahul.jpg","source_id":"thehansindia","country":["india"],"category":["sports"],"language":"english"},{"title":"T20 World Cup 2022: Over 90,293 at Melbourne Cricket Ground unite for Indian National Anthem | WATCH VIDEO","link":"https://www.indiatvnews.com/sports/cricket/t20-world-cup-2022-over-90-293-at-melbourne-cricket-ground-unite-for-indian-national-anthem-watch-video-2022-11-01-820565","keywords":null,"creator":null,"video_url":null,"description":"T20 World Cup 2022: It is a no-brainer that cricket is a religion in India and it unites the nation like nothing else does. It was a fanfare when India clashed with Pakistan on October 23, 2022, at the mighty Melbourne Cricket Ground. The men in blue playing the boys in green is always a special occasion and somehow invokes a sense of pride & patriotism in cricket fans. Due to political conflicts, India doesn't play Pakistan that often except for ICC (International Cricket Council) ICC events and the Asia Cup.","content":"It is a no-brainer that cricket is a religion in India and it unites the nation like nothing else does. It was a fanfare when India clashed with Pakistan on October 23, 2022, at the mighty Melbourne Cricket Ground. The men in blue playing the boys in green is always a special occasion and somehow invokes a sense of pride & patriotism in cricket fans. Due to political conflicts, India doesn't play Pakistan that often except for ICC (International Cricket Council) ICC events and the Asia Cup. In the 2021 edition of the ICC T20 World Cup, Pakistan defeated India by a margin of 10 wickets, but this was payback time. All of us saw how emotional was when the Indian National Anthem ended. He could feel the pride, the euphoria, the joy of representing the country and leading his troops on the biggest stage of them all, the stage of the T20 World Cup. It was not only Rohit Sharma who was singing the national, anthem that day but it was also a crowd of over 90,000 people who joined him and shared the moment. Recently, a video has been doing the rounds of social media where Indian fans are singing the Indian National Anthem. Even if you watch it on your screens, it is almost given that it is enough to give you goosebumps. In one of the greatest T20 matches ever played, the Rohit Sharma-led team India etched ahead of arch-rivals Pakistan by a margin of 4 wickets as they settled scores with them. Former India captain played one blinder of an innings as he snatched victory from the jaws of defeat that left and his team flabbergasted. The Indian team is one of the strongest contenders to win the trophy and they now take on Bangladesh on November 2, 2022, at the Adelaide Oval.","pubDate":"2022-11-01 15:54:01","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"T20 World Cup: Jos Buttler surpasses Eoin Morgan to become England's leading T20I run-scorer","link":"https://www.firstpost.com/firstcricket/sports-news/t20-world-cup-jos-buttler-surpasses-eoin-morgan-to-become-englands-leading-t20i-run-scorer-11553391.html","keywords":["First Cricket News"],"creator":["Rachit Kanaujia"],"video_url":null,"description":"T20 World Cup: Jos Buttler surpasses Eoin Morgan to become England's leading T20I run-scorer","content":"England skipper Jos Buttler has become the highest-run scorer for his country in the T20I format. The batter accomplished this record during his side’s crucial Group 1, Super 12 match of the ongoing ICC T20 World Cup in Brisbane.In the match, Buttler struck a delightful 73 of 47 balls. After disappointing in two matches, England’s star played a vital knock and formed an 81-run stand for the first wicket with Alex Hales (52).He has overtaken former England captain Eoin Morgan. In 100 matches, Buttler has 2,468 runs at an average of 33.80. He has scored a century and 18 half-centuries in the format. His best score in T20Is is 101*.Morgan, who retired from international cricket in June this year, had scored 2,458 runs at an average of 28.58 in 107 innings in 115 matches. He scored 14 half-centuries in the format and the best individual score was 91.Other top England batters in T20I cricket are: Alex Hales (1,940), Dawid Malan (1,748), and Jason Roy (1,522).Buttler is now among the top 10 run-scorers in T20I cricket. The top five run scorers in format are: Indian star Virat Kohli (3,868), Indian skipper Rohit Sharma (3,809), New Zealand opener Martin Guptill (3,531), Pakistan skipper Babar Azam (3,239) and Irish opener Paul Stirling (3,144).With this win, England has climbed to the second spot in the points table with five points and two wins in four games. They have lost a match and a match was abandoned due to rains. New Zealand are still at the top with five points, with two wins in four matches. Just like England, they also have endured a loss and one of their matches was abandoned.Defending champions Australia have slipped down to the third position after England’s win. Though all three have five points each, a better net run rate has ensured that New Zealand and England are ahead.Electing to bat first, England posted 179/6 in their 20 overs. An 81-run stand for the first wicket between skipper Jos Buttler (73) and Alex Hales (52) proved to be instrumental in posting a competitive total on the board, even though Kiwis bowled better in death overs and put a halt to England’s momentum with some wickets.Lockie Ferguson was the lead bowler for the Kiwis, taking two wickets. Sodhi, Southee and Santner took a wicket each for the Kiwis.Chasing 180, Kiwis lost two early wickets for 28 runs, following which Kane Williamson (40) and Phillips (62) had a 91-run stand for the third wicket. But after breaking the stand, England managed to pull back the game slowly.Phillips’ wicket in the 18th over shifted the tide completely in England’s favour with the New Zealand team required to make 45 runs in the last 15 balls. New Zealand finished at 159/6 and fell short by 20 runs.Pacers Sam Curran (2/26) and Chris Woakes (2/33) were impressive for England. Ben Stokes and Mark Wood also picked a wicket each.Buttler’s match-winning 73 earned him the ‘Man of the Match’ award.Brief Scores: England: 179/6 in 20 overs (Jos Buttler 73, Alex Hales 52, Lockie Ferguson 2/45) vs New Zealand 159/6 (Glenn Phillips 62, Kane Williamson 40; Sam Curran 2-26).","pubDate":"2022-11-01 15:37:26","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/11/Jos-Buttler-England-vs-New-Zealand-T20-World-Cup.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Adelaide Oval dimensions: Adelaide Oval boundary length and ground size for international cricket","link":"https://thesportsrush.com/cricket-news-adelaide-oval-dimensions-adelaide-oval-boundary-length-and-ground-size-for-international-cricket/","keywords":["Cricket","Adelaide Oval","ICC T20 World Cup 2022"],"creator":["Gurpreet Singh"],"video_url":null,"description":"The Cricketing action at the ICC T20 World Cup 2022 will move to South Australia’s capital city Adelaide on Wednesday, as the race towards semi-final qualification intensifies. The Adelaide Oval will host a couple of ‘Super 12 Group 2’ matches tomorrow, with Zimbabwe taking on Netherlands earlier in the day, followed by the India versus… The post Adelaide Oval dimensions: Adelaide Oval boundary length and ground size for international cricket appeared first on The SportsRush.","content":"The Cricketing action at the ICC T20 World Cup 2022 will move to South Australia’s capital city Adelaide on Wednesday, as the race towards semi-final qualification intensifies. The Adelaide Oval will host a couple of ‘Super 12 Group 2’ matches tomorrow, with Zimbabwe taking on Netherlands earlier in the day, followed by the India versus Bangladesh encounter to follow next. Each of the six teams in the aforementioned group have played three ‘Super 12’ matches each, and with none of them having sealed their semi-final berth as yet, the remaining two matches for the top-5 teams in the group are as crucial as ever. ALSO READ: Defending champions Australia find themselves on the verge of elimination from T20 World Cup 2022 Apart from the two aforementioned matches, the Adelaide Oval will host another couple of ‘Super 12 Group 2’ matches on November 6, and two ‘Super 12 Group 1’ matches prior to them as well, on November 4. The venue will finally also host the second semi-final of the T20 World Cup 2022, scheduled to take place on November 10. Tomorrow the ICC Men’s T20 World Cup returns to Adelaide Oval with two massive matches between Zimbabwe V Netherlands and India V Bangladesh. Here is a photo from the 2015 CWC at the Oval to get you excited. Get your tickets now! https://t.co/tBvNr0PHsA @NikeshRughani pic.twitter.com/Yd4qGivVKD — Adelaide Oval (@TheAdelaideOval) November 1, 2022 Adelaide Oval dimensions Alike most of the Cricket Grounds in the whole of Australia, the Adelaide Oval in South Australia too, boasts of bigger boundary dimensions. Akin the Melbourne Cricket Ground (MCG), which has the biggest boundary size Down Under, the Adelaide Oval too has a huge straight boundary length to the tune of 80 meters. Square of the wicket, the boundary dimensions reduce a bit, but still reads 62-63 meters on either side of the wicket. As for the Cricketing action scheduled to take place at this venue tomorrow, both the matches are highly likely to be affected by rain, and an abandoned contest would be the last thing teams and the fans would want at this stage of the World Cup. The post Adelaide Oval dimensions: Adelaide Oval boundary length and ground size for international cricket appeared first on The SportsRush.","pubDate":"2022-11-01 15:28:03","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"PCB tickets Rawalpindi Test: Full ticket price list for Pakistan vs England 1st Test match","link":"https://thesportsrush.com/cricket-news-pcb-tickets-rawalpindi-test-full-ticket-price-list-for-pakistan-vs-england-1st-test-match/","keywords":["Cricket","England","ICC T20 World Cup 2022","Pakistan"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Although the global cricketing fraternity is obsessed with the business end of the ongoing ICC T20 World Cup, a proactive PCB (Pakistan Cricket Board) is all in readiness of kick-starting ticket sales for the upcoming three-match Test series against England starting from December 1. Having already hosted a Pakistan-England Test match, Rawalpindi Cricket Stadium will… The post PCB tickets Rawalpindi Test: Full ticket price list for Pakistan vs England 1st Test match appeared first on The SportsRush.","content":"Although the global cricketing fraternity is obsessed with the business end of the ongoing ICC T20 World Cup, a proactive PCB (Pakistan Cricket Board) is all in readiness of kick-starting ticket sales for the upcoming three-match Test series against England starting from December 1. Having already hosted a Pakistan-England Test match, Rawalpindi Cricket Stadium will be hosting the first of three Tests against England. In what will be the 13th Test to be played in the city, it will be the first one featuring England. Ticket sales for only the first Test match will start from tomorrow, i.e., November 2 (10:00 hours onward). Book Me, a renowned ticketing platform in Pakistan, will be issuing tickets for all the five days of the match. ALSO READ: Pakistan T20I record in Australia Interested fans will have to visit the website or application of Book Me to book tickets for Rawalpindi Test. All users have to do is click on the “Cricket” section before selecting the match of their choice. Upon selecting the number of tickets of their preferred price category, users will have to follow basic steps to complete the online transaction. “For the passionate Rawalpindi and Islamabad cricket fans, it is a great opportunity to attend the match and be part of the historic Test between the two sides that enjoy massive following and fan-base,” PCB International Cricket Director Zakir Khan said in a statement. “It is also a chance for the parents to bring their children so that they can watch modern-day stars in action and be attracted to cricket and eventually fall in love with this great sport.” PCB tickets Rawalpindi Test full price list Ticket prices for the first Test have been divided into two categories. Readers must note that both the price categories are very economical to allure fans to the stadium. PKR250 – Premium (Shoaib Akhtar, Sohail Tanvir, Miran Bakhsh and Yasir Arafat Stands) PKR500 – VIP (Imran Khan, Javed Akhtar, Javed Miandad and Azhar Mahmood Stands) The post PCB tickets Rawalpindi Test: Full ticket price list for Pakistan vs England 1st Test match appeared first on The SportsRush.","pubDate":"2022-11-01 15:22:28","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Club cricket’s best players from Lord Tav, Premier and Women’s","link":"https://www.cairnspost.com.au/sport/cricket/tripletreat-team-of-the-week-lords-taverners-mens-twoday-and-t20max-womens-action/news-story/e127b8a6e604f7ff7ea8adea99c88371","keywords":["Cricket news and galleries","Sport"],"creator":null,"video_url":null,"description":"Who were club cricket’s standout players from the weekend’s action? We name our KFC T20 Max women’s Team of the Week, reveal the best youngsters from the Lord’s Taverners and name our Sci-Fleet Motors Men’s First Grade Two Day competition Team of the Week","content":null,"pubDate":"2022-11-01 15:00:00","image_url":null,"source_id":"cairnspost","country":["australia"],"category":["sports"],"language":"english"},{"title":"Cricket-Win over New Zealand a &#039;big relief&#039; says England captain Buttler","link":"https://www.thestar.com.my/sport/cricket/2022/11/01/cricket-win-over-new-zealand-a-039big-relief039-says-england-captain-buttler","keywords":null,"creator":null,"video_url":null,"description":"BRISBANE (Reuters) - England captain Jos Buttler praised the team's attitude in their crucial win over New Zealand at the Twenty20 World Cup on Tuesday, saying the result was a \"big relief\" for his side who kept their semi-final qualification hopes alive. Read full story","content":null,"pubDate":"2022-11-01 14:33:00","image_url":"https://apicms.thestar.com.my/uploads/images/2022/11/01/1800383.jpg","source_id":"thestar_my","country":["malaysia"],"category":["sports"],"language":"english"},{"title":"Cricket-Win over New Zealand a 'big relief' says England captain Buttler","link":"https://www.channelnewsasia.com/sport/cricket-win-over-new-zealand-big-relief-says-england-captain-buttler-3036816","keywords":null,"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2022-11-01 14:21:52","image_url":"https://onecms-res.cloudinary.com/image/upload/s--tzjxfSr9--/c_fill,h_900,w_1600/fl_relative,g_south_east,l_one-cms:core:watermark:reuters,w_0.1/f_auto,q_auto/v1/one-cms/core/2022-11-01t142152z_1_lynxmpeia01gg_rtroptp_3_cricket-t20worldcup-buttler.jpg?itok=p48PlOmR","source_id":"channelnewsasia","country":["singapore"],"category":["sports"],"language":"english"},{"title":"Love For Cricket Doesn't Buy You Groceries: WI's T20 WC-winning Skipper","link":"https://sports.ndtv.com/cricket/love-for-cricket-doesnt-buy-you-groceries-darren-sammy-west-indies-t20-world-cup-winning-skipper-3480877","keywords":["Cricket"],"creator":["NDTV"],"video_url":null,"description":"West Indies, two-time champions (2012 and 2016), couldn't even qualify for the Super 12s at the 2022 T20 World Cup","content":null,"pubDate":"2022-11-01 13:59:49","image_url":"https://c.ndtvimg.com/2020-06/o1v9maq8_darren-sammy-press-conference-afp_650x400_09_June_20.jpg?im=FaceCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"IND vs BAN, T20 World Cup Live Streaming: When and where to watch India vs Bangladesh on TV, online","link":"https://www.indiatvnews.com/sports/cricket/ind-vs-ban-t20-world-cup-live-streaming-when-and-where-to-watch-india-vs-bangladesh-on-tv-online-rohit-sharma-s-ind-take-on-shakib-al-hasan-s-ban-2022-11-01-820524","keywords":null,"creator":null,"video_url":null,"description":"ZIM vs NED, T20 World Cup Live Streaming: The Indian cricket team is all set to have a crack against Bangladesh in their crucial fourth match of the T20 World Cup 2022. After suffering a defeat against South Africa, the men in blue will be eager to down the Bangla tigers and consolidate their claim for the semifinal. Meanwhile, Bangladesh also have a chance to qualify for the final four but it will be a task to beat the mighty Indians. Before the action unfolds, here are all the details on the live streaming of the match.","content":"The Indian cricket team is all set to have a crack against Bangladesh in their crucial fourth match of the T20 World Cup 2022. After suffering a defeat against South Africa, the men in blue will be eager to down the Bangla tigers and consolidate their claim for the semifinal. Meanwhile, Bangladesh also have a chance to qualify for the final four but it will be a task to beat the mighty Indians. Before the action unfolds, here are all the details on the live streaming of the match. The match will be played on 2nd November, Wednesday. The match will be played at Adelaide Oval, Adelaide The match will begin at 1:30 PM IST. The match will be broadcasted on Star Sports Network. The match will be live-streamed on the Disney+Hotstar app. , (c), , Suryakumar Yadav, , Deepak Hooda, (w), Ravichandran Ashwin, , , Arshdeep Singh, Rishabh Pant, Axar Patel, Harshal Patel, Najmul Hossain Shanto, , Litton Das, (c), Afif Hossain, , Nurul Hasan(w), Yasir Ali, , Hasan Mahmud, Taskin Ahmed, Miraz, Ebadot Hossain, Shoriful Islam, Nasum Ahmed","pubDate":"2022-11-01 13:41:17","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"What is a powerplay in T20 cricket?","link":"https://www.thesun.co.uk/sport/20287494/powerplay-t20-cricket-explained/","keywords":["Cricket","Sport","Explainers","Sport Evergreen","T20 cricket"],"creator":["Nick Emms"],"video_url":null,"description":null,"content":"THE term powerplay has become a buzzword in cricket since it’s inception into the sport. Cricket has often been criticised for not being the most thrilling sport, but this is where power plays help. GettyEngland beat New Zealand in the Twenty20 World Cup[/caption] Making the game even more exciting, as was seen when England beat New Zealand, the term can be difficult to understand at first. We have all the information on what a power play is in T20 cricket, breaking down the key word and what it means during play. Read More on Cricket NET RUN RATE EXPLAINED What is net run rate in cricket and how is it calculated? FREE OF CHARGE What is a 'free hit' in T20 cricket World Cup? What is a powerplay in T20 cricket? In its most basic form, powerplay is the term given to a set of overs which restricts fielders. During a powerplay in a T20 match in cricket, only two fielders are allowed outside the 30-yard circle for the first six overs. The rule dictates the positions of the fielders and allows for higher scoring cricket matches and in 2005, the ICC named this field restriction powerplay. Most read in Cricket ENG WITH A CHANCE England keep WC hopes alive with NZ win as Buttler hits 73 & Curran stars HOTEL HELL India cricket ace 'paranoid' after hotel worker breaks into room at World Cup JOS NOT GOOD ENOUGH Buttler fears T20 World Cup could become farce as England Australia off NET RUN RATE EXPLAINED What is net run rate in cricket and how is it calculated? WASH OUT England vs Oz becomes FOURTH T20 WC match abandoned to leave both sides in peril CRICKET CRAZY Latest updates on the ICC T20 World Cup including confirmed teams In T20, the first six overs of an innings is a mandatory powerplay, allowing only two fielders outside the 30-yard-circle. However, after this, no mare than five fielders are allowed outside the 30-yard-circle. Fielding restrictions were first introduced back in the 1980’s in Australia but have evolved as the game adapted, with the rules also existing in ODI and 100-ball cricket.","pubDate":"2022-11-01 13:29:58","image_url":null,"source_id":"thesun","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Breeders Cup free bets and sign up offers: Get £150 in free bets and bonuses for meeting at Keeneland","link":"https://www.thesun.ie/sport/horseracing/9658509/breeders-cup-free-bets-offers-keeneland/","keywords":["Horse Racing","Betting","Betting tips","Free Bets","Horse racing","Paddy Power","Sky Bet"],"creator":["Craig Mahood"],"video_url":null,"description":null,"content":"THE BREEDERS' CUP returns this weekend as the world's top horses head for Keeneland. SunSport have teamed up with the top bookmakers in the UK to bring you the best sign up offers and free bet deals available. New customers only. First single & e/w bet only odds of 1/1 or greater. 3 x £10 bet tokens. Free bet stakes not included in returns. Free bets only redeemable on horse racing. Free bets are non withdrawable. No free bet expiry. Eligibility restrictions and further t&cs apply. New customers only. Place your FIRST bet on any sportsbook market and if it loses we will refund your stake in CASH. Max refund for this offer is £20. Only deposits made using Cards or Apple Pay will qualify for this promotion. T&Cs apply. Paddy's Rewards Club: Get a £10 free bet when you place 5x bets of £10+. T&Cs apply. 18+ Begambleaware.org Place a min £10 bet on the Sportsbook on odds of min 1/2 (1.5), get £30 in Free Bets. Rewards valid for 30 days. SMS verification required. Only deposits via cards will qualify. T&Cs apply. Please Gamble Responsibly 18+ begambleaware.org 18+ New UK+IRE Customers only. Certain deposit methods & bet types excl. Min first £/€5 bet within 14 days of account reg at min odds 1/2 to get 4x £/€5 free bets. Free bets available to use on selected sportsbook markets only. Free bets valid for 7 days, stake not returned. Restrictions + T&Cs apply. Begambleaware.org Eligible UK+IRE players. Paypal & some deposit & bet types excl. Min first £5 bet within 14 days of account reg at min odds 1/2 = 4x £5 free bets. Free bets valid for 7 days, stake not returned. No cash-out, restrictions & T&Cs apply. 18+ T&Cs Apply. Begambleaware.org 18+. Play Safe. From 00:01 on 13.04.2022. £30 bonus. New customers only. Minimum £10 stake on odds of 1/2 (1.5) or greater on sportsbook. Further terms apply. Begambleaware.org#ad FREE BETS AND SIGN UP DEALS - BEST NEW CUSTOMER OFFERS Commercial content notice: Taking one of the bookmaker offers featured in this article may result in a payment to The Sun. 18+. T&Cs apply. Begambleaware.org A responsible gambler is someone who: For help with a gambling problem, call the National Gambling Helpline on 0808 8020 133 or go to www.gamstop.co.uk to be excluded from all UK-regulated gambling websites.","pubDate":"2022-11-01 13:04:32","image_url":null,"source_id":"thesun_ie","country":["ireland"],"category":["sports"],"language":"english"},{"title":"Is Australia out of T20 World Cup 2022: Is Australia out of the World Cup semi final qualification race?","link":"https://thesportsrush.com/cricket-news-is-australia-out-of-t20-world-cup-2022-is-australia-out-of-the-world-cup-semi-final-qualification-race/","keywords":["Cricket","Australia","ICC T20 World Cup 2022"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"After England’s win over New Zealand in the ICC T20 World Cup 2022 match, the chances of the Australian team qualifying for the semi-final of the tournament suffered a huge blow. However, they are still not out of the tournament, and there are some permutations and combinations left for them. The defending champions Australia were… The post Is Australia out of T20 World Cup 2022: Is Australia out of the World Cup semi final qualification race? appeared first on The SportsRush.","content":"After England’s win over New Zealand in the ICC T20 World Cup 2022 match, the chances of the Australian team qualifying for the semi-final of the tournament suffered a huge blow. However, they are still not out of the tournament, and there are some permutations and combinations left for them. The defending champions Australia were one of the favourite teams to win in the tournament as they were playing in their home conditions, and they had almost a similar squad as last year. However, the defeat against New Zealand hampered their chances on the very first day. ALSO READ: Steve Smith ready to play against Afghanistan Australia’s NRR took a huge blow when New Zealand defeated them by 89 runs at the Sydney Cricket Ground. The match between Australia and England got abandoned due to rain. Let’s have a look at the possible chances of Australia in the T20 World Cup 2022. Is Australia out of T20 World Cup 2022 The Group 1 of the Super-12 stage of the ICC T20 World Cup 2022 has reached a very interesting stage. All three of Australia, New Zealand and England are tied at 5 points at the moment after playing 4 games each. The top 2 teams of the group will qualify for the semi-final of the tournament. Australia will face Afghanistan in their last match, whereas England and New Zealand will face Sri Lanka and Ireland, respectively. It is safe to say that all three of Australia, England and New Zealand are the favourites to win their respective matches. In that case, all the teams will be tied at 7 points, and the NRR will come into play. Australia’s (-0.304) NRR is quite less than that of New Zealand (+2.233) and England (+0.547). It will require almost a miraculous effort for the Australian team to qualify for the semi-final if all three of the teams win their remaining game. The realistic chance for the Australian team is to win their game against Afghanistan and pray that New Zealand or England can drop points in their respective matches. The post Is Australia out of T20 World Cup 2022: Is Australia out of the World Cup semi final qualification race? appeared first on The SportsRush.","pubDate":"2022-11-01 12:56:23","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"T20 World Cup: With rain on the horizon, what if India vs Bangladesh gets abandoned?","link":"https://www.firstpost.com/firstcricket/sports-news/t20-world-cup-india-vs-bangladesh-abandoned-rain-semi-final-scenarios-11549191.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"T20 World Cup: With rain on the horizon, what if India vs Bangladesh gets abandoned?","content":"India will be back in action at the T20 World Cup on Wednesday against Bangladesh. With two wins and a defeat from their three matches, India will look to move a step closer to the semi-finals with a victory over their neighbours, but there is forecast for rain during the match which will take place at the Adelaide Oval.According to the forecast, there’s a 60 percent chance of rain with overcast weather on the day of the match.T20 World Cup: Full coverage | Schedule | Results | Points Table | News | PhotosCurrently, South Africa top Group 2 with five points. Both India and Bangladesh have four points each but India (NRR: +0.844) are second, while Bangladesh (NRR: -1.533) are third due to their respective net run rates.Touchdown Adelaide 📍 #TeamIndia | #T20WorldCup pic.twitter.com/l6GalMP0TI— BCCI (@BCCI) October 31, 2022Zimbabwe are fourth with three points, while Pakistan are fifth with two points. The Netherlands are bottom with no point so far.If the India-Bangladesh match does get washed out, both teams will get a point each and they will move to five points.Such a scenario would also make Thursday’s South Africa vs Pakistan match extremely interesting as a defeat for Babar Azam and Co would knock them out of the T20 World Cup. However, a victory would throw the group wide open with Zimbabwe expected to win their next encounter against the Netherlands.If Pakistan win, at least five teams will be in contention for the semi-finals till the last round of group fixtures. Even if Pakistan don’t win, four teams (South Africa, India, Bangladesh and Zimbabwe) could be fighting for the two semi-final spots.In their final Group 2 game, India would look for a comfortable win against Zimbabwe to avoid getting into an NRR fight with Bangladesh who face Pakistan in their last match.Bangladesh, Zimbabwe and even Pakistan can be the semi-finalists if India and South Africa fail to win their respective final group encounters.Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-11-01 12:53:35","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/11/India-T20-World-Cup1.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Recent Match Report - England vs New Zealand 33rd Match, Group 1 2022/23 - ESPNcricinfo","link":"https://news.google.com/__i/rss/rd/articles/CBMiigFodHRwczovL3d3dy5lc3BuY3JpY2luZm8uY29tL3Nlcmllcy9pY2MtbWVuLXMtdDIwLXdvcmxkLWN1cC0yMDIyLTIzLTEyOTgxMzQvZW5nbGFuZC12cy1uZXctemVhbGFuZC0zM3JkLW1hdGNoLWdyb3VwLTEtMTI5ODE2Ny9tYXRjaC1yZXBvcnTSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Recent Match Report - England vs New Zealand 33rd Match, Group 1 2022/23  ESPNcricinfoLive Cricket Score - England vs New Zealand, Super 12, T20 WC 2022 | Cricbuzz.com - Cricbuzz  CricbuzzEngland vs New Zealand, T20 World Cup LIVE: ENG def NZ by 20 runs to stay alive, improve NRR  The Indian ExpressLive match blog - England vs New Zealand 33rd Match, Group 1 2022/23 - Cricket Insights  ESPNcricinfoT20 World Cup: England beat New Zealand, remain in the race for semi-finals #shorts #t20worldcup  DNAIndiaNewsView Full coverage on Google News","content":null,"pubDate":"2022-11-01 12:24:14","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"T20 World Cup 2022: Team India train indoors, will rain play spoilsport in India vs Bangladesh match?","link":"https://www.indiatvnews.com/sports/cricket/t20-world-cup-2022-team-india-train-indoors-will-rain-play-spoilsport-in-india-vs-bangladesh-match-ind-vs-ban-rohit-sharma-shakib-al-hasan-adelaide-2022-11-01-820501","keywords":null,"creator":null,"video_url":null,"description":"T20 World Cup 2022: The Indian cricket team is all set to lock horns against Bangladesh in their Super 12 encounter at Adelaide. Apart from the clash, the weather is also a big talking point. The weather has not been very kind in Adelaide in recent days as the heavens have opened up and even on Tuesday it rained. Due to this the Indian cricket team took the net session under the roof. ","content":null,"pubDate":"2022-11-01 12:20:08","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"ICC T20 World Cup 2022 Points Table: Standings in Group A, Group B, Group 1 and Group 2","link":"https://www.firstpost.com/firstcricket/sports-news/t20-world-cup-2022-points-table-standings-results-matches-australia-11540901.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"ICC T20 World Cup 2022 Points Table: Standings in Group A, Group B, Group 1 and Group 2","content":"The T20 World Cup 2022 is underway in Australia and the tournament has already unveiled some exciting contests and shocking results. Two-time champions West Indies were knocked out in the first round while Ireland and Zimbabwe were involved in major upsets. Ireland defeated England in a rain-curtailed fixture. Zimbabwe on the other side, beat Pakistan to take two crucial points.T20 World Cup: Full coverage | Schedule | Results | Points Table | News | PhotosSouth Africa and New Zealand are the only two unbeaten teams in the competition. They both have two wins from three matches with the last game a washout.Arch-rivals India and Pakistan were involved in a last-ball thriller but the Men in Blue eventually sealed the win after a batting masterclass from Virat Kohli. The Proteas handed India their first loss of the T20 World Cup.Defending champions Australia made a disappointing start to the campaign after they were thumped by the Black Caps.Sri Lanka kept themselves alive in the tournament with a six wicket win over Afghanistan. As a result, Afghanistan have been knocked out. England clinched an important win against New Zealand to keep themselves in the hunt as well.Here we look at T20 World Cup Points Table and Team Standings:The semi-finals are slated to take place on 9th November and 10th November in Sydney and Adelaide respectively while the final will be held on 13th November in Melbourne.Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-11-01 12:10:18","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/10/IND-vs-PAK-1.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"England’s win over New Zealand threatens Australia’s T20 World Cup chances - Sydney Morning Herald","link":"https://news.google.com/__i/rss/rd/articles/CBMihAFodHRwczovL3d3dy5zbWguY29tLmF1L3Nwb3J0L2NyaWNrZXQvZW5nbGFuZC1zLXdpbi1vdmVyLW5ldy16ZWFsYW5kLXRocmVhdGVucy1hdXN0cmFsaWEtcy10MjAtd29ybGQtY3VwLWNoYW5jZXMtMjAyMjExMDEtcDVidXI3Lmh0bWzSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"England’s win over New Zealand threatens Australia’s T20 World Cup chances  Sydney Morning HeraldAussies need a miracle in World Cup thriller  news.com.auEngland defeat New Zealand by 20 runs in Men's T20 Cricket World Cup in Brisbane  ABC News'It's a ruthless tournament': England puts huge dent in Australia's semi final hopes  Wide World of SportsHey, New Zealand: Beat Poms and we’ll give back Crowded House, pavlovas, Russell Crowe and Phar Lap’s heart  The RoarView Full coverage on Google News","content":null,"pubDate":"2022-11-01 12:02:33","image_url":null,"source_id":"google","country":["australia"],"category":["sports"],"language":"english"},{"title":"ENG vs NZ T20 World Cup HIGHLIGHTS: England defeat New Zealand by 20 runs","link":"https://www.firstpost.com/firstcricket/sports-news/england-vs-new-zealand-live-score-t20-world-cup-2022-rain-weather-updates-brisbane-11548571.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"ENG vs NZ T20 World Cup HIGHLIGHTS: England defeat New Zealand by 20 runs","content":"17:44 (IST)That's it from our end for this game. Hope you enjoyed our coverage. Stay with us for all the LIVE UPDATES from the tournament17:42 (IST)England have kept themselves in the hunt and have now moved to the second spot in the points table. New Zealand, England and Australia have 5 points under their belt but the Kiwis are placed at the top followed by England and the Aussies on the basis of a better NRR 17:04 (IST)England have restricted New Zealand to 159/6 to win the match by 20 runs16:45 (IST)England vs New Zealand England continue to pick wickets. Sam Curran has one more. Philips throws his bat on to it but clever bowling from Curran as he doesn't offer pace on it. Philips doesn't get the timing right and is caught at long on by Chris Jordan for 62 off 3616:41 (IST)After 17 overs,New Zealand 131/5 ( Glenn Phillips 59 , Mitchell Santner 0)England vs New Zealand England have picked a wicket on the final ball of the 17th over. New Zealand now need 49 off 18 with five wickets in hand16:39 (IST)Well, it's getting closer and closer now!How are we feeling? 😬#T20WorldCup | #England— England Cricket (@englandcricket) November 1, 202216:33 (IST)ENG vs NZ LIVE That's a big one. Neesham has been caught in the deep by Sam Curran. Wood bowls that short, forces Neesham to take the aerail route towards the longer side of the boundary. Philips needs to stay right till the end now16:25 (IST)ENG vs NZ LIVE Here's the breakthrough that England needed. Kane Williamson tries to guide that one to the third man region but doesn't time that well and is caught at short third man for 40 off 4016:19 (IST)New Zealand vs England Philips is showing his class today. That's two in a row for him. Goes on the back foot and hammers it over mid-wicket and then goes for the slog sweep to get the second maximum in the over. Some brilliant batting is on display here16:12 (IST)STAT ALERT!Jos Buttler becomes England's most prolific run-getter in Men's T20Is 🌟#ENGvNZ #T20WorldCup pic.twitter.com/aGIay3GULP— T20 World Cup (@T20WorldCup) November 1, 202216:09 (IST)ENG vs NZ LIVE SCORE Philips picks that one up. Wood has been bowling quick but this time he misses the line and length. Bowls it full, on to his pads and the batter hits that over widish long on for a maximum16:01 (IST)ENG vs NZ LIVE SCORE England have picked up a couple of early wickets but Kane Williamson has held the fort at one end. New Zealand though need to up the scoring rate now15:58 (IST)ENG vs NZ LIVE GOOD NEWS for England fans. Ben Stokes has return back on to the field after taking a bit of a break. He felt some pain in the left index finger after taking a catch15:53 (IST)Two wickets in the powerplay 💪Scorecard: https://t.co/zIxvMw3gn5#T20WorldCup | #England pic.twitter.com/Bqwif8qCo8— England Cricket (@englandcricket) November 1, 202215:48 (IST)After 6 overs,New Zealand 40/2 ( Kane Williamson (C) 15 , Glenn Phillips 4)ENG vs NZ LIVE What a delivery from Wood to end the over. Full, just outside off Philips tries to defend that but the ball takes the inside edge and races away to the boundary behind15:45 (IST)Ben Stokes has walked off the field after taking that catch. It seems he has hurt his left index finger. Stokes had missed a lot of cricket earlier after injuring his left index finger. Hope there is nothing to worry about it now15:42 (IST)After 5 overs,New Zealand 28/2 ( Kane Williamson (C) 8 , )ENG vs NZ LIVE SCORE Sam Curran has struck for England. New Zealand are in a spot of bother. A touch back of the length and Finn Allen goes for the pull, doesn't time that well and is caught at deep mid-wicket by Ben Stokes for 16 off 11. Perfect planning, perfect execution. There was a fielder standing there 15:27 (IST)ENG vs NZ LIVE SCORE That's the first one down and it's a HUGE ONE! Devon Conway goes across and tries to go over the wicket-keeper's head but just gets a bit of inside edge on it and Buttler takes a stunning catch diving to his right15:24 (IST)After 1 overs,New Zealand 4/0 ( Finn Allen 3 , Devon Conway (W) 1)ENG vs NZ LIVE A good tight over from Moeen Ali first up. Conway and Allen need to be cautious at the start of the innings. Moeen has deceived Conway with pace15:17 (IST)So, the players are out in the middle. New Zealand need 180 to win and register a place in the semi-final of this edition of the T20 World Cup15:06 (IST)So, New Zealand now need 180 to chase against England and book a semi-final berth in the T20 World Cup 202215:04 (IST)After 20 overs,England 179/6 ( Sam Curran 6 , Dawid Malan 3)NZ vs ENG LIVE SCORE New Zealand managed to pick some wickets at the end of the innings but England have compiled a good total as they have put 179/6 in 20 overs. This is surely a good total from England. They would have expected to add some more but the Blackcaps got wickets at crucial junctions14:59 (IST)After 19 overs,England 163/5 ( Ben Stokes 3 , Sam Curran 0)NZ vs ENG LIVE Some brilliance in the field from Kane Williamson handed New Zealand an important wicket of Jos Buttler. Ben Stokes pushed one towards the off side and Williamson stationed at extra cover put in the dive to stop the ball. Buttler who was at the non-striker's end had already come out of the crease but Stokes denied the run. Williamson was quick enough to throw it to the non-striker's end and the rest was done by Southee who turned back and broke the stumps.14:53 (IST)New Zealand vs England LIVE SCORE A six and a wicket to start that over. Brook hammered one out of the park to the long on boundary and then tried to go over long off but didn't execute his stroke well and was caught by Finn Allen for 7 off 314:44 (IST)Making his mark in his 100th IT20 🙌Scorecard: https://t.co/zIxvMw3gn5#T20WorldCup | @JosButtler pic.twitter.com/Ux5C3f3Imn— England Cricket (@englandcricket) November 1, 202214:43 (IST)New Zealand vs England LIVE Buttler in that form is a treat to watch. That stroke seems to be inspired from Tennis forehand. Boult bowls that short, moving away from the right-hander and the England captain hammers that straight down the ground for another maximum14:33 (IST)New Zealand vs England LIVE SCORE Buttler is on the charge now. He goes straight down the ground for a four and has now pulled this one to deep backward square leg boundary for another one14:28 (IST)New Zealand vs England LIVE Here's the breakthrough. Sodhi strikes as Moeen Ali tries to take him on. The spinner bowls that touch back of the length as Moeen goes back in his crease to drag that towards the fence on the on side but doesn't get the distance and is caught by Boult for 5 off 614:27 (IST)Alex Hales brings up his 11th T20I half-century but departs shortly 🔥#ENGvNZ | 📝: https://t.co/LDryGxkGdJHead to our app and website to follow the #T20WorldCup action 👉 https://t.co/wGiqb2epBe pic.twitter.com/GIrY9MYVlK— T20 World Cup (@T20WorldCup) November 1, 202214:26 (IST)New Zealand vs England LIVE Rare scenes! NEW ZEALAND HAVE DROPPED A CATCH! Ferguson pulls the length on that as Buttler goes for the pull but finds Daryl Mitchell in the deep but he has dropped. Mitchell certainly over ran on that one and that's a chance gone begging. New Zealand need to hold on to those kind of catches 14:24 (IST)New Zealand vs England  Buttler was waiting for that length. Fuller one, outside off and the England opener throws the kitchen sink on it to get the boundary around the long off area14:17 (IST)ENG vs NZ LIVE SCORE Santner finally has a wicket as he removes Hales who has been stumped. That one just turned away from the right-hander as he came down the track but missed it completely and the rest was done by Conway. He is out for 52 off 4014:08 (IST)After 9 overs,England 67/0 ( Jos Buttler (C) (W) 19 , Alex Hales 46)ENG vs NZ LIVE This has been a good start from both the batters. They have laid a good foundation fro a big total here and England now need to build on that14:06 (IST)Our boss ❤️Congratulations, Jos! 🙌#T2WorldCup | @josbuttler pic.twitter.com/VaREKg1cVi— England Cricket (@englandcricket) November 1, 202213:57 (IST)England vs New Zealand LIVE SCORE DROPPED! Williamson made a valiant effort to take that one but it has touched the ground. Buttler takes the aerial route as he tries to go over covers, Williamson charges from extra cover, puts in the dive, catches the ball before it touches the ground13:51 (IST)England vs New Zealand LIVE Hales had a maximum earlier in that over and he now goes through the off side and gets a couple of boundaries. He comes down the wicket and smashes that length ball through the covers. The right-hander is looking in good touch now. He wants to make good use of the remaining overs in the powerplay13:45 (IST)After 3 overs,England 21/0 ( Jos Buttler (C) (W) 5 , Alex Hales 16)England vs New Zealand A boundary to finish that over. Boult bowls one into the slot and Hales hits that over mid off for a boundary. He didn't time that really well but still got a boundary13:36 (IST)After 1 overs,England 9/0 ( Jos Buttler (C) (W) 3 , Alex Hales 6)England vs New Zealand Boult is getting the ball to swing. He almost had a wicket in that over as he bowled one angling into the right-hander. Hales got an inside edge and ran away for four behind. A good start from the left-arm bowler13:32 (IST)Alex Hales and Jos Buttler open the innings for England while it's Trent Boult who will bowl the first over13:16 (IST)ENG vs NZ LIVE UPDATES  Playing XI  New Zealand: Finn Allen, Devon Conway(w), Kane Williamson(c), Glenn Phillips, Daryl Mitchell, James Neesham, Mitchell Santner, Tim Southee, Ish Sodhi, Lockie Ferguson, Trent Boult13:16 (IST)ENG vs NZ LIVE UPDATES  Playing XI  England: Jos Buttler(w/c), Alex Hales, Dawid Malan, Ben Stokes, Harry Brook, Moeen Ali, Liam Livingstone, Sam Curran, Chris Woakes, Adil Rashid, Mark Wood13:14 (IST)England vs New Zealand  England have won the toss and they have decided to bat first against New Zealand. \"We are going to have a bat first. It is a used wicket, had a couple of games on it and we fancy a bat today. Whatever you do, you have to do well. These are the games you want to be involved in as players and we are looking forward to it,\" Buttler said at the toss12:29 (IST)SL cruising vs AFGEngland and New Zealand are scheduled to lock horns at the Brisbane Cricket Ground, where Sri Lanka and Afghanistan are currently battling it out for survival.The Lankans, meanwhile, are progressing comfortably in the run chase after restricting Afghanistan to 144/8, needing 39 to win off 36 balls with seven wickets in hand.Click here to follow SL vs AFG live updates12:20 (IST)Hello and welcome to our live coverage of the T20 World Cup Group 1 match between former champions England and 2021 runners-up New Zealand at the Gabba in Brisbane, with the Black Caps favourites to clinch a semi-final spot in the second match of the Tuesday double header.England vs New Zealand Preview: New Zealand will hope to become the first team to enter the T20 World Cup semi-finals when they take on former champions England in the second game of the Tuesday double header in Brisbane.T20 World Cup: Full coverage | Schedule | Results | Points Table | News | PhotosThe two teams have quite the history when it comes to T20 World Cups, having met each other in the semi-finals in each of the last two editions — while England progressed in 2016 with a seven-wicket win in Delhi, it was the Black Caps’ turn to come out on top in Abu Dhabi last year thanks to a match-winning knock from Daryl Mitchell.England began their campaign with a five-wicket win over Afghanistan, but were immediately brought to a screeching halt with a defeat against Ireland in a rain-affected game. Their highly-anticipated Ashes showdown against hosts Australia would later get washed out without a ball bowled, leading to the two teams splitting points.New Zealand, on the other hand, are one of the only two teams yet to lose a game in this tournament, and like South Africa in Group 2, they sit on top of Group 1 despite being level on points with defending champions Australia (5), their superior Net Run Rate putting them ahead.Squads:New Zealand: Finn Allen, Devon Conway(w), Kane Williamson(c), Glenn Phillips, Daryl Mitchell, James Neesham, Mitchell Santner, Tim Southee, Ish Sodhi, Lockie Ferguson, Trent Boult, Martin Guptill, Adam Milne, Michael Bracewell, Mark ChapmanEngland: Jos Buttler(w/c), Alex Hales, Dawid Malan, Ben Stokes, Harry Brook, Moeen Ali, Liam Livingstone, Sam Curran, Chris Woakes, Adil Rashid, Mark Wood, Chris Jordan, David Willey, Tymal Mills, Philip SaltRead all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-11-01 11:51:16","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/11/ENG-NZ.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"England vs New Zealand LIVE T20 World Cup cricket result and reaction as England keep hopes alive","link":"https://www.independent.co.uk/sport/cricket/england-new-zealand-live-stream-score-result-b2214225.html","keywords":["Cricket","Sport"],"creator":["Lawrence Ostlere"],"video_url":null,"description":"England kept their World Cup hopes alive in Brisbane with a 20-run victory over New Zealand","content":null,"pubDate":"2022-11-01 11:47:18","image_url":"https://static.independent.co.uk/2022/11/01/11/SEI131801706.jpg?width=1200&auto=webp","source_id":"independentuk","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Reliance Retail names Hardik Pandya brand ambassador for their new athleisure brand Xlerate","link":"https://www.firstpost.com/sports/reliance-retail-names-hardik-pandya-brand-ambassador-for-their-new-athleisure-brand-xlerate-11552071.html","keywords":["Sports"],"creator":["Press Release"],"video_url":null,"description":"Reliance Retail names Hardik Pandya brand ambassador for their new athleisure brand Xlerate","content":"Reliance Retail has launched an athleisure brand, Xlerate, on its new commerce platform, AJIO Business. The brand caters to the unique requirements of sports and fitness enthusiasts who seek style and comfort in their fitness journey. It offers them a wide variety of high-quality, functionally superior sporting merchandise and footwear that deliver industry-leading style and convenience.Xlerate has something on offer for every price segment, with offerings starting at ₹699. It has signed ace Indian cricket all-rounder Hardik Pandya as its brand ambassador. Pandya signifies style, youth appeal, and a never-give-up attitude – qualities that define the brand.Xlerate reflects the spirit of the fitness-conscious young men and women of India who take active interest in sports. Across sports Indians are making it big on the global stage. The rising tally of medals won by India at the Olympics validates this. Xlerate is therefore focused on offering the youth world-class sportswear at affordable prices.The sports utilities offered by Xlerate include sports shoes, athletic and lifestyle footwear, apparels such as track pants, t-shirts, shorts, and other accessories. Xlerate products are exclusively available on AJIO Business, India’s leading B2B e-commerce platforms.Any retailer in India, including small-sized general sports stores and fashion retail outlets, can place an order for Xlerate products by registering on AJIO Business. AJIO Business furthers Reliance’s core commitment of supporting the growth and well-being of small and medium retailers and digitally empowering them.Speaking on the Xlerate launch, Mr Akhilesh Prasad, President and CEO – Fashion and Lifestyle, Reliance Retail, said, “Xlerate is sure to delight the value-conscious consumer with its superior and affordable product offering. Our brand ambassador, Hardik Pandya, embodies its spirit of moving ahead in life undeterred by obstacles. The campaign “Don’t Brake, Xlerate” reflects the passion and enthusiasm of the youth, who pursue their goals with a never-say-die attitude. The brand caters to their requirements across the categories of sports shoes, sandals, and apparel.”Commenting on his association with Xlerate, Mr Hardik Pandya said, “I am pleased to associate with Xlerate. I think they have an extremely stylish and comfortable range of products. Their brand ideology, ‘Don’t brake, Xlerate’, resonates with my philosophy in life, to continue working hard with self-belief and intensity. I have always had a never-give-up attitude and it’s exciting to see that today’s youth also believes in the same outlook, which Xlerate also truly exemplifies. So, my message to the youth is – no matter what, don’t stop. Don’t brake, Xlerate.”AJIO Business, the new-commerce arm of Reliance Retail partners with retailers and merchants across the country to empower them with an extensive portfolio of 5000-plus fashion and lifestyle brands.","pubDate":"2022-11-01 11:45:45","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/08/Hardik-Pandya-shaka.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"}]}