{"newsArray":[{"title":"THU vs HUR Dream11 Team Prediction, Fantasy Cricket Hints: Captain, Probable Playing 11s, Team News; Injury Updates For Today’s BBL 2021-22 match at Docklands Stadium in Melbourne, 10:15 AM IST January 13","link":"https://zeenews.india.com/cricket/thu-vs-hur-dream11-team-prediction-fantasy-cricket-hints-captain-probable-playing-11s-team-news-injury-updates-for-today-s-bbl-2021-22-match-at-docklands-stadium-in-melbourne-1015-am-ist-january-13-2427518.html","keywords":null,"creator":null,"video_url":null,"description":"Sydney Thunder vs Hobart Hurricanes Dream11 Team Prediction Sydney Thunder vs Hobart Hurricanes Match 47 - Check My Dream11 Team, Best players list of THU vs HUR, Sydney Thunder Dream11 Team Player List, Hobart Hurricanes Dream11 Team Player List, Dream11 Guru Tips, Fantasy Cricket Tips Big Bash League 11, Fantasy Cricket Tips, Fantasy Playing Tips.","content":null,"pubDate":"2022-01-13 02:30:00","full_description":"Sydney Thunder will face Hobart Hurricanes in first of the double-header on Thursday (January 13) in Match No. 47 of the Big Bash League (BBL) 2021-22. The Thunder are in top form at the moment as they have won 6 matches in succession. They moved to the 2nd spot in the standings with 30 points. The Thunder won their previous match against Hurricanes by 9 wickets, which will give them a boost before heading into this clash. Hobart Hurricanes, on the other hand, have had a poor second half of the tournament after a decent first half. They had lost three of their last 4 matches played. They are at the 4th spot in the standings currently with 21 points. Venue: Docklands Stadium, Melbourne Date & Time: January 13th at 10:15 AM IST Live Streaming: Sony Six and Sony Liv website and app Wicket-keeper: Ben McDermott, Matthew Gilkes Batters: Alex Hales, Peter Handscomb, Jason Sangha All-rounders: D’Arcy Shot, Daniel Sams Bowlers: Gurinder Sandhu, Sandeep Lamichhane, Thomas Rogers, Muhammad Hasnain Captain: Ben McDermott Vice-captain: Daniel Sams Sydney Thunder: Matthew Gilkes, Alex Hales, Jason Sangha, Oliver Davies, Daniel Sams, Ben Cutting, Nathan McAndrew, Baxter Holt (wk), Gurinder Sandhu, Mohammad Hasnain, Tanveer Sangha Hobart Hurricanes: Matthew Wade (c & wk), Ben McDermott (wk), Caleb Jewell, Peter Handscomb, D’Arcy Short, Tim David, Jordan Thompson, Mitchell Owen, Thomas Rogers, Riley Meredith, Sandeep Lamichhane","image_url":null,"source_id":"zeenews"},{"title":"Premier Cricket: University chase down Willetton in one-day clash","link":"https://www.perthnow.com.au/local-news/perthnow-canning/premier-grade-university-chase-down-willetton-in-one-day-clash-c-5248522","keywords":null,"creator":["Ben Smith"],"video_url":null,"description":"Willetton’s start to 2022 has started on a sour note as they went down by three wickets to university in their Premier Grade one-day clash at Burrendah Park.","content":null,"pubDate":"2022-01-13 02:00:00","full_description":null,"image_url":"https://images.perthnow.com.au/publication/C-5248522/bca8cba407a134b6d0e0fdc690317b5efa03f8cd-16x9-x0y393w7529h4235.jpg","source_id":"perthnow"},{"title":"Azeem Rafiq calls for lifting of ban on England games at Yorkshire","link":"https://www.thenews.com.pk/print/924751-azeem-rafiq-calls-for-lifting-of-ban-on-england-games-at-yorkshire","keywords":null,"creator":null,"video_url":null,"description":"LONDON: Yorkshire whistleblower Azeem Rafiq has called for the lifting of the cricket club’s suspension from hosting England matches after they took steps to tackle a racism scandal.England chiefs in November stripped Yorkshire of the right to stage international games at their Headingley...","content":null,"pubDate":"2022-01-13 01:00:00","full_description":null,"image_url":null,"source_id":"thenews"},{"title":"Abid back in practice","link":"https://www.thenews.com.pk/print/924757-abid-back-in-practice","keywords":null,"creator":null,"video_url":null,"description":"LAHORE: Test cricketer Abid Ali has taken the first step towards his return to cricket while urging his fans to get regular check ups to stay healthy.“Health is wealth. My request to all the fans is to get themselves screened regularly. This incident has helped me to realise its...","content":null,"pubDate":"2022-01-13 01:00:00","full_description":null,"image_url":null,"source_id":"thenews"},{"title":"Proteas crumble against Bumrah brilliance","link":"https://www.cairnspost.com.au/sport/cricket/proteas-crumble-against-bumrah-brilliance/video/4bde1ffd347328344b8a8926a1b7e99c","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket: A superb five-wicket haul from Jasprit Bumrah has ensured India hold a slim lead heading into Day 3 of the Third Test against South Africa.","content":null,"pubDate":"2022-01-13 00:16:09","full_description":null,"image_url":null,"source_id":"cairnspost"},{"title":"Early problem with Cummins captaincy pinned","link":"https://wwos.nine.com.au/cricket/the-ashes-2022-england-australia-pat-cummins-captaincy-ian-chappell-mark-taylor-exclusive/1c1077a6-158c-4a43-8164-6f53a5ad9b3d","keywords":null,"creator":["wwos"],"video_url":null,"description":"Ian Chappell has asked a pertinent question of Pat Cummins' captaincy after Australia failed to win the fourth Test.","content":"Former national captain Ian Chappell has brought Australia's decision-making process into question after the hosts failed to clinch victory in the fourth Ashes Test.Some greats of the game, including Mark Taylor, Mark Waugh and David Lloyd, have argued that Pat Cummins took too long to declare on the fourth day of the Sydney fixture, after England survived 102 overs to force a draw.But instead of becoming another critic of Cummins' declaration call, which was made after a lead of 387 was compiled, Chappell has questioned if the captain is listening to too many opinions.READ MORE: Journalist told vax question off limits in Djokovic interviewREAD MORE: England's 'poisoned chalice' set to cripple Test team beyond Ashes READ MORE: Olympic medallist Deon Lendore dead aged 29\"My query would be more along the lines of, 'Who's making the decision?',\" Chappell said on Wide World of Sports' Outside The Rope.\"Is it a combined thing? Captaincy can be a tough job and I think you've got to decide, 'This is how long I want to give the bowlers to take the 10 wickets'. I would listen to some senior players, but blokes who are off the field – I'm not sure why I'm listening to them because they're not out there. It's your vice-captain, your senior players who are out there. They're fighting, they know what it's like.\"Taylor said on Outside The Rope that he thought Cummins had a \"terrific\" fifth day as captain, pointing to his measured use of tweaker Nathan Lyon and willingness to use part-time leg-spinners Steve Smith and Marnus Labuschagne.The former national captain also argued the SCG wicket was \"not the pitch it used to be\", saying \"it's not a raging turner\" and \"balls aren't going up and down like they used to towards the end of a game\".The draw in the fourth Test followed India's colossal effort to salvage a stalemate on the fifth day at the SCG the year prior, when Ajinkya Rahane's men survived 131 overs against a Tim Paine-led Australia.Chappell is a fervid advocate of Cummins as captain.\"Anyone who is not inspired by Pat Cummins is a fool, because he's easily the most inspiring player in that Australian side,\" Chappell said.\"People who were querying his credentials as a captain don't know anything about the game.\"Take (former Pakistan captain) Imran Khan's comment. He said, 'If you're going to be a good cricket captain you've got to understand bowling'. Well, who's going to understand bowling better than Pat Cummins? He is a bloody bowler. I think he's done a terrific job in that regard.\"He's got all the credentials to be a captain. It'll get tougher for him, it's not all going to go along like this, but he'll be a good captain.\"Australia will aim to round out a 4-0 series victory in Hobart, matching the result of the 2017-18 Ashes on home soil.The final match, to be played at Bellerive Oval from tomorrow, will see Hobart host its first-ever Ashes Test.For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here!","pubDate":"2022-01-13 00:14:20","full_description":"Former national captain Ian Chappell has brought Australia's decision-making process into question after the hosts failed to clinch victory in the fourth Ashes Test . Some greats of the game, including Mark Taylor , Mark Waugh and David Lloyd , have argued that Pat Cummins took too long to declare on the fourth day of the Sydney fixture, after England survived 102 overs to force a draw. But instead of becoming another critic of Cummins' declaration call, which was made after a lead of 387 was compiled, Chappell has questioned if the captain is listening to too many opinions. READ MORE: Journalist told vax question off limits in Djokovic interview READ MORE: England's 'poisoned chalice' set to cripple Test team beyond Ashes READ MORE: Olympic medallist Deon Lendore dead aged 29 \"My query would be more along the lines of, 'Who's making the decision?',\" Chappell said on Wide World of Sports' Outside The Rope . \"Is it a combined thing? Captaincy can be a tough job and I think you've got to decide, 'This is how long I want to give the bowlers to take the 10 wickets'. I would listen to some senior players, but blokes who are off the field – I'm not sure why I'm listening to them because they're not out there. It's your vice-captain, your senior players who are out there. They're fighting, they know what it's like.\" Taylor said on Outside The Rope that he thought Cummins had a \"terrific\" fifth day as captain, pointing to his measured use of tweaker Nathan Lyon and willingness to use part-time leg-spinners Steve Smith and Marnus Labuschagne . The former national captain also argued the SCG wicket was \"not the pitch it used to be\", saying \"it's not a raging turner\" and \"balls aren't going up and down like they used to towards the end of a game\". The draw in the fourth Test followed India's colossal effort to salvage a stalemate on the fifth day at the SCG the year prior, when Ajinkya Rahane 's men survived 131 overs against a Tim Paine -led Australia. Chappell is a fervid advocate of Cummins as captain. \"Anyone who is not inspired by Pat Cummins is a fool, because he's easily the most inspiring player in that Australian side,\" Chappell said. \"People who were querying his credentials as a captain don't know anything about the game. \"Take (former Pakistan captain) Imran Khan's comment. He said, 'If you're going to be a good cricket captain you've got to understand bowling'. Well, who's going to understand bowling better than Pat Cummins? He is a bloody bowler. I think he's done a terrific job in that regard. \"He's got all the credentials to be a captain. It'll get tougher for him, it's not all going to go along like this, but he'll be a good captain.\" Australia will aim to round out a 4-0 series victory in Hobart, matching the result of the 2017-18 Ashes on home soil. The final match, to be played at Bellerive Oval from tomorrow, will see Hobart host its first-ever Ashes Test. For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here!","image_url":"https://vms-network-images-prod.s3-ap-southeast-2.amazonaws.com/2022/01/403622/sequence-34.00_00_25_00.still001.jpg","source_id":"nine"},{"title":"What Joe Root really thinks of England coach","link":"https://wwos.nine.com.au/cricket/ashes-2021-2022-joe-root-chris-silverwood-should-remain-as-england-coach/f904ed7c-207a-4570-b97a-367a701dea60","keywords":null,"creator":["wwos"],"video_url":null,"description":"Joe Root was asked about the future of under-siege coach Chris Silverwood, and his answer was surprising.","content":"Captain Joe Root says he wants under-fire supremo Chris Silverwood to retain his job as coach and sole selector, even in the wake of England's disastrous Ashes campaign.Trailing 3-0 in the series, the tourists are expected to make a host of changes for the Hobart Test, with as many as six changes possible from the team that played in Sydney.Silverwood missed the fourth Test in Sydney after contracting COVID-19, but his position is in grave doubt after a series of dismal performances from the side.READ MORE: Journalist told vax question off limits in Djokovic interviewREAD MORE: England's 'poisoned chalice' set to cripple Test team beyond Ashes READ MORE: Olympic medallist Deon Lendore dead aged 29Asked if he would like Silverwood to continue for England's tour of the West Indies in March, Root said the Ashes drubbing shouldn't be the end of the 46-year-old's tenure.\"Yes I would (like him to continue). It was a difficult week for the group of players with him not being around and it must have been very difficult for him,\" he explained.\"The performances we put in during the first three games, I feel we let him and the coaches down to a degree. We've not played anywhere near the level we're capable of. It's a chance to do that this week.\"I think he's very calm. He has the respect of the guys in the group and he's got a desperation to see everyone do well or upskill the players as best he can.\"Ironically, Silverwood has the backing of his captain, while opposite number Justin Langer, who has overseen victories in both the T20 World Cup and the Ashes in recent months, is likely to be replaced after Australian captain Pat Cummins failed to endorse a contract extension for Langer when asked about the situation after the Melbourne Test.Silverwood has been under fire for a series of controversial decisions during the Ashes, including leaving both James Anderson and Stuart Broad out of the first Test in Brisbane, then omitting a spinner in Adelaide.But Root said the challenges of the COVID-19 pandemic must be taken into account when deciding the coach's future.\"He's had a very difficult time of it with the environments we've been living in, trying to manage winning games of cricket with bubble environments away from home, multi-format players trying to prepare for an Ashes and a World Cup. It's very difficult,\"he noted.\"For a long time, we've not been able to put our best teams out because we've been constantly trying to make sure from a mental-wellbeing point of view that everyone is looked after properly, because of the schedule we've dealt with over two years.\"For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here!","pubDate":"2022-01-13 00:04:42","full_description":"Captain Joe Root says he wants under-fire supremo Chris Silverwood to retain his job as coach and sole selector, even in the wake of England's disastrous Ashes campaign. Trailing 3-0 in the series, the tourists are expected to make a host of changes for the Hobart Test , with as many as six changes possible from the team that played in Sydney. Silverwood missed the fourth Test in Sydney after contracting COVID-19, but his position is in grave doubt after a series of dismal performances from the side. READ MORE: Journalist told vax question off limits in Djokovic interview READ MORE: England's 'poisoned chalice' set to cripple Test team beyond Ashes READ MORE: Olympic medallist Deon Lendore dead aged 29 Asked if he would like Silverwood to continue for England's tour of the West Indies in March, Root said the Ashes drubbing shouldn't be the end of the 46-year-old's tenure. \"Yes I would (like him to continue). It was a difficult week for the group of players with him not being around and it must have been very difficult for him,\" he explained. \"The performances we put in during the first three games, I feel we let him and the coaches down to a degree. We've not played anywhere near the level we're capable of. It's a chance to do that this week. \"I think he's very calm. He has the respect of the guys in the group and he's got a desperation to see everyone do well or upskill the players as best he can.\" Ironically, Silverwood has the backing of his captain, while opposite number Justin Langer, who has overseen victories in both the T20 World Cup and the Ashes in recent months, is likely to be replaced after Australian captain Pat Cummins failed to endorse a contract extension for Langer when asked about the situation after the Melbourne Test. Silverwood has been under fire for a series of controversial decisions during the Ashes, including leaving both James Anderson and Stuart Broad out of the first Test in Brisbane, then omitting a spinner in Adelaide. But Root said the challenges of the COVID-19 pandemic must be taken into account when deciding the coach's future. \"He's had a very difficult time of it with the environments we've been living in, trying to manage winning games of cricket with bubble environments away from home, multi-format players trying to prepare for an Ashes and a World Cup. It's very difficult,\" he noted. \"For a long time, we've not been able to put our best teams out because we've been constantly trying to make sure from a mental-wellbeing point of view that everyone is looked after properly, because of the schedule we've dealt with over two years.\" For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here!","image_url":"https://vms-network-images-prod.s3-ap-southeast-2.amazonaws.com/2022/01/403444/pickerimage.jpg","source_id":"nine"},{"title":"Ashes 2021-22: No place for four-fingered send-offs in cricket’s new world; respect the opposition","link":"https://thewest.com.au/sport/ashes-2021-22-no-place-for-four-fingered-send-offs-in-crickets-new-world-respect-the-opposition-c-5287339","keywords":null,"creator":["Robert Craddock"],"video_url":null,"description":"The victory fanfare after the 2017-18 Ashes series win was a bad look. Although a similar result is likely, Robert Craddock reveals why the celebrations definitely will not be the same.","content":null,"pubDate":"2022-01-13 00:04:17","full_description":null,"image_url":"https://images.thewest.com.au/publication/C-5287339/d793379e6c6bab3aa4de2af9635e7ac255f7a0eb-16x9-x331y476w3038h1709.jpg","source_id":"thewest"},{"title":"'Poisoned chalice' set to cripple England team","link":"https://wwos.nine.com.au/cricket/ashes-2022-ian-chappell-says-joe-root-not-a-cricket-captain/1527e3b4-1f10-4066-844c-d2d7a875a409","keywords":null,"creator":["wwos"],"video_url":null,"description":"Ian Chappell has taken yet another swipe at England captain Joe Root ahead of the final Ashes Test in Hobart.","content":"Ian Chappell has launched another scathing attack on England captain Joe Root, suggesting the star batsman is not fit to be a leader in any form of the game.The former Australian Test captain had been open in his criticism of Root's leadership earlier in the summer and doubled down just days before the final Ashes Test.When asked about the issues in the tourists' camp, Chappell wasted little time before pointing the finger at both Root and England coach, Chris Silverwood.READ MORE: Sad twist in Hobart's historic Ashes TestREAD MORE: Cummins whacked over 'fearful' Ashes callREAD MORE: England lose keeper for remainder of tour\"They haven't got the right structure,\" he told Wide World of Sports' Outside The Rope.\"Joe Root is not a cricket captain, don't worry about a Test captain, he's not a cricket captain.\"Who wants the job? Ben Stokes is saying all the things to support Joe. Does he want the job? If he's got any brains he's probably going to say no because it's a poisoned chalice.\"He's the one man with the credentials to do the job. Being an aggressive cricketer doesn't make you a good, aggressive captain, but it can.\"Chappell criticised England's management of its bowling attack, singling out the selection of Jack Leach, who is the only frontline spinner who has played for the tourists all series.\"Jack Leach is not a competitor,\" he said. \"Jack Leach is not a Test bowler, he's frightened stiff being on the field.\"\"Dom Bess, I think wants to be there and he's a competitor. The other guys they've got to look at are [Matt] Parkinson and [Mason] Crane, because they're attacking bowlers, but England look the wrong way at spin bowling.\"They've got Leach there [and say] 'Oh, he can tie up an end and keep it tight for the others', it's rubbish. You've got to get wickets at both ends. I don't care what Test match you're playing, if you're not trying to get wickets at two ends then you're doing something wrong.\"The first thing for England is to pick their best side, they haven't got close to doing that.\"For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here!","pubDate":"2022-01-12 22:39:01","full_description":"Ian Chappell has launched another scathing attack on England captain Joe Root , suggesting the star batsman is not fit to be a leader in any form of the game. The former Australian Test captain had been open in his criticism of Root's leadership earlier in the summer and doubled down just days before the final Ashes Test. When asked about the issues in the tourists' camp, Chappell wasted little time before pointing the finger at both Root and England coach, Chris Silverwood. READ MORE: Sad twist in Hobart's historic Ashes Test READ MORE: Cummins whacked over 'fearful' Ashes call READ MORE: England lose keeper for remainder of tour \"They haven't got the right structure,\" he told Wide World of Sports' Outside The Rope . \"Joe Root is not a cricket captain, don't worry about a Test captain, he's not a cricket captain. \"Who wants the job? Ben Stokes is saying all the things to support Joe. Does he want the job? If he's got any brains he's probably going to say no because it's a poisoned chalice. \"He's the one man with the credentials to do the job. Being an aggressive cricketer doesn't make you a good, aggressive captain, but it can.\" Chappell criticised England's management of its bowling attack, singling out the selection of Jack Leach , who is the only frontline spinner who has played for the tourists all series. \"Jack Leach is not a competitor,\" he said. \"Jack Leach is not a Test bowler, he's frightened stiff being on the field.\" \"Dom Bess, I think wants to be there and he's a competitor. The other guys they've got to look at are [Matt] Parkinson and [Mason] Crane, because they're attacking bowlers, but England look the wrong way at spin bowling. \"They've got Leach there [and say] 'Oh, he can tie up an end and keep it tight for the others', it's rubbish. You've got to get wickets at both ends. I don't care what Test match you're playing, if you're not trying to get wickets at two ends then you're doing something wrong. \"The first thing for England is to pick their best side, they haven't got close to doing that.\" For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here!","image_url":"https://vms-network-images-prod.s3-ap-southeast-2.amazonaws.com/2022/01/403621/pickerimage.jpg","source_id":"nine"},{"title":"Jasprit Bumrah gets his revenge against Marco Jansen","link":"https://www.cairnspost.com.au/sport/cricket/jasprit-bumrah-gets-his-revenge-against-marco-jansen/video/3e15a6d8a2e2e5c2b0e64a601eb5837d","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket: Jasprit Bumrah simply gave Marco Jansen a steely look after the Indian star uprooted the young all-rounder's off stump.","content":null,"pubDate":"2022-01-12 22:32:05","full_description":null,"image_url":null,"source_id":"cairnspost"},{"title":"‘Best in the world’: Jasprit Bumrah’s sweet revenge as ‘giant of Indian cricket’ delivers another scary spell","link":"https://www.foxsports.com.au/cricket/countries/india/south-africa-vs-india-test-cricket-2022-jasprit-bumrah-stats-marko-jansen-clash-best-in-the-world-says-michael-vaughan-twitter/news-story/d79925ccbfdba87d079175048fd7e60c","keywords":null,"creator":null,"video_url":null,"description":"Former England captain Michael Vaughan has labelled Indian star Jasprit Bumrah the best cricketer in the world across all three formats following his latest stunning performance with the ball that included sweet revenge.","content":null,"pubDate":"2022-01-12 22:07:00","full_description":"Former England captain Michael Vaughan has labelled Indian star Jasprit Bumrah the best cricketer in the world across all three formats following his latest stunning performance with the ball that included sweet revenge. Bumrah bowled with quintessential zip, pace and intimidation on Wednesday night (AEDT) to inspire India to a slender first innings over South Africa in the series-deciding third Test in Cape Town. The 28-year-old, who’s terrorised both Australia and England on foreign soil in the past few years, took 5-42 — his seventh five-wicket haul from 26 Tests and second against the Proteas — as South Africa was bowled out for 210. Catch every moment of The Ashes live and ad-break free during play on Kayo. New to Kayo? Try 14-days free now. Bumrah was India’s most effective bowler, posing ample problems for all the Proteas batters on a pitch that still offered good bounce and some seam movement for the bowlers. “How good is @Jaspritbumrah93!” Vaughan wrote on Twitter. “I reckon across all formats he is the best in the World at the moment.” SuperSport broadcaster Mike Haysman labelled Bumrah a “giant of Indian cricket”, while former South African skipper Shaun Pollock said his achievement was “sensational”. “There isn’t anyone more deserving on the field,” Pollock said of Bumrah’s five-wicket haul on the SuperSport coverage. “He was simply stunning, he was the one that caused the most problems for the South African batters.” South Africa's Marco Jansen was bowled by India's Jasprit Bumrah. Picture: Rodger Bosch Source: AFP The highlight of Bumrah’s spell came when he dismissed South Africa’s Marco Jansen with a beautiful delivery that knocked the off-stump cartwheeling out of the ground. Capturing Jansen’s wicket was particularly sweet for Bumrah, who had heated words with the South African during the second Test after Jansen bowled several short deliveries to Bumrah and hit him on the shoulder during India’s innings with the bat. Bumrah and Jansen in a fiery encounter! | 01:17 So when Bumrah dismissed Jansen during South Africa’s innings, Bumrah stared down Jansen for seconds as the latter made his way back to the pavilion. Despite Bumrah’s performance, South Africa hit back late on the second day, with Jansen and Kagiso Rabada and Marco Jansen dismissing both Indian openers to leave the tourists 2-57 at stumps — an overall lead of 70 — and the match evenly poised. Rabada produced a hostile opening spell when India started its second innings. Mayank Agarwal was given out caught behind but won a reprieve when a review showed the ball had brushed a pad and not the inside edge of his bat. But Agarwal made only seven before edging Rabada to Proteas skipper Dean Elgar at first slip before Jansen struck in the next over when KL Rahul was caught at second slip. Cheteshwar Pujara (9*) and captain Virat Kohli (14*) prevented any further breakthroughs before the close of play. Rabada rips through India on Day One | 00:57 Earlier, Keegan Petersen top-scored for South Africa with 72, but the fragility of the home team’s batting was exposed, with no other batter scoring more than Temba Bavuma’s 28. “It’s extremely challenging, the most challenging I have faced in my whole career,” Petersen said after stumps. “We have to be focused and on your mark all the time or they will expose you.” Petersen hit nine fours in his 166-ball innings but said scoring was never easy. “There are not many scoring opportunities. When they do give you an opportunity you have to pounce on it - but they haven’t given us much,” he said. Even so, South Africa seemed well-placed until Mohammed Shami made a double strike shortly before tea. With batting conditions seemingly easier in bright sunshine than on the overcast first day, South Africa reached 4-159, with Petersen and Bavuma both batting relatively comfortably. But the consistently accurate Shami produced a ball which climbed on Bavuma, forcing an edge that was taken by Kohli at second slip. Two balls later, Kyle Verreynne prodded at a good-length delivery from Shami and was caught behind, leaving South Africa with no more recognised batsmen. Jasprit Bumrah took 5-42. Picture: Grant Pitcher Source: Getty Images Bumrah followed by bowling Jansen with the last ball before tea then had Petersen caught at first slip in the second over after the interval. Petersen had to face the third ball of the morning after Aiden Markram padded up and was bowled by an in-swinger from Bumrah without a run added to the overnight 17 for one. When nightwatchman Keshav Maharaj was bowled by Umesh Yadav for 25, South Africa were precariously placed at 3-45. The slightly-built Petersen batted with skill and application in partnerships of 67 with Rassie van der Dussen (21) and 47 with Bavuma before Shami struck. Peterson’s 72, which came off 166 balls and included nine fours, was his second half-century following the 62 he made in the first innings in the previous Test at the Wanderers. “We are a bit behind the eight-ball,” admitted Petersen. “If we can get early wickets tomorrow it will be brilliant.” — with AFP","image_url":null,"source_id":"foxsports"},{"title":"‘Best in the world’: Star’s sweet revenge as ‘giant of Indian cricket’ delivers scariest spell yet - Fox Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMi3wFodHRwczovL3d3dy5mb3hzcG9ydHMuY29tLmF1L2NyaWNrZXQvY291bnRyaWVzL2luZGlhL3NvdXRoLWFmcmljYS12cy1pbmRpYS10ZXN0LWNyaWNrZXQtMjAyMi1qYXNwcml0LWJ1bXJhaC1zdGF0cy1tYXJrby1qYW5zZW4tY2xhc2gtYmVzdC1pbi10aGUtd29ybGQtc2F5cy1taWNoYWVsLXZhdWdoYW4tdHdpdHRlci9uZXdzLXN0b3J5L2Q3OTkyNWNjYmZkYmE4N2QwNzkxNzUwNDhmZDdlNjBj0gHfAWh0dHBzOi8vd3d3LmZveHNwb3J0cy5jb20uYXUvY3JpY2tldC9jb3VudHJpZXMvaW5kaWEvc291dGgtYWZyaWNhLXZzLWluZGlhLXRlc3QtY3JpY2tldC0yMDIyLWphc3ByaXQtYnVtcmFoLXN0YXRzLW1hcmtvLWphbnNlbi1jbGFzaC1iZXN0LWluLXRoZS13b3JsZC1zYXlzLW1pY2hhZWwtdmF1Z2hhbi10d2l0dGVyL25ld3Mtc3RvcnkvZDc5OTI1Y2NiZmRiYTg3ZDA3OTE3NTA0OGZkN2U2MGM?oc=5","keywords":null,"creator":null,"video_url":null,"description":"‘Best in the world’: Star’s sweet revenge as ‘giant of Indian cricket’ delivers scariest spell yet  Fox SportsBumrah's five puts India on top in Cape Town  cricket.com.auBumrah five-for hands India Test advantage  Newcastle HeraldBumrah gets his revenge against Jansen  Fox SportsIndia and Bumrah's faith in the process finally pays off  ESPNcricinfoView Full coverage on Google News","content":null,"pubDate":"2022-01-12 22:03:59","image_url":null,"source_id":"google"},{"title":"Stokes & Bairstow in doubt for Fifth Test","link":"https://www.cairnspost.com.au/sport/cricket/stokes-bairstow-in-doubt-for-fifth-test/video/62577bc15064d3896d3597e285851c3f","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket: Ahead of the fifth Ashes Test in Hobart, England are sweating on the fitness of star duo Ben Stokes and Jonny Bairstow.","content":null,"pubDate":"2022-01-12 21:32:06","full_description":null,"image_url":null,"source_id":"cairnspost"},{"title":"'Take a bow': Cricket world erupts over 'ridiculous' Rashid Khan act","link":"https://au.sports.yahoo.com/bbl-2022-cricket-world-erupts-ridiculous-rashid-khan-212950056.html","keywords":null,"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2022-01-12 21:29:50","image_url":"https://s.yimg.com/os/creatr-uploaded-images/2022-01/4423f2a0-73ee-11ec-bb65-b8241ee2dc2d","source_id":"yahoo"},{"title":"Tough selection calls loom for Aussies ahead of Fifth Test","link":"https://www.cairnspost.com.au/sport/cricket/tough-selection-calls-loom-for-aussies-ahead-of-fifth-test/video/2e0f2e691a1b87c24a60df7fdaf496f6","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket: Justin Langer and the Australian selectors will be forced to make some tough calls in regards to the team ahead of the fifth Ashes Test in Hobart.","content":null,"pubDate":"2022-01-12 21:28:09","full_description":null,"image_url":null,"source_id":"cairnspost"},{"title":"Australia unveil squad ahead of Women’s Ashes series","link":"https://www.cairnspost.com.au/sport/cricket/australia-unveil-squad-ahead-of-womens-ashes-series/video/3a765d8b2820a890912f81b134b7e51a","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket: Australia have sprung a few surprises after they revealed their squad for the upcoming Women's Ashes","content":null,"pubDate":"2022-01-12 21:08:06","full_description":null,"image_url":null,"source_id":"cairnspost"},{"title":"Australia unveil squad ahead of Women’s Ashes series","link":"https://www.news.com.au/sport/cricket/australia-unveil-squad-ahead-of-womens-ashes-series/video/3a765d8b2820a890912f81b134b7e51a","keywords":null,"creator":null,"video_url":null,"description":"Cricket: Australia have sprung a few surprises after they revealed their squad for the upcoming Women's Ashes","content":null,"pubDate":"2022-01-12 21:08:06","full_description":null,"image_url":null,"source_id":"news"},{"title":"Bumrah takes five as India claim slight edge over Proteas","link":"https://www.thehansindia.com/sports/cricket/bumrah-takes-five-as-india-claim-slight-edge-over-proteas-724467","keywords":["Sports,Cricket"],"creator":["The Hans India"],"video_url":null,"description":"Jasprit Bumrah shut his critics with one of his best five-wicket hauls in the traditional format as the Indian fast bowling unit gave the team slight edge over South Africa on an exhilarating second day of the third and final Test here on Wednesday.","content":"Jasprit BumrahJasprit BumrahCape Town: Jasprit Bumrah shut his critics with one of his best five-wicket hauls in the traditional format as the Indian fast bowling unit gave the team slight edge over South Africa on an exhilarating second day of the third and final Test here on Wednesday. Bumrah (23.3-8-42-5) was at the heart of India's swift and brutal counter-attack as he got his seventh five-wicket haul with fine complementary acts from Mohammed Shami (16-4-39-2) and Umesh Yadav (16-3-64-2) that helped them bundle out the Proteas for 210. The lead of 13 that India managed was less about the quantum and more about the psychological advantage that they gained and despite losing Mayank Agarwal (7) and KL Rahul (10) cheaply, the visitors scored runs at a fair clip to reach 57 for 2 at stumps. Skipper Virat Kohli (14 batting) and Cheteshwar Pujara (9 batting), with a cumulative experience of 194 Tests, have the responsibility of taking the team to a winning total. And while statistics at times are of little or no relevance but Kohli wouldn't be too unhappy to know that India have never lost a Test match in which his premier strike bowler has taken a five-wicket haul. It was a day when Kohli's captaincy acumen was worth praising as he made relevant bowling changes at the right time, juggled with subtle field placings and also took his 100th catch in Test cricket. But someone who would be really smiling at the end of the day is Bumrah, who had a forgettable game at the Wanderers and copped a fair amount of flak for bowling too short and not depending on his strengths. There were analytics showing how his strike-rate (wickets per deliveries) had doubled since a back injury but on Wednesday, he showed that he is skipper Kohli's real X-factor, the man who makes the difference between a good and a world-class side. One such delivery got South Africa's best performer Keegan Petersen (72 off 166 balls) as it kicked up awkwardly from length but enough for the batter to have a jab at it and Cheteshwar Pujara accepted the offering at second slip. But credit should also go to Shami, who in the post lunch session, got two wickets in three balls to unsettle the Proteas after Petersen and Rassie van der Dussen (21) had added 67 for the fourth wicket. If Umesh set up the session with a conventional outswinger that saw Van Der Dussen edging one to Kohli at second slip, Shami removed the dogged Temba Bavuma (28) and Kyle Verreynne (0) with two ideal Test match deliveries in the 56th over. The bounce available on the Newlands track isn't as steep as it was at the Centurion and the Wanderers which belong to the Highveld region.","pubDate":"2022-01-12 19:58:20","full_description":null,"image_url":"https://assets.thehansindia.com/h-upload/2022/01/12/500x300_1192143-bumrah.jpg","source_id":"thehansindia"},{"title":"Lord Patel warns Yorkshire Cricket Club face 'financial crisis' if international ban is not lifted - Sky Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMilgFodHRwczovL3d3dy5za3lzcG9ydHMuY29tL2NyaWNrZXQvbmV3cy8xMjEyMy8xMjUxNDUyMy9sb3JkLXBhdGVsLXdhcm5zLXlvcmtzaGlyZS1jcmlja2V0LWNsdWItZmFjZS1maW5hbmNpYWwtY3Jpc2lzLWlmLWludGVybmF0aW9uYWwtYmFuLWlzLW5vdC1saWZ0ZWTSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Lord Patel warns Yorkshire Cricket Club face 'financial crisis' if international ban is not lifted  Sky SportsAzeem Rafiq: Yorkshire deserve England games at Headingley, says former player  BBC SportLord Patel confident Headingley will stage internationals after racism scandal  The IndependentAzeem Rafiq calls for Yorkshire's international cricket ban at Headingley to be lifted  Sky SportsAZEEM RAFIQ: Bumble losing his job is not 'change' and Headingley should host internationals again  Daily MailView Full coverage on Google News","content":null,"pubDate":"2022-01-12 19:45:00","image_url":null,"source_id":"google"},{"title":"“When I was up against ENG, I was alone”: When Kevin Pietersen questioned ECB’s double standards around England players playing in the IPL","link":"https://thesportsrush.com/cricket-news-when-i-was-up-against-eng-i-was-alone-when-kevin-pietersen-questioned-ecbs-double-standards-around-england-players-playing-in-the-ipl/","keywords":["Cricket","IPL","kevin pietersen"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Kevin Pietersen questioned ECB’s double standards when England players were available to be part of the Indian Premier League in 2021. While former England star batter Kevin Pietersen undoubtedly had a stellar career as an England cricketer, it was also one marred by way too many controversies. Be his subtle threat to the ECB to… The post “When I was up against ENG, I was alone”: When Kevin Pietersen questioned ECB’s double standards around England players playing in the IPL appeared first on The SportsRush.","content":"Kevin Pietersen questioned ECB’s double standards when England players were available to be part of the Indian Premier League in 2021. While former England star batter Kevin Pietersen undoubtedly had a stellar career as an England cricketer, it was also one marred by way too many controversies. Be his subtle threat to the ECB to retire from Test Cricket, or the infamous text exchanges with South African players allegedly regarding his private conversation with Andrew Strauss, Pietersen had been a controversial figure during his playing days, especially during the final years of his career. Apart from the aforementioned, the former right-handed batter had also invited quite come criticism from the ECB and other England cricketers (former and current) back when he became one of the highest paid players in the Indian Premier League (IPL). He was bought for a whooping sum of INR 9.8 Crore by the Royal Challengers Bangalore (RBC) in the year 2009. Kevin Pietersen questioned ECB’s double standards Pietersen’s record-breaking deal with RCB did not go down well with the ECB who were reluctant to allow England players’ participation in the league back then. Cut to 2021, and with the IPL becoming one of the biggest things in World Cricket, England players’ participation in the league is not longer an issue with the ECB, with their current White-ball skipper Eoin Morgan too having credited the league for bringing the best out of the England players in limited Overs format. In August last year, when the 14th season of the IPL was postponed due to the COVID-19 pandemic, the ECB had given a go-ahead to the England players participating in the league. Had the IPL went ahead as per schedule, the England players- the likes of Jos Buttler, Ben Stokes, Sam Curran et al would have to miss the tournament to play an away series against Bangladesh later that year. Hence, with the ECB allowing their players to participate in the cash-rich league, Kevin Pietersen requested his followers on Twitter to find him an old tweet of his in which he had stated that in case of the IPL being rescheduled (which ultimately did), it would be interesting to see how they react to their previous decision to not allow their players to participate in the IPL. Can anyone find my tweet from a few months ago when ECB said none of their players will play the IPL and will have to prioritise International cricket. I think I said, watch this space or something……. pic.twitter.com/c691iFhgax — Kevin Pietersen (@KP24) August 3, 2021 Pietersen’s followers did oblige to his request and were quick to help him out. It’s going to be v interesting to watch how the ECB handle this issue around not allowing it’s best players to play IPL, if it’s rescheduled. When I went up against ENG, I was alone. This time, it’s all their best branded players! If they stand together, they’ll play IPL! — Kevin Pietersen (@KP24) May 12, 2021 As per former England skipper Michael Vaughan, Pietersen’s IPL contract had caused quite some jealously in the England cricket team dressing room. He also said that this led to cliques being formed and eventually ended with Pietersen being axed from the team. “There was a little band of a few; Graeme Swann, Tim Bresnan, (James) Anderson, (Stuart) Broad and Matt Prior. The whispers were they were on one side and Kevin was kind of standing on his own on the other side…He was on a big contract while not many of the other players were even getting sniffed at,” Vaughan had exclaimed to Fox Sports last year.       The post “When I was up against ENG, I was alone”: When Kevin Pietersen questioned ECB’s double standards around England players playing in the IPL appeared first on The SportsRush.","pubDate":"2022-01-12 19:09:56","full_description":"Kevin Pietersen questioned ECB’s double standards when England players were available to be part of the Indian Premier League in 2021. While former England star batter Kevin Pietersen undoubtedly had a stellar career as an England cricketer, it was also one marred by way too many controversies. Be his subtle threat to the ECB to retire from Test Cricket , or the infamous text exchanges with South African players allegedly regarding his private conversation with Andrew Strauss, Pietersen had been a controversial figure during his playing days, especially during the final years of his career. Apart from the aforementioned, the former right-handed batter had also invited quite come criticism from the ECB and other England cricketers (former and current) back when he became one of the highest paid players in the Indian Premier League (IPL). He was bought for a whooping sum of INR 9.8 Crore by the Royal Challengers Bangalore (RBC) in the year 2009. Pietersen’s record-breaking deal with RCB did not go down well with the ECB who were reluctant to allow England players’ participation in the league back then. Cut to 2021, and with the IPL becoming one of the biggest things in World Cricket, England players’ participation in the league is not longer an issue with the ECB, with their current White-ball skipper Eoin Morgan too having credited the league for bringing the best out of the England players in limited Overs format. In August last year, when the 14th season of the IPL was postponed due to the COVID-19 pandemic, the ECB had given a go-ahead to the England players participating in the league. Had the IPL went ahead as per schedule, the England players- the likes of Jos Buttler, Ben Stokes, Sam Curran et al would have to miss the tournament to play an away series against Bangladesh later that year. Hence, with the ECB allowing their players to participate in the cash-rich league, Kevin Pietersen requested his followers on Twitter to find him an old tweet of his in which he had stated that in case of the IPL being rescheduled (which ultimately did), it would be interesting to see how they react to their previous decision to not allow their players to participate in the IPL. Can anyone find my tweet from a few months ago when ECB said none of their players will play the IPL and will have to prioritise International cricket. I think I said, watch this space or something……. pic.twitter.com/c691iFhgax — Kevin Pietersen🦏 (@KP24) August 3, 2021 Pietersen’s followers did oblige to his request and were quick to help him out. It’s going to be v interesting to watch how the ECB handle this issue around not allowing it’s best players to play IPL, if it’s rescheduled. When I went up against ENG, I was alone. This time, it’s all their best branded players! If they stand together, they’ll play IPL! — Kevin Pietersen🦏 (@KP24) May 12, 2021 The English cricketers did play in the IPL 2021, and Pietersen couldn’t help but reminisce the board’s stance back then, and also when his decision to play in the IPL was viewed as one driven solely by money. Also, as per former England skipper Michael Vaughan, Pietersen’s IPL contract had caused quite some jealously in the England cricket team dressing room. He also said that this led to cliques being formed and eventually ended with Pietersen being axed from the team. “There was a little band of a few; Graeme Swann, Tim Bresnan, (James) Anderson, (Stuart) Broad and Matt Prior. The whispers were they were on one side and Kevin was kind of standing on his own on the other side…He was on a big contract while not many of the other players were even getting sniffed at,” Vaughan had exclaimed to Fox Sports last year.","image_url":null,"source_id":"thesportsrush"},{"title":"Yorkshire chair: International ban could create financial crisis","link":"https://www.skysports.com/cricket/news/12040/12514523/lord-patel-warns-yorkshire-cricket-club-face-financial-crisis-if-international-ban-is-not-lifted","keywords":null,"creator":null,"video_url":null,"description":"Lord Patel has warned it would be a \"catastrophe\" if Yorkshire Cricket Club cannot host international cricket again after the racism scandal at Headingley. ","content":null,"pubDate":"2022-01-12 18:44:00","full_description":"Last Updated: 12/01/22 7:43pm Please use Chrome browser for a more accessible video player Lord Patel has warned it would be a \"catastrophe\" if Yorkshire Cricket Club cannot host international cricket again after the racism scandal at Headingley. Former player Azeem Rafiq laid bare the racism he had endured during his career at Yorkshire, who have since appointed Lord Patel as chair to oversee a new era at the club. Since then, 4,000 people have shared accounts of racism throughout the game with the Independent Commission for Equity in Cricket. The fallout at Yorkshire has seen multiple sponsors abandon the club, a series of sackings among the coaching staff and the ECB removing the privilege of hosting international cricket until positive progress is made. Please use Chrome browser for a more accessible video player \"I think if international cricket doesn't come back here this year, we have two major catastrophes,\" Lord Patel told Sky News. \"One is hundreds of thousands of fans, boys and girls, Yorkshire people, will suffer tremendously because we miss out and secondly there would be a major financial crisis. \"Many of the existing sponsors hopefully will return to us some in the coming weeks - a lot of new sponsors have come and spoken to us, but a lot of it rests on the idea that we get international games back.\" Former Yorkshire and England star Darren Gough has returned to the club as the new director of cricket after leaving his role at Talksport radio. Please use Chrome browser for a more accessible video player Despite one of his interim coaches, Ryan Sidebottom, having to apologise this week for saying in an interview with Sky Sports that the club should \"forget\" about what had happened with Rafiq, Lord Patel accepted this was a genuine mistake and believes the culture has already started to change. \"We have to change and that is not going to happen overnight. We are on the first step of that ladder,\" he said. \"It was the dressing room culture and beyond. \"Only one or two of us have come out like Azeem to do anything about it, and that's what's distressing but that's what the opportunity is. \"Now we can call it out and talk about it.\" Please use Chrome browser for a more accessible video player The club has also signed a partnership agreement with the Lahore Qalandars in Pakistan to share players, ideas and resources. Yorkshire are planning a talent search inspired by how the Qalandars have scoured Pakistan for young cricketers. Lord Patel said: \"Like any franchise, they can buy lots of players (but) what they chose to do is to go out to the remotest parts of Pakistan and hold a talent hunt. \"I have seen the figures for myself - half a million young men got a trial in two and a half years. We can go to the four corners of Yorkshire and give every young boy and girl an opportunity. \"I don't want to stop there. I am talking to another couple of countries in the world where we can do that.\" Lord Patel added that he hoped the cricket authorities, and everyone in the game, is as serious about change as he is. He added: \"I desperately hope that all the counties, the ECB and all the fans of cricket can see that this is the right direction of travel and if we rip ourselves apart we won't get there. \"The only thing we will damage is cricket.\" Cindy Butts, chair of the Independent Commission for Equity In Cricket (ICEC) said: \"We have had an overwhelming response to the first part of our Call for Evidence, with over 4,000 people (from diverse backgrounds) sharing their experiences with us. \"I would like to personally thank everyone who has taken the time to respond. Your contributions are invaluable to our work.\"","image_url":"https://e1.365dm.com/22/01/1920x1080/skysports-lord-patel-cricket_5639643.jpg?20220112191649","source_id":"skysports"},{"title":"Steyn suggests introduction of free hit in Test cricket","link":"https://indianexpress.com/article/sports/cricket/steyn-suggests-introduction-of-free-hit-in-test-cricket-7720179/","keywords":["Cricket","Sports"],"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2022-01-12 18:20:03","full_description":"Former South Africa pacer Dale Steyn has suggested introducing the free hit rule in Test cricket, saying it will help the tail-enders “survive” the longer overs when the bowlers bowls no-balls. In limited overs cricket, a free hit is awarded to the batting side if the bowler bowls a foot fault no ball. In Premium | Dad! India would have to break something in my body to drag me out of there For any free hit, the striker can be dismissed only under the circumstances that apply for a no ball, even if the delivery for the free hit is called wide ball. Free hit for No Ball in Test Cricket… What you think? Will definitely help the bowlers (when batting) survive those extended 7/8 and sometimes 9 ball overs we’ve seen happen before… 6 balls is Hard enough for the tailenders facing a top class life threatening fast bowler. — Dale Steyn (@DaleSteyn62) January 12, 2022 “Free hit for No Ball in Test Cricket? What you think? Will definitely help the bowlers (when batting) survive those extended 7/8 and sometimes 9 ball overs we’ve seen happen before,” Steyn tweeted on Wednesday. https://images.indianexpress.com/2020/08/1x1.png Top Sports News Now IND vs SA 3rd Test: Shami’s unique skills get India back in game Virat Kohli takes 100th catch in a moment of inspiration Petersen skill & grit prompts hope he could be another SA trailblazer Click here for more “6 balls is Hard enough for the tail-enders facing a top class life threatening fast bowler.” Steyn’s comments came during the series-deciding final Test between India and South Africa. The 38-year-old also lauded Indian pace ace Jasprit Bumrah, who registered the figures of 5/42, for his fifer. “Anyway, makes for a interesting discussion. Serious Test Match happening here, well bowled Bumrah for the 5,” Steyn said.","image_url":null,"source_id":"indianexpress"},{"title":"The Ashes: How Jack Leach’s Wanneroo stint helped spark rise of England Test spinner","link":"https://www.perthnow.com.au/sport/cricket/the-ashes-how-jack-leachs-wanneroo-stint-helped-spark-rise-of-england-test-spinner-c-5281014","keywords":null,"creator":["Ben Smith"],"video_url":null,"description":"Jack Leach’s ascension to England’s No.1 spinner can be traced directly back to one solitary season of first-grade cricket with Wanneroo.","content":null,"pubDate":"2022-01-12 18:00:00","full_description":null,"image_url":"https://images.perthnow.com.au/publication/C-5281014/dd0ef217f123e57fd542e92fa22c90e22852f9b7-16x9-x0y0w2448h1376.jpg","source_id":"perthnow"},{"title":"“The selections have just been horrific”: Shane Warne lambasts ECB selectors for England’s poor show in Ashes 2021-22","link":"https://thesportsrush.com/cricket-news-the-selections-have-just-been-horrific-shane-warne-lambasts-ecb-selectors-for-englands-poor-show-in-ashes-2021-22/","keywords":["Cricket","Ashes","Shane Warne"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Shane Warne lambasts ECB selectors for poor selection calls as England’s men lose yet another Ashes series on Australian soil. The England Men’s Cricket team have now lost their third successive Ashes series on Australian soil with a shambolic loss by an innings and 14 runs at the iconic Melbourne Cricket Ground (MCG) in the… The post “The selections have just been horrific”: Shane Warne lambasts ECB selectors for England’s poor show in Ashes 2021-22 appeared first on The SportsRush.","content":"Shane Warne lambasts ECB selectors for poor selection calls as England’s men lose yet another Ashes series on Australian soil. The England Men’s Cricket team have now lost their third successive Ashes series on Australian soil with a shambolic loss by an innings and 14 runs at the iconic Melbourne Cricket Ground (MCG) in the Boxing Day Test. Having already lost the urn, they did show some grit and resistance during the 4th Test match at the Sydney Cricket Ground (SCG) to manage a Draw, and thereby save themselves from the humiliation of yet another series whitewash Down Under. It is worth mentioning that England had lost the 2013-14 Ashes series 5-0 (5) and then the 2017-18 series 4-0 (5)- their two previous tours Down Under. Apart from Joe Root and David Malan, no other England batter showed up with a crucial contribution in the first three Tests to save England from poor shows with the bat one after the other. Apart from the aforementioned, the fans and experts of the game also termed the poor selection calls from the England team selectors as one of the biggest reasons that led to their downfall in the series. England spent more days in isolation to enter Australia than it took them to lose the #ashes — Isabelle Westbury (@izzywestbury) December 28, 2021 Shane Warne lambasts ECB selectors Weighing in on the same, Australia’s legendary spinner Shane Warne too came down heavily on the England team selectors for their consistent logic defying decisions throughout the tour so far. During an interaction with talkSPORT, Warne expressed his amusement with the English selectors when Stuart Broad was benched during the first Test at The Gabba in Brisbane, given his record against David Warner, especially during the last Ashes series in England. “I think England just got a lot of their basics wrong. Their selection, especially in Brisbane during the first Test match. How does Stuart Broad does not play the first Test? What part of Cricket knowledge when you’re sitting around and selecting the team when you think of the 2019 series, and what Broad did to Warner; he owned him. And before the first Test match, they announce Broad’s not playing. “The selections have just been horrific, really. They haven’t got anything right,” exclaimed Warner. He also could not make sense of the team selection during the 2nd Test match at the Adelaide Oval where England opted to rest their spinner Jack Leach. “To play five seamers in Adelaide on a spinning square just didn’t make any sense at all again. I have to say I’ve never seen an England side come over here in Australia and make such bad decisions in terms of selection”, Warne further added.         The post “The selections have just been horrific”: Shane Warne lambasts ECB selectors for England’s poor show in Ashes 2021-22 appeared first on The SportsRush.","pubDate":"2022-01-12 17:52:28","full_description":null,"image_url":null,"source_id":"thesportsrush"},{"title":"PCB chief Ramiz Raja makes BIG statement, says ‘when India plays against Pakistan, world stops to watch’","link":"https://zeenews.india.com/cricket/pcb-chief-ramiz-raja-makes-big-statement-says-when-india-plays-against-pakistan-world-stops-to-watch-2427497.html","keywords":null,"creator":null,"video_url":null,"description":"Raja's statement came after he posted an idea on Twitter about making a proposal to the International Cricket Council (ICC) about holding a Four Nations T20I series comprising both India and Pakistan to be held every year.","content":null,"pubDate":"2022-01-12 17:26:00","full_description":null,"image_url":null,"source_id":"zeenews"},{"title":"After 100 innings it is time to face facts – Jos Buttler is not a Test batsman | Mark Ramprakash","link":"https://www.theguardian.com/sport/2022/jan/12/100-innings-facts-jos-buttler-not-test-batsman-england-ashes","keywords":["Ashes 2021-22","Jos Buttler","England cricket team","Australia cricket team","The Ashes","Australia sport","Cricket","Sport"],"creator":["Mark Ramprakash"],"video_url":null,"description":"England keeper’s lack of trust in and understanding of first-class cricket means he struggles to play each ball on its meritsThis Ashes series was always going to end with some England players facing questions about their international futures, and for one of them the end and the questions have come a little early. Jos Buttler’s injury has spared the selectors a decision about whether to retain him in the team for the final Test in Hobart, but it has forced England to think about who will keep wicket this week and also in the future.There have always been huge expectations on Buttler because of his superb form in white-ball cricket, but precisely 100 innings into his Test career we’ve seen little sign of that form transferring. I remember working with him in Abu Dhabi when England played Pakistan there in 2015. He was struggling a little bit and after he got left out of the third Test we went to the nets, and he unloaded quite a lot of things that were on his mind. What it came down to was a lack of trust in and understanding of first-class cricket, and an uncertainty about how to play at No 6 or No 7 when perhaps the scoreboard is not dictating your approach. In one-day cricket he might be leading a run chase and knowing he needs six an over, or when batting first he might need to take advantage of a powerplay, but Test cricket is not formulaic in the same way. Continue reading...","content":null,"pubDate":"2022-01-12 17:14:11","full_description":"T his Ashes series was always going to end with some England players facing questions about their international futures, and for one of them the end and the questions have come a little early. Jos Buttler’s injury has spared the selectors a decision about whether to retain him in the team for the final Test in Hobart, but it has forced England to think about who will keep wicket this week and also in the future. There have always been huge expectations on Buttler because of his superb form in white-ball cricket, but precisely 100 innings into his Test career we’ve seen little sign of that form transferring. I remember working with him in Abu Dhabi when England played Pakistan there in 2015. He was struggling a little bit and after he got left out of the third Test we went to the nets, and he unloaded quite a lot of things that were on his mind. What it came down to was a lack of trust in and understanding of first-class cricket, and an uncertainty about how to play at No 6 or No 7 when perhaps the scoreboard is not dictating your approach. In one-day cricket he might be leading a run chase and knowing he needs six an over, or when batting first he might need to take advantage of a powerplay, but Test cricket is not formulaic in the same way. In that net session, I suggested that I should throw him a few balls and he should play each ball on its merits, and he seemed to not quite understand that concept. It led me to think that there is so much premeditation in one-day cricket that some players who come through and excel in that format never adapt to the ebb and flow of Test cricket. Buttler came into the Ashes having stood out at the Twenty20 World Cup, and he remains probably one of the top five one-day players in the world. But the contrast between his performances for Eoin Morgan’s white-ball side and those in Australia has been stark, watching him stand deep in the crease, leaden-footed, his weight back, unable to play shots with any authority. When he was reintroduced to the side by Ed Smith it was to be an aggressive enforcer with the bat at No 7, to go out and play with no fear, but we have never really seen that. There is a lesson here for selectors and captains: it is not enough to pick a player and say: “I think you can do this role.” The player also needs to believe it. I remember in my career I had been left out of the first Test in Jamaica but before the second match of the series Michael Atherton asked me to bat No 3. At this stage I had played nine Tests with a top score of 64, the confidence that I had felt making my debut had slowly ebbed away through repeated failures, and I was very much taken aback that he would ask me to bat in front of Robin Smith and Graeme Hick. Michael would say that he had confidence in me, but the player himself has to believe it. I scored two and five. In my time working with the England side, if you feel that a player’s strength is batting aggressively then you would encourage them to play in that fashion regardless of the team’s position in the match – but ultimately the player has to go out and play. This is where role clarity is really important. The one truly successful Jos Buttler Test innings I remember is his 75 at Old Trafford as he and Chris Woakes combined to beat Pakistan in 2020, playing brilliantly on a difficult pitch, but that match had almost become a one-day chase. Wicketkeepers are the heartbeat of a cricket team and they need to be bubbly and give energy to the rest of the side, but in the cricket that I have seen on this tour Buttler has looked stony-faced. Of course some players do this more than others, but if you’re in that role and you don’t bring that energy, you’re struggling for runs and you’re dropping catches, then what exactly are you contributing? As wicketkeeper Buttler averages 29.6, while Jonny Bairstow lost the gloves despite averaging 37.4. It’s hard to quantify someone’s character and presence in a dressing room, and Bairstow’s statistics are so superior that there must be something beyond individual performance that has kept Buttler in the side, but it is a decision that seems increasingly hard to justify. Of those in line to replace him this week and in the future, Bairstow remains a decent option but has for now been ruled out by a thumb injury. Sam Billings is a player that Graham Thorpe and I have always had our eye on because of his orthodox technique and good basics, and may be able to grasp an opportunity if one is given to him . Ollie Pope kept well in Sydney and I believe he has a very bright future so long as he is handled correctly, but it would be strange to see him regularly keeping wicket for England when he does not for Surrey, who in Ben Foakes have the player widely regarded as the best wicketkeeper in English cricket. Joe Root talks about a reset of the Test match team and if his intention is to pick players with long-form cricket in their DNA, people who would focus their attention completely on the first-class game and who could form the spine of a new-look team, it would seem to me that Foakes is precisely that sort of cricketer. I think many people within the game have been surprised not to see him play for England more often, but perhaps his time is about to come.","image_url":"https://i.guim.co.uk/img/media/62f23fc450688dd0478e5e7146e57f8b58713c48/0_244_4634_2782/master/4634.jpg?width=460&quality=85&auto=format&fit=max&s=3da026dfba27dd473ad1819e4049bb26","source_id":"theguardian"},{"title":"India vs South Africa, 3rd Test: Kohli completes 100 catches in Tests, Bumrah gets 7th 5-wicket haul","link":"https://www.indiatvnews.com/sports/cricket/india-vs-south-africa-3rd-test-kohli-completes-100-catches-in-tests-bumrah-gets-7th-5-wicket-haul-2022-01-12-754127","keywords":null,"creator":null,"video_url":null,"description":"Adding another feather to his cap, India skipper Virat Kohli on Wednesday completed 100 catches in Test cricket during Day 2 of the ongoing third and final Test match against South Africa here at Newlands, Cape Town.","content":null,"pubDate":"2022-01-12 17:11:05","full_description":"Adding another feather to his cap, India skipper on Wednesday completed 100 catches in Test cricket during Day 2 of the ongoing third and final Test match against South Africa here at Newlands, Cape Town. The 33-year-old achieved the milestone by taking a spectacular low catch of Temba Bavuma in the slip cordon off the bowling of . With this, Kohli also became the sixth Indian fielder, who isn't a wicket-keeper, to pick 100 or more catches in the longest format of the game. The India skipper brought up the landmark in his 99th Test. Rahul Dravid (209 catches in 163 matches), VVS Laxman (135 catches in 134 matches), (115 catches in 200 matches), Sunil Gavaskar (108 catches in 125 matches), Mohammad Azharuddin - 105 catches in 99 matches Virat Kohli (100* catches in 99 matches) are the Indian cricketers who feature in this elite list. Meanwhile, bagged his seventh five-wicket haul - the joint-most for an Indian seamer after 27 Tests alongside Kapil Dev and Irfan Pathan. Harbhajan Singh (7/120 in 2010/11), S Sreesanth (5/114 in 2010/11) and J Bumrah (5/42 in 2021/22 *) are three bowlers for India who have picked fifers in Cape Town. The 28-year-old Bumrah along with Mohammed Shami (2/39), (2/64) and Shardul Thakur (1/37) helped India bowl out South Africa for 210 in their 1st innings to take a slender 13-run lead on day two of third Test at the Newlands Cricket Ground.","image_url":null,"source_id":"indiatvnews"},{"title":"Dale Steyn suggests introduction of free hit in Test cricket","link":"https://timesofindia.indiatimes.com/sports/cricket/india-in-south-africa/dale-steyn-suggests-introduction-of-free-hit-in-test-cricket/articleshow/88861530.cms","keywords":null,"creator":null,"video_url":null,"description":"Former South Africa pacer Dale Steyn has suggested introducing the free hit rule in Test cricket, saying it will help the tail-enders \"survive\" the longer overs when the bowlers bowls no-balls.","content":null,"pubDate":"2022-01-12 16:52:37","full_description":null,"image_url":null,"source_id":"toi"},{"title":"Afghanistan delay forces fixture reschedule at U19 World Cup","link":"https://sportstar.thehindu.com/cricket/afghanistan-delay-forces-fixture-reschedule-at-u19-world-cup/article38258221.ece","keywords":null,"creator":["Team Sportstar"],"video_url":null,"description":"The fixture schedule for the ICC U19 Men’s Cricket World Cup 2022 has been updated after the delayed arrival of Afghanistan into the region","content":null,"pubDate":"2022-01-12 16:35:25","full_description":null,"image_url":null,"source_id":"sportstar"},{"title":"“Will definitely help the bowlers (when batting)”: Dale Steyn advocates for Free Hit off No-Balls in Test Cricket","link":"https://thesportsrush.com/cricket-news-will-definitely-help-the-bowlers-when-batting-dale-steyn-advocates-for-free-hit-off-no-balls-in-test-cricket/","keywords":["Cricket","Dale Steyn","India","South Africa"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Dale Steyn advocates for Free-Hit off No-Balls in Test Cricket as well in view of bowlers’ survival versus pacers. During the second day of the third Test of the ongoing India’s tour of South Africa in Cape Town, India have bundled up the South African batting line-up for 210 in 76.3 Overs to manage a… The post “Will definitely help the bowlers (when batting)”: Dale Steyn advocates for Free Hit off No-Balls in Test Cricket appeared first on The SportsRush.","content":"Dale Steyn advocates for Free-Hit off No-Balls in Test Cricket as well in view of bowlers’ survival versus pacers. During the second day of the third Test of the ongoing India’s tour of South Africa in Cape Town, India have bundled up the South African batting line-up for 210 in 76.3 Overs to manage a slender 13-run lead in the second innings. Jasprit Bumrah led the Indian pace attack, picking up his 7th five-wicket haul in Test Cricket, returning with figures of 23.3-8-42-5. He was equally well complimented by Umesh Yadav and Mohammed Shami who scalped two wickets each. Akin Virat Kohli for India in the first innings, it was Keegan Petersen (72 (166)) for South Africa, who came up with a lone stand-out performance. However, South African legendary fast bowler Dale Steyn, seemed to be quite concerned for the Proteas bowlers facing the Indian pacers during the final few Overs of their first innings. Dale Steyn advocates for Free-Hit off No-Balls in Test Cricket Post the fall of Keegan Petersen’s wicket, India’s Umesh Yadav opted to bowl a series of Short deliveries, to the Proteas pacers- Kagiso Rabada and Duanne Olivier. While an Umesh Yadav short delivery was uncomfortably fended off by Olivier in the 68th Over, he hit Rabada on the side of the helmet during the 70th Over which prompted the Umpire to call for the physio. Earlier, while Olivier managed to survive a hostile spell of fast bowling off Jasprit Bumrah during the 67th Over, he had to face a total of 7 deliveries in the Over, as Bumrah overstepped on the ultimate delivery. Perhaps taking note of this particular event, Dale Steyn was prompted to advocate for a Free Hit off No-Balls in Test Cricket as well, in view of survival of the tail-enders who find themselves at the receiving end of a barrage of Short deliveries bowled by the opposition pacers. He took to his Twitter handle to ask his followers what they think of this suggestion. The 38-year-old then went on to add that Free Hits off No-Balls would help the bowlers of the batting team to survive the 7-8-9 deliveries that the opposition bowlers bowl to finish their Over. Free hit for No Ball in Test Cricket… What you think? Will definitely help the bowlers (when batting) survive those extended 7/8 and sometimes 9 ball overs we’ve seen happen before… 6 balls is Hard enough for the tailenders facing a top class life threatening fast bowler. — Dale Steyn (@DaleSteyn62) January 12, 2022 For more Cricket related news, click here.           The post “Will definitely help the bowlers (when batting)”: Dale Steyn advocates for Free Hit off No-Balls in Test Cricket appeared first on The SportsRush.","pubDate":"2022-01-12 16:20:32","full_description":null,"image_url":null,"source_id":"thesportsrush"}]}