{"newsArray":[{"title":"News24.com | 2023 World Cup won't be Rob Walter's cross to bear, says CSA's Nkwe","link":"https://www.news24.com/sport/Cricket/Proteas/2023-world-cup-wont-be-rob-walters-cross-to-bear-says-csas-nkwe-20230117","keywords":null,"creator":null,"video_url":null,"description":"Cricket South Africa's director of cricket Enoch Nkwe said newly appointed Proteas white-ball coach Rob Walter won't be strictly judged on the 2023 World Cup that'll be hosted by India later this year.","content":"Cricket South Africa's director of cricket Enoch Nkwe said newly appointed Proteas white-ball coach Rob Walter won't be strictly judged on the 2023 World Cup that'll be hosted by India later this year. The Proteas still need to qualify for that tournament and have five games to achieve that when they play England in three ODIs later this month, along with two against the Netherlands in March and April. Should they fail at the automatic qualification hurdle, they still have the World Cup qualifiers in Zimbabwe to navigate to get themselves to India for later in the year. It's already a tall order for Walter, who will be leaving the Central Stags to join the Proteas as of next month. READ | Langeveldt to leave Proteas men's team while Maketa's future to be debated Nkwe said would be unfair for them to make Walter sleep in a bed that he didn't make, even though they still harbour hopes of automatic qualification for India later this year. \"We're not going to strictly judge him on the 2023 World Cup,\" Nkwe said. \"We do understand that what transpired before his arrival was complicated by us. I know Rob wants to do well. \"He wants every opportunity as a white ball team to do well and win the World Cup. The energies will be invested in qualifying for the World Cup. \"That's the first focus, but also doing so without losing focus of the bigger picture. It will be a fine balance, but the aim is to qualify for the World Cup, but also to deal with goals in small goals in small phases. \"It's almost like we'll have two plans in mind as we look towards the 2027 World Cup, with one looking at the next eight months. \"Then there's the medium to long term plan where we understand we'll be losing some big name players. \"The focus will be on this year's World Cup and qualifying for it, but he won't be purely judged on this year's World Cup.\" CSA's chief executive officer Pholetsi Moseki said the splitting of the coaching role that Mark Boucher vacated at the end of last year's T20 World Cup in Australia was something that's always been in their pipeline. Moseki said the decision was also informed by the high volume of International Cricket Council events over the next eight years that demanded the splitting of the job. Shukri Conrad was hired as the Test match coach who will also work with the high-performance structures during dormant Test match periods. READ | Shukri Conrad, Proteas' 'calm' new Test coach: 'He understands our past, challenges and youngsters' \"The appointment of the DoC meant he came with his strategies, and one of the things he sold to us was the splitting of the coaching job,\" Moseki said. \"It's been successful for other countries, and this cycle going forward, there's an ICC event every year for the next eight years. \"The white ball coach will be busy focussing on those events, but red ball cricket is key, and he will be busy. \"The red-ball coach will also be contributing to the high performance structure.\"","pubDate":"2023-01-17 20:08:25","image_url":"https://scripts.24.co.za/img/sites/sport24.png","source_id":"news24","country":["south africa"],"category":["sports"],"language":"english"},{"title":"Cricket-West Indies recall fast bowler Gabriel for Zimbabwe tests","link":"https://www.thestar.com.my/sport/cricket/2023/01/18/cricket-west-indies-recall-fast-bowler-gabriel-for-zimbabwe-tests","keywords":null,"creator":null,"video_url":null,"description":"(Reuters) - West Indies have recalled fast bowler Shannon Gabriel and left-arm spinners Gudakesh Motie and Jomel Warrican for the two-test series in Zimbabwe, the country's cricket board said on Tuesday. Read full story","content":null,"pubDate":"2023-01-17 19:04:00","image_url":"https://apicms.thestar.com.my/uploads/images/2023/01/18/1905998.jpg","source_id":"thestar_my","country":["malaysia"],"category":["sports"],"language":"english"},{"title":"News24.com | CSA chief Moseki notes 'open' Proteas coaching hunt was vital to regaining broader trust","link":"https://www.news24.com/sport/Cricket/Proteas/csa-chief-moseki-notes-open-proteas-coaching-hunt-was-vital-to-regaining-broader-trust-20230117","keywords":null,"creator":null,"video_url":null,"description":"Cricket South Africa (CSA) believe their comprehensive recruitment process not only brought them the two best candidates to coach the Proteas, but put pushed them further on the path to respectability.","content":null,"pubDate":"2023-01-17 15:42:35","image_url":"https://scripts.24.co.za/img/sites/sport24.png","source_id":"news24","country":["south africa"],"category":["sports"],"language":"english"},{"title":"Rohit Sharma confirms Ishan Kishan's ODI role, praises Siraj's improvement - ICC Cricket","link":"https://news.google.com/__i/rss/rd/articles/CBMiKGh0dHBzOi8vd3d3LmljYy1jcmlja2V0LmNvbS9uZXdzLzMwMjU2MDLSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Rohit Sharma confirms Ishan Kishan's ODI role, praises Siraj's improvement  ICC CricketMatch Preview - India vs New Zealand, New Zealand in India 2022/23, 1st ODI  ESPNcricinfoHigh-flying India eye another scalp | Cricbuzz.com - Cricbuzz  CricbuzzIND vs NZ: 3 Indian Players Who Can Retire From ODIs After New Zealand Series  Cricket AddictorIndia vs New Zealand | ODI series 2023 | Preview  Royal Challengers BangaloreView Full coverage on Google News","content":null,"pubDate":"2023-01-17 15:29:33","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Yashasri, India’s replacement for the injured Hurley Gala","link":"https://www.orissapost.com/yashasri-indias-replacement-for-the-injured-hurley-gala/","keywords":["Sports","Uncategorized","Hurley Gala","ICC","mumbai","south africa","U19 Women's World Cup","United Arab Emirates","Yashasri Soppadhandhi"],"creator":["Post News Network"],"video_url":null,"description":"Benoni: The Event Technical Committee of the ICC U19 Women’s T20 World Cup 2023 has approved Yashasri Soppadhandhi as a replacement for the injured Hurley Gala in the India squad. Yashasri was named as a replacement after Hurley was ruled out of the event after suffering a laceration in her right thumb which required stitches […]","content":"Benoni: The Event Technical Committee of the ICC U19 Women’s T20 World Cup 2023 has approved Yashasri Soppadhandhi as a replacement for the injured Hurley Gala in the India squad. Yashasri was named as a replacement after Hurley was ruled out of the event after suffering a laceration in her right thumb which required stitches and ruled her out of participating in the remainder of the tournament. Hurley, the 16-year-old pacer from Mumbai, was not in the playing XI in India U19’s two matches so far. The replacement of a player requires the approval of the Event Technical Committee before the replacement player can be officially added to the squad, the ICC informed in a release Tuesday. BAD NEWS: Hurley Gala is ruled out of World Cup. Yashasri Soppadhandhi replaces her in the India squad. Gala was ruled out following the laceration of her right thumb which required stitches.#CricketTwitter #U19T20WorldCup Getty pic.twitter.com/VbSARrug5U — Female Cricket (@imfemalecricket) January 17, 2023 The Event Technical Committee of the ICC U19 Women’s T20 World Cup 2023 consists of Sarah Edgar (Chair), ICC Senior Manager Event Operations, Snehal Pradhan, ICC Women’s Cricket Manager, Sivuyile Mqingwana, Tournament Director, Claire Terblanche, (Cricket South Africa), Lydia Greenway (Independent), Stacy-Ann King (Independent). India U19 have won both their matches in the U19 Women’s World Cup so far, beating South Africa U19 by seven wickets and United Arab Emirates (UAE) by 122 runs. IANS","pubDate":"2023-01-17 15:09:07","image_url":"https://www.orissapost.com/wp-content/uploads/2023/01/Hurley-Gala-300x203.jpg","source_id":"orissapost","country":["india"],"category":["sports"],"language":"english"},{"title":"'Love Playing According To Situation': Ishan Kishan On Maiden Test Call-Up","link":"https://sports.ndtv.com/cricket/enjoy-red-ball-cricket-love-playing-according-to-situation-ishan-kishan-on-maiden-test-call-up-3700637","keywords":null,"creator":null,"video_url":null,"description":"Indian wicketkeeper-batter Ishan Kishan said on Tuesday that he enjoys playing red-ball cricket, because the ball swings and one has to play according to situations without any pressure of scoring quick runs.","content":null,"pubDate":"2023-01-17 14:35:02","image_url":null,"source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Bumrah doesn’t need to change his action, injuries are part and parcel of cricket: Bharat Arun","link":"https://www.orissapost.com/bumrah-doesnt-need-to-change-his-action-injuries-are-part-and-parcel-of-cricket-bharat-arun/","keywords":["Sports","Abu Dhabi","australia","Bharat Arun","India","ipl","Jasprit Bumrah","Michael Holding","Mohsin Khan","Mukesh Choudry","NCA","Shivam Mavi","shoaib akhtar","Sri Lanka","uae","Umran Malik"],"creator":["Post News Network"],"video_url":null,"description":"Dubai: Former India bowling coach Bharat Arun feels that Jasprit Bumrah, who is currently recovering from his injury, doesn’t need to change his action, saying that injuries are part and parcel of the game and the premier pacer will certainly make a comeback to the side. Before the 2022 T20 World Cup, Bumrah had suffered […]","content":"Dubai: Former India bowling coach Bharat Arun feels that Jasprit Bumrah, who is currently recovering from his injury, doesn’t need to change his action, saying that injuries are part and parcel of the game and the premier pacer will certainly make a comeback to the side. Before the 2022 T20 World Cup, Bumrah had suffered a back injury, which forced him to miss the mega event in Australia. After months of recovery, the pacer had cleared a match simulation test at the NCA in Bengaluru and was on his way back into the side after being named in the ODI squad for the Sri Lanka series. However, he experienced discomfort while building up to higher workloads and was withdrawn from India’s ODI squad against Sri Lanka, also getting ruled out from the first two Tests against Australia. Notably, medical experts and even the cricketers like Shoaib Akhtar and Michael Holding in the past have called for a change in Bumrah’s bowling action in order to remain injury free and prolong his international career. However, the former India bowling coach doesn’t think so. “Bumrah is the number one bowler and has been very successful with his action, so why should he ever change that? Tell me about the one fast bowler who hasn’t got injured, injuries are part and parcel of the game,” Bharat Arun, who is part of the Abu Dhabi Knight Riders coaching set-up at ILT20, told IANS in an interview. “Bumrah has done enough for Indian cricket and being injured is also part of his career and I am sure he will come out of it,” he added. The 24-year-old pacer Shivam Mavi, who recently made his India debut in T20Is against Sri Lanka, was also part of the KKR franchise till IPL 2022 and Arun who has worked with him, sees a bright future for the young pacer. “Mavi has good potential, and is very talented and I think it’s just about holding his nerve. He’s got all the qualities to be a good international bowler. It’s how he absorbs the pressure and how he comes out of it that will determine his success in the future,” he said. The experienced coach is also very pleased and optimistic about the Indian fast bowling pool for the future. “There are a lot of good fast bowlers. The IPL has also thrown many names like Mohsin Khan from LSG, Mukesh Choudry from CSK was also exciting. Also, Arshdeep has done a great job and Umran Malik is there. So I think the fast bowling pool is looking pretty healthy for India and it’s great to have this kind of talent for the future,” Arun said. Talking about the difference between coaching an international team and a league franchise, the 60-year-old mentioned that it’s both exciting and challenging. He also spoke about keeping a track of the fast bowlers in different teams. “I’ve always been a part of a franchise coach before I was an Indian coach. So it is exciting, it has its own challenges and I’m happy about it,” Arun said. “Yes, modern-day players play for different international teams, franchises, leagues but we keep a tab on them. Of course, it can be an advantage or a disadvantage if you are not with them throughout. It’ll be great if we can spend more time but that’s the way the leagues have been held. So, whatever limited time you have, you tried to get the best out of them,” he said. The coach feels ILT20 will provide a good opportunity for UAE fast bowlers to learn from the big names of the game. “They are very eager to learn at a big tournament like ILT20. The first time I think they are on a big stage where they are rubbing shoulders with international stars to prove their mettle. And they’re very quick to learn and it’s quite exciting to be working with them,” he concluded. IANS","pubDate":"2023-01-17 14:09:00","image_url":"https://www.orissapost.com/wp-content/uploads/2022/01/Jasprit-Bumrah-300x169.jpg","source_id":"orissapost","country":["india"],"category":["sports"],"language":"english"},{"title":"Ishan, Chahal, Shubman Elated On Meeting 'RRR' Star Jr NTR. See Pics","link":"https://sports.ndtv.com/cricket/man-of-masses-ishan-kishan-yuzvendra-chahal-shubman-gill-elated-after-meeting-rrr-star-jr-ntr-3700521","keywords":null,"creator":null,"video_url":null,"description":"Indian cricket team players Yuzvendra Chahal, Shubman Gill and Ishan Kishan on Tuesday met 'RRR' star Jr NTR","content":null,"pubDate":"2023-01-17 14:01:35","image_url":null,"source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"India vs New Zealand ODIs preview: Hosts eye World No. 1 crown as Ishan Kishan, Suryakumar aim to cement their place","link":"https://www.firstpost.com/firstcricket/sports-news/india-vs-new-zealand-odis-preview-opportunity-for-ishan-kishan-suryakumar-yadav-as-hosts-eye-world-no-1-crown-12002842.html","keywords":["First Cricket News"],"creator":["Rachit Kanaujia"],"video_url":null,"description":"India vs New Zealand ODIs preview: Hosts eye World No. 1 crown as Ishan Kishan, Suryakumar aim to cement their place","content":"After thrashing Sri Lanka in the recently concluded three-match ODI series, India gear up for the stern test as they host the number 1 ODI team in the world, New Zealand, in three ODIs starting from Wednesday, 18 January.India will be riding high on confidence after a 3-0 ODI series whitewash over Sri Lanka, however, they will be wary of the threat that New Zealand possess especially in the 50-over format. Moreover, the Black Caps are coming off a grand 2-1 ODI series win over Pakistan which means that they won’t be short of confidence either even when they will be without the services of star players Kane Williamson and Tim Southee for the series.Hello Hyderabad! First training of the India Tour ahead of ODI 1 on Wednesday. #INDvNZ pic.twitter.com/MR55MZrvyE— BLACKCAPS (@BLACKCAPS) January 16, 2023Hence, fans can anticipate a tough, nail-biting contest between the two teams.Also, the three-match series will serve as a litmus test for both teams ahead of the 2023 ODI World Cup, which is set to take place in India later this year.India eye World No. 1 CrownThe Men in Blue have a chance to become the number one ODI team in the world and for that, they will have to win all three ODIs against New Zealand.Notably, Rohit Sharma-led India are currently fourth in the ODI rankings with 110 ranking points. They are behind top-placed New Zealand, second-placed England and third-placed Australia in the rankings. However, if India manage to clean-sweep the series against the Kiwis then they will surpass New Zealand with 114 points, while the Black Caps, who currently have 117 points, will drop down to fourth place due to the deduction of points for losing games.Meanwhile, England and Australia will remain second and third respectively.Kohli eager to continue rich form as Rohit aims for a big scoreStar India batter Virat Kohli looks in red-hot form as he smashed two centuries in the recently concluded ODI series against Sri Lanka and was adjudged the ‘Player of the Series’. The 34-year-old will be eager to continue his rich vein of form when he takes on New Zealand’s attack as that will multiply his morale and boosts his confidence in the build-up to the ODI World Cup.2️⃣8️⃣3️⃣ runs in three matches with a top-score of 1️⃣6️⃣6️⃣* 👌👌Congratulations to @imVkohli on winning the Player of the Series award 👏👏Scorecard ▶️ https://t.co/q4nA9Ff9Q2#INDvSL | @mastercardindia pic.twitter.com/WIlPU9sJYp— BCCI (@BCCI) January 15, 2023Meanwhile, India captain Rohit Sharma found his touch in the first ODI against Sri Lanka but wasn’t much effective in the remaining two games. He got off to starts but failed to convert it into a big score, which he would like to change in the upcoming ODI series.Chance for Ishan Kishan and Suryakumar to prove their worthQuestions were raised when Team India management and skipper Rohit decided to bench Ishan Kishan for the ODI series against Sri Lanka despite the fact that the young opener had smashed the fastest double hundred in the history of ODIs, against Bangladesh in the preceding series.Shubman Gill was picked over Kishan to open with Rohit and the 23-year-old Punjab batter didn’t disappoint as he registered scores of 70, 21, and 116 in the Sri Lanka series, thus giving enough reasons to the team management not to tinker with the opening order.Of maiden Test call-up, emotions & excitement to play red-ball cricket & more 👌 👌🎥 🎥 @ShubmanGill turns anchor to interview @ishankishan51 on his selection in #TeamIndia squad for the first two #INDvAUS Tests 👍 pic.twitter.com/oinLYky95Q— BCCI (@BCCI) January 17, 2023However, Ishan Kishan is still likely to make it to the playing XI for the ODI series against New Zealand due to the unavailability of KL Rahul, who had asked for some time off due to personal reasons.Hence, Kishan is expected to keep wickets in Rahul’s absence, but he will have to bat at number four, where Rahul bats. The adjustment should not be much of an issue for Kishan as he has batted in the middle order thrice in the 10 ODIs he has played so far.So, if Kishan gets the playing time then he will have to make sure that he gives enough reasons to selectors and Rohit to consider him in their ODI plans rather than making him warm the bench especially when it’s a World Cup year.Suryakumar Yadav, on the other hand, has already shown the world how lethal he can be when it comes to the T20 format, but now he will have to make name for himself in the 50-over format.Yadav is likely to be included in the playing XI in the ODIs against New Zealand as middle-order batter Shreyas Iyer has been ruled out of the series due to a back problem.UPDATE – Team India batter Shreyas Iyer has been ruled out of the upcoming 3-match ODI series against New Zealand due to a back injury.Rajat Patidar has been named as his replacement.More details here – https://t.co/87CTKpdFZ3 #INDvNZ pic.twitter.com/JPZ9dzNiB6— BCCI (@BCCI) January 17, 2023Iyer, who was one of India’s steady ODI batters in 2022, failed to convert his starts against Sri Lanka, managing only scores of 28, 28, and 38 in the three games. The below-par show has put Iyer’s place in the ODI setup in jeopardy while creating an opportunity for Suryakumar Yadav to cement his place in the side and assist another middle-order hard-hitter Hardik Pandya in adding the firepower at the back-end.Kul-Cha to reunite or will Shahbaz playChoosing between Yuzvendra Chahal and Kuldeep Yadav is going to be a conundrum for India as they have been going with only one wrist spinner in their playing 11 to maintain their team combination. To add to that, Shahbaz Ahmed has also been included in the team in place of Axar Patel, who has also been given break for the series due to personal reasons.Kuldeep’s form and ability to pick wickets in powerplay overs are the biggest plus but he has often been benched by the management for no understandable reason. Chahal, on the other hand, was rested for the second and third ODI against Sri Lanka due to a sore shoulder, but he is expected to be available for the opening ODI against New Zealand.It is yet to be seen if the management will pick both Kuldeep and Chahal in the playing XI or if will they place their bet on Shahbaz or Washington Sundar, who could be good options to tackle the left-handers in the New Zealand camp.Wickets with new ball ✅ Successful run-out off his own bowling ✅@mdsirajofficial speaks about his 4️⃣-wicket haul, including the special wobble-seam delivery to dismiss Hasaranga and shares his excitement ahead of the #INDvNZ ODI series opener in Hyderabad 😃 pic.twitter.com/2O4oUquNLC— BCCI (@BCCI) January 16, 2023Meanwhile, in the pace department, Mohammed Siraj has been brilliant and consistently providing early wickets for his team, while veteran Mohammad Shami has been partnering well with Siraj and has the knack of providing crucial breakthroughs. Also, young speedster Umran Malik has been successful in picking up wickets in the middle overs. Hence, the three fast bowlers are likely to start against New Zealand, while all-rounder Hardik Pandya will be the fourth pacer in the team.Squads: India: Rohit Sharma (Captain), Shubman Gill, Ishan Kishan (wk), Virat Kohli, Rajat Patidar, Suryakumar Yadav, KS Bharat (wk), Hardik Pandya (vice-captain), Washington Sundar, Shahbaz Ahmed, Shardul Thakur, Yuzvendra Chahal, Kuldeep Yadav, Mohd. Shami, Mohd. Siraj, Umran Malik.New Zealand: Tom Latham (captain), Finn Allen, Doug Bracewell, Michael Bracewell, Mark Chapman, Devon Conway, Jacob Duffy, Lockie Ferguson, Daryl Mitchell, Henry Nicholls, Glenn Phillips, Mitchell Santner, Henry Shipley, Ish Sodhi, Blair Tickner.Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2023-01-17 13:56:11","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/01/Team-India-640_Sportzpics.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Robin Uthappa which team in IPL 2023: Will Robbie Uthappa play IPL 2023?","link":"https://thesportsrush.com/cricket-news-robin-uthappa-which-team-in-ipl-2023-will-robbie-uthappa-play-ipl-2023/","keywords":["Cricket","Delhi Capitals","ILT20 League 2023","India","Indian Premier League","IPL 2023","Robin Uthappa"],"creator":["Dixit Bhargav"],"video_url":null,"description":"A brave and vocal admirer of the concept of Indian cricketers participating in overseas T20 leagues, former India batter Robin Uthappa appears to have found his touch instantly in the first such opportunity for himself. Like all things in life, Uthappa had to sacrifice something in order to achieve another. Hence, he chose to retire… The post Robin Uthappa which team in IPL 2023: Will Robbie Uthappa play IPL 2023? appeared first on The SportsRush.","content":"A brave and vocal admirer of the concept of Indian cricketers participating in overseas T20 leagues, former India batter Robin Uthappa appears to have found his touch instantly in the first such opportunity for himself. Like all things in life, Uthappa had to sacrifice something in order to achieve another. Hence, he chose to retire from international cricket to be eligible for exploring opportunities outside of India. Much like another recently retired Indian cricketer in Yusuf Pathan, Uthappa is among the two Indian cricketers to be playing the inaugural season of International League T20. Co-incidentally, both Pathan and Uthappa are representing Dubai Capitals in ILT20 2023. While neither of the two ever represented Delhi Daredevils or Delhi Capitals in the Indian Premier League, they are currently plying their trade in the UAE for a team owned by the same owners. Currently the second-highest run-scorer in the tournament, Uthappa’s 122 runs in two innings have come at an average and strike rate of 61 and 154.43 respectively. Pathan, meanwhile, scored 6 (5) in his only innings thus far. .@robbieuthappa poses with the DP World ILT20 green belt (highest run-getter to date) following his outstanding 79, which took him to the top of the run-getters list. #DPWorldILT20 #ALeagueApart pic.twitter.com/hEus5izVAs — International League T20 (@ILT20Official) January 16, 2023 Uthappa, 37, is also keeping wickets for Capitals which further strengthens his position in the Playing XI. Although ILT20 doesn’t qualify to be a T20 tournament on paper, there is no hiding to the fact that a stellar season for Uthappa will bring him more T20 opportunities in the near future. Will Robin Uthappa play IPL 2023? Ninth-highest run-scorer in the history of the IPL, Uthappa has amassed 4,957 runs in 205 matches across 15 seasons at an average of 27.51 and a strike rate of 130.35 including 27 half-centuries. Having said that, with him having taken part in ILT20, Uthappa is no more permitted to partake in the IPL. One of the eight cricketers released by Chennai Super Kings a couple of months ago in their preparation for IPL 2023 auction, Uthappa hadn’t put his name up for the auction ahead of the 16th season of the IPL. The post Robin Uthappa which team in IPL 2023: Will Robbie Uthappa play IPL 2023? appeared first on The SportsRush.","pubDate":"2023-01-17 13:48:51","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"India vs Australia: Ishan Kishan excited for red-ball cricket following his maiden Test call-up; watch video","link":"https://www.firstpost.com/firstcricket/sports-news/india-vs-australia-ishan-kishan-excited-for-red-ball-cricket-following-his-maiden-test-call-up-watch-video-12002312.html","keywords":["First Cricket News"],"creator":["FP Trending"],"video_url":null,"description":"India vs Australia: Ishan Kishan excited for red-ball cricket following his maiden Test call-up; watch video","content":"Young India batter Ishan Kishan seems to be on cloud nine after earning the call-up to don the whites for the first time. On 13 January, the Board of Control for Cricket in India (BCCI) announced the squad for the upcoming white-ball series against New Zealand, followed by a 17-man unit for the first two Tests against Australia. Kishan has made it to all three squads, thanks to his impressive form in recent times. However, though he has already demonstrated his quality in the limited-over formats, the 24-year-old still has to prove his worth in red-ball cricket.Ahead of making his debut in the longest format, Kishan expressed his excitement while speaking with his teammate Shubman Gill in an exclusive interview on BCCI’s official Twitter.Of maiden Test call-up, emotions & excitement to play red-ball cricket & more 👌 👌🎥 🎥 @ShubmanGill turns anchor to interview @ishankishan51 on his selection in #TeamIndia squad for the first two #INDvAUS Tests 👍 pic.twitter.com/oinLYky95Q— BCCI (@BCCI) January 17, 2023 During the session, Gill first showered much praise on his fellow batter, referring to Kishan’s recent swashbuckling form in white-ball cricket. Then, he queried about his fellow opener’s feelings on starting off a new chapter of his career in Test cricket. Kishan responded with a hearty smile and revealed that according to his father, Test cricket possesses the most challenges and demands the batter to be at his best. He further said, “I am very happy to get the opportunity. In my opinion, Test is considered the purest form of cricket. So, as I have the opportunity, I will try to get the best out of it.”Gill then asked about Kishan’s experience at the Ranji Trophy. In reply, the southpaw mentioned the challenging condition of red-ball matches. “I enjoy playing red-ball cricket. The ball swings a lot there and the situation remains tight. However, you get the time to settle as there is no pressure to score runs. Sometimes it looks easy, sometimes difficult but I have enjoyed playing in any condition in the Ranji Trophy,” he stated.Looking at his Ranji career so far, Kishan has appeared in 87 matches. The Mumbai batter has racked up a total of 3026 runs at a batting average of 38.79. He has recorded as many as 15 half-centuries and 5 hundred in the domestic circuit.Kishan kicked off his debut innings with a boundary in both ODI and T20I. Revealing the amazing fact, Gill asked if he would look to continue the trend in Test cricket too. Kishan showed great maturity and noted that he would look at the game from the team’s perspective.The wicketkeeper-batter explained in detail, “I come in to bat at No 6 in Tests. In that case, I need to read the situation first before going for any big shot. If the team is not in a good situation and I make any mistake, it will let the team down. Without thinking about fours and sixes, it’s more important to bring your team to a comfortable position.”The injury of Rishabh Pant has opened the slot for a wicketkeeper in the red-ball team. Apart from Kishan, KS Bharat has also been included in the squad. India and Australia will square off for the opening Test starting on 9 February at the VCA Stadium, Nagpur.Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2023-01-17 13:30:08","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/01/Ishan-Kishan.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"'No one can come close to him': Ex-CSK opener Srikkanth Anirudha calls Virat Kohli the greatest batter across formats","link":"https://www.firstpost.com/firstcricket/sports-news/no-one-can-come-close-to-him-ex-csk-opener-srikkanth-anirudha-calls-virat-kohli-the-greatest-batter-across-formats-12002382.html","keywords":["First Cricket News"],"creator":["Feroz Khan"],"video_url":null,"description":"'No one can come close to him': Ex-CSK opener Srikkanth Anirudha calls Virat Kohli the greatest batter across formats","content":"Comparison. An inevitable, unavoidable and arguably, a necessary component of a conversation around any sport.From teams to coaches, support staff to management and right down to the fans, we love drawing comparisons and building intriguing narratives. One doesn’t have to go too deep into the past to dig out examples of the seriousness such conversations merit.Lionel Messi vs Cristiano Ronaldo? Roger Federer vs Rafael Nadal? Lewis Hamilton vs Michael Schumacher? Usain Bolt vs Carl Lewis. Or closer home: Sachin Tendulkar vs Virat Kohli.Tendulkar retired as international cricket’s most prolific batter and continues to be so nearly a decade later since he paid his final obeisance to the hallowed turf of Wankhede Stadium as an India player.Stats are proof that Kohli is the sole batter who has come anywhere close to threatening Tendulkar’s record for real. His slump in across formats and especially in Test cricket may have pushed him behind his competitors but Kohli remains peerless in limited-overs cricket.After a brief slumber, the debate has been sparked to life thanks to Kohli’s recent run that saw him peel off three centuries from four ODI innings – a happy reminder of the time when it seemed ridiculously easy for him to get to three figures.His latest hundred was also the 46th of his career and he’s now just three centuries away from equalling Tendulkar’s record of 49 such scores. It’s quite possible Kohli will equal or even surpass the legendary batter this year itself and it surely will lead to endless discussions on who gets the bragging rights to be the greatest ever batter?Then there are a few prominent former cricketers who cannot fathom how players from different eras can be pitted against each other considering the changes in playing conditions over the years.However, for Srikkanth Anirudha, a former Chennai Super Kings opener and son of the famous World Cup winner Kris Srikkanth, there’s nothing wrong in making comparisons.“There is nothing wrong in comparing,” Anirudha tells News18 CricketNext in an exclusive conversation. “I am a firm believer that’s what we play sport for. When we were young, we discussed who is better: Sachin or Gavaskar? Sachin or Vivian? Those conversations should be had. We keep asking who is better: Messi or Ronaldo? Messi or Pele? Messi or Maradona?”Anirudha though adds that while it’s very difficult to prove who is better but in terms of impact on Indian cricket, nobody will surpass Tendulkar.“Yes, it’s so difficult (to ascertain who is better). They are only opinions. You can throw any stats you want. In terms of impact and longevity, nobody is going to be better than Sachin Tendulkar. He did so much for Indian cricket. There is no doubting that. Today, if cricketers are getting so much money, so much of ad revenue coming into the sport, it’s originally because of the 1983 side led by Kapil Dev and then Sachin took it to another level,” he said.“The interesting thing about cricket is that it’s very much like the NBA. How Magic Johnson and Larry Bird brought the NBA back, then Michael Jordan became everything. And today you have a LeBron James. I would compare that with cricket. Kapil Dev brought cricket back, money into Indian cricket and then Sachin took it to another level. And now there’s Virat Kohli,” he added.But for Anirudha, Kohli is the greatest batter across formats.“For me, across formats, he’s (Kohli) the greatest batsman ever. If it’s just Test cricket, Sachin is ahead but when you take ODIs and T20s and combine all of that, his fitness, I don’t think anyone is close to him,” he said.Anirudha represented Tamil Nadu in the domestic circuit and scored over 4000 runs across formats between 2004 and 2019. He also played in IPL representing Chennai Super Kings and Sunrisers Hyderabad.The 35-year-old is now dabbling in commentary and is part of JioCinema’s expert panel for the inaugural SA20.Recalling his days representing CSK, the former opening batter says he was lucky to have played alongside MS Dhoni and explains how the franchise has been so successful over the years and why players, current and former, fondly remembering their association with the Chennai-based outfit.“I was actually very lucky to have been part of CSK’s golden period. What was amazing about the entire franchise and why we were successful was because right from the top bosses to MS Dhoni and to players, the mentality was always to never give up. Actually when we first won, we were nearly out of it before bouncing back. That belief and more importantly how well they take care of you, make you feel comfortable, make sure they put you in the right position, ensuring a right environment, atmosphere around the dressing room,” Anirudh said.He continued, “At that particular level, everybody is equally talented. It’s just the matter of who gets the right opportunity and atmosphere to perform. That’s the only difference. CSK had it. And when you have a guy like MS Dhoni leading, you have a massive advantage. The captain is crucial and so is the management. So, I was very lucky.”Anirudha is enjoying his stint as a commentator and reveals that he was planning his transition from a player to an expert for some time now.“Playing the sport is definitely more challenging without a doubt,” he said. “There is no comparison because so much goes into playing a sport. But the transition has been very smooth. Guys have been helping me a lot. It’s been amazing actually, enjoying a lot. I was thinking about it for the last three years, I’d started my own YouTube channel. I still do play cricket and I’m enjoying both.”He also predicted that SA20 is going to be quite beneficial to the South African national cricket team as their domestic players will get more opportunities to rub shoulders with international stars.“In a matter of a few years’ time you will see very good domestic South African cricketers come up and it’s going to be amazing for their cricket. Expect South Africa to be a formidable force in a few years’ time, definitely,” Anirudha said.Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2023-01-17 12:36:25","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/01/Virat-Kohli.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Boult, Southee’s absence leaves massive hole, Sodhi too out of first ODI: Latham","link":"https://www.orissapost.com/boult-southees-absence-leaves-massive-hole-sodhi-too-out-of-first-odi-latham/","keywords":["Sports","Blair Tickner","Doug Bracewell","Henry Shipley","India","ipl","Ish Sodhi","kiwis","Kuldeep Yadav","Lockie Ferguson","new zealand","pakistan","Tim Southee and Trent Boult","Tom Latham","virat kohli","world cup","Yuzvendra Chahal"],"creator":["Post News Network"],"video_url":null,"description":"Hyderabad: Experienced pacers Tim Southee and Trent Boult’s absence leaves a “massive hole” in the New Zealand squad but it also provides a chance to fringe players to step up during the India tour, stand-in-captain Tom Latham said Tuesday. While Southee has gone back home after a successful tour of Pakistan, Boult is playing the […]","content":"Hyderabad: Experienced pacers Tim Southee and Trent Boult’s absence leaves a “massive hole” in the New Zealand squad but it also provides a chance to fringe players to step up during the India tour, stand-in-captain Tom Latham said Tuesday. While Southee has gone back home after a successful tour of Pakistan, Boult is playing the ILT20 in the UAE, having opted out of a New Zealand central contract. In the batting department, the Kiwis will miss the services of regular skipper Kane Williamson. “They (Boult, Southee, Williamson) are not in the side and that leaves a massive hole for us. On the other hand, it presents an opportunity for other guys who have been around the squad. Everyone has played international cricket in the squad which is a bonus,” Latham during the pre-match press conference. “It is their turn to step up. Lucky we have Lockie Ferguson who has played a lot of cricket in India,” said Ferguson will lead the pace attack in the company of Blair Tickner, Doug Bracewell and Henry Shipley. The southpaw also informed that senior spinner Ish Sodhi has been ruled out of the first ODI due to a niggle. Sodhi did turn up in the nets Tuesday but did not bowl with the usual intensity. A fine player of spin, Latham led from the front by spending maximum time in the nets. “Unfortunately a niggle for Ish. He won’t be available tomorrow but fingers crossed he will be available for the next couple of games,” said Latham. New Zealand go into the India ODIs after a memorable 2-1 series win in Pakistan. With the ODI World Cup scheduled in India in October-November, Latham said the series gains a lot of significance. “The cricket that we played in Pakistan was really good. Some of them had not toured Pakistan ever and to come up with a series win was really nice. Over here, we will try and adapt to the conditions as much as we can. “Surfaces in India will potentially be a bit better than what we had in Pakistan. Every time we play India it is a competitive series,” he said. In the context of the World Cup, Latham added: “This is our last opportunity to play in these conditions before the World Cup which is not too far away. We will just try to take as many learnings as we can from these conditions. Luckily enough most of the guys have played in Indian conditions.” Latham said they have done their homework against the Indian bowlers, including the spin duo of Yuzvendra Chahal and Kuldeep Yadav. Playing in Pakistan also served their batters well ahead of the India tour. “We are lucky we play these guys (India) a lot here or back home. We have been talking to the guys who have played in India whether in the IPL or international games, in terms of trying to read different deliveries. Spin always plays a big part in India.” Virat Kohli is back to scoring hundreds at will, but Latham said the team has made its plans for the star India batter. “Virat has been playing some great cricket. Looks like he is hitting the ball well. We need to plan as best as we can like we do our scouting on all those guys. We will try to make it as tough as possible for him (to score runs),” he added. PTI","pubDate":"2023-01-17 12:13:45","image_url":"https://www.orissapost.com/wp-content/uploads/2018/12/NZ-Latham-300x205.jpg","source_id":"orissapost","country":["india"],"category":["sports"],"language":"english"},{"title":"My father said ‘Test has the real challenges’: Ishan Kishan recalls moment of his maiden Test call-up","link":"https://www.orissapost.com/my-father-said-test-has-the-real-challenges-ishan-kishan-recalls-moment-of-his-maiden-test-call-up/","keywords":["Sports","BCCI Australia","Board of Control for Cricket","Chris gayle","Fakhar Zaman","India","Ishan Kishan","MARTIN GUPTILL","rohit sharma","Sachin Tendulkar","Shubhman Gill","Twitter","Virender Sehwag"],"creator":["Post News Network"],"video_url":null,"description":"New Delhi: Young wicketkeeper batter Ishan Kishan, who was given his maiden call-up to the Test team for the first two matches against Australia, has recalled the moment when he revealed this news to his father. Speaking of his maiden Test call-up and excitement to play red-ball cricket in a conversation with Shubhman Gill, Kishan […]","content":"New Delhi: Young wicketkeeper batter Ishan Kishan, who was given his maiden call-up to the Test team for the first two matches against Australia, has recalled the moment when he revealed this news to his father. Speaking of his maiden Test call-up and excitement to play red-ball cricket in a conversation with Shubhman Gill, Kishan revealed that when he broke the news of his Test call, his father said, “Test has the real challenges. You have to work hard like this”. “I am very happy. Whenever I was doing well in white-ball cricket my father used to say that Test cricket is the real deal. He says that Test has the real challenges, it tests the skills of batters and it is a big thing to play Test cricket,” Ishan revealed in a video posted by the Board of Control for Cricket (BCCI) on Twitter. Of maiden Test call-up, emotions & excitement to play red-ball cricket & more @ShubmanGill turns anchor to interview @ishankishan51 on his selection in #TeamIndia squad for the first two #INDvAUS Tests pic.twitter.com/oinLYky95Q — BCCI (@BCCI) January 17, 2023 “I am very happy to make it to the Test team, because people perceive it as the real game. I will try hard to do well. I called home and told them the news. My dad was hyped up and told me to work hard like this,” he added. Last month, the 24-year-old entered the record books after scoring a scintillating 210 off 131 deliveries against Bangladesh and paved his way to the illustrious list of double centurions in ODI cricket that includes Sachin Tendulkar, Virender Sehwag, Rohit Sharma, Chris Gayle, Martin Guptill and Fakhar Zaman. His knock was also the fastest double-century in ODI cricket. India will play four-match Test series against Australia at home, with the first Test scheduled to take place in Nagpur from February 9, followed by three-match ODI series, starting from March 17. IANS","pubDate":"2023-01-17 11:55:07","image_url":"https://www.orissapost.com/wp-content/uploads/2023/01/Ishan-Kishan-300x210.jpg","source_id":"orissapost","country":["india"],"category":["sports"],"language":"english"},{"title":"$250K ‘bargain’: Smith ends 12-year Sixers drought with ‘absurd’ ton as Head flops again - Fox Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMi1gFodHRwczovL3d3dy5mb3hzcG9ydHMuY29tLmF1L2NyaWNrZXQvYmJsLWxpdmUtc3lkbmV5LXNpeGVycy12cy1hZGVsYWlkZS1zdHJpa2Vycy1saXZlLXNjb3Jlcy13aGVyZS10by13YXRjaC10ZWFtcy1zdGV2ZS1zbWl0aC1uYXRoYW4tbHlvbi10cmF2aXMtaGVhZC1hbGV4LWNhcmV5LXRlc3QtdGVhbS9uZXdzLXN0b3J5L2EzN2E4OTBkOGI2ZGM3NzBkMTE0YTdlYzk1OTM2ZjUx0gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"$250K ‘bargain’: Smith ends 12-year Sixers drought with ‘absurd’ ton as Head flops again  Fox SportsBig Bash erupts over ‘absurd’ Steve Smith feat  news.com.auSmith’s 56 balls of bliss in BBL century masterclass  Sydney Morning HeraldSmith truly free from T20 shackles with powerful BBL ton  cricket.com.auView Full coverage on Google News","content":null,"pubDate":"2023-01-17 11:45:00","image_url":null,"source_id":"google","country":["australia"],"category":["sports"],"language":"english"},{"title":"News24.com | Kallis says Pretoria Capitals still in search of the 'perfect game'","link":"https://www.news24.com/sport/Cricket/SA20/kallis-says-pretoria-capitals-still-in-search-of-the-perfect-game-20230117","keywords":null,"creator":null,"video_url":null,"description":"Pretoria Capitals assistant coach Jacques Kallis said they’re still a fair bit away from playing their best cricket, ahead of Tuesday's clash against the Joburg Super Kings.","content":null,"pubDate":"2023-01-17 11:43:04","image_url":"https://scripts.24.co.za/img/sites/sport24.png","source_id":"news24","country":["south africa"],"category":["sports"],"language":"english"},{"title":"We should not put too much pressure on Suryakumar, says Yusuf Pathan","link":"https://www.orissapost.com/we-should-not-put-too-much-pressure-on-suryakumar-says-yusuf-pathan/","keywords":["Sports","2023 ODI World Cup","India","Sachin Tendulkar","suresh raina","suryakumar yadav","uae","Virendra Sehwag","world cup","Yusuf Pathan","YUvraj Singh"],"creator":["Post News Network"],"video_url":null,"description":"Dubai: Former India cricketer Yusuf Pathan has said that the fans and media should not put too much pressure on Suryakumar Yadav by constantly talking just about him, adding that he hopes to see the star batter keeps producing match-winning performances for the Men in Blue. The 32-year-old Suryakumar has been in sensational form and […]","content":"Dubai: Former India cricketer Yusuf Pathan has said that the fans and media should not put too much pressure on Suryakumar Yadav by constantly talking just about him, adding that he hopes to see the star batter keeps producing match-winning performances for the Men in Blue. The 32-year-old Suryakumar has been in sensational form and recently smashed his third T20I century during the series against Sri Lanka at Rajkot. He will be crucial for India’s success at the 2023 ODI World Cup. “Surya is batting brilliantly at the moment and I hope he continues doing that for the Indian cricket team. But, there are others players also, who are also doing well for the team, so we should focus on them as well. We should not put too much pressure on Surya by constantly talking about him. We have seen that players come under pressure, when there is too much chatter about him. Yes, we should praise his performance but others should be also complimented which will ease the pressure from Surya,” Yusuf, who is playing for Dubai Capitals at ILT20 told IANS in an interview. “If we keep things simple, it will help both Surya and the Indian cricket team,” he added. Asked if having too much talent in the country also puts much pressure on players to perform constantly, the all-rounder said it’s a good headache to have. “Having a big pool of talented players is a good headache for the Indian cricket ecosystem. Every player playing at different levels should believe that if they perform well, they will represent the country one day,” he said The 40-year-old also mentioned that the spin bowling all-rounders will play a vital role during the ODI World Cup in India. “All-rounder definitely makes things easier for both the team as well as the captain. It gives the captain options to try different match-ups at various stages of the game. Since the 2023 ODI World Cup is happening in India, spin bowling all-rounders as well as batters who can bowl spin will play a vital role,” he said. There have been talks among cricket experts regarding modern day batters not bowling, which doesn’t help team combination. However, Yusuf feels it’s up to the individual. “It depends on the individual’s choice, whether he wants to bowl or not. During the 2011 World Cup, we had many options in Virendra Sehwag, Sachin Tendulkar, Yuvraj Singh, Suresh Raina and me, who could bowl and give various options to the captain. Yuvraj even became the Player of the tournament as he gave India crucial wickets during the tournament and the world already knows about his batting exploits,” Pathan said. Talking about ILT20 he said,” We started the tournament with a win and also competed well in the second game, which is important for the team. So many renowned players have come to take part in the ILT20 which is a great thing for UAE cricketers and they will learn a lot from the stars of the game. IANS","pubDate":"2023-01-17 11:42:13","image_url":"https://www.orissapost.com/wp-content/uploads/2023/01/Suryakumar-Yadav-240x300.jpg","source_id":"orissapost","country":["india"],"category":["sports"],"language":"english"},{"title":"Wild waters entrance fee 2023","link":"https://tzobserver.com/wild-waters-entrance-fee-2023/","keywords":["SOUTH AFRICA"],"creator":["J OBSERVSER"],"video_url":null,"description":"Wild waters entrance fee 2023 Wild waters entrance fee 2023: Wild Waters, Shankarpalli Hyderabad (Entry Fee, Timings, 1 Day Package Entry Ticket Cost, Price) How much is entrance fee at Wild Waters? R150 per person Welcome to Wild Waters Boksburg. Our ticket prices are R150 per person. Kids 0-4 years of age pay no entry […] <p>The post Wild waters entrance fee 2023 first appeared on TZOBSERVER.</p>","content":"Wild waters entrance fee 2023 Wild waters entrance fee 2023: Wild Waters, Shankarpalli Hyderabad (Entry Fee, Timings, 1 Day Package Entry Ticket Cost, Price) How much is entrance fee at Wild Waters? R150 per person Welcome to Wild Waters Boksburg. Our ticket prices are R150 per person. Kids 0-4 years of age pay no entry fee. Spread over an area of 30 acres, Wild Waters is located in Shankarpalli. This theme park with activities ranging from aqua park, amusement park to adventure park presents an unparalleled concoction of fun, laughter and luxury. Catering to everyone from families, friends, office colleagues to school kids, Wild Waters is an ideal choice for an entertaining weekend. One of the biggest amusement parks in Hyderabad, it boasts of having more than 60 dry and water rides. What makes your day at Wild Waters, Shankarpalli even more enjoyable is the availability of mouth watering food choices, satisfying every taste bud. Aqua Park Aqua Park is the designated area of Wild Waters, presenting a wide variety of water rides and games. There are 21 water rides at Aqua park. While family rides are suitable for everyone who loves water and a bit of excitement, thrill rides are especially for those who wish to have an adventurous tryst with fun. Family Rides Paradise Beach– Spend some time relaxing at the wave pool that presents a real beach-like experience with its varying degrees of waves, vast spread of sand and coconut groves. This 16000 sq.feet wave pool lets you have a beach experience in Hyderabad itself. Rain Disco– What can be better than a disco in rain? Built over an area of 3000 sq. foot, it offers a perfect setting for everyone to enjoy a cool, refreshing rain shower amid thrilling music beats. Pirates Cove– It is a family water zone consisting of varied rides and games. With 6 adult slides and 6 kids slides with varying lengths and heights ranging from 21 feet to 6 feet, Pirates Cove offers complete entertainment for all. It also constitutes kids-friendly pool and two water buckets which tilts after every 4-5 minutes, spilling huge amount of water on everyone. Aqua Play– It is designed specially for kids, catering to their preferences and safety. It consists of 5 varying fountains and 3 different water slides. Crazy River– Crazy River presents a unique ride experience where visitors sit on a tube and float on a 600 feet long river that slowly cajole them at the start but as they go along the landscape, it surprises them with sudden waves. Wave Rider– If you want to experience a high wave then go for a wave rider. Here you are dropped on a 240 feet long wave rider, from a 40 feet high tower at a speed of 40 km per hour. Free Fall– Starting from a tower of 40 feet height, Free fall straightly drops you at a speed of 50 km per hour. Matt Racer– In this, you slide on a matt at a speed of 50 km per hour. You will slide upwards on a 240 feet long matt racers and then downwards from a height of 40 feet. Tornado– As the name suggests, this ride takes you in a zig-zag manner with ample turns. In this ride you slide from a height of 40 feet and land in a huge water filled tub. Voyage– In this exciting ride, people in a group of 4 sit on a raft slide and slide downwards through various twists and turns at a high speed. Rapids– A bit similar to voyage, rapids also take people in groups of 4 on a raft slide. However, as they reach the bottom it takes them floating on the water for as far as they can go. Thrill Rides Loop Racer– In this ride, you go on a matt, up to a height of 40 feet on a long loop racer ride that slides you down into a circular tube at a speed of 50 km per hour. Twister– Twister living up to its name, presents an exciting slide with ample of thrilling twists, where you slide on a 325 ft long closed tunnel, from a height of 40 feet while eventually falling into a huge tub of water. Hurricane– In this, you sit on a two seater and slide in a closed tunnel, later plunging into a massive cone shaped funnel with many exciting spins. Cyclone– In this ride, you are thrown in a huge bowl while eventually dropping you into a pool. Pendulum– In this slide, you sit on a two seater tube and slide through a closed tunnel, eventually dropping into a pendulum slide that moves back and forth many times. Backlash– Here, you sit on a two seater tube and pass through an open tunnel which ends into a huge slide in the shape of a half pendulum which constantly moves front and back. This slide again drops you into an open tunnel which once again takes you to half pendulum slide. Loop Coaster-This slide is 400 feet long and consists of 3 huge loops, each 100 feet in size. Here, you float on two seater tubes and move into an open slide which turns and twists in unpredictable ways, creating an exciting ride. Tunnel– Here, you slide from a height of 40 feet on a two seater tube and move through various closed and open tunnels. Harakiri– This is again a 2 seater slide, where you float upwards and downwards and then again upwards on a water tub. This gravity defying experience promises thrilling moments to everyone. Boomerang– In this water slide, you move on a two seater slide from a height of 40 feet. Here you slide through a closed tunnel at a speed of 45 km per hour. The tunnel then drops you into a massive boomerang shaped slide, and eventually into a huge water tub. Adventure Park For those who look for maximum adrenaline rush, adventure park at Wild Waters is the ideal place for them. Comprising 17 different rides varying from family rides to thrill rides, it presents ample opportunities to make your weekend wild with fun. There are also specially designed kid’s rides, ensuring the safety of children while maintaining the fun quotient. Family Rides Surf Rider– If you have been planning to go surfing, you need not travel to some other destination. Wild Water Shankarpalli, offers surf ride experience at its adventure park. Here you can try your hands at surfing through a mechanical surf simulator with inflatable padded flooring. Rodeo Ride– Promising a unique experience, this ride, powered by an electric motor offers the experience of a bull ride. There have been sufficient safety measures around the ride such as padded flooring if in case the rider falls on the ground. Archery– At a 30 feet long archery range, you can try your skills at archery in a fun filled way. Rifle Shooting– A special shooting range has been created where you can fulfil your desires to try shooting. 2 calibre nitro piston sporting air rifles are provided at the range for you to try your hands at shooting. Rope Course– If you have an unfulfilled wish to join the military and try various physical drills, then rope course is an ideal sport for you, presenting a glimpse of military training. It has been built in the same manner as military obstacle courses and comprises challenging activities such as climbing nets, swinging, jumping and crossing bridges, etc. Cricket Nets– Cricket lovers will have an amazing time at the cricket nets. It presents a perfect setting for novice as well as seasoned players to try their skills at batting and bowling with their friends and family. Bungee Trampoline– For an absolute adrenaline rush, bungee trampoline is the best choice. Here you are placed on a bungee trampoline harness which is then attached to various bungee ropes. Here, the ropes are moved upwards and downwards. Rock Climbing– Rock climbing enthusiasts need not go to a distant place for rock climbing. Here at the Wild Waters, an artificial rock climbing wall with a height of 30 feet has been created, offering a perfect setting for trying your skills at this fitness sport. Image Gallery of Wild Waters, Shankarpalli Hyderabad Kids Rides Bungee Trampoline– Especially designed for kids, bungee trampoline offers a thrilling time to kids in a safe environment. Here, kids can flip, bounce, spin and try varied twists and turns. They are put on a harness which is attached to varied ropes that would pull them upwards and downwards. In this ride, weight restriction is applied. Soft Archery– Here, kids can try archery and shoot an arrow on a target board which has been kept at a distance of 15-20 feet. Excavator-An adventure ride, here kids experience the thrill of operating an excavator. It is electric as well as hydraulic and offers all the functions similar to a real excavator. Rodeo Ride-Here, children can get the excitement of riding a rodeo bull. This runs on an electric motor which operates at varying speeds. Padded flooring has been installed around the ride, making it absolutely safe for kids. Paddle boats– These paddle boats are an ultimate fun for kids while offering a bit of a natural setting as well. These sturdy boats are kids friendly, promising fun mixed with safety. Roller Zorb -In this ride, one to three kids enter an inflatable roller in the shape of a drum and walk on the water surface. Being inside the roller they enjoy the game without having to get drenched in water or drowning. Although in this ride, weight restrictions are considered. Play Zone– Here, children can have the fun of riding a horse without having to risk their safety. Thrill Rides Zip Line– In this ride, a cable is attached between two points of varying heights. A rider is then tied to a safety harness which eventually moves from a 50 feet height tower along a line of 700 feet. In this ride too weight restrictions are applied. Gyro Ride– In this ride, you safely sit in a gyroscope which then moves in such unpredictable manners that you are left flying, rolling and rocking in an adventure filled way. Amusement Park Wild Waters amusement park offers a wide array of activities and games that keep everyone pleasantly occupied. Amusement park is one of the most entertaining sections of the Wild Waters. It brings out the adventurous side of every visitor without compromising on security and safety. Family Rides Carousel– Popularly known as merry go round, carousel is a perfect ride for an entire family to enjoy together. Here, riders sit on galloping horses and chariots which move in circular motion. Aero Fighter– Here, riders sit in a cabin which has been built in the shape of a plane. This cabin is further attached to the main rocket. As the ride starts, the plane shaped cabins move up and down, offering an almost real like experience of flying a plane. Coffee Cups– As the name suggests, this ride consists of huge coffee cups, which are built around an oversized teapot. Riders sit in these teacups/coffee cups which move around the teapot. Along with this, riders can also rotate faster and spin their cups using a wheel in front. Ocean Train– A relaxed fun ride, here riders take a tour of the park in a small train with five coaches that are adorned with sea animals. This train is electrically operated. Kangaroo Jump– In this ride, one sits on the seats which are made on the belly of huge carved seats in the shape of Kangaroos. As the ride starts, riders experience jumping and hopping like a Kangaroo. Worm Coaster-This ride is shaped in the form of a worm which moves on a curved track with exciting loops. Here riders move upwards and downwards, feeling a quick rush of adrenalin as the worm goes down. Pirate Ship– In this ride, visitors are seated on an open ship which moves like a pendulum, moving as high as 200 degrees and then downwards. It gives an experience of sailing. Octopus– This ride is in the shape of an octopus where cabins are attached to its arms. Here the cabins are raised upwards and then downwards while at the same time octopus moves in circular motions. Swinger– A huge mushroom shaped ride to which many chairs are attached. Riders are seated on these chairs and then swirled in circular motions, suspended around 8 mtr above the ground. Kids Rides Jumbo Train-This is a miniature train which has been especially designed for children. In this ride, kids can take a tour on an oval shaped track. Flying Bees– As the name suggests, this ride is in the shape of a bee. It is similar to merry go round, where kids sit in a bee shaped cabin that moves up and down while going in circular motions. Apache Ride– In this ride too kids are seated and then moved in circular motion while at the same time cabins move upwards and downwards, offering a fun filled experience. Mini Pirate Ship– This is a mini open ship where kids enjoy an exciting sailing experience. Here the ship shaped ride is suspended to a pendulum that sways front and back. Mini Disco-Here, kids are seated on a padded saucer shaped ride. The ride then rotates in varying speeds, ranging from high to low. Ocean Walk– In this ride, kids are seated in bright coloured cabins which are designed in the shape of sea animals, dolphins, mermaids and even conchs. This ride presents a beautiful and mystical sea world for children. Ferris Wheel– A miniature version of giant wheel ride, here two kids are seated in small, beautifully coloured hanging baskets which vertically rotate 360 degree. Flying Car– As the name suggests, this ride is in the shape of a car with wheels which runs on a track with many exciting twists and turns. Frog Hopper– In this ride, kids experience a thrill of hopping and bouncing. Here they go up and down on a small tower in movements similar to that of frogs. Thrill Rides Wave Surfer– The mechanical surfer at Wild Waters presents a surfing experience right in the city of Hyderabad. The area around the ride has been padded so that riders are not injured even if they fall. Spiral Jet– In this unique ride, riders are seated on hanging space seats. These seats are moved inwards and outwards while the rides rotate in 360 degree. Pendulum– One of the most thrilling rides, here riders are seated facing outwards, on a circular gondola. This gondola is attached to a pendulum which swings at a high speed while at the same time the gondola starts rotating in a clockwise and anticlockwise manner. Tagada Disco– Here, riders sit on a huge flying padded saucer which rotates at high speed. As the saucer moves, riders are tilted, moved and bumped on each other. Dining at Wild Waters, Shankarpalli Wild Waters Shankarpalli not only offers an extensive range of entertaining activities, it presents an equally exciting array of dining choices. Catering to every kind of palate and food habits, it has three different places to eat, each offering mouth watering dishes. Food Express is a multi cuisine food court with various counters for beverages, snacks and ice-creams. For a quick bite, visit Island Cafe which offers umpteen choices of snacks. It is located near the water park. Located between Adventure park and Amusement Park, Adventure Cafe is another place to visit for a delicious snacking or meal. Accomodation at Wild Water, Shankarpalli Matching the excitements of the rides, the accomodation at Wild Waters presents exceptionally interesting choices of stay. At the Palm Exotica Boutique Resort & Spa, you are offered six varying styles of accommodation ranging from pool villas to suites, each equipped with luxurious facilities and a captivating view of the landscape and the park. The relaxing stay is accompanied by varied luxurious facilities at the resort. Entry Fee at Wild Waters, Shankarpalli The entry is free for kids below 90 cm. Re-entry is not allowed at the park. The price of Wild Waters ticket is Rs. 1199 for adults and Rs. 999 for senior citizens and children (90 – 140 cm). Timings of Wild Waters, Shankarpalli Wild Waters amusement park timings are from 11 in the morning to 6 in the evening on Monday to friday. On weekends (Saturday and Sunday) and public holidays, the Wild Waters timings are from 11 AM to 7 PM. Water rides at the park are closed by 6 PM every evening. How to reach Wild Waters, Shankarpalli Wild Waters Amusement Park is located at Masaniguda Village in Shankarpally. It is around 50 km away from Hyderabad. It is easily accessible by road from Hyderabad city and can be reached in one and half hours of time. Things to remember at Wild Waters, Shankarpalli All visitors are expected to follow a certain dress code at the Wild Waters amusement park. For water rides, visitors are required to wear only polyester and nylon costumes. Loose footwear and loose dresses are not allowed for dry rides and sports at Adventure and Amusement park. People with long hair are requested to wear a swimming cap while going on water rides. Visitors can not wear footwears in water rides. One can buy swimming costumes at the park, which are available in all sizes. Pregnant women, people with heart conditions and high BP are advised not to try high thrill rides. For many rides, height restrictions are strictly followed. Hence, the park staff are allowed to refrain any visitor if the criterias such as height and dress codes are not fulfilled. Visitors are not allowed to carry food and drinks from outside.   <p>The post Wild waters entrance fee 2023 first appeared on TZOBSERVER.</p>","pubDate":"2023-01-17 11:40:54","image_url":null,"source_id":"tzobserver","country":["tanzania"],"category":["sports"],"language":"english"},{"title":"Australia can recreate magic of 2004 Test series win in India: Gilchrist","link":"https://www.orissapost.com/australia-can-recreate-magic-of-2004-test-series-win-in-india-gilchrist/","keywords":["Sports","Adam Gilchrist","australia","Border-Gavaskar series","Cameron green","Cricket Australia","India","Nathan Lyon","pat cummins"],"creator":["Post News Network"],"video_url":null,"description":"Melbourne: Former Australia skipper Adam Gilchrist is confident the Pat Cummins-led side will be able to win the Border-Gavaskar series in India after 19 years if they go in with three seamers to partner spinner Nathan Lyon. The former wicketkeeper-batter, who was Australia’s stand-in skipper during the 2004 series win; the only one they pocketed […]","content":"Melbourne: Former Australia skipper Adam Gilchrist is confident the Pat Cummins-led side will be able to win the Border-Gavaskar series in India after 19 years if they go in with three seamers to partner spinner Nathan Lyon. The former wicketkeeper-batter, who was Australia’s stand-in skipper during the 2004 series win; the only one they pocketed since 1969; added that experimenting with a new spinner in sub-continental conditions has never worked, and Cummins should refrain from doing that. “I think they’ll do it (win the series). I really do. I think they’ve got a squad and final XI that will have a lot of similarities to the team we rolled with in 2004,” Gilchrist was quoted as saying by Fox Sports Tuesday. “So often teams go to India hoping to unveil some new spinner that’s going to come in and adapt and bedazzle in India; it doesn’t really happen,” added Gilchrist. He felt Australia should just have faith in their best four bowlers to do the job, adding that the highly-experienced seamers should have no trouble reverse swinging the ball. “Pick your best four bowlers, run with them, and if that is three seamers who can all get really nice reverse swing and Nathan Lyon, who’s outstanding and clearly the best off-spinner we’ve ever had, can play his role; that’s my gut feeling. You do that, you go with it.” Australia currently find themselves in a tricky situation with their most experienced seamer, 32-year-old Mitchell Starc, nursing a finger injury to his bowling arm and likely to miss the first Test at Nagpur. Tall all-rounder Cameron Green too suffered a fracture on his finger and has undergone surgery, though he is expected to be fit before the first Test, beginning February 9. The former cricketer said the return of Green, a fast-bowling all-rounder, could give Cricket Australia the luxury to pick an extra spinner, and added the need to be patient in trying conditions. Reminiscing the 2004 series win and the lessons it has for the current squad, Gilchrist said, “What we tried to change with our mentality back then, and I’d be interested to see if the Australians do it this time; is don’t go searching and just rolling spinners out there. “Attack the stumps right from ball one. Swallow your pride a bit, be defensive to be aggressive… Start with one slip, start with a catching mid-wicket, put fielders out on the boundary to nullify the boundary option, but keep a couple of catchers in place; either at short cover or short mid-wicket, and just be patient.” PTI","pubDate":"2023-01-17 11:19:37","image_url":"https://www.orissapost.com/wp-content/uploads/2020/12/Pat-Cummins-1-300x178.jpg","source_id":"orissapost","country":["india"],"category":["sports"],"language":"english"},{"title":"Wolves vs Liverpool PRICE BOOST: Get Salah 2+ shots on target in FA Cup replay at Evens with Sky Bet","link":"https://www.thesun.ie/sport/9974778/price-boost-offer-sky-bet-new-existing-customers/","keywords":["Sport","Football"],"creator":["Craig Mahood"],"video_url":null,"description":null,"content":"WOLVES host Liverpool tonight in an FA Cup third round replay at Molineux. And Sky Bet are offering new and existing customers boosted odds of EVENS that Mohamed Salah has at least two shots on target in the game. Salah 2+ shots on target | Evens!Getty Salah 2+ shots on target | Evens! That is up from the usual price Sky Bet have offered of 8/11! Like those odds? Add to your bet slip here. This is for new and existing Sky Bet customers to claim. Want more? Go on then… New Sky Bet customers who stake £10 on any sports market, including this week’s cup action, will be rewarded with £30 in free bets! To access this offer, simply click HERE* and register a new account. Deposit and place a tenner on football, horse racing, tennis or cricket and you’ll have your account credited with 3 x £10 in free bets! You could spend your initial £10 on this FA Cup boost with the chance to win £20 if it comes in! Wolves vs Liverpool Sky Bet Mo Salah 2+ shots on target was 8/11 NOW Evens! Available to all customers Add to bet slip here SKY BET: GET £30 IN FREE BETS* SKY BET: GET £30 IN FREE BETS* FREE BETS AND SIGN UP DEALS – BEST NEW CUSTOMER OFFERS Most Read in Sport 'I'M RICH' 'Poster boy' jockey banned for a YEAR over shocking betting scandal DEE-LIGHTED Dee Devlin all smiles as she celebrates sister's baby shower at The Black Forge NEED FOR SPEED Inside Dublin Formula 1 show as Red Bull legend David Coulthard wows crowd BACK TOGETHER Bohs confirm Fenlon as Director of Football with both 'absolutely delighted' CANCER FIGHT Tennis icon Navratilova opens up on cancer battle after diagnosis this month NOT QUITE GAA president McCarthy left red-faced after error during trophy presentation JUMPS OUT Conor McGregor's extravagant fashion choice leaves fans all making the same joke HOT TAPP I'm a footballer who won Love Island but my fame stops me playing, says Finn Tapp GOLDEN GLOBE GAA ace Paudie Clifford compared to Father Ted episode after blistering speech 'RIP, BEAST' Tour de France star Lieuwe Westra dies after being found unresponsive at work Remember to gamble responsibly A responsible gambler is someone who: Establishes time and monetary limits before playingOnly gambles with money they can afford to loseNever chase their lossesDoesn’t gamble if they’re upset, angry or depressedGamcare – www.gamcare.org.ukGamble Aware – www.begambleaware.org For help with a gambling problem, call the National Gambling Helpline on 0808 8020 133 or go to www.gamstop.co.uk to be excluded from all UK-regulated gambling websites. *New customers only, first single & e/w bet only, 5p minimum stake, 3 x £10 bet tokens. Free bet stakes not included in returns. Free bets exclude virtuals. Free bets are non withdrawable. No free bet expiry. Eligibility restrictions and further T&Cs apply. 18+ begambleaware.Org","pubDate":"2023-01-17 11:00:00","image_url":null,"source_id":"thesun_ie","country":["ireland"],"category":["sports"],"language":"english"},{"title":"Wolves vs Liverpool PRICE BOOST: Get Gakpo to score 1st and Reds to win 3-1 at 100/1 with Sky Bet","link":"https://www.thesun.ie/sport/9971117/price-boost-sky-bet-offer/","keywords":["Sport","Football","Sky Bet"],"creator":["Craig Mahood"],"video_url":null,"description":null,"content":"LIVERPOOL travel to Wolves tonight as the Premier League sides battle it out for a place in the fourth round of the FA Cup. And Sky Bet are offering new and existing customers a price boost of 100/1 for Cody Gakpo to score first and the Reds to win 3-1 – which you can add to your bet slip here. GettyGakpo to score first and Liverpool to win 3-1 | 100/1![/caption] Gakpoto score first and Liverpool to win 3-1 | 100/1! Want more? Go on then… New Sky Bet customers who stake £10 on any sports market, including this week’s cup action, will be rewarded with £30 in free bets! To access this offer, simply click HERE* and register a new account. Deposit and place a tenner on football, horse racing, tennis or cricket and you’ll have your account credited with 3 x £10 in free bets! You could use that or one of those £10 free bets on the 100/1 boost for tonight, with a potential return of £1010! Wolves vs Liverpool Sky Bet Gakpo to score 1st & Reds to win 3-1 Now available at 100/1 after Sky Bet boostClick HERE to claim this price boost SKY BET: GET £30 IN FREE BETS* FREE BETS AND SIGN UP DEALS – BEST NEW CUSTOMER OFFERS Most Read in Sport 'I'M RICH' 'Poster boy' jockey banned for a YEAR over shocking betting scandal DEE-LIGHTED Dee Devlin all smiles as she celebrates sister's baby shower at The Black Forge NEED FOR SPEED Inside Dublin Formula 1 show as Red Bull legend David Coulthard wows crowd BACK TOGETHER Bohs confirm Fenlon as Director of Football with both 'absolutely delighted' CANCER FIGHT Tennis icon Navratilova opens up on cancer battle after diagnosis this month NOT QUITE GAA president McCarthy left red-faced after error during trophy presentation JUMPS OUT Conor McGregor's extravagant fashion choice leaves fans all making the same joke HOT TAPP I'm a footballer who won Love Island but my fame stops me playing, says Finn Tapp GOLDEN GLOBE GAA ace Paudie Clifford compared to Father Ted episode after blistering speech 'RIP, BEAST' Tour de France star Lieuwe Westra dies after being found unresponsive at work Remember to gamble responsibly A responsible gambler is someone who: Establishes time and monetary limits before playingOnly gambles with money they can afford to loseNever chase their lossesDoesn’t gamble if they’re upset, angry or depressedGamcare – www.gamcare.org.ukGamble Aware – www.begambleaware.org For help with a gambling problem, call the National Gambling Helpline on 0808 8020 133 or go to www.gamstop.co.uk to be excluded from all UK-regulated gambling websites. *New customers only, first single & e/w bet only, 5p minimum stake, 3 x £10 bet tokens. Free bet stakes not included in returns. Free bets exclude virtuals. Free bets are non withdrawable. No free bet expiry. Eligibility restrictions and further T&Cs apply. 18+ begambleaware.Org","pubDate":"2023-01-17 11:00:00","image_url":null,"source_id":"thesun_ie","country":["ireland"],"category":["sports"],"language":"english"},{"title":"Sharjah Cricket Stadium T20 records: Sharjah T20 records and highest innings totals","link":"https://thesportsrush.com/cricket-news-sharjah-cricket-stadium-t20-records-sharjah-t20-records-and-highest-innings-totals/","keywords":["Cricket","ILT20","ILT20 League 2023","Sharjah Cricket Stadium"],"creator":["Dixit Bhargav"],"video_url":null,"description":"The sixth match of International League T20 will be played between Sharjah Warriors and MI Emirates in Sharjah. One of the three ILT20 2023 venues, Sharjah Cricket Stadium will be hosting its first match of the season tonight. A stadium which has hosted the third-highest number of international matches across formats will be hosting its… The post Sharjah Cricket Stadium T20 records: Sharjah T20 records and highest innings totals appeared first on The SportsRush.","content":"The sixth match of International League T20 will be played between Sharjah Warriors and MI Emirates in Sharjah. One of the three ILT20 2023 venues, Sharjah Cricket Stadium will be hosting its first match of the season tonight. A stadium which has hosted the third-highest number of international matches across formats will be hosting its first T20 since ICC T20 World Cup 2022. Apart from international cricket, Sharjah has hosted close to 150 Men’s T20s which comprises being witness to several T20 competitions. Sharjah Cricket Stadium T20 records Highest T20 run-scorers at this stadium are Mohammad Shahzad (941), Shane Watson (549), Mohammad Nabi (523), Chris Gayle (509) and Luke Ronchi (502). A list of highest T20 run-scorers here among active cricketers has been given below. Batters Matches Runs Highest Average SR Mohammad Shahzad 27 941 118 40.91 155.28 Mohammad Nabi 34 523 47 23.77 158.48 Chris Gayle 17 509 80 29.94 147.69 Ravi Bopara 20 479 71 29.94 123.77 Shoaib Malik 17 460 75 41.82 132.95 Highest wicket-takers in Sharjah T20s are Rashid Khan (31), Nabi (25), Mujeeb Ur Rahman (24), Mohammad Sami (21) and Mirwais Ashraf (21). A list of best T20 bowlers at the Sharjah Cricket Stadium among active cricketers has been provided below. Bowlers Matches Wickets Average Economy SR Rashid Khan 22 31 17.52 6.3 16.68 Mohammad Nabi 34 25 29.72 7 25.48 Mujeeb Ur Rahman 15 24 16.46 6.93 14.25 Wahab Riaz 15 20 19.3 7.15 16.2 Hasan Ali 12 19 14.53 6.68 13.05 Highest innings totals in Sharjah T20s Score Overs Team Opposition Year 244/6 20 Balkh Legends Kabul Zwanan 2018 235/5 20 Balkh Legends Kings Leopard 2018 228/4 20 Delhi Capitals Kolkata Knight Riders 2020 226/6 19.3 Rajasthan Royals Punjab Kings 2020 223/7 20 Kabul Zwanan Balkh Legends 2018 Sharjah has a knack of being a high-scoring venue in the general run of things. A venue which has seen multiple T20 innings totals in excess of 200 has also been witness to four successful T20 run-chases over the 200-run mark. The above mentioned fourth-highest innings totals at this stadium is also the highest successful run-chase here in this format. Individual half-centuries by Sanju Samson (85), Rahul Tewatia (53) and Steven Smith (50) had played a key role in sealing a 224-run chase with three balls to go. The match is fondly remembered for Tewatia hitting five sixes in a Sheldon Cottrell over to power his team to a record IPL run-chase. The post Sharjah Cricket Stadium T20 records: Sharjah T20 records and highest innings totals appeared first on The SportsRush.","pubDate":"2023-01-17 10:57:47","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"India’s ‘Hockey Village’ set for transition from bamboo sticks to artificial turf","link":"https://www.orissapost.com/indias-hockey-village-set-for-transition-from-bamboo-sticks-to-artificial-turf/","keywords":["Sports","State","Amit Rohidas","Birsa Munda stadium","Deep Grace Ekka","Dipsan Tirkey","Ignace Tirkey","India","mahendra singh dhoni","Odisha","Prabhodh Tirkey","Saunamara","Subhadhra Pradhan","Sundargarh"],"creator":["Post News Network"],"video_url":null,"description":"Saunamara: In the small village that has given India some of its biggest hockey players, it all starts with sticks made from bamboo or kendu tree. Every evening more than 100 children at Saunamara, a hamlet of little over 2000 tribal inhabitants in Odisha’s Sundargarh district, play on a dusty ground, pursuing their dreams of […]","content":"Saunamara: In the small village that has given India some of its biggest hockey players, it all starts with sticks made from bamboo or kendu tree. Every evening more than 100 children at Saunamara, a hamlet of little over 2000 tribal inhabitants in Odisha’s Sundargarh district, play on a dusty ground, pursuing their dreams of becoming the next Dilip Tirkey, Amit Rohidas or Subhadra Pradhan. Their fortunes, though, could change soon as an artificial turf will be ready by next month. That means the village, which is located just over 100km from Birsa Munda Stadium, the world’s largest all-seater hockey-specific venue in Rourkela, could churn out more international players. Saunamara is now known as the ‘Hockey Village’ of India as it has given the country former men’s team captain and Hockey India president Tirkey, current national team player Amit Rohidas, India junior team vice-captain Dipsan Tirkey and ex-India women’s skipper Subhadra, among others. This village is part of the Balisankara block of Sundargarh district, which is now considered the cradle of Indian hockey, having given more than 60 national team players, both male and female. “There was no proper hockey ground in my village when I grow up. We had to play wherever we get some space. But now my village is going to have an artificial turf,” Tirkey, one of the finest defenders of his time and most capped player for India with 421 matches, told PTI. “I am very happy for the children of my village and, at the same time, feeling proud of the contribution of my village for Indian hockey,” said the 45-year-old, who made his India debut in 1995 and retired in 2010, before becoming HI chief. He said the artificial surface being laid out at his village is a sand-filled turf, which is most appropriate for schools and is a publicly accessible facility, because of its lower cost and multi-functionality. The astro turf used for international matches costs at least Rs 4 crore but the price is lower for sand-filled artificial pitches. The Odisha government has started laying synthetic turfs in all the 17 blocks of the Sundargarh district and some of them are already completed. The laying of the artificial surface at the Saunamara village, with the accompanying field marking, is completed. Only the goal posts are to be erected. It will also have change rooms and other facilities at the front side which will have a proper entrance. Construction started in December 2021 and was to be completed in one year. But there has been a slight delay and the facility will be completed next month. “Hockey is our life, it’s in our blood and all the children in our village play hockey every evening,” said Aman Tirkey, a student of class seven at the Government UG High School. “When I grow up I want to play for the country like Dilip Tirkey or Amit Rohidas,” he said, showing off his dribbling skills. “I am waiting for the new artificial turf to be completed and then I will play there.” The game of stick is not restricted to boys as girls like Sumitra Dhurwa also want to take up the sport as a career option. “I want to be Subhadra Pradhan, she is my idol. Our parents never stop us from playing hockey. They rather support and tell me to go and play it,” Sumitra, a class eight student of the same Government UG High School, said. Government UG is the only high school in the village. There is another school, a Christian mission school, which is up to class five standard. There is a problem for the children, though. All the children do not have modern hockey sticks and they have had to make their own from bamboo and kendu tree trunk. The base of the bamboo tree will be cut round to be used as the ball. “We provide these modern hockey sticks to our students during games period. Moreover, we give away the old sticks to the students for free to take home,” said Ishwarchandra Naik, head master of the Government UG High School. “But all the children at this village cannot have proper modern sticks. For those children of poorer parents, they have to play with sticks made of bamboo or kendu tree. They will cut the base of the bamboo into a round and hard object and will use it as a ball,” he said. Rather than stopping children from playing hockey, the parents of the village encourage them to take up the sport at an early age. “Our father Vincent Tirkey was in the CRPF and he was a hockey player. He would take Dilip to all places to play hockey. I am also a hockey player. In the village, parents encourage their children to play hockey,” Tirkey’s older brother Francis, said. The same is the case with Rohidas who was initiated to the sport by his father who took him to the village playground from a young age. Saunamara is a unique village, with hockey being the most attractive thing for the people here. The lone and dusty playground has the paintings of several past and present India hockey players of Sundargarh region — Tirkey, Rohidas, Prabhodh Tirkey, Ignace Tirkey, Deep Grace Ekka and Subhadhra; strewn along with ‘Chade India’ and ‘My National Game’ written on bold. There is also a painting of a hand holding a hockey stick with the caption ‘It’s my life’, summing up the craze of the national game in this village. Surprisingly, there is also a painting of former India cricket captain Mahendra Singh Dhoni. PTI","pubDate":"2023-01-17 10:56:16","image_url":"https://www.orissapost.com/wp-content/uploads/2023/01/Saunamara-Representational-Image-300x175.jpg","source_id":"orissapost","country":["india"],"category":["sports"],"language":"english"},{"title":"Match Preview - India vs New Zealand, New Zealand in India 2022/23, 1st ODI - ESPNcricinfo","link":"https://news.google.com/__i/rss/rd/articles/CBMie2h0dHBzOi8vd3d3LmVzcG5jcmljaW5mby5jb20vc2VyaWVzL25ldy16ZWFsYW5kLWluLWluZGlhLTIwMjItMjMtMTM0ODYzMy9pbmRpYS12cy1uZXctemVhbGFuZC0xc3Qtb2RpLTEzNDg2NDYvbWF0Y2gtcHJldmlld9IBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Match Preview - India vs New Zealand, New Zealand in India 2022/23, 1st ODI  ESPNcricinfoIND vs NZ Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update- New Zealand Tour of India  Cricket AddictorIND Vs NZ, 1st ODI: Read The Pitch Report, Weather Conditions, And Probable Playing 11 Of The First Match  ICC CRICKET SCHEDULEWhy Kishan could bat in middle order vs New Zealand  Rediff.comLIVE Updates | IND VS NZ, 1st ODI Cricket Match Live Score: Check weather and pitch report ahead of Hyderabad ODI  Zee NewsView Full coverage on Google News","content":null,"pubDate":"2023-01-17 10:11:00","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Alleged videos and WhatsApp chats of Babar Azam proven 'false', here's how it all started","link":"https://www.firstpost.com/firstcricket/sports-news/alleged-videos-and-whatsapp-chats-of-babar-azam-proven-false-heres-how-it-all-started-11999252.html","keywords":["First Cricket News"],"creator":["FP Trending"],"video_url":null,"description":"Alleged videos and WhatsApp chats of Babar Azam proven 'false', here's how it all started","content":"The recent performances of Babar Azam have brought the Pakistan skipper under the scanner. Several questions have been raised regarding his leadership ability as well. Now, another unpleasant situation related to his personal life transpired in his career but eventually proved to be entirely “fake news.”A user named Dr Nimo Yadav was the person who first dropped some dirty WhatsApp chats and private videos, allegedly of the Pakistan batter, on his personal Twitter handle, claiming them as a “leak.” As soon as the screenshots grabbed the attention of Internet users, Azam turned out to be one of the controversial topics on social media.It hardly took any time for the media files to go viral across different platforms. Yadav accused Babar Azam of exchanging dirty chats with the girlfriend of another Pakistani player. He wrote in the caption, “Babar Azam is sexting with the GF of another Pakistan cricketer and is promising her that her bf won’t be out of the team if she keeps sexting with him.”Babar Azam sexting with gf of another Pakistan cricketer and promising her that her bf won’t be out of team if she keeps sexting with him is just 👎🏿I hope allah is watching all this .pic.twitter.com/nlKEp55dUB— Dr Nimo Yadav (@niiravmodi) January 15, 2023The false claim soon became the talk of the town and also caught the attention of the cricketer himself. In reply, Azam shared a cryptic post on Twitter, accompanied by a photo of himself with Newcastle’s Tyne Bridge in the backdrop. He noted, “Doesn’t take too much to be happy.”Doesn’t take too much to be happy ☺️ pic.twitter.com/udKmZTHl6V— Babar Azam (@babarazam258) January 16, 2023Now, since the topic has been earning global attention and hitting the headlines of major media outlets, Yadav has come forward rubbishing all of his previous claims. He cleared the fact through another tweet on his account. He shared a news package of media outlets covering the viral chats and videos.What a clown 🤡 media we have, mirror now telecasted a dedicated show based on my satirical tweet and put nasty allegations on Babar Azam without even verifying the source of the news (me).@MirrorNow I was the one who started bf in team story, this was fake. Apologise to Babar pic.twitter.com/OKMgD7fo4L— Dr Nimo Yadav (@niiravmodi) January 17, 2023Yadav penned a long note and slammed the media organisations saying, “What a clown media we have, mirror now telecasted a dedicated show based on my satirical tweet and put nasty allegations on Babar Azam without even verifying the source of the news (me). I was the one who started the bf-in-team story, this was fake.” He further offered his apologies to Babar Azam.Moreover, Yadav responded to a tweet by the Australian daily, Fox Cricket. He asked the organisation to delete their Tweet referring to Babar Azam’s fake private messages and videos. Yadav also made it clear that he did this in a “satirical way.”Delete this tweet, “bf in team for sexting” story is false, I did this in a satirical way.— Dr Nimo Yadav (@niiravmodi) January 17, 2023Later, Yadav released a detailed statement eliminating all the doubts. His tweet read, On a serious note, to all who are saying you should not have done this. Don’t enjoy it when I do this to people or parties you don’t like. Second, I don’t go to anyone here to RT or like my tweet in DM. Third, it’s not my job. Media is picking what news. Fourth, I use Twitter for my fun.”On a serious note, to all who are saying you should not have done thisDon’t enjoy when I do this to people or party you don’t likeSecond I don’t go to anyone here to RT or like my tweet in DMThird it’s not my job Media is picking what newsFourth I use twitter for my fun— Dr Nimo Yadav (@niiravmodi) January 17, 2023Twitter users fumed at Yadav for spreading a nasty rumour to defame a respected cricketer like Babar Azam. Presently, the hashtag “We Stand with Babar Azam” is going viral across the internet world. Some fans also called for a legal suit against the person.Previously, in another case, Azam got involved in a personal life-related controversy. In 2020, a woman who claimed to be Azam’s childhood friend alleged that the cricketer promised to marry her and got her pregnant. But, later, she decided to withdraw all the charges.Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2023-01-17 09:53:50","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/01/Babar-Azam-Pakistan-New-Zealand-1st-ODI-AP-640.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Wired Cricket Rules: क्रिकेट का वो नियम, जिसने अंपायर को भी 'मजबूर' कर दिया... चौके पर मिला सिर्फ एक रन","link":"https://navbharattimes.indiatimes.com/sports/cricket/cricket-news/batsman-hit-no-ball-for-four-run-but-got-only-one-know-what-said-mcc-rules-on-viral-video/articleshow/97053599.cms","keywords":null,"creator":null,"video_url":null,"description":"जब भी बल्लेबाज गेंद को बाउंड्री से बाहर भेजता है तो इस बात का हर किसी को यकीन होता है कि चौका या छक्का जरूर मिलेगा, लेकिन यहां ऐसा नहीं हुआ। गेंद बल्ले से लगकर बाहर गई। अंपायर ने गेंद को नोबॉल भी करार दिया, लेकिन रन सिर्फ एक मिला।","content":null,"pubDate":"2023-01-17 09:32:41","image_url":null,"source_id":"navbharattimes","country":["india"],"category":["sports"],"language":"hindi"},{"title":"Shreyas Iyer ruled out of India vs New Zealand ODI series, Rajat Patidar named as replacement","link":"https://www.firstpost.com/firstcricket/sports-news/shreyas-iyer-ruled-out-of-india-vs-new-zealand-odi-series-rajat-patidar-named-as-replacement-12000662.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"Shreyas Iyer ruled out of India vs New Zealand ODI series, Rajat Patidar named as replacement","content":"Shreyas Iyer will miss the upcoming ODI series between India and New Zealand due to a back injury, the BCCI confirmed on Tuesday. The middle-order batter will be replaced with Rajat Patidar.“Team India batter Shreyas Iyer has been ruled out of the upcoming 3-match ODI series against New Zealand due to a back injury. He will be heading to the National Cricket Academy (NCA) for further assessment and management,” BCCI’s statement read.“The All-India Senior Selection Committee has named Rajat Patidar as replacement for Shreyas Iyer.”Iyer has been in sensational form in the ODIs, having scored 724 runs in 17 games in 2022 at an average of 56. he also slammed one century and six fifties. In the recently-concluded three-match ODI series against Sri Lanka, Iyer scored 94 runs.The ODI series against New Zealand starts on 18 January in Hyderabad. The second and third ODIs will be played on 21 (Raipur) and 24 (Indore) January.India’s updated ODI squad against New Zealand: Rohit Sharma (Captain), Shubman Gill, Ishan Kishan (wk), Virat Kohli, Suryakumar Yadav, KS Bharat (wk), Hardik Pandya (vice-captain), Rajat Patidar, Washington Sundar, Shahbaz Ahmed, Shardul Thakur, Yuzvendra Chahal, Kuldeep Yadav, Mohd. Shami, Mohd. Siraj, Umran Malik.Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2023-01-17 09:23:23","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/01/Shreyas-Iyer2.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Shreyas Iyer ruled out of NZ ODI series","link":"https://timesofindia.indiatimes.com/sports/cricket/new-zealand-in-india/india-vs-new-zealand-shreyas-iyer-ruled-out-of-odi-series/articleshow/97053596.cms","keywords":null,"creator":null,"video_url":null,"description":"Team India batsman Shreyas Iyer has been ruled out of the 3-match ODI series against New Zealand due to a back injury and will be heading to the National Cricket Academy (NCA) for further assessment and management.","content":null,"pubDate":"2023-01-17 09:11:38","image_url":null,"source_id":"toi","country":["india"],"category":["sports"],"language":"english"},{"title":"Shreyas Iyer ruled out, BCCI releases revised India squad for New Zealand ODIs - Hindustan Times","link":"https://news.google.com/__i/rss/rd/articles/CBMiiQFodHRwczovL3d3dy5oaW5kdXN0YW50aW1lcy5jb20vY3JpY2tldC9zaHJleWFzLWl5ZXItcnVsZWQtb3V0LWJjY2ktcmVsZWFzZXMtdXBkYXRlZC1pbmRpYS1zcXVhZC1mb3ItbmV3LXplYWxhbmQtb2Rpcy0xMDE2NzM5NDUwMTk0MDQuaHRtbNIBjQFodHRwczovL3d3dy5oaW5kdXN0YW50aW1lcy5jb20vY3JpY2tldC9zaHJleWFzLWl5ZXItcnVsZWQtb3V0LWJjY2ktcmVsZWFzZXMtdXBkYXRlZC1pbmRpYS1zcXVhZC1mb3ItbmV3LXplYWxhbmQtb2Rpcy0xMDE2NzM5NDUwMTk0MDQtYW1wLmh0bWw?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Shreyas Iyer ruled out, BCCI releases revised India squad for New Zealand ODIs  Hindustan TimesShreyas Iyer ruled out of NZ ODIs with back injury | Cricbuzz.com  CricbuzzIndia Vs New Zealand: Shreyas Iyer Ruled Out Of 3 Match ODI-Series Due To Back Injury | Mirror Now  MIRROR NOWShreyas ruled out of New Zealand ODIs with back injury  Rediff.comIND Vs NZ Update: Shreyas Iyer Ruled Out Of 3-match ODI Series Against New Zealand  ICC CRICKET SCHEDULEView Full coverage on Google News","content":null,"pubDate":"2023-01-17 08:45:47","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"'क्या टेस्ट में भी चौके-छक्के की बरसात करेंगे', ईशान किशन ने शुबमन गिल के सवाल का दिया जवाब, देखें Video","link":"https://sports.ndtv.com/hindi/cricket/ind-vs-aus-test-ishaan-kishan-answered-shubman-gills-question-how-will-you-bat-in-test-video-3699200#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"Shubman Gill Ishan Kishan: ऑस्ट्रेलिया के खिलाफ 2 टेस्ट (IND vs AUS Test Series) के लिए चुनी गई टीम में ईशान किशन को भी शामिल किया गया है","content":"Shubman Gill Ishan Kishan: ऑस्ट्रेलिया के खिलाफ 2 टेस्ट (IND vs AUS Test Series) के लिए चुनी गई टीम में ईशान किशन को भी शामिल किया गया है. बता दें कि यह पहली बार है जब ईशान को टेस्ट टीम में जगह मिली है. वनडे और टी-20 में ईशान ने अपनी बल्लेबाजी से धमाल मचा रखा है. वनडे में ईशान ने बांग्लादेश के खिलाफ दोहरा शतक ठोककर करिश्मा कर दिया था. अब ईशान ने पहली बार टेस्ट टीम में शामिल होने को लेकर बात की है. दरअसल, बीसीसीआई (BCCI) द्वारा एक वीडियो शेयर किया गया है जिसमें शुबमन गिल अपने साथी क्रिकेटर ईशान (Shubman Gill  Ishan Kishan) का इंटरव्यू लेते दिख रह हैं. इंटरव्यू में ईशान ने बताया कि जब उनका नाम टेस्ट टीम में शामिल किया गया तो वो बेहद ही खुश हुए, उन्होंने ही सबसे पहले अपने घर पर कॉल करके परिवार वालों को बताया. ईशान ने कहा कि, उनके पापा ने उन्हें और मेहनत करने को लेकर मोटीवेट किया. वहीं, जब गिल ने ईशान से पूछा कि, आपने वनडे और टी-20 में अपने पहले मैच में पहली गेंद पर चौका या फिर छक्के लगाकर अपनी पारी का शुरूआत किया है, क्या आप टेस्ट में भी ऐसा कुछ करने के बारे में सोच रहे हैं. इसपर ईशान ने कहा कि, ' टेस्ट में सिचुएशन के हिसाब से ही मैं अपनी पारी की शुरूआत करना चाहूंगा. यदि फील्डर ऊपर होंगे तो मैं गेंद देखकर शॉट मारूंगा, लेकिन टेस्ट क्रिकेट में आपको संभल कर खेलना होता है. यह अलग फॉर्मेंट होता है, आपको यहां परिस्थिति के अनुसार बल्लेबाजी करनी होती है.'टेस्ट में खुद की बल्लेबाजी को लेकर ईशान ने आगे कहा 'वह टेस्ट में अपनी जिम्मेदारी को समझ कर बैटिंग करेंगे. वहांयंगस्टर वाली हरकत नहीं करेंगे.', ईशान ने टेस्ट में अपनी बैटिंग पोजिशन को लेकर बात की और कहा कि 'नंबर 6 पर बल्लेबाजी करने से आप टीम के जरूरत के हिसाब से बल्लेबाजी कर सकते हैं.'Of maiden Test call-up, emotions & excitement to play red-ball cricket & more ?@ShubmanGill turns anchor to interview @ishankishan51 on his selection in #TeamIndia squad for the first two #INDvAUS Tests pic.twitter.com/oinLYky95Q— BCCI (@BCCI) January 17, 2023बता दें कि भारत और ऑस्ट्रेलिया के बीच 4 टेस्ट मैच खेले जाने हैं. पहला टेस्ट मैच 9 फरवरी को खेला जाएगा. ऋषभ पंत के न होने से ईशान औऱ केएस भरत को टेस्ट टीम में शामिल किया गया है. ये भी पढ़ेंVirat kohli का वनडे में तहलका, सबसे ज्यादा रन बनाने वाले खिलाड़ियों की लिस्ट में टॉप 5 में पहुंचेविराट कोहली ने दिखाया MS Dhoni वाला अंदाज, 'हेलीकॉप्टर शॉट' लगाकर लूटी महफिल, Videoस्पोर्ट्स से जुड़ी खबर के लिए सब्सक्राइब करें NDTV Sports HIndi","pubDate":"2023-01-17 08:26:35","image_url":"https://c.ndtvimg.com/2023-01/5s0jb858_shubman-gill-ishan-kishan_625x300_17_January_23.jpg","source_id":"ndtv_in","country":["india"],"category":["sports"],"language":"hindi"}]}