{"newsArray":[{"title":"CSK auction strategy 2022: What should be Chennai Super Kings’ strategy for IPL 2022 auction?","link":"https://thesportsrush.com/cricket-news-csk-auction-strategy-2022-what-should-be-chennai-super-kings-strategy-for-ipl-2022-auction/","keywords":["Cricket","CSK","IPL 2022","chennai super kings","csk","Indian Premier League","IPL"],"creator":["Gurpreet Singh"],"video_url":null,"description":"CSK auction strategy 2022: Does MS Dhoni still have it in him to keep backing experience or we’ll see a different strategy this time around? The time has nearly arrived for the commencement of one of the most exciting two-day event of India’s biggest T20 tournament. Bengaluru is ready to host the 10 IPL franchises… The post CSK auction strategy 2022: What should be Chennai Super Kings’ strategy for IPL 2022 auction? appeared first on The SportsRush.","content":"CSK auction strategy 2022: Does MS Dhoni still have it in him to keep backing experience or we’ll see a different strategy this time around? The time has nearly arrived for the commencement of one of the most exciting two-day event of India’s biggest T20 tournament. Bengaluru is ready to host the 10 IPL franchises as their respective think-tanks would assemble under a roof to kick-off the much anticipated mega auction ahead of the tournament’s 15th edition. A total of 590 names of players would go under the hammer on February 12 and 13, with the ten franchises strategizing and brainstorming their ways to form their respective squads within a purse limit of INR 90 Crore. As far as the CSK is concerned, the management has decided to stick with its ‘Thala’-MSD, and wishes to give its most important asset another stint to have a run for glory for the final time (or maybe one more after this, who knows?). Anyway, they have relegated him to the second retention spot at INR 12 Crore, with all-rounder Ravindra Jadeja being retained at the top spot with INR 16 Crore. Moeen Ali (INR 8 Crore) and Ruturaj Gaikwad (INR 6 Crore) fill the final two retention spots respectively. The @ChennaiIPL retention list is out! Take a look! #VIVOIPLRetention pic.twitter.com/3uyOJeabb6 — IndianPremierLeague (@IPL) November 30, 2021 Had it not been for Dhoni’s captaincy brilliance and excellent man-management skills, it would have been difficult for the franchise to continue with him for another season, given his waning ability with the bat in hand. His batting numbers the previous two seasons are a testament to the same. Having said that, Dhoni’s continuation is important for the franchise from a financial point of view as well. As per a recent report, CSK’s market capitalization has piped its parent company India Cements, and a large credit for it goes to MSD- CSK’s ultimate brand. It also partly explains for the reason they decided to give someone like a Suresh Raina- the next popular face of the franchise, an extended run in IPL 2021, despite ordinary returns with the bat, and being out of competitive Cricketing action since his International retirement in August 2020 (the day Dhoni retired as well). However, Raina had to be dropped before the knock-out stage because it is Cricket which ultimately matters despite all the initial brand creation, as teams will only define themselves by the successes they achieve on the field. CSK auction strategy 2022: Has CSK decided upon its future captain? This brings us to the question whether CSK continue to opt for experience as they have, since their title winning season in 2018, or they opt for the inclusion of more number of young talent given this might probably be the last mega auction and that Dhoni would have to ultimately hang up his boots soon. In all probability, in line with the adage-‘Change is the only constant’, CSK and MS Dhoni should surely look to invest in future talent, targeting the Indian players, especially the local ones in and around their home state of Tamil Nadu. Surely the CSK management understand the need to dive into the past to make better sense of the present and the future, when the local, less-heralded players like Subramaniam Badrinath, Laxmipathy Balaji, or a certain Ravichandran Ashwin were included in their squad back in 2008, forming a core group of players for the franchise. Over the years, these aforementioned players, along with the likes of Suresh Raina, Ravindra Jadeja, and of course MS Dhoni have emerged as a strong core group of 7-8 players who have been with the franchise for successive seasons. Barring Balaji, all these players have played over 100 matches for CSK, with Balaji still with the franchise in the capacity of a bowling coach. This perhaps underlines the franchise’s success mantra over the years. While their overseas core has witnessed changes with seasons, CSK’s Indian players continued to remain their strength. They, defined the team. And who knows, that despite not having handed the likes of N Jagadeesan, R Sai Kishore, C Hari Nishaanth (all from Tamil Nadu and part of CSK squad last year) enough games for CSK, the franchise might buy them back during the mega auction, along with Ravichandran Ashwin as the experienced campaigner. Finally, as far as the franchise’s next leader/captain is concerned, someone like an MS Dhoni very well understands the value of a smooth transition in this regard; as we witnessed Virat Kohli, taking forward the Indian captaincy legacy from MS when he felt the former was ready to shoulder the responsibility. Thus, with Dhoni’s repeated position of faith in Ravindra Jadeja, who has been with the franchise since 2012, and with CSK’s decision to hand him the first retention spot, it might well be a sign of what to expect in the future. Only time will tell. The post CSK auction strategy 2022: What should be Chennai Super Kings’ strategy for IPL 2022 auction? appeared first on The SportsRush.","pubDate":"2022-02-10 22:15:58","full_description":null,"image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"CTB vs CS Dream11 Prediction: Fantasy Cricket Tips, Today's Playing 11 and Pitch Report","link":"https://www.sportskeeda.com/fantasy-cricket-mantra/ctb-vs-cs-dream11-prediction-fantasy-cricket-tips-today-s-playing-11-pitch-report?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Fantasy Cricket Mantra"],"creator":["Farzan Mohamed"],"video_url":null,"description":null,"content":null,"pubDate":"2022-02-10 19:33:20","full_description":"Canterbury Kings will take on Central Stags in the 19th match of the Ford Trophy 2021-22 on Friday, 11th February 2022 at the Mainpower Oval, Rangoira. Canterbury Kings are currently in fifth spot with just one win and three losses in six matches. They are coming into this match on the back of a three-wicket defeat against Wellington Firebirds. Meanwhile, Central Stags have been brilliant and are currently in top spot with three wins in five games. They haven't lost a match yet and are coming off a massive 200-run win over Otago in their previous game. Canterbury Kings Chad Bowes, Ken McClure, Daryl Mitchell, Tom Latham (wk), Leo Carter, Cole McConchie (c), Henry Shipley, Theo van Woerkom, Matt Henry, Will Williams, Ed Nuttall Central Stags Ben Smith, Bayley Wiggins (wk), Will Young, Ross Taylor, Tom Bruce (c), Josh Clarkson, Doug Bracewell, Adam Milne, Seth Rance, Blair Tickner, Jayden Lennox Match: Canterbury Kings vs Central Stags, Match 19 Date and Time: Friday, 11th February 3:30 AM IST Venue: Mainpower Oval, Rangoira The pitch at Mainpower Oval offers assistance to the pacers. There will be movement and bounce on offer for the seamers. The overcast conditions will be an added advantage for the fast bowlers at this venue. Wicketkeeper Bayley Wiggins: Bayley has performed brilliantly so far this season. He has 80 runs to his name along with nine catches in just two games. Batter Will Young: Young is one of the most consistent batters for the Stags. He has scored 147 runs in two games, including one century. Leo Carter: Leo Carter has been a reliable batter for the Kings. He has 173 runs to his name, including two half-centuries in four games. All-rounders Doug Bracewell: Brace has made vital contributions with both the bat and the ball. He has picked up six wickets and has scored 71 runs in three games. Henry Shipley: Henry has performed well in both aspects of the game. He has scored 147 runs and also has three wickets to his name in four matches. Bowlers Seth Rance: Rance has been exceptional with the ball for the Stags. He has managed to grab eight wickets in three games while conceding at an economy of less than four. Adam Milne: Milne is one of the best white-ball bowlers in New Zealand. In the previous game, he grabbed two wickets and scored 50 runs at a strike rate of 238. Henry Shipley: 313 points Seth Rance: 260 points Doug Bracewell: 259 points Leo Carter: 245 points Adam Milne: 192 points Henry Shipley: Four matches, 147 runs, three wickets Seth Rance: Three matches, eight wickets Doug Bracewell: Three matches, 71 runs, six wickets Leo Carter: Four matches, 173 runs Adam Milne: Two matches, 50 runs, three wickets Fantasy Suggestion #1: Bayley Wiggins, Leo Carter, Will Young, Henry Shipley, Doug Bracewell, Seth Rance, Adam Milne, Tom Latham, Chad Bowes, Theo van Woerkom, Matt Henry Captain: Doug Bracewell Vice-Captain: Henry Shipley Fantasy Suggestion #2: Bayley Wiggins, Leo Carter, Will Young, Henry Shipley, Doug Bracewell, Seth Rance, Adam Milne, Ken McClure, Cole McConchie, Blair Tickner, Will Williams Captain: Seth Rance Vice-Captain: Adam Milne","image_url":"https://static.sportskeeda.com/editor/2022/02/713a7-16445153366454-1920.jpg","source_id":"sportskeeda","country":["india"],"category":["sports"],"language":"english"},{"title":"How Cricket Australia invested in player power and caused a coaching calamity - ABC News","link":"https://news.google.com/__i/rss/rd/articles/CBMib2h0dHBzOi8vd3d3LmFiYy5uZXQuYXUvbmV3cy8yMDIyLTAyLTExL2p1c3Rpbi1sYW5nZXItd2hlcmUtdG8tbmV4dC1pbi1jb2FjaGluZy1jcmlja2V0LWF1c3RyYWxpYS1leGl0LzEwMDgyMDc2ONIBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"How Cricket Australia invested in player power and caused a coaching calamity  ABC News","content":null,"pubDate":"2022-02-10 19:18:14","image_url":null,"source_id":"google","country":["australia"],"category":["sports"],"language":"english"},{"title":"India vs West Indies 3rd ODI Live Cricket Score Streaming Online: When and where to watch match live?","link":"https://indianexpress.com/article/sports/cricket/india-vs-west-indies-3rd-odi-live-cricket-score-streaming-online-time-ist-tv-channel-7766730/","keywords":["Cricket","Sports"],"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2022-02-10 17:27:17","full_description":"LIVE Stream India vs West Indies match Online: The returning Shikhar Dhawan will add more firepower to a ruthless India, who are faced with the problem of plenty, as they eye a clean sweep of West Indies in an inconsequential third ODI in Ahmedabad on Friday. Hosts India head into the final match of the series after having ticked almost all the boxes in the first two games, which they won comfortably. Senior opener Dhawan was among the four players, including a reserve bowler, who had tested positive for COVID-19 just four days ahead of the start of the ODI leg. https://images.indianexpress.com/2020/08/1x1.png But now that the southpaw is back, the Indian team could be forced to make few changes to its winning combination. Squads: India: Rohit Sharma (captain), KL Rahul (vice-captain), Mayank Agarwal , Ruturaj Gaikwad, Shikhar Dhawan, Virat Kohli , Surya Kumar Yadav, Shreyas Iyer , Ishan Kishan (wicket-keeper), Deepak Hooda , Rishabh Pant (wicket-keeper), Deepak Chahar, Shardul Thakur, Yuzvendra Chahal , Kuldeep Yadav, Washington Sundar , Ravi Bishnoi , Mohd. Siraj, Prasidh Krishna, Avesh Khan , Shahrukh Khan. West Indies: Kieron Pollard (captain), Fabian Allen, Nkrumah Bonner, Darren Bravo, Shamarh Brooks, Jason Holder, Shai Hope, Akeal Hosein, Alzarri Joseph, Brandon King, Nicolas Pooran, Kemar Roach, Romario Shepard, Odean Smith, Hayden Walsh Jr. Top Sports News Now Someone else took credit for decisions I took in Australia, says Ajinkya Rahane Pant experiment doesn’t come off, but step in right direction Winter Games: Two women take competition to new heights Click here for more Where is India vs West Indies 3rd ODI match being played? The India vs West Indies 3rd ODI will take place at the Narendra Modi Stadium in Ahmedabad. At what time does India vs West Indies 3rd ODI match start? India vs West Indies 3rd ODI begins at 1:30 PM IST on Friday (February 11). Where to watch the live coverage of the India vs West Indies 3rd ODI match? The India vs West Indies 3rd ODI will be aired live on Star Sports channels – Star Sports 1, Star Sports 1 HD, Star Sports 1 Hindi, Star Sports 1 Hindi HD, Star Sports 1 Tamil, Star Sports 1 Telugu, and Star Sports 1 Kannada. How to watch India vs West Indies 3rd ODI match online? The online streaming of the India vs West Indies 3rd ODI will be available on the Hotstar app and the website. For all the live match score and updates, follow http://www.indianexpress.com","image_url":null,"source_id":"indianexpress","country":["india"],"category":["sports"],"language":"english"},{"title":"Sydney Cricket Ground records: List of SCG T20I records and batting and bowling stats","link":"https://thesportsrush.com/cricket-news-sydney-cricket-ground-records-list-of-scg-t20i-records-and-batting-and-bowling-stats/","keywords":["Cricket","Australia","Sri Lanka","Sri Lanka tour of Australia"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Sydney Cricket Ground records: The iconic Sydney Cricket Ground will be hosting a T20I after more than 14 months. Sri Lanka’s tour of Australia 2022 will kick-start with the first of the five T20Is to be played at the Sydney Cricket Ground tomorrow. In what will be Australia and Sri Lanka’s seventh bilateral series against… The post Sydney Cricket Ground records: List of SCG T20I records and batting and bowling stats appeared first on The SportsRush.","content":"Sydney Cricket Ground records: The iconic Sydney Cricket Ground will be hosting a T20I after more than 14 months. Sri Lanka’s tour of Australia 2022 will kick-start with the first of the five T20Is to be played at the Sydney Cricket Ground tomorrow. In what will be Australia and Sri Lanka’s seventh bilateral series against each other, it will be their first bilateral T20I after more than two years. Talking about the venue, Sydney will be hosting a T20I after more than 14 months. Australia, who have played nine T20Is at this venue between 2007-2020, have won five and lost three till date. Sri Lanka, on the other hand, have played 19 ODIs and a Test match in Sydney but will be playing their first-ever T20I on Friday. Hence, there are no T20I records in Sydney with respect to Sri Lankan players. Best of luck to @dasunshanaka1 and team #SriLanka for the T20 series against #Australia. It’s not going to be easy playing against the current T20 World Cup holders in their own soil but I’m confident that our boys will step up to the challenge. #ජයගමු #Cricket #AUSvSL pic.twitter.com/IC1Wl4SlE3 — Namal Rajapaksa (@RajapaksaNamal) February 10, 2022 Sydney Cricket Ground records Surprisingly, no Australian but former Indian captain Virat Kohli (236) is the highest T20I run-scorer at the Sydney Cricket Ground. While former Australia all-rounder Shane Watson (186) follows Kohli, it is worth mentioning that the Top 11 highest run-scorers in Sydney T20Is are Australian and Indian batters. Batter Matches Runs Highest Average SR 100 50 Virat Kohli (IND) 4 236 85 78.66 145.67 0 3 Shane Watson (AUS) 2 186 124* 178.84 1 0 Shikhar Dhawan (IND) 4 147 52 36.75 167.04 0 1 Matthew Wade (AUS) 2 138 80 69 162.35 0 2 Glenn Maxwell (AUS) 5 132 54 33 140.42 0 1 As far as the bowlers are concerned, Top eight highest wicket-takers in Sydney are all Australian and Indian bowlers. It is worth mentioning that three out of the Top three highest wicket-takers are spinners. Bowler Matches Wickets Average Economy SR Andrew Tye (AUS) 5 8 26.28 9.35 16.8 Krunal Pandya (IND) 1 4 9 9 6 Mitchell Swepson (AUS) 2 4 12 6 12 Adam Zampa (AUS) 5 4 32.5 7.64 25.5 Billy Stanlake (AUS) 1 3 5 3.75 8 Highest score at Sydney Cricket Stadium in T20Is Australia and India once again dominate in this list as the Top 10 highest T20I scores in Sydney have been scored between these two teams. The same also has a lot to do with India (4) playing the second-highest number of T20Is here. ALSO READ: When and where to watch Australia vs Sri Lanka Sydney T20I? India’s T20I success in Sydney can be judged from the fact that the Top four highest chases (200/3, 195/4, 174/7 and 168/4) in the format here have been done by them. Team Score Overs Opposition Year Australia 221/5 20 England 2007 India 200/3 20 Australia 2016 Australia 197/5 20 India 2016 India 195/4 19.4 Australia 2020 Australia 194/5 20 India 2020 The post Sydney Cricket Ground records: List of SCG T20I records and batting and bowling stats appeared first on The SportsRush.","pubDate":"2022-02-10 16:58:29","full_description":"Sydney Cricket Ground records: The iconic Sydney Cricket Ground will be hosting a T20I after more than 14 months. Sri Lanka’s tour of Australia 2022 will kick-start with the first of the five T20Is to be played at the Sydney Cricket Ground tomorrow. In what will be Australia and Sri Lanka’s seventh bilateral series against each other, it will be their first bilateral T20I after more than two years. Talking about the venue, Sydney will be hosting a T20I after more than 14 months. Australia, who have played nine T20Is at this venue between 2007-2020, have won five and lost three till date. Sri Lanka, on the other hand, have played 19 ODIs and a Test match in Sydney but will be playing their first-ever T20I on Friday. Hence, there are no T20I records in Sydney with respect to Sri Lankan players. Best of luck to @dasunshanaka1 and team #SriLanka for the T20 series against #Australia . It’s not going to be easy playing against the current T20 World Cup holders in their own soil but I’m confident that our boys will step up to the challenge. #ජයගමු #Cricket #AUSvSL 🇱🇰 pic.twitter.com/IC1Wl4SlE3 — Namal Rajapaksa (@RajapaksaNamal) February 10, 2022 Surprisingly, no Australian but former Indian captain Virat Kohli (236) is the highest T20I run-scorer at the Sydney Cricket Ground. While former Australia all-rounder Shane Watson (186) follows Kohli, it is worth mentioning that the Top 11 highest run-scorers in Sydney T20Is are Australian and Indian batters. As far as the bowlers are concerned, Top eight highest wicket-takers in Sydney are all Australian and Indian bowlers. It is worth mentioning that three out of the Top three highest wicket-takers are spinners. Australia and India once again dominate in this list as the Top 10 highest T20I scores in Sydney have been scored between these two teams. The same also has a lot to do with India (4) playing the second-highest number of T20Is here. ALSO READ: When and where to watch Australia vs Sri Lanka Sydney T20I? India’s T20I success in Sydney can be judged from the fact that the Top four highest chases (200/3, 195/4, 174/7 and 168/4) in the format here have been done by them.","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"IPL player auction 2022: 5 Indian pacers IPL teams can target during IPL 2022 mega auction","link":"https://thesportsrush.com/cricket-news-ipl-player-auction-2022-5-indian-pacers-ipl-teams-can-target-during-ipl-2022-mega-auction/","keywords":["Cricket","IPL 2022","Indian Premier League","IPL","IPL 2022 mega auction"],"creator":["Gurpreet Singh"],"video_url":null,"description":"IPL player auction 2022: 5 Indian pacers who are expected to be in huge demand and make way for a potential bidding war at the auction table. The time has nearly arrived for the commencement of one of the most exciting two-day event of India’s biggest T20 tournament. Benguluru is ready to host the 10… The post IPL player auction 2022: 5 Indian pacers IPL teams can target during IPL 2022 mega auction appeared first on The SportsRush.","content":"IPL player auction 2022: 5 Indian pacers who are expected to be in huge demand and make way for a potential bidding war at the auction table. The time has nearly arrived for the commencement of one of the most exciting two-day event of India’s biggest T20 tournament. Benguluru is ready to host the 10 IPL franchises as their respective think-tanks would assemble under a roof to kick-off the much anticipated mega auction ahead of the tournament’s 15th edition. A total of 590 names of players would go under the hammer on February 12 and 13, with the ten franchises strategizing and brainstorming their ways to form their respective squads within a purse limit of INR 90 Crore. The 590 Cricketers, comprise 220 overseas and 370 Indian players; and to further break it down 228 capped players, and 355 uncapped players. As is the case with every IPL auction, the Indian players would be in much demand as compared to their overseas counterparts. On that note, let’s have a look at the Indian pacers likely to the centre of attraction of the 10 franchises. ALSO READ: Uncapped players in IPL 2022 auction who might make it big IPL player auction 2022: 5 Indian pacers likely to make it big in the auction Mohammed Shami One of India’s finest pacers currently- Mohammed Shami, with a base price of INR 2 Crore,is one of the 10 marquee players who would mark the beginning of the mega auction. Shami’s rich IPL experience might actually make him the most sought-after Indian pacers possessing the ability to bowl with the new ball upfront and during the death Overs as well. The 31-year-old has played a total of 77 matches for the Kolkata Knight Riders (2011-2013), Delhi Daredevils (2014-2018), and the Punjab Kings (2019-2021) and has scalped 79 wickets so far in his IPL career. During the previous season, he ended up as the highest wicket-taker for PBKS, picking 19 wickets across 14 innings, at an average and Economy Rate of 20.78 and 7.50 rpo respectively. His strike rate of 16.6 was the second best for the franchise (for players who’ve played at least 9 matches in the season). In fact, Shami has been the highest wicket-taker (58) for the Punjab franchise in each of the previous three IPL seasons. Avesh Khan This 25-year-old fast bowler from Madhya Pradesh, owned the spotlight during the previous season of the league due his sheer pace and ability to bowl immaculately, especially during the death Overs for the Delhi Capitals (DC). Avesh Khan emerged as the second-highest wicket-taker of the league last year, and the highest for Delhi, with a total of 24 wickets across 16 innings at an average of 18.75. Talking about death bowling, Khan’s 30 Yorkers in IPL 2021 were the second-most in the competition. His maiden call-up for the Indian team for the ongoing series against West Indies might also act as an added advantage for him heading into the auction venue. Deepak Chahar Chahar has been one of the finds of Chennai Super Kings (CSK) ever since his association with the franchise in 2018. In a format where generally the batters dominate proceedings and hog majority of the limelight, Chahar emerged as CSK’s go-to bowler during the Powerplay Overs. His 42 off the 58 wickets for the franchise have come during the first six Overs, which is 15 more than Trent Boult- the next best in the last four IPL seasons. He has also been the leading wicket-taker for the Super Kings during this period. Additionally, with his recent exploits with the bat against Sri Lanka (where he single-handedly won the match for India), and then recently against South Africa (where he nearly won the match for India), Chahar has also proven to be a bonus prospect lower down the batting order. Prasidh Krishna His recent couple of performances against the West Indies (6* wickets at an average of 6.83) during the ongoing ODI series, is perhaps enough testament regarding the ability of this 25-year-old fast bowler from Karnataka. Krishna had been an integral part of the KKR bowling line-up in the previous four seasons, picking up a total of 30 wickets across 34 matches at an average of 38.40. He was the 4th highest wicket-taker for the franchise during the previous season with 12 wickets across 10 innings, at a Strike rate of 19.25. His ability to bowl consistently above the 140 km/h mark might attract groundbreaking attention of the franchises at the auction table. Harshal Patel No points for guessing that Harshal Patel- the Purple Cap winner of the previous edition of the IPL will be at the radar of quite a few franchises. Patel scalped a total of 32 wickets- the most by an Indian in a single edition of the tournament, across 15 innings at an average of 14.34 for the RCB last year. He was 8 wickets ahead of the second placed Avesh Khan to don the prestigious cap. He also broke Yuzvendra Chahal’s 2015 season record of bagging the most wickets by an uncapped player in an IPL season. Chahal had picked up 23 wickets for RCB during IPL 2015. Two uncapped players have claimed the maximum wickets in this #IPL edition. This is the most by any such bowler in a single IPL edition. 26* – Harshal Patel #RCB in 2021 21* – Avesh Khan #DC in 2021 20 – Shreyas Gopal #RR in 2019#IPL2021#MIvDC #MIvsDC#DCvMI #DCvsMI — Mohandas Menon (@mohanstatsman) October 2, 2021 For more Cricket-related news, click here. The post IPL player auction 2022: 5 Indian pacers IPL teams can target during IPL 2022 mega auction appeared first on The SportsRush.","pubDate":"2022-02-10 16:50:14","full_description":"IPL player auction 2022: 5 Indian pacers who are expected to be in huge demand and make way for a potential bidding war at the auction table. The time has nearly arrived for the commencement of one of the most exciting two-day event of India’s biggest T20 tournament. Benguluru is ready to host the 10 IPL franchises as their respective think-tanks would assemble under a roof to kick-off the much anticipated mega auction ahead of the tournament’s 15th edition. A total of 590 names of players would go under the hammer on February 12 and 13, with the ten franchises strategizing and brainstorming their ways to form their respective squads within a purse limit of INR 90 Crore. The 590 Cricketers, comprise 220 overseas and 370 Indian players; and to further break it down 228 capped players, and 355 uncapped players. As is the case with every IPL auction, the Indian players would be in much demand as compared to their overseas counterparts. On that note, let’s have a look at the Indian pacers likely to the centre of attraction of the 10 franchises. ALSO READ: Uncapped players in IPL 2022 auction who might make it big Mohammed Shami One of India’s finest pacers currently- Mohammed Shami, with a base price of INR 2 Crore,is one of the 10 marquee players who would mark the beginning of the mega auction. Shami’s rich IPL experience might actually make him the most sought-after Indian pacers possessing the ability to bowl with the new ball upfront and during the death Overs as well. The 31-year-old has played a total of 77 matches for the Kolkata Knight Riders (2011-2013), Delhi Daredevils (2014-2018), and the Punjab Kings (2019-2021) and has scalped 79 wickets so far in his IPL career. During the previous season, he ended up as the highest wicket-taker for PBKS, picking 19 wickets across 14 innings, at an average and Economy Rate of 20.78 and 7.50 rpo respectively. His strike rate of 16.6 was the second best for the franchise (for players who’ve played at least 9 matches in the season). In fact, Shami has been the highest wicket-taker (58) for the Punjab franchise in each of the previous three IPL seasons. Avesh Khan This 25-year-old fast bowler from Madhya Pradesh, owned the spotlight during the previous season of the league due his sheer pace and ability to bowl immaculately, especially during the death Overs for the Delhi Capitals (DC). Avesh Khan emerged as the second-highest wicket-taker of the league last year, and the highest for Delhi, with a total of 24 wickets across 16 innings at an average of 18.75. Talking about death bowling, Khan’s 30 Yorkers in IPL 2021 were the second-most in the competition. His maiden call-up for the Indian team for the ongoing series against West Indies might also act as an added advantage for him heading into the auction venue. Deepak Chahar Chahar has been one of the finds of Chennai Super Kings (CSK) ever since his association with the franchise in 2018. In a format where generally the batters dominate proceedings and hog majority of the limelight, Chahar emerged as CSK’s go-to bowler during the Powerplay Overs. His 42 off the 58 wickets for the franchise have come during the first six Overs, which is 15 more than Trent Boult- the next best in the last four IPL seasons. He has also been the leading wicket-taker for the Super Kings during this period. Additionally, with his recent exploits with the bat against Sri Lanka (where he single-handedly won the match for India), and then recently against South Africa (where he nearly won the match for India), Chahar has also proven to be a bonus prospect lower down the batting order. Prasidh Krishna His recent couple of performances against the West Indies (6* wickets at an average of 6.83) during the ongoing ODI series, is perhaps enough testament regarding the ability of this 25-year-old fast bowler from Karnataka. Krishna had been an integral part of the KKR bowling line-up in the previous four seasons, picking up a total of 30 wickets across 34 matches at an average of 38.40. He was the 4th highest wicket-taker for the franchise during the previous season with 12 wickets across 10 innings, at a Strike rate of 19.25. His ability to bowl consistently above the 140 km/h mark might attract groundbreaking attention of the franchises at the auction table. Harshal Patel No points for guessing that Harshal Patel- the Purple Cap winner of the previous edition of the IPL will be at the radar of quite a few franchises. Patel scalped a total of 32 wickets- the most by an Indian in a single edition of the tournament, across 15 innings at an average of 14.34 for the RCB last year. He was 8 wickets ahead of the second placed Avesh Khan to don the prestigious cap. He also broke Yuzvendra Chahal’s 2015 season record of bagging the most wickets by an uncapped player in an IPL season. Chahal had picked up 23 wickets for RCB during IPL 2015. Two uncapped players have claimed the maximum wickets in this #IPL edition. This is the most by any such bowler in a single IPL edition. 26* – Harshal Patel #RCB in 2021 21* – Avesh Khan #DC in 2021 20 – Shreyas Gopal #RR in 2019 #IPL2021 #MIvDC #MIvsDC #DCvMI #DCvsMI — Mohandas Menon (@mohanstatsman) October 2, 2021 For more Cricket-related news, click here.","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Sydney Cricket Ground weather: What is SCG weather forecast for Australia vs Sri Lanka 1st T20I?","link":"https://thesportsrush.com/cricket-news-sydney-cricket-ground-weather-what-is-scg-weather-forecast-for-australia-vs-sri-lanka-1st-t20i/","keywords":["Cricket","Australia","Sri Lanka","Sri Lanka tour of Australia"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Sydney Cricket Ground weather: The SportsRush presents before you the weather prediction for first AUS vs SL T20I. The ongoing Australian men’s summer is all in readiness of witnessing its first-ever white-ball match as Australia will host Sri Lanka for a T20I at the Sydney Cricket Ground tomorrow. In what is going to be the… The post Sydney Cricket Ground weather: What is SCG weather forecast for Australia vs Sri Lanka 1st T20I? appeared first on The SportsRush.","content":"Sydney Cricket Ground weather: The SportsRush presents before you the weather prediction for first AUS vs SL T20I. The ongoing Australian men’s summer is all in readiness of witnessing its first-ever white-ball match as Australia will host Sri Lanka for a T20I at the Sydney Cricket Ground tomorrow. In what is going to be the seventh T20I bilateral series between these two teams, it is also going to be the first-ever five-match T20I series between them. While Australia lead Sri Lanka in the overall head-to-head record between these two teams in the shortest format, the visitors have surprisingly done better in Australia. Although weak on paper against the defending champions, Sri Lanka wouldn’t get a better chance to prepare for the ICC T20 World Cup 2022 than playing five T20Is in a country where the world event is to be played. Sydney Cricket Ground weather Hosting a T20I after more than 14 months, the iconic Sydney Cricket Ground might end up disappointing the players and fans due to weather-related reasons. Steve Smith was rolling the arm over in the nets yesterday. Will we be seeing more of his leg-spin in the #AUSvSL T20 series? pic.twitter.com/GKwuWMgGey — cricket.com.au (@cricketcomau) February 9, 2022 According to AccuWeather, there’s a strong possibility of rain forcing players to take shelter on Friday. While the temperature will remain between 20-22 degree during the evening time, the rain probability between 8-9 PM (local time) is predicted to be as high as 75%. It goes without saying that it is during this particular time that showers are predicted in Sydney. It is around 10 PM that rain probability is anticipated to reduce to 49% before falling to 34% around 11 PM. Going by the weather prediction, it wouldn’t be wrong to say that a rain-curtailed first T20I could be upon us. Sydney hourly weather 07:00 PM – 22 degree (Cloudy). 08:00 PM – 20 degree (Showers). 09:00 PM – 21 degree (Showers). 10:00 PM – 21 degree (Mostly Cloudy). 11:00 PM – 21 degree (Intermittent Clouds). 00:00 AM – 21 degree (Intermittent Clouds). The post Sydney Cricket Ground weather: What is SCG weather forecast for Australia vs Sri Lanka 1st T20I? appeared first on The SportsRush.","pubDate":"2022-02-10 15:29:07","full_description":null,"image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"India vs West Indies: Cricket Association of Bengal requests BCCI to allow spectators for T20I series","link":"https://indianexpress.com/article/sports/cricket/india-vs-west-indies-cricket-association-of-bengal-requests-bcci-to-allow-spectators-for-t20i-series-7766646/","keywords":["Cricket","Sports"],"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2022-02-10 15:11:44","full_description":"The Cricket Association of Bengal (CAB) on Thursday requested the Board of Control for Cricket in India (BCCI) to allow spectators at Eden Gardens for the T20I series against West Indies. “The matter relating to the hosting of the three T20 international matches between India and West Indies were discussed threadbare,” CAB said in a statement. “It was informed to the members that the CAB has requested the BCCI to allow spectators at the venue. Feedback from the BCCI is awaited. CAB is still hopeful of a positive outcome.” India and West Indies will lock horns in the T20I series at the Eden Gardens, Kolkata from February 16. https://images.indianexpress.com/2020/08/1x1.png The Apex Council Meeting of CAB also approved the decision that the floodlight system of the Eden Gardens needed renovation and the LED system needed to be installed at the earliest with DMX facility. Top Sports News Now Someone else took credit for decisions I took in Australia, says Ajinkya Rahane Pant experiment doesn’t come off, but step in right direction Winter Games: Two women take competition to new heights Click here for more It was further decided that fixtures and tournament rules for the upcoming league tournaments for both first and second divisions may be released immediately. “Registration window for the players has been extended till 28 February 2022 keeping in mind the current relaxations accorded by the State Government so that it’s easier for the clubs, units as well as the players to come and complete their registration formalities,” CAB said.","image_url":null,"source_id":"indianexpress","country":["india"],"category":["sports"],"language":"english"},{"title":"PSL 2022: Multan Sultans vs Peshawar Zalmi Live Cricket Score And Updates","link":"https://sports.ndtv.com/cricket/pakistan-super-league-2022-multan-sultans-vs-peshawar-zalmi-live-cricket-score-and-updates-2761270","keywords":null,"creator":null,"video_url":null,"description":"Pakistan Super League 2022: Multan Sultans vs Peshawar Zalmi Live Cricket Score And Updates: Multan Sultans are taking on Peshawar Zalmi in a Pakistan Super League (PSL) 2022 match at the Gaddafi...","content":null,"pubDate":"2022-02-10 14:34:39","full_description":"PSL 2022: Multan Sultans vs Peshawar Zalmi Live Cricket Score And Updates: Multan Sultans are taking on Peshawar Zalmi in a Pakistan Super League (PSL) 2022 match at the Gaddafi Stadium in Lahore. The two sides had faced off in their previous match as well, with Multan Sultans prevailing over Peshawar Zalmi by 57 runs. Multan Sultans are captained by Pakistan wicketkeeper-batter Mohammad Rizwan while Peshawar Zalmi are led by veteran pace bowler Wahab Riaz. The team from Multan currently leads the standings with five wins out of five while Peshawar Zalmi are fifth with two wins out of five. ( LIVE SCORECARD ) 2 runs. Starts by following the left-hander down the leg side with a short ball, Masood steps back and punches it to deep cover for a single. Tucks it off his pads in the mid-wicket pocket and collects a couple. 9 from the over. FOUR! Smashed! First boundary after the Powerplay. Mohammad Rizwan again uses his feet to rush down the track and hammers a full ball behind the bowler for a boundary at long on. Floated and full around off, Mohammad Rizwan dances down the track and lofts it over covers for a brace. Uses his feet to come down the track but drives a full ball straight to short cover. Slider outside off, Masood walks down the track but fails to get any bat behind it. It clips his pads and rolls to point for a leg bye. Flighted and full outside off, Masood tries to drive but misses. Saqib Mahmood is having a word with the fourth umpire outside the boundary line. Perhaps asking when he can go in and bowl. Fuller, on middle and leg. Masood nudges it to the leg side for one run. Tossed up, full and on leg. Masood clips it to square leg with soft hands and the batters take two run. Masood gets his FIFTY in 34 balls. This is a brilliant knock by him. He carries his good form to Lahore from Karachi. Fuller, on middle and leg. Rizwan comes forward and works it to mid-wicket for a single. Saqib Mahmood is outside the boundary line, receiving some treatment. Quicker one, full and outside off. Rizwan tries to chase it but misses it completely. On leg, Rizwan flicks it to mid-wicket. CLOSE! Almost dragged on. This is quicker and flatter, outside off. Rizwan gets low and looks to sweep it away. He only manages to inside edge it just past the off pole. Fuller, on middle and leg. Rizwan comes forward and flicks it to mid-wicket for a brisk single. Angled into the pads, Masood clips it into the gap on the leg side for one. Fuller, on off. Masood drives it through mid off for a brace now. TWO WIDES! This is full and down the leg side. Rizwan looks to sweep but does not get any bat on it. The keeper also fails to gather the ball and it gets deflected off Kamran's pads to the on side. They cross.","image_url":"https://c.ndtvimg.com/2022-02/bc5f8e4o_psl-twitter_120x90_10_February_22.jpg","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"India vs West Indies: Cricket Association of Bengal asks BCCI to allow fans for T20I series","link":"https://www.indiatvnews.com/sports/cricket/india-vs-west-indies-cricket-association-of-bengal-asks-bcci-to-allow-fans-for-t20i-series-2022-02-10-759013","keywords":null,"creator":null,"video_url":null,"description":"The Cricket Association of Bengal (CAB) on Thursday requested the Board of Control for Cricket in India (BCCI) to allow spectators at Eden Gardens for the T20I series against West Indies. India and West Indies will lock horns in the T20I series at the Eden Gardens, Kolkata from February 16.","content":null,"pubDate":"2022-02-10 14:34:27","full_description":"The Cricket Association of Bengal (CAB) on Thursday requested the Board of Control for Cricket in India (BCCI) to allow spectators at Eden Gardens for the T20I series against West Indies. India and West Indies will lock horns in the T20I series at the Eden Gardens, Kolkata from February 16. \"The matter relating to the hosting of the three T20 international matches between India and West Indies were discussed threadbare,\" CAB said in a statement. \"It was informed to the members that the CAB has requested the BCCI to allow spectators at the venue. Feedback from the BCCI is awaited. CAB is still hopeful of a positive outcome,\" it added. The Apex Council Meeting of CAB also approved the decision that the floodlight system of the Eden Gardens needs renovation and the LED system needs to be installed at the earliest with DMX facility. Moreover, fixtures and tournament rules for the upcoming league tournaments for both first and second divisions were approved by the members and it was decided that fixtures may be released immediately. \"Registration window for the players has been extended till 28 February 2022 keeping in mind the current relaxations accorded by the State Government so that it's easier for the clubs, units as well as the players to come and complete their registration formalities,\" CAB said. The Apex council congratulated U19 World Cup-winning Indian team members Avishek Porel and especially Ravi Kumar for his exceptional bowling performance.","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"AUS vs SL T20 Head to Head Record | Australia vs Sri Lanka T20I Stats | Sydney T20I","link":"https://thesportsrush.com/cricket-news-aus-vs-sl-t20-head-to-head-record-australia-vs-sri-lanka-t20i-stats-sydney-t20i/","keywords":["Cricket","Australia","Sri Lanka","Sri Lanka tour of Australia"],"creator":["Dixit Bhargav"],"video_url":null,"description":"AUS vs SL T20 Head to Head Record: The SportsRush presents for you the Head to Head statistics for the first AUS vs SL T20I. Australia and Sri Lanka are all set to lock horns in a five-match T20I series down under from tomorrow. It will be after more than two years that these two… The post AUS vs SL T20 Head to Head Record | Australia vs Sri Lanka T20I Stats | Sydney T20I appeared first on The SportsRush.","content":"AUS vs SL T20 Head to Head Record: The SportsRush presents for you the Head to Head statistics for the first AUS vs SL T20I. Australia and Sri Lanka are all set to lock horns in a five-match T20I series down under from tomorrow. It will be after more than two years that these two nations will play a bilateral T20I against each other. Sydney Cricket Ground, which had hosted the fourth Ashes 2021-22 Test match last month, will be hosting a T20I after more than 14 months. Australia, who have played nine T20Is at this venue between 2007-2020, have won five and lost three. Sri Lanka, who have played 19 ODIs and a Test in Sydney over the years, will be playing their first-ever T20I here. While Australia have a slender lead to flaunt in T20I head-to-head record against Sri Lanka, the visitors would be gaining confidence from the fact that they have a better head-to-head record in Australia. However, apart from the strength of their current world champion squad, Australia also have an advantage in the form of not losing a T20I against Sri Lanka in the last half-a-decade. Series predictions? #AUSvSL pic.twitter.com/wkVEJTQJ10 — Cricket Australia (@CricketAus) February 10, 2022 AUS vs SL T20 Head to Head Record Total number of matches played: 17 Matches won by AUS: 9 Matches won by SL: 8 Matches played in Australia: 9 (AUS 4, SL 5) Matches played in Sri Lanka: 4 (AUS 2, SL 2) Most runs for AUS: 286 (Glenn Maxwell) Most runs for SL: 117 (Dinesh Chandimal) Most wickets for AUS: 16 (Adam Zampa) Most wickets for SL: 4 (Dasun Shanaka) Most catches for AUS: 6 (Steven Smith) Most catches for SL: NA The last Australia vs Sri Lanka T20I was played during the ICC T20 World Cup 2021 at the Dubai International Cricket Stadium. Australia spinner Adam Zampa, their T20I highest wicket-taker against Sri Lanka, had registered match-winning bowling figures of 4-0-12-2 which reduced the opposition to 154/6 in 20 overs. ALSO READ: When and where to watch Australia vs Sri Lanka Sydney T20I? Australia batter David Warner’s 19th T20I half-century was enough to power his team to a 7-wicket victory in the 17 overs. The post AUS vs SL T20 Head to Head Record | Australia vs Sri Lanka T20I Stats | Sydney T20I appeared first on The SportsRush.","pubDate":"2022-02-10 12:58:54","full_description":null,"image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Australia vs Sri Lanka 1st T20I Live Telecast Channel in India and Australia: When and where to watch AUS vs SL Sydney T20I?","link":"https://thesportsrush.com/cricket-news-australia-vs-sri-lanka-1st-t20i-live-telecast-channel-in-india-and-australia-when-and-where-to-watch-aus-vs-sl-sydney-t20i/","keywords":["Cricket","Australia","Sri Lanka","Sri Lanka tour of Australia"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Australia vs Sri Lanka 1st T20I Live Telecast Channel: The SportsRush presents before you the timing and live streaming details of first AUS vs SL T20I. The first T20I of the ongoing Sri Lanka’s tour of Australia will be played at the Sydney Cricket Ground tomorrow. In what will be the first men’s white-ball international… The post Australia vs Sri Lanka 1st T20I Live Telecast Channel in India and Australia: When and where to watch AUS vs SL Sydney T20I? appeared first on The SportsRush.","content":"Australia vs Sri Lanka 1st T20I Live Telecast Channel: The SportsRush presents before you the timing and live streaming details of first AUS vs SL T20I. The first T20I of the ongoing Sri Lanka’s tour of Australia will be played at the Sydney Cricket Ground tomorrow. In what will be the first men’s white-ball international match of this Australian summer, defending champions Australia will be playing for the first time since lifting their maiden T20 title last year in the UAE. Readers must note that Australia and Sri Lanka will be playing a bilateral T20I series for the seventh time. Despite having an edge over Australia in this format on the back of a 4-2 series score, it is worth mentioning that Sri Lanka’s last T20I victory against Australia had come almost half-a-decade ago. As far as the respective Playing XIs are concerned, Australia have announced theirs on the eve of the match handing a debut to batter Josh Inglis. While Sri Lanka refrained from revealing their exact combination, batter Kusal Mendis will be unavailable after testing positive for COVID-19. Australia vs Sri Lanka 1st T20I Live Telecast Channel in India and Australia Sony Sports Network, which has been televising international cricket in India for sometime now, will be broadcasting Sri Lanka’s tour of Australia 2022 as well. Unlike matches featuring the Indian cricket team or the Ashes, Australia vs Sri Lanka T20Is will only be available in English commentary on Sony SIX in India. For fans who prefer to stream live cricket, they can log in to Sony’s streaming application named Sony LIV. It is worth mentioning that fans no longer have the option of watching the match on Airtel Xstream app as Sony Network’s channels are no longer available on this platform. Lock your Friday plans as Sri Lanka’s tour of Australia starts tomorrow! AUS v SL, 5 T20s. 1:40 PM SONY SIX#T20 #SriLanka #Australia #Cricket pic.twitter.com/8ABfdkONot — Sony Sports Network (@SonySportsNetwk) February 10, 2022 Much like the Indian fans, Sri Lankan fans will also be able to follow this series via Sony Sports Network. Exact channel, however, might differ. As far as the local fans in Australia are concerned, they will be able to watch Sydney T20I on Foxtel and Kayo Sports. Date – 11/02/2022 (Friday). Match start Time – 01:40 PM (India) and 07:10 PM (Australia). TV Channel – Sony SIX (India), Fox Cricket (Australia) and Sony Sports Network (Sri Lanka). Online platform – Sony LIV (India, Pakistan, Sri Lanka, Bangladesh, Nepal, Afghanistan, Bhutan and Mauritius) and Kayo Sports (Australia). The post Australia vs Sri Lanka 1st T20I Live Telecast Channel in India and Australia: When and where to watch AUS vs SL Sydney T20I? appeared first on The SportsRush.","pubDate":"2022-02-10 12:20:37","full_description":null,"image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Aaron Finch backs Andrew McDonald to be named Australia's next full-time men's coach - Wide World of Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMifGh0dHBzOi8vd3dvcy5uaW5lLmNvbS5hdS9jcmlja2V0L2Fhcm9uLWZpbmNoLWJhY2tzLWFuZHJldy1tY2RvbmFsZC1jb2FjaGluZy1jcmVkZW50aWFscy8xMTI5Yzc1NS1iNmQzLTQ1NDUtODk0ZC1iMjM2ODVhYzc5ODbSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Aaron Finch backs Andrew McDonald to be named Australia's next full-time men's coach  Wide World of SportsAnother perfect delivery from Cummins, but this is what he was really saying  Sydney Morning Herald‘Players love him’: Big rally for ‘next-gen’ coach who could replace Langer  Fox SportsPat Cummins stands tall amid mess of Justin Langer's axing by Cricket Australia  Wide World of Sports'Primal screaming': The ex-player mafia avenges Justin Langer  The RoarView Full coverage on Google News","content":null,"pubDate":"2022-02-10 11:09:35","image_url":null,"source_id":"google","country":["australia"],"category":["sports"],"language":"english"},{"title":"MUL vs PES Dream11 Team Prediction, Fantasy Cricket Hints: Captain, Probable Playing 11s, Team News; Injury Updates For Today’s PSL 2022 Match No.15 at Gaddafi Stadium, Lahore, 8:00 PM IST February 10","link":"https://zeenews.india.com/cricket/mul-vs-pes-dream11-team-prediction-fantasy-cricket-hints-captain-probable-playing-11s-team-news-injury-updates-for-today-s-psl-2022-match-no-15-at-gaddafi-stadium-lahore-800-pm-ist-february-10-2435205.html","keywords":null,"creator":null,"video_url":null,"description":"Multan Sultans vs Peshawar Zalmi Dream11 Team Prediction Multans Sultan vs Peshawar Zalmi Match No. 15 - Check My Dream11 Team, Best players list of MUL vs PES, Multan Sultans Dream11 Team Player List, Peshawar Zalmi Dream11 Team Player List, Dream11 Guru Tips, Fantasy Cricket Tips Pakistan Super League 2022, Fantasy Cricket Tips, Fantasy Playing Tips.","content":null,"pubDate":"2022-02-10 11:06:00","full_description":null,"image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"Finch's ringing endorsement of Langer successor","link":"https://wwos.nine.com.au/cricket/aaron-finch-backs-andrew-mcdonald-coaching-credentials/1129c755-b6d3-4545-894d-b23685ac7986","keywords":null,"creator":["wwos"],"video_url":null,"description":"Aaron Finch has thrown his weight behind the man who is seen as the favourite to be Australia's next coach.","content":"Australia's limited overs captain Aaron Finch has backed interim coach Andrew McDonald to become Justin Langer's full-time successor, saying the former all-rounder has the respect of the playing group.McDonald assumed a larger role within Australia's locker room in the lead-up to the team's maiden T20 World Cup win last year, with Langer taking a back seat.In the wake of Langer's exit after almost four years at the helm, McDonald has been widely expected to be named Australia's next full-time coach.LIVE UPDATES: Russian teen practices despite drug test controversyMcDonald's calm approach is a stark contrast to Langer's style and is seen to be much more player-friendly.\"He brings a lot of respect from the players,\" Finch said of McDonald's credentials.\"He has a calm approach. He's someone who never seems to get flustered by any situation or result. It's all about the process and making sure that your attention to detail and your preparation and your planning is 100 per cent.READ MORE: Suns sweating on Ben King's scans after knee injuryREAD MORE: Tuivasa's new idea to put the 'shoey' to shame\"He brings a really good attitude around the group. He's been with the team for quite a while now. It's exciting times.\"Finch was a teammate of McDonald's during the latter's playing career, with the pair sharing the Victorian locker room together, before McDonald coached the Aussie skipper at state level and for the Melbourne Renegades in the BBL.Despite backing McDonald, Finch made sure to pay tribute to the job Langer had done since taking over as coach in 2018, one he labelled \"amazing\".\"As a playing group we couldn't thank him enough and I know personally, the amount of work he's done for me as a batter, as a person, as a leader has been fantastic,\" he said.Finch touched on a meeting he had with then-Test captain Tim Paine and current Test skipper Pat Cummins back in August regarding Langer's intense coaching style.\"We sat down in August and talked through all of that about things to improve and gave our feedback,\" Finch said.\"That was as much conversation that I've really had about it all. Like Pat said yesterday, it's not our decision to be made but we gave all our feedback along the way and we've got to move on from all that now and start with the Australian cricket team hopefully winning this series.\"Finch and Australia's T20 side will be in action for the first time since it's World Cup triumph when it faces Sri Lanka in Game 1 of a five-match series at the SCG on Friday.For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here!","pubDate":"2022-02-10 11:05:47","full_description":"Australia's limited overs captain Aaron Finch has backed interim coach Andrew McDonald to become Justin Langer 's full-time successor, saying the former all-rounder has the respect of the playing group. McDonald assumed a larger role within Australia's locker room in the lead-up to the team's maiden T20 World Cup win last year, with Langer taking a back seat . In the wake of Langer's exit after almost four years at the helm , McDonald has been widely expected to be named Australia's next full-time coach. LIVE UPDATES: Russian teen practices despite drug test controversy McDonald's calm approach is a stark contrast to Langer's style and is seen to be much more player-friendly. \"He brings a lot of respect from the players,\" Finch said of McDonald's credentials. \"He has a calm approach. He's someone who never seems to get flustered by any situation or result. It's all about the process and making sure that your attention to detail and your preparation and your planning is 100 per cent. READ MORE: Suns sweating on Ben King's scans after knee injury READ MORE: Tuivasa's new idea to put the 'shoey' to shame \"He brings a really good attitude around the group. He's been with the team for quite a while now. It's exciting times.\" Finch was a teammate of McDonald's during the latter's playing career, with the pair sharing the Victorian locker room together, before McDonald coached the Aussie skipper at state level and for the Melbourne Renegades in the BBL. Despite backing McDonald, Finch made sure to pay tribute to the job Langer had done since taking over as coach in 2018, one he labelled \"amazing\". \"As a playing group we couldn't thank him enough and I know personally, the amount of work he's done for me as a batter, as a person, as a leader has been fantastic,\" he said. Finch touched on a meeting he had with then-Test captain Tim Paine and current Test skipper Pat Cummins back in August regarding Langer's intense coaching style. \"We sat down in August and talked through all of that about things to improve and gave our feedback,\" Finch said. \"That was as much conversation that I've really had about it all. Like Pat said yesterday, it's not our decision to be made but we gave all our feedback along the way and we've got to move on from all that now and start with the Australian cricket team hopefully winning this series.\" Finch and Australia's T20 side will be in action for the first time since it's World Cup triumph when it faces Sri Lanka in Game 1 of a five-match series at the SCG on Friday. For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here!","image_url":"https://vms-network-images-prod.s3-ap-southeast-2.amazonaws.com/2022/02/410589/pickerimage.jpg","source_id":"nine","country":["australia"],"category":["sports"],"language":"english"},{"title":"IPL 2022: Spinners who will make heads turn in IPL 2022","link":"https://www.indiatvnews.com/sports/cricket/ipl-auction-2022-top-five-spinners-who-can-earn-big-money-in-bidding-on-february-12-and-13-2022-02-10-758983","keywords":null,"creator":null,"video_url":null,"description":"It wouldn't be wrong to say that the Indian Premier League (IPL) auction is as exciting as the tournament itself. Since 2008, when the IPL made its debut, the auction has given the game of cricket some most exciting and interesting stories. From young and inexperienced players becoming millionaires to big names going unsold, the last 14 auctions have seen it all.","content":null,"pubDate":"2022-02-10 11:05:32","full_description":"It wouldn't be wrong to say that the Indian Premier League ( ) auction is as exciting as the tournament itself. Since 2008, when the IPL made its debut, the auction has given the game of cricket some most exciting and interesting stories. From young and inexperienced players becoming millionaires to big names going unsold, the last 14 auctions have seen it all. Over the years, spinners have been instrumental to the success of various IPL teams. Spinners sometimes have a bigger role to play in the IPL than the pacers.The IPL 2022 mega auction is just around the corner and all the 10 franchises are gearing up to choose players from a group of 590 players (370 Indian, 220 overseas). As far as the tournament is concerned, it is likely to start in the fourth week of March. Age: 31 Base Price: Rs 2 crore Teams: Mumbai Indians (2011-13), Royal Challengers Bangalore (2014-21) Yuzvendra Chahal was released by RCB ahead of the IPL 2022 mega auction. He took the most wickets for the franchise till the time he was with them. Chahal is known to be one of the smartest and bravest leggy around. Last year, he played for RCB in two different phases where during the first leg, he was taken up for cleaners while in the second leg in Dubai, he came back much stronger to pick 18 wickets from the 15 matches that he played at an economy of 7.05. Now that he has been released, the other teams would look to bottle him up in the auction. RCB would also want to get their star spinner back in their red army. The veteran off-spinner was released by Delhi Capitals ahead of the mega auction. There are reports that he might join his favourite side Chennai but nothing is fixed as yet. Many teams would chase him because of the experience that he has got and the variations that he applies as per the nature of the pitch. He had an ordinary season for DC last year where he could get only 7 wickets from 13 matches at an economic rate of 7.41. The spin master might also end up leading a particular franchise. The Australian leg-spinner has played IPL in the past for RCB. He also played for Rising Pune Supergiants when the franchise existed. Leggies have a high demand in shorter formats of the game, so in this year's auction, Zampa will be a key player to keep an eye on. He opted out of the last year's tournament and didn't play even a single game. In 2020 edition, he didn't get regular chances to play, so he could get only 2 wickets from 3 matches at an economic rate of 8.36. He is one of the reputed names amongst the overseas spinners who have enrolled themselves in the auction. This year's IPL can be a defining season for Kuldeep Yadav for his cricketing career. He has been neglected for last two seasons, where he was allowed to play a total no. of 6 matches. He could grab just a single wicket in those matches. Kuldeep was recently recalled back into the Indian ODI team after the failure of Ashwin and Chahal in South Africa. He was at the peak of his bowling form between 2017-2019. There is a golden chance that he might do well in the upcoming auction with franchises looking for good Indian spinners. In 2018 IPL auction, Washington Sundar was purchased by the Royal Challengers Bangalore (RCB) for Rs. 3.2 Crore despite being just 19 at the time. Since then, he has grown from strength to strength as a cricketer and it won't' be a surprise if he earns a lot more at the upcoming auction. Sundar is a right-handed off-spinner who has the ability to bowl tight lines in the right areas and he just loves to open the bowling for his team. His team can bank upon him as a lower-order batting option also after he has proved his value with the willow. Last year, he could play only the first half of the tournament where he took 3 wickets from 6 matches at an economy of 7.37. In this year's auction, teams would hunt for this young and smart bowler. Apart from these top picks for the spin options in this year's IPL auction, there are some potential spinners also who can be picked as an alternatives by the franchises or maybe as the second choice bowler for their side on turning tracks. - Mujeeb-Ur-Rahman - Jayant Yadav - - - Wanindu Hasaranga - Adil Rashid - Rahul Chahar - - Mohammad Nabi - Shahbaz Ahmed","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"Someone else took credit for decisions I took in Australia: Ajinkya Rahane","link":"https://www.tribuneindia.com/news/sports/someone-else-took-credit-for-decisions-i-took-in-australia-ajinkya-rahane-368710","keywords":null,"creator":null,"video_url":null,"description":"New Delhi, February 10 He was a central figure in India's epic turnaround during the 2020-21 tour of Australia but stand-in captain of that series Ajinkya Rahane says \"someone else took the credit\" for decisions he made to resurrect the team after the nightmarish 36 all out in the Adelaide Test. As regular captain Virat Kohli flew out of Australia, leaving in his wake the disappointment of the humiliating loss in the opener at Adelaide, Rahane took over the reins in the most difficult of circumstances. What followed was one of the most incredible turnarounds seen in Test history as India rebounded to win the second match at the Melbourne Cricket Ground by eight wickets, with Rahane leading the fightback with a magnificent hundred. \"I know what I've done there. I don't need to tell anyone. That's not my nature to go and take credit. Yes, there were some things that I took the decisions on the field or in the dressing room but someone else took the credit for it,\" Rahane said in an episode of 'Backstage With Boria'. \"(What was) important for me was that we won the series. That was a historical series and for me, that was really special.\" Rahane did not take any names but his comments could well be a veiled attack on the then head coach Ravi Shastri, who was widely acclaimed for the team's performance and dominated the media space for being the architect of the turnaround given that the dressing room resembled a hospital ward at one point. In fact, Shastri became the voice of the team after those brilliant victories. Rahane earned plaudits from the cricket fraternity for the manner in which he led the heavily depleted team in one of the most difficult situations, not just at the MCG but through the remainder of the four-match series. India missed three frontline players at MCG, and continued to lose key players through the series to injuries but still emerged triumphant at the end of it all. \"After that, the reactions from people or those who took credit or what was said on the media, 'I did this' or 'This was my decision', or 'This was my call', it was for them to talk about,\" Rahane said. \"From my end, I knew what decisions I took on the field and what decisions I took on my instincts. \"Yes, we talked with the management too but I used to laugh about it, that is what I did on the field, I never talk much about myself or praise myself. But what I did there, I knew.\" However, Rahane suffered a prolonged slump after leading India to that historic series win in Australia, and it continued on the tour of South Africa. Last year, he played 13 Tests and managed only 479 runs at an average of 20.82. He scored two 50s and some crucial 40s, but lacked consistency overall. His shot selection came under the scanner too, leading to the senior batter being stripped of vice-captaincy last December. In South Africa, he made 136 runs from six innings at a below-par average of 22.67. But he remains unruffled by the criticism that has followed his run of poor scores. \"I just smile at it. People who generally know the sport will not talk like that. I don't want to get too deep into that. Everyone knows it, you know it, what happened in Australia,\" he said. \"Even after and before Australia, the contributions I made, especially in red-ball cricket, I don't want to talk about it but Australia was really. As I said, people who know the sport, love the sport they'll talk sensibly,\" he said. He has full faith in his ability and remains confident about rediscovering his touch. \"Yes, I am confident about my own ability, I am batting really well and I believe in my ability. And I still believe I have good cricket left in me,\" Rahane said.","content":null,"pubDate":"2022-02-10 09:32:10","full_description":"PTI New Delhi, February 10 He was a central figure in India’s epic turnaround during the 2020-21 tour of Australia but stand-in captain of that series Ajinkya Rahane says \"someone else took the credit\" for decisions he made to resurrect the team after the nightmarish 36 all out in the Adelaide Test. As regular captain Virat Kohli flew out of Australia, leaving in his wake the disappointment of the humiliating loss in the opener at Adelaide, Rahane took over the reins in the most difficult of circumstances. What followed was one of the most incredible turnarounds seen in Test history as India rebounded to win the second match at the Melbourne Cricket Ground by eight wickets, with Rahane leading the fightback with a magnificent hundred. \"I know what I've done there. I don't need to tell anyone. That's not my nature to go and take credit. Yes, there were some things that I took the decisions on the field or in the dressing room but someone else took the credit for it,\" Rahane said in an episode of 'Backstage With Boria'. \"(What was) important for me was that we won the series. That was a historical series and for me, that was really special.\" Rahane did not take any names but his comments could well be a veiled attack on the then head coach Ravi Shastri, who was widely acclaimed for the team's performance and dominated the media space for being the architect of the turnaround given that the dressing room resembled a hospital ward at one point. In fact, Shastri became the voice of the team after those brilliant victories. Rahane earned plaudits from the cricket fraternity for the manner in which he led the heavily depleted team in one of the most difficult situations, not just at the MCG but through the remainder of the four-match series. India missed three frontline players at MCG, and continued to lose key players through the series to injuries but still emerged triumphant at the end of it all. \"After that, the reactions from people or those who took credit or what was said on the media, 'I did this' or 'This was my decision', or 'This was my call', it was for them to talk about,\" Rahane said. \"From my end, I knew what decisions I took on the field and what decisions I took on my instincts. \"Yes, we talked with the management too but I used to laugh about it, that is what I did on the field, I never talk much about myself or praise myself. But what I did there, I knew.\" However, Rahane suffered a prolonged slump after leading India to that historic series win in Australia, and it continued on the tour of South Africa. Last year, he played 13 Tests and managed only 479 runs at an average of 20.82. He scored two 50s and some crucial 40s, but lacked consistency overall. His shot selection came under the scanner too, leading to the senior batter being stripped of vice-captaincy last December. In South Africa, he made 136 runs from six innings at a below-par average of 22.67. But he remains unruffled by the criticism that has followed his run of poor scores. \"I just smile at it. People who generally know the sport will not talk like that. I don't want to get too deep into that. Everyone knows it, you know it, what happened in Australia,\" he said. \"Even after and before Australia, the contributions I made, especially in red-ball cricket, I don't want to talk about it but Australia was really. As I said, people who know the sport, love the sport they'll talk sensibly,\" he said. He has full faith in his ability and remains confident about rediscovering his touch. \"Yes, I am confident about my own ability, I am batting really well and I believe in my ability. And I still believe I have good cricket left in me,\" Rahane said.","image_url":"https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/2/2022_2$largeimg_1836412479.jpg","source_id":"tribuneindia","country":["india"],"category":["sports"],"language":"english"},{"title":"India vs West Indies 3rd ODI: India Predicted XI - Time For Rohit Sharma To Try Different Options - NDTVSports.com","link":"https://news.google.com/__i/rss/rd/articles/CBMikgFodHRwczovL3Nwb3J0cy5uZHR2LmNvbS9pbmRpYS12cy13ZXN0LWluZGllcy0yMDIyL2luZGlhLXByZWRpY3RlZC14aS0zcmQtb2RpLXZzLXdlc3QtaW5kaWVzLXRpbWUtZm9yLXJvaGl0LXNoYXJtYS10by10cnktZGlmZmVyZW50LW9wdGlvbnMtMjc2MDQxM9IBmAFodHRwczovL3Nwb3J0cy5uZHR2LmNvbS9pbmRpYS12cy13ZXN0LWluZGllcy0yMDIyL2luZGlhLXByZWRpY3RlZC14aS0zcmQtb2RpLXZzLXdlc3QtaW5kaWVzLXRpbWUtZm9yLXJvaGl0LXNoYXJtYS10by10cnktZGlmZmVyZW50LW9wdGlvbnMtMjc2MDQxMy9hbXAvMQ?oc=5","keywords":null,"creator":null,"video_url":null,"description":"India vs West Indies 3rd ODI: India Predicted XI - Time For Rohit Sharma To Try Different Options  NDTVSports.comRecent Match Report - India vs West Indies 2nd ODI 2021/22  ESPNcricinfo2nd ODI: Prasidh Krishna stars as India take unbeatable series lead against West Indies  Times of IndiaKrishna takes four as India claim series win over Windies  ReutersIND vs WI Live Streaming Details, India vs West Indies 2022- When and Where To Watch India vs West Indies, India vs West Indies 2022, 3rd ODI  Cricket AddictorView Full coverage on Google News","content":null,"pubDate":"2022-02-10 09:20:16","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Captains united in need for coaching change","link":"https://www.news.com.au/sport/cricket/captains-united-in-need-for-coaching-change/video/928e27797dc53b09342519d13a2970e3","keywords":null,"creator":null,"video_url":null,"description":"Cricket: Australia T20 captain Aaron Finch stands united with Pat Cummins over Justin Langer saga.","content":null,"pubDate":"2022-02-10 08:52:09","full_description":null,"image_url":null,"source_id":"news","country":["australia"],"category":["sports"],"language":"english"},{"title":"IPL auction 2022: 8 top Indian players who were not retained | Cricket News - Times of India","link":"https://news.google.com/__i/rss/rd/articles/CBMilwFodHRwczovL3RpbWVzb2ZpbmRpYS5pbmRpYXRpbWVzLmNvbS9zcG9ydHMvY3JpY2tldC9pcGwvdG9wLXN0b3JpZXMvaXBsLWF1Y3Rpb24tMjAyMi04LXRvcC1pbmRpYW4tcGxheWVycy13aG8td2VyZS1ub3QtcmV0YWluZWQvYXJ0aWNsZXNob3cvODk0NzQ1MjcuY21z0gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"IPL auction 2022: 8 top Indian players who were not retained | Cricket News  Times of IndiaRunorder: Who will be the most expensive player in the 2022 IPL auction?  ESPNcricinfoIPL 2022 Auction: The potential big overseas targets | Cricbuzz.com - Cricbuzz  CricbuzzIPL Auction 2022: Washington Sundar, Ishan Kishan, Tim David & more – high potential long-term picks  Scroll.inLIVE IPL 2022 Auction News Updates, Feb 10: CSA, ECB Give NOC For Full Season  India.comView Full coverage on Google News","content":null,"pubDate":"2022-02-10 08:27:00","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Will Pucovski makes half-century on comeback","link":"https://www.news.com.au/sport/cricket/will-pucovski-makes-halfcentury-on-comeback/video/b3884b2c8bfaa465fcdf7aeb620da574","keywords":null,"creator":null,"video_url":null,"description":"Cricket: Will Pucovski was back in the runs on Test return before being dismissed for 54.","content":null,"pubDate":"2022-02-10 08:16:09","full_description":null,"image_url":null,"source_id":"news","country":["australia"],"category":["sports"],"language":"english"},{"title":"Mike Hussey reveals what would have hurt former Australian cricket coach Justin Langer most in saga","link":"https://thewest.com.au/sport/cricket/mike-hussey-reveals-what-would-have-hurt-former-australian-cricket-coach-justin-langer-most-in-saga--c-5646644","keywords":null,"creator":["Samantha Rogers"],"video_url":null,"description":"Test great Mike Hussey says the ‘disloyalty’ and ‘backstabbing’ at the end of Justin Langer’s tenure as Australian cricket coach is what would have hurt his former teammate the most.","content":null,"pubDate":"2022-02-10 07:39:13","full_description":null,"image_url":"https://images.thewest.com.au/publication/C-5646644/598641e92eccaa5135a7639e6c31f10a1153a009-16x9-x0y134w2362h1329.jpg","source_id":"thewest","country":["australia"],"category":["sports"],"language":"english"},{"title":"Top End tour plans add to club v country headache","link":"https://www.theage.com.au/sport/cricket/top-end-tour-plans-add-to-club-v-country-headache-20220210-p59ver.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Andrew Wu"],"video_url":null,"description":"A mooted white-ball series against Zimbabwe in the Top End this year is threatening to pose more club versus country dilemmas for Cricket Australia, as the country’s leading Test stars were ruled out of the start of the lucrative IPL.","content":null,"pubDate":"2022-02-10 07:36:33","full_description":"A mooted white-ball series against Zimbabwe in the Top End later this year is threatening to pose more club versus country dilemmas for Cricket Australia, as the country’s leading Test stars were ruled out of the start of the Indian Premier League just days before the lucrative mega auction. The Age and Sydney Morning Herald can reveal plans are being drawn up for Australia to host their first men’s international in Darwin in 14 years in August. Should the games go ahead, they would clash with England’s fledgling league The Hundred, which is likely to be on the radar of the nation’s best limited-overs players. Pat Cummins and Steve Smith are among a host of players to withdraw from Australia’s tour of the West Indies. Credit: AP Agents were recently notified of the possible addition to Australia’s 2022 international schedule, which has implications for whether players sign up to The Hundred draft. But there is talk among industry sources Australia may not field a full-strength team against a nation placed 14th and 11th on the one-day international and T20 rankings respectively. It is unclear in which white-ball format the matches would be, but they effectively replace the postponed three-game ODI series between the nations originally scheduled for August 2020. The national men’s team last played in Darwin in 2008 when an ODI side led by Michael Clarke defeated Bangladesh 3-0. “If the northern Australian winter tour was to proceed we’d love to work with Cricket Australia on the merits of Darwin being considered as a host venue,” Northern Territory Cricket chief Joel Morrison said. “We’re in a waiting game to see what will happen.” The games would add to an already busy off-season for Australia’s players, who have tours to Pakistan in March and April, and Sri Lanka in June and July either side of the IPL. Test stars Pat Cummins, David Warner, Steve Smith and Josh Hazlewood will all be unavailable for the start of the IPL, tipped to begin on March 27, even if they are rested from the white-ball leg of the Pakistan tour. CA is not clearing any players required for those games to travel to India until April 6, a day after the final match, while those involved in the Sheffield Shield final can leave on April 4. “We do see the IPL as a really good development opportunity when it fits, but there’s obviously a huge amount of cricket with a series [in Sri Lanka] planned for immediately post the IPL as well,” selection chair George Bailey said this week. “So it will be about working with the individuals to ensure they’re getting the preparation they need, but we certainly won’t be releasing players to the IPL while Australia are playing.” There are 47 Australian players who will go under the hammer at the IPL mega auction in Bengaluru this weekend. With two new franchises and an extra $940,000 in the purse for each team, the two-day extravaganza is shaping as a windfall for the world’s best white-ball players. Glenn Maxwell is the only Australian player to be retained by his franchise, kept by the glamorous but underachieving Royal Challengers Bangalore for $2 million. He has been granted leave from the Pakistan tour for his wedding, which has been postponed several times due to COVID. Pat Cummins fetched a whopping $3.17 million in the 2019 auction but there are also riches on offer for up-and -comers, as seen by the price tags for Jhye Richardson ($2.48 million) and Riley Meredith ($1.42 million) last year when there was a premium placed on express-paced international fast bowlers . Cummins and David Warner are among a list of 10 “marquee” players up for sale on Saturday who have slapped a reserve of about $377,000 on themselves. Though released by Sunrisers Hyderabad amid mysterious circumstances last year, Warner is expected to be one of the most keenly sought after players in an auction that will shape the lists of teams for the years to come. The opener rebounded from his lean IPL with a stunning run in the T20 World Cup in which he was voted player of the tournament in Australia’s triumphant campaign. All-rounder Mitchell Marsh is another Australian likely to attract interest from numerous sides after hot form for club and country last year. Ricky Ponting (Delhi Capitals) and Tom Moody (Sunrisers Hyderabad) are the only two Australian head coaches this year, with Simon Katich and Trevor Bayliss both leaving their posts. News, results and expert analysis from the weekend of sport sent every Monday. Sign up for our Sport newsletter .","image_url":null,"source_id":"theage","country":["australia"],"category":["sports"],"language":"english"},{"title":"Top End tour plans add to club v country headache","link":"https://www.smh.com.au/sport/cricket/top-end-tour-plans-add-to-club-v-country-headache-20220210-p59ver.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Andrew Wu"],"video_url":null,"description":"A mooted white-ball series against Zimbabwe in the Top End this year is threatening to pose more club versus country dilemmas for Cricket Australia, as the country’s leading Test stars were ruled out of the start of the lucrative IPL.","content":null,"pubDate":"2022-02-10 07:36:33","full_description":"A mooted white-ball series against Zimbabwe in the Top End later this year is threatening to pose more club versus country dilemmas for Cricket Australia, as the country’s leading Test stars were ruled out of the start of the Indian Premier League just days before the lucrative mega auction. The Age and Sydney Morning Herald can reveal plans are being drawn up for Australia to host their first men’s international in Darwin in 14 years in August. Should the games go ahead, they would clash with England’s fledgling league The Hundred, which is likely to be on the radar of the nation’s best limited-overs players. Pat Cummins and Steve Smith are among a host of players to withdraw from Australia’s tour of the West Indies. Credit: AP Agents were recently notified of the possible addition to Australia’s 2022 international schedule, which has implications for whether players sign up to The Hundred draft. But there is talk among industry sources Australia may not field a full-strength team against a nation placed 14th and 11th on the one-day international and T20 rankings respectively. It is unclear in which white-ball format the matches would be, but they effectively replace the postponed three-game ODI series between the nations originally scheduled for August 2020. The national men’s team last played in Darwin in 2008 when an ODI side led by Michael Clarke defeated Bangladesh 3-0. “If the northern Australian winter tour was to proceed we’d love to work with Cricket Australia on the merits of Darwin being considered as a host venue,” Northern Territory Cricket chief Joel Morrison said. “We’re in a waiting game to see what will happen.” The games would add to an already busy off-season for Australia’s players, who have tours to Pakistan in March and April, and Sri Lanka in June and July either side of the IPL. Test stars Pat Cummins, David Warner, Steve Smith and Josh Hazlewood will all be unavailable for the start of the IPL, tipped to begin on March 27, even if they are rested from the white-ball leg of the Pakistan tour. CA is not clearing any players required for those games to travel to India until April 6, a day after the final match, while those involved in the Sheffield Shield final can leave on April 4. “We do see the IPL as a really good development opportunity when it fits, but there’s obviously a huge amount of cricket with a series [in Sri Lanka] planned for immediately post the IPL as well,” selection chair George Bailey said this week. “So it will be about working with the individuals to ensure they’re getting the preparation they need, but we certainly won’t be releasing players to the IPL while Australia are playing.” There are 47 Australian players who will go under the hammer at the IPL mega auction in Bengaluru this weekend. With two new franchises and an extra $940,000 in the purse for each team, the two-day extravaganza is shaping as a windfall for the world’s best white-ball players. Glenn Maxwell is the only Australian player to be retained by his franchise, kept by the glamorous but underachieving Royal Challengers Bangalore for $2 million. He has been granted leave from the Pakistan tour for his wedding, which has been postponed several times due to COVID. Pat Cummins fetched a whopping $3.17 million in the 2019 auction but there are also riches on offer for up-and -comers, as seen by the price tags for Jhye Richardson ($2.48 million) and Riley Meredith ($1.42 million) last year when there was a premium placed on express-paced international fast bowlers . Cummins and David Warner are among a list of 10 “marquee” players up for sale on Saturday who have slapped a reserve of about $377,000 on themselves. Though released by Sunrisers Hyderabad amid mysterious circumstances last year, Warner is expected to be one of the most keenly sought after players in an auction that will shape the lists of teams for the years to come. The opener rebounded from his lean IPL with a stunning run in the T20 World Cup in which he was voted player of the tournament in Australia’s triumphant campaign. All-rounder Mitchell Marsh is another Australian likely to attract interest from numerous sides after hot form for club and country last year. Ricky Ponting (Delhi Capitals) and Tom Moody (Sunrisers Hyderabad) are the only two Australian head coaches this year, with Simon Katich and Trevor Bayliss both leaving their posts. News, results and expert analysis from the weekend of sport sent every Monday. Sign up for our Sport newsletter .","image_url":null,"source_id":"smh","country":["australia"],"category":["sports"],"language":"english"},{"title":"ACT vs DRX Dream11 Prediction: Fantasy Cricket Tips, Today's Playing 11 and Pitch Report for ECL T10, Play-off 1","link":"https://www.sportskeeda.com/fantasy-cricket-mantra/act-vs-drx-dream11-prediction-fantasy-cricket-tips-today-s-playing-11-pitch-report-ecl-t10-play-off-1?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Fantasy Cricket Mantra"],"creator":["Anjishnu Roy"],"video_url":null,"description":null,"content":null,"pubDate":"2022-02-10 07:34:48","full_description":"The Austrian Cricket Tigers will take on Dreux in the first play-off of the European Cricket League (ECL) T10 at the Cartama Oval in Spain on Thursday. The Austrian Cricket Tigers have had a great ECL campaign so far. They won four out of their five group stage matches and finished atop the standings. Meanwhile, Dreux won three of their five league matches and finished third. The Austrian Cricket Tigers have already beaten Dreux once this season. ACT XI Ahsan Yousuf (C), Balwinder Singh, Imran Asif, Aqib Iqbal, Mirza Ahsan, Umair Tariq, Sahel Zadran, Ahmad Chaudhry (wk), Adal Afzal, Azhar Mehmood, Tauqir Asif DRX XI Hamza Niaz, Ahmad Nabi, Mohammad Nisar, Tabish Bhatti (C), Kamran Ahmadzai, Mohammad Chowdhury, Wahid Abdul, Mohammad Shahzeb, Ammar Zahir (wk), Alexandre Harkouk, Afridi Yaseen ACT vs DRX, European Cricket League (ECL) T10 2022, Play-off 1 Date and Time: 10th February, 2022, 1:30 PM IST Venue: Cartama Oval, Spain As seen in previous games, the track at the Cartama Oval seems to favor the batters, with high scores being common on this ground. 120 could prove to be the par score at the venue and the side winning the toss should ideally opt to bat first. Wicketkeeper U Tariq is a valuable wicketkeeper-batter choice for your Dream11 fantasy team. He was in top form in the previous match, picking up three wickets. Batters A Nabi has amassed 193 runs in the ECL thus far and is expected to play a big knock today. A Yousuf has scored 60 runs and picked up four wickets in the tournament. He could be a valuable multiplier choice for your Dream11 fantasy team. All-rounders I Asif is a fantastic all-rounder who can single-handedly change the course of a match. He has scored 78 runs in addition to taking five wickets in the ECL. Asif could be a valuable captaincy choice for your ACT vs DRX Dream11 fantasy team. A Iqbal has been consistent, scoring 72 runs and picking up three wickets from five ECL games so far. Bowler A Yaseen has scalped seven wickets so far and is expected to add to his tally today. A Nabi (DRX) – 347 points U Tariq (ACT) – 343 points I Asif (ACT) – 300 points A Yousuf (ACT) – 287 points A Yaseen (DRX) – 281 points A Nabi: 193 runs U Tariq: 13 runs and 11 wickets I Asif: 78 runs and 5 wickets A Yousuf: 60 runs and 4 wickets A Yaseen: 7 wickets Fantasy Suggestion #1: U Tariq, A Nabi, A Yousuf, H Niaz, I Asif, M Nisar, A Iqbal, T Bhatti, A Yaseen, S Zadran, S Mohammad Captain: A Nabi. Vice-captain: U Tariq. Fantasy Suggestion #2: U Tariq, A Nabi, A Yousuf, H Niaz, M Ahsan, I Asif, M Nisar, A Iqbal, A Yaseen, S Zadran, S Mohammad Captain: I Asif. Vice-captain: A Yousuf.","image_url":"https://static.sportskeeda.com/editor/2022/02/25c49-16444733679926-1920.jpg","source_id":"sportskeeda","country":["india"],"category":["sports"],"language":"english"},{"title":"ARC-W vs TOC-W Dream11 Prediction: Fantasy Cricket Tips, Today's Playing 11 and Pitch Report for Bengal Women’s T20 Blast, Match 8","link":"https://www.sportskeeda.com/fantasy-cricket-mantra/arc-w-vs-toc-w-dream11-prediction-fantasy-cricket-tips-today-s-playing-11-pitch-report-bengal-women-s-t20-blast-match-8?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Fantasy Cricket Mantra"],"creator":["Anjishnu Roy"],"video_url":null,"description":null,"content":null,"pubDate":"2022-02-10 07:34:48","full_description":"Aryan Club Women (ARC-W) will take on Town Club Women (TOC-W) in the eighth match of the Bengal Women’s T20 Blast at the Bengal Cricket Academy Ground in Kalyani on Thursday. Aryan Club Women have had a terrible start to their Bengal Women’s T20 Blast campaign, losing two in two. They suffered heavy losses against East Bengal Club Women and Kalighat Club Women and will be desperate to get off the mark today. Town Club Women, meanwhile, have won one of their two Bengal Women’s T20 Blast games so far. They will head into today's contest on the back of an eight-wicket loss at the hands of Rajasthan Club Women. ARC-W XI Hrishita Nidaldri Basu, Ritika Pal, Prativa Rana, Shahida Khatun, Jhumia Khatun, Chandrima Ghosal, Pragati Prasad, Komal Jaiswal, VR Vanitha, Sasthi Mondal, Megha Ghosh TOC-W XI Sukanya Parida(c), Sneha Gupta, Parna Paul(wk), Srilekha Roy, Sagarika Sengupta, Priti Choudhary, Rupal Tiwari, Rukmoni Roy, Monika Mal, Kashish Agarwal, Ankita Barman ARC-W vs TOC-W, Bengal Women’s T20 Blast, Match 8 Date and Time: 10th February, 2022, 1:00 PM IST Venue: Bengal Cricket Academy Ground, Kalyani The track at the Bengal Cricket Academy Ground in Kalyani generally favors the bowlers. The batters need to spend some time in the middle before shifting gears. A score of around 120 could be par at the venue. Wicketkeeper H Basu could prove to be a decent wicketkeeper-batter choice for your Dream11 fantasy team. She has scored 23 runs so far and is safe behind the stumps as well. Batters A Barman looked in good touch against Rajasthan Women, scoring 32 vital runs. She is a crucial top order batter for Town Club Women. V Vanitha, who has amassed 24 runs in the Bengal Women’s T20 Blast thus far, can play a big knock today. All-rounders J Khatun has scored 43 runs and picked up four wickets in the Bengal Women’s T20 Blast. She could be an excellent multiplier choice for your ARC-W vs TOC-W Dream11 fantasy team. M Ghosh is another player you must have on your fantasy team. Although she’s yet to make his mark with the bat, Ghosh has already scalped three wickets in the tournament. Bowler M Mal has consistently bowled in the right areas, picking up four wickets in the process. J Khatun (ARC-W) – 191 points M Mal (TOC-W) – 156 points A Barman (TOC-W) – 111 points S Parida (TOC-W) – 105 points M Ghosh (ARC-W) – 104 points J Khatun: 43 runs and 4 wickets M Mal: 4 wickets A Barman: 62 runs and 1 wicket S Parida: 3 wickets M Ghosh: 3 wickets Fantasy Suggestion #1: H Niladri Basu, P Paul, A Barman, V Vanitha, S Sengupta, J Khatun, M Ghosh, S Gupta, M Mal, S Parida, K Sutradhar Captain: J Khatun. Vice-captain: M Mal. Fantasy Suggestion #2: H Niladri Basu, A Barman, V Vanitha, S Sengupta, J Khatun, M Ghosh, S Gupta, M Mal, S Parida, K Sutradhar, R Roy Captain: A Barman. Vice-captain: M Ghosh.","image_url":"https://static.sportskeeda.com/editor/2022/02/d33af-16444717131591-1920.jpg","source_id":"sportskeeda","country":["india"],"category":["sports"],"language":"english"},{"title":"“I just smile when people says my career is finished”: Ajinkya Rahane opens up on public comments about his career","link":"https://thesportsrush.com/cricket-news-i-just-smile-when-people-says-my-career-is-finished-ajinkya-rahane-opens-up-on-public-comments-about-his-career/","keywords":["Cricket","Ajinkya Rahane","backstage with boria"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"Ajinkya Rahane has said that he is still confident on his skills, and he has also talked about the captaincy credits in the Australia series. In January 2021, when India defeated Australia, Ajinkya Rahane was the cult hero. There were demands of making him the new test captain of India. Now in February 2022, he… The post “I just smile when people says my career is finished”: Ajinkya Rahane opens up on public comments about his career appeared first on The SportsRush.","content":"Ajinkya Rahane has said that he is still confident on his skills, and he has also talked about the captaincy credits in the Australia series. In January 2021, when India defeated Australia, Ajinkya Rahane was the cult hero. There were demands of making him the new test captain of India. Now in February 2022, he is struggling to find his name in the Indian squad. After an iconic century at the MCG, he has not scored a single century till now. He failed on the England tour, whereas the home series against New Zealand also was not great. Although, Rahane has not batted poorly, but he has been unlucky at times. On the South African tour, he was dropped as the vice-captain of the Indian team. He played a good knock in the first test game, but overall the tour was not great for him. Ajinkya Rahane still confident about his skills On the program, Backstage with Boria, Rahane said that there is a lot of cricket left in him. He said that he is confident in his ability and can make a comeback. “I just smile when people says my career is finished and people who know the Sport don’t talk like that,” Rahane said. “People and everyone knows my contribution in red ball Cricket and people who love the Sport will talk sensibly.” “I am confident with my ability, I am batting well and I still believe I have good cricket left with me”. One year back he was feted by all for doing wonders in Aus as captain. Now people want him out of the team. How is @ajinkyarahane88 dealing with it? Most imp does he believe he has cricket left in him? How imp is Ranji Trophy? In a tell all Ajinkya on #BackstageWithBoria today. — Boria Majumdar (@BoriaMajumdar) February 10, 2022 Ajinkya Rahane also made a controversial comment during the interview. He said that someone else took the credits for his decisions in Australia. In Australia, India lost the first game in Adelaide by a huge margin under Virat, but they managed to win the series. Ajinkya captained India in the rest of the games. He said that he was focused to win the series. “I know what I’ve done in the Australia series and that’s not my nature to go out there and take credits,” Rahane added. “Yes, there were few decisions that I had taken, but someone else took the credit. Important was for me to win the series”. Ajinkya Rahane can represent Mumbai in the Ranji Trophy as there are reports emerging that he won’t be picked in the Indian for the Sri Lanka test series. The post “I just smile when people says my career is finished”: Ajinkya Rahane opens up on public comments about his career appeared first on The SportsRush.","pubDate":"2022-02-10 07:29:41","full_description":null,"image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Returning star back in the runs","link":"https://www.news.com.au/sport/cricket/sheffield-shield-scott-boland-turns-heat-on-test-teammates-travis-head-and-alex-carey/news-story/3675af212516bf48fbc121e9f6ab57a0","keywords":null,"creator":null,"video_url":null,"description":"Will Pucovski survived being struck in the arm early and then peppered with short stuff on his return to first class cricket to score a comeback half-century in a display of his Test class.","content":null,"pubDate":"2022-02-10 06:34:00","full_description":"Will Pucovski survived being struck in the arm early and then peppered with short stuff on his return to first class cricket to score a comeback half-century in a display of his Test class. The 24-year-old had shoulder surgery after his Test debut last January and then suffered a concussion in October which derailed a summer during which he was forced to watch Australia’s Ashes win from the sidelines. He was given the option to bat anywhere for Victoria as he took to the crease against South Australia on Thursday but chose to open and feasted in favourable batting conditions at the Adelaide Oval. After putting on a 1oo-run stand with Test opener Marcus Harris, Pucovski was dismissed for 54, adjudged caught behind although he seemed unconvinced he hit it as the Redback bowlers tried a short assault on the flat pitch. It was however, a positive return after 12 months of setbacks and the comfort of batting with Harris can’t be understated for Pucovski. The four innings they have opened together have yielded 866 runs for Victoria, including the Shield record score of 486, also put on in Adelaide, in 2020. Victorian coach Chris Rogers was adamant Pucovski would have no trouble picking up where he left off despite such a long time away form the elite level. “He’s such a gifted player, it’s not like he needs a huge amount of time in the middle to prepare, he tends to find some rhythm pretty quickly,” he said. Harris missed out on what loomed as a big score when he was caught on the boundary, playing a hefty pull shot, when he was on 58. But looked untroubled ahead of a Test tour of Pakistan and Rogers said the left-hander had learnt a lot from his Ashes experience, which included being dropped foe the final Test against England. Will Pucovski and Marcus Harris opening the batting together. Partnerships of: 486, 186, 84, 103* #vicsdoitbetter #SheffieldShield pic.twitter.com/wFjKoQTngE “He’s batting as well as ever,” he said. “I reckon he learned a bit more again in this last series, just how much attention to detail you have to have about getting your game in order, which it absolutely looks like it is at the moment. “I am watching him now and everything he’s doing is top draw.” The Victorian partnership came after Redbacks batsman Daniel Drew completed his maiden first-class century, the second for his team in the match, to help the home team in to a powerful position. Resuming on 96 overnight, Drew was tied down early before eventually reaching three figures. He was eventually out for 130 as a late-order push helped the redbacks reach 366. New Test star Scott Boland failed to add to his day one haul of four wickets with youngster Mitch Perry taking three of the five wickets to fall on day two to end with 4-58. DAY ONE - Ashes hero turns heat on Test teammates Scott Boland inflicted his bowling superpowers on Aussie Test teammates Travis Head and Alex Carey on Wednesday in a devastating return to red-ball cricket for the Ashes cult hero. The South Australians had the contest on their own terms thanks to the batting of Jake Weatherald (122) and Daniel Drew (96 not out), but Boland almost single-handedly kept Victoria in the game heading into day two of the clash at Adelaide Oval. According to his coach Chris Rogers, Boland was “desperate to play” in Victoria’s first Sheffield Shield match of the year. He certainly bowled like it. Watch The Dettol T20 Series Australia vs. Sri Lanka. Every Game Live & On-Demand on Kayo. New to Kayo? Start your free trial now > After sending down an opening maiden, Boland, who bowled first change for Australia in the Ashes and took an astonishing 18 wickets in his first three Tests, returned with fire in his second spell. Both Boland and Head were playing their first red-ball matches since Australia’s Ashes triumph and the South Australian skipper was just as pumped to be back as his Victorian rival – Head sacrificed his chance to play in the first three T20Is against Sri Lanka to get some red ball practice in before Australia’s tour of Pakistan. But Boland was determined to make sure Head got as little time in the middle as possible – he trapped Jake Carder LBW and gave the Ashes Man Of The Series the same treatment two balls later. Head made a mockery of the English bowling attack in the Ashes but on Wednesday he walked off the pitch with zero runs to his name, the second Redback to fall victim to Boland’s wrath. If any speculation remained that Boland would struggle to live up to the hype, he firmly dispelled it after the tea break. He weaponised the new ball to send Weatherald, South Australia’s man of the hour, packing. On 122, he was caught at short cover by Marcus Harris, who is set to join Head, Carey and Boland on the flight to the Subcontinent despite a lukewarm Ashes campaign. Boland then did away with another Test player in Carey, bowling him cleanly and finishing the day with scintillating figures of 4-41. The man nicknamed “Barrel” did not get enough help from his teammates – who took one wicket between them – so Victoria will need to come out firing on day two to keep in touch with the contest. At stumps, South Australia was 5-280. Weatherald said it was a relief to have recovered from Boland’s brutal start and posted his eighth first class century. “We dealt with some pretty hard stuff out there, obviously facing one of the best bowlers on the planet right now,” he said at stumps. “We would have rather had some less wickets earlier in the day, that would have really helped us, but it shows the depth of your batting order comes down to being able to recover. “It shows that there’s some really good depth there now, that we can kick on and still make 400, potentially, after losing two of the best players in the country batting-wise in ‘Heady’ and ‘Cez’ for relatively low scores. It’s good.” Prior to the day‘s play, Rogers predicted Boland would use the lessons learned at Test level on his return to Shield cricket. “Now he’s a Test star, you wonder how that lifts his teammates, but also it will affect the opposition as well, knowing they are coming up against a world class bowler,” Rogers said. “He’s one of those senior players who is never quite satisfied with how things are going; it’s always about getting better, he will do the extra one percenters to find ways to improve. “The fact he went in (to Test cricket) and did so well straight away is a surprise in terms of how well he did, but not a surprise he did well. “You can’t put a value on having someone like him setting the standards.” Josh Inglis missed out on making his debut for Australia at the T20 World Cup and in the Ashes, but his wait is about to come to an end. Pat Cummins not only addressed unfair criticism with humility, but spoke with more maturity than the Aussie greats who rebuked him. Test captain Pat Cummins made it clear that players want a new coach who is different to Justin Langer and have identified him.","image_url":null,"source_id":"news","country":["australia"],"category":["sports"],"language":"english"},{"title":"That was something very flattering, Prasidh on captain's high praise","link":"https://www.tribuneindia.com/news/sports/that-was-something-very-flattering-prasidh-on-captains-high-praise-368692","keywords":null,"creator":null,"video_url":null,"description":"Ahmedabad, February 10The high praise from his skipper Rohit Sharma was \"very flattering\", pacer Prasidh Krishna said after emerging as the star performer with his excellent bowling in India's 44-run win over the West Indies in the second ODI here.The lanky Karnataka man set up India's series-clinching victory in the three-match rubber, leaving his captain highly impressed.\"That was something very flattering for me because he (Rohit) has been playing cricket for lot of time. Coming from him, I am very happy,\" Prasidh said at the post-match press conference on Wednesday.Rohit was awestruck by the sensational spell of Prasidh, who was adjudged the Player of the Match for his four wickets for just 12 runs in nine overs, which included three maidens.\"I have never seen a spell like that in India for a long time now. Bowled with a lot of pace and kept it going,\" Rohit had said at the presentation ceremony.The bowler said that he has been striving to get consistent and was pleased that his efforts have paid off.\"Personally, like I said, I have been putting in the yards and trying to do this for quite some time now, so I am glad it happened.\"It has been almost a year since I made my debut for India. I have been striving to get more consistent since then,\" Prasidh said at the post-match press conference.\"I remember, when I started off, I used to get excited and had too many emotions running through.\"But over time, we have been together, practised together as a team. We have had our plans and we have been very clear on what we wanted to work on.\" India posted 237 for nine and then returned to dismiss West Indies for 193 in 46 overs to record a comfortable victory.\"Like I said we have been working on consistency as a bowling unit. We all know that we have a good set of bowlers in our team and we are helping and learning from each other, so that is about it, there is nothing special,\" he maintained.It is the 11th time in the last 17 games that the West Indies have failed to bat their full quota of 50 overs.Prasidh said that his aim was to hit good lines and lengths.\"It was pretty simple, hit good lengths, good lines and bowl in the area where it was (necessary) for batsmen to push out for runs or block it, so I tried to do my best,\" said the 25-year-old Bengaluru-born player.Suryakumar Yadav also played a crucial role in India's win, with his 64-run knock after the hosts were reeling at 43 for three following a top-order collapse.Prasidh said the Motera track was favourable for bowlers.\"It was more favourable for the bowlers. So, I think the lengths that I was getting last game in the middle overs were very similar and because there was more purchase in the wicket today (on Wednesday), it was acting different and helping my bowling as well,\" he elaborated.We did a pretty good job as a bowling unit ==========================Prasidh was effusive in his praise for his bowling colleagues, saying the hosts did a decent job as a unit.\"The initial plan was to keep it tight, put pressure on the batsmen and eventually that would get us few wickets and then on it was reacting to the situation.\"I mean, they had a pretty good start, and then we had spoken, we were keeping it tight, credit goes to everybody, it wasn't easy for the spinners to bowl with the ball coming on to the bat well, so we did a pretty good job as a bowling unit,\" he said.Breaks don't disrupt rhythm=================According to Prasidh, breaks for bowlers do not disrupt their rhythm.\"Break disrupting the rhythm I don't see anything like that, because as a bowler, as a cricketer, you would be be playing as and when you get a chance and when you are not playing, might as well get back to the drawing board, get better, and come back and play whenever you get a chance,\" he said.Surya's innings very important for us=======================Prasidh said Suryakumar's innings was very important for the team in the overall context of the game.\"The timing of it was very important because we had lost early wickets, like quick wickets and credit to West Indies bowlers as well, they were bowling good lines and lengths and there was something happening in the wicket throughout.\"So yeah, indeed Surya's inning was very important to us,\" he signed off.","content":null,"pubDate":"2022-02-10 06:32:35","full_description":"PTI Ahmedabad, February 10 The high praise from his skipper Rohit Sharma was \"very flattering\", pacer Prasidh Krishna said after emerging as the star performer with his excellent bowling in India's 44-run win over the West Indies in the second ODI here. The lanky Karnataka man set up India's series-clinching victory in the three-match rubber, leaving his captain highly impressed. \"That was something very flattering for me because he (Rohit) has been playing cricket for lot of time. Coming from him, I am very happy,\" Prasidh said at the post-match press conference on Wednesday. Rohit was awestruck by the sensational spell of Prasidh, who was adjudged the Player of the Match for his four wickets for just 12 runs in nine overs, which included three maidens. \"I have never seen a spell like that in India for a long time now. Bowled with a lot of pace and kept it going,\" Rohit had said at the presentation ceremony. The bowler said that he has been striving to get consistent and was pleased that his efforts have paid off. \"Personally, like I said, I have been putting in the yards and trying to do this for quite some time now, so I am glad it happened. \"It has been almost a year since I made my debut for India. I have been striving to get more consistent since then,\" Prasidh said at the post-match press conference. \"I remember, when I started off, I used to get excited and had too many emotions running through. \"But over time, we have been together, practised together as a team. We have had our plans and we have been very clear on what we wanted to work on.\" India posted 237 for nine and then returned to dismiss West Indies for 193 in 46 overs to record a comfortable victory. \"Like I said we have been working on consistency as a bowling unit. We all know that we have a good set of bowlers in our team and we are helping and learning from each other, so that is about it, there is nothing special,\" he maintained. It is the 11th time in the last 17 games that the West Indies have failed to bat their full quota of 50 overs. Prasidh said that his aim was to hit good lines and lengths. \"It was pretty simple, hit good lengths, good lines and bowl in the area where it was (necessary) for batsmen to push out for runs or block it, so I tried to do my best,\" said the 25-year-old Bengaluru-born player. Suryakumar Yadav also played a crucial role in India's win, with his 64-run knock after the hosts were reeling at 43 for three following a top-order collapse. Prasidh said the Motera track was favourable for bowlers. \"It was more favourable for the bowlers. So, I think the lengths that I was getting last game in the middle overs were very similar and because there was more purchase in the wicket today (on Wednesday), it was acting different and helping my bowling as well,\" he elaborated. We did a pretty good job as a bowling unit ========================== Prasidh was effusive in his praise for his bowling colleagues, saying the hosts did a decent job as a unit. \"The initial plan was to keep it tight, put pressure on the batsmen and eventually that would get us few wickets and then on it was reacting to the situation. \"I mean, they had a pretty good start, and then we had spoken, we were keeping it tight, credit goes to everybody, it wasn't easy for the spinners to bowl with the ball coming on to the bat well, so we did a pretty good job as a bowling unit,\" he said. Breaks don't disrupt rhythm ================= According to Prasidh, breaks for bowlers do not disrupt their rhythm. \"Break disrupting the rhythm I don't see anything like that, because as a bowler, as a cricketer, you would be be playing as and when you get a chance and when you are not playing, might as well get back to the drawing board, get better, and come back and play whenever you get a chance,\" he said. Surya's innings very important for us ======================= Prasidh said Suryakumar's innings was very important for the team in the overall context of the game. \"The timing of it was very important because we had lost early wickets, like quick wickets and credit to West Indies bowlers as well, they were bowling good lines and lengths and there was something happening in the wicket throughout. \"So yeah, indeed Surya's inning was very important to us,\" he signed off. #Cricket #RohitSharma","image_url":"https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/2/2022_2$largeimg_1777950885.JPG","source_id":"tribuneindia","country":["india"],"category":["sports"],"language":"english"},{"title":"LIVE IPL 2022 Mega Auction News Updates, Feb 10: Australian Players May Miss First Part of T20 League - India.com","link":"https://news.google.com/__i/rss/rd/articles/CBMi6gFodHRwczovL3d3dy5pbmRpYS5jb20vc3BvcnRzL2lwbC0yMDIyLW1lZ2EtYXVjdGlvbi1uZXdzLWxpdmUtdXBkYXRlcy10b2RheS1mZWItMTAtdGltZS1kYXRlLXNxdWFkcy1pcGwtbGl2ZS10YXRhLWlwbC1hdWN0aW9uLXN0cmVhbS1saXN0LXBsYXllcnMtYmFzZS1wcmljZS1wdXJzZS10aXRhbnMtbHNnLXJjYi1taS1jc2sta2tyLXNyaC1yci1wYmtzLWRjLWl5ZXItZGhvbmktcm9oaXQta29obGktNTIzMjM4Ny_SAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"LIVE IPL 2022 Mega Auction News Updates, Feb 10: Australian Players May Miss First Part of T20 League  India.comIPL 2022 Auction: The potential big overseas targets | Cricbuzz.com - Cricbuzz  CricbuzzIPL 2022 Auctions: Top 5 All-rounders Franchises Will Be After at the Mega Event  News18IPL Auction 2022 Date, Time, Lucknow, Ahmedabad, Players List With Base Price, Live Channel And Live Streaming  Cricket AddictorIPL Auction CSK Team 2022 Players List: Chennai Super Kings likely to go big on Du Plessis, Chahar, Bravo and Shardul  The Indian ExpressView Full coverage on Google News","content":null,"pubDate":"2022-02-10 06:26:46","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"}]}