{"newsArray":[{"article_id":"32a9dec3985d59bcd6f839fad2639639","title":"'Dripping with sweat': Extreme heat threatens to throw season into chaos","link":"https://www.canberratimes.com.au/story/8454188/cricket-act-extreme-heat-policy-adopted-in-sweltering-conditions/?src=rss","keywords":null,"creator":["Cameron Mee"],"video_url":null,"description":"Cricketers battled stifling conditions on Saturday afternoon.","content":"Club cricketers across the region are bracing for a summer of extreme heat after playing through sweltering conditions on Saturday. Umpires and captains adopted the Cricket ACT heat policy as temperatures soared into the mid-30s. Start times were shifted earlier, additional drinks breaks were held and a priority was placed on hydration and player safety in the stifling conditions. Wests captain Scott Murn it was a challenging afternoon as his side battled the elements in Saturday's win over Ginninderra . \"It was certainly sapping,\" he said. \"It was a lot more humid than we thought it was going to be. You could see the fast bowlers in particular, it was hard work. Even the batters, anyone who batted any length of time was dripping with sweat. \"It's good when we do get a physical challenge, cricket shouldn't be easy.\" As tough as the conditions were, players across the territory felt like they dodged a bullet on Saturday. The mercury only reached 34.6 degrees, 2.4 degrees below the forecast high of 37. Despite this, the situation provided a physical and mental challenge for both batters and bowlers as heat exhaustion and dehydration made playing cricket incredibly tough. Wests' Lachlan Malcolm attempts to cool down in Saturday's heat. Picture by Keegan Carroll Cricket ACT officials were closely monitoring the situation throughout the week and on Saturday and chief executive Olivia Thornton said player safety will always remain a priority. \"It's really important we do take care of our people and an element of common sense prevails,\" she said. \"We're massive advocates for broad-brim hats, long sleeves, sunscreen and staying hydrated. \"We hope people do the right thing from a sun safety perspective.\" While Saturday was bad, there are fears things could get even worse in the new year. With El Nino already declared and long-range forecasts predicting a hot, dry summer, players are bracing for a sweltering January. The long-term implications could be dire, with some experts suggesting the cricket season may need to be shifted away from summer if climate change continues to trigger higher temperatures. It's a tough ask for the lower grades, but many aspirational first grade players are embracing the challenge. Test and first-class cricket have a long history of being played in sweltering conditions and Murn said those with representative hopes are using the heat as an opportunity to send a message to selectors. \"I wouldn't be surprised if we have some very hot days in the second half of the season,\" Murn said. \"Playing two-day cricket, it's a really tough grind for the team that ends up in the field all day. \"That being said, it's a good preparation for guys who want to play a higher level of cricket. Guys who stand out and prove they've got the fitness levels that allow them to perform in all conditions.\" Cricket ACT round 13 Wests 8-230 bt Ginninderra 9-170 (DLS) Queanbeyan 6-134 bt ANU 8-1185 (DLS) Tuggeranong 6-181 bt Weston Creek Molonglo 5-180 Eastlake v North Canberra Gungahlin Abandoned Share Facebook Twitter Whatsapp Email Copy Cameron Mee Sports Journalist Sports reporter at the Canberra Times Sports reporter at the Canberra Times More from Latest News 'Time for renewal': Queensland premier Palaszczuk quits 7m ago 'Dripping with sweat': Extreme heat threatens to throw season into chaos 14m ago No comment s Queensland premier Palaszczuk quits 19m ago Murder probe after woman collapses, dies near home fire 24m ago More from Latest News 'Time for renewal': Queensland premier Palaszczuk quits 7m ago 'Dripping with sweat': Extreme heat threatens to throw season into chaos 14m ago No comment s Queensland premier Palaszczuk quits 19m ago Murder probe after woman collapses, dies near home fire 24m ago US storms and tornadoes leave at least six dead 50m ago Man injured in targeted Melbourne CBD shooting 1hr ago More from Latest News 'Time for renewal': Queensland premier Palaszczuk quits 7m ago 'Dripping with sweat': Extreme heat threatens to throw season into chaos 14m ago No comment s Queensland premier Palaszczuk quits 19m ago Murder probe after woman collapses, dies near home fire 24m ago US storms and tornadoes leave at least six dead 50m ago Man injured in targeted Melbourne CBD shooting 1hr ago","pubDate":"2023-12-10 03:29:00","image_url":"https://www.canberratimes.com.au/images/transform/v1/crop/frm/GzY3iczng7SLWqVgHSV78t/c428b1b6-e5c9-410f-87fc-10a6c46948a7.jpg/r0_133_2587_1590_w600_h338_fmax.jpg","source_id":"canberratimes","source_priority":88737,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"f1d06d77190bb219b37956501c4947cf","title":"Cricket-Forde, Carty power Windies to series victory over England","link":"https://www.thestar.com.my/sport/cricket/2023/12/10/cricket-forde-carty-power-windies-to-series-victory-over-england","keywords":null,"creator":null,"video_url":null,"description":"(Reuters) - Keacy Carty hit a half-century and Matthew Forde took three wickets as West Indies claimed a four-wicket win in the rain-affected third one-day international on Saturday to clinch their first home ODI series victory over England since 1998. Read full story","content":"(Reuters) - Keacy Carty hit a half-century and Matthew Forde took three wickets as West Indies claimed a four-wicket win in the rain-affected third one-day international on Saturday to clinch their first home ODI series victory over England since 1998. Chasing a Duckworth-Lewis (DLS) par score of 188 in 34 overs, Carty (50) combined with Alick Athanaze (45) for a 76-run partnership, before Romario Shepherd hit 41 to help the West Indies get over the finish line with 14 balls to spare. Earlier on Saturday, Forde (3-29) took the wickets of top-order batters Phil Salt, Will Jacks and Zak Crawley to leave England on 45-3 in an excellent spell on his ODI debut. England's innings was rescued by Ben Duckett, whose knock of 71 came off 73 balls, while Liam Livingstone was able to shrug off his recent struggles with the bat to contribute 45 runs as the visitors posted a total of 206 in 40 overs at the Kensington Oval in Barbados. The two sides will face each other in a five-match Twenty20 series, with the first game of the series being played at the same venue on Tuesday. (Reporting by Aadi Nair in Bengaluru; Editing by Shri Navaratnam)","pubDate":"2023-12-10 03:29:00","image_url":null,"source_id":"thestar_my","source_priority":37088,"country":["malaysia"],"category":["sports"],"language":"english"},{"article_id":"605a6f4c5b7018bb3bb0ee748ab350a4","title":"West Indies vs England: Debutant Matthew Forde fires Windies to first ODI series win since 2007","link":"https://www.firstpost.com/firstcricket/sports-news/west-indies-vs-england-debutant-matthew-forde-fires-windies-to-first-odi-series-win-since-2007-13485822.html","keywords":["First Cricket News"],"creator":["Ujwal Singh"],"video_url":null,"description":"West Indies vs England: Debutant Matthew Forde fires Windies to first ODI series win since 2007","content":"Cricket West Indies vs England: Debutant Matthew Forde fires Windies to first ODI series win since 2007 Matthew Forde's all-round heroics propelled West Indies to their first ODI series triumph over England for 16 years and their first at home against these opponents for 25 years. Agence France-Presse December 10, 2023 08:54:42 IST This is West Indies' first ODI series win over England at home in the last 25 years. Image: WICB A dream debut by Matthew Forde helped guide the West Indies to a series-clinching four-wicket win over England in the decisive third and final match of their One-Day International series at Kensington Oval in Barbados on Saturday. In a rain-affected encounter, the 21-year-old Barbadian delighted the few home supporters among a majority English audience with figures of three for 29 as the tourists were restricted to 206 for nine off 40 overs after being put in. Then, with the West Indies stuttering at 135 for six in pursuit of a revised target of 188 off 34 overs, Forde (13 not out) joined Romario Shepherd (41 not out) in an unbroken seventh-wicket stand of 56 to take the Caribbean team to their first ODI series triumph over England for 16 years and their first at home against these opponents for 25 years. Related Articles West Indies vs England: Shai Hope guides Windies to four-wicket win in 1st ODI West Indies vs England: Redemption for Sam Curran as England level series “This is a dream come true,” said an overwhelmed Forde, who was named Man of the Match, in reflecting on his contribution. “The wicket was a bit tacky so it was just about bowling the right line and length. And when I came in to bat, it was just about turning over the strike and getting Sheppy on strike as often as possible.” Brought into the team in place of Oshane Thomas and given use of the new ball, the hometown boy claimed wickets in his first two overs and added a third in his fifth to put England immediately on the back foot. Ben Duckett offered the only substantial resistance with a pugnacious innings of 71, getting meaningful support from Liam Livingstone (45) in a stand of 88 for the sixth wicket after they had slumped to 49 for five in the tenth over. Forde removed Phil Salt to a low catch at mid-off and then had Zak Crawley taken at second slip. He added the wicket of the other opener, Phil Jacks, two overs later via a wicketkeeper’s catch. Jacks was almost the unlikely hero for England with the ball, taking three wickets for 22 runs, including topscorer Keacy Carty for 50, to seem to tilt the balance of the match in his side’s favour. A few short However Jacks and the other slow bowling options Rehan Ahmed and Liam Livingstone could not separate the pair of Shepherd and Forde and when 24 runs were smashed off returning seamer Gus Atkinson in the 30th over, the result was effectively sealed. “We were a few short with the bat,” said England captain Jos Buttler in reflecting on the loss. “We fought hard with the ball but it just wasn’t enough. This is the start of a long journey for this side. Hopefully we can build something for the future.” For West Indies captain Shai Hope, who took the Man of the Series award with a tally of 192 runs at an average of 96 across the three matches, both the result and the contributions of younger players were encouraging. “It’s great to see these other guys chipping in with the bat and as long as we continue in this vein it can develop into a very good batting group,” he said. Join our Whatsapp channel to get the latest global news updates Published on: December 10, 2023 08:54:42 IST Tags: West Indies Vs England","pubDate":"2023-12-10 03:24:42","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/12/West-Indies-vs-England.jpg","source_id":"firstpost","source_priority":5906,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"c833ada2c8c3dfac4c8f6378d0aa435d","title":"India vs South Africa 1st T20I Live Streaming, Venue, Date, Match Timings","link":"https://news.abplive.com/sports/cricket/ind-vs-sa-1st-t20i-live-streaming-telecast-venue-durban-date-match-timings-1648944","keywords":["Cricket"],"creator":["ABP News Bureau"],"video_url":null,"description":"<p><strong>India vs South Africa 1st T20I</strong> <strong>live streaming, venue, match timings, date:</strong> Sunday's blockbuster India vs South Africa 1st T20I in Kingsmead, Durban promises to be an exciting contest.&nbsp;</p> <p><strong>Here's everything you need to know about India vs South Africa 1st T20I 2023 live streaming, date, match timings, venue</strong></p> <p><strong>When will India vs South Africa 1st T20I match be played?</strong></p> <p>India vs South Africa 1st T20I match will take place on Sunday (December 10).</p> <p><strong>Where will India vs South Africa 1st T20I match be played?</strong></p> <p>India vs South Africa 1st T20I match will be played at the Kingsmead, Durban, South Africa.</p> <p><strong>What time will India vs South Africa 1st T20I match start?</strong></p> <p>India vs South Africa 1st T20I match will start at 07:30 PM IST.</p> <p><strong>How to watch India vs South Africa 1st T20I Free Live Streaming on Mobile APP, TV and Laptop?</strong></p> <p>Live telecast of India vs South Africa 1st T20I match in India will be available on Star Sports channels.</p> <p><strong>How to watch Free Live Streaming of India vs South Africa 1st T20I match online?</strong></p> <p><strong>India vs South Africa 1st T20I Live Streaming:</strong> India vs South Africa 1st T20I Free Live Streaming will be available on Disney+ Hotstar app and website.&nbsp;</p>","content":"India vs South Africa 1st T20I live streaming, venue, match timings, date: Sunday's blockbuster India vs South Africa 1st T20I in Kingsmead, Durban promises to be an exciting contest. Following a successful 4-1 series triumph against Australia at home, the Indian men's cricket team, led by Suryakumar Yadav, is set to embark on a high-octane three-match IND vs SA T20I series, commencing this Sunday (December 10). Star players like Shreyas Iyer and Shubman Gill have made comeback to the national team for India vs South Africa T20I series, following a much-needed break. The focus will be on the likes of Yashasvi Jaiswal, Rinku Singh and Ravi Bishnoi. South Africa, on the other hand, dealt with a massive blow as their premier pacer Lungi Ngidi suffered an injury, resulting in him being ruled out for the entire IND vs SA series. The Proteas batters have been in super form lately and will aim to continue the momentum vs India. Here's everything you need to know about India vs South Africa 1st T20I 2023 live streaming, date, match timings, venue When will India vs South Africa 1st T20I match be played? googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); India vs South Africa 1st T20I match will take place on Sunday (December 10). Where will India vs South Africa 1st T20I match be played? India vs South Africa 1st T20I match will be played at the Kingsmead, Durban, South Africa. What time will India vs South Africa 1st T20I match start? India vs South Africa 1st T20I match will start at 07:30 PM IST. How to watch India vs South Africa 1st T20I Free Live Streaming on Mobile APP, TV and Laptop? Live telecast of India vs South Africa 1st T20I match in India will be available on Star Sports channels. How to watch Free Live Streaming of India vs South Africa 1st T20I match online? India vs South Africa 1st T20I Live Streaming: India vs South Africa 1st T20I Free Live Streaming will be available on Disney+ Hotstar app and website.","pubDate":"2023-12-10 03:22:25","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/12/10/92acb0baf4167ea036ff9cd3e0ec5158170217851603224_original.jpg","source_id":"abplive","source_priority":10959,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"6d645bbb38d6c8a69060dbf52b34410b","title":"IND vs SA: ਭਾਰਤ- ਦੱਖਣੀ ਅਫਰੀਕਾ ਵਿਚਾਲੇ ਪਹਿਲਾ ਟੀ-20 ਮੁਕਾਬਲਾ ਅੱਜ, ਜਾਣੋ ਕਿੱਥੇ ਅਤੇ ਕਿਵੇਂ ਵੇਖੋ ਸਕੋਗੇ ਭਿੜਤ ?","link":"https://punjabi.abplive.com/sports/cricket/india-south-africa-1st-t20-match-timing-pitch-report-know-details-763651","keywords":["ਕ੍ਰਿਕਟ"],"creator":["ABP Sanjha"],"video_url":null,"description":"<p><strong>IND vs SA Pitch Report:</strong> ਅੱਜ ਭਾਰਤ ਅਤੇ ਦੱਖਣੀ ਅਫਰੀਕਾ ਵਿਚਾਲੇ 3 ਟੀ-20 ਮੈਚਾਂ ਦੀ ਸੀਰੀਜ਼ ਦਾ ਪਹਿਲਾ ਮੈਚ ਖੇਡਿਆ ਜਾਵੇਗਾ। ਦੋਵੇਂ ਟੀਮਾਂ ਡਰਬਨ ਦੇ ਮੈਦਾਨ 'ਤੇ ਆਹਮੋ-ਸਾਹਮਣੇ ਹੋਣਗੀਆਂ। ਇਹ ਮੈਚ ਭਾਰਤੀ ਸਮੇਂ ਅਨੁਸਾਰ ਸ਼ਾਮ 7.30 ਵਜੇ ਸ਼ੁਰੂ ਹੋਵੇਗਾ। ਭਾਰਤੀ ਟੀਮ ਦੀ ਕਪਤਾਨੀ ਸੂਰਿਆਕੁਮਾਰ ਯਾਦਵ ਕਰਨਗੇ ਜਦਕਿ ਦੱਖਣੀ ਅਫ਼ਰੀਕੀ ਟੀਮ ਦੀ ਅਗਵਾਈ ਏਡੇਨ ਮਾਰਕਰਮ ਕਰਨਗੇ। ਫਿਲਹਾਲ, ਡਰਬਨ ਦੀ ਵਿਕਟ ਕਿਵੇਂ ਹੋਵੇਗੀ? ਕੀ ਇਸ ਵਿਕਟ 'ਤੇ ਬੱਲੇਬਾਜ਼ ਆਸਾਨੀ ਨਾਲ ਦੌੜਾਂ ਬਣਾ ਸਕਣਗੇ ਜਾਂ ਗੇਂਦਬਾਜ਼ ਚੁਣੌਤੀ ਬਣਨਗੇ?</p> <p><strong>ਕੀ ਡਰਬਨ 'ਚ ਬੱਲੇਬਾਜ਼ਾਂ ਲਈ ਗੇਂਦਬਾਜ਼ ਬਣਨਗੇ ਚੁਣੌਤੀ ?</strong></p> <p>ਦਰਅਸਲ, ਅੰਕੜੇ ਦੱਸਦੇ ਹਨ ਕਿ ਡਰਬਨ ਦੀ ਪਿੱਚ 'ਤੇ ਬੱਲੇਬਾਜ਼ ਆਸਾਨੀ ਨਾਲ ਦੌੜਾਂ ਬਣਾਉਂਦੇ ਹਨ। ਇਸ ਪਿੱਚ 'ਤੇ ਔਸਤ ਸਕੋਰ 170 ਦੌੜਾਂ ਹੈ। ਯਾਨੀ ਇੱਕ ਪਾਰੀ ਵਿੱਚ ਇੱਕ ਟੀਮ ਲਗਭਗ 170 ਦੌੜਾਂ ਬਣਾਉਂਦੀ ਹੈ। ਇਹ ਅੰਕੜੇ ਗੇਂਦਬਾਜ਼ਾਂ ਲਈ ਚੰਗੇ ਨਹੀਂ ਹਨ। ਇਸ ਤੋਂ ਇਲਾਵਾ ਟਾਸ ਜਿੱਤਣ ਵਾਲੀ ਟੀਮ ਪਹਿਲਾਂ ਫੀਲਡਿੰਗ ਕਰਨਾ ਚਾਹੇਗੀ। ਪਿਛਲੇ ਰਿਕਾਰਡਾਂ ਮੁਤਾਬਕ ਦੌੜਾਂ ਦਾ ਪਿੱਛਾ ਕਰਨਾ ਆਸਾਨ ਹੈ। ਯਾਨੀ ਟਾਸ ਜਿੱਤਣ ਵਾਲਾ ਕਪਤਾਨ ਪਹਿਲਾਂ ਗੇਂਦਬਾਜ਼ੀ ਕਰਨ ਦਾ ਫੈਸਲਾ ਕਰ ਸਕਦਾ ਹੈ। ਇਸ ਦੇ ਨਾਲ ਹੀ ਇਸ ਵਿਕਟ 'ਤੇ ਗੇਂਦਬਾਜ਼ਾਂ ਨੂੰ ਬਾਊਂਸ ਮਿਲਦਾ ਹੈ, ਜੋ ਬੱਲੇਬਾਜ਼ਾਂ ਲਈ ਚੁਣੌਤੀ ਬਣ ਸਕਦਾ ਹੈ।</p> <p><strong>ਕਦੋਂ, ਕਿੱਥੇ ਅਤੇ ਕਿਵੇਂ ਦੇਖ ਸਕਦੇ ਹੋ ਲਾਈਵ ਸਟ੍ਰੀਮਿੰਗ ਅਤੇ ਪ੍ਰਸਾਰਣ ?</strong></p> <p>ਭਾਰਤ ਅਤੇ ਦੱਖਣੀ ਅਫਰੀਕਾ ਵਿਚਾਲੇ 3 ਟੀ-20 ਮੈਚਾਂ ਦੀ ਸੀਰੀਜ਼ ਦਾ ਪਹਿਲਾ ਮੈਚ ਡਰਬਨ 'ਚ ਖੇਡਿਆ ਜਾਵੇਗਾ। ਦੋਵਾਂ ਟੀਮਾਂ ਵਿਚਾਲੇ ਮੈਚ ਭਾਰਤੀ ਸਮੇਂ ਅਨੁਸਾਰ ਸ਼ਾਮ 7.30 ਵਜੇ ਸ਼ੁਰੂ ਹੋਵੇਗਾ। ਭਾਰਤੀ ਪ੍ਰਸ਼ੰਸਕ ਸਟਾਰ ਸਪੋਰਟਸ ਨੈੱਟਵਰਕ 'ਤੇ ਲਾਈਵ ਪ੍ਰਸਾਰਣ ਦੇਖ ਸਕਣਗੇ। ਇਸ ਤੋਂ ਇਲਾਵਾ ਭਾਰਤ-ਦੱਖਣੀ ਅਫਰੀਕਾ ਸੀਰੀਜ਼ ਦੇ ਮੈਚਾਂ ਦੀ ਲਾਈਵ ਸਟ੍ਰੀਮਿੰਗ ਡਿਜ਼ਨੀ ਪਲੱਸ ਹੌਟਸਟਾਰ 'ਤੇ ਹੋਵੇਗੀ। ਭਾਵ, ਭਾਰਤੀ ਪ੍ਰਸ਼ੰਸਕ Disney Plus Hotstar 'ਤੇ ਲਾਈਵ ਸਟ੍ਰੀਮਿੰਗ ਦੇਖ ਸਕਣਗੇ। ਭਾਰਤੀ ਪ੍ਰਸ਼ੰਸਕ ਡਿਜ਼ਨੀ ਪਲੱਸ ਹੌਟਸਟਾਰ 'ਤੇ ਹਿੰਦੀ ਅਤੇ ਅੰਗਰੇਜ਼ੀ ਤੋਂ ਇਲਾਵਾ ਕਈ ਭਾਸ਼ਾਵਾਂ 'ਚ ਮੈਚ ਦਾ ਆਨੰਦ ਲੈ ਸਕਣਗੇ।</p> <p><strong>ਭਾਰਤ ਦੀ ਸੰਭਾਵਿਤ ਪਲੇਇੰਗ ਇਲੈਵਨ-</strong></p> <p>ਯਸ਼ਸਵੀ ਜੈਸਵਾਲ, ਸ਼ੁਭਮਨ ਗਿੱਲ, ਸ਼੍ਰੇਅਸ ਅਈਅਰ, ਸੂਰਿਆਕੁਮਾਰ ਯਾਦਵ (ਕਪਤਾਨ), ਰਿੰਕੂ ਸਿੰਘ, ਜਿਤੇਸ਼ ਸ਼ਰਮਾ (ਵਿਕਟਕੀਪਰ), ਰਵਿੰਦਰ ਜਡੇਜਾ, ਮੁਕੇਸ਼ ਕੁਮਾਰ, ਰਵੀ ਬਿਸ਼ਨੋਈ, ਮੁਹੰਮਦ ਸਿਰਾਜ ਅਤੇ <a title=\"ਅਰਸ਼ਦੀਪ ਸਿੰਘ\" href=\"https://punjabi.abplive.com/topic/arshdeep-singh\" data-type=\"interlinkingkeywords\">ਅਰਸ਼ਦੀਪ ਸਿੰਘ</a>।</p> <p><strong>ਦੱਖਣੀ ਅਫਰੀਕਾ ਦੇ ਸੰਭਾਵਿਤ ਪਲੇਇੰਗ ਇਲੈਵਨ-</strong></p> <p>ਰੀਜ਼ਾ ਹੈਂਡਰਿਕਸ, ਮੈਥਿਊ ਬ੍ਰੇਟਜ਼ਕੇ, ਏਡਨ ਮਾਰਕਰਮ (ਕਪਤਾਨ), ਹੇਨਰਿਕ ਕਲਾਸਨ, ਟ੍ਰਿਸਟੀਅਨ ਸਟੱਬਸ, ਡੇਵਿਡ ਮਿਲਰ, ਮਾਰਕੋ ਜੈਨਸਨ, ਗੇਰਾਲਡ ਕੋਏਟਜ਼ੀ, ਕੇਸ਼ਵ ਮਹਾਰਾਜ, ਲਿਜ਼ਾਦ ਵਿਲੀਅਮਜ਼, ਤਬਰੇਜ਼ ਸ਼ਮਸੀ</p>","content":"IND vs SA Pitch Report: ਅੱਜ ਭਾਰਤ ਅਤੇ ਦੱਖਣੀ ਅਫਰੀਕਾ ਵਿਚਾਲੇ 3 ਟੀ-20 ਮੈਚਾਂ ਦੀ ਸੀਰੀਜ਼ ਦਾ ਪਹਿਲਾ ਮੈਚ ਖੇਡਿਆ ਜਾਵੇਗਾ। ਦੋਵੇਂ ਟੀਮਾਂ ਡਰਬਨ ਦੇ ਮੈਦਾਨ 'ਤੇ ਆਹਮੋ-ਸਾਹਮਣੇ ਹੋਣਗੀਆਂ। ਇਹ ਮੈਚ ਭਾਰਤੀ ਸਮੇਂ ਅਨੁਸਾਰ ਸ਼ਾਮ 7.30 ਵਜੇ ਸ਼ੁਰੂ ਹੋਵੇਗਾ। ਭਾਰਤੀ ਟੀਮ ਦੀ ਕਪਤਾਨੀ ਸੂਰਿਆਕੁਮਾਰ ਯਾਦਵ ਕਰਨਗੇ ਜਦਕਿ ਦੱਖਣੀ ਅਫ਼ਰੀਕੀ ਟੀਮ ਦੀ ਅਗਵਾਈ ਏਡੇਨ ਮਾਰਕਰਮ ਕਰਨਗੇ। ਫਿਲਹਾਲ, ਡਰਬਨ ਦੀ ਵਿਕਟ ਕਿਵੇਂ ਹੋਵੇਗੀ? ਕੀ ਇਸ ਵਿਕਟ 'ਤੇ ਬੱਲੇਬਾਜ਼ ਆਸਾਨੀ ਨਾਲ ਦੌੜਾਂ ਬਣਾ ਸਕਣਗੇ ਜਾਂ ਗੇਂਦਬਾਜ਼ ਚੁਣੌਤੀ ਬਣਨਗੇ? ਕੀ ਡਰਬਨ 'ਚ ਬੱਲੇਬਾਜ਼ਾਂ ਲਈ ਗੇਂਦਬਾਜ਼ ਬਣਨਗੇ ਚੁਣੌਤੀ ? ਦਰਅਸਲ, ਅੰਕੜੇ ਦੱਸਦੇ ਹਨ ਕਿ ਡਰਬਨ ਦੀ ਪਿੱਚ 'ਤੇ ਬੱਲੇਬਾਜ਼ ਆਸਾਨੀ ਨਾਲ ਦੌੜਾਂ ਬਣਾਉਂਦੇ ਹਨ। ਇਸ ਪਿੱਚ 'ਤੇ ਔਸਤ ਸਕੋਰ 170 ਦੌੜਾਂ ਹੈ। ਯਾਨੀ ਇੱਕ ਪਾਰੀ ਵਿੱਚ ਇੱਕ ਟੀਮ ਲਗਭਗ 170 ਦੌੜਾਂ ਬਣਾਉਂਦੀ ਹੈ। ਇਹ ਅੰਕੜੇ ਗੇਂਦਬਾਜ਼ਾਂ ਲਈ ਚੰਗੇ ਨਹੀਂ ਹਨ। ਇਸ ਤੋਂ ਇਲਾਵਾ ਟਾਸ ਜਿੱਤਣ ਵਾਲੀ ਟੀਮ ਪਹਿਲਾਂ ਫੀਲਡਿੰਗ ਕਰਨਾ ਚਾਹੇਗੀ। ਪਿਛਲੇ ਰਿਕਾਰਡਾਂ ਮੁਤਾਬਕ ਦੌੜਾਂ ਦਾ ਪਿੱਛਾ ਕਰਨਾ ਆਸਾਨ ਹੈ। ਯਾਨੀ ਟਾਸ ਜਿੱਤਣ ਵਾਲਾ ਕਪਤਾਨ ਪਹਿਲਾਂ ਗੇਂਦਬਾਜ਼ੀ ਕਰਨ ਦਾ ਫੈਸਲਾ ਕਰ ਸਕਦਾ ਹੈ। ਇਸ ਦੇ ਨਾਲ ਹੀ ਇਸ ਵਿਕਟ 'ਤੇ ਗੇਂਦਬਾਜ਼ਾਂ ਨੂੰ ਬਾਊਂਸ ਮਿਲਦਾ ਹੈ, ਜੋ ਬੱਲੇਬਾਜ਼ਾਂ ਲਈ ਚੁਣੌਤੀ ਬਣ ਸਕਦਾ ਹੈ। ਕਦੋਂ, ਕਿੱਥੇ ਅਤੇ ਕਿਵੇਂ ਦੇਖ ਸਕਦੇ ਹੋ ਲਾਈਵ ਸਟ੍ਰੀਮਿੰਗ ਅਤੇ ਪ੍ਰਸਾਰਣ ? googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); ਭਾਰਤ ਅਤੇ ਦੱਖਣੀ ਅਫਰੀਕਾ ਵਿਚਾਲੇ 3 ਟੀ-20 ਮੈਚਾਂ ਦੀ ਸੀਰੀਜ਼ ਦਾ ਪਹਿਲਾ ਮੈਚ ਡਰਬਨ 'ਚ ਖੇਡਿਆ ਜਾਵੇਗਾ। ਦੋਵਾਂ ਟੀਮਾਂ ਵਿਚਾਲੇ ਮੈਚ ਭਾਰਤੀ ਸਮੇਂ ਅਨੁਸਾਰ ਸ਼ਾਮ 7.30 ਵਜੇ ਸ਼ੁਰੂ ਹੋਵੇਗਾ। ਭਾਰਤੀ ਪ੍ਰਸ਼ੰਸਕ ਸਟਾਰ ਸਪੋਰਟਸ ਨੈੱਟਵਰਕ 'ਤੇ ਲਾਈਵ ਪ੍ਰਸਾਰਣ ਦੇਖ ਸਕਣਗੇ। ਇਸ ਤੋਂ ਇਲਾਵਾ ਭਾਰਤ-ਦੱਖਣੀ ਅਫਰੀਕਾ ਸੀਰੀਜ਼ ਦੇ ਮੈਚਾਂ ਦੀ ਲਾਈਵ ਸਟ੍ਰੀਮਿੰਗ ਡਿਜ਼ਨੀ ਪਲੱਸ ਹੌਟਸਟਾਰ 'ਤੇ ਹੋਵੇਗੀ। ਭਾਵ, ਭਾਰਤੀ ਪ੍ਰਸ਼ੰਸਕ Disney Plus Hotstar 'ਤੇ ਲਾਈਵ ਸਟ੍ਰੀਮਿੰਗ ਦੇਖ ਸਕਣਗੇ। ਭਾਰਤੀ ਪ੍ਰਸ਼ੰਸਕ ਡਿਜ਼ਨੀ ਪਲੱਸ ਹੌਟਸਟਾਰ 'ਤੇ ਹਿੰਦੀ ਅਤੇ ਅੰਗਰੇਜ਼ੀ ਤੋਂ ਇਲਾਵਾ ਕਈ ਭਾਸ਼ਾਵਾਂ 'ਚ ਮੈਚ ਦਾ ਆਨੰਦ ਲੈ ਸਕਣਗੇ। ਭਾਰਤ ਦੀ ਸੰਭਾਵਿਤ ਪਲੇਇੰਗ ਇਲੈਵਨ- ਯਸ਼ਸਵੀ ਜੈਸਵਾਲ, ਸ਼ੁਭਮਨ ਗਿੱਲ, ਸ਼੍ਰੇਅਸ ਅਈਅਰ, ਸੂਰਿਆਕੁਮਾਰ ਯਾਦਵ (ਕਪਤਾਨ), ਰਿੰਕੂ ਸਿੰਘ, ਜਿਤੇਸ਼ ਸ਼ਰਮਾ (ਵਿਕਟਕੀਪਰ), ਰਵਿੰਦਰ ਜਡੇਜਾ, ਮੁਕੇਸ਼ ਕੁਮਾਰ, ਰਵੀ ਬਿਸ਼ਨੋਈ, ਮੁਹੰਮਦ ਸਿਰਾਜ ਅਤੇ ਅਰਸ਼ਦੀਪ ਸਿੰਘ । ਦੱਖਣੀ ਅਫਰੀਕਾ ਦੇ ਸੰਭਾਵਿਤ ਪਲੇਇੰਗ ਇਲੈਵਨ- ਰੀਜ਼ਾ ਹੈਂਡਰਿਕਸ, ਮੈਥਿਊ ਬ੍ਰੇਟਜ਼ਕੇ, ਏਡਨ ਮਾਰਕਰਮ (ਕਪਤਾਨ), ਹੇਨਰਿਕ ਕਲਾਸਨ, ਟ੍ਰਿਸਟੀਅਨ ਸਟੱਬਸ, ਡੇਵਿਡ ਮਿਲਰ, ਮਾਰਕੋ ਜੈਨਸਨ, ਗੇਰਾਲਡ ਕੋਏਟਜ਼ੀ, ਕੇਸ਼ਵ ਮਹਾਰਾਜ, ਲਿਜ਼ਾਦ ਵਿਲੀਅਮਜ਼, ਤਬਰੇਜ਼ ਸ਼ਮਸੀ","pubDate":"2023-12-10 03:19:08","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/12/10/34994677bc8ac29b5069b8d53037b7e51702178302287709_original.jpg","source_id":"abplive","source_priority":10959,"country":["india"],"category":["sports"],"language":"punjabi"},{"article_id":"2d5d2ee4144ff8c0be38120b94b5bcdd","title":"IND vs SA: भारत-साउथ अफ्रीका के बीच डरबन में खेला जाएगा सीरीज का पहला टी20, जानिए कैसा रहेगा मौसम का मिजाज","link":"https://www.abplive.com/sports/cricket/durban-weather-forecast-ind-vs-sa-1st-t20-match-latest-sports-news-2557202","keywords":["Cricket"],"creator":["एबीपी लाइव"],"video_url":null,"description":"<p style=\"text-align: justify;\"><strong>IND vs SA T20 Match Weather Forecast:</strong> आज भारत और साउथ अफ्रीका की टीमें डरबन के मैदान पर आमने-सामने होगी. दोनों टीमों के बीच 3 टी20 मैचों की सीरीज खेली जाएगी. इस सीरीज का पहला मुकाबला डरबन में खेला जाएगा. भारतीय समयनुसार मुकाबला शाम 7.30 बजे शुरू होगा. सूर्यकुमार यादव की अगुवाई वाली टीम इंडिया अपनी जीत की लय बरकरार रखने के इरादे से मैदान पर उतरेगी. लेकिन आज डरबन में मौसम का मिजाज कैसा रहेगा? क्या भारत-साउथ अफ्रीका मैच में बारिश विलेन बनेगी?</p> <p style=\"text-align: justify;\"><strong>क्या आज डरबन में बारिश के आसार हैं?</strong></p> <p style=\"text-align: justify;\">भारतीय समयनुसार मुकाबला शाम 7.30 बजे शुरू होगा. लेकिन क्या मैच वक्त बारिश के आसार हैं? मौसम विभाग के मुताबिक, सोमवार सुबह डरबन में तेज बिजली गरजने का अनुमान है. आज शाम डरबन के आसमान में बादल छाए रहेंगे. &nbsp;मौसम विभाग की मानें तो भारत-साउथ अफ्रीका पहले टी20 मैच के दौरान 75 फीसदी बारिश के आसार हैं. वहीं, आज डरबन का तापमान तकरीबन 20 डिग्री सेल्सियस के आसपास रह सकता है. बहरहाल, क्रिकेट फैंस के लिए अच्छी खबर नहीं है. आज खराब मौसम और बारिश की वजह से 3 टी20 मैचों की सीरीज का पहला मुकाबला धुल सकता है.</p> <p style=\"text-align: justify;\"><strong>साउथ अफ्रीका के खिलाफ सीरीज जीतने पर टीम इंडिया की नजरें...</strong></p> <p style=\"text-align: justify;\">इससे पहले सूर्यकुमार यादव की अगुवाई वाली भारतीय टीम ने 5 टी20 मैचों की सीरीज में ऑस्ट्रेलिया को 4-1 से हराया. वहीं, अब भारतीय टीम की नजर साउथ अफ्रीका के खिलाफ टी20 सीरीज फतह करने पर है. इस टी20 सीरीज के बाद दोनों टीमों के बीच वनडे और टेस्ट मैचों की सीरीज खेली जाएगी.</p> <p style=\"text-align: justify;\"><strong>भारत की संभावित प्लेइंग इलेवन-</strong></p> <p style=\"text-align: justify;\">यशस्वी जयसवाल, शुभमन गिल, श्रेयस अय्यर, सूर्यकुमार यादव (कप्तान), रिंकू सिंह, जितेश शर्मा (विकेटकीपर), रवींद्र जड़ेजा, मुकेश कुमार, रवि बिश्नोई, मोहम्मद सिराज और अर्शदीप सिंह.</p> <p style=\"text-align: justify;\"><strong>साउथ अफ्रीका की संभावित प्लेइंग इलेवन-</strong></p> <p style=\"text-align: justify;\">रीज़ा हेंड्रिक्स, मैथ्यू ब्रीट्ज़के, एडेन मार्कराम (कप्तान), हेनरिक क्लासेन, ट्रिस्टियन स्टब्स, डेविड मिलर, मार्को जानसन, गेराल्ड कोएत्ज़ी, केशव महाराज, लिज़ाद विलियम्स और तबरेज़ शम्सी</p> <p style=\"text-align: justify;\"><strong>ये भी पढ़ें-</strong></p> <p style=\"text-align: justify;\"><strong><a href=\"https://www.abplive.com/sports/cricket/jhulan-goswami-says-mumbai-indians-bowlers-can-learn-a-lot-from-shabnim-ismail-wpl-auction-2024-sports-news-2557191\">WPL Auction 2024: मुंबई इंडियंस ने शबनीम इस्माइल पर भारी-भरकम बोली क्यों लगाई? टीम के मेंटर ने किया खुलासा</a></strong></p>","content":"IND vs SA T20 Match Weather Forecast: आज भारत और साउथ अफ्रीका की टीमें डरबन के मैदान पर आमने-सामने होगी. दोनों टीमों के बीच 3 टी20 मैचों की सीरीज खेली जाएगी. इस सीरीज का पहला मुकाबला डरबन में खेला जाएगा. भारतीय समयनुसार मुकाबला शाम 7.30 बजे शुरू होगा. सूर्यकुमार यादव की अगुवाई वाली टीम इंडिया अपनी जीत की लय बरकरार रखने के इरादे से मैदान पर उतरेगी. लेकिन आज डरबन में मौसम का मिजाज कैसा रहेगा? क्या भारत-साउथ अफ्रीका मैच में बारिश विलेन बनेगी? क्या आज डरबन में बारिश के आसार हैं? भारतीय समयनुसार मुकाबला शाम 7.30 बजे शुरू होगा. लेकिन क्या मैच वक्त बारिश के आसार हैं? मौसम विभाग के मुताबिक, सोमवार सुबह डरबन में तेज बिजली गरजने का अनुमान है. आज शाम डरबन के आसमान में बादल छाए रहेंगे. मौसम विभाग की मानें तो भारत-साउथ अफ्रीका पहले टी20 मैच के दौरान 75 फीसदी बारिश के आसार हैं. वहीं, आज डरबन का तापमान तकरीबन 20 डिग्री सेल्सियस के आसपास रह सकता है. बहरहाल, क्रिकेट फैंस के लिए अच्छी खबर नहीं है. आज खराब मौसम और बारिश की वजह से 3 टी20 मैचों की सीरीज का पहला मुकाबला धुल सकता है. साउथ अफ्रीका के खिलाफ सीरीज जीतने पर टीम इंडिया की नजरें... googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); इससे पहले सूर्यकुमार यादव की अगुवाई वाली भारतीय टीम ने 5 टी20 मैचों की सीरीज में ऑस्ट्रेलिया को 4-1 से हराया. वहीं, अब भारतीय टीम की नजर साउथ अफ्रीका के खिलाफ टी20 सीरीज फतह करने पर है. इस टी20 सीरीज के बाद दोनों टीमों के बीच वनडे और टेस्ट मैचों की सीरीज खेली जाएगी. भारत की संभावित प्लेइंग इलेवन- यशस्वी जयसवाल, शुभमन गिल, श्रेयस अय्यर, सूर्यकुमार यादव (कप्तान), रिंकू सिंह, जितेश शर्मा (विकेटकीपर), रवींद्र जड़ेजा, मुकेश कुमार, रवि बिश्नोई, मोहम्मद सिराज और अर्शदीप सिंह. साउथ अफ्रीका की संभावित प्लेइंग इलेवन- रीज़ा हेंड्रिक्स, मैथ्यू ब्रीट्ज़के, एडेन मार्कराम (कप्तान), हेनरिक क्लासेन, ट्रिस्टियन स्टब्स, डेविड मिलर, मार्को जानसन, गेराल्ड कोएत्ज़ी, केशव महाराज, लिज़ाद विलियम्स और तबरेज़ शम्सी ये भी पढ़ें- WPL Auction 2024: मुंबई इंडियंस ने शबनीम इस्माइल पर भारी-भरकम बोली क्यों लगाई? टीम के मेंटर ने किया खुलासा","pubDate":"2023-12-10 03:17:33","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/12/10/dc87a4c7c8a6405cebad632ae1b42e4b1702177648270428_original.jpg","source_id":"abplive","source_priority":10959,"country":["india"],"category":["sports"],"language":"hindi"},{"article_id":"822e7c482a0aad27fe61b5b03da03619","title":"Forde, Carty power Windies to series victory over England","link":"https://www.channelnewsasia.com/sport/forde-carty-power-windies-series-victory-over-england-3978116","keywords":["Sport"],"creator":null,"video_url":null,"description":null,"content":"Best News Website or Mobile Service WAN-IFRA Digital Media Awards Worldwide 2022 Best News Website or Mobile Service Digital Media Awards Worldwide 2022 :Keacy Carty hit a half-century and Matthew Forde took three wickets as West Indies claimed a four-wicket win in the rain-affected third one-day international on Saturday to clinch their first home ODI series victory over England since 1998. Chasing a Duckworth-Lewis (DLS) par score of 188 in 34 overs, West Indies appeared to have gotten off to the perfect start as Carty (50) combined with Alick Athanaze (45) for a 76-run partnership, but spinner Will Jacks tore through their middle order. Jacks (3-22) picked up three key wickets as West Indies slumped from 78-1 to 135-6. With his side reeling, Romario Shepherd hit a crucial knock of 41 to push them over the finish line with 14 balls to spare, though the all-rounder benefited from a massive slice of luck when he was dropped on 18 by Liam Livingstone on the boundary rope. West Indies won the series 2-1, claiming a four-wicket victory in the first match before being beaten by six wickets in the second game. Earlier on Saturday, Forde (3-29) took the wickets of top-order batters Phil Salt, Jacks and Zak Crawley to leave England on 45-3 in an excellent spell on his ODI debut. \"There's a lot of work that goes in behind the scenes. Me and the guys have been training hard in a camp before the series. Obviously getting a victory is a dream come true on my debut,\" Forde said. \"It was special for me. I am 21 and I am living my dream. I thank all the guys for making it possible. They have welcomed me with open arms and it has been an easy camp so far.\" England's innings was rescued by Ben Duckett, whose knock of 71 came off 73 balls, while Liam Livingstone was able to shrug off his recent struggles with the bat to contribute 45 runs. Shepherd removed both Duckett and Livingstone in back-to-back overs to stymie England's progress, with the visitors posting a total of 206 in 40 overs at the Kensington Oval in Barbados. The series victory, West Indies' first over England since 2007, will give the hosts a massive boost after they failed to qualify for the 50-overs World Cup. For England, however, it will raise even more questions about the future of their ODI team, coming off the back of a disappointing World Cup exit. \"This is the start of a long journey for this side,\" said England captain Jos Buttler. \"There are some young guys who have got their first taste of ODI cricket and have hopefully learned lot and can go on and we can build something for the future.\" The two sides next face each other in a five-match Twenty20 series. The first game of the series will be played at the same venue on Tuesday.","pubDate":"2023-12-10 03:17:29","image_url":null,"source_id":"channelnewsasia","source_priority":37829,"country":["singapore"],"category":["sports"],"language":"english"},{"article_id":"ce37fdc9c12471b1de4ea2c608c35c0f","title":"WI vs ENG, 3rd ODI: England slip to series defeat weeks after World Cup flop show","link":"https://www.indiatoday.in/sports/cricket/story/west-indies-vs-england-3rd-odi-score-series-win-matthew-forde-jos-buttler-2474128-2023-12-10?utm_source=rss","keywords":null,"creator":null,"video_url":null,"description":"WI vs ENG, 3rd ODI: England slip to series defeat weeks after World Cup flop show","content":"Listen to Story England woes in the ODI format continued as Jos Buttler's side lost an ODI series 2-1 to the West Indies after a rain-affected series finale in Barbados on Saturday, December 9. Weeks after failing to make a mark in the ODI World Cup in India, the series defeat in the Caribbean only highlights the continued dip in form of the former world champions. For West Indies, it was a much-needed statement of intent after they failed to feature in the ODI World Cup for the first time in their history. After winning the first ODI, West Indies were undone in the second but the young side, led by in-form Shai Hope, stepped up and delivered when it mattered with a fine all-round show. Debutant Matthew Forde was the start of the show for West Indies as he picked up 3 wickets after getting his maiden ODI cap on Saturday. His opening burst of 6 overs where he picked up 3 saw England slipping to 49 for 5. Jos Buttler's struggles continued as the England captain got out for a 0, days after a confidence-boosting fifty in the 2nd ODI. England's batting lineup largely crumbled under pressure, with the likes of Phil Salt, Will Jacks, Jos Buttler and Harry Brook getting out in single-digit scores. However, there were two notable exceptions: Liam Livingstone and Ben Duckett. Livingstone managed to contribute a fighting 45 runs, while Duckett was the top scorer for his team with a commendable 71 runs. England managed just 206 in 40 overs in the rain-reduced game. The West Indies bowlers, on the other hand, shone brightly in this series decider. Matthew Forde, on his debut, had an exceptional start to his international career. He exploited the early moisture on the pitch to take three wickets in his first 25 balls, setting back the English top order significantly. His performance earned him the Player of the Match award on debut. Chasing 188 in 34 overs after more rain interruptions, West Indies lost Brandon King early. However, in-form Alick Athanaze and Keacy Karty stitched 76 runs for the 2nd wicket. Romario Shepherd also played a pivotal role in dismantling the English plans on Saturday His brutal assault included a particularly devastating over where he smashed 24 runs off Gus Atkinson, bringing the West Indies within sight of their victory target.","pubDate":"2023-12-10 03:06:58","image_url":"https://akm-img-a-in.tosshub.com/indiatoday/images/story/202312/matthew-forde-105905398-16x9_0.jpg?VersionId=YAy13_Q3n57qfEqwsTWCkFaf4ci6e1nT","source_id":"indiatoday","source_priority":2885,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"901548d023e5c678a1e8eaaa5e6534b5","title":"हार्दिक पंड्या की वापसी पर बड़ा अपडेट, रोहित की कप्तानी की भी तस्वीरें साफ!","link":"https://hindi.news18.com/cricket/jay-shah-giving-update-on-hardik-pandya-return-and-rohit-sharma-captain-in-wpl-auction-2024-before-ind-vs-sa-t20-7890064.html","keywords":null,"creator":null,"video_url":null,"description":"IND vs SA: साउथ अफ्रीका के खिलाफ टी20 सीरीज के लिए टीम इंडिया पूरी तरह से तैयार है. हार्दिक पंड्या की गैरमौजूदगी में टीम की कमान सूर्यकुमार यादव के हाथों में है. WPL के ऑक्शन में बीसीसीआई सचिव ने हार्दिक की वापसी और रोहित की कप्तानी को लेकर तस्वीरे साफ कर दी हैं.","content":"रोहित शर्मा और हार्दिक पंड्या को लेकर बीसीसीआई सचिव ने बड़ा इशारा किया है. (AP) नई दिल्ली. दुनिया के बेस्ट ऑलराउंडर्स में से एक टीम इंडिया के अहम ऑलराउंडर हार्दिक पंड्या (Hardik Pandya) वर्ल्ड कप के दौरान चोटिल हो गए. भारतीय टीम के लिए हार्दिक एक अहम खिलाड़ी ही नहीं बल्कि टी20 में टीम के कप्तान भी हैं. लेकिन आगामी टी20 वर्ल्ड कप में कप्तानी के लिए रोहित शर्मा पर कयास लगाए जा रहे हैं. हिटमैन ने टी20 वर्ल्ड कप 2022 के बाद छोटे प्रारूप कप्तानी नहीं की है. लेकिन रोहित शर्मा (Rohit Sharma) कैप्टैंसी को लेकर क्या प्लान है और हार्दिक पंड्या कब वापसी कर सकते हैं, इन दोनों सवालों के उत्तर बीसीसीआई (Jay Shah) के सचिव जय शाह ने दे दिए हैं. वुमेन प्रीमियर लीग के ऑक्शन के चलते 9 दिसंबर को माहौल गर्म रहा. इस दौरान जय शाह ने मेंस क्रिकेट टीम के बारे में भी अपने विचार सामने रखे. उन्होंने रोहित शर्मा की कप्तानी को लेकर कहा, ‘अभी स्पष्टता की क्या आवश्यकता है? टी20 वर्ल्ड कप जून में शुरू हो रहा है, हमारे पास उससे पहले आईपीएल है और अफगानिस्तान के खिलाफ टी20 सीरीज है. हम दैनिक आधार पर इसकी निगरानी कर रहे हैं. वह एनसीए में ही है और काफी मेहनत कर रहे हैं. जैसे ही वह फिट होंगे हम आपको उचित समय पर बता देंगे. अफगानिस्तान श्रृंखला से पहले भी फिट हो सकते हैं.’ सूर्या की कप्तानी में होगा टी20 सीरीज का आगाज टीम इंडिया टी20 सीरीज के लिए साउथ अफ्रीका दौरे पर पहुंच चुकी है. टी20 सीरीज का आगाज 10 दिसंबर से हो जाएगा. इस सीरीज में टीम की कप्तानी सूर्यकुमार यादव के हाथों में रहेगी. स्काई एंड कंपनी ने हाल ही में ऑस्ट्रेलिया को टी20 सीरीज में 4-1 से करारी शिकस्त दी. अब देखना दिलचस्प होगा सूर्या साउथ अफ्रीका को उसके घर में मात देने में कामयाब हो पाते हैं या नहीं. 9 साल छोटी हैं इस क्रिकेटर की वाइफ, शादी के लिए बदला था धर्म, खूबसूरती में ऐक्ट्रेस को देती हैं मात टी20 सीरीज के लिए टीम इंडिया यशस्वी जयसवाल, शुभमन गिल, ऋतुराज गायकवाड़, तिलक वर्मा, सूर्यकुमार यादव (कप्तान), रिंकू सिंह, श्रेयस अय्यर, ईशान किशन (विकेटकीपर), जितेश शर्मा (विकेटकीपर), रवींद्र जडेजा (उपकप्तान), वॉशिंगटन सुंदर, रवि बिश्नोई, कुलदीप यादव, अर्शदीप सिंह, मो. सिराज, मुकेश कुमार, दीपक चाहर. . Tags: BCCI , Hardik Pandya , Ind vs sa , Jay Shah , Rohit sharma , Team india मात्र ₹32,400 में मिल रहा है 90 हज़ार वाला तगड़ा iPhone, एंड्रॉयड वाले भी खरीदने लगे ऐपल मोबाइल Kamleshwar Dodiyar: एमपी के इस विधायक का नाम सबकी जुबान पर, PHOTOS से जानिए साइकिल से दिल्ली में टिफिन बांटने व वेटर की नौकरी से लेकर विधायक बनने का सफर कोरोना ने बदल दिया MBBS डॉक्टर का इरादा, पहले प्रयास में बने IAS, ऐसे टॉप की UPSC","pubDate":"2023-12-10 03:06:53","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/12/Rohit-Sharma-and-Hardik-Pandya-AP-2023-12-9b6e150ee3100827beb6b153d0af84c5-3x2.jpg","source_id":"hindinews18","source_priority":6509,"country":["india"],"category":["sports"],"language":"hindi"},{"article_id":"edeb98daf33c826d5aee4497aa18288c","title":"West Indies clinch ODI series against England 2-1 to achieve historic feat at home","link":"https://www.indiatvnews.com/sports/cricket/wi-vs-eng-3rd-odi-west-indies-clinch-odi-series-against-england-2-1-to-achieve-historic-feat-at-home-2023-12-10-906610","keywords":null,"creator":null,"video_url":null,"description":"Debutant Matthew Forde's sensational all-round effort (3/29 and 13* off 16 balls) combined with Romario Shepherd's brilliance with the willow in hand helped West Indies clinch an ODI series against England for the first time since 1998 at home as they sealed the series decider by four wickets (DLS method) at the Kensington Oval in Barbados on Saturday, December 9.","content":"Debutant Matthew Forde's sensational all-round effort (3/29 and 13* off 16 balls) combined with Romario Shepherd's brilliance with the willow in hand helped West Indies clinch an ODI series against England for the first time since 1998 at home as they sealed the series decider by four wickets (DLS method) at the Kensington Oval in Barbados on Saturday, December 9. Player of the Match (POTM) Forde who replaced Oshane Thomas in the playing XI, proved his captain right as he demolished the English top order up front. Forde got the better of Phil Salt, Zack Crawley and Will Jacks who was the star for England in the previous game with the bat in hand to leave the tourists languishing at 3/45. Alzarri Joseph added to England's misery soon as he ran Harry Brook out before he could get his eye in and removed the English skipper for a golden duck with a bumper. Buttler failed to keep the pull shot in control and miscued it as it was held safely by Gudakesh Motie at the fine leg boundary. The Three Lions were five down inside the first ten overs of the game and were starting down the barrel. However, an 88-run stand between Ben Duckett (71 of 73 balls) and Liam Livingstone (45 off 56 deliveries) rescued the 2019 ODI World Cup champions from a precarious situation. Shepherd ended England's resistance as he removed both Duckett and Livingstone within a gap of 16 balls and helped the Men in Maroon claw their way back into the contest. England posted 206 on the board after the rain curtailed the contest to 40 overs per side. The rain came back to halt the contest again and the Windies were asked to chase down a revised target of 188 in 34 overs. The hosts lost Brandon King in the second over but it didn't deter the duo of Alick Athanaze (45 off 51 balls) and Keacy Carty (50 off 58 deliveries) from the task at hand. The pair added 76 runs for the second wicket and laid the foundation of the historic run chase. Despite the stutter in the middle overs that saw Hope, and Sherfane Rutherford getting dismissed cheaply, the Windies got home with four wickets as Shepherd put on a power-hitting masterclass at the end to pull curtains on the ODI leg of the series.","pubDate":"2023-12-10 03:03:26","image_url":"https://resize.indiatvnews.com/en/resize/newbucket/715_-/2023/12/untitled-design-2023-12-10t075610-1702175172.jpg","source_id":"indiatvnews","source_priority":10055,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"32a9dec3985d59bcd6f839fad2639639","title":"'Dripping with sweat': Extreme heat threatens to throw season into chaos","link":"https://www.canberratimes.com.au/story/8454188/cricket-act-extreme-heat-policy-adopted-in-sweltering-conditions/?src=rss","keywords":null,"creator":["Cameron Mee"],"video_url":null,"description":"Cricketers battled stifling conditions on Saturday afternoon.","content":"Club cricketers across the region are bracing for a summer of extreme heat after playing through sweltering conditions on Saturday. Umpires and captains adopted the Cricket ACT heat policy as temperatures soared into the mid-30s. Start times were shifted earlier, additional drinks breaks were held and a priority was placed on hydration and player safety in the stifling conditions. Wests captain Scott Murn it was a challenging afternoon as his side battled the elements in Saturday's win over Ginninderra . \"It was certainly sapping,\" he said. \"It was a lot more humid than we thought it was going to be. You could see the fast bowlers in particular, it was hard work. Even the batters, anyone who batted any length of time was dripping with sweat. \"It's good when we do get a physical challenge, cricket shouldn't be easy.\" As tough as the conditions were, players across the territory felt like they dodged a bullet on Saturday. The mercury only reached 34.6 degrees, 2.4 degrees below the forecast high of 37. Despite this, the situation provided a physical and mental challenge for both batters and bowlers as heat exhaustion and dehydration made playing cricket incredibly tough. Wests' Lachlan Malcolm attempts to cool down in Saturday's heat. Picture by Keegan Carroll Cricket ACT officials were closely monitoring the situation throughout the week and on Saturday and chief executive Olivia Thornton said player safety will always remain a priority. \"It's really important we do take care of our people and an element of common sense prevails,\" she said. \"We're massive advocates for broad-brim hats, long sleeves, sunscreen and staying hydrated. \"We hope people do the right thing from a sun safety perspective.\" While Saturday was bad, there are fears things could get even worse in the new year. With El Nino already declared and long-range forecasts predicting a hot, dry summer, players are bracing for a sweltering January. The long-term implications could be dire, with some experts suggesting the cricket season may need to be shifted away from summer if climate change continues to trigger higher temperatures. It's a tough ask for the lower grades, but many aspirational first grade players are embracing the challenge. Test and first-class cricket have a long history of being played in sweltering conditions and Murn said those with representative hopes are using the heat as an opportunity to send a message to selectors. \"I wouldn't be surprised if we have some very hot days in the second half of the season,\" Murn said. \"Playing two-day cricket, it's a really tough grind for the team that ends up in the field all day. \"That being said, it's a good preparation for guys who want to play a higher level of cricket. Guys who stand out and prove they've got the fitness levels that allow them to perform in all conditions.\" Cricket ACT round 13 Wests 8-230 bt Ginninderra 9-170 (DLS) Queanbeyan 6-134 bt ANU 8-1185 (DLS) Tuggeranong 6-181 bt Weston Creek Molonglo 5-180 Eastlake v North Canberra Gungahlin Abandoned Share Facebook Twitter Whatsapp Email Copy Cameron Mee Sports Journalist Sports reporter at the Canberra Times Sports reporter at the Canberra Times More from Latest News 'Time for renewal': Queensland premier Palaszczuk quits 7m ago 'Dripping with sweat': Extreme heat threatens to throw season into chaos 14m ago No comment s Queensland premier Palaszczuk quits 19m ago Murder probe after woman collapses, dies near home fire 24m ago More from Latest News 'Time for renewal': Queensland premier Palaszczuk quits 7m ago 'Dripping with sweat': Extreme heat threatens to throw season into chaos 14m ago No comment s Queensland premier Palaszczuk quits 19m ago Murder probe after woman collapses, dies near home fire 24m ago US storms and tornadoes leave at least six dead 50m ago Man injured in targeted Melbourne CBD shooting 1hr ago More from Latest News 'Time for renewal': Queensland premier Palaszczuk quits 7m ago 'Dripping with sweat': Extreme heat threatens to throw season into chaos 14m ago No comment s Queensland premier Palaszczuk quits 19m ago Murder probe after woman collapses, dies near home fire 24m ago US storms and tornadoes leave at least six dead 50m ago Man injured in targeted Melbourne CBD shooting 1hr ago","pubDate":"2023-12-10 03:29:00","image_url":"https://www.canberratimes.com.au/images/transform/v1/crop/frm/GzY3iczng7SLWqVgHSV78t/c428b1b6-e5c9-410f-87fc-10a6c46948a7.jpg/r0_133_2587_1590_w600_h338_fmax.jpg","source_id":"canberratimes","source_priority":88737,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"f1d06d77190bb219b37956501c4947cf","title":"Cricket-Forde, Carty power Windies to series victory over England","link":"https://www.thestar.com.my/sport/cricket/2023/12/10/cricket-forde-carty-power-windies-to-series-victory-over-england","keywords":null,"creator":null,"video_url":null,"description":"(Reuters) - Keacy Carty hit a half-century and Matthew Forde took three wickets as West Indies claimed a four-wicket win in the rain-affected third one-day international on Saturday to clinch their first home ODI series victory over England since 1998. Read full story","content":"(Reuters) - Keacy Carty hit a half-century and Matthew Forde took three wickets as West Indies claimed a four-wicket win in the rain-affected third one-day international on Saturday to clinch their first home ODI series victory over England since 1998. Chasing a Duckworth-Lewis (DLS) par score of 188 in 34 overs, Carty (50) combined with Alick Athanaze (45) for a 76-run partnership, before Romario Shepherd hit 41 to help the West Indies get over the finish line with 14 balls to spare. Earlier on Saturday, Forde (3-29) took the wickets of top-order batters Phil Salt, Will Jacks and Zak Crawley to leave England on 45-3 in an excellent spell on his ODI debut. England's innings was rescued by Ben Duckett, whose knock of 71 came off 73 balls, while Liam Livingstone was able to shrug off his recent struggles with the bat to contribute 45 runs as the visitors posted a total of 206 in 40 overs at the Kensington Oval in Barbados. The two sides will face each other in a five-match Twenty20 series, with the first game of the series being played at the same venue on Tuesday. (Reporting by Aadi Nair in Bengaluru; Editing by Shri Navaratnam)","pubDate":"2023-12-10 03:29:00","image_url":null,"source_id":"thestar_my","source_priority":37088,"country":["malaysia"],"category":["sports"],"language":"english"},{"article_id":"605a6f4c5b7018bb3bb0ee748ab350a4","title":"West Indies vs England: Debutant Matthew Forde fires Windies to first ODI series win since 2007","link":"https://www.firstpost.com/firstcricket/sports-news/west-indies-vs-england-debutant-matthew-forde-fires-windies-to-first-odi-series-win-since-2007-13485822.html","keywords":["First Cricket News"],"creator":["Ujwal Singh"],"video_url":null,"description":"West Indies vs England: Debutant Matthew Forde fires Windies to first ODI series win since 2007","content":"Cricket West Indies vs England: Debutant Matthew Forde fires Windies to first ODI series win since 2007 Matthew Forde's all-round heroics propelled West Indies to their first ODI series triumph over England for 16 years and their first at home against these opponents for 25 years. Agence France-Presse December 10, 2023 08:54:42 IST This is West Indies' first ODI series win over England at home in the last 25 years. Image: WICB A dream debut by Matthew Forde helped guide the West Indies to a series-clinching four-wicket win over England in the decisive third and final match of their One-Day International series at Kensington Oval in Barbados on Saturday. In a rain-affected encounter, the 21-year-old Barbadian delighted the few home supporters among a majority English audience with figures of three for 29 as the tourists were restricted to 206 for nine off 40 overs after being put in. Then, with the West Indies stuttering at 135 for six in pursuit of a revised target of 188 off 34 overs, Forde (13 not out) joined Romario Shepherd (41 not out) in an unbroken seventh-wicket stand of 56 to take the Caribbean team to their first ODI series triumph over England for 16 years and their first at home against these opponents for 25 years. Related Articles West Indies vs England: Shai Hope guides Windies to four-wicket win in 1st ODI West Indies vs England: Redemption for Sam Curran as England level series “This is a dream come true,” said an overwhelmed Forde, who was named Man of the Match, in reflecting on his contribution. “The wicket was a bit tacky so it was just about bowling the right line and length. And when I came in to bat, it was just about turning over the strike and getting Sheppy on strike as often as possible.” Brought into the team in place of Oshane Thomas and given use of the new ball, the hometown boy claimed wickets in his first two overs and added a third in his fifth to put England immediately on the back foot. Ben Duckett offered the only substantial resistance with a pugnacious innings of 71, getting meaningful support from Liam Livingstone (45) in a stand of 88 for the sixth wicket after they had slumped to 49 for five in the tenth over. Forde removed Phil Salt to a low catch at mid-off and then had Zak Crawley taken at second slip. He added the wicket of the other opener, Phil Jacks, two overs later via a wicketkeeper’s catch. Jacks was almost the unlikely hero for England with the ball, taking three wickets for 22 runs, including topscorer Keacy Carty for 50, to seem to tilt the balance of the match in his side’s favour. A few short However Jacks and the other slow bowling options Rehan Ahmed and Liam Livingstone could not separate the pair of Shepherd and Forde and when 24 runs were smashed off returning seamer Gus Atkinson in the 30th over, the result was effectively sealed. “We were a few short with the bat,” said England captain Jos Buttler in reflecting on the loss. “We fought hard with the ball but it just wasn’t enough. This is the start of a long journey for this side. Hopefully we can build something for the future.” For West Indies captain Shai Hope, who took the Man of the Series award with a tally of 192 runs at an average of 96 across the three matches, both the result and the contributions of younger players were encouraging. “It’s great to see these other guys chipping in with the bat and as long as we continue in this vein it can develop into a very good batting group,” he said. Join our Whatsapp channel to get the latest global news updates Published on: December 10, 2023 08:54:42 IST Tags: West Indies Vs England","pubDate":"2023-12-10 03:24:42","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/12/West-Indies-vs-England.jpg","source_id":"firstpost","source_priority":5906,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"c833ada2c8c3dfac4c8f6378d0aa435d","title":"India vs South Africa 1st T20I Live Streaming, Venue, Date, Match Timings","link":"https://news.abplive.com/sports/cricket/ind-vs-sa-1st-t20i-live-streaming-telecast-venue-durban-date-match-timings-1648944","keywords":["Cricket"],"creator":["ABP News Bureau"],"video_url":null,"description":"<p><strong>India vs South Africa 1st T20I</strong> <strong>live streaming, venue, match timings, date:</strong> Sunday's blockbuster India vs South Africa 1st T20I in Kingsmead, Durban promises to be an exciting contest.&nbsp;</p> <p><strong>Here's everything you need to know about India vs South Africa 1st T20I 2023 live streaming, date, match timings, venue</strong></p> <p><strong>When will India vs South Africa 1st T20I match be played?</strong></p> <p>India vs South Africa 1st T20I match will take place on Sunday (December 10).</p> <p><strong>Where will India vs South Africa 1st T20I match be played?</strong></p> <p>India vs South Africa 1st T20I match will be played at the Kingsmead, Durban, South Africa.</p> <p><strong>What time will India vs South Africa 1st T20I match start?</strong></p> <p>India vs South Africa 1st T20I match will start at 07:30 PM IST.</p> <p><strong>How to watch India vs South Africa 1st T20I Free Live Streaming on Mobile APP, TV and Laptop?</strong></p> <p>Live telecast of India vs South Africa 1st T20I match in India will be available on Star Sports channels.</p> <p><strong>How to watch Free Live Streaming of India vs South Africa 1st T20I match online?</strong></p> <p><strong>India vs South Africa 1st T20I Live Streaming:</strong> India vs South Africa 1st T20I Free Live Streaming will be available on Disney+ Hotstar app and website.&nbsp;</p>","content":"India vs South Africa 1st T20I live streaming, venue, match timings, date: Sunday's blockbuster India vs South Africa 1st T20I in Kingsmead, Durban promises to be an exciting contest. Following a successful 4-1 series triumph against Australia at home, the Indian men's cricket team, led by Suryakumar Yadav, is set to embark on a high-octane three-match IND vs SA T20I series, commencing this Sunday (December 10). Star players like Shreyas Iyer and Shubman Gill have made comeback to the national team for India vs South Africa T20I series, following a much-needed break. The focus will be on the likes of Yashasvi Jaiswal, Rinku Singh and Ravi Bishnoi. South Africa, on the other hand, dealt with a massive blow as their premier pacer Lungi Ngidi suffered an injury, resulting in him being ruled out for the entire IND vs SA series. The Proteas batters have been in super form lately and will aim to continue the momentum vs India. Here's everything you need to know about India vs South Africa 1st T20I 2023 live streaming, date, match timings, venue When will India vs South Africa 1st T20I match be played? googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); India vs South Africa 1st T20I match will take place on Sunday (December 10). Where will India vs South Africa 1st T20I match be played? India vs South Africa 1st T20I match will be played at the Kingsmead, Durban, South Africa. What time will India vs South Africa 1st T20I match start? India vs South Africa 1st T20I match will start at 07:30 PM IST. How to watch India vs South Africa 1st T20I Free Live Streaming on Mobile APP, TV and Laptop? Live telecast of India vs South Africa 1st T20I match in India will be available on Star Sports channels. How to watch Free Live Streaming of India vs South Africa 1st T20I match online? India vs South Africa 1st T20I Live Streaming: India vs South Africa 1st T20I Free Live Streaming will be available on Disney+ Hotstar app and website.","pubDate":"2023-12-10 03:22:25","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/12/10/92acb0baf4167ea036ff9cd3e0ec5158170217851603224_original.jpg","source_id":"abplive","source_priority":10959,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"6d645bbb38d6c8a69060dbf52b34410b","title":"IND vs SA: ਭਾਰਤ- ਦੱਖਣੀ ਅਫਰੀਕਾ ਵਿਚਾਲੇ ਪਹਿਲਾ ਟੀ-20 ਮੁਕਾਬਲਾ ਅੱਜ, ਜਾਣੋ ਕਿੱਥੇ ਅਤੇ ਕਿਵੇਂ ਵੇਖੋ ਸਕੋਗੇ ਭਿੜਤ ?","link":"https://punjabi.abplive.com/sports/cricket/india-south-africa-1st-t20-match-timing-pitch-report-know-details-763651","keywords":["ਕ੍ਰਿਕਟ"],"creator":["ABP Sanjha"],"video_url":null,"description":"<p><strong>IND vs SA Pitch Report:</strong> ਅੱਜ ਭਾਰਤ ਅਤੇ ਦੱਖਣੀ ਅਫਰੀਕਾ ਵਿਚਾਲੇ 3 ਟੀ-20 ਮੈਚਾਂ ਦੀ ਸੀਰੀਜ਼ ਦਾ ਪਹਿਲਾ ਮੈਚ ਖੇਡਿਆ ਜਾਵੇਗਾ। ਦੋਵੇਂ ਟੀਮਾਂ ਡਰਬਨ ਦੇ ਮੈਦਾਨ 'ਤੇ ਆਹਮੋ-ਸਾਹਮਣੇ ਹੋਣਗੀਆਂ। ਇਹ ਮੈਚ ਭਾਰਤੀ ਸਮੇਂ ਅਨੁਸਾਰ ਸ਼ਾਮ 7.30 ਵਜੇ ਸ਼ੁਰੂ ਹੋਵੇਗਾ। ਭਾਰਤੀ ਟੀਮ ਦੀ ਕਪਤਾਨੀ ਸੂਰਿਆਕੁਮਾਰ ਯਾਦਵ ਕਰਨਗੇ ਜਦਕਿ ਦੱਖਣੀ ਅਫ਼ਰੀਕੀ ਟੀਮ ਦੀ ਅਗਵਾਈ ਏਡੇਨ ਮਾਰਕਰਮ ਕਰਨਗੇ। ਫਿਲਹਾਲ, ਡਰਬਨ ਦੀ ਵਿਕਟ ਕਿਵੇਂ ਹੋਵੇਗੀ? ਕੀ ਇਸ ਵਿਕਟ 'ਤੇ ਬੱਲੇਬਾਜ਼ ਆਸਾਨੀ ਨਾਲ ਦੌੜਾਂ ਬਣਾ ਸਕਣਗੇ ਜਾਂ ਗੇਂਦਬਾਜ਼ ਚੁਣੌਤੀ ਬਣਨਗੇ?</p> <p><strong>ਕੀ ਡਰਬਨ 'ਚ ਬੱਲੇਬਾਜ਼ਾਂ ਲਈ ਗੇਂਦਬਾਜ਼ ਬਣਨਗੇ ਚੁਣੌਤੀ ?</strong></p> <p>ਦਰਅਸਲ, ਅੰਕੜੇ ਦੱਸਦੇ ਹਨ ਕਿ ਡਰਬਨ ਦੀ ਪਿੱਚ 'ਤੇ ਬੱਲੇਬਾਜ਼ ਆਸਾਨੀ ਨਾਲ ਦੌੜਾਂ ਬਣਾਉਂਦੇ ਹਨ। ਇਸ ਪਿੱਚ 'ਤੇ ਔਸਤ ਸਕੋਰ 170 ਦੌੜਾਂ ਹੈ। ਯਾਨੀ ਇੱਕ ਪਾਰੀ ਵਿੱਚ ਇੱਕ ਟੀਮ ਲਗਭਗ 170 ਦੌੜਾਂ ਬਣਾਉਂਦੀ ਹੈ। ਇਹ ਅੰਕੜੇ ਗੇਂਦਬਾਜ਼ਾਂ ਲਈ ਚੰਗੇ ਨਹੀਂ ਹਨ। ਇਸ ਤੋਂ ਇਲਾਵਾ ਟਾਸ ਜਿੱਤਣ ਵਾਲੀ ਟੀਮ ਪਹਿਲਾਂ ਫੀਲਡਿੰਗ ਕਰਨਾ ਚਾਹੇਗੀ। ਪਿਛਲੇ ਰਿਕਾਰਡਾਂ ਮੁਤਾਬਕ ਦੌੜਾਂ ਦਾ ਪਿੱਛਾ ਕਰਨਾ ਆਸਾਨ ਹੈ। ਯਾਨੀ ਟਾਸ ਜਿੱਤਣ ਵਾਲਾ ਕਪਤਾਨ ਪਹਿਲਾਂ ਗੇਂਦਬਾਜ਼ੀ ਕਰਨ ਦਾ ਫੈਸਲਾ ਕਰ ਸਕਦਾ ਹੈ। ਇਸ ਦੇ ਨਾਲ ਹੀ ਇਸ ਵਿਕਟ 'ਤੇ ਗੇਂਦਬਾਜ਼ਾਂ ਨੂੰ ਬਾਊਂਸ ਮਿਲਦਾ ਹੈ, ਜੋ ਬੱਲੇਬਾਜ਼ਾਂ ਲਈ ਚੁਣੌਤੀ ਬਣ ਸਕਦਾ ਹੈ।</p> <p><strong>ਕਦੋਂ, ਕਿੱਥੇ ਅਤੇ ਕਿਵੇਂ ਦੇਖ ਸਕਦੇ ਹੋ ਲਾਈਵ ਸਟ੍ਰੀਮਿੰਗ ਅਤੇ ਪ੍ਰਸਾਰਣ ?</strong></p> <p>ਭਾਰਤ ਅਤੇ ਦੱਖਣੀ ਅਫਰੀਕਾ ਵਿਚਾਲੇ 3 ਟੀ-20 ਮੈਚਾਂ ਦੀ ਸੀਰੀਜ਼ ਦਾ ਪਹਿਲਾ ਮੈਚ ਡਰਬਨ 'ਚ ਖੇਡਿਆ ਜਾਵੇਗਾ। ਦੋਵਾਂ ਟੀਮਾਂ ਵਿਚਾਲੇ ਮੈਚ ਭਾਰਤੀ ਸਮੇਂ ਅਨੁਸਾਰ ਸ਼ਾਮ 7.30 ਵਜੇ ਸ਼ੁਰੂ ਹੋਵੇਗਾ। ਭਾਰਤੀ ਪ੍ਰਸ਼ੰਸਕ ਸਟਾਰ ਸਪੋਰਟਸ ਨੈੱਟਵਰਕ 'ਤੇ ਲਾਈਵ ਪ੍ਰਸਾਰਣ ਦੇਖ ਸਕਣਗੇ। ਇਸ ਤੋਂ ਇਲਾਵਾ ਭਾਰਤ-ਦੱਖਣੀ ਅਫਰੀਕਾ ਸੀਰੀਜ਼ ਦੇ ਮੈਚਾਂ ਦੀ ਲਾਈਵ ਸਟ੍ਰੀਮਿੰਗ ਡਿਜ਼ਨੀ ਪਲੱਸ ਹੌਟਸਟਾਰ 'ਤੇ ਹੋਵੇਗੀ। ਭਾਵ, ਭਾਰਤੀ ਪ੍ਰਸ਼ੰਸਕ Disney Plus Hotstar 'ਤੇ ਲਾਈਵ ਸਟ੍ਰੀਮਿੰਗ ਦੇਖ ਸਕਣਗੇ। ਭਾਰਤੀ ਪ੍ਰਸ਼ੰਸਕ ਡਿਜ਼ਨੀ ਪਲੱਸ ਹੌਟਸਟਾਰ 'ਤੇ ਹਿੰਦੀ ਅਤੇ ਅੰਗਰੇਜ਼ੀ ਤੋਂ ਇਲਾਵਾ ਕਈ ਭਾਸ਼ਾਵਾਂ 'ਚ ਮੈਚ ਦਾ ਆਨੰਦ ਲੈ ਸਕਣਗੇ।</p> <p><strong>ਭਾਰਤ ਦੀ ਸੰਭਾਵਿਤ ਪਲੇਇੰਗ ਇਲੈਵਨ-</strong></p> <p>ਯਸ਼ਸਵੀ ਜੈਸਵਾਲ, ਸ਼ੁਭਮਨ ਗਿੱਲ, ਸ਼੍ਰੇਅਸ ਅਈਅਰ, ਸੂਰਿਆਕੁਮਾਰ ਯਾਦਵ (ਕਪਤਾਨ), ਰਿੰਕੂ ਸਿੰਘ, ਜਿਤੇਸ਼ ਸ਼ਰਮਾ (ਵਿਕਟਕੀਪਰ), ਰਵਿੰਦਰ ਜਡੇਜਾ, ਮੁਕੇਸ਼ ਕੁਮਾਰ, ਰਵੀ ਬਿਸ਼ਨੋਈ, ਮੁਹੰਮਦ ਸਿਰਾਜ ਅਤੇ <a title=\"ਅਰਸ਼ਦੀਪ ਸਿੰਘ\" href=\"https://punjabi.abplive.com/topic/arshdeep-singh\" data-type=\"interlinkingkeywords\">ਅਰਸ਼ਦੀਪ ਸਿੰਘ</a>।</p> <p><strong>ਦੱਖਣੀ ਅਫਰੀਕਾ ਦੇ ਸੰਭਾਵਿਤ ਪਲੇਇੰਗ ਇਲੈਵਨ-</strong></p> <p>ਰੀਜ਼ਾ ਹੈਂਡਰਿਕਸ, ਮੈਥਿਊ ਬ੍ਰੇਟਜ਼ਕੇ, ਏਡਨ ਮਾਰਕਰਮ (ਕਪਤਾਨ), ਹੇਨਰਿਕ ਕਲਾਸਨ, ਟ੍ਰਿਸਟੀਅਨ ਸਟੱਬਸ, ਡੇਵਿਡ ਮਿਲਰ, ਮਾਰਕੋ ਜੈਨਸਨ, ਗੇਰਾਲਡ ਕੋਏਟਜ਼ੀ, ਕੇਸ਼ਵ ਮਹਾਰਾਜ, ਲਿਜ਼ਾਦ ਵਿਲੀਅਮਜ਼, ਤਬਰੇਜ਼ ਸ਼ਮਸੀ</p>","content":"IND vs SA Pitch Report: ਅੱਜ ਭਾਰਤ ਅਤੇ ਦੱਖਣੀ ਅਫਰੀਕਾ ਵਿਚਾਲੇ 3 ਟੀ-20 ਮੈਚਾਂ ਦੀ ਸੀਰੀਜ਼ ਦਾ ਪਹਿਲਾ ਮੈਚ ਖੇਡਿਆ ਜਾਵੇਗਾ। ਦੋਵੇਂ ਟੀਮਾਂ ਡਰਬਨ ਦੇ ਮੈਦਾਨ 'ਤੇ ਆਹਮੋ-ਸਾਹਮਣੇ ਹੋਣਗੀਆਂ। ਇਹ ਮੈਚ ਭਾਰਤੀ ਸਮੇਂ ਅਨੁਸਾਰ ਸ਼ਾਮ 7.30 ਵਜੇ ਸ਼ੁਰੂ ਹੋਵੇਗਾ। ਭਾਰਤੀ ਟੀਮ ਦੀ ਕਪਤਾਨੀ ਸੂਰਿਆਕੁਮਾਰ ਯਾਦਵ ਕਰਨਗੇ ਜਦਕਿ ਦੱਖਣੀ ਅਫ਼ਰੀਕੀ ਟੀਮ ਦੀ ਅਗਵਾਈ ਏਡੇਨ ਮਾਰਕਰਮ ਕਰਨਗੇ। ਫਿਲਹਾਲ, ਡਰਬਨ ਦੀ ਵਿਕਟ ਕਿਵੇਂ ਹੋਵੇਗੀ? ਕੀ ਇਸ ਵਿਕਟ 'ਤੇ ਬੱਲੇਬਾਜ਼ ਆਸਾਨੀ ਨਾਲ ਦੌੜਾਂ ਬਣਾ ਸਕਣਗੇ ਜਾਂ ਗੇਂਦਬਾਜ਼ ਚੁਣੌਤੀ ਬਣਨਗੇ? ਕੀ ਡਰਬਨ 'ਚ ਬੱਲੇਬਾਜ਼ਾਂ ਲਈ ਗੇਂਦਬਾਜ਼ ਬਣਨਗੇ ਚੁਣੌਤੀ ? ਦਰਅਸਲ, ਅੰਕੜੇ ਦੱਸਦੇ ਹਨ ਕਿ ਡਰਬਨ ਦੀ ਪਿੱਚ 'ਤੇ ਬੱਲੇਬਾਜ਼ ਆਸਾਨੀ ਨਾਲ ਦੌੜਾਂ ਬਣਾਉਂਦੇ ਹਨ। ਇਸ ਪਿੱਚ 'ਤੇ ਔਸਤ ਸਕੋਰ 170 ਦੌੜਾਂ ਹੈ। ਯਾਨੀ ਇੱਕ ਪਾਰੀ ਵਿੱਚ ਇੱਕ ਟੀਮ ਲਗਭਗ 170 ਦੌੜਾਂ ਬਣਾਉਂਦੀ ਹੈ। ਇਹ ਅੰਕੜੇ ਗੇਂਦਬਾਜ਼ਾਂ ਲਈ ਚੰਗੇ ਨਹੀਂ ਹਨ। ਇਸ ਤੋਂ ਇਲਾਵਾ ਟਾਸ ਜਿੱਤਣ ਵਾਲੀ ਟੀਮ ਪਹਿਲਾਂ ਫੀਲਡਿੰਗ ਕਰਨਾ ਚਾਹੇਗੀ। ਪਿਛਲੇ ਰਿਕਾਰਡਾਂ ਮੁਤਾਬਕ ਦੌੜਾਂ ਦਾ ਪਿੱਛਾ ਕਰਨਾ ਆਸਾਨ ਹੈ। ਯਾਨੀ ਟਾਸ ਜਿੱਤਣ ਵਾਲਾ ਕਪਤਾਨ ਪਹਿਲਾਂ ਗੇਂਦਬਾਜ਼ੀ ਕਰਨ ਦਾ ਫੈਸਲਾ ਕਰ ਸਕਦਾ ਹੈ। ਇਸ ਦੇ ਨਾਲ ਹੀ ਇਸ ਵਿਕਟ 'ਤੇ ਗੇਂਦਬਾਜ਼ਾਂ ਨੂੰ ਬਾਊਂਸ ਮਿਲਦਾ ਹੈ, ਜੋ ਬੱਲੇਬਾਜ਼ਾਂ ਲਈ ਚੁਣੌਤੀ ਬਣ ਸਕਦਾ ਹੈ। ਕਦੋਂ, ਕਿੱਥੇ ਅਤੇ ਕਿਵੇਂ ਦੇਖ ਸਕਦੇ ਹੋ ਲਾਈਵ ਸਟ੍ਰੀਮਿੰਗ ਅਤੇ ਪ੍ਰਸਾਰਣ ? googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); ਭਾਰਤ ਅਤੇ ਦੱਖਣੀ ਅਫਰੀਕਾ ਵਿਚਾਲੇ 3 ਟੀ-20 ਮੈਚਾਂ ਦੀ ਸੀਰੀਜ਼ ਦਾ ਪਹਿਲਾ ਮੈਚ ਡਰਬਨ 'ਚ ਖੇਡਿਆ ਜਾਵੇਗਾ। ਦੋਵਾਂ ਟੀਮਾਂ ਵਿਚਾਲੇ ਮੈਚ ਭਾਰਤੀ ਸਮੇਂ ਅਨੁਸਾਰ ਸ਼ਾਮ 7.30 ਵਜੇ ਸ਼ੁਰੂ ਹੋਵੇਗਾ। ਭਾਰਤੀ ਪ੍ਰਸ਼ੰਸਕ ਸਟਾਰ ਸਪੋਰਟਸ ਨੈੱਟਵਰਕ 'ਤੇ ਲਾਈਵ ਪ੍ਰਸਾਰਣ ਦੇਖ ਸਕਣਗੇ। ਇਸ ਤੋਂ ਇਲਾਵਾ ਭਾਰਤ-ਦੱਖਣੀ ਅਫਰੀਕਾ ਸੀਰੀਜ਼ ਦੇ ਮੈਚਾਂ ਦੀ ਲਾਈਵ ਸਟ੍ਰੀਮਿੰਗ ਡਿਜ਼ਨੀ ਪਲੱਸ ਹੌਟਸਟਾਰ 'ਤੇ ਹੋਵੇਗੀ। ਭਾਵ, ਭਾਰਤੀ ਪ੍ਰਸ਼ੰਸਕ Disney Plus Hotstar 'ਤੇ ਲਾਈਵ ਸਟ੍ਰੀਮਿੰਗ ਦੇਖ ਸਕਣਗੇ। ਭਾਰਤੀ ਪ੍ਰਸ਼ੰਸਕ ਡਿਜ਼ਨੀ ਪਲੱਸ ਹੌਟਸਟਾਰ 'ਤੇ ਹਿੰਦੀ ਅਤੇ ਅੰਗਰੇਜ਼ੀ ਤੋਂ ਇਲਾਵਾ ਕਈ ਭਾਸ਼ਾਵਾਂ 'ਚ ਮੈਚ ਦਾ ਆਨੰਦ ਲੈ ਸਕਣਗੇ। ਭਾਰਤ ਦੀ ਸੰਭਾਵਿਤ ਪਲੇਇੰਗ ਇਲੈਵਨ- ਯਸ਼ਸਵੀ ਜੈਸਵਾਲ, ਸ਼ੁਭਮਨ ਗਿੱਲ, ਸ਼੍ਰੇਅਸ ਅਈਅਰ, ਸੂਰਿਆਕੁਮਾਰ ਯਾਦਵ (ਕਪਤਾਨ), ਰਿੰਕੂ ਸਿੰਘ, ਜਿਤੇਸ਼ ਸ਼ਰਮਾ (ਵਿਕਟਕੀਪਰ), ਰਵਿੰਦਰ ਜਡੇਜਾ, ਮੁਕੇਸ਼ ਕੁਮਾਰ, ਰਵੀ ਬਿਸ਼ਨੋਈ, ਮੁਹੰਮਦ ਸਿਰਾਜ ਅਤੇ ਅਰਸ਼ਦੀਪ ਸਿੰਘ । ਦੱਖਣੀ ਅਫਰੀਕਾ ਦੇ ਸੰਭਾਵਿਤ ਪਲੇਇੰਗ ਇਲੈਵਨ- ਰੀਜ਼ਾ ਹੈਂਡਰਿਕਸ, ਮੈਥਿਊ ਬ੍ਰੇਟਜ਼ਕੇ, ਏਡਨ ਮਾਰਕਰਮ (ਕਪਤਾਨ), ਹੇਨਰਿਕ ਕਲਾਸਨ, ਟ੍ਰਿਸਟੀਅਨ ਸਟੱਬਸ, ਡੇਵਿਡ ਮਿਲਰ, ਮਾਰਕੋ ਜੈਨਸਨ, ਗੇਰਾਲਡ ਕੋਏਟਜ਼ੀ, ਕੇਸ਼ਵ ਮਹਾਰਾਜ, ਲਿਜ਼ਾਦ ਵਿਲੀਅਮਜ਼, ਤਬਰੇਜ਼ ਸ਼ਮਸੀ","pubDate":"2023-12-10 03:19:08","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/12/10/34994677bc8ac29b5069b8d53037b7e51702178302287709_original.jpg","source_id":"abplive","source_priority":10959,"country":["india"],"category":["sports"],"language":"punjabi"},{"article_id":"2d5d2ee4144ff8c0be38120b94b5bcdd","title":"IND vs SA: भारत-साउथ अफ्रीका के बीच डरबन में खेला जाएगा सीरीज का पहला टी20, जानिए कैसा रहेगा मौसम का मिजाज","link":"https://www.abplive.com/sports/cricket/durban-weather-forecast-ind-vs-sa-1st-t20-match-latest-sports-news-2557202","keywords":["Cricket"],"creator":["एबीपी लाइव"],"video_url":null,"description":"<p style=\"text-align: justify;\"><strong>IND vs SA T20 Match Weather Forecast:</strong> आज भारत और साउथ अफ्रीका की टीमें डरबन के मैदान पर आमने-सामने होगी. दोनों टीमों के बीच 3 टी20 मैचों की सीरीज खेली जाएगी. इस सीरीज का पहला मुकाबला डरबन में खेला जाएगा. भारतीय समयनुसार मुकाबला शाम 7.30 बजे शुरू होगा. सूर्यकुमार यादव की अगुवाई वाली टीम इंडिया अपनी जीत की लय बरकरार रखने के इरादे से मैदान पर उतरेगी. लेकिन आज डरबन में मौसम का मिजाज कैसा रहेगा? क्या भारत-साउथ अफ्रीका मैच में बारिश विलेन बनेगी?</p> <p style=\"text-align: justify;\"><strong>क्या आज डरबन में बारिश के आसार हैं?</strong></p> <p style=\"text-align: justify;\">भारतीय समयनुसार मुकाबला शाम 7.30 बजे शुरू होगा. लेकिन क्या मैच वक्त बारिश के आसार हैं? मौसम विभाग के मुताबिक, सोमवार सुबह डरबन में तेज बिजली गरजने का अनुमान है. आज शाम डरबन के आसमान में बादल छाए रहेंगे. &nbsp;मौसम विभाग की मानें तो भारत-साउथ अफ्रीका पहले टी20 मैच के दौरान 75 फीसदी बारिश के आसार हैं. वहीं, आज डरबन का तापमान तकरीबन 20 डिग्री सेल्सियस के आसपास रह सकता है. बहरहाल, क्रिकेट फैंस के लिए अच्छी खबर नहीं है. आज खराब मौसम और बारिश की वजह से 3 टी20 मैचों की सीरीज का पहला मुकाबला धुल सकता है.</p> <p style=\"text-align: justify;\"><strong>साउथ अफ्रीका के खिलाफ सीरीज जीतने पर टीम इंडिया की नजरें...</strong></p> <p style=\"text-align: justify;\">इससे पहले सूर्यकुमार यादव की अगुवाई वाली भारतीय टीम ने 5 टी20 मैचों की सीरीज में ऑस्ट्रेलिया को 4-1 से हराया. वहीं, अब भारतीय टीम की नजर साउथ अफ्रीका के खिलाफ टी20 सीरीज फतह करने पर है. इस टी20 सीरीज के बाद दोनों टीमों के बीच वनडे और टेस्ट मैचों की सीरीज खेली जाएगी.</p> <p style=\"text-align: justify;\"><strong>भारत की संभावित प्लेइंग इलेवन-</strong></p> <p style=\"text-align: justify;\">यशस्वी जयसवाल, शुभमन गिल, श्रेयस अय्यर, सूर्यकुमार यादव (कप्तान), रिंकू सिंह, जितेश शर्मा (विकेटकीपर), रवींद्र जड़ेजा, मुकेश कुमार, रवि बिश्नोई, मोहम्मद सिराज और अर्शदीप सिंह.</p> <p style=\"text-align: justify;\"><strong>साउथ अफ्रीका की संभावित प्लेइंग इलेवन-</strong></p> <p style=\"text-align: justify;\">रीज़ा हेंड्रिक्स, मैथ्यू ब्रीट्ज़के, एडेन मार्कराम (कप्तान), हेनरिक क्लासेन, ट्रिस्टियन स्टब्स, डेविड मिलर, मार्को जानसन, गेराल्ड कोएत्ज़ी, केशव महाराज, लिज़ाद विलियम्स और तबरेज़ शम्सी</p> <p style=\"text-align: justify;\"><strong>ये भी पढ़ें-</strong></p> <p style=\"text-align: justify;\"><strong><a href=\"https://www.abplive.com/sports/cricket/jhulan-goswami-says-mumbai-indians-bowlers-can-learn-a-lot-from-shabnim-ismail-wpl-auction-2024-sports-news-2557191\">WPL Auction 2024: मुंबई इंडियंस ने शबनीम इस्माइल पर भारी-भरकम बोली क्यों लगाई? टीम के मेंटर ने किया खुलासा</a></strong></p>","content":"IND vs SA T20 Match Weather Forecast: आज भारत और साउथ अफ्रीका की टीमें डरबन के मैदान पर आमने-सामने होगी. दोनों टीमों के बीच 3 टी20 मैचों की सीरीज खेली जाएगी. इस सीरीज का पहला मुकाबला डरबन में खेला जाएगा. भारतीय समयनुसार मुकाबला शाम 7.30 बजे शुरू होगा. सूर्यकुमार यादव की अगुवाई वाली टीम इंडिया अपनी जीत की लय बरकरार रखने के इरादे से मैदान पर उतरेगी. लेकिन आज डरबन में मौसम का मिजाज कैसा रहेगा? क्या भारत-साउथ अफ्रीका मैच में बारिश विलेन बनेगी? क्या आज डरबन में बारिश के आसार हैं? भारतीय समयनुसार मुकाबला शाम 7.30 बजे शुरू होगा. लेकिन क्या मैच वक्त बारिश के आसार हैं? मौसम विभाग के मुताबिक, सोमवार सुबह डरबन में तेज बिजली गरजने का अनुमान है. आज शाम डरबन के आसमान में बादल छाए रहेंगे. मौसम विभाग की मानें तो भारत-साउथ अफ्रीका पहले टी20 मैच के दौरान 75 फीसदी बारिश के आसार हैं. वहीं, आज डरबन का तापमान तकरीबन 20 डिग्री सेल्सियस के आसपास रह सकता है. बहरहाल, क्रिकेट फैंस के लिए अच्छी खबर नहीं है. आज खराब मौसम और बारिश की वजह से 3 टी20 मैचों की सीरीज का पहला मुकाबला धुल सकता है. साउथ अफ्रीका के खिलाफ सीरीज जीतने पर टीम इंडिया की नजरें... googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); इससे पहले सूर्यकुमार यादव की अगुवाई वाली भारतीय टीम ने 5 टी20 मैचों की सीरीज में ऑस्ट्रेलिया को 4-1 से हराया. वहीं, अब भारतीय टीम की नजर साउथ अफ्रीका के खिलाफ टी20 सीरीज फतह करने पर है. इस टी20 सीरीज के बाद दोनों टीमों के बीच वनडे और टेस्ट मैचों की सीरीज खेली जाएगी. भारत की संभावित प्लेइंग इलेवन- यशस्वी जयसवाल, शुभमन गिल, श्रेयस अय्यर, सूर्यकुमार यादव (कप्तान), रिंकू सिंह, जितेश शर्मा (विकेटकीपर), रवींद्र जड़ेजा, मुकेश कुमार, रवि बिश्नोई, मोहम्मद सिराज और अर्शदीप सिंह. साउथ अफ्रीका की संभावित प्लेइंग इलेवन- रीज़ा हेंड्रिक्स, मैथ्यू ब्रीट्ज़के, एडेन मार्कराम (कप्तान), हेनरिक क्लासेन, ट्रिस्टियन स्टब्स, डेविड मिलर, मार्को जानसन, गेराल्ड कोएत्ज़ी, केशव महाराज, लिज़ाद विलियम्स और तबरेज़ शम्सी ये भी पढ़ें- WPL Auction 2024: मुंबई इंडियंस ने शबनीम इस्माइल पर भारी-भरकम बोली क्यों लगाई? टीम के मेंटर ने किया खुलासा","pubDate":"2023-12-10 03:17:33","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/12/10/dc87a4c7c8a6405cebad632ae1b42e4b1702177648270428_original.jpg","source_id":"abplive","source_priority":10959,"country":["india"],"category":["sports"],"language":"hindi"},{"article_id":"822e7c482a0aad27fe61b5b03da03619","title":"Forde, Carty power Windies to series victory over England","link":"https://www.channelnewsasia.com/sport/forde-carty-power-windies-series-victory-over-england-3978116","keywords":["Sport"],"creator":null,"video_url":null,"description":null,"content":"Best News Website or Mobile Service WAN-IFRA Digital Media Awards Worldwide 2022 Best News Website or Mobile Service Digital Media Awards Worldwide 2022 :Keacy Carty hit a half-century and Matthew Forde took three wickets as West Indies claimed a four-wicket win in the rain-affected third one-day international on Saturday to clinch their first home ODI series victory over England since 1998. Chasing a Duckworth-Lewis (DLS) par score of 188 in 34 overs, West Indies appeared to have gotten off to the perfect start as Carty (50) combined with Alick Athanaze (45) for a 76-run partnership, but spinner Will Jacks tore through their middle order. Jacks (3-22) picked up three key wickets as West Indies slumped from 78-1 to 135-6. With his side reeling, Romario Shepherd hit a crucial knock of 41 to push them over the finish line with 14 balls to spare, though the all-rounder benefited from a massive slice of luck when he was dropped on 18 by Liam Livingstone on the boundary rope. West Indies won the series 2-1, claiming a four-wicket victory in the first match before being beaten by six wickets in the second game. Earlier on Saturday, Forde (3-29) took the wickets of top-order batters Phil Salt, Jacks and Zak Crawley to leave England on 45-3 in an excellent spell on his ODI debut. \"There's a lot of work that goes in behind the scenes. Me and the guys have been training hard in a camp before the series. Obviously getting a victory is a dream come true on my debut,\" Forde said. \"It was special for me. I am 21 and I am living my dream. I thank all the guys for making it possible. They have welcomed me with open arms and it has been an easy camp so far.\" England's innings was rescued by Ben Duckett, whose knock of 71 came off 73 balls, while Liam Livingstone was able to shrug off his recent struggles with the bat to contribute 45 runs. Shepherd removed both Duckett and Livingstone in back-to-back overs to stymie England's progress, with the visitors posting a total of 206 in 40 overs at the Kensington Oval in Barbados. The series victory, West Indies' first over England since 2007, will give the hosts a massive boost after they failed to qualify for the 50-overs World Cup. For England, however, it will raise even more questions about the future of their ODI team, coming off the back of a disappointing World Cup exit. \"This is the start of a long journey for this side,\" said England captain Jos Buttler. \"There are some young guys who have got their first taste of ODI cricket and have hopefully learned lot and can go on and we can build something for the future.\" The two sides next face each other in a five-match Twenty20 series. The first game of the series will be played at the same venue on Tuesday.","pubDate":"2023-12-10 03:17:29","image_url":null,"source_id":"channelnewsasia","source_priority":37829,"country":["singapore"],"category":["sports"],"language":"english"},{"article_id":"ce37fdc9c12471b1de4ea2c608c35c0f","title":"WI vs ENG, 3rd ODI: England slip to series defeat weeks after World Cup flop show","link":"https://www.indiatoday.in/sports/cricket/story/west-indies-vs-england-3rd-odi-score-series-win-matthew-forde-jos-buttler-2474128-2023-12-10?utm_source=rss","keywords":null,"creator":null,"video_url":null,"description":"WI vs ENG, 3rd ODI: England slip to series defeat weeks after World Cup flop show","content":"Listen to Story England woes in the ODI format continued as Jos Buttler's side lost an ODI series 2-1 to the West Indies after a rain-affected series finale in Barbados on Saturday, December 9. Weeks after failing to make a mark in the ODI World Cup in India, the series defeat in the Caribbean only highlights the continued dip in form of the former world champions. For West Indies, it was a much-needed statement of intent after they failed to feature in the ODI World Cup for the first time in their history. After winning the first ODI, West Indies were undone in the second but the young side, led by in-form Shai Hope, stepped up and delivered when it mattered with a fine all-round show. Debutant Matthew Forde was the start of the show for West Indies as he picked up 3 wickets after getting his maiden ODI cap on Saturday. His opening burst of 6 overs where he picked up 3 saw England slipping to 49 for 5. Jos Buttler's struggles continued as the England captain got out for a 0, days after a confidence-boosting fifty in the 2nd ODI. England's batting lineup largely crumbled under pressure, with the likes of Phil Salt, Will Jacks, Jos Buttler and Harry Brook getting out in single-digit scores. However, there were two notable exceptions: Liam Livingstone and Ben Duckett. Livingstone managed to contribute a fighting 45 runs, while Duckett was the top scorer for his team with a commendable 71 runs. England managed just 206 in 40 overs in the rain-reduced game. The West Indies bowlers, on the other hand, shone brightly in this series decider. Matthew Forde, on his debut, had an exceptional start to his international career. He exploited the early moisture on the pitch to take three wickets in his first 25 balls, setting back the English top order significantly. His performance earned him the Player of the Match award on debut. Chasing 188 in 34 overs after more rain interruptions, West Indies lost Brandon King early. However, in-form Alick Athanaze and Keacy Karty stitched 76 runs for the 2nd wicket. Romario Shepherd also played a pivotal role in dismantling the English plans on Saturday His brutal assault included a particularly devastating over where he smashed 24 runs off Gus Atkinson, bringing the West Indies within sight of their victory target.","pubDate":"2023-12-10 03:06:58","image_url":"https://akm-img-a-in.tosshub.com/indiatoday/images/story/202312/matthew-forde-105905398-16x9_0.jpg?VersionId=YAy13_Q3n57qfEqwsTWCkFaf4ci6e1nT","source_id":"indiatoday","source_priority":2885,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"901548d023e5c678a1e8eaaa5e6534b5","title":"हार्दिक पंड्या की वापसी पर बड़ा अपडेट, रोहित की कप्तानी की भी तस्वीरें साफ!","link":"https://hindi.news18.com/cricket/jay-shah-giving-update-on-hardik-pandya-return-and-rohit-sharma-captain-in-wpl-auction-2024-before-ind-vs-sa-t20-7890064.html","keywords":null,"creator":null,"video_url":null,"description":"IND vs SA: साउथ अफ्रीका के खिलाफ टी20 सीरीज के लिए टीम इंडिया पूरी तरह से तैयार है. हार्दिक पंड्या की गैरमौजूदगी में टीम की कमान सूर्यकुमार यादव के हाथों में है. WPL के ऑक्शन में बीसीसीआई सचिव ने हार्दिक की वापसी और रोहित की कप्तानी को लेकर तस्वीरे साफ कर दी हैं.","content":"रोहित शर्मा और हार्दिक पंड्या को लेकर बीसीसीआई सचिव ने बड़ा इशारा किया है. (AP) नई दिल्ली. दुनिया के बेस्ट ऑलराउंडर्स में से एक टीम इंडिया के अहम ऑलराउंडर हार्दिक पंड्या (Hardik Pandya) वर्ल्ड कप के दौरान चोटिल हो गए. भारतीय टीम के लिए हार्दिक एक अहम खिलाड़ी ही नहीं बल्कि टी20 में टीम के कप्तान भी हैं. लेकिन आगामी टी20 वर्ल्ड कप में कप्तानी के लिए रोहित शर्मा पर कयास लगाए जा रहे हैं. हिटमैन ने टी20 वर्ल्ड कप 2022 के बाद छोटे प्रारूप कप्तानी नहीं की है. लेकिन रोहित शर्मा (Rohit Sharma) कैप्टैंसी को लेकर क्या प्लान है और हार्दिक पंड्या कब वापसी कर सकते हैं, इन दोनों सवालों के उत्तर बीसीसीआई (Jay Shah) के सचिव जय शाह ने दे दिए हैं. वुमेन प्रीमियर लीग के ऑक्शन के चलते 9 दिसंबर को माहौल गर्म रहा. इस दौरान जय शाह ने मेंस क्रिकेट टीम के बारे में भी अपने विचार सामने रखे. उन्होंने रोहित शर्मा की कप्तानी को लेकर कहा, ‘अभी स्पष्टता की क्या आवश्यकता है? टी20 वर्ल्ड कप जून में शुरू हो रहा है, हमारे पास उससे पहले आईपीएल है और अफगानिस्तान के खिलाफ टी20 सीरीज है. हम दैनिक आधार पर इसकी निगरानी कर रहे हैं. वह एनसीए में ही है और काफी मेहनत कर रहे हैं. जैसे ही वह फिट होंगे हम आपको उचित समय पर बता देंगे. अफगानिस्तान श्रृंखला से पहले भी फिट हो सकते हैं.’ सूर्या की कप्तानी में होगा टी20 सीरीज का आगाज टीम इंडिया टी20 सीरीज के लिए साउथ अफ्रीका दौरे पर पहुंच चुकी है. टी20 सीरीज का आगाज 10 दिसंबर से हो जाएगा. इस सीरीज में टीम की कप्तानी सूर्यकुमार यादव के हाथों में रहेगी. स्काई एंड कंपनी ने हाल ही में ऑस्ट्रेलिया को टी20 सीरीज में 4-1 से करारी शिकस्त दी. अब देखना दिलचस्प होगा सूर्या साउथ अफ्रीका को उसके घर में मात देने में कामयाब हो पाते हैं या नहीं. 9 साल छोटी हैं इस क्रिकेटर की वाइफ, शादी के लिए बदला था धर्म, खूबसूरती में ऐक्ट्रेस को देती हैं मात टी20 सीरीज के लिए टीम इंडिया यशस्वी जयसवाल, शुभमन गिल, ऋतुराज गायकवाड़, तिलक वर्मा, सूर्यकुमार यादव (कप्तान), रिंकू सिंह, श्रेयस अय्यर, ईशान किशन (विकेटकीपर), जितेश शर्मा (विकेटकीपर), रवींद्र जडेजा (उपकप्तान), वॉशिंगटन सुंदर, रवि बिश्नोई, कुलदीप यादव, अर्शदीप सिंह, मो. सिराज, मुकेश कुमार, दीपक चाहर. . Tags: BCCI , Hardik Pandya , Ind vs sa , Jay Shah , Rohit sharma , Team india मात्र ₹32,400 में मिल रहा है 90 हज़ार वाला तगड़ा iPhone, एंड्रॉयड वाले भी खरीदने लगे ऐपल मोबाइल Kamleshwar Dodiyar: एमपी के इस विधायक का नाम सबकी जुबान पर, PHOTOS से जानिए साइकिल से दिल्ली में टिफिन बांटने व वेटर की नौकरी से लेकर विधायक बनने का सफर कोरोना ने बदल दिया MBBS डॉक्टर का इरादा, पहले प्रयास में बने IAS, ऐसे टॉप की UPSC","pubDate":"2023-12-10 03:06:53","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/12/Rohit-Sharma-and-Hardik-Pandya-AP-2023-12-9b6e150ee3100827beb6b153d0af84c5-3x2.jpg","source_id":"hindinews18","source_priority":6509,"country":["india"],"category":["sports"],"language":"hindi"},{"article_id":"edeb98daf33c826d5aee4497aa18288c","title":"West Indies clinch ODI series against England 2-1 to achieve historic feat at home","link":"https://www.indiatvnews.com/sports/cricket/wi-vs-eng-3rd-odi-west-indies-clinch-odi-series-against-england-2-1-to-achieve-historic-feat-at-home-2023-12-10-906610","keywords":null,"creator":null,"video_url":null,"description":"Debutant Matthew Forde's sensational all-round effort (3/29 and 13* off 16 balls) combined with Romario Shepherd's brilliance with the willow in hand helped West Indies clinch an ODI series against England for the first time since 1998 at home as they sealed the series decider by four wickets (DLS method) at the Kensington Oval in Barbados on Saturday, December 9.","content":"Debutant Matthew Forde's sensational all-round effort (3/29 and 13* off 16 balls) combined with Romario Shepherd's brilliance with the willow in hand helped West Indies clinch an ODI series against England for the first time since 1998 at home as they sealed the series decider by four wickets (DLS method) at the Kensington Oval in Barbados on Saturday, December 9. Player of the Match (POTM) Forde who replaced Oshane Thomas in the playing XI, proved his captain right as he demolished the English top order up front. Forde got the better of Phil Salt, Zack Crawley and Will Jacks who was the star for England in the previous game with the bat in hand to leave the tourists languishing at 3/45. Alzarri Joseph added to England's misery soon as he ran Harry Brook out before he could get his eye in and removed the English skipper for a golden duck with a bumper. Buttler failed to keep the pull shot in control and miscued it as it was held safely by Gudakesh Motie at the fine leg boundary. The Three Lions were five down inside the first ten overs of the game and were starting down the barrel. However, an 88-run stand between Ben Duckett (71 of 73 balls) and Liam Livingstone (45 off 56 deliveries) rescued the 2019 ODI World Cup champions from a precarious situation. Shepherd ended England's resistance as he removed both Duckett and Livingstone within a gap of 16 balls and helped the Men in Maroon claw their way back into the contest. England posted 206 on the board after the rain curtailed the contest to 40 overs per side. The rain came back to halt the contest again and the Windies were asked to chase down a revised target of 188 in 34 overs. The hosts lost Brandon King in the second over but it didn't deter the duo of Alick Athanaze (45 off 51 balls) and Keacy Carty (50 off 58 deliveries) from the task at hand. The pair added 76 runs for the second wicket and laid the foundation of the historic run chase. Despite the stutter in the middle overs that saw Hope, and Sherfane Rutherford getting dismissed cheaply, the Windies got home with four wickets as Shepherd put on a power-hitting masterclass at the end to pull curtains on the ODI leg of the series.","pubDate":"2023-12-10 03:03:26","image_url":"https://resize.indiatvnews.com/en/resize/newbucket/715_-/2023/12/untitled-design-2023-12-10t075610-1702175172.jpg","source_id":"indiatvnews","source_priority":10055,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"32a9dec3985d59bcd6f839fad2639639","title":"'Dripping with sweat': Extreme heat threatens to throw season into chaos","link":"https://www.canberratimes.com.au/story/8454188/cricket-act-extreme-heat-policy-adopted-in-sweltering-conditions/?src=rss","keywords":null,"creator":["Cameron Mee"],"video_url":null,"description":"Cricketers battled stifling conditions on Saturday afternoon.","content":"Club cricketers across the region are bracing for a summer of extreme heat after playing through sweltering conditions on Saturday. Umpires and captains adopted the Cricket ACT heat policy as temperatures soared into the mid-30s. Start times were shifted earlier, additional drinks breaks were held and a priority was placed on hydration and player safety in the stifling conditions. Wests captain Scott Murn it was a challenging afternoon as his side battled the elements in Saturday's win over Ginninderra . \"It was certainly sapping,\" he said. \"It was a lot more humid than we thought it was going to be. You could see the fast bowlers in particular, it was hard work. Even the batters, anyone who batted any length of time was dripping with sweat. \"It's good when we do get a physical challenge, cricket shouldn't be easy.\" As tough as the conditions were, players across the territory felt like they dodged a bullet on Saturday. The mercury only reached 34.6 degrees, 2.4 degrees below the forecast high of 37. Despite this, the situation provided a physical and mental challenge for both batters and bowlers as heat exhaustion and dehydration made playing cricket incredibly tough. Wests' Lachlan Malcolm attempts to cool down in Saturday's heat. Picture by Keegan Carroll Cricket ACT officials were closely monitoring the situation throughout the week and on Saturday and chief executive Olivia Thornton said player safety will always remain a priority. \"It's really important we do take care of our people and an element of common sense prevails,\" she said. \"We're massive advocates for broad-brim hats, long sleeves, sunscreen and staying hydrated. \"We hope people do the right thing from a sun safety perspective.\" While Saturday was bad, there are fears things could get even worse in the new year. With El Nino already declared and long-range forecasts predicting a hot, dry summer, players are bracing for a sweltering January. The long-term implications could be dire, with some experts suggesting the cricket season may need to be shifted away from summer if climate change continues to trigger higher temperatures. It's a tough ask for the lower grades, but many aspirational first grade players are embracing the challenge. Test and first-class cricket have a long history of being played in sweltering conditions and Murn said those with representative hopes are using the heat as an opportunity to send a message to selectors. \"I wouldn't be surprised if we have some very hot days in the second half of the season,\" Murn said. \"Playing two-day cricket, it's a really tough grind for the team that ends up in the field all day. \"That being said, it's a good preparation for guys who want to play a higher level of cricket. Guys who stand out and prove they've got the fitness levels that allow them to perform in all conditions.\" Cricket ACT round 13 Wests 8-230 bt Ginninderra 9-170 (DLS) Queanbeyan 6-134 bt ANU 8-1185 (DLS) Tuggeranong 6-181 bt Weston Creek Molonglo 5-180 Eastlake v North Canberra Gungahlin Abandoned Share Facebook Twitter Whatsapp Email Copy Cameron Mee Sports Journalist Sports reporter at the Canberra Times Sports reporter at the Canberra Times More from Latest News 'Time for renewal': Queensland premier Palaszczuk quits 7m ago 'Dripping with sweat': Extreme heat threatens to throw season into chaos 14m ago No comment s Queensland premier Palaszczuk quits 19m ago Murder probe after woman collapses, dies near home fire 24m ago More from Latest News 'Time for renewal': Queensland premier Palaszczuk quits 7m ago 'Dripping with sweat': Extreme heat threatens to throw season into chaos 14m ago No comment s Queensland premier Palaszczuk quits 19m ago Murder probe after woman collapses, dies near home fire 24m ago US storms and tornadoes leave at least six dead 50m ago Man injured in targeted Melbourne CBD shooting 1hr ago More from Latest News 'Time for renewal': Queensland premier Palaszczuk quits 7m ago 'Dripping with sweat': Extreme heat threatens to throw season into chaos 14m ago No comment s Queensland premier Palaszczuk quits 19m ago Murder probe after woman collapses, dies near home fire 24m ago US storms and tornadoes leave at least six dead 50m ago Man injured in targeted Melbourne CBD shooting 1hr ago","pubDate":"2023-12-10 03:29:00","image_url":"https://www.canberratimes.com.au/images/transform/v1/crop/frm/GzY3iczng7SLWqVgHSV78t/c428b1b6-e5c9-410f-87fc-10a6c46948a7.jpg/r0_133_2587_1590_w600_h338_fmax.jpg","source_id":"canberratimes","source_priority":88737,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"f1d06d77190bb219b37956501c4947cf","title":"Cricket-Forde, Carty power Windies to series victory over England","link":"https://www.thestar.com.my/sport/cricket/2023/12/10/cricket-forde-carty-power-windies-to-series-victory-over-england","keywords":null,"creator":null,"video_url":null,"description":"(Reuters) - Keacy Carty hit a half-century and Matthew Forde took three wickets as West Indies claimed a four-wicket win in the rain-affected third one-day international on Saturday to clinch their first home ODI series victory over England since 1998. Read full story","content":"(Reuters) - Keacy Carty hit a half-century and Matthew Forde took three wickets as West Indies claimed a four-wicket win in the rain-affected third one-day international on Saturday to clinch their first home ODI series victory over England since 1998. Chasing a Duckworth-Lewis (DLS) par score of 188 in 34 overs, Carty (50) combined with Alick Athanaze (45) for a 76-run partnership, before Romario Shepherd hit 41 to help the West Indies get over the finish line with 14 balls to spare. Earlier on Saturday, Forde (3-29) took the wickets of top-order batters Phil Salt, Will Jacks and Zak Crawley to leave England on 45-3 in an excellent spell on his ODI debut. England's innings was rescued by Ben Duckett, whose knock of 71 came off 73 balls, while Liam Livingstone was able to shrug off his recent struggles with the bat to contribute 45 runs as the visitors posted a total of 206 in 40 overs at the Kensington Oval in Barbados. The two sides will face each other in a five-match Twenty20 series, with the first game of the series being played at the same venue on Tuesday. (Reporting by Aadi Nair in Bengaluru; Editing by Shri Navaratnam)","pubDate":"2023-12-10 03:29:00","image_url":null,"source_id":"thestar_my","source_priority":37088,"country":["malaysia"],"category":["sports"],"language":"english"},{"article_id":"605a6f4c5b7018bb3bb0ee748ab350a4","title":"West Indies vs England: Debutant Matthew Forde fires Windies to first ODI series win since 2007","link":"https://www.firstpost.com/firstcricket/sports-news/west-indies-vs-england-debutant-matthew-forde-fires-windies-to-first-odi-series-win-since-2007-13485822.html","keywords":["First Cricket News"],"creator":["Ujwal Singh"],"video_url":null,"description":"West Indies vs England: Debutant Matthew Forde fires Windies to first ODI series win since 2007","content":"Cricket West Indies vs England: Debutant Matthew Forde fires Windies to first ODI series win since 2007 Matthew Forde's all-round heroics propelled West Indies to their first ODI series triumph over England for 16 years and their first at home against these opponents for 25 years. Agence France-Presse December 10, 2023 08:54:42 IST This is West Indies' first ODI series win over England at home in the last 25 years. Image: WICB A dream debut by Matthew Forde helped guide the West Indies to a series-clinching four-wicket win over England in the decisive third and final match of their One-Day International series at Kensington Oval in Barbados on Saturday. In a rain-affected encounter, the 21-year-old Barbadian delighted the few home supporters among a majority English audience with figures of three for 29 as the tourists were restricted to 206 for nine off 40 overs after being put in. Then, with the West Indies stuttering at 135 for six in pursuit of a revised target of 188 off 34 overs, Forde (13 not out) joined Romario Shepherd (41 not out) in an unbroken seventh-wicket stand of 56 to take the Caribbean team to their first ODI series triumph over England for 16 years and their first at home against these opponents for 25 years. Related Articles West Indies vs England: Shai Hope guides Windies to four-wicket win in 1st ODI West Indies vs England: Redemption for Sam Curran as England level series “This is a dream come true,” said an overwhelmed Forde, who was named Man of the Match, in reflecting on his contribution. “The wicket was a bit tacky so it was just about bowling the right line and length. And when I came in to bat, it was just about turning over the strike and getting Sheppy on strike as often as possible.” Brought into the team in place of Oshane Thomas and given use of the new ball, the hometown boy claimed wickets in his first two overs and added a third in his fifth to put England immediately on the back foot. Ben Duckett offered the only substantial resistance with a pugnacious innings of 71, getting meaningful support from Liam Livingstone (45) in a stand of 88 for the sixth wicket after they had slumped to 49 for five in the tenth over. Forde removed Phil Salt to a low catch at mid-off and then had Zak Crawley taken at second slip. He added the wicket of the other opener, Phil Jacks, two overs later via a wicketkeeper’s catch. Jacks was almost the unlikely hero for England with the ball, taking three wickets for 22 runs, including topscorer Keacy Carty for 50, to seem to tilt the balance of the match in his side’s favour. A few short However Jacks and the other slow bowling options Rehan Ahmed and Liam Livingstone could not separate the pair of Shepherd and Forde and when 24 runs were smashed off returning seamer Gus Atkinson in the 30th over, the result was effectively sealed. “We were a few short with the bat,” said England captain Jos Buttler in reflecting on the loss. “We fought hard with the ball but it just wasn’t enough. This is the start of a long journey for this side. Hopefully we can build something for the future.” For West Indies captain Shai Hope, who took the Man of the Series award with a tally of 192 runs at an average of 96 across the three matches, both the result and the contributions of younger players were encouraging. “It’s great to see these other guys chipping in with the bat and as long as we continue in this vein it can develop into a very good batting group,” he said. Join our Whatsapp channel to get the latest global news updates Published on: December 10, 2023 08:54:42 IST Tags: West Indies Vs England","pubDate":"2023-12-10 03:24:42","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/12/West-Indies-vs-England.jpg","source_id":"firstpost","source_priority":5906,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"c833ada2c8c3dfac4c8f6378d0aa435d","title":"India vs South Africa 1st T20I Live Streaming, Venue, Date, Match Timings","link":"https://news.abplive.com/sports/cricket/ind-vs-sa-1st-t20i-live-streaming-telecast-venue-durban-date-match-timings-1648944","keywords":["Cricket"],"creator":["ABP News Bureau"],"video_url":null,"description":"<p><strong>India vs South Africa 1st T20I</strong> <strong>live streaming, venue, match timings, date:</strong> Sunday's blockbuster India vs South Africa 1st T20I in Kingsmead, Durban promises to be an exciting contest.&nbsp;</p> <p><strong>Here's everything you need to know about India vs South Africa 1st T20I 2023 live streaming, date, match timings, venue</strong></p> <p><strong>When will India vs South Africa 1st T20I match be played?</strong></p> <p>India vs South Africa 1st T20I match will take place on Sunday (December 10).</p> <p><strong>Where will India vs South Africa 1st T20I match be played?</strong></p> <p>India vs South Africa 1st T20I match will be played at the Kingsmead, Durban, South Africa.</p> <p><strong>What time will India vs South Africa 1st T20I match start?</strong></p> <p>India vs South Africa 1st T20I match will start at 07:30 PM IST.</p> <p><strong>How to watch India vs South Africa 1st T20I Free Live Streaming on Mobile APP, TV and Laptop?</strong></p> <p>Live telecast of India vs South Africa 1st T20I match in India will be available on Star Sports channels.</p> <p><strong>How to watch Free Live Streaming of India vs South Africa 1st T20I match online?</strong></p> <p><strong>India vs South Africa 1st T20I Live Streaming:</strong> India vs South Africa 1st T20I Free Live Streaming will be available on Disney+ Hotstar app and website.&nbsp;</p>","content":"India vs South Africa 1st T20I live streaming, venue, match timings, date: Sunday's blockbuster India vs South Africa 1st T20I in Kingsmead, Durban promises to be an exciting contest. Following a successful 4-1 series triumph against Australia at home, the Indian men's cricket team, led by Suryakumar Yadav, is set to embark on a high-octane three-match IND vs SA T20I series, commencing this Sunday (December 10). Star players like Shreyas Iyer and Shubman Gill have made comeback to the national team for India vs South Africa T20I series, following a much-needed break. The focus will be on the likes of Yashasvi Jaiswal, Rinku Singh and Ravi Bishnoi. South Africa, on the other hand, dealt with a massive blow as their premier pacer Lungi Ngidi suffered an injury, resulting in him being ruled out for the entire IND vs SA series. The Proteas batters have been in super form lately and will aim to continue the momentum vs India. Here's everything you need to know about India vs South Africa 1st T20I 2023 live streaming, date, match timings, venue When will India vs South Africa 1st T20I match be played? googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); India vs South Africa 1st T20I match will take place on Sunday (December 10). Where will India vs South Africa 1st T20I match be played? India vs South Africa 1st T20I match will be played at the Kingsmead, Durban, South Africa. What time will India vs South Africa 1st T20I match start? India vs South Africa 1st T20I match will start at 07:30 PM IST. How to watch India vs South Africa 1st T20I Free Live Streaming on Mobile APP, TV and Laptop? Live telecast of India vs South Africa 1st T20I match in India will be available on Star Sports channels. How to watch Free Live Streaming of India vs South Africa 1st T20I match online? India vs South Africa 1st T20I Live Streaming: India vs South Africa 1st T20I Free Live Streaming will be available on Disney+ Hotstar app and website.","pubDate":"2023-12-10 03:22:25","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/12/10/92acb0baf4167ea036ff9cd3e0ec5158170217851603224_original.jpg","source_id":"abplive","source_priority":10959,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"6d645bbb38d6c8a69060dbf52b34410b","title":"IND vs SA: ਭਾਰਤ- ਦੱਖਣੀ ਅਫਰੀਕਾ ਵਿਚਾਲੇ ਪਹਿਲਾ ਟੀ-20 ਮੁਕਾਬਲਾ ਅੱਜ, ਜਾਣੋ ਕਿੱਥੇ ਅਤੇ ਕਿਵੇਂ ਵੇਖੋ ਸਕੋਗੇ ਭਿੜਤ ?","link":"https://punjabi.abplive.com/sports/cricket/india-south-africa-1st-t20-match-timing-pitch-report-know-details-763651","keywords":["ਕ੍ਰਿਕਟ"],"creator":["ABP Sanjha"],"video_url":null,"description":"<p><strong>IND vs SA Pitch Report:</strong> ਅੱਜ ਭਾਰਤ ਅਤੇ ਦੱਖਣੀ ਅਫਰੀਕਾ ਵਿਚਾਲੇ 3 ਟੀ-20 ਮੈਚਾਂ ਦੀ ਸੀਰੀਜ਼ ਦਾ ਪਹਿਲਾ ਮੈਚ ਖੇਡਿਆ ਜਾਵੇਗਾ। ਦੋਵੇਂ ਟੀਮਾਂ ਡਰਬਨ ਦੇ ਮੈਦਾਨ 'ਤੇ ਆਹਮੋ-ਸਾਹਮਣੇ ਹੋਣਗੀਆਂ। ਇਹ ਮੈਚ ਭਾਰਤੀ ਸਮੇਂ ਅਨੁਸਾਰ ਸ਼ਾਮ 7.30 ਵਜੇ ਸ਼ੁਰੂ ਹੋਵੇਗਾ। ਭਾਰਤੀ ਟੀਮ ਦੀ ਕਪਤਾਨੀ ਸੂਰਿਆਕੁਮਾਰ ਯਾਦਵ ਕਰਨਗੇ ਜਦਕਿ ਦੱਖਣੀ ਅਫ਼ਰੀਕੀ ਟੀਮ ਦੀ ਅਗਵਾਈ ਏਡੇਨ ਮਾਰਕਰਮ ਕਰਨਗੇ। ਫਿਲਹਾਲ, ਡਰਬਨ ਦੀ ਵਿਕਟ ਕਿਵੇਂ ਹੋਵੇਗੀ? ਕੀ ਇਸ ਵਿਕਟ 'ਤੇ ਬੱਲੇਬਾਜ਼ ਆਸਾਨੀ ਨਾਲ ਦੌੜਾਂ ਬਣਾ ਸਕਣਗੇ ਜਾਂ ਗੇਂਦਬਾਜ਼ ਚੁਣੌਤੀ ਬਣਨਗੇ?</p> <p><strong>ਕੀ ਡਰਬਨ 'ਚ ਬੱਲੇਬਾਜ਼ਾਂ ਲਈ ਗੇਂਦਬਾਜ਼ ਬਣਨਗੇ ਚੁਣੌਤੀ ?</strong></p> <p>ਦਰਅਸਲ, ਅੰਕੜੇ ਦੱਸਦੇ ਹਨ ਕਿ ਡਰਬਨ ਦੀ ਪਿੱਚ 'ਤੇ ਬੱਲੇਬਾਜ਼ ਆਸਾਨੀ ਨਾਲ ਦੌੜਾਂ ਬਣਾਉਂਦੇ ਹਨ। ਇਸ ਪਿੱਚ 'ਤੇ ਔਸਤ ਸਕੋਰ 170 ਦੌੜਾਂ ਹੈ। ਯਾਨੀ ਇੱਕ ਪਾਰੀ ਵਿੱਚ ਇੱਕ ਟੀਮ ਲਗਭਗ 170 ਦੌੜਾਂ ਬਣਾਉਂਦੀ ਹੈ। ਇਹ ਅੰਕੜੇ ਗੇਂਦਬਾਜ਼ਾਂ ਲਈ ਚੰਗੇ ਨਹੀਂ ਹਨ। ਇਸ ਤੋਂ ਇਲਾਵਾ ਟਾਸ ਜਿੱਤਣ ਵਾਲੀ ਟੀਮ ਪਹਿਲਾਂ ਫੀਲਡਿੰਗ ਕਰਨਾ ਚਾਹੇਗੀ। ਪਿਛਲੇ ਰਿਕਾਰਡਾਂ ਮੁਤਾਬਕ ਦੌੜਾਂ ਦਾ ਪਿੱਛਾ ਕਰਨਾ ਆਸਾਨ ਹੈ। ਯਾਨੀ ਟਾਸ ਜਿੱਤਣ ਵਾਲਾ ਕਪਤਾਨ ਪਹਿਲਾਂ ਗੇਂਦਬਾਜ਼ੀ ਕਰਨ ਦਾ ਫੈਸਲਾ ਕਰ ਸਕਦਾ ਹੈ। ਇਸ ਦੇ ਨਾਲ ਹੀ ਇਸ ਵਿਕਟ 'ਤੇ ਗੇਂਦਬਾਜ਼ਾਂ ਨੂੰ ਬਾਊਂਸ ਮਿਲਦਾ ਹੈ, ਜੋ ਬੱਲੇਬਾਜ਼ਾਂ ਲਈ ਚੁਣੌਤੀ ਬਣ ਸਕਦਾ ਹੈ।</p> <p><strong>ਕਦੋਂ, ਕਿੱਥੇ ਅਤੇ ਕਿਵੇਂ ਦੇਖ ਸਕਦੇ ਹੋ ਲਾਈਵ ਸਟ੍ਰੀਮਿੰਗ ਅਤੇ ਪ੍ਰਸਾਰਣ ?</strong></p> <p>ਭਾਰਤ ਅਤੇ ਦੱਖਣੀ ਅਫਰੀਕਾ ਵਿਚਾਲੇ 3 ਟੀ-20 ਮੈਚਾਂ ਦੀ ਸੀਰੀਜ਼ ਦਾ ਪਹਿਲਾ ਮੈਚ ਡਰਬਨ 'ਚ ਖੇਡਿਆ ਜਾਵੇਗਾ। ਦੋਵਾਂ ਟੀਮਾਂ ਵਿਚਾਲੇ ਮੈਚ ਭਾਰਤੀ ਸਮੇਂ ਅਨੁਸਾਰ ਸ਼ਾਮ 7.30 ਵਜੇ ਸ਼ੁਰੂ ਹੋਵੇਗਾ। ਭਾਰਤੀ ਪ੍ਰਸ਼ੰਸਕ ਸਟਾਰ ਸਪੋਰਟਸ ਨੈੱਟਵਰਕ 'ਤੇ ਲਾਈਵ ਪ੍ਰਸਾਰਣ ਦੇਖ ਸਕਣਗੇ। ਇਸ ਤੋਂ ਇਲਾਵਾ ਭਾਰਤ-ਦੱਖਣੀ ਅਫਰੀਕਾ ਸੀਰੀਜ਼ ਦੇ ਮੈਚਾਂ ਦੀ ਲਾਈਵ ਸਟ੍ਰੀਮਿੰਗ ਡਿਜ਼ਨੀ ਪਲੱਸ ਹੌਟਸਟਾਰ 'ਤੇ ਹੋਵੇਗੀ। ਭਾਵ, ਭਾਰਤੀ ਪ੍ਰਸ਼ੰਸਕ Disney Plus Hotstar 'ਤੇ ਲਾਈਵ ਸਟ੍ਰੀਮਿੰਗ ਦੇਖ ਸਕਣਗੇ। ਭਾਰਤੀ ਪ੍ਰਸ਼ੰਸਕ ਡਿਜ਼ਨੀ ਪਲੱਸ ਹੌਟਸਟਾਰ 'ਤੇ ਹਿੰਦੀ ਅਤੇ ਅੰਗਰੇਜ਼ੀ ਤੋਂ ਇਲਾਵਾ ਕਈ ਭਾਸ਼ਾਵਾਂ 'ਚ ਮੈਚ ਦਾ ਆਨੰਦ ਲੈ ਸਕਣਗੇ।</p> <p><strong>ਭਾਰਤ ਦੀ ਸੰਭਾਵਿਤ ਪਲੇਇੰਗ ਇਲੈਵਨ-</strong></p> <p>ਯਸ਼ਸਵੀ ਜੈਸਵਾਲ, ਸ਼ੁਭਮਨ ਗਿੱਲ, ਸ਼੍ਰੇਅਸ ਅਈਅਰ, ਸੂਰਿਆਕੁਮਾਰ ਯਾਦਵ (ਕਪਤਾਨ), ਰਿੰਕੂ ਸਿੰਘ, ਜਿਤੇਸ਼ ਸ਼ਰਮਾ (ਵਿਕਟਕੀਪਰ), ਰਵਿੰਦਰ ਜਡੇਜਾ, ਮੁਕੇਸ਼ ਕੁਮਾਰ, ਰਵੀ ਬਿਸ਼ਨੋਈ, ਮੁਹੰਮਦ ਸਿਰਾਜ ਅਤੇ <a title=\"ਅਰਸ਼ਦੀਪ ਸਿੰਘ\" href=\"https://punjabi.abplive.com/topic/arshdeep-singh\" data-type=\"interlinkingkeywords\">ਅਰਸ਼ਦੀਪ ਸਿੰਘ</a>।</p> <p><strong>ਦੱਖਣੀ ਅਫਰੀਕਾ ਦੇ ਸੰਭਾਵਿਤ ਪਲੇਇੰਗ ਇਲੈਵਨ-</strong></p> <p>ਰੀਜ਼ਾ ਹੈਂਡਰਿਕਸ, ਮੈਥਿਊ ਬ੍ਰੇਟਜ਼ਕੇ, ਏਡਨ ਮਾਰਕਰਮ (ਕਪਤਾਨ), ਹੇਨਰਿਕ ਕਲਾਸਨ, ਟ੍ਰਿਸਟੀਅਨ ਸਟੱਬਸ, ਡੇਵਿਡ ਮਿਲਰ, ਮਾਰਕੋ ਜੈਨਸਨ, ਗੇਰਾਲਡ ਕੋਏਟਜ਼ੀ, ਕੇਸ਼ਵ ਮਹਾਰਾਜ, ਲਿਜ਼ਾਦ ਵਿਲੀਅਮਜ਼, ਤਬਰੇਜ਼ ਸ਼ਮਸੀ</p>","content":"IND vs SA Pitch Report: ਅੱਜ ਭਾਰਤ ਅਤੇ ਦੱਖਣੀ ਅਫਰੀਕਾ ਵਿਚਾਲੇ 3 ਟੀ-20 ਮੈਚਾਂ ਦੀ ਸੀਰੀਜ਼ ਦਾ ਪਹਿਲਾ ਮੈਚ ਖੇਡਿਆ ਜਾਵੇਗਾ। ਦੋਵੇਂ ਟੀਮਾਂ ਡਰਬਨ ਦੇ ਮੈਦਾਨ 'ਤੇ ਆਹਮੋ-ਸਾਹਮਣੇ ਹੋਣਗੀਆਂ। ਇਹ ਮੈਚ ਭਾਰਤੀ ਸਮੇਂ ਅਨੁਸਾਰ ਸ਼ਾਮ 7.30 ਵਜੇ ਸ਼ੁਰੂ ਹੋਵੇਗਾ। ਭਾਰਤੀ ਟੀਮ ਦੀ ਕਪਤਾਨੀ ਸੂਰਿਆਕੁਮਾਰ ਯਾਦਵ ਕਰਨਗੇ ਜਦਕਿ ਦੱਖਣੀ ਅਫ਼ਰੀਕੀ ਟੀਮ ਦੀ ਅਗਵਾਈ ਏਡੇਨ ਮਾਰਕਰਮ ਕਰਨਗੇ। ਫਿਲਹਾਲ, ਡਰਬਨ ਦੀ ਵਿਕਟ ਕਿਵੇਂ ਹੋਵੇਗੀ? ਕੀ ਇਸ ਵਿਕਟ 'ਤੇ ਬੱਲੇਬਾਜ਼ ਆਸਾਨੀ ਨਾਲ ਦੌੜਾਂ ਬਣਾ ਸਕਣਗੇ ਜਾਂ ਗੇਂਦਬਾਜ਼ ਚੁਣੌਤੀ ਬਣਨਗੇ? ਕੀ ਡਰਬਨ 'ਚ ਬੱਲੇਬਾਜ਼ਾਂ ਲਈ ਗੇਂਦਬਾਜ਼ ਬਣਨਗੇ ਚੁਣੌਤੀ ? ਦਰਅਸਲ, ਅੰਕੜੇ ਦੱਸਦੇ ਹਨ ਕਿ ਡਰਬਨ ਦੀ ਪਿੱਚ 'ਤੇ ਬੱਲੇਬਾਜ਼ ਆਸਾਨੀ ਨਾਲ ਦੌੜਾਂ ਬਣਾਉਂਦੇ ਹਨ। ਇਸ ਪਿੱਚ 'ਤੇ ਔਸਤ ਸਕੋਰ 170 ਦੌੜਾਂ ਹੈ। ਯਾਨੀ ਇੱਕ ਪਾਰੀ ਵਿੱਚ ਇੱਕ ਟੀਮ ਲਗਭਗ 170 ਦੌੜਾਂ ਬਣਾਉਂਦੀ ਹੈ। ਇਹ ਅੰਕੜੇ ਗੇਂਦਬਾਜ਼ਾਂ ਲਈ ਚੰਗੇ ਨਹੀਂ ਹਨ। ਇਸ ਤੋਂ ਇਲਾਵਾ ਟਾਸ ਜਿੱਤਣ ਵਾਲੀ ਟੀਮ ਪਹਿਲਾਂ ਫੀਲਡਿੰਗ ਕਰਨਾ ਚਾਹੇਗੀ। ਪਿਛਲੇ ਰਿਕਾਰਡਾਂ ਮੁਤਾਬਕ ਦੌੜਾਂ ਦਾ ਪਿੱਛਾ ਕਰਨਾ ਆਸਾਨ ਹੈ। ਯਾਨੀ ਟਾਸ ਜਿੱਤਣ ਵਾਲਾ ਕਪਤਾਨ ਪਹਿਲਾਂ ਗੇਂਦਬਾਜ਼ੀ ਕਰਨ ਦਾ ਫੈਸਲਾ ਕਰ ਸਕਦਾ ਹੈ। ਇਸ ਦੇ ਨਾਲ ਹੀ ਇਸ ਵਿਕਟ 'ਤੇ ਗੇਂਦਬਾਜ਼ਾਂ ਨੂੰ ਬਾਊਂਸ ਮਿਲਦਾ ਹੈ, ਜੋ ਬੱਲੇਬਾਜ਼ਾਂ ਲਈ ਚੁਣੌਤੀ ਬਣ ਸਕਦਾ ਹੈ। ਕਦੋਂ, ਕਿੱਥੇ ਅਤੇ ਕਿਵੇਂ ਦੇਖ ਸਕਦੇ ਹੋ ਲਾਈਵ ਸਟ੍ਰੀਮਿੰਗ ਅਤੇ ਪ੍ਰਸਾਰਣ ? googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); ਭਾਰਤ ਅਤੇ ਦੱਖਣੀ ਅਫਰੀਕਾ ਵਿਚਾਲੇ 3 ਟੀ-20 ਮੈਚਾਂ ਦੀ ਸੀਰੀਜ਼ ਦਾ ਪਹਿਲਾ ਮੈਚ ਡਰਬਨ 'ਚ ਖੇਡਿਆ ਜਾਵੇਗਾ। ਦੋਵਾਂ ਟੀਮਾਂ ਵਿਚਾਲੇ ਮੈਚ ਭਾਰਤੀ ਸਮੇਂ ਅਨੁਸਾਰ ਸ਼ਾਮ 7.30 ਵਜੇ ਸ਼ੁਰੂ ਹੋਵੇਗਾ। ਭਾਰਤੀ ਪ੍ਰਸ਼ੰਸਕ ਸਟਾਰ ਸਪੋਰਟਸ ਨੈੱਟਵਰਕ 'ਤੇ ਲਾਈਵ ਪ੍ਰਸਾਰਣ ਦੇਖ ਸਕਣਗੇ। ਇਸ ਤੋਂ ਇਲਾਵਾ ਭਾਰਤ-ਦੱਖਣੀ ਅਫਰੀਕਾ ਸੀਰੀਜ਼ ਦੇ ਮੈਚਾਂ ਦੀ ਲਾਈਵ ਸਟ੍ਰੀਮਿੰਗ ਡਿਜ਼ਨੀ ਪਲੱਸ ਹੌਟਸਟਾਰ 'ਤੇ ਹੋਵੇਗੀ। ਭਾਵ, ਭਾਰਤੀ ਪ੍ਰਸ਼ੰਸਕ Disney Plus Hotstar 'ਤੇ ਲਾਈਵ ਸਟ੍ਰੀਮਿੰਗ ਦੇਖ ਸਕਣਗੇ। ਭਾਰਤੀ ਪ੍ਰਸ਼ੰਸਕ ਡਿਜ਼ਨੀ ਪਲੱਸ ਹੌਟਸਟਾਰ 'ਤੇ ਹਿੰਦੀ ਅਤੇ ਅੰਗਰੇਜ਼ੀ ਤੋਂ ਇਲਾਵਾ ਕਈ ਭਾਸ਼ਾਵਾਂ 'ਚ ਮੈਚ ਦਾ ਆਨੰਦ ਲੈ ਸਕਣਗੇ। ਭਾਰਤ ਦੀ ਸੰਭਾਵਿਤ ਪਲੇਇੰਗ ਇਲੈਵਨ- ਯਸ਼ਸਵੀ ਜੈਸਵਾਲ, ਸ਼ੁਭਮਨ ਗਿੱਲ, ਸ਼੍ਰੇਅਸ ਅਈਅਰ, ਸੂਰਿਆਕੁਮਾਰ ਯਾਦਵ (ਕਪਤਾਨ), ਰਿੰਕੂ ਸਿੰਘ, ਜਿਤੇਸ਼ ਸ਼ਰਮਾ (ਵਿਕਟਕੀਪਰ), ਰਵਿੰਦਰ ਜਡੇਜਾ, ਮੁਕੇਸ਼ ਕੁਮਾਰ, ਰਵੀ ਬਿਸ਼ਨੋਈ, ਮੁਹੰਮਦ ਸਿਰਾਜ ਅਤੇ ਅਰਸ਼ਦੀਪ ਸਿੰਘ । ਦੱਖਣੀ ਅਫਰੀਕਾ ਦੇ ਸੰਭਾਵਿਤ ਪਲੇਇੰਗ ਇਲੈਵਨ- ਰੀਜ਼ਾ ਹੈਂਡਰਿਕਸ, ਮੈਥਿਊ ਬ੍ਰੇਟਜ਼ਕੇ, ਏਡਨ ਮਾਰਕਰਮ (ਕਪਤਾਨ), ਹੇਨਰਿਕ ਕਲਾਸਨ, ਟ੍ਰਿਸਟੀਅਨ ਸਟੱਬਸ, ਡੇਵਿਡ ਮਿਲਰ, ਮਾਰਕੋ ਜੈਨਸਨ, ਗੇਰਾਲਡ ਕੋਏਟਜ਼ੀ, ਕੇਸ਼ਵ ਮਹਾਰਾਜ, ਲਿਜ਼ਾਦ ਵਿਲੀਅਮਜ਼, ਤਬਰੇਜ਼ ਸ਼ਮਸੀ","pubDate":"2023-12-10 03:19:08","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/12/10/34994677bc8ac29b5069b8d53037b7e51702178302287709_original.jpg","source_id":"abplive","source_priority":10959,"country":["india"],"category":["sports"],"language":"punjabi"},{"article_id":"2d5d2ee4144ff8c0be38120b94b5bcdd","title":"IND vs SA: भारत-साउथ अफ्रीका के बीच डरबन में खेला जाएगा सीरीज का पहला टी20, जानिए कैसा रहेगा मौसम का मिजाज","link":"https://www.abplive.com/sports/cricket/durban-weather-forecast-ind-vs-sa-1st-t20-match-latest-sports-news-2557202","keywords":["Cricket"],"creator":["एबीपी लाइव"],"video_url":null,"description":"<p style=\"text-align: justify;\"><strong>IND vs SA T20 Match Weather Forecast:</strong> आज भारत और साउथ अफ्रीका की टीमें डरबन के मैदान पर आमने-सामने होगी. दोनों टीमों के बीच 3 टी20 मैचों की सीरीज खेली जाएगी. इस सीरीज का पहला मुकाबला डरबन में खेला जाएगा. भारतीय समयनुसार मुकाबला शाम 7.30 बजे शुरू होगा. सूर्यकुमार यादव की अगुवाई वाली टीम इंडिया अपनी जीत की लय बरकरार रखने के इरादे से मैदान पर उतरेगी. लेकिन आज डरबन में मौसम का मिजाज कैसा रहेगा? क्या भारत-साउथ अफ्रीका मैच में बारिश विलेन बनेगी?</p> <p style=\"text-align: justify;\"><strong>क्या आज डरबन में बारिश के आसार हैं?</strong></p> <p style=\"text-align: justify;\">भारतीय समयनुसार मुकाबला शाम 7.30 बजे शुरू होगा. लेकिन क्या मैच वक्त बारिश के आसार हैं? मौसम विभाग के मुताबिक, सोमवार सुबह डरबन में तेज बिजली गरजने का अनुमान है. आज शाम डरबन के आसमान में बादल छाए रहेंगे. &nbsp;मौसम विभाग की मानें तो भारत-साउथ अफ्रीका पहले टी20 मैच के दौरान 75 फीसदी बारिश के आसार हैं. वहीं, आज डरबन का तापमान तकरीबन 20 डिग्री सेल्सियस के आसपास रह सकता है. बहरहाल, क्रिकेट फैंस के लिए अच्छी खबर नहीं है. आज खराब मौसम और बारिश की वजह से 3 टी20 मैचों की सीरीज का पहला मुकाबला धुल सकता है.</p> <p style=\"text-align: justify;\"><strong>साउथ अफ्रीका के खिलाफ सीरीज जीतने पर टीम इंडिया की नजरें...</strong></p> <p style=\"text-align: justify;\">इससे पहले सूर्यकुमार यादव की अगुवाई वाली भारतीय टीम ने 5 टी20 मैचों की सीरीज में ऑस्ट्रेलिया को 4-1 से हराया. वहीं, अब भारतीय टीम की नजर साउथ अफ्रीका के खिलाफ टी20 सीरीज फतह करने पर है. इस टी20 सीरीज के बाद दोनों टीमों के बीच वनडे और टेस्ट मैचों की सीरीज खेली जाएगी.</p> <p style=\"text-align: justify;\"><strong>भारत की संभावित प्लेइंग इलेवन-</strong></p> <p style=\"text-align: justify;\">यशस्वी जयसवाल, शुभमन गिल, श्रेयस अय्यर, सूर्यकुमार यादव (कप्तान), रिंकू सिंह, जितेश शर्मा (विकेटकीपर), रवींद्र जड़ेजा, मुकेश कुमार, रवि बिश्नोई, मोहम्मद सिराज और अर्शदीप सिंह.</p> <p style=\"text-align: justify;\"><strong>साउथ अफ्रीका की संभावित प्लेइंग इलेवन-</strong></p> <p style=\"text-align: justify;\">रीज़ा हेंड्रिक्स, मैथ्यू ब्रीट्ज़के, एडेन मार्कराम (कप्तान), हेनरिक क्लासेन, ट्रिस्टियन स्टब्स, डेविड मिलर, मार्को जानसन, गेराल्ड कोएत्ज़ी, केशव महाराज, लिज़ाद विलियम्स और तबरेज़ शम्सी</p> <p style=\"text-align: justify;\"><strong>ये भी पढ़ें-</strong></p> <p style=\"text-align: justify;\"><strong><a href=\"https://www.abplive.com/sports/cricket/jhulan-goswami-says-mumbai-indians-bowlers-can-learn-a-lot-from-shabnim-ismail-wpl-auction-2024-sports-news-2557191\">WPL Auction 2024: मुंबई इंडियंस ने शबनीम इस्माइल पर भारी-भरकम बोली क्यों लगाई? टीम के मेंटर ने किया खुलासा</a></strong></p>","content":"IND vs SA T20 Match Weather Forecast: आज भारत और साउथ अफ्रीका की टीमें डरबन के मैदान पर आमने-सामने होगी. दोनों टीमों के बीच 3 टी20 मैचों की सीरीज खेली जाएगी. इस सीरीज का पहला मुकाबला डरबन में खेला जाएगा. भारतीय समयनुसार मुकाबला शाम 7.30 बजे शुरू होगा. सूर्यकुमार यादव की अगुवाई वाली टीम इंडिया अपनी जीत की लय बरकरार रखने के इरादे से मैदान पर उतरेगी. लेकिन आज डरबन में मौसम का मिजाज कैसा रहेगा? क्या भारत-साउथ अफ्रीका मैच में बारिश विलेन बनेगी? क्या आज डरबन में बारिश के आसार हैं? भारतीय समयनुसार मुकाबला शाम 7.30 बजे शुरू होगा. लेकिन क्या मैच वक्त बारिश के आसार हैं? मौसम विभाग के मुताबिक, सोमवार सुबह डरबन में तेज बिजली गरजने का अनुमान है. आज शाम डरबन के आसमान में बादल छाए रहेंगे. मौसम विभाग की मानें तो भारत-साउथ अफ्रीका पहले टी20 मैच के दौरान 75 फीसदी बारिश के आसार हैं. वहीं, आज डरबन का तापमान तकरीबन 20 डिग्री सेल्सियस के आसपास रह सकता है. बहरहाल, क्रिकेट फैंस के लिए अच्छी खबर नहीं है. आज खराब मौसम और बारिश की वजह से 3 टी20 मैचों की सीरीज का पहला मुकाबला धुल सकता है. साउथ अफ्रीका के खिलाफ सीरीज जीतने पर टीम इंडिया की नजरें... googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); इससे पहले सूर्यकुमार यादव की अगुवाई वाली भारतीय टीम ने 5 टी20 मैचों की सीरीज में ऑस्ट्रेलिया को 4-1 से हराया. वहीं, अब भारतीय टीम की नजर साउथ अफ्रीका के खिलाफ टी20 सीरीज फतह करने पर है. इस टी20 सीरीज के बाद दोनों टीमों के बीच वनडे और टेस्ट मैचों की सीरीज खेली जाएगी. भारत की संभावित प्लेइंग इलेवन- यशस्वी जयसवाल, शुभमन गिल, श्रेयस अय्यर, सूर्यकुमार यादव (कप्तान), रिंकू सिंह, जितेश शर्मा (विकेटकीपर), रवींद्र जड़ेजा, मुकेश कुमार, रवि बिश्नोई, मोहम्मद सिराज और अर्शदीप सिंह. साउथ अफ्रीका की संभावित प्लेइंग इलेवन- रीज़ा हेंड्रिक्स, मैथ्यू ब्रीट्ज़के, एडेन मार्कराम (कप्तान), हेनरिक क्लासेन, ट्रिस्टियन स्टब्स, डेविड मिलर, मार्को जानसन, गेराल्ड कोएत्ज़ी, केशव महाराज, लिज़ाद विलियम्स और तबरेज़ शम्सी ये भी पढ़ें- WPL Auction 2024: मुंबई इंडियंस ने शबनीम इस्माइल पर भारी-भरकम बोली क्यों लगाई? टीम के मेंटर ने किया खुलासा","pubDate":"2023-12-10 03:17:33","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/12/10/dc87a4c7c8a6405cebad632ae1b42e4b1702177648270428_original.jpg","source_id":"abplive","source_priority":10959,"country":["india"],"category":["sports"],"language":"hindi"},{"article_id":"822e7c482a0aad27fe61b5b03da03619","title":"Forde, Carty power Windies to series victory over England","link":"https://www.channelnewsasia.com/sport/forde-carty-power-windies-series-victory-over-england-3978116","keywords":["Sport"],"creator":null,"video_url":null,"description":null,"content":"Best News Website or Mobile Service WAN-IFRA Digital Media Awards Worldwide 2022 Best News Website or Mobile Service Digital Media Awards Worldwide 2022 :Keacy Carty hit a half-century and Matthew Forde took three wickets as West Indies claimed a four-wicket win in the rain-affected third one-day international on Saturday to clinch their first home ODI series victory over England since 1998. Chasing a Duckworth-Lewis (DLS) par score of 188 in 34 overs, West Indies appeared to have gotten off to the perfect start as Carty (50) combined with Alick Athanaze (45) for a 76-run partnership, but spinner Will Jacks tore through their middle order. Jacks (3-22) picked up three key wickets as West Indies slumped from 78-1 to 135-6. With his side reeling, Romario Shepherd hit a crucial knock of 41 to push them over the finish line with 14 balls to spare, though the all-rounder benefited from a massive slice of luck when he was dropped on 18 by Liam Livingstone on the boundary rope. West Indies won the series 2-1, claiming a four-wicket victory in the first match before being beaten by six wickets in the second game. Earlier on Saturday, Forde (3-29) took the wickets of top-order batters Phil Salt, Jacks and Zak Crawley to leave England on 45-3 in an excellent spell on his ODI debut. \"There's a lot of work that goes in behind the scenes. Me and the guys have been training hard in a camp before the series. Obviously getting a victory is a dream come true on my debut,\" Forde said. \"It was special for me. I am 21 and I am living my dream. I thank all the guys for making it possible. They have welcomed me with open arms and it has been an easy camp so far.\" England's innings was rescued by Ben Duckett, whose knock of 71 came off 73 balls, while Liam Livingstone was able to shrug off his recent struggles with the bat to contribute 45 runs. Shepherd removed both Duckett and Livingstone in back-to-back overs to stymie England's progress, with the visitors posting a total of 206 in 40 overs at the Kensington Oval in Barbados. The series victory, West Indies' first over England since 2007, will give the hosts a massive boost after they failed to qualify for the 50-overs World Cup. For England, however, it will raise even more questions about the future of their ODI team, coming off the back of a disappointing World Cup exit. \"This is the start of a long journey for this side,\" said England captain Jos Buttler. \"There are some young guys who have got their first taste of ODI cricket and have hopefully learned lot and can go on and we can build something for the future.\" The two sides next face each other in a five-match Twenty20 series. The first game of the series will be played at the same venue on Tuesday.","pubDate":"2023-12-10 03:17:29","image_url":null,"source_id":"channelnewsasia","source_priority":37829,"country":["singapore"],"category":["sports"],"language":"english"},{"article_id":"ce37fdc9c12471b1de4ea2c608c35c0f","title":"WI vs ENG, 3rd ODI: England slip to series defeat weeks after World Cup flop show","link":"https://www.indiatoday.in/sports/cricket/story/west-indies-vs-england-3rd-odi-score-series-win-matthew-forde-jos-buttler-2474128-2023-12-10?utm_source=rss","keywords":null,"creator":null,"video_url":null,"description":"WI vs ENG, 3rd ODI: England slip to series defeat weeks after World Cup flop show","content":"Listen to Story England woes in the ODI format continued as Jos Buttler's side lost an ODI series 2-1 to the West Indies after a rain-affected series finale in Barbados on Saturday, December 9. Weeks after failing to make a mark in the ODI World Cup in India, the series defeat in the Caribbean only highlights the continued dip in form of the former world champions. For West Indies, it was a much-needed statement of intent after they failed to feature in the ODI World Cup for the first time in their history. After winning the first ODI, West Indies were undone in the second but the young side, led by in-form Shai Hope, stepped up and delivered when it mattered with a fine all-round show. Debutant Matthew Forde was the start of the show for West Indies as he picked up 3 wickets after getting his maiden ODI cap on Saturday. His opening burst of 6 overs where he picked up 3 saw England slipping to 49 for 5. Jos Buttler's struggles continued as the England captain got out for a 0, days after a confidence-boosting fifty in the 2nd ODI. England's batting lineup largely crumbled under pressure, with the likes of Phil Salt, Will Jacks, Jos Buttler and Harry Brook getting out in single-digit scores. However, there were two notable exceptions: Liam Livingstone and Ben Duckett. Livingstone managed to contribute a fighting 45 runs, while Duckett was the top scorer for his team with a commendable 71 runs. England managed just 206 in 40 overs in the rain-reduced game. The West Indies bowlers, on the other hand, shone brightly in this series decider. Matthew Forde, on his debut, had an exceptional start to his international career. He exploited the early moisture on the pitch to take three wickets in his first 25 balls, setting back the English top order significantly. His performance earned him the Player of the Match award on debut. Chasing 188 in 34 overs after more rain interruptions, West Indies lost Brandon King early. However, in-form Alick Athanaze and Keacy Karty stitched 76 runs for the 2nd wicket. Romario Shepherd also played a pivotal role in dismantling the English plans on Saturday His brutal assault included a particularly devastating over where he smashed 24 runs off Gus Atkinson, bringing the West Indies within sight of their victory target.","pubDate":"2023-12-10 03:06:58","image_url":"https://akm-img-a-in.tosshub.com/indiatoday/images/story/202312/matthew-forde-105905398-16x9_0.jpg?VersionId=YAy13_Q3n57qfEqwsTWCkFaf4ci6e1nT","source_id":"indiatoday","source_priority":2885,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"901548d023e5c678a1e8eaaa5e6534b5","title":"हार्दिक पंड्या की वापसी पर बड़ा अपडेट, रोहित की कप्तानी की भी तस्वीरें साफ!","link":"https://hindi.news18.com/cricket/jay-shah-giving-update-on-hardik-pandya-return-and-rohit-sharma-captain-in-wpl-auction-2024-before-ind-vs-sa-t20-7890064.html","keywords":null,"creator":null,"video_url":null,"description":"IND vs SA: साउथ अफ्रीका के खिलाफ टी20 सीरीज के लिए टीम इंडिया पूरी तरह से तैयार है. हार्दिक पंड्या की गैरमौजूदगी में टीम की कमान सूर्यकुमार यादव के हाथों में है. WPL के ऑक्शन में बीसीसीआई सचिव ने हार्दिक की वापसी और रोहित की कप्तानी को लेकर तस्वीरे साफ कर दी हैं.","content":"रोहित शर्मा और हार्दिक पंड्या को लेकर बीसीसीआई सचिव ने बड़ा इशारा किया है. (AP) नई दिल्ली. दुनिया के बेस्ट ऑलराउंडर्स में से एक टीम इंडिया के अहम ऑलराउंडर हार्दिक पंड्या (Hardik Pandya) वर्ल्ड कप के दौरान चोटिल हो गए. भारतीय टीम के लिए हार्दिक एक अहम खिलाड़ी ही नहीं बल्कि टी20 में टीम के कप्तान भी हैं. लेकिन आगामी टी20 वर्ल्ड कप में कप्तानी के लिए रोहित शर्मा पर कयास लगाए जा रहे हैं. हिटमैन ने टी20 वर्ल्ड कप 2022 के बाद छोटे प्रारूप कप्तानी नहीं की है. लेकिन रोहित शर्मा (Rohit Sharma) कैप्टैंसी को लेकर क्या प्लान है और हार्दिक पंड्या कब वापसी कर सकते हैं, इन दोनों सवालों के उत्तर बीसीसीआई (Jay Shah) के सचिव जय शाह ने दे दिए हैं. वुमेन प्रीमियर लीग के ऑक्शन के चलते 9 दिसंबर को माहौल गर्म रहा. इस दौरान जय शाह ने मेंस क्रिकेट टीम के बारे में भी अपने विचार सामने रखे. उन्होंने रोहित शर्मा की कप्तानी को लेकर कहा, ‘अभी स्पष्टता की क्या आवश्यकता है? टी20 वर्ल्ड कप जून में शुरू हो रहा है, हमारे पास उससे पहले आईपीएल है और अफगानिस्तान के खिलाफ टी20 सीरीज है. हम दैनिक आधार पर इसकी निगरानी कर रहे हैं. वह एनसीए में ही है और काफी मेहनत कर रहे हैं. जैसे ही वह फिट होंगे हम आपको उचित समय पर बता देंगे. अफगानिस्तान श्रृंखला से पहले भी फिट हो सकते हैं.’ सूर्या की कप्तानी में होगा टी20 सीरीज का आगाज टीम इंडिया टी20 सीरीज के लिए साउथ अफ्रीका दौरे पर पहुंच चुकी है. टी20 सीरीज का आगाज 10 दिसंबर से हो जाएगा. इस सीरीज में टीम की कप्तानी सूर्यकुमार यादव के हाथों में रहेगी. स्काई एंड कंपनी ने हाल ही में ऑस्ट्रेलिया को टी20 सीरीज में 4-1 से करारी शिकस्त दी. अब देखना दिलचस्प होगा सूर्या साउथ अफ्रीका को उसके घर में मात देने में कामयाब हो पाते हैं या नहीं. 9 साल छोटी हैं इस क्रिकेटर की वाइफ, शादी के लिए बदला था धर्म, खूबसूरती में ऐक्ट्रेस को देती हैं मात टी20 सीरीज के लिए टीम इंडिया यशस्वी जयसवाल, शुभमन गिल, ऋतुराज गायकवाड़, तिलक वर्मा, सूर्यकुमार यादव (कप्तान), रिंकू सिंह, श्रेयस अय्यर, ईशान किशन (विकेटकीपर), जितेश शर्मा (विकेटकीपर), रवींद्र जडेजा (उपकप्तान), वॉशिंगटन सुंदर, रवि बिश्नोई, कुलदीप यादव, अर्शदीप सिंह, मो. सिराज, मुकेश कुमार, दीपक चाहर. . Tags: BCCI , Hardik Pandya , Ind vs sa , Jay Shah , Rohit sharma , Team india मात्र ₹32,400 में मिल रहा है 90 हज़ार वाला तगड़ा iPhone, एंड्रॉयड वाले भी खरीदने लगे ऐपल मोबाइल Kamleshwar Dodiyar: एमपी के इस विधायक का नाम सबकी जुबान पर, PHOTOS से जानिए साइकिल से दिल्ली में टिफिन बांटने व वेटर की नौकरी से लेकर विधायक बनने का सफर कोरोना ने बदल दिया MBBS डॉक्टर का इरादा, पहले प्रयास में बने IAS, ऐसे टॉप की UPSC","pubDate":"2023-12-10 03:06:53","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/12/Rohit-Sharma-and-Hardik-Pandya-AP-2023-12-9b6e150ee3100827beb6b153d0af84c5-3x2.jpg","source_id":"hindinews18","source_priority":6509,"country":["india"],"category":["sports"],"language":"hindi"},{"article_id":"edeb98daf33c826d5aee4497aa18288c","title":"West Indies clinch ODI series against England 2-1 to achieve historic feat at home","link":"https://www.indiatvnews.com/sports/cricket/wi-vs-eng-3rd-odi-west-indies-clinch-odi-series-against-england-2-1-to-achieve-historic-feat-at-home-2023-12-10-906610","keywords":null,"creator":null,"video_url":null,"description":"Debutant Matthew Forde's sensational all-round effort (3/29 and 13* off 16 balls) combined with Romario Shepherd's brilliance with the willow in hand helped West Indies clinch an ODI series against England for the first time since 1998 at home as they sealed the series decider by four wickets (DLS method) at the Kensington Oval in Barbados on Saturday, December 9.","content":"Debutant Matthew Forde's sensational all-round effort (3/29 and 13* off 16 balls) combined with Romario Shepherd's brilliance with the willow in hand helped West Indies clinch an ODI series against England for the first time since 1998 at home as they sealed the series decider by four wickets (DLS method) at the Kensington Oval in Barbados on Saturday, December 9. Player of the Match (POTM) Forde who replaced Oshane Thomas in the playing XI, proved his captain right as he demolished the English top order up front. Forde got the better of Phil Salt, Zack Crawley and Will Jacks who was the star for England in the previous game with the bat in hand to leave the tourists languishing at 3/45. Alzarri Joseph added to England's misery soon as he ran Harry Brook out before he could get his eye in and removed the English skipper for a golden duck with a bumper. Buttler failed to keep the pull shot in control and miscued it as it was held safely by Gudakesh Motie at the fine leg boundary. The Three Lions were five down inside the first ten overs of the game and were starting down the barrel. However, an 88-run stand between Ben Duckett (71 of 73 balls) and Liam Livingstone (45 off 56 deliveries) rescued the 2019 ODI World Cup champions from a precarious situation. Shepherd ended England's resistance as he removed both Duckett and Livingstone within a gap of 16 balls and helped the Men in Maroon claw their way back into the contest. England posted 206 on the board after the rain curtailed the contest to 40 overs per side. The rain came back to halt the contest again and the Windies were asked to chase down a revised target of 188 in 34 overs. The hosts lost Brandon King in the second over but it didn't deter the duo of Alick Athanaze (45 off 51 balls) and Keacy Carty (50 off 58 deliveries) from the task at hand. The pair added 76 runs for the second wicket and laid the foundation of the historic run chase. Despite the stutter in the middle overs that saw Hope, and Sherfane Rutherford getting dismissed cheaply, the Windies got home with four wickets as Shepherd put on a power-hitting masterclass at the end to pull curtains on the ODI leg of the series.","pubDate":"2023-12-10 03:03:26","image_url":"https://resize.indiatvnews.com/en/resize/newbucket/715_-/2023/12/untitled-design-2023-12-10t075610-1702175172.jpg","source_id":"indiatvnews","source_priority":10055,"country":["india"],"category":["sports"],"language":"english"}]}