{"newsArray":[{"title":"Premier Cricket Standings & Top Performers","link":"https://bernews.com/2023/05/bermuda-premier-cricket-standings-top-performers/","keywords":["All","Sports","#BermudaCricket"],"creator":["temp"],"video_url":null,"description":"After the first week of Bermuda Premier Division Cricket action, we take a look at the top performers and the league standings. Terryn Fray from Bailey’s bay was the only batsman to score a half Century with a knock of 52, while Dion Stovell from Cleveland County was the weekends top bowlers with figures of […]","content":"After the first week of Bermuda Premier Division action, we take a look at the top performers and the league standings. Terryn Fray from Bailey’s bay was the only batsman to score a half Century with a knock of 52, while Dion Stovell from Cleveland County was the weekends top bowlers with figures of 9.3-1-30-7. Cleveland County are the League leaders on net run rate over the St. George’s Cricket Club and Bailey’s Bay, all three teams have 10 points. Cleveland County has a Net Run Rate of 4.541, the St. George’s Cricket Club has a net run rate of 1.900. : ,","pubDate":"2023-05-03 23:00:39","image_url":null,"source_id":"bernews","category":["sports"],"country":["Bermuda"],"language":"english"},{"title":"Man Who Ran Away From Delhi Cricket…, Gautam Gambhir Posts Cryptic Tweet","link":"https://www.thetimesofbengal.com/sports/man-who-ran-away-from-delhi-cricket-gautam-gambhir-posts-cryptic-tweet/","keywords":["Sports"],"creator":["admin"],"video_url":null,"description":"Home Sports ‘Man Who Ran Away From Delhi Cricket…’, Gautam Gambhir Posts Cryptic Tweet Former India cricketer and the current mentor of IPL franchise Lucknow Super Giants, Gautam Gambhir, who has been in the eye of storm since his on-field confrontation with Royal Challengers Bangalores Virat Kohli, posted a cryptic tweet on Wednesday, leaving cricket […]","content":"New Delhi, May 4: Former India cricketer and the current mentor of IPL franchise Lucknow Super Giants, Gautam Gambhir, who has been in the eye of storm since his on-field confrontation with Royal Challengers Bangalores Virat Kohli, posted a cryptic tweet on Wednesday, leaving cricket fans puzzled. The BJP MP took to his official Twitter handle to share a post, where he wrote: “Man who ran away from Delhi Cricket citing ‘pressure’ seems over eager to sell paid PR as concern for cricket! Yahi Kalyug Hai, Jaha Bhagode’ Apni Adalat Chalate Hai! (This is Kalyug where ‘fugitives’ run their ‘court’).” However, it was not clear as to who Gambhir was referring to. The rivalry between Gambhir and Kohli reignited on Monday when they came face-to-face after the RCB vs LSG match. Gambhir and Kohli were seen arguing over an incident that developed during the match. Kohli was deeply agitated during LSG’s innings and was even involved in a couple of ugly face-offs with Naveen-ul-Haq and Amit Mishra of LSG. An eyewitness, who was in one of the team dug-outs, gave a lowdown of events to PTI. “You saw on TV that Mayers and Virat were walking side by side for a few metres post match. Mayers asked Kohli why was he constantly abusing them and Virat, in turn, questioned why was he (Mayers) ‘staring’ at him? Before that (Amit) Mishra had complained to umpire about Virat constantly abusing Naveen (ul-Haq), who is a No. 10 batter. “Gautam, sensing that things could turn ugly, pulled Mayers and told him not to have a conversation, when Virat made a comment. The heated exchange that followed seemed a bit juvenile,” he said. “Gautam asked ‘Kya bol raha hain bol’ (What were you saying?) and Virat replied, ‘Maine aapko kuch bola hi naahin, aap kyon ghus rahein ho’ (Why are you coming in between when I haven’t told you anything). “Gautam responded, ‘Tuney agar mere player ko bola hai, matlab tune meri family ko gaali diya hai. (You abused my player and that’s like abusing my family) and Virat’s reply was, ‘Toh aap apne family ko sambhal ke rakhiye’. (Then you take care of your family). “Gambhir’s final reply before they were separated was, ‘Toh ab tu mujhe sikhayega…’ (So now I have to learn from you…).” The eyewitness said that while it was tense and a blow away from turning into a free-for-all, it all seemed a bit juvenile at both ends. (With Agency Inputs) $(document).ready(function(){ $('#commentbtn').on(\"click\",function(){ (function(d, s, id) { var js, fjs = d.getElementsByTagName(s)[0]; if (d.getElementById(id)) return; js = d.createElement(s); js.id = id; js.src = \"https://connect.facebook.net/en_US/all.js#xfbml=1&appId=178196885542208\"; fjs.parentNode.insertBefore(js, fjs); }(document, 'script', 'facebook-jssdk')); $(\".cmntbox\").toggle(); }); }); Source link","pubDate":"2023-05-03 21:17:49","image_url":null,"source_id":"the_tob","category":["sports"],"country":["india"],"language":"english"},{"title":"Fastest women’s bowler Shabnim Ismail retires from international cricket","link":"https://a-sports.tv/fastest-women-bowler-shabnim-ismail-retires/","keywords":["Cricket","Sports","Top News","Top Picks","Shabnim Ismail"],"creator":["AFP"],"video_url":null,"description":"South African fast bowler Shabnim Ismail, who is credited with sending down the quickest delivery in women’s cricket, announced her retirement from the international game on Wednesday. During the T20 World Cup semi-final against England in Cape Town in February she bowled a 128kmh (80mph) delivery – the fastest recorded in the women’s game. Shabnim […] The post Fastest women’s bowler Shabnim Ismail retires from international cricket appeared first on ASports.tv.","content":"During the T20 World Cup semi-final against England in Cape Town in February she bowled a 128kmh (80mph) delivery – the fastest recorded in the women’s game. Shabnim Ismail, 34, said in a statement issued by Cricket South Africa that she wanted to spend more time with her family but would continue to be available to play in domestic Twenty20 tournaments around the world. She ended her international career on a high when she was a member of the first South African team, men or women, to reach a World Cup final. She took two for 26 in the final against Australia in Cape Town but it was not enough to prevent Australia winning their fifth title. Ismail made her international debut as a teenager in 2007 and went on to appear in 241 international matches. She took 191 wickets in 127 one-day internationals, second only to India’s Jhulan Goswami, and took 123 wickets in T20 internationals to be fourth on the all-time list. She took three wickets in her only Test match against the Netherlands in 2007. She missed South Africa’s one-off Test in England in 2022 because of injury. “As any athlete knows, training and competing at your best requires much sacrifice and dedication, and I now find myself wanting to spend more time with my family, particularly my siblings and parents as they get older,” Ismail said in her statement.","pubDate":"2023-05-03 19:34:54","image_url":null,"source_id":"arynews","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"IPL 2023: Punjab dazzle; Mumbai out-dazzles","link":"https://indianexpress.com/article/sports/ipl/ipl-2023-punjab-dazzle-mumbai-out-dazzles-8590169/","keywords":["IPL 2023","Sports"],"creator":["Sriram Veera"],"video_url":null,"description":null,"content":"Synopsis: Surya-Kishan dazzle to make a mockery of a 200-plus chase after Chawla stars even as Jitesh Sharma flays a weak Mumbai bowling attack Surya-Kishan dazzle When Cameron Green swished wildly and missed continuously after Rohit Sharma had exited the third ball, the 215-run chase seemed to be going nowhere. But when Rishi Dhawan made the mistake of bowling length, Ishan Kishan had two murderous swings to thwack them over the onside boundary. Though Green fell in the next over, the sixth of the innings, the game would change with the arrival of Suryakumar Yadav. Recommended for you 1 IPL 2023, PBKS vs MI emotional rollercoaster: Tilak Varma the finisher, Matthew Short loves short stuff and unlucky Jofra Archer 2 Man who ran away from Delhi Cricket citing pressure…: Gautam Gambhir posts cryptic tweet 3 Watch: Stunned Marcus Stoinis confirms his dismissal from umpire after a dreamy Ravindra Jadeja ball castles his stumps The momentum completely switched in the middle overs between the 9th to 11th against Punjab’s spinners Rahul Chahar and Harpreet Brar. With the pitch a batting beauty by then, Kishan went so hard at the spinners; they had the feel of the slogs with his scything bat-swings that finish over his shoulder but the ball traversed in the conventional spaces like straight down the ground. As many as 38 runs came in those 3 overs and there was a discernible shift in the game: Punjab couldn’t now depend on the spinners and had to drag in the seamers. But if Kishan plundered spin, Surya robbed the pacers with a smile on his face. 100- partnership up in no time! @ishankishan51 & @surya_14kumar have made this chase look effortless so far. Follow the match – https://t.co/QDEf6eqX22 #TATAIPL | #PBKSvMI pic.twitter.com/qERm0rYWzE — IndianPremierLeague (@IPL) May 3, 2023 Not that there is an absence of a naturalness in Suryakumar’s batting, but that constructed idea of modern-day T20 batting has seeped in so naturally. He hits into unique places with ultra-powerful wrists. He still comes from the same solid base that is nonnegotiable but if one were to list out its mechanics – the various terms like ‘set-up at crease’, ‘shape’, ‘unweighting of bat’, ‘correct position’, can be used. He walloped Sam Curran for two fours and two sixes in the 13th over that went for 27 that seemed to settle any doubts about where the game was heading. The first ball was a SKY Special, a full-length ball outside off not sliced or squeezed or squirted away but with that rubber-wrist he gracefully sliced it up and over backward point for a splendid six. The next ball from Curran was a weak length ball outside off and Surya went down on his knee to dispose it over cover boundary, and held his pose as well. The next was a fuller, attempted yorker perhaps, but Surya whip-flicked it right past a startled Curran who took evasive action rather than attempt any heroic catch. Then came the Surya sweep, where he finishes up as if he were throwing a towel over his shoulder. 𝙎𝙈𝘼𝘾𝙆𝙀𝘿! Fifty partnership up between Ishan Kishan & SKY 1️⃣0️⃣0️⃣ up for Mumbai Indians 🔥🔥 Follow the match ▶️ https://t.co/QDEf6eqX22 #TATAIPL | #PBKSvMI pic.twitter.com/WL7fnpiI8b — IndianPremierLeague (@IPL) May 3, 2023 Both fell in the end overs but with the satisfaction that the job was done and Tilak Varma ensured it was a done deal, smoking in a few big hits. That’s that from Match 46. @mipaltan register a 6-wicket win against #PBKS to add to crucial points to their tally. #MI chase down the target in 18.5 overs. Scorecard – https://t.co/IPLsfnImuP #TATAIPL #PBKSvMI #IPL2023 pic.twitter.com/SeKR48s9Vv — IndianPremierLeague (@IPL) May 3, 2023 Chawla stars Piyush Chawla has the most wickets (14) in the overs between 7 and 15. He bossed the middle overs yet again against Punjab Kings , taking out Shikhar Dhawan and Matt Short with his two different googlies. Piyush Chawla gets the key breakthrough! Shikhar Dhawan steps down, but is stumped by Ishan Kishan. Live – https://t.co/IPLsfnImuP #TATAIPL #PBKSvMI #IPL2023 pic.twitter.com/fd4blfWR11 — IndianPremierLeague (@IPL) May 3, 2023 Dhawan’s dismissal was a peach; Short’s was always coming. Dhawan had just charged him to ping the straight boundary and came out again but Chawla had the experience to anticipate that. He went slightly wider and slid that finger-googly across Dhawan who couldn’t connect with his flail and was stumped. Chawla’s other googly is the back-of-the-hand version when he wants it to spin more and a lot slower. The finger-one comes with pace and camouflage. And so, he tossed up the back-of-the-hand wrong’un to Short, who had an almighty swing at it, was too early with his hack, and was bowled. 8️⃣2️⃣ runs 4️⃣2️⃣ balls 7️⃣ fours 6️⃣ sixes It was raining fours and sixes courtesy of @liaml4893 ‘s supreme striking 💥💥 #TATAIPL | #PBKSvMI Sit back and enjoy the Livingstone storm 🎥🔽 https://t.co/rTO5jP6pG7 — IndianPremierLeague (@IPL) May 3, 2023 Jofra’s nightmarish night It didn’t help their cause that Jofra Archer’s elbow hasn’t quite healed yet. Or so it seemed; Brett Lee definitely thought so as he started to count the high number of slower ones that Archer bowled on a loop suggesting, “the elbow is still sore”. As he continued to leak runs (21 in his 2nd, and 27 in his final) Lee’s verdict turned more critical. “If you can’t do what you have been paid to do, then you are better off to go off the field … he is masking his sore elbow (with the slower ones).” And when Robin Uthappa suggested it could be difficult to comeback after injury, Lee didn’t let that sentiment linger: “Sorry, it comes to mind. You have to trick your body to forget the pain and bowl.” Jitesh’s poise Also Read 'I have come to play in the IPL, not to take abuses,' says Naveen-ul-Haq:... Man who ran away from Delhi Cricket citing pressure...: Gautam Gambhir po... KL Rahul likely to miss remainder of IPL, doubtful for WTC Final Blow-by-blow of Kohli-Gambhir spat: A flashpoint on field after a free-hi... Advertisement There is an absence of bossiness in Jitesh’s body language at the crease. Quite calm, steady, and no discernible predetermination. In some sense, his set up at the crease reminds one of the Sri Lankan dasher Tillakaratne Dilshan, in his furious swings off length deliveries and in the square slices through point balls that fall just short of yorker. Like Dilshan, Jitesh too likes to play the laps over short fine-leg, though on Wednesday night, he shelved it completely, instead focussing on going downtown. Jitesh Sharma got going immediately with the bat and stitched a solid partnership with Liam Livingstone 💪🏻 #TATAIPL | #PBKSvMI Revisit his knock here 🎥🔽 https://t.co/xkpooOEX2N — IndianPremierLeague (@IPL) May 3, 2023 And to think he was an opener, until after a dip in form post 2017, he worked on his skills to convert himself into a finisher. As he told this newspaper, “As an opener it is very difficult to get into any IPL team. I was well aware. There was a dip also. Post 2017, I was not able to perform well. I worked on my skills.” He and Livingstone did their best, but were out-dazzled by the Surya-Kishan show.","pubDate":"2023-05-03 18:33:58","image_url":null,"source_id":"indianexpress","category":["sports"],"country":["india"],"language":"english"},{"title":"PAK vs NZ: All-round Pakistan edge New Zealand to seal series triumph","link":"https://a-sports.tv/pak-vs-nz-all-round-pakistan-edge-new-zealand-to-seal-series-triumph/","keywords":["Cricket","PAK vs NZ","Sports","Top News","Top Picks"],"creator":["A Sports"],"video_url":null,"description":"KARACHI: Dominant Pakistan put on an all-round show to storm past New Zealand in the third PAK vs NZ ODI to win the five-match series 3-0 with two games to spare. Watch PAK vs NZ Live Match in HD Streaming The third PAK vs NZ ODI of the five-match series was played here at the National […] The post PAK vs NZ: All-round Pakistan edge New Zealand to seal series triumph appeared first on ASports.tv.","content":"The third PAK vs NZ ODI of the five-match series was played here at the National Bank Cricket Arena here on Wednesday. New Zealand captain Tom Latham opted to bowl first after the coin flipped in his favour. Pakistan, in response, put up a decent total on the scoreboard at the back of brilliant half-centuries by Imam-ul-Haq and . Imam-ul-Haq smashed seven boundaries and a six on his way to top score for Pakistan with a 107-ball 90. Babar Azam, on the other hand, was also impressive with the bat as he notched up 54 runs in 62 balls, laced up with three boundaries and a six. The target set by the green shirts turned out to be too much for as they succumbed to their third straight defeat in the ongoing five-match series despite a brilliant start by their openers – Will Young and Tom Blundell. Blundell remained the top scorer for the touring side with a 78-ball 65, which featured seven boundaries.","pubDate":"2023-05-03 18:26:05","image_url":null,"source_id":"arynews","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"India overtake Australia at top of ICC Test rankings","link":"https://www.khmertimeskh.com/501284264/india-overtake-australia-at-top-of-icc-test-rankings/","keywords":["Sports","India","test"],"creator":["Ayman"],"video_url":null,"description":"India overtook Australia on Tuesday to go number one in new Test rankings issued by the International Cricket Council, while also retaining the top position in T20s. The post India overtake Australia at top of ICC Test rankings appeared first on Khmer Times.","content":"NEW DELHI – India overtook Australia on Tuesday to go number one in new Test rankings issued by the International Cricket Council, while also retaining the top position in T20s. England remained number three in Tests but reduced the gap behind the top two teams significantly, the rankings published by the ICC showed. England have won 10 out of 12 Tests since captain Ben Stokes and coach Brendon McCullum joined forces last year following a woeful run of one win in 17 matches. The new annual rankings reflect all series completed since May 2020 and drop results from the 2019-20 season, the ICC said. India last topped the Test rankings for a month in December 2021, while Australia has been number one since January 2022 after hammering England 4-0 in the Ashes. The table remained otherwise unchanged, with South Africa fourth and New Zealand fifth ahead of Pakistan, Sri Lanka, West Indies, Bangladesh and Zimbabwe. Afghanistan and Ireland have yet to play enough Tests to earn a place in the rankings table. India remained number one in the T20 rankings, increasing their lead over second-placed England, while New Zealand overtook Pakistan and South Africa to be third. Australia are sixth ahead of West Indies, Sri Lanka, Bangladesh and Afghanistan. The new rankings for one-day internationals will be released on May 10. AFP","pubDate":"2023-05-03 18:02:22","image_url":null,"source_id":"khmertimeskh","category":["sports"],"country":["Cambodia"],"language":"khmer"},{"title":"कौन है आकाश मधवाल... जिन्होंने IPL डेब्यू में लूट ली महफिल, डेथ ओवर में धारदार गेंदबाजी से मचाया बवाल","link":"https://navbharattimes.indiatimes.com/sports/cricket/iplt20/news/ipl-2023-pbks-vs-mi-akash-madhwal-who-did-debut-against-punjab-kings/articleshow/99968531.cms","keywords":null,"creator":null,"video_url":null,"description":"PBKS vs MI: पंजाब किंग्स और मुंबई इंडियंस के बीच मोहाली में खेला गया। इस मैच में मुंबई के लिए नेट गेंदबाद रह चुके आकाश मधवाल को मुंबई इंडियंस के लिए डेब्यू करने का मौका मिला। वह अपने डेब्यू मैच में ही छा गए।","content":"आईपीएल 2023 का 46वां मुकाबला पंजाब किंग्स और मुंबई इंडियंस के बीच बुधवार को मोहाली में खेला जा रहा है। इस मैच में मुंबई के कप्तान रोहित शर्मा ने टॉस जीतकर पहले गेंदबाजी करने का फैसला किया था। जोकि बिल्कुल भी असरदार साबित नहीं हुआ। पंजाब किंग्स ने निर्धारित 20 ओवर में 3 विकेट के नुकसान पर 214 रन बोर्ड पर लगा दिए। हालांकि राइली मेरेडिथ के चोटिल होने की वजह से मुंबई ने पंजाब के खिलाफ युवा तेज गेंदबाज आकाश मधवाल को डेब्यू करने का मौका दिया। गौरतलब है कि 200 रन खाने के बावजूद आकाश मुंबई की इस निराशाजनक गेंदबाजी में छा गए। दाएं हाथ के तेज गेंदबाज आकाश मधवाल ने पंजाब किंग्स के खिलाफ अपने पहले ही मुकाबले में तुज तर्रार गेंदबाजी से सुर्खियां बटोर ली। भले ही पीबीकेएस के खिलाफ आकाश ने 3 ओवर में 37 रन दिए हो। लेकिन उन्होंने डेथ ओवर में अपनी सटीक गेंदबाजी से सबका दिल जीत लिया। कप्तान रोहित शर्मा ने मधवाल से पहला ओवर पंजाब की पारी के 11वें ओवर में करवाया। इस ओवर में आकाश काफी महंगे साबित हुए। उन्होंने इस ओवर में 16 रन खर्च किए। हालांकि इसके बाद उन्होंने डेथ ओवर में अपना असली जादू दिखाया। रोहित ने आकाश से फिर 18वां और 20वां ओवर करवाया। जहां 18वें ओवर में आकाश ने 12 रन दिए तो वहीं आखिरी ओवर में सिर्फ 9 रन लुटाए। टी20 में पारी के आखिरी ओवर में महज 9 रन देना अपने आप में एक बहुत बड़ी बात है। आकाश ने इस मैच में चाहे अपनी पहली आईपीएल विकेट नहीं ली हो। लेकिन उन्होंने इस मैच में अपनी काबिलियत को बखूबी साबित किया। मुंबई के लिए नीली जर्सी में कमाल करने वाले आकाश मधवाल डोमेस्टिक क्रिकेट में उत्तराखंड से खेलते हैं। मुंबई इंडियंस ने आईपीएल 2022 में सूर्यकुमार यादव के चोटिल होने के बाद आकाश को अपनी टीम में बतौर रिप्लेसमेंट शामिल किया था। हालांकि उन्हें पिछले सीजन डेब्यू करने का मौका नहीं मिला था। लेकिन इसके बाद आईपीएल 2023 के मेगा ऑक्शन से पहले मुंबई ने इस तेज गेंदबाज को 20 लाख में रिटेन कर लिया था। बता दें कि आकाश का जन्म 25 नवंबर 1993 में रुड़की में हुआ था। इसके अलावा 29 वर्षीय आकाश के डोमेस्टिक करियर की बात करें तो, उन्होंने अपने फर्स्ट क्लास करियर का डेब्यू 2019 में किया था। जब से अब तक उन्होंने प्रथम श्रेणी क्रिकेट में 10 मैच खेले हैं, जिसमें उन्होंने 12 विकेट लिए हैं। इसके अलावा लिस्ट ए में 17 मैच में 18 तो 22 टी20 मैचों में आकाश ने 24 विकेट अपने नाम किए हैं।","pubDate":"2023-05-03 17:48:55","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"ईशान और सूर्या की तूफानी फिफ्टी के आगे ढेर हुए पंजाब के शेर, घर में घुसकर पूरा किया बदला","link":"https://navbharattimes.indiatimes.com/sports/cricket/iplt20/news/ipl-2023-pbks-vs-mi-match-highlights-report-ishan-kishan-and-surya-kumar-yadav-fifty/articleshow/99968522.cms","keywords":null,"creator":null,"video_url":null,"description":"PBKS vs MI, Highlights: इंडियन प्रीमियर लीग 2023 के 46वें मैच में ईशान किशन और सूर्यकुमार यादव की तूफानी फिफ्टी से मुंबई इंडियंस ने पंजाब किंग्स को उसके घर में 6 विकेट से हरा दिया। मैच में पंजाब की टीम ने पहले बल्लेबाजी करते हुए 214 रन का स्कोर खड़ा किया था जिसे मुंबई ने 18.5ओवर में ही हासिल कर लिया।","content":"ईशान किशन और सूर्यकुमार यादव की तूफानी फिफ्टी से मुंबई इंडियंस ने पंजाब को किंग्स को 6 विकेट से हरा दिया। दोनों टीमों के बीच यह मुकाबला मोहाली में खेला गया था और इंडियन प्रीमियर लीग 2023 का 46वां मैच था। इस मैच में मुंबई के कप्तान रोहित शर्मा ने टॉस जीतने के बाद पहले गेंदबाजी का फैसला किया था। मैच में पंजाब किंग्स ने पहले बल्लेबाजी करते हुए निर्धारित 20 ओवर के खेल में 214 रनों का स्कोर खड़ा किया था जिसके जवाब में मुंबई ने 7 गेंद शेष रहते ही मैच को अपने नाम कर लिया। पंजाब के खिलाफ लक्ष्य का पीछा करते हुए मुंबई इंडियंस की शुरुआत कुछ खास नहीं रही थी। कप्तान रोहित शर्मा बिना खाता खोले ही पवेलियन वापस लौट गए थे। हालांकि इसके बाद ईशान ने मुंबई के लिए मोर्चा संभाल लिया। ईशान को कुछ के लिए कैमरून ग्रीन का साथ मिला लेकिन असली रंग जमा ग्रीन के आउट के होने बाद। कैमरून ग्रीन 18 गेंद में 23 रन बनाकर आउट हुए। इसके बाद सूर्यकुमार यादव क्रीज पर बल्लेबाजी के लिए उतरे। उसके बाद फिर क्या था। दोनों छोर से पंजाब के गेंदबाजों की जमकर पिटाई। ईशान और सूर्या के बीच 100 से अधिक रनों की साझेदारी हुई। ईशान किशन मुंबई के लिए 41 गेंद में 75 रनों की पारी खेलकर आउट हुए। अपनी इस पारी में उन्होंने 7 चौके और 4 छक्के भी लगाए। वहीं सूर्यकुमार यादव 31 गेंद में 66 रन बनाए। इस दौरान उन्होंने 8 चौके और 2 छक्के लगाए। हालांकि जि अंदाज में ये दोनों बल्लेबाजों ने अपना खेल दिखाया ऐसा लगा कि वह टीम को जीत दिला कर ही वापस लौटेंगे लेकिन ऐसा नहीं हो पाया। ईशान और सूर्या के आउट के बाद भी मुंबई की रन गति में कमी नहीं आई। टीम के लिए तिलक वर्मा और टिम डेविड ने टीम को आसान जीत दिला दी। टिम डेविड ने 10 गेंद में 19 रनों की पारी खेली जबकि वर्मा ने 10 गेंद में 26 की तूफानी पारी खेली।","pubDate":"2023-05-03 17:47:47","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"दिग्गज से नहीं देखी गई ग्राउंड्समैन की परेशानी, दौड़ कर बढ़ाया मदद का हाथ, जिसने भी देखा किया सलाम","link":"https://navbharattimes.indiatimes.com/sports/cricket/iplt20/news/ipl-2023-lsg-vs-csk-jonty-rhodes-helps-grounds-man-during-rain-video-goes-viral-on-social-media/articleshow/99967187.cms","keywords":null,"creator":null,"video_url":null,"description":"IPL 2023: इंडियन प्रीमियर लीग 2023 का 45वां मैच लखनऊ सुपरजाइंट्स और चेन्नई सुपर किंग्स के बीच खेला गया। हालांकि मैच बारिश के कारण पूरा नहीं हो सका लेकिन इस दौरान लखनऊ सुपरजाइंट्स के सपोर्ट स्टाफ के सदस्य जॉन्टी रोड्स ने जो किया उसे देखकर उन्हें हर कोई सलाम कर रहा है।","content":"इंडियन प्रीमियर लीग 2023 का 45वां मैच लखनऊ सुपरजाइंट्स और चेन्नई सुपर किंग्स के बीच था। हालांकि मैच बारिश के कारण बाधित रहा। इसके कारण सिर्फ एक ही पारी का खेल हो सका। इससे पहले बारिश के कारण टॉस में भी देरी हुई थी। मैच में चेन्नई के कप्तान महेंद्र सिंह धोनी ने टॉस जीतने के बाद पहले गेंदबाजी का फैसला किया। लखनऊ की टीम ने 19.2 ओवर की ही बल्लेबाजी कर सकी इसके बारिश ने दखल दे दिया। इस दौरान ग्राउंड्स स्टाफ ने जल्दी-जल्दी पिच को कवर्स करने लगे लेकिन इसी बीच लखनऊ के कोचिंग स्टाफ जॉन्टी रोड्स भी ग्राउंड्समैन की मदद के लिए दौड़ पड़े। रोड्स ने उनके साथ कवर्स को खींचते हुए पिच की तरफ लाने में उनकी मदद कर रहे थे। हालांकि इस दौरान स्टेडियम के एक अधिकारी ने उन्हें ऐसा करने से रोका भी लेकिन रोड्स दोबारा उनकी मदद के लिए पहुंच गए। जॉन्टी रोड्स को ऐसा करते हुए जिसने भी देखा उन्हें वह सलाम कर रहा है। इसके अलावा सोशल मीडिया पर भी उनका यह बेहतरीन वीडियो खूब वायरल हो रहा है। जॉन्टी रोड्स की पहचान दुनिया के सबसे बेहतरीन फील्डरों में होती थी। उनके आगे से कोई भी बल्लेबाज रन चुराने के लिए 10 बार सोचता था क्योंकि चीते की फुर्ती रखने वाले रोड्स पलक झपकते ही किसी रन आउट कर देते थे। जॉन्टी रोड्स साउथ अफ्रीका के लिए 52 टेस्ट, 245 वनडे मैच खेल चुके। टेस्ट क्रिकेट में उन्होंने 2532 रन बनाए हैं जबकि वनडे में उनके नाम 5935 रन दर्ज है। वनडे में रोड्स ने 2 शतक और 33 अर्धशतक बनाए। लखनऊ सुपरजाइंट्स के लिए आईपीएल में यह 10वां मैच था। इस दौरान टीम के खाते में पांच जीत आई जबकि एक मैच का कोई नतीजा नहीं निकला और 4 मैच में उसे हार का सामना करना पड़ा। इस कारण अब उसके 11 पॉइंट्स हो गए जिसके कारण वह दूसरे स्थान पर पहुंच गया है।","pubDate":"2023-05-03 17:07:41","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"“Gautam Gambhir and Virat Kohli’s Feud Takes Center Stage After LSG vs RCB Match”","link":"https://www.gudstory.com/gambhir-and-kohli-feud-takes-center-stage-after-lsg-vs-rcb-match/","keywords":["Cricket","Gambhir","Kohli"],"creator":["Vishnu Reddy"],"video_url":null,"description":"The match between LSG and RCB was an intense one, with both teams putting up a great fight. However, what stole the limelight was the ugly fight between Gautam Gambhir and Virat Kohli towards the end of the match. Virat Kohli and Gautam Gambhir got involved in a verbal fight after Royal Challengers Bangalore’s (RCB) […] The post “Gautam Gambhir and Virat Kohli’s Feud Takes Center Stage After LSG vs RCB Match” appeared first on Gud Story.","content":"Home Sports Cricket “Gautam Gambhir and Virat Kohli’s Feud Takes Center Stage After LSG vs RCB Match” by Vishnu Reddy May 3, 2023 in Cricket Reading Time: 3 mins read 0 Virat Kohli and Gautam Gambhir (Image Credit: Twitter) Share on Facebook Share on Twitter Table of Contents The aftermath of the confrontation between Gambhir and Kohli The match between LSG and RCB was an intense one, with both teams putting up a great fight. However, what stole the limelight was the ugly fight between Gautam Gambhir and Virat Kohli towards the end of the match. Virat Kohli and Gautam Gambhir got involved in a verbal fight after Royal Challengers Bangalore’s (RCB) win against Lucknow Supergiant’s (LSG). As the two franchises shook hands after the conclusion of the match, it was Kohli and Gambhir who grabbed eyeballs as they were seen engaging in an argument. Notably, Gambhir was seen pointing fingers at Kohli upon which the latter did not hold back and charged towards him. It seems like Gambhir wanted to confront Virat Kohli about his chats with Naveen-ul-Haq when the latter was batting in a tense chase. There were also finger-on-mouth celebrations from Virat Kohli when he took the catch of Krunal, perhaps responding to a similar celebration from Gambhir when LSG had defeated RCB at the Chinnaswamy earlier this season. “Virat Kohli was abusing Naveen . I intervened and told K Mayers to go and ask him what colour is your IPL Trophy . After listening to that he came up to me & complained . I asked him to put his 50+ score in WC knockouts on the table , he left”. Gautam Gambhir via Cricbuzz The aftermath of the confrontation between Gambhir and Kohli Virat Kohli and Gautam Gambhir confrontation after LSG vs RCB match (Image Credit: Twitter) The confrontation between Gautam Gambhir and Virat Kohli during the LSG vs RCB match was a surprising and unfortunate event. Following the incident, both players were fined 100% of their match fees.The incident also received widespread coverage in the media, and many people were left wondering what would happen next. Fortunately, both players were able to put the incident behind them and move forward. They issued statements apologizing for their behavior and expressing their desire to move on from the incident. Overall, while the confrontation was certainly regrettable, it is good to see that both were able to learn from their mistakes and move on. ADVERTISEMENT Sport can be a highly charged and emotional activity, and it is important for players to remember to stay calm and composed, even in the heat of the moment. By doing so, they can help to ensure that the game remains enjoyable and fair for everyone involved. The recent ugly fight between Gambhir and Kohli after the LSG vs RCB match has brought to light the need for a more professional attitude in the world of cricket. While it’s understandable that emotions can run high during a game, resorting to physical altercations is never acceptable. Both players were fined 100% of their match fee, a clear signal that such behavior will not be tolerated. It’s important for players to remember that they are role models for the millions of fans who look up to them. They should strive to set an example of fair play and sportsmanship, both on and off the field. Let’s hope that this incident serves as a wake-up call for all cricket players to conduct themselves in a professional and respectful manner. Read More: Kevin Durant Lauds Steph Curry for Breaking His Game 7 Scoring Record Tags: Gambhir Kohli Related Posts ICC World Cup 2023 Schedule, Teams, Venues May 1, 2023 The IPL is on track to Surpass the NFL, Says IPL Founder Lalit Modi April 30, 2023 Andre Russell Not Pleased, Holds Entire KKR Team Accountable for Loss to GT April 29, 2023 Our bowlers will come back strong: Wasim Jaffer April 29, 2023","pubDate":"2023-05-03 17:03:15","image_url":null,"source_id":"gudstory","category":["sports"],"country":["india"],"language":"english"},{"title":"Premier Cricket Standings & Top Performers","link":"https://bernews.com/2023/05/bermuda-premier-cricket-standings-top-performers/","keywords":["All","Sports","#BermudaCricket"],"creator":["temp"],"video_url":null,"description":"After the first week of Bermuda Premier Division Cricket action, we take a look at the top performers and the league standings. Terryn Fray from Bailey’s bay was the only batsman to score a half Century with a knock of 52, while Dion Stovell from Cleveland County was the weekends top bowlers with figures of […]","content":"After the first week of Bermuda Premier Division action, we take a look at the top performers and the league standings. Terryn Fray from Bailey’s bay was the only batsman to score a half Century with a knock of 52, while Dion Stovell from Cleveland County was the weekends top bowlers with figures of 9.3-1-30-7. Cleveland County are the League leaders on net run rate over the St. George’s Cricket Club and Bailey’s Bay, all three teams have 10 points. Cleveland County has a Net Run Rate of 4.541, the St. George’s Cricket Club has a net run rate of 1.900. : ,","pubDate":"2023-05-03 23:00:39","image_url":null,"source_id":"bernews","category":["sports"],"country":["Bermuda"],"language":"english"},{"title":"Man Who Ran Away From Delhi Cricket…, Gautam Gambhir Posts Cryptic Tweet","link":"https://www.thetimesofbengal.com/sports/man-who-ran-away-from-delhi-cricket-gautam-gambhir-posts-cryptic-tweet/","keywords":["Sports"],"creator":["admin"],"video_url":null,"description":"Home Sports ‘Man Who Ran Away From Delhi Cricket…’, Gautam Gambhir Posts Cryptic Tweet Former India cricketer and the current mentor of IPL franchise Lucknow Super Giants, Gautam Gambhir, who has been in the eye of storm since his on-field confrontation with Royal Challengers Bangalores Virat Kohli, posted a cryptic tweet on Wednesday, leaving cricket […]","content":"New Delhi, May 4: Former India cricketer and the current mentor of IPL franchise Lucknow Super Giants, Gautam Gambhir, who has been in the eye of storm since his on-field confrontation with Royal Challengers Bangalores Virat Kohli, posted a cryptic tweet on Wednesday, leaving cricket fans puzzled. The BJP MP took to his official Twitter handle to share a post, where he wrote: “Man who ran away from Delhi Cricket citing ‘pressure’ seems over eager to sell paid PR as concern for cricket! Yahi Kalyug Hai, Jaha Bhagode’ Apni Adalat Chalate Hai! (This is Kalyug where ‘fugitives’ run their ‘court’).” However, it was not clear as to who Gambhir was referring to. The rivalry between Gambhir and Kohli reignited on Monday when they came face-to-face after the RCB vs LSG match. Gambhir and Kohli were seen arguing over an incident that developed during the match. Kohli was deeply agitated during LSG’s innings and was even involved in a couple of ugly face-offs with Naveen-ul-Haq and Amit Mishra of LSG. An eyewitness, who was in one of the team dug-outs, gave a lowdown of events to PTI. “You saw on TV that Mayers and Virat were walking side by side for a few metres post match. Mayers asked Kohli why was he constantly abusing them and Virat, in turn, questioned why was he (Mayers) ‘staring’ at him? Before that (Amit) Mishra had complained to umpire about Virat constantly abusing Naveen (ul-Haq), who is a No. 10 batter. “Gautam, sensing that things could turn ugly, pulled Mayers and told him not to have a conversation, when Virat made a comment. The heated exchange that followed seemed a bit juvenile,” he said. “Gautam asked ‘Kya bol raha hain bol’ (What were you saying?) and Virat replied, ‘Maine aapko kuch bola hi naahin, aap kyon ghus rahein ho’ (Why are you coming in between when I haven’t told you anything). “Gautam responded, ‘Tuney agar mere player ko bola hai, matlab tune meri family ko gaali diya hai. (You abused my player and that’s like abusing my family) and Virat’s reply was, ‘Toh aap apne family ko sambhal ke rakhiye’. (Then you take care of your family). “Gambhir’s final reply before they were separated was, ‘Toh ab tu mujhe sikhayega…’ (So now I have to learn from you…).” The eyewitness said that while it was tense and a blow away from turning into a free-for-all, it all seemed a bit juvenile at both ends. (With Agency Inputs) $(document).ready(function(){ $('#commentbtn').on(\"click\",function(){ (function(d, s, id) { var js, fjs = d.getElementsByTagName(s)[0]; if (d.getElementById(id)) return; js = d.createElement(s); js.id = id; js.src = \"https://connect.facebook.net/en_US/all.js#xfbml=1&appId=178196885542208\"; fjs.parentNode.insertBefore(js, fjs); }(document, 'script', 'facebook-jssdk')); $(\".cmntbox\").toggle(); }); }); Source link","pubDate":"2023-05-03 21:17:49","image_url":null,"source_id":"the_tob","category":["sports"],"country":["india"],"language":"english"},{"title":"Fastest women’s bowler Shabnim Ismail retires from international cricket","link":"https://a-sports.tv/fastest-women-bowler-shabnim-ismail-retires/","keywords":["Cricket","Sports","Top News","Top Picks","Shabnim Ismail"],"creator":["AFP"],"video_url":null,"description":"South African fast bowler Shabnim Ismail, who is credited with sending down the quickest delivery in women’s cricket, announced her retirement from the international game on Wednesday. During the T20 World Cup semi-final against England in Cape Town in February she bowled a 128kmh (80mph) delivery – the fastest recorded in the women’s game. Shabnim […] The post Fastest women’s bowler Shabnim Ismail retires from international cricket appeared first on ASports.tv.","content":"During the T20 World Cup semi-final against England in Cape Town in February she bowled a 128kmh (80mph) delivery – the fastest recorded in the women’s game. Shabnim Ismail, 34, said in a statement issued by Cricket South Africa that she wanted to spend more time with her family but would continue to be available to play in domestic Twenty20 tournaments around the world. She ended her international career on a high when she was a member of the first South African team, men or women, to reach a World Cup final. She took two for 26 in the final against Australia in Cape Town but it was not enough to prevent Australia winning their fifth title. Ismail made her international debut as a teenager in 2007 and went on to appear in 241 international matches. She took 191 wickets in 127 one-day internationals, second only to India’s Jhulan Goswami, and took 123 wickets in T20 internationals to be fourth on the all-time list. She took three wickets in her only Test match against the Netherlands in 2007. She missed South Africa’s one-off Test in England in 2022 because of injury. “As any athlete knows, training and competing at your best requires much sacrifice and dedication, and I now find myself wanting to spend more time with my family, particularly my siblings and parents as they get older,” Ismail said in her statement.","pubDate":"2023-05-03 19:34:54","image_url":null,"source_id":"arynews","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"IPL 2023: Punjab dazzle; Mumbai out-dazzles","link":"https://indianexpress.com/article/sports/ipl/ipl-2023-punjab-dazzle-mumbai-out-dazzles-8590169/","keywords":["IPL 2023","Sports"],"creator":["Sriram Veera"],"video_url":null,"description":null,"content":"Synopsis: Surya-Kishan dazzle to make a mockery of a 200-plus chase after Chawla stars even as Jitesh Sharma flays a weak Mumbai bowling attack Surya-Kishan dazzle When Cameron Green swished wildly and missed continuously after Rohit Sharma had exited the third ball, the 215-run chase seemed to be going nowhere. But when Rishi Dhawan made the mistake of bowling length, Ishan Kishan had two murderous swings to thwack them over the onside boundary. Though Green fell in the next over, the sixth of the innings, the game would change with the arrival of Suryakumar Yadav. Recommended for you 1 IPL 2023, PBKS vs MI emotional rollercoaster: Tilak Varma the finisher, Matthew Short loves short stuff and unlucky Jofra Archer 2 Man who ran away from Delhi Cricket citing pressure…: Gautam Gambhir posts cryptic tweet 3 Watch: Stunned Marcus Stoinis confirms his dismissal from umpire after a dreamy Ravindra Jadeja ball castles his stumps The momentum completely switched in the middle overs between the 9th to 11th against Punjab’s spinners Rahul Chahar and Harpreet Brar. With the pitch a batting beauty by then, Kishan went so hard at the spinners; they had the feel of the slogs with his scything bat-swings that finish over his shoulder but the ball traversed in the conventional spaces like straight down the ground. As many as 38 runs came in those 3 overs and there was a discernible shift in the game: Punjab couldn’t now depend on the spinners and had to drag in the seamers. But if Kishan plundered spin, Surya robbed the pacers with a smile on his face. 100- partnership up in no time! @ishankishan51 & @surya_14kumar have made this chase look effortless so far. Follow the match – https://t.co/QDEf6eqX22 #TATAIPL | #PBKSvMI pic.twitter.com/qERm0rYWzE — IndianPremierLeague (@IPL) May 3, 2023 Not that there is an absence of a naturalness in Suryakumar’s batting, but that constructed idea of modern-day T20 batting has seeped in so naturally. He hits into unique places with ultra-powerful wrists. He still comes from the same solid base that is nonnegotiable but if one were to list out its mechanics – the various terms like ‘set-up at crease’, ‘shape’, ‘unweighting of bat’, ‘correct position’, can be used. He walloped Sam Curran for two fours and two sixes in the 13th over that went for 27 that seemed to settle any doubts about where the game was heading. The first ball was a SKY Special, a full-length ball outside off not sliced or squeezed or squirted away but with that rubber-wrist he gracefully sliced it up and over backward point for a splendid six. The next ball from Curran was a weak length ball outside off and Surya went down on his knee to dispose it over cover boundary, and held his pose as well. The next was a fuller, attempted yorker perhaps, but Surya whip-flicked it right past a startled Curran who took evasive action rather than attempt any heroic catch. Then came the Surya sweep, where he finishes up as if he were throwing a towel over his shoulder. 𝙎𝙈𝘼𝘾𝙆𝙀𝘿! Fifty partnership up between Ishan Kishan & SKY 1️⃣0️⃣0️⃣ up for Mumbai Indians 🔥🔥 Follow the match ▶️ https://t.co/QDEf6eqX22 #TATAIPL | #PBKSvMI pic.twitter.com/WL7fnpiI8b — IndianPremierLeague (@IPL) May 3, 2023 Both fell in the end overs but with the satisfaction that the job was done and Tilak Varma ensured it was a done deal, smoking in a few big hits. That’s that from Match 46. @mipaltan register a 6-wicket win against #PBKS to add to crucial points to their tally. #MI chase down the target in 18.5 overs. Scorecard – https://t.co/IPLsfnImuP #TATAIPL #PBKSvMI #IPL2023 pic.twitter.com/SeKR48s9Vv — IndianPremierLeague (@IPL) May 3, 2023 Chawla stars Piyush Chawla has the most wickets (14) in the overs between 7 and 15. He bossed the middle overs yet again against Punjab Kings , taking out Shikhar Dhawan and Matt Short with his two different googlies. Piyush Chawla gets the key breakthrough! Shikhar Dhawan steps down, but is stumped by Ishan Kishan. Live – https://t.co/IPLsfnImuP #TATAIPL #PBKSvMI #IPL2023 pic.twitter.com/fd4blfWR11 — IndianPremierLeague (@IPL) May 3, 2023 Dhawan’s dismissal was a peach; Short’s was always coming. Dhawan had just charged him to ping the straight boundary and came out again but Chawla had the experience to anticipate that. He went slightly wider and slid that finger-googly across Dhawan who couldn’t connect with his flail and was stumped. Chawla’s other googly is the back-of-the-hand version when he wants it to spin more and a lot slower. The finger-one comes with pace and camouflage. And so, he tossed up the back-of-the-hand wrong’un to Short, who had an almighty swing at it, was too early with his hack, and was bowled. 8️⃣2️⃣ runs 4️⃣2️⃣ balls 7️⃣ fours 6️⃣ sixes It was raining fours and sixes courtesy of @liaml4893 ‘s supreme striking 💥💥 #TATAIPL | #PBKSvMI Sit back and enjoy the Livingstone storm 🎥🔽 https://t.co/rTO5jP6pG7 — IndianPremierLeague (@IPL) May 3, 2023 Jofra’s nightmarish night It didn’t help their cause that Jofra Archer’s elbow hasn’t quite healed yet. Or so it seemed; Brett Lee definitely thought so as he started to count the high number of slower ones that Archer bowled on a loop suggesting, “the elbow is still sore”. As he continued to leak runs (21 in his 2nd, and 27 in his final) Lee’s verdict turned more critical. “If you can’t do what you have been paid to do, then you are better off to go off the field … he is masking his sore elbow (with the slower ones).” And when Robin Uthappa suggested it could be difficult to comeback after injury, Lee didn’t let that sentiment linger: “Sorry, it comes to mind. You have to trick your body to forget the pain and bowl.” Jitesh’s poise Also Read 'I have come to play in the IPL, not to take abuses,' says Naveen-ul-Haq:... Man who ran away from Delhi Cricket citing pressure...: Gautam Gambhir po... KL Rahul likely to miss remainder of IPL, doubtful for WTC Final Blow-by-blow of Kohli-Gambhir spat: A flashpoint on field after a free-hi... Advertisement There is an absence of bossiness in Jitesh’s body language at the crease. Quite calm, steady, and no discernible predetermination. In some sense, his set up at the crease reminds one of the Sri Lankan dasher Tillakaratne Dilshan, in his furious swings off length deliveries and in the square slices through point balls that fall just short of yorker. Like Dilshan, Jitesh too likes to play the laps over short fine-leg, though on Wednesday night, he shelved it completely, instead focussing on going downtown. Jitesh Sharma got going immediately with the bat and stitched a solid partnership with Liam Livingstone 💪🏻 #TATAIPL | #PBKSvMI Revisit his knock here 🎥🔽 https://t.co/xkpooOEX2N — IndianPremierLeague (@IPL) May 3, 2023 And to think he was an opener, until after a dip in form post 2017, he worked on his skills to convert himself into a finisher. As he told this newspaper, “As an opener it is very difficult to get into any IPL team. I was well aware. There was a dip also. Post 2017, I was not able to perform well. I worked on my skills.” He and Livingstone did their best, but were out-dazzled by the Surya-Kishan show.","pubDate":"2023-05-03 18:33:58","image_url":null,"source_id":"indianexpress","category":["sports"],"country":["india"],"language":"english"},{"title":"PAK vs NZ: All-round Pakistan edge New Zealand to seal series triumph","link":"https://a-sports.tv/pak-vs-nz-all-round-pakistan-edge-new-zealand-to-seal-series-triumph/","keywords":["Cricket","PAK vs NZ","Sports","Top News","Top Picks"],"creator":["A Sports"],"video_url":null,"description":"KARACHI: Dominant Pakistan put on an all-round show to storm past New Zealand in the third PAK vs NZ ODI to win the five-match series 3-0 with two games to spare. Watch PAK vs NZ Live Match in HD Streaming The third PAK vs NZ ODI of the five-match series was played here at the National […] The post PAK vs NZ: All-round Pakistan edge New Zealand to seal series triumph appeared first on ASports.tv.","content":"The third PAK vs NZ ODI of the five-match series was played here at the National Bank Cricket Arena here on Wednesday. New Zealand captain Tom Latham opted to bowl first after the coin flipped in his favour. Pakistan, in response, put up a decent total on the scoreboard at the back of brilliant half-centuries by Imam-ul-Haq and . Imam-ul-Haq smashed seven boundaries and a six on his way to top score for Pakistan with a 107-ball 90. Babar Azam, on the other hand, was also impressive with the bat as he notched up 54 runs in 62 balls, laced up with three boundaries and a six. The target set by the green shirts turned out to be too much for as they succumbed to their third straight defeat in the ongoing five-match series despite a brilliant start by their openers – Will Young and Tom Blundell. Blundell remained the top scorer for the touring side with a 78-ball 65, which featured seven boundaries.","pubDate":"2023-05-03 18:26:05","image_url":null,"source_id":"arynews","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"India overtake Australia at top of ICC Test rankings","link":"https://www.khmertimeskh.com/501284264/india-overtake-australia-at-top-of-icc-test-rankings/","keywords":["Sports","India","test"],"creator":["Ayman"],"video_url":null,"description":"India overtook Australia on Tuesday to go number one in new Test rankings issued by the International Cricket Council, while also retaining the top position in T20s. The post India overtake Australia at top of ICC Test rankings appeared first on Khmer Times.","content":"NEW DELHI – India overtook Australia on Tuesday to go number one in new Test rankings issued by the International Cricket Council, while also retaining the top position in T20s. England remained number three in Tests but reduced the gap behind the top two teams significantly, the rankings published by the ICC showed. England have won 10 out of 12 Tests since captain Ben Stokes and coach Brendon McCullum joined forces last year following a woeful run of one win in 17 matches. The new annual rankings reflect all series completed since May 2020 and drop results from the 2019-20 season, the ICC said. India last topped the Test rankings for a month in December 2021, while Australia has been number one since January 2022 after hammering England 4-0 in the Ashes. The table remained otherwise unchanged, with South Africa fourth and New Zealand fifth ahead of Pakistan, Sri Lanka, West Indies, Bangladesh and Zimbabwe. Afghanistan and Ireland have yet to play enough Tests to earn a place in the rankings table. India remained number one in the T20 rankings, increasing their lead over second-placed England, while New Zealand overtook Pakistan and South Africa to be third. Australia are sixth ahead of West Indies, Sri Lanka, Bangladesh and Afghanistan. The new rankings for one-day internationals will be released on May 10. AFP","pubDate":"2023-05-03 18:02:22","image_url":null,"source_id":"khmertimeskh","category":["sports"],"country":["Cambodia"],"language":"khmer"},{"title":"कौन है आकाश मधवाल... जिन्होंने IPL डेब्यू में लूट ली महफिल, डेथ ओवर में धारदार गेंदबाजी से मचाया बवाल","link":"https://navbharattimes.indiatimes.com/sports/cricket/iplt20/news/ipl-2023-pbks-vs-mi-akash-madhwal-who-did-debut-against-punjab-kings/articleshow/99968531.cms","keywords":null,"creator":null,"video_url":null,"description":"PBKS vs MI: पंजाब किंग्स और मुंबई इंडियंस के बीच मोहाली में खेला गया। इस मैच में मुंबई के लिए नेट गेंदबाद रह चुके आकाश मधवाल को मुंबई इंडियंस के लिए डेब्यू करने का मौका मिला। वह अपने डेब्यू मैच में ही छा गए।","content":"आईपीएल 2023 का 46वां मुकाबला पंजाब किंग्स और मुंबई इंडियंस के बीच बुधवार को मोहाली में खेला जा रहा है। इस मैच में मुंबई के कप्तान रोहित शर्मा ने टॉस जीतकर पहले गेंदबाजी करने का फैसला किया था। जोकि बिल्कुल भी असरदार साबित नहीं हुआ। पंजाब किंग्स ने निर्धारित 20 ओवर में 3 विकेट के नुकसान पर 214 रन बोर्ड पर लगा दिए। हालांकि राइली मेरेडिथ के चोटिल होने की वजह से मुंबई ने पंजाब के खिलाफ युवा तेज गेंदबाज आकाश मधवाल को डेब्यू करने का मौका दिया। गौरतलब है कि 200 रन खाने के बावजूद आकाश मुंबई की इस निराशाजनक गेंदबाजी में छा गए। दाएं हाथ के तेज गेंदबाज आकाश मधवाल ने पंजाब किंग्स के खिलाफ अपने पहले ही मुकाबले में तुज तर्रार गेंदबाजी से सुर्खियां बटोर ली। भले ही पीबीकेएस के खिलाफ आकाश ने 3 ओवर में 37 रन दिए हो। लेकिन उन्होंने डेथ ओवर में अपनी सटीक गेंदबाजी से सबका दिल जीत लिया। कप्तान रोहित शर्मा ने मधवाल से पहला ओवर पंजाब की पारी के 11वें ओवर में करवाया। इस ओवर में आकाश काफी महंगे साबित हुए। उन्होंने इस ओवर में 16 रन खर्च किए। हालांकि इसके बाद उन्होंने डेथ ओवर में अपना असली जादू दिखाया। रोहित ने आकाश से फिर 18वां और 20वां ओवर करवाया। जहां 18वें ओवर में आकाश ने 12 रन दिए तो वहीं आखिरी ओवर में सिर्फ 9 रन लुटाए। टी20 में पारी के आखिरी ओवर में महज 9 रन देना अपने आप में एक बहुत बड़ी बात है। आकाश ने इस मैच में चाहे अपनी पहली आईपीएल विकेट नहीं ली हो। लेकिन उन्होंने इस मैच में अपनी काबिलियत को बखूबी साबित किया। मुंबई के लिए नीली जर्सी में कमाल करने वाले आकाश मधवाल डोमेस्टिक क्रिकेट में उत्तराखंड से खेलते हैं। मुंबई इंडियंस ने आईपीएल 2022 में सूर्यकुमार यादव के चोटिल होने के बाद आकाश को अपनी टीम में बतौर रिप्लेसमेंट शामिल किया था। हालांकि उन्हें पिछले सीजन डेब्यू करने का मौका नहीं मिला था। लेकिन इसके बाद आईपीएल 2023 के मेगा ऑक्शन से पहले मुंबई ने इस तेज गेंदबाज को 20 लाख में रिटेन कर लिया था। बता दें कि आकाश का जन्म 25 नवंबर 1993 में रुड़की में हुआ था। इसके अलावा 29 वर्षीय आकाश के डोमेस्टिक करियर की बात करें तो, उन्होंने अपने फर्स्ट क्लास करियर का डेब्यू 2019 में किया था। जब से अब तक उन्होंने प्रथम श्रेणी क्रिकेट में 10 मैच खेले हैं, जिसमें उन्होंने 12 विकेट लिए हैं। इसके अलावा लिस्ट ए में 17 मैच में 18 तो 22 टी20 मैचों में आकाश ने 24 विकेट अपने नाम किए हैं।","pubDate":"2023-05-03 17:48:55","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"ईशान और सूर्या की तूफानी फिफ्टी के आगे ढेर हुए पंजाब के शेर, घर में घुसकर पूरा किया बदला","link":"https://navbharattimes.indiatimes.com/sports/cricket/iplt20/news/ipl-2023-pbks-vs-mi-match-highlights-report-ishan-kishan-and-surya-kumar-yadav-fifty/articleshow/99968522.cms","keywords":null,"creator":null,"video_url":null,"description":"PBKS vs MI, Highlights: इंडियन प्रीमियर लीग 2023 के 46वें मैच में ईशान किशन और सूर्यकुमार यादव की तूफानी फिफ्टी से मुंबई इंडियंस ने पंजाब किंग्स को उसके घर में 6 विकेट से हरा दिया। मैच में पंजाब की टीम ने पहले बल्लेबाजी करते हुए 214 रन का स्कोर खड़ा किया था जिसे मुंबई ने 18.5ओवर में ही हासिल कर लिया।","content":"ईशान किशन और सूर्यकुमार यादव की तूफानी फिफ्टी से मुंबई इंडियंस ने पंजाब को किंग्स को 6 विकेट से हरा दिया। दोनों टीमों के बीच यह मुकाबला मोहाली में खेला गया था और इंडियन प्रीमियर लीग 2023 का 46वां मैच था। इस मैच में मुंबई के कप्तान रोहित शर्मा ने टॉस जीतने के बाद पहले गेंदबाजी का फैसला किया था। मैच में पंजाब किंग्स ने पहले बल्लेबाजी करते हुए निर्धारित 20 ओवर के खेल में 214 रनों का स्कोर खड़ा किया था जिसके जवाब में मुंबई ने 7 गेंद शेष रहते ही मैच को अपने नाम कर लिया। पंजाब के खिलाफ लक्ष्य का पीछा करते हुए मुंबई इंडियंस की शुरुआत कुछ खास नहीं रही थी। कप्तान रोहित शर्मा बिना खाता खोले ही पवेलियन वापस लौट गए थे। हालांकि इसके बाद ईशान ने मुंबई के लिए मोर्चा संभाल लिया। ईशान को कुछ के लिए कैमरून ग्रीन का साथ मिला लेकिन असली रंग जमा ग्रीन के आउट के होने बाद। कैमरून ग्रीन 18 गेंद में 23 रन बनाकर आउट हुए। इसके बाद सूर्यकुमार यादव क्रीज पर बल्लेबाजी के लिए उतरे। उसके बाद फिर क्या था। दोनों छोर से पंजाब के गेंदबाजों की जमकर पिटाई। ईशान और सूर्या के बीच 100 से अधिक रनों की साझेदारी हुई। ईशान किशन मुंबई के लिए 41 गेंद में 75 रनों की पारी खेलकर आउट हुए। अपनी इस पारी में उन्होंने 7 चौके और 4 छक्के भी लगाए। वहीं सूर्यकुमार यादव 31 गेंद में 66 रन बनाए। इस दौरान उन्होंने 8 चौके और 2 छक्के लगाए। हालांकि जि अंदाज में ये दोनों बल्लेबाजों ने अपना खेल दिखाया ऐसा लगा कि वह टीम को जीत दिला कर ही वापस लौटेंगे लेकिन ऐसा नहीं हो पाया। ईशान और सूर्या के आउट के बाद भी मुंबई की रन गति में कमी नहीं आई। टीम के लिए तिलक वर्मा और टिम डेविड ने टीम को आसान जीत दिला दी। टिम डेविड ने 10 गेंद में 19 रनों की पारी खेली जबकि वर्मा ने 10 गेंद में 26 की तूफानी पारी खेली।","pubDate":"2023-05-03 17:47:47","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"दिग्गज से नहीं देखी गई ग्राउंड्समैन की परेशानी, दौड़ कर बढ़ाया मदद का हाथ, जिसने भी देखा किया सलाम","link":"https://navbharattimes.indiatimes.com/sports/cricket/iplt20/news/ipl-2023-lsg-vs-csk-jonty-rhodes-helps-grounds-man-during-rain-video-goes-viral-on-social-media/articleshow/99967187.cms","keywords":null,"creator":null,"video_url":null,"description":"IPL 2023: इंडियन प्रीमियर लीग 2023 का 45वां मैच लखनऊ सुपरजाइंट्स और चेन्नई सुपर किंग्स के बीच खेला गया। हालांकि मैच बारिश के कारण पूरा नहीं हो सका लेकिन इस दौरान लखनऊ सुपरजाइंट्स के सपोर्ट स्टाफ के सदस्य जॉन्टी रोड्स ने जो किया उसे देखकर उन्हें हर कोई सलाम कर रहा है।","content":"इंडियन प्रीमियर लीग 2023 का 45वां मैच लखनऊ सुपरजाइंट्स और चेन्नई सुपर किंग्स के बीच था। हालांकि मैच बारिश के कारण बाधित रहा। इसके कारण सिर्फ एक ही पारी का खेल हो सका। इससे पहले बारिश के कारण टॉस में भी देरी हुई थी। मैच में चेन्नई के कप्तान महेंद्र सिंह धोनी ने टॉस जीतने के बाद पहले गेंदबाजी का फैसला किया। लखनऊ की टीम ने 19.2 ओवर की ही बल्लेबाजी कर सकी इसके बारिश ने दखल दे दिया। इस दौरान ग्राउंड्स स्टाफ ने जल्दी-जल्दी पिच को कवर्स करने लगे लेकिन इसी बीच लखनऊ के कोचिंग स्टाफ जॉन्टी रोड्स भी ग्राउंड्समैन की मदद के लिए दौड़ पड़े। रोड्स ने उनके साथ कवर्स को खींचते हुए पिच की तरफ लाने में उनकी मदद कर रहे थे। हालांकि इस दौरान स्टेडियम के एक अधिकारी ने उन्हें ऐसा करने से रोका भी लेकिन रोड्स दोबारा उनकी मदद के लिए पहुंच गए। जॉन्टी रोड्स को ऐसा करते हुए जिसने भी देखा उन्हें वह सलाम कर रहा है। इसके अलावा सोशल मीडिया पर भी उनका यह बेहतरीन वीडियो खूब वायरल हो रहा है। जॉन्टी रोड्स की पहचान दुनिया के सबसे बेहतरीन फील्डरों में होती थी। उनके आगे से कोई भी बल्लेबाज रन चुराने के लिए 10 बार सोचता था क्योंकि चीते की फुर्ती रखने वाले रोड्स पलक झपकते ही किसी रन आउट कर देते थे। जॉन्टी रोड्स साउथ अफ्रीका के लिए 52 टेस्ट, 245 वनडे मैच खेल चुके। टेस्ट क्रिकेट में उन्होंने 2532 रन बनाए हैं जबकि वनडे में उनके नाम 5935 रन दर्ज है। वनडे में रोड्स ने 2 शतक और 33 अर्धशतक बनाए। लखनऊ सुपरजाइंट्स के लिए आईपीएल में यह 10वां मैच था। इस दौरान टीम के खाते में पांच जीत आई जबकि एक मैच का कोई नतीजा नहीं निकला और 4 मैच में उसे हार का सामना करना पड़ा। इस कारण अब उसके 11 पॉइंट्स हो गए जिसके कारण वह दूसरे स्थान पर पहुंच गया है।","pubDate":"2023-05-03 17:07:41","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"“Gautam Gambhir and Virat Kohli’s Feud Takes Center Stage After LSG vs RCB Match”","link":"https://www.gudstory.com/gambhir-and-kohli-feud-takes-center-stage-after-lsg-vs-rcb-match/","keywords":["Cricket","Gambhir","Kohli"],"creator":["Vishnu Reddy"],"video_url":null,"description":"The match between LSG and RCB was an intense one, with both teams putting up a great fight. However, what stole the limelight was the ugly fight between Gautam Gambhir and Virat Kohli towards the end of the match. Virat Kohli and Gautam Gambhir got involved in a verbal fight after Royal Challengers Bangalore’s (RCB) […] The post “Gautam Gambhir and Virat Kohli’s Feud Takes Center Stage After LSG vs RCB Match” appeared first on Gud Story.","content":"Home Sports Cricket “Gautam Gambhir and Virat Kohli’s Feud Takes Center Stage After LSG vs RCB Match” by Vishnu Reddy May 3, 2023 in Cricket Reading Time: 3 mins read 0 Virat Kohli and Gautam Gambhir (Image Credit: Twitter) Share on Facebook Share on Twitter Table of Contents The aftermath of the confrontation between Gambhir and Kohli The match between LSG and RCB was an intense one, with both teams putting up a great fight. However, what stole the limelight was the ugly fight between Gautam Gambhir and Virat Kohli towards the end of the match. Virat Kohli and Gautam Gambhir got involved in a verbal fight after Royal Challengers Bangalore’s (RCB) win against Lucknow Supergiant’s (LSG). As the two franchises shook hands after the conclusion of the match, it was Kohli and Gambhir who grabbed eyeballs as they were seen engaging in an argument. Notably, Gambhir was seen pointing fingers at Kohli upon which the latter did not hold back and charged towards him. It seems like Gambhir wanted to confront Virat Kohli about his chats with Naveen-ul-Haq when the latter was batting in a tense chase. There were also finger-on-mouth celebrations from Virat Kohli when he took the catch of Krunal, perhaps responding to a similar celebration from Gambhir when LSG had defeated RCB at the Chinnaswamy earlier this season. “Virat Kohli was abusing Naveen . I intervened and told K Mayers to go and ask him what colour is your IPL Trophy . After listening to that he came up to me & complained . I asked him to put his 50+ score in WC knockouts on the table , he left”. Gautam Gambhir via Cricbuzz The aftermath of the confrontation between Gambhir and Kohli Virat Kohli and Gautam Gambhir confrontation after LSG vs RCB match (Image Credit: Twitter) The confrontation between Gautam Gambhir and Virat Kohli during the LSG vs RCB match was a surprising and unfortunate event. Following the incident, both players were fined 100% of their match fees.The incident also received widespread coverage in the media, and many people were left wondering what would happen next. Fortunately, both players were able to put the incident behind them and move forward. They issued statements apologizing for their behavior and expressing their desire to move on from the incident. Overall, while the confrontation was certainly regrettable, it is good to see that both were able to learn from their mistakes and move on. ADVERTISEMENT Sport can be a highly charged and emotional activity, and it is important for players to remember to stay calm and composed, even in the heat of the moment. By doing so, they can help to ensure that the game remains enjoyable and fair for everyone involved. The recent ugly fight between Gambhir and Kohli after the LSG vs RCB match has brought to light the need for a more professional attitude in the world of cricket. While it’s understandable that emotions can run high during a game, resorting to physical altercations is never acceptable. Both players were fined 100% of their match fee, a clear signal that such behavior will not be tolerated. It’s important for players to remember that they are role models for the millions of fans who look up to them. They should strive to set an example of fair play and sportsmanship, both on and off the field. Let’s hope that this incident serves as a wake-up call for all cricket players to conduct themselves in a professional and respectful manner. Read More: Kevin Durant Lauds Steph Curry for Breaking His Game 7 Scoring Record Tags: Gambhir Kohli Related Posts ICC World Cup 2023 Schedule, Teams, Venues May 1, 2023 The IPL is on track to Surpass the NFL, Says IPL Founder Lalit Modi April 30, 2023 Andre Russell Not Pleased, Holds Entire KKR Team Accountable for Loss to GT April 29, 2023 Our bowlers will come back strong: Wasim Jaffer April 29, 2023","pubDate":"2023-05-03 17:03:15","image_url":null,"source_id":"gudstory","category":["sports"],"country":["india"],"language":"english"},{"title":"Premier Cricket Standings & Top Performers","link":"https://bernews.com/2023/05/bermuda-premier-cricket-standings-top-performers/","keywords":["All","Sports","#BermudaCricket"],"creator":["temp"],"video_url":null,"description":"After the first week of Bermuda Premier Division Cricket action, we take a look at the top performers and the league standings. Terryn Fray from Bailey’s bay was the only batsman to score a half Century with a knock of 52, while Dion Stovell from Cleveland County was the weekends top bowlers with figures of […]","content":"After the first week of Bermuda Premier Division action, we take a look at the top performers and the league standings. Terryn Fray from Bailey’s bay was the only batsman to score a half Century with a knock of 52, while Dion Stovell from Cleveland County was the weekends top bowlers with figures of 9.3-1-30-7. Cleveland County are the League leaders on net run rate over the St. George’s Cricket Club and Bailey’s Bay, all three teams have 10 points. Cleveland County has a Net Run Rate of 4.541, the St. George’s Cricket Club has a net run rate of 1.900. : ,","pubDate":"2023-05-03 23:00:39","image_url":null,"source_id":"bernews","category":["sports"],"country":["Bermuda"],"language":"english"},{"title":"Man Who Ran Away From Delhi Cricket…, Gautam Gambhir Posts Cryptic Tweet","link":"https://www.thetimesofbengal.com/sports/man-who-ran-away-from-delhi-cricket-gautam-gambhir-posts-cryptic-tweet/","keywords":["Sports"],"creator":["admin"],"video_url":null,"description":"Home Sports ‘Man Who Ran Away From Delhi Cricket…’, Gautam Gambhir Posts Cryptic Tweet Former India cricketer and the current mentor of IPL franchise Lucknow Super Giants, Gautam Gambhir, who has been in the eye of storm since his on-field confrontation with Royal Challengers Bangalores Virat Kohli, posted a cryptic tweet on Wednesday, leaving cricket […]","content":"New Delhi, May 4: Former India cricketer and the current mentor of IPL franchise Lucknow Super Giants, Gautam Gambhir, who has been in the eye of storm since his on-field confrontation with Royal Challengers Bangalores Virat Kohli, posted a cryptic tweet on Wednesday, leaving cricket fans puzzled. The BJP MP took to his official Twitter handle to share a post, where he wrote: “Man who ran away from Delhi Cricket citing ‘pressure’ seems over eager to sell paid PR as concern for cricket! Yahi Kalyug Hai, Jaha Bhagode’ Apni Adalat Chalate Hai! (This is Kalyug where ‘fugitives’ run their ‘court’).” However, it was not clear as to who Gambhir was referring to. The rivalry between Gambhir and Kohli reignited on Monday when they came face-to-face after the RCB vs LSG match. Gambhir and Kohli were seen arguing over an incident that developed during the match. Kohli was deeply agitated during LSG’s innings and was even involved in a couple of ugly face-offs with Naveen-ul-Haq and Amit Mishra of LSG. An eyewitness, who was in one of the team dug-outs, gave a lowdown of events to PTI. “You saw on TV that Mayers and Virat were walking side by side for a few metres post match. Mayers asked Kohli why was he constantly abusing them and Virat, in turn, questioned why was he (Mayers) ‘staring’ at him? Before that (Amit) Mishra had complained to umpire about Virat constantly abusing Naveen (ul-Haq), who is a No. 10 batter. “Gautam, sensing that things could turn ugly, pulled Mayers and told him not to have a conversation, when Virat made a comment. The heated exchange that followed seemed a bit juvenile,” he said. “Gautam asked ‘Kya bol raha hain bol’ (What were you saying?) and Virat replied, ‘Maine aapko kuch bola hi naahin, aap kyon ghus rahein ho’ (Why are you coming in between when I haven’t told you anything). “Gautam responded, ‘Tuney agar mere player ko bola hai, matlab tune meri family ko gaali diya hai. (You abused my player and that’s like abusing my family) and Virat’s reply was, ‘Toh aap apne family ko sambhal ke rakhiye’. (Then you take care of your family). “Gambhir’s final reply before they were separated was, ‘Toh ab tu mujhe sikhayega…’ (So now I have to learn from you…).” The eyewitness said that while it was tense and a blow away from turning into a free-for-all, it all seemed a bit juvenile at both ends. (With Agency Inputs) $(document).ready(function(){ $('#commentbtn').on(\"click\",function(){ (function(d, s, id) { var js, fjs = d.getElementsByTagName(s)[0]; if (d.getElementById(id)) return; js = d.createElement(s); js.id = id; js.src = \"https://connect.facebook.net/en_US/all.js#xfbml=1&appId=178196885542208\"; fjs.parentNode.insertBefore(js, fjs); }(document, 'script', 'facebook-jssdk')); $(\".cmntbox\").toggle(); }); }); Source link","pubDate":"2023-05-03 21:17:49","image_url":null,"source_id":"the_tob","category":["sports"],"country":["india"],"language":"english"},{"title":"Fastest women’s bowler Shabnim Ismail retires from international cricket","link":"https://a-sports.tv/fastest-women-bowler-shabnim-ismail-retires/","keywords":["Cricket","Sports","Top News","Top Picks","Shabnim Ismail"],"creator":["AFP"],"video_url":null,"description":"South African fast bowler Shabnim Ismail, who is credited with sending down the quickest delivery in women’s cricket, announced her retirement from the international game on Wednesday. During the T20 World Cup semi-final against England in Cape Town in February she bowled a 128kmh (80mph) delivery – the fastest recorded in the women’s game. Shabnim […] The post Fastest women’s bowler Shabnim Ismail retires from international cricket appeared first on ASports.tv.","content":"During the T20 World Cup semi-final against England in Cape Town in February she bowled a 128kmh (80mph) delivery – the fastest recorded in the women’s game. Shabnim Ismail, 34, said in a statement issued by Cricket South Africa that she wanted to spend more time with her family but would continue to be available to play in domestic Twenty20 tournaments around the world. She ended her international career on a high when she was a member of the first South African team, men or women, to reach a World Cup final. She took two for 26 in the final against Australia in Cape Town but it was not enough to prevent Australia winning their fifth title. Ismail made her international debut as a teenager in 2007 and went on to appear in 241 international matches. She took 191 wickets in 127 one-day internationals, second only to India’s Jhulan Goswami, and took 123 wickets in T20 internationals to be fourth on the all-time list. She took three wickets in her only Test match against the Netherlands in 2007. She missed South Africa’s one-off Test in England in 2022 because of injury. “As any athlete knows, training and competing at your best requires much sacrifice and dedication, and I now find myself wanting to spend more time with my family, particularly my siblings and parents as they get older,” Ismail said in her statement.","pubDate":"2023-05-03 19:34:54","image_url":null,"source_id":"arynews","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"IPL 2023: Punjab dazzle; Mumbai out-dazzles","link":"https://indianexpress.com/article/sports/ipl/ipl-2023-punjab-dazzle-mumbai-out-dazzles-8590169/","keywords":["IPL 2023","Sports"],"creator":["Sriram Veera"],"video_url":null,"description":null,"content":"Synopsis: Surya-Kishan dazzle to make a mockery of a 200-plus chase after Chawla stars even as Jitesh Sharma flays a weak Mumbai bowling attack Surya-Kishan dazzle When Cameron Green swished wildly and missed continuously after Rohit Sharma had exited the third ball, the 215-run chase seemed to be going nowhere. But when Rishi Dhawan made the mistake of bowling length, Ishan Kishan had two murderous swings to thwack them over the onside boundary. Though Green fell in the next over, the sixth of the innings, the game would change with the arrival of Suryakumar Yadav. Recommended for you 1 IPL 2023, PBKS vs MI emotional rollercoaster: Tilak Varma the finisher, Matthew Short loves short stuff and unlucky Jofra Archer 2 Man who ran away from Delhi Cricket citing pressure…: Gautam Gambhir posts cryptic tweet 3 Watch: Stunned Marcus Stoinis confirms his dismissal from umpire after a dreamy Ravindra Jadeja ball castles his stumps The momentum completely switched in the middle overs between the 9th to 11th against Punjab’s spinners Rahul Chahar and Harpreet Brar. With the pitch a batting beauty by then, Kishan went so hard at the spinners; they had the feel of the slogs with his scything bat-swings that finish over his shoulder but the ball traversed in the conventional spaces like straight down the ground. As many as 38 runs came in those 3 overs and there was a discernible shift in the game: Punjab couldn’t now depend on the spinners and had to drag in the seamers. But if Kishan plundered spin, Surya robbed the pacers with a smile on his face. 100- partnership up in no time! @ishankishan51 & @surya_14kumar have made this chase look effortless so far. Follow the match – https://t.co/QDEf6eqX22 #TATAIPL | #PBKSvMI pic.twitter.com/qERm0rYWzE — IndianPremierLeague (@IPL) May 3, 2023 Not that there is an absence of a naturalness in Suryakumar’s batting, but that constructed idea of modern-day T20 batting has seeped in so naturally. He hits into unique places with ultra-powerful wrists. He still comes from the same solid base that is nonnegotiable but if one were to list out its mechanics – the various terms like ‘set-up at crease’, ‘shape’, ‘unweighting of bat’, ‘correct position’, can be used. He walloped Sam Curran for two fours and two sixes in the 13th over that went for 27 that seemed to settle any doubts about where the game was heading. The first ball was a SKY Special, a full-length ball outside off not sliced or squeezed or squirted away but with that rubber-wrist he gracefully sliced it up and over backward point for a splendid six. The next ball from Curran was a weak length ball outside off and Surya went down on his knee to dispose it over cover boundary, and held his pose as well. The next was a fuller, attempted yorker perhaps, but Surya whip-flicked it right past a startled Curran who took evasive action rather than attempt any heroic catch. Then came the Surya sweep, where he finishes up as if he were throwing a towel over his shoulder. 𝙎𝙈𝘼𝘾𝙆𝙀𝘿! Fifty partnership up between Ishan Kishan & SKY 1️⃣0️⃣0️⃣ up for Mumbai Indians 🔥🔥 Follow the match ▶️ https://t.co/QDEf6eqX22 #TATAIPL | #PBKSvMI pic.twitter.com/WL7fnpiI8b — IndianPremierLeague (@IPL) May 3, 2023 Both fell in the end overs but with the satisfaction that the job was done and Tilak Varma ensured it was a done deal, smoking in a few big hits. That’s that from Match 46. @mipaltan register a 6-wicket win against #PBKS to add to crucial points to their tally. #MI chase down the target in 18.5 overs. Scorecard – https://t.co/IPLsfnImuP #TATAIPL #PBKSvMI #IPL2023 pic.twitter.com/SeKR48s9Vv — IndianPremierLeague (@IPL) May 3, 2023 Chawla stars Piyush Chawla has the most wickets (14) in the overs between 7 and 15. He bossed the middle overs yet again against Punjab Kings , taking out Shikhar Dhawan and Matt Short with his two different googlies. Piyush Chawla gets the key breakthrough! Shikhar Dhawan steps down, but is stumped by Ishan Kishan. Live – https://t.co/IPLsfnImuP #TATAIPL #PBKSvMI #IPL2023 pic.twitter.com/fd4blfWR11 — IndianPremierLeague (@IPL) May 3, 2023 Dhawan’s dismissal was a peach; Short’s was always coming. Dhawan had just charged him to ping the straight boundary and came out again but Chawla had the experience to anticipate that. He went slightly wider and slid that finger-googly across Dhawan who couldn’t connect with his flail and was stumped. Chawla’s other googly is the back-of-the-hand version when he wants it to spin more and a lot slower. The finger-one comes with pace and camouflage. And so, he tossed up the back-of-the-hand wrong’un to Short, who had an almighty swing at it, was too early with his hack, and was bowled. 8️⃣2️⃣ runs 4️⃣2️⃣ balls 7️⃣ fours 6️⃣ sixes It was raining fours and sixes courtesy of @liaml4893 ‘s supreme striking 💥💥 #TATAIPL | #PBKSvMI Sit back and enjoy the Livingstone storm 🎥🔽 https://t.co/rTO5jP6pG7 — IndianPremierLeague (@IPL) May 3, 2023 Jofra’s nightmarish night It didn’t help their cause that Jofra Archer’s elbow hasn’t quite healed yet. Or so it seemed; Brett Lee definitely thought so as he started to count the high number of slower ones that Archer bowled on a loop suggesting, “the elbow is still sore”. As he continued to leak runs (21 in his 2nd, and 27 in his final) Lee’s verdict turned more critical. “If you can’t do what you have been paid to do, then you are better off to go off the field … he is masking his sore elbow (with the slower ones).” And when Robin Uthappa suggested it could be difficult to comeback after injury, Lee didn’t let that sentiment linger: “Sorry, it comes to mind. You have to trick your body to forget the pain and bowl.” Jitesh’s poise Also Read 'I have come to play in the IPL, not to take abuses,' says Naveen-ul-Haq:... Man who ran away from Delhi Cricket citing pressure...: Gautam Gambhir po... KL Rahul likely to miss remainder of IPL, doubtful for WTC Final Blow-by-blow of Kohli-Gambhir spat: A flashpoint on field after a free-hi... Advertisement There is an absence of bossiness in Jitesh’s body language at the crease. Quite calm, steady, and no discernible predetermination. In some sense, his set up at the crease reminds one of the Sri Lankan dasher Tillakaratne Dilshan, in his furious swings off length deliveries and in the square slices through point balls that fall just short of yorker. Like Dilshan, Jitesh too likes to play the laps over short fine-leg, though on Wednesday night, he shelved it completely, instead focussing on going downtown. Jitesh Sharma got going immediately with the bat and stitched a solid partnership with Liam Livingstone 💪🏻 #TATAIPL | #PBKSvMI Revisit his knock here 🎥🔽 https://t.co/xkpooOEX2N — IndianPremierLeague (@IPL) May 3, 2023 And to think he was an opener, until after a dip in form post 2017, he worked on his skills to convert himself into a finisher. As he told this newspaper, “As an opener it is very difficult to get into any IPL team. I was well aware. There was a dip also. Post 2017, I was not able to perform well. I worked on my skills.” He and Livingstone did their best, but were out-dazzled by the Surya-Kishan show.","pubDate":"2023-05-03 18:33:58","image_url":null,"source_id":"indianexpress","category":["sports"],"country":["india"],"language":"english"},{"title":"PAK vs NZ: All-round Pakistan edge New Zealand to seal series triumph","link":"https://a-sports.tv/pak-vs-nz-all-round-pakistan-edge-new-zealand-to-seal-series-triumph/","keywords":["Cricket","PAK vs NZ","Sports","Top News","Top Picks"],"creator":["A Sports"],"video_url":null,"description":"KARACHI: Dominant Pakistan put on an all-round show to storm past New Zealand in the third PAK vs NZ ODI to win the five-match series 3-0 with two games to spare. Watch PAK vs NZ Live Match in HD Streaming The third PAK vs NZ ODI of the five-match series was played here at the National […] The post PAK vs NZ: All-round Pakistan edge New Zealand to seal series triumph appeared first on ASports.tv.","content":"The third PAK vs NZ ODI of the five-match series was played here at the National Bank Cricket Arena here on Wednesday. New Zealand captain Tom Latham opted to bowl first after the coin flipped in his favour. Pakistan, in response, put up a decent total on the scoreboard at the back of brilliant half-centuries by Imam-ul-Haq and . Imam-ul-Haq smashed seven boundaries and a six on his way to top score for Pakistan with a 107-ball 90. Babar Azam, on the other hand, was also impressive with the bat as he notched up 54 runs in 62 balls, laced up with three boundaries and a six. The target set by the green shirts turned out to be too much for as they succumbed to their third straight defeat in the ongoing five-match series despite a brilliant start by their openers – Will Young and Tom Blundell. Blundell remained the top scorer for the touring side with a 78-ball 65, which featured seven boundaries.","pubDate":"2023-05-03 18:26:05","image_url":null,"source_id":"arynews","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"India overtake Australia at top of ICC Test rankings","link":"https://www.khmertimeskh.com/501284264/india-overtake-australia-at-top-of-icc-test-rankings/","keywords":["Sports","India","test"],"creator":["Ayman"],"video_url":null,"description":"India overtook Australia on Tuesday to go number one in new Test rankings issued by the International Cricket Council, while also retaining the top position in T20s. The post India overtake Australia at top of ICC Test rankings appeared first on Khmer Times.","content":"NEW DELHI – India overtook Australia on Tuesday to go number one in new Test rankings issued by the International Cricket Council, while also retaining the top position in T20s. England remained number three in Tests but reduced the gap behind the top two teams significantly, the rankings published by the ICC showed. England have won 10 out of 12 Tests since captain Ben Stokes and coach Brendon McCullum joined forces last year following a woeful run of one win in 17 matches. The new annual rankings reflect all series completed since May 2020 and drop results from the 2019-20 season, the ICC said. India last topped the Test rankings for a month in December 2021, while Australia has been number one since January 2022 after hammering England 4-0 in the Ashes. The table remained otherwise unchanged, with South Africa fourth and New Zealand fifth ahead of Pakistan, Sri Lanka, West Indies, Bangladesh and Zimbabwe. Afghanistan and Ireland have yet to play enough Tests to earn a place in the rankings table. India remained number one in the T20 rankings, increasing their lead over second-placed England, while New Zealand overtook Pakistan and South Africa to be third. Australia are sixth ahead of West Indies, Sri Lanka, Bangladesh and Afghanistan. The new rankings for one-day internationals will be released on May 10. AFP","pubDate":"2023-05-03 18:02:22","image_url":null,"source_id":"khmertimeskh","category":["sports"],"country":["Cambodia"],"language":"khmer"},{"title":"कौन है आकाश मधवाल... जिन्होंने IPL डेब्यू में लूट ली महफिल, डेथ ओवर में धारदार गेंदबाजी से मचाया बवाल","link":"https://navbharattimes.indiatimes.com/sports/cricket/iplt20/news/ipl-2023-pbks-vs-mi-akash-madhwal-who-did-debut-against-punjab-kings/articleshow/99968531.cms","keywords":null,"creator":null,"video_url":null,"description":"PBKS vs MI: पंजाब किंग्स और मुंबई इंडियंस के बीच मोहाली में खेला गया। इस मैच में मुंबई के लिए नेट गेंदबाद रह चुके आकाश मधवाल को मुंबई इंडियंस के लिए डेब्यू करने का मौका मिला। वह अपने डेब्यू मैच में ही छा गए।","content":"आईपीएल 2023 का 46वां मुकाबला पंजाब किंग्स और मुंबई इंडियंस के बीच बुधवार को मोहाली में खेला जा रहा है। इस मैच में मुंबई के कप्तान रोहित शर्मा ने टॉस जीतकर पहले गेंदबाजी करने का फैसला किया था। जोकि बिल्कुल भी असरदार साबित नहीं हुआ। पंजाब किंग्स ने निर्धारित 20 ओवर में 3 विकेट के नुकसान पर 214 रन बोर्ड पर लगा दिए। हालांकि राइली मेरेडिथ के चोटिल होने की वजह से मुंबई ने पंजाब के खिलाफ युवा तेज गेंदबाज आकाश मधवाल को डेब्यू करने का मौका दिया। गौरतलब है कि 200 रन खाने के बावजूद आकाश मुंबई की इस निराशाजनक गेंदबाजी में छा गए। दाएं हाथ के तेज गेंदबाज आकाश मधवाल ने पंजाब किंग्स के खिलाफ अपने पहले ही मुकाबले में तुज तर्रार गेंदबाजी से सुर्खियां बटोर ली। भले ही पीबीकेएस के खिलाफ आकाश ने 3 ओवर में 37 रन दिए हो। लेकिन उन्होंने डेथ ओवर में अपनी सटीक गेंदबाजी से सबका दिल जीत लिया। कप्तान रोहित शर्मा ने मधवाल से पहला ओवर पंजाब की पारी के 11वें ओवर में करवाया। इस ओवर में आकाश काफी महंगे साबित हुए। उन्होंने इस ओवर में 16 रन खर्च किए। हालांकि इसके बाद उन्होंने डेथ ओवर में अपना असली जादू दिखाया। रोहित ने आकाश से फिर 18वां और 20वां ओवर करवाया। जहां 18वें ओवर में आकाश ने 12 रन दिए तो वहीं आखिरी ओवर में सिर्फ 9 रन लुटाए। टी20 में पारी के आखिरी ओवर में महज 9 रन देना अपने आप में एक बहुत बड़ी बात है। आकाश ने इस मैच में चाहे अपनी पहली आईपीएल विकेट नहीं ली हो। लेकिन उन्होंने इस मैच में अपनी काबिलियत को बखूबी साबित किया। मुंबई के लिए नीली जर्सी में कमाल करने वाले आकाश मधवाल डोमेस्टिक क्रिकेट में उत्तराखंड से खेलते हैं। मुंबई इंडियंस ने आईपीएल 2022 में सूर्यकुमार यादव के चोटिल होने के बाद आकाश को अपनी टीम में बतौर रिप्लेसमेंट शामिल किया था। हालांकि उन्हें पिछले सीजन डेब्यू करने का मौका नहीं मिला था। लेकिन इसके बाद आईपीएल 2023 के मेगा ऑक्शन से पहले मुंबई ने इस तेज गेंदबाज को 20 लाख में रिटेन कर लिया था। बता दें कि आकाश का जन्म 25 नवंबर 1993 में रुड़की में हुआ था। इसके अलावा 29 वर्षीय आकाश के डोमेस्टिक करियर की बात करें तो, उन्होंने अपने फर्स्ट क्लास करियर का डेब्यू 2019 में किया था। जब से अब तक उन्होंने प्रथम श्रेणी क्रिकेट में 10 मैच खेले हैं, जिसमें उन्होंने 12 विकेट लिए हैं। इसके अलावा लिस्ट ए में 17 मैच में 18 तो 22 टी20 मैचों में आकाश ने 24 विकेट अपने नाम किए हैं।","pubDate":"2023-05-03 17:48:55","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"ईशान और सूर्या की तूफानी फिफ्टी के आगे ढेर हुए पंजाब के शेर, घर में घुसकर पूरा किया बदला","link":"https://navbharattimes.indiatimes.com/sports/cricket/iplt20/news/ipl-2023-pbks-vs-mi-match-highlights-report-ishan-kishan-and-surya-kumar-yadav-fifty/articleshow/99968522.cms","keywords":null,"creator":null,"video_url":null,"description":"PBKS vs MI, Highlights: इंडियन प्रीमियर लीग 2023 के 46वें मैच में ईशान किशन और सूर्यकुमार यादव की तूफानी फिफ्टी से मुंबई इंडियंस ने पंजाब किंग्स को उसके घर में 6 विकेट से हरा दिया। मैच में पंजाब की टीम ने पहले बल्लेबाजी करते हुए 214 रन का स्कोर खड़ा किया था जिसे मुंबई ने 18.5ओवर में ही हासिल कर लिया।","content":"ईशान किशन और सूर्यकुमार यादव की तूफानी फिफ्टी से मुंबई इंडियंस ने पंजाब को किंग्स को 6 विकेट से हरा दिया। दोनों टीमों के बीच यह मुकाबला मोहाली में खेला गया था और इंडियन प्रीमियर लीग 2023 का 46वां मैच था। इस मैच में मुंबई के कप्तान रोहित शर्मा ने टॉस जीतने के बाद पहले गेंदबाजी का फैसला किया था। मैच में पंजाब किंग्स ने पहले बल्लेबाजी करते हुए निर्धारित 20 ओवर के खेल में 214 रनों का स्कोर खड़ा किया था जिसके जवाब में मुंबई ने 7 गेंद शेष रहते ही मैच को अपने नाम कर लिया। पंजाब के खिलाफ लक्ष्य का पीछा करते हुए मुंबई इंडियंस की शुरुआत कुछ खास नहीं रही थी। कप्तान रोहित शर्मा बिना खाता खोले ही पवेलियन वापस लौट गए थे। हालांकि इसके बाद ईशान ने मुंबई के लिए मोर्चा संभाल लिया। ईशान को कुछ के लिए कैमरून ग्रीन का साथ मिला लेकिन असली रंग जमा ग्रीन के आउट के होने बाद। कैमरून ग्रीन 18 गेंद में 23 रन बनाकर आउट हुए। इसके बाद सूर्यकुमार यादव क्रीज पर बल्लेबाजी के लिए उतरे। उसके बाद फिर क्या था। दोनों छोर से पंजाब के गेंदबाजों की जमकर पिटाई। ईशान और सूर्या के बीच 100 से अधिक रनों की साझेदारी हुई। ईशान किशन मुंबई के लिए 41 गेंद में 75 रनों की पारी खेलकर आउट हुए। अपनी इस पारी में उन्होंने 7 चौके और 4 छक्के भी लगाए। वहीं सूर्यकुमार यादव 31 गेंद में 66 रन बनाए। इस दौरान उन्होंने 8 चौके और 2 छक्के लगाए। हालांकि जि अंदाज में ये दोनों बल्लेबाजों ने अपना खेल दिखाया ऐसा लगा कि वह टीम को जीत दिला कर ही वापस लौटेंगे लेकिन ऐसा नहीं हो पाया। ईशान और सूर्या के आउट के बाद भी मुंबई की रन गति में कमी नहीं आई। टीम के लिए तिलक वर्मा और टिम डेविड ने टीम को आसान जीत दिला दी। टिम डेविड ने 10 गेंद में 19 रनों की पारी खेली जबकि वर्मा ने 10 गेंद में 26 की तूफानी पारी खेली।","pubDate":"2023-05-03 17:47:47","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"दिग्गज से नहीं देखी गई ग्राउंड्समैन की परेशानी, दौड़ कर बढ़ाया मदद का हाथ, जिसने भी देखा किया सलाम","link":"https://navbharattimes.indiatimes.com/sports/cricket/iplt20/news/ipl-2023-lsg-vs-csk-jonty-rhodes-helps-grounds-man-during-rain-video-goes-viral-on-social-media/articleshow/99967187.cms","keywords":null,"creator":null,"video_url":null,"description":"IPL 2023: इंडियन प्रीमियर लीग 2023 का 45वां मैच लखनऊ सुपरजाइंट्स और चेन्नई सुपर किंग्स के बीच खेला गया। हालांकि मैच बारिश के कारण पूरा नहीं हो सका लेकिन इस दौरान लखनऊ सुपरजाइंट्स के सपोर्ट स्टाफ के सदस्य जॉन्टी रोड्स ने जो किया उसे देखकर उन्हें हर कोई सलाम कर रहा है।","content":"इंडियन प्रीमियर लीग 2023 का 45वां मैच लखनऊ सुपरजाइंट्स और चेन्नई सुपर किंग्स के बीच था। हालांकि मैच बारिश के कारण बाधित रहा। इसके कारण सिर्फ एक ही पारी का खेल हो सका। इससे पहले बारिश के कारण टॉस में भी देरी हुई थी। मैच में चेन्नई के कप्तान महेंद्र सिंह धोनी ने टॉस जीतने के बाद पहले गेंदबाजी का फैसला किया। लखनऊ की टीम ने 19.2 ओवर की ही बल्लेबाजी कर सकी इसके बारिश ने दखल दे दिया। इस दौरान ग्राउंड्स स्टाफ ने जल्दी-जल्दी पिच को कवर्स करने लगे लेकिन इसी बीच लखनऊ के कोचिंग स्टाफ जॉन्टी रोड्स भी ग्राउंड्समैन की मदद के लिए दौड़ पड़े। रोड्स ने उनके साथ कवर्स को खींचते हुए पिच की तरफ लाने में उनकी मदद कर रहे थे। हालांकि इस दौरान स्टेडियम के एक अधिकारी ने उन्हें ऐसा करने से रोका भी लेकिन रोड्स दोबारा उनकी मदद के लिए पहुंच गए। जॉन्टी रोड्स को ऐसा करते हुए जिसने भी देखा उन्हें वह सलाम कर रहा है। इसके अलावा सोशल मीडिया पर भी उनका यह बेहतरीन वीडियो खूब वायरल हो रहा है। जॉन्टी रोड्स की पहचान दुनिया के सबसे बेहतरीन फील्डरों में होती थी। उनके आगे से कोई भी बल्लेबाज रन चुराने के लिए 10 बार सोचता था क्योंकि चीते की फुर्ती रखने वाले रोड्स पलक झपकते ही किसी रन आउट कर देते थे। जॉन्टी रोड्स साउथ अफ्रीका के लिए 52 टेस्ट, 245 वनडे मैच खेल चुके। टेस्ट क्रिकेट में उन्होंने 2532 रन बनाए हैं जबकि वनडे में उनके नाम 5935 रन दर्ज है। वनडे में रोड्स ने 2 शतक और 33 अर्धशतक बनाए। लखनऊ सुपरजाइंट्स के लिए आईपीएल में यह 10वां मैच था। इस दौरान टीम के खाते में पांच जीत आई जबकि एक मैच का कोई नतीजा नहीं निकला और 4 मैच में उसे हार का सामना करना पड़ा। इस कारण अब उसके 11 पॉइंट्स हो गए जिसके कारण वह दूसरे स्थान पर पहुंच गया है।","pubDate":"2023-05-03 17:07:41","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"“Gautam Gambhir and Virat Kohli’s Feud Takes Center Stage After LSG vs RCB Match”","link":"https://www.gudstory.com/gambhir-and-kohli-feud-takes-center-stage-after-lsg-vs-rcb-match/","keywords":["Cricket","Gambhir","Kohli"],"creator":["Vishnu Reddy"],"video_url":null,"description":"The match between LSG and RCB was an intense one, with both teams putting up a great fight. However, what stole the limelight was the ugly fight between Gautam Gambhir and Virat Kohli towards the end of the match. Virat Kohli and Gautam Gambhir got involved in a verbal fight after Royal Challengers Bangalore’s (RCB) […] The post “Gautam Gambhir and Virat Kohli’s Feud Takes Center Stage After LSG vs RCB Match” appeared first on Gud Story.","content":"Home Sports Cricket “Gautam Gambhir and Virat Kohli’s Feud Takes Center Stage After LSG vs RCB Match” by Vishnu Reddy May 3, 2023 in Cricket Reading Time: 3 mins read 0 Virat Kohli and Gautam Gambhir (Image Credit: Twitter) Share on Facebook Share on Twitter Table of Contents The aftermath of the confrontation between Gambhir and Kohli The match between LSG and RCB was an intense one, with both teams putting up a great fight. However, what stole the limelight was the ugly fight between Gautam Gambhir and Virat Kohli towards the end of the match. Virat Kohli and Gautam Gambhir got involved in a verbal fight after Royal Challengers Bangalore’s (RCB) win against Lucknow Supergiant’s (LSG). As the two franchises shook hands after the conclusion of the match, it was Kohli and Gambhir who grabbed eyeballs as they were seen engaging in an argument. Notably, Gambhir was seen pointing fingers at Kohli upon which the latter did not hold back and charged towards him. It seems like Gambhir wanted to confront Virat Kohli about his chats with Naveen-ul-Haq when the latter was batting in a tense chase. There were also finger-on-mouth celebrations from Virat Kohli when he took the catch of Krunal, perhaps responding to a similar celebration from Gambhir when LSG had defeated RCB at the Chinnaswamy earlier this season. “Virat Kohli was abusing Naveen . I intervened and told K Mayers to go and ask him what colour is your IPL Trophy . After listening to that he came up to me & complained . I asked him to put his 50+ score in WC knockouts on the table , he left”. Gautam Gambhir via Cricbuzz The aftermath of the confrontation between Gambhir and Kohli Virat Kohli and Gautam Gambhir confrontation after LSG vs RCB match (Image Credit: Twitter) The confrontation between Gautam Gambhir and Virat Kohli during the LSG vs RCB match was a surprising and unfortunate event. Following the incident, both players were fined 100% of their match fees.The incident also received widespread coverage in the media, and many people were left wondering what would happen next. Fortunately, both players were able to put the incident behind them and move forward. They issued statements apologizing for their behavior and expressing their desire to move on from the incident. Overall, while the confrontation was certainly regrettable, it is good to see that both were able to learn from their mistakes and move on. ADVERTISEMENT Sport can be a highly charged and emotional activity, and it is important for players to remember to stay calm and composed, even in the heat of the moment. By doing so, they can help to ensure that the game remains enjoyable and fair for everyone involved. The recent ugly fight between Gambhir and Kohli after the LSG vs RCB match has brought to light the need for a more professional attitude in the world of cricket. While it’s understandable that emotions can run high during a game, resorting to physical altercations is never acceptable. Both players were fined 100% of their match fee, a clear signal that such behavior will not be tolerated. It’s important for players to remember that they are role models for the millions of fans who look up to them. They should strive to set an example of fair play and sportsmanship, both on and off the field. Let’s hope that this incident serves as a wake-up call for all cricket players to conduct themselves in a professional and respectful manner. Read More: Kevin Durant Lauds Steph Curry for Breaking His Game 7 Scoring Record Tags: Gambhir Kohli Related Posts ICC World Cup 2023 Schedule, Teams, Venues May 1, 2023 The IPL is on track to Surpass the NFL, Says IPL Founder Lalit Modi April 30, 2023 Andre Russell Not Pleased, Holds Entire KKR Team Accountable for Loss to GT April 29, 2023 Our bowlers will come back strong: Wasim Jaffer April 29, 2023","pubDate":"2023-05-03 17:03:15","image_url":null,"source_id":"gudstory","category":["sports"],"country":["india"],"language":"english"}]}