{"newsArray":[{"title":"Is Faf du Plessis retired: Faf du Plessis current teams ahead of CSA T20 League 2023","link":"https://thesportsrush.com/cricket-news-is-faf-du-plessis-retired-faf-du-plessis-current-teams-ahead-of-csa-t20-league-2023/","keywords":["Cricket","Faf Du Plessis","Johannesburg Super Kings","RCB","Royal Challengers Bangalore","South Africa"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Is Faf du Plessis retired: The former South African captain continues to be a hotshot in T20 leagues across the globe. Considering the extent of reports doing the rounds in the media, it could be anytime that the Johannesburg franchise of the upcoming South Africa T20 League announce their list of pre-signed five cricketers before… The post Is Faf du Plessis retired: Faf du Plessis current teams ahead of CSA T20 League 2023 appeared first on The SportsRush.","content":"Is Faf du Plessis retired: The former South African captain continues to be a hotshot in T20 leagues across the globe. Considering the extent of reports doing the rounds in the media, it could be anytime that the Johannesburg franchise of the upcoming South Africa T20 League announce their list of pre-signed five cricketers before the auction for the inaugural season next year. Owned by Indian Premier League franchise Chennai Super Kings owners , Johannesburg are said to have acquired the services of former South Africa captain Faf du Plessis and England all-rounder Moeen Ali. Assuming the same emerges out to be the truth, it will add another team to du Plessis’ elongated T20 resume. Having said that, it won’t be a novel association for either of du Plessis or Ali. While the South African had represented Chennai in seven IPL seasons before leading Royal Challengers Bangalore this year, Ali is a part of the current CSK squad. Currently leading Northern Superchargers in The Hundred 2022, du Plessis has also played for Comilla Victorians (Bangladesh Premier League), St Lucia Kings (Caribbean Premier League) and Quetta Gladiators (Pakistan Super League) since last playing a T20I for South Africa. du Plessis, 38, had announced his Test retirement 18 months ago to focus more on T20s. It was about a week after playing his last Test against Pakistan in Rawalpindi that du Plessis had called time on his Test career last year. As far as white-ball formats are concerned, du Plessis continues to remain an active international cricketer. However, despite making his priorities public, du Plessis hasn’t represented South Africa in white-ball cricket since Test retirement. “The next two years are ICC T20 World Cup years. Because of this, my focus is shifting to this format and I want to play as much of it as possible around the world so that I can be the best player I can possibly be,” du Plessis had said while announcing Test retirement. “I strongly believe that I have a lot to offer to the Proteas in this format. This does not mean that ODI cricket is no longer in the plans, I’m just making T20 cricket the priority in the short-term.” Back then, du Plessis had further spoken about speaking to CSA (Cricket South Africa) in order to find a “solution” with respect to balancing between international cricket and T20 leagues. That said, a solution is yet to be found between both the parties. While CSA want du Plessis to commit to South Africa in totality, du Plessis remains keen on playing T20 leagues around the world as well. Since his last international match, du Plessis has played 57 T20s scoring 1,749 runs at an average of 35.69 and a strike rate of 134.54 including two centuries and 11 half-centuries.","pubDate":"2022-08-12 19:56:44","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"KU organises sports events as part of ‘Azadi ka Amrut Mahotsav’ celebrations","link":"https://kashmirreader.com/2022/08/13/ku-organises-sports-events-as-part-of-azadi-ka-amrut-mahotsav-celebrations/","keywords":["SPORTS"],"creator":["KR Desk"],"video_url":null,"description":"Srinagar: Kashmir University’s Directorate of Physical Education and Sports (DPES) Friday organised several sports events as part of the University’s ongoing celebrations related to ‘Azadi Ka Amrut Mahotsav’. Vice-Chancellor Prof Nilofer Khan visited the Sports Ground to interact with players of Volleyball and Cricket teams who are participating in the ongoing sports events related to […]","content":"Srinagar: Kashmir University’s Directorate of Physical Education and Sports (DPES) Friday organised several sports events as part of the University’s ongoing celebrations related to ‘Azadi Ka Amrut Mahotsav’. Vice-Chancellor Prof Nilofer Khan visited the Sports Ground to interact with players of Volleyball and Cricket teams who are participating in the ongoing sports events related to ‘Azadi Ka Amrut Mahotsav’, the celebration of country’s 75th year of Independence as a special occasion. Prof Nilofer said she is glad to observe that the DPES has been holding regular sports events which provide a great encouragement to the students to actively participate in them. “Sports promotion is one of our prime focus areas to realise the objective of holistic development of our students, including girl students who are now coming forward in huge numbers to participate in sports events and win laurels for the country,” Prof Nilofer said, adding that University of Kashmir will hold more sports events as part of Azadi Ka Amrut Mahotsav celebrations in coming days. Registar Dr Nisar Ahmad Mir also accompanied the Vice-Chancellor and encouraged students to continue participating in sports activities for their overall physical and mental well-being. The Registar assured University’s full support to sports events involving participation of students from the University and its affiliated colleges and satelite campuses. Officials and coaches of DPES, including Dr Surjit, were also present on the occasion.   KR Desk","pubDate":"2022-08-12 19:29:30","image_url":null,"source_id":"kashmirreader","country":["india"],"category":["sports"],"language":"english"},{"title":"Pollard, Pooran and Bravo to play UAE’s ILT20","link":"https://kashmirreader.com/2022/08/13/pollard-pooran-and-bravo-to-play-uaes-ilt20/","keywords":["SPORTS"],"creator":["Press Trust of India"],"video_url":null,"description":"DUBAI: Former West Indies white ball captain Kieron Pollard, current captain Nicholas Pooran and superstar Dwayne Bravo have signed for the cash-rich International League T20 (ILT20), which will be run by majority of IPL franchises under the aegis of Emirates Cricket Board. The ILT20’s inaugural edition is expected to start in January, 2023. “Having recently […]","content":"DUBAI: Former West Indies white ball captain Kieron Pollard, current captain Nicholas Pooran and superstar Dwayne Bravo have signed for the cash-rich International League T20 (ILT20), which will be run by majority of IPL franchises under the aegis of Emirates Cricket Board. The ILT20’s inaugural edition is expected to start in January, 2023. “Having recently announced some of the biggest names in global T20 cricket today, the league bolsters their roster by adding more impressive names to their list of Marquee Players. Those joining this illustrious list include; Kieron Pollard, Nicholas Pooran, Dwayne Bravo, Dasun Shanaka, Ollie Pope, Fazalhaq Farooqi,” a media release stated. Speaking on the latest list of players to join the League, Mubashshir Usmani, Emirates Cricket’s General Secretary said: “Our team continues to be impressed with the quality of talent that has committed to participating in the ILT20.” “We are very pleased to see the list of Marquee players grow in stature which is evident through our latest reveal, and we are encouraged to see exciting, emerging talent join such experienced names from world cricket,” Usmani said. The latest list of players also includes Will Smeed, Rehan Ahmed, Jordan Thompson, Sheldon Cottrell, Andre Fletcher, Tom Kohler-Cadmore, Bas de Leede, Chris Benjamin and Bilal Khan. Making its debut in January (2023), the inaugural ILT20, which has received multi-year ICC approval, will be played in a 34-match format across Dubai, Abu Dhabi and Sharjah. —Agencies Franchise owners include Reliance Industries, Kolkata Knight Riders, Capri Global, GMR, Lancer Capital, and Adani Sportsline.   Press Trust of Indiakashmirreader.com","pubDate":"2022-08-12 19:28:41","image_url":null,"source_id":"kashmirreader","country":["india"],"category":["sports"],"language":"english"},{"title":"India need to decide between Rishabh Pant, Dinesh Karthik: Saba Karim","link":"https://kashmirreader.com/2022/08/13/india-need-to-decide-between-rishabh-pant-dinesh-karthik-saba-karim/","keywords":["SPORTS"],"creator":["Press Trust of India"],"video_url":null,"description":"NEW DELHI: Former India wicketkeeper-batter Saba Karim feels that the side has to decide between keeping either of Rishabh Pant or Dinesh Karthik in the playing eleven. With the Asia Cup starting from August 27 in the UAE, the tournament presents a chance for India to sort out their playing eleven composition ahead of Men’s […]","content":"NEW DELHI: Former India wicketkeeper-batter Saba Karim feels that the side has to decide between keeping either of Rishabh Pant or Dinesh Karthik in the playing eleven. With the Asia Cup starting from August 27 in the UAE, the tournament presents a chance for India to sort out their playing eleven composition ahead of Men’s T20 World Cup in Australia in October-November. Since his comeback in T20I cricket in June, Karthik has been bringing out the required finishing acts and effectively sealing the finisher spot in the Indian team. A 27-ball 55 on a tough pitch against South Africa at Rajkot and an unbeaten 19-ball 41 on a tricky pitch against West Indies at Trinidad have been some examples of Karthik’s finishing role benefitting India in recent times. On the other hand, Pant has had a mixed run apart from being tried as an opener twice against England. Since the T20I series against South Africa in June, where he was the stand-in skipper, Pant’s highest score has been 44 in fourth T20I against West Indies at Lauderhill, USA. “I feel that to get the balance right, India has done well with five bowlers plus Hardik Pandya as a 6 bowling options. So would you like to break that kind of a combination and get in another bat at number 7 that is Dinesh Karthik at number 7? That means that you go in with Hardik Pandya the fifth bowler who is expected to bowl 4 overs, so that is another big call from the Indian team management.” “So then if so that that may pose some issues for the Indian team management. Whatever I have seen from Rohit Sharma’s captaincy, I think he prefers to have five regular bowlers plus Hardik Pandya as their six bowling option. If that is the case then you need to decide between Rishabh Pant and Dinesh Karthik,” said Karim on a show on Sports18. —Agencies Karim added that deciding between keeping Pant or Karthik in the eleven will help in India sorting the number four spot in T20Is. “Yes, you better need to sort it out as soon as possible. But you know what, to fix the No. 4 slot or the number four position for specific player, we need to get the combination and balance of the side correct.” “When I say this I mean they need to pick between Dinesh Kartik or Rishabh Pant. Once you decide on either of these player, it’ll get easy to sort in Suryakumar Yadav at number four.” Karim further picked Suryakumar, Pandya and Pant to be his ideal batters at four, five and six while KL Rahul is his choice to open the batting alongside Rohit Sharma. Rahul has been out of competitive cricketing action since featuring in the IPL 2022 Eliminator on May 25 in Kolkata. His team, debutants Lucknow Super Giants, lost to Royal Challengers Bangalore by 14 runs at Eden Gardens. Rahul was then named as captain for the five-match T20I series at home against South Africa in June. But a right groin injury on the eve of the first match in New Delhi ruled him out of the series. The sports hernia surgery in Germany meant that Rahul was ruled out of England tour too. He was set to return during India’s T20I series against West Indies, but a positive Covid-19 test ahead of the tour meant he wasn’t included in trip to the Caribbean and ODIs against Zimbabwe. But with T20 World Cup in Australia coming close, Rahul is now fully fit to be back in action for India in shortest format of the game. “KL Rahul being the vice-captain, I look at him as an opener with Rohit Sharma. I look at Virat Kohli at number 3 and Suryakumar Yadav at number 4. But you know what, 4,5,6 has to be very flexible kind of a position because in a T20 format, you look at 4,5,6 who can finish games for you and can also double up as a power hitter when required, can also stabilise the innings.” “Those three batters at 4,5,6, my choice would be Suryakumar Yadav, Hardik Pandya and Rishabh Pant. And you can move them around depending on the number of overs you’re left with. But KL Rahul in my opinion, should bat up the order with Rohit Sharma,” concluded Karim. Press Trust of Indiakashmirreader.com","pubDate":"2022-08-12 19:28:29","image_url":null,"source_id":"kashmirreader","country":["india"],"category":["sports"],"language":"english"},{"title":"IUST organises sports event","link":"https://kashmirreader.com/2022/08/13/iust-organises-sports-event/","keywords":["SPORTS"],"creator":["KR Desk"],"video_url":null,"description":"SRINAGAR: To observe Aazadi ka Amrit Mohatsav. Islamic University of Science and Technology (IUST) on Friday organised a series of events The events included Sports and Recreational activities for employees, celebration of International Youth Day and Film Screening Session. The sports and recreational program was organized by the Directorate of Physical Education & Sports in […]","content":"SRINAGAR: To observe Aazadi ka Amrit Mohatsav. Islamic University of Science and Technology (IUST) on Friday organised a series of events The events included Sports and Recreational activities for employees, celebration of International Youth Day and Film Screening Session. The sports and recreational program was organized by the Directorate of Physical Education & Sports in collaboration with Srinagar Unit of Reliance Group, wherein multiple events were organized that included cricket, football, athletics, and other recreational activities. The program organized under the University outreach initiative was inaugurated by Prof. Nasser Iqbal, Registrar IUST. Appreciating the relevance of such activities, Prof. Iqbal said, “The burden of maintaining a work-life balance in the modern world is becoming increasingly more challenging. So, conducting such events for our employees becomes mandatory”. The team of employees from Reliance Group led by Mr. Khalid Mehraj enthusiastically participated in the program. “With its world-class sports infrastructure, the University is dedicated to making a significant contribution in improving health standards of the youth”, said Dr. Hilal Ahmed Rather, Assistant Director, Physical Education and Sports at IUST. KR Desk","pubDate":"2022-08-12 19:28:16","image_url":null,"source_id":"kashmirreader","country":["india"],"category":["sports"],"language":"english"},{"title":"Johannesburg Super Kings squad: CSA T20 League 2023 CSK team players list","link":"https://thesportsrush.com/cricket-news-johannesburg-super-kings-squad-csa-t20-league-2023-csk-team-players-list/","keywords":["Cricket","CSA T20 League","csk","CSK T20 League 2023"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Johannesburg Super Kings squad: The Chennai Super Kings Sports Limited had placed the highest bid for the Johannesburg franchise. Mumbai Indians, Chennai Super Kings, Lucknow Super Giants, Sunrisers Hyderabad, Rajasthan Royals, and one of the owners of Delhi Capitals successfully placed and eventually won the combined bids of all the six franchises of Cricket South… The post Johannesburg Super Kings squad: CSA T20 League 2023 CSK team players list appeared first on The SportsRush.","content":"Johannesburg Super Kings squad: The Chennai Super Kings Sports Limited had placed the highest bid for the Johannesburg franchise. Mumbai Indians, Chennai Super Kings, Lucknow Super Giants, Sunrisers Hyderabad, Rajasthan Royals, and one of the owners of Delhi Capitals successfully placed and eventually won the combined bids of all the six franchises of Cricket South Africa’s brand new T20 league, which is all set to commence from January next year. For ensuring that the tournament is a success akin the IPL right from the get-go, CSA has even decided to forfeit the previously scheduled three-match ODI series against Australia the upcoming January, and with it risk their chances of direct qualification for the ODI World Cup in 2023. With the involvement of six IPL franchise owners, CSA’s aim of ensuring “long-term sustainability of the game” has perhaps had a decent enough kick-start. As per the tournament rules, a team can sign only one capped South African player, three overseas players, and an uncapped player ahead of the players auction, scheduled to take place by the next few weeks, as per a CSA press release on Wednesday. Also, the maximum permissible limit of players in each of the team squads is 17 players each. As of today, the MI Cape Town and the Durban team (owned by LSG’s RP Sanjeev Goenka group) have so far announced their five signings ahead of the auction. As for the Johannesburg Super Kings (owned by Chennai Super Kings Sports Limited), the franchise has not yet confirmed their five signings, but is likely to do the same anytime soon. However, as per multiple reports (although unverified), former CSK mainstay Faf du Plessis and present CSK all-rounder Moeen Ali are the two confirmed signings for the Johannesburg Super Kings. Du Plessis had been with the CSK from the IPL seasons 2011 to 2021, before being roped in by the Royal Challengers Bangalore (RCB) this season as their skipper. Ali, on the other hand, has been with the CSK for the past two years, and was retained by them ahead of the mega auction which took place this year.","pubDate":"2022-08-12 19:17:25","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Cheteshwar Pujara batting highlights: C Pujara century video in Warwickshire vs Sussex Royal London Cup match","link":"https://thesportsrush.com/cricket-news-cheteshwar-pujara-batting-highlights-c-pujara-century-video-in-warwickshire-vs-sussex-royal-london-cup-match/","keywords":["Cricket","Cheteshwar Pujara","Royal London Cup","Sussex","Warwickshire"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Cheteshwar Pujara batting highlights: The captain of Sussex couldn’t seal a 300+ run-chase despite leading from the front. During a Group A match of the ongoing season of Royal London Cup between Warwickshire and Sussex in Birmingham, Sussex captain Cheteshwar Pujara scored his 12th List A century albeit in a losing cause. Coming in to… The post Cheteshwar Pujara batting highlights: C Pujara century video in Warwickshire vs Sussex Royal London Cup match appeared first on The SportsRush.","content":"Cheteshwar Pujara batting highlights: The captain of Sussex couldn’t seal a 300+ run-chase despite leading from the front. During a Group A match of the ongoing season of Royal London Cup between Warwickshire and Sussex in Birmingham, Sussex captain Cheteshwar Pujara scored his 12th List A century albeit in a losing cause. Coming in to bat at No. 4 in the 22nd over of a 311-run chase, Pujara scored a whirlwind 107 (79) with the help of seven fours and two sixes. A strike rate of 135.44 is quite unlike Pujara but the 34-year old player managed to keep the visitors in the match especially after opening batter Ali Orr (81) was dismissed in the 34th over. Needing 70 runs to win in six overs, Pujara targeted Warwickshire pacer Liam Norwell to accumulate as many as 22 runs in an over. Pujara, who hit three fours and a six in the 45th over, also ran a couple of doubles to take his team close to victory. It was on the first delivery of the 48th over when Pujara ran two runs off George Garrett to reach the three-figure mark at the Mitchells and Butler’s Ground. Second centurion of the match after Warwickshire’s Rob Yates (114) in the first innings, Pujara was dismissed on the first delivery of the penultimate over when his team needed 20 runs off two overs. In spite of coming in a 4-run loss, Pujara’s gutsy innings will be remembered for a long time among Sussex fans. 4 2 4 2 6 4 TWENTY-TWO off the 47th over from @cheteshwar1 . 🔥 pic.twitter.com/jbBOKpgiTI — Sussex Cricket (@SussexCCC) August 12, 2022 💯 @cheteshwar1 pic.twitter.com/iJpV1fnIpv — Sussex Cricket (@SussexCCC) August 12, 2022 Having begin their Royal London Cup 2022 journey with a tie, Warwickshire have managed to register a victory in only the second match. Sussex, on the other hand, missed out on a third consecutive victory after winning their first two matches of this season.","pubDate":"2022-08-12 19:09:29","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Highlights, Ireland vs Afghanistan, 3rd T20I in Belfast, Full Cricket Score: Afghans win by 22 runs","link":"https://www.firstpost.com/firstcricket/sports-news/highlights-ireland-vs-afghanistan-3rd-t20i-in-belfast-full-cricket-score-afghans-win-by-22-runs-11051311.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"Highlights, Ireland vs Afghanistan, 3rd T20I in Belfast, Full Cricket Score: Afghans win by 22 runs","content":"Toss report: Afghanistan will hope to bounce back from consecutive defeats and keep their series hopes alive in the third T20I against Ireland in Belfast on Friday.The hosts won the toss, and skipper Andy Balbirnie invited the Afghans to bat, with the side high on confidence and eyeing a series-clinching win after securing comfortable victories in the first two matches of the series.Both teams made changes to their lineups — Ireland handed debuts to Graham Hume and Fionn Hand, while the visitors decided to bring Hazratullah Zazai into the XI in place of Hashmatullah Shahidi.Earlier on Thursday, Afghanistan won the toss and struggled with the bat as Ireland bowlers Josh Little, Mark Adair, Curtis Campher and Gareth Delany took two wickets apiece.The tourists reached 122 for eight from their 20 overs. Shahidi top-scored with 36 from 42 balls.Ireland lost opener Paul Stirling (4) in the third over with only seven runs on the board, but captain Balbirnie and Lorcan Tucker shared 65 for the second wicket, with Balbirnie making 46 from 36 balls and Tucker 27 from 28.Mohammad Nabi took two for 15 for Afghanistan, but George Dockrell’s unbeaten 25 helped Ireland reach its target with an over to spare.Teams :Ireland: Paul Stirling, Andrew Balbirnie(c), Lorcan Tucker(wk), Harry Tector, Gareth Delany, George Dockrell, Curtis Campher, Fionn Hand, Mark Adair, Graham Hume, Joshua Little.Afghanistan: Hazratullah Zazai, Rahmanullah Gurbaz(wk), Usman Ghani, Ibrahim Zadran, Najibullah Zadran, Mohammad Nabi(c), Azmatullah Omarzai, Rashid Khan, Naveen-ul-Haq, Mujeeb Ur Rahman, Fazalhaq Farooqi.With inputs from APRead all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram","pubDate":"2022-08-12 18:45:44","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/08/Ireland-celebrate-Afghanistan-Twitter-@cricketireland-640.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Watch: Cheteshwar Pujara smashes 22 runs in an over for Sussex in Royal London One-Day Cup","link":"https://www.firstpost.com/firstcricket/sports-news/watch-cheteshwar-pujara-smashes-22-runs-in-an-over-for-sussex-in-royal-london-one-day-cup-11051591.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"Watch: Cheteshwar Pujara smashes 22 runs in an over for Sussex in Royal London One-Day Cup","content":"Cheteshwar Pujara is widely considered a Test specialist and his days as a member of the Indian ODI side are long behind him, with little hope of donning the blue jersey anytime in the near future.The Saurashtra batter, however, served fans a reminder of what he's capable of in the shorter formats with a blistering 107 off 79 deliveries for Sussex against Warwickshire in the ongoing Royal London One-Day Cup.Pujara has had a terrific run for Sussex throughout the summer with five centuries in the County Championship including three double-tons. And on Friday, he carried that red-hot First-Class form over to the List A format, dismantling the Warwickshire attack and keeping his side alive in the chase of the 311-run target for the most part.4 2 4 2 6 4TWENTY-TWO off the 47th over from @cheteshwar1. 🔥 pic.twitter.com/jbBOKpgiTI— Sussex Cricket (@SussexCCC) August 12, 2022The highlight of the match was Pujara smashing 22 runs off Liam Norwell in the 45th over of the chase with three fours, a six and two doubles.What stood out was his unorthodox choice of shots in the over; the India Test No 3 who is known widely for his stoic approach and his ability to grind opposition bowlers out session after session with his solid defence, was shuffling to his right and bringing out the paddle sweeps on a few occasions.Pujara hasn't made too many appearances in the Indian Premier League of late, and went unsold at the mega auction that took place earlier this year. But his latest outing might just help him get noticed by franchises once again.His knock, however, couldn't prevent Sussex from a narrow loss as they finished just four short of the Warwickshire total. Pujara was bowled by Oliver Hannon-Dalby in the penultimate over of the case, leaving his side another 20 to win off 11 with three wickets in hand.George Garrett bowled a tight final over, not conceding a single boundary and giving away just seven when 12 were required to secure victory for Warwickshire.Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-08-12 18:44:07","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/08/Cheteshwar-Pujara-Royal-London-One-Day-Twitter-@SussexCCC-640.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Asia Cup: Ricky Ponting predicts winner of much-awaited India vs Pakistan match","link":"https://www.thehansindia.com/sports/cricket/asia-cup-ricky-ponting-predicts-winner-of-much-awaited-india-vs-pakistan-match-757499","keywords":["Sports,Cricket"],"creator":["Ishka"],"video_url":null,"description":"Asia Cup is set to begin on Aug. 27India vs Pakistan will take place on Aug. 28The final is scheduled to take place on Sept. 11 in Dubai","content":"Asia Cup: Ricky Ponting predicts winner of much-awaited India vs Pakistan match Former Australia captain Ricky Ponting has predicted the winner of the Asia Cup match between India and Pakistan. Asia Cup is scheduled to begin on Aug. 27 in the UAE and the arch-rivals India and Pakistan come face to face the following day at the Dubai International Cricket Stadium. The last time these two sides met in Dubai, Pakistan thrashed India by 10 wickets at T20 World Cup last year. With another edition of the tournament coming up later this year, Asia Cup is being played in the T20 format. However, India have a superior head-to-head against Pakistan in the T20Is, having won seven out of their nine meetings. On the latest episode of The ICC Review, Ponting gave his prediction for the upcoming clash and said that he will stick with India to triumph in the big game. \"I'll stick with India to win that clash against Pakistan,\" said Ponting. Even though Ponting backed Rohit Sharma and Co to win the match on Aug.28, the cricketer-turned-coach hailed Pakistan for producing superstar players. \"That's taking nothing away from Pakistan because they are an incredible cricket nation that continues to present out-and-out superstar players,\" added Ponting. Just like England and Australia in Tests, India and Pakistan can have the biggest rivalry in Test cricket, according to Ponting, who captained Australia to 5-0 win in the Ashes 2006-07. India and Pakistan haven't faced each other in the longest format since playing out a draw in 2007 in Bengaluru. \"When I think about rivalries, Australia and England and Ashes cricket is the pinnacle I've always thought of for our Test match game. I'm sure India and Pakistanis will say the same about that and the actual rivalry would be the pinnacle of Test match cricket for those two countries as well,\" added Ponting. India is a part of Group A in the Asia Cup 2022, along with Pakistan and a Qualifier Team (TBD). The final of Asia Cup is scheduled to be played on Sept. 11 in Dubai. The BCCI recently announced India's Asia Cup squad, which did not include key pacer Jasprit Bumrah, who is currently recovering from an injury. He, along with Harshal Patel, are at the National Cricket Academy (NCA) in Bengaluru for rehab. Will we witness India vs Pakistan final in the Asia Cup 2022? #AsiaCup #India #Pakistan #INDVPAK #Cricket #CricTracker #T20 pic.twitter.com/1E0OGWMaTQ India's Asia Cup squad: Rohit Sharma (c), KL Rahul, Virat Kohli, Suryakumar Yadav, Rishabh Pant, Deepak Hooda, Dinesh Karthik, Hardik Pandya, Ravindra Jadeja, R Ashwin, Yuzvendra Chahal, Ravi Bishnoi, Bhuvneshwar Kumar, Arshdeep Singh, Avesh Khan. Standby: Shreyas Iyer, Axar Patel, Deepak Chahar. Pakistan's Asia Cup squad: Babar Azam (c), Shadab Khan, Asif Ali, Fakhar Zaman, Haider Ali, Haris Rauf, Iftikhar Ahmed, Khushdil Shah, Mohammad Nawaz, Mohammad Rizwan, Mohammad Wasim Jnr, Naseem Shah, Shaheen Shah Afridi, Shahnawaz Dahani, Usman Qadir.","pubDate":"2022-08-12 18:22:18","image_url":"https://assets.thehansindia.com/h-upload/2022/08/12/500x300_1307620-sia-cup.jpg","source_id":"thehansindia","country":["india"],"category":["sports"],"language":"english"},{"title":"India vs Rest of the World cricket match: Legends League Cricket start date 2022","link":"https://thesportsrush.com/cricket-news-india-vs-rest-of-the-world-cricket-match-legends-league-cricket-start-date-2022/","keywords":["Cricket","Legends League Cricket"],"creator":["Dixit Bhargav"],"video_url":null,"description":"India vs Rest of the World cricket match: Legends League Cricket will begin with an exhibition match next month. Legends League Cricket will return for a second season just eight months after the inaugural season was played in Oman earlier this year. A bigger second season will witness number of teams getting increased from three… The post India vs Rest of the World cricket match: Legends League Cricket start date 2022 appeared first on The SportsRush.","content":"India vs Rest of the World cricket match: Legends League Cricket will begin with an exhibition match next month. Legends League Cricket will return for a second season just eight months after the inaugural season was played in Oman earlier this year. A bigger second season will witness number of teams getting increased from three to four. Unlike the inaugural season, LLC 2 will be played in India. Six Indian cities which will be hosting the tournament are Kolkata, Lucknow, Delhi, Jodhpur, Cuttack and Rajkot. A total of 15 matches involving retired cricketers will be played between September 17 – October 8 in the aforementioned cities. Expect passionate Indian cricket fans to visit the stadiums around the country to catch a glimpse of former cricketers rewinding the clock again. India vs Rest of the World cricket match In a novel development, India Maharajas and World Giants will lock horns in an exhibition match before the tournament to commemorate India’s 75th independence year. A total of 34 players from 10 countries have been shortlisted to participate in this match on September 16 at the Eden Gardens. It was only during the day that the organizers had announced the squads for this match. Former India captain and BCCI (Board of Control for Cricket in India) President Sourav Ganguly will be returning to action to lead India Maharajas which also comprises of players such as Virender Sehwag, Mohammad Kaif, Harbhajan Singh, Irfan Pathan etc. The prospect of Ganguly playing in Kolkata is enough for fans to book their tickets and visit the stadium for this match. Keep at it #bcci #love #cricket #LegendsLeagueCricket pic.twitter.com/kkVJbxo8KJ — Sreesanth (@sreesanth36) August 12, 2022 “This is a proud moment for us that we are celebrating the 75th year of our independence,” LLC commissioner Ravi Shastri said in a statement. “As a proud Indian, it gives me immense satisfaction to share that we have decided to dedicate this year’s league to the 75th year of Independence celebration.” The post India vs Rest of the World cricket match: Legends League Cricket start date 2022 appeared first on The SportsRush.","pubDate":"2022-08-12 18:13:34","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Justin Langer: Former Australian cricket coach ponders conundrems of camps amid Adelaide controversy","link":"https://thewest.com.au/opinion/justin-langer-former-australian-cricket-coach-ponders-conundrems-of-camps-amid-adelaide-controversy-c-7856136","keywords":null,"creator":["Justin Langer"],"video_url":null,"description":"As the Adelaide Crows controversy bubbles, our infamous pre-Ashes ‘torture test’ gives an insight into learnings from left-field experiences","content":null,"pubDate":"2022-08-12 18:00:00","image_url":"https://images.thewest.com.au/publication/C-7856136/6dda27c04d700bc28477949ff5699b8187ab6475-16x9-x1y0w2446h1376.jpg","source_id":"thewest","country":["australia"],"category":["sports"],"language":"english"},{"title":"Good days again for domestic cricket","link":"https://telanganatoday.com/good-days-again-for-domestic-cricket","keywords":["Cricket","News","Sport","BCCI","cricket","Irani Trophy","Ranji Trophy"],"creator":["Telangana Today"],"video_url":null,"description":"By Vijay Mohan Raj Hyderabad: I am pleasantly surprised that the BCCI has made a U-turn by returning to the Duleep and Irani Trophy tournaments. Also welcoming is that Ranji Trophy matches will now be played on home-away basis like the good old days. To add to these is the amendment that the Ranj Trophy […]","content":"By Vijay Mohan Raj Hyderabad: I am pleasantly surprised that the BCCI has made a U-turn by returning to the Duleep and Irani Trophy tournaments. Also welcoming is that Ranji Trophy matches will now be played on home-away basis like the good old days. To add to these is the amendment that the Ranj Trophy Elite and Plate will be entirely two different formats and therefore the plate teams will not play in the Elite knock-out stage of the tournament as was earlier. These amendments to the previous years’ tournaments shall ensure that standards will be maintained in the Elite group Ranji Trophy knock-outs unlike last year when there were glaring difference in the standards of Plate and Elite teams. The most appreciative part is that after a long time the teams in Ranji Trophy will play in front of their home crowds. This phenomenon will ensure better spectator following in the stadiums as also enthuse the local cricketers to see their stars perform and create a fan-following in their own States. The local flavor was also originally envisaged when the IPL was envisaged and thereby the auction was of city teams and the principal was to ensure that there is development of the game at city level. However, as it has turned out the IPL teams in some cases do not have any local players and although the teams are slated as city-based it does not fulfill the objective for which this competition was created. As I can view domestic cricket from the side lines and compare the game as it was played until the 80’s and after the decline on the focus that the BCCI had on ensuring constructive participation of players in these tournaments has shown a steady decline. The international calendar that the BCCI has adopted has ensured that there is creation of huge revenues and therefore it results in the non-participation of our national team stars in the domestic circuit. The result is that the city spectators do not have adequate interest in watching domestic matches as the matches are played without the international cricketers in most cases. In my opinion it is imperative that we give utmost importance to domestic cricket tournaments and balance the international schedule in a manner that the International stars compete with the ‘rookies’ which will eventually provide challenges such that it will enthuse spectators to throng the game as also in the long run raise the standard of the completion. The World Champions crown that the Indian team has worn for a large part of the previous decade has made the administration justify every action and decision of theirs and begun to assume that their ways are the best. This is a fallacy because in any sport the standards are never constant and one has to evolve by accepting that there is a way that could be “BETTER THAN THE BEST”. – Writer is a former Hyderabad and Mumbai Ranji cricketer.","pubDate":"2022-08-12 17:26:59","image_url":null,"source_id":"telanganatoday","country":["india"],"category":["sports"],"language":"english"},{"title":"Asia Cup 2022: Without Hardik Pandya, India’s plans will fall apart, says Aakash Chopra","link":"https://www.firstpost.com/firstcricket/sports-news/asia-cup-2022-without-hardik-pandya-indias-plans-will-fall-apart-says-aakash-chopra-11051471.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"Asia Cup 2022: Without Hardik Pandya, India’s plans will fall apart, says Aakash Chopra","content":"Former India batter Aakash Chopra said that Hardik Pandya will be key to the team's success at the upcoming Asia Cup.The 44-year-old former Test opener felt that senior players like Virat Kohli, Rohit Sharma, and Jasprit Bumrah have backup options in the team but the side has no replacement for Pandya and without him, things may fall apart.\"Virat Kohli, Rohit Sharma, even Jasprit Bumrah you can manage to find a replacement for them. But if Hardik Pandya is not there you cannot make that XI,\" he said on Star Sports.Chopra also added that amount of overs Hardik bowls during the tournament will be crucial as his spells are like an insurance policy.“It's an insurance policy (on Hardik bowling 4 overs). He is performing very well. No doubt about that. But be mindful of one thing. Hardik Pandya is the only player in that squad who is proving that balance. Without him, all the well-laid plans will fall apart,\" Chopra said.The former cricketer further added that since Hardik is crucial, he must not be overburdened and must be used sparely during the continental tournament.\"So maybe against Pakistan, he can bowl four overs, but not against teams like Afghanistan or Sri Lanka. So use him judiciously.” he explained.Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-08-12 16:59:56","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/07/Hardik-Pandya1.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"VVS Laxman to be Indian head coach in Zimbabwe, says BCCI secretary Jay Shah","link":"https://sportstar.thehindu.com/cricket/vvs-laxman-indian-head-coach-zimbabwe-tour-jay-shah-bcci-secretary/article65763041.ece","keywords":null,"creator":["\n        PTI  \n    "],"video_url":null,"description":"National Cricket Academy head VVS Laxman will be India’s acting head coach for the upcoming tour of Zimbabwe.","content":null,"pubDate":"2022-08-12 16:51:33","image_url":null,"source_id":"sportstar","country":["india"],"category":["sports"],"language":"english"},{"title":"Asia Cup 2022: Ricky Ponting predicts winner of India vs Pakistan clash, says 'To be totally honest it's..'","link":"https://zeenews.india.com/cricket/asia-cup-2022-ricky-ponting-predicts-winner-of-india-vs-pakistan-clash-says-to-be-totally-honest-its-2496378.html","keywords":null,"creator":null,"video_url":null,"description":"Former Australian captain and cricket great Ricky Ponting had his say when he spoke to ICC about the clash and who will win it. Ponting said that India vs Pakistan clashes are something which everyone looks forward to as these sides do not play each othr often.","content":"India and Pakistan cricket fans have already applied for leaves for August 28 as the much-awaited 'Mother of all clashes' will be played on that date in Dubai. Rohit Sharma-led India will take on Babar Azam's Pakistan in what is expected to be a high-octane contest. These two countries do not play each other in bilateral series because of high political tensions. Hence, these multi-nation tournamenrs are the only venue where the arch-rival meet. Pakistan had the last laugh the two sides met last at the ICC T20 World Cup 2021 in Dubai. Men in Green outplayed India in all 3 departments to win the match. A lot of changed in Indian team since then. They are World No 1 side with a new T20 approach in place. So who will win this contest? Former Australian captain and cricket great Ricky Ponting had his say when he spoke to ICC about the clash and who will win it. Ponting said that India vs Pakistan clashes are something which everyone looks forward to as these sides do not play each othr often. \"To be totally honest it's one that we've been starved of, haven't we … looking back the last 15 or 20 years,” Ponting was quoted as saying on The ICC Review. #AsiaCup2022 | IND vs PAK Predicted Playing XI: Will fans see #ViratKohli vs #BabarAzam contest again? #indvspak https://t.co/q4M2AmUTXw — Zee News English (@ZeeNewsEnglish) August 8, 2022 \"As a cricket lover like I am and a cricket observer, any time those sorts of battles come up it's almost always nice to sit back and watch because everything just goes up a notch, doesn't it?\" Ponting made a big statement on who will win the contest. He said that Pakistan are a good side and have multiple superstars but India will go on to win the contest. \"I'll stick with India to win that clash against Pakistan,\" Ponting predicted will happen in the August 28 match. That's taking nothing away from Pakistan because they are an incredible cricket nation that continue to present out-and-out superstar players.\" India have named a strong 15-man squad for Asia Cup that sees the return of KL Rahul and KL Rahul. However, one big miss from the squad is Jasprit Bumrah and from India's standpoint, he will hopefully not missed.","pubDate":"2022-08-12 16:47:00","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"Asia Cup 2022: No pressure on us, says Pakistan captain Babar Azam on possibility of facing India thrice","link":"https://www.firstpost.com/firstcricket/sports-news/asia-cup-2022-no-pressure-on-us-says-pakistan-captain-babar-azam-on-possibility-of-facing-india-thrice-11051361.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"Asia Cup 2022: No pressure on us, says Pakistan captain Babar Azam on possibility of facing India thrice","content":"With India facing Pakistan at the beginning of their Asia Cup campaign in two weeks' time in Dubai, Pakistan captain Babar Azam said there's no pressure on them as far as the possibility of facing their neighbours thrice is concerned.\"Dekhe pressure kuch nahi hai. Koshish yahi hoti hai ki match ko match k tarha hi khele. (We'll try to approach it like any other match),\" Babar Azam replied when a journalist asked if Pakistan can make it 3-0 if they face India thrice in the upcoming Asia Cup in UAE.The six-team format of the continental tournament will see three teams divided into two groups of three. Out of the two groups, the top two from each will progress to the Super 4s which will be played in the round-robin format, the two teams with most points then facing each other in the final. With India and Pakistan expected to progress from Group A, Super 4 encounter is more or less confirmed with the third match expected to be the final.Pakistan won their last encounter against India with 10 wickets as they faced each other at the same venue last year during the T20 World Cup, where India made an unceremonious exit in the group stage.Babar said they are focussing on the positives of their team ahead of the much-fancied encounter.\"Yes, there will be different pressure but as we tried in last World Cup (not to let it affect us), we'll try to focus on our game and believe in our abilities. This time also our focus will be to give our best. Putting our best effort is in our hands, results are not. If we give our best then more often than not, results will also come,\" he said.Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-08-12 16:43:08","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/06/babar-azam1.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"South African Premier League cricket teams: SA Premier League and CSA T20 League 2023 team list","link":"https://thesportsrush.com/cricket-news-south-african-premier-league-cricket-teams-sa-premier-league-and-csa-t20-league-2023-team-list/","keywords":["Cricket","CSA T20 League"],"creator":["Gurpreet Singh"],"video_url":null,"description":"South African Premier League cricket teams: The inaugural edition of CSA’s franchise T20 league will commence next year in January. The success of the Indian Premier League (IPL) in terms of viewership and most importantly revenue generation, with record deals in terms of broadcasting rights and other sponsorship deals in its fifteen years of existence,… The post South African Premier League cricket teams: SA Premier League and CSA T20 League 2023 team list appeared first on The SportsRush.","content":"South African Premier League cricket teams: The inaugural edition of CSA’s franchise T20 league will commence next year in January. The success of the Indian Premier League (IPL) in terms of viewership and most importantly revenue generation, with record deals in terms of broadcasting rights and other sponsorship deals in its fifteen years of existence, has acted as a perfect example and case study for the boards of other countries to follow suit. Cricket South Africa has now decided to act as the latest entrant in this business of franchise T20 league, and in partnership with television broadcaster SuperSport, is set to commence with the inaugural season of the CSA T20 league, scheduled to begin in January 2023. Former South African skipper Greame Smith has been appointed as the head of this T20 league, and will be handed the task to ensure the sustainability of the same, after the Mzansi Super League was forced to be scrapped because of broadcast rights issue. Moreover, the welcoming news for CSA is that it is the owners of the six IPL teams, which have successfully bid for all the six franchises in the tournament. South African Premier League cricket teams Mumbai Indians, Chennai Super Kings, Lucknow Super Giants, Sunrisers Hyderabad, Rajasthan Royals and one of the owners of Delhi Capitals managed to successfully bid for the CSA T20 league franchises last month. As per verified reports, CSK, through parent company Chennai Super Kings Sports Limited, placed the highest bid for the Johannesburg franchise during the informal auction, and Reliance Industries – owners of MI, managed to buy the Cape Town team. represent! Now in Newest member in our #OneFamily of teams @MICapeTown : Alex Chipi#MIcapetown @OfficialCSA pic.twitter.com/jfhszgh0WS — MI Cape Town (@MICapeTown) August 10, 2022 ALSO READ: Players signed by CSA T20 league franchises so far The Sun TV Group – owners of SRH, bought the Gqeberha (formerly Port Elizabeth) franchise, and the RP Sanjeev Goenka group – owners of LSG who made their IPL debut this year, have acquired the Durban team. The remaining two teams are from Paarl and Pretoria, which were bought by Rajasthan Royals and Parth Jindal (co-owner of Delhi Capitals) respectively. As per the tournament rules, a team can sign only one capped South African player, three overseas players, and an uncapped player ahead of the players auction, scheduled to take place by the next few weeks, as per a CSA press release on Wednesday. The post South African Premier League cricket teams: SA Premier League and CSA T20 League 2023 team list appeared first on The SportsRush.","pubDate":"2022-08-12 16:07:15","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"English County Veteran Darren Stevens To Retire Aged 46","link":"https://sports.ndtv.com/cricket/english-county-veteran-darren-stevens-to-retire-aged-46-3250073","keywords":null,"creator":null,"video_url":null,"description":"Veteran English county cricket all-rounder Darren Stevens has announced his retirement at the age of 46.","content":"Veteran English county cricket all-rounder Darren Stevens has announced his retirement at the age of 46. The Kent favourite said Friday that a first-class career that started in 1997 will end at the close of the current season. Stevens, who joined Kent from his native Leicestershire in 2005, has enjoyed some of his finest moments in recent years with both bat and ball. He hit a career-best 237 and took five wickets in an innings against Yorkshire in 2019 and the following season took 29 wickets with his nagging medium-pace at an eye-catching average of just over 15.5 in the inaugural Bob Willis Trophy. Leicester-born Stevens won the T20 Blast with Leicestershire in 2004 and repeated the feat with Kent in 2007 and 2021. His Kent career saw the hard-hitting Stevens score more than 22,000 runs, including 43 centuries. Cricketing \"bible\" Wisden recognised his feats in 2021, naming him as one of its cricketers of the year, the oldest to receive the honour since Leicestershire bowler Ewart Astill in 1933. Stevens recently sustained a calf injury while batting during the One-Day Cup match against Glamorgan and may not feature again this season, having played just five County Championship matches in 2022. \"It's bittersweet that my time at Kent has finally come to an end after such a long run and where I am so proud to have lived out my boyhood dream with such a phenomenal club. The memories will stay with me forever,\" Stevens said. The medium-pacer and hard-hitting batsman added: \"I'm looking forward to the next chapter but looking back I am very proud of the one I've just completed.\" For all his success at county level, Stevens has never been capped by England in any format. \"It's frustrating when you see a lot of people that have played or are playing,\" he told AFP in an interview in April. Stevens may have missed out on an international cap but he is certainly on the radar of the Australian internationals who have plied their trade in the English county game -- they even set up a WhatsApp group called \"Stevo's gonna get ya\". Kent director of cricket Paul Downton, paying tribute Friday, said: \"Over the last 25 years Darren Stevens has been an inspirational cricketer.\" Promoted The former England wicketkeeper added: \"His numbers are remarkable in the modern era, which, along with his ability to influence and win matches, make him a true Kent legend. \"It is unthinkable that a player of his talent was never selected to play international cricket.\"","pubDate":"2022-08-12 16:05:39","image_url":"https://c.ndtvimg.com/2021-05/70i79m58_darren-stevens_625x300_22_May_21.jpg?im=FeatureCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"IND vs ZIM: VVS Laxman set to be head coach for Zimbabwe tour","link":"https://www.indiatvnews.com/sports/cricket/ind-vs-zim-vvs-laxman-set-to-be-head-coach-for-zimbabwe-tour-bcci-jay-shah-2022-08-12-799552","keywords":null,"creator":null,"video_url":null,"description":"National Cricket Academy head VVS Laxman is named as Team India's acting head coach for the upcoming tour of Zimbabwe.","content":null,"pubDate":"2022-08-12 15:58:34","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"South Africa fall over easily as England Lions thrash tourists in warm-up","link":"https://www.theguardian.com/sport/2022/aug/12/england-will-have-egg-on-their-faces-with-bazball-says-south-africas-dean-elgar","keywords":["Cricket","South Africa cricket team","England v South Africa 2022","Sport"],"creator":["Ali Martin"],"video_url":null,"description":"Ollie Robinson on form as tourists slump to innings defeatDarren Stevens, 46, to leave Kent but denies retirementSouth Africa will head into next week’s first Test against England already burned by the so-called “Bazball” approach after suffering a crushing defeat by their Lions side in their solitary warm-up match.Speaking in the latest edition of Wisden Cricket Monthly, Dean Elgar, the Proteas’ captain, said that England’s ultra-aggressive methods under Ben Stokes and Brendon McCullum had no “longevity” and risked leaving them with “egg on their faces”. Continue reading...","content":"South Africa will head into next week’s first Test against England already burned by the so-called “Bazball” approach after suffering a crushing defeat by their Lions side in their solitary warm-up match. Speaking in the latest edition of Wisden Cricket Monthly, Dean Elgar, the Proteas’ captain, said that England’s ultra-aggressive methods under Ben Stokes and Brendon McCullum had no “longevity” and risked leaving them with “egg on their faces”. However, his side’s first encounter with the approach during a non-first-class fixture in Canterbury ended with an innings and 56-run loss to England’s understudies, whose victory was built on a rapid 672 all out scored at more than 5.5 runs per over courtesy of centuries from Harry Brook (140) and Ben Duckett (145). Explosive Will Smeed following David Warner’s path to World Cup reckoning Read more Ollie Robinson finished with match figures of five for 105 as South Africa were bowled out for 183 on the last day. But after a five-wicket haul in the first innings, Craig Overton, the second Lions seamer in England’s squad for the first Test at Lord’s that begins on Wednesday, left the field on the final morning with a back problem. Meanwhile, Darren Stevens will leave Kent at the end of the season after 17 seasons but reports of the 46-year-old’s retirement from cricket may be premature. Kent announced on Friday that Stevens will leave the club he joined from Leicestershire in 2005, prompting suggestions the all-rounder was also calling time on his playing career altogether. But speaking to BBC Sport, Stevens stated his desire to continue a playing career that has brought 16,676 runs and 591 wickets in first-class cricket, even if he is yet to find a new club. “I don’t feel like I’m ready to give up,” he said. “I love the game so much. I have that passion for it. That is why I’m still playing now. I still feel like I can do a job with the bat and the ball.”","pubDate":"2022-08-12 15:52:17","image_url":"https://i.guim.co.uk/img/media/8079a06bedd4627a97cd37b1eace53ab333f08c8/0_121_3650_2191/master/3650.jpg?width=460&quality=85&auto=format&fit=max&s=5d35ca14a24fe5428b649ced902af3b4","source_id":"theguardian","country":["united kingdom","india","singapore","canada"],"category":["sports"],"language":"english"},{"title":"WI vs NZ Dream11 Team Prediction, Fantasy Cricket Hints: Captain, Probable Playing 11s, Team News; Injury Updates For Today’s New Zealand vs West Indies 2nd T20I match at Jamaica, 12:00 AM IST, August 13","link":"https://zeenews.india.com/cricket/wi-vs-nz-dream11-team-prediction-fantasy-cricket-hints-captain-probable-playing-11s-team-news-injury-updates-for-today-s-new-zealand-vs-west-indies-2nd-t20i-match-at-jamaica-1200-am-ist-august-13-2496355.html","keywords":null,"creator":null,"video_url":null,"description":"West Indies vs New Zealand Dream11 Team Prediction West Indies vs New Zealand 2nd T20I match - Check My Dream11 Team, Best players list of WI vs NZ, West Indies Dream11 Team Player List, New Zealand Dream11 Team Player List, Dream11 Guru Tips, Fantasy Cricket Tips, Fantasy Cricket Tips, Fantasy Playing Tips","content":"West Indies will take New Zealand on in the 2nd of the 3 T20s with an aim to win the match and save another series defeat within 10 days. Not long ago, Windies lose to Rohit Sharma-led India in a five-match series at home and they would be looking to bounce back against Kane Williamson and Co in the three-match series after 13-run loss in the forst T2 at Jamaica. One of the biggest concerns for the Windies camp is their dismal batting performance. They have been hit by a series of low scores by their best 3 batters in form Nicholas Pooran, Shimron Hetmyer and Rovman Powell. With T20 World Cup not far away, it is important for Windies to gain some sort of momentum to make their case stronger for the big ticket event of ICC. On the other hand, Kiwis are bolstered by come back of Williamson, who was out of action for quite some time due to his elbow injury. His form will be key for Black Caps at T20 World Cup and he played well in 1st T20 strike a 47 off 33 balls that included four glorious fours and 2 sixes as well. NZ vs WI 2nd T20 Match Details Match date and timing: August 13, 12.00 am IST Venue: Sabina Park, Kingston, Jamaica Dream11 team for WI vs NZ 2nd T20I: Kyle Mayers, Devon Conway (c), Glenn Phillips, Nicholas Pooran, Rovman Powell, Jimmy Neesham (vc), Mitchell Santner, Jason Holder, Obed McCoy, Lockie Ferguson, Trent Boult. West Indies likely playing XI Kyle Mayers, Shamarh Brooks, Devon Thomas (wk), Nicholas Pooran (c), Shimron Hetmyer, Rovman Powell, Odean Smith, Jason Holder, Romario Shepherd, Obed McCoy, Hayden Walsh. New Zealand likely playing XI Martin Guptill, Devon Conway (wk), Kane Williamson (c), Glenn Phillips, Daryl Mitchell, James Neesham, Mitchell Santner, Ish Sodhi, Tim Southee, Lockie Ferguson, Trent Boult. Squads West Indies: Brandon King, Kyle Mayers, Devon Thomas(w), Nicholas Pooran(c), Rovman Powell, Shimron Hetmyer, Shamarh Brooks, Jason Holder, Odean Smith, Akeal Hosein, Keemo Paul, Alzarri Joseph, Obed McCoy, Romario Shepherd, Dominic Drakes, Hayden Walsh. New Zealand: Martin Guptill, Finn Allen, Kane Williamson(c), Devon Conway, Glenn Phillips(w), Daryl Mitchell, Tom Latham, Mitchell Santner, James Neesham, Michael Bracewell, Ish Sodhi, Tim Southee, Trent Boult, Matt Henry, Lockie Ferguson.","pubDate":"2022-08-12 15:36:00","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"UAE T20 League 2023 teams: UAE T20 League teams list","link":"https://thesportsrush.com/cricket-news-uae-t20-league-2023-teams-uae-t20-league-teams-list/","keywords":["Cricket","ILT20 League","UAE T20 League"],"creator":["Dixit Bhargav"],"video_url":null,"description":"UAE T20 League 2022 teams: A new tournament comprising of six teams will be played in the United Arab Emirates next year. One of the two new T20 leagues vying for a spot in cricket’s already hectic calendar especially in the first two months of the year, ILT20 (International League T20) will be played in… The post UAE T20 League 2023 teams: UAE T20 League teams list appeared first on The SportsRush.","content":"UAE T20 League 2022 teams: A new tournament comprising of six teams will be played in the United Arab Emirates next year. One of the two new T20 leagues vying for a spot in cricket’s already hectic calendar especially in the first two months of the year, ILT20 (International League T20) will be played in the United Arab Emirates. With the first season of potentially another cash-rich tournament to be played in 2023, ILT20 will differ from other domestic T20 leagues. As the name suggests, ILT20 is going to be an international league with more representation of overseas players than the ones belonging to the host country (UAE, in this case). “[The view of these boards] is that there should be some regulation or guidelines regarding a minimum number of local players that must be in each team and play in each match,” one international cricket board CEO had told ESPNcricinfo earlier this month. Therefore, as per the current rules, franchises will be allowed to field as many as nine overseas players in their Playing XI. Apart from the financial backing, it is ILT20’s ability to provide more opportunities to overseas players is what makes it a frightening sight for ICC (International Cricket Council) Full Members. Lucrative deals might witness international cricketers preferring ILT20 over international cricket in the future. Sanctioned by ECB (Emirates Cricket Board), ILT20 is owned by ECB vice-chairman Khalid Al Zarooni. Readers must note that Al Zarooni is the director of one of the largest construction companies in Dubai. While three teams will be owned by franchise owners in Indian Premier League (Reliance Industries, Kolkata Knight Riders and GMR), the remaining three will be owned by Capri Global, Lancer Capital and Adani Sportsline. Full names, logos and other details about the franchises are yet to be finalized upon. Named MI Emirates, Reliance-backed ILT20 team has become the first team to reveal its list of 14 direct acquisitions . 3 former Mumbai Indians players back in Blue & Gold representing @MIEmirates ! Drop a 💙 in the comments if you are excited to see Bravo, Boulty & Pooran back in the MI #OneFamily 🤩 #MIemirates @DJBravo47 @nicholas_47 pic.twitter.com/5k1PDD2OR2 — Mumbai Indians (@mipaltan) August 12, 2022 Allowed a maximum of 18 players in their squads, franchises will have to ensure a maximum of 12 overseas players, three from UAE, two from other Associates and one UAE U-23 player.","pubDate":"2022-08-12 15:23:43","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"VVS Laxman To Be India's Head Coach In Zimbabwe Tour: Jay Shah","link":"https://sports.ndtv.com/cricket/vvs-laxman-to-be-indias-head-coach-in-zimbabwe-tour-jay-shah-3249906","keywords":null,"creator":null,"video_url":null,"description":"National Cricket Academy head VVS Laxman will be India's acting head coach for the upcoming tour of Zimbabwe, BCCI secretary Jay Shah confirmed.","content":"National Cricket Academy head VVS Laxman will be India's acting head coach for the upcoming tour of Zimbabwe as there is only a short turnaround time between the series and the Asia Cup starting on August 27 in the UAE, BCCI secretary Jay Shah said on Friday. \"Yes, VVS Laxman will be in charge of the Indian team in Zimbabwe for the three-match ODI series. It's not like Rahul Dravid is taking a break. The ODI series in Zimbabwe finishes on August 22 and Dravid along with Indian team will reach the UAE on August 23. Since there is little gap between the two events, Laxman will be in charge of the Indian squad in Zimbabwe,\" BCCI secretary Shah told PTI on Friday. \"Since only KL and Hooda are there with the ODI squad in Zimbabwe, it was only logical that the head coach would be with the T20 squad.\" The three ODIs in Zimbabwe will be played in Harare on August 18, 20 and 22. Shah also informed that KL Rahul and Deepak Hooda will directly fly from Dubai to Harare as they are part of the Asia Cup squad. The convention in BCCI has been that second string or A teams have always been monitored by the head of the NCA and hence Laxman will be with the Indian squad when the first team is on assignment elsewhere. When the Indian team was in UK in June-July, Laxman was with the T20 squad in Ireland when Dravid was with the Test squad in England. Promoted KL Rahul is making a comeback in the national squad after recuperating from sports hernia surgery. He was initially not supposed to be a part of the Zimbabwe squad but since the medical team has deemed him fit, he is going to be with the team for the three ODIs, which will be good practice for him ahead of the big ticket Asia Cup.","pubDate":"2022-08-12 15:18:15","image_url":"https://c.ndtvimg.com/2022-05/pmqnaq5g_vvs-laxman-twitter_625x300_18_May_22.jpg?im=FeatureCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"There are better fast bowlers than Mohammed Shami in Indian T20 cricket: Ricky Ponting on Asia Cup snub","link":"https://www.indiatoday.in/sports/cricket/story/asia-cup-2022-mohammed-shami-snub-ricky-ponting-reaction-1987393-2022-08-12?utm_source=rss","keywords":null,"creator":null,"video_url":null,"description":"There are better fast bowlers than Shami in Indian T20 cricket: Ponting","content":null,"pubDate":"2022-08-12 15:11:34","image_url":null,"source_id":"indiatoday","country":["india"],"category":["sports"],"language":"english"},{"title":"Monty Panesar tears into Aamir Khan's Laal Singh Chaddha, calls it 'total disgrace to Indian Army and Sikhs'","link":"https://www.firstpost.com/entertainment/monty-panesar-tears-into-aamir-khans-laal-singh-chaddha-calls-it-total-disgrace-to-indian-army-and-sikhs-11051131.html","keywords":["Entertainment"],"creator":["FirstCricket Staff"],"video_url":null,"description":"Monty Panesar tears into Aamir Khan's Laal Singh Chaddha, calls it 'total disgrace to Indian Army and Sikhs'","content":"Former England spinner Monty Panesar joined the chorus against the Aamir Khan-starrer Laal Singh Chaddha, tearing into the film for being a \"total disgrace to the Indian Army\".The Atul Kulkarni-directed film, a remake of the popular 1994 Hollywood flick Forrest Gump starring Tom Hanks, had run into trouble in the build-up to its release with multiple boycott calls on social media as well as protests against veteran actor Khan.Panesar, England's first-ever Sikh cricketer with 50 Test appearances to his credit, added while Hanks' portrayal of the titular character in Forrest Gump was accurate due to the US Army's recruitment policy during the Vietnam War, the same could not be said of Khan's character in it's Bollywood adaptation, which he described as a \"disrespectful\".Also Read: Laal Singh Chaddha that does some things better than Forrest Gump, some mindlessly worse\"Forrest Gump fits in the US Army because the US was recruiting low-IQ men to meet requirements for the Vietnam War. This movie is total disgrace to India Armed Forces Indian Army and Sikhs !! Disrespectful. Disgraceful. #BoycottLalSinghChadda,\" Panesar wrote in a tweet.Forrest Gump fits in the US Army because the US was recruiting low IQ men to meet requirements for the Vietnam War. This movie is total disgrace to India Armed Forces Indian Army and Sikhs !!Disrespectful. Disgraceful. #BoycottLalSinghChadda pic.twitter.com/B8P2pKjCEs— Monty Panesar (@MontyPanesar) August 10, 2022Khan, a veteran of the Hindi film industry, had earlier run into trouble with India's right-wing groups for his comments on \"growing intolerance\" in the country following the Bharatiya Janata Party's (BJP) rise to power in 2014. That along with his visit to Turkey, a close ally of Pakistan, has contributed to boycott calls against any project associated with Khan.Also Read: Laal Singh Chaddha is better than Forrest Gump — here’s whyWhile it's doing slightly better than the Akshay Kumar-starrer Raksha Bandhan, which was released on the same day as LSC, the film has emerged as Khan's lowest opener in more than a decade.Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram","pubDate":"2022-08-12 15:09:39","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2020/08/Panesar-reuters-file-640_opt-1.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Jadeja faces serious competition, will have to convince selectors of his place in squad: Manjrekar","link":"https://www.firstpost.com/firstcricket/sports-news/jadeja-faces-serious-competition-will-have-to-convince-selectors-of-his-place-in-squad-manjrekar-11051121.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"Jadeja faces serious competition, will have to convince selectors of his place in squad: Manjrekar","content":"Ravindra Jadeja has become an indispensable member of the Indian team across formats in recent months, especially with his much-improved batting skills that has seen him evolve from a left-arm spinner who could bat to a genuine all-rounder. And his rocket arm and outstanding fielding skills besides his exploits with bat and ball further embellish the impressive CV of his.Former India batter Sanjay Manjrekar, however, feels Jadeja is facing intense competition for places in the middle order as far as India's batting department is concerned.This especially following the return of Hardik Pandya to the side as well as veteran keeper-batter Dinesh Karthik's resurgence in Indian colours following an immensely successful IPL 2022.\"If he is going to be a batting all-rounder, then has got to show that he is an adequate replacement to somebody like a Dinesh Karthik, who is likely to bat at No. 6 or No. 7, or somebody like a Hardik Pandya at No. 6,\" Manjrekar, who has turned to a career in commentary after retiring from the sport, told Sports18.Plus there's the Axar Patel factor as well, with the left-arm spin-bowling all-rounder a like-for-like replacement for Jadeja.Patel's much-improved batting skills helped him get retained by the Delhi Capitals ahead of the IPL 2022 mega auction, and more recently, he was able to single-handedly use his batting skills to help Team India win games in their tour of the West Indies.\"Ravindra Jadeja himself knows there is some serious competition coming in. So it's really about Jadeja now convincing the selectors whether he is going to be a bowling all-rounder or a batting all-rounder. Depending on that, his place in the team will be decided.\"If he is competing as a bowling all-rounder, he has got to convince the team management that he is better than Axar Patel as a second spinning option,\" added Manjrekar.Jadeja will next be seen in action in the Asia Cup, a crucial tournament from India's perspective not only due to the prestige associated with it but for the fact that the tournament could play a key role in shaping the Men in Blue's squad for the T20 World Cup later this year.Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram","pubDate":"2022-08-12 14:58:04","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/07/ravindra-jadeja1.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"KKR's Nitish Rana not giving up on India hopes yet, eyes ‘500-plus runs' in IPL 2023 to secure comeback","link":"https://www.firstpost.com/firstcricket/sports-news/kkrs-nitish-rana-not-giving-up-on-india-hopes-yet-eyes-500-plus-runs-in-ipl-2023-to-secure-comeback-11050821.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"KKR's Nitish Rana not giving up on India hopes yet, eyes ‘500-plus runs' in IPL 2023 to secure comeback","content":"Nitish Rana might not have had much luck so far as his hopes of sealing a place in the Indian team are concerned, but the left-handed batter isn't giving up on his dreams just yet.The Kolkata Knight Riders (KKR) star batter, a consistent performer in the Indian Premier League (IPL) as well as in BCCI's domestic competitions over the years, made his international debut during India's tour of Sri Lanka last year.Rana was part of a second-string Indian side led by veteran opener Shikhar Dhawan that won the ODI series 2-1 but lost the T20I leg by a similar margin. The left-handed batter made his debut in the blue jersey in the final one-dayer, later played the second and third T20Is, and hasn't been part of the Indian setup since.\"As a cricketer, I would have of course liked another opportunity, but I do not want to give any excuses, since I did not play very well. I want to score 500 plus runs from the next IPL season so that the selectors cannot ignore me.\"The things that are in my control are to give good performances and score runs, and I am trying to improve there,\" the Delhiite was quoted as saying according to India Today.Rana had represented Mumbai Indians between 2015 and 2017, winning two IPL titles with the Rohit Sharma-led franchise, before joining the Knight Riders in 2018, having stuck with them ever since. He collected 361 runs at an average of 27.77 with two half-centuries to his credit in the 2022 edition of the IPL, in which the Shreyas Iyer-led Knight Riders finished seventh in the 10-team table.Reflecting on the bygone season, Rana felt the Knight Riders didn't exactly click as a unit, but that could change once the team starts playing at the Eden Gardens, it's the home venue, from next year.\"Things did not click for us in the last IPL. It is a very quick game and we did not have the results in our favour. Hopefully, we will play better and lift the cup at the Eden Gardens,\" added Rana.Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram","pubDate":"2022-08-12 14:52:54","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/05/NitishRana640-1.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"VVS Laxman will be head coach in Zimbabwe: BCCI secretary Jay Shah","link":"https://www.tribuneindia.com/news/sports/vvs-laxman-will-be-head-coach-in-zimbabwe-bcci-secretary-jay-shah-421406","keywords":null,"creator":null,"video_url":null,"description":"New Delhi, August 12National Cricket Academy head VVS Laxman will be India's acting head coach for the upcoming tour of Zimbabwe as there is only a short turnaround time between the series and the Asia Cup starting on August 27 in the UAE, BCCI secretary Jay Shah said on Friday.\"Yes, VVS Laxman will be in charge of the Indian team in Zimbabwe for the three-match ODI series. It's not like Rahul Dravid is taking a break. The ODI series in Zimbabwe finishes on August 22 and Dravid along with Indian team will reach the UAE on August 23. Since there is little gap between the two events, Laxman will be in charge of the Indian squad in Zimbabwe,\" BCCI secretary Shah told PTI on Friday.\"Since only KL and Hooda are there with the ODI squad in Zimbabwe, it was only logical that the head coach would be with the T20 squad.\" The three ODIs in Zimbabwe will be played in Harare on August 18, 20 and 22.Shah also informed that KL Rahul and Deepak Hooda will directly fly from Dubai to Harare as they are part of the Asia Cup squad.The convention in BCCI has been that second string or A teams have always been monitored by the head of the NCA and hence Laxman will be with the Indian squad when the first team is on assignment elsewhere.When the Indian team was in UK in June-July, Laxman was with the T20 squad in Ireland when Dravid was with the Test squad in England.KL Rahul is making a comeback in the national squad after recuperating from sports hernia surgery.He was initially not supposed to be a part of the Zimbabwe squad but since the medical team has deemed him fit, he is going to be with the team for the three ODIs, which will be good practice for him ahead of the big ticket Asia Cup.","content":"PTI New Delhi, August 12 National Cricket Academy head VVS Laxman will be India’s acting head coach for the upcoming tour of Zimbabwe as there is only a short turnaround time between the series and the Asia Cup starting on August 27 in the UAE, BCCI secretary Jay Shah said on Friday. “Yes, VVS Laxman will be in charge of the Indian team in Zimbabwe for the three-match ODI series. It’s not like Rahul Dravid is taking a break. The ODI series in Zimbabwe finishes on August 22 and Dravid along with Indian team will reach the UAE on August 23. Since there is little gap between the two events, Laxman will be in charge of the Indian squad in Zimbabwe,” BCCI secretary Shah told PTI on Friday. “Since only KL and Hooda are there with the ODI squad in Zimbabwe, it was only logical that the head coach would be with the T20 squad.” The three ODIs in Zimbabwe will be played in Harare on August 18, 20 and 22. Shah also informed that KL Rahul and Deepak Hooda will directly fly from Dubai to Harare as they are part of the Asia Cup squad. The convention in BCCI has been that second string or A teams have always been monitored by the head of the NCA and hence Laxman will be with the Indian squad when the first team is on assignment elsewhere. When the Indian team was in UK in June-July, Laxman was with the T20 squad in Ireland when Dravid was with the Test squad in England. KL Rahul is making a comeback in the national squad after recuperating from sports hernia surgery. He was initially not supposed to be a part of the Zimbabwe squad but since the medical team has deemed him fit, he is going to be with the team for the three ODIs, which will be good practice for him ahead of the big ticket Asia Cup. #VVS Laxman","pubDate":"2022-08-12 14:38:24","image_url":"https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/8/2022_8$largeimg_983927993.jpeg","source_id":"tribuneindia","country":["india"],"category":["sports"],"language":"english"},{"title":"Women's IPL likely to happen in THIS month, MI and CSK interested to buy teams","link":"https://zeenews.india.com/cricket/womens-ipl-likely-to-happen-in-2023-in-this-month-mi-and-csk-interested-to-buy-teams-2496335.html","keywords":null,"creator":null,"video_url":null,"description":"Not to forget, BCCI president Sourav Ganguly and secretary Jay Shah had earlier confirmed that WIPL can be held in 2023. The demand for the Women's IPL has been growing ever since Indian women's cricket started winning big series and tournaments","content":"The first edition of Women's Indian Premier League (WIPL) will be held most likely in 2023 in the month of March. BCCI will hold the tournament in a one-month window and the first season will see five teams taking part, says a PTI report. The league will take place right after the Women's T20 World Cup in South Africa. \"Yes, the WIPL will start in the first week of March and we have earmarked a four-week window for the first year. The T20 World Cup in South Africa is from February 9 to 26 and immediately after that we plan to hold the WIPL,\" a senior BCCI official privy to development told PTI on conditions of anonymity. \"As of now, we are going ahead with five teams but it could be six as there is a lot of interest among potential investors. In due course of time, the process of auctioning of teams will be announced,\" he further said. I am very excited to read about a window being carved out for the women's IPL early next year. I hope it is a full fledged tournament. It will lead to a revolution in the women's game in India. — Harsha Bhogle (@bhogleharsha) August 12, 2022 Not to forget, BCCI president Sourav Ganguly and secretary Jay Shah had earlier confirmed that WIPL can be held in 2023. The demand for the Women's IPL has been growing ever since Indian women's cricket started winning big series and tournaments. There is a belief among fans that standard of women's cricket will improve with the WIPL like how it helped the men's game to grow. \"I am thrilled at the kind of response we have got from the stakeholders. Multiple existing IPL teams have enquired and expressed serious interest in owning WIPL franchises,\" Shah had said in an interview to PTI some time back. Before that, Ganguly had also expressed his confidence about the start of the WIPL in 2023. \"I strongly believe that next year i.E. 2023 will be a very good time to start a full-fledged women's IPL which will be as big and grand a success as men's IPL,\" he had said. There is more good news. The same report also tells that successful IPL teams like Mumbai Indians, Rajasthan Royals, Chennai Super Kings have expressed their interest in buying teams. Even UTV big boss Ronnie Screwvala had tweeted that he would be interested in buying a WIPL franchise.","pubDate":"2022-08-12 14:34:00","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"}]}