{"newsArray":[{"title":"Sreesanth praises on Kohli for being an inspirational story after 7000 IPL runs","link":"https://www.indiatoday.in/sports/ipl-2023/story/sreesanth-heaps-praise-on-virat-kohli-for-being-an-inspirational-story-after-7000-ipl-runs-sky-is-not-the-limit-2375819-2023-05-07?utm_source=rss","keywords":null,"creator":null,"video_url":null,"description":"Sreesanth praises on Kohli for being an inspirational story after 7000 IPL runs","content":": Former speedster Sreesanth lauded Virat Kohli after the latter became the first batter to score 7000 runs in the Indian Premier League (IPL). The 34-year-old Kohli got to the feat while playing for the Royal Challengers Bangalore (RCB) in their match against the Delhi Capitals (DC) at the Arun Jaitley Stadium in New Delhi on Saturday, May 6. Kohli was 25 runs short of the milestone before the game and he got there with the utmost ease. Kohli also became the first batter to score in the IPL. “It’s a great inspirational story for the complete cricket fraternity. Hats off to him. This is what you want to see on the cricket field. He touched his guru’s feet and took his blessings before the game. His parents were there, his family was there. His friends were there at the ground watching him, that too from the Virat Kohli stand,” Sreesanth told Star Sports. Kohli scored 55 runs off 46 balls with the help of five fours before Mukesh Kumar accounted for his wicket. Before departing, Kohli had laid a platform for RCB, by putting on a partnership of 82 runs for the opening wicket with Faf du Plessis. “He walks out and scores that 50th fifty at his home-ground. He had all the different shots and he was the first batter to reach 7000 runs in the IPL. I mean, wow, and he is still not out. I keep saying, about this, that ‘Sky is the Limit’, that’s what we have been taught in school,” he stated. “But the way Virat and the new generation are playing fearless cricket, I say Sky is not the limit, because anybody watching this, if he can, then you can. That’s the inspiration he brings. Virat, big salute man,” Sreesanth added. Kohli’s knocks and milestones, however, didn’t pay dividends as RCB lost to DC by seven wickets. The Capitals chased down 182 with as many as 22 balls to spare.","pubDate":"2023-05-06 19:08:59","image_url":null,"source_id":"indiatoday","category":["sports"],"country":["india"],"language":"english"},{"title":"DC vs RCB: दिल्ली कैपिटल्स ने आरसीबी को 7 विकेट से हराया, सॉल्ट का शानदार अर्द्धशतक","link":"https://sports.ndtv.com/hindi/cricket/dc-vs-rcb-live-score-ipl-2023-today-50th-match-delhi-capitals-vs-royal-bangalore-challengers-live-score-updates-4011346#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"DC vs RCB, IPL 2023: दिल्ली के पारी के 17वें ओवर में ही लक्ष्य हासिल करने से साफ हो गया कि आरसीबी चैलेंजिग स्कोर से 30-40 रन पीछे रह गया.","content":"DC vs RCB : दिल्ली के विकेटकीपर फिलिप सॉल्ट ने एक मैच जिताऊ पारी खेली इंडियन प्रीमियर लीग (IPL 2023) में टेबल में ऊपर चढ़ने को बुरी तरह बेताब रॉयल चैलेंजर्स के गणित पर जोरदार प्रहार करते हुए दिल्ली कैपिटल्स ने शनिवार को घरेलू मैदान पर उसे 7 विकेट से हरा दिया. कैपिटल्स पहले से ही प्ले-ऑफ दौर से लगभग बाहर हो चुके हैं. ऐसे में आरसीबी के लिए आगे बढ़ने के लिहाज से यह मैच बहुत ही ज्यादा महत्वपूर्ण था, लेकिन इस अहम मौके पर हर विभाग में उसने खराब प्रदर्शन किया और 7 विकेट से हार झेलने को मजबूर होना पड़ा. जीत के लिए 182 रनों का पीछा करते हुए दिल्ली के ओपनर खास तौर पर विकेटकीपर फिलिप सॉल्ट (85) और कप्तान डेविड वॉर्नर ने करीब पांच ओवरों में 60 देकर बहुत ही शानदार शुरुआत दी. इस दौरान आरसीबी के बॉलरों ने बहुत घटिया लाइन और लेंथ का परिचय दिया. वॉर्नर आउट हो गए, लेकिन सॉल्ट लगातार प्रहार करते रहे. उन्हें मिशेल मार्श (26) और रॉली रोसेव (नाबाद 35) से अच्छा सहारा मिला. इससे दिल्ली ने 16.4 ओवरों में ही 3 विकेट खोकर जीत का लक्ष्य हासिल कर लिया. आरसीबी के दिग्गज गेंदबाजों का रवैया एकदम समझ से परे रहा. शुरुआती ओवरों में एकदम क्लब स्तरीय गेंदबाजी हुई. और इसका दिल्ली कैपिटल्स के बल्लेबाजोंं ने पूरा फायदा उठाते हुए शुरुआत में ही जीत का अच्छा आधार रख दिया. वहीं, पहली पाली में आरसीबी ने अरुण जेटली स्टेडियम में घरेलू टीम दिल्ली कैपिटल्स के सामने जीत के लिए 182 रनों का लक्ष्य रखा. पहले बैटिंग चुनने के बाद विराट कोहली (55) और फैफ डु प्लेसी (45) ने मिलकर आरसीबी को करीब दस ओवर में ही 82 रन जोड़कर बेहतरीन शुरुआत दी. जब लग रहा था कि कोहली घरेलू मैदान पर एक बड़ी पारी खेलने जा रहे हैं, तो वह आउट हो गए, तो फैफ भी पारी को लंबा नहीं खींच सके. मैक्सवेल (0) पहली ही गेंद पर चलते बने. ऐसे में राजस्थान के लिए रणजी ट्रॉफी खेलने वाले युवा लेफ्टी बल्लेबाज महिपाल लोमनोर (54) ने छोर पर तेज बल्लेबाजी की. और यह इस युवा का ही अच्छा प्रयास रहा कि राजस्थान ने कोटे के ओवरों में 4 विकेट खोकर 181 का स्कोर खड़ा किया, लेकिन यह दिल्ली के लिए खासा छोटा साबित हुआ. दिल्ली के पारी के 17वें ओवर में ही लक्ष्य हासिल करने से साफ हो गया कि आरसीबी चैलेंजिग स्कोर से 30-40 रन पीछे रह गया. दिल्ली के लिए मिचेल मार्श ने दो और खलील और मुकेश ने एक-एक विकेट लिया. मैच में खेलीं दोनों टीमों की फाइनल XI इस प्रकार रहीं: 1. डेविड वॉर्नर (कप्तान) 2. फिलिप सॉल्ट (विकेटकीपर) 3. मिशेल मार्श 4. मनीष पांडेय 5. राइले रोसोव 6. अक्षर पटेल 7. मुकेश कुमार 8. अमन हाकिम खान 9. कुलदीप यादव 10. खलील अहमद 11. इशांत शर्मा 1. फैफ डु प्लेसी (कप्तान) 2. विराट कोहली 3. अनुज रावत 4. ग्लेन मैक्सवेल 5. महिपाल लोमोर 6. दिनेश कार्तिक 7. केदार जाधव 8. वैनिंदु हसारंगा 9. कर्ण शर्मा 10. मोहम्मद सिराज 11. जोश हेजलवुड पढ़ें देश-विदेश की ख़बरें अब हिन्दी में ( ) | कर्नाटक चुनाव 2023 के लाइव अपडेट के लिए हमें फॉलो करें. लाइव खबर देखें: फॉलो करे:","pubDate":"2023-05-06 17:43:24","image_url":"https://c.ndtvimg.com/2023-05/itjkooko_phil-salt-bcci_625x300_06_May_23.jpg?im=FaceCrop,algorithm=dnn,width=530,height=400=80","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"\"मुझ पर लगा जुर्माना उचित नहीं', रिपोर्ट के अनुसार विराट ने झड़प की जानकारी बीसीसीआई को दी","link":"https://sports.ndtv.com/hindi/cricket/fine-on-me-is-unfair-as-per-reprots-virat-writes-spat-incident-detail-to-bcci-4011951#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"कोहली और गंभीर के बीच हुई झड़प पर अब विदेशी खिलाड़ियों की लगातार प्रतिक्रिया आ रही है. इसी बीच कोहली ने बोर्ड के कुछ अधिकारियों को लिखित में घटना की जानकारी दी है","content":"करीब हफ्ते भर पहले इंडियन प्रीमियर लीग (IPL 2023) में लखनऊ और आरसीबी (LSG vs RCB) के बीच खेले गए मुकाबले में विराट (virat Kohli) और गौतम गंभीर (Gautam Gambhir) के बीच झड़प पर चर्चा और प्रतिक्रिया अभी भी बनी हुई है. इस घटना के बाद इसमें शामिल तीनों ही खिलाड़ियों पर उनकी मैच फीस का जुर्माना लगाया गया था, लेकिन दुनिया भर के दिग्गज विवाद के लिए गौतम और विराट पर ही ज्यादा उंगली उठा रहे हैं. अब इस मामले से जुड़ी नयी खबर आ रही है. एक अग्रणी अखबार के अनुसार विराट कोहली ने बीसीसीआई को लेटर लिखकर घटना के बारे में विस्तार से जानकारी दी है. अखबार की रिपोर्ट के अनुसार बोर्ड के कुछ अधिकारियों को लिखे पत्र में विराट ने सौ फीसद मैच फीस काटे जाने को लेकर निराशा जाहिर की है. जानकारी के मुताबिक कोहली ने लिखा कि उन्होंने नावेन-उल-हक और गौतम गंभीर को कुछ भी नहीं कहा. घटना के बाद मैच रैफरी ने जहां गंभीर और विराट पर मैच फीस का सौ फीसद जुर्माना लगाया था, तो वहीं नावेद की पचास फीसदी फीस पर कैंची चली थी. बहरहाल, विराट नहीं मानते उनका बर्ताव इस कड़े दंड के दायरे में आता था. उनके जुर्माने की रकम 1.25 करोड़ रुपये तक जा सकती है. हालांकि, कोहली को यह नुकसान नहीं वहन करना होगा क्योंकि मैदान पर किए अपराध के लिए आरसीबी की खिलाड़ियों की मैच फीस काटने की नीति नहीं है. वैसे कोहली ने भले ही बीसीसीआई को लिखकर अपने बर्ताव को सही ठहराया हो, लेकिन घटना के इर्द-गिर्द मौजूद रहे खिलाड़ियों और अधिकारियों के अनुसार विराट का बर्ताव नावेन और मायर्स के प्रति ठीक नहीं था. यहां तक कि दूसरे छोर पर नावेन के साथ बैटिंग कर रहे अमित मिश्रा ने भी कोहली के बर्ताव की शिकायत अंपायरों से की थी. रिपोर्ट के अनुसार आरसीबी के पेसर मोहम्मद सिराज की बाउंसरों और थ्रो से नावेन थोड़ा क्रुद्ध हो गए थे. कोहली ने बीसीसीआई अधिकारी को लिखे संदेश में कहा कि उन्होंने सिराज को नावेन को हिट करने के लिए नहीं कहा. उन्होंने सिराज से केवल बाउंसर मारने को कहा था. पढ़ें देश-विदेश की ख़बरें अब हिन्दी में ( ) | कर्नाटक चुनाव 2023 के लाइव अपडेट के लिए हमें फॉलो करें. लाइव खबर देखें: फॉलो करे:","pubDate":"2023-05-06 16:57:26","image_url":"https://c.ndtvimg.com/2023-05/kf8j2eg8_virat-kohli-afp_625x300_04_May_23.jpg","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"IND vs PAK:पीसीबी ने वर्ल्ड कप के लिए भारत आने पर रखी खास डिमांड, बीसीसीआई से लिखित में मांगी गारंटी","link":"https://navbharattimes.indiatimes.com/sports/cricket/cricket-news/ind-vs-pak-pcb-chairman-najam-sethi-want-written-guarantee-bcci-champions-trophy-odi-worldcup-2023/articleshow/100040801.cms","keywords":null,"creator":null,"video_url":null,"description":"बीसीसीआई और पीसीबी के बीच पिछले कुछ समय से काफी ज्या सुर्खियों में बने हुए हैं। दरअसल, अब पाकिस्तान चाहता है कि बीसीसीआई लिखित गारंटी दे कि टीम इंडिया 2025 की चैंपियंस ट्रॉफी के लिए पाकिस्तान का दौरा करेगी।","content":"पाकिस्तान क्रिकेट बोर्ड (पीसीबी) के अध्यक्ष नजम सेठी इस साल एकदिवसीय विश्व कप में अपनी टीम को भारत भेजने से पहले भारतीय क्रिकेट बोर्ड (बीसीसीआई) के सचिव जय शाह से इस बात की लिखित गारंटी चाहते है कि उनके देश में 2025 में होने वाले आईसीसी (अंतरराष्ट्रीय क्रिकेट परिषद) चैम्पियंस ट्रॉफी में भारत की भागीदारी होगी। इस साल पांच अक्टूबर से होने वाले विश्व कप के लिए बीसीसीआई ने पाकिस्तान के मैचों के लिए अहमदाबाद (भारत के खिलाफ मैच), चेन्नई, बेंगलुरु और कोलकाता को स्थल के रूप में चुना है। जय शाह की अध्यक्षता में एसीसी (एशियाई क्रिकेट परिषद) ने आगामी एशिया कप 2023 के लिए प्रस्तावित ‘हाइब्रिड मॉडल’ की पुष्टि नहीं की। ‘हाइब्रिड मॉडल’ में भारत अपने मैच यूएई में खेलेगा जबकि अन्य मुकाबलों की मेजबानी पाकिस्तान करेगा। एक विश्वस्त सूत्र के अनुसार, सेठी आठ मई को दुबई के लिए रवाना होने वाले हैं, जहां वह एसीसी और आईसीसी अधिकारियों के साथ मीटिंग करेंगे। पीसीबी के सूत्र ने कहा कि अपनी दुबई यात्रा के दौरान सेठी के पाकिस्तान के ‘सैद्धांतिक रुख’ के लिए समर्थन जुटाने के लिए लॉबिंग शुरू करने की भी उम्मीद है। उनके मुताबिक 2025 चैंपियंस ट्रॉफी में भारत की भागीदारी को लेकर जब तक बीसीसीआई और आईसीसी लिखित गारंटी नहीं देते तब तक पाकिस्तान भारत में अपने विश्व कप मैच नहीं खेलेगा।’’ सूत्र ने कहा, ‘‘सेठी ने हाल ही में कुछ सरकारी अधिकारियों से मुलाकात की और उनसे सलाह भी ली कि क्या पाकिस्तान को उसके रुख के खिलाफ एशिया कप में खेलना चाहिए। पाकिस्तान चाहता है कि एशिया कप लाहौर और दुबई (हाईब्रिड मॉडल) में हो।’ उन्होंने कहा कि सितंबर में एशिया कप की मेजबानी के बारे में एसीसी सदस्यों को एक मजबूत और स्पष्ट रुख बताने के लिए सेठी को सरकार से मंजूरी मिल गई है। अब यह देखना दिलचस्प होगा कि भारत, पाकिस्तान जाता है या नहीं। बहरहाल, टीम इंडिया का पड़ोसी देश का दौरा करना लगभग नामुमकिन लग रहा है।","pubDate":"2023-05-06 16:44:21","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Corporation Win Backyard 2023 Cricket Opener","link":"https://bernews.com/2023/05/corporation-win-backyard-cricket-2023-opener/","keywords":["All","Sports","#BermudaCricket"],"creator":["temp"],"video_url":null,"description":"The Bermuda Police Backyard Cricket League kicked off the second season with the defending champions Bermuda Hospital Board falling by 7 wickets to the Corporation of Hamilton. After winning the toss the Bermuda Hospital Board scored 109/3 in their allotted 15 overs, Rushaine Murphy was the top scorer with 43, while Lateef Trott was the […]","content":"The Bermuda Police Backyard Cricket League kicked off the second season with the defending champions Bermuda Hospital Board falling by 7 wickets to the Corporation of Hamilton. After winning the toss the Bermuda Hospital Board scored 109/3 in their allotted 15 overs, Rushaine Murphy was the top scorer with 43, while Lateef Trott was the pick of the Corporation of Hamilton bowlers with figures of 3-0-8-1. In reply Trott would lead the Corporation of Hamilton to victory scoring 40 as they scored 113/3 in 18.5 overs, Murphy was the pick of the Bermuda Hospital Board bowlers with figures of 3-0-20-2. : ,","pubDate":"2023-05-06 16:26:50","image_url":null,"source_id":"bernews","category":["sports"],"country":["Bermuda"],"language":"english"},{"title":"पठान राशिद की धुन पर झूमा गुजरात, साल भर में दुनिया की लीगों से इतनी मोटी कमायी करते हैं लेग स्पिनर","link":"https://sports.ndtv.com/hindi/cricket/gujrat-makes-merry-on-tune-of-pathan-rashid-khan-thats-how-big-amount-leg-sppiner-earns-in-a-year-from-varius-leages-4011616#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"RR vs GT, IPL 2023: शुक्रवार को खेले गए मुकाबले में राशिद खान (Rashid Khan) ने तीन विकेट लिए. और वह प्लेयर ऑफ द मैच रहे.","content":"राशिद खान ने शुक्रवार को गुजरात की जीत में स्पिन का जादू दिखाया अफगानी लेग स्पिनर राशिद खान (Rashid Khan) शुक्रवार को आईपीएल में काफी लंबे समय बाद बरसे, लेकिन जब बरसे, तो उनकी धुन पर गुजरात टाइटंस ने नौ विकेट से जीत दर्ज करते हुए झूम उठा. पिछले कुछ मैच राशिद के लिए सूखे-सूखे जा रहे थे और फैंस उन्हें विकेट चटकाते देखने के लिए तरस गए थे. लेकिन राजस्थान के खिलाफ पठान की लेग स्पिन का गजब का जादू चला. राशिद ने चार ओवरों में 14 रन देकर तीन विकेट चटकाए. और वह प्लेयर ऑफ द मैच चुने गए. और इतना ही नहीं राशिद खान (Rashid Khan) इस प्रदर्शन के बाद से पर्पल कैप की रेस में फिलहाल नंबर तीन के गेंदबाज हो चले हैं. घरेलू पिच पर पर पहले बैटिंग चुनने वाली राजस्थान के विकेटों की नियमित अंतराल पर लगी झड़ी में राशिद ने अश्विन, हेटमायर और रियान पराग के विकेट लिए. पराग और हेटमायर दोनों ही राशिद की गेंदों को हाथ देखकर नहीं पकड़ सके कि गेंद अंदर आएगी या बाहर जाएगी. फिलहाल शुक्रवार तक राशिद खान लीग में सबसे ज्यादा विकेट चटकाने वाले बॉलरों में संयुक्त रूप से शमी (18 विकेट) के साथ दूसरे नंबर पर चल रहे हैं. यह प्रदर्शन दिखाता है कि राशिद गुजरात के लिए कितने ज्यादा अहम खिलाड़ी हैं. और वह गुजरात के लिए ही नहीं, बल्कि दुनिया की उन तमाम टीमों के लिए हैं, जो अलग-अलग लीग में खेलती हैं. अफगानिस्तान के अलावा राशिद इन टीमों से साल भर में मोटी रकम कमाते हैं. राशिद को अफगानिस्तान बोर्ड से साल भर में फीस के रूप में भारतीय रकम में तकरीबन 73 लाख रुपये मिलते हैं. इसके अलावा उन्हें गुजरात की टीम से सालाना फीस के रूप में 15 करोड़, बिग बैश लीग से करीब तीन करोड़, पाकिस्तान लीग से भारतीय मुद्रा में करीब 36 लाख और दक्षिण अफ्रीका लीग से उन्हें करीब एक करोड़ 44 लाख रुपये मिलते हैं. कुल मिलाकर लेग स्पिन के दम पर दुनिया भर के बल्लेबाजों को पानी पिलाने वाले राशिद खान को सिर्फ लीग भर से ही करीब इक्कीस करोड़ रुपये सलाना की कमायी करते हैं. इसमें उन्हें अफगानिस्तान बोर्ड से मिलने वाले करीब 73 लाख रुपये शामिल नहीं हैं पढ़ें देश-विदेश की ख़बरें अब हिन्दी में ( ) | कर्नाटक चुनाव 2023 के लाइव अपडेट के लिए हमें फॉलो करें. लाइव खबर देखें: फॉलो करे:","pubDate":"2023-05-06 16:09:03","image_url":"https://c.ndtvimg.com/2023-04/i50ouni8_rashid-khan-bcci-ipl_625x300_25_April_23.jpg","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"DC vs RCB: कोहली ने बनाया \"विराट रिकॉर्ड\", बचपन के दोस्त से चल रही है टक्कर","link":"https://sports.ndtv.com/hindi/cricket/dc-vs-rcb-kohli-makes-virat-record-childhood-friend-following-him-very-closely-4011769#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"Delhi Capitals vs Royal Challengers Bangalore: कोहली ने शनिवार को घरेलू मैदान पर आरसीबी के खिलाफ 55 रन की उम्दा पारी खेली.","content":"Delhi Capitals vs Royal Challengers Bangalore: विराट ने अच्छा अर्द्धशतक बनाया चाहे जारी इंडियन प्रीमियर लीग (IPL 2023) हो, या फिर यह टीम इंडिया का मंच हो, विराट कोहली (Virat Kohli) ऐसे मुकाम पर खड़े हैं, जहां वह कुछ भी करते हैं, तो कोई न कोई रिकॉर्ड उनकी झोली में जा गिरता है. और शनिवार को घरेलू अरुण जेटली स्टेडियम में दिल्ली कैपिटल्स के खिलाफ भी उनके साथ कुछ ऐसा ही हुआ. विराट ने जैसे ही पारी में 12वां लिया, तो पहले उन्होंने टूर्नामेंट में सुपर से ऊपर कारनामा करते हुए अपने सात हजार रन पूरे किए. और यह कारनामा करने वाले वह इतिहास के पहले बल्लेबाज बन गए हैं. विराट ने स्पिनर अक्षर पटेल के पारी के फेंके दूसरे ही ओवर में सिंगल लेकर यह बड़ी उपलब्धि हासिल की. मैच से पहले उन्हें यह आंकड़ा छूने के लिए सिर्फ 12 रन की दरकार थी. इस बड़ी उपलब्धि के लिए अब उन्हें बचपन के दोस्त शिखर धवन से मुकाबला करना पड़ रहा है. पंजाब की कप्तानी कर रहे धवन के भी फिलहाल 213 मैचों में 6536 रन हैं और वह विराट के बाद दूसरे नंबर पर हैं. वॉर्नर (6189) तीसरे और रोहित शर्मा (6063) चौथे नंबर पर हैं. वहीं, धवन के साथ उनका मुकाबला रनों को लेकर ही नहीं चल रहा. दोनों के बीच जंग अर्द्धशतकों को लेकर भी छिड़ी हुई है. विराट ने शनिवार को सात हजार रन पूर करने के साथ ही लीग में अपना पचासवां अर्द्धशतक भी जड़ा. धवन 49 अर्द्धशतक जड़कर बराबर कोहली का कंधे से कंधा मिलाकर मुकाबला कर रहे हैं. वैसे इस मामले में डेविड वॉर्नर (59) शीर्ष पर हैं. जाहिर है कि विराट ही नहीं, बल्कि धवन के सामने अभी भी वॉर्नर के अर्द्धशतकों को पीछे छोड़ने की प्रेरणा है. देखते हैं कि करियर के समापन पर कौन सा दिग्गज अर्द्धशतकों के मामले में क्या पैमाना सेट करता है. पढ़ें देश-विदेश की ख़बरें अब हिन्दी में ( ) | कर्नाटक चुनाव 2023 के लाइव अपडेट के लिए हमें फॉलो करें. लाइव खबर देखें: फॉलो करे:","pubDate":"2023-05-06 15:33:47","image_url":"https://c.ndtvimg.com/2023-05/lmt75o08_virat-kohli-bcci_625x300_06_May_23.jpg?im=FaceCrop,algorithm=dnn,width=530,height=400=80","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Hrvat zabio i vratio slavni talijanski klub u elitni razred","link":"https://www.tportal.hr/sport/clanak/hrvat-zabio-i-vratio-slavni-talijanski-klub-u-elitni-razred-20230506","keywords":["Sport"],"creator":null,"video_url":null,"description":"Genoa će se sljedeće sezone, nakon samo jedne godine porovedene u Serie B, vratiti u elitu Serie A zahvaljujući subotnjoj pobjedi protiv Ascolija (2:1) kojom je osigurala jedno od prva dva mjesta","content":"Prvi pogodak za Genou dao je bivši hrvatski reprezentativac Milan Badelj, dok je vratar Adrian Šemper ostao na klupi. Dva kola prije kraja regularnog dijela 'Grifoni', što je nadimak ligurskog kluba, imaju osam bodova više od trećeg Barija, koji je remizirao kod u Modene (1:1). Genoa se tako priključila Frosinoneu, koji je u ponedjeljak matematički potvrdio svoj povratak u najjaču ligu talijanskoga nogometa. Treća ulaznica za elitu bit će podijeljena na kraju završne faze, koja će se odnositi na šest momčadi koje će završiti od trećeg do osmog mjesta regularnog dijela sezone. Genoa, koju od prosinca trenira bivši talijanski reprezentativac Alberto Gilardino (40), vraća se u Serie A, dok će drugi klub iz Genove, Sampdoria, trenutno zadnja u prvoj ligi, vjerojatno ispasti. Genoa Cricket and Football Club povijesni je klub talijanskog nogometa, utemeljen 1893. Prvo talijansko prvenstvo osvojio je 1898. i ima ukupno devet naslova, od kojih posljednji datira prije gotovo jednog stoljeća (1924) . Klub je 1990-ih pao u Serie B. Kupio ga je i restrukturirao talijanski poduzetnik Enrico Preziosi 2003., vratio se u prvu ligu 2007. gdje je ostao do ispadanja u svibnju 2022. Preziosi je prodao klub u rujnu 2021. godine američkom fondu 777 Partners.","pubDate":"2023-05-06 15:19:00","image_url":"https://www.tportal.hr/media/thumbnail/500x300/1992570.jpeg?cropId=0","source_id":"tportal","category":["sports"],"country":["Croatia"],"language":"croatian"},{"title":"Genoa i Badelj se vraćaju u Seriju A","link":"https://sport.hrt.hr/medunarodni-nogomet/genoa-i-badelj-se-vracaju-u-seriju-a-10760099","keywords":null,"creator":null,"video_url":null,"description":"Genoa će se sljedeće sezone, nakon samo jedne godine provedene u Serie B, vratiti u elitu Serie A zahvaljujući subotnjoj pobjedi protiv Ascolija (2-1) kojom je osigurala jedno od prva dva mjesta.","content":"Genoa će se sljedeće sezone, nakon samo jedne godine provedene u Serie B, vratiti u elitu Serie A zahvaljujući subotnjoj pobjedi protiv Ascolija (2-1) kojom je osigurala jedno od prva dva mjesta. Pobjednički pogodak za Genou postigao je bivši hrvatski reprezentativac Milan Badelj u 63. minuti, dok je vratar Adrian Šemper ostao na klupi. U redovima Ascolija najbolji je bio nekadašnji stoper Hajduka i Rijeke Lorenco Šimić . View this post on Instagram A post shared by Genoa Cfc (@genoacfc) Dva kola prije kraja regularnog dijela \"Grifoni\", što je nadimak ligurskog kluba, imaju osam bodova više od trećeg Barija, koji je remizirao kod u Modene (1-1). Genoa se tako priključila Frosinoneu , koji je u ponedjeljak matematički potvrdio svoj povratak u najjaču ligu talijanskoga nogometa. Treća ulaznica za elitu bit će podijeljena na kraju završne faze, koja će se odnositi na šest momčadi koje će završiti od trećeg do osmog mjesta regularnog dijela sezone. Alberto Gilardino preporodio Genou Genoa, koju od prosinca trenira bivši talijanski reprezentativac Alberto Gilardino (40), vraća se u Serie A, dok će drugi klub iz Genove, Sampdoria, trenutno zadnja u prvoj ligi, vjerojatno ispasti. Genoa Cricket and Football Club povijesni je klub talijanskog nogometa, utemeljen 1893. Prvo talijansko prvenstvo osvojio je 1898. i ima ukupno devet naslova, od kojih posljednji datira prije gotovo jednog stoljeća (1924.). Klub je 1990-ih pao u Serie B. Kupio ga je i restrukturirao talijanski poduzetnik Enrico Preziosi 2003., vratio se u prvu ligu 2007. gdje je ostao do ispadanja u svibnju 2022. Preziosi je prodao klub u rujnu 2021. godine američkom fondu 777 Partners. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1657620534770-0'); }); googletag.cmd.push(function() { googletag.display('div-gpt-ad-1657619086178-0'); }); prije 5 min 'Vidjeli smo umornog čovjeka koji se teško nosio s krunom i ceremonijom' prije 19 min Rijeka u sjajnoj utakmici u 97. minuti do boda protiv Istre prije 45 min Bayern slavio u Bremenu _ipromNS('zone',32) _ipromNS('zone',265) Vezani sadržaj Bayern slavio u Bremenu Salah odlučio susret i postao egipatski rekorder Važna pobjeda Intera kod Rome Sopić i Zekić nakon remija u Velikoj Gorici","pubDate":"2023-05-06 14:54:08","image_url":null,"source_id":"hrt","category":["sports"],"country":["Croatia"],"language":"croatian"},{"title":"Bivši Vatreni zabio, najstariji talijanski klub vraća se u Serie A","link":"https://danas.hr/sport/nogomet/bivsi-vatreni-zabio-najstariji-talijanski-klub-vraca-se-u-serie-a-454f0b6c-ec1d-11ed-ab55-f29814d0c9ee","keywords":["Nogomet","Milan Badelj"],"creator":null,"video_url":null,"description":"Genoa, koju od prosinca trenira bivši talijanski reprezentativac Alberto Gilardino (40), vraća se u Serie A","content":"će se sljedeće sezone, nakon samo jedne godine porovedene u Serie B, vratiti u elitu Serie A zahvaljujući subotnjoj pobjedi protiv Ascolija (2-1) kojom je osigurala jedno od prva dva mjesta. Prvi pogodak za Genou dao je bivši hrvatski reprezentativac , dok je vratar ostao na klupi. Dva kola prije kraja regularnog dijela Grifoni, što je nadimak ligurskog kluba, imaju osam bodova više od trećeg Barija, koji je remizirao kod u Modene (1-1). Genoa se tako priključila Frosinoneu, koji je u ponedjeljak matematički potvrdio svoj povratak u najjaču ligu talijanskoga nogometa. Treća ulaznica za elitu bit će podijeljena na kraju završne faze, koja će se odnositi na šest momčadi koje će završiti od trećeg do osmog mjesta regularnog dijela sezone. Genoa, koju od prosinca trenira bivši talijanski reprezentativac Alberto Gilardino (40), vraća se u Serie A, dok će drugi klub iz Genove, Sampdoria, trenutno zadnja u prvoj ligi, vjerojatno ispasti. Genoa Cricket and Football Club najstariji je klub talijanskog nogometa, utemeljen 1893. Prvo talijansko prvenstvo osvojio je 1898. i ima ukupno devet naslova, od kojih posljednji datira prije gotovo jednog stoljeća (1924). Klub je 1990-ih pao u Serie B. Kupio ga je i restrukturirao talijanski poduzetnik Enrico Preziosi 2003., vratio se u prvu ligu 2007. gdje je ostao do ispadanja u svibnju 2022. Preziosi je prodao klub u rujnu 2021. godine američkom fondu 777 Partners.","pubDate":"2023-05-06 14:50:17","image_url":"https://d19p4plxg0u3gz.cloudfront.net/32e08c76-ec1d-11ed-8a02-e69bd02d5791/original","source_id":"rtl_hr","category":["sports"],"country":["Croatia"],"language":"croatian"},{"title":"Sreesanth praises on Kohli for being an inspirational story after 7000 IPL runs","link":"https://www.indiatoday.in/sports/ipl-2023/story/sreesanth-heaps-praise-on-virat-kohli-for-being-an-inspirational-story-after-7000-ipl-runs-sky-is-not-the-limit-2375819-2023-05-07?utm_source=rss","keywords":null,"creator":null,"video_url":null,"description":"Sreesanth praises on Kohli for being an inspirational story after 7000 IPL runs","content":": Former speedster Sreesanth lauded Virat Kohli after the latter became the first batter to score 7000 runs in the Indian Premier League (IPL). The 34-year-old Kohli got to the feat while playing for the Royal Challengers Bangalore (RCB) in their match against the Delhi Capitals (DC) at the Arun Jaitley Stadium in New Delhi on Saturday, May 6. Kohli was 25 runs short of the milestone before the game and he got there with the utmost ease. Kohli also became the first batter to score in the IPL. “It’s a great inspirational story for the complete cricket fraternity. Hats off to him. This is what you want to see on the cricket field. He touched his guru’s feet and took his blessings before the game. His parents were there, his family was there. His friends were there at the ground watching him, that too from the Virat Kohli stand,” Sreesanth told Star Sports. Kohli scored 55 runs off 46 balls with the help of five fours before Mukesh Kumar accounted for his wicket. Before departing, Kohli had laid a platform for RCB, by putting on a partnership of 82 runs for the opening wicket with Faf du Plessis. “He walks out and scores that 50th fifty at his home-ground. He had all the different shots and he was the first batter to reach 7000 runs in the IPL. I mean, wow, and he is still not out. I keep saying, about this, that ‘Sky is the Limit’, that’s what we have been taught in school,” he stated. “But the way Virat and the new generation are playing fearless cricket, I say Sky is not the limit, because anybody watching this, if he can, then you can. That’s the inspiration he brings. Virat, big salute man,” Sreesanth added. Kohli’s knocks and milestones, however, didn’t pay dividends as RCB lost to DC by seven wickets. The Capitals chased down 182 with as many as 22 balls to spare.","pubDate":"2023-05-06 19:08:59","image_url":null,"source_id":"indiatoday","category":["sports"],"country":["india"],"language":"english"},{"title":"DC vs RCB: दिल्ली कैपिटल्स ने आरसीबी को 7 विकेट से हराया, सॉल्ट का शानदार अर्द्धशतक","link":"https://sports.ndtv.com/hindi/cricket/dc-vs-rcb-live-score-ipl-2023-today-50th-match-delhi-capitals-vs-royal-bangalore-challengers-live-score-updates-4011346#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"DC vs RCB, IPL 2023: दिल्ली के पारी के 17वें ओवर में ही लक्ष्य हासिल करने से साफ हो गया कि आरसीबी चैलेंजिग स्कोर से 30-40 रन पीछे रह गया.","content":"DC vs RCB : दिल्ली के विकेटकीपर फिलिप सॉल्ट ने एक मैच जिताऊ पारी खेली इंडियन प्रीमियर लीग (IPL 2023) में टेबल में ऊपर चढ़ने को बुरी तरह बेताब रॉयल चैलेंजर्स के गणित पर जोरदार प्रहार करते हुए दिल्ली कैपिटल्स ने शनिवार को घरेलू मैदान पर उसे 7 विकेट से हरा दिया. कैपिटल्स पहले से ही प्ले-ऑफ दौर से लगभग बाहर हो चुके हैं. ऐसे में आरसीबी के लिए आगे बढ़ने के लिहाज से यह मैच बहुत ही ज्यादा महत्वपूर्ण था, लेकिन इस अहम मौके पर हर विभाग में उसने खराब प्रदर्शन किया और 7 विकेट से हार झेलने को मजबूर होना पड़ा. जीत के लिए 182 रनों का पीछा करते हुए दिल्ली के ओपनर खास तौर पर विकेटकीपर फिलिप सॉल्ट (85) और कप्तान डेविड वॉर्नर ने करीब पांच ओवरों में 60 देकर बहुत ही शानदार शुरुआत दी. इस दौरान आरसीबी के बॉलरों ने बहुत घटिया लाइन और लेंथ का परिचय दिया. वॉर्नर आउट हो गए, लेकिन सॉल्ट लगातार प्रहार करते रहे. उन्हें मिशेल मार्श (26) और रॉली रोसेव (नाबाद 35) से अच्छा सहारा मिला. इससे दिल्ली ने 16.4 ओवरों में ही 3 विकेट खोकर जीत का लक्ष्य हासिल कर लिया. आरसीबी के दिग्गज गेंदबाजों का रवैया एकदम समझ से परे रहा. शुरुआती ओवरों में एकदम क्लब स्तरीय गेंदबाजी हुई. और इसका दिल्ली कैपिटल्स के बल्लेबाजोंं ने पूरा फायदा उठाते हुए शुरुआत में ही जीत का अच्छा आधार रख दिया. वहीं, पहली पाली में आरसीबी ने अरुण जेटली स्टेडियम में घरेलू टीम दिल्ली कैपिटल्स के सामने जीत के लिए 182 रनों का लक्ष्य रखा. पहले बैटिंग चुनने के बाद विराट कोहली (55) और फैफ डु प्लेसी (45) ने मिलकर आरसीबी को करीब दस ओवर में ही 82 रन जोड़कर बेहतरीन शुरुआत दी. जब लग रहा था कि कोहली घरेलू मैदान पर एक बड़ी पारी खेलने जा रहे हैं, तो वह आउट हो गए, तो फैफ भी पारी को लंबा नहीं खींच सके. मैक्सवेल (0) पहली ही गेंद पर चलते बने. ऐसे में राजस्थान के लिए रणजी ट्रॉफी खेलने वाले युवा लेफ्टी बल्लेबाज महिपाल लोमनोर (54) ने छोर पर तेज बल्लेबाजी की. और यह इस युवा का ही अच्छा प्रयास रहा कि राजस्थान ने कोटे के ओवरों में 4 विकेट खोकर 181 का स्कोर खड़ा किया, लेकिन यह दिल्ली के लिए खासा छोटा साबित हुआ. दिल्ली के पारी के 17वें ओवर में ही लक्ष्य हासिल करने से साफ हो गया कि आरसीबी चैलेंजिग स्कोर से 30-40 रन पीछे रह गया. दिल्ली के लिए मिचेल मार्श ने दो और खलील और मुकेश ने एक-एक विकेट लिया. मैच में खेलीं दोनों टीमों की फाइनल XI इस प्रकार रहीं: 1. डेविड वॉर्नर (कप्तान) 2. फिलिप सॉल्ट (विकेटकीपर) 3. मिशेल मार्श 4. मनीष पांडेय 5. राइले रोसोव 6. अक्षर पटेल 7. मुकेश कुमार 8. अमन हाकिम खान 9. कुलदीप यादव 10. खलील अहमद 11. इशांत शर्मा 1. फैफ डु प्लेसी (कप्तान) 2. विराट कोहली 3. अनुज रावत 4. ग्लेन मैक्सवेल 5. महिपाल लोमोर 6. दिनेश कार्तिक 7. केदार जाधव 8. वैनिंदु हसारंगा 9. कर्ण शर्मा 10. मोहम्मद सिराज 11. जोश हेजलवुड पढ़ें देश-विदेश की ख़बरें अब हिन्दी में ( ) | कर्नाटक चुनाव 2023 के लाइव अपडेट के लिए हमें फॉलो करें. लाइव खबर देखें: फॉलो करे:","pubDate":"2023-05-06 17:43:24","image_url":"https://c.ndtvimg.com/2023-05/itjkooko_phil-salt-bcci_625x300_06_May_23.jpg?im=FaceCrop,algorithm=dnn,width=530,height=400=80","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"\"मुझ पर लगा जुर्माना उचित नहीं', रिपोर्ट के अनुसार विराट ने झड़प की जानकारी बीसीसीआई को दी","link":"https://sports.ndtv.com/hindi/cricket/fine-on-me-is-unfair-as-per-reprots-virat-writes-spat-incident-detail-to-bcci-4011951#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"कोहली और गंभीर के बीच हुई झड़प पर अब विदेशी खिलाड़ियों की लगातार प्रतिक्रिया आ रही है. इसी बीच कोहली ने बोर्ड के कुछ अधिकारियों को लिखित में घटना की जानकारी दी है","content":"करीब हफ्ते भर पहले इंडियन प्रीमियर लीग (IPL 2023) में लखनऊ और आरसीबी (LSG vs RCB) के बीच खेले गए मुकाबले में विराट (virat Kohli) और गौतम गंभीर (Gautam Gambhir) के बीच झड़प पर चर्चा और प्रतिक्रिया अभी भी बनी हुई है. इस घटना के बाद इसमें शामिल तीनों ही खिलाड़ियों पर उनकी मैच फीस का जुर्माना लगाया गया था, लेकिन दुनिया भर के दिग्गज विवाद के लिए गौतम और विराट पर ही ज्यादा उंगली उठा रहे हैं. अब इस मामले से जुड़ी नयी खबर आ रही है. एक अग्रणी अखबार के अनुसार विराट कोहली ने बीसीसीआई को लेटर लिखकर घटना के बारे में विस्तार से जानकारी दी है. अखबार की रिपोर्ट के अनुसार बोर्ड के कुछ अधिकारियों को लिखे पत्र में विराट ने सौ फीसद मैच फीस काटे जाने को लेकर निराशा जाहिर की है. जानकारी के मुताबिक कोहली ने लिखा कि उन्होंने नावेन-उल-हक और गौतम गंभीर को कुछ भी नहीं कहा. घटना के बाद मैच रैफरी ने जहां गंभीर और विराट पर मैच फीस का सौ फीसद जुर्माना लगाया था, तो वहीं नावेद की पचास फीसदी फीस पर कैंची चली थी. बहरहाल, विराट नहीं मानते उनका बर्ताव इस कड़े दंड के दायरे में आता था. उनके जुर्माने की रकम 1.25 करोड़ रुपये तक जा सकती है. हालांकि, कोहली को यह नुकसान नहीं वहन करना होगा क्योंकि मैदान पर किए अपराध के लिए आरसीबी की खिलाड़ियों की मैच फीस काटने की नीति नहीं है. वैसे कोहली ने भले ही बीसीसीआई को लिखकर अपने बर्ताव को सही ठहराया हो, लेकिन घटना के इर्द-गिर्द मौजूद रहे खिलाड़ियों और अधिकारियों के अनुसार विराट का बर्ताव नावेन और मायर्स के प्रति ठीक नहीं था. यहां तक कि दूसरे छोर पर नावेन के साथ बैटिंग कर रहे अमित मिश्रा ने भी कोहली के बर्ताव की शिकायत अंपायरों से की थी. रिपोर्ट के अनुसार आरसीबी के पेसर मोहम्मद सिराज की बाउंसरों और थ्रो से नावेन थोड़ा क्रुद्ध हो गए थे. कोहली ने बीसीसीआई अधिकारी को लिखे संदेश में कहा कि उन्होंने सिराज को नावेन को हिट करने के लिए नहीं कहा. उन्होंने सिराज से केवल बाउंसर मारने को कहा था. पढ़ें देश-विदेश की ख़बरें अब हिन्दी में ( ) | कर्नाटक चुनाव 2023 के लाइव अपडेट के लिए हमें फॉलो करें. लाइव खबर देखें: फॉलो करे:","pubDate":"2023-05-06 16:57:26","image_url":"https://c.ndtvimg.com/2023-05/kf8j2eg8_virat-kohli-afp_625x300_04_May_23.jpg","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"IND vs PAK:पीसीबी ने वर्ल्ड कप के लिए भारत आने पर रखी खास डिमांड, बीसीसीआई से लिखित में मांगी गारंटी","link":"https://navbharattimes.indiatimes.com/sports/cricket/cricket-news/ind-vs-pak-pcb-chairman-najam-sethi-want-written-guarantee-bcci-champions-trophy-odi-worldcup-2023/articleshow/100040801.cms","keywords":null,"creator":null,"video_url":null,"description":"बीसीसीआई और पीसीबी के बीच पिछले कुछ समय से काफी ज्या सुर्खियों में बने हुए हैं। दरअसल, अब पाकिस्तान चाहता है कि बीसीसीआई लिखित गारंटी दे कि टीम इंडिया 2025 की चैंपियंस ट्रॉफी के लिए पाकिस्तान का दौरा करेगी।","content":"पाकिस्तान क्रिकेट बोर्ड (पीसीबी) के अध्यक्ष नजम सेठी इस साल एकदिवसीय विश्व कप में अपनी टीम को भारत भेजने से पहले भारतीय क्रिकेट बोर्ड (बीसीसीआई) के सचिव जय शाह से इस बात की लिखित गारंटी चाहते है कि उनके देश में 2025 में होने वाले आईसीसी (अंतरराष्ट्रीय क्रिकेट परिषद) चैम्पियंस ट्रॉफी में भारत की भागीदारी होगी। इस साल पांच अक्टूबर से होने वाले विश्व कप के लिए बीसीसीआई ने पाकिस्तान के मैचों के लिए अहमदाबाद (भारत के खिलाफ मैच), चेन्नई, बेंगलुरु और कोलकाता को स्थल के रूप में चुना है। जय शाह की अध्यक्षता में एसीसी (एशियाई क्रिकेट परिषद) ने आगामी एशिया कप 2023 के लिए प्रस्तावित ‘हाइब्रिड मॉडल’ की पुष्टि नहीं की। ‘हाइब्रिड मॉडल’ में भारत अपने मैच यूएई में खेलेगा जबकि अन्य मुकाबलों की मेजबानी पाकिस्तान करेगा। एक विश्वस्त सूत्र के अनुसार, सेठी आठ मई को दुबई के लिए रवाना होने वाले हैं, जहां वह एसीसी और आईसीसी अधिकारियों के साथ मीटिंग करेंगे। पीसीबी के सूत्र ने कहा कि अपनी दुबई यात्रा के दौरान सेठी के पाकिस्तान के ‘सैद्धांतिक रुख’ के लिए समर्थन जुटाने के लिए लॉबिंग शुरू करने की भी उम्मीद है। उनके मुताबिक 2025 चैंपियंस ट्रॉफी में भारत की भागीदारी को लेकर जब तक बीसीसीआई और आईसीसी लिखित गारंटी नहीं देते तब तक पाकिस्तान भारत में अपने विश्व कप मैच नहीं खेलेगा।’’ सूत्र ने कहा, ‘‘सेठी ने हाल ही में कुछ सरकारी अधिकारियों से मुलाकात की और उनसे सलाह भी ली कि क्या पाकिस्तान को उसके रुख के खिलाफ एशिया कप में खेलना चाहिए। पाकिस्तान चाहता है कि एशिया कप लाहौर और दुबई (हाईब्रिड मॉडल) में हो।’ उन्होंने कहा कि सितंबर में एशिया कप की मेजबानी के बारे में एसीसी सदस्यों को एक मजबूत और स्पष्ट रुख बताने के लिए सेठी को सरकार से मंजूरी मिल गई है। अब यह देखना दिलचस्प होगा कि भारत, पाकिस्तान जाता है या नहीं। बहरहाल, टीम इंडिया का पड़ोसी देश का दौरा करना लगभग नामुमकिन लग रहा है।","pubDate":"2023-05-06 16:44:21","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Corporation Win Backyard 2023 Cricket Opener","link":"https://bernews.com/2023/05/corporation-win-backyard-cricket-2023-opener/","keywords":["All","Sports","#BermudaCricket"],"creator":["temp"],"video_url":null,"description":"The Bermuda Police Backyard Cricket League kicked off the second season with the defending champions Bermuda Hospital Board falling by 7 wickets to the Corporation of Hamilton. After winning the toss the Bermuda Hospital Board scored 109/3 in their allotted 15 overs, Rushaine Murphy was the top scorer with 43, while Lateef Trott was the […]","content":"The Bermuda Police Backyard Cricket League kicked off the second season with the defending champions Bermuda Hospital Board falling by 7 wickets to the Corporation of Hamilton. After winning the toss the Bermuda Hospital Board scored 109/3 in their allotted 15 overs, Rushaine Murphy was the top scorer with 43, while Lateef Trott was the pick of the Corporation of Hamilton bowlers with figures of 3-0-8-1. In reply Trott would lead the Corporation of Hamilton to victory scoring 40 as they scored 113/3 in 18.5 overs, Murphy was the pick of the Bermuda Hospital Board bowlers with figures of 3-0-20-2. : ,","pubDate":"2023-05-06 16:26:50","image_url":null,"source_id":"bernews","category":["sports"],"country":["Bermuda"],"language":"english"},{"title":"पठान राशिद की धुन पर झूमा गुजरात, साल भर में दुनिया की लीगों से इतनी मोटी कमायी करते हैं लेग स्पिनर","link":"https://sports.ndtv.com/hindi/cricket/gujrat-makes-merry-on-tune-of-pathan-rashid-khan-thats-how-big-amount-leg-sppiner-earns-in-a-year-from-varius-leages-4011616#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"RR vs GT, IPL 2023: शुक्रवार को खेले गए मुकाबले में राशिद खान (Rashid Khan) ने तीन विकेट लिए. और वह प्लेयर ऑफ द मैच रहे.","content":"राशिद खान ने शुक्रवार को गुजरात की जीत में स्पिन का जादू दिखाया अफगानी लेग स्पिनर राशिद खान (Rashid Khan) शुक्रवार को आईपीएल में काफी लंबे समय बाद बरसे, लेकिन जब बरसे, तो उनकी धुन पर गुजरात टाइटंस ने नौ विकेट से जीत दर्ज करते हुए झूम उठा. पिछले कुछ मैच राशिद के लिए सूखे-सूखे जा रहे थे और फैंस उन्हें विकेट चटकाते देखने के लिए तरस गए थे. लेकिन राजस्थान के खिलाफ पठान की लेग स्पिन का गजब का जादू चला. राशिद ने चार ओवरों में 14 रन देकर तीन विकेट चटकाए. और वह प्लेयर ऑफ द मैच चुने गए. और इतना ही नहीं राशिद खान (Rashid Khan) इस प्रदर्शन के बाद से पर्पल कैप की रेस में फिलहाल नंबर तीन के गेंदबाज हो चले हैं. घरेलू पिच पर पर पहले बैटिंग चुनने वाली राजस्थान के विकेटों की नियमित अंतराल पर लगी झड़ी में राशिद ने अश्विन, हेटमायर और रियान पराग के विकेट लिए. पराग और हेटमायर दोनों ही राशिद की गेंदों को हाथ देखकर नहीं पकड़ सके कि गेंद अंदर आएगी या बाहर जाएगी. फिलहाल शुक्रवार तक राशिद खान लीग में सबसे ज्यादा विकेट चटकाने वाले बॉलरों में संयुक्त रूप से शमी (18 विकेट) के साथ दूसरे नंबर पर चल रहे हैं. यह प्रदर्शन दिखाता है कि राशिद गुजरात के लिए कितने ज्यादा अहम खिलाड़ी हैं. और वह गुजरात के लिए ही नहीं, बल्कि दुनिया की उन तमाम टीमों के लिए हैं, जो अलग-अलग लीग में खेलती हैं. अफगानिस्तान के अलावा राशिद इन टीमों से साल भर में मोटी रकम कमाते हैं. राशिद को अफगानिस्तान बोर्ड से साल भर में फीस के रूप में भारतीय रकम में तकरीबन 73 लाख रुपये मिलते हैं. इसके अलावा उन्हें गुजरात की टीम से सालाना फीस के रूप में 15 करोड़, बिग बैश लीग से करीब तीन करोड़, पाकिस्तान लीग से भारतीय मुद्रा में करीब 36 लाख और दक्षिण अफ्रीका लीग से उन्हें करीब एक करोड़ 44 लाख रुपये मिलते हैं. कुल मिलाकर लेग स्पिन के दम पर दुनिया भर के बल्लेबाजों को पानी पिलाने वाले राशिद खान को सिर्फ लीग भर से ही करीब इक्कीस करोड़ रुपये सलाना की कमायी करते हैं. इसमें उन्हें अफगानिस्तान बोर्ड से मिलने वाले करीब 73 लाख रुपये शामिल नहीं हैं पढ़ें देश-विदेश की ख़बरें अब हिन्दी में ( ) | कर्नाटक चुनाव 2023 के लाइव अपडेट के लिए हमें फॉलो करें. लाइव खबर देखें: फॉलो करे:","pubDate":"2023-05-06 16:09:03","image_url":"https://c.ndtvimg.com/2023-04/i50ouni8_rashid-khan-bcci-ipl_625x300_25_April_23.jpg","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"DC vs RCB: कोहली ने बनाया \"विराट रिकॉर्ड\", बचपन के दोस्त से चल रही है टक्कर","link":"https://sports.ndtv.com/hindi/cricket/dc-vs-rcb-kohli-makes-virat-record-childhood-friend-following-him-very-closely-4011769#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"Delhi Capitals vs Royal Challengers Bangalore: कोहली ने शनिवार को घरेलू मैदान पर आरसीबी के खिलाफ 55 रन की उम्दा पारी खेली.","content":"Delhi Capitals vs Royal Challengers Bangalore: विराट ने अच्छा अर्द्धशतक बनाया चाहे जारी इंडियन प्रीमियर लीग (IPL 2023) हो, या फिर यह टीम इंडिया का मंच हो, विराट कोहली (Virat Kohli) ऐसे मुकाम पर खड़े हैं, जहां वह कुछ भी करते हैं, तो कोई न कोई रिकॉर्ड उनकी झोली में जा गिरता है. और शनिवार को घरेलू अरुण जेटली स्टेडियम में दिल्ली कैपिटल्स के खिलाफ भी उनके साथ कुछ ऐसा ही हुआ. विराट ने जैसे ही पारी में 12वां लिया, तो पहले उन्होंने टूर्नामेंट में सुपर से ऊपर कारनामा करते हुए अपने सात हजार रन पूरे किए. और यह कारनामा करने वाले वह इतिहास के पहले बल्लेबाज बन गए हैं. विराट ने स्पिनर अक्षर पटेल के पारी के फेंके दूसरे ही ओवर में सिंगल लेकर यह बड़ी उपलब्धि हासिल की. मैच से पहले उन्हें यह आंकड़ा छूने के लिए सिर्फ 12 रन की दरकार थी. इस बड़ी उपलब्धि के लिए अब उन्हें बचपन के दोस्त शिखर धवन से मुकाबला करना पड़ रहा है. पंजाब की कप्तानी कर रहे धवन के भी फिलहाल 213 मैचों में 6536 रन हैं और वह विराट के बाद दूसरे नंबर पर हैं. वॉर्नर (6189) तीसरे और रोहित शर्मा (6063) चौथे नंबर पर हैं. वहीं, धवन के साथ उनका मुकाबला रनों को लेकर ही नहीं चल रहा. दोनों के बीच जंग अर्द्धशतकों को लेकर भी छिड़ी हुई है. विराट ने शनिवार को सात हजार रन पूर करने के साथ ही लीग में अपना पचासवां अर्द्धशतक भी जड़ा. धवन 49 अर्द्धशतक जड़कर बराबर कोहली का कंधे से कंधा मिलाकर मुकाबला कर रहे हैं. वैसे इस मामले में डेविड वॉर्नर (59) शीर्ष पर हैं. जाहिर है कि विराट ही नहीं, बल्कि धवन के सामने अभी भी वॉर्नर के अर्द्धशतकों को पीछे छोड़ने की प्रेरणा है. देखते हैं कि करियर के समापन पर कौन सा दिग्गज अर्द्धशतकों के मामले में क्या पैमाना सेट करता है. पढ़ें देश-विदेश की ख़बरें अब हिन्दी में ( ) | कर्नाटक चुनाव 2023 के लाइव अपडेट के लिए हमें फॉलो करें. लाइव खबर देखें: फॉलो करे:","pubDate":"2023-05-06 15:33:47","image_url":"https://c.ndtvimg.com/2023-05/lmt75o08_virat-kohli-bcci_625x300_06_May_23.jpg?im=FaceCrop,algorithm=dnn,width=530,height=400=80","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Hrvat zabio i vratio slavni talijanski klub u elitni razred","link":"https://www.tportal.hr/sport/clanak/hrvat-zabio-i-vratio-slavni-talijanski-klub-u-elitni-razred-20230506","keywords":["Sport"],"creator":null,"video_url":null,"description":"Genoa će se sljedeće sezone, nakon samo jedne godine porovedene u Serie B, vratiti u elitu Serie A zahvaljujući subotnjoj pobjedi protiv Ascolija (2:1) kojom je osigurala jedno od prva dva mjesta","content":"Prvi pogodak za Genou dao je bivši hrvatski reprezentativac Milan Badelj, dok je vratar Adrian Šemper ostao na klupi. Dva kola prije kraja regularnog dijela 'Grifoni', što je nadimak ligurskog kluba, imaju osam bodova više od trećeg Barija, koji je remizirao kod u Modene (1:1). Genoa se tako priključila Frosinoneu, koji je u ponedjeljak matematički potvrdio svoj povratak u najjaču ligu talijanskoga nogometa. Treća ulaznica za elitu bit će podijeljena na kraju završne faze, koja će se odnositi na šest momčadi koje će završiti od trećeg do osmog mjesta regularnog dijela sezone. Genoa, koju od prosinca trenira bivši talijanski reprezentativac Alberto Gilardino (40), vraća se u Serie A, dok će drugi klub iz Genove, Sampdoria, trenutno zadnja u prvoj ligi, vjerojatno ispasti. Genoa Cricket and Football Club povijesni je klub talijanskog nogometa, utemeljen 1893. Prvo talijansko prvenstvo osvojio je 1898. i ima ukupno devet naslova, od kojih posljednji datira prije gotovo jednog stoljeća (1924) . Klub je 1990-ih pao u Serie B. Kupio ga je i restrukturirao talijanski poduzetnik Enrico Preziosi 2003., vratio se u prvu ligu 2007. gdje je ostao do ispadanja u svibnju 2022. Preziosi je prodao klub u rujnu 2021. godine američkom fondu 777 Partners.","pubDate":"2023-05-06 15:19:00","image_url":"https://www.tportal.hr/media/thumbnail/500x300/1992570.jpeg?cropId=0","source_id":"tportal","category":["sports"],"country":["Croatia"],"language":"croatian"},{"title":"Genoa i Badelj se vraćaju u Seriju A","link":"https://sport.hrt.hr/medunarodni-nogomet/genoa-i-badelj-se-vracaju-u-seriju-a-10760099","keywords":null,"creator":null,"video_url":null,"description":"Genoa će se sljedeće sezone, nakon samo jedne godine provedene u Serie B, vratiti u elitu Serie A zahvaljujući subotnjoj pobjedi protiv Ascolija (2-1) kojom je osigurala jedno od prva dva mjesta.","content":"Genoa će se sljedeće sezone, nakon samo jedne godine provedene u Serie B, vratiti u elitu Serie A zahvaljujući subotnjoj pobjedi protiv Ascolija (2-1) kojom je osigurala jedno od prva dva mjesta. Pobjednički pogodak za Genou postigao je bivši hrvatski reprezentativac Milan Badelj u 63. minuti, dok je vratar Adrian Šemper ostao na klupi. U redovima Ascolija najbolji je bio nekadašnji stoper Hajduka i Rijeke Lorenco Šimić . View this post on Instagram A post shared by Genoa Cfc (@genoacfc) Dva kola prije kraja regularnog dijela \"Grifoni\", što je nadimak ligurskog kluba, imaju osam bodova više od trećeg Barija, koji je remizirao kod u Modene (1-1). Genoa se tako priključila Frosinoneu , koji je u ponedjeljak matematički potvrdio svoj povratak u najjaču ligu talijanskoga nogometa. Treća ulaznica za elitu bit će podijeljena na kraju završne faze, koja će se odnositi na šest momčadi koje će završiti od trećeg do osmog mjesta regularnog dijela sezone. Alberto Gilardino preporodio Genou Genoa, koju od prosinca trenira bivši talijanski reprezentativac Alberto Gilardino (40), vraća se u Serie A, dok će drugi klub iz Genove, Sampdoria, trenutno zadnja u prvoj ligi, vjerojatno ispasti. Genoa Cricket and Football Club povijesni je klub talijanskog nogometa, utemeljen 1893. Prvo talijansko prvenstvo osvojio je 1898. i ima ukupno devet naslova, od kojih posljednji datira prije gotovo jednog stoljeća (1924.). Klub je 1990-ih pao u Serie B. Kupio ga je i restrukturirao talijanski poduzetnik Enrico Preziosi 2003., vratio se u prvu ligu 2007. gdje je ostao do ispadanja u svibnju 2022. Preziosi je prodao klub u rujnu 2021. godine američkom fondu 777 Partners. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1657620534770-0'); }); googletag.cmd.push(function() { googletag.display('div-gpt-ad-1657619086178-0'); }); prije 5 min 'Vidjeli smo umornog čovjeka koji se teško nosio s krunom i ceremonijom' prije 19 min Rijeka u sjajnoj utakmici u 97. minuti do boda protiv Istre prije 45 min Bayern slavio u Bremenu _ipromNS('zone',32) _ipromNS('zone',265) Vezani sadržaj Bayern slavio u Bremenu Salah odlučio susret i postao egipatski rekorder Važna pobjeda Intera kod Rome Sopić i Zekić nakon remija u Velikoj Gorici","pubDate":"2023-05-06 14:54:08","image_url":null,"source_id":"hrt","category":["sports"],"country":["Croatia"],"language":"croatian"},{"title":"Bivši Vatreni zabio, najstariji talijanski klub vraća se u Serie A","link":"https://danas.hr/sport/nogomet/bivsi-vatreni-zabio-najstariji-talijanski-klub-vraca-se-u-serie-a-454f0b6c-ec1d-11ed-ab55-f29814d0c9ee","keywords":["Nogomet","Milan Badelj"],"creator":null,"video_url":null,"description":"Genoa, koju od prosinca trenira bivši talijanski reprezentativac Alberto Gilardino (40), vraća se u Serie A","content":"će se sljedeće sezone, nakon samo jedne godine porovedene u Serie B, vratiti u elitu Serie A zahvaljujući subotnjoj pobjedi protiv Ascolija (2-1) kojom je osigurala jedno od prva dva mjesta. Prvi pogodak za Genou dao je bivši hrvatski reprezentativac , dok je vratar ostao na klupi. Dva kola prije kraja regularnog dijela Grifoni, što je nadimak ligurskog kluba, imaju osam bodova više od trećeg Barija, koji je remizirao kod u Modene (1-1). Genoa se tako priključila Frosinoneu, koji je u ponedjeljak matematički potvrdio svoj povratak u najjaču ligu talijanskoga nogometa. Treća ulaznica za elitu bit će podijeljena na kraju završne faze, koja će se odnositi na šest momčadi koje će završiti od trećeg do osmog mjesta regularnog dijela sezone. Genoa, koju od prosinca trenira bivši talijanski reprezentativac Alberto Gilardino (40), vraća se u Serie A, dok će drugi klub iz Genove, Sampdoria, trenutno zadnja u prvoj ligi, vjerojatno ispasti. Genoa Cricket and Football Club najstariji je klub talijanskog nogometa, utemeljen 1893. Prvo talijansko prvenstvo osvojio je 1898. i ima ukupno devet naslova, od kojih posljednji datira prije gotovo jednog stoljeća (1924). Klub je 1990-ih pao u Serie B. Kupio ga je i restrukturirao talijanski poduzetnik Enrico Preziosi 2003., vratio se u prvu ligu 2007. gdje je ostao do ispadanja u svibnju 2022. Preziosi je prodao klub u rujnu 2021. godine američkom fondu 777 Partners.","pubDate":"2023-05-06 14:50:17","image_url":"https://d19p4plxg0u3gz.cloudfront.net/32e08c76-ec1d-11ed-8a02-e69bd02d5791/original","source_id":"rtl_hr","category":["sports"],"country":["Croatia"],"language":"croatian"},{"title":"Sreesanth praises on Kohli for being an inspirational story after 7000 IPL runs","link":"https://www.indiatoday.in/sports/ipl-2023/story/sreesanth-heaps-praise-on-virat-kohli-for-being-an-inspirational-story-after-7000-ipl-runs-sky-is-not-the-limit-2375819-2023-05-07?utm_source=rss","keywords":null,"creator":null,"video_url":null,"description":"Sreesanth praises on Kohli for being an inspirational story after 7000 IPL runs","content":": Former speedster Sreesanth lauded Virat Kohli after the latter became the first batter to score 7000 runs in the Indian Premier League (IPL). The 34-year-old Kohli got to the feat while playing for the Royal Challengers Bangalore (RCB) in their match against the Delhi Capitals (DC) at the Arun Jaitley Stadium in New Delhi on Saturday, May 6. Kohli was 25 runs short of the milestone before the game and he got there with the utmost ease. Kohli also became the first batter to score in the IPL. “It’s a great inspirational story for the complete cricket fraternity. Hats off to him. This is what you want to see on the cricket field. He touched his guru’s feet and took his blessings before the game. His parents were there, his family was there. His friends were there at the ground watching him, that too from the Virat Kohli stand,” Sreesanth told Star Sports. Kohli scored 55 runs off 46 balls with the help of five fours before Mukesh Kumar accounted for his wicket. Before departing, Kohli had laid a platform for RCB, by putting on a partnership of 82 runs for the opening wicket with Faf du Plessis. “He walks out and scores that 50th fifty at his home-ground. He had all the different shots and he was the first batter to reach 7000 runs in the IPL. I mean, wow, and he is still not out. I keep saying, about this, that ‘Sky is the Limit’, that’s what we have been taught in school,” he stated. “But the way Virat and the new generation are playing fearless cricket, I say Sky is not the limit, because anybody watching this, if he can, then you can. That’s the inspiration he brings. Virat, big salute man,” Sreesanth added. Kohli’s knocks and milestones, however, didn’t pay dividends as RCB lost to DC by seven wickets. The Capitals chased down 182 with as many as 22 balls to spare.","pubDate":"2023-05-06 19:08:59","image_url":null,"source_id":"indiatoday","category":["sports"],"country":["india"],"language":"english"},{"title":"DC vs RCB: दिल्ली कैपिटल्स ने आरसीबी को 7 विकेट से हराया, सॉल्ट का शानदार अर्द्धशतक","link":"https://sports.ndtv.com/hindi/cricket/dc-vs-rcb-live-score-ipl-2023-today-50th-match-delhi-capitals-vs-royal-bangalore-challengers-live-score-updates-4011346#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"DC vs RCB, IPL 2023: दिल्ली के पारी के 17वें ओवर में ही लक्ष्य हासिल करने से साफ हो गया कि आरसीबी चैलेंजिग स्कोर से 30-40 रन पीछे रह गया.","content":"DC vs RCB : दिल्ली के विकेटकीपर फिलिप सॉल्ट ने एक मैच जिताऊ पारी खेली इंडियन प्रीमियर लीग (IPL 2023) में टेबल में ऊपर चढ़ने को बुरी तरह बेताब रॉयल चैलेंजर्स के गणित पर जोरदार प्रहार करते हुए दिल्ली कैपिटल्स ने शनिवार को घरेलू मैदान पर उसे 7 विकेट से हरा दिया. कैपिटल्स पहले से ही प्ले-ऑफ दौर से लगभग बाहर हो चुके हैं. ऐसे में आरसीबी के लिए आगे बढ़ने के लिहाज से यह मैच बहुत ही ज्यादा महत्वपूर्ण था, लेकिन इस अहम मौके पर हर विभाग में उसने खराब प्रदर्शन किया और 7 विकेट से हार झेलने को मजबूर होना पड़ा. जीत के लिए 182 रनों का पीछा करते हुए दिल्ली के ओपनर खास तौर पर विकेटकीपर फिलिप सॉल्ट (85) और कप्तान डेविड वॉर्नर ने करीब पांच ओवरों में 60 देकर बहुत ही शानदार शुरुआत दी. इस दौरान आरसीबी के बॉलरों ने बहुत घटिया लाइन और लेंथ का परिचय दिया. वॉर्नर आउट हो गए, लेकिन सॉल्ट लगातार प्रहार करते रहे. उन्हें मिशेल मार्श (26) और रॉली रोसेव (नाबाद 35) से अच्छा सहारा मिला. इससे दिल्ली ने 16.4 ओवरों में ही 3 विकेट खोकर जीत का लक्ष्य हासिल कर लिया. आरसीबी के दिग्गज गेंदबाजों का रवैया एकदम समझ से परे रहा. शुरुआती ओवरों में एकदम क्लब स्तरीय गेंदबाजी हुई. और इसका दिल्ली कैपिटल्स के बल्लेबाजोंं ने पूरा फायदा उठाते हुए शुरुआत में ही जीत का अच्छा आधार रख दिया. वहीं, पहली पाली में आरसीबी ने अरुण जेटली स्टेडियम में घरेलू टीम दिल्ली कैपिटल्स के सामने जीत के लिए 182 रनों का लक्ष्य रखा. पहले बैटिंग चुनने के बाद विराट कोहली (55) और फैफ डु प्लेसी (45) ने मिलकर आरसीबी को करीब दस ओवर में ही 82 रन जोड़कर बेहतरीन शुरुआत दी. जब लग रहा था कि कोहली घरेलू मैदान पर एक बड़ी पारी खेलने जा रहे हैं, तो वह आउट हो गए, तो फैफ भी पारी को लंबा नहीं खींच सके. मैक्सवेल (0) पहली ही गेंद पर चलते बने. ऐसे में राजस्थान के लिए रणजी ट्रॉफी खेलने वाले युवा लेफ्टी बल्लेबाज महिपाल लोमनोर (54) ने छोर पर तेज बल्लेबाजी की. और यह इस युवा का ही अच्छा प्रयास रहा कि राजस्थान ने कोटे के ओवरों में 4 विकेट खोकर 181 का स्कोर खड़ा किया, लेकिन यह दिल्ली के लिए खासा छोटा साबित हुआ. दिल्ली के पारी के 17वें ओवर में ही लक्ष्य हासिल करने से साफ हो गया कि आरसीबी चैलेंजिग स्कोर से 30-40 रन पीछे रह गया. दिल्ली के लिए मिचेल मार्श ने दो और खलील और मुकेश ने एक-एक विकेट लिया. मैच में खेलीं दोनों टीमों की फाइनल XI इस प्रकार रहीं: 1. डेविड वॉर्नर (कप्तान) 2. फिलिप सॉल्ट (विकेटकीपर) 3. मिशेल मार्श 4. मनीष पांडेय 5. राइले रोसोव 6. अक्षर पटेल 7. मुकेश कुमार 8. अमन हाकिम खान 9. कुलदीप यादव 10. खलील अहमद 11. इशांत शर्मा 1. फैफ डु प्लेसी (कप्तान) 2. विराट कोहली 3. अनुज रावत 4. ग्लेन मैक्सवेल 5. महिपाल लोमोर 6. दिनेश कार्तिक 7. केदार जाधव 8. वैनिंदु हसारंगा 9. कर्ण शर्मा 10. मोहम्मद सिराज 11. जोश हेजलवुड पढ़ें देश-विदेश की ख़बरें अब हिन्दी में ( ) | कर्नाटक चुनाव 2023 के लाइव अपडेट के लिए हमें फॉलो करें. लाइव खबर देखें: फॉलो करे:","pubDate":"2023-05-06 17:43:24","image_url":"https://c.ndtvimg.com/2023-05/itjkooko_phil-salt-bcci_625x300_06_May_23.jpg?im=FaceCrop,algorithm=dnn,width=530,height=400=80","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"\"मुझ पर लगा जुर्माना उचित नहीं', रिपोर्ट के अनुसार विराट ने झड़प की जानकारी बीसीसीआई को दी","link":"https://sports.ndtv.com/hindi/cricket/fine-on-me-is-unfair-as-per-reprots-virat-writes-spat-incident-detail-to-bcci-4011951#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"कोहली और गंभीर के बीच हुई झड़प पर अब विदेशी खिलाड़ियों की लगातार प्रतिक्रिया आ रही है. इसी बीच कोहली ने बोर्ड के कुछ अधिकारियों को लिखित में घटना की जानकारी दी है","content":"करीब हफ्ते भर पहले इंडियन प्रीमियर लीग (IPL 2023) में लखनऊ और आरसीबी (LSG vs RCB) के बीच खेले गए मुकाबले में विराट (virat Kohli) और गौतम गंभीर (Gautam Gambhir) के बीच झड़प पर चर्चा और प्रतिक्रिया अभी भी बनी हुई है. इस घटना के बाद इसमें शामिल तीनों ही खिलाड़ियों पर उनकी मैच फीस का जुर्माना लगाया गया था, लेकिन दुनिया भर के दिग्गज विवाद के लिए गौतम और विराट पर ही ज्यादा उंगली उठा रहे हैं. अब इस मामले से जुड़ी नयी खबर आ रही है. एक अग्रणी अखबार के अनुसार विराट कोहली ने बीसीसीआई को लेटर लिखकर घटना के बारे में विस्तार से जानकारी दी है. अखबार की रिपोर्ट के अनुसार बोर्ड के कुछ अधिकारियों को लिखे पत्र में विराट ने सौ फीसद मैच फीस काटे जाने को लेकर निराशा जाहिर की है. जानकारी के मुताबिक कोहली ने लिखा कि उन्होंने नावेन-उल-हक और गौतम गंभीर को कुछ भी नहीं कहा. घटना के बाद मैच रैफरी ने जहां गंभीर और विराट पर मैच फीस का सौ फीसद जुर्माना लगाया था, तो वहीं नावेद की पचास फीसदी फीस पर कैंची चली थी. बहरहाल, विराट नहीं मानते उनका बर्ताव इस कड़े दंड के दायरे में आता था. उनके जुर्माने की रकम 1.25 करोड़ रुपये तक जा सकती है. हालांकि, कोहली को यह नुकसान नहीं वहन करना होगा क्योंकि मैदान पर किए अपराध के लिए आरसीबी की खिलाड़ियों की मैच फीस काटने की नीति नहीं है. वैसे कोहली ने भले ही बीसीसीआई को लिखकर अपने बर्ताव को सही ठहराया हो, लेकिन घटना के इर्द-गिर्द मौजूद रहे खिलाड़ियों और अधिकारियों के अनुसार विराट का बर्ताव नावेन और मायर्स के प्रति ठीक नहीं था. यहां तक कि दूसरे छोर पर नावेन के साथ बैटिंग कर रहे अमित मिश्रा ने भी कोहली के बर्ताव की शिकायत अंपायरों से की थी. रिपोर्ट के अनुसार आरसीबी के पेसर मोहम्मद सिराज की बाउंसरों और थ्रो से नावेन थोड़ा क्रुद्ध हो गए थे. कोहली ने बीसीसीआई अधिकारी को लिखे संदेश में कहा कि उन्होंने सिराज को नावेन को हिट करने के लिए नहीं कहा. उन्होंने सिराज से केवल बाउंसर मारने को कहा था. पढ़ें देश-विदेश की ख़बरें अब हिन्दी में ( ) | कर्नाटक चुनाव 2023 के लाइव अपडेट के लिए हमें फॉलो करें. लाइव खबर देखें: फॉलो करे:","pubDate":"2023-05-06 16:57:26","image_url":"https://c.ndtvimg.com/2023-05/kf8j2eg8_virat-kohli-afp_625x300_04_May_23.jpg","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"IND vs PAK:पीसीबी ने वर्ल्ड कप के लिए भारत आने पर रखी खास डिमांड, बीसीसीआई से लिखित में मांगी गारंटी","link":"https://navbharattimes.indiatimes.com/sports/cricket/cricket-news/ind-vs-pak-pcb-chairman-najam-sethi-want-written-guarantee-bcci-champions-trophy-odi-worldcup-2023/articleshow/100040801.cms","keywords":null,"creator":null,"video_url":null,"description":"बीसीसीआई और पीसीबी के बीच पिछले कुछ समय से काफी ज्या सुर्खियों में बने हुए हैं। दरअसल, अब पाकिस्तान चाहता है कि बीसीसीआई लिखित गारंटी दे कि टीम इंडिया 2025 की चैंपियंस ट्रॉफी के लिए पाकिस्तान का दौरा करेगी।","content":"पाकिस्तान क्रिकेट बोर्ड (पीसीबी) के अध्यक्ष नजम सेठी इस साल एकदिवसीय विश्व कप में अपनी टीम को भारत भेजने से पहले भारतीय क्रिकेट बोर्ड (बीसीसीआई) के सचिव जय शाह से इस बात की लिखित गारंटी चाहते है कि उनके देश में 2025 में होने वाले आईसीसी (अंतरराष्ट्रीय क्रिकेट परिषद) चैम्पियंस ट्रॉफी में भारत की भागीदारी होगी। इस साल पांच अक्टूबर से होने वाले विश्व कप के लिए बीसीसीआई ने पाकिस्तान के मैचों के लिए अहमदाबाद (भारत के खिलाफ मैच), चेन्नई, बेंगलुरु और कोलकाता को स्थल के रूप में चुना है। जय शाह की अध्यक्षता में एसीसी (एशियाई क्रिकेट परिषद) ने आगामी एशिया कप 2023 के लिए प्रस्तावित ‘हाइब्रिड मॉडल’ की पुष्टि नहीं की। ‘हाइब्रिड मॉडल’ में भारत अपने मैच यूएई में खेलेगा जबकि अन्य मुकाबलों की मेजबानी पाकिस्तान करेगा। एक विश्वस्त सूत्र के अनुसार, सेठी आठ मई को दुबई के लिए रवाना होने वाले हैं, जहां वह एसीसी और आईसीसी अधिकारियों के साथ मीटिंग करेंगे। पीसीबी के सूत्र ने कहा कि अपनी दुबई यात्रा के दौरान सेठी के पाकिस्तान के ‘सैद्धांतिक रुख’ के लिए समर्थन जुटाने के लिए लॉबिंग शुरू करने की भी उम्मीद है। उनके मुताबिक 2025 चैंपियंस ट्रॉफी में भारत की भागीदारी को लेकर जब तक बीसीसीआई और आईसीसी लिखित गारंटी नहीं देते तब तक पाकिस्तान भारत में अपने विश्व कप मैच नहीं खेलेगा।’’ सूत्र ने कहा, ‘‘सेठी ने हाल ही में कुछ सरकारी अधिकारियों से मुलाकात की और उनसे सलाह भी ली कि क्या पाकिस्तान को उसके रुख के खिलाफ एशिया कप में खेलना चाहिए। पाकिस्तान चाहता है कि एशिया कप लाहौर और दुबई (हाईब्रिड मॉडल) में हो।’ उन्होंने कहा कि सितंबर में एशिया कप की मेजबानी के बारे में एसीसी सदस्यों को एक मजबूत और स्पष्ट रुख बताने के लिए सेठी को सरकार से मंजूरी मिल गई है। अब यह देखना दिलचस्प होगा कि भारत, पाकिस्तान जाता है या नहीं। बहरहाल, टीम इंडिया का पड़ोसी देश का दौरा करना लगभग नामुमकिन लग रहा है।","pubDate":"2023-05-06 16:44:21","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Corporation Win Backyard 2023 Cricket Opener","link":"https://bernews.com/2023/05/corporation-win-backyard-cricket-2023-opener/","keywords":["All","Sports","#BermudaCricket"],"creator":["temp"],"video_url":null,"description":"The Bermuda Police Backyard Cricket League kicked off the second season with the defending champions Bermuda Hospital Board falling by 7 wickets to the Corporation of Hamilton. After winning the toss the Bermuda Hospital Board scored 109/3 in their allotted 15 overs, Rushaine Murphy was the top scorer with 43, while Lateef Trott was the […]","content":"The Bermuda Police Backyard Cricket League kicked off the second season with the defending champions Bermuda Hospital Board falling by 7 wickets to the Corporation of Hamilton. After winning the toss the Bermuda Hospital Board scored 109/3 in their allotted 15 overs, Rushaine Murphy was the top scorer with 43, while Lateef Trott was the pick of the Corporation of Hamilton bowlers with figures of 3-0-8-1. In reply Trott would lead the Corporation of Hamilton to victory scoring 40 as they scored 113/3 in 18.5 overs, Murphy was the pick of the Bermuda Hospital Board bowlers with figures of 3-0-20-2. : ,","pubDate":"2023-05-06 16:26:50","image_url":null,"source_id":"bernews","category":["sports"],"country":["Bermuda"],"language":"english"},{"title":"पठान राशिद की धुन पर झूमा गुजरात, साल भर में दुनिया की लीगों से इतनी मोटी कमायी करते हैं लेग स्पिनर","link":"https://sports.ndtv.com/hindi/cricket/gujrat-makes-merry-on-tune-of-pathan-rashid-khan-thats-how-big-amount-leg-sppiner-earns-in-a-year-from-varius-leages-4011616#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"RR vs GT, IPL 2023: शुक्रवार को खेले गए मुकाबले में राशिद खान (Rashid Khan) ने तीन विकेट लिए. और वह प्लेयर ऑफ द मैच रहे.","content":"राशिद खान ने शुक्रवार को गुजरात की जीत में स्पिन का जादू दिखाया अफगानी लेग स्पिनर राशिद खान (Rashid Khan) शुक्रवार को आईपीएल में काफी लंबे समय बाद बरसे, लेकिन जब बरसे, तो उनकी धुन पर गुजरात टाइटंस ने नौ विकेट से जीत दर्ज करते हुए झूम उठा. पिछले कुछ मैच राशिद के लिए सूखे-सूखे जा रहे थे और फैंस उन्हें विकेट चटकाते देखने के लिए तरस गए थे. लेकिन राजस्थान के खिलाफ पठान की लेग स्पिन का गजब का जादू चला. राशिद ने चार ओवरों में 14 रन देकर तीन विकेट चटकाए. और वह प्लेयर ऑफ द मैच चुने गए. और इतना ही नहीं राशिद खान (Rashid Khan) इस प्रदर्शन के बाद से पर्पल कैप की रेस में फिलहाल नंबर तीन के गेंदबाज हो चले हैं. घरेलू पिच पर पर पहले बैटिंग चुनने वाली राजस्थान के विकेटों की नियमित अंतराल पर लगी झड़ी में राशिद ने अश्विन, हेटमायर और रियान पराग के विकेट लिए. पराग और हेटमायर दोनों ही राशिद की गेंदों को हाथ देखकर नहीं पकड़ सके कि गेंद अंदर आएगी या बाहर जाएगी. फिलहाल शुक्रवार तक राशिद खान लीग में सबसे ज्यादा विकेट चटकाने वाले बॉलरों में संयुक्त रूप से शमी (18 विकेट) के साथ दूसरे नंबर पर चल रहे हैं. यह प्रदर्शन दिखाता है कि राशिद गुजरात के लिए कितने ज्यादा अहम खिलाड़ी हैं. और वह गुजरात के लिए ही नहीं, बल्कि दुनिया की उन तमाम टीमों के लिए हैं, जो अलग-अलग लीग में खेलती हैं. अफगानिस्तान के अलावा राशिद इन टीमों से साल भर में मोटी रकम कमाते हैं. राशिद को अफगानिस्तान बोर्ड से साल भर में फीस के रूप में भारतीय रकम में तकरीबन 73 लाख रुपये मिलते हैं. इसके अलावा उन्हें गुजरात की टीम से सालाना फीस के रूप में 15 करोड़, बिग बैश लीग से करीब तीन करोड़, पाकिस्तान लीग से भारतीय मुद्रा में करीब 36 लाख और दक्षिण अफ्रीका लीग से उन्हें करीब एक करोड़ 44 लाख रुपये मिलते हैं. कुल मिलाकर लेग स्पिन के दम पर दुनिया भर के बल्लेबाजों को पानी पिलाने वाले राशिद खान को सिर्फ लीग भर से ही करीब इक्कीस करोड़ रुपये सलाना की कमायी करते हैं. इसमें उन्हें अफगानिस्तान बोर्ड से मिलने वाले करीब 73 लाख रुपये शामिल नहीं हैं पढ़ें देश-विदेश की ख़बरें अब हिन्दी में ( ) | कर्नाटक चुनाव 2023 के लाइव अपडेट के लिए हमें फॉलो करें. लाइव खबर देखें: फॉलो करे:","pubDate":"2023-05-06 16:09:03","image_url":"https://c.ndtvimg.com/2023-04/i50ouni8_rashid-khan-bcci-ipl_625x300_25_April_23.jpg","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"DC vs RCB: कोहली ने बनाया \"विराट रिकॉर्ड\", बचपन के दोस्त से चल रही है टक्कर","link":"https://sports.ndtv.com/hindi/cricket/dc-vs-rcb-kohli-makes-virat-record-childhood-friend-following-him-very-closely-4011769#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"Delhi Capitals vs Royal Challengers Bangalore: कोहली ने शनिवार को घरेलू मैदान पर आरसीबी के खिलाफ 55 रन की उम्दा पारी खेली.","content":"Delhi Capitals vs Royal Challengers Bangalore: विराट ने अच्छा अर्द्धशतक बनाया चाहे जारी इंडियन प्रीमियर लीग (IPL 2023) हो, या फिर यह टीम इंडिया का मंच हो, विराट कोहली (Virat Kohli) ऐसे मुकाम पर खड़े हैं, जहां वह कुछ भी करते हैं, तो कोई न कोई रिकॉर्ड उनकी झोली में जा गिरता है. और शनिवार को घरेलू अरुण जेटली स्टेडियम में दिल्ली कैपिटल्स के खिलाफ भी उनके साथ कुछ ऐसा ही हुआ. विराट ने जैसे ही पारी में 12वां लिया, तो पहले उन्होंने टूर्नामेंट में सुपर से ऊपर कारनामा करते हुए अपने सात हजार रन पूरे किए. और यह कारनामा करने वाले वह इतिहास के पहले बल्लेबाज बन गए हैं. विराट ने स्पिनर अक्षर पटेल के पारी के फेंके दूसरे ही ओवर में सिंगल लेकर यह बड़ी उपलब्धि हासिल की. मैच से पहले उन्हें यह आंकड़ा छूने के लिए सिर्फ 12 रन की दरकार थी. इस बड़ी उपलब्धि के लिए अब उन्हें बचपन के दोस्त शिखर धवन से मुकाबला करना पड़ रहा है. पंजाब की कप्तानी कर रहे धवन के भी फिलहाल 213 मैचों में 6536 रन हैं और वह विराट के बाद दूसरे नंबर पर हैं. वॉर्नर (6189) तीसरे और रोहित शर्मा (6063) चौथे नंबर पर हैं. वहीं, धवन के साथ उनका मुकाबला रनों को लेकर ही नहीं चल रहा. दोनों के बीच जंग अर्द्धशतकों को लेकर भी छिड़ी हुई है. विराट ने शनिवार को सात हजार रन पूर करने के साथ ही लीग में अपना पचासवां अर्द्धशतक भी जड़ा. धवन 49 अर्द्धशतक जड़कर बराबर कोहली का कंधे से कंधा मिलाकर मुकाबला कर रहे हैं. वैसे इस मामले में डेविड वॉर्नर (59) शीर्ष पर हैं. जाहिर है कि विराट ही नहीं, बल्कि धवन के सामने अभी भी वॉर्नर के अर्द्धशतकों को पीछे छोड़ने की प्रेरणा है. देखते हैं कि करियर के समापन पर कौन सा दिग्गज अर्द्धशतकों के मामले में क्या पैमाना सेट करता है. पढ़ें देश-विदेश की ख़बरें अब हिन्दी में ( ) | कर्नाटक चुनाव 2023 के लाइव अपडेट के लिए हमें फॉलो करें. लाइव खबर देखें: फॉलो करे:","pubDate":"2023-05-06 15:33:47","image_url":"https://c.ndtvimg.com/2023-05/lmt75o08_virat-kohli-bcci_625x300_06_May_23.jpg?im=FaceCrop,algorithm=dnn,width=530,height=400=80","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Hrvat zabio i vratio slavni talijanski klub u elitni razred","link":"https://www.tportal.hr/sport/clanak/hrvat-zabio-i-vratio-slavni-talijanski-klub-u-elitni-razred-20230506","keywords":["Sport"],"creator":null,"video_url":null,"description":"Genoa će se sljedeće sezone, nakon samo jedne godine porovedene u Serie B, vratiti u elitu Serie A zahvaljujući subotnjoj pobjedi protiv Ascolija (2:1) kojom je osigurala jedno od prva dva mjesta","content":"Prvi pogodak za Genou dao je bivši hrvatski reprezentativac Milan Badelj, dok je vratar Adrian Šemper ostao na klupi. Dva kola prije kraja regularnog dijela 'Grifoni', što je nadimak ligurskog kluba, imaju osam bodova više od trećeg Barija, koji je remizirao kod u Modene (1:1). Genoa se tako priključila Frosinoneu, koji je u ponedjeljak matematički potvrdio svoj povratak u najjaču ligu talijanskoga nogometa. Treća ulaznica za elitu bit će podijeljena na kraju završne faze, koja će se odnositi na šest momčadi koje će završiti od trećeg do osmog mjesta regularnog dijela sezone. Genoa, koju od prosinca trenira bivši talijanski reprezentativac Alberto Gilardino (40), vraća se u Serie A, dok će drugi klub iz Genove, Sampdoria, trenutno zadnja u prvoj ligi, vjerojatno ispasti. Genoa Cricket and Football Club povijesni je klub talijanskog nogometa, utemeljen 1893. Prvo talijansko prvenstvo osvojio je 1898. i ima ukupno devet naslova, od kojih posljednji datira prije gotovo jednog stoljeća (1924) . Klub je 1990-ih pao u Serie B. Kupio ga je i restrukturirao talijanski poduzetnik Enrico Preziosi 2003., vratio se u prvu ligu 2007. gdje je ostao do ispadanja u svibnju 2022. Preziosi je prodao klub u rujnu 2021. godine američkom fondu 777 Partners.","pubDate":"2023-05-06 15:19:00","image_url":"https://www.tportal.hr/media/thumbnail/500x300/1992570.jpeg?cropId=0","source_id":"tportal","category":["sports"],"country":["Croatia"],"language":"croatian"},{"title":"Genoa i Badelj se vraćaju u Seriju A","link":"https://sport.hrt.hr/medunarodni-nogomet/genoa-i-badelj-se-vracaju-u-seriju-a-10760099","keywords":null,"creator":null,"video_url":null,"description":"Genoa će se sljedeće sezone, nakon samo jedne godine provedene u Serie B, vratiti u elitu Serie A zahvaljujući subotnjoj pobjedi protiv Ascolija (2-1) kojom je osigurala jedno od prva dva mjesta.","content":"Genoa će se sljedeće sezone, nakon samo jedne godine provedene u Serie B, vratiti u elitu Serie A zahvaljujući subotnjoj pobjedi protiv Ascolija (2-1) kojom je osigurala jedno od prva dva mjesta. Pobjednički pogodak za Genou postigao je bivši hrvatski reprezentativac Milan Badelj u 63. minuti, dok je vratar Adrian Šemper ostao na klupi. U redovima Ascolija najbolji je bio nekadašnji stoper Hajduka i Rijeke Lorenco Šimić . View this post on Instagram A post shared by Genoa Cfc (@genoacfc) Dva kola prije kraja regularnog dijela \"Grifoni\", što je nadimak ligurskog kluba, imaju osam bodova više od trećeg Barija, koji je remizirao kod u Modene (1-1). Genoa se tako priključila Frosinoneu , koji je u ponedjeljak matematički potvrdio svoj povratak u najjaču ligu talijanskoga nogometa. Treća ulaznica za elitu bit će podijeljena na kraju završne faze, koja će se odnositi na šest momčadi koje će završiti od trećeg do osmog mjesta regularnog dijela sezone. Alberto Gilardino preporodio Genou Genoa, koju od prosinca trenira bivši talijanski reprezentativac Alberto Gilardino (40), vraća se u Serie A, dok će drugi klub iz Genove, Sampdoria, trenutno zadnja u prvoj ligi, vjerojatno ispasti. Genoa Cricket and Football Club povijesni je klub talijanskog nogometa, utemeljen 1893. Prvo talijansko prvenstvo osvojio je 1898. i ima ukupno devet naslova, od kojih posljednji datira prije gotovo jednog stoljeća (1924.). Klub je 1990-ih pao u Serie B. Kupio ga je i restrukturirao talijanski poduzetnik Enrico Preziosi 2003., vratio se u prvu ligu 2007. gdje je ostao do ispadanja u svibnju 2022. Preziosi je prodao klub u rujnu 2021. godine američkom fondu 777 Partners. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1657620534770-0'); }); googletag.cmd.push(function() { googletag.display('div-gpt-ad-1657619086178-0'); }); prije 5 min 'Vidjeli smo umornog čovjeka koji se teško nosio s krunom i ceremonijom' prije 19 min Rijeka u sjajnoj utakmici u 97. minuti do boda protiv Istre prije 45 min Bayern slavio u Bremenu _ipromNS('zone',32) _ipromNS('zone',265) Vezani sadržaj Bayern slavio u Bremenu Salah odlučio susret i postao egipatski rekorder Važna pobjeda Intera kod Rome Sopić i Zekić nakon remija u Velikoj Gorici","pubDate":"2023-05-06 14:54:08","image_url":null,"source_id":"hrt","category":["sports"],"country":["Croatia"],"language":"croatian"},{"title":"Bivši Vatreni zabio, najstariji talijanski klub vraća se u Serie A","link":"https://danas.hr/sport/nogomet/bivsi-vatreni-zabio-najstariji-talijanski-klub-vraca-se-u-serie-a-454f0b6c-ec1d-11ed-ab55-f29814d0c9ee","keywords":["Nogomet","Milan Badelj"],"creator":null,"video_url":null,"description":"Genoa, koju od prosinca trenira bivši talijanski reprezentativac Alberto Gilardino (40), vraća se u Serie A","content":"će se sljedeće sezone, nakon samo jedne godine porovedene u Serie B, vratiti u elitu Serie A zahvaljujući subotnjoj pobjedi protiv Ascolija (2-1) kojom je osigurala jedno od prva dva mjesta. Prvi pogodak za Genou dao je bivši hrvatski reprezentativac , dok je vratar ostao na klupi. Dva kola prije kraja regularnog dijela Grifoni, što je nadimak ligurskog kluba, imaju osam bodova više od trećeg Barija, koji je remizirao kod u Modene (1-1). Genoa se tako priključila Frosinoneu, koji je u ponedjeljak matematički potvrdio svoj povratak u najjaču ligu talijanskoga nogometa. Treća ulaznica za elitu bit će podijeljena na kraju završne faze, koja će se odnositi na šest momčadi koje će završiti od trećeg do osmog mjesta regularnog dijela sezone. Genoa, koju od prosinca trenira bivši talijanski reprezentativac Alberto Gilardino (40), vraća se u Serie A, dok će drugi klub iz Genove, Sampdoria, trenutno zadnja u prvoj ligi, vjerojatno ispasti. Genoa Cricket and Football Club najstariji je klub talijanskog nogometa, utemeljen 1893. Prvo talijansko prvenstvo osvojio je 1898. i ima ukupno devet naslova, od kojih posljednji datira prije gotovo jednog stoljeća (1924). Klub je 1990-ih pao u Serie B. Kupio ga je i restrukturirao talijanski poduzetnik Enrico Preziosi 2003., vratio se u prvu ligu 2007. gdje je ostao do ispadanja u svibnju 2022. Preziosi je prodao klub u rujnu 2021. godine američkom fondu 777 Partners.","pubDate":"2023-05-06 14:50:17","image_url":"https://d19p4plxg0u3gz.cloudfront.net/32e08c76-ec1d-11ed-8a02-e69bd02d5791/original","source_id":"rtl_hr","category":["sports"],"country":["Croatia"],"language":"croatian"}]}