{"newsArray":[{"title":"Irani Cup format: What is Irani Cup in Indian domestic cricket?","link":"https://thesportsrush.com/cricket-news-irani-cup-format-what-is-irani-cup-in-indian-domestic-cricket/","keywords":["Cricket","Irani Cup","Irani Cup 2023"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Madhya Pradesh, who had clinched their first ever Ranji Trophy title during the 2021-22 season by defeating the 41-time champions Mumbai in the final, will face the ever-strong Rest of India (ROI) side in the Irani Cup 2023 from today onwards, at the Roop Singh Stadium in Gwalior. Karnataka’s experienced batter Mayank Agarwal will lead… The post Irani Cup format: What is Irani Cup in Indian domestic cricket? appeared first on The SportsRush.","content":"Madhya Pradesh, who had clinched their first ever title during the 2021-22 season by defeating the 41-time champions Mumbai in the final, will face the ever-strong Rest of India (ROI) side in the Irani Cup 2023 from today onwards, at the Roop Singh Stadium in Gwalior. Karnataka’s experienced batter Mayank Agarwal will lead the ROI side, which will also include the likes of Abhimanyu Easwaran, Yash Dhull, Yashasvi Jaiswal et al in the batting department. Chetan Sakariya, Navdeep Saini, Sourabh Kumar and the likes will form the bowling attack. In-form Sarfaraz Khan, who had scored a century against Saurashtra during the previous edition of Irani Cup in October last year, has unfortunately been ruled out this time around due to a finger injury. Madhya Pradesh, on the other hand, will be skippered by wicket-keeper batter Himanshu Mantri in the absence of their regular skipper Aditya Shrivastava. Some big names in the side include Rajat Patidar, Venkatesh Iyer, Avesh Khan, Yash Dubey etc. The battle for the Irani Cup takes place immediately post every Ranji Trophy season, in the international Test match format over a maximum of five days. In case the Test match ends in a Draw, the team with a first innings lead is declared the winner. Organized by the BCCI, whose selection committee also picks the ROI squad, the competition takes place between the incumbent Ranji Trophy winners and the Rest of the India Cricket Team. The 2022-23 domestic season however, will see two Irani Cup matches take place within a span of five months. The 2019-20 season champions Saurashtra played for the title in October 2022, as the match was forced to be postponed for two years due to COVID-19. Thus, while it was decided that Saurashtra would rightfully compete for the Cup earlier to the 2021-22 season winners MP, the latter would play for the title at the end of the season from today onwards. Zal Irani, who served as BCCI’s treasurer for two terms – 1928-29 to 1945-46 and 1948-49 to 1961-62, and later as its president in 1966 – was honored by the board by organizing a match for a coveted trophy presented in his name. It commenced during the 1959-60 edition with the Irani Trophy match taking place at the end of the season. After five years however, it was shifted to the beginning of next season.","pubDate":"2023-02-28 20:50:22","image_url":null,"source_id":"thesportsrush","category":["sports"],"country":["australia","united kingdom","india","united states of america"],"language":"english"},{"title":"Aiden Markram whacks Windies in first Test, but fellow Proteas batters fall like dominoes","link":"https://www.dailymaverick.co.za/article/2023-02-28-aiden-markram-whacks-windies-in-first-test-but-fellow-proteas-batters-fall-like-dominoes/","keywords":null,"creator":["Yanga Sibembe"],"video_url":null,"description":"A first Test century for the Proteas in almost two years, some Formula One-like driving on the cricket pitch, a duck dismissal for new Test captain Temba Bavuma and a typical South African batting collapse. How day one of the Proteas’ first of two matches in the series against the West Indies unfolded. The post Aiden Markram whacks Windies in first Test, but fellow Proteas batters fall like dominoes appeared first on Daily Maverick.","content":"South Africa began their first match of a two-game Test series against the West Indies on home soil ever so effectively and efficiently — cruising to 141 runs before the loss of their first wicket on day one. Then, not long after that first wicket fell — with Dean Elgar’s luck finally running out — a typical South African batting collapse ensued. The Proteas, having dominated the first two sessions of the day, capitulated to end the day on 314 runs for the loss of eight wickets. An impressive and driven 141-run partnership for the opening wicket — which later saw opener Aiden Markram notch up his first Test ton in two years (and the first 100 for a Proteas batter in a year) — propped up South Africa for an imposing total at the end of the first day. Markram and his fellow opener, former Proteas Test captain Elgar, were on song early on. After taking a few overs to settle in at the relatively empty SuperSport Park in Tshwane, the two South African starters began justifying the decision of new Test captain, Temba Bavuma, to bat first after he’d won the toss. The pair, perhaps inspired by watching the impeccable driving of Laura Wolvaardt in the knockout stages of the T20 Women’s World Cup drove the West Indies bowling attack to all parts of SuperSport Park as the Proteas looked comfortable. Elgar was the primary aggressor early on, with eventual centurion Markram happy to take up the position of co-pilot. However, Elgar’s aggression threatened to cost him his wicket early on. The former skipper was dropped at third slip off the bowling of Kyle Mayers when he was on just 10 runs. He went on to punish the Windies for their tardy fielding — reaching his 23rd international half-century in the longest format, as well as marking his first 50-plus score since April 2022. Aiden Markram of the Proteas during day one of the 1st Betway Test match between South Africa and West Indies at SuperSport Park on 28 February 2023 in Centurion, South Africa. (Photo: Lee Warren / Gallo Images) Visit Daily Maverick’s home page for more news, analysis and investigations He only managed to add 21 runs after that milestone, before Jermaine Blackwood (who had dropped Elgar earlier) redeemed himself with a great catch at third man off the bowling of South Africa’s chief tormentor with the ball, Alzarri Joseph. In stepped Tony de Zorzi — who was making his senior debut alongside bowler Gerald Coetzee. After the 25-year-old’s introduction, Markram took over the aggression. Unlike Elgar, he would convert his 50 to a morale-boosting ton. It was a fine response to being dropped from the team at the tail end of 2022. “[After being dropped from the last Test], today felt like starting on a clean slate. Obviously, I was heartsore not to be in Australia, but I was spoken to quite clearly about the reasons to not be on that tour, and I was happy with those reasons,” Markram said to journalists about his impressive innings of 115. “As batters we need runs. So, if you’re not scoring runs in a team that wants to compete and be the best in the world, your position should be under scrutiny. It worked out nicely, in hindsight.” The opener, who was one of just three batters to score a century in a match during the inaugural SA20, vindicated the decision of the Proteas’ selection gurus to recall him. Markram was still riding the buzz of captaining the Sunrisers Eastern Cape to the SA20 title in mid-February, and was as assured as ever after assuming the driver’s seat. He reached his first century in 16 innings off 154 balls. “At any stage when you have a few runs under the belt, you can take a certain amount of confidence from that… So, those happy vibes are carried forward. It helped that I had a bit of time away from the Test stuff to start on a clean slate,” he said. Alzarri Joseph of the West Indies during day one of the 1st Betway Test match between South Africa and West Indies at SuperSport Park on 28 February 2023 in Centurion, South Africa. (Photo: Sydney Seshibedi / Gallo Images) Then came the great collapse, which has become synonymous with South African batting and has seen the side slip from one of the best cricketing nations to also-rans. It was instigated by an unfortunate run-out of overzealous debutant De Zorzi. Having stroked the ball to deep cover to allow some running between wickets, the Western Province batter was keen for a third — with Markram not interested. By the time De Zorzi realised this, he was well out of his crease. Despite a valiant effort to return to safety, he was marginally short — gone for 28 off 69 runs. Thus, his 65-run stand with Markram was snuffed. The unfortunate event triggered a flurry of wickets lost for the hosts of the two-match series. In the same over as De Zorzi departing, Bavuma fell for a duck after just two balls — handing his detractors and online trolls more ammo to aim at him. Four overs later, the Windies caught the big fish in the form of Markram. Joseph delivered more menace, this time with a peach of a yorker that dislodged the stumps of South Africa’s top scorer. This left the Proteas on 236 for the loss of four wickets. They went on to add 78 runs for the loss of four more batters, ending day one on 314 for eight. DM","pubDate":"2023-02-28 20:25:50","image_url":null,"source_id":"dailymaverick","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Pat Cummins siblings: How many brothers and sisters does Pat Cummins have?","link":"https://thesportsrush.com/cricket-news-pat-cummins-siblings-how-many-brothers-and-sisters-does-pat-cummins-have/","keywords":["Cricket","Pat Cummins"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Australian national team skipper Pat Cummins leaving India mid-way during the tour has further dented their chances of drawing level the four-match Test series for the Border-Gavaskar Trophy. However, for a family which shares such a close bond with each of its members, he always knew what and who to prioritize first, as he left… The post Pat Cummins siblings: How many brothers and sisters does Pat Cummins have? appeared first on The SportsRush.","content":"Australian national team skipper Pat Cummins leaving India mid-way during the tour has further dented their chances of drawing level the four-match Test series for the . However, for a family which shares such a close bond with each of its members, he always knew what and who to prioritize first, as he left the Indian shores to attend his currently under palliative care. Pat is not his parents – and Peter Cummins’ only child. He was fortunate enough to have grown up with a couple of sisters and as many brothers, who’ve always encouraged and supported him in his journey to become a professional cricketer. In the year 2015, when Cummins played the lone T20I in Cardiff against England during Australia’s tour of England and Ireland, his mother and the two sisters had arrived in the city to cheer him up. He returned with bowling figures of 4-0-25-2, although his side lost the match by 5 runs. Pat Cummins’ sisters’ names are Laura Cummins and Kara Cummins, while his elder brothers’ names are Tim Cummins and Matt Cummins. The 29-year-old had revealed a few years ago how his sister still gets teary-eyed while recounting an incident from childhood, when she had slammed the door on Pat’s middle finger at the age of three. Such severe was the impact that he had by around a centimeter. In November last year, Cummins had mentioned via his Instagram how playing with his elder brothers after school and during the weekends had helped him become the international fast bowler that he is today. He earlier had revealed how he used to play with a web rubber ball at his backyard, by mowing a ten metre long pitch and a seven metre run-up. Both Tim and Matt Cummins had played for the city of Penrith in New South Wales. Around two-and-a-half years ago, in November 2020, Tim had even scored a century in the Sydney Premier League while playing for the Sydney University.","pubDate":"2023-02-28 19:31:05","image_url":null,"source_id":"thesportsrush","category":["sports"],"country":["australia","united kingdom","india","united states of america"],"language":"english"},{"title":"Border-Gavaskar Trophy, 3rd Test: Virat Kohli set to play 200th international match at home","link":"https://thenewsmill.com/2023/03/border-gavaskar-trophy-3rd-test-virat-kohli-set-to-play-200th-international-match-at-home/","keywords":["Cricket","Sports","ANI"],"creator":["ANI"],"video_url":null,"description":null,"content":"When India takes to the field against Australia during the third Test at Indore, it will be a special occasion for hosts’ star batter Virat Kohli, who will be playing his 200th international match at home. India will lock horns against Australia at Indore from Wednesday onwards. India is 2-0 up in the four-match series which has seen the Indian spin trio of Ravichandran Ashwin, Ravindra Jadeja and Axar Patel being the brightest stars for the hosts. Virat has been a pillar of India’s home domination ever since he hit the international cricket scene in 2008. In 199 matches at home so far, he has scored 10,829 runs in 221 innings at an average of 58.22. He has scored 34 centuries and 51 half-centuries at home, with the best score of 254*. However this time around, the pressure will be on Virat, who has been searching for big runs in the longer format since 2020. His numbers for 2020 (116 runs in three matches at an average of 19.33 with one fifty in six innings), 2021 (536 runs in 11 matches at an average of 28.21 with four fifties in 19 innings) and 2022 (265 in six matches at an average of 26.50 with one fifty in 11 innings) are too underwhelming for someone of his stature. However, Virat looked in complete control during his short innings of 44 and 20 runs in both innings of the second Test in Delhi and Team India would hope that their biggest batting star will end his three-year-long drought of big runs, which will also boost India’s chances to qualify for ICC World Test Championship finals, to be played in London from June 7 onwards. Virat has managed 76 runs in three innings in this series at an average of 25.33. India will also aim to overcome the Australian challenge at Indore to make it 3-0 and secure qualification for the WTC final. Skipper Rohit Sharma also believes in focusing on the present and taking on the Aussie challenge at Indore. “It will be a great achievement for us [to reach the WTC final], but we know that we need to cross that final hurdle, and for that, we need to win the next game as well, so the focus is on this Test, how we can win this game, and not look too far ahead, because after this game we have got one more Test match to be played, and then after that, there are two months of IPL,” Rohit said as quoted by ESPNCricinfo. “There is a lot of time to think about the final, but right now it is very important for us to focus on this one and see how we can turn it around and win this game as well, because in the last game, we were put under pressure for sure, we can expect the same here as well, so we need to be ready for that,” added Rohit. Regarding whether KL Rahul or Shubman Gill will play in the match, Rohit said that things are not decided yet. “As far as Gill and KL both are concerned, they train and practice [for long hours] before any game…As far as our 11 is concerned, we have not finalised on it. I would like to do it at the toss and I prefer to be announced at that point in time,” Rohit Sharma further said. He also pointed out that KL Rahul being removed from vice-captaincy is not a big thing and he was given the post only because the team lacked veterans. “All 17 players in the team has a chance. The team will back those who are talented. Stripping vice-captaincy doesn’t mean anything big. He was made the vice-captain because maybe there was not many experienced players at that time. It is not a big thing,” Rohit said. KL had a disappointing 2022 with the bat and has not started 2023 very brightly either. On the other hand, Shubman Gill is in red-hot form in white-ball cricket, having hit a double ton against New Zealand this year. Overall in 30 matches last year, KL aggregated 822 runs at an average of 25.68, with nine half-centuries. This year, he has scored a paltry 38 runs in three Test innings. Overall, he has totalled just 148 runs across five international matches at an average of 29.60, with one half-century and the best score of 64*. On the other hand, Australia will be aiming that they win the rest of two matches and will be playing for their respect, having lost their chance to reclaim the Border-Gavaskar Trophy. For that they will need their Steve Smith, leading in absence of Pat Cummins, who is in Australia due to family health issues, to fire with the bat. The 33-year-old boasts an exemplary batting record as captain, with 3793 runs at 67.73 with 15 hundreds, three of which came on his last Test trip to India in 2017. Encouraged by his success in the past, Smith is hopeful that the leadership role can help him regain his form with the bat, with him having registered scores of 37, 25*, 0 and 9 in the series thus far. Smith expressed his frustration with his dismissals in Delhi Test while speaking to media. “I have played, what, 95 Test matches (94) and I do not think there has been too many times I have walked off the field and I have gone, ‘what the hell am I doing?'” Smith told reporters on Tuesday. “I was pretty angry. There has not been too many times in my career where I have actually come off and just been bedazzled by what I’ve done. It wasn’t my finest moment. Certainly, something to learn from, I am still learning as well. It was not the way I wanted to play, particularly when I had the field set for all of us – they had the field out,” said the Australia captain. Smith conceded that the visitors faltered as a result of their hasty approach, something he plans to remedy in the remaining two Tests. “We probably just rushed things a little bit and it is something we will talk about …when we have got them on the ropes, we can slow things down. We do not have to play at such a high tempo and risky tempo. Because we had them where we wanted them, we had men out and the ability to get off strike. We just rushed it. We have got to learn to adapt a little bit better,” he added. While Australia has lost pacer Josh Hazlewood and veteran opener David Warner for the rest of the series due to injuries, they will be boosted by the returns of quick Mitchell Starc and all-rounder Cameron Green, who sustained finger injuries during the home series against South Africa and missed the first two Tests against India. India’s Test squad for the third and fourth Test against Australia: Rohit Sharma (Captain), K L Rahul, Shubman Gill, Cheteshwar Pujara, Virat Kohli, KS Bharat (wk), Ishan Kishan (wk), Ravichandran Ashwin, Axar Patel, Kuldeep Yadav, Ravindra Jadeja, Mohd. Shami, Mohd. Siraj, Shreyas Iyer, Suryakumar Yadav, Umesh Yadav and Jaydev Unadkat. (ANI)","pubDate":"2023-02-28 18:31:26","image_url":null,"source_id":"thenewsmill","category":["sports"],"country":["india"],"language":"english"},{"title":"Moeen Ali concerned heavy schedule could deprive England of all-format stars","link":"https://www.independent.co.uk/sport/cricket/moeen-ali-england-harry-brook-odi-south-africa-b2291421.html","keywords":["Cricket","Sport"],"creator":["David Charlesworth"],"video_url":null,"description":"The likes of Harry Brook may have to pick and choose when to play for their country due to competing fixture demands.","content":"Moeen Ali sympathises with all-format youngsters such as Harry Brook who may have to pick and choose when to play for England due to competing fixture demands. The frequent handwringing over England’s congested schedule is not a new development but the issue has been exacerbated by the Covid pandemic and a proliferation of T20 franchise leagues. England’s timetable in the next four years contains one bilateral contest where all formats are set to be played, against South Africa in 2026/27, as the Test and limited-overs formats continue to diverge. Overlapping requirements necessitates separate red and white-ball squads and Wednesday’s first ODI in Bangladesh is happening a little more than 24 hours after the end of a Test series in New Zealand. While Brook is riding high in the Test team and was part of the England side that won the T20 World Cup, Moeen feels the schedule may deprive the 24-year-old of becoming a fully-fledged all-format star. “It’s wrong for the younger players who want to play all forms and to play as many games as they can for England,” Moeen said. “That’s something to be really proud of, I guess, when you finish. “I’ve got more than 100 ODIs and 60-odd Tests and that means I feel like I’ve played a lot for England. But Brooky could get to 28 or 29 and not have played much white-ball cricket or one of the formats. “It’s obviously difficult. Even if there’s a window and you ease up on international cricket to help the players, there will just be more franchise (cricket). Somebody will come up with another league and fill that gap. It’s probably better just staying as it is now.” Priority has been given to Tests and T20s in the last couple of years, meaning the ODI format has been neglected, with only sporadic appearances from those who helped England to 2019 World Cup glory. England are set to defend their crown in India later this year in conditions that might not be too dissimilar to what they will face in three matches against Bangladesh in the next few days. But this series is England’s last in the format until September and the lack of matches for players such as Joe Root – a first choice who has played just 15 ODIs since the 2019 World Cup final – could confuse selection matters. “We know Rooty is going to be at number three but he hasn’t played for a while,” Moeen said. “I’m sure he’s looking forward to playing but he’s probably not going to get many games before the World Cup now. “He’ll get a few, I’m sure (in September), but it’s not easy for the captain more than anything to get other players and make sure they’re ready, just in case. If the other guys do well, it’s a big headache as well.” Moeen has helped England to glory in both limited-overs World Cups and his largely economical spin bowling and aggressive batting in the middle order could come to the fore in India in the autumn. Moeen will be 36 by then but, despite having called time on his first-class career, he has no intention of retiring any time soon as he balances international duties with several franchise contracts. “I’m 35 and I’m trying to make the most of my cricketing career, and the ability to keep playing – I want to play as long as I can and hopefully retire when I literally can’t play any more,” he said. “It feels like I’m actually moving alright at the minute. There was a period a couple of years ago when I wasn’t moving very well and I thought, ‘I’d better start training a bit more’. I started to do a bit more training – just keeping in a bit of shape. Before that I wasn’t doing much. “I know there will be a day when I can’t play cricket any more, so I’m trying to make the most of it.”","pubDate":"2023-02-28 18:00:42","image_url":"https://static.independent.co.uk/2023/02/28/18/56b782ed5fc6297c0284fd6b96bad3daY29udGVudHNlYXJjaGFwaSwxNjc3Njg4NDA5-2.69775362.jpg?width=1200&auto=webp","source_id":"independentuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"New Zealand’s Test win captures the imagination – Tuesday’s sporting social","link":"https://www.independent.co.uk/sport/new-zealand-test-cricket-villa-emiliano-martinez-england-b2291416.html","keywords":["Sport"],"creator":["Pa Sport Staff"],"video_url":null,"description":"Villa’s Emiliano Martinez celebrated winning The Best FIFA Men’s Goalkeeper award.","content":"Sports stars and clubs across the world continue to provide an insight into their lives on social media. Here, the PA news agency looks at some of the best examples from February 28. New Zealand’s remarkable Test win over England captured the imagination. Jos Buttler was all set. Casemiro had more to celebrate. As did John Terry. Villa’s Emiliano Martinez celebrated winning The Best FIFA Men’s Goalkeeper award. David Beckham enjoyed Ireland. England turned the clock back. Lionel Messi added another award to his collection. Newcastle marked two years since the death of Glenn Roeder. Valtteri Bottas enjoyed a bit of down time before the season opener.","pubDate":"2023-02-28 17:51:24","image_url":"https://static.independent.co.uk/2023/02/28/18/28-3299034fef2c4ce1b3e2e5071a4f6d6c.jpg?width=1200&auto=webp","source_id":"independentuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Proteas: New dawn but same old, same old","link":"https://www.thesouthafrican.com/sport/new-dawn-same-old-proteas-28-february-2023/","keywords":["Cricket","Proteas","Sport","Aiden Markram","Dean Elgar","Featured","Temba Bavuma"],"creator":["Wade Pretorius"],"video_url":null,"description":"Fans of the Proteas may have gotten a little carried away before normality resumed during the first Test against the West Indies.","content":"Fans of the Proteas may have gotten a little carried away before normality resumed during the first Test against the West Indies. It was easily one of the most low-key build ups to a home Test series and one wonders why? ALSO READ: Proteas on debut: Who are De Zorzi and Coetzee? Protea fans sparse in Pretoria The recent success of the SA20 was backed up by a stellar run by the Proteas Women in the T20 World Cup. And key to both was the noticeable crowd attendance figures. It appeared that cricket lovers in the country were coming out of their hiding places and that the good times were here to stay. But why then was there so little interest leading up to the first ball on Tuesday at Centurion? Perhaps because the organisers did little for the fans in starting the game in the middle of the week. And now there is every chance no action will be played on the weekend after day one. ALSO READ: Proteas beware: Windies captain has a plan The Proteas of 2023 were supposed to be a new team. There was a new coach. A new coaching unit. And a new captain. There were two new debutants and a bunch of recalls. Old guard perform well And after winning the toss and choosing to bat, it was pleasing to see that the old Aiden Markram was back as was the old Dean Elgar. The pair saw off the new ball and then some as they motored past the 100 mark. Elgar eventually departed for 71 with the score at 141. ALSO READ: Proteas spinner Maharaj joins Middlesex on short-term dea l De Zorzi arrived and the runs continued to flow with Markram signalling his return to the team with a century. The pair though got themselves in a muddle which resulted in the debutant being run out. Yes, in a Test match. Sound familiar? And then captain Temba Bavuma was caught leg before for a second ball duck. ALSO READ: Bavuma wants Proteas to move on The score quickly went from 220-1 to 300-8. Just another regular Proteas collapse. The end of day score of 314-8 might look good on paper but the reality is clear, the Proteas have a lot of work to do to ensure they convince fans that it’s not just the same old Proteas albeit with a few new faces. They squandered the chance to make a huge first innings score. But after a long period without getting anywhere near the 300 mark, you could forgive those die-hard fans for at least enjoying the silver lining of day one. CLICK HERE TO READ MORE ARTICLES BY WADE PRETORIUS","pubDate":"2023-02-28 17:35:39","image_url":"https://www.thesouthafrican.com/wp-content/themes/jnews-child/assets/images/normal.jpeg.optimal.jpeg","source_id":"thesouthafrican","category":["sports"],"country":["south africa"],"language":"english"},{"title":"News24.com | 'Clean slate' for emotional Markram after significant Test ton: 'I held back the tears'","link":"https://www.news24.com/sport/Cricket/Proteas/clean-slate-for-emotional-markram-after-significant-test-ton-i-held-back-the-tears-20230228","keywords":null,"creator":null,"video_url":null,"description":"When Aiden Markram took off his helmet to celebrate a potentially career-defining sixth Test century for the Proteas on the opening day of the first Test against the West Indies on Tuesday, the droplets on his cheeks weren't sweat.","content":"When Aiden Markram took off his helmet to celebrate a potentially career-defining sixth Test century for the Proteas on the opening day of the first Test against the West Indies on Tuesday, the droplets on his cheeks weren't sweat. He was very consciously holding back tears. \"I was fighting the tears a bit,\" the mercurial 28-year-old admitted afterwards on a day where his 115 was the difference between a decent and another unfulfilling day for the South Africans. \"It meant quite a lot to me, it's been a strange journey, so I'm just grateful that it worked out. It's always a bit more special [at SuperSport Park] when you reach milestones on your home ground because you know some friends and family are present too. \"There was a lot of relief too. That's what it boiled down to.\" Considered one of the local game's most prodigiously gifted stroke-makers, Markram has endured a painful two-year period in the red-ball format since a century against Pakistan in Rawalpindi back in February 2021, crafting only a single fifty in 15 subsequent innings and eventually being dropped for late last year's trip to Australia. READ | Markram makes his mark, but Windies fight back to even out first day against SA As it turned out, that snub against the Baggy Greens was a blessing in disguise. \"It might've been a good thing. It felt like I was on a clean slate. Things work out quite weirdly at times. Obviously, my heart was sore not being in Australia. I spoke to team management and they were quite clear on why I wasn't selected. I was happy with those reasons,\" said Markram. \"Batters need runs on the board and if you're not scoring for a team that wants to compete with the best in the world, then your position should be under scrutiny. It worked out nicely in hindsight.\" Markram batted with a rare assurance during his 174-ball stay at the crease, hardly offering anything to a Windies attack that eventually proved quite prone, something undoubtedly helped by new red-ball coach Shukri Conrad's unwavering faith in him. About a fortnight ago, Conrad had stated emphatically at the squad announcement that the former World Cup-winning national Under-19 captain would be returning to the top of the order. \"It does make a difference as a player, I've come quite a long way with the coach, so I have a good relationship and understanding with Shukri,\" said Markram. \"It's great when a coach backs you like that, it gives you an extra bit of confidence. You also want to do him justice for backing you like that. That's one of [Shukri's] biggest strengths. He's always very clear in his messaging and you'll know exactly where you stand with reasons provided. I'm grateful that he backs me.\" Armed with that backing, he sought to ensure he adopted the right approach to a wicket that sped up as the day progressed. \"I had some nice chats with the coaches and teammates. it's quite difficult to drive here on day one with the slow bounce. I've driven in the past and I'm sure in future I'll make that mistake again, but it's about understanding that at some stage, you can play a certain shot,\" said Markram. \"It's merely earning the right to do so. It wasn't a game plan, it was just about keeping it simple with what's in front of you.\"","pubDate":"2023-02-28 17:33:24","image_url":"https://scripts.24.co.za/img/sites/sport24.png","source_id":"news24","category":["sports"],"country":["south africa"],"language":"english"},{"title":"एडेन मार्करम का एक और पराक्रम, आईपीएल में कप्तानी मिलते ही चमक उठा सितारा","link":"https://navbharattimes.indiatimes.com/sports/cricket/iplt20/news/aiden-markram-blazing-century-against-west-indies-in-1st-test-another-feat-shone-got-ipl-captaincy-sunrise-hyderabad/articleshow/98314804.cms","keywords":null,"creator":null,"video_url":null,"description":"Aiden Markram: साउथ अफ्रीका क्रिकेट टीम के स्टार बल्लेबाज एडेन मार्करम ने वेस्टइंडीज के खिलाफ पहले टेस्ट मैच में धमाकेदार शतकीय पारी खेली। मार्करम इन दिनों अपने करियर के सबसे बेहतरीन दौर से गुजर रहे हैं। हाल ही में उन्हें इंडियन प्रीमियर लीग की फ्रेंचाइजी सनराइजर्स हैदराबाद का कप्तान नियुक्त किया गया है।","content":"साउथ अफ्रीका के स्टार ओपनर बल्लेबाज एडेन मार्करम के बल्ले से इन दिनों रन नहीं आग बरस रहे हैं। टी20 हो फिर टेस्ट क्रिकेट हर फॉर्मेट में उन्हें बल्ले से रन निकल रहा है। मार्करम ने वेस्टइंडीज के खिलाफ जारी पहले टेस्ट मैच में दमदार शतकीय पारी खेली है। उन्होंने 174 गेंद में 115 रन बनाए जिसमें 18 चौके शामिल रहे। उनके इस दमदार के खेल के कारण ही साउथ अफ्रीका की टीम ने अपनी पहली पारी में 8 विकेट के नुकसान पर 314 रन बना लिए हैं। एडेन मार्करम इन दिनों अपने करियर के सर्वश्रेष्ठ फॉर्म में हैं। हाल ही में उन्होंने साउथ अफ्रीका में खेले गए एसए टी20 लीग के फाइनल में विस्फोटक शतक लगाया था। इसके अलावा इंडियन प्रीमियर लीग 2023 के लिए भी मार्करम को एक बड़ी जिम्मेदारी मिली है। मार्करम ने पिछले कुछ समय से जिस तरह का भरोसा दिखाया उसी के कारण आईपीएल में उनकी फ्रेंचाइजी सनराइजर्स हैदराबाद ने उन्हें आगामी सीजन के लिए कप्तान नियुक्त किया है। ऐसे में अब देखना होगा कि क्या मार्करम सनराइजर्स को एसए लीग की तरह सफलता दिला पाते हैं या नहीं। सनराइजर्स हैदराबाद के लिए एडेन मार्करम केन विलियमसन की जगह लेगें। हालांकि इस सीजन में विलियमसन सनराइजर्स के लिए नहीं खेल रहे हैं। उनकी कप्तानी में टीम का प्रदर्शन काफी निराशाजनक रहा था। इससे पहले डेविड वॉर्नर टीम के कप्तान थे लेकिन सीजन के बीच में उन्हें कप्तानी से हटा दिया गया। हालांकि आईपीएल 2023 के लिए जब मार्करम को कप्तानी सौंपी गई थी कई लोगों को काफी हैरानी हुई थी क्योंकि टीम में मयंक अग्रवाल और भुवनेश्वर कुमार जैसे अनुभवी खिलाड़ी हैं लेकिन फ्रेंचाइजी ने एडन मार्करम पर अपना भरोसा दिखाया है। एडेन मार्करम को आईपीएल में खेलने का बहुत अधिक अनुभव नहीं रहा है। वह इस लीग में अब तक कुल 20 मुकाबले में मैदान पर उतरे हैं। इस दौरान 134.1 की स्ट्राइक रेट से 527 रन बनाए हैं। इस दौरान उन्होंने तीन अर्धशतकीय पारी खेली है। पिछले सीजन में मार्करम ने सनराइजर्स हैदराबाद के लिए दमदार प्रदर्शन किया। एक तरफ विलियमसन जैसे बड़े नाम फ्लॉप रहे थे तो मार्करम ने अपनी सधी हुई बल्लेबाजी से टीम का भरोसा जीता था। यही कारण है कि उन्हें टीम की कप्तानी सौंपी गई है।","pubDate":"2023-02-28 17:32:32","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"क्या खत्म हो गया बुमराह का करियर, IPL से भी बाहर, वर्ल्ड कप तक खेलना मुश्किल","link":"https://navbharattimes.indiatimes.com/sports/cricket/cricket-news/jasprit-bumrah-ruled-out-of-ipl-odi-world-cup-is-in-danger/articleshow/98314457.cms","keywords":null,"creator":null,"video_url":null,"description":"Jasprit Bumrah: भारतीय क्रिकेट टीम के स्टार तेज गेंदबाज जसप्रीत बुमराह चोट के कारण 8 महीने से मैदान पर नहीं उतरे हैं। तीन फॉर्मेट में अपनी धारदार गेंदबाजी का लोहा मनवा चुके बुमराह के लिए फिटनेस एक बड़ी समस्या बन चुकी है।","content":"तेज गेंदबाज जसप्रीत बुमराह पीठ की चोट से उबरने में नाकाम रहे हैं, जिसके कारण वह इंडियन प्रीमियर लीग (आईपीएल) में नहीं खेल पाएंगे और उनके अगले छह महीने तक वापसी की संभावना भी नहीं है। भारतीय क्रिकेट बोर्ड (बीसीसीआई) के एक सूत्र ने मंगलवार को पीटीआई को यह जानकारी दी। यह पता नहीं चल पाया कि पिछले साल ऑस्ट्रेलिया में खेले गए टी-20 विश्व कप में भी नहीं खेल पाने वाले इस तेज गेंदबाज की पीठ का ऑपरेशन करना होगा या नहीं। बुमराह को शुरू में टी-20 विश्व कप की टीम में चुना गया था। बीसीसीआई के सूत्र ने कहा, ‘बुमराह आईपीएल से बाहर हो गए हैं क्योंकि वह अगले छह महीने तक वापसी नहीं कर पाएंगे। यहां तक कि हो सकता है कि वह तब तक भी वापसी नहीं कर पाए। लक्ष्य वनडे विश्वकप है, लेकिन उनकी उस टूर्नामेंट में खेलने की भी गारंटी नहीं है।’ इसका मतलब है कि अगर भारत विश्व टेस्ट चैंपियनशिप के फाइनल में जगह बनाता है तो बुमराह उसमें भी नहीं खेल पाएंगे। विश्व टेस्ट चैंपियनशिप का फाइनल सात जून से ओवल में शुरू होगा। आईपीएल 31 मार्च से शुरू हो रहा है और बुमराह मुंबई इंडियंस के मुख्य तेज गेंदबाज है। वनडे विश्वकप अक्टूबर-नवंबर में भारत में खेला जाना है। 29 वर्षीय बुमराह ने 2022 में पांच टेस्ट, पांच वनडे और इतने ही टी-20 अंतरराष्ट्रीय क्रिकेट मैचों के अलावा मुंबई इंडियंस के लिए आईपीएल के मैच खेले थे। बुमराह के एक्शन के कारण उनकी पीठ पर काफी दबाव पड़ता है। वेस्टइंडीज के पूर्व तेज गेंदबाज माइकल होल्डिंग का मानना है कि बुमराह हमेशा पीठ दर्द से परेशान रह सकते हैं।","pubDate":"2023-02-28 17:09:55","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Irani Cup format: What is Irani Cup in Indian domestic cricket?","link":"https://thesportsrush.com/cricket-news-irani-cup-format-what-is-irani-cup-in-indian-domestic-cricket/","keywords":["Cricket","Irani Cup","Irani Cup 2023"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Madhya Pradesh, who had clinched their first ever Ranji Trophy title during the 2021-22 season by defeating the 41-time champions Mumbai in the final, will face the ever-strong Rest of India (ROI) side in the Irani Cup 2023 from today onwards, at the Roop Singh Stadium in Gwalior. Karnataka’s experienced batter Mayank Agarwal will lead… The post Irani Cup format: What is Irani Cup in Indian domestic cricket? appeared first on The SportsRush.","content":"Madhya Pradesh, who had clinched their first ever title during the 2021-22 season by defeating the 41-time champions Mumbai in the final, will face the ever-strong Rest of India (ROI) side in the Irani Cup 2023 from today onwards, at the Roop Singh Stadium in Gwalior. Karnataka’s experienced batter Mayank Agarwal will lead the ROI side, which will also include the likes of Abhimanyu Easwaran, Yash Dhull, Yashasvi Jaiswal et al in the batting department. Chetan Sakariya, Navdeep Saini, Sourabh Kumar and the likes will form the bowling attack. In-form Sarfaraz Khan, who had scored a century against Saurashtra during the previous edition of Irani Cup in October last year, has unfortunately been ruled out this time around due to a finger injury. Madhya Pradesh, on the other hand, will be skippered by wicket-keeper batter Himanshu Mantri in the absence of their regular skipper Aditya Shrivastava. Some big names in the side include Rajat Patidar, Venkatesh Iyer, Avesh Khan, Yash Dubey etc. The battle for the Irani Cup takes place immediately post every Ranji Trophy season, in the international Test match format over a maximum of five days. In case the Test match ends in a Draw, the team with a first innings lead is declared the winner. Organized by the BCCI, whose selection committee also picks the ROI squad, the competition takes place between the incumbent Ranji Trophy winners and the Rest of the India Cricket Team. The 2022-23 domestic season however, will see two Irani Cup matches take place within a span of five months. The 2019-20 season champions Saurashtra played for the title in October 2022, as the match was forced to be postponed for two years due to COVID-19. Thus, while it was decided that Saurashtra would rightfully compete for the Cup earlier to the 2021-22 season winners MP, the latter would play for the title at the end of the season from today onwards. Zal Irani, who served as BCCI’s treasurer for two terms – 1928-29 to 1945-46 and 1948-49 to 1961-62, and later as its president in 1966 – was honored by the board by organizing a match for a coveted trophy presented in his name. It commenced during the 1959-60 edition with the Irani Trophy match taking place at the end of the season. After five years however, it was shifted to the beginning of next season.","pubDate":"2023-02-28 20:50:22","image_url":null,"source_id":"thesportsrush","category":["sports"],"country":["australia","united kingdom","india","united states of america"],"language":"english"},{"title":"Aiden Markram whacks Windies in first Test, but fellow Proteas batters fall like dominoes","link":"https://www.dailymaverick.co.za/article/2023-02-28-aiden-markram-whacks-windies-in-first-test-but-fellow-proteas-batters-fall-like-dominoes/","keywords":null,"creator":["Yanga Sibembe"],"video_url":null,"description":"A first Test century for the Proteas in almost two years, some Formula One-like driving on the cricket pitch, a duck dismissal for new Test captain Temba Bavuma and a typical South African batting collapse. How day one of the Proteas’ first of two matches in the series against the West Indies unfolded. The post Aiden Markram whacks Windies in first Test, but fellow Proteas batters fall like dominoes appeared first on Daily Maverick.","content":"South Africa began their first match of a two-game Test series against the West Indies on home soil ever so effectively and efficiently — cruising to 141 runs before the loss of their first wicket on day one. Then, not long after that first wicket fell — with Dean Elgar’s luck finally running out — a typical South African batting collapse ensued. The Proteas, having dominated the first two sessions of the day, capitulated to end the day on 314 runs for the loss of eight wickets. An impressive and driven 141-run partnership for the opening wicket — which later saw opener Aiden Markram notch up his first Test ton in two years (and the first 100 for a Proteas batter in a year) — propped up South Africa for an imposing total at the end of the first day. Markram and his fellow opener, former Proteas Test captain Elgar, were on song early on. After taking a few overs to settle in at the relatively empty SuperSport Park in Tshwane, the two South African starters began justifying the decision of new Test captain, Temba Bavuma, to bat first after he’d won the toss. The pair, perhaps inspired by watching the impeccable driving of Laura Wolvaardt in the knockout stages of the T20 Women’s World Cup drove the West Indies bowling attack to all parts of SuperSport Park as the Proteas looked comfortable. Elgar was the primary aggressor early on, with eventual centurion Markram happy to take up the position of co-pilot. However, Elgar’s aggression threatened to cost him his wicket early on. The former skipper was dropped at third slip off the bowling of Kyle Mayers when he was on just 10 runs. He went on to punish the Windies for their tardy fielding — reaching his 23rd international half-century in the longest format, as well as marking his first 50-plus score since April 2022. Aiden Markram of the Proteas during day one of the 1st Betway Test match between South Africa and West Indies at SuperSport Park on 28 February 2023 in Centurion, South Africa. (Photo: Lee Warren / Gallo Images) Visit Daily Maverick’s home page for more news, analysis and investigations He only managed to add 21 runs after that milestone, before Jermaine Blackwood (who had dropped Elgar earlier) redeemed himself with a great catch at third man off the bowling of South Africa’s chief tormentor with the ball, Alzarri Joseph. In stepped Tony de Zorzi — who was making his senior debut alongside bowler Gerald Coetzee. After the 25-year-old’s introduction, Markram took over the aggression. Unlike Elgar, he would convert his 50 to a morale-boosting ton. It was a fine response to being dropped from the team at the tail end of 2022. “[After being dropped from the last Test], today felt like starting on a clean slate. Obviously, I was heartsore not to be in Australia, but I was spoken to quite clearly about the reasons to not be on that tour, and I was happy with those reasons,” Markram said to journalists about his impressive innings of 115. “As batters we need runs. So, if you’re not scoring runs in a team that wants to compete and be the best in the world, your position should be under scrutiny. It worked out nicely, in hindsight.” The opener, who was one of just three batters to score a century in a match during the inaugural SA20, vindicated the decision of the Proteas’ selection gurus to recall him. Markram was still riding the buzz of captaining the Sunrisers Eastern Cape to the SA20 title in mid-February, and was as assured as ever after assuming the driver’s seat. He reached his first century in 16 innings off 154 balls. “At any stage when you have a few runs under the belt, you can take a certain amount of confidence from that… So, those happy vibes are carried forward. It helped that I had a bit of time away from the Test stuff to start on a clean slate,” he said. Alzarri Joseph of the West Indies during day one of the 1st Betway Test match between South Africa and West Indies at SuperSport Park on 28 February 2023 in Centurion, South Africa. (Photo: Sydney Seshibedi / Gallo Images) Then came the great collapse, which has become synonymous with South African batting and has seen the side slip from one of the best cricketing nations to also-rans. It was instigated by an unfortunate run-out of overzealous debutant De Zorzi. Having stroked the ball to deep cover to allow some running between wickets, the Western Province batter was keen for a third — with Markram not interested. By the time De Zorzi realised this, he was well out of his crease. Despite a valiant effort to return to safety, he was marginally short — gone for 28 off 69 runs. Thus, his 65-run stand with Markram was snuffed. The unfortunate event triggered a flurry of wickets lost for the hosts of the two-match series. In the same over as De Zorzi departing, Bavuma fell for a duck after just two balls — handing his detractors and online trolls more ammo to aim at him. Four overs later, the Windies caught the big fish in the form of Markram. Joseph delivered more menace, this time with a peach of a yorker that dislodged the stumps of South Africa’s top scorer. This left the Proteas on 236 for the loss of four wickets. They went on to add 78 runs for the loss of four more batters, ending day one on 314 for eight. DM","pubDate":"2023-02-28 20:25:50","image_url":null,"source_id":"dailymaverick","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Pat Cummins siblings: How many brothers and sisters does Pat Cummins have?","link":"https://thesportsrush.com/cricket-news-pat-cummins-siblings-how-many-brothers-and-sisters-does-pat-cummins-have/","keywords":["Cricket","Pat Cummins"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Australian national team skipper Pat Cummins leaving India mid-way during the tour has further dented their chances of drawing level the four-match Test series for the Border-Gavaskar Trophy. However, for a family which shares such a close bond with each of its members, he always knew what and who to prioritize first, as he left… The post Pat Cummins siblings: How many brothers and sisters does Pat Cummins have? appeared first on The SportsRush.","content":"Australian national team skipper Pat Cummins leaving India mid-way during the tour has further dented their chances of drawing level the four-match Test series for the . However, for a family which shares such a close bond with each of its members, he always knew what and who to prioritize first, as he left the Indian shores to attend his currently under palliative care. Pat is not his parents – and Peter Cummins’ only child. He was fortunate enough to have grown up with a couple of sisters and as many brothers, who’ve always encouraged and supported him in his journey to become a professional cricketer. In the year 2015, when Cummins played the lone T20I in Cardiff against England during Australia’s tour of England and Ireland, his mother and the two sisters had arrived in the city to cheer him up. He returned with bowling figures of 4-0-25-2, although his side lost the match by 5 runs. Pat Cummins’ sisters’ names are Laura Cummins and Kara Cummins, while his elder brothers’ names are Tim Cummins and Matt Cummins. The 29-year-old had revealed a few years ago how his sister still gets teary-eyed while recounting an incident from childhood, when she had slammed the door on Pat’s middle finger at the age of three. Such severe was the impact that he had by around a centimeter. In November last year, Cummins had mentioned via his Instagram how playing with his elder brothers after school and during the weekends had helped him become the international fast bowler that he is today. He earlier had revealed how he used to play with a web rubber ball at his backyard, by mowing a ten metre long pitch and a seven metre run-up. Both Tim and Matt Cummins had played for the city of Penrith in New South Wales. Around two-and-a-half years ago, in November 2020, Tim had even scored a century in the Sydney Premier League while playing for the Sydney University.","pubDate":"2023-02-28 19:31:05","image_url":null,"source_id":"thesportsrush","category":["sports"],"country":["australia","united kingdom","india","united states of america"],"language":"english"},{"title":"Border-Gavaskar Trophy, 3rd Test: Virat Kohli set to play 200th international match at home","link":"https://thenewsmill.com/2023/03/border-gavaskar-trophy-3rd-test-virat-kohli-set-to-play-200th-international-match-at-home/","keywords":["Cricket","Sports","ANI"],"creator":["ANI"],"video_url":null,"description":null,"content":"When India takes to the field against Australia during the third Test at Indore, it will be a special occasion for hosts’ star batter Virat Kohli, who will be playing his 200th international match at home. India will lock horns against Australia at Indore from Wednesday onwards. India is 2-0 up in the four-match series which has seen the Indian spin trio of Ravichandran Ashwin, Ravindra Jadeja and Axar Patel being the brightest stars for the hosts. Virat has been a pillar of India’s home domination ever since he hit the international cricket scene in 2008. In 199 matches at home so far, he has scored 10,829 runs in 221 innings at an average of 58.22. He has scored 34 centuries and 51 half-centuries at home, with the best score of 254*. However this time around, the pressure will be on Virat, who has been searching for big runs in the longer format since 2020. His numbers for 2020 (116 runs in three matches at an average of 19.33 with one fifty in six innings), 2021 (536 runs in 11 matches at an average of 28.21 with four fifties in 19 innings) and 2022 (265 in six matches at an average of 26.50 with one fifty in 11 innings) are too underwhelming for someone of his stature. However, Virat looked in complete control during his short innings of 44 and 20 runs in both innings of the second Test in Delhi and Team India would hope that their biggest batting star will end his three-year-long drought of big runs, which will also boost India’s chances to qualify for ICC World Test Championship finals, to be played in London from June 7 onwards. Virat has managed 76 runs in three innings in this series at an average of 25.33. India will also aim to overcome the Australian challenge at Indore to make it 3-0 and secure qualification for the WTC final. Skipper Rohit Sharma also believes in focusing on the present and taking on the Aussie challenge at Indore. “It will be a great achievement for us [to reach the WTC final], but we know that we need to cross that final hurdle, and for that, we need to win the next game as well, so the focus is on this Test, how we can win this game, and not look too far ahead, because after this game we have got one more Test match to be played, and then after that, there are two months of IPL,” Rohit said as quoted by ESPNCricinfo. “There is a lot of time to think about the final, but right now it is very important for us to focus on this one and see how we can turn it around and win this game as well, because in the last game, we were put under pressure for sure, we can expect the same here as well, so we need to be ready for that,” added Rohit. Regarding whether KL Rahul or Shubman Gill will play in the match, Rohit said that things are not decided yet. “As far as Gill and KL both are concerned, they train and practice [for long hours] before any game…As far as our 11 is concerned, we have not finalised on it. I would like to do it at the toss and I prefer to be announced at that point in time,” Rohit Sharma further said. He also pointed out that KL Rahul being removed from vice-captaincy is not a big thing and he was given the post only because the team lacked veterans. “All 17 players in the team has a chance. The team will back those who are talented. Stripping vice-captaincy doesn’t mean anything big. He was made the vice-captain because maybe there was not many experienced players at that time. It is not a big thing,” Rohit said. KL had a disappointing 2022 with the bat and has not started 2023 very brightly either. On the other hand, Shubman Gill is in red-hot form in white-ball cricket, having hit a double ton against New Zealand this year. Overall in 30 matches last year, KL aggregated 822 runs at an average of 25.68, with nine half-centuries. This year, he has scored a paltry 38 runs in three Test innings. Overall, he has totalled just 148 runs across five international matches at an average of 29.60, with one half-century and the best score of 64*. On the other hand, Australia will be aiming that they win the rest of two matches and will be playing for their respect, having lost their chance to reclaim the Border-Gavaskar Trophy. For that they will need their Steve Smith, leading in absence of Pat Cummins, who is in Australia due to family health issues, to fire with the bat. The 33-year-old boasts an exemplary batting record as captain, with 3793 runs at 67.73 with 15 hundreds, three of which came on his last Test trip to India in 2017. Encouraged by his success in the past, Smith is hopeful that the leadership role can help him regain his form with the bat, with him having registered scores of 37, 25*, 0 and 9 in the series thus far. Smith expressed his frustration with his dismissals in Delhi Test while speaking to media. “I have played, what, 95 Test matches (94) and I do not think there has been too many times I have walked off the field and I have gone, ‘what the hell am I doing?'” Smith told reporters on Tuesday. “I was pretty angry. There has not been too many times in my career where I have actually come off and just been bedazzled by what I’ve done. It wasn’t my finest moment. Certainly, something to learn from, I am still learning as well. It was not the way I wanted to play, particularly when I had the field set for all of us – they had the field out,” said the Australia captain. Smith conceded that the visitors faltered as a result of their hasty approach, something he plans to remedy in the remaining two Tests. “We probably just rushed things a little bit and it is something we will talk about …when we have got them on the ropes, we can slow things down. We do not have to play at such a high tempo and risky tempo. Because we had them where we wanted them, we had men out and the ability to get off strike. We just rushed it. We have got to learn to adapt a little bit better,” he added. While Australia has lost pacer Josh Hazlewood and veteran opener David Warner for the rest of the series due to injuries, they will be boosted by the returns of quick Mitchell Starc and all-rounder Cameron Green, who sustained finger injuries during the home series against South Africa and missed the first two Tests against India. India’s Test squad for the third and fourth Test against Australia: Rohit Sharma (Captain), K L Rahul, Shubman Gill, Cheteshwar Pujara, Virat Kohli, KS Bharat (wk), Ishan Kishan (wk), Ravichandran Ashwin, Axar Patel, Kuldeep Yadav, Ravindra Jadeja, Mohd. Shami, Mohd. Siraj, Shreyas Iyer, Suryakumar Yadav, Umesh Yadav and Jaydev Unadkat. (ANI)","pubDate":"2023-02-28 18:31:26","image_url":null,"source_id":"thenewsmill","category":["sports"],"country":["india"],"language":"english"},{"title":"Moeen Ali concerned heavy schedule could deprive England of all-format stars","link":"https://www.independent.co.uk/sport/cricket/moeen-ali-england-harry-brook-odi-south-africa-b2291421.html","keywords":["Cricket","Sport"],"creator":["David Charlesworth"],"video_url":null,"description":"The likes of Harry Brook may have to pick and choose when to play for their country due to competing fixture demands.","content":"Moeen Ali sympathises with all-format youngsters such as Harry Brook who may have to pick and choose when to play for England due to competing fixture demands. The frequent handwringing over England’s congested schedule is not a new development but the issue has been exacerbated by the Covid pandemic and a proliferation of T20 franchise leagues. England’s timetable in the next four years contains one bilateral contest where all formats are set to be played, against South Africa in 2026/27, as the Test and limited-overs formats continue to diverge. Overlapping requirements necessitates separate red and white-ball squads and Wednesday’s first ODI in Bangladesh is happening a little more than 24 hours after the end of a Test series in New Zealand. While Brook is riding high in the Test team and was part of the England side that won the T20 World Cup, Moeen feels the schedule may deprive the 24-year-old of becoming a fully-fledged all-format star. “It’s wrong for the younger players who want to play all forms and to play as many games as they can for England,” Moeen said. “That’s something to be really proud of, I guess, when you finish. “I’ve got more than 100 ODIs and 60-odd Tests and that means I feel like I’ve played a lot for England. But Brooky could get to 28 or 29 and not have played much white-ball cricket or one of the formats. “It’s obviously difficult. Even if there’s a window and you ease up on international cricket to help the players, there will just be more franchise (cricket). Somebody will come up with another league and fill that gap. It’s probably better just staying as it is now.” Priority has been given to Tests and T20s in the last couple of years, meaning the ODI format has been neglected, with only sporadic appearances from those who helped England to 2019 World Cup glory. England are set to defend their crown in India later this year in conditions that might not be too dissimilar to what they will face in three matches against Bangladesh in the next few days. But this series is England’s last in the format until September and the lack of matches for players such as Joe Root – a first choice who has played just 15 ODIs since the 2019 World Cup final – could confuse selection matters. “We know Rooty is going to be at number three but he hasn’t played for a while,” Moeen said. “I’m sure he’s looking forward to playing but he’s probably not going to get many games before the World Cup now. “He’ll get a few, I’m sure (in September), but it’s not easy for the captain more than anything to get other players and make sure they’re ready, just in case. If the other guys do well, it’s a big headache as well.” Moeen has helped England to glory in both limited-overs World Cups and his largely economical spin bowling and aggressive batting in the middle order could come to the fore in India in the autumn. Moeen will be 36 by then but, despite having called time on his first-class career, he has no intention of retiring any time soon as he balances international duties with several franchise contracts. “I’m 35 and I’m trying to make the most of my cricketing career, and the ability to keep playing – I want to play as long as I can and hopefully retire when I literally can’t play any more,” he said. “It feels like I’m actually moving alright at the minute. There was a period a couple of years ago when I wasn’t moving very well and I thought, ‘I’d better start training a bit more’. I started to do a bit more training – just keeping in a bit of shape. Before that I wasn’t doing much. “I know there will be a day when I can’t play cricket any more, so I’m trying to make the most of it.”","pubDate":"2023-02-28 18:00:42","image_url":"https://static.independent.co.uk/2023/02/28/18/56b782ed5fc6297c0284fd6b96bad3daY29udGVudHNlYXJjaGFwaSwxNjc3Njg4NDA5-2.69775362.jpg?width=1200&auto=webp","source_id":"independentuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"New Zealand’s Test win captures the imagination – Tuesday’s sporting social","link":"https://www.independent.co.uk/sport/new-zealand-test-cricket-villa-emiliano-martinez-england-b2291416.html","keywords":["Sport"],"creator":["Pa Sport Staff"],"video_url":null,"description":"Villa’s Emiliano Martinez celebrated winning The Best FIFA Men’s Goalkeeper award.","content":"Sports stars and clubs across the world continue to provide an insight into their lives on social media. Here, the PA news agency looks at some of the best examples from February 28. New Zealand’s remarkable Test win over England captured the imagination. Jos Buttler was all set. Casemiro had more to celebrate. As did John Terry. Villa’s Emiliano Martinez celebrated winning The Best FIFA Men’s Goalkeeper award. David Beckham enjoyed Ireland. England turned the clock back. Lionel Messi added another award to his collection. Newcastle marked two years since the death of Glenn Roeder. Valtteri Bottas enjoyed a bit of down time before the season opener.","pubDate":"2023-02-28 17:51:24","image_url":"https://static.independent.co.uk/2023/02/28/18/28-3299034fef2c4ce1b3e2e5071a4f6d6c.jpg?width=1200&auto=webp","source_id":"independentuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Proteas: New dawn but same old, same old","link":"https://www.thesouthafrican.com/sport/new-dawn-same-old-proteas-28-february-2023/","keywords":["Cricket","Proteas","Sport","Aiden Markram","Dean Elgar","Featured","Temba Bavuma"],"creator":["Wade Pretorius"],"video_url":null,"description":"Fans of the Proteas may have gotten a little carried away before normality resumed during the first Test against the West Indies.","content":"Fans of the Proteas may have gotten a little carried away before normality resumed during the first Test against the West Indies. It was easily one of the most low-key build ups to a home Test series and one wonders why? ALSO READ: Proteas on debut: Who are De Zorzi and Coetzee? Protea fans sparse in Pretoria The recent success of the SA20 was backed up by a stellar run by the Proteas Women in the T20 World Cup. And key to both was the noticeable crowd attendance figures. It appeared that cricket lovers in the country were coming out of their hiding places and that the good times were here to stay. But why then was there so little interest leading up to the first ball on Tuesday at Centurion? Perhaps because the organisers did little for the fans in starting the game in the middle of the week. And now there is every chance no action will be played on the weekend after day one. ALSO READ: Proteas beware: Windies captain has a plan The Proteas of 2023 were supposed to be a new team. There was a new coach. A new coaching unit. And a new captain. There were two new debutants and a bunch of recalls. Old guard perform well And after winning the toss and choosing to bat, it was pleasing to see that the old Aiden Markram was back as was the old Dean Elgar. The pair saw off the new ball and then some as they motored past the 100 mark. Elgar eventually departed for 71 with the score at 141. ALSO READ: Proteas spinner Maharaj joins Middlesex on short-term dea l De Zorzi arrived and the runs continued to flow with Markram signalling his return to the team with a century. The pair though got themselves in a muddle which resulted in the debutant being run out. Yes, in a Test match. Sound familiar? And then captain Temba Bavuma was caught leg before for a second ball duck. ALSO READ: Bavuma wants Proteas to move on The score quickly went from 220-1 to 300-8. Just another regular Proteas collapse. The end of day score of 314-8 might look good on paper but the reality is clear, the Proteas have a lot of work to do to ensure they convince fans that it’s not just the same old Proteas albeit with a few new faces. They squandered the chance to make a huge first innings score. But after a long period without getting anywhere near the 300 mark, you could forgive those die-hard fans for at least enjoying the silver lining of day one. CLICK HERE TO READ MORE ARTICLES BY WADE PRETORIUS","pubDate":"2023-02-28 17:35:39","image_url":"https://www.thesouthafrican.com/wp-content/themes/jnews-child/assets/images/normal.jpeg.optimal.jpeg","source_id":"thesouthafrican","category":["sports"],"country":["south africa"],"language":"english"},{"title":"News24.com | 'Clean slate' for emotional Markram after significant Test ton: 'I held back the tears'","link":"https://www.news24.com/sport/Cricket/Proteas/clean-slate-for-emotional-markram-after-significant-test-ton-i-held-back-the-tears-20230228","keywords":null,"creator":null,"video_url":null,"description":"When Aiden Markram took off his helmet to celebrate a potentially career-defining sixth Test century for the Proteas on the opening day of the first Test against the West Indies on Tuesday, the droplets on his cheeks weren't sweat.","content":"When Aiden Markram took off his helmet to celebrate a potentially career-defining sixth Test century for the Proteas on the opening day of the first Test against the West Indies on Tuesday, the droplets on his cheeks weren't sweat. He was very consciously holding back tears. \"I was fighting the tears a bit,\" the mercurial 28-year-old admitted afterwards on a day where his 115 was the difference between a decent and another unfulfilling day for the South Africans. \"It meant quite a lot to me, it's been a strange journey, so I'm just grateful that it worked out. It's always a bit more special [at SuperSport Park] when you reach milestones on your home ground because you know some friends and family are present too. \"There was a lot of relief too. That's what it boiled down to.\" Considered one of the local game's most prodigiously gifted stroke-makers, Markram has endured a painful two-year period in the red-ball format since a century against Pakistan in Rawalpindi back in February 2021, crafting only a single fifty in 15 subsequent innings and eventually being dropped for late last year's trip to Australia. READ | Markram makes his mark, but Windies fight back to even out first day against SA As it turned out, that snub against the Baggy Greens was a blessing in disguise. \"It might've been a good thing. It felt like I was on a clean slate. Things work out quite weirdly at times. Obviously, my heart was sore not being in Australia. I spoke to team management and they were quite clear on why I wasn't selected. I was happy with those reasons,\" said Markram. \"Batters need runs on the board and if you're not scoring for a team that wants to compete with the best in the world, then your position should be under scrutiny. It worked out nicely in hindsight.\" Markram batted with a rare assurance during his 174-ball stay at the crease, hardly offering anything to a Windies attack that eventually proved quite prone, something undoubtedly helped by new red-ball coach Shukri Conrad's unwavering faith in him. About a fortnight ago, Conrad had stated emphatically at the squad announcement that the former World Cup-winning national Under-19 captain would be returning to the top of the order. \"It does make a difference as a player, I've come quite a long way with the coach, so I have a good relationship and understanding with Shukri,\" said Markram. \"It's great when a coach backs you like that, it gives you an extra bit of confidence. You also want to do him justice for backing you like that. That's one of [Shukri's] biggest strengths. He's always very clear in his messaging and you'll know exactly where you stand with reasons provided. I'm grateful that he backs me.\" Armed with that backing, he sought to ensure he adopted the right approach to a wicket that sped up as the day progressed. \"I had some nice chats with the coaches and teammates. it's quite difficult to drive here on day one with the slow bounce. I've driven in the past and I'm sure in future I'll make that mistake again, but it's about understanding that at some stage, you can play a certain shot,\" said Markram. \"It's merely earning the right to do so. It wasn't a game plan, it was just about keeping it simple with what's in front of you.\"","pubDate":"2023-02-28 17:33:24","image_url":"https://scripts.24.co.za/img/sites/sport24.png","source_id":"news24","category":["sports"],"country":["south africa"],"language":"english"},{"title":"एडेन मार्करम का एक और पराक्रम, आईपीएल में कप्तानी मिलते ही चमक उठा सितारा","link":"https://navbharattimes.indiatimes.com/sports/cricket/iplt20/news/aiden-markram-blazing-century-against-west-indies-in-1st-test-another-feat-shone-got-ipl-captaincy-sunrise-hyderabad/articleshow/98314804.cms","keywords":null,"creator":null,"video_url":null,"description":"Aiden Markram: साउथ अफ्रीका क्रिकेट टीम के स्टार बल्लेबाज एडेन मार्करम ने वेस्टइंडीज के खिलाफ पहले टेस्ट मैच में धमाकेदार शतकीय पारी खेली। मार्करम इन दिनों अपने करियर के सबसे बेहतरीन दौर से गुजर रहे हैं। हाल ही में उन्हें इंडियन प्रीमियर लीग की फ्रेंचाइजी सनराइजर्स हैदराबाद का कप्तान नियुक्त किया गया है।","content":"साउथ अफ्रीका के स्टार ओपनर बल्लेबाज एडेन मार्करम के बल्ले से इन दिनों रन नहीं आग बरस रहे हैं। टी20 हो फिर टेस्ट क्रिकेट हर फॉर्मेट में उन्हें बल्ले से रन निकल रहा है। मार्करम ने वेस्टइंडीज के खिलाफ जारी पहले टेस्ट मैच में दमदार शतकीय पारी खेली है। उन्होंने 174 गेंद में 115 रन बनाए जिसमें 18 चौके शामिल रहे। उनके इस दमदार के खेल के कारण ही साउथ अफ्रीका की टीम ने अपनी पहली पारी में 8 विकेट के नुकसान पर 314 रन बना लिए हैं। एडेन मार्करम इन दिनों अपने करियर के सर्वश्रेष्ठ फॉर्म में हैं। हाल ही में उन्होंने साउथ अफ्रीका में खेले गए एसए टी20 लीग के फाइनल में विस्फोटक शतक लगाया था। इसके अलावा इंडियन प्रीमियर लीग 2023 के लिए भी मार्करम को एक बड़ी जिम्मेदारी मिली है। मार्करम ने पिछले कुछ समय से जिस तरह का भरोसा दिखाया उसी के कारण आईपीएल में उनकी फ्रेंचाइजी सनराइजर्स हैदराबाद ने उन्हें आगामी सीजन के लिए कप्तान नियुक्त किया है। ऐसे में अब देखना होगा कि क्या मार्करम सनराइजर्स को एसए लीग की तरह सफलता दिला पाते हैं या नहीं। सनराइजर्स हैदराबाद के लिए एडेन मार्करम केन विलियमसन की जगह लेगें। हालांकि इस सीजन में विलियमसन सनराइजर्स के लिए नहीं खेल रहे हैं। उनकी कप्तानी में टीम का प्रदर्शन काफी निराशाजनक रहा था। इससे पहले डेविड वॉर्नर टीम के कप्तान थे लेकिन सीजन के बीच में उन्हें कप्तानी से हटा दिया गया। हालांकि आईपीएल 2023 के लिए जब मार्करम को कप्तानी सौंपी गई थी कई लोगों को काफी हैरानी हुई थी क्योंकि टीम में मयंक अग्रवाल और भुवनेश्वर कुमार जैसे अनुभवी खिलाड़ी हैं लेकिन फ्रेंचाइजी ने एडन मार्करम पर अपना भरोसा दिखाया है। एडेन मार्करम को आईपीएल में खेलने का बहुत अधिक अनुभव नहीं रहा है। वह इस लीग में अब तक कुल 20 मुकाबले में मैदान पर उतरे हैं। इस दौरान 134.1 की स्ट्राइक रेट से 527 रन बनाए हैं। इस दौरान उन्होंने तीन अर्धशतकीय पारी खेली है। पिछले सीजन में मार्करम ने सनराइजर्स हैदराबाद के लिए दमदार प्रदर्शन किया। एक तरफ विलियमसन जैसे बड़े नाम फ्लॉप रहे थे तो मार्करम ने अपनी सधी हुई बल्लेबाजी से टीम का भरोसा जीता था। यही कारण है कि उन्हें टीम की कप्तानी सौंपी गई है।","pubDate":"2023-02-28 17:32:32","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"क्या खत्म हो गया बुमराह का करियर, IPL से भी बाहर, वर्ल्ड कप तक खेलना मुश्किल","link":"https://navbharattimes.indiatimes.com/sports/cricket/cricket-news/jasprit-bumrah-ruled-out-of-ipl-odi-world-cup-is-in-danger/articleshow/98314457.cms","keywords":null,"creator":null,"video_url":null,"description":"Jasprit Bumrah: भारतीय क्रिकेट टीम के स्टार तेज गेंदबाज जसप्रीत बुमराह चोट के कारण 8 महीने से मैदान पर नहीं उतरे हैं। तीन फॉर्मेट में अपनी धारदार गेंदबाजी का लोहा मनवा चुके बुमराह के लिए फिटनेस एक बड़ी समस्या बन चुकी है।","content":"तेज गेंदबाज जसप्रीत बुमराह पीठ की चोट से उबरने में नाकाम रहे हैं, जिसके कारण वह इंडियन प्रीमियर लीग (आईपीएल) में नहीं खेल पाएंगे और उनके अगले छह महीने तक वापसी की संभावना भी नहीं है। भारतीय क्रिकेट बोर्ड (बीसीसीआई) के एक सूत्र ने मंगलवार को पीटीआई को यह जानकारी दी। यह पता नहीं चल पाया कि पिछले साल ऑस्ट्रेलिया में खेले गए टी-20 विश्व कप में भी नहीं खेल पाने वाले इस तेज गेंदबाज की पीठ का ऑपरेशन करना होगा या नहीं। बुमराह को शुरू में टी-20 विश्व कप की टीम में चुना गया था। बीसीसीआई के सूत्र ने कहा, ‘बुमराह आईपीएल से बाहर हो गए हैं क्योंकि वह अगले छह महीने तक वापसी नहीं कर पाएंगे। यहां तक कि हो सकता है कि वह तब तक भी वापसी नहीं कर पाए। लक्ष्य वनडे विश्वकप है, लेकिन उनकी उस टूर्नामेंट में खेलने की भी गारंटी नहीं है।’ इसका मतलब है कि अगर भारत विश्व टेस्ट चैंपियनशिप के फाइनल में जगह बनाता है तो बुमराह उसमें भी नहीं खेल पाएंगे। विश्व टेस्ट चैंपियनशिप का फाइनल सात जून से ओवल में शुरू होगा। आईपीएल 31 मार्च से शुरू हो रहा है और बुमराह मुंबई इंडियंस के मुख्य तेज गेंदबाज है। वनडे विश्वकप अक्टूबर-नवंबर में भारत में खेला जाना है। 29 वर्षीय बुमराह ने 2022 में पांच टेस्ट, पांच वनडे और इतने ही टी-20 अंतरराष्ट्रीय क्रिकेट मैचों के अलावा मुंबई इंडियंस के लिए आईपीएल के मैच खेले थे। बुमराह के एक्शन के कारण उनकी पीठ पर काफी दबाव पड़ता है। वेस्टइंडीज के पूर्व तेज गेंदबाज माइकल होल्डिंग का मानना है कि बुमराह हमेशा पीठ दर्द से परेशान रह सकते हैं।","pubDate":"2023-02-28 17:09:55","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Irani Cup format: What is Irani Cup in Indian domestic cricket?","link":"https://thesportsrush.com/cricket-news-irani-cup-format-what-is-irani-cup-in-indian-domestic-cricket/","keywords":["Cricket","Irani Cup","Irani Cup 2023"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Madhya Pradesh, who had clinched their first ever Ranji Trophy title during the 2021-22 season by defeating the 41-time champions Mumbai in the final, will face the ever-strong Rest of India (ROI) side in the Irani Cup 2023 from today onwards, at the Roop Singh Stadium in Gwalior. Karnataka’s experienced batter Mayank Agarwal will lead… The post Irani Cup format: What is Irani Cup in Indian domestic cricket? appeared first on The SportsRush.","content":"Madhya Pradesh, who had clinched their first ever title during the 2021-22 season by defeating the 41-time champions Mumbai in the final, will face the ever-strong Rest of India (ROI) side in the Irani Cup 2023 from today onwards, at the Roop Singh Stadium in Gwalior. Karnataka’s experienced batter Mayank Agarwal will lead the ROI side, which will also include the likes of Abhimanyu Easwaran, Yash Dhull, Yashasvi Jaiswal et al in the batting department. Chetan Sakariya, Navdeep Saini, Sourabh Kumar and the likes will form the bowling attack. In-form Sarfaraz Khan, who had scored a century against Saurashtra during the previous edition of Irani Cup in October last year, has unfortunately been ruled out this time around due to a finger injury. Madhya Pradesh, on the other hand, will be skippered by wicket-keeper batter Himanshu Mantri in the absence of their regular skipper Aditya Shrivastava. Some big names in the side include Rajat Patidar, Venkatesh Iyer, Avesh Khan, Yash Dubey etc. The battle for the Irani Cup takes place immediately post every Ranji Trophy season, in the international Test match format over a maximum of five days. In case the Test match ends in a Draw, the team with a first innings lead is declared the winner. Organized by the BCCI, whose selection committee also picks the ROI squad, the competition takes place between the incumbent Ranji Trophy winners and the Rest of the India Cricket Team. The 2022-23 domestic season however, will see two Irani Cup matches take place within a span of five months. The 2019-20 season champions Saurashtra played for the title in October 2022, as the match was forced to be postponed for two years due to COVID-19. Thus, while it was decided that Saurashtra would rightfully compete for the Cup earlier to the 2021-22 season winners MP, the latter would play for the title at the end of the season from today onwards. Zal Irani, who served as BCCI’s treasurer for two terms – 1928-29 to 1945-46 and 1948-49 to 1961-62, and later as its president in 1966 – was honored by the board by organizing a match for a coveted trophy presented in his name. It commenced during the 1959-60 edition with the Irani Trophy match taking place at the end of the season. After five years however, it was shifted to the beginning of next season.","pubDate":"2023-02-28 20:50:22","image_url":null,"source_id":"thesportsrush","category":["sports"],"country":["australia","united kingdom","india","united states of america"],"language":"english"},{"title":"Aiden Markram whacks Windies in first Test, but fellow Proteas batters fall like dominoes","link":"https://www.dailymaverick.co.za/article/2023-02-28-aiden-markram-whacks-windies-in-first-test-but-fellow-proteas-batters-fall-like-dominoes/","keywords":null,"creator":["Yanga Sibembe"],"video_url":null,"description":"A first Test century for the Proteas in almost two years, some Formula One-like driving on the cricket pitch, a duck dismissal for new Test captain Temba Bavuma and a typical South African batting collapse. How day one of the Proteas’ first of two matches in the series against the West Indies unfolded. The post Aiden Markram whacks Windies in first Test, but fellow Proteas batters fall like dominoes appeared first on Daily Maverick.","content":"South Africa began their first match of a two-game Test series against the West Indies on home soil ever so effectively and efficiently — cruising to 141 runs before the loss of their first wicket on day one. Then, not long after that first wicket fell — with Dean Elgar’s luck finally running out — a typical South African batting collapse ensued. The Proteas, having dominated the first two sessions of the day, capitulated to end the day on 314 runs for the loss of eight wickets. An impressive and driven 141-run partnership for the opening wicket — which later saw opener Aiden Markram notch up his first Test ton in two years (and the first 100 for a Proteas batter in a year) — propped up South Africa for an imposing total at the end of the first day. Markram and his fellow opener, former Proteas Test captain Elgar, were on song early on. After taking a few overs to settle in at the relatively empty SuperSport Park in Tshwane, the two South African starters began justifying the decision of new Test captain, Temba Bavuma, to bat first after he’d won the toss. The pair, perhaps inspired by watching the impeccable driving of Laura Wolvaardt in the knockout stages of the T20 Women’s World Cup drove the West Indies bowling attack to all parts of SuperSport Park as the Proteas looked comfortable. Elgar was the primary aggressor early on, with eventual centurion Markram happy to take up the position of co-pilot. However, Elgar’s aggression threatened to cost him his wicket early on. The former skipper was dropped at third slip off the bowling of Kyle Mayers when he was on just 10 runs. He went on to punish the Windies for their tardy fielding — reaching his 23rd international half-century in the longest format, as well as marking his first 50-plus score since April 2022. Aiden Markram of the Proteas during day one of the 1st Betway Test match between South Africa and West Indies at SuperSport Park on 28 February 2023 in Centurion, South Africa. (Photo: Lee Warren / Gallo Images) Visit Daily Maverick’s home page for more news, analysis and investigations He only managed to add 21 runs after that milestone, before Jermaine Blackwood (who had dropped Elgar earlier) redeemed himself with a great catch at third man off the bowling of South Africa’s chief tormentor with the ball, Alzarri Joseph. In stepped Tony de Zorzi — who was making his senior debut alongside bowler Gerald Coetzee. After the 25-year-old’s introduction, Markram took over the aggression. Unlike Elgar, he would convert his 50 to a morale-boosting ton. It was a fine response to being dropped from the team at the tail end of 2022. “[After being dropped from the last Test], today felt like starting on a clean slate. Obviously, I was heartsore not to be in Australia, but I was spoken to quite clearly about the reasons to not be on that tour, and I was happy with those reasons,” Markram said to journalists about his impressive innings of 115. “As batters we need runs. So, if you’re not scoring runs in a team that wants to compete and be the best in the world, your position should be under scrutiny. It worked out nicely, in hindsight.” The opener, who was one of just three batters to score a century in a match during the inaugural SA20, vindicated the decision of the Proteas’ selection gurus to recall him. Markram was still riding the buzz of captaining the Sunrisers Eastern Cape to the SA20 title in mid-February, and was as assured as ever after assuming the driver’s seat. He reached his first century in 16 innings off 154 balls. “At any stage when you have a few runs under the belt, you can take a certain amount of confidence from that… So, those happy vibes are carried forward. It helped that I had a bit of time away from the Test stuff to start on a clean slate,” he said. Alzarri Joseph of the West Indies during day one of the 1st Betway Test match between South Africa and West Indies at SuperSport Park on 28 February 2023 in Centurion, South Africa. (Photo: Sydney Seshibedi / Gallo Images) Then came the great collapse, which has become synonymous with South African batting and has seen the side slip from one of the best cricketing nations to also-rans. It was instigated by an unfortunate run-out of overzealous debutant De Zorzi. Having stroked the ball to deep cover to allow some running between wickets, the Western Province batter was keen for a third — with Markram not interested. By the time De Zorzi realised this, he was well out of his crease. Despite a valiant effort to return to safety, he was marginally short — gone for 28 off 69 runs. Thus, his 65-run stand with Markram was snuffed. The unfortunate event triggered a flurry of wickets lost for the hosts of the two-match series. In the same over as De Zorzi departing, Bavuma fell for a duck after just two balls — handing his detractors and online trolls more ammo to aim at him. Four overs later, the Windies caught the big fish in the form of Markram. Joseph delivered more menace, this time with a peach of a yorker that dislodged the stumps of South Africa’s top scorer. This left the Proteas on 236 for the loss of four wickets. They went on to add 78 runs for the loss of four more batters, ending day one on 314 for eight. DM","pubDate":"2023-02-28 20:25:50","image_url":null,"source_id":"dailymaverick","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Pat Cummins siblings: How many brothers and sisters does Pat Cummins have?","link":"https://thesportsrush.com/cricket-news-pat-cummins-siblings-how-many-brothers-and-sisters-does-pat-cummins-have/","keywords":["Cricket","Pat Cummins"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Australian national team skipper Pat Cummins leaving India mid-way during the tour has further dented their chances of drawing level the four-match Test series for the Border-Gavaskar Trophy. However, for a family which shares such a close bond with each of its members, he always knew what and who to prioritize first, as he left… The post Pat Cummins siblings: How many brothers and sisters does Pat Cummins have? appeared first on The SportsRush.","content":"Australian national team skipper Pat Cummins leaving India mid-way during the tour has further dented their chances of drawing level the four-match Test series for the . However, for a family which shares such a close bond with each of its members, he always knew what and who to prioritize first, as he left the Indian shores to attend his currently under palliative care. Pat is not his parents – and Peter Cummins’ only child. He was fortunate enough to have grown up with a couple of sisters and as many brothers, who’ve always encouraged and supported him in his journey to become a professional cricketer. In the year 2015, when Cummins played the lone T20I in Cardiff against England during Australia’s tour of England and Ireland, his mother and the two sisters had arrived in the city to cheer him up. He returned with bowling figures of 4-0-25-2, although his side lost the match by 5 runs. Pat Cummins’ sisters’ names are Laura Cummins and Kara Cummins, while his elder brothers’ names are Tim Cummins and Matt Cummins. The 29-year-old had revealed a few years ago how his sister still gets teary-eyed while recounting an incident from childhood, when she had slammed the door on Pat’s middle finger at the age of three. Such severe was the impact that he had by around a centimeter. In November last year, Cummins had mentioned via his Instagram how playing with his elder brothers after school and during the weekends had helped him become the international fast bowler that he is today. He earlier had revealed how he used to play with a web rubber ball at his backyard, by mowing a ten metre long pitch and a seven metre run-up. Both Tim and Matt Cummins had played for the city of Penrith in New South Wales. Around two-and-a-half years ago, in November 2020, Tim had even scored a century in the Sydney Premier League while playing for the Sydney University.","pubDate":"2023-02-28 19:31:05","image_url":null,"source_id":"thesportsrush","category":["sports"],"country":["australia","united kingdom","india","united states of america"],"language":"english"},{"title":"Border-Gavaskar Trophy, 3rd Test: Virat Kohli set to play 200th international match at home","link":"https://thenewsmill.com/2023/03/border-gavaskar-trophy-3rd-test-virat-kohli-set-to-play-200th-international-match-at-home/","keywords":["Cricket","Sports","ANI"],"creator":["ANI"],"video_url":null,"description":null,"content":"When India takes to the field against Australia during the third Test at Indore, it will be a special occasion for hosts’ star batter Virat Kohli, who will be playing his 200th international match at home. India will lock horns against Australia at Indore from Wednesday onwards. India is 2-0 up in the four-match series which has seen the Indian spin trio of Ravichandran Ashwin, Ravindra Jadeja and Axar Patel being the brightest stars for the hosts. Virat has been a pillar of India’s home domination ever since he hit the international cricket scene in 2008. In 199 matches at home so far, he has scored 10,829 runs in 221 innings at an average of 58.22. He has scored 34 centuries and 51 half-centuries at home, with the best score of 254*. However this time around, the pressure will be on Virat, who has been searching for big runs in the longer format since 2020. His numbers for 2020 (116 runs in three matches at an average of 19.33 with one fifty in six innings), 2021 (536 runs in 11 matches at an average of 28.21 with four fifties in 19 innings) and 2022 (265 in six matches at an average of 26.50 with one fifty in 11 innings) are too underwhelming for someone of his stature. However, Virat looked in complete control during his short innings of 44 and 20 runs in both innings of the second Test in Delhi and Team India would hope that their biggest batting star will end his three-year-long drought of big runs, which will also boost India’s chances to qualify for ICC World Test Championship finals, to be played in London from June 7 onwards. Virat has managed 76 runs in three innings in this series at an average of 25.33. India will also aim to overcome the Australian challenge at Indore to make it 3-0 and secure qualification for the WTC final. Skipper Rohit Sharma also believes in focusing on the present and taking on the Aussie challenge at Indore. “It will be a great achievement for us [to reach the WTC final], but we know that we need to cross that final hurdle, and for that, we need to win the next game as well, so the focus is on this Test, how we can win this game, and not look too far ahead, because after this game we have got one more Test match to be played, and then after that, there are two months of IPL,” Rohit said as quoted by ESPNCricinfo. “There is a lot of time to think about the final, but right now it is very important for us to focus on this one and see how we can turn it around and win this game as well, because in the last game, we were put under pressure for sure, we can expect the same here as well, so we need to be ready for that,” added Rohit. Regarding whether KL Rahul or Shubman Gill will play in the match, Rohit said that things are not decided yet. “As far as Gill and KL both are concerned, they train and practice [for long hours] before any game…As far as our 11 is concerned, we have not finalised on it. I would like to do it at the toss and I prefer to be announced at that point in time,” Rohit Sharma further said. He also pointed out that KL Rahul being removed from vice-captaincy is not a big thing and he was given the post only because the team lacked veterans. “All 17 players in the team has a chance. The team will back those who are talented. Stripping vice-captaincy doesn’t mean anything big. He was made the vice-captain because maybe there was not many experienced players at that time. It is not a big thing,” Rohit said. KL had a disappointing 2022 with the bat and has not started 2023 very brightly either. On the other hand, Shubman Gill is in red-hot form in white-ball cricket, having hit a double ton against New Zealand this year. Overall in 30 matches last year, KL aggregated 822 runs at an average of 25.68, with nine half-centuries. This year, he has scored a paltry 38 runs in three Test innings. Overall, he has totalled just 148 runs across five international matches at an average of 29.60, with one half-century and the best score of 64*. On the other hand, Australia will be aiming that they win the rest of two matches and will be playing for their respect, having lost their chance to reclaim the Border-Gavaskar Trophy. For that they will need their Steve Smith, leading in absence of Pat Cummins, who is in Australia due to family health issues, to fire with the bat. The 33-year-old boasts an exemplary batting record as captain, with 3793 runs at 67.73 with 15 hundreds, three of which came on his last Test trip to India in 2017. Encouraged by his success in the past, Smith is hopeful that the leadership role can help him regain his form with the bat, with him having registered scores of 37, 25*, 0 and 9 in the series thus far. Smith expressed his frustration with his dismissals in Delhi Test while speaking to media. “I have played, what, 95 Test matches (94) and I do not think there has been too many times I have walked off the field and I have gone, ‘what the hell am I doing?'” Smith told reporters on Tuesday. “I was pretty angry. There has not been too many times in my career where I have actually come off and just been bedazzled by what I’ve done. It wasn’t my finest moment. Certainly, something to learn from, I am still learning as well. It was not the way I wanted to play, particularly when I had the field set for all of us – they had the field out,” said the Australia captain. Smith conceded that the visitors faltered as a result of their hasty approach, something he plans to remedy in the remaining two Tests. “We probably just rushed things a little bit and it is something we will talk about …when we have got them on the ropes, we can slow things down. We do not have to play at such a high tempo and risky tempo. Because we had them where we wanted them, we had men out and the ability to get off strike. We just rushed it. We have got to learn to adapt a little bit better,” he added. While Australia has lost pacer Josh Hazlewood and veteran opener David Warner for the rest of the series due to injuries, they will be boosted by the returns of quick Mitchell Starc and all-rounder Cameron Green, who sustained finger injuries during the home series against South Africa and missed the first two Tests against India. India’s Test squad for the third and fourth Test against Australia: Rohit Sharma (Captain), K L Rahul, Shubman Gill, Cheteshwar Pujara, Virat Kohli, KS Bharat (wk), Ishan Kishan (wk), Ravichandran Ashwin, Axar Patel, Kuldeep Yadav, Ravindra Jadeja, Mohd. Shami, Mohd. Siraj, Shreyas Iyer, Suryakumar Yadav, Umesh Yadav and Jaydev Unadkat. (ANI)","pubDate":"2023-02-28 18:31:26","image_url":null,"source_id":"thenewsmill","category":["sports"],"country":["india"],"language":"english"},{"title":"Moeen Ali concerned heavy schedule could deprive England of all-format stars","link":"https://www.independent.co.uk/sport/cricket/moeen-ali-england-harry-brook-odi-south-africa-b2291421.html","keywords":["Cricket","Sport"],"creator":["David Charlesworth"],"video_url":null,"description":"The likes of Harry Brook may have to pick and choose when to play for their country due to competing fixture demands.","content":"Moeen Ali sympathises with all-format youngsters such as Harry Brook who may have to pick and choose when to play for England due to competing fixture demands. The frequent handwringing over England’s congested schedule is not a new development but the issue has been exacerbated by the Covid pandemic and a proliferation of T20 franchise leagues. England’s timetable in the next four years contains one bilateral contest where all formats are set to be played, against South Africa in 2026/27, as the Test and limited-overs formats continue to diverge. Overlapping requirements necessitates separate red and white-ball squads and Wednesday’s first ODI in Bangladesh is happening a little more than 24 hours after the end of a Test series in New Zealand. While Brook is riding high in the Test team and was part of the England side that won the T20 World Cup, Moeen feels the schedule may deprive the 24-year-old of becoming a fully-fledged all-format star. “It’s wrong for the younger players who want to play all forms and to play as many games as they can for England,” Moeen said. “That’s something to be really proud of, I guess, when you finish. “I’ve got more than 100 ODIs and 60-odd Tests and that means I feel like I’ve played a lot for England. But Brooky could get to 28 or 29 and not have played much white-ball cricket or one of the formats. “It’s obviously difficult. Even if there’s a window and you ease up on international cricket to help the players, there will just be more franchise (cricket). Somebody will come up with another league and fill that gap. It’s probably better just staying as it is now.” Priority has been given to Tests and T20s in the last couple of years, meaning the ODI format has been neglected, with only sporadic appearances from those who helped England to 2019 World Cup glory. England are set to defend their crown in India later this year in conditions that might not be too dissimilar to what they will face in three matches against Bangladesh in the next few days. But this series is England’s last in the format until September and the lack of matches for players such as Joe Root – a first choice who has played just 15 ODIs since the 2019 World Cup final – could confuse selection matters. “We know Rooty is going to be at number three but he hasn’t played for a while,” Moeen said. “I’m sure he’s looking forward to playing but he’s probably not going to get many games before the World Cup now. “He’ll get a few, I’m sure (in September), but it’s not easy for the captain more than anything to get other players and make sure they’re ready, just in case. If the other guys do well, it’s a big headache as well.” Moeen has helped England to glory in both limited-overs World Cups and his largely economical spin bowling and aggressive batting in the middle order could come to the fore in India in the autumn. Moeen will be 36 by then but, despite having called time on his first-class career, he has no intention of retiring any time soon as he balances international duties with several franchise contracts. “I’m 35 and I’m trying to make the most of my cricketing career, and the ability to keep playing – I want to play as long as I can and hopefully retire when I literally can’t play any more,” he said. “It feels like I’m actually moving alright at the minute. There was a period a couple of years ago when I wasn’t moving very well and I thought, ‘I’d better start training a bit more’. I started to do a bit more training – just keeping in a bit of shape. Before that I wasn’t doing much. “I know there will be a day when I can’t play cricket any more, so I’m trying to make the most of it.”","pubDate":"2023-02-28 18:00:42","image_url":"https://static.independent.co.uk/2023/02/28/18/56b782ed5fc6297c0284fd6b96bad3daY29udGVudHNlYXJjaGFwaSwxNjc3Njg4NDA5-2.69775362.jpg?width=1200&auto=webp","source_id":"independentuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"New Zealand’s Test win captures the imagination – Tuesday’s sporting social","link":"https://www.independent.co.uk/sport/new-zealand-test-cricket-villa-emiliano-martinez-england-b2291416.html","keywords":["Sport"],"creator":["Pa Sport Staff"],"video_url":null,"description":"Villa’s Emiliano Martinez celebrated winning The Best FIFA Men’s Goalkeeper award.","content":"Sports stars and clubs across the world continue to provide an insight into their lives on social media. Here, the PA news agency looks at some of the best examples from February 28. New Zealand’s remarkable Test win over England captured the imagination. Jos Buttler was all set. Casemiro had more to celebrate. As did John Terry. Villa’s Emiliano Martinez celebrated winning The Best FIFA Men’s Goalkeeper award. David Beckham enjoyed Ireland. England turned the clock back. Lionel Messi added another award to his collection. Newcastle marked two years since the death of Glenn Roeder. Valtteri Bottas enjoyed a bit of down time before the season opener.","pubDate":"2023-02-28 17:51:24","image_url":"https://static.independent.co.uk/2023/02/28/18/28-3299034fef2c4ce1b3e2e5071a4f6d6c.jpg?width=1200&auto=webp","source_id":"independentuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Proteas: New dawn but same old, same old","link":"https://www.thesouthafrican.com/sport/new-dawn-same-old-proteas-28-february-2023/","keywords":["Cricket","Proteas","Sport","Aiden Markram","Dean Elgar","Featured","Temba Bavuma"],"creator":["Wade Pretorius"],"video_url":null,"description":"Fans of the Proteas may have gotten a little carried away before normality resumed during the first Test against the West Indies.","content":"Fans of the Proteas may have gotten a little carried away before normality resumed during the first Test against the West Indies. It was easily one of the most low-key build ups to a home Test series and one wonders why? ALSO READ: Proteas on debut: Who are De Zorzi and Coetzee? Protea fans sparse in Pretoria The recent success of the SA20 was backed up by a stellar run by the Proteas Women in the T20 World Cup. And key to both was the noticeable crowd attendance figures. It appeared that cricket lovers in the country were coming out of their hiding places and that the good times were here to stay. But why then was there so little interest leading up to the first ball on Tuesday at Centurion? Perhaps because the organisers did little for the fans in starting the game in the middle of the week. And now there is every chance no action will be played on the weekend after day one. ALSO READ: Proteas beware: Windies captain has a plan The Proteas of 2023 were supposed to be a new team. There was a new coach. A new coaching unit. And a new captain. There were two new debutants and a bunch of recalls. Old guard perform well And after winning the toss and choosing to bat, it was pleasing to see that the old Aiden Markram was back as was the old Dean Elgar. The pair saw off the new ball and then some as they motored past the 100 mark. Elgar eventually departed for 71 with the score at 141. ALSO READ: Proteas spinner Maharaj joins Middlesex on short-term dea l De Zorzi arrived and the runs continued to flow with Markram signalling his return to the team with a century. The pair though got themselves in a muddle which resulted in the debutant being run out. Yes, in a Test match. Sound familiar? And then captain Temba Bavuma was caught leg before for a second ball duck. ALSO READ: Bavuma wants Proteas to move on The score quickly went from 220-1 to 300-8. Just another regular Proteas collapse. The end of day score of 314-8 might look good on paper but the reality is clear, the Proteas have a lot of work to do to ensure they convince fans that it’s not just the same old Proteas albeit with a few new faces. They squandered the chance to make a huge first innings score. But after a long period without getting anywhere near the 300 mark, you could forgive those die-hard fans for at least enjoying the silver lining of day one. CLICK HERE TO READ MORE ARTICLES BY WADE PRETORIUS","pubDate":"2023-02-28 17:35:39","image_url":"https://www.thesouthafrican.com/wp-content/themes/jnews-child/assets/images/normal.jpeg.optimal.jpeg","source_id":"thesouthafrican","category":["sports"],"country":["south africa"],"language":"english"},{"title":"News24.com | 'Clean slate' for emotional Markram after significant Test ton: 'I held back the tears'","link":"https://www.news24.com/sport/Cricket/Proteas/clean-slate-for-emotional-markram-after-significant-test-ton-i-held-back-the-tears-20230228","keywords":null,"creator":null,"video_url":null,"description":"When Aiden Markram took off his helmet to celebrate a potentially career-defining sixth Test century for the Proteas on the opening day of the first Test against the West Indies on Tuesday, the droplets on his cheeks weren't sweat.","content":"When Aiden Markram took off his helmet to celebrate a potentially career-defining sixth Test century for the Proteas on the opening day of the first Test against the West Indies on Tuesday, the droplets on his cheeks weren't sweat. He was very consciously holding back tears. \"I was fighting the tears a bit,\" the mercurial 28-year-old admitted afterwards on a day where his 115 was the difference between a decent and another unfulfilling day for the South Africans. \"It meant quite a lot to me, it's been a strange journey, so I'm just grateful that it worked out. It's always a bit more special [at SuperSport Park] when you reach milestones on your home ground because you know some friends and family are present too. \"There was a lot of relief too. That's what it boiled down to.\" Considered one of the local game's most prodigiously gifted stroke-makers, Markram has endured a painful two-year period in the red-ball format since a century against Pakistan in Rawalpindi back in February 2021, crafting only a single fifty in 15 subsequent innings and eventually being dropped for late last year's trip to Australia. READ | Markram makes his mark, but Windies fight back to even out first day against SA As it turned out, that snub against the Baggy Greens was a blessing in disguise. \"It might've been a good thing. It felt like I was on a clean slate. Things work out quite weirdly at times. Obviously, my heart was sore not being in Australia. I spoke to team management and they were quite clear on why I wasn't selected. I was happy with those reasons,\" said Markram. \"Batters need runs on the board and if you're not scoring for a team that wants to compete with the best in the world, then your position should be under scrutiny. It worked out nicely in hindsight.\" Markram batted with a rare assurance during his 174-ball stay at the crease, hardly offering anything to a Windies attack that eventually proved quite prone, something undoubtedly helped by new red-ball coach Shukri Conrad's unwavering faith in him. About a fortnight ago, Conrad had stated emphatically at the squad announcement that the former World Cup-winning national Under-19 captain would be returning to the top of the order. \"It does make a difference as a player, I've come quite a long way with the coach, so I have a good relationship and understanding with Shukri,\" said Markram. \"It's great when a coach backs you like that, it gives you an extra bit of confidence. You also want to do him justice for backing you like that. That's one of [Shukri's] biggest strengths. He's always very clear in his messaging and you'll know exactly where you stand with reasons provided. I'm grateful that he backs me.\" Armed with that backing, he sought to ensure he adopted the right approach to a wicket that sped up as the day progressed. \"I had some nice chats with the coaches and teammates. it's quite difficult to drive here on day one with the slow bounce. I've driven in the past and I'm sure in future I'll make that mistake again, but it's about understanding that at some stage, you can play a certain shot,\" said Markram. \"It's merely earning the right to do so. It wasn't a game plan, it was just about keeping it simple with what's in front of you.\"","pubDate":"2023-02-28 17:33:24","image_url":"https://scripts.24.co.za/img/sites/sport24.png","source_id":"news24","category":["sports"],"country":["south africa"],"language":"english"},{"title":"एडेन मार्करम का एक और पराक्रम, आईपीएल में कप्तानी मिलते ही चमक उठा सितारा","link":"https://navbharattimes.indiatimes.com/sports/cricket/iplt20/news/aiden-markram-blazing-century-against-west-indies-in-1st-test-another-feat-shone-got-ipl-captaincy-sunrise-hyderabad/articleshow/98314804.cms","keywords":null,"creator":null,"video_url":null,"description":"Aiden Markram: साउथ अफ्रीका क्रिकेट टीम के स्टार बल्लेबाज एडेन मार्करम ने वेस्टइंडीज के खिलाफ पहले टेस्ट मैच में धमाकेदार शतकीय पारी खेली। मार्करम इन दिनों अपने करियर के सबसे बेहतरीन दौर से गुजर रहे हैं। हाल ही में उन्हें इंडियन प्रीमियर लीग की फ्रेंचाइजी सनराइजर्स हैदराबाद का कप्तान नियुक्त किया गया है।","content":"साउथ अफ्रीका के स्टार ओपनर बल्लेबाज एडेन मार्करम के बल्ले से इन दिनों रन नहीं आग बरस रहे हैं। टी20 हो फिर टेस्ट क्रिकेट हर फॉर्मेट में उन्हें बल्ले से रन निकल रहा है। मार्करम ने वेस्टइंडीज के खिलाफ जारी पहले टेस्ट मैच में दमदार शतकीय पारी खेली है। उन्होंने 174 गेंद में 115 रन बनाए जिसमें 18 चौके शामिल रहे। उनके इस दमदार के खेल के कारण ही साउथ अफ्रीका की टीम ने अपनी पहली पारी में 8 विकेट के नुकसान पर 314 रन बना लिए हैं। एडेन मार्करम इन दिनों अपने करियर के सर्वश्रेष्ठ फॉर्म में हैं। हाल ही में उन्होंने साउथ अफ्रीका में खेले गए एसए टी20 लीग के फाइनल में विस्फोटक शतक लगाया था। इसके अलावा इंडियन प्रीमियर लीग 2023 के लिए भी मार्करम को एक बड़ी जिम्मेदारी मिली है। मार्करम ने पिछले कुछ समय से जिस तरह का भरोसा दिखाया उसी के कारण आईपीएल में उनकी फ्रेंचाइजी सनराइजर्स हैदराबाद ने उन्हें आगामी सीजन के लिए कप्तान नियुक्त किया है। ऐसे में अब देखना होगा कि क्या मार्करम सनराइजर्स को एसए लीग की तरह सफलता दिला पाते हैं या नहीं। सनराइजर्स हैदराबाद के लिए एडेन मार्करम केन विलियमसन की जगह लेगें। हालांकि इस सीजन में विलियमसन सनराइजर्स के लिए नहीं खेल रहे हैं। उनकी कप्तानी में टीम का प्रदर्शन काफी निराशाजनक रहा था। इससे पहले डेविड वॉर्नर टीम के कप्तान थे लेकिन सीजन के बीच में उन्हें कप्तानी से हटा दिया गया। हालांकि आईपीएल 2023 के लिए जब मार्करम को कप्तानी सौंपी गई थी कई लोगों को काफी हैरानी हुई थी क्योंकि टीम में मयंक अग्रवाल और भुवनेश्वर कुमार जैसे अनुभवी खिलाड़ी हैं लेकिन फ्रेंचाइजी ने एडन मार्करम पर अपना भरोसा दिखाया है। एडेन मार्करम को आईपीएल में खेलने का बहुत अधिक अनुभव नहीं रहा है। वह इस लीग में अब तक कुल 20 मुकाबले में मैदान पर उतरे हैं। इस दौरान 134.1 की स्ट्राइक रेट से 527 रन बनाए हैं। इस दौरान उन्होंने तीन अर्धशतकीय पारी खेली है। पिछले सीजन में मार्करम ने सनराइजर्स हैदराबाद के लिए दमदार प्रदर्शन किया। एक तरफ विलियमसन जैसे बड़े नाम फ्लॉप रहे थे तो मार्करम ने अपनी सधी हुई बल्लेबाजी से टीम का भरोसा जीता था। यही कारण है कि उन्हें टीम की कप्तानी सौंपी गई है।","pubDate":"2023-02-28 17:32:32","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"क्या खत्म हो गया बुमराह का करियर, IPL से भी बाहर, वर्ल्ड कप तक खेलना मुश्किल","link":"https://navbharattimes.indiatimes.com/sports/cricket/cricket-news/jasprit-bumrah-ruled-out-of-ipl-odi-world-cup-is-in-danger/articleshow/98314457.cms","keywords":null,"creator":null,"video_url":null,"description":"Jasprit Bumrah: भारतीय क्रिकेट टीम के स्टार तेज गेंदबाज जसप्रीत बुमराह चोट के कारण 8 महीने से मैदान पर नहीं उतरे हैं। तीन फॉर्मेट में अपनी धारदार गेंदबाजी का लोहा मनवा चुके बुमराह के लिए फिटनेस एक बड़ी समस्या बन चुकी है।","content":"तेज गेंदबाज जसप्रीत बुमराह पीठ की चोट से उबरने में नाकाम रहे हैं, जिसके कारण वह इंडियन प्रीमियर लीग (आईपीएल) में नहीं खेल पाएंगे और उनके अगले छह महीने तक वापसी की संभावना भी नहीं है। भारतीय क्रिकेट बोर्ड (बीसीसीआई) के एक सूत्र ने मंगलवार को पीटीआई को यह जानकारी दी। यह पता नहीं चल पाया कि पिछले साल ऑस्ट्रेलिया में खेले गए टी-20 विश्व कप में भी नहीं खेल पाने वाले इस तेज गेंदबाज की पीठ का ऑपरेशन करना होगा या नहीं। बुमराह को शुरू में टी-20 विश्व कप की टीम में चुना गया था। बीसीसीआई के सूत्र ने कहा, ‘बुमराह आईपीएल से बाहर हो गए हैं क्योंकि वह अगले छह महीने तक वापसी नहीं कर पाएंगे। यहां तक कि हो सकता है कि वह तब तक भी वापसी नहीं कर पाए। लक्ष्य वनडे विश्वकप है, लेकिन उनकी उस टूर्नामेंट में खेलने की भी गारंटी नहीं है।’ इसका मतलब है कि अगर भारत विश्व टेस्ट चैंपियनशिप के फाइनल में जगह बनाता है तो बुमराह उसमें भी नहीं खेल पाएंगे। विश्व टेस्ट चैंपियनशिप का फाइनल सात जून से ओवल में शुरू होगा। आईपीएल 31 मार्च से शुरू हो रहा है और बुमराह मुंबई इंडियंस के मुख्य तेज गेंदबाज है। वनडे विश्वकप अक्टूबर-नवंबर में भारत में खेला जाना है। 29 वर्षीय बुमराह ने 2022 में पांच टेस्ट, पांच वनडे और इतने ही टी-20 अंतरराष्ट्रीय क्रिकेट मैचों के अलावा मुंबई इंडियंस के लिए आईपीएल के मैच खेले थे। बुमराह के एक्शन के कारण उनकी पीठ पर काफी दबाव पड़ता है। वेस्टइंडीज के पूर्व तेज गेंदबाज माइकल होल्डिंग का मानना है कि बुमराह हमेशा पीठ दर्द से परेशान रह सकते हैं।","pubDate":"2023-02-28 17:09:55","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"}]}