{"newsArray":[{"title":"Pakistan confirms participation in NZ tri-series","link":"https://www.thenews.com.pk/print/969237-pakistan-confirms-participation-in-nz-tri-series","keywords":null,"creator":null,"video_url":null,"description":"ISLAMABAD: Pakistan Cricket Board chairman Ramiz Raja has confirmed the national cricket team’s participation in the tri-nation T20I series in New Zealand ahead of the October World Cup starting in Australia.In an exclusive online interview with a group of senior sports journalists ...","content":"ISLAMABAD: Pakistan Cricket Board (PCB) chairman Ramiz Raja has confirmed the national cricket team’s participation in the tri-nation T20I series in New Zealand ahead of the October World Cup starting in Australia. .ads_between_content{ height:auto; width:auto; clear: both; text-align: center; } .ads_between_content .story_ads{ } /*@media (max-width:600px){ .ads_between_content{ float:none; margin:0px auto; text-align: center; } }*/ In an exclusive online interview with a group of senior sports journalists (‘The News’ included) Saturday, Ramiz said that the PCB has given the go-ahead for the tri-nation series that also includes Bangladesh. “After receiving confirmation dates from the touring England side that is due here in Pakistan on September 15, we have confirmed our participation in the tri-nation series to be hosted by Cricket New Zealand. I wanted my team to play a few internationals more or less amid Australian environments, ahead of the World Cup. Now the team will be having a good opportunity to test their combination and leading players’ form during the tri-nation series in New Zealand,” he said. Pakistan is expected to leave for New Zealand on October 4 to figure in the double header series. The two top finishers will then go on to play the final. NZ Cricket is expected to announce the schedule soon. The PCB chairman has also decided to hire Matthew Hayden for the World Cup while batting coach Mohammad Yousaf will also accompany the team as the batting coach. Hayden will join the team in New Zealand. Saqlain Mushtaq will continue as the team head coach till the completion of his contract. “Saqlain will be there as head coach till the completion of one year. He possibly would not be in a position to continue following a one year stint more due to his domestic engagements and priorities,” Ramiz said. England has already confirmed arriving in Pakistan to play a seven-match T-20 series in Pakistan. Ramiz during his interaction with journalists also hinted that some leading venues--Lahore and Karachi might host matches. “We are sorry for Multan but the venue will be adjusted for the Test series coming up.” The PCB chairman had all praise for the Pakistan team’s performance in the recent past which now has started paying back. “Ever since we defeated India by ten wicket-the first ever win in the World Cup, our brand of cricket is being cherished around the world. We are getting a bigger response and with greater respect. That never happened in Pakistan cricket before.” He asserted that the impact of international cricket would be visible on domestic cricket. “The PCB top 100 programme is destined to bring fruit. We will hire foreign coaches for our domestic cricket for the very first time. The missing link between up-and-coming and top-level cricket will be filled with this new concept,” he said, adding that school cricket would be promoted at top level. Raja said he had never been that administrator who gets involved in the local politics. “I am not that sort of administrator who looks after his own interest by getting into petty politics.” Ramiz Raja said whatever plans he had initiated during the last eight months are backed by sponsorship. He said that he never had interfered with the selection. “Since we have achieved excellent results. I am not in favour of any changes in selection. Babar Azam is the more powerful captain and is a very important part of the selection.” Ramiz Raja admitted that a close series loss against Australia was sort of a reality check for the PCB. “These slow tracks are not serving our cricket in real terms. Since our forte is fast bowling, we have to look for those options where we can play to our strengths and also feel at ease while playing abroad. My intentions are to see Pakistan cricket at the top. The pitches we are playing are not good. It is impossible to carry drop-in pitches from Australia. We are however in the process of importing soil and specialist curators,” he said. On the future four-nation that is a brainchild of Ramiz Raja himself, he contemplated that his idea was more to bring the best teams including Pakistan and India back on cricketing grounds. On the Pakistan priorities in the forthcoming Future Tour Programme (FTP) starting from 2024 onward, the PCB chairman said he would be more interested in organising the tri-nation series. “Gone are the days when Boards used to play bilateral series. Tri-nation fetch you better results-both commercial and cricketing-wise.” About the question marks of his tenure since removal of PTI govt, Ramiz said that in Pakistan, every interest seeker thought that with the change of government, there should be change at the helm of PCB. “This concept has nothing to do with cricket promotion. I am there only to make necessary changes in an effort to make the system more professional and result-oriented,” he said. Ramiz aimed to spread cricket to all major cities of the country. “For that, we need a lease of leading grounds at leading centres. At the moment we do not have a lease of Multan, Faisalabad and Pindi Stadiums.” As a chairman, he said he wanted to go to top gear. “I believe you just require one year to achieve your targets but that is only possible when you get a timely response. When I was offered the slot, I refused to take over PCB for six months. But on my family’s insistence, I had to accept the responsibility for the better of Pakistan cricket,” he maintained.","pubDate":"2022-06-26 00:56:23","image_url":null,"source_id":"thenews","country":["pakistan"],"category":["sports"],"language":"english"},{"title":"SL names 18-man squad for Australia Test","link":"https://www.thenews.com.pk/print/969245-sl-names-18-man-squad-for-australia-test","keywords":null,"creator":null,"video_url":null,"description":"COLOMBO: Dimuth Karunaratne will lead Sri Lanka’s 18-man squad for the two-match Test series against Australia, which starts next week in Galle, the island nation’s cricket board said Saturday.The first Test starts on June 29 and the second will be from July 8, with both played next to...","content":"COLOMBO: Dimuth Karunaratne will lead Sri Lanka’s 18-man squad for the two-match Test series against Australia, which starts next week in Galle, the island nation’s cricket board said Saturday. .ads_between_content{ height:auto; width:auto; clear: both; text-align: center; } .ads_between_content .story_ads{ } /*@media (max-width:600px){ .ads_between_content{ float:none; margin:0px auto; text-align: center; } }*/ The first Test starts on June 29 and the second will be from July 8, with both played next to the southern city’s picturesque fort. The Australian tour of the island began earlier this month with three T20 matches, a series the tourists won 2-1. Sri Lanka squad: Dimuth Karunaratne (capt), Pathum Nissanka, Oshada Fernando, Angelo Mathews, Kusal Mendis, Dhananjaya de Silva, Kamindu Mendis, Niroshan Dickwella, Dinesh Chandimal, Ramesh Mendis, Chamika Karunaratne, Kasun Rajitha, Vishwa Fernando, Asitha Fernando, Dilshan Madushanka, Praveen Jayawickrama, Lasith Embuldeniya and Jeffrey Vandersay.","pubDate":"2022-06-26 00:56:23","image_url":null,"source_id":"thenews","country":["pakistan"],"category":["sports"],"language":"english"},{"title":"Team India Captain Rohit Sharma Tests Positive For COVID-19 In England","link":"https://sports.ndtv.com/cricket/rohit-sharma-team-india-captain-tests-positive-for-covid-19-in-england-3100912","keywords":null,"creator":null,"video_url":null,"description":"Indian cricket team captain Rohit Sharma has tested positive for COVID-19, just days before the start of the rearranged Test match against England.","content":"Indian cricket team captain Rohit Sharma has tested positive for COVID-19, just days before the start of the rearranged Test match against England. The Board of Control for Cricket in India (BCCI) informed through an official release and also posted the information on its Twitter handle. \" #TeamIndia Captain Mr Rohit Sharma has tested positive for COVID-19 following a Rapid Antigen Test (RAT) conducted on Saturday. He is currently in isolation at the team hotel and is under the care of the BCCI Medical Team,\" BCCI wrote on Twitter. UPDATE - #TeamIndia Captain Mr Rohit Sharma has tested positive for COVID-19 following a Rapid Antigen Test (RAT) conducted on Saturday. He is currently in isolation at the team hotel and is under the care of the BCCI Medical Team. Rohit Sharma was part of the team that is taking on Leicestershire in a 4-day tour game ahead of the decisive Test match against England, that will begin from July 1 at the Edgbaston in Birmingham. Rohit batted in the first innings on Thursday, but didn't come out to bat in India's second innings on Saturday. He scored 25 runs, before getting out in the first innings of the warm-up match. India leads the Test series against England 2-1. Rohit had earlier captained India to a 2-0 home Test series win over Sri Lanka this year. If he recovers in time for the match in Edgbaston, then it would be his first Test match as captain of the Indian team away from home. Virat Kohli-led India had taken a 2-1 lead against England last year but the fifth and final test had to be cancelled due to a Covid outbreak in the Indian camp. The BCCI and ECB decided to rearrange the remaining Test match this year. Promoted India will also play three T20Is and three ODIs on the tour apart from the Test match.","pubDate":"2022-06-25 22:21:07","image_url":"https://c.ndtvimg.com/2022-02/tfol9ng8_rohit-sharma-test-afp_625x300_20_February_22.jpg?im=FeatureCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"“Every Sri Lankan will remember this” - Dasun Shanaka responds to Aaron Finch’s post, thanks Australian cricket team","link":"https://www.sportskeeda.com/cricket/news-sl-vs-aus-2022-every-sri-lankan-will-remember-this-dasun-shanaka-responds-aaron-finch-s-post-thanks-australian-cricket-team?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Cricket"],"creator":["Renin Wilben Albert"],"video_url":null,"description":null,"content":null,"pubDate":"2022-06-25 19:15:53","image_url":"https://static.sportskeeda.com/editor/2022/06/98c24-16561812437763-1920.jpg","source_id":"sportskeeda","country":["india"],"category":["sports"],"language":"english"},{"title":"BCCI ties up with Australian S&C Association to create pool of trainers","link":"https://kashmirreader.com/2022/06/26/bcci-ties-up-with-australian-sc-association-to-create-pool-of-trainers/","keywords":["SPORTS"],"creator":["Press Trust of India"],"video_url":null,"description":"BENGALURU: In its bid to create uniformity in training system across ranks, the BCCI has joined hands with Australian Strength & Conditioning Association (ASCA) to create a pool of world class trainers (S&C coaches) in the country. Recently, the BCCI has formed its Sports Science section at the National Cricket Academy, which is being headed […]","content":"BENGALURU: In its bid to create uniformity in training system across ranks, the BCCI has joined hands with Australian Strength & Conditioning Association (ASCA) to create a pool of world class trainers (S&C coaches) in the country. Recently, the BCCI has formed its Sports Science section at the National Cricket Academy, which is being headed by former national team head physio Dr Nitin Patel. They have now come up with the concept of creating a programme that will “increase the knowledge base of fitness trainers across all levels in BCCI.” The concept note that the BCCI shared with state unit trainers, which is in possession of PTI, it is understood that the idea is to ensure that from U-19 (men and women) to senior state teams and subsequently national teams, the same training module is to be followed by the teams. “Often, we see that at the state level, the Strength and Conditioning training is completely different from what is there at India U-19, A or senior teams. This course will create enough S&C coaches, who can then follow the curriculum at the state level also,” a former India A trainer, aware about developments, told PTI on conditions of anonymity. He then cited how some of the state teams have completely different ideas of S&C training from what the national team or NCA follows. “Let me give you an example of this Ranji season. The BCCI had sent a note to all state teams that YoYo test (aerobic endurance fitness test) and 2k run, which were earlier used as fitness parameters are no longer mandatory as full season post-COVID is starting and we don’t know about lung capacity of players. “Still at DDCA, Rajkumar Sharma and his coaching staff used YoYo as a parameter to decide who are eligible candidates when the world is acknowledging that it is not a parameter to judge cricketing fitness,” he said. The idea is to have such a training programme where there is less interference from old-school coaches across some state teams, whose idea of S&C training is still archaic. As per BCCI-ASCA tie-up, it will be a three-year course with Year-1 being ‘Cricket Specific S&C Beginner Program’ followed by Year-2 which will have ‘Cricket Specific S&C Intermediate Program’ and the final Year-3 will have ‘Cricket Specific S&C Advanced Program’. As per the program requirement, 114 candidates (potential S&C trainers) across 38 affiliated units will be undergoing the course along with six miscellaneous candidates, making it a total of 120 candidates. “Two male S&C coaches and 1 female coach per BCCI affiliated units will attend the program for a ‘Year Round Mentoring via the NCA Central Team’. 114 candidates will be taught by six professionals and it starts in July with a 2-day Hybrid Programme,” a BCCI source informed. It is understood that during the on-site programme, 20 state S&C coaches will be mentored by one NCA central team S&C coach. Thus 120 candidates will have six such coaches. “The plan is to have a year-round mentorship so that we have a robust group of S&C coaches in both men and women’s set-up,” the source said. PTI Press Trust of Indiakashmirreader.com","pubDate":"2022-06-25 18:54:19","image_url":null,"source_id":"kashmirreader","country":["india"],"category":["sports"],"language":"english"},{"title":"Hardik relishes captaincy, says it brings out best in him","link":"https://kashmirreader.com/2022/06/26/hardik-relishes-captaincy-says-it-brings-out-best-in-him/","keywords":["SPORTS"],"creator":["Press Trust of India"],"video_url":null,"description":"Malahide (Ireland: He struck gold in his debut season as captain in the IPL, and Hardik Pandya admits that responsibility brings out the best in him on a cricket field. Hardik, who led the Gujarat Titans to the IPL title in the side’s and his debut season earlier this year, has been named as captain […]","content":"Malahide (Ireland: He struck gold in his debut season as captain in the IPL, and Hardik Pandya admits that responsibility brings out the best in him on a cricket field. Hardik, who led the Gujarat Titans to the IPL title in the side’s and his debut season earlier this year, has been named as captain of the Indian team for the two-match T20 International series against Ireland, starting here on Sunday. And the dashing all-rounder said he believes in taking ownership on the field. “Earlier also, I liked taking up responsibility and now also it is the same but it is a bit more responsibility now. I always believed that I did better when I took responsibility,” Hardik said during a virtual press conference on the eve of the first T20I. “If I can take ownership of my own things and take my own decisions, they tend to be strong. Cricket is such a game, staying strong during situations is very important. “Always responsibility was given to me and I took it and that’s why I became better. While captaining I will see how I can give the same responsibility to every player and give them the ability to fight with situations,” he added. Playing under two talismanic skippers in Mahendra Singh Dhoni and Virat Kohli has taught Hardik a lot about leadership qualities, but he said every captain has their own style. “Obviously I have taken a lot of things from them (Dhoni and Kohli) but at the same time I also want to be myself, obviously my understanding of the game is different but I have taken a lot of good vibes from them. “I am not instinctive but I see more situation than go on my gut. At what point of time, what decision the team requires, I focus on that rather than going on my gut. Gut always goes 50-50,” he said. “I have got an opportunity to lead India. It’s in itself a big thing. I don’t play the sport to show anyone anything, if I am good enough. I was always the same.” India has bench strength now India is fielding its reserve players in the series against Ireland and Hardik said the bench strength India possesses now is a good sign for the game in the country. “If such a situation arises that we have to send two teams, we are very lucky that we have the bench strength where we can allow the players to go and express and a lot of people will get opportunities. “There are so much talent in India that people don’t get opportunities. Playing for India is always a dream and for them to achieve that dream will be really fantastic,” he said. “The way talent has come up and the character the players have shown and the way we played, it indicates India’s bench strength. There are plenty of options right now in Indian team. Four people are still fighting for places in the team. They are knocking the doors, so it can be better than that.” Won’t take Ireland lightly Despite fielding a second string side against Ireland, Hardik said they would approach the short series the same way they play in a big tournament. “It’s a challenge mentally, it is easier to say that we are playing against Ireland but playing for India is the biggest pride. If we want to win the World Cup, every match from here is important for us to reach the World Cup final. The first thing I said to all is that it doesn’t matter whom we are playing, we need to focus on our own things,” he stressed. “We keep the same intensity we generally keep even if we are playing the World Cup or a big series. Again it comes down to mental strength, how better you can get because it’s not easy in two matches getting yourself on but at the same time we are playing for India and we have to be on our A game which we will. “The discussion between me and the coach is simple — approach the game as you do in any other game for India.” Hardik also said that the team management might give opportunities to some young players, but not at the cost of a strong playing XI. “We want to give opportunities but at the same time we want to play with our best XI. So there will be a couple of caps given but at the same time it is about making sure that when we go on the field we have the best XI.” —PTI Press Trust of Indiakashmirreader.com","pubDate":"2022-06-25 18:53:26","image_url":null,"source_id":"kashmirreader","country":["india"],"category":["sports"],"language":"english"},{"title":"England take charge of Third Test after Jonny Bairstow’s heroic 162 and three late wickets as New Zealand face whitewash","link":"https://www.thesun.co.uk/sport/19001890/england-new-zealand-third-test-jonny-bairstow-wickets/","keywords":["Cricket","Sport"],"creator":["John Etheridge"],"video_url":null,"description":"BEN STOKES, Joe Root and Jonny Bairstow were waving their arms like orchestra conductors and England’s bowlers were playing a sweet tune. The trio of players were trying – and succeeding – to rouse the crowd as they sensed blood on day three of the Third Test. Spectators responded with roars of noise and encouragement […]","content":"BEN STOKES, Joe Root and Jonny Bairstow were waving their arms like orchestra conductors and England's bowlers were playing a sweet tune. The trio of players were trying – and succeeding – to rouse the crowd as they sensed blood on day three of the Third Test . Spectators responded with roars of noise and encouragement while Matthew Potts, Jack Leach and Root himself did the business with the ball. Following a rain delay in the evening session, England captured three wickets for nine runs in seven overs and transformed the match. When the weather interrupted for a second and final time, New Zealand were 168-5 in their second innings and sitting on a fragile lead of 137 runs. Stokes, Root and Bairstow might never be regarded as Andre Previn, Simon Rattle or Herbert von Karajan, but their animated gestures cranked up the atmosphere and the thirsty gang on the Western Terrace loved it. As if he hadn’t done enough with the bat - scoring a brilliant 162 from 157 balls - Bairstow was keeping wicket because Ben Foakes was suffering from a stiff back. He held a couple of catches, too. When the experienced duo of Tom Latham and Kane Williamson were chugging along and New Zealand reached 125-1, England looked likely to face a stiff fourth innings chase. But Latham was caught behind off Jamie Overton from the first ball after tea and, following the rain break, Root began the burst of three wickets. Root was bowling only because, with the light worsening and the rain approaching, the umpires insisted England could not use their quicks. So Stokes turned to Root’s off-spin and he sent down three balls before the rain arrived. FREE BETS AND SIGN UP DEALS - BEST NEW CUSTOMER OFFERS When play resumed 20 minutes later, Root had to finish his over and, from his very first ball, Ollie Pope at short leg swooped and held a fine left-handed catch to remove Devon Conway. Root was taken off and, in his first over of a new spell, Potts had Williamson caught behind – the third time in four innings in the series that the Durham bowler has dismissed the Kiwi captain. Potts has been a big plus for England, impressing with his accuracy, skill and stamina. Then Jack Leach, again in the opening over of a new spell, caught and bowled Henry Nicholls, a more orthodox dismissal than Leach’s against Nicholls in the first innings, when he was held at mid-off via non-striker Daryl Mitchell’s bat. The prolific Mitchell and Tom Blundell will resume Sunday but England fancy their chances of completing a 3-0 series whitewash. In the morning, Overton added eight to his overnight score but he needed eleven to reach a remarkable debut century. He was caught at slip off Trent Boult for 97, a fantastic effort for a man chosen mainly as a bowler and coming in at 55-6. The partnership between Bairstow and Overton eventually finished at 241 from 46 overs, a truly astounding performance. But the big shots were not finished. Stuart Broad, who loves waving his willow, struck 42 from 36 deliveries before being bowled by Tim Southee. Bairstow’s epic innings came to an end when he was caught at long-off. He joined Ben Stokes and Sir Ian Botham as the only England batsmen to score two Test centuries at better than a run-a-ball. Leach was last man out, lbw to Southee, and England had a first innings lead of 31. Half-an-hour before tea on Friday, they looked likely to concede a deficit of close to 200 runs. New Zealand were still behind when Will Young could not resist driving at a ball from Potts and the edge ended in Pope’s hands at third slip. Latham and Williamson have been short of runs in this series but Latham excelled with clips through mid-wicket. On 72, he was badly dropped by Root at slip off Broad and Root was furious, screaming “no” and pounding the turf. It was not too expensive, however, because Latham edged the first ball after tea from Overton and Bairstow held the catch. Next ball, Overton thundered a bouncer into the helmet of Conway, who rolled onto his back and needed to convince the team doctor that he did not have concussion. After a lengthy delay, Overton’s next delivery struck Conway in the solar plexus. Then came an edge for four. This was impressive, aggressive bowling by Overton. Then rain arrived, play resumed, the crowd greeted every ball with a crescendo and three more wickets fell. England are on top now.","pubDate":"2022-06-25 18:07:45","image_url":null,"source_id":"thesun","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"IND vs IRE: Ahead of T20I matches, Hardik Pandya says captaincy brings out best in him","link":"https://www.indiatvnews.com/sports/cricket/ind-vs-ire-ahead-of-t20i-matches-hardik-pandya-says-captaincy-brings-out-best-in-him-india-vs-ireland-2022-06-25-787389","keywords":null,"creator":null,"video_url":null,"description":"Hardik Pandya has admitted that the responsibility of leading a team brings out the best in him on a cricket field after he was named skipper of Gujarat Titans in their debut season of IPL.","content":null,"pubDate":"2022-06-25 18:06:46","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"When is India vs Ireland 2022: IND vs IRE T20 schedule and fixtures","link":"https://thesportsrush.com/cricket-news-when-is-india-vs-ireland-2022-ind-vs-ire-t20-schedule-and-fixtures/","keywords":["Cricket","India","India tour of Ireland 2022","Ireland"],"creator":["Dixit Bhargav"],"video_url":null,"description":"India vs Ireland 2022: The Indian cricket team’s next assignment lies in the form of their third tour of Ireland. Currently playing a practice match against Leicestershire in Leicester, the Indian Test squad won’t be the first to be playing an international match. Such is the tight scheduling these days that the Indian T20I squad… The post When is India vs Ireland 2022: IND vs IRE T20 schedule and fixtures appeared first on The SportsRush.","content":"India vs Ireland 2022: The Indian cricket team’s next assignment lies in the form of their third tour of Ireland. Currently playing a practice match against Leicestershire in Leicester, the Indian Test squad won’t be the first to be playing an international match. Such is the tight scheduling these days that the Indian T20I squad will be playing a two-match T20I series against Ireland before the Test squad takes on England for a one-off Test next month. In what is only India’s third tour of Ireland, they won’t be led by regular captain Rohit Sharma as he’s leading the Test squad in the neighboring country. Hardik Pandya, who has most recently led Gujarat Titans to an Indian Premier League 2022 title , has been named the T20I captain. Just like IPL 2022 was the first time when Pandya had led in T20s, the imminent series is going to be his first international assignment as a captain. India, who have a hectic international season ahead of them comprising of home and away multi-format series, will have no option than to continue fielding separate teams for separate formats. Set to play first of their two T20Is against Ireland tomorrow, India will be playing these matches within a three-day period. With an ICC T20 World Cup to be played in away conditions, India would want to make the most of this opportunity of playing two away T20Is albeit in different conditions. When teacher says pin drop silence and one guy in the group makes a funny noise 🤣 (You know who that guy is) 😅 pic.twitter.com/iEICEnw2Oc — Surya Kumar Yadav (@surya_14kumar) June 25, 2022 India, who had batted first in both their T20Is in Ireland four years ago, had managed to register comprehensive victories on both occasions. Not touring with a first-choice squad in 2022, it will be interesting to see if Pandya and his men are able to whitewash the Irish this time around or not. June 26 – 1st T20I, Ireland vs India in Dublin at 09:00 PM (IST) June 28 – 2nd T20I, Ireland vs India in Dublin at 09:00 PM (IST)","pubDate":"2022-06-25 18:04:57","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"World of Cricket: Pujara back in India squad","link":"https://sportstar.thehindu.com/magazine/world-of-cricket-pujara-back-in-india-squad-jim-parks-monimum-haque/article38506284.ece","keywords":null,"creator":["Abhishek Mukherjee"],"video_url":null,"description":"The fifth Test against England, to be played in Edgbaston, Birmingham, from July 1-5, will conclude the unfinished rubber of 2021 which was postponed due to fears of a COVID-19 outbreak.","content":"Batter Cheteshwar Pujara has returned to the Indian Test squad for the pending fifth Test against England. After a prolonged run-drought, Pujara was dropped for the two-Test series against Sri Lanka in March. He had tasted success in Ranji Trophy but it was in the U.K., in the County Championship, that he made a strong case for a return, hitting a purple patch for Sussex. He scored four centuries in four first-class matches, including two double centuries, for a tally of 720 runs. The fifth Test against England, to be played in Edgbaston, Birmingham, from July 1-5, will conclude the unfinished rubber of 2021 when the Indian team took a 2-1 series lead but couldn’t play the final match due to fears of a COVID-19 outbreak. Rohit Sharma, Virat Kohli and Jasprit Bumrah were rested for the T20 series against Sri Lanka but will return for the tour of England. Wriddhiman Saha not to play for Bengal The last few months or so have been a bit turbulent for Wriddhiman Saha. Now he has taken umbrage to comments by a senior official of the Cricket Association of Bengal and has made up his mind not to ply his trade for the State this season. A senior official questioned his commitment for the Bengal team after he pulled out of the knockout rounds of the Ranji Trophy to be played this month. “I is a very sad feeling that I have to go through something like this after playing for Bengal for so long. It is disappointing that people make such comments and question your integrity. As a player, I had never faced such a thing in the past, but now that it has happened, even I need to (move on),” the 37-year-old said. Saha said he had spoken to quite a few people from several State teams but was yet to zero in on a particular team. Mominul Haque steps down as Bangladesh captain, Shakib to take over Batter Mominul Haque stepped down as Test captain of Bangladesh soon after its 1-0 defeat by Sri Lanka in the two-match series at home. Shakib-Al-Hasan has been handed the role and batter Litton Das appointed as his deputy. This won’t be Shakib’s first stint as Bangladesh captain. He served as captain for a few Test matches between 2009 and 2011, and then had a two-year stint in 2017. Mominul hasn’t had the best of runs with the bat of late, and says he wanted to be unburdened of captaincy responsibilities to focus on his batting. This year, he has scored just 162 runs in six Tests. Former cricketers Jim Parks, David Holford no more Former England wicketkeeper Jim Parks passed away aged 90, on May 31. Parks was England’s oldest living male Test cricketer, having played 46 Tests between 1954 and 1958. Parks passed away in the hospital after suffering a fall at his home. Parks was a stalwart for Sussex, scoring more than 36,000 first-class runs in 739 matches. He took 1087 catches and effected 94 stumpings. In Test matches, he scored 1962 runs at an average of 32.16. David Holford, an all-rounder, died aged 82 in Barbados. Holford was a leg-spinner and a lower middle-order batter who played 24 Tests for West Indies between 1966 and 1977. He scored 768 runs and picked up 51 wickets.","pubDate":"2022-06-25 17:34:36","image_url":null,"source_id":"sportstar","country":["india"],"category":["sports"],"language":"english"},{"title":"India clinch series with 5-wkt win over Lanka","link":"https://www.thehansindia.com/sports/cricket/india-clinch-series-with-5-wkt-win-over-lanka-750492","keywords":["Sports,Today NewsPaper,Cricket"],"creator":["The Hans India"],"video_url":null,"description":"Visitors take 2-0 unassailable lead in three-match Women’s T20I series","content":"Indian bowler Pooja Vastrakar celebrates with teammates after the wicket of Sri Lankan batter Chamari Athapaththu, during the 2nd T20 at Rangiri Dambulla International Cricket Stadium, in Dambulla, Sri Lanka on Saturday Dambulla: A brilliant comeback from the bowlers in the first innings followed by a smashing start by the top order batters helped India Women beat Sri Lanka by five wickets in the second T20I and take an unassailable 2-0 lead in the three-match series, here on Saturday. It was India's 12th T20I win in a row against Sri Lanka Women, which started in February, 2016. After winning the toss and opting to bat first, Openers laid a solid foundation for Sri Lanka. Vishmi Gunaratne set the tone with three boundaries in two overs while Chamari Athapaththu smashed a six and a four in the last over of the Powerplay. Despite not picking up a wicket in the first six overs, Indian bowlers managed to sneak in a few dot balls as Sri Lanka went a little over run-a-ball. The hosts openers kept finding the boundary at regular intervals but couldn't rotate the strike as well as they would have liked. Athapaththu was given a lifeline when India dropped her at the stroke of the halfway mark. She made the visitors pay by striking two boundaries each in the next two overs. Just after the pair surpassed the record for the highest first-wicket partnership for Sri Lanka in Women's T20I, Pooja Vastrakar broke the 87-run stand as Athapaththu's flick went straight into the hands of Radha Yadav at deep square leg. The wicket of the skipper set the cat amongst the pigeons as the rest of the batters failed to capitalise on the tremendous start provided by the openers. Like her opening partner, Vishmi Gunaratne too departed in her 40s. Deepti Sharma, who had gone for 30 runs in her first three overs, made up with the wickets of Harshitha Samarawickrama and Nilakshi de Silva in the 18th over. The last two overs fetched 15 runs but Sri Lanka fell well short of a strong total, finishing their innings at 125/7. Chasing a modest 126 for the win, India openers looked to kill the game as early as possible. Smriti Mandhana made her intent clear by smashing the first ball of the innings for a four while Shafali Verma wasn't going to be left behind as she plundered two fours and a six in her cameo of 17 runs that came in 10 balls. Sabbhineni Meghana carried on from where Shafali left off, smashing Udeshika Prabodhani for four boundaries in an over. Though she fell in the last over of the Powerplay, India sat comfortably in their chase at 52/2. The end of the fielding restrictions had little effect on Mandhana's approach, as she collected five fours in the next five overs to take Sri Lanka completely out of the game. The boundary-laden knock came to an end when she was stumped off the bowling of Inoka Ranaweera. The wicket came a little too late for Sri Lanka, with India needing less than five runs an over at that point. Jemimah Rodrigues couldn't replicate her heroics from the first game and went back for just 3. It did get a little too close for comfort towards the end, with India needing 15 off the last three overs but Harmanpreet Kaur (31 not out off 32) batted through to guide India to a win with five wickets and balls to spare. Brief scores: Sri Lanka Women 125-7 in 20 Overs (Vishmi Gunaratne 45, Chamari Athapaththu 43; Deepti Sharma 2/34) lost to India Women 127-5 in 19.1 Overs (Smriti Mandhana 39, Harmanpreet Kaur 31 not out; Inoka Ranaweera 2/18 ) by 5 wickets.","pubDate":"2022-06-25 17:31:02","image_url":"https://assets.thehansindia.com/h-upload/2022/06/25/500x300_1299570-cricket.jpg","source_id":"thehansindia","country":["india"],"category":["sports"],"language":"english"},{"title":"Kohli's career took off due to Dhoni, but seniors in Pakistan can't see others succeed: Ahmed Shehzad","link":"https://www.indiatvnews.com/sports/cricket/kohli-s-career-took-off-due-to-dhoni-but-seniors-in-pakistan-can-t-see-others-succeed-says-batsman-ahmed-shehzad-2022-06-25-787381","keywords":null,"creator":null,"video_url":null,"description":"Out of favour batsman Ahmed Shehzad, in conversation with Cricket Pakistan, came out all guns blazing against the toxic culture in the Pakistan Cricket Team.","content":"Out of favour batsman Ahmed Shehzad, in conversation with Cricket Pakistan, came out all guns blazing against the toxic culture in the Pakistan Cricket Team. He gave the example of how 's career took off due to and compared it to Pakistan, stating that people there can't stand each other's success. “I have said this before, Kohli’s career picked off because he found Dhoni, but unfortunately, here in Pakistan, your people cannot stand your success.\" He further went on to say that the senior players in Pakistan cannot digest seeing someone else succeed. \"Our senior players and ex-cricketers cannot digest seeing someone succeed in the cricketing world, which is unfortunate for Pakistan cricket.” Talking about his axing from the national team, Shehzad said that he was deeply hurt when the then coach Waqar Younis axed him and Umran Malik from the team, stating that they needed to play domestic cricket and work on their game. \"I have not seen the report myself, but a PCB official told me that these remarks have been said regarding me. But I believe that these things should be discussed face-to-face, and I am ready to take on that challenge. Then we will see who is right and who is wrong.\" Ahmed minced no words as he went on to say that those words hurt his career and he wasn't even allowed to present his case. \"Their words hurt my career, especially since I was not allowed to present my case. This was a pre-planned approach, and they wanted to kill two birds with one stone.\"","pubDate":"2022-06-25 17:29:50","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"England vs New Zealand LIVE: Cricket score and updates as rain delays third Test - The Independent","link":"https://news.google.com/__i/rss/rd/articles/CBMiZ2h0dHBzOi8vd3d3LmluZGVwZW5kZW50LmNvLnVrL3Nwb3J0L2NyaWNrZXQvZW5nbGFuZC1uZXctemVhbGFuZC1saXZlLXN0cmVhbS1zY29yZS11cGRhdGVzLWIyMTA4NzMwLmh0bWzSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"England vs New Zealand LIVE: Cricket score and updates as rain delays third Test  The IndependentBairstow’s thrilling knock keeps England in touch with New Zealand  The GuardianEngland's Headingley heroics deliver where Trent Bridge couldn't as Jonny Bairstow again stars  Sky SportsNASSER HUSSAIN: England cannot risk driving at King of Swing Trent Boult  Daily MailCenturion Bairstow insists ‘this is the way I’ve always been capable of playing’  The GuardianView Full coverage on Google News","content":null,"pubDate":"2022-06-25 16:08:37","image_url":null,"source_id":"google","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Dublin cricket stadium pitch report: India vs Ireland 1st T20 Malahide pitch report batting or bowling","link":"https://thesportsrush.com/cricket-news-dublin-cricket-stadium-pitch-report-india-vs-ireland-1st-t20-malahide-pitch-report-batting-or-bowling/","keywords":["Cricket","Dublin cricket stadium pitch report","IRE vs IND pitch report","Malahide Stadium pitch report"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"Dublin cricket stadium pitch report: The SportsRush brings you the pitch report of the first T20I between Ireland and India in Dublin. Ireland will take on India in the first T20I of the two-match T20I series at the Malahide Stadium in Dublin on 26 June 2022. Both teams would want to start the series on… The post Dublin cricket stadium pitch report: India vs Ireland 1st T20 Malahide pitch report batting or bowling appeared first on The SportsRush.","content":"Dublin cricket stadium pitch report: The SportsRush brings you the pitch report of the first T20I between Ireland and India in Dublin. Ireland will take on India in the first T20I of the two-match T20I series at the Malahide Stadium in Dublin on 26 June 2022. Both teams would want to start the series on a winning note. Team India is without their star players, who are with the test squad in England. Hardik Pandya has been named the captain of the side, whereas Bhuvneshwar Kumar is his deputy. For Ireland, the experienced duo of Paul Stirling and Andrew Balbirnie will play a huge part. The bowlers of the Irish side have done well lately. The Malahide Stadium in Dublin is a brilliant track to bat on with an assist to the bowlers as well. There is a moment for the pacers in the initial overs of the match as a fresh wicket will be used here. Although, in terms of wicket-taking, the spinners have done a great job here. After settling down, the batters can play their shots as there is an even bounce on the pitch. A total of 19 T20I have been played at this ground, where five of them got cancelled or abandoned due to bad weather or other reasons. Out of those 14 matches, 8 matches have been won by the chasing teams, and 6 games have been won by the teams batting first. Snapshots from #TeamIndia ‘s training session at the Malahide Cricket Club, Ireland. 📸📸 pic.twitter.com/V74muBG62K — BCCI (@BCCI) June 25, 2022 The last T20I match at this ground was played between South Africa and Ireland in July 2021, where the spin bowlers of South Africa did a great job. Team India will play with Axar Patel and Yuzvendra Chahal, whereas Ireland will have Andy McBrine and George Dockrell in their ranks. There will be overcast conditions throughout the match, and the rain can certainly hamper the proceedings in between. Both teams would want to chase after winning the toss keeping the DLS in mind.","pubDate":"2022-06-25 14:31:32","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Sri Lanka Name 18-Man Squad For Australia Test Series","link":"https://sports.ndtv.com/cricket/sri-lanka-name-18-man-squad-for-australia-test-series-3100202","keywords":null,"creator":null,"video_url":null,"description":"Dimuth Karunaratne will lead Sri Lanka's 18-man squad for the two-match Test series against Australia, which starts next week in Galle, the island nation's cricket board said Saturday","content":"Dimuth Karunaratne will lead Sri Lanka's 18-man squad for the two-match Test series against Australia, which starts next week in Galle, the island nation's cricket board said Saturday. The first Test starts on June 29 and the second will be from July 8, with both played next to the southern city's picturesque fort. The Australian tour of the island began earlier this month with three T20 matches, a series the tourists won 2-1. A five-match ODI series was won by the hosts 3-2. Promoted Sri Lanka squad: Dimuth Karunaratne (capt), Pathum Nissanka , Oshada Fernando, Angelo Mathews , Kusal Mendis , Dhananjaya de Silva , Kamindu Mendis , Niroshan Dickwella , Dinesh Chandimal , Ramesh Mendis , Chamika Karunaratne, Kasun Rajitha, Vishwa Fernando, Asitha Fernando , Dilshan Madushanka , Praveen Jayawickrama , Lasith Embuldeniya and Jeffrey Vandersay . (This story has not been edited by NDTV staff and is auto-generated from a syndicated feed.)","pubDate":"2022-06-25 14:20:48","image_url":"https://c.ndtvimg.com/2022-03/c3lb47bg_dimuth-karunaratne_650x400_14_March_22.jpg?im=FeatureCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Hardik Pandya as India captain... \"Why not?\" says former chairman of selectors, Vengsarkar","link":"https://sportstar.thehindu.com/cricket/indian/hardik-pandya-as-india-captain-approved-by-dilip-vengsarkar-roger-binny-india-1983-world-cup-opus/article38506197.ece","keywords":null,"creator":["Amol Karhadkar"],"video_url":null,"description":"Dilip Vengsarkar and Roger Binny, members of India's victorious 1983 World Cup squad, gave thumbs up for Hardik Pandya to be explored as India's captain in limited overs cricket.","content":"Former India captain Dilip Vengsarkar and former India allrounder Roger Binny have given thumbs up for Hardik Pandya to be explored as India's captain in limited overs cricket. \"Why not? There is an option and it depends on the selectors. They’re watching cricket and depends on their vision and plans,\" Vengsarkar said here on Saturday. \"The way he came back from injury is great. He must have worked very hard on his fitness. He did very well in the IPL and as a captain he did well. He came into bat at the fall of two wickets. He led from the front. He guided the team very well in his first major tournament as captain. Allrounder plays an important role in the team.\" CHAMPIONS This is for all the hard work we’ve put in! Congratulations to all the players, staff, fans ❤❤❤ @gujarat_titans pic.twitter.com/zEeqdygBEy Binny, who has also been a national selector, did not see an issue with a bowling allrounder leading the side. \"Kapil Dev led the side in the WC and led from the front. We had a captain who we all looked up to and motivated everybody with the bat, bowl and on the front. That’s what you need. It doesn’t matter, you can have even a bowler captain. He’s got to lead from the front. Sometimes you tend to overbowl or underbnowl yourself – lot of times as a captain you do that. But then you have other players in the side to advise,\" Binny said. RELATED | 75 years of independence, 75 iconic moments from Indian sports: No. 25 - Kapil Dev's India lifts the 1983 World Cup \"You have to keep performing. When you get the post of captain/vice-captain, you have got to lead from the front and got to be consistently playing. He’s got to watch the injuries because he tends to be under the weather. So that’ll be utmost on his mind and also in the minds of the selectors and those watching.\" Vengsarkar and Binny, members of India's victorious 1983 World Cup squad, spoke on the sidelines of the release of \"The 1983 World Cup Opus\", a coffee table book. The book was released on Saturday, the 39th anniversary of the 1983 final, with a majority of squad members in attendance.","pubDate":"2022-06-25 13:55:43","image_url":null,"source_id":"sportstar","country":["india"],"category":["sports"],"language":"english"},{"title":"IND-W vs SL-W: Harmanpreet leads India to series win over Sri Lanka","link":"https://telanganatoday.com/ind-w-vs-sl-w-harmanpreet-leads-india-to-series-win-over-sri-lanka","keywords":["Cricket","News","Sport","Harmanpreet Kaur","India","Smriti Mandhana","Sri Lanka"],"creator":["PTI"],"video_url":null,"description":"Dambulla: Skipper Harmanpreet Kaur contributed with both bat and ball to steer the Indian women’s cricket team to a series sealing five-wicket win over Sri Lanka in the second T20 here on Saturday. Vice-captain Smriti Mandhana’s (39 off 34 balls) experience complemented by the exuberance of both Shefali Verma (17 off 10 balls) and Sabbhineni […]","content":"Dambulla: Skipper Harmanpreet Kaur contributed with both bat and ball to steer the Indian women’s cricket team to a series sealing five-wicket win over Sri Lanka in the second T20 here on Saturday. Vice-captain Smriti Mandhana’s (39 off 34 balls) experience complemented by the exuberance of both Shefali Verma (17 off 10 balls) and Sabbhineni Meghana (17 off 10 balls) helped India chase down the 126-run target in 19.1 overs. India stuttered in what should have been a comfortable run chase before Harmanpreet took India home with an unbeaten 31 of 32 balls. Sri Lanka squandered a fine start to post a below par 125 for seven. The third and final T20 will be played here on Monday. It was a day to remember for Mandhana who became the second fastest Indian woman to reach 2,000 runs T20 runs. Mandhana reached the feat in her 84th innings, becoming the third Indian woman after the legendary Mithali Raj (70 innings) and current skipper Harmanpreet Kaur (88 innings) to cross the mark. Opting to bat first and with the series on line, it was the duo of captain Chamari Athapaththu (43 off 41 balls) and Vishmi Gunaratne (45 off 50 balls) provided an ideal start for the Lankans by taking the Indian bowlers to the cleaners. The duo also put up Sri Lanka’s best opening stand (87) in T20s to leave the Indians frantically rummaging for breakthroughs. However, as both Athapaththu and Gunaratne departed, it was a sorry state of affairs for Sri Lanka as they lost a slew of wickets, only managing an underwhelming total. Deepti Sharma (2/34 in 4 overs) was certainly the best bowler on view while the likes of Radha Yadav and Pooja Vastrakar also helped India claw back with the ball. Brief Scores: Sri Lanka 125/7 in 20 overs (Vishmi Gunaratne 45, Chamari Athapaththu 43; Deepti Sharma 2/34) lost to India 127/5 in 19.1 overs (Smriti Mandhana 39, Harmanpreet Kaur 31; Oshadi Ranasinghe 2/32).","pubDate":"2022-06-25 13:21:04","image_url":null,"source_id":"telanganatoday","country":["india"],"category":["sports"],"language":"english"},{"title":"Harmanpreet stars as clinical India seal T20I series | Cricbuzz.com - Cricbuzz - Cricbuzz","link":"https://news.google.com/__i/rss/rd/articles/CBMibWh0dHBzOi8vd3d3LmNyaWNidXp6LmNvbS9jcmlja2V0LW5ld3MvMTIyODAxL2hhcm1hbnByZWV0LXN0YXJzLWFzLWNsaW5pY2FsLWluZGlhLXNlYWwtdDIwaS1zZXJpZXMtY3JpY2J1enpjb23SAW5odHRwOi8vbS5jcmljYnV6ei5jb20vYW1wL2NyaWNrZXQtbmV3cy8xMjI4MDEvaGFybWFucHJlZXQtc3RhcnMtYXMtY2xpbmljYWwtaW5kaWEtc2VhbC10MjBpLXNlcmllcy1jcmljYnV6emNvbQ?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Harmanpreet stars as clinical India seal T20I series | Cricbuzz.com - Cricbuzz  CricbuzzIndia Women vs Sri Lanka Women Live Streaming Details- When And Where To Watch Sri Lanka Women vs India Women In Your Country? India Women Tour of Sri Lanka 2022, 2nd T20I  Cricket AddictorHighlights SL-W vs IND-W 2nd T20I Cricket Score: Harmanpreet Kaur Led India Won The Match  India.comRecent Match Report - SL Women vs IND Women 2nd T20I 2022  ESPNcricinfoIndW vs SLW: Sri Lanka wins toss, opts to bat first against India  ThePrintView Full coverage on Google News","content":null,"pubDate":"2022-06-25 13:10:38","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Fans get furious on broadcasters for showing Shane Warne's advertisement during match","link":"https://www.indiatvnews.com/sports/cricket/eng-vs-nz-fans-get-furious-on-broadcasters-for-showing-shane-warne-s-advertisement-during-ongoing-test-match-2022-06-25-787336","keywords":null,"creator":null,"video_url":null,"description":"Cricket fans lost calm and got extremely furious with the broadcasters for showing Shane Warne's advertisement during the ongoing third Test match between England and New Zealand.","content":"Cricket fans lost calm and got extremely furious with the broadcasters for showing Shane Warne's advertisement during the ongoing third Test match between England and New Zealand. The world got shaken to know the sudden demise of Warne in March. He passed away at the age of 52 from a suspected heart attack while on holiday in Thailand. He appeared in an advert for the Advanced Hair Studio on Sky Sports during the break of ENG vs NZ coverage. The advertisement left fans uncomfortable. The ad was pulled off from the channel later. Iconic cricketer Warne made his debut in the year 1992. He played 145 Tests for Australia and scalped 708 wickets. In his 194 ODI matches played by him, Warne took 293 wickets with his leg spin. In his 15-year career from 1992 to 2007, he gave several moments for his fans across the globe to cherish. After his retirement, Warne led Rajasthan Royals to victory in the inaugural season of . Earlier this year on March 31, 2022, Cricket Australia paid tribute to the legend and unveiled the Shane Warne stand at the Melbourne Cricket Ground.","pubDate":"2022-06-25 13:10:11","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"Ranji Trophy final, Day 4: MP in control, Mumbai has a mountain to climb","link":"https://sportstar.thehindu.com/cricket/domestic/ranji-trophy-final-day-4-stumps-reports-scorecard-madhya-pradesh-vs-mumbai-highlights/article38506172.ece","keywords":null,"creator":["K. C. Vijaya Kumar"],"video_url":null,"description":"A new order is being etched in domestic cricket with Madhya Pradesh setting itself up for its maiden Ranji Trophy title and that too at multiple-champion Mumbai’s expense.","content":"On Saturday morning with a cool breeze wafting across, a father and his son climbed the stairs towards the lone stand allowing spectators at the M. Chinnaswamy Stadium. He bumped into another family and quipped: “After seeing the 83 film, my son is interested in cricket.” Coincidentally the statement was made on a day - June 25 - that marked the 39th anniversary of India’s historic World Cup triumph in 1983. And inside the venue, another new order was being etched in domestic cricket with Madhya Pradesh setting itself up for its maiden Ranji Trophy title and that too at multiple-champion Mumbai’s expense. Rajat Patidar’s remarkable 122 (332m, 219b, 20x4) and Saransh Jain’s 57 ensured that Madhya Pradesh seized a crucial 162-run first innings lead and scaled the first critical benchmark on its path towards the title. Replying to Mumbai’s 374, Madhya Pradesh posted 536. At the fourth day’s close of the Ranji final, Mumbai scored 113 for two in its second innings and is trailing by 49 runs. Skipper Prithvi Shaw and fellow-opener Hardik Tamore batted aggressively and also enjoyed their share of reprieves as catches were dropped. Tamore however fell on the sweep to spinner Kumar Kartikeya. Shaw was regal till he lasted, targeting the upper tier, eager to whittle down the deficit but fell in the last session. READ | Harmanpreet Kaur becomes India's leading T20I runscorer, overtakes Mithali Raj Earlier, resuming at the overnight 368 for three, Madhya Pradesh skipper Aditya Shrivastava played out a maiden from spinner Shams Mulani. From the Far End, Mohit Avasthi steamed in and Patidar on-drove for four and during the 127 over, a brace off the same bowler helped Madhya Pradesh move to 376 for three and two ahead of Mumbai’s 374. Both Shrivastava and Patidar played some rousing shots and as the 60-run partnership promised more, the captain edged a lifter from Avasthi. Just as Mumbai prised out wickets, Patidar marched to his own stylish beat with shots that scorched the turf. Akshat Raghuwanshi on-drove Avasthi for four but had no clue when a Tushar Deshpande delivery angled in. Next man Parth Sahani had a reprieve on two when Shaw grassed an edge off Mulani. But the batter did not capitalise and Mulani had the last word. As it happened Immediately southpaw Jain lofted a four to commence his knock. And as the fans chanted ‘RCB, RCB’, Patidar pulled Deshpande to move to 99, he then punched one towards cover and a special hundred was his to savour. He cut Deshpande, punched Mulani and Madhya Pradesh had 475 for six at lunch. After the break and with the new ball, Deshpande castled Patidar. Meanwhile Jain nonchalantly whipped his fours. The whimsical Bengaluru weather threw up showers and on either side of the rain-break Mulani scalped Anubhav Agarwal and Kartikeya. Another wet spell meant tea was announced and when play resumed Madhya Pradesh’s last wicket fell, leaving Mumbai with a mountain to climb and a miracle to dream about. The scores: Mumbai - 1 innings: 374 in 127.4 overs. Madhya Pradesh - 1 innings: Yash Dubey c Hardik Tamore b Mulani 133 (336b, 14x4), Himanshu Mantri lbw b Deshpande 31 (50b, 3x4, 2x6), Shubham Sharma c Tamore b Avasthi 116 (215b, 15x4, 1x6), Rajat Patidar b Deshpande 122 (219b, 20x4), Aditya Shrivastava c Sarfaraz b Avasthi 25 (69b, 2x4, 1x6), Akshat Raghuwanshi b Deshpande 9 (18b, 1x4), Parth Sahani lbw b Mulani 11 (18b, 2x4), Saransh Jain c Aman Khan b Mulani 57 (97b, 7x4), Anubhav Agarwal lbw b Mulani 8 (29b, 1x4), Kumar Kartikeya c Sarfaraz Khan b Mulani 9 (13b, 1x4), Gaurav Yadav (not out) 1 (2b); Extras (b-10, lb-1, nb-2, w-1): 14; Total (all out in 177.2 overs): 536. Fall of wickets: 1-47 (Mantri, 16.3 overs), 2-269 (Sharma, 89.4), 3-341 (Dubey, 111.5), 4-401 (Shrivastava, 132.5), 5-411 (Raghuwanshi, 138.1), 6-430 (Sahani, 143.5), 7-483 (Patidar, 163.2), 8-505 (Agarwal, 171.2), 9-515 (Kartikeya,173.6). Mumbai bowling: Dhawal Kulkarni 24-4-53-0, Tushar Deshpande 36-10-116-3, Shams Mulani 63.2-11-173-5, Mohit Avasthi 32-7-93-2, Tanush Kotian 22-1-90-0. Mumbai - 2 innings: Prithvi Shaw c Yash Dubey b Yadav 44 (52b, 3x4, 2x6), Hardik Tamore b Kartikeya 25 (32b, 2x4, 1x6), Armaan Jaffer (batting) 30 (34b, 3x4), Suved Parkar 9 (14b); Extras (lb-2, w-3): 5; Total (for two wkts., in 22 overs): 113. Fall of wickets: 1-63 (Tamore, 10.3 overs), 2-83 (Shaw, 15.6). Madhya Pradesh bowling: Kumar Kartikeya 10-1-50-1, Anubhav Agarwal 6-0-32-0, Gaurav Yadav 5-0-23-1, Parth Sahani 1-0-6-0.","pubDate":"2022-06-25 13:08:49","image_url":null,"source_id":"sportstar","country":["india"],"category":["sports"],"language":"english"},{"title":"SS vs NRK Dream11 Team Prediction, Fantasy Cricket Hints: Captain, Probable Playing 11s, Team News; Injury Updates For Today’s TNPL 2022 SS vs NRK match at ICCG, Tirunelveli, 7:15 PM IST June 25","link":"https://zeenews.india.com/cricket/ss-vs-nrk-dream11-team-prediction-fantasy-cricket-hints-captain-probable-playing-11s-team-news-injury-updates-for-today-s-tnpl-2022-ss-vs-nrk-match-at-iccg-tirunelveli-715-pm-ist-june-25-2477845.html","keywords":null,"creator":null,"video_url":null,"description":"Salem Spartans vs Nellai Royal Kings Dream11 Team Prediction SS vs NRK TNPL 2022 Match No. 4 - Check My Dream11 Team, Best players list of SS vs NRK, Salem Spartans Dream11 Team Player List, Nellai Royal Kings Dream11 Team Player List, Dream11 Guru Tips, Fantasy Cricket Tips, Fantasy Cricket Tips, Fantasy Playing Tips","content":"Salem Spartans (SS) will face Nellai Royal Kings (NRK) in match no. 4 of the Tamil Nadu Premier League 2022 (TNPL) on Saturday (June 25). Finishing seventh in the standings last year, Spartans will look to improve their performance in this season's tournament. NRK also didn't perform better last year finishing fifth in standings. Both teams will look to win this one and keep their hopes high in the beginning of the season. NRK won their first fixture against CSG with a super-over win over the defending champions. Match Details: Salem Spartans vs Nellai Royal Kings, Match no. 4 Venue: Indian Cement Company Ground, Tirunelveli Date & Time : June 25 & 7:15 PM Live Streaming: Star Sports Network and Disney+Hotstar website and app Dream 11 Prediction SS vs NRK Wicket-keeper: R Kavin, G Ajitesh Batters: Baba Indrajith (c), Jafar Jamal, Laxmesha Suryaprakash All-rounders: Baba Aparajith, Vijay Shankar, Sanjay Yadav Bowlers : Murugan Ashwin (vc), G Periyaswamy, Athisayaraj Davidson SS vs NRK Probable Playing XI SS: R Kavin (wk), S Ganesh, KH Gopinath, Jafar Jamal, Daryl Ferrario (c), Pranav Kumar, Jeet Jain, Vijay Shankar, Lokesh Raj, Murugan Ashwin, G Periyaswamy NRK: Laxmesha Suryaprakash, Pradosh Ranjan Paul, Baba Aparajith, Baba Indrajith (c & wk), Sanjay Yadav, Ajitesh G, J Kumar CH, M Shajahan, N Harish, H Trilok Nag, V Athisayaraj Davidson","pubDate":"2022-06-25 12:55:00","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"\"Don't Play This Sport To Show Anything To Anybody\": Hardik Pandya","link":"https://sports.ndtv.com/cricket/dont-play-this-sport-to-show-anything-to-anybody-hardik-pandya-ahead-of-india-ireland-t20i-series-3099910","keywords":null,"creator":null,"video_url":null,"description":"Hardik Pandya will be leading the Indian cricket team in the two-T20I series against Ireland, starting on Sunday","content":"Hardik Pandya has been a revelation in recent times with some great cricket in the IPL and for the national side. He led Gujarat Titans from the from the front to help the new franchise win the Indian Premier League (IPL) 2022. He was also the \"Player of the Match\" in the final with an all-round show. Then in the recently-concluded India-South Africa T20I series, Pandya batted with responsibility and impressed all. He will now be leading the Indian cricket team in the two-T20I series against Ireland, starting on Sunday. Ahead of the game, he was asked how he wants to prove his mettle because after the series, he won't be the captain anymore when the seniors return. Pandya gave a string reply to the question. \"I am not here to show anything to anybody. I have got an opportunity to lead India, that itself is a big thing for me. I don't play this sport to show anything to anybody. I am good enough. I will see in the future, otherwise more than anything I am just focussing on what I can bring in this series,\" Pandya said. Pandya added that the team may give debuts to young players in the series, though the focus will be on playing the best XI. \"We want to give opportunity to people but at the same time we want to play with the best XI as well. But there will be situation, where we will be giving caps to people. It's about making sure that when we go into the park, we have the best XI playing. So, that will be focus,\" Pandya added. Before the recently-concluded series against South Africa, Hardik had last played for Team India in 2021 T20 World Cup in UAE. In the last series against South Africa, Hardik Pandya had scored 117 runs and he was not able to take a single wicket with the ball in hand. Promoted In IPL 2022, Hardik had scored 487 runs with the bat and he also managed to take eight wickets, out of which three came in the final against Rajasthan Royals. India squad for Ireland T20I series: Hardik Pandya (c), Bhuvneshwar Kumar (vc), Ruturaj Gaikwad , Ishan Kishan , Suryakumar Yadav , Sanju Samson , Rahul Tripathi , Deepak Hooda , Venkatesh Iyer , Axar Patel , Dinesh Karthik (wk), Avesh Khan , Harshal Patel , Umran Malik , Arshdeep Singh, Yuzvendra Chahal , Ravi Bishnoi .","pubDate":"2022-06-25 12:40:04","image_url":"https://c.ndtvimg.com/2022-06/5cbjrjl8_hardik-pandya-806_625x300_10_June_22.jpg?im=FeatureCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"India vs Leicestershire Live Score Day 3: Focus on Virat Kohli, India seek momentum - Hindustan Times","link":"https://news.google.com/__i/rss/rd/articles/CBMixQFodHRwczovL3d3dy5oaW5kdXN0YW50aW1lcy5jb20vY3JpY2tldC9pbmRpYS12cy1sZWljZXN0ZXJzaGlyZS1saXZlLXNjb3JlLWRheS0zLXdhcm0tdXAtbWF0Y2gtbGF0ZXN0LXNjb3JlY2FyZC1yb2hpdC1zaGFybWEtdmlyYXQta29obGktY2hldGVzaHdhci1wdWphcmEta3MtYmhhcmF0LXJpc2hhYmgtcGFudC0xMDE2NTYxNDczODA1MjcuaHRtbNIBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"India vs Leicestershire Live Score Day 3: Focus on Virat Kohli, India seek momentum  Hindustan TimesIndia vs Leicestershire, Day 2: Mohammed Shami Dismisses Cheteshwar Pujara For A Duck, Celebrates By..  NDTV SportsIndia vs Leicestershire LIVE: KS Bharat in reckoning for opening in 5th Test?  InsideSportWatch: Rishabh Pant joins celebration of own wicket after Ravindra Jadeja's reaction in India vs Leicestershire warm-up  Hindustan TimesWatch: Furious Virat Kohli Confronts Crowd After A Fan Pesters Kamlesh Nagarkoti For Photo  Cricket AddictorView Full coverage on Google News","content":null,"pubDate":"2022-06-25 12:37:58","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Cricket-Overton misses ton, England overhaul New Zealand total before lunch","link":"https://www.thestar.com.my/sport/cricket/2022/06/25/cricket-overton-misses-ton-england-overhaul-new-zealand-total-before-lunch","keywords":null,"creator":null,"video_url":null,"description":"LEEDS, England (Reuters) - England's Jonny Bairstow smashed a magnificent 162 while debutant Jamie Overton fell three runs short of a century as the hosts were dismissed for 360 in their first innings at Headingley on Saturday for a 31-run lead over New Zealand. Read full story","content":null,"pubDate":"2022-06-25 12:23:00","image_url":"https://apicms.thestar.com.my/uploads/images/2022/06/25/1636271.jpg","source_id":"thestar_my","country":["malaysia"],"category":["sports"],"language":"english"},{"title":"Sky Sports cricket commentators 2022: TMS commentators today BBC","link":"https://thesportsrush.com/cricket-news-sky-sports-cricket-commentators-2022-tms-commentators-today-bbc/","keywords":["Cricket","ENG vs NZ","Sky Sports cricket commentators","TMS commentators today BBC"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"Sky Sports cricket commentators 2022: The SportsRush brings you the commentary teams of England vs New Zealand series. England are up against New Zealand in the 3rd match of the three-match test series at the Headingley Stadium in Leeds. The hosts are aiming for a clean sweep, whereas the visitors are playing for respect. The… The post Sky Sports cricket commentators 2022: TMS commentators today BBC appeared first on The SportsRush.","content":"Sky Sports cricket commentators 2022: The SportsRush brings you the commentary teams of England vs New Zealand series. England are up against New Zealand in the 3rd match of the three-match test series at the Headingley Stadium in Leeds. The hosts are aiming for a clean sweep, whereas the visitors are playing for respect. The test match will be remembered for the incredible partnership between Jamie Overton and Jonny Bairstow for the 7th wicket. In reply to New Zealand’s total of 329, England were 55-6 at one stage, but then Overton and Bairstow combined for a partnership of 241 runs. Jamie Overton missed his century and got out on 97 runs, but Jonny Bairstow played a massive knock of 162 runs in just 157 balls courtesy of 24 boundaries. The form of Jonny Bairstow has been great, and he has smashed two centuries in two games. Sky Sports cricket commentators 2022 Sky Sports commentary team has always been full of star names, and they have a great panel for the third test between New Zealand and England as well. Mark Butcher, Nasser Hussain, Nick Knight, Kumar Sangakkara, and Michael Atherton are part of the broadcasting team of Sky Sports. They also bring some guest commentators in their group from time to time. Naser Hossain has been associated with Sky Sports for quite a bit now. Kumar Sangakkara, who was the head coach of Rajasthan Royals in IPL 2022 has also joined the panel for this series. James Anderson Coaching Session Get your videos and questions in for England’s greatest ever bowler James Anderson who joins us at lunch on Sunday to offer tips and analysis of your swing bowling videos pic.twitter.com/YUxsDbVRMJ — Sky Sports Cricket (@SkyCricket) June 25, 2022 TMS commentators today BBC Michael Vaughan is back on the BBC commentary team for the 3rd test against New Zealand. He was banned by BBC earlier after his involvement in the Azeem Rafique racism scandal. Apart from Michael Vaughan, Moeen Ali is also a part of the BBC team as a guest commentator for the test match. Jonathan Agnew, Isa Guha, Simon Mann, Alexandra Hartley and Daniel Norcross are also a part of the BBC commentary team for the match. The post Sky Sports cricket commentators 2022: TMS commentators today BBC appeared first on The SportsRush.","pubDate":"2022-06-25 12:11:24","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"2nd T20I: Harmanpreet leads India to series sealing win over SL","link":"https://timesofindia.indiatimes.com/sports/cricket/news/2nd-t20i-harmanpreet-kaur-leads-india-to-series-sealing-win-over-sri-lanka/articleshow/92457232.cms","keywords":null,"creator":null,"video_url":null,"description":"Skipper Harmanpreet Kaur contributed with both bat and ball to steer the Indian women's cricket team to a series sealing five-wicket win over Sri Lanka in the second T20I on Saturday.","content":"DAMBULLA: Skipper Harmanpreet Kaur contributed with both bat and ball to steer the Indian women's cricket team to a series sealing five-wicket win over Sri Lanka in the second T20 here on Saturday. Vice captain Smriti Mandhana 's (39 off 34 balls) experience complemented by the exuberance of both Shafali Verma (17 off 10 balls) and Sabbhineni Meghana (17 off 10 balls) helped India chase down the 126-run target in 19.1 overs. India stuttered in what should have been a comfortable run chase before Harmanpreet took India home with an unbeaten 31 of 32 balls. A little too close for comfort towards the end but India take an unassailable 2-0 lead in the T20I series against S… https://t.co/XYmszYqpbO — ICC (@ICC) 1656157254000 Sri Lanka squandered a fine start to post a below par 125 for seven. The third and final T20 will be played here on Monday. It was a day to remember for Mandhana who became the second fastest Indian woman to reach 2,000 T20 runs. Mandhana reached the feat in her 84th innings, becoming the third Indian woman after the legendary Mithali Raj (70 innings) and current skipper Harmanpreet Kaur (88 innings) to cross the mark. Opting to bat first and with the series on line, it was the duo of captain Chamari Athapaththu (43 off 41 balls) and Vishmi Gunaratne (45 off 50 balls) provided an ideal start for the Lankans by taking the Indian bowlers to the cleaners. The duo also put up Sri Lanka's best opening stand (87) in T20s to leave the Indians frantically rummaging for breakthroughs. However, as both Athapaththu and Gunaratne departed, it was a sorry state of affairs for Sri Lanka as they lost a slew of wickets, only managing an underwhelming total. Deepti Sharma (2/34 in 4 overs) was certainly the best bowler on view while the likes of Radha Yadav and Pooja Vastrakar also helped India claw back with the ball.","pubDate":"2022-06-25 11:58:00","image_url":null,"source_id":"toi","country":["india"],"category":["sports"],"language":"english"},{"title":"Jonny Bairstow dad: Who is Rebecca Bairstow? Jonny Bairstow sister and family details","link":"https://thesportsrush.com/cricket-news-jonny-bairstow-dad-who-is-rebecca-bairstow-jonny-bairstow-sister-and-family-details/","keywords":["Cricket","Jonny Bairstow","Jonny Bairstow dad","Rebecca Bairstow"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"Jonny Bairstow dad: The SportsRush brings you the family details of England’s wicket-keeper batter Jonny Bairstow. Jonny Bairstow has been in a dream form in the year 2022 in test matches. He has played seven matches this season, where he has scored 671 runs at an average of 61.00, courtesy of four centuries. It is… The post Jonny Bairstow dad: Who is Rebecca Bairstow? Jonny Bairstow sister and family details appeared first on The SportsRush.","content":"Jonny Bairstow dad: The SportsRush brings you the family details of England’s wicket-keeper batter Jonny Bairstow. Jonny Bairstow has been in a dream form in the year 2022 in test matches. He has played seven matches this season, where he has scored 671 runs at an average of 61.00, courtesy of four centuries. It is interesting that Bairstow has managed to convert his every half-century to a century this season. The dream run of Jonny Bairstow started this year in the Ashes 2021-22 game at the Sydney Cricket Ground, where he played a knock of 113 runs. He then travelled to West Indies, where he smashed 109* runs in Antigua. In the ongoing test series against New Zealand, Jonny Bairstow has already scored two centuries. Bairstow scored 136 runs in the 2nd innings of the Trent Bridge test to register a historic win for the English side. In the 3rd test at the Headingley in Leeds, Jonny Bairstow again became the savior of the English side. In reply to New Zealand’s 329 runs in the first innings, England were 55-6 at one stage, but then Bairstow stitched a partnership of 241 runs with Jamie Overton. David Bairstow was the father of Jonny Bairstow, who represented England in 4 tests and 21 ODIs. After retiring from cricket, he suffered from depression. At the age of just 46, he committed suicide leaving his young family. Bairstow was just 8 at that time, and his mom was diagnosed with cancer as well. 18 years ago today we lost a wonderfully caring person, amazing sportsman and great father! We miss you and love you Dad X — Jonny Bairstow (@jbairstow21) January 5, 2015 Janet Bairstow is the mother of Jonny Bairstow. In 2020, she became the first female vice-president of the Yorkshire County Cricket Club. She was an administrator of the club for 13 years. She also fought cancer. Rebecca Bairstow is the sister of Jonny Bairstow, and she is said to be very close to Jonny Bairstow. Andrew Bairstow, a former first-class player of England is the brother of Jonny Bairstow. Jonny Bairstow is not married yet.","pubDate":"2022-06-25 11:18:46","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Why are players wearing black armbands today 2022: Why are New Zealand cricketers wearing black armbands at Headingley?","link":"https://thesportsrush.com/cricket-news-why-are-players-wearing-black-armbands-today-2022-why-are-new-zealand-cricketers-wearing-black-armbands-at-headingley/","keywords":["Cricket","England","New Zealand","New Zealand tour of England 2022"],"creator":["Dixit Bhargav"],"video_url":null,"description":"New Zealand cricketers wearing black armbands: The visiting players are seen donning black armbands at the Headingley today. During the third day of the third Test of the ongoing New Zealand’s tour of England in Leeds, debutant England fast bowler Jamie Overton has missed out on a maiden Test century despite stitching a remarkable rescue… The post Why are players wearing black armbands today 2022: Why are New Zealand cricketers wearing black armbands at Headingley? appeared first on The SportsRush.","content":"New Zealand cricketers wearing black armbands: The visiting players are seen donning black armbands at the Headingley today. During the third day of the third Test of the ongoing New Zealand’s tour of England in Leeds, debutant England fast bowler Jamie Overton has missed out on a maiden Test century despite stitching a remarkable rescue act. Resuming from his overnight score of 89*, all Overton scored today were eight runs before falling short of the three-figure mark by three runs. It was on the third delivery of the 58th over when Overton edged a Trent Boult delivery to Daryl Mitchell at first slip. Overton, who hit 13 fours and two sixes at a strike rate of 71.32 in his maiden international innings, was part of a game-changing 241-run seventh-wicket partnership alongside Jonny Bairstow. England, who were struggling at 55/6 at one point in time on Day 2, have managed to attain a first innings lead on Day 3. Hold your head high, Jamie. A sensational innings and a record-breaking partnership when we needed it most. Those three runs don’t change any of that. 🏴󠁧󠁢󠁥󠁮󠁧󠁿 #ENGvNZ 🇳🇿 pic.twitter.com/nzny37oj1s — England Cricket (@englandcricket) June 25, 2022 As fans must have noted by now, New Zealand cricketers are donning black armbands at the Headingley today. It is worth mentioning that the same has been done as a mark of respect and tribute towards former New Zealand first-class player, NZC (New Zealand Cricket) President and Black Caps selector Don Neely, who passed away last week. Neely, 86, was also a renowned historian and author. In 34 first-class matches for Wellington and Auckland between 1964-1971, Neely had scored 1,301 runs at an average of 28.91 including a century and seven half-centuries. “Don dedicated his life to cricket as a player, administrator and historian, and the Basin Reserve scoreboard is named after Don in his honour. Our thoughts are with his wife Padianne, his family and friends,” Cricket Wellington had said in a statement post Neely’s demise.","pubDate":"2022-06-25 11:17:37","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Birmingham Test: Tough challenge awaits Rohit-Dravid duo against a bold England","link":"https://www.sentinelassam.com/sports/cricket/birmingham-test-tough-challenge-awaits-rohit-dravid-duo-against-a-bold-england-599140","keywords":["Sports,Cricket"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"The series, which started with Virat Kohli as skipper and Ravi Shastri as chief coach, will now conclude with Rohit Sharma as captain and Rahul Dravid to do Shastri’s job.","content":"New Delhi: A lot has changed in Indian cricket set-up since their fifth Test against hosts England was cancelled last year because some of the visiting side members tested Covid positive. The series, which started with Virat Kohli as skipper and Ravi Shastri as chief coach, will now conclude with Rohit Sharma as captain and Rahul Dravid to do Shastri's job. On the other hand, England will also have a new coach and captain duo of Brendon McCullum and Ben Stokes , who replaced Chris Silverwood and Joe Root in their respective roles. One more difference between last year and now is that teams no longer have to live in a biosecure bubble, which will be a big relief for cricketers. The then Virat Kohli -led side left England in October with a 2-1 lead, and Rohit will now have the responsibility to make it 3-1 or draw the game to win the series, which will be a tough ask, given that England are playing a new brand of attacking cricket. This will also be the first time both Rohit and Dravid would be seen together on foreign soil with such major roles. Notably, Dravid had his first foreign tour as a coach in South Africa but Rohit missed the series due to injury. The Indian team led by Rohit is currently playing a warm-up game against Leicestershire in England and the Day 1 of the four-day match was not great for India, especially for top-order batters. Rohit (25) once again got out playing the hook shot, while Shubman Gill, who got a start but departed for 21 and Iyer, who endured a first-ball duck, edged while playing away from their bodies. On the other hand, Kohli's outside edge looked suspect before he was beaten on the inside edge. It was reserve wicket-keeper KS Bharat (70 not out), who led India's recovery and took them to 246/8 at stumps on Day 1 of their practice match on Thursday. India would want to finish the ongoing warmup game on a high to get some confidence ahead to the crucial tie. The practice match, followed by the Test, will also give under-pressure Kohli an opportunity to overcome a lengthy struggle for consistency. His century drought has stretched past 100 games across all forms of cricket, including the IPL. The much-awaited Test match between India and England will start on July 1 in Birmingham, will not have injured KL Rahul and it will be interesting to see who will open and what will be the line-up Dravid plans. It is believed that Gill can open with Rohit Sharma, as they did in the practice match. Just to add on, none of the current India batter in the Test side has had a 'great' season in the recently concluded IPL 2022. It's often considered wrong to make a comparison between the two different formats. But experts believe players do get confidence if they had played a better tournament ahead of any major match. For the record, India have not played a Test match since March, when they dominated Sri Lanka at home with a 2-0 series win. Barring Pujara and Gill, none of the Indian players have played any red-ball cricket since, with the majority of the rest featuring in IPL 2022 followed by the home T20I series against South Africa. Cricket pundits would want to see what magic Rohit and Dravid dig out in their first foreign tour. The planning and execution would be important because England will look to end the series on a winning note since their pride is at stake. Under Stokes and McCullum, England are playing a new brand of cricket with domination, which was pretty much visible in their thrilling wins over New Zealand at Lord's and Trent Bridge. So, definitely, they will produce some tough challenges for India. After the end of the washed out fifth T20 match of the series against South Africa, Dravid was asked about England's new approach and he also admitted that they are playing some good matches against New Zealand. \"Playing a Test match in England is always a good experience. The audience is going to be fantastic. When you play Test cricket there you expect really good spectator numbers in England. The England team is also playing well. This is a slightly different situation now, when we were there last year when England were probably on the backfoot but they have played some good matches against New Zealand,\" he said. Also read: Ranji Trophy: Dubey, Sharma, Patidar propel MP on verge of first-innings lead against Mumbai Also watch:","pubDate":"2022-06-25 11:07:36","image_url":"https://assets.sentinelassam.com/h-upload/2022/06/25/358523-rahul-copy.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"IRE vs IND Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update- India Tour of Ireland, 1st T20I - Cricket Addictor","link":"https://news.google.com/__i/rss/rd/articles/CBMivAFodHRwczovL2NyaWNrZXRhZGRpY3Rvci5jb20vaW5kaWEtdG91ci1vZi1pcmVsYW5kLTIwMjIvaXJlLXZzLWluZC1kcmVhbTExLXByZWRpY3Rpb24tZmFudGFzeS1jcmlja2V0LXRpcHMtZHJlYW0xMS10ZWFtLXBsYXlpbmcteGktcGl0Y2gtcmVwb3J0LWluanVyeS11cGRhdGUtaW5kaWEtdG91ci1vZi1pcmVsYW5kLTFzdC10MjBpL9IBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"IRE vs IND Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update- India Tour of Ireland, 1st T20I  Cricket AddictorIndia tour of Ireland, 2022: Favourites India out to test bench strength against Ireland | Cricbuzz.com - Cricbuzz  CricbuzzCoach Heinrich Malan excited about packed calendar: It's the most cricket that Ireland have played ever  India TodayIND vs IRELAND T20 Schedule 2022, Squads, Venues, Live Streaming And Live Telecast Details  Cricket AddictorAny Indian team you play will be a good team - Balbirnie | Cricbuzz.com - Cricbuzz  CricbuzzView Full coverage on Google News","content":null,"pubDate":"2022-06-25 10:59:10","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"}]}