{"newsArray":[{"article_id":"3e0e5c707dea85f44704bb119c3b7aa3","title":"'England are undercooked. It's madness!' As Jos Buttler's men prepare to defend the World Cup in India, Mail Sport's Nasser Hussain, David Lloyd, Paul Newman and Lawrence Booth discuss their hopes... and who will be the stars of the show","link":"https://www.dailymail.co.uk/sport/cricket/article-12590099/England-undercooked-madness-Jos-Buttlers-men-prepare-defend-World-Cup-India-Mail-Sports-Nasser-Hussain-David-Lloyd-Paul-Newman-Lawrence-Booth-discuss-hopes-stars-show.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"It's time for England to defend the World Cup they won so dramatically at Lord's four years ago. Can they go even better by retaining it in India?","content":"'England are undercooked. It's madness!' As Jos Buttler's men prepare to defend the World Cup in India, Mail Sport's Nasser Hussain, David Lloyd, Paul Newman and Lawrence Booth discuss their hopes... and who will be the stars of the show ODI cricket has taken a back seat since England won the last 50-over World Cup Jos Buttler's side face a daunting challenge to retain the trophy in India Mail Sport's new WhatsApp Channel: Get the breaking news and exclusives here By Lawrence Booth and Paul Newman and David Lloyd and Nasser Hussain For The Daily Mail Published: 22:30, 3 October 2023 | Updated: 22:47, 3 October 2023 e-mail View comments It’s time for England to defend the World Cup they won so dramatically at Lord’s four years ago. Can they go even better by retaining it in India? We asked our experts — former England captain Nasser Hussain, former England coach David ‘Bumble’ Lloyd, Cricket Correspondent Paul Newman and Wisden Editor Lawrence Booth. England have had nothing like the preparation they had for the 2019 World Cup triumph. What shape are they in? Lloyd: They’re undercooked. It was utterly ridiculous to play three 50-over matches against Ireland in the autumn. No wonder the World Cup players didn’t turn out. And next season the games against Australia finish even later. Complete madness. Ask any coach at this World Cup and I bet they will be dismayed at their lack of preparation. Newman : I agree but it’s the way of the world sadly. England looked in decent enough shape against New Zealand. Everything was about winning in England in 2019, so perhaps they have gone under the radar a bit now, but it’s a team that covers most bases. Retaining the World Cup in India would be the greatest of all England’s white-ball achievements. ODI cricket has taken a back seat since England won the last 50-over World Cup in 2019 Captain Jos Buttler's side face a tough challenge to retain the World Cup in India four years after their triumph Booth : If they went into 2019 as favourites, they are now just one of a few teams who have a chance; fifth in the rankings tells you they have lost some of their aura, despite holding both white-ball trophies. ODI cricket has taken a back seat since the last 50-over World Cup, and England will turn up in India hoping their big-game nous can carry them through. Hussain : It’s circumstances really. Everything was geared towards that 50-over World Cup last time but then there was a T20 World Cup to focus on which England won and red-ball was then prioritised with the Ashes and the start of the Ben Stokes-Brendon McCullum era. They’re not in as good a shape as 2019 but they’re still in a good plac England are something of a Dad’s Army side. Will there be a changing of the guard after this World Cup? Newman : Yes, this is the end of the greatest era in England’s limited-overs history. Eoin Morgan has been gone over a year, Alex Hales and Jason Roy have followed, and I can’t see more than half of this squad playing 50-over cricket again for England. Booth : Absolutely agree. For Jonny Bairstow, Joe Root, Ben Stokes, Moeen Ali, Chris Woakes, Adil Rashid and Mark Wood, this will be the last one-day World Cup. The rain-ruined series against Ireland gave us a glimpse of the future, with the likes of Phil Salt, Will Jacks, Sam Hain and Rehan Ahmed all thriving. Hussain : They are experienced but that’s what you want in India. They are starting to move on and quite a few players will be getting towards their mid-30s by the end of this tournament. Yes, they are blessed with a lot of emerging talent with the bat but they will have to keep an eye on the bowling depth as they move forward. Ben Stokes (left) and Joe Root will take part in their final ODI World Cup before retirement Lloyd : Agreed, Nass. This is a watershed tournament for a great white-ball side. Quite a few of them will step down afterwards. What you can say is that it’s a very experienced team and lads who have been there, done it and got the T-shirt will roll up their sleeves and get on with it. England got in a selection pickle. Have they called it right with Brook over Roy and was anybody left behind who shouldn’t have been? Booth : It’s harsh on Roy, but he hadn’t played for England since March, and the selectors would have been taking a huge gamble on his dodgy back. Harry Brook is a generational talent — the sooner he beds down in the ODI side, the better. I’d have been tempted to pick Ben Duckett, because he plays spin so well. Lloyd : When they picked that first squad, I said straight away, ‘Brook will still go’. He will be a sensation if they can get him in the team. They have ended up with the right squad. As soon as I saw Gus Atkinson in the T20 in Dubai early this year, I was shouting from the rooftops about England getting him in. I can’t think of anyone else who should have gone. Hussain : It was more to do with ICC regulations. When they named that first squad, Matthew Mott quickly said it was provisional. Other teams have got themselves in a pickle, too. Look at Bangladesh and Tamim Iqbal (recalled but now out injured). Roy is one of England’s great white-ball players, so they were right to pick him but back spasms and the chance to add Brook changed things. Newman : Yes, but they did get themselves in a pickle. They told Roy he was definitely going to the World Cup. They could have handled it better but they have done the right thing in going for Brook over Roy in the end. Jason’s England race is run and there would be no surprise if he throws in his lot fully with the franchise world very soon. Who are the key figures for England and where will the World Cup be won? Newman : I’m a bit concerned that what was first described as cramp had turned into a calf problem for Adil Rashid by the end of the New Zealand series. And that Mark Wood hasn’t played since the Ashes. If England are to win it, they need those two fit and firing. India should go a long way with the likes of Rohit Sharma (above) and Jasprit Bumrah Lloyd: The key figure will be an absent friend. Morgan ran that team with military precision and will be missed. He had an unshakable belief in his players and Jos has to show that, too. The World Cup will be won by bravery, taking a risk and seizing the moment. Booth : Among ODI openers with at least 1,000 runs, only Australia’s Travis Head has a better average and strike-rate than Bairstow’s 47 and 107. He knows Indian conditions well and if he gets England off to regular flyers, their batting depth will terrify opponents. Hussain : Buttler, England’s greatest ever white-ball batter, is the key. And teams still need glue in a 50-over innings, so Joe Root’s return to form will be vital. Who’ll be the stars of the show? Hussain : India will go a long way so Rohit Sharma with the bat and Jasprit Bumrah with the ball. So will England, so Buttler and Rashid for them. Mitch Marsh will stand out for Australia as will South Africa’s Heinrich Klaasen, who’s such a good player of spin. Newman : I’d love Dawid Malan to be a star. He has been under-estimated for years and still doesn’t fit into England’s way of doing things, but he’s made himself undroppable. I’m keeping an eye on Logan van Beek after he defeated West Indies virtually on his own in a qualifying Super Over to get the Netherlands to India. Booth : Look out for India’s Shubman Gill, who averages 66 from his 35 ODI innings, and has a strike-rate of 102. Head and Bairstow can be destructive, and Klaasen recently pummelled Australia for 174 off 83 balls. Among the bowlers, I’d expect Bumrah and Afghanistan spinner Rashid Khan to shine. Lloyd: If Brook gets in, he will light up the tournament. Bairstow will be very influential and Stokes will be ultra-influential. I have a hunch Shreyas Iyer will be a big star for India but they will miss Rishabh Pant. India will walk it on home soil, won’t they? But if not, who wins? And who’s your final four? Mitch Marsh will be stand out for Australia and Travis Head (above) can be destructive Lloyd : India have 13 men — 11 on the field, home conditions and the crowd. Can they lose their egos and just do the job? If they do, they should walk it. Can South Africa lose their choker tag? They have to sometime and this is as good a chance as they will get. If England draw on all that experience, they will be there. And always Australia. Hussain : India are favourites. Can they play no-fear cricket in knockout games? Also their batters don’t bowl and their bowlers don’t bat, so their balance will be interesting. My semi-finalists are India, England, Australia and Pakistan. Newman : The last three 50-over World Cups have been won by the home side and this shouldn’t be any different. But I wonder if India will be selfless enough. I’ve heard the case for South Africa but they always seem to cock it up. My last four are England, India, Australia and I was going to say Chris Silverwood’s Sri Lanka, but they have big injury problems. I’ll go for Pakistan. Booth : One bad day in the semi-finals, as India were reminded by England in the last T20 World Cup, can undo all the good work. But, yes, the hosts look in prime form. If not India then England, with Australia and Pakistan making up the last four. But New Zealand will be in the mix and even South Africa. Share or comment on this article: 'England are undercooked. It's madness!' As Jos Buttler's men prepare to defend the World Cup in India, Mail Sport's Nasser Hussain, David Lloyd, Paul Newman and Lawrence Booth discuss their hopes... and who will be the stars of the show e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-10-03 21:47:15","image_url":"https://i.dailymail.co.uk/1s/2023/10/03/19/76127739-0-image-a-3_1696358549847.jpg","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"fac6d3fd794c8979df89242cf9d68de7","title":"Storm to hit senior divison","link":"https://brimbanknorthwest.starweekly.com.au/sport/storm-to-hit-senior-divison/","keywords":["Sport"],"creator":["jimjin"],"video_url":null,"description":"Sydenham-Hillside is ready for the challenge of the Victorian Turf Cricket Association senior division season. It has been a rapid... The post Storm to hit senior divison appeared first on Brimbank & North West.","content":"Sydenham-Hillside is ready for the challenge of the Victorian Turf Cricket Association senior division season. It has been a rapid rise of the VTCA for the Storm, winning premierships in four of the last five seasons, resulting in it climbing from division 4 in the 2018-19 season to senior division for the upcoming summer. Now the Storm is ready to hit the competition once again said new coach Warren Hackney. “It’s going to be a big step but we’re looking forward to the challenge,” he said. “We’ve been pretty fortunate and been able to hold onto most of the guys and top up a little bit by adding what we thought might help our push in the higher grade. “So we’re hopeful of being competitive.” One of the Storm’s big signings for the summer is Scottish fast bowler Adrian Neill. Neill has a number of international appearances under his belt and has recently been involved in World Cup qualifiers where Scotland fell agonisingly short of qualifying for the ICC Cricket World Cup being held in India later this month. “We’re excited by the fact that he’ll be able to offer us something a bit different to what we’ve had with his extra height and bounce,” Hackney said. “So we’re looking forward to having him on board. “We’ve also got a couple of guys who we’re looking to bring in who are not as big of names… but they’re guys that we envisage will help us improve.” It’s Hackney’s first year at the helm of the Storm, after being a champion player of the club being the all-time leading first XI run-scorer, a five-time premiership player, a former captain amongst other accolades. Now as he sets to lead the club he loves to senior division glory, Hackney is not setting a ceiling at what his side can accomplish. “The first goal is to stay up,” he said. “But we’ve been fortunate enough to climb through the grades fairly quickly, so each year we’ve not wanted to set any limit in what we thought could be achieved. “Although this year is a much bigger step I feel than those we’ve taken in the last four or five years, we’re not wanting to put too much pressure on ourselves. “So who knows if we do manage to get things right, the sky’s the limit, anything’s possible. “We’d be wrapped to think we could make finals and if you can do that, anything’s possible from there.” The Storm will face last year’s grand finalists Deer Park when the season kicks off on October 7. Harper Sercombe","pubDate":"2023-10-03 20:00:27","image_url":null,"source_id":"brimbanknorthwest","source_priority":2256086,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"0f4354ee01b1b5b6bf36a168cb83b5b9","title":"WC Warm-up: Australia Edge Pakistan As India Go 3,400km For Washout","link":"https://sports.ndtv.com/cricket/cricket-world-cup-warm-up-australia-edge-pakistan-as-india-go-3-400km-for-world-cup-washout-4447383","keywords":null,"creator":null,"video_url":null,"description":"Australia edged out Pakistan by 14 runs in a high-scoring World Cup warm-up on Tuesday as India travelled 3,400km from one corner of the country to another only to be defeated by torrential rain.","content":"Australia edged out Pakistan by 14 runs in a high-scoring World Cup warm-up on Tuesday as India travelled 3,400km from one corner of the country to another only to be defeated by torrential rain. In Hyderabad, Australia made 351-7 from their 50 overs with Glenn Maxwell particularly ruthless on Pakistan's bowlers. Maxwell cracked 77 off 71 balls with four boundaries and six sixes. Cameron Green was undefeated on 50, David Warner clubbed three sixes in his 48 while Josh Inglis also made 48. Marnus Labuschagne , a late call-up by the five-time World Cup winners, contributed 40. Pakistan leg-spinner Usama Mir impressed with 2-31 as he dismissed Warner and Mitchell Marsh after the openers had put on 83 for the first wicket. Mir's leg-spinning partner Shadab Khan was expensive with his one wicket costing 69 runs. In reply, Pakistan, who lost by five wickets to New Zealand in their opening warm-up, were dismissed for 337 in the 48th over. Captain Babar Azam hit a fluent, unbeaten 90 off 59 balls with 11 boundaries and two sixes and shared a 144-run partnership with Iftikhar Ahmed who made 83 off 85 deliveries. Mohammad Nawaz contributed 50 but Pakistan fell just short. At Guwahati, Kusal Mendis scored a breathtaking 158 as Sri Lanka were bowled out for 294 by Afghanistan before slipping to a six-wicket defeat in a rain-hit match. Mendis, captain for the day with Dasun Shanaka sitting out the final warm-up, made his runs off only 87 balls. He hit 19 fours and nine sixes as Afghanistan struggled to apply the brakes with only former skipper Mohammad Nabi enjoying sustained success with 4-44. Advertisement Rahmanullah century Afghanistan were sitting comfortably on 118-1 in the 21st over in reply when rain stopped play. They were then set an adjusted target of 257 off 42 overs and cruised home with 23 balls to spare. Opener Rahmanullah Gurbaz smashed 119 from 92 balls with eight fours and nine sixes, sharing a 212-run second wicket partnership with Rahmat Shah . Rahmat's 93 was made off 82 balls and featured 10 fours and three sixes. Meanwhile, India's superstar cricketers endured a 3,400km (2,170 miles) cross-country journey to play a warm-up only for the match to be abandoned without a ball being bowled. India were to face the Netherlands in Thiruvananthapuram, on the southern tip of India, but they were left kicking their heels in the rain. On Saturday, their scheduled game against defending champions England up in the north-eastern city of Guwahati was also washed out. In total, the wet weather forced three warm-up matches to be abandoned while four others were rain-affected, leaving teams and players frustrated ahead of Thursday's World Cup start. However, the weather forecast for the rest of the week in Ahmedabad, Hyderabad and Dharamsala -- venues for first three days of the tournament -- is optimistic with sunshine instead of showers. England will play New Zealand in the tournament opener at the world's biggest cricket stadium in Ahmedabad on Thursday. Pakistan clash with the Netherlands in Hyderabad on Friday, while Afghanistan and Bangladesh play in Dharamsala on Saturday. (Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)","pubDate":"2023-10-03 18:50:54","image_url":null,"source_id":"ndtv","source_priority":1204,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"24082a7d39f87cddfaef3e3f2c48335a","title":"Five bowlers to watch at the 2023 World Cup","link":"https://thefrontierpost.com/five-bowlers-to-watch-at-the-2023-world-cup/","keywords":["Sports"],"creator":["The Frontier Post"],"video_url":null,"description":"NEW DELHI (Reuters): The following are five bowlers to watch at the World Cup in India: Mark Wood (England) Mark Wood’s lethal pace made him an integral part of England World Cup-winning side in 2019, taking 18 wickets in the tournament, but injuries have limited him to just eight ODI matches since 2020. However, he […]","content":"NEW DELHI (Reuters): The following are five bowlers to watch at the World Cup in India: Mark Wood (England) Mark Wood’s lethal pace made him an integral part of England World Cup-winning side in 2019, taking 18 wickets in the tournament, but injuries have limited him to just eight ODI matches since 2020. However, he has been in great touch in test cricket this year with 14 wickets in three matches and if he can translate that form into the 50-overs format he could once again prove to be a crucial asset for England. Adam Zampa (Australia) Adam Zampa will be the only specialist spinner in the Australia squad for the World Cup. He has taken 45 wickets in the 50-over format since the beginning of 2022, and played a key role for Australia in their ODI series victory over India in March. While he equalled an unwanted record by bowling the joint-most expensive spell by an Australian in an ODI defeat to South Africa last month, the 31-year-old recovered well, picking up six wickets in his last three matches in the build-up to the World Cup. Shaheen Afridi (Pakistan) After aggravating a knee injury during last year’s Twenty20 World Cup final in Australia, Shaheen Afridi did not play white-ball cricket for Pakistan for several months, only returning to the squad in April. Since his return, he has taken 24 wickets in 12 matches, including a devastating four-wicket haul in a Group A clash against India at the Asia Cup in which the 23-year-old dismissed both Rohit Sharma and Virat Kohli. Kuldeep Yadav (India) While India’s bowling attack has no shortage of weapons, Kuldeep Yadav could prove to be the difference for the hosts with the wristspinner having taken 33 wickets in the 50-overs format this year. The 28-year-old’s miserly bowling can put heavy pressure on batters to score, allowing other bowlers to pick up wickets. He was named Player of the Series at the Asia Cup, boasting an economy of 3.61 and an average of 11.44, even though four other bowlers took more wickets than his haul of nine for the tournament. Matheesha Pathirana (Sri Lanka) Matheesha Pathirana has enjoyed a breakout year since making his ODI debut for Sri Lanka in June, taking 15 wickets in 10 matches. The 20-year-old, who has modelled his round-arm action on compatriot Lasith Malinga but with an even lower release point, took 11 wickets at the Asia Cup to top the charts for the tournament. He is also accustomed to playing in India, taking 19 wickets for the Chennai Super Kings in their title-winning campaign in this year’s Indian Premier League (IPL).","pubDate":"2023-10-03 18:05:33","image_url":null,"source_id":"thefrontierpost","source_priority":1484530,"country":["pakistan"],"category":["sports"],"language":"english"},{"article_id":"a87abab7f0f755fac62d472e631d3857","title":"Insta Reel Showing India's Pre-World Cup Shoot Is Viral. Fans Miss Kohli","link":"https://sports.ndtv.com/cricket/instagram-reel-showing-indias-pre-world-cup-shoot-is-viral-fans-miss-virat-kohli-4443532","keywords":null,"creator":null,"video_url":null,"description":"The Indian cricket team uploaded a reel on Monday from its pre-World Cup 2023 shoot and Virat Kohli was among the key players who misses out.","content":"The Indian cricket team uploaded a reel on Monday from its pre-World Cup 2023 shoot. The clip had India skipper Rohit Sharma , Jasprit Bumrah , KL Rahul , Suryakumar Yadav , Mohammed Shami , Mohammed Siraj , Ravichandran Ashwin , Shardul Thakur and Ishan Kishan all posing in front of a 360-degree rotating camera. \"Raring to go for #CWC23,\" wrote the Indian cricket team while sharing the picture on its official Instagram account. The fans were quick to notice that star India batter Virat Kohli was missing in the reel and they didn't waste time in questioning why the player was left out. Some even mentioned that the reel would be incomplete without Kohli. Watch the reel here: A post shared by Team India (@indiancricketteam) \"I am waiting for Virat but Virat is not in this video, why?\" wrote a fan. \"This reel is incomplete without Virat,\" wrote another fan. \"Without Virat Kohli in this reel is like a food without spice\", \"Where is our king Kohli\" and \"King missing\" were some of the other comments. Kohli had to reportedly fly back to Mumbai from Guwahati because of reported 'personal emergency' while the rest of the Indian squad arrived in Trivandrum for their second warm-up game against the Netherlands. Though the Board of Control for Cricket in India (BCCI) hasn't given any confirmation if Kohli will miss the warm-up game, a report claims that the star batter will return in time for the Netherlands clash -- set to take place on October 3 -- and join his teammates. Kohli remains one of the pillars in the Indian team. Though the Netherlands warm-up game isn't of absolute importance, the batter would want to get some runs under his belt considering the last match against England was abandoned due to rain.","pubDate":"2023-10-03 17:07:01","image_url":null,"source_id":"ndtv","source_priority":1204,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"dce291a1aacda53c92aee144ab801b96","title":"There’s no place like home as India mounts challenge for its third cricket World Cup","link":"https://torontosun.com/sports/other-sports/india-mounts-challenge-for-third-cricket-world-cup","keywords":["Other Sports","Sports"],"creator":["Norm Da Costa"],"video_url":null,"description":null,"content":"Mahendra Singh Dhoni wrote his way into cricket’s folklore when he smashed a six into the stands of Wankhede Stadium in Mumbai in 2011 to win the World Cup and send a billion Indians into a frenzy. He became the country’s most beloved person and, if he ran for the country’s top job as prime minister, he would win in a landslide. It may be a fading memory, but Dhoni’s unbeaten 91 against Sri Lanka was an unforgettable day in a country where they drink, eat, sleep and breathe cricket. They are hoping and praying that another Dhoni emerges to win the game’s biggest trophy for the third time. Since the tournament is being played on home soil, expectations of India repeating at home are high but that alone does not guarantee success. In 1987 and 1996, India fell in the semifinals as host and Australia didn’t even make it to the knockout stage when it held the event in 1992. All eyes, of course, will be on a powerful India, but there are three other nations that cannot be overlooked in this tournament that runs for 46 days from Oct. 5 to Nov. 19. There’s perennial favourite Australia, defending champion England and two-time finalist New Zealand. One cannot ignore the world’s two most unpredictable squads, Pakistan and South Africa. The others in the marquee event include Afghanistan, Bangladesh, the Netherlands and Sri Lanka. The tournament is known for producing sheer drama and, apart from Dhoni’s knock, the World Cup in England was a stunning success with the home team finally winning the one trophy that had eluded it. The final went down to the wire with England getting its hands on the trophy in the Super Over after the scores were tied at 241 runs. The scores were level in the Super Over as well, so England won the crown on the boundary comeback rule. It was controversial and made no sense, but it was in the rulebook. You can’t beat that for excitement, but there’s more in store in this is edition of the tournament as Indian fans will pack each and every of the 10 stadiums. And there will be thousands clamouring to watch the main clash between India and Pakistan at the Narendra Modi Stadium, the largest cricket facility in the world with a seating for 132,000, on Oct. 14. In the opener on Thursday at the same venue, there will be a re-run of that unforgettable 2019 final, with England facing New Zealand. In the land where cricket runs through the veins of its people, the team has never been short on talent. Led by Rohit Sharma the star-studded lineup of Virat Kohli, KL Rahul, Shubman Gill, Shreyas Iyer and Suryakumar Yadav can decimate bowling attacks with ease. It has incisive fast bowlers in Jasprit Bumrah, Mohammad Shami and Mohammad Siraj and world-class spinners in Ravichandran Ashwin and Ravindra Jadeja. The squad led by Jos Buttler is stacked with match winners including Ben Stokes. The batting looks formidable with Buttler, Jonny Bairstow, Dawid Malan, Stokes and Harry Brook. Expect paceman Mark Wood to make his mark along with Chris Woakes and Sam Curran. The spin will be in the capable hands of Adil Rashid and Moeen Ali. On paper this is the team to beat. Highly-talented batting lineup that includes Steve Smith, David Warner, Marnus Labuschagne and Shaun Marsh. Add Travis Head when he comes off his injury and others who could do damage with bat and ball are Cameron Green and spinner-batsman Glenn Maxwell. Add a fearsome trio of fast bowlers Pat Cummins, Mitchell Starc and Josh Hazlewood and Australia has a complete package capable of winning the event. Can the Black Caps make it to their third straight final? They have one of the most well-balanced squads with high-scoring batsmen in Devon Conway, Daryl Mitchell and former skipper Kane Williamson, James Neesham and Tom Latham. Tim Southee and Trent Boult will share the new ball with Lockie Ferguson and Matt Henry. Keep an eye on opening bat Rachin Ravindra and spinners Ish Sodhi and Mitchell Santner. New Zealand could finally break its winless duck. The most exciting team to watch with a number of world-class batsmen and bowlers. Fakhar Zaman and Imam-ul-Haq are solid openers and skipper Babar Azam and Mohammad Rizwan have been hot with the bat all year. The Pakistan attack led by Shaheen Shah Afridi, Haris Rauf and Hasan Ali will breathe fire in the absence of injured Naseem Shah. Superb spinners in Shadab Khan and Mohammad Nawaz who can also wield put up big scores Keep an eye on spinner Usama Mir. With a lethal combination of pace and spinners and a world-class batting lineup South Africa has the potential to go all the way. Led by skipper Temba Bavuma the rest are Quinton de Kock, Aiden Markram, Heinrich Klassen, Rassie van der Dussen and the hard-hitting David Miller. Klassen is in the form of his life and he will hold centre stage with de Kock who retires from white-ball cricket after this tournament. The bowling lineup is also a force to be reckoned with. There’s Kagiso Rabada, Lungi Ngidi and Marco Jansen and in the spin department will be Tabraiz Shamsi and Keshav Maharaj. Serious contender for the crown. Always considered one of the heavyweights the former World Cup champion will be minus ace spinner Wanindu Hasaranga and fast bowler Dusmantha Chameera through injury. But expect the island, under the captaincy of Dasun Shanaka, to still be a force to be reckoned with. Kusal Mendis and Charith Asalanka have been in tremendous form with the bat while Dunith Wellalage could provide a big threat with the ball. The country will always be remembered for sending England home packing in 2015 and it’s a squad that cannot be underestimated. Shakib Al Hasan, one of the game’s greatest all-rounders, will lead a squad that could well make the playoffs. Other players to watch are Litton Das, Hossain Shanto and Mustafizur Rahman. A country ravaged by war continues to play a major role internationally. With one of the world’s greatest spinners Rashin Khan pulling the strings don’t be surprised for this country to pull an upset or two. Others to watch are Mohammad Nabi, Mujeeb Ur Rahman and Noor Ahmad. Star batsman Mohammad Waseem leads the associate country that depends on Vriitya Aravind and Asif Khan for the runs. Asif recently made headlines for smashing a whirlwind 100 against Nepal in just 41 balls. That was the fastest ODI century by an associate batsman. Another associate country that has always made like difficult for the Test nations. Wesley Barresi and Roelof van der Merwe will be playing in their final World Cup tournament and will want to go out with a bang. Players to watch on the team include batsman Teja Nidamanuru, the aggressive Vikramjit Singh, Max O’Dowd and Logan van Beek. One Dutch star who could make a name for himself is all-rounder Bas de Leede. Check out our sports section for the latest news and analysis.","pubDate":"2023-10-03 17:06:05","image_url":"https://smartcdn.gprod.postmedia.digital/torontosun/wp-content/uploads/2023/10/1004india-cricket-nepal-scaled-e1696352584884.jpg?quality=100&strip=all","source_id":"torontosun","source_priority":12198,"country":["canada"],"category":["sports"],"language":"english"},{"article_id":"add57d991990d5e174968efa1a727f25","title":"Reece Topley ‘undercooked’ as England prepare for World Cup opener","link":"https://www.basingstokegazette.co.uk/sport/national/23831822.reece-topley-undercooked-england-prepare-world-cup-opener/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"The seamer and his team-mates have seen limited action since arriving in India ahead of their first clash against New Zealand on Thursday.","content":"England get their title defence under way in Ahmedabad on Thursday when they face New Zealand in a replay of the 2019 final, but their lead up to that curtain-raiser has been less than straightforward. A 38-hour trip to their warm-up base in Guwahati was branded “utter chaos” by Jonny Bairstow, before their first practice match against India was rained off without a ball being bowled. They were able to get some game time in against Bangladesh on Monday, but their four-wicket win came in a game reduced to 37 overs and none of their bowlers delivered more than five. That is a light load to take into a flagship fixture, but for Topley simply arriving at the Narendra Modi Stadium fit for duty would be a success of sorts. Little over a year ago, just days before the start of the T20 World Cup in Australia, he tripped on a boundary sponge and was ruled out of a tournament England went on to win. “If anything I would say that I’m pretty undercooked, but going into a long tournament I don’t necessarily think that is the worst thing,” the left-armer said after tuning up with a three-wicket haul. “I feel like I’m just about to come into my stride, hopefully. It’s not about tearing in at the warm up game and impressing the right people, it is about delivering in the nine group games. “That last group game is still pretty far away so I feel like I’m where I should be, but there is still some work to be done for sure. “After missing the first game due to the weather it was good for us to be able to get out on the field and for people to get what they needed from the experience which is a positive outcome. “We’ve all been doing our training after having a couple of weeks without matches so it is nice to get back in the groove with playing in the middle and it helps to assess what you still need to work on before that first proper match.” Topley, who has lost long spells of his career due to injury problems, has spoken openly about the trauma of his late withdrawal from last year’s trophy-winning side and has been doing everything in his power to avoid a repeat. Mercifully, his luck has held so far. “I’ve been steering clear of any mishaps and playing it quite safe, and I’ll continue to do so ahead of the first game,” he said. “Obviously I don’t want any repeat of what was so gutting last year in Brisbane at the T20 World Cup. It was a tough period to go through and I wouldn’t wish it on anyone because these are the moments and the events that you dream of being a part of and playing your part in. “Hopefully I can play my part this year and make up for lost time if anything and make a contribution to England going all the way again. I’m looking forward to getting some game time, just as I was anticipating last year, and this time hopefully I can help the team retain the trophy.” There is stiff competition for places among the England bowling ranks, with Topley joining Chris Woakes, Mark Wood, David Willey, Sam Curran and Gus Atkinson in a well-stocked pace attack. England expect it to be a group effort in India, with a draining schedule that involves new venues and internal flights for every group match, but everyone has their eye on the opening match as the first signs of a pecking order emerge. “I think everyone is fighting for a spot in that final XI. You’ve just got to do all you can to put your case forward to feature in that side,” Topley explained. “I felt like I gave a good account of myself in the run out. Whatever 11 they end up picking, the whole squad is right behind each other, it is going to take a squad effort to be successful out here and the side that goes out in each match will continue to live up to the exciting way we play our cricket.”","pubDate":"2023-10-03 17:02:25","image_url":"https://www.basingstokegazette.co.uk/resources/images/17293658/?type=app&htype=0","source_id":"basingstokegazette","source_priority":967252,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"f6d157b1a086cdefcd5264fad8a74696","title":"World Cup: Babar knock in vain as Australia warm up with 14-run win over Pakistan","link":"https://timesofindia.indiatimes.com/sports/cricket/icc-world-cup/odi-world-cup-babar-azam-knock-in-vain-as-australia-warm-up-with-14-run-win-over-pakistan/articleshow/104138982.cms","keywords":null,"creator":null,"video_url":null,"description":"The form of openers and bowlers remained a concern as Pakistan was handed a 14-run loss by Australia on the concluding day of the World Cup warm-ups in Hyderabad on Tuesday.","content":null,"pubDate":"2023-10-03 16:37:19","image_url":null,"source_id":"toi","source_priority":391,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"1fc89a6f6af43e1f6e6a858a9f538313","title":"No Bumrah! 2 Indians In Du Plessis' List Of Bowlers To Watch Out For In WC","link":"https://sports.ndtv.com/cricket/no-jasprit-bumrah-two-indians-in-faf-du-plessis-list-of-bowlers-to-watch-out-for-during-cricket-world-cup-2023-4443614","keywords":null,"creator":null,"video_url":null,"description":"Faf du Plessis picked four bowlers to look for during the Cricket World Cup 2023. Surprisingly, India's ace pacer Jasprit Bumrah failed to make a cut on the list.","content":"Out-of-favour South Africa batter Faf du Plessis picked four bowlers to look for during the Cricket World Cup 2023. Surprisingly, India's ace pacer Jasprit Bumrah failed to make a cut on the list despite the South African star naming two Indian bowlers in it. While du Plessis left out Bumrah, he picked Mohammed Siraj and Kuldeep Yadav among the four bowlers. South Africa's ace pacer Kagiso Rabada and New Zealand's pace spearhead Trent Boult completed the list. Du Plessis added that the performance of all the four bowlers will depend on the kind of surfaces they play on. \"I think it depends on the wickets. If the wicket has got something in it, someone like (Mohammed) Siraj who just nibbles the ball a little bit both ways, and he's trying the off stump the whole time,\" Du Plessis told Star Sports. \"(Trent) Boult and (Kagiso) Rabada, all those kinds of guys are going to be extremely successful. But if there is a little bit of spin, someone like Kuldeep (Yadav) has bowled really well in the last six months. When he gets his tail up and he gets one wicket, the next batter's coming in, he's quite tricky to face his first few balls because he spins the ball both ways,\" he added. Both Kuldeep and Siraj have been in sublime form for India, especially the fast bowler. Siraj is certainly in the form of his life. He recently claimed a six-wicket haul during India's Asia Cup 2023 final match against Sri Lanka, which was also his best ODI figures. While returning 6 for 21 in the summit clash, Siraj also equalled Chaminda Vaas ' record of five wickets in 16 balls in ODI cricket. Talking about Kuldeep, the left-arm wrist spinner has done some improvements in his bowling which have helped him better his wicket-taking abilities. The bowler is really important in providing some crucial breakthroughs to India in the middle-overs.","pubDate":"2023-10-03 16:29:20","image_url":null,"source_id":"ndtv","source_priority":1204,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"8656efb7e640d9524e232da30b9b41a1","title":"MS धोनी के नए लुक ने लूटी महफिल, तस्वीर देख याद आ जाएंगे पुराने वाले माही","link":"https://hindi.news18.com/cricket/ms-dhoni-new-look-black-t-shirt-goggles-viral-on-social-media-designed-by-hair-specialist-aalim-hakim-7720883.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"भारतीय टीम के पूर्व कप्तान महेंद्र सिंह धोनी (Mahendra Singh Dhoni) इन दिनों सुर्खियों में हैं. उनका लुक सोशल मीडिया पर काफी तेजी से वायरल हो रहा है, जिसमें वह काला चश्मा और काली टी-शर्ट पहने हुए नजर आ रहे हैं.","content":"महेंद्र सिंह धोनी का नया लुक वायरल. (Aalim Hakim Instagram) नई दिल्ली. भारतीय टीम के पूर्व कप्तान महेंद्र सिंह धोनी (Mahendra Singh Dhoni) क्रिकेट के मैदान पर हो या फिर उससे दूर. वह हमेशा फैंस के दिलों पर राज करते हैं. इन दिनों वह काफी सुर्खियों में हैं. दरअसल, उन्होंने अपने बाल बड़े कर लिए हैं और अपने नए लुक को लेकर काफी चर्चा में हैं. इस नए लुक में वह साल 2007 के टी20 विश्व कप वाले महेंद्र सिंह धोनी लग रहे हैं. धोनी का ये लुक सोशल मीडिया पर लोगों के बीच काफी चर्चा में है. हेयरस्पेशलिस्ट आलिम हकीम ने अपने इंस्टाग्राम अकाउंट से धोनी की फोटो पोस्ट की. आलिम ने फोटो के साथ कैप्शन में लिखा, “यस, ये हमारे महेंद्र सिंह धोनी हैं.” धोनी की इस फोटो पर घंटों में लाखों लाइक्स आने लगे और यह हर सोशल मीडिया एप्स पर तेजी से वायरल होने लगा. वह इस तस्वीर में काली टीशर्ट और काले चश्मे में दिखाई दे रहे हैं. बता दें कि धोनी आखिरी बार आईपीएल में चेन्नई सुपर किंग्स के लिए खेलते दिखे थे. ऐसा लग रहा था कि यह धोनी के लिए आखिरी आईपीएल होगा. लेकिन ऐसा नहीं हुआ. धोनी साल 2024 में भी अपनी टीम के लिए खेलते नजर आएंगे. Aus vs Pak: वर्ल्ड कप से पहले ग्लेन मैक्सवेल ने खेली तूफानी पारी, पाकिस्तान के गेंदबाजों को धोया, जड़े 6 छक्के पारुल चौधरी ने चीन में लहराया तिरंगा, 5000 मीटर रेस में जीता गोल्ड, आखिरी 30 सेकेंड में पलटी बाजी बता दें कि एम एस धोनी अब इंटरनेशनल क्रिकेट से संन्यास ले चुके हैं. वह साल 2019 में भारत के लिए आखिरी बार खेलते दिखे थे. उन्होंने न्यूजीलैंड के खिलाफ वनडे मैच खेला था. उस मैच में माही ने बैटिंग करते हुए अर्धशतक लगाया था और एक कैच पकड़ा था. पूरे करियर में धोनी ने भारत के लिए 90 टेस्ट, 350 वनडे और 98 टी20 इंटरनेशनल मैच खेले हैं. इस दौरान उन्होंने क्रमश: 4876, 10773 और 1617 रन बनाए हैं. धोनी भारत के सबसे सफल कप्तानों में से एक रहे हैं. उन्होंने भारत को 2 वर्ल्ड कप भी जिताए हैं. . Tags: Ms dhoni , Team india 25 की उम्र हो गई और अब तक नहीं मिली नौकरी, खाली बैठने से बेहतर शुरू करें ये काम, होती रहेगी पार्ट टाइम इनकम 31 सप्ताह की कठिन ट्रेनिंग के बाद अग्निवीर बने 96 युवा, देखें पासिंग आउट परेड की जोश भरने वाली तस्वीरें पिता बॉलीवुड के सुपरस्टार, बहन भी बन गईं टॉप हीरोइन, लेकिन स्टारकिड को छू भी नहीं सका ग्लैमर, फिर भी कमाती हैं करोड़ों","pubDate":"2023-10-03 15:52:39","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/10/Ms-DHoni-New-Look-2023-10-a5876dd2d1737075765e468cf67de69a-3x2.jpg","source_id":"hindinews18","source_priority":6509,"country":["india"],"category":["sports"],"language":"hindi"},{"article_id":"3e0e5c707dea85f44704bb119c3b7aa3","title":"'England are undercooked. It's madness!' As Jos Buttler's men prepare to defend the World Cup in India, Mail Sport's Nasser Hussain, David Lloyd, Paul Newman and Lawrence Booth discuss their hopes... and who will be the stars of the show","link":"https://www.dailymail.co.uk/sport/cricket/article-12590099/England-undercooked-madness-Jos-Buttlers-men-prepare-defend-World-Cup-India-Mail-Sports-Nasser-Hussain-David-Lloyd-Paul-Newman-Lawrence-Booth-discuss-hopes-stars-show.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"It's time for England to defend the World Cup they won so dramatically at Lord's four years ago. Can they go even better by retaining it in India?","content":"'England are undercooked. It's madness!' As Jos Buttler's men prepare to defend the World Cup in India, Mail Sport's Nasser Hussain, David Lloyd, Paul Newman and Lawrence Booth discuss their hopes... and who will be the stars of the show ODI cricket has taken a back seat since England won the last 50-over World Cup Jos Buttler's side face a daunting challenge to retain the trophy in India Mail Sport's new WhatsApp Channel: Get the breaking news and exclusives here By Lawrence Booth and Paul Newman and David Lloyd and Nasser Hussain For The Daily Mail Published: 22:30, 3 October 2023 | Updated: 22:47, 3 October 2023 e-mail View comments It’s time for England to defend the World Cup they won so dramatically at Lord’s four years ago. Can they go even better by retaining it in India? We asked our experts — former England captain Nasser Hussain, former England coach David ‘Bumble’ Lloyd, Cricket Correspondent Paul Newman and Wisden Editor Lawrence Booth. England have had nothing like the preparation they had for the 2019 World Cup triumph. What shape are they in? Lloyd: They’re undercooked. It was utterly ridiculous to play three 50-over matches against Ireland in the autumn. No wonder the World Cup players didn’t turn out. And next season the games against Australia finish even later. Complete madness. Ask any coach at this World Cup and I bet they will be dismayed at their lack of preparation. Newman : I agree but it’s the way of the world sadly. England looked in decent enough shape against New Zealand. Everything was about winning in England in 2019, so perhaps they have gone under the radar a bit now, but it’s a team that covers most bases. Retaining the World Cup in India would be the greatest of all England’s white-ball achievements. ODI cricket has taken a back seat since England won the last 50-over World Cup in 2019 Captain Jos Buttler's side face a tough challenge to retain the World Cup in India four years after their triumph Booth : If they went into 2019 as favourites, they are now just one of a few teams who have a chance; fifth in the rankings tells you they have lost some of their aura, despite holding both white-ball trophies. ODI cricket has taken a back seat since the last 50-over World Cup, and England will turn up in India hoping their big-game nous can carry them through. Hussain : It’s circumstances really. Everything was geared towards that 50-over World Cup last time but then there was a T20 World Cup to focus on which England won and red-ball was then prioritised with the Ashes and the start of the Ben Stokes-Brendon McCullum era. They’re not in as good a shape as 2019 but they’re still in a good plac England are something of a Dad’s Army side. Will there be a changing of the guard after this World Cup? Newman : Yes, this is the end of the greatest era in England’s limited-overs history. Eoin Morgan has been gone over a year, Alex Hales and Jason Roy have followed, and I can’t see more than half of this squad playing 50-over cricket again for England. Booth : Absolutely agree. For Jonny Bairstow, Joe Root, Ben Stokes, Moeen Ali, Chris Woakes, Adil Rashid and Mark Wood, this will be the last one-day World Cup. The rain-ruined series against Ireland gave us a glimpse of the future, with the likes of Phil Salt, Will Jacks, Sam Hain and Rehan Ahmed all thriving. Hussain : They are experienced but that’s what you want in India. They are starting to move on and quite a few players will be getting towards their mid-30s by the end of this tournament. Yes, they are blessed with a lot of emerging talent with the bat but they will have to keep an eye on the bowling depth as they move forward. Ben Stokes (left) and Joe Root will take part in their final ODI World Cup before retirement Lloyd : Agreed, Nass. This is a watershed tournament for a great white-ball side. Quite a few of them will step down afterwards. What you can say is that it’s a very experienced team and lads who have been there, done it and got the T-shirt will roll up their sleeves and get on with it. England got in a selection pickle. Have they called it right with Brook over Roy and was anybody left behind who shouldn’t have been? Booth : It’s harsh on Roy, but he hadn’t played for England since March, and the selectors would have been taking a huge gamble on his dodgy back. Harry Brook is a generational talent — the sooner he beds down in the ODI side, the better. I’d have been tempted to pick Ben Duckett, because he plays spin so well. Lloyd : When they picked that first squad, I said straight away, ‘Brook will still go’. He will be a sensation if they can get him in the team. They have ended up with the right squad. As soon as I saw Gus Atkinson in the T20 in Dubai early this year, I was shouting from the rooftops about England getting him in. I can’t think of anyone else who should have gone. Hussain : It was more to do with ICC regulations. When they named that first squad, Matthew Mott quickly said it was provisional. Other teams have got themselves in a pickle, too. Look at Bangladesh and Tamim Iqbal (recalled but now out injured). Roy is one of England’s great white-ball players, so they were right to pick him but back spasms and the chance to add Brook changed things. Newman : Yes, but they did get themselves in a pickle. They told Roy he was definitely going to the World Cup. They could have handled it better but they have done the right thing in going for Brook over Roy in the end. Jason’s England race is run and there would be no surprise if he throws in his lot fully with the franchise world very soon. Who are the key figures for England and where will the World Cup be won? Newman : I’m a bit concerned that what was first described as cramp had turned into a calf problem for Adil Rashid by the end of the New Zealand series. And that Mark Wood hasn’t played since the Ashes. If England are to win it, they need those two fit and firing. India should go a long way with the likes of Rohit Sharma (above) and Jasprit Bumrah Lloyd: The key figure will be an absent friend. Morgan ran that team with military precision and will be missed. He had an unshakable belief in his players and Jos has to show that, too. The World Cup will be won by bravery, taking a risk and seizing the moment. Booth : Among ODI openers with at least 1,000 runs, only Australia’s Travis Head has a better average and strike-rate than Bairstow’s 47 and 107. He knows Indian conditions well and if he gets England off to regular flyers, their batting depth will terrify opponents. Hussain : Buttler, England’s greatest ever white-ball batter, is the key. And teams still need glue in a 50-over innings, so Joe Root’s return to form will be vital. Who’ll be the stars of the show? Hussain : India will go a long way so Rohit Sharma with the bat and Jasprit Bumrah with the ball. So will England, so Buttler and Rashid for them. Mitch Marsh will stand out for Australia as will South Africa’s Heinrich Klaasen, who’s such a good player of spin. Newman : I’d love Dawid Malan to be a star. He has been under-estimated for years and still doesn’t fit into England’s way of doing things, but he’s made himself undroppable. I’m keeping an eye on Logan van Beek after he defeated West Indies virtually on his own in a qualifying Super Over to get the Netherlands to India. Booth : Look out for India’s Shubman Gill, who averages 66 from his 35 ODI innings, and has a strike-rate of 102. Head and Bairstow can be destructive, and Klaasen recently pummelled Australia for 174 off 83 balls. Among the bowlers, I’d expect Bumrah and Afghanistan spinner Rashid Khan to shine. Lloyd: If Brook gets in, he will light up the tournament. Bairstow will be very influential and Stokes will be ultra-influential. I have a hunch Shreyas Iyer will be a big star for India but they will miss Rishabh Pant. India will walk it on home soil, won’t they? But if not, who wins? And who’s your final four? Mitch Marsh will be stand out for Australia and Travis Head (above) can be destructive Lloyd : India have 13 men — 11 on the field, home conditions and the crowd. Can they lose their egos and just do the job? If they do, they should walk it. Can South Africa lose their choker tag? They have to sometime and this is as good a chance as they will get. If England draw on all that experience, they will be there. And always Australia. Hussain : India are favourites. Can they play no-fear cricket in knockout games? Also their batters don’t bowl and their bowlers don’t bat, so their balance will be interesting. My semi-finalists are India, England, Australia and Pakistan. Newman : The last three 50-over World Cups have been won by the home side and this shouldn’t be any different. But I wonder if India will be selfless enough. I’ve heard the case for South Africa but they always seem to cock it up. My last four are England, India, Australia and I was going to say Chris Silverwood’s Sri Lanka, but they have big injury problems. I’ll go for Pakistan. Booth : One bad day in the semi-finals, as India were reminded by England in the last T20 World Cup, can undo all the good work. But, yes, the hosts look in prime form. If not India then England, with Australia and Pakistan making up the last four. But New Zealand will be in the mix and even South Africa. Share or comment on this article: 'England are undercooked. It's madness!' As Jos Buttler's men prepare to defend the World Cup in India, Mail Sport's Nasser Hussain, David Lloyd, Paul Newman and Lawrence Booth discuss their hopes... and who will be the stars of the show e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-10-03 21:47:15","image_url":"https://i.dailymail.co.uk/1s/2023/10/03/19/76127739-0-image-a-3_1696358549847.jpg","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"fac6d3fd794c8979df89242cf9d68de7","title":"Storm to hit senior divison","link":"https://brimbanknorthwest.starweekly.com.au/sport/storm-to-hit-senior-divison/","keywords":["Sport"],"creator":["jimjin"],"video_url":null,"description":"Sydenham-Hillside is ready for the challenge of the Victorian Turf Cricket Association senior division season. It has been a rapid... The post Storm to hit senior divison appeared first on Brimbank & North West.","content":"Sydenham-Hillside is ready for the challenge of the Victorian Turf Cricket Association senior division season. It has been a rapid rise of the VTCA for the Storm, winning premierships in four of the last five seasons, resulting in it climbing from division 4 in the 2018-19 season to senior division for the upcoming summer. Now the Storm is ready to hit the competition once again said new coach Warren Hackney. “It’s going to be a big step but we’re looking forward to the challenge,” he said. “We’ve been pretty fortunate and been able to hold onto most of the guys and top up a little bit by adding what we thought might help our push in the higher grade. “So we’re hopeful of being competitive.” One of the Storm’s big signings for the summer is Scottish fast bowler Adrian Neill. Neill has a number of international appearances under his belt and has recently been involved in World Cup qualifiers where Scotland fell agonisingly short of qualifying for the ICC Cricket World Cup being held in India later this month. “We’re excited by the fact that he’ll be able to offer us something a bit different to what we’ve had with his extra height and bounce,” Hackney said. “So we’re looking forward to having him on board. “We’ve also got a couple of guys who we’re looking to bring in who are not as big of names… but they’re guys that we envisage will help us improve.” It’s Hackney’s first year at the helm of the Storm, after being a champion player of the club being the all-time leading first XI run-scorer, a five-time premiership player, a former captain amongst other accolades. Now as he sets to lead the club he loves to senior division glory, Hackney is not setting a ceiling at what his side can accomplish. “The first goal is to stay up,” he said. “But we’ve been fortunate enough to climb through the grades fairly quickly, so each year we’ve not wanted to set any limit in what we thought could be achieved. “Although this year is a much bigger step I feel than those we’ve taken in the last four or five years, we’re not wanting to put too much pressure on ourselves. “So who knows if we do manage to get things right, the sky’s the limit, anything’s possible. “We’d be wrapped to think we could make finals and if you can do that, anything’s possible from there.” The Storm will face last year’s grand finalists Deer Park when the season kicks off on October 7. Harper Sercombe","pubDate":"2023-10-03 20:00:27","image_url":null,"source_id":"brimbanknorthwest","source_priority":2256086,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"0f4354ee01b1b5b6bf36a168cb83b5b9","title":"WC Warm-up: Australia Edge Pakistan As India Go 3,400km For Washout","link":"https://sports.ndtv.com/cricket/cricket-world-cup-warm-up-australia-edge-pakistan-as-india-go-3-400km-for-world-cup-washout-4447383","keywords":null,"creator":null,"video_url":null,"description":"Australia edged out Pakistan by 14 runs in a high-scoring World Cup warm-up on Tuesday as India travelled 3,400km from one corner of the country to another only to be defeated by torrential rain.","content":"Australia edged out Pakistan by 14 runs in a high-scoring World Cup warm-up on Tuesday as India travelled 3,400km from one corner of the country to another only to be defeated by torrential rain. In Hyderabad, Australia made 351-7 from their 50 overs with Glenn Maxwell particularly ruthless on Pakistan's bowlers. Maxwell cracked 77 off 71 balls with four boundaries and six sixes. Cameron Green was undefeated on 50, David Warner clubbed three sixes in his 48 while Josh Inglis also made 48. Marnus Labuschagne , a late call-up by the five-time World Cup winners, contributed 40. Pakistan leg-spinner Usama Mir impressed with 2-31 as he dismissed Warner and Mitchell Marsh after the openers had put on 83 for the first wicket. Mir's leg-spinning partner Shadab Khan was expensive with his one wicket costing 69 runs. In reply, Pakistan, who lost by five wickets to New Zealand in their opening warm-up, were dismissed for 337 in the 48th over. Captain Babar Azam hit a fluent, unbeaten 90 off 59 balls with 11 boundaries and two sixes and shared a 144-run partnership with Iftikhar Ahmed who made 83 off 85 deliveries. Mohammad Nawaz contributed 50 but Pakistan fell just short. At Guwahati, Kusal Mendis scored a breathtaking 158 as Sri Lanka were bowled out for 294 by Afghanistan before slipping to a six-wicket defeat in a rain-hit match. Mendis, captain for the day with Dasun Shanaka sitting out the final warm-up, made his runs off only 87 balls. He hit 19 fours and nine sixes as Afghanistan struggled to apply the brakes with only former skipper Mohammad Nabi enjoying sustained success with 4-44. Advertisement Rahmanullah century Afghanistan were sitting comfortably on 118-1 in the 21st over in reply when rain stopped play. They were then set an adjusted target of 257 off 42 overs and cruised home with 23 balls to spare. Opener Rahmanullah Gurbaz smashed 119 from 92 balls with eight fours and nine sixes, sharing a 212-run second wicket partnership with Rahmat Shah . Rahmat's 93 was made off 82 balls and featured 10 fours and three sixes. Meanwhile, India's superstar cricketers endured a 3,400km (2,170 miles) cross-country journey to play a warm-up only for the match to be abandoned without a ball being bowled. India were to face the Netherlands in Thiruvananthapuram, on the southern tip of India, but they were left kicking their heels in the rain. On Saturday, their scheduled game against defending champions England up in the north-eastern city of Guwahati was also washed out. In total, the wet weather forced three warm-up matches to be abandoned while four others were rain-affected, leaving teams and players frustrated ahead of Thursday's World Cup start. However, the weather forecast for the rest of the week in Ahmedabad, Hyderabad and Dharamsala -- venues for first three days of the tournament -- is optimistic with sunshine instead of showers. England will play New Zealand in the tournament opener at the world's biggest cricket stadium in Ahmedabad on Thursday. Pakistan clash with the Netherlands in Hyderabad on Friday, while Afghanistan and Bangladesh play in Dharamsala on Saturday. (Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)","pubDate":"2023-10-03 18:50:54","image_url":null,"source_id":"ndtv","source_priority":1204,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"24082a7d39f87cddfaef3e3f2c48335a","title":"Five bowlers to watch at the 2023 World Cup","link":"https://thefrontierpost.com/five-bowlers-to-watch-at-the-2023-world-cup/","keywords":["Sports"],"creator":["The Frontier Post"],"video_url":null,"description":"NEW DELHI (Reuters): The following are five bowlers to watch at the World Cup in India: Mark Wood (England) Mark Wood’s lethal pace made him an integral part of England World Cup-winning side in 2019, taking 18 wickets in the tournament, but injuries have limited him to just eight ODI matches since 2020. However, he […]","content":"NEW DELHI (Reuters): The following are five bowlers to watch at the World Cup in India: Mark Wood (England) Mark Wood’s lethal pace made him an integral part of England World Cup-winning side in 2019, taking 18 wickets in the tournament, but injuries have limited him to just eight ODI matches since 2020. However, he has been in great touch in test cricket this year with 14 wickets in three matches and if he can translate that form into the 50-overs format he could once again prove to be a crucial asset for England. Adam Zampa (Australia) Adam Zampa will be the only specialist spinner in the Australia squad for the World Cup. He has taken 45 wickets in the 50-over format since the beginning of 2022, and played a key role for Australia in their ODI series victory over India in March. While he equalled an unwanted record by bowling the joint-most expensive spell by an Australian in an ODI defeat to South Africa last month, the 31-year-old recovered well, picking up six wickets in his last three matches in the build-up to the World Cup. Shaheen Afridi (Pakistan) After aggravating a knee injury during last year’s Twenty20 World Cup final in Australia, Shaheen Afridi did not play white-ball cricket for Pakistan for several months, only returning to the squad in April. Since his return, he has taken 24 wickets in 12 matches, including a devastating four-wicket haul in a Group A clash against India at the Asia Cup in which the 23-year-old dismissed both Rohit Sharma and Virat Kohli. Kuldeep Yadav (India) While India’s bowling attack has no shortage of weapons, Kuldeep Yadav could prove to be the difference for the hosts with the wristspinner having taken 33 wickets in the 50-overs format this year. The 28-year-old’s miserly bowling can put heavy pressure on batters to score, allowing other bowlers to pick up wickets. He was named Player of the Series at the Asia Cup, boasting an economy of 3.61 and an average of 11.44, even though four other bowlers took more wickets than his haul of nine for the tournament. Matheesha Pathirana (Sri Lanka) Matheesha Pathirana has enjoyed a breakout year since making his ODI debut for Sri Lanka in June, taking 15 wickets in 10 matches. The 20-year-old, who has modelled his round-arm action on compatriot Lasith Malinga but with an even lower release point, took 11 wickets at the Asia Cup to top the charts for the tournament. He is also accustomed to playing in India, taking 19 wickets for the Chennai Super Kings in their title-winning campaign in this year’s Indian Premier League (IPL).","pubDate":"2023-10-03 18:05:33","image_url":null,"source_id":"thefrontierpost","source_priority":1484530,"country":["pakistan"],"category":["sports"],"language":"english"},{"article_id":"a87abab7f0f755fac62d472e631d3857","title":"Insta Reel Showing India's Pre-World Cup Shoot Is Viral. Fans Miss Kohli","link":"https://sports.ndtv.com/cricket/instagram-reel-showing-indias-pre-world-cup-shoot-is-viral-fans-miss-virat-kohli-4443532","keywords":null,"creator":null,"video_url":null,"description":"The Indian cricket team uploaded a reel on Monday from its pre-World Cup 2023 shoot and Virat Kohli was among the key players who misses out.","content":"The Indian cricket team uploaded a reel on Monday from its pre-World Cup 2023 shoot. The clip had India skipper Rohit Sharma , Jasprit Bumrah , KL Rahul , Suryakumar Yadav , Mohammed Shami , Mohammed Siraj , Ravichandran Ashwin , Shardul Thakur and Ishan Kishan all posing in front of a 360-degree rotating camera. \"Raring to go for #CWC23,\" wrote the Indian cricket team while sharing the picture on its official Instagram account. The fans were quick to notice that star India batter Virat Kohli was missing in the reel and they didn't waste time in questioning why the player was left out. Some even mentioned that the reel would be incomplete without Kohli. Watch the reel here: A post shared by Team India (@indiancricketteam) \"I am waiting for Virat but Virat is not in this video, why?\" wrote a fan. \"This reel is incomplete without Virat,\" wrote another fan. \"Without Virat Kohli in this reel is like a food without spice\", \"Where is our king Kohli\" and \"King missing\" were some of the other comments. Kohli had to reportedly fly back to Mumbai from Guwahati because of reported 'personal emergency' while the rest of the Indian squad arrived in Trivandrum for their second warm-up game against the Netherlands. Though the Board of Control for Cricket in India (BCCI) hasn't given any confirmation if Kohli will miss the warm-up game, a report claims that the star batter will return in time for the Netherlands clash -- set to take place on October 3 -- and join his teammates. Kohli remains one of the pillars in the Indian team. Though the Netherlands warm-up game isn't of absolute importance, the batter would want to get some runs under his belt considering the last match against England was abandoned due to rain.","pubDate":"2023-10-03 17:07:01","image_url":null,"source_id":"ndtv","source_priority":1204,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"dce291a1aacda53c92aee144ab801b96","title":"There’s no place like home as India mounts challenge for its third cricket World Cup","link":"https://torontosun.com/sports/other-sports/india-mounts-challenge-for-third-cricket-world-cup","keywords":["Other Sports","Sports"],"creator":["Norm Da Costa"],"video_url":null,"description":null,"content":"Mahendra Singh Dhoni wrote his way into cricket’s folklore when he smashed a six into the stands of Wankhede Stadium in Mumbai in 2011 to win the World Cup and send a billion Indians into a frenzy. He became the country’s most beloved person and, if he ran for the country’s top job as prime minister, he would win in a landslide. It may be a fading memory, but Dhoni’s unbeaten 91 against Sri Lanka was an unforgettable day in a country where they drink, eat, sleep and breathe cricket. They are hoping and praying that another Dhoni emerges to win the game’s biggest trophy for the third time. Since the tournament is being played on home soil, expectations of India repeating at home are high but that alone does not guarantee success. In 1987 and 1996, India fell in the semifinals as host and Australia didn’t even make it to the knockout stage when it held the event in 1992. All eyes, of course, will be on a powerful India, but there are three other nations that cannot be overlooked in this tournament that runs for 46 days from Oct. 5 to Nov. 19. There’s perennial favourite Australia, defending champion England and two-time finalist New Zealand. One cannot ignore the world’s two most unpredictable squads, Pakistan and South Africa. The others in the marquee event include Afghanistan, Bangladesh, the Netherlands and Sri Lanka. The tournament is known for producing sheer drama and, apart from Dhoni’s knock, the World Cup in England was a stunning success with the home team finally winning the one trophy that had eluded it. The final went down to the wire with England getting its hands on the trophy in the Super Over after the scores were tied at 241 runs. The scores were level in the Super Over as well, so England won the crown on the boundary comeback rule. It was controversial and made no sense, but it was in the rulebook. You can’t beat that for excitement, but there’s more in store in this is edition of the tournament as Indian fans will pack each and every of the 10 stadiums. And there will be thousands clamouring to watch the main clash between India and Pakistan at the Narendra Modi Stadium, the largest cricket facility in the world with a seating for 132,000, on Oct. 14. In the opener on Thursday at the same venue, there will be a re-run of that unforgettable 2019 final, with England facing New Zealand. In the land where cricket runs through the veins of its people, the team has never been short on talent. Led by Rohit Sharma the star-studded lineup of Virat Kohli, KL Rahul, Shubman Gill, Shreyas Iyer and Suryakumar Yadav can decimate bowling attacks with ease. It has incisive fast bowlers in Jasprit Bumrah, Mohammad Shami and Mohammad Siraj and world-class spinners in Ravichandran Ashwin and Ravindra Jadeja. The squad led by Jos Buttler is stacked with match winners including Ben Stokes. The batting looks formidable with Buttler, Jonny Bairstow, Dawid Malan, Stokes and Harry Brook. Expect paceman Mark Wood to make his mark along with Chris Woakes and Sam Curran. The spin will be in the capable hands of Adil Rashid and Moeen Ali. On paper this is the team to beat. Highly-talented batting lineup that includes Steve Smith, David Warner, Marnus Labuschagne and Shaun Marsh. Add Travis Head when he comes off his injury and others who could do damage with bat and ball are Cameron Green and spinner-batsman Glenn Maxwell. Add a fearsome trio of fast bowlers Pat Cummins, Mitchell Starc and Josh Hazlewood and Australia has a complete package capable of winning the event. Can the Black Caps make it to their third straight final? They have one of the most well-balanced squads with high-scoring batsmen in Devon Conway, Daryl Mitchell and former skipper Kane Williamson, James Neesham and Tom Latham. Tim Southee and Trent Boult will share the new ball with Lockie Ferguson and Matt Henry. Keep an eye on opening bat Rachin Ravindra and spinners Ish Sodhi and Mitchell Santner. New Zealand could finally break its winless duck. The most exciting team to watch with a number of world-class batsmen and bowlers. Fakhar Zaman and Imam-ul-Haq are solid openers and skipper Babar Azam and Mohammad Rizwan have been hot with the bat all year. The Pakistan attack led by Shaheen Shah Afridi, Haris Rauf and Hasan Ali will breathe fire in the absence of injured Naseem Shah. Superb spinners in Shadab Khan and Mohammad Nawaz who can also wield put up big scores Keep an eye on spinner Usama Mir. With a lethal combination of pace and spinners and a world-class batting lineup South Africa has the potential to go all the way. Led by skipper Temba Bavuma the rest are Quinton de Kock, Aiden Markram, Heinrich Klassen, Rassie van der Dussen and the hard-hitting David Miller. Klassen is in the form of his life and he will hold centre stage with de Kock who retires from white-ball cricket after this tournament. The bowling lineup is also a force to be reckoned with. There’s Kagiso Rabada, Lungi Ngidi and Marco Jansen and in the spin department will be Tabraiz Shamsi and Keshav Maharaj. Serious contender for the crown. Always considered one of the heavyweights the former World Cup champion will be minus ace spinner Wanindu Hasaranga and fast bowler Dusmantha Chameera through injury. But expect the island, under the captaincy of Dasun Shanaka, to still be a force to be reckoned with. Kusal Mendis and Charith Asalanka have been in tremendous form with the bat while Dunith Wellalage could provide a big threat with the ball. The country will always be remembered for sending England home packing in 2015 and it’s a squad that cannot be underestimated. Shakib Al Hasan, one of the game’s greatest all-rounders, will lead a squad that could well make the playoffs. Other players to watch are Litton Das, Hossain Shanto and Mustafizur Rahman. A country ravaged by war continues to play a major role internationally. With one of the world’s greatest spinners Rashin Khan pulling the strings don’t be surprised for this country to pull an upset or two. Others to watch are Mohammad Nabi, Mujeeb Ur Rahman and Noor Ahmad. Star batsman Mohammad Waseem leads the associate country that depends on Vriitya Aravind and Asif Khan for the runs. Asif recently made headlines for smashing a whirlwind 100 against Nepal in just 41 balls. That was the fastest ODI century by an associate batsman. Another associate country that has always made like difficult for the Test nations. Wesley Barresi and Roelof van der Merwe will be playing in their final World Cup tournament and will want to go out with a bang. Players to watch on the team include batsman Teja Nidamanuru, the aggressive Vikramjit Singh, Max O’Dowd and Logan van Beek. One Dutch star who could make a name for himself is all-rounder Bas de Leede. Check out our sports section for the latest news and analysis.","pubDate":"2023-10-03 17:06:05","image_url":"https://smartcdn.gprod.postmedia.digital/torontosun/wp-content/uploads/2023/10/1004india-cricket-nepal-scaled-e1696352584884.jpg?quality=100&strip=all","source_id":"torontosun","source_priority":12198,"country":["canada"],"category":["sports"],"language":"english"},{"article_id":"add57d991990d5e174968efa1a727f25","title":"Reece Topley ‘undercooked’ as England prepare for World Cup opener","link":"https://www.basingstokegazette.co.uk/sport/national/23831822.reece-topley-undercooked-england-prepare-world-cup-opener/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"The seamer and his team-mates have seen limited action since arriving in India ahead of their first clash against New Zealand on Thursday.","content":"England get their title defence under way in Ahmedabad on Thursday when they face New Zealand in a replay of the 2019 final, but their lead up to that curtain-raiser has been less than straightforward. A 38-hour trip to their warm-up base in Guwahati was branded “utter chaos” by Jonny Bairstow, before their first practice match against India was rained off without a ball being bowled. They were able to get some game time in against Bangladesh on Monday, but their four-wicket win came in a game reduced to 37 overs and none of their bowlers delivered more than five. That is a light load to take into a flagship fixture, but for Topley simply arriving at the Narendra Modi Stadium fit for duty would be a success of sorts. Little over a year ago, just days before the start of the T20 World Cup in Australia, he tripped on a boundary sponge and was ruled out of a tournament England went on to win. “If anything I would say that I’m pretty undercooked, but going into a long tournament I don’t necessarily think that is the worst thing,” the left-armer said after tuning up with a three-wicket haul. “I feel like I’m just about to come into my stride, hopefully. It’s not about tearing in at the warm up game and impressing the right people, it is about delivering in the nine group games. “That last group game is still pretty far away so I feel like I’m where I should be, but there is still some work to be done for sure. “After missing the first game due to the weather it was good for us to be able to get out on the field and for people to get what they needed from the experience which is a positive outcome. “We’ve all been doing our training after having a couple of weeks without matches so it is nice to get back in the groove with playing in the middle and it helps to assess what you still need to work on before that first proper match.” Topley, who has lost long spells of his career due to injury problems, has spoken openly about the trauma of his late withdrawal from last year’s trophy-winning side and has been doing everything in his power to avoid a repeat. Mercifully, his luck has held so far. “I’ve been steering clear of any mishaps and playing it quite safe, and I’ll continue to do so ahead of the first game,” he said. “Obviously I don’t want any repeat of what was so gutting last year in Brisbane at the T20 World Cup. It was a tough period to go through and I wouldn’t wish it on anyone because these are the moments and the events that you dream of being a part of and playing your part in. “Hopefully I can play my part this year and make up for lost time if anything and make a contribution to England going all the way again. I’m looking forward to getting some game time, just as I was anticipating last year, and this time hopefully I can help the team retain the trophy.” There is stiff competition for places among the England bowling ranks, with Topley joining Chris Woakes, Mark Wood, David Willey, Sam Curran and Gus Atkinson in a well-stocked pace attack. England expect it to be a group effort in India, with a draining schedule that involves new venues and internal flights for every group match, but everyone has their eye on the opening match as the first signs of a pecking order emerge. “I think everyone is fighting for a spot in that final XI. You’ve just got to do all you can to put your case forward to feature in that side,” Topley explained. “I felt like I gave a good account of myself in the run out. Whatever 11 they end up picking, the whole squad is right behind each other, it is going to take a squad effort to be successful out here and the side that goes out in each match will continue to live up to the exciting way we play our cricket.”","pubDate":"2023-10-03 17:02:25","image_url":"https://www.basingstokegazette.co.uk/resources/images/17293658/?type=app&htype=0","source_id":"basingstokegazette","source_priority":967252,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"f6d157b1a086cdefcd5264fad8a74696","title":"World Cup: Babar knock in vain as Australia warm up with 14-run win over Pakistan","link":"https://timesofindia.indiatimes.com/sports/cricket/icc-world-cup/odi-world-cup-babar-azam-knock-in-vain-as-australia-warm-up-with-14-run-win-over-pakistan/articleshow/104138982.cms","keywords":null,"creator":null,"video_url":null,"description":"The form of openers and bowlers remained a concern as Pakistan was handed a 14-run loss by Australia on the concluding day of the World Cup warm-ups in Hyderabad on Tuesday.","content":null,"pubDate":"2023-10-03 16:37:19","image_url":null,"source_id":"toi","source_priority":391,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"1fc89a6f6af43e1f6e6a858a9f538313","title":"No Bumrah! 2 Indians In Du Plessis' List Of Bowlers To Watch Out For In WC","link":"https://sports.ndtv.com/cricket/no-jasprit-bumrah-two-indians-in-faf-du-plessis-list-of-bowlers-to-watch-out-for-during-cricket-world-cup-2023-4443614","keywords":null,"creator":null,"video_url":null,"description":"Faf du Plessis picked four bowlers to look for during the Cricket World Cup 2023. Surprisingly, India's ace pacer Jasprit Bumrah failed to make a cut on the list.","content":"Out-of-favour South Africa batter Faf du Plessis picked four bowlers to look for during the Cricket World Cup 2023. Surprisingly, India's ace pacer Jasprit Bumrah failed to make a cut on the list despite the South African star naming two Indian bowlers in it. While du Plessis left out Bumrah, he picked Mohammed Siraj and Kuldeep Yadav among the four bowlers. South Africa's ace pacer Kagiso Rabada and New Zealand's pace spearhead Trent Boult completed the list. Du Plessis added that the performance of all the four bowlers will depend on the kind of surfaces they play on. \"I think it depends on the wickets. If the wicket has got something in it, someone like (Mohammed) Siraj who just nibbles the ball a little bit both ways, and he's trying the off stump the whole time,\" Du Plessis told Star Sports. \"(Trent) Boult and (Kagiso) Rabada, all those kinds of guys are going to be extremely successful. But if there is a little bit of spin, someone like Kuldeep (Yadav) has bowled really well in the last six months. When he gets his tail up and he gets one wicket, the next batter's coming in, he's quite tricky to face his first few balls because he spins the ball both ways,\" he added. Both Kuldeep and Siraj have been in sublime form for India, especially the fast bowler. Siraj is certainly in the form of his life. He recently claimed a six-wicket haul during India's Asia Cup 2023 final match against Sri Lanka, which was also his best ODI figures. While returning 6 for 21 in the summit clash, Siraj also equalled Chaminda Vaas ' record of five wickets in 16 balls in ODI cricket. Talking about Kuldeep, the left-arm wrist spinner has done some improvements in his bowling which have helped him better his wicket-taking abilities. The bowler is really important in providing some crucial breakthroughs to India in the middle-overs.","pubDate":"2023-10-03 16:29:20","image_url":null,"source_id":"ndtv","source_priority":1204,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"8656efb7e640d9524e232da30b9b41a1","title":"MS धोनी के नए लुक ने लूटी महफिल, तस्वीर देख याद आ जाएंगे पुराने वाले माही","link":"https://hindi.news18.com/cricket/ms-dhoni-new-look-black-t-shirt-goggles-viral-on-social-media-designed-by-hair-specialist-aalim-hakim-7720883.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"भारतीय टीम के पूर्व कप्तान महेंद्र सिंह धोनी (Mahendra Singh Dhoni) इन दिनों सुर्खियों में हैं. उनका लुक सोशल मीडिया पर काफी तेजी से वायरल हो रहा है, जिसमें वह काला चश्मा और काली टी-शर्ट पहने हुए नजर आ रहे हैं.","content":"महेंद्र सिंह धोनी का नया लुक वायरल. (Aalim Hakim Instagram) नई दिल्ली. भारतीय टीम के पूर्व कप्तान महेंद्र सिंह धोनी (Mahendra Singh Dhoni) क्रिकेट के मैदान पर हो या फिर उससे दूर. वह हमेशा फैंस के दिलों पर राज करते हैं. इन दिनों वह काफी सुर्खियों में हैं. दरअसल, उन्होंने अपने बाल बड़े कर लिए हैं और अपने नए लुक को लेकर काफी चर्चा में हैं. इस नए लुक में वह साल 2007 के टी20 विश्व कप वाले महेंद्र सिंह धोनी लग रहे हैं. धोनी का ये लुक सोशल मीडिया पर लोगों के बीच काफी चर्चा में है. हेयरस्पेशलिस्ट आलिम हकीम ने अपने इंस्टाग्राम अकाउंट से धोनी की फोटो पोस्ट की. आलिम ने फोटो के साथ कैप्शन में लिखा, “यस, ये हमारे महेंद्र सिंह धोनी हैं.” धोनी की इस फोटो पर घंटों में लाखों लाइक्स आने लगे और यह हर सोशल मीडिया एप्स पर तेजी से वायरल होने लगा. वह इस तस्वीर में काली टीशर्ट और काले चश्मे में दिखाई दे रहे हैं. बता दें कि धोनी आखिरी बार आईपीएल में चेन्नई सुपर किंग्स के लिए खेलते दिखे थे. ऐसा लग रहा था कि यह धोनी के लिए आखिरी आईपीएल होगा. लेकिन ऐसा नहीं हुआ. धोनी साल 2024 में भी अपनी टीम के लिए खेलते नजर आएंगे. Aus vs Pak: वर्ल्ड कप से पहले ग्लेन मैक्सवेल ने खेली तूफानी पारी, पाकिस्तान के गेंदबाजों को धोया, जड़े 6 छक्के पारुल चौधरी ने चीन में लहराया तिरंगा, 5000 मीटर रेस में जीता गोल्ड, आखिरी 30 सेकेंड में पलटी बाजी बता दें कि एम एस धोनी अब इंटरनेशनल क्रिकेट से संन्यास ले चुके हैं. वह साल 2019 में भारत के लिए आखिरी बार खेलते दिखे थे. उन्होंने न्यूजीलैंड के खिलाफ वनडे मैच खेला था. उस मैच में माही ने बैटिंग करते हुए अर्धशतक लगाया था और एक कैच पकड़ा था. पूरे करियर में धोनी ने भारत के लिए 90 टेस्ट, 350 वनडे और 98 टी20 इंटरनेशनल मैच खेले हैं. इस दौरान उन्होंने क्रमश: 4876, 10773 और 1617 रन बनाए हैं. धोनी भारत के सबसे सफल कप्तानों में से एक रहे हैं. उन्होंने भारत को 2 वर्ल्ड कप भी जिताए हैं. . Tags: Ms dhoni , Team india 25 की उम्र हो गई और अब तक नहीं मिली नौकरी, खाली बैठने से बेहतर शुरू करें ये काम, होती रहेगी पार्ट टाइम इनकम 31 सप्ताह की कठिन ट्रेनिंग के बाद अग्निवीर बने 96 युवा, देखें पासिंग आउट परेड की जोश भरने वाली तस्वीरें पिता बॉलीवुड के सुपरस्टार, बहन भी बन गईं टॉप हीरोइन, लेकिन स्टारकिड को छू भी नहीं सका ग्लैमर, फिर भी कमाती हैं करोड़ों","pubDate":"2023-10-03 15:52:39","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/10/Ms-DHoni-New-Look-2023-10-a5876dd2d1737075765e468cf67de69a-3x2.jpg","source_id":"hindinews18","source_priority":6509,"country":["india"],"category":["sports"],"language":"hindi"},{"article_id":"3e0e5c707dea85f44704bb119c3b7aa3","title":"'England are undercooked. It's madness!' As Jos Buttler's men prepare to defend the World Cup in India, Mail Sport's Nasser Hussain, David Lloyd, Paul Newman and Lawrence Booth discuss their hopes... and who will be the stars of the show","link":"https://www.dailymail.co.uk/sport/cricket/article-12590099/England-undercooked-madness-Jos-Buttlers-men-prepare-defend-World-Cup-India-Mail-Sports-Nasser-Hussain-David-Lloyd-Paul-Newman-Lawrence-Booth-discuss-hopes-stars-show.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"It's time for England to defend the World Cup they won so dramatically at Lord's four years ago. Can they go even better by retaining it in India?","content":"'England are undercooked. It's madness!' As Jos Buttler's men prepare to defend the World Cup in India, Mail Sport's Nasser Hussain, David Lloyd, Paul Newman and Lawrence Booth discuss their hopes... and who will be the stars of the show ODI cricket has taken a back seat since England won the last 50-over World Cup Jos Buttler's side face a daunting challenge to retain the trophy in India Mail Sport's new WhatsApp Channel: Get the breaking news and exclusives here By Lawrence Booth and Paul Newman and David Lloyd and Nasser Hussain For The Daily Mail Published: 22:30, 3 October 2023 | Updated: 22:47, 3 October 2023 e-mail View comments It’s time for England to defend the World Cup they won so dramatically at Lord’s four years ago. Can they go even better by retaining it in India? We asked our experts — former England captain Nasser Hussain, former England coach David ‘Bumble’ Lloyd, Cricket Correspondent Paul Newman and Wisden Editor Lawrence Booth. England have had nothing like the preparation they had for the 2019 World Cup triumph. What shape are they in? Lloyd: They’re undercooked. It was utterly ridiculous to play three 50-over matches against Ireland in the autumn. No wonder the World Cup players didn’t turn out. And next season the games against Australia finish even later. Complete madness. Ask any coach at this World Cup and I bet they will be dismayed at their lack of preparation. Newman : I agree but it’s the way of the world sadly. England looked in decent enough shape against New Zealand. Everything was about winning in England in 2019, so perhaps they have gone under the radar a bit now, but it’s a team that covers most bases. Retaining the World Cup in India would be the greatest of all England’s white-ball achievements. ODI cricket has taken a back seat since England won the last 50-over World Cup in 2019 Captain Jos Buttler's side face a tough challenge to retain the World Cup in India four years after their triumph Booth : If they went into 2019 as favourites, they are now just one of a few teams who have a chance; fifth in the rankings tells you they have lost some of their aura, despite holding both white-ball trophies. ODI cricket has taken a back seat since the last 50-over World Cup, and England will turn up in India hoping their big-game nous can carry them through. Hussain : It’s circumstances really. Everything was geared towards that 50-over World Cup last time but then there was a T20 World Cup to focus on which England won and red-ball was then prioritised with the Ashes and the start of the Ben Stokes-Brendon McCullum era. They’re not in as good a shape as 2019 but they’re still in a good plac England are something of a Dad’s Army side. Will there be a changing of the guard after this World Cup? Newman : Yes, this is the end of the greatest era in England’s limited-overs history. Eoin Morgan has been gone over a year, Alex Hales and Jason Roy have followed, and I can’t see more than half of this squad playing 50-over cricket again for England. Booth : Absolutely agree. For Jonny Bairstow, Joe Root, Ben Stokes, Moeen Ali, Chris Woakes, Adil Rashid and Mark Wood, this will be the last one-day World Cup. The rain-ruined series against Ireland gave us a glimpse of the future, with the likes of Phil Salt, Will Jacks, Sam Hain and Rehan Ahmed all thriving. Hussain : They are experienced but that’s what you want in India. They are starting to move on and quite a few players will be getting towards their mid-30s by the end of this tournament. Yes, they are blessed with a lot of emerging talent with the bat but they will have to keep an eye on the bowling depth as they move forward. Ben Stokes (left) and Joe Root will take part in their final ODI World Cup before retirement Lloyd : Agreed, Nass. This is a watershed tournament for a great white-ball side. Quite a few of them will step down afterwards. What you can say is that it’s a very experienced team and lads who have been there, done it and got the T-shirt will roll up their sleeves and get on with it. England got in a selection pickle. Have they called it right with Brook over Roy and was anybody left behind who shouldn’t have been? Booth : It’s harsh on Roy, but he hadn’t played for England since March, and the selectors would have been taking a huge gamble on his dodgy back. Harry Brook is a generational talent — the sooner he beds down in the ODI side, the better. I’d have been tempted to pick Ben Duckett, because he plays spin so well. Lloyd : When they picked that first squad, I said straight away, ‘Brook will still go’. He will be a sensation if they can get him in the team. They have ended up with the right squad. As soon as I saw Gus Atkinson in the T20 in Dubai early this year, I was shouting from the rooftops about England getting him in. I can’t think of anyone else who should have gone. Hussain : It was more to do with ICC regulations. When they named that first squad, Matthew Mott quickly said it was provisional. Other teams have got themselves in a pickle, too. Look at Bangladesh and Tamim Iqbal (recalled but now out injured). Roy is one of England’s great white-ball players, so they were right to pick him but back spasms and the chance to add Brook changed things. Newman : Yes, but they did get themselves in a pickle. They told Roy he was definitely going to the World Cup. They could have handled it better but they have done the right thing in going for Brook over Roy in the end. Jason’s England race is run and there would be no surprise if he throws in his lot fully with the franchise world very soon. Who are the key figures for England and where will the World Cup be won? Newman : I’m a bit concerned that what was first described as cramp had turned into a calf problem for Adil Rashid by the end of the New Zealand series. And that Mark Wood hasn’t played since the Ashes. If England are to win it, they need those two fit and firing. India should go a long way with the likes of Rohit Sharma (above) and Jasprit Bumrah Lloyd: The key figure will be an absent friend. Morgan ran that team with military precision and will be missed. He had an unshakable belief in his players and Jos has to show that, too. The World Cup will be won by bravery, taking a risk and seizing the moment. Booth : Among ODI openers with at least 1,000 runs, only Australia’s Travis Head has a better average and strike-rate than Bairstow’s 47 and 107. He knows Indian conditions well and if he gets England off to regular flyers, their batting depth will terrify opponents. Hussain : Buttler, England’s greatest ever white-ball batter, is the key. And teams still need glue in a 50-over innings, so Joe Root’s return to form will be vital. Who’ll be the stars of the show? Hussain : India will go a long way so Rohit Sharma with the bat and Jasprit Bumrah with the ball. So will England, so Buttler and Rashid for them. Mitch Marsh will stand out for Australia as will South Africa’s Heinrich Klaasen, who’s such a good player of spin. Newman : I’d love Dawid Malan to be a star. He has been under-estimated for years and still doesn’t fit into England’s way of doing things, but he’s made himself undroppable. I’m keeping an eye on Logan van Beek after he defeated West Indies virtually on his own in a qualifying Super Over to get the Netherlands to India. Booth : Look out for India’s Shubman Gill, who averages 66 from his 35 ODI innings, and has a strike-rate of 102. Head and Bairstow can be destructive, and Klaasen recently pummelled Australia for 174 off 83 balls. Among the bowlers, I’d expect Bumrah and Afghanistan spinner Rashid Khan to shine. Lloyd: If Brook gets in, he will light up the tournament. Bairstow will be very influential and Stokes will be ultra-influential. I have a hunch Shreyas Iyer will be a big star for India but they will miss Rishabh Pant. India will walk it on home soil, won’t they? But if not, who wins? And who’s your final four? Mitch Marsh will be stand out for Australia and Travis Head (above) can be destructive Lloyd : India have 13 men — 11 on the field, home conditions and the crowd. Can they lose their egos and just do the job? If they do, they should walk it. Can South Africa lose their choker tag? They have to sometime and this is as good a chance as they will get. If England draw on all that experience, they will be there. And always Australia. Hussain : India are favourites. Can they play no-fear cricket in knockout games? Also their batters don’t bowl and their bowlers don’t bat, so their balance will be interesting. My semi-finalists are India, England, Australia and Pakistan. Newman : The last three 50-over World Cups have been won by the home side and this shouldn’t be any different. But I wonder if India will be selfless enough. I’ve heard the case for South Africa but they always seem to cock it up. My last four are England, India, Australia and I was going to say Chris Silverwood’s Sri Lanka, but they have big injury problems. I’ll go for Pakistan. Booth : One bad day in the semi-finals, as India were reminded by England in the last T20 World Cup, can undo all the good work. But, yes, the hosts look in prime form. If not India then England, with Australia and Pakistan making up the last four. But New Zealand will be in the mix and even South Africa. Share or comment on this article: 'England are undercooked. It's madness!' As Jos Buttler's men prepare to defend the World Cup in India, Mail Sport's Nasser Hussain, David Lloyd, Paul Newman and Lawrence Booth discuss their hopes... and who will be the stars of the show e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-10-03 21:47:15","image_url":"https://i.dailymail.co.uk/1s/2023/10/03/19/76127739-0-image-a-3_1696358549847.jpg","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"fac6d3fd794c8979df89242cf9d68de7","title":"Storm to hit senior divison","link":"https://brimbanknorthwest.starweekly.com.au/sport/storm-to-hit-senior-divison/","keywords":["Sport"],"creator":["jimjin"],"video_url":null,"description":"Sydenham-Hillside is ready for the challenge of the Victorian Turf Cricket Association senior division season. It has been a rapid... The post Storm to hit senior divison appeared first on Brimbank & North West.","content":"Sydenham-Hillside is ready for the challenge of the Victorian Turf Cricket Association senior division season. It has been a rapid rise of the VTCA for the Storm, winning premierships in four of the last five seasons, resulting in it climbing from division 4 in the 2018-19 season to senior division for the upcoming summer. Now the Storm is ready to hit the competition once again said new coach Warren Hackney. “It’s going to be a big step but we’re looking forward to the challenge,” he said. “We’ve been pretty fortunate and been able to hold onto most of the guys and top up a little bit by adding what we thought might help our push in the higher grade. “So we’re hopeful of being competitive.” One of the Storm’s big signings for the summer is Scottish fast bowler Adrian Neill. Neill has a number of international appearances under his belt and has recently been involved in World Cup qualifiers where Scotland fell agonisingly short of qualifying for the ICC Cricket World Cup being held in India later this month. “We’re excited by the fact that he’ll be able to offer us something a bit different to what we’ve had with his extra height and bounce,” Hackney said. “So we’re looking forward to having him on board. “We’ve also got a couple of guys who we’re looking to bring in who are not as big of names… but they’re guys that we envisage will help us improve.” It’s Hackney’s first year at the helm of the Storm, after being a champion player of the club being the all-time leading first XI run-scorer, a five-time premiership player, a former captain amongst other accolades. Now as he sets to lead the club he loves to senior division glory, Hackney is not setting a ceiling at what his side can accomplish. “The first goal is to stay up,” he said. “But we’ve been fortunate enough to climb through the grades fairly quickly, so each year we’ve not wanted to set any limit in what we thought could be achieved. “Although this year is a much bigger step I feel than those we’ve taken in the last four or five years, we’re not wanting to put too much pressure on ourselves. “So who knows if we do manage to get things right, the sky’s the limit, anything’s possible. “We’d be wrapped to think we could make finals and if you can do that, anything’s possible from there.” The Storm will face last year’s grand finalists Deer Park when the season kicks off on October 7. Harper Sercombe","pubDate":"2023-10-03 20:00:27","image_url":null,"source_id":"brimbanknorthwest","source_priority":2256086,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"0f4354ee01b1b5b6bf36a168cb83b5b9","title":"WC Warm-up: Australia Edge Pakistan As India Go 3,400km For Washout","link":"https://sports.ndtv.com/cricket/cricket-world-cup-warm-up-australia-edge-pakistan-as-india-go-3-400km-for-world-cup-washout-4447383","keywords":null,"creator":null,"video_url":null,"description":"Australia edged out Pakistan by 14 runs in a high-scoring World Cup warm-up on Tuesday as India travelled 3,400km from one corner of the country to another only to be defeated by torrential rain.","content":"Australia edged out Pakistan by 14 runs in a high-scoring World Cup warm-up on Tuesday as India travelled 3,400km from one corner of the country to another only to be defeated by torrential rain. In Hyderabad, Australia made 351-7 from their 50 overs with Glenn Maxwell particularly ruthless on Pakistan's bowlers. Maxwell cracked 77 off 71 balls with four boundaries and six sixes. Cameron Green was undefeated on 50, David Warner clubbed three sixes in his 48 while Josh Inglis also made 48. Marnus Labuschagne , a late call-up by the five-time World Cup winners, contributed 40. Pakistan leg-spinner Usama Mir impressed with 2-31 as he dismissed Warner and Mitchell Marsh after the openers had put on 83 for the first wicket. Mir's leg-spinning partner Shadab Khan was expensive with his one wicket costing 69 runs. In reply, Pakistan, who lost by five wickets to New Zealand in their opening warm-up, were dismissed for 337 in the 48th over. Captain Babar Azam hit a fluent, unbeaten 90 off 59 balls with 11 boundaries and two sixes and shared a 144-run partnership with Iftikhar Ahmed who made 83 off 85 deliveries. Mohammad Nawaz contributed 50 but Pakistan fell just short. At Guwahati, Kusal Mendis scored a breathtaking 158 as Sri Lanka were bowled out for 294 by Afghanistan before slipping to a six-wicket defeat in a rain-hit match. Mendis, captain for the day with Dasun Shanaka sitting out the final warm-up, made his runs off only 87 balls. He hit 19 fours and nine sixes as Afghanistan struggled to apply the brakes with only former skipper Mohammad Nabi enjoying sustained success with 4-44. Advertisement Rahmanullah century Afghanistan were sitting comfortably on 118-1 in the 21st over in reply when rain stopped play. They were then set an adjusted target of 257 off 42 overs and cruised home with 23 balls to spare. Opener Rahmanullah Gurbaz smashed 119 from 92 balls with eight fours and nine sixes, sharing a 212-run second wicket partnership with Rahmat Shah . Rahmat's 93 was made off 82 balls and featured 10 fours and three sixes. Meanwhile, India's superstar cricketers endured a 3,400km (2,170 miles) cross-country journey to play a warm-up only for the match to be abandoned without a ball being bowled. India were to face the Netherlands in Thiruvananthapuram, on the southern tip of India, but they were left kicking their heels in the rain. On Saturday, their scheduled game against defending champions England up in the north-eastern city of Guwahati was also washed out. In total, the wet weather forced three warm-up matches to be abandoned while four others were rain-affected, leaving teams and players frustrated ahead of Thursday's World Cup start. However, the weather forecast for the rest of the week in Ahmedabad, Hyderabad and Dharamsala -- venues for first three days of the tournament -- is optimistic with sunshine instead of showers. England will play New Zealand in the tournament opener at the world's biggest cricket stadium in Ahmedabad on Thursday. Pakistan clash with the Netherlands in Hyderabad on Friday, while Afghanistan and Bangladesh play in Dharamsala on Saturday. (Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)","pubDate":"2023-10-03 18:50:54","image_url":null,"source_id":"ndtv","source_priority":1204,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"24082a7d39f87cddfaef3e3f2c48335a","title":"Five bowlers to watch at the 2023 World Cup","link":"https://thefrontierpost.com/five-bowlers-to-watch-at-the-2023-world-cup/","keywords":["Sports"],"creator":["The Frontier Post"],"video_url":null,"description":"NEW DELHI (Reuters): The following are five bowlers to watch at the World Cup in India: Mark Wood (England) Mark Wood’s lethal pace made him an integral part of England World Cup-winning side in 2019, taking 18 wickets in the tournament, but injuries have limited him to just eight ODI matches since 2020. However, he […]","content":"NEW DELHI (Reuters): The following are five bowlers to watch at the World Cup in India: Mark Wood (England) Mark Wood’s lethal pace made him an integral part of England World Cup-winning side in 2019, taking 18 wickets in the tournament, but injuries have limited him to just eight ODI matches since 2020. However, he has been in great touch in test cricket this year with 14 wickets in three matches and if he can translate that form into the 50-overs format he could once again prove to be a crucial asset for England. Adam Zampa (Australia) Adam Zampa will be the only specialist spinner in the Australia squad for the World Cup. He has taken 45 wickets in the 50-over format since the beginning of 2022, and played a key role for Australia in their ODI series victory over India in March. While he equalled an unwanted record by bowling the joint-most expensive spell by an Australian in an ODI defeat to South Africa last month, the 31-year-old recovered well, picking up six wickets in his last three matches in the build-up to the World Cup. Shaheen Afridi (Pakistan) After aggravating a knee injury during last year’s Twenty20 World Cup final in Australia, Shaheen Afridi did not play white-ball cricket for Pakistan for several months, only returning to the squad in April. Since his return, he has taken 24 wickets in 12 matches, including a devastating four-wicket haul in a Group A clash against India at the Asia Cup in which the 23-year-old dismissed both Rohit Sharma and Virat Kohli. Kuldeep Yadav (India) While India’s bowling attack has no shortage of weapons, Kuldeep Yadav could prove to be the difference for the hosts with the wristspinner having taken 33 wickets in the 50-overs format this year. The 28-year-old’s miserly bowling can put heavy pressure on batters to score, allowing other bowlers to pick up wickets. He was named Player of the Series at the Asia Cup, boasting an economy of 3.61 and an average of 11.44, even though four other bowlers took more wickets than his haul of nine for the tournament. Matheesha Pathirana (Sri Lanka) Matheesha Pathirana has enjoyed a breakout year since making his ODI debut for Sri Lanka in June, taking 15 wickets in 10 matches. The 20-year-old, who has modelled his round-arm action on compatriot Lasith Malinga but with an even lower release point, took 11 wickets at the Asia Cup to top the charts for the tournament. He is also accustomed to playing in India, taking 19 wickets for the Chennai Super Kings in their title-winning campaign in this year’s Indian Premier League (IPL).","pubDate":"2023-10-03 18:05:33","image_url":null,"source_id":"thefrontierpost","source_priority":1484530,"country":["pakistan"],"category":["sports"],"language":"english"},{"article_id":"a87abab7f0f755fac62d472e631d3857","title":"Insta Reel Showing India's Pre-World Cup Shoot Is Viral. Fans Miss Kohli","link":"https://sports.ndtv.com/cricket/instagram-reel-showing-indias-pre-world-cup-shoot-is-viral-fans-miss-virat-kohli-4443532","keywords":null,"creator":null,"video_url":null,"description":"The Indian cricket team uploaded a reel on Monday from its pre-World Cup 2023 shoot and Virat Kohli was among the key players who misses out.","content":"The Indian cricket team uploaded a reel on Monday from its pre-World Cup 2023 shoot. The clip had India skipper Rohit Sharma , Jasprit Bumrah , KL Rahul , Suryakumar Yadav , Mohammed Shami , Mohammed Siraj , Ravichandran Ashwin , Shardul Thakur and Ishan Kishan all posing in front of a 360-degree rotating camera. \"Raring to go for #CWC23,\" wrote the Indian cricket team while sharing the picture on its official Instagram account. The fans were quick to notice that star India batter Virat Kohli was missing in the reel and they didn't waste time in questioning why the player was left out. Some even mentioned that the reel would be incomplete without Kohli. Watch the reel here: A post shared by Team India (@indiancricketteam) \"I am waiting for Virat but Virat is not in this video, why?\" wrote a fan. \"This reel is incomplete without Virat,\" wrote another fan. \"Without Virat Kohli in this reel is like a food without spice\", \"Where is our king Kohli\" and \"King missing\" were some of the other comments. Kohli had to reportedly fly back to Mumbai from Guwahati because of reported 'personal emergency' while the rest of the Indian squad arrived in Trivandrum for their second warm-up game against the Netherlands. Though the Board of Control for Cricket in India (BCCI) hasn't given any confirmation if Kohli will miss the warm-up game, a report claims that the star batter will return in time for the Netherlands clash -- set to take place on October 3 -- and join his teammates. Kohli remains one of the pillars in the Indian team. Though the Netherlands warm-up game isn't of absolute importance, the batter would want to get some runs under his belt considering the last match against England was abandoned due to rain.","pubDate":"2023-10-03 17:07:01","image_url":null,"source_id":"ndtv","source_priority":1204,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"dce291a1aacda53c92aee144ab801b96","title":"There’s no place like home as India mounts challenge for its third cricket World Cup","link":"https://torontosun.com/sports/other-sports/india-mounts-challenge-for-third-cricket-world-cup","keywords":["Other Sports","Sports"],"creator":["Norm Da Costa"],"video_url":null,"description":null,"content":"Mahendra Singh Dhoni wrote his way into cricket’s folklore when he smashed a six into the stands of Wankhede Stadium in Mumbai in 2011 to win the World Cup and send a billion Indians into a frenzy. He became the country’s most beloved person and, if he ran for the country’s top job as prime minister, he would win in a landslide. It may be a fading memory, but Dhoni’s unbeaten 91 against Sri Lanka was an unforgettable day in a country where they drink, eat, sleep and breathe cricket. They are hoping and praying that another Dhoni emerges to win the game’s biggest trophy for the third time. Since the tournament is being played on home soil, expectations of India repeating at home are high but that alone does not guarantee success. In 1987 and 1996, India fell in the semifinals as host and Australia didn’t even make it to the knockout stage when it held the event in 1992. All eyes, of course, will be on a powerful India, but there are three other nations that cannot be overlooked in this tournament that runs for 46 days from Oct. 5 to Nov. 19. There’s perennial favourite Australia, defending champion England and two-time finalist New Zealand. One cannot ignore the world’s two most unpredictable squads, Pakistan and South Africa. The others in the marquee event include Afghanistan, Bangladesh, the Netherlands and Sri Lanka. The tournament is known for producing sheer drama and, apart from Dhoni’s knock, the World Cup in England was a stunning success with the home team finally winning the one trophy that had eluded it. The final went down to the wire with England getting its hands on the trophy in the Super Over after the scores were tied at 241 runs. The scores were level in the Super Over as well, so England won the crown on the boundary comeback rule. It was controversial and made no sense, but it was in the rulebook. You can’t beat that for excitement, but there’s more in store in this is edition of the tournament as Indian fans will pack each and every of the 10 stadiums. And there will be thousands clamouring to watch the main clash between India and Pakistan at the Narendra Modi Stadium, the largest cricket facility in the world with a seating for 132,000, on Oct. 14. In the opener on Thursday at the same venue, there will be a re-run of that unforgettable 2019 final, with England facing New Zealand. In the land where cricket runs through the veins of its people, the team has never been short on talent. Led by Rohit Sharma the star-studded lineup of Virat Kohli, KL Rahul, Shubman Gill, Shreyas Iyer and Suryakumar Yadav can decimate bowling attacks with ease. It has incisive fast bowlers in Jasprit Bumrah, Mohammad Shami and Mohammad Siraj and world-class spinners in Ravichandran Ashwin and Ravindra Jadeja. The squad led by Jos Buttler is stacked with match winners including Ben Stokes. The batting looks formidable with Buttler, Jonny Bairstow, Dawid Malan, Stokes and Harry Brook. Expect paceman Mark Wood to make his mark along with Chris Woakes and Sam Curran. The spin will be in the capable hands of Adil Rashid and Moeen Ali. On paper this is the team to beat. Highly-talented batting lineup that includes Steve Smith, David Warner, Marnus Labuschagne and Shaun Marsh. Add Travis Head when he comes off his injury and others who could do damage with bat and ball are Cameron Green and spinner-batsman Glenn Maxwell. Add a fearsome trio of fast bowlers Pat Cummins, Mitchell Starc and Josh Hazlewood and Australia has a complete package capable of winning the event. Can the Black Caps make it to their third straight final? They have one of the most well-balanced squads with high-scoring batsmen in Devon Conway, Daryl Mitchell and former skipper Kane Williamson, James Neesham and Tom Latham. Tim Southee and Trent Boult will share the new ball with Lockie Ferguson and Matt Henry. Keep an eye on opening bat Rachin Ravindra and spinners Ish Sodhi and Mitchell Santner. New Zealand could finally break its winless duck. The most exciting team to watch with a number of world-class batsmen and bowlers. Fakhar Zaman and Imam-ul-Haq are solid openers and skipper Babar Azam and Mohammad Rizwan have been hot with the bat all year. The Pakistan attack led by Shaheen Shah Afridi, Haris Rauf and Hasan Ali will breathe fire in the absence of injured Naseem Shah. Superb spinners in Shadab Khan and Mohammad Nawaz who can also wield put up big scores Keep an eye on spinner Usama Mir. With a lethal combination of pace and spinners and a world-class batting lineup South Africa has the potential to go all the way. Led by skipper Temba Bavuma the rest are Quinton de Kock, Aiden Markram, Heinrich Klassen, Rassie van der Dussen and the hard-hitting David Miller. Klassen is in the form of his life and he will hold centre stage with de Kock who retires from white-ball cricket after this tournament. The bowling lineup is also a force to be reckoned with. There’s Kagiso Rabada, Lungi Ngidi and Marco Jansen and in the spin department will be Tabraiz Shamsi and Keshav Maharaj. Serious contender for the crown. Always considered one of the heavyweights the former World Cup champion will be minus ace spinner Wanindu Hasaranga and fast bowler Dusmantha Chameera through injury. But expect the island, under the captaincy of Dasun Shanaka, to still be a force to be reckoned with. Kusal Mendis and Charith Asalanka have been in tremendous form with the bat while Dunith Wellalage could provide a big threat with the ball. The country will always be remembered for sending England home packing in 2015 and it’s a squad that cannot be underestimated. Shakib Al Hasan, one of the game’s greatest all-rounders, will lead a squad that could well make the playoffs. Other players to watch are Litton Das, Hossain Shanto and Mustafizur Rahman. A country ravaged by war continues to play a major role internationally. With one of the world’s greatest spinners Rashin Khan pulling the strings don’t be surprised for this country to pull an upset or two. Others to watch are Mohammad Nabi, Mujeeb Ur Rahman and Noor Ahmad. Star batsman Mohammad Waseem leads the associate country that depends on Vriitya Aravind and Asif Khan for the runs. Asif recently made headlines for smashing a whirlwind 100 against Nepal in just 41 balls. That was the fastest ODI century by an associate batsman. Another associate country that has always made like difficult for the Test nations. Wesley Barresi and Roelof van der Merwe will be playing in their final World Cup tournament and will want to go out with a bang. Players to watch on the team include batsman Teja Nidamanuru, the aggressive Vikramjit Singh, Max O’Dowd and Logan van Beek. One Dutch star who could make a name for himself is all-rounder Bas de Leede. Check out our sports section for the latest news and analysis.","pubDate":"2023-10-03 17:06:05","image_url":"https://smartcdn.gprod.postmedia.digital/torontosun/wp-content/uploads/2023/10/1004india-cricket-nepal-scaled-e1696352584884.jpg?quality=100&strip=all","source_id":"torontosun","source_priority":12198,"country":["canada"],"category":["sports"],"language":"english"},{"article_id":"add57d991990d5e174968efa1a727f25","title":"Reece Topley ‘undercooked’ as England prepare for World Cup opener","link":"https://www.basingstokegazette.co.uk/sport/national/23831822.reece-topley-undercooked-england-prepare-world-cup-opener/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"The seamer and his team-mates have seen limited action since arriving in India ahead of their first clash against New Zealand on Thursday.","content":"England get their title defence under way in Ahmedabad on Thursday when they face New Zealand in a replay of the 2019 final, but their lead up to that curtain-raiser has been less than straightforward. A 38-hour trip to their warm-up base in Guwahati was branded “utter chaos” by Jonny Bairstow, before their first practice match against India was rained off without a ball being bowled. They were able to get some game time in against Bangladesh on Monday, but their four-wicket win came in a game reduced to 37 overs and none of their bowlers delivered more than five. That is a light load to take into a flagship fixture, but for Topley simply arriving at the Narendra Modi Stadium fit for duty would be a success of sorts. Little over a year ago, just days before the start of the T20 World Cup in Australia, he tripped on a boundary sponge and was ruled out of a tournament England went on to win. “If anything I would say that I’m pretty undercooked, but going into a long tournament I don’t necessarily think that is the worst thing,” the left-armer said after tuning up with a three-wicket haul. “I feel like I’m just about to come into my stride, hopefully. It’s not about tearing in at the warm up game and impressing the right people, it is about delivering in the nine group games. “That last group game is still pretty far away so I feel like I’m where I should be, but there is still some work to be done for sure. “After missing the first game due to the weather it was good for us to be able to get out on the field and for people to get what they needed from the experience which is a positive outcome. “We’ve all been doing our training after having a couple of weeks without matches so it is nice to get back in the groove with playing in the middle and it helps to assess what you still need to work on before that first proper match.” Topley, who has lost long spells of his career due to injury problems, has spoken openly about the trauma of his late withdrawal from last year’s trophy-winning side and has been doing everything in his power to avoid a repeat. Mercifully, his luck has held so far. “I’ve been steering clear of any mishaps and playing it quite safe, and I’ll continue to do so ahead of the first game,” he said. “Obviously I don’t want any repeat of what was so gutting last year in Brisbane at the T20 World Cup. It was a tough period to go through and I wouldn’t wish it on anyone because these are the moments and the events that you dream of being a part of and playing your part in. “Hopefully I can play my part this year and make up for lost time if anything and make a contribution to England going all the way again. I’m looking forward to getting some game time, just as I was anticipating last year, and this time hopefully I can help the team retain the trophy.” There is stiff competition for places among the England bowling ranks, with Topley joining Chris Woakes, Mark Wood, David Willey, Sam Curran and Gus Atkinson in a well-stocked pace attack. England expect it to be a group effort in India, with a draining schedule that involves new venues and internal flights for every group match, but everyone has their eye on the opening match as the first signs of a pecking order emerge. “I think everyone is fighting for a spot in that final XI. You’ve just got to do all you can to put your case forward to feature in that side,” Topley explained. “I felt like I gave a good account of myself in the run out. Whatever 11 they end up picking, the whole squad is right behind each other, it is going to take a squad effort to be successful out here and the side that goes out in each match will continue to live up to the exciting way we play our cricket.”","pubDate":"2023-10-03 17:02:25","image_url":"https://www.basingstokegazette.co.uk/resources/images/17293658/?type=app&htype=0","source_id":"basingstokegazette","source_priority":967252,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"f6d157b1a086cdefcd5264fad8a74696","title":"World Cup: Babar knock in vain as Australia warm up with 14-run win over Pakistan","link":"https://timesofindia.indiatimes.com/sports/cricket/icc-world-cup/odi-world-cup-babar-azam-knock-in-vain-as-australia-warm-up-with-14-run-win-over-pakistan/articleshow/104138982.cms","keywords":null,"creator":null,"video_url":null,"description":"The form of openers and bowlers remained a concern as Pakistan was handed a 14-run loss by Australia on the concluding day of the World Cup warm-ups in Hyderabad on Tuesday.","content":null,"pubDate":"2023-10-03 16:37:19","image_url":null,"source_id":"toi","source_priority":391,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"1fc89a6f6af43e1f6e6a858a9f538313","title":"No Bumrah! 2 Indians In Du Plessis' List Of Bowlers To Watch Out For In WC","link":"https://sports.ndtv.com/cricket/no-jasprit-bumrah-two-indians-in-faf-du-plessis-list-of-bowlers-to-watch-out-for-during-cricket-world-cup-2023-4443614","keywords":null,"creator":null,"video_url":null,"description":"Faf du Plessis picked four bowlers to look for during the Cricket World Cup 2023. Surprisingly, India's ace pacer Jasprit Bumrah failed to make a cut on the list.","content":"Out-of-favour South Africa batter Faf du Plessis picked four bowlers to look for during the Cricket World Cup 2023. Surprisingly, India's ace pacer Jasprit Bumrah failed to make a cut on the list despite the South African star naming two Indian bowlers in it. While du Plessis left out Bumrah, he picked Mohammed Siraj and Kuldeep Yadav among the four bowlers. South Africa's ace pacer Kagiso Rabada and New Zealand's pace spearhead Trent Boult completed the list. Du Plessis added that the performance of all the four bowlers will depend on the kind of surfaces they play on. \"I think it depends on the wickets. If the wicket has got something in it, someone like (Mohammed) Siraj who just nibbles the ball a little bit both ways, and he's trying the off stump the whole time,\" Du Plessis told Star Sports. \"(Trent) Boult and (Kagiso) Rabada, all those kinds of guys are going to be extremely successful. But if there is a little bit of spin, someone like Kuldeep (Yadav) has bowled really well in the last six months. When he gets his tail up and he gets one wicket, the next batter's coming in, he's quite tricky to face his first few balls because he spins the ball both ways,\" he added. Both Kuldeep and Siraj have been in sublime form for India, especially the fast bowler. Siraj is certainly in the form of his life. He recently claimed a six-wicket haul during India's Asia Cup 2023 final match against Sri Lanka, which was also his best ODI figures. While returning 6 for 21 in the summit clash, Siraj also equalled Chaminda Vaas ' record of five wickets in 16 balls in ODI cricket. Talking about Kuldeep, the left-arm wrist spinner has done some improvements in his bowling which have helped him better his wicket-taking abilities. The bowler is really important in providing some crucial breakthroughs to India in the middle-overs.","pubDate":"2023-10-03 16:29:20","image_url":null,"source_id":"ndtv","source_priority":1204,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"8656efb7e640d9524e232da30b9b41a1","title":"MS धोनी के नए लुक ने लूटी महफिल, तस्वीर देख याद आ जाएंगे पुराने वाले माही","link":"https://hindi.news18.com/cricket/ms-dhoni-new-look-black-t-shirt-goggles-viral-on-social-media-designed-by-hair-specialist-aalim-hakim-7720883.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"भारतीय टीम के पूर्व कप्तान महेंद्र सिंह धोनी (Mahendra Singh Dhoni) इन दिनों सुर्खियों में हैं. उनका लुक सोशल मीडिया पर काफी तेजी से वायरल हो रहा है, जिसमें वह काला चश्मा और काली टी-शर्ट पहने हुए नजर आ रहे हैं.","content":"महेंद्र सिंह धोनी का नया लुक वायरल. (Aalim Hakim Instagram) नई दिल्ली. भारतीय टीम के पूर्व कप्तान महेंद्र सिंह धोनी (Mahendra Singh Dhoni) क्रिकेट के मैदान पर हो या फिर उससे दूर. वह हमेशा फैंस के दिलों पर राज करते हैं. इन दिनों वह काफी सुर्खियों में हैं. दरअसल, उन्होंने अपने बाल बड़े कर लिए हैं और अपने नए लुक को लेकर काफी चर्चा में हैं. इस नए लुक में वह साल 2007 के टी20 विश्व कप वाले महेंद्र सिंह धोनी लग रहे हैं. धोनी का ये लुक सोशल मीडिया पर लोगों के बीच काफी चर्चा में है. हेयरस्पेशलिस्ट आलिम हकीम ने अपने इंस्टाग्राम अकाउंट से धोनी की फोटो पोस्ट की. आलिम ने फोटो के साथ कैप्शन में लिखा, “यस, ये हमारे महेंद्र सिंह धोनी हैं.” धोनी की इस फोटो पर घंटों में लाखों लाइक्स आने लगे और यह हर सोशल मीडिया एप्स पर तेजी से वायरल होने लगा. वह इस तस्वीर में काली टीशर्ट और काले चश्मे में दिखाई दे रहे हैं. बता दें कि धोनी आखिरी बार आईपीएल में चेन्नई सुपर किंग्स के लिए खेलते दिखे थे. ऐसा लग रहा था कि यह धोनी के लिए आखिरी आईपीएल होगा. लेकिन ऐसा नहीं हुआ. धोनी साल 2024 में भी अपनी टीम के लिए खेलते नजर आएंगे. Aus vs Pak: वर्ल्ड कप से पहले ग्लेन मैक्सवेल ने खेली तूफानी पारी, पाकिस्तान के गेंदबाजों को धोया, जड़े 6 छक्के पारुल चौधरी ने चीन में लहराया तिरंगा, 5000 मीटर रेस में जीता गोल्ड, आखिरी 30 सेकेंड में पलटी बाजी बता दें कि एम एस धोनी अब इंटरनेशनल क्रिकेट से संन्यास ले चुके हैं. वह साल 2019 में भारत के लिए आखिरी बार खेलते दिखे थे. उन्होंने न्यूजीलैंड के खिलाफ वनडे मैच खेला था. उस मैच में माही ने बैटिंग करते हुए अर्धशतक लगाया था और एक कैच पकड़ा था. पूरे करियर में धोनी ने भारत के लिए 90 टेस्ट, 350 वनडे और 98 टी20 इंटरनेशनल मैच खेले हैं. इस दौरान उन्होंने क्रमश: 4876, 10773 और 1617 रन बनाए हैं. धोनी भारत के सबसे सफल कप्तानों में से एक रहे हैं. उन्होंने भारत को 2 वर्ल्ड कप भी जिताए हैं. . Tags: Ms dhoni , Team india 25 की उम्र हो गई और अब तक नहीं मिली नौकरी, खाली बैठने से बेहतर शुरू करें ये काम, होती रहेगी पार्ट टाइम इनकम 31 सप्ताह की कठिन ट्रेनिंग के बाद अग्निवीर बने 96 युवा, देखें पासिंग आउट परेड की जोश भरने वाली तस्वीरें पिता बॉलीवुड के सुपरस्टार, बहन भी बन गईं टॉप हीरोइन, लेकिन स्टारकिड को छू भी नहीं सका ग्लैमर, फिर भी कमाती हैं करोड़ों","pubDate":"2023-10-03 15:52:39","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/10/Ms-DHoni-New-Look-2023-10-a5876dd2d1737075765e468cf67de69a-3x2.jpg","source_id":"hindinews18","source_priority":6509,"country":["india"],"category":["sports"],"language":"hindi"}]}