{"newsArray":[{"article_id":"8024783c231dee783675d5330602e987","title":"World Cup 2023, SA vs BAN: విజయాల బాట పట్టిన సౌతాఫ్రికా, బంగ్లాదేశ్‌పై 149 పరుగుల భారీ తేడాతో దక్షిణాఫ్రికా విజయం..","link":"https://telugu.latestly.com/sports/cricket/world-cup-2023-sa-vs-ban-south-africa-who-are-on-a-winning-streak-beat-bangladesh-by-a-huge-margin-of-149-runs-112923.html","keywords":null,"creator":null,"video_url":null,"description":"నెదర్లాండ్స్‌పై ఓటమి తర్వాత కసితో సౌతాఫ్రికా జట్టు మరోసారి విజయాల బాట పట్టింది. బంగ్లాదేశ్‌తో జరిగిన 5వ మ్యాచ్‌లో దక్షిణాఫ్రికా 149 పరుగుల భారీ తేడాతో విజయం సాధించింది.","content":"నెదర్లాండ్స్‌పై ఓటమి తర్వాత కసితో సౌతాఫ్రికా జట్టు మరోసారి విజయాల బాట పట్టింది. బంగ్లాదేశ్‌తో జరిగిన 5వ మ్యాచ్‌లో దక్షిణాఫ్రికా 149 పరుగుల భారీ తేడాతో విజయం సాధించింది. బంగ్లాదేశ్‌తో జరిగిన మ్యాచ్‌లో దక్షిణాఫ్రికా కెప్టెన్ టెంబా బావుమా టాస్ గెలిచి ముందుగా బ్యాటింగ్ ఎంచుకున్నాడు. ఫామ్‌లో ఉన్న క్వింటన్ డి కాక్ క్రీజులో స్థిరపడి 140 బంతుల్లో 7 ఫోర్లు, 15 ఫోర్ల సాయంతో 174 పరుగులతో అద్భుత ఇన్నింగ్స్ ఆడాడు. ఈ సెంచరీ తర్వాత, డి కాక్ ప్రపంచ కప్ 2023లో టాప్ స్కోరర్‌గా అవతరించడం మాత్రమే కాకుండా అనేక రికార్డులను బద్దలు కొట్టాడు. హెన్రిచ్ క్లాసెన్ తన క్లాస్‌ని ప్రదర్శించి.8 సిక్సర్లు బాది. కేవలం 49 బంతుల్లోనే 90 పరుగులు చేసి జట్టు స్కోరును పెంచాడు. ఈ ఇన్నింగ్స్‌ల కారణంగా ఆ జట్టు బంగ్లాదేశ్‌కు 383 పరుగుల భారీ లక్ష్యాన్ని నిర్దేశించింది. మెరుపు బ్యాటింగ్ అనంతరం దక్షిణాఫ్రికా బౌలర్లు సైతం బంగ్లాదేశ్ పై సింహాల్లా విరుచుకుపడ్డారు. 100 పరుగుల వ్యవధిలో బంగ్లాదేశ్ జట్టులో సగం మందిని బౌలర్లు పెవిలియన్‌కు పంపారు. అయితే జట్టు తరఫున మహ్మదుల్లా అద్భుత సెంచరీ చేసినా, జట్టును విజయపథంలో నడిపించడంలో సఫలం కాలేదు. సౌతాఫ్రికా జట్టులో గెరాల్డ్ అత్యధికంగా 3 వికెట్లు పడగొట్టాడు. Quinton de Kock, 174 ⭐ Mahmudullah, 111 🫡 A defiant century wasn’t enough to save Bangladesh after another display of South African power hitting 💪 Read the full report 📝⬇️ #SAvBAN #CWC23 https://t.co/qQX9k7IfxL — ICC Cricket World Cup (@cricketworldcup) October 24, 2023 ఈ భారీ విజయం తర్వాత దక్షిణాఫ్రికా జట్టు ప్రపంచకప్ పాయింట్ల పట్టికలో న్యూజిలాండ్‌ను దాటేసింది. కివీస్ జట్టు నిరంతరం విజయాలు సాధిస్తున్నప్పటికీ 5వ మ్యాచ్‌లో భారత్ చేతిలో ఓటమి చవిచూడాల్సి వచ్చింది. ఇప్పుడు దక్షిణాఫ్రికా 4 విజయాలతో భారత్ తర్వాత రెండో స్థానంలో నిలిచింది. Vastu Tips: వాస్తు ప్రకారం ఇంటికి ఎన్ని ద్వారాలు ఉండాలి","pubDate":"2023-10-24 19:28:24","image_url":null,"source_id":"latestly","source_priority":5523,"country":["india"],"category":["sports"],"language":"telugu"},{"article_id":"5c3dca5a4c355752c38c400c183eb284","title":"Afghanistan making waves at Cricket World Cup while England is barely hanging on","link":"https://torontosun.com/sports/other-sports/afghanistan-making-waves-at-world-cup","keywords":["Other Sports","Sports"],"creator":["Norm Da Costa"],"video_url":null,"description":null,"content":"A country in constant turmoil. That’s the only way the world sees Afghanistan. But in the past 10 days, Afghanistan has been synonymous with cricket and giant-killing. First, it turned the tables on England — a country that not only introduced the game to the world, but also to Afghanistan in the 1830s. After England, it was the turn of their neighbours Pakistan to feel the bite of the scorpion. Many of the Afghanis got hooked on their love of the game in Pakistani refugee camps during the decades of war when the Russians ran roughshod over the country. Now little-known Afghanistan has taken the World Cup being played in India by the scruff of its neck and given it a violent shake, and two recipients of the Afghani insurrection have been England and Pakistan. Following the loss to the Afghanis, defending champion England is hanging on by a thread and mighty Pakistan, after starting with two straight wins, finds itself in the same position as the tournament reaches the halfway mark. The only team at this stage with an unbeaten record at 5-0 is Rohit Sharma’s India following an exciting victory over New Zealand, at the time the only other unbeaten team in the competition. Prior to this clash of the two squads with a clean sheet, India had not been able to defeat the Kiwis since 2005. But on this occasion, a brilliant knock of 95 by Virat Kohli and a five-wicket haul by paceman Mohammed Shami ended the streak. On a wild weekend just after the Afghanis stunned England, it was the turn of South Africa to obliterate England and take a step toward the semifinals. The Proteas trounced England by a whopping 229 runs at the heat dome known as Mumbai’s Wankhede Stadium, where the needle hit 37C with the humidity at around 46%. But England could not stand the heat after South Africa posted 399 for seven and were then dismissed for a woeful 170 in 22 overs. The champions can still qualify for the semifinals, but likely will have to win all five of their remaining group matches. The chances of that happening are as rare as Toronto being spared of snow this winter. The highlight of South Africa’s innings was Heinrich Klaasen smashing a 61-ball hundred and Marco Jansen 75 from 42 balls. Klassen was gasping for breath during his epic century with sweat dripping from his cap. Having been fried in the field, England’s batsmen had no answer to the Proteas attack in which new fast bowler Gerald Coetzee excelled with three for 35. England stumbled from 68 for six to 100 for eight and some wild hitting by Mark Wood (43 not out) and Gus Atkinson (35) with nothing to lose laid the lumber. England’s wobbly campaign continues against Sri Lanka on Thursday before facing India and Australia. Meanwhile, South Africa, with the most powerful batting lineup in the World Cup, posted 382 for five against Bangladesh on Tuesday with opener Quinton de Kock hitting a massive 174 that was laced with 15 fours and seven sixes. Other big scorers were Klassen, who made 90, and Aiden Markham 60. Bangladesh’s Mohammad Mahmudullah then stroked a brilliant 111 in a losing cause as it folded for 233 to go down by a massive 149 runs. South Africa has now emerged as a big threat to India. Meanwhile, Afghanistan defeated Pakistan for the first time in an ODI by eight wickets by pulling off its highest successful chase in this thriller in Chennai. Pakistan posted 282 for seven and this looked like a solid total but the Afghans hit back with 286 for two with an over to spare. For the Afghans, Ibrahim Zadran made 87, Rahmanullah Gurbaz smacked 65 and Rahmat Shah struck 77 not out as Afghanistan moved up to sixth in the standings while England dropped to last in the table. While Afghanistan has two of the best spinners in the world, it was teenage wrister Noor Ahmad who starred with three for 49. There was joy across Afghanistan following these two victories. “You know the situation in Afghanistan, it’s very depressing,” 25-year-old Abdul Wahab, who manages a Kabul medical centre, told a news agency. “The only excuse to forget everything is cricket.” Australia may be forgotten, but don’t ever rule them out for mounting a late challenge. The Aussies, who have a 2-2 record, plundered Pakistan’s attack for 367 for nine in Bengaluru and then restricted Pakistan for 305 thanks to spinner Adam Zampa’s four for 53. Aussie openers David Warner and Mitchell Marsh burst into life with centuries to put on 259 for the first wicket. Warner made 163 off 124 balls and Marsh clobbered 121 off 108 deliveries with Shaheen Afridi the pick of the Pakistani bowlers with five for 54. Former India captain Bishan Singh Bedi, who was known for being part of a famous spin quartet, has died at the age of 77, the Board of Control for Cricket in India (BCCI) announced. Bedi, leg spinner Bhagwat Chandrasekhar and off-spinners Srinivas Venkataraghavan and Erapalli Prasanna were regarded the country’s most potent bowling force in the 1960s and ’70s. Check out our sports section for the latest news and analysis.","pubDate":"2023-10-24 18:28:13","image_url":"https://smartcdn.gprod.postmedia.digital/torontosun/wp-content/uploads/2023/10/1025cricket-afghanistan-scaled-e1698171119903.jpg?quality=100&strip=all","source_id":"torontosun","source_priority":12198,"country":["canada"],"category":["sports"],"language":"english"},{"article_id":"15cd66399fccd682e4b0c00618506ba7","title":"दक्षिण आफ्रिकेनं बांगलादेशचा 149 धावांनी उडवला धुव्वा","link":"https://marathi.abplive.com/photo-gallery/sports/cricket-south-africa-vs-bangladesh-highlights-world-cup-2023-mahmudullah-smacks-ton-but-sa-wrap-up-149-run-win-at-wankhede-1222131","keywords":["क्रिकेट"],"creator":["पीटीआय वृत्तसंस्था"],"video_url":null,"description":"दक्षिण आफ्रिकेनं बांगलादेशचा 149 धावांनी उडवला धुव्वा","content":"दक्षिण आफ्रिकेनं बांगलादेशचा 149 धावांनी धुव्वा उडवून, विश्वचषकाच्या मोहिमेत चौथा विजय साजरा केला. दक्षिण आफ्रिकेनं पाचपैकी चार सामने जिंकून आठ गुणांची कमाई केली असून, विश्वचषकाच्या गुणतालिकेत दक्षिण आफ्रिका दुसऱ्या स्थानावर आहे. मुंबईतल्या सामन्यात दक्षिण आफ्रिकेनं बांगलादेशला विजयासाठी 383 धावांचं आव्हान दिलं होतं. त्या आव्हानाचा पाठलाग करताना बांगलादेशचा अख्खा डाव 47 व्या षटकांत 233 धावांत आटोपला. या सामन्यात क्विन्टॉन डी कॉकनं 174 धावांची खेळी करून दक्षिण आफ्रिकेच्या डावाचा पाया घातला. क्विन्टॉन डी कॉकनं 174 धावांची खेळी करून दक्षिण आफ्रिकेच्या डावाचा पाया घातला. त्यानं 140 चेंडूंमधली ही खेळी 15 चौकार आणि सात षटकारांनी सजवली. डी कॉकनं एडन मारक्रमच्या साथीनं तिसऱ्या विकेटसाठी 131 धावांची, तर हेन्ऱिक क्लासेनच्या साथीनं चौथ्या विकेटसाठी 142 धावांची भागीदारी केली. मारक्रमनं 69 चेंडूंत 60 धावांची आणि क्लासेननं 49 चेंडूंमध्ये 90 धावांची खेळी उभारली. क्लासेननं 90 धावांच्या खेळीला दोन चौकार आणि आठ षटकारांचा साज चढवला. दक्षिण आफ्रिकेने विश्वचषकातील चौथ्या विजयाची नोंद केली. या विजयासह दक्षिण आफ्रिकेने उपांत्य फेरीकडे वाटचाल केली आहे. दक्षिण आफ्रिकेने पाच सामन्यात चार विजय मिळवत आठ गुणांची कमाई केली. चौथ्या विजयासह दक्षिण आफ्रिकेने दुसऱ्या क्रमांकावर झेप घेतली. न्यूझीलंडचा संघ तिसऱ्या क्रमांकावर घसरला आहे. या सामन्याआधी दक्षिण आफ्रिका तिसऱ्या तर न्यूझीलंड दुसऱ्या क्रमांकावर होता. बांगलादेशचा 149 धावांनी दारुण पराभव केल्यामुळे दक्षिण आफ्रिकेचा रनरेटही सुधारला आहे. आफ्रिकेच्या विराट विजयानंतर गुणतालिकेत मोठा फेरबदल झालाय. Points Table : आफ्रिकेची दुसऱ्या स्थानावर झेप, बांगलादेशचा पराभव झाल्यानंतर गुणतालिकेत मोठा बदल","pubDate":"2023-10-24 18:12:36","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/10/24/d158e7431fc89145a99cd51154420d6e169816975458478_original.jpg","source_id":"abplive","source_priority":10959,"country":["india"],"category":["sports"],"language":"marathi"},{"article_id":"0e8c99c264a479fddf4b247c6f81fc0c","title":"Man United vs Copenhagen - Champions League LIVE: Red Devils to pay tribute at first home game since Sir Bobby Charlton's passing","link":"https://www.dailymail.co.uk/sport/live/article-12665549/Man-United-vs-Copenhagen-Champions-League-2023-24-Latest-Result.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Follow Mail Sport's live blog for all the latest updates from Old Trafford as Manchester United host Copenhagen in the Champions League.","content":"LIVE Man United vs Copenhagen - Champions League LIVE: Red Devils to pay tribute at first home game since Sir Bobby Charlton's passing By Samuel Draper For Mailonline Published: 18:30, 24 October 2023 | Updated: 19:43, 24 October 2023 e-mail 12 View comments Follow Mail Sport's live blog for all the latest updates from Old Trafford as Manchester United host Copenhagen in the Champions League . 18:35 Ian Herbert: Man City fans should respect Sir Bobby The focus is naturally on the Champions League tonight - but it's inevitable that there will always be one eye on the Manchester derby this Sunday. Mail Sport's Ian Herbert calls on Man City fans to respect what Sir Bobby Charlton did to put Manchester on the map, despite the rivalry of the two clubs. IAN HERBERT: Is it beyond City fans to respect Sir Bobby? IAN HERBERT: It's perhaps inevitable that Manchester City are barely represented in the sea of flowers presently laid at the front of Old Trafford. Mail Online 18:29 Bayern have moved 3-1 up in the other group game About three minutes to go in Turkey, plus stoppages, but it looks like Bayern will make it three wins from three in Group A. Galatasaray have four points, and Copenhagen have one. The pressure is on Man United now. 18:28 Can Erik ten Hag do the job on the pitch? It feels like there's a new off the field situation for Man United to navigate every few days, but can Erik ten Hag focus on the job required on the pitch and get their Champions League campaign going? 18:25 A special occasion for Man United's Dane Rasmus Hojlund used to play for Copenhagen, before moving across Europe to further his career, and now they're coming to Old Trafford. 18:09 Background on Copenhagen Copenhagen began their group stage with a 2-2 draw in Turkey on Matchday 1, but lost 2-1 at home to Bayern Munich three weeks ago. Since the Bayern game, they have drawn 1-1 at AGF, and then won 2-1 at home to Vejle BK in the league on Saturday. 18:06 Man United vs Copenhagen in the past This is the fourth meeting between the two teams. They shared one win each in the 2006-7 Champions League group stage, which was Copenhagen's first ever win in the competition. Man United got the better of the Danes in the UEFA Europa League quarter-final in August 2020. They'll be desperate to get a third win on the board tonight, and get their first points of the group stage this year. 18:02 An hour to go There'll be club tributes to Sir Bobby Charlton in the run up to kick-off. 17:59 Copenhagen team news Copenhagen have also confirmed their starting 11 for the match tonight, led by captain Viktor Claesson. Rasmus Hojlund's younger brother Oscar is named among the substitutes for the Danish Superliga champions. 17:56 How to follow the rest of the Champions League action tonight It's not just Man United in action tonight - Spencer Morgan is on blog duties for Arsenal's trip to Sevilla, as well as the other games going on tonight across the Champions League. In Man United's group, Galatasaray and Bayern are currently drawing 1-1, but I'll keep you updated if that score changes. They've just started the second half in Turkey. Sevilla vs Arsenal - Champions League: Latest scores updates Follow Mail Sport's live blog for all the latest updates from Ramon Sanchez-Pizjuan Stadium as Sevilla host Arsenal in the Champions League . Mail Online 17:48 Man United team news - two changes for Erik ten Hag's side Following Saturday night's 2-1 win at Sheffield United, Erik ten Hag has made two changes to his starting 11. Raphael Varane and Sergio Reguilon come into the side for today's game against Copenhagen. Jonny Evans and Victor Lindelof both miss out, but they are available options to the manager from the bench. 17:44 Adam Shergold on Man United's priorities Mail Sport's Adam Shergold laid down some of Man United's priorities coming into this clash with Copenhagen. After high-scoring defeats to Bayern Munich and Galatasaray, it's time for Erik ten Hag's side to get some points - and confidence - on the European stage. Ten Hag's priorities ahead of Man United's must-win Copenhagen clash Never before have they lost the opening two games of a Champions League group and another defeat would probably mean Europa League at best after Christmas . Mail Online 17:41 Patrick Collins on an English hero Patrick Collins wrote about Sir Bobby Charlton for the Mail on Sunday - an English hero that many admired and wanted their children to imitate. 17:36 Hello and welcome to Man United vs Copenhagen Hello and welcome to Mail Sport's live blog covering Man United's Champions League game against Copenhagen at Old Trafford. Kick off is at 8pm local time, or in just under an hour and a half. We'll have all the team news and action. It is the club's first home game since the death of Sir Bobby Charlton, and we're expecting a great reaction to pay tribute to one of Man United's all-time greats. Key Updates Copenhagen team news View post How to follow the rest of the Champions League action tonight View post Man United team news - two changes for Erik ten Hag's side View post TOP STORIES MAN UNITED CONFIDENTIAL: Ten Hag's tributes to Sir Bobby are a far cry from Mourinho's Munich memorial display... while new book claims Glazers considered giving fans who sang loudly free tickets Wayne Rooney recalls 'moving and emotional' Munich disaster talk from Sir Bobby Charlton to Man United players in 2008, as he adjusts to new role as Birmingham City manager Sevilla vs Arsenal - Champions League LIVE: Mikel Arteta's side are desperate to pick up a vital win in Spain following their shock defeat to Lens IAN HERBERT: Is it beyond City fans to respect Sir Bobby, who helped put Manchester on the map? Manchester United legends including Gary Neville and Brian Kidd join current squad and boss Erik ten Hag in signing messages of condolence in memory of Sir Bobby Charlton How Bobby and Jack Charlton ended their painful feud of 42 years with a heartfelt hug after falling out over their mum Cissie - as real reason Bobby didn't go to Jack's funeral is revealed In-form Maguire and McTominay have to start, Hojlund must come back to haunt his old club and Man United really need to hold onto leads! Erik ten Hag's priorities for must-win Copenhagen clash Erik ten Hag will struggle to take Man United 'back to the top', claims Simon Jordan, as he brands the Red Devils boss 'a small man in a big suit' ahead of must-win Champions League clash with Copenhagen Porn star Sky Bri reveals mystery Man United footballer has been DMing her - and says he's one of a few 'pretty big players' to message her Man City's fury at fans' sick Sir Bobby Charlton chants: Man United's rivals apologise to football legend's family, as video emerges of chanting at their game shortly after he died aged 86 OLIVER HOLT: The Manchester United of Sir Bobby Charlton's era were celebrated as 'England's Team'. Now there's just sadness over a club in decay Manchester United legend's grandson scores stunning long-range goal on his EFL debut as the 21-year-old notches late winner for Notts County against Gillingham Man United can learn from Copenhagen on AND off the pitch! Champions League opponents are the 'Ajax of the North', have an outstanding recruitment programme and trade blows with Europe's elite Mail Sport launches new WhatsApp Channels: Follow for all the latest breaking news and updates about Arsenal, Manchester United, Chelsea and Liverpool today Man United news RECAP: Tributes continue to pour in for Sir Bobby Charlton as Red Devils look ahead to tonight's Champions League clash with Copenhagen Manchester United confident rival Man City fans will respect minute's applause held for Sir Bobby Charlton ahead of Sunday's derby clash Sir Bobby Charlton's last surviving brother, Tommy, 77, makes heartfelt tribute to Man United legend following his death, saying: 'If ever there was a place reserved in heaven, it is for Bob' Man United deny Jadon Sancho is set to return from his exile after fans thought Erik ten Hag said 'Sancho' and not 'Sergio' in his press conference when asked about fitness of left-back Reguilon PETE JENSON: Sevilla lack consistency but under new manager Diego Alonso and with their ability to step up in big games, the Europa League holders could cause trouble for Arsenal EXCLUSIVE: Jose Antonio Reyes' father says his son and Mikel Arteta were 'like brothers' as his family open their doors to Mail Sport ahead of an emotional night as Arsenal and Sevilla face-off in the Champions League Harry Kane on cloud nine as he sets Bayern Munich club record by scoring ninth goal in opening eight Bundesliga games in 3-1 win over Mainz Spilling the tea on your Old Trafford exit, David? De Gea meets up for a 'coffee and friends' date with his ex-Man United team-mates... but there's no room for his £47m Red Devils replacement Andre Onana at the table Marcus Rashford pays tribute to Sir Bobby Charlton after his death aged 86 by dedicating Manchester United's win against Sheffield United to the World Cup winner and his family Sir Bobby Charlton dies aged 86: England and Manchester United legend passes away surrounded by family after long battle with dementia - leaving just Sir Geoff Hurst alive from the team of heroes who won the World Cup in 1966 BRYAN ROBSON: Every kid wanted to be Sir Bobby Charlton... he was the role model for every young footballer. He will be remembered as the perfect gentlemen, the perfect player When Eddie met Kevin! Keegan and Howe - the King and Prince of Newcastle - discuss the lofty ambitions of the high-flying Magpies... and even talk up their chances of Premier League or European glory The kind of man that Englishmen dreamed that their sons might become: Bobby Charlton was a typically English hero, writes PATRICK COLLINS CHRIS WHEELER: It's fitting that Man United's first home match since Sir Bobby Charlton's passing is in the European Cup, which defined the great man Jude Bellingham has had a HUGE impact at Real Madrid while Harry Kane has been the 'perfect striker' for Bayern Munich... but which England star has made a better start to life abroad? Man United's strikeforce is STILL not in tune, it's jeepers keepers at both Arsenal and Chelsea, Liverpool have VAR to thank this time... and free midweeks are happy days for Ange Postecoglou! 10 THINGS WE LEARNED from the Premier League weekend Manchester United youngster Tyler Fletcher - son of ex-midfielder Darren - switches his international allegiance back to Scotland from England... after 16-year-old and his twin brother Jack moved from Man City in the summer Jadon Sancho's Manchester United career is '90 per cent over' with officials convinced the £73m star 'must find a new club in January'... as he remains exiled from the first team Wish you were still here? Man United captain Bruno Fernandes meets up with booted-out goalkeeper David de Gea in Manchester amid £47m Andre Onana's struggles, as fans urge the Spaniard to 'come back in January' ROB DRAPER: Sir Bobby Charlton carried memories of the Munich Air Disaster all his life. That he wasn't defined by the tragedy showed just how extraordinary he was Sir Bobby Charlton's death at the age of 86 leaves hat-trick hero Sir Geoff Hurst as the SOLE surviving member of the England team that started the 1966 World Cup final Man United hold a minute's silence for Sir Bobby Charlton before their Champions League press conference, as they plot more tributes to English football legend at matches this week Dejan Kulusevski is convinced lack of European football is 'HUGE' advantage for Tottenham over title rivals, with Spurs aiming to move five points clear at the top on Friday Luke Shaw expected to be OUT for another FIVE WEEKS, missing vital games against Man City and Copenhagen in the Champions League - but there's finally good injury news as Aaron Wan-Bissaka nears a return Chelsea 'are preparing shock January bid for Aaron Ramsdale', with Arsenal goalkeeper stuck behind David Raya in pecking order and Robert Sanchez struggling at Blues England 15-16 South Africa - Rugby World Cup semi-final RECAP: Agony for England as South Africa steal victory with a late penalty kick after leading for just TWO minutes in the game Darren England will referee his first game since his disastrous VAR error that infuriated Liverpool when he takes charge of Saturday's Severnside derby between Cardiff and Bristol City The last picture of Sir Bobby Charlton: Brave star posed for snap while taking covid jab in 2021 despite ongoing battle with dementia Rio Ferdinand calls on Manchester United players to feed off crowd atmosphere on emotional Champions League game as Old Trafford remembers Sir Bobby Charlton Pep Guardiola was WRONG to sell Cole Palmer to Chelsea, says Dominic King after the £42.5m winger scored against Arsenal... but Chris Sutton says you can't doubt the City boss' judgement as hosts clash on Mail Sport's It's All Kicking Off Ajax are likely to fail with any approach for Mitchell van der Gaag as Louis van Gaal looks to lure Manchester United assistant coach back to Holland Tottenham 2-0 Fulham - Premier League RECAP: Son Heung-min and James Maddison fire goals for Spurs in the London derby as Ange Postecoglou's side return top of the Premier League table Kepa Arrizabalaga wants to stay at Real Madrid on permanent basis after strong start, but Chelsea loanee admits 'nothing has been negotiated yet' Sheffield United 1-2 Man United - Premier League RECAP: Erik ten Hag's men seal victory on the day of Sir Bobby Charlton's passing after goals from Diogo Dalot and Scott McTominay Erik ten Hag bluntly tells Andre Onana to 'step up' and 'give better performances' after £47m goalkeeper's error-strewn start to his Man United career... but backs his ex-Ajax stopper to come good US Grand Prix - Race LIVE: Max Verstappen overtakes Lando Norris to grab the lead in Austin, with Lewis Hamilton in second Lewis Hamilton and Charles Leclerc post joint cryptic message on social media after both were disqualified from the US Grand Prix for running an illegal floor Can you recognise the Premier League cult hero jumping on the Overground to watch his former club's old rivals? EXCLUSIVE: World Rugby's new Nations Championship is given the go-ahead by the narrowest of margins in council vote - but some are warning the new international competition will be 'the death' of the sport Bill Kenwright dies aged 78: Everton chairman and legendary West End theatre impresario behind Blood Brothers, Joseph and Fame passes away days after returning home from surgery on cancerous liver tumour RIATH AL-SAMARRAI: Tottenham have handled Harry Kane's exit awfully well, but Ange Postecoglou's thin squad will be challenged when the Africa Cup of Nations and Asian Cup come around Everton star Alex Iwobi shares screenshot of the caring messages he used to get from Bill Kenwright stating how 'proud' he was of the midfielder... as he shares very personal heartfelt tribute to late chairman Former QPR co-owner Tony Fernandes is slammed as 'unprofessional' for getting a half-naked massage during a WORK MEETING - and boasting about the 'culture' on LinkedIn - before hastily deleting his post Real Madrid players rally around Vinicius Junior after the forward was racially abused by multiple Sevilla fans during LaLiga draw as Jude Bellingham declares 'always with you, brother' Wrexham owner Rob McElhenney announces new 'Parks and Wrex' development project in hilarious video with actor Chris Pratt as part of birthday gift for co-owner Ryan Reynolds Barcelona and Real Madrid are 'keeping tabs on 17-year-old French wonderkid Eli Junior Kroupi', with Lorient starlet taking Ligue 1 by storm Mike Tyson shows off his ripped physique aged 57 as the former world heavyweight champion helps MMA star Francis Ngannou prepare for his crossover fight with Tyson Fury REVEALED: World Rugby are looking into a DIFFERENT incident involving Tom Curry and Bongi Mbonambi in investigation into England 'white ****' slur - despite fans claiming South Africa star's innocence was proven Tributes flood in for Bill Kenwright following his death at the age of 78 - as Liverpool, Jamie Carragher and Wayne Rooney join the footballing world and beyond in saluting the former Everton chairman Cricketer Fawad Ahmed announces his four-month-old son has died: 'Till we meet again' Was South Africa's 'white ****' slur lost in translation? Springboks fans say Bongi Mbonambi was speaking in Afrikaans - and Google Translate shows they may have a case What are Jackson Mahomes' alleged crimes and what has he been charged with? All the latest after he was spotted with Taylor Swift to watch Travis Kelce's Chiefs win Jack Grealish meets up with his 'first football hero' at Man City's training ground... but can you recognise the iconic ex-Premier League striker? Travis Kelce has nervous 'alarms' going off in his head over new 'level of superstardom' from dating Taylor Swift, reveals his brother Jason: 'Man, this is a lot' Taylor Swift fans fume that Jackson Mahomes was allowed in the same Chiefs VIP box as pop superstar as he awaits hearing over alleged sexual battery: 'Someone get her out immediately' EXCLUSIVE: Taylor Swift and Travis Kelce arrive at the Chiefs star's mansion in his Rolls Royce for party with friends and family catered by Kansas City BBQ joint - after the loved-up pair left win over Chargers together EXCLUSIVE: Taylor Swift heads to Travis Kelce's house for lunch of turkey omelet and chicken tacos after flying in from LA on her private jet to watch her man play in a fourth Chiefs game South Africa fans uncover footage they claim proves Bongi Mbonambi's 'white ****' call is actually him shouting to team-mates in Afrikaans... but it's NOT even the incident World Rugby are investigating Kansas City Chiefs wide receiver Justyn Ross is arrested, facing felony charge of criminal damage of more than $25,000 Legendary commentator Martin Tyler set to return to the gantry four months after leaving Sky Sports to once again call a live Premier League game Tottenham fans pictured waving Israel flags during their clash against Fulham despite Premier League ban amid Palestine conflict Ireland rugby star strips down to her pineapple-print underwear at Rugby World Cup, as she celebrates 'the party' despite her nation's early exit Rapper Blueface proposes to his girlfriend in WILD day at the Rams game... after turning his private suite into a STRIP CLUB and offering rival players wads of cash to throw the game Mattress Mack loses out on 'at least $43.4 MILLION' after Houston Astros suffer 11-4 loss in deciding ALCS Game 7 to Texas Rangers Mohamed Salah IS Liverpool's greatest ever player in the Premier League era - not Steven Gerrard - claims Mail Sport's Chris Sutton on It's All Kicking Off... and believes only one player in the top-flight's history is more ruthless Tottenham 2-0 Fulham: Son Heung-min and James Maddison fire Spurs back to the top of the Premier League as Ange Postecoglou's side capitalise on defensive errors EXCLUSIVE: Ashlyn Harris loads her luggage into a taxi and heads to Newark Airport as she jets out of New York amid Ali Krieger split... after her ex-wife dropped hint she had cheated on her with new lover Sophia Bush Georgetown University women's basketball coach Tasha Butts dead at 41: Tributes pour in for former star player after two-year cancer battle Mary Lou Retton has returned HOME after 'scary setback' in her fight against rare form of pneumonia, as family reveal US Olympic legend is in 'recovery mode' after leaving the ICU Max Verstappen's model girlfriend is left SERIOUSLY unimpressed as he's booed after winning the US Grand Prix ahead of disqualified Lewis Hamilton Lionel Messi, his stunning wife, Antonela, and their three sons pose with Ed Sheeran as the forward kicks off his offseason with the pop star's concert after Inter Miami missed out on playoffs Jamie Carragher lauds 22-year-old Chelsea star for stepping up to show 'captain-like authority' against his team-mate and 'seasoned professional Raheem Sterling' during the Blues' 2-2 draw against Arsenal Footy legend's wedding EVACUATED after bushfire caused by squatters forces police to intervene EXCLUSIVE: 'I'm living like a monk... but I was a fat baby and I will be fat when I die!': Tyson Fury says his love handles will help him beat ripped Francis Ngannou - and sends a message to Oleksandr Usyk Ange Postecoglou SLAMS his Tottenham side 'for taking liberties in possession' and labels second half of 2-0 win over Fulham 'the WORST 45 minutes we've had all year'... despite going top! Arsenal break silence over all-white squad team photo after race row as they accept their women's team 'does not reflect the diversity that exists across the club' Alan Jones pictured in blackface at Wallaby 'skit night' during famous Bledisloe Cup winning tour of New Zealand Wife of Geelong star Gary Rohan has opened up about her heartbreaking miscarriage experience: 'You never think it's going to happen to you' KSI hires lawyer after controversial defeat to Tommy Fury, turning to a legal team in a bid to overturn the fight result after being more accurate with his punches New York Jets quarterback Zach Wilson enjoys bye week by jetting off to Utah for a spooky Halloween weekend with his stunning girlfriend Nicolette Dellanno... but he still can't resist picking up a football! Travis Kelce hilariously celebrates with a fist-pump as fan screams 'Let's go, Taylor's boyfriend' at him... after pop superstar Swift attended a FOURTH Chiefs game to watch him play Eagles coach Nick Sirianni gives passionate defense of controversial play many in the NFL want banned Garth Crooks names two Liverpool stars in his BBC team of the week column... but then BARELY mentions them as he uses it to lambast Luis Diaz and call for Ibrahima Konate red card Travis Kelce's dad Ed jokes Taylor Swift didn't 'get the diva memo' as he praises the 'very smart' and 'special' pop star amid her fledgling romance with his Kansas City Chiefs star son Champions League Sir Bobby Charlton Share or comment on this article: Man United vs Copenhagen - Champions League LIVE: Red Devils to pay tribute at first home game since Sir Bobby Charlton's passing e-mail The more I listen to Rio Ferdinand the harder it i... by ucanotbserious 11 Add comment Comments 17 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-10-24 18:09:57","image_url":"https://i.dailymail.co.uk/1s/2023/10/24/10/76836695-0-image-a-17_1698140752943.jpg","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"c149c705a34f8dcc8533242bf4474316","title":"Sevilla vs Arsenal - Champions League LIVE: Mikel Arteta's side are desperate to pick up a vital win in Spain following their shock defeat to Lens","link":"https://www.dailymail.co.uk/sport/live/article-12665591/Sevilla-vs-Arsenal-Champions-League-2023-24-Latest-Result.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Follow Mail Sport's live blog for all the latest updates from Ramon Sanchez-Pizjuan Stadium as Sevilla host Arsenal in the Champions League .","content":"LIVE Sevilla vs Arsenal - Champions League LIVE: Mikel Arteta's side are desperate to pick up a vital win in Spain following their shock defeat to Lens By Spencer Morgan For Mailonline Published: 18:32, 24 October 2023 | Updated: 19:43, 24 October 2023 e-mail 7 View comments Follow Mail Sport's live blog for all the latest updates from Ramon Sanchez-Pizjuan Stadium as Sevilla host Arsenal in the Champions League . 18:32 30 minutes to kick-off 18:26 Sevilla not in the best form The Spanish side sit 13th in LaLiga with just two wins from their opening nine matches while they have failed to win either of their first two games in Europe. However, Saturday's 1-1 draw with Real Madrid should give them some cofidence. 18:09 Sevilla team news 18:03 Arsenal team news One change from Saturday as Tomiyasu replaces Zinchenko. Starting XI: Raya; White, Saliba, Gabriel, Tomiyasu; Jorginho, Rice, Ødegaard: Saka, Martinelli, Jesus. Subs: Ramsdale, Hein, Zinchenko, Cedric, Kiwior, Elneny, Havertz, Vieira, Smith Rowe, Trossard, Nelson, Nketiah. 17:59 The Gunners have arrived Mikel Arteta's men are in the building. 17:53 No Partey tonight The midfielder has not travelled to Spain with the squad... 17:48 The stage is set 17:39 State of play The Gunners sit second with three points following their emphatic 4-0 victory over PSV and surprise 2-1 defeat to Lens. Sevilla sit third with draws in their opening two matches. Lens top the group with four points. 17:34 Good evening! And welcome to Mail Sport's live coverage of Sevilla vs Arsenal in the Champions League. Group B is finely poised andthe gunners will be in trouble if they don't a result tonight. Team news to follow with kick-off at 8pm. TOP STORIES EXCLUSIVE: Jose Antonio Reyes' father says his son and Mikel Arteta were 'like brothers' as his family open their doors to Mail Sport ahead of an emotional night as Arsenal and Sevilla face-off in the Champions League Harry Kane on cloud nine as he sets Bayern Munich club record by scoring ninth goal in opening eight Bundesliga games in 3-1 win over Mainz Mikel Arteta rejects Gary Neville's claim that David Raya is struggling with the pressure of replacing Aaron Ramsdale as Arsenal goalkeeper after his errors in the draw at Chelsea Former Liverpool midfielder Suso on training with a teenage Martin Odegaard, his scouse 'family' and winning two Europa Leagues with Sevilla ahead of Champions League clash with Arsenal PETE JENSON: Sevilla lack consistency but under new manager Diego Alonso and with their ability to step up in big games, the Europa League holders could cause trouble for Arsenal Man United vs Copenhagen - Champions League LIVE: Red Devils to pay tribute at first home game since Sir Bobby Charlton's passing Dejan Kulusevski is convinced lack of European football is 'HUGE' advantage for Tottenham over title rivals, with Spurs aiming to move five points clear at the top on Friday Chelsea 'are preparing shock January bid for Aaron Ramsdale', with Arsenal goalkeeper stuck behind David Raya in pecking order and Robert Sanchez struggling at Blues Hoping for a miracle at the bottom of the North Sea: Divers are sent down to check for signs of life inside sunken British cargo ship after it collided with second vessel leaving one dead and four missing off Germany Mail Sport launches new WhatsApp Channels: Follow for all the latest breaking news and updates about Arsenal, Manchester United, Chelsea and Liverpool today MAN UNITED CONFIDENTIAL: Ten Hag's tributes to Sir Bobby are a far cry from Mourinho's Munich memorial display... while new book claims Glazers considered giving fans who sang loudly free tickets Third executive at Russian oil giant that criticised Putin's invasion of Ukraine dies suddenly British cargo ship sinks: Moment P&O passengers are told their cruiser is joining hunt for 'people in the water' after bulk carrier crash that left one dead and four missing off Germany Pep Guardiola was WRONG to sell Cole Palmer to Chelsea, says Dominic King after the £42.5m winger scored against Arsenal... but Chris Sutton says you can't doubt the City boss' judgement as hosts clash on Mail Sport's It's All Kicking Off Scientists are studying a 116-year-old San Francisco-born grandma who is the oldest woman in the world to learn her secrets and develop cures for diseases Everton star Alex Iwobi shares screenshot of the caring messages he used to get from Bill Kenwright stating how 'proud' he was of the midfielder... as he shares very personal heartfelt tribute to late chairman Tiny brewery in historic pub is 'threatened' by £15billion car giant Mercedes Benz over beer label the car giant says is too similar to its logo Arsenal break silence over all-white squad team photo after race row as they accept their women's team 'does not reflect the diversity that exists across the club' In-form Maguire and McTominay have to start, Hojlund must come back to haunt his old club and Man United really need to hold onto leads! Erik ten Hag's priorities for must-win Copenhagen clash Queen Letizia of Spain looks pensive as she visits Tenerife with King Felipe to learn how the area has been impacted by ongoing forest fires Chantelle Houghton flaunts her 4st weight loss in a yellow bikini as she hits the beach in Marbella - after claiming Big Brother 'ruined' her life Erik ten Hag will struggle to take Man United 'back to the top', claims Simon Jordan, as he brands the Red Devils boss 'a small man in a big suit' ahead of must-win Champions League clash with Copenhagen Can you recognise the Premier League cult hero jumping on the Overground to watch his former club's old rivals? When Eddie met Kevin! Keegan and Howe - the King and Prince of Newcastle - discuss the lofty ambitions of the high-flying Magpies... and even talk up their chances of Premier League or European glory Man United's strikeforce is STILL not in tune, it's jeepers keepers at both Arsenal and Chelsea, Liverpool have VAR to thank this time... and free midweeks are happy days for Ange Postecoglou! 10 THINGS WE LEARNED from the Premier League weekend Jude Bellingham has had a HUGE impact at Real Madrid while Harry Kane has been the 'perfect striker' for Bayern Munich... but which England star has made a better start to life abroad? Alex Scott cuts a casual figure as she leaves radio studios - after wishing 'secret girlfriend' Jess Glynne a happy birthday in sweet post Chelsea 2-2 Arsenal - Premier League RECAP: Leandro Trossard sneaks in at the back post to tuck home and complete Gunners' unlikely comeback... as Blues surrender a two-goal lead Jadon Sancho's Manchester United career is '90 per cent over' with officials convinced the £73m star 'must find a new club in January'... as he remains exiled from the first team Jack Grealish meets up with his 'first football hero' at Man City's training ground... but can you recognise the iconic ex-Premier League striker? Man United can learn from Copenhagen on AND off the pitch! Champions League opponents are the 'Ajax of the North', have an outstanding recruitment programme and trade blows with Europe's elite Wayne Rooney recalls 'moving and emotional' Munich disaster talk from Sir Bobby Charlton to Man United players in 2008, as he adjusts to new role as Birmingham City manager Lauryn Hill fans fear for her health after singer is forced to postpone tour date to prevent 'serious strain or damage' to her vocal chords Jamie Carragher lauds 22-year-old Chelsea star for stepping up to show 'captain-like authority' against his team-mate and 'seasoned professional Raheem Sterling' during the Blues' 2-2 draw against Arsenal Man United deny Jadon Sancho is set to return from his exile after fans thought Erik ten Hag said 'Sancho' and not 'Sergio' in his press conference when asked about fitness of left-back Reguilon England 15-16 South Africa - Rugby World Cup semi-final RECAP: Agony for England as South Africa steal victory with a late penalty kick after leading for just TWO minutes in the game Brits are realising why Fanta tastes so much better abroad - and it's all to do with the nutritional value Tottenham 2-0 Fulham - Premier League RECAP: Son Heung-min and James Maddison fire goals for Spurs in the London derby as Ange Postecoglou's side return top of the Premier League table Spilling the tea on your Old Trafford exit, David? De Gea meets up for a 'coffee and friends' date with his ex-Man United team-mates... but there's no room for his £47m Red Devils replacement Andre Onana at the table Bachelor Nation's Jason Tartick celebrates his 35th birthday by showing off muscles with shirtless snap following split with Kaitlyn Bristowe: 'Please be better than 34' Kepa Arrizabalaga wants to stay at Real Madrid on permanent basis after strong start, but Chelsea loanee admits 'nothing has been negotiated yet' US Grand Prix - Race LIVE: Max Verstappen overtakes Lando Norris to grab the lead in Austin, with Lewis Hamilton in second Gemma Owen's brother James tells of his 'heartbreak' at being unable to follow in England legend dad Michael's footballer footsteps as he details his battle with a rare eye condition Sky Sports are forced to apologise after broadcasting a fan shouting 'nice a**e Leno' at Fulham's goalkeeper while he took a goal kick against Tottenham Manchester United legends including Gary Neville and Brian Kidd join current squad and boss Erik ten Hag in signing messages of condolence in memory of Sir Bobby Charlton Amber Heard is BACK using her cane in Spain - after ditching the walking aid for days as she continues her recovery after hip injury Jamie Carragher argues Spurs fans would be 'delighted' with a place in the Champions League spots on Monday Night Football... and Wolves manager Gary O'Neil praises Ange Postecoglou's outlook Sandro Tonali will learn the length of his ban from football for illegal gambling 'in the next 24 hours' as midfielder trains ahead of Newcastle's Champions League clash with Dortmund Sean Longstaff confident Newcastle can cope loss of Sandro Tonali with midfielder set to learn length of ban for illegal gambling... as he insists Italian has been happy at the club ever since he joined Princess Leonor of Spain says she 'understands her duty' in a speech ahead of her 18th birthday as she prepares to one day become Queen Porn star Sky Bri reveals mystery Man United footballer has been DMing her - and says he's one of a few 'pretty big players' to message her IAN HERBERT: Is it beyond City fans to respect Sir Bobby, who helped put Manchester on the map? Lewis Hamilton and Charles Leclerc post joint cryptic message on social media after both were disqualified from the US Grand Prix for running an illegal floor EXCLUSIVE: World Rugby's new Nations Championship is given the go-ahead by the narrowest of margins in council vote - but some are warning the new international competition will be 'the death' of the sport Bill Kenwright dies aged 78: Everton chairman and legendary West End theatre impresario behind Blood Brothers, Joseph and Fame passes away days after returning home from surgery on cancerous liver tumour RIATH AL-SAMARRAI: Tottenham have handled Harry Kane's exit awfully well, but Ange Postecoglou's thin squad will be challenged when the Africa Cup of Nations and Asian Cup come around Former QPR co-owner Tony Fernandes is slammed as 'unprofessional' for getting a half-naked massage during a WORK MEETING - and boasting about the 'culture' on LinkedIn - before hastily deleting his post Real Madrid players rally around Vinicius Junior after the forward was racially abused by multiple Sevilla fans during LaLiga draw as Jude Bellingham declares 'always with you, brother' Wrexham owner Rob McElhenney announces new 'Parks and Wrex' development project in hilarious video with actor Chris Pratt as part of birthday gift for co-owner Ryan Reynolds Barcelona and Real Madrid are 'keeping tabs on 17-year-old French wonderkid Eli Junior Kroupi', with Lorient starlet taking Ligue 1 by storm Mike Tyson shows off his ripped physique aged 57 as the former world heavyweight champion helps MMA star Francis Ngannou prepare for his crossover fight with Tyson Fury REVEALED: World Rugby are looking into a DIFFERENT incident involving Tom Curry and Bongi Mbonambi in investigation into England 'white ****' slur - despite fans claiming South Africa star's innocence was proven Tributes flood in for Bill Kenwright following his death at the age of 78 - as Liverpool, Jamie Carragher and Wayne Rooney join the footballing world and beyond in saluting the former Everton chairman Cricketer Fawad Ahmed announces his four-month-old son has died: 'Till we meet again' Was South Africa's 'white ****' slur lost in translation? Springboks fans say Bongi Mbonambi was speaking in Afrikaans - and Google Translate shows they may have a case What are Jackson Mahomes' alleged crimes and what has he been charged with? All the latest after he was spotted with Taylor Swift to watch Travis Kelce's Chiefs win Travis Kelce has nervous 'alarms' going off in his head over new 'level of superstardom' from dating Taylor Swift, reveals his brother Jason: 'Man, this is a lot' Taylor Swift fans fume that Jackson Mahomes was allowed in the same Chiefs VIP box as pop superstar as he awaits hearing over alleged sexual battery: 'Someone get her out immediately' EXCLUSIVE: Taylor Swift and Travis Kelce arrive at the Chiefs star's mansion in his Rolls Royce for party with friends and family catered by Kansas City BBQ joint - after the loved-up pair left win over Chargers together EXCLUSIVE: Taylor Swift heads to Travis Kelce's house for lunch of turkey omelet and chicken tacos after flying in from LA on her private jet to watch her man play in a fourth Chiefs game South Africa fans uncover footage they claim proves Bongi Mbonambi's 'white ****' call is actually him shouting to team-mates in Afrikaans... but it's NOT even the incident World Rugby are investigating Kansas City Chiefs wide receiver Justyn Ross is arrested, facing felony charge of criminal damage of more than $25,000 Legendary commentator Martin Tyler set to return to the gantry four months after leaving Sky Sports to once again call a live Premier League game Tottenham fans pictured waving Israel flags during their clash against Fulham despite Premier League ban amid Palestine conflict Ireland rugby star strips down to her pineapple-print underwear at Rugby World Cup, as she celebrates 'the party' despite her nation's early exit Rapper Blueface proposes to his girlfriend in WILD day at the Rams game... after turning his private suite into a STRIP CLUB and offering rival players wads of cash to throw the game Mattress Mack loses out on 'at least $43.4 MILLION' after Houston Astros suffer 11-4 loss in deciding ALCS Game 7 to Texas Rangers Mohamed Salah IS Liverpool's greatest ever player in the Premier League era - not Steven Gerrard - claims Mail Sport's Chris Sutton on It's All Kicking Off... and believes only one player in the top-flight's history is more ruthless Tottenham 2-0 Fulham: Son Heung-min and James Maddison fire Spurs back to the top of the Premier League as Ange Postecoglou's side capitalise on defensive errors EXCLUSIVE: Ashlyn Harris loads her luggage into a taxi and heads to Newark Airport as she jets out of New York amid Ali Krieger split... after her ex-wife dropped hint she had cheated on her with new lover Sophia Bush Georgetown University women's basketball coach Tasha Butts dead at 41: Tributes pour in for former star player after two-year cancer battle Manchester United legend's grandson scores stunning long-range goal on his EFL debut as the 21-year-old notches late winner for Notts County against Gillingham Mary Lou Retton has returned HOME after 'scary setback' in her fight against rare form of pneumonia, as family reveal US Olympic legend is in 'recovery mode' after leaving the ICU Max Verstappen's model girlfriend is left SERIOUSLY unimpressed as he's booed after winning the US Grand Prix ahead of disqualified Lewis Hamilton Lionel Messi, his stunning wife, Antonela, and their three sons pose with Ed Sheeran as the forward kicks off his offseason with the pop star's concert after Inter Miami missed out on playoffs Manchester United youngster Tyler Fletcher - son of ex-midfielder Darren - switches his international allegiance back to Scotland from England... after 16-year-old and his twin brother Jack moved from Man City in the summer Footy legend's wedding EVACUATED after bushfire caused by squatters forces police to intervene EXCLUSIVE: 'I'm living like a monk... but I was a fat baby and I will be fat when I die!': Tyson Fury says his love handles will help him beat ripped Francis Ngannou - and sends a message to Oleksandr Usyk Ange Postecoglou SLAMS his Tottenham side 'for taking liberties in possession' and labels second half of 2-0 win over Fulham 'the WORST 45 minutes we've had all year'... despite going top! OLIVER HOLT: The Manchester United of Sir Bobby Charlton's era were celebrated as 'England's Team'. Now there's just sadness over a club in decay Alan Jones pictured in blackface at Wallaby 'skit night' during famous Bledisloe Cup winning tour of New Zealand Wife of Geelong star Gary Rohan has opened up about her heartbreaking miscarriage experience: 'You never think it's going to happen to you' KSI hires lawyer after controversial defeat to Tommy Fury, turning to a legal team in a bid to overturn the fight result after being more accurate with his punches New York Jets quarterback Zach Wilson enjoys bye week by jetting off to Utah for a spooky Halloween weekend with his stunning girlfriend Nicolette Dellanno... but he still can't resist picking up a football! Travis Kelce hilariously celebrates with a fist-pump as fan screams 'Let's go, Taylor's boyfriend' at him... after pop superstar Swift attended a FOURTH Chiefs game to watch him play Eagles coach Nick Sirianni gives passionate defense of controversial play many in the NFL want banned Garth Crooks names two Liverpool stars in his BBC team of the week column... but then BARELY mentions them as he uses it to lambast Luis Diaz and call for Ibrahima Konate red card Travis Kelce's dad Ed jokes Taylor Swift didn't 'get the diva memo' as he praises the 'very smart' and 'special' pop star amid her fledgling romance with his Kansas City Chiefs star son Ajax are likely to fail with any approach for Mitchell van der Gaag as Louis van Gaal looks to lure Manchester United assistant coach back to Holland Champions League Mikel Arteta Spain Share or comment on this article: Sevilla vs Arsenal - Champions League LIVE: Mikel Arteta's side are desperate to pick up a vital win in Spain following their shock defeat to Lens e-mail It's so obvious how Ramsdala has fallen out of fav... by Bosse Andersson 10 Add comment Comments 7 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-10-24 18:09:43","image_url":"https://i.dailymail.co.uk/1s/2023/10/24/10/76929807-0-image-a-32_1698141271133.jpg","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"18a3be557114b8826e5611ddec126311","title":"Bangladesh will love to finish 5-6 if not in semis: Shakib after 4th straight loss","link":"https://www.indiatoday.in/sports/cricket/story/bangladesh-will-love-to-finish-5-6-if-not-in-semis-says-captain-shakib-after-4th-straight-loss-2453229-2023-10-24?utm_source=rss","keywords":null,"creator":null,"video_url":null,"description":"Bangladesh will love to finish 5-6 if not in semis: Shakib after 4th straight loss","content":"Listen to Story Bangladesh captain Shakib Al Hasan said they lost the match in the final 10 overs when the South African duo of Quinton de Kock and Heinrich Klaasen went on a rampage, adding 144 runs at Mumbai's Wankhede Stadium on Tuesday. Quinton de Kock notched his third century in just five innings, propelling South Africa to a commanding 149-run victory over Bangladesh in the World Cup on Tuesday. The South African team, on a dominant streak, posted an imposing total of 382/5, marking the third-highest score in the tournament (the first two spots were also held by the Proteas). They then swiftly dismantled Bangladesh's underwhelming batting performance, sending them back to the pavilion with a total of 233 runs after 46.4 overs. \"We bowled first 25 overs well. We got three wickets, they were going at about 5 an over. From there they kicked on. Quinton batted really well, and the way Klaasen finished was something we didn't have any answer to. On a ground like this it can happen but we should've bowled better. Lost the game in the last 10 overs,\" Shakib al Hasan told the broadcasters after Bangladesh lost. Mahmudullah Riyad displayed remarkable courage by scoring 111 runs from 111 balls, achieving his fourth century in 225 ODIs and his first in six years. Unfortunately, the rest of the Bangladesh batting lineup struggled on a pitch that still favored batsmen. This defeat marked Bangladesh's fourth consecutive loss in the World Cup, while South Africa continued their impressive form with four wins out of five games. Furthermore, this loss was one of Bangladesh's heaviest in terms of runs in World Cup history, marking their third-largest margin of defeat. However, the veteran all-rounder did not lose hope of his team finishing strongly in this World Cup. Shakib said that he would be happy if Bangladesh managed to finish fifth or sixth if not in the semi-final. \"Has been lot of talking about whether Mushfiq and Mahmudullah should bat higher. But the role they have, they're doing very well. Our top four batters need to do well. Long way to go in this tournament, anything can happen. Lot to be learnt, and lot to play for. Will love to finish 5-6 if not in the semis. We're not playing like a team that can do it, but hope to finish stronger,\" Shakib added.","pubDate":"2023-10-24 17:58:02","image_url":null,"source_id":"indiatoday","source_priority":2885,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"7904f8192967a1541ff735f58abeee8e","title":"World Cup 2023 Points Table: સાઉથ આફ્રિકાની જીતથી પોઈન્ટ ટેબલમાં ફેરબદલ","link":"https://gujarati.abplive.com/sports/cricket/world-cup-2023-points-table-update-after-sa-vs-ban-south-africa-beat-bangladesh-by-149-runs-in-wankhade-stadium-862706","keywords":["ક્રિકેટ"],"creator":["abpasmita.in"],"video_url":null,"description":"World Cup 2023 Points Table Update After SA vs BAN: સાઉથ આફ્રિકાએ વર્લ્ડ કપ 2023માં બાંગ્લાદેશને 149 રનથી હરાવીને પોઈન્ટ ટેબલમાં મોટો ફેરફાર કર્યો છે. ટૂર્નામેન્ટમાં આફ્રિકાની આ ચોથી જીત હતી, જે બાદ તેઓ ન્યુઝીલેન્ડને પાછળ છોડીને પોઈન્ટ ટેબલમાં બીજા સ્થાને આવી ગયા હતા. જ્યારે હારતાં બાંગ્લાદેશ છેલ્લા સ્થાને એટલે કે 10માં સ્થાને સરકી ગયું છે. મેચ બાદ ઈંગ્લેન્ડ ભલે એક સ્થાન આગળ વધી ગયું હોય પરંતુ ટીમની મુસીબતો હજુ ઓછી થઈ નથી. આ જીત બાદ દક્ષિણ આફ્રિકાનો નેટ રન રેટ 2.370 થઈ ગયો છે, જે હાલમાં ટૂર્નામેન્ટની કોઈપણ અન્ય ટીમ કરતા વધારે છે. નંબર વન પર રહેલું ભારત પણ રન રેટના મામલે આફ્રિકાથી ઘણું પાછળ છે. આ હાર બાદ શાકિબ અલ હસનની આગેવાનીમાં બાંગ્લાદેશની સેમિફાઈનલમાં પહોંચવાની આશા લગભગ સમાપ્ત થઈ ગઈ છે. ટૂર્નામેન્ટમાં બાંગ્લાદેશની પાંચ મેચમાં આ ચોથી હાર હતી. જો કે હજુ સુધી કોઈ ટીમને સત્તાવાર રીતે બહાર કરવામાં આવી નથી. ટોપ-4માં ફેરફાર દક્ષિણ આફ્રિકાએ આ જીત સાથે ટોપ-4માં એક ફેરફાર કર્યો છે. આ યાદીમાં ટીમ ઈન્ડિયા 10 પોઈન્ટ સાથે ટોપ પર છે. દક્ષિણ આફ્રિકા સારા નેટ રન રેટ સાથે બીજા સ્થાને આવી ગયું છે અને બીજા સ્થાને રહેલું ન્યુઝીલેન્ડ ત્રીજા સ્થાને સરકી ગયું છે. આ પછી ઓસ્ટ્રેલિયા 4 પોઈન્ટ અને નેગેટિવ -0.193 નેટ રન રેટ સાથે ચોથા સ્થાને છે. બીજી ટીમોની પણ આ જ હાલત છે બાકીની ટીમો તરફ આગળ વધતાં પાકિસ્તાનની ટીમ 4 પોઈન્ટ અને નેગેટિવ -0.400 નેટ રનરેટ સાથે પાંચમા, અફઘાનિસ્તાન 4 પોઈન્ટ અને નેગેટિવ -0.969 નેટ રનરેટ સાથે છઠ્ઠા, નેધરલેન્ડ 2 પોઈન્ટ અને નેગેટિવ -0.790 નેટ રનરેટ સાથે સાતમા, શ્રીલંકા 2 પોઈન્ટ નેગેટિવ -1.048 નેટ રન રેટ સાથે આઠમા સ્થાને છે, ઈંગ્લેન્ડ 2 પોઈન્ટ અને નેગેટિવ -1.248 નેટ રન રેટ સાથે નવમા સ્થાને છે અને બાંગ્લાદેશ 2 પોઈન્ટ અને નેગેટિવ -1.253 નેટ સાથે છેલ્લા એટલે કે 10મા સ્થાને છે. ટોસ જીતીને પ્રથમ બેટિંગ કરવા ઉતરેલી આફ્રિકન ટીમની શરૂઆત ખરાબ રહી હતી. રીસ હેન્ડ્રીક્સ 12 રન બનાવીને આઉટ થયો હતો અને રાસી વેન ડેર ડુસેન એક રન બનાવીને આઉટ થયો હતો. હેન્ડ્રીક્સને શોરીફુલ અને ડુક્વેની મિરાજે આઉટ કર્યો હતો. આ પછી ક્વિન્ટન ડી કોકે કેપ્ટન એડન માર્કરામ સાથે ત્રીજી વિકેટ માટે 131 રનની ભાગીદારી કરી હતી. ડી કોકે તેની ODI કારકિર્દીની 20મી સદી અને આ વર્લ્ડ કપની ત્રીજી સદી ફટકારી હતી.","content":"World Cup 2023 Points Table Update After SA vs BAN: સાઉથ આફ્રિકાએ વર્લ્ડ કપ 2023માં બાંગ્લાદેશને 149 રનથી હરાવીને પોઈન્ટ ટેબલમાં મોટો ફેરફાર કર્યો છે. ટૂર્નામેન્ટમાં આફ્રિકાની આ ચોથી જીત હતી, જે બાદ તેઓ ન્યુઝીલેન્ડને પાછળ છોડીને પોઈન્ટ ટેબલમાં બીજા સ્થાને આવી ગયા હતા. જ્યારે હારતાં બાંગ્લાદેશ છેલ્લા સ્થાને એટલે કે 10માં સ્થાને સરકી ગયું છે. મેચ બાદ ઈંગ્લેન્ડ ભલે એક સ્થાન આગળ વધી ગયું હોય પરંતુ ટીમની મુસીબતો હજુ ઓછી થઈ નથી. આ જીત બાદ દક્ષિણ આફ્રિકાનો નેટ રન રેટ 2.370 થઈ ગયો છે, જે હાલમાં ટૂર્નામેન્ટની કોઈપણ અન્ય ટીમ કરતા વધારે છે. નંબર વન પર રહેલું ભારત પણ રન રેટના મામલે આફ્રિકાથી ઘણું પાછળ છે. આ હાર બાદ શાકિબ અલ હસનની આગેવાનીમાં બાંગ્લાદેશની સેમિફાઈનલમાં પહોંચવાની આશા લગભગ સમાપ્ત થઈ ગઈ છે. ટૂર્નામેન્ટમાં બાંગ્લાદેશની પાંચ મેચમાં આ ચોથી હાર હતી. જો કે હજુ સુધી કોઈ ટીમને સત્તાવાર રીતે બહાર કરવામાં આવી નથી. ટોપ-4માં ફેરફાર દક્ષિણ આફ્રિકાએ આ જીત સાથે ટોપ-4માં એક ફેરફાર કર્યો છે. આ યાદીમાં ટીમ ઈન્ડિયા 10 પોઈન્ટ સાથે ટોપ પર છે. દક્ષિણ આફ્રિકા સારા નેટ રન રેટ સાથે બીજા સ્થાને આવી ગયું છે અને બીજા સ્થાને રહેલું ન્યુઝીલેન્ડ ત્રીજા સ્થાને સરકી ગયું છે. આ પછી ઓસ્ટ્રેલિયા 4 પોઈન્ટ અને નેગેટિવ -0.193 નેટ રન રેટ સાથે ચોથા સ્થાને છે. googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); બીજી ટીમોની પણ આ જ હાલત છે બાકીની ટીમો તરફ આગળ વધતાં પાકિસ્તાનની ટીમ 4 પોઈન્ટ અને નેગેટિવ -0.400 નેટ રનરેટ સાથે પાંચમા, અફઘાનિસ્તાન 4 પોઈન્ટ અને નેગેટિવ -0.969 નેટ રનરેટ સાથે છઠ્ઠા, નેધરલેન્ડ 2 પોઈન્ટ અને નેગેટિવ -0.790 નેટ રનરેટ સાથે સાતમા, શ્રીલંકા 2 પોઈન્ટ નેગેટિવ -1.048 નેટ રન રેટ સાથે આઠમા સ્થાને છે, ઈંગ્લેન્ડ 2 પોઈન્ટ અને નેગેટિવ -1.248 નેટ રન રેટ સાથે નવમા સ્થાને છે અને બાંગ્લાદેશ 2 પોઈન્ટ અને નેગેટિવ -1.253 નેટ સાથે છેલ્લા એટલે કે 10મા સ્થાને છે. ટોસ જીતીને પ્રથમ બેટિંગ કરવા ઉતરેલી આફ્રિકન ટીમની શરૂઆત ખરાબ રહી હતી. રીસ હેન્ડ્રીક્સ 12 રન બનાવીને આઉટ થયો હતો અને રાસી વેન ડેર ડુસેન એક રન બનાવીને આઉટ થયો હતો. હેન્ડ્રીક્સને શોરીફુલ અને ડુક્વેની મિરાજે આઉટ કર્યો હતો. આ પછી ક્વિન્ટન ડી કોકે કેપ્ટન એડન માર્કરામ સાથે ત્રીજી વિકેટ માટે 131 રનની ભાગીદારી કરી હતી. ડી કોકે તેની ODI કારકિર્દીની 20મી સદી અને આ વર્લ્ડ કપની ત્રીજી સદી ફટકારી હતી.","pubDate":"2023-10-24 17:49:45","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/10/24/d158e7431fc89145a99cd51154420d6e169816975458478_original.jpg","source_id":"abplive","source_priority":10959,"country":["india"],"category":["sports"],"language":"gujarati"},{"article_id":"ae38b91c4d953ee5033488273fa40f05","title":"Points Table : आफ्रिकेची दुसऱ्या स्थानावर झेप, बांगलादेशचा पराभव झाल्यानंतर गुणतालिकेत मोठा बदल","link":"https://marathi.abplive.com/sports/cricket/world-cup-2023-points-table-update-after-sa-vs-ban-south-africa-beat-bangladesh-by-149-runs-in-wankhade-stadium-1222124","keywords":["क्रिकेट"],"creator":["एबीपी माझा स्पोर्ट्स डेस्क"],"video_url":null,"description":"World Cup 2023 Points Table : दक्षिण आफ्रिकेने विश्वचषकातील चौथ्या विजयाची नोंद केली. या विजयासह दक्षिण आफ्रिकेने उपांत्य फेरीकडे वाटचाल केली आहे. दक्षिण आफ्रिकेने पाच सामन्यात चार विजय मिळवत आठ गुणांची कमाई केली. चौथ्या विजयासह दक्षिण आफ्रिकेने दुसऱ्या क्रमांकावर झेप घेतली. न्यूझीलंडचा संघ तिसऱ्या क्रमांकावर घसरला आहे. या सामन्याआधी दक्षिण आफ्रिका तिसऱ्या तर न्यूझीलंड दुसऱ्या क्रमांकावर होता. बांगलादेशचा 149 धावांनी दारुण पराभव केल्यामुळे दक्षिण आफ्रिकेचा रनरेटही सुधारला आहे. आफ्रिकेच्या विराट विजयानंतर गुणतालिकेत मोठा फेरबदल झालाय.  आजच्या सामन्यात काय झालं ? दक्षिण आफ्रिकेनं बांगलादेशचा 149 धावांनी धुव्वा उडवून, विश्वचषकाच्या मोहिमेत चौथा विजय साजरा केला. दक्षिण आफ्रिकेनं पाचपैकी चार सामने जिंकून आठ गुणांची कमाई केली असून, विश्वचषकाच्या गुणतालिकेत दक्षिण आफ्रिका दुसऱ्या स्थानावर आहे. मुंबईतल्या सामन्यात दक्षिण आफ्रिकेनं बांगलादेशला विजयासाठी 383 धावांचं आव्हान दिलं होतं. त्या आव्हानाचा पाठलाग करताना बांगलादेशचा अख्खा डाव 47 व्या षटकांत 233 धावांत आटोपला. या सामन्यात क्विन्टॉन डी कॉकनं 174 धावांची खेळी करून दक्षिण आफ्रिकेच्या डावाचा पाया घातला. त्यानं 140 चेंडूंमधली ही खेळी 15 चौकार आणि सात षटकारांनी सजवली. डी कॉकनं एडन मारक्रमच्या साथीनं तिसऱ्या विकेटसाठी 131 धावांची, तर हेन्ऱिक क्लासेनच्या साथीनं चौथ्या विकेटसाठी 142 धावांची भागीदारी केली. मारक्रमनं 69 चेंडूंत 60 धावांची आणि क्लासेननं 49 चेंडूंमध्ये 90 धावांची खेळी उभारली. क्लासेननं 90 धावांच्या खेळीला दोन चौकार आणि आठ षटकारांचा साज चढवला.  टीम इंडिया अव्वल स्थानावर -  न्यूझीलंडचा पराभव करत भारतीय संघाने गुणातलिकेत पहिल्या स्थानावर झेप घेतली आहे. यंदाच्या विश्वचषकात टीम इंडिया आतापर्यंत अजय आहे. भारताने पाच सामन्यात पाच विजय मिळवले आहेत. किवी तिसऱ्या क्रमांकावर आहेत. न्यूझीलंडने पाच सामन्यात चार विजय मिळवले आहेत.   पाकिस्तान-ऑस्ट्रेलियाची स्थिती काय ? अफगाणिस्तानकडून पाकिस्तानचा लाजीरवाण्या पराभवाचा सामना करावा लागला. या पराभवामुळे पाकिस्तान संघाचे विश्वचषकातील आव्हान अधिक खडतर झाले आहे.  पाकिस्तानन संघ गुणातातिलेत सध्या पाचव्या क्रमांकावर आहे, पण पाकिस्तानला पाच सामन्यात तीन पराभवाचा सामना करावा लागला. त्यांचा रनरेटही मोठ्या प्रमाणात घसरला आहे. अफगाणिस्तानकडून पराभूत झाल्यामुळे विश्वचषकातील आव्हान अधिक खडतर झाले आहे. विश्वचषकातील आव्हान जिवंत ठेवण्यासाठी पाकिस्तानला उर्वरित सर्व सामन्यात विजय मिळवावा लागेल.  ऑस्ट्रेलियाचा संघ चौथ्या स्थानावर आहे. पाकिस्तान, अफगाणिस्तानसह ऑस्ट्रेलियाचेही  चार गुण झाले आहेत. पण सरस रनरेटमुळे ऑस्ट्रेलिया चौथ्या क्रमांकावर आहे. तर पाकिस्तान पाचव्या स्थानी आहे. तळाच्या संघाची स्थिती काय ?  बांगलादेशचा संघ दहाव्या स्थानावर घसरला आहे. याआधी तो सातव्या स्थानी होता. तर अफगाणिस्तानचा संघ सहाव्या स्थानावर पोहचला आहे. अफागणिस्तान संघाने पाच सामन्यात दोन विजय मिळवलेत. नेदरलँडचा संघ सातव्या क्रमांकावर विराजमान आहे. श्रीलंका संघ एका विजयासह आठव्या स्थानावर आहे. गतविजेता इंग्लंड संघ नवव्या क्रमांकावर आहे. इंग्लंडला चार सामन्यात तीन पराभवाचा सामना करावा लागलाय.   ","content":"World Cup 2023 Points Table : दक्षिण आफ्रिकेने विश्वचषकातील चौथ्या विजयाची नोंद केली. या विजयासह दक्षिण आफ्रिकेने उपांत्य फेरीकडे वाटचाल केली आहे. दक्षिण आफ्रिकेने पाच सामन्यात चार विजय मिळवत आठ गुणांची कमाई केली. चौथ्या विजयासह दक्षिण आफ्रिकेने दुसऱ्या क्रमांकावर झेप घेतली. न्यूझीलंडचा संघ तिसऱ्या क्रमांकावर घसरला आहे. या सामन्याआधी दक्षिण आफ्रिका तिसऱ्या तर न्यूझीलंड दुसऱ्या क्रमांकावर होता. बांगलादेशचा 149 धावांनी दारुण पराभव केल्यामुळे दक्षिण आफ्रिकेचा रनरेटही सुधारला आहे. आफ्रिकेच्या विराट विजयानंतर गुणतालिकेत मोठा फेरबदल झालाय. आजच्या सामन्यात काय झालं ? दक्षिण आफ्रिकेनं बांगलादेशचा 149 धावांनी धुव्वा उडवून, विश्वचषकाच्या मोहिमेत चौथा विजय साजरा केला. दक्षिण आफ्रिकेनं पाचपैकी चार सामने जिंकून आठ गुणांची कमाई केली असून, विश्वचषकाच्या गुणतालिकेत दक्षिण आफ्रिका दुसऱ्या स्थानावर आहे. मुंबई तल्या सामन्यात दक्षिण आफ्रिकेनं बांगलादेशला विजयासाठी 383 धावांचं आव्हान दिलं होतं. त्या आव्हानाचा पाठलाग करताना बांगलादेशचा अख्खा डाव 47 व्या षटकांत 233 धावांत आटोपला. या सामन्यात क्विन्टॉन डी कॉकनं 174 धावांची खेळी करून दक्षिण आफ्रिकेच्या डावाचा पाया घातला. त्यानं 140 चेंडूंमधली ही खेळी 15 चौकार आणि सात षटकारांनी सजवली. डी कॉकनं एडन मारक्रमच्या साथीनं तिसऱ्या विकेटसाठी 131 धावांची, तर हेन्ऱिक क्लासेनच्या साथीनं चौथ्या विकेटसाठी 142 धावांची भागीदारी केली. मारक्रमनं 69 चेंडूंत 60 धावांची आणि क्लासेननं 49 चेंडूंमध्ये 90 धावांची खेळी उभारली. क्लासेननं 90 धावांच्या खेळीला दोन चौकार आणि आठ षटकारांचा साज चढवला. टीम इंडिया अव्वल स्थानावर - googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); न्यूझीलंडचा पराभव करत भारतीय संघाने गुणातलिकेत पहिल्या स्थानावर झेप घेतली आहे. यंदाच्या विश्वचषकात टीम इंडिया आतापर्यंत अजय आहे. भारताने पाच सामन्यात पाच विजय मिळवले आहेत. किवी तिसऱ्या क्रमांकावर आहेत. न्यूझीलंडने पाच सामन्यात चार विजय मिळवले आहेत. पाकिस्तान-ऑस्ट्रेलियाची स्थिती काय ? अफगाणिस्तानकडून पाकिस्तानचा लाजीरवाण्या पराभवाचा सामना करावा लागला. या पराभवामुळे पाकिस्तान संघाचे विश्वचषकातील आव्हान अधिक खडतर झाले आहे. पाकिस्तानन संघ गुणातातिलेत सध्या पाचव्या क्रमांकावर आहे, पण पाकिस्तानला पाच सामन्यात तीन पराभवाचा सामना करावा लागला. त्यांचा रनरेटही मोठ्या प्रमाणात घसरला आहे. अफगाणिस्तानकडून पराभूत झाल्यामुळे विश्वचषकातील आव्हान अधिक खडतर झाले आहे. विश्वचषकातील आव्हान जिवंत ठेवण्यासाठी पाकिस्तानला उर्वरित सर्व सामन्यात विजय मिळवावा लागेल. ऑस्ट्रेलियाचा संघ चौथ्या स्थानावर आहे. पाकिस्तान, अफगाणिस्तानसह ऑस्ट्रेलियाचेही चार गुण झाले आहेत. पण सरस रनरेटमुळे ऑस्ट्रेलिया चौथ्या क्रमांकावर आहे. तर पाकिस्तान पाचव्या स्थानी आहे. तळाच्या संघाची स्थिती काय ? बांगलादेशचा संघ दहाव्या स्थानावर घसरला आहे. याआधी तो सातव्या स्थानी होता. तर अफगाणिस्तानचा संघ सहाव्या स्थानावर पोहचला आहे. अफागणिस्तान संघाने पाच सामन्यात दोन विजय मिळवलेत. नेदरलँडचा संघ सातव्या क्रमांकावर विराजमान आहे. श्रीलंका संघ एका विजयासह आठव्या स्थानावर आहे. गतविजेता इंग्लंड संघ नवव्या क्रमांकावर आहे. इंग्लंडला चार सामन्यात तीन पराभवाचा सामना करावा लागलाय.","pubDate":"2023-10-24 17:48:39","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/10/24/d1a1b55d935567a84ad5086c578b4fb51698168590855625_original.jpg","source_id":"abplive","source_priority":10959,"country":["india"],"category":["sports"],"language":"marathi"},{"article_id":"841aa25356a80ba8ed24f24abb267428","title":"SA vs BAN Match Report : आफ्रिकेची विजयी घौडदौड सुरुच, बांगलादेशचा 149 धावांनी धुव्वा","link":"https://marathi.abplive.com/sports/cricket/south-africa-beat-bangladesh-sa-vs-ban-match-report-world-cup-2023-sports-news-1222121","keywords":["क्रिकेट"],"creator":["एबीपी माझा स्पोर्ट्स डेस्क"],"video_url":null,"description":"SA vs BAN Match Report : दक्षिण आफ्रिका संघाची विश्वचषकातील घौडदौड सुरुच आहे. दक्षिण आफ्रिकेने आज बांगलादेशचा 149 धावांच्या अंतराने मोठा पराभव केला. 383 धावांचा पाठलाग करताना बांगलादेशचा संघ 46.4 षटकात 233 धावांपर्यंत मजल मारु शकला. दक्षिण आफ्रिकेने विश्वचषकातील चौथ्या विजयाची नोंद केली. या विजयासह दक्षिण आफ्रिकेने उपांत्य फेरीकडे वाटचाल केली आहे. दक्षिण आफ्रिकेने पाच सामन्यात चार विजय मिळवत आठ गुणांची कमाई केली. चौथ्या विजयासह दक्षिण आफ्रिकेने दुसऱ्या क्रमांकावर झेप घेतली. न्यूझीलंडचा संघ तिसऱ्या क्रमांकावर घसरला आहे. या सामन्याआधी दक्षिण आफ्रिका तिसऱ्या तर न्यूझीलंड दुसऱ्या क्रमांकावर होता. बांगलादेशचा 149 धावांनी दारुण पराभव केल्यामुळे दक्षिण आफ्रिकेचा रनरेटही सुधारला आहे. आफ्रिकेच्या विराट विजयानंतर गुणतालिकेत मोठा फेरबदल झालाय.  दक्षिण आफ्रिकेनं बांगलादेशचा 149 धावांनी धुव्वा उडवून, विश्वचषकाच्या मोहिमेत चौथा विजय साजरा केला. दक्षिण आफ्रिकेनं पाचपैकी चार सामने जिंकून आठ गुणांची कमाई केली असून, विश्वचषकाच्या गुणतालिकेत दक्षिण आफ्रिका दुसऱ्या स्थानावर आहे. मुंबईतल्या सामन्यात दक्षिण आफ्रिकेनं बांगलादेशला विजयासाठी 383 धावांचं आव्हान दिलं होतं. त्या आव्हानाचा पाठलाग करताना बांगलादेशचा अख्खा डाव 47 व्या षटकांत 233 धावांत आटोपला. या सामन्यात क्विन्टॉन डी कॉकनं 174 धावांची खेळी करून दक्षिण आफ्रिकेच्या डावाचा पाया घातला. त्यानं 140 चेंडूंमधली ही खेळी 15 चौकार आणि सात षटकारांनी सजवली. डी कॉकनं एडन मारक्रमच्या साथीनं तिसऱ्या विकेटसाठी 131 धावांची, तर हेन्ऱिक क्लासेनच्या साथीनं चौथ्या विकेटसाठी १४२ धावांची भागीदारी केली. मारक्रमनं 69 चेंडूंत 60 धावांची आणि क्लासेननं 49 चेंडूंमध्ये 90 धावांची खेळी उभारली. क्लासेननं 90 धावांच्या खेळीला दोन चौकार आणि आठ षटकारांचा साज चढवला. महमदुल्लाहची एकाकी झुंज, आफ्रिकन तोफेचा केला समर्थपणे सामना -  383 धावांचा पाठलाग करताना बांगलादेशची सुरुवात अतिशय दैयनिय झाली. पण अनुभवी महमदुल्लाह याने एकाकी झुंज दिली. महमदुल्लाह  याने 111 धावांची झंझावती शतकी खेळी केली. त्याने आपल्या डावात चार षटकार आणि 11 चौकार लगावले. महमदुल्लाह याचा अपवाद वगळता एकाही फलंदाजाला मोठी खेळी करता आली नाही. त्यामुळे शाकिब अल हसनच्या बांगलादेशला मोठ्या पराभवाचा सामना करावा लागला.  बांगलादेशसाठी तंजीद हसन याने 17 चेंडूत 22 धावा केल्या. तर लिटन दास याने 44 चेंडूत 22 धावांचे योगदान दिलेय.  नजमुल हौसेन शांतो, शाकिब अल हसन, मुस्ताफिजुर रहमान, मेंहदी हसन मिराज आणि नसुम अहमद यांनी अनुक्रमे 0, 1, 8, 11 आणि 19 धावा केल्या. या फलंदाजांना मोठी खेळी करता आली नाही. बांगलादेशचे आठ फलंदाज 159 धावांत तंबूत परतले होते. पण महमदुल्लाह  याने एकाकी झुंज दिली. बांगलादेशचा संघ 233 धावांपर्यंत पोहचवला.   दक्षिण आफ्रिकेच्या गोलंदाजाची कामगिरी कशी राहिली ? दक्षिण आफ्रिकेच्या गोलंदाजांनी भेदक मारा केला. गेराल्ड कौटजी सर्वात यशस्वी गोलंदाज ठरला.  गेराल्ड कौटजी याने 10 षटकात 62 धावांच्या मोबदल्यात तीन विकेट घेतल्या. त्याशिवाय मार्को यॉन्सेन, लिडाज विलियम्स, आणि कगिसो रबाडा यांनी प्रत्येकी दोन दोन विकेट घेतल्या. केशव महाराज याने एक विकेट घेतली. ","content":"SA vs BAN Match Report : दक्षिण आफ्रिका संघाची विश्वचषकातील घौडदौड सुरुच आहे. दक्षिण आफ्रिकेने आज बांगलादेशचा 149 धावांच्या अंतराने मोठा पराभव केला. 383 धावांचा पाठलाग करताना बांगलादेशचा संघ 46.4 षटकात 233 धावांपर्यंत मजल मारु शकला. दक्षिण आफ्रिकेने विश्वचषकातील चौथ्या विजयाची नोंद केली. या विजयासह दक्षिण आफ्रिकेने उपांत्य फेरीकडे वाटचाल केली आहे. दक्षिण आफ्रिकेने पाच सामन्यात चार विजय मिळवत आठ गुणांची कमाई केली. चौथ्या विजयासह दक्षिण आफ्रिकेने दुसऱ्या क्रमांकावर झेप घेतली. न्यूझीलंडचा संघ तिसऱ्या क्रमांकावर घसरला आहे. या सामन्याआधी दक्षिण आफ्रिका तिसऱ्या तर न्यूझीलंड दुसऱ्या क्रमांकावर होता. बांगलादेशचा 149 धावांनी दारुण पराभव केल्यामुळे दक्षिण आफ्रिकेचा रनरेटही सुधारला आहे. आफ्रिकेच्या विराट विजयानंतर गुणतालिकेत मोठा फेरबदल झालाय. दक्षिण आफ्रिकेनं बांगलादेशचा 149 धावांनी धुव्वा उडवून, विश्वचषकाच्या मोहिमेत चौथा विजय साजरा केला. दक्षिण आफ्रिकेनं पाचपैकी चार सामने जिंकून आठ गुणांची कमाई केली असून, विश्वचषकाच्या गुणतालिकेत दक्षिण आफ्रिका दुसऱ्या स्थानावर आहे. मुंबई तल्या सामन्यात दक्षिण आफ्रिकेनं बांगलादेशला विजयासाठी 383 धावांचं आव्हान दिलं होतं. त्या आव्हानाचा पाठलाग करताना बांगलादेशचा अख्खा डाव 47 व्या षटकांत 233 धावांत आटोपला. या सामन्यात क्विन्टॉन डी कॉकनं 174 धावांची खेळी करून दक्षिण आफ्रिकेच्या डावाचा पाया घातला. त्यानं 140 चेंडूंमधली ही खेळी 15 चौकार आणि सात षटकारांनी सजवली. डी कॉकनं एडन मारक्रमच्या साथीनं तिसऱ्या विकेटसाठी 131 धावांची, तर हेन्ऱिक क्लासेनच्या साथीनं चौथ्या विकेटसाठी १४२ धावांची भागीदारी केली. मारक्रमनं 69 चेंडूंत 60 धावांची आणि क्लासेननं 49 चेंडूंमध्ये 90 धावांची खेळी उभारली. क्लासेननं 90 धावांच्या खेळीला दोन चौकार आणि आठ षटकारांचा साज चढवला. महमदुल्लाहची एकाकी झुंज, आफ्रिकन तोफेचा केला समर्थपणे सामना - 383 धावांचा पाठलाग करताना बांगलादेशची सुरुवात अतिशय दैयनिय झाली. पण अनुभवी महमदुल्लाह याने एकाकी झुंज दिली. महमदुल्लाह याने 111 धावांची झंझावती शतकी खेळी केली. त्याने आपल्या डावात चार षटकार आणि 11 चौकार लगावले. महमदुल्लाह याचा अपवाद वगळता एकाही फलंदाजाला मोठी खेळी करता आली नाही. त्यामुळे शाकिब अल हसनच्या बांगलादेशला मोठ्या पराभवाचा सामना करावा लागला. बांगलादेशसाठी तंजीद हसन याने 17 चेंडूत 22 धावा केल्या. तर लिटन दास याने 44 चेंडूत 22 धावांचे योगदान दिलेय. googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); नजमुल हौसेन शांतो, शाकिब अल हसन, मुस्ताफिजुर रहमान, मेंहदी हसन मिराज आणि नसुम अहमद यांनी अनुक्रमे 0, 1, 8, 11 आणि 19 धावा केल्या. या फलंदाजांना मोठी खेळी करता आली नाही. बांगलादेशचे आठ फलंदाज 159 धावांत तंबूत परतले होते. पण महमदुल्लाह याने एकाकी झुंज दिली. बांगलादेशचा संघ 233 धावांपर्यंत पोहचवला. दक्षिण आफ्रिकेच्या गोलंदाजाची कामगिरी कशी राहिली ? दक्षिण आफ्रिकेच्या गोलंदाजांनी भेदक मारा केला. गेराल्ड कौटजी सर्वात यशस्वी गोलंदाज ठरला. गेराल्ड कौटजी याने 10 षटकात 62 धावांच्या मोबदल्यात तीन विकेट घेतल्या. त्याशिवाय मार्को यॉन्सेन, लिडाज विलियम्स, आणि कगिसो रबाडा यांनी प्रत्येकी दोन दोन विकेट घेतल्या. केशव महाराज याने एक विकेट घेतली.","pubDate":"2023-10-24 17:38:16","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/10/24/0f141fd118c1810f667feec751604dda169816736956176_original.jpg","source_id":"abplive","source_priority":10959,"country":["india"],"category":["sports"],"language":"marathi"},{"article_id":"9b129a07be81184f8c04bac550458006","title":"SA vs BAN HIGHLIGHTS, World Cup 2023: Quinton De Kock's 174 Sets Up Proteas Massive Win Over Bangladesh","link":"https://news.abplive.com/sports/cricket/sa-vs-ban-highlights-south-africa-beat-bangladesh-by-149-runs-wankhede-stadium-mumbai-icc-cricket-world-cup-2023-1638095","keywords":["Cricket"],"creator":["ABP News Bureau"],"video_url":null,"description":"SA vs BAN, World Cup 2023: South Africa beat Bangladesh by 149 runs in match number 23 of the ICC Men's Cricket World Cup 2023 at the Wankhede Stadium in Mumbai on Tuesday (October 24). The Proteas won the toss and elected to bat first on a flat Mumbai wicket. Quinton de Kock was the star with the bat for South Africa as he slammed his third hundred of this World Cup, making a dominant 174 off 140 deliveries taking them to a strong total of 382/5. In response, Bangladesh never really got going and were bowled out for 233 despite Mahmudullah's 111 off 111 balls.Other than De Kock's 174, Heinrich Klaasen too continued his superb form in the tournament and scored 90 off just 49 balls with some breathtaking strokes during the innings. Aiden Markram, South Africa's stand-in skipper, also scored a half-century making 60 off 69 balls. For Bangladesh, Hasan Mahmud was the pick of the bowlers with figures of 2 for 67. Shakib Al Hasan, Shoriful Islam and Mehidy Hasan Miraz picked up a wicket each.After their dominating performance with the bat, they were clinical with the ball in hand too with Gerald Coetzee emerging as the highest wicket-taker for the team, finishing with 3 for 62. Marco Jansen, Lizaad Williams and Kagiso Rabada scalped two wickets apiece while Keshav Maharaj was also impressive picking 1 for 32 off his 10 overs. It could have been an even more handsome victory for the Proteas who move to the second position on the table with 8 points from 5 matches and a net run rate of +2.370 had it not been for the 68-run stand between Mahmudullah and Mustafizur Rahaman, a partnership which ensured that Mahmudullah get to his century and the Bangla Tigers reduce the deficit of their margin.After the match, De Kock was adjudged the Player of the Match who described the experience as being more tiring than satisfactory. All three of his World Cup tons have come in this edition and in a format from which he has already announced retirement at the end of this campaign.","content":"googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); SA vs BAN, World Cup 2023: South Africa beat Bangladesh by 149 runs in match number 23 of the ICC Men's Cricket World Cup 2023 at the Wankhede Stadium in Mumbai on Tuesday (October 24). The Proteas won the toss and elected to bat first on a flat Mumbai wicket. Quinton de Kock was the star with the bat for South Africa as he slammed his third hundred of this World Cup, making a dominant 174 off 140 deliveries taking them to a strong total of 382/5. In response, Bangladesh never really got going and were bowled out for 233 despite Mahmudullah's 111 off 111 balls. Other than De Kock's 174, Heinrich Klaasen too continued his superb form in the tournament and scored 90 off just 49 balls with some breathtaking strokes during the innings. Aiden Markram, South Africa's stand-in skipper, also scored a half-century making 60 off 69 balls. For Bangladesh, Hasan Mahmud was the pick of the bowlers with figures of 2 for 67. Shakib Al Hasan, Shoriful Islam and Mehidy Hasan Miraz picked up a wicket each. After their dominating performance with the bat, they were clinical with the ball in hand too with Gerald Coetzee emerging as the highest wicket-taker for the team, finishing with 3 for 62. Marco Jansen, Lizaad Williams and Kagiso Rabada scalped two wickets apiece while Keshav Maharaj was also impressive picking 1 for 32 off his 10 overs. It could have been an even more handsome victory for the Proteas who move to the second position on the table with 8 points from 5 matches and a net run rate of +2.370 had it not been for the 68-run stand between Mahmudullah and Mustafizur Rahaman, a partnership which ensured that Mahmudullah get to his century and the Bangla Tigers reduce the deficit of their margin. After the match, De Kock was adjudged the Player of the Match who described the experience as being more tiring than satisfactory. All three of his World Cup tons have come in this edition and in a format from which he has already announced retirement at the end of this campaign.","pubDate":"2023-10-24 17:31:23","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/10/24/d1a1b55d935567a84ad5086c578b4fb51698168590855625_original.jpg","source_id":"abplive","source_priority":10959,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"8024783c231dee783675d5330602e987","title":"World Cup 2023, SA vs BAN: విజయాల బాట పట్టిన సౌతాఫ్రికా, బంగ్లాదేశ్‌పై 149 పరుగుల భారీ తేడాతో దక్షిణాఫ్రికా విజయం..","link":"https://telugu.latestly.com/sports/cricket/world-cup-2023-sa-vs-ban-south-africa-who-are-on-a-winning-streak-beat-bangladesh-by-a-huge-margin-of-149-runs-112923.html","keywords":null,"creator":null,"video_url":null,"description":"నెదర్లాండ్స్‌పై ఓటమి తర్వాత కసితో సౌతాఫ్రికా జట్టు మరోసారి విజయాల బాట పట్టింది. బంగ్లాదేశ్‌తో జరిగిన 5వ మ్యాచ్‌లో దక్షిణాఫ్రికా 149 పరుగుల భారీ తేడాతో విజయం సాధించింది.","content":"నెదర్లాండ్స్‌పై ఓటమి తర్వాత కసితో సౌతాఫ్రికా జట్టు మరోసారి విజయాల బాట పట్టింది. బంగ్లాదేశ్‌తో జరిగిన 5వ మ్యాచ్‌లో దక్షిణాఫ్రికా 149 పరుగుల భారీ తేడాతో విజయం సాధించింది. బంగ్లాదేశ్‌తో జరిగిన మ్యాచ్‌లో దక్షిణాఫ్రికా కెప్టెన్ టెంబా బావుమా టాస్ గెలిచి ముందుగా బ్యాటింగ్ ఎంచుకున్నాడు. ఫామ్‌లో ఉన్న క్వింటన్ డి కాక్ క్రీజులో స్థిరపడి 140 బంతుల్లో 7 ఫోర్లు, 15 ఫోర్ల సాయంతో 174 పరుగులతో అద్భుత ఇన్నింగ్స్ ఆడాడు. ఈ సెంచరీ తర్వాత, డి కాక్ ప్రపంచ కప్ 2023లో టాప్ స్కోరర్‌గా అవతరించడం మాత్రమే కాకుండా అనేక రికార్డులను బద్దలు కొట్టాడు. హెన్రిచ్ క్లాసెన్ తన క్లాస్‌ని ప్రదర్శించి.8 సిక్సర్లు బాది. కేవలం 49 బంతుల్లోనే 90 పరుగులు చేసి జట్టు స్కోరును పెంచాడు. ఈ ఇన్నింగ్స్‌ల కారణంగా ఆ జట్టు బంగ్లాదేశ్‌కు 383 పరుగుల భారీ లక్ష్యాన్ని నిర్దేశించింది. మెరుపు బ్యాటింగ్ అనంతరం దక్షిణాఫ్రికా బౌలర్లు సైతం బంగ్లాదేశ్ పై సింహాల్లా విరుచుకుపడ్డారు. 100 పరుగుల వ్యవధిలో బంగ్లాదేశ్ జట్టులో సగం మందిని బౌలర్లు పెవిలియన్‌కు పంపారు. అయితే జట్టు తరఫున మహ్మదుల్లా అద్భుత సెంచరీ చేసినా, జట్టును విజయపథంలో నడిపించడంలో సఫలం కాలేదు. సౌతాఫ్రికా జట్టులో గెరాల్డ్ అత్యధికంగా 3 వికెట్లు పడగొట్టాడు. Quinton de Kock, 174 ⭐ Mahmudullah, 111 🫡 A defiant century wasn’t enough to save Bangladesh after another display of South African power hitting 💪 Read the full report 📝⬇️ #SAvBAN #CWC23 https://t.co/qQX9k7IfxL — ICC Cricket World Cup (@cricketworldcup) October 24, 2023 ఈ భారీ విజయం తర్వాత దక్షిణాఫ్రికా జట్టు ప్రపంచకప్ పాయింట్ల పట్టికలో న్యూజిలాండ్‌ను దాటేసింది. కివీస్ జట్టు నిరంతరం విజయాలు సాధిస్తున్నప్పటికీ 5వ మ్యాచ్‌లో భారత్ చేతిలో ఓటమి చవిచూడాల్సి వచ్చింది. ఇప్పుడు దక్షిణాఫ్రికా 4 విజయాలతో భారత్ తర్వాత రెండో స్థానంలో నిలిచింది. Vastu Tips: వాస్తు ప్రకారం ఇంటికి ఎన్ని ద్వారాలు ఉండాలి","pubDate":"2023-10-24 19:28:24","image_url":null,"source_id":"latestly","source_priority":5523,"country":["india"],"category":["sports"],"language":"telugu"},{"article_id":"5c3dca5a4c355752c38c400c183eb284","title":"Afghanistan making waves at Cricket World Cup while England is barely hanging on","link":"https://torontosun.com/sports/other-sports/afghanistan-making-waves-at-world-cup","keywords":["Other Sports","Sports"],"creator":["Norm Da Costa"],"video_url":null,"description":null,"content":"A country in constant turmoil. That’s the only way the world sees Afghanistan. But in the past 10 days, Afghanistan has been synonymous with cricket and giant-killing. First, it turned the tables on England — a country that not only introduced the game to the world, but also to Afghanistan in the 1830s. After England, it was the turn of their neighbours Pakistan to feel the bite of the scorpion. Many of the Afghanis got hooked on their love of the game in Pakistani refugee camps during the decades of war when the Russians ran roughshod over the country. Now little-known Afghanistan has taken the World Cup being played in India by the scruff of its neck and given it a violent shake, and two recipients of the Afghani insurrection have been England and Pakistan. Following the loss to the Afghanis, defending champion England is hanging on by a thread and mighty Pakistan, after starting with two straight wins, finds itself in the same position as the tournament reaches the halfway mark. The only team at this stage with an unbeaten record at 5-0 is Rohit Sharma’s India following an exciting victory over New Zealand, at the time the only other unbeaten team in the competition. Prior to this clash of the two squads with a clean sheet, India had not been able to defeat the Kiwis since 2005. But on this occasion, a brilliant knock of 95 by Virat Kohli and a five-wicket haul by paceman Mohammed Shami ended the streak. On a wild weekend just after the Afghanis stunned England, it was the turn of South Africa to obliterate England and take a step toward the semifinals. The Proteas trounced England by a whopping 229 runs at the heat dome known as Mumbai’s Wankhede Stadium, where the needle hit 37C with the humidity at around 46%. But England could not stand the heat after South Africa posted 399 for seven and were then dismissed for a woeful 170 in 22 overs. The champions can still qualify for the semifinals, but likely will have to win all five of their remaining group matches. The chances of that happening are as rare as Toronto being spared of snow this winter. The highlight of South Africa’s innings was Heinrich Klaasen smashing a 61-ball hundred and Marco Jansen 75 from 42 balls. Klassen was gasping for breath during his epic century with sweat dripping from his cap. Having been fried in the field, England’s batsmen had no answer to the Proteas attack in which new fast bowler Gerald Coetzee excelled with three for 35. England stumbled from 68 for six to 100 for eight and some wild hitting by Mark Wood (43 not out) and Gus Atkinson (35) with nothing to lose laid the lumber. England’s wobbly campaign continues against Sri Lanka on Thursday before facing India and Australia. Meanwhile, South Africa, with the most powerful batting lineup in the World Cup, posted 382 for five against Bangladesh on Tuesday with opener Quinton de Kock hitting a massive 174 that was laced with 15 fours and seven sixes. Other big scorers were Klassen, who made 90, and Aiden Markham 60. Bangladesh’s Mohammad Mahmudullah then stroked a brilliant 111 in a losing cause as it folded for 233 to go down by a massive 149 runs. South Africa has now emerged as a big threat to India. Meanwhile, Afghanistan defeated Pakistan for the first time in an ODI by eight wickets by pulling off its highest successful chase in this thriller in Chennai. Pakistan posted 282 for seven and this looked like a solid total but the Afghans hit back with 286 for two with an over to spare. For the Afghans, Ibrahim Zadran made 87, Rahmanullah Gurbaz smacked 65 and Rahmat Shah struck 77 not out as Afghanistan moved up to sixth in the standings while England dropped to last in the table. While Afghanistan has two of the best spinners in the world, it was teenage wrister Noor Ahmad who starred with three for 49. There was joy across Afghanistan following these two victories. “You know the situation in Afghanistan, it’s very depressing,” 25-year-old Abdul Wahab, who manages a Kabul medical centre, told a news agency. “The only excuse to forget everything is cricket.” Australia may be forgotten, but don’t ever rule them out for mounting a late challenge. The Aussies, who have a 2-2 record, plundered Pakistan’s attack for 367 for nine in Bengaluru and then restricted Pakistan for 305 thanks to spinner Adam Zampa’s four for 53. Aussie openers David Warner and Mitchell Marsh burst into life with centuries to put on 259 for the first wicket. Warner made 163 off 124 balls and Marsh clobbered 121 off 108 deliveries with Shaheen Afridi the pick of the Pakistani bowlers with five for 54. Former India captain Bishan Singh Bedi, who was known for being part of a famous spin quartet, has died at the age of 77, the Board of Control for Cricket in India (BCCI) announced. Bedi, leg spinner Bhagwat Chandrasekhar and off-spinners Srinivas Venkataraghavan and Erapalli Prasanna were regarded the country’s most potent bowling force in the 1960s and ’70s. Check out our sports section for the latest news and analysis.","pubDate":"2023-10-24 18:28:13","image_url":"https://smartcdn.gprod.postmedia.digital/torontosun/wp-content/uploads/2023/10/1025cricket-afghanistan-scaled-e1698171119903.jpg?quality=100&strip=all","source_id":"torontosun","source_priority":12198,"country":["canada"],"category":["sports"],"language":"english"},{"article_id":"15cd66399fccd682e4b0c00618506ba7","title":"दक्षिण आफ्रिकेनं बांगलादेशचा 149 धावांनी उडवला धुव्वा","link":"https://marathi.abplive.com/photo-gallery/sports/cricket-south-africa-vs-bangladesh-highlights-world-cup-2023-mahmudullah-smacks-ton-but-sa-wrap-up-149-run-win-at-wankhede-1222131","keywords":["क्रिकेट"],"creator":["पीटीआय वृत्तसंस्था"],"video_url":null,"description":"दक्षिण आफ्रिकेनं बांगलादेशचा 149 धावांनी उडवला धुव्वा","content":"दक्षिण आफ्रिकेनं बांगलादेशचा 149 धावांनी धुव्वा उडवून, विश्वचषकाच्या मोहिमेत चौथा विजय साजरा केला. दक्षिण आफ्रिकेनं पाचपैकी चार सामने जिंकून आठ गुणांची कमाई केली असून, विश्वचषकाच्या गुणतालिकेत दक्षिण आफ्रिका दुसऱ्या स्थानावर आहे. मुंबईतल्या सामन्यात दक्षिण आफ्रिकेनं बांगलादेशला विजयासाठी 383 धावांचं आव्हान दिलं होतं. त्या आव्हानाचा पाठलाग करताना बांगलादेशचा अख्खा डाव 47 व्या षटकांत 233 धावांत आटोपला. या सामन्यात क्विन्टॉन डी कॉकनं 174 धावांची खेळी करून दक्षिण आफ्रिकेच्या डावाचा पाया घातला. क्विन्टॉन डी कॉकनं 174 धावांची खेळी करून दक्षिण आफ्रिकेच्या डावाचा पाया घातला. त्यानं 140 चेंडूंमधली ही खेळी 15 चौकार आणि सात षटकारांनी सजवली. डी कॉकनं एडन मारक्रमच्या साथीनं तिसऱ्या विकेटसाठी 131 धावांची, तर हेन्ऱिक क्लासेनच्या साथीनं चौथ्या विकेटसाठी 142 धावांची भागीदारी केली. मारक्रमनं 69 चेंडूंत 60 धावांची आणि क्लासेननं 49 चेंडूंमध्ये 90 धावांची खेळी उभारली. क्लासेननं 90 धावांच्या खेळीला दोन चौकार आणि आठ षटकारांचा साज चढवला. दक्षिण आफ्रिकेने विश्वचषकातील चौथ्या विजयाची नोंद केली. या विजयासह दक्षिण आफ्रिकेने उपांत्य फेरीकडे वाटचाल केली आहे. दक्षिण आफ्रिकेने पाच सामन्यात चार विजय मिळवत आठ गुणांची कमाई केली. चौथ्या विजयासह दक्षिण आफ्रिकेने दुसऱ्या क्रमांकावर झेप घेतली. न्यूझीलंडचा संघ तिसऱ्या क्रमांकावर घसरला आहे. या सामन्याआधी दक्षिण आफ्रिका तिसऱ्या तर न्यूझीलंड दुसऱ्या क्रमांकावर होता. बांगलादेशचा 149 धावांनी दारुण पराभव केल्यामुळे दक्षिण आफ्रिकेचा रनरेटही सुधारला आहे. आफ्रिकेच्या विराट विजयानंतर गुणतालिकेत मोठा फेरबदल झालाय. Points Table : आफ्रिकेची दुसऱ्या स्थानावर झेप, बांगलादेशचा पराभव झाल्यानंतर गुणतालिकेत मोठा बदल","pubDate":"2023-10-24 18:12:36","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/10/24/d158e7431fc89145a99cd51154420d6e169816975458478_original.jpg","source_id":"abplive","source_priority":10959,"country":["india"],"category":["sports"],"language":"marathi"},{"article_id":"0e8c99c264a479fddf4b247c6f81fc0c","title":"Man United vs Copenhagen - Champions League LIVE: Red Devils to pay tribute at first home game since Sir Bobby Charlton's passing","link":"https://www.dailymail.co.uk/sport/live/article-12665549/Man-United-vs-Copenhagen-Champions-League-2023-24-Latest-Result.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Follow Mail Sport's live blog for all the latest updates from Old Trafford as Manchester United host Copenhagen in the Champions League.","content":"LIVE Man United vs Copenhagen - Champions League LIVE: Red Devils to pay tribute at first home game since Sir Bobby Charlton's passing By Samuel Draper For Mailonline Published: 18:30, 24 October 2023 | Updated: 19:43, 24 October 2023 e-mail 12 View comments Follow Mail Sport's live blog for all the latest updates from Old Trafford as Manchester United host Copenhagen in the Champions League . 18:35 Ian Herbert: Man City fans should respect Sir Bobby The focus is naturally on the Champions League tonight - but it's inevitable that there will always be one eye on the Manchester derby this Sunday. Mail Sport's Ian Herbert calls on Man City fans to respect what Sir Bobby Charlton did to put Manchester on the map, despite the rivalry of the two clubs. IAN HERBERT: Is it beyond City fans to respect Sir Bobby? IAN HERBERT: It's perhaps inevitable that Manchester City are barely represented in the sea of flowers presently laid at the front of Old Trafford. Mail Online 18:29 Bayern have moved 3-1 up in the other group game About three minutes to go in Turkey, plus stoppages, but it looks like Bayern will make it three wins from three in Group A. Galatasaray have four points, and Copenhagen have one. The pressure is on Man United now. 18:28 Can Erik ten Hag do the job on the pitch? It feels like there's a new off the field situation for Man United to navigate every few days, but can Erik ten Hag focus on the job required on the pitch and get their Champions League campaign going? 18:25 A special occasion for Man United's Dane Rasmus Hojlund used to play for Copenhagen, before moving across Europe to further his career, and now they're coming to Old Trafford. 18:09 Background on Copenhagen Copenhagen began their group stage with a 2-2 draw in Turkey on Matchday 1, but lost 2-1 at home to Bayern Munich three weeks ago. Since the Bayern game, they have drawn 1-1 at AGF, and then won 2-1 at home to Vejle BK in the league on Saturday. 18:06 Man United vs Copenhagen in the past This is the fourth meeting between the two teams. They shared one win each in the 2006-7 Champions League group stage, which was Copenhagen's first ever win in the competition. Man United got the better of the Danes in the UEFA Europa League quarter-final in August 2020. They'll be desperate to get a third win on the board tonight, and get their first points of the group stage this year. 18:02 An hour to go There'll be club tributes to Sir Bobby Charlton in the run up to kick-off. 17:59 Copenhagen team news Copenhagen have also confirmed their starting 11 for the match tonight, led by captain Viktor Claesson. Rasmus Hojlund's younger brother Oscar is named among the substitutes for the Danish Superliga champions. 17:56 How to follow the rest of the Champions League action tonight It's not just Man United in action tonight - Spencer Morgan is on blog duties for Arsenal's trip to Sevilla, as well as the other games going on tonight across the Champions League. In Man United's group, Galatasaray and Bayern are currently drawing 1-1, but I'll keep you updated if that score changes. They've just started the second half in Turkey. Sevilla vs Arsenal - Champions League: Latest scores updates Follow Mail Sport's live blog for all the latest updates from Ramon Sanchez-Pizjuan Stadium as Sevilla host Arsenal in the Champions League . Mail Online 17:48 Man United team news - two changes for Erik ten Hag's side Following Saturday night's 2-1 win at Sheffield United, Erik ten Hag has made two changes to his starting 11. Raphael Varane and Sergio Reguilon come into the side for today's game against Copenhagen. Jonny Evans and Victor Lindelof both miss out, but they are available options to the manager from the bench. 17:44 Adam Shergold on Man United's priorities Mail Sport's Adam Shergold laid down some of Man United's priorities coming into this clash with Copenhagen. After high-scoring defeats to Bayern Munich and Galatasaray, it's time for Erik ten Hag's side to get some points - and confidence - on the European stage. Ten Hag's priorities ahead of Man United's must-win Copenhagen clash Never before have they lost the opening two games of a Champions League group and another defeat would probably mean Europa League at best after Christmas . Mail Online 17:41 Patrick Collins on an English hero Patrick Collins wrote about Sir Bobby Charlton for the Mail on Sunday - an English hero that many admired and wanted their children to imitate. 17:36 Hello and welcome to Man United vs Copenhagen Hello and welcome to Mail Sport's live blog covering Man United's Champions League game against Copenhagen at Old Trafford. Kick off is at 8pm local time, or in just under an hour and a half. We'll have all the team news and action. It is the club's first home game since the death of Sir Bobby Charlton, and we're expecting a great reaction to pay tribute to one of Man United's all-time greats. Key Updates Copenhagen team news View post How to follow the rest of the Champions League action tonight View post Man United team news - two changes for Erik ten Hag's side View post TOP STORIES MAN UNITED CONFIDENTIAL: Ten Hag's tributes to Sir Bobby are a far cry from Mourinho's Munich memorial display... while new book claims Glazers considered giving fans who sang loudly free tickets Wayne Rooney recalls 'moving and emotional' Munich disaster talk from Sir Bobby Charlton to Man United players in 2008, as he adjusts to new role as Birmingham City manager Sevilla vs Arsenal - Champions League LIVE: Mikel Arteta's side are desperate to pick up a vital win in Spain following their shock defeat to Lens IAN HERBERT: Is it beyond City fans to respect Sir Bobby, who helped put Manchester on the map? Manchester United legends including Gary Neville and Brian Kidd join current squad and boss Erik ten Hag in signing messages of condolence in memory of Sir Bobby Charlton How Bobby and Jack Charlton ended their painful feud of 42 years with a heartfelt hug after falling out over their mum Cissie - as real reason Bobby didn't go to Jack's funeral is revealed In-form Maguire and McTominay have to start, Hojlund must come back to haunt his old club and Man United really need to hold onto leads! Erik ten Hag's priorities for must-win Copenhagen clash Erik ten Hag will struggle to take Man United 'back to the top', claims Simon Jordan, as he brands the Red Devils boss 'a small man in a big suit' ahead of must-win Champions League clash with Copenhagen Porn star Sky Bri reveals mystery Man United footballer has been DMing her - and says he's one of a few 'pretty big players' to message her Man City's fury at fans' sick Sir Bobby Charlton chants: Man United's rivals apologise to football legend's family, as video emerges of chanting at their game shortly after he died aged 86 OLIVER HOLT: The Manchester United of Sir Bobby Charlton's era were celebrated as 'England's Team'. Now there's just sadness over a club in decay Manchester United legend's grandson scores stunning long-range goal on his EFL debut as the 21-year-old notches late winner for Notts County against Gillingham Man United can learn from Copenhagen on AND off the pitch! Champions League opponents are the 'Ajax of the North', have an outstanding recruitment programme and trade blows with Europe's elite Mail Sport launches new WhatsApp Channels: Follow for all the latest breaking news and updates about Arsenal, Manchester United, Chelsea and Liverpool today Man United news RECAP: Tributes continue to pour in for Sir Bobby Charlton as Red Devils look ahead to tonight's Champions League clash with Copenhagen Manchester United confident rival Man City fans will respect minute's applause held for Sir Bobby Charlton ahead of Sunday's derby clash Sir Bobby Charlton's last surviving brother, Tommy, 77, makes heartfelt tribute to Man United legend following his death, saying: 'If ever there was a place reserved in heaven, it is for Bob' Man United deny Jadon Sancho is set to return from his exile after fans thought Erik ten Hag said 'Sancho' and not 'Sergio' in his press conference when asked about fitness of left-back Reguilon PETE JENSON: Sevilla lack consistency but under new manager Diego Alonso and with their ability to step up in big games, the Europa League holders could cause trouble for Arsenal EXCLUSIVE: Jose Antonio Reyes' father says his son and Mikel Arteta were 'like brothers' as his family open their doors to Mail Sport ahead of an emotional night as Arsenal and Sevilla face-off in the Champions League Harry Kane on cloud nine as he sets Bayern Munich club record by scoring ninth goal in opening eight Bundesliga games in 3-1 win over Mainz Spilling the tea on your Old Trafford exit, David? De Gea meets up for a 'coffee and friends' date with his ex-Man United team-mates... but there's no room for his £47m Red Devils replacement Andre Onana at the table Marcus Rashford pays tribute to Sir Bobby Charlton after his death aged 86 by dedicating Manchester United's win against Sheffield United to the World Cup winner and his family Sir Bobby Charlton dies aged 86: England and Manchester United legend passes away surrounded by family after long battle with dementia - leaving just Sir Geoff Hurst alive from the team of heroes who won the World Cup in 1966 BRYAN ROBSON: Every kid wanted to be Sir Bobby Charlton... he was the role model for every young footballer. He will be remembered as the perfect gentlemen, the perfect player When Eddie met Kevin! Keegan and Howe - the King and Prince of Newcastle - discuss the lofty ambitions of the high-flying Magpies... and even talk up their chances of Premier League or European glory The kind of man that Englishmen dreamed that their sons might become: Bobby Charlton was a typically English hero, writes PATRICK COLLINS CHRIS WHEELER: It's fitting that Man United's first home match since Sir Bobby Charlton's passing is in the European Cup, which defined the great man Jude Bellingham has had a HUGE impact at Real Madrid while Harry Kane has been the 'perfect striker' for Bayern Munich... but which England star has made a better start to life abroad? Man United's strikeforce is STILL not in tune, it's jeepers keepers at both Arsenal and Chelsea, Liverpool have VAR to thank this time... and free midweeks are happy days for Ange Postecoglou! 10 THINGS WE LEARNED from the Premier League weekend Manchester United youngster Tyler Fletcher - son of ex-midfielder Darren - switches his international allegiance back to Scotland from England... after 16-year-old and his twin brother Jack moved from Man City in the summer Jadon Sancho's Manchester United career is '90 per cent over' with officials convinced the £73m star 'must find a new club in January'... as he remains exiled from the first team Wish you were still here? Man United captain Bruno Fernandes meets up with booted-out goalkeeper David de Gea in Manchester amid £47m Andre Onana's struggles, as fans urge the Spaniard to 'come back in January' ROB DRAPER: Sir Bobby Charlton carried memories of the Munich Air Disaster all his life. That he wasn't defined by the tragedy showed just how extraordinary he was Sir Bobby Charlton's death at the age of 86 leaves hat-trick hero Sir Geoff Hurst as the SOLE surviving member of the England team that started the 1966 World Cup final Man United hold a minute's silence for Sir Bobby Charlton before their Champions League press conference, as they plot more tributes to English football legend at matches this week Dejan Kulusevski is convinced lack of European football is 'HUGE' advantage for Tottenham over title rivals, with Spurs aiming to move five points clear at the top on Friday Luke Shaw expected to be OUT for another FIVE WEEKS, missing vital games against Man City and Copenhagen in the Champions League - but there's finally good injury news as Aaron Wan-Bissaka nears a return Chelsea 'are preparing shock January bid for Aaron Ramsdale', with Arsenal goalkeeper stuck behind David Raya in pecking order and Robert Sanchez struggling at Blues England 15-16 South Africa - Rugby World Cup semi-final RECAP: Agony for England as South Africa steal victory with a late penalty kick after leading for just TWO minutes in the game Darren England will referee his first game since his disastrous VAR error that infuriated Liverpool when he takes charge of Saturday's Severnside derby between Cardiff and Bristol City The last picture of Sir Bobby Charlton: Brave star posed for snap while taking covid jab in 2021 despite ongoing battle with dementia Rio Ferdinand calls on Manchester United players to feed off crowd atmosphere on emotional Champions League game as Old Trafford remembers Sir Bobby Charlton Pep Guardiola was WRONG to sell Cole Palmer to Chelsea, says Dominic King after the £42.5m winger scored against Arsenal... but Chris Sutton says you can't doubt the City boss' judgement as hosts clash on Mail Sport's It's All Kicking Off Ajax are likely to fail with any approach for Mitchell van der Gaag as Louis van Gaal looks to lure Manchester United assistant coach back to Holland Tottenham 2-0 Fulham - Premier League RECAP: Son Heung-min and James Maddison fire goals for Spurs in the London derby as Ange Postecoglou's side return top of the Premier League table Kepa Arrizabalaga wants to stay at Real Madrid on permanent basis after strong start, but Chelsea loanee admits 'nothing has been negotiated yet' Sheffield United 1-2 Man United - Premier League RECAP: Erik ten Hag's men seal victory on the day of Sir Bobby Charlton's passing after goals from Diogo Dalot and Scott McTominay Erik ten Hag bluntly tells Andre Onana to 'step up' and 'give better performances' after £47m goalkeeper's error-strewn start to his Man United career... but backs his ex-Ajax stopper to come good US Grand Prix - Race LIVE: Max Verstappen overtakes Lando Norris to grab the lead in Austin, with Lewis Hamilton in second Lewis Hamilton and Charles Leclerc post joint cryptic message on social media after both were disqualified from the US Grand Prix for running an illegal floor Can you recognise the Premier League cult hero jumping on the Overground to watch his former club's old rivals? EXCLUSIVE: World Rugby's new Nations Championship is given the go-ahead by the narrowest of margins in council vote - but some are warning the new international competition will be 'the death' of the sport Bill Kenwright dies aged 78: Everton chairman and legendary West End theatre impresario behind Blood Brothers, Joseph and Fame passes away days after returning home from surgery on cancerous liver tumour RIATH AL-SAMARRAI: Tottenham have handled Harry Kane's exit awfully well, but Ange Postecoglou's thin squad will be challenged when the Africa Cup of Nations and Asian Cup come around Everton star Alex Iwobi shares screenshot of the caring messages he used to get from Bill Kenwright stating how 'proud' he was of the midfielder... as he shares very personal heartfelt tribute to late chairman Former QPR co-owner Tony Fernandes is slammed as 'unprofessional' for getting a half-naked massage during a WORK MEETING - and boasting about the 'culture' on LinkedIn - before hastily deleting his post Real Madrid players rally around Vinicius Junior after the forward was racially abused by multiple Sevilla fans during LaLiga draw as Jude Bellingham declares 'always with you, brother' Wrexham owner Rob McElhenney announces new 'Parks and Wrex' development project in hilarious video with actor Chris Pratt as part of birthday gift for co-owner Ryan Reynolds Barcelona and Real Madrid are 'keeping tabs on 17-year-old French wonderkid Eli Junior Kroupi', with Lorient starlet taking Ligue 1 by storm Mike Tyson shows off his ripped physique aged 57 as the former world heavyweight champion helps MMA star Francis Ngannou prepare for his crossover fight with Tyson Fury REVEALED: World Rugby are looking into a DIFFERENT incident involving Tom Curry and Bongi Mbonambi in investigation into England 'white ****' slur - despite fans claiming South Africa star's innocence was proven Tributes flood in for Bill Kenwright following his death at the age of 78 - as Liverpool, Jamie Carragher and Wayne Rooney join the footballing world and beyond in saluting the former Everton chairman Cricketer Fawad Ahmed announces his four-month-old son has died: 'Till we meet again' Was South Africa's 'white ****' slur lost in translation? Springboks fans say Bongi Mbonambi was speaking in Afrikaans - and Google Translate shows they may have a case What are Jackson Mahomes' alleged crimes and what has he been charged with? All the latest after he was spotted with Taylor Swift to watch Travis Kelce's Chiefs win Jack Grealish meets up with his 'first football hero' at Man City's training ground... but can you recognise the iconic ex-Premier League striker? Travis Kelce has nervous 'alarms' going off in his head over new 'level of superstardom' from dating Taylor Swift, reveals his brother Jason: 'Man, this is a lot' Taylor Swift fans fume that Jackson Mahomes was allowed in the same Chiefs VIP box as pop superstar as he awaits hearing over alleged sexual battery: 'Someone get her out immediately' EXCLUSIVE: Taylor Swift and Travis Kelce arrive at the Chiefs star's mansion in his Rolls Royce for party with friends and family catered by Kansas City BBQ joint - after the loved-up pair left win over Chargers together EXCLUSIVE: Taylor Swift heads to Travis Kelce's house for lunch of turkey omelet and chicken tacos after flying in from LA on her private jet to watch her man play in a fourth Chiefs game South Africa fans uncover footage they claim proves Bongi Mbonambi's 'white ****' call is actually him shouting to team-mates in Afrikaans... but it's NOT even the incident World Rugby are investigating Kansas City Chiefs wide receiver Justyn Ross is arrested, facing felony charge of criminal damage of more than $25,000 Legendary commentator Martin Tyler set to return to the gantry four months after leaving Sky Sports to once again call a live Premier League game Tottenham fans pictured waving Israel flags during their clash against Fulham despite Premier League ban amid Palestine conflict Ireland rugby star strips down to her pineapple-print underwear at Rugby World Cup, as she celebrates 'the party' despite her nation's early exit Rapper Blueface proposes to his girlfriend in WILD day at the Rams game... after turning his private suite into a STRIP CLUB and offering rival players wads of cash to throw the game Mattress Mack loses out on 'at least $43.4 MILLION' after Houston Astros suffer 11-4 loss in deciding ALCS Game 7 to Texas Rangers Mohamed Salah IS Liverpool's greatest ever player in the Premier League era - not Steven Gerrard - claims Mail Sport's Chris Sutton on It's All Kicking Off... and believes only one player in the top-flight's history is more ruthless Tottenham 2-0 Fulham: Son Heung-min and James Maddison fire Spurs back to the top of the Premier League as Ange Postecoglou's side capitalise on defensive errors EXCLUSIVE: Ashlyn Harris loads her luggage into a taxi and heads to Newark Airport as she jets out of New York amid Ali Krieger split... after her ex-wife dropped hint she had cheated on her with new lover Sophia Bush Georgetown University women's basketball coach Tasha Butts dead at 41: Tributes pour in for former star player after two-year cancer battle Mary Lou Retton has returned HOME after 'scary setback' in her fight against rare form of pneumonia, as family reveal US Olympic legend is in 'recovery mode' after leaving the ICU Max Verstappen's model girlfriend is left SERIOUSLY unimpressed as he's booed after winning the US Grand Prix ahead of disqualified Lewis Hamilton Lionel Messi, his stunning wife, Antonela, and their three sons pose with Ed Sheeran as the forward kicks off his offseason with the pop star's concert after Inter Miami missed out on playoffs Jamie Carragher lauds 22-year-old Chelsea star for stepping up to show 'captain-like authority' against his team-mate and 'seasoned professional Raheem Sterling' during the Blues' 2-2 draw against Arsenal Footy legend's wedding EVACUATED after bushfire caused by squatters forces police to intervene EXCLUSIVE: 'I'm living like a monk... but I was a fat baby and I will be fat when I die!': Tyson Fury says his love handles will help him beat ripped Francis Ngannou - and sends a message to Oleksandr Usyk Ange Postecoglou SLAMS his Tottenham side 'for taking liberties in possession' and labels second half of 2-0 win over Fulham 'the WORST 45 minutes we've had all year'... despite going top! Arsenal break silence over all-white squad team photo after race row as they accept their women's team 'does not reflect the diversity that exists across the club' Alan Jones pictured in blackface at Wallaby 'skit night' during famous Bledisloe Cup winning tour of New Zealand Wife of Geelong star Gary Rohan has opened up about her heartbreaking miscarriage experience: 'You never think it's going to happen to you' KSI hires lawyer after controversial defeat to Tommy Fury, turning to a legal team in a bid to overturn the fight result after being more accurate with his punches New York Jets quarterback Zach Wilson enjoys bye week by jetting off to Utah for a spooky Halloween weekend with his stunning girlfriend Nicolette Dellanno... but he still can't resist picking up a football! Travis Kelce hilariously celebrates with a fist-pump as fan screams 'Let's go, Taylor's boyfriend' at him... after pop superstar Swift attended a FOURTH Chiefs game to watch him play Eagles coach Nick Sirianni gives passionate defense of controversial play many in the NFL want banned Garth Crooks names two Liverpool stars in his BBC team of the week column... but then BARELY mentions them as he uses it to lambast Luis Diaz and call for Ibrahima Konate red card Travis Kelce's dad Ed jokes Taylor Swift didn't 'get the diva memo' as he praises the 'very smart' and 'special' pop star amid her fledgling romance with his Kansas City Chiefs star son Champions League Sir Bobby Charlton Share or comment on this article: Man United vs Copenhagen - Champions League LIVE: Red Devils to pay tribute at first home game since Sir Bobby Charlton's passing e-mail The more I listen to Rio Ferdinand the harder it i... by ucanotbserious 11 Add comment Comments 17 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-10-24 18:09:57","image_url":"https://i.dailymail.co.uk/1s/2023/10/24/10/76836695-0-image-a-17_1698140752943.jpg","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"c149c705a34f8dcc8533242bf4474316","title":"Sevilla vs Arsenal - Champions League LIVE: Mikel Arteta's side are desperate to pick up a vital win in Spain following their shock defeat to Lens","link":"https://www.dailymail.co.uk/sport/live/article-12665591/Sevilla-vs-Arsenal-Champions-League-2023-24-Latest-Result.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Follow Mail Sport's live blog for all the latest updates from Ramon Sanchez-Pizjuan Stadium as Sevilla host Arsenal in the Champions League .","content":"LIVE Sevilla vs Arsenal - Champions League LIVE: Mikel Arteta's side are desperate to pick up a vital win in Spain following their shock defeat to Lens By Spencer Morgan For Mailonline Published: 18:32, 24 October 2023 | Updated: 19:43, 24 October 2023 e-mail 7 View comments Follow Mail Sport's live blog for all the latest updates from Ramon Sanchez-Pizjuan Stadium as Sevilla host Arsenal in the Champions League . 18:32 30 minutes to kick-off 18:26 Sevilla not in the best form The Spanish side sit 13th in LaLiga with just two wins from their opening nine matches while they have failed to win either of their first two games in Europe. However, Saturday's 1-1 draw with Real Madrid should give them some cofidence. 18:09 Sevilla team news 18:03 Arsenal team news One change from Saturday as Tomiyasu replaces Zinchenko. Starting XI: Raya; White, Saliba, Gabriel, Tomiyasu; Jorginho, Rice, Ødegaard: Saka, Martinelli, Jesus. Subs: Ramsdale, Hein, Zinchenko, Cedric, Kiwior, Elneny, Havertz, Vieira, Smith Rowe, Trossard, Nelson, Nketiah. 17:59 The Gunners have arrived Mikel Arteta's men are in the building. 17:53 No Partey tonight The midfielder has not travelled to Spain with the squad... 17:48 The stage is set 17:39 State of play The Gunners sit second with three points following their emphatic 4-0 victory over PSV and surprise 2-1 defeat to Lens. Sevilla sit third with draws in their opening two matches. Lens top the group with four points. 17:34 Good evening! And welcome to Mail Sport's live coverage of Sevilla vs Arsenal in the Champions League. Group B is finely poised andthe gunners will be in trouble if they don't a result tonight. Team news to follow with kick-off at 8pm. TOP STORIES EXCLUSIVE: Jose Antonio Reyes' father says his son and Mikel Arteta were 'like brothers' as his family open their doors to Mail Sport ahead of an emotional night as Arsenal and Sevilla face-off in the Champions League Harry Kane on cloud nine as he sets Bayern Munich club record by scoring ninth goal in opening eight Bundesliga games in 3-1 win over Mainz Mikel Arteta rejects Gary Neville's claim that David Raya is struggling with the pressure of replacing Aaron Ramsdale as Arsenal goalkeeper after his errors in the draw at Chelsea Former Liverpool midfielder Suso on training with a teenage Martin Odegaard, his scouse 'family' and winning two Europa Leagues with Sevilla ahead of Champions League clash with Arsenal PETE JENSON: Sevilla lack consistency but under new manager Diego Alonso and with their ability to step up in big games, the Europa League holders could cause trouble for Arsenal Man United vs Copenhagen - Champions League LIVE: Red Devils to pay tribute at first home game since Sir Bobby Charlton's passing Dejan Kulusevski is convinced lack of European football is 'HUGE' advantage for Tottenham over title rivals, with Spurs aiming to move five points clear at the top on Friday Chelsea 'are preparing shock January bid for Aaron Ramsdale', with Arsenal goalkeeper stuck behind David Raya in pecking order and Robert Sanchez struggling at Blues Hoping for a miracle at the bottom of the North Sea: Divers are sent down to check for signs of life inside sunken British cargo ship after it collided with second vessel leaving one dead and four missing off Germany Mail Sport launches new WhatsApp Channels: Follow for all the latest breaking news and updates about Arsenal, Manchester United, Chelsea and Liverpool today MAN UNITED CONFIDENTIAL: Ten Hag's tributes to Sir Bobby are a far cry from Mourinho's Munich memorial display... while new book claims Glazers considered giving fans who sang loudly free tickets Third executive at Russian oil giant that criticised Putin's invasion of Ukraine dies suddenly British cargo ship sinks: Moment P&O passengers are told their cruiser is joining hunt for 'people in the water' after bulk carrier crash that left one dead and four missing off Germany Pep Guardiola was WRONG to sell Cole Palmer to Chelsea, says Dominic King after the £42.5m winger scored against Arsenal... but Chris Sutton says you can't doubt the City boss' judgement as hosts clash on Mail Sport's It's All Kicking Off Scientists are studying a 116-year-old San Francisco-born grandma who is the oldest woman in the world to learn her secrets and develop cures for diseases Everton star Alex Iwobi shares screenshot of the caring messages he used to get from Bill Kenwright stating how 'proud' he was of the midfielder... as he shares very personal heartfelt tribute to late chairman Tiny brewery in historic pub is 'threatened' by £15billion car giant Mercedes Benz over beer label the car giant says is too similar to its logo Arsenal break silence over all-white squad team photo after race row as they accept their women's team 'does not reflect the diversity that exists across the club' In-form Maguire and McTominay have to start, Hojlund must come back to haunt his old club and Man United really need to hold onto leads! Erik ten Hag's priorities for must-win Copenhagen clash Queen Letizia of Spain looks pensive as she visits Tenerife with King Felipe to learn how the area has been impacted by ongoing forest fires Chantelle Houghton flaunts her 4st weight loss in a yellow bikini as she hits the beach in Marbella - after claiming Big Brother 'ruined' her life Erik ten Hag will struggle to take Man United 'back to the top', claims Simon Jordan, as he brands the Red Devils boss 'a small man in a big suit' ahead of must-win Champions League clash with Copenhagen Can you recognise the Premier League cult hero jumping on the Overground to watch his former club's old rivals? When Eddie met Kevin! Keegan and Howe - the King and Prince of Newcastle - discuss the lofty ambitions of the high-flying Magpies... and even talk up their chances of Premier League or European glory Man United's strikeforce is STILL not in tune, it's jeepers keepers at both Arsenal and Chelsea, Liverpool have VAR to thank this time... and free midweeks are happy days for Ange Postecoglou! 10 THINGS WE LEARNED from the Premier League weekend Jude Bellingham has had a HUGE impact at Real Madrid while Harry Kane has been the 'perfect striker' for Bayern Munich... but which England star has made a better start to life abroad? Alex Scott cuts a casual figure as she leaves radio studios - after wishing 'secret girlfriend' Jess Glynne a happy birthday in sweet post Chelsea 2-2 Arsenal - Premier League RECAP: Leandro Trossard sneaks in at the back post to tuck home and complete Gunners' unlikely comeback... as Blues surrender a two-goal lead Jadon Sancho's Manchester United career is '90 per cent over' with officials convinced the £73m star 'must find a new club in January'... as he remains exiled from the first team Jack Grealish meets up with his 'first football hero' at Man City's training ground... but can you recognise the iconic ex-Premier League striker? Man United can learn from Copenhagen on AND off the pitch! Champions League opponents are the 'Ajax of the North', have an outstanding recruitment programme and trade blows with Europe's elite Wayne Rooney recalls 'moving and emotional' Munich disaster talk from Sir Bobby Charlton to Man United players in 2008, as he adjusts to new role as Birmingham City manager Lauryn Hill fans fear for her health after singer is forced to postpone tour date to prevent 'serious strain or damage' to her vocal chords Jamie Carragher lauds 22-year-old Chelsea star for stepping up to show 'captain-like authority' against his team-mate and 'seasoned professional Raheem Sterling' during the Blues' 2-2 draw against Arsenal Man United deny Jadon Sancho is set to return from his exile after fans thought Erik ten Hag said 'Sancho' and not 'Sergio' in his press conference when asked about fitness of left-back Reguilon England 15-16 South Africa - Rugby World Cup semi-final RECAP: Agony for England as South Africa steal victory with a late penalty kick after leading for just TWO minutes in the game Brits are realising why Fanta tastes so much better abroad - and it's all to do with the nutritional value Tottenham 2-0 Fulham - Premier League RECAP: Son Heung-min and James Maddison fire goals for Spurs in the London derby as Ange Postecoglou's side return top of the Premier League table Spilling the tea on your Old Trafford exit, David? De Gea meets up for a 'coffee and friends' date with his ex-Man United team-mates... but there's no room for his £47m Red Devils replacement Andre Onana at the table Bachelor Nation's Jason Tartick celebrates his 35th birthday by showing off muscles with shirtless snap following split with Kaitlyn Bristowe: 'Please be better than 34' Kepa Arrizabalaga wants to stay at Real Madrid on permanent basis after strong start, but Chelsea loanee admits 'nothing has been negotiated yet' US Grand Prix - Race LIVE: Max Verstappen overtakes Lando Norris to grab the lead in Austin, with Lewis Hamilton in second Gemma Owen's brother James tells of his 'heartbreak' at being unable to follow in England legend dad Michael's footballer footsteps as he details his battle with a rare eye condition Sky Sports are forced to apologise after broadcasting a fan shouting 'nice a**e Leno' at Fulham's goalkeeper while he took a goal kick against Tottenham Manchester United legends including Gary Neville and Brian Kidd join current squad and boss Erik ten Hag in signing messages of condolence in memory of Sir Bobby Charlton Amber Heard is BACK using her cane in Spain - after ditching the walking aid for days as she continues her recovery after hip injury Jamie Carragher argues Spurs fans would be 'delighted' with a place in the Champions League spots on Monday Night Football... and Wolves manager Gary O'Neil praises Ange Postecoglou's outlook Sandro Tonali will learn the length of his ban from football for illegal gambling 'in the next 24 hours' as midfielder trains ahead of Newcastle's Champions League clash with Dortmund Sean Longstaff confident Newcastle can cope loss of Sandro Tonali with midfielder set to learn length of ban for illegal gambling... as he insists Italian has been happy at the club ever since he joined Princess Leonor of Spain says she 'understands her duty' in a speech ahead of her 18th birthday as she prepares to one day become Queen Porn star Sky Bri reveals mystery Man United footballer has been DMing her - and says he's one of a few 'pretty big players' to message her IAN HERBERT: Is it beyond City fans to respect Sir Bobby, who helped put Manchester on the map? Lewis Hamilton and Charles Leclerc post joint cryptic message on social media after both were disqualified from the US Grand Prix for running an illegal floor EXCLUSIVE: World Rugby's new Nations Championship is given the go-ahead by the narrowest of margins in council vote - but some are warning the new international competition will be 'the death' of the sport Bill Kenwright dies aged 78: Everton chairman and legendary West End theatre impresario behind Blood Brothers, Joseph and Fame passes away days after returning home from surgery on cancerous liver tumour RIATH AL-SAMARRAI: Tottenham have handled Harry Kane's exit awfully well, but Ange Postecoglou's thin squad will be challenged when the Africa Cup of Nations and Asian Cup come around Former QPR co-owner Tony Fernandes is slammed as 'unprofessional' for getting a half-naked massage during a WORK MEETING - and boasting about the 'culture' on LinkedIn - before hastily deleting his post Real Madrid players rally around Vinicius Junior after the forward was racially abused by multiple Sevilla fans during LaLiga draw as Jude Bellingham declares 'always with you, brother' Wrexham owner Rob McElhenney announces new 'Parks and Wrex' development project in hilarious video with actor Chris Pratt as part of birthday gift for co-owner Ryan Reynolds Barcelona and Real Madrid are 'keeping tabs on 17-year-old French wonderkid Eli Junior Kroupi', with Lorient starlet taking Ligue 1 by storm Mike Tyson shows off his ripped physique aged 57 as the former world heavyweight champion helps MMA star Francis Ngannou prepare for his crossover fight with Tyson Fury REVEALED: World Rugby are looking into a DIFFERENT incident involving Tom Curry and Bongi Mbonambi in investigation into England 'white ****' slur - despite fans claiming South Africa star's innocence was proven Tributes flood in for Bill Kenwright following his death at the age of 78 - as Liverpool, Jamie Carragher and Wayne Rooney join the footballing world and beyond in saluting the former Everton chairman Cricketer Fawad Ahmed announces his four-month-old son has died: 'Till we meet again' Was South Africa's 'white ****' slur lost in translation? Springboks fans say Bongi Mbonambi was speaking in Afrikaans - and Google Translate shows they may have a case What are Jackson Mahomes' alleged crimes and what has he been charged with? All the latest after he was spotted with Taylor Swift to watch Travis Kelce's Chiefs win Travis Kelce has nervous 'alarms' going off in his head over new 'level of superstardom' from dating Taylor Swift, reveals his brother Jason: 'Man, this is a lot' Taylor Swift fans fume that Jackson Mahomes was allowed in the same Chiefs VIP box as pop superstar as he awaits hearing over alleged sexual battery: 'Someone get her out immediately' EXCLUSIVE: Taylor Swift and Travis Kelce arrive at the Chiefs star's mansion in his Rolls Royce for party with friends and family catered by Kansas City BBQ joint - after the loved-up pair left win over Chargers together EXCLUSIVE: Taylor Swift heads to Travis Kelce's house for lunch of turkey omelet and chicken tacos after flying in from LA on her private jet to watch her man play in a fourth Chiefs game South Africa fans uncover footage they claim proves Bongi Mbonambi's 'white ****' call is actually him shouting to team-mates in Afrikaans... but it's NOT even the incident World Rugby are investigating Kansas City Chiefs wide receiver Justyn Ross is arrested, facing felony charge of criminal damage of more than $25,000 Legendary commentator Martin Tyler set to return to the gantry four months after leaving Sky Sports to once again call a live Premier League game Tottenham fans pictured waving Israel flags during their clash against Fulham despite Premier League ban amid Palestine conflict Ireland rugby star strips down to her pineapple-print underwear at Rugby World Cup, as she celebrates 'the party' despite her nation's early exit Rapper Blueface proposes to his girlfriend in WILD day at the Rams game... after turning his private suite into a STRIP CLUB and offering rival players wads of cash to throw the game Mattress Mack loses out on 'at least $43.4 MILLION' after Houston Astros suffer 11-4 loss in deciding ALCS Game 7 to Texas Rangers Mohamed Salah IS Liverpool's greatest ever player in the Premier League era - not Steven Gerrard - claims Mail Sport's Chris Sutton on It's All Kicking Off... and believes only one player in the top-flight's history is more ruthless Tottenham 2-0 Fulham: Son Heung-min and James Maddison fire Spurs back to the top of the Premier League as Ange Postecoglou's side capitalise on defensive errors EXCLUSIVE: Ashlyn Harris loads her luggage into a taxi and heads to Newark Airport as she jets out of New York amid Ali Krieger split... after her ex-wife dropped hint she had cheated on her with new lover Sophia Bush Georgetown University women's basketball coach Tasha Butts dead at 41: Tributes pour in for former star player after two-year cancer battle Manchester United legend's grandson scores stunning long-range goal on his EFL debut as the 21-year-old notches late winner for Notts County against Gillingham Mary Lou Retton has returned HOME after 'scary setback' in her fight against rare form of pneumonia, as family reveal US Olympic legend is in 'recovery mode' after leaving the ICU Max Verstappen's model girlfriend is left SERIOUSLY unimpressed as he's booed after winning the US Grand Prix ahead of disqualified Lewis Hamilton Lionel Messi, his stunning wife, Antonela, and their three sons pose with Ed Sheeran as the forward kicks off his offseason with the pop star's concert after Inter Miami missed out on playoffs Manchester United youngster Tyler Fletcher - son of ex-midfielder Darren - switches his international allegiance back to Scotland from England... after 16-year-old and his twin brother Jack moved from Man City in the summer Footy legend's wedding EVACUATED after bushfire caused by squatters forces police to intervene EXCLUSIVE: 'I'm living like a monk... but I was a fat baby and I will be fat when I die!': Tyson Fury says his love handles will help him beat ripped Francis Ngannou - and sends a message to Oleksandr Usyk Ange Postecoglou SLAMS his Tottenham side 'for taking liberties in possession' and labels second half of 2-0 win over Fulham 'the WORST 45 minutes we've had all year'... despite going top! OLIVER HOLT: The Manchester United of Sir Bobby Charlton's era were celebrated as 'England's Team'. Now there's just sadness over a club in decay Alan Jones pictured in blackface at Wallaby 'skit night' during famous Bledisloe Cup winning tour of New Zealand Wife of Geelong star Gary Rohan has opened up about her heartbreaking miscarriage experience: 'You never think it's going to happen to you' KSI hires lawyer after controversial defeat to Tommy Fury, turning to a legal team in a bid to overturn the fight result after being more accurate with his punches New York Jets quarterback Zach Wilson enjoys bye week by jetting off to Utah for a spooky Halloween weekend with his stunning girlfriend Nicolette Dellanno... but he still can't resist picking up a football! Travis Kelce hilariously celebrates with a fist-pump as fan screams 'Let's go, Taylor's boyfriend' at him... after pop superstar Swift attended a FOURTH Chiefs game to watch him play Eagles coach Nick Sirianni gives passionate defense of controversial play many in the NFL want banned Garth Crooks names two Liverpool stars in his BBC team of the week column... but then BARELY mentions them as he uses it to lambast Luis Diaz and call for Ibrahima Konate red card Travis Kelce's dad Ed jokes Taylor Swift didn't 'get the diva memo' as he praises the 'very smart' and 'special' pop star amid her fledgling romance with his Kansas City Chiefs star son Ajax are likely to fail with any approach for Mitchell van der Gaag as Louis van Gaal looks to lure Manchester United assistant coach back to Holland Champions League Mikel Arteta Spain Share or comment on this article: Sevilla vs Arsenal - Champions League LIVE: Mikel Arteta's side are desperate to pick up a vital win in Spain following their shock defeat to Lens e-mail It's so obvious how Ramsdala has fallen out of fav... by Bosse Andersson 10 Add comment Comments 7 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-10-24 18:09:43","image_url":"https://i.dailymail.co.uk/1s/2023/10/24/10/76929807-0-image-a-32_1698141271133.jpg","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"18a3be557114b8826e5611ddec126311","title":"Bangladesh will love to finish 5-6 if not in semis: Shakib after 4th straight loss","link":"https://www.indiatoday.in/sports/cricket/story/bangladesh-will-love-to-finish-5-6-if-not-in-semis-says-captain-shakib-after-4th-straight-loss-2453229-2023-10-24?utm_source=rss","keywords":null,"creator":null,"video_url":null,"description":"Bangladesh will love to finish 5-6 if not in semis: Shakib after 4th straight loss","content":"Listen to Story Bangladesh captain Shakib Al Hasan said they lost the match in the final 10 overs when the South African duo of Quinton de Kock and Heinrich Klaasen went on a rampage, adding 144 runs at Mumbai's Wankhede Stadium on Tuesday. Quinton de Kock notched his third century in just five innings, propelling South Africa to a commanding 149-run victory over Bangladesh in the World Cup on Tuesday. The South African team, on a dominant streak, posted an imposing total of 382/5, marking the third-highest score in the tournament (the first two spots were also held by the Proteas). They then swiftly dismantled Bangladesh's underwhelming batting performance, sending them back to the pavilion with a total of 233 runs after 46.4 overs. \"We bowled first 25 overs well. We got three wickets, they were going at about 5 an over. From there they kicked on. Quinton batted really well, and the way Klaasen finished was something we didn't have any answer to. On a ground like this it can happen but we should've bowled better. Lost the game in the last 10 overs,\" Shakib al Hasan told the broadcasters after Bangladesh lost. Mahmudullah Riyad displayed remarkable courage by scoring 111 runs from 111 balls, achieving his fourth century in 225 ODIs and his first in six years. Unfortunately, the rest of the Bangladesh batting lineup struggled on a pitch that still favored batsmen. This defeat marked Bangladesh's fourth consecutive loss in the World Cup, while South Africa continued their impressive form with four wins out of five games. Furthermore, this loss was one of Bangladesh's heaviest in terms of runs in World Cup history, marking their third-largest margin of defeat. However, the veteran all-rounder did not lose hope of his team finishing strongly in this World Cup. Shakib said that he would be happy if Bangladesh managed to finish fifth or sixth if not in the semi-final. \"Has been lot of talking about whether Mushfiq and Mahmudullah should bat higher. But the role they have, they're doing very well. Our top four batters need to do well. Long way to go in this tournament, anything can happen. Lot to be learnt, and lot to play for. Will love to finish 5-6 if not in the semis. We're not playing like a team that can do it, but hope to finish stronger,\" Shakib added.","pubDate":"2023-10-24 17:58:02","image_url":null,"source_id":"indiatoday","source_priority":2885,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"7904f8192967a1541ff735f58abeee8e","title":"World Cup 2023 Points Table: સાઉથ આફ્રિકાની જીતથી પોઈન્ટ ટેબલમાં ફેરબદલ","link":"https://gujarati.abplive.com/sports/cricket/world-cup-2023-points-table-update-after-sa-vs-ban-south-africa-beat-bangladesh-by-149-runs-in-wankhade-stadium-862706","keywords":["ક્રિકેટ"],"creator":["abpasmita.in"],"video_url":null,"description":"World Cup 2023 Points Table Update After SA vs BAN: સાઉથ આફ્રિકાએ વર્લ્ડ કપ 2023માં બાંગ્લાદેશને 149 રનથી હરાવીને પોઈન્ટ ટેબલમાં મોટો ફેરફાર કર્યો છે. ટૂર્નામેન્ટમાં આફ્રિકાની આ ચોથી જીત હતી, જે બાદ તેઓ ન્યુઝીલેન્ડને પાછળ છોડીને પોઈન્ટ ટેબલમાં બીજા સ્થાને આવી ગયા હતા. જ્યારે હારતાં બાંગ્લાદેશ છેલ્લા સ્થાને એટલે કે 10માં સ્થાને સરકી ગયું છે. મેચ બાદ ઈંગ્લેન્ડ ભલે એક સ્થાન આગળ વધી ગયું હોય પરંતુ ટીમની મુસીબતો હજુ ઓછી થઈ નથી. આ જીત બાદ દક્ષિણ આફ્રિકાનો નેટ રન રેટ 2.370 થઈ ગયો છે, જે હાલમાં ટૂર્નામેન્ટની કોઈપણ અન્ય ટીમ કરતા વધારે છે. નંબર વન પર રહેલું ભારત પણ રન રેટના મામલે આફ્રિકાથી ઘણું પાછળ છે. આ હાર બાદ શાકિબ અલ હસનની આગેવાનીમાં બાંગ્લાદેશની સેમિફાઈનલમાં પહોંચવાની આશા લગભગ સમાપ્ત થઈ ગઈ છે. ટૂર્નામેન્ટમાં બાંગ્લાદેશની પાંચ મેચમાં આ ચોથી હાર હતી. જો કે હજુ સુધી કોઈ ટીમને સત્તાવાર રીતે બહાર કરવામાં આવી નથી. ટોપ-4માં ફેરફાર દક્ષિણ આફ્રિકાએ આ જીત સાથે ટોપ-4માં એક ફેરફાર કર્યો છે. આ યાદીમાં ટીમ ઈન્ડિયા 10 પોઈન્ટ સાથે ટોપ પર છે. દક્ષિણ આફ્રિકા સારા નેટ રન રેટ સાથે બીજા સ્થાને આવી ગયું છે અને બીજા સ્થાને રહેલું ન્યુઝીલેન્ડ ત્રીજા સ્થાને સરકી ગયું છે. આ પછી ઓસ્ટ્રેલિયા 4 પોઈન્ટ અને નેગેટિવ -0.193 નેટ રન રેટ સાથે ચોથા સ્થાને છે. બીજી ટીમોની પણ આ જ હાલત છે બાકીની ટીમો તરફ આગળ વધતાં પાકિસ્તાનની ટીમ 4 પોઈન્ટ અને નેગેટિવ -0.400 નેટ રનરેટ સાથે પાંચમા, અફઘાનિસ્તાન 4 પોઈન્ટ અને નેગેટિવ -0.969 નેટ રનરેટ સાથે છઠ્ઠા, નેધરલેન્ડ 2 પોઈન્ટ અને નેગેટિવ -0.790 નેટ રનરેટ સાથે સાતમા, શ્રીલંકા 2 પોઈન્ટ નેગેટિવ -1.048 નેટ રન રેટ સાથે આઠમા સ્થાને છે, ઈંગ્લેન્ડ 2 પોઈન્ટ અને નેગેટિવ -1.248 નેટ રન રેટ સાથે નવમા સ્થાને છે અને બાંગ્લાદેશ 2 પોઈન્ટ અને નેગેટિવ -1.253 નેટ સાથે છેલ્લા એટલે કે 10મા સ્થાને છે. ટોસ જીતીને પ્રથમ બેટિંગ કરવા ઉતરેલી આફ્રિકન ટીમની શરૂઆત ખરાબ રહી હતી. રીસ હેન્ડ્રીક્સ 12 રન બનાવીને આઉટ થયો હતો અને રાસી વેન ડેર ડુસેન એક રન બનાવીને આઉટ થયો હતો. હેન્ડ્રીક્સને શોરીફુલ અને ડુક્વેની મિરાજે આઉટ કર્યો હતો. આ પછી ક્વિન્ટન ડી કોકે કેપ્ટન એડન માર્કરામ સાથે ત્રીજી વિકેટ માટે 131 રનની ભાગીદારી કરી હતી. ડી કોકે તેની ODI કારકિર્દીની 20મી સદી અને આ વર્લ્ડ કપની ત્રીજી સદી ફટકારી હતી.","content":"World Cup 2023 Points Table Update After SA vs BAN: સાઉથ આફ્રિકાએ વર્લ્ડ કપ 2023માં બાંગ્લાદેશને 149 રનથી હરાવીને પોઈન્ટ ટેબલમાં મોટો ફેરફાર કર્યો છે. ટૂર્નામેન્ટમાં આફ્રિકાની આ ચોથી જીત હતી, જે બાદ તેઓ ન્યુઝીલેન્ડને પાછળ છોડીને પોઈન્ટ ટેબલમાં બીજા સ્થાને આવી ગયા હતા. જ્યારે હારતાં બાંગ્લાદેશ છેલ્લા સ્થાને એટલે કે 10માં સ્થાને સરકી ગયું છે. મેચ બાદ ઈંગ્લેન્ડ ભલે એક સ્થાન આગળ વધી ગયું હોય પરંતુ ટીમની મુસીબતો હજુ ઓછી થઈ નથી. આ જીત બાદ દક્ષિણ આફ્રિકાનો નેટ રન રેટ 2.370 થઈ ગયો છે, જે હાલમાં ટૂર્નામેન્ટની કોઈપણ અન્ય ટીમ કરતા વધારે છે. નંબર વન પર રહેલું ભારત પણ રન રેટના મામલે આફ્રિકાથી ઘણું પાછળ છે. આ હાર બાદ શાકિબ અલ હસનની આગેવાનીમાં બાંગ્લાદેશની સેમિફાઈનલમાં પહોંચવાની આશા લગભગ સમાપ્ત થઈ ગઈ છે. ટૂર્નામેન્ટમાં બાંગ્લાદેશની પાંચ મેચમાં આ ચોથી હાર હતી. જો કે હજુ સુધી કોઈ ટીમને સત્તાવાર રીતે બહાર કરવામાં આવી નથી. ટોપ-4માં ફેરફાર દક્ષિણ આફ્રિકાએ આ જીત સાથે ટોપ-4માં એક ફેરફાર કર્યો છે. આ યાદીમાં ટીમ ઈન્ડિયા 10 પોઈન્ટ સાથે ટોપ પર છે. દક્ષિણ આફ્રિકા સારા નેટ રન રેટ સાથે બીજા સ્થાને આવી ગયું છે અને બીજા સ્થાને રહેલું ન્યુઝીલેન્ડ ત્રીજા સ્થાને સરકી ગયું છે. આ પછી ઓસ્ટ્રેલિયા 4 પોઈન્ટ અને નેગેટિવ -0.193 નેટ રન રેટ સાથે ચોથા સ્થાને છે. googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); બીજી ટીમોની પણ આ જ હાલત છે બાકીની ટીમો તરફ આગળ વધતાં પાકિસ્તાનની ટીમ 4 પોઈન્ટ અને નેગેટિવ -0.400 નેટ રનરેટ સાથે પાંચમા, અફઘાનિસ્તાન 4 પોઈન્ટ અને નેગેટિવ -0.969 નેટ રનરેટ સાથે છઠ્ઠા, નેધરલેન્ડ 2 પોઈન્ટ અને નેગેટિવ -0.790 નેટ રનરેટ સાથે સાતમા, શ્રીલંકા 2 પોઈન્ટ નેગેટિવ -1.048 નેટ રન રેટ સાથે આઠમા સ્થાને છે, ઈંગ્લેન્ડ 2 પોઈન્ટ અને નેગેટિવ -1.248 નેટ રન રેટ સાથે નવમા સ્થાને છે અને બાંગ્લાદેશ 2 પોઈન્ટ અને નેગેટિવ -1.253 નેટ સાથે છેલ્લા એટલે કે 10મા સ્થાને છે. ટોસ જીતીને પ્રથમ બેટિંગ કરવા ઉતરેલી આફ્રિકન ટીમની શરૂઆત ખરાબ રહી હતી. રીસ હેન્ડ્રીક્સ 12 રન બનાવીને આઉટ થયો હતો અને રાસી વેન ડેર ડુસેન એક રન બનાવીને આઉટ થયો હતો. હેન્ડ્રીક્સને શોરીફુલ અને ડુક્વેની મિરાજે આઉટ કર્યો હતો. આ પછી ક્વિન્ટન ડી કોકે કેપ્ટન એડન માર્કરામ સાથે ત્રીજી વિકેટ માટે 131 રનની ભાગીદારી કરી હતી. ડી કોકે તેની ODI કારકિર્દીની 20મી સદી અને આ વર્લ્ડ કપની ત્રીજી સદી ફટકારી હતી.","pubDate":"2023-10-24 17:49:45","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/10/24/d158e7431fc89145a99cd51154420d6e169816975458478_original.jpg","source_id":"abplive","source_priority":10959,"country":["india"],"category":["sports"],"language":"gujarati"},{"article_id":"ae38b91c4d953ee5033488273fa40f05","title":"Points Table : आफ्रिकेची दुसऱ्या स्थानावर झेप, बांगलादेशचा पराभव झाल्यानंतर गुणतालिकेत मोठा बदल","link":"https://marathi.abplive.com/sports/cricket/world-cup-2023-points-table-update-after-sa-vs-ban-south-africa-beat-bangladesh-by-149-runs-in-wankhade-stadium-1222124","keywords":["क्रिकेट"],"creator":["एबीपी माझा स्पोर्ट्स डेस्क"],"video_url":null,"description":"World Cup 2023 Points Table : दक्षिण आफ्रिकेने विश्वचषकातील चौथ्या विजयाची नोंद केली. या विजयासह दक्षिण आफ्रिकेने उपांत्य फेरीकडे वाटचाल केली आहे. दक्षिण आफ्रिकेने पाच सामन्यात चार विजय मिळवत आठ गुणांची कमाई केली. चौथ्या विजयासह दक्षिण आफ्रिकेने दुसऱ्या क्रमांकावर झेप घेतली. न्यूझीलंडचा संघ तिसऱ्या क्रमांकावर घसरला आहे. या सामन्याआधी दक्षिण आफ्रिका तिसऱ्या तर न्यूझीलंड दुसऱ्या क्रमांकावर होता. बांगलादेशचा 149 धावांनी दारुण पराभव केल्यामुळे दक्षिण आफ्रिकेचा रनरेटही सुधारला आहे. आफ्रिकेच्या विराट विजयानंतर गुणतालिकेत मोठा फेरबदल झालाय.  आजच्या सामन्यात काय झालं ? दक्षिण आफ्रिकेनं बांगलादेशचा 149 धावांनी धुव्वा उडवून, विश्वचषकाच्या मोहिमेत चौथा विजय साजरा केला. दक्षिण आफ्रिकेनं पाचपैकी चार सामने जिंकून आठ गुणांची कमाई केली असून, विश्वचषकाच्या गुणतालिकेत दक्षिण आफ्रिका दुसऱ्या स्थानावर आहे. मुंबईतल्या सामन्यात दक्षिण आफ्रिकेनं बांगलादेशला विजयासाठी 383 धावांचं आव्हान दिलं होतं. त्या आव्हानाचा पाठलाग करताना बांगलादेशचा अख्खा डाव 47 व्या षटकांत 233 धावांत आटोपला. या सामन्यात क्विन्टॉन डी कॉकनं 174 धावांची खेळी करून दक्षिण आफ्रिकेच्या डावाचा पाया घातला. त्यानं 140 चेंडूंमधली ही खेळी 15 चौकार आणि सात षटकारांनी सजवली. डी कॉकनं एडन मारक्रमच्या साथीनं तिसऱ्या विकेटसाठी 131 धावांची, तर हेन्ऱिक क्लासेनच्या साथीनं चौथ्या विकेटसाठी 142 धावांची भागीदारी केली. मारक्रमनं 69 चेंडूंत 60 धावांची आणि क्लासेननं 49 चेंडूंमध्ये 90 धावांची खेळी उभारली. क्लासेननं 90 धावांच्या खेळीला दोन चौकार आणि आठ षटकारांचा साज चढवला.  टीम इंडिया अव्वल स्थानावर -  न्यूझीलंडचा पराभव करत भारतीय संघाने गुणातलिकेत पहिल्या स्थानावर झेप घेतली आहे. यंदाच्या विश्वचषकात टीम इंडिया आतापर्यंत अजय आहे. भारताने पाच सामन्यात पाच विजय मिळवले आहेत. किवी तिसऱ्या क्रमांकावर आहेत. न्यूझीलंडने पाच सामन्यात चार विजय मिळवले आहेत.   पाकिस्तान-ऑस्ट्रेलियाची स्थिती काय ? अफगाणिस्तानकडून पाकिस्तानचा लाजीरवाण्या पराभवाचा सामना करावा लागला. या पराभवामुळे पाकिस्तान संघाचे विश्वचषकातील आव्हान अधिक खडतर झाले आहे.  पाकिस्तानन संघ गुणातातिलेत सध्या पाचव्या क्रमांकावर आहे, पण पाकिस्तानला पाच सामन्यात तीन पराभवाचा सामना करावा लागला. त्यांचा रनरेटही मोठ्या प्रमाणात घसरला आहे. अफगाणिस्तानकडून पराभूत झाल्यामुळे विश्वचषकातील आव्हान अधिक खडतर झाले आहे. विश्वचषकातील आव्हान जिवंत ठेवण्यासाठी पाकिस्तानला उर्वरित सर्व सामन्यात विजय मिळवावा लागेल.  ऑस्ट्रेलियाचा संघ चौथ्या स्थानावर आहे. पाकिस्तान, अफगाणिस्तानसह ऑस्ट्रेलियाचेही  चार गुण झाले आहेत. पण सरस रनरेटमुळे ऑस्ट्रेलिया चौथ्या क्रमांकावर आहे. तर पाकिस्तान पाचव्या स्थानी आहे. तळाच्या संघाची स्थिती काय ?  बांगलादेशचा संघ दहाव्या स्थानावर घसरला आहे. याआधी तो सातव्या स्थानी होता. तर अफगाणिस्तानचा संघ सहाव्या स्थानावर पोहचला आहे. अफागणिस्तान संघाने पाच सामन्यात दोन विजय मिळवलेत. नेदरलँडचा संघ सातव्या क्रमांकावर विराजमान आहे. श्रीलंका संघ एका विजयासह आठव्या स्थानावर आहे. गतविजेता इंग्लंड संघ नवव्या क्रमांकावर आहे. इंग्लंडला चार सामन्यात तीन पराभवाचा सामना करावा लागलाय.   ","content":"World Cup 2023 Points Table : दक्षिण आफ्रिकेने विश्वचषकातील चौथ्या विजयाची नोंद केली. या विजयासह दक्षिण आफ्रिकेने उपांत्य फेरीकडे वाटचाल केली आहे. दक्षिण आफ्रिकेने पाच सामन्यात चार विजय मिळवत आठ गुणांची कमाई केली. चौथ्या विजयासह दक्षिण आफ्रिकेने दुसऱ्या क्रमांकावर झेप घेतली. न्यूझीलंडचा संघ तिसऱ्या क्रमांकावर घसरला आहे. या सामन्याआधी दक्षिण आफ्रिका तिसऱ्या तर न्यूझीलंड दुसऱ्या क्रमांकावर होता. बांगलादेशचा 149 धावांनी दारुण पराभव केल्यामुळे दक्षिण आफ्रिकेचा रनरेटही सुधारला आहे. आफ्रिकेच्या विराट विजयानंतर गुणतालिकेत मोठा फेरबदल झालाय. आजच्या सामन्यात काय झालं ? दक्षिण आफ्रिकेनं बांगलादेशचा 149 धावांनी धुव्वा उडवून, विश्वचषकाच्या मोहिमेत चौथा विजय साजरा केला. दक्षिण आफ्रिकेनं पाचपैकी चार सामने जिंकून आठ गुणांची कमाई केली असून, विश्वचषकाच्या गुणतालिकेत दक्षिण आफ्रिका दुसऱ्या स्थानावर आहे. मुंबई तल्या सामन्यात दक्षिण आफ्रिकेनं बांगलादेशला विजयासाठी 383 धावांचं आव्हान दिलं होतं. त्या आव्हानाचा पाठलाग करताना बांगलादेशचा अख्खा डाव 47 व्या षटकांत 233 धावांत आटोपला. या सामन्यात क्विन्टॉन डी कॉकनं 174 धावांची खेळी करून दक्षिण आफ्रिकेच्या डावाचा पाया घातला. त्यानं 140 चेंडूंमधली ही खेळी 15 चौकार आणि सात षटकारांनी सजवली. डी कॉकनं एडन मारक्रमच्या साथीनं तिसऱ्या विकेटसाठी 131 धावांची, तर हेन्ऱिक क्लासेनच्या साथीनं चौथ्या विकेटसाठी 142 धावांची भागीदारी केली. मारक्रमनं 69 चेंडूंत 60 धावांची आणि क्लासेननं 49 चेंडूंमध्ये 90 धावांची खेळी उभारली. क्लासेननं 90 धावांच्या खेळीला दोन चौकार आणि आठ षटकारांचा साज चढवला. टीम इंडिया अव्वल स्थानावर - googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); न्यूझीलंडचा पराभव करत भारतीय संघाने गुणातलिकेत पहिल्या स्थानावर झेप घेतली आहे. यंदाच्या विश्वचषकात टीम इंडिया आतापर्यंत अजय आहे. भारताने पाच सामन्यात पाच विजय मिळवले आहेत. किवी तिसऱ्या क्रमांकावर आहेत. न्यूझीलंडने पाच सामन्यात चार विजय मिळवले आहेत. पाकिस्तान-ऑस्ट्रेलियाची स्थिती काय ? अफगाणिस्तानकडून पाकिस्तानचा लाजीरवाण्या पराभवाचा सामना करावा लागला. या पराभवामुळे पाकिस्तान संघाचे विश्वचषकातील आव्हान अधिक खडतर झाले आहे. पाकिस्तानन संघ गुणातातिलेत सध्या पाचव्या क्रमांकावर आहे, पण पाकिस्तानला पाच सामन्यात तीन पराभवाचा सामना करावा लागला. त्यांचा रनरेटही मोठ्या प्रमाणात घसरला आहे. अफगाणिस्तानकडून पराभूत झाल्यामुळे विश्वचषकातील आव्हान अधिक खडतर झाले आहे. विश्वचषकातील आव्हान जिवंत ठेवण्यासाठी पाकिस्तानला उर्वरित सर्व सामन्यात विजय मिळवावा लागेल. ऑस्ट्रेलियाचा संघ चौथ्या स्थानावर आहे. पाकिस्तान, अफगाणिस्तानसह ऑस्ट्रेलियाचेही चार गुण झाले आहेत. पण सरस रनरेटमुळे ऑस्ट्रेलिया चौथ्या क्रमांकावर आहे. तर पाकिस्तान पाचव्या स्थानी आहे. तळाच्या संघाची स्थिती काय ? बांगलादेशचा संघ दहाव्या स्थानावर घसरला आहे. याआधी तो सातव्या स्थानी होता. तर अफगाणिस्तानचा संघ सहाव्या स्थानावर पोहचला आहे. अफागणिस्तान संघाने पाच सामन्यात दोन विजय मिळवलेत. नेदरलँडचा संघ सातव्या क्रमांकावर विराजमान आहे. श्रीलंका संघ एका विजयासह आठव्या स्थानावर आहे. गतविजेता इंग्लंड संघ नवव्या क्रमांकावर आहे. इंग्लंडला चार सामन्यात तीन पराभवाचा सामना करावा लागलाय.","pubDate":"2023-10-24 17:48:39","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/10/24/d1a1b55d935567a84ad5086c578b4fb51698168590855625_original.jpg","source_id":"abplive","source_priority":10959,"country":["india"],"category":["sports"],"language":"marathi"},{"article_id":"841aa25356a80ba8ed24f24abb267428","title":"SA vs BAN Match Report : आफ्रिकेची विजयी घौडदौड सुरुच, बांगलादेशचा 149 धावांनी धुव्वा","link":"https://marathi.abplive.com/sports/cricket/south-africa-beat-bangladesh-sa-vs-ban-match-report-world-cup-2023-sports-news-1222121","keywords":["क्रिकेट"],"creator":["एबीपी माझा स्पोर्ट्स डेस्क"],"video_url":null,"description":"SA vs BAN Match Report : दक्षिण आफ्रिका संघाची विश्वचषकातील घौडदौड सुरुच आहे. दक्षिण आफ्रिकेने आज बांगलादेशचा 149 धावांच्या अंतराने मोठा पराभव केला. 383 धावांचा पाठलाग करताना बांगलादेशचा संघ 46.4 षटकात 233 धावांपर्यंत मजल मारु शकला. दक्षिण आफ्रिकेने विश्वचषकातील चौथ्या विजयाची नोंद केली. या विजयासह दक्षिण आफ्रिकेने उपांत्य फेरीकडे वाटचाल केली आहे. दक्षिण आफ्रिकेने पाच सामन्यात चार विजय मिळवत आठ गुणांची कमाई केली. चौथ्या विजयासह दक्षिण आफ्रिकेने दुसऱ्या क्रमांकावर झेप घेतली. न्यूझीलंडचा संघ तिसऱ्या क्रमांकावर घसरला आहे. या सामन्याआधी दक्षिण आफ्रिका तिसऱ्या तर न्यूझीलंड दुसऱ्या क्रमांकावर होता. बांगलादेशचा 149 धावांनी दारुण पराभव केल्यामुळे दक्षिण आफ्रिकेचा रनरेटही सुधारला आहे. आफ्रिकेच्या विराट विजयानंतर गुणतालिकेत मोठा फेरबदल झालाय.  दक्षिण आफ्रिकेनं बांगलादेशचा 149 धावांनी धुव्वा उडवून, विश्वचषकाच्या मोहिमेत चौथा विजय साजरा केला. दक्षिण आफ्रिकेनं पाचपैकी चार सामने जिंकून आठ गुणांची कमाई केली असून, विश्वचषकाच्या गुणतालिकेत दक्षिण आफ्रिका दुसऱ्या स्थानावर आहे. मुंबईतल्या सामन्यात दक्षिण आफ्रिकेनं बांगलादेशला विजयासाठी 383 धावांचं आव्हान दिलं होतं. त्या आव्हानाचा पाठलाग करताना बांगलादेशचा अख्खा डाव 47 व्या षटकांत 233 धावांत आटोपला. या सामन्यात क्विन्टॉन डी कॉकनं 174 धावांची खेळी करून दक्षिण आफ्रिकेच्या डावाचा पाया घातला. त्यानं 140 चेंडूंमधली ही खेळी 15 चौकार आणि सात षटकारांनी सजवली. डी कॉकनं एडन मारक्रमच्या साथीनं तिसऱ्या विकेटसाठी 131 धावांची, तर हेन्ऱिक क्लासेनच्या साथीनं चौथ्या विकेटसाठी १४२ धावांची भागीदारी केली. मारक्रमनं 69 चेंडूंत 60 धावांची आणि क्लासेननं 49 चेंडूंमध्ये 90 धावांची खेळी उभारली. क्लासेननं 90 धावांच्या खेळीला दोन चौकार आणि आठ षटकारांचा साज चढवला. महमदुल्लाहची एकाकी झुंज, आफ्रिकन तोफेचा केला समर्थपणे सामना -  383 धावांचा पाठलाग करताना बांगलादेशची सुरुवात अतिशय दैयनिय झाली. पण अनुभवी महमदुल्लाह याने एकाकी झुंज दिली. महमदुल्लाह  याने 111 धावांची झंझावती शतकी खेळी केली. त्याने आपल्या डावात चार षटकार आणि 11 चौकार लगावले. महमदुल्लाह याचा अपवाद वगळता एकाही फलंदाजाला मोठी खेळी करता आली नाही. त्यामुळे शाकिब अल हसनच्या बांगलादेशला मोठ्या पराभवाचा सामना करावा लागला.  बांगलादेशसाठी तंजीद हसन याने 17 चेंडूत 22 धावा केल्या. तर लिटन दास याने 44 चेंडूत 22 धावांचे योगदान दिलेय.  नजमुल हौसेन शांतो, शाकिब अल हसन, मुस्ताफिजुर रहमान, मेंहदी हसन मिराज आणि नसुम अहमद यांनी अनुक्रमे 0, 1, 8, 11 आणि 19 धावा केल्या. या फलंदाजांना मोठी खेळी करता आली नाही. बांगलादेशचे आठ फलंदाज 159 धावांत तंबूत परतले होते. पण महमदुल्लाह  याने एकाकी झुंज दिली. बांगलादेशचा संघ 233 धावांपर्यंत पोहचवला.   दक्षिण आफ्रिकेच्या गोलंदाजाची कामगिरी कशी राहिली ? दक्षिण आफ्रिकेच्या गोलंदाजांनी भेदक मारा केला. गेराल्ड कौटजी सर्वात यशस्वी गोलंदाज ठरला.  गेराल्ड कौटजी याने 10 षटकात 62 धावांच्या मोबदल्यात तीन विकेट घेतल्या. त्याशिवाय मार्को यॉन्सेन, लिडाज विलियम्स, आणि कगिसो रबाडा यांनी प्रत्येकी दोन दोन विकेट घेतल्या. केशव महाराज याने एक विकेट घेतली. ","content":"SA vs BAN Match Report : दक्षिण आफ्रिका संघाची विश्वचषकातील घौडदौड सुरुच आहे. दक्षिण आफ्रिकेने आज बांगलादेशचा 149 धावांच्या अंतराने मोठा पराभव केला. 383 धावांचा पाठलाग करताना बांगलादेशचा संघ 46.4 षटकात 233 धावांपर्यंत मजल मारु शकला. दक्षिण आफ्रिकेने विश्वचषकातील चौथ्या विजयाची नोंद केली. या विजयासह दक्षिण आफ्रिकेने उपांत्य फेरीकडे वाटचाल केली आहे. दक्षिण आफ्रिकेने पाच सामन्यात चार विजय मिळवत आठ गुणांची कमाई केली. चौथ्या विजयासह दक्षिण आफ्रिकेने दुसऱ्या क्रमांकावर झेप घेतली. न्यूझीलंडचा संघ तिसऱ्या क्रमांकावर घसरला आहे. या सामन्याआधी दक्षिण आफ्रिका तिसऱ्या तर न्यूझीलंड दुसऱ्या क्रमांकावर होता. बांगलादेशचा 149 धावांनी दारुण पराभव केल्यामुळे दक्षिण आफ्रिकेचा रनरेटही सुधारला आहे. आफ्रिकेच्या विराट विजयानंतर गुणतालिकेत मोठा फेरबदल झालाय. दक्षिण आफ्रिकेनं बांगलादेशचा 149 धावांनी धुव्वा उडवून, विश्वचषकाच्या मोहिमेत चौथा विजय साजरा केला. दक्षिण आफ्रिकेनं पाचपैकी चार सामने जिंकून आठ गुणांची कमाई केली असून, विश्वचषकाच्या गुणतालिकेत दक्षिण आफ्रिका दुसऱ्या स्थानावर आहे. मुंबई तल्या सामन्यात दक्षिण आफ्रिकेनं बांगलादेशला विजयासाठी 383 धावांचं आव्हान दिलं होतं. त्या आव्हानाचा पाठलाग करताना बांगलादेशचा अख्खा डाव 47 व्या षटकांत 233 धावांत आटोपला. या सामन्यात क्विन्टॉन डी कॉकनं 174 धावांची खेळी करून दक्षिण आफ्रिकेच्या डावाचा पाया घातला. त्यानं 140 चेंडूंमधली ही खेळी 15 चौकार आणि सात षटकारांनी सजवली. डी कॉकनं एडन मारक्रमच्या साथीनं तिसऱ्या विकेटसाठी 131 धावांची, तर हेन्ऱिक क्लासेनच्या साथीनं चौथ्या विकेटसाठी १४२ धावांची भागीदारी केली. मारक्रमनं 69 चेंडूंत 60 धावांची आणि क्लासेननं 49 चेंडूंमध्ये 90 धावांची खेळी उभारली. क्लासेननं 90 धावांच्या खेळीला दोन चौकार आणि आठ षटकारांचा साज चढवला. महमदुल्लाहची एकाकी झुंज, आफ्रिकन तोफेचा केला समर्थपणे सामना - 383 धावांचा पाठलाग करताना बांगलादेशची सुरुवात अतिशय दैयनिय झाली. पण अनुभवी महमदुल्लाह याने एकाकी झुंज दिली. महमदुल्लाह याने 111 धावांची झंझावती शतकी खेळी केली. त्याने आपल्या डावात चार षटकार आणि 11 चौकार लगावले. महमदुल्लाह याचा अपवाद वगळता एकाही फलंदाजाला मोठी खेळी करता आली नाही. त्यामुळे शाकिब अल हसनच्या बांगलादेशला मोठ्या पराभवाचा सामना करावा लागला. बांगलादेशसाठी तंजीद हसन याने 17 चेंडूत 22 धावा केल्या. तर लिटन दास याने 44 चेंडूत 22 धावांचे योगदान दिलेय. googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); नजमुल हौसेन शांतो, शाकिब अल हसन, मुस्ताफिजुर रहमान, मेंहदी हसन मिराज आणि नसुम अहमद यांनी अनुक्रमे 0, 1, 8, 11 आणि 19 धावा केल्या. या फलंदाजांना मोठी खेळी करता आली नाही. बांगलादेशचे आठ फलंदाज 159 धावांत तंबूत परतले होते. पण महमदुल्लाह याने एकाकी झुंज दिली. बांगलादेशचा संघ 233 धावांपर्यंत पोहचवला. दक्षिण आफ्रिकेच्या गोलंदाजाची कामगिरी कशी राहिली ? दक्षिण आफ्रिकेच्या गोलंदाजांनी भेदक मारा केला. गेराल्ड कौटजी सर्वात यशस्वी गोलंदाज ठरला. गेराल्ड कौटजी याने 10 षटकात 62 धावांच्या मोबदल्यात तीन विकेट घेतल्या. त्याशिवाय मार्को यॉन्सेन, लिडाज विलियम्स, आणि कगिसो रबाडा यांनी प्रत्येकी दोन दोन विकेट घेतल्या. केशव महाराज याने एक विकेट घेतली.","pubDate":"2023-10-24 17:38:16","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/10/24/0f141fd118c1810f667feec751604dda169816736956176_original.jpg","source_id":"abplive","source_priority":10959,"country":["india"],"category":["sports"],"language":"marathi"},{"article_id":"9b129a07be81184f8c04bac550458006","title":"SA vs BAN HIGHLIGHTS, World Cup 2023: Quinton De Kock's 174 Sets Up Proteas Massive Win Over Bangladesh","link":"https://news.abplive.com/sports/cricket/sa-vs-ban-highlights-south-africa-beat-bangladesh-by-149-runs-wankhede-stadium-mumbai-icc-cricket-world-cup-2023-1638095","keywords":["Cricket"],"creator":["ABP News Bureau"],"video_url":null,"description":"SA vs BAN, World Cup 2023: South Africa beat Bangladesh by 149 runs in match number 23 of the ICC Men's Cricket World Cup 2023 at the Wankhede Stadium in Mumbai on Tuesday (October 24). The Proteas won the toss and elected to bat first on a flat Mumbai wicket. Quinton de Kock was the star with the bat for South Africa as he slammed his third hundred of this World Cup, making a dominant 174 off 140 deliveries taking them to a strong total of 382/5. In response, Bangladesh never really got going and were bowled out for 233 despite Mahmudullah's 111 off 111 balls.Other than De Kock's 174, Heinrich Klaasen too continued his superb form in the tournament and scored 90 off just 49 balls with some breathtaking strokes during the innings. Aiden Markram, South Africa's stand-in skipper, also scored a half-century making 60 off 69 balls. For Bangladesh, Hasan Mahmud was the pick of the bowlers with figures of 2 for 67. Shakib Al Hasan, Shoriful Islam and Mehidy Hasan Miraz picked up a wicket each.After their dominating performance with the bat, they were clinical with the ball in hand too with Gerald Coetzee emerging as the highest wicket-taker for the team, finishing with 3 for 62. Marco Jansen, Lizaad Williams and Kagiso Rabada scalped two wickets apiece while Keshav Maharaj was also impressive picking 1 for 32 off his 10 overs. It could have been an even more handsome victory for the Proteas who move to the second position on the table with 8 points from 5 matches and a net run rate of +2.370 had it not been for the 68-run stand between Mahmudullah and Mustafizur Rahaman, a partnership which ensured that Mahmudullah get to his century and the Bangla Tigers reduce the deficit of their margin.After the match, De Kock was adjudged the Player of the Match who described the experience as being more tiring than satisfactory. All three of his World Cup tons have come in this edition and in a format from which he has already announced retirement at the end of this campaign.","content":"googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); SA vs BAN, World Cup 2023: South Africa beat Bangladesh by 149 runs in match number 23 of the ICC Men's Cricket World Cup 2023 at the Wankhede Stadium in Mumbai on Tuesday (October 24). The Proteas won the toss and elected to bat first on a flat Mumbai wicket. Quinton de Kock was the star with the bat for South Africa as he slammed his third hundred of this World Cup, making a dominant 174 off 140 deliveries taking them to a strong total of 382/5. In response, Bangladesh never really got going and were bowled out for 233 despite Mahmudullah's 111 off 111 balls. Other than De Kock's 174, Heinrich Klaasen too continued his superb form in the tournament and scored 90 off just 49 balls with some breathtaking strokes during the innings. Aiden Markram, South Africa's stand-in skipper, also scored a half-century making 60 off 69 balls. For Bangladesh, Hasan Mahmud was the pick of the bowlers with figures of 2 for 67. Shakib Al Hasan, Shoriful Islam and Mehidy Hasan Miraz picked up a wicket each. After their dominating performance with the bat, they were clinical with the ball in hand too with Gerald Coetzee emerging as the highest wicket-taker for the team, finishing with 3 for 62. Marco Jansen, Lizaad Williams and Kagiso Rabada scalped two wickets apiece while Keshav Maharaj was also impressive picking 1 for 32 off his 10 overs. It could have been an even more handsome victory for the Proteas who move to the second position on the table with 8 points from 5 matches and a net run rate of +2.370 had it not been for the 68-run stand between Mahmudullah and Mustafizur Rahaman, a partnership which ensured that Mahmudullah get to his century and the Bangla Tigers reduce the deficit of their margin. After the match, De Kock was adjudged the Player of the Match who described the experience as being more tiring than satisfactory. All three of his World Cup tons have come in this edition and in a format from which he has already announced retirement at the end of this campaign.","pubDate":"2023-10-24 17:31:23","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/10/24/d1a1b55d935567a84ad5086c578b4fb51698168590855625_original.jpg","source_id":"abplive","source_priority":10959,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"8024783c231dee783675d5330602e987","title":"World Cup 2023, SA vs BAN: విజయాల బాట పట్టిన సౌతాఫ్రికా, బంగ్లాదేశ్‌పై 149 పరుగుల భారీ తేడాతో దక్షిణాఫ్రికా విజయం..","link":"https://telugu.latestly.com/sports/cricket/world-cup-2023-sa-vs-ban-south-africa-who-are-on-a-winning-streak-beat-bangladesh-by-a-huge-margin-of-149-runs-112923.html","keywords":null,"creator":null,"video_url":null,"description":"నెదర్లాండ్స్‌పై ఓటమి తర్వాత కసితో సౌతాఫ్రికా జట్టు మరోసారి విజయాల బాట పట్టింది. బంగ్లాదేశ్‌తో జరిగిన 5వ మ్యాచ్‌లో దక్షిణాఫ్రికా 149 పరుగుల భారీ తేడాతో విజయం సాధించింది.","content":"నెదర్లాండ్స్‌పై ఓటమి తర్వాత కసితో సౌతాఫ్రికా జట్టు మరోసారి విజయాల బాట పట్టింది. బంగ్లాదేశ్‌తో జరిగిన 5వ మ్యాచ్‌లో దక్షిణాఫ్రికా 149 పరుగుల భారీ తేడాతో విజయం సాధించింది. బంగ్లాదేశ్‌తో జరిగిన మ్యాచ్‌లో దక్షిణాఫ్రికా కెప్టెన్ టెంబా బావుమా టాస్ గెలిచి ముందుగా బ్యాటింగ్ ఎంచుకున్నాడు. ఫామ్‌లో ఉన్న క్వింటన్ డి కాక్ క్రీజులో స్థిరపడి 140 బంతుల్లో 7 ఫోర్లు, 15 ఫోర్ల సాయంతో 174 పరుగులతో అద్భుత ఇన్నింగ్స్ ఆడాడు. ఈ సెంచరీ తర్వాత, డి కాక్ ప్రపంచ కప్ 2023లో టాప్ స్కోరర్‌గా అవతరించడం మాత్రమే కాకుండా అనేక రికార్డులను బద్దలు కొట్టాడు. హెన్రిచ్ క్లాసెన్ తన క్లాస్‌ని ప్రదర్శించి.8 సిక్సర్లు బాది. కేవలం 49 బంతుల్లోనే 90 పరుగులు చేసి జట్టు స్కోరును పెంచాడు. ఈ ఇన్నింగ్స్‌ల కారణంగా ఆ జట్టు బంగ్లాదేశ్‌కు 383 పరుగుల భారీ లక్ష్యాన్ని నిర్దేశించింది. మెరుపు బ్యాటింగ్ అనంతరం దక్షిణాఫ్రికా బౌలర్లు సైతం బంగ్లాదేశ్ పై సింహాల్లా విరుచుకుపడ్డారు. 100 పరుగుల వ్యవధిలో బంగ్లాదేశ్ జట్టులో సగం మందిని బౌలర్లు పెవిలియన్‌కు పంపారు. అయితే జట్టు తరఫున మహ్మదుల్లా అద్భుత సెంచరీ చేసినా, జట్టును విజయపథంలో నడిపించడంలో సఫలం కాలేదు. సౌతాఫ్రికా జట్టులో గెరాల్డ్ అత్యధికంగా 3 వికెట్లు పడగొట్టాడు. Quinton de Kock, 174 ⭐ Mahmudullah, 111 🫡 A defiant century wasn’t enough to save Bangladesh after another display of South African power hitting 💪 Read the full report 📝⬇️ #SAvBAN #CWC23 https://t.co/qQX9k7IfxL — ICC Cricket World Cup (@cricketworldcup) October 24, 2023 ఈ భారీ విజయం తర్వాత దక్షిణాఫ్రికా జట్టు ప్రపంచకప్ పాయింట్ల పట్టికలో న్యూజిలాండ్‌ను దాటేసింది. కివీస్ జట్టు నిరంతరం విజయాలు సాధిస్తున్నప్పటికీ 5వ మ్యాచ్‌లో భారత్ చేతిలో ఓటమి చవిచూడాల్సి వచ్చింది. ఇప్పుడు దక్షిణాఫ్రికా 4 విజయాలతో భారత్ తర్వాత రెండో స్థానంలో నిలిచింది. Vastu Tips: వాస్తు ప్రకారం ఇంటికి ఎన్ని ద్వారాలు ఉండాలి","pubDate":"2023-10-24 19:28:24","image_url":null,"source_id":"latestly","source_priority":5523,"country":["india"],"category":["sports"],"language":"telugu"},{"article_id":"5c3dca5a4c355752c38c400c183eb284","title":"Afghanistan making waves at Cricket World Cup while England is barely hanging on","link":"https://torontosun.com/sports/other-sports/afghanistan-making-waves-at-world-cup","keywords":["Other Sports","Sports"],"creator":["Norm Da Costa"],"video_url":null,"description":null,"content":"A country in constant turmoil. That’s the only way the world sees Afghanistan. But in the past 10 days, Afghanistan has been synonymous with cricket and giant-killing. First, it turned the tables on England — a country that not only introduced the game to the world, but also to Afghanistan in the 1830s. After England, it was the turn of their neighbours Pakistan to feel the bite of the scorpion. Many of the Afghanis got hooked on their love of the game in Pakistani refugee camps during the decades of war when the Russians ran roughshod over the country. Now little-known Afghanistan has taken the World Cup being played in India by the scruff of its neck and given it a violent shake, and two recipients of the Afghani insurrection have been England and Pakistan. Following the loss to the Afghanis, defending champion England is hanging on by a thread and mighty Pakistan, after starting with two straight wins, finds itself in the same position as the tournament reaches the halfway mark. The only team at this stage with an unbeaten record at 5-0 is Rohit Sharma’s India following an exciting victory over New Zealand, at the time the only other unbeaten team in the competition. Prior to this clash of the two squads with a clean sheet, India had not been able to defeat the Kiwis since 2005. But on this occasion, a brilliant knock of 95 by Virat Kohli and a five-wicket haul by paceman Mohammed Shami ended the streak. On a wild weekend just after the Afghanis stunned England, it was the turn of South Africa to obliterate England and take a step toward the semifinals. The Proteas trounced England by a whopping 229 runs at the heat dome known as Mumbai’s Wankhede Stadium, where the needle hit 37C with the humidity at around 46%. But England could not stand the heat after South Africa posted 399 for seven and were then dismissed for a woeful 170 in 22 overs. The champions can still qualify for the semifinals, but likely will have to win all five of their remaining group matches. The chances of that happening are as rare as Toronto being spared of snow this winter. The highlight of South Africa’s innings was Heinrich Klaasen smashing a 61-ball hundred and Marco Jansen 75 from 42 balls. Klassen was gasping for breath during his epic century with sweat dripping from his cap. Having been fried in the field, England’s batsmen had no answer to the Proteas attack in which new fast bowler Gerald Coetzee excelled with three for 35. England stumbled from 68 for six to 100 for eight and some wild hitting by Mark Wood (43 not out) and Gus Atkinson (35) with nothing to lose laid the lumber. England’s wobbly campaign continues against Sri Lanka on Thursday before facing India and Australia. Meanwhile, South Africa, with the most powerful batting lineup in the World Cup, posted 382 for five against Bangladesh on Tuesday with opener Quinton de Kock hitting a massive 174 that was laced with 15 fours and seven sixes. Other big scorers were Klassen, who made 90, and Aiden Markham 60. Bangladesh’s Mohammad Mahmudullah then stroked a brilliant 111 in a losing cause as it folded for 233 to go down by a massive 149 runs. South Africa has now emerged as a big threat to India. Meanwhile, Afghanistan defeated Pakistan for the first time in an ODI by eight wickets by pulling off its highest successful chase in this thriller in Chennai. Pakistan posted 282 for seven and this looked like a solid total but the Afghans hit back with 286 for two with an over to spare. For the Afghans, Ibrahim Zadran made 87, Rahmanullah Gurbaz smacked 65 and Rahmat Shah struck 77 not out as Afghanistan moved up to sixth in the standings while England dropped to last in the table. While Afghanistan has two of the best spinners in the world, it was teenage wrister Noor Ahmad who starred with three for 49. There was joy across Afghanistan following these two victories. “You know the situation in Afghanistan, it’s very depressing,” 25-year-old Abdul Wahab, who manages a Kabul medical centre, told a news agency. “The only excuse to forget everything is cricket.” Australia may be forgotten, but don’t ever rule them out for mounting a late challenge. The Aussies, who have a 2-2 record, plundered Pakistan’s attack for 367 for nine in Bengaluru and then restricted Pakistan for 305 thanks to spinner Adam Zampa’s four for 53. Aussie openers David Warner and Mitchell Marsh burst into life with centuries to put on 259 for the first wicket. Warner made 163 off 124 balls and Marsh clobbered 121 off 108 deliveries with Shaheen Afridi the pick of the Pakistani bowlers with five for 54. Former India captain Bishan Singh Bedi, who was known for being part of a famous spin quartet, has died at the age of 77, the Board of Control for Cricket in India (BCCI) announced. Bedi, leg spinner Bhagwat Chandrasekhar and off-spinners Srinivas Venkataraghavan and Erapalli Prasanna were regarded the country’s most potent bowling force in the 1960s and ’70s. Check out our sports section for the latest news and analysis.","pubDate":"2023-10-24 18:28:13","image_url":"https://smartcdn.gprod.postmedia.digital/torontosun/wp-content/uploads/2023/10/1025cricket-afghanistan-scaled-e1698171119903.jpg?quality=100&strip=all","source_id":"torontosun","source_priority":12198,"country":["canada"],"category":["sports"],"language":"english"},{"article_id":"15cd66399fccd682e4b0c00618506ba7","title":"दक्षिण आफ्रिकेनं बांगलादेशचा 149 धावांनी उडवला धुव्वा","link":"https://marathi.abplive.com/photo-gallery/sports/cricket-south-africa-vs-bangladesh-highlights-world-cup-2023-mahmudullah-smacks-ton-but-sa-wrap-up-149-run-win-at-wankhede-1222131","keywords":["क्रिकेट"],"creator":["पीटीआय वृत्तसंस्था"],"video_url":null,"description":"दक्षिण आफ्रिकेनं बांगलादेशचा 149 धावांनी उडवला धुव्वा","content":"दक्षिण आफ्रिकेनं बांगलादेशचा 149 धावांनी धुव्वा उडवून, विश्वचषकाच्या मोहिमेत चौथा विजय साजरा केला. दक्षिण आफ्रिकेनं पाचपैकी चार सामने जिंकून आठ गुणांची कमाई केली असून, विश्वचषकाच्या गुणतालिकेत दक्षिण आफ्रिका दुसऱ्या स्थानावर आहे. मुंबईतल्या सामन्यात दक्षिण आफ्रिकेनं बांगलादेशला विजयासाठी 383 धावांचं आव्हान दिलं होतं. त्या आव्हानाचा पाठलाग करताना बांगलादेशचा अख्खा डाव 47 व्या षटकांत 233 धावांत आटोपला. या सामन्यात क्विन्टॉन डी कॉकनं 174 धावांची खेळी करून दक्षिण आफ्रिकेच्या डावाचा पाया घातला. क्विन्टॉन डी कॉकनं 174 धावांची खेळी करून दक्षिण आफ्रिकेच्या डावाचा पाया घातला. त्यानं 140 चेंडूंमधली ही खेळी 15 चौकार आणि सात षटकारांनी सजवली. डी कॉकनं एडन मारक्रमच्या साथीनं तिसऱ्या विकेटसाठी 131 धावांची, तर हेन्ऱिक क्लासेनच्या साथीनं चौथ्या विकेटसाठी 142 धावांची भागीदारी केली. मारक्रमनं 69 चेंडूंत 60 धावांची आणि क्लासेननं 49 चेंडूंमध्ये 90 धावांची खेळी उभारली. क्लासेननं 90 धावांच्या खेळीला दोन चौकार आणि आठ षटकारांचा साज चढवला. दक्षिण आफ्रिकेने विश्वचषकातील चौथ्या विजयाची नोंद केली. या विजयासह दक्षिण आफ्रिकेने उपांत्य फेरीकडे वाटचाल केली आहे. दक्षिण आफ्रिकेने पाच सामन्यात चार विजय मिळवत आठ गुणांची कमाई केली. चौथ्या विजयासह दक्षिण आफ्रिकेने दुसऱ्या क्रमांकावर झेप घेतली. न्यूझीलंडचा संघ तिसऱ्या क्रमांकावर घसरला आहे. या सामन्याआधी दक्षिण आफ्रिका तिसऱ्या तर न्यूझीलंड दुसऱ्या क्रमांकावर होता. बांगलादेशचा 149 धावांनी दारुण पराभव केल्यामुळे दक्षिण आफ्रिकेचा रनरेटही सुधारला आहे. आफ्रिकेच्या विराट विजयानंतर गुणतालिकेत मोठा फेरबदल झालाय. Points Table : आफ्रिकेची दुसऱ्या स्थानावर झेप, बांगलादेशचा पराभव झाल्यानंतर गुणतालिकेत मोठा बदल","pubDate":"2023-10-24 18:12:36","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/10/24/d158e7431fc89145a99cd51154420d6e169816975458478_original.jpg","source_id":"abplive","source_priority":10959,"country":["india"],"category":["sports"],"language":"marathi"},{"article_id":"0e8c99c264a479fddf4b247c6f81fc0c","title":"Man United vs Copenhagen - Champions League LIVE: Red Devils to pay tribute at first home game since Sir Bobby Charlton's passing","link":"https://www.dailymail.co.uk/sport/live/article-12665549/Man-United-vs-Copenhagen-Champions-League-2023-24-Latest-Result.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Follow Mail Sport's live blog for all the latest updates from Old Trafford as Manchester United host Copenhagen in the Champions League.","content":"LIVE Man United vs Copenhagen - Champions League LIVE: Red Devils to pay tribute at first home game since Sir Bobby Charlton's passing By Samuel Draper For Mailonline Published: 18:30, 24 October 2023 | Updated: 19:43, 24 October 2023 e-mail 12 View comments Follow Mail Sport's live blog for all the latest updates from Old Trafford as Manchester United host Copenhagen in the Champions League . 18:35 Ian Herbert: Man City fans should respect Sir Bobby The focus is naturally on the Champions League tonight - but it's inevitable that there will always be one eye on the Manchester derby this Sunday. Mail Sport's Ian Herbert calls on Man City fans to respect what Sir Bobby Charlton did to put Manchester on the map, despite the rivalry of the two clubs. IAN HERBERT: Is it beyond City fans to respect Sir Bobby? IAN HERBERT: It's perhaps inevitable that Manchester City are barely represented in the sea of flowers presently laid at the front of Old Trafford. Mail Online 18:29 Bayern have moved 3-1 up in the other group game About three minutes to go in Turkey, plus stoppages, but it looks like Bayern will make it three wins from three in Group A. Galatasaray have four points, and Copenhagen have one. The pressure is on Man United now. 18:28 Can Erik ten Hag do the job on the pitch? It feels like there's a new off the field situation for Man United to navigate every few days, but can Erik ten Hag focus on the job required on the pitch and get their Champions League campaign going? 18:25 A special occasion for Man United's Dane Rasmus Hojlund used to play for Copenhagen, before moving across Europe to further his career, and now they're coming to Old Trafford. 18:09 Background on Copenhagen Copenhagen began their group stage with a 2-2 draw in Turkey on Matchday 1, but lost 2-1 at home to Bayern Munich three weeks ago. Since the Bayern game, they have drawn 1-1 at AGF, and then won 2-1 at home to Vejle BK in the league on Saturday. 18:06 Man United vs Copenhagen in the past This is the fourth meeting between the two teams. They shared one win each in the 2006-7 Champions League group stage, which was Copenhagen's first ever win in the competition. Man United got the better of the Danes in the UEFA Europa League quarter-final in August 2020. They'll be desperate to get a third win on the board tonight, and get their first points of the group stage this year. 18:02 An hour to go There'll be club tributes to Sir Bobby Charlton in the run up to kick-off. 17:59 Copenhagen team news Copenhagen have also confirmed their starting 11 for the match tonight, led by captain Viktor Claesson. Rasmus Hojlund's younger brother Oscar is named among the substitutes for the Danish Superliga champions. 17:56 How to follow the rest of the Champions League action tonight It's not just Man United in action tonight - Spencer Morgan is on blog duties for Arsenal's trip to Sevilla, as well as the other games going on tonight across the Champions League. In Man United's group, Galatasaray and Bayern are currently drawing 1-1, but I'll keep you updated if that score changes. They've just started the second half in Turkey. Sevilla vs Arsenal - Champions League: Latest scores updates Follow Mail Sport's live blog for all the latest updates from Ramon Sanchez-Pizjuan Stadium as Sevilla host Arsenal in the Champions League . Mail Online 17:48 Man United team news - two changes for Erik ten Hag's side Following Saturday night's 2-1 win at Sheffield United, Erik ten Hag has made two changes to his starting 11. Raphael Varane and Sergio Reguilon come into the side for today's game against Copenhagen. Jonny Evans and Victor Lindelof both miss out, but they are available options to the manager from the bench. 17:44 Adam Shergold on Man United's priorities Mail Sport's Adam Shergold laid down some of Man United's priorities coming into this clash with Copenhagen. After high-scoring defeats to Bayern Munich and Galatasaray, it's time for Erik ten Hag's side to get some points - and confidence - on the European stage. Ten Hag's priorities ahead of Man United's must-win Copenhagen clash Never before have they lost the opening two games of a Champions League group and another defeat would probably mean Europa League at best after Christmas . Mail Online 17:41 Patrick Collins on an English hero Patrick Collins wrote about Sir Bobby Charlton for the Mail on Sunday - an English hero that many admired and wanted their children to imitate. 17:36 Hello and welcome to Man United vs Copenhagen Hello and welcome to Mail Sport's live blog covering Man United's Champions League game against Copenhagen at Old Trafford. Kick off is at 8pm local time, or in just under an hour and a half. We'll have all the team news and action. It is the club's first home game since the death of Sir Bobby Charlton, and we're expecting a great reaction to pay tribute to one of Man United's all-time greats. Key Updates Copenhagen team news View post How to follow the rest of the Champions League action tonight View post Man United team news - two changes for Erik ten Hag's side View post TOP STORIES MAN UNITED CONFIDENTIAL: Ten Hag's tributes to Sir Bobby are a far cry from Mourinho's Munich memorial display... while new book claims Glazers considered giving fans who sang loudly free tickets Wayne Rooney recalls 'moving and emotional' Munich disaster talk from Sir Bobby Charlton to Man United players in 2008, as he adjusts to new role as Birmingham City manager Sevilla vs Arsenal - Champions League LIVE: Mikel Arteta's side are desperate to pick up a vital win in Spain following their shock defeat to Lens IAN HERBERT: Is it beyond City fans to respect Sir Bobby, who helped put Manchester on the map? Manchester United legends including Gary Neville and Brian Kidd join current squad and boss Erik ten Hag in signing messages of condolence in memory of Sir Bobby Charlton How Bobby and Jack Charlton ended their painful feud of 42 years with a heartfelt hug after falling out over their mum Cissie - as real reason Bobby didn't go to Jack's funeral is revealed In-form Maguire and McTominay have to start, Hojlund must come back to haunt his old club and Man United really need to hold onto leads! Erik ten Hag's priorities for must-win Copenhagen clash Erik ten Hag will struggle to take Man United 'back to the top', claims Simon Jordan, as he brands the Red Devils boss 'a small man in a big suit' ahead of must-win Champions League clash with Copenhagen Porn star Sky Bri reveals mystery Man United footballer has been DMing her - and says he's one of a few 'pretty big players' to message her Man City's fury at fans' sick Sir Bobby Charlton chants: Man United's rivals apologise to football legend's family, as video emerges of chanting at their game shortly after he died aged 86 OLIVER HOLT: The Manchester United of Sir Bobby Charlton's era were celebrated as 'England's Team'. Now there's just sadness over a club in decay Manchester United legend's grandson scores stunning long-range goal on his EFL debut as the 21-year-old notches late winner for Notts County against Gillingham Man United can learn from Copenhagen on AND off the pitch! Champions League opponents are the 'Ajax of the North', have an outstanding recruitment programme and trade blows with Europe's elite Mail Sport launches new WhatsApp Channels: Follow for all the latest breaking news and updates about Arsenal, Manchester United, Chelsea and Liverpool today Man United news RECAP: Tributes continue to pour in for Sir Bobby Charlton as Red Devils look ahead to tonight's Champions League clash with Copenhagen Manchester United confident rival Man City fans will respect minute's applause held for Sir Bobby Charlton ahead of Sunday's derby clash Sir Bobby Charlton's last surviving brother, Tommy, 77, makes heartfelt tribute to Man United legend following his death, saying: 'If ever there was a place reserved in heaven, it is for Bob' Man United deny Jadon Sancho is set to return from his exile after fans thought Erik ten Hag said 'Sancho' and not 'Sergio' in his press conference when asked about fitness of left-back Reguilon PETE JENSON: Sevilla lack consistency but under new manager Diego Alonso and with their ability to step up in big games, the Europa League holders could cause trouble for Arsenal EXCLUSIVE: Jose Antonio Reyes' father says his son and Mikel Arteta were 'like brothers' as his family open their doors to Mail Sport ahead of an emotional night as Arsenal and Sevilla face-off in the Champions League Harry Kane on cloud nine as he sets Bayern Munich club record by scoring ninth goal in opening eight Bundesliga games in 3-1 win over Mainz Spilling the tea on your Old Trafford exit, David? De Gea meets up for a 'coffee and friends' date with his ex-Man United team-mates... but there's no room for his £47m Red Devils replacement Andre Onana at the table Marcus Rashford pays tribute to Sir Bobby Charlton after his death aged 86 by dedicating Manchester United's win against Sheffield United to the World Cup winner and his family Sir Bobby Charlton dies aged 86: England and Manchester United legend passes away surrounded by family after long battle with dementia - leaving just Sir Geoff Hurst alive from the team of heroes who won the World Cup in 1966 BRYAN ROBSON: Every kid wanted to be Sir Bobby Charlton... he was the role model for every young footballer. He will be remembered as the perfect gentlemen, the perfect player When Eddie met Kevin! Keegan and Howe - the King and Prince of Newcastle - discuss the lofty ambitions of the high-flying Magpies... and even talk up their chances of Premier League or European glory The kind of man that Englishmen dreamed that their sons might become: Bobby Charlton was a typically English hero, writes PATRICK COLLINS CHRIS WHEELER: It's fitting that Man United's first home match since Sir Bobby Charlton's passing is in the European Cup, which defined the great man Jude Bellingham has had a HUGE impact at Real Madrid while Harry Kane has been the 'perfect striker' for Bayern Munich... but which England star has made a better start to life abroad? Man United's strikeforce is STILL not in tune, it's jeepers keepers at both Arsenal and Chelsea, Liverpool have VAR to thank this time... and free midweeks are happy days for Ange Postecoglou! 10 THINGS WE LEARNED from the Premier League weekend Manchester United youngster Tyler Fletcher - son of ex-midfielder Darren - switches his international allegiance back to Scotland from England... after 16-year-old and his twin brother Jack moved from Man City in the summer Jadon Sancho's Manchester United career is '90 per cent over' with officials convinced the £73m star 'must find a new club in January'... as he remains exiled from the first team Wish you were still here? Man United captain Bruno Fernandes meets up with booted-out goalkeeper David de Gea in Manchester amid £47m Andre Onana's struggles, as fans urge the Spaniard to 'come back in January' ROB DRAPER: Sir Bobby Charlton carried memories of the Munich Air Disaster all his life. That he wasn't defined by the tragedy showed just how extraordinary he was Sir Bobby Charlton's death at the age of 86 leaves hat-trick hero Sir Geoff Hurst as the SOLE surviving member of the England team that started the 1966 World Cup final Man United hold a minute's silence for Sir Bobby Charlton before their Champions League press conference, as they plot more tributes to English football legend at matches this week Dejan Kulusevski is convinced lack of European football is 'HUGE' advantage for Tottenham over title rivals, with Spurs aiming to move five points clear at the top on Friday Luke Shaw expected to be OUT for another FIVE WEEKS, missing vital games against Man City and Copenhagen in the Champions League - but there's finally good injury news as Aaron Wan-Bissaka nears a return Chelsea 'are preparing shock January bid for Aaron Ramsdale', with Arsenal goalkeeper stuck behind David Raya in pecking order and Robert Sanchez struggling at Blues England 15-16 South Africa - Rugby World Cup semi-final RECAP: Agony for England as South Africa steal victory with a late penalty kick after leading for just TWO minutes in the game Darren England will referee his first game since his disastrous VAR error that infuriated Liverpool when he takes charge of Saturday's Severnside derby between Cardiff and Bristol City The last picture of Sir Bobby Charlton: Brave star posed for snap while taking covid jab in 2021 despite ongoing battle with dementia Rio Ferdinand calls on Manchester United players to feed off crowd atmosphere on emotional Champions League game as Old Trafford remembers Sir Bobby Charlton Pep Guardiola was WRONG to sell Cole Palmer to Chelsea, says Dominic King after the £42.5m winger scored against Arsenal... but Chris Sutton says you can't doubt the City boss' judgement as hosts clash on Mail Sport's It's All Kicking Off Ajax are likely to fail with any approach for Mitchell van der Gaag as Louis van Gaal looks to lure Manchester United assistant coach back to Holland Tottenham 2-0 Fulham - Premier League RECAP: Son Heung-min and James Maddison fire goals for Spurs in the London derby as Ange Postecoglou's side return top of the Premier League table Kepa Arrizabalaga wants to stay at Real Madrid on permanent basis after strong start, but Chelsea loanee admits 'nothing has been negotiated yet' Sheffield United 1-2 Man United - Premier League RECAP: Erik ten Hag's men seal victory on the day of Sir Bobby Charlton's passing after goals from Diogo Dalot and Scott McTominay Erik ten Hag bluntly tells Andre Onana to 'step up' and 'give better performances' after £47m goalkeeper's error-strewn start to his Man United career... but backs his ex-Ajax stopper to come good US Grand Prix - Race LIVE: Max Verstappen overtakes Lando Norris to grab the lead in Austin, with Lewis Hamilton in second Lewis Hamilton and Charles Leclerc post joint cryptic message on social media after both were disqualified from the US Grand Prix for running an illegal floor Can you recognise the Premier League cult hero jumping on the Overground to watch his former club's old rivals? EXCLUSIVE: World Rugby's new Nations Championship is given the go-ahead by the narrowest of margins in council vote - but some are warning the new international competition will be 'the death' of the sport Bill Kenwright dies aged 78: Everton chairman and legendary West End theatre impresario behind Blood Brothers, Joseph and Fame passes away days after returning home from surgery on cancerous liver tumour RIATH AL-SAMARRAI: Tottenham have handled Harry Kane's exit awfully well, but Ange Postecoglou's thin squad will be challenged when the Africa Cup of Nations and Asian Cup come around Everton star Alex Iwobi shares screenshot of the caring messages he used to get from Bill Kenwright stating how 'proud' he was of the midfielder... as he shares very personal heartfelt tribute to late chairman Former QPR co-owner Tony Fernandes is slammed as 'unprofessional' for getting a half-naked massage during a WORK MEETING - and boasting about the 'culture' on LinkedIn - before hastily deleting his post Real Madrid players rally around Vinicius Junior after the forward was racially abused by multiple Sevilla fans during LaLiga draw as Jude Bellingham declares 'always with you, brother' Wrexham owner Rob McElhenney announces new 'Parks and Wrex' development project in hilarious video with actor Chris Pratt as part of birthday gift for co-owner Ryan Reynolds Barcelona and Real Madrid are 'keeping tabs on 17-year-old French wonderkid Eli Junior Kroupi', with Lorient starlet taking Ligue 1 by storm Mike Tyson shows off his ripped physique aged 57 as the former world heavyweight champion helps MMA star Francis Ngannou prepare for his crossover fight with Tyson Fury REVEALED: World Rugby are looking into a DIFFERENT incident involving Tom Curry and Bongi Mbonambi in investigation into England 'white ****' slur - despite fans claiming South Africa star's innocence was proven Tributes flood in for Bill Kenwright following his death at the age of 78 - as Liverpool, Jamie Carragher and Wayne Rooney join the footballing world and beyond in saluting the former Everton chairman Cricketer Fawad Ahmed announces his four-month-old son has died: 'Till we meet again' Was South Africa's 'white ****' slur lost in translation? Springboks fans say Bongi Mbonambi was speaking in Afrikaans - and Google Translate shows they may have a case What are Jackson Mahomes' alleged crimes and what has he been charged with? All the latest after he was spotted with Taylor Swift to watch Travis Kelce's Chiefs win Jack Grealish meets up with his 'first football hero' at Man City's training ground... but can you recognise the iconic ex-Premier League striker? Travis Kelce has nervous 'alarms' going off in his head over new 'level of superstardom' from dating Taylor Swift, reveals his brother Jason: 'Man, this is a lot' Taylor Swift fans fume that Jackson Mahomes was allowed in the same Chiefs VIP box as pop superstar as he awaits hearing over alleged sexual battery: 'Someone get her out immediately' EXCLUSIVE: Taylor Swift and Travis Kelce arrive at the Chiefs star's mansion in his Rolls Royce for party with friends and family catered by Kansas City BBQ joint - after the loved-up pair left win over Chargers together EXCLUSIVE: Taylor Swift heads to Travis Kelce's house for lunch of turkey omelet and chicken tacos after flying in from LA on her private jet to watch her man play in a fourth Chiefs game South Africa fans uncover footage they claim proves Bongi Mbonambi's 'white ****' call is actually him shouting to team-mates in Afrikaans... but it's NOT even the incident World Rugby are investigating Kansas City Chiefs wide receiver Justyn Ross is arrested, facing felony charge of criminal damage of more than $25,000 Legendary commentator Martin Tyler set to return to the gantry four months after leaving Sky Sports to once again call a live Premier League game Tottenham fans pictured waving Israel flags during their clash against Fulham despite Premier League ban amid Palestine conflict Ireland rugby star strips down to her pineapple-print underwear at Rugby World Cup, as she celebrates 'the party' despite her nation's early exit Rapper Blueface proposes to his girlfriend in WILD day at the Rams game... after turning his private suite into a STRIP CLUB and offering rival players wads of cash to throw the game Mattress Mack loses out on 'at least $43.4 MILLION' after Houston Astros suffer 11-4 loss in deciding ALCS Game 7 to Texas Rangers Mohamed Salah IS Liverpool's greatest ever player in the Premier League era - not Steven Gerrard - claims Mail Sport's Chris Sutton on It's All Kicking Off... and believes only one player in the top-flight's history is more ruthless Tottenham 2-0 Fulham: Son Heung-min and James Maddison fire Spurs back to the top of the Premier League as Ange Postecoglou's side capitalise on defensive errors EXCLUSIVE: Ashlyn Harris loads her luggage into a taxi and heads to Newark Airport as she jets out of New York amid Ali Krieger split... after her ex-wife dropped hint she had cheated on her with new lover Sophia Bush Georgetown University women's basketball coach Tasha Butts dead at 41: Tributes pour in for former star player after two-year cancer battle Mary Lou Retton has returned HOME after 'scary setback' in her fight against rare form of pneumonia, as family reveal US Olympic legend is in 'recovery mode' after leaving the ICU Max Verstappen's model girlfriend is left SERIOUSLY unimpressed as he's booed after winning the US Grand Prix ahead of disqualified Lewis Hamilton Lionel Messi, his stunning wife, Antonela, and their three sons pose with Ed Sheeran as the forward kicks off his offseason with the pop star's concert after Inter Miami missed out on playoffs Jamie Carragher lauds 22-year-old Chelsea star for stepping up to show 'captain-like authority' against his team-mate and 'seasoned professional Raheem Sterling' during the Blues' 2-2 draw against Arsenal Footy legend's wedding EVACUATED after bushfire caused by squatters forces police to intervene EXCLUSIVE: 'I'm living like a monk... but I was a fat baby and I will be fat when I die!': Tyson Fury says his love handles will help him beat ripped Francis Ngannou - and sends a message to Oleksandr Usyk Ange Postecoglou SLAMS his Tottenham side 'for taking liberties in possession' and labels second half of 2-0 win over Fulham 'the WORST 45 minutes we've had all year'... despite going top! Arsenal break silence over all-white squad team photo after race row as they accept their women's team 'does not reflect the diversity that exists across the club' Alan Jones pictured in blackface at Wallaby 'skit night' during famous Bledisloe Cup winning tour of New Zealand Wife of Geelong star Gary Rohan has opened up about her heartbreaking miscarriage experience: 'You never think it's going to happen to you' KSI hires lawyer after controversial defeat to Tommy Fury, turning to a legal team in a bid to overturn the fight result after being more accurate with his punches New York Jets quarterback Zach Wilson enjoys bye week by jetting off to Utah for a spooky Halloween weekend with his stunning girlfriend Nicolette Dellanno... but he still can't resist picking up a football! Travis Kelce hilariously celebrates with a fist-pump as fan screams 'Let's go, Taylor's boyfriend' at him... after pop superstar Swift attended a FOURTH Chiefs game to watch him play Eagles coach Nick Sirianni gives passionate defense of controversial play many in the NFL want banned Garth Crooks names two Liverpool stars in his BBC team of the week column... but then BARELY mentions them as he uses it to lambast Luis Diaz and call for Ibrahima Konate red card Travis Kelce's dad Ed jokes Taylor Swift didn't 'get the diva memo' as he praises the 'very smart' and 'special' pop star amid her fledgling romance with his Kansas City Chiefs star son Champions League Sir Bobby Charlton Share or comment on this article: Man United vs Copenhagen - Champions League LIVE: Red Devils to pay tribute at first home game since Sir Bobby Charlton's passing e-mail The more I listen to Rio Ferdinand the harder it i... by ucanotbserious 11 Add comment Comments 17 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-10-24 18:09:57","image_url":"https://i.dailymail.co.uk/1s/2023/10/24/10/76836695-0-image-a-17_1698140752943.jpg","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"c149c705a34f8dcc8533242bf4474316","title":"Sevilla vs Arsenal - Champions League LIVE: Mikel Arteta's side are desperate to pick up a vital win in Spain following their shock defeat to Lens","link":"https://www.dailymail.co.uk/sport/live/article-12665591/Sevilla-vs-Arsenal-Champions-League-2023-24-Latest-Result.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Follow Mail Sport's live blog for all the latest updates from Ramon Sanchez-Pizjuan Stadium as Sevilla host Arsenal in the Champions League .","content":"LIVE Sevilla vs Arsenal - Champions League LIVE: Mikel Arteta's side are desperate to pick up a vital win in Spain following their shock defeat to Lens By Spencer Morgan For Mailonline Published: 18:32, 24 October 2023 | Updated: 19:43, 24 October 2023 e-mail 7 View comments Follow Mail Sport's live blog for all the latest updates from Ramon Sanchez-Pizjuan Stadium as Sevilla host Arsenal in the Champions League . 18:32 30 minutes to kick-off 18:26 Sevilla not in the best form The Spanish side sit 13th in LaLiga with just two wins from their opening nine matches while they have failed to win either of their first two games in Europe. However, Saturday's 1-1 draw with Real Madrid should give them some cofidence. 18:09 Sevilla team news 18:03 Arsenal team news One change from Saturday as Tomiyasu replaces Zinchenko. Starting XI: Raya; White, Saliba, Gabriel, Tomiyasu; Jorginho, Rice, Ødegaard: Saka, Martinelli, Jesus. Subs: Ramsdale, Hein, Zinchenko, Cedric, Kiwior, Elneny, Havertz, Vieira, Smith Rowe, Trossard, Nelson, Nketiah. 17:59 The Gunners have arrived Mikel Arteta's men are in the building. 17:53 No Partey tonight The midfielder has not travelled to Spain with the squad... 17:48 The stage is set 17:39 State of play The Gunners sit second with three points following their emphatic 4-0 victory over PSV and surprise 2-1 defeat to Lens. Sevilla sit third with draws in their opening two matches. Lens top the group with four points. 17:34 Good evening! And welcome to Mail Sport's live coverage of Sevilla vs Arsenal in the Champions League. Group B is finely poised andthe gunners will be in trouble if they don't a result tonight. Team news to follow with kick-off at 8pm. TOP STORIES EXCLUSIVE: Jose Antonio Reyes' father says his son and Mikel Arteta were 'like brothers' as his family open their doors to Mail Sport ahead of an emotional night as Arsenal and Sevilla face-off in the Champions League Harry Kane on cloud nine as he sets Bayern Munich club record by scoring ninth goal in opening eight Bundesliga games in 3-1 win over Mainz Mikel Arteta rejects Gary Neville's claim that David Raya is struggling with the pressure of replacing Aaron Ramsdale as Arsenal goalkeeper after his errors in the draw at Chelsea Former Liverpool midfielder Suso on training with a teenage Martin Odegaard, his scouse 'family' and winning two Europa Leagues with Sevilla ahead of Champions League clash with Arsenal PETE JENSON: Sevilla lack consistency but under new manager Diego Alonso and with their ability to step up in big games, the Europa League holders could cause trouble for Arsenal Man United vs Copenhagen - Champions League LIVE: Red Devils to pay tribute at first home game since Sir Bobby Charlton's passing Dejan Kulusevski is convinced lack of European football is 'HUGE' advantage for Tottenham over title rivals, with Spurs aiming to move five points clear at the top on Friday Chelsea 'are preparing shock January bid for Aaron Ramsdale', with Arsenal goalkeeper stuck behind David Raya in pecking order and Robert Sanchez struggling at Blues Hoping for a miracle at the bottom of the North Sea: Divers are sent down to check for signs of life inside sunken British cargo ship after it collided with second vessel leaving one dead and four missing off Germany Mail Sport launches new WhatsApp Channels: Follow for all the latest breaking news and updates about Arsenal, Manchester United, Chelsea and Liverpool today MAN UNITED CONFIDENTIAL: Ten Hag's tributes to Sir Bobby are a far cry from Mourinho's Munich memorial display... while new book claims Glazers considered giving fans who sang loudly free tickets Third executive at Russian oil giant that criticised Putin's invasion of Ukraine dies suddenly British cargo ship sinks: Moment P&O passengers are told their cruiser is joining hunt for 'people in the water' after bulk carrier crash that left one dead and four missing off Germany Pep Guardiola was WRONG to sell Cole Palmer to Chelsea, says Dominic King after the £42.5m winger scored against Arsenal... but Chris Sutton says you can't doubt the City boss' judgement as hosts clash on Mail Sport's It's All Kicking Off Scientists are studying a 116-year-old San Francisco-born grandma who is the oldest woman in the world to learn her secrets and develop cures for diseases Everton star Alex Iwobi shares screenshot of the caring messages he used to get from Bill Kenwright stating how 'proud' he was of the midfielder... as he shares very personal heartfelt tribute to late chairman Tiny brewery in historic pub is 'threatened' by £15billion car giant Mercedes Benz over beer label the car giant says is too similar to its logo Arsenal break silence over all-white squad team photo after race row as they accept their women's team 'does not reflect the diversity that exists across the club' In-form Maguire and McTominay have to start, Hojlund must come back to haunt his old club and Man United really need to hold onto leads! Erik ten Hag's priorities for must-win Copenhagen clash Queen Letizia of Spain looks pensive as she visits Tenerife with King Felipe to learn how the area has been impacted by ongoing forest fires Chantelle Houghton flaunts her 4st weight loss in a yellow bikini as she hits the beach in Marbella - after claiming Big Brother 'ruined' her life Erik ten Hag will struggle to take Man United 'back to the top', claims Simon Jordan, as he brands the Red Devils boss 'a small man in a big suit' ahead of must-win Champions League clash with Copenhagen Can you recognise the Premier League cult hero jumping on the Overground to watch his former club's old rivals? When Eddie met Kevin! Keegan and Howe - the King and Prince of Newcastle - discuss the lofty ambitions of the high-flying Magpies... and even talk up their chances of Premier League or European glory Man United's strikeforce is STILL not in tune, it's jeepers keepers at both Arsenal and Chelsea, Liverpool have VAR to thank this time... and free midweeks are happy days for Ange Postecoglou! 10 THINGS WE LEARNED from the Premier League weekend Jude Bellingham has had a HUGE impact at Real Madrid while Harry Kane has been the 'perfect striker' for Bayern Munich... but which England star has made a better start to life abroad? Alex Scott cuts a casual figure as she leaves radio studios - after wishing 'secret girlfriend' Jess Glynne a happy birthday in sweet post Chelsea 2-2 Arsenal - Premier League RECAP: Leandro Trossard sneaks in at the back post to tuck home and complete Gunners' unlikely comeback... as Blues surrender a two-goal lead Jadon Sancho's Manchester United career is '90 per cent over' with officials convinced the £73m star 'must find a new club in January'... as he remains exiled from the first team Jack Grealish meets up with his 'first football hero' at Man City's training ground... but can you recognise the iconic ex-Premier League striker? Man United can learn from Copenhagen on AND off the pitch! Champions League opponents are the 'Ajax of the North', have an outstanding recruitment programme and trade blows with Europe's elite Wayne Rooney recalls 'moving and emotional' Munich disaster talk from Sir Bobby Charlton to Man United players in 2008, as he adjusts to new role as Birmingham City manager Lauryn Hill fans fear for her health after singer is forced to postpone tour date to prevent 'serious strain or damage' to her vocal chords Jamie Carragher lauds 22-year-old Chelsea star for stepping up to show 'captain-like authority' against his team-mate and 'seasoned professional Raheem Sterling' during the Blues' 2-2 draw against Arsenal Man United deny Jadon Sancho is set to return from his exile after fans thought Erik ten Hag said 'Sancho' and not 'Sergio' in his press conference when asked about fitness of left-back Reguilon England 15-16 South Africa - Rugby World Cup semi-final RECAP: Agony for England as South Africa steal victory with a late penalty kick after leading for just TWO minutes in the game Brits are realising why Fanta tastes so much better abroad - and it's all to do with the nutritional value Tottenham 2-0 Fulham - Premier League RECAP: Son Heung-min and James Maddison fire goals for Spurs in the London derby as Ange Postecoglou's side return top of the Premier League table Spilling the tea on your Old Trafford exit, David? De Gea meets up for a 'coffee and friends' date with his ex-Man United team-mates... but there's no room for his £47m Red Devils replacement Andre Onana at the table Bachelor Nation's Jason Tartick celebrates his 35th birthday by showing off muscles with shirtless snap following split with Kaitlyn Bristowe: 'Please be better than 34' Kepa Arrizabalaga wants to stay at Real Madrid on permanent basis after strong start, but Chelsea loanee admits 'nothing has been negotiated yet' US Grand Prix - Race LIVE: Max Verstappen overtakes Lando Norris to grab the lead in Austin, with Lewis Hamilton in second Gemma Owen's brother James tells of his 'heartbreak' at being unable to follow in England legend dad Michael's footballer footsteps as he details his battle with a rare eye condition Sky Sports are forced to apologise after broadcasting a fan shouting 'nice a**e Leno' at Fulham's goalkeeper while he took a goal kick against Tottenham Manchester United legends including Gary Neville and Brian Kidd join current squad and boss Erik ten Hag in signing messages of condolence in memory of Sir Bobby Charlton Amber Heard is BACK using her cane in Spain - after ditching the walking aid for days as she continues her recovery after hip injury Jamie Carragher argues Spurs fans would be 'delighted' with a place in the Champions League spots on Monday Night Football... and Wolves manager Gary O'Neil praises Ange Postecoglou's outlook Sandro Tonali will learn the length of his ban from football for illegal gambling 'in the next 24 hours' as midfielder trains ahead of Newcastle's Champions League clash with Dortmund Sean Longstaff confident Newcastle can cope loss of Sandro Tonali with midfielder set to learn length of ban for illegal gambling... as he insists Italian has been happy at the club ever since he joined Princess Leonor of Spain says she 'understands her duty' in a speech ahead of her 18th birthday as she prepares to one day become Queen Porn star Sky Bri reveals mystery Man United footballer has been DMing her - and says he's one of a few 'pretty big players' to message her IAN HERBERT: Is it beyond City fans to respect Sir Bobby, who helped put Manchester on the map? Lewis Hamilton and Charles Leclerc post joint cryptic message on social media after both were disqualified from the US Grand Prix for running an illegal floor EXCLUSIVE: World Rugby's new Nations Championship is given the go-ahead by the narrowest of margins in council vote - but some are warning the new international competition will be 'the death' of the sport Bill Kenwright dies aged 78: Everton chairman and legendary West End theatre impresario behind Blood Brothers, Joseph and Fame passes away days after returning home from surgery on cancerous liver tumour RIATH AL-SAMARRAI: Tottenham have handled Harry Kane's exit awfully well, but Ange Postecoglou's thin squad will be challenged when the Africa Cup of Nations and Asian Cup come around Former QPR co-owner Tony Fernandes is slammed as 'unprofessional' for getting a half-naked massage during a WORK MEETING - and boasting about the 'culture' on LinkedIn - before hastily deleting his post Real Madrid players rally around Vinicius Junior after the forward was racially abused by multiple Sevilla fans during LaLiga draw as Jude Bellingham declares 'always with you, brother' Wrexham owner Rob McElhenney announces new 'Parks and Wrex' development project in hilarious video with actor Chris Pratt as part of birthday gift for co-owner Ryan Reynolds Barcelona and Real Madrid are 'keeping tabs on 17-year-old French wonderkid Eli Junior Kroupi', with Lorient starlet taking Ligue 1 by storm Mike Tyson shows off his ripped physique aged 57 as the former world heavyweight champion helps MMA star Francis Ngannou prepare for his crossover fight with Tyson Fury REVEALED: World Rugby are looking into a DIFFERENT incident involving Tom Curry and Bongi Mbonambi in investigation into England 'white ****' slur - despite fans claiming South Africa star's innocence was proven Tributes flood in for Bill Kenwright following his death at the age of 78 - as Liverpool, Jamie Carragher and Wayne Rooney join the footballing world and beyond in saluting the former Everton chairman Cricketer Fawad Ahmed announces his four-month-old son has died: 'Till we meet again' Was South Africa's 'white ****' slur lost in translation? Springboks fans say Bongi Mbonambi was speaking in Afrikaans - and Google Translate shows they may have a case What are Jackson Mahomes' alleged crimes and what has he been charged with? All the latest after he was spotted with Taylor Swift to watch Travis Kelce's Chiefs win Travis Kelce has nervous 'alarms' going off in his head over new 'level of superstardom' from dating Taylor Swift, reveals his brother Jason: 'Man, this is a lot' Taylor Swift fans fume that Jackson Mahomes was allowed in the same Chiefs VIP box as pop superstar as he awaits hearing over alleged sexual battery: 'Someone get her out immediately' EXCLUSIVE: Taylor Swift and Travis Kelce arrive at the Chiefs star's mansion in his Rolls Royce for party with friends and family catered by Kansas City BBQ joint - after the loved-up pair left win over Chargers together EXCLUSIVE: Taylor Swift heads to Travis Kelce's house for lunch of turkey omelet and chicken tacos after flying in from LA on her private jet to watch her man play in a fourth Chiefs game South Africa fans uncover footage they claim proves Bongi Mbonambi's 'white ****' call is actually him shouting to team-mates in Afrikaans... but it's NOT even the incident World Rugby are investigating Kansas City Chiefs wide receiver Justyn Ross is arrested, facing felony charge of criminal damage of more than $25,000 Legendary commentator Martin Tyler set to return to the gantry four months after leaving Sky Sports to once again call a live Premier League game Tottenham fans pictured waving Israel flags during their clash against Fulham despite Premier League ban amid Palestine conflict Ireland rugby star strips down to her pineapple-print underwear at Rugby World Cup, as she celebrates 'the party' despite her nation's early exit Rapper Blueface proposes to his girlfriend in WILD day at the Rams game... after turning his private suite into a STRIP CLUB and offering rival players wads of cash to throw the game Mattress Mack loses out on 'at least $43.4 MILLION' after Houston Astros suffer 11-4 loss in deciding ALCS Game 7 to Texas Rangers Mohamed Salah IS Liverpool's greatest ever player in the Premier League era - not Steven Gerrard - claims Mail Sport's Chris Sutton on It's All Kicking Off... and believes only one player in the top-flight's history is more ruthless Tottenham 2-0 Fulham: Son Heung-min and James Maddison fire Spurs back to the top of the Premier League as Ange Postecoglou's side capitalise on defensive errors EXCLUSIVE: Ashlyn Harris loads her luggage into a taxi and heads to Newark Airport as she jets out of New York amid Ali Krieger split... after her ex-wife dropped hint she had cheated on her with new lover Sophia Bush Georgetown University women's basketball coach Tasha Butts dead at 41: Tributes pour in for former star player after two-year cancer battle Manchester United legend's grandson scores stunning long-range goal on his EFL debut as the 21-year-old notches late winner for Notts County against Gillingham Mary Lou Retton has returned HOME after 'scary setback' in her fight against rare form of pneumonia, as family reveal US Olympic legend is in 'recovery mode' after leaving the ICU Max Verstappen's model girlfriend is left SERIOUSLY unimpressed as he's booed after winning the US Grand Prix ahead of disqualified Lewis Hamilton Lionel Messi, his stunning wife, Antonela, and their three sons pose with Ed Sheeran as the forward kicks off his offseason with the pop star's concert after Inter Miami missed out on playoffs Manchester United youngster Tyler Fletcher - son of ex-midfielder Darren - switches his international allegiance back to Scotland from England... after 16-year-old and his twin brother Jack moved from Man City in the summer Footy legend's wedding EVACUATED after bushfire caused by squatters forces police to intervene EXCLUSIVE: 'I'm living like a monk... but I was a fat baby and I will be fat when I die!': Tyson Fury says his love handles will help him beat ripped Francis Ngannou - and sends a message to Oleksandr Usyk Ange Postecoglou SLAMS his Tottenham side 'for taking liberties in possession' and labels second half of 2-0 win over Fulham 'the WORST 45 minutes we've had all year'... despite going top! OLIVER HOLT: The Manchester United of Sir Bobby Charlton's era were celebrated as 'England's Team'. Now there's just sadness over a club in decay Alan Jones pictured in blackface at Wallaby 'skit night' during famous Bledisloe Cup winning tour of New Zealand Wife of Geelong star Gary Rohan has opened up about her heartbreaking miscarriage experience: 'You never think it's going to happen to you' KSI hires lawyer after controversial defeat to Tommy Fury, turning to a legal team in a bid to overturn the fight result after being more accurate with his punches New York Jets quarterback Zach Wilson enjoys bye week by jetting off to Utah for a spooky Halloween weekend with his stunning girlfriend Nicolette Dellanno... but he still can't resist picking up a football! Travis Kelce hilariously celebrates with a fist-pump as fan screams 'Let's go, Taylor's boyfriend' at him... after pop superstar Swift attended a FOURTH Chiefs game to watch him play Eagles coach Nick Sirianni gives passionate defense of controversial play many in the NFL want banned Garth Crooks names two Liverpool stars in his BBC team of the week column... but then BARELY mentions them as he uses it to lambast Luis Diaz and call for Ibrahima Konate red card Travis Kelce's dad Ed jokes Taylor Swift didn't 'get the diva memo' as he praises the 'very smart' and 'special' pop star amid her fledgling romance with his Kansas City Chiefs star son Ajax are likely to fail with any approach for Mitchell van der Gaag as Louis van Gaal looks to lure Manchester United assistant coach back to Holland Champions League Mikel Arteta Spain Share or comment on this article: Sevilla vs Arsenal - Champions League LIVE: Mikel Arteta's side are desperate to pick up a vital win in Spain following their shock defeat to Lens e-mail It's so obvious how Ramsdala has fallen out of fav... by Bosse Andersson 10 Add comment Comments 7 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-10-24 18:09:43","image_url":"https://i.dailymail.co.uk/1s/2023/10/24/10/76929807-0-image-a-32_1698141271133.jpg","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"18a3be557114b8826e5611ddec126311","title":"Bangladesh will love to finish 5-6 if not in semis: Shakib after 4th straight loss","link":"https://www.indiatoday.in/sports/cricket/story/bangladesh-will-love-to-finish-5-6-if-not-in-semis-says-captain-shakib-after-4th-straight-loss-2453229-2023-10-24?utm_source=rss","keywords":null,"creator":null,"video_url":null,"description":"Bangladesh will love to finish 5-6 if not in semis: Shakib after 4th straight loss","content":"Listen to Story Bangladesh captain Shakib Al Hasan said they lost the match in the final 10 overs when the South African duo of Quinton de Kock and Heinrich Klaasen went on a rampage, adding 144 runs at Mumbai's Wankhede Stadium on Tuesday. Quinton de Kock notched his third century in just five innings, propelling South Africa to a commanding 149-run victory over Bangladesh in the World Cup on Tuesday. The South African team, on a dominant streak, posted an imposing total of 382/5, marking the third-highest score in the tournament (the first two spots were also held by the Proteas). They then swiftly dismantled Bangladesh's underwhelming batting performance, sending them back to the pavilion with a total of 233 runs after 46.4 overs. \"We bowled first 25 overs well. We got three wickets, they were going at about 5 an over. From there they kicked on. Quinton batted really well, and the way Klaasen finished was something we didn't have any answer to. On a ground like this it can happen but we should've bowled better. Lost the game in the last 10 overs,\" Shakib al Hasan told the broadcasters after Bangladesh lost. Mahmudullah Riyad displayed remarkable courage by scoring 111 runs from 111 balls, achieving his fourth century in 225 ODIs and his first in six years. Unfortunately, the rest of the Bangladesh batting lineup struggled on a pitch that still favored batsmen. This defeat marked Bangladesh's fourth consecutive loss in the World Cup, while South Africa continued their impressive form with four wins out of five games. Furthermore, this loss was one of Bangladesh's heaviest in terms of runs in World Cup history, marking their third-largest margin of defeat. However, the veteran all-rounder did not lose hope of his team finishing strongly in this World Cup. Shakib said that he would be happy if Bangladesh managed to finish fifth or sixth if not in the semi-final. \"Has been lot of talking about whether Mushfiq and Mahmudullah should bat higher. But the role they have, they're doing very well. Our top four batters need to do well. Long way to go in this tournament, anything can happen. Lot to be learnt, and lot to play for. Will love to finish 5-6 if not in the semis. We're not playing like a team that can do it, but hope to finish stronger,\" Shakib added.","pubDate":"2023-10-24 17:58:02","image_url":null,"source_id":"indiatoday","source_priority":2885,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"7904f8192967a1541ff735f58abeee8e","title":"World Cup 2023 Points Table: સાઉથ આફ્રિકાની જીતથી પોઈન્ટ ટેબલમાં ફેરબદલ","link":"https://gujarati.abplive.com/sports/cricket/world-cup-2023-points-table-update-after-sa-vs-ban-south-africa-beat-bangladesh-by-149-runs-in-wankhade-stadium-862706","keywords":["ક્રિકેટ"],"creator":["abpasmita.in"],"video_url":null,"description":"World Cup 2023 Points Table Update After SA vs BAN: સાઉથ આફ્રિકાએ વર્લ્ડ કપ 2023માં બાંગ્લાદેશને 149 રનથી હરાવીને પોઈન્ટ ટેબલમાં મોટો ફેરફાર કર્યો છે. ટૂર્નામેન્ટમાં આફ્રિકાની આ ચોથી જીત હતી, જે બાદ તેઓ ન્યુઝીલેન્ડને પાછળ છોડીને પોઈન્ટ ટેબલમાં બીજા સ્થાને આવી ગયા હતા. જ્યારે હારતાં બાંગ્લાદેશ છેલ્લા સ્થાને એટલે કે 10માં સ્થાને સરકી ગયું છે. મેચ બાદ ઈંગ્લેન્ડ ભલે એક સ્થાન આગળ વધી ગયું હોય પરંતુ ટીમની મુસીબતો હજુ ઓછી થઈ નથી. આ જીત બાદ દક્ષિણ આફ્રિકાનો નેટ રન રેટ 2.370 થઈ ગયો છે, જે હાલમાં ટૂર્નામેન્ટની કોઈપણ અન્ય ટીમ કરતા વધારે છે. નંબર વન પર રહેલું ભારત પણ રન રેટના મામલે આફ્રિકાથી ઘણું પાછળ છે. આ હાર બાદ શાકિબ અલ હસનની આગેવાનીમાં બાંગ્લાદેશની સેમિફાઈનલમાં પહોંચવાની આશા લગભગ સમાપ્ત થઈ ગઈ છે. ટૂર્નામેન્ટમાં બાંગ્લાદેશની પાંચ મેચમાં આ ચોથી હાર હતી. જો કે હજુ સુધી કોઈ ટીમને સત્તાવાર રીતે બહાર કરવામાં આવી નથી. ટોપ-4માં ફેરફાર દક્ષિણ આફ્રિકાએ આ જીત સાથે ટોપ-4માં એક ફેરફાર કર્યો છે. આ યાદીમાં ટીમ ઈન્ડિયા 10 પોઈન્ટ સાથે ટોપ પર છે. દક્ષિણ આફ્રિકા સારા નેટ રન રેટ સાથે બીજા સ્થાને આવી ગયું છે અને બીજા સ્થાને રહેલું ન્યુઝીલેન્ડ ત્રીજા સ્થાને સરકી ગયું છે. આ પછી ઓસ્ટ્રેલિયા 4 પોઈન્ટ અને નેગેટિવ -0.193 નેટ રન રેટ સાથે ચોથા સ્થાને છે. બીજી ટીમોની પણ આ જ હાલત છે બાકીની ટીમો તરફ આગળ વધતાં પાકિસ્તાનની ટીમ 4 પોઈન્ટ અને નેગેટિવ -0.400 નેટ રનરેટ સાથે પાંચમા, અફઘાનિસ્તાન 4 પોઈન્ટ અને નેગેટિવ -0.969 નેટ રનરેટ સાથે છઠ્ઠા, નેધરલેન્ડ 2 પોઈન્ટ અને નેગેટિવ -0.790 નેટ રનરેટ સાથે સાતમા, શ્રીલંકા 2 પોઈન્ટ નેગેટિવ -1.048 નેટ રન રેટ સાથે આઠમા સ્થાને છે, ઈંગ્લેન્ડ 2 પોઈન્ટ અને નેગેટિવ -1.248 નેટ રન રેટ સાથે નવમા સ્થાને છે અને બાંગ્લાદેશ 2 પોઈન્ટ અને નેગેટિવ -1.253 નેટ સાથે છેલ્લા એટલે કે 10મા સ્થાને છે. ટોસ જીતીને પ્રથમ બેટિંગ કરવા ઉતરેલી આફ્રિકન ટીમની શરૂઆત ખરાબ રહી હતી. રીસ હેન્ડ્રીક્સ 12 રન બનાવીને આઉટ થયો હતો અને રાસી વેન ડેર ડુસેન એક રન બનાવીને આઉટ થયો હતો. હેન્ડ્રીક્સને શોરીફુલ અને ડુક્વેની મિરાજે આઉટ કર્યો હતો. આ પછી ક્વિન્ટન ડી કોકે કેપ્ટન એડન માર્કરામ સાથે ત્રીજી વિકેટ માટે 131 રનની ભાગીદારી કરી હતી. ડી કોકે તેની ODI કારકિર્દીની 20મી સદી અને આ વર્લ્ડ કપની ત્રીજી સદી ફટકારી હતી.","content":"World Cup 2023 Points Table Update After SA vs BAN: સાઉથ આફ્રિકાએ વર્લ્ડ કપ 2023માં બાંગ્લાદેશને 149 રનથી હરાવીને પોઈન્ટ ટેબલમાં મોટો ફેરફાર કર્યો છે. ટૂર્નામેન્ટમાં આફ્રિકાની આ ચોથી જીત હતી, જે બાદ તેઓ ન્યુઝીલેન્ડને પાછળ છોડીને પોઈન્ટ ટેબલમાં બીજા સ્થાને આવી ગયા હતા. જ્યારે હારતાં બાંગ્લાદેશ છેલ્લા સ્થાને એટલે કે 10માં સ્થાને સરકી ગયું છે. મેચ બાદ ઈંગ્લેન્ડ ભલે એક સ્થાન આગળ વધી ગયું હોય પરંતુ ટીમની મુસીબતો હજુ ઓછી થઈ નથી. આ જીત બાદ દક્ષિણ આફ્રિકાનો નેટ રન રેટ 2.370 થઈ ગયો છે, જે હાલમાં ટૂર્નામેન્ટની કોઈપણ અન્ય ટીમ કરતા વધારે છે. નંબર વન પર રહેલું ભારત પણ રન રેટના મામલે આફ્રિકાથી ઘણું પાછળ છે. આ હાર બાદ શાકિબ અલ હસનની આગેવાનીમાં બાંગ્લાદેશની સેમિફાઈનલમાં પહોંચવાની આશા લગભગ સમાપ્ત થઈ ગઈ છે. ટૂર્નામેન્ટમાં બાંગ્લાદેશની પાંચ મેચમાં આ ચોથી હાર હતી. જો કે હજુ સુધી કોઈ ટીમને સત્તાવાર રીતે બહાર કરવામાં આવી નથી. ટોપ-4માં ફેરફાર દક્ષિણ આફ્રિકાએ આ જીત સાથે ટોપ-4માં એક ફેરફાર કર્યો છે. આ યાદીમાં ટીમ ઈન્ડિયા 10 પોઈન્ટ સાથે ટોપ પર છે. દક્ષિણ આફ્રિકા સારા નેટ રન રેટ સાથે બીજા સ્થાને આવી ગયું છે અને બીજા સ્થાને રહેલું ન્યુઝીલેન્ડ ત્રીજા સ્થાને સરકી ગયું છે. આ પછી ઓસ્ટ્રેલિયા 4 પોઈન્ટ અને નેગેટિવ -0.193 નેટ રન રેટ સાથે ચોથા સ્થાને છે. googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); બીજી ટીમોની પણ આ જ હાલત છે બાકીની ટીમો તરફ આગળ વધતાં પાકિસ્તાનની ટીમ 4 પોઈન્ટ અને નેગેટિવ -0.400 નેટ રનરેટ સાથે પાંચમા, અફઘાનિસ્તાન 4 પોઈન્ટ અને નેગેટિવ -0.969 નેટ રનરેટ સાથે છઠ્ઠા, નેધરલેન્ડ 2 પોઈન્ટ અને નેગેટિવ -0.790 નેટ રનરેટ સાથે સાતમા, શ્રીલંકા 2 પોઈન્ટ નેગેટિવ -1.048 નેટ રન રેટ સાથે આઠમા સ્થાને છે, ઈંગ્લેન્ડ 2 પોઈન્ટ અને નેગેટિવ -1.248 નેટ રન રેટ સાથે નવમા સ્થાને છે અને બાંગ્લાદેશ 2 પોઈન્ટ અને નેગેટિવ -1.253 નેટ સાથે છેલ્લા એટલે કે 10મા સ્થાને છે. ટોસ જીતીને પ્રથમ બેટિંગ કરવા ઉતરેલી આફ્રિકન ટીમની શરૂઆત ખરાબ રહી હતી. રીસ હેન્ડ્રીક્સ 12 રન બનાવીને આઉટ થયો હતો અને રાસી વેન ડેર ડુસેન એક રન બનાવીને આઉટ થયો હતો. હેન્ડ્રીક્સને શોરીફુલ અને ડુક્વેની મિરાજે આઉટ કર્યો હતો. આ પછી ક્વિન્ટન ડી કોકે કેપ્ટન એડન માર્કરામ સાથે ત્રીજી વિકેટ માટે 131 રનની ભાગીદારી કરી હતી. ડી કોકે તેની ODI કારકિર્દીની 20મી સદી અને આ વર્લ્ડ કપની ત્રીજી સદી ફટકારી હતી.","pubDate":"2023-10-24 17:49:45","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/10/24/d158e7431fc89145a99cd51154420d6e169816975458478_original.jpg","source_id":"abplive","source_priority":10959,"country":["india"],"category":["sports"],"language":"gujarati"},{"article_id":"ae38b91c4d953ee5033488273fa40f05","title":"Points Table : आफ्रिकेची दुसऱ्या स्थानावर झेप, बांगलादेशचा पराभव झाल्यानंतर गुणतालिकेत मोठा बदल","link":"https://marathi.abplive.com/sports/cricket/world-cup-2023-points-table-update-after-sa-vs-ban-south-africa-beat-bangladesh-by-149-runs-in-wankhade-stadium-1222124","keywords":["क्रिकेट"],"creator":["एबीपी माझा स्पोर्ट्स डेस्क"],"video_url":null,"description":"World Cup 2023 Points Table : दक्षिण आफ्रिकेने विश्वचषकातील चौथ्या विजयाची नोंद केली. या विजयासह दक्षिण आफ्रिकेने उपांत्य फेरीकडे वाटचाल केली आहे. दक्षिण आफ्रिकेने पाच सामन्यात चार विजय मिळवत आठ गुणांची कमाई केली. चौथ्या विजयासह दक्षिण आफ्रिकेने दुसऱ्या क्रमांकावर झेप घेतली. न्यूझीलंडचा संघ तिसऱ्या क्रमांकावर घसरला आहे. या सामन्याआधी दक्षिण आफ्रिका तिसऱ्या तर न्यूझीलंड दुसऱ्या क्रमांकावर होता. बांगलादेशचा 149 धावांनी दारुण पराभव केल्यामुळे दक्षिण आफ्रिकेचा रनरेटही सुधारला आहे. आफ्रिकेच्या विराट विजयानंतर गुणतालिकेत मोठा फेरबदल झालाय.  आजच्या सामन्यात काय झालं ? दक्षिण आफ्रिकेनं बांगलादेशचा 149 धावांनी धुव्वा उडवून, विश्वचषकाच्या मोहिमेत चौथा विजय साजरा केला. दक्षिण आफ्रिकेनं पाचपैकी चार सामने जिंकून आठ गुणांची कमाई केली असून, विश्वचषकाच्या गुणतालिकेत दक्षिण आफ्रिका दुसऱ्या स्थानावर आहे. मुंबईतल्या सामन्यात दक्षिण आफ्रिकेनं बांगलादेशला विजयासाठी 383 धावांचं आव्हान दिलं होतं. त्या आव्हानाचा पाठलाग करताना बांगलादेशचा अख्खा डाव 47 व्या षटकांत 233 धावांत आटोपला. या सामन्यात क्विन्टॉन डी कॉकनं 174 धावांची खेळी करून दक्षिण आफ्रिकेच्या डावाचा पाया घातला. त्यानं 140 चेंडूंमधली ही खेळी 15 चौकार आणि सात षटकारांनी सजवली. डी कॉकनं एडन मारक्रमच्या साथीनं तिसऱ्या विकेटसाठी 131 धावांची, तर हेन्ऱिक क्लासेनच्या साथीनं चौथ्या विकेटसाठी 142 धावांची भागीदारी केली. मारक्रमनं 69 चेंडूंत 60 धावांची आणि क्लासेननं 49 चेंडूंमध्ये 90 धावांची खेळी उभारली. क्लासेननं 90 धावांच्या खेळीला दोन चौकार आणि आठ षटकारांचा साज चढवला.  टीम इंडिया अव्वल स्थानावर -  न्यूझीलंडचा पराभव करत भारतीय संघाने गुणातलिकेत पहिल्या स्थानावर झेप घेतली आहे. यंदाच्या विश्वचषकात टीम इंडिया आतापर्यंत अजय आहे. भारताने पाच सामन्यात पाच विजय मिळवले आहेत. किवी तिसऱ्या क्रमांकावर आहेत. न्यूझीलंडने पाच सामन्यात चार विजय मिळवले आहेत.   पाकिस्तान-ऑस्ट्रेलियाची स्थिती काय ? अफगाणिस्तानकडून पाकिस्तानचा लाजीरवाण्या पराभवाचा सामना करावा लागला. या पराभवामुळे पाकिस्तान संघाचे विश्वचषकातील आव्हान अधिक खडतर झाले आहे.  पाकिस्तानन संघ गुणातातिलेत सध्या पाचव्या क्रमांकावर आहे, पण पाकिस्तानला पाच सामन्यात तीन पराभवाचा सामना करावा लागला. त्यांचा रनरेटही मोठ्या प्रमाणात घसरला आहे. अफगाणिस्तानकडून पराभूत झाल्यामुळे विश्वचषकातील आव्हान अधिक खडतर झाले आहे. विश्वचषकातील आव्हान जिवंत ठेवण्यासाठी पाकिस्तानला उर्वरित सर्व सामन्यात विजय मिळवावा लागेल.  ऑस्ट्रेलियाचा संघ चौथ्या स्थानावर आहे. पाकिस्तान, अफगाणिस्तानसह ऑस्ट्रेलियाचेही  चार गुण झाले आहेत. पण सरस रनरेटमुळे ऑस्ट्रेलिया चौथ्या क्रमांकावर आहे. तर पाकिस्तान पाचव्या स्थानी आहे. तळाच्या संघाची स्थिती काय ?  बांगलादेशचा संघ दहाव्या स्थानावर घसरला आहे. याआधी तो सातव्या स्थानी होता. तर अफगाणिस्तानचा संघ सहाव्या स्थानावर पोहचला आहे. अफागणिस्तान संघाने पाच सामन्यात दोन विजय मिळवलेत. नेदरलँडचा संघ सातव्या क्रमांकावर विराजमान आहे. श्रीलंका संघ एका विजयासह आठव्या स्थानावर आहे. गतविजेता इंग्लंड संघ नवव्या क्रमांकावर आहे. इंग्लंडला चार सामन्यात तीन पराभवाचा सामना करावा लागलाय.   ","content":"World Cup 2023 Points Table : दक्षिण आफ्रिकेने विश्वचषकातील चौथ्या विजयाची नोंद केली. या विजयासह दक्षिण आफ्रिकेने उपांत्य फेरीकडे वाटचाल केली आहे. दक्षिण आफ्रिकेने पाच सामन्यात चार विजय मिळवत आठ गुणांची कमाई केली. चौथ्या विजयासह दक्षिण आफ्रिकेने दुसऱ्या क्रमांकावर झेप घेतली. न्यूझीलंडचा संघ तिसऱ्या क्रमांकावर घसरला आहे. या सामन्याआधी दक्षिण आफ्रिका तिसऱ्या तर न्यूझीलंड दुसऱ्या क्रमांकावर होता. बांगलादेशचा 149 धावांनी दारुण पराभव केल्यामुळे दक्षिण आफ्रिकेचा रनरेटही सुधारला आहे. आफ्रिकेच्या विराट विजयानंतर गुणतालिकेत मोठा फेरबदल झालाय. आजच्या सामन्यात काय झालं ? दक्षिण आफ्रिकेनं बांगलादेशचा 149 धावांनी धुव्वा उडवून, विश्वचषकाच्या मोहिमेत चौथा विजय साजरा केला. दक्षिण आफ्रिकेनं पाचपैकी चार सामने जिंकून आठ गुणांची कमाई केली असून, विश्वचषकाच्या गुणतालिकेत दक्षिण आफ्रिका दुसऱ्या स्थानावर आहे. मुंबई तल्या सामन्यात दक्षिण आफ्रिकेनं बांगलादेशला विजयासाठी 383 धावांचं आव्हान दिलं होतं. त्या आव्हानाचा पाठलाग करताना बांगलादेशचा अख्खा डाव 47 व्या षटकांत 233 धावांत आटोपला. या सामन्यात क्विन्टॉन डी कॉकनं 174 धावांची खेळी करून दक्षिण आफ्रिकेच्या डावाचा पाया घातला. त्यानं 140 चेंडूंमधली ही खेळी 15 चौकार आणि सात षटकारांनी सजवली. डी कॉकनं एडन मारक्रमच्या साथीनं तिसऱ्या विकेटसाठी 131 धावांची, तर हेन्ऱिक क्लासेनच्या साथीनं चौथ्या विकेटसाठी 142 धावांची भागीदारी केली. मारक्रमनं 69 चेंडूंत 60 धावांची आणि क्लासेननं 49 चेंडूंमध्ये 90 धावांची खेळी उभारली. क्लासेननं 90 धावांच्या खेळीला दोन चौकार आणि आठ षटकारांचा साज चढवला. टीम इंडिया अव्वल स्थानावर - googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); न्यूझीलंडचा पराभव करत भारतीय संघाने गुणातलिकेत पहिल्या स्थानावर झेप घेतली आहे. यंदाच्या विश्वचषकात टीम इंडिया आतापर्यंत अजय आहे. भारताने पाच सामन्यात पाच विजय मिळवले आहेत. किवी तिसऱ्या क्रमांकावर आहेत. न्यूझीलंडने पाच सामन्यात चार विजय मिळवले आहेत. पाकिस्तान-ऑस्ट्रेलियाची स्थिती काय ? अफगाणिस्तानकडून पाकिस्तानचा लाजीरवाण्या पराभवाचा सामना करावा लागला. या पराभवामुळे पाकिस्तान संघाचे विश्वचषकातील आव्हान अधिक खडतर झाले आहे. पाकिस्तानन संघ गुणातातिलेत सध्या पाचव्या क्रमांकावर आहे, पण पाकिस्तानला पाच सामन्यात तीन पराभवाचा सामना करावा लागला. त्यांचा रनरेटही मोठ्या प्रमाणात घसरला आहे. अफगाणिस्तानकडून पराभूत झाल्यामुळे विश्वचषकातील आव्हान अधिक खडतर झाले आहे. विश्वचषकातील आव्हान जिवंत ठेवण्यासाठी पाकिस्तानला उर्वरित सर्व सामन्यात विजय मिळवावा लागेल. ऑस्ट्रेलियाचा संघ चौथ्या स्थानावर आहे. पाकिस्तान, अफगाणिस्तानसह ऑस्ट्रेलियाचेही चार गुण झाले आहेत. पण सरस रनरेटमुळे ऑस्ट्रेलिया चौथ्या क्रमांकावर आहे. तर पाकिस्तान पाचव्या स्थानी आहे. तळाच्या संघाची स्थिती काय ? बांगलादेशचा संघ दहाव्या स्थानावर घसरला आहे. याआधी तो सातव्या स्थानी होता. तर अफगाणिस्तानचा संघ सहाव्या स्थानावर पोहचला आहे. अफागणिस्तान संघाने पाच सामन्यात दोन विजय मिळवलेत. नेदरलँडचा संघ सातव्या क्रमांकावर विराजमान आहे. श्रीलंका संघ एका विजयासह आठव्या स्थानावर आहे. गतविजेता इंग्लंड संघ नवव्या क्रमांकावर आहे. इंग्लंडला चार सामन्यात तीन पराभवाचा सामना करावा लागलाय.","pubDate":"2023-10-24 17:48:39","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/10/24/d1a1b55d935567a84ad5086c578b4fb51698168590855625_original.jpg","source_id":"abplive","source_priority":10959,"country":["india"],"category":["sports"],"language":"marathi"},{"article_id":"841aa25356a80ba8ed24f24abb267428","title":"SA vs BAN Match Report : आफ्रिकेची विजयी घौडदौड सुरुच, बांगलादेशचा 149 धावांनी धुव्वा","link":"https://marathi.abplive.com/sports/cricket/south-africa-beat-bangladesh-sa-vs-ban-match-report-world-cup-2023-sports-news-1222121","keywords":["क्रिकेट"],"creator":["एबीपी माझा स्पोर्ट्स डेस्क"],"video_url":null,"description":"SA vs BAN Match Report : दक्षिण आफ्रिका संघाची विश्वचषकातील घौडदौड सुरुच आहे. दक्षिण आफ्रिकेने आज बांगलादेशचा 149 धावांच्या अंतराने मोठा पराभव केला. 383 धावांचा पाठलाग करताना बांगलादेशचा संघ 46.4 षटकात 233 धावांपर्यंत मजल मारु शकला. दक्षिण आफ्रिकेने विश्वचषकातील चौथ्या विजयाची नोंद केली. या विजयासह दक्षिण आफ्रिकेने उपांत्य फेरीकडे वाटचाल केली आहे. दक्षिण आफ्रिकेने पाच सामन्यात चार विजय मिळवत आठ गुणांची कमाई केली. चौथ्या विजयासह दक्षिण आफ्रिकेने दुसऱ्या क्रमांकावर झेप घेतली. न्यूझीलंडचा संघ तिसऱ्या क्रमांकावर घसरला आहे. या सामन्याआधी दक्षिण आफ्रिका तिसऱ्या तर न्यूझीलंड दुसऱ्या क्रमांकावर होता. बांगलादेशचा 149 धावांनी दारुण पराभव केल्यामुळे दक्षिण आफ्रिकेचा रनरेटही सुधारला आहे. आफ्रिकेच्या विराट विजयानंतर गुणतालिकेत मोठा फेरबदल झालाय.  दक्षिण आफ्रिकेनं बांगलादेशचा 149 धावांनी धुव्वा उडवून, विश्वचषकाच्या मोहिमेत चौथा विजय साजरा केला. दक्षिण आफ्रिकेनं पाचपैकी चार सामने जिंकून आठ गुणांची कमाई केली असून, विश्वचषकाच्या गुणतालिकेत दक्षिण आफ्रिका दुसऱ्या स्थानावर आहे. मुंबईतल्या सामन्यात दक्षिण आफ्रिकेनं बांगलादेशला विजयासाठी 383 धावांचं आव्हान दिलं होतं. त्या आव्हानाचा पाठलाग करताना बांगलादेशचा अख्खा डाव 47 व्या षटकांत 233 धावांत आटोपला. या सामन्यात क्विन्टॉन डी कॉकनं 174 धावांची खेळी करून दक्षिण आफ्रिकेच्या डावाचा पाया घातला. त्यानं 140 चेंडूंमधली ही खेळी 15 चौकार आणि सात षटकारांनी सजवली. डी कॉकनं एडन मारक्रमच्या साथीनं तिसऱ्या विकेटसाठी 131 धावांची, तर हेन्ऱिक क्लासेनच्या साथीनं चौथ्या विकेटसाठी १४२ धावांची भागीदारी केली. मारक्रमनं 69 चेंडूंत 60 धावांची आणि क्लासेननं 49 चेंडूंमध्ये 90 धावांची खेळी उभारली. क्लासेननं 90 धावांच्या खेळीला दोन चौकार आणि आठ षटकारांचा साज चढवला. महमदुल्लाहची एकाकी झुंज, आफ्रिकन तोफेचा केला समर्थपणे सामना -  383 धावांचा पाठलाग करताना बांगलादेशची सुरुवात अतिशय दैयनिय झाली. पण अनुभवी महमदुल्लाह याने एकाकी झुंज दिली. महमदुल्लाह  याने 111 धावांची झंझावती शतकी खेळी केली. त्याने आपल्या डावात चार षटकार आणि 11 चौकार लगावले. महमदुल्लाह याचा अपवाद वगळता एकाही फलंदाजाला मोठी खेळी करता आली नाही. त्यामुळे शाकिब अल हसनच्या बांगलादेशला मोठ्या पराभवाचा सामना करावा लागला.  बांगलादेशसाठी तंजीद हसन याने 17 चेंडूत 22 धावा केल्या. तर लिटन दास याने 44 चेंडूत 22 धावांचे योगदान दिलेय.  नजमुल हौसेन शांतो, शाकिब अल हसन, मुस्ताफिजुर रहमान, मेंहदी हसन मिराज आणि नसुम अहमद यांनी अनुक्रमे 0, 1, 8, 11 आणि 19 धावा केल्या. या फलंदाजांना मोठी खेळी करता आली नाही. बांगलादेशचे आठ फलंदाज 159 धावांत तंबूत परतले होते. पण महमदुल्लाह  याने एकाकी झुंज दिली. बांगलादेशचा संघ 233 धावांपर्यंत पोहचवला.   दक्षिण आफ्रिकेच्या गोलंदाजाची कामगिरी कशी राहिली ? दक्षिण आफ्रिकेच्या गोलंदाजांनी भेदक मारा केला. गेराल्ड कौटजी सर्वात यशस्वी गोलंदाज ठरला.  गेराल्ड कौटजी याने 10 षटकात 62 धावांच्या मोबदल्यात तीन विकेट घेतल्या. त्याशिवाय मार्को यॉन्सेन, लिडाज विलियम्स, आणि कगिसो रबाडा यांनी प्रत्येकी दोन दोन विकेट घेतल्या. केशव महाराज याने एक विकेट घेतली. ","content":"SA vs BAN Match Report : दक्षिण आफ्रिका संघाची विश्वचषकातील घौडदौड सुरुच आहे. दक्षिण आफ्रिकेने आज बांगलादेशचा 149 धावांच्या अंतराने मोठा पराभव केला. 383 धावांचा पाठलाग करताना बांगलादेशचा संघ 46.4 षटकात 233 धावांपर्यंत मजल मारु शकला. दक्षिण आफ्रिकेने विश्वचषकातील चौथ्या विजयाची नोंद केली. या विजयासह दक्षिण आफ्रिकेने उपांत्य फेरीकडे वाटचाल केली आहे. दक्षिण आफ्रिकेने पाच सामन्यात चार विजय मिळवत आठ गुणांची कमाई केली. चौथ्या विजयासह दक्षिण आफ्रिकेने दुसऱ्या क्रमांकावर झेप घेतली. न्यूझीलंडचा संघ तिसऱ्या क्रमांकावर घसरला आहे. या सामन्याआधी दक्षिण आफ्रिका तिसऱ्या तर न्यूझीलंड दुसऱ्या क्रमांकावर होता. बांगलादेशचा 149 धावांनी दारुण पराभव केल्यामुळे दक्षिण आफ्रिकेचा रनरेटही सुधारला आहे. आफ्रिकेच्या विराट विजयानंतर गुणतालिकेत मोठा फेरबदल झालाय. दक्षिण आफ्रिकेनं बांगलादेशचा 149 धावांनी धुव्वा उडवून, विश्वचषकाच्या मोहिमेत चौथा विजय साजरा केला. दक्षिण आफ्रिकेनं पाचपैकी चार सामने जिंकून आठ गुणांची कमाई केली असून, विश्वचषकाच्या गुणतालिकेत दक्षिण आफ्रिका दुसऱ्या स्थानावर आहे. मुंबई तल्या सामन्यात दक्षिण आफ्रिकेनं बांगलादेशला विजयासाठी 383 धावांचं आव्हान दिलं होतं. त्या आव्हानाचा पाठलाग करताना बांगलादेशचा अख्खा डाव 47 व्या षटकांत 233 धावांत आटोपला. या सामन्यात क्विन्टॉन डी कॉकनं 174 धावांची खेळी करून दक्षिण आफ्रिकेच्या डावाचा पाया घातला. त्यानं 140 चेंडूंमधली ही खेळी 15 चौकार आणि सात षटकारांनी सजवली. डी कॉकनं एडन मारक्रमच्या साथीनं तिसऱ्या विकेटसाठी 131 धावांची, तर हेन्ऱिक क्लासेनच्या साथीनं चौथ्या विकेटसाठी १४२ धावांची भागीदारी केली. मारक्रमनं 69 चेंडूंत 60 धावांची आणि क्लासेननं 49 चेंडूंमध्ये 90 धावांची खेळी उभारली. क्लासेननं 90 धावांच्या खेळीला दोन चौकार आणि आठ षटकारांचा साज चढवला. महमदुल्लाहची एकाकी झुंज, आफ्रिकन तोफेचा केला समर्थपणे सामना - 383 धावांचा पाठलाग करताना बांगलादेशची सुरुवात अतिशय दैयनिय झाली. पण अनुभवी महमदुल्लाह याने एकाकी झुंज दिली. महमदुल्लाह याने 111 धावांची झंझावती शतकी खेळी केली. त्याने आपल्या डावात चार षटकार आणि 11 चौकार लगावले. महमदुल्लाह याचा अपवाद वगळता एकाही फलंदाजाला मोठी खेळी करता आली नाही. त्यामुळे शाकिब अल हसनच्या बांगलादेशला मोठ्या पराभवाचा सामना करावा लागला. बांगलादेशसाठी तंजीद हसन याने 17 चेंडूत 22 धावा केल्या. तर लिटन दास याने 44 चेंडूत 22 धावांचे योगदान दिलेय. googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); नजमुल हौसेन शांतो, शाकिब अल हसन, मुस्ताफिजुर रहमान, मेंहदी हसन मिराज आणि नसुम अहमद यांनी अनुक्रमे 0, 1, 8, 11 आणि 19 धावा केल्या. या फलंदाजांना मोठी खेळी करता आली नाही. बांगलादेशचे आठ फलंदाज 159 धावांत तंबूत परतले होते. पण महमदुल्लाह याने एकाकी झुंज दिली. बांगलादेशचा संघ 233 धावांपर्यंत पोहचवला. दक्षिण आफ्रिकेच्या गोलंदाजाची कामगिरी कशी राहिली ? दक्षिण आफ्रिकेच्या गोलंदाजांनी भेदक मारा केला. गेराल्ड कौटजी सर्वात यशस्वी गोलंदाज ठरला. गेराल्ड कौटजी याने 10 षटकात 62 धावांच्या मोबदल्यात तीन विकेट घेतल्या. त्याशिवाय मार्को यॉन्सेन, लिडाज विलियम्स, आणि कगिसो रबाडा यांनी प्रत्येकी दोन दोन विकेट घेतल्या. केशव महाराज याने एक विकेट घेतली.","pubDate":"2023-10-24 17:38:16","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/10/24/0f141fd118c1810f667feec751604dda169816736956176_original.jpg","source_id":"abplive","source_priority":10959,"country":["india"],"category":["sports"],"language":"marathi"},{"article_id":"9b129a07be81184f8c04bac550458006","title":"SA vs BAN HIGHLIGHTS, World Cup 2023: Quinton De Kock's 174 Sets Up Proteas Massive Win Over Bangladesh","link":"https://news.abplive.com/sports/cricket/sa-vs-ban-highlights-south-africa-beat-bangladesh-by-149-runs-wankhede-stadium-mumbai-icc-cricket-world-cup-2023-1638095","keywords":["Cricket"],"creator":["ABP News Bureau"],"video_url":null,"description":"SA vs BAN, World Cup 2023: South Africa beat Bangladesh by 149 runs in match number 23 of the ICC Men's Cricket World Cup 2023 at the Wankhede Stadium in Mumbai on Tuesday (October 24). The Proteas won the toss and elected to bat first on a flat Mumbai wicket. Quinton de Kock was the star with the bat for South Africa as he slammed his third hundred of this World Cup, making a dominant 174 off 140 deliveries taking them to a strong total of 382/5. In response, Bangladesh never really got going and were bowled out for 233 despite Mahmudullah's 111 off 111 balls.Other than De Kock's 174, Heinrich Klaasen too continued his superb form in the tournament and scored 90 off just 49 balls with some breathtaking strokes during the innings. Aiden Markram, South Africa's stand-in skipper, also scored a half-century making 60 off 69 balls. For Bangladesh, Hasan Mahmud was the pick of the bowlers with figures of 2 for 67. Shakib Al Hasan, Shoriful Islam and Mehidy Hasan Miraz picked up a wicket each.After their dominating performance with the bat, they were clinical with the ball in hand too with Gerald Coetzee emerging as the highest wicket-taker for the team, finishing with 3 for 62. Marco Jansen, Lizaad Williams and Kagiso Rabada scalped two wickets apiece while Keshav Maharaj was also impressive picking 1 for 32 off his 10 overs. It could have been an even more handsome victory for the Proteas who move to the second position on the table with 8 points from 5 matches and a net run rate of +2.370 had it not been for the 68-run stand between Mahmudullah and Mustafizur Rahaman, a partnership which ensured that Mahmudullah get to his century and the Bangla Tigers reduce the deficit of their margin.After the match, De Kock was adjudged the Player of the Match who described the experience as being more tiring than satisfactory. All three of his World Cup tons have come in this edition and in a format from which he has already announced retirement at the end of this campaign.","content":"googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); SA vs BAN, World Cup 2023: South Africa beat Bangladesh by 149 runs in match number 23 of the ICC Men's Cricket World Cup 2023 at the Wankhede Stadium in Mumbai on Tuesday (October 24). The Proteas won the toss and elected to bat first on a flat Mumbai wicket. Quinton de Kock was the star with the bat for South Africa as he slammed his third hundred of this World Cup, making a dominant 174 off 140 deliveries taking them to a strong total of 382/5. In response, Bangladesh never really got going and were bowled out for 233 despite Mahmudullah's 111 off 111 balls. Other than De Kock's 174, Heinrich Klaasen too continued his superb form in the tournament and scored 90 off just 49 balls with some breathtaking strokes during the innings. Aiden Markram, South Africa's stand-in skipper, also scored a half-century making 60 off 69 balls. For Bangladesh, Hasan Mahmud was the pick of the bowlers with figures of 2 for 67. Shakib Al Hasan, Shoriful Islam and Mehidy Hasan Miraz picked up a wicket each. After their dominating performance with the bat, they were clinical with the ball in hand too with Gerald Coetzee emerging as the highest wicket-taker for the team, finishing with 3 for 62. Marco Jansen, Lizaad Williams and Kagiso Rabada scalped two wickets apiece while Keshav Maharaj was also impressive picking 1 for 32 off his 10 overs. It could have been an even more handsome victory for the Proteas who move to the second position on the table with 8 points from 5 matches and a net run rate of +2.370 had it not been for the 68-run stand between Mahmudullah and Mustafizur Rahaman, a partnership which ensured that Mahmudullah get to his century and the Bangla Tigers reduce the deficit of their margin. After the match, De Kock was adjudged the Player of the Match who described the experience as being more tiring than satisfactory. All three of his World Cup tons have come in this edition and in a format from which he has already announced retirement at the end of this campaign.","pubDate":"2023-10-24 17:31:23","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/10/24/d1a1b55d935567a84ad5086c578b4fb51698168590855625_original.jpg","source_id":"abplive","source_priority":10959,"country":["india"],"category":["sports"],"language":"english"}]}