{"newsArray":[{"title":"PAK vs AUS 2022: Slow pitches are Australian cricket team's 'Catch'-22","link":"https://www.sportskeeda.com/cricket/pak-vs-aus-2022-slow-pitches-australian-cricket-team-s-catch-22?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Cricket"],"creator":["Casey McCarthy"],"video_url":null,"description":null,"content":null,"pubDate":"2022-03-23 01:09:45","full_description":"The Australian cricket team have been absent from the international touring scene since the Ashes in 2019, and the ongoing series for the Benaud-Qadir Trophy is exposing that problem. Australia have simply missed the mark on their slips fielding this series, and it appears as though Pakistan's slower pitches may be the culprit. Edges aren't carrying as far as traditional slip placements on Australian pitches. The Australian cricket team have been caught out in failing to adjust to unfamiliar conditions. The conditions in Pakistan have called forth a gamble from the Australian cricket team. They moved Steve Smith into a closer position at first slip, well in front of wicketkeeper Alex Carey , to combat the lack of carry in the wicket. But a catch went begging in between the two as Abdullah Shafique survived a healthy edge into a vacant first slip gap. Neither Steve Smith nor Alex Carey attempted the catch, leaving the positioning of both in a glaring spotlight. Carey has made similar non-decisions in his short career so far. Smith appeared to not have enough time to react to the flying edge because he was standing closer to the pitch than usual. Former Pakistan captain Waqar Younis believes the two should have been standing parallel to each other to negate any adverse effects of the alternatives. There is no clear solution to the problem. Either the slips are too close and are beaten for pace, or they're too far and the knicks don't carry. Any closer to the wicketkeeper, and they risk hogging the keeper's eyeline. However, this experiment by the Australian cricket team - a staggered slips cordon - didn't go to plan. Debate raged on social media over whether it was Smith or Carey that should've attempted the catch. The uninspiring and lackluster pitches this series have been labeled ' below average ' by the ICC, and have contributed to less-than-appealing draws dominated by the bat. But the negative consequences of a dead wicket have also manifested in the standard of slip catching. Pat Cummins was able to grab his side's sole wicket for the day. He trapped Imam-u-Haq leg-before for 11. But Pakistan finished Day 2 at 90/1, trailing by 301 runs.","image_url":"https://static.sportskeeda.com/editor/2022/03/0f810-16479852619470-1920.jpg","source_id":"sportskeeda","country":["india"],"category":["sports"],"language":"english"},{"title":"Rizwan Hussain guides Central Punjab to fourth win","link":"https://www.thenews.com.pk/print/943799-rizwan-hussain-guides-central-punjab-to-fourth-win","keywords":null,"creator":null,"video_url":null,"description":"LAHORE: Rizwan Hussain’s century led Central Punjab to a 15-run win over the defending champions Khyber Pakhtunkhwa in the ninth round match of the Pakistan Cup at the Pindi Cricket Stadium in Rawalpindi on Tuesday.This was Central Punjab’s fourth win in the tournament. They are fourth...","content":null,"pubDate":"2022-03-23 01:00:00","full_description":"LAHORE: Rizwan Hussain’s century led Central Punjab to a 15-run win over the defending champions Khyber Pakhtunkhwa in the ninth round match of the Pakistan Cup at the Pindi Cricket Stadium in Rawalpindi on Tuesday. .ads_between_content{ height:auto; width:auto; clear: both; text-align: center; } .ads_between_content .story_ads{ } /*@media (max-width:600px){ .ads_between_content{ float:none; margin:0px auto; text-align: center; } }*/ This was Central Punjab’s fourth win in the tournament. They are fourth with eight points. In other fixtures of the round, Southern Punjab and Balochistan won their matches against Sindh and Northern, respectively. After being asked to bat first, Central Punjab scored 268 for nine in 50 overs. Opener Rizwan scored a 120-ball 104, which included seven fours and three sixes. Saad Nasim chipped in with a 52-ball 48, hitting a four and a six. Right-handed Qasim Akram scored 38 off 48, smashing four boundaries. For Khyber Pakhtunkhwa, Mohammad Imran bagged four wickets for 54. Imran Khan Snr took two wickets for 54. In reply, Khyber Pakhtunkhwa were bowled out for 253 on the last ball of the 50th over. Sarwar Afridi batting at number four top-scored with 59-ball 43, which included two sixes. Central Punjab’s Qasim with his off-spin picked three wickets for 38. Hussain Talat, Mohammad Faizan and Zafar Gohar grabbed two wickets apiece. In a close contest, Balochistan overcame Northern by seven runs at the Iqbal Stadium in Faisalabad. After being put into bat, Balochistan scored 302 for five in their allotted 50 overs. Test cricketer Asad Shafiq top-scored with 66-ball 89, hitting 12 fours. Opening batters Haseebullah and Imran Butt scored 58 and 54 runs, respectively. The pair scored 107 runs together. Ayaz Tasawar was the other notable run-getter scoring an unbeaten 43 off 24, smashing four fours and two sixes. In reply, Northern managed 295 for six in 50 overs. Wicketkeeper-batter Rohail Nazir top-scored with 87-ball 82, which included seven fours and a six. Captain Umar Amin (52, five fours) and Ali Imran (50, four fours, one six) went in vain. For Balochistan, captain Yasir Shah led from the front and took three wickets for 57 from nine overs. Khurram Shahzad bagged two wickets for 61 from 10 overs. At the Multan Cricket Stadium, after being put into bat, Southern Punjab scored 314 for six in 50 overs on the back of half-centuries from Hassan Khan, Muhammad Imran and Sharoon Siraj. Batting at number three, Sharoon scored 57 off 77, hitting four fours and two sixes. Hassan and Imran put up an unbeaten 128-run partnership for the seventh wicket. Hassan scored 66 off 48, smashing eight fours and one six. Imran top-scored with 48-ball 71, which included four fours and as many sixes. Sindh’s Sohail Khan got three for 71 in nine overs. In turn, Sindh were dismissed for 268 in the 49th over. Opening batter Saim Ayub top-scored with a run-a-ball 82. The left-handed batter struck nine boundaries and two sixes during his 130 minutes stay at the crease. Sohail, batting at number seven, scored 44 off 37, hitting four fours and two sixes. Southern Punjab’s Zia-ul-Haq picked three wickets for 61. Captain Salman Ali Agha bagged two wickets for 34.","image_url":null,"source_id":"thenews","country":["pakistan"],"category":["sports"],"language":"english"},{"title":"Mando Markhor enter Khatri premier league final","link":"https://www.thenews.com.pk/print/943804-mando-markhor-enter-khatri-premier-league-final","keywords":null,"creator":null,"video_url":null,"description":"KARACHI: Mando Markhor entered the final of Khatri Premier League with an emphatic 31-run victory over Dawar Gladiators at Asghar Ali Shah Cricket Stadium the other day.Jamaluddin snapped up 5 wickets for 19 runs in 4 overs and off-spinner Saeed Hasan chipped in with two wickets for 24 runs and...","content":null,"pubDate":"2022-03-23 01:00:00","full_description":"KARACHI: Mando Markhor entered the final of Khatri Premier League with an emphatic 31-run victory over Dawar Gladiators at Asghar Ali Shah Cricket Stadium the other day. .ads_between_content{ height:auto; width:auto; clear: both; text-align: center; } .ads_between_content .story_ads{ } /*@media (max-width:600px){ .ads_between_content{ float:none; margin:0px auto; text-align: center; } }*/ Jamaluddin snapped up 5 wickets for 19 runs in 4 overs and off-spinner Saeed Hasan chipped in with two wickets for 24 runs and Kamran Khatri two wicket for 38 runs as Dawar Gladiators chasing 151 for victory were bowled out for 120 on the last ball of 20th over. Despite excellent batting by Sharyar Ghani (71), Dawar Gladiators batsmen played some poor strokes which brought their downfall. Sharyar hit six towering sixes and three fours. Earlier, Mando Markhor reached 152 for the loss of 9 wickets in 20 overs.","image_url":null,"source_id":"thenews","country":["pakistan"],"category":["sports"],"language":"english"},{"title":"India boost semi-final hopes as Australia crush SA","link":"https://www.thenews.com.pk/print/943800-india-boost-semi-final-hopes-as-australia-crush-sa","keywords":null,"creator":null,"video_url":null,"description":"HAMILTON: India boosted their Women’s Cricket World Cup semi-final prospects with a crushing 110-run win over Bangladesh on Tuesday, as a century from Australia captain Meg Lanning powered the tournament favourites to a five-wicket victory over South Africa.India set Bangladesh a target of...","content":null,"pubDate":"2022-03-23 01:00:00","full_description":"HAMILTON: India boosted their Women’s Cricket World Cup semi-final prospects with a crushing 110-run win over Bangladesh on Tuesday, as a century from Australia captain Meg Lanning powered the tournament favourites to a five-wicket victory over South Africa. .ads_between_content{ height:auto; width:auto; clear: both; text-align: center; } .ads_between_content .story_ads{ } /*@media (max-width:600px){ .ads_between_content{ float:none; margin:0px auto; text-align: center; } }*/ India set Bangladesh a target of 230 in Hamilton and then skittled them for 119 in 40.3 overs to keep alive their playoff hopes. In Tuesday’s other match, in Wellington, Lanning smashed an unbeaten 135 as Australia cruised past South Africa’s 271-5. It leaves previously unbeaten South Africa in a scrap for the three other semi-final berths with India, the West Indies and England. Australia were already into the last four. India chose to bat and appeared to be cruising at 74 without loss in the 15th over when Smriti Mandhana was dismissed for 30. It sparked a mini-collapse which saw India lose two wickets in successive balls without adding to the score as Shafali Verma was stumped on 42 and Mithali Raj caught for a first-ball duck. India entered the last 10 overs at 165-5 and their scoring momentum appeared to have stalled when Yastika Bhatia was dismissed for 50. But Pooja Vastrakar and Sneh Rana came together for a useful 48-run stand that helped give India’s bowlers a respectable total to defend. Bangladesh’s run chase never ignited in the face of tight bowling from India highlighted by four wickets for 30 from Rana. There was some middle-order resistance from Salma Khatun, who made 32, and Lata Mondal, 24, but they never looked like reeling in India’s target. The match between Australia and South Africa brought together the only two undefeated teams at this year’s tournament. With Australia already through to the semi-finals, South Africa had more to play for as a win would have sealed a spot in the top four. They set a solid target of 272 off the back of 90 from Laura Woolvardt but Australia’s formidable batting line-up easily overhauled the target with 28 balls to spare. “We had a great first innings and 270 was par, on another day the bowling attack would have defended it,” said South Africa captain Sune Luus. “We just lost it a bit on the field and probably lost a bit of focus... it won’t happen again.” Australia put South Africa in to bat after winning the toss but struggled to make early inroads as Woolvardt and Lizelle Lee put on an 88-run opening partnership. Woolvardt notched her fourth consecutive half-century at the tournament, supported by Luus’s run-a-ball 52 and Marizanne Kapp’s 30 off 21 balls. Australia’s openers departed cheaply but skipper Lanning stepped up to guide the six-time champions to 146-3 after 25 overs. “It sort of became clear to me that I had to bat through after we lost a couple of early wickets,” she said. It was Lanning’s 15th ODI century and came of 92 balls, including 13 fours and one six. Tahlia McGrath was Australia’s next best batter on 32, with Lanning’s teammates content to play cameo roles.","image_url":null,"source_id":"thenews","country":["pakistan"],"category":["sports"],"language":"english"},{"title":"42,000-plus to attend Warne MCG memorial","link":"https://thewest.com.au/sport/cricket/42000-plus-to-attend-warne-mcg-memorial-c-6171731","keywords":null,"creator":["Staff Writers"],"video_url":null,"description":"More than 42,000 people have booked to attend Shane Warne's state memorial service at the Melbourne Cricket Ground.","content":null,"pubDate":"2022-03-23 00:53:09","full_description":"More than 42,000 people will pay their in-person respects to cricket legend Shane Warne at his state memorial service. Bookings opened at 3pm on Tuesday through Ticketek for the Melbourne Cricket Ground event which will take place at 7pm on March 30. Victorian premier Daniel Andrews said 42,300 people have already snapped up a free ticket. \"That's a really strong start, I'm sure there will be many more,\" he told reporters on Wednesday morning. \"There are obviously seats still available. I'm sure Victorians will be there in massive numbers to pay tribute to a fantastic Victorian.\" Don't miss the latest sports news! Was $13 now $7 per week for 12 weeks* (Digital + Print) Enjoy unlimited access to thewest.com.au and everyday digital editions on any device. Thursday - Monday papers home delivered with all of the latest footy news! It will be the wider public's first chance to say goodbye to Warne following his death from a suspected heart attack at the Thai resort island of Koh Samui on March 4. Patrons will need to be fully vaccinated to attend the service, which is expected to run for two hours. Gates will open at 5.30pm and guests must be seated by 6.45pm for a 7pm start. Rather than flowers, Warne's family has asked people to donate to The Florey Institute of Neuroscience and Mental Health. Warne's state memorial follows a private funeral held on Sunday. The MCG event will be livestreamed on the Victorian government's website. The ground's Great Southern Stand will be renamed in Warne's honour.","image_url":"https://images.thewest.com.au/publication/C-6171731/91c7669d4d581101de32d65e5dfedb26c49e2d39-16x9-x0y75w800h450.jpg","source_id":"thewest","country":["australia"],"category":["sports"],"language":"english"},{"title":"42,000-plus to attend Warne MCG memorial","link":"https://www.perthnow.com.au/sport/cricket/42000-plus-to-attend-warne-mcg-memorial-c-6171732","keywords":null,"creator":["Staff Writers"],"video_url":null,"description":"More than 42,000 people have booked to attend Shane Warne's state memorial service at the Melbourne Cricket Ground.","content":null,"pubDate":"2022-03-23 00:53:09","full_description":"More than 42,000 people will pay their in-person respects to cricket legend Shane Warne at his state memorial service. Bookings opened at 3pm on Tuesday through Ticketek for the Melbourne Cricket Ground event which will take place at 7pm on March 30. Victorian premier Daniel Andrews said 42,300 people have already snapped up a free ticket. \"That's a really strong start, I'm sure there will be many more,\" he told reporters on Wednesday morning. \"There are obviously seats still available. I'm sure Victorians will be there in massive numbers to pay tribute to a fantastic Victorian.\" It will be the wider public's first chance to say goodbye to Warne following his death from a suspected heart attack at the Thai resort island of Koh Samui on March 4. Patrons will need to be fully vaccinated to attend the service, which is expected to run for two hours. Gates will open at 5.30pm and guests must be seated by 6.45pm for a 7pm start. Rather than flowers, Warne's family has asked people to donate to The Florey Institute of Neuroscience and Mental Health. Warne's state memorial follows a private funeral held on Sunday. The MCG event will be livestreamed on the Victorian government's website. The ground's Great Southern Stand will be renamed in Warne's honour.","image_url":"https://images.perthnow.com.au/publication/C-6171732/91c7669d4d581101de32d65e5dfedb26c49e2d39-16x9-x0y75w800h450.jpg","source_id":"perthnow","country":["australia"],"category":["sports"],"language":"english"},{"title":"More than 42,000 to attend Warne memorial","link":"https://www.perthnow.com.au/sport/cricket/more-than-42000-to-attend-warne-memorial-c-6170944","keywords":null,"creator":["Staff Writers"],"video_url":null,"description":"More than 42,000 people have booked to attend Shane Warne's state memorial service at the Melbourne Cricket Ground.","content":null,"pubDate":"2022-03-22 23:24:12","full_description":"More than 42,000 people will pay their in-person respects to cricket legend Shane Warne at his state memorial service. Bookings opened at 3pm on Tuesday through Ticketek for the Melbourne Cricket Ground event which will take place at 7pm on March 30. Victorian Premier Daniel Andrews said 42,300 people have already snapped up a free ticket. \"That's a really strong start, I'm sure there will be many more,\" he told reporters on Wednesday morning. \"There are obviously seats still available. I'm sure Victorians will be there in massive numbers to pay tribute to a fantastic Victorian.\" It will be the wider public's first chance to say goodbye to Warne following his death from a suspected heart attack at the Thai resort island of Koh Samui on March 4. Patrons will need to be fully vaccinated to attend the service, which is expected to run for two hours. Gates will open at 5.30pm and guests must be seated by 6.45pm for a 7pm start. Rather than flowers, Warne's family has asked people to donate to The Florey Institute of Neuroscience and Mental Health. Warne's state memorial follows a private funeral held on Sunday. The MCG event will be livestreamed on the Victorian government's website. The ground's Great Southern Stand will be renamed in Warne's honour.","image_url":"https://images.perthnow.com.au/publication/C-6170944/bf952198d3dd39a7d4a489dfd5859bdc215f4b32-16x9-x0y75w800h450.jpg","source_id":"perthnow","country":["australia"],"category":["sports"],"language":"english"},{"title":"More than 42,000 to attend Warne memorial","link":"https://thewest.com.au/sport/cricket/more-than-42000-to-attend-warne-memorial-c-6170946","keywords":null,"creator":["Staff Writers"],"video_url":null,"description":"More than 42,000 people have booked to attend Shane Warne's state memorial service at the Melbourne Cricket Ground.","content":null,"pubDate":"2022-03-22 23:24:12","full_description":"More than 42,000 people will pay their in-person respects to cricket legend Shane Warne at his state memorial service. Bookings opened at 3pm on Tuesday through Ticketek for the Melbourne Cricket Ground event which will take place at 7pm on March 30. Victorian Premier Daniel Andrews said 42,300 people have already snapped up a free ticket. \"That's a really strong start, I'm sure there will be many more,\" he told reporters on Wednesday morning. \"There are obviously seats still available. I'm sure Victorians will be there in massive numbers to pay tribute to a fantastic Victorian.\" Don't miss the latest sports news! Was $13 now $7 per week for 12 weeks* (Digital + Print) Enjoy unlimited access to thewest.com.au and everyday digital editions on any device. Thursday - Monday papers home delivered with all of the latest footy news! It will be the wider public's first chance to say goodbye to Warne following his death from a suspected heart attack at the Thai resort island of Koh Samui on March 4. Patrons will need to be fully vaccinated to attend the service, which is expected to run for two hours. Gates will open at 5.30pm and guests must be seated by 6.45pm for a 7pm start. Rather than flowers, Warne's family has asked people to donate to The Florey Institute of Neuroscience and Mental Health. Warne's state memorial follows a private funeral held on Sunday. The MCG event will be livestreamed on the Victorian government's website. The ground's Great Southern Stand will be renamed in Warne's honour.","image_url":"https://images.thewest.com.au/publication/C-6170946/bf952198d3dd39a7d4a489dfd5859bdc215f4b32-16x9-x0y75w800h450.jpg","source_id":"thewest","country":["australia"],"category":["sports"],"language":"english"},{"title":"'That was extraordinary': Cricket world stunned by 'bizarre' incident","link":"https://au.sports.yahoo.com/cricket-2022-alex-carey-bizarre-aleem-dar-decision-pakistan-australia-third-test-231753656.html","keywords":null,"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2022-03-22 23:17:53","image_url":"https://s.yimg.com/os/creatr-uploaded-images/2022-03/d7b0c3f0-aa34-11ec-b3bf-bcc1fa1dc58f","source_id":"yahoo","country":["australia"],"category":["sports"],"language":"english"},{"title":"'Oh dear': Cricket world divided over baffling Steve Smith drama","link":"https://au.sports.yahoo.com/cricket-2022-steve-smith-alex-carey-mix-up-australia-pakistan-third-test-215436814.html","keywords":null,"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2022-03-22 21:54:36","image_url":"https://s.yimg.com/os/creatr-uploaded-images/2022-03/b1af00a0-aa29-11ec-b7b0-877aad9d31bd","source_id":"yahoo","country":["australia"],"category":["sports"],"language":"english"},{"title":"Australia put up 391 in Lahore on day two against Pakistan","link":"https://www.cairnspost.com.au/sport/cricket/australia-put-up-391-in-lahore-on-day-two-against-pakistan/video/3827e36cfdd61fad0db5645d3cc4663d","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket: Australia had Cameron Green and Alex Carey to thank for a strong start to day two against Pakistan, but could do little damage with the ball late on.","content":null,"pubDate":"2022-03-22 20:36:23","full_description":null,"image_url":null,"source_id":"cairnspost","country":["australia"],"category":["sports"],"language":"english"},{"title":"“You don’t have to be best friends off the field”: Gautam Gambhir opens up on Krunal Pandya-Deepak Hooda relationship at Lucknow Super Giants camp ahead of IPL 2022","link":"https://thesportsrush.com/cricket-news-you-dont-have-to-be-best-friends-off-the-field-gautam-gambhir-opens-up-on-krunal-pandya-deepak-hooda-relationship-at-lucknow-super-giants-camp-ahead-of-ipl-2022/","keywords":["Cricket","IPL 2022","Deepak Hooda","Indian Premier League","IPL","Krunal Pandya","Lucknow Super Giants"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Part of the LSG squad, Gautam Gambhir opens up on Krunal Pandya-Deepak Hooda relationship ahead of 15th season of the IPL. During the two-day mega auction event for the imminent season of the IPL, the signings of former Baroda teammates in Krunal Pandya and Deepak Hooda into the Lucknow Super Giants (LSG) squad had raised… The post “You don’t have to be best friends off the field”: Gautam Gambhir opens up on Krunal Pandya-Deepak Hooda relationship at Lucknow Super Giants camp ahead of IPL 2022 appeared first on The SportsRush.","content":"Part of the LSG squad, Gautam Gambhir opens up on Krunal Pandya-Deepak Hooda relationship ahead of 15th season of the IPL. During the two-day mega auction event for the imminent season of the IPL, the signings of former Baroda teammates in Krunal Pandya and Deepak Hooda into the Lucknow Super Giants (LSG) squad had raised quite some eyebrows of the fans. While Pandya was roped in at INR 8.25 Crore, Hooda was acquired at INR 5.75 Crore, with the to-be debutant franchise clearly eyeing at the Indian all-rounders to strengthen their squad. Former Indian batter and at present the newly-appointed mentor of Lucknow Super Giants (LSG), Gautam Gambhir, has given his reactions on the sour relationship that had developed between the aforementioned players the previous year. 5 days to go! #AbApniBaariHai pic.twitter.com/o5v4py7fCl — Lucknow Super Giants (@LucknowIPL) March 21, 2022 Gautam Gambhir opens up on Krunal Pandya-Deepak Hooda relationship During an interaction with the Press Trust of India (PTI), Gambhir, while addressing the apparent damaging relationship Pandya and Hooda had inflicted upon themselves last year, remarked that both the players are professional and one doesn’t have to be good friends with everyone in the team off-the-field to perform on it. “Look, you don’t have to be best friends off the field to perform on it. They are professionals and they know that they have a job to do. You don’t have to go out for dinner every night if you are playing in the same team. I have not been friends with everyone in every team that I have played in,” exclaimed Gambhir. The LSG mentor further stated that both the players have no other purpose within the team apart from winning matches for Lucknow. “But that hasn’t stopped me from giving my best when I am out there on the field. These are matured people and they know they are here to win matches for Lucknow,” he further said. Hooda-Pandya controversy Ahead of the Syed Mushtaq Ali T20 tournament last year, Deepak Hooda had pulled out of the Baroda squad while alleging that Krunal Pandya (Baroda’s captain) had abused him before his teammates and other state teams at Vadodara. He further exclaimed that Pandya had even bullied him while also stopping him from training despite having secured permission for the same by team head coach Prabhakar Bairgond. A few days later, Hooda was suspended for the rest of the domestic season by the Baroda Cricket Association (BCA) on grounds of ‘indiscipline’ and for bringing disrepute to the organization. With Pandya yet to react on the matter, Hooda, six months later, joined the Rajasthan domestic side for the 2021-22 season. The post “You don’t have to be best friends off the field”: Gautam Gambhir opens up on Krunal Pandya-Deepak Hooda relationship at Lucknow Super Giants camp ahead of IPL 2022 appeared first on The SportsRush.","pubDate":"2022-03-22 19:15:57","full_description":"Part of the LSG squad, Gautam Gambhir opens up on Krunal Pandya-Deepak Hooda relationship ahead of 15th season of the IPL. During the two-day mega auction event for the imminent season of the IPL , the signings of former Baroda teammates in Krunal Pandya and Deepak Hooda into the Lucknow Super Giants (LSG) squad had raised quite some eyebrows of the fans. While Pandya was roped in at INR 8.25 Crore, Hooda was acquired at INR 5.75 Crore, with the to-be debutant franchise clearly eyeing at the Indian all-rounders to strengthen their squad. Former Indian batter and at present the newly-appointed mentor of Lucknow Super Giants (LSG), Gautam Gambhir , has given his reactions on the sour relationship that had developed between the aforementioned players the previous year. 5 days to go! #AbApniBaariHai pic.twitter.com/o5v4py7fCl — Lucknow Super Giants (@LucknowIPL) March 21, 2022 During an interaction with the Press Trust of India (PTI), Gambhir, while addressing the apparent damaging relationship Pandya and Hooda had inflicted upon themselves last year, remarked that both the players are professional and one doesn’t have to be good friends with everyone in the team off-the-field to perform on it. “Look, you don’t have to be best friends off the field to perform on it. They are professionals and they know that they have a job to do. You don’t have to go out for dinner every night if you are playing in the same team. I have not been friends with everyone in every team that I have played in,” exclaimed Gambhir. The LSG mentor further stated that both the players have no other purpose within the team apart from winning matches for Lucknow. “But that hasn’t stopped me from giving my best when I am out there on the field. These are matured people and they know they are here to win matches for Lucknow,” he further said. Ahead of the Syed Mushtaq Ali T20 tournament last year, Deepak Hooda had pulled out of the Baroda squad while alleging that Krunal Pandya (Baroda’s captain) had abused him before his teammates and other state teams at Vadodara. He further exclaimed that Pandya had even bullied him while also stopping him from training despite having secured permission for the same by team head coach Prabhakar Bairgond. A few days later, Hooda was suspended for the rest of the domestic season by the Baroda Cricket Association (BCA) on grounds of ‘indiscipline’ and for bringing disrepute to the organization. With Pandya yet to react on the matter, Hooda, six months later, joined the Rajasthan domestic side for the 2021-22 season.","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Jason Roy fined and given suspended two-match ban for undisclosed reason","link":"https://www.theguardian.com/sport/2022/mar/22/jason-roy-fined-and-given-suspended-two-match-ban-for-undisclosed-reason","keywords":["England cricket team","Cricket","Surrey","Sport"],"creator":["Ali Martin in Grenada"],"video_url":null,"description":"ECB declines to give further details of Roy’s alleged offenceOpener will take break from game to ‘spend time with family’Jason Roy has been hit with a suspended two-match ban from international cricket and a £2,500 fine, the reasons for which are being kept out of the public domain by the England and Wales Cricket Board.Announcing the sanction on Tuesday, the ECB statement said the limited-overs opener had accepted a charge of bringing the game into disrepute handed down by its Cricket Discipline Commission, with the suspended element of his ban “dependent on good behaviour” over the next 12 months. Continue reading...","content":null,"pubDate":"2022-03-22 19:08:23","full_description":"Jason Roy has been hit with a suspended two-match ban from international cricket and a £2,500 fine, the reasons for which are being kept out of the public domain by the England and Wales Cricket Board. Announcing the sanction on Tuesday, the ECB statement said the limited-overs opener had accepted a charge of bringing the game into disrepute handed down by its Cricket Discipline Commission, with the suspended element of his ban “dependent on good behaviour” over the next 12 months. The governing body has since said the CDC, which deals with disciplinary issues in the professional game and operates at “arm’s length”, is not prepared to provide any further details about Roy’s alleged transgression, raising questions over the transparency of the process. The statement read: “A disciplinary panel of the Cricket Discipline Commission has announced its sanction on Jason Roy after he admitted a charge of conducting himself in a manner which may be prejudicial to the interests of cricket or which may bring the game of cricket, the ECB and himself into disrepute, in breach of ECB Directive 3.3.” While Roy must pay his fine by the end of the month, he will be available for England’s next set of white-ball fixtures – a three-match away series against Netherlands in June – having most recently featured during the five-match Twenty20 series against West Indies in the Caribbean in January. The 2019 World Cup winner has since announced a break from cricket to “spend some quality time with my family” after pulling out of a £200,000 deal to play for Gujarat Titans in the Indian Premier League. In a statement released at the time of this IPL withdrawal, the 31-year-old said: “With everything going on in the world over the last three years, it’s added up and taken a toll on me. I feel it’s only right I spend some quality time with my family. As well as spending time working on myself and my game over the next couple of months leading into a busy year.” Surrey have not put a date on Roy’s return to county cricket but have said “he will remain in contact with the club during this period, with staff keen to assist him where possible.”","image_url":"https://i.guim.co.uk/img/media/f6903053e04bd0b2ce0e0d89c380b48a6ce14092/0_46_1538_923/master/1538.jpg?width=460&quality=85&auto=format&fit=max&s=4dd16dc77396f3e0788fca7e8fd51dac","source_id":"theguardian","country":["united kingdom","india","singapore","canada"],"category":["sports"],"language":"english"},{"title":"Seating capacity of Wankhede Stadium: Full IPL 2022 venue list with seating capacity","link":"https://thesportsrush.com/cricket-news-seating-capacity-of-wankhede-stadium-full-ipl-2022-venue-list-with-seating-capacity/","keywords":["Cricket","IPL 2022","Indian Premier League","IPL","Wankhede Stadium"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Seating capacity of Wankhede Stadium: The iconic Wankhede Stadium is one of the four venues where IPL 2022 league matches would take place. Mumbai’s iconic Wankhede Stadium would host the much-awaited 15th season of the Indian Premier League (IPL) tournament opener between the previous season finalists in Chennai Super Kings (CSK) and Kolkata Knight Riders… The post Seating capacity of Wankhede Stadium: Full IPL 2022 venue list with seating capacity appeared first on The SportsRush.","content":"Seating capacity of Wankhede Stadium: The iconic Wankhede Stadium is one of the four venues where IPL 2022 league matches would take place. Mumbai’s iconic Wankhede Stadium would host the much-awaited 15th season of the Indian Premier League (IPL) tournament opener between the previous season finalists in Chennai Super Kings (CSK) and Kolkata Knight Riders (KKR) on March 26. Keeping in view the COVID-19 guidelines in place, the BCCI decided to conduct the league phase of the IPL in the state of Maharashtra across two cities in Mumbai and Pune. Three stadiums in Mumbai – Wankhede (20 matches), Brabourne (15 matches), DY Patil (20 matches) will host 55 league encounters, while Pune’s MCA Stadium would host 15 league matches in total. As against the initial permission from the Maharashtra state government to allow crowds to the tune of mere 25% seating capacity across the three venues in Mumbai, the latest development states that the spectator numbers could rise with the overall significant decline in the number of COVID-19 cases in the state. Seating capacity of Wankhede Stadium Post a revamped structure provided to the stands of the Wankhede Stadium ahead of the 2011 World Cup in India, the iconic stadium, where India lifted the World Cup, presently has a seating capacity of around 32,000. As per the initial estimate, the stadium would take in an approximate 9,800-10,000 people spectators during the initial few matches of the league phase for the imminent season. Dr. Vijay Patil, the President of the Mumbai Cricket Association shares an update on the iconic Wankhede Stadium’s renovation. He also adds that providing top-class facilities to fans has always been our top priority.#MCA #Mumbai #Cricket #IndianCricket #Wankhede #BCCI #TATAIPL pic.twitter.com/mIEheN0aKK — Mumbai Cricket Association (MCA) (@MumbaiCricAssoc) March 19, 2022 Mumbai’s Brabourne and DY Patil Stadium would admit 7-8,000 and 11-12,000 spectators respectively, while Pune’s MCA Stadium is likely to allow 12,000 fans’ entry within the stadium premises during the initial matches of the league stage. While the BCCI is likely to announce the dates for the sale of tickets across these venues as by March 23 (Wednesday). One can click here to get a know-how of the ticket booking process. Full IPL 2022 venue list with seating capacity Wankhede Stadium – 32,000 seating capacity Brabourne Stadium – 28,000 seating capacity DY Patil Stadium – 60,000 seating capacity Maharashtra Cricket Association (MCA) Stadium – 37,000 seating capacity. The post Seating capacity of Wankhede Stadium: Full IPL 2022 venue list with seating capacity appeared first on The SportsRush.","pubDate":"2022-03-22 17:59:12","full_description":"Seating capacity of Wankhede Stadium: The iconic Wankhede Stadium is one of the four venues where IPL 2022 league matches would take place. Mumbai’s iconic Wankhede Stadium would host the much-awaited 15th season of the Indian Premier League (IPL) tournament opener between the previous season finalists in Chennai Super Kings (CSK) and Kolkata Knight Riders (KKR) on March 26. Keeping in view the COVID-19 guidelines in place, the BCCI decided to conduct the league phase of the IPL in the state of Maharashtra across two cities in Mumbai and Pune. Three stadiums in Mumbai – Wankhede (20 matches), Brabourne (15 matches), DY Patil (20 matches) will host 55 league encounters, while Pune’s MCA Stadium would host 15 league matches in total. As against the initial permission from the Maharashtra state government to allow crowds to the tune of mere 25% seating capacity across the three venues in Mumbai, the latest development states that the spectator numbers could rise with the overall significant decline in the number of COVID-19 cases in the state. Post a revamped structure provided to the stands of the Wankhede Stadium ahead of the 2011 World Cup in India, the iconic stadium, where India lifted the World Cup, presently has a seating capacity of around 32,000. As per the initial estimate, the stadium would take in an approximate 9,800-10,000 people spectators during the initial few matches of the league phase for the imminent season. Dr. Vijay Patil, the President of the Mumbai Cricket Association shares an update on the iconic Wankhede Stadium’s renovation. He also adds that providing top-class facilities to fans has always been our top priority. #MCA #Mumbai #Cricket #IndianCricket #Wankhede #BCCI #TATAIPL pic.twitter.com/mIEheN0aKK — Mumbai Cricket Association (MCA) (@MumbaiCricAssoc) March 19, 2022 Mumbai’s Brabourne and DY Patil Stadium would admit 7-8,000 and 11-12,000 spectators respectively, while Pune’s MCA Stadium is likely to allow 12,000 fans’ entry within the stadium premises during the initial matches of the league stage. While the BCCI is likely to announce the dates for the sale of tickets across these venues as by March 23 (Wednesday). One can click here to get a know-how of the ticket booking process. Wankhede Stadium – 32,000 seating capacity Brabourne Stadium – 28,000 seating capacity DY Patil Stadium – 60,000 seating capacity Maharashtra Cricket Association (MCA) Stadium – 37,000 seating capacity.","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Jason Roy Handed Suspended Two-Match Ban By England Cricket Board","link":"https://sports.ndtv.com/cricket/jason-roy-handed-suspended-two-match-ban-by-england-cricket-board-2837411","keywords":null,"creator":null,"video_url":null,"description":"Jason Roy is suspended from England's next two matches for which he is eligible for selection but the ban will be suspended for 12 months dependent on good behaviour.","content":null,"pubDate":"2022-03-22 17:43:28","full_description":"England batter Jason Roy has been handed a suspended two-match international ban, the England and Wales Cricket Board announced on Tuesday. \"A disciplinary panel of the Cricket Discipline Commission has announced its sanction on Jason Roy after he admitted a charge of conducting himself in a manner which may be prejudicial to the interests of cricket or which may bring the game of cricket, the ECB and himself into disrepute,\" the ECB said. Details of the offence have not been disclosed. Roy, who helped England win the 50-over World Cup in 2019, is suspended from his country's next two matches for which he is eligible for selection but the ban will be suspended for 12 months dependent on good behaviour. The 31-year-old has also been handed a fine of 2,500 pounds ($3,300). Roy, who is expected to be in England's T20 World Cup side in Australia later this year, recently announced he was taking a \"short indefinite break\" from cricket, which means he is missing the Indian Premier League .","image_url":"https://c.ndtvimg.com/2022-03/e4svq8a_jason-roy-twitter_625x300_01_March_22.jpg?im=FaceCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"England's Roy cops fine and suspended ban","link":"https://www.perthnow.com.au/sport/cricket/englands-roy-cops-fine-and-suspended-ban-c-6168920","keywords":null,"creator":["Staff Writers"],"video_url":null,"description":"Jason Roy, the England opener, has been hit with a fine and suspended international ban for behaviour 'prejudicial to the interests of cricket'.","content":null,"pubDate":"2022-03-22 17:29:01","full_description":"England opener Jason Roy has been handed a suspended two-match ban for \"conducting himself in a manner which may be prejudicial to the interests of cricket\" and bringing it into disrepute. Neither the England and Wales Cricket Board (ECB) nor the Cricket Discipline Commission (CDC), the body that hears disciplinary cases in the domestic game, revealed the incident he had been charged for. \"The CDC has announced its sanction on Jason Roy after he admitted a charge of conducting himself in a manner which may be prejudicial to the interests of cricket or which may bring the game of cricket, the ECB and himself into disrepute, in breach of ECB Directive 3.3,\" the board said in a statement on Tuesday. The CDC further ruled that Roy be \"suspended from the next two England matches for which he is eligible for selection, but that punishment should be suspended for 12 months dependent on good behaviour\". He was also fined PS2,500 ($A4,450). The 31-year-old, who has played 98 one-day internationals and 58 Twenty20 internationals for England, earlier this month withdrew from the Indian Premier League (IPL), saying global events in the past three years had taken their toll on him. Roy plays for Surrey in English domestic cricket and has played for Thunder, Sixers and Scorchers in the Big Bash League.","image_url":"https://images.perthnow.com.au/publication/C-6168920/5fa50ad0a00d7f2da1f4ce08cdd57f45bcd3f0ce-16x9-x0y0w1280h720.jpg","source_id":"perthnow","country":["australia"],"category":["sports"],"language":"english"},{"title":"England's Roy cops fine and suspended ban","link":"https://thewest.com.au/sport/cricket/englands-roy-cops-fine-and-suspended-ban-c-6168917","keywords":null,"creator":["Staff Writers"],"video_url":null,"description":"Jason Roy, the England opener, has been hit with a fine and suspended international ban for behaviour 'prejudicial to the interests of cricket'.","content":null,"pubDate":"2022-03-22 17:29:00","full_description":"England opener Jason Roy has been handed a suspended two-match ban for \"conducting himself in a manner which may be prejudicial to the interests of cricket\" and bringing it into disrepute. Neither the England and Wales Cricket Board (ECB) nor the Cricket Discipline Commission (CDC), the body that hears disciplinary cases in the domestic game, revealed the incident he had been charged for. \"The CDC has announced its sanction on Jason Roy after he admitted a charge of conducting himself in a manner which may be prejudicial to the interests of cricket or which may bring the game of cricket, the ECB and himself into disrepute, in breach of ECB Directive 3.3,\" the board said in a statement on Tuesday. The CDC further ruled that Roy be \"suspended from the next two England matches for which he is eligible for selection, but that punishment should be suspended for 12 months dependent on good behaviour\". He was also fined PS2,500 ($A4,450). The 31-year-old, who has played 98 one-day internationals and 58 Twenty20 internationals for England, earlier this month withdrew from the Indian Premier League (IPL), saying global events in the past three years had taken their toll on him. Roy plays for Surrey in English domestic cricket and has played for Thunder, Sixers and Scorchers in the Big Bash League. Don't miss the latest sports news! Was $13 now $7 per week for 12 weeks* (Digital + Print) Enjoy unlimited access to thewest.com.au and everyday digital editions on any device. Thursday - Monday papers home delivered with all of the latest footy news!","image_url":"https://images.thewest.com.au/publication/C-6168917/5fa50ad0a00d7f2da1f4ce08cdd57f45bcd3f0ce-16x9-x0y0w1280h720.jpg","source_id":"thewest","country":["australia"],"category":["sports"],"language":"english"},{"title":"England batter Jason Roy handed suspended two-match international ban","link":"https://www.business-standard.com/article/international/england-batter-jason-roy-handed-suspended-two-match-international-ban-122032201291_1.html","keywords":null,"creator":null,"video_url":null,"description":"ECB said Roy admitted to a charge of \"conducting himself in a manner which may be prejudicial to the interests of cricket or which may bring the game of cricket, the ECB and himself into disrepute\"","content":null,"pubDate":"2022-03-22 17:24:00","full_description":"England batter Jason Roy was handed a suspended two-match international ban on Tuesday for bringing the sport into disrepute. Details about the exact nature of Roy's disciplinary breach were not disclosed by the England and Wales Cricket Board. The ECB said Roy admitted to a charge of \"conducting himself in a manner which may be prejudicial to the interests of cricket or which may bring the game of cricket, the ECB and himself into disrepute.\" His ban is for the \"next two England matches for which he is eligible for selection\" but it is suspended for 12 months, dependent on good behaviour, the ECB said. The 31-year-old Roy was also fined 2,500 pounds (USD 3,310). Roy, who played a key role in helping England win the 50-over Cricket World Cup in 2019, is expected to be in England's squad for the Twenty20 World Cup in Australia this year. He recently announced he was taking a \"short indefinite break\" from cricket after withdrawing from the upcoming Indian Premier League, citing bubble fatigue. He was due to play for Gujarat Titans. (Only the headline and picture of this report may have been reworked by the Business Standard staff; the rest of the content is auto-generated from a syndicated feed.)","image_url":"https://bsmedia.business-standard.com/_media/bs/img/article/default/1220322/thumb-122032201291.jpg","source_id":"business-standard","country":["india"],"category":["sports"],"language":"english"},{"title":"Naseem, Green begin Test cricket’s newest rivalry","link":"https://www.smh.com.au/sport/cricket/naseem-green-begin-test-cricket-s-newest-rivalry-20220322-p5a6z0.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Daniel Brettig"],"video_url":null,"description":"Naseem Shah and Cameron Green are two young cricketers capable of drawing new followers to Test cricket over a decade.","content":null,"pubDate":"2022-03-22 17:09:09","full_description":"A few soporific Test matches on deathly dull pitches, one in Rawalpindi and two in the Caribbean, have been enough to roll out a few familiar lines about the perils at hand for the game’s longest form. Such concerns might have been a little less noisy had the Karachi Test ended in a result - something well within Australia’s grasp but for a few missed chances - but they would still have been raised. What game’s imminent death has been more frequently heralded than that of Test cricket? Naseem Shah ends Cameron Green’s innings at 79. Credit: AP No-one doubts the truth that Test matches, and international cricket in general, face some major hurdles in coming months and years. Chief among these is the financial imperative. In a market increasingly crowded by the IPL, most of the game’s nations will look nervously to the cash they will derive from the next round of ICC global broadcast rights later this year. The funds they can draw from the Indian market through bilateral series have been diminishing for some time. In Lahore, though, the game actually regathered significant ground the moment the first ball of this game was bowled. It was the first time a Test had been played in one of Pakistan’s most storied stadiums since a terror attack on the Sri Lanka touring team and match officials in 2009. And over the first two undulating days of battle between Pakistan and Australia, spectators and viewers were privy to another development that, in its way, will help reinforce the future of the long game for at least the next generation. In Naseem Shah, 19, and Cameron Green, 22, the hosts and their visitors each possess a young cricketer capable of drawing new followers to the game over the next decade or more. A Test match renaissance during the 1990s was driven at least in part by the arrival of Shane Warne as a one-man advertisement for the attacking virtues of leg spin. While neither Nassem nor Green can offer up wrist spin’s mysteries, their chosen skills are of similarly attractive kinds. As an allrounder already capable of commanding a place in the Australian side with either the bat or the ball, Green could well be the most versatile talent to emerge since the days of Jacques Kallis and Andrew Flintoff. After Australia’s middle order stumbled late on the opening day, Green’s combination of composure, power and height produced arguably his best innings yet, ensuring the tourists would reach the outskirts of 400 in the first innings and so have the chance to put Pakistan under pressure. One stand up punch through the off side, from a Shaheen Afridi delivery that bounced to a height most batters would struggle to get on top of, aptly demonstrated how Green has made the most of his natural attributes. And a combination of sound strike rotation and the occasional angry shot illustrated that, with time, Green will move past the nervous starts that have punctuated his performances at every level thus far. Pakistan’s Imam-ul-Haq, right, reacts while Australia’s Cameron Green celebrates his dismissal. Credit: AP As Green and Alex Carey took their sixth wicket stand to a fluent 135, it looked momentarily plausible that both might sculpt a first Test hundred in the same innings. A similar moment had arrived at Headingley in 1989, when Mark Taylor and Steve Waugh each carved out the first of 51 centuries between them. Here, though, the day’s other youthful hero took his curtain call. When Naseem appeared in Australia as a 16-year-old in 2019, he was fast but wild in an outmatched team a long way from home. This time around, injuries allowed him to move back into Test match reckoning for Australia’s first visit since 1998. In Rawalpindi, Naseem offered moments of promise on the deadest of surfaces: a mere teaser for his Lahore efforts. From the start, Naseem knew exactly what he was trying to do - hit the stumps with the ball moving into the right-hander, occasionally bending the ball away from variation. His whippy, rhythmic action looks an amalgam of Waqar Younis and Aqib Javed, the former watching in commentary like a proud uncle. Pakistan’s Naseem Shah, right, celebrates after taking the wicket of Australia’s Nathan Lyon. Credit: AP Photo/K.M. Chaudary For a time, Green was able to keep Naseem out, helped by the fact that the left-handed Carey handled him better, just as Usman Khawaja had done relative to Steve Smith on day one. It was clear to all, as well, exactly what Naseem was trying to do, reversing the ball into Green’s pads and stumps. But after surviving 38 balls for a return of only seven runs, Green was flummoxed when Naseem pulled his length back a little. Still gaining some sharp inswing, Naseem had the ball carry on off the seam to beat the No. 6’s slightly crooked defensive stroke and scatter the stumps at 140kph. Amid the loss of Australia’s last five wickets for 50, Naseem’s performance was of the kind to be enjoyed for both its present effectiveness but also what it promised for the future. Even on unhelpful pitches, his is a talent that will be capable of slicing through opponents. As important as the way Green and Naseem each imposed themselves on day two in Lahore was their clear enjoyment in doing so. Whatever may be said about pitches, schedules or finances, the future of Test cricket will always depend on the emergence of new generations just as eager to prove themselves as the players in whose footsteps they follow. The Morning Edition newsletter is our guide to the day’s most important and interesting stories, analysis and insights. Sign up here .","image_url":null,"source_id":"smh","country":["australia"],"category":["sports"],"language":"english"},{"title":"Naseem, Green begin Test cricket’s newest rivalry","link":"https://www.theage.com.au/sport/cricket/naseem-green-begin-test-cricket-s-newest-rivalry-20220322-p5a6z0.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Daniel Brettig"],"video_url":null,"description":"Naseem Shah and Cameron Green are two young cricketers capable of drawing new followers to Test cricket over a decade.","content":null,"pubDate":"2022-03-22 17:09:09","full_description":"A few soporific Test matches on deathly dull pitches, one in Rawalpindi and two in the Caribbean, have been enough to roll out a few familiar lines about the perils at hand for the game’s longest form. Such concerns might have been a little less noisy had the Karachi Test ended in a result - something well within Australia’s grasp but for a few missed chances - but they would still have been raised. What game’s imminent death has been more frequently heralded than that of Test cricket? Naseem Shah ends Cameron Green’s innings at 79. Credit: AP No-one doubts the truth that Test matches, and international cricket in general, face some major hurdles in coming months and years. Chief among these is the financial imperative. In a market increasingly crowded by the IPL, most of the game’s nations will look nervously to the cash they will derive from the next round of ICC global broadcast rights later this year. The funds they can draw from the Indian market through bilateral series have been diminishing for some time. In Lahore, though, the game actually regathered significant ground the moment the first ball of this game was bowled. It was the first time a Test had been played in one of Pakistan’s most storied stadiums since a terror attack on the Sri Lanka touring team and match officials in 2009. And over the first two undulating days of battle between Pakistan and Australia, spectators and viewers were privy to another development that, in its way, will help reinforce the future of the long game for at least the next generation. In Naseem Shah, 19, and Cameron Green, 22, the hosts and their visitors each possess a young cricketer capable of drawing new followers to the game over the next decade or more. A Test match renaissance during the 1990s was driven at least in part by the arrival of Shane Warne as a one-man advertisement for the attacking virtues of leg spin. While neither Nassem nor Green can offer up wrist spin’s mysteries, their chosen skills are of similarly attractive kinds. As an allrounder already capable of commanding a place in the Australian side with either the bat or the ball, Green could well be the most versatile talent to emerge since the days of Jacques Kallis and Andrew Flintoff. After Australia’s middle order stumbled late on the opening day, Green’s combination of composure, power and height produced arguably his best innings yet, ensuring the tourists would reach the outskirts of 400 in the first innings and so have the chance to put Pakistan under pressure. One stand up punch through the off side, from a Shaheen Afridi delivery that bounced to a height most batters would struggle to get on top of, aptly demonstrated how Green has made the most of his natural attributes. And a combination of sound strike rotation and the occasional angry shot illustrated that, with time, Green will move past the nervous starts that have punctuated his performances at every level thus far. Pakistan’s Imam-ul-Haq, right, reacts while Australia’s Cameron Green celebrates his dismissal. Credit: AP As Green and Alex Carey took their sixth wicket stand to a fluent 135, it looked momentarily plausible that both might sculpt a first Test hundred in the same innings. A similar moment had arrived at Headingley in 1989, when Mark Taylor and Steve Waugh each carved out the first of 51 centuries between them. Here, though, the day’s other youthful hero took his curtain call. When Naseem appeared in Australia as a 16-year-old in 2019, he was fast but wild in an outmatched team a long way from home. This time around, injuries allowed him to move back into Test match reckoning for Australia’s first visit since 1998. In Rawalpindi, Naseem offered moments of promise on the deadest of surfaces: a mere teaser for his Lahore efforts. From the start, Naseem knew exactly what he was trying to do - hit the stumps with the ball moving into the right-hander, occasionally bending the ball away from variation. His whippy, rhythmic action looks an amalgam of Waqar Younis and Aqib Javed, the former watching in commentary like a proud uncle. Pakistan’s Naseem Shah, right, celebrates after taking the wicket of Australia’s Nathan Lyon. Credit: AP Photo/K.M. Chaudary For a time, Green was able to keep Naseem out, helped by the fact that the left-handed Carey handled him better, just as Usman Khawaja had done relative to Steve Smith on day one. It was clear to all, as well, exactly what Naseem was trying to do, reversing the ball into Green’s pads and stumps. But after surviving 38 balls for a return of only seven runs, Green was flummoxed when Naseem pulled his length back a little. Still gaining some sharp inswing, Naseem had the ball carry on off the seam to beat the No. 6’s slightly crooked defensive stroke and scatter the stumps at 140kph. Amid the loss of Australia’s last five wickets for 50, Naseem’s performance was of the kind to be enjoyed for both its present effectiveness but also what it promised for the future. Even on unhelpful pitches, his is a talent that will be capable of slicing through opponents. As important as the way Green and Naseem each imposed themselves on day two in Lahore was their clear enjoyment in doing so. Whatever may be said about pitches, schedules or finances, the future of Test cricket will always depend on the emergence of new generations just as eager to prove themselves as the players in whose footsteps they follow. The Morning Edition newsletter is our guide to the day’s most important and interesting stories, analysis and insights. Sign up here .","image_url":null,"source_id":"theage","country":["australia"],"category":["sports"],"language":"english"},{"title":"“IPL is one of the greatest physios in the world”: Ravi Shastri takes explicit dig at players recovering from injury before an IPL season","link":"https://thesportsrush.com/cricket-news-ipl-is-one-of-the-greatest-physios-in-the-world-ravi-shastri-takes-explicit-dig-at-players-recovering-from-injury-before-an-ipl-season/","keywords":["Cricket","IPL 2022","Indian Premier League","IPL","Ravi Shastri"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Ravi Shastri takes explicit dig at IPL players that recover from injuries before the commencement of a season of the cash-rich league. With the ever eager Cricket fans waiting in desperation for the commencement of the 15th season of the Indian Premier League (IPL), they have been been welcomed with yet another news akin a… The post “IPL is one of the greatest physios in the world”: Ravi Shastri takes explicit dig at players recovering from injury before an IPL season appeared first on The SportsRush.","content":"Ravi Shastri takes explicit dig at IPL players that recover from injuries before the commencement of a season of the cash-rich league. With the ever eager Cricket fans waiting in desperation for the commencement of the 15th season of the Indian Premier League (IPL), they have been been welcomed with yet another news akin a breath of fresh air. Former India batter, then head coach, and before that an ace commentator, Ravi Shastri is set to join the commentary panel for the upcoming IPL season after a gap of seven years. However, the 59-year-old would, this time around, try his hands out while commentating in the Hindi language. Shastri was part of the English commentary panel during the initial eleven seasons of the marquee league, but was forced to take a side-step while in the capacity as team India’s director and then the head coach until last year due to what Shastri says, a ‘stupid conflict of interest’ clause. Ravi Shastri takes explicit dig at IPL players During a press conference on Tuesday organised by Star Sports, Ravi Shastri also threw some light on the popularity of the league by stating how it motivates players to partake in it. While terming the IPL the best in the world, Shastri also remarked how it acts as a physio, which propels players to get or remain fit anyhow before the start of a new season. “IPL is one of the greatest leagues in the world, and it’s also one of the greatest physios in the world, because, before the IPL auction everyone wants to get fit, because everyone wants to play in the IPL,” remarked Shastri. 100 reasons to celebrate Test match No. 100. Its been a fabulous century. Great to watch a lot of it ringside. Enjoy this one champ through the covers… @imVkohli #VK100 pic.twitter.com/iGeoxyrEzQ — Ravi Shastri (@RaviShastriOfc) March 3, 2022 “You call him Mr. IPL, I could not disagree” – Ravi Shastri on Suresh Raina Suresh Raina, who remained unsold during the mega auction last month, will also join Shasti in the Hindi commentary panel. Agreeing with Raina’s ‘Mr.IPL’ tag for being a regular, consistent performer for CSK since the league’s inception in 2008, Shastri was all in praise for the former Indian Southpaw batter. “You call him Mr. IPL, I could not disagree. He lit up the IPL, to play consecutive seasons for a team without missing a match is a real big compliment in itself. He is one of the highest-scorers in the history of the competition,” Shastri further opined. The post “IPL is one of the greatest physios in the world”: Ravi Shastri takes explicit dig at players recovering from injury before an IPL season appeared first on The SportsRush.","pubDate":"2022-03-22 16:53:52","full_description":"Ravi Shastri takes explicit dig at IPL players that recover from injuries before the commencement of a season of the cash-rich league. The ever eager Cricket fans waiting in desperation for the commencement of the 15th season of the Indian Premier League (IPL), have been been welcomed with yet another news akin a breath of fresh air. Former India batter, then head coach, and before that an ace commentator, Ravi Shastri is set to join the commentary panel for the upcoming IPL season after a gap of seven years. However, the 59-year-old would, this time around, try his hands out while commentating in the Hindi language. Shastri was part of the English commentary panel during the initial eleven seasons of the marquee league, but was forced to take a side-step while in the capacity as team India’s director and then the head coach until last year due to what Shastri says, a ‘stupid conflict of interest’ clause. During a press conference on Tuesday organised by Star Sports, Ravi Shastri also threw some light on the popularity of the league by stating how it motivates players to partake in it. While terming the IPL the best in the world, Shastri also remarked how it acts as a physio, which propels players to get or remain fit anyhow before the start of a new season. “IPL is one of the greatest leagues in the world, and it’s also one of the greatest physios in the world, because, before the IPL auction everyone wants to get fit, because everyone wants to play in the IPL,” remarked Shastri. 100 reasons to celebrate Test match No. 100. Its been a fabulous century. Great to watch a lot of it ringside. Enjoy this one champ through the covers…🤗 @imVkohli #VK100 pic.twitter.com/iGeoxyrEzQ — Ravi Shastri (@RaviShastriOfc) March 3, 2022 Suresh Raina, who remained unsold during the mega auction last month, will also join Shastri in the Hindi commentary panel. Agreeing with Raina’s ‘Mr.IPL’ tag for being a regular, consistent performer for CSK since the league’s inception in 2008, Shastri was all in praise for the former Indian Southpaw batter. “You call him Mr. IPL, I could not disagree. He lit up the IPL, to play consecutive seasons for a team without missing a match is a real big compliment in itself. He is one of the highest-scorers in the history of the competition,” Shastri further opined.","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Women's World Cup: VVS Laxman Lauds Team India After Win Over Bangladesh","link":"https://sports.ndtv.com/cricket/womens-world-cup-vvs-laxman-lauds-team-india-after-win-over-bangladesh-2837278","keywords":null,"creator":null,"video_url":null,"description":"Women's World Cup: Former India batter and current National Cricket Academy (NCA) chief VVS Laxman on Tuesday praised Team India for defeating Bangladesh","content":null,"pubDate":"2022-03-22 16:43:15","full_description":"Former India batter and current National Cricket Academy (NCA) chief VVS Laxman on Tuesday praised Team India for defeating Bangladesh in the ongoing ICC Women's ODI World Cup clash. A half-century from Yastika Bhatia led a recovery for Women in Blue as they posted a score of 229 for seven in the ongoing ICC Women's World Cup on Tuesday. Bangladesh were hampered by early wickets that left them struggling on 35 for five and Sneh Rana took four for 30 to eventually bowl the Tigresses out 110 runs short of their target. \"A wonderful effort from the Indian girls to beat Bangladesh in a comprehensive fashion. Thoroughly clinical performance and wishing the @BCCIWomen the very best for the next game,\" tweeted VVS Laxman. A wonderful effort from the Indian girls to beat Bangladesh in comprehensive fashion. A thoroughly clinical performance and wishing the @BCCIWomen the very best for the next game. #IndvBan #CWC22 pic.twitter.com/tk75PPc8XN Meanwhile, former India batter Wasim Jaffer also took to his Twitter and wrote, \"The dream lives on. This World Cup is going down to the wire. Well played @BCCIWomen.\" For Bangladesh, Ritu Moni produced the best figures of the innings with three for 37. Salma Khatun was Bangladesh's top-scorer with 32 from 35 balls but departed with Bangladesh on 75 for six just past the halfway mark of the innings and the Tigresses were unable to recover. Bangladesh will now face two teams they are yet to play in ODIs, starting with the already-qualified Australia before rounding out the group stages by taking on holders England. Promoted","image_url":"https://c.ndtvimg.com/2022-03/qolsjct_team-india-women-twitter_120x90_22_March_22.jpg","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Wankhede Stadium upcoming matches: Wankhede Stadium IPL 2022 list of matches","link":"https://thesportsrush.com/cricket-news-wankhede-stadium-upcoming-matches-wankhede-stadium-ipl-2022-list-of-matches/","keywords":["Cricket","IPL 2022","Indian Premier League","Wankhede Stadium"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Wankhede Stadium upcoming matches: The iconic Wankhede Stadium will be hosting 20 league matches this season. It will only be for the third time in the history of Indian Premier League that Wankhede Stadium will be hosting an IPL season opener. IPL 2021 finalists Chennai Super Kings and Kolkata Knight Riders will be locking horns… The post Wankhede Stadium upcoming matches: Wankhede Stadium IPL 2022 list of matches appeared first on The SportsRush.","content":"Wankhede Stadium upcoming matches: The iconic Wankhede Stadium will be hosting 20 league matches this season. It will only be for the third time in the history of Indian Premier League that Wankhede Stadium will be hosting an IPL season opener. IPL 2021 finalists Chennai Super Kings and Kolkata Knight Riders will be locking horns in the first match of IPL 2022 on March 26. A 10-team affair for the first time since 2011, IPL 2022 will be played across four venues namely Wankhede Stadium, Brabourne Stadium (CCI) and DY Patil Stadium and Maharashtra Cricket Association Stadium. While the first three stadiums are in and around Mumbai, the MCA Stadium is situated in Pune. Dr. Vijay Patil, the President of the Mumbai Cricket Association shares an update on the iconic Wankhede Stadium’s renovation. He also adds that providing top-class facilities to fans has always been our top priority.#MCA #Mumbai #Cricket #IndianCricket #Wankhede #BCCI #TATAIPL pic.twitter.com/mIEheN0aKK — Mumbai Cricket Association (MCA) (@MumbaiCricAssoc) March 19, 2022 It will be for the first time in the history of IPL that all 70 league matches of an IPL season will be played in one Indian state Maharashtra. As far as the playoffs are concerned, BCCI (Board of Control for Cricket in India) are yet to make public the fixtures for the same. Wankhede Stadium upcoming matches Wankhede Stadium, which had hosted IPL 2021 matches before it was suspended due to a deadly second COVID-19 wave in India, has been venue to 84 IPL matches over the years. Much like the DY Patil Stadium, Wankhede will also be hosting 20 league matches as each one of the 10 teams (including home team Mumbai Indians) will be playing four league matches at this venue. March 26 – Chennai Super Kings vs Kolkata Knight Riders at 19:30 hours (IST) March 28 – Gujarat Titans vs Lucknow Super Giants at 19:30 hours (IST) April 1 – Kolkata Knight Riders vs Punjab Kings at 19:30 hours (IST) April 5 – Rajasthan Royals vs Royal Challengers Bangalore at 19:30 hours (IST) April 10 – Rajasthan Royals vs Lucknow Super Giants at 19:30 hours (IST) April 16 – Delhi Capitals vs Royal Challengers Bangalore at 19:30 hours (IST) April 24 – Lucknow Super Giants vs Mumbai Indians at 19:30 hours (IST) April 25 – Punjab Kings vs Chennai Super Kings at 19:30 hours (IST) April 27 – Gujarat Titans vs Sunrisers Hyderabad at 19:30 hours (IST) April 28 – Delhi Capitals vs Kolkata Knight Riders at 19:30 hours (IST) May 1 – Delhi Capitals vs Lucknow Super Giants at 15:30 hours (IST) May 2 – Kolkata Knight Riders vs Rajasthan Royals at 19:30 hours (IST) May 7 – Punjab Kings vs Rajasthan Royals at 15:30 hours (IST) May 8 – Sunrisers Hyderabad vs Royal Challengers Bangalore at 15:30 hours (IST) May 12 – Chennai Super Kings vs Mumbai Indians at 19:30 hours (IST) May 15 – Chennai Super Kings vs Gujarat Titans at 15:30 hours (IST) May 17 – Mumbai Indians vs Sunrisers Hyderabad at 19:30 hours (IST) May 19 – Royal Challengers Bangalore vs Gujarat Titans at 19:30 hours (IST) May 21 – Mumbai Indians vs Delhi Capitals at 19:30 hours (IST) May 22 – Sunrisers Hyderabad vs Punjab Kings at 19:30 hours (IST) The post Wankhede Stadium upcoming matches: Wankhede Stadium IPL 2022 list of matches appeared first on The SportsRush.","pubDate":"2022-03-22 16:43:01","full_description":"Wankhede Stadium upcoming matches: The iconic Wankhede Stadium will be hosting 20 league matches this season. It will only be for the third time in the history of Indian Premier League that Wankhede Stadium will be hosting an IPL season opener. IPL 2021 finalists Chennai Super Kings and Kolkata Knight Riders will be locking horns in the first match of IPL 2022 on March 26. A 10-team affair for the first time since 2011, IPL 2022 will be played across four venues namely Wankhede Stadium, Brabourne Stadium (CCI) and DY Patil Stadium and Maharashtra Cricket Association Stadium. While the first three stadiums are in and around Mumbai, the MCA Stadium is situated in Pune. Dr. Vijay Patil, the President of the Mumbai Cricket Association shares an update on the iconic Wankhede Stadium’s renovation. He also adds that providing top-class facilities to fans has always been our top priority. #MCA #Mumbai #Cricket #IndianCricket #Wankhede #BCCI #TATAIPL pic.twitter.com/mIEheN0aKK — Mumbai Cricket Association (MCA) (@MumbaiCricAssoc) March 19, 2022 It will be for the first time in the history of IPL that all 70 league matches of an IPL season will be played in one Indian state Maharashtra. As far as the playoffs are concerned, BCCI (Board of Control for Cricket in India) are yet to make public the fixtures for the same. Wankhede Stadium, which had hosted IPL 2021 matches before it was suspended due to a deadly second COVID-19 wave in India, has been venue to 84 IPL matches over the years. Much like the DY Patil Stadium, Wankhede will also be hosting 20 league matches as each one of the 10 teams (including home team Mumbai Indians) will be playing four league matches at this venue. March 26 – Chennai Super Kings vs Kolkata Knight Riders at 19:30 hours (IST) March 28 – Gujarat Titans vs Lucknow Super Giants at 19:30 hours (IST) April 1 – Kolkata Knight Riders vs Punjab Kings at 19:30 hours (IST) April 5 – Rajasthan Royals vs Royal Challengers Bangalore at 19:30 hours (IST) April 10 – Rajasthan Royals vs Lucknow Super Giants at 19:30 hours (IST) April 16 – Delhi Capitals vs Royal Challengers Bangalore at 19:30 hours (IST) April 24 – Lucknow Super Giants vs Mumbai Indians at 19:30 hours (IST) April 25 – Punjab Kings vs Chennai Super Kings at 19:30 hours (IST) April 27 – Gujarat Titans vs Sunrisers Hyderabad at 19:30 hours (IST) April 28 – Delhi Capitals vs Kolkata Knight Riders at 19:30 hours (IST) May 1 – Delhi Capitals vs Lucknow Super Giants at 15:30 hours (IST) May 2 – Kolkata Knight Riders vs Rajasthan Royals at 19:30 hours (IST) May 7 – Punjab Kings vs Rajasthan Royals at 15:30 hours (IST) May 8 – Sunrisers Hyderabad vs Royal Challengers Bangalore at 15:30 hours (IST) May 12 – Chennai Super Kings vs Mumbai Indians at 19:30 hours (IST) May 15 – Chennai Super Kings vs Gujarat Titans at 15:30 hours (IST) May 17 – Mumbai Indians vs Sunrisers Hyderabad at 19:30 hours (IST) May 19 – Royal Challengers Bangalore vs Gujarat Titans at 19:30 hours (IST) May 21 – Mumbai Indians vs Delhi Capitals at 19:30 hours (IST) May 22 – Sunrisers Hyderabad vs Punjab Kings at 19:30 hours (IST)","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"England's Roy handed suspended two-match international ban","link":"https://www.skysports.com/cricket/news/12040/12572782/england-batter-jason-roy-handed-suspended-two-game-international-ban-after-disciplinary-hearing","keywords":null,"creator":null,"video_url":null,"description":"England white-ball batter Jason Roy has received a suspended two-game ban from international cricket after admitting a charge of \"conducting himself in a manner which may be prejudicial to the interests of cricket or which may bring the game into disrepute\".","content":null,"pubDate":"2022-03-22 15:30:00","full_description":"Last Updated: 22/03/22 3:51pm England white-ball batter Jason Roy has received a suspended two-game ban from international cricket after admitting a charge of \"conducting himself in a manner which may be prejudicial to the interests of cricket or which may bring the game into disrepute\". Roy - who is currently taking a 'short indefinite break' from playing in order to spend time with his family - has had his ban suspended for 12 months \"dependent on good behaviour\". The Cricket Discipline Commission also said Roy would pay a fine of £2,500 by the end of March. It is, as yet, unclear what the matter pertains to. A Disciplinary Panel of the Cricket Discipline Commission has announced its sanction on Jason Roy after he admitted a charge of conducting himself in a manner which may be prejudicial to the interests of cricket or which may bring the game of cricket, the ECB and himself into disrepute, in breach of ECB Directive 3.3. Following a full disciplinary hearing at which all available evidence was heard, the Disciplinary Panel ruled that Mr Roy should: (i) be suspended from the next two England matches for which he is eligible for selection, but that such suspension be suspended for 12 months dependent on good behaviour; and (ii) pay a fine of £2,500 by March 31 2022. Roy was last in international action during England's 3-2 T20I series defeat to the West Indies in January, with his tally of 130 runs including a top-score of 52 in the fourth match. The Surrey player, 31, then featured for Quetta Gladiators in the Pakistan Super League before withdrawing from his planned IPL stint with Gujarat Lions in order to spend time at home. Roy wrote on Twitter at the time: \"It's with a heavy heart I have decided to pull out of this year's [IPL]. With everything going on in the world over the last three years it's added up and taken its toll on me.\" He added to Surrey's official website: \"After more than two years living under Covid restrictions and in a number of bubbles, I feel now is the right time to be with my wife and young children.\" Surrey added: \"Jason will take a short indefinite break from the game to spend time with his family in the UK. Since the start of the pandemic, Jason has spent extended periods of time in heavily restrictive Covid-secure 'bubbles' around the world and away from home in order to play cricket. \"There is currently no fixed date for Jason's return to cricket but he will remain in contact with the club during this period, with staff keen to assist him where possible.\"","image_url":"https://e2.365dm.com/22/01/1920x1080/skysports-jason-roy-england_5656457.jpg?20220129204623","source_id":"skysports","country":["united states of america","united kingdom","australia"],"category":["sports"],"language":"english"},{"title":"Dutch cricket ventures to a new frontier in maiden New Zealand voyage","link":"https://www.channelnewsasia.com/sport/dutch-cricket-ventures-new-frontier-maiden-new-zealand-voyage-2579611","keywords":null,"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2022-03-22 13:15:45","full_description":"Although nearly four centuries have passed since Dutch explorer Abel Tasman discovered New Zealand, his adventurous spirit lives on in a new generation of pioneers from the Netherlands - only this time they are traveling for a game of cricket. For the first time, New Zealand will host a team from beyond the elite world of test-playing nations for an international tour, arranging a one-off Twenty20 with the Dutch on Friday and three one-day internationals between March 29 and April 4. \"This opportunity is arguably once in a lifetime,\" Netherlands captain Pieter Seelaar, 34, told Reuters. \"I've been playing (since 2005) and never even experienced anything that remotely resembles something like this.\" World championship events run by the International Cricket Council (ICC) are usually the only occasions when minnow teams like the Netherlands receive high-level exposure. Their engagement by New Zealand marks the first time a country in cricket's Anglosphere has hosted a second-tier team for a multi-format tour. Among the game's other long-established territories, only the West Indies have similarly extended tours for developing sides before, hosting Ireland (2014) and Afghanistan (2017) across white-ball formats before they attained full test status. \"There's no incentive for full members to get associates over and play a series against them,\" Seelaar said, lamenting the ICC's decision last year to end the home-and-away ODI Super League after the current cycle. His side is the only non-test nation in the 13-team competition. \"I think our younger players in the squad don't quite realise how special it is that they're going to be part of this series. \"To combat New Zealand in their own conditions, it doesn't get any better as a cricketer does it?\" PATH TO PROFESSIONALISM The Dutch, who have made four appearances in both the ODI and T20 World Cups, achieved their greatest success in the shortest format when they humiliated England at Lord's in 2009 - and again five years later in Chittagong. Despite cricket not being popular locally, the Netherlands have continually developed homegrown talent and cannily enticed foreign players to bolster their lineup. South Africa-born all-rounder Ryan ten Doeschate played 33 ODIs for the Netherlands between 2006 and 2011, scoring 1541 runs at an eye-popping average of 67. Dutch cricket's growth can be attributed to their team's inclusion in England's domestic one-day competition, an association which lasted between the 1990s and 2010s. \"We improved a lot as cricketers because we got to play on the county grounds, on the professional surfaces, and have access to incredible facilities,\" Seelaar said. He recalled the county experience helped his team grow in confidence and opened the door for individuals to become English county professionals on Kolpak contracts. Britain's departure from the European Union in 2020 all but closed that door because Dutch players are no longer classified as locals. \"In the Netherlands, we have five or six guys under contract, on a very modest salary,\" the left-arm spinner said. \"(Most players) still have to earn money outside of the professional game playing for Holland, so they either have to coach or actually have an office job on the side.\" New Zealand have assembled a strong squad for retiring batsman Ross Taylor's swansong, but will miss some white-ball regulars due to lucrative Indian Premier League commitments. The juxtaposition is evident to Seelaar, who acknowledges that high-profile opportunities for his men can offer both exposure and distraction. \"These days, where there's T20 leagues everywhere around the world, doing well at perfectly the right time could get you a deal very quickly,\" he said. \"It would be on some players' minds, which I would prefer it not to be.\" (Reporting by Joel Dubber in Perth; Editing by Pritha Sarkar)","image_url":"https://onecms-res.cloudinary.com/image/upload/s--2bgAP_2T--/c_fill%2Ch_900%2Cw_1600/fl_relative%2Cg_south_east%2Cl_one-cms:core:watermark:reuters%2Cw_0.1/f_auto%2Cq_auto/v1/one-cms/core/2022-03-22t131433z_1_lynxnpei2l0p9_rtroptp_3_cricket-netherlands.jpg?itok=UryW5zrA","source_id":"channelnewsasia","country":["singapore"],"category":["sports"],"language":"english"},{"title":"In IPL 15, India will be looking for a solid captain for future: Ravi Shastri","link":"https://timesofindia.indiatimes.com/sports/cricket/ipl/top-stories/in-ipl-15-india-will-be-looking-for-a-solid-captain-for-future-ravi-shastri/articleshow/90378708.cms","keywords":null,"creator":null,"video_url":null,"description":"The IPL 15 is an opportunity to unearth a \"solid\" future captain for the Indian cricket team, former national team head coach Ravi Shastri said on Tuesday.","content":null,"pubDate":"2022-03-22 13:03:45","full_description":"NEW DELHI: The IPL 15 is an opportunity to unearth a \"solid\" future captain for the Indian cricket team, former national team head coach Ravi Shastri said on Tuesday. From Rishabh Pant to Shreyas Iyer , the upcoming tournament could be mostly about unearthing the next generation of Indian leaders. He said current India skipper Rohit Sharma is doing an \"outstanding\" job. (Delhi Capitals Photo) \"Virat is not being captain anymore, but Rohit has also been outstanding especially in white ball. India will be looking at who will be captaining the team (in future) -- there is Shreyas Iyer, Rishabh Pant, KL Rahul . \"India will be looking for a solid captain for the future and here is the opportunity,\" Shastri said on Tuesday during a press conference organised by Star Sports, the official broadcaster of IPL 2022. \"... That is the beauty of the IPL, last IPL we saw Venkatesh Iyer, no one had heard of him and by the time it got over he was in Indian team. So you expect the unexpected.\" Gujarat Titans skipper Hardik Pandya remains tight-lipped on his return to bowling but the whole country will be \"very closely watching\" his every move in the upcoming IPL, believes Shastri. (KKR Photo) Pandya, who is set to captain the Gujarat Titans team as the new franchise debuts in the Indian Premier League 2022. Due to a lower back injury, the star Indian all-rounder is yet to play any competitive match post last year's ICC T20 World Cup in the UAE. \"The whole county would be very closely watching Hardik Pandya in the IPL, we all know what he is capable of,\" Shastri said on Tuesday during a press conference organised by Star Sports, the official broadcaster of IPL 2022. Shastri and Suresh Raina will be part of the elite commentary panel of Star Sports for the lucrative league. (Lucknow Super Giants Photo) \"Like Hardik there will be a lot of other players who are knocking at the doors of the Indian team.\" Shastri also said fast bowling could get more attention than anything else in the upcoming IPL, with the next T20 World Cup scheduled to be played in the hard and bouncy pitches of Australia. The 15th edition of Indian Premier League gets underway with a match between Chennai Super Kings and Kolkata Knight Riders at the Wankhede Stadium Mumbai on Saturday. \"One think I can say is that they would be watching the fast bowling department more than anything else as they are going to Australia in four months' times after the IPL,\" Shastri said. A lot of youngsters have been given chances in the Indian team under Rohit Sharma's captaincy and Shastri is waiting to see how these players strengthen their case with good outings in the IPL. \"I would rather focus on players who have been just given the opportunity and how they do in IPL.... Now it will be important to see how these players perform in the IPL and strengthen their positions.\" Shastri is returning to the commentary box after a seven-year absence. He will however be a part of the Hindi commentary team, something he has not been associated with in the past. This edition of the tournament will see 10 teams in action, with the addition of Gujarat Titans and Lucknow Super Giants. \"Competition will be terrific this time, with two new teams coming in.. Now there are quite a few teams that will give you a real good run for money. The mix has been very good and it promises a very strong league,\" Shastri said.","image_url":null,"source_id":"toi","country":["india"],"category":["sports"],"language":"english"},{"title":"Bahrain women’s cricket team smashes highest ever T20I total, breaks records","link":"https://indianexpress.com/article/sports/cricket/bahrain-womens-cricket-team-highest-t20i-records-7831506/","keywords":["Cricket","Sports"],"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2022-03-22 12:33:32","full_description":"Bahrain women’s cricket team created a new record after scoring 318/1 in a T20I match against Saudi Arabia on Tuesday. The encounter, which took place at the Al Amerat Cricket Ground Oman Cricket, was the seventh match of the GCC Women’s T20I Championship 2022 where the women in red eclipsed Uganda’s score of 314/2 to climb on top of the record books. Bahrain captain Deepika Rasangika, who scored an unbeaten 161 off 66 balls, also etched her name in history books after becoming the first batter to score 150+ in a women’s T20I. Check Out Express Premium Adhir Ranjan: 'Cong needs bargaining power against regional parties' Ladakh’s plan to save its wolves: Stupas & insurance Explained: Why Imran Khan's future as PM looks uncertain Click here for more Bahrain went on to win the match by a margin of 269 runs after restricting Saudi Arabia to just 49/8. It is now the second-largest victory margin in women’s T20Is. https://images.indianexpress.com/2020/08/1x1.png Incidentally, in Bahrain’s total of 318, not even a single six was hit but a record 50 fours were smashed (the previous highest being 34). Here is a list of some of the other records they have broken: Rasangika Herath became the highest run-scorer in women’s T20 cricket with 161 not out against Saudi Arabia. The previous best was Alyssa Healy’s unbeaten 148. Bahrain squad also broke the record for average runs per wicket (318/1). The previous record was held by Tanzania Women’s Team for 285/1 against Mali Women’s team. Bahrain women’s team also broke the record for the highest run rate in a completed innings with an NRR of 15.9. Bahrain women also broke the record for the highest partnership for the second wicket after Rasangika Herath and Tharanga Gajanayake stitched a stand of 255. This is also the second-highest partnership in women’s T20 Cricket.","image_url":null,"source_id":"indianexpress","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL 2022 tickets Pune: How to book IPL tickets 2022 online?","link":"https://thesportsrush.com/cricket-news-ipl-2022-tickets-pune-how-to-book-ipl-tickets-2022-online/","keywords":["Cricket","IPL 2022","Indian Premier League"],"creator":["Dixit Bhargav"],"video_url":null,"description":"IPL 2022 tickets Pune: It will be for the first time that Pune will be hosting 15 league matches of an Indian Premier League season. MCA (Maharashtra Cricket Association) Stadium, Pune, is one of the four venues which will be joining hands to host 70 league matches of the upcoming 15th season of the Indian… The post IPL 2022 tickets Pune: How to book IPL tickets 2022 online? appeared first on The SportsRush.","content":"IPL 2022 tickets Pune: It will be for the first time that Pune will be hosting 15 league matches of an Indian Premier League season. MCA (Maharashtra Cricket Association) Stadium, Pune, is one of the four venues which will be joining hands to host 70 league matches of the upcoming 15th season of the Indian Premier League. Scheduled to host the biggest T20 competition in the world after four years, it is for the first time that Pune has been allotted as many as 15 IPL league stage matches. Previous instances of IPL matches being conducted at the MCA Stadium are IPL 2012 and 2013 (home ground to Pune Warriors India), IPL 2015 (home ground to the then Kings XI Punjab), IPL 2016 and 2017 (home ground to Rising Pune Surgiants) and IPL 2018 (home ground to Chennai Super Kings). ALSO READ: IPL 2022 new teams list of players As far as IPL 2022 is concerned, readers must note that each of the 10 teams will be playing thrice in Pune in the league phase. IPL 2022 tickets Pune Considering the number of years for which Pune hasn’t hosted an IPL match and the number (and quality) of players who will be playing in the city this season, one doesn’t need to explain why fans are eagerly waiting for ticket sales to start. Having last hosted a T20I more than a couple of years ago, cricket-crazy fans of the city are expected to register a sold out venue albeit in a restricted capacity adopted as a precautionary measure with respect to COVID-19. Where did it land? @Russell12A #KKR #KKRHaiTaiyaar #GalaxyOfKnights #IPL2022 pic.twitter.com/hfc3IE13eX — KolkataKnightRiders (@KKRiders) March 22, 2022 Having said that, another day is about to pass without any knowledge on the start date of ticket sales either in Pune or Mumbai. Once an official confirmation arrives, we will update our readers with detailed steps on how to book IPL 2022 tickets via an online platform. It also remains to be known if IPL 2022 tickets will be available at stadium box-office or not. The post IPL 2022 tickets Pune: How to book IPL tickets 2022 online? appeared first on The SportsRush.","pubDate":"2022-03-22 11:15:05","full_description":"IPL 2022 tickets Pune: It will be for the first time that Pune will be hosting 15 league matches of an Indian Premier League season. MCA (Maharashtra Cricket Association) Stadium, Pune, is one of the four venues which will be joining hands to host 70 league matches of the upcoming 15th season of the Indian Premier League. Scheduled to host the biggest T20 competition in the world after four years, it is for the first time that Pune has been allotted as many as 15 IPL league stage matches. Previous instances of IPL matches being conducted at the MCA Stadium are IPL 2012 and 2013 (home ground to Pune Warriors India), IPL 2015 (home ground to the then Kings XI Punjab), IPL 2016 and 2017 (home ground to Rising Pune Surgiants) and IPL 2018 (home ground to Chennai Super Kings). ALSO READ: IPL 2022 new teams list of players As far as IPL 2022 is concerned, readers must note that each of the 10 teams will be playing thrice in Pune in the league phase. Considering the number of years for which Pune hasn’t hosted an IPL match and the number (and quality) of players who will be playing in the city this season, one doesn’t need to explain why fans are eagerly waiting for ticket sales to start. Having last hosted a T20I more than a couple of years ago, cricket-crazy fans of the city are expected to register a sold out venue albeit in a restricted capacity adopted as a precautionary measure with respect to COVID-19. Where did it land? 🤔 @Russell12A #KKR #KKRHaiTaiyaar #GalaxyOfKnights #IPL2022 pic.twitter.com/hfc3IE13eX — KolkataKnightRiders (@KKRiders) March 22, 2022 Having said that, another day is about to pass without any knowledge on the start date of ticket sales either in Pune or Mumbai. Once an official confirmation arrives, we will update our readers with detailed steps on how to book IPL 2022 tickets via an online platform. It also remains to be known if IPL 2022 tickets will be available at stadium box-office or not.","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Shane Warne documentary: Steve Waugh among cricket greats to speak during leg spinner’s tribute special","link":"https://thewest.com.au/sport/cricket/shane-warne-documentary-steve-waugh-among-cricket-greats-to-speak-during-leg-spinners-tribute-special-c-6165355","keywords":null,"creator":null,"video_url":null,"description":"Shane Warne’s former captain Steve Waugh will join a cavalcade of the spin king’s former teammates, friends and fans to pay tribute to the late cricket great in a special documentary to air on Wednesday.","content":null,"pubDate":"2022-03-22 10:57:19","full_description":null,"image_url":"https://images.thewest.com.au/publication/C-6165355/079429d2e365712b154d181a4881df3b2a793895-16x9-x0y114w2240h1260.jpg","source_id":"thewest","country":["australia"],"category":["sports"],"language":"english"},{"title":"Australia in Pakistan, third Test day two live: Mitchell Starc fumes at umpire's request, cricket news 2022 | news.com.au — Australia's leading news site - news.com.au","link":"https://news.google.com/__i/rss/rd/articles/CBMiemh0dHBzOi8vd3d3Lm5ld3MuY29tLmF1L3Nwb3J0L2NyaWNrZXQvYXVzdHJhbGlhLWluLXBha2lzdGFuLXRoaXJkLXRlc3QtZGF5LXR3by9uZXdzLXN0b3J5LzQ5YjA5ZGQ0ZjZmOGYyMTI4ZTE1OThlYzg4NzgxZGQ30gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Australia in Pakistan, third Test day two live: Mitchell Starc fumes at umpire's request, cricket news 2022 | news.com.au — Australia's leading news site  news.com.auPakistan vs Australia, live updates, third Test day two in Lahore  ABC NewsLIVE: ‘Never seen him do that ever’ — Aussies’ Lyon concern after wild moment  Fox SportsConfident Pakistan begin battle for series win today  The News InternationalGreen, Carey crack half-tons in Pakistan  The StandardView Full coverage on Google News","content":null,"pubDate":"2022-03-22 10:50:54","image_url":null,"source_id":"google","country":["australia"],"category":["sports"],"language":"english"}]}