{"newsArray":[{"title":"Essex are thrown into further turmoil as whistleblower Wasim Haq quits over racism scandal","link":"https://www.dailymail.co.uk/sport/sportsnews/article-10755939/Essex-thrown-turmoil-whistleblower-Wasim-Haq-quits-racism-scandal.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"WORLD OF CRICKET - PAUL NEWMAN: Essex are on tenterhooks awaiting punishment from a cricket discipline commission investigation into charges of bringing the game into disrepute.","content":null,"pubDate":"2022-04-26 22:10:55","image_url":"https://i.dailymail.co.uk/1s/2022/04/26/21/57083581-0-image-a-24_1651004226518.jpg","source_id":"dailymailuk","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"“Great players go through phases like this”: Faf du Plessis backs Virat Kohli to turn his IPL 2022 form around for RCB","link":"https://thesportsrush.com/cricket-news-great-players-go-through-phases-like-this-faf-du-plessis-backs-virat-kohli-to-turn-his-ipl-2022-form-around-for-rcb/","keywords":["Cricket","IPL 2022","Rajasthan Royals","RCB","Faf Du Plessis","Indian Premier League","rajasthan royals","Royal Challengers Bangalore","RR","Virat Kohli"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Faf du Plessis backs Virat Kohli: The captain of Royal Challengers Bangalore is confident about his predecessor’s abilities. Royal Challengers Bangalore captain Faf du Plessis believes that his team was adversely affected by all-rounder Wanindu Hasaranga dropping a sitter to give a reprieve to Rajasthan Royals batter Riyan Parag in the recently concluded 39th Indian… The post “Great players go through phases like this”: Faf du Plessis backs Virat Kohli to turn his IPL 2022 form around for RCB appeared first on The SportsRush.","content":"Faf du Plessis backs Virat Kohli: The captain of Royal Challengers Bangalore is confident about his predecessor’s abilities. Royal Challengers Bangalore captain Faf du Plessis believes that his team was adversely affected by all-rounder Wanindu Hasaranga dropping a sitter to give a reprieve to Rajasthan Royals batter Riyan Parag in the recently concluded 39th Indian Premier League 2022 match in Pune. It all happened in the penultimate over of the first innings when Parag survived despite giving the most easiest of catches to Hasaranga at cover off Josh Hazlewood. In addition to the 20-year old batter scoring a career-best 56* (31), a second chance saw him hitting two fours and sixes each in the remainder of the innings. Keep calm and … pic.twitter.com/rnipWi74ba — Rajasthan Royals (@rajasthanroyals) April 26, 2022 “It [pitch] is pretty similar to the previous game [vs Mumbai Indians] we played, there is a little bit of inconsistent bounce. We gave 20 runs too many and the dropped catch cost us 25 [24]. 140 was a par score on that pitch,” du Plessis told Star Sports after his team failed to chase a 145-run target at the Maharashtra Cricket Association Stadium. Not mincing his words, du Plessis called for a need to sort their batting issues especially in the top-order. RCB losing key batters in the powerplay itself time and again has cost them dearly in IPL 2022. “That [top-order batting] is the thing we need to fix. The basics of the game doesn’t change. You needed someone in the top four to bat through and we have not done it,” du Plessis said. Faf du Plessis backs Virat Kohli to turn his IPL 2022 form around for RCB While du Plessis is the highest run-scorer for Royal Challengers this season and fifth highest overall, a major source of concern for this team lies in the form of former captain Virat Kohli’s batting form. Having registered a third consecutive single-digit score, Kohli further managed to extend his lean patch which has seen him without a century for over 100 innings across formats now. In nine IPL 2022 innings, Kohli has scored 128 runs at an average of 16 and a strike rate of 119.62. Bangalore’s decision to open with Kohli and du Plessis might have failed tonight but the latter explained rationale behind doing the same. Furthermore, du Plessis backed Kohli to turn his form around for doing the same is a virtue of “great players”. “We have to try to change the batting order and see if that works. That’s what we discussed after the last game, trying to get the best out of him [on Virat Kohli opening the batting]. “Great players go through phases like this. We wanted him to get in straightaway [and not bat at No. 3] so that he doesn’t sit on the sidelines and think about the game. He is a great player and we still back him to turn it around and hopefully it’s around the corner. It’s a game of confidence,” du Plessis mentioned. The post “Great players go through phases like this”: Faf du Plessis backs Virat Kohli to turn his IPL 2022 form around for RCB appeared first on The SportsRush.","pubDate":"2022-04-26 18:55:38","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"IPL 2022 Points Table, Orange Cap and Purple Cap Latest Table Today: RR reclaim top spot after beating RCB","link":"https://www.firstpost.com/firstcricket/sports-news/ipl-2022-points-table-orange-cap-and-purple-cap-latest-table-today-rr-reclaim-top-spot-after-beating-rcb-10447751.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"IPL 2022 Points Table, Orange Cap and Purple Cap Latest Table Today: RR reclaim top spot after beating RCB","content":"IPL 2022 has in store new teams, changed squad line-ups and a different format. But that will not necessarily impact the point system.This year the format is going to be a little different, wherein the 10 teams will be split into two groups - Group A and B.Group A - Mumbai Indians, Kolkata Knight Riders, Rajasthan Royals, Delhi Capitals, Lucknow Super GiantsGroup B - Chennai Super Kings, Sunrisers Hyderabad, Royal Challengers Bangalore, Punjab Kings, Gujarat TitansNow, within the groups, each team will play each other twice, as well as twice against the team in the same row from the other group. Then each team from every group will play against all the other teams in the other group once. That brings it to a total of 14 (8 + 5 + 1) matches for all teams.On Tuesday, RR reclaimed top spot in the points table with a 29-run win over RCB.Here's the list of current Orange and Purple Cap holders:Orange Cap holder: Jos Buttler (RR) - 499 runsPurple Cap holder: Yuzvendra Chahal (RR) - 18 wicketsHere's the latest updated IPL 2022 league table: PositionTeamMatchesWonLostNRNet RRPoints1RR8620 +0.561122GT7610+0.396123SRH7520+0.691104LSG8530-0.334105RCB9540-0.572106PBKS8440-0.41987DC7340+0.71568KKR8350+0.08069CSK8260-0.538410MI8080-1.0000Click here to view the full Orange Cap standingsClick here to view the full Purple Cap standings Click here to read Factboxes of all teamsClick here to follow comprehensive coverage of IPL 2022Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-04-26 18:29:06","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/02/IPL-Trophy-640-1.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Tata IPL 2022 GT vs SRH Live Streaming: Gujarat Titans vs Sunrisers Hyderabad Live Coverage, venue, date, timing","link":"https://www.firstpost.com/firstcricket/sports-news/gujarat-titans-vs-sunrisers-hyderabad-indian-premier-league-live-streaming-today-check-gt-vs-srh-live-coverage-venu-date-streaming-channel-date-time-10601301.html","keywords":["First Cricket News"],"creator":["FP Trending"],"video_url":null,"description":"Tata IPL 2022 GT vs SRH Live Streaming: Gujarat Titans vs Sunrisers Hyderabad Live Coverage, venue, date, timing","content":"It will be Hardik Pandya vs Kane Williamson when Gujarat Titans (GT) will meet Sunrisers Hyderabad on Wednesday night at the Wankhede Stadium. It has been a brilliant debut season for the Gujarat Titans. There were few concerns over the squad, but Hardik Pandya has led the side brilliantly and his own form with the bat and ball has rendered a lot of balance to the squad.On the other hand, the Sunrisers Hyderabad have bounced back superbly after their defeats in the first two matches. They look like one of the most balanced sides in the tournament. And, their bowling attack has been superb in their 5-match winning spree.When will the Gujarat Titans and Sunrisers Hyderabad match be played?The GT vs SRH IPL 2022 match will take place on 27 April.Where will the Gujarat Titans and Sunrisers Hyderabad match be held?The GT vs SRH IPL 2022 match will be held at Wankhede Stadium in Mumbai.What time will the Gujarat Titans and Sunrisers Hyderabad match start?The GT vs SRH IPL 2022 match will begin from 7:30 pm onwards. The toss will be held at 7 pm on the same day.Where can you watch GT vs SRH IPL 2022 match on TV and online?The GT vs SRH IPL 2022 match will be broadcast live on Star Sports Network channels — Star Sports 1 HD, Star Sports Select 1, Star Sports Select 1 HD (Dugout) and Star Sports 1. The encounter will also be streamed live on Disney+ Hotstar.You can also follow firstpost.com to check out the live scores and commentary of the GT vs SRH IPL 2022 match.Complete Squads:Gujarat Titans: Hardik Pandya (c), Rashid Khan, Lockie Ferguson, Vijay Shankar, Shubman Gill, Noor Ahmed, Wriddhiman Saha, Mohammed Shami, Rahul Tewatia, Sai Kishore, Jayant Yadav, Dominic Drakes, Darshan Nalkande, Yash Dayal, Alzarri Joseph, Rahmanullah Gurbaz, Pradeep Sangwan, David Miller, Matthew Wade, Abhinav Manohar, Varun Aaron, B Sai SudharshanSunrisers Hyderabad: Kane Williamson (c), Karik Tyagi, Umran Malik, Marco Jansen, Washington Sundar, Nicholas Pooran, R Samarth, T Natarajan, Jagadeesha Suchith, Bhuvneshwar Kumar, Priyam Garg, Rahul Tripathi, Abhishek Sharma, Saurabh Dubey, Shreyas Gopal, Aiden Markram, Romario Shepherd, Sean Abbott, Shashank Singh, Abdul Samad, Vishnu Vinod, Glenn Philips, Fazalhaq FarooqiRead all the Latest News, Trending News, Cricket News, IPL Live Score, IPL 2022 schedule, IPL 2022 Points table and Entertainment News. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-04-26 18:12:50","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/04/Du-Plessis-RCBvSRH-640_Sportzpics.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL 2022: 'Will stand with him during lows', Twitterati backs Virat Kohli despite batting failure against RR","link":"https://www.firstpost.com/firstcricket/sports-news/ipl-2022-will-stand-with-him-during-lows-twitterati-backs-virat-kohli-despite-batting-failure-against-rr-10602931.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"IPL 2022: 'Will stand with him during lows', Twitterati backs Virat Kohli despite batting failure against RR","content":"Virat Kohli still seems to be struggling to get going and hitting the big shots for RCB.Virat Kohli, who was promoted to the top in Anuj Rawat's absence, was dismissed for only 9 runs in the second over of the second innings by Prasidh Krishna. Earlier, Kohli had registered two golden ducks in the last two games against LSG and SRH, respectively.Faf du Plessis said during the toss that he wanted Kohli to open so that the latter could play freely. However, Kohli fell prey to a short ball, as he tried to play a pull shot. The ball grazed the bottom edge of the bat and popped up in the air only to be caught by Riyan Parag.Here's how Twitter reacted:A fan said he would support Kohli through all the highs and lows.supported him in his highs will stand with him during the lows #ViratKohli pic.twitter.com/dDSc6Rmg9b— Krishna Chaitanya (@__kriche__) April 23, 2022// // ]]>Another fan had a similar thing to say.If you can support him in his good times,Then why not in his bad times. I always be with you @imVkohli ❤️#ViratKohli ! #GOAT ! pic.twitter.com/H79qHSFieM— KRISHNA (@Krishna_973) April 26, 2022// // ]]>A fan was expressed their deep concern and sadness at their mentor's continuing bad form.Its not about whether we believe him or not.We always believed in our king and will continue to do so....♥️ But when will God listen to all of us...When will this worst phase of his career end man....His face today literally made me cry#ViratKohli #ViratKohli #RCB #RCBvsRR pic.twitter.com/YY7Aq9tLR4— ||Shehnaaz Sidharth Shuka||♥️ (@Sidnaaz__12) April 26, 2022// // ]]>More or less everyone was all-praise for the out-of-form 'King', looking forward to his comeback..@imVkohli The Sun will raise again ❤☀️#RCBvsRR #Virat #ViratKohli pic.twitter.com/2Hk91PCDw0— Srikanth (@Srikanth_Tweetz) April 26, 2022// // ]]>Read all the Latest News, Trending News, Cricket News, IPL Live Score, IPL 2022 schedule, IPL 2022 Points table and Entertainment News. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-04-26 18:11:47","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/04/Virat-Kohli-dismissal-RRvsRCB-640.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"RCB vs RR Man of the Match today IPL: Who was awarded Man of the Match in Bangalore vs Rajasthan 2022 IPL match?","link":"https://thesportsrush.com/cricket-news-rcb-vs-rr-man-of-the-match-today-ipl-who-was-awarded-man-of-the-match-in-bangalore-vs-rajasthan-2022-ipl-match/","keywords":["Cricket","IPL 2022","Rajasthan Royals","RCB","Indian Premier League","rajasthan royals","Riyan Parag","Royal Challengers Bangalore","RR"],"creator":["Dixit Bhargav"],"video_url":null,"description":"RCB vs RR Man of the Match: The batter from Rajasthan Royals won his maiden Indian Premier League match award tonight. During the 39th match of the ongoing 15th season of the Indian Premier League between Royal Challengers Bangalore and Rajasthan Royals in Pune, Rajasthan Royals beat Royal Challengers Bangalore by 29 runs. Having won… The post RCB vs RR Man of the Match today IPL: Who was awarded Man of the Match in Bangalore vs Rajasthan 2022 IPL match? appeared first on The SportsRush.","content":"RCB vs RR Man of the Match: The batter from Rajasthan Royals won his maiden Indian Premier League match award tonight. During the 39th match of the ongoing 15th season of the Indian Premier League between Royal Challengers Bangalore and Rajasthan Royals in Pune, Rajasthan Royals beat Royal Challengers Bangalore by 29 runs. Having won their sixth match of the season, Sanju Samson’s team has reached to the top of the points table. Royal Challengers, who would’ve backed themselves to do much better than scoring 115/10 in 19.3 overs in a 145-run chase on most occasions, faltered throughout the second innings to lose wickets at regular intervals. Included into the Playing XI for this match, Royals fast bowler Kuldeep Sen was the pick of their bowlers with bowling figures of 3.3-0-20-4. While spinner Ravichandran Ashwin picked three wickets, another pacer in Prasidh Krishna picked a couple of wickets to contribute in a clinical victory at the Maharashtra Cricket Association Stadium tonight. RCB vs RR Man of the Match today IPL match Asked to bat first by Bangalore captain Faf du Plessis (23), Rajasthan wouldn’t have scored 144/8 in 20 overs had it not been for batter Riyan Parag top-scoring with his 56* (31) comprising of three fours and four sixes. Coming in to bat at No. 6 in the 10th over, Parag’s one-man show powered him to a career-best score in the biggest T20 tournament across the world on the back of a ninth T20 and second IPL half-century. Big win for @rajasthanroyals great team work.. brilliant from @ParagRiyan proving many wrong including me.More power to you. showing why RR giving him chance after chance ..Top quality bowling #kuldipsen — Harbhajan Turbanator (@harbhajan_singh) April 26, 2022 “A bit of satisfaction [at doing well]. The Royals have shown faith in me for the last three years, and I am paying them back bit by bit. I love pressure and I am just showcasing my abilities,” Parag told Star Sports during the post-match presentation ceremony. “During the time-out, Sanga [Kumar Sangakkara, team director] came out and we agreed that 140 was a good total on this wicket. We decided to go big in the last two overs. I wanted to target [Wanindu] Hasaranga in his second over, but we lost wickets, and so I had to strategize and go after [Josh] Hazlewood and Harshal [Patel].” The post RCB vs RR Man of the Match today IPL: Who was awarded Man of the Match in Bangalore vs Rajasthan 2022 IPL match? appeared first on The SportsRush.","pubDate":"2022-04-26 18:09:30","full_description":"RCB vs RR Man of the Match: The batter from Rajasthan Royals won his maiden Indian Premier League match award tonight. During the 39th match of the ongoing 15th season of the Indian Premier League between Royal Challengers Bangalore and Rajasthan Royals in Pune, Rajasthan Royals beat Royal Challengers Bangalore by 29 runs. Having won their sixth match of the season, Sanju Samson’s team has reached to the top of the points table. Royal Challengers, who would’ve backed themselves to do much better than scoring 115/10 in 19.3 overs in a 145-run chase on most occasions, faltered throughout the second innings to lose wickets at regular intervals. Included into the Playing XI for this match, Royals fast bowler Kuldeep Sen was the pick of their bowlers with bowling figures of 3.3-0-20-4. While spinner Ravichandran Ashwin picked three wickets, another pacer in Prasidh Krishna picked a couple of wickets to contribute in a clinical victory at the Maharashtra Cricket Association Stadium tonight. Asked to bat first by Bangalore captain Faf du Plessis (23), Rajasthan wouldn’t have scored 144/8 in 20 overs had it not been for batter Riyan Parag top-scoring with his 56* (31) comprising of three fours and four sixes. Coming in to bat at No. 6 in the 10th over, Parag’s one-man show powered him to a career-best score in the biggest T20 tournament across the world on the back of a ninth T20 and second IPL half-century. Big win for @rajasthanroyals great team work.. brilliant from @ParagRiyan proving many wrong including me.More power to you. showing why RR giving him chance after chance ..Top quality bowling #kuldipsen — Harbhajan Turbanator (@harbhajan_singh) April 26, 2022 “A bit of satisfaction [at doing well]. The Royals have shown faith in me for the last three years, and I am paying them back bit by bit. I love pressure and I am just showcasing my abilities,” Parag told Star Sports during the post-match presentation ceremony. “During the time-out, Sanga [Kumar Sangakkara, team director] came out and we agreed that 140 was a good total on this wicket. We decided to go big in the last two overs. I wanted to target [Wanindu] Hasaranga in his second over, but we lost wickets, and so I had to strategize and go after [Josh] Hazlewood and Harshal [Patel].”","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"IPL 2022, RCB vs RR Highlights: Parag, Kuldeep help Rajasthan beat Bangalore - Hindustan Times","link":"https://news.google.com/__i/rss/rd/articles/CBMixQFodHRwczovL3d3dy5oaW5kdXN0YW50aW1lcy5jb20vY3JpY2tldC9yY2ItdnMtcnItbGl2ZS1zY29yZS1pcGwtMjAyMi1yb3lhbC1jaGFsbGVuZ2Vycy1iYW5nYWxvcmUtdnMtcmFqYXN0aGFuLXJveWFscy10MjAtbWF0Y2gtMzktbGF0ZXN0LXVwZGF0ZXMtZnVsbC1zY29yZWNhcmQtYW5kLWNyaWNrZXQtbmV3cy0xMDE2NTA5NjYxNzExNjIuaHRtbNIBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"IPL 2022, RCB vs RR Highlights: Parag, Kuldeep help Rajasthan beat Bangalore  Hindustan TimesIPL 2022: Harsha Bhogle Wrote An Apt Tweet For Sanju Samson  The Cricket LoungeIPL 2022, RCB vs RR Highlights: Riyan Parag, Ravichandran Ashwin And Kuldeep Sen Star As RR Defeat RCB By 29 Runs  NDTV SportsMatch Preview - Royals vs RCB, Indian Premier League 2022, 39th Match  ESPNcricinfoHighlights | IPL 2022, RCB vs RR, Match 39: Rajasthan Royals Beat Royal Challengers Bangalore By 29 Runs  India.comView Full coverage on Google News","content":null,"pubDate":"2022-04-26 18:02:05","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL 2022: Mumbai Indians most valuable IPL franchise, as per Forbes report","link":"https://www.firstpost.com/firstcricket/sports-news/ipl-2022-mumbai-indians-most-valuable-ipl-franchise-as-per-forbes-report-10602841.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"IPL 2022: Mumbai Indians most valuable IPL franchise, as per Forbes report","content":"Mumbai Indians (MI) enjoy the privilege of being a crown jewel among the Indian Premier League(IPL)'s pool of teams, by being the IPL’s most valuable franchise at $1.3 billion (Rs 9968 crore approximately). It now has a net worth of more than six MLB teams, 27 NHL teams and every MLS team.The five-time IPL champions might be enduring their worst IPL season with a tough ask to remain in the title challenge but the Forbes report published on Tuesday (26 April) shows the side has reaped the long-term benefits of being the most successful side in the cash-rich leagueAs per the report, alongside being evaluated at $1.3 billion, they also boast of revenue of $33 million (Rs 254 crore approx) and an operating income of $5.5 million (Rs 42.17 crore approx.).The evaluation of the other IPL teams are:Kolkata Knight Riders {$1.1 billion (Rs 8433 crore approx)}Lucknow Super Giants {$1.075 billion(Rs 8242 crore approx)}Delhi Capitals {$1.035 billion (Rs 7935 crore approx)}Royal Challengers Bangalore {$1.025 billion (Rs 7858 crore approx)}Rajasthan Royals {$1 billion (Rs 7667 crore approx)}Sunrisers Hyderabad {$970 million (Rs 7437 crore approx)}Punjab Kings {$925 million (Rs 7092 crore approx)}Gujarat Titans {$850 million(Rs 6517 crore approx})Gold mine for investorsAs per the Forbes report, the average value of franchises has grown from $67 million (Rs 513 crore approx for 8 teams) in 2008 to $1.04 billion (Rs 7973 crore approx) in 2022. This represents an annualised growth rate of 24 per cent, making it a gold mine for investors.Two big reasons may be traced to the surge in IPL valuations, firstly the viewing audience pool and secondly IPL's economic model.In 2021, 400 million viewers watched the IPL on television while another 260 million streamed matches on online platforms.Walt Disney subsidiary Star India's television and streaming rights cost $2.4 billion (Rs 18,401 crore approx) over 5 years but the contract will end this year. The expectation is that the next round of media rights will be worth $6 billion to $7 billion ( up to Rs 53, 670 crore approx) over five years.The IPL guarantees that every team is profitable virtually through its economic model In 2021, for example, average revenue for the eight teams was $35 million (Rs 268 crore approx), with operating income (earnings before interest, taxes, depreciation and amortisation) of $9 million (Rs 69 crore approx). Some 80 per cent of the IPL’s revenue in a typical year — and about 90 per cent during the pandemic — is derived from central revenues negotiated by the Board of Control for Cricket in India, or BCCI, the sport’s national governing body.Read all the Latest News, Trending News, Cricket News, IPL Live Score, IPL 2022 schedule, IPL 2022 Points table and Entertainment News. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-04-26 17:50:53","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/04/Mumbai-Indians-players-MI-LSG-Sportzpics-640.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Kohli scores in IPL 2022: This IPL Virat Kohli runs and Virat Kohli last 10 innings score","link":"https://thesportsrush.com/cricket-news-kohli-scores-in-ipl-2022-this-ipl-virat-kohli-runs-and-virat-kohli-last-10-innings-score/","keywords":["Cricket","IPL 2022","Rajasthan Royals","RCB","Indian Premier League","Prasidh Krishna","rajasthan royals","Riyan Parag","Royal Challengers Bangalore","RR","Virat Kohli"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Kohli scores in IPL 2022: The former captain of Royal Challengers Bangalore was out cheaply yet again in this season. During the 39th match of the ongoing 15th season of the Indian Premier League between Royal Challengers Bangalore and Rajasthan Royals in Pune, former Royal Challengers Bangalore captain Virat Kohli registered yet another single-digit score… The post Kohli scores in IPL 2022: This IPL Virat Kohli runs and Virat Kohli last 10 innings score appeared first on The SportsRush.","content":"Kohli scores in IPL 2022: The former captain of Royal Challengers Bangalore was out cheaply yet again in this season. During the 39th match of the ongoing 15th season of the Indian Premier League between Royal Challengers Bangalore and Rajasthan Royals in Pune, former Royal Challengers Bangalore captain Virat Kohli registered yet another single-digit score to extend his lean patch in competitive cricket. Opening the batting with captain Faf du Plessis for the first time in this season, Kohli played all of the first 10 deliveries of the innings before getting out on the last one. It all happened as Kohli struggled against a Prasidh Krishna short ball. An accurate delivery, Kohli failed to nail the pull to only edge the ball to his helmet before it lobbed off towards Riyan Parag at point. Surprised by another strange dismissal in IPL 2022, a dejected Kohli walked back to the pavilion after scoring 9 (10). While Kohli did hit a couple of fours, neither of them came off the middle of the bat. Readers must note that Kohli’s brief stay at the Maharashtra Cricket Association Stadium tonight was a nervy one. Hurried him. Skidded him. pic.twitter.com/ZxeG7h4f0c — Rajasthan Royals (@rajasthanroyals) April 26, 2022 Although chasing a below par 145-run target, Bangalore would’ve hoped for a better start than being reduced to 9/1 in the second over. In addition to elongating Kohli’s rut, another failure at the top of the order also increased RCB’s struggles around opening combination this season. Kohli scores in IPL 2022 Match 1 – 41* (29) vs Punjab Kings Match 2 – 12 (7) vs Kolkata Knight Riders Match 3 – 5 (6) vs Rajasthan Royals Match 4 – 48 (36) vs Mumbai Indians Match 5 – 1 (3) vs Chennai Super Kings Match 6 – 12 (14) vs Delhi Capitals Match 7 – 0 (1) vs Lucknow Super Giants Match 8 – 0 (1) vs Sunrisers Hyderabad Match 9 – 9 (10) vs Rajasthan Royals This IPL Virat Kohli runs and Virat Kohli last 10 innings score In nine IPL 2022 innings, Kohli has scored 128 runs at an average of 16 and a strike rate of 119.62. As far as his last 10 innings in the IPL are concerned, Kohli’s 167 runs have come at an average and strike rate of 18.55 and 119.28 respectively. The post Kohli scores in IPL 2022: This IPL Virat Kohli runs and Virat Kohli last 10 innings score appeared first on The SportsRush.","pubDate":"2022-04-26 16:27:47","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Purple cap in IPL 2022: Most wickets in IPL 2022 full list","link":"https://thesportsrush.com/cricket-news-purple-cap-in-ipl-2022-most-wickets-in-ipl-2022-full-list/","keywords":["Cricket","IPL 2022","Indian Premier League","IPL","Purple Cap IPL"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"Purple cap in IPL 2022: The SportsRush brings you the list of top wicket-takers of the Indian Premier League 2022 season. Indian Premier League has passed its halfway mark, and the race for the playoffs will be more closer from now on. Gujarat Titans and Sunrisers Hyderabad have played some brilliant cricket in the tournament,… The post Purple cap in IPL 2022: Most wickets in IPL 2022 full list appeared first on The SportsRush.","content":"Purple cap in IPL 2022: The SportsRush brings you the list of top wicket-takers of the Indian Premier League 2022 season. Indian Premier League has passed its halfway mark, and the race for the playoffs will be more closer from now on. Gujarat Titans and Sunrisers Hyderabad have played some brilliant cricket in the tournament, whereas Mumbai Indians and Chennai Super Kings are almost ruled out. Apart from the teams, there have been some incredible individual performances as well. Jos Buttler has scored three centuries in the tournament, and he is the highest run-scorer of the tournament so far. There have been some incredible performances with the ball as well. Purple cap in IPL 2022 The Purple Cap is awarded to the highest wicket-taker of the Indian Premier League. Last season, Harshal Patel broke all sorts of records and won the purple cap. The spinners have dominated the 2022 edition of the Indian Premier League. Yuzvendra Chahal was bought by Rajasthan Royals in the auction, and he has been the best bowler of the tournament so far. Chahal has scalped 18 wickets in the tournament at an average of 11.33, and he has also taken a hattrick in the tournament. Chahal has been a match-winner for the Royals. T Natarajan has been excellent at the death of the Sunrisers Hyderabad, and he has scalped 15 wickets in 7 games at an average of 14.53. The death bowling of Natarajan has been great, and he has made a brilliant return this time around for the Hyderabad side. Yuzvendra Chahal, we love you. pic.twitter.com/PPSq05vDEu — Rajasthan Royals (@rajasthanroyals) April 5, 2022 DJ Bravo is the highest wicket-taker in the history of the Indian Premier League, and the veteran has been great this season as well for the Chennai Super Kings. Bravo has scalped 14 wickets in the tournament, and he is just getting better with the age. Wanindu Hasaranga and Kuldeep Yadav have scalped 13 wickets each, and they are also in the top-5 list. Kuldeep has warmed the bench in the last two seasons, and he has made a brilliant return this time around. S No. Player Wickets Match Average 1 Yuzvendra Chahal 18 8 11.33 2 T Natarajan 15 7 14.53 3 DJ Bravo 14 8 18.50 4 Wanindu Hasaranga 13 9 18.85 5 Kuldeep Yadav 13 7 17.38 The post Purple cap in IPL 2022: Most wickets in IPL 2022 full list appeared first on The SportsRush.","pubDate":"2022-04-26 16:24:14","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Rob Key advertises for separate Test and white-ball England head coaches","link":"https://www.theguardian.com/sport/2022/apr/26/rob-key-advertises-for-separate-test-and-white-ball-england-head-coaches","keywords":["England cricket team","Cricket","Sport"],"creator":["Ali Martin"],"video_url":null,"description":"New director makes his first major policy decision in new roleBen Stokes likely to replace Joe Root as Test captainRob Key has locked in his first major policy decision as director of England men’s cricket after formally advertising for two new head coaches, separated by way of Test and white-ball formats.Though a widely anticipated split amid a bulging fixture and greater separation of players, it begins to firm up Key’s vision for the national teams after a winless winter in Test cricket and a T20 World Cup that ended in a semi-final defeat. Continue reading...","content":null,"pubDate":"2022-04-26 15:14:14","image_url":"https://i.guim.co.uk/img/media/3303ec70ab7ca3a57c94bc411b8b5b1ead3b8ebd/153_864_4477_2686/master/4477.jpg?width=460&quality=85&auto=format&fit=max&s=41de3348801c12d2742cad6c8305970d","source_id":"theguardian","country":["united kingdom","india","singapore","canada"],"category":["sports"],"language":"english"},{"title":"Key begins hunt for split England head coaches","link":"https://www.skysports.com/cricket/news/12040/12599468/england-mens-md-rob-key-begins-hunt-for-separate-red-and-white-ball-head-coaches","keywords":null,"creator":null,"video_url":null,"description":"England managing director of men's cricket Rob Key has begun his hunt for split red and white-ball head coaches.","content":null,"pubDate":"2022-04-26 15:00:00","image_url":"https://e2.365dm.com/22/04/1920x1080/skysports-rob-key-england-cricket_5742237.jpg?20220417143648","source_id":"skysports","country":["united states of america","united kingdom","australia"],"category":["sports"],"language":"english"},{"title":"Jealous gang wanted me to fail, says former India coach Shastri","link":"https://telanganatoday.com/jealous-gang-wanted-me-to-fail-says-former-india-coach-shastri","keywords":["Cricket","News","Sport","Anil Kumble","Jealous gang","Ravi Shastri","Robert Key"],"creator":["PTI"],"video_url":null,"description":"London: Robert Key will need to grow a “thick skin” akin to the Dukes ball just like I grew one to counter the “jealous people”, former India head coach Ravi Shastri said on how the ex-England opener should go out about his job as ECB”s ”Director of Cricket”. Shastri was at helm of India”s coaching […]","content":"London: Robert Key will need to grow a “thick skin” akin to the Dukes ball just like I grew one to counter the “jealous people”, former India head coach Ravi Shastri said on how the ex-England opener should go out about his job as ECB”s ”Director of Cricket”. Shastri was at helm of India”s coaching staff between 2014 to 2021, save one year in the middle when Anil Kumble was given the charge. In an interview to UK”s newspaper, Shastri said that there was a “gang of people in India” who always wanted him to fail. Just like Shastri, Key has also been an acclaimed commentator for a long time and doesn”t have a coaching degree as he tries to ease into a new and very different role. “I didn”t have coaching badges (either). Level one? Level two? **** that. And in a country like India, there is always jealousy or a gang of people willing you to fail. I had a thick skin, thicker than the leather of the Dukes ball you use. A real solid hide. “And you need a bloody hide over here. Rob will develop this as he does the job, because every day you are judged. And I am glad he has a lot of captaincy experience from his time at Kent, because communication with the players is absolutely paramount,” Shastri was quoted as saying by the British newspaper. From his own experience of working with the Indian team, Shastri feels that national teams across the cricketing world function in a pretty similar fashion. “Rob may have more work with the domestic game but, when it comes to the national team, it is very similar. The most important thing is getting among the players and setting a tone from the outset: what you believe in, what you think of them and changing the mindset to compete and win. “You have to be bullish and brutish in wanting to achieve that. For us, and now England, it was about setting the challenge of winning abroad, big time. I was very firm when it came to team culture: all the prima donnas and all that shit, that had to go out of the window early,” Shastri explained. Outlining the philosophy and team culture is important, according to Shastri and that”s what he had drilled in when India beat Australia in two back-to-back away series. “…it was also outlining how we want to play: to be aggressive and ruthless, to up the fitness levels, to get a group of fast bowlers to take 20 wickets overseas. And it was about attitude, especially when playing the Aussies. I told the boys if one single expletive comes your way, give them three back: two in our language and one in theirs.” Shastri also feels that Key needs to discuss issues with former Test captain Joe Root to understand how it all works. “Rob will have an adjustment period to understand the issues and will need to speak in detail with Joe Root for his experiences as Test captain. But in my 24 years (commentating), I did not miss a beat or a ball of Indian cricket.” Shastri felt that Ben Stokes would be the ideal choice to take the England team forward.   Now you can get handpicked stories from Telangana Today on Telegram everyday. Click the link to subscribe. Click to follow Telangana Today Facebook page and Twitter .","pubDate":"2022-04-26 14:59:42","image_url":null,"source_id":"telanganatoday","country":["india"],"category":["sports"],"language":"english"},{"title":"RCB vs RR Live Cricket Score IPL 2022 Live update: Four-down Rajasthan lose Samson","link":"https://www.firstpost.com/firstcricket/sports-news/ipl-2022-rcb-vs-rr-live-score-online-live-updates-royal-challengers-bangalore-vs-rajasthan-royals-live-streaming-10596101.html","keywords":["First Cricket News"],"creator":["FP Trending"],"video_url":null,"description":"RCB vs RR Live Cricket Score IPL 2022 Live update: Four-down Rajasthan lose Samson","content":"20:30 (IST)After 11 overs,Rajasthan Royals 84/4 ( Daryl Mitchell 9 , Riyan Parag 13)Halway through the innings, and RCB are right on top at the moment. Hasaranga returns for another over and he strikes, cleaning up Samson. RR seem to be in all sorts of trouble at the moment. Riyan Parag is the new batter and he is off the mark. Shahbaz bowls the next over and 14 runs come off it. 20:23 (IST)OUT! Cleaned up by Wanindu Hasaranga and Sanju Samson departs. The ball rattles the off-stump courtesy a fine delivery from the Sri Lankan to remove the RR skipper. Samson b Hasaranga 2720:18 (IST)After 9 overs,Rajasthan Royals 67/3 ( Sanju Samson (C) (W) 27 , Daryl Mitchell 6)Siraj into the attack once again. Just a couple pf runs in this over with Samson and Mitchell collecting a single each. Time for a strategic timeout now. 20:14 (IST)After 8 overs,Rajasthan Royals 65/3 ( Sanju Samson (C) (W) 26 , Daryl Mitchell 5)Expensive over from Shahbaz with 16 runs coming off it. Sanju Samson with a couple of consecutive sixes, with one of them going over long-off. 20:09 (IST)After 7 overs,Rajasthan Royals 49/3 ( Sanju Samson (C) (W) 12 , Daryl Mitchell 4)With RR already three down and having lost Buttler, Samson needs to play a captain's knock and in Hasaranga's over, Samson has hit him for a four and six. 10 runs come off the last over of powerplay. Harshal Patel introduced in the next over, the first one after powerplay. Mitchell nudges behind square for a brace in the third ball of the over. 19:59 (IST)After 5 overs,Rajasthan Royals 33/3 ( Sanju Samson (C) (W) 0 , Daryl Mitchell 0)Josh Hazlewood into the attack and he strikes, getting rid of the in-form Jos Buttler for just 8. Buttler finds Siraj at mid-on off Hazlewood's ball.  Two new batters in Daryl Mitchell and skipper Sanju Samson, in the middle. 19:56 (IST)After 4 overs,Rajasthan Royals 33/2 ( Jos Buttler 8 , Sanju Samson (C) (W) 0)Josh Hazlewood into the attack and Jos Buttler hits him for a four in the over. Six runs come off it. Siraj continues from the other end in the next over, and Ashwin collects consecutive fours in the over, and he removes Ashwin in his second over. Both wickets for Siraj so far. 19:55 (IST)OUT! Caught and bowled by Siraj and Ashwin departs. Ashwin c and b Siraj 1719:45 (IST)After 2 overs,Rajasthan Royals 19/1 ( Jos Buttler 3 , Ravichandran Ashwin 8)IPL 2022, RCB vs RR Live Score Siraj into the attack from the other end and he strikes, despite conceding 14 runs in his first over. He removes Padikkal, who is given out LBW but Padikkal reviews this one. Ball-tracking shows this one is pitching in-line and crashing onto middle stump. Surprise, surprise! R Ashwin is the new batter at number three. 19:41 (IST)OUT! Padikkal is given LBW and he has reviewed this one right away. Ball-tracking shows it's pitching in line and crashing into the middle-stump. Siraj with the wicket.  Padikkal lbw b Siraj 719:35 (IST)After 1 overs,Rajasthan Royals 5/0 ( Jos Buttler 3 , Devdutt Padikkal 1)IPL 2022, RCB vs RR Live Score Shahbaz Ahmed into the attack as spin introduced by RCB right away. No bounsaries in the over but five runs come off it. 19:31 (IST)Time for LIVe action. Jos Buttler and Devdutt Padikkal, RR openers, walk out to the centre. Spin first up for RCB as Shahbaz Ahmed comes. in. 19:18 (IST)RCB XI: Faf du Plessis(Captain), Virat Kohli, Glenn Maxwell, Suyash Prabhudessai, Rajat Patidar, Shahbaz Ahmed, Dinesh Karthik(w), Harshal Patel, Wanindu Hasaranga, Josh Hazlewood, Mohammed Siraj19:12 (IST)RR XI: Sanju Samson(Captain), Jos Buttler, Devdutt Padikkal, Shimron Hetmyer, Riyan Parag, Daryl Mitchell, Ravichandran Ashwin, Trent Boult, Kuldeep Sen, Prasidh Krishna, Yuzvendra Chahal19:11 (IST)RCB changesRajat Patidar comes in for Anuj Rawat. Virat Kohli promotes himself to the top, du Plessis confirms. RR changes Daryl Mitchell in for Karun Nair, Kuldeep Sen replaces Obed McCoy 19:04 (IST)IPL 2022, RCB vs RR Live Score Toss update: Royal Challengers Bangalore win the toss and will field first, Du Plessis confirms. 19:01 (IST)\"This pitch has been used before, this is the same pitch where KKR chased down 161 in the 15th over. There is plenty of grass on the surface, but it looks abrasive, it means it could grip a bit and could be uneven as well,\" says Deep Dasgupta at the pitch report. 18:47 (IST)IPL 2022, RCB vs RR Live Score Rajasthan Royals are placed third in the points table with 10 points from seven matches, while Royal Challengers Bangalore are fifth with 10 points from eight games. Check out the updated IPL points table here. 18:27 (IST)RCB vs RR Head-to-Head:Total – 25 Royal Challengers Bangalore – 13 Rajasthan Royals – 10 No Result - 2RCB vs RR previous gameIn the last match between these two sides, Royal Challengers Bangalore beat Rajasthan Royals by 4 wickets in Mumbai.18:18 (IST) Royal Challengers Bangalore will be aiming to halt the Jos Buttler juggernaut when they take on Rajasthan Royals in the Indian Premier League in Pune on Tuesday.Attention will be on Virat Kohli as well following his second consecutive first ball duck in the competition.RCB would be hoping their star batter to be back among the runs besides a much improved performance by the batting unit after a shocker in the previous game.While the Challengers come into the match on the back of a demoralising nine-wicket loss to Sunrisers Hyderabad, Rajasthan have had two successive wins and are one of the in-form teams this season.Read the match preview here 18:05 (IST)IPL 2022, RCB vs RR Live Score Hello and welcome to our LIVE coverage of the IPL 2022 match between Royal Challengers Bangalore and Rajasthan Royals at Pune's Maharashtra Cricket Association (MCA) Stadium. Stay tuned for further updates IPL 2022, RCB vs RR Live Score and Updates: Hello and welcome to our LIVE coverage of the IPL 2022 match between Royal Challengers Bangalore and Rajasthan Royals at Pune's Maharashtra Cricket Association (MCA) Stadium. Stay tuned for further updatesPreview: Royal Challengers Bangalore vs Rajasthan Royals live score streaming, IPL 2022: A confident Rajasthan Royals will be locking horns with Royal Challengers Bangalore in the ongoing Indian Premier League. This fixture will be taking place at the Maharashtra Cricket Academy Stadium in Pune.Rajasthan Royals have been looking very powerful courtesy a belligerent Jos Buttler. They beat Delhi Capitals in the last match as Buttler smashed his 3rd century of this season. There are few concerns with the middle order, and Sanju Samson needs to be more consistent after he found some form in the last match against Delhi.On the other hand, Royal Challengers Bangalore come into this match after being smashed by the Sunrisers Hyderabad in their last game. They were bundled out for 68 and SRH romped home in the 8th over. Their batting has to be far better in this match if they have to bounce back after the drubbing.When will the Royal Challengers Bangalore and Rajasthan Royals match be played?The RCB vs RR IPL 2022 match will take place on 26 April.Where will the Royal Challengers Bangalore and Rajasthan Royals match be held?The RCB vs RR IPL 2022 match will be held at MCA Stadium, Pune.What time will the Royal Challengers Bangalore and Rajasthan Royals match start?The RCB vs RR IPL 2022 match will begin from 7:30 pm onwards. The toss will happen at 7 pm.Where can you watch RCB vs RR IPL 2022 match on TV and online?The RCB vs RR IPL 2022 match will be broadcast live on Star Sports Network channels — Star Sports 1 HD, Star Sports Select 1, Star Sports Select 1 HD (Dugout) and Star Sports 1. The match will also be streamed live on Disney+ Hotstar.You can also follow firstpost.com to check out the live scores and commentary of the DC vs RR IPL 2022 match.Complete Squads:Royal Challengers Bangalore: Glenn Maxwell, Virat Kohli, Mohammed Siraj, Faf du Plessis, Harshal Patel, Wanindu Hasaranga, Dinesh Karthik, Josh Hazlewood, Shahbaz Ahmed, Anuj Rawat, Akash Deep, Mahipal Lomror, Finn Allen, Jason Behrendorff, Sherfane Rutherford, Suyash Prabhudesai, Chama Milind, Aneeshwar Gautam, Karn Sharma, David Willey, Rajat Patidar, Siddharth KaulRajasthan Royals: Devdutt Padikkal, Jos Buttler(WK), Sanju Samson(WK)(C), Karun Nair, Shimron Hetmyer, Riyan Parag, Ravichandran Ashwin, Trent Boult, Prasidh Krishna, Obed McCoy, Yuzvendra Chahal, Shubham Garhwal, Dhruv Jurel(WK), Yashasvi Jaiswal, KC Cariappa, Tejas Baroka, Anunay Singh, Daryl Mitchell, Rassie van der-Dussen, Jimmy Neesham, Nathan Coulter-Nile, Navdeep Saini, Kuldip Yadav, Kuldeep SenRead all the Latest News, Trending News, Cricket News, IPL Live Score, IPL 2022 schedule, IPL 2022 Points table and Entertainment News. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-04-26 14:51:11","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/04/RCB-640_Sportzpics.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"CSK means so much to MS Dhoni, says Kevin Pietersen while recalling his time with MSD at Pune Supergiant","link":"https://www.firstpost.com/firstcricket/sports-news/csk-means-so-much-to-ms-dhoni-says-kevin-pietersen-while-recalling-his-time-with-msd-at-pune-supergiant-10602461.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"CSK means so much to MS Dhoni, says Kevin Pietersen while recalling his time with MSD at Pune Supergiant","content":"It’s hard to imagine Chennai Super Kings without MS Dhoni, who has been part of the yellow outfit every time they played a season in the Indian Premier League. That’s also probably the reason why the 40-year-old wicketkeeper-batter continues to play for CSK in IPL 2022 despite his retirement from international cricket over one and a half years.In fact, the only two seasons that Dhoni didn’t play for CSK were in 2015 and 2016 when the four-time champions were banned by RM Lodha committee over illegal betting charges. During the period, Dhoni led the Rising Pune Supergiant, who also roped in overseas batter Kevin Pietersen for its last season before going defunct.The English cricketer-turn commentator recalled his fond memories of sharing a dugout with MSD and found him to be ‘incredibly professional’ leading RPSG to the final that year.“That yellow outfit means so much to MS Dhoni. I remember playing with him in Pune Supergiants for a couple of seasons and he was so happy to back to CSK when they came back into the competition,” the 41-year-old Pietersen said on Star Sports. “He was incredibly professional. He did the best job he could because that is the kind of guy he is. He always gives his 100 per cent. In Pune, he was incredible in what he tried to deliver.”Pietersen, however, found that extra energy in the 2011 World Cup-winning captain whenever he led CSK.“But if you look at his energy, the way he punches at the grille of the helmet, and how much CSK means to MS Dhoni. It's a family to him,” he said.Read all the Latest News, Trending News, Cricket News, IPL Live Score, IPL 2022 schedule, IPL 2022 Points table and Entertainment News. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-04-26 14:48:08","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/04/MS-Dhoni-640-11.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL 2022, RCB vs RR Live Updates: Josh Hazlewood Gets Jos Buttler, RR 3 Down - NDTV Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMioAFodHRwczovL3Nwb3J0cy5uZHR2LmNvbS9pcGwtMjAyMi9saXZlLWlwbC1zY29yZS1yY2ItdnMtcnItbGl2ZS1jcmlja2V0LXNjb3JlLXJveWFsLWNoYWxsZW5nZXJzLWJhbmdhbG9yZS12cy1yYWphc3RoYW4tcm95YWxzLWxpdmUtc2NvcmVib2FyZC1hbmQtdXBkYXRlcy0yOTIxNzg30gGmAWh0dHBzOi8vc3BvcnRzLm5kdHYuY29tL2lwbC0yMDIyL2xpdmUtaXBsLXNjb3JlLXJjYi12cy1yci1saXZlLWNyaWNrZXQtc2NvcmUtcm95YWwtY2hhbGxlbmdlcnMtYmFuZ2Fsb3JlLXZzLXJhamFzdGhhbi1yb3lhbHMtbGl2ZS1zY29yZWJvYXJkLWFuZC11cGRhdGVzLTI5MjE3ODcvYW1wLzE?oc=5","keywords":null,"creator":null,"video_url":null,"description":"IPL 2022, RCB vs RR Live Updates: Josh Hazlewood Gets Jos Buttler, RR 3 Down  NDTV SportsRCB vs RR: Everything you need to know | IPL 2022 | 12th Man TV  Royal Challengers BangaloreRCB vs RR Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update- Tata IPL 2022  Cricket AddictorMatch Preview - RCB vs Royals, Indian Premier League 2022, 39th Match  ESPNcricinfoRCB vs RR Live Score, IPL 2022: In-form Buttler falls, Rajasthan three down in Powerplay  Times of IndiaView Full coverage on Google News","content":null,"pubDate":"2022-04-26 14:38:56","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL 2022: Rejuvenated batting performance helps Punjab Kings keep playoffs hopes alive","link":"https://www.firstpost.com/firstcricket/sports-news/ipl-2022-rejuvenated-batting-performance-helps-punjab-kings-keep-playoffs-hopes-alive-10602481.html","keywords":["First Cricket News"],"creator":["Amit Banerjee"],"video_url":null,"description":"IPL 2022: Rejuvenated batting performance helps Punjab Kings keep playoffs hopes alive","content":"Punjab Kings (PBKS) kept their Indian Premier League (IPL) playoff hopes alive with an 11-run victory over Chennai Super Kings (CSK) at the Wankhede Stadium on Monday; collecting their fourth win of the season in the process.After a couple of disappointing results against Sunrisers Hyderabad (SRH) and Delhi Capitals (DC) — with the one-sided defeat against the latter inflicting a massive blow to their Net Run Rate —, Monday’s performance against the Super Kings came as a breath of fresh air for the Mayank Agarwal-led side and their fans.After getting bundled out for a paltry 115 against Delhi, the batting department produced a much-improved display against the defending champions in Match 38. They posted a competitive 187/4 on the board that they would later go on to successfully defend; thanks to some impressive death bowling from Arshdeep Singh.The standout performance, however, came from the veteran Shikhar Dhawan, who continued his fine run in the tournament; blasting an unbeaten 88 off 59 deliveries that laid the foundation for the challenging total that the side was later successfully able to defend.Dhawan has been a consistent run-scorer all these years in the IPL and currently finds himself second in the all-time run-scorer’s list in the league behind fellow Delhiite Virat Kohli with more than 6,000 runs against his name. The authority with which he struck the nine fours and two sixes against the Chennai attack had Shikhar Dhawan of the 2020 season written all over it.The additional advantage that Dhawan had was his vast experience, which has helped him get a better understanding of CSK’s bowling plans over the years.“When you face a bowler, you have an idea as to what he will be planning next,\" Dhawan told seamer Arshdeep Singh in a chat after the game. \"I have played against CSK a number of times. I was a little careful while facing their new Sri Lankan bowler (Maheesh Theekshana), but attacked him too when the opportunity presented itself. I also knew about their plans, their preference for wide yorkers, and how I had to hit those wide yorkers over the bigger boundary.”Rajapaksa steps up for the KingsHowever, it is hard to ignore the contributions of other members of the batting department as well, who have been crucial to the Kings bouncing back from a confidence-shattering loss. On Monday, it was Sri Lankan batter Bhanuka Rajapaksa performing the supporting act to Dhawan’s fireworks.The Sri Lankan top-order bat had made just three appearances in this edition before this game. His last appearance also came against Chennai more than three weeks back. Rajapaksa would’ve felt hard done by after getting benched despite getting off to solid starts in each of his first two appearances.The Sri Lankan was striking at nearly 200 that was instrumental in helping Punjab chase down the 206-run target in their first game of the season against Royal Challengers Bangalore. He then top-scored against KKR in their next outing, smashing 31 off just nine deliveries and was something of a silver lining in an otherwise disappointing batting performance by the unit.And with his more composed approach on return in the last Monday's fixture against Chennai, in which the 30-year-old southpaw collected two sixes and as many fours, Rajapaksa highlighted the fact that he isn’t a one-trick pony. He, in fact, showed that he can play the aggressive or the supporting act depending on the team’s requirements and adjust as per the situation he finds himself at the centre of the pitch. It wasn’t a flawless knock though as he had been dropped on 2 by Ruturaj Gaikwad but still managed to make the most of the opportunity nevertheless.“It has always been the attacking way, the Punjab way. But today, we just had to change the way we bat,\" said Rajapaksa in the post-match press conference. \"And on a wicket like this, especially the way I batted, I had to wait for the ball because the ball was not coming nicely to the bat. So the more you wait, I think I was able to get the ball into the gap. I was quite fortunate in the beginning. The more I waited for the ball, the more I got it from the middle of the bat.”English all-rounder Liam Livingstone, who was the top overseas buy at the mega auction at Rs 11.5 crore, too impressed with a cameo of 7-ball 19, including a four and two maximums in three consecutive deliveries that helped Punjab plunder 22 in the penultimate over bowled by Dwaine Pretorius.That Livingstone, who has three half-centuries to his name so far this season, teed off from the word go on a surface that wasn’t the easiest to bat on is what will give the team management great confidence as far as their middle-order is concerned going forward.The only worry at the moment has been their skipper Agarwal, who has continued to cut an inconsistent figure this season and was dismissed for 18 off 21 deliveries on Monday night. Him failing to convert his starts could build pressure on his in-form opening partner Dhawan and the rest of the Punjab batting line-up.A game earlier, the 31-year-old Karnataka batter actually produced a dashing 32-ball 52 against the Mumbai Indians in an opening stand of 97 runs with Dhawan. This gave the belief for a while that Agarwal had rediscovered his old touch.However, he was nowhere near as fluent on Monday and had struggled to score freely against the Super Kings attack, especially rookie seamer Mukesh Choudhary, who appeared to have had a stranglehold on him.Agarwal may have blown hot and cold in the first half of the league phase but knows that he will have to lead from the front if he is to ensure his team finishes among the top four at the end of the league phase.Read all the Latest News, Trending News, Cricket News, IPL Live Score, IPL 2022 schedule, IPL 2022 Points table and Entertainment News. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-04-26 14:35:39","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/04/Shikhar-Dhawan-Bhanuka-Rajapaksa-PBKS-CSK-IPL-2022-Sportzpics-6401.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Royal Challengers Bangalore vs Rajasthan Royals: IPL 2022 Live Cricket Score, Live Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/royal-challengers-bangalore-vs-rajasthan-royals-live-score-over-match-39-t20-6-10-updates-2922534","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Royal Challengers Bangalore vs Rajasthan Royals from Maharashtra Cricket Association Stadium, Pune. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-04-26 14:33:50","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637866002225857005.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Virat Kohli opening IPL record and stats: Rajat Patidar cricketer stats in IPL history","link":"https://thesportsrush.com/cricket-news-virat-kohli-opening-ipl-record-and-stats-rajat-patidar-cricketer-stats-in-ipl-history/","keywords":["Cricket","IPL 2022","Rajasthan Royals","RCB","Indian Premier League","rajasthan royals","Royal Challengers Bangalore","RR","Virat Kohli"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Virat Kohli opening IPL record: The former captain of Royal Challengers Bangalore will be resuming his role as an opening batter tonight. Royal Challengers Bangalore have decided to end their experiment of opening the batting with rookie Anuj Rawat after his minimal returns in the ongoing 15th season of the Indian Premier League. Having scored… The post Virat Kohli opening IPL record and stats: Rajat Patidar cricketer stats in IPL history appeared first on The SportsRush.","content":"Virat Kohli opening IPL record: The former captain of Royal Challengers Bangalore will be resuming his role as an opening batter tonight. Royal Challengers Bangalore have decided to end their experiment of opening the batting with rookie Anuj Rawat after his minimal returns in the ongoing 15th season of the Indian Premier League. Having scored 129 runs in eight innings at an average of 16.12 and a strike rate of 109.32, Rawat has been left out for RCB’s ninth match of the season against Rajasthan Royals in Pune tonight. Batter Rajat Patidar, who plays for Madhya Pradesh in domestic cricket, has been given an opportunity in place of Rawat. Expected to bat at No. 3, Patidar will resume his IPL 2021 role. In what was his maiden IPL season, Patidar had scored 71 runs in four innings. Not part of their original IPL 2022 squad, Patidar was roped in as a replacement player for injured batter Luvnith Sisodia. Interestingly, the 28-year old player has been given a go ahead of Mahipal Lomror, who was part of their 22-member original IPL 2022 squad. Virat Kohli opening IPL record Royal Challengers captain Faf du Plessis, who won the toss and opted to bowl at the Maharashtra Cricket Association Stadium tonight, confirmed that he will be opening the batting with his predecessor Virat Kohli in this match. Ready for Round II. #PlayBold #WeAreChallengers #IPL2022 #Mission2022 #RCB #ನಮ್ಮRCB #RCBvRR pic.twitter.com/VxDihFfSWu — Royal Challengers Bangalore (@RCBTweets) April 26, 2022 “One change for us – Rajat [Patidar] comes in for Anuj Rawat with Virat [Kohli] going to the top. We want him to get going right at the top, want to see the real Virat play,” du Plessis told Star Sports at the toss. Playing his 15th IPL season, it is noteworthy that Kohli has opened in at least one match in 12 seasons over the years. In 76 IPL innings at the top of the order, Kohli had scored 2,750 runs at an average and strike rate of 43.65 and 136.67 respectively. In addition to 18 IPL half-centuries, each one of Kohli’s five centuries have come at the top of the order. Readers must note that Kohli is at the eighth position in the list of most runs by an opening batter in the IPL. In 11 innings as an opening batter against Rajasthan, Kohli has scored 247 runs at an average and strike rate of 27.44 and 118.75 respectively. All in all, Kohli has scored 3,028 runs in 84 T20 innings at an average and strike rate of 43.25 and 137.69 respectively as an opening batter. The post Virat Kohli opening IPL record and stats: Rajat Patidar cricketer stats in IPL history appeared first on The SportsRush.","pubDate":"2022-04-26 14:23:28","full_description":"Virat Kohli opening IPL record: The former captain of Royal Challengers Bangalore will be resuming his role as an opening batter tonight. Royal Challengers Bangalore have decided to end their experiment of opening the batting with rookie Anuj Rawat after his minimal returns in the ongoing 15th season of the Indian Premier League. Having scored 129 runs in eight innings at an average of 16.12 and a strike rate of 109.32, Rawat has been left out for RCB’s ninth match of the season against Rajasthan Royals in Pune tonight. Batter Rajat Patidar, who plays for Madhya Pradesh in domestic cricket, has been given an opportunity in place of Rawat. Expected to bat at No. 3 , Patidar will resume his IPL 2021 role. In what was his maiden IPL season, Patidar had scored 71 runs in four innings. Not part of their original IPL 2022 squad, Patidar was roped in as a replacement player for injured batter Luvnith Sisodia. Interestingly, the 28-year old player has been given a go ahead of Mahipal Lomror, who was part of their 22-member original IPL 2022 squad. Royal Challengers captain Faf du Plessis, who won the toss and opted to bowl at the Maharashtra Cricket Association Stadium tonight, confirmed that he will be opening the batting with his predecessor Virat Kohli in this match. Ready for Round II. 🤜🏻🤛🏻 #PlayBold #WeAreChallengers #IPL2022 #Mission2022 #RCB #ನಮ್ಮRCB #RCBvRR pic.twitter.com/VxDihFfSWu — Royal Challengers Bangalore (@RCBTweets) April 26, 2022 “One change for us – Rajat [Patidar] comes in for Anuj Rawat with Virat [Kohli] going to the top. We want him to get going right at the top, want to see the real Virat play,” du Plessis told Star Sports at the toss. Playing his 15th IPL season, it is noteworthy that Kohli has opened in at least one match in 12 seasons over the years. In 76 IPL innings at the top of the order, Kohli had scored 2,750 runs at an average and strike rate of 43.65 and 136.67 respectively. In addition to 18 IPL half-centuries, each one of Kohli’s five centuries have come at the top of the order. Readers must note that Kohli is at the eighth position in the list of most runs by an opening batter in the IPL. In 11 innings as an opening batter against Rajasthan, Kohli has scored 247 runs at an average and strike rate of 27.44 and 118.75 respectively. All in all, Kohli has scored 3,028 runs in 84 T20 innings at an average and strike rate of 43.25 and 137.69 respectively as an opening batter.","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Daryl Mitchell cricketer stats: Daryl Mitchell bowling type in cricket","link":"https://thesportsrush.com/cricket-news-daryl-mitchell-cricketer-stats-daryl-mitchell-bowling-type-in-cricket/","keywords":["Cricket","IPL 2022","Rajasthan Royals","Daryl Mitchell","rajasthan royals"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"Daryl Mitchell cricketer stats: Kiwi all-rounder is making his IPL debut for Rajasthan Royals against Royal Challengers Bangalore. Royal Challengers Bangalore are facing Rajasthan Royals in the 39th league game of the Indian Premier League. Royal Challengers Bangalore won the toss and opted to bowl first at the MCA Stadium in Pune. RCB brought in… The post Daryl Mitchell cricketer stats: Daryl Mitchell bowling type in cricket appeared first on The SportsRush.","content":"Daryl Mitchell cricketer stats: Kiwi all-rounder is making his IPL debut for Rajasthan Royals against Royal Challengers Bangalore. Royal Challengers Bangalore are facing Rajasthan Royals in the 39th league game of the Indian Premier League. Royal Challengers Bangalore won the toss and opted to bowl first at the MCA Stadium in Pune. RCB brought in Rajat Patidar in place of Anuj Rawat, whereas Rajasthan Royals made two changes to their side. Rajasthan Royals handed a debut to New Zealand’s all-rounder Daryl Mitchell. “A couple of changes, Daryl Mitchell comes in place of Karun Nair, Kuldeep Sen replaces Obed McCoy,” Sanju Samson said at the toss. Daryl Mitchell cricketer stats Kiwi all-rounder Daryl Mitchell is a seasoned T20 player, and he will be making his IPL debut in this game. Daryl Mitchell plays for Canterbury in the New Zealand domestic cricket, whereas he has also played for Middlesex in the T20 Blast. Mitchell is a pace-bowling all-rounder, and he generally prefers to bat at the top-order in the T20 format. He has scored 2722 T20 runs at an average of 30.93, whereas his strike-rate has been 132.45. He has smashed 11 half-centuries in his T20 career. Daryl Mitchell makes his Royals debut in #RCBvRR! Let’s do this, boys! #RoyalsFamily | #HallaBol | @Dream11 pic.twitter.com/vypBH1VeAt — Rajasthan Royals (@rajasthanroyals) April 26, 2022 In terms of pace bowling, Mitchell has scalped 59 wickets, where 4/32 has been his best bowling figure. Daryl Mitchell’s performance in the ICC T20 World Cup 2021 played a major part in getting him an IPL contract. New Zealand allowed Mitchell to open the innings, and he reaped some rewards. Mitchell scored 2018 runs in the T20 World Cup at a staggering strike-rate of 140.54, courtesy of one half-century. Daryl is famous for his hard-hitting, and can be used as a finisher as well. “It’s an honour and privilege to be part of Rajasthan and I’m enjoying it,” Daryl Mitchell said ahead of his debut. “We have an experienced squad with world-class players, so it’s important to keep helping each other, communicate and help each other out, T20 is a funny game, sometimes things don’t go your way, but you’ll need to stick with the process.” The post Daryl Mitchell cricketer stats: Daryl Mitchell bowling type in cricket appeared first on The SportsRush.","pubDate":"2022-04-26 14:14:56","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Royal Challengers Bangalore vs Rajasthan Royals Live Score Ball by Ball, IPL 2022 Live Cricket Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/royal-challengers-bangalore-vs-rajasthan-royals-live-score-over-match-39-t20-1-5-updates-2922305","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Royal Challengers Bangalore vs Rajasthan Royals from Maharashtra Cricket Association Stadium, Pune. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-04-26 13:45:59","full_description":"Follow the Indian Premier League 2022 live cricket score on Sports.NDTV.com . After 5.1 overs, Rajasthan Royals are 37/3. Get live score, ball by ball commentary and much more. Keep track of Indian Premier League 2022 today match between Royal Challengers Bangalore and Rajasthan Royals. Everything related to Royal Challengers Bangalore and Rajasthan Royals match will be available on Sports.NDTV.com . Stay updated with Royal Challengers Bangalore vs Rajasthan Royals live score. Do check for Royal Challengers Bangalore vs Rajasthan Royals scorecard. You can get scorecard updates, match related facts. Get quick live updates with ads, Sports.NDTV.com , which is the perfect destination for live cricket score. 4.6 overs (0 Run) A length ball, outside off. Mitchell has a poke at it but misses. A maiden-wicket over! 4.5 overs (0 Run) Full ball, outside off. Mitchell drives it hard but straight to mid on. 4.4 overs (0 Run) Short of a length and on off. Mitchell steps across and tucks it to square leg. 4.3 overs (0 Run) Length ball, outside off. Mitchell again blocks it. 4.2 overs (0 Run) On a length and on off. Mitchell blocks it. Daryl Mitchell is the new man in. 4.1 overs (0 Run) OUT! CAUGHT! A huge, huge wicket for Bangalore as the man in form, Buttler goes for a cheap score. Bangalore are pumped up and they know how big this wicket is. This is on a length and around off, the ball just stays low a bit. Jos Buttler looks to pull but does not time it well, hits it to mid on where Mohammed Siraj runs forward and takes a superb catch diving low to his left. That was a brilliant catch. Sanju Samson the skipper of Rajasthan comes to the crease now. 3.6 overs (0 Run) OUT! CAUGHT AND BOWLED! Ashwin's stay is cut off! Short of a length and outside off. Ashwin looks to pull but the ball takes the top edge and balloons nicely for Mohammed Siraj who covers a little ground and grabs it with ease. Ashwin's quick cameo comes to an end. 3.5 overs (0 Run) On a length and outside off. Ashwin works it to covers. 3.4 overs (4 Runs) FOUR! Ashwin is enjoying up the order. A full ball, on off. Ashwin heaves it through mid-wicket for a boundary. 3.3 overs (4 Runs) FOUR! Another superb shot from Ashwin! A length ball, outside off. Ashwin cuts it past point for a boundary. 3.2 overs (0 Run) Length ball, around off. Ashwin mistimes his pull to mid-wicket. 3.1 overs (0 Run) On a length and on off. Ashwin keeps it out. 2.6 overs (0 Run) A in-nipper, it lands outside off. Buttler shuffles across and looks to work on the leg side but misses. The ball lobs on the off side and Ashwin is hurling across for a quick run but was sent back. Josh Hazlewood does not have a pop at the bowler's end. 2.5 overs (1 Run) A length ball, outside off. Ashwin cuts it late to third man for a single. 2.4 overs (1 Run) On a length and outside off. Buttler punches it through cover-point for a single. 2.3 overs (4 Runs) FOUR! Edged and runs! Dinesh Karthik is not happy! A length ball, just outside off. Buttler looks to punch but gets an inside edge and to the left of Karthik who fails to stop it. A boundary. 2.2 overs (0 Run) Too full and on middle. Buttler blocks it out solidly. 2.1 overs (0 Run) A huge shout for LBW but not given. A length ball, outside off, it nips and shapes back in sharply. Buttler comes down the track and looks to flick but gets hit high on the pads. Josh Hazlewood comes into the attack. He replaces Shahbaz Ahmed. 1.6 overs (4 Runs) FOUR! Two in a row! A length ball, outside off. Ashwin punches it to covers where the fielder dives but to no avail as the ball was placed beautifully there. A boundary. 1.5 overs (4 Runs) FOUR! Ashwin gets off the mark with a boundary! Fuller ball, on middle. Ashwin leans and flicks it through mid-wicket for a boundary. Ravichandran Ashwin walks out to bat at number 3. 1.4 overs (0 Run) OUT! LBW! Padikkal is given out for LBW! He takes the review straight away. UltraEdge shows no bat there. Ball Tracking shows three reds and the on-field decision stays. Bangalore celebrates as they get Padikkal for a timid score. The go-to-delivery for any bowler. A yorker, around middle and leg. Padikkal misses his flick and gets hit on the pads. An appeal and up goes the finger. Looked plumb to the naked eye but not sure why Padikkal took it upstairs. Eventually, he walks back after taking a review. 1.3 overs (0 Run) A length ball, outside off, this one nips away just. Padikkal looks to defend but gets beaten on the outside edge. 1.2 overs (0 Run) On a length and outside off. Padikkal tries to play down the ground but gets a bottom edge to the keeper. 1.1 overs (6 Runs) SIX! What a shot! This is full and around off. Padikkal stays back and lofts it beautifully over long off for a biggie. Who will bowl from the other end? Mohammed Siraj it is! 0.6 over (0 Run) This one comes with the angle, around off. Buttler looks to push but gets an inside edge onto the pads. 0.5 over (2 Runs) Fuller ball, way outside off. Buttler drives it wide of long off for a couple of runs. 0.4 over (1 Run) Touch fuller and on middle. Padikkal drills it to long on for a single. He is underway as well. 0.3 over (0 Run) Slightly short and down the leg side. Padikkal nudges it to square leg. 0.2 over (0 Run) Tossed up, on middle. Padikkal leans and tucks it to mid-wicket. 0.2 over (1 Run) Wide! Flatter but down the leg side. Padikkal leaves it alone. 0.1 over (1 Run) Flatter and around off. Buttler punches it through covers for a single. Rajasthan are underway. We are ready for action! The umpires are out in the middle. Bangalore players are seen in a huddle before they take their positions on the field. Jos Buttler and Devdutt Padikkal will open the batting for Rajasthan. Shahbaz Ahmed will begin the proceedings with the ball. Here we go... Mike Hesson is down for a chat. He says that they moved quickly from the previous games, it's one of those games where they don't analyze much and just move on. Mentions that he is pretty pleased with their overall performances and they have had highs and lows so far, but it's about being more consistent. Mentions that when they have discussions they do not discuss the forms of players and Virat has plenty of experiences and a good game is just around the corner for him. Sanju Samson, the skipper of Rajasthan, says they would've liked to bowl first as looking at the conditions but they are happy to bat first and hope to do the job. Says Buttler is helping the team and youngsters and he has been incredible so far. Informs there are two changes. Mentions their aim is to put the best foot forward and he feels they have done a good job so far. Faf du Plessis, the skipper of Bangalore, says that they are going to bowl first, they are looking to exploit it. Mentions that this is a competition of many games, it does not matter whether they win by many runs or lose by many runs, they should just have to get to the play-off. Adds that they have one change Rajat Patidar comes in for Anuj Rawat which means Virat Kohli will open the innings. Concludes by saying that it's a new day and a new game and they want to do well. Rajasthan (Playing XI) - Jos Buttler, Daryl Mitchell (In for Karun Nair), Devdutt Padikkal, Sanju Samson (C/WK), Shimron Hetmyer, Riyan Parag, Trent Boult, Ravichandran Ashwin, Kuldeep Sen (In for Obed McCoy), Prasidh Krishna, Yuzvendra Chahal. Bangalore (Playing XI) - Faf du Plessis (C), Virat Kohli, Rajat Patidar (In for Anuj Rawat), Glenn Maxwell, Suyash Prabhudessai, Shahbaz Ahmed, Dinesh Karthik (WK), Harshal Patel, Wanindu Hasaranga, Josh Hazlewood, Mohammed Siraj. TOSS - Bangalore have won the toss and they have elected to BOWL first! PITCH REPORT - Deep Dasgupta is down near the pitch. He says that this is the pitch that was used where Kolkata had chased down 160 when Pat Cummins played that blinder of an innings. Adds that it looks quite green and seamers might get help, but it's abrasive under the grass which means that it could grip and it's a two-paced wicket. Traditionally it's been a chasing ground. Honestly, Rajasthan have been the most prolific team around this season, with the top scorer, Jos Buttler, and the highest wicket-taker, Yuzvendra Chahal in them. They do look like a solid team and will fancy a win here against Bangalore who were demolished by Hyderabad in their last match. They will be itching to bounce back with a solid performance and will hope that Virat Kohli breaks the shackles and find some form. If you look at the last few battles between these two, it is Bangalore who dominates the chart. This one promises to be an exciting match. Stay tuned for the toss and other updates. Hello and a warm welcome to the coverage of match number 39 where Bangalore will meet Rajasthan. The last time these two met earlier, it was the team from South who won the clash. Will they do the double or Rajasthan will take the revenge? We will find out. ... MATCH DAY...","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637865973512002034.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Gujarat Titans, Sunrisers Hyderabad battle to establish bowling supremacy, Indian Premier League 2022 | Cricbuzz.com - Cricbuzz - Cricbuzz","link":"https://news.google.com/__i/rss/rd/articles/CBMiV2h0dHBzOi8vbS5jcmljYnV6ei5jb20vY3JpY2tldC1uZXdzLzEyMjAzNy9ndC1zcmgtYmF0dGxlLXRvLWVzdGFibGlzaC1ib3dsaW5nLXN1cHJlbWFjedIBnQFodHRwOi8vbS5jcmljYnV6ei5jb20vYW1wL2NyaWNrZXQtbmV3cy8xMjIwMzcvZ3VqYXJhdC10aXRhbnMtc3VucmlzZXJzLWh5ZGVyYWJhZC1iYXR0bGUtdG8tZXN0YWJsaXNoLWJvd2xpbmctc3VwcmVtYWN5LWluZGlhbi1wcmVtaWVyLWxlYWd1ZS0yMDIyLWNyaWNidXp6Y29t?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Gujarat Titans, Sunrisers Hyderabad battle to establish bowling supremacy, Indian Premier League 2022 | Cricbuzz.com - Cricbuzz  CricbuzzGujarat Titans vs SunRisers Hyderabad Match Prediction: Who Will Win Today's IPL Match Between GT And SRH? IPL 2022, Match 40, GT vs SRH  Cricket AddictorMatch Preview - Titans vs Sunrisers, Indian Premier League 2022, 40th Match  ESPNcricinfoGUJ vs HYD 11Wickets Prediction, Fantasy Cricket Tips, Playing 11, Pitch Report and Injury Update for Match 40 of Indian T20 League 2022  CricTrackerSRH vs GT preview: Battle of pace aces as it’s Gujarat Titans’ Ferguson vs Sunrisers Hyderabad’s Umran  The Indian ExpressView Full coverage on Google News","content":null,"pubDate":"2022-04-26 13:39:19","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Lifespan Lions emerge champions of Doctors Premier Cricket league","link":"https://telanganatoday.com/lifespan-lions-emerge-champions-of-doctors-premier-cricket-league","keywords":["Cricket","News","Sport","Cricket League","DPCL","Dr Neeti Mala","Lifespan Lions"],"creator":["Telangana Today"],"video_url":null,"description":"Hyderabad: Lifespan Lions defeated Dr Neeti Mala’s Warrior Tigons to emerge champions of the Doctors Premier Cricket league (DPCL) held at the Abhiram Cricket County, Donthanpalle, Hyderabad. Earlier, Lifespan Lions downed Apollo Gastro Avengers in the semifinals to make it to the final. Dr Ajendra of Lifespan Lions won the Man of the Match and […]","content":"Hyderabad: Lifespan Lions defeated Dr Neeti Mala’s Warrior Tigons to emerge champions of the Doctors Premier Cricket league (DPCL) held at the Abhiram Cricket County, Donthanpalle, Hyderabad. Earlier, Lifespan Lions downed Apollo Gastro Avengers in the semifinals to make it to the final. Dr Ajendra of Lifespan Lions won the Man of the Match and Man of the Series. Narendra Ram Nambula, CMD of Lifespan Pvt Limited, congratulated the Lifespan team members and lauded all the participating teams in the event for their sportsmanship. He also thanked the organisers for successfully conducting the tournament. Eight teams had taken part in the tournament. The league was held in Hyderabad. However, some matches were conducted in Visakhapatnam, Vijayawada and Tirupati.   Now you can get handpicked stories from Telangana Today on Telegram everyday. Click the link to subscribe. Click to follow Telangana Today Facebook page and Twitter .","pubDate":"2022-04-26 13:24:21","image_url":null,"source_id":"telanganatoday","country":["india"],"category":["sports"],"language":"english"},{"title":"Jos Buttler stats vs RCB and last 5 innings list: Jos Buttler vs Harshal Patel IPL record","link":"https://thesportsrush.com/cricket-news-jos-buttler-stats-vs-rcb-and-last-5-innings-list-jos-buttler-vs-harshal-patel-ipl-record/","keywords":["Cricket","IPL 2022","Rajasthan Royals","RCB","Harshal Patel","Indian Premier League","Jos Buttler","rajasthan royals","Royal Challengers Bangalore","RR"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Jos Buttler stats vs RCB: The English batter will be playing his 11th match against Royal Challengers Bangalore tonight. The kind of form Rajasthan Royals opening batter Jos Buttler is in in the ongoing 15th season of the Indian Premier League, it goes without saying that he will be the centre of attraction against Royal… The post Jos Buttler stats vs RCB and last 5 innings list: Jos Buttler vs Harshal Patel IPL record appeared first on The SportsRush.","content":"Jos Buttler stats vs RCB: The English batter will be playing his 11th match against Royal Challengers Bangalore tonight. The kind of form Rajasthan Royals opening batter Jos Buttler is in in the ongoing 15th season of the Indian Premier League, it goes without saying that he will be the centre of attraction against Royal Challengers Bangalore at the Maharashtra Cricket Association Stadium tonight. In his previous five T20s (including a T20I a decade ago) in Pune, Buttler has scored 155 runs at an average and strike rate of 51.67 and 151.96. While Buttler hasn’t scored a T20 half-century at this venue, him scoring as many as three centuries this season are enough for the opposition to be making plans to contain him on Tuesday. Jos Buttler stats vs RCB Set to face Royal Challengers for the 11th time in the IPL, Buttler would want to build on his decent record against them. For now, Buttler’s 298 runs in 10 innings against Bangalore have come at an average and strike rate of 37.25 and 149 including a couple of half-centuries. One last time in Pune this season. #RCBvRR | #HallaBol | #IPL2022 | @DollarBigboss pic.twitter.com/bUySUX64IQ — Rajasthan Royals (@rajasthanroyals) April 26, 2022 Although in a losing cause, Buttler had scored a career-best 70* (47) in his last encounter against RCB at the Wankhede Stadium earlier this month. As a fielder, Buttler has grabbed three IPL catches against this opposition over the years. Jos Buttler vs Harshal Patel IPL record The highest run-scorer of this season (till now) facing the highest wicket-taker of the last season has it in it to form an intriguing contest. However, it is worth mentioning that Buttler and Bangalore pacer Harshal Patel have only faced each other once in the IPL. ALSO READ: Harshal Patel reveals Virat Kohli’s message after RCB bought him for INR 10.75 crore Buttler, who has scored only 6 (9) against Patel in the IPL, is yet to be dismissed by him. The post Jos Buttler stats vs RCB and last 5 innings list: Jos Buttler vs Harshal Patel IPL record appeared first on The SportsRush.","pubDate":"2022-04-26 13:04:32","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"\"If One 'F*** You' Comes Your Way\": Shastri To Team On Tackling Aussies","link":"https://sports.ndtv.com/cricket/if-one-f-you-comes-your-way-ravi-shastris-message-to-indian-cricket-team-on-tackling-australia-2921699","keywords":null,"creator":null,"video_url":null,"description":"Ravi Shastri, former Indian cricket team head coach, reveals the inside story on how the side won in Australia twice","content":null,"pubDate":"2022-04-26 11:18:29","image_url":"https://c.ndtvimg.com/2022-01/pe2ge6mg_ravi-shastri-virat-kohli_120x90_15_January_22.jpg","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Rishi Dhawan returns to the IPL after almost six years: A look at all-rounder's return to limelight","link":"https://www.firstpost.com/firstcricket/sports-news/rishi-dhawan-returns-to-the-ipl-after-almost-six-years-a-look-at-all-rounders-return-to-limelight-10600071.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"Rishi Dhawan returns to the IPL after almost six years: A look at all-rounder's return to limelight","content":"Punjab Kings had included all-rounder Rishi Dhawan after making a bid of Rs 55 lakh during the mega auction ahead of the IPL 2022. Rishi finally made a return to the Indian Premier League after a span of almost six years. Rishi was included in the XI by the Punjab Kings for the clash against Chennai Super Kings at the Wankhede Stadium. Though he didn't get to bat but completed his quota of four overs and returned with figures of 2/39.His dismissals included the wickets of Shivam Dube and MS Dhoni. The Punjab Kings eventually won the match by 11 runs after defending a target of 188 runs.Rishi has played 27 IPL matches till date and has been a part of Kings XI Punjab, Mumbai Indians and Kolkata Knight Riders' camp in the past. He last played in the 2016 edition a returned with a couple of wickets.Rishi Dhawan had an injury during Ranji Trophy and making a great comeback in his first match in #IPL2022 pic.twitter.com/Wh4s7744R2— Johns. (@CricCrazyJohns) April 25, 2022Domestic runThe right-hander might not have played a lot in the cash-rich league but is considered to be one of the finest players in the domestic circuit. While he was away from the IPL, Rishi Dhawan achieved a major success after he led his domestic side Himachal Pradesh to Vijay Hazare Trophy title in December last year.This was Himachal Pradesh's first title in Indian domestic cricket. They defeated Tamil Nadu in the final.While he led the side to the winning triumph, Dhawan himself was in form with both bat and ball after he notched up a total of 458 runs and scalped 17 wickets during the tournament.On the radarThe splendid run in the domestic competitions has put Rishi on the selectors' radar. Chairman of selectors Chetan Sharma had earlier this year revealed some names who were in the scheme of things.Read all the Latest News, Trending News, Cricket News, IPL Live Score, IPL 2022 schedule, IPL 2022 Points table and Entertainment News. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-04-26 10:28:53","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/04/Rishi-Dhawan-6401.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"RCB vs RR Dream11 IPL 2022: Fantasy Cricket Tips, Dream 11, Probable Playing XI for Bangalore vs Rajasthan","link":"https://www.indiatvnews.com/sports/cricket/rcb-vs-rr-dream11-prediction-fantasy-cricket-tips-predicted-playing-xi-toss-report-injury-updates-tata-ipl-2022-2022-04-26-772314","keywords":null,"creator":null,"video_url":null,"description":"RCB vs RR Dream11 IPL 2022: Fantasy Cricket Tips, Dream 11, Probable Playing XI for Royal Challengers Bangalore vs Rajasthan Royals Match Details","content":null,"pubDate":"2022-04-26 10:25:11","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"Watch: Arshdeep Singh's Celebration After Dismissing Mitchell Santner In IPL 2022 Goes Viral - NDTV Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMikgFodHRwczovL3Nwb3J0cy5uZHR2LmNvbS9pcGwtMjAyMi9pbmRpYW4tcHJlbWllci1sZWFndWUtMjAyMi1hcnNoZGVlcC1zaW5naHMtY2VsZWJyYXRpb24tYWZ0ZXItZGlzbWlzc2luZy1taXRjaGVsbC1zYW50bmVyLWdvZXMtdmlyYWwtd2F0Y2gtMjkyMDg5ONIBmAFodHRwczovL3Nwb3J0cy5uZHR2LmNvbS9pcGwtMjAyMi9pbmRpYW4tcHJlbWllci1sZWFndWUtMjAyMi1hcnNoZGVlcC1zaW5naHMtY2VsZWJyYXRpb24tYWZ0ZXItZGlzbWlzc2luZy1taXRjaGVsbC1zYW50bmVyLWdvZXMtdmlyYWwtd2F0Y2gtMjkyMDg5OC9hbXAvMQ?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Watch: Arshdeep Singh's Celebration After Dismissing Mitchell Santner In IPL 2022 Goes Viral  NDTV SportsIPL 2022: 10 Hilarious Memes From ‘CSK vs PBKS’ Match  The Cricket LoungeExpresso IPL Update at 1:30 pm on 26th April  The Indian ExpressNerveless Arshdeep Singh aces the endgame to repay Kings' faith  ESPNcricinfoYou`re bowling at him, there`s not one red shirt in crowd: Rabada praises Rishi after PBKS beat CSK  WIONView Full coverage on Google News","content":null,"pubDate":"2022-04-26 09:59:23","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL 2022: Yuzvendra Chahal maintains lead even as T Natarajan, Dwayne Bravo close gap in purple cap list","link":"https://www.firstpost.com/firstcricket/sports-news/ipl-2022-yuzvendra-chahal-maintains-lead-even-as-t-natarajan-dwayne-bravo-close-gap-in-purple-cap-list-10600411.html","keywords":["First Cricket News"],"creator":["FP Trending"],"video_url":null,"description":"IPL 2022: Yuzvendra Chahal maintains lead even as T Natarajan, Dwayne Bravo close gap in purple cap list","content":"Indian Premier League 2022 has entered the business end. At the start of the fifth week, it appears that Gujarat Titans are a clear favourites to grab a top-two finish. The debutants have 12 points from seven matches and sit on top of the IPL 2022 points table comfortably. The same, however, can't be said about IPL's two most successful teams: Mumbai Indians and Chennai Super Kings.Five-time winners MI are yet to win a match and their chances of making it to the playoffs are close to nil. Defending champions CSK are not faring any better. Their 11-run loss to Punjab Kings means they won't be able to secure direct qualification even if they win their remaining six matches. The Ravindra Jadeja-led side will now have to depend on net run rate and a host of other factors to stand a chance of making it to the playoffs.There is another interesting race going on for the purple cap, which is awarded to the highest wicket-taker of the tournament. Rajsthan Royals' leg-spinner Yuzvendra Chahal is sitting on top with 18 wickets in seven matches. Chahal, who has taken his first hat-trick, is in top form with the ball and is also one of the main reasons behind RR's improved performance.Chahal is followed by Sunrisers Hyderabad left-arm pacer T Natarajan, who has taken 15 wickets in seven matches.Then comes CSK all-rounder Dwayne Bravo, who broke into the top-three after picking up two wickets against PBKS in Mumbai on Monday. The IPL's all-time highest wicket-taker has so far taken 14 wickets in eight matches.At the fourth and fifth positions are two comeback men of Indian cricket: Kuldeep Yadav and Umesh Yadav. Playing for the Delhi Capitals, Kuldeep has scalped 13 wickets in seven matches and is in the middle of one of his best-ever IPLs. Umesh, on the other hand, has been a shining light in the Kolkata Knight Riders bowling unit. The right-arm seamer has sneered 11 wickets in eight matches.Read all the Latest News, Trending News, Cricket News, IPL Live Score, IPL 2022 schedule, IPL 2022 Points table and Entertainment News. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-04-26 09:44:21","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/04/yuzvendra-chahal-640.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL 2022: Jos Buttler bosses league, leads six-hitting charge as batters make merry on sporting pitches","link":"https://www.firstpost.com/firstcricket/sports-news/ipl-2022-jos-buttler-bosses-league-leads-six-hitting-charge-as-batters-make-merry-on-sporting-pitches-10600301.html","keywords":["First Cricket News"],"creator":["FP Trending"],"video_url":null,"description":"IPL 2022: Jos Buttler bosses league, leads six-hitting charge as batters make merry on sporting pitches","content":"The 15th edition of IPL has seen openers drop anchor but they have not stuck to the template of picking up gaps and batting deep. Instead, the likes of Jos Buttler, KL Rahul and Prithvi Shaw have dominated the powerplay overs with six- and four-hitting abilities. These three batters have topped all the batting charts and after their onslaught at the top of the order, the middle order too has players who are going hell for leather from ball 1.The nature of surfaces on offer in this IPL has also allowed the stroke-makers to express themselves. As far as the six-hitting numbers are concerned, Jos Buttler, who has lit up the IPL with three tons in seven matches so far, leads this chart as well. In seven innings, Buttler has smashed 32 sixes and this dominance is reflected in his rather extraordinary average of 81.83 and a strike-rate of 161.51.Buttler's dominance sets him on the path to overtake Virat Kohli’s herculean efforts from the 2016 season when he had scored 973 runs with 4 centuries.Buttler is followed by Kolkata Knight Riders’ Andre Russel, who has given glimpses of his brute force with some blitzkrieg of an innings over the last month. In seven innings, the Jamaican has smashed 32 sixes as well. As far as other vital stats are concerned, he has scored 227 runs at an average of 45.40 and with a strike rate of 180.15.In Punjab Kings’, Liam Livingstone has been one prolific six-hitter. In eight innings, the Englishman has walloped 18 sixes so far and has scored 245 runs at an average of 30.63 while striking at a rate of 187.02. His role seems to be defined for the Punjab Kings and this has given him clarity whenever he strides out to bat, which is generally at the number 4 position.Read all the Latest News, Trending News, Cricket News, IPL Live Score, IPL 2022 schedule, IPL 2022 Points table and Entertainment News. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-04-26 09:10:11","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/04/Buttler-RRvKKR-640_Sportzpics.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"}]}