{"newsArray":[{"title":"Captain Kane fires Sunrisers to win","link":"https://www.cairnspost.com.au/sport/cricket/captain-kane-fires-sunrisers-to-win/video/5249abcd04ab08c557887bb9177a03bf","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket: Captain Kane Williamson blasted 57 runs as the Sunrisers Hyderabad beat the Gujarat Titans in Mumbai.","content":null,"pubDate":"2022-04-11 22:45:25","full_description":null,"image_url":null,"source_id":"cairnspost","country":["australia"],"category":["sports"],"language":"english"},{"title":"South African spin does for Bangaladesh","link":"https://www.cairnspost.com.au/sport/cricket/south-african-spin-does-for-bangaladesh/video/f43cb2ec12c867d0e7d71000fea90b37","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket: South Africa's spinners have done the business once again, tearing through the Bangladesh batting order on day four.","content":null,"pubDate":"2022-04-11 22:36:20","full_description":null,"image_url":null,"source_id":"cairnspost","country":["australia"],"category":["sports"],"language":"english"},{"title":"‘What are you doing?’ Khaled Ahmed’s brain melt","link":"https://www.cairnspost.com.au/sport/cricket/what-are-you-doing-khaled-ahmeds-brain-melt/video/29207d818b1189b510e4c32d8dba22ca","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket: Bangladesh quick Khaled Ahmed and South Africa's Kyle Verreynne almost came to blows after a needless return throw, before Ahmed got his man just overs later.","content":null,"pubDate":"2022-04-11 22:18:21","full_description":null,"image_url":null,"source_id":"cairnspost","country":["australia"],"category":["sports"],"language":"english"},{"title":"‘Extreme pressure’: Aussies set to lock in Langer replacement as Test great issues warning to Cummins","link":"https://www.foxsports.com.au/cricket/australia/australian-cricket-news-2022-andrew-mcdonald-new-coach-reaction-justin-langer-pat-cummins-the-hundred/news-story/0e8c85ac2c3c30a55165787dcd362d3d","keywords":null,"creator":null,"video_url":null,"description":"The Australian men’s cricket team is ready to take the next formal step in the post-Justin Langer era, with Andrew McDonald to be announced as his official replacement.","content":null,"pubDate":"2022-04-11 21:08:00","full_description":"The Australian men’s cricket team is ready to take the next formal step in the post-Justin Langer era, with Andrew McDonald to be announced as his official replacement. That is according to a report from The Daily Telegraph , which claims that the job was offered to McDonald earlier this week — now it is up to him to decide whether he wants it. McDonald took over as interim head coach following Langer’s resignation and he is tipped to be announced as the formal replacement in the next 24 to 48 hours. Watch The 2022 Indian Premier League on Kayo. Every Match Live & On-Demand. New to Kayo? Try 14-Days Free Now > Cummins smashes equal fastest IPL fifty! | 01:04 Speaking on The Big Sports Breakfast on Tuesday morning, former Australia Test captain Michael Clarke called it a “fantastic” appointment but that came with a warning. “This is exactly what the players want, there is no doubt about that,” Clarke said. “If they don’t perform and Pat Cummins doesn’t perform now as captain, he’s going to have extreme pressure on him. He’s had Justin Langer sacked pretty much. He came out and said this is what the players wanted and he is the face of the players as captain and said we want Andrew McDonald. “Everything is going their way, which is good if they’re winning but if you’re losing accountability comes with that.” Justin Langer stepped down as coach earlier this year. (Photo by Mark Brake - CA/Cricket Australia via Getty Images) Source: Getty Images Cummins was clear when Langer’s exit was confirmed that Australia needed a “new style of coaching and skillset”, adding that was the feedback both he and the players provided to Cricket Australia. Cummins then praised interim coach McDonald late last month, telling reporters: “The boys absolutely love him”. Clarke at the time said that was a clear sign the playing group was pushing for McDonald to be appointed as head coach. “If that’s what makes the right coach, then lock Andrew McDonald in for a 20-year contract because ‘Mac’ is a great fella,” Clarke said. “He was a wonderful player but ‘Macca’ is a jet, he is a great man. He would be an awesome coach but if the team wants a good bloke, you can lock him in for a 20-year deal because you won’t find too many better. It’s a no-brainer in JL resigning, this is exactly what the players wanted.” Get all the latest cricket news, highlights and analysis delivered straight to your inbox with Fox Sports Sportmail. Sign up now!!! Australia finish tour in style | 03:30 Similarly, as he did on Tuesday morning, Clarke also warned the playing group to be sure of its motivations in pushing for the appointment. “I think what has happened is he has come in as assistant coach and the players liked his style more than JL’s toughness,” Clarke said. “So, the players have come together and said: ‘Right, we’d much prefer our mate to be our coaching than someone bossing us around’. Right now, if you’re winning, they’ll get away with it but if they start losing, the first thing they are going to go to is the coach.” Finch FINALLY finds some form | 01:32 Crucially, McDonald is set to coach the playing group for all three formats, although the report from The Daily Telegraph adds he could be given select white ball tours off. In that case, assistant Michael Di Venuto would step in to briefly fill the void. McDonald had revealed last week that he had held talks with Cricket Australia over the head coaching job since the Test series in Pakistan wrapped up. Speaking to reporters, he said the structure of the role would determine whether he took on the job. “Do I want the job? It depends on what it looks like, how Cricket Australia see the job unfolding and I will probably get more detail and clarity moving forward,” he said. Only complicating matters further is the fact McDonald was recently confirmed as the head coach of Birmingham Phoenix in the English Hundred competition. That role would require McDonald to be in England from late July to early September. Andrew McDonald is expected to be formally announced as the replacement shortly. (Photo by William WEST / AFP) Source: AFP Speaking on SEN Radio in February, new Cricket Australia chairman Lachlan Henderson made it clear the role would not be split across different formats. “We’ve been clear that a single head coach is what we’re going to appoint,” he said at the time. “It is worth pointing out that it’s an incredibly congested schedule over the next 12 to 18 months and the appointed head coach will have a say if they’re not available for every aspect of that schedule.”","image_url":null,"source_id":"foxsports","country":["australia"],"category":["sports"],"language":"english"},{"title":"Virat Kohli vs CSK stats and last 5 innings list: Virat Kohli vs DJ Bravo IPL records","link":"https://thesportsrush.com/cricket-news-virat-kohli-vs-csk-stats-and-last-5-innings-list-virat-kohli-vs-dj-bravo-ipl-records/","keywords":["Cricket","CSK","IPL 2022","RCB","chennai super kings","csk","Dwayne Bravo","Royal Challengers Bangalore","Virat Kohli"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Virat Kohli vs CSK stats: The former captain of Royal Challengers Bangalore will be facing Chennai Super Kings for the 29th time tonight. On the receiving end of a poor umpiring decision in the last match against Mumbai Indians, former Royal Challengers Bangalore captain Virat Kohli will be expected to play a central role in… The post Virat Kohli vs CSK stats and last 5 innings list: Virat Kohli vs DJ Bravo IPL records appeared first on The SportsRush.","content":"Virat Kohli vs CSK stats: The former captain of Royal Challengers Bangalore will be facing Chennai Super Kings for the 29th time tonight. On the receiving end of a poor umpiring decision in the last match against Mumbai Indians, former Royal Challengers Bangalore captain Virat Kohli will be expected to play a central role in their next match against defending champions Chennai Super Kings tonight. Eighth match of the season at the Dr DY Patil Sports Academy, it will only be the second for Chennai at this venue this season. Coming on the back of a shocking four consecutive defeats, Ravindra Jadeja and his men had lost to Sunrisers Hyderabad in their only IPL 2022 match here. Bangalore, on the other hand, have won and lost an IPL 2022 match each in Navi Mumbai. Virat Kohli vs CSK stats Kohli, who has played against CSK in each IPL season, has scored 948 runs in 27 innings at an average and strike rate of 41.22 and 127.25 respectively. Kohli’s nine IPL half-centuries against CSK have seen him scoring a best of 90* (52) at the Dubai International Cricket Stadium during IPL 2020. Readers must note that Kohli had played a lone Champions League Twenty20 2010 match against CSK in Durban. Batting at No. 5, Kohli had scored 14 (12) back in the day. In the 11 overs that Kohli has bowled across seven innings against CSK, he has picked a solitary wicket at an average of 116 and an economy rate of 10.55. As a fielder, Kohli has grabbed 12 catches against this opposition. Runs Balls 4s 6s Ground Year 53 41 6 1 Sharjah 2021 8 7 1 0 Mumbai 2021 50 43 1 1 Dubai 2020 90* 52 4 4 Dubai 2020 9 8 2 0 Chennai 2019 Virat Kohli vs DJ Bravo IPL records Two experienced campaigners in Kohli and Super Kings all-rounder Dwayne Bravo will be facing each other for the 16th time in T20s tonight. Happiness when you realise it’s only 2⃣4⃣ hrs to go for game time. #PlayBold #WeAreChallengers #IPL2022 #Mission2022 #RCB #ನಮ್ಮRCB pic.twitter.com/ZnfYMZt4LJ — Royal Challengers Bangalore (@RCBTweets) April 11, 2022 Over the years, Kohli has scored 203 (128) with the help of 24 fours and four sixes against Bravo. In return, Bravo has dismissed Kohli on a couple of occasions in T20s. Talking precisely about the IPL, Kohli has scored 157 (103) with the help of 17 fours and four sixes against Bravo which involves one dismissal. The post Virat Kohli vs CSK stats and last 5 innings list: Virat Kohli vs DJ Bravo IPL records appeared first on The SportsRush.","pubDate":"2022-04-11 19:04:30","full_description":"Virat Kohli vs CSK stats: The former captain of Royal Challengers Bangalore will be facing Chennai Super Kings for the 29th time tonight. On the receiving end of a poor umpiring decision in the last match against Mumbai Indians, former Royal Challengers Bangalore captain Virat Kohli will be expected to play a central role in their next match against defending champions Chennai Super Kings tonight. Eighth match of the season at the Dr DY Patil Sports Academy, it will only be the second for Chennai at this venue this season. Coming on the back of a shocking four consecutive defeats, Ravindra Jadeja and his men had lost to Sunrisers Hyderabad in their only IPL 2022 match here. Bangalore, on the other hand, have won and lost an IPL 2022 match each in Navi Mumbai. Kohli, who has played against CSK in each IPL season, has scored 948 runs in 27 innings at an average and strike rate of 41.22 and 127.25 respectively. Kohli’s nine IPL half-centuries against CSK have seen him scoring a best of 90* (52) at the Dubai International Cricket Stadium during IPL 2020. Readers must note that Kohli had played a lone Champions League Twenty20 2010 match against CSK in Durban. Batting at No. 5, Kohli had scored 14 (12) back in the day. In the 11 overs that Kohli has bowled across seven innings against CSK, he has picked a solitary wicket at an average of 116 and an economy rate of 10.55. As a fielder, Kohli has grabbed 12 catches against this opposition. Two experienced campaigners in Kohli and Super Kings all-rounder Dwayne Bravo will be facing each other for the 16th time in T20s tonight. Happiness when you realise it’s only 2️⃣4️⃣ hrs to go for game time. 🤩😃 #PlayBold #WeAreChallengers #IPL2022 #Mission2022 #RCB #ನಮ್ಮRCB pic.twitter.com/ZnfYMZt4LJ — Royal Challengers Bangalore (@RCBTweets) April 11, 2022 Over the years, Kohli has scored 203 (128) with the help of 24 fours and four sixes against Bravo. In return, Bravo has dismissed Kohli on a couple of occasions in T20s. Talking precisely about the IPL, Kohli has scored 157 (103) with the help of 17 fours and four sixes against Bravo which involves one dismissal.","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"IPL 2022: Kane Williamson Stars As SunRisers Hyderabad Beat Gujarat Titans By Eight Wickets - NDTV Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMigwFodHRwczovL3Nwb3J0cy5uZHR2LmNvbS9pcGwtMjAyMi9pcGwtMjAyMi1rYW5lLXdpbGxpYW1zb24tc3RhcnMtYXMtc3VucmlzZXJzLWh5ZGVyYWJhZC1iZWF0LWd1amFyYXQtdGl0YW5zLWJ5LWVpZ2h0LXdpY2tldHMtMjg3OTg2M9IBiQFodHRwczovL3Nwb3J0cy5uZHR2LmNvbS9pcGwtMjAyMi9pcGwtMjAyMi1rYW5lLXdpbGxpYW1zb24tc3RhcnMtYXMtc3VucmlzZXJzLWh5ZGVyYWJhZC1iZWF0LWd1amFyYXQtdGl0YW5zLWJ5LWVpZ2h0LXdpY2tldHMtMjg3OTg2My9hbXAvMQ?oc=5","keywords":null,"creator":null,"video_url":null,"description":"IPL 2022: Kane Williamson Stars As SunRisers Hyderabad Beat Gujarat Titans By Eight Wickets  NDTV SportsLive match blog - Titans vs Sunrisers 21st Match 2022 - Cricket Insights  ESPNcricinfoSRH vs GT Highlights, IPL 2022: Sunrisers Hyderabad win by eight wickets  Hindustan TimesGulf News experts and fans analyse Sunrisers' eight-wicket win over Gujarat  Gulf NewsIPL 2022, SRH vs GT Highlights: Kane Williamson, Nicholas Pooran Star As SunRisers Hyderabad Register Eight-Wicket Win  NDTV SportsView Full coverage on Google News","content":null,"pubDate":"2022-04-11 18:24:00","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Bunbury’s Jayden Goodwin on Shield debut, watching WA win and Sam Whiteman’s influence on his young career","link":"https://thewest.com.au/news/south-western-times/bunburys-jayden-goodwin-on-shield-debut-watching-wa-win-and-sam-whitemans-influence-on-his-young-career-c-6376221","keywords":null,"creator":["Jackson Barrett"],"video_url":null,"description":"West Australian cricket’s son-of-a-gun Jayden Goodwin has made the sobering admission he didn’t play “to the best of my abilities” in his first two first-class games.","content":null,"pubDate":"2022-04-11 18:00:00","full_description":null,"image_url":"https://images.thewest.com.au/publication/C-6376221/e491e8dc734eb7bbde7faf662a281beac7733c05-16x9-x0y0w2048h1152.jpg","source_id":"thewest","country":["australia"],"category":["sports"],"language":"english"},{"title":"Sunrisers Hyderabad vs Gujarat Titans: IPL 2022 Live Cricket Score, Live Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/sunrisers-hyderabad-vs-gujarat-titans-live-score-over-match-21-t20-16-20-updates-2879703","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Sunrisers Hyderabad vs Gujarat Titans from Dr. DY Patil Sports Academy, Navi Mumbai. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-04-11 17:45:47","full_description":"A dedicated team of experts bring you live score, live cricket score, live match update on Sports.NDTV.com . After 19.1 overs, Sunrisers Hyderabad, chasing a target of 163, are 168/2. The live updates of Sunrisers Hyderabad vs Gujarat Titans scorecard is also available. It is the perfect platform to follow your favourite teams in Indian Premier League 2022. Keep a track on your favourite batsmen and bowlers through Indian Premier League 2022 today match, ball by ball commentary, Sunrisers Hyderabad vs Gujarat Titans, Sunrisers Hyderabad vs Gujarat Titans live score, Sunrisers Hyderabad vs Gujarat Titans scorecard. Follow the excitement of the Indian Premier League 2022 on Sports.NDTV.com as you can follow live match updates and live cricket score through our platform. The presentation ceremony... Nicholas Pooran is up for a quick chat. Pooran starts by thanking God and says that the batting group knew what they had to do and not repeat their mistakes from the past. Adds that the wicket was a bit two-paced and all they had to do was avoid making a stupid mistake. Mentions that the batting unit is improving on the whole which is a good sign. Adds that they need to work a bit on the dropped catches and overall the bowlers did well to restrict the opposition to around 160. Gujarat captain Hardik Pandya says that they were probably 10 runs short and that might have made a difference. Adds that they started off well with the ball but those two overs in the Powerplay cost them a bit. Mentions that the opposition bowled well at the death and stuck to their plans. Also says that the motto remains the same and they try to maintain a healthy and fun atmosphere in the camp and are looking forward to the next game. The bowling was slightly off for Gujarat! The likes of Lockie Ferguson and Darshan Nalkande were not quite up to the mark! More than the bowling though the fielding and the decision of not taking the review early on cost Gujarat. However, they were just outplayed by Hyderabad. They were just not up to the mark in this game. It was an extremely calculated chase! Hyderabad were very cautious for the first 4 overs but then runs flourished in the last two overs of the Powerplay. The openers yet again set the foundation as they added 64. Sharma fell but Williamson continued the good work. Tripathi supported him well before going off injured. It seemed like there would be a panic situation when Williamson got out but Markram and Pooran handled the pressure well and helped their side get over the line. Two in two for Hyderabad and Gujarat have suffered their first loss! A really good performance by Hyderabad, a complete performance one can say. The key was that they did not panic in crunch situations and that is what helped them get over the line. 19.1 overs (6 Runs) SIX! What a way to finish things off and Nicholas Pooran has done it for Hyderabad! Around middle and leg, Pooran launches it high and handsome, way, way over the square leg fence for a monster hit. Hyderabad win by 8 wickets! 18.6 overs (4 Runs) FOUR! Full and straight, Aiden Markram clears the front leg and absolutely drills it to the left of the long on fielder for a boundary. Scores are now level! 18.5 overs (1 Run) Short again, pulled down to deep backward square leg for a run. 18.4 overs (4 Runs) FOUR! Lucky boundary for Nicholas Pooran and this might just prove to be the blow that seals the game for Hyderabad. Banged in short, around the helmet and Pooran tries to take it on. The ball goes off the top edge and flies over the keeper's head for a boundary. 6 needed now off 8 balls. 18.3 overs (1 Run) Slower one, around off. Aiden Markram waits for it and slaps it towards the man at sweeper cover. Single taken. 18.2 overs (1 Run) Short again, on the body this time. Pooran looks to pull and manages to clear the man at backward square leg. One more. 18.1 overs (1 Run) Short of a length, over middle. Markram pulls it down to deep mid-wicket for a single. 17.6 overs (1 Run) Full and straight, driven down to long on for a single. 15 runs came off that over and Hyderabad now need 13 runs off 12 balls. 17.5 overs (2 Runs) Excellent running yet again and this is smart cricket from the two batters at the crease. On middle, worked towards mid-wicket for two more. 17.4 overs (1 Run) Around off, at 146 kph and pushed towards covers for a single. 17.3 overs (6 Runs) SIX! Easy as! Around the hips again, Nicholas Pooran just helps it on its way and the ball flies over the backward square leg fence for a maximum. 17 needed now off 15 balls. 17.3 overs (1 Run) WIDE! Down the leg side, Pooran misses the flick this time and a wide is called. Hyderabad inching closer now. 17.2 overs (4 Runs) FOUR! Easy pickings for Nicholas Pooran! At 145 clicks and on the pads. Pooran flicks it away off his hips and past the man at short fine leg for a boundary. 17.1 overs (0 Run) Was that put down? It seems like it. Spicy short ball from Lockie Ferguson at 140 clicks and Nicholas Pooran is taken by surprise. Pooran looks to hook but the ball pops up off the handle of the bat and just behind the bowler. Ferguson runs behind and tries to catch it over his shoulder but fails to hang on. 16.6 overs (1 Run) Over middle, turned through mid on for just a single this time. Hardik Pandya finishes off his spell with a wicket in his final over and now 28 runs are required off 18 balls. 16.5 overs (2 Runs) Excellent running! Nicholas Pooran calls for two right away and gets it with ease. Around leg stump, just nudged away into the huge gap at mid-wicket for a couple of runs. 16.4 overs (1 Run) Slower again, on a length and around off. Markram taps it towards point and sets off for a quick single. 16.3 overs (2 Runs) Around off, driven through covers for a couple of runs by Aiden Markram. 16.2 overs (0 Run) Around the top of off, Markram gets cramped a bit and keeps it out on the off side. 16.1 overs (0 Run) OUT! CAUGHT! Hardik Pandya gets rid of his opposite number and maybe, just maybe there's a twist in the tale. Hardik bowls it on a good length, outside off and it is the off-cutter. Kane Williamson who has seemed in control goes chasing after it and tries to thump it over the long on fence. The ball comes off the toe end of the bat and flies towards long on where Rahul Tewatia takes a simple catch. Williamson departs after a brilliant knock but Gujarat have the opening they needed. 34 needed off 23 balls. 15.6 overs (1 Run) Ferguson goes full and straight now at 144.1 kph. Kane Williamson pushes it down to long on for a single. 34 needed now off 24 balls. It's Hyderabad's game to lose from here. 15.5 overs (0 Run) Well bowled! Slower bumper, outside off and Williamson is beaten by the lack of pace. 15.4 overs (4 Runs) FOUR! Creamed! Full and wide, Williamson times it exquisitely through extra cover for a boundary. 15.4 overs (1 Run) WIDE! Ferguson almost bowled it perfectly but it's just a bit too high. Slower one, banged in and Williamson was comprehensively beaten Wide called though. 15.3 overs (6 Runs) SIX! What a way to bring up the fifty! Class from Kane Williamson and that is a top shot. Lockie Ferguson bows this one at almost 145 clicks and outside off. Williamson shuffles and scoops it over the keeper's head for a biggie. 15.2 overs (0 Run) Around the top of off, Williamson keeps it out. 15.1 overs (1 Run) Nicely bowled! Back of a length, it's a 135 kph off-cutter and Nicholas Pooran gets taken by surprise. The ball comes off the handle of the bat and falls safely around the vacant point region. Single taken.","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637853157380668571.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"“Umran Malik will play for India very soon”: Michael Vaughan urges BCCI to send SRH pacer to play England’s County Cricket after notable performance so far in IPL 2022","link":"https://thesportsrush.com/cricket-news-umran-malik-will-play-for-india-very-soon-michael-vaughan-urges-bcci-to-send-srh-pacer-to-play-englands-county-cricket-after-notable-performance-so-far-in-ipl-2022/","keywords":["Cricket","IPL 2022","Sunrisers Hyderabad","Indian Premier League","IPL","Michael vaughan","SRH","Umran Malik"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Michael Vaughan urges BCCI to send Umran Malik to play County Cricket as a preparation ahead of representing India in International Cricket. During the 21st match of the ongoing 15th season of the Indian Premier League between Sunrisers Hyderabad and Gujarat Titans at Dr DY Patil Stadium in Mumbai, the latter has set a target… The post “Umran Malik will play for India very soon”: Michael Vaughan urges BCCI to send SRH pacer to play England’s County Cricket after notable performance so far in IPL 2022 appeared first on The SportsRush.","content":"Michael Vaughan urges BCCI to send Umran Malik to play County Cricket as a preparation ahead of representing India in International Cricket. During the 21st match of the ongoing 15th season of the Indian Premier League between Sunrisers Hyderabad and Gujarat Titans at Dr DY Patil Stadium in Mumbai, the latter has set a target of 163 runs before Kane Williamson’s men. One of the talking points of the innings was GT skipper Hardik Pandya facing the Indian express pacer from Jammu and Kashmir, Umran Malik during the eighth Over of the innings. Right on the first delivery of the Over, Malik bowled a vicious bouncer at a pace of around 147 km/h, to smash Pandya’s ear-protector side of the helmet. The 28-year-old, however, quickly sent the physio back towards the dug out after the latter was seen scampering through to the centre of action upon the whacking blow. Pandya then humbled the 22-year-old pacer by smashing back-to-back crunching boundaries the next two deliveries. Ultimately, on the final delivery of the Over, Malik sent Matthew Wade back to the pavilion by trapping him right in front of the stumps, at a pacey delivery clicking 149.3 km/h. Michael Vaughan urges BCCI to send Umran Malik to play County Cricket Having impressed fans and experts with his ability to bowl consistently over the 145 km/h mark since the previous IPL season, Malik, in the ongoing match even bowled his fastest delivery at 153.3 km/h. Post perhaps witnessing the intense, raw pace at which Umran was operating, former England skipper Michael Vaughan took to his Twitter handle, to prophesize that the SRH fast bowler would play for the Indian Cricket team very soon. Vaughan, however, further opined that he been part of the BCCI, he would first send the 22-year-old to play some County Cricket as part of his preparation ahead of representing his country at the international stage. Umran Malik will play for India very soon … If I was the @BCCI I would be sending him to play some County cricket this summer to help him develop first though … #IPL2022 — Michael Vaughan (@MichaelVaughan) April 11, 2022 Umran Malik was surprisingly retained by the SRH management ahead of the ongoing season despite him having played mere three matches for them the previous season. In spite of having impressed one and all with his ability to bowl express pace, Malik has leaked runs at economy rate of 10.42 rpo, while averaging as high as 48.66 in the tournament so far. The post “Umran Malik will play for India very soon”: Michael Vaughan urges BCCI to send SRH pacer to play England’s County Cricket after notable performance so far in IPL 2022 appeared first on The SportsRush.","pubDate":"2022-04-11 17:44:17","full_description":"Michael Vaughan urges BCCI to send Umran Malik to play County Cricket as a preparation ahead of representing India in International Cricket. During the 21st match of the ongoing 15th season of the Indian Premier League between Sunrisers Hyderabad and Gujarat Titans at Dr DY Patil Stadium in Mumbai, the latter has set a target of 163 runs before Kane Williamson’s men. One of the talking points of the innings was GT skipper Hardik Pandya facing the Indian express pacer from Jammu and Kashmir, Umran Malik during the eighth Over of the innings. Right on the first delivery of the Over, Malik bowled a vicious bouncer at a pace of around 147 km/h, to smash Pandya’s ear-protector side of the helmet. The 28-year-old, however, quickly sent the physio back towards the dug out after the latter was seen scampering through to the centre of action upon the whacking blow. Pandya then humbled the 22-year-old pacer by smashing back-to-back crunching boundaries the next two deliveries. Ultimately, on the final delivery of the Over, Malik sent Matthew Wade back to the pavilion by trapping him right in front of the stumps, at a pacey delivery clicking 149.3 km/h. Having impressed fans and experts with his ability to bowl consistently over the 145 km/h mark since the previous IPL season, Malik, in the ongoing match even bowled his fastest delivery at 153.3 km/h. Post perhaps witnessing the intense, raw pace at which Umran was operating, former England skipper Michael Vaughan took to his Twitter handle, to prophesize that the SRH fast bowler would play for the Indian Cricket team very soon. Vaughan, however, further opined that had he been part of the BCCI, he would first send the 22-year-old to play some County Cricket as part of his preparation ahead of representing his country at the international stage. Umran Malik will play for India very soon … If I was the @BCCI I would be sending him to play some County cricket this summer to help him develop first though … #IPL2022 — Michael Vaughan (@MichaelVaughan) April 11, 2022 Umran Malik was surprisingly retained by the SRH management ahead of the ongoing season despite him having played mere three matches for them the previous year. In spite of having impressed one and all with his ability to bowl express pace, Malik has leaked runs at economy rate of 10.42 rpo, while averaging as high as 48.66 in the tournament so far.","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Retired hurt meaning in cricket: What happened to Rahul Tripathi? Will Rahul Tripathi play next match for SRH?","link":"https://thesportsrush.com/cricket-news-retired-hurt-meaning-in-cricket-what-happened-to-rahul-tripathi-will-rahul-tripathi-play-next-match-for-srh/","keywords":["Cricket","Gujarat Titans","IPL 2022","Sunrisers Hyderabad","GT","Indian Premier League","Rahul Tripathi","SRH"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Rahul Tripathi: The batter from Sunrisers Hyderabad had to walk off the ground midway his innings at the Dr DY Patil Sports Academy. During the 21st match of the ongoing 15th season of the Indian Premier League between Sunrisers Hyderabad and Gujarat Titans in Navi Mumbai, Sunrisers Hyderabad batter Rahul Tripathi retired hurt to walk… The post Retired hurt meaning in cricket: What happened to Rahul Tripathi? Will Rahul Tripathi play next match for SRH? appeared first on The SportsRush.","content":"Rahul Tripathi: The batter from Sunrisers Hyderabad had to walk off the ground midway his innings at the Dr DY Patil Sports Academy. During the 21st match of the ongoing 15th season of the Indian Premier League between Sunrisers Hyderabad and Gujarat Titans in Navi Mumbai, Sunrisers Hyderabad batter Rahul Tripathi retired hurt to walk off the ground. Unlike retired out (Ravichandran Ashwin vs Lucknow Super Giants last night), a batter who retires hurt is allowed to return to bat in the same innings upon the fall of a wicket. Batters retire hurt in cricket primarily after getting injured but the sport has seen the same happening due to other reasons as well. What happened to Rahul Tripathi today? As far as Tripathi is concerned, he first received medical treatment on his right half after the completion of the 12th over. Been dropped by Gujarat Titans fast bowler Mohammed Shami at third man in the 13th over, Tripathi accepted the reprieve gleefully by hitting a six off all-rounder Rahul Tewatia on the first delivery of the next over. In the process, however, Tripathi ended up hurting himself again. Another medical delay was converted into a strategic timeout, by the end of which, Sunrisers Hyderabad wicket-keeper batter Nicholas Pooran walked to bat as Tripathi’s replacement. NickyP walks into the middle, as Rahul walks off the field. #SRHvGT #OrangeArmy #ReadyToRise #TATAIPL — SunRisers Hyderabad (@SunRisers) April 11, 2022 Having scored 17 (11) with the help of a four and six before walking out, Tripathi was taken off the field due to a calf issue. With a lot of time having not passed by since the incident, there is no official information on the extent of Tripathi’s injury. Hence, it is difficult to assume if Tripathi will take part in their next match against Kolkata Knight Riders at the Brabourne Stadium on Friday or not. ALSO WATCH: Rahul Tripathi grabs stunning diving catch to dismiss Shubman Gill As far as Sunrisers chasing a 163-run target at the Dr DY Patil Sports Academy tonight, a thrilling finish awaits fans with 28 runs needed off the last three overs to win the match. The post Retired hurt meaning in cricket: What happened to Rahul Tripathi? Will Rahul Tripathi play next match for SRH? appeared first on The SportsRush.","pubDate":"2022-04-11 17:39:38","full_description":"Rahul Tripathi: The batter from Sunrisers Hyderabad had to walk off the ground midway his innings at the Dr DY Patil Sports Academy. During the 21st match of the ongoing 15th season of the Indian Premier League between Sunrisers Hyderabad and Gujarat Titans in Navi Mumbai, Sunrisers Hyderabad batter Rahul Tripathi retired hurt to walk off the ground. Unlike retired out (Ravichandran Ashwin vs Lucknow Super Giants last night), a batter who retires hurt is allowed to return to bat in the same innings upon the fall of a wicket. Batters retire hurt in cricket primarily after getting injured but the sport has seen the same happening due to other reasons as well. As far as Tripathi is concerned, he first received medical treatment on his right half after the completion of the 12th over. Been dropped by Gujarat Titans fast bowler Mohammed Shami at third man in the 13th over, Tripathi accepted the reprieve gleefully by hitting a six off all-rounder Rahul Tewatia on the first delivery of the next over. In the process, however, Tripathi ended up hurting himself again. Another medical delay was converted into a strategic timeout, by the end of which, Sunrisers Hyderabad wicket-keeper batter Nicholas Pooran walked to bat as Tripathi’s replacement. 😔 NickyP walks into the middle, as Rahul walks off the field. #SRHvGT #OrangeArmy #ReadyToRise #TATAIPL — SunRisers Hyderabad (@SunRisers) April 11, 2022 Having scored 17 (11) with the help of a four and six before walking out, Tripathi was taken off the field due to a calf issue. With a lot of time having not passed by since the incident, there is no official information on the extent of Tripathi’s injury. Hence, it is difficult to assume if Tripathi will take part in their next match against Kolkata Knight Riders at the Brabourne Stadium on Friday or not. ALSO WATCH: Rahul Tripathi grabs stunning diving catch to dismiss Shubman Gill As far as Sunrisers chasing a 163-run target at the Dr DY Patil Sports Academy tonight, a thrilling finish awaits fans with 28 runs needed off the last three overs to win the match.","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Sunrisers Hyderabad vs Gujarat Titans: IPL 2022 Live Cricket Score, Live Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/sunrisers-hyderabad-vs-gujarat-titans-live-score-over-match-21-t20-11-15-updates-2879613","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Sunrisers Hyderabad vs Gujarat Titans from Dr. DY Patil Sports Academy, Navi Mumbai. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-04-11 17:05:57","full_description":"A dedicated team of experts bring you live score, live cricket score, live match update on Sports.NDTV.com . After 15.1 overs, Sunrisers Hyderabad, chasing a target of 163, are 117/1. The live updates of Sunrisers Hyderabad vs Gujarat Titans scorecard is also available. It is the perfect platform to follow your favourite teams in Indian Premier League 2022. Keep a track on your favourite batsmen and bowlers through Indian Premier League 2022 today match, ball by ball commentary, Sunrisers Hyderabad vs Gujarat Titans, Sunrisers Hyderabad vs Gujarat Titans live score, Sunrisers Hyderabad vs Gujarat Titans scorecard. Follow the excitement of the Indian Premier League 2022 on Sports.NDTV.com as you can follow live match updates and live cricket score through our platform. 14.6 overs (1 Run) Leg bye. 14.5 overs (1 Run) Fuller and on off, this is worked through mid-wicket for one. Just the one ball to go in this over, can Rashid get a breakthrough? 14.4 overs (1 Run) Two more! On off, the googly, Pooran guides it to point for one. 14.3 overs (2 Runs) Two more! Yet again this is tossed up on middle, it is mistimed completely down to long on. Two again. 14.2 overs (2 Runs) This lands short! Lucky escape! The leg break, it lands on middle, Pooran looks to go downtown, it goes off the inner half towards wide long on. They go for two, Pooran has to rush. The throw goes to the keeper but it is a long way away from the stumps. A little straighter and would have been close. 14.1 overs (1 Run) On middle, this is worked through square leg for one. Rashid Khan (3-0-21-1) comes back in to finish his spell. 13.6 overs (1 Run) Yes, he does! Just the one! On middle, this is pushed down to long on for one. 13.5 overs (1 Run) Flatter and outside off, Pooran looks to cut but gets an underedge on the off side, a single. Can he now close out the over? He has come back well after that biggie 13.4 overs (1 Run) Just the one! Angles it into the batter, it is hit down to long on for one. 13.3 overs (1 Run) Just the one! This was there to be hit! Shorter and outside off, Pooran carves it out towards deep cover for one. 13.2 overs (0 Run) A dot! Need more! Shorter and outside off, this is slapped but to covers. Oh no! This seems bad. Rahul Tripathi seems to be in agonizing pain and is flat on the ground. The physio is out again and Tripathi is receiving some more treatment. The umpires take this opportunity to call for the Drinks break as well. Hyderabad seem to be on top of proceedings here and with just one wicket lost, they can now start to go hard at the bowling as well. Kane Williamson along with Rahul Tripathi has done a stellar job and Gujarat are desperate for a wicket here. Can they get it before it's too late? 59 needed in 41 balls. Tripathi is in conversation with Brian Lara and he is off! Nicholas Pooran comes in and sadly Tripathi has to walk back to the pavilion as they don't want to risk a worse injury. 13.1 overs (6 Runs) SIX! The ball sails over the fence but Rahul Tripathi is down on the ground! Lovely shot but Rahul has probably cramped up! Tossed up on off, this is lofted over the cover fence for a biggie. Just the 59 needed now. Hyderabad's game from here. Rahul Tewatia to have a bowl now. 12.6 overs (1 Run) This lands short! Outside off, Rahul rocks back, upper cuts it, it flies towards third man. The fielder holds back and takes it on the bounce. A single. 12.5 overs (1 Run) Just the one! On middle, this is worked through square leg for one. 12.4 overs (2 Runs) Two more! Sensational batting! On middle, Williamson walks across and works it through mid-wicket for two. 12.3 overs (6 Runs) SIX! That is nailed! That went a long way. Colossal hit! On middle, Williamson pulls it high and over the square leg fence for a biggie. 12.2 overs (6 Runs) SIX! Over the fence! Luck favoring Hyderabad at the moment! Williamson steps out and this is bowled short. It is pulled over the keeper's head and carries all the way. 12.1 overs (0 Run) Dots is what will build pressure! On middle, length. Williamson swings but gets an inside edge onto the pads. Rahul Tripathi seems to be struggling with cramps or a muscle issue. The area behind the knee is the one in question and the physio is out to have a look. Tripathi is getting that area strapped and after a short delay, all seems to be fine. Hardik Pandya (2-0-5-0) brings himself back into the attack as well. 11.6 overs (1 Run) Just the single again and the run rate needed has gone over 10! On middle, this is pushed down to long on for one. 11.5 overs (1 Run) Just another single! Flatter and on off, Rahul guides it towards short third man for one. 11.4 overs (1 Run) Rashid is being played cautiously! On middle, this is pushed down to long on for one. 11.3 overs (0 Run) One more dot! On middle, this is worked to mid-wicket. 11.2 overs (1 Run) Lot of turn there! It lands outside off and spins back in, this is worked through square leg for one. 11.1 overs (0 Run) Leading edge! Rahul did not pick that! It is a leg spinner, it lands on middle, Rahul looks to work it on the leg as he feels it is googly, it goes off a soft leading edge on the off side. 10.6 overs (0 Run) That is a really good over from Ferguson! The ball to swung back in there. It starts on off and tails back in. Williamson looks to flick but misses to get hit on the pads. He takes off for a run but is sent back in time. 10.5 overs (1 Run) Another single! Fuller and on middle, this is eased down to long on for one. 10.4 overs (1 Run) Was that a chance? That wobbled though! Not easy. On a length and around off, this lands and moves away. Williamson is beaten as he tries to defend. The ball was angling in but then moves away in the end. Goes between the gloves of Wade and hits him on the chest. He is in a little pain and the batters take one in the end. A bye. Good awarnesss from Rahul. 10.3 overs (0 Run) Another dot! On a length and around off, defended. 10.2 overs (1 Run) Impact was just outside off! Not sure what Rahul was trying to play! He walks across completely and Ferguson goes full and around off. Rahul looks to play the paddle scoop but misses and gets hit on the boot. Half an appeal but turned down. It goes on the leg side. A leg bye taken. 10.1 overs (0 Run) Extra bounce! Length and on off, this one takes off after landing. Rahul guides it to point by taking one hand off the handle.","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637853133486082401.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Sunrisers Hyderabad vs Gujarat Titans: IPL 2022 Live Cricket Score, Live Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/sunrisers-hyderabad-vs-gujarat-titans-live-score-over-match-21-t20-6-10-updates-2879524","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Sunrisers Hyderabad vs Gujarat Titans from Dr. DY Patil Sports Academy, Navi Mumbai. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-04-11 16:49:37","full_description":"A dedicated team of experts bring you live score, live cricket score, live match update on Sports.NDTV.com . After 10.1 overs, Sunrisers Hyderabad, chasing a target of 163, are 75/1. The live updates of Sunrisers Hyderabad vs Gujarat Titans scorecard is also available. It is the perfect platform to follow your favourite teams in Indian Premier League 2022. Keep a track on your favourite batsmen and bowlers through Indian Premier League 2022 today match, ball by ball commentary, Sunrisers Hyderabad vs Gujarat Titans, Sunrisers Hyderabad vs Gujarat Titans live score, Sunrisers Hyderabad vs Gujarat Titans scorecard. Follow the excitement of the Indian Premier League 2022 on Sports.NDTV.com as you can follow live match updates and live cricket score through our platform. 9.6 overs (0 Run) A dot to end the over and Hyderabad are 75/1 at the halfway stage. Back of a length, on off. Kane Williamson dabs it down towards point but is unable to scamper through for a run. 88 needed now off 60 balls. 9.5 overs (1 Run) On the pads, turned 'round the corner for a run. 9.4 overs (4 Runs) FOUR! Pitched up, not quite a half-volley and outside off. Tripathi transfers his weight onto the front foot and drives it on the up, through extra cover for a boundary. 9.4 overs (1 Run) WIDE! Effort ball from Darshan Nalkande but it is just a bit too high. Wide signalled. 9.3 overs (1 Run) Short ball, this is pulled away along the ground to the man at the backward square leg fence for just a single. 9.2 overs (2 Runs) This is good batting from Hyderabad as they have been able to pick up doubles consistently. Length, on off and this is hit on the up, well in front of square on the off side for a brace. 9.1 overs (0 Run) Right on the money! Good-length, close to the off pole. Williamson hops and keeps it down towards point. 8.6 overs (2 Runs) Rahul Tripathi is off the mark with a cheeky shot. On middle, Tripathi gets inside the line of the ball and paddles it fine. The man at fine leg runs to his right and keeps it down to a couple. 8.5 overs (0 Run) OUT! TAKEN! The partnership is finally broken and it is the ever-dependable Rashid Khan who has done it. This is dragged down on leg stump and is there to be hit. Abhishek Sharma rocks back and tries to lift it over the mid-wicket fence but just doesn't get a decent connection. The ball hardly carries to the man at the fence and Sai Sudharsan takes a good low catch over there. Can Gujarat now tighten the screws on the scoring rate? Also, Rahul Tripathi comes in at number 3. 8.4 overs (1 Run) On middle, defended off the front foot towards covers and a quick single is stolen. 8.3 overs (1 Run) A tad bit short, around leg. Sharma goes on the back foot and tuck sit through mid-wicket for a run. 8.2 overs (4 Runs) FOUR! Catch is the call but it's well over. This is angled across the left-hander and Abhishek Sharma deliberately plays it in the air. The ball goes off the edge a bit but clears the man at backward point and runs away into the fence. 8.1 overs (0 Run) Pitching outside leg perhaps. Skiddish delivery, around leg and Sharma misses the flick. He gets hit on the pads and Rashid Khan seems interested but the appeal is turned down. 7.6 overs (2 Runs) Nicely guided! Bit of width on offer and Kane Williamson dabs it past point for two more. 7.5 overs (0 Run) Abhishek Sharma seems just a bit too eager to get back on strike here. This is angled into middle and leg, Williamson can't get it away leg side. 7.4 overs (1 Run) Good bowling! A touch fuller, on middle and nipping in a touch off the surface. Sharma is late on the shot and just about manages to get a bat on it. The batters scamper through for one as the ball rolls onto the off side. 7.3 overs (0 Run) Length this time, wide of the off stump. Sharma has a swing at it but doesn't connect. 7.2 overs (2 Runs) Brilliant stop in the deep by Sai Sudharsan! Short and wide again, Abhishek Sharma hangs back and throws his hands at it. The ball seems to be heading towards the cover fence but Sai covers the ground well to his left and saves a couple of runs for his team. 7.1 overs (2 Runs) Short and wide, slapped away behind square on the off side by Sharma. The call is for two and they get it with ease. 6.6 overs (0 Run) It's the googly this time from Khan and Williamson watchfully keeps it out. 6.5 overs (1 Run) On the pads and this is toe-ended towards mid-wicket for one more. 6.4 overs (2 Runs) Nicely done! Around middle, worked through mid-wicket for a couple of runs. The 50 is also up for Hyderabad. 6.3 overs (4 Runs) FOUR! 'Catch. catch' is the shout from Matthew Wade but it's in the gap. Fuller and around off, Sharma lofts it in front of square on the off side and picks up another lovely boundary. 6.2 overs (1 Run) Flatter this time, on middle. Kane Williamson nudges it through mid on and calls for just a single, which they get with ease. 6.1 overs (1 Run) Rashid Khan starts off with a quicker delivery on the pads. Sharma turns it behind square on the leg side for a single. DRINKS! The last two overs of the Powerplay have got Hyderabad back into the game but not the tricky period starts! The fielders will be spreaded out and it will be interesting to see how the game goes along from here. Can Hyderabad continue the momentum? Gujarat will try and break this stand. Can they do so? 5.6 overs (1 Run) A single to end the over and 17 runs come off it. Around off, bunted out on the off side for a quick single by Sharma. At the end of the Powerplay, Hyderabad are 42/0! 5.5 overs (4 Runs) FOUR! Cheeky from Abhishek Sharma and Lockie Ferguson seems out of sorts at the moment. Pacy delivery, short of a length and cramping the batter. Sharma hangs back and just nudges it fine, past short third man for a boundary. 5.4 overs (0 Run) This is angled down leg and Abhishek Sharma flicks it straight to the man at short fine leg. A few inches on either side and that would have been a boundary as well. 5.3 overs (4 Runs) FOUR! Make that three in a row! Outside off and on a length, Sharma waits and then guides it past point. Another boundary. It is just the placement. Lovely stroke. 5.2 overs (4 Runs) FOUR! Nicely guided and the outfield is just lightning quick. All the pressure built up in the first four overs seems to be released now. Length, outside off and just timed through covers for a boundary by Sharma. 5.1 overs (4 Runs) FOUR! Abhishek Sharma greets Lockie Ferguson with a boundary. Full and wide, at 143.1 kph and Sharma thumps it over cover-point for a boundary.","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637853123688390343.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Sunrisers Hyderabad vs Gujarat Titans Live Score Ball by Ball, IPL 2022 Live Cricket Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/sunrisers-hyderabad-vs-gujarat-titans-live-score-over-match-21-t20-1-5-updates-2879414","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Sunrisers Hyderabad vs Gujarat Titans from Dr. DY Patil Sports Academy, Navi Mumbai. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-04-11 16:23:54","full_description":"Follow the Indian Premier League 2022 live cricket score on Sports.NDTV.com . After 5.2 overs, Sunrisers Hyderabad, chasing a target of 163, are 33/0. Get live score, ball by ball commentary and much more. Keep track of Indian Premier League 2022 today match between Sunrisers Hyderabad and Gujarat Titans. Everything related to Sunrisers Hyderabad and Gujarat Titans match will be available on Sports.NDTV.com . Stay updated with Sunrisers Hyderabad vs Gujarat Titans live score. Do check for Sunrisers Hyderabad vs Gujarat Titans scorecard. You can get scorecard updates, match related facts. Get quick live updates with ads, Sports.NDTV.com , which is the perfect destination for live cricket score. 4.6 overs (1 Run) A single to end! So a good comeback from Shami after going for 10 from the first two balls! Shorter and on off, this is pushed to cover for one. 4.5 overs (2 Runs) Not timed that well! Two! Angled into the pads, Sharma whips it over mid-wicket and takes two. 4.4 overs (0 Run) That is a beauty! Stunning! Length and on middle, this lands and moves away. Sharma is beaten all ends up as he tries to block. 4.3 overs (1 Run) Angled into the pads, Williamson works it through square leg for one. They did think about two but opt against it. 4.2 overs (6 Runs) SIX! BANG! That is nailed! What a hit that is! Short and on the body, Williamson swivels and pulls it hard, it sails over the square leg fence for a biggie. 10 from the first two balls. Shami under pressure. 4.1 overs (4 Runs) FOUR! Will that break the shackles? A welcome, welcome boundary! Short and on middle, Williamson pulls it through mid-wicket, no one there and it races away. A boundary to begin the over, can they make it into a big one now? 3.6 overs (1 Run) Outstanding fielding! Length and on off, Williamson hits it on the up, Miller dives to his right and saves at least two more. Such things just keep the pressure on. Another excellent over. Run rate needed is already above 9, almost nearing 10. 3.5 overs (1 Run) No fielder there! Shorter and on middle, Sharma looks to pull, it hits the splice and lobs on the leg side. A run taken. 3.4 overs (1 Run) Sharp bowling and sharp fielding! The single is not stopped though! Sees Williamson come down the track and Hardik bowls it short and on the body, Williamson pushes it towards point and calls for one. The fielder gets to the ball and hits the stumps at the bowler's end but Williamson is well in. 3.3 overs (0 Run) Does not find the gap! Shorter and on off, Williamson guides it to point. 3.2 overs (1 Run) Really well bowled again! Tucking Abhishek Sharma for room by attacking the body. This is worked towards mid-wicket for one. 3.1 overs (0 Run) Really good stuff from Gujarat! They are squeezing. The fielders are onto the ball in a flash and they are closing in on the batter! On a length and around off, this is pushed to covers. 2.6 overs (1 Run) He does! Bowls it closer to the batter, cramps him for room. Sharma guides it down to third man for one. Just the two from the over. One gets the feeling that Hyderabad have to step on the gas now. 2.5 overs (0 Run) Just the single from the over so far! On middle, this is kept out. Can Shami end it well? 2.4 overs (0 Run) Finds the fielder yet again! Shorter and outside off, Sharma waits and then guides it to point. Something has to give now. Far too many dots. 2.3 overs (0 Run) Yet another dot! Pressure building here! Shorter and outside off, Sharma waits and then guides it to point. 2.2 overs (0 Run) Shami probably got away with one there! This is short and it bounces well over. Sharma leaves it alone. 2.1 overs (1 Run) Angled into the pads, this is worked through square leg for one. 1.6 overs (0 Run) On middle, Sharma defends. A dot to end a tidy over from Hardik. 1.5 overs (1 Run) Drop and run! On off, Williamson drops it on the off side and takes one. 1.4 overs (0 Run) Good Test match bowling from Hardik! Starts on the 5th stump channel and then moves it away. Left alone. 1.3 overs (0 Run) Really good stuff from Hardik! On a length and around off, Williamson blocks it out. 1.2 overs (0 Run) Angled into the pads, Williamson works it to mid-wicket. 1.1 overs (0 Run) Some swing again, really nice shape, fuller and outside off. Left alone well. The skipper, Hardik Pandya to start from the opposite end. 0.6 over (0 Run) Back of a length and on off, Sharma guides it to point. 4 from the first over then. 0.5 over (1 Run) Angled into the pads, Williamson works it through mid-wicket for one. 0.4 over (0 Run) If he did not hit it, it is close is what Wade says and that looked very close! There were two noises but it was nowhere near the bat. Maybe a little high! Length and on off, this lands and comes back in. Williamson looks to defend but misses to get hit above the flap. An appeal but turned down. The replay shows that the ball was hitting the top of off and hitting enough to get the on-field decision overturned. 0.3 over (0 Run) That is a lovely delivery! This starts around off and then shapes away wonderfully. Left alone. 0.2 over (2 Runs) Williamson is off the mark too! On the pads, Williamson clips it through square leg for a couple. 0.1 over (1 Run) Almost a wicket! In the end, a single and Hyderabad along with Sharma get underway! Fuller and outside off, Sharma looks to drive, it hits the inside edge and goes on the leg side for one.","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637853108257621920.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Sunrisers Hyderabad vs Gujarat Titans Live Score Ball by Ball, IPL 2022 Live Cricket Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/sunrisers-hyderabad-vs-gujarat-titans-live-score-over-match-21-t20-16-20-updates-2879236","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Sunrisers Hyderabad vs Gujarat Titans from Dr. DY Patil Sports Academy, Navi Mumbai. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-04-11 15:36:06","full_description":"A dedicated team of experts bring you live score, live cricket score, live match update on Sports.NDTV.com . After 20.0 overs, Gujarat Titans are 162/7. The live updates of Sunrisers Hyderabad vs Gujarat Titans scorecard is also available. It is the perfect platform to follow your favourite teams in Indian Premier League 2022. Keep a track on your favourite batsmen and bowlers through Indian Premier League 2022 today match, ball by ball commentary, Sunrisers Hyderabad vs Gujarat Titans, Sunrisers Hyderabad vs Gujarat Titans live score, Sunrisers Hyderabad vs Gujarat Titans scorecard. Follow the excitement of the Indian Premier League 2022 on Sports.NDTV.com as you can follow live match updates and live cricket score through our platform. ... The Run Chase ... Now, the question is, is there dew? We do not know as of now but that could be an important factor. The wicket is gripping a touch but if dew does come in, it is going to become belter to bat on. The Powerplay is going to be important. Stay tuned for the second half. Abhinav Manohar is down for a chat. Manohar says that the stars aligned for him tonight as he got three chances, something that won't again and again. Adds that they tried to play till the 17th over and then go after the bowling. Informs that Hardik was set and hence he himself went after the bowling. Mentions that the pitch is good but they have a good pace attack and it all depends on the Powerplay. Gujarat's innings just never got going. They could not string long partnerships and hence, the acceleration came late. Hardik Pandya played responsibly, he batted till the end and the others played around him. Pandya though could not give his side the finish they would have wanted but they do have a good score on the board. Gujarat got off to a flier, thanks to a lot of extras from the Hyderabad bowlers. However, they came back strongly post the 2nd over as they got two wickets in the Powerplay. The good work continued as they did not allow Gujarat to score freely and got timely wickets. That was the story of this innings, whenever Gujarat tried to accelerate, Hyderabad managed to get wickets at regular intervals. Marco Jansen and Washington Sundar kept it tidy and Bhuvneshwar Kumar and T Natarajan were also good. Umran Malik was slightly expensive but he was also unlucky. Have to say, the game is quite even at the moment! 162 is a fighting total and with the bowling Gujarat have, they will back themselves to defend this. Hyderabad on the other hand, have come off chasing a similar score in their last game so they too will be confident. 19.6 overs (0 Run) OUT! TIMBER! Cleaned up! T Natarajan gets the yorker in this time and its right at the base of the leg stump. Rashid Khan tries to get inside the line of the ball and paddle it fine but is beaten for pace. The ball crashes into the leg stump and Gujarat end with 162/7! 19.5 overs (1 Run) A yorker on the toes and Hardik Pandya just about gets his bat on it. He scampers through for one and brings up his fifty. Another brilliant innings from the Gujarat skipper. 19.4 overs (0 Run) OUT! RUN OUT! Rahul Tewatia sacrifices himself for the skipper and good awareness shown by T Natarajan here. Back of a length, around off and Tewatia gets taken aback as he swings and misses. Hardik Pandya calls him for the bye but Tewatia is a bit slow to get out of the blocks. Nicholas Pooran does well to underarm the ball towards the bowler and Natarajan hits the stumps from a few yards out as Tewatia is not even in the frame. Rashid Khan is the new batter. 19.3 overs (4 Runs) FOUR! Swung away! T Natarajan serves a juicy full toss on middle and Rahul Tewatia obliges as he swats it behind square on the leg side for a boundary. 19.2 overs (1 Run) Full again, angled across off and Hardik Pandya attempts the cheeky paddle past short fine leg but doesn't get a good connection. Just a single taken. 19.1 overs (1 Run) Very full, on off and this is squeezed out on the off side for a single. 18.6 overs (1 Run) Short and wide, Tewatia slashes at it and gets it towards deep backward point for one. 18.5 overs (0 Run) OUT! TAKEN! Rahul Tripathi makes amends as he takes a ripper of a catch and finally, Abhinav Manohar runs out of luck. Slower ball, bowled wide of the off stump. Manohar stays leg side and throws the kitchen sink at it. One hand comes off the handle and the ball is skied straight over the bowler's head. Tripathi runs around from long off and dives to his right to take a brilliant catch and Bhuvi has his man. Rahul Tewatia is the new man in. 18.4 overs (2 Runs) Abhinav Manohar has luck on his side tonight! Short of a length, outside off. Manohar looks to drag the pull shot but ends up getting a top edge. The ball is skied around the vacant square leg region and three fielders converge towards it but Bhuvneshwar Kumar goes for it and ends up missing it completely. Two taken. 18.3 overs (1 Run) Full and tailing into leg stump. Hardik whips it towards deep square leg for a single. 18.3 overs (1 Run) WIDE! Attempted slower bounce, a bit too high. Wided. 18.2 overs (1 Run) DROPPED! Another chance goes abegging! Slower one from Bhuvi, wide of off stump. Manohar lifts it high and around the long off fence. Rahul Tripathi over there settles under it quickly but ends up spilling it as well. Single taken and Hyderabad are just letting Manohar off the hook. 18.1 overs (1 Run) Leg bye! Half an appeal from the bowler but nothing given. Full and swinging into the pads. Pandya misses the flick and gets hit on the pads. They get a leg bye. 17.6 overs (4 Runs) FOUR! Abhinav Manohar is playing a game-changing innings here. Full and outside off. Manohar manages to get under it and thump it over extra cover for another boundary. 17.5 overs (0 Run) Good comeback from T Natarajan! This is pushed wider and Manohar misses it completely. 17.4 overs (6 Runs) SIX! Catch dropped and now Abhinav Manohar is just adding insult to injury. Natarajan misses the yorker on leg stump and serves a full toss. Manohar launches it high and handsome over the cow corner fence for a biggie. 17.3 overs (1 Run) On off, Hardik gets an inside edge onto the pads and the ball goes nowhere. The batters though scamper through for one. 17.2 overs (1 Run) DROPPED! Aiden Markram has dropped a sitter! A low full toss from T Natarajan around off. Abhinav Manohar makes room leg side and hence has to reach for it a bit. Manohar ends up lifting it over mid off and Markram comes in from the long on fence but ends up spilling it. 17.1 overs (1 Run) Just short! Full, on leg stump. Hardik Pandya tries to club it but gets it off the bottom of the bat and on the bounce to the man at long on. Single taken. 16.6 overs (1 Run) Length ball, outside off. This is played towards deep cover for a single. 16.5 overs (2 Runs) Excellent running! Early call for two from Hardik and they get it with ease. Short of a length, at the body and this is wristed away through mid-wicket for a couple of runs. 16.4 overs (1 Run) Slower again, on off. Manohar opens the face of the bat and works it towards short third man for one. 16.3 overs (0 Run) Slower one, full and outside off. This is driven straight to the man at extra cover. 16.2 overs (4 Runs) FOUR! Abhinav Manohar is taking on the attack now and he is riding his luck as well. Short ball on middle, Manohar swings hard at it but gets it off the top edge and into the fine leg fence. 16.1 overs (1 Run) Good-length, on off. Pandya drives it towards wide long on for a single. 15.6 overs (4 Runs) FOUR! Boundary to end the over and Jansen will not be happy with that. Length again but there's width on offer. Abhinav Manohar backs away and carves it behind point for a boundary. 15.5 overs (1 Run) This is pitched up, around off. Hardik drives it through mid off for a run. 15.4 overs (1 Run) Around the top of off, bunted out on the off side for a quick single. 15.3 overs (0 Run) Jansen angles it full and wide, across the right-hander. Manohar goes chasing and only manages to toe-end it towards cover. 15.3 overs (1 Run) WIDE! Attempted bumper but goes well over the batter's head. Wide called. 15.2 overs (0 Run) Jansen bowls it on a shorter length this time, on middle. Manohar keeps it down towards backward point. 15.1 overs (1 Run) On a hard length, over off stump. Hardik hangs deep in his crease and squeezes it out to the cover region for a single.","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637853079582308258.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Chennai Super Kings vs Royal Challengers Bangalore Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update- Tata IPL 2022 - Cricket Addictor","link":"https://news.google.com/__i/rss/rd/articles/CBMiyAFodHRwczovL2NyaWNrZXRhZGRpY3Rvci5jb20vZmFudGFzeS1jcmlja2V0L2NoZW5uYWktc3VwZXIta2luZ3MtdnMtcm95YWwtY2hhbGxlbmdlcnMtYmFuZ2Fsb3JlLWRyZWFtMTEtcHJlZGljdGlvbi1mYW50YXN5LWNyaWNrZXQtdGlwcy1kcmVhbTExLXRlYW0tcGxheWluZy14aS1waXRjaC1yZXBvcnQtaW5qdXJ5LXVwZGF0ZS10YXRhLWlwbC0yMDIyL9IBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Chennai Super Kings vs Royal Challengers Bangalore Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update- Tata IPL 2022  Cricket AddictorFantasy Pick: Make Kohli the vice-captain  ESPNcricinfoIPL 2022: Match 22, CSK vs RCB Match Prediction – Who will win today’s IPL match between CSK and RCB?  CricTrackerCSK vs RCB Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update- Tata IPL 2022  Cricket AddictorMatch Preview - Super Kings vs RCB, Indian Premier League 2022, 22nd Match  ESPNcricinfoView Full coverage on Google News","content":null,"pubDate":"2022-04-11 15:31:36","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Sunrisers Hyderabad vs Gujarat Titans Live Score Ball by Ball, IPL 2022 Live Cricket Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/sunrisers-hyderabad-vs-gujarat-titans-live-score-over-match-21-t20-11-15-updates-2879126","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Sunrisers Hyderabad vs Gujarat Titans from Dr. DY Patil Sports Academy, Navi Mumbai. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-04-11 15:04:05","full_description":"Follow the Indian Premier League 2022 live cricket score on Sports.NDTV.com . After 15.2 overs, Gujarat Titans are 119/4. Get live score, ball by ball commentary and much more. Keep track of Indian Premier League 2022 today match between Sunrisers Hyderabad and Gujarat Titans. Everything related to Sunrisers Hyderabad and Gujarat Titans match will be available on Sports.NDTV.com . Stay updated with Sunrisers Hyderabad vs Gujarat Titans live score. Do check for Sunrisers Hyderabad vs Gujarat Titans scorecard. You can get scorecard updates, match related facts. Get quick live updates with ads, Sports.NDTV.com , which is the perfect destination for live cricket score. 14.6 overs (1 Run) A single to end! Umran Malik goes 39 in his 4. An expensive spell for him! Shorter and on middle, this is worked towards mid-wicket for one. 14.5 overs (1 Run) Takes one! Outside off, this is guided down to third man for one. 14.4 overs (0 Run) A dot now! On off, Abhinav Manohar guides it to point. 14.3 overs (4 Runs) FOUR! And again! This is frustrating for Malik and Williamson! That flew between the keeper and the first slip fielder! Shorter and on off, Abhinav Manohar backs away and pokes at it, it goes off the outside edge between the two and into the fence. Two boundaries in a row. 14.2 overs (4 Runs) FOUR! That is the problem with pace! The edges just fly away! Short and outside off, Abhinav Manohar slashes at it, it goes off the outside edge over first slip and down to the third man fence. 14.1 overs (0 Run) That is well bowled! Full and on middle, Abhinav Manohar jams it back to the bowler. 13.6 overs (1 Run) A single to end then! Outside off, Manohar guides it down to third man and takes one. 13.5 overs (1 Run) Another good short one, gets big on Pandya, he mistimes the pull through mid-wicket for one. Jansen using his height well. 13.5 overs (1 Run) Looks to go full, maybe catch Pandya by surprise. It is down the leg side though and it is wided. 13.4 overs (1 Run) Short and on the body, Abhinav Manohar pulls it down to fine leg and takes one. He is off the mark. Abhinav Manohar is the next batter in. 13.3 overs (0 Run) OUT! TAKEN! Marco Jansen gets his countryman! That is a vital wicket at this stage! Gujarat would have been expecting Miller to give them a good finish but he falls! Well bowled by Jansen, he has a knack of taking big wickets. Dhoni in the last game and now Miller! David steps down the track and that is spot. Jansen bowls it short and on the body. Miller pulls it hard but towards mid-wicket. Abhishek Sharma who dropped one earlier, takes a really good catch diving to his left. Can Hyderabad keep Gujarat under 170 now? 13.2 overs (1 Run) Just the one! On middle, this is worked down to long on for one. 13.1 overs (1 Run) A good stop in the end! Shorter and outside off, Miller slashes at it, it goes off the outside edge down towards third man. Umran Malik runs to his right and pushes it back in. Saves three for his side. Good work eventually. Marco Jansen (2-0-13-0) is back on. 12.6 overs (1 Run) A single to end a really good over for Gujarat! Shorter and on off, Miller guides it down to third man and takes one. The platform is set now for the two to launch. 12.5 overs (1 Run) A full toss now on middle, this is worked down to long on for one. Sensible batting. 12.4 overs (2 Runs) Shorter and outside off, Pandya pushes it wide of the sweeper cover fielder for two. 12.3 overs (4 Runs) FOUR! Whipped away! 9 from the last two balls and all the pressure that was built has been given away! A full one and on middle, this is whipped wide of mid on and into the fence. 12.3 overs (5 Runs) FIVE WIDES! That is not what Hyderabad would have wanted! That has released all the pressure that was building! A short one on middle, this one takes off after landing. Pandya bails out of the pull, it goes over Pooran and into the fence. 12.2 overs (0 Run) Dots are building up here! Something has to give! ON middle, this is worked to mid on. A wicket or a big shot is on its way. 12.1 overs (0 Run) Good length and on off, this is pushed to covers. 11.6 overs (1 Run) Dealing in singles at the moment! On middle, this is played towards cover for one. 11.5 overs (1 Run) Another single as Miller guides it towards point. 11.4 overs (1 Run) Another run! On off, Pandya guides it through point for one. 11.3 overs (1 Run) On middle, this is worked through square leg for one. 11.3 overs (1 Run) WIDE! A little too short, good pace. Miller lets it go. Wided. 11.2 overs (0 Run) Another dot! On off, defended. 11.1 overs (0 Run) Good length and on off, Miller defends it onto the ground. T Natarajan (1-0-9-1) comes back in to replace Umran Malik. 10.6 overs (1 Run) On middle, Miller works it through mid-wicket and gets to the other end. Sundar continues to keep it tight. 10.5 overs (1 Run) Another single! Outside off, Pandya looks to cut, this one holds in the surface a touch, it goes down to long off for one. 10.4 overs (0 Run) Extra bounce! On middle, this one lands and takes off. Pandya works it to mid-wicket. 10.3 overs (1 Run) Well bowled! This lands on off, turns away a little. Miller pushes at it, it goes off the outer half towards point for one. 10.2 overs (1 Run) On middle, Pandya pushes it down to long on and gets to the other end. 10.1 overs (0 Run) On the pads, Pandya looks to play it fine but hits it straight to short fine leg.","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637853060366653515.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL 2022, SRH vs GT Live Score: Umran Malik Removes Matthew Wade, Gujarat Titans 3 Down - NDTV Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMif2h0dHBzOi8vc3BvcnRzLm5kdHYuY29tL2lwbC0yMDIyL2lwbC0yMDIyLXNyaC12cy1ndC1saXZlLXNjb3JlLXVwZGF0ZXMtc3VucmlzZXJzLWh5ZGVyYWJhZC12cy1ndWphcmF0LXRpdGFucy1saXZlLXNjb3JlLTI4Nzg0MzDSAYUBaHR0cHM6Ly9zcG9ydHMubmR0di5jb20vaXBsLTIwMjIvaXBsLTIwMjItc3JoLXZzLWd0LWxpdmUtc2NvcmUtdXBkYXRlcy1zdW5yaXNlcnMtaHlkZXJhYmFkLXZzLWd1amFyYXQtdGl0YW5zLWxpdmUtc2NvcmUtMjg3ODQzMC9hbXAvMQ?oc=5","keywords":null,"creator":null,"video_url":null,"description":"IPL 2022, SRH vs GT Live Score: Umran Malik Removes Matthew Wade, Gujarat Titans 3 Down  NDTV SportsSRH vs GT Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update- Tata IPL 2022  Cricket AddictorToo Much is Being Made Out of Odean Smith's Overthrow: Arshdeep Singh  News18SRH vs GT Dream11 Prediction 2022 | Sunrisers Hyderabad vs Gujarat Titans Dream 11 Prediction for today’s IPL Match – TATA IPL 2022 Fantasy Cricket Prediction Tips for Match 21 by Experts  KreedOn'He's the bloke all teams are looking and thinking how do we beat them'  Hindustan TimesView Full coverage on Google News","content":null,"pubDate":"2022-04-11 14:42:34","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Rahul Tripathi catch vs Gujarat Titans: SRH fielder grabs stunning diving catch to dismiss Shubman Gill at DY Patil Stadium","link":"https://thesportsrush.com/cricket-news-rahul-tripathi-catch-vs-gujarat-titans-srh-fielder-grabs-stunning-diving-catch-to-dismiss-shubman-gill-at-dy-patil-stadium/","keywords":["Cricket","Gujarat Titans","IPL 2022","Sunrisers Hyderabad","Videos","Bhuvneshwar Kumar","GT","Indian Premier League","Rahul Tripathi","Shubman Gill","SRH"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Rahul Tripathi catch vs Gujarat Titans: The batter from Sunrisers Hyderabad grabbed a stunning diving catch tonight. During the 21st match of the ongoing 15th season of the Indian Premier League between Sunrisers Hyderabad and Gujarat Titans in Navi Mumbai, in-form Gujarat Titans opening batter Shubman Gill became the first batter to get out in… The post Rahul Tripathi catch vs Gujarat Titans: SRH fielder grabs stunning diving catch to dismiss Shubman Gill at DY Patil Stadium appeared first on The SportsRush.","content":"Rahul Tripathi catch vs Gujarat Titans: The batter from Sunrisers Hyderabad grabbed a stunning diving catch tonight. During the 21st match of the ongoing 15th season of the Indian Premier League between Sunrisers Hyderabad and Gujarat Titans in Navi Mumbai, in-form Gujarat Titans opening batter Shubman Gill became the first batter to get out in the match. It all happened on the second delivery of the third over when Gill played an aerial drive off Bhuvneshwar Kumar only to walk back to the pavilion after scoring 7 (9) with the help of one four. Fielding at cover, Sunrisers Hyderabad batter Rahul Tripathi put on display an outstanding catch to make early inroads into the opposition’s batting lineup. With the ball timed well, Tripathi had little time to dive towards his left and complete a catch while being airborne. However, the 31-year old player made no mistake whatsoever at the Dr DY Patil Sports Academy. With Kumar leaking as many as 17 runs in the first over, dismissing opposition’s best batter in Gill was the need of the hour for Hyderabad. Readers must note that this is the second time in seven IPL innings that Kumar has picked Gill’s wicket. It is worth mentioning that SRH captain Kane Williamson had won the toss and chose to bowl tonight. Coming on the back of individual wins, both the teams didn’t make any change to their Playing XI for this match. Rahul Tripathi catch vs Gujarat Titans Is it a bird? No it’s Rahul Tripathi This would go down one of the best catches of IPL history#GTvsSRH pic.twitter.com/CIRd4gHLTi — Rahul Raj (@Ra16814638Raj) April 11, 2022 Rahul tripathi stunning catch… #GTvsSRH #SRHvGT pic.twitter.com/UA0focDkgi — Chinthakindhi Ramudu (O- Negitive) (@RAMURAVANA) April 11, 2022 Twitter reactions on Rahul Tripathi catch vs Gujarat Titans: #rahultripathi is that guy you would want to have in your team. #GTvsSRH #TATAIPL #CricketTwitter — Pragyan Ojha (@pragyanojha) April 11, 2022 WHAT A CATCH RAHUL TRIPATHI!!!!! — SunRisers Hyderabad (@SunRisers) April 11, 2022 Not a great ball but what an unbelievable catch by RAHUL TRIPATHI to get rid of the man in form Shubman Gill #SRHvGT — Sushant Mehta (@SushantNMehta) April 11, 2022 For more cricket-related news, click here. The post Rahul Tripathi catch vs Gujarat Titans: SRH fielder grabs stunning diving catch to dismiss Shubman Gill at DY Patil Stadium appeared first on The SportsRush.","pubDate":"2022-04-11 14:36:06","full_description":"Rahul Tripathi catch vs Gujarat Titans: The batter from Sunrisers Hyderabad grabbed a stunning diving catch tonight. During the 21st match of the ongoing 15th season of the Indian Premier League between Sunrisers Hyderabad and Gujarat Titans in Navi Mumbai, in-form Gujarat Titans opening batter Shubman Gill became the first batter to get out in the match. It all happened on the second delivery of the third over when Gill played an aerial drive off Bhuvneshwar Kumar only to walk back to the pavilion after scoring 7 (9) with the help of one four. Fielding at cover, Sunrisers Hyderabad batter Rahul Tripathi put on display an outstanding catch to make early inroads into the opposition’s batting lineup. With the ball timed well, Tripathi had little time to dive towards his left and complete a catch while being airborne. However, the 31-year old player made no mistake whatsoever at the Dr DY Patil Sports Academy. With Kumar leaking as many as 17 runs in the first over, dismissing opposition’s best batter in Gill was the need of the hour for Hyderabad. Readers must note that this is the second time in seven IPL innings that Kumar has picked Gill’s wicket. It is worth mentioning that SRH captain Kane Williamson had won the toss and chose to bowl tonight. Coming on the back of individual wins, both the teams didn’t make any change to their Playing XI for this match. Is it a bird? No it’s Rahul Tripathi ⚡ This would go down one of the best catches of IPL history #GTvsSRH pic.twitter.com/CIRd4gHLTi — Rahul Raj (@Ra16814638Raj) April 11, 2022 Rahul tripathi stunning catch… #GTvsSRH #SRHvGT pic.twitter.com/UA0focDkgi — Chinthakindhi Ramudu (O- Negitive) (@RAMURAVANA) April 11, 2022 #rahultripathi is that guy you would want to have in your team. #GTvsSRH #TATAIPL #CricketTwitter — Pragyan Ojha (@pragyanojha) April 11, 2022 WHAT A CATCH RAHUL TRIPATHI!!!!! — SunRisers Hyderabad (@SunRisers) April 11, 2022 Not a great ball but what an unbelievable catch by RAHUL TRIPATHI to get rid of the man in form Shubman Gill #SRHvGT — Sushant Mehta (@SushantNMehta) April 11, 2022 For more cricket-related news, click here .","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Sunrisers Hyderabad vs Gujarat Titans Live Score Ball by Ball, IPL 2022 Live Cricket Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/sunrisers-hyderabad-vs-gujarat-titans-live-score-over-match-21-t20-6-10-updates-2879000","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Sunrisers Hyderabad vs Gujarat Titans from Dr. DY Patil Sports Academy, Navi Mumbai. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-04-11 14:35:46","full_description":"A dedicated team of experts bring you live score, live cricket score, live match update on Sports.NDTV.com . After 10.1 overs, Gujarat Titans are 80/3. The live updates of Sunrisers Hyderabad vs Gujarat Titans scorecard is also available. It is the perfect platform to follow your favourite teams in Indian Premier League 2022. Keep a track on your favourite batsmen and bowlers through Indian Premier League 2022 today match, ball by ball commentary, Sunrisers Hyderabad vs Gujarat Titans, Sunrisers Hyderabad vs Gujarat Titans live score, Sunrisers Hyderabad vs Gujarat Titans scorecard. Follow the excitement of the Indian Premier League 2022 on Sports.NDTV.com as you can follow live match updates and live cricket score through our platform. 9.6 overs (2 Runs) 2 runs. 9.5 overs (1 Run) Full and straight, whipped away to deep square leg for one more by Hardik Pandya. 9.4 overs (1 Run) Very full and angled in at the toes at 147 clicks. Miller works it towards mid-wicket for a quick single. 9.3 overs (0 Run) Fuller in length, at 147.7 kph and angling into off. Miller with a solid block off the front foot. 9.2 overs (2 Runs) Good-length, around the hips and nudged away behind square on the leg side for an easy brace by Miller. 9.1 overs (1 Run) Length, around the top of off and at almost 148 clicks. Pandya hangs back and tucks it through mid-wicket for one. DRINKS! It has been good from Hyderabad so far! They are into the middle order of Gujarat and have not let them score freely too. However, they know the two out there are really dangerous and they can takes the game away from them. Hyderabad though need just the one wicket and they would believe they can restrict Gujarat to a score which could be termed as under par. A really interesting phase awaits. 8.6 overs (0 Run) Fullish delivery around middle. Miller leans in to make the block. 8.5 overs (1 Run) Uppish but safe! Tossed up, around off. Pandya gets a leading edge as he looks to straight drive and the ball goes well past a diving Markram. Single taken. 8.4 overs (6 Runs) SIX! 100 maximums in the tournament's history for Hardik Pandya! Dragged down from Markram and Pandya just launches it into orbit. The ball flies over the mid-wicket fence for a biggie. 8.3 overs (1 Run) Off the mark straightaway. Markram spears it in on middle from 'round the wicket. Miller works it down to long on for a single. 8.2 overs (1 Run) Angled into middle and leg, pushed down the ground for a single. 8.1 overs (0 Run) Markram starts off with a quicker delivery, on off. Pandya pushes it back to the bowler. 7.6 overs (0 Run) OUT! LBW! Umran Malik goes even quicker and it's just too hot to handle for Matthew Wade. Malik comes from 'round the wicket and angles in a fuller delivery at more than 149 clicks and this is on middle stump. Wade looks to work it away leg side but the ball sneaks past the willow and crashes into the pads. There is a huge appeal and the finger is raised. Wade starts walking off. David Miller is the next man in. 7.5 overs (1 Run) Pacy delivery, just back of a length and around off. Pandya looks to punch it off the back foot but gets an outside edge which goes on the bounce to the fielder at third man. Single taken. 7.4 overs (0 Run) A touch fuller, at 144.3 kph and Hardik blocks it out. 7.3 overs (4 Runs) FOUR! Crashed away! Short but just not short enough. Hardik Pandya shows fast hands as he connects the pull shot well and picks up a boundary through the mid-wicket region. 7.2 overs (4 Runs) FOUR! A half-volley at 147.7 kph and Hardik Pandya and timed it perfectly. Hardik leans into the cover drive and gets it through the cover region for a boundary. 7.1 overs (0 Run) Geez, that's a fiery start from Umran Malik. Malik comes steaming in and starts off with a spicy short ball. The ball just climbs onto Hardik as he looks to pull but he gets hit flush on the grill of the helmet. Hardik seems fine though. 6.6 overs (1 Run) Top over from Sundar, just the four singles off it. On a length, on off and Hardik punches it through extra cover for one more. 6.5 overs (1 Run) They think about two but have to settle for the single. On middle, pushed towards mid-wicket by Wade. 6.4 overs (1 Run) Nicely played. Shorter this time from Sundar, close to the off stump. Hardik hangs back and steers it down to third man for one. 6.3 overs (0 Run) On off, worked away towards Kane Williamson at short mid-wicket. 6.2 overs (0 Run) Quicker and flatter, on off. Pandya stands tall and punches it towards mid on. 6.1 overs (1 Run) Quicker one, sliding into the pads. Wade presses forward and nudges it towards mid-wicket for a single. Washington Sundar (1-0-6-0) is back on. 5.6 overs (4 Runs) FOUR! On the up and a boundary to end the first 6! Even-stevens after it. Length and on off, Pandya shows the full face of the bat, he hits it on the up and wide of mid off for a boundary. 5.5 overs (0 Run) That is a good delivery! Length and on off, it comes back in. Pandya lunges and looks to defend but gets an inside edge onto the pads. The skipper, Hardik Pandya walks out at number 4. 5.4 overs (0 Run) OUT! TAKEN! Extra bounce does the job for T Natarajan and he strikes in his first over yet again! Gets Sai Sudharsan who played so well in the last game! Length and on off, this one probably holds in the surface too a little and also takes off. Sai looks to push at it, he tries to stroke it on the up, it goes off the splice and straight to mid off where Kane Williamson takes it. This is a really good comeback after that poor first over from Hyderabad. Still two balls to go though in the Powerplay. 5.3 overs (4 Runs) FOUR! Well timed! Angled into the pads, Sai Sudharsan works it through square leg, this one is in the gap and it is a very fast outfield and hence, it races away. 5.2 overs (1 Run) A single in the end! Length and on off, Wade guides it to point. He takes off but is sent back. The throw is not a good one from the fielder at point as he has a shy at the batter's end. The man backing up is in the deep so a run. 5.1 overs (0 Run) Timed well but for no runs! T Natarajan goes full and attacks the stumps like he does, this is pushed to mid on.","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637853043377610076.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"South Africa replaces two COVID infected players in 2nd Test against Bangladesh","link":"https://www.indiatvnews.com/sports/cricket/south-africa-replaces-two-covid-infected-players-in-2nd-test-against-bangladesh-2022-04-11-769056","keywords":null,"creator":null,"video_url":null,"description":"In a first instance of COVID-19 substitution in international cricket, South Africa's Sarel Erwee and Wiaan Mulder were replaced by Khaya Zondo and Glenton Stuurman in the playing eleven of the second Test against Bangladesh after testing positive for the virus on Monday.","content":null,"pubDate":"2022-04-11 14:06:24","full_description":"In a first instance of COVID-19 substitution in international cricket, South Africa's Sarel Erwee and Wiaan Mulder were replaced by Khaya Zondo and Glenton Stuurman in the playing eleven of the second Test against Bangladesh after testing positive for the virus on Monday. Erwee and Mulder were tested on Monday morning, the fourth day of the Test, and returned positive results. \"Khaya Zondo will make his Test debut on Day 4 of the 2nd BetwayTest against Bangladesh after Sarel Erwee and Wiaan Mulder tested positive for Covid-19,\" a Cricket South Africa tweet said. \"The pair replaced with Zondo and Glenton Stuurman.\" South Africa won the second Test by 332 runs on the fourth day itself to clinch the two-match series 2-0. \"This is an unfortunate situation, but not unexpected after the decision was made to have this tour under the Managed Event Environment (MEE) protocol, rather than the strict Bio-safe Environment (BSE) Protocol as was previously the case,\" CSA chief medical officer Dr Shuaib Manjra said. \"This is in line with the country's policy in revoking the Disaster Management Act with reference to the pandemic, as well the huge mental strain that a bubble environment induces.\" The series is being played in a managed environment, not in a bio-bubble. Players are not limited to their hotel rooms and are allowed to go out - with the advice that they should stick to open air restaurants and the outdoors - and mingle with other people. This is the first instance of the COVID substitution protocol being used in international cricket. COVID replacement incidents had happened earlier in the Plunket Shield and County Championship but not in international cricket. It is also just the second instance of two substitutes for a team in the same match in international cricket -- Bangladesh had two concussion subs against India in 2019. According to ESPNcricinfo, Bangladesh's coach Russell Domingo has not been able to attend the Test after contracting COVID-19 last week while South Africa's bowling coach Charl Langeveldt and security officer Zunaid Wadee were also not at the match venue after testing positive on Friday. All COVID-related restrictions, apart from mask-wearing in indoor spaces and limitations on the number of people at gatherings, have been lifted in South Africa.","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"South Africa captain Elgar sounds warning to the players who chose IPL over Tests - The Indian Express","link":"https://news.google.com/__i/rss/rd/articles/CBMihwFodHRwczovL2luZGlhbmV4cHJlc3MuY29tL2FydGljbGUvc3BvcnRzL2lwbC9zb3V0aC1hZnJpY2EtY2FwdGFpbi1lbGdhci1zb3VuZHMtd2FybmluZy10by10aGUtcGxheWVycy13aG8tY2hvc2UtaXBsLW92ZXItdGVzdHMtNzg2NDcwMC_SAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"South Africa captain Elgar sounds warning to the players who chose IPL over Tests  The Indian ExpressSouth Africa's Test team in 'special place' after acing challenging 2021-22 season  ESPNcricinfoSouth Africa Players Who Skipped Bangladesh Tests For IPL Might Not Be Selected Again: Dean Elgar  Cricket Addictor‘I don’t know if they are going to be selected again’ – Dean Elgar on players who skipped Bangladesh Test series for IPL  CricTracker'Not fair' for IPL players to make easy return: 'The guys have made a massive statement'  News24View Full coverage on Google News","content":null,"pubDate":"2022-04-11 13:59:23","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"SRH vs GT Live Score, IPL 2022: Sunrisers Hyderabad to bowl vs Gujarat Titans - Hindustan Times","link":"https://news.google.com/__i/rss/rd/articles/CBMilQFodHRwczovL3d3dy5oaW5kdXN0YW50aW1lcy5jb20vY3JpY2tldC9zcmgtdnMtZ3QtbGl2ZS1zY29yZS1pcGwtMjAyMi1zdW5yaXNlcnMtaHlkZXJhYmFkLXZzLWd1amFyYXQtdGl0YW5zLW1hdGNoLTIxLWxpdmUtdXBkYXRlcy0xMDE2NDk2NzQxNjQzNjkuaHRtbNIBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"SRH vs GT Live Score, IPL 2022: Sunrisers Hyderabad to bowl vs Gujarat Titans  Hindustan TimesSRH vs GT Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update- Tata IPL 2022  Cricket AddictorToo Much is Being Made Out of Odean Smith's Overthrow: Arshdeep Singh  News18Match Preview - Sunrisers vs Titans, Indian Premier League 2022, 21st Match  ESPNcricinfoSRH vs GT Match Prediction- Who Will Win Today's IPL Match Between Sunrisers Hyderabad and Gujarat Titans, IPL 2022, Match 21  Cricket AddictorView Full coverage on Google News","content":null,"pubDate":"2022-04-11 13:58:58","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Sunrisers Hyderabad vs Gujarat Titans Live Score Ball by Ball, IPL 2022 Live Cricket Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/sunrisers-hyderabad-vs-gujarat-titans-live-score-over-match-21-t20-1-5-updates-2878775","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Sunrisers Hyderabad vs Gujarat Titans from Dr. DY Patil Sports Academy, Navi Mumbai. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-04-11 13:45:46","full_description":"A dedicated team of experts bring you live score, live cricket score, live match update on Sports.NDTV.com . After 5.2 overs, Gujarat Titans are 43/1. The live updates of Sunrisers Hyderabad vs Gujarat Titans scorecard is also available. It is the perfect platform to follow your favourite teams in Indian Premier League 2022. Keep a track on your favourite batsmen and bowlers through Indian Premier League 2022 today match, ball by ball commentary, Sunrisers Hyderabad vs Gujarat Titans, Sunrisers Hyderabad vs Gujarat Titans live score, Sunrisers Hyderabad vs Gujarat Titans scorecard. Follow the excitement of the Indian Premier League 2022 on Sports.NDTV.com as you can follow live match updates and live cricket score through our platform. 4.6 overs (0 Run) A dot to end another tidy over! On middle, Sai blocks it. 4.5 overs (1 Run) On middle, this is nudged towards mid-wicket for one again. 4.4 overs (0 Run) Wade is disappointed! He loves the paddle scoop, does try that. This was also there to be hit, it was a length ball around off, Wade misses. 4.3 overs (1 Run) Angled into the pads, this is clipped through square leg for one. 4.2 overs (4 Runs) FOUR! That is a fortunate boundary! Sai was beaten for pace there! Short and on middle, a really well-directed bumper. Sai Sudharsan looks to pull but this hits the top edge and then the helmet. Goes over the first slip fielder and into the fence. 4.1 overs (0 Run) Length and on off, Sai Sudharsan opens the face of the bat and guides it to point. Marco Jansen (1-0-7-0) to bowl from the other end now. 3.6 overs (1 Run) 6 from Sundar's first! On middle, Sai pushes it down to mid on and gets to the other end. 3.5 overs (1 Run) Now a single! On off, shorter, this is pushed down to long off for one. 3.4 overs (4 Runs) FOUR! Was that a chance? Maybe Abhishek Sharma did get a hand to it! On middle, Wade gets out the reverse sweep, he hits it hard, it goes towards point. Sharma dives to his left and gets two hands to it but it goes through and to the fence. That could have been taken. Tough chance but a chance. 3.3 overs (0 Run) Really well bowled! Slower and on middle, defended. 3.2 overs (0 Run) Quicker and on middle, Wade pushes it back to the right of the bowler. 3.1 overs (0 Run) Starts off with a flatter one on off, defended well. 2.6 overs (1 Run) Well fielded! End of a successful over for Hyderabad! On off, Wade opens the face of the bat and plays it towards point. The fielder dives to his left and stops it well. Just the run. 2.5 overs (4 Runs) FOUR! Timed wonderfully! On middle, Wade shows the full face of the bat and times it past mid on for a boundary! Beautiful shot. 2.4 overs (1 Run) Sai Sudharsan is off the mark! On off, this is guided down to third man for one. 2.3 overs (0 Run) Good length and on off, defended. Sai Sudharsan is in at number 3. 2.2 overs (0 Run) OUT! TAKEN! That is a stunner, an absolute stunner. One needs to produce something special to get rid of Gill, especially in the form he is and Rahul Tripathi has done so! This is on a length and around off, this is drilled, it is right off the middle as Gill looks to hit it on the up. It goes to the left of the fielder at covers like a rocket. He dives and takes it brilliantly. A one-handed stunner. A welcome wicket as Gujarat had got off to a flier. Also, this is surely going to be one of the best catches of the tournament. 2.1 overs (0 Run) Better start from Kumar! Good length and on off, defended. 1.6 overs (1 Run) Another single to end another good over for Gujarat. They are off to a flier. On off, this is pushed to mid off for one. 1.5 overs (1 Run) That was a very risky run! Length and on off, Wade drops it towards the off side and takes off. Jansen gets to the ball, turns and has a shy but misses at the bowler's end. 1.4 overs (1 Run) A little too straight this time, Gill looks to flick but misses to get hit on the pads. 1.3 overs (0 Run) Back of a length and on middle, defended well. 1.2 overs (4 Runs) FOUR! That went very high but cleared the in-field and that is what you have to do in the Powerplay! On middle, Gill comes down the track and heaves it over the mid-wicket fielder for a boundary. 1.1 overs (0 Run) Good length and on off, Gill defends it towards cover. 0.6 over (0 Run) A dot to end an expensive first over! This is slanted across the left-hander but is a bit fuller. Wade leans in but lets it through to the keeper. 17 off the first over! 0.5 over (0 Run) On a good length, angled across the left-hander. Wade gets a bottom edge back onto the deck as he looks to cut. 0.5 over (5 Runs) FIVE WIDES! Another really poor delivery from Kumar. Wat down the leg side and Pooran cannot get to it. The ball runs away into the fence and Gujarat get five more bonus runs. 0.4 over (1 Run) Shubman Gill is off the mark. Around off, bunted away towards covers and they sneak in a quick single. 0.3 over (0 Run) Much better from Bhuvi. Fullish ball, close to the off stump and shaping in a bit. Gill leaves it alone. 0.3 over (1 Run) WIDE! Bhuvneshwar Kumar hasn't quite gotten his radar right yet. A bit further up and wide of off stump, shaping even further away. Wided. 0.2 over (1 Run) Leg bye! On leg stump, Wade looks to flick but misses. The ball goes off the pads and towards square leg. They get a leg bye. 0.2 over (5 Runs) FIVE WIDES! Poor line from Bhuvi this time. Length again, around leg stump and shaping into the left-hander. The ball goes down the leg side and Nicholas Pooran cannot get a glove on it. The ball runs away into the fine leg fence. 0.1 over (4 Runs) FOUR! Unlucky! Bhuvi starts off with a lovely length ball, pitching around leg and shaping away. Matthew Wade gets squared up and the ball goes off the leading edge and past the slip cordon for a boundary. Wade and Gujarat are up and running! All in readiness! The umpires walk out to the middle as the Hyderabad players are seen in a huddle. Gujarat openers Shubman Gill and Matthew Wade stride out to the middle as well. Bhuvneshwar Kumar has the new ball in hand and is raring to go. Let's play... Gujarat skipper, Hardik Pandya says that they would have bowled first as well just because of the dew factor but batting first is fine too. Adds that the process matters more than results and if they put the hard work in, the results do come. About Rahul Tewatia, he says that he's right up there as a finisher and he works hard day in and day out. Also informs that they are going with the same playing XI. Kane Williamson the captain of Hyderabad says that they will have a bowl first as there is potential for dew. He adds that they have improved in the last couple of matches and will look to improve further. Mentions that they play across four different grounds and hence have to be adaptable. Informs that there are no changes to the playing XI. Gujarat Titans (Unchanged XI) - Matthew Wade (WK), Shubman Gill, Sai Sudharsan, Hardik Pandya (C), David Miller, Rahul Tewatia, Abhinav Manohar, Rashid Khan, Darshan Nalkande, Mohammad Shami and Lockie Ferguson. Sunrisers Hyderabad (Unchanged XI) - Abhishek Sharma, Kane Williamson (C), Rahul Tripathi, Nicholas Pooran (WK), Aiden Markram, Shashank Singh, Washington Sundar, Bhuvneshwar Kumar, Marco Jansen, Umran Malik and T Natarajan. TOSS - Up goes the flip of the coin and it lands in favour of Hyderabad. They have elected to BOWL first. PITCH REPORT - Daren Ganga is pitchside. He says that the match will be played on pitch one and the dimensions are different from the last game here. Adds that there is a bit of grass but it is a bit patchy as well. Reckons that there will be a bit of bounce and scoring runs inside the Powerplay is the key as spin will be effective in the middle overs due to the dryness of the surface. Gujarat have had a dream start to the tournament. They have won three out of the three games they have played and are favourites heading into this game as well. Hyderabad though come into this after winning their last game against Chennai and their confidence will be high. Hyderabad look a lot more complete as a team than they were last year but can they topple a Gujarat side that is filled with superstars of the modern generation? The Indian T20 League is moving along smoothly and we now head into game 21 and it is a clash between two sides who are on the opposite ends of the table. One is in the top three and the other is languishing in the bottom half. Hyderabad will be taking on Gujarat. Welcome to the coverage. ... MATCH DAY ...","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637853013386974954.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Sportswashing Is Everywhere, But It's Not New","link":"https://www.si.com/olympics/2022/04/11/sportswashing-olympics-world-cup-daily-cover","keywords":["Olympics","Daily Cover","Features","HP Feature"],"creator":["Michael Rosenberg"],"video_url":null,"description":"Regimes have been using sports to burnish their images or distract from their problematic behavior for centuries.","content":"Regimes have been using sports to burnish their images or distract from their problematic behavior for centuries.Competitive sports are built on the concept of fair play, which helps explain why so many oppressive regimes see value in games. Any form of good, wholesome fun can seem like it is presented by good, wholesome people, even when the facts say otherwise.China, with its appalling human rights record and opposition to an independent Taiwan, hosted the recent Winter Olympics with the strategically peaceful slogan Together for a Shared Future. One of the stars of those Games was Eileen Gu, a California-born skier who chose to compete for her mother's homeland of China, implicitly embracing the government of China rather than the U.S., whether or not that was her intent. Gu declined to say whether she renounced her U.S. citizenship to gain a Chinese passport, as Chinese law requires, but she did gush about “the ability of sport to bridge the gap and to be a force for unity.”That was music to the ears of the Chinese government—and to those of the Saudi government, as well. Saudi Arabia has long attempted to lure star golfers to events there with large financial guarantees, using the players and sports to present a benign image of the country. And they've succeeded: Two-time Masters champion Bubba Watson recently praised their efforts to support women's golf, completely ignoring the fact that, until last summer, women needed permission from a male guardian to live alone. Illustration by Davide Barco The Saudis, to use Phil Mickelson's words, are “scary motherf------ to get involved with,” yet he is involved anyway. Mickelson has spearheaded the Saudi-funded effort to create a world golf tour for the game's elite—a much larger effort to cleanse the country's image.Most disturbing is that Mickelson knows exactly why and how he is being used.“Sportswashing,” Mickelson called it in an interview with writer Alan Shipnuck of The Firepit Collective for Shipnuck's upcoming book, Phil: The Rip-Roaring (and Unauthorized!) Biography of Golf's Most Colorful Superstar. Sportswashing is the use of sports to present a sanitized, friendlier version of a political regime or operation. Mickelson later apologized for using words that do not reflect his “true feelings,” but that apology was just another form of sportswashing; he should think the people funding the new tour are scary bleeps, because they are. They are determined to succeed, too: They just announced a 2022 schedule that includes four events in the U.S.The term sportswashing is relatively new, but the practice is almost as old as sports. Paul Christesen, a professor of ancient Greek history at Dartmouth, says it goes all the way back to the original Olympics.Christesen tells this story: “There's a long war between Athens and Sparta. Athens looks like it's getting its ass handed to it. They're getting the crap beaten out of them. And everyone thinks that they're down and out. And so an Athenian politician named Alcibiades comes to the Olympic Games in 416 [B.C.E.], right in the middle of the war, when things are going bad for Athens. And he enters several chariot teams into the four-horse chariot race and wins first, second and either third or fourth place. And that's like an F1 racing team—it was insanely expensive. Qatar has let nothing stand in the way of stadium construction for the 2022 Cup. Matthew Ashton/AMA/Getty Images “And they all said to him at home, 'You're crazy. We don’t have those kinds of resources.' And he’s like, ‘Listen. Everyone thought we were down and out. I win all these events at Olympia, and now everyone in the Greek world thinks that we're just fine. And they're terrified of us.' It was a straight-up geopolitical maneuver.”Modern sportswashing can take many forms. Qatar wants the world to see it as the host of the 2022 men's World Cup, not a country where migrant workers are exploited. (Including for the competition: Thousands of workers have died over the last decade building the World Cup infrastructure.) Former Chinese Communist Party leader Mao Tse-tung once banned golf, calling it a “sport for millionaires,” but the game has since become both legal and popular in China, leading to propaganda that golf was actually invented there. If you were to listen to the Party, you'd believe that everything that happens in China started in China and belongs to China. Competing for China, Gu was the first freestyle skier to win three medals at one Games. Erick W. Rasco/Sports Illustrated If you think that kind of silly nationalistic fable would never fly in the U.S., I have two words for you: Abner Doubleday. Millions of American kids have grown up believing Doubleday invented baseball—a myth that was created a century ago to distance the national pastime from its foreign antecedents, cricket and rounders.“It is a proven fact that the game now designated 'Base ball' is of modern and purely American origin,” insisted one of the game's first power brokers, Albert G. Spalding, in his 1911 book America's National Game.There is a hint of sportswashing every time a U.S. president throws out a first pitch or a college president talks about football as the “front porch” of a university. Sports seem like they aren't political, which is precisely why they are so often used for political purposes. The drama seduces us, and our passions distract us, and so we swallow whatever government officials feed us without even realizing it.After Russia invaded Ukraine, the International Olympic Committee and FIFA moved to ban both Russia and its ally Belarus from competition. That might not seem like much of a penalty for Russia's atrocities in Ukraine, but don't think of it as a punishment. Think of it as taking away a weapon. President Vladimir Putin has long used sports to shape Russia's image as both powerful and reasonable. Shortly after delivering a famously blistering anti-West speech in Munich in 2007, Putin successfully lobbied the IOC to award the '14 Winter Olympics to Sochi, a one-two punch that made Russia seem like it (and its leader's views) belonged on the world stage. Russia kept using sports to look strong (instituting a state-sponsored doping program to increase the country's medal count) and friendly (Putin opened the '18 men's World Cup by welcoming spectators and journalists to “open, hospitable, friendly Russia.”) Earlier this year, he attended the '22 Winter Olympics opening ceremony and appeared to fake falling asleep as the Ukrainian delegation entered the stadium, then invaded Ukraine shortly after the Games ended.The modern Olympics, like the ancient ones, have often been a political tool. When Nazi Germany hosted the 1936 Summer Olympics, it saw the event as a pep rally for the Aryan race. The Games' slogan was “I Call the Youth of the World!” Adolf Hitler built the Olympiastadion in Berlin, which supposedly seated 100,000 people, and the Nazis paid for propagandist filmmaker Leni Riefenstahl to make a documentary about the Olympics. The Nazis also took down signs banning Jews from public places, in an effort to seem . . . well, open, hospitable and friendly.“People take sports super seriously,” Christesen says. “And as soon as people do that, you can leverage it for geopolitical purposes. My students are like, 'Everyone's too cynical [for it to work now]. Of course it works. It always works. In some ways, it works better now, because you're so bombarded by it all the time that you can't escape from it.” A PR tactic that has been successful for more than 2,000 years is probably not going away anytime soon. But sports fans and journalists can at least call sportswashing what it is, and athletes should show some self-respect when tyrants come calling. There are plenty of ways to host games without being part of such a dirty one.Read more of SI’s Daily Cover stories here:• Sportswashing and Global Football’s Immense Power• Rory McIlroy Was Once the Next Tiger Woods. So, What Is He Now?• We Haven’t Seen the Best of Shohei Ohtani","pubDate":"2022-04-11 13:00:00","full_description":"Competitive sports are built on the concept of fair play, which helps explain why so many oppressive regimes see value in games. Any form of good, wholesome fun can seem like it is presented by good, wholesome people, even when the facts say otherwise. China, with its appalling human rights record and opposition to an independent Taiwan, hosted the recent Winter Olympics with the strategically peaceful slogan Together for a Shared Future . One of the stars of those Games was Eileen Gu, a California-born skier who chose to compete for her mother's homeland of China, implicitly embracing the government of China rather than the U.S., whether or not that was her intent. Gu declined to say whether she renounced her U.S. citizenship to gain a Chinese passport, as Chinese law requires, but she did gush about “the ability of sport to bridge the gap and to be a force for unity.” That was music to the ears of the Chinese government—and to those of the Saudi government, as well. Saudi Arabia has long attempted to lure star golfers to events there with large financial guarantees, using the players and sports to present a benign image of the country. And they've succeeded: Two-time Masters champion Bubba Watson recently praised their efforts to support women's golf, completely ignoring the fact that, until last summer, women needed permission from a male guardian to live alone. Illustration by Davide Barco The Saudis, to use Phil Mickelson's words, are “scary motherf------ to get involved with,” yet he is involved anyway. Mickelson has spearheaded the Saudi-funded effort to create a world golf tour for the game's elite—a much larger effort to cleanse the country's image. Most disturbing is that Mickelson knows exactly why and how he is being used. “Sportswashing,” Mickelson called it in an interview with writer Alan Shipnuck of The Firepit Collective for Shipnuck's upcoming book, Phil: The Rip-Roaring (and Unauthorized!) Biography of Golf's Most Colorful Superstar . Sportswashing is the use of sports to present a sanitized, friendlier version of a political regime or operation. Mickelson later apologized for using words that do not reflect his “true feelings,” but that apology was just another form of sportswashing; he should think the people funding the new tour are scary bleeps, because they are. They are determined to succeed, too: They just announced a 2022 schedule that includes four events in the U.S. The term sportswashing is relatively new, but the practice is almost as old as sports. Paul Christesen, a professor of ancient Greek history at Dartmouth, says it goes all the way back to the original Olympics. Christesen tells this story: “There's a long war between Athens and Sparta. Athens looks like it's getting its ass handed to it. They're getting the crap beaten out of them. And everyone thinks that they're down and out. And so an Athenian politician named Alcibiades comes to the Olympic Games in 416 [B.C.E.], right in the middle of the war, when things are going bad for Athens. And he enters several chariot teams into the four-horse chariot race and wins first, second and either third or fourth place. And that's like an F1 racing team—it was insanely expensive. Qatar has let nothing stand in the way of stadium construction for the 2022 Cup. Matthew Ashton/AMA/Getty Images “And they all said to him at home, 'You're crazy. We don’t have those kinds of resources.' And he’s like, ‘Listen. Everyone thought we were down and out. I win all these events at Olympia, and now everyone in the Greek world thinks that we're just fine. And they're terrified of us.' It was a straight-up geopolitical maneuver.” Modern sportswashing can take many forms. Qatar wants the world to see it as the host of the 2022 men's World Cup, not a country where migrant workers are exploited. (Including for the competition: Thousands of workers have died over the last decade building the World Cup infrastructure.) Former Chinese Communist Party leader Mao Tse-tung once banned golf, calling it a “sport for millionaires,” but the game has since become both legal and popular in China, leading to propaganda that golf was actually invented there. If you were to listen to the Party, you'd believe that everything that happens in China started in China and belongs to China. Competing for China, Gu was the first freestyle skier to win three medals at one Games. Erick W. Rasco/Sports Illustrated If you think that kind of silly nationalistic fable would never fly in the U.S., I have two words for you: Abner Doubleday. Millions of American kids have grown up believing Doubleday invented baseball—a myth that was created a century ago to distance the national pastime from its foreign antecedents, cricket and rounders. “It is a proven fact that the game now designated 'Base ball' is of modern and purely American origin,” insisted one of the game's first power brokers, Albert G. Spalding, in his 1911 book America's National Game . There is a hint of sportswashing every time a U.S. president throws out a first pitch or a college president talks about football as the “front porch” of a university. Sports seem like they aren't political, which is precisely why they are so often used for political purposes. The drama seduces us, and our passions distract us, and so we swallow whatever government officials feed us without even realizing it. After Russia invaded Ukraine, the International Olympic Committee and FIFA moved to ban both Russia and its ally Belarus from competition. That might not seem like much of a penalty for Russia's atrocities in Ukraine, but don't think of it as a punishment. Think of it as taking away a weapon. President Vladimir Putin has long used sports to shape Russia's image as both powerful and reasonable. Shortly after delivering a famously blistering anti-West speech in Munich in 2007, Putin successfully lobbied the IOC to award the '14 Winter Olympics to Sochi, a one-two punch that made Russia seem like it (and its leader's views) belonged on the world stage. Russia kept using sports to look strong (instituting a state-sponsored doping program to increase the country's medal count) and friendly (Putin opened the '18 men's World Cup by welcoming spectators and journalists to “open, hospitable, friendly Russia.”) Earlier this year, he attended the '22 Winter Olympics opening ceremony and appeared to fake falling asleep as the Ukrainian delegation entered the stadium, then invaded Ukraine shortly after the Games ended. The modern Olympics, like the ancient ones, have often been a political tool. When Nazi Germany hosted the 1936 Summer Olympics, it saw the event as a pep rally for the Aryan race. The Games' slogan was “I Call the Youth of the World!” Adolf Hitler built the Olympiastadion in Berlin, which supposedly seated 100,000 people, and the Nazis paid for propagandist filmmaker Leni Riefenstahl to make a documentary about the Olympics. The Nazis also took down signs banning Jews from public places, in an effort to seem . . . well, open, hospitable and friendly. “People take sports super seriously,” Christesen says. “And as soon as people do that, you can leverage it for geopolitical purposes. My students are like, 'Everyone's too cynical [for it to work now]. Of course it works. It always works. In some ways, it works better now, because you're so bombarded by it all the time that you can't escape from it.” A PR tactic that has been successful for more than 2,000 years is probably not going away anytime soon. But sports fans and journalists can at least call sportswashing what it is, and athletes should show some self-respect when tyrants come calling. There are plenty of ways to host games without being part of such a dirty one. Read more of SI’s Daily Cover stories here : • Sportswashing and Global Football’s Immense Power • Rory McIlroy Was Once the Next Tiger Woods. So, What Is He Now? • We Haven’t Seen the Best of Shohei Ohtani","image_url":"http://www.si.com/.image/c_limit%2Ccs_srgb%2Cfl_progressive%2Ch_1200%2Cq_auto:good%2Cw_1200/MTg4Njk1NDEyODg5MTAyMDY4/dcovsportswashing_h.jpg","source_id":"si","country":["united states of america"],"category":["sports"],"language":"english"},{"title":"DY Patil Stadium IPL matches 2022: IPL time table 2022 DY Patil Stadium Navi Mumbai","link":"https://thesportsrush.com/cricket-news-dy-patil-stadium-ipl-matches-2022-ipl-time-table-2022-dy-patil-stadium-navi-mumbai/","keywords":["Cricket","DY Patil Stadium","IPL 2022"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"DY Patil Stadium IPL matches 2022: A total of 20 IPL 2022 games will be played at the DY Patil Stadium in Navi Mumbai. IPL 2022 is up and running in India, and the tournament is been played around four venues only this season. Wankhede Stadium (Mumbai), Brabourne Stadium (Mumbai), DY Patil Stadium (Mumbai) and… The post DY Patil Stadium IPL matches 2022: IPL time table 2022 DY Patil Stadium Navi Mumbai appeared first on The SportsRush.","content":"DY Patil Stadium IPL matches 2022: A total of 20 IPL 2022 games will be played at the DY Patil Stadium in Navi Mumbai. IPL 2022 is up and running in India, and the tournament is been played around four venues only this season. Wankhede Stadium (Mumbai), Brabourne Stadium (Mumbai), DY Patil Stadium (Mumbai) and MCA Stadium (Pune) will host the 70 league game of the tournament. The venue of the playoffs is not decided yet. DY Patil will host a total of 20 league games in the Indian Premier League 2022. A total of six games have been played at the DY Patil Stadium so far. Out of six games, both chasing and defending teams have won three games each so far. The average 1st innings score this season at this ground has been 166 runs. Out of the four stadiums, DY Patil has been the toughest track in terms of batting this season. The longer boundaries of the ground give some cushions to the bowlers to use their lengths, whereas the track has been on the slower side in the last few games. The overall average T20 1st innings score at the DY Patil Stadium is 152 runs. DY Patil Stadium has a maximum sitting capacity of around 55,000. Apart from cricket, this stadium has also hosted the ISL games and ICC U-17 Football World Cup as well. Sunrisers Hyderabad will play Gujarat Titans in their next league game at the DY Patil Stadium. They have won one and lost one game this season at this very venue. Groundsman spraying chemical to keep dew away at DY Patil Stadium.. pic.twitter.com/RUuNXt0HZJ — S Dipak Ragav (@dipakragav) April 11, 2022 DY Patil Stadium IPL matches 2022 A total of 14 IPL 2022 games are yet to be played at the DY Patil Stadium in Navi Mumbai. Match Date Time Sunrisers Hyderabad vs Gujarat Titans 11 April 2022 7:30 PM Chennai Super Kings vs Royal Challengers Bangalore 12 April 2022 7:30 PM Rajasthan Royals vs Gujarat Titans 14 April 2022 7:30 PM Punjab Kings vs Sunrisers Hyderabad 17 April 2022 3:30 PM Lucknow Super Giants vs Royal Challengers Bangalore 19 April 2022 7:30 PM Mumbai Indians vs Chennai Super Kings 21 April 2022 7:30 PM Kolkata Knight Riders vs Gujarat Titans 23 April 2022 3:30 PM Rajasthan Royals vs Mumbai Indians 30 April 2022 7:30 PM Gujarat Titans vs Punjab Kings 3 May 2022 7:30 PM Chennai Super Kings vs Delhi Capitals 8 May 2022 7:30 PM Mumbai Indians vs Kolkata Knight Riders 9 May 2022 7:30 PM Rajasthan Royals vs Delhi Capitals 11 May 2022 7:30 PM Punjab Kings vs Delhi Capitals 16 May 2022 7:30 PM Kolkata Knight Riders vs Lucknow Super Giants 18 May 2022 7:30 PM The post DY Patil Stadium IPL matches 2022: IPL time table 2022 DY Patil Stadium Navi Mumbai appeared first on The SportsRush.","pubDate":"2022-04-11 12:55:15","full_description":"DY Patil Stadium IPL matches 2022: A total of 20 IPL 2022 games will be played at the DY Patil Stadium in Navi Mumbai. IPL 2022 is up and running in India, and the tournament is been played around four venues only this season. Wankhede Stadium (Mumbai), Brabourne Stadium (Mumbai), DY Patil Stadium (Mumbai) and MCA Stadium (Pune) will host the 70 league game of the tournament. The venue of the playoffs is not decided yet. DY Patil will host a total of 20 league games in the Indian Premier League 2022. A total of six games have been played at the DY Patil Stadium so far. Out of six games, both chasing and defending teams have won three games each so far. The average 1st innings score this season at this ground has been 166 runs. Out of the four stadiums, DY Patil has been the toughest track in terms of batting this season. The longer boundaries of the ground give some cushions to the bowlers to use their lengths, whereas the track has been on the slower side in the last few games. The overall average T20 1st innings score at the DY Patil Stadium is 152 runs. DY Patil Stadium has a maximum sitting capacity of around 55,000. Apart from cricket, this stadium has also hosted the ISL games and ICC U-17 Football World Cup as well. Sunrisers Hyderabad will play Gujarat Titans in their next league game at the DY Patil Stadium. They have won one and lost one game this season at this very venue. Groundsman spraying chemical to keep dew away at DY Patil Stadium.. pic.twitter.com/RUuNXt0HZJ — S Dipak Ragav (@dipakragav) April 11, 2022 A total of 14 IPL 2022 games are yet to be played at the DY Patil Stadium in Navi Mumbai.","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Cricket Australia set to announce new coach","link":"https://www.cairnspost.com.au/sport/cricket/cricket-australia-ready-to-announce-andrew-mcdonald-as-coach/news-story/8da7e780a8fbc223df647ccc406af704","keywords":["Cricket news and galleries","Sport news and galleries"],"creator":null,"video_url":null,"description":"Cricket Australia is reportedly ready to announce Andrew McDonald as Justin Langer’s official replacement after reaching an agreement.","content":null,"pubDate":"2022-04-11 12:50:00","full_description":null,"image_url":null,"source_id":"cairnspost","country":["australia"],"category":["sports"],"language":"english"},{"title":"LIVE SRH vs GT Live Score, IPL 2022 Sunrisers Hyderabad vs Gujarat Titans Live Cricket Score, Updates","link":"https://www.indiatvnews.com/sports/cricket/srh-vs-gt-live-score-ipl-2022-sunrisers-hyderabad-vs-gujarat-titans-match-21-live-updates-2022-04-11-769044","keywords":null,"creator":null,"video_url":null,"description":"LIVE SRH vs GT Live Score, IPL 2022 Sunrisers Hyderabad vs Gujarat Titans Live Cricket Score, Updates","content":null,"pubDate":"2022-04-11 12:48:53","full_description":null,"image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL 2022: Entertainment aplenty so far","link":"https://sportstar.thehindu.com/columns/onthewriteline-sunil-gavaskar/ipl-2022-entertainment-aplenty-so-far-batting-clean/article38471500.ece","keywords":null,"creator":["Sunil Gavaskar"],"video_url":null,"description":"The curators have done a fabulous job so far and the old saying that a ‘good wicket (pitch) provides good cricket’ has been seen in the IPL matches so far.","content":null,"pubDate":"2022-04-11 12:11:01","full_description":"What a smashing IPL we have had so far. Just about every match has either gone down till the final over or a game has been finished with a batter hammering more than 25 runs in an over. It’s been nail-biting stuff and some of the hitting that’s been seen is the cleanest witnessed for a long, long time. The beauty is these shots have not been crude ones but great connections with a perfect swing that has taken the bat over the front shoulder in what the coaches would call the ideal follow through. There have been some terrific final overs too, where the fast yorker has stopped the batters from swinging their bats and some of these yorkers have crashed on to the stumps, breaking the odd one, too. READ: Sportstar Aces 2022: A starry affair All this has been possible because of the quality of the pitches, which has been absolutely great. The curators have done a fabulous job so far and the old saying that a ‘good wicket (pitch) provides good cricket’ has been seen in the matches so far. Since there are only four venues and with each venue getting a minimum of 15 matches, the curators had to leave some grass cover on the surface to ensure the hot summer sun doesn’t dry it up and the ball starts turning square. It has given the new ball bowlers the chance to show their seam bowling skills and in the Power Play overs they have taken wickets and not just looked to stop the runs as is otherwise the case. The grass on the pitch has also exposed the the human frailties of the ‘Dadas’ of domestic cricket who suddenly find that with the ball coming above the waist at good pace, they are unable to toy with the bowling line as they do in the Vijay Hazare and Syed Mushtaq Ali Trophy on pitches which have no grass at all. The white ball game allows the batsman to back away to try and counter the bouncing ball and the ignorant think that the batsman is trying to make room to play a shot. But more often than not, it’s the ‘Dadas’ trying to protect their bodies despite the heavy protection. Some of the international stars have also found it tough to counter the bouncing, moving ball and hung their bats out and have been dismissed limply. Quality batsmen, who use the backfoot, have batted superbly and flourished because the ball is coming onto the bat quite nicely, so once the ball stops moving the batter can play through the line without worrying about any sideways movement. ALSO READ: Lot to cheer for Indian cricket The other noticeable thing is the number of no balls that have been bowled even by established names. This is nothing short of being unprofessional and quite frankly there’s no excuse for it. In the T20 format every no ball means not only an extra run added to the opposition total and an extra ball to be delivered and that extra next ball is a free hit, too, which can be the one that can actually change the momentum of the game. While most times allowance is given to a fast bowler coming off a long run-up, if he bowls a no ball, today with tape measures and other technical help there, really, is no excuse for bowling a no ball which can change the course of the game. If I was the coach I would have a heavy fine system in place for a no ball bowled and the fine to the bowling coach, too, and the fines collected can be used for a party with which to end the campaign. If the fines are heavy enough you can be sure the no balls will simply not happen. Since the modern player talks about doing things within his control then not bowling no balls should be within his control, isn’t it? With the kind of fees that top players get and most deservedly for some, it’s incumbent on a player to ensure that he does everything within his powers to be the best he can for the franchise that has splashed some good dosh for him. Hopefully as the tournament progresses we will see less no balls but more and more of the big shots that have brought so much joy to those at the ground as well as the millions watching on TV and their mobile devices. Go IPL. Go.","image_url":null,"source_id":"sportstar","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL LIVE score SRH vs GT: Sunrisers Hyderabad takes on Gujarat Titans","link":"https://sportstar.thehindu.com/cricket/ipl/ipl-news/gt-vs-srh-ipl-live-score-gujarat-titans-vs-sunrisers-hyderabad/article38471336.ece","keywords":null,"creator":["Team Sportstar"],"video_url":null,"description":"GT vs SRH Live Score, Tata IPL 2022: Get the live cricket score updates between Gujarat Titans and Sunrisers Hyderabad from DY Patil Stadium.","content":null,"pubDate":"2022-04-11 11:34:57","full_description":"Welcome to Sportstar 's live coverage of IPL 2022 match between Sunrisers Hyderabad and Gujarat Titans. SRH vs GT PREVIEW Gujarat Titans couldn't have asked for a better start to its maiden IPL campaign with three straight wins and would look to continue it when it takes on Sunrisers Hyderabad at the DY Patil Stadium here on Monday. Titans pulled off a heist in its last match against Punjab Kings when Rahul Tewatia knocked off the required 12 runs with two sixes off the final two balls of the match. Opener Shubhman Gill has looked in pristine touch, scoring at a brisk pace without taking many risks and the team will hope he continues to give solid starts so that the rest of the batting unit can bat around him. READ: CSK paying the price for poor choices at IPL 2022 auction If fellow opener Matthew Wade can chip in with quick runs, the team’s batting unit will look more threatening while reducing the pressure on the likes of captain Hardik Pandya and David Miller as well. Sunrisers come into the game after a morale-boosting first win of the tournament against Chennai Super Kings. After the bowlers restricted CSK to a modest score, openers Abhishek Sharma and skipper Kane Williamson laid the foundation for an easy eight-wicket win with an 89-run stand. Sunrisers though will face a much bigger test against a strong bowling attack of the Titans led by Mohammed Shami, Lockie Ferguson and its former player Rashid Khan, all of whom are in good wicket-taking form. How the Sunrisers' top-order face up to the Titans’ bowlers could well determine which way the match goes. SRH vs GT FULL SQUADS Sunrisers Hyderabad Squad: Kane Williamson (c), Rahul Tripathi, Abhishek Sharma, Nicholas Pooran, Aiden Markram, Washington Sundar, Romario Shepherd, Shashank Singh, R Samarth, Priyam Garg, Abdul Samad, Marco Jansen, Sean Abbott, Shreyas Gopal, Glenn Phillips, Vishnu Vinod, Umran Malik, Saurabh Dubey, Fazhalaq Farooqui, Jagadeesha Suchith, Kartik Tyagi, T Natarajan, Bhuvneshwar Kumar. Gujarat Titans Squad: Hardik Pandya (c), Rashid Khan, Shubman Gill, Mohammed Shami, Jason Roy, Lockie Ferguson, Abhinav Sadarangani, Rahul Tewatia, Noor Ahmed, Sai Kishore, Vijay Shankar, Jayant Yadav, Dominic Drakes, Darshan Nalkande, Yash Dayal, Alzarri Joseph, Pradeep Sangwan, David Miller, Wriddhiman Saha, Matthew Wade, Varun Aaron, B Sai Sudharshan. Where and how to watch live coverage of the IPL 2022 match between SunRisers Hyderabad vs Gujarat Titans? The IPL 2022 match between SunRisers Hyderabad vs Gujarat Titans will be aired live on Star Sports channels - Star Sports 1, Star Sports 1 HD, Star Sports 3, and Star Sports 3 HD.","image_url":null,"source_id":"sportstar","country":["india"],"category":["sports"],"language":"english"},{"title":"Cricket-South Africa&#039;s Elgar delighted with test side&#039;s rapid improvement","link":"https://www.thestar.com.my/sport/cricket/2022/04/11/cricket-south-africa039s-elgar-delighted-with-test-side039s-rapid-improvement","keywords":null,"creator":null,"video_url":null,"description":"GQEBERHA, South Africa (Reuters) - South Africa test captain Dean Elgar believes his team have improved beyond most expectations after they completed a comfortable 2-0 home series win over Bangladesh that was played without six of their first team regulars. Read full story","content":null,"pubDate":"2022-04-11 11:28:00","full_description":"GQEBERHA, South Africa (Reuters) - South Africa test captain Dean Elgar believes his team have improved beyond most expectations after they completed a comfortable 2-0 home series win over Bangladesh that was played without six of their first team regulars. The side recently beat India 2-1 at home and also played to a 1-1 draw in New Zealand to record five wins from seven matches over the season, five of which were played against the two teams that contested the Test World Championship final last year. \"Not a lot of people would have given us those kind of stats at the start of the season, but it is great to have the numbers on our side. There is a lot of behind the scenes work that went into this,\" Elgar told reporters after South Africa's 332-run win over Bangladesh at St George’s Park on Monday. \"We are on the right path and doing things in the correct way. I'm extremely proud of the test summer and the depth we have shown with regards to our selection pool, giving guys an opportunity so they can see what test cricket is all about.\" The hosts had six players who opted to feature in the lucrative Indian Premier League over the Bangladesh series, and Elgar made it clear it was not certain all would return. They include batsmen Aiden Markram and Rassie van der Dussen, and the pace quartet of Kagiso Rabada, Anrich Nortje, Lungi Ngidi and Marco Jansen. \"I can’t speak if those guys are going to be selected again, that is out of my hands. I can’t speak right now of combinations going forward,\" he said. \"It is a great headache to have. You always want more options than none, and just by giving guys experience you create a lot more depth going forward. Our test side is in a very healthy position.\" He admitted to concerns over the batting department, which managed only two centuries all summer, both coming in the second test against New Zealand via Sarel Erwee and Kyle Verreynne. \"We need to notch up a few more hundreds. We know how much pressure you put on the opposition if you do that. Our batting is probably the one negative area. We are aware of it and are working bloody hard.\" South Africa next tour England from July to September and will also visit Australia over the New Year. (Reporting by Nick Said; Editing by Ken Ferris)","image_url":"https://apicms.thestar.com.my/uploads/images/2022/04/11/1547189.jpg","source_id":"thestar_my","country":["malaysia"],"category":["sports"],"language":"english"}]}