{"newsArray":[{"title":"FIFA delegation meets ZIFA board","link":"https://www.herald.co.zw/fifa-delegation-meets-zifa-board/","keywords":["Sport"],"creator":["The Herald"],"video_url":null,"description":"THE visiting FIFA delegation is today expected to meet the ZIFA board comprising the current and ousted members fronted by Felton Kamambo as part of their fact-finding mission in Zimbabwe.","content":"THE visiting FIFA delegation is today expected to meet the ZIFA board comprising the current and ousted members fronted by Felton Kamambo as part of their fact-finding mission in Zimbabwe. The meeting which could have taken place earlier this week, failed to take off after it was noted that some of the members including Gift Banda, who is the acting ZIFA president, and Sugar Chagonda were not in attendance. FIFA senior member associations governance manager Sarah Solemale and FIFA head of development programmes in Africa Solomon Mudege — a Zimbabwean based at the FIFA headquarters in Zurich — have held marathon meetings with football stakeholders since they arrived in the country early this week. CAF director of member associations Sarah Mukuna and COSAFA president Artur de Almeida de Silva were also expected yesterday along with Football Association of Malawi president Walter Nyamilandu and Botswana Football Federation president Maclean Letshwiti. The FIFA delegation apparently wanted to meet all the elected members of the board from the December 2018 ballot and an objection was raised before the discussions could take off. “Some of the board members raised the objection. They argued that the board was not complete without some of the members. There is a clique led by Kamambo that had wanted to sideline some of the key witnesses,” said a source. The FIFA delegation has since met with the Premier Soccer League and the Zimbabwe Women’s Soccer League. “So far these guys have been shocked by what they heard from the submissions. The FIFA guys had hoped to persuade the PSL clubs to push for the reinstatement of the ousted board members. “But they could be forced to have a rethink if they came here with a position. The PSL clubs were blunt about the transgressions of the ousted board members and they indicated reinstatement was a non-starter. “The Women’s Football League also did the same. They complained about their funds from FIFA which did not reach their constituency and the general lack of support for the women’s game. “What the FIFA guys had in their minds and what they are finding on the ground is totally different.” The FIFA emissaries were reluctant to comment on their visit and they are expected to have more meetings with football stakeholders to gather more information on the football crisis in Zimbabwe. The Sports and Recreation Commission were the first to meet the visiting delegation. Sports Commission chairman Gerald Mlotshwa was confident solutions to the issues bedeviling Zimbabwean football administration could be found sooner than had been expected. Mlotshwa said the visit was crucial to put the Zimbabwe situation, which is now a complicated subject, into the correct perspective. “As you know, we have invited FIFA to come through on a fact-finding mission just so they can see things on the ground for themselves, rather than relying on third party reporting and that sort of thing, which (coming to Zimbabwe) they have done and which we are thankful for,” said Mlotshwa. “They have engaged us. We had a very fruitful meeting. We had a very positive meeting. The CAF delegation unfortunately didn’t manage to make this meeting but we are meeting them on Thursday and there will be further updates coming from that. But everything is quite positive, let’s put it that way. “I think it means that both sides are committed to finding a solution to the problems bedeviling football in this country. “It’s always a good thing when people are communicating and are meeting especially physically like this because there’s then a lot of clarity on issues that may not have been clear before,” said Mlotshwa. The ZIFA Congress, the Footballers Union of Zimbabwe and the supporters’ bodies are also interested in giving their input. Mlotshwa indicated the visitors will reach out to as many people as they could during their short stay in Zimbabwe. Zimbabwe’s membership rights at FIFA were suspended last year in February after the world football governing body ruled that the intervention by the Sports Commission to suspend the ZIFA board pending investigations into various allegations of corruption and mismanagement constituted third party interference. The ZIFA board was suspended in November 2021 and three months later FIFA descended on Zimbabwe. Currently, a lot of toxicity currently permeates the landscape. The visit by FIFA representatives has put paid to the narrative being peddled by ousted ZIFA executives that include Kamambo, Philemon Machana, Bryton Malandule and ex-chief executive officer Joseph Mamutse, that FIFA were not prepared to engage with anyone other than the quartet. The quartet was kicked out of football by the ZIFA Congress via a vote of no confidence last year and have been fighting tooth and nail to find their way back, despite the serious allegations of corruption and sexual abuse of female referees hanging on their necks. All the same, the four-year term of Kamambo’s presidency expired on December 17, 2022. But they will get their opportunity with the visiting FIFA representative, to tell their side of the story. DYNAMOS head coach Herbert “Jompano” Maruwa is beginning to get worried with his blunt strikeforce. ZIMBABWEAN batsman Gary Ballance has announced his retirement from all forms of cricket with immediate effect, just four months after he had switched allegiance from England to represent the country of his birth. BARCELONA. — Barcelona would not be able to resign Lionel Messi from Paris Saint-Germain in their current financial situation, LaLiga president Javier Tebas said yesterday.","pubDate":"2023-04-19 22:04:52","image_url":null,"source_id":"herald_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"Ballance drops retirement bombshell","link":"https://www.herald.co.zw/ballance-drops-retirement-bombshell/","keywords":["Sport"],"creator":["The Herald"],"video_url":null,"description":"ZIMBABWEAN batsman Gary Ballance has announced his retirement from all forms of cricket with immediate effect, just four months after he had switched allegiance from England to represent the country of his birth.","content":"ZIMBABWEAN batsman Gary Ballance has announced his retirement from all forms of cricket with immediate effect, just four months after he had switched allegiance from England to represent the country of his birth. Ballance, the former Yorkshire and England cricketer, who recently relaunched his career with his native Zimbabwe, announced the decision released through Professional Cricketers’ Association yesterday. “After much thought, I have decided to retire from all forms of professional cricket with immediate effect,” he said in a statement. “I had hoped my move to Zimbabwe would provide me with a new-found happiness for the game and I will always be thankful to Zimbabwe Cricket for providing me with an opportunity to return to international cricket and welcoming me into their team. “However, I have reached the stage where I no longer have the desire to dedicate myself to the rigours of professional sport and this would do Zimbabwe Cricket and the game itself a disservice, should I carry on. I wish them every success going forward. “I have been fortunate to have some incredibly memorable moments in cricket, winning County Championships with Yorkshire and gaining the ultimate honour of representing England and Zimbabwe. “I want to thank all of my clubs, coaches, support staff, teammates and supporters for their guidance and encouragement over my career, it has been a privilege. “It is now time for me to move on to the next chapter of my life. I will be making no further comments on my decision at this time.” His move back to Zimbabwe — whom he had represented at Under-19 level prior to his England call-up — had been a bid for a fresh start, and it was initially a successful one too. He signed a two-year contract with ZC in December and played a total of eight international matches between January and March, including a one-off Test against West Indies in Bulawayo in which he scored a memorable 137 not out. The feat made him only the second Test cricketer to score centuries for two different nations, after Kepler Wessels, the former Australia batter and South Africa captain. However, after signing off with an unbeaten 64 to seal last month’s ODI series against the Netherlands, Ballance has now decided to call time on his relaunched career. The 33-year-old made four centuries in 23 Test appearances for England between 2014 and 2017, a record that compared favourably with many other players to have debuted in a similar period. However, he was heavily implicated in Azeem Rafiq’s explosive testimony during the DCMS parliamentary hearings in Westminster last November, after his use of the racial slur “P**i” had been deemed to be “banter” in the initial report into allegations of institutional racism at Yorkshire. His career within English cricket ended amid the controversy, and after several months of open-ended leave on mental health grounds, Yorkshire released him from his contract at the end of the 2022 season, shortly after he was charged by the Cricket Discipline Commission alongside six other Yorkshire cricketers, including Michael Vaughan (who was subsequently cleared) and Matthew Hoggard. He retires with a total of 1653 runs at 40.31 from his 24 Tests, and 12031 first-class runs at 47.74 all told, including 42 centuries and a further eight in List A cricket. — Sports Reporter/Cricinfo. DYNAMOS head coach Herbert “Jompano” Maruwa is beginning to get worried with his blunt strikeforce. THE visiting FIFA delegation is today expected to meet the ZIFA board comprising the current and ousted members fronted by Felton Kamambo as part of their fact-finding mission in Zimbabwe. BARCELONA. — Barcelona would not be able to resign Lionel Messi from Paris Saint-Germain in their current financial situation, LaLiga president Javier Tebas said yesterday.","pubDate":"2023-04-19 22:04:49","image_url":null,"source_id":"herald_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"Gary Ballance dumps Chevrons at 11th hour","link":"https://www.chronicle.co.zw/gary-ballance-dumps-chevrons-at-11th-hour/","keywords":["Sport"],"creator":["Chronicle Editor"],"video_url":null,"description":"Brandon Moyo brandonmalvin9@gmail.com WITH just over two months left before the start of the 2023 International Cricket Council (ICC) Men’s World Cup Qualifier on Zimbabwean soil, Gary Ballance has dropped a bombshell by announcing his retirement from all forms of professional cricket. The 33-year-old former England and Yorkshire batsman signed a two-year contract with Zimbabwe […]","content":"The Chronicle WITH just over two months left before the start of the 2023 International Cricket Council (ICC) Men’s World Cup Qualifier on Zimbabwean soil, Gary Ballance has dropped a bombshell by announcing his retirement from all forms of professional cricket. The 33-year-old former England and Yorkshire batsman signed a two-year contract with Zimbabwe Cricket (ZC) in December after switching allegiance from England. Zimbabwe who are hoping to qualify for the ICC Cricket World Cup to be held in India at the end of this year, expected to use Ballance’s experience. In his retirement statement which was released by the Professional Cricketers Association (PCA) on his behalf yesterday, Ballance said his decision had come after much thought. “After much thought, I have decided to retire from all forms of professional cricket with immediate effect. I had hoped my move to Zimbabwe would provide me with a new-found happiness for the game. I will always be thankful to Zimbabwe Cricket for providing me with an opportunity to return to international cricket and welcoming me into their team. However, I have reached the stage where I no longer have the desire to dedicate myself to the rigours of professional sport and this would do Zimbabwe Cricket and the game itself a disservice should I carry on. I wish them every success going forward,” said Ballance. He said he had been fortunate to have some incredibly memorable moments in cricket, winning County Championships with Yorkshire and gaining the ultimate honour of representing England and Zimbabwe. “I want to thank all of my clubs, coaches, support staff, teammates and supporters for their guidance and encouragement over my career, it has been a privilege. It is now time for me to move on to the next chapter of my life. I will be making no further comments on my decision at this time,” read the statement. Ballance made his Chevrons debut in January in a T20I series against Ireland that was played at Harare Sports Club which became his first and last international 20-over match. In just his second One Day International (ODI) match for Zimbabwe, the country of his birth, he scored his maiden half century. He made 52 runs for Dave Houghton’s side in a series that ended 1-1. He also scored another unbeaten half century in what has turned out to be his final match for Zimbabwe on 25 March against Netherlands. He made 64 runs as Zimbabwe put up a brilliant performance to win the series 2-1 after a dismal start. Ballance, who was a known longer-version specialist, made history in the only Test he played for Zimbabwe. He notched up a century to remove the Chevrons from the jaws of defeat in February this year when playing against the West Indies at Queens Sports Club in Bulawayo. Ballance became the second player in the history of the game after Kepler Wessels to score a century for two different countries after he compiled an unbeaten 137 runs. Wessels notched up centuries for Australia and South Africa. He also joined an elite group of Zimbabweans to score centuries on Test debut. Houghton and Hamilton Masakadza are the only two Chevrons stars to have managed that feat. In total, Ballance played a total of 24 Test matches, racking up 1 653 runs and a high score of 156 runs at an average of 40, 31. In ODIs, he played 21 matches, scored 454 runs with a high score of 79 at an average of 25. 22 while in the shortest version of the game, he scored 30 runs in one match. In first-class cricket, Ballance amassed 12 031 runs from 171 matches and 278 innings with a high score of 210 runs at an average of 47.74 while in List A, he played 124 matches, scored 4 697 runs with a best of 156 runs with an average of 47.44. He also played 107 T20 matches, scored 1 952 runs at an average of 23.51, his best in this format being 79 runs. ZC is yet to release a statement on Ballance’s retirement. — @brandon_malvin","pubDate":"2023-04-19 22:03:04","image_url":null,"source_id":"chronicle_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"Barca unable to sign Messi for now","link":"https://www.herald.co.zw/barca-unable-to-sign-messi-for-now/","keywords":["Sport"],"creator":["The Herald"],"video_url":null,"description":"BARCELONA. — Barcelona would not be able to resign Lionel Messi from Paris Saint-Germain in their current financial situation, LaLiga president Javier Tebas said yesterday.","content":"Barcelona would not be able to resign Lionel Messi from Paris Saint-Germain in their current financial situation, LaLiga president Javier Tebas said yesterday. Messi, 35, is expected to leave PSG at the end of the season and has been heavily linked with a return to the Camp Nou, with Barca striker Robert Lewandowski saying he hopes to play with him next term. The seven-time Ballon d’Or winner left Barcelona in 2021 as the Catalan giants struggled financially. “Today, he could not (be registered in LaLiga), but there is still time,” Tebas told a press conference. “We’re not going to change the rules of financial control approved by the clubs to register Messi… even if it would be our wish that he returns to our league.” Tebas said Barcelona could potentially balance the books enough by selling players. Daily Mundo Deportivo reported yesterday that Barca have a “firm intention of bringing in Lionel Messi” this summer on a two-year deal. Messi has struggled to reproduce his best form in Paris, scoring 31 goals in 69 appearances, and was booed by PSG fans earlier this month. DYNAMOS head coach Herbert “Jompano” Maruwa is beginning to get worried with his blunt strikeforce. THE visiting FIFA delegation is today expected to meet the ZIFA board comprising the current and ousted members fronted by Felton Kamambo as part of their fact-finding mission in Zimbabwe. ZIMBABWEAN batsman Gary Ballance has announced his retirement from all forms of cricket with immediate effect, just four months after he had switched allegiance from England to represent the country of his birth.","pubDate":"2023-04-19 22:02:59","image_url":null,"source_id":"herald_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"Lady Chevrons lose series opener against Thailand","link":"https://www.chronicle.co.zw/lady-chevrons-lose-series-opener-against-thailand/","keywords":["Sport"],"creator":["Chronicle Editor"],"video_url":null,"description":"Brandon Moyo brandonmalvin9@gmail.com WOEFUL batting saw the Zimbabwe senior women’s cricket suffer defeat by 78 runs in their opening encounter of the three match One Day International (ODI) cricket series against Thailand at Terdthai Cricket Ground in Bangkok, Thailand yesterday. After being asked to field first and losing the toss, the Gary Brent-coached Lady Chevrons […]","content":"The Chronicle WOEFUL batting saw the Zimbabwe senior women’s cricket suffer defeat by 78 runs in their opening encounter of the three match One Day International (ODI) cricket series against Thailand at Terdthai Cricket Ground in Bangkok, Thailand yesterday. After being asked to field first and losing the toss, the Gary Brent-coached Lady Chevrons bowled out the hosts for 154 runs in 43 overs before going on to struggle with the bat as they were wiped out for just 76 runs in 24.1 overs. Teenage sensation, Kelis Ndhlovu once again put up a stellar performance with the ball for Zimbabwe after taking her maiden ODI five wicket haul. She finished with the figures of 5/22 in nine overs while all-rounder, Josephine Nkomo took three scalps for 29 runs in her seven over spell. The other two wickets that fell were taken by Nomvelo Sibanda and Precious Marange who gave away 14 and 31 runs respectively, both in seven overs. Thailand skipper, Naruemol Chaiwai top scored for the hosts with an unbeaten 57 runs off 104 deliveries while Nattaya Boochatham fell for 25 runs from 50 balls. Their third leading run getter was Phannita Maya who contributed 17 runs having faced 24 balls. In their chase, Zimbabwe lost an early wicket of Ndhlovu in the fifth over for five runs off 16 balls. Her opening partner, Sharne Mayers went on to be the team’s leading run getter on the match with a run a ball 24 runs from while Chipo Mugeri-Tiripano fell for 18 runs off 34 deliveries. Two more Lady Chevrons batters, Ashley Ndiraya and Precious Marange managed to cross double figures, scoring 11 and 10 runs respectively. After Ndhlovu’s splendid performance with the ball, Thailand’s Thipatcha Putthawong came out guns blazing to rip through Zimbabwe’s batting order. She finished with the best bowling figures of 6/6 in 6.1 overs. Suleeporn took two scalps for 13 runs in three overs while Maya and Boochatham took one each to round up Zimbabwe’s innings and start off the series on a high note. The match was Zimbabwe’s first international assignment of the year and they will be looking to bounce back in the upcoming matches. Brent does not have much time to rectify his team’s mistakes since the second match is scheduled to take place tomorrow while the last one is set Sunday before attention shifts to T20Is. — @brandon_malvin","pubDate":"2023-04-19 22:02:58","image_url":null,"source_id":"chronicle_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"Rashford back in training","link":"https://www.herald.co.zw/rashford-back-in-training/","keywords":["Sport"],"creator":["The Herald"],"video_url":null,"description":"LONDON. — Marcus Rashford has returned to training for Manchester United before the Europa League quarter-final second leg in Sevilla tonight.","content":"— Marcus Rashford has returned to training for Manchester United before the Europa League quarter-final second leg in Sevilla tonight. Rashford, 25, has not played since he sustained a groin injury during United’s home Premier League win against Everton on April 8. United had said the England striker, who has scored 31 goals this season, would “miss a few games”. Luke Shaw, Marcel Sabitzer and Tyrell Malacia also trained at Carrington. Rashford was unavailable for the first leg against Sevilla at Old Trafford, which United drew 2-2, as well as Sunday’s 2-0 win at Nottingham Forest. Sabitzer, who scored twice against Sevilla, was withdrawn from the starting line-up at the City Ground after picking up an injury in the warm-up, while Malacia also missed the trip with a knee problem. Shaw, meanwhile, has not played since he was substituted in United’s 1-0 win at home against Brentford on 5 April. Should he be fit to play, the England defender could provide much-needed cover at centre-back, with Lisandro Martinez ruled out for the season and Raphael Varane also picking up an injury against Forest. DYNAMOS head coach Herbert “Jompano” Maruwa is beginning to get worried with his blunt strikeforce. THE visiting FIFA delegation is today expected to meet the ZIFA board comprising the current and ousted members fronted by Felton Kamambo as part of their fact-finding mission in Zimbabwe. ZIMBABWEAN batsman Gary Ballance has announced his retirement from all forms of cricket with immediate effect, just four months after he had switched allegiance from England to represent the country of his birth.","pubDate":"2023-04-19 22:01:58","image_url":null,"source_id":"herald_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"Chelsea need strategy for turnaround – Silva","link":"https://www.herald.co.zw/chelsea-need-strategy-for-turnaround-silva/","keywords":["Sport"],"creator":["The Herald"],"video_url":null,"description":"LONDON. — Chelsea defender Thiago Silva says the club need to “stop and put a strategy in place” or risk another difficult campaign next season. Despite lavish transfer spending under new owner Todd Boehly, Chelsea are 11th in the Premier League and will end this season without a trophy after defeat by Real Madrid in the Champions League.","content":"Chelsea defender Thiago Silva says the club need to “stop and put a strategy in place” or risk another difficult campaign next season. Despite lavish transfer spending under new owner Todd Boehly, Chelsea are 11th in the Premier League and will end this season without a trophy after defeat by Real Madrid in the Champions League. “The manager can only pick 11 from 30-something. That’s tough,” said Silva. “There is always going to be someone upset because not everyone can play.” American investor Boehly and private equity firm Clearlake Capital completed a £4.25bn takeover of Chelsea in May 2022. They spent about £550m across the summer and winter transfer windows to amass a first-team squad of 30 players, but that has failed to translate into success on the pitch. Chelsea have sacked managers Thomas Tuchel and Graham Potter this season, while interim boss Frank Lampard has lost all four matches since taking over for a second spell this month. It means they are unlikely to qualify for Europe for only the second time in 25 seasons. “It’s a difficult moment for the club, with a lot of indecision,” added 38-year-old Silva. “We had to increase the size of the changing rooms because it didn’t fit the size of the team. “A positive point is that there are amazing players within the squad, but on the other hand there is always players that are going to be unhappy. “We need to stop and put a strategy in place, otherwise next season we could make the same mistakes.” Chelsea have reportedly held talks with ex-Bayern Munich boss Julian Nagelsmann as part of their search for a new manager with former Spain boss Luis Enrique also in the frame. “We keep pointing our fingers to the managers, but we need to look inside and see what we are doing wrong and try to change it,” Thiago said. “When you’re pointing at someone, you have three fingers pointing back to you. “So firstly, we need to look to what we’ve been doing wrong and play more as a team – because we don’t need a hero, we need heroes. “At the end of the season if we do what we’ve got to do, we’ll be able to at least finish it with dignity.” Former Chelsea striker Didier Drogba said he does not “recognise the club” compared with when he played at Stamford Bridge. Drogba won 12 major honours between 2004 and 2012 under previous owner Roman Abramovich, whose generous backing turned the Blues into serial trophy winners following his takeover in 2003. The 56-year-old was forced to sell the club last year after he was sanctioned by the UK government over alleged links to Russian president Vladimir Putin. “It is not the same club anymore,” Drogba, 45, told Canal+. “I don’t recognise my club. There is a new owner and a new vision. “We try to compare with what was done under the Abramovich era, where there were many acquisitions of players, but the choices were very intelligent. DYNAMOS head coach Herbert “Jompano” Maruwa is beginning to get worried with his blunt strikeforce. THE visiting FIFA delegation is today expected to meet the ZIFA board comprising the current and ousted members fronted by Felton Kamambo as part of their fact-finding mission in Zimbabwe. ZIMBABWEAN batsman Gary Ballance has announced his retirement from all forms of cricket with immediate effect, just four months after he had switched allegiance from England to represent the country of his birth.","pubDate":"2023-04-19 22:01:56","image_url":null,"source_id":"herald_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"Strydom to end Sunshine Tour season as a Major player","link":"https://www.herald.co.zw/strydom-to-end-sunshine-tour-season-as-a-major-player/","keywords":["Sport"],"creator":["The Herald"],"video_url":null,"description":"JOHANNESBURG. — Ockie Strydom started the current Sunshine Tour season as a player looking to make ampionship having done exactly this, with two DP World Tour wins and now Major Championship golf to look forward to as well.","content":"Ockie Strydom started the current Sunshine Tour season as a player looking to make ampionship having done exactly this, with two DP World Tour wins and now Major Championship golf to look forward to as well. Strydom goes into this week’s Sunshine Tour season-ending Tour Championship at Serengeti Estates as the top-ranked golfer on the Tour’s Luno Order of Merit. He cannot be caught this week so will end the season in first place. This brings with it Major incentives for Strydom, including a place in The Open at Royal Liverpool as well as the US PGA Championship at Oak Hill, the latter coming via the Federation Ranking on the Official World Golf Ranking. “I’m into two Majors at the moment, and I’m also hoping to get into the US Open through my ranking on the DP World Tour. So that could be three Majors this year, which would be a first for me. It’s challenging and exciting at the same time,” said Strydom. “I’m trying not to approach anything differently. It definitely sounds nice to say I’m playing in Majors, and it’s a word that changes the mindset. But I’ll try and approach them as just another golf tournament where I have the opportunity to play against the best players in the world.” Strydom’s first place on the final Luno Order of Merit will also secure him a spot in the Nedbank Golf Challenge later this year. So it’s a rewarding week for Strydom, and on a golf course that always brings out the best in his game. “It’s nice to be back here to finish off the Sunshine Tour season. I always play well on this course. I’m a more experienced golfer this year as well so hopefully it’s another good week for me.” The field this week includes Casey Jarvis, who should wrap-up the Rookie of the Year award. — DYNAMOS head coach Herbert “Jompano” Maruwa is beginning to get worried with his blunt strikeforce. THE visiting FIFA delegation is today expected to meet the ZIFA board comprising the current and ousted members fronted by Felton Kamambo as part of their fact-finding mission in Zimbabwe. ZIMBABWEAN batsman Gary Ballance has announced his retirement from all forms of cricket with immediate effect, just four months after he had switched allegiance from England to represent the country of his birth.","pubDate":"2023-04-19 22:01:52","image_url":null,"source_id":"herald_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"Gems aim to step up World Cup preps","link":"https://www.herald.co.zw/gems-aim-to-step-up-world-cup-preps/","keywords":["Sport"],"creator":["The Herald"],"video_url":null,"description":"AS the countdown to the 2023 Vitality Netball World Cup continues, Gems vice-captain Claris Kwaramba says they are making positive progress in their preparations.","content":"AS the countdown to the 2023 Vitality Netball World Cup continues, Gems vice-captain Claris Kwaramba says they are making positive progress in their preparations. Kwaramba said with the event getting closer by the day, they now need to step up their build-up as they approach the final stages of the preparations. Yesterday marked 100 days to go before the Vitality Netball World Cup 2023 roars into life in Cape Town, South Africa. “We no longer have much time to prepare. I think we are now supposed to be working on the final touches. We keep working and giving it our all. “Yes we are making progress. I think we are almost ready and I think we are left with just a few things to work on,” said Kwaramba. The senior national team just concluded a month-long camp in Harare this week and will be hoping to regroup soon to step up their preparations. Gems coach Ropafadzo Mutsauki described the recent camp as a success. “It was a very successful camp because I think we achieved our targets. We were concerned with our midfield but right now it’s looking promising. There were positives during this camp. “Looking at the foreign-based players we are expecting to join us, most of them are not mid-court players, they play defence and shooting. So for this camp we were working more on the mid-court because that’s where we were lacking. But we noticed some positive changes,” said Mutsauki. However, he emphasised the need for friendly games before they leave for South Africa. Zimbabwe will be among the 16 countries set to compete in the global event that is due to run from July 28 to August 6. The first stage of the tournament will commence on July 28 with teams competing in a round-robin format in the pools. Zimbabwe, drawn in Pool A, will face powerhouses Australia, Tonga and Fiji in the preliminary stages. Meanwhile, the Zimbabwe Netball Association are tomorrow expected to sign a partnership deal with Nedbank Zimbabwe for their journey to the 2023 World Cup. The official signing ceremony of the partnership is scheduled to take place at Stodart Netball Complex in Mbare. “The launch will take place on the 21st of April 2023 at Stodart Netball Complex in Mbare at 11:30am. Nedbank will be joining us on our journey to Cape town for the Netball World Cup as our main sponsor. “This signing ceremony with Nedbank marks the beginning of the journey to the epic games as we seek to qualify for round two, all the way to the finals,” said project manager Maimba Mapuranga. Zimbabwe will be making their second successive appearance at the tournament. DYNAMOS head coach Herbert “Jompano” Maruwa is beginning to get worried with his blunt strikeforce. THE visiting FIFA delegation is today expected to meet the ZIFA board comprising the current and ousted members fronted by Felton Kamambo as part of their fact-finding mission in Zimbabwe. ZIMBABWEAN batsman Gary Ballance has announced his retirement from all forms of cricket with immediate effect, just four months after he had switched allegiance from England to represent the country of his birth.","pubDate":"2023-04-19 22:01:51","image_url":null,"source_id":"herald_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"Raducanu thrashed by Ostapenko in Stuttgart","link":"https://www.herald.co.zw/raducanu-thrashed-by-ostapenko-in-stuttgart/","keywords":["Sport"],"creator":["The Herald"],"video_url":null,"description":"STUTTGART. — Emma Raducanu’s first clay-court match of the season ended in a one-sided defeat by former French Open champion Jelena Ostapenko in Stuttgart.","content":"Emma Raducanu’s first clay-court match of the season ended in a one-sided defeat by former French Open champion Jelena Ostapenko in Stuttgart. The British number one struggled to deal with ferocious hitting from the Latvian and lost 6-2 6-1 in 59 minutes. Having reached the quarter-finals of the event last year, Raducanu’s exit means she will drop down the rankings from her current place of 68. Ostapenko will play Tunisia’s third seed Ons Jabeur in the last 16. Raducanu skipped Great Britain’s Billie Jean King Cup defeat to France last week to prepare for the clay-court swing but was completely outplayed after being given a tough opening draw. The 2021 US Open champion won the first game but was overpowered by her opponent’s heavy hitting as she lost the next five on the way to giving up the opening set. Having held serve at the start of the second, Raducanu moved to 0-30 on the 2017 French Open winner’s serve but from there Ostapenko won 16 points in a row to ease into a 4-1 lead. The 2017 French open champion hit 26 winners to Raducanu’s six. Elsewhere, Spain’s world number 31 Paula Badosa thrashed seventh seed Daria Kasatkina 6-1 6-1. At the Barcelona Open, men’s world number two Carlos Alcaraz, who lost the top ranking to Novak Djokovic after going out of the Miami Open in the semi-finals, opened his clay-court campaign with a comfortable 6-3 6-1 win over Portugal’s Nuno Borges. But American fifth seed Frances Tiafoe was beaten 4-6 7-6 (7-3) 4-6 by world number 40 Emil Ruusuvuori of Finland. Norwegian third seed Casper Ruud, last year’s French Open finalist, beat American Ben Shelton 6-2 7-6 (7-1). — DYNAMOS head coach Herbert “Jompano” Maruwa is beginning to get worried with his blunt strikeforce. THE visiting FIFA delegation is today expected to meet the ZIFA board comprising the current and ousted members fronted by Felton Kamambo as part of their fact-finding mission in Zimbabwe. ZIMBABWEAN batsman Gary Ballance has announced his retirement from all forms of cricket with immediate effect, just four months after he had switched allegiance from England to represent the country of his birth.","pubDate":"2023-04-19 22:01:49","image_url":null,"source_id":"herald_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"FIFA delegation meets ZIFA board","link":"https://www.herald.co.zw/fifa-delegation-meets-zifa-board/","keywords":["Sport"],"creator":["The Herald"],"video_url":null,"description":"THE visiting FIFA delegation is today expected to meet the ZIFA board comprising the current and ousted members fronted by Felton Kamambo as part of their fact-finding mission in Zimbabwe.","content":"THE visiting FIFA delegation is today expected to meet the ZIFA board comprising the current and ousted members fronted by Felton Kamambo as part of their fact-finding mission in Zimbabwe. The meeting which could have taken place earlier this week, failed to take off after it was noted that some of the members including Gift Banda, who is the acting ZIFA president, and Sugar Chagonda were not in attendance. FIFA senior member associations governance manager Sarah Solemale and FIFA head of development programmes in Africa Solomon Mudege — a Zimbabwean based at the FIFA headquarters in Zurich — have held marathon meetings with football stakeholders since they arrived in the country early this week. CAF director of member associations Sarah Mukuna and COSAFA president Artur de Almeida de Silva were also expected yesterday along with Football Association of Malawi president Walter Nyamilandu and Botswana Football Federation president Maclean Letshwiti. The FIFA delegation apparently wanted to meet all the elected members of the board from the December 2018 ballot and an objection was raised before the discussions could take off. “Some of the board members raised the objection. They argued that the board was not complete without some of the members. There is a clique led by Kamambo that had wanted to sideline some of the key witnesses,” said a source. The FIFA delegation has since met with the Premier Soccer League and the Zimbabwe Women’s Soccer League. “So far these guys have been shocked by what they heard from the submissions. The FIFA guys had hoped to persuade the PSL clubs to push for the reinstatement of the ousted board members. “But they could be forced to have a rethink if they came here with a position. The PSL clubs were blunt about the transgressions of the ousted board members and they indicated reinstatement was a non-starter. “The Women’s Football League also did the same. They complained about their funds from FIFA which did not reach their constituency and the general lack of support for the women’s game. “What the FIFA guys had in their minds and what they are finding on the ground is totally different.” The FIFA emissaries were reluctant to comment on their visit and they are expected to have more meetings with football stakeholders to gather more information on the football crisis in Zimbabwe. The Sports and Recreation Commission were the first to meet the visiting delegation. Sports Commission chairman Gerald Mlotshwa was confident solutions to the issues bedeviling Zimbabwean football administration could be found sooner than had been expected. Mlotshwa said the visit was crucial to put the Zimbabwe situation, which is now a complicated subject, into the correct perspective. “As you know, we have invited FIFA to come through on a fact-finding mission just so they can see things on the ground for themselves, rather than relying on third party reporting and that sort of thing, which (coming to Zimbabwe) they have done and which we are thankful for,” said Mlotshwa. “They have engaged us. We had a very fruitful meeting. We had a very positive meeting. The CAF delegation unfortunately didn’t manage to make this meeting but we are meeting them on Thursday and there will be further updates coming from that. But everything is quite positive, let’s put it that way. “I think it means that both sides are committed to finding a solution to the problems bedeviling football in this country. “It’s always a good thing when people are communicating and are meeting especially physically like this because there’s then a lot of clarity on issues that may not have been clear before,” said Mlotshwa. The ZIFA Congress, the Footballers Union of Zimbabwe and the supporters’ bodies are also interested in giving their input. Mlotshwa indicated the visitors will reach out to as many people as they could during their short stay in Zimbabwe. Zimbabwe’s membership rights at FIFA were suspended last year in February after the world football governing body ruled that the intervention by the Sports Commission to suspend the ZIFA board pending investigations into various allegations of corruption and mismanagement constituted third party interference. The ZIFA board was suspended in November 2021 and three months later FIFA descended on Zimbabwe. Currently, a lot of toxicity currently permeates the landscape. The visit by FIFA representatives has put paid to the narrative being peddled by ousted ZIFA executives that include Kamambo, Philemon Machana, Bryton Malandule and ex-chief executive officer Joseph Mamutse, that FIFA were not prepared to engage with anyone other than the quartet. The quartet was kicked out of football by the ZIFA Congress via a vote of no confidence last year and have been fighting tooth and nail to find their way back, despite the serious allegations of corruption and sexual abuse of female referees hanging on their necks. All the same, the four-year term of Kamambo’s presidency expired on December 17, 2022. But they will get their opportunity with the visiting FIFA representative, to tell their side of the story. DYNAMOS head coach Herbert “Jompano” Maruwa is beginning to get worried with his blunt strikeforce. ZIMBABWEAN batsman Gary Ballance has announced his retirement from all forms of cricket with immediate effect, just four months after he had switched allegiance from England to represent the country of his birth. BARCELONA. — Barcelona would not be able to resign Lionel Messi from Paris Saint-Germain in their current financial situation, LaLiga president Javier Tebas said yesterday.","pubDate":"2023-04-19 22:04:52","image_url":null,"source_id":"herald_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"Ballance drops retirement bombshell","link":"https://www.herald.co.zw/ballance-drops-retirement-bombshell/","keywords":["Sport"],"creator":["The Herald"],"video_url":null,"description":"ZIMBABWEAN batsman Gary Ballance has announced his retirement from all forms of cricket with immediate effect, just four months after he had switched allegiance from England to represent the country of his birth.","content":"ZIMBABWEAN batsman Gary Ballance has announced his retirement from all forms of cricket with immediate effect, just four months after he had switched allegiance from England to represent the country of his birth. Ballance, the former Yorkshire and England cricketer, who recently relaunched his career with his native Zimbabwe, announced the decision released through Professional Cricketers’ Association yesterday. “After much thought, I have decided to retire from all forms of professional cricket with immediate effect,” he said in a statement. “I had hoped my move to Zimbabwe would provide me with a new-found happiness for the game and I will always be thankful to Zimbabwe Cricket for providing me with an opportunity to return to international cricket and welcoming me into their team. “However, I have reached the stage where I no longer have the desire to dedicate myself to the rigours of professional sport and this would do Zimbabwe Cricket and the game itself a disservice, should I carry on. I wish them every success going forward. “I have been fortunate to have some incredibly memorable moments in cricket, winning County Championships with Yorkshire and gaining the ultimate honour of representing England and Zimbabwe. “I want to thank all of my clubs, coaches, support staff, teammates and supporters for their guidance and encouragement over my career, it has been a privilege. “It is now time for me to move on to the next chapter of my life. I will be making no further comments on my decision at this time.” His move back to Zimbabwe — whom he had represented at Under-19 level prior to his England call-up — had been a bid for a fresh start, and it was initially a successful one too. He signed a two-year contract with ZC in December and played a total of eight international matches between January and March, including a one-off Test against West Indies in Bulawayo in which he scored a memorable 137 not out. The feat made him only the second Test cricketer to score centuries for two different nations, after Kepler Wessels, the former Australia batter and South Africa captain. However, after signing off with an unbeaten 64 to seal last month’s ODI series against the Netherlands, Ballance has now decided to call time on his relaunched career. The 33-year-old made four centuries in 23 Test appearances for England between 2014 and 2017, a record that compared favourably with many other players to have debuted in a similar period. However, he was heavily implicated in Azeem Rafiq’s explosive testimony during the DCMS parliamentary hearings in Westminster last November, after his use of the racial slur “P**i” had been deemed to be “banter” in the initial report into allegations of institutional racism at Yorkshire. His career within English cricket ended amid the controversy, and after several months of open-ended leave on mental health grounds, Yorkshire released him from his contract at the end of the 2022 season, shortly after he was charged by the Cricket Discipline Commission alongside six other Yorkshire cricketers, including Michael Vaughan (who was subsequently cleared) and Matthew Hoggard. He retires with a total of 1653 runs at 40.31 from his 24 Tests, and 12031 first-class runs at 47.74 all told, including 42 centuries and a further eight in List A cricket. — Sports Reporter/Cricinfo. DYNAMOS head coach Herbert “Jompano” Maruwa is beginning to get worried with his blunt strikeforce. THE visiting FIFA delegation is today expected to meet the ZIFA board comprising the current and ousted members fronted by Felton Kamambo as part of their fact-finding mission in Zimbabwe. BARCELONA. — Barcelona would not be able to resign Lionel Messi from Paris Saint-Germain in their current financial situation, LaLiga president Javier Tebas said yesterday.","pubDate":"2023-04-19 22:04:49","image_url":null,"source_id":"herald_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"Gary Ballance dumps Chevrons at 11th hour","link":"https://www.chronicle.co.zw/gary-ballance-dumps-chevrons-at-11th-hour/","keywords":["Sport"],"creator":["Chronicle Editor"],"video_url":null,"description":"Brandon Moyo brandonmalvin9@gmail.com WITH just over two months left before the start of the 2023 International Cricket Council (ICC) Men’s World Cup Qualifier on Zimbabwean soil, Gary Ballance has dropped a bombshell by announcing his retirement from all forms of professional cricket. The 33-year-old former England and Yorkshire batsman signed a two-year contract with Zimbabwe […]","content":"The Chronicle WITH just over two months left before the start of the 2023 International Cricket Council (ICC) Men’s World Cup Qualifier on Zimbabwean soil, Gary Ballance has dropped a bombshell by announcing his retirement from all forms of professional cricket. The 33-year-old former England and Yorkshire batsman signed a two-year contract with Zimbabwe Cricket (ZC) in December after switching allegiance from England. Zimbabwe who are hoping to qualify for the ICC Cricket World Cup to be held in India at the end of this year, expected to use Ballance’s experience. In his retirement statement which was released by the Professional Cricketers Association (PCA) on his behalf yesterday, Ballance said his decision had come after much thought. “After much thought, I have decided to retire from all forms of professional cricket with immediate effect. I had hoped my move to Zimbabwe would provide me with a new-found happiness for the game. I will always be thankful to Zimbabwe Cricket for providing me with an opportunity to return to international cricket and welcoming me into their team. However, I have reached the stage where I no longer have the desire to dedicate myself to the rigours of professional sport and this would do Zimbabwe Cricket and the game itself a disservice should I carry on. I wish them every success going forward,” said Ballance. He said he had been fortunate to have some incredibly memorable moments in cricket, winning County Championships with Yorkshire and gaining the ultimate honour of representing England and Zimbabwe. “I want to thank all of my clubs, coaches, support staff, teammates and supporters for their guidance and encouragement over my career, it has been a privilege. It is now time for me to move on to the next chapter of my life. I will be making no further comments on my decision at this time,” read the statement. Ballance made his Chevrons debut in January in a T20I series against Ireland that was played at Harare Sports Club which became his first and last international 20-over match. In just his second One Day International (ODI) match for Zimbabwe, the country of his birth, he scored his maiden half century. He made 52 runs for Dave Houghton’s side in a series that ended 1-1. He also scored another unbeaten half century in what has turned out to be his final match for Zimbabwe on 25 March against Netherlands. He made 64 runs as Zimbabwe put up a brilliant performance to win the series 2-1 after a dismal start. Ballance, who was a known longer-version specialist, made history in the only Test he played for Zimbabwe. He notched up a century to remove the Chevrons from the jaws of defeat in February this year when playing against the West Indies at Queens Sports Club in Bulawayo. Ballance became the second player in the history of the game after Kepler Wessels to score a century for two different countries after he compiled an unbeaten 137 runs. Wessels notched up centuries for Australia and South Africa. He also joined an elite group of Zimbabweans to score centuries on Test debut. Houghton and Hamilton Masakadza are the only two Chevrons stars to have managed that feat. In total, Ballance played a total of 24 Test matches, racking up 1 653 runs and a high score of 156 runs at an average of 40, 31. In ODIs, he played 21 matches, scored 454 runs with a high score of 79 at an average of 25. 22 while in the shortest version of the game, he scored 30 runs in one match. In first-class cricket, Ballance amassed 12 031 runs from 171 matches and 278 innings with a high score of 210 runs at an average of 47.74 while in List A, he played 124 matches, scored 4 697 runs with a best of 156 runs with an average of 47.44. He also played 107 T20 matches, scored 1 952 runs at an average of 23.51, his best in this format being 79 runs. ZC is yet to release a statement on Ballance’s retirement. — @brandon_malvin","pubDate":"2023-04-19 22:03:04","image_url":null,"source_id":"chronicle_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"Barca unable to sign Messi for now","link":"https://www.herald.co.zw/barca-unable-to-sign-messi-for-now/","keywords":["Sport"],"creator":["The Herald"],"video_url":null,"description":"BARCELONA. — Barcelona would not be able to resign Lionel Messi from Paris Saint-Germain in their current financial situation, LaLiga president Javier Tebas said yesterday.","content":"Barcelona would not be able to resign Lionel Messi from Paris Saint-Germain in their current financial situation, LaLiga president Javier Tebas said yesterday. Messi, 35, is expected to leave PSG at the end of the season and has been heavily linked with a return to the Camp Nou, with Barca striker Robert Lewandowski saying he hopes to play with him next term. The seven-time Ballon d’Or winner left Barcelona in 2021 as the Catalan giants struggled financially. “Today, he could not (be registered in LaLiga), but there is still time,” Tebas told a press conference. “We’re not going to change the rules of financial control approved by the clubs to register Messi… even if it would be our wish that he returns to our league.” Tebas said Barcelona could potentially balance the books enough by selling players. Daily Mundo Deportivo reported yesterday that Barca have a “firm intention of bringing in Lionel Messi” this summer on a two-year deal. Messi has struggled to reproduce his best form in Paris, scoring 31 goals in 69 appearances, and was booed by PSG fans earlier this month. DYNAMOS head coach Herbert “Jompano” Maruwa is beginning to get worried with his blunt strikeforce. THE visiting FIFA delegation is today expected to meet the ZIFA board comprising the current and ousted members fronted by Felton Kamambo as part of their fact-finding mission in Zimbabwe. ZIMBABWEAN batsman Gary Ballance has announced his retirement from all forms of cricket with immediate effect, just four months after he had switched allegiance from England to represent the country of his birth.","pubDate":"2023-04-19 22:02:59","image_url":null,"source_id":"herald_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"Lady Chevrons lose series opener against Thailand","link":"https://www.chronicle.co.zw/lady-chevrons-lose-series-opener-against-thailand/","keywords":["Sport"],"creator":["Chronicle Editor"],"video_url":null,"description":"Brandon Moyo brandonmalvin9@gmail.com WOEFUL batting saw the Zimbabwe senior women’s cricket suffer defeat by 78 runs in their opening encounter of the three match One Day International (ODI) cricket series against Thailand at Terdthai Cricket Ground in Bangkok, Thailand yesterday. After being asked to field first and losing the toss, the Gary Brent-coached Lady Chevrons […]","content":"The Chronicle WOEFUL batting saw the Zimbabwe senior women’s cricket suffer defeat by 78 runs in their opening encounter of the three match One Day International (ODI) cricket series against Thailand at Terdthai Cricket Ground in Bangkok, Thailand yesterday. After being asked to field first and losing the toss, the Gary Brent-coached Lady Chevrons bowled out the hosts for 154 runs in 43 overs before going on to struggle with the bat as they were wiped out for just 76 runs in 24.1 overs. Teenage sensation, Kelis Ndhlovu once again put up a stellar performance with the ball for Zimbabwe after taking her maiden ODI five wicket haul. She finished with the figures of 5/22 in nine overs while all-rounder, Josephine Nkomo took three scalps for 29 runs in her seven over spell. The other two wickets that fell were taken by Nomvelo Sibanda and Precious Marange who gave away 14 and 31 runs respectively, both in seven overs. Thailand skipper, Naruemol Chaiwai top scored for the hosts with an unbeaten 57 runs off 104 deliveries while Nattaya Boochatham fell for 25 runs from 50 balls. Their third leading run getter was Phannita Maya who contributed 17 runs having faced 24 balls. In their chase, Zimbabwe lost an early wicket of Ndhlovu in the fifth over for five runs off 16 balls. Her opening partner, Sharne Mayers went on to be the team’s leading run getter on the match with a run a ball 24 runs from while Chipo Mugeri-Tiripano fell for 18 runs off 34 deliveries. Two more Lady Chevrons batters, Ashley Ndiraya and Precious Marange managed to cross double figures, scoring 11 and 10 runs respectively. After Ndhlovu’s splendid performance with the ball, Thailand’s Thipatcha Putthawong came out guns blazing to rip through Zimbabwe’s batting order. She finished with the best bowling figures of 6/6 in 6.1 overs. Suleeporn took two scalps for 13 runs in three overs while Maya and Boochatham took one each to round up Zimbabwe’s innings and start off the series on a high note. The match was Zimbabwe’s first international assignment of the year and they will be looking to bounce back in the upcoming matches. Brent does not have much time to rectify his team’s mistakes since the second match is scheduled to take place tomorrow while the last one is set Sunday before attention shifts to T20Is. — @brandon_malvin","pubDate":"2023-04-19 22:02:58","image_url":null,"source_id":"chronicle_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"Rashford back in training","link":"https://www.herald.co.zw/rashford-back-in-training/","keywords":["Sport"],"creator":["The Herald"],"video_url":null,"description":"LONDON. — Marcus Rashford has returned to training for Manchester United before the Europa League quarter-final second leg in Sevilla tonight.","content":"— Marcus Rashford has returned to training for Manchester United before the Europa League quarter-final second leg in Sevilla tonight. Rashford, 25, has not played since he sustained a groin injury during United’s home Premier League win against Everton on April 8. United had said the England striker, who has scored 31 goals this season, would “miss a few games”. Luke Shaw, Marcel Sabitzer and Tyrell Malacia also trained at Carrington. Rashford was unavailable for the first leg against Sevilla at Old Trafford, which United drew 2-2, as well as Sunday’s 2-0 win at Nottingham Forest. Sabitzer, who scored twice against Sevilla, was withdrawn from the starting line-up at the City Ground after picking up an injury in the warm-up, while Malacia also missed the trip with a knee problem. Shaw, meanwhile, has not played since he was substituted in United’s 1-0 win at home against Brentford on 5 April. Should he be fit to play, the England defender could provide much-needed cover at centre-back, with Lisandro Martinez ruled out for the season and Raphael Varane also picking up an injury against Forest. DYNAMOS head coach Herbert “Jompano” Maruwa is beginning to get worried with his blunt strikeforce. THE visiting FIFA delegation is today expected to meet the ZIFA board comprising the current and ousted members fronted by Felton Kamambo as part of their fact-finding mission in Zimbabwe. ZIMBABWEAN batsman Gary Ballance has announced his retirement from all forms of cricket with immediate effect, just four months after he had switched allegiance from England to represent the country of his birth.","pubDate":"2023-04-19 22:01:58","image_url":null,"source_id":"herald_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"Chelsea need strategy for turnaround – Silva","link":"https://www.herald.co.zw/chelsea-need-strategy-for-turnaround-silva/","keywords":["Sport"],"creator":["The Herald"],"video_url":null,"description":"LONDON. — Chelsea defender Thiago Silva says the club need to “stop and put a strategy in place” or risk another difficult campaign next season. Despite lavish transfer spending under new owner Todd Boehly, Chelsea are 11th in the Premier League and will end this season without a trophy after defeat by Real Madrid in the Champions League.","content":"Chelsea defender Thiago Silva says the club need to “stop and put a strategy in place” or risk another difficult campaign next season. Despite lavish transfer spending under new owner Todd Boehly, Chelsea are 11th in the Premier League and will end this season without a trophy after defeat by Real Madrid in the Champions League. “The manager can only pick 11 from 30-something. That’s tough,” said Silva. “There is always going to be someone upset because not everyone can play.” American investor Boehly and private equity firm Clearlake Capital completed a £4.25bn takeover of Chelsea in May 2022. They spent about £550m across the summer and winter transfer windows to amass a first-team squad of 30 players, but that has failed to translate into success on the pitch. Chelsea have sacked managers Thomas Tuchel and Graham Potter this season, while interim boss Frank Lampard has lost all four matches since taking over for a second spell this month. It means they are unlikely to qualify for Europe for only the second time in 25 seasons. “It’s a difficult moment for the club, with a lot of indecision,” added 38-year-old Silva. “We had to increase the size of the changing rooms because it didn’t fit the size of the team. “A positive point is that there are amazing players within the squad, but on the other hand there is always players that are going to be unhappy. “We need to stop and put a strategy in place, otherwise next season we could make the same mistakes.” Chelsea have reportedly held talks with ex-Bayern Munich boss Julian Nagelsmann as part of their search for a new manager with former Spain boss Luis Enrique also in the frame. “We keep pointing our fingers to the managers, but we need to look inside and see what we are doing wrong and try to change it,” Thiago said. “When you’re pointing at someone, you have three fingers pointing back to you. “So firstly, we need to look to what we’ve been doing wrong and play more as a team – because we don’t need a hero, we need heroes. “At the end of the season if we do what we’ve got to do, we’ll be able to at least finish it with dignity.” Former Chelsea striker Didier Drogba said he does not “recognise the club” compared with when he played at Stamford Bridge. Drogba won 12 major honours between 2004 and 2012 under previous owner Roman Abramovich, whose generous backing turned the Blues into serial trophy winners following his takeover in 2003. The 56-year-old was forced to sell the club last year after he was sanctioned by the UK government over alleged links to Russian president Vladimir Putin. “It is not the same club anymore,” Drogba, 45, told Canal+. “I don’t recognise my club. There is a new owner and a new vision. “We try to compare with what was done under the Abramovich era, where there were many acquisitions of players, but the choices were very intelligent. DYNAMOS head coach Herbert “Jompano” Maruwa is beginning to get worried with his blunt strikeforce. THE visiting FIFA delegation is today expected to meet the ZIFA board comprising the current and ousted members fronted by Felton Kamambo as part of their fact-finding mission in Zimbabwe. ZIMBABWEAN batsman Gary Ballance has announced his retirement from all forms of cricket with immediate effect, just four months after he had switched allegiance from England to represent the country of his birth.","pubDate":"2023-04-19 22:01:56","image_url":null,"source_id":"herald_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"Strydom to end Sunshine Tour season as a Major player","link":"https://www.herald.co.zw/strydom-to-end-sunshine-tour-season-as-a-major-player/","keywords":["Sport"],"creator":["The Herald"],"video_url":null,"description":"JOHANNESBURG. — Ockie Strydom started the current Sunshine Tour season as a player looking to make ampionship having done exactly this, with two DP World Tour wins and now Major Championship golf to look forward to as well.","content":"Ockie Strydom started the current Sunshine Tour season as a player looking to make ampionship having done exactly this, with two DP World Tour wins and now Major Championship golf to look forward to as well. Strydom goes into this week’s Sunshine Tour season-ending Tour Championship at Serengeti Estates as the top-ranked golfer on the Tour’s Luno Order of Merit. He cannot be caught this week so will end the season in first place. This brings with it Major incentives for Strydom, including a place in The Open at Royal Liverpool as well as the US PGA Championship at Oak Hill, the latter coming via the Federation Ranking on the Official World Golf Ranking. “I’m into two Majors at the moment, and I’m also hoping to get into the US Open through my ranking on the DP World Tour. So that could be three Majors this year, which would be a first for me. It’s challenging and exciting at the same time,” said Strydom. “I’m trying not to approach anything differently. It definitely sounds nice to say I’m playing in Majors, and it’s a word that changes the mindset. But I’ll try and approach them as just another golf tournament where I have the opportunity to play against the best players in the world.” Strydom’s first place on the final Luno Order of Merit will also secure him a spot in the Nedbank Golf Challenge later this year. So it’s a rewarding week for Strydom, and on a golf course that always brings out the best in his game. “It’s nice to be back here to finish off the Sunshine Tour season. I always play well on this course. I’m a more experienced golfer this year as well so hopefully it’s another good week for me.” The field this week includes Casey Jarvis, who should wrap-up the Rookie of the Year award. — DYNAMOS head coach Herbert “Jompano” Maruwa is beginning to get worried with his blunt strikeforce. THE visiting FIFA delegation is today expected to meet the ZIFA board comprising the current and ousted members fronted by Felton Kamambo as part of their fact-finding mission in Zimbabwe. ZIMBABWEAN batsman Gary Ballance has announced his retirement from all forms of cricket with immediate effect, just four months after he had switched allegiance from England to represent the country of his birth.","pubDate":"2023-04-19 22:01:52","image_url":null,"source_id":"herald_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"Gems aim to step up World Cup preps","link":"https://www.herald.co.zw/gems-aim-to-step-up-world-cup-preps/","keywords":["Sport"],"creator":["The Herald"],"video_url":null,"description":"AS the countdown to the 2023 Vitality Netball World Cup continues, Gems vice-captain Claris Kwaramba says they are making positive progress in their preparations.","content":"AS the countdown to the 2023 Vitality Netball World Cup continues, Gems vice-captain Claris Kwaramba says they are making positive progress in their preparations. Kwaramba said with the event getting closer by the day, they now need to step up their build-up as they approach the final stages of the preparations. Yesterday marked 100 days to go before the Vitality Netball World Cup 2023 roars into life in Cape Town, South Africa. “We no longer have much time to prepare. I think we are now supposed to be working on the final touches. We keep working and giving it our all. “Yes we are making progress. I think we are almost ready and I think we are left with just a few things to work on,” said Kwaramba. The senior national team just concluded a month-long camp in Harare this week and will be hoping to regroup soon to step up their preparations. Gems coach Ropafadzo Mutsauki described the recent camp as a success. “It was a very successful camp because I think we achieved our targets. We were concerned with our midfield but right now it’s looking promising. There were positives during this camp. “Looking at the foreign-based players we are expecting to join us, most of them are not mid-court players, they play defence and shooting. So for this camp we were working more on the mid-court because that’s where we were lacking. But we noticed some positive changes,” said Mutsauki. However, he emphasised the need for friendly games before they leave for South Africa. Zimbabwe will be among the 16 countries set to compete in the global event that is due to run from July 28 to August 6. The first stage of the tournament will commence on July 28 with teams competing in a round-robin format in the pools. Zimbabwe, drawn in Pool A, will face powerhouses Australia, Tonga and Fiji in the preliminary stages. Meanwhile, the Zimbabwe Netball Association are tomorrow expected to sign a partnership deal with Nedbank Zimbabwe for their journey to the 2023 World Cup. The official signing ceremony of the partnership is scheduled to take place at Stodart Netball Complex in Mbare. “The launch will take place on the 21st of April 2023 at Stodart Netball Complex in Mbare at 11:30am. Nedbank will be joining us on our journey to Cape town for the Netball World Cup as our main sponsor. “This signing ceremony with Nedbank marks the beginning of the journey to the epic games as we seek to qualify for round two, all the way to the finals,” said project manager Maimba Mapuranga. Zimbabwe will be making their second successive appearance at the tournament. DYNAMOS head coach Herbert “Jompano” Maruwa is beginning to get worried with his blunt strikeforce. THE visiting FIFA delegation is today expected to meet the ZIFA board comprising the current and ousted members fronted by Felton Kamambo as part of their fact-finding mission in Zimbabwe. ZIMBABWEAN batsman Gary Ballance has announced his retirement from all forms of cricket with immediate effect, just four months after he had switched allegiance from England to represent the country of his birth.","pubDate":"2023-04-19 22:01:51","image_url":null,"source_id":"herald_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"Raducanu thrashed by Ostapenko in Stuttgart","link":"https://www.herald.co.zw/raducanu-thrashed-by-ostapenko-in-stuttgart/","keywords":["Sport"],"creator":["The Herald"],"video_url":null,"description":"STUTTGART. — Emma Raducanu’s first clay-court match of the season ended in a one-sided defeat by former French Open champion Jelena Ostapenko in Stuttgart.","content":"Emma Raducanu’s first clay-court match of the season ended in a one-sided defeat by former French Open champion Jelena Ostapenko in Stuttgart. The British number one struggled to deal with ferocious hitting from the Latvian and lost 6-2 6-1 in 59 minutes. Having reached the quarter-finals of the event last year, Raducanu’s exit means she will drop down the rankings from her current place of 68. Ostapenko will play Tunisia’s third seed Ons Jabeur in the last 16. Raducanu skipped Great Britain’s Billie Jean King Cup defeat to France last week to prepare for the clay-court swing but was completely outplayed after being given a tough opening draw. The 2021 US Open champion won the first game but was overpowered by her opponent’s heavy hitting as she lost the next five on the way to giving up the opening set. Having held serve at the start of the second, Raducanu moved to 0-30 on the 2017 French Open winner’s serve but from there Ostapenko won 16 points in a row to ease into a 4-1 lead. The 2017 French open champion hit 26 winners to Raducanu’s six. Elsewhere, Spain’s world number 31 Paula Badosa thrashed seventh seed Daria Kasatkina 6-1 6-1. At the Barcelona Open, men’s world number two Carlos Alcaraz, who lost the top ranking to Novak Djokovic after going out of the Miami Open in the semi-finals, opened his clay-court campaign with a comfortable 6-3 6-1 win over Portugal’s Nuno Borges. But American fifth seed Frances Tiafoe was beaten 4-6 7-6 (7-3) 4-6 by world number 40 Emil Ruusuvuori of Finland. Norwegian third seed Casper Ruud, last year’s French Open finalist, beat American Ben Shelton 6-2 7-6 (7-1). — DYNAMOS head coach Herbert “Jompano” Maruwa is beginning to get worried with his blunt strikeforce. THE visiting FIFA delegation is today expected to meet the ZIFA board comprising the current and ousted members fronted by Felton Kamambo as part of their fact-finding mission in Zimbabwe. ZIMBABWEAN batsman Gary Ballance has announced his retirement from all forms of cricket with immediate effect, just four months after he had switched allegiance from England to represent the country of his birth.","pubDate":"2023-04-19 22:01:49","image_url":null,"source_id":"herald_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"FIFA delegation meets ZIFA board","link":"https://www.herald.co.zw/fifa-delegation-meets-zifa-board/","keywords":["Sport"],"creator":["The Herald"],"video_url":null,"description":"THE visiting FIFA delegation is today expected to meet the ZIFA board comprising the current and ousted members fronted by Felton Kamambo as part of their fact-finding mission in Zimbabwe.","content":"THE visiting FIFA delegation is today expected to meet the ZIFA board comprising the current and ousted members fronted by Felton Kamambo as part of their fact-finding mission in Zimbabwe. The meeting which could have taken place earlier this week, failed to take off after it was noted that some of the members including Gift Banda, who is the acting ZIFA president, and Sugar Chagonda were not in attendance. FIFA senior member associations governance manager Sarah Solemale and FIFA head of development programmes in Africa Solomon Mudege — a Zimbabwean based at the FIFA headquarters in Zurich — have held marathon meetings with football stakeholders since they arrived in the country early this week. CAF director of member associations Sarah Mukuna and COSAFA president Artur de Almeida de Silva were also expected yesterday along with Football Association of Malawi president Walter Nyamilandu and Botswana Football Federation president Maclean Letshwiti. The FIFA delegation apparently wanted to meet all the elected members of the board from the December 2018 ballot and an objection was raised before the discussions could take off. “Some of the board members raised the objection. They argued that the board was not complete without some of the members. There is a clique led by Kamambo that had wanted to sideline some of the key witnesses,” said a source. The FIFA delegation has since met with the Premier Soccer League and the Zimbabwe Women’s Soccer League. “So far these guys have been shocked by what they heard from the submissions. The FIFA guys had hoped to persuade the PSL clubs to push for the reinstatement of the ousted board members. “But they could be forced to have a rethink if they came here with a position. The PSL clubs were blunt about the transgressions of the ousted board members and they indicated reinstatement was a non-starter. “The Women’s Football League also did the same. They complained about their funds from FIFA which did not reach their constituency and the general lack of support for the women’s game. “What the FIFA guys had in their minds and what they are finding on the ground is totally different.” The FIFA emissaries were reluctant to comment on their visit and they are expected to have more meetings with football stakeholders to gather more information on the football crisis in Zimbabwe. The Sports and Recreation Commission were the first to meet the visiting delegation. Sports Commission chairman Gerald Mlotshwa was confident solutions to the issues bedeviling Zimbabwean football administration could be found sooner than had been expected. Mlotshwa said the visit was crucial to put the Zimbabwe situation, which is now a complicated subject, into the correct perspective. “As you know, we have invited FIFA to come through on a fact-finding mission just so they can see things on the ground for themselves, rather than relying on third party reporting and that sort of thing, which (coming to Zimbabwe) they have done and which we are thankful for,” said Mlotshwa. “They have engaged us. We had a very fruitful meeting. We had a very positive meeting. The CAF delegation unfortunately didn’t manage to make this meeting but we are meeting them on Thursday and there will be further updates coming from that. But everything is quite positive, let’s put it that way. “I think it means that both sides are committed to finding a solution to the problems bedeviling football in this country. “It’s always a good thing when people are communicating and are meeting especially physically like this because there’s then a lot of clarity on issues that may not have been clear before,” said Mlotshwa. The ZIFA Congress, the Footballers Union of Zimbabwe and the supporters’ bodies are also interested in giving their input. Mlotshwa indicated the visitors will reach out to as many people as they could during their short stay in Zimbabwe. Zimbabwe’s membership rights at FIFA were suspended last year in February after the world football governing body ruled that the intervention by the Sports Commission to suspend the ZIFA board pending investigations into various allegations of corruption and mismanagement constituted third party interference. The ZIFA board was suspended in November 2021 and three months later FIFA descended on Zimbabwe. Currently, a lot of toxicity currently permeates the landscape. The visit by FIFA representatives has put paid to the narrative being peddled by ousted ZIFA executives that include Kamambo, Philemon Machana, Bryton Malandule and ex-chief executive officer Joseph Mamutse, that FIFA were not prepared to engage with anyone other than the quartet. The quartet was kicked out of football by the ZIFA Congress via a vote of no confidence last year and have been fighting tooth and nail to find their way back, despite the serious allegations of corruption and sexual abuse of female referees hanging on their necks. All the same, the four-year term of Kamambo’s presidency expired on December 17, 2022. But they will get their opportunity with the visiting FIFA representative, to tell their side of the story. DYNAMOS head coach Herbert “Jompano” Maruwa is beginning to get worried with his blunt strikeforce. ZIMBABWEAN batsman Gary Ballance has announced his retirement from all forms of cricket with immediate effect, just four months after he had switched allegiance from England to represent the country of his birth. BARCELONA. — Barcelona would not be able to resign Lionel Messi from Paris Saint-Germain in their current financial situation, LaLiga president Javier Tebas said yesterday.","pubDate":"2023-04-19 22:04:52","image_url":null,"source_id":"herald_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"Ballance drops retirement bombshell","link":"https://www.herald.co.zw/ballance-drops-retirement-bombshell/","keywords":["Sport"],"creator":["The Herald"],"video_url":null,"description":"ZIMBABWEAN batsman Gary Ballance has announced his retirement from all forms of cricket with immediate effect, just four months after he had switched allegiance from England to represent the country of his birth.","content":"ZIMBABWEAN batsman Gary Ballance has announced his retirement from all forms of cricket with immediate effect, just four months after he had switched allegiance from England to represent the country of his birth. Ballance, the former Yorkshire and England cricketer, who recently relaunched his career with his native Zimbabwe, announced the decision released through Professional Cricketers’ Association yesterday. “After much thought, I have decided to retire from all forms of professional cricket with immediate effect,” he said in a statement. “I had hoped my move to Zimbabwe would provide me with a new-found happiness for the game and I will always be thankful to Zimbabwe Cricket for providing me with an opportunity to return to international cricket and welcoming me into their team. “However, I have reached the stage where I no longer have the desire to dedicate myself to the rigours of professional sport and this would do Zimbabwe Cricket and the game itself a disservice, should I carry on. I wish them every success going forward. “I have been fortunate to have some incredibly memorable moments in cricket, winning County Championships with Yorkshire and gaining the ultimate honour of representing England and Zimbabwe. “I want to thank all of my clubs, coaches, support staff, teammates and supporters for their guidance and encouragement over my career, it has been a privilege. “It is now time for me to move on to the next chapter of my life. I will be making no further comments on my decision at this time.” His move back to Zimbabwe — whom he had represented at Under-19 level prior to his England call-up — had been a bid for a fresh start, and it was initially a successful one too. He signed a two-year contract with ZC in December and played a total of eight international matches between January and March, including a one-off Test against West Indies in Bulawayo in which he scored a memorable 137 not out. The feat made him only the second Test cricketer to score centuries for two different nations, after Kepler Wessels, the former Australia batter and South Africa captain. However, after signing off with an unbeaten 64 to seal last month’s ODI series against the Netherlands, Ballance has now decided to call time on his relaunched career. The 33-year-old made four centuries in 23 Test appearances for England between 2014 and 2017, a record that compared favourably with many other players to have debuted in a similar period. However, he was heavily implicated in Azeem Rafiq’s explosive testimony during the DCMS parliamentary hearings in Westminster last November, after his use of the racial slur “P**i” had been deemed to be “banter” in the initial report into allegations of institutional racism at Yorkshire. His career within English cricket ended amid the controversy, and after several months of open-ended leave on mental health grounds, Yorkshire released him from his contract at the end of the 2022 season, shortly after he was charged by the Cricket Discipline Commission alongside six other Yorkshire cricketers, including Michael Vaughan (who was subsequently cleared) and Matthew Hoggard. He retires with a total of 1653 runs at 40.31 from his 24 Tests, and 12031 first-class runs at 47.74 all told, including 42 centuries and a further eight in List A cricket. — Sports Reporter/Cricinfo. DYNAMOS head coach Herbert “Jompano” Maruwa is beginning to get worried with his blunt strikeforce. THE visiting FIFA delegation is today expected to meet the ZIFA board comprising the current and ousted members fronted by Felton Kamambo as part of their fact-finding mission in Zimbabwe. BARCELONA. — Barcelona would not be able to resign Lionel Messi from Paris Saint-Germain in their current financial situation, LaLiga president Javier Tebas said yesterday.","pubDate":"2023-04-19 22:04:49","image_url":null,"source_id":"herald_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"Gary Ballance dumps Chevrons at 11th hour","link":"https://www.chronicle.co.zw/gary-ballance-dumps-chevrons-at-11th-hour/","keywords":["Sport"],"creator":["Chronicle Editor"],"video_url":null,"description":"Brandon Moyo brandonmalvin9@gmail.com WITH just over two months left before the start of the 2023 International Cricket Council (ICC) Men’s World Cup Qualifier on Zimbabwean soil, Gary Ballance has dropped a bombshell by announcing his retirement from all forms of professional cricket. The 33-year-old former England and Yorkshire batsman signed a two-year contract with Zimbabwe […]","content":"The Chronicle WITH just over two months left before the start of the 2023 International Cricket Council (ICC) Men’s World Cup Qualifier on Zimbabwean soil, Gary Ballance has dropped a bombshell by announcing his retirement from all forms of professional cricket. The 33-year-old former England and Yorkshire batsman signed a two-year contract with Zimbabwe Cricket (ZC) in December after switching allegiance from England. Zimbabwe who are hoping to qualify for the ICC Cricket World Cup to be held in India at the end of this year, expected to use Ballance’s experience. In his retirement statement which was released by the Professional Cricketers Association (PCA) on his behalf yesterday, Ballance said his decision had come after much thought. “After much thought, I have decided to retire from all forms of professional cricket with immediate effect. I had hoped my move to Zimbabwe would provide me with a new-found happiness for the game. I will always be thankful to Zimbabwe Cricket for providing me with an opportunity to return to international cricket and welcoming me into their team. However, I have reached the stage where I no longer have the desire to dedicate myself to the rigours of professional sport and this would do Zimbabwe Cricket and the game itself a disservice should I carry on. I wish them every success going forward,” said Ballance. He said he had been fortunate to have some incredibly memorable moments in cricket, winning County Championships with Yorkshire and gaining the ultimate honour of representing England and Zimbabwe. “I want to thank all of my clubs, coaches, support staff, teammates and supporters for their guidance and encouragement over my career, it has been a privilege. It is now time for me to move on to the next chapter of my life. I will be making no further comments on my decision at this time,” read the statement. Ballance made his Chevrons debut in January in a T20I series against Ireland that was played at Harare Sports Club which became his first and last international 20-over match. In just his second One Day International (ODI) match for Zimbabwe, the country of his birth, he scored his maiden half century. He made 52 runs for Dave Houghton’s side in a series that ended 1-1. He also scored another unbeaten half century in what has turned out to be his final match for Zimbabwe on 25 March against Netherlands. He made 64 runs as Zimbabwe put up a brilliant performance to win the series 2-1 after a dismal start. Ballance, who was a known longer-version specialist, made history in the only Test he played for Zimbabwe. He notched up a century to remove the Chevrons from the jaws of defeat in February this year when playing against the West Indies at Queens Sports Club in Bulawayo. Ballance became the second player in the history of the game after Kepler Wessels to score a century for two different countries after he compiled an unbeaten 137 runs. Wessels notched up centuries for Australia and South Africa. He also joined an elite group of Zimbabweans to score centuries on Test debut. Houghton and Hamilton Masakadza are the only two Chevrons stars to have managed that feat. In total, Ballance played a total of 24 Test matches, racking up 1 653 runs and a high score of 156 runs at an average of 40, 31. In ODIs, he played 21 matches, scored 454 runs with a high score of 79 at an average of 25. 22 while in the shortest version of the game, he scored 30 runs in one match. In first-class cricket, Ballance amassed 12 031 runs from 171 matches and 278 innings with a high score of 210 runs at an average of 47.74 while in List A, he played 124 matches, scored 4 697 runs with a best of 156 runs with an average of 47.44. He also played 107 T20 matches, scored 1 952 runs at an average of 23.51, his best in this format being 79 runs. ZC is yet to release a statement on Ballance’s retirement. — @brandon_malvin","pubDate":"2023-04-19 22:03:04","image_url":null,"source_id":"chronicle_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"Barca unable to sign Messi for now","link":"https://www.herald.co.zw/barca-unable-to-sign-messi-for-now/","keywords":["Sport"],"creator":["The Herald"],"video_url":null,"description":"BARCELONA. — Barcelona would not be able to resign Lionel Messi from Paris Saint-Germain in their current financial situation, LaLiga president Javier Tebas said yesterday.","content":"Barcelona would not be able to resign Lionel Messi from Paris Saint-Germain in their current financial situation, LaLiga president Javier Tebas said yesterday. Messi, 35, is expected to leave PSG at the end of the season and has been heavily linked with a return to the Camp Nou, with Barca striker Robert Lewandowski saying he hopes to play with him next term. The seven-time Ballon d’Or winner left Barcelona in 2021 as the Catalan giants struggled financially. “Today, he could not (be registered in LaLiga), but there is still time,” Tebas told a press conference. “We’re not going to change the rules of financial control approved by the clubs to register Messi… even if it would be our wish that he returns to our league.” Tebas said Barcelona could potentially balance the books enough by selling players. Daily Mundo Deportivo reported yesterday that Barca have a “firm intention of bringing in Lionel Messi” this summer on a two-year deal. Messi has struggled to reproduce his best form in Paris, scoring 31 goals in 69 appearances, and was booed by PSG fans earlier this month. DYNAMOS head coach Herbert “Jompano” Maruwa is beginning to get worried with his blunt strikeforce. THE visiting FIFA delegation is today expected to meet the ZIFA board comprising the current and ousted members fronted by Felton Kamambo as part of their fact-finding mission in Zimbabwe. ZIMBABWEAN batsman Gary Ballance has announced his retirement from all forms of cricket with immediate effect, just four months after he had switched allegiance from England to represent the country of his birth.","pubDate":"2023-04-19 22:02:59","image_url":null,"source_id":"herald_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"Lady Chevrons lose series opener against Thailand","link":"https://www.chronicle.co.zw/lady-chevrons-lose-series-opener-against-thailand/","keywords":["Sport"],"creator":["Chronicle Editor"],"video_url":null,"description":"Brandon Moyo brandonmalvin9@gmail.com WOEFUL batting saw the Zimbabwe senior women’s cricket suffer defeat by 78 runs in their opening encounter of the three match One Day International (ODI) cricket series against Thailand at Terdthai Cricket Ground in Bangkok, Thailand yesterday. After being asked to field first and losing the toss, the Gary Brent-coached Lady Chevrons […]","content":"The Chronicle WOEFUL batting saw the Zimbabwe senior women’s cricket suffer defeat by 78 runs in their opening encounter of the three match One Day International (ODI) cricket series against Thailand at Terdthai Cricket Ground in Bangkok, Thailand yesterday. After being asked to field first and losing the toss, the Gary Brent-coached Lady Chevrons bowled out the hosts for 154 runs in 43 overs before going on to struggle with the bat as they were wiped out for just 76 runs in 24.1 overs. Teenage sensation, Kelis Ndhlovu once again put up a stellar performance with the ball for Zimbabwe after taking her maiden ODI five wicket haul. She finished with the figures of 5/22 in nine overs while all-rounder, Josephine Nkomo took three scalps for 29 runs in her seven over spell. The other two wickets that fell were taken by Nomvelo Sibanda and Precious Marange who gave away 14 and 31 runs respectively, both in seven overs. Thailand skipper, Naruemol Chaiwai top scored for the hosts with an unbeaten 57 runs off 104 deliveries while Nattaya Boochatham fell for 25 runs from 50 balls. Their third leading run getter was Phannita Maya who contributed 17 runs having faced 24 balls. In their chase, Zimbabwe lost an early wicket of Ndhlovu in the fifth over for five runs off 16 balls. Her opening partner, Sharne Mayers went on to be the team’s leading run getter on the match with a run a ball 24 runs from while Chipo Mugeri-Tiripano fell for 18 runs off 34 deliveries. Two more Lady Chevrons batters, Ashley Ndiraya and Precious Marange managed to cross double figures, scoring 11 and 10 runs respectively. After Ndhlovu’s splendid performance with the ball, Thailand’s Thipatcha Putthawong came out guns blazing to rip through Zimbabwe’s batting order. She finished with the best bowling figures of 6/6 in 6.1 overs. Suleeporn took two scalps for 13 runs in three overs while Maya and Boochatham took one each to round up Zimbabwe’s innings and start off the series on a high note. The match was Zimbabwe’s first international assignment of the year and they will be looking to bounce back in the upcoming matches. Brent does not have much time to rectify his team’s mistakes since the second match is scheduled to take place tomorrow while the last one is set Sunday before attention shifts to T20Is. — @brandon_malvin","pubDate":"2023-04-19 22:02:58","image_url":null,"source_id":"chronicle_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"Rashford back in training","link":"https://www.herald.co.zw/rashford-back-in-training/","keywords":["Sport"],"creator":["The Herald"],"video_url":null,"description":"LONDON. — Marcus Rashford has returned to training for Manchester United before the Europa League quarter-final second leg in Sevilla tonight.","content":"— Marcus Rashford has returned to training for Manchester United before the Europa League quarter-final second leg in Sevilla tonight. Rashford, 25, has not played since he sustained a groin injury during United’s home Premier League win against Everton on April 8. United had said the England striker, who has scored 31 goals this season, would “miss a few games”. Luke Shaw, Marcel Sabitzer and Tyrell Malacia also trained at Carrington. Rashford was unavailable for the first leg against Sevilla at Old Trafford, which United drew 2-2, as well as Sunday’s 2-0 win at Nottingham Forest. Sabitzer, who scored twice against Sevilla, was withdrawn from the starting line-up at the City Ground after picking up an injury in the warm-up, while Malacia also missed the trip with a knee problem. Shaw, meanwhile, has not played since he was substituted in United’s 1-0 win at home against Brentford on 5 April. Should he be fit to play, the England defender could provide much-needed cover at centre-back, with Lisandro Martinez ruled out for the season and Raphael Varane also picking up an injury against Forest. DYNAMOS head coach Herbert “Jompano” Maruwa is beginning to get worried with his blunt strikeforce. THE visiting FIFA delegation is today expected to meet the ZIFA board comprising the current and ousted members fronted by Felton Kamambo as part of their fact-finding mission in Zimbabwe. ZIMBABWEAN batsman Gary Ballance has announced his retirement from all forms of cricket with immediate effect, just four months after he had switched allegiance from England to represent the country of his birth.","pubDate":"2023-04-19 22:01:58","image_url":null,"source_id":"herald_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"Chelsea need strategy for turnaround – Silva","link":"https://www.herald.co.zw/chelsea-need-strategy-for-turnaround-silva/","keywords":["Sport"],"creator":["The Herald"],"video_url":null,"description":"LONDON. — Chelsea defender Thiago Silva says the club need to “stop and put a strategy in place” or risk another difficult campaign next season. Despite lavish transfer spending under new owner Todd Boehly, Chelsea are 11th in the Premier League and will end this season without a trophy after defeat by Real Madrid in the Champions League.","content":"Chelsea defender Thiago Silva says the club need to “stop and put a strategy in place” or risk another difficult campaign next season. Despite lavish transfer spending under new owner Todd Boehly, Chelsea are 11th in the Premier League and will end this season without a trophy after defeat by Real Madrid in the Champions League. “The manager can only pick 11 from 30-something. That’s tough,” said Silva. “There is always going to be someone upset because not everyone can play.” American investor Boehly and private equity firm Clearlake Capital completed a £4.25bn takeover of Chelsea in May 2022. They spent about £550m across the summer and winter transfer windows to amass a first-team squad of 30 players, but that has failed to translate into success on the pitch. Chelsea have sacked managers Thomas Tuchel and Graham Potter this season, while interim boss Frank Lampard has lost all four matches since taking over for a second spell this month. It means they are unlikely to qualify for Europe for only the second time in 25 seasons. “It’s a difficult moment for the club, with a lot of indecision,” added 38-year-old Silva. “We had to increase the size of the changing rooms because it didn’t fit the size of the team. “A positive point is that there are amazing players within the squad, but on the other hand there is always players that are going to be unhappy. “We need to stop and put a strategy in place, otherwise next season we could make the same mistakes.” Chelsea have reportedly held talks with ex-Bayern Munich boss Julian Nagelsmann as part of their search for a new manager with former Spain boss Luis Enrique also in the frame. “We keep pointing our fingers to the managers, but we need to look inside and see what we are doing wrong and try to change it,” Thiago said. “When you’re pointing at someone, you have three fingers pointing back to you. “So firstly, we need to look to what we’ve been doing wrong and play more as a team – because we don’t need a hero, we need heroes. “At the end of the season if we do what we’ve got to do, we’ll be able to at least finish it with dignity.” Former Chelsea striker Didier Drogba said he does not “recognise the club” compared with when he played at Stamford Bridge. Drogba won 12 major honours between 2004 and 2012 under previous owner Roman Abramovich, whose generous backing turned the Blues into serial trophy winners following his takeover in 2003. The 56-year-old was forced to sell the club last year after he was sanctioned by the UK government over alleged links to Russian president Vladimir Putin. “It is not the same club anymore,” Drogba, 45, told Canal+. “I don’t recognise my club. There is a new owner and a new vision. “We try to compare with what was done under the Abramovich era, where there were many acquisitions of players, but the choices were very intelligent. DYNAMOS head coach Herbert “Jompano” Maruwa is beginning to get worried with his blunt strikeforce. THE visiting FIFA delegation is today expected to meet the ZIFA board comprising the current and ousted members fronted by Felton Kamambo as part of their fact-finding mission in Zimbabwe. ZIMBABWEAN batsman Gary Ballance has announced his retirement from all forms of cricket with immediate effect, just four months after he had switched allegiance from England to represent the country of his birth.","pubDate":"2023-04-19 22:01:56","image_url":null,"source_id":"herald_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"Strydom to end Sunshine Tour season as a Major player","link":"https://www.herald.co.zw/strydom-to-end-sunshine-tour-season-as-a-major-player/","keywords":["Sport"],"creator":["The Herald"],"video_url":null,"description":"JOHANNESBURG. — Ockie Strydom started the current Sunshine Tour season as a player looking to make ampionship having done exactly this, with two DP World Tour wins and now Major Championship golf to look forward to as well.","content":"Ockie Strydom started the current Sunshine Tour season as a player looking to make ampionship having done exactly this, with two DP World Tour wins and now Major Championship golf to look forward to as well. Strydom goes into this week’s Sunshine Tour season-ending Tour Championship at Serengeti Estates as the top-ranked golfer on the Tour’s Luno Order of Merit. He cannot be caught this week so will end the season in first place. This brings with it Major incentives for Strydom, including a place in The Open at Royal Liverpool as well as the US PGA Championship at Oak Hill, the latter coming via the Federation Ranking on the Official World Golf Ranking. “I’m into two Majors at the moment, and I’m also hoping to get into the US Open through my ranking on the DP World Tour. So that could be three Majors this year, which would be a first for me. It’s challenging and exciting at the same time,” said Strydom. “I’m trying not to approach anything differently. It definitely sounds nice to say I’m playing in Majors, and it’s a word that changes the mindset. But I’ll try and approach them as just another golf tournament where I have the opportunity to play against the best players in the world.” Strydom’s first place on the final Luno Order of Merit will also secure him a spot in the Nedbank Golf Challenge later this year. So it’s a rewarding week for Strydom, and on a golf course that always brings out the best in his game. “It’s nice to be back here to finish off the Sunshine Tour season. I always play well on this course. I’m a more experienced golfer this year as well so hopefully it’s another good week for me.” The field this week includes Casey Jarvis, who should wrap-up the Rookie of the Year award. — DYNAMOS head coach Herbert “Jompano” Maruwa is beginning to get worried with his blunt strikeforce. THE visiting FIFA delegation is today expected to meet the ZIFA board comprising the current and ousted members fronted by Felton Kamambo as part of their fact-finding mission in Zimbabwe. ZIMBABWEAN batsman Gary Ballance has announced his retirement from all forms of cricket with immediate effect, just four months after he had switched allegiance from England to represent the country of his birth.","pubDate":"2023-04-19 22:01:52","image_url":null,"source_id":"herald_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"Gems aim to step up World Cup preps","link":"https://www.herald.co.zw/gems-aim-to-step-up-world-cup-preps/","keywords":["Sport"],"creator":["The Herald"],"video_url":null,"description":"AS the countdown to the 2023 Vitality Netball World Cup continues, Gems vice-captain Claris Kwaramba says they are making positive progress in their preparations.","content":"AS the countdown to the 2023 Vitality Netball World Cup continues, Gems vice-captain Claris Kwaramba says they are making positive progress in their preparations. Kwaramba said with the event getting closer by the day, they now need to step up their build-up as they approach the final stages of the preparations. Yesterday marked 100 days to go before the Vitality Netball World Cup 2023 roars into life in Cape Town, South Africa. “We no longer have much time to prepare. I think we are now supposed to be working on the final touches. We keep working and giving it our all. “Yes we are making progress. I think we are almost ready and I think we are left with just a few things to work on,” said Kwaramba. The senior national team just concluded a month-long camp in Harare this week and will be hoping to regroup soon to step up their preparations. Gems coach Ropafadzo Mutsauki described the recent camp as a success. “It was a very successful camp because I think we achieved our targets. We were concerned with our midfield but right now it’s looking promising. There were positives during this camp. “Looking at the foreign-based players we are expecting to join us, most of them are not mid-court players, they play defence and shooting. So for this camp we were working more on the mid-court because that’s where we were lacking. But we noticed some positive changes,” said Mutsauki. However, he emphasised the need for friendly games before they leave for South Africa. Zimbabwe will be among the 16 countries set to compete in the global event that is due to run from July 28 to August 6. The first stage of the tournament will commence on July 28 with teams competing in a round-robin format in the pools. Zimbabwe, drawn in Pool A, will face powerhouses Australia, Tonga and Fiji in the preliminary stages. Meanwhile, the Zimbabwe Netball Association are tomorrow expected to sign a partnership deal with Nedbank Zimbabwe for their journey to the 2023 World Cup. The official signing ceremony of the partnership is scheduled to take place at Stodart Netball Complex in Mbare. “The launch will take place on the 21st of April 2023 at Stodart Netball Complex in Mbare at 11:30am. Nedbank will be joining us on our journey to Cape town for the Netball World Cup as our main sponsor. “This signing ceremony with Nedbank marks the beginning of the journey to the epic games as we seek to qualify for round two, all the way to the finals,” said project manager Maimba Mapuranga. Zimbabwe will be making their second successive appearance at the tournament. DYNAMOS head coach Herbert “Jompano” Maruwa is beginning to get worried with his blunt strikeforce. THE visiting FIFA delegation is today expected to meet the ZIFA board comprising the current and ousted members fronted by Felton Kamambo as part of their fact-finding mission in Zimbabwe. ZIMBABWEAN batsman Gary Ballance has announced his retirement from all forms of cricket with immediate effect, just four months after he had switched allegiance from England to represent the country of his birth.","pubDate":"2023-04-19 22:01:51","image_url":null,"source_id":"herald_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"Raducanu thrashed by Ostapenko in Stuttgart","link":"https://www.herald.co.zw/raducanu-thrashed-by-ostapenko-in-stuttgart/","keywords":["Sport"],"creator":["The Herald"],"video_url":null,"description":"STUTTGART. — Emma Raducanu’s first clay-court match of the season ended in a one-sided defeat by former French Open champion Jelena Ostapenko in Stuttgart.","content":"Emma Raducanu’s first clay-court match of the season ended in a one-sided defeat by former French Open champion Jelena Ostapenko in Stuttgart. The British number one struggled to deal with ferocious hitting from the Latvian and lost 6-2 6-1 in 59 minutes. Having reached the quarter-finals of the event last year, Raducanu’s exit means she will drop down the rankings from her current place of 68. Ostapenko will play Tunisia’s third seed Ons Jabeur in the last 16. Raducanu skipped Great Britain’s Billie Jean King Cup defeat to France last week to prepare for the clay-court swing but was completely outplayed after being given a tough opening draw. The 2021 US Open champion won the first game but was overpowered by her opponent’s heavy hitting as she lost the next five on the way to giving up the opening set. Having held serve at the start of the second, Raducanu moved to 0-30 on the 2017 French Open winner’s serve but from there Ostapenko won 16 points in a row to ease into a 4-1 lead. The 2017 French open champion hit 26 winners to Raducanu’s six. Elsewhere, Spain’s world number 31 Paula Badosa thrashed seventh seed Daria Kasatkina 6-1 6-1. At the Barcelona Open, men’s world number two Carlos Alcaraz, who lost the top ranking to Novak Djokovic after going out of the Miami Open in the semi-finals, opened his clay-court campaign with a comfortable 6-3 6-1 win over Portugal’s Nuno Borges. But American fifth seed Frances Tiafoe was beaten 4-6 7-6 (7-3) 4-6 by world number 40 Emil Ruusuvuori of Finland. Norwegian third seed Casper Ruud, last year’s French Open finalist, beat American Ben Shelton 6-2 7-6 (7-1). — DYNAMOS head coach Herbert “Jompano” Maruwa is beginning to get worried with his blunt strikeforce. THE visiting FIFA delegation is today expected to meet the ZIFA board comprising the current and ousted members fronted by Felton Kamambo as part of their fact-finding mission in Zimbabwe. ZIMBABWEAN batsman Gary Ballance has announced his retirement from all forms of cricket with immediate effect, just four months after he had switched allegiance from England to represent the country of his birth.","pubDate":"2023-04-19 22:01:49","image_url":null,"source_id":"herald_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"}]}