{"newsArray":[{"title":"Warner 'exhausted' ahead of India tour","link":"https://www.perthnow.com.au/sport/cricket/warner-exhausted-ahead-of-india-tour-c-9581930","keywords":null,"creator":["Jasper Bruce"],"video_url":null,"description":"Australian Test veteran David Warner says a busy summer of cricket has left him exhausted ahead of next month's Test tour of India.","content":"David Warner is feeling exhausted ahead of next month's Test tour of India and admits he would have preferred the night off from the Allan Border Medal this Monday to recover from a busy home summer. Warner's hectic summer officially came to an end on Friday night when the Brisbane Heat eliminated his Sydney Thunder from the Big Bash finals. Starting in August, Warner played in the white-ball series against Zimbabwe, New Zealand, England and the West Indies, in every game of Australia's T20 World Cup campaign, in each Test match of the home series against the West Indies and South Africa, and then managed six BBL games on his return to the tournament. \"It's been challenging,\" Warner told reporters of his busy summer. \"I'm quite tired, exhausted.\" India's difficult wickets are lying in wait, as is the challenge to find consistent form with the bat following a Test summer that yielded a memorable double-century and a spate of unconvincing knocks. The 36-year-old has five days to rest up before India, but one of his evenings will be taken up by Cricket Australia's Allan Border Medal, to be attended by the Test squad ahead of their staggered flights out. T20I teammate Marcus Stoinis and BBL star Chris Lynn are missing the awards night to play franchise cricket overseas. \"There are a few guys who have gone to the UAE League, which aren't going to the Cricket Australia awards,\" Warner said. \"From my perspective, that would've been nice to have had another night at home. But it is what it is.\" Warner's best performance of the BBL summer came on Friday night, when a rapid-fire 36 runs from 20 balls had the Thunder on track before rain washed the game out. While his results have not lived up to his billing, the opener said his intention had never been to use the BBL cameo to limber up for the longer format in India. \"You're not really trying to negate the spinning ball, it's a white ball as well,\" Warner said of the BBL. \"For me, it was about coming back and trying to inject some energy into the Thunder team and trying to put my best foot forward for the team. \"It hasn't come off this year.\" Warner is contracted for one more summer with the Thunder and will come into the tournament on the back of an ODI World Cup in India, and potentially after a similarly busy home Test summer if he is still playing and selected. \"Hopefully next year I can come out and be a little bit fresher than what I am at the moment,\" he said. \"It's going to be a long lead-in to our summer. \"From a personal point of view, I'm going to have to try and work out how to stay nice and fresh.\"","pubDate":"2023-01-27 22:51:24","image_url":"https://images.perthnow.com.au/publication/C-9581930/77d506a98ed8e8d58b2bdd653b6433be766333de-16x9-x0y0w1280h720.jpg","source_id":"perthnow","category":["sports"],"country":["australia"],"language":"english"},{"title":"Jos Buttler hails ‘phenomenal’ Jason Roy after century in England’s defeat to South Africa","link":"https://www.standard.co.uk/sport/cricket/south-africa-vs-england-odi-jason-roy-jos-buttler-2023-b1056248.html","keywords":["Cricket","Sport"],"creator":["Malik Ouzia"],"video_url":null,"description":"Jos Buttler hailed Jason Roy’s “phenomenal” innings as the under-pressure England opener returned to form in fine style during Friday’s ODI defeat to South Africa.","content":"hailed ’s “phenomenal” innings as the under-pressure opener returned to form in fine style during Friday’s ODI defeat to . The Surrey batter scored a brilliant 113 off 91 balls but England failed to take advantage as they slumped from 146 for-nought to be all-out for 271 chasing 299 for victory. Roy has and was dropped from England’s T20 side in the build-up to the T20 World Cup success in Australia before Christmas. The 32-year-old’s lean spell has continued in South Africa’s new SA20 league since the New Year, but returning to 50-over cricket appeared to work the oracle as Roy produced a commanding knock, including 11 fours and four sixes, in the series opener at Mangaung Oval. “He looked completely back to his best,” England captain Buttler said. “It was a phenomenal innings full of personality and courage, some fantastic shots. “I’m delighted to see him back to his best, he’s worked really hard to get there and been through a tough time. That can happen to everyone in cricket, we all go through those tough periods. “Having the strength of character to come out and play in the fashion he did today and really impose himself was fantastic to see.” Buttler has been playing alongside Roy in the SA20 for Paarl Royals and says he had seen signs of his teammate closing on a return to form. “I didn’t think he was far away at all,” Buttler added. “Being around him in the SA20, he’s been very consistent with his mindset even though he’s not got the runs he would have liked. He’s trained well and hit the ball well and he’s saying all the right things. “You’re never far away from a great day when you’re a player of that quality. It’s always going to come back at some point. We keep backing him and we were desperate for him to score those runs because he’s such an imposing player for us at the top of the order.” Jofra Archer made his first England appearance since March 2021, following a series of back and elbow problems. Jofra Archer returned to England duty for the first time in 678 days The seamer finished with figures of one-for-81, his most expensive in ODI cricket, but Buttler hailed another step on what is being a carefully plotted comeback. “It was always going to be a big challenge for him to get back to bowling 10 overs in a game and to have to come back and bowl spells,” Buttler said, with Archer’s only competitive cricket since his return having come in the SA20. “He’s obviously started in T20 cricket only very recently, bowling a maximum of four overs in a game and spells of maybe two overs at a time. \"It’s a bit step-up for him and I’m delighted see him come through that, it’s great to see him in an England shirt and back taking a wicket in an England shirt as well. “They’re all big steps even though he’s such a superstar of the game. They’re all good steps on the way to getting him back to being at his best.”","pubDate":"2023-01-27 20:44:26","image_url":"https://static.standard.co.uk/2023/01/27/20/newFile-5.jpg?width=1200&auto=webp","source_id":"standarduk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"South Africa vs England: Jason Roy century and Jofra Archer return not enough to stop opening defeat","link":"https://www.standard.co.uk/sport/cricket/south-africa-vs-england-odi-cricket-result-2023-b1056247.html","keywords":["Cricket","Sport"],"creator":["Malik Ouzia"],"video_url":null,"description":"It had been 678 days since England had been able to call upon Jofra Archer and, so it felt, almost as long since they had seen the best of Jason Roy.","content":"t had been 678 days since had been able to call upon and, so it felt, almost as long since they had seen the best of . Here in Bloemfontein, twin waits came to an end, but a day that began with Archer’s return to action, and encompassed Roy’s emphatic return to form in the shape of an 11th international hundred, ended in defeat as claimed victory in a lively conclusion to the First One-Day International. Roy’s 113 off 91 balls came in reply to another century from Rassie van der Dussen, but in being restricted to 298-for-seven, the Proteas appeared to have failed to take full advantage of a flat surface at Mangaung Oval. At 146 without loss and again at 196-for-three, the tourists looked well on top in the chase but a brilliantly hostile spell from Anrich Nortje turned the tide. England fluffed their lines and were skittled 28 runs short of victory as South Africa took a 1-0 lead in a series that is vital for their hopes of qualifying automatically for this year’s World Cup. Even before he had become Nortje’s fourth and final victim, Archer’s return was not the one of which he would have dreamt, figures of one-for-81 his most expensive in ODI cricket, but both he and England must have the patience for the long game after so much time apart. For Roy, the sense of immediate jeopardy was far greater. Dropped from England’s T20 side ahead of last year’s World Cup triumph amid a prolonged lean spell, it was true that the 32-year-old’s ODI returns - including a century in the Netherlands in July - had offered slightly less cause for alarm. But with opportunities to serve reminders of his ability in this format few and far between, the Surrey batter arrived in South Africa with serious questions over his place at the top of the order for the first time since making it his own. Just three deliveries into his series, though, Roy was away, ball racing off the middle of bat and through midwicket for four, something telling you this might just be his day. What followed was a knock of composure and aggression in equal parts, played with terrific tempo and a knack for the choosing of moments that can only come with having done this job for so long. Aiden Markram tried to sneak an over of part-time off-spin at the end of the powerplay and was belted for six. A hundred-partnership with Dawid Malan was brought up hooking Nortje high over the ropes, too. When Tabraiz Shamsi overstepped, the resulting free-hit went the same way. Having motored into the eighties, Roy’s charge was briefly put on hold as first Malan (59) fell and then both Ben Duckett and Harry Brook followed in successive overs, the latter trapped lbw for nought on debut, one of three scalps for the impressive Sisandra Magala. On reaching his century, off just 79 balls, Roy almost hurled his shoulder out of its socket with an uppercut punch of the air in pent-up celebration. Nine months out from the World Cup, with , it was an innings that could not have been more timely. In hindsight, though, England could still have done with more. Timely: Roy returned to form even despite England’s defeat A trip to India in October is also the goal for Archer, though, of course, there is the prospect of a Test return and Ashes series on the horizon before then, should all go to plan. Buttler and Matthew Mott had each tried to temper expectations and , but having seen the 26-year-old arrive back in competitive cricket with a wicket-maiden in his first over for MI Cape Town earlier this month, it was not difficult to get carried away. In the end, though, Archer’s opening spell of five overs was simply solid, consistently reaching speeds in the high-eighties throughout without quite troubling the 90mph bracket that signals true express pace. The major positive of Archer’s ten overs on comeback was the fact that he got through quite so many, though by the end it had clearly become something of a grind: a first international wicket in almost two years came in his final over, after the previous one had included two no-balls and cost 20. Instead it was Sam Curran, the player of the tournament at the T20 World Cup late last year, who picked up where he left off in England colours, the pick of the bowlers as he took three-for-35 in nine overs, as well as a terrific diving catch to dismiss Temba Bavuma (36) and make the initial breakthrough after the Proteas skipper had won the toss and made a positive start to the powerplay alongside Quinton de Kock. It is a measure of Curran’s standing now that, later, his dismissal felt like the moment English hopes disappeared. Quite why he slashed at the final ball of Kagiso Rabada’s spell, feathering behind, is anyone’s guess but eight-down with 33 still needed, the game was up.","pubDate":"2023-01-27 20:29:18","image_url":"https://static.standard.co.uk/2023/01/27/20/newFile-3.jpg?width=1200&auto=webp","source_id":"standarduk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Cricket-Roy ton in vain as England collapse to defeat in first S.Africa ODI","link":"https://www.thestar.com.my/sport/cricket/2023/01/28/cricket-roy-ton-in-vain-as-england-collapse-to-defeat-in-first-safrica-odi","keywords":null,"creator":null,"video_url":null,"description":"(Reuters) - England opener Jason Roy smashed his way back into form with 113 from 91 balls but the tourists lost from a commanding position as South Africa claimed victory by 27 runs in the first One-Day International at Manguang Oval in Bloemfontein on Friday. Read full story","content":"(Reuters) - England opener Jason Roy smashed his way back into form with 113 from 91 balls but the tourists lost from a commanding position as South Africa claimed victory by 27 runs in the first One-Day International at Manguang Oval in Bloemfontein on Friday. The hosts won the toss and elected to bat, posting 298 for seven, their total boosted by 111 from Rassie van der Dussen, before restricting England to 271 all out in their reply. The visitors raced to 146 without loss in the 20th over as they bludgeoned the home bowling attack to all parts of the ground but when Dawid Malan (59) was the first wicket to fall, there was a stutter in England's chase. They were largely undone by poor shot selection at the back end of the innings when calm heads would have seen them comfortably home, losing 10 wickets for the addition of 125 runs following the massive opening stand. \"Disappointed, we played some excellent cricket for the majority of the game,\" England captain Jos Buttler said. \"To have that conviction and commitment to keep taking it on has served us well for a long time. We are disappointed we did not go on and win.\" Roy, who has battled with the bat in recent months, reached his 11th ODI century off 79 balls to keep the scoreboard moving as wickets fell at the other end, while Buttler chipped in with 36 but could not see his side to victory. South Africa’s innings was anchored by the 111 off 117 balls from middle-order batsman Van der Dussen, who completed a fourth ODI century. He was supported by David Miller (53) as the pair put on 110 for the fifth wicket. Seamer Sam Curran was the pick of England's bowlers with 3-35 from his nine overs, but it was a day to forget for fast bowler Jofra Archer, with 1-81 in his 10 overs. It was his first ODI in almost two years after two elbow operations and a stress fracture in his back. The result is a boost for South Africa, who need a clean sweep of the series to stay on course for guaranteed qualification for the World Cup in India later this year. The second match in the three-game series will be played at the same venue on Sunday. (Reporting by Nick Said; Editing by Ken Ferris)","pubDate":"2023-01-27 19:44:00","image_url":"https://apicms.thestar.com.my/uploads/images/2023/01/28/1918904.jpg","source_id":"thestar_my","category":["sports"],"country":["malaysia"],"language":"english"},{"title":"India vs New Zealand: Conway sets the platform, Mitchell's crucial knock and other talking points from 1st T20I","link":"https://www.firstpost.com/firstcricket/sports-news/india-vs-new-zealand-conway-sets-the-platform-mitchells-crucial-knock-and-other-talking-points-from-1st-t20i-12060252.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"India vs New Zealand: Conway sets the platform, Mitchell's crucial knock and other talking points from 1st T20I","content":"Cricket India vs New Zealand: Conway sets the platform, Mitchell's crucial knock and other talking points from 1st T20I From Devon Conway setting the platform to Daryl Mitchell's crucial knock, here are five talking points from the first India-New Zealand T20I. FirstCricket Staff January 28th, 2023 1:12:11 IST Daryl Mitchell scored an unbeaten 59 to take New Zealand to a challenging total. Sportzpics New Zealand had the last laugh in the first T20I against India in Ranchi on Friday, beating the hosts by 21 runs to take a 1-0 lead in the series. Fifties from Devon Conway (52) and Daryl Mitchell (59*) took the Kiwis to 176 after being put to bat first, a total they successfully defended with the help of bowlers. The Indian top-order failed to get going, and had to rely on Suryakumar Yadav (47), Washington Sundar (50), and a cameo from skipper Hardik Pandya (21 off 20 balls). The hosts did not get off to a flying start in the chase, having lost three wickets in quick succession and being restricted to 33/3 in the powerplay phase. Hardik Pandya and Co will look to improve on certain aspects as they aim to crawl back into the series, in Lucknow on Sunday. Let’s now take a look at five talking points from the series-opener: Clinical Washington Sundar Game time is important for players like Washington Sundar as the team management looks towards youngsters with the 2024 T20 World Cup in their sights, and the 23-year-old impressed pretty well in the first T20I against New Zealand, despite his team going down. Sundar was introduced by Hardik as early as in the third over of the Kiwi innings, and struck twice in the fifth over of the innings, getting rid of opener Finn Allen and Mark Chapman, after New Zealand had got off to a brisk start. Sundar’s dismissal of Chapman caught the eye of many, taking a one-handed stunner off his own bowling to see off the Hong Kong-born cricketer. WHAT. A. CATCH 🔥🔥 @Sundarwashi5 dives to his right and takes a stunning catch off his own bowling 😎 #TeamIndia | #INDvNZ Live – https://t.co/9Nlw3mU634 #INDvNZ @mastercardindia pic.twitter.com/8BBdFWtuEu — BCCI (@BCCI) January 27, 2023 Sundar eventually finished with figures of 2/22 from four overs. Later, Sundar came into bat at number six following the dismissal of Suryakumar Yadav, but he could not build substantial partnerships with his partners, and that hurt India’s momentum. However, Sundar showcased his brilliance with the bat, getting to his fifty off 25 balls, hitting five fours and three sixes. Devon Conway’s knock sets the platform for NZ New Zealand had lost two wickets in Finn Allen and Mark Chapman after a brisk start early on in the powerplay, but Devon Conway kept calm and let his bat do the talking. Conway opened with Finn and forged a 43-run stand for the opening stand before he lost his fist two partners, but then came Glenn Phillips who despite managing just 17 runs, forged a 60-run stand with Conway. Top knock from Devon Conway 💛 52 Runs | 35 Balls | 7 Fours | 1 Six #INDvNZ #WhistlePodu pic.twitter.com/vtntrEaAB3 — WhistlePodu Army ® – CSK Fan Club (@CSKFansOfficial) January 27, 2023 Following Philips’ dismissal, Daryl Mitchell was the new man in, and the two shared 36 runs between them for the fourth wicket, before Conway was finally dismissed by Arshdeep Singh in the 18 th over. After the double blow for the Kiwis in the latter half of powerplay overs, It was Conway’s knock that set the platform for a challenging total. Daryl Mitchell’s crucial knock If it was Conway who set the tone for a challenging total, Daryl Mitchell (59*) made sure he made it even more worth it, staying unbeaten till the end. New Zealand had just lost Phillips, and in came Mitchell, who wasted no time to settle down, and got to his fifty off 26 deliveries. 6,6,6,4,0,2,2 by Daryl Mitchell in the final over helped Kiwis to post 176 for 6. — Johns. (@CricCrazyJohns) January 27, 2023 That last over from Arshdeep Singh proved to be the game-changer for New Zealand. As many as 27 runs came off that over, with three sixes and a four off Mitchell to turn the table in Kiwis’ favour. What’s worse, the first ball Arshdeep bowled in that final over was a no-ball, that went for a six, and what followed after was not pleasing for any Indian fan. It’s safe to say that Mitchell in fact stole the show in the final over for the Kiwis. India lose early wickets The pitch in Ranchi offered a lot of turn and bounce, and it was a tricky pitch to chase on. The Men in Blue found the going tough early on in the run chase, losing three early wickets inside the powerplay overs. Ishan Kishan was the first to get dismissed, in the second over, having been cleaned up by Michael Bracewell, who unleashed a peach of a delivery as the ball spun past the outside edge to hit the off-stump. Rahul Tripathi was the next to depart, after a not out decision was overturned following a New Zealand review. It was an appeal for a caught behind off Jacob Duffy’s ball, and UltraEdge showed a spike to prove the ball hit the bat on the way to the keeper. And to make matters worse, Shubman Gill, who had scored a double century in the first ODI against the Kiwis recently, was dismissed by Mitchell Santner, with Finn Allen completing a catch at forward square leg. SKY-Pandya stand India were in a spot of bother at 15/3 following the dismissal of Gill, but there was a revival of sorts thanks to a 68-run stand between Suryakumar Yadav and Hardik Pandya. While SKY could not register a fifty on Friday, his innings was still impactful, hitting six fours and two sixes in an innings that lasted 34 deliveries. The two played some entertaining loft shots, some slog sweeps, to help India reach a position where they could take the Kiwis down, but they lost SKY just when he was looking in good rhythm. Hardik followed soon after in the 13 th over, and following his dismissal, India were in all sorts of trouble once again, and it was difficult for the Men in Blue to claw back into the game. Read all the Latest News , Trending News , Cricket News , Bollywood News , India News and Entertainment News here. Follow us on Facebook , Twitter and Instagram . Updated Date: January 28, 2023 01:12:11 IST Tags: Cricket India Vs New Zealand Washington Sundar Find latest and upcoming tech gadgets online on Tech2 Gadgets. Get technology news, gadgets reviews & ratings. Popular gadgets including laptop, tablet and mobile specifications, features, prices, comparison.","pubDate":"2023-01-27 19:42:11","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/01/Daryl-Mitchell-640_Sportzpics.jpg","source_id":"firstpost","category":["sports"],"country":["india"],"language":"english"},{"title":"South Africa claim victory after England collapse in first one-day international","link":"https://www.theguardian.com/sport/2023/jan/27/south-africa-england-first-one-day-international-match-report-cricket","keywords":["South Africa cricket team","England cricket team","Cricket","Sport"],"creator":["Neil Manthorp at the Mangaung Oval"],"video_url":null,"description":"South Africa 298-7; England 271England were 146-0 with Jason Roy hitting a centuryJason Roy scored a vintage century to signal a welcome and overdue return to form but it wasn’t enough to prevent England losing a game they should have won comfortably when they went down by 27 runs to South Africa in the first of three ODIs at the Mangaung Oval on Friday night.Sam Curran, with three for 35, led the way as England restricted the hosts to 298 for seven on a modestly two-paced but otherwise perfect batting surface and the run-chase was given the perfect start with Roy and Dawid Malan adding 146 for the first wicket. Continue reading...","content":null,"pubDate":"2023-01-27 19:41:16","image_url":"https://i.guim.co.uk/img/media/a73e7fc5e320a05e8b66ae3bb26b2348d553f538/0_66_3078_1847/master/3078.jpg?width=460&quality=85&auto=format&fit=max&s=7e3048264bcf9e2d60dd2c23f6affbab","source_id":"theguardian","category":["sports"],"country":["canada","united kingdom","india","singapore"],"language":"english"},{"title":"5 talking points as England fall to South Africa defeat despite sparkling Jason Roy ton","link":"https://www.mirror.co.uk/sport/cricket/england-south-africa-magala-roy-29070983","keywords":["Sport"],"creator":["mirrornews@mirror.co.uk (Matthew Cooper)"],"video_url":null,"description":"Sisanda Magala and Anrich Nortje led an excellent fightback with the ball for South Africa, who beat England by 27 runs despite a brilliant hundred from Jason Roy","content":"South Africa took an important first step towards qualification for the 50-over World Cup , with a hundred from Rassie Van der Dussen and crucial wickets from Sisanda Magala and Anrich Nortje earning them a remarkable fightback win over England . The Proteas need to secure a 3-0 whitewash over England and then win their last two ODIs against the Netherlands to ensure they qualify for this year's tournament, otherwise they face featuring in a pre-qualifying tournament later this year. And Temba Bavuma's side fought hard to secure a 27-run win over England, who welcomed back Jofra Archer after a 22-month absence and saw Jason Roy rediscover his best form with an outstanding century. Having won the toss and opted to bat first, Rassie van der Dussen was the star of the show for South Africa as he struck an excellent 111 off 117 balls to help the hosts post 298-7. He shared a brilliant partnership worth 110 with David Miller to drag South Africa towards the 300 mark, having seen Bavuma, Quinton de Kock and Heinrich Klaasen all failing to capitalise on promising starts. In response, England got off to a perfect start as Roy and Dawid Malan shared an outstanding 146-run opening partnership. They both quickly brought up their half-centuries, before Malan top edged Magala to mid-off for 59 to spark a mini collapse that saw England lost three wickets for just six runs. And Magala, Nortje and Kagiso Rabada proceeded to pick up regular wickets as England fell from 146-0 to 271 all out, with Tabraiz Shamsi taking a simple return catch to dismiss Olly Stone and seal a remarkable win for South Africa. England throw away first South Africa ODI as Proteas stage remarkable fightback Joe Root lifts lid on England World Cup plans and \"drastic\" changes to his batting Jofra Archer made his first England appearance in almost two years ( Image: MARCO LONGARI/AFP via Getty Images) Archer's return After 678 days, Archer made his long-awaited England return as he played his first match since March 2021. The 27-year-old is one of the best bowlers in the world when he is on song and it was great to see him bowl his full quota of ten overs, having ramped up his workload from the four over spells he was delivering in the SA20. Speaking before the game Archer admitted he was only \"about 80%\" fit and, despite impressing in the SA20, he was England's most expensive bowler as he ended with figures of 1-81. However, performances really matter little at this point for Archer after such a long spell on the sidelines and it is simply a case of easing him back ahead of the Ashes and the 50-over World Cup. Rassie van der Dussen scored an excellent century for South Africa ( Image: Lee Warren/Gallo Images) Van der Dussen's hundred In what proved to be a match winning knock, Van der Dussen held South Africa's innings together as he struck 111 off 117 balls and shared an important partnership worth 110 with Miller. Van der Dussen has been immense in ODI cricket since making his debut in 2019, with his fourth century in the format meaning he now has the second best batting average of any player to have scored at least 1,000 ODI runs. Across 39 games, Van der Dussen has scored 1,636 runs at 71.13, with only India opener Shubman Gill boasting a superior average of 73.76. Sam Curran was excellent with the ball for England, picking up 3-35 ( Image: Alex Davidson/Getty Images) Curran impresses After a stunning T20 World Cup campaign where he was named both player of the tournament and player of the match in the final, Curran now has his sights set on a starring role at this year's 50-over World Cup. Following a disappointing SA20 stint where he picked up just three wickets at an average of 55, Curran was back to his best as soon as he pulled on an England shirt. In a nine-over spell, he picked up 3-35 and was comfortably the best bowler on show as he conceded just two boundaries while taking the big wickets of De Kock, Van der Dussen and Miller. It was an impressive display from the 24-year-old and he looks set to play a key role for England in their World Cup defence later this year. ( Image: MARCO LONGARI/AFP via Getty Images) Roy finds much-needed form Roy was back to his best in emphatic fashion as he struck a brilliant 113 off 91 balls in Bloemfontein. He entered this series with his place in the side under threat after an extended run of poor form saw him axed ahead of England's T20 World Cup winning campaign last year. He had been unable to rediscover his form in the SA20 ahead of this series, where he scored 100 runs in eight innings while striking at just 91.74. However, Roy was able to put those struggles behind him and looked every inch the player who has been so crucial to England's white-ball revolution and 2019 50-over World Cup win as he smashed an 11th ODI ton. Although he was unable to get England over the line, Roy's innings is a major positive and he will be hoping it will spark a more prolific run of form heading into the World Cup after recent struggles Harry Brook was out for a duck on his ODI debut ( Image: MARCO LONGARI/AFP via Getty Images) Brook's duck on debut Having ended 2022 with a T20 World Cup winner's medal and three Test centuries, it feels surprising that Brook is only just making his ODI debut. The 23-year-old has not played a List A game since 2019 as a result of the Covid pandemic and The Hundred, but England view him as a potential superstar in all three formats and will give him chances to force his way into their World Cup side. With Eoin Morgan and Ben Stokes now retired, although head coach Matthew Mott is hopeful Stokes will return for the World Cup, there are spots up for grabs in the middle order and Brook is very much in contention for one of them. However, he was unable to make an impact on debut as he fell lbw for a three-ball duck to Magala, who was outstanding for the Proteas with 3-46 from his nine overs. Read More Kevin Pietersen hails England youngster \"not afraid to take a risk\" after impressive SA20 Read More Ben Stokes opens up about mental health break - \"Everything got a bit too much for me\" Read More Eoin Morgan offers his verdict on Ben Stokes and Brendon McCullum's England revolution Read More Jos Buttler confirms England are planning for 50-over World Cup without Ben Stokes Read More Steve Harmison pinpoints England difference maker ahead of Australia Ashes clash","pubDate":"2023-01-27 19:35:41","image_url":"https://i2-prod.mirror.co.uk/incoming/article29071021.ece/ALTERNATES/s615/0_GettyImages-1246594258.jpg","source_id":"mirroruk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Doubleheader curse haunts Itanda Kayakers, lose to Bujjagali Rafters and Sipi Trekkers","link":"https://kawowo.com/2023/01/27/doubleheader-curse-haunts-itanda-kayakers-lose-to-bujjagali-rafters-and-sipi-trekkers/","keywords":["Cricket"],"creator":["Denis Musali"],"video_url":null,"description":"Waterfalls Men’s T20 Tournament Game 3: Itanda Kayakers v Bujjagali RaftersItanda Kayakers: 133 all outBujjagali Rafters 136/9Bujjagali Rafters won by 1 wicketPlayer of the Match: Siraje Nsubuga (4/20)Full Match Scorecard: http://www.ugcricket.com/Uganda/viewScorecard.do?matchId=1717&clubId=5335 Game 4: Sipi Trekkers v Itanda KayakersItanda Kayakers: 131/7Sipi Trekkers: 132/7Sipi Trekkers won by 3 wicketsPlayer of the Match: Sami SohailFull Match Scorecard: http://www.ugcricket.com/Uganda/viewScorecard.do?matchId=1719&clubId=5335 […] The post Doubleheader curse haunts Itanda Kayakers, lose to Bujjagali Rafters and Sipi Trekkers appeared first on Kawowo Sports.","content":"Itanda Kayakers v Bujjagali Rafters Itanda Kayakers: 133 all out Bujjagali Rafters 136/9 Bujjagali Rafters won by 1 wicket Player of the Match: Siraje Nsubuga (4/20) Full Match Scorecard: Sipi Trekkers v Itanda Kayakers Itanda Kayakers: 131/7 Sipi Trekkers: 132/7 Sipi Trekkers won by 3 wickets Player of the Match: Sami Sohail Full Match Scorecard: Bujjagali Rafters will sleep worried tonight because none of the teams has been able to win a game on their doubleheader day of the Men’s Waterfalls T20. With the chasing pack behind them doing their homework you fear that you could throw it away on the last day of the group games. Bujjagali Rafters are on top of the table because they are the only side that has won two games with Itanda Kayakers and Sipi Trekkers having won only a game each. Itanda Kayakers used a lot of energy in the morning game against Bujjagali Rafters in a match that went the distance with Bujjagali getting over the line by just one wicket. It was a seesaw game that was balanced for most of the duration until Juma Miyagi took charge in the final over to win the game for the Rafters. In the afternoon, Itanda Kayakers won the toss and elected to bat, but as was in the morning they failed to put on any meaningful partnership and were only able to get to 131 because Bilal Hassun’s exploits in the final over where he hit 3 sixes in a row. In the chase, Sipi Trekkers were put on the winning course by Brian Asaba and Orichide Tuyisenge who had an opening partnership of 53 with contributions coming from the rest of the team as they got over the line by 3 wickets. The two losses for Itanda Kayakers keep them behind Bujjagali Rafters but at least keep Sipi Trekkers at bay due to a superior Net Run Rate. Action will continue tomorrow at the Lugogo Cricket Oval.","pubDate":"2023-01-27 19:23:05","image_url":null,"source_id":"kawowo","category":["sports"],"country":["uganda"],"language":"english"},{"title":"Highlights, South Africa vs England, 1st ODI in Bloemfontein: Proteas win by 27 runs, go 1-0 up in series","link":"https://www.firstpost.com/firstcricket/sports-news/highlights-south-africa-vs-england-1st-odi-in-bloemfontein-proteas-win-by-27-runs-go-1-0-up-in-series-12057902.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"Highlights, South Africa vs England, 1st ODI in Bloemfontein: Proteas win by 27 runs, go 1-0 up in series","content":"Cricket Highlights, South Africa vs England, 1st ODI in Bloemfontein: Proteas win by 27 runs, go 1-0 up in series Nortje and Magala restrict England to 271 after van der Dussen's ton helps South Africa set a stiff 299-run target FirstCricket Staff January 28th, 2023 0:39:58 IST England skipper Jos Buttler and his South African counterpart Temba Bavuma at the toss ahead of the first ODI in Bloemfontein. Twitter @ICC Toss update: Fast bowler Jofra Archer was back in the England team for the first time in nearly two years for the first one-day international against South Africa on Friday. South Africa captain Temba Bavuma won the toss and chose to bat first at Mangaung Oval in Bloemfontein at the start of a three-match series that the teams will finally get to play after it was postponed in 2020 because of the coronavirus pandemic. Archer last played international cricket in March 2021 and last appeared in an ODI in September 2020. He was out with elbow and back injuries but has been playing in the South African domestic Twenty20 league to prove his fitness for the ODI series. Batsman Harry Brook will make his ODI debut for England. South Africa recalled seam bowler Sisanda Magala for his first ODI in a year. Lineups: South Africa: Quinton de Kock, Temba Bavuma (captain), Rassie van der Dussen, Aiden Markram, Heinrich Klaasen, David Miller, Wayne Parnell, Sisanda Magala, Kagiso Rabada, Anrich Nortje, Tabraiz Shamsi England: Jason Roy, Dawid Malan, Ben Duckett, Harry Brook, Jos Buttler (captain), Moeen Ali, Sam Curran, David Willey, Adil Rashid, Jofra Archer, Olly Stone. With inputs from The Associated Press Read all the Latest News , Trending News , Cricket News , Bollywood News , India News and Entertainment News here. Follow us on Facebook , Twitter and Instagram . Updated Date: January 28, 2023 00:39:58 IST Tags: Cricket Jofra Archer South Africa Vs England Find latest and upcoming tech gadgets online on Tech2 Gadgets. Get technology news, gadgets reviews & ratings. Popular gadgets including laptop, tablet and mobile specifications, features, prices, comparison.","pubDate":"2023-01-27 19:09:58","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/01/SA-vs-ENG-1st-ODI-toss-640_Twitter-@ICC.jpg","source_id":"firstpost","category":["sports"],"country":["india"],"language":"english"},{"title":"South Africa withstand Jason Roy brilliance to win first one-day international","link":"https://www.sportsmole.co.uk/cricket/england/news/south-africa-withstand-roy-brilliance-to-win-first-odi_505242.html","keywords":["Cricket","England","South Africa","Jason Roy","Moeen Ali","Sam Curran","Olly Stone","Quinton de Kock","Rassie van der Dussen","David Miller","Dawid Malan","Ben Duckett","Harry Brook","Kagiso Rabada","Jos Buttler","Anrich Nortje","David Willey","Adil Rashid","505242"],"creator":null,"video_url":null,"description":"South Africa withstand a brilliant century from Jason Roy to record a 27-run victory over England in the first one-day international in Bloemfontein.","content":"After winning the toss, South Africa opted to bat first, and the home side impressed during the opening stages as they put on 61 in 8.1 overs for the first wicket. However, by 21.1 overs, the Proteas had been restricted to just 116-3, Moeen Ali , Sam Curran and Olly Stone all chipping in with a wicket apiece. At the time, Quinton de Kock was the top scorer in the pavilion with 37, but that was about to change as Rassie van der Dussen moved the ball around for a patient century. Although he chipped in with just six boundaries and a maximum, Van der Dussen made 111 off 117 deliveries, keeping the innings together before his departure late on. David Miller made 53 at an almost identical strike-rate, taking South Africa to 298-7 off their allotted overs with Curran's 3-35 the best bowling figures for England. 🚨 WICKET 🚨 South Africa win by 27 runs after a remarkable bowling performance pic.twitter.com/7UJaC9DIOS Despite the target being well within England's capabilities, they would theoretically have to work hard to achieve it, yet Roy and Dawid Malan indicated that would not be the case. The pair put on 146 for the opening stand in 19.3 overs before Malan was dismissed for 59 from 55 balls, and that resulted in a collapse from the visitors. Ben Duckett (3) and Harry Brook (0) went cheaply, with it taking a counter-attack from Roy to move England to 196-4 when his wicket went to Kagiso Rabada for 113 off 91 balls, hitting 11 fours and four maximums. With a deep batting lineup, England were not at a point where they needed to panic until the dismissals of Moeen (11) and Jos Buttler (36) left them on 234-6, still requiring 65 off 78 balls. Anrich Nortje soon took his third wicket, removing David Willey for nine, putting Curran and Adil Rashid in a position where they needed to protect their wickets and prevent the run-rate from moving to more than a run per ball. Although they put on 16 for the eighth wicket, South Africa's attack prove too fearsome for the tail-enders, Rashid left stranded on 14 not out as England were bowled out for 271 with 34 balls left unused.","pubDate":"2023-01-27 19:00:31","image_url":"https://sm.imgix.net/21/11/jos-buttler.jpg","source_id":"sportsmole","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Warner 'exhausted' ahead of India tour","link":"https://www.perthnow.com.au/sport/cricket/warner-exhausted-ahead-of-india-tour-c-9581930","keywords":null,"creator":["Jasper Bruce"],"video_url":null,"description":"Australian Test veteran David Warner says a busy summer of cricket has left him exhausted ahead of next month's Test tour of India.","content":"David Warner is feeling exhausted ahead of next month's Test tour of India and admits he would have preferred the night off from the Allan Border Medal this Monday to recover from a busy home summer. Warner's hectic summer officially came to an end on Friday night when the Brisbane Heat eliminated his Sydney Thunder from the Big Bash finals. Starting in August, Warner played in the white-ball series against Zimbabwe, New Zealand, England and the West Indies, in every game of Australia's T20 World Cup campaign, in each Test match of the home series against the West Indies and South Africa, and then managed six BBL games on his return to the tournament. \"It's been challenging,\" Warner told reporters of his busy summer. \"I'm quite tired, exhausted.\" India's difficult wickets are lying in wait, as is the challenge to find consistent form with the bat following a Test summer that yielded a memorable double-century and a spate of unconvincing knocks. The 36-year-old has five days to rest up before India, but one of his evenings will be taken up by Cricket Australia's Allan Border Medal, to be attended by the Test squad ahead of their staggered flights out. T20I teammate Marcus Stoinis and BBL star Chris Lynn are missing the awards night to play franchise cricket overseas. \"There are a few guys who have gone to the UAE League, which aren't going to the Cricket Australia awards,\" Warner said. \"From my perspective, that would've been nice to have had another night at home. But it is what it is.\" Warner's best performance of the BBL summer came on Friday night, when a rapid-fire 36 runs from 20 balls had the Thunder on track before rain washed the game out. While his results have not lived up to his billing, the opener said his intention had never been to use the BBL cameo to limber up for the longer format in India. \"You're not really trying to negate the spinning ball, it's a white ball as well,\" Warner said of the BBL. \"For me, it was about coming back and trying to inject some energy into the Thunder team and trying to put my best foot forward for the team. \"It hasn't come off this year.\" Warner is contracted for one more summer with the Thunder and will come into the tournament on the back of an ODI World Cup in India, and potentially after a similarly busy home Test summer if he is still playing and selected. \"Hopefully next year I can come out and be a little bit fresher than what I am at the moment,\" he said. \"It's going to be a long lead-in to our summer. \"From a personal point of view, I'm going to have to try and work out how to stay nice and fresh.\"","pubDate":"2023-01-27 22:51:24","image_url":"https://images.perthnow.com.au/publication/C-9581930/77d506a98ed8e8d58b2bdd653b6433be766333de-16x9-x0y0w1280h720.jpg","source_id":"perthnow","category":["sports"],"country":["australia"],"language":"english"},{"title":"Jos Buttler hails ‘phenomenal’ Jason Roy after century in England’s defeat to South Africa","link":"https://www.standard.co.uk/sport/cricket/south-africa-vs-england-odi-jason-roy-jos-buttler-2023-b1056248.html","keywords":["Cricket","Sport"],"creator":["Malik Ouzia"],"video_url":null,"description":"Jos Buttler hailed Jason Roy’s “phenomenal” innings as the under-pressure England opener returned to form in fine style during Friday’s ODI defeat to South Africa.","content":"hailed ’s “phenomenal” innings as the under-pressure opener returned to form in fine style during Friday’s ODI defeat to . The Surrey batter scored a brilliant 113 off 91 balls but England failed to take advantage as they slumped from 146 for-nought to be all-out for 271 chasing 299 for victory. Roy has and was dropped from England’s T20 side in the build-up to the T20 World Cup success in Australia before Christmas. The 32-year-old’s lean spell has continued in South Africa’s new SA20 league since the New Year, but returning to 50-over cricket appeared to work the oracle as Roy produced a commanding knock, including 11 fours and four sixes, in the series opener at Mangaung Oval. “He looked completely back to his best,” England captain Buttler said. “It was a phenomenal innings full of personality and courage, some fantastic shots. “I’m delighted to see him back to his best, he’s worked really hard to get there and been through a tough time. That can happen to everyone in cricket, we all go through those tough periods. “Having the strength of character to come out and play in the fashion he did today and really impose himself was fantastic to see.” Buttler has been playing alongside Roy in the SA20 for Paarl Royals and says he had seen signs of his teammate closing on a return to form. “I didn’t think he was far away at all,” Buttler added. “Being around him in the SA20, he’s been very consistent with his mindset even though he’s not got the runs he would have liked. He’s trained well and hit the ball well and he’s saying all the right things. “You’re never far away from a great day when you’re a player of that quality. It’s always going to come back at some point. We keep backing him and we were desperate for him to score those runs because he’s such an imposing player for us at the top of the order.” Jofra Archer made his first England appearance since March 2021, following a series of back and elbow problems. Jofra Archer returned to England duty for the first time in 678 days The seamer finished with figures of one-for-81, his most expensive in ODI cricket, but Buttler hailed another step on what is being a carefully plotted comeback. “It was always going to be a big challenge for him to get back to bowling 10 overs in a game and to have to come back and bowl spells,” Buttler said, with Archer’s only competitive cricket since his return having come in the SA20. “He’s obviously started in T20 cricket only very recently, bowling a maximum of four overs in a game and spells of maybe two overs at a time. \"It’s a bit step-up for him and I’m delighted see him come through that, it’s great to see him in an England shirt and back taking a wicket in an England shirt as well. “They’re all big steps even though he’s such a superstar of the game. They’re all good steps on the way to getting him back to being at his best.”","pubDate":"2023-01-27 20:44:26","image_url":"https://static.standard.co.uk/2023/01/27/20/newFile-5.jpg?width=1200&auto=webp","source_id":"standarduk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"South Africa vs England: Jason Roy century and Jofra Archer return not enough to stop opening defeat","link":"https://www.standard.co.uk/sport/cricket/south-africa-vs-england-odi-cricket-result-2023-b1056247.html","keywords":["Cricket","Sport"],"creator":["Malik Ouzia"],"video_url":null,"description":"It had been 678 days since England had been able to call upon Jofra Archer and, so it felt, almost as long since they had seen the best of Jason Roy.","content":"t had been 678 days since had been able to call upon and, so it felt, almost as long since they had seen the best of . Here in Bloemfontein, twin waits came to an end, but a day that began with Archer’s return to action, and encompassed Roy’s emphatic return to form in the shape of an 11th international hundred, ended in defeat as claimed victory in a lively conclusion to the First One-Day International. Roy’s 113 off 91 balls came in reply to another century from Rassie van der Dussen, but in being restricted to 298-for-seven, the Proteas appeared to have failed to take full advantage of a flat surface at Mangaung Oval. At 146 without loss and again at 196-for-three, the tourists looked well on top in the chase but a brilliantly hostile spell from Anrich Nortje turned the tide. England fluffed their lines and were skittled 28 runs short of victory as South Africa took a 1-0 lead in a series that is vital for their hopes of qualifying automatically for this year’s World Cup. Even before he had become Nortje’s fourth and final victim, Archer’s return was not the one of which he would have dreamt, figures of one-for-81 his most expensive in ODI cricket, but both he and England must have the patience for the long game after so much time apart. For Roy, the sense of immediate jeopardy was far greater. Dropped from England’s T20 side ahead of last year’s World Cup triumph amid a prolonged lean spell, it was true that the 32-year-old’s ODI returns - including a century in the Netherlands in July - had offered slightly less cause for alarm. But with opportunities to serve reminders of his ability in this format few and far between, the Surrey batter arrived in South Africa with serious questions over his place at the top of the order for the first time since making it his own. Just three deliveries into his series, though, Roy was away, ball racing off the middle of bat and through midwicket for four, something telling you this might just be his day. What followed was a knock of composure and aggression in equal parts, played with terrific tempo and a knack for the choosing of moments that can only come with having done this job for so long. Aiden Markram tried to sneak an over of part-time off-spin at the end of the powerplay and was belted for six. A hundred-partnership with Dawid Malan was brought up hooking Nortje high over the ropes, too. When Tabraiz Shamsi overstepped, the resulting free-hit went the same way. Having motored into the eighties, Roy’s charge was briefly put on hold as first Malan (59) fell and then both Ben Duckett and Harry Brook followed in successive overs, the latter trapped lbw for nought on debut, one of three scalps for the impressive Sisandra Magala. On reaching his century, off just 79 balls, Roy almost hurled his shoulder out of its socket with an uppercut punch of the air in pent-up celebration. Nine months out from the World Cup, with , it was an innings that could not have been more timely. In hindsight, though, England could still have done with more. Timely: Roy returned to form even despite England’s defeat A trip to India in October is also the goal for Archer, though, of course, there is the prospect of a Test return and Ashes series on the horizon before then, should all go to plan. Buttler and Matthew Mott had each tried to temper expectations and , but having seen the 26-year-old arrive back in competitive cricket with a wicket-maiden in his first over for MI Cape Town earlier this month, it was not difficult to get carried away. In the end, though, Archer’s opening spell of five overs was simply solid, consistently reaching speeds in the high-eighties throughout without quite troubling the 90mph bracket that signals true express pace. The major positive of Archer’s ten overs on comeback was the fact that he got through quite so many, though by the end it had clearly become something of a grind: a first international wicket in almost two years came in his final over, after the previous one had included two no-balls and cost 20. Instead it was Sam Curran, the player of the tournament at the T20 World Cup late last year, who picked up where he left off in England colours, the pick of the bowlers as he took three-for-35 in nine overs, as well as a terrific diving catch to dismiss Temba Bavuma (36) and make the initial breakthrough after the Proteas skipper had won the toss and made a positive start to the powerplay alongside Quinton de Kock. It is a measure of Curran’s standing now that, later, his dismissal felt like the moment English hopes disappeared. Quite why he slashed at the final ball of Kagiso Rabada’s spell, feathering behind, is anyone’s guess but eight-down with 33 still needed, the game was up.","pubDate":"2023-01-27 20:29:18","image_url":"https://static.standard.co.uk/2023/01/27/20/newFile-3.jpg?width=1200&auto=webp","source_id":"standarduk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Cricket-Roy ton in vain as England collapse to defeat in first S.Africa ODI","link":"https://www.thestar.com.my/sport/cricket/2023/01/28/cricket-roy-ton-in-vain-as-england-collapse-to-defeat-in-first-safrica-odi","keywords":null,"creator":null,"video_url":null,"description":"(Reuters) - England opener Jason Roy smashed his way back into form with 113 from 91 balls but the tourists lost from a commanding position as South Africa claimed victory by 27 runs in the first One-Day International at Manguang Oval in Bloemfontein on Friday. Read full story","content":"(Reuters) - England opener Jason Roy smashed his way back into form with 113 from 91 balls but the tourists lost from a commanding position as South Africa claimed victory by 27 runs in the first One-Day International at Manguang Oval in Bloemfontein on Friday. The hosts won the toss and elected to bat, posting 298 for seven, their total boosted by 111 from Rassie van der Dussen, before restricting England to 271 all out in their reply. The visitors raced to 146 without loss in the 20th over as they bludgeoned the home bowling attack to all parts of the ground but when Dawid Malan (59) was the first wicket to fall, there was a stutter in England's chase. They were largely undone by poor shot selection at the back end of the innings when calm heads would have seen them comfortably home, losing 10 wickets for the addition of 125 runs following the massive opening stand. \"Disappointed, we played some excellent cricket for the majority of the game,\" England captain Jos Buttler said. \"To have that conviction and commitment to keep taking it on has served us well for a long time. We are disappointed we did not go on and win.\" Roy, who has battled with the bat in recent months, reached his 11th ODI century off 79 balls to keep the scoreboard moving as wickets fell at the other end, while Buttler chipped in with 36 but could not see his side to victory. South Africa’s innings was anchored by the 111 off 117 balls from middle-order batsman Van der Dussen, who completed a fourth ODI century. He was supported by David Miller (53) as the pair put on 110 for the fifth wicket. Seamer Sam Curran was the pick of England's bowlers with 3-35 from his nine overs, but it was a day to forget for fast bowler Jofra Archer, with 1-81 in his 10 overs. It was his first ODI in almost two years after two elbow operations and a stress fracture in his back. The result is a boost for South Africa, who need a clean sweep of the series to stay on course for guaranteed qualification for the World Cup in India later this year. The second match in the three-game series will be played at the same venue on Sunday. (Reporting by Nick Said; Editing by Ken Ferris)","pubDate":"2023-01-27 19:44:00","image_url":"https://apicms.thestar.com.my/uploads/images/2023/01/28/1918904.jpg","source_id":"thestar_my","category":["sports"],"country":["malaysia"],"language":"english"},{"title":"India vs New Zealand: Conway sets the platform, Mitchell's crucial knock and other talking points from 1st T20I","link":"https://www.firstpost.com/firstcricket/sports-news/india-vs-new-zealand-conway-sets-the-platform-mitchells-crucial-knock-and-other-talking-points-from-1st-t20i-12060252.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"India vs New Zealand: Conway sets the platform, Mitchell's crucial knock and other talking points from 1st T20I","content":"Cricket India vs New Zealand: Conway sets the platform, Mitchell's crucial knock and other talking points from 1st T20I From Devon Conway setting the platform to Daryl Mitchell's crucial knock, here are five talking points from the first India-New Zealand T20I. FirstCricket Staff January 28th, 2023 1:12:11 IST Daryl Mitchell scored an unbeaten 59 to take New Zealand to a challenging total. Sportzpics New Zealand had the last laugh in the first T20I against India in Ranchi on Friday, beating the hosts by 21 runs to take a 1-0 lead in the series. Fifties from Devon Conway (52) and Daryl Mitchell (59*) took the Kiwis to 176 after being put to bat first, a total they successfully defended with the help of bowlers. The Indian top-order failed to get going, and had to rely on Suryakumar Yadav (47), Washington Sundar (50), and a cameo from skipper Hardik Pandya (21 off 20 balls). The hosts did not get off to a flying start in the chase, having lost three wickets in quick succession and being restricted to 33/3 in the powerplay phase. Hardik Pandya and Co will look to improve on certain aspects as they aim to crawl back into the series, in Lucknow on Sunday. Let’s now take a look at five talking points from the series-opener: Clinical Washington Sundar Game time is important for players like Washington Sundar as the team management looks towards youngsters with the 2024 T20 World Cup in their sights, and the 23-year-old impressed pretty well in the first T20I against New Zealand, despite his team going down. Sundar was introduced by Hardik as early as in the third over of the Kiwi innings, and struck twice in the fifth over of the innings, getting rid of opener Finn Allen and Mark Chapman, after New Zealand had got off to a brisk start. Sundar’s dismissal of Chapman caught the eye of many, taking a one-handed stunner off his own bowling to see off the Hong Kong-born cricketer. WHAT. A. CATCH 🔥🔥 @Sundarwashi5 dives to his right and takes a stunning catch off his own bowling 😎 #TeamIndia | #INDvNZ Live – https://t.co/9Nlw3mU634 #INDvNZ @mastercardindia pic.twitter.com/8BBdFWtuEu — BCCI (@BCCI) January 27, 2023 Sundar eventually finished with figures of 2/22 from four overs. Later, Sundar came into bat at number six following the dismissal of Suryakumar Yadav, but he could not build substantial partnerships with his partners, and that hurt India’s momentum. However, Sundar showcased his brilliance with the bat, getting to his fifty off 25 balls, hitting five fours and three sixes. Devon Conway’s knock sets the platform for NZ New Zealand had lost two wickets in Finn Allen and Mark Chapman after a brisk start early on in the powerplay, but Devon Conway kept calm and let his bat do the talking. Conway opened with Finn and forged a 43-run stand for the opening stand before he lost his fist two partners, but then came Glenn Phillips who despite managing just 17 runs, forged a 60-run stand with Conway. Top knock from Devon Conway 💛 52 Runs | 35 Balls | 7 Fours | 1 Six #INDvNZ #WhistlePodu pic.twitter.com/vtntrEaAB3 — WhistlePodu Army ® – CSK Fan Club (@CSKFansOfficial) January 27, 2023 Following Philips’ dismissal, Daryl Mitchell was the new man in, and the two shared 36 runs between them for the fourth wicket, before Conway was finally dismissed by Arshdeep Singh in the 18 th over. After the double blow for the Kiwis in the latter half of powerplay overs, It was Conway’s knock that set the platform for a challenging total. Daryl Mitchell’s crucial knock If it was Conway who set the tone for a challenging total, Daryl Mitchell (59*) made sure he made it even more worth it, staying unbeaten till the end. New Zealand had just lost Phillips, and in came Mitchell, who wasted no time to settle down, and got to his fifty off 26 deliveries. 6,6,6,4,0,2,2 by Daryl Mitchell in the final over helped Kiwis to post 176 for 6. — Johns. (@CricCrazyJohns) January 27, 2023 That last over from Arshdeep Singh proved to be the game-changer for New Zealand. As many as 27 runs came off that over, with three sixes and a four off Mitchell to turn the table in Kiwis’ favour. What’s worse, the first ball Arshdeep bowled in that final over was a no-ball, that went for a six, and what followed after was not pleasing for any Indian fan. It’s safe to say that Mitchell in fact stole the show in the final over for the Kiwis. India lose early wickets The pitch in Ranchi offered a lot of turn and bounce, and it was a tricky pitch to chase on. The Men in Blue found the going tough early on in the run chase, losing three early wickets inside the powerplay overs. Ishan Kishan was the first to get dismissed, in the second over, having been cleaned up by Michael Bracewell, who unleashed a peach of a delivery as the ball spun past the outside edge to hit the off-stump. Rahul Tripathi was the next to depart, after a not out decision was overturned following a New Zealand review. It was an appeal for a caught behind off Jacob Duffy’s ball, and UltraEdge showed a spike to prove the ball hit the bat on the way to the keeper. And to make matters worse, Shubman Gill, who had scored a double century in the first ODI against the Kiwis recently, was dismissed by Mitchell Santner, with Finn Allen completing a catch at forward square leg. SKY-Pandya stand India were in a spot of bother at 15/3 following the dismissal of Gill, but there was a revival of sorts thanks to a 68-run stand between Suryakumar Yadav and Hardik Pandya. While SKY could not register a fifty on Friday, his innings was still impactful, hitting six fours and two sixes in an innings that lasted 34 deliveries. The two played some entertaining loft shots, some slog sweeps, to help India reach a position where they could take the Kiwis down, but they lost SKY just when he was looking in good rhythm. Hardik followed soon after in the 13 th over, and following his dismissal, India were in all sorts of trouble once again, and it was difficult for the Men in Blue to claw back into the game. Read all the Latest News , Trending News , Cricket News , Bollywood News , India News and Entertainment News here. Follow us on Facebook , Twitter and Instagram . Updated Date: January 28, 2023 01:12:11 IST Tags: Cricket India Vs New Zealand Washington Sundar Find latest and upcoming tech gadgets online on Tech2 Gadgets. Get technology news, gadgets reviews & ratings. Popular gadgets including laptop, tablet and mobile specifications, features, prices, comparison.","pubDate":"2023-01-27 19:42:11","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/01/Daryl-Mitchell-640_Sportzpics.jpg","source_id":"firstpost","category":["sports"],"country":["india"],"language":"english"},{"title":"South Africa claim victory after England collapse in first one-day international","link":"https://www.theguardian.com/sport/2023/jan/27/south-africa-england-first-one-day-international-match-report-cricket","keywords":["South Africa cricket team","England cricket team","Cricket","Sport"],"creator":["Neil Manthorp at the Mangaung Oval"],"video_url":null,"description":"South Africa 298-7; England 271England were 146-0 with Jason Roy hitting a centuryJason Roy scored a vintage century to signal a welcome and overdue return to form but it wasn’t enough to prevent England losing a game they should have won comfortably when they went down by 27 runs to South Africa in the first of three ODIs at the Mangaung Oval on Friday night.Sam Curran, with three for 35, led the way as England restricted the hosts to 298 for seven on a modestly two-paced but otherwise perfect batting surface and the run-chase was given the perfect start with Roy and Dawid Malan adding 146 for the first wicket. Continue reading...","content":null,"pubDate":"2023-01-27 19:41:16","image_url":"https://i.guim.co.uk/img/media/a73e7fc5e320a05e8b66ae3bb26b2348d553f538/0_66_3078_1847/master/3078.jpg?width=460&quality=85&auto=format&fit=max&s=7e3048264bcf9e2d60dd2c23f6affbab","source_id":"theguardian","category":["sports"],"country":["canada","united kingdom","india","singapore"],"language":"english"},{"title":"5 talking points as England fall to South Africa defeat despite sparkling Jason Roy ton","link":"https://www.mirror.co.uk/sport/cricket/england-south-africa-magala-roy-29070983","keywords":["Sport"],"creator":["mirrornews@mirror.co.uk (Matthew Cooper)"],"video_url":null,"description":"Sisanda Magala and Anrich Nortje led an excellent fightback with the ball for South Africa, who beat England by 27 runs despite a brilliant hundred from Jason Roy","content":"South Africa took an important first step towards qualification for the 50-over World Cup , with a hundred from Rassie Van der Dussen and crucial wickets from Sisanda Magala and Anrich Nortje earning them a remarkable fightback win over England . The Proteas need to secure a 3-0 whitewash over England and then win their last two ODIs against the Netherlands to ensure they qualify for this year's tournament, otherwise they face featuring in a pre-qualifying tournament later this year. And Temba Bavuma's side fought hard to secure a 27-run win over England, who welcomed back Jofra Archer after a 22-month absence and saw Jason Roy rediscover his best form with an outstanding century. Having won the toss and opted to bat first, Rassie van der Dussen was the star of the show for South Africa as he struck an excellent 111 off 117 balls to help the hosts post 298-7. He shared a brilliant partnership worth 110 with David Miller to drag South Africa towards the 300 mark, having seen Bavuma, Quinton de Kock and Heinrich Klaasen all failing to capitalise on promising starts. In response, England got off to a perfect start as Roy and Dawid Malan shared an outstanding 146-run opening partnership. They both quickly brought up their half-centuries, before Malan top edged Magala to mid-off for 59 to spark a mini collapse that saw England lost three wickets for just six runs. And Magala, Nortje and Kagiso Rabada proceeded to pick up regular wickets as England fell from 146-0 to 271 all out, with Tabraiz Shamsi taking a simple return catch to dismiss Olly Stone and seal a remarkable win for South Africa. England throw away first South Africa ODI as Proteas stage remarkable fightback Joe Root lifts lid on England World Cup plans and \"drastic\" changes to his batting Jofra Archer made his first England appearance in almost two years ( Image: MARCO LONGARI/AFP via Getty Images) Archer's return After 678 days, Archer made his long-awaited England return as he played his first match since March 2021. The 27-year-old is one of the best bowlers in the world when he is on song and it was great to see him bowl his full quota of ten overs, having ramped up his workload from the four over spells he was delivering in the SA20. Speaking before the game Archer admitted he was only \"about 80%\" fit and, despite impressing in the SA20, he was England's most expensive bowler as he ended with figures of 1-81. However, performances really matter little at this point for Archer after such a long spell on the sidelines and it is simply a case of easing him back ahead of the Ashes and the 50-over World Cup. Rassie van der Dussen scored an excellent century for South Africa ( Image: Lee Warren/Gallo Images) Van der Dussen's hundred In what proved to be a match winning knock, Van der Dussen held South Africa's innings together as he struck 111 off 117 balls and shared an important partnership worth 110 with Miller. Van der Dussen has been immense in ODI cricket since making his debut in 2019, with his fourth century in the format meaning he now has the second best batting average of any player to have scored at least 1,000 ODI runs. Across 39 games, Van der Dussen has scored 1,636 runs at 71.13, with only India opener Shubman Gill boasting a superior average of 73.76. Sam Curran was excellent with the ball for England, picking up 3-35 ( Image: Alex Davidson/Getty Images) Curran impresses After a stunning T20 World Cup campaign where he was named both player of the tournament and player of the match in the final, Curran now has his sights set on a starring role at this year's 50-over World Cup. Following a disappointing SA20 stint where he picked up just three wickets at an average of 55, Curran was back to his best as soon as he pulled on an England shirt. In a nine-over spell, he picked up 3-35 and was comfortably the best bowler on show as he conceded just two boundaries while taking the big wickets of De Kock, Van der Dussen and Miller. It was an impressive display from the 24-year-old and he looks set to play a key role for England in their World Cup defence later this year. ( Image: MARCO LONGARI/AFP via Getty Images) Roy finds much-needed form Roy was back to his best in emphatic fashion as he struck a brilliant 113 off 91 balls in Bloemfontein. He entered this series with his place in the side under threat after an extended run of poor form saw him axed ahead of England's T20 World Cup winning campaign last year. He had been unable to rediscover his form in the SA20 ahead of this series, where he scored 100 runs in eight innings while striking at just 91.74. However, Roy was able to put those struggles behind him and looked every inch the player who has been so crucial to England's white-ball revolution and 2019 50-over World Cup win as he smashed an 11th ODI ton. Although he was unable to get England over the line, Roy's innings is a major positive and he will be hoping it will spark a more prolific run of form heading into the World Cup after recent struggles Harry Brook was out for a duck on his ODI debut ( Image: MARCO LONGARI/AFP via Getty Images) Brook's duck on debut Having ended 2022 with a T20 World Cup winner's medal and three Test centuries, it feels surprising that Brook is only just making his ODI debut. The 23-year-old has not played a List A game since 2019 as a result of the Covid pandemic and The Hundred, but England view him as a potential superstar in all three formats and will give him chances to force his way into their World Cup side. With Eoin Morgan and Ben Stokes now retired, although head coach Matthew Mott is hopeful Stokes will return for the World Cup, there are spots up for grabs in the middle order and Brook is very much in contention for one of them. However, he was unable to make an impact on debut as he fell lbw for a three-ball duck to Magala, who was outstanding for the Proteas with 3-46 from his nine overs. Read More Kevin Pietersen hails England youngster \"not afraid to take a risk\" after impressive SA20 Read More Ben Stokes opens up about mental health break - \"Everything got a bit too much for me\" Read More Eoin Morgan offers his verdict on Ben Stokes and Brendon McCullum's England revolution Read More Jos Buttler confirms England are planning for 50-over World Cup without Ben Stokes Read More Steve Harmison pinpoints England difference maker ahead of Australia Ashes clash","pubDate":"2023-01-27 19:35:41","image_url":"https://i2-prod.mirror.co.uk/incoming/article29071021.ece/ALTERNATES/s615/0_GettyImages-1246594258.jpg","source_id":"mirroruk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Doubleheader curse haunts Itanda Kayakers, lose to Bujjagali Rafters and Sipi Trekkers","link":"https://kawowo.com/2023/01/27/doubleheader-curse-haunts-itanda-kayakers-lose-to-bujjagali-rafters-and-sipi-trekkers/","keywords":["Cricket"],"creator":["Denis Musali"],"video_url":null,"description":"Waterfalls Men’s T20 Tournament Game 3: Itanda Kayakers v Bujjagali RaftersItanda Kayakers: 133 all outBujjagali Rafters 136/9Bujjagali Rafters won by 1 wicketPlayer of the Match: Siraje Nsubuga (4/20)Full Match Scorecard: http://www.ugcricket.com/Uganda/viewScorecard.do?matchId=1717&clubId=5335 Game 4: Sipi Trekkers v Itanda KayakersItanda Kayakers: 131/7Sipi Trekkers: 132/7Sipi Trekkers won by 3 wicketsPlayer of the Match: Sami SohailFull Match Scorecard: http://www.ugcricket.com/Uganda/viewScorecard.do?matchId=1719&clubId=5335 […] The post Doubleheader curse haunts Itanda Kayakers, lose to Bujjagali Rafters and Sipi Trekkers appeared first on Kawowo Sports.","content":"Itanda Kayakers v Bujjagali Rafters Itanda Kayakers: 133 all out Bujjagali Rafters 136/9 Bujjagali Rafters won by 1 wicket Player of the Match: Siraje Nsubuga (4/20) Full Match Scorecard: Sipi Trekkers v Itanda Kayakers Itanda Kayakers: 131/7 Sipi Trekkers: 132/7 Sipi Trekkers won by 3 wickets Player of the Match: Sami Sohail Full Match Scorecard: Bujjagali Rafters will sleep worried tonight because none of the teams has been able to win a game on their doubleheader day of the Men’s Waterfalls T20. With the chasing pack behind them doing their homework you fear that you could throw it away on the last day of the group games. Bujjagali Rafters are on top of the table because they are the only side that has won two games with Itanda Kayakers and Sipi Trekkers having won only a game each. Itanda Kayakers used a lot of energy in the morning game against Bujjagali Rafters in a match that went the distance with Bujjagali getting over the line by just one wicket. It was a seesaw game that was balanced for most of the duration until Juma Miyagi took charge in the final over to win the game for the Rafters. In the afternoon, Itanda Kayakers won the toss and elected to bat, but as was in the morning they failed to put on any meaningful partnership and were only able to get to 131 because Bilal Hassun’s exploits in the final over where he hit 3 sixes in a row. In the chase, Sipi Trekkers were put on the winning course by Brian Asaba and Orichide Tuyisenge who had an opening partnership of 53 with contributions coming from the rest of the team as they got over the line by 3 wickets. The two losses for Itanda Kayakers keep them behind Bujjagali Rafters but at least keep Sipi Trekkers at bay due to a superior Net Run Rate. Action will continue tomorrow at the Lugogo Cricket Oval.","pubDate":"2023-01-27 19:23:05","image_url":null,"source_id":"kawowo","category":["sports"],"country":["uganda"],"language":"english"},{"title":"Highlights, South Africa vs England, 1st ODI in Bloemfontein: Proteas win by 27 runs, go 1-0 up in series","link":"https://www.firstpost.com/firstcricket/sports-news/highlights-south-africa-vs-england-1st-odi-in-bloemfontein-proteas-win-by-27-runs-go-1-0-up-in-series-12057902.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"Highlights, South Africa vs England, 1st ODI in Bloemfontein: Proteas win by 27 runs, go 1-0 up in series","content":"Cricket Highlights, South Africa vs England, 1st ODI in Bloemfontein: Proteas win by 27 runs, go 1-0 up in series Nortje and Magala restrict England to 271 after van der Dussen's ton helps South Africa set a stiff 299-run target FirstCricket Staff January 28th, 2023 0:39:58 IST England skipper Jos Buttler and his South African counterpart Temba Bavuma at the toss ahead of the first ODI in Bloemfontein. Twitter @ICC Toss update: Fast bowler Jofra Archer was back in the England team for the first time in nearly two years for the first one-day international against South Africa on Friday. South Africa captain Temba Bavuma won the toss and chose to bat first at Mangaung Oval in Bloemfontein at the start of a three-match series that the teams will finally get to play after it was postponed in 2020 because of the coronavirus pandemic. Archer last played international cricket in March 2021 and last appeared in an ODI in September 2020. He was out with elbow and back injuries but has been playing in the South African domestic Twenty20 league to prove his fitness for the ODI series. Batsman Harry Brook will make his ODI debut for England. South Africa recalled seam bowler Sisanda Magala for his first ODI in a year. Lineups: South Africa: Quinton de Kock, Temba Bavuma (captain), Rassie van der Dussen, Aiden Markram, Heinrich Klaasen, David Miller, Wayne Parnell, Sisanda Magala, Kagiso Rabada, Anrich Nortje, Tabraiz Shamsi England: Jason Roy, Dawid Malan, Ben Duckett, Harry Brook, Jos Buttler (captain), Moeen Ali, Sam Curran, David Willey, Adil Rashid, Jofra Archer, Olly Stone. With inputs from The Associated Press Read all the Latest News , Trending News , Cricket News , Bollywood News , India News and Entertainment News here. Follow us on Facebook , Twitter and Instagram . Updated Date: January 28, 2023 00:39:58 IST Tags: Cricket Jofra Archer South Africa Vs England Find latest and upcoming tech gadgets online on Tech2 Gadgets. Get technology news, gadgets reviews & ratings. Popular gadgets including laptop, tablet and mobile specifications, features, prices, comparison.","pubDate":"2023-01-27 19:09:58","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/01/SA-vs-ENG-1st-ODI-toss-640_Twitter-@ICC.jpg","source_id":"firstpost","category":["sports"],"country":["india"],"language":"english"},{"title":"South Africa withstand Jason Roy brilliance to win first one-day international","link":"https://www.sportsmole.co.uk/cricket/england/news/south-africa-withstand-roy-brilliance-to-win-first-odi_505242.html","keywords":["Cricket","England","South Africa","Jason Roy","Moeen Ali","Sam Curran","Olly Stone","Quinton de Kock","Rassie van der Dussen","David Miller","Dawid Malan","Ben Duckett","Harry Brook","Kagiso Rabada","Jos Buttler","Anrich Nortje","David Willey","Adil Rashid","505242"],"creator":null,"video_url":null,"description":"South Africa withstand a brilliant century from Jason Roy to record a 27-run victory over England in the first one-day international in Bloemfontein.","content":"After winning the toss, South Africa opted to bat first, and the home side impressed during the opening stages as they put on 61 in 8.1 overs for the first wicket. However, by 21.1 overs, the Proteas had been restricted to just 116-3, Moeen Ali , Sam Curran and Olly Stone all chipping in with a wicket apiece. At the time, Quinton de Kock was the top scorer in the pavilion with 37, but that was about to change as Rassie van der Dussen moved the ball around for a patient century. Although he chipped in with just six boundaries and a maximum, Van der Dussen made 111 off 117 deliveries, keeping the innings together before his departure late on. David Miller made 53 at an almost identical strike-rate, taking South Africa to 298-7 off their allotted overs with Curran's 3-35 the best bowling figures for England. 🚨 WICKET 🚨 South Africa win by 27 runs after a remarkable bowling performance pic.twitter.com/7UJaC9DIOS Despite the target being well within England's capabilities, they would theoretically have to work hard to achieve it, yet Roy and Dawid Malan indicated that would not be the case. The pair put on 146 for the opening stand in 19.3 overs before Malan was dismissed for 59 from 55 balls, and that resulted in a collapse from the visitors. Ben Duckett (3) and Harry Brook (0) went cheaply, with it taking a counter-attack from Roy to move England to 196-4 when his wicket went to Kagiso Rabada for 113 off 91 balls, hitting 11 fours and four maximums. With a deep batting lineup, England were not at a point where they needed to panic until the dismissals of Moeen (11) and Jos Buttler (36) left them on 234-6, still requiring 65 off 78 balls. Anrich Nortje soon took his third wicket, removing David Willey for nine, putting Curran and Adil Rashid in a position where they needed to protect their wickets and prevent the run-rate from moving to more than a run per ball. Although they put on 16 for the eighth wicket, South Africa's attack prove too fearsome for the tail-enders, Rashid left stranded on 14 not out as England were bowled out for 271 with 34 balls left unused.","pubDate":"2023-01-27 19:00:31","image_url":"https://sm.imgix.net/21/11/jos-buttler.jpg","source_id":"sportsmole","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Warner 'exhausted' ahead of India tour","link":"https://www.perthnow.com.au/sport/cricket/warner-exhausted-ahead-of-india-tour-c-9581930","keywords":null,"creator":["Jasper Bruce"],"video_url":null,"description":"Australian Test veteran David Warner says a busy summer of cricket has left him exhausted ahead of next month's Test tour of India.","content":"David Warner is feeling exhausted ahead of next month's Test tour of India and admits he would have preferred the night off from the Allan Border Medal this Monday to recover from a busy home summer. Warner's hectic summer officially came to an end on Friday night when the Brisbane Heat eliminated his Sydney Thunder from the Big Bash finals. Starting in August, Warner played in the white-ball series against Zimbabwe, New Zealand, England and the West Indies, in every game of Australia's T20 World Cup campaign, in each Test match of the home series against the West Indies and South Africa, and then managed six BBL games on his return to the tournament. \"It's been challenging,\" Warner told reporters of his busy summer. \"I'm quite tired, exhausted.\" India's difficult wickets are lying in wait, as is the challenge to find consistent form with the bat following a Test summer that yielded a memorable double-century and a spate of unconvincing knocks. The 36-year-old has five days to rest up before India, but one of his evenings will be taken up by Cricket Australia's Allan Border Medal, to be attended by the Test squad ahead of their staggered flights out. T20I teammate Marcus Stoinis and BBL star Chris Lynn are missing the awards night to play franchise cricket overseas. \"There are a few guys who have gone to the UAE League, which aren't going to the Cricket Australia awards,\" Warner said. \"From my perspective, that would've been nice to have had another night at home. But it is what it is.\" Warner's best performance of the BBL summer came on Friday night, when a rapid-fire 36 runs from 20 balls had the Thunder on track before rain washed the game out. While his results have not lived up to his billing, the opener said his intention had never been to use the BBL cameo to limber up for the longer format in India. \"You're not really trying to negate the spinning ball, it's a white ball as well,\" Warner said of the BBL. \"For me, it was about coming back and trying to inject some energy into the Thunder team and trying to put my best foot forward for the team. \"It hasn't come off this year.\" Warner is contracted for one more summer with the Thunder and will come into the tournament on the back of an ODI World Cup in India, and potentially after a similarly busy home Test summer if he is still playing and selected. \"Hopefully next year I can come out and be a little bit fresher than what I am at the moment,\" he said. \"It's going to be a long lead-in to our summer. \"From a personal point of view, I'm going to have to try and work out how to stay nice and fresh.\"","pubDate":"2023-01-27 22:51:24","image_url":"https://images.perthnow.com.au/publication/C-9581930/77d506a98ed8e8d58b2bdd653b6433be766333de-16x9-x0y0w1280h720.jpg","source_id":"perthnow","category":["sports"],"country":["australia"],"language":"english"},{"title":"Jos Buttler hails ‘phenomenal’ Jason Roy after century in England’s defeat to South Africa","link":"https://www.standard.co.uk/sport/cricket/south-africa-vs-england-odi-jason-roy-jos-buttler-2023-b1056248.html","keywords":["Cricket","Sport"],"creator":["Malik Ouzia"],"video_url":null,"description":"Jos Buttler hailed Jason Roy’s “phenomenal” innings as the under-pressure England opener returned to form in fine style during Friday’s ODI defeat to South Africa.","content":"hailed ’s “phenomenal” innings as the under-pressure opener returned to form in fine style during Friday’s ODI defeat to . The Surrey batter scored a brilliant 113 off 91 balls but England failed to take advantage as they slumped from 146 for-nought to be all-out for 271 chasing 299 for victory. Roy has and was dropped from England’s T20 side in the build-up to the T20 World Cup success in Australia before Christmas. The 32-year-old’s lean spell has continued in South Africa’s new SA20 league since the New Year, but returning to 50-over cricket appeared to work the oracle as Roy produced a commanding knock, including 11 fours and four sixes, in the series opener at Mangaung Oval. “He looked completely back to his best,” England captain Buttler said. “It was a phenomenal innings full of personality and courage, some fantastic shots. “I’m delighted to see him back to his best, he’s worked really hard to get there and been through a tough time. That can happen to everyone in cricket, we all go through those tough periods. “Having the strength of character to come out and play in the fashion he did today and really impose himself was fantastic to see.” Buttler has been playing alongside Roy in the SA20 for Paarl Royals and says he had seen signs of his teammate closing on a return to form. “I didn’t think he was far away at all,” Buttler added. “Being around him in the SA20, he’s been very consistent with his mindset even though he’s not got the runs he would have liked. He’s trained well and hit the ball well and he’s saying all the right things. “You’re never far away from a great day when you’re a player of that quality. It’s always going to come back at some point. We keep backing him and we were desperate for him to score those runs because he’s such an imposing player for us at the top of the order.” Jofra Archer made his first England appearance since March 2021, following a series of back and elbow problems. Jofra Archer returned to England duty for the first time in 678 days The seamer finished with figures of one-for-81, his most expensive in ODI cricket, but Buttler hailed another step on what is being a carefully plotted comeback. “It was always going to be a big challenge for him to get back to bowling 10 overs in a game and to have to come back and bowl spells,” Buttler said, with Archer’s only competitive cricket since his return having come in the SA20. “He’s obviously started in T20 cricket only very recently, bowling a maximum of four overs in a game and spells of maybe two overs at a time. \"It’s a bit step-up for him and I’m delighted see him come through that, it’s great to see him in an England shirt and back taking a wicket in an England shirt as well. “They’re all big steps even though he’s such a superstar of the game. They’re all good steps on the way to getting him back to being at his best.”","pubDate":"2023-01-27 20:44:26","image_url":"https://static.standard.co.uk/2023/01/27/20/newFile-5.jpg?width=1200&auto=webp","source_id":"standarduk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"South Africa vs England: Jason Roy century and Jofra Archer return not enough to stop opening defeat","link":"https://www.standard.co.uk/sport/cricket/south-africa-vs-england-odi-cricket-result-2023-b1056247.html","keywords":["Cricket","Sport"],"creator":["Malik Ouzia"],"video_url":null,"description":"It had been 678 days since England had been able to call upon Jofra Archer and, so it felt, almost as long since they had seen the best of Jason Roy.","content":"t had been 678 days since had been able to call upon and, so it felt, almost as long since they had seen the best of . Here in Bloemfontein, twin waits came to an end, but a day that began with Archer’s return to action, and encompassed Roy’s emphatic return to form in the shape of an 11th international hundred, ended in defeat as claimed victory in a lively conclusion to the First One-Day International. Roy’s 113 off 91 balls came in reply to another century from Rassie van der Dussen, but in being restricted to 298-for-seven, the Proteas appeared to have failed to take full advantage of a flat surface at Mangaung Oval. At 146 without loss and again at 196-for-three, the tourists looked well on top in the chase but a brilliantly hostile spell from Anrich Nortje turned the tide. England fluffed their lines and were skittled 28 runs short of victory as South Africa took a 1-0 lead in a series that is vital for their hopes of qualifying automatically for this year’s World Cup. Even before he had become Nortje’s fourth and final victim, Archer’s return was not the one of which he would have dreamt, figures of one-for-81 his most expensive in ODI cricket, but both he and England must have the patience for the long game after so much time apart. For Roy, the sense of immediate jeopardy was far greater. Dropped from England’s T20 side ahead of last year’s World Cup triumph amid a prolonged lean spell, it was true that the 32-year-old’s ODI returns - including a century in the Netherlands in July - had offered slightly less cause for alarm. But with opportunities to serve reminders of his ability in this format few and far between, the Surrey batter arrived in South Africa with serious questions over his place at the top of the order for the first time since making it his own. Just three deliveries into his series, though, Roy was away, ball racing off the middle of bat and through midwicket for four, something telling you this might just be his day. What followed was a knock of composure and aggression in equal parts, played with terrific tempo and a knack for the choosing of moments that can only come with having done this job for so long. Aiden Markram tried to sneak an over of part-time off-spin at the end of the powerplay and was belted for six. A hundred-partnership with Dawid Malan was brought up hooking Nortje high over the ropes, too. When Tabraiz Shamsi overstepped, the resulting free-hit went the same way. Having motored into the eighties, Roy’s charge was briefly put on hold as first Malan (59) fell and then both Ben Duckett and Harry Brook followed in successive overs, the latter trapped lbw for nought on debut, one of three scalps for the impressive Sisandra Magala. On reaching his century, off just 79 balls, Roy almost hurled his shoulder out of its socket with an uppercut punch of the air in pent-up celebration. Nine months out from the World Cup, with , it was an innings that could not have been more timely. In hindsight, though, England could still have done with more. Timely: Roy returned to form even despite England’s defeat A trip to India in October is also the goal for Archer, though, of course, there is the prospect of a Test return and Ashes series on the horizon before then, should all go to plan. Buttler and Matthew Mott had each tried to temper expectations and , but having seen the 26-year-old arrive back in competitive cricket with a wicket-maiden in his first over for MI Cape Town earlier this month, it was not difficult to get carried away. In the end, though, Archer’s opening spell of five overs was simply solid, consistently reaching speeds in the high-eighties throughout without quite troubling the 90mph bracket that signals true express pace. The major positive of Archer’s ten overs on comeback was the fact that he got through quite so many, though by the end it had clearly become something of a grind: a first international wicket in almost two years came in his final over, after the previous one had included two no-balls and cost 20. Instead it was Sam Curran, the player of the tournament at the T20 World Cup late last year, who picked up where he left off in England colours, the pick of the bowlers as he took three-for-35 in nine overs, as well as a terrific diving catch to dismiss Temba Bavuma (36) and make the initial breakthrough after the Proteas skipper had won the toss and made a positive start to the powerplay alongside Quinton de Kock. It is a measure of Curran’s standing now that, later, his dismissal felt like the moment English hopes disappeared. Quite why he slashed at the final ball of Kagiso Rabada’s spell, feathering behind, is anyone’s guess but eight-down with 33 still needed, the game was up.","pubDate":"2023-01-27 20:29:18","image_url":"https://static.standard.co.uk/2023/01/27/20/newFile-3.jpg?width=1200&auto=webp","source_id":"standarduk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Cricket-Roy ton in vain as England collapse to defeat in first S.Africa ODI","link":"https://www.thestar.com.my/sport/cricket/2023/01/28/cricket-roy-ton-in-vain-as-england-collapse-to-defeat-in-first-safrica-odi","keywords":null,"creator":null,"video_url":null,"description":"(Reuters) - England opener Jason Roy smashed his way back into form with 113 from 91 balls but the tourists lost from a commanding position as South Africa claimed victory by 27 runs in the first One-Day International at Manguang Oval in Bloemfontein on Friday. Read full story","content":"(Reuters) - England opener Jason Roy smashed his way back into form with 113 from 91 balls but the tourists lost from a commanding position as South Africa claimed victory by 27 runs in the first One-Day International at Manguang Oval in Bloemfontein on Friday. The hosts won the toss and elected to bat, posting 298 for seven, their total boosted by 111 from Rassie van der Dussen, before restricting England to 271 all out in their reply. The visitors raced to 146 without loss in the 20th over as they bludgeoned the home bowling attack to all parts of the ground but when Dawid Malan (59) was the first wicket to fall, there was a stutter in England's chase. They were largely undone by poor shot selection at the back end of the innings when calm heads would have seen them comfortably home, losing 10 wickets for the addition of 125 runs following the massive opening stand. \"Disappointed, we played some excellent cricket for the majority of the game,\" England captain Jos Buttler said. \"To have that conviction and commitment to keep taking it on has served us well for a long time. We are disappointed we did not go on and win.\" Roy, who has battled with the bat in recent months, reached his 11th ODI century off 79 balls to keep the scoreboard moving as wickets fell at the other end, while Buttler chipped in with 36 but could not see his side to victory. South Africa’s innings was anchored by the 111 off 117 balls from middle-order batsman Van der Dussen, who completed a fourth ODI century. He was supported by David Miller (53) as the pair put on 110 for the fifth wicket. Seamer Sam Curran was the pick of England's bowlers with 3-35 from his nine overs, but it was a day to forget for fast bowler Jofra Archer, with 1-81 in his 10 overs. It was his first ODI in almost two years after two elbow operations and a stress fracture in his back. The result is a boost for South Africa, who need a clean sweep of the series to stay on course for guaranteed qualification for the World Cup in India later this year. The second match in the three-game series will be played at the same venue on Sunday. (Reporting by Nick Said; Editing by Ken Ferris)","pubDate":"2023-01-27 19:44:00","image_url":"https://apicms.thestar.com.my/uploads/images/2023/01/28/1918904.jpg","source_id":"thestar_my","category":["sports"],"country":["malaysia"],"language":"english"},{"title":"India vs New Zealand: Conway sets the platform, Mitchell's crucial knock and other talking points from 1st T20I","link":"https://www.firstpost.com/firstcricket/sports-news/india-vs-new-zealand-conway-sets-the-platform-mitchells-crucial-knock-and-other-talking-points-from-1st-t20i-12060252.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"India vs New Zealand: Conway sets the platform, Mitchell's crucial knock and other talking points from 1st T20I","content":"Cricket India vs New Zealand: Conway sets the platform, Mitchell's crucial knock and other talking points from 1st T20I From Devon Conway setting the platform to Daryl Mitchell's crucial knock, here are five talking points from the first India-New Zealand T20I. FirstCricket Staff January 28th, 2023 1:12:11 IST Daryl Mitchell scored an unbeaten 59 to take New Zealand to a challenging total. Sportzpics New Zealand had the last laugh in the first T20I against India in Ranchi on Friday, beating the hosts by 21 runs to take a 1-0 lead in the series. Fifties from Devon Conway (52) and Daryl Mitchell (59*) took the Kiwis to 176 after being put to bat first, a total they successfully defended with the help of bowlers. The Indian top-order failed to get going, and had to rely on Suryakumar Yadav (47), Washington Sundar (50), and a cameo from skipper Hardik Pandya (21 off 20 balls). The hosts did not get off to a flying start in the chase, having lost three wickets in quick succession and being restricted to 33/3 in the powerplay phase. Hardik Pandya and Co will look to improve on certain aspects as they aim to crawl back into the series, in Lucknow on Sunday. Let’s now take a look at five talking points from the series-opener: Clinical Washington Sundar Game time is important for players like Washington Sundar as the team management looks towards youngsters with the 2024 T20 World Cup in their sights, and the 23-year-old impressed pretty well in the first T20I against New Zealand, despite his team going down. Sundar was introduced by Hardik as early as in the third over of the Kiwi innings, and struck twice in the fifth over of the innings, getting rid of opener Finn Allen and Mark Chapman, after New Zealand had got off to a brisk start. Sundar’s dismissal of Chapman caught the eye of many, taking a one-handed stunner off his own bowling to see off the Hong Kong-born cricketer. WHAT. A. CATCH 🔥🔥 @Sundarwashi5 dives to his right and takes a stunning catch off his own bowling 😎 #TeamIndia | #INDvNZ Live – https://t.co/9Nlw3mU634 #INDvNZ @mastercardindia pic.twitter.com/8BBdFWtuEu — BCCI (@BCCI) January 27, 2023 Sundar eventually finished with figures of 2/22 from four overs. Later, Sundar came into bat at number six following the dismissal of Suryakumar Yadav, but he could not build substantial partnerships with his partners, and that hurt India’s momentum. However, Sundar showcased his brilliance with the bat, getting to his fifty off 25 balls, hitting five fours and three sixes. Devon Conway’s knock sets the platform for NZ New Zealand had lost two wickets in Finn Allen and Mark Chapman after a brisk start early on in the powerplay, but Devon Conway kept calm and let his bat do the talking. Conway opened with Finn and forged a 43-run stand for the opening stand before he lost his fist two partners, but then came Glenn Phillips who despite managing just 17 runs, forged a 60-run stand with Conway. Top knock from Devon Conway 💛 52 Runs | 35 Balls | 7 Fours | 1 Six #INDvNZ #WhistlePodu pic.twitter.com/vtntrEaAB3 — WhistlePodu Army ® – CSK Fan Club (@CSKFansOfficial) January 27, 2023 Following Philips’ dismissal, Daryl Mitchell was the new man in, and the two shared 36 runs between them for the fourth wicket, before Conway was finally dismissed by Arshdeep Singh in the 18 th over. After the double blow for the Kiwis in the latter half of powerplay overs, It was Conway’s knock that set the platform for a challenging total. Daryl Mitchell’s crucial knock If it was Conway who set the tone for a challenging total, Daryl Mitchell (59*) made sure he made it even more worth it, staying unbeaten till the end. New Zealand had just lost Phillips, and in came Mitchell, who wasted no time to settle down, and got to his fifty off 26 deliveries. 6,6,6,4,0,2,2 by Daryl Mitchell in the final over helped Kiwis to post 176 for 6. — Johns. (@CricCrazyJohns) January 27, 2023 That last over from Arshdeep Singh proved to be the game-changer for New Zealand. As many as 27 runs came off that over, with three sixes and a four off Mitchell to turn the table in Kiwis’ favour. What’s worse, the first ball Arshdeep bowled in that final over was a no-ball, that went for a six, and what followed after was not pleasing for any Indian fan. It’s safe to say that Mitchell in fact stole the show in the final over for the Kiwis. India lose early wickets The pitch in Ranchi offered a lot of turn and bounce, and it was a tricky pitch to chase on. The Men in Blue found the going tough early on in the run chase, losing three early wickets inside the powerplay overs. Ishan Kishan was the first to get dismissed, in the second over, having been cleaned up by Michael Bracewell, who unleashed a peach of a delivery as the ball spun past the outside edge to hit the off-stump. Rahul Tripathi was the next to depart, after a not out decision was overturned following a New Zealand review. It was an appeal for a caught behind off Jacob Duffy’s ball, and UltraEdge showed a spike to prove the ball hit the bat on the way to the keeper. And to make matters worse, Shubman Gill, who had scored a double century in the first ODI against the Kiwis recently, was dismissed by Mitchell Santner, with Finn Allen completing a catch at forward square leg. SKY-Pandya stand India were in a spot of bother at 15/3 following the dismissal of Gill, but there was a revival of sorts thanks to a 68-run stand between Suryakumar Yadav and Hardik Pandya. While SKY could not register a fifty on Friday, his innings was still impactful, hitting six fours and two sixes in an innings that lasted 34 deliveries. The two played some entertaining loft shots, some slog sweeps, to help India reach a position where they could take the Kiwis down, but they lost SKY just when he was looking in good rhythm. Hardik followed soon after in the 13 th over, and following his dismissal, India were in all sorts of trouble once again, and it was difficult for the Men in Blue to claw back into the game. Read all the Latest News , Trending News , Cricket News , Bollywood News , India News and Entertainment News here. Follow us on Facebook , Twitter and Instagram . Updated Date: January 28, 2023 01:12:11 IST Tags: Cricket India Vs New Zealand Washington Sundar Find latest and upcoming tech gadgets online on Tech2 Gadgets. Get technology news, gadgets reviews & ratings. Popular gadgets including laptop, tablet and mobile specifications, features, prices, comparison.","pubDate":"2023-01-27 19:42:11","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/01/Daryl-Mitchell-640_Sportzpics.jpg","source_id":"firstpost","category":["sports"],"country":["india"],"language":"english"},{"title":"South Africa claim victory after England collapse in first one-day international","link":"https://www.theguardian.com/sport/2023/jan/27/south-africa-england-first-one-day-international-match-report-cricket","keywords":["South Africa cricket team","England cricket team","Cricket","Sport"],"creator":["Neil Manthorp at the Mangaung Oval"],"video_url":null,"description":"South Africa 298-7; England 271England were 146-0 with Jason Roy hitting a centuryJason Roy scored a vintage century to signal a welcome and overdue return to form but it wasn’t enough to prevent England losing a game they should have won comfortably when they went down by 27 runs to South Africa in the first of three ODIs at the Mangaung Oval on Friday night.Sam Curran, with three for 35, led the way as England restricted the hosts to 298 for seven on a modestly two-paced but otherwise perfect batting surface and the run-chase was given the perfect start with Roy and Dawid Malan adding 146 for the first wicket. Continue reading...","content":null,"pubDate":"2023-01-27 19:41:16","image_url":"https://i.guim.co.uk/img/media/a73e7fc5e320a05e8b66ae3bb26b2348d553f538/0_66_3078_1847/master/3078.jpg?width=460&quality=85&auto=format&fit=max&s=7e3048264bcf9e2d60dd2c23f6affbab","source_id":"theguardian","category":["sports"],"country":["canada","united kingdom","india","singapore"],"language":"english"},{"title":"5 talking points as England fall to South Africa defeat despite sparkling Jason Roy ton","link":"https://www.mirror.co.uk/sport/cricket/england-south-africa-magala-roy-29070983","keywords":["Sport"],"creator":["mirrornews@mirror.co.uk (Matthew Cooper)"],"video_url":null,"description":"Sisanda Magala and Anrich Nortje led an excellent fightback with the ball for South Africa, who beat England by 27 runs despite a brilliant hundred from Jason Roy","content":"South Africa took an important first step towards qualification for the 50-over World Cup , with a hundred from Rassie Van der Dussen and crucial wickets from Sisanda Magala and Anrich Nortje earning them a remarkable fightback win over England . The Proteas need to secure a 3-0 whitewash over England and then win their last two ODIs against the Netherlands to ensure they qualify for this year's tournament, otherwise they face featuring in a pre-qualifying tournament later this year. And Temba Bavuma's side fought hard to secure a 27-run win over England, who welcomed back Jofra Archer after a 22-month absence and saw Jason Roy rediscover his best form with an outstanding century. Having won the toss and opted to bat first, Rassie van der Dussen was the star of the show for South Africa as he struck an excellent 111 off 117 balls to help the hosts post 298-7. He shared a brilliant partnership worth 110 with David Miller to drag South Africa towards the 300 mark, having seen Bavuma, Quinton de Kock and Heinrich Klaasen all failing to capitalise on promising starts. In response, England got off to a perfect start as Roy and Dawid Malan shared an outstanding 146-run opening partnership. They both quickly brought up their half-centuries, before Malan top edged Magala to mid-off for 59 to spark a mini collapse that saw England lost three wickets for just six runs. And Magala, Nortje and Kagiso Rabada proceeded to pick up regular wickets as England fell from 146-0 to 271 all out, with Tabraiz Shamsi taking a simple return catch to dismiss Olly Stone and seal a remarkable win for South Africa. England throw away first South Africa ODI as Proteas stage remarkable fightback Joe Root lifts lid on England World Cup plans and \"drastic\" changes to his batting Jofra Archer made his first England appearance in almost two years ( Image: MARCO LONGARI/AFP via Getty Images) Archer's return After 678 days, Archer made his long-awaited England return as he played his first match since March 2021. The 27-year-old is one of the best bowlers in the world when he is on song and it was great to see him bowl his full quota of ten overs, having ramped up his workload from the four over spells he was delivering in the SA20. Speaking before the game Archer admitted he was only \"about 80%\" fit and, despite impressing in the SA20, he was England's most expensive bowler as he ended with figures of 1-81. However, performances really matter little at this point for Archer after such a long spell on the sidelines and it is simply a case of easing him back ahead of the Ashes and the 50-over World Cup. Rassie van der Dussen scored an excellent century for South Africa ( Image: Lee Warren/Gallo Images) Van der Dussen's hundred In what proved to be a match winning knock, Van der Dussen held South Africa's innings together as he struck 111 off 117 balls and shared an important partnership worth 110 with Miller. Van der Dussen has been immense in ODI cricket since making his debut in 2019, with his fourth century in the format meaning he now has the second best batting average of any player to have scored at least 1,000 ODI runs. Across 39 games, Van der Dussen has scored 1,636 runs at 71.13, with only India opener Shubman Gill boasting a superior average of 73.76. Sam Curran was excellent with the ball for England, picking up 3-35 ( Image: Alex Davidson/Getty Images) Curran impresses After a stunning T20 World Cup campaign where he was named both player of the tournament and player of the match in the final, Curran now has his sights set on a starring role at this year's 50-over World Cup. Following a disappointing SA20 stint where he picked up just three wickets at an average of 55, Curran was back to his best as soon as he pulled on an England shirt. In a nine-over spell, he picked up 3-35 and was comfortably the best bowler on show as he conceded just two boundaries while taking the big wickets of De Kock, Van der Dussen and Miller. It was an impressive display from the 24-year-old and he looks set to play a key role for England in their World Cup defence later this year. ( Image: MARCO LONGARI/AFP via Getty Images) Roy finds much-needed form Roy was back to his best in emphatic fashion as he struck a brilliant 113 off 91 balls in Bloemfontein. He entered this series with his place in the side under threat after an extended run of poor form saw him axed ahead of England's T20 World Cup winning campaign last year. He had been unable to rediscover his form in the SA20 ahead of this series, where he scored 100 runs in eight innings while striking at just 91.74. However, Roy was able to put those struggles behind him and looked every inch the player who has been so crucial to England's white-ball revolution and 2019 50-over World Cup win as he smashed an 11th ODI ton. Although he was unable to get England over the line, Roy's innings is a major positive and he will be hoping it will spark a more prolific run of form heading into the World Cup after recent struggles Harry Brook was out for a duck on his ODI debut ( Image: MARCO LONGARI/AFP via Getty Images) Brook's duck on debut Having ended 2022 with a T20 World Cup winner's medal and three Test centuries, it feels surprising that Brook is only just making his ODI debut. The 23-year-old has not played a List A game since 2019 as a result of the Covid pandemic and The Hundred, but England view him as a potential superstar in all three formats and will give him chances to force his way into their World Cup side. With Eoin Morgan and Ben Stokes now retired, although head coach Matthew Mott is hopeful Stokes will return for the World Cup, there are spots up for grabs in the middle order and Brook is very much in contention for one of them. However, he was unable to make an impact on debut as he fell lbw for a three-ball duck to Magala, who was outstanding for the Proteas with 3-46 from his nine overs. Read More Kevin Pietersen hails England youngster \"not afraid to take a risk\" after impressive SA20 Read More Ben Stokes opens up about mental health break - \"Everything got a bit too much for me\" Read More Eoin Morgan offers his verdict on Ben Stokes and Brendon McCullum's England revolution Read More Jos Buttler confirms England are planning for 50-over World Cup without Ben Stokes Read More Steve Harmison pinpoints England difference maker ahead of Australia Ashes clash","pubDate":"2023-01-27 19:35:41","image_url":"https://i2-prod.mirror.co.uk/incoming/article29071021.ece/ALTERNATES/s615/0_GettyImages-1246594258.jpg","source_id":"mirroruk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Doubleheader curse haunts Itanda Kayakers, lose to Bujjagali Rafters and Sipi Trekkers","link":"https://kawowo.com/2023/01/27/doubleheader-curse-haunts-itanda-kayakers-lose-to-bujjagali-rafters-and-sipi-trekkers/","keywords":["Cricket"],"creator":["Denis Musali"],"video_url":null,"description":"Waterfalls Men’s T20 Tournament Game 3: Itanda Kayakers v Bujjagali RaftersItanda Kayakers: 133 all outBujjagali Rafters 136/9Bujjagali Rafters won by 1 wicketPlayer of the Match: Siraje Nsubuga (4/20)Full Match Scorecard: http://www.ugcricket.com/Uganda/viewScorecard.do?matchId=1717&clubId=5335 Game 4: Sipi Trekkers v Itanda KayakersItanda Kayakers: 131/7Sipi Trekkers: 132/7Sipi Trekkers won by 3 wicketsPlayer of the Match: Sami SohailFull Match Scorecard: http://www.ugcricket.com/Uganda/viewScorecard.do?matchId=1719&clubId=5335 […] The post Doubleheader curse haunts Itanda Kayakers, lose to Bujjagali Rafters and Sipi Trekkers appeared first on Kawowo Sports.","content":"Itanda Kayakers v Bujjagali Rafters Itanda Kayakers: 133 all out Bujjagali Rafters 136/9 Bujjagali Rafters won by 1 wicket Player of the Match: Siraje Nsubuga (4/20) Full Match Scorecard: Sipi Trekkers v Itanda Kayakers Itanda Kayakers: 131/7 Sipi Trekkers: 132/7 Sipi Trekkers won by 3 wickets Player of the Match: Sami Sohail Full Match Scorecard: Bujjagali Rafters will sleep worried tonight because none of the teams has been able to win a game on their doubleheader day of the Men’s Waterfalls T20. With the chasing pack behind them doing their homework you fear that you could throw it away on the last day of the group games. Bujjagali Rafters are on top of the table because they are the only side that has won two games with Itanda Kayakers and Sipi Trekkers having won only a game each. Itanda Kayakers used a lot of energy in the morning game against Bujjagali Rafters in a match that went the distance with Bujjagali getting over the line by just one wicket. It was a seesaw game that was balanced for most of the duration until Juma Miyagi took charge in the final over to win the game for the Rafters. In the afternoon, Itanda Kayakers won the toss and elected to bat, but as was in the morning they failed to put on any meaningful partnership and were only able to get to 131 because Bilal Hassun’s exploits in the final over where he hit 3 sixes in a row. In the chase, Sipi Trekkers were put on the winning course by Brian Asaba and Orichide Tuyisenge who had an opening partnership of 53 with contributions coming from the rest of the team as they got over the line by 3 wickets. The two losses for Itanda Kayakers keep them behind Bujjagali Rafters but at least keep Sipi Trekkers at bay due to a superior Net Run Rate. Action will continue tomorrow at the Lugogo Cricket Oval.","pubDate":"2023-01-27 19:23:05","image_url":null,"source_id":"kawowo","category":["sports"],"country":["uganda"],"language":"english"},{"title":"Highlights, South Africa vs England, 1st ODI in Bloemfontein: Proteas win by 27 runs, go 1-0 up in series","link":"https://www.firstpost.com/firstcricket/sports-news/highlights-south-africa-vs-england-1st-odi-in-bloemfontein-proteas-win-by-27-runs-go-1-0-up-in-series-12057902.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"Highlights, South Africa vs England, 1st ODI in Bloemfontein: Proteas win by 27 runs, go 1-0 up in series","content":"Cricket Highlights, South Africa vs England, 1st ODI in Bloemfontein: Proteas win by 27 runs, go 1-0 up in series Nortje and Magala restrict England to 271 after van der Dussen's ton helps South Africa set a stiff 299-run target FirstCricket Staff January 28th, 2023 0:39:58 IST England skipper Jos Buttler and his South African counterpart Temba Bavuma at the toss ahead of the first ODI in Bloemfontein. Twitter @ICC Toss update: Fast bowler Jofra Archer was back in the England team for the first time in nearly two years for the first one-day international against South Africa on Friday. South Africa captain Temba Bavuma won the toss and chose to bat first at Mangaung Oval in Bloemfontein at the start of a three-match series that the teams will finally get to play after it was postponed in 2020 because of the coronavirus pandemic. Archer last played international cricket in March 2021 and last appeared in an ODI in September 2020. He was out with elbow and back injuries but has been playing in the South African domestic Twenty20 league to prove his fitness for the ODI series. Batsman Harry Brook will make his ODI debut for England. South Africa recalled seam bowler Sisanda Magala for his first ODI in a year. Lineups: South Africa: Quinton de Kock, Temba Bavuma (captain), Rassie van der Dussen, Aiden Markram, Heinrich Klaasen, David Miller, Wayne Parnell, Sisanda Magala, Kagiso Rabada, Anrich Nortje, Tabraiz Shamsi England: Jason Roy, Dawid Malan, Ben Duckett, Harry Brook, Jos Buttler (captain), Moeen Ali, Sam Curran, David Willey, Adil Rashid, Jofra Archer, Olly Stone. With inputs from The Associated Press Read all the Latest News , Trending News , Cricket News , Bollywood News , India News and Entertainment News here. Follow us on Facebook , Twitter and Instagram . Updated Date: January 28, 2023 00:39:58 IST Tags: Cricket Jofra Archer South Africa Vs England Find latest and upcoming tech gadgets online on Tech2 Gadgets. Get technology news, gadgets reviews & ratings. Popular gadgets including laptop, tablet and mobile specifications, features, prices, comparison.","pubDate":"2023-01-27 19:09:58","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/01/SA-vs-ENG-1st-ODI-toss-640_Twitter-@ICC.jpg","source_id":"firstpost","category":["sports"],"country":["india"],"language":"english"},{"title":"South Africa withstand Jason Roy brilliance to win first one-day international","link":"https://www.sportsmole.co.uk/cricket/england/news/south-africa-withstand-roy-brilliance-to-win-first-odi_505242.html","keywords":["Cricket","England","South Africa","Jason Roy","Moeen Ali","Sam Curran","Olly Stone","Quinton de Kock","Rassie van der Dussen","David Miller","Dawid Malan","Ben Duckett","Harry Brook","Kagiso Rabada","Jos Buttler","Anrich Nortje","David Willey","Adil Rashid","505242"],"creator":null,"video_url":null,"description":"South Africa withstand a brilliant century from Jason Roy to record a 27-run victory over England in the first one-day international in Bloemfontein.","content":"After winning the toss, South Africa opted to bat first, and the home side impressed during the opening stages as they put on 61 in 8.1 overs for the first wicket. However, by 21.1 overs, the Proteas had been restricted to just 116-3, Moeen Ali , Sam Curran and Olly Stone all chipping in with a wicket apiece. At the time, Quinton de Kock was the top scorer in the pavilion with 37, but that was about to change as Rassie van der Dussen moved the ball around for a patient century. Although he chipped in with just six boundaries and a maximum, Van der Dussen made 111 off 117 deliveries, keeping the innings together before his departure late on. David Miller made 53 at an almost identical strike-rate, taking South Africa to 298-7 off their allotted overs with Curran's 3-35 the best bowling figures for England. 🚨 WICKET 🚨 South Africa win by 27 runs after a remarkable bowling performance pic.twitter.com/7UJaC9DIOS Despite the target being well within England's capabilities, they would theoretically have to work hard to achieve it, yet Roy and Dawid Malan indicated that would not be the case. The pair put on 146 for the opening stand in 19.3 overs before Malan was dismissed for 59 from 55 balls, and that resulted in a collapse from the visitors. Ben Duckett (3) and Harry Brook (0) went cheaply, with it taking a counter-attack from Roy to move England to 196-4 when his wicket went to Kagiso Rabada for 113 off 91 balls, hitting 11 fours and four maximums. With a deep batting lineup, England were not at a point where they needed to panic until the dismissals of Moeen (11) and Jos Buttler (36) left them on 234-6, still requiring 65 off 78 balls. Anrich Nortje soon took his third wicket, removing David Willey for nine, putting Curran and Adil Rashid in a position where they needed to protect their wickets and prevent the run-rate from moving to more than a run per ball. Although they put on 16 for the eighth wicket, South Africa's attack prove too fearsome for the tail-enders, Rashid left stranded on 14 not out as England were bowled out for 271 with 34 balls left unused.","pubDate":"2023-01-27 19:00:31","image_url":"https://sm.imgix.net/21/11/jos-buttler.jpg","source_id":"sportsmole","category":["sports"],"country":["united kingdom"],"language":"english"}]}