{"newsArray":[{"title":"India vs New Zealand LIVE score 2nd T20I: Another wash out on the cards in Mount Maunganui","link":"https://www.firstpost.com/firstcricket/sports-news/india-vs-new-zealand-2nd-t20i-ind-vs-nz-live-score-cricket-match-latest-updates-mount-maunganui-rain-weather-11661431.html","keywords":["First Cricket News"],"creator":["Somya Kapoor"],"video_url":null,"description":"India vs New Zealand LIVE score 2nd T20I: Another wash out on the cards in Mount Maunganui","content":"10:54 (IST)The rain looks to have passed and the covers are coming off at @BayOvalOfficial 👍 Excited for a sold out crowd tonight! #NZvIND #CricketNation pic.twitter.com/VPuCG33obv— BLACKCAPS (@BLACKCAPS) November 20, 202210:49 (IST)India vs New Zealand  First things first. There is a high possibility of rain in Mount Maunganui which can eventually result in a curtailed game or a wash out 10:39 (IST)Hello and welcome to the LIVE COVERAGE of the second T20I between India and New ZealandPREVIEW: The action now moves to Mount Maunganui where India and New Zealand will lock horns in the second T20I. The first clash of the three-match series was washed away due to rain in Wellington while the second game is also under dark clouds as there is a possibility of rain today as well.India are touring New Zealand for three T20Is and as many ODIs. While the T20I side is being led by Hardik Pandya in absence of the senior players, Shikhar Dhawan will be the captain of the ODI team.SQUADS:India: Shubman Gill, Ishan Kishan, Sanju Samson, Suryakumar Yadav, Hardik Pandya(c), Rishabh Pant(w), Deepak Hooda, Bhuvneshwar Kumar, Yuzvendra Chahal, Arshdeep Singh, Umran Malik, Washington Sundar, Mohammed Siraj, Shreyas Iyer, Kuldeep Yadav, Harshal PatelNew Zealand: Finn Allen, Devon Conway(w), Kane Williamson(c), Glenn Phillips, Daryl Mitchell, James Neesham, Mitchell Santner, Tim Southee, Adam Milne, Lockie Ferguson, Blair Tickner, Michael Bracewell, Ish SodhiRead all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-11-20 05:26:00","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/11/India-vs-New-Zealand-2nd-T20I-LIVE-1.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Buzz: Matty Johns cops Mundine whacks for a good cause","link":"https://www.couriermail.com.au/sport/nrl/buzz-matty-johns-helps-launch-anthony-mundine-charity-by-entering-the-ring-with-choc/news-story/ea7701e5c0b09a75fac3955770a50de4","keywords":["NRL News"],"creator":null,"video_url":null,"description":"Matty Johns hasn’t had a decent punch-up since he infamously flattened brother Joey outside a Newcastle pub back in the 90’s.","content":"On Saturday Matty made his comeback – stepping into the ring against his long-time mate Anthony Mundine for the charity launch of Choc’s new foundation that is all about mental health.You can check out the video online.“I turned up to the launch dressed to go out to lunch with Trish,” Johns said.“Choc says jump in the ring bra.“All the crowd were urging me to do it so I had to. I even jumped in with my dress shoes on.“Choc whispered to me: ‘How hard do you wanna go bra.’“I said one out of 10 thanks Choc and he says: ‘how about six.’“He whacked me a few times but it was all good fun for a great cause.”Johns and controversial brain surgeon Dr Charlie Teo were among the celebrity guests.“Choc is a great man,” Johns said, “I always said history would judge him well.“I love that he looks after his people and does a lot of great charity work.” No-show cricketers ripping off fans and FoxNo wonder cricket crowds for the Australia v England one-dayers have been so ordinary.Imagine paying money for a seat at the SCG on Saturday.You arrive at the ground to find Australian captain and local hero Pat Cummins has been rested.Seriously, anyone would think these guys are playing a contact sport.The Australian team was bounced out of the T20 World Cup early and hardly needed a rest.The exciting all-rounder Cameron Green didn’t play either- he was sent home to WA to start preparing for the Test match series.Imagine if it was a rock concert. That you’d paid good money for a ticket but the lead singer and another key member of the band didn’t turn up.Once a ticket to an Australia v England cricket game was gold but this one-day cricket series is a complete rip-off.Imagine how the broadcasters feel.Foxtel is paying squillions for the exclusive rights to one-day cricket.Their subscribers are being ripped off as much as those paying at the turnstiles. It’s wrong.Highlights and LowlightsHIGHLIGHTThe Jillaroos’ magnificent 54-4 victory over the Kiwis in the World Cup final, showing once again the extraordinary growth in speed, skill and strength of the women’s game in Australia. LOWLIGHTA last-minute alcohol ban at stadiums in Qatar for the soccer World Cup, infuriating official FIFA sponsor Budweiser and fans from all over the world who love a beer at the footy. SPOTTEDThere was one bonus for Kiwi coach Michael Maguire getting knocked out of the World Cup in the semi-final loss to Australia. It allowed Madge to be at E.S Marks Field in Kensington on Friday evening to watch his kids at Little Athletics. SPOTTEDIllawarra rugby league royalty at Kembla Grange on Saturday for the Gong meeting. Garry Jack and Rod Wishart are both still looking fit enough to strap on the boots again.SPOTTEDKiwi five-eighth Kieran Foran - still in the heart of Sea Eagles territory - Christmas shopping with his partner and kids at Warringah Mall on Saturday.SHOOSHWhich Wests Tigers star is furious about the treatment of Jackson Hastings and has asked his manager to investigate options at other clubs. BIG BREKKYCatch you on the Big Sports Breakfasts with Laurie Daley, Michael Clarke and Gerard Middleton to discuss all the issues from the World Cup final.","pubDate":"2022-11-20 05:00:00","image_url":null,"source_id":"couriermail","country":["australia"],"category":["sports"],"language":"english"},{"title":"India vs New Zealand 2nd T20I weather update: Rain threat looms large over Bay Oval, another washout on cards","link":"https://www.firstpost.com/firstcricket/sports-news/india-vs-new-zealand-2nd-t20i-weather-update-rain-threat-looms-large-over-bay-oval-another-washout-on-cards-11661331.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"India vs New Zealand 2nd T20I weather update: Rain threat looms large over Bay Oval, another washout on cards","content":"Team India, who are seeking some game time, are likely to face a tough challenge from New Zealand when both sides lock horns in the second T20I of the three-match series on Sunday at the Bay Oval in Mount Maunganui.Notably, the series opener in Wellington was washed out due to continuous rain and the Indian players must be itching to get onto the park which, inarguably, has the most scenic backdrop. However, the bad news for the fans and the players is that the forecast for the second match doesn’t look promising either.The latest weather report suggests dark clouds over Bay Oval during the game time. There is a 90% chance of rain during the match, while the temperature on Sunday will hover in the range of 15-18 degrees Celsius with 80-85% humidity.But, there is still a slight chance of India vs New Zealand second T20I going ahead as the probability of precipitation is expected decrease in the evening.The match will begin at 7:30 PM local time (12 PM IST).Interestingly, the team batting first has won all T20I matches at the Bay Oval but with rain likely to reduce the overs, the toss-winning captain will most likely opt to bowl first.Squads:India: Shubman Gill, Ishan Kishan, Sanju Samson, Suryakumar Yadav, Hardik Pandya(c), Rishabh Pant(w), Deepak Hooda, Bhuvneshwar Kumar, Yuzvendra Chahal, Arshdeep Singh, Umran Malik, Washington Sundar, Mohammed Siraj, Shreyas Iyer, Kuldeep Yadav, Harshal PatelNew Zealand: Finn Allen, Devon Conway(w), Kane Williamson(c), Glenn Phillips, Daryl Mitchell, James Neesham, Mitchell Santner, Tim Southee, Adam Milne, Lockie Ferguson, Blair Tickner, Michael Bracewell, Ish Sodhi.Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-11-20 04:49:57","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/11/IND-vs-NZ-weather.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Does axed Starc hold $10m IPL regrets?","link":"https://www.themercury.com.au/sport/cricket/mitchell-starc-reveals-he-had-a-nononsense-chat-with-george-bailey-after-his-world-cup-axing/news-story/1394a5c3bcb5c941eee0924bd9cb80e9","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Mitchell Starc has revealed he had a no-nonsense chat with George Bailey about his shock World Cup axing, declaring he has no regrets over his $10 million IPL sacrifice.","content":"The left-arm destroyer’s first-over demolition of England’s top order at the SCG on Saturday night snapshotted the error Australia might have made in not playing Starc for the final World Cup match against Afghanistan, where rapid-fire wickets could have opened up a semi-final opportunity.Starc refused to divulge details of his heart-to-heart with the National Selector, other than to confirm he shared some “strong opinions” on his shock axing.“George and I have spoken and that is where it will stay,” said Starc after routing England with a four-wicket masterclass.“I had strong opinions on it and had a conversation, and that’s where it is.”Despite his extraordinary record taking first over wickets particularly in white ball cricket, Starc was taken away from the new ball in the World Cup for most matches, but is adamant he can still spearhead Australia at the next World Cup in the USA in 2024.“Yeah, why not? I don’t have to worry about T20s for another nine months,” said Starc.“I spoke to George at length. It was a good conversation. Many different things were floated there.“I still have ambitions to play T20 cricket for Australia but it is a long time to the next one and a lot of water to go under the bridge. So we will face that when we get to that.”After his World Cup dumping, it was suggested that Starc had sabotaged his Twenty20 form by continually snubbing the Indian Premier League for the past seven years.Starc says maybe so, but refuses to apologise for making Test cricket his No.1 driving force.“It may have, but if I’d gone in there and having no break and playing 12 months of the year, what does that affect? Does that affect my body? Do I break down? Does it affect my red-ball cricket?,” said Starc.“You can’t just sit there and go, ‘he should go to the IPL because he’d be a better T20 bowler.’“What’s the downside of that? Do I give away a format of the game because I’m playing 12 months of the year?“In my mind I don’t regret any of those decisions not to go.”Mitch Starc PollFor that reason there is a feeling Australian cricket has grossly underappreciated the quiet sacrifices Starc has made for his country, electing to preserve his body and mind for Test cricket rather than make easy money in the IPL.Despite being a lightning rod for criticism over the years for his performances in Test cricket, the truth is Starc has been Australia’s best Test bowler for the past 18 months and in the upcoming Test series against the West Indies he is on track to become the fastest Australian to 300 wickets after Dennis Lillee, Glenn McGrath, Warne and Mitchell Johnson.It’s understood Starc was ranked lower than Josh Hazlewood on this year’s Cricket Australia contract list, despite the fact he powered last summer’s Ashes triumph and was the preferred second quick alongside Pat Cummins in Pakistan and Sri Lanka.Australia currently has a headache on its hands with gun all-rounder Cameron Green intending to go to his first IPL in the midst of one of the most packed calendars Australian cricket has seen.Green pulled up sore from the first ODI against England and has returned to Perth to prepare for the first Test – another reminder of the delicate management needed to ensure the prodigy does not burn out.Starc refused to comment on whether his IPL sacrifices had been underappreciated, but confirmed the decision to knock back at least one-two million dollars a year for the past seven years was made chiefly with Australian Test cricket as his No.1 priority.“That’s not for me to say. It’s my decision. I feel like particularly last year, if I take my Test cricket from the past 12-18 months and how that’s benefited from the break that I’ve had through IPL periods, that’s paid for itself I guess,” said Starc.“It’s always been my decision and that is part of the reason that I do it, to give myself that break physically and mentally. And the other side of it is to see and spend time with my wife (Australian women’s captain Alyssa Healy) away from cricket.”Starc said even without playing IPL it would be impossible for him to continue playing all three formats for Australia for the long-term.","pubDate":"2022-11-20 04:00:00","image_url":null,"source_id":"mercury","country":["australia"],"category":["sports"],"language":"english"},{"title":"Ashwin defends Dravid’s absence from New Zealand tour; here’s what he said","link":"https://www.orissapost.com/ashwin-defends-dravids-absence-from-new-zealand-tour-heres-what-he-said/","keywords":["Sports","R Ashwin","Rahul Dravid"],"creator":["Post News Network"],"video_url":null,"description":"New Delhi: Veteran India off-spinner R Ashwin has defended India head coach Rahul Dravid’s absence from the New Zealand tour, saying the support staff “needed a break” after putting in extensive work in preparation for the T20 World Cup. Days after Dravid’s predecessor Ravi Shastri had questioned why an India coach would need a break […]","content":"Ashwin defends Dravid’s absence from New Zealand tour; here’s what he said PTI Updated: November 20th, 2022, 09:15 IST in Sports 0 Share on Facebook Share on Twitter Share on WhatsApp Share on Linkedin New Delhi: Veteran India off-spinner R Ashwin has defended India head coach Rahul Dravid’s absence from the New Zealand tour, saying the support staff “needed a break” after putting in extensive work in preparation for the T20 World Cup. Days after Dravid’s predecessor Ravi Shastri had questioned why an India coach would need a break when they get “two-three months” off during the IPL, Ashwin said that the coaching staff was physically and mentally burned out. Former India batter and current National Cricket Academy (NCA) head VVS Laxman is in charge of the Indian team in New Zealand in Dravid’s absence. “I will explain why Laxman has gone there with a completely different team because even that could be interpreted differently,” Ashwin said on his YouTube channel. “Rahul Dravid and his team put in extensive hard work ahead of the T20 World Cup – right from planning. Since I saw this from close quarters, I’m saying this. “They had specific in-depth plans for each venue and each opposition. So they would have been under not only mental but also physical burnout, and everyone needed a break. “As soon as the New Zealand series ends, we have the Bangladesh tour. That’s why we have a different coaching staff led by Laxman for this tour.” Dravid, one of India’s greatest batters, was given a rest after the T20 World Cup as Laxman became India’s stand-in coach for the tour of New Zealand, with Hardik Pandya taking over as captain for the T20I series. The arrangement didn’t go down well with Shastri, who was replaced by Dravid at the end of the 2021 T20 World Cup in the UAE. “I don’t believe in breaks. I want to understand my team and players, and then be in control of that team. What do you need that many breaks for, to be honest? You get your two-three months of the IPL, that’s enough for you to rest as a coach,” Shastri had said. “But other times, I think a coach should be hands-on, whoever he is.” India qualified for the semi-finals of the T20 World Cup in Australia after winning four out of five group matches, but were humiliated by eventual champions England. Dravid had been also rested for a tour of Zimbabwe earlier this year. India’s ongoing tour of New Zealand comprises three T20Is and three ODIs. After that, India will be in Bangladesh for three ODIs and two Tests, and Dravid will be back for that tour. PTI Tags: R Ashwin Rahul Dravid Share Tweet Send Share Suggest A Correction Enter your email to get our daily news in your inbox. Leave this field empty if you're human: Related Posts What Surya does, I can’t even dream of doing: Glenn Phillips November 19, 2022 Indian men’s hockey team leaves for Australia tour for five-match series November 19, 2022 Manika Batra became first Indian player to win historic bronze at Asian Cup TT November 19, 2022 Australia win toss and will bat 1st in 2nd ODI vs England November 19, 2022 Washington Sundar hopes Lancashire stint and rehab at NCA will come handy in New Zealand November 19, 2022 T20 World Cup fallout: BCCI sacks entire Chetan Sharma-led selection committee November 18, 2022 Leave a Reply Cancel reply Your email address will not be published. Required fields are marked * Comment Name * Email * Website Save my name, email, and website in this browser for the next time I comment.","pubDate":"2022-11-20 03:45:28","image_url":"https://www.orissapost.com/wp-content/uploads/2022/06/Ravichandran-Ashwin-300x209.jpg","source_id":"orissapost","country":["india"],"category":["sports"],"language":"english"},{"title":"Getting nasty: Which club is leaking to headquarters?","link":"https://www.themercury.com.au/sport/nrl/whats-the-buzz-paul-gallen-demoted-in-farewell-fight-the-rat-in-nrl-club-ranks/news-story/1cf1c652077fe4153cfed845b0bff108","keywords":["NRL News"],"creator":null,"video_url":null,"description":"NRL clubs are almost back to being normal.","content":"The feeling of solidarity in the funding dispute with the NRL is fast disappearing.Half the clubs now want to accept the NRL’s latest offer, the other half don’t.It’s getting nasty behind the scenes.One CEO, who shall remain nameless, has been accused of sharing sensitive information from chief executive phone hook-ups straight to NRL headquarters.This guy won’t have too many mates at the next CEO’s conference. That can be assured.If it’s true it’s a low act and even Super League-esque.The split in the ranks is just what the NRL wanted.The solid clubs want to look after their major asset — the players — and hold off on agreement until the RLPA deal for player wages is finalised.At least we know it’s back to business as usual. That the unity could never last.Not in rugby league. It’s the game that lives off bitter rivalries and hostilities. SAINT, SINNER, SHOOSH: LOW BLOW FOR GALLENIn a major snub, old warhorse Paul Gallen has been relegated from main event status for his farewell fight against Justin Hodges on Wednesday night.It is a huge shock and could be considered disrespectful to the 41-year-old sporting warrior who has regularly dragged in big pay-per-view audiences for promoters No Limit and Foxtel’s Main Event.In fairness Gallen’s form has been on the decline for two years and the fight with Hodges, whom he fought not so long ago, lacks the appeal of some of his bigger shows.Age has finally caught up with one of Australia’s toughest ever sports stars.Instead the highly regarded world middleweight contender Michael Zerafa has been given the main billing on Wednesday night at Darling Harbour’s International convention centre.It marks an incredible turnaround for Zerafa, who infamously pulled out of his much-hyped grudge match against Tim Tszyu in July last year.So low were the Melburnians’ stocks at the time, there was even talk he would never fight on television in Australia again.But with a new team and talk of a potential world title shot against Gennady Golovkin on the horizon, Zerafa risks it all against Sydney-based Italian Danilo Creati.It will be a huge night of boxing with another rugby league star on debut as Gallen calls it a day.As first reported by this column, France bound ex-Rooster Siua Sio Taukehio has been confirmed to make his boxing debut against former South Sydney, Cowboys and Storm enforcer Jaiman Lowe.Securing the Tongan international a fight had been a challenge for promoters due the timing around the rugby league world Cup.South Sydney Rabbitohs forward Daniel Suluka-Fifita will also make his professional boxing debut on the card. Suluka-Fifita has been training under the watchful eye legendary trainer of Johnny Lewis for the past eight weeks having started boxing training at Redfern PCYC as a 13 year-old.* * * * * SAINTFooty legend Ian Walsh came from the tiny country town of Eugowra that has been wiped out in the floods. Walsh’s daughter Donna still lives in the area. Donna is assisting in the huge recovery operation and has appealed to NRL clubs to help out. Not with money but with manpower. “Eugowra put dad on the map as a rugby league player,” Donna said, “I know he’d want me to be reaching out to the game when the town is suffering like it is.” Donna has even organised for Dominos to supply free pizzas for the clean-up operation. All she needs now is some players. Donna can be contacted on 0409 743 682 if you’d like to help out.SINNERWe all love Victor Radley, even those who dislike the Roosters. He’s a great character and a tough old-school footy player. However there comes a time when we all need to grow up and walk away from a looming incident and/or violence, even when provoked. It’s time for him to start behaving like a professional athlete.SHOOSHWhich big-name NRL star is talking to a rival Sydney club about the possibility of him quitting his team for an immediate switch. It is potentially a monster story.SPOTTEDCommission chairman Peter V’landys and NRL boss Andrew Abdo entering the North Sydney headquarters of the independent always – or at least sometimes – Nine Entertainment, presumably for a meeting with CEO Mike Sneesby and senior SMH editorial executives last week.SPOTTEDIt can be tough work for a boxer preparing to fight for a world title. Tim Tszyu has moved his training camp to Thailand ahead of the January super fight against Jermell Charlo. He takes a break every now and then to go jetskiing.SPOTTEDThe great Ken Arthurson has understandably been struggling since the recent passing of his lovely wife, Barbara. It helps that there are good people like Tom Trbojevic around. Turbo picked up the phone last week to ring and check in on the legendary old Manly supremo. Their chat has given Arko an enormous lift.SPOTTEDAllianz Stadium maintenance staff replacing 30 seats that were stomped on and smashed by fans at the Sydney FC v Wanderers derby last weekend. Sydney FC will be getting the repair bill in the mail next week. SPOTTEDIt doesn’t always pay to have India or Pakistan in big cricket finals in Australia. This is an empty bar at the MCG last Sunday night in the 14th over of the game. Their fans rarely drink at the cricket. It costs the caterers big time. If the Aussies were playing, they’d be lining up six-deep. THE POLITICIAN, HONEY KING PRAWNS AND NOT-SO-SECRET MEETINGNo other NRL club can leak sensitive information like the Canterbury Bulldogs.You’ll remember last November Eels hooker Reed Mahoney was having a private dinner in the club’s Chinese restaurant with Gus Gould and Trent Barrett. Contract talks over honey king prawns and Mongolian lamb. A picture was sent straight to The Daily Telegraph.You’ve got to wonder why they met in such a public space.Then there was the photo of Billy Kikau in a Bulldogs shirt at Belmore with Gus and Baz being leaked last year while he was still at the Penrith Panthers. Highly embarrassing for Kikau, who copped a hard time from his fans.An employee, who took a frame from security CCTV and circulated it on social media, was sacked.Then July this year. Cameron Ciraldo and his manager George Mimis had a secret lunch with Bulldogs sponsor Craig Laundy to discuss the coaching job. Footage was leaked straight to Channel 9. This week, same again. Hotel billionaire Arthur Laundy signed up for a new five-year sponsorship deal to match the length of Ciraldo’s coaching contract.It’s worth $1 million a year or $1.2 million if they make the finals.A good positive story about a rock-solid businessman who signed up when the club was at its lowest but is now committing long term.The plan was to make a major announcement this week to ensure Laundy got maximum exposure.Turns out Craig Laundy had photos taken on his phone at the official signing. He shared them with Gould, Ciraldo and other mates on Wednesday night. His pictures then hit social media.To be fully transparent, your columnist is writing this with a certain amount of disappointment.We were going to reveal the $5 million sponsorship deal two weeks ago. Chairman John Khoury and CEO Aaron Warburton asked us to hold off. We made an agreement. We would break the story this week before their official announcement.Craig Laundy, a former Liberal federal minister, is like all politicians. They leak like a sieve.The Daily Telegraph NRL Podcast – PlaylistBOO & BALI A TRIBUTE TO FIFITARecently retired Sharks big man Andrew Fifita has found himself in a little bit of froth and bubble while holidaying in Bali.But before you jump to conclusions, the froth and bubble was courtesy of a barista who amazed the 2016 premiership hero, garnishing his brew with a recent tribute cartoon, done by Telegraph sports sketcher Boo Bailey.The copying process is a specialty of the house at Coffee Cartel and had a surprised Fifita joking: “I got squeezed out of the Sharks cap, but made it into this one.”SYDNEY FC SIGN UP 11-YEAR-OLD TWINSSydney FC have signed their youngest ever players – 11-year-old identical twin brothers.Jacob and Benjamin Zaidel have joined the club’s junior academy alongside some of the country’s most outstanding soccer prospects.It is an exciting story on the eve of the World Cup that local clubs are now following the lead of global giants in Europe and South America by recognising kids at such a young age.“They live and breathe the game,” says their dad Dani. “Who knows what the future holds – as long as they keep enjoying it.”Interestingly there are rules in the NRL that prevent clubs from signing players before they turn 15.The boys have been identified by Kelly Cross, Sydney FC’s youth technical director, who has a long and proud history of nurturing the best talent in Australian soccer.Kelly is a former head of football at Westfield Sports High who coached current Socceroos Aaron Mooy and Andrew Redmayne, as well as Harry Kewell, Alex Brosque and Jason Culina.“We’ve been monitoring Ben and Jacob for a period of time and it became clear that they were both equally talented,” Cross said.“You couldn’t tell them apart in terms of ability so it helped that they were wearing different coloured and numbered bibs so there were no problems identifying them.“They are only 11-years old but they are promising young players showing creative potential and it’s great to bring them into our environment.“They are great kids, bubbly and enthusiastic with a good attitude. They get on well with each other and their peers.”The boys’ dad Dani could not be prouder.“Sydney FC start with Under 13’s at their academy,” he said, “The boys are going in a year early. “It’s a year by year agreement that the parents sign.“They’ve had a big advantage as twins kicking a football around the backyard from when they were tiny. They just love the game and are really excited about it.”‘ROCKY’ A GREAT MAN AND INNOVATORJournalism lost an all-time legend with the passing of Roy “Rocky” Miller, a former editor of this newspaper and the most tragic St George Illawarra Dragons fan. The great man was 77.I learnt more from Rocky’s weekly Sunday Telegraph editorial meetings than I have from anyone in 46 years. He was a fanatical news chaser and innovator.Back in the 1980s, before anyone kept or thought of rugby league statistics, he sent copy boys to every game to do tackle counts. They became hugely popular in Monday’s papers.Our staff would all cheer for the Dragons each weekend knowing a victory would mean he’d be in a good mood for Tuesday morning conference. It could be miserable otherwise.As an editor, he was one of the great mentors. He gave me my start as a sports editor. I remember him playing an instrumental role in broadcaster Ray Hadley’s career in his early days. Hadley had just started the Continuous Call team on 2UE. He was up against the high-profile Hollywood and Zorba, a duo that won every footy ratings survey.Zorba used to joke: “Ray could rob a bank without a balaclava and get away with it because no one knows who he is.”Hadley then made an appointment to meet Rocky. He needed to lift his profile and asked Miller if he could write a weekly column in The Sunday Telegraph sports section – Hadley’s Hard Hits. He did it for free. He would soon become one of the major voices in league and regularly win the ratings.What I admired most was Rocky’s loyalty. He’d stick solid no matter what. Three weeks before his death he sent me a text about Dragons legend Craig Young, one of his all-time favourite players who was under siege as chairman for his controversial support of Brett Finch in a court reference.“Look after him,” Rocky wrote. “He made a mistake trying to help a mate (Finch’s father). Does not deserve to be crucified.”Typical Rocky. Always looking after his beloved club … and his mates right to the end.* Rocky’s funeral is on Tuesday at 11am at St Aloysius church in Cronulla.","pubDate":"2022-11-19 23:52:00","image_url":null,"source_id":"mercury","country":["australia"],"category":["sports"],"language":"english"},{"title":"Income of Rs.3,730 crore.. BCCI is the powerhouse of cricket","link":"https://thenewsglory.com/income-of-rs-3730-crore-bcci-is-the-powerhouse-of-cricket/","keywords":["Sports","BCCI","Cricket","Indian Cricket Board","Revenue"],"creator":["The News Glory"],"video_url":null,"description":"It is a well-known fact that the Board of Cricket in India (BCCI) still generates more revenue than any other national cricket board. But the BCCI has once again proved that it is the undisputed powerhouse of world cricket. Highest earning cricket board revealed by BCCI data According to data published by Times Now, the […]","content":"It is a well-known fact that the Board of Cricket in India (BCCI) still generates more revenue than any other national cricket board. But the BCCI has once again proved that it is the undisputed powerhouse of world cricket. Highest earning cricket board revealed by BCCI data According to data published by Times Now, the Board of Control for Cricket in India has generated a revenue of Rs 3,730 crore in 2021. In second place is Cricket Australia, the Australian cricket board. Its revenue is Rs 2,843 crore. However, BCCI’s income is 23% higher than that of Australia. England & Wales Cricket Board took the third place. It earned a revenue of Rs 2,135 crore. Pakistan Pakistan Cricket Board (PCB) is at the fourth position with revenue of Rs 811 crore. Bangladesh Cricket Board is at the fifth position. It generates a revenue of Rs 802 crore. South Africa is sixth in the list with Rs 485 crore and New Zealand Cricket Board is seventh with Rs 210 crore. West Indies Cricket Board (Rs 116 crores), Zimbabwe Cricket Board (Rs 113 crores), and Sri Lanka Cricket (Rs 100 crores) occupy the bottom three spots in this list. It is noteworthy that IPL success has helped BCCI to become the unshakable cricket board in the world.","pubDate":"2022-11-19 21:44:10","image_url":null,"source_id":"thenewsglory","country":["india"],"category":["sports"],"language":"english"},{"title":"Australia lights up England to win ODI series","link":"https://www.couriermail.com.au/sport/cricket/australia-lights-up-england-to-win-odi-series/video/bedb77c19ea9ada98f5e0045d2ed5390","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket: Steve Smith's heroics helped Australia clinch the series win with a second-straight win over England by a whopping 72 runs.","content":"Cricket: Steve Smith's heroics helped Australia clinch the series win with a second-straight win over England by a whopping 72 runs.","pubDate":"2022-11-19 21:27:20","image_url":null,"source_id":"couriermail","country":["australia"],"category":["sports"],"language":"english"},{"title":"Cooch Behar: Aman hits ton for Hyderabad","link":"https://telanganatoday.com/cooch-behar-aman-hits-ton-for-hyderabad","keywords":["News","Sport","Aman Rao","Cooch Behar Trophy","MCA Cricket Stadium"],"creator":["Telangana Today"],"video_url":null,"description":"Hyderabad: Aman Rao slammed a 155-ball 111 while Murugan Abhishek scored 80 to guide Hyderabad to 275 all out in 73.3 overs against Maharashtra on the first day of the Group-B U-19 Cooch Behar Trophy held at the MCA Cricket Stadium, Gahunje, Maharashtra on Saturday. Batting first, Hyderabad posted a decent total with the help […]","content":"Home | Sport | Cooch Behar Aman Hits Ton For Hyderabad Cooch Behar: Aman hits ton for Hyderabad By Telangana Today Published: Published Date - 11:21 PM, Sat - 19 November 22 Hyderabad: Aman Rao slammed a 155-ball 111 while Murugan Abhishek scored 80 to guide Hyderabad to 275 all out in 73.3 overs against Maharashtra on the first day of the Group-B U-19 Cooch Behar Trophy held at the MCA Cricket Stadium, Gahunje, Maharashtra on Saturday. Batting first, Hyderabad posted a decent total with the help of Aman’s century and Abhishek’s half-century. Aman’s ton included 18 boundaries and two over it. He added 115 runs partnership with Aravelly Avanish (39) for the opening wicket. Also Read Hyderabad witnesses first taste of formula cars For Maharashtra, Yash Borkar and AR Nishad scalped three wickets each while Razaq Fallah snared two wickets. At stumps, Maharashtra were 31/1 in 14 overs. Brief Scores: Hyderabad 275 in 73.3 overs (Aman Rao 111, Murugan Abhishek 80, Aravelly Avanish 39; Razaq Fallah 2/31, Yash Borkar 3/71, A R Nishad 3/43) vs Maharashtra 31/1 in 14 Overs (Arshin Kulkarni 21 batting); HCA U-16 Inter Schools, Colleges & Districts One Day Knock Out Tournament: Sri Chaitanya School (East Marredpally) 274 in 44.3 Overs (C Siddharth Rao 51, T Shiva Rama 78, M Ram Charan 48, B Srujan 3/38, CH Vinay 4/43) bt Adilabad 269/9 in 45 Overs (Simhadri 168; T Shiva Rama Krishna 4/22). Follow Us : Tags Aman Rao Cooch Behar Trophy MCA Cricket Stadium Related News Cooch Behar Trophy: Aman, Rithish power Hyderabad to 462/6 on Day 1 Cooch Behar Trophy: Hyderabad suffer big loss against Bengal Cooch Behar Trophy: Rahul’s century guides Bengal to 383/9 on Day 3 Cooch Behar Trophy: Hyderabad take 87-run lead against Bengal on Day 2 Cooch Behar Trophy: Prithvi scalps five to restrict Bengal to 219 on Day 1 Cooch Behar Trophy: Hyderabad take three points after draw","pubDate":"2022-11-19 17:51:46","image_url":null,"source_id":"telanganatoday","country":["india"],"category":["sports"],"language":"english"},{"title":"England implode to hand second ODI, series to Australia","link":"https://www.kuwaittimes.com/england-implode-to-hand-second-odi-series-to-australia/","keywords":["Cricket","Sports"],"creator":["kuwaittimes"],"video_url":null,"description":"SYDNEY: Australia wrapped up the three-match one-day international series with a comprehensive 72-run win over England at the Sydney Cricket Ground on Saturday. Chasing 281 to level the series after Australia won the first match in Adelaide on Thursday, England appeared well on track as Sam Billings and James Vince shared a 122-run partnership for … The post England implode to hand second ODI, series to Australia appeared first on Kuwait Times.","content":"Australia wrapped up the three-match one-day international series with a comprehensive 72-run win over England at the Sydney Cricket Ground on Saturday. Chasing 281 to level the series after Australia won the first match in Adelaide on Thursday, England appeared well on track as Sam Billings and James Vince shared a 122-run partnership for the fourth wicket. But once Vince was trapped lbw by stand-in Australian captain Josh Hazlewood for 60, the English imploded, losing 4-13 to virtually hand the Australians the match. On a tricky wicket at the SCG, Steve Smith continued the form he showed in Australia’s six-wicket win in Adelaide with a hard-fought 94 to help Australia to 280-8. The target always looked difficult on a surface that was playing slow with the occasional bad bounce. “It looks easy to bat on when a partnership is going,” Hazlewood said of the surface. “But you’re only a wicket away from causing a collapse on such a pitch. I was very happy with 280.” England got the worst possible start to the run chase when Jason Roy tickled Mitchell Starc’s second delivery down the leg side to keeper Alex Carey. Three balls later Starc got the key wicket of Dawid Malan with an almost unplayable ball that pitched on leg stump then swung back to take the top of off, leaving England staggering at two wickets for no runs. Phil Salt and Vince kept playing with the aggression that the England white-ball teams are renowned for, and took the score to 34 after five overs. But Salt tried one big shot too many, stepping away to try and smash Hazlewood over cover only to miss the ball and see it cannon into his stumps. Any hopes Australia may have had of crashing through the England batting lineup were dashed by Vince and Billings. The two mixed caution with aggression as they took the score to 156 before Vince was trapped by Hazlewood as he tried to hoist the Australian skipper over the square leg boundary. England captain Moeen Ali came in and smashed leg spinner Adam Zampa for a four and a six, then missed a top spinner and was bowled. At 168-5 after 28.3 overs, Australia were back in control and they tightened their grip one run later when Zampa bowled Billings for 71. England wickets kept tumbling as Starc (4-47), Hazlewood (2-33) and Zampa (4-45) wrapped up the English tail. “We were in a good position with the bat but we lost wickets,” Ali said. “The wicket actually got easier to bat on but we lost wickets-it’s just one of those things. “They bowled well in that phase and the pressure got to us. If you lose wickets regularly, you’re not going to win many games.” Earlier, Smith’s 94 from 114 balls anchored the Australian innings after Hazlewood won the toss and decided to bat. Hazlewood was brought into the side for captain Pat Cummins, who was rested with an eye to the upcoming Test series against the West Indies. The pitch initially offered little help for the seamers but it deteriorated as the innings progressed. – AFP","pubDate":"2022-11-19 16:42:46","image_url":null,"source_id":"kuwaittimes","country":["Kuwait"],"category":["sports"],"language":"arabic"},{"title":"Little by little perishing May Islands team: Kathikutty players who flipped!","link":"https://thenewsglory.com/little-by-little-perishing-may-islands-team-kathikutty-players-who-flipped/","keywords":["Sports","ACT XI","Australia","Cricket","NSW","online special","top order","Tour","West Indies"],"creator":["The News Glory"],"video_url":null,"description":"The West Indies team, which has gone to Australia for the 2-Test series, drew a match against New South Wales and Act XI in a 3-day warm-up match. The fact that the two Kathucuti players of the team turned the bowling of the May Islands team is the talk of the Australian cricket world. May […]","content":"The West Indies team, which has gone to Australia for the 2-Test series, drew a match against New South Wales and Act XI in a 3-day warm-up match. The fact that the two Kathucuti players of the team turned the bowling of the May Islands team is the talk of the Australian cricket world. May Islands play 2 Test matches in December. The 1st Test will be played in Perth and the 2nd Test will be played in Adelaide. In the 3-day practice match held in Canberra, May Islands batted first and scored 424 runs for the loss of 9 wickets. New South Wales and the Oct-11 team, who continued to bowl, turned the bowling over and declared (!) 426/4 in 97 overs. In the 2nd innings, May Isles stumbled to 114/4 and the game was drawn. In this, the misery of the May Islands team is that the 24-year-old player named Blake Macdonald, the captain of the New South Wales and Act XI team, scored 177 runs off 265 balls with 15 fours and 5 sixes. Another player, Oliver Davies, only 22, scored 115 runs off 106 balls with 14 fours and 3 sixes, while Justin Aventano scored 54 runs. The fact that these 3 players are Kathucutti players who have not yet played first-class cricket is being talked about in Australia as the main point that indicates the weakness of the May Islands bowling. If non-first-class players like Kimar Roach, Jayden Seals, Aljarri Joseph and off-spinner Ruston Chase are turning the ball around, what will a batting line-up of Warner, Khawaja, Travis Head, Smith and Labuschenne do for the May Islands in Test cricket against Australia? The talk has arisen in Australia. The fact that the May Islands team, which had already failed to qualify for the T20 World Cup, was invited for the Test series is seen by the Australian media as a mockery and sarcasm. Kimar Roche scored 34 runs against this Kathucutti team and failed to lose a single wicket in 13 overs. Jayden Seals, the current leading fast bowler for the May Islands, bowled 14 overs and failed to take a wicket. Aljari Joseph scored 54 runs in 13 overs, while Raston Chase scored 117 runs in 23 overs and took only one wicket. If the leading bowlers of the May Islands do not take wickets, how can they take wickets against Australia? Australian batsmen are expected to break many records in this series. It really adds to the sadness and pain that the bowling of the Isles of May has degraded to what it is today. In the end, the current top bowlers of the May Islands, even Kathucutti batsmen could beat them or they could not even beat players who had not even played first-class cricket. This state of affairs suggests that the greatest art of the May Islands, cricket, has reached its final days. Just like India, Pakistan, Sri Lanka and Bangladesh, cricket in the May Islands was developed by British colonialism as a great anti-colonial art and sport. It is hard to digest that today the art of cricket in the May Islands is slowly going downhill and dying unnoticed by the moneyed cricket world.","pubDate":"2022-11-19 16:39:11","image_url":null,"source_id":"thenewsglory","country":["india"],"category":["sports"],"language":"english"},{"title":"AUS vs ENG: रोटेशन पॉलिसी पर काम कर रहा है क्रिकेट ऑस्ट्रेलिया! जोश हेजलवुड ने बताया क्या है प्लान","link":"https://www.abplive.com/sports/cricket/josh-hazlewood-replaces-pat-cummins-as-australia-captain-in-second-odi-against-england-2263055","keywords":null,"creator":["ABP Live"],"video_url":null,"description":"Josh Hazlewood On Pat Cummins: ऑस्‍ट्रेलियाई क्रिकेट टीम (Australia Cricket team) कप्तानी के विकल्प बढ़ाने पर काम कर रही है. इसके लिए क्रिकेट ऑस्ट्रेलिया ने 12 महीने का वक्त तय किया है. दरअसल, ऐसा माना जा रहा है कि ऑस्‍ट्रेलियाई क्रिकेट टीम आने वाले दिनों मे नियमित कप्तान पैट कमिंस (Pat Cummnis) की जगह कार्यवाहक कप्‍तानों को आजमा सकती है. बहरहाल, क्रिकेट ऑस्ट्रेलिया फिलहाल इस रणनीति पर काम कर रही है. 'इंग्लैंड के खिलाफ दूसरे वनडे मैच में पैट कमिंस को आराम' दरअसल, शनिवार को ऑस्ट्रेलिया और इंग्लैंड के बीच दूसरा वनडे मैच खेला गया. इस मैच में ऑस्ट्रेलिया ने इंग्लैंड को हरा दिया. ऑस्ट्रेलियाई टीम इस जीत के बाद सीरीज में 2-0 से आगे हो गई है. वहीं, इंग्लैंड के खिलाफ इस मैच में पैट कमिंस की जगह जोश हेजलवुड ने ऑस्ट्रेलियाई टीम की कप्तानी की. इस मैच में नियमित कप्तान पैट कमिंस को आराम दिया गया था. इस बात जोश हेजलवुड ने भी साफ किया. उन्होंने टॉस के वक्त कहा कि इस मैच में मैं कार्यवाहक कप्तान के तौर पर कप्तानी कर रहा हूं. ऑरोन फिंच के भविष्य पर क्रिकेट ऑस्ट्रेलिया की रणनीति? फिलहाल, टी20 फॉर्मेट में क्रिकेट ऑस्ट्रेलिया क्या सोच रही है, यह साफ नहीं हो पाया है. दरअसल, पिछले दिनों ऑरोन फिंच ने कहा था कि वह बीबीएल के वक्त अपने करियर पर फैसला लेंगे, बीबीएल से पहले वह अपने करियर पर फैसला नहीं लेंगे. गौरतलब है कि पिछले दिनों टी20 वर्ल्ड कप 2022 खत्म हुआ. इस टूर्नामेंट के फाइनल मैच में इंग्लैंड ने पाकिस्तान को हराकर दूसरी बार यह खिताब अपने नाम किया. वहीं, टी20 वर्ल्ड कप का अगला संस्करण साल 2024 में खेला जाएगा. टी20 वर्ल्ड कप 2024 की मेजबानी अमेरिका और वेस्टइंडीज करेगा. ये भी पढ़ें- 'मेरा डेब्यू तुमसे भी खराब था', जब महेन्द्र सिंह धोनी ने निराश शुभमन गिल की हौंसला-अफजाई की IND vs NZ 2022: माउंट माउंगानुई पहुंचने पर टीम इंडिया का 'ग्रैंड वेलकम', कल खेला जाएगा सीरीज का दूसरा मैच","content":"Josh Hazlewood On Pat Cummins: ऑस्‍ट्रेलियाई क्रिकेट टीम (Australia Cricket team) कप्तानी के विकल्प बढ़ाने पर काम कर रही है. इसके लिए क्रिकेट ऑस्ट्रेलिया ने 12 महीने का वक्त तय किया है. दरअसल, ऐसा माना जा रहा है कि ऑस्‍ट्रेलियाई क्रिकेट टीम आने वाले दिनों मे नियमित कप्तान पैट कमिंस (Pat Cummnis) की जगह कार्यवाहक कप्‍तानों को आजमा सकती है. बहरहाल, क्रिकेट ऑस्ट्रेलिया फिलहाल इस रणनीति पर काम कर रही है. 'इंग्लैंड के खिलाफ दूसरे वनडे मैच में पैट कमिंस को आराम' दरअसल, शनिवार को ऑस्ट्रेलिया और इंग्लैंड के बीच दूसरा वनडे मैच खेला गया. इस मैच में ऑस्ट्रेलिया ने इंग्लैंड को हरा दिया. ऑस्ट्रेलियाई टीम इस जीत के बाद सीरीज में 2-0 से आगे हो गई है. वहीं, इंग्लैंड के खिलाफ इस मैच में पैट कमिंस की जगह जोश हेजलवुड ने ऑस्ट्रेलियाई टीम की कप्तानी की. इस मैच में नियमित कप्तान पैट कमिंस को आराम दिया गया था. इस बात जोश हेजलवुड ने भी साफ किया. उन्होंने टॉस के वक्त कहा कि इस मैच में मैं कार्यवाहक कप्तान के तौर पर कप्तानी कर रहा हूं. ऑरोन फिंच के भविष्य पर क्रिकेट ऑस्ट्रेलिया की रणनीति? googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); News Reels फिलहाल, टी20 फॉर्मेट में क्रिकेट ऑस्ट्रेलिया क्या सोच रही है, यह साफ नहीं हो पाया है. दरअसल, पिछले दिनों ऑरोन फिंच ने कहा था कि वह बीबीएल के वक्त अपने करियर पर फैसला लेंगे, बीबीएल से पहले वह अपने करियर पर फैसला नहीं लेंगे. गौरतलब है कि पिछले दिनों टी20 वर्ल्ड कप 2022 खत्म हुआ. इस टूर्नामेंट के फाइनल मैच में इंग्लैंड ने पाकिस्तान को हराकर दूसरी बार यह खिताब अपने नाम किया. वहीं, टी20 वर्ल्ड कप का अगला संस्करण साल 2024 में खेला जाएगा. टी20 वर्ल्ड कप 2024 की मेजबानी अमेरिका और वेस्टइंडीज करेगा. ये भी पढ़ें- 'मेरा डेब्यू तुमसे भी खराब था', जब महेन्द्र सिंह धोनी ने निराश शुभमन गिल की हौंसला-अफजाई की IND vs NZ 2022: माउंट माउंगानुई पहुंचने पर टीम इंडिया का 'ग्रैंड वेलकम', कल खेला जाएगा सीरीज का दूसरा मैच var _fireSc=!0;document.addEventListener(\"scroll\",(e=>{if(_fireSc){var c=document.createElement(\"script\");c.src=\"//asset.fwpub1.com/js/embed-feed.js\",c.async=!0,document.getElementsByTagName(\"head\")[0].appendChild(c),_fireSc=!1}}));","pubDate":"2022-11-19 16:23:58","image_url":null,"source_id":"abplive","country":["india"],"category":["sports"],"language":"hindi"},{"title":"What Surya does, I can’t even dream of doing: Glenn Phillips","link":"https://www.orissapost.com/what-surya-does-i-cant-even-dream-of-doing-glenn-phillips/","keywords":["Sports","Glenn Phillips","suryakumar yadav"],"creator":["Post News Network"],"video_url":null,"description":"Mount Maunganui: He is a T20 ace in his own right but New Zealander Glenn Phillips says he can’t even “dream” of pulling off some of the incredible shots that Suryakumar Yadav plays with ease. Surya, world No. 1 T20 batter, will square off against Phillips’ New Zealand in the second game here at the […]","content":"What Surya does, I can’t even dream of doing: Glenn Phillips PTI Updated: November 19th, 2022, 21:35 IST in Sports 0 Share on Facebook Share on Twitter Share on WhatsApp Share on Linkedin Mount Maunganui: He is a T20 ace in his own right but New Zealander Glenn Phillips says he can’t even “dream” of pulling off some of the incredible shots that Suryakumar Yadav plays with ease. Surya, world No. 1 T20 batter, will square off against Phillips’ New Zealand in the second game here at the Bay Oval, a ground where the Black caps dasher has fond memories of scoring a 46-ball hundred. “He (Surya) is absolutely incredible. The things that he does I wouldn’t even dream of doing. I would love to try but we have very different games. The wrist strength that he’s got to be able to hit balls for six in extremely awkward areas is a talent you rarely see,” Phillips was quoted as saying in stuff.Co.Nz. Phillips also mentioned that the “high risk-high reward game” that is played by him and Surya also keeps opposition in the game as they have the danger of getting out if some of those adventurous shots aren’t executed properly. “I have got my strengths and he has got his and we go about our jobs in different ways. And the way we both play presents opportunities for the opposition to get us out as well. It’s part of the risk and reward of middle order cricket in T20.” Surya has been world’s top run-getter in the 2022 calendar year with whopping 1040 runs at an average of 43 and a magnificent strike-rate of 186. Phillips is eighth in the ICC’s T20I batters’ list and has scored 650 runs at a strike-rate of 158 plus. Phillips is fearing that on good batting tracks like Bay Oval (Mt Maunganui) and McLean Park (Napier), Surya’s strike-rate would soar even higher. “I could easily see (Surya’s) strike rate being even higher here than it was in Aussie, with the slightly smaller grounds and the pitches very similar, potentially a bit bouncier with a bit more grass on them. It’s going to be very interesting what sort of strike rates we see here.” PTI Tags: Glenn Phillips suryakumar yadav Share Tweet Send Share Suggest A Correction Enter your email to get our daily news in your inbox. Leave this field empty if you're human: Related Posts Indian men’s hockey team leaves for Australia tour for five-match series November 19, 2022 Manika Batra became first Indian player to win historic bronze at Asian Cup TT November 19, 2022 Australia win toss and will bat 1st in 2nd ODI vs England November 19, 2022 Washington Sundar hopes Lancashire stint and rehab at NCA will come handy in New Zealand November 19, 2022 T20 World Cup fallout: BCCI sacks entire Chetan Sharma-led selection committee November 18, 2022 ISL 2022-23: High-intensity game on cards as Odisha FC look to end East Bengal’s spirited recovery November 18, 2022 Leave a Reply Cancel reply Your email address will not be published. Required fields are marked * Comment Name * Email * Website Save my name, email, and website in this browser for the next time I comment.","pubDate":"2022-11-19 16:05:53","image_url":"https://www.orissapost.com/wp-content/uploads/2019/11/Suryakumar-300x225.jpg","source_id":"orissapost","country":["india"],"category":["sports"],"language":"english"},{"title":"Pro Kabaddi 2022 LIVE: UP Yoddhas 3 - 10 Jaipur Pink Panthers","link":"https://www.firstpost.com/sports/pro-kabaddi-2022-live-up-yoddas-vs-jaipur-pink-panthers-u-mumba-vs-telugu-titans-dabang-delhi-kc-vs-patna-pirates-live-streaming-pkl-season-9-match-latest-updates-11660301.html","keywords":["Sports"],"creator":["Bansal Shah"],"video_url":null,"description":"Pro Kabaddi 2022 LIVE: UP Yoddhas 3 - 10 Jaipur Pink Panthers","content":"Pro Kabaddi 2022 LIVE: Panthers gain early advantage; UP Yoddhas 23 - 37 Jaipur Pink Panthers Pro Kabaddi League Live Scores: UP Yoddhas face Jaipur Pink Panthers Bansal Shah November 19, 2022 19:33:25 IST Auto refresh feeds Pro Kabaddi League Live Updates ProKabaddi.com Highlights LIVE NEWS and UPDATES Nov 19, 2022 - 20:21 (IST) Pro Kabaddi League Live UP Yoddhas vs Jaipur Pink Panthers Jaipur Pink Panthers have burst the bubble. Pardeep Narwal is out as he tried to bag some more points in his raid. Less than 5 minutes left in the match and the Panthers can't lose it from here. UP Yoddhas 23 - 37 Jaipur Pink Panthers Nov 19, 2022 - 20:18 (IST) Pro Kabaddi League Live UP Yoddhas vs Jaipur Pink Panthers Pardeep Narwal has a super-10 now, with continuous raids he is single handedly trying to bring Yoddhas back in the game! And Jaipur Pink Panthers have been all-out as Arjun Deshwal is defended on his next raid! Are we going to see some twist here? Total points: UP Yoddhas 22 - 34 Jaipur Pink Panthers Nov 19, 2022 - 20:10 (IST) Pro Kabaddi League Live UP Yoddhas vs Jaipur Pink Panthers Pardeep Narwal making back-to-back raids and is trying to bag some points for his side. But Panthers have been strong and Arjun Deshwal has already claimed a super-10 | 11 minutes left in the match. Total points: UP Yoddhas 15 - 32 Jaipur Pink Panthers Nov 19, 2022 - 20:04 (IST) Pro Kabaddi League Live UP Yoddhas vs Jaipur Pink Panthers UP Yoddhas have been all-out for the second time in this match. They asked for a review as well, but in vain for them as the raider was out of the mat when he tried to reach the centre line. Total points: UP Yoddhas 11 - 27 Jaipur Pink Panthers Nov 19, 2022 - 20:00 (IST) Pro Kabaddi League Live UP Yoddhas vs Jaipur Pink Panthers The second half has started with Yoddhas having just two players on the mat, and the Panthers captain has scalped one more. Yoddhas facing an all-out situation here. Total points: UP Yoddhas 10 - 23 Jaipur Pink Panthers Nov 19, 2022 - 19:57 (IST) Pro Kabaddi League Live UP Yoddhas vs Jaipur Pink Panthers A glimpse of riveting action from the first half! A rare sight of how to cage a #TopCat 👊 #vivoProKabaddi #FantasticPanga #UPvJPP pic.twitter.com/LOXN4570aU — ProKabaddi (@ProKabaddi) November 19, 2022 Nov 19, 2022 - 19:55 (IST) Pro Kabaddi League Live UP Yoddhas vs Jaipur Pink Panthers First half points breakup Total points: UP Yoddhas 10 - 22 Jaipur Pink Panthers Raid points: UP Yoddhas 8 - 10 Jaipur Pink Panthers Tackle points: UP Yoddhas 2 - 8 Jaipur Pink Panthers All-out points: UP Yoddhas 0 - 2 Jaipur Pink Panthers Extra points: UP Yoddhas 0 - 2 Jaipur Pink Panthers Nov 19, 2022 - 19:53 (IST) Pro Kabaddi League Live UP Yoddhas vs Jaipur Pink Panthers End of the first half and Jaipur Panthers have completely dominated the first 20 minutes of the match here. A mammoth 12-point lead to end the first half! UP Yoddhas 10 - 22 Jaipur Pink Panthers Nov 19, 2022 - 19:48 (IST) Pro Kabaddi League Live UP Yoddhas vs Jaipur Pink Panthers UP Yoddhas are trying to make a comeback, but Jaipur Pink Panthers still enjoying a healthy lead. Pardeep Narwal raiding back-to-back, trying to add points to the scoreboard. But the Yoddhas have struggled in defense. Just 2 defense points so far. Four minutes left in the first half. UP Yoddhas 8 - 17 Jaipur Pink Panthers Nov 19, 2022 - 19:43 (IST) Pro Kabaddi League Live UP Yoddhas vs Jaipur Pink Panthers A timeout being called in by UP Yoddhas just at the halfway mark as they are trailing by 10 points. Panthers have been sharp in the defense and have scored more points while defending than raiding. The two all-out points have definitely added to their advantage. UP Yoddhas 4 - 13 Jaipur Pink Panthers Load More UP Yoddhas, undefeated in their last five games, will kick off the triple-header Saturday against Jaipur Pink Panthers. Surender Gill has exceeded Pardeed Narwal, 129 to 111 points, and that shall be considered as the best news for the Yoddhas. But they have only seven wins overall out of 14 games. Jaipur Pink Panthers, on the other hand, have nine wins after 14 games and are in the top half of the table. A victory here will almost book their slot in the play-offs. Head-to-head: U.P. Yoddhas 5 vs Jaipur Pink Panthers 3 (8) Telugu Titans will face U Mumba in the second match of the day and look for their second win of the season as they have lost 14 throughout the tournament. The team has struggled in attack as Siddharth Desai has failed to receive any support from his teammates. U Mumba, on the contrary, are in a much better position with eight wins. None of their raiders have crossed the 100-point mark but they have shown the importance of teamwork. Head-to-head: Telugu Titans 4 vs U Mumba 9 (15) The last match will see defending champions Dabang Delhi face Patna Pirates. Delhi are however lagging behind in their title defense and will have to start winning matches to qualify for the playoffs. Read all the Latest News , Trending News , Cricket News , Bollywood News , India News and Entertainment News here. Follow us on Facebook , Twitter and Instagram . Updated Date: November 19, 2022 20:22:18 IST TAGS: Kabaddi Pkl Season 9 Pro Kabaddi League 2022","pubDate":"2022-11-19 14:09:34","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/11/PKL-Live-Blog.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Pasha XI emerge champions of TCA Nizamabad T20 league","link":"https://telanganatoday.com/pasha-xi-emerge-champions-of-tca-nizamabad-t20-league","keywords":["News","Sport","Nizamabad","Shailaja Grounds","TCA Nizamabad T20 League"],"creator":["Telangana Today"],"video_url":null,"description":"Pasha XI crowned champions defeating ABCC by five wickets in the final of TCA Nizamabad T20 league","content":"Home | News | Pasha Xi Emerge Champions Of Tca Nizamabad T20 League Pasha XI emerge champions of TCA Nizamabad T20 league By Telangana Today Published: Published Date - 07:15 PM, Sat - 19 November 22 (Pasha XI team members receiving the winners trophy) Pasha XI crowned champions defeating ABCC by five wickets in the final of TCA Nizamabad T20 league Hyderabad: Pasha XI crowned champions defeating ABCC by five wickets in the final of the Telangana Cricket Association (TCA) Nizamabad District Seniors T20 League held at the Shailaja Grounds, Nizamabad on Saturday. Batting first, Musaib hit 42 runs as ABCC posted 123/9 in 20 overs. For Pasha XI Deepak snared three wickets for 28. In reply, Rayees scored 44 to guide his side to home. Also Read Vikram stars for Super Kings at TCA Nizamabad T20 league Brief Scores: ABCC 123/9 in 20 Overs (Abdul Wasey 25, Musaib 42; Deepak 3/28) lost to Pasha XI 125/5 in 17.3 Overs (Upendra 27, Rayees 44); Awards: Man of the Match: Rayees (Pasha XI); Best Batsman & Man of the Series: Vikram Jadhav (SKS Super Kings CC); Best Bowler: Abdul Avez (Bodhan Badsha XI); Best Fielder: Arjun M (TCA Pasha XI). Follow Us : Tags Nizamabad Shailaja Grounds TCA Nizamabad T20 League Related News MLC Kavitha threatens to teach a lesson to MP Arvind over his remarks Grama sabhas from November 21 to identify podu lands in Nizamabad Vikram stars for Super Kings at TCA Nizamabad T20 league Telangana: Teachers asked to improve learning abilities of students Train police personnel in Papillon device usage: Nizamabad CP tells officials Nizamabad CP launches SBI’s new regional business office","pubDate":"2022-11-19 13:45:02","image_url":null,"source_id":"telanganatoday","country":["india"],"category":["sports"],"language":"english"},{"title":"England suffer stunning collapse as Starc and Zampa rip through | Australia v England 2022-23 - cricket.com.au","link":"https://news.google.com/__i/rss/rd/articles/CBMiK2h0dHBzOi8vd3d3LnlvdXR1YmUuY29tL3dhdGNoP3Y9RFpQVXVxOThPZGfSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"England suffer stunning collapse as Starc and Zampa rip through | Australia v England 2022-23  cricket.com.auRecent Match Report - Australia vs England 2nd ODI 2022/23  ESPNcricinfoWatch: Mitchell Starc Cleans Up Dawid Malan With A Peach Of A Delivery In Australia vs England 2nd O..  NDTV SportsAustralia beats England by 72 runs to clinch ODI series  SportstarMic'd Up | Alex Carey keeps the wicket against England  Fox CricketView Full coverage on Google News","content":null,"pubDate":"2022-11-19 13:45:00","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"England’s World Cup hangover worsens as they lose series to Australia with 72-run defeat in second ODI in Sydney","link":"https://www.thescottishsun.co.uk/sport/9788741/england-australia-odi-result/","keywords":["Sport","Cricket"],"creator":["John Etheridge"],"video_url":null,"description":null,"content":"ENGLAND slumped to another defeat as their World Cup hangover continued with a 50-over series defeat against Australia. Hampshire’s James Vince and Kent’s Sam Billings gave England hope of overhauling the Aussies’ total of 280-8 in Sydney. 4 David Willey showed his frustrations after being dismissed in the defeat Credit: AFP 4 Adam Zampa was a thorn in the side of Matthew Motts' troops Credit: EPA 4 Australia celebrate their victory over a lacklustre England Credit: GETTY The pair put on 122 for the fourth wicket after a terrible start by England that included losing both Jason Roy and Dawid Malan to Mitchell Starc in the opening over of the reply. But, once Vince was lbw to stand-in Aussie skipper Josh Hazlewood for 60, England’s innings fell apart and they lost their last seven wickets for just 52 runs. Billings made 71 but England’s next-highest score was 23 by opener Phil Salt. Billings said: “Those early wickets really pegged us back and we had to rebuild. \"The pitch was quite tricky – a bit two-paced – and Australia’s score was probably above par. “It was a real shame Vincey and I couldn't go on for at least another ten overs. \"I’ve had to be patient and I didn’t have many opportunities with the white ball for England last summer. I think I’ve averaged over 50 in the last three years in ODI cricket. “More than half the group have been here for a long time – they must try to muster energy for the last game. Most read in Cricket SHANE SHOCK Shane Warne fan climbs in ambulance with body as cops probe ‘security breach’ TWEET ROW England women star Hartley leaves Root's team furious with joke about India loss RIP MAESTRO Legendary Pakistan cricketer Qadir dead at 63 after cardiac arrest 'She will be missed' Ex-England women's cricket captain and Wolves vice-president Rachael Heyhoe-Flint dies aged 77 PLAY OUR DREAM TEAM WORLD CUP FANTASY FOOTBALL GAME TO WIN A SHARE OF £50k \"For the five of us who came into the squad a week ago, it’s a huge opportunity to stake a claim and be the energy for the rest.” After a loss to India and draw with South Africa at home in the summer, England have now failed to win three consecutive one-day series for the first time since 2015. They have won the Twenty20 World Cup, of course, and it appears they are still struggling to lift themselves after that triumph. The third and now dead-rubber match is in Melbourne on Tuesday. Captain Jos Buttler rested himself with Moeen Ali captaining England for the first time in a one-dayer. 4 Steve Smith racked up a half-century for Australia Credit: EPA Chris Woakes, Adil Rashid and Sam Curran also returned as England made four changes from the team that lost the first match in Adelaide on Thursday. The Aussies also had a change of captain with Pat Cummins having a breather and Hazlewood taking charge. It shows that neither side is approaching this team with 100 per cent determination to win at all costs. Australia’s innings featured half-centuries for Steve Smith – who was caught on the boundary for 94 attempting to reach his hundred with a six – along with Marnus Labuschagne and Mitch Marsh. Rashid took three wickets while Woakes and David Willey had two apiece. Read More on The Sun 's***show' Fans all say same thing about awful World Cup fan zone food including £9 salad ATTENTION GRABBER I’m a teacher – I go from a 5 to a 10 when I strip off my work outfit In reply, Roy’s shocking form continued when he was caught down the legside for a duck and Malan, who made a century in the first match, also perished without scoring courtesy of a swinging ripper from Starc. Salt backed away, aimed a horrible hack and was bowled. Vince and Billings repaired the damage but, once they departed, the end came quickly with 11.1 overs of England’s innings unbowled.","pubDate":"2022-11-19 12:34:49","image_url":null,"source_id":"thescottishsun","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Dhanraj Parimal Nathwani Elected Gujarat Cricket Association President","link":"https://sports.ndtv.com/cricket/dhanraj-parimal-nathwani-elected-gujarat-cricket-association-president-3535529","keywords":["Cricket"],"creator":["PTI"],"video_url":null,"description":"Dhanraj Parimal Nathwani was unanimously elected as the president of Gujarat Cricket Association (GCA) on Saturday.","content":null,"pubDate":"2022-11-19 11:46:16","image_url":"https://c.ndtvimg.com/2022-11/86sb8nmg_jay-shah-dhanraj-parimal-nathwani-twitter_120x90_19_November_22.jpg","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"India vs New Zealand 2nd T20I live streaming: How to watch IND vs NZ cricket match live?","link":"https://www.firstpost.com/firstcricket/sports-news/india-vs-new-zealand-live-cricket-streaming-2022-when-where-how-watch-t20i-ind-vs-nz-match-online-2-11658691.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"India vs New Zealand 2nd T20I live streaming: How to watch IND vs NZ cricket match live?","content":"India and New Zealand will be up against each other in the second T20I of the three-match series. The first clash between the two teams was washed away due to rain in Wellington and the sides have now moved to Mount Maunganui for the second game.India are touring New Zealand for a three-match T20I series and as many ODIs. While Hardik Pandya has been handed the captain’s baton for the T20Is, Shikhar Dhawan will lead the team in ODIs. Both India and New Zealand will look to win this second clash and take a 1-0 lead in the series.Here’s all you need to know as to when and where to watch second India vs New Zealand T20I:When will second India vs New Zealand match be played?The India vs New Zealand second T20I will be played on 20 November 2022 (Sunday).What is the venue for second India vs New Zealand match?The India vs New Zealand second T20I will be played at Bay Oval, Mount Maunganui.At what time will the second India vs New Zealand match start?The India vs New Zealand second T20I will start at 12 pm IST, with the toss at 11.30 am IST.Where can we watch second India vs New Zealand match?The India vs New Zealand second T20I will be streamed on Amazon Prime Video. It can also be viewed on DD Sports channel. You can also browse Firstpost.com for LIVE scores and updates.How to get Amazon Prime Video subscription?One can sign up for Amazon Prime Video subscription by paying a certain membership fee. Create an account on Amazon and then avail a Prime subscription to be able to watch the India-New Zealand series.Squads:India: Shubman Gill, Ishan Kishan, Sanju Samson, Suryakumar Yadav, Hardik Pandya, Rishabh Pant, Deepak Hooda, Bhuvneshwar Kumar, Yuzvendra Chahal, Arshdeep Singh, Umran Malik, Washington Sundar, Mohammed Siraj, Shreyas Iyer, Kuldeep Yadav, Harshal PatelNew Zealand: Finn Allen, Devon Conway, Kane Williamson, Glenn Phillips, Daryl Mitchell, James Neesham, Mitchell Santner, Tim Southee, Adam Milne, Lockie Ferguson, Blair Tickner, Michael Bracewell, Ish SodhiRead all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-11-19 11:41:29","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/11/India-vs-New-Zealand-2nd-T20I-1.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Hazlewood proves captaincy chops on debut","link":"https://wwos.nine.com.au/cricket/australia-vs-england-2nd-odi-josh-hazlewood-successful-captaincy-debut-in-win/a7e9a714-b988-49c6-bc9b-1cb61690e039","keywords":null,"creator":["wwos"],"video_url":null,"description":"J﻿osh Hazlewood showed he has what it takes to be a regular captain, making a series of crucial bowling changes at the perfect time.","content":"Josh Hazlewood has proved his captaincy chops in his first match leading Australia, with a series of crucial bowling changes resulting in a win in the second ODI.Australia set England an imposing target of 280 after batting first at the SCG, courtesy of a brilliant 94 from Steve Smith, and looked on course for a huge win when Mitchell Starc (4-47 off eight overs) removed both Jason Roy and Dawid Malan in the first over.However, England was buoyed by a wonderful 122-run stand between James Vince (60) and Sam Billings (71) that had the tourists briefly daring to dream of an improbable victory. AS IT HAPPENED: Zampa, Starc help Australia to series win﻿READ MORE: The season that nearly broke four-time F1 champ﻿﻿READ MORE: 'Disgraceful' Beckham's icon status 'shredded'On a wicket that had proved tricky to bat on for batters from both sides, Vince and Billings were motoring along when Hazlewood decided to bring himself on in the 28th over. The decision proved to be crucial, with Australia's stand-in skipper removing Vince in his first over back into the attack. If Vince's wicket got Australia's foot in the door, Adam Zampa (4-45 off nine) wrenched it wide open, effectively sealing the win by taking three wickets in the space of nine deliveries to gut England's middle order.Speaking after the match, Hazlewood explained how he'd been so preoccupied with the duties of captaining that he'd almost forgotten to bring himself into the attack.\"﻿I was looking around and thinking who's next to bowl and then I thought I'd better have a go,\" he said.\"It's good fun having the captaincy. I'll obviously hand it over to Pat again for the last game, but yeah, I thoroughly enjoyed it and the boys certainly helped me out from time to time.\"After Vince and Billings' stand had seen England reach 3-156 at one stage, it lost its last seven wickets for just 52 runs to be all out for 208.﻿Starc returned to the attack to clean up the tail following Hazlewood and Zampa's spree of wickets, and was named the Player of the Match for his efforts.The 72-run win gives Australia an unassailable 2-0 lead in the three-match series, with the series finale to be played at the Melbourne Cricket Ground on Tueday.For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here!","pubDate":"2022-11-19 11:37:53","image_url":"https://vms-network-images-prod.s3-ap-southeast-2.amazonaws.com/2022/11/467568/pickerimage.jpg","source_id":"nine","country":["australia"],"category":["sports"],"language":"english"},{"title":"India vs New Zealand: Men in Blue receive traditional welcome at Mt. Maunganui ahead of second T20I","link":"https://www.firstpost.com/firstcricket/sports-news/india-vs-new-zealand-men-in-blue-receive-traditional-welcome-at-mt-maunganui-ahead-of-second-t20i-11658821.html","keywords":["First Cricket News"],"creator":["FP Trending"],"video_url":null,"description":"India vs New Zealand: Men in Blue receive traditional welcome at Mt. Maunganui ahead of second T20I","content":"Cricket India vs New Zealand: Men in Blue receive traditional welcome at Mt. Maunganui ahead of second T20I Captain of the side Hardik Pandya also marked his presence in some of the traditional activities FP Trending November 19th, 2022 16:51:02 IST India received a traditional Maori welcome upon arrival for the second T20I. Image: BCCI/Twitter After the first T20I of their New Zealand tour was abandoned due to rain, Indian team arrived for the second contest at the Bay Oval on Sunday. Following their visit to Mount Maunganui, the cricketers received a warm traditional welcome from the Maori community. The community staged a traditional ceremony to greet the entire Indian team and support staff. Through a variety of events, Maori individuals showcased their rich culture. The Hardik Pandya-led team seemingly enjoyed the activity. Board of Control for Cricket in India (BCCI) posted pictures from the beautiful ceremony. 📸 📸 Snapshots from #TeamIndia ‘s traditional welcome at Mt. Maunganui Image Courtesy: Jamie Troughton/Dscribe Media #NZvIND pic.twitter.com/K4yUiScPO7 — BCCI (@BCCI) November 19, 2022 The Maori are the native inhabitants of New Zealand, who migrated to the country in huge numbers of canoes between 1250 and 1300. Speeches, dancing and singing are typical elements of a Maori greeting ceremony or powhiri. During the ceremony, India’s interim head coach VVS Laxman accompanied the players and enjoyed the rituals with them. Some Maori people showed off their sword skills in front of the squad. In the pictures, Indian bowlers like Harshal Patel, Mohammed Siraj and Yuzvendra Chahal can be spotted watching the event from the front row. Captain Pandya also marked his presence in some of the activities. The caption of BCCI’s post reads, “Snapshots from Team India’s traditional welcome at Mt. Maunganui.” Fans applauded the efforts of the New Zealand cricket board for organising such an exciting event. A user appreciated, “Great welcome, Black Caps.” Great Wellcome @BLACKCAPS ❤️🇮🇳🙏 — 🦏 Gøûrâv Soni/ गौरव सोनी (@Gouravs15193715) November 19, 2022 Another person noted, “Hardik and his army.” HARDIK AND HIS ARMY!!!! — Rohirat (@CRohitkrishna) November 19, 2022 A fan wished, “All the best, Hardik.” All the best hardik.. — Hans Suryawanshi (@SuryawanshiHans) November 19, 2022 However, this is not the first time that the Maori community has welcomed the Men in Blue. Back in 2019, the Virat Kohli-led ODI side received the same kind of treatment when they came to Mount Maunganui to play the second ODI of the five-match series. Read all the Latest News , Trending News , Cricket News , Bollywood News , India News and Entertainment News here. Follow us on Facebook , Twitter and Instagram . Updated Date: November 19, 2022 16:51:02 IST Tags: Cricket India Tour Of New Zealand New Zealand Vs India Find latest and upcoming tech gadgets online on Tech2 Gadgets. Get technology news, gadgets reviews & ratings. Popular gadgets including laptop, tablet and mobile specifications, features, prices, comparison.","pubDate":"2022-11-19 11:21:02","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/11/India-Maori-640.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"OMN vs BAH Dream11 Prediction: Fantasy Cricket Tips, Today's Playing XIs, Player Stats, Pitch Report Oman Desert Quadrangle T20, Match 10","link":"https://www.sportskeeda.com/fantasy-cricket-mantra/omn-vs-bah-dream11-prediction-fantasy-cricket-tips-today-s-playing-xis-player-stats-pitch-report-oman-desert-quadrangle-t20-match-10?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Fantasy Cricket Mantra"],"creator":["Adarsh Tabhane"],"video_url":null,"description":null,"content":null,"pubDate":"2022-11-19 11:18:12","image_url":"https://static.sportskeeda.com/editor/2022/11/1678f-16688374833536-1920.jpg","source_id":"sportskeeda","country":["india"],"category":["sports"],"language":"english"},{"title":"Australia win series after 72-run defeat of England: second ODI – as it happened - The Guardian","link":"https://news.google.com/__i/rss/rd/articles/CBMimwFodHRwczovL3d3dy50aGVndWFyZGlhbi5jb20vc3BvcnQvbGl2ZS8yMDIyL25vdi8xOS9hdXN0cmFsaWEtdnMtZW5nbGFuZC1saXZlLXVwZGF0ZXMtc2NvcmUtc2Vjb25kLW9uZS1kYXktaW50ZXJuYXRpb25hbC1jcmlja2V0LW9kaS1sYXRlc3Qtc2NvcmVzLWF1cy12LWVuZ9IBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Australia win series after 72-run defeat of England: second ODI – as it happened  The GuardianAustralia vs England live: Second one-dayer, scores, updates, video, cricket news, Steve Smith, David Warner | news.com.au — Australia's leading news site  news.com.auAustralia defeats England at SCG to claim ODI series victory  ABC NewsAustralia vs England LIVE: Adam Zampa, Mitchell Starc ruin tourists' run chase to seal series win  Wide World of SportsPoms ‘implode’ in ODI demolition as Zampa, Starc nail four-wicket stunners  Fox SportsView Full coverage on Google News","content":null,"pubDate":"2022-11-19 11:12:25","image_url":null,"source_id":"google","country":["australia"],"category":["sports"],"language":"english"},{"title":"England Implode To Hand Second ODI And Series To Australia","link":"https://sports.ndtv.com/cricket/england-implode-to-hand-second-odi-and-series-to-australia-3535440","keywords":["Cricket"],"creator":["AFP"],"video_url":null,"description":"Australia wrapped up the three-match one-day international series with a comprehensive 72-run win over England at the Sydney Cricket Ground on Saturday","content":null,"pubDate":"2022-11-19 11:08:39","image_url":"https://c.ndtvimg.com/2022-11/lknmj9vo_mitchell-starc-australia-afp_625x300_19_November_22.jpg?im=FaceCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"‘They could be exposed’: Aussie cricket great calls out ‘interesting’ dugout sight - Fox Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMiqwFodHRwczovL3d3dy5mb3hzcG9ydHMuY29tLmF1L2NyaWNrZXQvYXVzdHJhbGlhL3RoZXktY291bGQtYmUtZXhwb3NlZC1hdXNzaWUtY3JpY2tldC1ncmVhdC1jYWxscy1vdXQtaW50ZXJlc3Rpbmctc2lnaHQtaW4tZHVnb3V0L25ld3Mtc3RvcnkvNmYyZTkzYmExMDAxMmIwM2ViYzBjY2IxMTg2NDEyMjbSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"‘They could be exposed’: Aussie cricket great calls out ‘interesting’ dugout sight  Fox Sports'You never know': Hughes on World Cup chances  cricket.com.auCricket legend calls out Aussie dugout sight  Daily TelegraphView Full coverage on Google News","content":null,"pubDate":"2022-11-19 09:52:00","image_url":null,"source_id":"google","country":["australia"],"category":["sports"],"language":"english"},{"title":"Manika Batra wins bronze medal at Asian Cup, creates history for India","link":"https://www.firstpost.com/sports/manika-batra-wins-bronze-medal-at-asian-cup-creates-history-for-india-11658381.html","keywords":["Sports"],"creator":["FP Sports"],"video_url":null,"description":"Manika Batra wins bronze medal at Asian Cup, creates history for India","content":"Sports Manika Batra wins bronze medal at Asian Cup, creates history for India Manika Batra defeated Hina Hayata 11-6, 6-11, 11-7, 12-10, 4-11, 11-2 to clinch the bronze medal at the Asian Cup FP Sports November 19, 2022 15:07:08 IST Manika Batra defeated Hina Hayata 11-6, 6-11, 11-7, 12-10, 4-11, 11-2. Image: YouTube screenshots Manika Batra created history on Saturday after she became the first Indian woman to win a medal at the Asian Cup. Batra defeated Hina Hayata 11-6, 6-11, 11-7, 12-10, 4-11, 11-2 to clinch the bronze medal in the competition. She had earlier lost to fourth seed Mima Ito of Japan 8-11 11-7 7-11 6-11 11-8 7-11 (2-4) in the semi-final. Despite the semis loss, the Indian paddler ensured the best finish by an Indian in the 39-year-old history of the competition. Achanta Sharath Kamal and G Sathiyan had finished sixth in 2015 and 2019 respectively. Read all the Latest News , Trending News , Cricket News , Bollywood News , India News and Entertainment News here. Follow us on Facebook , Twitter and Instagram . Updated Date: November 19, 2022 15:07:08 IST TAGS: Manika Batra","pubDate":"2022-11-19 09:37:08","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/11/Manika-Batra-Bronze-1.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"“Don’t fit the eligibility criteria”: Parthiv Patel confirms he can’t apply for Indian national cricket team selector post due to eligibility concerns","link":"https://thesportsrush.com/cricket-news-dont-fit-the-eligibility-criteria-parthiv-patel-confirms-he-cant-apply-for-indian-national-cricket-team-selector-post-due-to-eligibility-concerns/","keywords":["Cricket","BCCI","Parthiv Patel"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"After the disappointing T20 World Cup 2022, it was expected that some major changes will be done in the management as well, and BCCI sacked all the national selectors to start the process. BCCI have already started inviting applications for the same, and Parthiv Patel has confirmed that he does not fit the criteria. The… The post “Don’t fit the eligibility criteria”: Parthiv Patel confirms he can’t apply for Indian national cricket team selector post due to eligibility concerns appeared first on The SportsRush.","content":"After the disappointing T20 World Cup 2022, it was expected that some major changes will be done in the management as well, and BCCI sacked all the national selectors to start the process. BCCI have already started inviting applications for the same, and Parthiv Patel has confirmed that he does not fit the criteria. The selection committee consisted of Chetan Sharma (North Zone), Harvinder Singh (Central Zone), Sunil Joshi (South Zone) and Debasish Mohanty (East Zone). This is one of the shortest spells for any selection committee, and they have been criticized for the lack of stability on the side and for not selecting a stable team for the tournaments. The defeat in the Asia Cup and T20 World Cup, along with the rushing of Jasprit Bumrah to international cricket are seen as the main reasons behind the sacking. Interestingly, the new selectors have been assigned the role of selecting a new captain for different formats as well. Parthiv Patel confirms he can’t apply for Indian national cricket team selector post Former Indian wicket-keeper Parthiv Patel has confirmed that he will not apply for the role of national selector as he does not fit the eligibility criteria. A fan asked Parthiv to apply for the role, but he clarified that he will not be applying this time, but it will be an honour for him if he gets the opportunity in the future. “Thank you but I don’t fit the eligibility criteria for the post at the moment. It would be an honour to be offered the position in the future,” Parthiv Patel tweeted. Thank you but I don’t fit the eligibility criteria for the post at the moment. It would be an honour to be offered the position in the future. https://t.co/Tonv39wgsj — parthiv patel (@parthiv9) November 19, 2022 BCCI have already started inviting applications for the role of new national selectors, and they have set some eligibility criteria for the same that are mentioned below. 1) Should have played a minimum of 7 test matches or 30 FC Matches or 10 ODI and 20 FC Matches. 2) Should have retired from the game at least 5 years ago. 3) No person who has been a member of any cricket committee for a total of 5 years. The post “Don’t fit the eligibility criteria”: Parthiv Patel confirms he can’t apply for Indian national cricket team selector post due to eligibility concerns appeared first on The SportsRush.","pubDate":"2022-11-19 09:28:28","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Cricket Podcast: पहली बार विदेशी सरजमीं पर बिना टॉस रद्द हुआ भारत का टी-20 क्रिकेट इंटरनेशनल मैच और फिर...","link":"https://hindi.news18.com/podcast/sports-buletin/cricket-podcast-t20-world-cup-india-vs-new-zealand-bb-series-hardik-pandya-bcci-bangladesh-ipl-nodakm-4923771.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"सप्ताह भर की क्रिकेट गतिविधियों को समेटे मैं हाजिर हूँ, इस पॉडकास्‍ट मे, संजय बैनर्जी का नमस्कार- सुनो दिल से. टी 20 वर्ल्ड कप के निराशाजनक प्रदर्शन के बाद भारतीय टीम अब अगले विश्वकप की तैयारियों में जुटी है. हालांकि, इसी सिलसिले में कल न्यूजीलैंड के खिलाफ खेला जाने वाला पहला टी20 मुकाबला बारिश की भेंट चढ़ गया. इससे तीन मैचों की बीबीसीरीज और छोटी हो गई. ऐसा पहली बार हुआ जब बिना टॉस बारिश की वजह से विदेशी सरजमीं पर भारत का कोई टी-20 इंटेरनेशनल रद्द हुआ है. कप्तान हार्दिक पांड्या के लिए यह सीरीज उनके भविष्य में कप्तान बनने की संभावनाओं को पंख लगा सकती है, इसके अलावा कई युवाओं को भारतीय टीम मे आने का मौका भी दे सकती है. ऐसे में बचे हुए दोनों मैच अब बेहद अहम होने वाले हैं.","content":null,"pubDate":"2022-11-19 09:24:31","image_url":"https://images.news18.com/ibnkhabar/uploads/2022/11/Suno-dil-se-19112022.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","country":["india"],"category":["sports"],"language":"hindi"},{"title":"2nd T20I: India face Bhuvneshwar dilemma while praying for game time","link":"https://www.tribuneindia.com/news/sports/2nd-t20i-india-face-bhuvneshwar-dilemma-while-praying-for-game-time-452569","keywords":null,"creator":null,"video_url":null,"description":"Mount Maunganui, November 19Bhuvneshwar Kumar faces an arduous challenge of remaining relevant in shortest format as a young Indian team, seeking some game time, is expected to face tough resistance from New Zealand in the second T20 International here on Sunday.The series-opener in Wellington was abandoned due to inclement weather and the Indian players must be itching to get onto the park which, inarguably, has the most scenic backdrop.Ironically, the region where the ground is located is known as 'Bay of Plenty' and Indian cricket at this point has plenty to ponder as far as its approach in T20 format is concerned.While the Sky Stadium was shorter in terms of dimensions, the Indian team will have to make adjustments as the 'Bay Oval' ground has bigger side boundaries and is an open ground unlike Wellington.The Bhuvi conundrumOn this tour, the presence of a near 33 year-old Bhuvneshwar is one such dilemma that the team management might have to handle. There are some probing questions and quicker the answers are sought, better it would be for Indian cricket.Is Bhuvneshwar going to be around for the T20 World Cup in 2024 with a sharp decline in his pace? Does he have enough time to work around his issues as he is not potent enough on good batting tracks? Not many T20Is are lined-up next year and he is largely becoming a single-format player, so where does it leave him?At this moment, all the answers seem to be in negative and hence a question arises whether playing the senior-most pacer would be akin to taking away an opportunity from a youngster to get into the groove.It is a double-edged sword that interim head coach VVS Laxman and captain Pandya will be facing.Not playing Bhuvneshwar when he is on the cusp of a personal milestone (4 more wickets for highest tally of 40 in a calendar year) might leave him demoralised.Most of his 36 wickets have come in bowler-friendly conditions and against lesser opponents. On slightly flatter wickets and against better batting attacks, Bhuvneshwar has come a cropper.But playing him will be a missed opportunity for the team management to check out on how the pair of Umran Malik and Mohammed Siraj would match up against the might of players like Finn Allen, Glenn Phillips and Devon Conway in pressure situations.Umran, India's fastest bowler by a distance, needs to be groomed. Pakistan has shown with Haris Rauf, Shaheen Shah Afridi and Naseem Shah as to what extreme pace can do.Ishan or Shubman, the choice of opener?The moment Rishabh Pant was named the vice-captain of the team for the T20I series, it was a given that he would be opening but whether Shubman Gill with his new found confidence in this format or the specialist Ishan Kishan will pair up is there to be seen.In case of Kishan, who has had troubles against genuine pace and swing is preferred, then there will be two left-handers at the top while Gill's presence will make it a left-right combination.The other factor would be the choice between KKR skipper Shreyas Iyer, not exactly a fast starter in T20Is and the dynamic Deepak Hooda, who can also bowl wicket-to-wicket tight off-breaks.To accommodate both Hooda and Shreyas, Kishan will then needed to be dropped from the playing XI. Sanju Samson and skipper Pandya are the two batters along with Suryakumar Yadav, who would play the role of enforcers as well as finishers.Chahal vs Phillips match-upGlenn Phillips, one of the most exciting T20 batters in recent times, will have a battle in hand when the wily Yuzvendra Chahal gets his first game in many moons after being inexplicably benched by regular head coach Rahul Dravid throughout the T20 World Cup.But the last completed T20I match at this ground witnessed Phillips score 108 off 51 balls with as many as eight sixes against a quality West Indies attack.With Ravichandran Ashwin's T20I career all but over, Washington Sundar will be getting a long run as a specialist off-spinner while Harshal Patel will also get game time to get back his rhythm which deserted him just before the World Cup. Arshdeep Singh as a left-arm seamer looks a sure-shot starter in next two games.Squads:India: Hardik Pandya (captain), Rishabh Pant (vc and wk), Shubman Gill, Suryakumar Yadav, Sanju Samson, Shreyas Iyer, Ishan Kishan (wk), Deepak Hooda, Yuzvendra Chahal, Kuldeep Yadav, Washington Sundar, Harshal Patel, Bhuvneshwar Kumar, Umran Malik, Mohammed Siraj, Arshdeep Singh New Zealand: Kane Williamson (captain), Devon Conway, Finn Allen, Glenn Phillips, Devon Cinway, Daryl Mitchell, Adam Milne, Michael Bracewll, Ish Sodhi, Mitchell Santner, Lockie Ferguson, Tim Southee, Blair Tickner.Match Starts: 12 noon IST.","content":null,"pubDate":"2022-11-19 08:41:29","image_url":"https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/11/2022_11$largeimg_337618957.jpg","source_id":"tribuneindia","country":["india"],"category":["sports"],"language":"english"},{"title":"Cricket legend calls out Aussie dugout sight","link":"https://www.themercury.com.au/sport/cricket/they-could-be-exposed-aussie-cricket-great-calls-out-interesting-sight-in-dugout/news-story/6f29c2e084a4022fef6f54b0ef98751d","keywords":["Cricket news and galleries","Kayo","Sport news and galleries"],"creator":null,"video_url":null,"description":"Australian cricket great Ian Healy has questioned George Bailey’s influence within the team, after the chairman of selectors was spotted sitting with players in the dugout.","content":"Bailey, a former Aussie T20 captain who recently retired in 2020, was appointed the new selection chief in August 2021, taking over from Trevor Hohns’ lengthy stint.Watch Australia v England. Every ODI live and ad-break free in play on Kayo. New to Kayo? Start your free trial now >But former captain Ian Healy has questioned why someone like Bailey would be sitting among the players throughout the dismal T20 World Cup campaign and in Thursday night’s one dayer against England.“It’s very interesting,” Healy said on his SEN show.“George Bailey can throw well, he can provide an extra coach around the traps … but he’s not an extra coach is he? He’s a selector.“I think in-form players wouldn’t mind (having him next to them); I think down on form players would hate it and have to start acting.“I think injured-type players carrying niggles small or maybe a little bit larger wouldn’t be keen to have the chairman of selectors so close.“The reserves in that dug out, are they acting?“If the acting isn’t good … they could be exposed. “The current mood in that team might change … that might be creating stress with the selector so upfront and so close.”Healy said given there were controversial calls made during the T20 World Cup campaign, where Australia missed out on the finals, he wasn’t sure how players would feel with Bailey sitting beside them.“We swapped (Mitchell) Starc for (Kane) Richardson at a time when we were after wickets. We kept Steve Smith out (of the T20 World Cup),” he said.“We let out of form players stay in that team in that T20 World Cup and that’s all while the chairman of selectors was in the dug out and very, very close to the personality of the squad.“If he asks you a question (players would go), ‘All right, what have I got to tell him?’Bailey was filmed having a laugh with star duo Warner and Marnus Labuschagne during Thursday night’s game one victory over England.Fellow SEN panellist, and current Brisbane Lions captain, Dayne Zorko compared Bailey’s presence in the dug out to having his list manager on the interchange bench.“It’s very strange – especially if you’re a person on the fringe or not really getting a game,” he said on SEN.“It would be like our list manager sitting on the bench when I come off and I haven’t had a good patch. He’s just looking at me (and I say) ‘Oh I can do better!’.”The Australian cricket team is reportedly struggling with an “apparent divide” between current players and the nation’s greats.It was reported captain Pat Cummins has met with Adam Gilchrist this week to “cool any potential tensions” since ex-coach Justin Langer was pushed out the door in February.","pubDate":"2022-11-19 08:24:00","image_url":null,"source_id":"mercury","country":["australia"],"category":["sports"],"language":"english"}]}