{"newsArray":[{"article_id":"52048fe786aa89ec163de22282ebde57","title":"IND vs SA 1st Test, Day 3 Live Streaming: এলগারের শতকে এগিয়ে প্রোটিয়া, কীভাবে থামাবে রোহিতরা; সরাসরি দেখুন","link":"https://bangla.latestly.com/sports/cricket/ind-vs-sa-1st-test-day-3-live-streaming-275425.html","keywords":null,"creator":null,"video_url":null,"description":"ভারত বনাম দক্ষিণ আফ্রিকা, প্রথম টেস্ট তৃতীয় দিনের ম্যাচ শুরু হবে ভারতীয় সময় দুপুর ১ঃ৩০টায়","content":"আজ ভারত তাদের কঠিন পরীক্ষায় জয় পেতে প্রস্তুত, কিন্তু বরাবরের মতো দক্ষিণ আফ্রিকাকে হারানো সহজ হবে না। দক্ষিণ আফ্রিকায় কখনও টেস্ট সিরিজ জেতেনি টিম ইন্ডিয়া। খারাপ আলোয় দ্বিতীয় দিনে তাড়াতাড়ি স্টাম্প পড়ে যায়। দক্ষিণ আফ্রিকা ৫ উইকেটে ২৫৬ রান তুলে ভারতের থেকে ১১ রানে এগিয়ে রয়েছে। ১৪তম টেস্ট সেঞ্চুরি করে ডিন এলগার (Dean Elgar) তার বিদায়ী সিরিজকে আরও স্মরণীয় করেন। অভিষেকে অর্ধশতক করে ডেভিড বেডিংহামের (David Bedingham) দ্বিতীয় দিনে এলগারের সঙ্গে সেঞ্চুরির জুটি গড়ে দক্ষিণ আফ্রিকাকে এগিয়ে যেতে সাহায্য করে। প্রায় ৩০ ওভার উইকেটহীন থাকার পর তাদের ১৩১ রানের পার্টনারশিপ ভাঙেন মহম্মদ সিরাজ (Mohammed Siraj)। শেষ পর্যন্ত বেডিংহামকে ফেরানোর পরের ওভারেই কাইল ভেরেইনকে (Kyle Verreynne) আউট করে টেস্ট ক্রিকেটের খাতা খোলেন প্রসিদ্ধ কৃষ্ণা। সেঞ্চুরিয়নের সুপারস্পোর্টস পার্কে গতকাল দক্ষিণ আফ্রিকার অধিনায়ক টেম্বা বাভুমা টসে জিতে বোলিং করার সিদ্ধান্ত নেন। Bad light brings an end to Day 2. South Africa reach 256/5, with a lead of 11 runs. Scorecard ▶️ | — BCCI (@BCCI) রোহিত শর্মা (অধিনায়ক), যশস্বী জয়সওয়াল, শুভমন গিল, বিরাট কোহলি, শ্রেয়স আইয়ার, কেএল রাহুল (উইকেটরক্ষক), রবিচন্দ্রন অশ্বিন, শার্দুল ঠাকুর, জসপ্রীত বুমরাহ, মহম্মদ সিরাজ, প্রসিদ্ধ কৃষ্ণা। ডিন এলগার, এডেন মার্করাম, টনি ডি জরজি, টেম্বা বাভুমা (অধিনায়ক), কিগান পিটারসেন, ডেভিড বেডিংহাম, কাইল ভেরেইন (উইকেটরক্ষক), মার্কো জানসেন, জেরাল্ড কোয়েটজি, কাগিসো রাবাডা, নান্দ্রে বার্গার। ২৮ ডিসেম্বর সেঞ্চুরিয়নের সুপারস্পোর্টস পার্কে (SuperSport Park, Centurion) প্রথম টেস্ট তৃতীয় দিনের ম্যাচে মুখোমুখি হবে ভারত বনাম দক্ষিণ আফ্রিকা। ভারত বনাম দক্ষিণ আফ্রিকা, প্রথম টেস্ট তৃতীয় দিনের ম্যাচ শুরু হবে ভারতীয় সময় দুপুর ১ঃ৩০টায়। সরাসরি টিভিতে ভারত বনাম দক্ষিণ আফ্রিকা, প্রথম টেস্ট তৃতীয় দিনের ম্যাচ ভারতে দেখবেন স্টার স্পোর্টসে নেটওয়ার্কে। সরাসরি অনলাইনে ভারত বনাম দক্ষিণ আফ্রিকা, প্রথম টেস্ট তৃতীয় দিনের ম্যাচ দেখতে পাবেন ডিজনি+ হটস্টার (Disney+ Hotstar) অ্যাপে।","pubDate":"2023-12-28 03:48:41","image_url":"https://bnst1.latestly.com/wp-content/uploads/2023/12/49-6-380x214.jpg","source_id":"latestly","source_priority":5523,"country":["india"],"category":["sports"],"language":"bengali"},{"article_id":"35f61238e895923a0d9343e24ff9f9db","title":"Channel Seven star Mel McLaughlin gets caught up in BIZARRE situation with cricket umpire that delayed play in the Boxing Day Test","link":"https://www.dailymail.co.uk/sport/cricket/article-12905811/Mel-McLaughlin-caught-lift-cricket-umpire-delayed-play-Boxing-Day-Test-MCG-Channel-Seven-Richard-Illingworth.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Cricket fans were mystified when play in the session after lunch at the MCG on Thursday was held up for several minutes - but McLaughlin soon gave a first-hand account of what went wrong.","content":"Channel Seven star Mel McLaughlin gets caught up in BIZARRE situation with cricket umpire that delayed play in the Boxing Day Test Commentator explained freakish occurrence in commentary Play was delayed after the lunch break at the MCG on Thursday News surfaced with Australia struggling badly in their second innings By Shayne Bugden For Daily Mail Australia and Shayne Hope For Australian Associated Press Published: 22:44 EST, 27 December 2023 | Updated: 22:48 EST, 27 December 2023 e-mail View comments Sports commentator Mel McLaughlin has revealed she was at the centre of a freakish incident with a cricket umpire that forced play to be delayed at the Boxing Day Test on Thursday afternoon. The Channel Seven star was catching a lift from the MCG's underground car park with third umpire Richard Illingworth when the elevator malfunctioned, trapping them and eight other people and forcing her to use her phone to call for help. Play in the session after lunch was held up as a result of the scare, with McLaughlin describing what happened inside the lift when she joined her co-commentators Justin Langer and James Brayshaw afterwards. McLaughlin (pictured left with fellow Seven star Ricky Ponting) was trapped in the lift with a very 'distracted' umpire as play had to be held up at the MCG on Thursday 'We [she and Illingworth] were having a bit of a chat ... and the doors open and then close and then didn't move again,' she said. 'He's standing in the corner and he went, 'Do you have a phone? Can you please call someone and let them know I'm in the lift, I'm going to be a little bit late?' 'So yeah, everyone got to work and we got freed, I don't know, 10 minutes later. Sorry everyone!' Brayshaw asked what the conversation was like in the lift and McLaughlin replied, 'There were 10 of us in there, so that was one thing. There was a lovely family in there, a young baby, and there was a guy eating hot chips that we were all trying to get a bit of. 'But the rest of the time, our EP [executive producer] Jonesy is on the phone, Sam, our production manager, she's also trying to help things move along quickly. Pip, the make-up artist - we're all just trying to keep things calm and keep Richard talking and being entertained because we knew he was a little bit distracted and knew he had to get out there. 'He ran quite quickly straight upstairs!' McLaughlin joined her fellow commentators, cricket legend Justin Langer (centre) and James Brayshaw (right) to explain what happened inside the lift Third umpire Richard Illingworth (pictured) 'ran quite quickly straight upstairs' once he was freed from the lift, McLaughlin said The Seven star was accompanied by her executive producer and a make-up artist from the broadcaster when the lift broke down Play had to be delayed because the third umpire - while not taking up a position on the field - sits in a broadcast booth and is responsible for making the final call on dismissals that are referred to them by the two officials on the ground. They can also serve as an on-field umpire in case of injury or illness. Cricket Australia and the MCG both produced light-hearted responses to the peculiar delay, which lasted seven minutes. 'The game is delayed because the third umpire ... is stuck in the lift,' Cricket Australia's social media arm posted on X, formerly known as Twitter. The MCG was quick to reply: 'Sorry.' The banter continued when Illingworth eventually made his way back to his seat by 1.32pm, with Cricket Australia posting: 'A wild Richard Illingworth appeared!' McLaughlin delivered the news just as Australia were struggling badly against a rampant Pakistan bowling attack that reduced them to 4-16, with fast bowler Mir Hamza on a hat-trick. Justin Langer Channel Seven Share or comment on this article: Channel Seven star Mel McLaughlin gets caught up in BIZARRE situation with cricket umpire that delayed play in the Boxing Day Test e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-12-28 03:48:10","image_url":"https://i.dailymail.co.uk/1s/2023/12/28/03/79390939-0-image-a-8_1703734737857.jpg","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"2a7019bdd07bff856b4f80ead9a692e6","title":"AUS vs PAK: Mir Hamza castles Travis Head on golden duck, Pakistan legend calls it 'genuis' stuff | WATCH","link":"https://www.indiatvnews.com/sports/cricket/aus-vs-pak-2nd-test-mir-hamza-castles-world-cup-star-travis-head-pakistan-legend-calls-it-genuis-stuff-watch-melbourne-cricket-ground-2023-12-28-909241","keywords":null,"creator":null,"video_url":null,"description":"AUS vs PAK: Pakistan are giving Australia a great fight in the Boxing Day Test as their pacers have wreaked havoc against the much-celebrated batting line-up in Melbourne. After wrapping Shan Masood's side for 264, the Aussies took a 54-run lead but the Pakistan pace-battery helped their team storm back into the match.","content":"Pakistan are giving Australia a great fight in the Boxing Day Test as their pacers have wreaked havoc against the much-celebrated batting line-up in Melbourne. After wrapping Shan Masood's side for 264, the Aussies took a 54-run lead but the Pakistan pace-battery helped their team storm back into the match. Well led by Shaheen Afridi and Mir Hamza, the visitors put the hosts in deep trouble with quick wickets in the second innings. Hamza accounted for two of the first four wickets, which included a 'genius' stuff. Playing only his 4th Test, the 31-year-old Hamza cleaned the World Cup star Travis Head with a sensational delivery. The left-arm pacer outfoxed Head with a delivery that came inside massively to the Southpaw, sending the fans crazy. The Aussies were at 16/2 in the second session of the day when Hamza first got rid of David Warner with a back-of-a-length ball and then produced a jaffa on the very next one. Coming from over the wicket, Hamza used both swing and seam perfectly. He swung the ball inside which pitched fuller just outside off and then it seamed in too. Head looked naive on his first delivery as he was beaten all ended up with the ball hitting the middle stumps. Hamza also had the chance to grab a hat trick but missed it as Mitchell Marsh did not fall for his harmless outside-of-off-stump delivery. Commentators on air defined the moment as a genius stuff. Pakistan's bowling legend Wasim Akram was also present in the commentary panel and he agreed that this was a genius piece of bowling. Wasim Akram described that Head was expecting an outswing but the ball swung back into him. \"Travis Head was expecting the outswing but like you said it was a genius move by Mir Hamza. Look at the roll of the wrists and the ball swung back into him and middle-stump gone,\" Akram said on air Hamza and Shaheen took the initial four wickets to put the hosts in massive trouble in their second reply. After Head's wicket, Australia were sent four down for just 16 and had a lead of 70. Shaheen and Hamza picked two wickets apiece. Shaheen jolted the WTC champions early with the wickets of and Marnus Labuschagne just before lunch before the Hamza show.","pubDate":"2023-12-28 03:27:44","image_url":"https://resize.indiatvnews.com/en/resize/newbucket/715_-/2023/12/rohit-kohli-20-1703733845.jpg","source_id":"indiatvnews","source_priority":10055,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"1e57d0e98fb434b8f4785620e6c4010b","title":"KL Rahul: ਕੇਐਲ ਰਾਹੁਲ ਟ੍ਰੋਲਿੰਗ ਤੋਂ ਹੁੰਦੇ ਵੱਧ ਪਰੇਸ਼ਾਨ, ਸੈਂਚੁਰੀਅਨ ਵਿੱਚ ਸੈਂਕੜਾ ਲਗਾਉਣ ਵਾਲੇ ਕ੍ਰਿਕਟਰ ਨੇ ਕੀਤਾ ਵੱਡਾ ਖੁਲਾਸਾ","link":"https://punjabi.abplive.com/sports/cricket/ind-vs-sa-1st-test-at-centurion-kl-rahul-was-upset-with-social-media-trolls-767580","keywords":["ਕ੍ਰਿਕਟ"],"creator":["ABP Sanjha"],"video_url":null,"description":"<p><strong>IND vs SA 1st Test:</strong> ਦੱਖਣੀ ਅਫਰੀਕਾ ਦੇ ਸੈਂਚੁਰੀਅਨ 'ਚ ਲਗਾਤਾਰ ਦੂਜਾ ਸੈਂਕੜਾ ਲਗਾਉਣ ਵਾਲੇ <a title=\"ਟੀਮ ਇੰਡੀਆ\" href=\"https://punjabi.abplive.com/topic/indian-cricket-team\" data-type=\"interlinkingkeywords\">ਟੀਮ ਇੰਡੀਆ</a> ਦੇ ਸਟਾਰ ਬੱਲੇਬਾਜ਼ ਕੇਐੱਲ ਰਾਹੁਲ ਨੇ ਸੋਸ਼ਲ ਮੀਡੀਆ 'ਤੇ ਟ੍ਰੋਲਸ ਨਾਲ ਨਜਿੱਠਣ ਦੇ ਆਪਣੇ ਤਰੀਕੇ ਬਾਰੇ ਖੁੱਲ੍ਹ ਕੇ ਗੱਲ ਕੀਤੀ। ਉਸ ਨੇ ਜ਼ੋਰ ਦੇ ਕੇ ਕਿਹਾ ਕਿ ਕਿਸੇ ਹੋਰ ਖਿਡਾਰੀ ਵਾਂਗ ਵਹਬ ਵੀ ਨਕਾਰਾਤਮਕ ਟਿੱਪਣੀਆਂ ਤੋਂ ਪ੍ਰਭਾਵਿਤ ਹੁੰਦਾ ਹੈ।</p> <p>ਰਾਹੁਲ ਨੇ ਕਿਹਾ ਕਿ ਇਸ ਸਾਲ ਦੀ ਸ਼ੁਰੂਆਤ 'ਚ ਸੱਟ ਨੇ ਉਸ ਨੂੰ ਆਪਣੇ 'ਦਿਮਾਗ' 'ਤੇ ਕੰਮ ਕਰਨ ਦਾ ਸਮਾਂ ਦਿੱਤਾ ਅਤੇ ਉਸ ਨੇ ਮਹਿਸੂਸ ਕੀਤਾ ਕਿ ਬੱਲੇ ਨੂੰ ਗੱਲ ਕਰਨ ਦੇਣਾ ਸੋਸ਼ਲ ਮੀਡੀਆ 'ਤੇ ਨਕਾਰਾਤਮਕਤਾ ਨੂੰ ਦੂਰ ਕਰਨ ਦਾ ਵਧੀਆ ਤਰੀਕਾ ਹੈ।</p> <p><strong>ਸਾਲ ਦੀ ਸ਼ੁਰੂਆਤ 'ਚ ਬਾਹਰ ਹੋ ਗਏ ਸੀ</strong></p> <p>ਸੈਂਚੁਰੀਅਨ ਵਿੱਚ ਦੱਖਣੀ ਅਫਰੀਕਾ ਅਤੇ ਭਾਰਤ ਵਿਚਾਲੇ ਬਾਕਸਿੰਗ ਡੇ ਟੈਸਟ ਦੇ ਦੂਜੇ ਦਿਨ ਸ਼ਾਨਦਾਰ ਸੈਂਕੜਾ ਲਗਾਉਣ ਤੋਂ ਬਾਅਦ ਇਹ ਖੁਲਾਸਾ ਕੀਤਾ ਹੈ। ਕੇਐੱਲ ਰਾਹੁਲ ਇਸ ਸਾਲ ਦੀ ਸ਼ੁਰੂਆਤ 'ਚ ਆਸਟ੍ਰੇਲੀਆ ਖਿਲਾਫ ਬਾਰਡਰ-ਗਾਵਸਕਰ ਟਰਾਫੀ ਦੌਰਾਨ ਅੱਧ ਵਿਚਾਲੇ ਹੀ ਆਊਟ ਹੋ ਗਏ ਸਨ। ਇਸ ਤੋਂ ਬਾਅਦ ਕੇਐੱਲ ਰਾਹੁਲ ਨੇ ਹੁਣ ਟੈਸਟ ਫਾਰਮੈਟ 'ਚ ਵਾਪਸੀ ਕੀਤੀ ਹੈ ਅਤੇ ਤੁਰੰਤ ਹੀ ਸ਼ਾਨਦਾਰ ਸੈਂਕੜਾ ਲਗਾਇਆ ਹੈ।</p> <p>ਤੁਹਾਨੂੰ ਦੱਸ ਦੇਈਏ ਕਿ ਕੇਐਲ ਰਾਹੁਲ ਵੀ ਆਈਪੀਐਲ ਦੌਰਾਨ ਜ਼ਖਮੀ ਹੋ ਗਏ ਸਨ ਅਤੇ ਫਿਰ ਕਈ ਮਹੀਨਿਆਂ ਤੱਕ ਕ੍ਰਿਕਟ ਨਹੀਂ ਖੇਡ ਸਕੇ ਸਨ। ਇਸ ਕਾਰਨ ਉਹ ਵਿਸ਼ਵ ਟੈਸਟ ਚੈਂਪੀਅਨਸ਼ਿਪ ਟੀਮ ਦਾ ਹਿੱਸਾ ਵੀ ਨਹੀਂ ਸੀ। ਹਾਲਾਂਕਿ, ਉਸ ਨੇ ਏਸ਼ੀਆ ਕੱਪ ਤੋਂ ਵਾਪਸੀ ਕੀਤੀ ਅਤੇ ਸ਼ਾਨਦਾਰ ਬੱਲੇਬਾਜ਼ੀ ਕਰਕੇ ਦਿਖਾਇਆ ਕਿ ਉਸ ਨੇ ਇਸ ਸਾਲ ਆਪਣੀ ਸੱਟ ਤੋਂ ਉਭਰਦੇ ਹੋਏ ਆਪਣੇ ਗੇਮਿੰਗ ਹੁਨਰ 'ਤੇ ਕਾਫੀ ਕੰਮ ਕੀਤਾ ਹੈ।</p> <p><strong>ਏਸ਼ੀਆ ਕੱਪ ਤੋਂ ਸ਼ਾਨਦਾਰ ਵਾਪਸੀ</strong></p> <p>ਕੇਐੱਲ ਰਾਹੁਲ ਨੇ <a title=\"ਏਸ਼ੀਆ ਕੱਪ\" href=\"https://punjabi.abplive.com/topic/asia-cup\" data-type=\"interlinkingkeywords\">ਏਸ਼ੀਆ ਕੱਪ</a> 'ਚ ਕਈ ਸ਼ਾਨਦਾਰ ਪਾਰੀਆਂ ਖੇਡੀਆਂ ਅਤੇ ਇਸ ਤੋਂ ਬਾਅਦ ਵਿਸ਼ਵ ਕੱਪ 'ਚ ਵੀ ਉਨ੍ਹਾਂ ਨੇ ਨਾ ਸਿਰਫ ਨੰਬਰ-5 ਦੀ ਭੂਮਿਕਾ ਨੂੰ ਬਹੁਤ ਵਧੀਆ ਤਰੀਕੇ ਨਾਲ ਨਿਭਾਇਆ ਸਗੋਂ ਵਿਕਟਕੀਪਿੰਗ ਨਾਲ ਵੀ ਕਮਾਲ ਕਰ ਦਿੱਤਾ। ਕੇਐਲ ਰਾਹੁਲ ਵੀ ਕਪਤਾਨ ਨੂੰ ਡੀਆਰਐਸ ਲੈਣ ਲਈ ਬਿਲਕੁਲ ਸਹੀ ਸਲਾਹ ਦਿੰਦੇ ਹਨ।</p> <p>ਉਂਝ, ਜੇਕਰ ਸੈਂਚੁਰੀਅਨ ਵਿੱਚ ਚੱਲ ਰਹੇ ਟੈਸਟ ਮੈਚ ਦੀ ਗੱਲ ਕਰੀਏ ਤਾਂ ਭਾਰਤ ਨੇ ਕੇਐਲ ਰਾਹੁਲ ਦੇ ਸੈਂਕੜੇ ਦੀ ਮਦਦ ਨਾਲ ਪਹਿਲੀ ਪਾਰੀ ਵਿੱਚ ਕੁੱਲ 245 ਦੌੜਾਂ ਬਣਾਈਆਂ ਸਨ, ਪਰ ਦੂਜੇ ਦਿਨ ਦੀ ਖੇਡ ਖਤਮ ਹੋਣ ਤੱਕ ਦੱਖਣੀ ਅਫਰੀਕਾ ਨੇ 256 ਦੌੜਾਂ ਬਣਾ ਲਈਆਂ ਸਨ। ਨੇ 5 ਵਿਕਟਾਂ ਗੁਆ ਦਿੱਤੀਆਂ ਸਨ। ਹਰ ਵਾਰ ਦੀ ਤਰ੍ਹਾਂ ਇਸ ਵਾਰ ਵੀ ਦੱਖਣੀ ਅਫਰੀਕਾ ਦੇ ਡੀਨ ਐਲਗਰ ਇਕ ਵਾਰ ਫਿਰ ਚੱਟਾਨ ਵਾਂਗ ਕ੍ਰੀਜ਼ 'ਤੇ ਡਟੇ ਹੋਏ ਹਨ ਅਤੇ 140 ਦੌੜਾਂ ਬਣਾ ਕੇ ਅਜੇਤੂ ਹਨ।</p>","content":"IND vs SA 1st Test: ਦੱਖਣੀ ਅਫਰੀਕਾ ਦੇ ਸੈਂਚੁਰੀਅਨ 'ਚ ਲਗਾਤਾਰ ਦੂਜਾ ਸੈਂਕੜਾ ਲਗਾਉਣ ਵਾਲੇ ਟੀਮ ਇੰਡੀਆ ਦੇ ਸਟਾਰ ਬੱਲੇਬਾਜ਼ ਕੇਐੱਲ ਰਾਹੁਲ ਨੇ ਸੋਸ਼ਲ ਮੀਡੀਆ 'ਤੇ ਟ੍ਰੋਲਸ ਨਾਲ ਨਜਿੱਠਣ ਦੇ ਆਪਣੇ ਤਰੀਕੇ ਬਾਰੇ ਖੁੱਲ੍ਹ ਕੇ ਗੱਲ ਕੀਤੀ। ਉਸ ਨੇ ਜ਼ੋਰ ਦੇ ਕੇ ਕਿਹਾ ਕਿ ਕਿਸੇ ਹੋਰ ਖਿਡਾਰੀ ਵਾਂਗ ਵਹਬ ਵੀ ਨਕਾਰਾਤਮਕ ਟਿੱਪਣੀਆਂ ਤੋਂ ਪ੍ਰਭਾਵਿਤ ਹੁੰਦਾ ਹੈ। ਰਾਹੁਲ ਨੇ ਕਿਹਾ ਕਿ ਇਸ ਸਾਲ ਦੀ ਸ਼ੁਰੂਆਤ 'ਚ ਸੱਟ ਨੇ ਉਸ ਨੂੰ ਆਪਣੇ 'ਦਿਮਾਗ' 'ਤੇ ਕੰਮ ਕਰਨ ਦਾ ਸਮਾਂ ਦਿੱਤਾ ਅਤੇ ਉਸ ਨੇ ਮਹਿਸੂਸ ਕੀਤਾ ਕਿ ਬੱਲੇ ਨੂੰ ਗੱਲ ਕਰਨ ਦੇਣਾ ਸੋਸ਼ਲ ਮੀਡੀਆ 'ਤੇ ਨਕਾਰਾਤਮਕਤਾ ਨੂੰ ਦੂਰ ਕਰਨ ਦਾ ਵਧੀਆ ਤਰੀਕਾ ਹੈ। ਸਾਲ ਦੀ ਸ਼ੁਰੂਆਤ 'ਚ ਬਾਹਰ ਹੋ ਗਏ ਸੀ ਸੈਂਚੁਰੀਅਨ ਵਿੱਚ ਦੱਖਣੀ ਅਫਰੀਕਾ ਅਤੇ ਭਾਰਤ ਵਿਚਾਲੇ ਬਾਕਸਿੰਗ ਡੇ ਟੈਸਟ ਦੇ ਦੂਜੇ ਦਿਨ ਸ਼ਾਨਦਾਰ ਸੈਂਕੜਾ ਲਗਾਉਣ ਤੋਂ ਬਾਅਦ ਇਹ ਖੁਲਾਸਾ ਕੀਤਾ ਹੈ। ਕੇਐੱਲ ਰਾਹੁਲ ਇਸ ਸਾਲ ਦੀ ਸ਼ੁਰੂਆਤ 'ਚ ਆਸਟ੍ਰੇਲੀਆ ਖਿਲਾਫ ਬਾਰਡਰ-ਗਾਵਸਕਰ ਟਰਾਫੀ ਦੌਰਾਨ ਅੱਧ ਵਿਚਾਲੇ ਹੀ ਆਊਟ ਹੋ ਗਏ ਸਨ। ਇਸ ਤੋਂ ਬਾਅਦ ਕੇਐੱਲ ਰਾਹੁਲ ਨੇ ਹੁਣ ਟੈਸਟ ਫਾਰਮੈਟ 'ਚ ਵਾਪਸੀ ਕੀਤੀ ਹੈ ਅਤੇ ਤੁਰੰਤ ਹੀ ਸ਼ਾਨਦਾਰ ਸੈਂਕੜਾ ਲਗਾਇਆ ਹੈ। googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); ਤੁਹਾਨੂੰ ਦੱਸ ਦੇਈਏ ਕਿ ਕੇਐਲ ਰਾਹੁਲ ਵੀ ਆਈਪੀਐਲ ਦੌਰਾਨ ਜ਼ਖਮੀ ਹੋ ਗਏ ਸਨ ਅਤੇ ਫਿਰ ਕਈ ਮਹੀਨਿਆਂ ਤੱਕ ਕ੍ਰਿਕਟ ਨਹੀਂ ਖੇਡ ਸਕੇ ਸਨ। ਇਸ ਕਾਰਨ ਉਹ ਵਿਸ਼ਵ ਟੈਸਟ ਚੈਂਪੀਅਨਸ਼ਿਪ ਟੀਮ ਦਾ ਹਿੱਸਾ ਵੀ ਨਹੀਂ ਸੀ। ਹਾਲਾਂਕਿ, ਉਸ ਨੇ ਏਸ਼ੀਆ ਕੱਪ ਤੋਂ ਵਾਪਸੀ ਕੀਤੀ ਅਤੇ ਸ਼ਾਨਦਾਰ ਬੱਲੇਬਾਜ਼ੀ ਕਰਕੇ ਦਿਖਾਇਆ ਕਿ ਉਸ ਨੇ ਇਸ ਸਾਲ ਆਪਣੀ ਸੱਟ ਤੋਂ ਉਭਰਦੇ ਹੋਏ ਆਪਣੇ ਗੇਮਿੰਗ ਹੁਨਰ 'ਤੇ ਕਾਫੀ ਕੰਮ ਕੀਤਾ ਹੈ। ਏਸ਼ੀਆ ਕੱਪ ਤੋਂ ਸ਼ਾਨਦਾਰ ਵਾਪਸੀ ਕੇਐੱਲ ਰਾਹੁਲ ਨੇ ਏਸ਼ੀਆ ਕੱਪ 'ਚ ਕਈ ਸ਼ਾਨਦਾਰ ਪਾਰੀਆਂ ਖੇਡੀਆਂ ਅਤੇ ਇਸ ਤੋਂ ਬਾਅਦ ਵਿਸ਼ਵ ਕੱਪ 'ਚ ਵੀ ਉਨ੍ਹਾਂ ਨੇ ਨਾ ਸਿਰਫ ਨੰਬਰ-5 ਦੀ ਭੂਮਿਕਾ ਨੂੰ ਬਹੁਤ ਵਧੀਆ ਤਰੀਕੇ ਨਾਲ ਨਿਭਾਇਆ ਸਗੋਂ ਵਿਕਟਕੀਪਿੰਗ ਨਾਲ ਵੀ ਕਮਾਲ ਕਰ ਦਿੱਤਾ। ਕੇਐਲ ਰਾਹੁਲ ਵੀ ਕਪਤਾਨ ਨੂੰ ਡੀਆਰਐਸ ਲੈਣ ਲਈ ਬਿਲਕੁਲ ਸਹੀ ਸਲਾਹ ਦਿੰਦੇ ਹਨ। ਉਂਝ, ਜੇਕਰ ਸੈਂਚੁਰੀਅਨ ਵਿੱਚ ਚੱਲ ਰਹੇ ਟੈਸਟ ਮੈਚ ਦੀ ਗੱਲ ਕਰੀਏ ਤਾਂ ਭਾਰਤ ਨੇ ਕੇਐਲ ਰਾਹੁਲ ਦੇ ਸੈਂਕੜੇ ਦੀ ਮਦਦ ਨਾਲ ਪਹਿਲੀ ਪਾਰੀ ਵਿੱਚ ਕੁੱਲ 245 ਦੌੜਾਂ ਬਣਾਈਆਂ ਸਨ, ਪਰ ਦੂਜੇ ਦਿਨ ਦੀ ਖੇਡ ਖਤਮ ਹੋਣ ਤੱਕ ਦੱਖਣੀ ਅਫਰੀਕਾ ਨੇ 256 ਦੌੜਾਂ ਬਣਾ ਲਈਆਂ ਸਨ। ਨੇ 5 ਵਿਕਟਾਂ ਗੁਆ ਦਿੱਤੀਆਂ ਸਨ। ਹਰ ਵਾਰ ਦੀ ਤਰ੍ਹਾਂ ਇਸ ਵਾਰ ਵੀ ਦੱਖਣੀ ਅਫਰੀਕਾ ਦੇ ਡੀਨ ਐਲਗਰ ਇਕ ਵਾਰ ਫਿਰ ਚੱਟਾਨ ਵਾਂਗ ਕ੍ਰੀਜ਼ 'ਤੇ ਡਟੇ ਹੋਏ ਹਨ ਅਤੇ 140 ਦੌੜਾਂ ਬਣਾ ਕੇ ਅਜੇਤੂ ਹਨ।","pubDate":"2023-12-28 03:24:21","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/12/28/506a965c01416c472ef0d999f1aa92141703733785917709_original.jpg","source_id":"abplive","source_priority":10959,"country":["india"],"category":["sports"],"language":"punjabi"},{"article_id":"54fcd17e5c681809f2a8045a8d86af6d","title":"'कुछ दिन पहले यही लोग देते थे गाली', शतक लगाते ही केएल राहुल का बड़ा बयान","link":"https://www.indiatv.in/sports/cricket/ind-vs-sa-kl-rahul-statement-after-making-century-against-south-africa-in-boxing-day-test-2023-12-28-1011652","keywords":null,"creator":null,"video_url":null,"description":"IND vs SA: भारत और साउथ अफ्रीका के बीच पहले टेस्ट में केएल राहुल ने अपने शतक से टीम इंडिया को एक सम्मानजनक स्कोर तक पहुंचाया। इस पारी के बाद उन्होंने एक बड़ा बयान दिया है।","content":"भारत और साउथ अफ्रीका के बीच दो मैचों की टेस्ट सीरीज का पहला मैच खेला जा रहा है। इस मैच में टीम इंडिया पहले बल्लेबाजी करते हुए 245 रन के स्कोर पर ऑलआउट हो गई। इसके बाद साउथ अफ्रीका ने 5 विकेट खोकर 256 रन बना लिए हैं। साउथ अफ्रीका की टीम के पास इस वक्त 11 रनों की लीड हासिल है। इस मैच में भारतीय टीम अपनी पहली पारी के दौरान काफी मुश्किल में नजर आ रही थी, लेकिन केएल राहुल ने एक शानदार पारी खेलकर टीम इंडिया ने मुश्किल से निकाला और भारत को एक सम्मानजनक स्कोर कर पहुंचाया। साउथ अफ्रीका के खिलाफ बॉक्सिंग डे टेस्ट मैच में के दौरान केएल राहुल ने शानदार पारी खेली। उन्होंने 137 गेंदों पर 101 रन बनाए। केएल राहुल ने इस पारी के बाद एक बड़ा बयान दिया है। उन्होंने कहा कि आज मैंने शतक बनाया है इसलिए लोग तारीफ कर रहे हैं। 3-4 महीने पहले, हर कोई मुझे गाली दे रहा था। यह खेल का हिस्सा है, लेकिन मैं यह नहीं कह सकता कि इसका आप पर असर नहीं पड़ता। ऐसा होता है। जितनी जल्दी आपको यह एहसास होगा कि इससे दूर रहना आपके खेल के लिए अच्छा है उतना ही बेहतर होगा। आपको बता दें कि केएल राहुल कुछ महीने पहले तक बेहद खराब फॉर्म से गुजर रहे थे। इंजरी और खराब फॉर्म के कारण उन्हें सोशल मीडिया पर जमकर ट्रोलिंग का सामना करना पड़ रहा था। केएल राहुल ने जैसे ही इंजरी के बाद टीम इंडिया में कमबैक किया उस दौरान भी कुछ लोगों ने उनके वर्ल्ड कप टीम में होने पर कई सवाल खड़े किए थे। केएल राहुल ने उन सभी का जवाब वर्ल्ड कप में अपने शानदार फॉर्म से दिया। अब टेस्ट क्रिकेट में भी केएल राहुल ने दमदार वापसी कर ली है। जिसके बाद उनका ये बड़ा बयान सामने आया है। बॉक्सिंग डे टेस्ट में केएल राहुल ने शतक लगाते ही कई बड़े रिकॉर्ड अपने नाम कर लिए हैं। टीम इंडिया ने इससे पहले पिछली बार साल 2021 में साउथ अफ्रीका के ही खिलाफ बॉक्सिंग डे टेस्ट मैच खेला था। इस मुकाबले में भी केएल राहुल ने शतक लगाया था। बॉक्सिंग डे टेस्ट में बैक टू बैक शतक लगाने वाले वह दुनिया के दूसरे खिलाड़ी है। इसके अलावा सेंचुरियन में किसी बाहरी बल्लेबाज द्वारा सबसे ज्यादा टेस्ट रन बनाने के मामले में भी केएल राहुल पहले स्थान पर पहुंच गए हैं।","pubDate":"2023-12-28 03:18:00","image_url":"https://resize.indiatv.in/resize/715_-/2023/12/travis-1-1703732976.jpg","source_id":"indiatv","source_priority":216441,"country":["india"],"category":["sports"],"language":"hindi"},{"article_id":"dddb49e603700cdbd7e5ab977372fafb","title":"Second Test delayed by third umpire stuck in MCG lift","link":"https://www.perthnow.com.au/sport/cricket/second-test-delayed-by-third-umpire-stuck-in-mcg-lift-c-13044067","keywords":null,"creator":["Shayne Hope"],"video_url":null,"description":"Third umpire Richard Illingworth was stuck in a lift at the MCG, causing a seven-minute delay to the start of play in the second Test after lunch on day three.","content":"Play was held up in bizarre circumstances during the second Australia-Pakistan Test at the MCG because the third umpire got stuck in a lift. Players returned to the middle of the iconic venue after the lunch break on Thursday, in time for the scheduled 1.25pm start to the second session. But in unusual scenes, the two central umpires wouldn't allow a ball to be bowled because experienced English official Richard Illingworth was unable to return to his post in the grandstand. It left Australian batters David Warner and Steve Smith waiting to resume their innings, with the hosts stuck on 2-6 in their second dig with an overall lead of 60. Cricket Australia and the MCG both produced light-hearted responses to the peculiar delay, which lasted seven minutes. \"The game is delayed because the third umpire ... is stuck in the lift,\" Cricket Australia's social media arm posted on X, formerly known as Twitter. The MCG was quick to reply: \"Sorry.\" The banter continued when Illingworth eventually made his way back to his seat by 1.32pm, with Cricket Australia posting: \"A wild Richard Illingworth appeared!\" Warner (six) and Travis Head (zero) fell to successive Mir Hamza deliveries at the start of the third over after play resumed, leaving Australia reeling at 4-16. Earlier, a scheduled 10am start to day three was pushed back to 10.45am because of rain.","pubDate":"2023-12-28 03:17:01","image_url":"https://images.perthnow.com.au/publication/C-13044067/3cf2a247f17de887f81a217d965055b5c746e16e-16x9-x0y0w1280h720.jpg","source_id":"perthnow","source_priority":49457,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"5b23d2566e537a2052bc566c647c634a","title":"\"Jo Bolna...\": Rahul To Trolls After '1 Of Top 10 Tons' In Indian Cricket","link":"https://sports.ndtv.com/cricket/jo-bolna-hoga-kl-rahul-shuts-down-trolls-after-one-of-the-top-10-centuries-in-indian-test-cricket-4753870","keywords":null,"creator":null,"video_url":null,"description":"KL Rahul scored 101 vs South Africa in the 1st Test. Sunil Gavaskar hailed it as one of the top 10 centuries in Indian Test cricket history","content":"Don't you ever feel retorting to trolls who are merciless and at times downright out of line when they criticise you? KL Rahul was asked. \"What will I achieve (by) doing that?\" he countered. \"Logon ko jo bolna hoga bolenge (People will say what they want to). If you are a public performer, performance is your only yardstick to stay away from criticism. And about social media, the farther you stay away from it, the happier you will be,\" a composed Rahul told media persons after scoring what Sunil Gavaskar termed as one of the 10 best hundreds ever hit by an Indian batter. \"If he (Gavaskar) has said that, it's a huge compliment,\" he said post his stupendous 137-ball 101. Rahul said the time away from the game due to injury helped him work on his personality. \"When you play international cricket, you are not only challenged as a player but also as a person because you have a personality. So, when I was away from the game, I worked on myself as a person. Obviously, there were people to help me,\" he said. He felt that social media comments did affect a person but one needed to know where to draw a line. \"One who is hailing me today was abusing me some months back. Anyone who says he isn't affected by comments on social media is lying. But the more you stay away, the better it is for your mindset,\" he said. South Africa have their nose ahead and Rahul said it has become easier to bat. Advertisement \"Today in the morning, when we'd batted for those 7-8 overs, I felt the wicket had eased a bit. But it can change here quickly with cracks opening out.\" Rahul said Centurion wicket never allows a batter to \"feel set\" and at times one can score freely and at times one can't. The key to batting in the middle-order and playing long is not to plan too much, reckoned the 31-year-old. \"You can't plan that much. There's a game situation that tells you how to play in that time and moment. You have to remain free and empty. You need to be aware that you might have to bat with tail,\" he said.","pubDate":"2023-12-28 03:15:47","image_url":"https://c.ndtvimg.com/2023-12/br14m33o_kl-rahul-century-afp_625x300_27_December_23.jpg","source_id":"ndtv","source_priority":1204,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"7535b2de2abfb61e8b0dc500b7a302ca","title":"'उसकी कलाई बहुत मजबूत हैं', दक्षिण अफ्रीकी दिग्‍गज ने की बुमराह की तारीफ","link":"https://hindi.news18.com/cricket/south-africas-veteran-fast-bowler-makhaya-ntini-praises-team-indias-jasprit-bumrahs-bowling-skills-7936127.html","keywords":null,"creator":null,"video_url":null,"description":"दक्षिण अफ्रीका के पूर्व दिग्‍गज तेज गेंदबाज मखाया एनटिनी भी जसप्रीत बुमराह के गेंदबाजी कौशल के कायल हैं.ए‍नटिनी का मानना है कि बुमराह के भारतीय टीम ने न तो होने से वह पहले जैसी बॉलिंग यूनिट नहीं रह जाती. सेंचुरियन टेस्‍ट में वे भारतीय टीम के अब तक के सबसे अच्‍छे बॉलर साबित हुए हैं.","content":"मखाया ए‍नटिनी का मानना है, जसप्रीत बुमराह के भारतीय टीम ने न तो होने से वह पहले जैसी बॉलिंग यूनिट नहीं रह जाती.Jasprit Bumrah/Instagram नई दिल्‍ली. जसप्रीत बुमराह (Jasprit Bumrah) को क्रिकेट के सभी फॉर्मेटों में भारतीय टीम का सर्वश्रेष्‍ठ बॉलर माना जा सकता है.कई पूर्व क्रिकेटर तो उन्‍हें मौजूदा दौर के दुनिया के सर्वश्रेष्‍ठ गेंदबाज की श्रेणी में रखते हैं.टेस्‍ट क्रिकेट हो, वनडे या फिर टी20I, हर फॉर्मेट में बुमराह न केवल विकेट हासिल करते हैं बल्कि बेहद किफायती भी साबित होते हैं. गेंदबाज के तौर पर उनके पास अच्‍छे खासे वेरिएशंस हैं और सटीक यॉर्कर व स्‍लोअर बॉल से वे विपक्षी बैटरों की जमकर परीक्षा लेते हैं. दक्षिण अफ्रीका के पूर्व दिग्‍गज तेज गेंदबाज मखाया एनटिनी (Makhaya Ntini) भी बुमराह के गेंदबाजी कौशल के कायल हैं.ए‍नटिनी का मानना है कि बुमराह के भारतीय टीम ने न तो होने से वह पहले जैसी बॉलिंग यूनिट नहीं रह जाती. ‘ अपने’ मैदानों पर भारत के खिलाफ हमेशा दहाड़ता है यह दक्षिण अफ्रीकी बैटर, डिविलियर्स से भी ऊंचा औसत ‘सिर के ऊपर से रिलीज करते हैं गेंद’ दक्षिण अफ्रीका के लिए टेस्‍ट में 390 और वनडे में 266 विकेट हासिल करने वाले एनटिनी ने कहा, ‘ऐसा लगता है कि बुमराह की कलाइयां बेहद मजबूत हैं. ‘इंडिया टुडे के साथ बातचीत में बुमराह की गेंदबाजी का बारीक विश्‍लेषण करते हुए उन्‍होंने कहा, ‘देखिए वह (बुमराह) गेंद को कहां रिलीज करता है. वह गेंद को अपने सिर के ऊपर से छोड़ते हैं और संभवत: इसी कारण गेंद को अंदर लाने के लिए एंगल हासिल करने में सफल होते हैं.वह ऐसी गेंद भी फेंकते हैं जो पिच करने के बाद सीधी रहती हैं.खास बात यह है कि उनका बॉलिंग एक्शन हमेशा एक जैसा होता है,यह बेहतरीन है.’ पांच बैटर जड़ चुके डेब्‍यू और आखिरी टेस्‍ट में शतक, एक भारतीय भी शामिल एनटिनी बोले, उनकी यॉर्कर टारगेट मिस नहीं करतीं बुमराह की यॉर्कर की खास तौर पर तारीफ करते हुए दक्षिण अफ्रीका के इस पूर्व तेज गेंदबाज ने कहा, ‘उनकी यॉर्कर टारगेट को मिस नहीं करतीं. यह वाकई ऐसी चीजें हैं जिनका हर कोई लुत्‍फ उठा सकता है.बुमराह के टीम में न होने पर भारत पहले जैसी टीम नहीं रह जाती.’ बुमराह की बात करें तो वे जुलाई 2022 के बाद अपना अपना पहला टेस्‍ट खेल रहे हैं. दक्षिण अफ्रीका के खिलाफ (India Vs South Africa) सेंचुरियन टेस्‍ट में वे भारतीय टीम के अब तक के सबसे अच्‍छे बॉलर साबित हुए हैं और गिरे पांच में से दो विकेट उन्‍होंने हासिल किए हैं. Video: विराट कोहली ने आजमाया अंग्रेजों का टोटका, अगली गेंद पर गिरा विकेट बैक इंजुरी के कारण सर्जरी कराने के बाद उन्‍होंने इंटरनेशनल क्रिकेट में वापसी की है. वर्ल्‍डकप 2023 में भी शमी के बाद बुमराह भारत के सबसे कामयाब बॉलर (11 मैचों में 20 विकेट, औसत 18.65)रहे थे. . Tags: Ind vs sa , India vs South Africa , Jasprit Bumrah दुनिया का सबसे पुराना शहर है बेहद खूबसूरत, कभी पेरिस से होती थी तुलना, जानिए कैसी है वहां की लाइफ 3 साल के इस बच्चे ने पूरे एशिया में मचा रखी है धूम... कर रहा लाखों की कमाई, अब वेब सीरीज में भी दिखेगा कौन है 36 साल की वो एक्ट्रेस, जिसने किया इंडस्ट्री के काले सच का खुलासा, काम को तरस रही खूबसूरत हीरोइन ने बताई आपबीती लाइव ब्लॉग 3 days ago 4 days ago 7 days ago 7 days ago","pubDate":"2023-12-28 03:14:41","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/12/Jasprit-Bumrah-2023-12-1796a438690d82f531e9775c84fcb154-3x2.jpg","source_id":"hindinews18","source_priority":6509,"country":["india"],"category":["sports"],"language":"hindi"},{"article_id":"1226a652cad0f1305002408ab42d1fef","title":"Second Test delayed by third umpire stuck in MCG lift","link":"https://www.blayneychronicle.com.au/story/8471742/second-test-delayed-by-third-umpire-stuck-in-mcg-lift/?src=rss","keywords":null,"creator":["Shayne Hope"],"video_url":null,"description":null,"content":"Play was held up in bizarre circumstances during the second Australia-Pakistan Test at the MCG because the third umpire got stuck in a lift. / (min cost $ 8 ) Login or signup to continue reading Players returned to the middle of the iconic venue after the lunch break on Thursday, in time for the scheduled 1.25pm start to the second session. But in unusual scenes, the two central umpires wouldn't allow a ball to be bowled because experienced English official Richard Illingworth was unable to return to his post in the grandstand. It left Australian batters David Warner and Steve Smith waiting to resume their innings, with the hosts stuck on 2-6 in their second dig with an overall lead of 60. Cricket Australia and the MCG both produced light-hearted responses to the peculiar delay, which lasted seven minutes. \"The game is delayed because the third umpire ... is stuck in the lift,\" Cricket Australia's social media arm posted on X, formerly known as Twitter. The MCG was quick to reply: \"Sorry.\" The banter continued when Illingworth eventually made his way back to his seat by 1.32pm, with Cricket Australia posting: \"A wild Richard Illingworth appeared!\" Warner (six) and Travis Head (zero) fell to successive Mir Hamza deliveries at the start of the third over after play resumed, leaving Australia reeling at 4-16. Earlier, a scheduled 10am start to day three was pushed back to 10.45am because of rain. Advertisement Sign up for our newsletter to stay up to date. We care about the protection of your data. Read our . Advertisement","pubDate":"2023-12-28 03:14:14","image_url":"https://www.blayneychronicle.com.au/images/transform/v1/crop/frm/silverstone-feed-data/10f1740b-67e9-4dc6-958e-44fb97c5361e.jpg/r0_75_800_526_w600_h338_fmax.jpg","source_id":"blayneychronicle","source_priority":17177086,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"cf4126ea7e65fe2e8ecab682a1159539","title":"Second Test delayed by third umpire stuck in MCG lift","link":"https://www.busseltonmail.com.au/story/8471742/second-test-delayed-by-third-umpire-stuck-in-mcg-lift/?src=rss","keywords":null,"creator":null,"video_url":null,"description":null,"content":"Play was held up in bizarre circumstances during the second Australia-Pakistan Test at the MCG because the third umpire got stuck in a lift. Players returned to the middle of the iconic venue after the lunch break on Thursday, in time for the scheduled 1.25pm start to the second session. But in unusual scenes, the two central umpires wouldn't allow a ball to be bowled because experienced English official Richard Illingworth was unable to return to his post in the grandstand. It left Australian batters David Warner and Steve Smith waiting to resume their innings, with the hosts stuck on 2-6 in their second dig with an overall lead of 60. Cricket Australia and the MCG both produced light-hearted responses to the peculiar delay, which lasted seven minutes. \"The game is delayed because the third umpire ... is stuck in the lift,\" Cricket Australia's social media arm posted on X, formerly known as Twitter. The MCG was quick to reply: \"Sorry.\" The banter continued when Illingworth eventually made his way back to his seat by 1.32pm, with Cricket Australia posting: \"A wild Richard Illingworth appeared!\" Warner (six) and Travis Head (zero) fell to successive Mir Hamza deliveries at the start of the third over after play resumed, leaving Australia reeling at 4-16. Earlier, a scheduled 10am start to day three was pushed back to 10.45am because of rain. Australian Associated Press","pubDate":"2023-12-28 03:14:14","image_url":"https://www.busseltonmail.com.au/images/transform/v1/crop/frm/silverstone-feed-data/10f1740b-67e9-4dc6-958e-44fb97c5361e.jpg/r0_75_800_526_w600_h338_fmax.jpg","source_id":"busseltonmail","source_priority":6251187,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"52048fe786aa89ec163de22282ebde57","title":"IND vs SA 1st Test, Day 3 Live Streaming: এলগারের শতকে এগিয়ে প্রোটিয়া, কীভাবে থামাবে রোহিতরা; সরাসরি দেখুন","link":"https://bangla.latestly.com/sports/cricket/ind-vs-sa-1st-test-day-3-live-streaming-275425.html","keywords":null,"creator":null,"video_url":null,"description":"ভারত বনাম দক্ষিণ আফ্রিকা, প্রথম টেস্ট তৃতীয় দিনের ম্যাচ শুরু হবে ভারতীয় সময় দুপুর ১ঃ৩০টায়","content":"আজ ভারত তাদের কঠিন পরীক্ষায় জয় পেতে প্রস্তুত, কিন্তু বরাবরের মতো দক্ষিণ আফ্রিকাকে হারানো সহজ হবে না। দক্ষিণ আফ্রিকায় কখনও টেস্ট সিরিজ জেতেনি টিম ইন্ডিয়া। খারাপ আলোয় দ্বিতীয় দিনে তাড়াতাড়ি স্টাম্প পড়ে যায়। দক্ষিণ আফ্রিকা ৫ উইকেটে ২৫৬ রান তুলে ভারতের থেকে ১১ রানে এগিয়ে রয়েছে। ১৪তম টেস্ট সেঞ্চুরি করে ডিন এলগার (Dean Elgar) তার বিদায়ী সিরিজকে আরও স্মরণীয় করেন। অভিষেকে অর্ধশতক করে ডেভিড বেডিংহামের (David Bedingham) দ্বিতীয় দিনে এলগারের সঙ্গে সেঞ্চুরির জুটি গড়ে দক্ষিণ আফ্রিকাকে এগিয়ে যেতে সাহায্য করে। প্রায় ৩০ ওভার উইকেটহীন থাকার পর তাদের ১৩১ রানের পার্টনারশিপ ভাঙেন মহম্মদ সিরাজ (Mohammed Siraj)। শেষ পর্যন্ত বেডিংহামকে ফেরানোর পরের ওভারেই কাইল ভেরেইনকে (Kyle Verreynne) আউট করে টেস্ট ক্রিকেটের খাতা খোলেন প্রসিদ্ধ কৃষ্ণা। সেঞ্চুরিয়নের সুপারস্পোর্টস পার্কে গতকাল দক্ষিণ আফ্রিকার অধিনায়ক টেম্বা বাভুমা টসে জিতে বোলিং করার সিদ্ধান্ত নেন। Bad light brings an end to Day 2. South Africa reach 256/5, with a lead of 11 runs. Scorecard ▶️ | — BCCI (@BCCI) রোহিত শর্মা (অধিনায়ক), যশস্বী জয়সওয়াল, শুভমন গিল, বিরাট কোহলি, শ্রেয়স আইয়ার, কেএল রাহুল (উইকেটরক্ষক), রবিচন্দ্রন অশ্বিন, শার্দুল ঠাকুর, জসপ্রীত বুমরাহ, মহম্মদ সিরাজ, প্রসিদ্ধ কৃষ্ণা। ডিন এলগার, এডেন মার্করাম, টনি ডি জরজি, টেম্বা বাভুমা (অধিনায়ক), কিগান পিটারসেন, ডেভিড বেডিংহাম, কাইল ভেরেইন (উইকেটরক্ষক), মার্কো জানসেন, জেরাল্ড কোয়েটজি, কাগিসো রাবাডা, নান্দ্রে বার্গার। ২৮ ডিসেম্বর সেঞ্চুরিয়নের সুপারস্পোর্টস পার্কে (SuperSport Park, Centurion) প্রথম টেস্ট তৃতীয় দিনের ম্যাচে মুখোমুখি হবে ভারত বনাম দক্ষিণ আফ্রিকা। ভারত বনাম দক্ষিণ আফ্রিকা, প্রথম টেস্ট তৃতীয় দিনের ম্যাচ শুরু হবে ভারতীয় সময় দুপুর ১ঃ৩০টায়। সরাসরি টিভিতে ভারত বনাম দক্ষিণ আফ্রিকা, প্রথম টেস্ট তৃতীয় দিনের ম্যাচ ভারতে দেখবেন স্টার স্পোর্টসে নেটওয়ার্কে। সরাসরি অনলাইনে ভারত বনাম দক্ষিণ আফ্রিকা, প্রথম টেস্ট তৃতীয় দিনের ম্যাচ দেখতে পাবেন ডিজনি+ হটস্টার (Disney+ Hotstar) অ্যাপে।","pubDate":"2023-12-28 03:48:41","image_url":"https://bnst1.latestly.com/wp-content/uploads/2023/12/49-6-380x214.jpg","source_id":"latestly","source_priority":5523,"country":["india"],"category":["sports"],"language":"bengali"},{"article_id":"35f61238e895923a0d9343e24ff9f9db","title":"Channel Seven star Mel McLaughlin gets caught up in BIZARRE situation with cricket umpire that delayed play in the Boxing Day Test","link":"https://www.dailymail.co.uk/sport/cricket/article-12905811/Mel-McLaughlin-caught-lift-cricket-umpire-delayed-play-Boxing-Day-Test-MCG-Channel-Seven-Richard-Illingworth.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Cricket fans were mystified when play in the session after lunch at the MCG on Thursday was held up for several minutes - but McLaughlin soon gave a first-hand account of what went wrong.","content":"Channel Seven star Mel McLaughlin gets caught up in BIZARRE situation with cricket umpire that delayed play in the Boxing Day Test Commentator explained freakish occurrence in commentary Play was delayed after the lunch break at the MCG on Thursday News surfaced with Australia struggling badly in their second innings By Shayne Bugden For Daily Mail Australia and Shayne Hope For Australian Associated Press Published: 22:44 EST, 27 December 2023 | Updated: 22:48 EST, 27 December 2023 e-mail View comments Sports commentator Mel McLaughlin has revealed she was at the centre of a freakish incident with a cricket umpire that forced play to be delayed at the Boxing Day Test on Thursday afternoon. The Channel Seven star was catching a lift from the MCG's underground car park with third umpire Richard Illingworth when the elevator malfunctioned, trapping them and eight other people and forcing her to use her phone to call for help. Play in the session after lunch was held up as a result of the scare, with McLaughlin describing what happened inside the lift when she joined her co-commentators Justin Langer and James Brayshaw afterwards. McLaughlin (pictured left with fellow Seven star Ricky Ponting) was trapped in the lift with a very 'distracted' umpire as play had to be held up at the MCG on Thursday 'We [she and Illingworth] were having a bit of a chat ... and the doors open and then close and then didn't move again,' she said. 'He's standing in the corner and he went, 'Do you have a phone? Can you please call someone and let them know I'm in the lift, I'm going to be a little bit late?' 'So yeah, everyone got to work and we got freed, I don't know, 10 minutes later. Sorry everyone!' Brayshaw asked what the conversation was like in the lift and McLaughlin replied, 'There were 10 of us in there, so that was one thing. There was a lovely family in there, a young baby, and there was a guy eating hot chips that we were all trying to get a bit of. 'But the rest of the time, our EP [executive producer] Jonesy is on the phone, Sam, our production manager, she's also trying to help things move along quickly. Pip, the make-up artist - we're all just trying to keep things calm and keep Richard talking and being entertained because we knew he was a little bit distracted and knew he had to get out there. 'He ran quite quickly straight upstairs!' McLaughlin joined her fellow commentators, cricket legend Justin Langer (centre) and James Brayshaw (right) to explain what happened inside the lift Third umpire Richard Illingworth (pictured) 'ran quite quickly straight upstairs' once he was freed from the lift, McLaughlin said The Seven star was accompanied by her executive producer and a make-up artist from the broadcaster when the lift broke down Play had to be delayed because the third umpire - while not taking up a position on the field - sits in a broadcast booth and is responsible for making the final call on dismissals that are referred to them by the two officials on the ground. They can also serve as an on-field umpire in case of injury or illness. Cricket Australia and the MCG both produced light-hearted responses to the peculiar delay, which lasted seven minutes. 'The game is delayed because the third umpire ... is stuck in the lift,' Cricket Australia's social media arm posted on X, formerly known as Twitter. The MCG was quick to reply: 'Sorry.' The banter continued when Illingworth eventually made his way back to his seat by 1.32pm, with Cricket Australia posting: 'A wild Richard Illingworth appeared!' McLaughlin delivered the news just as Australia were struggling badly against a rampant Pakistan bowling attack that reduced them to 4-16, with fast bowler Mir Hamza on a hat-trick. Justin Langer Channel Seven Share or comment on this article: Channel Seven star Mel McLaughlin gets caught up in BIZARRE situation with cricket umpire that delayed play in the Boxing Day Test e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-12-28 03:48:10","image_url":"https://i.dailymail.co.uk/1s/2023/12/28/03/79390939-0-image-a-8_1703734737857.jpg","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"2a7019bdd07bff856b4f80ead9a692e6","title":"AUS vs PAK: Mir Hamza castles Travis Head on golden duck, Pakistan legend calls it 'genuis' stuff | WATCH","link":"https://www.indiatvnews.com/sports/cricket/aus-vs-pak-2nd-test-mir-hamza-castles-world-cup-star-travis-head-pakistan-legend-calls-it-genuis-stuff-watch-melbourne-cricket-ground-2023-12-28-909241","keywords":null,"creator":null,"video_url":null,"description":"AUS vs PAK: Pakistan are giving Australia a great fight in the Boxing Day Test as their pacers have wreaked havoc against the much-celebrated batting line-up in Melbourne. After wrapping Shan Masood's side for 264, the Aussies took a 54-run lead but the Pakistan pace-battery helped their team storm back into the match.","content":"Pakistan are giving Australia a great fight in the Boxing Day Test as their pacers have wreaked havoc against the much-celebrated batting line-up in Melbourne. After wrapping Shan Masood's side for 264, the Aussies took a 54-run lead but the Pakistan pace-battery helped their team storm back into the match. Well led by Shaheen Afridi and Mir Hamza, the visitors put the hosts in deep trouble with quick wickets in the second innings. Hamza accounted for two of the first four wickets, which included a 'genius' stuff. Playing only his 4th Test, the 31-year-old Hamza cleaned the World Cup star Travis Head with a sensational delivery. The left-arm pacer outfoxed Head with a delivery that came inside massively to the Southpaw, sending the fans crazy. The Aussies were at 16/2 in the second session of the day when Hamza first got rid of David Warner with a back-of-a-length ball and then produced a jaffa on the very next one. Coming from over the wicket, Hamza used both swing and seam perfectly. He swung the ball inside which pitched fuller just outside off and then it seamed in too. Head looked naive on his first delivery as he was beaten all ended up with the ball hitting the middle stumps. Hamza also had the chance to grab a hat trick but missed it as Mitchell Marsh did not fall for his harmless outside-of-off-stump delivery. Commentators on air defined the moment as a genius stuff. Pakistan's bowling legend Wasim Akram was also present in the commentary panel and he agreed that this was a genius piece of bowling. Wasim Akram described that Head was expecting an outswing but the ball swung back into him. \"Travis Head was expecting the outswing but like you said it was a genius move by Mir Hamza. Look at the roll of the wrists and the ball swung back into him and middle-stump gone,\" Akram said on air Hamza and Shaheen took the initial four wickets to put the hosts in massive trouble in their second reply. After Head's wicket, Australia were sent four down for just 16 and had a lead of 70. Shaheen and Hamza picked two wickets apiece. Shaheen jolted the WTC champions early with the wickets of and Marnus Labuschagne just before lunch before the Hamza show.","pubDate":"2023-12-28 03:27:44","image_url":"https://resize.indiatvnews.com/en/resize/newbucket/715_-/2023/12/rohit-kohli-20-1703733845.jpg","source_id":"indiatvnews","source_priority":10055,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"1e57d0e98fb434b8f4785620e6c4010b","title":"KL Rahul: ਕੇਐਲ ਰਾਹੁਲ ਟ੍ਰੋਲਿੰਗ ਤੋਂ ਹੁੰਦੇ ਵੱਧ ਪਰੇਸ਼ਾਨ, ਸੈਂਚੁਰੀਅਨ ਵਿੱਚ ਸੈਂਕੜਾ ਲਗਾਉਣ ਵਾਲੇ ਕ੍ਰਿਕਟਰ ਨੇ ਕੀਤਾ ਵੱਡਾ ਖੁਲਾਸਾ","link":"https://punjabi.abplive.com/sports/cricket/ind-vs-sa-1st-test-at-centurion-kl-rahul-was-upset-with-social-media-trolls-767580","keywords":["ਕ੍ਰਿਕਟ"],"creator":["ABP Sanjha"],"video_url":null,"description":"<p><strong>IND vs SA 1st Test:</strong> ਦੱਖਣੀ ਅਫਰੀਕਾ ਦੇ ਸੈਂਚੁਰੀਅਨ 'ਚ ਲਗਾਤਾਰ ਦੂਜਾ ਸੈਂਕੜਾ ਲਗਾਉਣ ਵਾਲੇ <a title=\"ਟੀਮ ਇੰਡੀਆ\" href=\"https://punjabi.abplive.com/topic/indian-cricket-team\" data-type=\"interlinkingkeywords\">ਟੀਮ ਇੰਡੀਆ</a> ਦੇ ਸਟਾਰ ਬੱਲੇਬਾਜ਼ ਕੇਐੱਲ ਰਾਹੁਲ ਨੇ ਸੋਸ਼ਲ ਮੀਡੀਆ 'ਤੇ ਟ੍ਰੋਲਸ ਨਾਲ ਨਜਿੱਠਣ ਦੇ ਆਪਣੇ ਤਰੀਕੇ ਬਾਰੇ ਖੁੱਲ੍ਹ ਕੇ ਗੱਲ ਕੀਤੀ। ਉਸ ਨੇ ਜ਼ੋਰ ਦੇ ਕੇ ਕਿਹਾ ਕਿ ਕਿਸੇ ਹੋਰ ਖਿਡਾਰੀ ਵਾਂਗ ਵਹਬ ਵੀ ਨਕਾਰਾਤਮਕ ਟਿੱਪਣੀਆਂ ਤੋਂ ਪ੍ਰਭਾਵਿਤ ਹੁੰਦਾ ਹੈ।</p> <p>ਰਾਹੁਲ ਨੇ ਕਿਹਾ ਕਿ ਇਸ ਸਾਲ ਦੀ ਸ਼ੁਰੂਆਤ 'ਚ ਸੱਟ ਨੇ ਉਸ ਨੂੰ ਆਪਣੇ 'ਦਿਮਾਗ' 'ਤੇ ਕੰਮ ਕਰਨ ਦਾ ਸਮਾਂ ਦਿੱਤਾ ਅਤੇ ਉਸ ਨੇ ਮਹਿਸੂਸ ਕੀਤਾ ਕਿ ਬੱਲੇ ਨੂੰ ਗੱਲ ਕਰਨ ਦੇਣਾ ਸੋਸ਼ਲ ਮੀਡੀਆ 'ਤੇ ਨਕਾਰਾਤਮਕਤਾ ਨੂੰ ਦੂਰ ਕਰਨ ਦਾ ਵਧੀਆ ਤਰੀਕਾ ਹੈ।</p> <p><strong>ਸਾਲ ਦੀ ਸ਼ੁਰੂਆਤ 'ਚ ਬਾਹਰ ਹੋ ਗਏ ਸੀ</strong></p> <p>ਸੈਂਚੁਰੀਅਨ ਵਿੱਚ ਦੱਖਣੀ ਅਫਰੀਕਾ ਅਤੇ ਭਾਰਤ ਵਿਚਾਲੇ ਬਾਕਸਿੰਗ ਡੇ ਟੈਸਟ ਦੇ ਦੂਜੇ ਦਿਨ ਸ਼ਾਨਦਾਰ ਸੈਂਕੜਾ ਲਗਾਉਣ ਤੋਂ ਬਾਅਦ ਇਹ ਖੁਲਾਸਾ ਕੀਤਾ ਹੈ। ਕੇਐੱਲ ਰਾਹੁਲ ਇਸ ਸਾਲ ਦੀ ਸ਼ੁਰੂਆਤ 'ਚ ਆਸਟ੍ਰੇਲੀਆ ਖਿਲਾਫ ਬਾਰਡਰ-ਗਾਵਸਕਰ ਟਰਾਫੀ ਦੌਰਾਨ ਅੱਧ ਵਿਚਾਲੇ ਹੀ ਆਊਟ ਹੋ ਗਏ ਸਨ। ਇਸ ਤੋਂ ਬਾਅਦ ਕੇਐੱਲ ਰਾਹੁਲ ਨੇ ਹੁਣ ਟੈਸਟ ਫਾਰਮੈਟ 'ਚ ਵਾਪਸੀ ਕੀਤੀ ਹੈ ਅਤੇ ਤੁਰੰਤ ਹੀ ਸ਼ਾਨਦਾਰ ਸੈਂਕੜਾ ਲਗਾਇਆ ਹੈ।</p> <p>ਤੁਹਾਨੂੰ ਦੱਸ ਦੇਈਏ ਕਿ ਕੇਐਲ ਰਾਹੁਲ ਵੀ ਆਈਪੀਐਲ ਦੌਰਾਨ ਜ਼ਖਮੀ ਹੋ ਗਏ ਸਨ ਅਤੇ ਫਿਰ ਕਈ ਮਹੀਨਿਆਂ ਤੱਕ ਕ੍ਰਿਕਟ ਨਹੀਂ ਖੇਡ ਸਕੇ ਸਨ। ਇਸ ਕਾਰਨ ਉਹ ਵਿਸ਼ਵ ਟੈਸਟ ਚੈਂਪੀਅਨਸ਼ਿਪ ਟੀਮ ਦਾ ਹਿੱਸਾ ਵੀ ਨਹੀਂ ਸੀ। ਹਾਲਾਂਕਿ, ਉਸ ਨੇ ਏਸ਼ੀਆ ਕੱਪ ਤੋਂ ਵਾਪਸੀ ਕੀਤੀ ਅਤੇ ਸ਼ਾਨਦਾਰ ਬੱਲੇਬਾਜ਼ੀ ਕਰਕੇ ਦਿਖਾਇਆ ਕਿ ਉਸ ਨੇ ਇਸ ਸਾਲ ਆਪਣੀ ਸੱਟ ਤੋਂ ਉਭਰਦੇ ਹੋਏ ਆਪਣੇ ਗੇਮਿੰਗ ਹੁਨਰ 'ਤੇ ਕਾਫੀ ਕੰਮ ਕੀਤਾ ਹੈ।</p> <p><strong>ਏਸ਼ੀਆ ਕੱਪ ਤੋਂ ਸ਼ਾਨਦਾਰ ਵਾਪਸੀ</strong></p> <p>ਕੇਐੱਲ ਰਾਹੁਲ ਨੇ <a title=\"ਏਸ਼ੀਆ ਕੱਪ\" href=\"https://punjabi.abplive.com/topic/asia-cup\" data-type=\"interlinkingkeywords\">ਏਸ਼ੀਆ ਕੱਪ</a> 'ਚ ਕਈ ਸ਼ਾਨਦਾਰ ਪਾਰੀਆਂ ਖੇਡੀਆਂ ਅਤੇ ਇਸ ਤੋਂ ਬਾਅਦ ਵਿਸ਼ਵ ਕੱਪ 'ਚ ਵੀ ਉਨ੍ਹਾਂ ਨੇ ਨਾ ਸਿਰਫ ਨੰਬਰ-5 ਦੀ ਭੂਮਿਕਾ ਨੂੰ ਬਹੁਤ ਵਧੀਆ ਤਰੀਕੇ ਨਾਲ ਨਿਭਾਇਆ ਸਗੋਂ ਵਿਕਟਕੀਪਿੰਗ ਨਾਲ ਵੀ ਕਮਾਲ ਕਰ ਦਿੱਤਾ। ਕੇਐਲ ਰਾਹੁਲ ਵੀ ਕਪਤਾਨ ਨੂੰ ਡੀਆਰਐਸ ਲੈਣ ਲਈ ਬਿਲਕੁਲ ਸਹੀ ਸਲਾਹ ਦਿੰਦੇ ਹਨ।</p> <p>ਉਂਝ, ਜੇਕਰ ਸੈਂਚੁਰੀਅਨ ਵਿੱਚ ਚੱਲ ਰਹੇ ਟੈਸਟ ਮੈਚ ਦੀ ਗੱਲ ਕਰੀਏ ਤਾਂ ਭਾਰਤ ਨੇ ਕੇਐਲ ਰਾਹੁਲ ਦੇ ਸੈਂਕੜੇ ਦੀ ਮਦਦ ਨਾਲ ਪਹਿਲੀ ਪਾਰੀ ਵਿੱਚ ਕੁੱਲ 245 ਦੌੜਾਂ ਬਣਾਈਆਂ ਸਨ, ਪਰ ਦੂਜੇ ਦਿਨ ਦੀ ਖੇਡ ਖਤਮ ਹੋਣ ਤੱਕ ਦੱਖਣੀ ਅਫਰੀਕਾ ਨੇ 256 ਦੌੜਾਂ ਬਣਾ ਲਈਆਂ ਸਨ। ਨੇ 5 ਵਿਕਟਾਂ ਗੁਆ ਦਿੱਤੀਆਂ ਸਨ। ਹਰ ਵਾਰ ਦੀ ਤਰ੍ਹਾਂ ਇਸ ਵਾਰ ਵੀ ਦੱਖਣੀ ਅਫਰੀਕਾ ਦੇ ਡੀਨ ਐਲਗਰ ਇਕ ਵਾਰ ਫਿਰ ਚੱਟਾਨ ਵਾਂਗ ਕ੍ਰੀਜ਼ 'ਤੇ ਡਟੇ ਹੋਏ ਹਨ ਅਤੇ 140 ਦੌੜਾਂ ਬਣਾ ਕੇ ਅਜੇਤੂ ਹਨ।</p>","content":"IND vs SA 1st Test: ਦੱਖਣੀ ਅਫਰੀਕਾ ਦੇ ਸੈਂਚੁਰੀਅਨ 'ਚ ਲਗਾਤਾਰ ਦੂਜਾ ਸੈਂਕੜਾ ਲਗਾਉਣ ਵਾਲੇ ਟੀਮ ਇੰਡੀਆ ਦੇ ਸਟਾਰ ਬੱਲੇਬਾਜ਼ ਕੇਐੱਲ ਰਾਹੁਲ ਨੇ ਸੋਸ਼ਲ ਮੀਡੀਆ 'ਤੇ ਟ੍ਰੋਲਸ ਨਾਲ ਨਜਿੱਠਣ ਦੇ ਆਪਣੇ ਤਰੀਕੇ ਬਾਰੇ ਖੁੱਲ੍ਹ ਕੇ ਗੱਲ ਕੀਤੀ। ਉਸ ਨੇ ਜ਼ੋਰ ਦੇ ਕੇ ਕਿਹਾ ਕਿ ਕਿਸੇ ਹੋਰ ਖਿਡਾਰੀ ਵਾਂਗ ਵਹਬ ਵੀ ਨਕਾਰਾਤਮਕ ਟਿੱਪਣੀਆਂ ਤੋਂ ਪ੍ਰਭਾਵਿਤ ਹੁੰਦਾ ਹੈ। ਰਾਹੁਲ ਨੇ ਕਿਹਾ ਕਿ ਇਸ ਸਾਲ ਦੀ ਸ਼ੁਰੂਆਤ 'ਚ ਸੱਟ ਨੇ ਉਸ ਨੂੰ ਆਪਣੇ 'ਦਿਮਾਗ' 'ਤੇ ਕੰਮ ਕਰਨ ਦਾ ਸਮਾਂ ਦਿੱਤਾ ਅਤੇ ਉਸ ਨੇ ਮਹਿਸੂਸ ਕੀਤਾ ਕਿ ਬੱਲੇ ਨੂੰ ਗੱਲ ਕਰਨ ਦੇਣਾ ਸੋਸ਼ਲ ਮੀਡੀਆ 'ਤੇ ਨਕਾਰਾਤਮਕਤਾ ਨੂੰ ਦੂਰ ਕਰਨ ਦਾ ਵਧੀਆ ਤਰੀਕਾ ਹੈ। ਸਾਲ ਦੀ ਸ਼ੁਰੂਆਤ 'ਚ ਬਾਹਰ ਹੋ ਗਏ ਸੀ ਸੈਂਚੁਰੀਅਨ ਵਿੱਚ ਦੱਖਣੀ ਅਫਰੀਕਾ ਅਤੇ ਭਾਰਤ ਵਿਚਾਲੇ ਬਾਕਸਿੰਗ ਡੇ ਟੈਸਟ ਦੇ ਦੂਜੇ ਦਿਨ ਸ਼ਾਨਦਾਰ ਸੈਂਕੜਾ ਲਗਾਉਣ ਤੋਂ ਬਾਅਦ ਇਹ ਖੁਲਾਸਾ ਕੀਤਾ ਹੈ। ਕੇਐੱਲ ਰਾਹੁਲ ਇਸ ਸਾਲ ਦੀ ਸ਼ੁਰੂਆਤ 'ਚ ਆਸਟ੍ਰੇਲੀਆ ਖਿਲਾਫ ਬਾਰਡਰ-ਗਾਵਸਕਰ ਟਰਾਫੀ ਦੌਰਾਨ ਅੱਧ ਵਿਚਾਲੇ ਹੀ ਆਊਟ ਹੋ ਗਏ ਸਨ। ਇਸ ਤੋਂ ਬਾਅਦ ਕੇਐੱਲ ਰਾਹੁਲ ਨੇ ਹੁਣ ਟੈਸਟ ਫਾਰਮੈਟ 'ਚ ਵਾਪਸੀ ਕੀਤੀ ਹੈ ਅਤੇ ਤੁਰੰਤ ਹੀ ਸ਼ਾਨਦਾਰ ਸੈਂਕੜਾ ਲਗਾਇਆ ਹੈ। googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); ਤੁਹਾਨੂੰ ਦੱਸ ਦੇਈਏ ਕਿ ਕੇਐਲ ਰਾਹੁਲ ਵੀ ਆਈਪੀਐਲ ਦੌਰਾਨ ਜ਼ਖਮੀ ਹੋ ਗਏ ਸਨ ਅਤੇ ਫਿਰ ਕਈ ਮਹੀਨਿਆਂ ਤੱਕ ਕ੍ਰਿਕਟ ਨਹੀਂ ਖੇਡ ਸਕੇ ਸਨ। ਇਸ ਕਾਰਨ ਉਹ ਵਿਸ਼ਵ ਟੈਸਟ ਚੈਂਪੀਅਨਸ਼ਿਪ ਟੀਮ ਦਾ ਹਿੱਸਾ ਵੀ ਨਹੀਂ ਸੀ। ਹਾਲਾਂਕਿ, ਉਸ ਨੇ ਏਸ਼ੀਆ ਕੱਪ ਤੋਂ ਵਾਪਸੀ ਕੀਤੀ ਅਤੇ ਸ਼ਾਨਦਾਰ ਬੱਲੇਬਾਜ਼ੀ ਕਰਕੇ ਦਿਖਾਇਆ ਕਿ ਉਸ ਨੇ ਇਸ ਸਾਲ ਆਪਣੀ ਸੱਟ ਤੋਂ ਉਭਰਦੇ ਹੋਏ ਆਪਣੇ ਗੇਮਿੰਗ ਹੁਨਰ 'ਤੇ ਕਾਫੀ ਕੰਮ ਕੀਤਾ ਹੈ। ਏਸ਼ੀਆ ਕੱਪ ਤੋਂ ਸ਼ਾਨਦਾਰ ਵਾਪਸੀ ਕੇਐੱਲ ਰਾਹੁਲ ਨੇ ਏਸ਼ੀਆ ਕੱਪ 'ਚ ਕਈ ਸ਼ਾਨਦਾਰ ਪਾਰੀਆਂ ਖੇਡੀਆਂ ਅਤੇ ਇਸ ਤੋਂ ਬਾਅਦ ਵਿਸ਼ਵ ਕੱਪ 'ਚ ਵੀ ਉਨ੍ਹਾਂ ਨੇ ਨਾ ਸਿਰਫ ਨੰਬਰ-5 ਦੀ ਭੂਮਿਕਾ ਨੂੰ ਬਹੁਤ ਵਧੀਆ ਤਰੀਕੇ ਨਾਲ ਨਿਭਾਇਆ ਸਗੋਂ ਵਿਕਟਕੀਪਿੰਗ ਨਾਲ ਵੀ ਕਮਾਲ ਕਰ ਦਿੱਤਾ। ਕੇਐਲ ਰਾਹੁਲ ਵੀ ਕਪਤਾਨ ਨੂੰ ਡੀਆਰਐਸ ਲੈਣ ਲਈ ਬਿਲਕੁਲ ਸਹੀ ਸਲਾਹ ਦਿੰਦੇ ਹਨ। ਉਂਝ, ਜੇਕਰ ਸੈਂਚੁਰੀਅਨ ਵਿੱਚ ਚੱਲ ਰਹੇ ਟੈਸਟ ਮੈਚ ਦੀ ਗੱਲ ਕਰੀਏ ਤਾਂ ਭਾਰਤ ਨੇ ਕੇਐਲ ਰਾਹੁਲ ਦੇ ਸੈਂਕੜੇ ਦੀ ਮਦਦ ਨਾਲ ਪਹਿਲੀ ਪਾਰੀ ਵਿੱਚ ਕੁੱਲ 245 ਦੌੜਾਂ ਬਣਾਈਆਂ ਸਨ, ਪਰ ਦੂਜੇ ਦਿਨ ਦੀ ਖੇਡ ਖਤਮ ਹੋਣ ਤੱਕ ਦੱਖਣੀ ਅਫਰੀਕਾ ਨੇ 256 ਦੌੜਾਂ ਬਣਾ ਲਈਆਂ ਸਨ। ਨੇ 5 ਵਿਕਟਾਂ ਗੁਆ ਦਿੱਤੀਆਂ ਸਨ। ਹਰ ਵਾਰ ਦੀ ਤਰ੍ਹਾਂ ਇਸ ਵਾਰ ਵੀ ਦੱਖਣੀ ਅਫਰੀਕਾ ਦੇ ਡੀਨ ਐਲਗਰ ਇਕ ਵਾਰ ਫਿਰ ਚੱਟਾਨ ਵਾਂਗ ਕ੍ਰੀਜ਼ 'ਤੇ ਡਟੇ ਹੋਏ ਹਨ ਅਤੇ 140 ਦੌੜਾਂ ਬਣਾ ਕੇ ਅਜੇਤੂ ਹਨ।","pubDate":"2023-12-28 03:24:21","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/12/28/506a965c01416c472ef0d999f1aa92141703733785917709_original.jpg","source_id":"abplive","source_priority":10959,"country":["india"],"category":["sports"],"language":"punjabi"},{"article_id":"54fcd17e5c681809f2a8045a8d86af6d","title":"'कुछ दिन पहले यही लोग देते थे गाली', शतक लगाते ही केएल राहुल का बड़ा बयान","link":"https://www.indiatv.in/sports/cricket/ind-vs-sa-kl-rahul-statement-after-making-century-against-south-africa-in-boxing-day-test-2023-12-28-1011652","keywords":null,"creator":null,"video_url":null,"description":"IND vs SA: भारत और साउथ अफ्रीका के बीच पहले टेस्ट में केएल राहुल ने अपने शतक से टीम इंडिया को एक सम्मानजनक स्कोर तक पहुंचाया। इस पारी के बाद उन्होंने एक बड़ा बयान दिया है।","content":"भारत और साउथ अफ्रीका के बीच दो मैचों की टेस्ट सीरीज का पहला मैच खेला जा रहा है। इस मैच में टीम इंडिया पहले बल्लेबाजी करते हुए 245 रन के स्कोर पर ऑलआउट हो गई। इसके बाद साउथ अफ्रीका ने 5 विकेट खोकर 256 रन बना लिए हैं। साउथ अफ्रीका की टीम के पास इस वक्त 11 रनों की लीड हासिल है। इस मैच में भारतीय टीम अपनी पहली पारी के दौरान काफी मुश्किल में नजर आ रही थी, लेकिन केएल राहुल ने एक शानदार पारी खेलकर टीम इंडिया ने मुश्किल से निकाला और भारत को एक सम्मानजनक स्कोर कर पहुंचाया। साउथ अफ्रीका के खिलाफ बॉक्सिंग डे टेस्ट मैच में के दौरान केएल राहुल ने शानदार पारी खेली। उन्होंने 137 गेंदों पर 101 रन बनाए। केएल राहुल ने इस पारी के बाद एक बड़ा बयान दिया है। उन्होंने कहा कि आज मैंने शतक बनाया है इसलिए लोग तारीफ कर रहे हैं। 3-4 महीने पहले, हर कोई मुझे गाली दे रहा था। यह खेल का हिस्सा है, लेकिन मैं यह नहीं कह सकता कि इसका आप पर असर नहीं पड़ता। ऐसा होता है। जितनी जल्दी आपको यह एहसास होगा कि इससे दूर रहना आपके खेल के लिए अच्छा है उतना ही बेहतर होगा। आपको बता दें कि केएल राहुल कुछ महीने पहले तक बेहद खराब फॉर्म से गुजर रहे थे। इंजरी और खराब फॉर्म के कारण उन्हें सोशल मीडिया पर जमकर ट्रोलिंग का सामना करना पड़ रहा था। केएल राहुल ने जैसे ही इंजरी के बाद टीम इंडिया में कमबैक किया उस दौरान भी कुछ लोगों ने उनके वर्ल्ड कप टीम में होने पर कई सवाल खड़े किए थे। केएल राहुल ने उन सभी का जवाब वर्ल्ड कप में अपने शानदार फॉर्म से दिया। अब टेस्ट क्रिकेट में भी केएल राहुल ने दमदार वापसी कर ली है। जिसके बाद उनका ये बड़ा बयान सामने आया है। बॉक्सिंग डे टेस्ट में केएल राहुल ने शतक लगाते ही कई बड़े रिकॉर्ड अपने नाम कर लिए हैं। टीम इंडिया ने इससे पहले पिछली बार साल 2021 में साउथ अफ्रीका के ही खिलाफ बॉक्सिंग डे टेस्ट मैच खेला था। इस मुकाबले में भी केएल राहुल ने शतक लगाया था। बॉक्सिंग डे टेस्ट में बैक टू बैक शतक लगाने वाले वह दुनिया के दूसरे खिलाड़ी है। इसके अलावा सेंचुरियन में किसी बाहरी बल्लेबाज द्वारा सबसे ज्यादा टेस्ट रन बनाने के मामले में भी केएल राहुल पहले स्थान पर पहुंच गए हैं।","pubDate":"2023-12-28 03:18:00","image_url":"https://resize.indiatv.in/resize/715_-/2023/12/travis-1-1703732976.jpg","source_id":"indiatv","source_priority":216441,"country":["india"],"category":["sports"],"language":"hindi"},{"article_id":"dddb49e603700cdbd7e5ab977372fafb","title":"Second Test delayed by third umpire stuck in MCG lift","link":"https://www.perthnow.com.au/sport/cricket/second-test-delayed-by-third-umpire-stuck-in-mcg-lift-c-13044067","keywords":null,"creator":["Shayne Hope"],"video_url":null,"description":"Third umpire Richard Illingworth was stuck in a lift at the MCG, causing a seven-minute delay to the start of play in the second Test after lunch on day three.","content":"Play was held up in bizarre circumstances during the second Australia-Pakistan Test at the MCG because the third umpire got stuck in a lift. Players returned to the middle of the iconic venue after the lunch break on Thursday, in time for the scheduled 1.25pm start to the second session. But in unusual scenes, the two central umpires wouldn't allow a ball to be bowled because experienced English official Richard Illingworth was unable to return to his post in the grandstand. It left Australian batters David Warner and Steve Smith waiting to resume their innings, with the hosts stuck on 2-6 in their second dig with an overall lead of 60. Cricket Australia and the MCG both produced light-hearted responses to the peculiar delay, which lasted seven minutes. \"The game is delayed because the third umpire ... is stuck in the lift,\" Cricket Australia's social media arm posted on X, formerly known as Twitter. The MCG was quick to reply: \"Sorry.\" The banter continued when Illingworth eventually made his way back to his seat by 1.32pm, with Cricket Australia posting: \"A wild Richard Illingworth appeared!\" Warner (six) and Travis Head (zero) fell to successive Mir Hamza deliveries at the start of the third over after play resumed, leaving Australia reeling at 4-16. Earlier, a scheduled 10am start to day three was pushed back to 10.45am because of rain.","pubDate":"2023-12-28 03:17:01","image_url":"https://images.perthnow.com.au/publication/C-13044067/3cf2a247f17de887f81a217d965055b5c746e16e-16x9-x0y0w1280h720.jpg","source_id":"perthnow","source_priority":49457,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"5b23d2566e537a2052bc566c647c634a","title":"\"Jo Bolna...\": Rahul To Trolls After '1 Of Top 10 Tons' In Indian Cricket","link":"https://sports.ndtv.com/cricket/jo-bolna-hoga-kl-rahul-shuts-down-trolls-after-one-of-the-top-10-centuries-in-indian-test-cricket-4753870","keywords":null,"creator":null,"video_url":null,"description":"KL Rahul scored 101 vs South Africa in the 1st Test. Sunil Gavaskar hailed it as one of the top 10 centuries in Indian Test cricket history","content":"Don't you ever feel retorting to trolls who are merciless and at times downright out of line when they criticise you? KL Rahul was asked. \"What will I achieve (by) doing that?\" he countered. \"Logon ko jo bolna hoga bolenge (People will say what they want to). If you are a public performer, performance is your only yardstick to stay away from criticism. And about social media, the farther you stay away from it, the happier you will be,\" a composed Rahul told media persons after scoring what Sunil Gavaskar termed as one of the 10 best hundreds ever hit by an Indian batter. \"If he (Gavaskar) has said that, it's a huge compliment,\" he said post his stupendous 137-ball 101. Rahul said the time away from the game due to injury helped him work on his personality. \"When you play international cricket, you are not only challenged as a player but also as a person because you have a personality. So, when I was away from the game, I worked on myself as a person. Obviously, there were people to help me,\" he said. He felt that social media comments did affect a person but one needed to know where to draw a line. \"One who is hailing me today was abusing me some months back. Anyone who says he isn't affected by comments on social media is lying. But the more you stay away, the better it is for your mindset,\" he said. South Africa have their nose ahead and Rahul said it has become easier to bat. Advertisement \"Today in the morning, when we'd batted for those 7-8 overs, I felt the wicket had eased a bit. But it can change here quickly with cracks opening out.\" Rahul said Centurion wicket never allows a batter to \"feel set\" and at times one can score freely and at times one can't. The key to batting in the middle-order and playing long is not to plan too much, reckoned the 31-year-old. \"You can't plan that much. There's a game situation that tells you how to play in that time and moment. You have to remain free and empty. You need to be aware that you might have to bat with tail,\" he said.","pubDate":"2023-12-28 03:15:47","image_url":"https://c.ndtvimg.com/2023-12/br14m33o_kl-rahul-century-afp_625x300_27_December_23.jpg","source_id":"ndtv","source_priority":1204,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"7535b2de2abfb61e8b0dc500b7a302ca","title":"'उसकी कलाई बहुत मजबूत हैं', दक्षिण अफ्रीकी दिग्‍गज ने की बुमराह की तारीफ","link":"https://hindi.news18.com/cricket/south-africas-veteran-fast-bowler-makhaya-ntini-praises-team-indias-jasprit-bumrahs-bowling-skills-7936127.html","keywords":null,"creator":null,"video_url":null,"description":"दक्षिण अफ्रीका के पूर्व दिग्‍गज तेज गेंदबाज मखाया एनटिनी भी जसप्रीत बुमराह के गेंदबाजी कौशल के कायल हैं.ए‍नटिनी का मानना है कि बुमराह के भारतीय टीम ने न तो होने से वह पहले जैसी बॉलिंग यूनिट नहीं रह जाती. सेंचुरियन टेस्‍ट में वे भारतीय टीम के अब तक के सबसे अच्‍छे बॉलर साबित हुए हैं.","content":"मखाया ए‍नटिनी का मानना है, जसप्रीत बुमराह के भारतीय टीम ने न तो होने से वह पहले जैसी बॉलिंग यूनिट नहीं रह जाती.Jasprit Bumrah/Instagram नई दिल्‍ली. जसप्रीत बुमराह (Jasprit Bumrah) को क्रिकेट के सभी फॉर्मेटों में भारतीय टीम का सर्वश्रेष्‍ठ बॉलर माना जा सकता है.कई पूर्व क्रिकेटर तो उन्‍हें मौजूदा दौर के दुनिया के सर्वश्रेष्‍ठ गेंदबाज की श्रेणी में रखते हैं.टेस्‍ट क्रिकेट हो, वनडे या फिर टी20I, हर फॉर्मेट में बुमराह न केवल विकेट हासिल करते हैं बल्कि बेहद किफायती भी साबित होते हैं. गेंदबाज के तौर पर उनके पास अच्‍छे खासे वेरिएशंस हैं और सटीक यॉर्कर व स्‍लोअर बॉल से वे विपक्षी बैटरों की जमकर परीक्षा लेते हैं. दक्षिण अफ्रीका के पूर्व दिग्‍गज तेज गेंदबाज मखाया एनटिनी (Makhaya Ntini) भी बुमराह के गेंदबाजी कौशल के कायल हैं.ए‍नटिनी का मानना है कि बुमराह के भारतीय टीम ने न तो होने से वह पहले जैसी बॉलिंग यूनिट नहीं रह जाती. ‘ अपने’ मैदानों पर भारत के खिलाफ हमेशा दहाड़ता है यह दक्षिण अफ्रीकी बैटर, डिविलियर्स से भी ऊंचा औसत ‘सिर के ऊपर से रिलीज करते हैं गेंद’ दक्षिण अफ्रीका के लिए टेस्‍ट में 390 और वनडे में 266 विकेट हासिल करने वाले एनटिनी ने कहा, ‘ऐसा लगता है कि बुमराह की कलाइयां बेहद मजबूत हैं. ‘इंडिया टुडे के साथ बातचीत में बुमराह की गेंदबाजी का बारीक विश्‍लेषण करते हुए उन्‍होंने कहा, ‘देखिए वह (बुमराह) गेंद को कहां रिलीज करता है. वह गेंद को अपने सिर के ऊपर से छोड़ते हैं और संभवत: इसी कारण गेंद को अंदर लाने के लिए एंगल हासिल करने में सफल होते हैं.वह ऐसी गेंद भी फेंकते हैं जो पिच करने के बाद सीधी रहती हैं.खास बात यह है कि उनका बॉलिंग एक्शन हमेशा एक जैसा होता है,यह बेहतरीन है.’ पांच बैटर जड़ चुके डेब्‍यू और आखिरी टेस्‍ट में शतक, एक भारतीय भी शामिल एनटिनी बोले, उनकी यॉर्कर टारगेट मिस नहीं करतीं बुमराह की यॉर्कर की खास तौर पर तारीफ करते हुए दक्षिण अफ्रीका के इस पूर्व तेज गेंदबाज ने कहा, ‘उनकी यॉर्कर टारगेट को मिस नहीं करतीं. यह वाकई ऐसी चीजें हैं जिनका हर कोई लुत्‍फ उठा सकता है.बुमराह के टीम में न होने पर भारत पहले जैसी टीम नहीं रह जाती.’ बुमराह की बात करें तो वे जुलाई 2022 के बाद अपना अपना पहला टेस्‍ट खेल रहे हैं. दक्षिण अफ्रीका के खिलाफ (India Vs South Africa) सेंचुरियन टेस्‍ट में वे भारतीय टीम के अब तक के सबसे अच्‍छे बॉलर साबित हुए हैं और गिरे पांच में से दो विकेट उन्‍होंने हासिल किए हैं. Video: विराट कोहली ने आजमाया अंग्रेजों का टोटका, अगली गेंद पर गिरा विकेट बैक इंजुरी के कारण सर्जरी कराने के बाद उन्‍होंने इंटरनेशनल क्रिकेट में वापसी की है. वर्ल्‍डकप 2023 में भी शमी के बाद बुमराह भारत के सबसे कामयाब बॉलर (11 मैचों में 20 विकेट, औसत 18.65)रहे थे. . Tags: Ind vs sa , India vs South Africa , Jasprit Bumrah दुनिया का सबसे पुराना शहर है बेहद खूबसूरत, कभी पेरिस से होती थी तुलना, जानिए कैसी है वहां की लाइफ 3 साल के इस बच्चे ने पूरे एशिया में मचा रखी है धूम... कर रहा लाखों की कमाई, अब वेब सीरीज में भी दिखेगा कौन है 36 साल की वो एक्ट्रेस, जिसने किया इंडस्ट्री के काले सच का खुलासा, काम को तरस रही खूबसूरत हीरोइन ने बताई आपबीती लाइव ब्लॉग 3 days ago 4 days ago 7 days ago 7 days ago","pubDate":"2023-12-28 03:14:41","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/12/Jasprit-Bumrah-2023-12-1796a438690d82f531e9775c84fcb154-3x2.jpg","source_id":"hindinews18","source_priority":6509,"country":["india"],"category":["sports"],"language":"hindi"},{"article_id":"1226a652cad0f1305002408ab42d1fef","title":"Second Test delayed by third umpire stuck in MCG lift","link":"https://www.blayneychronicle.com.au/story/8471742/second-test-delayed-by-third-umpire-stuck-in-mcg-lift/?src=rss","keywords":null,"creator":["Shayne Hope"],"video_url":null,"description":null,"content":"Play was held up in bizarre circumstances during the second Australia-Pakistan Test at the MCG because the third umpire got stuck in a lift. / (min cost $ 8 ) Login or signup to continue reading Players returned to the middle of the iconic venue after the lunch break on Thursday, in time for the scheduled 1.25pm start to the second session. But in unusual scenes, the two central umpires wouldn't allow a ball to be bowled because experienced English official Richard Illingworth was unable to return to his post in the grandstand. It left Australian batters David Warner and Steve Smith waiting to resume their innings, with the hosts stuck on 2-6 in their second dig with an overall lead of 60. Cricket Australia and the MCG both produced light-hearted responses to the peculiar delay, which lasted seven minutes. \"The game is delayed because the third umpire ... is stuck in the lift,\" Cricket Australia's social media arm posted on X, formerly known as Twitter. The MCG was quick to reply: \"Sorry.\" The banter continued when Illingworth eventually made his way back to his seat by 1.32pm, with Cricket Australia posting: \"A wild Richard Illingworth appeared!\" Warner (six) and Travis Head (zero) fell to successive Mir Hamza deliveries at the start of the third over after play resumed, leaving Australia reeling at 4-16. Earlier, a scheduled 10am start to day three was pushed back to 10.45am because of rain. Advertisement Sign up for our newsletter to stay up to date. We care about the protection of your data. Read our . Advertisement","pubDate":"2023-12-28 03:14:14","image_url":"https://www.blayneychronicle.com.au/images/transform/v1/crop/frm/silverstone-feed-data/10f1740b-67e9-4dc6-958e-44fb97c5361e.jpg/r0_75_800_526_w600_h338_fmax.jpg","source_id":"blayneychronicle","source_priority":17177086,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"cf4126ea7e65fe2e8ecab682a1159539","title":"Second Test delayed by third umpire stuck in MCG lift","link":"https://www.busseltonmail.com.au/story/8471742/second-test-delayed-by-third-umpire-stuck-in-mcg-lift/?src=rss","keywords":null,"creator":null,"video_url":null,"description":null,"content":"Play was held up in bizarre circumstances during the second Australia-Pakistan Test at the MCG because the third umpire got stuck in a lift. Players returned to the middle of the iconic venue after the lunch break on Thursday, in time for the scheduled 1.25pm start to the second session. But in unusual scenes, the two central umpires wouldn't allow a ball to be bowled because experienced English official Richard Illingworth was unable to return to his post in the grandstand. It left Australian batters David Warner and Steve Smith waiting to resume their innings, with the hosts stuck on 2-6 in their second dig with an overall lead of 60. Cricket Australia and the MCG both produced light-hearted responses to the peculiar delay, which lasted seven minutes. \"The game is delayed because the third umpire ... is stuck in the lift,\" Cricket Australia's social media arm posted on X, formerly known as Twitter. The MCG was quick to reply: \"Sorry.\" The banter continued when Illingworth eventually made his way back to his seat by 1.32pm, with Cricket Australia posting: \"A wild Richard Illingworth appeared!\" Warner (six) and Travis Head (zero) fell to successive Mir Hamza deliveries at the start of the third over after play resumed, leaving Australia reeling at 4-16. Earlier, a scheduled 10am start to day three was pushed back to 10.45am because of rain. Australian Associated Press","pubDate":"2023-12-28 03:14:14","image_url":"https://www.busseltonmail.com.au/images/transform/v1/crop/frm/silverstone-feed-data/10f1740b-67e9-4dc6-958e-44fb97c5361e.jpg/r0_75_800_526_w600_h338_fmax.jpg","source_id":"busseltonmail","source_priority":6251187,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"52048fe786aa89ec163de22282ebde57","title":"IND vs SA 1st Test, Day 3 Live Streaming: এলগারের শতকে এগিয়ে প্রোটিয়া, কীভাবে থামাবে রোহিতরা; সরাসরি দেখুন","link":"https://bangla.latestly.com/sports/cricket/ind-vs-sa-1st-test-day-3-live-streaming-275425.html","keywords":null,"creator":null,"video_url":null,"description":"ভারত বনাম দক্ষিণ আফ্রিকা, প্রথম টেস্ট তৃতীয় দিনের ম্যাচ শুরু হবে ভারতীয় সময় দুপুর ১ঃ৩০টায়","content":"আজ ভারত তাদের কঠিন পরীক্ষায় জয় পেতে প্রস্তুত, কিন্তু বরাবরের মতো দক্ষিণ আফ্রিকাকে হারানো সহজ হবে না। দক্ষিণ আফ্রিকায় কখনও টেস্ট সিরিজ জেতেনি টিম ইন্ডিয়া। খারাপ আলোয় দ্বিতীয় দিনে তাড়াতাড়ি স্টাম্প পড়ে যায়। দক্ষিণ আফ্রিকা ৫ উইকেটে ২৫৬ রান তুলে ভারতের থেকে ১১ রানে এগিয়ে রয়েছে। ১৪তম টেস্ট সেঞ্চুরি করে ডিন এলগার (Dean Elgar) তার বিদায়ী সিরিজকে আরও স্মরণীয় করেন। অভিষেকে অর্ধশতক করে ডেভিড বেডিংহামের (David Bedingham) দ্বিতীয় দিনে এলগারের সঙ্গে সেঞ্চুরির জুটি গড়ে দক্ষিণ আফ্রিকাকে এগিয়ে যেতে সাহায্য করে। প্রায় ৩০ ওভার উইকেটহীন থাকার পর তাদের ১৩১ রানের পার্টনারশিপ ভাঙেন মহম্মদ সিরাজ (Mohammed Siraj)। শেষ পর্যন্ত বেডিংহামকে ফেরানোর পরের ওভারেই কাইল ভেরেইনকে (Kyle Verreynne) আউট করে টেস্ট ক্রিকেটের খাতা খোলেন প্রসিদ্ধ কৃষ্ণা। সেঞ্চুরিয়নের সুপারস্পোর্টস পার্কে গতকাল দক্ষিণ আফ্রিকার অধিনায়ক টেম্বা বাভুমা টসে জিতে বোলিং করার সিদ্ধান্ত নেন। Bad light brings an end to Day 2. South Africa reach 256/5, with a lead of 11 runs. Scorecard ▶️ | — BCCI (@BCCI) রোহিত শর্মা (অধিনায়ক), যশস্বী জয়সওয়াল, শুভমন গিল, বিরাট কোহলি, শ্রেয়স আইয়ার, কেএল রাহুল (উইকেটরক্ষক), রবিচন্দ্রন অশ্বিন, শার্দুল ঠাকুর, জসপ্রীত বুমরাহ, মহম্মদ সিরাজ, প্রসিদ্ধ কৃষ্ণা। ডিন এলগার, এডেন মার্করাম, টনি ডি জরজি, টেম্বা বাভুমা (অধিনায়ক), কিগান পিটারসেন, ডেভিড বেডিংহাম, কাইল ভেরেইন (উইকেটরক্ষক), মার্কো জানসেন, জেরাল্ড কোয়েটজি, কাগিসো রাবাডা, নান্দ্রে বার্গার। ২৮ ডিসেম্বর সেঞ্চুরিয়নের সুপারস্পোর্টস পার্কে (SuperSport Park, Centurion) প্রথম টেস্ট তৃতীয় দিনের ম্যাচে মুখোমুখি হবে ভারত বনাম দক্ষিণ আফ্রিকা। ভারত বনাম দক্ষিণ আফ্রিকা, প্রথম টেস্ট তৃতীয় দিনের ম্যাচ শুরু হবে ভারতীয় সময় দুপুর ১ঃ৩০টায়। সরাসরি টিভিতে ভারত বনাম দক্ষিণ আফ্রিকা, প্রথম টেস্ট তৃতীয় দিনের ম্যাচ ভারতে দেখবেন স্টার স্পোর্টসে নেটওয়ার্কে। সরাসরি অনলাইনে ভারত বনাম দক্ষিণ আফ্রিকা, প্রথম টেস্ট তৃতীয় দিনের ম্যাচ দেখতে পাবেন ডিজনি+ হটস্টার (Disney+ Hotstar) অ্যাপে।","pubDate":"2023-12-28 03:48:41","image_url":"https://bnst1.latestly.com/wp-content/uploads/2023/12/49-6-380x214.jpg","source_id":"latestly","source_priority":5523,"country":["india"],"category":["sports"],"language":"bengali"},{"article_id":"35f61238e895923a0d9343e24ff9f9db","title":"Channel Seven star Mel McLaughlin gets caught up in BIZARRE situation with cricket umpire that delayed play in the Boxing Day Test","link":"https://www.dailymail.co.uk/sport/cricket/article-12905811/Mel-McLaughlin-caught-lift-cricket-umpire-delayed-play-Boxing-Day-Test-MCG-Channel-Seven-Richard-Illingworth.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Cricket fans were mystified when play in the session after lunch at the MCG on Thursday was held up for several minutes - but McLaughlin soon gave a first-hand account of what went wrong.","content":"Channel Seven star Mel McLaughlin gets caught up in BIZARRE situation with cricket umpire that delayed play in the Boxing Day Test Commentator explained freakish occurrence in commentary Play was delayed after the lunch break at the MCG on Thursday News surfaced with Australia struggling badly in their second innings By Shayne Bugden For Daily Mail Australia and Shayne Hope For Australian Associated Press Published: 22:44 EST, 27 December 2023 | Updated: 22:48 EST, 27 December 2023 e-mail View comments Sports commentator Mel McLaughlin has revealed she was at the centre of a freakish incident with a cricket umpire that forced play to be delayed at the Boxing Day Test on Thursday afternoon. The Channel Seven star was catching a lift from the MCG's underground car park with third umpire Richard Illingworth when the elevator malfunctioned, trapping them and eight other people and forcing her to use her phone to call for help. Play in the session after lunch was held up as a result of the scare, with McLaughlin describing what happened inside the lift when she joined her co-commentators Justin Langer and James Brayshaw afterwards. McLaughlin (pictured left with fellow Seven star Ricky Ponting) was trapped in the lift with a very 'distracted' umpire as play had to be held up at the MCG on Thursday 'We [she and Illingworth] were having a bit of a chat ... and the doors open and then close and then didn't move again,' she said. 'He's standing in the corner and he went, 'Do you have a phone? Can you please call someone and let them know I'm in the lift, I'm going to be a little bit late?' 'So yeah, everyone got to work and we got freed, I don't know, 10 minutes later. Sorry everyone!' Brayshaw asked what the conversation was like in the lift and McLaughlin replied, 'There were 10 of us in there, so that was one thing. There was a lovely family in there, a young baby, and there was a guy eating hot chips that we were all trying to get a bit of. 'But the rest of the time, our EP [executive producer] Jonesy is on the phone, Sam, our production manager, she's also trying to help things move along quickly. Pip, the make-up artist - we're all just trying to keep things calm and keep Richard talking and being entertained because we knew he was a little bit distracted and knew he had to get out there. 'He ran quite quickly straight upstairs!' McLaughlin joined her fellow commentators, cricket legend Justin Langer (centre) and James Brayshaw (right) to explain what happened inside the lift Third umpire Richard Illingworth (pictured) 'ran quite quickly straight upstairs' once he was freed from the lift, McLaughlin said The Seven star was accompanied by her executive producer and a make-up artist from the broadcaster when the lift broke down Play had to be delayed because the third umpire - while not taking up a position on the field - sits in a broadcast booth and is responsible for making the final call on dismissals that are referred to them by the two officials on the ground. They can also serve as an on-field umpire in case of injury or illness. Cricket Australia and the MCG both produced light-hearted responses to the peculiar delay, which lasted seven minutes. 'The game is delayed because the third umpire ... is stuck in the lift,' Cricket Australia's social media arm posted on X, formerly known as Twitter. The MCG was quick to reply: 'Sorry.' The banter continued when Illingworth eventually made his way back to his seat by 1.32pm, with Cricket Australia posting: 'A wild Richard Illingworth appeared!' McLaughlin delivered the news just as Australia were struggling badly against a rampant Pakistan bowling attack that reduced them to 4-16, with fast bowler Mir Hamza on a hat-trick. Justin Langer Channel Seven Share or comment on this article: Channel Seven star Mel McLaughlin gets caught up in BIZARRE situation with cricket umpire that delayed play in the Boxing Day Test e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-12-28 03:48:10","image_url":"https://i.dailymail.co.uk/1s/2023/12/28/03/79390939-0-image-a-8_1703734737857.jpg","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"2a7019bdd07bff856b4f80ead9a692e6","title":"AUS vs PAK: Mir Hamza castles Travis Head on golden duck, Pakistan legend calls it 'genuis' stuff | WATCH","link":"https://www.indiatvnews.com/sports/cricket/aus-vs-pak-2nd-test-mir-hamza-castles-world-cup-star-travis-head-pakistan-legend-calls-it-genuis-stuff-watch-melbourne-cricket-ground-2023-12-28-909241","keywords":null,"creator":null,"video_url":null,"description":"AUS vs PAK: Pakistan are giving Australia a great fight in the Boxing Day Test as their pacers have wreaked havoc against the much-celebrated batting line-up in Melbourne. After wrapping Shan Masood's side for 264, the Aussies took a 54-run lead but the Pakistan pace-battery helped their team storm back into the match.","content":"Pakistan are giving Australia a great fight in the Boxing Day Test as their pacers have wreaked havoc against the much-celebrated batting line-up in Melbourne. After wrapping Shan Masood's side for 264, the Aussies took a 54-run lead but the Pakistan pace-battery helped their team storm back into the match. Well led by Shaheen Afridi and Mir Hamza, the visitors put the hosts in deep trouble with quick wickets in the second innings. Hamza accounted for two of the first four wickets, which included a 'genius' stuff. Playing only his 4th Test, the 31-year-old Hamza cleaned the World Cup star Travis Head with a sensational delivery. The left-arm pacer outfoxed Head with a delivery that came inside massively to the Southpaw, sending the fans crazy. The Aussies were at 16/2 in the second session of the day when Hamza first got rid of David Warner with a back-of-a-length ball and then produced a jaffa on the very next one. Coming from over the wicket, Hamza used both swing and seam perfectly. He swung the ball inside which pitched fuller just outside off and then it seamed in too. Head looked naive on his first delivery as he was beaten all ended up with the ball hitting the middle stumps. Hamza also had the chance to grab a hat trick but missed it as Mitchell Marsh did not fall for his harmless outside-of-off-stump delivery. Commentators on air defined the moment as a genius stuff. Pakistan's bowling legend Wasim Akram was also present in the commentary panel and he agreed that this was a genius piece of bowling. Wasim Akram described that Head was expecting an outswing but the ball swung back into him. \"Travis Head was expecting the outswing but like you said it was a genius move by Mir Hamza. Look at the roll of the wrists and the ball swung back into him and middle-stump gone,\" Akram said on air Hamza and Shaheen took the initial four wickets to put the hosts in massive trouble in their second reply. After Head's wicket, Australia were sent four down for just 16 and had a lead of 70. Shaheen and Hamza picked two wickets apiece. Shaheen jolted the WTC champions early with the wickets of and Marnus Labuschagne just before lunch before the Hamza show.","pubDate":"2023-12-28 03:27:44","image_url":"https://resize.indiatvnews.com/en/resize/newbucket/715_-/2023/12/rohit-kohli-20-1703733845.jpg","source_id":"indiatvnews","source_priority":10055,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"1e57d0e98fb434b8f4785620e6c4010b","title":"KL Rahul: ਕੇਐਲ ਰਾਹੁਲ ਟ੍ਰੋਲਿੰਗ ਤੋਂ ਹੁੰਦੇ ਵੱਧ ਪਰੇਸ਼ਾਨ, ਸੈਂਚੁਰੀਅਨ ਵਿੱਚ ਸੈਂਕੜਾ ਲਗਾਉਣ ਵਾਲੇ ਕ੍ਰਿਕਟਰ ਨੇ ਕੀਤਾ ਵੱਡਾ ਖੁਲਾਸਾ","link":"https://punjabi.abplive.com/sports/cricket/ind-vs-sa-1st-test-at-centurion-kl-rahul-was-upset-with-social-media-trolls-767580","keywords":["ਕ੍ਰਿਕਟ"],"creator":["ABP Sanjha"],"video_url":null,"description":"<p><strong>IND vs SA 1st Test:</strong> ਦੱਖਣੀ ਅਫਰੀਕਾ ਦੇ ਸੈਂਚੁਰੀਅਨ 'ਚ ਲਗਾਤਾਰ ਦੂਜਾ ਸੈਂਕੜਾ ਲਗਾਉਣ ਵਾਲੇ <a title=\"ਟੀਮ ਇੰਡੀਆ\" href=\"https://punjabi.abplive.com/topic/indian-cricket-team\" data-type=\"interlinkingkeywords\">ਟੀਮ ਇੰਡੀਆ</a> ਦੇ ਸਟਾਰ ਬੱਲੇਬਾਜ਼ ਕੇਐੱਲ ਰਾਹੁਲ ਨੇ ਸੋਸ਼ਲ ਮੀਡੀਆ 'ਤੇ ਟ੍ਰੋਲਸ ਨਾਲ ਨਜਿੱਠਣ ਦੇ ਆਪਣੇ ਤਰੀਕੇ ਬਾਰੇ ਖੁੱਲ੍ਹ ਕੇ ਗੱਲ ਕੀਤੀ। ਉਸ ਨੇ ਜ਼ੋਰ ਦੇ ਕੇ ਕਿਹਾ ਕਿ ਕਿਸੇ ਹੋਰ ਖਿਡਾਰੀ ਵਾਂਗ ਵਹਬ ਵੀ ਨਕਾਰਾਤਮਕ ਟਿੱਪਣੀਆਂ ਤੋਂ ਪ੍ਰਭਾਵਿਤ ਹੁੰਦਾ ਹੈ।</p> <p>ਰਾਹੁਲ ਨੇ ਕਿਹਾ ਕਿ ਇਸ ਸਾਲ ਦੀ ਸ਼ੁਰੂਆਤ 'ਚ ਸੱਟ ਨੇ ਉਸ ਨੂੰ ਆਪਣੇ 'ਦਿਮਾਗ' 'ਤੇ ਕੰਮ ਕਰਨ ਦਾ ਸਮਾਂ ਦਿੱਤਾ ਅਤੇ ਉਸ ਨੇ ਮਹਿਸੂਸ ਕੀਤਾ ਕਿ ਬੱਲੇ ਨੂੰ ਗੱਲ ਕਰਨ ਦੇਣਾ ਸੋਸ਼ਲ ਮੀਡੀਆ 'ਤੇ ਨਕਾਰਾਤਮਕਤਾ ਨੂੰ ਦੂਰ ਕਰਨ ਦਾ ਵਧੀਆ ਤਰੀਕਾ ਹੈ।</p> <p><strong>ਸਾਲ ਦੀ ਸ਼ੁਰੂਆਤ 'ਚ ਬਾਹਰ ਹੋ ਗਏ ਸੀ</strong></p> <p>ਸੈਂਚੁਰੀਅਨ ਵਿੱਚ ਦੱਖਣੀ ਅਫਰੀਕਾ ਅਤੇ ਭਾਰਤ ਵਿਚਾਲੇ ਬਾਕਸਿੰਗ ਡੇ ਟੈਸਟ ਦੇ ਦੂਜੇ ਦਿਨ ਸ਼ਾਨਦਾਰ ਸੈਂਕੜਾ ਲਗਾਉਣ ਤੋਂ ਬਾਅਦ ਇਹ ਖੁਲਾਸਾ ਕੀਤਾ ਹੈ। ਕੇਐੱਲ ਰਾਹੁਲ ਇਸ ਸਾਲ ਦੀ ਸ਼ੁਰੂਆਤ 'ਚ ਆਸਟ੍ਰੇਲੀਆ ਖਿਲਾਫ ਬਾਰਡਰ-ਗਾਵਸਕਰ ਟਰਾਫੀ ਦੌਰਾਨ ਅੱਧ ਵਿਚਾਲੇ ਹੀ ਆਊਟ ਹੋ ਗਏ ਸਨ। ਇਸ ਤੋਂ ਬਾਅਦ ਕੇਐੱਲ ਰਾਹੁਲ ਨੇ ਹੁਣ ਟੈਸਟ ਫਾਰਮੈਟ 'ਚ ਵਾਪਸੀ ਕੀਤੀ ਹੈ ਅਤੇ ਤੁਰੰਤ ਹੀ ਸ਼ਾਨਦਾਰ ਸੈਂਕੜਾ ਲਗਾਇਆ ਹੈ।</p> <p>ਤੁਹਾਨੂੰ ਦੱਸ ਦੇਈਏ ਕਿ ਕੇਐਲ ਰਾਹੁਲ ਵੀ ਆਈਪੀਐਲ ਦੌਰਾਨ ਜ਼ਖਮੀ ਹੋ ਗਏ ਸਨ ਅਤੇ ਫਿਰ ਕਈ ਮਹੀਨਿਆਂ ਤੱਕ ਕ੍ਰਿਕਟ ਨਹੀਂ ਖੇਡ ਸਕੇ ਸਨ। ਇਸ ਕਾਰਨ ਉਹ ਵਿਸ਼ਵ ਟੈਸਟ ਚੈਂਪੀਅਨਸ਼ਿਪ ਟੀਮ ਦਾ ਹਿੱਸਾ ਵੀ ਨਹੀਂ ਸੀ। ਹਾਲਾਂਕਿ, ਉਸ ਨੇ ਏਸ਼ੀਆ ਕੱਪ ਤੋਂ ਵਾਪਸੀ ਕੀਤੀ ਅਤੇ ਸ਼ਾਨਦਾਰ ਬੱਲੇਬਾਜ਼ੀ ਕਰਕੇ ਦਿਖਾਇਆ ਕਿ ਉਸ ਨੇ ਇਸ ਸਾਲ ਆਪਣੀ ਸੱਟ ਤੋਂ ਉਭਰਦੇ ਹੋਏ ਆਪਣੇ ਗੇਮਿੰਗ ਹੁਨਰ 'ਤੇ ਕਾਫੀ ਕੰਮ ਕੀਤਾ ਹੈ।</p> <p><strong>ਏਸ਼ੀਆ ਕੱਪ ਤੋਂ ਸ਼ਾਨਦਾਰ ਵਾਪਸੀ</strong></p> <p>ਕੇਐੱਲ ਰਾਹੁਲ ਨੇ <a title=\"ਏਸ਼ੀਆ ਕੱਪ\" href=\"https://punjabi.abplive.com/topic/asia-cup\" data-type=\"interlinkingkeywords\">ਏਸ਼ੀਆ ਕੱਪ</a> 'ਚ ਕਈ ਸ਼ਾਨਦਾਰ ਪਾਰੀਆਂ ਖੇਡੀਆਂ ਅਤੇ ਇਸ ਤੋਂ ਬਾਅਦ ਵਿਸ਼ਵ ਕੱਪ 'ਚ ਵੀ ਉਨ੍ਹਾਂ ਨੇ ਨਾ ਸਿਰਫ ਨੰਬਰ-5 ਦੀ ਭੂਮਿਕਾ ਨੂੰ ਬਹੁਤ ਵਧੀਆ ਤਰੀਕੇ ਨਾਲ ਨਿਭਾਇਆ ਸਗੋਂ ਵਿਕਟਕੀਪਿੰਗ ਨਾਲ ਵੀ ਕਮਾਲ ਕਰ ਦਿੱਤਾ। ਕੇਐਲ ਰਾਹੁਲ ਵੀ ਕਪਤਾਨ ਨੂੰ ਡੀਆਰਐਸ ਲੈਣ ਲਈ ਬਿਲਕੁਲ ਸਹੀ ਸਲਾਹ ਦਿੰਦੇ ਹਨ।</p> <p>ਉਂਝ, ਜੇਕਰ ਸੈਂਚੁਰੀਅਨ ਵਿੱਚ ਚੱਲ ਰਹੇ ਟੈਸਟ ਮੈਚ ਦੀ ਗੱਲ ਕਰੀਏ ਤਾਂ ਭਾਰਤ ਨੇ ਕੇਐਲ ਰਾਹੁਲ ਦੇ ਸੈਂਕੜੇ ਦੀ ਮਦਦ ਨਾਲ ਪਹਿਲੀ ਪਾਰੀ ਵਿੱਚ ਕੁੱਲ 245 ਦੌੜਾਂ ਬਣਾਈਆਂ ਸਨ, ਪਰ ਦੂਜੇ ਦਿਨ ਦੀ ਖੇਡ ਖਤਮ ਹੋਣ ਤੱਕ ਦੱਖਣੀ ਅਫਰੀਕਾ ਨੇ 256 ਦੌੜਾਂ ਬਣਾ ਲਈਆਂ ਸਨ। ਨੇ 5 ਵਿਕਟਾਂ ਗੁਆ ਦਿੱਤੀਆਂ ਸਨ। ਹਰ ਵਾਰ ਦੀ ਤਰ੍ਹਾਂ ਇਸ ਵਾਰ ਵੀ ਦੱਖਣੀ ਅਫਰੀਕਾ ਦੇ ਡੀਨ ਐਲਗਰ ਇਕ ਵਾਰ ਫਿਰ ਚੱਟਾਨ ਵਾਂਗ ਕ੍ਰੀਜ਼ 'ਤੇ ਡਟੇ ਹੋਏ ਹਨ ਅਤੇ 140 ਦੌੜਾਂ ਬਣਾ ਕੇ ਅਜੇਤੂ ਹਨ।</p>","content":"IND vs SA 1st Test: ਦੱਖਣੀ ਅਫਰੀਕਾ ਦੇ ਸੈਂਚੁਰੀਅਨ 'ਚ ਲਗਾਤਾਰ ਦੂਜਾ ਸੈਂਕੜਾ ਲਗਾਉਣ ਵਾਲੇ ਟੀਮ ਇੰਡੀਆ ਦੇ ਸਟਾਰ ਬੱਲੇਬਾਜ਼ ਕੇਐੱਲ ਰਾਹੁਲ ਨੇ ਸੋਸ਼ਲ ਮੀਡੀਆ 'ਤੇ ਟ੍ਰੋਲਸ ਨਾਲ ਨਜਿੱਠਣ ਦੇ ਆਪਣੇ ਤਰੀਕੇ ਬਾਰੇ ਖੁੱਲ੍ਹ ਕੇ ਗੱਲ ਕੀਤੀ। ਉਸ ਨੇ ਜ਼ੋਰ ਦੇ ਕੇ ਕਿਹਾ ਕਿ ਕਿਸੇ ਹੋਰ ਖਿਡਾਰੀ ਵਾਂਗ ਵਹਬ ਵੀ ਨਕਾਰਾਤਮਕ ਟਿੱਪਣੀਆਂ ਤੋਂ ਪ੍ਰਭਾਵਿਤ ਹੁੰਦਾ ਹੈ। ਰਾਹੁਲ ਨੇ ਕਿਹਾ ਕਿ ਇਸ ਸਾਲ ਦੀ ਸ਼ੁਰੂਆਤ 'ਚ ਸੱਟ ਨੇ ਉਸ ਨੂੰ ਆਪਣੇ 'ਦਿਮਾਗ' 'ਤੇ ਕੰਮ ਕਰਨ ਦਾ ਸਮਾਂ ਦਿੱਤਾ ਅਤੇ ਉਸ ਨੇ ਮਹਿਸੂਸ ਕੀਤਾ ਕਿ ਬੱਲੇ ਨੂੰ ਗੱਲ ਕਰਨ ਦੇਣਾ ਸੋਸ਼ਲ ਮੀਡੀਆ 'ਤੇ ਨਕਾਰਾਤਮਕਤਾ ਨੂੰ ਦੂਰ ਕਰਨ ਦਾ ਵਧੀਆ ਤਰੀਕਾ ਹੈ। ਸਾਲ ਦੀ ਸ਼ੁਰੂਆਤ 'ਚ ਬਾਹਰ ਹੋ ਗਏ ਸੀ ਸੈਂਚੁਰੀਅਨ ਵਿੱਚ ਦੱਖਣੀ ਅਫਰੀਕਾ ਅਤੇ ਭਾਰਤ ਵਿਚਾਲੇ ਬਾਕਸਿੰਗ ਡੇ ਟੈਸਟ ਦੇ ਦੂਜੇ ਦਿਨ ਸ਼ਾਨਦਾਰ ਸੈਂਕੜਾ ਲਗਾਉਣ ਤੋਂ ਬਾਅਦ ਇਹ ਖੁਲਾਸਾ ਕੀਤਾ ਹੈ। ਕੇਐੱਲ ਰਾਹੁਲ ਇਸ ਸਾਲ ਦੀ ਸ਼ੁਰੂਆਤ 'ਚ ਆਸਟ੍ਰੇਲੀਆ ਖਿਲਾਫ ਬਾਰਡਰ-ਗਾਵਸਕਰ ਟਰਾਫੀ ਦੌਰਾਨ ਅੱਧ ਵਿਚਾਲੇ ਹੀ ਆਊਟ ਹੋ ਗਏ ਸਨ। ਇਸ ਤੋਂ ਬਾਅਦ ਕੇਐੱਲ ਰਾਹੁਲ ਨੇ ਹੁਣ ਟੈਸਟ ਫਾਰਮੈਟ 'ਚ ਵਾਪਸੀ ਕੀਤੀ ਹੈ ਅਤੇ ਤੁਰੰਤ ਹੀ ਸ਼ਾਨਦਾਰ ਸੈਂਕੜਾ ਲਗਾਇਆ ਹੈ। googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); ਤੁਹਾਨੂੰ ਦੱਸ ਦੇਈਏ ਕਿ ਕੇਐਲ ਰਾਹੁਲ ਵੀ ਆਈਪੀਐਲ ਦੌਰਾਨ ਜ਼ਖਮੀ ਹੋ ਗਏ ਸਨ ਅਤੇ ਫਿਰ ਕਈ ਮਹੀਨਿਆਂ ਤੱਕ ਕ੍ਰਿਕਟ ਨਹੀਂ ਖੇਡ ਸਕੇ ਸਨ। ਇਸ ਕਾਰਨ ਉਹ ਵਿਸ਼ਵ ਟੈਸਟ ਚੈਂਪੀਅਨਸ਼ਿਪ ਟੀਮ ਦਾ ਹਿੱਸਾ ਵੀ ਨਹੀਂ ਸੀ। ਹਾਲਾਂਕਿ, ਉਸ ਨੇ ਏਸ਼ੀਆ ਕੱਪ ਤੋਂ ਵਾਪਸੀ ਕੀਤੀ ਅਤੇ ਸ਼ਾਨਦਾਰ ਬੱਲੇਬਾਜ਼ੀ ਕਰਕੇ ਦਿਖਾਇਆ ਕਿ ਉਸ ਨੇ ਇਸ ਸਾਲ ਆਪਣੀ ਸੱਟ ਤੋਂ ਉਭਰਦੇ ਹੋਏ ਆਪਣੇ ਗੇਮਿੰਗ ਹੁਨਰ 'ਤੇ ਕਾਫੀ ਕੰਮ ਕੀਤਾ ਹੈ। ਏਸ਼ੀਆ ਕੱਪ ਤੋਂ ਸ਼ਾਨਦਾਰ ਵਾਪਸੀ ਕੇਐੱਲ ਰਾਹੁਲ ਨੇ ਏਸ਼ੀਆ ਕੱਪ 'ਚ ਕਈ ਸ਼ਾਨਦਾਰ ਪਾਰੀਆਂ ਖੇਡੀਆਂ ਅਤੇ ਇਸ ਤੋਂ ਬਾਅਦ ਵਿਸ਼ਵ ਕੱਪ 'ਚ ਵੀ ਉਨ੍ਹਾਂ ਨੇ ਨਾ ਸਿਰਫ ਨੰਬਰ-5 ਦੀ ਭੂਮਿਕਾ ਨੂੰ ਬਹੁਤ ਵਧੀਆ ਤਰੀਕੇ ਨਾਲ ਨਿਭਾਇਆ ਸਗੋਂ ਵਿਕਟਕੀਪਿੰਗ ਨਾਲ ਵੀ ਕਮਾਲ ਕਰ ਦਿੱਤਾ। ਕੇਐਲ ਰਾਹੁਲ ਵੀ ਕਪਤਾਨ ਨੂੰ ਡੀਆਰਐਸ ਲੈਣ ਲਈ ਬਿਲਕੁਲ ਸਹੀ ਸਲਾਹ ਦਿੰਦੇ ਹਨ। ਉਂਝ, ਜੇਕਰ ਸੈਂਚੁਰੀਅਨ ਵਿੱਚ ਚੱਲ ਰਹੇ ਟੈਸਟ ਮੈਚ ਦੀ ਗੱਲ ਕਰੀਏ ਤਾਂ ਭਾਰਤ ਨੇ ਕੇਐਲ ਰਾਹੁਲ ਦੇ ਸੈਂਕੜੇ ਦੀ ਮਦਦ ਨਾਲ ਪਹਿਲੀ ਪਾਰੀ ਵਿੱਚ ਕੁੱਲ 245 ਦੌੜਾਂ ਬਣਾਈਆਂ ਸਨ, ਪਰ ਦੂਜੇ ਦਿਨ ਦੀ ਖੇਡ ਖਤਮ ਹੋਣ ਤੱਕ ਦੱਖਣੀ ਅਫਰੀਕਾ ਨੇ 256 ਦੌੜਾਂ ਬਣਾ ਲਈਆਂ ਸਨ। ਨੇ 5 ਵਿਕਟਾਂ ਗੁਆ ਦਿੱਤੀਆਂ ਸਨ। ਹਰ ਵਾਰ ਦੀ ਤਰ੍ਹਾਂ ਇਸ ਵਾਰ ਵੀ ਦੱਖਣੀ ਅਫਰੀਕਾ ਦੇ ਡੀਨ ਐਲਗਰ ਇਕ ਵਾਰ ਫਿਰ ਚੱਟਾਨ ਵਾਂਗ ਕ੍ਰੀਜ਼ 'ਤੇ ਡਟੇ ਹੋਏ ਹਨ ਅਤੇ 140 ਦੌੜਾਂ ਬਣਾ ਕੇ ਅਜੇਤੂ ਹਨ।","pubDate":"2023-12-28 03:24:21","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/12/28/506a965c01416c472ef0d999f1aa92141703733785917709_original.jpg","source_id":"abplive","source_priority":10959,"country":["india"],"category":["sports"],"language":"punjabi"},{"article_id":"54fcd17e5c681809f2a8045a8d86af6d","title":"'कुछ दिन पहले यही लोग देते थे गाली', शतक लगाते ही केएल राहुल का बड़ा बयान","link":"https://www.indiatv.in/sports/cricket/ind-vs-sa-kl-rahul-statement-after-making-century-against-south-africa-in-boxing-day-test-2023-12-28-1011652","keywords":null,"creator":null,"video_url":null,"description":"IND vs SA: भारत और साउथ अफ्रीका के बीच पहले टेस्ट में केएल राहुल ने अपने शतक से टीम इंडिया को एक सम्मानजनक स्कोर तक पहुंचाया। इस पारी के बाद उन्होंने एक बड़ा बयान दिया है।","content":"भारत और साउथ अफ्रीका के बीच दो मैचों की टेस्ट सीरीज का पहला मैच खेला जा रहा है। इस मैच में टीम इंडिया पहले बल्लेबाजी करते हुए 245 रन के स्कोर पर ऑलआउट हो गई। इसके बाद साउथ अफ्रीका ने 5 विकेट खोकर 256 रन बना लिए हैं। साउथ अफ्रीका की टीम के पास इस वक्त 11 रनों की लीड हासिल है। इस मैच में भारतीय टीम अपनी पहली पारी के दौरान काफी मुश्किल में नजर आ रही थी, लेकिन केएल राहुल ने एक शानदार पारी खेलकर टीम इंडिया ने मुश्किल से निकाला और भारत को एक सम्मानजनक स्कोर कर पहुंचाया। साउथ अफ्रीका के खिलाफ बॉक्सिंग डे टेस्ट मैच में के दौरान केएल राहुल ने शानदार पारी खेली। उन्होंने 137 गेंदों पर 101 रन बनाए। केएल राहुल ने इस पारी के बाद एक बड़ा बयान दिया है। उन्होंने कहा कि आज मैंने शतक बनाया है इसलिए लोग तारीफ कर रहे हैं। 3-4 महीने पहले, हर कोई मुझे गाली दे रहा था। यह खेल का हिस्सा है, लेकिन मैं यह नहीं कह सकता कि इसका आप पर असर नहीं पड़ता। ऐसा होता है। जितनी जल्दी आपको यह एहसास होगा कि इससे दूर रहना आपके खेल के लिए अच्छा है उतना ही बेहतर होगा। आपको बता दें कि केएल राहुल कुछ महीने पहले तक बेहद खराब फॉर्म से गुजर रहे थे। इंजरी और खराब फॉर्म के कारण उन्हें सोशल मीडिया पर जमकर ट्रोलिंग का सामना करना पड़ रहा था। केएल राहुल ने जैसे ही इंजरी के बाद टीम इंडिया में कमबैक किया उस दौरान भी कुछ लोगों ने उनके वर्ल्ड कप टीम में होने पर कई सवाल खड़े किए थे। केएल राहुल ने उन सभी का जवाब वर्ल्ड कप में अपने शानदार फॉर्म से दिया। अब टेस्ट क्रिकेट में भी केएल राहुल ने दमदार वापसी कर ली है। जिसके बाद उनका ये बड़ा बयान सामने आया है। बॉक्सिंग डे टेस्ट में केएल राहुल ने शतक लगाते ही कई बड़े रिकॉर्ड अपने नाम कर लिए हैं। टीम इंडिया ने इससे पहले पिछली बार साल 2021 में साउथ अफ्रीका के ही खिलाफ बॉक्सिंग डे टेस्ट मैच खेला था। इस मुकाबले में भी केएल राहुल ने शतक लगाया था। बॉक्सिंग डे टेस्ट में बैक टू बैक शतक लगाने वाले वह दुनिया के दूसरे खिलाड़ी है। इसके अलावा सेंचुरियन में किसी बाहरी बल्लेबाज द्वारा सबसे ज्यादा टेस्ट रन बनाने के मामले में भी केएल राहुल पहले स्थान पर पहुंच गए हैं।","pubDate":"2023-12-28 03:18:00","image_url":"https://resize.indiatv.in/resize/715_-/2023/12/travis-1-1703732976.jpg","source_id":"indiatv","source_priority":216441,"country":["india"],"category":["sports"],"language":"hindi"},{"article_id":"dddb49e603700cdbd7e5ab977372fafb","title":"Second Test delayed by third umpire stuck in MCG lift","link":"https://www.perthnow.com.au/sport/cricket/second-test-delayed-by-third-umpire-stuck-in-mcg-lift-c-13044067","keywords":null,"creator":["Shayne Hope"],"video_url":null,"description":"Third umpire Richard Illingworth was stuck in a lift at the MCG, causing a seven-minute delay to the start of play in the second Test after lunch on day three.","content":"Play was held up in bizarre circumstances during the second Australia-Pakistan Test at the MCG because the third umpire got stuck in a lift. Players returned to the middle of the iconic venue after the lunch break on Thursday, in time for the scheduled 1.25pm start to the second session. But in unusual scenes, the two central umpires wouldn't allow a ball to be bowled because experienced English official Richard Illingworth was unable to return to his post in the grandstand. It left Australian batters David Warner and Steve Smith waiting to resume their innings, with the hosts stuck on 2-6 in their second dig with an overall lead of 60. Cricket Australia and the MCG both produced light-hearted responses to the peculiar delay, which lasted seven minutes. \"The game is delayed because the third umpire ... is stuck in the lift,\" Cricket Australia's social media arm posted on X, formerly known as Twitter. The MCG was quick to reply: \"Sorry.\" The banter continued when Illingworth eventually made his way back to his seat by 1.32pm, with Cricket Australia posting: \"A wild Richard Illingworth appeared!\" Warner (six) and Travis Head (zero) fell to successive Mir Hamza deliveries at the start of the third over after play resumed, leaving Australia reeling at 4-16. Earlier, a scheduled 10am start to day three was pushed back to 10.45am because of rain.","pubDate":"2023-12-28 03:17:01","image_url":"https://images.perthnow.com.au/publication/C-13044067/3cf2a247f17de887f81a217d965055b5c746e16e-16x9-x0y0w1280h720.jpg","source_id":"perthnow","source_priority":49457,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"5b23d2566e537a2052bc566c647c634a","title":"\"Jo Bolna...\": Rahul To Trolls After '1 Of Top 10 Tons' In Indian Cricket","link":"https://sports.ndtv.com/cricket/jo-bolna-hoga-kl-rahul-shuts-down-trolls-after-one-of-the-top-10-centuries-in-indian-test-cricket-4753870","keywords":null,"creator":null,"video_url":null,"description":"KL Rahul scored 101 vs South Africa in the 1st Test. Sunil Gavaskar hailed it as one of the top 10 centuries in Indian Test cricket history","content":"Don't you ever feel retorting to trolls who are merciless and at times downright out of line when they criticise you? KL Rahul was asked. \"What will I achieve (by) doing that?\" he countered. \"Logon ko jo bolna hoga bolenge (People will say what they want to). If you are a public performer, performance is your only yardstick to stay away from criticism. And about social media, the farther you stay away from it, the happier you will be,\" a composed Rahul told media persons after scoring what Sunil Gavaskar termed as one of the 10 best hundreds ever hit by an Indian batter. \"If he (Gavaskar) has said that, it's a huge compliment,\" he said post his stupendous 137-ball 101. Rahul said the time away from the game due to injury helped him work on his personality. \"When you play international cricket, you are not only challenged as a player but also as a person because you have a personality. So, when I was away from the game, I worked on myself as a person. Obviously, there were people to help me,\" he said. He felt that social media comments did affect a person but one needed to know where to draw a line. \"One who is hailing me today was abusing me some months back. Anyone who says he isn't affected by comments on social media is lying. But the more you stay away, the better it is for your mindset,\" he said. South Africa have their nose ahead and Rahul said it has become easier to bat. Advertisement \"Today in the morning, when we'd batted for those 7-8 overs, I felt the wicket had eased a bit. But it can change here quickly with cracks opening out.\" Rahul said Centurion wicket never allows a batter to \"feel set\" and at times one can score freely and at times one can't. The key to batting in the middle-order and playing long is not to plan too much, reckoned the 31-year-old. \"You can't plan that much. There's a game situation that tells you how to play in that time and moment. You have to remain free and empty. You need to be aware that you might have to bat with tail,\" he said.","pubDate":"2023-12-28 03:15:47","image_url":"https://c.ndtvimg.com/2023-12/br14m33o_kl-rahul-century-afp_625x300_27_December_23.jpg","source_id":"ndtv","source_priority":1204,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"7535b2de2abfb61e8b0dc500b7a302ca","title":"'उसकी कलाई बहुत मजबूत हैं', दक्षिण अफ्रीकी दिग्‍गज ने की बुमराह की तारीफ","link":"https://hindi.news18.com/cricket/south-africas-veteran-fast-bowler-makhaya-ntini-praises-team-indias-jasprit-bumrahs-bowling-skills-7936127.html","keywords":null,"creator":null,"video_url":null,"description":"दक्षिण अफ्रीका के पूर्व दिग्‍गज तेज गेंदबाज मखाया एनटिनी भी जसप्रीत बुमराह के गेंदबाजी कौशल के कायल हैं.ए‍नटिनी का मानना है कि बुमराह के भारतीय टीम ने न तो होने से वह पहले जैसी बॉलिंग यूनिट नहीं रह जाती. सेंचुरियन टेस्‍ट में वे भारतीय टीम के अब तक के सबसे अच्‍छे बॉलर साबित हुए हैं.","content":"मखाया ए‍नटिनी का मानना है, जसप्रीत बुमराह के भारतीय टीम ने न तो होने से वह पहले जैसी बॉलिंग यूनिट नहीं रह जाती.Jasprit Bumrah/Instagram नई दिल्‍ली. जसप्रीत बुमराह (Jasprit Bumrah) को क्रिकेट के सभी फॉर्मेटों में भारतीय टीम का सर्वश्रेष्‍ठ बॉलर माना जा सकता है.कई पूर्व क्रिकेटर तो उन्‍हें मौजूदा दौर के दुनिया के सर्वश्रेष्‍ठ गेंदबाज की श्रेणी में रखते हैं.टेस्‍ट क्रिकेट हो, वनडे या फिर टी20I, हर फॉर्मेट में बुमराह न केवल विकेट हासिल करते हैं बल्कि बेहद किफायती भी साबित होते हैं. गेंदबाज के तौर पर उनके पास अच्‍छे खासे वेरिएशंस हैं और सटीक यॉर्कर व स्‍लोअर बॉल से वे विपक्षी बैटरों की जमकर परीक्षा लेते हैं. दक्षिण अफ्रीका के पूर्व दिग्‍गज तेज गेंदबाज मखाया एनटिनी (Makhaya Ntini) भी बुमराह के गेंदबाजी कौशल के कायल हैं.ए‍नटिनी का मानना है कि बुमराह के भारतीय टीम ने न तो होने से वह पहले जैसी बॉलिंग यूनिट नहीं रह जाती. ‘ अपने’ मैदानों पर भारत के खिलाफ हमेशा दहाड़ता है यह दक्षिण अफ्रीकी बैटर, डिविलियर्स से भी ऊंचा औसत ‘सिर के ऊपर से रिलीज करते हैं गेंद’ दक्षिण अफ्रीका के लिए टेस्‍ट में 390 और वनडे में 266 विकेट हासिल करने वाले एनटिनी ने कहा, ‘ऐसा लगता है कि बुमराह की कलाइयां बेहद मजबूत हैं. ‘इंडिया टुडे के साथ बातचीत में बुमराह की गेंदबाजी का बारीक विश्‍लेषण करते हुए उन्‍होंने कहा, ‘देखिए वह (बुमराह) गेंद को कहां रिलीज करता है. वह गेंद को अपने सिर के ऊपर से छोड़ते हैं और संभवत: इसी कारण गेंद को अंदर लाने के लिए एंगल हासिल करने में सफल होते हैं.वह ऐसी गेंद भी फेंकते हैं जो पिच करने के बाद सीधी रहती हैं.खास बात यह है कि उनका बॉलिंग एक्शन हमेशा एक जैसा होता है,यह बेहतरीन है.’ पांच बैटर जड़ चुके डेब्‍यू और आखिरी टेस्‍ट में शतक, एक भारतीय भी शामिल एनटिनी बोले, उनकी यॉर्कर टारगेट मिस नहीं करतीं बुमराह की यॉर्कर की खास तौर पर तारीफ करते हुए दक्षिण अफ्रीका के इस पूर्व तेज गेंदबाज ने कहा, ‘उनकी यॉर्कर टारगेट को मिस नहीं करतीं. यह वाकई ऐसी चीजें हैं जिनका हर कोई लुत्‍फ उठा सकता है.बुमराह के टीम में न होने पर भारत पहले जैसी टीम नहीं रह जाती.’ बुमराह की बात करें तो वे जुलाई 2022 के बाद अपना अपना पहला टेस्‍ट खेल रहे हैं. दक्षिण अफ्रीका के खिलाफ (India Vs South Africa) सेंचुरियन टेस्‍ट में वे भारतीय टीम के अब तक के सबसे अच्‍छे बॉलर साबित हुए हैं और गिरे पांच में से दो विकेट उन्‍होंने हासिल किए हैं. Video: विराट कोहली ने आजमाया अंग्रेजों का टोटका, अगली गेंद पर गिरा विकेट बैक इंजुरी के कारण सर्जरी कराने के बाद उन्‍होंने इंटरनेशनल क्रिकेट में वापसी की है. वर्ल्‍डकप 2023 में भी शमी के बाद बुमराह भारत के सबसे कामयाब बॉलर (11 मैचों में 20 विकेट, औसत 18.65)रहे थे. . Tags: Ind vs sa , India vs South Africa , Jasprit Bumrah दुनिया का सबसे पुराना शहर है बेहद खूबसूरत, कभी पेरिस से होती थी तुलना, जानिए कैसी है वहां की लाइफ 3 साल के इस बच्चे ने पूरे एशिया में मचा रखी है धूम... कर रहा लाखों की कमाई, अब वेब सीरीज में भी दिखेगा कौन है 36 साल की वो एक्ट्रेस, जिसने किया इंडस्ट्री के काले सच का खुलासा, काम को तरस रही खूबसूरत हीरोइन ने बताई आपबीती लाइव ब्लॉग 3 days ago 4 days ago 7 days ago 7 days ago","pubDate":"2023-12-28 03:14:41","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/12/Jasprit-Bumrah-2023-12-1796a438690d82f531e9775c84fcb154-3x2.jpg","source_id":"hindinews18","source_priority":6509,"country":["india"],"category":["sports"],"language":"hindi"},{"article_id":"1226a652cad0f1305002408ab42d1fef","title":"Second Test delayed by third umpire stuck in MCG lift","link":"https://www.blayneychronicle.com.au/story/8471742/second-test-delayed-by-third-umpire-stuck-in-mcg-lift/?src=rss","keywords":null,"creator":["Shayne Hope"],"video_url":null,"description":null,"content":"Play was held up in bizarre circumstances during the second Australia-Pakistan Test at the MCG because the third umpire got stuck in a lift. / (min cost $ 8 ) Login or signup to continue reading Players returned to the middle of the iconic venue after the lunch break on Thursday, in time for the scheduled 1.25pm start to the second session. But in unusual scenes, the two central umpires wouldn't allow a ball to be bowled because experienced English official Richard Illingworth was unable to return to his post in the grandstand. It left Australian batters David Warner and Steve Smith waiting to resume their innings, with the hosts stuck on 2-6 in their second dig with an overall lead of 60. Cricket Australia and the MCG both produced light-hearted responses to the peculiar delay, which lasted seven minutes. \"The game is delayed because the third umpire ... is stuck in the lift,\" Cricket Australia's social media arm posted on X, formerly known as Twitter. The MCG was quick to reply: \"Sorry.\" The banter continued when Illingworth eventually made his way back to his seat by 1.32pm, with Cricket Australia posting: \"A wild Richard Illingworth appeared!\" Warner (six) and Travis Head (zero) fell to successive Mir Hamza deliveries at the start of the third over after play resumed, leaving Australia reeling at 4-16. Earlier, a scheduled 10am start to day three was pushed back to 10.45am because of rain. Advertisement Sign up for our newsletter to stay up to date. We care about the protection of your data. Read our . Advertisement","pubDate":"2023-12-28 03:14:14","image_url":"https://www.blayneychronicle.com.au/images/transform/v1/crop/frm/silverstone-feed-data/10f1740b-67e9-4dc6-958e-44fb97c5361e.jpg/r0_75_800_526_w600_h338_fmax.jpg","source_id":"blayneychronicle","source_priority":17177086,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"cf4126ea7e65fe2e8ecab682a1159539","title":"Second Test delayed by third umpire stuck in MCG lift","link":"https://www.busseltonmail.com.au/story/8471742/second-test-delayed-by-third-umpire-stuck-in-mcg-lift/?src=rss","keywords":null,"creator":null,"video_url":null,"description":null,"content":"Play was held up in bizarre circumstances during the second Australia-Pakistan Test at the MCG because the third umpire got stuck in a lift. Players returned to the middle of the iconic venue after the lunch break on Thursday, in time for the scheduled 1.25pm start to the second session. But in unusual scenes, the two central umpires wouldn't allow a ball to be bowled because experienced English official Richard Illingworth was unable to return to his post in the grandstand. It left Australian batters David Warner and Steve Smith waiting to resume their innings, with the hosts stuck on 2-6 in their second dig with an overall lead of 60. Cricket Australia and the MCG both produced light-hearted responses to the peculiar delay, which lasted seven minutes. \"The game is delayed because the third umpire ... is stuck in the lift,\" Cricket Australia's social media arm posted on X, formerly known as Twitter. The MCG was quick to reply: \"Sorry.\" The banter continued when Illingworth eventually made his way back to his seat by 1.32pm, with Cricket Australia posting: \"A wild Richard Illingworth appeared!\" Warner (six) and Travis Head (zero) fell to successive Mir Hamza deliveries at the start of the third over after play resumed, leaving Australia reeling at 4-16. Earlier, a scheduled 10am start to day three was pushed back to 10.45am because of rain. Australian Associated Press","pubDate":"2023-12-28 03:14:14","image_url":"https://www.busseltonmail.com.au/images/transform/v1/crop/frm/silverstone-feed-data/10f1740b-67e9-4dc6-958e-44fb97c5361e.jpg/r0_75_800_526_w600_h338_fmax.jpg","source_id":"busseltonmail","source_priority":6251187,"country":["australia"],"category":["sports"],"language":"english"}]}