{"newsArray":[{"title":"Bowled out: Pakistan's cricketer-turned-PM Imran Khan loses office","link":"https://www.bangkokpost.com/sports/2292818/bowled-out-pakistans-cricketer-turned-pm-imran-khan-loses-office","keywords":null,"creator":null,"video_url":null,"description":"ISLAMABAD - Regarded as a wily cricket captain during his international playing days, Imran Khan found himself on a sticky wicket when it came to leading Pakistan.","content":null,"pubDate":"2022-04-09 20:45:08","full_description":"ISLAMABAD - Regarded as a wily cricket captain during his international playing days, Imran Khan found himself on a sticky wicket when it came to leading Pakistan. The 69-year-old prime minister was dismissed Sunday following a no-confidence motion in the national assembly, days after he thought he had stymied the opposition by dissolving parliament and calling an early election. The Supreme Court ruled his action illegal Thursday, and having lost his majority in the assembly, Khan ran out of options. Khan enjoyed genuine popular support when he became premier in 2018, but critics say he has failed to deliver on promises to revitalise the economy and improve the lives of the poor. Khan's Tehreek-e-Insaf (PTI) party was voted in by millions who grew up watching him play cricket, where he excelled as an allrounder and captained Pakistan to World Cup victory in 1992. The PTI overturned decades of dominance by the Pakistan Peoples Party (PPP) and Pakistan Muslim League-N (PML-N) -- two usually feuding groups that joined forces to oust him. Khan's vision was for Pakistan to become a welfare state modelled on the Islamic golden age of the 7th to 14th centuries, a period of cultural, economic and scientific flourishing in the Muslim world. But he made little headway in improving Pakistan's financial situation, with galloping inflation, crippling debt and a feeble rupee undermining economic reform. The security situation also deteriorated on his watch, particularly since the Taliban returned to power in Afghanistan last year. - Tiptoed into politics - The Oxford-educated son of a wealthy Lahore family, Khan had a reputation as a playboy until his retirement from international cricket. For years, he busied himself with charity projects, raising millions to build a cancer hospital to honour his mother. He tiptoed into politics and for years held the PTI's only parliamentary seat. But the party grew hugely during the military-led government of General Pervez Musharraf, becoming a genuine force in the 2013 elections before winning a majority five years later. Running the country proved more difficult than sitting in opposition, however. Double-digit inflation has driven up the cost of basic goods, and while the economy is forecast to grow four percent this year, it has been stagnant for the last three. Pakistan has also had to borrow heavily just to service nearly $130 billion of foreign debt. The increasingly volatile security situation exemplified by the Taliban's return to power across the border in mid-August has also contributed to Khan's downfall. The hardline Islamists' victory was initially seen as a victory, both for Pakistan -- long accused of supporting them -- as well as for a premier dubbed \"Taliban Khan\" for his consistent advocacy of dialogue and criticism of US policy towards Kabul. But attacks by Pakistan's own Taliban -- as well as the local Islamic State group (IS-K) and ethnic Baloch separatists -- have increased despite Kabul's assurances that Afghan soil would not be used for such purposes. Pakistan's army is key to political power, and some analysts say Khan lost its crucial support -- claims both sides deny. - Closer to China, Russia - Khan's efforts to position Pakistan as a key non-aligned regional player were been successful either. Ties with the United States frayed, with Khan accusing Washington of working with the opposition for regime change. Islamabad has moved closer to China, even though the important work on the China-Pakistan Economic Corridor (CPEC) has slowed down. He also moved closer to Russia, angering the West by continuing a visit to Moscow on the same day as the invasion of Ukraine. - 'I never quit' - Khan did have some domestic successes. He is credited with bringing Pakistan relatively unscathed through the Covid-19 pandemic, and a free universal health scheme he pioneered is slowly being rolled out across the country. Khan frequently rails against Western permissiveness, sparking outrage among rights groups by repeatedly linking rape to the way women dress in a deeply patriarchal country where sexual violence is widespread. Married three times, his current wife Bushra Bibi comes from a conservative family and wears a veil in public. Often described as being impulsive and brash, he draws frequently on cricket analogies to describe his political battles. \"I fight till the very last ball. I never quit whatever the result may be,\" he said in an address to the nation last week. On Sunday, he was dismissed.","image_url":null,"source_id":"bangkokpost","country":["thailand"],"category":["sports"],"language":"english"},{"title":"Fresh evidence of Aboriginal XI’s financial exploitation","link":"https://www.smh.com.au/sport/cricket/fresh-evidence-of-aboriginal-xi-s-financial-exploitation-20220407-p5abm1.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Daniel Brettig"],"video_url":null,"description":"Who promised the players of Australia’s Aboriginal cricket team £50 each for touring England in 1868? A fresh rummage through the archives following the performance of the play Black Cockatoo has provided some answers.","content":null,"pubDate":"2022-04-09 20:00:00","full_description":"Aboriginal and Torres Strait Islander readers are warned that the following article contains images and names of deceased people. Further evidence of the financial exploitation of Australia’s Aboriginal first XI cricket team more than 150 years ago has emerged following the performance of a play about the team’s 1868 tour to England. The Aboriginal team from western Victoria, featuring the Australian cricket hall of fame member Johnny Mullagh, was initially coached by Tom Wills and managed by William Hayman for a game at the MCG on Boxing Day 1866, before travelling to New South Wales. The Aboriginal cricket team who played the Melbourne Cricket Club on Boxing Day, 1866. Credit: National Museum of Australia It was there that they met William Gurnett, a businessman who proposed the tour’s expansion to travel to the UK, but then breached his contract to leave the team penniless and stranded in Sydney. Following the performance of the play Black Cockatoo , written by Geoffrey Atherden and directed by Wesley Enoch , in the Wimmera town of Harrow last Saturday night, a fresh rummage through the archives was conducted to settle a longstanding question – who had promised the players they would be paid £50 each for touring and playing? In the play, which first premiered in 2020, the promise was initially ascribed to the team’s 1868 captain/coach Charles Lawrence, before recently being adjusted to attribute it to George Graham and George Smith, the financial backers of the 1868 tour. The 1868 Aboriginal team to England, pictured with their coach Charles Lawrence. But a search by the Harrow Discovery Centre’s manager, Josie Sangster, and researcher Ian Friend – a descendant of Lawrence – uncovered the following article from the West Gippsland Gazette , dated September 5, 1899, which captured the recollections of the Hayman family: “While the match in Melbourne was in course of progress, Wills received a wire from the Sydney cricketers offering to give a lump sum and pay all expenses if the Aboriginal team would go there and play. Before they started for Sydney Mr W. E. B. Gurnett, a member of the Melbourne Cricket Club, who was represented to be wealthy, offered Wills and Mr Hayman £1000 each if they would take the blacks to England,” the article reads. “Mr Gurnett offered to find all the expenses and pay £50 to each member of the team. The offer was accepted, and the agreement embodying it was signed, and is now preserved in the Melbourne Museum. By that undertaking Mr Gurnett was to take all the Victorian matches at Geelong, Sandhurst and Castlemaine. They went through their programme in this colony and sailed for Sydney, where they started their first match on the Albert ground. The proceeds were to go to Mr Gurnett. “Disaster, however, was at hand. No sooner were the wickets pitched and all in readiness than certain legal documents were served upon Wills and Mr Gurnett, and the match could not be proceeded with. Finally the match came off, but owing to the hitch which had occurred it was not a success financially, and Mr Hayman found himself stranded at Charles Lawrence’s hotel at Manly Beach.” The 1866-67 tour was not only a financial bust but a human disaster for the team. Four of their number died during and immediately after the tour. This also brought their association with Wills to an end. His involvement in colonial cricket, football and interactions with Aboriginal communities is currently subject to a joint research project between the MCC, the AFL and Cricket Australia. It was Lawrence, then, who accompanied the team back to Victoria, and then helped oversee the 1868 trip. Details of financial agreements with the Aboriginal team for the 1868 tour are more sketchy, save for the fact that several members of the side won prize money during its course and afterwards. Mullagh, the central character in the play, was inducted into the Australian Cricket Hall of Fame in 2021. The player of the match during the Boxing Day Test is awarded the Mullagh medal - an honour received by the Indigenous cricketer Scott Boland after last year’s Ashes Test. Black Cockatoo is touring nationally and returns to Sydney in May with performances at Glen Street Theatre and Zenith Theatre Chatswood. A cultural guide to going out and loving your city. Sign up to our Culture Fix newsletter here.","image_url":null,"source_id":"smh","country":["australia"],"category":["sports"],"language":"english"},{"title":"Fresh evidence of Aboriginal XI’s financial exploitation","link":"https://www.theage.com.au/sport/cricket/fresh-evidence-of-aboriginal-xi-s-financial-exploitation-20220407-p5abm1.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Daniel Brettig"],"video_url":null,"description":"Who promised the players of Australia’s Aboriginal cricket team £50 each for touring England in 1868? A fresh rummage through the archives following the performance of the play Black Cockatoo has provided some answers.","content":null,"pubDate":"2022-04-09 20:00:00","full_description":"Aboriginal and Torres Strait Islander readers are warned that the following article contains images and names of deceased people. Further evidence of the financial exploitation of Australia’s Aboriginal first XI cricket team more than 150 years ago has emerged following the performance of a play about the team’s 1868 tour to England. The Aboriginal team from western Victoria, featuring the Australian cricket hall of fame member Johnny Mullagh, was initially coached by Tom Wills and managed by William Hayman for a game at the MCG on Boxing Day 1866, before travelling to New South Wales. The Aboriginal cricket team who played the Melbourne Cricket Club on Boxing Day, 1866. Credit: National Museum of Australia It was there that they met William Gurnett, a businessman who proposed the tour’s expansion to travel to the UK, but then breached his contract to leave the team penniless and stranded in Sydney. Following the performance of the play Black Cockatoo , written by Geoffrey Atherden and directed by Wesley Enoch , in the Wimmera town of Harrow last Saturday night, a fresh rummage through the archives was conducted to settle a longstanding question – who had promised the players they would be paid £50 each for touring and playing? In the play, which first premiered in 2020, the promise was initially ascribed to the team’s 1868 captain/coach Charles Lawrence, before recently being adjusted to attribute it to George Graham and George Smith, the financial backers of the 1868 tour. The 1868 Aboriginal team to England, pictured with their coach Charles Lawrence. But a search by the Harrow Discovery Centre’s manager, Josie Sangster, and researcher Ian Friend – a descendant of Lawrence – uncovered the following article from the West Gippsland Gazette , dated September 5, 1899, which captured the recollections of the Hayman family: “While the match in Melbourne was in course of progress, Wills received a wire from the Sydney cricketers offering to give a lump sum and pay all expenses if the Aboriginal team would go there and play. Before they started for Sydney Mr W. E. B. Gurnett, a member of the Melbourne Cricket Club, who was represented to be wealthy, offered Wills and Mr Hayman £1000 each if they would take the blacks to England,” the article reads. “Mr Gurnett offered to find all the expenses and pay £50 to each member of the team. The offer was accepted, and the agreement embodying it was signed, and is now preserved in the Melbourne Museum. By that undertaking Mr Gurnett was to take all the Victorian matches at Geelong, Sandhurst and Castlemaine. They went through their programme in this colony and sailed for Sydney, where they started their first match on the Albert ground. The proceeds were to go to Mr Gurnett. “Disaster, however, was at hand. No sooner were the wickets pitched and all in readiness than certain legal documents were served upon Wills and Mr Gurnett, and the match could not be proceeded with. Finally the match came off, but owing to the hitch which had occurred it was not a success financially, and Mr Hayman found himself stranded at Charles Lawrence’s hotel at Manly Beach.” The 1866-67 tour was not only a financial bust but a human disaster for the team. Four of their number died during and immediately after the tour. This also brought their association with Wills to an end. His involvement in colonial cricket, football and interactions with Aboriginal communities is currently subject to a joint research project between the MCC, the AFL and Cricket Australia. It was Lawrence, then, who accompanied the team back to Victoria, and then helped oversee the 1868 trip. Details of financial agreements with the Aboriginal team for the 1868 tour are more sketchy, save for the fact that several members of the side won prize money during its course and afterwards. Mullagh, the central character in the play, was inducted into the Australian Cricket Hall of Fame in 2021. The player of the match during the Boxing Day Test is awarded the Mullagh medal - an honour received by the Indigenous cricketer Scott Boland after last year’s Ashes Test. Black Cockatoo is touring nationally and returns to Sydney in May with performances at Glen Street Theatre and Zenith Theatre Chatswood. A cultural guide to going out and loving your city. Sign up to our Culture Fix newsletter here.","image_url":null,"source_id":"theage","country":["australia"],"category":["sports"],"language":"english"},{"title":"Fresh evidence of Aboriginal XI’s financial exploitation","link":"https://www.brisbanetimes.com.au/sport/cricket/fresh-evidence-of-aboriginal-xi-s-financial-exploitation-20220407-p5abm1.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Daniel Brettig"],"video_url":null,"description":"Who promised the players of Australia’s Aboriginal cricket team £50 each for touring England in 1868? A fresh rummage through the archives following the performance of the play Black Cockatoo has provided some answers.","content":null,"pubDate":"2022-04-09 20:00:00","image_url":null,"source_id":"brisbanetimes","country":["australia"],"category":["sports"],"language":"english"},{"title":"Is Mumbai Indians out of IPL 2022: How can MI qualify for IPL 2022 playoffs?","link":"https://thesportsrush.com/cricket-news-is-mumbai-indians-out-of-ipl-2022-how-can-mi-qualify-for-ipl-2022-playoffs/","keywords":["Cricket","IPL 2022","Mumbai Indians","Indian Premier League","IPL","MI"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Is Mumbai Indians out of IPL 2022: The Rohit Sharma-led side are placed ninth at the points table after yet another loss in IPL 2022. During the 18th match of the ongoing 15th season of the Indian Premier League at the Maharashtra Cricket Association Stadium in Mumbai, Royal Challengers Bangalore (RCB) defeated the Mumbai Indians… The post Is Mumbai Indians out of IPL 2022: How can MI qualify for IPL 2022 playoffs? appeared first on The SportsRush.","content":"Is Mumbai Indians out of IPL 2022: The Rohit Sharma-led side are placed ninth at the points table after yet another loss in IPL 2022. During the 18th match of the ongoing 15th season of the Indian Premier League at the Maharashtra Cricket Association Stadium in Mumbai, Royal Challengers Bangalore (RCB) defeated the Mumbai Indians (MI) by 7 wickets, to register their third consecutive win of the season. Five-time IPL champions MI, on the other hand, have now lost their fourth consecutive match in the ongoing season, and are yet to get off the mark with a win under their belt. After being invited to bat first post losing the Toss, MI opening batters – skipper Rohit Sharma (26 off 15) and Ishan Kishan (26 off 28) got off to a decent enough start, posting 49 on the board in the Powerplay. However, post Rohit’s dismissal in the very next Over, MI witnessed a shameful collapse, and quickly found themselves tottering at 62/5 after 10.1 Overs. With half their side down, all hopes now lay on Suryakumar Yadav to take them to a decent enough total for their bowlers to have a shy at. And Yadav did oblige, as he, alongside Jaydev Unadkat (13* off 14) stitched together a 72-run partnership off 41 deliveries for the 7th wicket, while smashing 71 runs in the last five Overs, to post 151/6 on the scoreboard. Suryakumar, remained unbeaten at 68 off 37 deliveries, with the assistance of 5 Fours and 6 Sixes. In reply, the RCB batters, led by the Southpaw Anuj Rawat (66 off 47) and Virat Kohli (48 off 36) nailed the chase with utmost precision, to take their side home by 7 wickets, with nine deliveries to spare. #OneFamily #DilKholKe #MumbaiIndians #RCBvMI pic.twitter.com/gmAfQGIPPI — Mumbai Indians (@mipaltan) April 9, 2022 Is Mumbai Indians out of IPL 2022 Shockingly enough for the fans, the top two franchises in CSK and MI, who have lifted the IPL titles a combined total of 9 times in the 14 complete seasons, have both lost all their initial four matches of the season, and are the only two teams so far to not register a victory under their name as yet. Still early stages in the tournament though, the two champions sides are not yet out of the Playoffs race, but have surely made lives difficult for themselves en route to that journey. With a total of 14 league matches to be played by each of the ten franchises in the ongoing season, both MI and CSK would now have to win 8 off their remaining 10 matches to at least make it to the 4th spot. While teams, like KKR in IPL 2021, have also made it through to knock out stage with 7 wins (14 points) under their belt, it largely depended on the other teams’ match results to go their way coupled with a better Net Run Rate (NRR) post the completion of the league stage. However, with an increase in the number of league matches (74 this season as against 60 last year), teams might struggle with mere 7 wins to make it through to the Playoffs. During the 2011 edition of the IPL – the only other season with 10 partaking teams, KKR finished at the 4th spot only after winning 8 league matches. The post Is Mumbai Indians out of IPL 2022: How can MI qualify for IPL 2022 playoffs? appeared first on The SportsRush.","pubDate":"2022-04-09 18:28:41","full_description":"Is Mumbai Indians out of IPL 2022: The Rohit Sharma-led side are placed ninth at the points table after yet another loss in IPL 2022. During the 18th match of the ongoing 15th season of the Indian Premier League at the Maharashtra Cricket Association Stadium in Mumbai, Royal Challengers Bangalore (RCB) defeated the Mumbai Indians (MI) by 7 wickets, to register their third consecutive win of the season. Five-time IPL champions MI, on the other hand, have now lost their fourth consecutive match in the ongoing season, and are yet to get off the mark with a win under their belt. After being invited to bat first post losing the Toss, MI opening batters – skipper Rohit Sharma (26 off 15) and Ishan Kishan (26 off 28) got off to a decent enough start, posting 49 on the board in the Powerplay. However, post Rohit’s dismissal in the very next Over, MI witnessed a shameful collapse, and quickly found themselves tottering at 62/5 after 10.1 Overs. With half their side down, all hopes now lay on Suryakumar Yadav to take them to a decent enough total for their bowlers to have a shy at. And Yadav did oblige, as he, alongside Jaydev Unadkat (13* off 14) stitched together a 72-run partnership off 41 deliveries for the 7th wicket, while smashing 71 runs in the last five Overs, to post 151/6 on the scoreboard. Suryakumar, remained unbeaten at 68 off 37 deliveries, with the assistance of 5 Fours and 6 Sixes. In reply, the RCB batters, led by the Southpaw Anuj Rawat (66 off 47) and Virat Kohli (48 off 36) nailed the chase with utmost precision, to take their side home by 7 wickets, with nine deliveries to spare. 😞 #OneFamily #DilKholKe #MumbaiIndians #RCBvMI pic.twitter.com/gmAfQGIPPI — Mumbai Indians (@mipaltan) April 9, 2022 Shockingly enough for the fans, the top two franchises in CSK and MI, who have lifted the IPL titles a combined total of 9 times in the 14 complete seasons, have both lost all their initial four matches of the season, and are the only two teams so far to not register a victory under their name as yet. Still early stages in the tournament though, the two champions sides are not yet out of the Playoffs race, but have surely made lives difficult for themselves en route to that journey. With a total of 14 league matches to be played by each of the ten franchises in the ongoing season, both MI and CSK would now have to win 8 off their remaining 10 matches to at least make it to the 4 th spot. While teams, like KKR in IPL 2021, have also made it through to knock out stage with 7 wins (14 points) under their belt, it largely depended on the other teams’ match results to go their way coupled with a better Net Run Rate (NRR) post the completion of the league stage. However, with an increase in the number of league matches (74 this season as against 60 last year), teams might struggle with mere 7 wins to make it through to the Playoffs. During the 2011 edition of the IPL – the only other season with 10 partaking teams, KKR finished at the 4th spot only after winning 8 league matches.","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"“He’s just obviously hit that”: Jimmy Neesham criticizes Ulhas Gandhe umpire as Virat Kohli out lbw vs Mumbai Indians","link":"https://thesportsrush.com/cricket-news-hes-just-obviously-hit-that-jimmy-neesham-criticizes-ulhas-gandhe-umpire-as-virat-kohli-out-lbw-vs-mumbai-indians/","keywords":["Cricket","IPL 2022","Mumbai Indians","RCB","Dewald Brevis","Indian Premier League","MI","Royal Challengers Bangalore","Ulhas Gandhe","Virat Kohli"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Ulhas Gandhe umpire: The third umpire came under the spotlight for a controversial decision involving Virat Kohli. During the 18th match of the ongoing 15th season of the Indian Premier League between Royal Challengers Bangalore and Mumbai Indians in Pune, Mumbai Indians part-time spinner Dewald Brevis picked the all-important wicket of former Royal Challengers Bangalore… The post “He’s just obviously hit that”: Jimmy Neesham criticizes Ulhas Gandhe umpire as Virat Kohli out lbw vs Mumbai Indians appeared first on The SportsRush.","content":"Ulhas Gandhe umpire: The third umpire came under the spotlight for a controversial decision involving Virat Kohli. During the 18th match of the ongoing 15th season of the Indian Premier League between Royal Challengers Bangalore and Mumbai Indians in Pune, Mumbai Indians part-time spinner Dewald Brevis picked the all-important wicket of former Royal Challengers Bangalore captain Virat Kohli (48) off his first ball in the tournament. It all happened in what ended up becoming the last over of the match when Brevis found Kohli wanting in front of the stumps. A loud appeal was followed by umpire KN Ananthapadmanabhan raising his finger in the bowler’s favour. Kohli, who not only challenged the umpire’s decision but also signaled his bat towards him, appeared to be quite confident about hitting the ball. While the replays all but confirmed the same, third umpire Ulhas Gandhe was of the opinion that the ball hit and bat and pad simultaneously. Hence, Gandhe ruled the decision in Ananthapadmanabhan’s favour in the absence of a conclusive evidence. Visibly unhappy and frustrated, Kohli walked back to the pavilion after hitting five fours at a strike rate of 133.33. Having batted quite sensibly to share an 80-run partnership for the second wicket alongside opening batter Anuj Rawat (66) in a chase, Kohli was dismissed when Bangalore needed only eight runs in two overs to seal a 152-run chase. Playing his first-ever match of the seaosn, all-rounder Glenn Maxwell hit consecutive boundaries to seal the chase with nine balls to spare. Twitter reactions on Ulhas Gandhe umpire: Well, umm… he’s just obviously hit that #IPL2022 — Jimmy Neesham (@JimmyNeesh) April 9, 2022 Here’s a clear example of technology vs common sense. The deviation from the bat was clear, but ultra edge didn’t pick the impact. Kohli was rightly furious — Sambit Bal (@sambitbal) April 9, 2022 In the case of ball hitting the bat and pad at the same time…it’s considered bat first. As far as I know. Let’s check the laws… — Aakash Chopra (@cricketaakash) April 9, 2022 For more cricket-related news, click here. The post “He’s just obviously hit that”: Jimmy Neesham criticizes Ulhas Gandhe umpire as Virat Kohli out lbw vs Mumbai Indians appeared first on The SportsRush.","pubDate":"2022-04-09 18:10:36","full_description":"Ulhas Gandhe umpire: The third umpire came under the spotlight for a controversial decision involving Virat Kohli. During the 18th match of the ongoing 15th season of the Indian Premier League between Royal Challengers Bangalore and Mumbai Indians in Pune, Mumbai Indians part-time spinner Dewald Brevis picked the all-important wicket of former Royal Challengers Bangalore captain Virat Kohli (48) off his first ball in the tournament. It all happened in what ended up becoming the last over of the match when Brevis found Kohli wanting in front of the stumps. A loud appeal was followed by umpire KN Ananthapadmanabhan raising his finger in the bowler’s favour. Kohli, who not only challenged the umpire’s decision but also signaled his bat towards him, appeared to be quite confident about hitting the ball. While the replays all but confirmed the same, third umpire Ulhas Gandhe was of the opinion that the ball hit and bat and pad simultaneously. Hence, Gandhe ruled the decision in Ananthapadmanabhan’s favour in the absence of a conclusive evidence. Visibly unhappy and frustrated, Kohli walked back to the pavilion after hitting five fours at a strike rate of 133.33. Having batted quite sensibly to share an 80-run partnership for the second wicket alongside opening batter Anuj Rawat (66) in a chase, Kohli was dismissed when Bangalore needed only eight runs in two overs to seal a 152-run chase. Playing his first-ever match of the seaosn, all-rounder Glenn Maxwell hit consecutive boundaries to seal the chase with nine balls to spare. Well, umm… he’s just obviously hit that #IPL2022 — Jimmy Neesham (@JimmyNeesh) April 9, 2022 Here’s a clear example of technology vs common sense. The deviation from the bat was clear, but ultra edge didn’t pick the impact. Kohli was rightly furious — Sambit Bal (@sambitbal) April 9, 2022 In the case of ball hitting the bat and pad at the same time…it’s considered bat first. As far as I know. Let’s check the laws… — Aakash Chopra (@cricketaakash) April 9, 2022 For more cricket-related news, click here .","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"KKR vs DC Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update- Tata IPL 2022 - Cricket Addictor","link":"https://news.google.com/__i/rss/rd/articles/CBMinwFodHRwczovL2NyaWNrZXRhZGRpY3Rvci5jb20vZmFudGFzeS1jcmlja2V0L2trci12cy1kYy1kcmVhbTExLXByZWRpY3Rpb24tZmFudGFzeS1jcmlja2V0LXRpcHMtZHJlYW0xMS10ZWFtLXBsYXlpbmcteGktcGl0Y2gtcmVwb3J0LWluanVyeS11cGRhdGUtdGF0YS1pcGwtMjAyMi_SAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"KKR vs DC Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update- Tata IPL 2022  Cricket AddictorIPL 2022 Preview Kolkata Knight Riders vs Delhi Capitals | Cricbuzz.com - Cricbuzz  CricbuzzKKR and Shreyas Iyer hold the edge in reunion with Delhi Capitals  ESPNcricinfoIPL 2022: Match 19, KKR vs DC Match Prediction – Who will win today’s IPL match between KKR and DC?  CricTrackerRCB vs MI: Credit To Suryakumar Yadav To Get Us To 150 But It Wasn't Enough - Rohit Sharma  Cricket AddictorView Full coverage on Google News","content":null,"pubDate":"2022-04-09 17:46:08","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Royal Challengers Bangalore vs Mumbai Indians: IPL 2022 Live Cricket Score, Live Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/royal-challengers-bangalore-vs-mumbai-indians-live-score-over-match-18-t20-16-20-updates-2874566","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Royal Challengers Bangalore vs Mumbai Indians from Maharashtra Cricket Association Stadium, Pune. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-04-09 17:35:58","full_description":"Follow the Indian Premier League 2022 live cricket score on Sports.NDTV.com . After 18.0 overs, Royal Challengers Bangalore, chasing a target of 152, are 144/2. Get live score, ball by ball commentary and much more. Keep track of Indian Premier League 2022 today match between Royal Challengers Bangalore and Mumbai Indians. Everything related to Royal Challengers Bangalore and Mumbai Indians match will be available on Sports.NDTV.com . Stay updated with Royal Challengers Bangalore vs Mumbai Indians live score. Do check for Royal Challengers Bangalore vs Mumbai Indians scorecard. You can get scorecard updates, match related facts. Get quick live updates with ads, Sports.NDTV.com , which is the perfect destination for live cricket score. 17.6 overs (6 Runs) Six! 17.5 overs (3 Runs) 3 runs. 17.4 overs (0 Run) A short ball, outside off. Virat Kohli looks to hook it away but fails to get any connection. He is not at all happy with that. 17.3 overs (1 Run) Back of a length, outside off. Dinesh Karthik looks to defend. The ball goes off the inside edge to the left of Ishan Kishan for a single. 17.2 overs (1 Run) Good-length ball, on middle. Kohli tucks it to deep mid-wicket and takes a single. 17.1 overs (2 Runs) Two! Good-length ball, outside off. Virat Kohli punches it to backward point. The fielder there half-stops it. The batters take a single but the fielder has a shy at the striker's end and misses and the batters take a run more off overthrows. Jasprit Bumrah (3-0-18-0) is back on. 16.6 overs (1 Run) Slower ball, on leg. Virat Kohli makes room for himself and taps it to point for a single. 16.5 overs (1 Run) OUT! RUN OUT! Length ball, on middle. Virat Kohli plays it softly to long on and sets off for a single. He calls back for the second run but Ramandeep Singh quickly collects the ball and fires a throw at the bowler's end. He hits the stumps and Mumbai appeal for a run out. Replay shows that Anuj Rawat is fraction out of his crease. Nonetheless, he has probably played a match-winning knock for his side and departs for a well-made 66. Dinesh Karthik walks out to bat. Is that a run out? A direct hit at the bowler's end and Anuj Rawat might be in trouble. The decision has been sent upstairs. The replays show that Rawat is just short of his crease. 16.4 overs (0 Run) Length ball, around off. Virat Kohli looks to slap it through point but the ball nips back in and beats Virat Kohli on the inside edge. 16.3 overs (1 Run) NOT OUT! Full and on leg, Anuj Rawat moves to the off side and looks to flick but misses. He gets rapped on the pads. Jaydev Unadkat appeals for an lbw but the umpire says no. The ball deflects to the off side and the batters take a leg bye. Rohit Sharma opts for a review though. UltraEdge shows no bat involved. Ball Tracking shows that the ball is pitching outside leg. The original decision stays. Mumbai lose a review. Review! Rohit Sharma has opted for a review for LBW. Anuj Rawat has been struck low on his pad as he has missed his flick. The UltraEdge rolls in and it confirms that there was no bat involved. The Ball Tracking indicates that the ball was pitched outside leg. 16.2 overs (6 Runs) SIX! This is Anuj Rawat's sixth maximum! He is putting a show here! Length delivery, on off. Too easy for Anuj Rawat as he dances down and tonks it over deep mid-wicket for a biggie. He wants to finish it quickly now. 16.1 overs (0 Run) Short of a length, outside off. Anuj Rawat slaps it to cover. Jaydev Unadkat (3-0-22-1) is back on. 15.6 overs (1 Run) A full toss, wide of off. Anuj Rawat steers it to deep point for a single. Just 30 needed off 24 now! 15.5 overs (6 Runs) SIX! This time Anuj Rawat connects it well and gets the desired result! Short of a length, on middle. Anuj Rawat keeps his calm, keeps his composure and pulls it over deep square leg for a maximum. Great shot! 15.4 overs (0 Run) Slower ball, outside off. Anuj Rawat shimmies down and looks to heave it on the leg side but gets beaten by the pace. 15.4 overs (1 Run) WIDE! A full toss, well outside off. Left alone. Wide given. 15.3 overs (1 Run) Full and on middle, Virat Kohli nudges it to long on for an easy single. 15.2 overs (1 Run) Length ball, on leg. Anuj Rawat steps out and eases it to long on and crosses ends. 15.1 overs (1 Run) Short of a length, outside off. Virat Kohli cuts it very hard to backward point. The fielder there gets his fingertips on it and half-stops it. Just a single!","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637851423505243898.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Royal Challengers Bangalore vs Mumbai Indians Live Score Ball by Ball, IPL 2022 Live Cricket Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/royal-challengers-bangalore-vs-mumbai-indians-live-score-over-match-18-t20-11-15-updates-2874517","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Royal Challengers Bangalore vs Mumbai Indians from Maharashtra Cricket Association Stadium, Pune. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-04-09 17:05:57","full_description":"Follow the Indian Premier League 2022 live cricket score on Sports.NDTV.com . After 15.2 overs, Royal Challengers Bangalore, chasing a target of 152, are 113/1. Get live score, ball by ball commentary and much more. Keep track of Indian Premier League 2022 today match between Royal Challengers Bangalore and Mumbai Indians. Everything related to Royal Challengers Bangalore and Mumbai Indians match will be available on Sports.NDTV.com . Stay updated with Royal Challengers Bangalore vs Mumbai Indians live score. Do check for Royal Challengers Bangalore vs Mumbai Indians scorecard. You can get scorecard updates, match related facts. Get quick live updates with ads, Sports.NDTV.com , which is the perfect destination for live cricket score. 14.6 overs (1 Run) Back of a length, around off and hurrying onto the batter. Virat Kohli miscues his pull in the vacant mid on region for a single. 14.5 overs (1 Run) A short ball, and around off. Anuj Rawat looks to pull but it goes off the splice of the bat and just over the bowler for a single. 14.4 overs (1 Run) Good-length ball, just outside off. Virat Kohli flat-bats it to deep mid-wicket and settles for a single. 14.3 overs (0 Run) Swing and a miss! Back of a length, around off. Virat Kohli looks to heave it away but he misses. The ball kisses the thigh pad and goes through to the keeper. 14.2 overs (2 Runs) A full ball, around middle. Virat Kohli flicks it wide of the long on fielder and takes a couple of runs. 14.1 overs (4 Runs) DROPPED AND FOUR! A slower ball, into the wicket, around off. Virat Kohli whips it uppishly, straight to Dewald Brevis at deep square leg who runs forward to take it but makes a mess of it. The ball goes towards the fence. 13.6 overs (3 Runs) A length ball, around leg. Virat Kohli stays back and flicks it gently behind square on the leg side. Murugan Ashwin runs across to his right from deep backward square leg, puts in a dive and saves a run for his side. 13.5 overs (0 Run) Another quick bumper, outside off. Kohli stays back to ramp it over the keeper but he gets late on it. The ball goes past his blade. 13.4 overs (4 Runs) FOUR! Pulled away! Not in total control but he'll take that! A short ball, outside off. Virat Kohli stands tall and pulls it in front of square on the leg side. One bounce and over the deep mid-wicket fence. 13.3 overs (1 Run) A slower ball, full and just outside off. Anuj Rawat taps it behind square on the off side and gets to the other end. 13.2 overs (1 Run) Back of a length, outside off. Virat Kohli steers it to third man for a single. 13.1 overs (1 Run) A yorker-length ball, on middle. Anuj Rawat skips down and tucks it to deep mid-wicket for one run. Anuj Rawat brings up his first half century! He has played a good knock here and would want to stay till the end get his side through. 12.6 overs (1 Run) A direct hit at the striker's end and it could have been curtains for Virat Kohli! A length ball, around off. Rawat taps it towards backward point and sets off for a single. Dewald Brevis at backward point, collects the ball cleanly but misses his shy at the striker's end. Kohli dives to make it inside the crease. 12.5 overs (0 Run) A slower bumper, from 'round the wicket, outside off. Anuj Rawat hops in his crease to cut it but fails to get any blade on it. 12.4 overs (1 Run) Fuller in length, well outside off. Kohli drives hard but finds the fielder at deep cover. A single taken! 12.3 overs (1 Run) Drop and run! Good-length ball, around off. Anuj Rawat defends it to the off side and takes an easy single. 12.2 overs (1 Run) This is a length ball, around middle. Virat Kohli gets forward, tucks it towards deep mid-wicket and settles for a single this time. 12.1 overs (2 Runs) Good running between the wickets! A slower ball, into the wicket, outside off. Virat Kohli skips down and cuts it past Rohit Sharma at extra cover for a brace. 11.6 overs (4 Runs) FOUR! Cut away! Width on offer, outside off. Rawat hangs back and cuts it uppishly, past the diving fielder at backward point for a boundary. Top over for Bangalore. They require 66 runs to win from 48 balls now. 11.5 overs (6 Runs) SIX! BANG! That is an excellent shot from young Rawat! A full ball, on the pads. Rawat stays back and whips it way over the deep square leg fence for a maximum. 11.4 overs (1 Run) Back of a length, around off. Virat Kohli bunts it back to the bowler. Thampi fails to stop it and the batters take a run. 11.3 overs (0 Run) Clever bowling from Thampi! Kohli shimmies down the track so Thampi serves a bumper, around middle. Kohli fails to get any blade on it as he looks to pull. 11.2 overs (0 Run) A slower ball, into the wicket, around off. Kohli stays back and turns it towards mid-wicket. 11.1 overs (4 Runs) FOUR! Kohli makes room on the leg side. Thampi follows him with a full ball. Kohli makes use of his wrists and whips it through the mid-wicket region for a boundary. 10.6 overs (0 Run) On a length, around off. Anuj Rawat stays back and taps it towards point. A dot to end the over! 81 runs needed off 54 balls. 10.5 overs (1 Run) Flatter ball, on a length, outside off. Kohli hangs back and guides it towards short third man for a quick single. 10.4 overs (4 Runs) FOUR! Excellent use of the feet! Tossed up, on middle. Virat Kohli skips down the track and whips it wide of the long on fielder for a boundary. This might get him going now! 10.3 overs (0 Run) Nicely tossed up, outside off. Virat Kohli looks for the expansive drive but he gets a thick inside edge onto the deck. 10.2 overs (1 Run) A quicker ball, shorter in length, on middle. Anuj Rawat mistimes his pull towards deep mid-wicket for a run. 10.1 overs (4 Runs) FOUR! SMASHED! Tossed up, outside off. Anuj Rawat smacks it over the bowler's head and bags a boundary.","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637851405493057011.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Royal Challengers Bangalore vs Mumbai Indians: IPL 2022 Live Cricket Score, Live Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/royal-challengers-bangalore-vs-mumbai-indians-live-score-over-match-18-t20-6-10-updates-2874463","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Royal Challengers Bangalore vs Mumbai Indians from Maharashtra Cricket Association Stadium, Pune. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-04-09 16:59:34","full_description":"A dedicated team of experts bring you live score, live cricket score, live match update on Sports.NDTV.com . After 10.3 overs, Royal Challengers Bangalore, chasing a target of 152, are 66/1. The live updates of Royal Challengers Bangalore vs Mumbai Indians scorecard is also available. It is the perfect platform to follow your favourite teams in Indian Premier League 2022. Keep a track on your favourite batsmen and bowlers through Indian Premier League 2022 today match, ball by ball commentary, Royal Challengers Bangalore vs Mumbai Indians, Royal Challengers Bangalore vs Mumbai Indians live score, Royal Challengers Bangalore vs Mumbai Indians scorecard. Follow the excitement of the Indian Premier League 2022 on Sports.NDTV.com as you can follow live match updates and live cricket score through our platform. 9.6 overs (1 Run) Length ball, on leg. Anuj Rawat dances down and heaves it to long on. The fielder there collects the ball on the bounce. A single. At the halfway stage, Bangalore are 61/1. 91 needed from 60 balls! 9.5 overs (1 Run) On a length, outside off. Kohli dabs it to short third man for a run. 9.4 overs (4 Runs) FOUR! The required rate is creeping up so Virat Kohli decides to up the ante. Length ball, outside off. Virat Kohli shimmies down and cuts it uppishly to sweeper cover for a boundary. 9.3 overs (1 Run) This is worked to deep square leg for a single. 9.2 overs (0 Run) Slower delivery, outside off. Anuj Rawat is completely beaten by the pace there and the ball just sneaks past his blade and goes through to the keeper. 9.1 overs (1 Run) On a length, outside off. Virat Kohli drops it towards point and settles for a single. 8.6 overs (1 Run) Drop and run! Back of a length, around off. Kohli taps it towards point and scampers through to the other end. 8.5 overs (1 Run) Good-length ball, around off. Anuj Rawat defends it to the off side and takes a quick run. 8.4 overs (1 Run) On a length, on leg. Virat Kohli clips it off his pads to fine leg for a single. 8.3 overs (0 Run) Fuller, on middle. Played back to the bowler. 8.2 overs (0 Run) Length ball, on off. Virat Kohli chops it to point. Virat Kohli walks in at number 3. 8.1 overs (0 Run) OUT! CAUGHT! Jaydev Unadkat bags his first wicket and breaks the 50-run stand. Mumbai needed this wicket desperately. An off-paced delivery, on middle. Faf du Plessis goes for the big shot but gets undone by the change of pace. He heaves it straight down the throat of the long on fielder where Suryakumar Yadav takes a simple catch. He can do nothing wrong in this match and Mumbai have got the opening they were looking for. Jaydev Unadkat comes back to bowl. 7.6 overs (1 Run) Length ball, on off. Faf du Plessis slashes it to extra cover. Rohit Sharma there dives to his right and keeps it down to just a single. 50 up for Bangalore! 7.5 overs (0 Run) On a length, outside off. Faf du Plessis cuts it straight to backward point. 7.4 overs (1 Run) Length ball, leg-lined. Anuj Rawat tucks it to square leg for one. 7.3 overs (1 Run) Short of a length, on off. Faf du Plessis dabs it to short third man and a little misfield allows the batters to take a single. 7.2 overs (1 Run) Length ball, outside off. Anuj Rawat dabs it to backward point for a quick single. Anuj Rawat wasn't looking for a single initially but sees Faf du Plessis calling for it and decides to take it. He puts in a dive and clashes with Kieron Pollard in the process but seems okay. 7.1 overs (1 Run) Short of a length, outside off. Pulled to deep mid-wicket for a single. Strategic break! The pair of Anuj Rawat and Faf du Plessis has ensured that Bangalore doesn't lose early wickets and they are also keeping up with the required run rate. Mumbai have bowled so far but they will need to pick wickets if they are to put some pressure on Bangalore's batters. The chasing side bats pretty deep and they will be happier of the two at the end of 7 overs. Kieron Pollard comes into the attack now. 6.6 overs (0 Run) Tossed up, on middle. Anuj Rawat with a solid front foot defence. 6.6 overs (1 Run) WIDE! A googly, well outside off. Murugan Ashwin will have to reload this one as it's a wide. 6.5 overs (1 Run) Loopy ball, on middle. Faf du Plessis eases it down to long on for one. 6.4 overs (2 Runs) On off, cut away to deep backward point for a couple of runs. 6.3 overs (4 Runs) FOUR! Faf du Plessis finds the gap! Overpitched, outside off. Faf du Plessis drives it crisply to long off for a boundary. 6.2 overs (1 Run) Full and on off, Anuj Rawat smacks it to long off. Suryakumar Yadav runs to his left and dives to stop the ball. Only a single! 6.1 overs (6 Runs) SIX! Anuj Rawat decides to break the shackles! A full toss, on middle. Anuj Rawat sits down on one knee and sweeps it over deep mid-wicket. Poor ball from Murugan Ashwin and gets punished. Anuj Rawat releases the pressure with that shot. 5.6 overs (0 Run) A dot to end the Powerplay! A yorker, outside off. Faf du Plessis squeezes it out to backward point. After the Powerplay, Bangalore are 30/0. 5.5 overs (1 Run) Length ball, on leg. Anuj Rawat looks to defend. The ball goes off the inside half to square leg for a single. 5.4 overs (0 Run) Another dot! Length ball, on middle. Anuj Rawat keeps it out. 5.3 overs (0 Run) These two are struggling to rotate the strike at the moment! Good-length ball, shaping away from off. Anuj Rawat looks to defend. The ball whizzes past the outside edge. 5.2 overs (0 Run) A low full toss, on middle and leg, Anuj Rawat plays it to mid on. 5.1 overs (2 Runs) Back of a length, on middle. Anuj Rawat shimmies down and slaps it through mid off and extra cover. Kieron Pollard gives it a chase and stops the ball with his legs. Keeps it down to a brace.","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637851401658770691.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Royal Challengers Bangalore vs Mumbai Indians Live Score Ball by Ball, IPL 2022 Live Cricket Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/royal-challengers-bangalore-vs-mumbai-indians-live-score-over-match-18-t20-1-5-updates-2874423","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Royal Challengers Bangalore vs Mumbai Indians from Maharashtra Cricket Association Stadium, Pune. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-04-09 16:12:04","full_description":"A dedicated team of experts bring you live score, live cricket score, live match update on Sports.NDTV.com . After 5.2 overs, Royal Challengers Bangalore, chasing a target of 152, are 29/0. The live updates of Royal Challengers Bangalore vs Mumbai Indians scorecard is also available. It is the perfect platform to follow your favourite teams in Indian Premier League 2022. Keep a track on your favourite batsmen and bowlers through Indian Premier League 2022 today match, ball by ball commentary, Royal Challengers Bangalore vs Mumbai Indians, Royal Challengers Bangalore vs Mumbai Indians live score, Royal Challengers Bangalore vs Mumbai Indians scorecard. Follow the excitement of the Indian Premier League 2022 on Sports.NDTV.com as you can follow live match updates and live cricket score through our platform. 4.6 overs (0 Run) An arm ball that goes on with the angle, from off. Faf du Plessis gets cramped for room as he tries to cut it. It goes off the inner half of the bat towards mid off. Just one run off the over! 4.5 overs (0 Run) Four dots in a row! This is a quicker ball, a googly, on a length, around middle and turning in late. Faf du Plessis misses his flick and gets hit on his pad. Outside the line though! 4.4 overs (0 Run) An overpitched ball, on middle. Faf du Plessis digs it out back to the bowler. 4.3 overs (0 Run) A flat googly, on a length, around off. Faf du Plessis gets forward and defends it solidly towards the cover fielder. 4.2 overs (0 Run) Flatter ball, on a length, around off. Faf du Plessis defends it onto the deck. 4.1 overs (1 Run) Floated, full and around off. Anuj Rawat flicks it to deep mid-wicket and settles for a single. 3.6 overs (1 Run) Uppish but safe! A length ball, around leg. Anuj Rawat flicks it uppishly just past Rohit Sharma at mid-wicket who dives to his left to grab the ball. The skipper fails to catch it and the batters take a single as the ball goes towards deep mid-wicket. 3.5 overs (1 Run) A full ball, around leg. Faf du Plessis tickles it through the fine leg region. Jaydev Unadkat there, moves across to his right, puts in a dive and saves three runs for his side. 3.4 overs (1 Run) Back of a length, just outside off. Anuj Rawat hangs back and cuts it to the backward point fielder who fumbles, and the batters steal a single. 3.3 overs (0 Run) A pinpoint yorker, around off. Anuj Rawat squeezes it out watchfully. 3.2 overs (0 Run) Fuller in length, well outside off. Anuj Rawat reaches out to slog but it goes off the toe end towards the mid off fielder. 3.1 overs (1 Run) Good-length ball, around middle. Faf du Plessis tucks it around the corner and rotates the strike. 3.1 overs (1 Run) Wide! A wayward ball, down leg. Faf du Plessis lets it be and the umpire stretches his arms to signal wide. 2.6 overs (1 Run) A full ball, around middle. Faf du Plessis flicks it towards deep square leg for a single. 2.5 overs (1 Run) Leg bye! A direct hit here might have been interesting! A length ball, around leg. Rawat misses his flick yet again and gets hit high on his pad. The ball rolls to the short fine leg fielder. The batters cross for a leg bye. The fielder there misses his shy at the striker's end. 2.4 overs (1 Run) Bumrah goes for a yorker but ends up serving a low full toss, around off. Faf du Plessis works it to mid on for a single. 2.3 overs (1 Run) Leg bye! Back of a length, around leg. Anuj Rawat misses his flick and gets hit on his thigh pad. The ball rolls to the leg side for a leg bye. 2.2 overs (2 Runs) A full ball, around middle. Anuj Rawat gets forward and tucks it wide of Suryakumar Yadav at mid on for a brace. 2.1 overs (1 Run) A yorker, around middle. Faf du Plessis digs it out watchfully towards mid-wicket and gets to the other end. 1.6 overs (0 Run) A length ball, just outside off. Anuj Rawat taps it towards point. 13 runs off the over, a good one for Bangalore! 1.5 overs (6 Runs) SIX! AND AGAIN! Excellent use of the feet from Anuj Rawat! He skips down the track to this length ball and tonks it over the long on fence this time. Back-to-back sixes for the southpaw! 1.4 overs (6 Runs) SIX! WOW! Anuj Rawat gets off the mark in some style! A length ball, around off. Anuj Rawat skips down the track and smacks it over the long off fence for a maximum. 1.3 overs (0 Run) Short of a length, around off. Anuj Rawat covers his off pole and defends it. Rawat is yet to open his account! 1.2 overs (0 Run) On a length, jagging back in from off. Anuj Rawat misses his flick and gets hit on his thigh pad. 1.1 overs (1 Run) Good-length delivery, around off. Faf du Plessis taps it towards the off side and takes off for a single. He is off the mark! Jaydev Unadkat will operate from the other end. 0.6 over (0 Run) Good-length ball, around middle. Anuj Rawat prods and blocks it out. Good start from Basil Thampi, just one run off the first over. 0.5 over (0 Run) Short of a length, outside off. Anuj Rawat lets it sail through to the keeper. 0.4 over (1 Run) Leg bye! A length ball, angling in from middle. Faf du Plessis misses his flick and gets hit on his pad. The ball rolls towards short fine leg for a leg bye. A direct hit at the striker's end but Anuj Rawat was well inside the crease. 0.3 over (0 Run) Thampi hits the deck hard, around off. Faf du Plessis taps it towards point. 0.2 over (0 Run) Play and a miss! Back of a length, outside off. Faf du Plessis sits back and looks to slap it through cover but gets no bat on it. 0.1 over (0 Run) A full ball, well outside off. Faf du Plessis lets it through to the keeper. Some movement early on for Thampi!","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637851373158096115.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Royal Challengers Bangalore vs Mumbai Indians: IPL 2022 Live Cricket Score, Live Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/royal-challengers-bangalore-vs-mumbai-indians-live-score-over-match-18-t20-16-20-updates-2874353","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Royal Challengers Bangalore vs Mumbai Indians from Maharashtra Cricket Association Stadium, Pune. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-04-09 15:43:45","full_description":"Follow the Indian Premier League 2022 live cricket score on Sports.NDTV.com . After 20.0 overs, Mumbai Indians are 151/6. Get live score, ball by ball commentary and much more. Keep track of Indian Premier League 2022 today match between Royal Challengers Bangalore and Mumbai Indians. Everything related to Royal Challengers Bangalore and Mumbai Indians match will be available on Sports.NDTV.com . Stay updated with Royal Challengers Bangalore vs Mumbai Indians live score. Do check for Royal Challengers Bangalore vs Mumbai Indians scorecard. You can get scorecard updates, match related facts. Get quick live updates with ads, Sports.NDTV.com , which is the perfect destination for live cricket score. Right then! 152 is what Bangalore need to chase and they would have taken this score at the start as they have enough firepower in their batting and top of that, Glenn Maxwell is back in the mix as well. Mumbai have made a decent recovery and the onus is on their bowlers now to do the job and get their first win of the season. Stay tuned to see how the chase unfolds... Harshal Patel is up for a quick chat. He says that he will take 7 runs off the last over. Adds that the ball was drifting through the air and he was keeping an eye on his arm speed. Tells that it is important to maintain the arm speed. Mentions that it is a good wicket to bat on and chasing 152 shouldn't be any problem for them, if they start well in the Powerplay. Things didn't quite go well for Bangalore at the start as the bowlers leaked some runs and found it tough to get the breakthrough but Harshal Patel did that job in his first over itself. After that, the bowlers just turned the game around and found quick wickets. They put a halt to the flow of runs after the Powerplay and capitalized on the pressure they created with regular wickets. They were in the driver's seat but will be disappointed that they let the game slip away towards the backend. It's still a chaseable total and Bangalore would be hoping to make it three wins on the trot. Mumbai were off to a great start and enjoyed a great Powerplay as both Ishan Kishan and Rohit Sharma scored freely and stitched 50-runs for the opening stand. Rohit Sharma was looking very good but fell after the Powerplay. And after he fell, Mumbai started to lose wickets in heap, and from 50-1, they fell to 62-5. It all boiled down to Suryakumar Yadav and he played a lone battle to get Mumbai out of the rut. He played a gem of a knock and it is only because of his knock that Mumbai have a respectable total on the board. They might be still 15-20 runs short but given how they were after 14 overs, they would take this score any day and would be confident of defending it. If Mumbai have reached this score, they only have Suryakumar Yadav to thank for. What an innings we have just witnessed! He has played a superb knock under pressure and has made sure to take Mumbai past 150. Bangalore bowlers were terrific with the ball but they will be disappointed that they leaked runs after taking 6 wickets at regular intervals. 19.6 overs (6 Runs) SIX! BANG! MUMBAI END ON A HIGH! A full toss, outside off. Suryakumar Yadav shuffles across and whacks it way over the deep mid-wicket fence for a biggie. Mumbai finish with 151/6. 19.5 overs (0 Run) A slower ball, dipping, outside off. Suryakumar Yadav looks to play it across the line but he fails to get any bat on it. This is excellent bowling from Patel. 19.4 overs (0 Run) A slower ball, into the wicket, around off. Suryakumar Yadav shuffles across and looks to scoop it over the keeper. He fails to middle it. It takes a feather and goes towards the keeper, on the bounce. 19.3 overs (1 Run) A yorker, around off. Jaydev Unadkat digs it out back past the bowler, towards long on for a single. 19.2 overs (0 Run) A bumper, outside off. Jaydev Unadkat looks to pull but he gets a bit late on his shot. The ball whizzes past his blade. Two dots in a row. 19.1 overs (0 Run) Another slow, dipping full toss, outside off. Jaydev Unadkat looks to heave it away but he misses. 18.6 overs (6 Runs) SIX! 23 runs off the over! This is a very full ball, well outside off. Suryakumar Yadav reaches out and slices it over the short third man fielder. The ball hits the boundary cushions on the full and it is a biggie. 18.5 overs (6 Runs) SIX! WOW! SKY, YOU BEAUTY! Siraj goes for a yorker but misses his mark. SKY sits back and whips it high and handsomely over the deep square leg fence for a maximum. A 98-metre hit that! 18.4 overs (1 Run) In the air...but safe! A short ball, around off. Jaydev Unadkat looks to pull but he gets a top edge which falls just in front of the fine leg fielder for a run. 18.3 overs (1 Run) A full ball, on middle. Suryakumar Yadav whips it to deep square leg for a single. FIFTY FOR SKY! He has kept Mumbai in the contest! 18.2 overs (0 Run) Fuller in length, outside off. Suryakumar Yadav reaches out and drags it back to the bowler. Siraj collects the ball and has a shy at the striker's end but he misses. 18.2 overs (3 Runs) NO BALL! A full ball, on middle. Suryakumar Yadav whips it wide of the long on fielder and takes a couple of runs. That brings up the 50-run stand between these two batters. The umpire signals no ball as Siraj oversteps. Free Hit to follow. 18.1 overs (6 Runs) SIX! BOOM! Suryakumar Yadav carries on in his merry way! Stand and deliver stuff from him! Back of a length, outside off. SKY stays back and launches it way over the extra cover fence for a maximum. Mohammed Siraj (3-0-28-0) comes back into the attack. 17.6 overs (2 Runs) A full ball, outside off. Jaydev Unadkat mistimes his slog just over the extra cover fielder for a brace. 17.5 overs (4 Runs) FOUR! UP AND OVER! A slower ball, full and outside off. Jaydev Unadkat prods and lofts it over the mid off fielder for a boundary. 17.4 overs (1 Run) On a length, down leg. Suryakumar Yadav pulls it to deep backward square leg. Akash Deep from fine leg runs across and does well to stop the ball. Keeps it down to just a single. 17.3 overs (4 Runs) FOUR! Top shot! Back of a length, outside off. Suryakumar Yadav throws the kitchen sink at it. He carves it brilliantly over backward point for a boundary. 17.2 overs (0 Run) Excellent yorker on middle, Suryakumar Yadav could do nothing but jam it out. 17.1 overs (2 Runs) NOT OUT! Leg bye! Umpire's call saves Suryakumar Yadav here! An excellent delivery from Harshal Patel! A slower full toss, dipping on the batter. SKY looks to play it across the line but he misses and gets hit near the rib-cage. Bangalore appeal but the umpire says no. They opt for a review. The Ball Tracker shows that the impact was in line of the stumps. But it is umpire's call on wickets hitting. Bangalore retain their review. Bangalore have opted a review for an LBW. The third umpire first checks if it's a waist hight no ball but it's a legal delivery as the ball is dipping low. UltraEdge shows no bat involved and the Ball Tracking shows that it is umpire's call on wickets hitting. The on-field call was NOT OUT so it will stay the same. 16.6 overs (0 Run) A googly, on a length, around off. Jaydev Unadkat prods and keeps it out. 16.5 overs (1 Run) Tossed up, on off. Suryakumar Yadav whips it to deep square leg for a single. 16.4 overs (6 Runs) SIX! BANG! Take that, says Suryakumar Yadav! 150th T20 six for SKY! This is tossed up, on middle. SKY kneels and slog-sweeps it way over the deep mid-wicket fence for a massive biggie. 16.3 overs (1 Run) Slightly short and around off. Jaydev Unadkat rocks back and cuts it towards the deep point fielder for a run. 16.2 overs (1 Run) An overpitched ball, around off. SKY whips it towards long on for only a single. 16.1 overs (0 Run) Flatter and quicker, around off. SKY stays back and cuts it to the point fielder. 15.6 overs (0 Run) Good-length ball, around off. Jaydev Unadkat looks to heave it away but he misses and gets hit on his thigh pad. 7 runs off the over. 15.5 overs (0 Run) BEATEN! On a length, just outside off. Jaydev Unadkat pokes at it but the ball zips past his blade. 15.4 overs (2 Runs) In the air...but safe! A short ball, outside off. Jaydev Unadkat looks to pull but it goes off the top edge, over the mid-wicket fielder and the batters take two runs. 15.3 overs (1 Run) A yorker-length ball, on middle. SKY digs it out towards long on and takes a single. 15.2 overs (0 Run) A slower ball, on a length, outside off. Suryakumar Yadav taps it towards backward point. 15.1 overs (4 Runs) FOUR! SMASHED! Back of a length, outside off. Suryakumar Yadav stays back and pulls it wide of the long on fielder to bag a boundary. So effortless from SKY!","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637851356161336886.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL 2022, RCB vs MI Live Score: Suryakumar Yadav Hits Fifty As Mumbai Eye Big Finish vs RCB - NDTV Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMihwFodHRwczovL3Nwb3J0cy5uZHR2LmNvbS9pcGwtMjAyMi9pcGwtMjAyMi1yY2ItdnMtbWktbGl2ZS1zY29yZS11cGRhdGVzLXJveWFsLWNoYWxsZW5nZXJzLWJhbmdhbG9yZS12cy1tdW1iYWktaW5kaWFucy1saXZlLXNjb3JlLTI4NzM5NjDSAY0BaHR0cHM6Ly9zcG9ydHMubmR0di5jb20vaXBsLTIwMjIvaXBsLTIwMjItcmNiLXZzLW1pLWxpdmUtc2NvcmUtdXBkYXRlcy1yb3lhbC1jaGFsbGVuZ2Vycy1iYW5nYWxvcmUtdnMtbXVtYmFpLWluZGlhbnMtbGl2ZS1zY29yZS0yODczOTYwL2FtcC8x?oc=5","keywords":null,"creator":null,"video_url":null,"description":"IPL 2022, RCB vs MI Live Score: Suryakumar Yadav Hits Fifty As Mumbai Eye Big Finish vs RCB  NDTV SportsRCB vs MI Match Prediction- Who Will Win Today's IPL Match Between Royal Challengers Bangalore and Mumbai Indians, IPL 2022, Match 18  Cricket AddictorMatch Preview - Mumbai vs RCB, Indian Premier League 2022, 18th Match  ESPNcricinfoRCB vs MI Dream11 Prediction | Royal Challengers Bangalore vs Mumbai Indians Dream 11 Prediction for today’s IPL Match – Fantasy Cricket Team Prediction Tips by Experts for Match 18  KreedOnIPL 2022 RCB vs MI Live Score: Suryakumar, Unadkat rescue Mumbai Indians  Hindustan TimesView Full coverage on Google News","content":null,"pubDate":"2022-04-09 15:30:50","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Royal Challengers Bangalore vs Mumbai Indians Live Score Ball by Ball, IPL 2022 Live Cricket Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/royal-challengers-bangalore-vs-mumbai-indians-live-score-over-match-18-t20-11-15-updates-2874279","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Royal Challengers Bangalore vs Mumbai Indians from Maharashtra Cricket Association Stadium, Pune. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-04-09 15:15:46","full_description":"Follow the Indian Premier League 2022 live cricket score on Sports.NDTV.com . After 15.2 overs, Mumbai Indians are 96/6. Get live score, ball by ball commentary and much more. Keep track of Indian Premier League 2022 today match between Royal Challengers Bangalore and Mumbai Indians. Everything related to Royal Challengers Bangalore and Mumbai Indians match will be available on Sports.NDTV.com . Stay updated with Royal Challengers Bangalore vs Mumbai Indians live score. Do check for Royal Challengers Bangalore vs Mumbai Indians scorecard. You can get scorecard updates, match related facts. Get quick live updates with ads, Sports.NDTV.com , which is the perfect destination for live cricket score. 14.6 overs (1 Run) 1 run. 14.5 overs (4 Runs) Four! 14.4 overs (0 Run) Quicker one on off, Suryakumar Yadav knocks it back to the bowler. 14.3 overs (6 Runs) SIX! BOOM! Suryakumar Yadav decides to go big as he knows it's now or never! He shimmies down the track and gets to the pitch of the ball. Hammers it over wide of long off for a biggie. Unbelievable shot! Made it look so easy! 14.2 overs (1 Run) This is pushed to sweeper cover for a single. 14.1 overs (0 Run) Tossed up, on off. Jaydev Unadkat pushes it to point. Strategic break! Well, Bangalore is all over Mumbai at the moment and the latter have collapsed after getting off to a good start. After being 49/0 at the end of the Powerplay, Mumbai have lost wickets in a cluster and they find themselves in deep, deep trouble. Bangalore will look to take the remaining wickets quickly and not let Suryakumar Yadav free his arms. 13.6 overs (0 Run) Short ball that keeps really low, on middle. Suryakumar Yadav crouches initially but sees that the ball has kept low so adjusts and fends it out to the off side. Terrific over from Harshal Patel. A wicket and 3 runs off it. 13.5 overs (0 Run) An off-paced delivery again, on off. Suryakumar Yadav knocks it to point. 13.4 overs (0 Run) Pitched up, on off. Suryakumar Yadav plays a straight drive but Harshal Patel gets his right hand out and stops the ball from racing away. 13.3 overs (1 Run) Length ball, outside off. Jaydev Unadkat has a poke at it now. The ball goes off the outside edge to third man for a single. 13.2 overs (0 Run) OUT! CAUGHT BEHIND! Harshal Patel is lethal when it comes to slower deliveries and he gets a wicket off a slower ball once again. Length ball, outside off, off-paced. Ramandeep Singh has a poke at it and gets beaten by the pace. The ball just about kisses the outside edge and carries through to the keeper. Dinesh Karthik does well to move forward and take the catch. Harshal Patel appeals but the umpire is not sure if it's a clean catch or not. The third umpire first checks if there is an edge and UltraEdge confirms, there is. The catch is taken cleanly as well and Mumbai lose their sixth wicket now. Jaydev Unadkat is the new batter in for Mumbai. Is that a clean catch? Dinesh Karthik seems to be confident behind the sticks as he has taken the catch by bending low in front. The umpire is not convinced though and he has sent it upstairs. The replays suggest that it was a clean catch by Dinesh Karthik and Ramandeep Singh is a goner. 13.1 overs (2 Runs) On a length, on off. Ramandeep Singh punches it to sweeper cover for a brace. Harshal Patel (1-0-2-1) comes back to bowl. 12.6 overs (4 Runs) MISFIELD AND FOUR! Floats it up, on middle and leg, Suryakumar Yadav makes room and cuts it to deep point. The ball went straight into the hands of Mohammed Siraj but he somehow manages to make a mess of it and the ball goes through him and into the ropes. A boundary! Bangalore would not want any of this as they are in the driver's seat at the moment. 12.5 overs (1 Run) Short and wide outside off, Ramandeep Singh thumps it to long off for one. 12.4 overs (1 Run) On the pads, Suryakumar Yadav nudges it to deep mid-wicket for a single. 12.3 overs (0 Run) Outside off, Suryakumar Yadav cuts it hard but straight to point. 12.2 overs (0 Run) Nicely bowled! Tossed up, on off, spinning away. Suryakumar Yadav works it off the outside edge to short third man. 12.1 overs (1 Run) Short and on off, Ramandeep Singh hangs back and works it to long on for a run. Shahbaz Ahmed comes into the attack now. 11.6 overs (4 Runs) FOUR! Much-needed boundary for Mumbai! Lovely stroke from SKY! Length ball, outside off. Suryakumar Yadav lifts it over covers for a superb boundary. End of a good spell from Akash Deep. 4-1-20-1 from him. 11.5 overs (1 Run) Short of a length, outside off. Ramandeep Singh guides it to third man for a single. 11.4 overs (0 Run) Length, on middle. Ramandeep Singh defends it onto the pitch. 11.3 overs (0 Run) Swing and a miss! Back of a length, outside off. Ramandeep Singh goes for the big heave but makes no connection. 11.2 overs (0 Run) Good-length ball, on middle. Ramandeep Singh keeps it out. 11.1 overs (1 Run) Back of a length, around off. Suryakumar Yadav gets cramped for room. Somehow manages to dab it down to third man for one. 10.6 overs (1 Run) Loopy ball, full and outside off. Suryakumar Yadav drives it to long off and keeps the strike. Another wonderful over for Bangalore. A wicket and just 2 runs off it. 10.5 overs (1 Run) Off the mark now! Full and on off, Ramandeep Singh eases it down to long on for a single. 10.4 overs (0 Run) Tossed up nicely, outside off. Ramandeep Singh lunges forward and blocks it out. 10.3 overs (0 Run) Full and on off, Ramandeep Singh prods and keeps it out. 10.2 overs (0 Run) Another googly, on middle. Ramandeep Singh manages to tuck it to mid-wicket. Ramandeep Singh walks out to bat. 10.1 overs (0 Run) OUT! LBW! And just like that, half of the Mumbai side are back in the hut for 62. What a ball from Wanindu Hasaranga! Absolutely magnificent. You need something special to get rid of Kieron Pollard and Wanindu Hasaranga has delivered that. Bowls a googly, that spins back from outside off. Kieron Pollard completely misses it and gets struck on the pads. Wanindu Hasaranga appeals and the umpire raises his dreaded finger. Kieron Pollard opts for the review though. UltraEdge shows a flat line as the ball passes the bat. Ball Tracking shows that the impact was in line of the stumps, the ball was pitching outside off and it is umpire's call on wickets hitting. Bangalore side is pumped up now and Mumbai are in big, big trouble.","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637851339359248703.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL 2022 RCB vs MI Live Score: Rohit, Brevis depart; Mumbai lose two wickets - Hindustan Times","link":"https://news.google.com/__i/rss/rd/articles/CBMinQFodHRwczovL3d3dy5oaW5kdXN0YW50aW1lcy5jb20vY3JpY2tldC9pcGwtMjAyMi1yY2ItdnMtbWktbGl2ZS1zY29yZS1yb3lhbC1jaGFsbGVuZ2Vycy1iYW5nYWxvcmUtdnMtbXVtYmFpLWluZGlhbnMtbWF0Y2gtMTgtbGl2ZS11cGRhdGVzLTEwMTY0OTUwMjM5MjE4OS5odG1s0gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"IPL 2022 RCB vs MI Live Score: Rohit, Brevis depart; Mumbai lose two wickets  Hindustan TimesRCB v MI Preview, IPL 2022: Game Day  Royal Challengers BangaloreRCB vs MI Match Prediction- Who Will Win Today's IPL Match Between Royal Challengers Bangalore and Mumbai Indians, IPL 2022, Match 18  Cricket AddictorMatch Preview - Mumbai vs RCB, Indian Premier League 2022, 18th Match  ESPNcricinfoRCB vs MI Dream11 Prediction | Royal Challengers Bangalore vs Mumbai Indians Dream 11 Prediction for today’s IPL Match – Fantasy Cricket Team Prediction Tips by Experts for Match 18  KreedOnView Full coverage on Google News","content":null,"pubDate":"2022-04-09 14:48:33","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Royal Challengers Bangalore vs Mumbai Indians: IPL 2022 Live Cricket Score, Live Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/royal-challengers-bangalore-vs-mumbai-indians-live-score-over-match-18-t20-6-10-updates-2874215","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Royal Challengers Bangalore vs Mumbai Indians from Maharashtra Cricket Association Stadium, Pune. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-04-09 14:42:10","full_description":"A dedicated team of experts bring you live score, live cricket score, live match update on Sports.NDTV.com . After 10.1 overs, Mumbai Indians are 62/5. The live updates of Royal Challengers Bangalore vs Mumbai Indians scorecard is also available. It is the perfect platform to follow your favourite teams in Indian Premier League 2022. Keep a track on your favourite batsmen and bowlers through Indian Premier League 2022 today match, ball by ball commentary, Royal Challengers Bangalore vs Mumbai Indians, Royal Challengers Bangalore vs Mumbai Indians live score, Royal Challengers Bangalore vs Mumbai Indians scorecard. Follow the excitement of the Indian Premier League 2022 on Sports.NDTV.com as you can follow live match updates and live cricket score through our platform. 9.6 overs (0 Run) Swing and a miss! Back of a length, outside off. Suryakumar Yadav looks to cut hard but the ball zips past his outside edge. Kieron Pollard is the new batsman in. 9.5 overs (0 Run) OUT! RUN OUT! Oh, dear! This is suicidal from Varma! Mumbai lose another wicket and they are in deep trouble now! Varma probably took on the wrong man in the field there. This was a good-length ball, around off. Tilak Varma defends it towards extra cover and looks to steal a quick run. It is Glenn Maxwell who runs in front, collects the ball and underarms the ball to hit the stumps at the bowler's end. Tilak Varma is way short of his crease and he departs for a duck. Mumbai are losing their way here. 9.4 overs (0 Run) Chopped on, almost! Short of a length, around off and cramping the batter for room. Tilak Varma stays back to defend but the ball takes the inside edge and falls just wide of the leg stump. 9.3 overs (0 Run) Good-length ball, around off. Tilak Varma taps it towards point. The new batter in is Tilak Varma. 9.2 overs (0 Run) OUT! CAUGHT! Ishan Kishan tries to be cheeky but ends up losing his wicket in doing so! This was a short-of-a-length ball, just outside off. Ishan sits back and looks to ramp it over the third man fence. Although, he does not time it well and the ball goes high in the air towards the third man fielder. Mohammed Siraj there, runs to his right and takes a good catch just in front of the ropes. 9.1 overs (0 Run) That took off from a length! Back of a length, outside off. Ishan Kishan hangs back and tries to cut hard but the ball whizzes past his outside edge. 8.6 overs (0 Run) This is a quicker ball, on a length, around middle and staying a touch low. Suryakumar Yadav stays back and bunts it to the right of the bowler. Wanindu Hasaranga dives to that side and stops a single. Another successful over for Bangalore. 8.5 overs (1 Run) Flatter and quicker, around middle. Ishan Kishan prods and works it to long on for a run. 8.4 overs (1 Run) Tosses it up, outside off. Suryakumar Yadav drives it towards deep cover and takes a run. Drinks! Harshal Patel halted the flow of runs removing Rohit Sharma and now Wanindu Hasaranga has got rid of the agressive Dewald Brevis as well. Bangalore would look to keep chipping in with regular wickets while Mumbai would now hope that Ishan Kishan bat through along with Suryakumar Yadav who walks out to the middle. 8.3 overs (0 Run) OUT! LBW! Wanindu Hasaranga strikes now and this is a timely wicket for Bangalore. A smart move by Faf du Plessis to bring on the leggie. Hasaranga serves a googly, on a length, around off and turning in sharply. Brevis stays back and looks to play it across the line. He misses as the ball spins past his blade. Brevis is pinged on his pad and the bowler appeals. The umpire raises his finger in no time as that looked plumb in front. 8.2 overs (1 Run) Shorter in length, outside off. Ishan Kishan pulls it awkwardly towards deep mid-wicket for a single. 8.1 overs (1 Run) This is darted on the pads. Dewald Brevis tickles it fine through the fine leg region for a run. 7.6 overs (1 Run) Shorter in length, outside off. Dewald Brevis cuts it through the point region. Shahbaz Ahmed in the deep cuts it off by running across to his left. The batters take a single. 7.5 overs (0 Run) BEATEN! Back of a length, just outside off and shaping away just that little bit from the batter. Dewald Brevis hangs back to push it through the off side but the ball zips past his outside edge. 7.4 overs (0 Run) Swing and a miss! On a length, just outside off. Brevis skips down the track and looks to slog but he fails to get any blade on it. 7.3 overs (1 Run) A short ball, around leg. Ishan Kishan mistimes his pull shot towards deep mid-wicket and the batters cross ends. 7.2 overs (1 Run) On a length, around middle. Dewald Brevis tucks it wide of the long on fielder and settles for a single. 7.1 overs (4 Runs) FOUR! EDGY! Slightly short and outside off. Brevis looks to cut hard but he gets a thick outside edge. The ball goes past diving Virat Kohli at wide first slip and races away to the fence. 6.6 overs (1 Run) Back of a length, outside off. Dewald Brevis punches it towards the cover fielder who half-stops it with a dive. Brevis collects a single to get off the mark. Just 2 runs and a wicket off the over. 6.5 overs (0 Run) A slower ball, full and on middle. Dewald Brevis sits back and works it towards mid-wicket. Four dots in a row. Excellent stuff from Harshal Patel! 6.4 overs (0 Run) Good-length ball, around middle. Brevis nudges it towards mid-wicket. 6.3 overs (0 Run) A length ball, around off. Brevis prods and defends it a bit uppishly towards the cover fielder. Dewald Brevis walks out to bat at No.3. 6.2 overs (0 Run) OUT! CAUGHT AND BOWLED! Harshal Patel strikes and he gets rid of Mumbai's skipper, who was looking so good out in the middle. Patel is delighted! Brilliant bowling from him and Rohit is absolutely gutted with that! Coming to the delivery - It was an off-cutter, full and just outside off. Rohit gets deceived by the change of pace as he looks to push it through the off side. He checks his shot in the end but ends up chipping it straight back to the bowler. Harshal Patel takes a simple catch in his followthrough. 6.1 overs (1 Run) On a length, around middle and leg. Ishan flicks it towards deep mid-wicket and rotates the strike. 5.6 overs (4 Runs) FOUR! GLORIOUS! A half-volley, outside off. Rohit prods and caresses it through the cover region to fetch himself another boundary. Mumbai are 49/0 at the end of the Powerplay. 5.5 overs (2 Runs) A low full toss, outside off. Rohit drills it to sweeper cover for a brace. 5.4 overs (0 Run) A length ball, angling in from middle. Rohit tickles it nicely but finds the short fine leg fielder. A few yards on either side of the fielder and it would have raced away to the fence. 5.3 overs (1 Run) Short of a length, outside off. Ishan Kishan slaps it through the cover region. There is a fielder stationed in the deep, so Kishan manages only a run. 5.2 overs (0 Run) A slower ball, full and outside off. Ishan Kishan throws his bat at it but fails to make any connection. 5.1 overs (0 Run) Play and a miss! Back of a length, angling across the batter, from off. Ishan Kishan stays back and looks to cut it without any feet movement. The ball zips past his outside edge.","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637851319225159815.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL 2022: Abhishek Sharma Stars As SRH Cruise To Victory vs CSK - NDTV Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMiiQFodHRwczovL3Nwb3J0cy5uZHR2LmNvbS9pcGwtMjAyMi9zcmgtdnMtY3NrLWFiaGlzaGVrLXNoYXJtYS1zdGFycy1hcy1zdW5yaXNlcnMtaHlkZXJhYmFkLWNydWlzZS10by12aWN0b3J5LXZzLWNoZW5uYWktc3VwZXIta2luZ3MtMjg3NDIwNdIBjwFodHRwczovL3Nwb3J0cy5uZHR2LmNvbS9pcGwtMjAyMi9zcmgtdnMtY3NrLWFiaGlzaGVrLXNoYXJtYS1zdGFycy1hcy1zdW5yaXNlcnMtaHlkZXJhYmFkLWNydWlzZS10by12aWN0b3J5LXZzLWNoZW5uYWktc3VwZXIta2luZ3MtMjg3NDIwNS9hbXAvMQ?oc=5","keywords":null,"creator":null,"video_url":null,"description":"IPL 2022: Abhishek Sharma Stars As SRH Cruise To Victory vs CSK  NDTV SportsLive match blog - Super Kings vs Sunrisers 17th Match 2022 - Cricket Insights  ESPNcricinfoHighlights, Tata IPL 2022 CSK vs SRH, Full Cricket S..Abhishek Sharma fifty guides Hyderabad to 8-wicket win  FirstpostLive Cricket Score - CSK vs SRH, Match 17, IPL 2022 | Cricbuzz.com - Cricbuzz  CricbuzzIPL reboot: Can CSK and MI end their losing streak ?  TNIE VideosView Full coverage on Google News","content":null,"pubDate":"2022-04-09 14:33:00","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Ramandeep Singh cricketer: Why is Tymal Mills not playing today’s IPL 2022 match between Royal Challengers Bangalore and Mumbai Indians?","link":"https://thesportsrush.com/cricket-news-ramandeep-singh-cricketer-why-is-tymal-mills-not-playing-todays-ipl-2022-match-between-royal-challengers-bangalore-and-mumbai-indians/","keywords":["Cricket","IPL 2022","Mumbai Indians","RCB","Indian Premier League","jaydev unadkat","MI","Ramandeep Singh","Royal Challengers Bangalore","Tymal Mills"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Tymal Mills not playing today: Mumbai Indians have included a couple of debutants to their Playing XI for this match. During the 18th match of the ongoing 15th season of the Indian Premier League between Royal Challengers Bangalore and Mumbai Indians in Pune, Royal Challengers Bangalore captain Faf du Plessis followed a prevailing trend by… The post Ramandeep Singh cricketer: Why is Tymal Mills not playing today’s IPL 2022 match between Royal Challengers Bangalore and Mumbai Indians? appeared first on The SportsRush.","content":"Tymal Mills not playing today: Mumbai Indians have included a couple of debutants to their Playing XI for this match. During the 18th match of the ongoing 15th season of the Indian Premier League between Royal Challengers Bangalore and Mumbai Indians in Pune, Royal Challengers Bangalore captain Faf du Plessis followed a prevailing trend by electing to bowl first at the toss. “We’re going to have a bowl. It is our first game here so we aren’t sure what the pitch is going to do. But it’s just the general trend, and hopefully there is dew later on which we can make use of. Two wins out of three looks good,” du Plessis told Star Sports at the toss. Following their bountiful fans’ long wait of witnessing Australia all-rounder Glenn Maxwell in action, du Plessis confirmed Maxwell replacing Sherfane Rutherford as their only change for this match. Faf has won the toss and we will be fielding first. Glenn Maxwell is back into the playing XI!!#PlayBold #WeAreChallengers #IPL2022 #Mission2022 #RCB #ನಮ್ಮRCB #RCBvMI pic.twitter.com/OByEROPzNk — Royal Challengers Bangalore (@RCBTweets) April 9, 2022 Why is Tymal Mills not playing against Royal Challengers Bangalore? Mumbai Indians captain Rohit Sharma also wanted to bowl first after failing to defend a total against Delhi Capitals in their previous match here. Coming on the back of three consecutive losses, Sharma and his men would be eager to find some winning momentum in their fourth match. “We would have bowled first as well. The nature of the pitch looks like it would get better and better as the match goes on. We just need to try and apply ourselves a little more than we have done so far in the tournament. All games are big games,” Sharma told Star Sports at the toss. Indians have dropped their overseas left-arm pacer-duo of Daniel Sams and Tymal Mills to accommodate a couple of debutants in all-rounder Ramandeep Singh and pacer Jaydev Unadkat for this match. Sams, who bowled the third-worst over in the history of IPL as Kolkata Knight Riders fast bowler Pat Cummins scored joint-fastest IPL half-century earlier this week, has been left out after leaking as many as 139 runs in 11 overs across three innings. Mills, on the other hand, has been left out despite being their highest wicket-taker (six wickets at an economy and strike rate of 9.90 and 10 respectively) for MI this season. Ramandeep, 24, represents Punjab in domestic cricket. In his 13-match T20 career, Ramandeep has scored 98 runs at a strike rate of 136.11 and picked three wickets at an economy rate of 6.90. Unadkat, on the other hand, has picked 85 wickets in 86 IPL matches at an average of 30.44, an economy rate of 8.74 and a strike rate of 20.8. The post Ramandeep Singh cricketer: Why is Tymal Mills not playing today’s IPL 2022 match between Royal Challengers Bangalore and Mumbai Indians? appeared first on The SportsRush.","pubDate":"2022-04-09 14:29:30","full_description":"Tymal Mills not playing today: Mumbai Indians have included a couple of debutants to their Playing XI for this match. During the 18th match of the ongoing 15th season of the Indian Premier League between Royal Challengers Bangalore and Mumbai Indians in Pune, Royal Challengers Bangalore captain Faf du Plessis followed a prevailing trend by electing to bowl first at the toss. “We’re going to have a bowl. It is our first game here so we aren’t sure what the pitch is going to do. But it’s just the general trend, and hopefully there is dew later on which we can make use of. Two wins out of three looks good,” du Plessis told Star Sports at the toss. Following their bountiful fans’ long wait of witnessing Australia all-rounder Glenn Maxwell in action, du Plessis confirmed Maxwell replacing Sherfane Rutherford as their only change for this match. Faf has won the toss and we will be fielding first. 💪🏻 Glenn Maxwell is back into the playing XI!!🤩🙌🏻 #PlayBold #WeAreChallengers #IPL2022 #Mission2022 #RCB #ನಮ್ಮRCB #RCBvMI pic.twitter.com/OByEROPzNk — Royal Challengers Bangalore (@RCBTweets) April 9, 2022 Mumbai Indians captain Rohit Sharma also wanted to bowl first after failing to defend a total against Delhi Capitals in their previous match here. Coming on the back of three consecutive losses, Sharma and his men would be eager to find some winning momentum in their fourth match. “We would have bowled first as well. The nature of the pitch looks like it would get better and better as the match goes on. We just need to try and apply ourselves a little more than we have done so far in the tournament. All games are big games,” Sharma told Star Sports at the toss. Indians have dropped their overseas left-arm pacer-duo of Daniel Sams and Tymal Mills to accommodate a couple of debutants in all-rounder Ramandeep Singh and pacer Jaydev Unadkat for this match. Sams, who bowled the third-worst over in the history of IPL as Kolkata Knight Riders fast bowler Pat Cummins scored joint-fastest IPL half-century earlier this week, has been left out after leaking as many as 139 runs in 11 overs across three innings. Mills, on the other hand, has been left out despite being their highest wicket-taker (six wickets at an economy and strike rate of 9.90 and 10 respectively) for MI this season. Ramandeep, 24, represents Punjab in domestic cricket. In his 13-match T20 career, Ramandeep has scored 98 runs at a strike rate of 136.11 and picked three wickets at an economy rate of 6.90. Unadkat, on the other hand, has picked 85 wickets in 86 IPL matches at an average of 30.44, an economy rate of 8.74 and a strike rate of 20.8.","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Glenn Maxwell's wife Vini Raman dons RCB jersey to lend support to husband - see PIC","link":"https://zeenews.india.com/cricket/rcb-vs-mi-ipl-2022-glenn-maxwells-wife-vini-raman-dons-rcb-jersey-to-lend-support-to-husband-see-pic-2452209.html","keywords":null,"creator":null,"video_url":null,"description":"RCB batter Glenn Maxwell is playing his first match of IPL 2022 on Saturday vs Mumbai Indians (MI) at the Maharashtra Cricket Stadium in Pune.","content":null,"pubDate":"2022-04-09 14:11:00","full_description":"RCB batter Glenn Maxwell is playing his first match of IPL 2022 on Saturday vs Mumbai Indians (MI) at the Maharashtra Cricket Stadium in Pune. The Australian all-rounder missed the first few games of RCB as he was getting married with Vini Raman. However, Maxwell was not missed as RCB are playing well as a unit and is in the top tier of the points table. But his coming back surely bolsters RCB's batting. Ahead of the RCB vs MI match, his wife Vini shared an Instagram post in which she is wearing the RCB jersey. Check out the post here: A post shared by VINI (@vini.raman) She captioned the post as: \"Honey we are home.\" Hopefully, Maxwell will have a good start in IPL 2022. RCB are bowling first vs MI Royal Challengers Bangalore skipper Faf du Plessis won the toss and opted to field against Mumbai Indians. The five-time champions are in an unpleasant position with three defeats and are up against the RCB side that will be even more boosted up by Glenn Maxwell`s return. Mumbai Indians have made two changes with Jaydev Unadkat and Sanjay Yadav making debuts replacing Tymal Mills and Daniel Sams. For RCB Australian all-rounder Glenn Maxwell makes this season`s IPL debut. Speaking at the toss, Royal Challengers Bangalore skipper Faf du Plessis said, \"We`re going to have a bowl. It is our first game here so we aren`t sure what the pitch is going to do. But it`s just the general trend, and hopefully there is dew later on which we can make use of. Two wins out of three looks good. [Loud chants of RCB, RCB] Wow, what an atmosphere. With ANI inputs","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"RCB vs MI Live Score IPL 2022: Will Mumbai finally win its first game?","link":"https://www.business-standard.com/article/sports/rcb-vs-mi-live-score-ipl-2022-will-mumbai-finally-win-its-first-game-122040900871_1.html","keywords":null,"creator":null,"video_url":null,"description":"RCB vs MI Live: Catch all the Live Updates and Scores from the Royal Challengers Bangalore vs Mumbai Indians match in IPL 2022 from the Maharashtra Cricket Association Stadium in Pune","content":null,"pubDate":"2022-04-09 14:05:00","full_description":"Dinesh Karthik and Shahbaz Ahmed during a partnership against Rajasthan Royals. Photo@IPL RCB vs MI LIVE Score and Updates: The Mumbai Indians have not got going so far and have lost all three of thier games this season and now they take on the Royal Challengers Bangalore who now also have the services of Glenn Maxwell, apart from having won two out of their three games. The RCB vs MI match in the IPL 2022 would take place at the Maharashtra Cricket Association Stadium in Pune, Maharashtra. IPL 2022 Royal Challengers Bangalore vs Mumbai Indians Toss: RCB win toss, opt to bowl first As was expected, Royal Challengers Bangalore skipper Faf du Plessis won the toss against Mumbai Indians’ Rohit Sharma at the Maharashtra Cricket Association Stadium in Pune and decided to bowl first. RCB vs MI Changes in the Playing 11 Glenn Maxwell is back for the Royal Challengers Bangalore and he has straightaway fit into the place of Sherfane Rutherford. As for Mumbai, Daniel Sams makes way for Ramandeep Singh while Tyamal Mills is also not part of the Playing 11 and Jaydev Unadkat has been brought in, meaning that Mumbai are going with only two foreign players RCB Playing 11 Faf du Plessis(c), Anuj Rawat, Virat Kohli, Glenn Maxwell, Shahbaz Ahmed, Dinesh Karthik(w), David Willey, Wanindu Hasaranga, Harshal Patel, Akash Deep, Mohammed Siraj MI Playing 11 Rohit Sharma(c), Ishan Kishan(w), Dewald Brevis, Suryakumar Yadav, Tilak Varma, Kieron Pollard, Ramandeep Singh, Murugan Ashwin, Jaydev Unadkat, Jasprit Bumrah, Basil Thampi RCB vs MI Live Score: Catch all the Live Updates from the IPL 2022 Match 18 here CATCH ALL THE LIVE UPDATES Auto Refresh Load More Read our full coverage on Indian Premier League Read More On Indian Premier League Royal Challengers Bangalore Mumbai Indians Faf Du Plessis Rohit Sharma","image_url":"https://bsmedia.business-standard.com/_media/bs/img/article/default/1220409/thumb-122040900871.jpg","source_id":"business-standard","country":["india"],"category":["sports"],"language":"english"},{"title":"Royal Challengers Bangalore vs Mumbai Indians Live Score Ball by Ball, IPL 2022 Live Cricket Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/royal-challengers-bangalore-vs-mumbai-indians-live-score-over-match-18-t20-1-5-updates-2874087","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Royal Challengers Bangalore vs Mumbai Indians from Maharashtra Cricket Association Stadium, Pune. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-04-09 14:04:02","full_description":"Follow the Indian Premier League 2022 live cricket score on Sports.NDTV.com . After 5.2 overs, Mumbai Indians are 42/0. Get live score, ball by ball commentary and much more. Keep track of Indian Premier League 2022 today match between Royal Challengers Bangalore and Mumbai Indians. Everything related to Royal Challengers Bangalore and Mumbai Indians match will be available on Sports.NDTV.com . Stay updated with Royal Challengers Bangalore vs Mumbai Indians live score. Do check for Royal Challengers Bangalore vs Mumbai Indians scorecard. You can get scorecard updates, match related facts. Get quick live updates with ads, Sports.NDTV.com , which is the perfect destination for live cricket score. 4.6 overs (0 Run) A dot to end! Full and on off, Rohit Sharma lunges forward and pushes it back to the bowler. Another good over for Mumbai. 4.5 overs (4 Runs) FOUR! Rohit Sharma taking on Wanindu Hasaranga now! Floated delivery, outside off, a googly. Rohit Sharma picks it well. He sits down on one knee and sweeps it to deep square leg for a glorious boundary. 4.4 overs (1 Run) This is worked to long on for a run. 4.3 overs (0 Run) Tossed up, on middle. Ishan Kishan was shaping up for the sweep but in the end just plays it back to the bowler. 4.2 overs (4 Runs) FOUR! Greets Wanindu Hasaranga with another boundary! Full and on off, Ishan Kishan just smashes it to long off for another boundary. 4.1 overs (4 Runs) FOUR! Ishan Kishan welcomes the new bowler with a boundary. Wanindu Hasaranga drops it short, on middle and Ishan Kishan swivel-pulls it to deep square leg for a boundary. Wanindu Hasaranga comes into the attack. 3.6 overs (0 Run) Length ball, on middle. Nudged to mid-wicket. A good over for Mumbai. 16 runs off it. 3.6 overs (1 Run) WIDE! Short of a length, down leg. Rohit Sharma misses his pull. Wided. 3.5 overs (4 Runs) FOUR! Wonderful from Rohit Sharma! So elegant and graceful! A low full toss, on middle. Rohit Sharma flicks it beautifully to deep mid-wicket and the ball just races away to the fence 3.4 overs (2 Runs) Nicely played! Full and on off, Rohit Sharma nicely nudges it to deep mid-wicket for a couple now. 3.3 overs (6 Runs) SIX! The Mumbai supporters in the crowd enjoy that one! Short of a length again, on middle. Rohit Sharma dances down the track and smacks it over long on for a biggie. Killer blow that one! 3.2 overs (3 Runs) Short of a length, on middle. Ishan Kishan pulls it to deep mid-wicket. David Willey gives it a chase and manages to keep the ball in play. Good effort from him and he saves a run for his side. 3.1 overs (0 Run) Good length, on middle. Ishan Kishan covers the line and defends it to mid off. 2.6 overs (0 Run) Lovely from Willey! Good-length ball, shaping away, outside off. Rohit Sharma has a poke at it. The ball zips past the outside edge. 2.5 overs (1 Run) Up and over! Back of a length, outside off. Ishan Kishan rides the bounce and carves it over covers for a single. 2.4 overs (0 Run) On a length, outside off. Ishan Kishan dabs it to backward point. He looks for a single but is sent back. 2.3 overs (0 Run) On a good length, on middle. Ishan Kishan pushes it to mid-wicket. 2.2 overs (4 Runs) FOUR! Ishan Kishan now finds his first boundary as well. Short of a length, outside off. Ishan Kishan pulls it to deep mid-wicket for a boundary. Well-controlled shot that! 2.1 overs (2 Runs) Back of a length, outside off. Ishan Kishan steers it to deep backward point. Two taken! 1.6 overs (0 Run) Good-length ball, on off. Rohit Sharma defends it out. A good over despite the boundary. Just 5 runs off it. 1.5 overs (4 Runs) FOUR! Rohit Sharma is off the mark with a boundary! Full and outside off, Rohit Sharma just pushes it gently past mid on. Pure timing on that one and he bags a boundary. Effortless! 1.4 overs (1 Run) Length ball, on the pads. Ishan Kishan whips it away to fine leg. There's protection down there though and will only get a single. Ishan Kishan is disappointed as he knows it was a freebie. 1.3 overs (0 Run) Short of a length, on off. Ishan Kishan gets cramped for room. He hops and punches it to cover-point. 1.2 overs (0 Run) And again! Good bounce and carry! Length ball, outside off, nipping away. Ishan Kishan looks to work it to the off side but gets beaten. 1.1 overs (0 Run) Lovely delivery! Length ball, shaping away from outside off, Ishan Kishan draws forward and goes for the drive but gets beaten on the outside edge. Who will bowl from the other end? Mohammed Siraj it is. 0.6 over (0 Run) A tidy first over from David Willey! Just a single off it. Short of a length, outside off. Rohit Sharma advances down the track and tries to pull it away but makes no contact with the ball. 0.5 over (0 Run) Good length, outside off, shaping in. Rohit Sharma watches the ball closely and leaves it for the keeper to collect. 0.4 over (1 Run) Mumbai and Ishan Kishan are underway now! Full and on off, swinging away. Ishan Kishan pushes it off the outside half of his bat through covers for a single. 0.3 over (0 Run) Touch fuller, well outside off. Ishan Kishan reaches out for it and defends it towards covers. 0.2 over (0 Run) Length ball, shaping away from outside off. Ishan Kishan this time has a push at it but gets beaten on the outside edge. 0.1 over (0 Run) David Willey starts with a good-length ball, outside off, with a slight hint of away swing. Ishan Kishan shoulders arms to that one. We are set for the game to begin! The match officials and the players of Bangalore make their way out to the middle, followed by the openers of Mumbai, Rohit Sharma and Ishan Kishan. David Willey will start proceedings with the ball. Here we go, folks! Rohit Sharma, the skipper of Mumbai, says that they would have bowled first as well. Adds that the pitch starts to get better and better as the game progresses. Tells that they will need to apply themselves much better. Mentions that every game is a tough one and they will be looking to get their first win of the season. Informs that they have got a couple of changes to their side. Faf du Plessis, the skipper of Bangalore, says that they will bowl first. He says that they are not sure of how the surface will play and it will be good to chase on it. Adds that Maxwell comes back for Rutherford and he will bat at number 4. Applauds Dinesh Karthik by saying that he has been brilliant so far. Mumbai (Playing XI) - Rohit Sharma (C), Ishan Kishan (WK), Dewald Brevis, Suryakumar Yadav, Tilak Varma, Kieron Pollard, Ramandeep Singh (In for Daniel Sams), Murugan Ashwin, Jaydev Unadkat (In for Tymal Mills), Jasprit Bumrah, Basil Thampi. Bangalore (Playing XI) - Faf du Plessis (C), Anuj Rawat, Virat Kohli, Glenn Maxwell (In for Sherfane Rutherford), David Willey, Shahbaz Ahmed, Dinesh Karthik (WK), Harshal Patel, Wanindu Hasaranga, Mohammed Siraj, Akash Deep. TOSS - Bangalore have won the toss and they have elected to BOWL first. Mumbai will be keen to get a win under their belt after having lost their first three games. They have been inconsistent in all three departments and will need to put their best foot forward against a side that has the winning momentum heading into this clash. Bangalore would be eager to make it three wins in a row and the return of Glenn Maxwell will surely bolster their lineup. Who will come out on top in this mouth-watering fixture? Stay tuned as we shall find that soon. Toss and team news coming shortly. Hello and a very warm welcome to game number 18 of the Indian T20 League where 5-time champions Mumbai will lock horns with Bangalore. However, Mumbai has gotten off to a very ordinary start this season and are coming at the back of three losses in a row. Bangalore on the flip side, haven't been at their best so far but some individual brilliances have ensured that they win two out of the three games. ... Match Day ...","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637851296342588328.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Why is Josh Hazlewood not playing today’s IPL 2022 match between Royal Challengers Bangalore and Mumbai Indians?","link":"https://thesportsrush.com/cricket-news-why-is-josh-hazlewood-not-playing-todays-ipl-2022-match-between-royal-challengers-bangalore-and-mumbai-indians/","keywords":["Cricket","IPL 2022","Mumbai Indians","RCB","Glenn Maxwell","Indian Premier League","Josh Hazlewood","MI","Royal Challengers Bangalore"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Josh Hazlewood not playing today: Royal Challengers Bangalore have made a lone change to their Playing XI for this match. During the 18th match of the ongoing 15th season of the Indian Premier League between Royal Challengers Bangalore and Mumbai Indians in Pune, Royal Challengers Bangalore captain Faf du Plessis has won the toss and… The post Why is Josh Hazlewood not playing today’s IPL 2022 match between Royal Challengers Bangalore and Mumbai Indians? appeared first on The SportsRush.","content":"Josh Hazlewood not playing today: Royal Challengers Bangalore have made a lone change to their Playing XI for this match. During the 18th match of the ongoing 15th season of the Indian Premier League between Royal Challengers Bangalore and Mumbai Indians in Pune, Royal Challengers Bangalore captain Faf du Plessis has won the toss and chose to bowl. “We’re going to have a bowl. It is our first game here so we aren’t sure what the pitch is going to do. But it’s just the general trend, and hopefully there is dew later on which we can make use of. Two wins out of three looks good,” du Plessis told Star Sports at the toss. Much like du Plessis, Mumbai Indians captain Rohit Sharma also wanted to bowl first at the Maharashtra Cricket Association Stadium tonight. Coming on the back of three consecutive losses, Sharma laid emphasis on “applying themselves” across departments in this match. “We would have bowled first as well. The nature of the pitch looks like it would get better and better as the match goes on. We just need to try and apply ourselves a little more than we have done so far in the tournament. All games are big games,” Sharma told Star Sports at the toss. Why is Josh Hazlewood not playing vs Mumbai Indians today? A solitary change for Royal Challengers for this match lies in the form of all-rounder Glenn Maxwell returning for all-rounder Sherfane Rutherford. While Maxwell had joined the squad before their last match as well, centrally contracted Australian players were allowed to play an IPL 2022 match after April 5. While Bangalore have included Maxwell, his Australian teammate Josh Hazlewood will continue to sit out as the team management has refrained from tinkering with their bowling attack. Having represented Chennai Super Kings in the last two seasons, Hazlewood must be awaiting an RCB debut this season. apna dikhaane hai taiyyar! Good luck, Paaji! #OneFamily #DilKholKe #MumbaiIndians #RCBvMI @Ramandeep__13 pic.twitter.com/Kj3rDRbS2w — Mumbai Indians (@mipaltan) April 9, 2022 As far as Indians are concerned, they have included a couple of debutants in all-rounder Ramandeep Singh and pacer Jaydev Unadkat for the overseas pair of Daniel Sams and Tymal Mills. The post Why is Josh Hazlewood not playing today’s IPL 2022 match between Royal Challengers Bangalore and Mumbai Indians? appeared first on The SportsRush.","pubDate":"2022-04-09 13:57:30","full_description":"Josh Hazlewood not playing today: Royal Challengers Bangalore have made a lone change to their Playing XI for this match. During the 18th match of the ongoing 15th season of the Indian Premier League between Royal Challengers Bangalore and Mumbai Indians in Pune, Royal Challengers Bangalore captain Faf du Plessis has won the toss and chose to bowl. “We’re going to have a bowl. It is our first game here so we aren’t sure what the pitch is going to do. But it’s just the general trend, and hopefully there is dew later on which we can make use of. Two wins out of three looks good,” du Plessis told Star Sports at the toss. Much like du Plessis, Mumbai Indians captain Rohit Sharma also wanted to bowl first at the Maharashtra Cricket Association Stadium tonight. Coming on the back of three consecutive losses, Sharma laid emphasis on “applying themselves” across departments in this match. 🔴 🤜🏻🤛🏻 🔵 #PlayBold #WeAreChallengers #IPL2022 #Mission2022 #RCB #ನಮ್ಮRCB #RCBvMI pic.twitter.com/WGnYJYVYAh — Royal Challengers Bangalore (@RCBTweets) April 9, 2022 “We would have bowled first as well. The nature of the pitch looks like it would get better and better as the match goes on. We just need to try and apply ourselves a little more than we have done so far in the tournament. All games are big games,” Sharma told Star Sports at the toss. A solitary change for Royal Challengers for this match lies in the form of all-rounder Glenn Maxwell returning for all-rounder Sherfane Rutherford. While Maxwell had joined the squad before their last match as well, centrally contracted Australian players were allowed to play an IPL 2022 match after April 5 . While Bangalore have included Maxwell, his Australian teammate Josh Hazlewood will continue to sit out as the team management has refrained from tinkering with their bowling attack. A primary reason why RCB wouldn’t want to bench their overseas pacer in David Willey is his ability to contribute with the bat in hand. Meanwhile, Hazlewood would be waiting for an RCB debut after representing Chennai Super Kings in the last two seasons. As far as Indians are concerned, they have included a couple of debutants in all-rounder Ramandeep Singh and pacer Jaydev Unadkat for the overseas pair of Daniel Sams and Tymal Mills.","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Highlights, Tata IPL 2022 CSK vs SRH, Full Cricket S..Abhishek Sharma fifty guides Hyderabad to 8-wicket win - Firstpost","link":"https://news.google.com/__i/rss/rd/articles/CBMirgFodHRwczovL3d3dy5maXJzdHBvc3QuY29tL2ZpcnN0Y3JpY2tldC9zcG9ydHMtbmV3cy9oaWdobGlnaHRzLXRhdGEtaXBsLTIwMjItY3NrLXZzLXNyaC1mdWxsLWNyaWNrZXQtc2NvcmUtYWJoaXNoZWstc2hhcm1hLWZpZnR5LWd1aWRlcy1oeWRlcmFiYWQtdG8tOC13aWNrZXQtd2luLTEwNTMzMzgxLmh0bWzSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Highlights, Tata IPL 2022 CSK vs SRH, Full Cricket S..Abhishek Sharma fifty guides Hyderabad to 8-wicket win  FirstpostIPL 2022, SRH vs CSK, Highlights: Abhishek Sharma, Rahul Tripathi Star As SunRisers Hyderabad Register Eight-Wicket Win | Cricket News  NDTV SportsCSK vs SRH Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update- Tata IPL 2022  Cricket AddictorIPL reboot: Can CSK and MI end their losing streak ?  TNIE VideosRecent Match Report - Super Kings vs Sunrisers 17th Match 2022  ESPNcricinfoView Full coverage on Google News","content":null,"pubDate":"2022-04-09 13:47:00","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"KKR vs Delhi Head to Head wins: Kolkata Knight Riders vs Delhi Capitals records and stats IPL 2022","link":"https://thesportsrush.com/cricket-news-kkr-vs-delhi-head-to-head-wins-kolkata-knight-riders-vs-delhi-capitals-records-and-stats-ipl-2022/","keywords":["Cricket","Delhi Capitals","IPL 2022","KKR","DC","Indian Premier League","Kolkata Knight riders"],"creator":["Dixit Bhargav"],"video_url":null,"description":"KKR vs Delhi Head to Head in IPL history: The SportsRush presents for you the Head to Head statistics for IPL 2022 Match 19. The 19th match of the ongoing 15th season of the Indian Premier League will be played between Kolkata Knight Riders and Delhi Capitals at the Braboune Stadium tomorrow. Afternoon match of… The post KKR vs Delhi Head to Head wins: Kolkata Knight Riders vs Delhi Capitals records and stats IPL 2022 appeared first on The SportsRush.","content":"KKR vs Delhi Head to Head in IPL history: The SportsRush presents for you the Head to Head statistics for IPL 2022 Match 19. The 19th match of the ongoing 15th season of the Indian Premier League will be played between Kolkata Knight Riders and Delhi Capitals at the Braboune Stadium tomorrow. Afternoon match of the fourth IPL 2022 double-header day, this match will be followed by Rajasthan Royals vs Lucknow Super Giants contest at the Wankhede Stadium. Table-toppers at the time of writing this story, Knight Riders have won three and lost one out of their four IPL 2022 matches till now. Capitals, on the other hand, are at the seventh position on the back of winning one and losing two out of their three matches this season. The Class of 2018 reunion! @ShivamMavi23 @Kamleshnagark13 #KKRHaiTaiyaar #IPL2022 pic.twitter.com/zxypASLjwB — KolkataKnightRiders (@KKRiders) April 9, 2022 Having played IPL matches at the Brabourne Stadium in 2010 and 2015, Kolkata are yet to win a match here. Meanwhile, Delhi have won one (against Mumbai Indians last month) and lost two out of their three Brabourne T20s. KKR vs Delhi Head to Head wins Total number of matches played: 30 Matches won by KKR: 16 Matches won by DC: 13 Matches played in April: 15 (KKR 8, DC 7) Matches played in India: 22 (KKR 13, DC 8) Matches played at Brabourne Stadium: 0 (KKR 0, DC 0) KKR average score against DC: 153 DC average score against KKR: 153 Most runs for KKR: 282 (Nitish Rana) Most runs for DC: 341 (Prithvi Shaw) Most wickets for KKR: 22 (Sunil Narine) Most wickets for DC: 8 (Anrich Nortje) Most catches for KKR: 7 (Sunil Narine) Most catches for DC: 8 (Rishabh Pant) The last KKR vs DC encounter was IPL 2021 Qualifier 2 at the Sharjah Cricket Stadium. Chasing a 136-run target, KKR had sealed a 3-wicket victory with a ball to go after a mad display of batting saw them losing six wickets for seven runs in the business end of the match. NOTE: Only players part of current squads have been considered above (most runs, wickets and catches). The post KKR vs Delhi Head to Head wins: Kolkata Knight Riders vs Delhi Capitals records and stats IPL 2022 appeared first on The SportsRush.","pubDate":"2022-04-09 13:28:55","full_description":"KKR vs Delhi Head to Head in IPL history: The SportsRush presents for you the Head to Head statistics for IPL 2022 Match 19. The 19th match of the ongoing 15th season of the Indian Premier League will be played between Kolkata Knight Riders and Delhi Capitals at the Braboune Stadium tomorrow. Afternoon match of the fourth IPL 2022 double-header day, this match will be followed by Rajasthan Royals vs Lucknow Super Giants contest at the Wankhede Stadium. Table-toppers at the time of writing this story, Knight Riders have won three and lost one out of their four IPL 2022 matches till now. Capitals, on the other hand, are at the seventh position on the back of winning one and losing two out of their three matches this season. The Class of 2018 reunion! 💜 @ShivamMavi23 @Kamleshnagark13 #KKRHaiTaiyaar #IPL2022 pic.twitter.com/zxypASLjwB — KolkataKnightRiders (@KKRiders) April 9, 2022 Having played IPL matches at the Brabourne Stadium in 2010 and 2015, Kolkata are yet to win a match here. Meanwhile, Delhi have won one ( against Mumbai Indians last month) and lost two out of their three Brabourne T20s. Total number of matches played: 30 Matches won by KKR: 16 Matches won by DC: 13 Matches played in April: 15 (KKR 8, DC 7) Matches played in India: 22 (KKR 13, DC 8) Matches played at Brabourne Stadium: 0 (KKR 0, DC 0) KKR average score against DC: 153 DC average score against KKR: 153 Most runs for KKR: 282 (Nitish Rana) Most runs for DC: 341 (Prithvi Shaw) Most wickets for KKR: 22 (Sunil Narine) Most wickets for DC: 8 (Anrich Nortje) Most catches for KKR: 7 (Sunil Narine) Most catches for DC: 8 (Rishabh Pant) The last KKR vs DC encounter was IPL 2021 Qualifier 2 at the Sharjah Cricket Stadium. Chasing a 136-run target, KKR had sealed a 3-wicket victory with a ball to go after a mad display of batting saw them losing six wickets for seven runs in the business end of the match. NOTE: Only players part of current squads have been considered above (most runs, wickets and catches).","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Chennai Super Kings vs Sunrisers Hyderabad: IPL 2022 Live Cricket Score, Live Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/chennai-super-kings-vs-sunrisers-hyderabad-live-score-over-match-17-t20-16-20-updates-2874046","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Chennai Super Kings vs Sunrisers Hyderabad from Dr. DY Patil Sports Academy, Navi Mumbai. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-04-09 13:23:57","full_description":"A dedicated team of experts bring you live score, live cricket score, live match update on Sports.NDTV.com . After 17.4 overs, Sunrisers Hyderabad, chasing a target of 155, are 155/2. The live updates of Chennai Super Kings vs Sunrisers Hyderabad scorecard is also available. It is the perfect platform to follow your favourite teams in Indian Premier League 2022. Keep a track on your favourite batsmen and bowlers through Indian Premier League 2022 today match, ball by ball commentary, Chennai Super Kings vs Sunrisers Hyderabad, Chennai Super Kings vs Sunrisers Hyderabad live score, Chennai Super Kings vs Sunrisers Hyderabad scorecard. Follow the excitement of the Indian Premier League 2022 on Sports.NDTV.com as you can follow live match updates and live cricket score through our platform. Well, Chennai have a lot to ponder about as they misery keeps piling on for them. It is only the second time in the Chennai's history that they have lost four matches on the trot. They got to a decent total with the bat but needed to bowl well and take wickets in the Powerplay to defend this total. However, the bowling lacked penetration and they failed to get wicket till the 13th over. Things kept going downhill after that wicket too as Rahul Tripathi counter-attacked brilliantly to take away any hopes Chennai had. Overall, another poor performance from the defending champions and the first victory of this season continues to elude them. Hyderabad did pretty well with the ball as they restricted a strong Chennai batting lineup to a very chaseable score. However, they needed to bat well and start well especially given the fragile nature of their batting lineup. Abhishek Sharma and skipper Kane Williamson did exactly that as they first took the time to settle in and then accelerated quite brilliantly to put together a opening stand of 89 runs. Kane Williamson lost his wicket but young Abhishek Sharma showed everyone why he is rated so highly and scored a brilliant 75 to put his team in the winning position. He departed when his team needed just 10 runs and Rahul Tripathi who played a brilliant cameo at number 3 and Pooran finished off the formalities to take Hyderabad to a comfortable victory. Hyderabad register their first points on the board with a clinical win here at Dr. DY Patil Sports Academy, Navi Mumbai. There was lot of talk after the first innings about this being a tricky pitch but it has been a very convincing effort from Hyderabad batters and they have handed the defending champions, Chennai their fourth loss on the trot this season. 17.4 overs (4 Runs) FOUR! One hit away and Rahul Tripathi finishes things off in style! Poor ball from Bravo, a full toss on the pads and Rahul Tripathi tickles it to fine leg for a boundary. Hyderabad register their maiden win of the season. They win by 8 wickets! 17.3 overs (1 Run) On a length, outside off. Nicholas Pooran guides this one to short third man for a run. Hyderabad are one hit away from winning this! 17.3 overs (1 Run) WIDE! Full and too outside off. Wide called. 17.2 overs (4 Runs) FOUR! Length ball, outside off, nipping away. Nicholas Pooran deliberately plays it late. He opens his face of the bat and guides it very late to third man for a glorious boundary. 17.1 overs (0 Run) OUT! TAKEN! Abhishek Sharma holes out at the end but he has done his job here. He can walk back proudly as he knows he has played a gem of an innings. Length ball from Bravo, outside off. Abhishek Sharma goes for a lofted drive but finds Chris Jordan at long off who takes a good catch. A fantastic knock from Abhishek Sharma comes to an end. Nicholas Pooran is the next man in. 17.1 overs (1 Run) WIDE! Full and outside off, outside the tramline as well. Sharma leaves it alone. Wide given. 16.6 overs (1 Run) Full and on off, Abhishek Sharma drives it through covers and keeps the strike with a single. Just 11 needed now off 18 balls! 16.5 overs (1 Run) Touch fuller, outside off. Driven to sweeper cover for an easy single. 16.4 overs (4 Runs) FOUR! Rahul Tripathi just want to finish it off quickly now! It's so visible in his eyes. Length ball, outside off. Rahul Tripathi throws his bat at it and hammers his drive to deep point for a cracking boundary. 16.3 overs (1 Run) Back of a length, outside off. Abhishek Sharma stands tall and mistimes his slap to long off for a run. 16.2 overs (1 Run) Full and wide outside off, Rahul Tripathi drives it to sweeper cover for a run. 16.2 overs (5 Runs) NO BALL AND FOUR! More misery to Chennai! Chris Jordan bowls it short of length, on leg. Rahul Tripathi swivel-pulls it to fine leg for a boundary. Chris Jordan removed the bails of the stumps while delivering the ball so the umpire has given it as a no ball. Free Hit coming up... 16.1 overs (6 Runs) SIX! Rahul Tripathi is a swagger! He is never in mood to take the game deep! Chris Jordan bowls it in the slot, on off and Rahul Tripathi takes full toll of it. Slams it over the bowler's head for a maximum. A superb strike from Rahul Tripathi! DRINKS! Hyderabad have gone about this chase in a very clinical fashion so far. Unless, there is some real special performance from Chennai bowlers in these last few overs, it is safe to say that Hyderabad are well on their way to register their first victory of the season. Chennai needed wickets to keep the scoring rate under check but they have managed only a solitary wicket and are starring down the barrel now. Chris Jordan is back on. 15.6 overs (0 Run) Tossed up, on middle. Abhishek Sharma pushes it towards covers. 30 needed from 24 balls! 15.5 overs (0 Run) Flatter and quicker, on leg. Abhishek Sharma keeps it out. 15.4 overs (1 Run) Loopy ball, on off. Punched off the back foot past the bowler for another single. 15.3 overs (1 Run) On the pads again, Sharma glances it to backward square leg and rotates the strike. 15.2 overs (1 Run) Flatter and on the pads, Rahul Tripathi clips it to square leg and calls for a single straightaway. 15.1 overs (1 Run) Tossed up, on middle. Abhishek Sharma tucks it to mid-wicket for a run.","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637851272296404109.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Chennai Super Kings vs Sunrisers Hyderabad Live Score Ball by Ball, IPL 2022 Live Cricket Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/chennai-super-kings-vs-sunrisers-hyderabad-live-score-over-match-17-t20-11-15-updates-2873986","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Chennai Super Kings vs Sunrisers Hyderabad from Dr. DY Patil Sports Academy, Navi Mumbai. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-04-09 13:14:08","full_description":"A dedicated team of experts bring you live score, live cricket score, live match update on Sports.NDTV.com . After 15.3 overs, Sunrisers Hyderabad, chasing a target of 155, are 124/1. The live updates of Chennai Super Kings vs Sunrisers Hyderabad scorecard is also available. It is the perfect platform to follow your favourite teams in Indian Premier League 2022. Keep a track on your favourite batsmen and bowlers through Indian Premier League 2022 today match, ball by ball commentary, Chennai Super Kings vs Sunrisers Hyderabad, Chennai Super Kings vs Sunrisers Hyderabad live score, Chennai Super Kings vs Sunrisers Hyderabad scorecard. Follow the excitement of the Indian Premier League 2022 on Sports.NDTV.com as you can follow live match updates and live cricket score through our platform. 14.6 overs (4 Runs) FOUR! Another boundary to end the over and 13 runs from this over! Lands on a length, outside off. Rahul Tripathi drives it on up and hits it over the extra-cover fielder in the ring for a boundary. Just 34 needed now from 30 balls! 14.5 overs (1 Run) On a length, on middle and leg. Sharma works it to mid-wicket for a single. 14.4 overs (6 Runs) SIX! SHOT! This man is playing a gem of an innings! Probably the shot of the day! Back of a length, on off. Sharma stands tall and slaps it straight down the ground for a maximum. 14.3 overs (1 Run) Back of a length, outside off at 135.2 kph. Rahul Tripathi gets across and steers it towards third man for a single. 14.2 overs (1 Run) Just a single! On a length, outside off. Sharma throws a kitchen sink at that one. The ball goes towards deep point for a single. 14.1 overs (0 Run) Serves a length delivery on middle. Sharma blocks it out. 13.6 overs (1 Run) In the air...but safe! A slower full ball, outside off. Sharma goes chasing for it. The ball goes off the outside edge of his blade. In the air and just away from diving Jadeja at backward point. A single taken and 47 needed now from 36 balls! 13.5 overs (1 Run) A short delivery on middle. Rahul Tripathi pulls it to deep mid-wicket for a single. 13.4 overs (4 Runs) FOUR! Rahul Tripathi has come in and has got going straightaway! This is fuller on middle and leg. Rahul Tripathi whips it through mid-wicket. Slightly in the air but away from Jadeja at mid-wicket and it races away for a boundary. 13.3 overs (1 Run) A low full toss, outside off. Sharma drags it to long on for a single. 13.2 overs (0 Run) A yorker this time, on off. Sharma digs it out. 13.1 overs (4 Runs) FOUR! Lovely shot! This is a fuller delivery, outside off. Sharma hits it hard through the extra-cover region for a boundary. 12.6 overs (0 Run) Back of a length, outside off. Rahul Tripathi tries to steer it towards third man but gets beaten. 58 needed from 42 balls as 8 runs came in this over but more importantly a wicket for Chennai. 12.5 overs (6 Runs) SIX! Ohh... Rahul Tripathi with a big shot! Such a good over so far but Rahul Tripathi ruins it with a maximum. A short ball on middle. Rahul Tripathi pulls it over fine leg and it sails over the fence. 12.4 overs (1 Run) Just a single, good over from Mukesh Choudhary so far. Lands it on a length, around off. Sharma punches it to deep cover for a single. 12.3 overs (0 Run) On a length, around off. Sharma pushes it to point. 12.2 overs (1 Run) Back of a length, on middle. Rahul Tripathi works it to fine leg for a single. Rahul Tripathi walks out to bat at No.3. 12.1 overs (0 Run) OUT! CAUGHT! What an inspired bowling change by Ravindra Jadeja! Mukesh Choudhary comes back into the attack and breaks this opening stand. This is a fullish delivery, on off. Kane Williamson drives but fails to keep it on ground. The ball goes straight to Moeen Ali at covers and he makes no mistake. Chennai needed this wicket and can they get some quick wickets now to get back in this game? 66 needed from 47 balls! 11.6 overs (6 Runs) SIX! BANG! He is showing everyone today why he is rated so highly. It is a short delivery on off. Sharma pulls it over wide long on for a maximum. 11.5 overs (1 Run) Back of a length, on middle. Kane Williamson works it to deep mid-wicket for a single. 11.4 overs (1 Run) This time he get's to it. A fine knock from the youngster. Back of a length, around off. Sharma steers it towards third man for a single. Maiden Indian T20 League fifty for Abhishek Sharma! 11.3 overs (1 Run) Back of a length, around off. Sharma punches it to deep point for a brace. Actually, he ran a short run there and has to wait for one more run to get to his maiden Indian T20 League half-century. He raised his bat as he thought he got to his fifty but the replay showed that he ran one run short. 11.2 overs (1 Run) Back of a length, on off. Kane Williamson defends it onto the pitch and takes a single. 11.1 overs (4 Runs) FOUR! Jordan is greeted with a boundary by Kane Williamson! Poor delivery this, shorter length delivery on leg. Kane Williamson pulls it towards deep backward square leg for a boundary. The fielder at fine leg runs to his left and dives to stop it but fails. 10.6 overs (0 Run) Pushed this quicker and outside off. Sharma defends it towards the off side. Tidy over from Jadeja, just 6 runs from it. 80 needed now from 54 balls! 10.5 overs (2 Runs) Sharma skips down the track and Jadeja drops it short on middle. Sharma heaves it towards deep mid-wicket for a couple. 10.4 overs (1 Run) A fuller delivery on off. Kane Williamson pushes it to covers for a single. 10.3 overs (1 Run) Slower in the air, on off. Sharma defends it towards the off side and takes a single. 10.2 overs (1 Run) A flatter delivery on off. Kane Williamson pushes it to covers for a single. 10.1 overs (1 Run) Slower in the air, around off. Sharma guides it to short third man for a single. Good work by the felder there has he stops it with a dive.","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637851266408692746.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"CC vs NW Dream11 Prediction: Fantasy Cricket Tips, Today's Playing 11 and Pitch Report for Spice Isle T10, Match 10","link":"https://www.sportskeeda.com/fantasy-cricket-mantra/cc-vs-nw-dream11-prediction-fantasy-cricket-tips-today-s-playing-11-pitch-report-spice-isle-t10-match-10?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Fantasy Cricket Mantra"],"creator":["Adarsh Tabhane"],"video_url":null,"description":null,"content":null,"pubDate":"2022-04-09 13:13:55","full_description":"Clove Challengers (CC) will lock horns with the Nutmeg Warriors (NW) in the 10th match of the Spice Isle T10 at the National Cricket Stadium in St. George's on Saturday. Clove Challengers are rock bottom in the standings after losing three in three. They lost their last match against the Cinnamon Pacers by nine wickets. The Nutmeg Warriors, on the other hand, are third in the points table with two wins from their three matches. They lost their last game against Ginger Generals by 51 runs. CC XI Rickie Alexander (WK), Teddy Bishop, Kimo Peters, Darron Nedd, Cyprian Forsyth (C), Denroy Charles, Ronald Ettienne, Melvin Gordon, Cliffon Mark, Kesrick Williams, Imran Joseph. NW XI Andre Fletcher (C), Akeem Alexis, Benjamin Wavel (WK), Keron Cottoy, Darel Cyrus, Haston Jackson, Sheldon Joseph, Donald McDonald, Keishon Mitchell, Alex Moses, Seandell Regis. CC vs NW, Spice Isle T10, Match 10 Date and Time: 9th April 2022, 09:15 PM IST Venue: National Cricket Stadium, St. George's. The pitch at the Kinrara Academy Oval is a sporting one where batters get full value for their shots. Meanwhile, bowlers will have to bowl tight lines and lengths to stop the leakage of runs. Batting first should be the preferred option, with the average first-innings score in the last two games played at the venue being 100 runs. Wicketkeeper Rickie Alexander: Alexander has scored 35 runs at a strike rate of 184.21 in three matches. He can provide you with some valuable fantasy points on Saturday. Batters Andre Fletcher: Fletcher has smashed 90 runs at a strike rate of 209.30 in three matches and is a good candidate to lead your fantasy team. Teddy Bishop: Bishop has scored 38 runs at a strike rate of 118.75 in three matches. All-rounders Ronald Ettienne: Ettienne has impressed everyone with his all-round performances, scoring 82 runs and picking up four wickets in three matches. He is surely a must-have pick for your fantasy team. Keron Cottoy: Cottoy has taken two wickets while also scoring 18 runs in three games. He could be a crucial pick for Saturday's fixture. Bowlers Darel Cyrus: Cyrus is currently the leading wicket-taker in the Spice Isle T10 with six wickets in three matches. Haston Jackson: Jackson has picked up three wickets at an economy rate of 8.67 in three matches. He is a genuine wicket-taker who can provide regular breakthroughs. Ronald Ettienne (CC) - 268 points Darel Cyrus (NW) - 240 points Andre Fletcher (NW) - 166 points Haston Jackson (NW) - 146 points Keron Cottoy (NW) - 120 points Ronald Ettienne: 82 runs and 4 wickets in 3 matches; SR - 167.35 and ER - 8.33 Darel Cyrus: 6 wickets in 3 matches; ER - 8.83 Andre Fletcher: 90 runs in 3 matches; SR - 209.30 Haston Jackson: 10 runs and 3 wickets in 3 matches; SR - 200.00 and ER - 8.67 Keron Cottoy: 18 runs and 2 wickets in 3 matches; SR - 200.00 and ER - 10.20 Fantasy Suggestion #1: Rickie Alexander, Andre Fletcher, Seandell Regis, Teddy Bishop, Keron Cottoy, Sheldon Joseph, Ronald Ettienne, Kesrick Williams, Darel Cyrus, Haston Jackson, Darron Nedd. Captain: Andre Fletcher. Vice-captain: Darron Nedd. Fantasy Suggestion #2: Benjamin Wavel, Andre Fletcher, Seandell Regis, Teddy Bishop, Keron Cottoy, Akeem Alexis, Ronald Ettienne, Darel Cyrus, Haston Jackson, Darron Nedd, Imran Joseph. Captain: Andre Fletcher. Vice-captain: Ronald Ettienne.","image_url":"https://static.sportskeeda.com/editor/2022/04/d5f3c-16495043915641-1920.jpg","source_id":"sportskeeda","country":["india"],"category":["sports"],"language":"english"},{"title":"KAS vs BG Dream11 Prediction: Fantasy Cricket Tips, Today's Playing 11 and Pitch Report for Sharjah Ramadan T20 League, Match 27","link":"https://www.sportskeeda.com/fantasy-cricket-mantra/kas-vs-bg-dream11-prediction-fantasy-cricket-tips-today-s-playing-11-pitch-report-sharjah-ramadan-t20-league-match-27?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Fantasy Cricket Mantra"],"creator":["Adarsh Tabhane"],"video_url":null,"description":null,"content":null,"pubDate":"2022-04-09 13:13:55","full_description":"The Karwan Strikers (KAS) will take on Brother Gas (BG) in the 27th match of the Sharjah Ramadan T20 League at the Sharjah Cricket Stadium in Sharjah on Saturday. The Karwan Strikers are placed atop the Group D & E points table, having won two in two. They defeated DCC Starlets by seven wickets in their last match. Brother Gas, on the other hand, are placed just below their rivals in the standings. They defeated Colatta Chocolates by nine runs in their last match. KAS XI Ali Khan, Muhammad Taimoor, Ameer Hamza, Kashif Daud, Fayyaz Ahmed, Babar Iqbal, Tariq Mehmood, Sagar Kalyan, Furqan Khalil (WK), Aryan Lakra, Hafeez Ur Rehman. BG XI Umer Farooq, Hamdan Tahir (WK), Zahid Ali, Saqib Manshad, Usman Khan, Mujahid Amin, Jiju Janardhanan, Tanvir Javed, Mohammad Azhar, Dawood Ejaz, Mohammad Waseem. KAS vs BG, Sharjah Ramadan T20 League, Match 27 Date and Time: 9th April 2022, 09:30 PM IST Venue: Sharjah Cricket Stadium, Sharjah. The surface at the Sharjah Cricket Stadium has dramatically favored the bowlers over the last couple of matches. While the sluggishness of the pitch has assisted the bowlers, the batters have struggled to get going. Chasing should be the preferred option, with the average first-innings score in the last two games played at the venue being 138 runs. Wicketkeeper Hamdan Tahir: Tahir has scored 51 runs at a strike rate of 118.60 in two outings for Brother Gas. He could be the perfect pick from the wicketkeeper section for your fantasy team. Batters Fayyaz Ahmed: Explosive top-order batter Ahmed has smashed 166 runs at a strike rate of 156.60 in two Sharjah Ramadan T20 League matches. Usman Khan: Khan has racked up 72 runs at a strike rate of 150.00 in two games and could be a crucial pick for your fantasy team. All-rounders Umer Farooq: Farooq has scored 38 runs at a strike rate of 271.43 in two matches, while also picking up two wickets. He is someone who can single-handedly win games for his side with both the bat and ball. Sagar Kalyan: Kalyan has scored 123 runs at a strike rate of 173.24 in two matches and can help you fetch some valuable fantasy points on Saturday. Bowlers Babar Iqbal: Iqbal has picked up four wickets in two matches. He is a genuine wicket-taker who can provide regular breakthroughs. Zahid Ali: Khan has scalped eight wickets at an economy rate of 7.63 in two matches. He will lead Brother Gas' bowling attack on Saturday. Zahid Ali (BG) - 284 points Fayyaz Ahmed (KAS) - 231 points Sagar Kalyan (KAS) - 183 points Mohammad Azhar (BG) - 142 points Babar Iqbal (KAS) - 140 points Zahid Ali: 8 wickets in 2 matches; ER - 7.63 Fayyaz Ahmed: 166 runs in 2 matches; SR - 156.60 Sagar Kalyan: 123 runs in 2 matches; SR - 173.24 Mohammad Azhar: 4 wickets in 2 matches; ER - 6.50 Babar Iqbal: 4 wickets in 2 matches; ER - 9.20 Fantasy Suggestion #1: Hamdan Tahir, Usman Khan, Dawood Ejaz, Fayyaz Ahmed, Aryan Lakra, Umer Farooq, Jiju Janardhanan, Sagar Kalyan, Mohammad Azhar, Zahid Ali, Babar Iqbal. Captain: Aryan Lakra. Vice-captain: Jiju Janardhanan. Fantasy Suggestion #2: Hamdan Tahir, Usman Khan, Dawood Ejaz, Fayyaz Ahmed, Aryan Lakra, Mohammad Waseem, Jiju Janardhanan, Sagar Kalyan, Zahid Ali, Hafeez Ur Rehman, Babar Iqbal. Captain: Aryan Lakra. Vice-captain: Sagar Kalyan.","image_url":"https://static.sportskeeda.com/editor/2022/03/6c466-16480093875211-1920.jpg","source_id":"sportskeeda","country":["india"],"category":["sports"],"language":"english"},{"title":"Sri Lanka Appoint Chris Silverwood As Men's Team Head Coach","link":"https://sports.ndtv.com/cricket/sri-lanka-appoint-chris-silverwood-as-mens-team-head-coach-2874033","keywords":null,"creator":null,"video_url":null,"description":"Cricket Sri Lanka announced Chris Silverwood as the new head coach for their men's national team.","content":null,"pubDate":"2022-04-09 13:06:52","full_description":"Former England head coach Chris Silverwood is all set to take charge of the Sri Lankan national team, the country's cricket board announced on Saturday. The former England pacer's first competitive assignment with the Sri Lanka national team will be the upcoming away Test series in Bangladesh. He is contracted for a two-year period. \"We are delighted to appoint Chris as the new Head Coach of the national team. He is an extremely experienced coach and from our discussions with him in the recruitment process it is clear he has the required qualities we are looking for to take the team forward,\" said Sri Lanka Cricket (SLC) CEO Ashley De Silva. \"I am very excited to be on board with Sri Lanka and I cannot wait to get over to Colombo and get started. They have a talented and passionate group of players and I am really looking forward to meeting up with the players and coaching staff very soon,\" Silverwood said on his part. Silverwood, was appointed as head coach of England men's team in October 2019. He had previously served as the team's bowling coach, working under then head coach Trevor Bayliss when England won the ICC Men's ODI World Cup in 2019. Silverwood featured in six Tests and seven ODIs for England and played county cricket for Yorkshire and Middlesex. Promoted After his playing career, he took to coaching. He guided the Mashonaland Eagles in Zimbabwe to victory in the inaugural Logan Cup before a very successful stint as the Head Coach of Essex County Cricket. At Essex, Silverwood helped the club's promotion in his first year in charge and led them to win the County Championship in 2017, after a gap of 25 years.","image_url":"https://c.ndtvimg.com/2021-09/33vlr5kg_chris-silverwood-afp_625x300_07_September_21.jpg?im=FeatureCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Rohit Sharma vs RCB stats and last 5 innings list: Rohit Sharma vs Mohammed Siraj IPL records","link":"https://thesportsrush.com/cricket-news-rohit-sharma-vs-rcb-stats-and-last-5-innings-list-rohit-sharma-vs-mohammed-siraj-ipl-records/","keywords":["Cricket","IPL 2022","Mumbai Indians","RCB","Indian Premier League","MI","Royal Challengers Bangalore"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Rohit Sharma vs RCB stats: The captain of Mumbai Indians has played 29 Indian Premier League matches against Royal Challengers Bangalore. Mumbai Indians captain Rohit Sharma will be under pressure to perform not just for himself but also for a team which has lost its first three Indian Premier League 2022 matches. Although Mumbai have… The post Rohit Sharma vs RCB stats and last 5 innings list: Rohit Sharma vs Mohammed Siraj IPL records appeared first on The SportsRush.","content":"Rohit Sharma vs RCB stats: The captain of Mumbai Indians has played 29 Indian Premier League matches against Royal Challengers Bangalore. Mumbai Indians captain Rohit Sharma will be under pressure to perform not just for himself but also for a team which has lost its first three Indian Premier League 2022 matches. Although Mumbai have bounced back from this position to even win a title in the past, Sharma wasn’t too excited about starting slow yet again in the IPL. Desperate to get off the mark on the points table, Indians will require Sharma to do well at the Maharashtra Cricket Association Stadium tonight. Rohit Sharma vs RCB stats Sharma, who had played his first-ever match against Royal Challengers Bangalore for Deccan Chargers in the inaugural season of the IPL, has scored 759 runs in 28 innings against them at an average of 29.19 and a strike rate of 137.25 including seven half-centuries. ALSO READ: Virat Kohli vs Mumbai Indians IPL stats It was during an IPL 2018 match at the Wankhede Stadium when Sharma had missed out on a T20 century against Bangalore. In what remains his career-best knock against them, Sharma had scored 94 (52) with the help of 10 fours and five sixes. Readers must note that Sharma hasn’t scored a half-century against RCB in six innings since then. Runs Balls Ground Year 43 28 Dubai 2021 19 15 Chennai 2021 8 8 Dubai 2020 28 19 Mumbai 2019 48 33 Bengaluru 2019 Rohit Sharma vs Mohammed Siraj IPL records are set to make their moves tonight पलटन, तयार ना? #OneFamily #DilKholKe #MumbaiIndians #RCBvMI @ImRo45 @imVkohli pic.twitter.com/JZGyHhqFvW — Mumbai Indians (@mipaltan) April 9, 2022 As far as Sharma’s head-to-head record against Royal Challengers fast bowler Mohammed Siraj is concerned, Sharma has scored 50 (36) with the help of five fours and two sixes across six IPL innings. Siraj, who has picked eight wickets in as many matches against MI, has never dismissed Sharma in the biggest T20 tournament. The post Rohit Sharma vs RCB stats and last 5 innings list: Rohit Sharma vs Mohammed Siraj IPL records appeared first on The SportsRush.","pubDate":"2022-04-09 12:46:50","full_description":"Rohit Sharma vs RCB stats: The captain of Mumbai Indians has played 29 Indian Premier League matches against Royal Challengers Bangalore. Mumbai Indians captain Rohit Sharma will be under pressure to perform not just for himself but also for a team which has lost its first three Indian Premier League 2022 matches. Although Mumbai have bounced back from this position to even win a title in the past, Sharma wasn’t too excited about starting slow yet again in the IPL. Desperate to get off the mark on the points table, Indians will require Sharma to do well at the Maharashtra Cricket Association Stadium tonight. Sharma, who had played his first-ever match against Royal Challengers Bangalore for Deccan Chargers in the inaugural season of the IPL, has scored 759 runs in 28 innings against them at an average of 29.19 and a strike rate of 137.25 including seven half-centuries. ALSO READ: Virat Kohli vs Mumbai Indians IPL stats It was during an IPL 2018 match at the Wankhede Stadium when Sharma had missed out on a T20 century against Bangalore. In what remains his career-best knock against them, Sharma had scored 94 (52) with the help of 10 fours and five sixes. Readers must note that Sharma hasn’t scored a half-century against RCB in six innings since then. are set to make their moves tonight ♥️ पलटन, तयार ना? #OneFamily #DilKholKe #MumbaiIndians #RCBvMI @ImRo45 @imVkohli pic.twitter.com/JZGyHhqFvW — Mumbai Indians (@mipaltan) April 9, 2022 As far as Sharma’s head-to-head record against Royal Challengers fast bowler Mohammed Siraj is concerned, Sharma has scored 50 (36) with the help of five fours and two sixes across six IPL innings. Siraj, who has picked eight wickets in as many matches against MI, has never dismissed Sharma in the biggest T20 tournament.","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"}]}