{"newsArray":[{"article_id":"66e783576a665cb0af7b24d8eaf8c4d9","title":"India Playing XI Predicted: ऑस्ट्रेलिया के खिलाफ पहले वनडे में भारतीय XI को लेकर ऐसा बन रहा समीकरण, 6 खिलाड़ियों को लेकर 'कंफ्यूजन' में टीम इंडिया","link":"https://sports.ndtv.com/hindi/cricket/ind-vs-australia-1st-odi-india-playing-xi-predicted-ashwin-vs-washington-sundar-siraj-vs-shami-ruturaj-gaikwad-vs-ishan-kishan-4412566#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"India Playing XI Predicted: ऑस्ट्रेलिया के खिलाफ पहला वनडे मैच आज होना है. विश्व कप की तैयारी के लिए यह सीरीज दोनों टीमों के लिए काफी अहम होने वाली है.","content":"India Playing XI Predicted, ऑस्ट्रेलिया के खिलाफ भारतीय इलेवन क्या होगी ! विश्व कप से पहले भारतीय टीम ,ऑस्ट्रेलिया के खिलाफ 3 मैचों की वनडे सीरीज (IND vs AUS ODI) खेलने वाली है. सीरीज का पहला मैच आज यानी 22 सितंबर को मोहाली में खेला जाएगा. पहले दो वनडे के लिए कोहली और रोहित जैसे दिग्गजों को रेस्ट दिया गया है. ऐसे में सीरीज के पहले दो वनडे मैचों के लिए केएल राहुल को कप्तानी दी गई है. यानी पहले दो वनडे मैचों की जिम्मेदारी युवा खिलाड़ियों के कंधे पर होगी. वहीं, ऑस्ट्रेलिया के खिलाफ पहले वनडे में भारतीय इलेवन (India Playing XI vs Australia 1st ODI) क्या होगी, इसको लेकर भी बहस तेज हो गई है. दरअसल, वनडे टीम में अश्विन की वापसी हुई है जिसने इस बहस को तेज कर दी है कि उन्हें विश्व कप की टीम में मौका मिल सकता है. ऐसा इसलिए क्योंकि अक्षर पटेल चोटिल हैं. वहीं, वाशिंगटन सुंदर भी कतार में हैं. ऐसे में पहले वनडे में में से जो भी खिलाड़ी प्लेइंग इलेवन का हिस्सा बनता है, उसकी संभावना विश्व कप की टीम में खेलने की बढ़ जाएगी. बता दें कि 28 सितंबर तक टीमें अपने स्क्वॉड में बदलाव कर सकते हैं. ऐसे में आज देखना दिलचस्प होगा कि अश्विन और सुंदर में से किसे प्लेइंग XI में मौका मिलता है. वहीं, पहले वनडे में को शामिल किया जा सकता है. सिराज को आज आराम भी दिया जा सकता है. दरअसल, एशिया कप में सिराज ने कमाल की परफॉर्मेंस किया था. एशिया कप में सिराज को शमी से आगे रखा गया था. ऐसे में आज भी यही उम्मीद है कि सिराज को आराम दिया जाएगा. इसके अलावा जसप्रीत बुमराह को भी आज के मैच में आराम दिया जा सकता है. उनकी जगह प्रसिद्ध कृष्णा को मौका मिल सकता है. दरअसल, विश्व कप अगले महीने ही शुरू होने वाला है. ऐसे में भारतीय टीम अपने अहम खिलाड़ियों को तरोताजा रखने की कोशिश करेगा. आज श्रेयस अय्यर. को मौका मिल सकता है. एशिया कप में अय्यर चोटिल हो गए थे जिसके कारण केएल राहुल को मौका मिला था. राहुल ने वापसी कर शतक जमाकर धमाका कर दिया था. ऐसे में आज पहले वनडे में अय्यर फिट रहे तो यकीनन उन्हें मौका मिलेगा. अय्यर के लिए यह सीरीज खुद को साबित करने वाला होगा. वनडे में सूर्या के परफॉर्मेंस को औसत ही आंका जा रहा है. ऐसे में ऑस्ट्रेलिया का यह नडे सीरीज में सूर्या के लिए किसी मौके से कम नहीं है. सूर्या इस सीरीज में बेहतरीन बल्लेबाजी कर उन आलोचकों को करारा जवाब देना चाहेंगे जो उन्हें वनडे के लिए उपयुक्त नहीं मानते हैं. ऑस्ट्रेलिया के खिलाफ सीरीज में भारत के पास ऋतुराज गायकवाड़ भी हैं. ऐसे में उम्मीद है कि इस युवा क्रिकेटर को ओपनिंग की जिम्मेदारी दी जा सकती है. गायकवाड़ को भारतीय टीम का भविष्य माना जाता है. ऐसे में उम्मीद है कि आज ऑस्ट्रेलिया के खिलाफ इशान किशन या फिर गिल के साथ ओपनिंग की जिम्मेदारी उन्हें दी जा सकती है. इशान किशन/शुभमन गिल/ ऋतुराज गायकवाड़, श्रेयस अय्यर, केएल राहुल (कप्तान), सूर्यकुमार यादव, रविंद्र जडेजा, वॉशिंगटन सुंदर, अश्विन, शार्दुल ठाकुर, मोहम्मद सिराज/मोहम्मद शमी, जसप्रीत बुमराह/प्रसिद्ध कृष्णा केएल राहुल (कप्तान), रविंद्र जडेजा (उप-कप्तान), ऋतुराज गायकवाड़, शुभमन गिल, श्रेयस अय्यर, सूर्यकुमार यादव, तिलक वर्मा, इशान किशन (विकेटकीपर), शार्दुल ठाकुर, वाशिंगटन सुंदर, आर अश्विन ,जसप्रीत बुमराह, मोहम्मद शमी, मोहम्मद सिराज, प्रसिद्ध कृष्णा पढ़ें ,राजनीति,खेल समाचार, और की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-09-22 02:09:02","image_url":"https://c.ndtvimg.com/2022-02/46khcr18_ashwin-odi-afp_625x300_02_February_22.jpg","source_id":"ndtv_in","source_priority":129751,"country":["india"],"category":["sports"],"language":"hindi"},{"article_id":"8ec455281de4ecd17a03423e870ba191","title":"Inside the deal that brought Reynolds - and maybe a premiership - to Brisbane","link":"https://www.smh.com.au/sport/nrl/inside-the-deal-that-brought-reynolds-and-maybe-a-premiership-to-brisbane-20230922-p5e6sq.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Roy Masters"],"video_url":null,"description":"The story of how South Sydney’s grand final-winning playmaker Adam Reynolds came to Brisbane is a touching tale of old-school football loyalties.","content":"Add articles to your saved list and come back to them any time. A friend may well be reckoned the masterpiece of nature, American poet Ralph Waldo Emerson once wrote. The story of how Adam Reynolds came to Brisbane is a touching tale of old-school football loyalties centring on how a former Broncos premiership player, aware what was need to save the coaching career of his mate and Broncos boss Kevin Walters, drove a deal after consulting with two of rugby league’s greatest leaders and confiding in a player manager from a bygone era. Chris Johns and Walters are more than teammates from the Broncos’ 1992-93 premiership years. They were business partners back in 2005, each holding a one-third share in a booming Brisbane car wash business, along with former Australian cricketer, Ian Healy. But Walters’ ambition was always to coach and in 2008 he surrendered his share to Johns’ brother, Cameron. Walters, widely known by his good bloke Kevvy name, accepted assistant coach’s roles with the Broncos (three times), Melbourne and Newcastle, while earlier taking charge of the Ipswich Jets and France’s Catalans in Super League, before being appointed Queensland Origin coach and working for Fox Sports. Yet, as the car wash business grew to five franchises, Walters was punished by the sin of ambition, failing to secure a top NRL position. Johns agonised, calling me, as his former coach at St George, to check on Walters’ progress with the Storm. As president of the Broncos’ past players association, Johns lobbied hard for Walters to be appointed head coach, annoying chair Karl Morris with furious late-night text messages. Anthony Seibold won the job but delivered the Broncos their only wooden spoon . Kevin Walters had long coveted the Broncos’ coaching job he finally landed in 2021. Credit: Getty So, after the longest coaching apprenticeship for a five-time premiership player, Walters finally won the job he always craved. But he didn’t do much better than Seibold in his inaugural season of 2021, coming 14th. Johns has footy smarts, being the Storm’s inaugural CEO as well as a Kangaroo. He was convinced an organising halfback could save his mate’s coaching career. Three potential names had been mentioned – Parramatta’s Mitchell Moses, Cronulla’s Shaun Johnson and South Sydney’s Reynolds – but no one at the Broncos, still a club in turmoil, had seized the initiative to commence negotiations. The tenacious Johns, despite having no formal role at the Broncos, is not one to stay silent. “I said to them, ‘You’ve got to get Reynolds. He’s exactly what we need.’ But they were not convinced.” He threatened to fly to Sydney and sign Reynolds himself, only to be told by Walters, sensitive to club politics, “You can’t do that.” You should be going for Reynolds but it’s not about what I think ... It’s what the players think. They know he will be good for them. Johns called his former Broncos coach Wayne Bennett and asked which of the three halves Brisbane should choose. Bennett, who had coached Reynolds at the Rabbitohs, nominated his former No.7. “But the thing that pushed me hard,” admitted Johns in reference to Melbourne coach Craig Bellamy, “was Bellyache.” According to Johns, Bellamy, said, “You should be going for Reynolds but it’s not about what I think, or what Wayne thinks, or what the board thinks. It’s what the players think. They will know Reynolds will be good for them. They will know he’s the one who can run a game plan.” Reynolds is managed by long-term agent Steve “Chimes” Gillis, universally held in high regard by ex-players, particularly those who have placed their son’s affairs in his care. Old-schoolers noted that when Brett Finch (son of Robert), Jarrod Mullen (son of Steve) and Jack De Belin (grandson of Fred) attended court, Chimes didn’t miss a day and didn’t hide from the cameras. Gillis said, “Johnsie rang me and said he needed a favour. He said he needed to get Kevvy in front of Adam. He knew Adam was the man who could turn the place around. “They came down on a Sunday night and I drove them to Adam’s house at Mascot. They chatted for an hour or so and Kevvy presented Adam with a Broncos jumper. It was old-school stuff. They flew back on a 8.30pm flight. A physio came down to give Adam the once-over and they did the deal only two or three days after the meeting. Kevin Walters, Chris Johns and Ian Healy at their car wash in 2005. Credit: Glenn Hunt “Johnsie was the man who put us all together. He was the one who flicked the switch.” Johns defers credit to Gillis. “I had no authority to sign Reynolds,” he said. “Chimes made it happen. Chimes always does the best for his clients. A few player managers could learn from him.” However, Reynolds’ first year at the Broncos did not deliver success. They were in the top four by round 19, despite Reynolds missing four mid-season matches. The Broncos then lost five of their last six matches with him on the field. But, despite the mounting losses and the “Kevvy can’t coach” cries, he maintained faith with his talented but troubled team. Most coaches would have axed the many youngsters and brought back experienced players to secure a top-eight place. The Broncos finished ninth but the rookies gained experience. Walters also gambled on the future at the end of this season. Guaranteed the minor premiership if they defeated an understrength Melbourne team in the final round, Walters rested almost his entire squad and was beaten , gifting the Panthers the JJ Giltinan trophy . The Broncos, with their top side selected, then humiliated the Storm in the first week of the finals and now meet the Warriors, travelling back across the Tasman to play in front of a parochial Brisbane crowd on Saturday night. Walters and Johns were both part of the Broncos 1990s golden era. Credit: Fairfax Media Walters acknowledges John’s role in securing Reynolds, conceding, “he has always looked out for me.” State loyalty is the only enduring difference between them, with Johns being the first Brisbane-based player selected in a NSW State of Origin team in 1990. “We’ve had our differences over the years,” says Walters, “but the thing I like about him more than anything is his honesty. “Sometimes it can be very brutal. When I was coaching Queensland, he rang me up the morning after we’d just picked the Queensland team. He said, ‘I just want to congratulate you.’ “I said, ‘What for?’ He said, ‘You just picked the worst Queensland team in history.’ “He’s always been honest with me. He hasn’t wavered.” Both men know life is no scripted book. It’s page after page of rocks and diamonds, a volume of success and survival without a back cover to foretell the end. Nor will their football relationship end with a premiership in 2023. “My next challenge is to get Kevvy a halfback to follow Reynolds,” Johns said. Watch the NRL Grand Final Exclusive Live and Free on Channel 9 and 9Now . Sports news, results and expert commentary. Sign up for our Sport newsletter .","pubDate":"2023-09-22 01:45:00","image_url":null,"source_id":"smh","source_priority":6729,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"758b77dfddfeba1e019fc4f81ec55af8","title":"IND Vs AUS Playing 11: ઐય્યર-અશ્વિનની વાપસી પર નજર, ઓસ્ટ્રેલિયા સામેની પ્રથમ વન-ડેમાં આવી હોઇ શકે છે ટીમ ઇન્ડિયાની પ્લેઇંગ 11","link":"https://gujarati.abplive.com/sports/cricket/ind-vs-aus-playing-11-india-vs-australia-1st-odi-chandigarh-pitch-report-weather-forecast-and-other-details-858524","keywords":["ક્રિકેટ"],"creator":["gujarati.abplive.com"],"video_url":null,"description":"IND vs AUS Playing 11: ભારત અને ઓસ્ટ્રેલિયા વચ્ચે 3 વન-ડે મેચની સીરિઝ રમાશે. વર્લ્ડકપ પહેલા ભારત-ઓસ્ટ્રેલિયા સીરિઝ ઘણી મહત્વપૂર્ણ માનવામાં આવે છે. ભારત-ઓસ્ટ્રેલિયા વનડે શ્રેણીની પ્રથમ મેચ આજે મોહાલીમાં રમાશે. શુક્રવારે બંને ટીમો સામસામે ટકરાશે. આ મેચ ભારતીય સમય અનુસાર બપોરે 1.30 વાગ્યે શરૂ થશે. ભારતીય ટીમ તેના નિયમિત કેપ્ટન રોહિત શર્મા સિવાય વિરાટ કોહલી જેવા ખેલાડીઓ વિના રહેશે.                        આવી હોઇ શકે છે ભારતીય ટીમની પ્લેઇંગ 11   ઋતુરાજ ગાયકવાડ અને શુભમન ગિલ ભારત માટે ઓપનર તરીકે જોવા મળી શકે છે. આ પછી ઈશાન કિશન નંબર-3 પર બેટિંગ કરશે. આ સિવાય મિડલ ઓર્ડરમાં કેએલ રાહુલ, શ્રેયસ અય્યર, સૂર્યકુમાર યાદવ જેવા ખેલાડીઓ હશે. રવિન્દ્ર જાડેજા ઓલરાઉન્ડર તરીકે રમશે. રવિ અશ્વિનને ટીમ ઈન્ડિયાની પ્લેઈંગ ઈલેવનમાં તક મળી શકે છે. જ્યારે મોહમ્મદ શમી અને જસપ્રિત બુમરાહને પણ સ્થાન મળશે તે નક્કી છે. એવું માનવામાં આવે છે કે મોહમ્મદ સિરાજ પ્રથમ વનડે મેચમાં ટીમ ઇન્ડિયાની પ્લેઇંગ ઇલેવનનો ભાગ નહીં હોય.               શું રવિ અશ્વિન અને શ્રેયસ તકનો લાભ ઉઠાવી શકશે? ભારતીય ટીમ મેનેજમેન્ટ અને પ્રશંસકોની નજર શ્રેયસ ઐય્યર અને રવિ અશ્વિન પર રહેશે. વાસ્તવમા શ્રેયસે એશિયા કપમાં વાપસી કરી હતી પરંતુ તે વધુ મેચ રમી શક્યો ન હતો. રવિ અશ્વિન લગભગ 18 મહિના પછી ભારતીય વનડે ટીમમાં વાપસી કરી રહ્યો છે. અક્ષર પટેલની જગ્યાએ રવિ અશ્વિનને ભારતીય ટીમમાં સ્થાન મળ્યું છે. રવિ અશ્વિન માટે ભારત-ઓસ્ટ્રેલિયા વનડે સીરીઝ ઘણી મહત્વની માનવામાં આવે છે. માનવામાં આવી રહ્યું છે કે જો રવિ અશ્વિનનું પ્રદર્શન સારું રહેશે તો આગામી વર્લ્ડ કપ માટે દરવાજા ખુલી શકે છે. ભારતીય ટીમની સંભવિત પ્લેઇંગ 11 ઋતુરાજ ગાયકવાડ, શુભમન ગિલ, ઈશાન કિશન, કેએલ રાહુલ (કેપ્ટન), શ્રેયસ ઐય્યર, સૂર્યકુમાર યાદવ, રવિન્દ્ર જાડેજા, રવિચંદ્રન અશ્વિન, મોહમ્મદ શમી અને જસપ્રીત બુમરાહ. ઓસ્ટ્રેલિયાની સંભવિત પ્લેઇંગ 11 ડેવિડ વોર્નર, મિશેલ માર્શ, સ્ટીવ સ્મિથ, માર્નસ લાબુશેન, એલેક્સ કેરી (વિકેટકીપર), કેમરૂન ગ્રીન, માર્કસ સ્ટોઈનિસ, પેટ કમિન્સ, જોશ હેઝલવુડ, એડમ ઝમ્પા અને તનવીર સંઘા.","content":"IND vs AUS Playing 11: ભારત અને ઓસ્ટ્રેલિયા વચ્ચે 3 વન-ડે મેચની સીરિઝ રમાશે. વર્લ્ડકપ પહેલા ભારત-ઓસ્ટ્રેલિયા સીરિઝ ઘણી મહત્વપૂર્ણ માનવામાં આવે છે. ભારત-ઓસ્ટ્રેલિયા વનડે શ્રેણીની પ્રથમ મેચ આજે મોહાલીમાં રમાશે. શુક્રવારે બંને ટીમો સામસામે ટકરાશે. આ મેચ ભારતીય સમય અનુસાર બપોરે 1.30 વાગ્યે શરૂ થશે. ભારતીય ટીમ તેના નિયમિત કેપ્ટન રોહિત શર્મા સિવાય વિરાટ કોહલી જેવા ખેલાડીઓ વિના રહેશે. આવી હોઇ શકે છે ભારતીય ટીમની પ્લેઇંગ 11 ઋતુરાજ ગાયકવાડ અને શુભમન ગિલ ભારત માટે ઓપનર તરીકે જોવા મળી શકે છે. આ પછી ઈશાન કિશન નંબર-3 પર બેટિંગ કરશે. આ સિવાય મિડલ ઓર્ડરમાં કેએલ રાહુલ, શ્રેયસ અય્યર, સૂર્યકુમાર યાદવ જેવા ખેલાડીઓ હશે. રવિન્દ્ર જાડેજા ઓલરાઉન્ડર તરીકે રમશે. રવિ અશ્વિનને ટીમ ઈન્ડિયાની પ્લેઈંગ ઈલેવનમાં તક મળી શકે છે. જ્યારે મોહમ્મદ શમી અને જસપ્રિત બુમરાહને પણ સ્થાન મળશે તે નક્કી છે. એવું માનવામાં આવે છે કે મોહમ્મદ સિરાજ પ્રથમ વનડે મેચમાં ટીમ ઇન્ડિયાની પ્લેઇંગ ઇલેવનનો ભાગ નહીં હોય. શું રવિ અશ્વિન અને શ્રેયસ તકનો લાભ ઉઠાવી શકશે? googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); ભારતીય ટીમ મેનેજમેન્ટ અને પ્રશંસકોની નજર શ્રેયસ ઐય્યર અને રવિ અશ્વિન પર રહેશે. વાસ્તવમા શ્રેયસે એશિયા કપમાં વાપસી કરી હતી પરંતુ તે વધુ મેચ રમી શક્યો ન હતો. રવિ અશ્વિન લગભગ 18 મહિના પછી ભારતીય વનડે ટીમમાં વાપસી કરી રહ્યો છે. અક્ષર પટેલની જગ્યાએ રવિ અશ્વિનને ભારતીય ટીમમાં સ્થાન મળ્યું છે. રવિ અશ્વિન માટે ભારત-ઓસ્ટ્રેલિયા વનડે સીરીઝ ઘણી મહત્વની માનવામાં આવે છે. માનવામાં આવી રહ્યું છે કે જો રવિ અશ્વિનનું પ્રદર્શન સારું રહેશે તો આગામી વર્લ્ડ કપ માટે દરવાજા ખુલી શકે છે. ભારતીય ટીમની સંભવિત પ્લેઇંગ 11 ઋતુરાજ ગાયકવાડ, શુભમન ગિલ, ઈશાન કિશન, કેએલ રાહુલ (કેપ્ટન), શ્રેયસ ઐય્યર, સૂર્યકુમાર યાદવ, રવિન્દ્ર જાડેજા, રવિચંદ્રન અશ્વિન, મોહમ્મદ શમી અને જસપ્રીત બુમરાહ. ઓસ્ટ્રેલિયાની સંભવિત પ્લેઇંગ 11 ડેવિડ વોર્નર, મિશેલ માર્શ, સ્ટીવ સ્મિથ, માર્નસ લાબુશેન, એલેક્સ કેરી (વિકેટકીપર), કેમરૂન ગ્રીન, માર્કસ સ્ટોઈનિસ, પેટ કમિન્સ, જોશ હેઝલવુડ, એડમ ઝમ્પા અને તનવીર સંઘા.","pubDate":"2023-09-22 01:02:50","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/09/21/8495ae3eecffb5f16a69801fea2fc6e11695288611469428_original.jpg","source_id":"abplive","source_priority":10959,"country":["india"],"category":["sports"],"language":"gujarati"},{"article_id":"5ba99df61b4e2c6a26122411cd93183b","title":"IPL: દુનિયાની નંબર વન લીગ બનવાની નજીક ઇન્ડિયન પ્રીમિયર લીગ, બ્રાન્ડ વેલ્યૂમાં થયો વધારો","link":"https://gujarati.abplive.com/sports/cricket/indian-premier-league-is-now-valued-at-11-2-billion-after-bcci-s-mammoth-influx-in-media-rights-deal-858522","keywords":["ક્રિકેટ"],"creator":["gujarati.abplive.com"],"video_url":null,"description":"IPL Brand Value: ઇન્ડિયન  પ્રીમિયર લીગની લોકપ્રિયતા સતત વધી રહી છે. હવે IPLની બ્રાન્ડ વેલ્યુમાં લગભગ 6 ટકાનો વધારો થયો છે. આ સાથે IPL વિશ્વની સૌથી મોંઘી ક્રિકેટ લીગ બની ગઈ છે. મીડિયા રિપોર્ટ્સ અનુસાર, IPLની બ્રાન્ડ વેલ્યુમાં 6.3 ટકાનો વધારો થયો છે. વાસ્તવમાં ગયા વર્ષે IPLની બજાર કિંમત 87000 કરોડ રૂપિયા હતી, જે હવે 92500 કરોડ રૂપિયા થઈ ગઈ છે. IPL ટીમોમાં મુંબઈ ઈન્ડિયન્સ ટોપ પર છે અમેરિકાની નેશનલ ફૂટબોલ લીગની બ્રાન્ડ વેલ્યુ 11.2 બિલિયન ડોલર છે. જો આપણે IPL ટીમની વાત કરીએ તો મુંબઈ ઈન્ડિયન્સની બ્રાન્ડ વેલ્યૂ ટોચ પર છે. આ પછી મહેન્દ્ર સિંહ ધોનીની કેપ્ટનશીપ હેઠળની ચેન્નઈ સુપર કિંગ્સ છે. જ્યારે ત્રીજા નંબર પર રોયલ ચેલેન્જર્સ બેંગ્લોર છે. આ વર્ષે મુંબઈ ઈન્ડિયન્સ $410-450 મિલિયન સાથે ટોચ પર છે.      IPL પર પૈસાનો વરસાદ કેવી રીતે થયો? મીડિયા રિપોર્ટ્સ અનુસાર, IPLએ પ્રસારણ રાઇટ્સથી  ઘણો નફો કર્યો છે. આ સિવાય ગુજરાત ટાઇટન્સ અને લખનઉ સુપર જાયન્ટ્સના આવ્યા બાદ IPLનું માર્કેટ વધ્યું છે. લખનઉ સુપર જાયન્ટ્સ ફ્રેન્ચાઇઝી માટે રૂ. 7,090 કરોડ જ્યારે ગુજરાત ટાઇટન્સ ફ્રેન્ચાઇઝી માટે રૂ. 5,625 કરોડ ખર્ચવાના હતા.                        નોંધનીય છે કે બીસીસીઆઈએ આઈપીએલના મીડિયા રાઇટ્સથી  ઘણી કમાણી કરી હતી. BCCIએ ટેલિવિઝન અને ડિજિટલ અધિકારોની હરાજી દ્વારા 48390 કરોડ રૂપિયાની કમાણી કરી હતી. Viacom-18 એ ડિજિટલ રાઇટ્સ 20500 રૂપિયામાં ખરીદ્યા હતા. સ્ટાર સ્પોર્ટ્સ નેટવર્કે આઇપીએલના ટેલિવિઝન રાઇટ્સની હરાજી જીતી લીધી હતી. વાસ્તવમાં આ પહેલીવાર છે જ્યારે ટેલિવિઝન રાઇટ્સ અને IPLના ડિજિટલ રાઇટ્સ માટે અલગ-અલગ બિડ કરવામાં આવી છે.  એક રિપોર્ટ અનુસાર, ભારતીય ક્રિકેટ કંટ્રોલ બોર્ડ ટૂંક સમયમાં IPL 2024નું આયોજન કરવા પર વિચાર કરી રહ્યું છે. આ સાથે આ સિઝન વિદેશમાં પણ થાય તેવી શક્યતા છે. તેનું મુખ્ય કારણ 2024માં યોજાનારી લોકસભાની ચૂંટણી છે. જો કે, હજુ સુધી BCCI તરફથી આ અંગે કોઈ સત્તાવાર માહિતી સામે આવી નથી.  IPL 2024નું આયોજન માર્ચમાં થઈ શકે છે. તેની ફાઈનલ મેચ મેના પહેલા કે બીજા સપ્તાહમાં યોજાઈ શકે છે. પરંતુ અત્યારે સમગ્ર ધ્યાન વર્લ્ડ કપ 2023 પર છે. આ પછી જ કોઈ પણ પ્રકારનો નિર્ણય લેવામાં આવશે. આઇપીએલની  આગામી સીઝન ઝડપથી પૂર્ણ કરવાની સાથે વિદેશમાં પણ તેનું આયોજન થવાની સંભાવના છે","content":"IPL Brand Value: ઇન્ડિયન પ્રીમિયર લીગની લોકપ્રિયતા સતત વધી રહી છે. હવે IPLની બ્રાન્ડ વેલ્યુમાં લગભગ 6 ટકાનો વધારો થયો છે. આ સાથે IPL વિશ્વની સૌથી મોંઘી ક્રિકેટ લીગ બની ગઈ છે. મીડિયા રિપોર્ટ્સ અનુસાર, IPLની બ્રાન્ડ વેલ્યુમાં 6.3 ટકાનો વધારો થયો છે. વાસ્તવમાં ગયા વર્ષે IPLની બજાર કિંમત 87000 કરોડ રૂપિયા હતી, જે હવે 92500 કરોડ રૂપિયા થઈ ગઈ છે. IPL ટીમોમાં મુંબઈ ઈન્ડિયન્સ ટોપ પર છે અમેરિકાની નેશનલ ફૂટબોલ લીગની બ્રાન્ડ વેલ્યુ 11.2 બિલિયન ડોલર છે. જો આપણે IPL ટીમની વાત કરીએ તો મુંબઈ ઈન્ડિયન્સની બ્રાન્ડ વેલ્યૂ ટોચ પર છે. આ પછી મહેન્દ્ર સિંહ ધોનીની કેપ્ટનશીપ હેઠળની ચેન્નઈ સુપર કિંગ્સ છે. જ્યારે ત્રીજા નંબર પર રોયલ ચેલેન્જર્સ બેંગ્લોર છે. આ વર્ષે મુંબઈ ઈન્ડિયન્સ $410-450 મિલિયન સાથે ટોચ પર છે. IPL પર પૈસાનો વરસાદ કેવી રીતે થયો? googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); મીડિયા રિપોર્ટ્સ અનુસાર, IPLએ પ્રસારણ રાઇટ્સથી ઘણો નફો કર્યો છે. આ સિવાય ગુજરાત ટાઇટન્સ અને લખનઉ સુપર જાયન્ટ્સના આવ્યા બાદ IPLનું માર્કેટ વધ્યું છે. લખનઉ સુપર જાયન્ટ્સ ફ્રેન્ચાઇઝી માટે રૂ. 7,090 કરોડ જ્યારે ગુજરાત ટાઇટન્સ ફ્રેન્ચાઇઝી માટે રૂ. 5,625 કરોડ ખર્ચવાના હતા. નોંધનીય છે કે બીસીસીઆઈએ આઈપીએલ ના મીડિયા રાઇટ્સથી ઘણી કમાણી કરી હતી. BCCIએ ટેલિવિઝન અને ડિજિટલ અધિકારોની હરાજી દ્વારા 48390 કરોડ રૂપિયાની કમાણી કરી હતી. Viacom-18 એ ડિજિટલ રાઇટ્સ 20500 રૂપિયામાં ખરીદ્યા હતા. સ્ટાર સ્પોર્ટ્સ નેટવર્કે આઇપીએલના ટેલિવિઝન રાઇટ્સની હરાજી જીતી લીધી હતી. વાસ્તવમાં આ પહેલીવાર છે જ્યારે ટેલિવિઝન રાઇટ્સ અને IPLના ડિજિટલ રાઇટ્સ માટે અલગ-અલગ બિડ કરવામાં આવી છે. એક રિપોર્ટ અનુસાર, ભારતીય ક્રિકેટ કંટ્રોલ બોર્ડ ટૂંક સમયમાં IPL 2024નું આયોજન કરવા પર વિચાર કરી રહ્યું છે. આ સાથે આ સિઝન વિદેશમાં પણ થાય તેવી શક્યતા છે. તેનું મુખ્ય કારણ 2024માં યોજાનારી લોકસભાની ચૂંટણી છે. જો કે, હજુ સુધી BCCI તરફથી આ અંગે કોઈ સત્તાવાર માહિતી સામે આવી નથી. IPL 2024નું આયોજન માર્ચમાં થઈ શકે છે. તેની ફાઈનલ મેચ મેના પહેલા કે બીજા સપ્તાહમાં યોજાઈ શકે છે. પરંતુ અત્યારે સમગ્ર ધ્યાન વર્લ્ડ કપ 2023 પર છે. આ પછી જ કોઈ પણ પ્રકારનો નિર્ણય લેવામાં આવશે. આઇપીએલની આગામી સીઝન ઝડપથી પૂર્ણ કરવાની સાથે વિદેશમાં પણ તેનું આયોજન થવાની સંભાવના છે","pubDate":"2023-09-22 00:50:49","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/09/22/355e60c9732ff051a4e322ae3e9c2aec169534365197374_original.jpg","source_id":"abplive","source_priority":10959,"country":["india"],"category":["sports"],"language":"gujarati"},{"article_id":"63f65d6cbaf56f55bd51319e83c338e7","title":"One-month hiatus ends – domestic cricket commences today","link":"https://www.ft.lk/sports/One-month-hiatus-ends-–-domestic-cricket-commences-today/23-753289","keywords":null,"creator":null,"video_url":null,"description":null,"content":"By Sa’adi Thawfeeq Following a month-long hiatus where all domestic competitions were suspended subsequent to a Sports Ministry intervention, the Major Club League 3-day and the Invitational Club Tier B 3-day (non-first-class) will commence with a card of 16 matches from today. Top of the pile is the match between defending champions CCC and SSC at the CCC grounds. SSC placed third in Group A hold onto a 17-point lead over CCC and will want to consolidate their position if not improve it. CCC with a game in hand will be well placed if they can get the upper hand of SSC. The other game that takes precedence over others is the clash between second placed Bloomfield and third placed Police SC from Group B. Like CCC, Police SC have a game in hand and trail Bloomfield by seven points. A win for Bloomfield will propel them to the top of the table provided that leaders Ace Capital CC fail to derive full points from Kurunegala YCC at Kurunegala. Colts and Ragama CC one-two in Group A have relatively easy games where they will be looking to grab maximum points. Colts aiming to win the title in this their 150th year host seventh placed Army SC, while Ragama CC play eight placed Nugegoda SWC at Thurstan College grounds. NCC too have a chance of improving their position from fourth when they host a struggling Tamil Union outfit who are third from the bottom of the table. Other matches commencing today are the bottom of the Group B table clash between Sebastianites and Air Force SC at De Soysa Stadium, Moratuwa, Galle CC v BRC at Galle Stadium, Negombo CC v Kandy Customs SC at BOI Katunayake, and Chilaw Marians CC v Moors SC at Maggona. Meanwhile, the Invitational Club Tier B will also recommence their matches with a card of six games despite a court ruling hanging over their heads following a protest by Gesto SC over the selection of six clubs from the Governor’s trophy to play in Tier B. These six clubs along with the four demoted clubs from the Major Club League from last season form the 10 clubs playing in Tier B. The court ruled that the tournament can continue until the next hearing which is fixed for 26 September. The matches commencing today are: Navy SC v Saracens SC at Welisara, Kalutara TC v Lankan CC at Aarons Horana, Ambalangoda Singha SC v Malay CC at Army grounds, Karandeniya, Old Dharmapalian SC v Moratuwa SC at Army grounds, Dombagoda, Kandy CC v United Southern SC at Gajaba Saliyapura, and Rio SC v Leo CC at Milleniya.","pubDate":"2023-09-22 00:50:00","image_url":null,"source_id":"ft_lk","source_priority":1390226,"country":["sri lanka"],"category":["sports"],"language":"english"},{"article_id":"5068af053b583914362087f4e35ee1ab","title":"Danushka Gunathilaka case judgment on 28 September","link":"https://www.ft.lk/sports/Danushka-Gunathilaka-case-judgment-on-28-September/23-753288","keywords":null,"creator":null,"video_url":null,"description":null,"content":"Danuska Gunathilaka cries during his police interview An international cricketer pursued a Tinder date “relentlessly” with the night turning out “very differently to what the woman expected or wanted”, while his lawyers have told a court the woman’s evidence is “demonstrably unreliable”.International cricket star Danushka Gunathilaka has stood trial at the Downing Centre District Court for the past four days after pleading not guilty to one charge of sexual assault without consent. The charge relates to an incident on 2 November last year when it is alleged the 32-year-old removed a condom while having sex – known as stealthing – with a woman at her home in Sydney’s east. The pair first met at the Opera Bar near the Sydney Opera House, where CCTV footage shows them embracing, before having drinks together in the city and heading back to the woman’s home via ferry. The judge-alone trial has ended after both sides made their closing arguments on Thursday. Judge Huggett will deliver her judgment on 28 September. – (news.com.au)","pubDate":"2023-09-22 00:30:00","image_url":null,"source_id":"ft_lk","source_priority":1390226,"country":["sri lanka"],"category":["sports"],"language":"english"},{"article_id":"ed68973b290bd3345b8ef13b728c7148","title":"South Africa World Cup cricket blow as Nortje, Magala ruled out","link":"https://www.ft.lk/sports/South-Africa-World-Cup-cricket-blow-as-Nortje--Magala-ruled-out/23-753286","keywords":null,"creator":null,"video_url":null,"description":null,"content":"JOHANNESBURG (AFP): Fast bowlers Anrich Nortje and Sisanda Magala have both been ruled out of the Cricket World Cup because of injury, Cricket South Africa announced on Thursday. They will be replaced by all-rounder Andile Phehlukwayo and fast bowler Lizaad Williams. The loss of Nortje is a particularly heavy blow for South Africa’s chances because of his ability to bowl match-changing spells at high pace. One of the fastest bowlers in the world, capable of speeds of 150 km an hour and more, he was named Cricketer of the Year at CSA’s awards function in July. Nortje had to leave the field because of back spasms after bowling five overs in his only appearance in South Africa’s recent five-match series against Australia. According to a CSA statement he has a suspected lower back stress fracture. It is the second successive World Cup that Nortje will miss because of injury. A broken right thumb ruled him out of the 2019 tournament in England. The heavily-built Magala also played in only one game against Australia and has not fully recovered from a left knee injury.","pubDate":"2023-09-22 00:22:00","image_url":null,"source_id":"ft_lk","source_priority":1390226,"country":["sri lanka"],"category":["sports"],"language":"english"},{"article_id":"554eee48d0c37d6fb038dea7cdd32c30","title":"Wesleyites domiciled in UK donate cricket equipment","link":"https://www.ft.lk/sports/Wesleyites-domiciled-in-UK-donate-cricket-equipment/23-753283","keywords":null,"creator":null,"video_url":null,"description":null,"content":"Dr. Ananda Thevathasan (right) handing over the cricket equipment to Wesley Principal Avanka Fernando, also in the picture is M.T. Swangsa Wesleyites domiciled in the UK donated cricket equipment to the Wesley College Principal Avanka Fernando during a simple ceremony held at the College Hall recently. Dr. Ananda Thevathasan, a past cricket Captain of Wesley now residing in the UK, made the donation on behalf of the rest of the donors. M.T. Swangsa, another past Captain, coordinated the ceremony. OBU President Captain Navin de Silva, former cricketers and Captains and the Present Captain Sanithu Amarasinghe and senior players, along with the coaches, were also present during the ceremony.","pubDate":"2023-09-22 00:05:00","image_url":null,"source_id":"ft_lk","source_priority":1390226,"country":["sri lanka"],"category":["sports"],"language":"english"},{"article_id":"ad27eabc8c171afe72fe3c3e336aa5f1","title":"Alastair Cook wants to bow out of cricket with minimal fuss, ideally with another County Championship with Essex next week... and then head for his farm","link":"https://www.dailymail.co.uk/sport/cricket/article-12547203/Alastair-Cook-want-bow-cricket-minimal-fuss-ideally-County-Championship-Essex-week-head-farm.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"It says everything about Alastair Cook that he has already played on for Essex far longer than he planned when he bade farewell to England with a fairytale century in his last Test.","content":"Alastair Cook wants to bow out of cricket with minimal fuss, ideally with another County Championship with Essex next week... and then head for his farm Alastair Cook is aiming for one last hurrah before bowing quietly out of cricket Aged 38, he is still as fit as ever and one of the best batsmen in the country It has not always been plain sailing but he stands as one of England's true greats By Paul Newman for the Daily Mail Published: 23:43, 21 September 2023 | Updated: 00:49, 22 September 2023 e-mail 1 View comments It says everything about Alastair Cook that he has already played on for Essex far longer than he planned when he bade farewell to England with a fairytale century in his last Test. At that stage, five years ago after those unforgettable scenes against India at the Oval, he envisaged having one or two years giving back to his county before concentrating on the family farm that means so much to him. That he is only now coming to the end of the line, still as fit as ever at 38, is a measure of how much Cook has enjoyed being back in the county rank and file and the enduring quality that sees him still one of the best opening batsmen in the country. It does look certain this is it —even though when MailOnline broke news of Cook’s impending retirement yesterday , Essex released a statement saying the future of one of England’s greatest batsmen would only be decided at the end of the season. In truth, the decision already looks to have been made. Cook wants to bow out, without any fuss, in the not exactly glamorous surroundings of Wantage Road against Northants next week, ideally with another County Championship title under his belt. Alastair Cook wants to bow out of cricket with minimal fuss - ideally with a County Championship under his belt with Essex next week He now wants to concentrate on his family farm which means so much to him Cook with wife Alice Hunt on the farm in January 2011 - the pair have two daughters and a son together For that to happen, Essex still have to upset the odds — a win against Hampshire on Friday coupled with a defeat or draw for Surrey against Northants at the Oval would make for a thrilling final round — but whatever happens Cook has already achieved it all. When he walked off at the Oval in 2018 to the warmest of ovations Cook had become England’s record run-scorer, had made 33 Test centuries, captained England to two Ashes wins and had dominated with the bat in the biggest modern triumph against Australia of them all, under Andrew Strauss in 2010-11. And all in an old-fashioned, almost limited style that would be anathema to today’s Bazball-era England team. He might not even have made the Test side in the first place had he emerged today, but Cook was talented and determined enough to have adapted should he have needed to in order to catch Brendon McCullum’s eye. It has not always been plain-sailing. The worst times of Cook’s career came after England had been thrashed 5-0 in Australia in 2013-14 under his captaincy and he was instrumental in the decision to jettison Kevin Pietersen as the rebuilding process began. For a while it looked certain, with high-profile figures like Shane Warne and Michael Vaughan firmly in Pietersen’s corner, that Cook would quickly follow, particularly after a defeat by Sri Lanka at Headingley that came with pressure on him at its most intense. That he hung on, regained the Ashes in 2015 before handing the captaincy over to Joe Root and then enjoyed a last hurrah back in the ranks, was a tribute to Cook’s stubbornness and sheer determination not to be hounded out by all the noise. One of England's greatest batsman retired from the international game in 2018 but has enjoyed county cricket since then There is no question he could carry on into his 40s at Chelmsford if he wanted to Cook is England's top Test match run scorer of all-time, with the opener scoring 12,472 runs The 38-year-old also won four Ashes series with England during a hugely decorated career He deserved to carry on in 2014 and he throroughly deserved that dream finale four years later when the English cricketing public made it perfectly clear what they thought of him. They told him he was one of the most popular and significant figures in the game. Cook won a Championship with Essex in 2017 but it came when he was mostly away with England and his decision to play on in county cricket, unlike so many top players when they are done with England, was made partly to pursue more domestic honours. They came in 2019 when he dramatically batted Essex to the title against their biggest rivals Somerset at Taunton on the final day of the season and in the Bob Willis Trophy the following Covid-hit year. Another title would be the icing on Cook’s cake. There is no question he could carry on into his 40s at Chelmsford like his mentor Graham Gooch did after his outstanding England career. He looks the same supremely fit figure as when he emerged to make a double century for Essex against Australia in 2005 and then a century on Test debut in India in 2006. But Cook will not want to outstay his welcome, and has a bright future on screen, radio and working hard on his farm. But first there is the small matter of one more Championship title to win. Share or comment on this article: Alastair Cook wants to bow out of cricket with minimal fuss, ideally with another County Championship with Essex next week... and then head for his farm e-mail Add comment Comments 1 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-09-21 23:49:15","image_url":"https://i.dailymail.co.uk/1s/2023/09/22/00/75708273-0-image-a-64_1695337430093.jpg","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"e809a8675e6b1064682fd04740a52872","title":"Maccabi aims to boost girls’ team","link":"https://www.australianjewishnews.com/maccabi-aims-to-boost-girls-team/","keywords":["Cricket","Maccabi AJAX Cricket Club","Sport","Sports","Australia","Greg Hurvitz","Melbourne","Caulfield"],"creator":null,"video_url":null,"description":"Girls aged between six and 14, of all abilities, including beginners, are encouraged to come along to the session.","content":"Having more than 60 players turn up as early as August 27 for the first pre-season training session ahead of the ISEC 2023/24 season – and excellent overall numbers in the weeks since – is a great sign for Maccabi-AJAX Junior Cricket Club (MAJCC). A renewed focus on individual skills assessment and development, plus recently upgraded training facilities, are also playing their part, ahead of the season starting on the second weekend in October. The club’s head of cricket performance, Greg Hurvitz said, “Credit to our very committed coaching group, who have not only called for this approach, but then followed it up by assessing and discussing options as a group. “The players have rocked up, and are giving it a real go.” The club is aiming to field five U11 and U13 boys’ teams, and for the first time in two seasons, three U15 boys’ teams. There are also very solid registrations for the club’s Cricket Blaster programs, for the very youngest of players. New MAJCC president Darren Sacks said, “The energy in our club right now is tremendous, and the positivity and effort is really noticeable. “But two areas we still need more players for, before the season begins, are our U17 boys’ squad and our girls’ cricket team.” To promote the latter, Sacks said the club will host a girls’ cricket ‘Come and Try’ session at Caulfield Park this Sunday (September 24) from 10.30-11.30am. Girls aged between six and 14, of all abilities, including beginners, are encouraged to come along to the session. There will be a friendly, inclusive atmosphere and a sausage sizzle. “The club’s girls’ team is very social and supportive, and just like last season, they will play their games on Wednesday nights, guided by coach Donna Gouldthorp, who has been specially been recruited by the club to advance girls cricket,” Sacks said.","pubDate":"2023-09-21 21:17:54","image_url":"https://static.timesofisrael.com/ajn/uploads/2023/09/girlscricketpromo_73152-1024x640.jpg","source_id":"australianjewishnews","source_priority":511030,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"66e783576a665cb0af7b24d8eaf8c4d9","title":"India Playing XI Predicted: ऑस्ट्रेलिया के खिलाफ पहले वनडे में भारतीय XI को लेकर ऐसा बन रहा समीकरण, 6 खिलाड़ियों को लेकर 'कंफ्यूजन' में टीम इंडिया","link":"https://sports.ndtv.com/hindi/cricket/ind-vs-australia-1st-odi-india-playing-xi-predicted-ashwin-vs-washington-sundar-siraj-vs-shami-ruturaj-gaikwad-vs-ishan-kishan-4412566#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"India Playing XI Predicted: ऑस्ट्रेलिया के खिलाफ पहला वनडे मैच आज होना है. विश्व कप की तैयारी के लिए यह सीरीज दोनों टीमों के लिए काफी अहम होने वाली है.","content":"India Playing XI Predicted, ऑस्ट्रेलिया के खिलाफ भारतीय इलेवन क्या होगी ! विश्व कप से पहले भारतीय टीम ,ऑस्ट्रेलिया के खिलाफ 3 मैचों की वनडे सीरीज (IND vs AUS ODI) खेलने वाली है. सीरीज का पहला मैच आज यानी 22 सितंबर को मोहाली में खेला जाएगा. पहले दो वनडे के लिए कोहली और रोहित जैसे दिग्गजों को रेस्ट दिया गया है. ऐसे में सीरीज के पहले दो वनडे मैचों के लिए केएल राहुल को कप्तानी दी गई है. यानी पहले दो वनडे मैचों की जिम्मेदारी युवा खिलाड़ियों के कंधे पर होगी. वहीं, ऑस्ट्रेलिया के खिलाफ पहले वनडे में भारतीय इलेवन (India Playing XI vs Australia 1st ODI) क्या होगी, इसको लेकर भी बहस तेज हो गई है. दरअसल, वनडे टीम में अश्विन की वापसी हुई है जिसने इस बहस को तेज कर दी है कि उन्हें विश्व कप की टीम में मौका मिल सकता है. ऐसा इसलिए क्योंकि अक्षर पटेल चोटिल हैं. वहीं, वाशिंगटन सुंदर भी कतार में हैं. ऐसे में पहले वनडे में में से जो भी खिलाड़ी प्लेइंग इलेवन का हिस्सा बनता है, उसकी संभावना विश्व कप की टीम में खेलने की बढ़ जाएगी. बता दें कि 28 सितंबर तक टीमें अपने स्क्वॉड में बदलाव कर सकते हैं. ऐसे में आज देखना दिलचस्प होगा कि अश्विन और सुंदर में से किसे प्लेइंग XI में मौका मिलता है. वहीं, पहले वनडे में को शामिल किया जा सकता है. सिराज को आज आराम भी दिया जा सकता है. दरअसल, एशिया कप में सिराज ने कमाल की परफॉर्मेंस किया था. एशिया कप में सिराज को शमी से आगे रखा गया था. ऐसे में आज भी यही उम्मीद है कि सिराज को आराम दिया जाएगा. इसके अलावा जसप्रीत बुमराह को भी आज के मैच में आराम दिया जा सकता है. उनकी जगह प्रसिद्ध कृष्णा को मौका मिल सकता है. दरअसल, विश्व कप अगले महीने ही शुरू होने वाला है. ऐसे में भारतीय टीम अपने अहम खिलाड़ियों को तरोताजा रखने की कोशिश करेगा. आज श्रेयस अय्यर. को मौका मिल सकता है. एशिया कप में अय्यर चोटिल हो गए थे जिसके कारण केएल राहुल को मौका मिला था. राहुल ने वापसी कर शतक जमाकर धमाका कर दिया था. ऐसे में आज पहले वनडे में अय्यर फिट रहे तो यकीनन उन्हें मौका मिलेगा. अय्यर के लिए यह सीरीज खुद को साबित करने वाला होगा. वनडे में सूर्या के परफॉर्मेंस को औसत ही आंका जा रहा है. ऐसे में ऑस्ट्रेलिया का यह नडे सीरीज में सूर्या के लिए किसी मौके से कम नहीं है. सूर्या इस सीरीज में बेहतरीन बल्लेबाजी कर उन आलोचकों को करारा जवाब देना चाहेंगे जो उन्हें वनडे के लिए उपयुक्त नहीं मानते हैं. ऑस्ट्रेलिया के खिलाफ सीरीज में भारत के पास ऋतुराज गायकवाड़ भी हैं. ऐसे में उम्मीद है कि इस युवा क्रिकेटर को ओपनिंग की जिम्मेदारी दी जा सकती है. गायकवाड़ को भारतीय टीम का भविष्य माना जाता है. ऐसे में उम्मीद है कि आज ऑस्ट्रेलिया के खिलाफ इशान किशन या फिर गिल के साथ ओपनिंग की जिम्मेदारी उन्हें दी जा सकती है. इशान किशन/शुभमन गिल/ ऋतुराज गायकवाड़, श्रेयस अय्यर, केएल राहुल (कप्तान), सूर्यकुमार यादव, रविंद्र जडेजा, वॉशिंगटन सुंदर, अश्विन, शार्दुल ठाकुर, मोहम्मद सिराज/मोहम्मद शमी, जसप्रीत बुमराह/प्रसिद्ध कृष्णा केएल राहुल (कप्तान), रविंद्र जडेजा (उप-कप्तान), ऋतुराज गायकवाड़, शुभमन गिल, श्रेयस अय्यर, सूर्यकुमार यादव, तिलक वर्मा, इशान किशन (विकेटकीपर), शार्दुल ठाकुर, वाशिंगटन सुंदर, आर अश्विन ,जसप्रीत बुमराह, मोहम्मद शमी, मोहम्मद सिराज, प्रसिद्ध कृष्णा पढ़ें ,राजनीति,खेल समाचार, और की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-09-22 02:09:02","image_url":"https://c.ndtvimg.com/2022-02/46khcr18_ashwin-odi-afp_625x300_02_February_22.jpg","source_id":"ndtv_in","source_priority":129751,"country":["india"],"category":["sports"],"language":"hindi"},{"article_id":"8ec455281de4ecd17a03423e870ba191","title":"Inside the deal that brought Reynolds - and maybe a premiership - to Brisbane","link":"https://www.smh.com.au/sport/nrl/inside-the-deal-that-brought-reynolds-and-maybe-a-premiership-to-brisbane-20230922-p5e6sq.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Roy Masters"],"video_url":null,"description":"The story of how South Sydney’s grand final-winning playmaker Adam Reynolds came to Brisbane is a touching tale of old-school football loyalties.","content":"Add articles to your saved list and come back to them any time. A friend may well be reckoned the masterpiece of nature, American poet Ralph Waldo Emerson once wrote. The story of how Adam Reynolds came to Brisbane is a touching tale of old-school football loyalties centring on how a former Broncos premiership player, aware what was need to save the coaching career of his mate and Broncos boss Kevin Walters, drove a deal after consulting with two of rugby league’s greatest leaders and confiding in a player manager from a bygone era. Chris Johns and Walters are more than teammates from the Broncos’ 1992-93 premiership years. They were business partners back in 2005, each holding a one-third share in a booming Brisbane car wash business, along with former Australian cricketer, Ian Healy. But Walters’ ambition was always to coach and in 2008 he surrendered his share to Johns’ brother, Cameron. Walters, widely known by his good bloke Kevvy name, accepted assistant coach’s roles with the Broncos (three times), Melbourne and Newcastle, while earlier taking charge of the Ipswich Jets and France’s Catalans in Super League, before being appointed Queensland Origin coach and working for Fox Sports. Yet, as the car wash business grew to five franchises, Walters was punished by the sin of ambition, failing to secure a top NRL position. Johns agonised, calling me, as his former coach at St George, to check on Walters’ progress with the Storm. As president of the Broncos’ past players association, Johns lobbied hard for Walters to be appointed head coach, annoying chair Karl Morris with furious late-night text messages. Anthony Seibold won the job but delivered the Broncos their only wooden spoon . Kevin Walters had long coveted the Broncos’ coaching job he finally landed in 2021. Credit: Getty So, after the longest coaching apprenticeship for a five-time premiership player, Walters finally won the job he always craved. But he didn’t do much better than Seibold in his inaugural season of 2021, coming 14th. Johns has footy smarts, being the Storm’s inaugural CEO as well as a Kangaroo. He was convinced an organising halfback could save his mate’s coaching career. Three potential names had been mentioned – Parramatta’s Mitchell Moses, Cronulla’s Shaun Johnson and South Sydney’s Reynolds – but no one at the Broncos, still a club in turmoil, had seized the initiative to commence negotiations. The tenacious Johns, despite having no formal role at the Broncos, is not one to stay silent. “I said to them, ‘You’ve got to get Reynolds. He’s exactly what we need.’ But they were not convinced.” He threatened to fly to Sydney and sign Reynolds himself, only to be told by Walters, sensitive to club politics, “You can’t do that.” You should be going for Reynolds but it’s not about what I think ... It’s what the players think. They know he will be good for them. Johns called his former Broncos coach Wayne Bennett and asked which of the three halves Brisbane should choose. Bennett, who had coached Reynolds at the Rabbitohs, nominated his former No.7. “But the thing that pushed me hard,” admitted Johns in reference to Melbourne coach Craig Bellamy, “was Bellyache.” According to Johns, Bellamy, said, “You should be going for Reynolds but it’s not about what I think, or what Wayne thinks, or what the board thinks. It’s what the players think. They will know Reynolds will be good for them. They will know he’s the one who can run a game plan.” Reynolds is managed by long-term agent Steve “Chimes” Gillis, universally held in high regard by ex-players, particularly those who have placed their son’s affairs in his care. Old-schoolers noted that when Brett Finch (son of Robert), Jarrod Mullen (son of Steve) and Jack De Belin (grandson of Fred) attended court, Chimes didn’t miss a day and didn’t hide from the cameras. Gillis said, “Johnsie rang me and said he needed a favour. He said he needed to get Kevvy in front of Adam. He knew Adam was the man who could turn the place around. “They came down on a Sunday night and I drove them to Adam’s house at Mascot. They chatted for an hour or so and Kevvy presented Adam with a Broncos jumper. It was old-school stuff. They flew back on a 8.30pm flight. A physio came down to give Adam the once-over and they did the deal only two or three days after the meeting. Kevin Walters, Chris Johns and Ian Healy at their car wash in 2005. Credit: Glenn Hunt “Johnsie was the man who put us all together. He was the one who flicked the switch.” Johns defers credit to Gillis. “I had no authority to sign Reynolds,” he said. “Chimes made it happen. Chimes always does the best for his clients. A few player managers could learn from him.” However, Reynolds’ first year at the Broncos did not deliver success. They were in the top four by round 19, despite Reynolds missing four mid-season matches. The Broncos then lost five of their last six matches with him on the field. But, despite the mounting losses and the “Kevvy can’t coach” cries, he maintained faith with his talented but troubled team. Most coaches would have axed the many youngsters and brought back experienced players to secure a top-eight place. The Broncos finished ninth but the rookies gained experience. Walters also gambled on the future at the end of this season. Guaranteed the minor premiership if they defeated an understrength Melbourne team in the final round, Walters rested almost his entire squad and was beaten , gifting the Panthers the JJ Giltinan trophy . The Broncos, with their top side selected, then humiliated the Storm in the first week of the finals and now meet the Warriors, travelling back across the Tasman to play in front of a parochial Brisbane crowd on Saturday night. Walters and Johns were both part of the Broncos 1990s golden era. Credit: Fairfax Media Walters acknowledges John’s role in securing Reynolds, conceding, “he has always looked out for me.” State loyalty is the only enduring difference between them, with Johns being the first Brisbane-based player selected in a NSW State of Origin team in 1990. “We’ve had our differences over the years,” says Walters, “but the thing I like about him more than anything is his honesty. “Sometimes it can be very brutal. When I was coaching Queensland, he rang me up the morning after we’d just picked the Queensland team. He said, ‘I just want to congratulate you.’ “I said, ‘What for?’ He said, ‘You just picked the worst Queensland team in history.’ “He’s always been honest with me. He hasn’t wavered.” Both men know life is no scripted book. It’s page after page of rocks and diamonds, a volume of success and survival without a back cover to foretell the end. Nor will their football relationship end with a premiership in 2023. “My next challenge is to get Kevvy a halfback to follow Reynolds,” Johns said. Watch the NRL Grand Final Exclusive Live and Free on Channel 9 and 9Now . Sports news, results and expert commentary. Sign up for our Sport newsletter .","pubDate":"2023-09-22 01:45:00","image_url":null,"source_id":"smh","source_priority":6729,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"758b77dfddfeba1e019fc4f81ec55af8","title":"IND Vs AUS Playing 11: ઐય્યર-અશ્વિનની વાપસી પર નજર, ઓસ્ટ્રેલિયા સામેની પ્રથમ વન-ડેમાં આવી હોઇ શકે છે ટીમ ઇન્ડિયાની પ્લેઇંગ 11","link":"https://gujarati.abplive.com/sports/cricket/ind-vs-aus-playing-11-india-vs-australia-1st-odi-chandigarh-pitch-report-weather-forecast-and-other-details-858524","keywords":["ક્રિકેટ"],"creator":["gujarati.abplive.com"],"video_url":null,"description":"IND vs AUS Playing 11: ભારત અને ઓસ્ટ્રેલિયા વચ્ચે 3 વન-ડે મેચની સીરિઝ રમાશે. વર્લ્ડકપ પહેલા ભારત-ઓસ્ટ્રેલિયા સીરિઝ ઘણી મહત્વપૂર્ણ માનવામાં આવે છે. ભારત-ઓસ્ટ્રેલિયા વનડે શ્રેણીની પ્રથમ મેચ આજે મોહાલીમાં રમાશે. શુક્રવારે બંને ટીમો સામસામે ટકરાશે. આ મેચ ભારતીય સમય અનુસાર બપોરે 1.30 વાગ્યે શરૂ થશે. ભારતીય ટીમ તેના નિયમિત કેપ્ટન રોહિત શર્મા સિવાય વિરાટ કોહલી જેવા ખેલાડીઓ વિના રહેશે.                        આવી હોઇ શકે છે ભારતીય ટીમની પ્લેઇંગ 11   ઋતુરાજ ગાયકવાડ અને શુભમન ગિલ ભારત માટે ઓપનર તરીકે જોવા મળી શકે છે. આ પછી ઈશાન કિશન નંબર-3 પર બેટિંગ કરશે. આ સિવાય મિડલ ઓર્ડરમાં કેએલ રાહુલ, શ્રેયસ અય્યર, સૂર્યકુમાર યાદવ જેવા ખેલાડીઓ હશે. રવિન્દ્ર જાડેજા ઓલરાઉન્ડર તરીકે રમશે. રવિ અશ્વિનને ટીમ ઈન્ડિયાની પ્લેઈંગ ઈલેવનમાં તક મળી શકે છે. જ્યારે મોહમ્મદ શમી અને જસપ્રિત બુમરાહને પણ સ્થાન મળશે તે નક્કી છે. એવું માનવામાં આવે છે કે મોહમ્મદ સિરાજ પ્રથમ વનડે મેચમાં ટીમ ઇન્ડિયાની પ્લેઇંગ ઇલેવનનો ભાગ નહીં હોય.               શું રવિ અશ્વિન અને શ્રેયસ તકનો લાભ ઉઠાવી શકશે? ભારતીય ટીમ મેનેજમેન્ટ અને પ્રશંસકોની નજર શ્રેયસ ઐય્યર અને રવિ અશ્વિન પર રહેશે. વાસ્તવમા શ્રેયસે એશિયા કપમાં વાપસી કરી હતી પરંતુ તે વધુ મેચ રમી શક્યો ન હતો. રવિ અશ્વિન લગભગ 18 મહિના પછી ભારતીય વનડે ટીમમાં વાપસી કરી રહ્યો છે. અક્ષર પટેલની જગ્યાએ રવિ અશ્વિનને ભારતીય ટીમમાં સ્થાન મળ્યું છે. રવિ અશ્વિન માટે ભારત-ઓસ્ટ્રેલિયા વનડે સીરીઝ ઘણી મહત્વની માનવામાં આવે છે. માનવામાં આવી રહ્યું છે કે જો રવિ અશ્વિનનું પ્રદર્શન સારું રહેશે તો આગામી વર્લ્ડ કપ માટે દરવાજા ખુલી શકે છે. ભારતીય ટીમની સંભવિત પ્લેઇંગ 11 ઋતુરાજ ગાયકવાડ, શુભમન ગિલ, ઈશાન કિશન, કેએલ રાહુલ (કેપ્ટન), શ્રેયસ ઐય્યર, સૂર્યકુમાર યાદવ, રવિન્દ્ર જાડેજા, રવિચંદ્રન અશ્વિન, મોહમ્મદ શમી અને જસપ્રીત બુમરાહ. ઓસ્ટ્રેલિયાની સંભવિત પ્લેઇંગ 11 ડેવિડ વોર્નર, મિશેલ માર્શ, સ્ટીવ સ્મિથ, માર્નસ લાબુશેન, એલેક્સ કેરી (વિકેટકીપર), કેમરૂન ગ્રીન, માર્કસ સ્ટોઈનિસ, પેટ કમિન્સ, જોશ હેઝલવુડ, એડમ ઝમ્પા અને તનવીર સંઘા.","content":"IND vs AUS Playing 11: ભારત અને ઓસ્ટ્રેલિયા વચ્ચે 3 વન-ડે મેચની સીરિઝ રમાશે. વર્લ્ડકપ પહેલા ભારત-ઓસ્ટ્રેલિયા સીરિઝ ઘણી મહત્વપૂર્ણ માનવામાં આવે છે. ભારત-ઓસ્ટ્રેલિયા વનડે શ્રેણીની પ્રથમ મેચ આજે મોહાલીમાં રમાશે. શુક્રવારે બંને ટીમો સામસામે ટકરાશે. આ મેચ ભારતીય સમય અનુસાર બપોરે 1.30 વાગ્યે શરૂ થશે. ભારતીય ટીમ તેના નિયમિત કેપ્ટન રોહિત શર્મા સિવાય વિરાટ કોહલી જેવા ખેલાડીઓ વિના રહેશે. આવી હોઇ શકે છે ભારતીય ટીમની પ્લેઇંગ 11 ઋતુરાજ ગાયકવાડ અને શુભમન ગિલ ભારત માટે ઓપનર તરીકે જોવા મળી શકે છે. આ પછી ઈશાન કિશન નંબર-3 પર બેટિંગ કરશે. આ સિવાય મિડલ ઓર્ડરમાં કેએલ રાહુલ, શ્રેયસ અય્યર, સૂર્યકુમાર યાદવ જેવા ખેલાડીઓ હશે. રવિન્દ્ર જાડેજા ઓલરાઉન્ડર તરીકે રમશે. રવિ અશ્વિનને ટીમ ઈન્ડિયાની પ્લેઈંગ ઈલેવનમાં તક મળી શકે છે. જ્યારે મોહમ્મદ શમી અને જસપ્રિત બુમરાહને પણ સ્થાન મળશે તે નક્કી છે. એવું માનવામાં આવે છે કે મોહમ્મદ સિરાજ પ્રથમ વનડે મેચમાં ટીમ ઇન્ડિયાની પ્લેઇંગ ઇલેવનનો ભાગ નહીં હોય. શું રવિ અશ્વિન અને શ્રેયસ તકનો લાભ ઉઠાવી શકશે? googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); ભારતીય ટીમ મેનેજમેન્ટ અને પ્રશંસકોની નજર શ્રેયસ ઐય્યર અને રવિ અશ્વિન પર રહેશે. વાસ્તવમા શ્રેયસે એશિયા કપમાં વાપસી કરી હતી પરંતુ તે વધુ મેચ રમી શક્યો ન હતો. રવિ અશ્વિન લગભગ 18 મહિના પછી ભારતીય વનડે ટીમમાં વાપસી કરી રહ્યો છે. અક્ષર પટેલની જગ્યાએ રવિ અશ્વિનને ભારતીય ટીમમાં સ્થાન મળ્યું છે. રવિ અશ્વિન માટે ભારત-ઓસ્ટ્રેલિયા વનડે સીરીઝ ઘણી મહત્વની માનવામાં આવે છે. માનવામાં આવી રહ્યું છે કે જો રવિ અશ્વિનનું પ્રદર્શન સારું રહેશે તો આગામી વર્લ્ડ કપ માટે દરવાજા ખુલી શકે છે. ભારતીય ટીમની સંભવિત પ્લેઇંગ 11 ઋતુરાજ ગાયકવાડ, શુભમન ગિલ, ઈશાન કિશન, કેએલ રાહુલ (કેપ્ટન), શ્રેયસ ઐય્યર, સૂર્યકુમાર યાદવ, રવિન્દ્ર જાડેજા, રવિચંદ્રન અશ્વિન, મોહમ્મદ શમી અને જસપ્રીત બુમરાહ. ઓસ્ટ્રેલિયાની સંભવિત પ્લેઇંગ 11 ડેવિડ વોર્નર, મિશેલ માર્શ, સ્ટીવ સ્મિથ, માર્નસ લાબુશેન, એલેક્સ કેરી (વિકેટકીપર), કેમરૂન ગ્રીન, માર્કસ સ્ટોઈનિસ, પેટ કમિન્સ, જોશ હેઝલવુડ, એડમ ઝમ્પા અને તનવીર સંઘા.","pubDate":"2023-09-22 01:02:50","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/09/21/8495ae3eecffb5f16a69801fea2fc6e11695288611469428_original.jpg","source_id":"abplive","source_priority":10959,"country":["india"],"category":["sports"],"language":"gujarati"},{"article_id":"5ba99df61b4e2c6a26122411cd93183b","title":"IPL: દુનિયાની નંબર વન લીગ બનવાની નજીક ઇન્ડિયન પ્રીમિયર લીગ, બ્રાન્ડ વેલ્યૂમાં થયો વધારો","link":"https://gujarati.abplive.com/sports/cricket/indian-premier-league-is-now-valued-at-11-2-billion-after-bcci-s-mammoth-influx-in-media-rights-deal-858522","keywords":["ક્રિકેટ"],"creator":["gujarati.abplive.com"],"video_url":null,"description":"IPL Brand Value: ઇન્ડિયન  પ્રીમિયર લીગની લોકપ્રિયતા સતત વધી રહી છે. હવે IPLની બ્રાન્ડ વેલ્યુમાં લગભગ 6 ટકાનો વધારો થયો છે. આ સાથે IPL વિશ્વની સૌથી મોંઘી ક્રિકેટ લીગ બની ગઈ છે. મીડિયા રિપોર્ટ્સ અનુસાર, IPLની બ્રાન્ડ વેલ્યુમાં 6.3 ટકાનો વધારો થયો છે. વાસ્તવમાં ગયા વર્ષે IPLની બજાર કિંમત 87000 કરોડ રૂપિયા હતી, જે હવે 92500 કરોડ રૂપિયા થઈ ગઈ છે. IPL ટીમોમાં મુંબઈ ઈન્ડિયન્સ ટોપ પર છે અમેરિકાની નેશનલ ફૂટબોલ લીગની બ્રાન્ડ વેલ્યુ 11.2 બિલિયન ડોલર છે. જો આપણે IPL ટીમની વાત કરીએ તો મુંબઈ ઈન્ડિયન્સની બ્રાન્ડ વેલ્યૂ ટોચ પર છે. આ પછી મહેન્દ્ર સિંહ ધોનીની કેપ્ટનશીપ હેઠળની ચેન્નઈ સુપર કિંગ્સ છે. જ્યારે ત્રીજા નંબર પર રોયલ ચેલેન્જર્સ બેંગ્લોર છે. આ વર્ષે મુંબઈ ઈન્ડિયન્સ $410-450 મિલિયન સાથે ટોચ પર છે.      IPL પર પૈસાનો વરસાદ કેવી રીતે થયો? મીડિયા રિપોર્ટ્સ અનુસાર, IPLએ પ્રસારણ રાઇટ્સથી  ઘણો નફો કર્યો છે. આ સિવાય ગુજરાત ટાઇટન્સ અને લખનઉ સુપર જાયન્ટ્સના આવ્યા બાદ IPLનું માર્કેટ વધ્યું છે. લખનઉ સુપર જાયન્ટ્સ ફ્રેન્ચાઇઝી માટે રૂ. 7,090 કરોડ જ્યારે ગુજરાત ટાઇટન્સ ફ્રેન્ચાઇઝી માટે રૂ. 5,625 કરોડ ખર્ચવાના હતા.                        નોંધનીય છે કે બીસીસીઆઈએ આઈપીએલના મીડિયા રાઇટ્સથી  ઘણી કમાણી કરી હતી. BCCIએ ટેલિવિઝન અને ડિજિટલ અધિકારોની હરાજી દ્વારા 48390 કરોડ રૂપિયાની કમાણી કરી હતી. Viacom-18 એ ડિજિટલ રાઇટ્સ 20500 રૂપિયામાં ખરીદ્યા હતા. સ્ટાર સ્પોર્ટ્સ નેટવર્કે આઇપીએલના ટેલિવિઝન રાઇટ્સની હરાજી જીતી લીધી હતી. વાસ્તવમાં આ પહેલીવાર છે જ્યારે ટેલિવિઝન રાઇટ્સ અને IPLના ડિજિટલ રાઇટ્સ માટે અલગ-અલગ બિડ કરવામાં આવી છે.  એક રિપોર્ટ અનુસાર, ભારતીય ક્રિકેટ કંટ્રોલ બોર્ડ ટૂંક સમયમાં IPL 2024નું આયોજન કરવા પર વિચાર કરી રહ્યું છે. આ સાથે આ સિઝન વિદેશમાં પણ થાય તેવી શક્યતા છે. તેનું મુખ્ય કારણ 2024માં યોજાનારી લોકસભાની ચૂંટણી છે. જો કે, હજુ સુધી BCCI તરફથી આ અંગે કોઈ સત્તાવાર માહિતી સામે આવી નથી.  IPL 2024નું આયોજન માર્ચમાં થઈ શકે છે. તેની ફાઈનલ મેચ મેના પહેલા કે બીજા સપ્તાહમાં યોજાઈ શકે છે. પરંતુ અત્યારે સમગ્ર ધ્યાન વર્લ્ડ કપ 2023 પર છે. આ પછી જ કોઈ પણ પ્રકારનો નિર્ણય લેવામાં આવશે. આઇપીએલની  આગામી સીઝન ઝડપથી પૂર્ણ કરવાની સાથે વિદેશમાં પણ તેનું આયોજન થવાની સંભાવના છે","content":"IPL Brand Value: ઇન્ડિયન પ્રીમિયર લીગની લોકપ્રિયતા સતત વધી રહી છે. હવે IPLની બ્રાન્ડ વેલ્યુમાં લગભગ 6 ટકાનો વધારો થયો છે. આ સાથે IPL વિશ્વની સૌથી મોંઘી ક્રિકેટ લીગ બની ગઈ છે. મીડિયા રિપોર્ટ્સ અનુસાર, IPLની બ્રાન્ડ વેલ્યુમાં 6.3 ટકાનો વધારો થયો છે. વાસ્તવમાં ગયા વર્ષે IPLની બજાર કિંમત 87000 કરોડ રૂપિયા હતી, જે હવે 92500 કરોડ રૂપિયા થઈ ગઈ છે. IPL ટીમોમાં મુંબઈ ઈન્ડિયન્સ ટોપ પર છે અમેરિકાની નેશનલ ફૂટબોલ લીગની બ્રાન્ડ વેલ્યુ 11.2 બિલિયન ડોલર છે. જો આપણે IPL ટીમની વાત કરીએ તો મુંબઈ ઈન્ડિયન્સની બ્રાન્ડ વેલ્યૂ ટોચ પર છે. આ પછી મહેન્દ્ર સિંહ ધોનીની કેપ્ટનશીપ હેઠળની ચેન્નઈ સુપર કિંગ્સ છે. જ્યારે ત્રીજા નંબર પર રોયલ ચેલેન્જર્સ બેંગ્લોર છે. આ વર્ષે મુંબઈ ઈન્ડિયન્સ $410-450 મિલિયન સાથે ટોચ પર છે. IPL પર પૈસાનો વરસાદ કેવી રીતે થયો? googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); મીડિયા રિપોર્ટ્સ અનુસાર, IPLએ પ્રસારણ રાઇટ્સથી ઘણો નફો કર્યો છે. આ સિવાય ગુજરાત ટાઇટન્સ અને લખનઉ સુપર જાયન્ટ્સના આવ્યા બાદ IPLનું માર્કેટ વધ્યું છે. લખનઉ સુપર જાયન્ટ્સ ફ્રેન્ચાઇઝી માટે રૂ. 7,090 કરોડ જ્યારે ગુજરાત ટાઇટન્સ ફ્રેન્ચાઇઝી માટે રૂ. 5,625 કરોડ ખર્ચવાના હતા. નોંધનીય છે કે બીસીસીઆઈએ આઈપીએલ ના મીડિયા રાઇટ્સથી ઘણી કમાણી કરી હતી. BCCIએ ટેલિવિઝન અને ડિજિટલ અધિકારોની હરાજી દ્વારા 48390 કરોડ રૂપિયાની કમાણી કરી હતી. Viacom-18 એ ડિજિટલ રાઇટ્સ 20500 રૂપિયામાં ખરીદ્યા હતા. સ્ટાર સ્પોર્ટ્સ નેટવર્કે આઇપીએલના ટેલિવિઝન રાઇટ્સની હરાજી જીતી લીધી હતી. વાસ્તવમાં આ પહેલીવાર છે જ્યારે ટેલિવિઝન રાઇટ્સ અને IPLના ડિજિટલ રાઇટ્સ માટે અલગ-અલગ બિડ કરવામાં આવી છે. એક રિપોર્ટ અનુસાર, ભારતીય ક્રિકેટ કંટ્રોલ બોર્ડ ટૂંક સમયમાં IPL 2024નું આયોજન કરવા પર વિચાર કરી રહ્યું છે. આ સાથે આ સિઝન વિદેશમાં પણ થાય તેવી શક્યતા છે. તેનું મુખ્ય કારણ 2024માં યોજાનારી લોકસભાની ચૂંટણી છે. જો કે, હજુ સુધી BCCI તરફથી આ અંગે કોઈ સત્તાવાર માહિતી સામે આવી નથી. IPL 2024નું આયોજન માર્ચમાં થઈ શકે છે. તેની ફાઈનલ મેચ મેના પહેલા કે બીજા સપ્તાહમાં યોજાઈ શકે છે. પરંતુ અત્યારે સમગ્ર ધ્યાન વર્લ્ડ કપ 2023 પર છે. આ પછી જ કોઈ પણ પ્રકારનો નિર્ણય લેવામાં આવશે. આઇપીએલની આગામી સીઝન ઝડપથી પૂર્ણ કરવાની સાથે વિદેશમાં પણ તેનું આયોજન થવાની સંભાવના છે","pubDate":"2023-09-22 00:50:49","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/09/22/355e60c9732ff051a4e322ae3e9c2aec169534365197374_original.jpg","source_id":"abplive","source_priority":10959,"country":["india"],"category":["sports"],"language":"gujarati"},{"article_id":"63f65d6cbaf56f55bd51319e83c338e7","title":"One-month hiatus ends – domestic cricket commences today","link":"https://www.ft.lk/sports/One-month-hiatus-ends-–-domestic-cricket-commences-today/23-753289","keywords":null,"creator":null,"video_url":null,"description":null,"content":"By Sa’adi Thawfeeq Following a month-long hiatus where all domestic competitions were suspended subsequent to a Sports Ministry intervention, the Major Club League 3-day and the Invitational Club Tier B 3-day (non-first-class) will commence with a card of 16 matches from today. Top of the pile is the match between defending champions CCC and SSC at the CCC grounds. SSC placed third in Group A hold onto a 17-point lead over CCC and will want to consolidate their position if not improve it. CCC with a game in hand will be well placed if they can get the upper hand of SSC. The other game that takes precedence over others is the clash between second placed Bloomfield and third placed Police SC from Group B. Like CCC, Police SC have a game in hand and trail Bloomfield by seven points. A win for Bloomfield will propel them to the top of the table provided that leaders Ace Capital CC fail to derive full points from Kurunegala YCC at Kurunegala. Colts and Ragama CC one-two in Group A have relatively easy games where they will be looking to grab maximum points. Colts aiming to win the title in this their 150th year host seventh placed Army SC, while Ragama CC play eight placed Nugegoda SWC at Thurstan College grounds. NCC too have a chance of improving their position from fourth when they host a struggling Tamil Union outfit who are third from the bottom of the table. Other matches commencing today are the bottom of the Group B table clash between Sebastianites and Air Force SC at De Soysa Stadium, Moratuwa, Galle CC v BRC at Galle Stadium, Negombo CC v Kandy Customs SC at BOI Katunayake, and Chilaw Marians CC v Moors SC at Maggona. Meanwhile, the Invitational Club Tier B will also recommence their matches with a card of six games despite a court ruling hanging over their heads following a protest by Gesto SC over the selection of six clubs from the Governor’s trophy to play in Tier B. These six clubs along with the four demoted clubs from the Major Club League from last season form the 10 clubs playing in Tier B. The court ruled that the tournament can continue until the next hearing which is fixed for 26 September. The matches commencing today are: Navy SC v Saracens SC at Welisara, Kalutara TC v Lankan CC at Aarons Horana, Ambalangoda Singha SC v Malay CC at Army grounds, Karandeniya, Old Dharmapalian SC v Moratuwa SC at Army grounds, Dombagoda, Kandy CC v United Southern SC at Gajaba Saliyapura, and Rio SC v Leo CC at Milleniya.","pubDate":"2023-09-22 00:50:00","image_url":null,"source_id":"ft_lk","source_priority":1390226,"country":["sri lanka"],"category":["sports"],"language":"english"},{"article_id":"5068af053b583914362087f4e35ee1ab","title":"Danushka Gunathilaka case judgment on 28 September","link":"https://www.ft.lk/sports/Danushka-Gunathilaka-case-judgment-on-28-September/23-753288","keywords":null,"creator":null,"video_url":null,"description":null,"content":"Danuska Gunathilaka cries during his police interview An international cricketer pursued a Tinder date “relentlessly” with the night turning out “very differently to what the woman expected or wanted”, while his lawyers have told a court the woman’s evidence is “demonstrably unreliable”.International cricket star Danushka Gunathilaka has stood trial at the Downing Centre District Court for the past four days after pleading not guilty to one charge of sexual assault without consent. The charge relates to an incident on 2 November last year when it is alleged the 32-year-old removed a condom while having sex – known as stealthing – with a woman at her home in Sydney’s east. The pair first met at the Opera Bar near the Sydney Opera House, where CCTV footage shows them embracing, before having drinks together in the city and heading back to the woman’s home via ferry. The judge-alone trial has ended after both sides made their closing arguments on Thursday. Judge Huggett will deliver her judgment on 28 September. – (news.com.au)","pubDate":"2023-09-22 00:30:00","image_url":null,"source_id":"ft_lk","source_priority":1390226,"country":["sri lanka"],"category":["sports"],"language":"english"},{"article_id":"ed68973b290bd3345b8ef13b728c7148","title":"South Africa World Cup cricket blow as Nortje, Magala ruled out","link":"https://www.ft.lk/sports/South-Africa-World-Cup-cricket-blow-as-Nortje--Magala-ruled-out/23-753286","keywords":null,"creator":null,"video_url":null,"description":null,"content":"JOHANNESBURG (AFP): Fast bowlers Anrich Nortje and Sisanda Magala have both been ruled out of the Cricket World Cup because of injury, Cricket South Africa announced on Thursday. They will be replaced by all-rounder Andile Phehlukwayo and fast bowler Lizaad Williams. The loss of Nortje is a particularly heavy blow for South Africa’s chances because of his ability to bowl match-changing spells at high pace. One of the fastest bowlers in the world, capable of speeds of 150 km an hour and more, he was named Cricketer of the Year at CSA’s awards function in July. Nortje had to leave the field because of back spasms after bowling five overs in his only appearance in South Africa’s recent five-match series against Australia. According to a CSA statement he has a suspected lower back stress fracture. It is the second successive World Cup that Nortje will miss because of injury. A broken right thumb ruled him out of the 2019 tournament in England. The heavily-built Magala also played in only one game against Australia and has not fully recovered from a left knee injury.","pubDate":"2023-09-22 00:22:00","image_url":null,"source_id":"ft_lk","source_priority":1390226,"country":["sri lanka"],"category":["sports"],"language":"english"},{"article_id":"554eee48d0c37d6fb038dea7cdd32c30","title":"Wesleyites domiciled in UK donate cricket equipment","link":"https://www.ft.lk/sports/Wesleyites-domiciled-in-UK-donate-cricket-equipment/23-753283","keywords":null,"creator":null,"video_url":null,"description":null,"content":"Dr. Ananda Thevathasan (right) handing over the cricket equipment to Wesley Principal Avanka Fernando, also in the picture is M.T. Swangsa Wesleyites domiciled in the UK donated cricket equipment to the Wesley College Principal Avanka Fernando during a simple ceremony held at the College Hall recently. Dr. Ananda Thevathasan, a past cricket Captain of Wesley now residing in the UK, made the donation on behalf of the rest of the donors. M.T. Swangsa, another past Captain, coordinated the ceremony. OBU President Captain Navin de Silva, former cricketers and Captains and the Present Captain Sanithu Amarasinghe and senior players, along with the coaches, were also present during the ceremony.","pubDate":"2023-09-22 00:05:00","image_url":null,"source_id":"ft_lk","source_priority":1390226,"country":["sri lanka"],"category":["sports"],"language":"english"},{"article_id":"ad27eabc8c171afe72fe3c3e336aa5f1","title":"Alastair Cook wants to bow out of cricket with minimal fuss, ideally with another County Championship with Essex next week... and then head for his farm","link":"https://www.dailymail.co.uk/sport/cricket/article-12547203/Alastair-Cook-want-bow-cricket-minimal-fuss-ideally-County-Championship-Essex-week-head-farm.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"It says everything about Alastair Cook that he has already played on for Essex far longer than he planned when he bade farewell to England with a fairytale century in his last Test.","content":"Alastair Cook wants to bow out of cricket with minimal fuss, ideally with another County Championship with Essex next week... and then head for his farm Alastair Cook is aiming for one last hurrah before bowing quietly out of cricket Aged 38, he is still as fit as ever and one of the best batsmen in the country It has not always been plain sailing but he stands as one of England's true greats By Paul Newman for the Daily Mail Published: 23:43, 21 September 2023 | Updated: 00:49, 22 September 2023 e-mail 1 View comments It says everything about Alastair Cook that he has already played on for Essex far longer than he planned when he bade farewell to England with a fairytale century in his last Test. At that stage, five years ago after those unforgettable scenes against India at the Oval, he envisaged having one or two years giving back to his county before concentrating on the family farm that means so much to him. That he is only now coming to the end of the line, still as fit as ever at 38, is a measure of how much Cook has enjoyed being back in the county rank and file and the enduring quality that sees him still one of the best opening batsmen in the country. It does look certain this is it —even though when MailOnline broke news of Cook’s impending retirement yesterday , Essex released a statement saying the future of one of England’s greatest batsmen would only be decided at the end of the season. In truth, the decision already looks to have been made. Cook wants to bow out, without any fuss, in the not exactly glamorous surroundings of Wantage Road against Northants next week, ideally with another County Championship title under his belt. Alastair Cook wants to bow out of cricket with minimal fuss - ideally with a County Championship under his belt with Essex next week He now wants to concentrate on his family farm which means so much to him Cook with wife Alice Hunt on the farm in January 2011 - the pair have two daughters and a son together For that to happen, Essex still have to upset the odds — a win against Hampshire on Friday coupled with a defeat or draw for Surrey against Northants at the Oval would make for a thrilling final round — but whatever happens Cook has already achieved it all. When he walked off at the Oval in 2018 to the warmest of ovations Cook had become England’s record run-scorer, had made 33 Test centuries, captained England to two Ashes wins and had dominated with the bat in the biggest modern triumph against Australia of them all, under Andrew Strauss in 2010-11. And all in an old-fashioned, almost limited style that would be anathema to today’s Bazball-era England team. He might not even have made the Test side in the first place had he emerged today, but Cook was talented and determined enough to have adapted should he have needed to in order to catch Brendon McCullum’s eye. It has not always been plain-sailing. The worst times of Cook’s career came after England had been thrashed 5-0 in Australia in 2013-14 under his captaincy and he was instrumental in the decision to jettison Kevin Pietersen as the rebuilding process began. For a while it looked certain, with high-profile figures like Shane Warne and Michael Vaughan firmly in Pietersen’s corner, that Cook would quickly follow, particularly after a defeat by Sri Lanka at Headingley that came with pressure on him at its most intense. That he hung on, regained the Ashes in 2015 before handing the captaincy over to Joe Root and then enjoyed a last hurrah back in the ranks, was a tribute to Cook’s stubbornness and sheer determination not to be hounded out by all the noise. One of England's greatest batsman retired from the international game in 2018 but has enjoyed county cricket since then There is no question he could carry on into his 40s at Chelmsford if he wanted to Cook is England's top Test match run scorer of all-time, with the opener scoring 12,472 runs The 38-year-old also won four Ashes series with England during a hugely decorated career He deserved to carry on in 2014 and he throroughly deserved that dream finale four years later when the English cricketing public made it perfectly clear what they thought of him. They told him he was one of the most popular and significant figures in the game. Cook won a Championship with Essex in 2017 but it came when he was mostly away with England and his decision to play on in county cricket, unlike so many top players when they are done with England, was made partly to pursue more domestic honours. They came in 2019 when he dramatically batted Essex to the title against their biggest rivals Somerset at Taunton on the final day of the season and in the Bob Willis Trophy the following Covid-hit year. Another title would be the icing on Cook’s cake. There is no question he could carry on into his 40s at Chelmsford like his mentor Graham Gooch did after his outstanding England career. He looks the same supremely fit figure as when he emerged to make a double century for Essex against Australia in 2005 and then a century on Test debut in India in 2006. But Cook will not want to outstay his welcome, and has a bright future on screen, radio and working hard on his farm. But first there is the small matter of one more Championship title to win. Share or comment on this article: Alastair Cook wants to bow out of cricket with minimal fuss, ideally with another County Championship with Essex next week... and then head for his farm e-mail Add comment Comments 1 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-09-21 23:49:15","image_url":"https://i.dailymail.co.uk/1s/2023/09/22/00/75708273-0-image-a-64_1695337430093.jpg","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"e809a8675e6b1064682fd04740a52872","title":"Maccabi aims to boost girls’ team","link":"https://www.australianjewishnews.com/maccabi-aims-to-boost-girls-team/","keywords":["Cricket","Maccabi AJAX Cricket Club","Sport","Sports","Australia","Greg Hurvitz","Melbourne","Caulfield"],"creator":null,"video_url":null,"description":"Girls aged between six and 14, of all abilities, including beginners, are encouraged to come along to the session.","content":"Having more than 60 players turn up as early as August 27 for the first pre-season training session ahead of the ISEC 2023/24 season – and excellent overall numbers in the weeks since – is a great sign for Maccabi-AJAX Junior Cricket Club (MAJCC). A renewed focus on individual skills assessment and development, plus recently upgraded training facilities, are also playing their part, ahead of the season starting on the second weekend in October. The club’s head of cricket performance, Greg Hurvitz said, “Credit to our very committed coaching group, who have not only called for this approach, but then followed it up by assessing and discussing options as a group. “The players have rocked up, and are giving it a real go.” The club is aiming to field five U11 and U13 boys’ teams, and for the first time in two seasons, three U15 boys’ teams. There are also very solid registrations for the club’s Cricket Blaster programs, for the very youngest of players. New MAJCC president Darren Sacks said, “The energy in our club right now is tremendous, and the positivity and effort is really noticeable. “But two areas we still need more players for, before the season begins, are our U17 boys’ squad and our girls’ cricket team.” To promote the latter, Sacks said the club will host a girls’ cricket ‘Come and Try’ session at Caulfield Park this Sunday (September 24) from 10.30-11.30am. Girls aged between six and 14, of all abilities, including beginners, are encouraged to come along to the session. There will be a friendly, inclusive atmosphere and a sausage sizzle. “The club’s girls’ team is very social and supportive, and just like last season, they will play their games on Wednesday nights, guided by coach Donna Gouldthorp, who has been specially been recruited by the club to advance girls cricket,” Sacks said.","pubDate":"2023-09-21 21:17:54","image_url":"https://static.timesofisrael.com/ajn/uploads/2023/09/girlscricketpromo_73152-1024x640.jpg","source_id":"australianjewishnews","source_priority":511030,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"66e783576a665cb0af7b24d8eaf8c4d9","title":"India Playing XI Predicted: ऑस्ट्रेलिया के खिलाफ पहले वनडे में भारतीय XI को लेकर ऐसा बन रहा समीकरण, 6 खिलाड़ियों को लेकर 'कंफ्यूजन' में टीम इंडिया","link":"https://sports.ndtv.com/hindi/cricket/ind-vs-australia-1st-odi-india-playing-xi-predicted-ashwin-vs-washington-sundar-siraj-vs-shami-ruturaj-gaikwad-vs-ishan-kishan-4412566#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"India Playing XI Predicted: ऑस्ट्रेलिया के खिलाफ पहला वनडे मैच आज होना है. विश्व कप की तैयारी के लिए यह सीरीज दोनों टीमों के लिए काफी अहम होने वाली है.","content":"India Playing XI Predicted, ऑस्ट्रेलिया के खिलाफ भारतीय इलेवन क्या होगी ! विश्व कप से पहले भारतीय टीम ,ऑस्ट्रेलिया के खिलाफ 3 मैचों की वनडे सीरीज (IND vs AUS ODI) खेलने वाली है. सीरीज का पहला मैच आज यानी 22 सितंबर को मोहाली में खेला जाएगा. पहले दो वनडे के लिए कोहली और रोहित जैसे दिग्गजों को रेस्ट दिया गया है. ऐसे में सीरीज के पहले दो वनडे मैचों के लिए केएल राहुल को कप्तानी दी गई है. यानी पहले दो वनडे मैचों की जिम्मेदारी युवा खिलाड़ियों के कंधे पर होगी. वहीं, ऑस्ट्रेलिया के खिलाफ पहले वनडे में भारतीय इलेवन (India Playing XI vs Australia 1st ODI) क्या होगी, इसको लेकर भी बहस तेज हो गई है. दरअसल, वनडे टीम में अश्विन की वापसी हुई है जिसने इस बहस को तेज कर दी है कि उन्हें विश्व कप की टीम में मौका मिल सकता है. ऐसा इसलिए क्योंकि अक्षर पटेल चोटिल हैं. वहीं, वाशिंगटन सुंदर भी कतार में हैं. ऐसे में पहले वनडे में में से जो भी खिलाड़ी प्लेइंग इलेवन का हिस्सा बनता है, उसकी संभावना विश्व कप की टीम में खेलने की बढ़ जाएगी. बता दें कि 28 सितंबर तक टीमें अपने स्क्वॉड में बदलाव कर सकते हैं. ऐसे में आज देखना दिलचस्प होगा कि अश्विन और सुंदर में से किसे प्लेइंग XI में मौका मिलता है. वहीं, पहले वनडे में को शामिल किया जा सकता है. सिराज को आज आराम भी दिया जा सकता है. दरअसल, एशिया कप में सिराज ने कमाल की परफॉर्मेंस किया था. एशिया कप में सिराज को शमी से आगे रखा गया था. ऐसे में आज भी यही उम्मीद है कि सिराज को आराम दिया जाएगा. इसके अलावा जसप्रीत बुमराह को भी आज के मैच में आराम दिया जा सकता है. उनकी जगह प्रसिद्ध कृष्णा को मौका मिल सकता है. दरअसल, विश्व कप अगले महीने ही शुरू होने वाला है. ऐसे में भारतीय टीम अपने अहम खिलाड़ियों को तरोताजा रखने की कोशिश करेगा. आज श्रेयस अय्यर. को मौका मिल सकता है. एशिया कप में अय्यर चोटिल हो गए थे जिसके कारण केएल राहुल को मौका मिला था. राहुल ने वापसी कर शतक जमाकर धमाका कर दिया था. ऐसे में आज पहले वनडे में अय्यर फिट रहे तो यकीनन उन्हें मौका मिलेगा. अय्यर के लिए यह सीरीज खुद को साबित करने वाला होगा. वनडे में सूर्या के परफॉर्मेंस को औसत ही आंका जा रहा है. ऐसे में ऑस्ट्रेलिया का यह नडे सीरीज में सूर्या के लिए किसी मौके से कम नहीं है. सूर्या इस सीरीज में बेहतरीन बल्लेबाजी कर उन आलोचकों को करारा जवाब देना चाहेंगे जो उन्हें वनडे के लिए उपयुक्त नहीं मानते हैं. ऑस्ट्रेलिया के खिलाफ सीरीज में भारत के पास ऋतुराज गायकवाड़ भी हैं. ऐसे में उम्मीद है कि इस युवा क्रिकेटर को ओपनिंग की जिम्मेदारी दी जा सकती है. गायकवाड़ को भारतीय टीम का भविष्य माना जाता है. ऐसे में उम्मीद है कि आज ऑस्ट्रेलिया के खिलाफ इशान किशन या फिर गिल के साथ ओपनिंग की जिम्मेदारी उन्हें दी जा सकती है. इशान किशन/शुभमन गिल/ ऋतुराज गायकवाड़, श्रेयस अय्यर, केएल राहुल (कप्तान), सूर्यकुमार यादव, रविंद्र जडेजा, वॉशिंगटन सुंदर, अश्विन, शार्दुल ठाकुर, मोहम्मद सिराज/मोहम्मद शमी, जसप्रीत बुमराह/प्रसिद्ध कृष्णा केएल राहुल (कप्तान), रविंद्र जडेजा (उप-कप्तान), ऋतुराज गायकवाड़, शुभमन गिल, श्रेयस अय्यर, सूर्यकुमार यादव, तिलक वर्मा, इशान किशन (विकेटकीपर), शार्दुल ठाकुर, वाशिंगटन सुंदर, आर अश्विन ,जसप्रीत बुमराह, मोहम्मद शमी, मोहम्मद सिराज, प्रसिद्ध कृष्णा पढ़ें ,राजनीति,खेल समाचार, और की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-09-22 02:09:02","image_url":"https://c.ndtvimg.com/2022-02/46khcr18_ashwin-odi-afp_625x300_02_February_22.jpg","source_id":"ndtv_in","source_priority":129751,"country":["india"],"category":["sports"],"language":"hindi"},{"article_id":"8ec455281de4ecd17a03423e870ba191","title":"Inside the deal that brought Reynolds - and maybe a premiership - to Brisbane","link":"https://www.smh.com.au/sport/nrl/inside-the-deal-that-brought-reynolds-and-maybe-a-premiership-to-brisbane-20230922-p5e6sq.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Roy Masters"],"video_url":null,"description":"The story of how South Sydney’s grand final-winning playmaker Adam Reynolds came to Brisbane is a touching tale of old-school football loyalties.","content":"Add articles to your saved list and come back to them any time. A friend may well be reckoned the masterpiece of nature, American poet Ralph Waldo Emerson once wrote. The story of how Adam Reynolds came to Brisbane is a touching tale of old-school football loyalties centring on how a former Broncos premiership player, aware what was need to save the coaching career of his mate and Broncos boss Kevin Walters, drove a deal after consulting with two of rugby league’s greatest leaders and confiding in a player manager from a bygone era. Chris Johns and Walters are more than teammates from the Broncos’ 1992-93 premiership years. They were business partners back in 2005, each holding a one-third share in a booming Brisbane car wash business, along with former Australian cricketer, Ian Healy. But Walters’ ambition was always to coach and in 2008 he surrendered his share to Johns’ brother, Cameron. Walters, widely known by his good bloke Kevvy name, accepted assistant coach’s roles with the Broncos (three times), Melbourne and Newcastle, while earlier taking charge of the Ipswich Jets and France’s Catalans in Super League, before being appointed Queensland Origin coach and working for Fox Sports. Yet, as the car wash business grew to five franchises, Walters was punished by the sin of ambition, failing to secure a top NRL position. Johns agonised, calling me, as his former coach at St George, to check on Walters’ progress with the Storm. As president of the Broncos’ past players association, Johns lobbied hard for Walters to be appointed head coach, annoying chair Karl Morris with furious late-night text messages. Anthony Seibold won the job but delivered the Broncos their only wooden spoon . Kevin Walters had long coveted the Broncos’ coaching job he finally landed in 2021. Credit: Getty So, after the longest coaching apprenticeship for a five-time premiership player, Walters finally won the job he always craved. But he didn’t do much better than Seibold in his inaugural season of 2021, coming 14th. Johns has footy smarts, being the Storm’s inaugural CEO as well as a Kangaroo. He was convinced an organising halfback could save his mate’s coaching career. Three potential names had been mentioned – Parramatta’s Mitchell Moses, Cronulla’s Shaun Johnson and South Sydney’s Reynolds – but no one at the Broncos, still a club in turmoil, had seized the initiative to commence negotiations. The tenacious Johns, despite having no formal role at the Broncos, is not one to stay silent. “I said to them, ‘You’ve got to get Reynolds. He’s exactly what we need.’ But they were not convinced.” He threatened to fly to Sydney and sign Reynolds himself, only to be told by Walters, sensitive to club politics, “You can’t do that.” You should be going for Reynolds but it’s not about what I think ... It’s what the players think. They know he will be good for them. Johns called his former Broncos coach Wayne Bennett and asked which of the three halves Brisbane should choose. Bennett, who had coached Reynolds at the Rabbitohs, nominated his former No.7. “But the thing that pushed me hard,” admitted Johns in reference to Melbourne coach Craig Bellamy, “was Bellyache.” According to Johns, Bellamy, said, “You should be going for Reynolds but it’s not about what I think, or what Wayne thinks, or what the board thinks. It’s what the players think. They will know Reynolds will be good for them. They will know he’s the one who can run a game plan.” Reynolds is managed by long-term agent Steve “Chimes” Gillis, universally held in high regard by ex-players, particularly those who have placed their son’s affairs in his care. Old-schoolers noted that when Brett Finch (son of Robert), Jarrod Mullen (son of Steve) and Jack De Belin (grandson of Fred) attended court, Chimes didn’t miss a day and didn’t hide from the cameras. Gillis said, “Johnsie rang me and said he needed a favour. He said he needed to get Kevvy in front of Adam. He knew Adam was the man who could turn the place around. “They came down on a Sunday night and I drove them to Adam’s house at Mascot. They chatted for an hour or so and Kevvy presented Adam with a Broncos jumper. It was old-school stuff. They flew back on a 8.30pm flight. A physio came down to give Adam the once-over and they did the deal only two or three days after the meeting. Kevin Walters, Chris Johns and Ian Healy at their car wash in 2005. Credit: Glenn Hunt “Johnsie was the man who put us all together. He was the one who flicked the switch.” Johns defers credit to Gillis. “I had no authority to sign Reynolds,” he said. “Chimes made it happen. Chimes always does the best for his clients. A few player managers could learn from him.” However, Reynolds’ first year at the Broncos did not deliver success. They were in the top four by round 19, despite Reynolds missing four mid-season matches. The Broncos then lost five of their last six matches with him on the field. But, despite the mounting losses and the “Kevvy can’t coach” cries, he maintained faith with his talented but troubled team. Most coaches would have axed the many youngsters and brought back experienced players to secure a top-eight place. The Broncos finished ninth but the rookies gained experience. Walters also gambled on the future at the end of this season. Guaranteed the minor premiership if they defeated an understrength Melbourne team in the final round, Walters rested almost his entire squad and was beaten , gifting the Panthers the JJ Giltinan trophy . The Broncos, with their top side selected, then humiliated the Storm in the first week of the finals and now meet the Warriors, travelling back across the Tasman to play in front of a parochial Brisbane crowd on Saturday night. Walters and Johns were both part of the Broncos 1990s golden era. Credit: Fairfax Media Walters acknowledges John’s role in securing Reynolds, conceding, “he has always looked out for me.” State loyalty is the only enduring difference between them, with Johns being the first Brisbane-based player selected in a NSW State of Origin team in 1990. “We’ve had our differences over the years,” says Walters, “but the thing I like about him more than anything is his honesty. “Sometimes it can be very brutal. When I was coaching Queensland, he rang me up the morning after we’d just picked the Queensland team. He said, ‘I just want to congratulate you.’ “I said, ‘What for?’ He said, ‘You just picked the worst Queensland team in history.’ “He’s always been honest with me. He hasn’t wavered.” Both men know life is no scripted book. It’s page after page of rocks and diamonds, a volume of success and survival without a back cover to foretell the end. Nor will their football relationship end with a premiership in 2023. “My next challenge is to get Kevvy a halfback to follow Reynolds,” Johns said. Watch the NRL Grand Final Exclusive Live and Free on Channel 9 and 9Now . Sports news, results and expert commentary. Sign up for our Sport newsletter .","pubDate":"2023-09-22 01:45:00","image_url":null,"source_id":"smh","source_priority":6729,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"758b77dfddfeba1e019fc4f81ec55af8","title":"IND Vs AUS Playing 11: ઐય્યર-અશ્વિનની વાપસી પર નજર, ઓસ્ટ્રેલિયા સામેની પ્રથમ વન-ડેમાં આવી હોઇ શકે છે ટીમ ઇન્ડિયાની પ્લેઇંગ 11","link":"https://gujarati.abplive.com/sports/cricket/ind-vs-aus-playing-11-india-vs-australia-1st-odi-chandigarh-pitch-report-weather-forecast-and-other-details-858524","keywords":["ક્રિકેટ"],"creator":["gujarati.abplive.com"],"video_url":null,"description":"IND vs AUS Playing 11: ભારત અને ઓસ્ટ્રેલિયા વચ્ચે 3 વન-ડે મેચની સીરિઝ રમાશે. વર્લ્ડકપ પહેલા ભારત-ઓસ્ટ્રેલિયા સીરિઝ ઘણી મહત્વપૂર્ણ માનવામાં આવે છે. ભારત-ઓસ્ટ્રેલિયા વનડે શ્રેણીની પ્રથમ મેચ આજે મોહાલીમાં રમાશે. શુક્રવારે બંને ટીમો સામસામે ટકરાશે. આ મેચ ભારતીય સમય અનુસાર બપોરે 1.30 વાગ્યે શરૂ થશે. ભારતીય ટીમ તેના નિયમિત કેપ્ટન રોહિત શર્મા સિવાય વિરાટ કોહલી જેવા ખેલાડીઓ વિના રહેશે.                        આવી હોઇ શકે છે ભારતીય ટીમની પ્લેઇંગ 11   ઋતુરાજ ગાયકવાડ અને શુભમન ગિલ ભારત માટે ઓપનર તરીકે જોવા મળી શકે છે. આ પછી ઈશાન કિશન નંબર-3 પર બેટિંગ કરશે. આ સિવાય મિડલ ઓર્ડરમાં કેએલ રાહુલ, શ્રેયસ અય્યર, સૂર્યકુમાર યાદવ જેવા ખેલાડીઓ હશે. રવિન્દ્ર જાડેજા ઓલરાઉન્ડર તરીકે રમશે. રવિ અશ્વિનને ટીમ ઈન્ડિયાની પ્લેઈંગ ઈલેવનમાં તક મળી શકે છે. જ્યારે મોહમ્મદ શમી અને જસપ્રિત બુમરાહને પણ સ્થાન મળશે તે નક્કી છે. એવું માનવામાં આવે છે કે મોહમ્મદ સિરાજ પ્રથમ વનડે મેચમાં ટીમ ઇન્ડિયાની પ્લેઇંગ ઇલેવનનો ભાગ નહીં હોય.               શું રવિ અશ્વિન અને શ્રેયસ તકનો લાભ ઉઠાવી શકશે? ભારતીય ટીમ મેનેજમેન્ટ અને પ્રશંસકોની નજર શ્રેયસ ઐય્યર અને રવિ અશ્વિન પર રહેશે. વાસ્તવમા શ્રેયસે એશિયા કપમાં વાપસી કરી હતી પરંતુ તે વધુ મેચ રમી શક્યો ન હતો. રવિ અશ્વિન લગભગ 18 મહિના પછી ભારતીય વનડે ટીમમાં વાપસી કરી રહ્યો છે. અક્ષર પટેલની જગ્યાએ રવિ અશ્વિનને ભારતીય ટીમમાં સ્થાન મળ્યું છે. રવિ અશ્વિન માટે ભારત-ઓસ્ટ્રેલિયા વનડે સીરીઝ ઘણી મહત્વની માનવામાં આવે છે. માનવામાં આવી રહ્યું છે કે જો રવિ અશ્વિનનું પ્રદર્શન સારું રહેશે તો આગામી વર્લ્ડ કપ માટે દરવાજા ખુલી શકે છે. ભારતીય ટીમની સંભવિત પ્લેઇંગ 11 ઋતુરાજ ગાયકવાડ, શુભમન ગિલ, ઈશાન કિશન, કેએલ રાહુલ (કેપ્ટન), શ્રેયસ ઐય્યર, સૂર્યકુમાર યાદવ, રવિન્દ્ર જાડેજા, રવિચંદ્રન અશ્વિન, મોહમ્મદ શમી અને જસપ્રીત બુમરાહ. ઓસ્ટ્રેલિયાની સંભવિત પ્લેઇંગ 11 ડેવિડ વોર્નર, મિશેલ માર્શ, સ્ટીવ સ્મિથ, માર્નસ લાબુશેન, એલેક્સ કેરી (વિકેટકીપર), કેમરૂન ગ્રીન, માર્કસ સ્ટોઈનિસ, પેટ કમિન્સ, જોશ હેઝલવુડ, એડમ ઝમ્પા અને તનવીર સંઘા.","content":"IND vs AUS Playing 11: ભારત અને ઓસ્ટ્રેલિયા વચ્ચે 3 વન-ડે મેચની સીરિઝ રમાશે. વર્લ્ડકપ પહેલા ભારત-ઓસ્ટ્રેલિયા સીરિઝ ઘણી મહત્વપૂર્ણ માનવામાં આવે છે. ભારત-ઓસ્ટ્રેલિયા વનડે શ્રેણીની પ્રથમ મેચ આજે મોહાલીમાં રમાશે. શુક્રવારે બંને ટીમો સામસામે ટકરાશે. આ મેચ ભારતીય સમય અનુસાર બપોરે 1.30 વાગ્યે શરૂ થશે. ભારતીય ટીમ તેના નિયમિત કેપ્ટન રોહિત શર્મા સિવાય વિરાટ કોહલી જેવા ખેલાડીઓ વિના રહેશે. આવી હોઇ શકે છે ભારતીય ટીમની પ્લેઇંગ 11 ઋતુરાજ ગાયકવાડ અને શુભમન ગિલ ભારત માટે ઓપનર તરીકે જોવા મળી શકે છે. આ પછી ઈશાન કિશન નંબર-3 પર બેટિંગ કરશે. આ સિવાય મિડલ ઓર્ડરમાં કેએલ રાહુલ, શ્રેયસ અય્યર, સૂર્યકુમાર યાદવ જેવા ખેલાડીઓ હશે. રવિન્દ્ર જાડેજા ઓલરાઉન્ડર તરીકે રમશે. રવિ અશ્વિનને ટીમ ઈન્ડિયાની પ્લેઈંગ ઈલેવનમાં તક મળી શકે છે. જ્યારે મોહમ્મદ શમી અને જસપ્રિત બુમરાહને પણ સ્થાન મળશે તે નક્કી છે. એવું માનવામાં આવે છે કે મોહમ્મદ સિરાજ પ્રથમ વનડે મેચમાં ટીમ ઇન્ડિયાની પ્લેઇંગ ઇલેવનનો ભાગ નહીં હોય. શું રવિ અશ્વિન અને શ્રેયસ તકનો લાભ ઉઠાવી શકશે? googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); ભારતીય ટીમ મેનેજમેન્ટ અને પ્રશંસકોની નજર શ્રેયસ ઐય્યર અને રવિ અશ્વિન પર રહેશે. વાસ્તવમા શ્રેયસે એશિયા કપમાં વાપસી કરી હતી પરંતુ તે વધુ મેચ રમી શક્યો ન હતો. રવિ અશ્વિન લગભગ 18 મહિના પછી ભારતીય વનડે ટીમમાં વાપસી કરી રહ્યો છે. અક્ષર પટેલની જગ્યાએ રવિ અશ્વિનને ભારતીય ટીમમાં સ્થાન મળ્યું છે. રવિ અશ્વિન માટે ભારત-ઓસ્ટ્રેલિયા વનડે સીરીઝ ઘણી મહત્વની માનવામાં આવે છે. માનવામાં આવી રહ્યું છે કે જો રવિ અશ્વિનનું પ્રદર્શન સારું રહેશે તો આગામી વર્લ્ડ કપ માટે દરવાજા ખુલી શકે છે. ભારતીય ટીમની સંભવિત પ્લેઇંગ 11 ઋતુરાજ ગાયકવાડ, શુભમન ગિલ, ઈશાન કિશન, કેએલ રાહુલ (કેપ્ટન), શ્રેયસ ઐય્યર, સૂર્યકુમાર યાદવ, રવિન્દ્ર જાડેજા, રવિચંદ્રન અશ્વિન, મોહમ્મદ શમી અને જસપ્રીત બુમરાહ. ઓસ્ટ્રેલિયાની સંભવિત પ્લેઇંગ 11 ડેવિડ વોર્નર, મિશેલ માર્શ, સ્ટીવ સ્મિથ, માર્નસ લાબુશેન, એલેક્સ કેરી (વિકેટકીપર), કેમરૂન ગ્રીન, માર્કસ સ્ટોઈનિસ, પેટ કમિન્સ, જોશ હેઝલવુડ, એડમ ઝમ્પા અને તનવીર સંઘા.","pubDate":"2023-09-22 01:02:50","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/09/21/8495ae3eecffb5f16a69801fea2fc6e11695288611469428_original.jpg","source_id":"abplive","source_priority":10959,"country":["india"],"category":["sports"],"language":"gujarati"},{"article_id":"5ba99df61b4e2c6a26122411cd93183b","title":"IPL: દુનિયાની નંબર વન લીગ બનવાની નજીક ઇન્ડિયન પ્રીમિયર લીગ, બ્રાન્ડ વેલ્યૂમાં થયો વધારો","link":"https://gujarati.abplive.com/sports/cricket/indian-premier-league-is-now-valued-at-11-2-billion-after-bcci-s-mammoth-influx-in-media-rights-deal-858522","keywords":["ક્રિકેટ"],"creator":["gujarati.abplive.com"],"video_url":null,"description":"IPL Brand Value: ઇન્ડિયન  પ્રીમિયર લીગની લોકપ્રિયતા સતત વધી રહી છે. હવે IPLની બ્રાન્ડ વેલ્યુમાં લગભગ 6 ટકાનો વધારો થયો છે. આ સાથે IPL વિશ્વની સૌથી મોંઘી ક્રિકેટ લીગ બની ગઈ છે. મીડિયા રિપોર્ટ્સ અનુસાર, IPLની બ્રાન્ડ વેલ્યુમાં 6.3 ટકાનો વધારો થયો છે. વાસ્તવમાં ગયા વર્ષે IPLની બજાર કિંમત 87000 કરોડ રૂપિયા હતી, જે હવે 92500 કરોડ રૂપિયા થઈ ગઈ છે. IPL ટીમોમાં મુંબઈ ઈન્ડિયન્સ ટોપ પર છે અમેરિકાની નેશનલ ફૂટબોલ લીગની બ્રાન્ડ વેલ્યુ 11.2 બિલિયન ડોલર છે. જો આપણે IPL ટીમની વાત કરીએ તો મુંબઈ ઈન્ડિયન્સની બ્રાન્ડ વેલ્યૂ ટોચ પર છે. આ પછી મહેન્દ્ર સિંહ ધોનીની કેપ્ટનશીપ હેઠળની ચેન્નઈ સુપર કિંગ્સ છે. જ્યારે ત્રીજા નંબર પર રોયલ ચેલેન્જર્સ બેંગ્લોર છે. આ વર્ષે મુંબઈ ઈન્ડિયન્સ $410-450 મિલિયન સાથે ટોચ પર છે.      IPL પર પૈસાનો વરસાદ કેવી રીતે થયો? મીડિયા રિપોર્ટ્સ અનુસાર, IPLએ પ્રસારણ રાઇટ્સથી  ઘણો નફો કર્યો છે. આ સિવાય ગુજરાત ટાઇટન્સ અને લખનઉ સુપર જાયન્ટ્સના આવ્યા બાદ IPLનું માર્કેટ વધ્યું છે. લખનઉ સુપર જાયન્ટ્સ ફ્રેન્ચાઇઝી માટે રૂ. 7,090 કરોડ જ્યારે ગુજરાત ટાઇટન્સ ફ્રેન્ચાઇઝી માટે રૂ. 5,625 કરોડ ખર્ચવાના હતા.                        નોંધનીય છે કે બીસીસીઆઈએ આઈપીએલના મીડિયા રાઇટ્સથી  ઘણી કમાણી કરી હતી. BCCIએ ટેલિવિઝન અને ડિજિટલ અધિકારોની હરાજી દ્વારા 48390 કરોડ રૂપિયાની કમાણી કરી હતી. Viacom-18 એ ડિજિટલ રાઇટ્સ 20500 રૂપિયામાં ખરીદ્યા હતા. સ્ટાર સ્પોર્ટ્સ નેટવર્કે આઇપીએલના ટેલિવિઝન રાઇટ્સની હરાજી જીતી લીધી હતી. વાસ્તવમાં આ પહેલીવાર છે જ્યારે ટેલિવિઝન રાઇટ્સ અને IPLના ડિજિટલ રાઇટ્સ માટે અલગ-અલગ બિડ કરવામાં આવી છે.  એક રિપોર્ટ અનુસાર, ભારતીય ક્રિકેટ કંટ્રોલ બોર્ડ ટૂંક સમયમાં IPL 2024નું આયોજન કરવા પર વિચાર કરી રહ્યું છે. આ સાથે આ સિઝન વિદેશમાં પણ થાય તેવી શક્યતા છે. તેનું મુખ્ય કારણ 2024માં યોજાનારી લોકસભાની ચૂંટણી છે. જો કે, હજુ સુધી BCCI તરફથી આ અંગે કોઈ સત્તાવાર માહિતી સામે આવી નથી.  IPL 2024નું આયોજન માર્ચમાં થઈ શકે છે. તેની ફાઈનલ મેચ મેના પહેલા કે બીજા સપ્તાહમાં યોજાઈ શકે છે. પરંતુ અત્યારે સમગ્ર ધ્યાન વર્લ્ડ કપ 2023 પર છે. આ પછી જ કોઈ પણ પ્રકારનો નિર્ણય લેવામાં આવશે. આઇપીએલની  આગામી સીઝન ઝડપથી પૂર્ણ કરવાની સાથે વિદેશમાં પણ તેનું આયોજન થવાની સંભાવના છે","content":"IPL Brand Value: ઇન્ડિયન પ્રીમિયર લીગની લોકપ્રિયતા સતત વધી રહી છે. હવે IPLની બ્રાન્ડ વેલ્યુમાં લગભગ 6 ટકાનો વધારો થયો છે. આ સાથે IPL વિશ્વની સૌથી મોંઘી ક્રિકેટ લીગ બની ગઈ છે. મીડિયા રિપોર્ટ્સ અનુસાર, IPLની બ્રાન્ડ વેલ્યુમાં 6.3 ટકાનો વધારો થયો છે. વાસ્તવમાં ગયા વર્ષે IPLની બજાર કિંમત 87000 કરોડ રૂપિયા હતી, જે હવે 92500 કરોડ રૂપિયા થઈ ગઈ છે. IPL ટીમોમાં મુંબઈ ઈન્ડિયન્સ ટોપ પર છે અમેરિકાની નેશનલ ફૂટબોલ લીગની બ્રાન્ડ વેલ્યુ 11.2 બિલિયન ડોલર છે. જો આપણે IPL ટીમની વાત કરીએ તો મુંબઈ ઈન્ડિયન્સની બ્રાન્ડ વેલ્યૂ ટોચ પર છે. આ પછી મહેન્દ્ર સિંહ ધોનીની કેપ્ટનશીપ હેઠળની ચેન્નઈ સુપર કિંગ્સ છે. જ્યારે ત્રીજા નંબર પર રોયલ ચેલેન્જર્સ બેંગ્લોર છે. આ વર્ષે મુંબઈ ઈન્ડિયન્સ $410-450 મિલિયન સાથે ટોચ પર છે. IPL પર પૈસાનો વરસાદ કેવી રીતે થયો? googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); મીડિયા રિપોર્ટ્સ અનુસાર, IPLએ પ્રસારણ રાઇટ્સથી ઘણો નફો કર્યો છે. આ સિવાય ગુજરાત ટાઇટન્સ અને લખનઉ સુપર જાયન્ટ્સના આવ્યા બાદ IPLનું માર્કેટ વધ્યું છે. લખનઉ સુપર જાયન્ટ્સ ફ્રેન્ચાઇઝી માટે રૂ. 7,090 કરોડ જ્યારે ગુજરાત ટાઇટન્સ ફ્રેન્ચાઇઝી માટે રૂ. 5,625 કરોડ ખર્ચવાના હતા. નોંધનીય છે કે બીસીસીઆઈએ આઈપીએલ ના મીડિયા રાઇટ્સથી ઘણી કમાણી કરી હતી. BCCIએ ટેલિવિઝન અને ડિજિટલ અધિકારોની હરાજી દ્વારા 48390 કરોડ રૂપિયાની કમાણી કરી હતી. Viacom-18 એ ડિજિટલ રાઇટ્સ 20500 રૂપિયામાં ખરીદ્યા હતા. સ્ટાર સ્પોર્ટ્સ નેટવર્કે આઇપીએલના ટેલિવિઝન રાઇટ્સની હરાજી જીતી લીધી હતી. વાસ્તવમાં આ પહેલીવાર છે જ્યારે ટેલિવિઝન રાઇટ્સ અને IPLના ડિજિટલ રાઇટ્સ માટે અલગ-અલગ બિડ કરવામાં આવી છે. એક રિપોર્ટ અનુસાર, ભારતીય ક્રિકેટ કંટ્રોલ બોર્ડ ટૂંક સમયમાં IPL 2024નું આયોજન કરવા પર વિચાર કરી રહ્યું છે. આ સાથે આ સિઝન વિદેશમાં પણ થાય તેવી શક્યતા છે. તેનું મુખ્ય કારણ 2024માં યોજાનારી લોકસભાની ચૂંટણી છે. જો કે, હજુ સુધી BCCI તરફથી આ અંગે કોઈ સત્તાવાર માહિતી સામે આવી નથી. IPL 2024નું આયોજન માર્ચમાં થઈ શકે છે. તેની ફાઈનલ મેચ મેના પહેલા કે બીજા સપ્તાહમાં યોજાઈ શકે છે. પરંતુ અત્યારે સમગ્ર ધ્યાન વર્લ્ડ કપ 2023 પર છે. આ પછી જ કોઈ પણ પ્રકારનો નિર્ણય લેવામાં આવશે. આઇપીએલની આગામી સીઝન ઝડપથી પૂર્ણ કરવાની સાથે વિદેશમાં પણ તેનું આયોજન થવાની સંભાવના છે","pubDate":"2023-09-22 00:50:49","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/09/22/355e60c9732ff051a4e322ae3e9c2aec169534365197374_original.jpg","source_id":"abplive","source_priority":10959,"country":["india"],"category":["sports"],"language":"gujarati"},{"article_id":"63f65d6cbaf56f55bd51319e83c338e7","title":"One-month hiatus ends – domestic cricket commences today","link":"https://www.ft.lk/sports/One-month-hiatus-ends-–-domestic-cricket-commences-today/23-753289","keywords":null,"creator":null,"video_url":null,"description":null,"content":"By Sa’adi Thawfeeq Following a month-long hiatus where all domestic competitions were suspended subsequent to a Sports Ministry intervention, the Major Club League 3-day and the Invitational Club Tier B 3-day (non-first-class) will commence with a card of 16 matches from today. Top of the pile is the match between defending champions CCC and SSC at the CCC grounds. SSC placed third in Group A hold onto a 17-point lead over CCC and will want to consolidate their position if not improve it. CCC with a game in hand will be well placed if they can get the upper hand of SSC. The other game that takes precedence over others is the clash between second placed Bloomfield and third placed Police SC from Group B. Like CCC, Police SC have a game in hand and trail Bloomfield by seven points. A win for Bloomfield will propel them to the top of the table provided that leaders Ace Capital CC fail to derive full points from Kurunegala YCC at Kurunegala. Colts and Ragama CC one-two in Group A have relatively easy games where they will be looking to grab maximum points. Colts aiming to win the title in this their 150th year host seventh placed Army SC, while Ragama CC play eight placed Nugegoda SWC at Thurstan College grounds. NCC too have a chance of improving their position from fourth when they host a struggling Tamil Union outfit who are third from the bottom of the table. Other matches commencing today are the bottom of the Group B table clash between Sebastianites and Air Force SC at De Soysa Stadium, Moratuwa, Galle CC v BRC at Galle Stadium, Negombo CC v Kandy Customs SC at BOI Katunayake, and Chilaw Marians CC v Moors SC at Maggona. Meanwhile, the Invitational Club Tier B will also recommence their matches with a card of six games despite a court ruling hanging over their heads following a protest by Gesto SC over the selection of six clubs from the Governor’s trophy to play in Tier B. These six clubs along with the four demoted clubs from the Major Club League from last season form the 10 clubs playing in Tier B. The court ruled that the tournament can continue until the next hearing which is fixed for 26 September. The matches commencing today are: Navy SC v Saracens SC at Welisara, Kalutara TC v Lankan CC at Aarons Horana, Ambalangoda Singha SC v Malay CC at Army grounds, Karandeniya, Old Dharmapalian SC v Moratuwa SC at Army grounds, Dombagoda, Kandy CC v United Southern SC at Gajaba Saliyapura, and Rio SC v Leo CC at Milleniya.","pubDate":"2023-09-22 00:50:00","image_url":null,"source_id":"ft_lk","source_priority":1390226,"country":["sri lanka"],"category":["sports"],"language":"english"},{"article_id":"5068af053b583914362087f4e35ee1ab","title":"Danushka Gunathilaka case judgment on 28 September","link":"https://www.ft.lk/sports/Danushka-Gunathilaka-case-judgment-on-28-September/23-753288","keywords":null,"creator":null,"video_url":null,"description":null,"content":"Danuska Gunathilaka cries during his police interview An international cricketer pursued a Tinder date “relentlessly” with the night turning out “very differently to what the woman expected or wanted”, while his lawyers have told a court the woman’s evidence is “demonstrably unreliable”.International cricket star Danushka Gunathilaka has stood trial at the Downing Centre District Court for the past four days after pleading not guilty to one charge of sexual assault without consent. The charge relates to an incident on 2 November last year when it is alleged the 32-year-old removed a condom while having sex – known as stealthing – with a woman at her home in Sydney’s east. The pair first met at the Opera Bar near the Sydney Opera House, where CCTV footage shows them embracing, before having drinks together in the city and heading back to the woman’s home via ferry. The judge-alone trial has ended after both sides made their closing arguments on Thursday. Judge Huggett will deliver her judgment on 28 September. – (news.com.au)","pubDate":"2023-09-22 00:30:00","image_url":null,"source_id":"ft_lk","source_priority":1390226,"country":["sri lanka"],"category":["sports"],"language":"english"},{"article_id":"ed68973b290bd3345b8ef13b728c7148","title":"South Africa World Cup cricket blow as Nortje, Magala ruled out","link":"https://www.ft.lk/sports/South-Africa-World-Cup-cricket-blow-as-Nortje--Magala-ruled-out/23-753286","keywords":null,"creator":null,"video_url":null,"description":null,"content":"JOHANNESBURG (AFP): Fast bowlers Anrich Nortje and Sisanda Magala have both been ruled out of the Cricket World Cup because of injury, Cricket South Africa announced on Thursday. They will be replaced by all-rounder Andile Phehlukwayo and fast bowler Lizaad Williams. The loss of Nortje is a particularly heavy blow for South Africa’s chances because of his ability to bowl match-changing spells at high pace. One of the fastest bowlers in the world, capable of speeds of 150 km an hour and more, he was named Cricketer of the Year at CSA’s awards function in July. Nortje had to leave the field because of back spasms after bowling five overs in his only appearance in South Africa’s recent five-match series against Australia. According to a CSA statement he has a suspected lower back stress fracture. It is the second successive World Cup that Nortje will miss because of injury. A broken right thumb ruled him out of the 2019 tournament in England. The heavily-built Magala also played in only one game against Australia and has not fully recovered from a left knee injury.","pubDate":"2023-09-22 00:22:00","image_url":null,"source_id":"ft_lk","source_priority":1390226,"country":["sri lanka"],"category":["sports"],"language":"english"},{"article_id":"554eee48d0c37d6fb038dea7cdd32c30","title":"Wesleyites domiciled in UK donate cricket equipment","link":"https://www.ft.lk/sports/Wesleyites-domiciled-in-UK-donate-cricket-equipment/23-753283","keywords":null,"creator":null,"video_url":null,"description":null,"content":"Dr. Ananda Thevathasan (right) handing over the cricket equipment to Wesley Principal Avanka Fernando, also in the picture is M.T. Swangsa Wesleyites domiciled in the UK donated cricket equipment to the Wesley College Principal Avanka Fernando during a simple ceremony held at the College Hall recently. Dr. Ananda Thevathasan, a past cricket Captain of Wesley now residing in the UK, made the donation on behalf of the rest of the donors. M.T. Swangsa, another past Captain, coordinated the ceremony. OBU President Captain Navin de Silva, former cricketers and Captains and the Present Captain Sanithu Amarasinghe and senior players, along with the coaches, were also present during the ceremony.","pubDate":"2023-09-22 00:05:00","image_url":null,"source_id":"ft_lk","source_priority":1390226,"country":["sri lanka"],"category":["sports"],"language":"english"},{"article_id":"ad27eabc8c171afe72fe3c3e336aa5f1","title":"Alastair Cook wants to bow out of cricket with minimal fuss, ideally with another County Championship with Essex next week... and then head for his farm","link":"https://www.dailymail.co.uk/sport/cricket/article-12547203/Alastair-Cook-want-bow-cricket-minimal-fuss-ideally-County-Championship-Essex-week-head-farm.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"It says everything about Alastair Cook that he has already played on for Essex far longer than he planned when he bade farewell to England with a fairytale century in his last Test.","content":"Alastair Cook wants to bow out of cricket with minimal fuss, ideally with another County Championship with Essex next week... and then head for his farm Alastair Cook is aiming for one last hurrah before bowing quietly out of cricket Aged 38, he is still as fit as ever and one of the best batsmen in the country It has not always been plain sailing but he stands as one of England's true greats By Paul Newman for the Daily Mail Published: 23:43, 21 September 2023 | Updated: 00:49, 22 September 2023 e-mail 1 View comments It says everything about Alastair Cook that he has already played on for Essex far longer than he planned when he bade farewell to England with a fairytale century in his last Test. At that stage, five years ago after those unforgettable scenes against India at the Oval, he envisaged having one or two years giving back to his county before concentrating on the family farm that means so much to him. That he is only now coming to the end of the line, still as fit as ever at 38, is a measure of how much Cook has enjoyed being back in the county rank and file and the enduring quality that sees him still one of the best opening batsmen in the country. It does look certain this is it —even though when MailOnline broke news of Cook’s impending retirement yesterday , Essex released a statement saying the future of one of England’s greatest batsmen would only be decided at the end of the season. In truth, the decision already looks to have been made. Cook wants to bow out, without any fuss, in the not exactly glamorous surroundings of Wantage Road against Northants next week, ideally with another County Championship title under his belt. Alastair Cook wants to bow out of cricket with minimal fuss - ideally with a County Championship under his belt with Essex next week He now wants to concentrate on his family farm which means so much to him Cook with wife Alice Hunt on the farm in January 2011 - the pair have two daughters and a son together For that to happen, Essex still have to upset the odds — a win against Hampshire on Friday coupled with a defeat or draw for Surrey against Northants at the Oval would make for a thrilling final round — but whatever happens Cook has already achieved it all. When he walked off at the Oval in 2018 to the warmest of ovations Cook had become England’s record run-scorer, had made 33 Test centuries, captained England to two Ashes wins and had dominated with the bat in the biggest modern triumph against Australia of them all, under Andrew Strauss in 2010-11. And all in an old-fashioned, almost limited style that would be anathema to today’s Bazball-era England team. He might not even have made the Test side in the first place had he emerged today, but Cook was talented and determined enough to have adapted should he have needed to in order to catch Brendon McCullum’s eye. It has not always been plain-sailing. The worst times of Cook’s career came after England had been thrashed 5-0 in Australia in 2013-14 under his captaincy and he was instrumental in the decision to jettison Kevin Pietersen as the rebuilding process began. For a while it looked certain, with high-profile figures like Shane Warne and Michael Vaughan firmly in Pietersen’s corner, that Cook would quickly follow, particularly after a defeat by Sri Lanka at Headingley that came with pressure on him at its most intense. That he hung on, regained the Ashes in 2015 before handing the captaincy over to Joe Root and then enjoyed a last hurrah back in the ranks, was a tribute to Cook’s stubbornness and sheer determination not to be hounded out by all the noise. One of England's greatest batsman retired from the international game in 2018 but has enjoyed county cricket since then There is no question he could carry on into his 40s at Chelmsford if he wanted to Cook is England's top Test match run scorer of all-time, with the opener scoring 12,472 runs The 38-year-old also won four Ashes series with England during a hugely decorated career He deserved to carry on in 2014 and he throroughly deserved that dream finale four years later when the English cricketing public made it perfectly clear what they thought of him. They told him he was one of the most popular and significant figures in the game. Cook won a Championship with Essex in 2017 but it came when he was mostly away with England and his decision to play on in county cricket, unlike so many top players when they are done with England, was made partly to pursue more domestic honours. They came in 2019 when he dramatically batted Essex to the title against their biggest rivals Somerset at Taunton on the final day of the season and in the Bob Willis Trophy the following Covid-hit year. Another title would be the icing on Cook’s cake. There is no question he could carry on into his 40s at Chelmsford like his mentor Graham Gooch did after his outstanding England career. He looks the same supremely fit figure as when he emerged to make a double century for Essex against Australia in 2005 and then a century on Test debut in India in 2006. But Cook will not want to outstay his welcome, and has a bright future on screen, radio and working hard on his farm. But first there is the small matter of one more Championship title to win. Share or comment on this article: Alastair Cook wants to bow out of cricket with minimal fuss, ideally with another County Championship with Essex next week... and then head for his farm e-mail Add comment Comments 1 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-09-21 23:49:15","image_url":"https://i.dailymail.co.uk/1s/2023/09/22/00/75708273-0-image-a-64_1695337430093.jpg","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"e809a8675e6b1064682fd04740a52872","title":"Maccabi aims to boost girls’ team","link":"https://www.australianjewishnews.com/maccabi-aims-to-boost-girls-team/","keywords":["Cricket","Maccabi AJAX Cricket Club","Sport","Sports","Australia","Greg Hurvitz","Melbourne","Caulfield"],"creator":null,"video_url":null,"description":"Girls aged between six and 14, of all abilities, including beginners, are encouraged to come along to the session.","content":"Having more than 60 players turn up as early as August 27 for the first pre-season training session ahead of the ISEC 2023/24 season – and excellent overall numbers in the weeks since – is a great sign for Maccabi-AJAX Junior Cricket Club (MAJCC). A renewed focus on individual skills assessment and development, plus recently upgraded training facilities, are also playing their part, ahead of the season starting on the second weekend in October. The club’s head of cricket performance, Greg Hurvitz said, “Credit to our very committed coaching group, who have not only called for this approach, but then followed it up by assessing and discussing options as a group. “The players have rocked up, and are giving it a real go.” The club is aiming to field five U11 and U13 boys’ teams, and for the first time in two seasons, three U15 boys’ teams. There are also very solid registrations for the club’s Cricket Blaster programs, for the very youngest of players. New MAJCC president Darren Sacks said, “The energy in our club right now is tremendous, and the positivity and effort is really noticeable. “But two areas we still need more players for, before the season begins, are our U17 boys’ squad and our girls’ cricket team.” To promote the latter, Sacks said the club will host a girls’ cricket ‘Come and Try’ session at Caulfield Park this Sunday (September 24) from 10.30-11.30am. Girls aged between six and 14, of all abilities, including beginners, are encouraged to come along to the session. There will be a friendly, inclusive atmosphere and a sausage sizzle. “The club’s girls’ team is very social and supportive, and just like last season, they will play their games on Wednesday nights, guided by coach Donna Gouldthorp, who has been specially been recruited by the club to advance girls cricket,” Sacks said.","pubDate":"2023-09-21 21:17:54","image_url":"https://static.timesofisrael.com/ajn/uploads/2023/09/girlscricketpromo_73152-1024x640.jpg","source_id":"australianjewishnews","source_priority":511030,"country":["australia"],"category":["sports"],"language":"english"}]}