{"newsArray":[{"title":"IND W vs PAK W Live Score: Mithali led India eye clinical start to CWC 2022","link":"https://www.business-standard.com/article/sports/ind-w-vs-pak-w-live-score-mithali-led-india-eye-clinical-start-to-cwc-2022-122030600044_1.html","keywords":null,"creator":null,"video_url":null,"description":"India Women vs Pakistan Women Live Updates: Mithali Raj led India will be up against Bismah Maroof led Pakistan in the first match of the ICC Women's Cricket World Cup 2022 for both the teams","content":null,"pubDate":"2022-03-06 00:10:00","full_description":"India women's cricket team during a World Cup Warm-Up match. Photo: @BCCI IND W vs PAK W Live : The India Women's cricket team will take on Pakistan Women's cricket team to kick off their campaign in the ICC Women's Cricket World Cup at Bay Oval, Mount Maunganui in Tauranga, New Zealand. This will be the fourth game of the tournament that has already seen two last over finishes. It will also be the first match for the Pakistan team in this World Cup. IND W vs PAK W Toss: India Women's captain Mithali Raj won the toss against Pakistan Women's captain Bismah Marof. The Toss in today's match took place at 1330 hrs Local time which would be at 06:00 am IST. India Women Playing 11: Smriti Mandhana, Shafali Verma, Deepti Sharma, Harmanpreet Kaur, Mithali Raj, Richa Ghosh, Sneh Rana, Jhulan Goswami, Meghna Singh, Pooja Vastrakar, Rajeshwari Gayakwad Pakistan Women Playing 11: Javeria Khan, Sidra Ameen, Bismah Maroof, Omaima, Nida Dar, Aliya Riaz, Fatima Sana, Sidra Nawaz. Diana Baig, Nashra Sandhu, Anam Amin India Women vs Pakistan Women Today's match Pitch Report The India Women vs Pakistan Women match will be played at the same venue where the first game of the tournament was played between New Zealand Women and West Indies Women i.e. Bay Oval, Mount Maunganui. The pitch there assisted spin bowlers as Hayley Matthews and Anisa Mohammed of West Indies were able to find purchase off the surface. On the whole, it is a true wicket and the ball comes nicely to the bat, giving full opportunity for batters to score big. Today's Weather Report of Bay Oval, Mount Maunganui, Tauranga Today's weather at Bay Oval, Mount Maunganui, situated in Tauranga, will be pleasant when the match begins at 02:00 pm Local time and 06:30 pm IST. The temperatures would hover between 23 Degree Celsius and 20 Degree Celcius throughout the game. There will be more than 40% cloud cover but there are no chances of rain. Catch all the Live Updates from this India Women vs Pakistan Women World Cup 2022 match here CATCH ALL THE LIVE UPDATES Auto Refresh Load More Read our full coverage on Women Cricket World Cup Read More On Mithali Raj Women Cricket World Cup Women Cricket India India Vs Pakistan Jhulan Goswami Harmanpreet Kaur","image_url":"https://bsmedia.business-standard.com/_media/bs/img/article/default/1220306/thumb-122030600044.jpg","source_id":"business-standard","country":["india"],"category":["sports"],"language":"english"},{"title":"Shane Warne: Manager James Erskine says cricket great’s children in ‘complete shock’ at father’s death","link":"https://thewest.com.au/sport/shane-warne-manager-james-erskine-says-cricket-greats-children-in-complete-shock-at-fathers-death-c-5949419","keywords":null,"creator":["News Corp Australia"],"video_url":null,"description":"Cricket great Shane Warne’s kids say their father’s sudden death in Thailand was like a ‘bad dream’ as they come to terms with their tragic loss.","content":null,"pubDate":"2022-03-06 00:09:51","full_description":null,"image_url":"https://images.thewest.com.au/publication/C-5949419/1957c9b46aa271e4cf48f864b6aebd2078414ae1-16x9-x0y64w2048h1152.jpg","source_id":"thewest","country":["australia"],"category":["sports"],"language":"english"},{"title":"‘Bad dream’: Warnie’s kids in ‘complete shock’","link":"https://www.cairnspost.com.au/sport/cricket/shane-warnes-manager-james-erskine-says-cricket-greats-kids-in-complete-shock-at-fathers-death/news-story/613de3df2dd871502b0d6bf54bbfe662","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Shane Warne’s children are in ‘complete shock’ at the Australian cricket great’s passing, describing the sudden death as a ‘bad dream’.","content":null,"pubDate":"2022-03-05 23:35:00","full_description":null,"image_url":null,"source_id":"cairnspost","country":["australia"],"category":["sports"],"language":"english"},{"title":"How Warne’s ex-wife, kids reacted to death","link":"https://www.cairnspost.com.au/sport/cricket/shane-warnes-wife-really-upset-kids-in-shock-over-tragic-death/news-story/df12a16d39495bda9f1b14cfe37a81fa","keywords":["Cricket news and galleries","Sport news and galleries"],"creator":null,"video_url":null,"description":"Shane Warne’s long-time manager has revealed how the cricket legend’s family reacted to news of his death as the world comes to terms with the tragedy.","content":null,"pubDate":"2022-03-05 23:34:00","full_description":null,"image_url":null,"source_id":"cairnspost","country":["australia"],"category":["sports"],"language":"english"},{"title":"How Warne’s ex-wife, kids reacted to death","link":"https://www.news.com.au/sport/cricket/shane-warnes-wife-really-upset-kids-in-shock-over-tragic-death/news-story/df12a16d39495bda9f1b14cfe37a81fa","keywords":null,"creator":null,"video_url":null,"description":"Shane Warne’s long-time manager has revealed how the cricket legend’s family reacted to news of his death as the world comes to terms with the tragedy.","content":null,"pubDate":"2022-03-05 23:25:00","full_description":"Shane Warne’s long-time manager has revealed how the cricket legend’s family reacted to news of his death as the world comes to terms with the tragedy. James Erskine had earlier revealed details about Warne’s final moments and on Sunday explained how Warne’s nearest and dearest took the news of his passing from a suspected heart attack in Thailand. Erskine said Warne’s ex-wife Simone was “really upset” as their three kids Jackson, Brooke and Summer now face life without their dad. “I think the three children are in complete shock,” Erskine told Weekend Today . “I spoke to them yesterday and again. “Jackson just said, ‘We just expect him to walk in the door. This is like a bad dream’. “I spoke to Simone, who was really upset, and obviously Keith, Shane’s father, is a pretty strong individual but, like everybody he’s just shattered. They can’t believe what’s happened. “I think that’s what happens when you have a sudden death and you’re not expecting it. One minute the kids are talking to him every day, the next minute they can’t talk to him and then they start thinking about, ‘He’s not going to be there for my 21st, he’s not going to take me down the aisle’. “All of those sorts of things go through your head. They are having a much harder time than anybody really.” Warne’s mother Brigitte had earlier told The Herald Sun : “We’re just in shock. We’re OK.” Thai police revealed Warne was suffering chest pains before he left Australia for a holiday in Koh Samui. Police Colonel Yuthana Sirisombat told reporters on Saturday night his family had informed them of the late cricket legend’s history of heart disease and asthma and their concern about his health before he left Australia last week. The 52-year-old had recently “seen a doctor about his heart”, Sirisombat said. Erskine was unaware of the extent of those issues, saying: “I didn’t know about that. I did know from Helen, his secretary, that he’d had a bit of a chest pain and also was sweating last week but I only found that later on after he’d died. I didn’t know that at the time. “He did go on these ridiculous sorts of diets, and he was just finished one, where he basically only ate fluids for 14 days and he’d done this three or four times. It was a bit ... all or nothing. It was either white buns with butter and lasagne stuffed in the middle or he would be having black and green juices. “I don’t know, he obviously smoked most of his life. I don’t know, I think it was just a massive heart attack. That’s what I think’s happened.” New photographs have emerged of where Warne was staying at the Samujana Villas resort, with various reports claiming blood stains were seen on the carpet and on three towels and a pillow, reportedly from the Spin King during the desperate attempts made to save his life. “A large amount of blood was found in the room,” Pol Maj Gen Satit Polpinit, commander of Surat Thani Provincial Police, told Thai newspaper Matichon. “When CPR was started, the deceased had coughed up liquid and was bleeding.” On Saturday Erskine opened up on the harrowing details of Warne’s death, as friend Andrew Neophitou tried in vain to resuscitate the Aussie icon. “They’d only arrived the night before. They were going to have a drink at 5 o’clock … and Neo knocked on his door at 5.15 because Warnie’s always on time and then he went in there and said ‘c’mon, you’re going to be late’ and then realised something was wrong,” Erskine told Fox Sports. “He turned him over, gave him CPR mouth-to-mouth, that lasted about 20 minutes, then obviously the ambulance came, they took him to the hospital, which was about 20 minutes drive and then within, I suppose, I got a phone call 45 minutes later to say he was pronounced dead. “It’s one of these things where someone said to me that when someone is larger than life, you don’t expect them to die. I think that’s probably a very good analogy. You don’t expect someone to die at 52 years old. You don’t expect Shane Warne to die because he was an extraordinary human being.” New photographs have emerged from the hotel room in Thailand where Shane Warne died, where several blood stains were found. Cricket continues to be its own worst enemy as farcical scenes broughtday two of Australia’s Test against Pakistan to an early close. Trolls are hijacking the death of 52-year-old Australian cricket legend Shane Warne to spread wild conspiracy theories.","image_url":null,"source_id":"news","country":["australia"],"category":["sports"],"language":"english"},{"title":"‘Warnie didn’t do drugs’: Greg Chappell hits out at stories surrounding star’s death","link":"https://www.news.com.au/sport/warnie-didnt-do-drugs-greg-chappell-hits-out-at-stories-surrounding-stars-death/video/3adc97ee9965174d1ea5a2e7187a0be4","keywords":null,"creator":null,"video_url":null,"description":"Australian cricket legend and former captain Greg Chappell has hit out at stories circulating the news about Shane Warne's activities in Thailand – in particular around drugs. \"Warnie didn't do drugs,\" Mr Chappell said. \"He hated drugs, he didn't need drugs – he was high on life.\"","content":null,"pubDate":"2022-03-05 23:17:03","full_description":null,"image_url":null,"source_id":"news","country":["australia"],"category":["sports"],"language":"english"},{"title":"‘Warnie didn’t do drugs’: Greg Chappell hits out at stories surrounding star’s death","link":"https://www.cairnspost.com.au/sport/warnie-didnt-do-drugs-greg-chappell-hits-out-at-stories-surrounding-stars-death/video/3adc97ee9965174d1ea5a2e7187a0be4","keywords":["Lifestyle - syndicated","National","Sport news and galleries"],"creator":null,"video_url":null,"description":"Australian cricket legend and former captain Greg Chappell has hit out at stories circulating the news about Shane Warne's activities in Thailand – in particular around drugs. \"Warnie didn't do drugs,\" Mr Chappell said. \"He hated drugs, he didn't need drugs – he was high on life.\"","content":null,"pubDate":"2022-03-05 23:17:03","full_description":null,"image_url":null,"source_id":"cairnspost","country":["australia"],"category":["sports"],"language":"english"},{"title":"King, Aust honour Warne in World Cup win","link":"https://thewest.com.au/sport/cricket/king-aust-honour-warne-in-world-cup-win-c-5949191","keywords":null,"creator":["Ben McKay"],"video_url":null,"description":"Australia's women's cricket team honoured Shane Warne in the best way possible: beating England in their World Cup opener.","content":null,"pubDate":"2022-03-05 23:01:05","full_description":"Victorian legspinner Alana King says she owes her career to Shane Warne, praising the great after sprinkling a bit of his magic to get Australia home in their Women's World Cup opener in New Zealand. King made her first World Cup appearance against England on Saturday, coming into proceedings with the match delicately poised. England were 2-128 at the halfway mark in Hamilton, tracking ahead of Australia's score, as they doggedly chased 311 for victory. King emulated Warne to claim a superb first World Cup wicket, luring Tammy Beaumont out of her crease spinning the ball away from the in-form opener, who was stumped for 74. \"It was just a nice ball that came out of the hand. Hopefully he (Warne) was proud of that,\" King said. \"And it got one of the Poms out and that's even better.\" King then bashed her black armband in tribute to Warne. \"That was an instinctive moment to be honest. Nothing was planned,\" she said. The 26-year-old grew up in Clarinda in Melbourne's south-east, Warne's old stomping ground, and like many, grew up idolising him. \"He was a big inspiration to me ... getting to the MCG on Boxing Day as a kid to see Warney just take poles for fun,\" she said. \"He was the big reason I picked up legspin and stuck at it. \"But I didn't realise what I was getting myself into,\" she laughed. \"Legspin is a pretty hard task.\" King finished with 3-59 and was credited by skipper Meg Lanning as the match-turner. Another Victorian won player of the match honours, Rachael Haynes who struck a superb 130, combining with Lanning for a 196-run stand. Haynes, in her 69th ODI, heaped praise on King, in her fourth. \"It was just exceptional legspin bowling,\" the 35-year-old said. Australia's squad woke up to the news of Warne's death on the morning of their match, gathering themselves in different ways. Lanning said none of the World Cup squad \"knew him super well\" but players were still shocked. \"We just made sure that everybody had the support that they needed,\" she said. \"He was the best ever to play the game in terms of leg spin. He changed the game and moved it forward. He was a genius.\" King said had an empty feeling after learning of Warne's passing, taking the time to read tributes and watch highlights on the morning of the match. Her personal connection to Warne was brief. She enjoyed a couple of net sessions earlier in her career, well before her rise to the national team. \"I was probably just too starstruck to be honest that he was down the other end,\" she said. \"Those things I will remember for a long time.\" King said she was proud to perform on a day honouring both Warne and fellow great Rod Marsh, who also died earlier in the week. \"We just knew if we put our best foot forward we'd be doing those boys upstairs pretty proud,\" she said. \"Warne was a big competitor. He never gave in and was always fighting until the end. \"I instilled a little bit of that. I will never give up when I'm bowling.\"","image_url":"https://images.thewest.com.au/publication/C-5949191/0654656a336fd1571e6aed692532f68387c7f5ed-16x9-x0y0w1280h720.jpg","source_id":"thewest","country":["australia"],"category":["sports"],"language":"english"},{"title":"King, Aust honour Warne in World Cup win","link":"https://www.perthnow.com.au/sport/cricket/king-aust-honour-warne-in-world-cup-win-c-5949190","keywords":null,"creator":["Ben McKay"],"video_url":null,"description":"Australia's women's cricket team honoured Shane Warne in the best way possible: beating England in their World Cup opener.","content":null,"pubDate":"2022-03-05 23:01:05","full_description":"Victorian legspinner Alana King says she owes her career to Shane Warne, praising the great after sprinkling a bit of his magic to get Australia home in their Women's World Cup opener in New Zealand. King made her first World Cup appearance against England on Saturday, coming into proceedings with the match delicately poised. England were 2-128 at the halfway mark in Hamilton, tracking ahead of Australia's score, as they doggedly chased 311 for victory. King emulated Warne to claim a superb first World Cup wicket, luring Tammy Beaumont out of her crease spinning the ball away from the in-form opener, who was stumped for 74. \"It was just a nice ball that came out of the hand. Hopefully he (Warne) was proud of that,\" King said. \"And it got one of the Poms out and that's even better.\" King then bashed her black armband in tribute to Warne. \"That was an instinctive moment to be honest. Nothing was planned,\" she said. The 26-year-old grew up in Clarinda in Melbourne's south-east, Warne's old stomping ground, and like many, grew up idolising him. \"He was a big inspiration to me ... getting to the MCG on Boxing Day as a kid to see Warney just take poles for fun,\" she said. \"He was the big reason I picked up legspin and stuck at it. \"But I didn't realise what I was getting myself into,\" she laughed. \"Legspin is a pretty hard task.\" King finished with 3-59 and was credited by skipper Meg Lanning as the match-turner. Another Victorian won player of the match honours, Rachael Haynes who struck a superb 130, combining with Lanning for a 196-run stand. Haynes, in her 69th ODI, heaped praise on King, in her fourth. \"It was just exceptional legspin bowling,\" the 35-year-old said. Australia's squad woke up to the news of Warne's death on the morning of their match, gathering themselves in different ways. Lanning said none of the World Cup squad \"knew him super well\" but players were still shocked. \"We just made sure that everybody had the support that they needed,\" she said. \"He was the best ever to play the game in terms of leg spin. He changed the game and moved it forward. He was a genius.\" King said had an empty feeling after learning of Warne's passing, taking the time to read tributes and watch highlights on the morning of the match. Her personal connection to Warne was brief. She enjoyed a couple of net sessions earlier in her career, well before her rise to the national team. \"I was probably just too starstruck to be honest that he was down the other end,\" she said. \"Those things I will remember for a long time.\" King said she was proud to perform on a day honouring both Warne and fellow great Rod Marsh, who also died earlier in the week. \"We just knew if we put our best foot forward we'd be doing those boys upstairs pretty proud,\" she said. \"Warne was a big competitor. He never gave in and was always fighting until the end. \"I instilled a little bit of that. I will never give up when I'm bowling.\"","image_url":"https://images.perthnow.com.au/publication/C-5949190/0654656a336fd1571e6aed692532f68387c7f5ed-16x9-x0y0w1280h720.jpg","source_id":"perthnow","country":["australia"],"category":["sports"],"language":"english"},{"title":"Shane Warne suffered chest pains before he travelled to Thailand, police say - The Guardian","link":"https://news.google.com/__i/rss/rd/articles/CBMieWh0dHBzOi8vd3d3LnRoZWd1YXJkaWFuLmNvbS9zcG9ydC8yMDIyL21hci8wNi9zaGFuZS13YXJuZS1zdWZmZXJlZC1jaGVzdC1wYWlucy1iZWZvcmUtaGUtdHJhdmVsbGVkLXRvLXRoYWlsYW5kLXBvbGljZS1zYXnSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Shane Warne suffered chest pains before he travelled to Thailand, police say  The GuardianDevastated Liz Hurley pays tribute to her 'beloved' Shane Warne after death at 52  The MirrorShane Warne’s last moments revealed before pal knocked on his door in Thai villa and realised ‘something’s...  The SunShane Warne death: authorities reveal attempts to save life of cricket legend  The GuardianShane Warne: Legendary cricketer's life in pictures after death aged 52  The IndependentView Full coverage on Google News","content":null,"pubDate":"2022-03-05 22:57:00","image_url":null,"source_id":"google","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Australia finally batting in Pakistan","link":"https://www.cairnspost.com.au/sport/cricket/australia-finally-batting-in-pakistan/video/aaf731a26c053df9ae2c0c8fb36cb58e","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket: Pakistan declared late on Day 2 for 4/476, sending in the Aussies for a single over as bad light set in.","content":null,"pubDate":"2022-03-05 21:27:20","full_description":null,"image_url":null,"source_id":"cairnspost","country":["australia"],"category":["sports"],"language":"english"},{"title":"Australia finally batting in Pakistan","link":"https://www.news.com.au/sport/cricket/australia-finally-batting-in-pakistan/video/aaf731a26c053df9ae2c0c8fb36cb58e","keywords":null,"creator":null,"video_url":null,"description":"Cricket: Pakistan declared late on Day 2 for 4/476, sending in the Aussies for a single over as bad light set in.","content":null,"pubDate":"2022-03-05 21:27:20","full_description":null,"image_url":null,"source_id":"news","country":["australia"],"category":["sports"],"language":"english"},{"title":"Australia’s thrilling opening win over England","link":"https://www.news.com.au/sport/cricket/australias-thrilling-opening-win-over-england/video/993321dc7eec8e0d30d9baf7f87a2d8f","keywords":null,"creator":null,"video_url":null,"description":"Cricket: The Aussies delivered a dream result in their opening World Cup match against England.","content":null,"pubDate":"2022-03-05 21:27:19","full_description":null,"image_url":null,"source_id":"news","country":["australia"],"category":["sports"],"language":"english"},{"title":"Australia’s thrilling opening win over England","link":"https://www.cairnspost.com.au/sport/cricket/australias-thrilling-opening-win-over-england/video/993321dc7eec8e0d30d9baf7f87a2d8f","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket: The Aussies delivered a dream result in their opening World Cup match against England.","content":null,"pubDate":"2022-03-05 21:27:19","full_description":null,"image_url":null,"source_id":"cairnspost","country":["australia"],"category":["sports"],"language":"english"},{"title":"Shane Warne’s pals’ cries as medics battled to save cricket star after he spent final hours buying suit & h... - The Sun","link":"https://news.google.com/__i/rss/rd/articles/CBMiTGh0dHBzOi8vd3d3LnRoZXN1bi5jby51ay9zcG9ydC8xNzg1NjUxMS9zaGFuZS13YXJuZS1tYXNzYWdlLXN1aXQtcGFyYW1lZGljcy_SAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Shane Warne’s pals’ cries as medics battled to save cricket star after he spent final hours buying suit & h...  The SunShane Warne death: authorities reveal attempts to save life of cricket legend  The GuardianShane Warne: Legendary cricketer's life in pictures after death aged 52  The IndependentDevastated Liz Hurley pays tribute to her 'beloved' Shane Warne after death at 52  The MirrorShane Warne’s death is like that of a friend and gets worse with each hour  The GuardianView Full coverage on Google News","content":null,"pubDate":"2022-03-05 21:20:00","image_url":null,"source_id":"google","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Liz Hurley posts touching tribute to Shane Warne after cricket icon’s death","link":"https://www.foxsports.com.au/cricket/australia/liz-hurley-posts-touching-tribute-to-shane-warne-after-cricket-icons-death/news-story/99b2e3b250a84d0bbe8e9b1a473e08c0","keywords":null,"creator":null,"video_url":null,"description":"Liz Hurley has posted a tribute to ex-fiance Shane Warne after the Aussie cricket legend’s shock death.","content":null,"pubDate":"2022-03-05 21:10:00","full_description":"Liz Hurley has posted a tribute to ex-fiance Shane Warne after the Aussie cricket legend’s shock death . Warne died of a suspected heart attack in Thailand late on Friday night, with mates unable to revive him as they performed CPR after discovering the leg-spinning great unresponsive in his hotel room. Hurley took to Instagram late on Saturday night to remember her ex, sharing multiple photos of the pair together. “I feel like the sun has gone behind a cloud forever. RIP my beloved Lionheart,” she wrote. Watch Australia’s Tour of Pakistan on Kayo. Every Test, ODI and T20 Live & On-Demand. New to Kayo? Try 14-Days Free Now > \"I said you were wrong about Starc\" | 01:18 Hurley’s son Damian also posted on Instagram about Warne as he too shared a series of happy snaps with the cricket icon. “I’m still trying to wrap my head around this … SW was a father figure to me for most of my formative years and was truly one the best men I’ve ever known,” Damian wrote. “My heart is broken. Thinking of and sending love to all SW’s family.” MORE COVERAGE The moment Warne’s family learned of spin king’s death as heartbreaking details emerge ‘Come on, you’re going to be late’: Shane Warne’s tragic final moments revealed ‘Played his own game’: ‘Numb’ Gilchrist sums up ‘maestro’ King of spin’s legacy in touching tribute King and Healy combine for wicket! | 00:19 Warne and Hurley started dating in 2010, with the Aussie cricketer proposing to the British actress in September the following year but despite buying a home together and Warne feeling like “I was more in love with her than I’d ever realised I could be”, they split in 2013 before making it down the aisle. In his autobiography No Spin , Warne said there was “no single, clear reason” why their relationship ended. But it’s clear Hurley landing a lead role on TV series The Royals played a big part because of the new demands on her time and how little they saw each other. Warne’s relationship with Hurley came after the 2005 breakdown of his 10-year marriage to Simone Callahan, which ended on the eve of an Ashes series in the UK. Warne proposed to Hurley on Australian businessman James Packer’s boat, Arctic P, off the coast of Spain in 2011 after just 18 months together. It was supposed to be kept secret but Packer let the details slip. They were the definition of a glamour couple. (Photo by Ian Jacobs/Getty Images) aslipics Source: Getty Images “Completely on impulse in the middle of a dance, I grabbed Elizabeth, dropped to one knee and said, ‘I’m not sure about you, but I’ve never got along with any woman as well as I get along with you. I’m madly in love with you. Our kids get along great. How would you like to spend the rest of your life with me?’” Warne wrote in his book. “Without hesitation, she replied: ‘Of course I would, silly, I’m madly in love with you too. I feel exactly the same. I’ve never got on better with anyone than I do with you either.” Packer was the only one party to the moment and was fingered by the couple when the news broke in Australia a week later and forced them into a tough conversation with their angry kids. After initially denying he’d said anything, Packer fessed up about six months later. “Okay, it was me,” he told Warne at Crown in Melbourne. “I’m sorry — hit me, do whatever you want … I’m really sorry.” Warne and Hurley weren’t shy of showing their affection. Source: News Limited They often hit the red carpet. (Photo by Alex Moss/WireImage) Source: Supplied During this summer’s Ashes series Warne described his split with Callahan as the “lowest moment of my life”. The pair got married in 1995 and have three children together: Jackson, Brooke and Summer. “Getting divorced was a difficult time in my life and for my children — and it was my fault,’’ Warne said on Fox Cricket’s broadcast. “So I have to live with that for the rest of my life so it wasn’t easy. “A week before the Ashes series to do that, and then have to drag myself off the canvas and get out there and play in 2005, play against a quality England side … to have the Barmy Army for six hours a day, not just 10 minutes, singing songs, singing ‘Where’s your missus gone?’ “Yeah good on you mate, it was a pretty good song. “I’m sitting there worrying about my children that I was hoping I was going to spend three months of the Ashes series with, but because of my own doing they had to turn around and find a flight (back to Australia) so I was pretty devastated with that. “That was the lowest point in my life and then I had to go out and play an Ashes series so that was really tough.”","image_url":null,"source_id":"foxsports","country":["australia"],"category":["sports"],"language":"english"},{"title":"Haynes celebrates century in Aussie win","link":"https://www.news.com.au/sport/cricket/haynes-celebrates-century-in-aussie-win/video/0cb46fbea958db68a5b2ae3f90b5523f","keywords":null,"creator":null,"video_url":null,"description":"Cricket: Rachael Haynes spoke about reaching a 100 in a thrilling win for the Aussies in their opening World Cup match.","content":null,"pubDate":"2022-03-05 21:09:20","full_description":null,"image_url":null,"source_id":"news","country":["australia"],"category":["sports"],"language":"english"},{"title":"Haynes celebrates century in Aussie win","link":"https://www.cairnspost.com.au/sport/cricket/haynes-celebrates-century-in-aussie-win/video/0cb46fbea958db68a5b2ae3f90b5523f","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket: Rachael Haynes spoke about reaching a 100 in a thrilling win for the Aussies in their opening World Cup match.","content":null,"pubDate":"2022-03-05 21:09:20","full_description":null,"image_url":null,"source_id":"cairnspost","country":["australia"],"category":["sports"],"language":"english"},{"title":"“I said you were wrong about Starc”","link":"https://www.news.com.au/sport/cricket/i-said-you-were-wrong-about-starc/video/5fccd9c8e9c65616fa61582e971d01d0","keywords":null,"creator":null,"video_url":null,"description":"Cricket: James Erskine gave an insight into the strong opinions Shane Warne shared, and why he didn't hold back in sharing his view.","content":null,"pubDate":"2022-03-05 20:36:20","full_description":null,"image_url":null,"source_id":"news","country":["australia"],"category":["sports"],"language":"english"},{"title":"Warne had 'seen a doctor about his heart'","link":"https://wwos.nine.com.au/cricket/shane-warne-death-thai-police-reveal-legend-knew-about-heart-problems/b88a519f-99af-4a26-9650-ccb3a8549a28","keywords":null,"creator":["wwos"],"video_url":null,"description":"Thai Police have revealed some key details about Shane Warne's medical history after information from his family.","content":"Shane Warne had experienced chest pains prior to his death and had a history of asthma and heart issues, according to Thai Police.Warne's life was brought to a tragic end at just 52 years of age when he was found unresponsive in his Koh Samui villa in the early hours of Saturday Australian time. Speaking to reporters following the spin icon's death, Yuttana Sirisomba, a superintendent at the Bo Phut police station in Koh Samui, said he'd been given information on the cricket legend's health by his family. READ MORE: Warne's finest hour in the middle of the nightREAD MORE: Warne's final moments revealed by managerREAD MORE: Tubby's shock after phone started buzzing earlySirisomba revealed that Warne had recently \"seen a doctor about his heart\". Despite the sudden nature of Warne's death, it is not being treated as suspicious at this stage, although Royal Thai Police are keen to complete a thorough investigation. Police will get statements from the friends of Warne who were also staying at the Samujana Villas and will also ask forensic officers to examine the villa Warne was found in.Warne's body is set to be transferred to Surat Thani on the Thai mainland for an autopsy.Australian ambassador to Thailand, Allan McKinnon, and Department of Foreign Affairs and Trade (DFAT) officials had two meetings with Royal Thai Police at Bo Phut Police Station after Warne's death to discuss arrangements to return his body to Australia.For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here!","pubDate":"2022-03-05 20:34:37","full_description":"Shane Warne had experienced chest pains prior to his death and had a history of asthma and heart issues, according to Thai Police. Warne's life was brought to a tragic end at just 52 years of age when he was found unresponsive in his Koh Samui villa in the early hours of Saturday Australian time. Speaking to reporters following the spin icon's death, Yuttana Sirisomba, a superintendent at the Bo Phut police station in Koh Samui, said he'd been given information on the cricket legend's health by his family. READ MORE: Warne's finest hour in the middle of the night READ MORE: Warne's final moments revealed by manager READ MORE: Tubby's shock after phone started buzzing early Sirisomba revealed that Warne had recently \"seen a doctor about his heart\". Despite the sudden nature of Warne's death, it is not being treated as suspicious at this stage, although Royal Thai Police are keen to complete a thorough investigation. Police will get statements from the friends of Warne who were also staying at the Samujana Villas and will also ask forensic officers to examine the villa Warne was found in. Warne's body is set to be transferred to Surat Thani on the Thai mainland for an autopsy. Australian ambassador to Thailand, Allan McKinnon, and Department of Foreign Affairs and Trade (DFAT) officials had two meetings with Royal Thai Police at Bo Phut Police Station after Warne's death to discuss arrangements to return his body to Australia. For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here!","image_url":"https://vms-network-images-prod.s3-ap-southeast-2.amazonaws.com/2022/03/414949/pickerimage.jpg","source_id":"nine","country":["australia"],"category":["sports"],"language":"english"},{"title":"Shane Warne’s family pushing to get his body back to Australia as soon as possible","link":"https://www.foxsports.com.au/cricket/australia/shane-warnes-family-pushing-to-get-his-body-back-to-australia-as-soon-as-possible/news-story/00ff1de639d4fd805765419aed19a60b","keywords":null,"creator":null,"video_url":null,"description":"Shane Warne’s family reportedly want any autopsy on the cricket star to be delayed until he is back in Australia, as the world continues to reel from his shock death.","content":null,"pubDate":"2022-03-05 19:28:00","full_description":"Shane Warne’s family reportedly want any autopsy on the cricket star to be delayed until he is back in Australia, as the world continues to reel from his shock death. Warne, 52, died after suffering a suspected heart attack in Thailand on Friday afternoon. He was found unresponsive in a villa in Koh Samui, when one friend reportedly tried to wake him to no avail. Now, his devastated family is being faced with the difficult logistics of trying to get the Australian legend’s body home. His family is reportedly pushing for an autopsy not to be completed until Warne’s body is back in Australia, in a bid to get him home as soon as possible. However, Thai authorities have said an autopsy will first need to be completed before his body can be released. Shane Warne died after suffering a suspected heart attack in Thailand. Picture: Indranil Mukherjee/AFP Source: AFP Bo Phut police lieutenant-colonel Chatchawin Nakmusik told The Guardian he would be contacting Warne’s friends and manager for a statement. “I am waiting for the autopsy report. If there is nothing suspicious, then the case is closed,” he said. “The family will be responsible to take the body back to their home country.” Foreign Minister Marise Payne said Australian Department of Foreign Affairs and Trade officials were heading to Koh Samui to provide assistance to those travelling with Warne. “DFAT is working with Thai authorities to confirm arrangements following his passing, assist with his repatriation and provide other assistance on the ground,” she said. Thai forensic investigators examined the hotel room on Saturday evening where Warne was found. Australian consular officials accompanied his devastated friends to provide statements to authorities. The friend who found Warne, Andrew Neophitou, briefly spoke with reporters after meeting with police on Saturday. Andrew Neophitou (L), manager of Australian cricket player Shane Warne, and a friend of Warne (2nd R) arrive at Bophut police station on Thailand's Koh Samui. Picture: Jack Taylor/AFP Source: AFP “The family has asked for privacy at this stage,” Mr Neophitou said. “We really just want to get Shane home. That’s all we want to do.” Warne’s death came just days after he declared he was aiming to return to peak fitness again . The cricket legend’s close friend and long-time manager James Erskine revealed the gut-wrenching moment Warne was found unresponsive by Mr Neophitou. “They’d only arrived the night before. They were going to have a drink at 5 o’clock … and Neo knocked on his door at 5.15 because Warney’s always on time and then he went in there and said ‘c’mon, you’re going to be late’ and then realised something was wrong,” Erskine revealed on a memorial show on Fox Cricket. “He turned him over, gave him CPR mouth-to-mouth, that lasted about 20 minutes, then obviously the ambulance came, they took him to the hospital, which was about 20 minutes drive and then within, I suppose, I got a phone call 45 minutes later to say he was pronounced dead.” Authorities inspecting the room of late cricketer Shane Warne in Koh Samui. Picture: Royal Thai Police via Matichon online Source: Supplied Police inside the villa on where Warne was found unresponsive. Picture: Royal Thai Police via Matichon online Source: Supplied According to local Thai news, the Wat Plai Leam rescue team were the first ones on the scene after Warne was found. “We got a call around 17.30 about an unconscious case,” rescue team chief, Phet Boonrak, said. “We got there in five minutes. The person was unconscious and had a weak pulse, so we tried CPR and called the ambulance. His friends were so shocked. They said they had found him unconscious on the bed and moved him to the floor to attempt CPR.” He said there was “vomit on the floor” but no signs of any injuries. “The ambulance arrived within 15 minutes, they took him to the hospital immediately.” Thai police have said “no foul play was suspected” . Emotional tributes pour in for Warne Tributes have been pouring in for the cricket star since Australia and the world woke to news of his death on Saturday. Fox Cricket held a special tribute to Warne on Saturday, with his former teammates, commentary colleagues and cricketing luminaries honouring the man affectionately known as “The King”. Former England star Isa Guha left no dry eyes in the place as she paid tribute to Warne. “Just stunned. I loved him, and he just did so much for so many people and he was magic,” Guha said. “He was magic, watching him on the screen as a cricketer. “So many incredible stories of him playing cricket. “But post that, he just made people feel that much taller, ten foot taller, which is a tremendous help to me, specifically.” Floral tributes rest at the base of the Shane Warne statue outside the Melbourne Cricket Ground. Picture: Darrian Traynor/Getty Images Source: Getty Images She said Warne supported her as a broadcaster but also radiated gratitude for his life and his family. Former England captain Michael Vaughan struggled to get through his interview on Fox Cricket, saying he was “like everybody else, absolutely gutted” and that he was “distraught”. Vaughan, who commentated alongside Warne during the Ashes, said he went from rivals on the field to mates off it. The former English captain said he shared Warne’s last Christmas with Shane and his family and said it was “very special to me”. Former Australian captain Allan Border said he had shed plenty of tears following the news. “I’ve shed some tears over the last couple of days with Rod Marsh. It’s going to be hard getting through the next couple of days finally realising I’m not going to see Shane again,” Border said. “It’s just so sad.” Warne has been offered a State Funeral and the Great Southern Stand at his beloved MCG will be renamed the S.K. Warne Stand in his honour. - with Andrew McMurty","image_url":null,"source_id":"foxsports","country":["australia"],"category":["sports"],"language":"english"},{"title":"Liz Hurley reacts to Shane Warne’s death","link":"https://www.news.com.au/sport/cricket/liz-hurley-posts-touching-tribute-to-shane-warne-after-cricket-icons-death/news-story/dfb582069c04af4ba9522dcaa944010b","keywords":null,"creator":null,"video_url":null,"description":"Liz Hurley has posted a tribute to ex-fiance Shane Warne after the Aussie cricket legend’s shock death.","content":null,"pubDate":"2022-03-05 19:17:00","full_description":"Liz Hurley has posted a tribute to ex-fiance Shane Warne after the Aussie cricket legend’s shock death. Warne died of a suspected heart attack in Thailand late on Friday night, with mates unable to revive him as they performed CPR after discovering the leg-spinning great unresponsive in his hotel room. Hurley took to Instagram late on Saturday night to remember her ex, sharing multiple photos of the pair together. “I feel like the sun has gone behind a cloud forever. RIP my beloved Lionheart,” she wrote. Hurley’s son Damian also posted on Instagram about Warne as he too shared a series of happy snaps with the cricket icon. “I’m still trying to wrap my head around this … SW was a father figure to me for most of my formative years and was truly one the best men I’ve ever known,” Damian wrote. “My heart is broken. Thinking of and sending love to all SW’s family.” Warne and Hurley started dating in 2010, with the Aussie cricketer proposing to the British actress in September the following year but despite buying a home together and Warne feeling like “I was more in love with her than I’d ever realised I could be”, they split in 2013 before making it down the aisle. In his autobiography No Spin , Warne said there was “no single, clear reason” why their relationship ended. But it’s clear Hurley landing a lead role on TV series The Royals played a big part because of the new demands on her time and how little they saw each other. Warne’s relationship with Hurley came after the 2005 breakdown of his 10-year marriage to Simone Callahan, which ended on the eve of an Ashes series in the UK. Warne proposed to Hurley on Australian businessman James Packer’s boat, Arctic P, off the coast of Spain in 2011 after just 18 months together. It was supposed to be kept secret but Packer let the details slip. “Completely on impulse in the middle of a dance, I grabbed Elizabeth, dropped to one knee and said, ‘I’m not sure about you, but I’ve never got along with any woman as well as I get along with you. I’m madly in love with you. Our kids get along great. How would you like to spend the rest of your life with me?’” Warne wrote in his book. “Without hesitation, she replied: ‘Of course I would, silly, I’m madly in love with you too. I feel exactly the same. I’ve never got on better with anyone than I do with you either.” Packer was the only one party to the moment and was fingered by the couple when the news broke in Australia a week later and forced them into a tough conversation with their angry kids. After initially denying he’d said anything, Packer fessed up about six months later. “Okay, it was me,” he told Warne at Crown in Melbourne. “I’m sorry — hit me, do whatever you want … I’m really sorry.” During this summer’s Ashes series Warne described his split with Callahan as the “lowest moment of my life”. The pair got married in 1995 and have three children together: Jackson, Brooke and Summer. “Getting divorced was a difficult time in my life and for my children — and it was my fault,’’ Warne said on Fox Cricket’s broadcast. “So I have to live with that for the rest of my life so it wasn’t easy. “A week before the Ashes series to do that, and then have to drag myself off the canvas and get out there and play in 2005, play against a quality England side … to have the Barmy Army for six hours a day, not just 10 minutes, singing songs, singing ‘Where’s your missus gone?’ “Yeah good on you mate, it was a pretty good song. “I’m sitting there worrying about my children that I was hoping I was going to spend three months of the Ashes series with, but because of my own doing they had to turn around and find a flight (back to Australia) so I was pretty devastated with that. “That was the lowest point in my life and then I had to go out and play an Ashes series so that was really tough.” New photographs have emerged from the hotel room in Thailand where Shane Warne died, where several blood stains were found. Shane Warne’s former fiancee, actor Elizabeth Hurley, has shared an emotional tribute to the cricket star in the wake of his death. Shane Warne’s family is reportedly pushing to delay an autopsy on the cricket star in order to get his body back to Australia as soon as possible.","image_url":null,"source_id":"news","country":["australia"],"category":["sports"],"language":"english"},{"title":"QUN-W vs SAU-W Dream11 Prediction: Fantasy Cricket Tips, Today's Playing 11 and Pitch Report for Australia Women’s ODD, Match 12","link":"https://www.sportskeeda.com/fantasy-cricket-mantra/qun-w-vs-sau-w-dream11-prediction-fantasy-cricket-tips-today-s-playing-11-pitch-report-australia-women-s-odd-match-12?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Fantasy Cricket Mantra"],"creator":["Anjishnu Roy"],"video_url":null,"description":null,"content":null,"pubDate":"2022-03-05 19:14:08","full_description":"Queensland Women will take on South Australia Women in the 12th match of the Australia Women’s ODD at the North Sydney Oval in Sydney on Sunday. Queensland Fire are in the fifth position in the table and they have had a pretty rough campaign. The side have won just one match having played two games. Meanwhile, South Australian Scorpions are second in the table. They have won both their games so far and will be looking to continue with the same winning mentality. QUN-W XI Georgia Voll, Georgia Redmayne (wk), Charli Knott, Grace Harris, Mikayla Hinkley, Jess Jonassen (C), Ellie Johnston, Meagan Dixon, Georgia Prestwidge, Courtney Sippel, Lilly Mills SAU-W XI Bridget Patterson, Emma De Broughe, Josephine Dooley, Courtney Webb, Tegan McPharlin (wk), Annie O’Neil, Jemma Barsby (C), Ellie Falconer, Samantha Betts, Kate Peterson, Brooke Harris QUN-W vs SAU-W, Australia Women’s ODD, Match 12 Date and Time: 6th March, 2022, 4:30 AM IST Venue: North Sydney Oval, Sydney This ground is expected to be a pretty nice bowling surface. Batters will have to spend some time in the middle before playing strokes. Wicketkeeper Georgia Redmayne will be a great choice for the wicketkeeper slot. She scored 63 runs against Tasmania Women and will be hoping for another big knock. Batters Courtney Webb is a right-handed batter who has done wonders with the bat. She has scored 110 runs so far. Emma de Broughe is the third-highest run-scorer in the competition. She has scored 151 runs in two matches at an average of over 75. All-rounders Jess Jonassen is a fantastic all-rounder who has been playing at a very high level in this competition. She has picked up six wickets from two matches and will be a splendid multiplier choice for your QUN-W vs SAU-W Dream11 Fantasy Side. Bowlers Samantha Betts has done a wonderful job with the ball. She has scalped eight wickets so far. Samantha Betts (SAU-W) – 262 points Jess Jonassen (QUN-W) – 234 points Grace Harris (QUN-W) – 197 points Emma de Broughe (SAU-W) – 185 points Ellie Falconer (SAU-W) – 141 points Samantha Betts: 8 wickets Jess Jonassen: 6 wickets Grace Harris: 99 runs and 2 wickets Emma de Broughe: 151 runs Fantasy Suggestion #1: Georgia Redmayne, Emma de Broughe, Courtney Webb, Mikayla Hinkley, Jess Jonassen, Grace Harris, Jemma Barsby, Samantha Betts, Ellie Falconer, Kate Peterson, Georgia Prestwidge Captain: Jess Jonassen Vice-Captain: Samantha Betts Fantasy Suggestion #2: Georgia Redmayne, Emma de Broughe, Courtney Webb, Georgia Voll, Mikayla Hinkley, Jess Jonassen, Grace Harris, Jemma Barsby, Samantha Betts, Ellie Falconer, Kate Peterson Captain: Grace Harris Vice-Captain: Courtney Webb","image_url":"https://static.sportskeeda.com/editor/2022/03/f3d7c-16465030214285-1920.jpg","source_id":"sportskeeda","country":["india"],"category":["sports"],"language":"english"},{"title":"Elizabeth Hurley pays tribute to Shane Warne as Thai police confirm bowler suffered chest pains before death - The Telegraph","link":"https://news.google.com/__i/rss/rd/articles/CBMibWh0dHBzOi8vd3d3LnRlbGVncmFwaC5jby51ay9jcmlja2V0LzIwMjIvMDMvMDUvZWxpemFiZXRoLWh1cmxleS1wYXlzLXRyaWJ1dGUtc2hhbmUtd2FybmUtdGhhaS1wb2xpY2UtY29uZmlybS_SAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Elizabeth Hurley pays tribute to Shane Warne as Thai police confirm bowler suffered chest pains before death  The TelegraphShane Warne death: authorities reveal attempts to save life of cricket legend  The GuardianShane Warne: Legendary cricketer's life in pictures after death aged 52  The IndependentDevastated Liz Hurley pays tribute to her 'beloved' Shane Warne after death at 52  The MirrorShane Warne’s death is like that of a friend and gets worse with each hour  The GuardianView Full coverage on Google News","content":null,"pubDate":"2022-03-05 19:00:00","image_url":null,"source_id":"google","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Shane Warne dies age 52 – Liz Hurley breaks silence on ‘lionheart’ cricket legend as star found dead in Thailand villa","link":"https://www.thesun.co.uk/sport/17845101/shane-warne-death-liz-hurley-news/","keywords":["Cricket","Sport","Australia Cricket Team","Celebrity deaths","Live Blogs","Sport Live Blogs"],"creator":["Louis Allwood"],"video_url":null,"description":"NEW DETAILS emerge about Shane Warne’s death as local police rule out foul play. The moments before Shane Warne’s sudden death at a luxury Thai villa on Friday evening have been revealed, as local Thai police rule out foul play. Thai police in Koh Samui on Saturday confirmed they had now ruled out any suspicious circumstances […]","content":"NEW DETAILS emerge about Shane Warne’s death as local police rule out foul play. The moments before Shane Warne’s sudden death at a luxury Thai villa on Friday evening have been revealed, as local Thai police rule out foul play. Thai police in Koh Samui on Saturday confirmed they had now ruled out any suspicious circumstances in the tragic death. “No foul play was suspected at the scene based on our investigation,” Thai police told AFP.  The Australian leg-spinner, 52, was found unresponsive in a villa in Thailand by three friends, his management announced this afternoon, reports Fox Sport. The three people, who were also staying in the villa on Koh Samui island, tried unsuccessfully to revive him, Chatchawin Nakmusik of the Bo Put police told Reuters. Nakmusik added Warne was taken by ambulance to hospital, where medical personnel could not revive him. Chatchawin said Warne’s body had been transferred to another hospital for autopsy and his associates would be questioned by police today, but added there were no signs of foul play. Liz Hurley broke her silence to pay tribute to Warne, who was with pals at a luxury villa in Thailand when he was found unresponsive on Friday. She said: “I feel like the sun has gone behind a cloud forever. RIP my beloved Lionheart.” Read our Shane Warne live blog below for the latest updates…","pubDate":"2022-03-05 18:55:43","full_description":"NEW DETAILS emerge about Shane Warne's death as local police rule out foul play. The moments before Shane Warne's sudden death at a luxury Thai villa on Friday evening have been revealed, as local Thai police rule out foul play. Thai police in Koh Samui on Saturday confirmed they had now ruled out any suspicious circumstances in the tragic death. \"No foul play was suspected at the scene based on our investigation,\" Thai police told AFP. The Australian leg-spinner , 52, was found unresponsive in a villa in Thailand by three friends, his management announced this afternoon, reports Fox Sport. The three people, who were also staying in the villa on Koh Samui island, tried unsuccessfully to revive him, Chatchawin Nakmusik of the Bo Put police told Reuters. Nakmusik added Warne was taken by ambulance to hospital, where medical personnel could not revive him. Chatchawin said Warne's body had been transferred to another hospital for autopsy and his associates would be questioned by police today, but added there were no signs of foul play. Liz Hurley broke her silence to pay tribute to Warne, who was with pals at a luxury villa in Thailand when he was found unresponsive on Friday. She said: \"I feel like the sun has gone behind a cloud forever. RIP my beloved Lionheart.\" Read our Shane Warne live blog below for the latest updates... Liz Hurley started dating Aussie cricket legend Shane Warne in 2010. The relationship began just months after she ended her three-year marriage to Indian textile heir Arun Neyar. Her divorce was finalised in June 2011 and three months later it was reported Liz and Shane had become engaged after she was spotted wearing a large sapphire ring. The couple confirmed their engagement via Twitter soon after, but split in December 2013. LIZ Hurley's teenage son Damian has said \"my heart is broken\" over Shane Warne's death. The 19-year-old described his mum's ex-fiance as a\"father figure\" to him growing up. Despite the couple's split in 2013, they continued to enjoy a close friendship, with Liz also paying tribute to him today. Damian wrote on Instagram: \"I’m still trying to wrap my head around this… \"SW was a father figure to me for most of my formative years and was truly one the best men I’ve ever known. \"My heart is broken. Thinking of and sending love to all SW’s family.\" FORENSIC cops have been seen examining Shane Warne's luxury Thai villa after confirming his death isn't suspicious. The Aussie sporting hero , 52, was found unresponsive in his room by pal Andrew Neophitou at the luxury villa they were staying in yesterday. Today, cops and forensic teams were seen swooping the villa after Warne's suspected heart attack. Thai police confronted the sad scenes at the luxury resort as they continue to probe the tragedy. His pals said they were giving the cricket legend CPR and mouth-to-mouth for 20 minutes while ambulances arrived. Superintendent Yuttana Sirisombat said Warne had experienced chest pains before his death and \"had seen a doctor about his heart\". PIERS Morgan has called for his close friend Shane Warne to get a knighthood after the cricket legend's tragic death. Warne, 52, was with pals at a luxury villa when he was found unresponsive on Friday. His desperate friends performed CPR for around 20 minutes before paramedics took him to the Thai International Hospital, where he was sadly pronounced dead. Pal Piers is now calling for Warne to be given a knighthood after his incredible cricket career. He tweeted: \"Shane Warne was the only one of Wisden’s 5 greatest cricketers of 20th Century not to be knighted. \"He wasn’t Mother Teresa but if Gavin bloody Williamson can get a gong then so should Warnie, posthumously, for services to cricket & charity. Make it happen @BorisJohnson#SirShane\". Shane Warne's manager James Erskine shed light on the sportsman's final moments in Fox Sport special, Remembering Shane Warne. He said the group were due to go for drinks at 5pm when pal Andrew Neophitou knocked on his door and realised \"something was wrong\". James added: \"He went in there and said 'come on, you're going to be late' and then realised something was wrong. \"And he turned him over and gave him CPR and mouth to mouth, which lasted about 20 minutes and then the ambulance came. \"They took him to the hospital, which was about a 20-minute drive and I got a phone call about 45 minutes later saying he was pronounced dead.\" TV presenter Lizzie Cundy said she and Shane Warne shared “many laughs together” in a tribute on Twitter. She said: “I’m absolutely devastated to have just heard my friend Shane Warne has passed away. “A true cricket legend and really lovely chap. “We had many laughs together, I’m heartbroken. “My thoughts and prayers are with his family.” I'm now hanging the Shane Warne blog over to my colleague Louis Allwood, who will be bringing you all the latest news and updates until 10pm tonight. Shane Warne had arrived to Thailand on Thursday with friends for a lad's holiday. Warne had spent the day watching Australia's Test cricketers take on Pakistan from bedroom before the tragedy unfolded. Manager James Erskine explained Warne, who \"hadn't been drinking\", was \"having a lie down\" when he was discovered with no heartbeat. He added: \"He doesn't drink, never took drugs, ever. He hated drugs so nothing untoward. \"He was going to do the things he likes doing. He was going to play in one or two poker competitions, play a lot of golf, be with his kids, that was about it; [to] have time to himself.\" ELIZABETH Hurley has paid tribute to her \"Lionheart\" ex-fiance Shane Warne after he died from a suspected heart attack. The actress was in a relationship with the cricket legend, 52, for three years until they split in 2013. She said: \"I feel like the sun has gone behind a cloud forever. RIP my beloved Lionheart.\" Liz also shared seven touching snaps with the cricketer as she broke her silence on Instagram today. SHANE Warne's final moments have been revealed after the cricket legend died from a suspected heart attack on holiday in Thailand. The Aussie sporting hero , 52, was found unresponsive in his room by pal Andrew Neophitou at the luxury villa they were staying in yesterday. His manager James Erskine shed light on the sportsman's final moments in Fox Sport special, Remembering Shane Warne. He said the group were due to go for drinks at 5pm when Andrew knocked on his door and realised \"something was wrong\". James added: \"He went in there and said 'come on, you're going to be late' and then realised something was wrong. \"And he turned him over and gave him CPR and mouth to mouth, which lasted about 20 minutes and then the ambulance came. \"They took him to the hospital, which was about a 20-minute drive and I got a phone call about 45 minutes later saying he was pronounced dead.\" The former couple had three children together. Their eldest Brooke is 24-years-old and was reportedly due to get married to boyfriend Alex Heath in early 2022. Shane and Simone also have another daughter, Summer, 20, and 22-year-old son Jackson. Simone was working as a promotions girl for Aussie lager Foster’s when she met Shane Warne at a celebrity event in Melbourne in 1992. Back then, he was about to play his first Test match for his country and was on the cusp of becoming one of the greatest spin bowlers in history. The pair tied the knot in 1995 and had their first child two years later. Born in 1970, Simone is 52 and lives in Australia. The Aussie tested positive over the summer, forcing him to isolate and miss coaching The Hundred team London Spirit. Double-jabbed Warne, a Sky TV cricket pundit who took 708 Test wickets, said: “I’m unfortunately not playing enough golf because I’ve got Covid. “Don’t take this as any sort of gospel, and this is actually a bit tongue-in-cheek, but I thought if I smoked 100 cigarettes a day I could kill Covid. “It didn’t really work and I ended up on a ventilator, so it wasn’t ideal. “I had to have the ten days’ isolation — but I’m up and about now.” The retired spin bowler’s claims follow numerous bizarre attempts to avoid the virus, including taking animal de-wormers or drinking bleach. SHANE Warne paid tribute to cricket legend Rod Marsh in a tragic final tweet just hours before he also died from a suspected heart attack. His death came hours after tweeting his \"sadness\" at the death of Marsh who suffered a heart attack aged 74. He said: \"Sad to hear the news that Rod Marsh has passed. He was a legend of our great game & an inspiration to so many young boys & girls. \"Rod cared deeply about cricket & gave so much-especially to Australia & England players. Sending lots & lots of love to Ros & the family. RIP mate.\" NEW DETAILS emerge about Shane Warne's death as local police rule out foul play. The moments before Shane Warne's sudden death at a luxury Thai villa on Friday evening have been revealed, as local Thai police rule out foul play. Thai police in Koh Samui on Saturday confirmed they had now ruled out any suspicious circumstances in the tragic death. \"No foul play was suspected at the scene based on our investigation,\" Thai police told AFP. Last year, it was reported Shane was planning to build a $5 million new home in Portsea, Victoria. According to The Herald Sun, plans were submitted on his behalf to Mornington Peninsula Shire Council to build the eye-catching property featuring a bowling alley, wine cellar, and jet ski garage. Tributes have poured in for the cricketing legend , including from Piers Morgan . \"Absolutely devastated to hear that Shane Warne has died from a heart attack aged just 52,\" he tweeted. \"He was a genius cricketer, a supreme entertainer, a fantastic bloke and a great loyal friend for many years. \"Just gutting news. RIP Warnie, I loved every minute in your company.\" BBC Breakfast presenter Dan Walker recalled an appearance by Shane Warne on the programme in January this year. He tweeted: \"Genuinely can't believe the sad news about the death of Shane Warne. He came on Breakfast just a couple of weeks ago & was as effervescent as ever. \"What a talent he was. He had a huge impact on cricket and will be sorely missed by so many.\" Jemima Goldsmith, who was close friends with Shane Warne, tweeted: \"Devastating, shocking news about Shane Warne. A sporting hero for so many, inc my sons. And a giant-hearted friend.\" Ed Sheeran has said he is \"absolutely gutted\" by the news of his \"amazing friend.\" The singer said he had spoken to Warne on the phone this week to mark the anniversary of music mogul Michael Gudinski's death, with both of them raising a glass in his honour. Sheeran shared a photo of Warne and Gudinski together on Instagram and wrote: \"The world keeps taking incredible people away. \"I spoke to Shane on the anniversary of Michaels's passing this week saying we were both raising a glass of 707 in his honour, and now this news comes out. \"Shane was the kindest heart, and always went above and beyond to make people feel welcome and special. Such a gentleman. \"He gave so many hours and years of his life to bring joy to others and was such an amazing friend to me. Il bloody miss you mate. Absolutely gutted.\" SHANE Warne's four pals battled for 20 minutes to save his life after the cricket star died during a lads' holiday from a suspected heart attack. The cricket legend, 52, was found unresponsive in a villa in Thailand, where he arrived alongside his friends on Thursday. Police Senior Sergeant Major Suporn Hemruangsree said the group were sleeping on Friday afternoon when a pal tried to wake Shane, but to no avail. Officers said the friends performed CPR for around 20 minutes before an ambulance arrived and took him to the Thai International Hospital, where he was pronounced dead. Good morning! Milica Cosic with you today on the blogs. Sir Andrew Strauss called Warne the “greatest showman” and said nobody did more to grow the game of cricket. “He literally was the greatest showman,” he told BBC Five Live. “There were other great cricketers, who when you look at their record would potentially equal Shane’s or maybe even better them but there was no greater star in cricket than Shane Warne. “His contribution to the game of cricket is unmatched and unrivalled, I think. We should all be happy and proud to have played against him and watched him in action because no one grew the sport the way he did. “It is just so hard to believe he is not with us anymore. He was one of those characters who had so much vibrancy and energy about him, you never thought his time was anywhere near up.” Current Australia batsman David Warner wrote on Instagram: “Two legends of our game have left us too soon. “I’m lost for words, and this is extremely sad. My thoughts and prayers go out to the Marsh and Warne family. “I just can not believe it. #rip, you will both be missed.” BBC Breakfast presenter Dan Walker recalled an appearance by Shane Warne on the programme in January this year. He tweeted: “Genuinely can’t believe the sad news about the death of Shane Warne. “He came on Breakfast just a couple of weeks ago & was as effervescent as ever. “What a talent he was. He had a huge impact on cricket and will be sorely missed by so many.”","image_url":null,"source_id":"thesun","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Shane Warne experienced chest pain and ‘had seen a doctor about his heart’ before death, police say - The Independent","link":"https://news.google.com/__i/rss/rd/articles/CBMiYWh0dHBzOi8vd3d3LmluZGVwZW5kZW50LmNvLnVrL3Nwb3J0L2NyaWNrZXQvc2hhbmUtd2FybmUtZGVhdGgtY2F1c2UtcG9saWNlLXRoYWlsYW5kLWIyMDI5MzI2Lmh0bWzSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Shane Warne experienced chest pain and ‘had seen a doctor about his heart’ before death, police say  The IndependentShane Warne death: authorities reveal attempts to save life of cricket legend  The GuardianDevastated Liz Hurley pays tribute to her 'beloved' Shane Warne after death at 52  The MirrorShane Warne: Legendary cricketer's life in pictures after death aged 52  The IndependentShane Warne: stealer of dreams, tormentor, England’s nemesis  The GuardianView Full coverage on Google News","content":null,"pubDate":"2022-03-05 18:48:02","image_url":null,"source_id":"google","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Weather report Rawalpindi: What is the weather prediction for PAK vs AUS Day 3 at Pindi Cricket Stadium in Rawalpindi?","link":"https://thesportsrush.com/cricket-news-weather-report-rawalpindi-what-is-the-weather-prediction-for-pak-vs-aus-day-3-at-pindi-cricket-stadium-in-rawalpindi/","keywords":["Cricket","Australia tour of Pakistan 2022","Pindi Cricket Stadium","Rawalpindi"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Weather report Rawalpindi: Pakistan have gained a massive advantage after the end of play on Day 2 against Australia in Rawalpindi. On the back of couple of sublime centuries from opening batter Imam-ul-Haq (157 off 358) and senior batter Azhar Ali (185 off 361), Pakistan have bossed the proceedings on the first two days of… The post Weather report Rawalpindi: What is the weather prediction for PAK vs AUS Day 3 at Pindi Cricket Stadium in Rawalpindi? appeared first on The SportsRush.","content":"Weather report Rawalpindi: Pakistan have gained a massive advantage after the end of play on Day 2 against Australia in Rawalpindi. On the back of couple of sublime centuries from opening batter Imam-ul-Haq (157 off 358) and senior batter Azhar Ali (185 off 361), Pakistan have bossed the proceedings on the first two days of the ongoing first Test match against Australia at the Pindi Stadium in Rawalpindi. The duo batted the most of the 162 Overs as Babar Azam’s men dented the spirits of the experienced Australian bowling attack to post a towering score of 476-4 d in their first innings. With mere 16 scheduled Overs left to the end of day’s play, Babar invited Australia to bat for around an hour. With Shaheen Shah Afridi all set bowl with the shiny Red cherry, the two umpires converged to disallow the pacers to operate for the remaining part of the day’s play, owing to poor light. While offbreak bowler Sajid Khan did start off with the Australian innings, the deteriorating light conditions meant that the umpires were forced to call ‘Stumps’ on Day 2 with Australia at 5/0 after one Over. The play on Day 3 is scheduled to commence a touch early, at 9:50 am local time. Just as it looked like our Aussies were in for an exciting finish to day two, bad light struck! Well batted to Azhar Ali and Imam-ul-Haq, now our batters have a great opportunity to cash in too #PAKvAUS pic.twitter.com/UEL0FCq1Tx — Cricket Australia (@CricketAus) March 5, 2022 Weather report Rawalpindi The weather conditions on Day 3 of the ongoing Test match is likely to remain cloudy throughout the day with 100% cloud cover. As per Accuweather, the play is highly likely to begin as per schedule, with no forecast of rain during the morning session. An afternoon shower at around 3 pm is on the cards, with the possibility of rain predicted at around 51% during that period. The chances of rain playing spoilsport reduces down to 23% from thereon, with another spell of rain only predicted around 7 pm, after around an hour post stumps. Thus, the fans might witness a brief halt in the proceedings during the afternoon, but the rain is unlikely to play spoilsport on Day 3 if the forecast is to be believed. The post Weather report Rawalpindi: What is the weather prediction for PAK vs AUS Day 3 at Pindi Cricket Stadium in Rawalpindi? appeared first on The SportsRush.","pubDate":"2022-03-05 18:26:48","full_description":"Weather report Rawalpindi: Pakistan have gained a massive advantage after the end of play on Day 2 against Australia in Rawalpindi. On the back of couple of sublime centuries from opening batter Imam-ul-Haq (157 off 358) and senior batter Azhar Ali (185 off 361), Pakistan have bossed the proceedings on the first two days of the ongoing first Test match against Australia at the Pindi Stadium in Rawalpindi. The duo batted the most of the 162 Overs as Babar Azam’s men dented the spirits of the experienced Australian bowling attack to post a towering score of 476-4 d in their first innings. With mere 16 scheduled Overs left to the end of day’s play, Babar invited Australia to bat for around an hour. With Shaheen Shah Afridi all set bowl with the shiny Red cherry, the two umpires converged to disallow the pacers to operate for the remaining part of the day’s play, owing to poor light. While offbreak bowler Sajid Khan did start off with the Australian innings, the deteriorating light conditions meant that the umpires were forced to call ‘Stumps’ on Day 2 with Australia at 5/0 after one Over. The play on Day 3 is scheduled to commence a touch early, at 9:50 am local time. Just as it looked like our Aussies were in for an exciting finish to day two, bad light struck! Well batted to Azhar Ali and Imam-ul-Haq, now our batters have a great opportunity to cash in too #PAKvAUS pic.twitter.com/UEL0FCq1Tx — Cricket Australia (@CricketAus) March 5, 2022 The weather conditions on Day 3 of the ongoing Test match is likely to remain cloudy throughout the day with 100% cloud cover. As per Accuweather , the play is highly likely to begin as per schedule, with no forecast of rain during the morning session. An afternoon shower at around 3 pm is on the cards, with the possibility of rain predicted at around 51% during that period. The chances of rain playing spoilsport reduces down to 23% from thereon, with another spell of rain only predicted around 7 pm, after around an hour post stumps. Thus, the fans might witness a brief halt in the proceedings during the afternoon, but the rain is unlikely to play spoilsport on Day 3 if the forecast is to be believed.","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Editorial: A sombre farewell to two Australian cricket greats, Shane Warne and Rod Marsh","link":"https://thewest.com.au/opinion/editorial-a-sombre-farewell-to-two-australian-cricket-greats-shane-warne-and-rod-marsh-c-5929643","keywords":null,"creator":null,"video_url":null,"description":"Sometimes it is difficult to comprehend what we hear. Realising that we lost Shane Warne within a day of also farewelling Rod Marsh was one of those moments.","content":null,"pubDate":"2022-03-05 18:00:00","full_description":null,"image_url":"https://images.thewest.com.au/publication/C-5929643/5a9c7ecabccf215ea5c60b75b188c050edac51df-16x9-x1y0w2446h1376.jpg","source_id":"thewest","country":["australia"],"category":["sports"],"language":"english"},{"title":"Shane Warne death: The fight to get Aussie cricket great’s body home from Thailand","link":"https://thewest.com.au/sport/cricket/shane-warne-death-the-fight-to-get-aussie-cricket-greats-body-home-from-thailand-c-5946169","keywords":null,"creator":["Catherine Healey"],"video_url":null,"description":"The battle to get Shane Warne’s body home to Melbourne could hit a snag, with paperwork posing a possible problem.","content":null,"pubDate":"2022-03-05 18:00:00","full_description":"The family of cricket legend Shane Warne want to get his body home to Melbourne as soon as possible, after the spin king tragically suffered a heart attack and died on a boy’s trip to Thailand. But the battle to get the 52-year-old back home could be delayed by the international paperwork process. There’s reports Warne’s family would like an autopsy to be carried out back here in Australia. But for Warne’s body to leave Thailand, an official death certificate needs to be present, which would include a cause of death. Mitchell Johnson Rourke Walsh The documents also need to be written in English or accompanied by a certified translation. According to the police investigation, Warne’s death is not being treated as suspicious. “No foul play was suspected at the scene based on our investigation,” a spokesperson said. Local police have interviewed the friends who desperately tried to revive Warne when he was found unconscious in his hotel room on Friday. Warne’s friend Andrew Neophitou went to check on the 52-year-old when he failed to show for dinner. When he found Warne, he immediately commenced CPR until medical assistance arrived. Despite being transported to a local hospital, the spin king was pronounced dead a short time later. Foreign Minister Marise Payne confirmed Australian officials were in touch with Warne’s travelling party, with arrangements currently being made. “Following advice of Shane Warne’s tragic death overnight, Australian Department of Foreign Affairs and Trade officials have spoken to those travelling with Mr Warne in Thailand,” she said in a statement. “Our officials will arrive in Koh Samui to provide further assistance. “DFAT is working with Thai authorities to confirm arrangements following his passing, assist with his repatriation and provide other assistance on the ground.” It’s believed Warne’s family want answers over whether or not the cricket great’s latest fitness fight contributed to his sudden health decline. Warne had told fans he spent the past 10 days trying to lose weight. “Operation shred has started (10 days in) & the goal by July is to get back to this shape from a few years ago ! Let’s go,” he wrote to his 1.3 million Instagram fans, alongside the hashtags #fitness #healthy and #feelgood. In a positive for Warne’s family, flights are available between Australia and Thailand, despite the COVID pandemic. Warne had been overseas on a three-month break after a long summer of cricket that included commentating on both the Ashes and Big Bash League in Australia.","image_url":"https://images.thewest.com.au/publication/C-5946169/6d44db15f4c5ff88f72a6bb1a931f7e2acc67001-16x9-x1y0w2446h1376.jpg","source_id":"thewest","country":["australia"],"category":["sports"],"language":"english"},{"title":"Imam ul Haq relationship with Inzamam: Are Imam-ul-Haq and Inzamam-ul-Haq related?","link":"https://thesportsrush.com/cricket-news-imam-ul-haq-relationship-with-inzamam-are-imam-ul-haq-and-inzamam-ul-haq-related/","keywords":["Cricket","Australia tour of Pakistan 2022","Imam-ul-Haq","Inzamam-ul-Haq"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Imam ul Haq relationship with Inzamam: Imam had to face multiple accusations of nepotism during his initial days at the Pakistan team. After stumps on Day 2 of the first Test match between Pakistan and Australia at the Pindi Cricket Stadium in Rawalpindi, Pakistan are in a position of massive advantage, courtesy of a strong… The post Imam ul Haq relationship with Inzamam: Are Imam-ul-Haq and Inzamam-ul-Haq related? appeared first on The SportsRush.","content":"Imam ul Haq relationship with Inzamam: Imam had to face multiple accusations of nepotism during his initial days at the Pakistan team. After stumps on Day 2 of the first Test match between Pakistan and Australia at the Pindi Cricket Stadium in Rawalpindi, Pakistan are in a position of massive advantage, courtesy of a strong first innings total. While Day 1 belonged to Pakistan’s opening batter Imam-ul-Haq (157 off 358), who smashed his maiden century in Test Cricket, the second day belonged to Azhar Ali (185 off 361), as the duo batted for most part of the total of 162 Overs to puncture the spirits of the experienced Aussie bowling attack. Batting almost the whole of Day 2 as well, Babar Azam’s men posted 476-4 d in their first innings, forcing the Australian batters now, to play the catch-up game. Imam-ul-Haq’s 157 is the 4th highest score by a Pakistani opener in a Test match against Australia. Loud cheers though when the review showed he was out – the fans want to see Babar batting #PAKvAUS #Cricket — Saj Sadiq (@SajSadiqCricket) March 5, 2022 Imam ul Haq relationship with Inzamam Earlier on Day 1, playing his 12th Test match, Southpaw batter Imam-ul-Haq smashed his maiden Test century to further silence his critics who have been heavily biased to overlook his merit to make it to the Pakistan National team since his debut in 2017. While Imam-ul-Haq is the nephew of former Pakistan batting great Inzamam-ul-Haq, the latter is his paternal uncle. The charges of nepotism not only stems up due to Imam’s relation with Inzamam, but largely because he made it to the Pakistan ODI side when Inzamam was the chief selector at the Pakistan Cricket Board (PCB). The 26-year-old, a couple of years ago, even admitted to have cried for hours in the shower due to the innumerable attacks of trolls and the scores of abuses that were coming his way even before he had made his maiden appearance for Pakistan. However, courtesy his talent and resolve, Imam smashed a century in his maiden ODI against Sri Lanka at Abu Dhabi, to announce his arrival in some style and silence his critics to shame and embarrassment. Moreover, the now 26-year-old became the first player in ODI history to strike four tons in the first nine ODIs, while also went on to become the second-fastest batter to reach the landmark of 1000 ODI runs in mere 19 matches. The post Imam ul Haq relationship with Inzamam: Are Imam-ul-Haq and Inzamam-ul-Haq related? appeared first on The SportsRush.","pubDate":"2022-03-05 17:24:12","full_description":"Imam ul Haq relationship with Inzamam: Imam had to face multiple accusations of nepotism during his initial days at the Pakistan team. After stumps on Day 2 of the first Test match between Pakistan and Australia at the Pindi Cricket Stadium in Rawalpindi, Pakistan are in a position of massive advantage, courtesy of a strong first innings total. While Day 1 belonged to Pakistan’s opening batter Imam-ul-Haq (157 off 358), who smashed his maiden century in Test Cricket, the second day belonged to Azhar Ali (185 off 361), as the duo batted for most part of the total of 162 Overs to puncture the spirits of the experienced Aussie bowling attack. Batting almost the whole of Day 2 as well, Babar Azam’s men posted 476-4 d in their first innings, forcing the Australian batters now, to play the catch-up game. Imam-ul-Haq’s 157 is the 4th highest score by a Pakistani opener in a Test match against Australia. Loud cheers though when the review showed he was out – the fans want to see Babar batting #PAKvAUS #Cricket — Saj Sadiq (@SajSadiqCricket) March 5, 2022 Earlier on Day 1, playing his 12th Test match, Southpaw batter Imam-ul-Haq smashed his maiden Test century to further silence his critics who have been heavily biased to overlook his merit to make it to the Pakistan National team since his debut in 2017. While Imam-ul-Haq is the nephew of former Pakistan batting great Inzamam-ul-Haq, the latter is his paternal uncle. The charges of nepotism not only stems up due to Imam’s relation with Inzamam, but largely because he made it to the Pakistan ODI side when Inzamam was the chief selector at the Pakistan Cricket Board (PCB). The 26-year-old, a couple of years ago, even admitted to have cried for hours in the shower due to the innumerable attacks of trolls and the scores of abuses that were coming his way even before he had made his maiden appearance for Pakistan. However, courtesy his talent and resolve, Imam smashed a century in his maiden ODI against Sri Lanka at Abu Dhabi, to announce his arrival in some style and silence his critics to shame and embarrassment. Moreover, Imam became the first player in ODI history to strike four tons in the first nine ODIs, while also went on to become the second-fastest batter to reach the landmark of 1000 ODI runs in mere 19 matches.","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"}]}