{"newsArray":[{"title":"Aleem Dar receives guard of honour in final Test as ICC Elite Panel umpire","link":"https://www.nation.com.pk/08-Apr-2023/aleem-dar-receives-guard-of-honour-in-final-test-as-icc-elite-panel-umpire","keywords":["Sports, Newspaper"],"creator":["Agencies"],"video_url":null,"description":"MIRPUR - Renowned Pakistani umpire Aleem Dar received a guard of honour after officiating in his last Test match as an ICC Elite Panel umpire during the fixture between Bangladesh and Ireland in Mirpur on Friday.","content":"MIRPUR - Renowned Pakistani umpire Aleem Dar received a guard of honour after officiating in his last Test match as an ICC Elite Panel umpire during the fixture between Bangladesh and Ireland in Mirpur on Friday. Dar’s exit from the elite panel after 19 years was confirmed by the ICC on March 16 in a press release. “Dar has had a long and celebrated career as an international umpire. He made his international debut in 2000 and quickly rose through the ranks, with his sound decisions in matches earning him acclaim from the players and fans,” the ICC said. “Dar was appointed to the ICC International Panel of Umpires in 2002 and officiated at the 2003 ICC Men’s Cricket World Cup in South Africa. Dar continued his rise as he was appointed as a member of the Elite Panel of ICC Umpires in 2004. He was the first Pakistani to be appointed to the Elite Panel,” it added. Dar officiated a total of 438 international matches over the course of his illustrious career. Lauding Dar’s contributions, ICC CEO Geoff Allardice said: “Aleem’s contribution to international cricket and to the ICC has been truly remarkable. Consistently elite performances over such a long period saw him enjoy enormous respect across all involved in international cricket. I wish Aleem all the best for the future and I am sure his involvement in the game will continue for many years to come.” Dar also shed light on his journey as an umpire which included being voted for the ICC Umpire of the Year for three consecutive years between 2009 and 2011. “It has been a long journey, but I have enjoyed every bit of it. I have had the pleasure and honour of umpiring the world over and what I have achieved is something I did not even dream of when I started in the profession,” Dar said. “Though I am still keen to continue as an international umpire, I felt it was now the right time, after 19 years on the road to step away from the Elite panel and provide an opportunity to someone from the International Panel. My message to umpires the world over is to work hard, maintain discipline and never stop learning,” he added.","pubDate":"2023-04-07 23:44:07","image_url":"https://www.nation.com.pk/print_images/large/2023-04-08/aleem-dar-receives-guard-of-honour-in-final-test-as-icc-elite-panel-umpire-1680911036-4967.jpg","source_id":"nation_pk","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"PCB issues notification of Kh Nadeem as LRCA President","link":"https://www.nation.com.pk/08-Apr-2023/pcb-issues-notification-of-kh-nadeem-as-lrca-president","keywords":["Sports, Newspaper"],"creator":["Our Staff Reporter"],"video_url":null,"description":"LAHORE - Pakistan Cricket Board (PCB) has issued the notification of Khawaja Nadeem Ahmad as President of Lahore Region Cricket Association (LRCA).","content":"LAHORE - Pakistan Cricket Board (PCB) has issued the notification of Khawaja Nadeem Ahmad as President of Lahore Region Cricket Association (LRCA). According to the PCB notification, Khawaja Nadeem and Shahid Hamid Butt were elected unopposed as President and Secretary of the LRCA, respectively. In a statement on Friday, Kh Nadeem said that he would take all the stakeholders into confidence to draw up a roadmap for the revival and development of club cricket in Lahore. “My mandate is to take drastic measures to lift club cricket out of gloom as early level cricket has suffered a lot in the last four years. Club cricket is almost on verge of collapse and its main cause is lack of competition and absence of a comprehensive activity to engage youth in quality cricket,” he added. He said his victory in the LRCA elections is a result of unity and coordination between all the three zones, for which they deserve due credit. “I have served Lahore cricket with distinction during my two previous tenures and a significant rise was witnessed in the overall development of club cricket.” Nadeem, who is himself a former first-class cricketer, said that special emphasis was laid on improving existing infrastructure and addition of new grounds in different parts of the city during his two previous tenures. “As a president of LRCA, it will be a great responsibility for me to restart the task from where it was left.” Kh Nadeem said that the three LRCA zones elected the right people for the right job at zones level. “There is a dire need to show similar spirit in the revival of club cricket to re-establish Lahore’s name as the nursery of cricket which produced world class Test captains and cricketers.” He urged all the stakeholders to table useful suggestions on how to make Lahore cricket a quality product and how to tape new talent. “I will be having regular meetings with the officials of all the three zones and office-bearers of LRCA to unfold my vision for the betterment of cricket at grassroots level.” The LRCA president called upon the sponsors to come forward and lend a financial support to LRCA for a collective cause of revival of club cricket, which is going to work again on its basic purpose of producing world champions for Pakistan.","pubDate":"2023-04-07 23:43:17","image_url":"https://www.nation.com.pk/print_images/large/2023-04-08/pcb-issues-notification-of-kh-nadeem-as-lrca-president-1680910979-2529.jpg","source_id":"nation_pk","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"PCB announce team management for New Zealand series","link":"https://www.nation.com.pk/08-Apr-2023/pcb-announce-team-management-for-new-zealand-series","keywords":["Sports, Newspaper"],"creator":["Staff Reporter"],"video_url":null,"description":"LAHORE - The Pakistan Cricket Board (PCB) Friday announced national men’s team management for the upcoming T20I and ODI series against New Zealand.","content":"LAHORE - The Pakistan Cricket Board (PCB) Friday announced national men’s team management for the upcoming T20I and ODI series against New Zealand. Rehan-ul-Haq, the general manager of twotime Pakistan Super League (PSL) champions Islamabad United, has been appointed team manager. New Zealand’s former Test cricketer Grant Bradburn will be the head coach with Abdul Rehman as his assistant. Andrew Puttick will come as batting coach followed by Umar Gul’s extension as bowling coach. Reportedly, the team management has been appointed in the loop with a potential team director in the future, Mickey Arthur. The former head coach of the national team is likely to be confirmed to take up the post after the home New Zealand tour. Bradburn and Puttick have been appointed for the New Zealand series and will arrive in Lahore on 11 April. The PCB will confirm the Pakistan team management for post-New Zealand series following the completion of the relevant recruitment processes, which are presently ongoing. PLAYER SUPPORT PERSONNEL: Rehan Ul Haq (manager), Grant Bradburn (head coach), Abdul Rehman (assistant to head coach), Andrew Puttick (batting coach), Umar Gul (bowling coach), Cliffe Deacon (physiotherapist), DrikusSaaimon (strength and conditioning coach), Talha Ijaz (analyst), Ahsan Iftikhar Nagi (media and digital manager), Major (retd) Azhar Arif (security manager), Ammar Ahsan (videographer), Dr Najeeb Soomro (team doctor) and Malang Ali (masseur)","pubDate":"2023-04-07 23:39:32","image_url":null,"source_id":"nation_pk","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"Abbott gives Hampshire advantage as Crawley puts Kent in control","link":"https://www.skysports.com/cricket/news/12040/12852022/county-championship-kyle-abbott-gives-hampshire-advantage-as-zak-crawley-puts-kent-in-control","keywords":null,"creator":null,"video_url":null,"description":"Kyle Abbott's four-wicket burst put Hampshire on top in their LV= Insurance County Championship clash against Nottinghamshire at the Ageas Bowl.","content":"Kyle Abbott's four-wicket burst put Hampshire on top in their LV= Insurance County Championship clash against Nottinghamshire at the Ageas Bowl. England batter Ben Duckett made a quickfire 51 from 58 balls for the visitors after Hampshire had made 231 to establish a first-innings lead of 46. Duckett and Haseeb Hameed (27) put on 53 for the opening wicket to wipe out the home side's advantage. But Abbott's 4-30, which included three wickets in eight balls, saw newly-promoted Nottinghamshire fall to 146-6, a lead of 100 going into day three. Elsewhere in Division One, Surrey strengthened their grip against Lancashire as Sean Abbott took four wickets at Emirates Old Trafford. Replying to Surrey's 442, in which Cam Steel made an unbeaten 141, his first first-class century since September 2018, Lancashire reached 233-8. Australian paceman Abbott was responsible for most of the damage, finishing with 4-42 and taking two catches. County Championship Division One table County Championship Division Two table Domestic cricket fixtures The quick cricket column Keaton Jennings battled his way to 76 and Lancashire's best hope of avoiding the follow-on target rests with Colin de Grandhomme, who is unbeaten on 29. Wickets fell at regular intervals at Lord's as Middlesex were dismissed for 170, 96 short of Essex's first-innings 266. After Toby Roland-Jones' seven-wicket haul for Middlesex, Jamie Porter wrecked the home side's middle order. Porter, operating in tandem with seam partner Sam Cook, ended the day with 6-35 and looked virtually unplayable as the pair ripped out Middlesex's first four batters - all for ducks. Middlesex were reduced to a perilous 4-4, but Ryan Higgins (70) and John Simpson (63) oversaw a spirited recovery with their sixth-wicket stand of 127. Zak Crawley's 91 from 171 balls gave Kent the edge against Northamptonshire at Canterbury. The visitors were reduced to 47-2 in their second innings, still trailing by 58 at stumps after the hosts secured a first-innings advantage of 105. Chris Tremain took 5-44 and Jack White 4-57 as Kent were all out for 222, while earlier Matt Quinn took four for 24 as Northamptonshire were bowled out for 117 in their first innings. The Somerset-Warwickshire game finally got under way after the opening day at Taunton had been wiped out because of a wet pitch. Somerset were 269-8 at the close as acting skipper Lewis Gregory top-scored with an unbeaten 65 from 105 balls. Gregory's recovery powers were needed as Somerset slumped to 136-7 shortly after tea, with Ed Barnard (3-54), and Hasan Ali (2-62). Josh Davey (42) and Gregory shared an entertaining eighth-wicket partnership of 105 in 25.1 overs. England white-ball star Dawid Malan made a hundred for Yorkshire against Leicestershire in Division Two. Malan's 154-ball 132, adding to his previous scores of 219, 199 and 152 at Headingley since the start of 2020, helped Yorkshire to 517 all out. Nightwatcher Matt Milnes also contributed 75 on debut and number nine batter Dom Bess made 49 before Leicestershire scored 201-5 in reply. Colin Ackermann (67) and Peter Handscomb (62 not out) provided stiff resistance. Cheteshwar Pujara scored his sixth hundred in only his ninth game for Sussex to frustrate Durham. The 35-year-old India batter, who has taken over as captain at Hove this season, dominated Sussex's reply to Durham's 376 all out with 115. Oli Carter was the next highest scorer with 41 as Sussex closed on 332-9, 54 adrift. Jack Haynes and Brett D'Oliveira led the Worcestershire fightback against Derbyshire. Skipper D'Oliveira scored an unbeaten 87 and Haynes made 62 as Worcestershire reached 331-6, a lead of 10 runs after Derbyshire had earlier made 321. Glamorgan built a commanding lead of 223 against Gloucestershire in Cardiff after closing day two on 388-8. Kiran Carlson (106) and Billy Root (104) made centuries as Marchant de Lange returned figures of 3-72 against his old club.","pubDate":"2023-04-07 19:42:00","image_url":"https://e1.365dm.com/23/04/1920x1080/skysports-kyle-abbott-hampshire_6114491.jpg?20230407205307","source_id":"skysports","category":["sports"],"country":["australia","united kingdom","united states of america"],"language":"english"},{"title":"Coach Pandit hails Kolkata’s sensational knight Suyash","link":"https://thenorthlines.com/coach-pandit-hails-kolkatas-sensational-knight-suyash/","keywords":["Cricket","India","Sports"],"creator":["Northlines"],"video_url":null,"description":"Agencies   Kolkata Knight Riders coach Chandrakant Pandit was happy with rookie spinner Suyash Sharma's “fighting attitude”, saying it was very difficult for rival batters to pick the lad. The 19-year-old from Delhi made a huge impact on his debut IPL game against Royal Challengers Bangalore, picking up the prize wickets of pinch-hitter Dinesh Karthik, […] The post Coach Pandit hails Kolkata’s sensational knight Suyash appeared first on Northlines.","content":"Agencies Kolkata Knight Riders coach Chandrakant Pandit was happy with rookie spinner Suyash Sharma's “fighting attitude”, saying it was very difficult for rival batters to pick the lad. The 19-year-old from Delhi made a huge impact on his debut IPL game against Royal Challengers Bangalore, picking up the prize wickets of pinch-hitter Dinesh Karthik, Anuj Rawat and tail-ender Karn Sharma as KKR thrashed Faf du Plessis's side by 81 runs on Kolkata on Thursday night. “We have seen him (Suyash) at trial matches. He is very quick in the air and it's very tough to pick him. It's just the inexperience; but he showed a fighting attitude,” said Pandit after the match. The former India wicketkeeper-batter also complimented his batters for showing the courage to fight back and post a 200-plus total after they were down and out at 89 for 5, with Shardul Thakur smashing a 29-ball 68. “It's a good win. The boys have shown the character. Looking at the initial stage, having lost wickets and coming back to get 200-plus. We just expected the pitch to help the spinners, but you require enough runs. Shardul and Rinku Singh (46 off 33) counter-attacked the opposition,” added Pandit. KKR captain Nitish Rana said the plan was to put pressure on the rival batters in the middle overs and Suyash was handy. “Even today, we collapsed (to 5/89), and credit to (Rahmanullah) Gurbaz (57 off 44 balls). It was an unbelievable innings from Shardul Thakur. People will talk about Shardul, but Rinku (Singh) held one end up, as we had planned. “We had always planned not to give RCB's batters pace in the middle overs. Suyash, playing his first match, bowled brilliant balls. Not even we have got to know him so far. He backs himself. It was always our plan to add him if we needed a third spinner,” added Rana. ‘Player of the Match' Shardul himself was surprised with the power he packed in his strokes while smashing nine boundaries and three sixes. “Even I don't know where it came from. Looking at the scorecard, everyone would have said we were struggling. But your subconscious mind takes over. You also have to have skills to do that at the higher level, but we also work hard in the nets. “Coaching staff do the throw downs, and give us the option of range-hitting. And you know the pitches; they always suit the batsmen, don't they? This was a perfect day.” RCB captain Du Plessis said his side lost the plot after keeping the KKR batters under pressure till the 13th over. He also indicated that his batters need to improve against quality spinners. “We had it set up there in the 12th or 13th over… It was probably 20-25 runs too much. Shardul played well. Their leg-spinners got on top of us. It was still a good wicket… but the nature of mystery spinners is that they get wickets. They put the squeeze on us. “We were pretty average with the bat. You learn lessons. Two or three days ago, you played brilliant cricket . It got away from us,” added the South African.","pubDate":"2023-04-07 18:35:51","image_url":null,"source_id":"thenorthlines","category":["sports"],"country":["india"],"language":"english"},{"title":"Will BCCI get tax exemption for 2023 World Cup?","link":"https://thenorthlines.com/will-bcci-get-tax-exemption-for-2023-world-cup/","keywords":["Cricket","India","Sports"],"creator":["Northlines"],"video_url":null,"description":"Agencies   The BCCI will set the ball rolling for the sale of the media rights for bilateral cricket at home and commence the process to appoint the head coach of Indian women's cricket team at its Apex Council meeting on Sunday. After the Rs 48,390 crore windfall from the IPL media rights, the BCCI […] The post Will BCCI get tax exemption for 2023 World Cup? appeared first on Northlines.","content":"Agencies The BCCI will set the ball rolling for the sale of the media rights for bilateral cricket at home and commence the process to appoint the head coach of Indian women's cricket team at its Apex Council meeting on Sunday. After the Rs 48,390 crore windfall from the IPL media rights, the BCCI will have high expectations for the home season rights for 2023-2027 cycle. With the entry of Viacom in Indian cricket's ecosystem, it will be a three-way battle between them, Star and Sony. The BCCI reaped huge benefits from selling the broadcast and digital rights separately for the IPL and it is expected to follow that for the international games at home. Star had paid Rs 6,138.1 crore for the previous cycle which ended on March 31. The Indian women's cricket team played the recent T20 World Cup in South Africa without a head coach. Batting coach Hrishikesh Kanitkar had taken charge of the team following the sacking of head coach Ramesh Powar in December. As the subject finds a mention on the Apex Council agenda, the BCCI will soon invite applications for the support staff including the head coach position. India had yet again come up short in a knockout game at the ICC event in February, losing to eventual champions Australia in the semi-finals. The host nation is required to get tax exemption from the government for hosting tournaments organised by the International Cricket Council. However, India's tax rules don't allow such exemptions though the BCCI is pushing for a win win solution in its talks with the government. The board could lose as much as Rs 955 crore if the government sticks to its decision to levy 21.84 percent tax surcharge on ICC's broadcast revenue from the 2023 ODI World Cup. The other items on agenda include ratification of player contracts, revised travel policy of BCCI officials and domestic schedule for 2023-2024 season. With Byju's jersey sponsorship coming to a premature end, the BCCI will also have to look for a replacement. Adidas is set to be Indian's team kit sponsor replacing KKCL, maker of Killer jeans.","pubDate":"2023-04-07 18:35:08","image_url":null,"source_id":"thenorthlines","category":["sports"],"country":["india"],"language":"english"},{"title":"Suryakumar can win India ODI World Cup: Ponting","link":"https://thenorthlines.com/suryakumar-can-win-india-odi-world-cup-ponting/","keywords":["Cricket","India","Sports"],"creator":["Northlines"],"video_url":null,"description":"Agencies   Australian batting great Ricky Ponting feels Suryakumar Yadav has the ability to ‘win' the ODI World Cup for India and the selectors should stick to him despite his woeful run in 50-overs cricket. The T20 batting sensation is yet to recreate his magic in One-Day Internationals, and in the recent three-match ODI series […] The post Suryakumar can win India ODI World Cup: Ponting appeared first on Northlines.","content":"Agencies Australian batting great Ricky Ponting feels Suryakumar Yadav has the ability to ‘win' the ODI World Cup for India and the selectors should stick to him despite his woeful run in 50-overs cricket . The T20 batting sensation is yet to recreate his magic in One-Day Internationals, and in the recent three-match ODI series against Australia he became the first Indian batter to register a hat-trick of golden ducks. “Everyone around the world knows what Surya can do in white-ball cricket,” Ponting said on ICC Review. “His previous 12 or 18 months have been absolutely outstanding. I feel they should stick with him because he's the sort of player that can win you a World Cup,” he added. Suryakumar has scored 172 runs in the format at an average of just 12.28 since his last fifty in February last year. But the former Australia skipper firmly backed the Indian batter, and said he could do what the late Andrew Symonds did in winning the 2003 and 2007 World Cups under his captaincy. “He might be a little bit inconsistent but he's the sort of guy that in big moments can win you games. A bit like the late great Andrew Symonds did for Australia,” Ponting said. “So that's definitely the way that I'd look at it for India. I wouldn't be playing safe. I'd be going with match-winning players and I think he's a match-winner.” Ponting believes the number five spot is best suited for Suryakumar. “I'm a big believer in giving your best batter as much time as you can in all formats of the game. Because if you keep them down the order, quite often you don't get to use your best players and that's the last thing you want. “So I think the No. 5 slot's perfect for him and he's just got to grow into that role there.” Ponting further spoke on Team India combination and said in the absence of the flamboyant Rishabh Pant, KL Rahul will be the preferred choice to don the gloves. Pant will miss the marquee-event as he recovers from a horrible car crash last December. KL Rahul had kept the wickets in the ODIs against Australia. “Look, I do think they'll stick with him (Rahul). I think in their World Cup squad, KL will definitely be there.” However, Ponting said the young Ishan Kishan, being a left-hander, would be in the mix as the Indian top-order is full of right-handers. “With Rishabh not being there now, they might think of maybe wanting to play a specialist left-handed batter in the middle order which I think would have to be Ishan Kishan in some role, whether that's at No. 4 or No. 5.” “Just to negate teams that have got left-arm off-spin because when you look at the spinners around the world now, there are very few right-arm off-spinners in ODIs and T20Is.","pubDate":"2023-04-07 18:33:51","image_url":null,"source_id":"thenorthlines","category":["sports"],"country":["india"],"language":"english"},{"title":"GRAEME SOUNESS: Harry Kane is a very fine player but goes down far too readily","link":"https://www.dailymail.co.uk/sport/football/article-11949971/GRAEME-SOUNESS-Harry-Kane-fine-player-goes-far-readily.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"GRAEME SOUNESS: Let's get it right. When you lift your hands in football now, you've a got a real chance of getting sent off. But Harry exaggerated the incident enormously","content":"GRAEME SOUNESS: Seeing England's captain embarrass himself by cheating reminds us we've lost what made our game so special - Harry Kane is a very fine player but goes down far too readily and exaggerated the incident with Abdoulaye Doucoure Harry Kane exaggerated his clash with Abdoulaye Doucoure enormously The term simulation shows how our game has changed enormously these days Going back a number of years, players didn’t want to show they had been hurt By Graeme Souness for MailOnline Published: 13:00 EDT, 7 April 2023 | Updated: 14:32 EDT, 7 April 2023 e-mail 177 shares 17 View comments I was recently having dinner with a friend of mine and two Dutch guys he knows, when I was reminded of a way our game has changed and something it’s lost. Halfway through our meal, one of the Dutch pair asked me: ‘What happened to the English game?’ and of course I asked him what he meant. ‘Well, everyone throws themselves to the ground now, don’t they?’ he said. ‘You’d think they’d been cut in half.’ I’d never met these people before but it was clear to me that they had always loved what makes English football distinctive. I was reminded of our conversation this week when I saw Harry Kane going down like he’d been hit by a train , rather than a push in his face, from Abdoulaye Doucoure, at Goodison Park. Let’s get it right. When you lift your hands in football now, you’ve a got a real chance of getting sent off. But Harry exaggerated the incident enormously and however much he might claim he wasn’t trying to deceive the referee into getting a fellow professional sent off, his conduct was more embarrassing for himself than anything else. We are talking about the captain of England. That role carries enormous responsibility to lead by example and set a standard. Abdoulaye Doucoure of Everton raised his hand to the face of Tottenham striker Harry Kane Kane though appeared to overreact as he went down to the ground holding his face The incident resulted in the referee showing a red card to Doucoure on Monday night This is how our game has changed dramatically. Going back a number of years, players didn’t want to show they had been hurt. It was a matter of professional pride that they didn’t want to show a weakness to an opponent, however much pain they were in. Now it’s the exact opposite. Players want to go down and hopefully get someone booked. Harry Kane is a very fine player but I have to say he does this far too readily. Part of the problem is the way we now dress this conduct up. ‘Simulation’ is the word commentators and pundits use. Well, let’s look that word up in the dictionary. Mine says simulation is ‘the action of pretending; deception.’ So let’s start using the proper vocabulary, shall we? Let’s start saying: ‘He deceived the referee.’ That suddenly doesn’t sound very good any more, does it? There’s other fancy terminology that people are using about this unpleasant side of our game. I was in a TV studio with Micah Richards when he said: ‘He’s bought a foul.’ I asked: ‘What does that mean, then? “Buying a foul.” You mean, “He cheats?” ’ I think that one related to Jack Grealish. I was — by the way — really impressed with Jack against Liverpool last weekend. It wasn’t what he did with the ball, but without it, that impressed me and he looks like he’s turned a corner. But Jack is another one who is full of those acts of deception. Jack Grealish is another England international who can also benefit from gamesmanship Largely empty stadiums during Covid helped expose players that were overreacting I hear excuses for them all the time. ‘Everyone else does it.’ Or: ‘It’s part of the game.’ Or: ‘Winners find any competitive advantage.’ What unadulterated rubbish. Trying to cheat a foul from the referee is bad enough — but actually trying to get a fellow pro booked or sent off the field? How despicable is that? The cheating was exposed for what it actually is during Covid, because there were no people in the stadiums. To a man, players screamed and all their team-mates raised their hands as if there had been an act of GBH. But crowds drown out the squealing. Take my word for it: when you are a player on the pitch, you know when a really serious tackle has gone in. Graeme Souness writes for Sportsmail We are British. We’ve always been different in our football. We’ve always felt that our sport adheres to a certain code. What was that old term? ‘It’s not cricket.’ It meant we don’t transgress a code about decency and fairness. If you surveyed a group of fans, I think 100 per cent would feel exactly the same. I think the Premier League should be demanding that this behaviour is dealt with and putting referees on notice to stamp it out, before the entire identity of our game is destroyed. Our league was once the envy of the world but because of this blight — this deceit — it is losing its uniqueness. When I dealt with the subject in the book I wrote five years ago, the chapter was titled ‘Handle with Care’ — because I was concerned that we risked stripping away something core to our game. The sight of Harry Kane crashing to the turf the other night suggests that we’re still doing far too little to deal with the problem. No shame in being sacked, how you deal with it is key You won't find me voicing anger about the fact that 12 Premier League managers have lost their jobs this season. There's a trade-off. Managers get paid incredible amounts of money today to do the job and they're scrutinised like never before. But that doesn't mean I don't look at some of these young guys and feel a great deal of empathy for them. A run of 10 bad games is all it takes these days. Ten games could be six weeks. Just one bad cycle and you lose your job. That's what these young guys live with. They will go to bed every night thinking about that and if they are anything like I was as a manager, they will retreat within themselves when things aren't going right. I would go quiet around the house and start to close down. When it's going well, you're an open book. You're everyone's friend. When it's not, you retreat. You start becoming suspicious. You say very little. Ralph Hasenhuttl (left) and Patrick Vieira (right) are among 12 managers sacked this season Brendan Rodgers (left) and Graham Potter (right) have also been axed - but it is about how all of these discarded Premier League managers respond when they return to the dugout As a manager, I took a lot of wisdom from someone older than me from outside of the game: a guy called Gordon Brooks, who was an accountant I'd got to know from my time at Middlesbrough. He had a broader perspective and offered up advice which was generally spot on over the years. I remember him once telling me over dinner: 'You know, not everyone could do your job?' At the time, that hadn't registered with me at all. You forget the skills you do have when everyone's questioning you. Speaking to someone from the outside who'd been through the mill and succeeded in life did help. But if I was advising a young manager who'd lost his job, I would be saying that there's no shame attached to not being successful at one club, these days. After all, disappointments in life - and how you deal with them - determine what kind of individual you become. With a bit of luck, Frank will keep Chelsea job I've always felt you need your fair share of luck in management and I do think the stars have aligned for Frank Lampard at Chelsea. He's arriving back at the club at an incredibly good time, because slowly but surely the new buys there are starting to grasp the nettle and show what is needed to succeed at a top Premier League side. Their football is good enough to win games. The team lacks only one key ingredient - a centre forward. Frank Lampard has returned to take over at Chelsea as interim boss until the end of the season I think Frank will get this group winning football matches again. In his previous incarnation as Chelsea manager he got a punch on the nose and he will be richer from that experience. Foreign managers are always in fashion. The latest is Julian Nagelsmann. But it's more than possible that Frank will improve results at the club and if that happens, he would certainly deserve the chance to manage there permanently. Personally, I would love to see that and it would also be very good to see a British manager in one of our top jobs. We all know what Napoleon said about wanting 'lucky generals'. I believe this is a very good appointment. Share or comment on this article: GRAEME SOUNESS: Harry Kane is a very fine player but goes down far too readily e-mail 177 shares Add comment Comments 17 Share what you think Newest Oldest Best rated Worst rated View all The comments below have been moderated in advance. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-04-07 18:32:21","image_url":"https://i.dailymail.co.uk/1s/2023/04/07/17/69599767-0-image-a-10_1680886603615.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"IPL 2023: A Giant(s) leap to the top","link":"https://indianexpress.com/article/sports/ipl/ipl-2023-lucknow-super-giants-vs-sunrisers-hyderabad-match-report-8544768/","keywords":["IPL 2023","Sports"],"creator":["Rahul Pandey"],"video_url":null,"description":null,"content":"Synopsis: LSG’s spinners knock out SRH batsmen before scratchy Rahul and confident Pandya orchestrate chase On a surface that was more in sync with the Border-Gavaskar Trophy, Lucknow Super Giants eviscerated Sunrisers Hyderabad. The surface, layered in black soil, was slow and low and abetted the trio of Lucknow’s spinners—Krunal Pandya. Amit Mishra and Ravi Bishnoi—whose combined figures read 12-0-67-6. Restricting the visitors to 121, they overhauled the target without much ado. Spin treat Recommended for you 1 IPL 2023: Moeen Ali says MI-CSK rivalry is like that between Manchester United and Liverpool 2 IPL 2023, LSG vs SRH emotional rollercoaster: Harry Brook’s struggles, stubborn stumps, no place for specialist keepers & first over specialist Kyle Mayers Right from the first delivery Kyle Mayers bowled, it was evident that slower bowlers held the keys on this surface. Krunal Pandya was introduced as early as the third over, and a wicket came off his fifth delivery of the night. Tossed up and slow, Mayank Agarwal looked to chip it over cover but played it too early and handed a catch to Marcus Stoinis in the ring. A soft dismissal rather. It was not one of those pitches where you could just thrust your front-foot and drive; it was not one where you could hang back and work the ball through the leg-side. It was where you needed quick feet and hands, besides a quicker brain to score runs. A low stooping stance too could have benefitted. Just when Rahul Tripathi and Anmolpreet Singh seemed to have cracked the code, Pandya struck twice off two balls. A flatter one that was angled trapped Anmolpreet in front, which on review turned out to be an umpire’s call lbw dismissal. The next ball, a bit more tossed up, spun away from a driving Aiden Markram to hit the off-stump. Krunal Pandya on song here! Picks up two key wickets in as many deliveries. Anmolpreet Singh and Aiden Markram depart. Live – https://t.co/7Mh0bHCrTi #TATAIPL #LSGvSRH #IPL2023 pic.twitter.com/33W5Uf4Gpv — IndianPremierLeague (@IPL) April 7, 2023 After Pandya completed his second best figures (3/18) in this format, Ravi Bishnoi grabbed a moment of his own in the next over with a composed four-ball setup to remove Harry Brooks. Googly, googly, googly, and a leg-break. He was stumped. “It was difficult to play standstill on this wicket, I knew he’d step out,” Bishnoi would reveal the recipe post-innings. In stepped the second most successful spinner in the league’s history, Amit Mishra . It’s 2023, he turned 40 last year, yet remains an influential figure. It seemed he has only become agiler as he pounced on a low catch inside the 30-yard circle to eject Rahul Tripathi. His 167th and 168th IPL dismissals came in the penultimate over as Hyderabad attempted to bow out big. Washington Sundar ’s first aggressive shot of the innings off a tossed up delivery went straight to Deepak Hooda at long-on. A delivery later, Adil Rashid advanced down but was unable to clear the longer straight boundary. Lucknow mentor Gautam Gambhir had suggested at the IPL auction that the Impact Player brought about the opportunity for the likes of Mishra to feature more in the league. On Friday, the team clearly knew the wicket they were playing on as they started off with the 40-year-old and subbed him for Ayush Badoni. Brisk start Advertisement The target of 122 was never going to be daunting, and LSG openers KL Rahul and Kyle Mayers went about methodically, compiling 35 runs in 4.5 overs. Though the in-form Mayers perished to Fazalhaq Farooqi and Bhuvneshwar Kumar took out Deepak Hooda with a stunning left-handed return catch, the target was never going to intimidate LSG. Nicholas Pooran finishes things off in style. @LucknowIPL chase down the target with 4 overs to spare as they beat #SRH by 5 wickets. Scorecard – https://t.co/7Mh0bHCrTi #TATAIPL #LSGvSRH #IPL2023 pic.twitter.com/STXF5KLMuI — IndianPremierLeague (@IPL) April 7, 2023 To Rahul’s support came Pandya, bubbling with the confidence of three wickets. With Rahul, he combined 55 relatively risk-free 55 runs. Pandya’s contribution was 34, off 23 balls, but by the time he departed the chase was almost sewn up, LSG requiring just 22 runs from 46 balls. Scratchy Rahul Also Read 'I told him over the phone': Ashish Nehra reveals how Gujarat Titans appo... IPL 2023 Live Streaming Details: How to watch IPL matches live online and... MS Dhoni unlikely to play IPL opener due to injury IPL 2022: Rinku Singh, who nearly became a sweeper, wins it for KKR Coming into the IPL this season, KL Rahul was under the scanner more so than he has been in the previous editions. Following the T20 World Cup elimination last year, Rahul was among the senior players dropped from India’s shortest format team in the bilaterals that followed. A woeful run with the bat and a vice-captaincy snub midway through the Test series against Australia earlier this year further cast a shadow over his role in Indian cricket. The conditions were tough but the @LucknowIPL Captain stood tall in the chase. @klrahul becomes our Top Performer from the second innings. A look at his batting summary 👇 #TATAIPL #LSGvSRH pic.twitter.com/NaZEl0R39K — IndianPremierLeague (@IPL) April 7, 2023 A 12-ball-eight and an 18-ball-20 in the first two games of this IPL didn’t help his case. With just eight runs left to win and having spent a considerable time in the middle (35 off 31), the Lucknow captain was unable to cap off the game. And of all the strokes, a reverse sweep undid him. The ball from Adil Rashid landed around the middle stump, held the line and crawled underneath his swipe to trap him in front. A Romario Shepherd first ball duck followed but the late scare came a little too late for Hyderabad to capitalise upon as Nicholas Pooran and Marcus Stoinis wrapped up the game with five wickets and 24 deliveries in hand.","pubDate":"2023-04-07 18:26:26","image_url":null,"source_id":"indianexpress","category":["sports"],"country":["india"],"language":"english"},{"title":"मुंबई के खिलाफ भिड़ने से पहले CSK के ऑलराउंडर का बड़ा बयान, बढ़ गया मुकाबले का रोमांच","link":"https://www.indiatv.in/sports/cricket/ipl-2023-mi-vs-csk-is-like-man-united-vs-liverpool-moeen-ali-2023-04-07-949899","keywords":null,"creator":null,"video_url":null,"description":"सीएसके के ऑलराउंडर ने मुंबई इंडियंस के खिलाफ मुकाबले से पहले बड़ा बयान दिया है।","content":"आईपीएल 2023 के 12वें मुकाबले में चेन्नई सुपर किंग्स के सामने सबसे बड़ी दुश्मन माने जाने वाली मुंबई इंडियंस की टीम होने वाली है। ये दोनों ही टीमें पिछले कई सालों से जब भी एक दूसरे के सामने आती हैं तो मुकाबला देखने लायक होता है। वहीं इस मैच पर शुक्रवार को फिर एक बार क्रिकेट फैंस की नजरें टिकी रहेंगी। लेकिन इसी बीच सीएसके के एक ऑलराउंडर ने इस मैच को लेकर बड़ा बयान दिया है। सीएसके के ऑलराउंडर मोईन अली ने शुक्रवार को अपनी टीम और आईपीएल का खिताब रिकॉर्ड पांच बार जीतने वाली मुंबई इंडियंस के बीच कड़ी प्रतिस्पर्धा की तुलना मैनचेस्टर यूनाइटेड और लिवरपूल की फुटबॉल प्रतिद्वंद्विता से की। मुंबई इंडियंस आईपीएल इतिहास की सबसे सफल टीम जबकि चेन्नई सुपरकिंग्स चार खिताब के साथ दूसरे नंबर पर है। साल 2022 में आईपीएल की बड़ी नीलामी के बाद बाद से दोनों टीमें संघर्ष कर रही हैं। मुंबई और चेन्नई की आईपीएल प्रतिद्वंद्विता को आईपीएल की ‘एल क्लासिको’ के नाम से जाना जाता है। दोनों टीमों के बीच 34 मुकाबलों में हालांकि 20 जीत के साथ मुंबई का पलड़ा भारी रहा है। मोईन ने मैच से पहले कहा कि यह एक ऐसा मुकाबला है जिसका मैं वास्तव में इंतजार कर रहा हूं। ये दो सबसे सफल फ्रेंचाइजी टीमों का मुकाबला हैं और दोनों के फैंस की संख्या बहुत ज्यादा है। एक क्रिकेटर के रूप में यह अंतरराष्ट्रीय क्रिकेट के बाहर खेले जाने वाले सबसे बड़े मैचों में से एक है। उन्होंने कहा कि अगर फुटबॉल के नजरिए से देखे तो यह मैच मैनचेस्टर यूनाइटेड और लिवरपूल के मुकाबले की तरह है। ये मुकाबले काफी बड़े होते हैं। उन्होंने चोट से वापसी के बाद लय पाने के लिए संघर्ष कर रहे टीम के मुख्य तेज गेंदबाज दीपक चाहर का बचाव करते हुए कहा कि मुझे लगता है कि उनके पास सिर्फ एक चीज की कमी है और वह है मैच में समय देने की। उसे बुरी तरह चोट लगी थी और वह लंबे समय बाद वापसी कर रहा हैं। एक गेंदबाज के तौर पर आपको मैच में लगातार गेंदबाजी करने की जरूरी होती है। वह टूर्नामेंट के आगे बढ़ने के साथ बेहतर होता जाएगा। उन्होंने कहा कि वह हमारी टीम का बड़ा गेंदबाज है और जब वह लय में रहता है तो पावरप्ले में तीन या चार विकेट निकाल लेते है।","pubDate":"2023-04-07 18:17:20","image_url":null,"source_id":"indiatv","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Aleem Dar receives guard of honour in final Test as ICC Elite Panel umpire","link":"https://www.nation.com.pk/08-Apr-2023/aleem-dar-receives-guard-of-honour-in-final-test-as-icc-elite-panel-umpire","keywords":["Sports, Newspaper"],"creator":["Agencies"],"video_url":null,"description":"MIRPUR - Renowned Pakistani umpire Aleem Dar received a guard of honour after officiating in his last Test match as an ICC Elite Panel umpire during the fixture between Bangladesh and Ireland in Mirpur on Friday.","content":"MIRPUR - Renowned Pakistani umpire Aleem Dar received a guard of honour after officiating in his last Test match as an ICC Elite Panel umpire during the fixture between Bangladesh and Ireland in Mirpur on Friday. Dar’s exit from the elite panel after 19 years was confirmed by the ICC on March 16 in a press release. “Dar has had a long and celebrated career as an international umpire. He made his international debut in 2000 and quickly rose through the ranks, with his sound decisions in matches earning him acclaim from the players and fans,” the ICC said. “Dar was appointed to the ICC International Panel of Umpires in 2002 and officiated at the 2003 ICC Men’s Cricket World Cup in South Africa. Dar continued his rise as he was appointed as a member of the Elite Panel of ICC Umpires in 2004. He was the first Pakistani to be appointed to the Elite Panel,” it added. Dar officiated a total of 438 international matches over the course of his illustrious career. Lauding Dar’s contributions, ICC CEO Geoff Allardice said: “Aleem’s contribution to international cricket and to the ICC has been truly remarkable. Consistently elite performances over such a long period saw him enjoy enormous respect across all involved in international cricket. I wish Aleem all the best for the future and I am sure his involvement in the game will continue for many years to come.” Dar also shed light on his journey as an umpire which included being voted for the ICC Umpire of the Year for three consecutive years between 2009 and 2011. “It has been a long journey, but I have enjoyed every bit of it. I have had the pleasure and honour of umpiring the world over and what I have achieved is something I did not even dream of when I started in the profession,” Dar said. “Though I am still keen to continue as an international umpire, I felt it was now the right time, after 19 years on the road to step away from the Elite panel and provide an opportunity to someone from the International Panel. My message to umpires the world over is to work hard, maintain discipline and never stop learning,” he added.","pubDate":"2023-04-07 23:44:07","image_url":"https://www.nation.com.pk/print_images/large/2023-04-08/aleem-dar-receives-guard-of-honour-in-final-test-as-icc-elite-panel-umpire-1680911036-4967.jpg","source_id":"nation_pk","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"PCB issues notification of Kh Nadeem as LRCA President","link":"https://www.nation.com.pk/08-Apr-2023/pcb-issues-notification-of-kh-nadeem-as-lrca-president","keywords":["Sports, Newspaper"],"creator":["Our Staff Reporter"],"video_url":null,"description":"LAHORE - Pakistan Cricket Board (PCB) has issued the notification of Khawaja Nadeem Ahmad as President of Lahore Region Cricket Association (LRCA).","content":"LAHORE - Pakistan Cricket Board (PCB) has issued the notification of Khawaja Nadeem Ahmad as President of Lahore Region Cricket Association (LRCA). According to the PCB notification, Khawaja Nadeem and Shahid Hamid Butt were elected unopposed as President and Secretary of the LRCA, respectively. In a statement on Friday, Kh Nadeem said that he would take all the stakeholders into confidence to draw up a roadmap for the revival and development of club cricket in Lahore. “My mandate is to take drastic measures to lift club cricket out of gloom as early level cricket has suffered a lot in the last four years. Club cricket is almost on verge of collapse and its main cause is lack of competition and absence of a comprehensive activity to engage youth in quality cricket,” he added. He said his victory in the LRCA elections is a result of unity and coordination between all the three zones, for which they deserve due credit. “I have served Lahore cricket with distinction during my two previous tenures and a significant rise was witnessed in the overall development of club cricket.” Nadeem, who is himself a former first-class cricketer, said that special emphasis was laid on improving existing infrastructure and addition of new grounds in different parts of the city during his two previous tenures. “As a president of LRCA, it will be a great responsibility for me to restart the task from where it was left.” Kh Nadeem said that the three LRCA zones elected the right people for the right job at zones level. “There is a dire need to show similar spirit in the revival of club cricket to re-establish Lahore’s name as the nursery of cricket which produced world class Test captains and cricketers.” He urged all the stakeholders to table useful suggestions on how to make Lahore cricket a quality product and how to tape new talent. “I will be having regular meetings with the officials of all the three zones and office-bearers of LRCA to unfold my vision for the betterment of cricket at grassroots level.” The LRCA president called upon the sponsors to come forward and lend a financial support to LRCA for a collective cause of revival of club cricket, which is going to work again on its basic purpose of producing world champions for Pakistan.","pubDate":"2023-04-07 23:43:17","image_url":"https://www.nation.com.pk/print_images/large/2023-04-08/pcb-issues-notification-of-kh-nadeem-as-lrca-president-1680910979-2529.jpg","source_id":"nation_pk","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"PCB announce team management for New Zealand series","link":"https://www.nation.com.pk/08-Apr-2023/pcb-announce-team-management-for-new-zealand-series","keywords":["Sports, Newspaper"],"creator":["Staff Reporter"],"video_url":null,"description":"LAHORE - The Pakistan Cricket Board (PCB) Friday announced national men’s team management for the upcoming T20I and ODI series against New Zealand.","content":"LAHORE - The Pakistan Cricket Board (PCB) Friday announced national men’s team management for the upcoming T20I and ODI series against New Zealand. Rehan-ul-Haq, the general manager of twotime Pakistan Super League (PSL) champions Islamabad United, has been appointed team manager. New Zealand’s former Test cricketer Grant Bradburn will be the head coach with Abdul Rehman as his assistant. Andrew Puttick will come as batting coach followed by Umar Gul’s extension as bowling coach. Reportedly, the team management has been appointed in the loop with a potential team director in the future, Mickey Arthur. The former head coach of the national team is likely to be confirmed to take up the post after the home New Zealand tour. Bradburn and Puttick have been appointed for the New Zealand series and will arrive in Lahore on 11 April. The PCB will confirm the Pakistan team management for post-New Zealand series following the completion of the relevant recruitment processes, which are presently ongoing. PLAYER SUPPORT PERSONNEL: Rehan Ul Haq (manager), Grant Bradburn (head coach), Abdul Rehman (assistant to head coach), Andrew Puttick (batting coach), Umar Gul (bowling coach), Cliffe Deacon (physiotherapist), DrikusSaaimon (strength and conditioning coach), Talha Ijaz (analyst), Ahsan Iftikhar Nagi (media and digital manager), Major (retd) Azhar Arif (security manager), Ammar Ahsan (videographer), Dr Najeeb Soomro (team doctor) and Malang Ali (masseur)","pubDate":"2023-04-07 23:39:32","image_url":null,"source_id":"nation_pk","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"Abbott gives Hampshire advantage as Crawley puts Kent in control","link":"https://www.skysports.com/cricket/news/12040/12852022/county-championship-kyle-abbott-gives-hampshire-advantage-as-zak-crawley-puts-kent-in-control","keywords":null,"creator":null,"video_url":null,"description":"Kyle Abbott's four-wicket burst put Hampshire on top in their LV= Insurance County Championship clash against Nottinghamshire at the Ageas Bowl.","content":"Kyle Abbott's four-wicket burst put Hampshire on top in their LV= Insurance County Championship clash against Nottinghamshire at the Ageas Bowl. England batter Ben Duckett made a quickfire 51 from 58 balls for the visitors after Hampshire had made 231 to establish a first-innings lead of 46. Duckett and Haseeb Hameed (27) put on 53 for the opening wicket to wipe out the home side's advantage. But Abbott's 4-30, which included three wickets in eight balls, saw newly-promoted Nottinghamshire fall to 146-6, a lead of 100 going into day three. Elsewhere in Division One, Surrey strengthened their grip against Lancashire as Sean Abbott took four wickets at Emirates Old Trafford. Replying to Surrey's 442, in which Cam Steel made an unbeaten 141, his first first-class century since September 2018, Lancashire reached 233-8. Australian paceman Abbott was responsible for most of the damage, finishing with 4-42 and taking two catches. County Championship Division One table County Championship Division Two table Domestic cricket fixtures The quick cricket column Keaton Jennings battled his way to 76 and Lancashire's best hope of avoiding the follow-on target rests with Colin de Grandhomme, who is unbeaten on 29. Wickets fell at regular intervals at Lord's as Middlesex were dismissed for 170, 96 short of Essex's first-innings 266. After Toby Roland-Jones' seven-wicket haul for Middlesex, Jamie Porter wrecked the home side's middle order. Porter, operating in tandem with seam partner Sam Cook, ended the day with 6-35 and looked virtually unplayable as the pair ripped out Middlesex's first four batters - all for ducks. Middlesex were reduced to a perilous 4-4, but Ryan Higgins (70) and John Simpson (63) oversaw a spirited recovery with their sixth-wicket stand of 127. Zak Crawley's 91 from 171 balls gave Kent the edge against Northamptonshire at Canterbury. The visitors were reduced to 47-2 in their second innings, still trailing by 58 at stumps after the hosts secured a first-innings advantage of 105. Chris Tremain took 5-44 and Jack White 4-57 as Kent were all out for 222, while earlier Matt Quinn took four for 24 as Northamptonshire were bowled out for 117 in their first innings. The Somerset-Warwickshire game finally got under way after the opening day at Taunton had been wiped out because of a wet pitch. Somerset were 269-8 at the close as acting skipper Lewis Gregory top-scored with an unbeaten 65 from 105 balls. Gregory's recovery powers were needed as Somerset slumped to 136-7 shortly after tea, with Ed Barnard (3-54), and Hasan Ali (2-62). Josh Davey (42) and Gregory shared an entertaining eighth-wicket partnership of 105 in 25.1 overs. England white-ball star Dawid Malan made a hundred for Yorkshire against Leicestershire in Division Two. Malan's 154-ball 132, adding to his previous scores of 219, 199 and 152 at Headingley since the start of 2020, helped Yorkshire to 517 all out. Nightwatcher Matt Milnes also contributed 75 on debut and number nine batter Dom Bess made 49 before Leicestershire scored 201-5 in reply. Colin Ackermann (67) and Peter Handscomb (62 not out) provided stiff resistance. Cheteshwar Pujara scored his sixth hundred in only his ninth game for Sussex to frustrate Durham. The 35-year-old India batter, who has taken over as captain at Hove this season, dominated Sussex's reply to Durham's 376 all out with 115. Oli Carter was the next highest scorer with 41 as Sussex closed on 332-9, 54 adrift. Jack Haynes and Brett D'Oliveira led the Worcestershire fightback against Derbyshire. Skipper D'Oliveira scored an unbeaten 87 and Haynes made 62 as Worcestershire reached 331-6, a lead of 10 runs after Derbyshire had earlier made 321. Glamorgan built a commanding lead of 223 against Gloucestershire in Cardiff after closing day two on 388-8. Kiran Carlson (106) and Billy Root (104) made centuries as Marchant de Lange returned figures of 3-72 against his old club.","pubDate":"2023-04-07 19:42:00","image_url":"https://e1.365dm.com/23/04/1920x1080/skysports-kyle-abbott-hampshire_6114491.jpg?20230407205307","source_id":"skysports","category":["sports"],"country":["australia","united kingdom","united states of america"],"language":"english"},{"title":"Coach Pandit hails Kolkata’s sensational knight Suyash","link":"https://thenorthlines.com/coach-pandit-hails-kolkatas-sensational-knight-suyash/","keywords":["Cricket","India","Sports"],"creator":["Northlines"],"video_url":null,"description":"Agencies   Kolkata Knight Riders coach Chandrakant Pandit was happy with rookie spinner Suyash Sharma's “fighting attitude”, saying it was very difficult for rival batters to pick the lad. The 19-year-old from Delhi made a huge impact on his debut IPL game against Royal Challengers Bangalore, picking up the prize wickets of pinch-hitter Dinesh Karthik, […] The post Coach Pandit hails Kolkata’s sensational knight Suyash appeared first on Northlines.","content":"Agencies Kolkata Knight Riders coach Chandrakant Pandit was happy with rookie spinner Suyash Sharma's “fighting attitude”, saying it was very difficult for rival batters to pick the lad. The 19-year-old from Delhi made a huge impact on his debut IPL game against Royal Challengers Bangalore, picking up the prize wickets of pinch-hitter Dinesh Karthik, Anuj Rawat and tail-ender Karn Sharma as KKR thrashed Faf du Plessis's side by 81 runs on Kolkata on Thursday night. “We have seen him (Suyash) at trial matches. He is very quick in the air and it's very tough to pick him. It's just the inexperience; but he showed a fighting attitude,” said Pandit after the match. The former India wicketkeeper-batter also complimented his batters for showing the courage to fight back and post a 200-plus total after they were down and out at 89 for 5, with Shardul Thakur smashing a 29-ball 68. “It's a good win. The boys have shown the character. Looking at the initial stage, having lost wickets and coming back to get 200-plus. We just expected the pitch to help the spinners, but you require enough runs. Shardul and Rinku Singh (46 off 33) counter-attacked the opposition,” added Pandit. KKR captain Nitish Rana said the plan was to put pressure on the rival batters in the middle overs and Suyash was handy. “Even today, we collapsed (to 5/89), and credit to (Rahmanullah) Gurbaz (57 off 44 balls). It was an unbelievable innings from Shardul Thakur. People will talk about Shardul, but Rinku (Singh) held one end up, as we had planned. “We had always planned not to give RCB's batters pace in the middle overs. Suyash, playing his first match, bowled brilliant balls. Not even we have got to know him so far. He backs himself. It was always our plan to add him if we needed a third spinner,” added Rana. ‘Player of the Match' Shardul himself was surprised with the power he packed in his strokes while smashing nine boundaries and three sixes. “Even I don't know where it came from. Looking at the scorecard, everyone would have said we were struggling. But your subconscious mind takes over. You also have to have skills to do that at the higher level, but we also work hard in the nets. “Coaching staff do the throw downs, and give us the option of range-hitting. And you know the pitches; they always suit the batsmen, don't they? This was a perfect day.” RCB captain Du Plessis said his side lost the plot after keeping the KKR batters under pressure till the 13th over. He also indicated that his batters need to improve against quality spinners. “We had it set up there in the 12th or 13th over… It was probably 20-25 runs too much. Shardul played well. Their leg-spinners got on top of us. It was still a good wicket… but the nature of mystery spinners is that they get wickets. They put the squeeze on us. “We were pretty average with the bat. You learn lessons. Two or three days ago, you played brilliant cricket . It got away from us,” added the South African.","pubDate":"2023-04-07 18:35:51","image_url":null,"source_id":"thenorthlines","category":["sports"],"country":["india"],"language":"english"},{"title":"Will BCCI get tax exemption for 2023 World Cup?","link":"https://thenorthlines.com/will-bcci-get-tax-exemption-for-2023-world-cup/","keywords":["Cricket","India","Sports"],"creator":["Northlines"],"video_url":null,"description":"Agencies   The BCCI will set the ball rolling for the sale of the media rights for bilateral cricket at home and commence the process to appoint the head coach of Indian women's cricket team at its Apex Council meeting on Sunday. After the Rs 48,390 crore windfall from the IPL media rights, the BCCI […] The post Will BCCI get tax exemption for 2023 World Cup? appeared first on Northlines.","content":"Agencies The BCCI will set the ball rolling for the sale of the media rights for bilateral cricket at home and commence the process to appoint the head coach of Indian women's cricket team at its Apex Council meeting on Sunday. After the Rs 48,390 crore windfall from the IPL media rights, the BCCI will have high expectations for the home season rights for 2023-2027 cycle. With the entry of Viacom in Indian cricket's ecosystem, it will be a three-way battle between them, Star and Sony. The BCCI reaped huge benefits from selling the broadcast and digital rights separately for the IPL and it is expected to follow that for the international games at home. Star had paid Rs 6,138.1 crore for the previous cycle which ended on March 31. The Indian women's cricket team played the recent T20 World Cup in South Africa without a head coach. Batting coach Hrishikesh Kanitkar had taken charge of the team following the sacking of head coach Ramesh Powar in December. As the subject finds a mention on the Apex Council agenda, the BCCI will soon invite applications for the support staff including the head coach position. India had yet again come up short in a knockout game at the ICC event in February, losing to eventual champions Australia in the semi-finals. The host nation is required to get tax exemption from the government for hosting tournaments organised by the International Cricket Council. However, India's tax rules don't allow such exemptions though the BCCI is pushing for a win win solution in its talks with the government. The board could lose as much as Rs 955 crore if the government sticks to its decision to levy 21.84 percent tax surcharge on ICC's broadcast revenue from the 2023 ODI World Cup. The other items on agenda include ratification of player contracts, revised travel policy of BCCI officials and domestic schedule for 2023-2024 season. With Byju's jersey sponsorship coming to a premature end, the BCCI will also have to look for a replacement. Adidas is set to be Indian's team kit sponsor replacing KKCL, maker of Killer jeans.","pubDate":"2023-04-07 18:35:08","image_url":null,"source_id":"thenorthlines","category":["sports"],"country":["india"],"language":"english"},{"title":"Suryakumar can win India ODI World Cup: Ponting","link":"https://thenorthlines.com/suryakumar-can-win-india-odi-world-cup-ponting/","keywords":["Cricket","India","Sports"],"creator":["Northlines"],"video_url":null,"description":"Agencies   Australian batting great Ricky Ponting feels Suryakumar Yadav has the ability to ‘win' the ODI World Cup for India and the selectors should stick to him despite his woeful run in 50-overs cricket. The T20 batting sensation is yet to recreate his magic in One-Day Internationals, and in the recent three-match ODI series […] The post Suryakumar can win India ODI World Cup: Ponting appeared first on Northlines.","content":"Agencies Australian batting great Ricky Ponting feels Suryakumar Yadav has the ability to ‘win' the ODI World Cup for India and the selectors should stick to him despite his woeful run in 50-overs cricket . The T20 batting sensation is yet to recreate his magic in One-Day Internationals, and in the recent three-match ODI series against Australia he became the first Indian batter to register a hat-trick of golden ducks. “Everyone around the world knows what Surya can do in white-ball cricket,” Ponting said on ICC Review. “His previous 12 or 18 months have been absolutely outstanding. I feel they should stick with him because he's the sort of player that can win you a World Cup,” he added. Suryakumar has scored 172 runs in the format at an average of just 12.28 since his last fifty in February last year. But the former Australia skipper firmly backed the Indian batter, and said he could do what the late Andrew Symonds did in winning the 2003 and 2007 World Cups under his captaincy. “He might be a little bit inconsistent but he's the sort of guy that in big moments can win you games. A bit like the late great Andrew Symonds did for Australia,” Ponting said. “So that's definitely the way that I'd look at it for India. I wouldn't be playing safe. I'd be going with match-winning players and I think he's a match-winner.” Ponting believes the number five spot is best suited for Suryakumar. “I'm a big believer in giving your best batter as much time as you can in all formats of the game. Because if you keep them down the order, quite often you don't get to use your best players and that's the last thing you want. “So I think the No. 5 slot's perfect for him and he's just got to grow into that role there.” Ponting further spoke on Team India combination and said in the absence of the flamboyant Rishabh Pant, KL Rahul will be the preferred choice to don the gloves. Pant will miss the marquee-event as he recovers from a horrible car crash last December. KL Rahul had kept the wickets in the ODIs against Australia. “Look, I do think they'll stick with him (Rahul). I think in their World Cup squad, KL will definitely be there.” However, Ponting said the young Ishan Kishan, being a left-hander, would be in the mix as the Indian top-order is full of right-handers. “With Rishabh not being there now, they might think of maybe wanting to play a specialist left-handed batter in the middle order which I think would have to be Ishan Kishan in some role, whether that's at No. 4 or No. 5.” “Just to negate teams that have got left-arm off-spin because when you look at the spinners around the world now, there are very few right-arm off-spinners in ODIs and T20Is.","pubDate":"2023-04-07 18:33:51","image_url":null,"source_id":"thenorthlines","category":["sports"],"country":["india"],"language":"english"},{"title":"GRAEME SOUNESS: Harry Kane is a very fine player but goes down far too readily","link":"https://www.dailymail.co.uk/sport/football/article-11949971/GRAEME-SOUNESS-Harry-Kane-fine-player-goes-far-readily.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"GRAEME SOUNESS: Let's get it right. When you lift your hands in football now, you've a got a real chance of getting sent off. But Harry exaggerated the incident enormously","content":"GRAEME SOUNESS: Seeing England's captain embarrass himself by cheating reminds us we've lost what made our game so special - Harry Kane is a very fine player but goes down far too readily and exaggerated the incident with Abdoulaye Doucoure Harry Kane exaggerated his clash with Abdoulaye Doucoure enormously The term simulation shows how our game has changed enormously these days Going back a number of years, players didn’t want to show they had been hurt By Graeme Souness for MailOnline Published: 13:00 EDT, 7 April 2023 | Updated: 14:32 EDT, 7 April 2023 e-mail 177 shares 17 View comments I was recently having dinner with a friend of mine and two Dutch guys he knows, when I was reminded of a way our game has changed and something it’s lost. Halfway through our meal, one of the Dutch pair asked me: ‘What happened to the English game?’ and of course I asked him what he meant. ‘Well, everyone throws themselves to the ground now, don’t they?’ he said. ‘You’d think they’d been cut in half.’ I’d never met these people before but it was clear to me that they had always loved what makes English football distinctive. I was reminded of our conversation this week when I saw Harry Kane going down like he’d been hit by a train , rather than a push in his face, from Abdoulaye Doucoure, at Goodison Park. Let’s get it right. When you lift your hands in football now, you’ve a got a real chance of getting sent off. But Harry exaggerated the incident enormously and however much he might claim he wasn’t trying to deceive the referee into getting a fellow professional sent off, his conduct was more embarrassing for himself than anything else. We are talking about the captain of England. That role carries enormous responsibility to lead by example and set a standard. Abdoulaye Doucoure of Everton raised his hand to the face of Tottenham striker Harry Kane Kane though appeared to overreact as he went down to the ground holding his face The incident resulted in the referee showing a red card to Doucoure on Monday night This is how our game has changed dramatically. Going back a number of years, players didn’t want to show they had been hurt. It was a matter of professional pride that they didn’t want to show a weakness to an opponent, however much pain they were in. Now it’s the exact opposite. Players want to go down and hopefully get someone booked. Harry Kane is a very fine player but I have to say he does this far too readily. Part of the problem is the way we now dress this conduct up. ‘Simulation’ is the word commentators and pundits use. Well, let’s look that word up in the dictionary. Mine says simulation is ‘the action of pretending; deception.’ So let’s start using the proper vocabulary, shall we? Let’s start saying: ‘He deceived the referee.’ That suddenly doesn’t sound very good any more, does it? There’s other fancy terminology that people are using about this unpleasant side of our game. I was in a TV studio with Micah Richards when he said: ‘He’s bought a foul.’ I asked: ‘What does that mean, then? “Buying a foul.” You mean, “He cheats?” ’ I think that one related to Jack Grealish. I was — by the way — really impressed with Jack against Liverpool last weekend. It wasn’t what he did with the ball, but without it, that impressed me and he looks like he’s turned a corner. But Jack is another one who is full of those acts of deception. Jack Grealish is another England international who can also benefit from gamesmanship Largely empty stadiums during Covid helped expose players that were overreacting I hear excuses for them all the time. ‘Everyone else does it.’ Or: ‘It’s part of the game.’ Or: ‘Winners find any competitive advantage.’ What unadulterated rubbish. Trying to cheat a foul from the referee is bad enough — but actually trying to get a fellow pro booked or sent off the field? How despicable is that? The cheating was exposed for what it actually is during Covid, because there were no people in the stadiums. To a man, players screamed and all their team-mates raised their hands as if there had been an act of GBH. But crowds drown out the squealing. Take my word for it: when you are a player on the pitch, you know when a really serious tackle has gone in. Graeme Souness writes for Sportsmail We are British. We’ve always been different in our football. We’ve always felt that our sport adheres to a certain code. What was that old term? ‘It’s not cricket.’ It meant we don’t transgress a code about decency and fairness. If you surveyed a group of fans, I think 100 per cent would feel exactly the same. I think the Premier League should be demanding that this behaviour is dealt with and putting referees on notice to stamp it out, before the entire identity of our game is destroyed. Our league was once the envy of the world but because of this blight — this deceit — it is losing its uniqueness. When I dealt with the subject in the book I wrote five years ago, the chapter was titled ‘Handle with Care’ — because I was concerned that we risked stripping away something core to our game. The sight of Harry Kane crashing to the turf the other night suggests that we’re still doing far too little to deal with the problem. No shame in being sacked, how you deal with it is key You won't find me voicing anger about the fact that 12 Premier League managers have lost their jobs this season. There's a trade-off. Managers get paid incredible amounts of money today to do the job and they're scrutinised like never before. But that doesn't mean I don't look at some of these young guys and feel a great deal of empathy for them. A run of 10 bad games is all it takes these days. Ten games could be six weeks. Just one bad cycle and you lose your job. That's what these young guys live with. They will go to bed every night thinking about that and if they are anything like I was as a manager, they will retreat within themselves when things aren't going right. I would go quiet around the house and start to close down. When it's going well, you're an open book. You're everyone's friend. When it's not, you retreat. You start becoming suspicious. You say very little. Ralph Hasenhuttl (left) and Patrick Vieira (right) are among 12 managers sacked this season Brendan Rodgers (left) and Graham Potter (right) have also been axed - but it is about how all of these discarded Premier League managers respond when they return to the dugout As a manager, I took a lot of wisdom from someone older than me from outside of the game: a guy called Gordon Brooks, who was an accountant I'd got to know from my time at Middlesbrough. He had a broader perspective and offered up advice which was generally spot on over the years. I remember him once telling me over dinner: 'You know, not everyone could do your job?' At the time, that hadn't registered with me at all. You forget the skills you do have when everyone's questioning you. Speaking to someone from the outside who'd been through the mill and succeeded in life did help. But if I was advising a young manager who'd lost his job, I would be saying that there's no shame attached to not being successful at one club, these days. After all, disappointments in life - and how you deal with them - determine what kind of individual you become. With a bit of luck, Frank will keep Chelsea job I've always felt you need your fair share of luck in management and I do think the stars have aligned for Frank Lampard at Chelsea. He's arriving back at the club at an incredibly good time, because slowly but surely the new buys there are starting to grasp the nettle and show what is needed to succeed at a top Premier League side. Their football is good enough to win games. The team lacks only one key ingredient - a centre forward. Frank Lampard has returned to take over at Chelsea as interim boss until the end of the season I think Frank will get this group winning football matches again. In his previous incarnation as Chelsea manager he got a punch on the nose and he will be richer from that experience. Foreign managers are always in fashion. The latest is Julian Nagelsmann. But it's more than possible that Frank will improve results at the club and if that happens, he would certainly deserve the chance to manage there permanently. Personally, I would love to see that and it would also be very good to see a British manager in one of our top jobs. We all know what Napoleon said about wanting 'lucky generals'. I believe this is a very good appointment. Share or comment on this article: GRAEME SOUNESS: Harry Kane is a very fine player but goes down far too readily e-mail 177 shares Add comment Comments 17 Share what you think Newest Oldest Best rated Worst rated View all The comments below have been moderated in advance. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-04-07 18:32:21","image_url":"https://i.dailymail.co.uk/1s/2023/04/07/17/69599767-0-image-a-10_1680886603615.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"IPL 2023: A Giant(s) leap to the top","link":"https://indianexpress.com/article/sports/ipl/ipl-2023-lucknow-super-giants-vs-sunrisers-hyderabad-match-report-8544768/","keywords":["IPL 2023","Sports"],"creator":["Rahul Pandey"],"video_url":null,"description":null,"content":"Synopsis: LSG’s spinners knock out SRH batsmen before scratchy Rahul and confident Pandya orchestrate chase On a surface that was more in sync with the Border-Gavaskar Trophy, Lucknow Super Giants eviscerated Sunrisers Hyderabad. The surface, layered in black soil, was slow and low and abetted the trio of Lucknow’s spinners—Krunal Pandya. Amit Mishra and Ravi Bishnoi—whose combined figures read 12-0-67-6. Restricting the visitors to 121, they overhauled the target without much ado. Spin treat Recommended for you 1 IPL 2023: Moeen Ali says MI-CSK rivalry is like that between Manchester United and Liverpool 2 IPL 2023, LSG vs SRH emotional rollercoaster: Harry Brook’s struggles, stubborn stumps, no place for specialist keepers & first over specialist Kyle Mayers Right from the first delivery Kyle Mayers bowled, it was evident that slower bowlers held the keys on this surface. Krunal Pandya was introduced as early as the third over, and a wicket came off his fifth delivery of the night. Tossed up and slow, Mayank Agarwal looked to chip it over cover but played it too early and handed a catch to Marcus Stoinis in the ring. A soft dismissal rather. It was not one of those pitches where you could just thrust your front-foot and drive; it was not one where you could hang back and work the ball through the leg-side. It was where you needed quick feet and hands, besides a quicker brain to score runs. A low stooping stance too could have benefitted. Just when Rahul Tripathi and Anmolpreet Singh seemed to have cracked the code, Pandya struck twice off two balls. A flatter one that was angled trapped Anmolpreet in front, which on review turned out to be an umpire’s call lbw dismissal. The next ball, a bit more tossed up, spun away from a driving Aiden Markram to hit the off-stump. Krunal Pandya on song here! Picks up two key wickets in as many deliveries. Anmolpreet Singh and Aiden Markram depart. Live – https://t.co/7Mh0bHCrTi #TATAIPL #LSGvSRH #IPL2023 pic.twitter.com/33W5Uf4Gpv — IndianPremierLeague (@IPL) April 7, 2023 After Pandya completed his second best figures (3/18) in this format, Ravi Bishnoi grabbed a moment of his own in the next over with a composed four-ball setup to remove Harry Brooks. Googly, googly, googly, and a leg-break. He was stumped. “It was difficult to play standstill on this wicket, I knew he’d step out,” Bishnoi would reveal the recipe post-innings. In stepped the second most successful spinner in the league’s history, Amit Mishra . It’s 2023, he turned 40 last year, yet remains an influential figure. It seemed he has only become agiler as he pounced on a low catch inside the 30-yard circle to eject Rahul Tripathi. His 167th and 168th IPL dismissals came in the penultimate over as Hyderabad attempted to bow out big. Washington Sundar ’s first aggressive shot of the innings off a tossed up delivery went straight to Deepak Hooda at long-on. A delivery later, Adil Rashid advanced down but was unable to clear the longer straight boundary. Lucknow mentor Gautam Gambhir had suggested at the IPL auction that the Impact Player brought about the opportunity for the likes of Mishra to feature more in the league. On Friday, the team clearly knew the wicket they were playing on as they started off with the 40-year-old and subbed him for Ayush Badoni. Brisk start Advertisement The target of 122 was never going to be daunting, and LSG openers KL Rahul and Kyle Mayers went about methodically, compiling 35 runs in 4.5 overs. Though the in-form Mayers perished to Fazalhaq Farooqi and Bhuvneshwar Kumar took out Deepak Hooda with a stunning left-handed return catch, the target was never going to intimidate LSG. Nicholas Pooran finishes things off in style. @LucknowIPL chase down the target with 4 overs to spare as they beat #SRH by 5 wickets. Scorecard – https://t.co/7Mh0bHCrTi #TATAIPL #LSGvSRH #IPL2023 pic.twitter.com/STXF5KLMuI — IndianPremierLeague (@IPL) April 7, 2023 To Rahul’s support came Pandya, bubbling with the confidence of three wickets. With Rahul, he combined 55 relatively risk-free 55 runs. Pandya’s contribution was 34, off 23 balls, but by the time he departed the chase was almost sewn up, LSG requiring just 22 runs from 46 balls. Scratchy Rahul Also Read 'I told him over the phone': Ashish Nehra reveals how Gujarat Titans appo... IPL 2023 Live Streaming Details: How to watch IPL matches live online and... MS Dhoni unlikely to play IPL opener due to injury IPL 2022: Rinku Singh, who nearly became a sweeper, wins it for KKR Coming into the IPL this season, KL Rahul was under the scanner more so than he has been in the previous editions. Following the T20 World Cup elimination last year, Rahul was among the senior players dropped from India’s shortest format team in the bilaterals that followed. A woeful run with the bat and a vice-captaincy snub midway through the Test series against Australia earlier this year further cast a shadow over his role in Indian cricket. The conditions were tough but the @LucknowIPL Captain stood tall in the chase. @klrahul becomes our Top Performer from the second innings. A look at his batting summary 👇 #TATAIPL #LSGvSRH pic.twitter.com/NaZEl0R39K — IndianPremierLeague (@IPL) April 7, 2023 A 12-ball-eight and an 18-ball-20 in the first two games of this IPL didn’t help his case. With just eight runs left to win and having spent a considerable time in the middle (35 off 31), the Lucknow captain was unable to cap off the game. And of all the strokes, a reverse sweep undid him. The ball from Adil Rashid landed around the middle stump, held the line and crawled underneath his swipe to trap him in front. A Romario Shepherd first ball duck followed but the late scare came a little too late for Hyderabad to capitalise upon as Nicholas Pooran and Marcus Stoinis wrapped up the game with five wickets and 24 deliveries in hand.","pubDate":"2023-04-07 18:26:26","image_url":null,"source_id":"indianexpress","category":["sports"],"country":["india"],"language":"english"},{"title":"मुंबई के खिलाफ भिड़ने से पहले CSK के ऑलराउंडर का बड़ा बयान, बढ़ गया मुकाबले का रोमांच","link":"https://www.indiatv.in/sports/cricket/ipl-2023-mi-vs-csk-is-like-man-united-vs-liverpool-moeen-ali-2023-04-07-949899","keywords":null,"creator":null,"video_url":null,"description":"सीएसके के ऑलराउंडर ने मुंबई इंडियंस के खिलाफ मुकाबले से पहले बड़ा बयान दिया है।","content":"आईपीएल 2023 के 12वें मुकाबले में चेन्नई सुपर किंग्स के सामने सबसे बड़ी दुश्मन माने जाने वाली मुंबई इंडियंस की टीम होने वाली है। ये दोनों ही टीमें पिछले कई सालों से जब भी एक दूसरे के सामने आती हैं तो मुकाबला देखने लायक होता है। वहीं इस मैच पर शुक्रवार को फिर एक बार क्रिकेट फैंस की नजरें टिकी रहेंगी। लेकिन इसी बीच सीएसके के एक ऑलराउंडर ने इस मैच को लेकर बड़ा बयान दिया है। सीएसके के ऑलराउंडर मोईन अली ने शुक्रवार को अपनी टीम और आईपीएल का खिताब रिकॉर्ड पांच बार जीतने वाली मुंबई इंडियंस के बीच कड़ी प्रतिस्पर्धा की तुलना मैनचेस्टर यूनाइटेड और लिवरपूल की फुटबॉल प्रतिद्वंद्विता से की। मुंबई इंडियंस आईपीएल इतिहास की सबसे सफल टीम जबकि चेन्नई सुपरकिंग्स चार खिताब के साथ दूसरे नंबर पर है। साल 2022 में आईपीएल की बड़ी नीलामी के बाद बाद से दोनों टीमें संघर्ष कर रही हैं। मुंबई और चेन्नई की आईपीएल प्रतिद्वंद्विता को आईपीएल की ‘एल क्लासिको’ के नाम से जाना जाता है। दोनों टीमों के बीच 34 मुकाबलों में हालांकि 20 जीत के साथ मुंबई का पलड़ा भारी रहा है। मोईन ने मैच से पहले कहा कि यह एक ऐसा मुकाबला है जिसका मैं वास्तव में इंतजार कर रहा हूं। ये दो सबसे सफल फ्रेंचाइजी टीमों का मुकाबला हैं और दोनों के फैंस की संख्या बहुत ज्यादा है। एक क्रिकेटर के रूप में यह अंतरराष्ट्रीय क्रिकेट के बाहर खेले जाने वाले सबसे बड़े मैचों में से एक है। उन्होंने कहा कि अगर फुटबॉल के नजरिए से देखे तो यह मैच मैनचेस्टर यूनाइटेड और लिवरपूल के मुकाबले की तरह है। ये मुकाबले काफी बड़े होते हैं। उन्होंने चोट से वापसी के बाद लय पाने के लिए संघर्ष कर रहे टीम के मुख्य तेज गेंदबाज दीपक चाहर का बचाव करते हुए कहा कि मुझे लगता है कि उनके पास सिर्फ एक चीज की कमी है और वह है मैच में समय देने की। उसे बुरी तरह चोट लगी थी और वह लंबे समय बाद वापसी कर रहा हैं। एक गेंदबाज के तौर पर आपको मैच में लगातार गेंदबाजी करने की जरूरी होती है। वह टूर्नामेंट के आगे बढ़ने के साथ बेहतर होता जाएगा। उन्होंने कहा कि वह हमारी टीम का बड़ा गेंदबाज है और जब वह लय में रहता है तो पावरप्ले में तीन या चार विकेट निकाल लेते है।","pubDate":"2023-04-07 18:17:20","image_url":null,"source_id":"indiatv","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Aleem Dar receives guard of honour in final Test as ICC Elite Panel umpire","link":"https://www.nation.com.pk/08-Apr-2023/aleem-dar-receives-guard-of-honour-in-final-test-as-icc-elite-panel-umpire","keywords":["Sports, Newspaper"],"creator":["Agencies"],"video_url":null,"description":"MIRPUR - Renowned Pakistani umpire Aleem Dar received a guard of honour after officiating in his last Test match as an ICC Elite Panel umpire during the fixture between Bangladesh and Ireland in Mirpur on Friday.","content":"MIRPUR - Renowned Pakistani umpire Aleem Dar received a guard of honour after officiating in his last Test match as an ICC Elite Panel umpire during the fixture between Bangladesh and Ireland in Mirpur on Friday. Dar’s exit from the elite panel after 19 years was confirmed by the ICC on March 16 in a press release. “Dar has had a long and celebrated career as an international umpire. He made his international debut in 2000 and quickly rose through the ranks, with his sound decisions in matches earning him acclaim from the players and fans,” the ICC said. “Dar was appointed to the ICC International Panel of Umpires in 2002 and officiated at the 2003 ICC Men’s Cricket World Cup in South Africa. Dar continued his rise as he was appointed as a member of the Elite Panel of ICC Umpires in 2004. He was the first Pakistani to be appointed to the Elite Panel,” it added. Dar officiated a total of 438 international matches over the course of his illustrious career. Lauding Dar’s contributions, ICC CEO Geoff Allardice said: “Aleem’s contribution to international cricket and to the ICC has been truly remarkable. Consistently elite performances over such a long period saw him enjoy enormous respect across all involved in international cricket. I wish Aleem all the best for the future and I am sure his involvement in the game will continue for many years to come.” Dar also shed light on his journey as an umpire which included being voted for the ICC Umpire of the Year for three consecutive years between 2009 and 2011. “It has been a long journey, but I have enjoyed every bit of it. I have had the pleasure and honour of umpiring the world over and what I have achieved is something I did not even dream of when I started in the profession,” Dar said. “Though I am still keen to continue as an international umpire, I felt it was now the right time, after 19 years on the road to step away from the Elite panel and provide an opportunity to someone from the International Panel. My message to umpires the world over is to work hard, maintain discipline and never stop learning,” he added.","pubDate":"2023-04-07 23:44:07","image_url":"https://www.nation.com.pk/print_images/large/2023-04-08/aleem-dar-receives-guard-of-honour-in-final-test-as-icc-elite-panel-umpire-1680911036-4967.jpg","source_id":"nation_pk","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"PCB issues notification of Kh Nadeem as LRCA President","link":"https://www.nation.com.pk/08-Apr-2023/pcb-issues-notification-of-kh-nadeem-as-lrca-president","keywords":["Sports, Newspaper"],"creator":["Our Staff Reporter"],"video_url":null,"description":"LAHORE - Pakistan Cricket Board (PCB) has issued the notification of Khawaja Nadeem Ahmad as President of Lahore Region Cricket Association (LRCA).","content":"LAHORE - Pakistan Cricket Board (PCB) has issued the notification of Khawaja Nadeem Ahmad as President of Lahore Region Cricket Association (LRCA). According to the PCB notification, Khawaja Nadeem and Shahid Hamid Butt were elected unopposed as President and Secretary of the LRCA, respectively. In a statement on Friday, Kh Nadeem said that he would take all the stakeholders into confidence to draw up a roadmap for the revival and development of club cricket in Lahore. “My mandate is to take drastic measures to lift club cricket out of gloom as early level cricket has suffered a lot in the last four years. Club cricket is almost on verge of collapse and its main cause is lack of competition and absence of a comprehensive activity to engage youth in quality cricket,” he added. He said his victory in the LRCA elections is a result of unity and coordination between all the three zones, for which they deserve due credit. “I have served Lahore cricket with distinction during my two previous tenures and a significant rise was witnessed in the overall development of club cricket.” Nadeem, who is himself a former first-class cricketer, said that special emphasis was laid on improving existing infrastructure and addition of new grounds in different parts of the city during his two previous tenures. “As a president of LRCA, it will be a great responsibility for me to restart the task from where it was left.” Kh Nadeem said that the three LRCA zones elected the right people for the right job at zones level. “There is a dire need to show similar spirit in the revival of club cricket to re-establish Lahore’s name as the nursery of cricket which produced world class Test captains and cricketers.” He urged all the stakeholders to table useful suggestions on how to make Lahore cricket a quality product and how to tape new talent. “I will be having regular meetings with the officials of all the three zones and office-bearers of LRCA to unfold my vision for the betterment of cricket at grassroots level.” The LRCA president called upon the sponsors to come forward and lend a financial support to LRCA for a collective cause of revival of club cricket, which is going to work again on its basic purpose of producing world champions for Pakistan.","pubDate":"2023-04-07 23:43:17","image_url":"https://www.nation.com.pk/print_images/large/2023-04-08/pcb-issues-notification-of-kh-nadeem-as-lrca-president-1680910979-2529.jpg","source_id":"nation_pk","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"PCB announce team management for New Zealand series","link":"https://www.nation.com.pk/08-Apr-2023/pcb-announce-team-management-for-new-zealand-series","keywords":["Sports, Newspaper"],"creator":["Staff Reporter"],"video_url":null,"description":"LAHORE - The Pakistan Cricket Board (PCB) Friday announced national men’s team management for the upcoming T20I and ODI series against New Zealand.","content":"LAHORE - The Pakistan Cricket Board (PCB) Friday announced national men’s team management for the upcoming T20I and ODI series against New Zealand. Rehan-ul-Haq, the general manager of twotime Pakistan Super League (PSL) champions Islamabad United, has been appointed team manager. New Zealand’s former Test cricketer Grant Bradburn will be the head coach with Abdul Rehman as his assistant. Andrew Puttick will come as batting coach followed by Umar Gul’s extension as bowling coach. Reportedly, the team management has been appointed in the loop with a potential team director in the future, Mickey Arthur. The former head coach of the national team is likely to be confirmed to take up the post after the home New Zealand tour. Bradburn and Puttick have been appointed for the New Zealand series and will arrive in Lahore on 11 April. The PCB will confirm the Pakistan team management for post-New Zealand series following the completion of the relevant recruitment processes, which are presently ongoing. PLAYER SUPPORT PERSONNEL: Rehan Ul Haq (manager), Grant Bradburn (head coach), Abdul Rehman (assistant to head coach), Andrew Puttick (batting coach), Umar Gul (bowling coach), Cliffe Deacon (physiotherapist), DrikusSaaimon (strength and conditioning coach), Talha Ijaz (analyst), Ahsan Iftikhar Nagi (media and digital manager), Major (retd) Azhar Arif (security manager), Ammar Ahsan (videographer), Dr Najeeb Soomro (team doctor) and Malang Ali (masseur)","pubDate":"2023-04-07 23:39:32","image_url":null,"source_id":"nation_pk","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"Abbott gives Hampshire advantage as Crawley puts Kent in control","link":"https://www.skysports.com/cricket/news/12040/12852022/county-championship-kyle-abbott-gives-hampshire-advantage-as-zak-crawley-puts-kent-in-control","keywords":null,"creator":null,"video_url":null,"description":"Kyle Abbott's four-wicket burst put Hampshire on top in their LV= Insurance County Championship clash against Nottinghamshire at the Ageas Bowl.","content":"Kyle Abbott's four-wicket burst put Hampshire on top in their LV= Insurance County Championship clash against Nottinghamshire at the Ageas Bowl. England batter Ben Duckett made a quickfire 51 from 58 balls for the visitors after Hampshire had made 231 to establish a first-innings lead of 46. Duckett and Haseeb Hameed (27) put on 53 for the opening wicket to wipe out the home side's advantage. But Abbott's 4-30, which included three wickets in eight balls, saw newly-promoted Nottinghamshire fall to 146-6, a lead of 100 going into day three. Elsewhere in Division One, Surrey strengthened their grip against Lancashire as Sean Abbott took four wickets at Emirates Old Trafford. Replying to Surrey's 442, in which Cam Steel made an unbeaten 141, his first first-class century since September 2018, Lancashire reached 233-8. Australian paceman Abbott was responsible for most of the damage, finishing with 4-42 and taking two catches. County Championship Division One table County Championship Division Two table Domestic cricket fixtures The quick cricket column Keaton Jennings battled his way to 76 and Lancashire's best hope of avoiding the follow-on target rests with Colin de Grandhomme, who is unbeaten on 29. Wickets fell at regular intervals at Lord's as Middlesex were dismissed for 170, 96 short of Essex's first-innings 266. After Toby Roland-Jones' seven-wicket haul for Middlesex, Jamie Porter wrecked the home side's middle order. Porter, operating in tandem with seam partner Sam Cook, ended the day with 6-35 and looked virtually unplayable as the pair ripped out Middlesex's first four batters - all for ducks. Middlesex were reduced to a perilous 4-4, but Ryan Higgins (70) and John Simpson (63) oversaw a spirited recovery with their sixth-wicket stand of 127. Zak Crawley's 91 from 171 balls gave Kent the edge against Northamptonshire at Canterbury. The visitors were reduced to 47-2 in their second innings, still trailing by 58 at stumps after the hosts secured a first-innings advantage of 105. Chris Tremain took 5-44 and Jack White 4-57 as Kent were all out for 222, while earlier Matt Quinn took four for 24 as Northamptonshire were bowled out for 117 in their first innings. The Somerset-Warwickshire game finally got under way after the opening day at Taunton had been wiped out because of a wet pitch. Somerset were 269-8 at the close as acting skipper Lewis Gregory top-scored with an unbeaten 65 from 105 balls. Gregory's recovery powers were needed as Somerset slumped to 136-7 shortly after tea, with Ed Barnard (3-54), and Hasan Ali (2-62). Josh Davey (42) and Gregory shared an entertaining eighth-wicket partnership of 105 in 25.1 overs. England white-ball star Dawid Malan made a hundred for Yorkshire against Leicestershire in Division Two. Malan's 154-ball 132, adding to his previous scores of 219, 199 and 152 at Headingley since the start of 2020, helped Yorkshire to 517 all out. Nightwatcher Matt Milnes also contributed 75 on debut and number nine batter Dom Bess made 49 before Leicestershire scored 201-5 in reply. Colin Ackermann (67) and Peter Handscomb (62 not out) provided stiff resistance. Cheteshwar Pujara scored his sixth hundred in only his ninth game for Sussex to frustrate Durham. The 35-year-old India batter, who has taken over as captain at Hove this season, dominated Sussex's reply to Durham's 376 all out with 115. Oli Carter was the next highest scorer with 41 as Sussex closed on 332-9, 54 adrift. Jack Haynes and Brett D'Oliveira led the Worcestershire fightback against Derbyshire. Skipper D'Oliveira scored an unbeaten 87 and Haynes made 62 as Worcestershire reached 331-6, a lead of 10 runs after Derbyshire had earlier made 321. Glamorgan built a commanding lead of 223 against Gloucestershire in Cardiff after closing day two on 388-8. Kiran Carlson (106) and Billy Root (104) made centuries as Marchant de Lange returned figures of 3-72 against his old club.","pubDate":"2023-04-07 19:42:00","image_url":"https://e1.365dm.com/23/04/1920x1080/skysports-kyle-abbott-hampshire_6114491.jpg?20230407205307","source_id":"skysports","category":["sports"],"country":["australia","united kingdom","united states of america"],"language":"english"},{"title":"Coach Pandit hails Kolkata’s sensational knight Suyash","link":"https://thenorthlines.com/coach-pandit-hails-kolkatas-sensational-knight-suyash/","keywords":["Cricket","India","Sports"],"creator":["Northlines"],"video_url":null,"description":"Agencies   Kolkata Knight Riders coach Chandrakant Pandit was happy with rookie spinner Suyash Sharma's “fighting attitude”, saying it was very difficult for rival batters to pick the lad. The 19-year-old from Delhi made a huge impact on his debut IPL game against Royal Challengers Bangalore, picking up the prize wickets of pinch-hitter Dinesh Karthik, […] The post Coach Pandit hails Kolkata’s sensational knight Suyash appeared first on Northlines.","content":"Agencies Kolkata Knight Riders coach Chandrakant Pandit was happy with rookie spinner Suyash Sharma's “fighting attitude”, saying it was very difficult for rival batters to pick the lad. The 19-year-old from Delhi made a huge impact on his debut IPL game against Royal Challengers Bangalore, picking up the prize wickets of pinch-hitter Dinesh Karthik, Anuj Rawat and tail-ender Karn Sharma as KKR thrashed Faf du Plessis's side by 81 runs on Kolkata on Thursday night. “We have seen him (Suyash) at trial matches. He is very quick in the air and it's very tough to pick him. It's just the inexperience; but he showed a fighting attitude,” said Pandit after the match. The former India wicketkeeper-batter also complimented his batters for showing the courage to fight back and post a 200-plus total after they were down and out at 89 for 5, with Shardul Thakur smashing a 29-ball 68. “It's a good win. The boys have shown the character. Looking at the initial stage, having lost wickets and coming back to get 200-plus. We just expected the pitch to help the spinners, but you require enough runs. Shardul and Rinku Singh (46 off 33) counter-attacked the opposition,” added Pandit. KKR captain Nitish Rana said the plan was to put pressure on the rival batters in the middle overs and Suyash was handy. “Even today, we collapsed (to 5/89), and credit to (Rahmanullah) Gurbaz (57 off 44 balls). It was an unbelievable innings from Shardul Thakur. People will talk about Shardul, but Rinku (Singh) held one end up, as we had planned. “We had always planned not to give RCB's batters pace in the middle overs. Suyash, playing his first match, bowled brilliant balls. Not even we have got to know him so far. He backs himself. It was always our plan to add him if we needed a third spinner,” added Rana. ‘Player of the Match' Shardul himself was surprised with the power he packed in his strokes while smashing nine boundaries and three sixes. “Even I don't know where it came from. Looking at the scorecard, everyone would have said we were struggling. But your subconscious mind takes over. You also have to have skills to do that at the higher level, but we also work hard in the nets. “Coaching staff do the throw downs, and give us the option of range-hitting. And you know the pitches; they always suit the batsmen, don't they? This was a perfect day.” RCB captain Du Plessis said his side lost the plot after keeping the KKR batters under pressure till the 13th over. He also indicated that his batters need to improve against quality spinners. “We had it set up there in the 12th or 13th over… It was probably 20-25 runs too much. Shardul played well. Their leg-spinners got on top of us. It was still a good wicket… but the nature of mystery spinners is that they get wickets. They put the squeeze on us. “We were pretty average with the bat. You learn lessons. Two or three days ago, you played brilliant cricket . It got away from us,” added the South African.","pubDate":"2023-04-07 18:35:51","image_url":null,"source_id":"thenorthlines","category":["sports"],"country":["india"],"language":"english"},{"title":"Will BCCI get tax exemption for 2023 World Cup?","link":"https://thenorthlines.com/will-bcci-get-tax-exemption-for-2023-world-cup/","keywords":["Cricket","India","Sports"],"creator":["Northlines"],"video_url":null,"description":"Agencies   The BCCI will set the ball rolling for the sale of the media rights for bilateral cricket at home and commence the process to appoint the head coach of Indian women's cricket team at its Apex Council meeting on Sunday. After the Rs 48,390 crore windfall from the IPL media rights, the BCCI […] The post Will BCCI get tax exemption for 2023 World Cup? appeared first on Northlines.","content":"Agencies The BCCI will set the ball rolling for the sale of the media rights for bilateral cricket at home and commence the process to appoint the head coach of Indian women's cricket team at its Apex Council meeting on Sunday. After the Rs 48,390 crore windfall from the IPL media rights, the BCCI will have high expectations for the home season rights for 2023-2027 cycle. With the entry of Viacom in Indian cricket's ecosystem, it will be a three-way battle between them, Star and Sony. The BCCI reaped huge benefits from selling the broadcast and digital rights separately for the IPL and it is expected to follow that for the international games at home. Star had paid Rs 6,138.1 crore for the previous cycle which ended on March 31. The Indian women's cricket team played the recent T20 World Cup in South Africa without a head coach. Batting coach Hrishikesh Kanitkar had taken charge of the team following the sacking of head coach Ramesh Powar in December. As the subject finds a mention on the Apex Council agenda, the BCCI will soon invite applications for the support staff including the head coach position. India had yet again come up short in a knockout game at the ICC event in February, losing to eventual champions Australia in the semi-finals. The host nation is required to get tax exemption from the government for hosting tournaments organised by the International Cricket Council. However, India's tax rules don't allow such exemptions though the BCCI is pushing for a win win solution in its talks with the government. The board could lose as much as Rs 955 crore if the government sticks to its decision to levy 21.84 percent tax surcharge on ICC's broadcast revenue from the 2023 ODI World Cup. The other items on agenda include ratification of player contracts, revised travel policy of BCCI officials and domestic schedule for 2023-2024 season. With Byju's jersey sponsorship coming to a premature end, the BCCI will also have to look for a replacement. Adidas is set to be Indian's team kit sponsor replacing KKCL, maker of Killer jeans.","pubDate":"2023-04-07 18:35:08","image_url":null,"source_id":"thenorthlines","category":["sports"],"country":["india"],"language":"english"},{"title":"Suryakumar can win India ODI World Cup: Ponting","link":"https://thenorthlines.com/suryakumar-can-win-india-odi-world-cup-ponting/","keywords":["Cricket","India","Sports"],"creator":["Northlines"],"video_url":null,"description":"Agencies   Australian batting great Ricky Ponting feels Suryakumar Yadav has the ability to ‘win' the ODI World Cup for India and the selectors should stick to him despite his woeful run in 50-overs cricket. The T20 batting sensation is yet to recreate his magic in One-Day Internationals, and in the recent three-match ODI series […] The post Suryakumar can win India ODI World Cup: Ponting appeared first on Northlines.","content":"Agencies Australian batting great Ricky Ponting feels Suryakumar Yadav has the ability to ‘win' the ODI World Cup for India and the selectors should stick to him despite his woeful run in 50-overs cricket . The T20 batting sensation is yet to recreate his magic in One-Day Internationals, and in the recent three-match ODI series against Australia he became the first Indian batter to register a hat-trick of golden ducks. “Everyone around the world knows what Surya can do in white-ball cricket,” Ponting said on ICC Review. “His previous 12 or 18 months have been absolutely outstanding. I feel they should stick with him because he's the sort of player that can win you a World Cup,” he added. Suryakumar has scored 172 runs in the format at an average of just 12.28 since his last fifty in February last year. But the former Australia skipper firmly backed the Indian batter, and said he could do what the late Andrew Symonds did in winning the 2003 and 2007 World Cups under his captaincy. “He might be a little bit inconsistent but he's the sort of guy that in big moments can win you games. A bit like the late great Andrew Symonds did for Australia,” Ponting said. “So that's definitely the way that I'd look at it for India. I wouldn't be playing safe. I'd be going with match-winning players and I think he's a match-winner.” Ponting believes the number five spot is best suited for Suryakumar. “I'm a big believer in giving your best batter as much time as you can in all formats of the game. Because if you keep them down the order, quite often you don't get to use your best players and that's the last thing you want. “So I think the No. 5 slot's perfect for him and he's just got to grow into that role there.” Ponting further spoke on Team India combination and said in the absence of the flamboyant Rishabh Pant, KL Rahul will be the preferred choice to don the gloves. Pant will miss the marquee-event as he recovers from a horrible car crash last December. KL Rahul had kept the wickets in the ODIs against Australia. “Look, I do think they'll stick with him (Rahul). I think in their World Cup squad, KL will definitely be there.” However, Ponting said the young Ishan Kishan, being a left-hander, would be in the mix as the Indian top-order is full of right-handers. “With Rishabh not being there now, they might think of maybe wanting to play a specialist left-handed batter in the middle order which I think would have to be Ishan Kishan in some role, whether that's at No. 4 or No. 5.” “Just to negate teams that have got left-arm off-spin because when you look at the spinners around the world now, there are very few right-arm off-spinners in ODIs and T20Is.","pubDate":"2023-04-07 18:33:51","image_url":null,"source_id":"thenorthlines","category":["sports"],"country":["india"],"language":"english"},{"title":"GRAEME SOUNESS: Harry Kane is a very fine player but goes down far too readily","link":"https://www.dailymail.co.uk/sport/football/article-11949971/GRAEME-SOUNESS-Harry-Kane-fine-player-goes-far-readily.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"GRAEME SOUNESS: Let's get it right. When you lift your hands in football now, you've a got a real chance of getting sent off. But Harry exaggerated the incident enormously","content":"GRAEME SOUNESS: Seeing England's captain embarrass himself by cheating reminds us we've lost what made our game so special - Harry Kane is a very fine player but goes down far too readily and exaggerated the incident with Abdoulaye Doucoure Harry Kane exaggerated his clash with Abdoulaye Doucoure enormously The term simulation shows how our game has changed enormously these days Going back a number of years, players didn’t want to show they had been hurt By Graeme Souness for MailOnline Published: 13:00 EDT, 7 April 2023 | Updated: 14:32 EDT, 7 April 2023 e-mail 177 shares 17 View comments I was recently having dinner with a friend of mine and two Dutch guys he knows, when I was reminded of a way our game has changed and something it’s lost. Halfway through our meal, one of the Dutch pair asked me: ‘What happened to the English game?’ and of course I asked him what he meant. ‘Well, everyone throws themselves to the ground now, don’t they?’ he said. ‘You’d think they’d been cut in half.’ I’d never met these people before but it was clear to me that they had always loved what makes English football distinctive. I was reminded of our conversation this week when I saw Harry Kane going down like he’d been hit by a train , rather than a push in his face, from Abdoulaye Doucoure, at Goodison Park. Let’s get it right. When you lift your hands in football now, you’ve a got a real chance of getting sent off. But Harry exaggerated the incident enormously and however much he might claim he wasn’t trying to deceive the referee into getting a fellow professional sent off, his conduct was more embarrassing for himself than anything else. We are talking about the captain of England. That role carries enormous responsibility to lead by example and set a standard. Abdoulaye Doucoure of Everton raised his hand to the face of Tottenham striker Harry Kane Kane though appeared to overreact as he went down to the ground holding his face The incident resulted in the referee showing a red card to Doucoure on Monday night This is how our game has changed dramatically. Going back a number of years, players didn’t want to show they had been hurt. It was a matter of professional pride that they didn’t want to show a weakness to an opponent, however much pain they were in. Now it’s the exact opposite. Players want to go down and hopefully get someone booked. Harry Kane is a very fine player but I have to say he does this far too readily. Part of the problem is the way we now dress this conduct up. ‘Simulation’ is the word commentators and pundits use. Well, let’s look that word up in the dictionary. Mine says simulation is ‘the action of pretending; deception.’ So let’s start using the proper vocabulary, shall we? Let’s start saying: ‘He deceived the referee.’ That suddenly doesn’t sound very good any more, does it? There’s other fancy terminology that people are using about this unpleasant side of our game. I was in a TV studio with Micah Richards when he said: ‘He’s bought a foul.’ I asked: ‘What does that mean, then? “Buying a foul.” You mean, “He cheats?” ’ I think that one related to Jack Grealish. I was — by the way — really impressed with Jack against Liverpool last weekend. It wasn’t what he did with the ball, but without it, that impressed me and he looks like he’s turned a corner. But Jack is another one who is full of those acts of deception. Jack Grealish is another England international who can also benefit from gamesmanship Largely empty stadiums during Covid helped expose players that were overreacting I hear excuses for them all the time. ‘Everyone else does it.’ Or: ‘It’s part of the game.’ Or: ‘Winners find any competitive advantage.’ What unadulterated rubbish. Trying to cheat a foul from the referee is bad enough — but actually trying to get a fellow pro booked or sent off the field? How despicable is that? The cheating was exposed for what it actually is during Covid, because there were no people in the stadiums. To a man, players screamed and all their team-mates raised their hands as if there had been an act of GBH. But crowds drown out the squealing. Take my word for it: when you are a player on the pitch, you know when a really serious tackle has gone in. Graeme Souness writes for Sportsmail We are British. We’ve always been different in our football. We’ve always felt that our sport adheres to a certain code. What was that old term? ‘It’s not cricket.’ It meant we don’t transgress a code about decency and fairness. If you surveyed a group of fans, I think 100 per cent would feel exactly the same. I think the Premier League should be demanding that this behaviour is dealt with and putting referees on notice to stamp it out, before the entire identity of our game is destroyed. Our league was once the envy of the world but because of this blight — this deceit — it is losing its uniqueness. When I dealt with the subject in the book I wrote five years ago, the chapter was titled ‘Handle with Care’ — because I was concerned that we risked stripping away something core to our game. The sight of Harry Kane crashing to the turf the other night suggests that we’re still doing far too little to deal with the problem. No shame in being sacked, how you deal with it is key You won't find me voicing anger about the fact that 12 Premier League managers have lost their jobs this season. There's a trade-off. Managers get paid incredible amounts of money today to do the job and they're scrutinised like never before. But that doesn't mean I don't look at some of these young guys and feel a great deal of empathy for them. A run of 10 bad games is all it takes these days. Ten games could be six weeks. Just one bad cycle and you lose your job. That's what these young guys live with. They will go to bed every night thinking about that and if they are anything like I was as a manager, they will retreat within themselves when things aren't going right. I would go quiet around the house and start to close down. When it's going well, you're an open book. You're everyone's friend. When it's not, you retreat. You start becoming suspicious. You say very little. Ralph Hasenhuttl (left) and Patrick Vieira (right) are among 12 managers sacked this season Brendan Rodgers (left) and Graham Potter (right) have also been axed - but it is about how all of these discarded Premier League managers respond when they return to the dugout As a manager, I took a lot of wisdom from someone older than me from outside of the game: a guy called Gordon Brooks, who was an accountant I'd got to know from my time at Middlesbrough. He had a broader perspective and offered up advice which was generally spot on over the years. I remember him once telling me over dinner: 'You know, not everyone could do your job?' At the time, that hadn't registered with me at all. You forget the skills you do have when everyone's questioning you. Speaking to someone from the outside who'd been through the mill and succeeded in life did help. But if I was advising a young manager who'd lost his job, I would be saying that there's no shame attached to not being successful at one club, these days. After all, disappointments in life - and how you deal with them - determine what kind of individual you become. With a bit of luck, Frank will keep Chelsea job I've always felt you need your fair share of luck in management and I do think the stars have aligned for Frank Lampard at Chelsea. He's arriving back at the club at an incredibly good time, because slowly but surely the new buys there are starting to grasp the nettle and show what is needed to succeed at a top Premier League side. Their football is good enough to win games. The team lacks only one key ingredient - a centre forward. Frank Lampard has returned to take over at Chelsea as interim boss until the end of the season I think Frank will get this group winning football matches again. In his previous incarnation as Chelsea manager he got a punch on the nose and he will be richer from that experience. Foreign managers are always in fashion. The latest is Julian Nagelsmann. But it's more than possible that Frank will improve results at the club and if that happens, he would certainly deserve the chance to manage there permanently. Personally, I would love to see that and it would also be very good to see a British manager in one of our top jobs. We all know what Napoleon said about wanting 'lucky generals'. I believe this is a very good appointment. Share or comment on this article: GRAEME SOUNESS: Harry Kane is a very fine player but goes down far too readily e-mail 177 shares Add comment Comments 17 Share what you think Newest Oldest Best rated Worst rated View all The comments below have been moderated in advance. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-04-07 18:32:21","image_url":"https://i.dailymail.co.uk/1s/2023/04/07/17/69599767-0-image-a-10_1680886603615.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"IPL 2023: A Giant(s) leap to the top","link":"https://indianexpress.com/article/sports/ipl/ipl-2023-lucknow-super-giants-vs-sunrisers-hyderabad-match-report-8544768/","keywords":["IPL 2023","Sports"],"creator":["Rahul Pandey"],"video_url":null,"description":null,"content":"Synopsis: LSG’s spinners knock out SRH batsmen before scratchy Rahul and confident Pandya orchestrate chase On a surface that was more in sync with the Border-Gavaskar Trophy, Lucknow Super Giants eviscerated Sunrisers Hyderabad. The surface, layered in black soil, was slow and low and abetted the trio of Lucknow’s spinners—Krunal Pandya. Amit Mishra and Ravi Bishnoi—whose combined figures read 12-0-67-6. Restricting the visitors to 121, they overhauled the target without much ado. Spin treat Recommended for you 1 IPL 2023: Moeen Ali says MI-CSK rivalry is like that between Manchester United and Liverpool 2 IPL 2023, LSG vs SRH emotional rollercoaster: Harry Brook’s struggles, stubborn stumps, no place for specialist keepers & first over specialist Kyle Mayers Right from the first delivery Kyle Mayers bowled, it was evident that slower bowlers held the keys on this surface. Krunal Pandya was introduced as early as the third over, and a wicket came off his fifth delivery of the night. Tossed up and slow, Mayank Agarwal looked to chip it over cover but played it too early and handed a catch to Marcus Stoinis in the ring. A soft dismissal rather. It was not one of those pitches where you could just thrust your front-foot and drive; it was not one where you could hang back and work the ball through the leg-side. It was where you needed quick feet and hands, besides a quicker brain to score runs. A low stooping stance too could have benefitted. Just when Rahul Tripathi and Anmolpreet Singh seemed to have cracked the code, Pandya struck twice off two balls. A flatter one that was angled trapped Anmolpreet in front, which on review turned out to be an umpire’s call lbw dismissal. The next ball, a bit more tossed up, spun away from a driving Aiden Markram to hit the off-stump. Krunal Pandya on song here! Picks up two key wickets in as many deliveries. Anmolpreet Singh and Aiden Markram depart. Live – https://t.co/7Mh0bHCrTi #TATAIPL #LSGvSRH #IPL2023 pic.twitter.com/33W5Uf4Gpv — IndianPremierLeague (@IPL) April 7, 2023 After Pandya completed his second best figures (3/18) in this format, Ravi Bishnoi grabbed a moment of his own in the next over with a composed four-ball setup to remove Harry Brooks. Googly, googly, googly, and a leg-break. He was stumped. “It was difficult to play standstill on this wicket, I knew he’d step out,” Bishnoi would reveal the recipe post-innings. In stepped the second most successful spinner in the league’s history, Amit Mishra . It’s 2023, he turned 40 last year, yet remains an influential figure. It seemed he has only become agiler as he pounced on a low catch inside the 30-yard circle to eject Rahul Tripathi. His 167th and 168th IPL dismissals came in the penultimate over as Hyderabad attempted to bow out big. Washington Sundar ’s first aggressive shot of the innings off a tossed up delivery went straight to Deepak Hooda at long-on. A delivery later, Adil Rashid advanced down but was unable to clear the longer straight boundary. Lucknow mentor Gautam Gambhir had suggested at the IPL auction that the Impact Player brought about the opportunity for the likes of Mishra to feature more in the league. On Friday, the team clearly knew the wicket they were playing on as they started off with the 40-year-old and subbed him for Ayush Badoni. Brisk start Advertisement The target of 122 was never going to be daunting, and LSG openers KL Rahul and Kyle Mayers went about methodically, compiling 35 runs in 4.5 overs. Though the in-form Mayers perished to Fazalhaq Farooqi and Bhuvneshwar Kumar took out Deepak Hooda with a stunning left-handed return catch, the target was never going to intimidate LSG. Nicholas Pooran finishes things off in style. @LucknowIPL chase down the target with 4 overs to spare as they beat #SRH by 5 wickets. Scorecard – https://t.co/7Mh0bHCrTi #TATAIPL #LSGvSRH #IPL2023 pic.twitter.com/STXF5KLMuI — IndianPremierLeague (@IPL) April 7, 2023 To Rahul’s support came Pandya, bubbling with the confidence of three wickets. With Rahul, he combined 55 relatively risk-free 55 runs. Pandya’s contribution was 34, off 23 balls, but by the time he departed the chase was almost sewn up, LSG requiring just 22 runs from 46 balls. Scratchy Rahul Also Read 'I told him over the phone': Ashish Nehra reveals how Gujarat Titans appo... IPL 2023 Live Streaming Details: How to watch IPL matches live online and... MS Dhoni unlikely to play IPL opener due to injury IPL 2022: Rinku Singh, who nearly became a sweeper, wins it for KKR Coming into the IPL this season, KL Rahul was under the scanner more so than he has been in the previous editions. Following the T20 World Cup elimination last year, Rahul was among the senior players dropped from India’s shortest format team in the bilaterals that followed. A woeful run with the bat and a vice-captaincy snub midway through the Test series against Australia earlier this year further cast a shadow over his role in Indian cricket. The conditions were tough but the @LucknowIPL Captain stood tall in the chase. @klrahul becomes our Top Performer from the second innings. A look at his batting summary 👇 #TATAIPL #LSGvSRH pic.twitter.com/NaZEl0R39K — IndianPremierLeague (@IPL) April 7, 2023 A 12-ball-eight and an 18-ball-20 in the first two games of this IPL didn’t help his case. With just eight runs left to win and having spent a considerable time in the middle (35 off 31), the Lucknow captain was unable to cap off the game. And of all the strokes, a reverse sweep undid him. The ball from Adil Rashid landed around the middle stump, held the line and crawled underneath his swipe to trap him in front. A Romario Shepherd first ball duck followed but the late scare came a little too late for Hyderabad to capitalise upon as Nicholas Pooran and Marcus Stoinis wrapped up the game with five wickets and 24 deliveries in hand.","pubDate":"2023-04-07 18:26:26","image_url":null,"source_id":"indianexpress","category":["sports"],"country":["india"],"language":"english"},{"title":"मुंबई के खिलाफ भिड़ने से पहले CSK के ऑलराउंडर का बड़ा बयान, बढ़ गया मुकाबले का रोमांच","link":"https://www.indiatv.in/sports/cricket/ipl-2023-mi-vs-csk-is-like-man-united-vs-liverpool-moeen-ali-2023-04-07-949899","keywords":null,"creator":null,"video_url":null,"description":"सीएसके के ऑलराउंडर ने मुंबई इंडियंस के खिलाफ मुकाबले से पहले बड़ा बयान दिया है।","content":"आईपीएल 2023 के 12वें मुकाबले में चेन्नई सुपर किंग्स के सामने सबसे बड़ी दुश्मन माने जाने वाली मुंबई इंडियंस की टीम होने वाली है। ये दोनों ही टीमें पिछले कई सालों से जब भी एक दूसरे के सामने आती हैं तो मुकाबला देखने लायक होता है। वहीं इस मैच पर शुक्रवार को फिर एक बार क्रिकेट फैंस की नजरें टिकी रहेंगी। लेकिन इसी बीच सीएसके के एक ऑलराउंडर ने इस मैच को लेकर बड़ा बयान दिया है। सीएसके के ऑलराउंडर मोईन अली ने शुक्रवार को अपनी टीम और आईपीएल का खिताब रिकॉर्ड पांच बार जीतने वाली मुंबई इंडियंस के बीच कड़ी प्रतिस्पर्धा की तुलना मैनचेस्टर यूनाइटेड और लिवरपूल की फुटबॉल प्रतिद्वंद्विता से की। मुंबई इंडियंस आईपीएल इतिहास की सबसे सफल टीम जबकि चेन्नई सुपरकिंग्स चार खिताब के साथ दूसरे नंबर पर है। साल 2022 में आईपीएल की बड़ी नीलामी के बाद बाद से दोनों टीमें संघर्ष कर रही हैं। मुंबई और चेन्नई की आईपीएल प्रतिद्वंद्विता को आईपीएल की ‘एल क्लासिको’ के नाम से जाना जाता है। दोनों टीमों के बीच 34 मुकाबलों में हालांकि 20 जीत के साथ मुंबई का पलड़ा भारी रहा है। मोईन ने मैच से पहले कहा कि यह एक ऐसा मुकाबला है जिसका मैं वास्तव में इंतजार कर रहा हूं। ये दो सबसे सफल फ्रेंचाइजी टीमों का मुकाबला हैं और दोनों के फैंस की संख्या बहुत ज्यादा है। एक क्रिकेटर के रूप में यह अंतरराष्ट्रीय क्रिकेट के बाहर खेले जाने वाले सबसे बड़े मैचों में से एक है। उन्होंने कहा कि अगर फुटबॉल के नजरिए से देखे तो यह मैच मैनचेस्टर यूनाइटेड और लिवरपूल के मुकाबले की तरह है। ये मुकाबले काफी बड़े होते हैं। उन्होंने चोट से वापसी के बाद लय पाने के लिए संघर्ष कर रहे टीम के मुख्य तेज गेंदबाज दीपक चाहर का बचाव करते हुए कहा कि मुझे लगता है कि उनके पास सिर्फ एक चीज की कमी है और वह है मैच में समय देने की। उसे बुरी तरह चोट लगी थी और वह लंबे समय बाद वापसी कर रहा हैं। एक गेंदबाज के तौर पर आपको मैच में लगातार गेंदबाजी करने की जरूरी होती है। वह टूर्नामेंट के आगे बढ़ने के साथ बेहतर होता जाएगा। उन्होंने कहा कि वह हमारी टीम का बड़ा गेंदबाज है और जब वह लय में रहता है तो पावरप्ले में तीन या चार विकेट निकाल लेते है।","pubDate":"2023-04-07 18:17:20","image_url":null,"source_id":"indiatv","category":["sports"],"country":["india"],"language":"hindi"}]}