{"newsArray":[{"title":"ICC Women's World Cup, India vs West Indies, Live Cricket Score, Live Updates: India 2 Down After Bright Start, Smriti Mandhana Looking Solid - NDTV Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMimgFodHRwczovL3Nwb3J0cy5uZHR2LmNvbS9jcmlja2V0L2ljYy13b21lbnMtY3JpY2tldC13b3JsZC1jdXAtaW5kaWEtd29tZW4tdnMtd2VzdC1pbmRpZXMtd29tZW4tbGl2ZS1jcmlja2V0LXNjb3JlLWxpdmUtdXBkYXRlcy1zZWRkb24tcGFyay1oYW1pbHRvbi0yODE4Mjg40gGgAWh0dHBzOi8vc3BvcnRzLm5kdHYuY29tL2NyaWNrZXQvaWNjLXdvbWVucy1jcmlja2V0LXdvcmxkLWN1cC1pbmRpYS13b21lbi12cy13ZXN0LWluZGllcy13b21lbi1saXZlLWNyaWNrZXQtc2NvcmUtbGl2ZS11cGRhdGVzLXNlZGRvbi1wYXJrLWhhbWlsdG9uLTI4MTgyODgvYW1wLzE?oc=5","keywords":null,"creator":null,"video_url":null,"description":"ICC Women's World Cup, India vs West Indies, Live Cricket Score, Live Updates: India 2 Down After Bright Start, Smriti Mandhana Looking Solid  NDTV SportsIndia Women vs West Indies Women Live Streaming: When And Where To Watch IND-W vs WI-W Live In Your Country? ICC Women's ODI World Cup 2022  Cricket AddictorIndia vs West Indies Live Score, Women's World Cup 2022: India two down after a flying start against West Indies  Times of IndiaMithali Raj Set To Break All-Time Captaincy Record At Women's World Cup  NDTV SportsRecent Match Report - IND Women vs WI Women 10th Match 2021/22  ESPNcricinfoView Full coverage on Google News","content":null,"pubDate":"2022-03-12 01:38:16","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Inside the secret $10m world putting women’s cricket at risk","link":"https://www.cairnspost.com.au/sport/cricket/womens-cricket-emerging-as-immense-betting-market-but-integrity-experts-are-on-edge/news-story/f7ef71ee9e8f72147ec275e54a487b4c","keywords":["Cricket news and galleries","Sport news and galleries","Womens Cricket"],"creator":null,"video_url":null,"description":"Cricket Australia has reinstated a crucial integrity job it slashed during Covid to bolster its assault on corruption amid an explosion of betting on the women’s game.","content":null,"pubDate":"2022-03-12 01:00:00","full_description":null,"image_url":null,"source_id":"cairnspost","country":["australia"],"category":["sports"],"language":"english"},{"title":"India look for 'mental adjustments' in pink ball Test, says Bumrah","link":"https://www.thenews.com.pk/print/940676-india-look-for-mental-adjustments-in-pink-ball-test-says-bumrah","keywords":null,"creator":null,"video_url":null,"description":"BANGALORE: Vice-captain Jasprit Bumrah on Friday said India are still getting used to Test cricket under lights as they take on Sri Lanka in their third pink-ball match at home.The hosts are looking to sweep the two-match series in Bangalore after a thumping opening Test win inside three days.But...","content":null,"pubDate":"2022-03-12 01:00:00","full_description":"BANGALORE: Vice-captain Jasprit Bumrah on Friday said India are still getting used to Test cricket under lights as they take on Sri Lanka in their third pink-ball match at home. .ads_between_content{ height:auto; width:auto; clear: both; text-align: center; } .ads_between_content .story_ads{ } /*@media (max-width:600px){ .ads_between_content{ float:none; margin:0px auto; text-align: center; } }*/ The hosts are looking to sweep the two-match series in Bangalore after a thumping opening Test win inside three days. But Bumrah said the team is entering unchartered territory despite having won their previous two day-night Tests on home soil against Bangladesh in 2019 and England last year. “We have to make mental adjustments while preparing for the pink ball Test,” Bumrah said on the eve of the second match starting Saturday. “Playing under lights, fielding and bowling with pink ball are things we need to get used to and we keep all of these things in mind while in the training session. “We are not used to catching or bowling with the pink ball. It is still a fairly new concept for all of us and we are trying to learn with every Test.”","image_url":null,"source_id":"thenews","country":["pakistan"],"category":["sports"],"language":"english"},{"title":"Bradford (Park Avenue) to host Opening Boundaries event","link":"https://www.thetelegraphandargus.co.uk/sport/19987888.bradford-park-avenue-host-opening-boundaries-event/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"AFTER a two-year break, due to COVID, Opening Boundaries are delighted to announce they will be hosting the UK Armed forces women’s cricket team for the annual Bowling Out Gender Inequality festival.","content":null,"pubDate":"2022-03-12 01:00:00","full_description":"AFTER a two-year break, due to COVID, Opening Boundaries are delighted to announce they will be hosting the UK Armed forces women’s cricket team for the annual Bowling Out Gender Inequality festival. The game will be played at Park Avenue Bradford which has seen a huge increase in women and girls’ cricket over the last few years. Halima Khan, founder of the campaign commented saying “there is no hiding from the challenges of the last few years. COVID has impacted communities and created huge disparities leading to an increase in inequalities. Coupled with the issues facing sport and Yorkshire Cricket in particular around racism, we want to use this event to bring back the importance of how sport can make a positive difference in creating social change” “We are looking forward to hosting the UKAF Women’s team and showcasing, when we create equitable opportunities in sport, everyone can thrive in a culture where they feel a sense of belonging”. The event will be held on Friday 29th July and starts from 10am. The morning will consist of an opportunity for young people to come along and take part in cricket activities. The UKAF Military engagement will also be onsite to support and provide team building activities for anyone to take part in and raise awareness of what they do and can offer. All activities will be FREE of charge to the whole community. Ros Brown, Manager of the UKAF Women’s stated, “the UK Armed Forces Women’s cricket squad has a longstanding relationship with “Opening Boundaries” a charity that seeks to address gender inequalities nationally and internationally. They have been privileged to take part in cricket themed community engagement events for girls and women since 2017 and are therefore delighted and honoured to return to Bradford in partnership with Opening Boundaries to showcase the game they love. Sport within the UK Armed Forces remains a vital means of growing leadership, followership, team spirit and respect through inclusivity and diversity”. “Sporting fixtures provide opportunities open to all that are engaging, challenging, and demanding in equal measure. Sport has the power to inspire and empower women and girls from all backgrounds and can provide them with a platform to develop, gain confidence and better achieve their potential. The campaign maps perfectly with the core values of the Armed Forces; the recent opening up of combat roles to women shows the importance that the military places on gender equality within the Armed Forces”. The women’s game will be a played as a Twenty 20 in the afternoon and we encourage everyone to come along and support a great cause. Lord Kamlesh Patel, Yorkshire County Cricket Club Chair said: “I am delighted that Opening Boundaries will be returning to Park Avenue for this hugely important event. “Opening Boundaries do a tremendous amount of work to raise awareness of gender inequality, and Yorkshire Cricket is thrilled to be involved in the return of the annual event in order to help promote equality in sport and wider society.” Cllr Sarah Ferriby, Bradford Council’s Executive Member for Healthy People and Places said: “I am delighted that Opening Boundaries are able to put on the annual Bowling Out Gender Inequality festival again as we return to normal following the pandemic. To host the UK Armed Forces women’s cricket team is a real honour and I know that they will be given a warm welcome. There is no room for inequalities in the Bradford district and I applaud any action being taken to ensure everyone can be treated equally and with respect.” If you would like to get involved or for further information, please contact Halima Khan at info@openingboundaries.org","image_url":"https://www.thetelegraphandargus.co.uk/resources/images/13567808/?type=app&htype=0","source_id":"thetelegraphandargus","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Pakistan on brinkat World Cup after SA loss","link":"https://www.thenews.com.pk/print/940678-pakistan-on-brinkat-world-cup-after-sa-loss","keywords":null,"creator":null,"video_url":null,"description":"MOUNT MAUNGANUI: Pakistan slumped to their third straight defeat at the Women’s Cricket World Cup against South Africa on Friday, leaving their hopes of making the playoffs under a cloud.Pakistan came agonisingly close to victory after going into the fixture ranked last in the eight-team...","content":null,"pubDate":"2022-03-12 01:00:00","full_description":"MOUNT MAUNGANUI: Pakistan slumped to their third straight defeat at the Women’s Cricket World Cup against South Africa on Friday, leaving their hopes of making the playoffs under a cloud. .ads_between_content{ height:auto; width:auto; clear: both; text-align: center; } .ads_between_content .story_ads{ } /*@media (max-width:600px){ .ads_between_content{ float:none; margin:0px auto; text-align: center; } }*/ Pakistan came agonisingly close to victory after going into the fixture ranked last in the eight-team tournament’s standings after heavy losses to India and Australia. They lost two wickets in the final over, finishing on 217 all out chasing a target of 224. South Africa captain Sune Luus said it was a nerve-shredding encounter for her team, who beat Bangladesh in their opening match. “You’ve got to love a World Cup game, no game’s easy,” she said. “I’m just happy with the team’s performance, even though we’re not playing our best cricket yet.” Luus said before the match she wanted her batters to show more intensity than they displayed in their victory over Bangladesh, when they were restricted to 207 runs. Opener Laura Wolvaardt stuck to the script, hitting an aggressive 75, but the rest of the top order struggled against Pakistan’s spinners. The middle order offered more resistance, with Luus contributing 62 and Chloe Tryon and Trisha Chetty adding 31 apiece. Spinner Ghulam Fatima and all-rounder Fatima Sana were Pakistan’s most effective bowlers, each taking three wickets. The pressure exerted by the bowling attack was undermined by four dropped catches, but South Africa’s total of 223-9 looked far from imposing. Pakistan made a sluggish start to the run chase after Shabnim Ismail took two wickets in successive balls, but Nahida Khan and Omaima Sohail came together for a crucial 69-run partnership. Khan departed for 40 and Sohail held on for 65 but neither could bat through to the end. With Pakistan needing just over a run per ball from the final 10 overs, it fell to Nida Dar to try to guide the tailers to victory. She made a fine effort, making 55 before being run out with Pakistan needing 11 runs from seven balls and her team falling just short of the target.","image_url":null,"source_id":"thenews","country":["pakistan"],"category":["sports"],"language":"english"},{"title":"IND-W vs WI-W Dream11 Team Prediction, Fantasy Cricket Hints: Captain, Probable Playing 11s, Team News; Injury Updates For Today’s IND-W vs WI-W ODI World Cup Match at Seddon Park, Hamilton 6:30 AM IST March 12","link":"https://zeenews.india.com/cricket/ind-w-vs-wi-w-dream11-team-prediction-fantasy-cricket-hints-captain-probable-playing-11s-team-news-injury-updates-for-today-s-ind-w-vs-wi-w-odi-world-cup-match-at-seddon-park-hamilton-630-am-ist-march-12-2444485.html","keywords":null,"creator":null,"video_url":null,"description":"India vs West Indies Women Dream11 Team Prediction India Women vs West Indies Women ICC Women's World Cup ODI- Check My Dream11 Team, Best players list of IND-W vs WI-W, India women Dream11 Team Player List, West Indies women Dream11 Team Player List, Dream11 Guru Tips, Fantasy Cricket Tips, Fantasy Cricket Tips, Fantasy Playing Tips.","content":null,"pubDate":"2022-03-11 23:00:00","full_description":"After a crushing 62-run defeat to hosts New Zealand, India`s search for batting returns continues when they take on an undefeated West Indies in their third league match of ICC Women`s Cricket World Cup at Seddon Park on Saturday. In both matches, India`s top-order batting hasn`t fired, resulting in lack of urgency in the first 10 overs. Now at fifth place in the points table, India need to get their wrongs right with matches against defending champions England and six-time winners Australia coming in the upcoming week. But it is easier said that done as West Indies have been the surprise giant killers of the tournament, defeating New Zealand and England by three and seven runs respectively in their first two matches. Match Details TOSS: India Women vs West Indies Women ICC Women’s World Cup 2022 toss between IND-W vs WI-W will take place at 6:00 AM IST – March 12 Time: 6:30 AM IST. Venue: Seddan Park, Hamilton IND-W vs WI-W Dream11 Team Shemaine Campbelle, Deandra Dottin, Smriti Mandhana(c), Chedean Nation, Harmanpreet Kaur, Sneh Rana, Hayley Matthews(vc), Stafanie Taylor, Shamilia Connell, Pooja Vastrakar, Jhulan Goswami IND-W vs WI-W Playing 11 India Women : Smriti Mandhana, Yastika Bhatia, Deepti Sharma, Mithali Raj (c), Harmanpreet Kaur, Richa Ghosh (wk), Sneh Rana, Pooja Vastrakar, Jhulan Goswami, Meghna Singh, Rajeshwari Gayakwad West Indies Women : Deandra Dottin, Hayley Matthews, Kycia Knight, Stafanie Taylor (c), Shemaine Campbelle (wk), Chedean Nation, Chinelle Henry, Aaliyah Alleyne, Shamilia Connell, Anisa Mohammed, Shakera Selman IND-W vs WI-W Squads India : Mithali Raj (Captain), Harmanpreet Kaur (vice-captain), Smriti Mandhana, Shafali Verma, Yastika Bhatia, Deepti Sharma, Richa Ghosh (wicket-keeper), Sneh Rana, Jhulan Goswami, Pooja Vastrakar, Meghna Singh, Renuka Singh Thakur, Taniya Bhatia (wicket-keeper), Rajeshwari Gayakwad, Poonam Yadav. West Indies : Stafanie Taylor (captain), Anisa Mohammed, Aaliyah Alleyne, Rashada Williams, Chedean Nation, Shemaine Campbelle, Chinelle Henry, Deandra Dottin, Hayley Matthews, Sheneta Grimond, Kycia Knight, Kyshona Knight, Qiana Joseph, Shamilia Connell, Shakera Selman. With IANS inputs","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"WA win Marsh Cup final over NSW","link":"https://www.news.com.au/sport/cricket/wa-win-marsh-cup-final-over-nsw/video/ea2ac31dbca589fe7723d3f7a822d4b1","keywords":null,"creator":null,"video_url":null,"description":"Cricket: Western Australia are Marsh Cup champions after an 18 run win over New South Wales in Melbourne.","content":null,"pubDate":"2022-03-11 22:36:17","full_description":null,"image_url":null,"source_id":"news","country":["australia"],"category":["sports"],"language":"english"},{"title":"WA win Marsh Cup final over NSW","link":"https://www.cairnspost.com.au/sport/cricket/wa-win-marsh-cup-final-over-nsw/video/ea2ac31dbca589fe7723d3f7a822d4b1","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket: Western Australia are Marsh Cup champions after an 18 run win over New South Wales in Melbourne.","content":null,"pubDate":"2022-03-11 22:36:17","full_description":null,"image_url":null,"source_id":"cairnspost","country":["australia"],"category":["sports"],"language":"english"},{"title":"Masseuse opens up about final Shane Warne visit hours before his death","link":"https://www.foxsports.com.au/cricket/australia/masseuse-opens-up-about-final-shane-warne-visit-hours-before-his-death/news-story/1cca92684d1aa209f874e993360a9c10","keywords":null,"creator":null,"video_url":null,"description":"A masseuse who reportedly gave Shane Warne a massage hours before his death has spoken about her final interaction with the cricket legend.","content":null,"pubDate":"2022-03-11 22:25:00","full_description":"A masseuse who reportedly gave Shane Warne a massage hours before his death has spoken about her final interaction with the cricket legend. The Daily Mail reports the masseuse, known as Bovi, was one of two women to visit Warne in his room at the Samujana resort on Koh Samui. The publication reports Bovi told a friend: “Shane was a really lovely man ... he was very much at ease and comfortable. “He was very friendly and put us at ease. ”His massage lasted for an hour and everything was fine. He seemed perfectly healthy and gave us a good tip when we finished. “He seemed fine when we left his room. He said goodbye and that was it, everything was normal. “We were both so shocked when we found out later that he had died.” Warne was the greatest we’ve ever seen. (Photo by Hamish Blair/Getty Images) Source: Getty Images The Sun reports another masseuse, nicknamed Pen, was set to give Warne a foot massage later in the afternoon but there was no reply when she and a maid knocked on the door of his room. “Shane was having a massage and the two other girls left before me,” Pen said earlier this week. “I had a text saying that I would do his nails and a foot massage when they had finished. “I think Shane was sleeping in his room the whole time because I didn’t see him while I was giving a nail treatment to his friend. “I was supposed to go to see Shane after that but when the maid knocked on his door there was no reply. “There was no sound in the room and they said he was sleeping, so I left. “When I got home I was told he had died, so I was really sad. I think that he had been dead while I was in the villa.” Shane Warne was one of a kind. Picture: Instagram Source: Instagram He’s gone too soon. (Photo by Daniel Pockett/Getty Images) Source: Getty Images Warne died last week of a suspected heart attack after unsuccessful efforts to revive him when he was found unresponsive in his room by friends. An autopsy declared Warne died of natural causes and his body was flown home to Melbourne via private jet on Thursday night . Family and friends, including Warne’s personal assistant Helen Nolan, were at Essendon Fields Airport to greet the charter flight. In a heartbreaking image, Warne’s mother Brigitte was spotted inside the hangar holding a white rose by her side as her son’s body was returned home. Warne’s son Jackson and ex-wife Simone Callahan were among those at the airport. Warne's distraught family was at the airport when his body returned home on Thursday night. Picture: Jake Nowakowski Source: News Corp Australia Warne’s state funeral will take place in Melbourne on March 30, after a private family service is expected to be held towards the end of next week. The Daily Telegraph reports Coldplay lead singer Chris Martin — one of Warne’s good mates — wants to be involved in the public service, which will be held at the MCG. Warne’s family revealed he had been suffering with heart troubles and asthma in the weeks leading up to his death, while his manager James Erskine said the spinner had just completed a 14-day liquid only diet.","image_url":null,"source_id":"foxsports","country":["australia"],"category":["sports"],"language":"english"},{"title":"Warne revolutionised the art of leg spin","link":"https://www.bangkokpost.com/sports/2278051/warne-revolutionised-the-art-of-leg-spin","keywords":null,"creator":null,"video_url":null,"description":"The sad news of Shane Warne's death in Thailand at the young age of 52 came as a huge shock especially following so closely the passing of another Aussie cricket legend Rodney Marsh, aged 74.","content":null,"pubDate":"2022-03-11 21:00:00","full_description":"The sad news of Shane Warne's death in Thailand at the young age of 52 came as a huge shock especially following so closely the passing of another Aussie cricket legend Rodney Marsh, aged 74. Warne's extraordinary achievements have been well documented over the past week, so I won't list them here. Suffice to say he was the best spinner I've ever witnessed and played a huge role in reviving cricket around the world. He brought the dying art of leg spin to the forefront. For years leg spinners had been regarded as too risky because they were considered to be too expensive -- and usually were. Although many leg spinners were capable of turning the ball sharply, few had the required control which invariably meant easy boundaries for batsmen. Leg spinners were regarded at best as a luxury, at worst the weakest link. It was not surprising that few schoolboy cricketers aspired to take up that role. Warne not only revived the art of leg spin, he turned it into a hugely effective weapon as time and again he outwitted the best batsman in the world. No matter what country he was playing in, there would be a buzz of excitement amongst spectators when he came on to bowl. He was an intelligent bowler always working on ways to get a wicket using his arsenal which included googlies, flippers and sliders. He loved the challenge of bowling to top class batsmen and his tussles with the likes of India's Sachin Tendulkar and West Indies' Brian Lara were gripping. Lara was \"heartbroken\" and visibly shaken at the news of Warne's death. Warne inspired a whole new generation of players. Before he came along, fast bowlers were regarded as the key to success in Test cricked as displayed by the formidable West Indies pace attack over two decades. At that time, one of the few leg-spinners to achieve success was Pakistan's Abdul Qadir. Warne introduced himself to the world as only he could do … a wicket with his very first ball in Ashes cricket on June 4, 1993 at Old Trafford. And what a delivery it was, quickly becoming known as \"the ball of the century.\" He bamboozled England's Mike Gatting with a ball that landed outside leg stump and then spun in extraordinary fashion, taking his off stump and it was witnessed on television by millions. For a moment, Gatting just stood there in total disbelief. I had the opportunity to ask Gatting about that ball when he came to Thailand for a Sixes tournament some years ago. He laughed, shook his head and said: \"I have never ever seen a ball turn that far.\" Spectators were stunned and the BBC called it \"the delivery that changed history.\" That ball proved a huge psychological blow for years to come. England batsmen just could not handle Warne. It may seem a paradox but Warne was hugely popular in England despite his active role in many batting collapses. He played for Hampshire from 2000-2007 and was skipper in three of those years and had a stand named after him. Former Hampshire teammate Giles White commented \"his attitude to the game just transformed the way we looked at it. He always wanted to win, there was no fear of failure.\" He also observed \"a night out with Warnie was your best night out ever.\" Warne's death inevitably overshadowed the passing of Marsh only the day before. Warne had sent condolences to the Marsh family just a few hours before his own death. Marsh was an accomplished wicket-keeper and useful batsman, earning 96 caps for Australia. He made his debut in the 1970-71 Ashes series and became a familiar figure behind the stumps. The great Dennis Lillee was in the same Test team for much of that time and scorecards read \"c Marsh b Lillee\" an astonishing 96 times. His Test career did not start well however, being nicknamed \"Iron Gloves\" by captain Ian Chappell after spilling chances in his opening Test, but he went on to record 355 dismissals. Just like Warne, although he was a fierce competitor when representing Australia, once he retired he had no qualms about helping cricket in other countries. He went on to be part of the England coaching set-up and even became an England selector. Warne and Marsh will be sadly missed, two exceptional cricketers admired around the world.","image_url":null,"source_id":"bangkokpost","country":["thailand"],"category":["sports"],"language":"english"},{"title":"RCB captain 2022 announcement date: Who is the new captain of RCB in 2022 IPL?","link":"https://thesportsrush.com/cricket-news-rcb-captain-2022-announcement-date-who-is-the-new-captain-of-rcb-in-2022-ipl/","keywords":["Cricket","IPL 2022","RCB","Indian Premier League","IPL","Royal Challengers Bangalore"],"creator":["Gurpreet Singh"],"video_url":null,"description":"RCB captain 2022 announcement date: RCB remain the lone amongst the ten franchises who have not named their captain for the upcoming season. The Cricketing fraternity is mere couple of weeks away from the commencement of yet another season of the Indian Premier League (IPL) which would kick-start with the opening encounter featuring the last… The post RCB captain 2022 announcement date: Who is the new captain of RCB in 2022 IPL? appeared first on The SportsRush.","content":"RCB captain 2022 announcement date: RCB remain the lone amongst the ten franchises who have not named their captain for the upcoming season. The Cricketing fraternity is mere couple of weeks away from the commencement of yet another season of the Indian Premier League (IPL) which would kick-start with the opening encounter featuring the last season finalists-CSK and KKR on March 26 at Mumbai’s Wankhede Stadium. The schedule and fixtures of the league stages have been announced by the BCCI, with Mumbai and Pune to host the teams across four venues. With teams having already announced their respective captains for the season, the Royal Challengers Bangalore (RCB) remain the lone franchise who are yet to name one. With Virat Kohli having relinquished his post as skipper of the franchise last year, fans are expecting their another retained player-Australia’s Glenn Maxwell, who has been leading Melbourne Stars in BBL for quite some years too, as the most-suited man to take up the role with the team going forward. A costly acquisition of former Proteas skipper Faf du Plessis in the side, has also made him a fitting option to shoulder the captaincy responsibility. RCB captain 2022 announcement date As per the RCB’s social media handles, the management is in all readiness to organize a peculiar event- ‘The RCB Unbox’ on Saturday, March 12 in Benguluru, wherein the announcement of the franchise’s new skipper plus a set of other major decisions will take place along with loads of entertainment including singing performances, DJs, bands, rappers, beatboxers and so forth. The power-packed event will run for 8 hours straight from 12 pm to 8 pm, with a free entry for all. The #RCBUnbox event is not just about cricket, but we also have a lot of entertainment in store & guess what, it’s free-entry for all! Walk-in & enjoy Stay tuned for the full roster of artists performing on 12th March from 12pm to 8pm.#PlayBold #UnboxTheBold #ForOur12thMan pic.twitter.com/uoo3LUAK1C — Royal Challengers Bangalore (@RCBTweets) March 10, 2022 If you’re not in Bengaluru or not able to come down to Museum Cross Road, Church Street tomorrow, we’ve got you covered. We’ll be LIVE STREAMING all the important moments of #RCBUnbox event on our IG, FB, YouTube & RCB Official App.#PlayBold #UnboxTheBold #ForOur12thMan pic.twitter.com/pLvwFCBT6I — Royal Challengers Bangalore (@RCBTweets) March 11, 2022 Also, as per reports, the franchise would even launch a new jersey for the upcoming season along with the announcement of some possible changes in the coaching/support staff. Having said that, the franchise management have not yet come up with a date for the commencement of the all-important training and practice sessions of its players despite mere two weeks left for the start of the season. The post RCB captain 2022 announcement date: Who is the new captain of RCB in 2022 IPL? appeared first on The SportsRush.","pubDate":"2022-03-11 19:47:24","full_description":"RCB captain 2022 announcement date: RCB remain the lone amongst the ten franchises who have not named their captain for the upcoming season. The Cricketing fraternity is mere couple of weeks away from the commencement of yet another season of the Indian Premier League (IPL) which would kick-start with the opening encounter featuring the last season finalists-CSK and KKR on March 26 at Mumbai’s Wankhede Stadium. The schedule and fixtures of the league stages have been announced by the BCCI, with Mumbai and Pune to host the teams across four venues. With teams having already announced their respective captains for the season, the Royal Challengers Bangalore (RCB) remain the lone franchise who are yet to name one. With Virat Kohli having relinquished his post as skipper of the franchise last year, fans are expecting their another retained player-Australia’s Glenn Maxwell, who has been leading Melbourne Stars in BBL for quite some years too, as the most-suited man to take up the role with the team going forward. A costly acquisition of former Proteas skipper Faf du Plessis in the side, has also made him a fitting option to shoulder the captaincy responsibility. As per the RCB’s social media handles, the management is in all readiness to organize a peculiar event- ‘The RCB Unbox’ on Saturday, March 12 in Benguluru, wherein the announcement of the franchise’s new skipper plus a set of other major decisions will take place along with loads of entertainment including singing performances, DJs, bands, rappers, beatboxers and so forth. The power-packed event will run for 8 hours straight from 12 pm to 8 pm, with a free entry for all. The #RCBUnbox event is not just about cricket, but we also have a lot of entertainment in store & guess what, it’s free-entry for all! Walk-in & enjoy🤩 Stay tuned for the full roster of artists performing on 12th March from 12pm to 8pm.👊🏻 #PlayBold #UnboxTheBold #ForOur12thMan pic.twitter.com/uoo3LUAK1C — Royal Challengers Bangalore (@RCBTweets) March 10, 2022 If you’re not in Bengaluru or not able to come down to Museum Cross Road, Church Street tomorrow, we’ve got you covered. We’ll be LIVE STREAMING all the important moments of #RCBUnbox event on our IG, FB, YouTube & RCB Official App.🤩🙌🏻 #PlayBold #UnboxTheBold #ForOur12thMan pic.twitter.com/pLvwFCBT6I — Royal Challengers Bangalore (@RCBTweets) March 11, 2022 Also, as per reports, the franchise would even launch a new jersey for the upcoming season along with the announcement of some possible changes in the coaching/support staff. Having said that, the franchise management have not yet come up with a date for the commencement of the all-important training and practice sessions of its players despite mere two weeks left for the start of the season.","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Masseuse opens up on final Warne visit","link":"https://www.news.com.au/sport/sports-life/masseuse-opens-up-about-final-shane-warne-visit-hours-before-his-death/news-story/88fd444cda736f4263e56e45b40e4e55","keywords":null,"creator":null,"video_url":null,"description":"A masseuse who reportedly gave Shane Warne a massage hours before his death has spoken about her final interaction with the cricket legend.","content":null,"pubDate":"2022-03-11 19:38:00","full_description":"A masseuse who reportedly gave Shane Warne a massage hours before his death has spoken about her final interaction with the cricket legend. The Daily Mail reports the masseuse, known as Bovi, was one of two women to visit Warne in his room at the Samujana resort on Koh Samui. The publication reports Bovi told a friend: “Shane was a really lovely man ... he was very much at ease and comfortable. “He was very friendly and put us at ease. ”His massage lasted for an hour and everything was fine. He seemed perfectly healthy and gave us a good tip when we finished. “He seemed fine when we left his room. He said goodbye and that was it, everything was normal. “We were both so shocked when we found out later that he had died.” The Sun reports another masseuse, nicknamed Pen, was set to give Warne a foot massage later in the afternoon but there was no reply when she and a maid knocked on the door of his room. “Shane was having a massage and the two other girls left before me,” Pen said earlier this week. “I had a text saying that I would do his nails and a foot massage when they had finished. “I think Shane was sleeping in his room the whole time because I didn’t see him while I was giving a nail treatment to his friend. “I was supposed to go to see Shane after that but when the maid knocked on his door there was no reply. “There was no sound in the room and they said he was sleeping, so I left. “When I got home I was told he had died, so I was really sad. I think that he had been dead while I was in the villa.” Warne died last week of a suspected heart attack after unsuccessful efforts to revive him when he was found unresponsive in his room by friends. An autopsy declared Warne died of natural causes and his body was flown home to Melbourne via private jet on Thursday night . Family and friends, including Warne’s personal assistant Helen Nolan, were at Essendon Fields Airport to greet the charter flight. In a heartbreaking image, Warne’s mother Brigitte was spotted inside the hangar holding a white rose by her side as her son’s body was returned home. Warne’s son Jackson and ex-wife Simone Callahan were among those at the airport. Warne’s state funeral will take place in Melbourne on March 30, after a private family service is expected to be held towards the end of next week. The Daily Telegraph reports Coldplay lead singer Chris Martin — one of Warne’s good mates — wants to be involved in the public service, which will be held at the MCG. Warne’s family revealed he had been suffering with heart troubles and asthma in the weeks leading up to his death, while his manager James Erskine said the spinner had just completed a 14-day liquid only diet. Quincy Isaiah scored the role of a lifetime playing NBA icon Magic Johnson in a hit new TV show, but not everything went to script. Aussie sporting icon Joel Parkinson has been filmed confronting YouTubers over a “disrespectful” stunt during the floods crisis. Boxer Jake Paul has revealed who he really is after reportedly being left shattered by his break-up just weeks after marriage rumours.","image_url":null,"source_id":"news","country":["australia"],"category":["sports"],"language":"english"},{"title":"KLS vs ROW Dream11 Prediction: Fantasy Cricket Tips, Today's Playing 11 and Pitch Report for MCA T20 Clubs Invitation, Match 1","link":"https://www.sportskeeda.com/fantasy-cricket-mantra/kls-vs-row-dream11-prediction-fantasy-cricket-tips-today-s-playing-11-pitch-report-mca-t20-clubs-invitation-match-1?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Fantasy Cricket Mantra"],"creator":["Anjishnu Roy"],"video_url":null,"description":null,"content":null,"pubDate":"2022-03-11 19:27:08","full_description":"KL Star CC will take on the Royal Warriors in the first match of the MCA T20 Clubs Invitation at the Kinrara Academy Oval in Kuala Lumpur on Saturday. Four teams are competing in this tournament, with Global Stars CC and Tamco Warriors being the other two teams. Top-order batter Krishna Chaitanya Verma will be captaining the Royal Warriors. Meanwhile, KL Star CC will be led by Abhishek Deshpande and both sides have a strong middle-order. KLS XI Wan Muhammad, Shrinivas Iyer- I, Abhishek Deshpande (C), Jerin Raj, Vijay Manthri, Peter Issac, Chandan Kumar, Hafiz Shahid-Iqbal, Tanveer Khan, John Rathod, Srinivasan Selvam ROW XI Harinderjit Singh-Sekhon, Sandeep Taneeru, Krishna Chaitanya Varma (C), Devendiran Paramanantham, Senthil Manickam Rajendran, Syed Aziz, Thomas Bernando Antonysamy, Naga-Vijay Marakani, Shahul Hameed Sahib, Abraham Joseph Cherian, Surendra Reddy KLS vs ROW, MCA T20 Clubs Invitation, Final Date and Time: 12th March, 2022, 9:30 AM IST Venue: Kinrara Academy Oval, Kuala Lumpur Weather conditions are predicted to be overcast and pacers might find assistance, at least in the initial stages of the game. Batting is likely to get easier as the match progresses and both sides would love to chase. Wicketkeeper W. Muhammad has been in great form lately and will be a wonderful wicket-keeper choice for your KLS vs ROW Dream11 fantasy team. Batters Devendiran Paramanantham has amassed 118 runs in 16 T20 matches. He has also picked up eight wickets and can surprise with the ball in hand. All-rounders S. Aziz has plenty of experience and has played 102 T20 matches. Aziz has scored 2773 runs at an average of 32.62 and is an aggressive batter. He has also picked up 62 wickets and will be a superb captaincy choice for your KLS vs ROW Dream11 fantasy side. P. Isaac is another player you must have in your Dream11 fantasy team. He has scalped 14 wickets in only nine matches at a terrific economy rate of 5.92 runs per over. Bowlers T. Khan is a great bowler who has plenty of variations in his arsenal. He is expected to start the tournament with a bang. S. Aziz (ROW) P. Isaac (KLS) H. Shahid Iqbal (KLS) S. Iyer (KLS) D. Paramanantham (ROW) S. Aziz: 2773 runs and 62 wickets P. Isaac: 14 wickets H. Shahid Iqbal: 198 runs and 13 wickets D. Paramanantham: 118 runs and eight wickets Fantasy Suggestion #1: W. Muhammad, A. Deshpande, D. Paramanantham, K. Chaitanya Varma, S. Iyer, H. Shahid Iqbal, P. Isaac, S. Aziz, N. Babu Marakani, S. Reddy, T. Khan Captain: S. Aziz , Vice-Captain: S. Iyer Fantasy Suggestion #2: W. Muhammad, D. Paramanantham, K. Chaitanya Varma, S. Iyer, T. Bernando Antonysamy, H. Shahid Iqbal, P. Isaac, S. Aziz, N. Babu Marakani, S. Reddy, T. Khan Captain: P. Isaac , Vice-Captain: D. Paramanantham","image_url":"https://static.sportskeeda.com/editor/2022/03/c85f3-16470181598511-1920.jpg","source_id":"sportskeeda","country":["india"],"category":["sports"],"language":"english"},{"title":"UAE vs NAM Dream11 Prediction: Fantasy Cricket Tips, Today's Playing 11 and Pitch Report for ICC Men’s CWC League 2, Match 65","link":"https://www.sportskeeda.com/fantasy-cricket-mantra/uae-vs-nam-dream11-prediction-fantasy-cricket-tips-today-s-playing-11-pitch-report-icc-men-s-cwc-league-2-match-65?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Fantasy Cricket Mantra"],"creator":["Anjishnu Roy"],"video_url":null,"description":null,"content":null,"pubDate":"2022-03-11 19:27:08","full_description":"United Arab Emirates will take on Namibia in the 65th match of the ICC Men’s CWC League 2 at the Sharjah Cricket Stadium in Sharjah on Saturday. UAE occupy the third spot in the points table and have 14 points to their name from 13 matches so far. They suffered a defeat against Oman in their previous match and ended up losing the contest by just eight runs while chasing a target of 221. Meanwhile, Namibia have accrued 12 points and are fifth in the points table after 10 matches. They lost their previous encounter against UAE by three runs and will be hoping to come out on top here. UAE XI Muhammad Waseem, Chirag Suri, Vriitya Aravind, Asif Khan, Chundangapoyil Rizwan, Basil Hameed, Rohan Mustafa, Kashif Daud, Ahmed Raza (c), Zahoor Khan, Junaid Siddique NAM XI Stephan Baard, Craig Williams, Michael van Lingen, Gerhard Erasmus (c), JJ Smit, David Wiese, Ruben Trumpelmann, Jan Nicol Loftie-Eaton, Jan Frylinck, Tangeni Lungameni, Bernard Scholtz UAE vs NAM, ICC Men’s CWC League 2, Match 65 Date and Time: 12th March, 2022, 11:00 AM IST Venue: Sharjah Cricket Stadium, Sharjah The track seems to have gotten slower over the course of the tournament. Runs are hard to come by and low-scoring encounters are common. The spinners are expected to find assistance on this wicket. Wicketkeeper For UAE, V Aravind will be the player to watch out for. He has been in excellent form and has scored 303 runs at an average of 23.90 in 13 games. Batters C Suri bats elegantly and he’s extremely effective against the new ball. Suri has smacked 411 runs so far and will be eying a big knock after another excellent shift against Oman. M Erasmus is the highest scorer for Namibia in the competition. He has amassed 417 runs in 10 matches at an average of 46.33. Erasmus’ highest score is 121*. All-rounders R Mustafa is a brilliant all-rounder who has been consistent and can prove to be a great multiplier choice for your UAE vs NAM Dream11 Fantasy Team. He has chalked up 183 runs at an average of 21.3 and has also scalped 12 wickets thus far. D Wiese is one of the most experienced all-rounders in cricket and was also brilliant in the recently held PSL. Wiese has collected three wickets and has also smacked 107 runs. Bowlers A Raza has bowled with plenty of style, panache and ruthlessness. He has 15 wickets from 12 matches and will be eyeing another top-notch performance in this clash. B Hameed (UAE) – 815 points R Mustafa (UAE) – 681 points A Raza (UAE) – 675 points V Aravind (UAE) – 550 points C Suri (UAE) – 542 points R Mustafa: 183 runs and 12 wickets V Aravind: 303 runs C Suri: 411 runs M Erasmus: 417 runs D Wiese: 107 runs and 3 wickets Fantasy Suggestion #1: V Aravind, C Suri, C Williams, M Erasmus, B Hameed, R Mustafa, J Smit, D Wiese, A Raza, J Frylinck, J Siddique Captain: R Mustafa Vice-Captain: D Wiese Fantasy Suggestion #2: V Aravind, J Nicol Loftie-Eaton, C Suri, C Williams, B Hameed, R Mustafa, M Erasmus, D Wiese, A Raza, J Frylinck, Z Khan Captain: M Erasmus Vice-Captain: V Aravind","image_url":"https://static.sportskeeda.com/editor/2022/03/84d3d-16470183751307-1920.jpg","source_id":"sportskeeda","country":["india"],"category":["sports"],"language":"english"},{"title":"\"This is the best time to take my leave of Sri Lanka cricket\" - Suranga Lakmal ahead of his final Test","link":"https://www.sportskeeda.com/cricket/news-this-best-time-take-leave-sri-lanka-cricket-suranga-lakmal-ahead-final-test?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Cricket"],"creator":["Aayushman Vishwanathan"],"video_url":null,"description":null,"content":null,"pubDate":"2022-03-11 19:27:08","full_description":"Sri Lanka veteran seamer Suranga Lakmal reflected on his Test career before his final game and believes it's the right time to step back. The right-arm paceman also recalled the Test win in Barbados, which came under his captaincy. Lakmal announced before the away series against India that it would be his final match at the international arena. The 35-year-old, who debuted in 2010, thanked the Sri Lankan Cricket Board for the opportunity and credited his career for personal development. Speaking to ESPN Cricinfo , Lakmal revealed that he decided to retire to make way for younger prospects instead of sticking around for two years. He also felt it was the right time to groom someone to carry the team for the next few years. He said: With 170 wickets in 69 Tests, the Matara-born cricketer is the fourth-highest wicket-taker for Sri Lanka. He will join the Derbyshire county cricket club, reuniting with former Sri Lanka coach Mickey Arthur. Lakmal underlined that beating the West Indies in Barbados in the day-night Test in 2018 was his biggest accomplishment along with beating Australia and South Africa . The veteran added: The Sri Lankan will be determined to put his best foot forward in the second Test against India in Bengaluru, which starts on Saturday. The visitors suffered a soul-crushing defeat in Mohali in the first Test. The IPL 2022 schedule and the list of IPL teams is available here, click to view.","image_url":"https://static.sportskeeda.com/editor/2022/03/82e46-16470192272290-1920.jpg","source_id":"sportskeeda","country":["india"],"category":["sports"],"language":"english"},{"title":"Women's World Cup, India vs West Indies: Live Cricket Score, Live Updates","link":"https://sports.ndtv.com/cricket/icc-womens-cricket-world-cup-india-women-vs-west-indies-women-live-cricket-score-live-updates-seddon-park-hamilton-2818288","keywords":null,"creator":null,"video_url":null,"description":"ICC Cricket World Cup, India Women vs West Indies Women Live: India will be aiming for a win against West Indies in their league stage fixture at Seddon Park in Hamilton.","content":null,"pubDate":"2022-03-11 18:20:36","full_description":"India face West Indies in their upcoming ICC Women's Cricket World Cup fixture at Seddon Park in Hamilton, on Saturday. India will be aiming to bounce back to winning ways after losing their second league stage fixture to New Zealand by a huge margin, after defeating Pakistan in their opener. India had a poor batting display against the White Ferns, losing by 62 runs. The likes of Smriti Mandhana and Deepti Sharma will be hoping to improve their performance in the next match. Meanwhile, West Indies have won both their matches, registering wins against New Zealand and England. With two points at stake, both sides will be aiming for a win in Hamilton. ( LIVE SCORECARD ) The 2022 Women's World Cup is catching fire and the matches just keep on coming thick and fast. It's time now for Match number 10 where West Indies Women will take on India Women in Hamilton. Both sides started off their campaign in fine fashion with victories but only the Windies went on to win both their opening encounters. The Stafanie Taylor led side is showing some great grit and determination to pull off upset after upset and with another victory here, they could be well on course of qualifying for the semi-finals. A couple of individuals have certainly performed exceptionally well but as a team, they seem to have a certain cohesiveness that helps them in pressure situations. Hayley Matthews continues to impress with both the bat and the ball and the experienced players like the skipper Taylor, Deandra Dottin and Anisa Mohammed stepped up at the right moment to clinch victory against England last time around. Well, it's been a mixed bag of a start from India and after that thumping victory over rivals Pakistan, one would have expected a much better performance against the hosts. Instead, they succumbed to a fifth defeat in 6 matches in less than a month to the same opposition. Shafali Verma was left out of the playing XI but that didn't solve India's top order woes and the bowling was a bit below par as well. Pooja Vastrakar though was impressive and the biggest positive for India was Harmanpreet Kaur having a solid outing with the bat, which gives that middle order a substantial boost. West Indies Women are certainly the in-form side in the competition but on their day, India Women can beat the best of teams. So, will the Windies continue their fine form? Or will India be able to step up and show their class?","image_url":"https://c.ndtvimg.com/2022-03/9n3r7nfo_india-afp_625x300_11_March_22.jpg?im=FeatureCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"England’s misuse of ‘Ferrari’ Mark Wood during the Ashes series may have contributed to the fast bowler’s latest injury issues, insists Steve Harmison","link":"https://talksport.com/sport/cricket/1061908/england-mark-wood-ashes-steve-harmison/","keywords":["Cricket","England Cricket"],"creator":["Adam Goodwin"],"video_url":null,"description":"Steve Harmison has argued that England’s misuse of ‘Ferrari’ Mark Wood during the Ashes series may have contributed to the fast bowler’s latest injury issue. Wood left the field of play on Thursday with an elbow complaint after bowling 17 overs across days two and three of the first Test. England are yet to confirm […]","content":"Steve Harmison has argued that England’s misuse of ‘Ferrari’ Mark Wood during the Ashes series may have contributed to the fast bowler’s latest injury issue. Wood left the field of play on Thursday with an elbow complaint after bowling 17 overs across days two and three of the first Test. Wood has been struggling with injury and illness recentlygetty England are yet to confirm whether he will be fit to bowl in the second innings and is an injury doubt for the second Test starting in Barbados on Wednesday. “He bowled a lot [in Sydney] and I remember thinking that we’re going to need him further down the line”, said Harmison on talkSPORT 2’s live coverage of the series. “He just kept bowling dead overs. “But Mark will never ever shy away from that. The thing with him is that he always wants to take wickets, he’s a bit like Ben Stokes. “And that’s where you need strong leadership to just take the ball off them and make sure they don’t go anywhere near the bowling.” Wood was unable to bowl in the first innings of the warm-up match against the CWI President’s XI last week after falling ill and managed only nine overs in the second innings spread across several spells. This caused concerns, leading into the Test match, that Wood may not have had the preparation required to ensure that he was fully fit. Most read in Cricket LIVE West Indies v England commentary: Tourists begin second innings, Windies out for 375 sympathy 'I feel sorry for Woakes', says Harmy after tough day leading England's attack tribute Shane Warne state funeral confirmed for March 30 after sudden death hit back England must overcome woeful record in Caribbean to claim series win over Windies repeat Bairstow rescues England - but Root's men warned after another top-order collapse Emotional Gatting wishes he could hear Warne tell him how good THAT ball was one more time Harmison believes England should have managed Wood betterGETTY Not only that, but with England’s relentless touring schedule, there was also concern that Wood may be overworked, as well as undercooked going into the series. This is Wood’s third tour of the winter having been a mainstay in England’s T20 World Cup team in the UAE and also featuring in four of the five Ashes Test matches. “England play a lot of cricket and there’s no preparation time going into each tour,” explained Harmison. Whilst Wood is a Ferrari, Anderson and Broad are Bentleys, according to Harmisongetty “So you’ve got to be careful how you use people and the rest periods in between and when they start going again. “He has bowled a lot, it’s been a while since he’s been injured, and he’s missed a lot of cricket. “So, those dead overs in Sydney, I wouldn’t say they’re coming back to haunt the England cricket team now, but I don’t think that has helped his body going into this series.” Harmison added: “Especially when you’ve only got one Ferrari and you’ve left a couple of Bentley’s [in Broad and James Anderson] at home!” Betting Offer Of The Day Sky Bet: Place your first bet and get £30 in free bets* – CLAIM HERE Bet365: Bet £10 Get £50 in Free Bets* – CLAIM HERE Sky Bet: NEW CUSTOMERS ONLY,FIRST SINGLE & E/W BET ONLY, 5p MINIMUM STAKE, 3 x £10 BET TOKENS. FREE BET STAKES NOT INCLUDED IN RETURNS. FREE BETS EXCLUDE VIRTUALS. FREE BETS ARE NON WITHDRAWABLE. NO FREE BET EXPIRY. ELIGIBILITY RESTRICTIONS AND FURTHER T&CS APPLY. 18+ BEGAMBLEAWARE.ORG Bet365: Min deposit requirement. Free Bets are paid as Bet Credits and are available for use upon settlement of qualifying bets. Min odds, bet and payment method exclusions apply. Returns exclude Bet Credits stake. Time limits and T&Cs apply 18+ Begambleaware.org SEE ALL THE BEST CHELTENHAM FESTIVAL OFFERS HERE","pubDate":"2022-03-11 17:34:46","full_description":"Steve Harmison has argued that England’s misuse of ‘Ferrari’ Mark Wood during the Ashes series may have contributed to the fast bowler’s latest injury issue. Wood left the field of play on Thursday with an elbow complaint after bowling 17 overs across days two and three of the first Test. England are yet to confirm whether he will be fit to bowl in the second innings and is an injury doubt for the second Test starting in Barbados on Wednesday. “He bowled a lot [in Sydney] and I remember thinking that we’re going to need him further down the line”, said Harmison on talkSPORT 2’s live coverage of the series. “He just kept bowling dead overs. “But Mark will never ever shy away from that. The thing with him is that he always wants to take wickets, he’s a bit like Ben Stokes. “And that’s where you need strong leadership to just take the ball off them and make sure they don’t go anywhere near the bowling.” Wood was unable to bowl in the first innings of the warm-up match against the CWI President’s XI last week after falling ill and managed only nine overs in the second innings spread across several spells. This caused concerns, leading into the Test match, that Wood may not have had the preparation required to ensure that he was fully fit. Not only that, but with England’s relentless touring schedule, there was also concern that Wood may be overworked, as well as undercooked going into the series. This is Wood’s third tour of the winter having been a mainstay in England’s T20 World Cup team in the UAE and also featuring in four of the five Ashes Test matches. “England play a lot of cricket and there’s no preparation time going into each tour,” explained Harmison. “So you’ve got to be careful how you use people and the rest periods in between and when they start going again. “He has bowled a lot, it’s been a while since he’s been injured, and he’s missed a lot of cricket. “So, those dead overs in Sydney, I wouldn’t say they’re coming back to haunt the England cricket team now, but I don’t think that has helped his body going into this series.” Harmison added: “Especially when you’ve only got one Ferrari and you’ve left a couple of Bentley’s [in Broad and James Anderson] at home!” Shortly after Harmison’s comments, the ECB released an update that Wood is continuing to receive treatment with a view to bowling in the West Indies second innings. They added that there are no plans for Wood to receive a scan and also no talks as to whether England are considering calling up any replacements to the squad. Sky Bet: Place your first bet and get £30 in free bets* – CLAIM HERE Bet365: Bet £10 Get £50 in Free Bets* – CLAIM HERE Sky Bet: NEW CUSTOMERS ONLY,FIRST SINGLE & E/W BET ONLY, 5p MINIMUM STAKE, 3 x £10 BET TOKENS. FREE BET STAKES NOT INCLUDED IN RETURNS. FREE BETS EXCLUDE VIRTUALS. FREE BETS ARE NON WITHDRAWABLE. NO FREE BET EXPIRY. ELIGIBILITY RESTRICTIONS AND FURTHER T&CS APPLY. 18+ BEGAMBLEAWARE.ORG Bet365: Min deposit requirement. Free Bets are paid as Bet Credits and are available for use upon settlement of qualifying bets. Min odds, bet and payment method exclusions apply. Returns exclude Bet Credits stake. Time limits and T&Cs apply 18+ Begambleaware.org SEE ALL THE BEST CHELTENHAM FESTIVAL OFFERS HERE","image_url":null,"source_id":"talksport","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"India Women vs West Indies Women Live Telecast Channel in India and US: When and where to watch IND W vs WI W World Cup 2022 match?","link":"https://thesportsrush.com/cricket-news-india-women-vs-west-indies-women-live-telecast-channel-in-india-and-us-when-and-where-to-watch-ind-w-vs-wi-w-world-cup-2022-match/","keywords":["Cricket","ICC Women's World Cup","IND W vs WI W"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"India Women vs West Indies Women Live Telecast Channel in India and US: The SportsRush brings you the broadcasting details of the game. India Women will take West Indies Women in their next league game of ICC Women’s World Cup. Indian Women have won one of their two games in the tournament so far, whereas… The post India Women vs West Indies Women Live Telecast Channel in India and US: When and where to watch IND W vs WI W World Cup 2022 match? appeared first on The SportsRush.","content":"India Women vs West Indies Women Live Telecast Channel in India and US: The SportsRush brings you the broadcasting details of the game. India Women will take West Indies Women in their next league game of ICC Women’s World Cup. Indian Women have won one of their two games in the tournament so far, whereas the West Indies Women are still unbeaten in the tournament. The batting of the Indian has been a thing of worry for the side. Mithali Raj has said that the batters of the side need to take some responsibility. Smriti Mandhana has scored one half-century in the tournament, whereas Harmanpreet Kaur played a fine knock in the last game. The bowling of the side looks good. Rajeshwari Gayakwad has been outstanding with the ball, whereas Jhulan Goswami, Pooja Vastrakar, and Sneh Rana have also bowled well. West Indies Women have played better than the expectations. Hayley Matthew shas been excellent as an all-rounder. She has already scored a century, whereas she has been great with the bowl as well. Deandra Dottin has also been a great asset for the side. Stefanie Taylor has struggled with the bat so far, but she bowled well in the last game. Anisa Mohammad has been the leading spinner of the West Indian team, whereas Shamilia Connell and Shakera Selman are taking care of the pace battery of the side. #TeamIndia will take on the West Indies in their 3⃣rd #CWC22 clash at the Seddon Park, Hamilton tomorrow. #WIvIND Drop in your messages in the comments below & wish our team. pic.twitter.com/2oMXFBCxU7 — BCCI Women (@BCCIWomen) March 11, 2022 India Women vs West Indies Women Live Telecast Channel in India and US Country TV Digital India Star Sports Disney+Hotstar USA Willow TV ESPN+ UK & ROI Sky Sports Cricket SkyGo & Sky Sports YouTube Australia WWC Channel (Fox 507) Kayo New Zealand Sky Sports Cricket SkyNow and SkyGo South Africa and Sub-Saharan Africa Supersport SwitchTV & StarzPlay The match between India Women and West Indies Women will start at 6.30 AM IST. A win for West Indies will almost seal their place in the semi-final of the tournament, whereas a defeat can halt Indian chances to qualify. West Indies, Australia, and South Africa are the only unbeaten teams of the tournament so far.     The post India Women vs West Indies Women Live Telecast Channel in India and US: When and where to watch IND W vs WI W World Cup 2022 match? appeared first on The SportsRush.","pubDate":"2022-03-11 17:29:20","full_description":"India Women vs West Indies Women Live Telecast Channel in India and US: The SportsRush brings you the broadcasting details of the game. India Women will take West Indies Women in their next league game of ICC Women’s World Cup. Indian Women have won one of their two games in the tournament so far, whereas the West Indies Women are still unbeaten in the tournament. The batting of the Indian has been a thing of worry for the side. Mithali Raj has said that the batters of the side need to take some responsibility. Smriti Mandhana has scored one half-century in the tournament, whereas Harmanpreet Kaur played a fine knock in the last game. The bowling of the side looks good. Rajeshwari Gayakwad has been outstanding with the ball, whereas Jhulan Goswami, Pooja Vastrakar, and Sneh Rana have also bowled well. West Indies Women have played better than the expectations. Hayley Matthew shas been excellent as an all-rounder. She has already scored a century, whereas she has been great with the bowl as well. Deandra Dottin has also been a great asset for the side. Stefanie Taylor has struggled with the bat so far, but she bowled well in the last game. Anisa Mohammad has been the leading spinner of the West Indian team, whereas Shamilia Connell and Shakera Selman are taking care of the pace battery of the side. ⏰ ❓ #TeamIndia will take on the West Indies in their 3⃣rd #CWC22 clash at the Seddon Park, Hamilton tomorrow. #WIvIND Drop in your messages in the comments below & wish our team. pic.twitter.com/2oMXFBCxU7 — BCCI Women (@BCCIWomen) March 11, 2022 The match between India Women and West Indies Women will start at 6.30 AM IST. A win for West Indies will almost seal their place in the semi-final of the tournament, whereas a defeat can halt Indian chances to qualify. West Indies, Australia, and South Africa are the only unbeaten teams of the tournament so far.","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"IPL 2022: KKR's Alex Hales Explains Why He Pulled Out Of The Tournament - Cricket Addictor","link":"https://news.google.com/__i/rss/rd/articles/CBMieGh0dHBzOi8vY3JpY2tldGFkZGljdG9yLmNvbS9pbmRpYW4tcHJlbWllci1sZWFndWUtaXBsLTIwMjIva2tycy1hbGV4LWhhbGVzLWV4cGxhaW5zLXdoeS1oZS1wdWxsZWQtb3V0LW9mLXRoZS10b3VybmFtZW50L9IBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"IPL 2022: KKR's Alex Hales Explains Why He Pulled Out Of The Tournament  Cricket AddictorKKR rope in Aaron Finch as replacement for Alex Hales | Cricbuzz.com - Cricbuzz  CricbuzzAlex Hales opts out of IPL 2022, KKR bring in Aaron Finch as replacement  ESPNcricinfoIPL 2022: KKR announce star Australia batter as replacement for Alex Hales  Hindustan TimesIPL 2022: Kolkata Knight Riders Sign Aaron Finch As Replacement For Alex Hales  NDTV SportsView Full coverage on Google News","content":null,"pubDate":"2022-03-11 17:28:36","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Aaron Finch IPL teams: List of teams Aaron Finch has played for in the Indian Premier League","link":"https://thesportsrush.com/cricket-news-aaron-finch-ipl-teams-list-of-teams-aaron-finch-has-played-for-in-the-indian-premier-league/","keywords":["Cricket","IPL 2022","KKR","Aaron Finch","Indian Premier League","Kolkata Knight riders"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Aaron Finch IPL teams: The Australian captain will be returning to the Indian Premier League after missing the last season. Australia white-ball captain Aaron Finch will return to the Indian Premier League to join Kolkata Knight Riders as a replacement for England batter Alex Hales. Hales, 33, would’ve himself returned to the IPL for only… The post Aaron Finch IPL teams: List of teams Aaron Finch has played for in the Indian Premier League appeared first on The SportsRush.","content":"Aaron Finch IPL teams: The Australian captain will be returning to the Indian Premier League after missing the last season. Australia white-ball captain Aaron Finch will return to the Indian Premier League to join Kolkata Knight Riders as a replacement for England batter Alex Hales. Hales, 33, would’ve himself returned to the IPL for only his second season after a four-year gap. Much like his English teammate Jason Roy, Hales has also opted to skip IPL 2022 citing bio-bubble fatigue. ALSO READ: What is Bio-Bubble in Cricket? Hales, who had last played international cricket three years ago, took to social media platform Twitter to confirm his unavailability for the 15th season of the IPL. Aaron Finch IPL teams Finch, who had remained unsold during the mega auction held in Bengaluru a month ago, has been bought by Knight Riders for his base price of INR 1.5 crore. In what will be the 11th IPL season for Finch, he will get to extend his lead in terms of playing for most IPL teams. Readers must note that KKR will be Finch’s ninth IPL franchise. Finch, who has scored 2,005 runs in 85 IPL innings at an average and strike rate of 25.38 and 127.71 respectively including 14 half-centuries, has played for Rajasthan Royals (2010), Delhi Daredevils (2011-12), Pune Warriors India (2013), Sunrisers Hyderabad (2014), Mumbai Indians (2015), Gujarat Lions (2016-17), Kings XI Punjab (2018) and Royal Challengers Bangalore (2020) in the past. Out of the previous 14 IPL seasons, Finch has not been part of four seasons namely 2008, 2009, 2019 and 2021. Finch, who had led Australia to an ICC T20 World Cup in the UAE last year, will play under India batter Shreyas Iyer at Kolkata. Finch, 35, will be part of a seven-member overseas contingent also comprising of West Indies all-rounders Andre Russell and Sunil Narine, Australia Test captain Pat Cummins, Sri Lanka fast bowler Chamika Karunaratne, England wicket-keeper batter Sam Billings, New Zealand pacer Tim Southee and Afghanistan all-rounder Mohammad Nabi. Decode this: © + © = #KKR #KKRHaiTaiyaar #IPL2022 pic.twitter.com/Jn479qXDZG — KolkataKnightRiders (@KKRiders) March 11, 2022   The post Aaron Finch IPL teams: List of teams Aaron Finch has played for in the Indian Premier League appeared first on The SportsRush.","pubDate":"2022-03-11 16:38:49","full_description":"Aaron Finch IPL teams: The Australian captain will be returning to the Indian Premier League after missing the last season. Australia white-ball captain Aaron Finch will return to the Indian Premier League to join Kolkata Knight Riders as a replacement for England batter Alex Hales. Hales, 33, would’ve himself returned to the IPL for only his second season after a four-year gap. Much like his English teammate Jason Roy , Hales has also opted to skip IPL 2022 citing bio-bubble fatigue . ALSO READ: What is Bio-Bubble in Cricket? Hales, who had last played international cricket three years ago, took to social media platform Twitter to confirm his unavailability for the 15th season of the IPL. Finch, who had remained unsold during the mega auction held in Bengaluru a month ago, has been bought by Knight Riders for his base price of INR 1.5 crore. In what will be the 11th IPL season for Finch, he will get to extend his lead in terms of playing for most IPL teams. Readers must note that KKR will be Finch’s ninth IPL franchise. It is worth mentioning that Finch has played for Rajasthan Royals (2010), Delhi Daredevils (now Capitals, 2011-12), Pune Warriors India (2013), Sunrisers Hyderabad (2014), Mumbai Indians (2015), Gujarat Lions (2016-17), Kings XI Punjab (now Punjab Kings, 2018) and Royal Challengers Bangalore (2020) in the past. Out of the previous 14 IPL seasons, Finch has not been part of four seasons in 2008, 2009, 2019 and 2021. In 85 IPL innings, 35-year old Finch has scored 2,005 runs at an average and strike rate of 25.38 and 127.71 respectively including 14 half-centuries. Finch, who had led Australia to an ICC T20 World Cup in the UAE last year, will play under India batter Shreyas Iyer at Kolkata. The right-hand batter will be part of a seven-member overseas contingent also comprising of West Indies all-rounders Andre Russell and Sunil Narine, Australia Test captain Pat Cummins, Sri Lanka fast bowler Chamika Karunaratne, England wicket-keeper batter Sam Billings, New Zealand pacer Tim Southee and Afghanistan all-rounder Mohammad Nabi. Decode this: 🇦🇺🦘🔴©️ + 🇦🇺🦘⚪©️ = 💜💛 #KKR #KKRHaiTaiyaar #IPL2022 pic.twitter.com/Jn479qXDZG — KolkataKnightRiders (@KKRiders) March 11, 2022 Finch will bring with him an experience of 347 matches across his 13-year old T20 career. Having said that, Finch’s current T20 form isn’t very impressive. Since his last IPL stint, Finch has only played for Melbourne Renegades in the Big Bash League as far as T20 leagues are concerned. In 23 BBL innings across the last two seasons, Finch’s 565 runs have come at an average and strike rate of 24.57 and 124.45 respectively including four half-centuries.","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Mithali Raj Set To Break All-Time Captaincy Record At Women's World Cup - NDTV Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMiqQFodHRwczovL3Nwb3J0cy5uZHR2LmNvbS9pY2Mtd29tZW4tcy13b3JsZC1jdXAtMjAyMi9pY2Mtd29tZW5zLXdvcmxkLWN1cC1pbmRpYS13b21lbi12cy13ZXN0LWluZGllcy13b21lbi1taXRoYWxpLXJhai1zZXQtdG8tYnJlYWstYmVsaW5kYS1jbGFya3MtY2FwdGFpbmN5LXJlY29yZC0yODE3OTg20gGvAWh0dHBzOi8vc3BvcnRzLm5kdHYuY29tL2ljYy13b21lbi1zLXdvcmxkLWN1cC0yMDIyL2ljYy13b21lbnMtd29ybGQtY3VwLWluZGlhLXdvbWVuLXZzLXdlc3QtaW5kaWVzLXdvbWVuLW1pdGhhbGktcmFqLXNldC10by1icmVhay1iZWxpbmRhLWNsYXJrcy1jYXB0YWluY3ktcmVjb3JkLTI4MTc5ODYvYW1wLzE?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Mithali Raj Set To Break All-Time Captaincy Record At Women's World Cup  NDTV SportsIndia Women vs West Indies Women Live Streaming: When And Where To Watch IND-W vs WI-W Live In Your Country? ICC Women's ODI World Cup 2022  Cricket AddictorICC Women’s World Cup 2022: Match 10, WI-W vs IND-W Match Prediction – Who will win today’s match?  CricTrackerICC Women's World Cup, India vs West Indies: Live Cricket Score, Live Updates  NDTV SportsView Full coverage on Google News","content":null,"pubDate":"2022-03-11 15:31:50","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"CWC 2022 IND W vs WI W: Toss, India and West Indies Playing 11 prediction","link":"https://www.business-standard.com/article/sports/cwc-2022-ind-w-vs-wi-w-toss-india-and-west-indies-playing-11-prediction-122031101162_1.html","keywords":null,"creator":null,"video_url":null,"description":"Get the latest toss updates and playing 11 predictions from the India Women vs West Indies Women match at the ICC Women's Cricket World Cup 2022","content":null,"pubDate":"2022-03-11 15:03:00","full_description":"After a crushing 62 run defeat to hosts New Zealand in their previous game, the Indian Women's team is now balanced with one big win and one big loss in their ICC Women's Cricket World Cup 2022 campaign so far. It is with this premise that they will enter the third match which is against West Indies. The Caribbean team has so far proven to be a giant killer in this tournament, beating home favourites New Zealand and defending champions England in their first two games. Thus women in blue cannot afford to bat an eyelid in this crucial encounter. The match would begin at 06:30 am IST which is 1400 hrs Local time at the Seddon Park in Hamilton, Waikato. CWC 2022 India Women vs West Indies Women Toss Timing India vs West Indies Cricket World Cup match today will begin at 06:30 am IST and 1400 hrs Local New Zealand time. Thus the toss between the India Women captain Mithali Raj and West Indies Women captain Stephanie Taylor would take place 30 minutes before the match start time. Hence, India Women vs New Zealand Women toss would take place at 06:00 am IST and 1330 hrs Local time. Here's how the Playing 11 of India Women and West Indies Women World Cup match would look like The Indian team can bring back Shafali Verma because they need an explosive start at the top which they have lacked in both their games against Pakistan as well as New Zealand. No doubt Yastika Bhatia is a good choice, but her style of batting is similar to Smriti Mandhana and Mithali Raj and hence she would be unable to find a place in this team till those two stays in the India Playing 11. If we talk about West Indies, they have not had to do many changes as someone or the other has been able to put up their hand and win the game for them in this World Cup so far. Hence for this game, it would be hard for them to make any changes in the Playing 11 that played the match against England India Women Predicted Playing 11 Smriti Mandhana, Shafali Verma, Yastika Bhatia, Mithali Raj (capt), Harmanpreet Kaur (vc), Deepti Sharma, Richa Ghosh (wk), Jhulan Goswami, Meghna Singh, Rajeshwari Gayakwad, Sneh Rana/ Poonam Yadav West Indies Women Predicted Playing 11 Deandra Dottin, Hayley Matthews, Kycia Knight, Stafanie Taylor (c), Shemaine Campbelle (wk), Chedean Nation, Chinelle Henry, Aaliyah Alleyne, Shamilia Connell, Anisa Mohammed, Shakera Selman India Women Squad CWC 2022 Mithali Raj (capt), Harmanpreet Kaur (vice-capt) Smriti Mandhana, Shafali Verma, Yastika Bhatia, Deepti Sharma, Richa Ghosh, Taniya Bhatia, Sneh Rana, Pooja Vastrakar, Jhulan Goswami, Meghna Singh, Renuka Singh Thakur, Poonam Yadav, Rajeshwari Gayakwad Travelling reserves: S Meghana, Ekta Bisht, Simran Dil Bahadur West Indies Women Squad CWC 2022 Deandra Dottin, Hayley Matthews, Kycia Knight, Stafanie Taylor (c), Shemaine Campbelle (wk), Chedean Nation, Chinelle Henry, Aaliyah Alleyne, Shamilia Connell, Anisa Mohammed, Shakera Selman, Afy Fletcher, Karishma Ramharack, Rashada Williams, Cherry Ann Fraser","image_url":"https://bsmedia.business-standard.com/_media/bs/img/article/default/1220311/thumb-122031101162.jpg","source_id":"business-standard","country":["india"],"category":["sports"],"language":"english"},{"title":"Karachi cricket stadium Test records: Who has scored most runs and picked most wickets in Tests at National Stadium, Karachi?","link":"https://thesportsrush.com/cricket-news-karachi-cricket-stadium-test-records-who-has-scored-most-runs-and-picked-most-wickets-in-tests-at-national-stadium-karachi/","keywords":["Cricket","Australia","Australia tour of Pakistan 2022","Pakistan"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Karachi cricket stadium Test records: The National Stadium in Karachi will be hosting a Test match after just over a year. The second Test match of the ongoing Australia’s tour of Pakistan will commence in Karachi from tomorrow. Following a dull draw in the first Test in Rawalpindi, both teams would be looking to register… The post Karachi cricket stadium Test records: Who has scored most runs and picked most wickets in Tests at National Stadium, Karachi? appeared first on The SportsRush.","content":"Karachi cricket stadium Test records: The National Stadium in Karachi will be hosting a Test match after just over a year. The second Test match of the ongoing Australia’s tour of Pakistan will commence in Karachi from tomorrow. Following a dull draw in the first Test in Rawalpindi, both teams would be looking to register a victory in order to gain a series lead. A victory is all the more imperative for hosts Pakistan as they would want to make the most of an opportunity of playing an ICC World Test Championship match at home. It is noteworthy that Pakistan have a phenomenal Test record at the National Stadium. Out of their 43 Tests here, Pakistan have won a mammoth 23 and lost only two. Australia, on the contrary, have lost five and drawn three out of their eight Karachi Tests. Daal and roti for lunch too. Delicious pic.twitter.com/w5KgimFo1N — Marnus Labuschagne (@marnus3cricket) March 11, 2022 A primary reason why the second Test could end up being a riveting one is the return of first-choice Pakistani players namely all-rounder Faheem Ashraf and fast bowler Hasan Ali and Australia playing a second spinner. Karachi cricket stadium Test records Considering the number of Tests this venue has hosted in the last decade, it isn’t surprising that a large number of highest Test run-scorers are retired Pakistani players namely Javed Miandad (1,393), Saleem Malik (855), Younis Khan (786), Inzamam-ul-Haq (722) and Shoaib Mohammad (642). Among active Test players, Abid Ali (206), Azhar Ali (200), Babar Azam (197), Shan Masood (140) and Fawad Alam (113) are the highest Test run-scorers here. Test bowling records at the National Stadium are no different as they are also dominated by retired Pakistani players namely Abdul Qadir (59), Imran Khan (51), Iqbal Qasim (44), Wasim Akram (41) and Waqar Younis (38). Among active Test players, Yasir Shah (9), Shaheen Shah Afridi (8), Nauman Ali (7), Lahiru Kumara (6) and Lasith Embuldeniya (5) have been the best bowlers in Karachi Tests. Highest innings totals in Karachi Tests Team Score Overs Opposition Year Pakistan 765/6d 248.5 Sri Lanka 2009 Sri Lanka 644/7d 155.2 Pakistan 2009 Pakistan 599/7d 140.1 India 2006 Pakistan 565/9d 105.2×8 New Zealand 1976 Pakistan 555/3d 131 Sri Lanka 2019 The post Karachi cricket stadium Test records: Who has scored most runs and picked most wickets in Tests at National Stadium, Karachi? appeared first on The SportsRush.","pubDate":"2022-03-11 14:34:47","full_description":"Karachi cricket stadium Test records: The National Stadium in Karachi will be hosting a Test match after just over a year. The second Test match of the ongoing Australia’s tour of Pakistan will commence in Karachi from tomorrow. Following a dull draw in the first Test in Rawalpindi, both teams would be looking to register a victory in order to gain a series lead. A victory is all the more imperative for hosts Pakistan as they would want to make the most of an opportunity of playing an ICC World Test Championship match at home. It is noteworthy that Pakistan have a phenomenal Test record at the National Stadium. Out of their 43 Tests here, Pakistan have won a mammoth 23 and lost only two. Australia, on the contrary, have lost five and drawn three out of their eight Karachi Tests. Daal and roti for lunch too. Delicious pic.twitter.com/w5KgimFo1N — Marnus Labuschagne (@marnus3cricket) March 11, 2022 A primary reason why the second Test could end up being a riveting one is the return of first-choice Pakistani players namely all-rounder Faheem Ashraf and fast bowler Hasan Ali and Australia playing a second spinner . Considering the number of Tests this venue has hosted in the last decade, it isn’t surprising that a large number of highest Test run-scorers are retired Pakistani players namely Javed Miandad (1,393), Saleem Malik (855), Younis Khan (786), Inzamam-ul-Haq (722) and Shoaib Mohammad (642). Among active Test players, Abid Ali (206), Azhar Ali (200), Babar Azam (197), Shan Masood (140) and Fawad Alam (113) are the highest Test run-scorers here. Test bowling records at the National Stadium are no different as they are also dominated by retired Pakistani players namely Abdul Qadir (59), Imran Khan (51), Iqbal Qasim (44), Wasim Akram (41) and Waqar Younis (38). Among active Test players, Yasir Shah (9), Shaheen Shah Afridi (8), Nauman Ali (7), Lahiru Kumara (6) and Lasith Embuldeniya (5) have been the best bowlers in Karachi Tests.","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"CWC 2022 India vs West Indies: Women in blue face the Caribbean juggernaut","link":"https://www.business-standard.com/article/sports/cwc-2022-india-vs-west-indies-women-in-blue-face-the-caribbean-juggernaut-122031101045_1.html","keywords":null,"creator":null,"video_url":null,"description":"Led by Mithali Raj, India Women take on West Indies Women in a crucial ICC Women's Cricket World Cup encounter at Seddon Park, Hamilton. India lost to New Zealand by 62 runs in the last game","content":null,"pubDate":"2022-03-11 14:32:00","full_description":"The Indian Women's cricket team was hit hard by a damaging 62 run loss against home side New Zealand in their second ICC Women's Cricket World Cup 2022. After an easy win in their first match against arch-rivals Pakistan, India's confidence was really high, but that would have gone down considerably after the huge loss. But what they face ahead of themselves is no less than a juggernaut from the Caribbean. The West Indies Women, India's next opponents have defeated two bigwigs in New Zealand and England in their first two games. Thus Mithali Raj's India, by no means can even blink an eye when they face the Stephanie Taylor led West Indian team at the Seddon Park in Hamilton on March 12, 2022. Hayley Matthews, Deandra Dottin and Anisa Mohammed: West Indies' deadly trio The West Indies team has been able to defend scores of 259 and 226 against New Zealand and England respectively. In both those games, West Indies were on the brink of a loss and it was moments of brilliance that helped them win it. While in the first game, it was Deandra Dotting who defended six runs in the last over, Anisa Mohammed was able to dismiss two English batters in a space of four balls to win West Indies the second game. Hayley Matthews on the other hand has contributed in a massive way for her team in both the games as she struck a century and picked two wickets in the first game and then picked two wickets and scored 45 runs against England too. Thus she has been a consistent player and could be a thorn in India's chances. India can't afford to lose this vs West Indies For India to be able to get to the semi-final stage of this World Cup, they had to win at least four games which were against Pakistan, Bangladesh, West Indies and South Africa to get to the semi-finals. Now, with West Indies already winning against New Zealand and England and more than capable enough of beating Pakistan and Bangladesh, the competition is now wide open amongst all teams and hence a loss here could mean a secure seat for West Indies in the semi-finals and a slot of pressure on India from hereon to not even lose against heavyweights like England and Australia. India Women vs West Indies Women Seddon Park Pitch Report The pitch at Seddon Park in Hamilton has been good for chasing though, in the last game, India Women were not able to chase it out. World Cup brings with it the pressure and hence runs on the board always matter a lot. West Indies themselves are a prime example of it. Thus India should look to bat first after winning the toss. That would test West Indies and would help India's cause as its bowling has proven its worth in both the games that the women in blue have played so far. The pitch would most likely assist the spinners in the second innings as well. India vs West Indies Hamilton Weather Update The biggest weather update from Hamilton is that there are no chances of rain and the game would be played uninterrupted. The temperatures would also be akin to the subcontinent at this time of the year as they would hover between 27 Degree Celcius to 18 Degree Celcius from 02:00 pm to 10:00 pm Local Time, the timing for the match. India Women vs West Indies Women Head to Head Format Matches IND Women Won WI Women Won ODIs Overall 25 20 05 In World Cup (ODIs) 06 06 00 India Women Predicted Playing 11 Smriti Mandhana, Shafali Verma/Yastika Bhatia, Deepti Sharma, Mithali Raj (capt), Harmanpreet Kaur (vc), Richa Ghosh (wk), Sneh Rana, Pooja Vastrakar, Jhulan Goswami, Meghna Singh, Rajeshwari Gayakwad West Indies Women Predicted Playing 11 Deandra Dottin, Hayley Matthews, Kycia Knight, Stafanie Taylor (c), Shemaine Campbelle (wk), Chedean Nation, Chinelle Henry, Aaliyah Alleyne, Shamilia Connell, Anisa Mohammed, Shakera Selman India Women Squad CWC 2022 Mithali Raj (capt), Harmanpreet Kaur (vice-capt) Smriti Mandhana, Shafali Verma, Yastika Bhatia, Deepti Sharma, Richa Ghosh, Taniya Bhatia, Sneh Rana, Pooja Vastrakar, Jhulan Goswami, Meghna Singh, Renuka Singh Thakur, Poonam Yadav, Rajeshwari Gayakwad Travelling reserves: S Meghana, Ekta Bisht, Simran Dil Bahadur West Indies Women Squad CWC 2022 Deandra Dottin, Hayley Matthews, Kycia Knight, Stafanie Taylor (c), Shemaine Campbelle (wk), Chedean Nation, Chinelle Henry, Aaliyah Alleyne, Shamilia Connell, Anisa Mohammed, Shakera Selman, Afy Fletcher, Karishma Ramharack, Rashada Williams, Cherry Ann Fraser","image_url":"https://bsmedia.business-standard.com/_media/bs/img/article/default/1220311/thumb-122031101045.jpg","source_id":"business-standard","country":["india"],"category":["sports"],"language":"english"},{"title":"West Indies vs England, 1st Test, Day 4: Live Cricket Score, Live Updates","link":"https://sports.ndtv.com/cricket/west-indies-vs-england-1st-test-day-4-live-cricket-score-live-updates-sir-vivian-richards-stadium-antigua-2817834","keywords":null,"creator":null,"video_url":null,"description":"West Indies vs England, 1st Test, Day 4 Live: England will be aiming to reduce West Indies lead on Day 4, at the Sir Vivian Richards Stadium in Antigua.","content":null,"pubDate":"2022-03-11 14:28:06","full_description":"In response to West Indies' first innings score of 375, England will be aiming to reduce the deficit on Day 4 of the ongoing first Test match at the Sir Vivian Richards Stadium in Antigua, on Friday. The Windies were bowled out for 375 runs, taking a lead of 64 runs, after England's first innings total of 311. Nkrumah Bonner top-scored for the hosts with a knock of 123 runs off 355 balls. He also smashed 12 fours and a maximum. Craig Overton, Jack Leach and Ben Stokes were in decent form for England's bowling department, taking two wickets. Meanwhile, Chris Woakes, Mark Wood and Dan Lawrence bagged a dismissal each. ( LIVE SCORECARD ) We are back for West Indies' reply! The English players have made their way out to the middle. Kraigg Brathwaite and John Campbell to open the batting for West Indies. Chris Woakes will start proceedings with the ball for England. Three slips and a gully in place. Here we go... ... Second innings ... West Indies had a sensational start as their bowlers were breathing fire with the red cherry. Kemar Roach, Jayden Seales wrecked England's top order and Jason Holder followed it up by bowling impeccable lines and lengths and with great consistency and also bagged the wicket of Lawrence. It was a different story later as in the middle and the final session, as they allowed some partnerships to build and were blown away by Bairstow's counter-attack. It was the short ball ploy that worked in their favor on Day 2, as Seales struck twice and then Joseph ended the proceedings bagging two wickets. They would be pleased that they didn't allow England to add much to their overnight score and now it's onto their batters to come out and show positive intent. Their first target would be to enter the Lunch unscathed. Let's see if they are able to achieve that or not. Electing to bat first, England were in all sorts of trouble as the top order collapsed leaving the side with 48/4. After that, Stokes and Foakes stitched crucial partnerships with Bairstow but they could not convert their starts. However, Jonny Bairstow bailed England out of trouble with a remarkable century and they ended Day 1 on 268/6. He found another sustainable partner in Chris Woakes and they built a 71-run stand before Woakes holed out. The tail-enders could not do much with the bat and England added 43 runs to their overnight score with Bairstow walking back with just 10 runs short of his 150 . If it hadn't been him, England would have never reached here. All the credit to Bairstow for putting up a show and helping England to get out of the rut. Jonny Bairstow walks back with a huge round of applause from the English supporters and his teammates. A fine innings from him as it has lifted England to 311. OUT! TAKEN! Alzarri Joseph ends the proceedings. Bowls a length ball, on off. Jonny Bairstow goes for the heave. The ball goes off the top edge and goes high up in the air towards gully. Jason Holder settles himself underneath and takes the skier. England are bundled out for 311. Length ball, outside off. Jonny Bairstow pushes it to point. Short of a length, outside off. Jonny Bairstow guides it to third man but does not take a single. A length ball, outside off. Jack Leach leaves it alone this time. FOUR! Edged but it sneaks through the keeper and first slip! Roach is absolutely gutted with that! A full ball, outside off. Jack Leach prods and looks to push it away from his body. It takes the outside edge and goes past the keeper and first slip for a boundary. Joshua Da Silva should have surely gone for it. A short ball, around off. Jonny Bairstow swivels and pulls it along the ground towards fine leg. He takes a single this time. Back of a length, angling down leg. Jonny Bairstow sways away from the line of the ball and lets it go through to the keeper. Another short ball, around off. Jonny Bairstow pulls it along the ground towards mid-wicket. A bumper, around off. Jonny Bairstow ducks underneath. Leg bye! Short of a length, angling in from off. Jonny Bairstow looks to heave it away but he misses and gets hit on his thigh pad. The ball rolls to the off side and the batters sneak in a leg bye. Back of a length, well outside off. Jonny Bairstow lets it through to the keeper. Drinks! West Indies bowlers are bowling with much more aggression and it looks like the short ball ploy is working for them. They have got three wickets and will look to wrap things up quickly. Jonny Bairstow is still at the crease and he will look to pile up as many runs as he can now before his side gets bundled out. Jack Leach is the last batsman in. OUT! CAUGHT! The ploy of bowling short has done the trick for West Indies and Alzarri Joseph! This is a well-directed bumper, around off. Wood looks to pull but the ball hurries onto him and it goes off the top edge, in the air towards the point fielder. Veerasammy Permaul there, settles under it and pouches it with ease. England lose their ninth wicket and Alzarri Joseph gets his first of the innings. Joseph serves a length ball, around middle. Wood covers the line of the ball and defends it onto the deck. Back of a length, well outside off. Mark Wood leaves it alone for the keeper to collect it.","image_url":"https://c.ndtvimg.com/2022-03/3lmfsmh8_england-afp_625x300_11_March_22.jpg?im=FeatureCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"IND W vs WI W Head to Head ODI Record | India Women vs West Indies Women ODI Stats | Hamilton ODI","link":"https://thesportsrush.com/cricket-news-ind-w-vs-wi-w-head-to-head-odi-record-india-women-vs-west-indies-women-odi-stats-hamilton-odi/","keywords":["Cricket","ICC Women's World Cup 2022","India Women","West Indies Women"],"creator":["Dixit Bhargav"],"video_url":null,"description":"IND W vs WI W Head to Head: The SportsRush presents for you the Head to Head statistics for the IND-W vs WI-W WODI. The 10th match of the ongoing 12th edition of the ICC Women’s World Cup will be played between India Women and West Indies Women in Hamilton on Saturday. In the two… The post IND W vs WI W Head to Head ODI Record | India Women vs West Indies Women ODI Stats | Hamilton ODI appeared first on The SportsRush.","content":"IND W vs WI W Head to Head: The SportsRush presents for you the Head to Head statistics for the IND-W vs WI-W WODI. The 10th match of the ongoing 12th edition of the ICC Women’s World Cup will be played between India Women and West Indies Women in Hamilton on Saturday. In the two matches that they’ve played in this world event so far, India Women have won and lost a match each to be on the fifth position on the points table. West Indies Women, on the other hand, have won both their matches to be at a position above India on the points table. While current form is inclined towards West Indies, past head-to-head record favours India. Readers must note that India Women have never lost to West Indies Women at a neutral venue. #TFW you’re 2⃣/2⃣ at the ICC #CWC22! Will #TeamWestIndies make it a perfect 3⃣ in their next clash, #WIvIND? pic.twitter.com/3YwHUwJxvd — Star Sports (@StarSportsIndia) March 11, 2022 As far as playing at the Seddon Park is concerned, India have lost all their WODIs (including last World Cup match against hosts New Zealand) at this venue. Meanwhile, West Indies will be playing their first-ever Hamilton WODI tomorrow. IND W vs WI W Head to Head ODI Record Total number of matches played: 25 Matches won by IND-W: 20 Matches won by WI-W: 22 Matches played in India: 15 (IND-W 13, WI-W 2) Matches played in West Indies: 6 (IND-W 3, WI-W 3) Matches played at a neutral venue: 4 (IND-W 4, WI-W 0) Most runs for IND-W: 696 (Mithali Raj) Most runs for WI-W: 614 (Stafanie Taylor) Most wickets for IND-W: 19 (Jhulan Goswami) Most wickets for WI-W: 22 (Anissa Mohammed) Most catches for IND-W: 6 (Mithali Raj) Most catches for WI-W: 5 (Shemaine Campbelle) The last India Women vs West Indies Women WODI was played during India’s tour of West Indies more than a couple of years ago. A match-winning 141-run opening partnership on the back of individual half-centuries from opening batters Jemimah Rodrigues (69) and Smriti Mandhana (74) had guided India to a 6-wicket victory in a 195-run chase at the Sir Vivian Richards Cricket Stadium. NOTE: Only players part of current squads have been considered above (most runs, wickets and catches). The post IND W vs WI W Head to Head ODI Record | India Women vs West Indies Women ODI Stats | Hamilton ODI appeared first on The SportsRush.","pubDate":"2022-03-11 13:12:25","full_description":"IND W vs WI W Head to Head: The SportsRush presents for you the Head to Head statistics for the IND-W vs WI-W WODI. The 10th match of the ongoing 12th edition of the ICC Women’s World Cup will be played between India Women and West Indies Women in Hamilton on Saturday. In the two matches that they’ve played in this world event so far, India Women have won and lost a match each to be on the fifth position on the points table . West Indies Women, on the other hand, have won both their matches to be at a position above India on the points table. While current form is inclined towards West Indies, past head-to-head record favours India. Readers must note that India Women have never lost to West Indies Women at a neutral venue. #TFW you’re 2⃣/2⃣ at the ICC #CWC22 ! 💃 Will #TeamWestIndies make it a perfect 3⃣ in their next clash, #WIvIND ? 🤔 pic.twitter.com/3YwHUwJxvd — Star Sports (@StarSportsIndia) March 11, 2022 As far as playing at the Seddon Park is concerned, India have lost all their WODIs (including last World Cup match against hosts New Zealand) at this venue. Meanwhile, West Indies will be playing their first-ever Hamilton WODI tomorrow. Total number of matches played: 25 Matches won by IND-W: 20 Matches won by WI-W: 22 Matches played in India: 15 (IND-W 13, WI-W 2) Matches played in West Indies: 6 (IND-W 3, WI-W 3) Matches played at a neutral venue: 4 (IND-W 4, WI-W 0) Most runs for IND-W: 696 (Mithali Raj) Most runs for WI-W: 614 (Stafanie Taylor) Most wickets for IND-W: 19 (Jhulan Goswami) Most wickets for WI-W: 22 (Anissa Mohammed) Most catches for IND-W: 6 (Mithali Raj) Most catches for WI-W: 5 (Shemaine Campbelle) The last India Women vs West Indies Women WODI was played during India’s tour of West Indies more than a couple of years ago. A match-winning 141-run opening partnership on the back of individual half-centuries from opening batters Jemimah Rodrigues (69) and Smriti Mandhana (74) had guided India to a 6-wicket victory in a 195-run chase at the Sir Vivian Richards Cricket Stadium. NOTE: Only players part of current squads have been considered above (most runs, wickets and catches).","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Scoring runs against spin remains the biggest challenge for South Africa and Pakistan - ESPNcricinfo","link":"https://news.google.com/__i/rss/rd/articles/CBMiigFodHRwczovL3d3dy5lc3BuY3JpY2luZm8uY29tL3N0b3J5L3dvbWVucy13b3JsZC1jdXAtMjAyMi1iaWdnZXN0LWNoYWxsZW5nZS1mb3Itc291dGgtYWZyaWNhLWFuZC1wYWtpc3Rhbi1zY29yaW5nLXJ1bnMtYWdhaW5zdC1zcGluLTEzMDQ5NDHSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Scoring runs against spin remains the biggest challenge for South Africa and Pakistan  ESPNcricinfoICC Women's World Cup - Watch: Pakistan Lose The Plot In Last Over As South Africa Win Thriller  NDTV SportsCoach David Hemp speaks ahead of Pakistan Women v South Africa  Cricket WorldRecent Match Report - SA Women vs PAK Women 9th Match 2021/22  ESPNcricinfoBismah Maroof feels confident about her team's improvement  Times of IndiaView Full coverage on Google News","content":null,"pubDate":"2022-03-11 12:53:57","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL 2022: Rajasthan Royals Appoints Lasith Malinga As Fast Bowling Coach","link":"https://www.sentinelassam.com/sports/cricket/ipl-2022-rajasthan-royals-appoints-lasith-malinga-as-fast-bowling-coach-582284","keywords":["Breaking News,Sports,Feature,News Ticker,Cricket"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"During his career that spanned over 17 years, the right-arm fast bowler represented Sri Lanka in 340 matches across the three formats and picked up 546 wickets.","content":"New Delhi: Rajasthan Royals (RR) on Thursday announced Sri Lankan legend Lasith Malinga as their new fast bowling coach ahead of the anticipated Indian Premier League (IPL) 2022.The 38-year-old Malinga, who was a nightmare for many of the world's best batsmen, will be seen guiding the talented pacers of the Rajathan Royals.''Malinga will oversee the preparation of bowling strategies in the build-up and during the season, while also accelerating the development of the young bowlers by imparting his knowledge and expertise of T20 cricket,'' an official statement from the RR said.Speaking over the development, Malinga said, \"It's a wonderful feeling for me to return to the IPL and an absolute honour to join Rajasthan Royals, a franchise that has always promoted and developed young talent. I am excited by the pace bowling unit we have going into the tournament and looking forward to supporting all the fast bowlers with the execution of their game-plans and their overall development.''''I've made some very special memories in the IPL with Mumbai Indians and now with Royals, looking forward to new experiences and creating great memories in this journey,\" he added.During his career that spanned over 17 years, the right-arm fast bowler represented Sri Lanka in 340 matches across the three formats and picked up 546 wickets. In the Indian Premier League, he only ever represented one team - Mumbai Indians - for whom he grabbed 170 scalps in 122 matches. Malinga, who had announced his retirement from all formats of the game in January 2021, most recently in February 2022, he served as Sri Lanka's Bowling Strategy Coach for their T20I series against Australia. Also read: All-Round New Zealand Crush India In Women's World CupAlso watch:","pubDate":"2022-03-11 12:13:01","full_description":"New Delhi: Rajasthan Royals (RR) on Thursday announced Sri Lankan legend Lasith Malinga as their new fast bowling coach ahead of the anticipated Indian Premier League (IPL) 2022. The 38-year-old Malinga, who was a nightmare for many of the world's best batsmen, will be seen guiding the talented pacers of the Rajathan Royals. ''Malinga will oversee the preparation of bowling strategies in the build-up and during the season, while also accelerating the development of the young bowlers by imparting his knowledge and expertise of T20 cricket,'' an official statement from the RR said. Speaking over the development, Malinga said, \"It's a wonderful feeling for me to return to the IPL and an absolute honour to join Rajasthan Royals, a franchise that has always promoted and developed young talent. I am excited by the pace bowling unit we have going into the tournament and looking forward to supporting all the fast bowlers with the execution of their game-plans and their overall development.'' ''I've made some very special memories in the IPL with Mumbai Indians and now with Royals, looking forward to new experiences and creating great memories in this journey,\" he added. During his career that spanned over 17 years, the right-arm fast bowler represented Sri Lanka in 340 matches across the three formats and picked up 546 wickets. In the Indian Premier League, he only ever represented one team - Mumbai Indians - for whom he grabbed 170 scalps in 122 matches. Malinga, who had announced his retirement from all formats of the game in January 2021, most recently in February 2022, he served as Sri Lanka's Bowling Strategy Coach for their T20I series against Australia. Also read: All-Round New Zealand Crush India In Women's World Cup Also watch:","image_url":"https://assets.sentinelassam.com/h-upload/2022/03/11/323419-mmm.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"Jasprit Bumrah: 'We're still very new' to pink-ball cricket - ESPNcricinfo","link":"https://news.google.com/__i/rss/rd/articles/CBMifmh0dHBzOi8vd3d3LmVzcG5jcmljaW5mby5jb20vc3RvcnkvaW5kLXZzLXNsLTJuZC10ZXN0LTIwMjEtMjItamFzcHJpdC1idW1yYWgtd2UtcmUtc3RpbGwtdmVyeS1uZXctdG8tcGluay1iYWxsLWNyaWNrZXQtMTMwNDk0ONIBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Jasprit Bumrah: 'We're still very new' to pink-ball cricket  ESPNcricinfoIndia vs Sri Lanka | 2nd Test | Preview  Royal Challengers BangaloreIndia primed for series sweep against injury-hit Sri Lanka  wknd.India vs Sri Lanka, 2nd Test: Bengaluru ready for pink hue  Times of IndiaIND vs SL: Rohit Sharma Set To Become 9th Indian Player To Play In More Than 400 International Matches  Cricket AddictorView Full coverage on Google News","content":null,"pubDate":"2022-03-11 12:08:10","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"First pictures of Thai masseuse, 27, who gave Shane Warne back massage two hours before his death - Daily Mail","link":"https://news.google.com/__i/rss/rd/articles/CBMif2h0dHBzOi8vd3d3LmRhaWx5bWFpbC5jby51ay9uZXdzL2FydGljbGUtMTA2MDI1MTcvRmlyc3QtcGljdHVyZXMtVGhhaS1tYXNzZXVzZS0yNy1nYXZlLVNoYW5lLVdhcm5lLW1hc3NhZ2UtdHdvLWhvdXJzLWRlYXRoLmh0bWzSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"First pictures of Thai masseuse, 27, who gave Shane Warne back massage two hours before his death  Daily MailWhy did we endlessly forgive Shane Warne? He was boorish and cringey … but we loved him  The GuardianThe phone call from Shane Warne's agent that landed late cricket legend $1million  The MirrorShane Warne's body returns to Australia: Son Jackson drives family home  Daily MailDid media coverage of Shane Warne’s death step over the line?  The GuardianView Full coverage on Google News","content":null,"pubDate":"2022-03-11 11:46:23","image_url":null,"source_id":"google","country":["united kingdom"],"category":["sports"],"language":"english"}]}