{"newsArray":[{"title":"Most time nervous 90s in Test: 5 खिलाड़ी जो टेस्ट क्रिकेट में सबसे ज्यादा बार हुए नर्वस 90s के शिकार... शीर्ष पांच में 2 भारतीय भी शामिल","link":"https://hindi.news18.com/photogallery/sports/cricket-sachin-tendulkar-steve-waugh-rahul-dravid-5-cricketers-who-have-been-the-victim-of-nervous-nintees-most-often-in-test-cricket-4987305.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"Most time nervous 90s in test Cricket: क्रिकेट में किसी भी बल्लेबाज के लिए नर्वस नाइंटीज का शिकार होना बेहद पीड़ादायी होता है. ऑस्ट्रेलिया के बल्लेबाज ट्रेविस हेड (Travis Head) वेस्टइंडीज (AUS vs WI) के खिलाफ पर्थ टेस्ट की पहली पारी में 99 रन बनाकर आउट हुए. यानी वह महज एक रन से शतक चूक गए. हेड जब क्रेग ब्रैथवेट की गेंद पर बोल्ड होकर पवेलियन लौट रहे थे तो, उनके चेहरे पर मायूसी साफ तौर पर देखी जा सकती थी. हालांकि ऐसा पहली बार नहीं हुआ है जब किसी बल्लेबाज ने क्रिकेट के पारंपरिक फॉर्मेट में 90 और 100 के बीच में आउट हुआ हो. टॉप 5 में 2 भारतीय भी शामिल हैं.","content":null,"pubDate":"2022-12-02 01:39:06","image_url":"https://images.news18.com/ibnkhabar/uploads/2022/12/Steve-Waugh-sachin-tendulkar-travis-head-16699446303x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","country":["india"],"category":["sports"],"language":"hindi"},{"title":"Four centuries and a world record: England blow away Test traditions","link":"https://www.watoday.com.au/sport/cricket/four-centuries-and-a-world-record-england-blow-away-test-traditions-20221202-p5c337.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Rizwan Ali"],"video_url":null,"description":"England stamped their aggressive brand of Test cricket on their first match in Pakistan in 17 years by amassing a world record 4-506 with four batters smashing hundreds.","content":"Rawalpindi: Virus-hit England stamped their aggressive brand of Test cricket on their first match in Pakistan in 17 years by amassing a world record 4-506 with four batters smashing hundreds on Thursday. Zak Crawley hit 122 and Ben Duckett made 107 in a blistering opening stand of 233. Ollie Pope and Harry Brook blazed hundreds in the last session in an astonishing display of power-hitting against an inexperienced Pakistan bowling attack. And the Test almost didn’t start. England confirmed it had a fit 11 and the match could go ahead only two hours before the toss. Then it destroyed a host of records in only 75 overs when play ended prematurely because of bad light. The 4-506 total was the highest on the first day of any Test, surpassing Australia’s 6-494 in 1910 against South Africa in Sydney. England also became the fastest team to score 500 runs. Four England batters scored centuries in one innings for the first time in 15 years. “It’s unbelievable,” Crawley said. “I was pleased with how I played ... I was annoyed when I got out because you always want more.” Century-maker Harry Brook salutes the crowd as he leaves the field at stumps on day one against Pakistan. Credit: Getty Images Pope made 108 and Brook 101 not out. Of the four centurions, Duckett was the slowest. He need 105 balls for his maiden ton. Brook took 80 balls, the third fastest by an Englishman.","pubDate":"2022-12-01 23:00:00","image_url":null,"source_id":"watoday","country":["australia"],"category":["sports"],"language":"english"},{"title":"England score 506 runs on day one!","link":"https://www.couriermail.com.au/sport/cricket/england-score-506-runs-on-day-one/video/2c42e6f93291aa492735aabcf999df69","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket: England have become just the fifth ever team to produce over 500 runs in a single day in their clash with Pakistan.","content":"Cricket: England have become just the fifth ever team to produce over 500 runs in a single day in their clash with Pakistan.","pubDate":"2022-12-01 21:54:18","image_url":null,"source_id":"couriermail","country":["australia"],"category":["sports"],"language":"english"},{"title":"Never-before-seen stat in record demolition","link":"https://www.couriermail.com.au/sport/cricket/englands-neverbeforeseen-feat-in-record-day-out-against-pakistan/news-story/db8bb67bc1cb55cbee39567d4b0c939f","keywords":["Cricket news and galleries","Kayo","Sport news and galleries"],"creator":null,"video_url":null,"description":"England went on an incredible batting spree on day one of the First Test with four batsmen scoring centuries.","content":"Zak Crawley, Ben Duckett, Ollie Pope and Harry Brook all reached three figures and it was the first time in Test history that four batsmen have scored hundreds on the opening day of a Test.It was the first time four England players have hit hundreds since a 2007 Test against West Indies, and for Duckett and Brook they were maiden international centuries.It meant an almost unbelievable start to England’s first day of Test cricket in the country for 17 years.England finished the opening day with 506-4 from 75 overs – a scoring rate of 6.74 runs per over, becoming the fastest team ever to reach 500.Brendon McCullum’s side also attacked 64 per cent of the balls they faced today - the highest attacking shot percentage in a Test innings since records begun in 2006, and an equivalent rate to what England have managed in T20.Watch Australia v West Indies. Every test match live and ad-break in play on Kayo. New to Kayo? Start your free trial now >It was the most runs England have ever scored in a single day of Test cricket and the first time any country has scored more than 500 runs on the opening day.And play finished 15 overs early because of bad light!After their brilliant summer at home – when they won six Tests out of seven – England took ‘Bazball’ to even more remarkable heights on their first day overseas since Ben Stokes and McCullum took charge.England won the Twenty20 World Cup last month and the power, aggression and invention of their batting would not have looked out of place in the shortest international format.Sure, the pitch in Rawalpindi was pancake flat and Pakistan’s attack worryingly impotent, but the rate at which England scored was nothing short of sensational.It was fair to say England’s players had recovered from the virus which swept through the camp the day before play got underway.Indeed, it was confirmed the match would begin on time just two-and-a-half hours before the start.Only wicketkeeper Ben Foakes was still feeling too unwell to play – so Pope was installed as emergency wicketkeeper with Surrey’s Will Jacks joining Lancashire’s Liam Livingstone as a Test debutant.England broke a string of fast-scoring records.Crawley took 14 runs from Naseem Shah in the first over of the match and reached his century from 86 balls – beating Graham Gooch’s England record of 95 balls for an opening batsman.Duckett, playing his first Test for six years, helped Crawley compile England’s fastest century opening stand of all time 13.5 overs, beating the 17.2 overs taken by Crawley and Alex Lees against South Africa at the Oval in their previous game.England were 141-0 after 20 overs, four more than Pakistan managed when batting first and making 137-8 in the T20 World Cup final.Crawley and Duckett rampaged England to 174-0 at lunch – their highest lunch total on day one of a Test match, beating their 169-0 against Australia at Trent Bridge in 1938.Pakistan did not manage a maiden until the 39th over and bowled only three all day.Brook struck six fours in a single over from left-arm spinner Saud Shakeel on his way to a century in his second Test from 80 balls, England’s third-fastest of all time.Oh, the wickets? Duckett was out lbw on review attempting a reverse sweep and then Crawley, given out lbw on 99 but saved by DRS, which showed the ball missing leg stump, was bowled by a ball that swung in a fraction.Joe Root was the only batsman to miss out on the runs bonanza, lbw for 23 when he missed a sweep shot.Pope was also lbw following a review and departed for 108 at better than a run-a-ball. Stokes came in shortly before the close and contributed 34 not out from 15 balls.- This article originally appeared in The Sun and was reproduced with permission.","pubDate":"2022-12-01 21:38:00","image_url":null,"source_id":"couriermail","country":["australia"],"category":["sports"],"language":"english"},{"title":"FIFA World Cup LIVE: Spain 1 - 2 Japan, Germany 2 - 2 Costa Rica","link":"http://www.firstpost.com/sports/live-score-fifa-world-cup-2022-japan-vs-spain-costa-rica-vs-germany-today-group-e-football-latest-updates-11734921.html","keywords":["Sports"],"creator":["Bansal Shah"],"video_url":null,"description":"FIFA World Cup LIVE: Spain 1 - 2 Japan, Germany 2 - 2 Costa Rica","content":"FIFA World Cup Highlights: Spain 1 - 2 Japan, Germany 4 - 2 Costa Rica FIFA World Cup Live: Group toppers Spain face second-placed Japan, while Costa Rica play against bottom-placed Germany. Bansal Shah December 01, 2022 23:58:17 IST Auto refresh feeds FIFA World Cup Group E Highlights: Spain vs Japan Germany vs Costa Rica Highlights LIVE NEWS and UPDATES Dec 02, 2022 - 02:42 (IST) FIFA World Cup Group E LIVE updates After all the hara-kiri, and all the excitement, the equations have been solved. The night was expected to be exciting, but it has been a lot more than that. A roller coaster ride of sorts throughout those 90 minutes as all four teams had qualifying chances at different points in time. Ultimately it is Spain and Japan who have qualified for the Round of 16 and will face Croatia and Morocco respectively. Dec 02, 2022 - 02:29 (IST) FIFA World Cup Group E LIVE updates, Germany vs Costa Rica Full Time | PEEP! PEEP! A comprehensive win for Germany, but they have been knocked out of the FIFA World Cup trailing Spain on goal difference. Costa Rica was never in the race after a point in time, but you will feel for Germany as they miss out even after playing in an excellent manner! Germany 4 - 2 Costa Rica Dec 02, 2022 - 02:26 (IST) FIFA World Cup Group E LIVE updates, Japan vs Spain Full Time | The land of rising Sun - Japan have a sun arising in the FIFA World Cup as they have beaten Spain and won Group F. Spain will qualify as the second team on account of goal difference, but cannot help Germany. Japan once again come back in the second half after trailing 1-0 at the half way mark. Japan 2 - 1 Spain Dec 02, 2022 - 02:18 (IST) FIFA World Cup Group E LIVE updates, Germany vs Costa Rica 89' | Germany have netted a fourth goal, but have been denied on account of off-side. Referee Stephanie Franfart is having a consultation with VAR guys, and the goal has been allowed! Germany 4 - 2 Costa Rica Dec 02, 2022 - 02:15 (IST) FIFA World Cup Group E LIVE updates, Germany vs Costa Rica 85' | Germany are in the lead now - Havertz has scored a brace. And Gnabry the man to assist him. But these goals are only proving to be fruitful for Spain as Germany have no scope to get ahead of Spain on goal difference. Germany can qualify only if Spain score another goal and draw with Japan. Germany 3 - 2 Costa Rica Dec 02, 2022 - 02:07 (IST) FIFA World Cup Group E LIVE updates, Germany vs Costa Rica Germany would have been leading, if not for Navas! Keylor Navas just did this pic.twitter.com/OUmw4hDnle — Joe Crann (@YesWeCrann) December 1, 2022 Dec 02, 2022 - 02:05 (IST) FIFA World Cup Group E LIVE updates, Japan vs Spain 79' | Meanwhile, Japan is playing with a heavy and deep defense line. Can Spain get past that? Spain 1 - 2 Japan Dec 02, 2022 - 02:03 (IST) FIFA World Cup Group E LIVE updates, Germany vs Costa Rica 73' | Germany have levelled now. A small error in defense on Costa Rica's part and Germany have not wasted a moment to exploit the error. Kai Havertz comes in and has made an impact quite swiftly. He had a one-on-one opportunity in front of the goalkeeper and he smashed it to his right to level with Costa Rica. Germany 2 - 2 Costa Rica Dec 02, 2022 - 01:59 (IST) FIFA World Cup Group E LIVE updates, Germany vs Costa Rica 70' | Costa Rica have another goal and the group has turned upside down now! Can you believe it! Costa Rica are ahead of Germany. A free kick from the left wing and a lovely header. Germany 1 - 2 Costa Rica Dec 02, 2022 - 01:50 (IST) FIFA World Cup Group E LIVE updates, Germany vs Costa Rica 58' | Costa Rica have levelled the scores at the Al Bayt Stadium. Germany are going down through all means possible. Watson played an excellent header, but straight at Neuer. He stopped the ball but couldn't keep it in his hands. Valverde ran to take the rebound and smashed the ball in the bottom corner. Germany 1 - 1 Costa Rica Load More In a complicated Group E, where all four teams are alive and have a possibility to qualify for the Round of 16, Spain will meet Japan at the Khalifa International Stadium, simultaneously while Germany will play Costa Rica at the Al Bayt Stadium. The equation for Spain is quite simple, who will seek a draw to qualify for the next round. Japan, on the other end, will need a win to march ahead. If they draw against Spain, only a parallel draw in the other group match can salvage them. Germany find themselves in a strange position at the bottom of the points table after two games, failing to win either of the two. The primary target for Germany will be to beat Costa Rica, but the situation is such that even a might not be sufficient for them to extend their stay in Qatar. A draw will see Costa Rica through if Spain beats Japan. It will require patience worth a few hours to find the answers to these equations, as algebra either will not be able to find the missing values. Read all the Latest News , Trending News , Cricket News , Bollywood News , India News and Entertainment News here. Follow us on Facebook , Twitter and Instagram . Updated Date: December 02, 2022 02:31:14 IST TAGS: Fifa World Cup 2022 Kickingaround","pubDate":"2022-12-01 20:30:18","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/12/Spain-FIFA-World-Cup.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"“Ye bachchon ki team hai”: Shoaib Akhtar reckons Pakistan fast bowlers will have to work really hard to excel in Test Cricket","link":"https://thesportsrush.com/cricket-news-ye-bachchon-ki-team-hai-shoaib-akhtar-reckons-pakistan-fast-bowlers-will-have-to-work-really-hard-to-excel-in-test-cricket/","keywords":["Cricket","England tour of Pakistan 2022","Pakistan","Shoaib Akhtar"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Former Pakistan pacer Shoaib Akhtar, in line with the Pakistan Cricket fans has expressed his disappointment on the national team’s poor show with the ball on ‘Day 1’ of the ongoing first Test match against England, at the Rawalpindi Cricket Stadium. To state that the Pakistani bowlers were beaten black and blue would be an… The post “Ye bachchon ki team hai”: Shoaib Akhtar reckons Pakistan fast bowlers will have to work really hard to excel in Test Cricket appeared first on The SportsRush.","content":"Former Pakistan pacer Shoaib Akhtar, in line with the Pakistan Cricket fans has expressed his disappointment on the national team’s poor show with the ball on ‘Day 1’ of the ongoing first Test match against England, at the Rawalpindi Cricket Stadium. To state that the Pakistani bowlers were beaten black and blue would be an understatement, as the England batters were not only all over them like a rash, but also went on to create some records on their way despite playing mere 75 Overs in the day. Courtesy of the ‘Bazball’ approach, England went on to become the first team ever to surpass the 500-run mark on the scoreboard on ‘Day 1’ of a Test. Also, they became the first team to have as many as four centurions on the first day of a Test match. ALSO READ: Saqlain Mushtaq hilariously reacts upon being asked whether Pakistan can produce another spinner like him The thrashing began with a 233-run stand off mere 36.4 Overs between the opening pair of Ben Duckett (107) and Zak Crawley (122). It was then followed by another couple of tons off the bats of Ollie Pope (108) and Harry Brook (101*), with the latter not only smashing his maiden Test century in his second Test innings, but also going on to become the third fastest centurion in the format for England, in mere 80 balls. At Stumps on ‘Day 1’, Brook (101*) and Ben Stokes (34* off 15) were still at the crease with the scorecard reading 506/4. Shoaib Akhtar reckons Pakistan fast bowlers are not yet ready to excel in Test Cricket Post the end of day’s play Shoaib Akhtar took to his social media handle to term the Pakistan pacers playing the ongoing Test as ‘T20 fast bowlers’, who will require to put in loads of effort and hard work to become proper Test match bowlers. He then went on to add that the team overall comprises a group of youngsters who are ‘very innocent’, and will soon learn that playing Test Cricket is not an easy job. “Nothing against the youngsters. Hamari team hai, ye bachchon ki team hai, achche bachche hain, aur saron se mai milan bhi hoon(This is our team, a team comprising young kids who I have met before. They are really innocent). They are very innocent. But you know Test Cricket is actually very bruising, and it is not a pleasant site to watch them getting hammered,” remrked Akhtar. Kharab tabiyat pay hamara yeh haal kia hai England k players nay. Yeh theek hotay toh kya kertay. pic.twitter.com/rr8fUhBgzY — Shoaib Akhtar (@shoaib100mph) December 1, 2022 For more Cricket-related news, click here. The post “Ye bachchon ki team hai”: Shoaib Akhtar reckons Pakistan fast bowlers will have to work really hard to excel in Test Cricket appeared first on The SportsRush.","pubDate":"2022-12-01 19:16:14","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"TV execs to CA: End Smith standoff to save BBL","link":"https://www.themercury.com.au/sport/cricket/big-bash-league-12-cricket-australia-urged-to-end-steve-smith-stand-off-to-save-bbl-season/news-story/32f64fd931e407924e9a85cb9e824ce6","keywords":["Big Bash News","Cricket news and galleries"],"creator":null,"video_url":null,"description":"TV executives have urged Cricket Australia to do what it takes to get Steve Smith into this summer’s Big Bash, as his legend grew in Perth as the best since Bradman.","content":"The mysterious standoff between CA and Smith over the BBL only became more bewildering on Thursday as the batting master smashed an effortless double century – the fourth of his career – against the hapless West Indies to join Bradman with 29 career tons.Ricky Ponting’s record of 41 Test hundreds now looks well within reach for Smith thanks to a technique revamp, but despite his superstar status as an all-time great, CA has refused to show him the money which would convince him to help headline the most critical season in BBL history.Smith feels disrespected that CA won’t make him a similar offer to the six figure marketing deal they have given David Warner, particularly after they inexplicably banned him from joining the Sydney Sixers last summer when he was willing to play for a pittance.Fox Sports boss Steve Crawley declared Smith would be a massive game-changer for the Big Bash, which is under enormous pressure to safeguard its future this summer as a TV rights deal looms.“It needs people like Steve Smith, there’s no doubt about it. I don’t want to get involved in the political side and telling Cricket Australia what to do, but as the producer of television and content and sports content, there would be few things better than having Steve Smith involved in the BBL,” Crawley told News Corp.SCBBL PROMO“It’s a critical season. It’s something that needs a lift. Everyone is trying hard. And there’s something sitting in front of us that we really should consider. But again, not telling Cricket Australia to do, just saying as the producer of content. It’s a great prospect.”Channel 7 chief executive James Warburton said it was time CA made Smith the priority he should be.“Steve Smith would be a huge addition for BBL12,” Warburton told News Corp.“CA should be moving heaven and earth to get him locked in ASAP.”Cricket Australia say they have not closed the door on Smith playing in the Big Bash – and want him part of the competition – but it remains unclear whether the organisation is willing to table him a Warner-like offer.News Corp understands CA may try to reopen talks in the coming days in the hope of striking an eleventh hour compromise deal with Smith.“He’s a very popular, iconic player for the Sixers and we’d love for him to play in the BBL this year,” Big Bash Leagues general manager Alistair Dobson told News. “If that happens, then it’d be great for the competition.”BBL executives have been breathlessly spruiking the late signings of Andre Russell and Faf du Plessis, but broadcasters say securing certified Australian drawcards like Smith – who are actually keen to play – should be the No.1 priority, particularly when the other stars, fast bowlers Mitchell Starc, Josh Hazlewood and Pat Cummins, have put themselves off limits due to workloads.CA says the marketing contract given to Warner to secure him to the Sydney Thunder was a special case and they don’t want to set a dangerous precedent for themselves by making the propping up of contracts for Australian stars the norm.","pubDate":"2022-12-01 19:00:00","image_url":null,"source_id":"mercury","country":["australia"],"category":["sports"],"language":"english"},{"title":"Kuwait Cricket, FRiENDi mobile announce partnership for cricket season 2022-2023","link":"https://www.arabtimesonline.com/news/kuwait-cricket-friendi-mobile-announce-partnership-for-cricket-season-2022-2023/","keywords":["Sports","Kuwait Cricket"],"creator":["Arab Times"],"video_url":null,"description":"KUWAIT CITY, Dec 1: Kuwait Cricket Club is the official governing body for the game of cricket in association with Public Authority of Sports, Olympic Committee of Kuwait and the International Cricket Council (ICC – the world’s governing body for cricket) and Asian Cricket Council (ACC – Operating under ICC) Kuwait Cricket Club (KCC) and … The post Kuwait Cricket, FRiENDi mobile announce partnership for cricket season 2022-2023 appeared first on ARAB TIMES - KUWAIT NEWS.","content":"This post has been read 524 times! KUWAIT CITY, Dec 1: Kuwait Cricket Club is the official governing body for the game of cricket in association with Public Authority of Sports, Olympic Committee of Kuwait and the International Cricket Council (ICC – the world’s governing body for cricket) and Asian Cricket Council (ACC – Operating under ICC) Kuwait Cricket Club (KCC) and FRiENDi mobile Kuwait (by Connect Arabia W.L.L) announced their partnership in a glittering ceremony on Monday, Nov 21 at the Olympic Council of Asia headquarters to be the title sponsor for the KCC domestic and international cricket season 2022- 23. The partnership deal was signed between Kuwait Cricket President Haider Farman and FRiENDi mobile CEO Benoitt Janin. “Kuwait is a country with millions of expatriates who are extremely interested in the game of Cricket. We are happy to associate with Kuwait Cricket to promote this game of cricket among the expatriates here,” Benoitt Janin CEO of Friendi Mobile, said. On his part, Haider Farman thanked FRiENDi mobile for the partnership and said “that Kuwait Cricket would continue to improve the infrastructure and all other facilities provided to the teams and players in the coming months and season in order to help and assist the national team players prepare for the international tournaments”. As per the partnership, FRiENDi mobile acquired the principal sponsorship and naming rights for the Kuwait National Men’s team and all the major domestic tournaments in the state of Kuwait for the men’s category. “We sincerely thank FRiENDi mobile for this groundbreaking partnership; through this partnership with KCC (ranked 25th in the ICC – International Cricket Council T20i global rankings) FRiENDi mobile aims to increase their brand awareness, exposure and acquire more direct customers for their brand and in the process, promote, develop and help expand the game of cricket in the State of Kuwait amongst all nationalities” the Director General of Kuwait Cricket Sajid Ashraf said. The ceremony was hosted by @ NoorAlObaid, Head of Marketing at Gateway Consulting who are the official marketing partners of KCC for the season 2022-23 and attended by a galaxy of personalities including the Kuwait National Men’s Team (led by Captain Mohammad Aslam Mnm Aslam & National Head Coach Muthumudalige Pushpakumara) KCC Board Vice President Faisal Al Marzouk, General Secretary Emad Al Jassam, Board Members Mahmoud Bastaki, Ms Awadtif Al Qallaf & Deputy GM Faisal Al Obaid of Gateway Consulting. On behalf of FRiENDi mobile, the Commercial Director of FRiENDi mobile Michael Fitzpatrick, Group VP Michael Klindt, Marketing Manager Asif Abdul Ghaffar and Deputy Sales Manager Kate Graham graced the occasion. This post has been read 525 times! DOHA, Oct 28: Kuwait national cricket team defeated … You must be to post a comment.","pubDate":"2022-12-01 18:45:27","image_url":null,"source_id":"arabtimesonline","country":["Kuwait"],"category":["sports"],"language":"arabic"},{"title":"Green Gators wins CA Sri Lanka Cricket Trophy","link":"https://www.arabtimesonline.com/news/green-gators-wins-ca-sri-lanka-cricket-trophy/","keywords":["Sports","Kuwait Cricket"],"creator":["Arab Times"],"video_url":null,"description":"KUWAIT CITY, Dec 1: Chartered Accountants of Sri Lanka Kuwait Chapter concluded its annual cricket tournament on Nov 18 at Mishref Ground. This tournament, a oneday event consisted of limited over matches with 7 overs in each inning and was participated by four teams, namely Green Gators captained by Milhan Wahideen, Yellow Eagles by Prabu … The post Green Gators wins CA Sri Lanka Cricket Trophy appeared first on ARAB TIMES - KUWAIT NEWS.","content":"This post has been read 587 times! KUWAIT CITY, Dec 1: Chartered Accountants of Sri Lanka Kuwait Chapter concluded its annual cricket tournament on Nov 18 at Mishref Ground. This tournament, a oneday event consisted of limited over matches with 7 overs in each inning and was participated by four teams, namely Green Gators captained by Milhan Wahideen, Yellow Eagles by Prabu Kanapathy, Red Dragons by Sanuja Karunarathna and Blue Raptors by Mohamed Rilwan who are members of the Chapter. Green Gators roared to beat Red Dragons at the final with Thariq’s explosive batting securing his best batsman title in the tournament, he entered in as an opener and pushed the team to victory. The best bowler title went to Samantha Weerasekara of Yellow Eagles who collected three wickets in same over. Sanuja Karunarathna who led Red Dragons to the runners up was awarded the man of the tournament for his consistent performance in technical batting, bowling and fielding. 2nd runners up went to Yellow Eagles in the runners up battle with Blue Raptors. The final award ceremony was graced by His Excellency the Ambassador of Sri Lanka in Kuwait, Mohammed Jauhar and Minister / Head of Chancery Abdul Haleem together with the President of the Chapter Dimuthu Ethugala, the most senior member of the Chapter Aslam Hameed and inaugural President of the Chapter Sajad Cader. The tournament was umpired by Sunil John David from India with support of leg umpire Arshad Hussain Marikkar while the score board was monitored and moderated by member Asoka Rupasighe along with the assistance of Dishani Malliyawadu. “This year tournament was blessed by the wonderful weather in Kuwait and almost all members including family members participated in the event. I thank the HE and his staff for being with us, also thank the organizing committee with special thanks to the Chairman of the Organizing Committee Vice President Riyaz Jamaldeen” said the President. The event was a success thanks to the specific roles played by the Executive Committee of CA Sri Lanka Kuwait Chapter which consists of General Secretary Dishani Malliyawadu, Treasurer Mohamed Murshid and Committee members Mohammed Baseer, Pasindu Karunathilaka and Sajith Udayanga. CA Sri Lanka Kuwait Chapter is an affiliated extension of the Institute of Chartered Accountants of Sri Lanka through the patronage of Sri Lanka Embassy in Kuwait and the Chapter has 65 members working in Kuwait. This post has been read 588 times! DOHA, Oct 28: Kuwait national cricket team defeated … You must be to post a comment.","pubDate":"2022-12-01 18:43:35","image_url":null,"source_id":"arabtimesonline","country":["Kuwait"],"category":["sports"],"language":"arabic"},{"title":"FIFA World Cup LIVE: Japan face Spain, Germany look to remain alive against Costa Rica","link":"https://www.firstpost.com/sports/live-score-fifa-world-cup-2022-japan-vs-spain-costa-rica-vs-germany-today-group-e-football-latest-updates-11734921.html","keywords":["Sports"],"creator":["Bansal Shah"],"video_url":null,"description":"FIFA World Cup LIVE: Japan face Spain, Germany look to remain alive against Costa Rica","content":"FIFA World Cup LIVE: Japan face Spain, Germany look to remain alive against Costa Rica FIFA World Cup Live: Group toppers Spain face second-placed Japan, while Costa Rica play against bottom-placed Germany. Bansal Shah December 01, 2022 23:58:17 IST Auto refresh feeds FIFA World Cup Group E LIVE: Spain vs Japan Germany vs Costa Rica Highlights LIVE NEWS and UPDATES Dec 02, 2022 - 01:01 (IST) FIFA World Cup Group E LIVE updates, Japan vs Spain 29' | Spain are playing strategically - keeping the possession with themselves while not pushing too much either. They have tried to lure Japan, but have not let them have the ball. Spain 1 - 0 Japan Dec 02, 2022 - 00:47 (IST) FIFA World Cup Group E LIVE updates, Germany vs Costa Rica Just while Spain scored against Japan, Germany too have made their mark and edged ahead of Costa Rica. Serge Gnarby latches onto the cross from Raum and nets into the corner! However, he knows more work needs to be done and hence avoids celebrations. Germany 1 - 0 Costa Rica Dec 02, 2022 - 00:44 (IST) FIFA World Cup Group E LIVE updates, Japan vs Spain 12' | Spain have drawn the first blood against Japan! An excellent header by Morata that sneaked through the left side of the Japan goalkeeper! That was Morata's third goal of the tournament! Spain 1 - 0 Japan Dec 02, 2022 - 00:37 (IST) FIFA World Cup Group E LIVE updates, Germany vs Costa Rica 5' | Germany have started in the most aggressive manner possible. Just five minutes of play and they already have made three entries in the box, with two excellent shoots at the net. Costa Rica goalkeeper has been excellent though. Germany 0 - 0 Costa Rica Dec 02, 2022 - 00:32 (IST) FIFA World Cup Group E LIVE updates, Germany vs Costa Rica Costa Rica: Navas, Duarte, Waston, Vargas, Fuller, Borges, Tejeda, Oviedo, Aguilera, Campbell, Venegas Germany: Neuer, Kimmich, Sule, Rudiger, Raum, Gundogan,Goretzka, Gnabry, Musiala, Sane, Muller Dec 02, 2022 - 00:28 (IST) FIFA World Cup Group E LIVE updates, Japan vs Spain Team line ups - Japan: Gonda, Itakura, Yoshida, Taniguchi, Junya Ito, Morita, Tanaka, Nagatomo, Kamada, Maeda, Kubo. Subs: Kawashima, Yamane, Endo, Shibasaki, Doan, Mitoma, Minamino, Tomiyasu, Asano, Sakai, Machino, Ueda, Schmidt, Soma, Hiroki Ito. Spain: Simon, Azpilicueta, Rodri, Pau Torres, Balde, Gavi, Busquets, Gonzalez, Williams, Morata, Olmo. Subs: Sanchez, Garcia, Llorente, Koke, Asensio, Ferran Torres, Raya, Guillamon, Pino, Jordi Alba, Carlos Soler, Carvajal, Sarabia, Laporte, Fati. Dec 02, 2022 - 00:08 (IST) FIFA World Cup Group E LIVE updates This is how the points table looks like! Dec 02, 2022 - 00:07 (IST) FIFA World Cup Group E LIVE updates In one of the most complicated groups at the ongoing World Cup, Germany find themselves at the bottom of the points table, quite to the surprise of fans. Meanwhile, Spain have the strongest chance of qualifying to the next round, as even a defeat to Japan can see them through based on the goal difference. Stay tuned as it will require some patience for a couple of hours to solve this puzzle. Dec 01, 2022 - 23:54 (IST) FIFA World Cup Group E LIVE updates Hello and welcome to live coverage of Group E contests where all four teams have an opportunity to make it to the next round. Spain vs Japan - Khalifa International Stadium Germany vs Costa Rica - Al Bayt Stadium In a complicated Group E, where all four teams are alive and have a possibility to qualify for the Round of 16, Spain will meet Japan at the Khalifa International Stadium, simultaneously while Germany will play Costa Rica at the Al Bayt Stadium. The equation for Spain is quite simple, who will seek a draw to qualify for the next round. Japan, on the other end, will need a win to march ahead. If they draw against Spain, only a parallel draw in the other group match can salvage them. Germany find themselves in a strange position at the bottom of the points table after two games, failing to win either of the two. The primary target for Germany will be to beat Costa Rica, but the situation is such that even a might not be sufficient for them to extend their stay in Qatar. A draw will see Costa Rica through if Spain beats Japan. It will require patience worth a few hours to find the answers to these equations, as algebra either will not be able to find the missing values. Read all the Latest News , Trending News , Cricket News , Bollywood News , India News and Entertainment News here. Follow us on Facebook , Twitter and Instagram . Updated Date: December 01, 2022 23:58:17 IST TAGS: Fifa World Cup 2022 Kickingaround","pubDate":"2022-12-01 18:28:17","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/12/Spain-FIFA-World-Cup.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Two Blues overcome anxious start to easily beat Lake View in B-grade cricket","link":"https://thewest.com.au/news/kalgoorlie-miner/two-blues-overcome-anxious-start-to-easily-beat-lake-view-in-b-grade-cricket-c-9026833","keywords":null,"creator":["Neale Harvey"],"video_url":null,"description":"Great Boulder have opened their Eastern Goldfields Cricket Association B-grade campaign with seven wins.","content":null,"pubDate":"2022-12-01 18:00:00","image_url":"https://images.thewest.com.au/publication/C-9026833/111c6ed3d9e21ec8ce135e985066e14f6ce8ce14-16x9-x0y405w3888h2187.jpg","source_id":"thewest","country":["australia"],"category":["sports"],"language":"english"},{"title":"SAU vs MAH Dream11 Team Prediction, Match Preview, Fantasy Cricket Hints: Captain, Probable Playing 11s, Team News; Injury Updates For Today’s Vijay Hazare Trophy final match in Ahmedabad, 9 AM IST, December 2","link":"https://zeenews.india.com/cricket/sau-vs-mah-dream11-team-prediction-match-preview-fantasy-cricket-hints-captain-probable-playing-11s-team-news-injury-updates-for-today-s-vijay-hazare-trophy-final-match-in-ahmedabad-9-am-ist-december-2-2542756.html","keywords":null,"creator":null,"video_url":null,"description":"Saurashtra (SAU) vs Maharashtra (MAH) Dream11 Team Prediction Saurashtra vs Maharashtra Vijay Hazare Trophy final match Preview - Check My Dream11 Team, Best players list of SAU vs MAH, Saurashtra Dream11 Team Player List, Maharashtra Dream11 Team Player List, Dream11 Guru Tips, Fantasy Cricket Tips, Fantasy Cricket Tips, Fantasy Playing Tips.","content":null,"pubDate":"2022-12-01 17:39:00","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"Gautam Gambhir ने विदेशी कोचों पर साधा निशाना, बोले- ‘आते हैं और पैसा कमा कर गायब हो जाते हैं’","link":"https://www.abplive.com/sports/cricket/gautam-gambhir-talked-about-indian-coaches-in-a-video-he-told-how-foreign-coach-came-here-earn-money-and-vanish-2271983","keywords":["Cricket"],"creator":["ABP Live"],"video_url":null,"description":"Gautam Gambhir: पूर्व भारतीय खिलाड़ी गौतम गंभीर (Gautam Gambhir) ने भारतीय टीम की कोचिंग को लेकर बड़ी बात कही है. उन्होंने बताया कि कैसे भारतीय कोच टीम को फायदा पहुंचाते हैं. गंभीर ने अपने आधिकारिक ट्विटर अकाउंट से एक वीडियो शेयर किया है, जिसमें वो भारतीय टीम के कोच को लेकर बात कर रहे हैं. उन्होंने बताया कि कैसे विदेशी कोच आते हैं और पैसा कमाकर गायब हो जाते हैं. इसके अलावा उन्होंने मौजूदा भारतीय कोच राहुल द्रविड़ के बारे में भी बात की.  ‘भारतीय क्रिकेट एक भावना है’ गंभीर ने अपने इस वीडियो को शेयर करते हुए एक कैप्शन लिखा. उन्होंने कैप्शन देते हुए लिखा, “भारत एक भावना है. भारतीय क्रिकेट एक भावना है यह केवल एक भारतीय ही समझ सकता है!” इस वीडियो गंभीर शुरुआत करते हुए कहते हैं, “पिछले 6-7 सालों में इंडियन क्रिकेट में एक बात काफी अच्छी हुई है, जिसको लेकर मैं उम्मीद करता हूं कि यह जारी रहे, वह यह कि अनिल कुंबले से लेकर एक भारतीय ने इंडियन टीम को कोच करना शुरू किया है.” विदेशी कोच पैसा कमाकर गायब हो जाते हैं उन्होंने आगे कहा, “मैं इस बात में पक्का यकीन रखता हूं कि एक इंडियन को ही टीम को कोच करना चाहिए. ये सभी विदेशी कोच, जिन्हें हम बहुत अहमियत देते हैं, वो यहां आते हैं, पैसा कमाते हैं और गायब हो जाते हैं. स्पोर्ट्स में भावनाएं जुड़ी होती हैं. भारतीय क्रिकेट और भारतीय खेलों के बारे में सिर्फ वही भावुक हो सकता है, जिसने अपने देश का प्रतिनिधित्व किया हो.” गंभीर ने आगे बात करते हुए कहा, “चाहें वो राहुल द्रविड़ हो या उनसे पहले रवि शास्त्री और अनिल कुंबले हों. अगर आप राहुल द्रविड़ के बारे में पूछेंगे तो वह बाकी कोचों से ज़्यादा भावुक होंगे. काश मैं इनमें से किसी एक भारती कोच के अंडर में खेला होता.” India is an emotion, Indian cricket is an emotion. Only an Indian can understand this! pic.twitter.com/YjT6dl1ZRg — Gautam Gambhir (@GautamGambhir) November 30, 2022     ये भी पढ़ें.. FIFA World Cup 2022: लियोनल मेसी और रॉबर्ट लेवांडोव्स्की के बीच हो गया था बवाल? जानें दिग्गज ने क्या दी प्रतिक्रिया","content":"Gautam Gambhir: पूर्व भारतीय खिलाड़ी गौतम गंभीर (Gautam Gambhir) ने भारतीय टीम की कोचिंग को लेकर बड़ी बात कही है. उन्होंने बताया कि कैसे भारतीय कोच टीम को फायदा पहुंचाते हैं. गंभीर ने अपने आधिकारिक ट्विटर अकाउंट से एक वीडियो शेयर किया है, जिसमें वो भारतीय टीम के कोच को लेकर बात कर रहे हैं. उन्होंने बताया कि कैसे विदेशी कोच आते हैं और पैसा कमाकर गायब हो जाते हैं. इसके अलावा उन्होंने मौजूदा भारतीय कोच राहुल द्रविड़ के बारे में भी बात की. ‘भारतीय क्रिकेट एक भावना है’ गंभीर ने अपने इस वीडियो को शेयर करते हुए एक कैप्शन लिखा. उन्होंने कैप्शन देते हुए लिखा, “भारत एक भावना है. भारतीय क्रिकेट एक भावना है यह केवल एक भारतीय ही समझ सकता है!” इस वीडियो गंभीर शुरुआत करते हुए कहते हैं, “पिछले 6-7 सालों में इंडियन क्रिकेट में एक बात काफी अच्छी हुई है, जिसको लेकर मैं उम्मीद करता हूं कि यह जारी रहे, वह यह कि अनिल कुंबले से लेकर एक भारतीय ने इंडियन टीम को कोच करना शुरू किया है.” विदेशी कोच पैसा कमाकर गायब हो जाते हैं googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); News Reels उन्होंने आगे कहा, “मैं इस बात में पक्का यकीन रखता हूं कि एक इंडियन को ही टीम को कोच करना चाहिए. ये सभी विदेशी कोच, जिन्हें हम बहुत अहमियत देते हैं, वो यहां आते हैं, पैसा कमाते हैं और गायब हो जाते हैं. स्पोर्ट्स में भावनाएं जुड़ी होती हैं. भारतीय क्रिकेट और भारतीय खेलों के बारे में सिर्फ वही भावुक हो सकता है, जिसने अपने देश का प्रतिनिधित्व किया हो.” गंभीर ने आगे बात करते हुए कहा, “चाहें वो राहुल द्रविड़ हो या उनसे पहले रवि शास्त्री और अनिल कुंबले हों. अगर आप राहुल द्रविड़ के बारे में पूछेंगे तो वह बाकी कोचों से ज़्यादा भावुक होंगे. काश मैं इनमें से किसी एक भारती कोच के अंडर में खेला होता.” India is an emotion, Indian cricket is an emotion. Only an Indian can understand this! pic.twitter.com/YjT6dl1ZRg — Gautam Gambhir (@GautamGambhir) November 30, 2022 ये भी पढ़ें.. FIFA World Cup 2022: लियोनल मेसी और रॉबर्ट लेवांडोव्स्की के बीच हो गया था बवाल? जानें दिग्गज ने क्या दी प्रतिक्रिया var _fireSc=!0;document.addEventListener(\"scroll\",(e=>{if(_fireSc){var c=document.createElement(\"script\");c.src=\"//asset.fwpub1.com/js/embed-feed.js\",c.async=!0,document.getElementsByTagName(\"head\")[0].appendChild(c),_fireSc=!1}}));","pubDate":"2022-12-01 17:38:57","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2022/12/01/8b16aef6697745f5d55bd815fda62b9e1669901672487582_original.jpg","source_id":"abplive","country":["india"],"category":["sports"],"language":"hindi"},{"title":"PAK vs ENG Test | England made history by scoring more than 500 runs on the first day","link":"https://thenewsglory.com/pak-vs-eng-test-england-made-history-by-scoring-more-than-500-runs-on-the-first-day/","keywords":["Sports","Cricket","England","India","Pakistan","Test cricket"],"creator":["The News Glory"],"video_url":null,"description":"Rawalpindi: The England cricket team has created a new record in the cricket world by accumulating 506 runs on the first day of the Test match against the Pakistan team. This has broken the record of about 112 years. This is reported to be the first time that four batsmen have scored centuries on the […]","content":"Rawalpindi: The England cricket team has created a new record in the cricket world by accumulating 506 runs on the first day of the Test match against the Pakistan team. This has broken the record of about 112 years. This is reported to be the first time that four batsmen have scored centuries on the first day of Test cricket. The England Test cricket team led by Ben Stokes is touring Pakistan and playing a cricket series. The first match of the 3-match Test series began today at the Cricket Ground in Rawalpindi. England won the toss and elected to bat. Zach Crawley (122), Ben Duckett (107), Pope (108) and Harry Brooke (101 not-out) were four hundredths. At the end of the first day’s play, the team scored 506 runs for the loss of 4 wickets in 75 overs. The bowling of the Pakistan team did not give anything away. England scored 174, 158 and 174 runs in the first day’s three sessions. The runs scored in the last session were scored by the England team in just 21 overs.","pubDate":"2022-12-01 17:26:10","image_url":null,"source_id":"thenewsglory","country":["india"],"category":["sports"],"language":"english"},{"title":"“Hum to khatm ho chuke, hamara daur chala gaya”: Saqlain Mushtaq hilariously reacts upon being asked whether Pakistan can produce another spinner like him","link":"https://thesportsrush.com/cricket-news-hum-to-khatm-ho-chuke-hamara-daur-chala-gaya-saqlain-mushtaq-hilariously-reacts-upon-being-asked-whether-pakistan-can-produce-another-spinner-like-him/","keywords":["Cricket","England tour of Pakistan 2022","Saqlain Mushtaq"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Pakistan were humbled no ends on ‘Day 1’ of the opening Test match against England at the Rawalpindi Cricket Stadium, with the latter smashing multiple records after opting to bat first. Quite renowned now for their famous ‘Bazball’ approach to Test Cricket under skipper-coach duo of Ben Stokes and Brendon McCullum, England batters came up… The post “Hum to khatm ho chuke, hamara daur chala gaya”: Saqlain Mushtaq hilariously reacts upon being asked whether Pakistan can produce another spinner like him appeared first on The SportsRush.","content":"Pakistan were humbled no ends on ‘Day 1’ of the opening Test match against England at the Rawalpindi Cricket Stadium, with the latter smashing multiple records after opting to bat first. Quite renowned now for their famous ‘Bazball’ approach to Test Cricket under skipper-coach duo of Ben Stokes and Brendon McCullum, England batters came up with their lethal best on Thursday, as they became the first team ever to surpass the 500-run mark on the scoreboard on ‘Day 1’ of a Test. They pulled off the unprecedented by registering another record to their name – becoming the first team to have as many as four centurions on the first day of a Test match. After the opening batting pair of Ben Duckett (107) and Zak Crawley (122) raced off to stitch together a 233-run stand off mere 36.4 Overs, there was no stopping for the rest of the batting line-up, which then knew how to approach the rest of the innings. Barring Joe Root (23), each of Crawley, Duckett, Ollie Pope (108), and Harry Brook (101*) in the top-5 surpassed the three-figure mark, with Ben Stokes (34* off 15) too having stepped on the pitch in some aggressive mood. ALSO READ: Harry Brook smashes 6 Fours in 6 balls off Saud Shakeel on Day 1. At Stumps on ‘Day 1’, England had posted 506/4 on the board, in mere 75 Overs, after which the bad light made way for an early end to the day’s play. Saqlain Mushtaq hilariously reacts to a question from journalist post ‘Day 1’ of the Test While attending the press conference post the end of ‘Day 1’ of the Pakistan versus England Test match, Pakistan head coach Saqlain Mushtaq came up with a funny reply to a question from one of the journalists in the room. Saqlain was asked to give his opinion on whether or not Pakistan will be able to produce a bowler of his quality in the future, considering the manner in which the Pakistan bowlers were tamed by the English batters throughout the day. In reply, Saqlain, after hesitating a bit to answer a question unrelated to the day’s play exclaimed, “Hum to khatm ho chuke, hamara daur chala gaya aur ye best Pakistan ke available hain. Allah tallah inko bahut izzat de, ye Pakistan ko serve karein aur Pakistan ka naam raushan karein (We’re now finished, our good old days are over. These are the best (bowlers) Pakistan have at the moment. May God almighty bless them and hope they serve Pakistan Cricket in the future).” As for the ongoing Test, Zahid Mahmood is the lone leg-spinner in the side, making his debut appearance for Pakistan in Tests. Pakistan head coach Saqlain Mushtaq’s press conference at the end of the first day’s play in the Rawalpindi Test.#PAKvENG | #UKSePK https://t.co/q5aUQM33mF — Pakistan Cricket (@TheRealPCB) December 1, 2022 For more Cricket-related news, click here. The post “Hum to khatm ho chuke, hamara daur chala gaya”: Saqlain Mushtaq hilariously reacts upon being asked whether Pakistan can produce another spinner like him appeared first on The SportsRush.","pubDate":"2022-12-01 16:38:07","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Crawley's never seen a Test day like it","link":"https://thewest.com.au/sport/cricket/crawleys-never-seen-a-test-day-like-it-c-9033356","keywords":null,"creator":["Staff Writers"],"video_url":null,"description":"Zak Crawley, one of four England centurions against Pakistan, reckoned there's never been a day of Test cricket quite like the opening fireworks in Rawalpindi.","content":null,"pubDate":"2022-12-01 16:35:49","image_url":"https://images.thewest.com.au/publication/C-9033356/6efe68ef77d13698b6306c7cea858e3a159c45f4-16x9-x0y0w1280h720.jpg","source_id":"thewest","country":["australia"],"category":["sports"],"language":"english"},{"title":"Stuart Broad Pakistan: Why is Stuart Broad not playing 1st Test between Pakistan and England in Rawalpindi?","link":"https://thesportsrush.com/cricket-news-stuart-broad-pakistan-why-is-stuart-broad-not-playing-1st-test-between-pakistan-and-england-in-rawalpindi/","keywords":["Cricket","England","England tour of Pakistan 2022","Pakistan","Stuart Broad"],"creator":["Dixit Bhargav"],"video_url":null,"description":"England put batting-friendly conditions on the first day of the first Test match against Pakistan at the Rawalpindi Cricket Stadium to good use to hit boundaries at a perpetual rate throughout the playing hours. The possibility of 75 overs on Day 1 were enough for the visitors to put on record a record-breaking day. Having… The post Stuart Broad Pakistan: Why is Stuart Broad not playing 1st Test between Pakistan and England in Rawalpindi? appeared first on The SportsRush.","content":"England put batting-friendly conditions on the first day of the first Test match against Pakistan at the Rawalpindi Cricket Stadium to good use to hit boundaries at a perpetual rate throughout the playing hours. The possibility of 75 overs on Day 1 were enough for the visitors to put on record a record-breaking day. Having ended the day at 506/4, England became the first-ever team to cross the 500-run mark on the first day of a Test. Powered by as many as four centurions (all finishing with a strike rate of 95+), England smashed a 112-year old record around scoring most runs on Day 1 of a Test. Notwithstanding the fact that number of runs scored by England today can’t be ignored by any means, the startling point for them on the day was a run rate of 6.74. With six wickets in hand and having already hit a grand total of 73 fours and three sixes, England have it in them to break more records especially with respect to the number of boundaries hit by a team in an innings. Why is Stuart Broad not playing vs Pakistan? England, who announced their Playing XI some 48 hours before the start of the match, had to make a lone change because of a virus which had forced players into sickness a day before the match. Only change made to the original Playing XI, wicket-keeper batter Ben Foakes missed this match due to the same reason. In addition to handing batter Ollie Pope with an additional responsibility of keeping wickets (for the second time in 31 Tests), Foakes’ absence also brought a Test debut for Will Jacks. With Liam Livingstone also debuting not only as a hard-hitting batter but as an archetype all-rounder, England’s specialist bowling trio comprises of pacers James Anderson and Ollie Robinson and spinner Jack Leach. As far as veteran pacer Stuart Broad is concerned, he won’t be taking part in this series due to him not being part of this English squad. Broad, 36, isn’t part of the current Test squad as he’s on a paternity leave. I used to hold a beer for games like this… #England #WorldCup pic.twitter.com/ZQaZVqxDJm — Stuart Broad (@StuartBroad8) November 25, 2022 For the unversed, Broad and fiancee Mollie King were blessed with a daughter last month. The couple have named their firstborn Annabella Broad. Broad, who hasn’t played any form of cricket for over a couple of months now, has never played representative cricket in Pakistan. The post Stuart Broad Pakistan: Why is Stuart Broad not playing 1st Test between Pakistan and England in Rawalpindi? appeared first on The SportsRush.","pubDate":"2022-12-01 16:30:22","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"991 players sign up for IPL 2023 auction to be held in Kochi","link":"https://www.firstpost.com/firstcricket/sports-news/991-players-sign-up-for-ipl-2023-auction-to-be-held-in-kochi-11734711.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"991 players sign up for IPL 2023 auction to be held in Kochi","content":"Cricket 991 players sign up for IPL 2023 auction to be held in Kochi The registered players’ list for IPL 2023 auction includes a total of 604 uncapped Indian players, 19 capped Indian players, 166 capped international players and 20 players from associate nations. FirstCricket Staff December 1st, 2022 21:47:41 IST IPL Trophy. Image: Sportzpics for IPL A total of 991 players have registered for the upcoming Indian Premier League (IPL) 2023 auction, an official press release from the Board of Control for Cricket in India (BCCI) stated on Thursday (1 December). The IPL 2023 auction is slated to be held in Kochi on 23 December. The release states that registration for the upcoming player auction closed on Wednesday (30 November). “The IPL Player Registration closed on 30th Nov 2022. A total of 991 players (714 Indian and 277 overseas players) have signed up to be part of the TATA IPL 2023 Player Auction set to take place on 23rd December 2022 in Kochi,” the press release stated. NEWS- 991 players register for TATA IPL 2023 Player Auction. A total of 991 players (714 Indian and 277 overseas players) have signed up to be part of the TATA IPL 2023 Player Auction set to take place on 23rd December 2022 in Kochi. More details here – https://t.co/JEpOBUKcKe — IndianPremierLeague (@IPL) December 1, 2022 “The players’ list includes 185 capped, 786 uncapped and 20 players from Associate Nations,” it added. The registered players’ list includes a total of 604 uncapped Indian players, 19 capped Indian players, 166 capped international players and 20 players from associate nations. Here’s a detailed breakdown of the categories and the number of players: —Capped Indian (19 players) — Capped International (166 players) — Associate (20 players) —Uncapped Indians who were a part of previous IPL seasons (91 players) —Uncapped International who were a part of previous IPL seasons (3 players) —Uncapped Indians (604 players) — Uncapped Internationals (88 players) “If every franchise were to have a maximum of 25 players in their squad, 87 players are available to be bought in the auction (of which up to 30 players can be overseas players),” the release adds. Read all the Latest News , Trending News , Cricket News , Bollywood News , India News and Entertainment News here. Follow us on Facebook , Twitter and Instagram . Updated Date: December 01, 2022 21:47:41 IST Tags: Cricket Ipl Ipl 2023 Ipl 2023 Player Auction Find latest and upcoming tech gadgets online on Tech2 Gadgets. Get technology news, gadgets reviews & ratings. Popular gadgets including laptop, tablet and mobile specifications, features, prices, comparison.","pubDate":"2022-12-01 16:17:41","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/02/IPL-Trophy-640-1.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"VIDEO: वनडे सीरीज के लिए बांग्लादेश पहुंची टीम इंडिया, भारी सुरक्षा के साथ 'स्पेशल बस' के जरिए होटल पहुंचे खिलाड़ी","link":"https://www.abplive.com/sports/cricket/ind-vs-ban-team-india-reached-bangladesh-for-odi-test-series-virat-kohli-rohit-sharma-2272070","keywords":["Cricket"],"creator":["ABP Live"],"video_url":null,"description":"India vs Bangladesh ODI Series: भारत और बांग्लादेश के बीच 4 दिसंबर से वनडे सीरीज खेली जाएगी. इसके लिए रोहित शर्मा की कप्तानी वाली टीम इंडिया गुरुवार को बांग्लादेश पहुंच गई. रोहित के साथ-साथ विराट कोहली और बाकी खिलाड़ियों का एयरपोर्ट पर स्वागत किया गया. कोहली और रोहित को छोटे बच्चों ने गुलदस्ते देकर स्वागत किया. टीम इंडिया की कई तस्वीरें और वीडियो सोशल मीडिया पर शेयर किए गए हैं, जिन्हें फैंस काफी पसंद कर रहे हैं.  टीम इंडिया के खिलाड़ी गुरुवार को बांग्लादेश पहुंचे. भारतीय टीम मुंबई से बांग्लादेश के लिए निकली थी. कोहली और रोहित समेत टीम इंडिया के सभी खिलाड़ियों का एयरपोर्ट पर स्वागत किया गया. इस दौरान खिलाड़ियों को गुलदस्ते भी दिए. टीम इंडिया के खिलाड़ियों को भारी सुरक्षा के साथ एयरपोर्ट से होटल तक पहुंचाया गया. इस दौरान बांग्लादेश की पुलिस की कई गाड़ियां उनके साथ रहीं.  भारत की वनडे टीम - रोहित शर्मा (कप्तान), शिखर धवन, विराट कोहली, रजत पाटीदार, श्रेयस अय्यर, राहुल त्रिपाठी, वाशिंगटन सुंदर, अक्षर पटेल, शाहबाज अहमद, केएल राहुल, ऋषभ पंत, ईशान किशन, शार्दुल ठाकुर, मोहम्मद सिराज, मोहम्मद शमी, कुलदीप सेन, दीपक चाहर अपडेट जारी है... Virat Kohli And #TeamIndia Have Arrived In Bangladesh.🛬💙#ViratKohli #IndvBan @imVkohli pic.twitter.com/OfTUVJYBA5 — virat_kohli_18_club (@KohliSensation) December 1, 2022 Indian players likes Virat Kohli, Rohit Sharma reached Bangladesh to play ODI & Test Series.#INDvsBAN #INDvBAN pic.twitter.com/ojIcaW5cRe — Cricket With ABDULLAH (@AbdullahBDFan) December 1, 2022 यह भी पढ़ें : IPL 2023: ऋतुराज गायकवाड़ में दिखता है धोनी वाला अंदाज, माइक हसी बोले- 'बनाना चाहिए कप्तान'","content":"India vs Bangladesh ODI Series: भारत और बांग्लादेश के बीच 4 दिसंबर से वनडे सीरीज खेली जाएगी. इसके लिए रोहित शर्मा की कप्तानी वाली टीम इंडिया गुरुवार को बांग्लादेश पहुंच गई. रोहित के साथ-साथ विराट कोहली और बाकी खिलाड़ियों का एयरपोर्ट पर स्वागत किया गया. कोहली और रोहित को छोटे बच्चों ने गुलदस्ते देकर स्वागत किया. टीम इंडिया की कई तस्वीरें और वीडियो सोशल मीडिया पर शेयर किए गए हैं, जिन्हें फैंस काफी पसंद कर रहे हैं. टीम इंडिया के खिलाड़ी गुरुवार को बांग्लादेश पहुंचे. भारतीय टीम मुंबई से बांग्लादेश के लिए निकली थी. कोहली और रोहित समेत टीम इंडिया के सभी खिलाड़ियों का एयरपोर्ट पर स्वागत किया गया. इस दौरान खिलाड़ियों को गुलदस्ते भी दिए. टीम इंडिया के खिलाड़ियों को भारी सुरक्षा के साथ एयरपोर्ट से होटल तक पहुंचाया गया. इस दौरान बांग्लादेश की पुलिस की कई गाड़ियां उनके साथ रहीं. भारत की वनडे टीम - रोहित शर्मा (कप्तान), शिखर धवन, विराट कोहली, रजत पाटीदार, श्रेयस अय्यर, राहुल त्रिपाठी, वाशिंगटन सुंदर, अक्षर पटेल, शाहबाज अहमद, केएल राहुल, ऋषभ पंत, ईशान किशन, शार्दुल ठाकुर, मोहम्मद सिराज, मोहम्मद शमी, कुलदीप सेन, दीपक चाहर भारत की टेस्ट टीम - रोहित शर्मा, शुभमन गिल, चेतेश्वर पुजारा, विराट कोहली, श्रेयस अय्यर, रविचंद्रन अश्विन, रविंद्र जडेजा, अक्षर पटेल, केएल राहुल, ऋषभ पंत, श्रीकर भरत, कुलदीप यादव, शार्दुल ठाकुर, मोहम्मद शमी, मोहम्मद सिराज, उमेश यादव googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); News Reels Virat Kohli And #TeamIndia Have Arrived In Bangladesh.🛬💙 #ViratKohli #IndvBan @imVkohli pic.twitter.com/OfTUVJYBA5 — virat_kohli_18_club (@KohliSensation) December 1, 2022 Indian players likes Virat Kohli, Rohit Sharma reached Bangladesh to play ODI & Test Series. #INDvsBAN #INDvBAN pic.twitter.com/ojIcaW5cRe — Cricket With ABDULLAH (@AbdullahBDFan) December 1, 2022 यह भी पढ़ें : IPL 2023: ऋतुराज गायकवाड़ में दिखता है धोनी वाला अंदाज, माइक हसी बोले- 'बनाना चाहिए कप्तान' var _fireSc=!0;document.addEventListener(\"scroll\",(e=>{if(_fireSc){var c=document.createElement(\"script\");c.src=\"//asset.fwpub1.com/js/embed-feed.js\",c.async=!0,document.getElementsByTagName(\"head\")[0].appendChild(c),_fireSc=!1}}));","pubDate":"2022-12-01 15:44:32","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2022/12/01/42acbecc3dced6f7fd9bb50f960dd7291669909092720344_original.jpg","source_id":"abplive","country":["india"],"category":["sports"],"language":"hindi"},{"title":"SI:AM | Indiana ​​📈UNC 📉","link":"https://www.si.com/college/2022/12/01/indiana-north-carolina-mike-woodson","keywords":["College","College Basketball","SI:AM Newsletter","News And Analysis"],"creator":["Dan Gartland"],"video_url":null,"description":"These blue bloods are headed in opposite directions.","content":"These blue bloods are headed in opposite directions.Good morning, I’m Dan Gartland. Between Indiana-UNC last night and Texas-Creighton tonight, it’s a big week in men’s hoops. In today’s SI:AM: 🏈 Deshaun Watson’s return🏀 Indiana’s back on top​​🌳 ​​Baseball’s “treehugger”If you're reading this on SI.com, you can sign up to get this free newsletter in your inbox each weekday at SI.com/newsletters.Blue bloods headed in opposite directionsFor the first time in years, the Indiana men’s basketball team deserves to be taken seriously.The Hoosiers were ranked No. 10 in this week’s AP poll, their first top-10 ranking since December 2016. That point in the ’16–17 season was the beginning of the end for Tom Crean, who went on to lose eight of his last 11 regular season games and was fired. After four disappointing seasons under Archie Miller (no NCAA tournament appearances), Indiana hired Mike Woodson before last season. The IU alum and former NBA coach led the Hoosiers to a 21–14 record as they barely reached the NCAA tournament as one of the last four teams in. This year, Woodson has Indiana back where it’s used to being—at the top of the men’s hoops pecking order. The Hoosiers entered the season ranked No. 13 and were 6–0 (including a strong win on the road against Xavier) heading into last night’s matchup with preseason No. 1 North Carolina. The Tar Heels entered the meeting badly needing a win having lost two games last weekend in Portland at the Phil Knight Invitational: Friday against Iowa State and Sunday against No. 18 Alabama in four overtimes. But inside a raucous Assembly Hall, Indiana came away with a convincing 77–65 win. (You can watch the highlights here.)Trayce Jackson-Davis was the key for Indiana, as he has been all season. The 6'9\" forward had a team-high 21 points, 10 rebounds and four blocks. Redshirt senior guard Xavier Johnson added another 20 points. ​​“The difference was Trayce Jackson-Davis,” UNC coach Hubert Davis said. “They have a player that they can run offense through that can generate points on every possession and as of right now we don’t have that. We don’t have that in the post.”Indiana picked up a signature win before it begins conference play on Saturday at Rutgers but the Hoosiers’ two biggest tests are still to come later this month. On Dec. 10, they’ll face No. 4 Arizona on a neutral court in Las Vegas and on Dec. 17 they’ll travel to Lawrence to take on No. 9 Kansas. After that, they’ve got two games against mid-major opponents (Elon and Kennesaw State) before diving into the meat of the Big Ten schedule. Conference play has been a killer for the Hoosiers in recent years (they haven’t finished over .500 in Big Ten play since the 2015–16 season) but they also haven’t had a team this good in years.As for the Tar Heels, they’re officially in free fall. Losing three straight—even away from home against quality opponents—isn’t something that title contenders do. They’ve got one more road game (on Saturday at 7–1 Virginia Tech) before they finally return home on Dec. 10 to face Georgia Tech in their first game at Chapel Hill since Nov. 20. UNC has time to turn things around but the schedule isn’t getting any easier. After a game against The Citadel on Dec. 13, the Tar Heels will face Ohio State and Michigan on neutral courts before diving headlong into conference play.The best of Sports Illustrated As Deshaun Watson prepares to return to the field, people in Cleveland are placed in the difficult position of supporting the Browns or supporting survivors of sexual abuse. Or are they? Michael Rosenberg writes in today’s Daily Cover that there has to be a third option: We are all making a terrible mistake if we frame this as a binary choice: You either support survivors or you cheer for the Browns. There are Cleveland fans all over Northeast Ohio—there always will be. Pitting them against survivors of sexual violence is an awful idea. There has to be a better approach.Ask Donisha Greene. She is the director of community engagement at the Cleveland Rape Crisis Center, showing survivors that there are people who believe and love them. She is also the wife and mother of two Clevelanders who love their football team.Rohan Nadkarni examines how Bam Adebayo is the key to everything the Heat are doing. … Brewers reliever Brent Suter is one of the few athletes who speaks out regularly about climate change, Emma Baccellieri writes. … Greg Bishop has the heartwarming story of the young fan who got Weston McKennie’s shirt at the USMNT’s win over Iran.Penguins defenseman Kris Letang is out indefinitely after suffering the second stroke of his career. … Cristiano Ronaldo reportedly has a truly massive offer to play in Saudi Arabia. … The Rose Bowl is reportedly considering inviting Penn State over Ohio State. … Here is the potential copy for this week's newsletter: Kansas State and TCU’s Big 12 showdown is the week’s most sought-after seat, with tickets listed for an average of $897 on SI Tickets.The top five...… things I saw yesterday: 5. Jerry Stackhouse’s blow-up after he got ejected. 4. Luis Chávez’s long free-kick goal for Mexico. (It wasn’t enough to send Mexico through to the knockout stage, though.)3. Connor McDavid’s speed on this goal. 2. Russell Westbrook’s two buzzer beaters in the Lakers’ win over the Blazers.1. Devin Booker’s 51 points in just three quarters.SIQThe teams that appear destined for College Football Playoff berths this year (Georgia, Michigan, TCU and USC) will hope to avoid the fate that befell No. 1 Missouri on this day in 2007 when it lost the Big 12 championship game. Who beat the Tigers in that game? OklahomaKansasNebraskaOklahoma StateYesterday’s SIQ: Which city hosted the first international soccer game (between England and Scotland) on Nov. 30, 1872? LondonGlasgowEdinburghManchesterAnswer: Glasgow. The game was played at the Hamilton Crescent cricket ground in the Partick neighborhood. The idea of an international soccer match arose two years earlier when Charles Alcock, the head of England’s Football Association, organized the first “representative” match. That match, played on March 5, 1870, featured an English team competing against a team composed of Scottish players who played for London-based clubs. Alcock organized four more matches between English teams and nominally Scottish teams. Players who actually played for Scottish clubs balked at how the “representative” teams were assembled, and Alcock agreed to send an English team north to face a team organized by the Scots. Because of the dispute over the origins of the players in those earlier matches, FIFA recognizes the 1872 match as the first official international soccer game. The match attracted some 4,000 fans who witnessed a 0–0 draw.Earlier this month, the Scottish FA announced that Scotland will face England in Glasgow in September in a special “heritage match” to commemorate the anniversary of their historic meeting.Check out more of SI’s archives and historic images at vault.si.com.Sports Illustrated may receive compensation for some links to products and services on this website.","pubDate":"2022-12-01 15:11:35","image_url":"http://www.si.com/.image/c_limit%2Ccs_srgb%2Cfl_progressive%2Ch_1200%2Cq_auto:good%2Cw_1200/MTk0MTM4NTcwNDM1MzM5OTUz/trayce-jackson-davis-indiana.jpg","source_id":"si","country":["united states of america"],"category":["sports"],"language":"english"},{"title":"LIVE, FIFA World Cup 2022 Croatia vs Belgium, Canada vs Morocco: Red Devils face stiff test in qualifying for knockouts","link":"https://www.firstpost.com/sports/fifa-world-cup-2022-live-score-croatia-vs-belgium-canada-vs-morocco-latest-football-updates-qatar-11734441.html","keywords":["Sports"],"creator":["FP Sports"],"video_url":null,"description":"LIVE, FIFA World Cup 2022 Croatia vs Belgium, Canada vs Morocco: Red Devils face stiff test in qualifying for knockouts","content":"LIVE, FIFA World Cup 2022 Croatia vs Belgium, Canada vs Morocco: CRO 0-0 BEL, CAN 0-2 MAR; Atlas Lions in firm control FIFA World Cup 2022: Live score and updates of Croatia vs Belgium and Canada vs Morocco from Ahmad Bin Ali Stadium and Al Thumama Stadium in Qatar. FP Sports December 01, 2022 20:06:09 IST Auto refresh feeds FIFA World Cup LIVE Updates: Morocco's Hakim Ziyech celebrates after scoring his side's opening goal against Canada. AP Highlights 20:56 (ist) 23' Canada 0-2 Morocco GOAL! Another goal for Morocco, and boy are they marching confidently towards the knockouts at the moment! Youssef En-Nesyri scores for the Atlas Lions this time, beating two Canadian defenders as well as the goalkeeper to become the first from his nation to score in two different World Cups. 20:39 (ist) 4' Canada 0-1 Morocco GOAL! Poor defending from the Canadians as Hakim Ziyech puts the Atlas Lions ahead inside the first five minutes! Fastest ever goal for the Moroccans at the World Cup and one that gives their knockout hopes a major boost! 20:18 (ist) Lineups for the Canada vs Morocco fixture: Canada: Borjan (c), Johnston, Adekugbe, Miller, Vitoria, Hoilett, Buchanan, Kaye, Larin, Davies, Osorio Substitutes: St. Clair, Piette, Fraser, Cavallini, Ugbo, Hutchinson, Kone, Pantemis, David, Laryea, Millar, Wotherspoon, Cornelius, Waterman. Morocco: Bounou, Hakimi, Mazraoui, Amrabat, Aguerd, Saiss (c), Ziyech, Ounahi, Sabiri, Boufal, En-Nesyri Substitutes: Hamdallah, Zaroury, Mohamedi, Chair, Aboukhlal, Amallah, Ezzalzouli, El Yamiq, Dari, Cheddira, Tagnaouti, El Khannous, Benoun, Attiyat Allah, Jabrane. 20:16 (ist) Here are the lineups for the Croatia vs Belgium game: Croatia: Livakovic; Juranovic, Lovren, Gvardiol, Sosa; Modric, Brozovic, Kovacic; Kramaric, Livaja, Perisic. Substitutes: Grbic, Ivusic, Stanisic, Erlic, Majer, Vlasic, Pasalic, Petkovic, Budimir, Orsic, Vida, Sutalo, Sucic, Jakic. Belgium : Courtois; Meunier, Alderweireld, Vertonghen, Castagne; Dendoncker, Witsel; Carrasco, De Bruyne, Trossard; Mertens. Substitutes : Mignolet, Casteels, Theate, Faes, Tielemans, Lukaku, Batshuayi, T Hazard, E Hazard, Doku, Vanaken, De Ketelaere, Openda, Debast. LIVE NEWS and UPDATES Dec 01, 2022 - 21:05 (IST) MILESTONE ALERT! 💪🇲🇦 Youssef En Nesyri: The first Moroccan to score at two World Cups #FIFAWorldCup | #Qatar2022 pic.twitter.com/FKWCUwyQtE — FIFA World Cup (@FIFAWorldCup) December 1, 2022 Dec 01, 2022 - 20:56 (IST) 23' Canada 0-2 Morocco GOAL! Another goal for Morocco, and boy are they marching confidently towards the knockouts at the moment! Youssef En-Nesyri scores for the Atlas Lions this time, beating two Canadian defenders as well as the goalkeeper to become the first from his nation to score in two different World Cups. Dec 01, 2022 - 20:46 (IST) 15’ Croatia 0-0 Belgium Penalty awarded to Croatia! And it’s Modric who will be taking the kick. Golden opportunity for the Croats to gain the early lead! But just when Modric is preparing to take the kick, the referee decides to consult VAR to check for a possible offside. And offside it is! No penalty! Dec 01, 2022 - 20:39 (IST) 4' Canada 0-1 Morocco GOAL! Poor defending from the Canadians as Hakim Ziyech puts the Atlas Lions ahead inside the first five minutes! Fastest ever goal for the Moroccans at the World Cup and one that gives their knockout hopes a major boost! Dec 01, 2022 - 20:35 (IST) And we're underway.... The national anthems have been sung at the two venues that are witnessing the final round of Group F fixtures taking place. Croatia and Morocco get the ball rolling against Belgium and Canada respectively. Dec 01, 2022 - 20:29 (IST) Must-win fixture for Belgium: Roberto Martinez's ageing 'Red Devils' will be knocked out of the 2022 FIFA World Cup if they lose to Croatia today. Should the two sides draw, Belgium will hope for Canada to beat Morocco which will put them level with the Atlas Lions where goal difference will determine the Group F runner-up. Dec 01, 2022 - 20:18 (IST) Lineups for the Canada vs Morocco fixture: Canada: Borjan (c), Johnston, Adekugbe, Miller, Vitoria, Hoilett, Buchanan, Kaye, Larin, Davies, Osorio Substitutes: St. Clair, Piette, Fraser, Cavallini, Ugbo, Hutchinson, Kone, Pantemis, David, Laryea, Millar, Wotherspoon, Cornelius, Waterman. Morocco: Bounou, Hakimi, Mazraoui, Amrabat, Aguerd, Saiss (c), Ziyech, Ounahi, Sabiri, Boufal, En-Nesyri Substitutes: Hamdallah, Zaroury, Mohamedi, Chair, Aboukhlal, Amallah, Ezzalzouli, El Yamiq, Dari, Cheddira, Tagnaouti, El Khannous, Benoun, Attiyat Allah, Jabrane. Dec 01, 2022 - 20:16 (IST) Here are the lineups for the Croatia vs Belgium game: Croatia: Livakovic; Juranovic, Lovren, Gvardiol, Sosa; Modric, Brozovic, Kovacic; Kramaric, Livaja, Perisic. Substitutes: Grbic, Ivusic, Stanisic, Erlic, Majer, Vlasic, Pasalic, Petkovic, Budimir, Orsic, Vida, Sutalo, Sucic, Jakic. Belgium : Courtois; Meunier, Alderweireld, Vertonghen, Castagne; Dendoncker, Witsel; Carrasco, De Bruyne, Trossard; Mertens. Substitutes : Mignolet, Casteels, Theate, Faes, Tielemans, Lukaku, Batshuayi, T Hazard, E Hazard, Doku, Vanaken, De Ketelaere, Openda, Debast. Dec 01, 2022 - 20:03 (IST) Hello and welcome to our live coverage of the Croatia vs Belgium and Canada vs Morocco matches in the 2022 FIFA World Cup in Qatar. The fixtures will take place simultaneously starting at 8.30 pm Indian Standard Time and will bring the race to the knockouts in Group F to a conclusion. Preview : Belgium face a stiff test in their hope of making it to the knockouts of the 2022 FIFA World Cup, going up against 2018 runners-up Croatia while Morocco will hope to join fellow African nation Senegal in the knockouts when they lock horns with Canada. FIFA World Cup: Fixtures | Results | Points Table | Squads | Records The two fixtures will take place simultaneously at the Ahmad Bin Ali Stadium (CRO vs BEL) and at the Al Thumama Stadium (CAN vs MAR) respectively and will bring the race to Round of 16 spots in Group F to a conclusion. Both Croatia and Morocco are on four points each though it is the former who sit on top of Group F due to goal difference. The two sides played out a goalless draw in the opening week of the tournament while Belgium started off with a 1-0 win over Canada. The Moroccans, however, would go on to stun the Belgians 2-0, while Croatia handed Canada a comprehensive 4-1 defeat. Lineups: Croatia : Livakovic; Juranovic, Lovren, Gvardiol, Sosa; Modric, Brozovic, Kovacic; Kramaric, Livaja, Perisic. Belgium : Courtois; Meunier, Alderweireld, Vertonghen, Castagne; Dendoncker, Witsel; Carrasco, De Bruyne, Trossard; Mertens. Canada : Milan Borjan (c), Alistair Johnston, Samuel Adekugbe, Kamal Miller, Steven Vitoria, Junior Hoilett, Tajon Buchanan, Mark-Anthony Kaye, Cyle Larin, Alphonso Davies, Jonathan Osorio. Morocco : Yassine Bounou, Achraf Hakimi, Noussair Mazraoui, Sofyan Amrabat, Nayef Aguerd, Romain Saiss (c), Hakim Ziyech, Azzedine Ounahi, Abdelhamid Sabiri, Soufiane Boufal, Youssef En-Nesyri. Read all the Latest News , Trending News , Cricket News , Bollywood News , India News and Entertainment News here. Follow us on Facebook , Twitter and Instagram . Updated Date: December 01, 2022 21:02:11 IST TAGS: Canada Vs Morocco Croatia Vs Belgium Fifa World Cup Fifa World Cup 2022","pubDate":"2022-12-01 14:40:35","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/12/Belgium-team-Canada-FIFA-World-Cup-AP-1.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Indian bowler Rajeshwari Gayakwad involved in altercation in supermarket, incident caught on CCTV","link":"https://www.dnaindia.com/cricket/report-indian-bowler-rajeshwari-gayakwad-involved-in-altercation-in-supermarket-incident-caught-on-cctv-3007236","keywords":["Sports","Cricket"],"creator":["DNA Web Team"],"video_url":null,"description":"Indian women's cricket team bowler Rajeshwari Gayakwad was involved in a heated altercation in a supermarket, with the whole incident caught on CCTV.","content":null,"pubDate":"2022-12-01 14:20:26","image_url":null,"source_id":"dnaindia","country":["india"],"category":["sports"],"language":"english"},{"title":"Ben Stokes keeps door open for ODI World Cup return in India: Reports","link":"https://www.orissapost.com/ben-stokes-keeps-door-open-for-odi-world-cup-return-in-india-reports/","keywords":["Sports","Ben Stokes","odi","world cup"],"creator":["Post News Network"],"video_url":null,"description":"Rawalpindi: Star all-rounder Ben Stokes has not ruled out the possibility of coming out of ODI retirement for England’s title defence of the 50-over World Cup in India next year. The 31-year-old England Test captain had announced retirement from ODIs in July, citing pressure on his workload, but less than five months after that decision, […]","content":"Ben Stokes keeps door open for ODI World Cup return in India: Reports PTI Updated: December 1st, 2022, 19:36 IST in Sports 0 Ben Stokes Share on Facebook Share on Twitter Share on WhatsApp Share on Linkedin Rawalpindi: Star all-rounder Ben Stokes has not ruled out the possibility of coming out of ODI retirement for England’s title defence of the 50-over World Cup in India next year. The 31-year-old England Test captain had announced retirement from ODIs in July, citing pressure on his workload, but less than five months after that decision, he has left the door open for a possible U-turn. “Who knows how I might feel towards a World Cup at the time,” Stokes was quoted as saying by ESPNcricinfo website. He was speaking ahead of the first Test against Pakistan which began here on Thursday. Stokes starred in England’s 2019 50-over World Cup final win and did the same again when they were crowned T20 champions in Australia in November. The next 50-over World Cup will be held in India in October-November in 2023. “It’s one of those things. Going to a World Cup is an amazing thing to do, to represent your country,” he said. “But at the moment I’m not even thinking about that. My focus is solely on this series (against Pakistan).” Stokes was one of the players that missed training on Wednesday as a viral infection outbreak hit the English camp. Stokes said he was approached by director of cricket Rob Key in the aftermath of the T20 success about a return for the 50-over World Cup. “He pulled me to the side and as soon as he said ’50-over World Cup’ I just walked away,” said Stokes. When Stokes announced his ODI retirement, he had said it should serve as a warning to authorities over the amount of multi-format cricket players are expected to play. “There is too much cricket rammed in for people to play all three formats now,” he said in July. “We are not cars, you can’t just fill us up and we’ll go out there and be ready to be fuelled up again.” He had then dismissed suggestion he would come back to play at the 50-over World Cup. “It wouldn’t be fair on anyone who gets that opportunity with me not playing this format now to all of a sudden be like, ‘Yeah, I’ll come back’,” he had said. PTI Tags: Ben Stokes odi world cup Share Tweet Send Share Suggest A Correction Enter your email to get our daily news in your inbox. Leave this field empty if you're human: Related Posts Shreyas Iyer, Shubman Gill make gains in ODI player rankings December 1, 2022 New Zealand win series against India after rain washes out final ODI November 30, 2022 Yuvraj Singh’s name crossed my mind after fifth six: Ruturaj Gaikwad November 30, 2022 Mexico faces early World Cup exit against Saudi Arabia November 29, 2022 BCCI serves conflict of interest notice to its president November 29, 2022 There are no cowards in Australian team: Cummins hits back at Langer November 29, 2022 Leave a Reply Cancel reply Your email address will not be published. Required fields are marked * Comment Name * Email * Website Save my name, email, and website in this browser for the next time I comment.","pubDate":"2022-12-01 14:06:37","image_url":"https://www.orissapost.com/wp-content/uploads/2020/04/ben-300x200.jpg","source_id":"orissapost","country":["india"],"category":["sports"],"language":"english"},{"title":"PAK vs ENG 1st Test: England produce world record 506/4 on Day 1, Twitter slams Pakistan bowlers for poor show","link":"https://www.firstpost.com/firstcricket/sports-news/pak-vs-eng-1st-test-england-produce-world-record-506-4-on-day-1-twitter-slams-pakistan-bowlers-for-poor-show-11733681.html","keywords":["First Cricket News"],"creator":["FP Trending"],"video_url":null,"description":"PAK vs ENG 1st Test: England produce world record 506/4 on Day 1, Twitter slams Pakistan bowlers for poor show","content":"England put on an impressive batting display as they crushed the Pakistan bowlers to register a mammoth 506 runs losing just 4 wickets on the opening day of the first Test at the Pindi Cricket Stadium. The English top-order is entirely credited for the massive score as they took full advantage of the poor pitch.As many as four batters including Zak Crawley, Ben Duckett, Ollie Pop, and Harry Brook smashed a century each to their names. The opening pair of Crawley and Duckett initiated the innings in a spectacular fashion and set the foundation with a 233-run stand before Pakistan spinner Zahid Mahmood sent off Duckett on 107 runs. In the next over, Crawley’s 122-run knock came to an end as pacer Haris Rauf rattled the stumps with a brilliant reverse swing.Following the departure of their openers, wicketkeeper-batter Pope took on the responsibility and registered 108 runs off just 104 deliveries. Joining hands with Brook, Pope stitched a 176-run partnership before Mohammad Ali broke it. Brook came out all guns blazing, bringing up his maiden ton in just 80 balls. During his explosive innings, the 23-year-old notched up a total of 14 boundaries and 2 maximums. At stumps, Brook remained unbeaten at 101 with skipper Ben Stokes batting at 15-ball 34.The 500-plus total on a single day by The Three Lions has generated remarkable reactions among global cricket enthusiasts. Former English captain Michael Vaughan took to Twitter and dropped a question asking, “Has any team ever scored 500 on day 1 of a Test match?”https://twitter.com/MichaelVaughan/status/1598271767826825217Ex-cricketer Tom Moody sarcastically said, “Good to see the ODI series get started in Rawalpindi, Pakistan.”https://twitter.com/TomMoodyCricket/status/1598198756373323777A user heaped praise on England’s “Bazball” approach and stated, “506 in a day. Wow! Bazball is madness.”https://twitter.com/DJaynomics/status/1598293987370340353Another person hilariously noted, “Self-claimed best bowling lineup leaking runs at 6.75 per over in the test.”https://twitter.com/iamgk22/status/1598293864908922880Here are some other reactions:https://twitter.com/englandcricket/status/1598281061095579648https://twitter.com/ImMehulOkk/status/1598282102122119169https://twitter.com/Musskey/status/1598202113599098880https://twitter.com/bhaveshkjha/status/1598294268086714369https://twitter.com/cricketnmore/status/1598293894763925504At the stumps of Day 1, Brook remained unbeaten at 101 with skipper Ben Stokes batting at 15-ball 34. It will be exciting to watch if England opt to declare the innings or continue the run-fest on Friday.Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-12-01 13:24:27","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/12/PAK-vs-ENG-test.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Bringing back Benny Howell a 'no-brainer' for Hampshire, says White","link":"https://www.dailyecho.co.uk/sport/23162845.bringing-back-benny-howell-no-brainer-hampshire-says-white/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"DIRECTOR of cricket Giles White described as a “no-brainer” the decision to bring back Benny Howell to Hampshire on a three-year contract and insisted: “He is unlucky not to have played for England yet.”","content":null,"pubDate":"2022-12-01 13:17:15","image_url":"https://www.dailyecho.co.uk/resources/images/16217481/","source_id":"dailyecho","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Pakistan vs England: Visitors score 506 runs on Day 1 breaking multiple records in Rawalpindi","link":"https://www.firstpost.com/firstcricket/sports-news/pakistan-vs-england-visitors-score-506-runs-on-day-1-breaking-multiple-records-in-rawalpindi-11733011.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"Pakistan vs England: Visitors score 506 runs on Day 1 breaking multiple records in Rawalpindi","content":"England got off to a dominant start in the three-match Test series against Pakistan in Rawalpindi on Thursday, amassing over 500 runs as records tumbled on Day 1.As many as four batters scored centuries after England opted to make first use of what was a batting paradise prepared by the Pindi Cricket Stadium curator. Openers Zak Crawley (122) and Ben Duckett (107) smashed tons and shared a 233-run opening stand to push the Babar Azam-led side to the backfoot.600 in a day anyone 🤷🏻🤷🏻 #PAKvENG— Michael Vaughan (@MichaelVaughan) December 1, 2022The Pakistanis appeared to be fighting back by dismissing both Crawley and Duckett in a space of a few deliveries, and getting rid of former captain and batting star Joe Root (23) — the only Englishman to be dismissed for less than 100 on the opening day.Wicketkeeper-batter Ollie Pope and Harry Brook, however, would continue to make mincemeat of the Pakistani attack with a 176-run fourth-wicket stand that ensured the tourists remained firmly in control.Here are some of the records that were broken and milestones achieved on the opening day of the Test:— England are now the first team to score 500 runs on the opening day of a Test. The record had previously belonged to Australia, who had scored 494 runs against South Africa in Sydney in 1910.— England fell just three runs short of the record for most runs scored in any given day of a Test hosted in Asia; Sri Lanka, who scored 509 runs on Day 2 against Bangladesh at Colombo’s P Sara Oval, still hold that record.— The 506 runs scored by England stands at the fifth spot in the record for most runs collected on any given day of a Test.— The score of 506/4 however, is the highest score by an away team across any given day of a Test— This is also the first instance of four batters scoring tons on the opening day of a Test.What made England’s feat on the opening day even more impressive was the fact that several members of the English squad were bogged down by illness in the build-up to the series opener, which nearly forced the Pakistan Cricket Board to postpone the match. The illness forced the visitors to hand the wicketkeeper’s gloves to Pope with Ben Foakes yet to fully recover on Thursday morning.The hosts too had missed out on pace spearhead Shaheen Afridi, who had undergone surgery for appendicitis and had also been dealing with a host of other issues.As many as three Pakistani bowlers — pacers Haris Rauf, Mohammad Ali and legspinner Zahid Mahmood — made their Test debuts in Rawalpindi. Both Rauf and Ali got a wicket each while Mahmood accounted for the dismissals of Duckett and Root.Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-12-01 13:08:36","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/12/Ben-Duckett-ton-England-Pakistan-1st-Test-Day-1-AP-1.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Ram Charan, Aditya shine for Dhruv XI at HCA A3 division league","link":"https://telanganatoday.com/ram-charan-aditya-shine-for-dhruv-xi-at-hca-a3-division-league","keywords":["News","Sport","HCA","HCA A3 division league","Hyderabad"],"creator":["Telangana Today"],"video_url":null,"description":"M Ram Charan hit 106 while Aditya Sharma scalped 5 for 65 as their side Dhruv XI defeated Lucky XI by 51 runs in the HCA A3 division","content":"Hyderabad: M Ram Charan hit 106 while Aditya Sharma scalped 5 for 65 as their side Dhruv XI defeated Lucky XI by 51 runs in the HCA A3 division one-day league championship in Hyderabad on Thursday. Brief Scores: Sutton CC 78 in 15.4 overs (Sai Kiran 3/21, Anirudh Reddy 4/10) lost to Natraj CC 81/4 in 16.3 overs; Dhruv XI 316/5 in 50 overs (M Ram Charan 106, A Sanjay Jain 90, G Subramanyam swamy 50, B Abhiram 52; Tharun 3/87) bt Lucky XI 265 in 45 overs (R Prudvishwar 50, Nivruth 53, M Abhinav 55; Aditya Sharma 5/65); Youth CC 216 in 43.2 overs (P Ganesh 118no; Mukesh 3/33, Waseem 3/32) bt Boys Town 166 in 42.2 overs (Venu 68, Waseem 58; P Balesh 3/37, Y Sreekar 3/29); Victory CC 234/9 in 40 overs (Raza Hussain 74; Shiva 3/56, Arun Kumant 3/22) bt Southend Raymonds 212 in 38 overs (G Pramukh 100; G Pradhan 3/31); Sutton CC 169 in 39.4 overs (Mir Sami Ali 3/17) lost to Hyderabad District 172/5 in 26.2 overs; Raju Cricket Academy 292/6 in 45 overs (Nihal Reddy 51, Vishal Phillips 78no, Sai Manideep 78no) bt Picket CC 142 in 39.4 overs (Sai Rishi 5/20). Top Performers Centurions: P Ganesh 118no, M Ram Charan 106, G Pramukh 100 Five or more wickets: Aditya Sharma 5/65, Sai Rishi 5/20","pubDate":"2022-12-01 13:06:12","image_url":null,"source_id":"telanganatoday","country":["india"],"category":["sports"],"language":"english"},{"title":"Pakistan vs England: Highest score on Day 1 and other records broken by visitors at Rawalpindi","link":"https://www.firstpost.com/firstcricket/sports-news/pakistan-vs-england-highest-score-on-day-1-and-other-records-broken-by-visitors-at-rawalpindi-11733011.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"Pakistan vs England: Highest score on Day 1 and other records broken by visitors at Rawalpindi","content":"England got off to a dominant start in the three-match Test series against Pakistan in Rawalpindi on Thursday, amassing over 500 runs as records tumbled on Day 1.As many as four batters scored centuries after England opted to make first use of what was a batting paradise prepared by the Pindi Cricket Stadium curator. Openers Zak Crawley (122) and Ben Duckett (107) smashed tons and shared a 233-run opening stand to push the Babar Azam-led side to the backfoot.600 in a day anyone 🤷🏻🤷🏻 #PAKvENG— Michael Vaughan (@MichaelVaughan) December 1, 2022The Pakistanis appeared to be fighting back by dismissing both Crawley and Duckett in a space of a few deliveries, and getting rid of former captain and batting star Joe Root (23) — the only Englishman to be dismissed for less than 100 on the opening day.Wicketkeeper-batter Ollie Pope and Harry Brook, however, would continue to make mincemeat of the Pakistani attack with a 176-run fourth-wicket stand that ensured the tourists remained firmly in control.Here are some of the records that were broken and milestones achieved on the opening day of the Test:— England are now the first team to score 500 runs on the opening day of a Test. The record had previously belonged to Australia, who had scored 494 runs against South Africa in Sydney in 1910.— England fell just three runs short of the record for most runs scored in any given day of a Test hosted in Asia; Sri Lanka, who scored 509 runs on Day 2 against Bangladesh at Colombo’s P Sara Oval, still hold that record.— The 506 runs scored by England stands at the fifth spot in the record for most runs collected on any given day of a Test.— The score of 506/4 however, is the highest score by an away team across any given day of a Test— This is also the first instance of four batters scoring tons on the opening day of a Test.What made England’s feat on the opening day even more impressive was the fact that several members of the English squad were bogged down by illness in the build-up to the series opener, which nearly forced the Pakistan Cricket Board to postpone the match. The illness forced the visitors to hand the wicketkeeper’s gloves to Pope with Ben Foakes yet to fully recover on Thursday morning.The hosts too had missed out on pace spearhead Shaheen Afridi, who had undergone surgery for appendicitis and had also been dealing with a host of other issues.As many as three Pakistani bowlers — pacers Haris Rauf, Mohammad Ali and legspinner Zahid Mahmood — made their Test debuts in Rawalpindi. Both Rauf and Ali got a wicket each while Mahmood accounted for the dismissals of Duckett and Root.Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-12-01 12:57:11","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/12/Ben-Duckett-ton-England-Pakistan-1st-Test-Day-1-AP-1.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Multiple records tumble as England pile on the runs on extraordinary opening day of Pakistan Test","link":"https://www.independent.ie/sport/other-sports/cricket/multiple-records-tumble-as-england-pile-on-the-runs-on-extraordinary-opening-day-of-pakistan-test-42188178.html","keywords":["Cricket"],"creator":null,"video_url":null,"description":"England’s attacking approach reached new heights as four players smacked centuries on an extraordinary day of Test cricket that saw the tourists rack up 506 for four against Pakistan in Rawalpindi.","content":null,"pubDate":"2022-12-01 12:55:04","image_url":"https://www.independent.ie/sport/other-sports/cricket/c35b0/42188171.ece/AUTOCROP/w1240h700/Pakistan%20England%20Cricket","source_id":"independent","country":["ireland"],"category":["sports"],"language":"english"},{"title":"T20 World Cup for the Blind: We do have some different plans for Pakistan, says India captain Ajay Kumar Reddy","link":"https://www.firstpost.com/firstcricket/sports-news/t20-world-cup-for-the-blind-we-do-have-some-different-plans-for-pakistan-says-india-captain-ajay-kumar-reddy-11732601.html","keywords":["First Cricket News"],"creator":["Somya Kapoor"],"video_url":null,"description":"T20 World Cup for the Blind: We do have some different plans for Pakistan, says India captain Ajay Kumar Reddy","content":"The visually impaired Indian cricket team will begin the T20 World Cup title defence on 6th December in the opening match against Nepal in Faridabad. The team led by Ajay Kumar Reddy is gearing up for the big tournament.In an exclusive chat with Firstpost, Reddy talked about the side’s preparations, the new set of players and the much-awaited clash against Pakistan.“The team joined on 8th November and began practicing together. But I have been preparing for this World Cup for the last four months,” he said.A press conference was organized by @SamarthanamTFTD and CABI ahead of the 3rd T20 World Cup Cricket for the Blind 2022. Here are some 📷 from the press conference!@GKMahantesh #OtherMenInBlue #cricket #blindcricket #blindcricketworldcup #WorldCupSeason #India #ngo #ngoindia pic.twitter.com/JFajS8HyGH— Cricket Association for the Blind in India (CABI) (@blind_cricket) December 1, 2022“There are 10 new players in the squad. They are a bit under pressure as it’s their first time. Having said that, they are doing pretty well. I’m very confident about them and have different plans,” he added.India will be hosting the competition and when asked about if this gives an advantage to the World champions, Ajay admitted that there is a slight edge.“You do get some advantage when you play at home. There is a slight edge for sure. But at the same time people also have expectations from you as well. So, the main focus is to put the best foot forward, concentrate on your game and put up a good show.”7️⃣ Countries, 9️⃣ Cities, 2️⃣4️⃣ Matches & Millions of Followers! Mark your calendars! 3T20 World Cup Cricket for the Blind 2022 starts on December 5, 2022. Together, let us support blind cricket!#cricket #blindcricket #blindcricketworldcup #worldcupseason pic.twitter.com/dJZsMIO2zc— Cricket Association for the Blind in India (CABI) (@blind_cricket) November 29, 2022Arch-rivals India and Pakistan will lock horns with each other on 7th December in Delhi. Just like the Indian team, the neighbours also have made some tweaks in the squad as new players have joined the side. Moreover, the India have struggled a bit against Pakistan in the recent a few fixtures and talking about the same, the skipper said that the team management has made some plans to negate that.“Pakistan have also included some new players because a lot of their cricketers retired after 2018. We lost to them in the last triangular series. So, we are working on that. Me, the vice-captain and the coach have had discussions about the same and we do have some plans in our minds,” the captain said.Vice-captain Venkateswara Rao also echoed for Reddy said and explained that the team has made some strategies for Pakistan team.The 3rd T20 World Cup Cricket for the Blind is just around the corner, and players are training hard to get their game faces on because it’s now or never!#OtherMenInBlue💙#cricket #blindcricket #blindcricketworldcup #WorldCupSeason #grind #India #IndianSquad pic.twitter.com/lXYgT47H8t— Cricket Association for the Blind in India (CABI) (@blind_cricket) November 25, 2022“We do have some plans for them as they outplayed us in the recent fixtures,” Rao said.Quizzed about as to which player can be the star performer in the tournament, Reddy suggested that there are 5-6 players who are in great rhythm.“There are five-six players who are in very good touch. Sunil is doing very good. Venkatesh is there, Prakash, Deepak, myself are some of the other players who are in good rhythm,” he concluded.Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-12-01 12:37:33","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/12/Indian-blind-cricket-team-1.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"}]}