{"newsArray":[{"title":"India vs New Zealand LIVE score 2nd ODI: IND look to level series against NZ","link":"https://www.firstpost.com/firstcricket/sports-news/india-vs-new-zealand-2nd-odi-ind-vs-nz-live-score-cricket-match-latest-updates-hamilton-rain-weather-11703431.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"India vs New Zealand LIVE score 2nd ODI: IND look to level series against NZ","content":"05:43 (IST)Hello from Hamilton 👋📍#TeamIndia | #NZvIND pic.twitter.com/AHskNav1Vm— BCCI (@BCCI) November 26, 202223:41 (IST)Hello and welcome to our live coverage of the second one-day international between New Zealand and India at Hamilton's Seddon Park. The Men in Blue will be hoping to bounce back from the seven-wicket loss at Eden Park in order to keep their hopes of winning both trophies in the ongoing tour alive.Preview: Team India will be hoping to bounce back from the one-sided defeat in Auckland and keep the three-match series alive when they take on New Zealand in the second ODI in Hamilton on Sunday.India suffered their first defeat of the tour of New Zealand, which is taking place right after the T20 World Cup, after winning the T20I series as the failed to defend a target of 307, thanks to the brilliance of Tom Latham and Black Caps skipper Kane Williamson.Latham struck a career-best 145 not out, sharing an unconquered fourth-wicket stand worth 221 as the pair rescued the hosts from a spot of bother and took the momentum away from the Men in Blue, ensuring they got home comfortably in the end.Earlier, stand-in skipper Shikhar Dhawan and Shubman Gill shared an opening stand worth 124 while scoring 72 and 50 respectively while Shreyas Iyer took over once the set pair departed and stayed at the crease till the final over, top-scoring with a 76-ball 80.The series opener also witnessed Umran Malik make his ODI debut. The Jammu and Kashmir pacer not only hit express speeds of 153kmph, but also opened his account with the ball, dismissing both Devon Conway and Daryl Mitchell.Squads:New Zealand: Finn Allen, Devon Conway, Kane Williamson(c), Daryl Mitchell, Tom Latham(w), Glenn Phillips, Mitchell Santner, Adam Milne, Matt Henry, Tim Southee, Lockie Ferguson, Michael Bracewell, James NeeshamIndia: Shikhar Dhawan(c), Shubman Gill, Shreyas Iyer, Rishabh Pant(w), Suryakumar Yadav, Sanju Samson, Washington Sundar, Shardul Thakur, Umran Malik, Arshdeep Singh, Yuzvendra Chahal, Deepak Hooda, Kuldeep Yadav, Deepak ChaharRead all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-11-27 00:24:12","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/11/Kane-Williamson-Shikhar-Dhawan-ODI-trophy-Twitter-1.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Tubby's message to Langer","link":"https://www.watoday.com.au/sport/cricket/tubbys-message-to-langer-20221127-p5c1la.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":null,"video_url":null,"description":"Former Australia captain Mark Taylor wants to see \"more positivity\" around cricket in the country.","content":null,"pubDate":"2022-11-26 23:18:55","image_url":null,"source_id":"watoday","country":["australia"],"category":["sports"],"language":"english"},{"title":"T10 League plans expansion to five locations after thumbs up from two ICC full members","link":"https://kashmirreader.com/2022/11/27/t10-league-plans-expansion-to-five-locations-after-thumbs-up-from-two-icc-full-members/","keywords":["SPORTS"],"creator":["Press Trust of India"],"video_url":null,"description":"ABU DHABI: The organisers of the six-year old Abu Dhabi T10 League are planning to expand their reach to five different locations around the world. Rajeev Khanna , an IPL veteran who has worked extensively with Rajasthan Royals and Punjab Kings, is overseeing the league’s expansion plans having joined T Ten Sports Management as the […]","content":"ABU DHABI: The organisers of the six-year old Abu Dhabi T10 League are planning to expand their reach to five different locations around the world. Rajeev Khanna , an IPL veteran who has worked extensively with Rajasthan Royals and Punjab Kings, is overseeing the league’s expansion plans having joined T Ten Sports Management as the Chief Operating Officer earlier this year. In partnership with Sri Lanka Cricket (SLC), the first edition of the T10 League in the island nation has already been announced and will be held in June. The organisers are confident of staging one in Zimbabwe in March and two more in Europe and North America in the near future. “The biggest thumbs up we have got is the first ever sanction from ICC full member SLC. They have approved the league and will be part of the league. We are also in talks with Zimbabwe and closing on that (deal),” Khanna told PTI on Saturday. “When full members of ICC are endorsing this league, it shows it has meat in it. In times to come, I am sure other boards, including the BCCI, will consider it too. “We are planning one in Europe as well, either Scotland or the Netherlands and the fifth one in North America,” he said. The competition has been approved by the International Cricket Council (ICC), though the world body has not recognised T10 as a format yet. The ICC, however, has sent its anti-corruption unit to Abu Dhabi for the event. There is definite interest in the league from the world’s leading players. Biggies like Kieron Pollard, Moeen Ali, David Miller, Nicholas Pooran, Tim David, Shakib Al Hasan are all part of the Abu Dhabi T10 League being played here. “1600 international players had registered for the draft but we could choose only 250. It shows there is a lot of interest and that makes us feel more confident about the league’s future,” said Khanna referring to the interest for the Abu Dhabi leg . “We are not here to compete with the T20 format. T10 can work as a talent feeder series to T20. The players love the format as it is quick and it is only two weeks (the T20 leagues are much longer).” Despite the growing interest, Khanna said the league has its set of challenges. “The biggest challenge is to market this product and make it sustainable. Operation challenges are also there as it is a new format and not everyone knows about it including the players.” Finding a window for the planned five legs of T10 will also be a challenge with international calendar and franchise cricket schedule being busier than ever. The IPL has become a billion dollar product and the BCCI is firm on maintaining its exclusivity in the league market. Considering that, is there a way to stage T10 in India? “I have come on board recently and I would be talking to the BCCI and see if there is opportunity and acceptance for it. Who would not love to have the league in India? We are also in talks with state associations,” added Khanna. Since India’s women players are allowed to play in overseas leagues, Khanna hopes that they will be part of the inaugural women’s competition in Sri Lanka in June. —PTI T10 League plans expansion to five locations after thumbs up from two ICC full members added by Press Trust of India on 12:30 am November 27, 2022 View all posts by Press Trust of India → Press Trust of India Facebook Twitter WhatsApp Email Print Related","pubDate":"2022-11-26 19:00:19","image_url":null,"source_id":"kashmirreader","country":["india"],"category":["sports"],"language":"english"},{"title":"Lyon: I want to do what Warnie did for me","link":"https://www.themercury.com.au/sport/cricket/nathan-lyon-opens-up-about-mentorship-and-his-future/news-story/2e1f57ff1693d1009027ac7a3c60fbc6","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"The death of Shane Warne has passed on an invisible baton to Nathan Lyon to become the senior statesman of Australian spin bowling – a responsibility he has acknowledged and embraced.","content":"On the list of Australia’s Test bowling wicket-takers there is Warne on 708 and a gap of 270 wickets to Lyon on 438. By the time the current Australian star retires there is likely to be daylight to the next spinner with the late Richie Benaud the next on 248 wickets.You can’t manufacture experience and pedigree, and Lyon’s wisdom means more than ever now as he relishes an active role mentoring young Victorian off-spinner Todd Murphy.The strong indication is 22-year-old Murphy has been identified by selectors as the next in line and Lyon, now 35, is determined to echo the legacy of Warne and help guarantee Australia’s spin bowling future well beyond the years he has left at the top of Test cricket.“One hundred per cent, and to be honest with you, we will never be able to replace Warnie and what Warnie did for our game,” Lyon told News Corp ahead of Wednesday’s first Test against the West Indies in Perth.“Not just for Australian cricket, but worldwide. We’ll never replace that.“But I dare say I do have a role in being a big driving voice for spin bowlers, especially in Australian cricket.“In my eyes, it’s spin to win in every game we come across. I do have that role and being that voice to hopefully support the spinners like Warnie supported me.”Lyon has not even contemplated retirement and despite officially entering his mid-30s last week and believes he has the mental and physical freshness to continue to march on for years to come.“Being a spin bowler does give you that opportunity to potentially play for a number of years,” he said.“I know I’m not even considering retirement any time soon. There’s a lot of things I want to tick off.”However, in the back of his mind is the extreme pressure and difficulties Lyon and nearly a dozen other young Australian spinners faced trying to find their place in Test cricket in the wake of Warne’s retirement.Lyon doesn’t want that to be the experience for his ultimate successor or the game, and a bond has formed between he and Murphy which shows the bonds of fellowship in Australian cricket are strong, even across NSW and Victorian state borders.“I absolutely love it to be honest with you. Trying to challenge the likes of Murph to get better,” Lyon said.“What I say is not the Gospel or anything like that, but it may be able to help him here or there.“What I like about Todd is that obviously he’s extremely young and he’s learning his craft – but that he wants to learn, that he’s wanting to ask questions and he’s not afraid in asking questions.“He’s a young, aspiring cricketer and that’s so important in the development of younger players is having cricket conversations and being willing to talk openly about how we can get better.“It’s been really good for me too. It takes me right back to basics and I get a big kick out of it especially when I see him doing well. I definitely think he’s got the potential. Hopefully I can help him along in his journey wherever I can.”Murphy’s figures of 3-27 from 22 overs in the first innings of the Prime Minister’s XI clash against the West Indies in Canberra was justification for the faith selectors have in his abilities and control, even after only five first-class matches.The bespectacled young prospect said he owes plenty to the mentorship of Lyon, who first volunteered to come and watch him at a Victorian net session in Adelaide last summer when NSW was also locked down in the same city in a Covid bubble.They bonded further at the Sydney Sixers and then on the Australia A tour of Sri Lanka mid-year.Murphy said nothing can mitigate the fact that the expectations will be enormous on whoever ultimately succeeds Lyon in the Australian cricket team, but having a great of the game willing to be so selfless in imparting his knowledge on a rival spinner has helped him believe he could handle Test cricket should an opportunity arise in the future.“When that does happen they’re expecting the next person to come in and do as good a job as what Nathan has done. When you look at it, he’s taken the most wickets ever by an off-spinner so it’s unrealistic to expect the next person who comes in is going to be able to do a similar job to that,” Murphy told News Corp.SCBBL PROMO“Because he’s been outstanding for so long.“Even just in the beginning, having someone to watch on TV and look at and see what they do to learn off, and then I was lucky enough that when we were in the Shield hub, he was able to come down and do a session with me, which was obviously beneficial for me.“Speaking to a guy like that about off-spin bowling is obviously gold for me so I just try and tap in as much as I can to him and ask him questions and try and learn.“Over in Sri Lanka I got a few days around the Test squad to bowl with him and watch how he bowls in those conditions and speak to him about what he tries to do to batsmen.“He’s stayed in touch with me throughout the start of the season and checking in on how I’ve been going. It’s really nice from that point of view that he’s taken an interest in me and wants me to do well. He’s been awesome.”Despite being cut from the same cloth as country kid off-spinners – Lyon from Young in NSW and Murphy hailing from Echuca in Victoria – Murphy insists there are differences in their approach.“There’s definitely parts of our bowling that’s different and we’re not exactly the same.”Lyon hasn’t been injured his entire career and is about as resilient as they come. But should an unexpected injury strike, Murphy feels he would be ready to tackle Test cricket if selectors looked his way.“It’s a good question and in all honesty I’m not probably sure myself. I’ve only played a handful of first class games and finding my way through that,” he said.“If that opportunity did arise which is very unlikely, but I’d like to think I’ve got the attributes to be able to compete at the next level.“But I also understand there’s definitely a handful of guys in front of me. I just want to keep developing.“I’m in no rush to get there but if that opportunity did arise I would be confident I’d have the skill sets to compete.”Lyon’s determination to help give back to the game has also driven him to launch a business venture called GOATD, a platform where professional athletes can connect with fans and aspiring young players in a mentoring capacity, including one-on-one video chats and training sessions.The Australian star also launched his range of Nice Garry kids books through Harper Collins this summer, aimed at trying to encourage children to read and dream big.Lyon still holds aspirations to return to Australia’s white ball teams, but admits being a single-format player has him primed and motivated to not even contemplate an end point to his illustrious Test career.Next year’s Test tour of India – a place Australia has not tasted success in over 20 years – remains No. 1 on his bucket list.“I am starting to see the benefits of not being in all three formats. Don’t get me wrong, I still have ambitions to play all three, but then you look at the guys and they’re playing all three formats and just hearing them speak about (the toll it takes),” said Lyon.“It does give me that chance to really freshen up and have a really good balance of life outside cricket.“There’s many things motivating me. I know the hunger for me each and every day is to try and improve Australian cricket and making sure that we’re winning.“The series in India is a massive goal for me. I’ve said it before, that would be probably up there with one of the biggest achievements if we’re able to tick that one off and win that Test series over there.“I don’t feel 35 body wise or anything like that. Spin bowling is a craft. It does allow you to make sure you are always trying to get better.”","pubDate":"2022-11-26 19:00:00","image_url":null,"source_id":"mercury","country":["australia"],"category":["sports"],"language":"english"},{"title":"Draft’s dark side: Who am I without an AFL career?","link":"https://www.themercury.com.au/sport/afl/afl-draft-the-darkness-when-a-teenagers-dream-is-smashed/news-story/70bd95857b9985611ee8d6aba32e3db8","keywords":["AFL","Sport news and galleries"],"creator":null,"video_url":null,"description":"For more than 50 young men this week will be the culmination of their dreams when they are drafted for the next two years by an AFL club.","content":"But what of those who miss the cut? The teenagers who have spent 10 years with that same dream only to see it fade to nothing, challenging their self-worth in the process.Nick Dixon, 26, who today works as a psychologist with Heartful Minds in Melbourne, knows all too well the feeling of isolation when an AFL dream is extinguished.JA: In 2014 you looked a strong draft chance during the Australian under-18 championships.ND: I missed the first two games through injury then went head to head in the midfield for Vic Country versus Vic Metro against Christian Petracca, both ending up with 30 (disposals). Then against Western Australia I tagged Jarrod Pickett and got 31 while keeping him to eight, so I thought things were going very well.JA: What went wrong from there?ND: We played South Australia and I didn’t get a touch which may have seen a few recruiters put a line through my name. Normally when I played on someone I could at least break even but my opponent, Caleb Daniel, torched me. He was too low to the ground, too clean and I just couldn’t find a way to stop him.JA: Was there interest leading into the draft combine?ND: My manager had spoken with a few clubs, GWS, Geelong and Fremantle were the main ones. I spent draft night at home with my mum (Cheryl). Given the talk had dried up a bit I kind of knew so I didn’t have mates coming around, but you still hope. The hardest was seeing your friends post on Instagram and celebrating. The blokes who miss out are kind of forgotten about.JA: How did you handle it on the night?ND: I just walked around Geelong for a few hours while hoping to hear from my manager (he rang the next day). It was quite isolating and hard to process for someone who had just turned 18.JA: Did you question your self-worth?ND: Your identity gets changed overnight. You grow up being a footballer and then in one night you have to find out who you are. Looking back I’m grateful because I was a very narrow person who academically didn’t have a great Year 12. I’m a very different person now.JA: Then you hoped for the rookie draft?ND: Where you see blokes get rookied who you know you can beat. The comparisons drive you insane. You just get caught in this loop where you just go around and around in circles and it only leads to negative outcomes. I would say 50 per cent of those who are close and don’t get drafted will have serious mental health problems the next year.JA: What was the knock on you, given you later played VFL with Geelong and Essendon plus outstanding footy with Collegians in the VAFA?ND: The common thread was “you are one of our favourite players in the draft but you are undersized for an inside midfielder (75kg, 183cm), you are on the slow side and your kicking isn’t great”. Otherwise they loved me (laughing).JA: So you reached a crossroad?ND: The next year I played at a high level in the VFL with Geelong then arrived at the draft camp and realised I wasn’t on anyone’s radar. It was then that I struggled most mentally, asking “who am I without an AFL career?”JA: How did you cope?ND: By forming strengths outside of being a footballer, by bringing balance into my life. These days I work with a lot of boys between 16-22 and missing out on a sporting achievement is a big part of it. Nothing is owed to you.JA: How does life look today?ND: I love my work with Heartful Minds. In football I spent the past two years co-coaching North Shore in the Geelong Football League and next season will co-coach Old Geelong in the VAFA, where my brother Scott plays and coaches. We both went to Geelong Grammar which is a feeder club for the OGs at Como Park.TALL TIMBER CATCHING THE EYEHe may be largely unknown by most cricket followers, but mark down the name of Essendon beanpole quick Cameron McClure as someone who has already caught the eye of Australia’s selection chairman in George Bailey.Standing a whopping 210cm, McClure’s bounce, carry and economy are all seen as tools that could take him on Australia’s 2023 Ashes tour.Should he ever reach Test level, he will easily be the tallest Australian to have done soWHAT 3AW WILL BRING NEXT SEASON Luca Gonano will head up 3AW football in 2023, with a focus on news and clearly-defined calling roles.Also expect to hear more of Sam “Scoop” McClure, who has made a favourable impression since becoming host of Wide World of Sports.A lively boundary rider may also be in the mix, as is a return to the halcyon days of a qualified medico such as Dr Peter Larkins giving updates.WHEN YOU CAN ACTUALLY DO IT ALL While you wouldn’t known it from the lack of promotion, we are into our summer of cricket, providing an opportunity to run my favourite ever scorecard.It is hard to comprehend that in December 2016, Shania-Lee Swart scored 160 for her South African under-19 team in a T20, and a whole lot crazier when you consider she was the only player on her team to actually score a run, Mpumalanga’s total of 169 all out being reached with nine extras.Swart, who carried her bat, hit 18 fours and 12 sixes before taking 2-21 against Easterns which finished at 6-127.Lifeline footer","pubDate":"2022-11-26 19:00:00","image_url":null,"source_id":"mercury","country":["australia"],"category":["sports"],"language":"english"},{"title":"Only MS Dhoni has mastered the art of batting at numbers 6 and 7, says Riyan Parag","link":"https://www.firstpost.com/firstcricket/sports-news/only-ms-dhoni-has-mastered-the-art-of-batting-at-numbers-6-and-7-says-riyan-parag-11703111.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"Only MS Dhoni has mastered the art of batting at numbers 6 and 7, says Riyan Parag","content":"Cricket Only MS Dhoni has mastered the art of batting at numbers 6 and 7, says Riyan Parag The Assam and Rajasthan Royals cricketer added that he was getting 'close to knowing' what batting in the middle order, especially in those two slots, felt like. FirstCricket Staff November 26th, 2022 21:45:29 IST File image of Chennai Super Kings wicketkeeper-batter and captain MS Dhoni. Sportzpics It’s been more than three years since MS Dhoni made his last appearance in an India jersey and the only time he’s seen on the field as an active cricketer is when the cricketing carnival that is the Indian Premier League comes alive, where he continues to lead the Chennai Super Kings. Dhoni has left behind a long-lasting impact, whether as a captain, batter or as a wicketkeeper, and is considered one of the greatest cricketers of his generation. And talking purely of his batting skills, Dhoni continues to draw praise for being one of the best middle-order batters the game has seen. And Rajasthan Royals and Assam batter Riyan Parag is among those who consider Dhoni as one who truly mastered the craft when it came to batting in the middle order, especially at the sixth and seventh slots. “It’s the tougher job in T20 cricket, to just come in and slog. Numbers six and seven are the hardest places to play in T20 cricket. Only some of the guys have mastered it. Not even some, I’ll just say only MS Dhoni has mastered it and no one else has,” Parag, who is currently representing Assam at the Vijay Hazare Trophy, told Sportskeeda . “And I am doing it at such an early stage in my career. Not even master it, I am just getting to close to knowing what it all feels like – I am just sorting my way through it. So people can just talk whatever they want, but I know how hard a job it is and my team believes in me,” added the 21-year-old cricketer. Parag, who had been bought by the Royals at his base price of Rs 20 lakh in the 2019 edition. Despite not living up to his full potential in the four seasons that he’s played since then, having collected just 522 runs in the league overall at an average and strike rate of 16.84 and 124.88 respectively, he remains an integral member of the squad. Dhoni, meanwhile, is set to make his 16th appearance in the IPL as a player in IPL 2023, which will also be his 13th as full-time captain. Dhoni had stepped down as captain in March this year days before the start of the 15th season, with Ravindra Jadeja taking over in the role, but was back leading the side after a string of poor results. Read all the Latest News , Trending News , Cricket News , Bollywood News , India News and Entertainment News here. Follow us on Facebook , Twitter and Instagram . Updated Date: November 26, 2022 21:45:29 IST Tags: Cricket Ms Dhoni Riyan Parag Find latest and upcoming tech gadgets online on Tech2 Gadgets. Get technology news, gadgets reviews & ratings. Popular gadgets including laptop, tablet and mobile specifications, features, prices, comparison.","pubDate":"2022-11-26 16:15:29","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/11/MS-Dhoni-CSK-MI-IPL-2022-Sportzpics-1.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"\"Wait For Right Time...\": Anurag Thakur On Ramiz Raja's World Cup Warning","link":"https://sports.ndtv.com/cricket/wait-for-right-time-anurag-takur-on-ramiz-rajas-2023-world-cup-warning-3556271","keywords":["Cricket"],"creator":["NDTV"],"video_url":null,"description":"Ramiz Raja recently insisted that if the Indian cricket team doesn't take part in the Asia Cup, which is scheduled to be held in Pakistan next year, their team will also not play in the ICC ODI World...","content":null,"pubDate":"2022-11-26 15:54:17","image_url":"https://c.ndtvimg.com/2022-10/i47c3u1s_anurag-thakur-650_625x300_18_October_22.jpg?im=FeatureCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Second ODI: Indian batting needs fresh approach to save series against New Zealand","link":"https://www.orissapost.com/second-odi-indian-batting-needs-fresh-approach-to-save-series-against-new-zealand/","keywords":["Sports","India","new zealand"],"creator":["Post News Network"],"video_url":null,"description":"Hamilton: India would expect a better approach from skipper Shikhar Dhawan and young Shubman Gill in the Powerplay overs when the team clashes with New Zealand in the do-or-die second One-Day International here Sunday. The Seddon Park is a three-way open ground but is known for being one of the batting friendliest tracks in New […]","content":"Second ODI: Indian batting needs fresh approach to save series against New Zealand PTI Updated: November 26th, 2022, 21:15 IST in Sports 0 Pic- BCCI Share on Facebook Share on Twitter Share on WhatsApp Share on Linkedin Hamilton: India would expect a better approach from skipper Shikhar Dhawan and young Shubman Gill in the Powerplay overs when the team clashes with New Zealand in the do-or-die second One-Day International here Sunday. The Seddon Park is a three-way open ground but is known for being one of the batting friendliest tracks in New Zealand where willow wielders would get value for their shots. Dhawan (72 off 77) and Gill (50 off 65 balls) added 123 in their opening stand but on a small Eden Park ground, a score of 306 for 7 was at least 40 runs short of par score. The bowlers could be taken to task for conceding those runs in just over 47 overs, the buck actually stops at the main batters since if it was not for Washington Sundar’s brilliant cameo, India would not have touched the 300-run mark. It was largely due to the safety-first approach of the Indian openers during the first 10 Powerplay over where the runs did not come at a desirable pace. Moeen Ali in a recent interview to PTI spoke how in earlier times, teams followed Australian template in white ball cricket and now it is the English way that is being aped by the teams. And that is where India is lagging behind as it was at least 40 runs short in the first Poweplay overs in Auckland. Sample another piece of statistic which will give an idea that the problem lies in the general outlook of Indian top-order batters across limited overs formats (not just Rohit Sharma, KL Rahul or Virat Kohli). Dhawan hit 72 off 77 balls that had 13 fours. So effectively, he scored 52 runs in boundaries in 13 deliveries. He scored another 20 runs in 64 deliveries and out of which 44 were dot balls as he was unable to get going in the Powerplay. As the skipper struggled, at the other end, Gill didn’t do his overall averages any harm by stacking up another half-century, but the pace of his innings was also a debatable one. His 50 was scored in 65 balls with three sixes and a boundary. This means 22 runs were scored from four deliveries. He scored the remaining 28 runs from 61 deliveries. The same approach of just building the foundation and leaving the heavy-lifting for the back-end has cost India a T20 World Cup but strangely even as personnel changed in ODIs for this series, the approach has remained archaic. With so many players jostling for opening slots, it is imperative that the players score heavily so that the numbers can’t be ignored when the new selectors prune the pool to around 20, at least three to four months before the 50-over marquee event. While Dhawan will certainly open with Rohit in Bangladesh next month, there aren’t any guarantees that Shubman will be able to retain his place in the playing XI as Rohit will comeback as an opener. KL Rahul might take Suryakumar Yadav’s (rested for next series) middle-order slot. Rishabh Pant has a way better ODI strike-rate and average compared to T20Is but the vice-captain of this series needs to be more consistent in order to keep the big gloves away from Sanju Samson and Ishan Kishan, who are definitely close on his heels. As Virender Sehwag, few weeks earlier had said that Pant needs to decide first what will be his style of batsmanship. At the moment, the marauder from Rourkee seems to be in a state of limbo: whether to attack or defend. Sooner he gets his bearing, better it will be for the ODI core team. Bowlers need to find fuller lengths ====================== At Eden Park which has short and weird dimensions, Indian pacers bowled way too short. They will need to find a way to counter Tom Latham and Kane Williamson, who have both been consistent against India over the years in this format. While Umran Malik was impressive bowling northwards of 145 clicks, Arshdeep Singh despite his ability to get the swing struggled for pace and Shardul Thakur was generally erratic. Toss will be an important factor as batting becomes easier at the Seddon Park as the evening wears on. If India can chase, it will do them a world of good as spinners won’t have to encounter the dew factor during the evening hours. Whether Kuldeep Yadav is tried out instead of Yuzvendra Chahal is there to be seen as the ground is slightly bigger for his comfort. India: Shikhar Dhawan (captain), Shubman Gill, Suryakumar Yadav, Shreyas Iyer, Rishabh Pant (wk), Sanju Samson (wk), Deepak Hooda, Shahbaz Ahmed, Washington Sundar, Kuldeep Yadav, Yuzvendra Chahal, Deepak Chahar, Arshdeep Singh, Shardul Thakur and Umran Malik. New Zealand: Kane Williamson (captain), Finn Allen, Devin Conway, Tom Latham, Daryl Mitchell, Glenn Phillips, Michael Bracewell, Tim Southee, Matt Henry, Adam Milne, Jimmy Neesham, Mitchell Santner and Lockie Ferguson. Match Starts: 7 am IST. PTI Tags: India new zealand Share Tweet Send Share Suggest A Correction Enter your email to get our daily news in your inbox. Leave this field empty if you're human: Related Posts India go down to Aussies despite Akashdeep treble November 26, 2022 PT Usha throws her hat into IOA ring, to fight for president’s post November 26, 2022 IPL is the best thing to happen to Indian cricket: Gautam Gambhir November 26, 2022 Messi, Argentina under pressure for Mexico game at World Cup November 26, 2022 ‘A new Barca fan is born’, FC Barcelona welcomes Alia Bhat-Ranbir Kapoor’s new-born daughter Raha November 26, 2022 NZ beat India by seven wickets in first ODI, take 1-0 lead in series November 25, 2022 Leave a Reply Cancel reply Your email address will not be published. Required fields are marked * Comment Name * Email * Website Save my name, email, and website in this browser for the next time I comment.","pubDate":"2022-11-26 15:45:21","image_url":"https://www.orissapost.com/wp-content/uploads/2022/11/Indian-batting-needs-fresh-approach-to-save-series-against-New-Zealand-300x240.jpg","source_id":"orissapost","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL is the best thing to happen to Indian cricket: Gautam Gambhir","link":"https://www.orissapost.com/ipl-is-the-best-thing-to-happen-to-indian-cricket-gautam-gambhir/","keywords":["Sports","Gautam gambhir","ipl"],"creator":["Post News Network"],"video_url":null,"description":"New Delhi: Former India opener Gautam Gambhir, who captained Kolkata Knight Riders to two Indian Premier League (IPL) trophies in 2012 and 2014, feels that the introduction of the tournament has been the best thing to have ever happened to Indian cricket in the last couple of years. “IPL is the best thing that has […]","content":"IPL is the best thing to happen to Indian cricket: Gautam Gambhir IANS Updated: November 26th, 2022, 21:02 IST in Sports 0 Share on Facebook Share on Twitter Share on WhatsApp Share on Linkedin New Delhi: Former India opener Gautam Gambhir, who captained Kolkata Knight Riders to two Indian Premier League (IPL) trophies in 2012 and 2014, feels that the introduction of the tournament has been the best thing to have ever happened to Indian cricket in the last couple of years. “IPL is the best thing that has happened to Indian cricket. I can say this with all my senses. There has been a lot of backlash regarding IPL since it started. Every time Indian cricket does not do well, the blame comes on IPL, which is not fair. If we don’t perform well in ICC tournaments, blame the players, blame the performance, but it is unfair to point fingers at the IPL,” Gambhir said on the sidelines of the TURF2022 & India Sports Awards of FICCI on Saturday. Gambhir, who represented India in 58 Tests, 147 ODIs and 37 T20Is, apart from 154 IPL matches, threw light on how there is financial security among players due to the advent of the IPL. “A sportsman can only earn till he is 35-36. IPL provides with financial security which is equally important.” The former left-handed batter, who works as the global mentor of Lucknow and Durban Super Giants franchises in the IPL and SA20 leagues, praised the BCCI for employing Indian coaches over the past few years to lead the national side and wished to see more Indian coaches working in IPL. “One good thing that has happened in Indian cricket is that Indians have started coaching the Indian national cricket team now. I strongly believe (an) Indian should coach the Indian team. All these foreign coaches, who we gave a lot of importance to, come here to make money and then they vanish. Emotions are important in sports. The only people who can be emotional about Indian cricket are the ones who have represented their country.” “I am a mentor of Lucknow Super Giants. One thing I want to change is that I want to see all Indian coaches in IPL. Because no Indian coach gets an opportunity in Big Bash or any other foreign league. India is a superpower in cricket, but our coaches do not get the opportunity anywhere. All the foreigners come here and get the top jobs. We are more democratic and flexible than other leagues. We need to give our people more opportunity.” Gambhir, who is also a Lok Sabha MP from East Delhi, further pressed the need for state governments to adopt the Odisha model of encouraging other sports like Hockey and pick up one Olympic sport to promote them in their respective states. “Sports is going to play a massive role in the development of India. There is a need to engage young children in sports and physical activities instead of their electronic devices. Every state should pick up one sport as Odisha has done with Indian hockey. See where hockey has gone today. I know sports ministry is doing a lot and corporates are getting involved, but if each state picks up one sport and completely focuses on that, imagine where our Olympic sports are going to be.” “If it is my way, probably the BCCI should also go on and give 50 percent of revenue to all other Olympic sports, though it is not my way. Because 50 percent of revenue that is generated out of cricket is enough for cricketers. But the rest of the 50 percent can actually pick up all the other sports.” IANS Tags: Gautam gambhir ipl Share Tweet Send Share Suggest A Correction Enter your email to get our daily news in your inbox. Leave this field empty if you're human: Related Posts Second ODI: Indian batting needs fresh approach to save series against New Zealand November 26, 2022 India go down to Aussies despite Akashdeep treble November 26, 2022 PT Usha throws her hat into IOA ring, to fight for president’s post November 26, 2022 Messi, Argentina under pressure for Mexico game at World Cup November 26, 2022 ‘A new Barca fan is born’, FC Barcelona welcomes Alia Bhat-Ranbir Kapoor’s new-born daughter Raha November 26, 2022 NZ beat India by seven wickets in first ODI, take 1-0 lead in series November 25, 2022 Leave a Reply Cancel reply Your email address will not be published. Required fields are marked * Comment Name * Email * Website Save my name, email, and website in this browser for the next time I comment.","pubDate":"2022-11-26 15:32:39","image_url":"https://www.orissapost.com/wp-content/uploads/2020/05/Gauti-300x169.jpg","source_id":"orissapost","country":["india"],"category":["sports"],"language":"english"},{"title":"Dhanraj Nathwani elected Gujarat Cricket Association president","link":"https://www.sentinelassam.com/sports/cricket/dhanraj-nathwani-elected-gujarat-cricket-association-president-625397","keywords":["Sports,Cricket"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"Dhanraj Nathwani was unanimously elected president of Gujarat Cricket Association last week in its 86th Annual General Meeting.","content":"AHMEDABAD: Dhanraj Nathwani was unanimously elected president of Gujarat Cricket Association last week in its 86th Annual General Meeting.Nathwani was earlier vice-president of the association and succeeds Union Home Minister Amit Shah, who retired from the president's office on completion of his term. He is determined to accelerate the vision of Prime Minister Narendra Modi of spreading the sports in remote areas of Gujarat. IANS Also Read:  Rain-hit 3rd T20I tied; India win New Zealand series Also Watch:","pubDate":"2022-11-26 14:35:57","image_url":"https://assets.sentinelassam.com/h-upload/2022/11/26/416234-natraj.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"'Why do we change our captains?' Aakash Chopra questions Rohit Sharma's frequent absence from ODIs","link":"https://www.firstpost.com/firstcricket/sports-news/why-do-we-change-our-captains-aakash-chopra-questions-rohit-sharmas-frequent-absence-from-odis-11703021.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"'Why do we change our captains?' Aakash Chopra questions Rohit Sharma's frequent absence from ODIs","content":"Cricket 'Why do we change our captains?' Aakash Chopra questions Rohit Sharma's frequent absence from ODIs Rohit Sharma has led India in only two ODI series (Against West Indies and England), and has missed five ODI series, including South Africa both home and away. FirstCricket Staff November 26th, 2022 20:04:23 IST India captain Rohit Sharma. AP Former India batter Aakash Chopra on Saturday urged veteran batter and all-format skipper Rohit Sharma to play more ODIs, urging the Nagpur-born cricketer to take minimal breaks and keep playing. Aakash Chopra also stressed that the time for experimenting with the team was also over. Rohit Sharma took over as India’s all-format skipper almost a year back, and he has only led India in six ODIs. Shikhar Dhawan, who is currently the skipper of India’s ongoing ODI series against New Zealand in Kiwiland, has led India in seven ODIs, while KL Rahul has captained the Men in Blue in six ODIs. Dhawan, in fact, would have led India in nine ODIs by the time the ongoing series against Black Caps end. “If you look at Sri Lanka, they are playing against Afghanistan, and Dasun Shanaka is leading them. England played against Australia, and Jos Buttler is still their captain. Australia chopped and changed a little bit but Pat Cummins led them in two out of those three matches (against England). If all teams around the world are playing with their original captains then why do we change our captains so much? It’s a valid question,” argued Chopra on his YouTube channel . Rohit Sharma has led India in only two ODI series (Against West Indies and England), and has missed five ODI series, including South Africa both home and away. Apart from the South Africa series early this year, Rohit was available for selection in all the other series, but was rested. Others like Virat Kohli and Mohammed Shami have also been given frequent breaks as part of the workload management. In fact, against New Zealand, not only were the veterans rested, but also Rahul Dravid and his support staff were given a break following India’s T20 World Cup campaign in Australia. The move to rest Rahul Dravid and his support staff has been criticised by former India coach Ravi Shastri. “The captain is the one responsible for building a team. The same captain, the same coach helps a lot because the more time you spend with the team, the better you get to know each individual. If constantly, be it in West Indies, Zimbabwe, now in New Zealand, your captain is not available then there is a problem. Shikhar Dhawan led India in the last three ODI series. Suddenly when you go to Bangladesh, he won’t be the captain. The openers will change, and the captain will change. So when there are so many changes then your preparations are not good,”said Chopra. Chopra said that if the seniors needed a break, they could take it during the IPL season. “Now, the time for experimenting is gone. Rohit Sharma, I believe he is our captain for the 2023 ODI World Cup, should take minimal breaks and keep playing. If you need a break, take it during the IPL. If Team India is serious about winning the World Cup then they should start fielding their best XI as much as possible,” the 45-year-old added. Read all the Latest News , Trending News , Cricket News , Bollywood News , India News and Entertainment News here. Follow us on Facebook , Twitter and Instagram . Updated Date: November 26, 2022 20:04:23 IST Tags: Aakash Chopra Cricket Rohit Sharma Team India Find latest and upcoming tech gadgets online on Tech2 Gadgets. Get technology news, gadgets reviews & ratings. Popular gadgets including laptop, tablet and mobile specifications, features, prices, comparison.","pubDate":"2022-11-26 14:34:23","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/09/Rohit-Sharma-3.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Cricket World Cup Super League: India remain at top despite loss","link":"https://www.sentinelassam.com/sports/cricket/cricket-world-cup-super-league-india-remain-at-top-despite-loss-625396","keywords":["Sports,Cricket"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"India continued to be at the top of the Cricket World Cup Super League (CWCSL) standings despite suffering a seven-wicket loss against New Zealand","content":"DUBAI: India continued to be at the top of the Cricket World Cup Super League (CWCSL) standings despite suffering a seven-wicket loss against New Zealand in the first ODI of the three-match series in Auckland on Friday.Fine fifties by Shubman Gill (50), Shikhar Dhawan (72) and Shreyas Iyer (80) along with an impressive cameo from Washington Sundar (37) lifted India to 306/7 in 50 overs. In reply, brilliant knocks by Tom Latham (145 not out off 104) and Kane Williamson (94 not out off 98) and their unbeaten fourth-wicket stand worth 221 runs helped New Zealand pull off their second-highest chase against India in men's ODI cricket. After their impressive win, New Zealand bagged 10 CWCSL points and jumped two spots from sixth to fourth in the standings. They are currently tied on 120 points with Australia but are marginally behind on Net Run Rate compared to their neighbours. On the other hand, India, who will qualify automatically for the ICC Men's Cricket World Cup 2023, on the account of being the tournament hosts, are at the top with 129 points. A win for New Zealand in the second ODI in Hamilton on Sunday would see them jump from fourth to the top of the CWCSL table. Notably, a total of the top eight teams will get a direct entry to the Cricket World Cup 2023. The remaining teams will have to play in the Men's World Cup Qualifier along with five associate teams. Two teams from the qualifying tournament will then progress to the World Cup. IANS Also Read:  Always try not to get ahead of the game, says Indian cricketer Suryakumar Yadav on sparkling form Also watch:","pubDate":"2022-11-26 14:30:00","image_url":"https://assets.sentinelassam.com/h-upload/2022/11/26/416233-india-cric.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"India vs New Zealand: Hardik Pandya gifts autographed jersey to Team India’s bus driver; watch video","link":"https://www.firstpost.com/firstcricket/sports-news/india-vs-new-zealand-hardik-pandya-gifts-autographed-jersey-to-team-indias-bus-driver-watch-video-11702411.html","keywords":["First Cricket News"],"creator":["FP Trending"],"video_url":null,"description":"India vs New Zealand: Hardik Pandya gifts autographed jersey to Team India’s bus driver; watch video","content":"Indian all-rounder Hardik Pandya is unquestionably one of the most admired cricketers in the country for his humble gestures towards his fans.The popularity is growing day by day and now the flamboyant player has been winning hearts again for gifting his jersey to the driver of India’s team bus in New Zealand.The Men in Blue, under the leadership of Pandya, had recently triumphed over the Black Caps 1-0 in the three-match T20I series.After coming off the victory, the interim skipper presented his autographed shirt to the man identified as Michael Jones. The other members of the Indian side also gave their signatures on the memento kit.Hardik Pandya’s great gesture towards #TeamIndia‘s bus driver in New ZealandWatch @Vimalwa‘s special report here: https://t.co/HJz0NTcbFX#HardikPandya #OneCricket #crickettwitter pic.twitter.com/c0AibDvTIh— OneCricket (@OneCricketApp) November 26, 2022 After receiving the special gift, Jones appeared in an interview with Indian journalist Vimal Kumar. A short clip of the chat was uploaded on the official Twitter page of One Cricket. The caption of the post said, “Hardik Pandya’s great gesture towards Team India’s bus driver in New Zealand.”During the conversation, he described his experience of travelling with the Indian cricketers throughout the tour. While being asked about his most memorable event during the five-day long trip, Jones did not waste any time referring to the Indian jersey.Watch the full interview here: Jones further explained that the shirt would be brought to an auction by a charity organisation named ‘Sports Foundation’ on 31 March 2023. The organisation is known for raising funds for orphan kids who are associated with any kind of sports.At the end, Jones went on to reveal that the craze for Indian players was quite remarkable whichever city they had travelled to during the series. As stated by him, the cricketers also used to take time to interact with the supporters.After the positive result in the T20I series, the Indian unit led by Shikhar Dhawan endured defeat in the first game of the three-match ODI series.Batting first, India amassed a decent total of 306 runs in 50 overs riding on the commendable performances of the top-order batters. But the heroic knocks by Kiwi skipper Kane Williamson and Tom Latham snatched the game away from them, chasing down the target quite comfortably.India and New Zealand will square off for the second ODI on Sunday at Hamilton’s Seddon Park.Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-11-26 13:29:48","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/11/Hardik-Pandya-India-New-Zealand-T20I-trophy-AP-1.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"We won't go to India if they don't come to Pakistan: Ramiz Raja","link":"https://www.sentinelassam.com/sports/cricket/we-wont-go-to-india-if-they-dont-come-to-pakistan-ramiz-raja-625379","keywords":["Sports,Cricket"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"PCB chief Ramiz Raja has said that the Pakistan cricket team won't travel to India for the ICC Men's Cricket World Cup in 2023 if the Men in Blue don't visit the neighbouring country for the next year's Asia Cup.","content":"ISLAMABAD: The Pakistan Cricket Board (PCB) chief Ramiz Raja has said that the Pakistan cricket team won't travel to India for the ICC Men's Cricket World Cup in 2023 if the Men in Blue don't visit the neighbouring country for the next year's Asia Cup.The Asia Cup 2023 is scheduled to be played in Pakistan in September of next year. However, BCCI secretary Jay Shah, who is also the president of the Asian Cricket Council (ACC) last month said that the Indian team will not travel to Pakistan for the Continental championship and demanded that the event be moved to a neutral venue. Shah's comment had ruffled some feathers in Pakistan then and PCB requested the Asian Cricket Council to convene an emergency meeting. In the latest development, the PCB chief once again reiterated his stance on the tussle. \"If Pakistan doesn't take part in the World Cup scheduled in India next year, who will watch it? We have a clear stand: If the Indian team comes here then we will go for the World Cup. If they don't come then they can play the World Cup without us,\" Raja told Urdu News. \"We will adopt an aggressive approach. Our team is showing performance. I've always said we need to improve the economy of Pakistan cricket, and that can only happen when we perform well. In the 2021 T20 World Cup, we beat India. We beat India in the T20 Asia Cup. In one year, the Pakistan cricket team defeated a billion-dollar economy team twice,\" he added. The ICC Men's Cricket World Cup 2023, to be hosted by India, will be the 13th edition of the 50-over World Cup. India will be hosting the quadrennial tournament for the fourth time in its history and it is highly unlikely that the mega event will be moved out of the country. Notably, Pakistan and India do not play bilateral cricket and only meet in global tournaments or multi-team events since 2013 due to strained political tensions between the two countries. IANS Also Read: Ramiz Raja elected chairman of PCB Also watch:","pubDate":"2022-11-26 13:26:31","image_url":"https://assets.sentinelassam.com/h-upload/2022/11/26/416212-raja-copy.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"I've got so much respect for Pat Cummins, says Justin Langer days after being combative","link":"https://www.sentinelassam.com/sports/cricket/ive-got-so-much-respect-for-pat-cummins-says-justin-langer-days-after-being-combative-625377","keywords":["Sports,Cricket"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"Former Australia men’s cricket team head coach Justin Langer has rubbished claims that he was in a conflict with Test and ODI skipper Pat Cummins following fiery claims by the ex-opener that he was betrayed by ‘cowards’ at CA","content":"MELBOURNE: Former Australia men's cricket team head coach Justin Langer has rubbished claims that he was in a conflict with Test and ODI skipper Pat Cummins following fiery claims by the ex-opener that he was betrayed by 'cowards' at Cricket Australia (CA).In a widely-publicised interview, the former Australia opener indicated he felt let down by senior players such Pat Cummins and Aaron Finch, which eventually led him to step down as head coach. Langer had quit days before the team's scheduled departure for the historic Test series against Pakistan earlier this year after CA just gave him a six-month contract extension. Some seniors in the side were reportedly not happy with Langer's micromanagement of the team and things came to a head on a couple of occasions during the final 12 months of his contract. Langer recently slammed Cummins on a podcast for going behind his back, and that \"he grew tired of the leaks around his future\" when his contract was up for renewal, resulting in all the negativity. However, Langer has now insisted that the rumours of a rift with Cummins are \"utter rubbish\". \"Ironically, I spoke to Patty (Cummins) on Monday; we had a long talk about how the team was going, how he's going, how his family's going. And some of this rubbish is complete and utter rubbish,\" Langer told Channel 7 News Perth, according to a report in Daily Mail. \"I've got so much respect for Patty Cummins, I think he's a brilliant player, I think he's an outstanding human being. So any thought there's war between Patty and I could not be further from the truth.\" Langer had initially said in a podcast which raised quite a storm, that, \"I spoke to Pat Cummins. He said to me about five times, 'This might be brutally honest'. I said, 'Pat, there is nothing brutal about your feedback. What is brutal is I'm hearing it behind my back through the media or through sources. No one's telling me. Tell me'. IANS Also Read:  Never had a doubt Cummins would recover from debilitating injuries when he was starting out: Lillee Also watch:","pubDate":"2022-11-26 13:23:08","image_url":"https://assets.sentinelassam.com/h-upload/2022/11/26/416211-pat.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"Private equity firm ‘makes £400m offer’ for 75% stake in the Hundred","link":"https://www.theguardian.com/sport/2022/nov/26/cricket-hundred-private-equity-offer-400-million","keywords":["The Hundred","Cricket","Sport","ECB"],"creator":["Ali Martin in Islamabad"],"video_url":null,"description":"Bridgepoint Group reported to have made the big bidECB chair has voiced caution on rights ‘feeding frenzy’English cricket has received a “£400m private equity approach” for a majority stake in the Hundred, a potentially gamechanging moment for the sport. The offer for 75% of the sport’s newest competition has come from Bridgepoint Group, a London-listed buyout firm, offering an injection of funds for the England and Wales Cricket Board and the 18 first-class counties, according to Sky News.The Hundred, which launched in 2021 after a 12-month delay because of the Covid-19 pandemic, has long been considered ripe for private investment with the overall rise of franchised Twenty20 competitions around the world. Continue reading...","content":null,"pubDate":"2022-11-26 13:12:43","image_url":"https://i.guim.co.uk/img/media/54881bfadf7e5ce5faa277b0ea31c4884f735512/0_234_3500_2100/master/3500.jpg?width=460&quality=85&auto=format&fit=max&s=f220fc321ae91350dbf056fdd824f601","source_id":"theguardian","country":["united kingdom","india","singapore","canada"],"category":["sports"],"language":"english"},{"title":"West Indies great Brian Lara says ‘special’ Alzarri Joseph the man to rattle Australia","link":"https://thewest.com.au/sport/cricket/west-indies-great-brian-lara-says-special-alzarri-joseph-the-man-to-rattle-australia--c-8977599","keywords":null,"creator":["Aaron Kirby"],"video_url":null,"description":"West Indian cricket legend Brian Lara believes there will be one name on the lips of every Aussie batter by the end of their two match Test series.","content":null,"pubDate":"2022-11-26 12:56:39","image_url":"https://images.thewest.com.au/publication/C-8977599/5da337b38defcf945dfe89d05bf46d5f79620825-16x9-x648y751w1061h597.jpg","source_id":"thewest","country":["australia"],"category":["sports"],"language":"english"},{"title":"Strikers shock Sixers to claim their maiden WBBL title","link":"https://www.themercury.com.au/sport/cricket/strikers-shock-sixers-to-claim-their-maiden-wbbl-title/video/d097ea93445e68307b81fee2d99d7673","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket: The Adelaide Strikers have shocked the Sydney Sixers to claim their maiden WBBL Title after registering a 10-run win at North Sydney Oval.","content":"Cricket: The Adelaide Strikers have shocked the Sydney Sixers to claim their maiden WBBL Title after registering a 10-run win at North Sydney Oval.","pubDate":"2022-11-26 12:36:24","image_url":null,"source_id":"mercury","country":["australia"],"category":["sports"],"language":"english"},{"title":"IND vs NZ Dream11 Team Prediction, Match Preview, Fantasy Cricket Hints: Captain, Probable Playing 11s, Team News; Injury Updates For Today’s IND vs NZ 2nd ODI match in Seddon Park, Hamilton, 7 AM IST, November 27","link":"https://zeenews.india.com/cricket/ind-vs-nz-dream11-team-prediction-match-preview-fantasy-cricket-hints-captain-probable-playing-11s-team-news-injury-updates-for-today-s-ind-vs-nz-2nd-odi-match-in-seddon-park-hamilton-7-am-ist-november-27-2540473.html","keywords":null,"creator":null,"video_url":null,"description":"India vs New Zealand Dream11 Team Prediction India vs New Zealand 2nd ODI match Preview - Check My Dream11 Team, Best players list of IND vs NZ, India Dream11 Team Player List, New Zealand Dream11 Team Player List, Dream11 Guru Tips, Fantasy Cricket Tips, Fantasy Cricket Tips, Fantasy Playing Tips.","content":null,"pubDate":"2022-11-26 12:15:00","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"SVD vs JVC Dream11 Prediction: Fantasy Cricket Tips, Today's Playing 11, Player Stats, Pitch Report for CBFS T10 League, Match 16","link":"https://www.sportskeeda.com/fantasy-cricket-mantra/svd-vs-jvc-dream11-prediction-fantasy-cricket-tips-today-s-playing-11-player-stats-pitch-report-cbfs-t10-league-match-16?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Fantasy Cricket Mantra"],"creator":["Anjishnu Roy"],"video_url":null,"description":null,"content":null,"pubDate":"2022-11-26 11:45:14","image_url":"https://static.sportskeeda.com/editor/2022/11/236e3-16694433506834-1920.jpg","source_id":"sportskeeda","country":["india"],"category":["sports"],"language":"english"},{"title":"Watch: Fan shares story on how he met Virat Kohli in Nainital, video wins over internet","link":"https://www.firstpost.com/firstcricket/sports-news/watch-fan-shares-story-on-how-he-met-virat-kohli-in-nainital-video-wins-over-internet-11701251.html","keywords":["First Cricket News"],"creator":["FP Trending"],"video_url":null,"description":"Watch: Fan shares story on how he met Virat Kohli in Nainital, video wins over internet","content":"The stardom of Virat Kohli has broken all the barriers as the cricketer has a huge fanbase all around the globe. There are several instances when his fans went past every hurdle to have a glance at their idol once in a lifetime.Recently, one such die-hard fan has shared a tale of his memorable encounter with the iconic cricketer when Kohli went for a trip to Uttarakhand with his spouse Anushka Sharma and daughter Vamika Kohli.Taking to his personal Instagram, the boy identified as Kapil uploaded a montage video which depicts his ultimate effort to meet his favourite player at the Kainchi Dham temple in Nainital. View this post on Instagram A post shared by Kapil🧃 (@kapiljpeg) According to the clip, Kapil and his friends received the information that Kohli would visit the renowned temple at Almora road with his family on 17 November. However, the group was unaware of the exact timing of Kohli’s visit so they took a ride to the venue and reached there at 6 AM to be precise. They had to wait several hours. But as per the saying “the fruit of patience is always sweet,” their dream finally came true.One of the frames shows Kapil sitting right beside Kohli inside the temple where a number of fans gathered to snap pictures with the star batter. Kohli spent some time interacting with his fans before joining his family. As stated by Kapil, Kohli politely forbade him to record his daughter who was resting in the car.Kapil captioned the video, “The day I met Virat Kohli and Anushka Sharma. 17.11.22.” Since being uploaded, the heartwarming video has received over 3 million views and has garnered more than 4.5 lakh likes so far. A lot of Indian fans termed Kapil “lucky” for getting the opportunity. Some users also shared their experience of meeting the Indian batter in the comment section.An overwhelmed ‘Viratian’ said, “I can feel the emotions. Lucky you.” A user lauded Kohli for his humble gesture and noted, “How does Virat Kohli keep his calm? The most aggressive player on the field and also the coolest off the field. We are lucky to have him in our team.”An individual referred to the same kind of experience he enjoyed, “I remember seeing him in Cape Town for the last test tour in 2022. He was heading onto the bus and obliged the 3 people cheering the team near the hotel. He was sitting in the bus and waved to the window.”After enjoying sky-high form in the T20 World Cup in Australia, Kohli took a rest from the ongoing multi-format series against New Zealand. He will be back in action in the next away series in Bangladesh where the Men in Blue will play three ODIs and two Tests. The opening ODI is slated to take place on 4 December at the Sher-e-Bangla Stadium.Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-11-26 11:44:03","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/11/Virat-Kohli-Nainital-temple-fans-Instagram-1.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"West Indies draw with Prime Minister's XI ahead of first Test against Australia - ABC News","link":"https://news.google.com/__i/rss/rd/articles/CBMiYmh0dHBzOi8vd3d3LmFiYy5uZXQuYXUvbmV3cy8yMDIyLTExLTI2L2NyaWNrZXQtd2VzdC1pbmRpZXMtcHJpbWUtbWluaXN0ZXJzLXhpLXRvdXItbWF0Y2gvMTAxNzAyOTA40gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"West Indies draw with Prime Minister's XI ahead of first Test against Australia  ABC NewsWindies start chase positively after Renshaw ton | Prime Minister's XI v West Indies 2022-23  cricket.com.au‘Do the right thing’: Aussie Test team to take a knee for first time on home soil  Fox Sports‘Extremely proud, happy’: Test team to take a knee before Windies series  Sydney Morning HeraldWest Indies fight out draw against PM's XI  The AdvocateView Full coverage on Google News","content":null,"pubDate":"2022-11-26 11:32:44","image_url":null,"source_id":"google","country":["australia"],"category":["sports"],"language":"english"},{"title":"IND vs NZ: With weather forecast unfavourable, is India vs New Zealand 2nd ODI likely to be washed out?","link":"https://www.indiatvnews.com/sports/cricket/ind-vs-nz-with-weather-forecast-unfavourable-is-india-vs-new-zealand-2nd-odi-likely-to-be-washed-out-india-vs-new-zealand-2nd-odi-kane-williamso-2022-11-26-826708","keywords":null,"creator":null,"video_url":null,"description":"IND vs NZ 2nd ODI: The Indian cricket team has reached Hamilton to play in the second ODI of the three-match series. The Men in Blue were outclassed by New Zealand in the first ODI as the Kiwis chased down the target of 307 runs with 7 wickets in hand. India now hope to perform better in the second outing but the rain is in the mood to play its game and the weather is not favourable at Seddon Park, Hamilton.","content":"The Indian cricket team has reached Hamilton to play in the second ODI of the three-match series. The Men in Blue were outclassed by New Zealand in the first ODI as the Kiwis chased down the target of 307 runs with 7 wickets in hand. India now hope to perform better in the second outing but the rain is in the mood to play its game and the weather is not favourable at Seddon Park, Hamilton. In not-so-encouraging news for Indian fans, the weather forecast in Hamilton puts question marks on the match. As per the Meteorological Service of New Zealand (the national weather service of the country), there are chances of rain interrupting the second ODI on 27th November. It informs that Sunday (the match day) is likely to witness showers and then rain in the afternoon. It also states that rain can get heavy at times and there are also possibilities of thunderstorms. Notably, the rain can be eased to a few showers by evening. The match will start at 2:30 PM local time and higher chances of rain are expected in the afternoon. Also, according to AccuWeather, there is a 56% probability of precipitation in the morning. The afternoon has 94% of rain, while by the evening, the chances of rain dive to 61%. After facing a 7-wicket loss, the Indian team will have to regroup and perform better in the second ODI to stay alive in the series. 's men were outplayed in the bowling department as and Tom Latham took the Kiwis to the finishing line. India had earlier scored 306 on the small ground of Eden Park, Auckland. Shikhar Dhawan (c), , Rishabh Pant (wk), Shreyas Iyer, Suryakumar Yadav, Sanju Samson, Washington Sundar, Shardul Thakur, Umran Malik, Arshdeep Singh, , Deepak Hooda, Deepak Chahar, Finn Allen, Devon Conway, Kane Williamson (c), Tom Latham (wk), Daryl Mitchell, Glenn Phillips, , , Matt Henry, , Lockie Ferguson, Michael Bracewell, James Neesham","pubDate":"2022-11-26 11:29:05","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"PAG vs ECC Dream11 Prediction: Fantasy Cricket Tips, Today's Playing 11, Player Stats, Pitch Report for ICCA Arabian T20 League 2022, Match 42","link":"https://www.sportskeeda.com/fantasy-cricket-mantra/pag-vs-ecc-dream11-prediction-fantasy-cricket-tips-today-s-playing-11-player-stats-pitch-report-icca-arabian-t20-league-2022-match-42?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Fantasy Cricket Mantra"],"creator":["Aman Chauhan"],"video_url":null,"description":null,"content":null,"pubDate":"2022-11-26 11:27:46","image_url":"https://static.sportskeeda.com/editor/2022/11/c9da3-16694426077402-1920.jpg","source_id":"sportskeeda","country":["india"],"category":["sports"],"language":"english"},{"title":"India vs New Zealand: Rishabh Pant or Sanju Samson? Deepak Hooda or Deepak Chahar? Who comes in, who goes out?","link":"https://www.firstpost.com/firstcricket/sports-news/india-vs-new-zealand-rishabh-pant-or-sanju-samson-deepak-hooda-or-deepak-chahar-who-comes-in-who-goes-out-11700361.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"India vs New Zealand: Rishabh Pant or Sanju Samson? Deepak Hooda or Deepak Chahar? Who comes in, who goes out?","content":"Cricket India vs New Zealand: Rishabh Pant or Sanju Samson? Deepak Hooda or Deepak Chahar? Who comes in, who goes out? India trail the three-match ODI series 0-1 after they lost the first encounter at Eden Park in Auckland. FirstCricket Staff November 26th, 2022 16:32:37 IST India lost the first ODI against new Zealand. AP “An innings to remember today from Tom Latham. Always rated him as a top player but he went to another level today,” tweeted commentator Harsha Bhogle after New Zealand’s thumping 7-wicket win over India in the first ODI. There was something about Latham’s knock in Auckland where the hosts chased down a target of 307 by with 17 balls to spare. The left-handed batter’s onslaught against Shardul Thakur in the 40th over might have grabbed the limelight but it seemed that he was pretty clear about the plans right from the word go. He was a man on a mission. His first task was to steady the ship when at 88/3. The next step was to build a partnership. And, the final one was to unleash an assault especially against a bowler who is known to provide breakthroughs at crucial junctures. Hello from Hamilton 👋📍 #TeamIndia | #NZvIND pic.twitter.com/AHskNav1Vm — BCCI (@BCCI) November 26, 2022 While he respected the good deliveries, Latham didn’t shy away from dispatching the ones in the arc to the boundary ropes and eventually remained unbeaten at 145 off 104 which included five maximums and 19 fours, pretty much a T20 knock, decorated with textbook strokes. A lot of credit also goes to Kane Williamson who took his time to get settled but was glued to the crease right till the end. The right-hander scored 94* off 98. The action now shifts to Hamilton for the second ODI. Men in Blue have are in a do-or-die situation because a defeat will hand the Kiwis an unassailable lead. India didn’t really make big mistakes in the first clash barring some tactical errors. The experiment of going with five bowlers backfired as Arshdeep Singh, Umran Malik and Shardul got hit for some runs in the later stages of the run chase. Moreover, Yuzvendra Chahal failed to pick a wicket and gave away runs at an economy rate of over 6. Washington Sundar was the only bowler with an economy rate of less than 6 but he, too, remained wicket-less. Pant or Samson? Who sits out? It’s a simple equation. India need a sixth bowling option and the two most suited for the position are Deepak Hooda and Deepak Chahar. Hooda in his brief career has already scored a T20I hundred and can be used as a floater in the batting unit. Additionally, he can be used as the third spinner who can chip in with 5-6 overs or maybe 10, if and when required. Chahar, on the other hand, is someone who will bowl a full quota of 10 overs and has shown his abilities with the bat. The right-handed player has a couple of ODI fifties to his name. But the question is: who sits out if one them has to be accommodated. India included two wicket-keeper batters (Rishabh Pant & Sanju Samson) in the XI in the first match and there is a high possibility of one of them sitting out in the second fixture. The dilemmas don’t end there. Pant, being a left-handed batter and an aggressive one, brings a lot to the table. Though, the Delhi player has been out of touch, but he can score runs quickly and is brutal on his day. Meanwhile, Sanju Samson made good use of the opportunity in the first match. The visitors were in a spot of bother when Samson joined Shreyas Iyer in the middle. The two stitched a partnership of 94 runs for the fifth wicket while Samson scored 36 off 38. Moreover, he is pretty good behind the wickets too. The team management will have to take a bold decision to ask either Pant or Samson to sit out if they want to have a sixth bowling option. Kane Williamson back in groove! New Zealand skipper Kane Williamson capitalised perfectly on the chance that was thrown at him. Chasing a stiff total, the hosts certainly needed a Williamson-esque innings to go over the line. Well, he wasn’t looking in the greatest of form initially but Williamson put in all the experience and frustrated the Indian bowlers by remaining unbeaten at one end. While Latham was the one who scored runs at a brisk pace, Williamson held the fort at the other, kept rotating the strike, the scoreboard moving and eventually looked as if he was back into the groove after the right-hander pulled a couple of short deliveries to the fence. It’s a good or probably a great news for New Zealand but surely a headache for India. As far as the visitors are concerned, they will have to take some tough calls to stay alive in the series. Read all the Latest News , Trending News , Cricket News , Bollywood News , India News and Entertainment News here. Follow us on Facebook , Twitter and Instagram . Updated Date: November 26, 2022 16:32:37 IST Tags: Cricket India Vs New Zealand Find latest and upcoming tech gadgets online on Tech2 Gadgets. Get technology news, gadgets reviews & ratings. Popular gadgets including laptop, tablet and mobile specifications, features, prices, comparison.","pubDate":"2022-11-26 11:02:37","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/11/India-vs-New-Zealand-2nd-ODI-Preview-1.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"IGM vs KWN Dream11 Prediction: Fantasy Cricket Tips, Today's Playing XIs, Player Stats, Pitch Report for CBFS T10 League, Match 18","link":"https://www.sportskeeda.com/fantasy-cricket-mantra/igm-vs-kwn-dream11-prediction-fantasy-cricket-tips-today-s-playing-xis-player-stats-pitch-report-cbfs-t10-league-match-18?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Fantasy Cricket Mantra"],"creator":["Adarsh Tabhane"],"video_url":null,"description":null,"content":null,"pubDate":"2022-11-26 10:11:06","image_url":"https://static.sportskeeda.com/editor/2022/11/3bdd7-16694381915071-1920.jpg","source_id":"sportskeeda","country":["india"],"category":["sports"],"language":"english"},{"title":"'Will always be special': Virat Kohli recalls match-winning knock against Pakistan in T20 World Cup","link":"https://www.firstpost.com/firstcricket/sports-news/will-always-be-special-virat-kohli-recalls-match-winning-knock-against-pakistan-in-t20-world-cup-11700541.html","keywords":["First Cricket News"],"creator":["FP Trending"],"video_url":null,"description":"'Will always be special': Virat Kohli recalls match-winning knock against Pakistan in T20 World Cup","content":"Though Team India failed to produce the desired result in the recently-concluded T20 World Cup, it will always be close to the Indian fans because of the heroic knock of Virat Kohli in the opening encounter against their arch-rivals Pakistan. While Pakistan bowlers made things difficult in every possible way for the Indian batters, it was Kohli who came out of his shell and anchored the side across the victory line with a match-winning 82-run knock. On Saturday, the cricketer shared an emotional note on his personal Instagram referring to that crucial innings. View this post on Instagram A post shared by Virat Kohli (@virat.kohli) Kohli shared a photo of himself leaving the Melbourne Cricket Ground after the match. He captioned it, “October 23rd 2022 will always be special in my heart. Never felt energy like that in a cricket game before. What a blessed evening that was.” However, not only the first game but Kohli was also in superb form throughout the tournament. The batting maestro finished the campaign as the top scorer with 296 runs in six matches.Since being dropped on the internet, Kohli’s post has garnered nearly three lakh likes on Instagram so far. A user noted, “It will be special for each Indian,” while another individual termed the knock as “the absolute best.” As stated by a fan, “This day is forever engraved on our hearts. That ‘back-way six’ shot is possibly the best shot in the T20 format.”Winning the toss, Rohit Sharma asked Babar Azam’s side to bat first. A couple of early wickets from Ashdeep Singh put the Pakistan unit on the back foot early in the game. But the collective effort of Shan Masood and Iftikhar Ahmed took them to a comfortable position. Both batters notched up a half-century. While Masood remained unbeaten at a 42-ball 52, Ahmed concluded his innings with 51 runs off 34 deliveries. Following their remarkable efforts, Pakistan managed to post a worth-fighting total of 159 runs in the first innings.Coming in to open the innings, Rohit Sharma and KL Rahul could not pull off a strong start to the chase. It was only Kohli who stuck to the crease and the other end saw a massive collapse of the top-order batters thanks to the fiery bowling of pacer Haris Rauf. India were four-man down with just 31 runs on the board when their star all-rounder Hardik Pandya stepped onto the crease.The pair of Kohli and Pandya struggled a bit at the early stage but then tried to bring back the momentum with occasional boundaries. Their steady partnership again sparked the hope of India’s victory. Kohli went all guns blazing against the likes of Shaheen Shah Afridi, Naseem Shah and Rauf. He took down Rauf in the penultimate over with two consecutive maximums and brought the equation down to India’s favour before spinner Mohammad Nawaz was sent to bowl the final over.Nawaz started quite well and got rid of Pandya on the first delivery. But then Kohli smashed him over the boundary for a huge six and almost sealed the deal. Then Nawaz tried to turn the tables around with the wicket of new batter Dinesh Karthik. However, senior cricketer Ravichandran Ashwin held on to his nerves and registered the win with a wise scoop over the mid-off on the last ball, finally putting an end to the nail-biting battle.Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-11-26 09:22:53","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/10/IND-vs-PAK-Kohli.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Cricket Funny Video: 18 सेकंड तक भाग-भागकर थके 11 खिलाड़ी, पर नहीं कर पाए आउट, हंसते-हंसते फुल जाएगा पेट","link":"https://navbharattimes.indiatimes.com/sports/cricket/cricket-news/watch-video-funny-incident-on-cricket-ground-news-in-hindi/articleshow/95784374.cms","keywords":null,"creator":null,"video_url":null,"description":"क्रिकेट को यूं ही नहीं अनिश्चितताओं का खेल कहा जाता है। सोशल मीडिया पर आग लगा रहे इस वीडियो को ही देख लीजिए। इसमें दोनों बल्लेबाज एक ही छोर पर पहुंच जाते हैं। 18 सेकंड़ की रस्साकसी में न तो एक भी रन बनता है और न ही फील्डर रन आउट कर पाते हैं।","content":null,"pubDate":"2022-11-26 09:09:32","image_url":null,"source_id":"navbharattimes","country":["india"],"category":["sports"],"language":"hindi"},{"title":"IND vs NZ 2nd ODI: When and Where to watch India vs New Zealand live telecast","link":"https://www.firstpost.com/firstcricket/sports-news/ind-vs-nz-2nd-odi-live-streaming-when-where-how-to-watch-india-vs-new-zealand-odi-series-live-telecast-online-tv-11700751.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"IND vs NZ 2nd ODI: When and Where to watch India vs New Zealand live telecast","content":"Cricket IND vs NZ 2nd ODI: When and Where to watch India vs New Zealand live telecast IND vs NZ 2nd ODI Live Streaming: All details on how to live stream India vs New Zealand 2nd ODI 2022 and when and where to watch IND vs NZ match in India. FirstCricket Staff November 26th, 2022 14:29:37 IST India suffered a defeat in the first match. AP India and New Zealand are set to lock horns with each other in the second ODI of the three-match series in Hamilton on Sunday. The hosts presently lead the series 1-0 after thumping India by 7 wickets in the first match. Chasing a target of 307, New Zealand went over the line in the 48th over, courtesy a batting masterclass from Tom Latham. The left-handed batter struck an unbeaten 145 off 104 during the run chase. The Kiwi skipper Kane Williamson also made a vital contribution as he returned not out at 94 off 98. India now need to win this second clash to stay in the hunt. Here’s everything you need to know about watching the second ODI in India. When will second India vs New Zealand ODI be played? The India vs New Zealand second ODI will be played on 27th November 2022 (Sunday). What is the venue for second India vs New Zealand ODI? The India vs New Zealand second ODI will be played at Seddon Park, Hamilton. At what time will second India vs New Zealand ODI start? The India vs New Zealand second ODI will start at 7 AM IST, with the toss at 6.30 am IST. Where can we watch second India vs New Zealand ODI? The India vs New Zealand second ODI will be streamed live on Amazon Prime Video. It can also be watched on the DD Sports channel. You can also follow the match and scores live on Firstpost.com. How to get Amazon Prime Video subscription? For this, you will need to open an account on Amazon and then avail Prime subscription by paying a fee to watch the India-New Zealand series. India vs New Zealand ODI Squads: India: Shikhar Dhawan (c), Shubman Gill, Deepak Hooda, Suryakumar Yadav, Shreyas Iyer, Rishabh Pant (vc and wk), Sanju Samson (wk), Washington Sundar, Shardul Thakur, Yuzvendra Chahal, Kuldeep Yadav, Arshdeep Singh, Deepak Chahar, Umran Malik. New Zealand : Kane Williamson (c), Finn Allen, Michael Bracewell, Devon Conway (wk), Lockie Ferguson, Matt Henry, Tom Latham (wk), Daryl Mitchell, Adam Milne, Jimmy Neesham, Glenn Phillips, Mitchell Santner, Tim Southee, Henry Nicholls. Read all the Latest News , Trending News , Cricket News , Bollywood News , India News and Entertainment News here. Follow us on Facebook , Twitter and Instagram . Updated Date: November 26, 2022 14:29:37 IST Tags: Cricket India Vs New Zealand Find latest and upcoming tech gadgets online on Tech2 Gadgets. Get technology news, gadgets reviews & ratings. Popular gadgets including laptop, tablet and mobile specifications, features, prices, comparison.","pubDate":"2022-11-26 08:59:37","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/11/IND-vs-NZ-LIVE-Streaming-1.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"WBBL Final halted in bizarre scenes as Sydney Sixers chase against Adelaide Strikers at North Sydney Oval","link":"https://thewest.com.au/sport/cricket/wbbl-final-halted-in-bizarre-scenes-as-sydney-sixers-chase-against-adelaide-strikers-at-north-sydney-oval-c-8976866","keywords":null,"creator":["Aaron Kirby"],"video_url":null,"description":"Sydney has copped its fair share of criticism across the cricket summer so far for wet weather, but now another black mark has been put next to the coastal cities’ cricket pedigree.","content":null,"pubDate":"2022-11-26 08:43:16","image_url":"https://images.thewest.com.au/publication/C-8976866/a3f9e6b7555f76eb264c327821dcaa39dba9f208-16x9-x796y156w1818h1023.jpg","source_id":"thewest","country":["australia"],"category":["sports"],"language":"english"}]}