{"newsArray":[{"title":"Home of UK’s greatest cricket followers revealed as being proper subsequent to Lords and Edgbaston","link":"https://www.businesslend.com/sports/home-of-uks-biggest-cricket-fans-revealed-as-being-right-next-to-lords-and-edgbaston/","keywords":["Sports"],"creator":["Mirza Shehnaz"],"video_url":null,"description":"Sign as much as our free sport e-newsletter for all the most recent information on the whole lot from biking to boxing Sign as much as our free sport e-mail for all the most recent information The greatest cricket followers stay in London and the West Midlands – dwelling to 2 of the UK’s most [...] The post Home of UK’s greatest cricket followers revealed as being proper subsequent to Lords and Edgbaston appeared first on BusinessLend.","content":"The greatest cricket followers stay in London and the West Midlands – dwelling to 2 of the UK’s most well-known grounds at Lords and Edgbaston. A survey of two,000 adults discovered 61 per cent of these within the capital are followers – effectively above the nationwide common of 40 per cent. The West Midlands (44 per cent) and the North West (41 per cent) are different hotspots for the sport. And 51 per cent of 18- to 24-year-olds are cricket followers – greater than every other age group. Those aged 25 to 34-year-old got here in second, with 43 per cent self-confessed cricket lovers. Mark Vile, from value comparability web site Compare the Market, which is sponsoring The Hundred and commissioned the analysis, mentioned: “There’s a lot to like concerning the recreation of cricket. “Across the country, there’s huge support for the game, which goes from strength to strength. “From close and thrilling games to strategic gameplay and tactics, there’s something for everyone to love.” The analysis additionally discovered Londoners suppose they’ve the very best information of the sport – with 37 per cent claiming to have an excellent or good understanding. Those within the North West are additionally sufficiently brushed up on their information of bat and ball, with 26 per cent believing they’ve an excellent grasp. TV (66 per cent), sports activities web sites and apps (55 per cent) and social media (32 per cent) are the primary methods followers preserve updated with matches and occasions. It additionally emerged that among the many 33 per cent of respondents who’ve kids aged between seven and 18-years-old, simply 36 per cent reckon have a greater understanding than their youngster. And 47 per cent felt that if on-line players performed or talked concerning the recreation, their kids would grow to be extra within the sport. It comes as Compare the Market and The Hundred have teamed up with three social media video players throughout the course of the event to commentate on some key video games. Among the celebrities are Captain Puffy, SMajor and Solidarity Gaming, who’ve greater than three million followers between them throughout their social media platforms. Captain Puffy mentioned: “I didn’t know much about cricket before I got into The Hundred but I’m getting to grips with it pretty quickly and turning into quite the fan. “It’s such a fast-paced game and it’s been amazing to be a part of and educate my community along the way.” Mark Vile, from Compare the Market, added: “It has been great opening up The Hundred to a new and younger audience in this way with the help of our gamers, allowing for a new generation of fans to soak up the electrifying atmosphere the game has to offer. “We look forward to engaging more fans throughout the tournament and experiencing some world-class cricket along the way.” Mikel Arteta suggests stopwatch could also be wanted for consistency on time-wasting","pubDate":"2023-08-21 22:03:26","image_url":null,"source_id":"businesslend","source_priority":716394,"country":["india"],"category":["sports"],"language":"english"},{"title":"Katherine Sciver-Brunt bids last farewell to cricket after nearly 20 years","link":"https://www.businesslend.com/sports/katherine-sciver-brunt-bids-final-farewell-to-cricket-after-almost-20-years/","keywords":["Sports"],"creator":["Mirza Shehnaz"],"video_url":null,"description":"Sign as much as our free sport e-newsletter for all the most recent information on all the things from biking to boxing Sign as much as our free sport electronic mail for all the most recent information Katherine Sciver-Brunt has bid a last farewell to skilled cricket, within the sport’s latest format, 19 years after [...] The post Katherine Sciver-Brunt bids last farewell to cricket after nearly 20 years appeared first on BusinessLend.","content":"Katherine Sciver-Brunt has bid a last farewell to skilled cricket, within the sport’s latest format, 19 years after she made her England debut. It is just not the primary large cricketing farewell of the summer time, nor will it’s splashed throughout the headlines in the identical approach as Stuart Broad’s announcement in July, however her contributions to the game have been no much less important. Sciver-Brunt won’t be alone, as her bowling companion for thus a few years, Anya Shrubsole will even be following her into retirement, and each will play their last video games within the third version of The Hundred. Women’s cricket when Sciver-Brunt made her debut at Scarborough in 2004 was unrecognisable in comparison with the absolutely professionalised construction discovered right this moment. It was not a few years earlier than that the ladies’s staff had to purchase their very own England blazers, they usually definitely weren’t paid to signify the nation. Sciver-Brunt needed to work a number of jobs to have the ability to fund her personal profession, one thing that appears arduous to envisage when her spouse, England vice-captain Nat Sciver-Brunt earned round £340,000 in the course of the first Women’s Premier League public sale earlier this yr. Having already referred to as time on her worldwide profession firstly of the cricketing summer time, the bowler will sadly be denied a last farewell look on the Oval for the Trent Rockets resulting from an ongoing hip harm, however can have a staff celebration for the top of their event and to mark the top of her profession. “She’s pushed a lot of us to be better versions of ourselves and that’s not a trait that everyone has and I think that’s really special,” England worldwide Issy Wong instructed The Independent . “I think hopefully her legacy is that now there’s younger guys of us who will hopefully now be playing for England this summer knowing exactly what a privilege it is to play for your country and the hard work that you have to do behind the scenes to get there.” Sciver-Brunt (then Katherine Brunt) and Anya Shrubsole led England’s bowling assault for years Wong added: “She goes into every competition and fights until the very last ball. “So it’ll be really special this summer that she’ll be in The Hundred and we’ll be able to give her a good send off.” Anya Shrubsole will even finish her skilled profession after the conclusion of the event, which could possibly be within the last because the Southern Brave sit high of the factors desk. The duo will bow out having led England’s seam assault for almost all of the final decade earlier than Shrubsole’s worldwide retirement in April 2022. They have each lifted the World Cup in entrance of a sold-out Lords in 2017, and been there by means of the rise of the game from being on the margins to greater than 20,000 individuals at two T20s in the course of the Ashes and a sold-out ODI collection. While each gamers are the sort to draw back from the highlight, not less than off the sphere, it’s unlikely that their teammates will enable them to minimize the event, and one factor is for positive, it marks the top of an period within the sport. Mikel Arteta suggests stopwatch could also be wanted for consistency on time-wasting","pubDate":"2023-08-21 21:27:44","image_url":null,"source_id":"businesslend","source_priority":716394,"country":["india"],"category":["sports"],"language":"english"},{"title":"Who is Ugyen Pelzang? What we know about the identity of \"Bhutan's Babe Ruth\" who caught the attention of MLB fans with awe-inspiring hit","link":"https://www.sportskeeda.com/baseball/news-who-ugyen-pelzang-what-know-identity-bhutan-s-babe-ruth-caught-attention-mlb-fans-awe-inspiring-hit","keywords":["Baseball"],"creator":["Adrian Dorney"],"video_url":null,"description":null,"content":"19-year old Ugyen Pelzang may not be showing up on many prospects lists. However, the young baseball phenom is doing all he can to put his nation on the map. Hailing from the small Himalayan nation of Bhutan, Pelzang has shown a peculiar affinity for baseball. Recently, images of Pelzang hitting a dinger against the bucolic backdrop of his home land has garnered significant attention. Bhutan is a relatively unknown mountain Kingdom, ruled by Monarch Jigme Khesar Namgyel Wangchuck since 2006. The population is about 720,000, the vast majority of whom have a fleeting, if nonexistent, understanding of baseball. A photo of Ugyen Pelzang playing in his home nation was snapped by Matthew DeSantis. DeSantis, a diehard Boston Red Sox fan from Connecticut, lives in Bhutan, and co-founded the nation's first and only Baseball and Softball Association. Pelzang has seemingly received an athletic scholarship to his country's first private college, located in the capital city of Thimphu. DeSantis has served a critical role in establishing baseball in the mountainous Kingdom, even organizing several baseball and softball tournaments where young players can show off their skills. According to DeSantis, who has worked closely with Ugyen Pelzang, he met Wangchuck, the prince of Bhutan, while playing on his high school basketball team in Connecticut. Years later, he is one of the small country's foremost purveyors of western sports. Perhaps fans can keep a keen eye out for Pelzang on the 2030 New York Yankees . While Bhutan may indeed be one of the most remote places to hold a baseball game, Ugyen Pelzang is just further proof of a global phenomenon. In June, the Toronto Blue Jays selected Arjun Nimmala. Although he was born and raised in Florida, Nimmala credits cricket games while visiting family in India as having a profound impact on his decision to pursue baseball. At this rate, it is likely that we will see a lot more talent coming out of the Indian subcontinent. Quick Links","pubDate":"2023-08-21 18:11:58","image_url":"https://staticc.sportskeeda.com/editor/2023/08/226b3-16926228031891-1920.jpg","source_id":"sportskeeda","source_priority":172,"country":["india"],"category":["sports"],"language":"english"},{"title":"“We all know what a classy player he is” – Sunil Gavaskar backs KL Rahul to perform in 2023 Asia Cup","link":"https://www.sportskeeda.com/cricket/news-we-know-classy-player-is-sunil-gavaskar-backs-kl-rahul-perform-2023-asia-cup","keywords":["Cricket"],"creator":["James Kuanal"],"video_url":null,"description":null,"content":"Former India captain Sunil Gavaskar has backed KL Rahul, who is yet to regain 100 percent fitness for the 2023 Asia Cup, scheduled to begin later this month. The cricketer-turned-commentator said that Rahul should be given the opportunity to recover from his niggle ahead of the ODI World Cup. The statement came as the selection committee confirmed that Rahul has recovered from a thigh injury but has a slight niggle. As a precautionary measure, the Board of Control for Cricket in India (BCCI) has named wicketkeeper-batter Sanju Samson as a reserve for Rahul’s backup in India's squad for the Intercontinental tournament. Gavaskar told India Today: He added: He continued: For the uninitiated, Rahul recently missed out on the recently concluded three-match ODI series in West Indies as well as several games for Lucknow Super Giants in the Indian Premier League. The right-handed batter has played a couple of match-winning knocks in the 50-over format earlier this year. The 31-year-old scored half-centuries against Sri Lanka (64* off 103 balls) and Australia (75* off 91) at home to take the Men in Blue past the finish line. Sunil Gavaskar feels that lifting weights in the gym is the primary reason behind players’ back injuries. The 74-year-old wants the players to be cricket fit instead of being gym fit. On this, he said: Gavaskar added: He continued: For the uninitiated, Jasprit Bumrah missed out on competitive cricket for almost 11 months due to a back injury. Shreyas Iyer too missed a lot of action in the last six months due to a recurring back injury. Quick Links","pubDate":"2023-08-21 17:42:17","image_url":"https://staticc.sportskeeda.com/editor/2023/08/f8407-16926201957308-1920.jpg","source_id":"sportskeeda","source_priority":172,"country":["india"],"category":["sports"],"language":"english"},{"title":"'I Am Not Cutting My Hair...', When Aakash Chopra Asked Long Haired MS Dhoni To Get A Haircut","link":"https://zeenews.india.com/cricket/when-aakash-chopra-asked-long-haired-ms-dhoni-to-get-a-haircut-in-2004-2651911.html","keywords":null,"creator":null,"video_url":null,"description":"Chopra also shared an incident that highlighted Dhoni's determination to be himself. He had suggested to the junior player that he should cut his hair to be taken more seriously in cricket.","content":"In the realm of cricketing legends, MS Dhoni's name shines brilliantly. His remarkable career, filled with astonishing victories and brilliant leadership, continues to inspire cricket enthusiasts worldwide. However, as former Indian Test opener Aakash Chopra fondly recalls, there was a time when the world had yet to realize the unassuming greatness of Dhoni. Chopra, now a prominent cricket commentator and content creator, recently delved into the archives of his memories on his YouTube channel, Aakash Vani. He shared an endearing anecdote from 2004, when he and Dhoni were both part of India A's squad touring Zimbabwe and Kenya. As roommates during the tour, Chopra was initially taken aback by Dhoni's appearance. The young wicketkeeper, known for his long locks, might have appeared to be a stereotypical \"cool dude\" of that era. However, Dhoni's simplicity and cordiality surprised Chopra, challenging his initial assumptions. MS Dhoni's international cricket journey started in 2004 at Chittagong against Bangladesh where he became India's 157th ODI cricketer. #ThankYouMSDhoni pic.twitter.com/oPBjclVFSX — BCCI (@BCCI) August 16, 2020 Also Read: Meet Chacha Cricket: Pakistan's Beloved Cricket Ambassador Who Is A Big Fan Of Virat Kohli Chopra humorously recounted his expectations, saying, \"To say frankly, I had not expected such cordiality from this long-haired cool dude. I thought that upon asking what he would like to eat, he would say, 'You leave it, I will only order’ or upon asking when he would sleep, he would say ‘I sleep late you can put the bedsheet on your face and sleep'.\" This unexpected simplicity was not a sign of underconfidence, as Chopra explained. He emphasized that Dhoni's demeanour was deceiving, stating, \"One may mistake simplicity for underconfidence. But this is not the case for Dhoni. Inke dikhane ke daant aur khane ke daant kuch aur hain\" (His looks are deceptive). Chopra also shared an incident that highlighted Dhoni's determination to be himself. He had suggested to the junior player that he should cut his hair to be taken more seriously in cricket. In response, Dhoni resolutely declined, saying, \"I am not cutting my hair, probably people might grow their hair after seeing me.\" Little did anyone know that Dhoni's hairstyle would eventually become a nationwide trend, especially after he captained the young Indian team to victory in the inaugural T20 World Cup in 2007. Dhoni retired from international cricket in August 2020, leaving behind a legacy that includes being one of India's greatest cricketers and one of the world's best limited-overs captains. He remains the only captain to have led his side to victories in all three major ICC limited-overs events. Aakash Chopra's heartwarming reminiscence not only sheds light on Dhoni's unassuming personality but also serves as a testament to the enduring friendships forged through the beautiful game of cricket. As fans, we are grateful for such stories that allow us to glimpse the human side of our cricketing heroes, making them all the more cherished and relatable.","pubDate":"2023-08-21 17:28:00","image_url":null,"source_id":"zeenews","source_priority":5319,"country":["india"],"category":["sports"],"language":"english"},{"title":"\"Player that I think is lucky to be in that side is Suryakumar Yadav\" - Tom Moody on Team India's Asia Cup 2023 squad","link":"https://www.sportskeeda.com/cricket/news-player-i-think-lucky-side-suryakumar-yadav-tom-moody-team-india-s-asia-cup-2023-squad","keywords":["Cricket"],"creator":["Venkatesh Ravichandran"],"video_url":null,"description":null,"content":"Former Australian all-rounder Tom Moody felt that middle-order batter Suryakumar Yadav was fortunate to be selected in the 17-member squad for the Asia Cup. The Board of Control for Cricket in India (BCCI) selection committee announced the squad for the continental tournament earlier today (August 21). While it featured a plethora of batters, including the return of the injured KL Rahul and Shreyas Iyer, several eyebrows were raised at the selection of Suryakumar. The 32-year-old has struggled in the 50-over format, averaging 24.33 in 26 games, including a paltry 14.11 in 2023. Speaking to Star Sports, Tom Moody was surprised at the selection of the Mumbai Indians (MI) star. The former Australian cricketer felt the Men in Blue could have instead opted for a younger player like Yashasvi Jaiswal or an additional wrist spinner. Team India has picked the lone wrist spinner in Kuldeep Yadav , with the other half of the 'Kulcha' combination, Yuzvendra Chahal, left out. Meanwhile, Yashasvi Jaiswal is yet to make his ODI debut but made an immediate impression in the longer format, scoring 171 in his maiden innings against the West Indies. The southpaw has also played five T20Is since the West Indies series, including the ongoing Ireland rubber. Tom Moody further stated that despite Suryakumar Yadav being a master at the T20 format, the 50-over format is a different ball game that cannot be cracked at the 11th hour. The 32-year-old is the world's no.1 ranked T20I batter, with an extraordinary average of 46.02 and a strike rate of 172.70, including three centuries. Suryakumar's middle-order competitor Sanju Samson boasts impressive numbers in the ODI format, with an average of 55.71 in 13 games. Yet, an inconsistent showing in the white-ball leg of the recent West Indies tour has left the batter looking on from the outside as the reserve player in the squad. The Asia Cup commences with a group A fixture between Pakistan and Nepal on August 30. Rohit Sharma's men will open their campaign against arch-rivals Pakistan on September 2 at Pallekele. Quick Links","pubDate":"2023-08-21 17:25:00","image_url":"https://staticc.sportskeeda.com/editor/2023/08/e9230-16926190314143-1920.jpg","source_id":"sportskeeda","source_priority":172,"country":["india"],"category":["sports"],"language":"english"},{"title":"Asia Cup 2023: Sunil Gavaskar reacts to Sanju Samson-Yuzvendra Chahal's exclusion from India's squad","link":"https://www.dnaindia.com/cricket/report-asia-cup-2023-sunil-gavaskar-reacts-to-sanju-samson-yuzvendra-chahal-s-exclusion-from-indias-squad-sports-news-3056719","keywords":["Sports","Cricket"],"creator":["DNA  Web Team"],"video_url":null,"description":"India's squad for the Asia Cu 2023 was unveiled on Monday triggering waves of discussion. Legendary cricketer Sunil Gavaskar has also voiced his thoughts on the same. Read details here.","content":"The unveiling of India's squad for the 2023 Asia Cup created ripples of discussion, with one of the focal points being the surprising relegation of Sanju Samson to a backup role. Samson's recent performances in India's matches against the West Indies had been a mixture of promise and inconsistency. His contributions in the T20I series were lackluster, and he was given the chance to display his skills in just two out of three ODIs leading up to the announcement. Sunil Gavaskar, a cricket legend of India, voiced his thoughts on Samson's situation, suggesting that a more consistent showing in recent games could have secured him a definitive spot in the squad. Gavaskar also delved into the absence of Yuzvendra Chahal from the team, attributing both cases to multifaceted factors rather than mere form. In an interview with India Today, Gavaskar emphasized the selectors' challenge in maintaining the team's equilibrium while considering variables such as fielding prowess and batting capabilities. He pointed out the intriguing example of Kuldeep Yadav, who's preferred for his batting abilities down the order, as opposed to Chahal. Likewise, Gavaskar underscored Samson's versatility as an all-rounder, capable of keeping wickets, and acknowledged the possibility of Samson making future appearances for India, considering his relatively young age. Gavaskar expressed his conviction in the current team's strength and urged support for the selected players, emphasizing that Samson's journey was far from over despite the current setback. Read: ‘Virat Kohli is best batter in world': Shikhar Dhawan names his 'dream team' for ICC Men's World Cup, top 5 includes... Chahal, who was left out of the squad, chose to respond via a cryptic tweet reminiscent of a message shared by Captain Rohit Sharma back in 2018 when Chahal was omitted from India's series against England. The tweet read, \"Tough one to take, yes. Stay at it. The sun will rise again. We Keep Trying.\" The message was met with supportive responses from the cricket community, with fans rallying behind Chahal. One user reassured him, \"Don't Worry Yuzi Bhaiya, the Best Is Yet To Come,\" underlining the anticipation for Chahal's future exploits. As the cricketing world absorbed these developments, the conversations surrounding Samson's near-miss and Chahal's exclusion continued to simmer, underscoring the depth of talent and tough decisions that characterize the world of international cricket. .","pubDate":"2023-08-21 17:23:32","image_url":null,"source_id":"dnaindia","source_priority":18388,"country":["india"],"category":["sports"],"language":"english"},{"title":"BCCI tells HCA no further changes in World Cup schedule possible, Hyderabad will have to host back-to-back games","link":"https://www.firstpost.com/firstcricket/sports-news/bcci-tells-hca-no-further-changes-in-world-cup-schedule-possible-hyderabad-will-have-to-host-back-to-back-games-13023912.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"BCCI tells HCA no further changes in World Cup schedule possible, Hyderabad will have to host back-to-back games","content":"Cricket BCCI tells HCA no further changes in World Cup schedule possible, Hyderabad will have to host back-to-back games The HCA had appealed to the BCCI for a change in schedule after the local police authorities expressed their reservations about deploying adequate personnel on back-to-back match days. FirstCricket Staff Last Updated:August 21, 2023 22:53:15 IST General view of Hyderabad's Rajiv Gandhi International Stadium. Sportzpics Photo by Faheem Hussain - Sportzpics - IPL The Board of Control for Cricket in India (BCCI) on Monday told the Hyderabad Cricket Association (HCA) it would have to host back-to-back games in the upcoming ICC World Cup as there was no scope for further changes. The HCA had appealed to the BCCI for a change in schedule after the local police authorities expressed their reservations about deploying adequate personnel on back-to-back match days. “BCCI secretary Jay Shah held a meeting with HCA officials in Delhi after the Asia Cup team selection meeting (for which the secretary is convenor) and the state unit was categorically told that no changes would be entertained after a revised schedule was issued on August 9,” a BCCI source informed. Related Articles Ben Stokes reversing ODI retirement was his call, no point badgering him, says Jos Buttler ODI World Cup tickets to go on sale on 25 August; sales to take place in seven phases The BCCI vice-president Rajeev Shukla had already indicated on Sunday that “changes (to the schedule) were unlikely.” The World Cup schedule, which was first released on 27 June in Mumbai amidst fanfare, went through a lot of changes with dates and timings of as many as nine games, including the marquee India vs Pakistan clash. The Indo-Pak match was originally scheduled for 15 October, but the game was advanced by a day because it was slotted on the first day of Navratra. Also Read | Full list of Matches, Dates, Venues in revised World Cup schedule This particular change in schedule led to Pakistan’s game against Sri Lanka in Hyderabad being advanced by a day from 11 to 10 October. Hyderabad was also hosting Netherlands’ game against New Zealand on 9 October. Hence, the local police officials had asked for at least a day’s gap between the two games. However, that would have meant slotting the New Zealand vs Netherlands game on 8 October. It would have put a lot of stress on the teams and both the countries wouldn’t have agreed upon. New Zealand are playing England in the opening game on 5 October in Ahmedabad and the next day they will fly to Hyderabad and would have received only one training session (on 7 October) in that case. Netherlands open their campaign against Pakistan on 6 October in Hyderabad and advancement by a day meant that 7 October would go in recovery and next day they would be playing again. Neither ICC nor the two boards (NZC and Netherlands authority known as KNCB) would have agreed to this request. With inputs from PTI Published on: August 21, 2023 22:53:15 IST Tags: Bcci Cricket Hca Hyderabad Cricket Association","pubDate":"2023-08-21 17:23:15","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/09/Rajiv-Gandhi-International-Stadium-general-view-IPL-2017-Sportzpics-640.jpg","source_id":"firstpost","source_priority":5906,"country":["india"],"category":["sports"],"language":"english"},{"title":"Meet Praggnanandhaa, the Indian chess grandmaster, who is within touching distance of history at FIDE World Cup","link":"https://www.hindustantimes.com/sports/others/who-is-praggnanandhaa-the-indian-chess-grandmaster-within-touching-distance-of-history-at-fide-world-cup-101692633041815.html","keywords":null,"creator":null,"video_url":null,"description":"Praggnanandhaa became the first Indian to reach the finals of chess World Cup after Viswanathan Anand.","content":"India have been blessed with quiet a few rising talents in chess and the one currently making headlines globally is 18-year-old Rameshbabu Praggnanandhaa. The Indian prodigy on Monday stunned world number three Fabiano Caruana in the tiebreaks to reach the final of the ongoing FIDE World Cup in Baku, Azerbaijan, where he will meet world number one Magnus Carlsen. India chess player Praggnanandhaa and Fabiano Caruana(PTI) Praggnanandhaa closed the semifinal with a 3.5-2.5 win, also officially sealing a place in the Candidates 2024 tournament, which will be held in Canada . He is also the third youngest player after legendary Bobby Fischer and Carlsen to qualify for the Candidates tournament. Praggnanandhaa also became the first Indian to reach the finals of Chess World Cup in over two decades. Viswanathan Anand, one of the most popular names in Indian chess community, had won the first two World Cups back in 2000 and 2002. Anand was quick to celebrate Praggnanandhaa's incredible feat as he tweeted: “Pragg goes through to the final! He beats Fabiano Caruana in the tiebreak and will face Magnus Carlsen now. What a performance!” Praggnanandhaa's rich CV Born in August 10, 2005, Praggnanandhaa hails from the southern coastal city of Chennai. Praggnanandhaa rose through the ranks at a very young age and became the youngest International Master at the age of 10 years, 10 months and 19 days. Two years later, Praggnanandhaa became the second-youngest Grandmaster in 2018, a record which was broken by fellow Indian D Gukesh in 2019. Prior to that Praggnanandhaa had won the World Youth Chess Championships Under-8 title in 2013, also making him a FIDE Master when he just seven. He then won the Under-10 title in 2015. He had also produced a sensational show against Carlsen last year, beating the Norwegian chess grandmaster three consecutive times in rapid and blitz. In an interaction with Indian Express back in 2016, Praggnanandhaa's coach RB Ramesh had noted: “He has a fantastic memory, which lets him remember his old matches. He knows the mistakes he's made without being told. The way he analyses his games is way beyond his years.” Chess runs in Praggnanandhaa's family The young prodigy, who mostly remains away from social media, calls five-time world champion and India’s first Grandmaster Viswanathan Anand as his inspiration. He is the brother of Vaishali Rameshbabu, also a chess player. Four years elder to Praggnanandhaa, Vaishali was born in June 21, 2001 and has previously won the Girls' World Youth Chess Championship for Under-14s and Under-12s. She added the Woman International Master's title to her CV in 2016. The brother-sister duo had won bronze medals in the individual events at the Chess Olympiad held last year in Chennai. SHARE THIS ARTICLE ON ABOUT THE AUTHOR HT Sports Desk At HT Sports Desk, passionate reporters work round the clock to provide detailed updates from the world of sports. Expect nuanced match reports, previews,reviews, technical analysis based on statistics, the latest social media trends, expert opinions on cricket, football, tennis, badminton, hockey,motorsports, wrestling, boxing, shooting, athletics and much more. ...view detail Topics Fabiano Caruana","pubDate":"2023-08-21 17:16:29","image_url":"https://www.hindustantimes.com/ht-img/img/2023/08/21/1600x900/PTI08-21-2023-000263A-0_1692637982354_1692638011674.jpg","source_id":"hindustantimes","source_priority":933,"country":["india"],"category":["sports"],"language":"english"},{"title":"BCCI Rejects Hyderabad Cricket Association Proposal To Make Changes In ICC World Cup 2023 Schedule","link":"https://www.thetimesofbengal.com/sports/bcci-rejects-hyderabad-cricket-association-proposal-to-make-changes-in-icc-world-cup-2023-schedule/?utm_source=rss&utm_medium=rss&utm_campaign=bcci-rejects-hyderabad-cricket-association-proposal-to-make-changes-in-icc-world-cup-2023-schedule","keywords":["Sports"],"creator":["admin"],"video_url":null,"description":"“BCCI secretary Jay Shah held a meeting with HCA officials in Delhi after the Asia...","content":"The BCCI vice-president Rajeev Shukla had already indicated on Sunday that “changes (to the schedule) were unlikely.” The World Cup schedule, which was first released on June 27 in Mumbai amidst fanfare, went through a lot of changes with dates and timings of as many as nine games, including the marquee India vs Pakistan clash. The Indo-Pak match was originally scheduled for October 15, but the game was advanced by a day because it was slotted on the first day of Navratri. This particular change in schedule led to Pakistan’s game against Sri Lanka in Hyderabad being advanced by a day from October 11 to 10. Hyderabad was also hosting Netherlands’ game against New Zealand on October 9. Hence, the local police officials had asked for at least a day’s gap between the two games. However, that would have meant slotting the New Zealand vs Netherlands game on October 8. It would have put a lot of stress on the teams and both the countries wouldn’t have agreed upon. New Zealand are playing England in the opening game on October 5 in Ahmedabad and the next day they will fly to Hyderabad and would have received only one training session (on October 7) in that case. Netherlands open their campaign against Pakistan on October 6 in Hyderabad and advancement by a day meant that October 7 would go in recovery and next day they would be playing again. Neither ICC nor the two boards (NZC and Netherlands authority known as KNCB) would have agreed to this request. (With PTI Inputs)","pubDate":"2023-08-21 17:14:03","image_url":null,"source_id":"the_tob","source_priority":23459906,"country":["india"],"category":["sports"],"language":"english"},{"title":"Home of UK’s greatest cricket followers revealed as being proper subsequent to Lords and Edgbaston","link":"https://www.businesslend.com/sports/home-of-uks-biggest-cricket-fans-revealed-as-being-right-next-to-lords-and-edgbaston/","keywords":["Sports"],"creator":["Mirza Shehnaz"],"video_url":null,"description":"Sign as much as our free sport e-newsletter for all the most recent information on the whole lot from biking to boxing Sign as much as our free sport e-mail for all the most recent information The greatest cricket followers stay in London and the West Midlands – dwelling to 2 of the UK’s most [...] The post Home of UK’s greatest cricket followers revealed as being proper subsequent to Lords and Edgbaston appeared first on BusinessLend.","content":"The greatest cricket followers stay in London and the West Midlands – dwelling to 2 of the UK’s most well-known grounds at Lords and Edgbaston. A survey of two,000 adults discovered 61 per cent of these within the capital are followers – effectively above the nationwide common of 40 per cent. The West Midlands (44 per cent) and the North West (41 per cent) are different hotspots for the sport. And 51 per cent of 18- to 24-year-olds are cricket followers – greater than every other age group. Those aged 25 to 34-year-old got here in second, with 43 per cent self-confessed cricket lovers. Mark Vile, from value comparability web site Compare the Market, which is sponsoring The Hundred and commissioned the analysis, mentioned: “There’s a lot to like concerning the recreation of cricket. “Across the country, there’s huge support for the game, which goes from strength to strength. “From close and thrilling games to strategic gameplay and tactics, there’s something for everyone to love.” The analysis additionally discovered Londoners suppose they’ve the very best information of the sport – with 37 per cent claiming to have an excellent or good understanding. Those within the North West are additionally sufficiently brushed up on their information of bat and ball, with 26 per cent believing they’ve an excellent grasp. TV (66 per cent), sports activities web sites and apps (55 per cent) and social media (32 per cent) are the primary methods followers preserve updated with matches and occasions. It additionally emerged that among the many 33 per cent of respondents who’ve kids aged between seven and 18-years-old, simply 36 per cent reckon have a greater understanding than their youngster. And 47 per cent felt that if on-line players performed or talked concerning the recreation, their kids would grow to be extra within the sport. It comes as Compare the Market and The Hundred have teamed up with three social media video players throughout the course of the event to commentate on some key video games. Among the celebrities are Captain Puffy, SMajor and Solidarity Gaming, who’ve greater than three million followers between them throughout their social media platforms. Captain Puffy mentioned: “I didn’t know much about cricket before I got into The Hundred but I’m getting to grips with it pretty quickly and turning into quite the fan. “It’s such a fast-paced game and it’s been amazing to be a part of and educate my community along the way.” Mark Vile, from Compare the Market, added: “It has been great opening up The Hundred to a new and younger audience in this way with the help of our gamers, allowing for a new generation of fans to soak up the electrifying atmosphere the game has to offer. “We look forward to engaging more fans throughout the tournament and experiencing some world-class cricket along the way.” Mikel Arteta suggests stopwatch could also be wanted for consistency on time-wasting","pubDate":"2023-08-21 22:03:26","image_url":null,"source_id":"businesslend","source_priority":716394,"country":["india"],"category":["sports"],"language":"english"},{"title":"Katherine Sciver-Brunt bids last farewell to cricket after nearly 20 years","link":"https://www.businesslend.com/sports/katherine-sciver-brunt-bids-final-farewell-to-cricket-after-almost-20-years/","keywords":["Sports"],"creator":["Mirza Shehnaz"],"video_url":null,"description":"Sign as much as our free sport e-newsletter for all the most recent information on all the things from biking to boxing Sign as much as our free sport electronic mail for all the most recent information Katherine Sciver-Brunt has bid a last farewell to skilled cricket, within the sport’s latest format, 19 years after [...] The post Katherine Sciver-Brunt bids last farewell to cricket after nearly 20 years appeared first on BusinessLend.","content":"Katherine Sciver-Brunt has bid a last farewell to skilled cricket, within the sport’s latest format, 19 years after she made her England debut. It is just not the primary large cricketing farewell of the summer time, nor will it’s splashed throughout the headlines in the identical approach as Stuart Broad’s announcement in July, however her contributions to the game have been no much less important. Sciver-Brunt won’t be alone, as her bowling companion for thus a few years, Anya Shrubsole will even be following her into retirement, and each will play their last video games within the third version of The Hundred. Women’s cricket when Sciver-Brunt made her debut at Scarborough in 2004 was unrecognisable in comparison with the absolutely professionalised construction discovered right this moment. It was not a few years earlier than that the ladies’s staff had to purchase their very own England blazers, they usually definitely weren’t paid to signify the nation. Sciver-Brunt needed to work a number of jobs to have the ability to fund her personal profession, one thing that appears arduous to envisage when her spouse, England vice-captain Nat Sciver-Brunt earned round £340,000 in the course of the first Women’s Premier League public sale earlier this yr. Having already referred to as time on her worldwide profession firstly of the cricketing summer time, the bowler will sadly be denied a last farewell look on the Oval for the Trent Rockets resulting from an ongoing hip harm, however can have a staff celebration for the top of their event and to mark the top of her profession. “She’s pushed a lot of us to be better versions of ourselves and that’s not a trait that everyone has and I think that’s really special,” England worldwide Issy Wong instructed The Independent . “I think hopefully her legacy is that now there’s younger guys of us who will hopefully now be playing for England this summer knowing exactly what a privilege it is to play for your country and the hard work that you have to do behind the scenes to get there.” Sciver-Brunt (then Katherine Brunt) and Anya Shrubsole led England’s bowling assault for years Wong added: “She goes into every competition and fights until the very last ball. “So it’ll be really special this summer that she’ll be in The Hundred and we’ll be able to give her a good send off.” Anya Shrubsole will even finish her skilled profession after the conclusion of the event, which could possibly be within the last because the Southern Brave sit high of the factors desk. The duo will bow out having led England’s seam assault for almost all of the final decade earlier than Shrubsole’s worldwide retirement in April 2022. They have each lifted the World Cup in entrance of a sold-out Lords in 2017, and been there by means of the rise of the game from being on the margins to greater than 20,000 individuals at two T20s in the course of the Ashes and a sold-out ODI collection. While each gamers are the sort to draw back from the highlight, not less than off the sphere, it’s unlikely that their teammates will enable them to minimize the event, and one factor is for positive, it marks the top of an period within the sport. Mikel Arteta suggests stopwatch could also be wanted for consistency on time-wasting","pubDate":"2023-08-21 21:27:44","image_url":null,"source_id":"businesslend","source_priority":716394,"country":["india"],"category":["sports"],"language":"english"},{"title":"Who is Ugyen Pelzang? What we know about the identity of \"Bhutan's Babe Ruth\" who caught the attention of MLB fans with awe-inspiring hit","link":"https://www.sportskeeda.com/baseball/news-who-ugyen-pelzang-what-know-identity-bhutan-s-babe-ruth-caught-attention-mlb-fans-awe-inspiring-hit","keywords":["Baseball"],"creator":["Adrian Dorney"],"video_url":null,"description":null,"content":"19-year old Ugyen Pelzang may not be showing up on many prospects lists. However, the young baseball phenom is doing all he can to put his nation on the map. Hailing from the small Himalayan nation of Bhutan, Pelzang has shown a peculiar affinity for baseball. Recently, images of Pelzang hitting a dinger against the bucolic backdrop of his home land has garnered significant attention. Bhutan is a relatively unknown mountain Kingdom, ruled by Monarch Jigme Khesar Namgyel Wangchuck since 2006. The population is about 720,000, the vast majority of whom have a fleeting, if nonexistent, understanding of baseball. A photo of Ugyen Pelzang playing in his home nation was snapped by Matthew DeSantis. DeSantis, a diehard Boston Red Sox fan from Connecticut, lives in Bhutan, and co-founded the nation's first and only Baseball and Softball Association. Pelzang has seemingly received an athletic scholarship to his country's first private college, located in the capital city of Thimphu. DeSantis has served a critical role in establishing baseball in the mountainous Kingdom, even organizing several baseball and softball tournaments where young players can show off their skills. According to DeSantis, who has worked closely with Ugyen Pelzang, he met Wangchuck, the prince of Bhutan, while playing on his high school basketball team in Connecticut. Years later, he is one of the small country's foremost purveyors of western sports. Perhaps fans can keep a keen eye out for Pelzang on the 2030 New York Yankees . While Bhutan may indeed be one of the most remote places to hold a baseball game, Ugyen Pelzang is just further proof of a global phenomenon. In June, the Toronto Blue Jays selected Arjun Nimmala. Although he was born and raised in Florida, Nimmala credits cricket games while visiting family in India as having a profound impact on his decision to pursue baseball. At this rate, it is likely that we will see a lot more talent coming out of the Indian subcontinent. Quick Links","pubDate":"2023-08-21 18:11:58","image_url":"https://staticc.sportskeeda.com/editor/2023/08/226b3-16926228031891-1920.jpg","source_id":"sportskeeda","source_priority":172,"country":["india"],"category":["sports"],"language":"english"},{"title":"“We all know what a classy player he is” – Sunil Gavaskar backs KL Rahul to perform in 2023 Asia Cup","link":"https://www.sportskeeda.com/cricket/news-we-know-classy-player-is-sunil-gavaskar-backs-kl-rahul-perform-2023-asia-cup","keywords":["Cricket"],"creator":["James Kuanal"],"video_url":null,"description":null,"content":"Former India captain Sunil Gavaskar has backed KL Rahul, who is yet to regain 100 percent fitness for the 2023 Asia Cup, scheduled to begin later this month. The cricketer-turned-commentator said that Rahul should be given the opportunity to recover from his niggle ahead of the ODI World Cup. The statement came as the selection committee confirmed that Rahul has recovered from a thigh injury but has a slight niggle. As a precautionary measure, the Board of Control for Cricket in India (BCCI) has named wicketkeeper-batter Sanju Samson as a reserve for Rahul’s backup in India's squad for the Intercontinental tournament. Gavaskar told India Today: He added: He continued: For the uninitiated, Rahul recently missed out on the recently concluded three-match ODI series in West Indies as well as several games for Lucknow Super Giants in the Indian Premier League. The right-handed batter has played a couple of match-winning knocks in the 50-over format earlier this year. The 31-year-old scored half-centuries against Sri Lanka (64* off 103 balls) and Australia (75* off 91) at home to take the Men in Blue past the finish line. Sunil Gavaskar feels that lifting weights in the gym is the primary reason behind players’ back injuries. The 74-year-old wants the players to be cricket fit instead of being gym fit. On this, he said: Gavaskar added: He continued: For the uninitiated, Jasprit Bumrah missed out on competitive cricket for almost 11 months due to a back injury. Shreyas Iyer too missed a lot of action in the last six months due to a recurring back injury. Quick Links","pubDate":"2023-08-21 17:42:17","image_url":"https://staticc.sportskeeda.com/editor/2023/08/f8407-16926201957308-1920.jpg","source_id":"sportskeeda","source_priority":172,"country":["india"],"category":["sports"],"language":"english"},{"title":"'I Am Not Cutting My Hair...', When Aakash Chopra Asked Long Haired MS Dhoni To Get A Haircut","link":"https://zeenews.india.com/cricket/when-aakash-chopra-asked-long-haired-ms-dhoni-to-get-a-haircut-in-2004-2651911.html","keywords":null,"creator":null,"video_url":null,"description":"Chopra also shared an incident that highlighted Dhoni's determination to be himself. He had suggested to the junior player that he should cut his hair to be taken more seriously in cricket.","content":"In the realm of cricketing legends, MS Dhoni's name shines brilliantly. His remarkable career, filled with astonishing victories and brilliant leadership, continues to inspire cricket enthusiasts worldwide. However, as former Indian Test opener Aakash Chopra fondly recalls, there was a time when the world had yet to realize the unassuming greatness of Dhoni. Chopra, now a prominent cricket commentator and content creator, recently delved into the archives of his memories on his YouTube channel, Aakash Vani. He shared an endearing anecdote from 2004, when he and Dhoni were both part of India A's squad touring Zimbabwe and Kenya. As roommates during the tour, Chopra was initially taken aback by Dhoni's appearance. The young wicketkeeper, known for his long locks, might have appeared to be a stereotypical \"cool dude\" of that era. However, Dhoni's simplicity and cordiality surprised Chopra, challenging his initial assumptions. MS Dhoni's international cricket journey started in 2004 at Chittagong against Bangladesh where he became India's 157th ODI cricketer. #ThankYouMSDhoni pic.twitter.com/oPBjclVFSX — BCCI (@BCCI) August 16, 2020 Also Read: Meet Chacha Cricket: Pakistan's Beloved Cricket Ambassador Who Is A Big Fan Of Virat Kohli Chopra humorously recounted his expectations, saying, \"To say frankly, I had not expected such cordiality from this long-haired cool dude. I thought that upon asking what he would like to eat, he would say, 'You leave it, I will only order’ or upon asking when he would sleep, he would say ‘I sleep late you can put the bedsheet on your face and sleep'.\" This unexpected simplicity was not a sign of underconfidence, as Chopra explained. He emphasized that Dhoni's demeanour was deceiving, stating, \"One may mistake simplicity for underconfidence. But this is not the case for Dhoni. Inke dikhane ke daant aur khane ke daant kuch aur hain\" (His looks are deceptive). Chopra also shared an incident that highlighted Dhoni's determination to be himself. He had suggested to the junior player that he should cut his hair to be taken more seriously in cricket. In response, Dhoni resolutely declined, saying, \"I am not cutting my hair, probably people might grow their hair after seeing me.\" Little did anyone know that Dhoni's hairstyle would eventually become a nationwide trend, especially after he captained the young Indian team to victory in the inaugural T20 World Cup in 2007. Dhoni retired from international cricket in August 2020, leaving behind a legacy that includes being one of India's greatest cricketers and one of the world's best limited-overs captains. He remains the only captain to have led his side to victories in all three major ICC limited-overs events. Aakash Chopra's heartwarming reminiscence not only sheds light on Dhoni's unassuming personality but also serves as a testament to the enduring friendships forged through the beautiful game of cricket. As fans, we are grateful for such stories that allow us to glimpse the human side of our cricketing heroes, making them all the more cherished and relatable.","pubDate":"2023-08-21 17:28:00","image_url":null,"source_id":"zeenews","source_priority":5319,"country":["india"],"category":["sports"],"language":"english"},{"title":"\"Player that I think is lucky to be in that side is Suryakumar Yadav\" - Tom Moody on Team India's Asia Cup 2023 squad","link":"https://www.sportskeeda.com/cricket/news-player-i-think-lucky-side-suryakumar-yadav-tom-moody-team-india-s-asia-cup-2023-squad","keywords":["Cricket"],"creator":["Venkatesh Ravichandran"],"video_url":null,"description":null,"content":"Former Australian all-rounder Tom Moody felt that middle-order batter Suryakumar Yadav was fortunate to be selected in the 17-member squad for the Asia Cup. The Board of Control for Cricket in India (BCCI) selection committee announced the squad for the continental tournament earlier today (August 21). While it featured a plethora of batters, including the return of the injured KL Rahul and Shreyas Iyer, several eyebrows were raised at the selection of Suryakumar. The 32-year-old has struggled in the 50-over format, averaging 24.33 in 26 games, including a paltry 14.11 in 2023. Speaking to Star Sports, Tom Moody was surprised at the selection of the Mumbai Indians (MI) star. The former Australian cricketer felt the Men in Blue could have instead opted for a younger player like Yashasvi Jaiswal or an additional wrist spinner. Team India has picked the lone wrist spinner in Kuldeep Yadav , with the other half of the 'Kulcha' combination, Yuzvendra Chahal, left out. Meanwhile, Yashasvi Jaiswal is yet to make his ODI debut but made an immediate impression in the longer format, scoring 171 in his maiden innings against the West Indies. The southpaw has also played five T20Is since the West Indies series, including the ongoing Ireland rubber. Tom Moody further stated that despite Suryakumar Yadav being a master at the T20 format, the 50-over format is a different ball game that cannot be cracked at the 11th hour. The 32-year-old is the world's no.1 ranked T20I batter, with an extraordinary average of 46.02 and a strike rate of 172.70, including three centuries. Suryakumar's middle-order competitor Sanju Samson boasts impressive numbers in the ODI format, with an average of 55.71 in 13 games. Yet, an inconsistent showing in the white-ball leg of the recent West Indies tour has left the batter looking on from the outside as the reserve player in the squad. The Asia Cup commences with a group A fixture between Pakistan and Nepal on August 30. Rohit Sharma's men will open their campaign against arch-rivals Pakistan on September 2 at Pallekele. Quick Links","pubDate":"2023-08-21 17:25:00","image_url":"https://staticc.sportskeeda.com/editor/2023/08/e9230-16926190314143-1920.jpg","source_id":"sportskeeda","source_priority":172,"country":["india"],"category":["sports"],"language":"english"},{"title":"Asia Cup 2023: Sunil Gavaskar reacts to Sanju Samson-Yuzvendra Chahal's exclusion from India's squad","link":"https://www.dnaindia.com/cricket/report-asia-cup-2023-sunil-gavaskar-reacts-to-sanju-samson-yuzvendra-chahal-s-exclusion-from-indias-squad-sports-news-3056719","keywords":["Sports","Cricket"],"creator":["DNA  Web Team"],"video_url":null,"description":"India's squad for the Asia Cu 2023 was unveiled on Monday triggering waves of discussion. Legendary cricketer Sunil Gavaskar has also voiced his thoughts on the same. Read details here.","content":"The unveiling of India's squad for the 2023 Asia Cup created ripples of discussion, with one of the focal points being the surprising relegation of Sanju Samson to a backup role. Samson's recent performances in India's matches against the West Indies had been a mixture of promise and inconsistency. His contributions in the T20I series were lackluster, and he was given the chance to display his skills in just two out of three ODIs leading up to the announcement. Sunil Gavaskar, a cricket legend of India, voiced his thoughts on Samson's situation, suggesting that a more consistent showing in recent games could have secured him a definitive spot in the squad. Gavaskar also delved into the absence of Yuzvendra Chahal from the team, attributing both cases to multifaceted factors rather than mere form. In an interview with India Today, Gavaskar emphasized the selectors' challenge in maintaining the team's equilibrium while considering variables such as fielding prowess and batting capabilities. He pointed out the intriguing example of Kuldeep Yadav, who's preferred for his batting abilities down the order, as opposed to Chahal. Likewise, Gavaskar underscored Samson's versatility as an all-rounder, capable of keeping wickets, and acknowledged the possibility of Samson making future appearances for India, considering his relatively young age. Gavaskar expressed his conviction in the current team's strength and urged support for the selected players, emphasizing that Samson's journey was far from over despite the current setback. Read: ‘Virat Kohli is best batter in world': Shikhar Dhawan names his 'dream team' for ICC Men's World Cup, top 5 includes... Chahal, who was left out of the squad, chose to respond via a cryptic tweet reminiscent of a message shared by Captain Rohit Sharma back in 2018 when Chahal was omitted from India's series against England. The tweet read, \"Tough one to take, yes. Stay at it. The sun will rise again. We Keep Trying.\" The message was met with supportive responses from the cricket community, with fans rallying behind Chahal. One user reassured him, \"Don't Worry Yuzi Bhaiya, the Best Is Yet To Come,\" underlining the anticipation for Chahal's future exploits. As the cricketing world absorbed these developments, the conversations surrounding Samson's near-miss and Chahal's exclusion continued to simmer, underscoring the depth of talent and tough decisions that characterize the world of international cricket. .","pubDate":"2023-08-21 17:23:32","image_url":null,"source_id":"dnaindia","source_priority":18388,"country":["india"],"category":["sports"],"language":"english"},{"title":"BCCI tells HCA no further changes in World Cup schedule possible, Hyderabad will have to host back-to-back games","link":"https://www.firstpost.com/firstcricket/sports-news/bcci-tells-hca-no-further-changes-in-world-cup-schedule-possible-hyderabad-will-have-to-host-back-to-back-games-13023912.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"BCCI tells HCA no further changes in World Cup schedule possible, Hyderabad will have to host back-to-back games","content":"Cricket BCCI tells HCA no further changes in World Cup schedule possible, Hyderabad will have to host back-to-back games The HCA had appealed to the BCCI for a change in schedule after the local police authorities expressed their reservations about deploying adequate personnel on back-to-back match days. FirstCricket Staff Last Updated:August 21, 2023 22:53:15 IST General view of Hyderabad's Rajiv Gandhi International Stadium. Sportzpics Photo by Faheem Hussain - Sportzpics - IPL The Board of Control for Cricket in India (BCCI) on Monday told the Hyderabad Cricket Association (HCA) it would have to host back-to-back games in the upcoming ICC World Cup as there was no scope for further changes. The HCA had appealed to the BCCI for a change in schedule after the local police authorities expressed their reservations about deploying adequate personnel on back-to-back match days. “BCCI secretary Jay Shah held a meeting with HCA officials in Delhi after the Asia Cup team selection meeting (for which the secretary is convenor) and the state unit was categorically told that no changes would be entertained after a revised schedule was issued on August 9,” a BCCI source informed. Related Articles Ben Stokes reversing ODI retirement was his call, no point badgering him, says Jos Buttler ODI World Cup tickets to go on sale on 25 August; sales to take place in seven phases The BCCI vice-president Rajeev Shukla had already indicated on Sunday that “changes (to the schedule) were unlikely.” The World Cup schedule, which was first released on 27 June in Mumbai amidst fanfare, went through a lot of changes with dates and timings of as many as nine games, including the marquee India vs Pakistan clash. The Indo-Pak match was originally scheduled for 15 October, but the game was advanced by a day because it was slotted on the first day of Navratra. Also Read | Full list of Matches, Dates, Venues in revised World Cup schedule This particular change in schedule led to Pakistan’s game against Sri Lanka in Hyderabad being advanced by a day from 11 to 10 October. Hyderabad was also hosting Netherlands’ game against New Zealand on 9 October. Hence, the local police officials had asked for at least a day’s gap between the two games. However, that would have meant slotting the New Zealand vs Netherlands game on 8 October. It would have put a lot of stress on the teams and both the countries wouldn’t have agreed upon. New Zealand are playing England in the opening game on 5 October in Ahmedabad and the next day they will fly to Hyderabad and would have received only one training session (on 7 October) in that case. Netherlands open their campaign against Pakistan on 6 October in Hyderabad and advancement by a day meant that 7 October would go in recovery and next day they would be playing again. Neither ICC nor the two boards (NZC and Netherlands authority known as KNCB) would have agreed to this request. With inputs from PTI Published on: August 21, 2023 22:53:15 IST Tags: Bcci Cricket Hca Hyderabad Cricket Association","pubDate":"2023-08-21 17:23:15","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/09/Rajiv-Gandhi-International-Stadium-general-view-IPL-2017-Sportzpics-640.jpg","source_id":"firstpost","source_priority":5906,"country":["india"],"category":["sports"],"language":"english"},{"title":"Meet Praggnanandhaa, the Indian chess grandmaster, who is within touching distance of history at FIDE World Cup","link":"https://www.hindustantimes.com/sports/others/who-is-praggnanandhaa-the-indian-chess-grandmaster-within-touching-distance-of-history-at-fide-world-cup-101692633041815.html","keywords":null,"creator":null,"video_url":null,"description":"Praggnanandhaa became the first Indian to reach the finals of chess World Cup after Viswanathan Anand.","content":"India have been blessed with quiet a few rising talents in chess and the one currently making headlines globally is 18-year-old Rameshbabu Praggnanandhaa. The Indian prodigy on Monday stunned world number three Fabiano Caruana in the tiebreaks to reach the final of the ongoing FIDE World Cup in Baku, Azerbaijan, where he will meet world number one Magnus Carlsen. India chess player Praggnanandhaa and Fabiano Caruana(PTI) Praggnanandhaa closed the semifinal with a 3.5-2.5 win, also officially sealing a place in the Candidates 2024 tournament, which will be held in Canada . He is also the third youngest player after legendary Bobby Fischer and Carlsen to qualify for the Candidates tournament. Praggnanandhaa also became the first Indian to reach the finals of Chess World Cup in over two decades. Viswanathan Anand, one of the most popular names in Indian chess community, had won the first two World Cups back in 2000 and 2002. Anand was quick to celebrate Praggnanandhaa's incredible feat as he tweeted: “Pragg goes through to the final! He beats Fabiano Caruana in the tiebreak and will face Magnus Carlsen now. What a performance!” Praggnanandhaa's rich CV Born in August 10, 2005, Praggnanandhaa hails from the southern coastal city of Chennai. Praggnanandhaa rose through the ranks at a very young age and became the youngest International Master at the age of 10 years, 10 months and 19 days. Two years later, Praggnanandhaa became the second-youngest Grandmaster in 2018, a record which was broken by fellow Indian D Gukesh in 2019. Prior to that Praggnanandhaa had won the World Youth Chess Championships Under-8 title in 2013, also making him a FIDE Master when he just seven. He then won the Under-10 title in 2015. He had also produced a sensational show against Carlsen last year, beating the Norwegian chess grandmaster three consecutive times in rapid and blitz. In an interaction with Indian Express back in 2016, Praggnanandhaa's coach RB Ramesh had noted: “He has a fantastic memory, which lets him remember his old matches. He knows the mistakes he's made without being told. The way he analyses his games is way beyond his years.” Chess runs in Praggnanandhaa's family The young prodigy, who mostly remains away from social media, calls five-time world champion and India’s first Grandmaster Viswanathan Anand as his inspiration. He is the brother of Vaishali Rameshbabu, also a chess player. Four years elder to Praggnanandhaa, Vaishali was born in June 21, 2001 and has previously won the Girls' World Youth Chess Championship for Under-14s and Under-12s. She added the Woman International Master's title to her CV in 2016. The brother-sister duo had won bronze medals in the individual events at the Chess Olympiad held last year in Chennai. SHARE THIS ARTICLE ON ABOUT THE AUTHOR HT Sports Desk At HT Sports Desk, passionate reporters work round the clock to provide detailed updates from the world of sports. Expect nuanced match reports, previews,reviews, technical analysis based on statistics, the latest social media trends, expert opinions on cricket, football, tennis, badminton, hockey,motorsports, wrestling, boxing, shooting, athletics and much more. ...view detail Topics Fabiano Caruana","pubDate":"2023-08-21 17:16:29","image_url":"https://www.hindustantimes.com/ht-img/img/2023/08/21/1600x900/PTI08-21-2023-000263A-0_1692637982354_1692638011674.jpg","source_id":"hindustantimes","source_priority":933,"country":["india"],"category":["sports"],"language":"english"},{"title":"BCCI Rejects Hyderabad Cricket Association Proposal To Make Changes In ICC World Cup 2023 Schedule","link":"https://www.thetimesofbengal.com/sports/bcci-rejects-hyderabad-cricket-association-proposal-to-make-changes-in-icc-world-cup-2023-schedule/?utm_source=rss&utm_medium=rss&utm_campaign=bcci-rejects-hyderabad-cricket-association-proposal-to-make-changes-in-icc-world-cup-2023-schedule","keywords":["Sports"],"creator":["admin"],"video_url":null,"description":"“BCCI secretary Jay Shah held a meeting with HCA officials in Delhi after the Asia...","content":"The BCCI vice-president Rajeev Shukla had already indicated on Sunday that “changes (to the schedule) were unlikely.” The World Cup schedule, which was first released on June 27 in Mumbai amidst fanfare, went through a lot of changes with dates and timings of as many as nine games, including the marquee India vs Pakistan clash. The Indo-Pak match was originally scheduled for October 15, but the game was advanced by a day because it was slotted on the first day of Navratri. This particular change in schedule led to Pakistan’s game against Sri Lanka in Hyderabad being advanced by a day from October 11 to 10. Hyderabad was also hosting Netherlands’ game against New Zealand on October 9. Hence, the local police officials had asked for at least a day’s gap between the two games. However, that would have meant slotting the New Zealand vs Netherlands game on October 8. It would have put a lot of stress on the teams and both the countries wouldn’t have agreed upon. New Zealand are playing England in the opening game on October 5 in Ahmedabad and the next day they will fly to Hyderabad and would have received only one training session (on October 7) in that case. Netherlands open their campaign against Pakistan on October 6 in Hyderabad and advancement by a day meant that October 7 would go in recovery and next day they would be playing again. Neither ICC nor the two boards (NZC and Netherlands authority known as KNCB) would have agreed to this request. (With PTI Inputs)","pubDate":"2023-08-21 17:14:03","image_url":null,"source_id":"the_tob","source_priority":23459906,"country":["india"],"category":["sports"],"language":"english"},{"title":"Home of UK’s greatest cricket followers revealed as being proper subsequent to Lords and Edgbaston","link":"https://www.businesslend.com/sports/home-of-uks-biggest-cricket-fans-revealed-as-being-right-next-to-lords-and-edgbaston/","keywords":["Sports"],"creator":["Mirza Shehnaz"],"video_url":null,"description":"Sign as much as our free sport e-newsletter for all the most recent information on the whole lot from biking to boxing Sign as much as our free sport e-mail for all the most recent information The greatest cricket followers stay in London and the West Midlands – dwelling to 2 of the UK’s most [...] The post Home of UK’s greatest cricket followers revealed as being proper subsequent to Lords and Edgbaston appeared first on BusinessLend.","content":"The greatest cricket followers stay in London and the West Midlands – dwelling to 2 of the UK’s most well-known grounds at Lords and Edgbaston. A survey of two,000 adults discovered 61 per cent of these within the capital are followers – effectively above the nationwide common of 40 per cent. The West Midlands (44 per cent) and the North West (41 per cent) are different hotspots for the sport. And 51 per cent of 18- to 24-year-olds are cricket followers – greater than every other age group. Those aged 25 to 34-year-old got here in second, with 43 per cent self-confessed cricket lovers. Mark Vile, from value comparability web site Compare the Market, which is sponsoring The Hundred and commissioned the analysis, mentioned: “There’s a lot to like concerning the recreation of cricket. “Across the country, there’s huge support for the game, which goes from strength to strength. “From close and thrilling games to strategic gameplay and tactics, there’s something for everyone to love.” The analysis additionally discovered Londoners suppose they’ve the very best information of the sport – with 37 per cent claiming to have an excellent or good understanding. Those within the North West are additionally sufficiently brushed up on their information of bat and ball, with 26 per cent believing they’ve an excellent grasp. TV (66 per cent), sports activities web sites and apps (55 per cent) and social media (32 per cent) are the primary methods followers preserve updated with matches and occasions. It additionally emerged that among the many 33 per cent of respondents who’ve kids aged between seven and 18-years-old, simply 36 per cent reckon have a greater understanding than their youngster. And 47 per cent felt that if on-line players performed or talked concerning the recreation, their kids would grow to be extra within the sport. It comes as Compare the Market and The Hundred have teamed up with three social media video players throughout the course of the event to commentate on some key video games. Among the celebrities are Captain Puffy, SMajor and Solidarity Gaming, who’ve greater than three million followers between them throughout their social media platforms. Captain Puffy mentioned: “I didn’t know much about cricket before I got into The Hundred but I’m getting to grips with it pretty quickly and turning into quite the fan. “It’s such a fast-paced game and it’s been amazing to be a part of and educate my community along the way.” Mark Vile, from Compare the Market, added: “It has been great opening up The Hundred to a new and younger audience in this way with the help of our gamers, allowing for a new generation of fans to soak up the electrifying atmosphere the game has to offer. “We look forward to engaging more fans throughout the tournament and experiencing some world-class cricket along the way.” Mikel Arteta suggests stopwatch could also be wanted for consistency on time-wasting","pubDate":"2023-08-21 22:03:26","image_url":null,"source_id":"businesslend","source_priority":716394,"country":["india"],"category":["sports"],"language":"english"},{"title":"Katherine Sciver-Brunt bids last farewell to cricket after nearly 20 years","link":"https://www.businesslend.com/sports/katherine-sciver-brunt-bids-final-farewell-to-cricket-after-almost-20-years/","keywords":["Sports"],"creator":["Mirza Shehnaz"],"video_url":null,"description":"Sign as much as our free sport e-newsletter for all the most recent information on all the things from biking to boxing Sign as much as our free sport electronic mail for all the most recent information Katherine Sciver-Brunt has bid a last farewell to skilled cricket, within the sport’s latest format, 19 years after [...] The post Katherine Sciver-Brunt bids last farewell to cricket after nearly 20 years appeared first on BusinessLend.","content":"Katherine Sciver-Brunt has bid a last farewell to skilled cricket, within the sport’s latest format, 19 years after she made her England debut. It is just not the primary large cricketing farewell of the summer time, nor will it’s splashed throughout the headlines in the identical approach as Stuart Broad’s announcement in July, however her contributions to the game have been no much less important. Sciver-Brunt won’t be alone, as her bowling companion for thus a few years, Anya Shrubsole will even be following her into retirement, and each will play their last video games within the third version of The Hundred. Women’s cricket when Sciver-Brunt made her debut at Scarborough in 2004 was unrecognisable in comparison with the absolutely professionalised construction discovered right this moment. It was not a few years earlier than that the ladies’s staff had to purchase their very own England blazers, they usually definitely weren’t paid to signify the nation. Sciver-Brunt needed to work a number of jobs to have the ability to fund her personal profession, one thing that appears arduous to envisage when her spouse, England vice-captain Nat Sciver-Brunt earned round £340,000 in the course of the first Women’s Premier League public sale earlier this yr. Having already referred to as time on her worldwide profession firstly of the cricketing summer time, the bowler will sadly be denied a last farewell look on the Oval for the Trent Rockets resulting from an ongoing hip harm, however can have a staff celebration for the top of their event and to mark the top of her profession. “She’s pushed a lot of us to be better versions of ourselves and that’s not a trait that everyone has and I think that’s really special,” England worldwide Issy Wong instructed The Independent . “I think hopefully her legacy is that now there’s younger guys of us who will hopefully now be playing for England this summer knowing exactly what a privilege it is to play for your country and the hard work that you have to do behind the scenes to get there.” Sciver-Brunt (then Katherine Brunt) and Anya Shrubsole led England’s bowling assault for years Wong added: “She goes into every competition and fights until the very last ball. “So it’ll be really special this summer that she’ll be in The Hundred and we’ll be able to give her a good send off.” Anya Shrubsole will even finish her skilled profession after the conclusion of the event, which could possibly be within the last because the Southern Brave sit high of the factors desk. The duo will bow out having led England’s seam assault for almost all of the final decade earlier than Shrubsole’s worldwide retirement in April 2022. They have each lifted the World Cup in entrance of a sold-out Lords in 2017, and been there by means of the rise of the game from being on the margins to greater than 20,000 individuals at two T20s in the course of the Ashes and a sold-out ODI collection. While each gamers are the sort to draw back from the highlight, not less than off the sphere, it’s unlikely that their teammates will enable them to minimize the event, and one factor is for positive, it marks the top of an period within the sport. Mikel Arteta suggests stopwatch could also be wanted for consistency on time-wasting","pubDate":"2023-08-21 21:27:44","image_url":null,"source_id":"businesslend","source_priority":716394,"country":["india"],"category":["sports"],"language":"english"},{"title":"Who is Ugyen Pelzang? What we know about the identity of \"Bhutan's Babe Ruth\" who caught the attention of MLB fans with awe-inspiring hit","link":"https://www.sportskeeda.com/baseball/news-who-ugyen-pelzang-what-know-identity-bhutan-s-babe-ruth-caught-attention-mlb-fans-awe-inspiring-hit","keywords":["Baseball"],"creator":["Adrian Dorney"],"video_url":null,"description":null,"content":"19-year old Ugyen Pelzang may not be showing up on many prospects lists. However, the young baseball phenom is doing all he can to put his nation on the map. Hailing from the small Himalayan nation of Bhutan, Pelzang has shown a peculiar affinity for baseball. Recently, images of Pelzang hitting a dinger against the bucolic backdrop of his home land has garnered significant attention. Bhutan is a relatively unknown mountain Kingdom, ruled by Monarch Jigme Khesar Namgyel Wangchuck since 2006. The population is about 720,000, the vast majority of whom have a fleeting, if nonexistent, understanding of baseball. A photo of Ugyen Pelzang playing in his home nation was snapped by Matthew DeSantis. DeSantis, a diehard Boston Red Sox fan from Connecticut, lives in Bhutan, and co-founded the nation's first and only Baseball and Softball Association. Pelzang has seemingly received an athletic scholarship to his country's first private college, located in the capital city of Thimphu. DeSantis has served a critical role in establishing baseball in the mountainous Kingdom, even organizing several baseball and softball tournaments where young players can show off their skills. According to DeSantis, who has worked closely with Ugyen Pelzang, he met Wangchuck, the prince of Bhutan, while playing on his high school basketball team in Connecticut. Years later, he is one of the small country's foremost purveyors of western sports. Perhaps fans can keep a keen eye out for Pelzang on the 2030 New York Yankees . While Bhutan may indeed be one of the most remote places to hold a baseball game, Ugyen Pelzang is just further proof of a global phenomenon. In June, the Toronto Blue Jays selected Arjun Nimmala. Although he was born and raised in Florida, Nimmala credits cricket games while visiting family in India as having a profound impact on his decision to pursue baseball. At this rate, it is likely that we will see a lot more talent coming out of the Indian subcontinent. Quick Links","pubDate":"2023-08-21 18:11:58","image_url":"https://staticc.sportskeeda.com/editor/2023/08/226b3-16926228031891-1920.jpg","source_id":"sportskeeda","source_priority":172,"country":["india"],"category":["sports"],"language":"english"},{"title":"“We all know what a classy player he is” – Sunil Gavaskar backs KL Rahul to perform in 2023 Asia Cup","link":"https://www.sportskeeda.com/cricket/news-we-know-classy-player-is-sunil-gavaskar-backs-kl-rahul-perform-2023-asia-cup","keywords":["Cricket"],"creator":["James Kuanal"],"video_url":null,"description":null,"content":"Former India captain Sunil Gavaskar has backed KL Rahul, who is yet to regain 100 percent fitness for the 2023 Asia Cup, scheduled to begin later this month. The cricketer-turned-commentator said that Rahul should be given the opportunity to recover from his niggle ahead of the ODI World Cup. The statement came as the selection committee confirmed that Rahul has recovered from a thigh injury but has a slight niggle. As a precautionary measure, the Board of Control for Cricket in India (BCCI) has named wicketkeeper-batter Sanju Samson as a reserve for Rahul’s backup in India's squad for the Intercontinental tournament. Gavaskar told India Today: He added: He continued: For the uninitiated, Rahul recently missed out on the recently concluded three-match ODI series in West Indies as well as several games for Lucknow Super Giants in the Indian Premier League. The right-handed batter has played a couple of match-winning knocks in the 50-over format earlier this year. The 31-year-old scored half-centuries against Sri Lanka (64* off 103 balls) and Australia (75* off 91) at home to take the Men in Blue past the finish line. Sunil Gavaskar feels that lifting weights in the gym is the primary reason behind players’ back injuries. The 74-year-old wants the players to be cricket fit instead of being gym fit. On this, he said: Gavaskar added: He continued: For the uninitiated, Jasprit Bumrah missed out on competitive cricket for almost 11 months due to a back injury. Shreyas Iyer too missed a lot of action in the last six months due to a recurring back injury. Quick Links","pubDate":"2023-08-21 17:42:17","image_url":"https://staticc.sportskeeda.com/editor/2023/08/f8407-16926201957308-1920.jpg","source_id":"sportskeeda","source_priority":172,"country":["india"],"category":["sports"],"language":"english"},{"title":"'I Am Not Cutting My Hair...', When Aakash Chopra Asked Long Haired MS Dhoni To Get A Haircut","link":"https://zeenews.india.com/cricket/when-aakash-chopra-asked-long-haired-ms-dhoni-to-get-a-haircut-in-2004-2651911.html","keywords":null,"creator":null,"video_url":null,"description":"Chopra also shared an incident that highlighted Dhoni's determination to be himself. He had suggested to the junior player that he should cut his hair to be taken more seriously in cricket.","content":"In the realm of cricketing legends, MS Dhoni's name shines brilliantly. His remarkable career, filled with astonishing victories and brilliant leadership, continues to inspire cricket enthusiasts worldwide. However, as former Indian Test opener Aakash Chopra fondly recalls, there was a time when the world had yet to realize the unassuming greatness of Dhoni. Chopra, now a prominent cricket commentator and content creator, recently delved into the archives of his memories on his YouTube channel, Aakash Vani. He shared an endearing anecdote from 2004, when he and Dhoni were both part of India A's squad touring Zimbabwe and Kenya. As roommates during the tour, Chopra was initially taken aback by Dhoni's appearance. The young wicketkeeper, known for his long locks, might have appeared to be a stereotypical \"cool dude\" of that era. However, Dhoni's simplicity and cordiality surprised Chopra, challenging his initial assumptions. MS Dhoni's international cricket journey started in 2004 at Chittagong against Bangladesh where he became India's 157th ODI cricketer. #ThankYouMSDhoni pic.twitter.com/oPBjclVFSX — BCCI (@BCCI) August 16, 2020 Also Read: Meet Chacha Cricket: Pakistan's Beloved Cricket Ambassador Who Is A Big Fan Of Virat Kohli Chopra humorously recounted his expectations, saying, \"To say frankly, I had not expected such cordiality from this long-haired cool dude. I thought that upon asking what he would like to eat, he would say, 'You leave it, I will only order’ or upon asking when he would sleep, he would say ‘I sleep late you can put the bedsheet on your face and sleep'.\" This unexpected simplicity was not a sign of underconfidence, as Chopra explained. He emphasized that Dhoni's demeanour was deceiving, stating, \"One may mistake simplicity for underconfidence. But this is not the case for Dhoni. Inke dikhane ke daant aur khane ke daant kuch aur hain\" (His looks are deceptive). Chopra also shared an incident that highlighted Dhoni's determination to be himself. He had suggested to the junior player that he should cut his hair to be taken more seriously in cricket. In response, Dhoni resolutely declined, saying, \"I am not cutting my hair, probably people might grow their hair after seeing me.\" Little did anyone know that Dhoni's hairstyle would eventually become a nationwide trend, especially after he captained the young Indian team to victory in the inaugural T20 World Cup in 2007. Dhoni retired from international cricket in August 2020, leaving behind a legacy that includes being one of India's greatest cricketers and one of the world's best limited-overs captains. He remains the only captain to have led his side to victories in all three major ICC limited-overs events. Aakash Chopra's heartwarming reminiscence not only sheds light on Dhoni's unassuming personality but also serves as a testament to the enduring friendships forged through the beautiful game of cricket. As fans, we are grateful for such stories that allow us to glimpse the human side of our cricketing heroes, making them all the more cherished and relatable.","pubDate":"2023-08-21 17:28:00","image_url":null,"source_id":"zeenews","source_priority":5319,"country":["india"],"category":["sports"],"language":"english"},{"title":"\"Player that I think is lucky to be in that side is Suryakumar Yadav\" - Tom Moody on Team India's Asia Cup 2023 squad","link":"https://www.sportskeeda.com/cricket/news-player-i-think-lucky-side-suryakumar-yadav-tom-moody-team-india-s-asia-cup-2023-squad","keywords":["Cricket"],"creator":["Venkatesh Ravichandran"],"video_url":null,"description":null,"content":"Former Australian all-rounder Tom Moody felt that middle-order batter Suryakumar Yadav was fortunate to be selected in the 17-member squad for the Asia Cup. The Board of Control for Cricket in India (BCCI) selection committee announced the squad for the continental tournament earlier today (August 21). While it featured a plethora of batters, including the return of the injured KL Rahul and Shreyas Iyer, several eyebrows were raised at the selection of Suryakumar. The 32-year-old has struggled in the 50-over format, averaging 24.33 in 26 games, including a paltry 14.11 in 2023. Speaking to Star Sports, Tom Moody was surprised at the selection of the Mumbai Indians (MI) star. The former Australian cricketer felt the Men in Blue could have instead opted for a younger player like Yashasvi Jaiswal or an additional wrist spinner. Team India has picked the lone wrist spinner in Kuldeep Yadav , with the other half of the 'Kulcha' combination, Yuzvendra Chahal, left out. Meanwhile, Yashasvi Jaiswal is yet to make his ODI debut but made an immediate impression in the longer format, scoring 171 in his maiden innings against the West Indies. The southpaw has also played five T20Is since the West Indies series, including the ongoing Ireland rubber. Tom Moody further stated that despite Suryakumar Yadav being a master at the T20 format, the 50-over format is a different ball game that cannot be cracked at the 11th hour. The 32-year-old is the world's no.1 ranked T20I batter, with an extraordinary average of 46.02 and a strike rate of 172.70, including three centuries. Suryakumar's middle-order competitor Sanju Samson boasts impressive numbers in the ODI format, with an average of 55.71 in 13 games. Yet, an inconsistent showing in the white-ball leg of the recent West Indies tour has left the batter looking on from the outside as the reserve player in the squad. The Asia Cup commences with a group A fixture between Pakistan and Nepal on August 30. Rohit Sharma's men will open their campaign against arch-rivals Pakistan on September 2 at Pallekele. Quick Links","pubDate":"2023-08-21 17:25:00","image_url":"https://staticc.sportskeeda.com/editor/2023/08/e9230-16926190314143-1920.jpg","source_id":"sportskeeda","source_priority":172,"country":["india"],"category":["sports"],"language":"english"},{"title":"Asia Cup 2023: Sunil Gavaskar reacts to Sanju Samson-Yuzvendra Chahal's exclusion from India's squad","link":"https://www.dnaindia.com/cricket/report-asia-cup-2023-sunil-gavaskar-reacts-to-sanju-samson-yuzvendra-chahal-s-exclusion-from-indias-squad-sports-news-3056719","keywords":["Sports","Cricket"],"creator":["DNA  Web Team"],"video_url":null,"description":"India's squad for the Asia Cu 2023 was unveiled on Monday triggering waves of discussion. Legendary cricketer Sunil Gavaskar has also voiced his thoughts on the same. Read details here.","content":"The unveiling of India's squad for the 2023 Asia Cup created ripples of discussion, with one of the focal points being the surprising relegation of Sanju Samson to a backup role. Samson's recent performances in India's matches against the West Indies had been a mixture of promise and inconsistency. His contributions in the T20I series were lackluster, and he was given the chance to display his skills in just two out of three ODIs leading up to the announcement. Sunil Gavaskar, a cricket legend of India, voiced his thoughts on Samson's situation, suggesting that a more consistent showing in recent games could have secured him a definitive spot in the squad. Gavaskar also delved into the absence of Yuzvendra Chahal from the team, attributing both cases to multifaceted factors rather than mere form. In an interview with India Today, Gavaskar emphasized the selectors' challenge in maintaining the team's equilibrium while considering variables such as fielding prowess and batting capabilities. He pointed out the intriguing example of Kuldeep Yadav, who's preferred for his batting abilities down the order, as opposed to Chahal. Likewise, Gavaskar underscored Samson's versatility as an all-rounder, capable of keeping wickets, and acknowledged the possibility of Samson making future appearances for India, considering his relatively young age. Gavaskar expressed his conviction in the current team's strength and urged support for the selected players, emphasizing that Samson's journey was far from over despite the current setback. Read: ‘Virat Kohli is best batter in world': Shikhar Dhawan names his 'dream team' for ICC Men's World Cup, top 5 includes... Chahal, who was left out of the squad, chose to respond via a cryptic tweet reminiscent of a message shared by Captain Rohit Sharma back in 2018 when Chahal was omitted from India's series against England. The tweet read, \"Tough one to take, yes. Stay at it. The sun will rise again. We Keep Trying.\" The message was met with supportive responses from the cricket community, with fans rallying behind Chahal. One user reassured him, \"Don't Worry Yuzi Bhaiya, the Best Is Yet To Come,\" underlining the anticipation for Chahal's future exploits. As the cricketing world absorbed these developments, the conversations surrounding Samson's near-miss and Chahal's exclusion continued to simmer, underscoring the depth of talent and tough decisions that characterize the world of international cricket. .","pubDate":"2023-08-21 17:23:32","image_url":null,"source_id":"dnaindia","source_priority":18388,"country":["india"],"category":["sports"],"language":"english"},{"title":"BCCI tells HCA no further changes in World Cup schedule possible, Hyderabad will have to host back-to-back games","link":"https://www.firstpost.com/firstcricket/sports-news/bcci-tells-hca-no-further-changes-in-world-cup-schedule-possible-hyderabad-will-have-to-host-back-to-back-games-13023912.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"BCCI tells HCA no further changes in World Cup schedule possible, Hyderabad will have to host back-to-back games","content":"Cricket BCCI tells HCA no further changes in World Cup schedule possible, Hyderabad will have to host back-to-back games The HCA had appealed to the BCCI for a change in schedule after the local police authorities expressed their reservations about deploying adequate personnel on back-to-back match days. FirstCricket Staff Last Updated:August 21, 2023 22:53:15 IST General view of Hyderabad's Rajiv Gandhi International Stadium. Sportzpics Photo by Faheem Hussain - Sportzpics - IPL The Board of Control for Cricket in India (BCCI) on Monday told the Hyderabad Cricket Association (HCA) it would have to host back-to-back games in the upcoming ICC World Cup as there was no scope for further changes. The HCA had appealed to the BCCI for a change in schedule after the local police authorities expressed their reservations about deploying adequate personnel on back-to-back match days. “BCCI secretary Jay Shah held a meeting with HCA officials in Delhi after the Asia Cup team selection meeting (for which the secretary is convenor) and the state unit was categorically told that no changes would be entertained after a revised schedule was issued on August 9,” a BCCI source informed. Related Articles Ben Stokes reversing ODI retirement was his call, no point badgering him, says Jos Buttler ODI World Cup tickets to go on sale on 25 August; sales to take place in seven phases The BCCI vice-president Rajeev Shukla had already indicated on Sunday that “changes (to the schedule) were unlikely.” The World Cup schedule, which was first released on 27 June in Mumbai amidst fanfare, went through a lot of changes with dates and timings of as many as nine games, including the marquee India vs Pakistan clash. The Indo-Pak match was originally scheduled for 15 October, but the game was advanced by a day because it was slotted on the first day of Navratra. Also Read | Full list of Matches, Dates, Venues in revised World Cup schedule This particular change in schedule led to Pakistan’s game against Sri Lanka in Hyderabad being advanced by a day from 11 to 10 October. Hyderabad was also hosting Netherlands’ game against New Zealand on 9 October. Hence, the local police officials had asked for at least a day’s gap between the two games. However, that would have meant slotting the New Zealand vs Netherlands game on 8 October. It would have put a lot of stress on the teams and both the countries wouldn’t have agreed upon. New Zealand are playing England in the opening game on 5 October in Ahmedabad and the next day they will fly to Hyderabad and would have received only one training session (on 7 October) in that case. Netherlands open their campaign against Pakistan on 6 October in Hyderabad and advancement by a day meant that 7 October would go in recovery and next day they would be playing again. Neither ICC nor the two boards (NZC and Netherlands authority known as KNCB) would have agreed to this request. With inputs from PTI Published on: August 21, 2023 22:53:15 IST Tags: Bcci Cricket Hca Hyderabad Cricket Association","pubDate":"2023-08-21 17:23:15","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/09/Rajiv-Gandhi-International-Stadium-general-view-IPL-2017-Sportzpics-640.jpg","source_id":"firstpost","source_priority":5906,"country":["india"],"category":["sports"],"language":"english"},{"title":"Meet Praggnanandhaa, the Indian chess grandmaster, who is within touching distance of history at FIDE World Cup","link":"https://www.hindustantimes.com/sports/others/who-is-praggnanandhaa-the-indian-chess-grandmaster-within-touching-distance-of-history-at-fide-world-cup-101692633041815.html","keywords":null,"creator":null,"video_url":null,"description":"Praggnanandhaa became the first Indian to reach the finals of chess World Cup after Viswanathan Anand.","content":"India have been blessed with quiet a few rising talents in chess and the one currently making headlines globally is 18-year-old Rameshbabu Praggnanandhaa. The Indian prodigy on Monday stunned world number three Fabiano Caruana in the tiebreaks to reach the final of the ongoing FIDE World Cup in Baku, Azerbaijan, where he will meet world number one Magnus Carlsen. India chess player Praggnanandhaa and Fabiano Caruana(PTI) Praggnanandhaa closed the semifinal with a 3.5-2.5 win, also officially sealing a place in the Candidates 2024 tournament, which will be held in Canada . He is also the third youngest player after legendary Bobby Fischer and Carlsen to qualify for the Candidates tournament. Praggnanandhaa also became the first Indian to reach the finals of Chess World Cup in over two decades. Viswanathan Anand, one of the most popular names in Indian chess community, had won the first two World Cups back in 2000 and 2002. Anand was quick to celebrate Praggnanandhaa's incredible feat as he tweeted: “Pragg goes through to the final! He beats Fabiano Caruana in the tiebreak and will face Magnus Carlsen now. What a performance!” Praggnanandhaa's rich CV Born in August 10, 2005, Praggnanandhaa hails from the southern coastal city of Chennai. Praggnanandhaa rose through the ranks at a very young age and became the youngest International Master at the age of 10 years, 10 months and 19 days. Two years later, Praggnanandhaa became the second-youngest Grandmaster in 2018, a record which was broken by fellow Indian D Gukesh in 2019. Prior to that Praggnanandhaa had won the World Youth Chess Championships Under-8 title in 2013, also making him a FIDE Master when he just seven. He then won the Under-10 title in 2015. He had also produced a sensational show against Carlsen last year, beating the Norwegian chess grandmaster three consecutive times in rapid and blitz. In an interaction with Indian Express back in 2016, Praggnanandhaa's coach RB Ramesh had noted: “He has a fantastic memory, which lets him remember his old matches. He knows the mistakes he's made without being told. The way he analyses his games is way beyond his years.” Chess runs in Praggnanandhaa's family The young prodigy, who mostly remains away from social media, calls five-time world champion and India’s first Grandmaster Viswanathan Anand as his inspiration. He is the brother of Vaishali Rameshbabu, also a chess player. Four years elder to Praggnanandhaa, Vaishali was born in June 21, 2001 and has previously won the Girls' World Youth Chess Championship for Under-14s and Under-12s. She added the Woman International Master's title to her CV in 2016. The brother-sister duo had won bronze medals in the individual events at the Chess Olympiad held last year in Chennai. SHARE THIS ARTICLE ON ABOUT THE AUTHOR HT Sports Desk At HT Sports Desk, passionate reporters work round the clock to provide detailed updates from the world of sports. Expect nuanced match reports, previews,reviews, technical analysis based on statistics, the latest social media trends, expert opinions on cricket, football, tennis, badminton, hockey,motorsports, wrestling, boxing, shooting, athletics and much more. ...view detail Topics Fabiano Caruana","pubDate":"2023-08-21 17:16:29","image_url":"https://www.hindustantimes.com/ht-img/img/2023/08/21/1600x900/PTI08-21-2023-000263A-0_1692637982354_1692638011674.jpg","source_id":"hindustantimes","source_priority":933,"country":["india"],"category":["sports"],"language":"english"},{"title":"BCCI Rejects Hyderabad Cricket Association Proposal To Make Changes In ICC World Cup 2023 Schedule","link":"https://www.thetimesofbengal.com/sports/bcci-rejects-hyderabad-cricket-association-proposal-to-make-changes-in-icc-world-cup-2023-schedule/?utm_source=rss&utm_medium=rss&utm_campaign=bcci-rejects-hyderabad-cricket-association-proposal-to-make-changes-in-icc-world-cup-2023-schedule","keywords":["Sports"],"creator":["admin"],"video_url":null,"description":"“BCCI secretary Jay Shah held a meeting with HCA officials in Delhi after the Asia...","content":"The BCCI vice-president Rajeev Shukla had already indicated on Sunday that “changes (to the schedule) were unlikely.” The World Cup schedule, which was first released on June 27 in Mumbai amidst fanfare, went through a lot of changes with dates and timings of as many as nine games, including the marquee India vs Pakistan clash. The Indo-Pak match was originally scheduled for October 15, but the game was advanced by a day because it was slotted on the first day of Navratri. This particular change in schedule led to Pakistan’s game against Sri Lanka in Hyderabad being advanced by a day from October 11 to 10. Hyderabad was also hosting Netherlands’ game against New Zealand on October 9. Hence, the local police officials had asked for at least a day’s gap between the two games. However, that would have meant slotting the New Zealand vs Netherlands game on October 8. It would have put a lot of stress on the teams and both the countries wouldn’t have agreed upon. New Zealand are playing England in the opening game on October 5 in Ahmedabad and the next day they will fly to Hyderabad and would have received only one training session (on October 7) in that case. Netherlands open their campaign against Pakistan on October 6 in Hyderabad and advancement by a day meant that October 7 would go in recovery and next day they would be playing again. Neither ICC nor the two boards (NZC and Netherlands authority known as KNCB) would have agreed to this request. (With PTI Inputs)","pubDate":"2023-08-21 17:14:03","image_url":null,"source_id":"the_tob","source_priority":23459906,"country":["india"],"category":["sports"],"language":"english"}]}