{"newsArray":[{"title":"Seven star has popped the question","link":"https://www.themercury.com.au/sport/afl/seven-football-commentator-james-brayshaw-pops-the-question/news-story/310349a4552e5598ce6e48ae2267e9ba","keywords":["AFL","Sport news and galleries"],"creator":null,"video_url":null,"description":"Seven football commentator James Brayshaw is celebrating his engagement.","content":"As first reported by The Herald Sun, the former North Melbourne president returned from an Italian getaway with long-term partner Lisa Christie with joyous news to share. The couple shared happy photos of their romantic trip on Instagram recently — a holiday that included stops in Salo, Lake Garda and Verona. Brayshaw appears to have finally put a ring on it after the couple began dating in 2017. The Channel 7 personality and radio host appeared to be enjoying his brief downtime before the summer of cricket begins in earnest with Australia’s First Test against the West Indies, beginning Wednesday in Perth.“Italy... best country in the world in my opinion,” he captioned one photo with Christie. “Daylight second... yesterday in Salo, Lake Garda... next level extraordinary!” he added. He also wrote: “Verona... beautiful place full of astoundingly well dressed people... like you are walking around in a fashion shoot.”The former South Australian cricketer has four sons — Henry, George, Johnathon and Frederick — with ex-wife Sarah. The pair separated after 23 years together. Christie has two children from a previous relationship and had previously been engaged to gardening guru Jamie Durie. Brayshaw won’t get too long to celebrate the engagement with the long summer of cricket extending through towards the start of the AFL season.","pubDate":"2022-11-27 23:53:00","image_url":null,"source_id":"mercury","country":["australia"],"category":["sports"],"language":"english"},{"title":"FIFA WC 2022 | Fans chant in support of Sanju Samson in Qatar","link":"https://thenewsglory.com/fifa-wc-2022-fans-chant-in-support-of-sanju-samson-in-qatar/","keywords":["Sports","FIFA","FIFA WC 2022","FIFA World Cup","FIFA World Cup Qatar 2022","FIFA WorldCup 2022","Football","Sanju Samson","World Cup"],"creator":["The News Glory"],"video_url":null,"description":"Toga: Fans are voicing their support for Indian cricketer Sanju Samson in the group stage matches of the ongoing FIFA World Cup in Qatar. Fans holding posters of Sanju Samson’s film at the stadiums where the matches are taking place have attracted attention. 28-year-old Sanju Samson made his debut in the Indian team in 2015. […]","content":"Toga: Fans are voicing their support for Indian cricketer Sanju Samson in the group stage matches of the ongoing FIFA World Cup in Qatar. Fans holding posters of Sanju Samson’s film at the stadiums where the matches are taking place have attracted attention. 28-year-old Sanju Samson made his debut in the Indian team in 2015. So far he has played a total of 11 ODIs and 16 T20Is. This wicket keeper batsman from Kerala has scored 330 runs in ODI cricket and 296 runs in T20 cricket. But even if there is a chance for him in the team, it is a challenge to get him in the playing eleven. Fans have expressed their opinions about it. However, due to the need to balance the players in the playing eleven, the team explains that it is difficult to get a chance for him. He got a chance in the playing XI for the first match of the ongoing ODI series against New Zealand. But he was not given a chance in the second match because of the sixth bowler option. In this context, fans are holding banners to express their support for Sanju Samson at the ongoing football world cup. The photo has been released on social media and has gained attention. “Always with you, supporting you” fans said in it.","pubDate":"2022-11-27 20:53:15","image_url":null,"source_id":"thenewsglory","country":["india"],"category":["sports"],"language":"english"},{"title":"U-19 Cricket tournament: DPS Srinagar lifts summit trophy","link":"https://kashmirreader.com/2022/11/28/u-19-cricket-tournament-dps-srinagar-lifts-summit-trophy/","keywords":["SPORTS"],"creator":["KR Desk"],"video_url":null,"description":"SRINAGAR: Delhi SP Higher Secondary School by 26 runs in the summit clash of U-19 cricket tournament played at SP School here. Batting first DPS Srinagar took advantage of the positive intent of its openers: Moosa and Zerak, who sent their opponents on leather hunt scoring 40 runs off the power play. Though SP Hr […]","content":"SRINAGAR: Delhi SP Higher Secondary School by 26 runs in the summit clash of U-19 cricket tournament played at SP School here. Batting first DPS Srinagar took advantage of the positive intent of its openers: Moosa and Zerak, who sent their opponents on leather hunt scoring 40 runs off the power play. Though SP Hr Sec managed to exert some control on the run rate after that, a 19-run cameo by Baleegh ensured they reached a commanding target of 142. In reply SP Higher Secondary School openers consumed too many delivers and were not able to score freely as DPS bowlers maintained tight line and length and ensured that their opponents sniffed no chance of chasing down the target. After the opening bowlers had restricted the score to 25 runs in the powerplay, SP lost seven wickets in the middle overs: three to Baleegh while Humayun and Amaan bagged two apiece. By the last over, it was a task too steep as SP was bowled out losing by 26 runs. Baleegh was declared the Man of the Match justifiably for his all-round match-winning performance. Pertinent to mention, 36 teams from District Srinagar participated in the tournament and DPS Srinagar was the only team to remain undefeated. Commenting on the win, the Principal Shafaq Afshan congratulated the students and said, “It is hardly a surprise that our cricket team has emerged winners. We are always invested in the excellence of students, and they in turn repay our faith with exemplary performances. Congratulations to the team and its coach” Chairman Vijay Dhar also commented: “DPS Srinagar stands today at the pinnacle of achievement and success due to its unwavering commitment to nurturing talent in all respects – sporting, academic, and other kinds. Our conviction will not vary and wins like these lift our morale. Congratulations to the cricket team.” U-19 Cricket tournament: DPS Srinagar lifts summit trophy added by KR Desk on 1:20 am November 28, 2022 View all posts by KR Desk → KR Desk Facebook Twitter WhatsApp Email Print Related","pubDate":"2022-11-27 19:50:13","image_url":null,"source_id":"kashmirreader","country":["india"],"category":["sports"],"language":"english"},{"title":"Justice Dhar kick-starts Knock-out Cricket tournament of Legal Fraternity","link":"https://kashmirreader.com/2022/11/28/justice-dhar-kick-starts-knock-out-cricket-tournament-of-legal-fraternity/","keywords":["SPORTS"],"creator":["KR Desk"],"video_url":null,"description":"SRINAGAR: Justice Sanjay Dhar, Judge High Court of Jammu, Kashmir & Ladakh on Sunday kick-started a “Knock out Cricket tournament of Legal Fraternity” at JKCA Stadium, Sonwar. Justice Dhar kick-started the tournament in presence of Jawad Ahmad, Principal District and Sessions Judge/ Chairman DLSA Srinagar. On the occasion, Justice Dhar interacted with the teams of […]","content":"SRINAGAR: Justice Sanjay Dhar, Judge High Court of Jammu, Kashmir & Ladakh on Sunday kick-started a “Knock out Cricket tournament of Legal Fraternity” at JKCA Stadium, Sonwar. Justice Dhar kick-started the tournament in presence of Jawad Ahmad, Principal District and Sessions Judge/ Chairman DLSA Srinagar. On the occasion, Justice Dhar interacted with the teams of judges, lawyers of High Court, lawyers of Lower Court, lawyers of district Budgam, staff of High Court and staff of Lower Court. He boosted their morale by words of encouragement. Further, he lauded the role of DLSA Srinagar in organising such activities which convey a message of fitness to the general public. The Knock out cricket tournament of Legal Fraternity” was organised by DLSA Srinagar in collaboration with Jammu and Kashmir Bank. The event was convened by Fozia Paul, Secretary DLSA Srinagar/ Budgam. Justice Dhar kick-starts Knock-out Cricket tournament of Legal Fraternity added by KR Desk on 1:19 am November 28, 2022 View all posts by KR Desk → KR Desk Facebook Twitter WhatsApp Email Print Related","pubDate":"2022-11-27 19:49:56","image_url":null,"source_id":"kashmirreader","country":["india"],"category":["sports"],"language":"english"},{"title":"Hollyday Cafe edge past Shape up Fitness CC in summit clash","link":"https://kashmirreader.com/2022/11/28/hollyday-cafe-edge-past-shape-up-fitness-cc-in-summit-clash/","keywords":["SPORTS"],"creator":["KR Desk"],"video_url":null,"description":"Srinagar: Hollyday Café beat Shape up Fitness Cricket Club by a narrow margin of 11 runs in the finals of T20 Chill Out cricket tournament played at TRC Cricket ground on Sunday. After winning the toss Hollyday Cafe decided to Bat first and managed to score 166 runs. Adil Kachroo scored 33 runs and Shahid […]","content":"Srinagar: Hollyday Café beat Shape up Fitness Cricket Club by a narrow margin of 11 runs in the finals of T20 Chill Out cricket tournament played at TRC Cricket ground on Sunday. After winning the toss Hollyday Cafe decided to Bat first and managed to score 166 runs. Adil Kachroo scored 33 runs and Shahid scored 32 runs for Holly day Cafe. For Shapeup Fittness Javeed and Junaid took two wickets each. In reply Shapeup Fittness only managed to score 155 in twenty overs for the lost of 9 wickets. Adil scored 33 Adil Wani scored 24 runs. For Hollyday Cafe Dr Sajad Hussain was the pick of the bowlers claiming three wickets. Shahid was declared man of the match for hiss all-round performance. Adil wani walked away with Man of the series of the tournament. ADC, Abid Hussain was Chief Guest on the occasion while as (Corporator) Wajahat Hussain Jan alongwith Kaunsar Mir (SSA NIIT/JKCA Selector) Abida (Cricket Coach JKCA), Afshan Ashiq (FIT India Ambassador) Sadia Tariq (International gold medalist in Wushu) Manzoor Ahmed Dar (Level 2 BCCI Coach) were among the Guest of Honours. ADC Abid Hussain alongwith other prominent sports personalities presented the awards on the closing ceremony. The tournament was organised by Cricket Fraternity Dalgate with the kind support of Jammu and Kashmir Sports Council. Hollyday Cafe edge past Shape up Fitness CC in summit clash added by KR Desk on 1:19 am November 28, 2022 View all posts by KR Desk → KR Desk Facebook Twitter WhatsApp Email Print Related","pubDate":"2022-11-27 19:49:45","image_url":null,"source_id":"kashmirreader","country":["india"],"category":["sports"],"language":"english"},{"title":"Australian cricket stars to take a knee against racism during West Indies two-Test series","link":"https://www.perthnow.com.au/sport/cricket/australian-cricket-stars-to-take-a-knee-against-racism-during-west-indies-two-test-series-c-8985941","keywords":null,"creator":["Mitchell Woodcock"],"video_url":null,"description":"Australian cricketers will take a stand against racism in the upcoming Test series against the West Indies by taking a knee on home soil for the first time.","content":null,"pubDate":"2022-11-27 18:00:00","image_url":"https://images.perthnow.com.au/publication/C-8985941/23ffdb74c16d370115bb3d80e9002c5a38e239d6-16x9-x0y69w1600h900.jpg","source_id":"perthnow","country":["australia"],"category":["sports"],"language":"english"},{"title":"'Unfair to point fingers on the IPL, blame the players for ICC failures': Gautam Gambhir","link":"https://www.dnaindia.com/cricket/report-unfair-to-point-fingers-on-the-ipl-blame-the-players-for-icc-failures-gautam-gambhir-3006205","keywords":["Sports","Cricket"],"creator":["DNA Web Team"],"video_url":null,"description":"Ex-Indian cricketer Gautam Gambhir has come out in favor of the league, calling it the best thing that has happened to Indian cricket.","content":"Following India's disappointing performance at the 2022 T20 World Cup, which stretched the Men in Blue's ICC trophy drought to ten years, the Indian Premier League (IPL) bore the brunt of the criticism, with many pointing out that India had not hoisted the T20 World Cup trophy since 2007. The Men in Blue only won the shortest format showpiece tournament once, in 2007. Ex-Indian cricketer Gautam Gambhir has come out in favor of the league, calling it the best thing that has happened to Indian cricket. Gambhir argued that players must bear responsibility for India's dismal performance in ICC competitions. Gambhir addressed the financial impact of the cash-rich league for Indian cricket. \"IPL is the best thing that has happen to Indian cricket. I can say this with all my senses. There has been lot of backlash regarding IPL since it started. Every time Indian cricket does not do well, the blame comes on IPL, which is not fair. If we don't perform well in ICC tournaments, blame the players, blame the performance, but it is unfair to point fingers on the IPL,\" said Gambhir at the Turf 2022 and Indian Sports award of FICCI. \"A sportsman can only earn till he is 35-36. IPL provides with financial security which is equally important,\" he added. The former left-handed batter, who serves as the global mentor of the Lucknow and Durban Super Giants franchises in the IPL and SA20 competitions, lauded the BCCI for hiring Indian coaches to head the national team in recent years and wants to see more Indian coaches working in the IPL. \"One good thing that has happened in Indian cricket is that Indians have started coaching the Indian national cricket team now. I strongly believe (an) Indian should coach the Indian team. All these foreign coaches, who we gave a lot of importance to, come here to make money and then they vanish. Emotions are important in sports. The only people who can be emotional about Indian cricket are the ones who have represented their country.\" \"I am a mentor of Lucknow Super Giants. One thing I want to change is that I want to see all Indian coaches in IPL. Because no Indian coach gets an opportunity in Big Bash or any other foreign league. India is a superpower in cricket, but our coaches do not get the opportunity anywhere. All the foreigners come here and get the top jobs. We are more democratic and flexible than other leagues. We need to give our people more opportunity.\" Gambhir is a two-time IPL champion, having captured the trophy as captain of Kolkata Knight Riders in 2012 and 2014 after defeating Chennai Super Kings and Kings XI Punjab (now Punjab Kings) in the final. He spent seven years with KKR between 2011 and 2018, as well as four years with Delhi Daredevils (now Delhi Capitals) from 2008-10 and 2018. Gambhir is now the coach of the Lucknow SuperGiants (LSG), one of two new teams to join the legaue in 2022, along with the Gujarat Titans (GT). READ| 'This is the decision of BCCI and PCB': Gautam Gambhir reacts to Ramiz Raja's 'boycott 2023 World Cup' remark","pubDate":"2022-11-27 17:05:00","image_url":null,"source_id":"dnaindia","country":["india"],"category":["sports"],"language":"english"},{"title":"England arrives for 1st test series in Pakistan since 2005","link":"https://www.thehindu.com/sport/cricket/england-arrives-for-1st-test-series-in-pakistan-since-2005/article66192911.ece","keywords":null,"creator":["\n         AP  \n    "],"video_url":null,"description":"England's cricket team has arrived in Islamabad to play its first test series in Pakistan since 2005","content":null,"pubDate":"2022-11-27 16:42:05","image_url":null,"source_id":"thehindu","country":["india"],"category":["sports"],"language":"english"},{"title":"IND vs NZ 2022: क्या शुभमन गिल की नजर वनडे वर्ल्ड कप 2023 पर है? ओपनर ने खुद दिया ये जवाब","link":"https://www.abplive.com/sports/cricket/when-shubman-gill-was-asked-about-upcoming-odi-world-cup-he-said-that-he-is-not-thinking-far-ahead-2268775","keywords":null,"creator":["ABP Live"],"video_url":null,"description":"Shubman Gill On Cricket World Cup 2023: अगले साल भारत में वनडे वर्ल्ड कप खेला जाएगा. बहरहाल, टीम इंडिया समेत ज्यादातर टीमों ने तैयारी शुरू कर दी है. भारतीय टीम फिलहाल न्यूजीलैंड के दौर पर है. इस दौरे पर टीम इंडिया 3 टी20 मैचों के बाद 3 वनडे मैचों की सीरीज खेल रही है. रोहित शर्मा और विराट कोहली जैसे खिलाड़ियों की गैरमौजूदगी में शुभमन गिल और श्रेयस अय्यर जैसे खिलाड़ियों को लगातार मौके मिल रहे हैं. वहीं, जब वनडे वर्ल्ड कप 2023 के बारे में शुभमन गिल से पूछा गया तो उन्होंने बड़ा बयान दिया है. दरअसल, उन्होंने कहा कि वह फिलहाल दूर की नहीं सोच रहे हैं. 'मैं बहुत दूर की नहीं सोच रहा, मौजूदा वक्त पर फोकस' शुभमन गिल ने कहा कि मैं फिलहाल मौजूदा वक्त पर फोकस कर रहा हूं, मैं बहुत दूर की नहीं सोच रहा हूं. उन्होंने कहा कि मेरा मकसद मिल रहे मौकों का ज्यादा से ज्यादा फायदा उठाना है, न्यूजीलैंड के खिलाफ मौजूदा सीरीज में भी मेरी कोशिश यही है. मेरी कोशिश है कि बड़ा स्कोर बनांउ और टीम के लिए योगदान कर सकूं. साथ ही उन्होंने कहा कि मैं फिलहाल खुद पर काम कर रहा हूं. अगर मुझे नेशनल टीम में जगह नहीं मिलती है तो मैं घरेलू क्रिकेट में बेहतर करना चाहूंगा. इस युवा खिलाड़ीय ने बताया कि वह आगामी दिनों में क्या करना चाहते हैं. 'घरेलू क्रिकेट पर है फोकस' शुभमन गिल का मानना है कि अगर नेशनल टीम में जगह नहीं मिलती है तो इसे अवसर के तौर पर देखना चाहिए. ऐसे में फिर घरेलू क्रिकेट पर फोकस करना चाहिए. उन्होंने कहा कि अगर आप ऐसा करते हैं तो फिर अपनी मजबूती के साथ-साथ कमजोरी पर काम कर पाएंगे. इसके अलावा शुभमन गिल ने न्यूजीलैंड के खिलाफ पहले वनडे मैच में मिली हार पर अपनी प्रतिक्रिया दी. दरअसल, जब शुभमन गिल से पूछा गया कि 307 रन बनाने के बावजूद टीम इंडिया को हरा का सामना करना पड़ा, तो उन्होंने कहा कि 400 रन बनाना संभव नहीं था. गौरतलब है कि पहले वनडे मैच में न्यूजीलैंड के सामने जीत के लिए 307 रनों का लक्ष्य था. न्यूजीलैंड ने 47.1 ओवर में महज 3 विकेट पर लक्ष्य हासिल कर लिया. ये भी पढ़ें- VIDEO: सैमसन ने मैच खेले बिना ही जीता फैंस का दिल, देखें कैसे की ग्राउंड स्टाफ की मदद IND vs NZ: साउदी ने पूरे किए 150 वनडे तो विलियमसन ने की तारीफ, बताया वे न्यूजीलैंड के लिए क्यों हैं खास","content":null,"pubDate":"2022-11-27 15:59:30","image_url":null,"source_id":"abplive","country":["india"],"category":["sports"],"language":"hindi"},{"title":"Vijay Hazare Trophy 2022 Quarterfinal: Top-heavy Tamil Nadu faces Saurashtra pace threat in battle of heavyweights","link":"https://sportstar.thehindu.com/cricket/domestic/vijay-hazare-trophy-2022-quarterfinal-tamil-nadu-vs-saurashtra-preview-schedule-jagadeesan-sudharsan-unadkat-sakariya/article66192031.ece","keywords":null,"creator":["\n        Amol Karhadkar  \n    "],"video_url":null,"description":"Despite that last-ball thriller in Jaipur last December weighing on both contingents’ minds, two of the most consistent one-day sides in domestic cricket will square off after topping their respective groups.","content":null,"pubDate":"2022-11-27 14:20:26","image_url":null,"source_id":"sportstar","country":["india"],"category":["sports"],"language":"english"},{"title":"Phillip Hughes Death Anniversary: फिलिप ह्यूज के अलावा इन खिलाड़ियों की गई क्रिकेट खेलने की वजह से जान, देखें लिस्ट","link":"https://www.abplive.com/sports/cricket/apart-from-phillip-hughes-joshua-downie-raman-lamba-richard-beaumont-died-due-to-playing-cricket-see-list-2268791","keywords":null,"creator":["ABP Live"],"video_url":null,"description":"Cricketes Death Due To Playing Cricket: ऑस्ट्रेलिया के पूर्व क्रिकेटर फिलिप ह्यूज को दुनिया को अलविदा कहे आज 8 साल पूरे हो गए. 27 दिसंबर 2014 को सिडनी के एक हॉस्पिटल में उन्होंने अंतिम सांस ली थी. उनकी जान जाने की वजह क्रिकेट रही. एक मैच के दौरान तेज गेंदबाज सीन एबॉट की गेंद उनके सिर में लग गई. गेंद इतनी तेज लगी कि वह मैदान पर ही गिर गए. इसके बाद उन्हें हॉस्पिटल ले जाया गया. लेकिन उन्हें बचाया नहीं जा सका. वह तीन दिन तक कोमा में रहे थे. ह्यूज की जब मृत्यु हुई उस समय वह सिर्फ 25 साल के थे. उनका शुमार ऑस्ट्रेलिया के प्रतिभाशाली क्रिकेटरों में किया जाता था. वह कंगारू टीम के लिए सभी फॉर्मेट में खेले थे. फिलिप ह्यूज इकलौते क्रिकेटर नहीं थे जिनकी मौत क्रिकेट खेलने से हुई. उनके अलावा 5 और क्रिकेटरों की जान क्रिकेट खेलने की वजह से गई.  जोशुआ डाउनी इंग्लैंड के क्रिकेटर जोशुआ डाउनी की जान क्रिकेट के वजह से चली गई. मई 2021 में वह नेट प्रैक्टिस कर रहे थे. इस दौरान उन्हें अचानक दिल दौरा पड़ा और उनकी मौत हो गई. वह मशहूर जिमनास्ट बेकी डाउनी और एली डाउनी के भाई थे. उनकी मौत 24 साल की उम्र में हुई.  रमन लांबा भारत के पूर्व अंतरराष्ट्रीय क्रिकेट रमन लांबा की मौत सिर में गेंद लगने से हो गई थी. एक मैच के दौरान जब वह ढाका में फील्डिंग कर रहे थे तो गेंद उनके सिर में लग गई और उनकी मौत हो गई. लांबा ने भारत के लिए चार टेस्ट और 32 वनडे मैच खेले थे.  रिचर्ड ब्यूमोंट अगस्त 2012 में इंग्लैंड के क्रिकेटर रिचर्ड ब्यूमोंट पेडमोर क्रिकेट क्लब के लिए खेल रहे थे. इस दौरान उन्हें अचानक दिल का दौरा पड़ा और उनकी मौत हो गई. वह फील्डिंग करते वक्त दूसरे खिलाड़ी से टकरा गए थे. उनकी मौत 33 साल में हुई.  जुल्फिकार भट्टी पाकिस्तान के क्लब क्रिकेट जुल्फिकार भट्टी की गेंद लगने से मौत हो गई थी. यह हादसा उस वक्त हुआ जब वह सिंध में बेगम खुर्शीद मेमोरियल टी20 टूर्नामेंट में बल्लेबाजी कर रहे थे. इस दौरान एक गेंद उनके सीने पर लगी. बाद में उन्हें हॉस्पिटल ले जाया गया लेकिन बचाया नहीं जा सका. बाबू नलावडे बीते साल फरवरी में क्रिकेट मैदान पर एक दर्दनाक हादसा हूआ. पुणे में खेले जा रहे एक मैच में क्रिकेटर बाबू नलावड़े की मौत हो गई. मैच के दौरान ही उन्हें दिल का दौड़ा पड़ा. उन्हें हॉस्पिटल ले जाया गया जहां बाद में उनकी मौत हो गई. नलावड़े की उम्र 47 साल थी.  यह भी पढ़ें: ACB-ECB Agreement: अफगानिस्तान क्रिकेट बोर्ड ने एमिरेट्स क्रिकेट के साथ किया 5 साल का आपसी समझौता IND vs NZ: रवि शास्त्री ने की सूर्यकुमार यादव की तारीफ, बोले- 'एबी डिवीलियर्स की तरह हैं बेस्ट'      ","content":null,"pubDate":"2022-11-27 13:00:23","image_url":null,"source_id":"abplive","country":["india"],"category":["sports"],"language":"hindi"},{"title":"WATCH: MS Dhoni parties with Hardik Pandya, Ishan Kishan and rapper Badshah in Dubai, videos go viral","link":"https://www.firstpost.com/firstcricket/sports-news/watch-ms-dhoni-parties-with-hardik-pandya-ishan-kishan-and-rapper-badshah-in-dubai-videos-go-viral-11705581.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"WATCH: MS Dhoni parties with Hardik Pandya, Ishan Kishan and rapper Badshah in Dubai, videos go viral","content":"Former India skipper MS Dhoni, who generally prefers to stay away from the limelight and social media, was seen partying with India all-rounder Hardik Pandya and batter Ishan Kishan in Dubai on Saturday night (November 26).In videos that have gone viral on the internet, Dhoni can be seen singing with famous Indian rapper Badshah while shaking a leg with Hardik and Kishan, who were part of the Indian squad that recently won the T20I series against New Zealand.As per reports, Dhoni was attending a birthday party of one of his close friends, where several celebrities performed. A series of videos from the event was shared by Dhoni’s wife Sakshi Singh Rawat on Instagram.Interestingly, Dhoni, who was sporting a black suit and white shirt, also turned DJ for some time during the party. Here are some of the videos from the birthday bash:Mahi & hardik seen dancing at a party with their close friends, last night in dubai 🕺🔥#MSDhoni pic.twitter.com/PB5pGPSZsJ— Chakri Dhoni (@ChakriDhoni17) November 27, 2022Ms Dhoni, Hardik Pandya and Badshah partying in Dubai 🎉🔥pic.twitter.com/Ww2pLoa9cF— Cricket🏏 Lover (@CricCrazyV) November 27, 2022It’s made my day ❤️@msdhoni pic.twitter.com/zAZ263L5by— Amit Nariyal (@amit_nariyal) November 27, 2022Notably, Dhoni, who is the captain of the IPL franchise Chennai Super Kings, was last seen in action during the 15th edition of the cash-rich league. The wicket-keeper batter retired from international cricket on August 15, 2020 and he now only plies his trade in IPL matches only.Dhoni will return to the cricket field during IPL 2023 with CSK aiming to clinch their fifth IPL title.Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-11-27 11:41:15","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/11/Dhoni-party.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Vijay Hazare Trophy: Assam, Jammu and Kashmir eye strong showing in quarters in absence of heavyweights","link":"https://www.firstpost.com/firstcricket/sports-news/vijay-hazare-trophy-assam-jammu-and-kashmir-eye-strong-showing-in-quarters-in-absence-of-heavyweights-11705491.html","keywords":["First Cricket News"],"creator":["Sahil Malhotra"],"video_url":null,"description":"Vijay Hazare Trophy: Assam, Jammu and Kashmir eye strong showing in quarters in absence of heavyweights","content":"Cricket Vijay Hazare Trophy: Assam, Jammu and Kashmir eye strong showing in quarters in absence of heavyweights While giants like Delhi, Haryana and Mumbai are missing from the knockout line-up, rise of Assam and Jammu and Kashmir has been very encouraging this season. Sahil Malhotra November 27th, 2022 16:57:59 IST File image of the Assam Cricket Team. Image credit: Twitter/@assamcric After 129 matches, the Vijay Hazare Trophy has entered the last-eight stage which begins in Ahmedabad on Monday. Karnataka, Uttar Pradesh and Jammu and Kashmir won their respective pre-quarters clash to advance in India’s premier 50-over tournament. The group stage of the competition saw some exciting, and lopsided, contests between bat and ball. While giants like Delhi, Haryana and Mumbai are missing from the knockout line-up, rise of Assam and Jammu & Kashmir has been very encouraging this season. Assam in particular have been very consistent and topped a group featuring the likes of Karnataka, Vidarbha, Delhi and Rajasthan. Jammu and Kashmir on the other hand finished Group D in the second position and qualified for the pre-quarters. In their pre-quarters clash, J&K registered a comfortable seven-wicket win over Kerala to set up a quarters date with Assam. Before the teams battle it out for a spot in the semis, here’s quick recap of how things have unfolded in the group stages featuring talent across the country: Fire at top : Top-order batters have enjoyed this year. The likes of N Jagadeesan (Tamil Nadu), Sai Sudarshan (Tamil Nadu), Rahul Tripathi (Maharashtra), Tilak Verma (Hyderabad), Ankit Bawne (Maharashtra) and Rohan Kunnummal (Kerala) have been among the runs, and have scored them at a very consistent rate. Jagadeesan in particular has been on song with five hundreds on the trot and the right-hander would look to keep the show going against a formidable Saurashtra unit in the quarters. Mighty have fallen, again : It’s been another disappointing season for Delhi and Haryana as both teams, featuring plenty of established names, have failed to make it to the knockout stages. Delhi, who had the services of India players Shikhar Dhawan, Ishant Sharma, Navdeep Saini and Nitish Rana, lost four games out of the seven they played this season. Haryana on the other hand won three, lost two, drew one and one of their contest ended as NR. Even last edition, Delhi lost three out of their five games while Haryana could only win one out of the five games they played. It was also a disappointing season for defending champions Himachal Pradesh as the Rishi Dhawan-led unit could only win two of the seven games they featured in. The lop-sided contests : The decision to club NorthEast teams with regular teams has sparked a debate. All teams have struggled and featured in some of the most lop-sided games in history of the competition. The teams would definitely take a sigh of relief in the Ranji Trophy as they would contest in the Plate group featuring teams with similar exposure and experience in the circuit. In the Vijay Hazare, it was more like a net session for the opposite teams. The numbers featuring these teams wear an inflated look and has certainly not helped the health of the competition. Consistency of Uttar Pradesh, Saurashtra & Tamil Nadu : Both Saurashtra and Uttar Pradesh have emerged as one of the few consistent sides in the domestic circuit. The teams made the knockouts last time around too and are again in contention for the title. While Saurashtra have some domestic giants in their ranks, Uttar Pradesh, with a very inexperienced squad, continue to find match-winners to do the job on the day. It will be their bowling vs Maharashtra’s formidable batting when the two sides lock horns in the quarters. For Saurashtra, they would look to keep the on-song Tamil Nadu pair of Jagadeesan and Sudarshan quiet in the knockout fixture. For Tamil Nadu, consistency in white-ball continues as the side reaches another white-ball final. They were the runners-up last time around and would like to do one better this time around. Number cruncher : N Jagadeesan tops batting charts with 822 runs in 7 fixtures. He has hit five hundreds on the trot. Kuldeep Sen has been the most consistent bowler with 18 wickets from six games. Two four-fors and one fifer Sai Sudarshan and N Jagadeesan hold the record for the best opening partnership. They put on 416 runs vs Arunachal Pradesh Quarters line-up: Karnataka vs Punjab Maharashtra vs Uttar Pradesh Assam vs J&K Tamil Nadu vs Saurashtra Read all the Latest News , Trending News , Cricket News , Bollywood News , India News and Entertainment News here. Follow us on Facebook , Twitter and Instagram . Updated Date: November 27, 2022 16:57:59 IST Tags: Cricket Vijay Hazare Trophy Vijay Hazare Trophy 2022 Find latest and upcoming tech gadgets online on Tech2 Gadgets. Get technology news, gadgets reviews & ratings. Popular gadgets including laptop, tablet and mobile specifications, features, prices, comparison.","pubDate":"2022-11-27 11:27:59","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/11/Assam-Cricket-Team-Vijay-Hazare-Trophy-Twitter-1.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"There’s still room for pure batsmanship in T20 cricket: Gary Stead","link":"https://indianexpress.com/article/sports/cricket/theres-still-room-for-pure-batsmanship-in-t20-cricket-gary-stead-8292870/","keywords":["Cricket","Sports"],"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2022-11-27 11:19:24","image_url":null,"source_id":"indianexpress","country":["india"],"category":["sports"],"language":"english"},{"title":"This rubbish dialogue of me fighting with the current team must stop: Justin Langer","link":"https://www.sentinelassam.com/sports/cricket/this-rubbish-dialogue-of-me-fighting-with-the-current-team-must-stop-justin-langer-625526","keywords":["Sports,Cricket"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"Former Australian men’s cricket team head coach Justin Langer has come down heavily on those allegedly spreading rumours about his rift with the senior national squad players","content":"MELBOURNE: Former Australian men's cricket team head coach Justin Langer has come down heavily on those allegedly spreading rumours about his rift with the senior national squad players, saying the \"rubbish\" floating around should stop immediately as all of them were very close to his heart.Langer, a former Australia opener, had raised eyebrows recently by criticising unnamed 'cowards' in the Australian setup for leaking information against him while he was in-charge of the side. Langer was coach of the side between 2018 and early 2022 when he was given just a six-month contract renewal by Cricket Australia (CA), thus riling him. The coach-turner-commentator's final 12 months at the helm were plagued by several reports of players not happy with his coaching methods. Langer quit in a huff just before the team's departure on the historic Test series against Pakistan this year. \"This rubbish dialogue of me fighting with the current team must stop. Simply because it is not true. They (current Australian players) are my friends. They are like my younger brothers. Anything said to the contrary is false,\" Langer wrote in his column for the West Australian. Langer had also reportedly criticised Test and ODI skipper Pat Cummins for failing to give him sufficient feedback. However, the ex-coach distanced himself from comments made on a recent podcast and wrote a newspaper column. \"For four years we drank, ate, celebrated, strategised and lived together. We fought back from 'sandpaper gate' and Covid together and we won the T20 World Cup and Ashes together. Was it always perfect? No, it wasn't. What business, what team is always perfect? I have never met a leader who is every single person's cup of tea. Again, that's life.\" Langer has also said he has sent the audio clip of the podcast to Cummins, T20 skipper Aaron Finch and Cricket Australia high-performance manager Ben Horne, stating \"contrary to what has been reported, these men I respect and like\". \"For the record, I am a great admirer of Pat Cummins. Not only is he an outstanding cricketer but he is also a very good human being,\" he wrote. IANS Also Read: Langer could be tarnishing his legacy with his latest outburst, feels O'DonnellAlso Watch:","pubDate":"2022-11-27 11:13:01","image_url":"https://assets.sentinelassam.com/h-upload/2022/11/27/416459-justin.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"Taylor calls for considered words amid Langer spat with Cricket Australia","link":"https://uk.sports.yahoo.com/news/taylor-calls-considered-words-amid-111027268.html?src=rss","keywords":null,"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2022-11-27 11:10:27","image_url":null,"source_id":"yahoo","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"ACB-ECB Agreement: अफगानिस्तान क्रिकेट बोर्ड ने एमिरेट्स क्रिकेट के साथ किया 5 साल का आपसी समझौता","link":"https://www.abplive.com/sports/cricket/afghanistan-cricket-board-signed-five-year-mutual-agreement-with-emirates-cricket-board-2268747","keywords":null,"creator":["ABP Live"],"video_url":null,"description":"Afghanistan Cricket Board And Emirates Cricket Board 5 Year Mutual Agreement: अफगानिस्तान क्रिकेट बोर्ड और एमिरेट्स क्रिकेट बोर्ड ने आपसी समझौते पर 5 साल के लिए हस्ताक्षर किए हैं. इस ऐतिहासिक समझौते के आधार पर एसीबी अपने घरेलू मैचों की मेजबानी करेगा और सयुंक्त अरब अमीरात में विश्व स्तरीय स्थलों का उपयोग भी करेगा. आपसी समझौते के तरह अफगानिस्तान हर साल यूएई की राष्ट्रीय टीम के साथ तीन टी20 अंतरराष्ट्रीय मैचों की सीरीज भी खेलेगा. इसके बदले एमिरेट्स क्रिकेट बोर्ड उसे कार्यालय स्थान के अलावा वीजा जैसी सुविधा मुहैया कराएगा.  समझौते से होगा लाभ अफगानिस्तान क्रिकेट बोर्ड के सीईओ नसीब खान ने दोनों देशों के बीच सहयोग समझौते को स्वीकार किया. उन्होंने भरोसा जताया कि यह समझौता लाभकारी होगा. इससे भविष्य के लक्ष्यों को बहुत लाभ मिलेगा. वहीं एमिरेट्स क्रिकेट बोर्ड के जनरल सेक्रेटरी मुबाश्शिर उस्मानी ने कहा, एमिरेट्स और अफगानिस्तान क्रिकेट बोर्ड के बीच लंबे समय से सौहार्दपूर्ण संबंधों रहे हैं. हम एसीबी का समर्थन करके खुश हैं कि उनके पास अपने क्रिकेट के लिए एक घर है. हम हर साल अफगानिस्तान के खिलाफ तीन टी20 मैच खेलने के लिए सहमत होने पर एसीबी के शुक्रगुजार हैं. इससे हमारी यूएई की टीम को अनुभव मिलेगा जो विकास में मदद करेगा.  इतिहास रचने से एक कदम दूर अफगानिस्तान मौजूद समय में अफगानिस्तान की क्रिकेट टीम श्रीलंका दौरे पर हैं. अफगान टीम वहां तीन वनडे मैचों की सीरीज खेल रही है. इस श्रृंखला में अफगानिस्तान की टीम इतिहास रचने से सिर्फ एक कदम दूर है. 25 नवंबर को खेले गए वनडे मैच में अफानिस्तान ने श्रीलंका को 60 रन से हराया था. मेहमानों ने पहले खेलते हुए 8 विकेट पर 294 रन बनाए. लक्ष्य का पीछा करने उतरी श्रीलंका की टीम 38 ओवर में 234 रन बनाकर ऑल आउट हो गई थी. अगर अफगानिस्तान दूसरा मैच जीतता है तो यह उसके लिए ऐतिहासिक क्षण होगा.  यह भी पढ़ें: IND vs NZ: साउदी ने पूरे किए 150 वनडे तो विलियमसन ने की तारीफ, बताया वे न्यूजीलैंड के लिए क्यों हैं खास IND vs NZ: संजू सैमसन को दूसरे वनडे मैच में क्यों नहीं मिली जगह? कप्तान शिखर धवन ने बताई वजह  ","content":"Afghanistan Cricket Board And Emirates Cricket Board 5 Year Mutual Agreement: अफगानिस्तान क्रिकेट बोर्ड और एमिरेट्स क्रिकेट बोर्ड ने आपसी समझौते पर 5 साल के लिए हस्ताक्षर किए हैं. इस ऐतिहासिक समझौते के आधार पर एसीबी अपने घरेलू मैचों की मेजबानी करेगा और सयुंक्त अरब अमीरात में विश्व स्तरीय स्थलों का उपयोग भी करेगा. आपसी समझौते के तरह अफगानिस्तान हर साल यूएई की राष्ट्रीय टीम के साथ तीन टी20 अंतरराष्ट्रीय मैचों की सीरीज भी खेलेगा. इसके बदले एमिरेट्स क्रिकेट बोर्ड उसे कार्यालय स्थान के अलावा वीजा जैसी सुविधा मुहैया कराएगा. समझौते से होगा लाभ अफगानिस्तान क्रिकेट बोर्ड के सीईओ नसीब खान ने दोनों देशों के बीच सहयोग समझौते को स्वीकार किया. उन्होंने भरोसा जताया कि यह समझौता लाभकारी होगा. इससे भविष्य के लक्ष्यों को बहुत लाभ मिलेगा. वहीं एमिरेट्स क्रिकेट बोर्ड के जनरल सेक्रेटरी मुबाश्शिर उस्मानी ने कहा, एमिरेट्स और अफगानिस्तान क्रिकेट बोर्ड के बीच लंबे समय से सौहार्दपूर्ण संबंधों रहे हैं. हम एसीबी का समर्थन करके खुश हैं कि उनके पास अपने क्रिकेट के लिए एक घर है. हम हर साल अफगानिस्तान के खिलाफ तीन टी20 मैच खेलने के लिए सहमत होने पर एसीबी के शुक्रगुजार हैं. इससे हमारी यूएई की टीम को अनुभव मिलेगा जो विकास में मदद करेगा. इतिहास रचने से एक कदम दूर अफगानिस्तान googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); News Reels मौजूद समय में अफगानिस्तान की क्रिकेट टीम श्रीलंका दौरे पर हैं. अफगान टीम वहां तीन वनडे मैचों की सीरीज खेल रही है. इस श्रृंखला में अफगानिस्तान की टीम इतिहास रचने से सिर्फ एक कदम दूर है. 25 नवंबर को खेले गए वनडे मैच में अफानिस्तान ने श्रीलंका को 60 रन से हराया था. मेहमानों ने पहले खेलते हुए 8 विकेट पर 294 रन बनाए. लक्ष्य का पीछा करने उतरी श्रीलंका की टीम 38 ओवर में 234 रन बनाकर ऑल आउट हो गई थी. अगर अफगानिस्तान दूसरा मैच जीतता है तो यह उसके लिए ऐतिहासिक क्षण होगा. यह भी पढ़ें: IND vs NZ: साउदी ने पूरे किए 150 वनडे तो विलियमसन ने की तारीफ, बताया वे न्यूजीलैंड के लिए क्यों हैं खास IND vs NZ: संजू सैमसन को दूसरे वनडे मैच में क्यों नहीं मिली जगह? कप्तान शिखर धवन ने बताई वजह var _fireSc=!0;document.addEventListener(\"scroll\",(e=>{if(_fireSc){var c=document.createElement(\"script\");c.src=\"//asset.fwpub1.com/js/embed-feed.js\",c.async=!0,document.getElementsByTagName(\"head\")[0].appendChild(c),_fireSc=!1}}));","pubDate":"2022-11-27 11:03:58","image_url":null,"source_id":"abplive","country":["india"],"category":["sports"],"language":"hindi"},{"title":"Cummins, Hazlewood, Starc are all-format bowlers but they should be given longer breaks: McGrath","link":"https://www.sentinelassam.com/sports/cricket/cummins-hazlewood-starc-are-all-format-bowlers-but-they-should-be-given-longer-breaks-mcgrath-625521","keywords":["Sports,Cricket"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"Former Australian pace bowler Glenn McGrath is firm that Test and ODI skipper Pat Cummins, Josh Hazlewood and Mitchell Starc should remain the national team’s quicks in all three formats of the game, but has advised that they be given longer breaks to recover.","content":"MELBOURNE: Former Australian pace bowler Glenn McGrath is firm that Test and ODI skipper Pat Cummins, Josh Hazlewood and Mitchell Starc should remain the national team's quicks in all three formats of the game, but has advised that they be given longer breaks to recover.McGrath also praised Cummins for deciding to skip the next season of the Indian Premier League (IPL), and added that proper rest was a must to be built into the pace bowlers' schedules. The below-par performance of the trio in the ICC T20 World Cup at home has raised questions on whether they should be persisted in all formats or Cricket Australia (CA) should look to the future with the 2024 T20 World Cup in mind. However, McGrath feels the players have adapted to the scenario of playing all three formats. \"The bowlers have adapted,\" McGrath was quoted as saying by the West Australian. \"Josh Hazlewood is one of the world's best T20 bowlers. He has shown that in the past with the way he has gone about it. Pat Cummins can adapt just because of the areas he bowls. Starcy's (Mitchell Starc) a match winner when he gets it right. He is as good as anyone in the world. I have no issues there with our bowling attack.\" With Australia looking at 15 Test matches in the next nine months besides preparations for the ODI World Cup in India next year, McGrath believes resting bowlers for short durations or individual matches has more impact on a player's mindset than resting the body, according to the report. \"Resting bowlers throughout a season from a game here to a game there, that was my biggest risk of getting injured,\" McGrath said. \"That's a band-aid solution. I want our players and especially our bowlers working at 95 per cent or more.\" Instead, he believes bowlers must be given proper long breaks. \"Playing for Australia should still be the be-all and end-all. Test cricket is still the ultimate. Fast bowlers need to have a bit of an off-season because bowling and running depletes your strength. And you need that strength so you don't have injuries. The fact they may not be getting that as much now is an issue. \"Cummo (Cummins) has come out and said he's not going to the next IPL. That's where you have your off-season, get strong and get through the next season. If you don't do that you're a car that never re-fuels. Sooner or later you're going to run out.\" IANS Also Read:  I've got so much respect for Pat Cummins, says Justin Langer days after being combative Also Watch:","pubDate":"2022-11-27 11:03:13","image_url":"https://assets.sentinelassam.com/h-upload/2022/11/27/416451-glenn-mcgrath.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"England arrives in Islamabad for first test series in Pakistan since 2005","link":"https://www.business-standard.com/article/sports/england-arrives-in-islamabad-for-first-test-series-in-pakistan-since-2005-122112700384_1.html","keywords":null,"creator":null,"video_url":null,"description":"England's cricket team arrived in Islamabad early Sunday to play its first test series in Pakistan since 2005. Led by Ben Stokes, England will kick off the tour in Rawalpindi -- an adjacent city to Islamabad -- which hosts the first test from next Thursday. The second test will be played at Multan from Dec. 9-13 before England round off the tour with the final test at Karachi from Dec. 17-21. England had played a seven-match T20 series in Pakistan prior to the T20 World Cup in Australia where it went on to beat Pakistan in the final. England was due to tour Pakistan last year before the T20 World Cup in the United Arab Emirates but abandoned the tour due to security concerns after New Zealand had aborted its tour to Pakistan just minutes before the toss in the first ODI at Rawalpindi. There were some concerns over England's test tour to Pakistan after former Pakistan Prime Minister Imran Khan was wounded in Wazirabad, a district in eastern Punjab province, during his protest again","content":null,"pubDate":"2022-11-27 11:00:00","image_url":"https://bsmedia.business-standard.com/_media/bs/img/article/default/1221127/thumb-122112700384.jpg","source_id":"business-standard","country":["india"],"category":["sports"],"language":"english"},{"title":"Pakistan's pace bowler Hasan Ali signs up for Warwickshire","link":"https://www.sentinelassam.com/sports/cricket/pakistans-pace-bowler-hasan-ali-signs-up-for-warwickshire-625519","keywords":["Sports,Cricket"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"Pakistan’s pace bowler Hasan Ali has been added to English county side Warwickshires arsenal for the next season after the 28-year-old was not selected in the Test squad for the home series against England.","content":"LONDON: Pakistan's pace bowler Hasan Ali has been added to English county side Warwickshires arsenal for the next season after the 28-year-old was not selected in the Test squad for the home series against England. Ali is Warwickshire's first overseas signing for 2023 and has agreed a deal that will see him play the full Vitality Blast campaign, including any potential knockout games, and the LV Insurance County Championship until the end of July.Ali has starred for T20 sides around the world and made 131 international appearances and has taken almost 200 T20 wickets for sides including Islamabad United and Peshawar Zalmi in the Pakistan Super League (PSL) and St Kitts & Nevis Patriots in the Caribbean Super League (CSL). Ali had made his debut in English cricket last season at Lancashire where he achieved cult hero status during a brief red-ball contract. He was the leading wicket taker in Division One of the County Championship after four weeks and left having taken 25 wickets in five matches at an average of 20.60. IANS Also Read:   Babar, Hasan, Imam, Rizwan, Shaheen receive red, white-ball contracts from PCBAlso Watch:","pubDate":"2022-11-27 10:57:37","image_url":"https://assets.sentinelassam.com/h-upload/2022/11/27/416447-hasan.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"India seek improvements in batting, bowling to square series scoreline","link":"https://www.sentinelassam.com/sports/cricket/india-seek-improvements-in-batting-bowling-to-square-series-scoreline-625514","keywords":["Sports,Cricket"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"After suffering a seven-wicket loss in the ODI series opener to New Zealand at Eden Park in Auckland on Friday","content":"HAMILTON: After suffering a seven-wicket loss in the ODI series opener to New Zealand at Eden Park in Auckland on Friday, India would be seeking major improvements in batting and bowling to square the series in the second match at Seddon Park in Hamilton on Sunday.Hamilton is a city which is an hour and half away drive from Auckland and with that, changes will come into play as Seddon Park is a batting-friendly pitch with dimensions not as funky as it is in Eden Park. The visitors would be aware that in order to save the series, they need their openers, captain Shikhar Dhawan and Shubman Gill to get runs at a faster pace. Dhawan and Gill had an opening stand of 124 in 23.1 overs, but their start was slow as New Zealand bowlers got some seam and swing from the pitch, resulting in only 40 runs coming in the power-play. Though the duo went on to notch up their respective half-centuries, they couldn't convert their knocks into a big score. Moreover, Dhawan and Gill had a dot-ball percentage of 59.74 (playing 46 dot balls) and 58.46 (playing 38 dot balls), respectively in the match. In terms of boundary percentage, Dhawan had 72.22 per cent while Gill was at just 44%. If India wish to get a huge total on board at Hamilton, they will need Dhawan and Gill to be at their quick and attacking best. Suryakumar Yadav was dismissed after stroking a wonderful cover drive on the very first ball while Rishabh Pant needs to shrug off his struggles and get the timing right as a number four batter. Shreyas Iyer, despite being troubled by short balls and having some luck on his side, continued to lead the charge for India crossing 300-mark with a fine 80. Sanju Samson was crucial in being the perfect support to Iyer, before Washington Sundar took on the New Zealand bowlers with a whirlwind 37 not out off 16 balls in the last five overs of the innings. With the ball, India sorely missed the services of a sixth bowling option, an aspect which is very vital in ODI cricket. Though Shardul Thakur began well with tight lines and lengths in his new-ball spell, he was expensive in the later stages of the match as Tom Latham plundered 25 runs off him in the 40th over. As Latham attacked well in his 145 not out, debutant Arshdeep Singh and Yuzvendra Chahal went for plenty of runs. Only Sundar, with his more than handy off-spin, and Umran Malik rushing up the batters with speed and control in his maiden ODI appearance were able to trouble the New Zealand batters. For the Blackcaps, they will be delighted with how Latham stood up to bail them out of trouble with a knock to remember for the ages. They would also be delighted with captain Kane Williamson finding form with 94 not out and being the supporter to Latham in chasing down 307. Matt Henry and Tim Southee did succeed in troubling the Indian batters initially while Lockie Ferguson, despite being expensive, had the handy knack of breaking stands and picking wickets in quick succession. Overall, it should be a game where India will be expected to get their mistakes right in batting and bowling apart from some misfields happening on the field too, as said by Iyer after the match ended. IANS Also Read; Shahbaz replaces Jadeja in Indian squad for upcoming three-match ODI seriesAlso watch:","pubDate":"2022-11-27 10:50:45","image_url":"https://assets.sentinelassam.com/h-upload/2022/11/27/416442-india-nz.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"Wasim Jaffer explains why there's a dearth of all-rounders and part-timers in Team India","link":"https://www.firstpost.com/firstcricket/sports-news/wasim-jaffer-explains-why-theres-a-dearth-of-all-rounders-and-part-timers-in-team-india-11704901.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"Wasim Jaffer explains why there's a dearth of all-rounders and part-timers in Team India","content":"India wicket-keeper batter Sanju Samson’s exclusion from the XI for the second ODI against New Zealand hasn’t really gone well with the fans and former cricketers. Stand-in captain Shikhar Dhawan has said that Samson was replaced by Deepak Hooda as the team needed to have a sixth bowling option.Now, former India batter Wasim Jaffer has pointed out as to why there’s a dearth of all rounders and part timers.Jaffer in a tweet said that lack of patience is a major reason for the same. “We are quick to play them at the highest level, but then after few bad outings, they’re out as quickly as they got in. Vijay Shankar, Venkatesh Iyer, Shivam Dube and Krunal Pandya are few examples. Need to show patience while they develop,” Jaffer wrote.The former right-handed batter further added that because the team now have bowling machines and throwdown specialists, batters have stopped bowling in the nets.Sanju was dropped despite playing well cos we don’t have enough all rounders and part time options. My two cents on why there’s a dearth of all rounders and part timers. #NZvIND #SanjuSamson pic.twitter.com/78nKQStEkK— Wasim Jaffer (@WasimJaffer14) November 27, 2022Apart from Samson, Shardul Thakur who had an ordinary day in the previous game was also made to sit out while Deepak Chahar was included in the final XI.India presently trail the three-match series 0-1 with one match to go. The third and final ODI will be played on Wednesday in Christchurch.Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-11-27 10:27:59","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2021/02/Wasim-Jaffer-640_Sportzpics.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Vijay Hazare Trophy: Karnataka, Uttar Pradesh enter quarters with victories over Jharkhand, Mumbai","link":"https://www.sentinelassam.com/sports/cricket/vijay-hazare-trophy-karnataka-uttar-pradesh-enter-quarters-with-victories-over-jharkhand-mumbai-625504","keywords":["Sports,Cricket"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"Karnataka will now face Punjab in the first quarterfinal match while Uttar Pradesh will face off against Maharashtra in the second of the four last eight fixtures","content":"AHMEDABAD: Karnataka got the better of Jharkhand by five wickets while Uttar Pradesh registered an eight-wicket victory over Mumbai in the pre-quarterfinals of the Vijay Hazare Trophy at Narendra Modi Stadium Ground 'A' and 'B' here on Saturday.With the pre-quarterfinals ending on Saturday, Karnataka will now face Punjab in the first quarterfinal match while Uttar Pradesh will face off against Maharashtra in the second of the four last eight fixtures on Monday. Electing to field first, Karnataka pacers Ronit More (3/31) and Vidwath Kaverappa (3/20) dismissed Jharkhand openers Utkarsh Singh and Arnav Sinha for ducks in the first two overs. The side made further inroads by taking out Shahbaz Nadeem, captain Virat Singh and Saurabh Tiwary in quick succession to leave Jharkhand at 40/5 in 13.3 overs. It took a 115-run stand, coming off 155 deliveries, between all-rounder Anukul Roy (57) and wicket-keeper Kumar Kushagra (74) for the sixth wicket to get Jharkhand back on track. But the stand came to an end when Kushagra was dismissed for 74 off 80 balls by Venkatesh M (3-51) — the timely knock included eight fours and two sixes. Roy went on to hit 57 off 97 balls, including four boundaries but didn't get much support from the other end as Karnataka made regular strikes to bowl out Jharkhand for 187 in 47.1 overs. In reply, Karnataka skipper Mayank Agarwal fell early in the chase, castled by Bal Krishna for 12. But R. Samarth (53 off 60 balls) joined forces with an in-form Nikin Jose to stitch a 64-run stand off 72 balls for the second wicket before the former was dismissed by Rahul Shukla. Though Manish Pandey, Shreyas Gopal and B.R. Sharath fell quickly, Nikin Jose stood tall to be unbeaten on 63 off 93 balls, hitting five fours to chase down 188 in 40.5 overs, with MS Bhandage being 18 not out. In the other match, Uttar Pradesh had things going their way from the word go. Divyaansh Saxena was bowled for a duck by Ankit Rajpoot on the third ball of the innings while Shivam Mavi castled Prithvi Shaw in the fourth over. Captain Ajinkya Rahane (26) and Armaan Jaffer (32) added a valuable 52-run stand off 66 balls for the third wicket. But Uttar Pradesh bounced back as Rahane was caught behind by wicket-keeper Aryan Juyal off Tyagi in the 15th over, followed by Shivam Sharma and Shiva Singh taking out Suved Parkar and Jaffer in quick succession to leave Mumbai at 94/5 in 21.4 overs. Left-arm spin all-rounder Shams Mulani hit 51 off 70 balls while Harddik Tamore scored a timely 67-ball 53 in a vital 103-run stand off 127 balls. But Shiva broke the partnership by taking out Tamore and eventually Mumbai were all out for 220 in 48.3 overs, with Mavi taking 4-41 while Shiva and Karthik had two wickets each. In reply, Juyal (82 off 103 balls) and Madhav Kaushik (46 off 75 balls) laid the platform for the chase with a brilliant 119-run stand off 152 balls, before Divyaansh cut it short by taking the latter out. Juyal was dismissed by Mohit Avasthi in the 34th over, giving Mumbai a small ray of hope to be back in the game. But Priyam Garg and captain Karan Sharma shared an unbeaten 63-run stand off 70 balls for the third wicket to take Uttar Pradesh over the line in 45.4 overs. While Garg was unbeaten on 39 off 58 deliveries, Sharma was unconquered at 42 off 38 balls to complete a comprehensive victory for Uttar Pradesh. Brief Scores: Jharkhand 187 all out in 47.1 overs (Kushagra Kumar 74, Anukul Roy 57; Vidwath Kaverappa 3-20, Ronit More 3-31) lost to Karnataka 188/5 in 40.5 overs (Nikin Jose 63 not out, R Samarth 53; Rahul Shukla 2-44, Bal Krishna 1-22) by five wickets Mumbai 220 all out in 48.3 overs (Hardik Tamore 53, Shams Mulani 51; Shivam Mavi 4/41, Shiva Singh 2/43) lost to Uttar Pradesh 221/2 in 45.4 overs (Aryan Juyal 82, Madhav Kaushik 46; Divyansh Saxena 1-25, Mohit Avasthi 1-41) by eight wickets. IANSAlso Read: Vijay Hazare Cricket: Assam to face Jammu and Kashmir (J&K) in quartersAlso Watch: ","pubDate":"2022-11-27 10:12:46","image_url":"https://assets.sentinelassam.com/h-upload/2022/11/27/416430-vijayhazaretrophy.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"Sri Lanka vs Afghanistan, LIVE Cricket Score, 2nd ODI in Pallekele","link":"https://www.firstpost.com/firstcricket/sports-news/sri-lanka-vs-afghanistan-live-cricket-score-2nd-odi-in-pallekele-11705191.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"Sri Lanka vs Afghanistan, LIVE Cricket Score, 2nd ODI in Pallekele","content":"Cricket Sri Lanka Vs Afghanistan LIVE SCORE (odi) Quick Scorecard Full scorecard Ball by ball commentary FP commentary Sri Lanka Vs Afghanistan At Pallekele International Cricket Stadium, Kandy, 27 November, 2022 27 November, 2022 Starts 14:30 (IST) Play In Progress Afghanistan 132/1 (26.3 ov) 2nd ODI Sri Lanka Yet To Bat Afghanistan Sri Lanka 132/1 (26.3 ov) - R/R 4.98 Play In Progress Rahmanullah Gurbaz (W) - 53 Rahmat Shah - 57 This Over Batting Status R B 4s 6s Rahmanullah Gurbaz (W) Batting 65 67 4 4 Rahmat Shah Batting 57 74 7 0 Bowling 0 M R W Maheesh Theekshana 3.3 0 24 0 Current Partnership Last Wicket 22/1 (5.2) 110 (110) R/R: 5.19 Rahmanullah Gurbaz (W) 53(53) Rahmat Shah 57(74) Ibrahim Zadran 10(18) S.R (55.55) b Lahiru Kumara Sri Lanka vs Afghanistan, LIVE Cricket Score, 2nd ODI in Pallekele Sri Lanka vs Afghanistan LIVE Score and ball-by-ball updates: Sri Lanka aim to fight back and keep the series alive after losing the opening game by 60 runs. FirstCricket Staff November 27th, 2022 15:13:28 IST Sri Lanka captain Dasun Shanaka and his Afghanistan counterpart Hashmatullah Shahidi pose with the ODI series trophy. Image credit: Twitter/@OfficialSLC Preview : Afghanistan skipper Hashmatullah Shahidi won the toss and elected to bat against Sri Lanka as they looked to clinch the series in the second one-day international on Sunday. The tourists, who won the opener in the three-match series, came in unchanged in Pallekele, where rain was expected in the evening. Sri Lanka’s hopes of direct qualification into next year’s 50-overs World Cup were dented after their opening loss, with crucial Super League points on offer in the series. Hosts India and the seven highest-ranked other teams earn direct entry to the 2023 tournament. Sri Lanka, led by Dasun Shanaka, remain unchanged from their 60-run thrashing on Friday at the same venue. Teams Sri Lanka : Pathum Nissanka, Kusal Mendis (wk), Dinesh Chandimal, Dhananjaya de Silva, Charith Asalanka, Dasun Shanaka (capt), Wanindu Hasaranga, Dhananjaya Lakshan, Maheesh Theekshana, Kasun Rajitha, Lahiru Kumara Afghanistan : Rahmanullah Gurbaz (wk), Ibrahim Zadran, Hashmatullah Shahidi (capt), Rahmat Shah, Najibullah Zadran, Mohammad Nabi, Gulbadin Naib, Rashid Khan, Mujeeb Ur Rahman, Yamin Ahmadzai, Fazalhaq Farooqi Umpires : Nitin Menon (IND), Raveendra Wimalasiri (SRI) TV umpire : Ruchira Palliyaguruge (SRI) Match referee : Ranjan Madugalle (SRI) Read all the Latest News , Trending News , Cricket News , Bollywood News , India News and Entertainment News here. Follow us on Facebook , Twitter and Instagram . Updated Date: November 27, 2022 15:13:28 IST Tags: Cricket Sri Lanka Vs Afghanistan Sri Lanka Vs Afghanistan 2022 Find latest and upcoming tech gadgets online on Tech2 Gadgets. Get technology news, gadgets reviews & ratings. Popular gadgets including laptop, tablet and mobile specifications, features, prices, comparison.","pubDate":"2022-11-27 09:43:28","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/11/Sri-Lanka-Afghanistan-ODI-Series-Twitter-@OfficialSLC-1.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Indian cricket fraternity extends birthday wishes to Suresh Raina","link":"https://telanganatoday.com/indian-cricket-fraternity-extends-birthday-wishes-to-suresh-raina","keywords":["News","Sport","BCCI","Chennai Super Kings","Suresh Raina"],"creator":["ANI"],"video_url":null,"description":"Members of the Indian cricket fraternity took to social media to extend birthday wishes to former middle-order batter Suresh Raina, who turned 36 on Sunday.","content":"New Delhi: Members of the Indian cricket fraternity took to social media to extend birthday wishes to former middle-order batter Suresh Raina, who turned 36 on Sunday. The Board of Control for Cricket in India (BCCI), the country’s governing body for cricket took to Twitter to wish Raina. “322 intl. matches 7,988 intl. runs 7 intl. hundreds Here’s wishing the 2011 World Cup winner, @ImRaina a very happy birthday #TeamIndia,” tweeted BCCI. Raina’s Indian Premier League (IPL) franchise, Chennai Super Kings (CSK) also extended their wishes to a batter who helped them in their multiple IPL triumphs. Legendary Indian cricketer Sachin Tendulkar also took to Twitter to wish Raina. “Many happy returns of the day to you Suresh. Have a splendid year ahead!,” tweeted Tendulkar. “A true Super King marked by his character inside out! Super Birthday to you, Chinna Thala! #WhistlePodu #Yellove,” tweeted CSK. Indian Test veteran Cheteshwar Pujara also wished Raina, tweeting, “Wish you the best in everything you do! Many happy returns of the day @ImRaina Have a great one!” Former Indian all-rounder Yuvraj Singh, who formed a formidable middle order of the late 2000s to early 2010s along with Raina and MS Dhoni also posted an Instagram story to wish the batter. Former Indian all-rounder Irfan Pathan also posted a video of him and Raina preparing a Dosa while wishing him on his birthday. “Wishing my dear friend and fun loving guy @ImRaina a very happy birthday. Chal bhai dosa khilaoo tujhe #Birthday,” tweeted Pathan. Raina had announced his retirement from international cricket on August 15, 2020. Raina was part of the 2011 World Cup-winning team under the captaincy of MS Dhoni. In an international career spanning 13 years, Raina represented India in 18 Tests, 226 ODIs and 78 T20Is. Raina gathered 5615 runs from 226 ODIs at an average of 35.31. His best score in the format is 116*. Raina scored five centuries and 36 half-centuries in the format. In 78 T20Is, the left-hander has scored 1,605 runs at an average of 29.18. His best score in the format is 101. Raina scored one century and five half-centuries in the format. Across 31 innings in 18 Tests, Raina scored 768 runs at an average of 26.48. 120 is Raina’s best score in the longer format of the game. He has scored a century and seven half-centuries in this format.He is also the first Indian to score hundreds in all three formats of cricket and his centuries were scored outside India. While playing in the Indian Premier League (IPL) Suresh Raina has 5,528 runs to his name in 205 IPL matches with 39 half-centuries and one century at a strike rate of 136.76 and an average of 32.52. His best score in IPL is 100. Raina is the fifth highest-run scorer in IPL of all time. He was one of the marquee players of the Chennai Super Kings (CSK) franchise, which he represented for the majority of his career. He also won two Champions League T20 titles with CSK.","pubDate":"2022-11-27 09:41:19","image_url":null,"source_id":"telanganatoday","country":["india"],"category":["sports"],"language":"english"},{"title":"Indian Premier League (IPL) is the best thing to happen to Indian cricket: Gautam Gambhir","link":"https://www.sentinelassam.com/sports/cricket/indian-premier-league-ipl-is-the-best-thing-to-happen-to-indian-cricket-gautam-gambhir-625494","keywords":["Sports,Cricket"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"Gautam Gambhir threw light on how there is financial security among players due to the advent of the Indian Premier League (IPL)","content":"NEW DELHI: Former India opener Gautam Gambhir, who captained Kolkata Knight Riders to two Indian Premier League (IPL) trophies in 2012 and 2014, feels that the introduction of the tournament has been the best thing to have ever happened to Indian cricket in the last couple of years.\"IPL is the best thing that has happened to Indian cricket. I can say this with all my senses. There has been a lot of backlash regarding IPL since it started. Every time Indian cricket does not do well, the blame comes on IPL, which is not fair. If we don't perform well in ICC tournaments, blame the players, blame the performance, but it is unfair to point fingers at the IPL,\" Gambhir said on the sidelines of the TURF2022 & India Sports Awards of FICCI on Saturday. Gambhir, who represented India in 58 Tests, 147 ODIs and 37 T20Is, apart from 154 IPL matches, threw light on how there is financial security among players due to the advent of the IPL. \"A sportsman can only earn till he is 35-36. IPL provides with financial security which is equally important.\" The former left-handed batter, who works as the global mentor of Lucknow and Durban Super Giants franchises in the IPL and SA20 leagues, praised the BCCI for employing Indian coaches over the past few years to lead the national side and wished to see more Indian coaches working in IPL. \"One good thing that has happened in Indian cricket is that Indians have started coaching the Indian national cricket team now. I strongly believe (an) Indian should coach the Indian team. All these foreign coaches, who we gave a lot of importance to, come here to make money and then they vanish. Emotions are important in sports. The only people who can be emotional about Indian cricket are the ones who have represented their country.\" \"I am a mentor of Lucknow Super Giants. One thing I want to change is that I want to see all Indian coaches in IPL. Because no Indian coach gets an opportunity in Big Bash or any other foreign league. India is a superpower in cricket, but our coaches do not get the opportunity anywhere. All the foreigners come here and get the top jobs. We are more democratic and flexible than other leagues. We need to give our people more opportunity.\" IANSAlso Read: Enforcement Directorate (ED) attaches assets worth Rs 31 crore in money laundering caseAlso Watch: ","pubDate":"2022-11-27 09:22:30","image_url":"https://assets.sentinelassam.com/h-upload/2022/11/27/416407-gautam-gambhir.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"Vijay Hazare Cricket: Assam to face Jammu and Kashmir (J&K) in quarters","link":"https://www.sentinelassam.com/sports/cricket/vijay-hazare-cricket-assam-to-face-jammu-and-kashmir-jk-in-quarters-625493","keywords":["Sports,Cricket"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"Jammu and Kashmir confirmed their maiden appearance in the quarter final today when they defeated Kerala by seven wickets at Ahmedabad.","content":"Sports ReporterGUWAHATI: Jammu and Kashmir (J&K) will be the opponent of Assam in their quarter final tie in the Vijay Hazare Cricket. Jammu and Kashmir confirmed their maiden appearance in the quarter final today when they defeated Kerala by seven wickets at Ahmedabad. The quarter final match between Assam and Jammu and Kashmir will be held on November 28 at Ahmedabad.Also Read: Bollywood Celebrities who joined Congress leader Rahul Gandhi in his missionAlso Watch: ","pubDate":"2022-11-27 09:18:32","image_url":"https://assets.sentinelassam.com/h-upload/2022/11/27/416405-cricket.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"India vs New Zealand: We wanted the sixth bowler to come in, so Sanju Samson missed out, says Shikhar Dhawan","link":"https://www.firstpost.com/firstcricket/sports-news/india-vs-new-zealand-we-wanted-the-sixth-bowler-to-come-in-so-sanju-samson-missed-out-says-shikhar-dhawan-11704721.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"India vs New Zealand: We wanted the sixth bowler to come in, so Sanju Samson missed out, says Shikhar Dhawan","content":"Cricket India vs New Zealand: We wanted the sixth bowler to come in, so Sanju Samson missed out, says Shikhar Dhawan Shikhar Dhawan explained Sanju Samson's absence from India's playing XI for the second ODI vs New Zealand after the game was washed out. FirstCricket Staff November 27th, 2022 14:21:13 IST Sanju Samson was dropped by India for the second ODI vs New Zealand. BCCI image India stand-in skipper Shikhar Dhawan has cleared the air on Sanju Samson’s exclusion from the XI despite putting up a decent show in the last game. Dhawan said that the team combination needed a sixth bowling option and that’s why Deepak Hooda replaced Samson in the final XI. “We wanted the sixth bowler to come in, so Sanju Samson missed out and Hooda came in. And Chahar was picked because he can swing the ball really well. A few of our guys are resting but this side is still strong, shows the depth of our squad,” he said after the match. The Indian batter also lauded his opening partner Shubman Gill and pacer Umran Malik for the way they have fared so far. Handshakes 🤝 all around after the second ODI is called off due to rain. Scorecard 👉 https://t.co/frOtF82cQ4 #TeamIndia | #NZvIND pic.twitter.com/pTMVahxCgg — BCCI (@BCCI) November 27, 2022 “This is a good opportunity for the guys travelling so far, to see the way Shubman has batted and Umran’s bowling, glad to see that transition. As a team we want to get our processes right, and put on a good performance in Christchurch. Hopefully we can win and enjoy ourselves,” Dhawan further added. The second ODI between India and New Zealand was called off due to rain in Hamilton and the Kiwi captain Kane Williamson expressed disappointment about the same but added that weather is something that nobody can really control. The right-hander further lavished praise on Latham’s stunning knock in the first ODI. The 2⃣nd #NZvIND ODI is called off due to persistent rain 🌧️ We will see you in Christchurch for the third & final ODI of the series. Scorecard 👉 https://t.co/frOtF7L9O4 #TeamIndia pic.twitter.com/QODRMWTQEN — BCCI (@BCCI) November 27, 2022 “Disappointing (to lose this game to rain). The weather has been following us. Good team performances for us so far. Latham played a blinder (in Auckland), nice start to the series, looking forward to Christchurch now. Rankings just float around a bit, but it does recognize the hard work you put in as a team. But you try and focus on things that you can control, what cricket you can play. It was nice to make a contribution (in the first ODI) but I got a nice seat to see Latham make that switch in the second half of his innings,” he said. Read all the Latest News , Trending News , Cricket News , Bollywood News , India News and Entertainment News here. Follow us on Facebook , Twitter and Instagram . Updated Date: November 27, 2022 14:21:13 IST Tags: Cricket India Vs New Zealand Find latest and upcoming tech gadgets online on Tech2 Gadgets. Get technology news, gadgets reviews & ratings. Popular gadgets including laptop, tablet and mobile specifications, features, prices, comparison.","pubDate":"2022-11-27 08:51:13","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/11/Sanju-Samson1.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"‘Like the US Presidency’: Khawaja suggests four-year terms for coaches","link":"https://www.watoday.com.au/sport/cricket/like-the-us-presidency-khawaja-suggests-four-year-terms-for-coaches-20221127-p5c1lo.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Malcolm Conn"],"video_url":null,"description":"Usman Khawaja believes the job of Australia’s cricket coach is so arduous that the position should not be held by any individual for more than four years.","content":"Usman Khawaja believes Australian cricket coaches should be restricted to four-year terms, such is the gruelling nature of the pivotal role. Reacting to Langer’s claim on a recent podcast that internal leaks from “cowards” undermined his position as head coach of the national team, Khawaja said he had a good relationship with the former great but highlighted it was a “tough” job. Khawaja believes Langer was the “perfect person” to be appointed coach after the Cape Town ball-tampering scandal in 2018, restoring discipline to the team and helping to repair the shattered reputation of Australian cricket. “Australian coaches shouldn’t have more than a four- to five-year window where they can coach because this job will get you down and things change so quickly with international sport,” Khawaja said in Perth ahead of the first Test against the West Indies, which begins on Wednesday. “I’ve had this conversation with Andrew McDonald before he became coach, and he actually agreed with me. When you’re coach doing all three formats, they should have a timeline like the US presidency that is terms of four years. Coaching, it’s a very tough gig and to do it for a long time consistently, you’re always away travelling and under scrutiny.” Langer’s predecessor, Darren Lehmann, advised Langer to “walk away” after his four years in the job. Usman Khawaja celebrates a century during Australia’s tour of Pakistan last March. Credit: AP “Knowing Justin, he won’t want to step aside. But he should or he will burn out,” Lehmann told Fox Sports back in January. “If I was him I’d walk away actually. Four years, out on a high. Perfect. “I coached for a year too long and in that moment I didn’t realise it. I think four years is a perfect tenure. Hindsight is a wonderful thing.”","pubDate":"2022-11-27 08:45:00","image_url":null,"source_id":"watoday","country":["australia"],"category":["sports"],"language":"english"},{"title":"FIFA World Cup Group Stage Scenarios: What each team needs to reach last 16?","link":"https://www.firstpost.com/sports/fifa-world-cup-group-stage-last-16-scenarios-what-each-team-needs-to-reach-last-16-11704391.html","keywords":["Sports"],"creator":["FP Sports"],"video_url":null,"description":"FIFA World Cup Group Stage Scenarios: What each team needs to reach last 16?","content":"Sports FIFA World Cup Group Stage Scenarios: What each team needs to reach last 16? FIFA World Cup: We take a look at what every team needs to do to qualify for the last 16 stage. FP Sports November 27, 2022 14:08:10 IST Defending champions France are the first team to qualify for the last 16 stage in FIFA World Cup 2022. AP France on Saturday became the first team to qualify for FIFA World Cup 2022 last 16 stage after a 2-1 win over Denmark in the Group D match. But 15 more spots are still up for grabs. FIFA World Cup: Fixtures | Results | Points Table | Squads | Records We take a look at the scenarios for each group in the FIFA World Cup 2022 and what the teams need to reach the last 16. Teams in Groups A, B, C and D have already played two matches each. Teams in Groups E, F, G and H are still to play two more games. Group A Remaining fixtures Tuesday: Ecuador vs Senegal, Netherlands vs Qatar Hosts Qatar are already out of the tournament with two back-to-back defeats. The Netherlands are up against Qatar in their last group game and a win or a draw will be enough for them to reach the last 16. Ecuador will qualify with a win or tie against Senegal. Senegal has to beat Ecuador to reach last 16 or else they will be out. Group B Remaining fixtures Wednesday: Iran vs United States, Wales vs England England need a win or a tie against Wales to reach the last 16. They can qualify even after losing as they have a +4 goal difference. Iran need a win against the USA to qualify. They can also reach last 16 with a tie but in this case, Wales should not beat England or at least should have an inferior goal difference to Iran. The USA must beat Iran to reach the last 16. Any other result would see them get eliminated. Wales first need to beat England to be in the reckoning and would still depend on the result from Iran vs USA game. Group C Remaining fixtures Thursday: Poland vs Argentina, Saudi Arabia vs Mexico Polan need a win or a tie against Argentina to qualify. They can be in contention even after a loss unless Saudi Arabia beat Mexico. Argentina will qualify by beating Poland. A draw will take the qualification to goal difference margin unless Saudi Arabia beat Mexico. A defeat will see Argentina get eliminated. Lionel Messi scored Argentina’s opener in the 64th minute. AP Saudi Arabia qualify with a win over Mexico. It can also qualify with a tie if Poland beat Argentina or Poland-Argentina play out a draw and Saudi Arabia maintain a gold difference strong enough to qualify. If Argentina beat Poland and Saudi Arabia draw against Mexico, then the Asian team will need a stronger goal difference than Poland to qualify. Mexico can qualify by beating Saudi Arabia if Poland also beat Argentina. If Mexico win and Argentina beat Poland, then the goal difference will decide their fate. A draw or a tie will see Mexico get eliminated. Group D Remaining fixtures Wednesday: Australia vs Denmark, Tunisia vs France France are already into last 16 with a game to go. Australia can’t lose against Denmark else they will be out. They will qualify with a win. In case of a draw, Australia will qualify unless Tunisia beat France and have a better goal difference than Australia Denmark will qualify with a win over Australia unless Tunisia beat France and have a better goal difference than Denmark. Tunisia can qualify if they beat France and Australia don’t win against Denmark. They will still need to have a better goal difference. Group E Remaining fixtures Sunday: Japan vs Costa Rica Monday: Spain vs Germany Friday: Costa Rica vs Germany, Japan vs Spain Spain will qualify if they beat Germany and Japan beat or play out a draw vs Costa Rica. Japan qualify with a win. Another defeat will eliminate Germany. A draw for Germany against Spain will give them a slim chance. After a 7-0 loss to Spain, Costa Rica will probably only qualify if they win both their matches. Group F Remaining fixtures Sunday: Belgium vs Morocco Sunday: Croatia vs Canada Thursday: Canada vs Morocco, Croatia vs Belgium Belgium will qualify if they beat Morocco and Canada will be knocked out if they lose to Croatia. Regardless of what happens in Matchday 2 of Group F, Croatia and Morocco will not be eliminated. Eden Hazard and Belgium will hope to have a deep run in the FIFA World Cup. AP Group G Remaining fixtures Monday: Cameroon vs Serbia Monday: Brazil vs Switzerland Saturday: Cameroon vs Brazil, Serbia vs Switzerland Brazil will reach last 16 with a win over Switzerland if Serbia beat Cameroon or play out a draw. Switzerland will reach last 16 with a win over Brazil if Cameroon beat Serbia or play out a draw. Serbia will be out with a loss if Brazil win or draw. Cameroon will be out with a loss if Switzerland win or draw. Group H Remaining fixtures Monday: South Korea vs Ghana Tuesday: Portugal vs Uruguay Friday: Ghana vs Uruguay, South Korea vs Portugal Portugal will qualify with a win vs Uruguay and Ghana will be out with a loss against South Korea. South Korea and Uruguay cannot qualify or be eliminated on Matchday 2 of Group H. Read all the Latest News , Trending News , Cricket News , Bollywood News , India News and Entertainment News here. Follow us on Facebook , Twitter and Instagram . Updated Date: November 27, 2022 14:08:10 IST TAGS: Fifa World Cup 2022 Kickingaround","pubDate":"2022-11-27 08:38:10","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/11/fifa-world-cup-2022-scenarios.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"}]}