{"newsArray":[{"title":"Big Bash team forced to field team of unknowns","link":"https://wwos.nine.com.au/cricket/bbl-2022-melbourne-stars-name-massively-depleted-squad-for-clash-with-perth-scorchers/9cfb8129-88f6-4ba5-8c32-d7a2044e1137","keywords":null,"creator":["wwos"],"video_url":null,"description":"Multiple unknown players are in line for Big Bash debuts this afternoon, with the Stars throwing together a team despite COVID-19 wreaking havoc.","content":"Multiple unknowns are in line for Big Bash debuts this afternoon, with the Melbourne Stars throwing together a team despite COVID-19 wreaking havoc in their camp.The Stars have managed to name a 13-man squad for today's match against the high-flying Perth Scorchers - featuring several unknown players.Straight out of a sports movie, the plucky underdogs will go into today's match with more than half their squad wiped out due to COVID-19 complications.READ MORE: Big boost for Australia after COVID scareREAD MORE: 'Sensational' crowd catch stops BBLREAD MORE: Aussies fearless in 'group of death' at ATP CupJoe Burns, Nathan Coulter-Nile, Sam Elliott, Liam Hatcher, Clint Hinchliffe, Nick Larkin, Peter Nevill, Sam Rainbird, Andre Russell, Billy Stanlake, Marcus Stoinis, Beau Webster and Adam Zampa are all unavailable.The club confirmed late last night 10 players and eight support staff had tested positive to the virus.\"Our thoughts are with our players who have tested positive today and we wish them a speedy recovery,\" the team's general manager, Blair Crouch, said on Saturday night.\"Thanks to the medical teams at Cricket Victoria and Cricket Australia for their ongoing support under difficult circumstances.\"The slapped-together group of players will consist of several people with zero or almost no Big Bash experience.If they're to have any hope against the Scorchers, it will all be on the likes of Glenn Maxwell and Hilton Cartwright with the bat.Full squad: Glenn Maxwell (c), Qais Ahmad, Lachlan Bangs, Hilton Cartwright, Joe Clarke, Brody Couch, Xavier Crone, Ahmad Daniyal, Syed Faridoun, Tom O'Connell, Haris Rauf, Tom Rogers, Charles Wakim.For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here!","pubDate":"2022-01-01 21:54:05","full_description":"Multiple unknowns are in line for Big Bash debuts this afternoon, with the Melbourne Stars throwing together a team despite COVID-19 wreaking havoc in their camp. The Stars have managed to name a 13-man squad for today's match against the high-flying Perth Scorchers - featuring several unknown players. Straight out of a sports movie, the plucky underdogs will go into today's match with more than half their squad wiped out due to COVID-19 complications. READ MORE: Big boost for Australia after COVID scare READ MORE: 'Sensational' crowd catch stops BBL READ MORE: Aussies fearless in 'group of death' at ATP Cup Joe Burns, Nathan Coulter-Nile, Sam Elliott, Liam Hatcher, Clint Hinchliffe, Nick Larkin, Peter Nevill, Sam Rainbird, Andre Russell, Billy Stanlake, Marcus Stoinis, Beau Webster and Adam Zampa are all unavailable. The club confirmed late last night 10 players and eight support staff had tested positive to the virus. \"Our thoughts are with our players who have tested positive today and we wish them a speedy recovery,\" the team's general manager, Blair Crouch, said on Saturday night. \"Thanks to the medical teams at Cricket Victoria and Cricket Australia for their ongoing support under difficult circumstances.\" The slapped-together group of players will consist of several people with zero or almost no Big Bash experience. If they're to have any hope against the Scorchers, it will all be on the likes of Glenn Maxwell and Hilton Cartwright with the bat. Full squad: Glenn Maxwell (c), Qais Ahmad, Lachlan Bangs, Hilton Cartwright, Joe Clarke, Brody Couch, Xavier Crone, Ahmad Daniyal, Syed Faridoun, Tom O'Connell, Haris Rauf, Tom Rogers, Charles Wakim. For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here!","image_url":"https://prod.static9.net.au/fs/d39820ad-ac3f-4db9-b4ed-fdd654c21061","source_id":"nine"},{"title":"Melbourne Locals: Reinforcements who will save Stars","link":"https://www.cairnspost.com.au/sport/cricket/big-bash/bbl11-news-melbourne-stars-game-against-perth-scorchers-to-go-ahead-despite-more-covid-cases/news-story/c79170fa68a62bb17a2846b3e189d3e9","keywords":["Big Bash News","Cricket news and galleries"],"creator":null,"video_url":null,"description":"Melbourne Stars are preparing to field what could be the worst XI any Big Bash League club has ever fielded on Sunday with Cricket Australia declaring their game against Perth Scorchers must go ahead despite 18 positive Covid cases in the green team’s camp.","content":null,"pubDate":"2022-01-01 21:00:00","full_description":null,"image_url":null,"source_id":"cairnspost"},{"title":"Cricket rocked by sex abuse claims","link":"https://www.cairnspost.com.au/sport/cricket/australian-federal-police-and-cricket-australia-investigate-sexual-assault-allegations-from-1980s/news-story/cd523bc05a03653eeb1e05e31153e8c8","keywords":["Cricket news and galleries","Sport news and galleries"],"creator":null,"video_url":null,"description":"The Australian Federal Police and Cricket Australia are reviewing claims that a teenage representative player was sexually assaulted in the 1980s.","content":null,"pubDate":"2022-01-01 19:30:00","full_description":null,"image_url":null,"source_id":"cairnspost"},{"title":"Team India hits the ground running ahead of 2nd Test vs Proteas","link":"https://www.thehansindia.com/sports/cricket/team-india-hits-the-ground-running-ahead-of-2nd-test-vs-proteas-722712","keywords":["Sports,Today NewsPaper,Cricket"],"creator":["The Hans India"],"video_url":null,"description":"The Indian cricket team hit the ground running on the first day of the New Year on Saturday, beginning their preparations for the second Test at the Wanderers, scheduled to commence on January 3.","content":"Team India hits the ground running ahead of 2nd Test vs ProteasTeam India hits the ground running ahead of 2nd Test vs ProteasJohannesburg: The Indian cricket team hit the ground running on the first day of the New Year on Saturday, beginning their preparations for the second Test at the Wanderers, scheduled to commence on January 3. India are leading the series 1-0 after winning the first Test at SuperSport Park by 113 runs. The Virat Kohli-led side signed off from a memorable 2021 in Test cricket by becoming the first Asian side to win a Test at Centurion.The Board of Control for Cricket in India (BCCI) posted a 32-second video of the Indian team training at the 'Bullring'. \"We are here at The Wanderers to prepare for the 2nd Test. New Day. New Year. New Start. Same Focus. Lets GO #TeamIndia | #SAvIND,\" read the caption of the video posted by the BCCI. The video showed visuals of players going through taking laps of the stadium, followed by senior pacer Ishant Sharma doing some bowling practice. The video then cut to captain Virat Kohli batting in the practice sessions followed by head coach Rahul Dravid having a chat with top-order batter Cheteshwar Pujara. In their history of touring South Africa since the country was re-admitted into international cricket since 1991, India boasts of an impressive record at the Wanderers, having never lost a Test match here. In five Tests played at Johannesburg, India have won twice and drawn thrice. For South Africa, they have played here 48 times, winning 18, losing 13 and drawing 11 matches. It is at this venue where Dravid got his maiden Test hundred in 1997 and India won it's first-ever Test match in South Africa in 2006. Interestingly, India's dominating run overseas has roots in Johannesburg, when they won the third Test in 2018 by 63 runs on an extremely tough pitch.","pubDate":"2022-01-01 19:10:26","full_description":null,"image_url":"https://assets.thehansindia.com/h-upload/2022/01/01/500x300_1139220-team-india.jpg","source_id":"thehansindia"},{"title":"Jamie Mitchell's dream was a baggy green cap, but a cricket tour from hell has left him searching for answers - ABC News","link":"https://news.google.com/__i/rss/rd/articles/CBMiaWh0dHBzOi8vd3d3LmFiYy5uZXQuYXUvbmV3cy8yMDIyLTAxLTAyL2phbWllLW1pdGNoZWxsLWNyaWNrZXQtYWJ1c2Utb24taW5kaWEtYW5kLXNyaS1sYW5rYS10b3VyLzEwMDcxNTkxMtIBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Jamie Mitchell's dream was a baggy green cap, but a cricket tour from hell has left him searching for answers  ABC News","content":null,"pubDate":"2022-01-01 19:04:56","image_url":null,"source_id":"google"},{"title":"Jos Buttler to keep plugging away in Tests","link":"https://www.perthnow.com.au/sport/cricket/jos-buttler-to-keep-plugging-away-in-tests-c-5157468","keywords":null,"creator":["Rory Dollard"],"video_url":null,"description":"Jos Buttler is adamant that he'll keep battling in Test cricket and won't give up on the five-day game after England's crushing Ashes disappointment.","content":null,"pubDate":"2022-01-01 19:02:15","full_description":null,"image_url":"https://images.perthnow.com.au/publication/C-5157468/f7835f7c9204c8bc342060718398662b3981eb66-16x9-x0y0w1280h720.jpg","source_id":"perthnow"},{"title":"Jos Buttler to keep plugging away in Tests","link":"https://thewest.com.au/sport/cricket/jos-buttler-to-keep-plugging-away-in-tests-c-5157469","keywords":null,"creator":["Rory Dollard"],"video_url":null,"description":"Jos Buttler is adamant that he'll keep battling in Test cricket and won't give up on the five-day game after England's crushing Ashes disappointment.","content":null,"pubDate":"2022-01-01 19:02:15","full_description":null,"image_url":"https://images.thewest.com.au/publication/C-5157469/f7835f7c9204c8bc342060718398662b3981eb66-16x9-x0y0w1280h720.jpg","source_id":"thewest"},{"title":"Ashes 2021, Australia vs England, cricket news, New Year’s Test in Sydney, teams, selection, Mitchell Swepson, Mitchell Starc, Travis Head, COVID","link":"https://www.foxsports.com.au/cricket/the-ashes/ashes-2021-australia-vs-england-cricket-news-new-years-test-in-sydney-teams-selection-mitchell-swepson-mitchell-starc-travis-head-covid/news-story/b23a93310f5174826424f5a648dcde4e","keywords":null,"creator":null,"video_url":null,"description":"The Ashes series continues this week with Australia looking to go one step closer to completing another whitewash against England at home.","content":null,"pubDate":"2022-01-01 19:00:00","full_description":"The Ashes series continues this week with Australia looking to go one step closer to completing another whitewash against England at home. But a positive COVID case has thrown the team a curveball, while future planning for a bumper 2022 could also trigger a shake-up in Australia’s XI. These are the three big selection calls facing Australia for the new New Year’s Test. Catch every moment of The Ashes live and ad-break free during play on Kayo. New to Kayo? Try 14-days free now . NEW PODCAST - Emergency podcast: The latest on cricket’s Covid drama SUBSCRIBE IN ITUNES OR SPOTIFY CA puts Langer contract talks on hold | 01:14 WHO REPLACES TRAVIS HEAD? Australia is once again on the hunt for a new No.5 after Travis Head was ruled out of the Sydney Test after testing positive for COVID-19. It’s unfortunate timing for the 28-year-old who had only just cemented his spot in the Australian Test middle order following his 152 at the Gabba in the first Ashes Test. According to Kerry O’Keeffe, the knock “basically locked in No. 5 for five years for” Head. Nonetheless, one person’s misfortune is another’s gain — and Usman Khawaja is widely expected to finally earn a Test re-call. The veteran left-hander was narrowly beaten to the spot at No.5 by Head in Brisbane, meaning Khawaja is still searching for his first Test cap since the 2019 Ashes. Given Khawaja only just missed out on a spot, and is this season’s form batter in the Sheffield Shield, he’s considered the overwhelming favourite to replace Head. And Australia could certainly do worse than turning to Khawaja, who averages 40.66 in Test cricket and made 460 runs at 65.71 in the Shield to start this summer. Khawaja is the obvious pick at No.5 but there are two major threats to his long-awaited promotion. The first would be if selectors — with the Ashes already sewn up at 3-0 to Australia — were to look towards the future, as they have shown a willingness to do already. Marcus Harris is a prime example having been backed at the top of the order despite a poor record in Test cricket, particularly against England. Notable examples last summer were the Test debuts of young guns Cameron Green and Will Pucovski who were handed baggy greens after impressive, yet limited runs in first class cricket. Khawaja still has plenty to offer but, at 35 years old, the question is for how long? Three players were added to Australia’s Test squad after Head’s positive test; Mitch Marsh Nic Maddinson and Josh Inglis. Head OUT of Sydney Test after positive | 02:44 All are 30 years and younger and would be considered more long term options than Khawaja. Maddinson is the most like-for-like option of the trio, and has long been knocking on the door with 1,966 runs at 63.42 across the past four Sheffield Shield seasons. Inglis, meanwhile, was only just edged out by Alex Carey at the start of the summer, but remains an intriguing proposition as a specialist batter. The English-born Western Australian was one of the top batters in last season’s Sheffield Shield, in which he scored three centuries on his way to 585 runs at 73.12 The second way Khawaja could be kept on the pine longer is if selectors fancy changing the make-up of Australia’s XI to fit a second spinner. Playing two specialist spinners at the SCG was once a popular option for Australia, but selectors have in recent years stuck with the formula of three fast bowlers and Nathan Lyon, with part-timers making up the remaining tweaking options. Steve O’Keefe is the last player to partner Lyon in a Sydney Test, having done so against Pakistan in January 2017. Shane Warne has backed Swepson to make his Test debut with three tours of Asia scheduled for next year against Pakistan, Sri Lanka and India (more on this later). Should Swepson be picked, it opens the door for Marsh to make his return to Australia’s Test XI instead of Khawaja, having last played one Test at the 2019 Ashes. Marsh was Australia’s best white ball player of 2021 and looks in great shape to return to Test cricket as he enters the prime of his career. It’s also worth noting that Marsh has a strong record against England, having made two centuries in three matches during the 2017-18 Ashes series, before taking his only Test five-wicket haul at the Oval in 2019. While his batting alone could warrant selection at No.5, his seamers would make him a promising option as extra back-up in the event Swepson was picked. WILL MITCHELL STARC BE RESTED? Mitchell Starc is on fire this series. Source: Getty Images Notwithstanding any unknown injury concerns, it seems unlikely. Starc is Australia’s only quick to have played all three Ashes Tests, which came in the space of just three weeks. It’s a heavy toll but given the early finish to the Boxing Day Test, Starc will have an entire week to rest his feet before steaming in at the SCG. Furthermore, Starc has proven to be Australia’s most durable quick who has rarely required rest. Starc hasn’t missed a match since the 2019 Ashes series, while he played all six Tests in the summer of 2018-19, all five against Pakistan and New Zealand in 2019-20, and all four against India in 2020-21. The fact that this is Australia’s only Test series since last summer’s against India only makes it more likely that Starc pushes through for his home match. And that’s to say nothing of the potential effect resting a player in the middle of their golden summer could have. Having endured a raft of criticism for over a year, this Ashes has shaped as the series that defines the back-half of Starc’s career. He has 14 wickets at 19.64 across the first three Tests in a run of form that feels unwise to tamper with at this stage. That said, Starc has been seen reaching for his back in some discomfort in Adelaide and Melbourne. It’s unclear if there’s any genuine injury concern for Starc, although he was still bowling at his best during England’s second innings at the MCG, so it seems unlikely. While the Ashes urn is already Australia’s, crucial World Test Championship points are still up for grabs, meaning selectors won’t be willing to take the foot off the gas just yet. As such, Australia’s pecking order of Starc, Pat Cummins and Josh Hazlewood — if fit — is expected to be respected, meaning Scott Boland would likely be dropped and Jhye Richardson and Michael Neser kept on the sidelines. COULD MITCHELL SWEPSON EARN DEBUT? Mitchell Swepson has been biding his time. Source: Getty Images If not now, then it could be never. Swepson has been in and around Australia’s Test squad for some time but, at 28 years old, is yet to break into the XI. The timing of Swepson’s emergence in recent years has been unfortunate given Australia hasn’t played a Test in Asia since October 2018. That’s left the Sydney Test as the only genuine option for a Swepson debut, but Australia hasn’t picked twin specialist spinners at the venue since 2017. But while Australia will fancy an Ashes whitewash and all the WTC points that come with it, there’s the chance for an element of forward planning to come into selections. Australia is scheduled to play Test cricket in Pakistan, Sri Lanka and India in 2022, and would benefit from having the option of playing twin spin. While Marnus Labuschagne and Steve Smith provide part-time options, Australia could be left short-handed on wickets that provide extra turn. As such, they Sydney Test represents a prime opportunity for Australia to plan ahead for 2022, should the wicket take spin and the weather be favourable. “We’ve got to find out about Mitch Swepson,” former Australia Test spinner Kerry O’Keeffe said on Fox Cricket on Friday. “He’s been on the pine for how many years? We’ve got to know whether he’s the No. 2 because there’s new challengers, like Matt Kuhnemann – left-arm orthodox. “We’re going to the subcontinent. Who do you take? Do you take the ‘wristy’ who needs bounce or the left-arm ‘ortho’ who’s precise, like Steve O’Keefe, and has success there? “Mitch Swepson, we’ll know more about where he’s at at the end of the five-day Test match.” Last week, Australia legend Shane Warne backed selectors to give Swepson a crack, depending on the conditions. “I’m sure Australia will look at two spinners and Mitchell Swepson would be one of them,” Warne told foxsports.com.au . “I think they’d like to give Mitchell Swepson a game before all the tours in the subcontinent because there’s a few coming up, so I think they’d like to look at him. “Whether they play two or rest Nathan Lyon for a Test, if they can win this series, they might play one spinner, with Cameron Green you can play two, it’s definitely worth a consideration.” Swepson could be forced to wait once again, however, if rain in Sydney during the build-up makes the wicket more fast-bowler friendly. Curator Adam Lewis is hopeful that the wicket will take spin, but is worried about the forecase, telling Sydney Morning Herald : “If we get the weather it will naturally become a turner but if we don’t get the weather it will just hold together and won’t do much. “If we get that rain and that overcast weather there’s not much we can do. It doesn’t dry out.”","image_url":null,"source_id":"foxsports"},{"title":"New Zealand vs Bangladesh, 1st Test, Day 2 Live Cricket Score Updates","link":"https://sports.ndtv.com/cricket/new-zealand-vs-bangladesh-1st-test-day-2-live-cricket-score-updates-2683866","keywords":null,"creator":null,"video_url":null,"description":"NZ vs BAN, 1st Test, Day 2, live cricket score: New Zealand will look to consolidate their position on Day 2 of the opening Test against Bangladesh in Mount Maunganui on Sunday after finishing Day 1...","content":null,"pubDate":"2022-01-01 18:01:41","full_description":"New Zealand will look to consolidate their position on Day 2 of the opening Test against Bangladesh in Mount Maunganui on Sunday after finishing Day 1 at a score of 258/5. On the first day of the Test, batter Devon Conway continued his phenomenal rise in Test cricket, scoring 122. In only his fourth Test, and first since recovering from a broken hand, Conway lifted New Zealand from being one for one to close the day at 258 for five with Henry Nicholls on 32 and Tom Blundell out on the last ball for 11. It is the fourth time in seven Test innings that Conway has passed the 50 mark, and it lifted his average to 71.57, but after setting New Zealand up for a big score he gave his wicket away to an innocuous Mominul Haque delivery. Mominul only put himself on for three overs before the second new ball and claimed the prized scalp of Conway with a harmless delivery that was edged to wicketkeeper Liton Das. ( LIVE SCORECARD ) Right then! The visitors will be happy with the wickets they picked in the final session and would look to build on the same. New Zealand, on the flip side, would want Henry Nicholls to bat for long and get close to the 350-run mark. The action continues on Sunday, January 2, 2022. The first ball will be bowled at 3.30 am IST (10 pm GMT, previous day). But the build-up will begin much in advance. Do join us for that. Till then, cheers! Devon Conway is up for a chat. He says that it was very challenging to bat upfront and the wicket was green. Mentions that it got a lot better lately and is happy to contribute. Tells that Bangladesh bowled pretty well and it was all about being patient. Adds that they are disappointed that they lost Tom Blundell at the end but feels that they are still in a strong position. On his wicket, he says that it is the last way one wants to get out after all the hard work but that's how it goes. Bangladesh started the first hour of the day really well but looked to have lost their track as the ball kept getting old and there was no movement off it. The pitch too got better and better to bat. Bangladesh bowlers toiled very hard and gained rewards with three wickets in the final session. That would certainly boost their confidence after ending the day on a positive note. After losing Tom Latham early on and Will Young before Tea, Devon Conway and Ross Taylor batted really well and the runs kept coming at a brisk rate after the Tea break. Taylor was struggling to find the middle of the blade initially but got into his rhythm and struck some beautiful shots but unfortunately, he slipped out once he tried to up his ante. Later, Nicholls came in and made his intentions clear with his aggressive shots. But soon after, Conway was sent back as well and at the stroke of Stumps, they lost Tom Blundell as well. The Kiwis are still in a commonding position though and would look to pile as many runs as possible on Day 2. What a great comeback by the visitors in the final session of the day. It was all about New Zealand in the first two sessions, but the hosts lost Devon Conway who was well set and then lost Tom Blundell at the stroke of Stumps. Bangladesh would be happy with their bowling performance and would hope to end things early on Day 2. OUT! CHOPPED ON! Bangladesh do get a wicket in the final over of the day. Back of a length, outside off, Tom Blundell stands up on his toes and looks to punch. Plays a little late as the ball goes off the inside edge and goes back to disturb the stumps. Bangladesh would have loved a couple of wickets in the final session and they have got exactly that. Tom Blundell walks back dejected. THAT WILL BE STUMPS ON DAY 1! Short of a length again, on off. Tom Blundell pulls it to deep mid-wicket for a brace. Back of a length, on off. Henry Nicholls punches it to cover for a quick single. The fielder scores a direct hit at the bowler's end but Henry Nicholls was comfortably home. Good fielding though. WIDE! A loosener from Ebadot Hossain. Short and well outside off. Left alone. Wided. Change from both ends. Ebadot Hossain is back into the attack.","image_url":"https://c.ndtvimg.com/2022-01/hg8dgtl_nz-afp_625x300_01_January_22.jpg?im=FaceCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv"},{"title":"Jos Buttler insists he has no plans to retire from Test cricket after Ashes","link":"https://www.theguardian.com/sport/2022/jan/01/england-jos-buttler-insists-he-has-no-plans-to-retire-from-test-cricket-after-ashes","keywords":["Jos Buttler","England cricket team","Ashes 2021-22","The Ashes","Australia sport","Cricket","Sport"],"creator":["Ali Martin in Sydney"],"video_url":null,"description":"Wicketkeeper’s ambition is to keep playing all formatsEngland go into Sydney Test eager not ‘to lose 5-0’Jos Buttler says a chastening Ashes campaign – for himself and England – has not diminished his desire to remain a three-format player in international cricket. The 31-year-old wicketkeeper-batter has long since established himself as one of the leading limited-overs players in the world but so far his tour of Australia has continued a 56-cap Test career that, while not without highlights, is yet to live up to the same billing.Though a determined 207-ball rearguard on the final day of the second Test in Adelaide was commendable after coming in on a pair, dropped catches in that match and a rash dismissal during England’s first-innings collapse at the MCG have contributed to the 3-0 scoreline that leaves the tourists playing for pride in Sydney and Hobart. Continue reading...","content":null,"pubDate":"2022-01-01 18:00:02","full_description":"Jos Buttler says a chastening Ashes campaign – for himself and England – has not diminished his desire to remain a three-format player in international cricket. The 31-year-old wicketkeeper-batter has long since established himself as one of the leading limited-overs players in the world but so far his tour of Australia has continued a 56-cap Test career that, while not without highlights, is yet to live up to the same billing. Though a determined 207-ball rearguard on the final day of the second Test in Adelaide was commendable after coming in on a pair, dropped catches in that match and a rash dismissal during England’s first-innings collapse at the MCG have contributed to the 3-0 scoreline that leaves the tourists playing for pride in Sydney and Hobart. Asked if he still wanted to pursue Test cricket given his young family, his obvious market value in the less labour-intensive shorter formats and the recent decision by South Africa’s Quinton de Kock to become a white-ball specialist , Buttler said: “It’s certainly my ambition. I don’t think I’d have put as much into it as I have done if it wasn’t. “I have fantastic family support – they’re very supportive of me and my career, and make a lot of sacrifices for that. It’s certainly maintained my drive and ambition to try and play [Test cricket].” On De Kock, Buttler said: “That’s Quinton’s own personal situation. As a huge fan of his, I’m disappointed that he’s at that stage. I love watching him bat, keep wicket and play Test cricket. I commend him for making a decision that’s right for him. But I feel I’ve got that support and in a place where I want to try to make it work.” As such, the next two Tests represent an important time for Buttler and a number of teammates who want to secure places on the tour of the Caribbean in March. Who will select that squad is not a given, with the position of the head coach, Chris Silverwood, under review while he isolates in Melbourne due to a Covid case in his family. England are yet to report any cases beyond the three coaches and four family members who tested positive this week – Australia similarly cleared their latest tests after Travis Head’s diagnosis – and Buttler believes there is a determination among his teammates to put on a performance for those left behind. He said: “One thing is we’re massively in it all together. We live it all together and we want to play well for each other. It’s frustrating for Chris he’s not here with us – another complication of the tour – but we’re certainly very united. “There is an overriding sense of disappointment and frustration with the situation we’ve found ourselves in. We certainly don’t want to be a team to lose 5-0.” On the off-field distraction of Covid cases, he said: “A year ago, when something like this happened, it was a much bigger shock and more of a worry. At the moment it’s still a worry and waiting for a Covid test is a bit like playing rouletteat the minute.[But] we need to be in a place where Covid doesn’t stop everything. There will be positive cases throughout the tour. We hoped that wouldn’t be the case, but we’re trying to manage it as best as possible.”","image_url":"https://i.guim.co.uk/img/media/71796a84ffbc3b59e54391eb3bea4942bbcbf470/4_0_1540_924/master/1540.jpg?width=460&quality=85&auto=format&fit=max&s=38001b946c0b5d8a31fd3f4e56d1c1d4","source_id":"theguardian"},{"title":"MCA postpones local tournaments due to rising COVID-19 cases","link":"https://sportstar.thehindu.com/cricket/domestic/mumbai-cricket-association-mca-postpones-local-tournaments-rising-covid-cases/article38089078.ece","keywords":null,"creator":["PTI"],"video_url":null,"description":"The Mumbai Cricket Association (MCA) on Saturday decided to postpone its local tournaments due to the increasing COVID-19 cases in the state.","content":null,"pubDate":"2022-01-01 17:05:13","full_description":null,"image_url":null,"source_id":"sportstar"},{"title":"MCA Postpones Local Tournaments Due To Rising COVID-19 Cases","link":"https://sports.ndtv.com/cricket/mumbai-cricket-association-postpones-local-tournaments-due-to-rising-covid-19-cases-2683768","keywords":null,"creator":null,"video_url":null,"description":"The Mumbai Cricket Association on Saturday decided to postpone its local tournaments due to the increasing COVID19 cases in the state.","content":null,"pubDate":"2022-01-01 16:56:25","full_description":"The Mumbai Cricket Association on Saturday decided to postpone its local tournaments due to the increasing COVID19 cases in the state. \"Due to increasing COVID-19 cases in Mumbai, Kanga & Tournament Committee decided to postpone all MCA Tournaments including U-25 Shalini Bhalekar and Madhav Mantri E,F & G Div matches till further notic,\" MCA secretary Sanjay Naik and Joint Secretary Shahalam Shaikh stated in a note, which was uploaded on association's website. According to Municipal Corporation of Greater Mumbai (MCGM) bulletin, Mumbai reported 6,347 cases on Saturday.","image_url":"https://c.ndtvimg.com/2021-05/j7h9l54_cricket-generic-afp_625x300_15_May_21.jpg?im=FaceCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv"},{"title":"Anushka Sharma says ‘Hi from 2022’ after quirky New Years celebration with husband Virat Kohli; WATCH - PINKVILLA","link":"https://news.google.com/__i/rss/rd/articles/CBMijAFodHRwczovL3d3dy5waW5rdmlsbGEuY29tL2VudGVydGFpbm1lbnQvbmV3cy9hbnVzaGthLXNoYXJtYS1zYXlzLWhpLTIwMjItYWZ0ZXItcXVpcmt5LW5ldy15ZWFycy1jZWxlYnJhdGlvbi1odXNiYW5kLXZpcmF0LWtvaGxpLXdhdGNoLTk4MTg2MdIBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Anushka Sharma says ‘Hi from 2022’ after quirky New Years celebration with husband Virat Kohli; WATCH  PINKVILLAVirat Kohli Celebrates New Year With Anushka Sharma, India Teammates In South Africa | India Today  India TodayHappy New Year 2022: Virat Kohli, Sachin Tendulkar, Indian Cricket Fraternity Extend Greetings To Fa..  NDTV SportsVamika adorably says 'mama' as Anushka Sharma gives us a glimpse of her 'last evening of 2021'; WATCH  PINKVILLARahul Dravid joins India players in New Year celebrations in Centurion, R Ashwin shares 'beautiful' group photo  India TodayView Full coverage on Google News","content":null,"pubDate":"2022-01-01 16:41:24","image_url":null,"source_id":"google"},{"title":"Pace bowling arsenal ushers in glory days for Indian cricket","link":"https://sportstar.thehindu.com/cricket/bumrah-shami-siraj-ushers-glory-days-for-indian-cricket/article38088244.ece","keywords":null,"creator":["S. Dinakar"],"video_url":null,"description":"As India eyes a historic maiden Test series win on the South African soil, the focus will be on its rampaging pacemen.","content":null,"pubDate":"2022-01-01 15:31:45","full_description":null,"image_url":null,"source_id":"sportstar"},{"title":"\"If Your Flop Show Continues...\": Former Team India Selector Warns Cheteshwar Pujara - NDTVSports.com","link":"https://news.google.com/__i/rss/rd/articles/CBMijAFodHRwczovL3Nwb3J0cy5uZHR2LmNvbS9zb3V0aC1hZnJpY2EtdnMtaW5kaWEtMjAyMS0yMi9pZi15b3VyLWZsb3Atc2hvdy1jb250aW51ZXMtZm9ybWVyLXRlYW0taW5kaWEtc2VsZWN0b3Itd2FybnMtY2hldGVzaHdhci1wdWphcmEtMjY4MzQ4ONIBkgFodHRwczovL3Nwb3J0cy5uZHR2LmNvbS9zb3V0aC1hZnJpY2EtdnMtaW5kaWEtMjAyMS0yMi9pZi15b3VyLWZsb3Atc2hvdy1jb250aW51ZXMtZm9ybWVyLXRlYW0taW5kaWEtc2VsZWN0b3Itd2FybnMtY2hldGVzaHdhci1wdWphcmEtMjY4MzQ4OC9hbXAvMQ?oc=5","keywords":null,"creator":null,"video_url":null,"description":"\"If Your Flop Show Continues...\": Former Team India Selector Warns Cheteshwar Pujara  NDTVSports.com'He has to score runs': Former selector says Cheteshwar Pujara could face Test axe if his 'flop show continues'  Hindustan TimesIND vs SA: You Are A Senior Player, If Your Flop Show Continues Then You Will Have To Be Rested Soon – Sarandeep Singh On Cheteshwar Pujara  Cricket AddictorI feel the biggest problem is that Cheteshwar Pujara is again not thinking about runs: Aakash Chopra  CricTracker'Are we getting impatient?': Batting coach Rathour supports Rahane and Pujara, says 'They are trying their best'  Hindustan TimesView Full coverage on Google News","content":null,"pubDate":"2022-01-01 14:31:48","image_url":null,"source_id":"google"},{"title":"From England Tour To T20 World Cup: Team India's Full Schedule For 2022 - NDTV Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMihgFodHRwczovL3Nwb3J0cy5uZHR2LmNvbS9jcmlja2V0L2Z1bGwtc2NoZWR1bGUtb2YtaW5kaWFuLWNyaWNrZXQtdGVhbS1mb3ItMjAyMi10MjAtd29ybGQtY3VwLWVuZ2xhbmQtdG91ci1hbW9uZy1rZXktYXNzaWdubWVudHMtMjY4MzQ2M9IBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"From England Tour To T20 World Cup: Team India's Full Schedule For 2022  NDTV SportsSports in 2022: Here's what to look forward to  Times of IndiaFrom massive home season to T20 World Cup Down Under: Team India's cricket schedule for 2022  Hindustan TimesLooking ahead, what 2022 can potentially unveil in sport  The Indian ExpressSports events in 2022: World Cups, Asian Games, big year for Indian womens teams  The BridgeView Full coverage on Google News","content":null,"pubDate":"2022-01-01 13:35:33","image_url":null,"source_id":"google"},{"title":"From England Tour To T20 World Cup: Team India's Full Schedule For 2022 - NDTVSports.com","link":"https://news.google.com/__i/rss/rd/articles/CBMihgFodHRwczovL3Nwb3J0cy5uZHR2LmNvbS9jcmlja2V0L2Z1bGwtc2NoZWR1bGUtb2YtaW5kaWFuLWNyaWNrZXQtdGVhbS1mb3ItMjAyMi10MjAtd29ybGQtY3VwLWVuZ2xhbmQtdG91ci1hbW9uZy1rZXktYXNzaWdubWVudHMtMjY4MzQ2M9IBjAFodHRwczovL3Nwb3J0cy5uZHR2LmNvbS9jcmlja2V0L2Z1bGwtc2NoZWR1bGUtb2YtaW5kaWFuLWNyaWNrZXQtdGVhbS1mb3ItMjAyMi10MjAtd29ybGQtY3VwLWVuZ2xhbmQtdG91ci1hbW9uZy1rZXktYXNzaWdubWVudHMtMjY4MzQ2My9hbXAvMQ?oc=5","keywords":null,"creator":null,"video_url":null,"description":"From England Tour To T20 World Cup: Team India's Full Schedule For 2022  NDTVSports.comSports in 2022: Here's what to look forward to  Times of IndiaFrom massive home season to T20 World Cup Down Under: Team India's cricket schedule for 2022  Hindustan TimesLooking ahead, what 2022 can potentially unveil in sport  The Indian ExpressSports in 2022: Major sporting events in 2022 to look forward to  FirstpostView Full coverage on Google News","content":null,"pubDate":"2022-01-01 13:35:33","image_url":null,"source_id":"google"},{"title":"From England Tour To T20 World Cup: Team India's Full Schedule For 2022","link":"https://sports.ndtv.com/cricket/full-schedule-of-indian-cricket-team-for-2022-t20-world-cup-england-tour-among-key-assignments-2683463","keywords":null,"creator":null,"video_url":null,"description":"The Indian cricket team has an action-packed year ahead of it, with the T20 World Cup in Australia being the biggest assignment of 2022.","content":null,"pubDate":"2022-01-01 13:35:26","full_description":"The Indian cricket team has an action-packed year ahead of it, with the T20 World Cup in Australia being the biggest assignment of 2022. Team India will begin the year with the second Test against South Africa at the Wanderers in Johannesburg (January 3 to 7), followed by the third and the final Test of the series in Cape Town from January 11 to 15. India will also face South Africa in ODIs before hosting the West Indies and Sri Lanka. The international season will then take a break for IPL 2022 season, which will included two new teams from Lucknow and Ahmedabad. The India team will later tour England and will also play the Asia Cup before the T20 World Cup. Here is Team India's full schedule for 2022: Tour of South Africa: 2nd Test - January 3-7, Johannesburg 3rd Test - January 11-15, Cape Town 1st ODI - January 19, Paarl 2nd ODI - January 21, Paarl 3rd ODI - January 23, Cape Town Home series vs West Indies: 1st ODI - February 6, Ahmedabad 2nd ODI - February 9, Jaipur 3rd ODI - February 12, Kolkata 1st T20I - February 15, Cuttack 2nd T20I - February 18, Vizag 3rd T20I: February 20, Trivandrum Home series vs Sri Lanka: 1st Test - February 25-March 1, Bengaluru 2nd Test - March 5-9, Mohali 1st T20I: March 13, Mohali 2nd T20I: March 15, Dharamshala 3rd T20I: March 18, Lucknow International break in April-May (tentatively) due to Indian Premier League 2022 season. Home series vs South Africa: 1st T20I - June 9, Chennai 2nd T20I - June 12, Bengaluru 3rd T20I: June 14, Nagpur 4th T20I: June 17, Rajkot 5th T20I: June 19, Delhi Tour of England: One-off Test - July 1-5, Manchester (this match will be held in lieu of the 5th Test in Manchester last year that was called off due to a Covid outbreak in the Indian camp) 1st T20I - July 7, Southampton 2nd T20I - July 9, Birmingham 3rd T20I - July 10, Nottingham 1st ODI - July 12, London 2nd ODI - July 14, London 3rd ODI - July 17, Manchester Tour of West Indies: Dates yet to be announced. Asia Cup: Dates yet to be announced. T20 World Cup: October 16 to November 13. Promoted Tour of Bangladesh: Dates yet to be announced.","image_url":"https://c.ndtvimg.com/2021-12/89iatoeg_virat-kohli-rohit-sharma-afp_650x400_15_December_21.jpg?im=FeatureCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv"},{"title":"Factbox-Cricket-South Africa v India - second test","link":"https://www.thestar.com.my/sport/cricket/2022/01/01/factbox-cricket-south-africa-v-india---second-test","keywords":null,"creator":null,"video_url":null,"description":"JOHANNESBURG (Reuters) - Following is a factbox on the second test between South Africa and India, which starts on Monday. Read full story","content":null,"pubDate":"2022-01-01 12:58:00","full_description":"JOHANNESBURG (Reuters) - Following is a factbox on the second test between South Africa and India, which starts on Monday. WHERE? The Wanderers, Johannesburg (match to be played without spectators) WHEN? Jan. 3-7. Play starts at 1000 local time (0800 GMT) MATCH OFFICIALS Umpires: Marais Erasmus, Allahuddien Paleker (both South Africa) TV umpire: Adrian Holdstock (South Africa) Match referee: Andy Pycroft (Zimbabwe) SOUTH AFRICA (World ranking: 6) Squad: Dean Elgar (captain), Temba Bavuma, Kagiso Rabada, Sarel Erwee, Beuran Hendricks, George Linde, Keshav Maharaj, Lungi Ngidi, Aiden Markram, Wiaan Mulder, Keegan Petersen, Rassie van der Dussen, Kyle Verreynne, Marco Jansen, Glenton Stuurman, Prenelan Subrayen, Sisanda Magala, Ryan Rickelton, Duanne Olivier Coach: Mark Boucher INDIA (World ranking: 1) Squad: Virat Kohli (captain), KL Rahul, Mayank Agarwal, Cheteshwar Pujara, Ajinkya Rahane, Priyank Panchal, Shreyas Iyer, Hanuma Vihari, Rishabh Pant, Wriddhiman Saha, Ravichandran Ashwin, Jayant Yadav, Ishant Sharma, Mohammed Shami, Umesh Yadav, Jasprit Bumrah, Shardul Thakur, Mohammed Siraj Coach: Rahul Dravid HISTORY Previous tests in South Africa Matches: 21 South Africa wins: 10 India wins: 4 Draws: 7 Previous tests between the two nations at all venues Matches: 40 South Africa wins: 15 India wins: 15 Draws: 10 THIS SERIES Result: First test, Dec 26-30, Centurion Park: India won by 113 runs Remaining test: Third test, Jan 11-15, Newlands, Cape Town (Reporting by Nick Said)","image_url":null,"source_id":"thestar_my"},{"title":"Cricket-India head to happy hunting ground for second test v S Africa","link":"https://www.thestar.com.my/sport/cricket/2022/01/01/cricket-india-head-to-happy-hunting-ground-for-second-test-v-s-africa","keywords":null,"creator":null,"video_url":null,"description":"JOHANNESBURG (Reuters) - Victorious India will seek more of the same when the second test against South Africa starts at The Wanderers on Monday, but for the home side there is much to ponder as they try to level the series at a ground where they have never beaten the visitors. Read full story","content":null,"pubDate":"2022-01-01 12:56:00","full_description":"JOHANNESBURG (Reuters) - Victorious India will seek more of the same when the second test against South Africa starts at The Wanderers on Monday, but for the home side there is much to ponder as they try to level the series at a ground where they have never beaten the visitors. India’s comprehensive 113-run first test win was built on a solid first day with the bat and their hugely impressive pace attack on a spicy wicket, and sets them up for a first ever series win in South Africa. Injuries aside, India are unlikely to change their team, though the form of batsmen Cheteshwar Pujara and Ajinkya Rahane remains under scrutiny. The tourists won on their last visit to The Wanderers in 2018, a gutsy performance on a difficult wicket which captain Virat Kohli believes paved the way for their recent success abroad, including in Australia and England. \"It's a top start for us,\" Kohli said. \"It's always a difficult place to play against South Africa. We got so much confidence out of Johannesburg last time. It's a ground we love playing at.\" India have recorded two wins and three draws in their previous five tests at the venue. South Africa will be forced into at least one change, with wicketkeeper-batsman Quinton de Kock always set to miss the final two games of the series while on paternity leave. However, he then made his absence from the five-day format permanent after unexpectedly announcing his retirement following the first test loss. Kyle Verreynne kept wicket in De Kock’s absence in the West Indies in June and is likely to get the nod again, though uncapped left-hander Ryan Rickelton has been in excellent form with the bat in domestic cricket. The home side could select Duanne Olivier as a fifth seam option in the place of spinner Keshav Maharaj, who failed to take a wicket in the first test and did not bowl at all in India’s second innings. It is likely they will keep faith with 21-year-old left-arm seamer Marco Jansen, who took 5-124 on debut in the first test and grew into the game after a slow start. \"I don't think we'll lack any confidence heading into Johannesburg but it's never nice losing a game, especially when we know where we went wrong,\" South Africa captain Dean Elgar said. \"It's difficult to correct those wrongs during a game, but building into the second test, we'll have some time to reflect around what has happened.\" (Reporting by Nick Said, editing by Pritha Sarkar)","image_url":"https://apicms.thestar.com.my/uploads/images/2022/01/01/1428208.jpg","source_id":"thestar_my"},{"title":"'I was feeling Pant was first candidate as vice-captain': Ex-India selector 'extremely surprised' at Bumrah's VC role - Hindustan Times","link":"https://news.google.com/__i/rss/rd/articles/CBMirAFodHRwczovL3d3dy5oaW5kdXN0YW50aW1lcy5jb20vY3JpY2tldC9pLXdhcy1mZWVsaW5nLXBhbnQtd2FzLWZpcnN0LWNhbmRpZGF0ZS1hcy12aWNlLWNhcHRhaW4tZXgtaW5kaWEtc2VsZWN0b3ItZXh0cmVtZWx5LXN1cnByaXNlZC1hdC1idW1yYWgtcy12Yy1yb2xlLTEwMTY0MTA0MTQ1NzQyNi5odG1s0gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"'I was feeling Pant was first candidate as vice-captain': Ex-India selector 'extremely surprised' at Bumrah's VC role  Hindustan TimesRahul named captain for South Africa ODIs; Ashwin returns | Cricbuzz.com - Cricbuzz  CricbuzzJust In: Rohit Sharma Misses Out, KL Rahul Named Captain As BCCI Announces 18-Men Squad For South Africa ODIs  Cricket AddictorBumrah’s elevation as ‘stop-gap’ ODI deputy ahead of Pant, Iyer is selectors’ way of “avoiding clutter”  The HinduBumrah's elevation as 'stop-gap' ODI deputy ahead of Pant and Iyer is selectors' way of 'avoiding clutter  Times of IndiaView Full coverage on Google News","content":null,"pubDate":"2022-01-01 12:55:20","image_url":null,"source_id":"google"},{"title":"Beating India in T20 World Cup best moment of 2021 for Pak team: Babar Azam","link":"https://www.indiatvnews.com/sports/cricket/beating-india-in-t20-world-cup-best-moment-of-2021-for-pak-team-babar-azam-752272","keywords":null,"creator":null,"video_url":null,"description":"Pakistan captain Babar Azam has termed the jinx-breaking win over India in the T20 World Cup as the \"best moment\" for his team in the year gone by. Summing up the year in a podcast released by the Pakistan Cricket Board on Friday, Babar said that losing to Australia in the semifinal stage of the same event was most disappointing for the entire side.","content":null,"pubDate":"2022-01-01 12:38:29","full_description":"Pakistan captain has termed the jinx-breaking win over India in the T20 World Cup as the \"best moment\" for his team in the year gone by. Summing up the year in a podcast released by the Pakistan Cricket Board on Friday, Babar said that losing to Australia in the semifinal stage of the same event was most disappointing for the entire side. \"That defeat hurt me the most this year because we had been playing so well and as a combined unit,\" he said. Babar said beating India for the first time in a World Cup match was the high point for him in 2021. Pakistan defeated India by 10 wickets in the lopsided match. \"It was a fantastic achievement for us as a team because we had not been able to beat India in the World Cups for so many years. It was our best moment of the year,\" he said. He said the win over India also lifted the profile of the team and gave the players enormous confidence which was visible in the T20 and Test wins in Bangladesh and later at home against the West Indies. Babar said the Pakistan team progressed and achieved a lot last year. \"The biggest satisfaction was seeing young talent come through for us at crucial times. It is good we are now producing young talent,\" he pointed out. About his own achievements with the bat, Babar said personal milestones gave him joy when they helped the team win.","image_url":null,"source_id":"indiatvnews"},{"title":"AMR vs GGI Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update- FanCode Oman D20 - Cricket Addictor","link":"https://news.google.com/__i/rss/rd/articles/CBMioAFodHRwczovL2NyaWNrZXRhZGRpY3Rvci5jb20vY3JpY2tldC1uZXdzL2Ftci12cy1nZ2ktZHJlYW0xMS1wcmVkaWN0aW9uLWZhbnRhc3ktY3JpY2tldC10aXBzLWRyZWFtMTEtdGVhbS1wbGF5aW5nLXhpLXBpdGNoLXJlcG9ydC1pbmp1cnktdXBkYXRlLWZhbmNvZGUtb21hbi1kMjAv0gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"AMR vs GGI Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update- FanCode Oman D20  Cricket AddictorOman D20 2021, Amerat Royals vs Ghubrah Giants: Probable XIs, match prediction, weather forecast, pitch report and live streaming details  SportskeedaOman D20 League 2021/22, Match 26: AMR vs GGI Dream11 Prediction, Fantasy Cricket Tips, Playing 11, Pitch Report, and Injury Update  CricTrackerCricket Betting Tips and Fantasy Cricket Match Predictions: Oman D20 2021-22 - Qurum Thunders vs Bousher Busters, Match 29: 2nd Jan  Cricket WorldRUR vs DAT Dream11 Prediction: Fantasy Cricket Tips, Today's Playing 11 and Pitch Report for Oman D20 2021-22, Match 27  SportskeedaView Full coverage on Google News","content":null,"pubDate":"2022-01-01 12:15:11","image_url":null,"source_id":"google"},{"title":"Cricket 2022 calendar: Complete schedule, match timings, dates, venues","link":"https://sportstar.thehindu.com/cricket/complete-2022-cricket-calendar-schedule-india-match-timings/article38086594.ece","keywords":null,"creator":["Team Sportstar"],"video_url":null,"description":"From the ICC Under-19 World Cup 2022 in West Indies to Women's Cricket World Cup in New Zealand, here's the complete cricket schedule of 2022.","content":null,"pubDate":"2022-01-01 11:48:10","full_description":null,"image_url":null,"source_id":"sportstar"},{"title":"Bumrah's elevation as 'stop-gap' ODI deputy ahead of Pant and Iyer is selectors' way of 'avoiding clutter - Times of India","link":"https://news.google.com/__i/rss/rd/articles/CBMixgFodHRwczovL3RpbWVzb2ZpbmRpYS5pbmRpYXRpbWVzLmNvbS9zcG9ydHMvY3JpY2tldC9pbmRpYS1pbi1zb3V0aC1hZnJpY2EvYnVtcmFocy1lbGV2YXRpb24tYXMtc3RvcC1nYXAtb2RpLWRlcHV0eS1haGVhZC1vZi1wYW50LWFuZC1peWVyLWlzLXNlbGVjdG9ycy13YXktb2YtYXZvaWRpbmctY2x1dHRlci9hcnRpY2xlc2hvdy84ODYzNDAyMS5jbXPSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Bumrah's elevation as 'stop-gap' ODI deputy ahead of Pant and Iyer is selectors' way of 'avoiding clutter  Times of IndiaRahul named captain for South Africa ODIs; Ashwin returns | Cricbuzz.com - Cricbuzz  CricbuzzJust In: Rohit Sharma Misses Out, KL Rahul Named Captain As BCCI Announces 18-Men Squad For South Africa ODIs  Cricket AddictorODI captaincy row, KL Rahul as future captain: Major talking points from Chetan Sharma`s press conference  WIONNominees for Sir Garfield Sobers Trophy for the ICC Player of the Year revealed  International Cricket CouncilView Full coverage on Google News","content":null,"pubDate":"2022-01-01 11:03:00","image_url":null,"source_id":"google"},{"title":"Kieron Pollard fit to lead West Indies for visits of Ireland, England - ESPNcricinfo","link":"https://news.google.com/__i/rss/rd/articles/CBMib2h0dHBzOi8vd3d3LmVzcG5jcmljaW5mby5jb20vc3Rvcnkva2llcm9uLXBvbGxhcmQtZml0LXRvLWxlYWQtd2VzdC1pbmRpZXMtZm9yLXZpc2l0cy1vZi1pcmVsYW5kLWVuZ2xhbmQtMTI5NDk4NdIBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Kieron Pollard fit to lead West Indies for visits of Ireland, England  ESPNcricinfoNo Chris Gayle for Ireland and England cricket matches; CWI insists it will honour the legend | Cricbuzz.com - Cricbuzz  CricbuzzGayle left out of West Indies squad for Ireland, England series; CWI to plan fitting farewell for 'phenomenal performer'  Hindustan TimesKieron Pollard to Lead West Indies in Limited-overs Series against Ireland & England  News18Kieron Pollard back in Windies white-ball squads for Ireland, England  The Indian ExpressView Full coverage on Google News","content":null,"pubDate":"2022-01-01 10:26:38","image_url":null,"source_id":"google"},{"title":"‘His International Career is Done’: Here’s How Ashwin Utilised the Pandemic To Answer His Critics - News18","link":"https://news.google.com/__i/rss/rd/articles/CBMikgFodHRwczovL3d3dy5uZXdzMTguY29tL2NyaWNrZXRuZXh0L25ld3MvaGlzLWludGVybmF0aW9uYWwtY2FyZWVyLWlzLWRvbmUtaGVyZXMtaG93LWFzaHdpbi11dGlsaXNlZC10aGUtcGFuZGVtaWMtdG8tYW5zd2VyLWhpcy1jcml0aWNzLTQ2MTQxOTcuaHRtbNIBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"‘His International Career is Done’: Here’s How Ashwin Utilised the Pandemic To Answer His Critics  News18'Sometimes it hurts': Ravichandran Ashwin recalls hearing 'he is finished' murmurs, says people wrote him off  Hindustan TimesThe Only Thing I Wanted To Achieve In Life Was To Make Sure That I Go Back, Die On The Cricket Field Trying To Win A Game – Ravichandran Ashwin On SCG Test  Cricket AddictorRavichandran Ashwin Emotional Interview: Why Am I Even A Son If I Cannot Get Back To My Ailing Father and Fam  India.com‘Kept hearing I am finished’ – Ravi Ashwin opens up on the time when people wrote him off  CricTrackerView Full coverage on Google News","content":null,"pubDate":"2022-01-01 09:59:21","image_url":null,"source_id":"google"},{"title":"Ruturaj Gaikwad has been given opportunity at the right time, can do wonders for India: Chetan Sharma - India Today","link":"https://news.google.com/__i/rss/rd/articles/CBMipQFodHRwczovL3d3dy5pbmRpYXRvZGF5LmluL3Nwb3J0cy9jcmlja2V0L3N0b3J5L3J1dHVyYWotZ2Fpa3dhZC1oYXMtYmVlbi1naXZlbi1vcHBvcnR1bml0eS1hdC10aGUtcmlnaHQtdGltZS1jYW4tZG8td29uZGVycy1mb3ItaW5kaWEtY2hldGFuLXNoYXJtYS0xODk0ODM5LTIwMjItMDEtMDHSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Ruturaj Gaikwad has been given opportunity at the right time, can do wonders for India: Chetan Sharma  India TodayRahul named captain for South Africa ODIs; Ashwin returns | Cricbuzz.com - Cricbuzz  CricbuzzIND vs SA: Why Jasprit Bumrah Has Been Made India ODI Captain Ahead of Rishabh Pant And Shreyas Iyer?  News18Just In: Rohit Sharma Misses Out, KL Rahul Named Captain As BCCI Announces 18-Men Squad For South Africa ODIs  Cricket AddictorWe think Ruturaj Gaikwad will do wonders for the country: Chetan Sharma  CricTrackerView Full coverage on Google News","content":null,"pubDate":"2022-01-01 09:45:25","image_url":null,"source_id":"google"},{"title":"New Star Club beat SG Club by 7 wickets in the Assam Premier Club Cricket Championship","link":"https://www.sentinelassam.com/north-east-india-news/local-sports/new-star-club-beat-sg-club-by-7-wickets-in-the-assam-premier-club-cricket-championship-570910","keywords":["Sports,Local Sports"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"New Star Club beat SG Club by 7 wickets in the Assam Premier Club Cricket Championship tie held at Amingaon ground here today. Arun Sonar of New Star scored half century in the game.","content":"Our Sports Reporter GUWAHATI: New Star Club beat SG Club by 7 wickets in the Assam Premier Club Cricket Championship tie held at Amingaon ground here today. Arun Sonar of New Star scored half century in the game. Brief scores: SG Club 115 (37.5 overs), Shivam Nath (35), Prince Thakur 4-24; New Star Club 118-3 (20.4 overs), Arun Sonar 57. Also Read: Smriti Mandhana nominated for ICC Women's Cricketer of the Year award Also Watch:","pubDate":"2022-01-01 09:12:47","full_description":"Our Sports Reporter GUWAHATI: New Star Club beat SG Club by 7 wickets in the Assam Premier Club Cricket Championship tie held at Amingaon ground here today. Arun Sonar of New Star scored half century in the game. Brief scores: SG Club 115 (37.5 overs), Shivam Nath (35), Prince Thakur 4-24; New Star Club 118-3 (20.4 overs), Arun Sonar 57. Also Read: Smriti Mandhana nominated for ICC Women's Cricketer of the Year award Also Watch:","image_url":"https://assets.sentinelassam.com/h-upload/2022/01/01/291626-8.jpg","source_id":"sentinel"},{"title":"From de Kock to Unmukt: Cricketers who shocked the cricketing universe with retirement announcement in 2021 - Times Now","link":"https://news.google.com/__i/rss/rd/articles/CBMirgFodHRwczovL3d3dy50aW1lc25vd25ld3MuY29tL3Nwb3J0cy9jcmlja2V0L2FydGljbGUvZnJvbS1xdWludG9uLWRlLWtvY2stdG8tdW5tdWt0LWNoYW5kLWNyaWNrZXRlcnMtd2hvLXNob2NrZWQtdGhlLWNyaWNrZXRpbmctdW5pdmVyc2Utd2l0aC1yZXRpcmVtZW50LWFubm91bmNlbWVudC1pbi84NDUzMzTSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"From de Kock to Unmukt: Cricketers who shocked the cricketing universe with retirement announcement in 2021  Times NowThe real Quinton de Kock stands up | Cricbuzz.com  CricbuzzSouth Africa vs India 2nd Test: Quinton de Kock's retirement cripples batting further, says Hashim Amla  India TodayIND vs SA: I Am A Bit Shocked By His Decision- Alviro Petersen On Quinton De Kock's Test Retirement  Cricket AddictorShocked by Quinton de Kocks decision to retire from Test cricket, says Alviro Pietersen  FirstpostView Full coverage on Google News","content":null,"pubDate":"2022-01-01 09:07:00","image_url":null,"source_id":"google"}]}