{"newsArray":[{"article_id":"a8f4cb5180e69b4fb6f09616e652fe3c","title":"Patrick Mahomes boasts the NFL's biggest contract and will earn a staggering $210m over the next four years... but who are the best-paid stars of the world's other top sports?","link":"https://www.dailymail.co.uk/sport/nfl/article-12544339/Patrick-Mahomes-Kansas-City-Chiefs-QB-highest-paid-HISTORY.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"In light of the 28-year-old's landmark contract, Mail Sport's Dominic Hogan takes you through the biggest earners in some of the world's most popular sports over the last year.","content":"Patrick Mahomes boasts the NFL's biggest contract and will earn a staggering $210m over the next four years... but who are the best-paid stars of the world's other top sports? Patrick Mahomes made history with his contract restructuring at the Chiefs Cristiano Ronaldo boasts the biggest contract in sport with a £175m-a-year deal The highest salary in MLB belongs to not one but TWO legendary pitchers By Dominic Hogan For Mailonline Published: 20:07, 24 September 2023 | Updated: 20:15, 24 September 2023 e-mail View comments This week NFL superstar quarterback Patrick Mahomes restructured his already eye-watering deal with the Kansas City Chiefs that will see the two-time Super Bowl winner shoot back up the division's list of highest paid stars. Mahomes had previously set the record for the biggest contract in NFL history, after he was tied down to a 10-year, £365.6million ($450m) deal that more or less blew the market out of the water, at least where quarterbacks are concerned. Just like when Neymar joined Paris Saint-Germain from Barcelona , the going rate for quarterbacks' services across the NFL has rocketed, with the likes of Joe Burrow (£44.8m) , Justin Herbert (£42.7m) and Lamar Jackson (£42.4m) taking home huge annual sums. Now Mahomes has taken his previous record to a new level, and after restructuring his deal, he is set to rake in some £170m ($210.6m) from 2023-2026, making him the highest paid American Football player in history over a four-year period - although Burrow still out-earns him in terms of a one-year salary. In light of the 28-year-old's landmark contract, Mail Sport's Dominic Hogan takes you through the biggest earners in some of the world's most popular sports over the last year. Patrick Mahomes put pen to paper on a record-breaking deal that earns him £170million a year between 2023 and 2026 Joe Burrow currently earns more per year than any other player in the NFL at £44.8million Football - Cristiano Ronaldo, £175m per year Football is the world's most popular sport, and the fact that one of its greatest ever stars is one of the highest paid athletes in the world, should come as no surprise. The Portuguese icon's credentials need not be reiterated, but let's indulge ourselves; five Ballon d'Or awards, five Champions Leagues, 19-time top goal scorer, seven-time domestic league winner, a European Champion with Portugal and proud owner of some 34 total winners' medals. Although synonymous with Real Madrid's dominance of Europe in the 2010s and for his breakout performances at Manchester United, Ronaldo now plies his trade in Saudi Arabia with Al-Nassr after his acrimonious departure from the Red Devils. The price for bringing in one of the game's greatest exponents? Just a cool £175m a year. And that's on top of all the other endorsements, business ventures, sponsorships and social media money that the 38-year-old earns. Astonishing. The money that Saudi Pro League sides have been able to offer, particularly this summer, has proven a shock to the system, even for football's regular financial power houses like Manchester City, PSG and Real Madrid. This recent transfer window alone the Gulf state has seen the arrival of the likes of Naymer (£130m per-year), Karim Benzema (£86m p/y), N'Golo Kante (£86m p/y) and Jordan Henderson (£36.4m p/y) on massive annual packages. With the Pro League showing little sign of slowing down, it might not be long before Ronaldo's spot is toppled as football's biggest earner. Cristiano Ronaldo has the most expensive contract in football with his £175million-a-year deal The Portuguese icon is perhaps best known for his time at the all-dominating Real Madrid team of the 2010s He became one of the first major European stars to join the Saudi Pro League after an acrimonious departure from Manchester United Golf - Viktor Hovland, £26.2m in 2023 In a year of seismic change for golf, with the shock merger between the formerly rival PGA and LIV tours, there is at least a note of continuity in the huge sums that the sport's biggest names took home in the last year. But chief among the beneficiaries was Viktor Hovland, who only finished third in the regular season in the earnings rankings with around $14.11m (£11.5m), but after winning the FedEx Cup , he increased his take-home by a stunning 127 per cent, adding a further $18m (£14.7m) to reach approximately £26.2m. Scottie Scheffler had topped the PGA Tour's money rankings so far in 2023, with a huge $21m (£17.1m), but managed to add just $2m (£1.6m) in the FedEx cup to finish on around £18.7m - not exactly a sum to be sniffed at. Despite winning two Majors this year - the Open Championship and the Masters - Jon Rahm ended up on a combined £14.6m ($18m), although he played 17 fewer rounds on the PGA Tour than the other two. The LIV Tour saw Dustin Johnson take home some $46.1m (£37.6m) in total last year, having taken home £14.6m ($18m) for topping the rankings at the end of the season, but this year's leader at the moment is Talor Gooch with $14.1m (£11.5m) although there are still three events in the LIV Golf League to play in 2023. Viktor Hovland topped the PGA Tour's earnings list for 2023 taking home around £26.2m in winnings The Norwegian's victory in the FedEx cup saw him earn an extra £14.6m ($18m) on top of his season's winnings F1 - Lewis Hamilton, £50m-per-year Lewis Hamilton may not be the fastest man in the Formula One paddock this season, but he has certainly reclaimed his title as the sport's highest earner. After Max Verstappen put pen to paper on a deal that would earn him £40m-a-year for five years in 2022, Hamilton penned a contract of his own in August that sees him one-up his rival, taking home £50m-a-year . There had been some concern over whether the seven-time world champion would continue his legend in the sport at the age of 38, but much like Ronaldo he is proving that he still has unfinished business and has committed to a two-year deal that will keep him at the Silver Arrows until at least 2025. However, Mail sport understands that Hamilton had been keen for a five-year extension at the time of negotiations, with a source telling us: 'Lewis wants five years, and if it were just a one-year extension I don't think he'd accept it. 'They may need to reach a compromise because, while George (Russell) has probably made peace with the idea of Lewis being around for a couple of years, he might not accept being in the shadow of his team-mate for the long-term. 'There is always a lure about Ferrari, but Lewis will probably think that his only hope of winning his eighth title is by staying where he is. 'Money is not a delaying factor.' Two-years it was, though, although Hamilton will surely not be turning his nose up at the surety of £100m for his troubles for the length of his new contract. Lewis Hamilton signed a new two-year deal to stay at Mercedes earning him some £50m-per-year Max Verstappen is currently the highest paid driver in F1 - but that title is under threat UFC - Israel Adesanya, £5.49m in 2023 The UFC's rich list has undeniably been dominated by Conor McGregor over the last few years, with the Irishman still holding the record for a single fight purse at £18.8m ($23m), but 2023 belonged to Israel Adesanya. 'Issy' was in action twice this year losing once and winning the other, but even in defeat the Nigerian-born fighter landed a heavy purse for his troubles - perhaps heavier than winner Sean Strickland . In his April victory over arch nemesis Alex Pereira Adesanya scooped up around £2.6m ($3.2m); £1.6m ($2m) from his Pay-Per-View shares, £815,000 ($1m) base pay for the fight, £26,100 ($32,000) in sponsorships and £40,800 ($50,000) in performance bonuses, plus additional extras. It was against his Brazilian rival at UFC 287 that Adesanya regained his middleweight crown after losing it in November 2022, but his new reign as king of the division would last just five months before a shock defeat to Strickland earlier this month - although his earnings may have softened that blow at UFC 293 . Another £815,000 ($1m) in base salary and £34,200 ($42,000) in sponsorship came his way, but coming in as reigning middleweight champion, his PPV earnings went up a notch and he brought home some £2.04m ($2.5m), meaning that with a grand total of £2.89m - almost £300,000 more than he earned in victory. 'Issy' may not have the business portfolio of McGregor, but he is absolutely killing it in the octagon, and out-earned Strickland (£1.22m) on the night by more than double. Israel Adesanya may have lost to Sean Strickland but he still took home around £5.49m in 2023 Adesanya fought twice in 2023, beating arch nemesis Alex Pereira in April before defeat to Strickland in September NBA - Steph Curry, £42.8m per year It is perhaps strange that two of the game's all-time greats might both hail from the same small town in Ohio, but Akron can lay claim to both LeBron James and Steph Curry. Both have obviously had storied careers in basketball, but after to-ing and fro-ing for the unofficial claim to being the NBA's best player, it's Curry who has topped the charts for annual earnings for the last seven years. His current deal sees the Golden State Warriors star earn some £42.8m a year - narrowly pipping the Chicago Bulls' Zach Lavine (£42.79m) in the money lists - and there's no arguing that the 35-year-old is worth every penny of it. Four championship rings, 2022 Finals MVP, two-time NBA MVP, nine-time all-star - his name has even lent itself to every single speculative attempt to throw anything at a designated target from an arbitrary 'three-point line'. Curry's terminator-esque accuracy from the free-throw line, outrageous three-point success rate and his all-round offensive talent make him one of the sport's all-time greats . There aren't many that would begrudge him his title as the NBA's top-earner. Stephen Curry (right), of the Golden State Warriors, earns the biggest salary in the NBA Curry's ruthless offensive talents and unerring accuracy from range make him one of the NBA's all-time greats NFL - Patrick Mahomes, £170m-a-year (2023-26) As we've already established, Mahomes has recently claimed the title of the NFL's best paid player until 2026, having restructured his already titanic deal. Joe Burrow currently leads the way in terms of an annual salary (£44.8m - £42.5m), but Mahomes' is a record over a four-year period, with the money on his initial £367m deal being moved around, and reports suggest that his agent will sit back down with the Chiefs in 2026 for further talks. Mahomes will make £46.2m ($56.9m) this season, £36.2m ($44.5m) next season, £40.7m ($50m) in 2025 and £46.2m ($56.8m) for the 2026 season. Mahomes signed his original 10-year deal three years ago, and has already delivered on that with a second Super Bowl MVP award earlier in February. Still just 28, Mahomes is approaching his prime - which in itself is a scary thought - and by the time his mammoth contract does eventually run up, he will be 36, and is sure to have added more rings to his budding collection. The Texan has already passed for 24,772 yards, 196 touchdowns and 51 interceptions in 82 starts since the Chiefs drafted him as the 10th overall pick in the first round of the 2017 draft. Patrick Mahomes revs up the crowd in Kansas City ahead of the Chiefs' 2023 season opener Mahomes is a two-time Super Bowl winner and has now reworked his contract with the Chiefs The 28-year-old will earn £46.2m ($56.9m) this season, £36.2m ($44.5m) next season, £40.7m ($50m) in 2025 and £46.2m ($56.8m) for the 2026 season Tennis - Novak Djokovic, £8.62m in winnings in 2023 What is there left to say about Serbia's all-consuming tennis god? The only real arguments left against the claim that he's the greatest of all time are built off semantics, or made by hardcore doubles enthusiasts. Even those of us that prefer to enjoy the fact we've lived through a time dominated by the three best male players to pick up a racket have run out of words to described Djokovic, and here he is, continuing to pick up trophy after trophy, accolade after accolade, record after record. Djokovic has scooped up a stunning £8.62m in winnings this year so far, in part due to his Australian, French and US Open heroics, which won him a combined £6.86m alone, with the Serb also picking up a further five titles, with a runners-up plate at Wimbledon earning him another £1.2m. Djokovic is not only the top-earner for 2023, but is the most successful tennis player of all-time in terms of money earned, winning a staggering £143m across his career, finishing the year on top of the money rankings a record five times to boot. Nobody has earned more money in the history of tennis than Serbian great Novak Djokovic Djokovic won three Grand Slams in 2023, losing only the final of Wimbledon to Carlos Alcaraz Cricket - Virat Kohli, £6.74m a year Unlike most of the sports on this list, cricket's payment structure is far from simple. As well as receiving an annual fee from your international cricket council based on a tiered system of relative importance to the side, players will pick up match fees in all three international formats (Test, T20I, ODI) that they take part in, and earn contracts at franchise teams all around the world. For Virat Kohli, though, that all translates to a reported salary of around £561,000-a-month overall, as per GQ, which translates to £6.74m-a-year - which is more than fair enough for one of the greatest batters of his generation, and perhaps in India's long and rich cricketing history. For some fans across India, where cricket enjoys an undisputed place at the pinnacle of the sporting pyramid, the former all-format captain is the star of the show, perhaps the most recognisable face in the country. At his IPL team Royal Challengers Bangalore he earns around £1.5m from the Indian Premier League alone, and around £685,000 from the BCCI. Kohli is another athlete on this list who profits hugely from his massive social media following, with a whopping 259 Instagram followers. Reports claim that Kohli - the most followed person from Asia on Instagram - can earn as much as $1.2m per sponsored post. All sports have their superstar, and Kohli is well and truly cricket's offering. Virat Kohli is unsurprisingly cricket's highest earning player and reportedly takes home £561,000-a-month Kohli is a former captain in all three formats for India, and is one of their greatest batters ever produced Rugby - Richie Mo'unga, £1.2m a year New Zealand’s All-star No 10 Richie Mo’unga is believed to lead the way in rugby - a sport that in the UK has struggled financially in the wake of the Covid outbreak. Mo’unga is thought to lead the likes of England and Saracens duo Owen Farrell and Maro Itoje and South Africa and Leicester Tigers star Handre Pollard, on a deal worth around £1.2m-a-year at Toshiba Brave Lupus in Japan. In addition to that, the All-blacks fly half will pick up around £3,600-per-week spent with the national team which of course takes the sum even higher. However, that’s one thing that the 29-year-old won’t be able to rely on much longer. New Zealand’s fabled national team have eligibility rules in place which stipulate that only those plying their trade domestically will be able to pull on the iconic black jersey. A number of players have played abroad on a sabbatical basis, while still committing themselves to New Zealand Rugby in the long term, but the fly-half’s three year deal starting in 2024 means that he will likely walk away from the All-Blacks at the end of the current World Cup. If there’s one think New Zealand aren’t lacking in, it’s world class rugby players. But even with Beauden Barrett likely to retake his old No 10 jersey, Mo’unga’ did a absence that would likely be felt in any team in world rugby. Richie Mo'unga leads rugby's rich list after agreeing a three-year contract from the start of next season in Japan MLB - Justin Verlander and Max Scherzer, £35.3m-a-year As for Major League Baseball, it’s a huge £35.3m-a-year ($43.3m) for not one but two veterans of the game in the shape of Justin Verlander at the Houston Astros and Max Scherzer with the Texas Rangers. Both pitchers were on the books at the New York Mets before a late move to cut costs saw both veterans of the MLB leave the franchise. The key to success as a pitcher is an extensive bag of tricks, an experienced mind and a list of variations as long as your arm and that’s just what these two can boast. There’s a good reason that no player in MLB history has ever been paid as much as they have. Max Scherzer signed a three-year deal worth $130m with the Mets back in 2021 before joining the Rangers Justin Verlander has come in for some scrutiny recently after being caught telling the Red Sox manager to 'f*** off' Scherzer’s deal was signed in December 2021 for £106m ($130m) over three years, while Verlander's was a two-year contract worth £70.6m ($86.7m). While Scherzer is taking home the big bucks at the Rangers, he is already looking likely to miss a significant portion of the regular season, after reportedly suffering a shoulder strain. For Verlander, meanwhile, reports emerged last month that he had built up something of a 'diva' attitude at the Mets before he was traded, and was thought to have clashed with Scherzer and some of his other team-mates. Having been caught on camera telling the Red Sox manager Alex Cora to 'f*** off' , the veteran pitcher could be heading into some hot water with an inauspicious end to the 2023 season. Share or comment on this article: Patrick Mahomes boasts the NFL's biggest contract and will earn a staggering $210m over the next four years... but who are the best-paid stars of the world's other top sports? e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-09-24 19:15:17","image_url":"https://i.dailymail.co.uk/1s/2023/09/22/15/75731705-0-image-a-10_1695392595712.jpg","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"6196798217a888fe5b496fe2a661b439","title":"Shreyas Iyer On Virat Kohli: श्रेयस अय्यरने दिल हृदयस्पर्शी विधान, विराट कोहलीच्या ऐवजी फलंदाजीवर बोलली मोठी गोष्ट","link":"https://marathi.latestly.com/sports/cricket/shreyas-iyer-gave-a-heart-winning-statement-said-a-big-thing-on-batting-instead-of-virat-kohli-493622.html","keywords":null,"creator":null,"video_url":null,"description":"अय्यरने 11 चौकार-3 षटकार मारले आणि 90 चेंडूत एकूण 105 धावा केल्या. मात्र, यावेळी तो डाव्या हाताच्या दुखण्याने ओरडताना दिसला. सामन्यानंतर त्याला त्याच्या स्फोटक फलंदाजीसाठी सामनावीराचा पुरस्कार देण्यात आला. यानंतर, मॅच प्रेझेंटेशन दरम्यान त्यांनी एक हृदयस्पर्शी विधान केले.","content":"रविवारी इंदूरच्या होळकर स्टेडियमवर खेळल्या गेलेल्या भारत आणि ऑस्ट्रेलिया (IND vs AUS) यांच्यातील दुसऱ्या एकदिवसीय सामन्यात भारतीय संघाने 99 धावांनी दणदणीत विजय नोंदवला. या सामन्यात श्रेयस अय्यरने (Shreyas Iyer) तिसऱ्या क्रमांकावर शानदार फलंदाजी करताना स्फोटक शतक झळकावले. अय्यरने 11 चौकार-3 षटकार मारले आणि 90 चेंडूत एकूण 105 धावा केल्या. मात्र, यावेळी तो डाव्या हाताच्या दुखण्याने ओरडताना दिसला. सामन्यानंतर त्याला त्याच्या स्फोटक फलंदाजीसाठी सामनावीराचा पुरस्कार देण्यात आला. यानंतर, मॅच प्रेझेंटेशन दरम्यान त्यांनी एक हृदयस्पर्शी विधान केले. (हे देखील वाचा: Pakistan Cricket: पाक खेळाडू आणि PCB वाद पेटला, गेल्या 4 महिन्यांपासून मिळाली नाही मॅच फी, बाबर आणि कंपनी वर्ल्ड कपमध्ये करणार विरोध? ) गेल्या काही महिन्यांपासून मी खूप मेहनत घेत आहे श्रेयस अय्यर म्हणाला- दुखापतीनंतर परतणे एखाद्या रोलरकोस्टर राईडसारखे होते. माझे सहकारी, मित्र आणि कुटुंबीय मला पाठिंबा देण्यासाठी तिथे होते. मी टीव्हीवर सामने बघायचो. आता परत येण्यासाठी आणि ड्रेसिंग रूममधील वातावरणाचा आनंद घेण्यासाठी मी उत्साहित आहे. गेल्या काही महिन्यांपासून मी खूप मेहनत घेत आहे. सामन्यादरम्यान मला सतत वेदना आणि काटेरीपणा जाणवत होता, परंतु मला माहित होते की माझे ध्येय काय आहे. आज मी माझ्या योजना पूर्णतः अंमलात आणण्यात यशस्वी झालो याचा आनंद आहे. जेव्हा मी फलंदाजीला गेलो तेव्हा गोष्टी गुंतागुंती करू इच्छित नव्हतो. विराट कोहलीकडून नंबर-3 चे स्थान हिसकावण्याची शक्यता नाही. यानंतर श्रेयसने हृदय जिंकणारे वक्तव्य केले. तो म्हणाला- मी कोणत्याही स्थितीत फलंदाजी करण्यास लवचिक आहे. माझ्या संघाला काहीही करावे लागले तरी मी कोणत्याही स्थितीत फलंदाजी करण्यास तयार आहे. विराट कोहली महान खेळाडूंपैकी एक आहे. त्याच्याकडून ३ क्रमांकाची जागा हिसकावण्याची शक्यता नाही. मला फक्त स्कोर करत राहायचे आहे.","pubDate":"2023-09-24 18:21:04","image_url":null,"source_id":"latestly","source_priority":5523,"country":["india"],"category":["sports"],"language":"marathi"},{"article_id":"0c160d9c876605450fbb052a0dd12520","title":"Cricket-Gill and Iyer belt tons as India crush Australia in rain-hit ODI","link":"https://www.thestar.com.my/sport/cricket/2023/09/25/cricket-gill-and-iyer-belt-tons-as-india-crush-australia-in-rain-hit-odi","keywords":null,"creator":null,"video_url":null,"description":"INDORE, India (Reuters) - India batsmen Shubman Gill and Shreyas Iyer scored centuries to lay the platform for a 99-run win over Australia in their rain-hit second one-day international (ODI) in Indore on Sunday that sealed a 2-0 series victory ahead of the World Cup. Read full story","content":null,"pubDate":"2023-09-24 17:16:00","image_url":"https://apicms.thestar.com.my/uploads/images/2023/09/25/2301795.jpg","source_id":"thestar_my","source_priority":37088,"country":["malaysia"],"category":["sports"],"language":"english"},{"article_id":"d4e476c26881c70ed755e5c8bad3e799","title":"Ind vs Aus: Team India make history with remarkable achievement in ODI cricket","link":"https://www.newsr.in/n/Sports/1zpnjb5cdo/Ind-vs-Aus-Team-India-make-history-with.htm","keywords":["Sports"],"creator":null,"video_url":null,"description":"Sensational centuries by Gill, Iyer and Suryakumar's fireworks propel India to record total Reported by DNA 11 minutes ago.","content":"Sunday, 24 September 2023 ( 43 minutes ago ) Sensational centuries by Gill, Iyer and Suryakumar's fireworks propel India to record total 👓 View full article","pubDate":"2023-09-24 17:08:42","image_url":null,"source_id":"newsr","source_priority":29095901,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"34cf5100355f3cfbdba77bd42001b416","title":"IND vs AUS, 2nd ODI: Madhya Pradesh Cricket Association announces Rs 11 lakh prize money for ground staff","link":"https://sportstar.thehindu.com/cricket/groundstaff-at-holkar-stadium-ind-v-aus-indore-rewarded-11-lakhs-india-vs-australia-2nd-odi/article67342265.ece","keywords":null,"creator":null,"video_url":null,"description":"The game saw two rain-breaks in both the innings including a one-hour break that saw the whole ground being covered due to heavy rain.","content":null,"pubDate":"2023-09-24 17:02:39","image_url":null,"source_id":"sportstar","source_priority":2972,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"206c25ac608896da001a7f654ab709f8","title":"India Won Series: దుమ్మురేపిన టీమిండియా, మరో మ్యాచ్‌ మిగిలి ఉండగానే ఆస్ట్రేలియాతో సిరీస్ కైవసం, రెండో వన్డేలో 99 పరుగుల తేడాతో ఘన విజయం","link":"https://telugu.latestly.com/sports/cricket/india-won-by-99-runs-against-australia-in-2nd-odi-109744.html","keywords":null,"creator":null,"video_url":null,"description":"మ‌రో మ్యాచ్ మిగిలి ఉండ‌గానే భార‌త్ మూడు వ‌న్డేల మ్యాచ్ సిరీస్‌ను (India vs Ausis) సొంతం చేసుకుంది. ఇండోర్ వేదిక‌గా ఆస్ట్రేలియాతో జ‌రిగిన రెండో వ‌న్డేలో 99 ప‌రుగుల భారీ తేడాతో (India Won) ఘ‌న విజ‌యం సాధించింది. భారీ ల‌క్ష్యాన్ని ఛేదించేందుకు బ‌రిలోకి దిగిన ఆస్ట్రేలియా (Australia) 28.2 ఓవ‌ర్ల‌లో 217 ప‌రుగుల‌కు ఆలౌటైంది.","content":"Indore, SEP 24: మ‌రో మ్యాచ్ మిగిలి ఉండ‌గానే భార‌త్ మూడు వ‌న్డేల మ్యాచ్ సిరీస్‌ను (India vs Ausis) సొంతం చేసుకుంది. ఇండోర్ వేదిక‌గా ఆస్ట్రేలియాతో జ‌రిగిన రెండో వ‌న్డేలో 99 ప‌రుగుల భారీ తేడాతో (India Won) ఘ‌న విజ‌యం సాధించింది. భారీ ల‌క్ష్యాన్ని ఛేదించేందుకు బ‌రిలోకి దిగిన ఆస్ట్రేలియా (Australia) 28.2 ఓవ‌ర్ల‌లో 217 ప‌రుగుల‌కు ఆలౌటైంది. ఆసీస్ బ్యాట‌ర్ల‌లో డేవిడ్ వార్న‌ర్ (53; 39 బంతుల్లో 7 ఫోర్లు, 1సిక్స్‌), సీన్ అబాట్ (54; 36 బంతుల్లో 4 ఫోర్లు, 5 సిక్సులు) అర్థ‌శ‌త‌కాల‌తో రాణించారు. భార‌త బౌల‌ర్ల‌లో అశ్విన్, జ‌డేజాలు చెరో మూడు వికెట్లు తీయ‌గా ప్ర‌సిద్ధ్ కృష్ణ రెండు, ష‌మీ ఓ వికెట్ ప‌డ‌గొట్టారు. వ‌ర్షం అంత‌రాయం క‌లిగించిన ఈ మ్యాచ్‌లో ఆస్ట్రేలియా ల‌క్ష్యాన్ని 33 ఓవ‌ర్ల‌లో 317 ప‌రుగుల‌కు కుదించారు. అంత‌క‌ముందు మొద‌ట బ్యాటింగ్ చేసిన భార‌త్ నిర్ణీత 50 ఓవ‌ర్ల‌లో 5 వికెట్ల నష్టానికి 399 పరుగులు చేసింది. ఓపెనర్ శుభ్‌మన్ గిల్ (104; 97 బంతుల్లో 6 ఫోర్లు, 4 సిక్స్‌లు), వన్‌డౌన్‌ బ్యాటర్ శ్రేయస్ అయ్యర్ (105; 90 బంతుల్లో 11 ఫోర్లు, 3 సిక్స్‌లు) సెంచ‌రీలతో విరుచుకుపడ్డారు. 2ND ODI. India Won by 99 Run(s) (D/L Method) https://t.co/OeTiga5wzy #INDvAUS @IDFCFIRSTBank — BCCI (@BCCI) September 24, 2023 సూర్యకుమార్‌ యాదవ్ (72*; 37 బంతుల్లో 6 ఫోర్లు, 6 సిక్స్‌లు), కెప్టెన్ కేఎల్ రాహుల్ (52; 38 బంతుల్లో 3 ఫోర్లు, 3 సిక్స్‌లు)లు వరుసగా రెండో మ్యాచ్‌లో అర్థ‌శ‌త‌కాల‌తో చెల‌రేగారు. ఇషాన్‌ కిషన్‌ (31; 18 బంతుల్లో 2 ఫోర్లు, 2 సిక్స్‌లు) కూడా దూకుడుగా ఆడాడు. ఆసీస్‌ బౌలర్లలో కామెరూన్ గ్రీన్ రెండు, సీన్ అబాట్, హేజిల్‌వుడ్, ఆడమ్ జంపా త‌లా ఓ వికెట్ పడగొట్టారు. టాస్ ఓడి బ్యాటింగ్‌కు దిగిన భార‌త్‌కు హేజిల్‌వుడ్ షాక్ ఇచ్చాడు. ఫామ్‌లో ఉన్న రుతురాజ్ గైక్వాడ్‌(8)ను ఔట్ చేశాడు. దీంతో 16 ప‌రుగుల వ‌ద్ద భార‌త్ మొద‌టి వికెట్ కోల్పోయింది. ఆ త‌రువాత ఆస్ట్రేలియాకు సంతోషించ‌డానికి ఏమీ లేక‌పోయింది. రీ ఎంట్రీలో విమ‌ర్శ‌లు ఎదుర్కొంటున్న శ్రేయ‌స్ అయ్య‌ర్ వ‌చ్చి రావ‌డంతో బౌండ‌రీల మోత మోగించాడు. గిల్‌తో క‌లిసి ఇన్నింగ్స్ న‌డిపించే బాధ్య‌త‌ను భుజాన వేసుకున్నాడు. IND vs AUS, Shubman Gill Video: ఆస్ట్రేలియాపై సెంచరీ చేసిన తర్వాత శుభ్ మాన్ గిల్ ఏం చేశాడో తెలిస్తే షాక్ తింటారు..ఈ వీడియో చూడండి.. ఆరంభంలో ఆచితూచి ఆడిన గిల్ ఆ త‌రువాత వేగం పెంచారు. వీరిద్ద‌రు ఆసీస్ బౌల‌ర్ల‌పై ఎదురుదాడికి దిగారు. ఈ క్ర‌మంలో గిల్ 31 బంతుల్లో, శ్రేయ‌స్ 41 బంతుల్లో అర్థ‌శ‌త‌కాలు పూర్తిచేసుకున్నారు. హాఫ్ సెంచరీల త‌రువాత వీరిద్ద‌రు మ‌రింత ధాటిగా బ్యాటింగ్ చేశారు. కెప్టెన్ స్టీవ్ స్మిత్ బౌల‌ర్లు మార్చి మార్చి ప్ర‌యోగించిన‌ప్ప‌టికీ ఫ‌లితం లేకుండా పోయింది. ఆసీస్ బౌల‌ర్ల‌కు ఎలాంటి అవ‌కాశం ఇవ్వ‌కుండా గిల్-శ్రేయ‌స్ జోడి బ్యాటింగ్ చేసింది. మొద‌ట 86 బంతుల్లో శ్రేయాస్ సెంచ‌రీ చేశాడు. వ‌న్డేల్లో శ్రేయ‌స్ కు ఇది మూడో శ‌త‌కం. సెంచ‌రీ చేసిన కాసేప‌టికే ధాటిగా ఆడే క్ర‌మంలో సీన్ అబాట్ బౌలింగ్‌లో అత‌డు ఔట్ అయ్యాడు. గిల్‌-శ్రేయాస్ జోడి రెండో వికెట్‌కు 200 ప‌రుగుల భాగ‌స్వామ్యాన్ని నెల‌కొల్పారు.","pubDate":"2023-09-24 16:53:45","image_url":null,"source_id":"latestly","source_priority":5523,"country":["india"],"category":["sports"],"language":"telugu"},{"article_id":"c0089dd91779b751de0beb1f336b16cb","title":"India beat Australia by 99 runs in second ODI to take unassailable 2-0 lead in three-match series","link":"https://telanganatoday.com/india-beat-australia-by-99-runs-in-second-odi-to-take-unassailable-2-0-lead-in-three-match-series","keywords":["News","Sport","Australia","India"],"creator":["PTI"],"video_url":null,"description":"Chasing a DLS revised target of 317 runs in 33 overs in the second ODI of the three-match series, Australia were bundled out for 217.","content":"Home | News | India Beat Australia By 99 Runs In Second Odi To Take Unassailable 2 0 Lead In Three Match Series India beat Australia by 99 runs in second ODI to take unassailable 2-0 lead in three-match series Chasing a DLS revised target of 317 runs in 33 overs in the second ODI of the three-match series, Australia were bundled out for 217. By PTI Updated On - 10:26 PM, Sun - 24 September 23 Indore: Shreyas Iyer, Shubman Gill and Suryakumar Yadav were the stars of the show as India registered a series-clinching win over Australia at Holkar Cricket Stadium, Indore on Sunday. Chasing a DLS revised target of 317 runs in 33 overs in the second ODI of the three-match series, Australia were bundled out for 217. Follow Us : Tags Australia India Related News Asian Games: Indian men’s football team qualifies for knockouts; registers 1-1 draw with Myanmar Asian Games: Indian men’s football team play out 1-1 draw with Myanmar, enter round of 16 Suryakumar smashes third-fastest ODI fifty by an Indian; hits four sixes in a row Asian Games: Indian women’s cricket team beat Bangladesh by 8 wickets, enter final India score 399/5 against Australia in second ODI Shubman smashes fifth ODI century in 2023, joins elite company during 2nd ODI against Australia","pubDate":"2023-09-24 16:47:59","image_url":null,"source_id":"telanganatoday","source_priority":63887,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"02d0ef044053422a7197f66486472fa8","title":"Little resistance from Australia as India capture one-day series","link":"https://www.brisbanetimes.com.au/sport/cricket/little-resistance-from-australia-as-india-capture-one-day-series-20230925-p5e785.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":null,"video_url":null,"description":"Australia have been trounced in their one-day series in India, losing 2-0 with one game to go after they failed to overhaul a massive target in a rain-delayed game in Indore.","content":"Australia have been trounced in their one-day series in India, losing 2-0 with one game to go after they were set a revised target of 317 from 33 overs in a rain-delayed game in Indore. Australia had reached 2-56 from nine overs when the heavens opened, leaving them needing a further 261 from 24 overs under the Duckworth-Lewis-Stern (DLS) system to haul in India’s mammoth 5-399 on Sunday (Monday morning AEST). Marnus Labuschagne is bowled by Ravichandran Ashwin during the second one-day international between India and Australia in Indore. Credit: AP It was a task that proved too great as they were dismissed some 99 runs from victory. Australia’s chase started disastrously when, in the second over, opener Matt Short (9) sliced an outswinger to Ravichandran Ashwin at third man, before acting captain Steve Smith nicked off to Shubman Gill at slip for a golden duck to put seamer Prasidh Krishna on a hat-trick. David Warner (26no) and Marnus Labuschagne (17no) were at the crease when play was halted and the covers came on, but the tourists had their work cut out even before the rain came. India had delivered a stunning innings, amassing their highest total in ODIs against Australia. It wasn’t the only benchmark to tumble. An unwanted record went the way of Cameron Green (2-103), who conceded the most runs by a bowler in an Australia-India ODI. The covers come on. Credit: Getty Images Shreyas Iyer (105) and Shubman Gill (104) shrugged off an earlier 40-minute rain delay to put on 200 for the second wicket before Indian skipper KL Rahul (52) made it back-to-back half-centuries. Suriyakumar Yadav (72no off 37 balls) put on a power-hitting clinic, bludgeoning the first four balls of Green’s eighth over for 6-6-6-6. Not considered a walk-up starter in his country’s best 11, Suriyakumar belted six sixes in his thrilling 37-ball cameo, highlighting India’s embarrassment of batting riches entering the World Cup. AAP News, results and expert analysis from the weekend of sport sent every Monday. Sign up for our Sport newsletter . Save Log in , register or subscribe to save articles for later. License this article ODI Australian cricket India Most Viewed in Sport Loading","pubDate":"2023-09-24 16:45:02","image_url":null,"source_id":"brisbanetimes","source_priority":189315,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"0abde3faf6a067b8e07babec321bf550","title":"China wins first gold in Asian Games","link":"https://www.manilatimes.net/2023/09/25/sports/china-wins-first-gold-in-asian-games/1911550","keywords":["Sports","Asian Games 2023"],"creator":["Agence France-Presse"],"video_url":null,"description":"(UPDATE) HANGZHOU: Host nation China won the first gold medal of the Asian Games on Sunday, when Zou Jiaqi and Qiu Xiuping dominated the women's lightweight double sculls rowing final.The Chinese pair finished in 7min 6.78sec, with Uzbekistan's Luizakhon Islamova and Malika Tagmativa taking silver, almost 10 seconds behind. Indonesia's Chelsea Corputty and Rahma Mutiara Putri won the bronze at the Fuyang Water Sports Centre.Medals are up for grabs in nine sports on day one of the 19th Asian Games, with hosts China expected to top the table.Swimming will see seven finals later on Sunday, while shooting, wushu, gymnastics, fencing, judo, taekwondo and modern pentathlon will all crown gold medalists.Chinese President Xi Jinping opened the Games on Saturday night in a colorful ceremony, launching a two-week sporting extravaganza that boasts more athletes than the Olympics.After being delayed by a year because of China's now-abandoned zero-Covid policy, more than 12,000 competitors from 45 nations and territories will battle it out in 40 sports.Although the Games officially opened on Saturday, sports such as football, cricket, volleyball and table tennis had already begun preliminary rounds.The Games will be staged at 54 venues — 14 of them newly constructed — mostly in Hangzhou but also extending to cities as far afield as Wenzhou, 300 kilometers (180 miles) south.","content":"(UPDATE) HANGZHOU: Host nation China won the first gold medal of the Asian Games on Sunday, when Zou Jiaqi and Qiu Xiuping dominated the women's lightweight double sculls rowing final. The Chinese pair finished in 7min 6.78sec, with Uzbekistan's Luizakhon Islamova and Malika Tagmativa taking silver, almost 10 seconds behind. Indonesia's Chelsea Corputty and Rahma Mutiara Putri won the bronze at the Fuyang Water Sports Centre. Medals are up for grabs in nine sports on day one of the 19th Asian Games, with hosts China expected to top the table. Swimming will see seven finals later on Sunday, while shooting, wushu, gymnastics, fencing, judo, taekwondo and modern pentathlon will all crown gold medalists. Chinese President Xi Jinping opened the Games on Saturday night in a colorful ceremony, launching a two-week sporting extravaganza that boasts more athletes than the Olympics. After being delayed by a year because of China's now-abandoned zero-Covid policy, more than 12,000 competitors from 45 nations and territories will battle it out in 40 sports. Although the Games officially opened on Saturday, sports such as football, cricket, volleyball and table tennis had already begun preliminary rounds. The Games will be staged at 54 venues — 14 of them newly constructed — mostly in Hangzhou but also extending to cities as far afield as Wenzhou, 300 kilometers (180 miles) south.","pubDate":"2023-09-24 16:38:00","image_url":"https://www.manilatimes.net/manilatimes/uploads/images/2023/09/24/245025.jpg","source_id":"manilatimes","source_priority":33634,"country":["philippines"],"category":["sports"],"language":"english"},{"article_id":"be0754d7752fac9288874cb907d6d024","title":"IND vs AUS, 2nd ODI: World Cup-bound batters make merry as India seals series","link":"https://sportstar.thehindu.com/cricket/ind-vs-aus-2nd-odi-score-highlights-result-report-india-beat-australia-series-win-shubman-gill-shreyas-iyer-centuries/article67342107.ece","keywords":null,"creator":null,"video_url":null,"description":"The day belonged to India’s World Cup-bound batters, who put up a collective attack before the return of Rohit Sharma, Virat Kohli and Hardik Pandya for the final match.","content":null,"pubDate":"2023-09-24 16:32:35","image_url":null,"source_id":"sportstar","source_priority":2972,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"a8f4cb5180e69b4fb6f09616e652fe3c","title":"Patrick Mahomes boasts the NFL's biggest contract and will earn a staggering $210m over the next four years... but who are the best-paid stars of the world's other top sports?","link":"https://www.dailymail.co.uk/sport/nfl/article-12544339/Patrick-Mahomes-Kansas-City-Chiefs-QB-highest-paid-HISTORY.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"In light of the 28-year-old's landmark contract, Mail Sport's Dominic Hogan takes you through the biggest earners in some of the world's most popular sports over the last year.","content":"Patrick Mahomes boasts the NFL's biggest contract and will earn a staggering $210m over the next four years... but who are the best-paid stars of the world's other top sports? Patrick Mahomes made history with his contract restructuring at the Chiefs Cristiano Ronaldo boasts the biggest contract in sport with a £175m-a-year deal The highest salary in MLB belongs to not one but TWO legendary pitchers By Dominic Hogan For Mailonline Published: 20:07, 24 September 2023 | Updated: 20:15, 24 September 2023 e-mail View comments This week NFL superstar quarterback Patrick Mahomes restructured his already eye-watering deal with the Kansas City Chiefs that will see the two-time Super Bowl winner shoot back up the division's list of highest paid stars. Mahomes had previously set the record for the biggest contract in NFL history, after he was tied down to a 10-year, £365.6million ($450m) deal that more or less blew the market out of the water, at least where quarterbacks are concerned. Just like when Neymar joined Paris Saint-Germain from Barcelona , the going rate for quarterbacks' services across the NFL has rocketed, with the likes of Joe Burrow (£44.8m) , Justin Herbert (£42.7m) and Lamar Jackson (£42.4m) taking home huge annual sums. Now Mahomes has taken his previous record to a new level, and after restructuring his deal, he is set to rake in some £170m ($210.6m) from 2023-2026, making him the highest paid American Football player in history over a four-year period - although Burrow still out-earns him in terms of a one-year salary. In light of the 28-year-old's landmark contract, Mail Sport's Dominic Hogan takes you through the biggest earners in some of the world's most popular sports over the last year. Patrick Mahomes put pen to paper on a record-breaking deal that earns him £170million a year between 2023 and 2026 Joe Burrow currently earns more per year than any other player in the NFL at £44.8million Football - Cristiano Ronaldo, £175m per year Football is the world's most popular sport, and the fact that one of its greatest ever stars is one of the highest paid athletes in the world, should come as no surprise. The Portuguese icon's credentials need not be reiterated, but let's indulge ourselves; five Ballon d'Or awards, five Champions Leagues, 19-time top goal scorer, seven-time domestic league winner, a European Champion with Portugal and proud owner of some 34 total winners' medals. Although synonymous with Real Madrid's dominance of Europe in the 2010s and for his breakout performances at Manchester United, Ronaldo now plies his trade in Saudi Arabia with Al-Nassr after his acrimonious departure from the Red Devils. The price for bringing in one of the game's greatest exponents? Just a cool £175m a year. And that's on top of all the other endorsements, business ventures, sponsorships and social media money that the 38-year-old earns. Astonishing. The money that Saudi Pro League sides have been able to offer, particularly this summer, has proven a shock to the system, even for football's regular financial power houses like Manchester City, PSG and Real Madrid. This recent transfer window alone the Gulf state has seen the arrival of the likes of Naymer (£130m per-year), Karim Benzema (£86m p/y), N'Golo Kante (£86m p/y) and Jordan Henderson (£36.4m p/y) on massive annual packages. With the Pro League showing little sign of slowing down, it might not be long before Ronaldo's spot is toppled as football's biggest earner. Cristiano Ronaldo has the most expensive contract in football with his £175million-a-year deal The Portuguese icon is perhaps best known for his time at the all-dominating Real Madrid team of the 2010s He became one of the first major European stars to join the Saudi Pro League after an acrimonious departure from Manchester United Golf - Viktor Hovland, £26.2m in 2023 In a year of seismic change for golf, with the shock merger between the formerly rival PGA and LIV tours, there is at least a note of continuity in the huge sums that the sport's biggest names took home in the last year. But chief among the beneficiaries was Viktor Hovland, who only finished third in the regular season in the earnings rankings with around $14.11m (£11.5m), but after winning the FedEx Cup , he increased his take-home by a stunning 127 per cent, adding a further $18m (£14.7m) to reach approximately £26.2m. Scottie Scheffler had topped the PGA Tour's money rankings so far in 2023, with a huge $21m (£17.1m), but managed to add just $2m (£1.6m) in the FedEx cup to finish on around £18.7m - not exactly a sum to be sniffed at. Despite winning two Majors this year - the Open Championship and the Masters - Jon Rahm ended up on a combined £14.6m ($18m), although he played 17 fewer rounds on the PGA Tour than the other two. The LIV Tour saw Dustin Johnson take home some $46.1m (£37.6m) in total last year, having taken home £14.6m ($18m) for topping the rankings at the end of the season, but this year's leader at the moment is Talor Gooch with $14.1m (£11.5m) although there are still three events in the LIV Golf League to play in 2023. Viktor Hovland topped the PGA Tour's earnings list for 2023 taking home around £26.2m in winnings The Norwegian's victory in the FedEx cup saw him earn an extra £14.6m ($18m) on top of his season's winnings F1 - Lewis Hamilton, £50m-per-year Lewis Hamilton may not be the fastest man in the Formula One paddock this season, but he has certainly reclaimed his title as the sport's highest earner. After Max Verstappen put pen to paper on a deal that would earn him £40m-a-year for five years in 2022, Hamilton penned a contract of his own in August that sees him one-up his rival, taking home £50m-a-year . There had been some concern over whether the seven-time world champion would continue his legend in the sport at the age of 38, but much like Ronaldo he is proving that he still has unfinished business and has committed to a two-year deal that will keep him at the Silver Arrows until at least 2025. However, Mail sport understands that Hamilton had been keen for a five-year extension at the time of negotiations, with a source telling us: 'Lewis wants five years, and if it were just a one-year extension I don't think he'd accept it. 'They may need to reach a compromise because, while George (Russell) has probably made peace with the idea of Lewis being around for a couple of years, he might not accept being in the shadow of his team-mate for the long-term. 'There is always a lure about Ferrari, but Lewis will probably think that his only hope of winning his eighth title is by staying where he is. 'Money is not a delaying factor.' Two-years it was, though, although Hamilton will surely not be turning his nose up at the surety of £100m for his troubles for the length of his new contract. Lewis Hamilton signed a new two-year deal to stay at Mercedes earning him some £50m-per-year Max Verstappen is currently the highest paid driver in F1 - but that title is under threat UFC - Israel Adesanya, £5.49m in 2023 The UFC's rich list has undeniably been dominated by Conor McGregor over the last few years, with the Irishman still holding the record for a single fight purse at £18.8m ($23m), but 2023 belonged to Israel Adesanya. 'Issy' was in action twice this year losing once and winning the other, but even in defeat the Nigerian-born fighter landed a heavy purse for his troubles - perhaps heavier than winner Sean Strickland . In his April victory over arch nemesis Alex Pereira Adesanya scooped up around £2.6m ($3.2m); £1.6m ($2m) from his Pay-Per-View shares, £815,000 ($1m) base pay for the fight, £26,100 ($32,000) in sponsorships and £40,800 ($50,000) in performance bonuses, plus additional extras. It was against his Brazilian rival at UFC 287 that Adesanya regained his middleweight crown after losing it in November 2022, but his new reign as king of the division would last just five months before a shock defeat to Strickland earlier this month - although his earnings may have softened that blow at UFC 293 . Another £815,000 ($1m) in base salary and £34,200 ($42,000) in sponsorship came his way, but coming in as reigning middleweight champion, his PPV earnings went up a notch and he brought home some £2.04m ($2.5m), meaning that with a grand total of £2.89m - almost £300,000 more than he earned in victory. 'Issy' may not have the business portfolio of McGregor, but he is absolutely killing it in the octagon, and out-earned Strickland (£1.22m) on the night by more than double. Israel Adesanya may have lost to Sean Strickland but he still took home around £5.49m in 2023 Adesanya fought twice in 2023, beating arch nemesis Alex Pereira in April before defeat to Strickland in September NBA - Steph Curry, £42.8m per year It is perhaps strange that two of the game's all-time greats might both hail from the same small town in Ohio, but Akron can lay claim to both LeBron James and Steph Curry. Both have obviously had storied careers in basketball, but after to-ing and fro-ing for the unofficial claim to being the NBA's best player, it's Curry who has topped the charts for annual earnings for the last seven years. His current deal sees the Golden State Warriors star earn some £42.8m a year - narrowly pipping the Chicago Bulls' Zach Lavine (£42.79m) in the money lists - and there's no arguing that the 35-year-old is worth every penny of it. Four championship rings, 2022 Finals MVP, two-time NBA MVP, nine-time all-star - his name has even lent itself to every single speculative attempt to throw anything at a designated target from an arbitrary 'three-point line'. Curry's terminator-esque accuracy from the free-throw line, outrageous three-point success rate and his all-round offensive talent make him one of the sport's all-time greats . There aren't many that would begrudge him his title as the NBA's top-earner. Stephen Curry (right), of the Golden State Warriors, earns the biggest salary in the NBA Curry's ruthless offensive talents and unerring accuracy from range make him one of the NBA's all-time greats NFL - Patrick Mahomes, £170m-a-year (2023-26) As we've already established, Mahomes has recently claimed the title of the NFL's best paid player until 2026, having restructured his already titanic deal. Joe Burrow currently leads the way in terms of an annual salary (£44.8m - £42.5m), but Mahomes' is a record over a four-year period, with the money on his initial £367m deal being moved around, and reports suggest that his agent will sit back down with the Chiefs in 2026 for further talks. Mahomes will make £46.2m ($56.9m) this season, £36.2m ($44.5m) next season, £40.7m ($50m) in 2025 and £46.2m ($56.8m) for the 2026 season. Mahomes signed his original 10-year deal three years ago, and has already delivered on that with a second Super Bowl MVP award earlier in February. Still just 28, Mahomes is approaching his prime - which in itself is a scary thought - and by the time his mammoth contract does eventually run up, he will be 36, and is sure to have added more rings to his budding collection. The Texan has already passed for 24,772 yards, 196 touchdowns and 51 interceptions in 82 starts since the Chiefs drafted him as the 10th overall pick in the first round of the 2017 draft. Patrick Mahomes revs up the crowd in Kansas City ahead of the Chiefs' 2023 season opener Mahomes is a two-time Super Bowl winner and has now reworked his contract with the Chiefs The 28-year-old will earn £46.2m ($56.9m) this season, £36.2m ($44.5m) next season, £40.7m ($50m) in 2025 and £46.2m ($56.8m) for the 2026 season Tennis - Novak Djokovic, £8.62m in winnings in 2023 What is there left to say about Serbia's all-consuming tennis god? The only real arguments left against the claim that he's the greatest of all time are built off semantics, or made by hardcore doubles enthusiasts. Even those of us that prefer to enjoy the fact we've lived through a time dominated by the three best male players to pick up a racket have run out of words to described Djokovic, and here he is, continuing to pick up trophy after trophy, accolade after accolade, record after record. Djokovic has scooped up a stunning £8.62m in winnings this year so far, in part due to his Australian, French and US Open heroics, which won him a combined £6.86m alone, with the Serb also picking up a further five titles, with a runners-up plate at Wimbledon earning him another £1.2m. Djokovic is not only the top-earner for 2023, but is the most successful tennis player of all-time in terms of money earned, winning a staggering £143m across his career, finishing the year on top of the money rankings a record five times to boot. Nobody has earned more money in the history of tennis than Serbian great Novak Djokovic Djokovic won three Grand Slams in 2023, losing only the final of Wimbledon to Carlos Alcaraz Cricket - Virat Kohli, £6.74m a year Unlike most of the sports on this list, cricket's payment structure is far from simple. As well as receiving an annual fee from your international cricket council based on a tiered system of relative importance to the side, players will pick up match fees in all three international formats (Test, T20I, ODI) that they take part in, and earn contracts at franchise teams all around the world. For Virat Kohli, though, that all translates to a reported salary of around £561,000-a-month overall, as per GQ, which translates to £6.74m-a-year - which is more than fair enough for one of the greatest batters of his generation, and perhaps in India's long and rich cricketing history. For some fans across India, where cricket enjoys an undisputed place at the pinnacle of the sporting pyramid, the former all-format captain is the star of the show, perhaps the most recognisable face in the country. At his IPL team Royal Challengers Bangalore he earns around £1.5m from the Indian Premier League alone, and around £685,000 from the BCCI. Kohli is another athlete on this list who profits hugely from his massive social media following, with a whopping 259 Instagram followers. Reports claim that Kohli - the most followed person from Asia on Instagram - can earn as much as $1.2m per sponsored post. All sports have their superstar, and Kohli is well and truly cricket's offering. Virat Kohli is unsurprisingly cricket's highest earning player and reportedly takes home £561,000-a-month Kohli is a former captain in all three formats for India, and is one of their greatest batters ever produced Rugby - Richie Mo'unga, £1.2m a year New Zealand’s All-star No 10 Richie Mo’unga is believed to lead the way in rugby - a sport that in the UK has struggled financially in the wake of the Covid outbreak. Mo’unga is thought to lead the likes of England and Saracens duo Owen Farrell and Maro Itoje and South Africa and Leicester Tigers star Handre Pollard, on a deal worth around £1.2m-a-year at Toshiba Brave Lupus in Japan. In addition to that, the All-blacks fly half will pick up around £3,600-per-week spent with the national team which of course takes the sum even higher. However, that’s one thing that the 29-year-old won’t be able to rely on much longer. New Zealand’s fabled national team have eligibility rules in place which stipulate that only those plying their trade domestically will be able to pull on the iconic black jersey. A number of players have played abroad on a sabbatical basis, while still committing themselves to New Zealand Rugby in the long term, but the fly-half’s three year deal starting in 2024 means that he will likely walk away from the All-Blacks at the end of the current World Cup. If there’s one think New Zealand aren’t lacking in, it’s world class rugby players. But even with Beauden Barrett likely to retake his old No 10 jersey, Mo’unga’ did a absence that would likely be felt in any team in world rugby. Richie Mo'unga leads rugby's rich list after agreeing a three-year contract from the start of next season in Japan MLB - Justin Verlander and Max Scherzer, £35.3m-a-year As for Major League Baseball, it’s a huge £35.3m-a-year ($43.3m) for not one but two veterans of the game in the shape of Justin Verlander at the Houston Astros and Max Scherzer with the Texas Rangers. Both pitchers were on the books at the New York Mets before a late move to cut costs saw both veterans of the MLB leave the franchise. The key to success as a pitcher is an extensive bag of tricks, an experienced mind and a list of variations as long as your arm and that’s just what these two can boast. There’s a good reason that no player in MLB history has ever been paid as much as they have. Max Scherzer signed a three-year deal worth $130m with the Mets back in 2021 before joining the Rangers Justin Verlander has come in for some scrutiny recently after being caught telling the Red Sox manager to 'f*** off' Scherzer’s deal was signed in December 2021 for £106m ($130m) over three years, while Verlander's was a two-year contract worth £70.6m ($86.7m). While Scherzer is taking home the big bucks at the Rangers, he is already looking likely to miss a significant portion of the regular season, after reportedly suffering a shoulder strain. For Verlander, meanwhile, reports emerged last month that he had built up something of a 'diva' attitude at the Mets before he was traded, and was thought to have clashed with Scherzer and some of his other team-mates. Having been caught on camera telling the Red Sox manager Alex Cora to 'f*** off' , the veteran pitcher could be heading into some hot water with an inauspicious end to the 2023 season. Share or comment on this article: Patrick Mahomes boasts the NFL's biggest contract and will earn a staggering $210m over the next four years... but who are the best-paid stars of the world's other top sports? e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-09-24 19:15:17","image_url":"https://i.dailymail.co.uk/1s/2023/09/22/15/75731705-0-image-a-10_1695392595712.jpg","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"6196798217a888fe5b496fe2a661b439","title":"Shreyas Iyer On Virat Kohli: श्रेयस अय्यरने दिल हृदयस्पर्शी विधान, विराट कोहलीच्या ऐवजी फलंदाजीवर बोलली मोठी गोष्ट","link":"https://marathi.latestly.com/sports/cricket/shreyas-iyer-gave-a-heart-winning-statement-said-a-big-thing-on-batting-instead-of-virat-kohli-493622.html","keywords":null,"creator":null,"video_url":null,"description":"अय्यरने 11 चौकार-3 षटकार मारले आणि 90 चेंडूत एकूण 105 धावा केल्या. मात्र, यावेळी तो डाव्या हाताच्या दुखण्याने ओरडताना दिसला. सामन्यानंतर त्याला त्याच्या स्फोटक फलंदाजीसाठी सामनावीराचा पुरस्कार देण्यात आला. यानंतर, मॅच प्रेझेंटेशन दरम्यान त्यांनी एक हृदयस्पर्शी विधान केले.","content":"रविवारी इंदूरच्या होळकर स्टेडियमवर खेळल्या गेलेल्या भारत आणि ऑस्ट्रेलिया (IND vs AUS) यांच्यातील दुसऱ्या एकदिवसीय सामन्यात भारतीय संघाने 99 धावांनी दणदणीत विजय नोंदवला. या सामन्यात श्रेयस अय्यरने (Shreyas Iyer) तिसऱ्या क्रमांकावर शानदार फलंदाजी करताना स्फोटक शतक झळकावले. अय्यरने 11 चौकार-3 षटकार मारले आणि 90 चेंडूत एकूण 105 धावा केल्या. मात्र, यावेळी तो डाव्या हाताच्या दुखण्याने ओरडताना दिसला. सामन्यानंतर त्याला त्याच्या स्फोटक फलंदाजीसाठी सामनावीराचा पुरस्कार देण्यात आला. यानंतर, मॅच प्रेझेंटेशन दरम्यान त्यांनी एक हृदयस्पर्शी विधान केले. (हे देखील वाचा: Pakistan Cricket: पाक खेळाडू आणि PCB वाद पेटला, गेल्या 4 महिन्यांपासून मिळाली नाही मॅच फी, बाबर आणि कंपनी वर्ल्ड कपमध्ये करणार विरोध? ) गेल्या काही महिन्यांपासून मी खूप मेहनत घेत आहे श्रेयस अय्यर म्हणाला- दुखापतीनंतर परतणे एखाद्या रोलरकोस्टर राईडसारखे होते. माझे सहकारी, मित्र आणि कुटुंबीय मला पाठिंबा देण्यासाठी तिथे होते. मी टीव्हीवर सामने बघायचो. आता परत येण्यासाठी आणि ड्रेसिंग रूममधील वातावरणाचा आनंद घेण्यासाठी मी उत्साहित आहे. गेल्या काही महिन्यांपासून मी खूप मेहनत घेत आहे. सामन्यादरम्यान मला सतत वेदना आणि काटेरीपणा जाणवत होता, परंतु मला माहित होते की माझे ध्येय काय आहे. आज मी माझ्या योजना पूर्णतः अंमलात आणण्यात यशस्वी झालो याचा आनंद आहे. जेव्हा मी फलंदाजीला गेलो तेव्हा गोष्टी गुंतागुंती करू इच्छित नव्हतो. विराट कोहलीकडून नंबर-3 चे स्थान हिसकावण्याची शक्यता नाही. यानंतर श्रेयसने हृदय जिंकणारे वक्तव्य केले. तो म्हणाला- मी कोणत्याही स्थितीत फलंदाजी करण्यास लवचिक आहे. माझ्या संघाला काहीही करावे लागले तरी मी कोणत्याही स्थितीत फलंदाजी करण्यास तयार आहे. विराट कोहली महान खेळाडूंपैकी एक आहे. त्याच्याकडून ३ क्रमांकाची जागा हिसकावण्याची शक्यता नाही. मला फक्त स्कोर करत राहायचे आहे.","pubDate":"2023-09-24 18:21:04","image_url":null,"source_id":"latestly","source_priority":5523,"country":["india"],"category":["sports"],"language":"marathi"},{"article_id":"0c160d9c876605450fbb052a0dd12520","title":"Cricket-Gill and Iyer belt tons as India crush Australia in rain-hit ODI","link":"https://www.thestar.com.my/sport/cricket/2023/09/25/cricket-gill-and-iyer-belt-tons-as-india-crush-australia-in-rain-hit-odi","keywords":null,"creator":null,"video_url":null,"description":"INDORE, India (Reuters) - India batsmen Shubman Gill and Shreyas Iyer scored centuries to lay the platform for a 99-run win over Australia in their rain-hit second one-day international (ODI) in Indore on Sunday that sealed a 2-0 series victory ahead of the World Cup. Read full story","content":null,"pubDate":"2023-09-24 17:16:00","image_url":"https://apicms.thestar.com.my/uploads/images/2023/09/25/2301795.jpg","source_id":"thestar_my","source_priority":37088,"country":["malaysia"],"category":["sports"],"language":"english"},{"article_id":"d4e476c26881c70ed755e5c8bad3e799","title":"Ind vs Aus: Team India make history with remarkable achievement in ODI cricket","link":"https://www.newsr.in/n/Sports/1zpnjb5cdo/Ind-vs-Aus-Team-India-make-history-with.htm","keywords":["Sports"],"creator":null,"video_url":null,"description":"Sensational centuries by Gill, Iyer and Suryakumar's fireworks propel India to record total Reported by DNA 11 minutes ago.","content":"Sunday, 24 September 2023 ( 43 minutes ago ) Sensational centuries by Gill, Iyer and Suryakumar's fireworks propel India to record total 👓 View full article","pubDate":"2023-09-24 17:08:42","image_url":null,"source_id":"newsr","source_priority":29095901,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"34cf5100355f3cfbdba77bd42001b416","title":"IND vs AUS, 2nd ODI: Madhya Pradesh Cricket Association announces Rs 11 lakh prize money for ground staff","link":"https://sportstar.thehindu.com/cricket/groundstaff-at-holkar-stadium-ind-v-aus-indore-rewarded-11-lakhs-india-vs-australia-2nd-odi/article67342265.ece","keywords":null,"creator":null,"video_url":null,"description":"The game saw two rain-breaks in both the innings including a one-hour break that saw the whole ground being covered due to heavy rain.","content":null,"pubDate":"2023-09-24 17:02:39","image_url":null,"source_id":"sportstar","source_priority":2972,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"206c25ac608896da001a7f654ab709f8","title":"India Won Series: దుమ్మురేపిన టీమిండియా, మరో మ్యాచ్‌ మిగిలి ఉండగానే ఆస్ట్రేలియాతో సిరీస్ కైవసం, రెండో వన్డేలో 99 పరుగుల తేడాతో ఘన విజయం","link":"https://telugu.latestly.com/sports/cricket/india-won-by-99-runs-against-australia-in-2nd-odi-109744.html","keywords":null,"creator":null,"video_url":null,"description":"మ‌రో మ్యాచ్ మిగిలి ఉండ‌గానే భార‌త్ మూడు వ‌న్డేల మ్యాచ్ సిరీస్‌ను (India vs Ausis) సొంతం చేసుకుంది. ఇండోర్ వేదిక‌గా ఆస్ట్రేలియాతో జ‌రిగిన రెండో వ‌న్డేలో 99 ప‌రుగుల భారీ తేడాతో (India Won) ఘ‌న విజ‌యం సాధించింది. భారీ ల‌క్ష్యాన్ని ఛేదించేందుకు బ‌రిలోకి దిగిన ఆస్ట్రేలియా (Australia) 28.2 ఓవ‌ర్ల‌లో 217 ప‌రుగుల‌కు ఆలౌటైంది.","content":"Indore, SEP 24: మ‌రో మ్యాచ్ మిగిలి ఉండ‌గానే భార‌త్ మూడు వ‌న్డేల మ్యాచ్ సిరీస్‌ను (India vs Ausis) సొంతం చేసుకుంది. ఇండోర్ వేదిక‌గా ఆస్ట్రేలియాతో జ‌రిగిన రెండో వ‌న్డేలో 99 ప‌రుగుల భారీ తేడాతో (India Won) ఘ‌న విజ‌యం సాధించింది. భారీ ల‌క్ష్యాన్ని ఛేదించేందుకు బ‌రిలోకి దిగిన ఆస్ట్రేలియా (Australia) 28.2 ఓవ‌ర్ల‌లో 217 ప‌రుగుల‌కు ఆలౌటైంది. ఆసీస్ బ్యాట‌ర్ల‌లో డేవిడ్ వార్న‌ర్ (53; 39 బంతుల్లో 7 ఫోర్లు, 1సిక్స్‌), సీన్ అబాట్ (54; 36 బంతుల్లో 4 ఫోర్లు, 5 సిక్సులు) అర్థ‌శ‌త‌కాల‌తో రాణించారు. భార‌త బౌల‌ర్ల‌లో అశ్విన్, జ‌డేజాలు చెరో మూడు వికెట్లు తీయ‌గా ప్ర‌సిద్ధ్ కృష్ణ రెండు, ష‌మీ ఓ వికెట్ ప‌డ‌గొట్టారు. వ‌ర్షం అంత‌రాయం క‌లిగించిన ఈ మ్యాచ్‌లో ఆస్ట్రేలియా ల‌క్ష్యాన్ని 33 ఓవ‌ర్ల‌లో 317 ప‌రుగుల‌కు కుదించారు. అంత‌క‌ముందు మొద‌ట బ్యాటింగ్ చేసిన భార‌త్ నిర్ణీత 50 ఓవ‌ర్ల‌లో 5 వికెట్ల నష్టానికి 399 పరుగులు చేసింది. ఓపెనర్ శుభ్‌మన్ గిల్ (104; 97 బంతుల్లో 6 ఫోర్లు, 4 సిక్స్‌లు), వన్‌డౌన్‌ బ్యాటర్ శ్రేయస్ అయ్యర్ (105; 90 బంతుల్లో 11 ఫోర్లు, 3 సిక్స్‌లు) సెంచ‌రీలతో విరుచుకుపడ్డారు. 2ND ODI. India Won by 99 Run(s) (D/L Method) https://t.co/OeTiga5wzy #INDvAUS @IDFCFIRSTBank — BCCI (@BCCI) September 24, 2023 సూర్యకుమార్‌ యాదవ్ (72*; 37 బంతుల్లో 6 ఫోర్లు, 6 సిక్స్‌లు), కెప్టెన్ కేఎల్ రాహుల్ (52; 38 బంతుల్లో 3 ఫోర్లు, 3 సిక్స్‌లు)లు వరుసగా రెండో మ్యాచ్‌లో అర్థ‌శ‌త‌కాల‌తో చెల‌రేగారు. ఇషాన్‌ కిషన్‌ (31; 18 బంతుల్లో 2 ఫోర్లు, 2 సిక్స్‌లు) కూడా దూకుడుగా ఆడాడు. ఆసీస్‌ బౌలర్లలో కామెరూన్ గ్రీన్ రెండు, సీన్ అబాట్, హేజిల్‌వుడ్, ఆడమ్ జంపా త‌లా ఓ వికెట్ పడగొట్టారు. టాస్ ఓడి బ్యాటింగ్‌కు దిగిన భార‌త్‌కు హేజిల్‌వుడ్ షాక్ ఇచ్చాడు. ఫామ్‌లో ఉన్న రుతురాజ్ గైక్వాడ్‌(8)ను ఔట్ చేశాడు. దీంతో 16 ప‌రుగుల వ‌ద్ద భార‌త్ మొద‌టి వికెట్ కోల్పోయింది. ఆ త‌రువాత ఆస్ట్రేలియాకు సంతోషించ‌డానికి ఏమీ లేక‌పోయింది. రీ ఎంట్రీలో విమ‌ర్శ‌లు ఎదుర్కొంటున్న శ్రేయ‌స్ అయ్య‌ర్ వ‌చ్చి రావ‌డంతో బౌండ‌రీల మోత మోగించాడు. గిల్‌తో క‌లిసి ఇన్నింగ్స్ న‌డిపించే బాధ్య‌త‌ను భుజాన వేసుకున్నాడు. IND vs AUS, Shubman Gill Video: ఆస్ట్రేలియాపై సెంచరీ చేసిన తర్వాత శుభ్ మాన్ గిల్ ఏం చేశాడో తెలిస్తే షాక్ తింటారు..ఈ వీడియో చూడండి.. ఆరంభంలో ఆచితూచి ఆడిన గిల్ ఆ త‌రువాత వేగం పెంచారు. వీరిద్ద‌రు ఆసీస్ బౌల‌ర్ల‌పై ఎదురుదాడికి దిగారు. ఈ క్ర‌మంలో గిల్ 31 బంతుల్లో, శ్రేయ‌స్ 41 బంతుల్లో అర్థ‌శ‌త‌కాలు పూర్తిచేసుకున్నారు. హాఫ్ సెంచరీల త‌రువాత వీరిద్ద‌రు మ‌రింత ధాటిగా బ్యాటింగ్ చేశారు. కెప్టెన్ స్టీవ్ స్మిత్ బౌల‌ర్లు మార్చి మార్చి ప్ర‌యోగించిన‌ప్ప‌టికీ ఫ‌లితం లేకుండా పోయింది. ఆసీస్ బౌల‌ర్ల‌కు ఎలాంటి అవ‌కాశం ఇవ్వ‌కుండా గిల్-శ్రేయ‌స్ జోడి బ్యాటింగ్ చేసింది. మొద‌ట 86 బంతుల్లో శ్రేయాస్ సెంచ‌రీ చేశాడు. వ‌న్డేల్లో శ్రేయ‌స్ కు ఇది మూడో శ‌త‌కం. సెంచ‌రీ చేసిన కాసేప‌టికే ధాటిగా ఆడే క్ర‌మంలో సీన్ అబాట్ బౌలింగ్‌లో అత‌డు ఔట్ అయ్యాడు. గిల్‌-శ్రేయాస్ జోడి రెండో వికెట్‌కు 200 ప‌రుగుల భాగ‌స్వామ్యాన్ని నెల‌కొల్పారు.","pubDate":"2023-09-24 16:53:45","image_url":null,"source_id":"latestly","source_priority":5523,"country":["india"],"category":["sports"],"language":"telugu"},{"article_id":"c0089dd91779b751de0beb1f336b16cb","title":"India beat Australia by 99 runs in second ODI to take unassailable 2-0 lead in three-match series","link":"https://telanganatoday.com/india-beat-australia-by-99-runs-in-second-odi-to-take-unassailable-2-0-lead-in-three-match-series","keywords":["News","Sport","Australia","India"],"creator":["PTI"],"video_url":null,"description":"Chasing a DLS revised target of 317 runs in 33 overs in the second ODI of the three-match series, Australia were bundled out for 217.","content":"Home | News | India Beat Australia By 99 Runs In Second Odi To Take Unassailable 2 0 Lead In Three Match Series India beat Australia by 99 runs in second ODI to take unassailable 2-0 lead in three-match series Chasing a DLS revised target of 317 runs in 33 overs in the second ODI of the three-match series, Australia were bundled out for 217. By PTI Updated On - 10:26 PM, Sun - 24 September 23 Indore: Shreyas Iyer, Shubman Gill and Suryakumar Yadav were the stars of the show as India registered a series-clinching win over Australia at Holkar Cricket Stadium, Indore on Sunday. Chasing a DLS revised target of 317 runs in 33 overs in the second ODI of the three-match series, Australia were bundled out for 217. Follow Us : Tags Australia India Related News Asian Games: Indian men’s football team qualifies for knockouts; registers 1-1 draw with Myanmar Asian Games: Indian men’s football team play out 1-1 draw with Myanmar, enter round of 16 Suryakumar smashes third-fastest ODI fifty by an Indian; hits four sixes in a row Asian Games: Indian women’s cricket team beat Bangladesh by 8 wickets, enter final India score 399/5 against Australia in second ODI Shubman smashes fifth ODI century in 2023, joins elite company during 2nd ODI against Australia","pubDate":"2023-09-24 16:47:59","image_url":null,"source_id":"telanganatoday","source_priority":63887,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"02d0ef044053422a7197f66486472fa8","title":"Little resistance from Australia as India capture one-day series","link":"https://www.brisbanetimes.com.au/sport/cricket/little-resistance-from-australia-as-india-capture-one-day-series-20230925-p5e785.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":null,"video_url":null,"description":"Australia have been trounced in their one-day series in India, losing 2-0 with one game to go after they failed to overhaul a massive target in a rain-delayed game in Indore.","content":"Australia have been trounced in their one-day series in India, losing 2-0 with one game to go after they were set a revised target of 317 from 33 overs in a rain-delayed game in Indore. Australia had reached 2-56 from nine overs when the heavens opened, leaving them needing a further 261 from 24 overs under the Duckworth-Lewis-Stern (DLS) system to haul in India’s mammoth 5-399 on Sunday (Monday morning AEST). Marnus Labuschagne is bowled by Ravichandran Ashwin during the second one-day international between India and Australia in Indore. Credit: AP It was a task that proved too great as they were dismissed some 99 runs from victory. Australia’s chase started disastrously when, in the second over, opener Matt Short (9) sliced an outswinger to Ravichandran Ashwin at third man, before acting captain Steve Smith nicked off to Shubman Gill at slip for a golden duck to put seamer Prasidh Krishna on a hat-trick. David Warner (26no) and Marnus Labuschagne (17no) were at the crease when play was halted and the covers came on, but the tourists had their work cut out even before the rain came. India had delivered a stunning innings, amassing their highest total in ODIs against Australia. It wasn’t the only benchmark to tumble. An unwanted record went the way of Cameron Green (2-103), who conceded the most runs by a bowler in an Australia-India ODI. The covers come on. Credit: Getty Images Shreyas Iyer (105) and Shubman Gill (104) shrugged off an earlier 40-minute rain delay to put on 200 for the second wicket before Indian skipper KL Rahul (52) made it back-to-back half-centuries. Suriyakumar Yadav (72no off 37 balls) put on a power-hitting clinic, bludgeoning the first four balls of Green’s eighth over for 6-6-6-6. Not considered a walk-up starter in his country’s best 11, Suriyakumar belted six sixes in his thrilling 37-ball cameo, highlighting India’s embarrassment of batting riches entering the World Cup. AAP News, results and expert analysis from the weekend of sport sent every Monday. Sign up for our Sport newsletter . Save Log in , register or subscribe to save articles for later. License this article ODI Australian cricket India Most Viewed in Sport Loading","pubDate":"2023-09-24 16:45:02","image_url":null,"source_id":"brisbanetimes","source_priority":189315,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"0abde3faf6a067b8e07babec321bf550","title":"China wins first gold in Asian Games","link":"https://www.manilatimes.net/2023/09/25/sports/china-wins-first-gold-in-asian-games/1911550","keywords":["Sports","Asian Games 2023"],"creator":["Agence France-Presse"],"video_url":null,"description":"(UPDATE) HANGZHOU: Host nation China won the first gold medal of the Asian Games on Sunday, when Zou Jiaqi and Qiu Xiuping dominated the women's lightweight double sculls rowing final.The Chinese pair finished in 7min 6.78sec, with Uzbekistan's Luizakhon Islamova and Malika Tagmativa taking silver, almost 10 seconds behind. Indonesia's Chelsea Corputty and Rahma Mutiara Putri won the bronze at the Fuyang Water Sports Centre.Medals are up for grabs in nine sports on day one of the 19th Asian Games, with hosts China expected to top the table.Swimming will see seven finals later on Sunday, while shooting, wushu, gymnastics, fencing, judo, taekwondo and modern pentathlon will all crown gold medalists.Chinese President Xi Jinping opened the Games on Saturday night in a colorful ceremony, launching a two-week sporting extravaganza that boasts more athletes than the Olympics.After being delayed by a year because of China's now-abandoned zero-Covid policy, more than 12,000 competitors from 45 nations and territories will battle it out in 40 sports.Although the Games officially opened on Saturday, sports such as football, cricket, volleyball and table tennis had already begun preliminary rounds.The Games will be staged at 54 venues — 14 of them newly constructed — mostly in Hangzhou but also extending to cities as far afield as Wenzhou, 300 kilometers (180 miles) south.","content":"(UPDATE) HANGZHOU: Host nation China won the first gold medal of the Asian Games on Sunday, when Zou Jiaqi and Qiu Xiuping dominated the women's lightweight double sculls rowing final. The Chinese pair finished in 7min 6.78sec, with Uzbekistan's Luizakhon Islamova and Malika Tagmativa taking silver, almost 10 seconds behind. Indonesia's Chelsea Corputty and Rahma Mutiara Putri won the bronze at the Fuyang Water Sports Centre. Medals are up for grabs in nine sports on day one of the 19th Asian Games, with hosts China expected to top the table. Swimming will see seven finals later on Sunday, while shooting, wushu, gymnastics, fencing, judo, taekwondo and modern pentathlon will all crown gold medalists. Chinese President Xi Jinping opened the Games on Saturday night in a colorful ceremony, launching a two-week sporting extravaganza that boasts more athletes than the Olympics. After being delayed by a year because of China's now-abandoned zero-Covid policy, more than 12,000 competitors from 45 nations and territories will battle it out in 40 sports. Although the Games officially opened on Saturday, sports such as football, cricket, volleyball and table tennis had already begun preliminary rounds. The Games will be staged at 54 venues — 14 of them newly constructed — mostly in Hangzhou but also extending to cities as far afield as Wenzhou, 300 kilometers (180 miles) south.","pubDate":"2023-09-24 16:38:00","image_url":"https://www.manilatimes.net/manilatimes/uploads/images/2023/09/24/245025.jpg","source_id":"manilatimes","source_priority":33634,"country":["philippines"],"category":["sports"],"language":"english"},{"article_id":"be0754d7752fac9288874cb907d6d024","title":"IND vs AUS, 2nd ODI: World Cup-bound batters make merry as India seals series","link":"https://sportstar.thehindu.com/cricket/ind-vs-aus-2nd-odi-score-highlights-result-report-india-beat-australia-series-win-shubman-gill-shreyas-iyer-centuries/article67342107.ece","keywords":null,"creator":null,"video_url":null,"description":"The day belonged to India’s World Cup-bound batters, who put up a collective attack before the return of Rohit Sharma, Virat Kohli and Hardik Pandya for the final match.","content":null,"pubDate":"2023-09-24 16:32:35","image_url":null,"source_id":"sportstar","source_priority":2972,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"a8f4cb5180e69b4fb6f09616e652fe3c","title":"Patrick Mahomes boasts the NFL's biggest contract and will earn a staggering $210m over the next four years... but who are the best-paid stars of the world's other top sports?","link":"https://www.dailymail.co.uk/sport/nfl/article-12544339/Patrick-Mahomes-Kansas-City-Chiefs-QB-highest-paid-HISTORY.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"In light of the 28-year-old's landmark contract, Mail Sport's Dominic Hogan takes you through the biggest earners in some of the world's most popular sports over the last year.","content":"Patrick Mahomes boasts the NFL's biggest contract and will earn a staggering $210m over the next four years... but who are the best-paid stars of the world's other top sports? Patrick Mahomes made history with his contract restructuring at the Chiefs Cristiano Ronaldo boasts the biggest contract in sport with a £175m-a-year deal The highest salary in MLB belongs to not one but TWO legendary pitchers By Dominic Hogan For Mailonline Published: 20:07, 24 September 2023 | Updated: 20:15, 24 September 2023 e-mail View comments This week NFL superstar quarterback Patrick Mahomes restructured his already eye-watering deal with the Kansas City Chiefs that will see the two-time Super Bowl winner shoot back up the division's list of highest paid stars. Mahomes had previously set the record for the biggest contract in NFL history, after he was tied down to a 10-year, £365.6million ($450m) deal that more or less blew the market out of the water, at least where quarterbacks are concerned. Just like when Neymar joined Paris Saint-Germain from Barcelona , the going rate for quarterbacks' services across the NFL has rocketed, with the likes of Joe Burrow (£44.8m) , Justin Herbert (£42.7m) and Lamar Jackson (£42.4m) taking home huge annual sums. Now Mahomes has taken his previous record to a new level, and after restructuring his deal, he is set to rake in some £170m ($210.6m) from 2023-2026, making him the highest paid American Football player in history over a four-year period - although Burrow still out-earns him in terms of a one-year salary. In light of the 28-year-old's landmark contract, Mail Sport's Dominic Hogan takes you through the biggest earners in some of the world's most popular sports over the last year. Patrick Mahomes put pen to paper on a record-breaking deal that earns him £170million a year between 2023 and 2026 Joe Burrow currently earns more per year than any other player in the NFL at £44.8million Football - Cristiano Ronaldo, £175m per year Football is the world's most popular sport, and the fact that one of its greatest ever stars is one of the highest paid athletes in the world, should come as no surprise. The Portuguese icon's credentials need not be reiterated, but let's indulge ourselves; five Ballon d'Or awards, five Champions Leagues, 19-time top goal scorer, seven-time domestic league winner, a European Champion with Portugal and proud owner of some 34 total winners' medals. Although synonymous with Real Madrid's dominance of Europe in the 2010s and for his breakout performances at Manchester United, Ronaldo now plies his trade in Saudi Arabia with Al-Nassr after his acrimonious departure from the Red Devils. The price for bringing in one of the game's greatest exponents? Just a cool £175m a year. And that's on top of all the other endorsements, business ventures, sponsorships and social media money that the 38-year-old earns. Astonishing. The money that Saudi Pro League sides have been able to offer, particularly this summer, has proven a shock to the system, even for football's regular financial power houses like Manchester City, PSG and Real Madrid. This recent transfer window alone the Gulf state has seen the arrival of the likes of Naymer (£130m per-year), Karim Benzema (£86m p/y), N'Golo Kante (£86m p/y) and Jordan Henderson (£36.4m p/y) on massive annual packages. With the Pro League showing little sign of slowing down, it might not be long before Ronaldo's spot is toppled as football's biggest earner. Cristiano Ronaldo has the most expensive contract in football with his £175million-a-year deal The Portuguese icon is perhaps best known for his time at the all-dominating Real Madrid team of the 2010s He became one of the first major European stars to join the Saudi Pro League after an acrimonious departure from Manchester United Golf - Viktor Hovland, £26.2m in 2023 In a year of seismic change for golf, with the shock merger between the formerly rival PGA and LIV tours, there is at least a note of continuity in the huge sums that the sport's biggest names took home in the last year. But chief among the beneficiaries was Viktor Hovland, who only finished third in the regular season in the earnings rankings with around $14.11m (£11.5m), but after winning the FedEx Cup , he increased his take-home by a stunning 127 per cent, adding a further $18m (£14.7m) to reach approximately £26.2m. Scottie Scheffler had topped the PGA Tour's money rankings so far in 2023, with a huge $21m (£17.1m), but managed to add just $2m (£1.6m) in the FedEx cup to finish on around £18.7m - not exactly a sum to be sniffed at. Despite winning two Majors this year - the Open Championship and the Masters - Jon Rahm ended up on a combined £14.6m ($18m), although he played 17 fewer rounds on the PGA Tour than the other two. The LIV Tour saw Dustin Johnson take home some $46.1m (£37.6m) in total last year, having taken home £14.6m ($18m) for topping the rankings at the end of the season, but this year's leader at the moment is Talor Gooch with $14.1m (£11.5m) although there are still three events in the LIV Golf League to play in 2023. Viktor Hovland topped the PGA Tour's earnings list for 2023 taking home around £26.2m in winnings The Norwegian's victory in the FedEx cup saw him earn an extra £14.6m ($18m) on top of his season's winnings F1 - Lewis Hamilton, £50m-per-year Lewis Hamilton may not be the fastest man in the Formula One paddock this season, but he has certainly reclaimed his title as the sport's highest earner. After Max Verstappen put pen to paper on a deal that would earn him £40m-a-year for five years in 2022, Hamilton penned a contract of his own in August that sees him one-up his rival, taking home £50m-a-year . There had been some concern over whether the seven-time world champion would continue his legend in the sport at the age of 38, but much like Ronaldo he is proving that he still has unfinished business and has committed to a two-year deal that will keep him at the Silver Arrows until at least 2025. However, Mail sport understands that Hamilton had been keen for a five-year extension at the time of negotiations, with a source telling us: 'Lewis wants five years, and if it were just a one-year extension I don't think he'd accept it. 'They may need to reach a compromise because, while George (Russell) has probably made peace with the idea of Lewis being around for a couple of years, he might not accept being in the shadow of his team-mate for the long-term. 'There is always a lure about Ferrari, but Lewis will probably think that his only hope of winning his eighth title is by staying where he is. 'Money is not a delaying factor.' Two-years it was, though, although Hamilton will surely not be turning his nose up at the surety of £100m for his troubles for the length of his new contract. Lewis Hamilton signed a new two-year deal to stay at Mercedes earning him some £50m-per-year Max Verstappen is currently the highest paid driver in F1 - but that title is under threat UFC - Israel Adesanya, £5.49m in 2023 The UFC's rich list has undeniably been dominated by Conor McGregor over the last few years, with the Irishman still holding the record for a single fight purse at £18.8m ($23m), but 2023 belonged to Israel Adesanya. 'Issy' was in action twice this year losing once and winning the other, but even in defeat the Nigerian-born fighter landed a heavy purse for his troubles - perhaps heavier than winner Sean Strickland . In his April victory over arch nemesis Alex Pereira Adesanya scooped up around £2.6m ($3.2m); £1.6m ($2m) from his Pay-Per-View shares, £815,000 ($1m) base pay for the fight, £26,100 ($32,000) in sponsorships and £40,800 ($50,000) in performance bonuses, plus additional extras. It was against his Brazilian rival at UFC 287 that Adesanya regained his middleweight crown after losing it in November 2022, but his new reign as king of the division would last just five months before a shock defeat to Strickland earlier this month - although his earnings may have softened that blow at UFC 293 . Another £815,000 ($1m) in base salary and £34,200 ($42,000) in sponsorship came his way, but coming in as reigning middleweight champion, his PPV earnings went up a notch and he brought home some £2.04m ($2.5m), meaning that with a grand total of £2.89m - almost £300,000 more than he earned in victory. 'Issy' may not have the business portfolio of McGregor, but he is absolutely killing it in the octagon, and out-earned Strickland (£1.22m) on the night by more than double. Israel Adesanya may have lost to Sean Strickland but he still took home around £5.49m in 2023 Adesanya fought twice in 2023, beating arch nemesis Alex Pereira in April before defeat to Strickland in September NBA - Steph Curry, £42.8m per year It is perhaps strange that two of the game's all-time greats might both hail from the same small town in Ohio, but Akron can lay claim to both LeBron James and Steph Curry. Both have obviously had storied careers in basketball, but after to-ing and fro-ing for the unofficial claim to being the NBA's best player, it's Curry who has topped the charts for annual earnings for the last seven years. His current deal sees the Golden State Warriors star earn some £42.8m a year - narrowly pipping the Chicago Bulls' Zach Lavine (£42.79m) in the money lists - and there's no arguing that the 35-year-old is worth every penny of it. Four championship rings, 2022 Finals MVP, two-time NBA MVP, nine-time all-star - his name has even lent itself to every single speculative attempt to throw anything at a designated target from an arbitrary 'three-point line'. Curry's terminator-esque accuracy from the free-throw line, outrageous three-point success rate and his all-round offensive talent make him one of the sport's all-time greats . There aren't many that would begrudge him his title as the NBA's top-earner. Stephen Curry (right), of the Golden State Warriors, earns the biggest salary in the NBA Curry's ruthless offensive talents and unerring accuracy from range make him one of the NBA's all-time greats NFL - Patrick Mahomes, £170m-a-year (2023-26) As we've already established, Mahomes has recently claimed the title of the NFL's best paid player until 2026, having restructured his already titanic deal. Joe Burrow currently leads the way in terms of an annual salary (£44.8m - £42.5m), but Mahomes' is a record over a four-year period, with the money on his initial £367m deal being moved around, and reports suggest that his agent will sit back down with the Chiefs in 2026 for further talks. Mahomes will make £46.2m ($56.9m) this season, £36.2m ($44.5m) next season, £40.7m ($50m) in 2025 and £46.2m ($56.8m) for the 2026 season. Mahomes signed his original 10-year deal three years ago, and has already delivered on that with a second Super Bowl MVP award earlier in February. Still just 28, Mahomes is approaching his prime - which in itself is a scary thought - and by the time his mammoth contract does eventually run up, he will be 36, and is sure to have added more rings to his budding collection. The Texan has already passed for 24,772 yards, 196 touchdowns and 51 interceptions in 82 starts since the Chiefs drafted him as the 10th overall pick in the first round of the 2017 draft. Patrick Mahomes revs up the crowd in Kansas City ahead of the Chiefs' 2023 season opener Mahomes is a two-time Super Bowl winner and has now reworked his contract with the Chiefs The 28-year-old will earn £46.2m ($56.9m) this season, £36.2m ($44.5m) next season, £40.7m ($50m) in 2025 and £46.2m ($56.8m) for the 2026 season Tennis - Novak Djokovic, £8.62m in winnings in 2023 What is there left to say about Serbia's all-consuming tennis god? The only real arguments left against the claim that he's the greatest of all time are built off semantics, or made by hardcore doubles enthusiasts. Even those of us that prefer to enjoy the fact we've lived through a time dominated by the three best male players to pick up a racket have run out of words to described Djokovic, and here he is, continuing to pick up trophy after trophy, accolade after accolade, record after record. Djokovic has scooped up a stunning £8.62m in winnings this year so far, in part due to his Australian, French and US Open heroics, which won him a combined £6.86m alone, with the Serb also picking up a further five titles, with a runners-up plate at Wimbledon earning him another £1.2m. Djokovic is not only the top-earner for 2023, but is the most successful tennis player of all-time in terms of money earned, winning a staggering £143m across his career, finishing the year on top of the money rankings a record five times to boot. Nobody has earned more money in the history of tennis than Serbian great Novak Djokovic Djokovic won three Grand Slams in 2023, losing only the final of Wimbledon to Carlos Alcaraz Cricket - Virat Kohli, £6.74m a year Unlike most of the sports on this list, cricket's payment structure is far from simple. As well as receiving an annual fee from your international cricket council based on a tiered system of relative importance to the side, players will pick up match fees in all three international formats (Test, T20I, ODI) that they take part in, and earn contracts at franchise teams all around the world. For Virat Kohli, though, that all translates to a reported salary of around £561,000-a-month overall, as per GQ, which translates to £6.74m-a-year - which is more than fair enough for one of the greatest batters of his generation, and perhaps in India's long and rich cricketing history. For some fans across India, where cricket enjoys an undisputed place at the pinnacle of the sporting pyramid, the former all-format captain is the star of the show, perhaps the most recognisable face in the country. At his IPL team Royal Challengers Bangalore he earns around £1.5m from the Indian Premier League alone, and around £685,000 from the BCCI. Kohli is another athlete on this list who profits hugely from his massive social media following, with a whopping 259 Instagram followers. Reports claim that Kohli - the most followed person from Asia on Instagram - can earn as much as $1.2m per sponsored post. All sports have their superstar, and Kohli is well and truly cricket's offering. Virat Kohli is unsurprisingly cricket's highest earning player and reportedly takes home £561,000-a-month Kohli is a former captain in all three formats for India, and is one of their greatest batters ever produced Rugby - Richie Mo'unga, £1.2m a year New Zealand’s All-star No 10 Richie Mo’unga is believed to lead the way in rugby - a sport that in the UK has struggled financially in the wake of the Covid outbreak. Mo’unga is thought to lead the likes of England and Saracens duo Owen Farrell and Maro Itoje and South Africa and Leicester Tigers star Handre Pollard, on a deal worth around £1.2m-a-year at Toshiba Brave Lupus in Japan. In addition to that, the All-blacks fly half will pick up around £3,600-per-week spent with the national team which of course takes the sum even higher. However, that’s one thing that the 29-year-old won’t be able to rely on much longer. New Zealand’s fabled national team have eligibility rules in place which stipulate that only those plying their trade domestically will be able to pull on the iconic black jersey. A number of players have played abroad on a sabbatical basis, while still committing themselves to New Zealand Rugby in the long term, but the fly-half’s three year deal starting in 2024 means that he will likely walk away from the All-Blacks at the end of the current World Cup. If there’s one think New Zealand aren’t lacking in, it’s world class rugby players. But even with Beauden Barrett likely to retake his old No 10 jersey, Mo’unga’ did a absence that would likely be felt in any team in world rugby. Richie Mo'unga leads rugby's rich list after agreeing a three-year contract from the start of next season in Japan MLB - Justin Verlander and Max Scherzer, £35.3m-a-year As for Major League Baseball, it’s a huge £35.3m-a-year ($43.3m) for not one but two veterans of the game in the shape of Justin Verlander at the Houston Astros and Max Scherzer with the Texas Rangers. Both pitchers were on the books at the New York Mets before a late move to cut costs saw both veterans of the MLB leave the franchise. The key to success as a pitcher is an extensive bag of tricks, an experienced mind and a list of variations as long as your arm and that’s just what these two can boast. There’s a good reason that no player in MLB history has ever been paid as much as they have. Max Scherzer signed a three-year deal worth $130m with the Mets back in 2021 before joining the Rangers Justin Verlander has come in for some scrutiny recently after being caught telling the Red Sox manager to 'f*** off' Scherzer’s deal was signed in December 2021 for £106m ($130m) over three years, while Verlander's was a two-year contract worth £70.6m ($86.7m). While Scherzer is taking home the big bucks at the Rangers, he is already looking likely to miss a significant portion of the regular season, after reportedly suffering a shoulder strain. For Verlander, meanwhile, reports emerged last month that he had built up something of a 'diva' attitude at the Mets before he was traded, and was thought to have clashed with Scherzer and some of his other team-mates. Having been caught on camera telling the Red Sox manager Alex Cora to 'f*** off' , the veteran pitcher could be heading into some hot water with an inauspicious end to the 2023 season. Share or comment on this article: Patrick Mahomes boasts the NFL's biggest contract and will earn a staggering $210m over the next four years... but who are the best-paid stars of the world's other top sports? e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-09-24 19:15:17","image_url":"https://i.dailymail.co.uk/1s/2023/09/22/15/75731705-0-image-a-10_1695392595712.jpg","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"6196798217a888fe5b496fe2a661b439","title":"Shreyas Iyer On Virat Kohli: श्रेयस अय्यरने दिल हृदयस्पर्शी विधान, विराट कोहलीच्या ऐवजी फलंदाजीवर बोलली मोठी गोष्ट","link":"https://marathi.latestly.com/sports/cricket/shreyas-iyer-gave-a-heart-winning-statement-said-a-big-thing-on-batting-instead-of-virat-kohli-493622.html","keywords":null,"creator":null,"video_url":null,"description":"अय्यरने 11 चौकार-3 षटकार मारले आणि 90 चेंडूत एकूण 105 धावा केल्या. मात्र, यावेळी तो डाव्या हाताच्या दुखण्याने ओरडताना दिसला. सामन्यानंतर त्याला त्याच्या स्फोटक फलंदाजीसाठी सामनावीराचा पुरस्कार देण्यात आला. यानंतर, मॅच प्रेझेंटेशन दरम्यान त्यांनी एक हृदयस्पर्शी विधान केले.","content":"रविवारी इंदूरच्या होळकर स्टेडियमवर खेळल्या गेलेल्या भारत आणि ऑस्ट्रेलिया (IND vs AUS) यांच्यातील दुसऱ्या एकदिवसीय सामन्यात भारतीय संघाने 99 धावांनी दणदणीत विजय नोंदवला. या सामन्यात श्रेयस अय्यरने (Shreyas Iyer) तिसऱ्या क्रमांकावर शानदार फलंदाजी करताना स्फोटक शतक झळकावले. अय्यरने 11 चौकार-3 षटकार मारले आणि 90 चेंडूत एकूण 105 धावा केल्या. मात्र, यावेळी तो डाव्या हाताच्या दुखण्याने ओरडताना दिसला. सामन्यानंतर त्याला त्याच्या स्फोटक फलंदाजीसाठी सामनावीराचा पुरस्कार देण्यात आला. यानंतर, मॅच प्रेझेंटेशन दरम्यान त्यांनी एक हृदयस्पर्शी विधान केले. (हे देखील वाचा: Pakistan Cricket: पाक खेळाडू आणि PCB वाद पेटला, गेल्या 4 महिन्यांपासून मिळाली नाही मॅच फी, बाबर आणि कंपनी वर्ल्ड कपमध्ये करणार विरोध? ) गेल्या काही महिन्यांपासून मी खूप मेहनत घेत आहे श्रेयस अय्यर म्हणाला- दुखापतीनंतर परतणे एखाद्या रोलरकोस्टर राईडसारखे होते. माझे सहकारी, मित्र आणि कुटुंबीय मला पाठिंबा देण्यासाठी तिथे होते. मी टीव्हीवर सामने बघायचो. आता परत येण्यासाठी आणि ड्रेसिंग रूममधील वातावरणाचा आनंद घेण्यासाठी मी उत्साहित आहे. गेल्या काही महिन्यांपासून मी खूप मेहनत घेत आहे. सामन्यादरम्यान मला सतत वेदना आणि काटेरीपणा जाणवत होता, परंतु मला माहित होते की माझे ध्येय काय आहे. आज मी माझ्या योजना पूर्णतः अंमलात आणण्यात यशस्वी झालो याचा आनंद आहे. जेव्हा मी फलंदाजीला गेलो तेव्हा गोष्टी गुंतागुंती करू इच्छित नव्हतो. विराट कोहलीकडून नंबर-3 चे स्थान हिसकावण्याची शक्यता नाही. यानंतर श्रेयसने हृदय जिंकणारे वक्तव्य केले. तो म्हणाला- मी कोणत्याही स्थितीत फलंदाजी करण्यास लवचिक आहे. माझ्या संघाला काहीही करावे लागले तरी मी कोणत्याही स्थितीत फलंदाजी करण्यास तयार आहे. विराट कोहली महान खेळाडूंपैकी एक आहे. त्याच्याकडून ३ क्रमांकाची जागा हिसकावण्याची शक्यता नाही. मला फक्त स्कोर करत राहायचे आहे.","pubDate":"2023-09-24 18:21:04","image_url":null,"source_id":"latestly","source_priority":5523,"country":["india"],"category":["sports"],"language":"marathi"},{"article_id":"0c160d9c876605450fbb052a0dd12520","title":"Cricket-Gill and Iyer belt tons as India crush Australia in rain-hit ODI","link":"https://www.thestar.com.my/sport/cricket/2023/09/25/cricket-gill-and-iyer-belt-tons-as-india-crush-australia-in-rain-hit-odi","keywords":null,"creator":null,"video_url":null,"description":"INDORE, India (Reuters) - India batsmen Shubman Gill and Shreyas Iyer scored centuries to lay the platform for a 99-run win over Australia in their rain-hit second one-day international (ODI) in Indore on Sunday that sealed a 2-0 series victory ahead of the World Cup. Read full story","content":null,"pubDate":"2023-09-24 17:16:00","image_url":"https://apicms.thestar.com.my/uploads/images/2023/09/25/2301795.jpg","source_id":"thestar_my","source_priority":37088,"country":["malaysia"],"category":["sports"],"language":"english"},{"article_id":"d4e476c26881c70ed755e5c8bad3e799","title":"Ind vs Aus: Team India make history with remarkable achievement in ODI cricket","link":"https://www.newsr.in/n/Sports/1zpnjb5cdo/Ind-vs-Aus-Team-India-make-history-with.htm","keywords":["Sports"],"creator":null,"video_url":null,"description":"Sensational centuries by Gill, Iyer and Suryakumar's fireworks propel India to record total Reported by DNA 11 minutes ago.","content":"Sunday, 24 September 2023 ( 43 minutes ago ) Sensational centuries by Gill, Iyer and Suryakumar's fireworks propel India to record total 👓 View full article","pubDate":"2023-09-24 17:08:42","image_url":null,"source_id":"newsr","source_priority":29095901,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"34cf5100355f3cfbdba77bd42001b416","title":"IND vs AUS, 2nd ODI: Madhya Pradesh Cricket Association announces Rs 11 lakh prize money for ground staff","link":"https://sportstar.thehindu.com/cricket/groundstaff-at-holkar-stadium-ind-v-aus-indore-rewarded-11-lakhs-india-vs-australia-2nd-odi/article67342265.ece","keywords":null,"creator":null,"video_url":null,"description":"The game saw two rain-breaks in both the innings including a one-hour break that saw the whole ground being covered due to heavy rain.","content":null,"pubDate":"2023-09-24 17:02:39","image_url":null,"source_id":"sportstar","source_priority":2972,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"206c25ac608896da001a7f654ab709f8","title":"India Won Series: దుమ్మురేపిన టీమిండియా, మరో మ్యాచ్‌ మిగిలి ఉండగానే ఆస్ట్రేలియాతో సిరీస్ కైవసం, రెండో వన్డేలో 99 పరుగుల తేడాతో ఘన విజయం","link":"https://telugu.latestly.com/sports/cricket/india-won-by-99-runs-against-australia-in-2nd-odi-109744.html","keywords":null,"creator":null,"video_url":null,"description":"మ‌రో మ్యాచ్ మిగిలి ఉండ‌గానే భార‌త్ మూడు వ‌న్డేల మ్యాచ్ సిరీస్‌ను (India vs Ausis) సొంతం చేసుకుంది. ఇండోర్ వేదిక‌గా ఆస్ట్రేలియాతో జ‌రిగిన రెండో వ‌న్డేలో 99 ప‌రుగుల భారీ తేడాతో (India Won) ఘ‌న విజ‌యం సాధించింది. భారీ ల‌క్ష్యాన్ని ఛేదించేందుకు బ‌రిలోకి దిగిన ఆస్ట్రేలియా (Australia) 28.2 ఓవ‌ర్ల‌లో 217 ప‌రుగుల‌కు ఆలౌటైంది.","content":"Indore, SEP 24: మ‌రో మ్యాచ్ మిగిలి ఉండ‌గానే భార‌త్ మూడు వ‌న్డేల మ్యాచ్ సిరీస్‌ను (India vs Ausis) సొంతం చేసుకుంది. ఇండోర్ వేదిక‌గా ఆస్ట్రేలియాతో జ‌రిగిన రెండో వ‌న్డేలో 99 ప‌రుగుల భారీ తేడాతో (India Won) ఘ‌న విజ‌యం సాధించింది. భారీ ల‌క్ష్యాన్ని ఛేదించేందుకు బ‌రిలోకి దిగిన ఆస్ట్రేలియా (Australia) 28.2 ఓవ‌ర్ల‌లో 217 ప‌రుగుల‌కు ఆలౌటైంది. ఆసీస్ బ్యాట‌ర్ల‌లో డేవిడ్ వార్న‌ర్ (53; 39 బంతుల్లో 7 ఫోర్లు, 1సిక్స్‌), సీన్ అబాట్ (54; 36 బంతుల్లో 4 ఫోర్లు, 5 సిక్సులు) అర్థ‌శ‌త‌కాల‌తో రాణించారు. భార‌త బౌల‌ర్ల‌లో అశ్విన్, జ‌డేజాలు చెరో మూడు వికెట్లు తీయ‌గా ప్ర‌సిద్ధ్ కృష్ణ రెండు, ష‌మీ ఓ వికెట్ ప‌డ‌గొట్టారు. వ‌ర్షం అంత‌రాయం క‌లిగించిన ఈ మ్యాచ్‌లో ఆస్ట్రేలియా ల‌క్ష్యాన్ని 33 ఓవ‌ర్ల‌లో 317 ప‌రుగుల‌కు కుదించారు. అంత‌క‌ముందు మొద‌ట బ్యాటింగ్ చేసిన భార‌త్ నిర్ణీత 50 ఓవ‌ర్ల‌లో 5 వికెట్ల నష్టానికి 399 పరుగులు చేసింది. ఓపెనర్ శుభ్‌మన్ గిల్ (104; 97 బంతుల్లో 6 ఫోర్లు, 4 సిక్స్‌లు), వన్‌డౌన్‌ బ్యాటర్ శ్రేయస్ అయ్యర్ (105; 90 బంతుల్లో 11 ఫోర్లు, 3 సిక్స్‌లు) సెంచ‌రీలతో విరుచుకుపడ్డారు. 2ND ODI. India Won by 99 Run(s) (D/L Method) https://t.co/OeTiga5wzy #INDvAUS @IDFCFIRSTBank — BCCI (@BCCI) September 24, 2023 సూర్యకుమార్‌ యాదవ్ (72*; 37 బంతుల్లో 6 ఫోర్లు, 6 సిక్స్‌లు), కెప్టెన్ కేఎల్ రాహుల్ (52; 38 బంతుల్లో 3 ఫోర్లు, 3 సిక్స్‌లు)లు వరుసగా రెండో మ్యాచ్‌లో అర్థ‌శ‌త‌కాల‌తో చెల‌రేగారు. ఇషాన్‌ కిషన్‌ (31; 18 బంతుల్లో 2 ఫోర్లు, 2 సిక్స్‌లు) కూడా దూకుడుగా ఆడాడు. ఆసీస్‌ బౌలర్లలో కామెరూన్ గ్రీన్ రెండు, సీన్ అబాట్, హేజిల్‌వుడ్, ఆడమ్ జంపా త‌లా ఓ వికెట్ పడగొట్టారు. టాస్ ఓడి బ్యాటింగ్‌కు దిగిన భార‌త్‌కు హేజిల్‌వుడ్ షాక్ ఇచ్చాడు. ఫామ్‌లో ఉన్న రుతురాజ్ గైక్వాడ్‌(8)ను ఔట్ చేశాడు. దీంతో 16 ప‌రుగుల వ‌ద్ద భార‌త్ మొద‌టి వికెట్ కోల్పోయింది. ఆ త‌రువాత ఆస్ట్రేలియాకు సంతోషించ‌డానికి ఏమీ లేక‌పోయింది. రీ ఎంట్రీలో విమ‌ర్శ‌లు ఎదుర్కొంటున్న శ్రేయ‌స్ అయ్య‌ర్ వ‌చ్చి రావ‌డంతో బౌండ‌రీల మోత మోగించాడు. గిల్‌తో క‌లిసి ఇన్నింగ్స్ న‌డిపించే బాధ్య‌త‌ను భుజాన వేసుకున్నాడు. IND vs AUS, Shubman Gill Video: ఆస్ట్రేలియాపై సెంచరీ చేసిన తర్వాత శుభ్ మాన్ గిల్ ఏం చేశాడో తెలిస్తే షాక్ తింటారు..ఈ వీడియో చూడండి.. ఆరంభంలో ఆచితూచి ఆడిన గిల్ ఆ త‌రువాత వేగం పెంచారు. వీరిద్ద‌రు ఆసీస్ బౌల‌ర్ల‌పై ఎదురుదాడికి దిగారు. ఈ క్ర‌మంలో గిల్ 31 బంతుల్లో, శ్రేయ‌స్ 41 బంతుల్లో అర్థ‌శ‌త‌కాలు పూర్తిచేసుకున్నారు. హాఫ్ సెంచరీల త‌రువాత వీరిద్ద‌రు మ‌రింత ధాటిగా బ్యాటింగ్ చేశారు. కెప్టెన్ స్టీవ్ స్మిత్ బౌల‌ర్లు మార్చి మార్చి ప్ర‌యోగించిన‌ప్ప‌టికీ ఫ‌లితం లేకుండా పోయింది. ఆసీస్ బౌల‌ర్ల‌కు ఎలాంటి అవ‌కాశం ఇవ్వ‌కుండా గిల్-శ్రేయ‌స్ జోడి బ్యాటింగ్ చేసింది. మొద‌ట 86 బంతుల్లో శ్రేయాస్ సెంచ‌రీ చేశాడు. వ‌న్డేల్లో శ్రేయ‌స్ కు ఇది మూడో శ‌త‌కం. సెంచ‌రీ చేసిన కాసేప‌టికే ధాటిగా ఆడే క్ర‌మంలో సీన్ అబాట్ బౌలింగ్‌లో అత‌డు ఔట్ అయ్యాడు. గిల్‌-శ్రేయాస్ జోడి రెండో వికెట్‌కు 200 ప‌రుగుల భాగ‌స్వామ్యాన్ని నెల‌కొల్పారు.","pubDate":"2023-09-24 16:53:45","image_url":null,"source_id":"latestly","source_priority":5523,"country":["india"],"category":["sports"],"language":"telugu"},{"article_id":"c0089dd91779b751de0beb1f336b16cb","title":"India beat Australia by 99 runs in second ODI to take unassailable 2-0 lead in three-match series","link":"https://telanganatoday.com/india-beat-australia-by-99-runs-in-second-odi-to-take-unassailable-2-0-lead-in-three-match-series","keywords":["News","Sport","Australia","India"],"creator":["PTI"],"video_url":null,"description":"Chasing a DLS revised target of 317 runs in 33 overs in the second ODI of the three-match series, Australia were bundled out for 217.","content":"Home | News | India Beat Australia By 99 Runs In Second Odi To Take Unassailable 2 0 Lead In Three Match Series India beat Australia by 99 runs in second ODI to take unassailable 2-0 lead in three-match series Chasing a DLS revised target of 317 runs in 33 overs in the second ODI of the three-match series, Australia were bundled out for 217. By PTI Updated On - 10:26 PM, Sun - 24 September 23 Indore: Shreyas Iyer, Shubman Gill and Suryakumar Yadav were the stars of the show as India registered a series-clinching win over Australia at Holkar Cricket Stadium, Indore on Sunday. Chasing a DLS revised target of 317 runs in 33 overs in the second ODI of the three-match series, Australia were bundled out for 217. Follow Us : Tags Australia India Related News Asian Games: Indian men’s football team qualifies for knockouts; registers 1-1 draw with Myanmar Asian Games: Indian men’s football team play out 1-1 draw with Myanmar, enter round of 16 Suryakumar smashes third-fastest ODI fifty by an Indian; hits four sixes in a row Asian Games: Indian women’s cricket team beat Bangladesh by 8 wickets, enter final India score 399/5 against Australia in second ODI Shubman smashes fifth ODI century in 2023, joins elite company during 2nd ODI against Australia","pubDate":"2023-09-24 16:47:59","image_url":null,"source_id":"telanganatoday","source_priority":63887,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"02d0ef044053422a7197f66486472fa8","title":"Little resistance from Australia as India capture one-day series","link":"https://www.brisbanetimes.com.au/sport/cricket/little-resistance-from-australia-as-india-capture-one-day-series-20230925-p5e785.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":null,"video_url":null,"description":"Australia have been trounced in their one-day series in India, losing 2-0 with one game to go after they failed to overhaul a massive target in a rain-delayed game in Indore.","content":"Australia have been trounced in their one-day series in India, losing 2-0 with one game to go after they were set a revised target of 317 from 33 overs in a rain-delayed game in Indore. Australia had reached 2-56 from nine overs when the heavens opened, leaving them needing a further 261 from 24 overs under the Duckworth-Lewis-Stern (DLS) system to haul in India’s mammoth 5-399 on Sunday (Monday morning AEST). Marnus Labuschagne is bowled by Ravichandran Ashwin during the second one-day international between India and Australia in Indore. Credit: AP It was a task that proved too great as they were dismissed some 99 runs from victory. Australia’s chase started disastrously when, in the second over, opener Matt Short (9) sliced an outswinger to Ravichandran Ashwin at third man, before acting captain Steve Smith nicked off to Shubman Gill at slip for a golden duck to put seamer Prasidh Krishna on a hat-trick. David Warner (26no) and Marnus Labuschagne (17no) were at the crease when play was halted and the covers came on, but the tourists had their work cut out even before the rain came. India had delivered a stunning innings, amassing their highest total in ODIs against Australia. It wasn’t the only benchmark to tumble. An unwanted record went the way of Cameron Green (2-103), who conceded the most runs by a bowler in an Australia-India ODI. The covers come on. Credit: Getty Images Shreyas Iyer (105) and Shubman Gill (104) shrugged off an earlier 40-minute rain delay to put on 200 for the second wicket before Indian skipper KL Rahul (52) made it back-to-back half-centuries. Suriyakumar Yadav (72no off 37 balls) put on a power-hitting clinic, bludgeoning the first four balls of Green’s eighth over for 6-6-6-6. Not considered a walk-up starter in his country’s best 11, Suriyakumar belted six sixes in his thrilling 37-ball cameo, highlighting India’s embarrassment of batting riches entering the World Cup. AAP News, results and expert analysis from the weekend of sport sent every Monday. Sign up for our Sport newsletter . Save Log in , register or subscribe to save articles for later. License this article ODI Australian cricket India Most Viewed in Sport Loading","pubDate":"2023-09-24 16:45:02","image_url":null,"source_id":"brisbanetimes","source_priority":189315,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"0abde3faf6a067b8e07babec321bf550","title":"China wins first gold in Asian Games","link":"https://www.manilatimes.net/2023/09/25/sports/china-wins-first-gold-in-asian-games/1911550","keywords":["Sports","Asian Games 2023"],"creator":["Agence France-Presse"],"video_url":null,"description":"(UPDATE) HANGZHOU: Host nation China won the first gold medal of the Asian Games on Sunday, when Zou Jiaqi and Qiu Xiuping dominated the women's lightweight double sculls rowing final.The Chinese pair finished in 7min 6.78sec, with Uzbekistan's Luizakhon Islamova and Malika Tagmativa taking silver, almost 10 seconds behind. Indonesia's Chelsea Corputty and Rahma Mutiara Putri won the bronze at the Fuyang Water Sports Centre.Medals are up for grabs in nine sports on day one of the 19th Asian Games, with hosts China expected to top the table.Swimming will see seven finals later on Sunday, while shooting, wushu, gymnastics, fencing, judo, taekwondo and modern pentathlon will all crown gold medalists.Chinese President Xi Jinping opened the Games on Saturday night in a colorful ceremony, launching a two-week sporting extravaganza that boasts more athletes than the Olympics.After being delayed by a year because of China's now-abandoned zero-Covid policy, more than 12,000 competitors from 45 nations and territories will battle it out in 40 sports.Although the Games officially opened on Saturday, sports such as football, cricket, volleyball and table tennis had already begun preliminary rounds.The Games will be staged at 54 venues — 14 of them newly constructed — mostly in Hangzhou but also extending to cities as far afield as Wenzhou, 300 kilometers (180 miles) south.","content":"(UPDATE) HANGZHOU: Host nation China won the first gold medal of the Asian Games on Sunday, when Zou Jiaqi and Qiu Xiuping dominated the women's lightweight double sculls rowing final. The Chinese pair finished in 7min 6.78sec, with Uzbekistan's Luizakhon Islamova and Malika Tagmativa taking silver, almost 10 seconds behind. Indonesia's Chelsea Corputty and Rahma Mutiara Putri won the bronze at the Fuyang Water Sports Centre. Medals are up for grabs in nine sports on day one of the 19th Asian Games, with hosts China expected to top the table. Swimming will see seven finals later on Sunday, while shooting, wushu, gymnastics, fencing, judo, taekwondo and modern pentathlon will all crown gold medalists. Chinese President Xi Jinping opened the Games on Saturday night in a colorful ceremony, launching a two-week sporting extravaganza that boasts more athletes than the Olympics. After being delayed by a year because of China's now-abandoned zero-Covid policy, more than 12,000 competitors from 45 nations and territories will battle it out in 40 sports. Although the Games officially opened on Saturday, sports such as football, cricket, volleyball and table tennis had already begun preliminary rounds. The Games will be staged at 54 venues — 14 of them newly constructed — mostly in Hangzhou but also extending to cities as far afield as Wenzhou, 300 kilometers (180 miles) south.","pubDate":"2023-09-24 16:38:00","image_url":"https://www.manilatimes.net/manilatimes/uploads/images/2023/09/24/245025.jpg","source_id":"manilatimes","source_priority":33634,"country":["philippines"],"category":["sports"],"language":"english"},{"article_id":"be0754d7752fac9288874cb907d6d024","title":"IND vs AUS, 2nd ODI: World Cup-bound batters make merry as India seals series","link":"https://sportstar.thehindu.com/cricket/ind-vs-aus-2nd-odi-score-highlights-result-report-india-beat-australia-series-win-shubman-gill-shreyas-iyer-centuries/article67342107.ece","keywords":null,"creator":null,"video_url":null,"description":"The day belonged to India’s World Cup-bound batters, who put up a collective attack before the return of Rohit Sharma, Virat Kohli and Hardik Pandya for the final match.","content":null,"pubDate":"2023-09-24 16:32:35","image_url":null,"source_id":"sportstar","source_priority":2972,"country":["india"],"category":["sports"],"language":"english"}]}