{"newsArray":[{"title":"New Zealand batter Ross Taylor to retire from international cricket at end of home summer","link":"https://zeenews.india.com/cricket/new-zealand-batter-ross-taylor-to-retire-from-international-cricket-at-end-of-home-summer-2423795.html","keywords":null,"creator":null,"video_url":null,"description":"Taylor will retire from Tests at the conclusion of the two match Test series against Bangladesh at home.","content":null,"pubDate":"2021-12-30 00:47:00","full_description":"New Zealand middle order batter Ross Taylor has announced he will retire from international cricket at the end of the home summer. The three ODIs against Netherlands at home will be his last outing in an New Zealand kit. He made the announcement on December 30 on Twitter. Today I'm announcing my retirement from international cricket at the conclusion of the home summer, two more tests against Bangladesh, and six odi's against Australia & the Netherlands. Thank you for 17 years of incredible support. It's been an honour to represent my country #234 pic.twitter.com/OTy1rsxkYp — Ross Taylor (@RossLTaylor) December 29, 2021 He wrote: \"Today I'm announcing my retirement from international cricket at the conclusion of the home summer, two more tests against Bangladesh, and six odi’s against Australia & the Netherlands. Thank you for 17 years of incredible support. It’s been an honour to represent my country #234.\" Taylor will retire from Tests at the conclusion of the two match Test series against Bangladesh at home. More to follow","image_url":null,"source_id":"zeenews"},{"title":"New Zealand cricket great Ross Taylor announces retirement","link":"https://www.foxsports.com.au/cricket/countries/new-zealand/new-zealand-cricket-great-ross-taylor-announces-retirement/news-story/f0c87f048e23c71f4dd7a82964fe5678","keywords":null,"creator":null,"video_url":null,"description":"New Zealand cricket star Ross Taylor has confirmed this summer will be his last for the Black Caps, marking the end of a remarkable 16-year international career.","content":null,"pubDate":"2021-12-30 00:42:00","full_description":"New Zealand cricket star Ross Taylor has confirmed this summer will be his last for the Black Caps, marking the end of a remarkable 16-year international career. Taylor signalled his intentions on the eve of the Black Caps-Bangladesh Test series, starting in New Zealand on Saturday, confirming the two-match series would be his last in the Test whites, before bowing out after ODIs against Australia and Netherlands later this summer. Catch every moment of The Ashes live and ad-break free during play on Kayo. New to Kayo? Try 14-days free now . The 37-year-old has been a mainstay in the Black Caps batting order since making his debut in 2006, amassing a plethora of records and achievements, most notably rising to the top of New Zealand’s runs scoring (18,074) and appearances (445) charts. Taylor acknowledged it wasn’t an easy decision to make but felt the time was right. “It’s been an amazing journey and I feel incredibly fortunate to have represented my country for as long as I have,” he said. “It’s been such a privilege to play with and against some of the greats of the game and to have created so many memories and friendships along the way. “But all good things must come to an end and the timing feels right for me. “I want to thank my family, friends and all those who have helped me get to this point. “There’ll be plenty of time for more thank-yous and reflections later in the season - but for now I want all my energy and focus to be on preparing and performing for the Black Caps this summer.” Ross Taylor will go down as one of New Zealand’s best ever cricketers. (AAP Image/Dan Himbrechts) Source: AAP Coach Gary Stead said Taylor would undoubtedly bow out as one of New Zealand’s greats. “Ross has always been a hugely respected member of the side and we’re thankful for his contributions to the Black Caps over an incredible career,” Stead said. “His skills and temperament as a batsman have been world-class and his ability to perform at such a high level for so long speaks volumes of his longevity and professionalism. “His experience has held the side together on countless occasions and his catching record speaks for itself. There’s no doubt we’re going to miss him when he’s gone. “Seeing him hit the winning runs in Southampton to help win our first ICC World title is a moment I will never forget and I’m sure it’s the same for many of the fans. “I know Ross is really focused on performing well in these remaining series and going out on the right note.” Kiwi captain Kane Williamson, unavailable for the Bangladesh series while he rehabilitates an elbow injury, said Taylor had given his all to the New Zealand team over the years, and wished him well for the upcoming two Tests. “Ross has been at the core of the side for so long and can be extremely proud of having brought the game in this country to a better place,” Williamson said. “He’s a world class player, our best with the bat over such a long period of time and personally it’s been a pleasure to be involved in so many partnerships with him across the formats. “We’ve shared some pretty cool moments together – most recently the World Test Championship Final which was obviously really special. “As a senior player and a leader in the group he’s been a fantastic support person for me, especially out there in the field being able to tap into his experience. “It’s a really exciting time for Ross when he can reflect on so many amazing moments throughout his career and I know all the guys are also looking forward to sharing the occasions with him as he is such a special player to this team.” Taylor said he would remain available for Central Districts until the end of the season before making a decision on whether to continue playing domestic cricket. Taylor rescued NZ from many a precarious position. (Photo by Peter Parks / AFP) Source: AFP Ross Taylor records Most runs for NZ in Tests (7584) Most runs for NZ in ODIs (8581) Most runs for NZ over all formats (18,074) Most ODI 100s for NZ (21) Most 100s for NZ in international cricket (40) Most appearances for NZ in international cricket (445) One of only four New Zealanders to play 100 Tests (Vettori 112, Fleming 111, Taylor 110, McCullum 101) First player from any country to make 100 international appearances in each of the three formats Most catches for NZ by a fielder in international cricket (346) Highest Test score in Australia by a visiting player (290 at Perth 2015) This article first appeared on the NZ Herald and was reproduced with permission","image_url":null,"source_id":"foxsports"},{"title":"England’s Coach Chris Silverwood forced into Isolation","link":"https://www.news.com.au/sport/cricket/englands-coach-chris-silverwood-forced-into-isolation/video/70630baf3bdd71c83bc725ed06ba97d2","keywords":null,"creator":null,"video_url":null,"description":"Cricket: A positive Covid test in camp has compounded England's disastrous Ashes campaign","content":null,"pubDate":"2021-12-29 23:16:06","full_description":null,"image_url":null,"source_id":"news"},{"title":"England’s Coach Chris Silverwood forced into Isolation","link":"https://www.cairnspost.com.au/sport/cricket/englands-coach-chris-silverwood-forced-into-isolation/video/70630baf3bdd71c83bc725ed06ba97d2","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket: A positive Covid test in camp has compounded England's disastrous Ashes campaign","content":null,"pubDate":"2021-12-29 23:16:06","full_description":null,"image_url":null,"source_id":"cairnspost"},{"title":"England back Root’s captaincy - but coach Silverwood on brink","link":"https://www.smh.com.au/sport/cricket/england-back-root-s-captaincy-but-coach-silverwood-on-brink-20211230-p59ktb.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":null,"video_url":null,"description":"Joe Root retains the backing of the England and Wales Cricket Board to carry on as England’s Test captain beyond the Ashes series.","content":null,"pubDate":"2021-12-29 22:58:06","full_description":"Joe Root retains the backing of the England and Wales Cricket Board to carry on as England’s Test captain beyond the Ashes series. It remains to be seen whether Root will still want the job at the end of this tour, but it is understood he met with Tom Harrison, the ECB chief executive, in Melbourne and was urged to carry on and asked what help he needed in order to revitalise the Test team. The future of head coach Chris Silverwood is a lot less certain and the arrival of his boss, Ashley Giles, next week, and how he views performances on the rest of the tour, will be crucial. Giles is Root’s line manager too and he may have a different view to Harrison, but it feels as though the captain has support at this stage. Silverwood will have to prove he retains the confidence of the players, but even that might not be enough if Root tells the ECB he needs a change in direction and better support from the coaching staff after losing nine Tests in 2021. At this stage, it is understood Root wants to carry on as captain and the ECB recognise there is a lack of alternatives to lead the side. With the team in such a mess and requiring a lengthy rebuilding phase, it would be too much to expect a new captain to take on and lead. Ben Stokes, Root’s vice-captain, recently had a break for his mental health and England worry about overburdening their all-rounder. Joe Root has been the only English player to consistently perform in Australia. Credit: Getty Root has made errors on this trip and he may well be so exhausted by the time the series ends in Hobart that he decides to step down anyway. If he continues, then Root’s role would be to lead England into a new era, help bring through new players and leave the team in a better place to pass on to his eventual successor, possibly after the next Ashes series in 2023. The fact captaincy has not affected his batting has helped persuade him he should continue after a record-breaking year of run scoring. But he will know wholesale changes are required among the playing staff and the coaching set-up to refocus England on Test cricket and to compete again with teams like India and Australia. He will have to temper expectations of supporters because the rebuilding period could be long and involve more defeats before the team gets better, such is the state of English cricket at the moment. Giles, the director of the England men’s team, will decide if Silverwood has a future after promoting him to the head coach role and making the decision to sack Ed Smith as lead selector earlier this year. Giles has indicated in the past that he will take Covid restrictions into account when judging performances in Australia. He was in Australia for the first two Tests but came home for Christmas, missing the debacle at the MCG. He will be back for the Sydney Test that starts on Jan 5 and remain for the rest of the tour. Silverwood said six months ago, when he picked his first Test squad, that he wanted them to arrive in Australia “fitter, faster, leaner, more ready than ever before, and they get off the plane and it is ‘right, we’re here, we mean business and we’re full of confidence’ and that will take us through.” It has not happened and they have produced three of the worst performances by an England team in Australia in recent times, losing the Ashes series in little more than 11 days of cricket. England captain Joe Root, coach Chris Silverwood and James Anderson chat about the pitch. Credit: Getty Images Giles will discover that Root retains the backing of his team-mates, but he will have to decide whether it is genuine or just players worrying about their own futures and believing the incumbent is less likely to make changes. Harrison’s endorsement is also hardly rock solid given he could step down in March at the end of the financial year. “Absolutely,” said Chris Woakes when asked about the support from the players for Root. “It’s clear that the captaincy isn’t having an effect on his batting, which a lot of the time with captains can be the case. “Joe is a great cricketer, he’s got a great cricket brain,” he added. “I think his record as England captain is pretty good, as far as I’m aware. I definitely feel like Joe will continue.” Woakes was also asked if Silverwood retains the support of the players. “Who am I to talk about people’s futures other than my own, to be brutally honest. So, yeah, I think we’ve got two really important games coming up. “We want to show a lot of character, a lot of fight. We want to put some pride back into wearing that badge, which we certainly have tried in this series. But we need to try even harder and put that right. “The management and the staff we have out here have the backing of the players to hopefully put things right over the next two games in particular.” Silverwood and Root can rightly claim that their public criticism of England’s bowlers worked as James Anderson bowled much better in Melbourne, and even gave them a chance of victory that the batsmen were unable to capitalise on. England had a voluntary net session on Wednesday, with 10 players, including the entire top three from the third Test, deciding to take part. All players, family and staff returned negative coronavirus tests on Wednesday but will be retested again over the next 48 hours after an outbreak in the touring party during the Boxing Day Test. The Daily Telegraph","image_url":null,"source_id":"smh"},{"title":"England back Root’s captaincy - but coach Silverwood on brink","link":"https://www.theage.com.au/sport/cricket/england-back-root-s-captaincy-but-coach-silverwood-on-brink-20211230-p59ktb.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":null,"video_url":null,"description":"Joe Root retains the backing of the England and Wales Cricket Board to carry on as England’s Test captain beyond the Ashes series.","content":null,"pubDate":"2021-12-29 22:58:06","full_description":"Joe Root retains the backing of the England and Wales Cricket Board to carry on as England’s Test captain beyond the Ashes series. It remains to be seen whether Root will still want the job at the end of this tour, but it is understood he met with Tom Harrison, the ECB chief executive, in Melbourne and was urged to carry on and asked what help he needed in order to revitalise the Test team. The future of head coach Chris Silverwood is a lot less certain and the arrival of his boss, Ashley Giles, next week, and how he views performances on the rest of the tour, will be crucial. Giles is Root’s line manager too and he may have a different view to Harrison, but it feels as though the captain has support at this stage. Silverwood will have to prove he retains the confidence of the players, but even that might not be enough if Root tells the ECB he needs a change in direction and better support from the coaching staff after losing nine Tests in 2021. At this stage, it is understood Root wants to carry on as captain and the ECB recognise there is a lack of alternatives to lead the side. With the team in such a mess and requiring a lengthy rebuilding phase, it would be too much to expect a new captain to take on and lead. Ben Stokes, Root’s vice-captain, recently had a break for his mental health and England worry about overburdening their all-rounder. Joe Root has been the only English player to consistently perform in Australia. Credit: Getty Root has made errors on this trip and he may well be so exhausted by the time the series ends in Hobart that he decides to step down anyway. If he continues, then Root’s role would be to lead England into a new era, help bring through new players and leave the team in a better place to pass on to his eventual successor, possibly after the next Ashes series in 2023. The fact captaincy has not affected his batting has helped persuade him he should continue after a record-breaking year of run scoring. But he will know wholesale changes are required among the playing staff and the coaching set-up to refocus England on Test cricket and to compete again with teams like India and Australia. He will have to temper expectations of supporters because the rebuilding period could be long and involve more defeats before the team gets better, such is the state of English cricket at the moment. Giles, the director of the England men’s team, will decide if Silverwood has a future after promoting him to the head coach role and making the decision to sack Ed Smith as lead selector earlier this year. Giles has indicated in the past that he will take Covid restrictions into account when judging performances in Australia. He was in Australia for the first two Tests but came home for Christmas, missing the debacle at the MCG. He will be back for the Sydney Test that starts on Jan 5 and remain for the rest of the tour. Silverwood said six months ago, when he picked his first Test squad, that he wanted them to arrive in Australia “fitter, faster, leaner, more ready than ever before, and they get off the plane and it is ‘right, we’re here, we mean business and we’re full of confidence’ and that will take us through.” It has not happened and they have produced three of the worst performances by an England team in Australia in recent times, losing the Ashes series in little more than 11 days of cricket. England captain Joe Root, coach Chris Silverwood and James Anderson chat about the pitch. Credit: Getty Images Giles will discover that Root retains the backing of his team-mates, but he will have to decide whether it is genuine or just players worrying about their own futures and believing the incumbent is less likely to make changes. Harrison’s endorsement is also hardly rock solid given he could step down in March at the end of the financial year. “Absolutely,” said Chris Woakes when asked about the support from the players for Root. “It’s clear that the captaincy isn’t having an effect on his batting, which a lot of the time with captains can be the case. “Joe is a great cricketer, he’s got a great cricket brain,” he added. “I think his record as England captain is pretty good, as far as I’m aware. I definitely feel like Joe will continue.” Woakes was also asked if Silverwood retains the support of the players. “Who am I to talk about people’s futures other than my own, to be brutally honest. So, yeah, I think we’ve got two really important games coming up. “We want to show a lot of character, a lot of fight. We want to put some pride back into wearing that badge, which we certainly have tried in this series. But we need to try even harder and put that right. “The management and the staff we have out here have the backing of the players to hopefully put things right over the next two games in particular.” Silverwood and Root can rightly claim that their public criticism of England’s bowlers worked as James Anderson bowled much better in Melbourne, and even gave them a chance of victory that the batsmen were unable to capitalise on. England had a voluntary net session on Wednesday, with 10 players, including the entire top three from the third Test, deciding to take part. All players, family and staff returned negative coronavirus tests on Wednesday but will be retested again over the next 48 hours after an outbreak in the touring party during the Boxing Day Test. The Daily Telegraph","image_url":null,"source_id":"theage"},{"title":"Ricky Ponting damns England as worst performing team to tour Australia - The Guardian","link":"https://news.google.com/__i/rss/rd/articles/CBMidmh0dHBzOi8vd3d3LnRoZWd1YXJkaWFuLmNvbS9zcG9ydC8yMDIxL2RlYy8yOS9yaWNreS1wb250aW5nLWVuZ2xhbmQtd29yc3QtcGVyZm9ybWluZy1jcmlja2V0LXRlYW0tdG91ci1hdXN0cmFsaWEtYXNoZXPSAXZodHRwczovL2FtcC50aGVndWFyZGlhbi5jb20vc3BvcnQvMjAyMS9kZWMvMjkvcmlja3ktcG9udGluZy1lbmdsYW5kLXdvcnN0LXBlcmZvcm1pbmctY3JpY2tldC10ZWFtLXRvdXItYXVzdHJhbGlhLWFzaGVz?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Ricky Ponting damns England as worst performing team to tour Australia  The GuardianLetters: It is not the players but the ECB that's to blame for the pitiful Ashes defeat in Australia  Telegraph.co.ukThe Ashes: Ricky Ponting labels England the worst-performing team to have toured Australia  Sky SportsEnglish cricket is in disarray – and it’s a metaphor for the whole country  The GuardianEnglish first-class cricket needs a revolution or risk 2023 Ashes thrashing on home soil  Telegraph.co.ukView Full coverage on Google News","content":null,"pubDate":"2021-12-29 22:28:00","image_url":null,"source_id":"google"},{"title":"England cricket coach must isolate, will miss 4th Ashes test","link":"https://www.thestar.com/sports/cricket/2021/12/29/england-cricket-coach-must-isolate-will-miss-4th-ashes-test.html","keywords":null,"creator":["The Associated Press"],"video_url":null,"description":null,"content":null,"pubDate":"2021-12-29 21:59:20","full_description":"MELBOURNE, Australia (AP) — England cricket coach Chris Silverwood will be absent for the fourth Ashes test against Australia because he needs to isolate following a positive test for the coronavirus among a family member of the touring party. Silverwood will have to isolate for 10 days — along with his family — in Melbourne, where the third test was played. England lost that match, and with it the series, as Australia took an unassailable 3-0 lead in the five-match Ashes. England said the positive test for what it termed “one family member” happened on Wednesday. A further round of PCR tests will be administered on Thursday. England’s touring party has recorded seven positive cases — three support staff and four family members — since a PCR testing regime was implemented on Monday. The players are due to fly to Sydney on Friday ahead of the fourth test. ___ More AP cricket: https://apnews.com/hub/cricket and https://twitter.com/AP_Sports Anyone can read Conversations, but to contribute, you should be registered Torstar account holder. If you do not yet have a Torstar account, you can create one now (it is free) Sign In Register","image_url":null,"source_id":"thestar"},{"title":"England cricket coach forced into isolation","link":"https://wwos.nine.com.au/cricket/ashes-england-coach-chris-silverwood-forced-into-isolation-fourth-ashes-test-covid-19/e7e5b0de-2408-47b9-bcc5-0ef7ad96f90a","keywords":null,"creator":["wwos"],"video_url":null,"description":"England coach Chris Silverwood has been caught up in the growing COVID-19 outbreak impacting the tourists.","content":"England coach Chris Silverwood will miss the fourth Ashes Test in Sydney after being forced into isolation due to the growing COVID-19 outbreak impacting the tourists.The England side this week has been forced to undergo regular testing for COVID-19 after the Boxing Day Test was nearly cancelled mid-match when two family members and two support staff tested positive.Following another round of testing, England this morning revealed that Silverwood and his family will need to isolate for 10 days after the touring party's cluster grew to seven cases.READ MORE: Mark Taylor's player ratings from the MCG Ashes TestREAD MORE: Huni fight in doubt after positive COVID test\"Following the latest round of PCR tests administered to the England Men's touring party on Wednesday 29 December, one family member has tested positive,\" England Cricket said in a statement.\"As a result of the positive test, England Men's Head Coach Chris Silverwood will have to isolate for 10 days, along with his family, in Melbourne and will miss the fourth Ashes Test due to start in Sydney on Wednesday 5 January 2022.\"A fourth successive round of PCR tests will be administered today (Thursday).\"The touring party have recorded seven positive cases - three support staff and four family members - since a PCR testing regime was implemented on Monday 27 December.\"Both teams - England and Australia - are due to fly to Sydney via a chartered flight on Friday morning.\"MORE TO COMEFor a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here!","pubDate":"2021-12-29 21:58:41","full_description":"England coach Chris Silverwood will miss the fourth Ashes Test in Sydney after being forced into isolation due to the growing COVID-19 outbreak impacting the tourists. The England side this week has been forced to undergo regular testing for COVID-19 after the Boxing Day Test was nearly cancelled mid-match when two family members and two support staff tested positive . Following another round of testing, England this morning revealed that Silverwood and his family will need to isolate for 10 days after the touring party's cluster grew to seven cases. READ MORE: Mark Taylor's player ratings from the MCG Ashes Test READ MORE: Huni fight in doubt after positive COVID test \"Following the latest round of PCR tests administered to the England Men's touring party on Wednesday 29 December, one family member has tested positive,\" England Cricket said in a statement. \"As a result of the positive test, England Men's Head Coach Chris Silverwood will have to isolate for 10 days, along with his family, in Melbourne and will miss the fourth Ashes Test due to start in Sydney on Wednesday 5 January 2022. \"A fourth successive round of PCR tests will be administered today (Thursday). \"The touring party have recorded seven positive cases - three support staff and four family members - since a PCR testing regime was implemented on Monday 27 December. \"Both teams - England and Australia - are due to fly to Sydney via a chartered flight on Friday morning.\" For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here!","image_url":"https://vms-network-images-prod.s3-ap-southeast-2.amazonaws.com/2021/12/400906/281221cricketwin.png","source_id":"nine"},{"title":"Cricket-England coach Silverwood to miss fourth Ashes test after being forced to isolate","link":"https://www.thestar.com.my/sport/cricket/2021/12/30/cricket-england-coach-silverwood-to-miss-fourth-ashes-test-after-being-forced-to-isolate","keywords":null,"creator":null,"video_url":null,"description":"MELBOURNE, Australia (Reuters) - England head coach Chris Silverwood will miss the fourth Ashes test in Sydney next week after a family member tested positive for COVID-19 and he must isolate for 10 days, the England and Wales Cricket Board said in a statement on Wednesday. Read full story","content":null,"pubDate":"2021-12-29 21:52:00","full_description":"MELBOURNE, Australia (Reuters) - England head coach Chris Silverwood will miss the fourth Ashes test in Sydney next week after a family member tested positive for COVID-19 and he must isolate for 10 days, the England and Wales Cricket Board said in a statement on Wednesday. The fourth test is due to start next Tuesday with Australia having already retained the Ashes, leading the series 3-0 with two matches to play. \"Following the latest round of PCR tests administered to the England men's touring party on Wednesday 29 December, one family member has tested positive,\" the ECB statement read. \"As a result of the positive test, England men's head coach Chris Silverwood will have to isolate for 10 days, along with his family, in Melbourne and will miss the fourth Ashes test.\" England have struggled with a COVID-19 outbreak that was discovered before the start of the second day of third test in Melbourne. Seven positive cases - three support staff and four family members - have been found in the camp this week. England and Australia players were cleared to play day three in Melbourne after all testing negative for COVID-19, with the hosts seeing out the victory by an innings and 14 runs to retain the urn. A fourth successive round of PCR tests will be administered on Thursday. Both England and Australia are due to fly to Sydney via a chartered flight on Friday morning. (Reporting by Peter Hall, editing by Pritha Sarkar)","image_url":"https://apicms.thestar.com.my/uploads/images/2021/12/30/1424802.jpg","source_id":"thestar_my"},{"title":"England’s tour goes from bad to worse - NEWS.com.au","link":"https://news.google.com/__i/rss/rd/articles/CBMinwFodHRwczovL3d3dy5uZXdzLmNvbS5hdS9zcG9ydC9jcmlja2V0L2VuZ2xhbmQtdG91ci1nb2VzLWZyb20tYmFkLXRvLXdvcnNlLWFzLWNvdmlkLW91dGJyZWFrLWZvcmNlcy1jb2FjaC10by1pc29sYXRlL25ld3Mtc3RvcnkvMmJhOTBiYzdlNTZiZGRkNzM5OTk1NTI1YTU0YTY0NGLSAaMBaHR0cHM6Ly93d3cubmV3cy5jb20uYXUvc3BvcnQvY3JpY2tldC9lbmdsYW5kLXRvdXItZ29lcy1mcm9tLWJhZC10by13b3JzZS1hcy1jb3ZpZC1vdXRicmVhay1mb3JjZXMtY29hY2gtdG8taXNvbGF0ZS9uZXdzLXN0b3J5LzJiYTkwYmM3ZTU2YmRkZDczOTk5NTUyNWE1NGE2NDRiP2FtcA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"England’s tour goes from bad to worse  NEWS.com.auBREAKING: England head coach to miss fourth Test as Covid chaos deepens  Fox SportsEngland coach to miss SCG Test due to COVID case  cricket.com.auPlayers test negative, Boxing Day Test gets go ahead to continue  The AgeEngland coach Chris Silverwood to miss fourth Ashes Test in Sydney due to COVID-19 outbreak  ABC NewsView Full coverage on Google News","content":null,"pubDate":"2021-12-29 21:32:35","image_url":null,"source_id":"google"},{"title":"India close in on South African victory","link":"https://www.cairnspost.com.au/sport/cricket/india-close-in-on-south-african-victory/video/d8d9aa7e8dd58a2a1271da4f86c08670","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket: South Africa will need a further 211 runs with only 6 wickets remaining in order to pull of an incredible win over India.","content":null,"pubDate":"2021-12-29 21:28:08","full_description":null,"image_url":null,"source_id":"cairnspost"},{"title":"India close in on South African victory","link":"https://www.news.com.au/sport/cricket/india-close-in-on-south-african-victory/video/d8d9aa7e8dd58a2a1271da4f86c08670","keywords":null,"creator":null,"video_url":null,"description":"Cricket: South Africa will need a further 211 runs with only 6 wickets remaining in order to pull of an incredible win over India.","content":null,"pubDate":"2021-12-29 21:28:08","full_description":null,"image_url":null,"source_id":"news"},{"title":"Aussies celebrate in style after belting Poms","link":"https://www.news.com.au/sport/cricket/the-ashes/australia-celebrates-thumping-ashes-win-in-style-on-the-mcg/news-story/16681ce94de833f42cece3089114e190","keywords":null,"creator":null,"video_url":null,"description":"Nearly three hours after Australia retained the Ashes, David Warner emerged from the MCG sheds with his young family for a game of “backyard” cricket.","content":null,"pubDate":"2021-12-29 20:09:00","full_description":"Nearly three hours after Australia retained the Ashes, David Warner emerged from the MCG sheds with his young family for a game of “backyard” cricket. Earlier that day, 40,945 cricket fans had witnessed a demolition job , but apart from a few security guards and venue staff, the stands were now completely empty. Wielding plastic bats, the Warner girls took turns facing throwdowns from their father on the iconic turf, with wife Candice watching on. Catch every moment of The Ashes live and ad-break free during play on Kayo. New to Kayo? Try 14-days free now. Soon the other Australian players and their partners trickled out from the changeroom. Some took a seat near the boundary rope with a beer, while a couple of others joined the Warner family’s game. Music blared from a portable speaker, with a collection of pub anthems and pop hits on rotation – Bruce Springsteen’s Glory Days , Toto’s Africa , Shannon Noll’s What About Me , Vanessa Carlton’s A Thousand Miles and A-Ha’s Take on Me among them. Great vibes all around here. Although theyâve gone to Adeleâs âEasy On Meâ which I certainly wasnât expecting. #Ashes pic.twitter.com/hOuwQ575sQ Pat Cummins, who has won an Ashes series just two Tests into his reign as Australian captain, slowly waltzed around the boundary rope with his fiancee. A couple of lubricated gents in a corporate box, still enjoying the free canapes while they could, yelled out their admiration for the Aussie skipper. He gave them a polite smile in return. Debutant Scott Boland, who wasn’t even in the Australian squad seven days prior, walked out towards the pitch with his young daughter. The Victorian quick had a few hours earlier taken 6/7 on his home ground, obliterating England’s middle-order to help roll the tourists for 68. With the Johnny Mullagh Medal for Player of the Match still around his neck, Boland shared a moment with his daughter away from his teammates, reliving the 24 deliveries that had made him an Ashes hero. The infant nonchalantly fiddled with the stumps at the Members End, the same pegs her father had rattled the previous evening to remove nightwatchman Jack Leach for a second-ball duck. Follow your dreams, kiddo. Scott Boland, a mere three hours after taking 6-7 on debut at the MCG, with his child. Beer in one-hand, the #ashes in the other pic.twitter.com/6AMghO0YMc West Australian seamer Jhye Richardson booted a Sherrin with some teammates while opener Marcus Harris chased Warner’s eldest daughter with a water bottle, threatening to drench her as she squealed with delight while running around the field. Harris’ spot in the Test side had been in jeopardy ahead of the MCG Test, but a gritty 76 in the first innings was more than enough to cement his spot in the starting XI for the remainder of the series. In that knock, he scored more runs than England’s side collectively managed in the second innings. As the sun started to set behind the MCG’s western stand, the players and support staff formed a circle near the centre square and sang along to John Williamson’s True Blue , which was blasting from the speaker. Family members watched on from a respectable distance. “Hey True Blue, can you bear the load Will you tie it up with wire Just to keep the show on the road Hey True Blue Hey True Blue, now be Fair Dinkum.” More than five hours after retaining the Ashes, Australiaâs players return to the MCG turf and sing âTrue Blueâ. #Ashes pic.twitter.com/gAmZHRVxxn Nathan Lyon then took centre stage – the off-spinner has led the team song since Michael Hussey handed over the illustrious duty in 2013. Australian coach Justin Langer had the job before him. Lyon prowled around the circle and heralded individuals for their performances, after which they were drenched in beer. Each sentence was met with loud cries of approval and giddy excitement. Eventually, more than five hours after Cameron Green knocked over England tailender James Anderson to secure the coveted urn, the Aussies belted their victory song. “Under the Southern Cross I Stand A sprig of wattle in my hand, A native of my native land, Australia you f***ing beauty.” After 18 months of hotel quarantine and biosecurity bubbles, the cricketers must have cherished the opportunity to celebrate a win alongside family and loved ones. “It’s what dreams are made of, the way we’ve played,” Cummins told reporters on Tuesday. “Our bowlers have been fantastic in that I haven‘t really felt like there’s been one session where it’s got away from us. “And I think outside of the results, there’s so many other positives as well. “It doesn’t just feel like a three-nil victory, it really feels like we’re setting ourselves up for the next few years as well. “We’ve got seven players in the top 10 of the world at the moment – four batters and three bowlers. “And we probably haven’t strung the performances over the last couple of years that we probably expected of ourselves. “So I think this really consolidates that we are a really good, strong Test cricket side and it’s a good sign for the next few years.” The mystery around Justin Langer’s future as Australian coach won’t go away, intensifying after Pat Cummins’ post-match comments. There were calls to build a statue of Scott Boland after his Ashes heroics — but the reality is he may never play another Test match. England cricket lovers are baying for blood after another Ashes humiliation as one post-match interview at the MCG infuriated fans.","image_url":null,"source_id":"news"},{"title":"Hope can rise from this Ashes debacle, if the ECB stops choking the golden goose | Barney Ronay","link":"https://www.theguardian.com/sport/blog/2021/dec/29/ashes-england-cricket-ecb-joe-root-chris-silverwood","keywords":["England cricket team","ECB","Chris Silverwood","Joe Root","Ashes 2021-22","The Ashes","Cricket","Australia sport","Sport"],"creator":["Barney Ronay"],"video_url":null,"description":"This latest defeat exposes the poverty in English Test cricket but it is possible to resist the decline, starting with bringing to account those overseeing itChris Silverwood is taking the positives. Chris Silverwood was expecting this. Chris Silverwood has found, squinting through his Victorian eyeglass, something to build on here.Watching Silverwood’s deeply weird performance in front of the cameras at the end of the third Ashes Test in Melbourne – batting away concerns, wincing in the sun, and wearing throughout the pitying smile of a man who knows that all of this is simply another stage in the vast, unknowable masterplan of Chris Silverwood – it was hard not to worry a little about England’s head coach; to search in vain for the line between nightmarishly bad media training and a man so embedded within the blue Lycra bubble he really has lost sight of the disaster unfolding around him. Continue reading...","content":null,"pubDate":"2021-12-29 20:00:30","full_description":"Chris Silverwood is taking the positives. Chris Silverwood was expecting this. Chris Silverwood has found, squinting through his Victorian eyeglass, something to build on here. Watching Silverwood’s deeply weird performance in front of the cameras at the end of the third Ashes Test in Melbourne – batting away concerns, wincing in the sun, and wearing throughout the pitying smile of a man who knows that all of this is simply another stage in the vast, unknowable masterplan of Chris Silverwood – it was hard not to worry a little about England’s head coach; to search in vain for the line between nightmarishly bad media training and a man so embedded within the blue Lycra bubble he really has lost sight of the disaster unfolding around him . There is little to be gained from dwelling on Silverwood’s own fate at the end of this series. He is now that familiar thing, a coach who has failed to manage the details, who is clearly out of his depth, and whose dismissal will, in the classic footballing style, provide a useful straw man, patsy and general distraction from the more profound failings of those above him in the hierarchy. Still, watching Silverwood reel off his own game and biddable version of the ECB blame-avoidance handbook, it was hard not to feel a familiar sense of dissolution, of something deathly that has now found a concrete form in this southern Ashes series. The usual factors in England Ashes defeats are all reassuringly present: poor preparation, poor conditioning, the fact that Australia are demonstrably better at cricket. But there is something else here too, a quality present in so many parts of British public life, something we might call Johnsonian dissonance. Welcome, England cricket, to a place where no one is ever really accountable, where that thing you like, that difficult, unprofitable thing, is being taken away, run down and sold off right in front of your eyes by a cartel of bonus-hungry executives. Where nothing is really true, anything is possible, where Chris Silverwood really is taking the positives, and where the overwhelming reaction seems to be a kind of weary fatalism. This is the most disturbing aspect to England’s Ashes disintegration , the shared conviction that this is simply a structural inevitability, born out of irresistible macro-forces. We know the exculpatory arguments by now. The dying off of Test cricket around the world, something the England and Wales Cricket Board is apparently bound not to resist or fight against but simply to accept. The basic weirdness of a sport where you stand around doing nothing most of the time, where you can’t see the ball, an idea that frankly wouldn’t get past the first TV pitch stage these days. Not to mention the line pushed by the marketeers of the ECB that people are basically shallow and need to be given shallow things, that children can’t concentrate and only like noise and light and simple stuff. So much of this seems to have been accepted as true that England’s on-field disintegration has come to feel like a referendum on the viability of red-ball cricket itself: evidence, finally, that a death foretold for most of the past 120 years has finally come to pass. In reality the more useful reaction here is not fatalism, but resistance. Because none of this inevitable. Test cricket has always been an awkward thing, one of those objects, like poetry, or libraries, or the stubbornly over‑engineered Saab convertible, that defies the logic of the market simply by existing. It might have died after the war but for the indulgence of the state broadcaster. It might have died many times over in the decades since but for the fact people like and indeed love its difficult, unmonetised complexities. Even now, at a time when red‑ball cricket has been allowed to enter a period of managed decline, like a post‑industrial northern city in the hands of the Thatcher government, it is possible to resist this process, to make different decisions, to protect things that have value. The most immediate point is that there must be accountability or the gig is frankly up. Joe Root is a brilliant batsman and a popular presence in the cricket media. But the idea that he should remain England captain because there is no other immediate candidate capable of doing a similarly regulation job is terribly destructive. Elite sport needs sharp edges. And there are already so many points of vagueness here. Why did England talk for two years about the Ashes and yet arrive without any real coherent plan? Why did they pick weird, unbalanced teams? Just because there are systemic problems doesn’t mean it’s not possible to be a good coach. Just because the County Championship has been degraded to the extent nobody, not even the players themselves, really knows the red-ball capacities of the current generation, doesn’t mean you can’t also be a competent captain. And while we’re at it the notion of accountability must extend upwards – if not to the ECB’s chief executive Tom Harrison (which it should), then to the largely invisible Ashley Giles whose qualifications to be “managing director” of anything have not been made any clearer by his time in charge of England men’s cricket. At which point we might actually be starting to get somewhere. For all the blurring of lines, it isn’t hard to draw the arrows here. The insipid state of England Test cricket in 2021-22, the competitive death of England’s most lucrative series, the progressive strangling of the real golden goose: all of this lies at the door of the ECB. Why are England so poor at Test cricket? Because the talent pool is tiny, because this thing is essentially invisible outside of the pre-converted and those who can pay. The poverty of England’s red-ball team comes from exactly the same place as the revelations of institutional racism that drew such deeply unconvincing gasps of surprise from the chief executive once public pressure demanded some kind of response. The ECB has overseen this decline in reach, knowingly and in plain sight, registering no sense of duty to anything other than profit and loss during the quarter century of its existence. This is a governing body that has awarded its own executive a £2.1m bonus for “promoting” the sport, while simultaneously allowing the shared national treasure that is Test cricket to wither in the ground, a scandal that should on its own demand another visit to the DCMS committee. Little wonder at the end of all this we have that feeling of disintegration. This is an old England team. Root, Ben Stokes, Jimmy Anderson, Stuart Broad, Jonny Bairstow, Jack Leach, Chris Woakes, Rory Burns, Dawid Malan, Jos Buttler and Mark Wood are unlikely to come this way again. At another time this might feel like a source of excitement, the chance to renew and refresh. Given a proper domestic season, and the will to fund, resource and promote even those things that don’t bring instant profit but which are very obviously the heart of this beloved, oddly enduring old sporting culture, it could still be again.","image_url":"https://i.guim.co.uk/img/media/38873f66b58d709d225b85e4626fcbdedfdda1b0/0_0_3500_2100/master/3500.jpg?width=460&quality=85&auto=format&fit=max&s=4947fbc02f29eb171a18628c6bb6cd84","source_id":"theguardian"},{"title":"Most wickets in an Ashes series: List of leading wicket takers in an Ashes series","link":"https://thesportsrush.com/cricket-news-most-wickets-in-an-ashes-series-list-of-leading-wicket-takers-in-an-ashes-series/","keywords":["Cricket","Ashes","Ashes 2021-22","Australia vs England","England vs Australia"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Most wickets in an Ashes series: Cricket’s oldest rivalry has seen some fierce battles between bowlers from both the nations over the years. The England men’s Cricket team have not only been humbled but humiliated by their Australian counterparts during the much hyped Ashes 2021-22 series in Australia. Joe Root’s men catapulted not once, not… The post Most wickets in an Ashes series: List of leading wicket takers in an Ashes series appeared first on The SportsRush.","content":"Most wickets in an Ashes series: Cricket’s oldest rivalry has seen some fierce battles between bowlers from both the nations over the years. The England men’s Cricket team have not only been humbled but humiliated by their Australian counterparts during the much hyped Ashes 2021-22 series in Australia. Joe Root’s men catapulted not once, not twice, but three times over in consecutive Tests to lose yet another opportunity to claim the ‘urn’, which has remained their distant dream since the year 2011 on Australian soil. In fact, England have not won a single Test in Australia since the 2010/11 Ashes series. The fact that England actually spent longer in quarantine upon entering Australia (14 days) than it look them to lose the Ashes series (12 days) is evident enough of the kind of drubbing they’ve been handed by Pat Cummins and his troops. The year 2021 was, so say the least, the worse England have ever fared in the game’s longest format. Not only did England equal Bangladesh’s all-time Test record of nine Test defeats in a single calendar year, set in 2003, they also equalled their own record of 54 ducks in Test cricket in a year, set in 1998. England all out 68 – and the Ashes are gone in the most humiliating manner imaginable. Congrats to Australia on being way too good for us, and to Scotty Boland – who I’d never heard of a week ago! – on one of the all-time great Ashes bowling performances. I feel sick. pic.twitter.com/aY6oUC27g2 — Piers Morgan (@piersmorgan) December 28, 2021 The rivalry, which began in the year 1882/83 has seen some intense battles with both bat and ball over the years; and the fight for the ‘Ashes urn’ remains till date in the 21st century. As far as the most wicket-takers in a single Ashes series between these two rivals are concerned, the list is heavily skewed in favour of the Aussie bowlers, with 7 of them making it to the list comprising the Top 10. In the ongoing series (2021-22) as well, three Australian bowlers- Mitchell Starc (14), Nathan Lyon (12), and Pat Cummins (10) take the top positions in the leading wicket-takers list so far. Most wickets in an Ashes series Despite the Aussie dominance, it is England’s former off-break bowler Jim Laker who tops the chart of players who’ve taken the most number of wickets in an Ashes series. Laker had, during the 1956 Ashes (Australia in England) series taken a total of 46 wickets in 5 matches, at a mind-boggling average of 9.60 and a strike rate of 37.0. It was in this very series, that Laker had taken all 10 wickets in a single innings, and had returned with overall match figures of 19/90- a record which is yet to be broken till date. The Aussies- Terence Alderman (42 wickets, 1981), Rodney Hogg (41 wickets, 1978/79), Terence Alderman (41 wickets, 1989), and Shane Warne (40 wickets, 2005) take the next four positions to complete the Top 5 list of highest wicket-takers in a single Ashes series. S.NO. PLAYER COUNTRY YEAR MAT WKTs BALLS RUNS AVG. ECO 1 Jim Laker England 1956 5 46 1703 442 9.60 1.55 2 Terence Alderman Australia 1981 6 42 1950 893 21.26 2.74 3 Rodney Hogg Australia 1978/79 6 41 1740 527 12.85 1.81 4 Terence Alderman Australia 1989 6 41 1616 712 17.36 2.64 5 Shane Warne Australia 2005 5 40 1517 797 19.92 3.15 6 AV Bedsar England 1953 5 39 1591 682 17.48 2.57 7 Denis Lillee Australia 1981 6 39 1870 870 22.30 2.79 8 MW Tate England 1924/25 5 38 2528 881 23.18 2.09 9 Mitchell Johnson Australia 2013/14 5 37 1132 517 13.97 2.74 10 Glenn McGrath Australia 1997 6 36 1499 701 19.47 2.80           The post Most wickets in an Ashes series: List of leading wicket takers in an Ashes series appeared first on The SportsRush.","pubDate":"2021-12-29 19:42:51","full_description":null,"image_url":null,"source_id":"thesportsrush"},{"title":"The bold Ashes selection Aussies must make","link":"https://wwos.nine.com.au/cricket/ashes-2021-australia-team-vs-england-fourth-test-at-scg-mitchell-swepson-nathan-lyon-bowlers-exclusive/cb23d8ec-8a5f-4422-b1ed-76679d16573a","keywords":null,"creator":["wwos"],"video_url":null,"description":"Mark Taylor wants Australia to consider a left-field selection for the fourth Ashes Test that will benefit the team long-term.","content":"Cricket legend Mark Taylor wants Australia to consider a left-field selection for the fourth Ashes Test that will benefit the team long-term.The hosts have the luxury of tinkering with their line-up, having already won the series and holding a 3-0 buffer over England with two matches to play.Victorian paceman Scott Boland made his debut in the third Test and took seven wickets, including 6-7 in the second innings to win the Johnny Mullagh Medal.READ MORE: Justis Huni's big fight in doubt after positive COVID-19 testREAD MORE: Legend's blunt advice for woeful EnglandREAD MORE: Tennis Australia's Djokovic wish despite ATP Cup confusionNow, Taylor wants Australia to hand a baggy green to another debutant at the SCG next week.He wants leg-spinner Mitchell Swepson brought in.The suggestion is to play Swepson alongside Nathan Lyon - Australia's most successful finger spinner ever - and pick only two specialist fast bowlers.\"Australia has got the essence of a good side going forward. They need to find a suitable replacement in years to come for Nathan Lyon,\" Taylor told Wide World of Sports.\"Maybe that is Mitch Swepson, and maybe they even give Swepson the next Test match.\"You never like to see Test matches used as trial games, but it will be interesting to see if Mitch Swepson comes into consideration for Australia for the next Test.\"Will they consider maybe playing two seamers, (all-rounder) Cameron Green, Lyon, and Swepson? That might be something depending on the pitch at the SCG.\"It's rare for any Test team to play two specialist spinners in Australia. But Lyon and Swepson turn the ball in different directions, and Taylor says the Aussies must begin blooding a long-term replacement for Lyon.The 34-year-old has taken 411 Test wickets in 103 matches. There was speculation he may be dropped ahead of this Ashes series, given he struggled against India last summer.Swepson, 28, has played 49 first-class games for Queensland and averages 33.76 with the ball.He's been in the Test squad before but has never been given a debut.If Australia was to only play two specialist pacemen it would be an impossible decision for selectors.After Boland's stirring debut he joins Pat Cummins, Mitchell Starc, Josh Hazlewood, Jhye Richardson, and Michael Neser on the list of suitable contenders. Hazlewood remains under an injury cloud, having not played the last two Tests.\"Australia's greatest headache is who are they going to leave out,\" Taylor said.\"The side looks very settled. I think Pat Cummins, the side has really responded to him becoming captain, and that's a great sign for Australia.\"There's certainly an energy in the Australian side that's not in the England side.\"They're filling a few gaps in their line-up. Cameron Green is getting better all the time, although we would like to see him get a really good score at some stage. But he's solidifying himself in that No.6 role.\"For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here!","pubDate":"2021-12-29 19:19:51","full_description":"Cricket legend Mark Taylor wants Australia to consider a left-field selection for the fourth Ashes Test that will benefit the team long-term. The hosts have the luxury of tinkering with their line-up, having already won the series and holding a 3-0 buffer over England with two matches to play. Victorian paceman Scott Boland made his debut in the third Test and took seven wickets, including 6-7 in the second innings to win the Johnny Mullagh Medal. READ MORE: Justis Huni's big fight in doubt after positive COVID-19 test READ MORE: Legend's blunt advice for woeful England READ MORE: Tennis Australia's Djokovic wish despite ATP Cup confusion Now, Taylor wants Australia to hand a baggy green to another debutant at the SCG next week. He wants leg-spinner Mitchell Swepson brought in. The suggestion is to play Swepson alongside Nathan Lyon - Australia's most successful finger spinner ever - and pick only two specialist fast bowlers. \"Australia has got the essence of a good side going forward. They need to find a suitable replacement in years to come for Nathan Lyon,\" Taylor told Wide World of Sports. \"Maybe that is Mitch Swepson, and maybe they even give Swepson the next Test match. \"You never like to see Test matches used as trial games, but it will be interesting to see if Mitch Swepson comes into consideration for Australia for the next Test. \"Will they consider maybe playing two seamers, (all-rounder) Cameron Green, Lyon, and Swepson? That might be something depending on the pitch at the SCG.\" It's rare for any Test team to play two specialist spinners in Australia. But Lyon and Swepson turn the ball in different directions, and Taylor says the Aussies must begin blooding a long-term replacement for Lyon. The 34-year-old has taken 411 Test wickets in 103 matches. There was speculation he may be dropped ahead of this Ashes series, given he struggled against India last summer. Swepson, 28, has played 49 first-class games for Queensland and averages 33.76 with the ball. He's been in the Test squad before but has never been given a debut. If Australia was to only play two specialist pacemen it would be an impossible decision for selectors. After Boland's stirring debut he joins Pat Cummins, Mitchell Starc, Josh Hazlewood, Jhye Richardson, and Michael Neser on the list of suitable contenders. Hazlewood remains under an injury cloud, having not played the last two Tests. \"Australia's greatest headache is who are they going to leave out,\" Taylor said. \"The side looks very settled. I think Pat Cummins, the side has really responded to him becoming captain, and that's a great sign for Australia. \"There's certainly an energy in the Australian side that's not in the England side. \"They're filling a few gaps in their line-up. Cameron Green is getting better all the time, although we would like to see him get a really good score at some stage. But he's solidifying himself in that No.6 role.\" For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here!","image_url":"https://vms-network-images-prod.s3-ap-southeast-2.amazonaws.com/2021/12/400906/281221cricketwin.png","source_id":"nine"},{"title":"Ashes 2021, Australia vs England, cricket news, Sydney New Year’s Test: Mitchell Starc ends selection debate, Mitchell Johnson, Scott Boland","link":"https://www.foxsports.com.au/cricket/the-ashes/ashes-2021-australia-vs-england-cricket-news-sydney-new-years-test-mitchell-starc-ends-selection-debate-mitchell-johnson-scott-boland/news-story/81f3a9fee733e4462fdbe950be0142ec","keywords":null,"creator":null,"video_url":null,"description":"There’s nothing like Scott Boland’s Ashes-clinching 6-7 on Test debut, but if it reminded you of anything, it might have been of Mitchell Johnson’s Adelaide Oval massacre in 2013.","content":null,"pubDate":"2021-12-29 19:00:00","full_description":"There’s nothing like Scott Boland’s Ashes-clinching 6-7 on Test debut, but if it reminded you of anything, it might have been of Mitchell Johnson’s Adelaide Oval massacre in 2013. On that day, the firebrand tore through England, at one point taking three wickets in one over on his way to 7-40. The figures remain the best by an Australian at the Ashes this century, and was this week voted by the public as the No.1 moment in the nation’s cricket history . Catch every moment of The Ashes live and ad-break free during play on Kayo. New to Kayo? Try 14-days free now . It’s easy to forget now, but Johnson wasn’t always considered the all-conquering, chief destroyer of an Australian generation. It took that series, particularly that spell, for him to vanquish years of doubt around his spot in the Test team. That’s something that Mitchell Starc knows a bit about as he enjoys not so much a breakout series, but more a reaffirming of his outstanding potential and value to the Australian Test team. It’s easy to miss in the stupor of Boland’s dreamlike spell at the MCG, but Starc is having his own Johnson moment. The similarities between Johnson and Starc in the second half of their Test careers are numerous. Prior to the Adelaide Test, Johnson had played in just four matches in two years and was snubbed from Australia’s squad that lost 3-0 in the UK in the middle of 2013. Just months later, he was securing his legacy as one of Australia’s all-time great Test quicks, drawing comparisons to Jeff Thomson and Dennis Lillee. Those are comparisons that Starc – with 269 Test wickets at 27.15 - is yet to attract with any genuine confidence or consistency. READ MORE Why Aussie summer of debuts could get bigger as Warne backs shock Test pick Poms ‘shuffling chairs’ won’t help anything — there’s only one fix: Vaughan’s Verdict ‘What’s the point of this team?’: England ‘got what it deserved’ for ‘most miserable’ Ashes thrashing 'Build him a statue!' - Boland takes 6/7 | 02:30 Like Johnson, Starc’s golden 2021-22 summer followed a difficult two-year period which involved a snubbing overseas, where he was picked to play in just one Test of the 2019 Ashes. His confidence was thought to be sinking and his threat waning, culminating with just 11 wickets at 40.72 in four Tests against India last summer. Not even a month ago was Starc still feeling the heat having produced figures of 0-60 in the T20 World Cup final, which set a record for the most expensive bowled by an Australian in the format on the international stage. Suddenly, Starc is on track to be named the Ashes player-of-the-series having enjoyed a sensational return to form with 14 wickets at 19.64 across the first three Tests. He hasn’t reached the heights of Johnson in 2013-14, but the 2021-22 Ashes should not only end speculation around his position, but see him finally handed the recognition he deserves. Only five fast bowlers have ever taken more wickets for Australia than Starc, while only Glenn McGrath and Lillee have done so at a better average. Of those to have taken more than 100 Test wickets for Australia, only Pat Cummins’ strike rate (46.4) is better than Starc’s 48.9. Added to Starc’s CV on Tuesday was a third Ashes triumph to go along with the 50-over World Cup in 2015, and the T20 World Cup in November. England's EMBARRASSING day 3 collapse | 01:36 ‘ABSOLUTELY ABSURD’ Despite his credentials, Starc has been the target of repeated calls for his Test axing with some corners of the media growing impatient after a quiet 2020-21 summer. Firmly on the other side of the fence, has been Australia fast bowling legend Brett Lee. Lee has long been one of Starc’s most vocal supporters, who has been confounded by how quickly the criticism of Starc has mounted in recent years. Speaking to foxsports.com.au on Wednesday, one day after Starc’s incisive second innings spell set-up the spectacular England collapse to Boland, Lee called for the disquiet around his position to end once and for all. “For his name to be consistently thrown about like, ‘he should be dropped’ or ‘he shouldn’t be in the team’ I just find it ludicrous,” Lee said. “Absolutely absurd.” “He’s always the first to be thrown under the bus. “You don’t take over 250 Test wickets by fluking it. It’s hard work, dedication and sacrifice. He’s been around the team a long time now, he’s an experienced player.” Lee added: “He’s proven to everyone he’s good enough. So let the guy bowl. Let him enjoy his career and stop throwing his head on the chopping block.” Starc took just one ball – the very first of the entire series – to send a reminder of why he’s so highly valued by both Lee and national selectors. It should be noted that selectors have rarely given even an inkling that they were prepared to drop Starc, who has played in each of Australia’s past 12 Tests dating back to September 2019. Nonetheless, there was mounting speculation that Western Australia 25-year-old Jhye Richardson was only narrowly held off by Starc for a spot in the first Test at the Gabba. Starc proceeded to steam in with the new rock and swung the ball around a collapsing Rory Burns’ legs with the first ball of the series. The moment was Johnson-like in its jarring nature, and in how England has looked hopelessly inferior ever since. Starc only took two more wickets for the Test, but was sensational in Adelaide and Melbourne when he was thrust into a de facto leadership role in the absences of Cummins and Josh Hazlewood. Mitchell Starc has been back to his best. Source: AFP Neither were available for the day-night Test in Adelaide, where Starc showed why he’s underrated as a leader with his 4-37, which included a wicket in the innings’ third over, and that of the troubling Dawid Malan for 80. In the second innings, he accounted for England’s best player, Joe Root, and Ollie Pope to take 2-43 in the 275-run win. Adam Gilchrist noted at the time that unlike last summer, when Starc was dealing with the personal toll of his father’s death, the 31-year-old looked at peace. “In the little interviews that we’ve had with Mitch and watching him, he hasn’t been so down on himself if a ball hasn’t gone in the right area or if they’ve scored a few runs in a few overs off him,” Gilchrist told foxsports.com.au at the time. “He hasn’t got down and dropped his body language. “He just seems much more calm and relaxed and enjoying everything. It may not be the case but it’s an observation that I’ve noticed from my point of view.” THE ‘X-FACTOR’ Starc returned to haunt Root in Melbourne in the first innings as he registered another two wickets – but his best work all series has been his most recent. Which takes us back to that Boland spell; a scarcely believable four overs that defied our understanding of what was possible for a bowler on Test debut, much less in an Ashes series. From purely a cricketing perspective, however, Starc’s spell was arguably just as significant. It was Starc who took the first two wickets in two balls late on day two in one of the most ferocious new ball spells seen at the Ashes. According to CricViz’s ‘Expected Wickets’ model, his new ball partnership with Cummins was the best on records that date back to 2006. The only criticism of Starc’s hat-trick ball to Root was that it was too good, cutting too far off the seam to narrowly miss the outside edge. On Tuesday, England pinned its hopes on Root and Ben Stokes to take the match deeper and set Australia a total to chase. Starc crushed those hopes in an instant with a near-unplayable nip-backer that breached Stokes’ defence and took his middle peg. He finished the innings with 3-29 as Boland stole the show. Starc and Scott Boland after the Boxing Day Test. Source: Getty Images Starc is fundamentally a different bowler to Lee, but like the 76-Test great, he has raw speed and possesses an X-factor that few have. For Lee, it’s that ability to take a wicket on any given ball that should make him un-droppable in the Test arena. “He was on the chopping block - which I didn’t agree with - and I know personally what Mitchell Starc can bring to the team with his raw pace, his swing, the ability to crack open an innings,” Lee said. “We all witnessed that with the first ball of the summer. So that’s why I was very vocal about him being one of the first picked in the side very time. “He’s got that X-factor, he’s a matchwinner. He’s different to bowling your typical line and length. There are guys who tend to do that, but he’s a pure wicket-taker, which is why I’d pick him every single time.” Now the only thing that could make Starc sit out a Test is if he’s rested, which he may be for the Sydney Test with the job done. Either way, Starc has well and truly proved his doubters wrong in what will go down as the series that defines the latter stages of his career, and proves why he’s a genuine Australia great.","image_url":null,"source_id":"foxsports"},{"title":"How Kohli, Rahane, and Pujara contrived to get out again - The Indian Express","link":"https://news.google.com/__i/rss/rd/articles/CBMicGh0dHBzOi8vaW5kaWFuZXhwcmVzcy5jb20vYXJ0aWNsZS9zcG9ydHMvY3JpY2tldC9ob3cta29obGktcmFoYW5lLWFuZC1wdWphcmEtY29udHJpdmVkLXRvLWdldC1vdXQtYWdhaW4tNzY5NzE4Ny_SAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"How Kohli, Rahane, and Pujara contrived to get out again  The Indian ExpressLIVE IND vs SA Live Cricket Score 1st Test, Day 4 Live Match Today Updates: Elgar, Van Der Dussen Lead South  India.comHow The World Reacted To India Pacer Mohammed Shami's 200 Test Wickets  NDTVSports.com'Cover drive barbad kar degi': How Twitterati slammed Virat Kohli for throwing away his wicket again  DNA IndiaIn Pics: Gritty South Africa stay in the fight against India in first Test  Times of IndiaView Full coverage on Google News","content":null,"pubDate":"2021-12-29 18:52:06","image_url":null,"source_id":"google"},{"title":"Cricket-India backing Kohli to get out of his rut","link":"https://www.thestar.com.my/sport/cricket/2021/12/30/cricket-india-backing-kohli-to-get-out-of-his-rut","keywords":null,"creator":null,"video_url":null,"description":"PRETORIA (Reuters) - India batting coach Vikram Rathour has backed out-of-form captain Virat Kohli after another failure in the first test against South Africa at Centurion Park, but says he needs to be more cautious with his shot selection. Read full story","content":null,"pubDate":"2021-12-29 18:14:00","full_description":"PRETORIA (Reuters) - India batting coach Vikram Rathour has backed out-of-form captain Virat Kohli after another failure in the first test against South Africa at Centurion Park, but says he needs to be more cautious with his shot selection. Kohli, one of the finest batsmen to play the game, completed a miserable 24 months on Wednesday that has brought him only 652 runs in 14 tests at an average of 26.08, almost half his career average before this test of 50.65. He chased a wide delivery from South African seamer Marco Jansen in the second innings and was caught by wicketkeeper Quinton de Kock for 18, an ambitious stroke the first ball after lunch. It was also a carbon copy of his wild drive in the first innings when he was caught at slip for 35, again playing a loose stroke well away from his body. \"It is a shot that brings him lots of runs, it is his scoring shot,\" Rathour told reporters on Wednesday. \"It is always your strength that turns out to be your weakness as well. \"When to play that shot, that is the part where we can have discussions. Was it the right ball, was it the right time to play that shot? If we can just tighten up our game-plans a little more it would be better. \"But that is the shot he plays well and which gets him lots of runs, so he has to carry on playing it. But he needs to maybe pick better balls at times.\" Rathour also defended batsmen Cheteshwar Pujara (0 & 16) and Ajinkya Rahane (48 & 20), whose positions had been in the spotlight going into the test. \"They are trying their best. Rahane has looked in really good touch this game, it is just unfortunate that he got out. Pujara has played some really important innings for us (in the past). \"We need to be patient. As long as they are trying their best, then everything is fine. These are challenging conditions, not many people have scored runs (in this game).\" South Africa are 94 for four going into the fifth day chasing a venue record 305 for victory on a spicy wicket that has movement and variable bounce. (Reporting by Nick Said, editing by Pritha Sarkar)","image_url":"https://apicms.thestar.com.my/uploads/images/2021/12/30/1424795.jpg","source_id":"thestar_my"},{"title":"The Ashes dissected: where are all the England Test batsmen? - The Times","link":"https://news.google.com/__i/rss/rd/articles/CBMiZ2h0dHBzOi8vd3d3LnRoZXRpbWVzLmNvLnVrL2FydGljbGUvdGhlLWFzaGVzLWRpc3NlY3RlZC13aGVyZS1hcmUtYWxsLXRoZS1lbmdsYW5kLXRlc3QtYmF0c21lbi1nY3ZtdmtremfSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"The Ashes dissected: where are all the England Test batsmen?  The TimesEnglish cricket is in disarray – and it’s a metaphor for the whole country  The GuardianLetters: It is not the players but the ECB that's to blame for the pitiful Ashes defeat in Australia  Telegraph.co.ukThe Ashes: Ricky Ponting labels England the worst-performing team to have toured Australia  Sky SportsRicky Ponting damns England as worst performing team to tour Australia  The GuardianView Full coverage on Google News","content":null,"pubDate":"2021-12-29 17:00:00","image_url":null,"source_id":"google"},{"title":"English cricket is in disarray – and it’s a metaphor for the whole country","link":"https://ca.sports.yahoo.com/news/english-cricket-disarray-metaphor-whole-164812217.html?src=rss","keywords":null,"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2021-12-29 16:48:12","image_url":null,"source_id":"yahoo"},{"title":"BBL leading run scorer 2021: Who has scored most runs in Big Bash League 11?","link":"https://thesportsrush.com/cricket-news-bbl-leading-run-scorer-2021-who-has-scored-most-runs-in-big-bash-league-11/","keywords":["Cricket","BBL 2021-22"],"creator":["Gurpreet Singh"],"video_url":null,"description":"BBL leading run scorer 2021: With 7 scores of over 200 so far in BBL 2021-22, the batters have dominated the marquee tournament so far. The Big Bash League 2021-22 is up and running and has almost scampered through to the midway stage. To briefly brush it up, the ongoing 11th edition of the tournament… The post BBL leading run scorer 2021: Who has scored most runs in Big Bash League 11? appeared first on The SportsRush.","content":"BBL leading run scorer 2021: With 7 scores of over 200 so far in BBL 2021-22, the batters have dominated the marquee tournament so far. The Big Bash League 2021-22 is up and running and has almost scampered through to the midway stage. To briefly brush it up, the ongoing 11th edition of the tournament is currently underway with 8 franchises battling it out shoulder-to-shoulder against each other two times around across a total of 60 matches. It was a double header event on Wednesday, when the Sydney Sixers were up against Brisbane Heat at the Sydney Cricket Ground in match no.25 earlier in the day. Later in the day, during match no. 26 at the Docklands Stadium in Melbourne, the Brisbane Heat were up against the Melbourne Renegades. The Sydney Sixers won an absolute humdinger of a low-scoring thriller earlier in the day, as they chased down the target of 106 runs in the final delivery of the game to prevail by 2 wickets. The following match was yet another visual delight for the fans, as Hobart Hurricanes’ batter Ben McDermott smashed his second consecutive century in the ongoing tournament. His innings (127 off 65 deliveries) single-handedly drove the Hurricanes home as they defeated the Renegades by 85 runs after posting 206-5 in their 20 Overs. BBL leading run scorer 2021 Ben McDermott’s century on Wednesday, was his second consecutive this season and his third overall in Big Bash League history. With his knock against the Renegades, the 27-year-old has become the only batter to cross the 100-run mark thrice in the Big Bash League. A couple of days earlier, McDermott had smashed a 60-ball 110 with the assistance of 12 Fours and 5 gigantic maximums against the Adelaide Strikers to hit his first ton of the season. ALSO READ: Highest individual BBL scores list. With a couple of centuries and a fifty (against Melbourne Stars) already in the ongoing BBL season, McDermott is comfortably placed at the top of the leading run-scorers list after the completion of 26 league games in the league so far. He has accumulated a total of 353 runs in 5 innings at a jaw-dropping average of 88.25, while striking at 170.53 per 100 deliveries. At the second spot, is Sydney Sixer’s Josh Phillipe, who has amassed a total of 295 runs across 7 innings so far at an average of 49.16. S.NO. PLAYER TEAM MAT INN RUNS AVG. SR 4S 6s 1 BR McDermott Hobart Hurricanes 5 5 353 88.25 170.53 28 21 2 JR Philippe Sydney Sixers 7 7 295 49.17 149.75 26 10 3 C Munro Perth Scorchers 7 7 268 67.00 142.55 21 9 4 Moises Henriques Sydney Sixers 7 7 257 51.40 146.02 20 10 5 MR Marsh Perth Scorchers 5 5 255 85.00 144.07 15 12   The post BBL leading run scorer 2021: Who has scored most runs in Big Bash League 11? appeared first on The SportsRush.","pubDate":"2021-12-29 16:45:49","full_description":null,"image_url":null,"source_id":"thesportsrush"},{"title":"Weather report SuperSport Park Centurion: What is the weather prediction for IND vs SA Day 5 tomorrow?","link":"https://thesportsrush.com/cricket-news-weather-report-supersport-park-centurion-what-is-the-weather-prediction-for-ind-vs-sa-day-5-tomorrow/","keywords":["Cricket","India","India tour of South Africa 2021-22","South Africa"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Weather report SuperSport Park: The SportsRush presents for you the detailed weather prediction for Day 5 of SA vs IND Centurion Test. India fast bowler Jasprit Bumrah’s dual-wicket spell right before the end of play on Day 4 has helped his team in gaining a substantial advantage in the first Test of the ongoing tour… The post Weather report SuperSport Park Centurion: What is the weather prediction for IND vs SA Day 5 tomorrow? appeared first on The SportsRush.","content":"Weather report SuperSport Park: The SportsRush presents for you the detailed weather prediction for Day 5 of SA vs IND Centurion Test. India fast bowler Jasprit Bumrah’s dual-wicket spell right before the end of play on Day 4 has helped his team in gaining a substantial advantage in the first Test of the ongoing tour of South Africa in Centurion. Chasing a 305-run target, a 40-run partnership for the third wicket between South Africa captain Dean Elgar (52*) and batter Rassie van der Dussen (8) had appeared the provide stability to their innings. However, Bumrah’s final burst saw him dismissing van der Dussen and nightwatchman Keshav Maharaj (8) in quick succession. In fact, Maharaj’s dismissal ended up becoming the last delivery of the day. South Africa, who need 211 more runs to win the match, have six wickets in hands on what should be an enthralling day of Test cricket. Jasprit Bumrah,,,,,game changer! — Ian Raphael Bishop (@irbishi) December 29, 2021 Weather report SuperSport Park Centurion Anyone who has followed this match must have heard how the weather has it in it to play a spoilsport tomorrow. For starters, December 30 will primarily be a cloudy day in Centurion which is likely to witness rainfall and thunderstorms. According to AccuWeather, there’s around a 20% rain probability for the first session on Thursday. It is in the post-lunch session that the rain probability will increase to as much as 51% in the presence of thunderstorms. ALSO READ: What is the highest fourth innings run-chase at the SuperSport Park? As far as the evening session is concerned, SuperSport Park is predicted to experience a steep fall in temperature with the rain probability expected to be in vicinity of 50%. With rain quite certain to pour in Centurion on Day 5 until the weather forecast goes terribly wrong, India would want to pick the remaining wickets as soon as possible to avoid seeing rain saving the day for the home team. Centurion hourly weather Thursday 10:00 AM – 23 degree (Mostly Cloudy). 11:00 AM – 25 degree (Mostly Cloudy). 12:00 PM – 26 degree (Mostly Cloudy). 01:00 PM – 27 degree (Mostly Cloudy). 02:00 PM – 25 degree (Thunderstorms). 03:00 PM – 24 degree (Mostly Cloudy). 04:00 PM – 22 degree (Mostly Cloudy). 05:00 PM – 20 degree (Thunderstorms). 06:00 PM – 20 degree (Intermittent Clouds). The post Weather report SuperSport Park Centurion: What is the weather prediction for IND vs SA Day 5 tomorrow? appeared first on The SportsRush.","pubDate":"2021-12-29 16:25:35","full_description":null,"image_url":null,"source_id":"thesportsrush"},{"title":"LIVE IND vs SA Live Cricket Score 1st Test, Day 4 Live Match Today Updates: Elgar, Van Der Dussen Lead South - India.com","link":"https://news.google.com/__i/rss/rd/articles/CBMi7gFodHRwczovL3d3dy5pbmRpYS5jb20vc3BvcnRzL2luZC12cy1zYS1tYXRjaC1oaWdobGlnaHRzLTFzdC10ZXN0LWJveGluZy1kYXk0LXVwZGF0ZXMtaW5kaWEtdnMtc291dGgtYWZyaWNhLXN0cmVhbWluZy1jcmlja2V0LWhvc3Rhci12aWRlby1hcy1pdC1oYXBwZW5lZC1zYS12cy1pbmQtdG9kYXktbWF0Y2gtc3RyZWFtLWppb3R2LWVsZ2FyLWJ1bXJhaC1pbmQtNi13a3RzLXdpbi1zYS1rb2hsaS1zaGFtLTUxNjEwMzQv0gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"LIVE IND vs SA Live Cricket Score 1st Test, Day 4 Live Match Today Updates: Elgar, Van Der Dussen Lead South  India.comS Africa 22-1 at tea in pursuit of 305 for victory over India  ReutersIndia vs South Africa, 1st Test: Brilliant Mohammed Shami swings Test India's way  Times of IndiaLive Cricket Score: South Africa vs India, 1st Test, Day 4, Centurion | Cricbuzz.com - Cricbuzz  CricbuzzView Full coverage on Google News","content":null,"pubDate":"2021-12-29 15:46:30","image_url":null,"source_id":"google"},{"title":"Magical final hour with Starc and Cummins deserves defining memory of Ashes | Geoff Lemon","link":"https://www.theguardian.com/sport/blog/2021/dec/29/magical-final-hour-with-starc-and-cummins-deserves-defining-memory-of-ashes-australia-cricket-england","keywords":["The Ashes","Sport","England cricket team","Australia sport","Australia cricket team","Australia news","Ashes 2021-22","Cricket"],"creator":["Geoff Lemon in Melbourne"],"video_url":null,"description":"This one-sided series will not be remembered as a classic but Australia’s threatening bowling in Melbourne stands outIt is safe to say that the current Ashes series will not be remembered as a classic of the genre. We follow sport for the contest, and the total lack of one is the reason there is so much consternation from wider English cricket quarters, even as the team tries to apply blinkers to get through two more Tests. There have been plenty of one-sided Ashes series, and most teams struggle away from home, but this has been another level.When the tiny trophy has been played for in England in modern times, the contests have been closer. There is 2005, of course, the gold standard, but 2009 was also a 2-1 result that came down to the fifth match. The 3-0 scoreline in 2013 looks skewed, but Australia had two wins rained off on the last day, and came close to winning two other matches. The third and fourth Tests in 2015 were wipeouts for the visitors but they did still make the scoreline 3-2. And the 2019 series was a delightfully absurd carnival ride, with Steve Smith at Edgbaston, Ben Stokes at Headingley and Jofra Archer at Lord’s. Continue reading...","content":null,"pubDate":"2021-12-29 15:25:54","full_description":"I t is safe to say that the current Ashes series will not be remembered as a classic of the genre. We follow sport for the contest, and the total lack of one is the reason there is so much consternation from wider English cricket quarters, even as the team tries to apply blinkers to get through two more Tests. There have been plenty of one-sided Ashes series, and most teams struggle away from home, but this has been another level . When the tiny trophy has been played for in England in modern times, the contests have been closer. There is 2005, of course, the gold standard, but 2009 was also a 2-1 result that came down to the fifth match. The 3-0 scoreline in 2013 looks skewed, but Australia had two wins rained off on the last day, and came close to winning two other matches. The third and fourth Tests in 2015 were wipeouts for the visitors but they did still make the scoreline 3-2. And the 2019 series was a delightfully absurd carnival ride, with Steve Smith at Edgbaston, Ben Stokes at Headingley and Jofra Archer at Lord’s. Australia’s home wins in that period have not been remotely close, but have still had something to recommend them. The 2006/07 whitewash was a champion team roaring back after being stung by defeat. In 2013/14 the thrill of Mitchell Johnson’s lightning summer made another whitewash compelling viewing. Even in 2017/18 we saw Smith operating at the peak of his considerable powers. The current series has had no champion shaping it, just an English team that has failed to compete from the first ball. So in terms of what we’ll remember in years to come, foremost will have to be that final hour of the second day in Melbourne, when Australia had finished collecting a modest lead of 82 runs, then tore England open to the tune of four wickets for 31 runs by stumps. The Melbourne Cricket Ground is a strange beast. In its vastness, it can host 100 people at a Sheffield Shield match and feel like an abandoned city of the future. It can host 20,000 people for a football match and swallow the lot, still feeling empty. The stands are so high, the seats so far back, that during a quiet day of cricket it can sound like little more than a burble. Or it can come to life, stirring like Smaug on top of his gold, and breathe fire. The data analysts at CricViz track a measure of how dangerous certain bowling is, tracking lines and lengths and swing and seam and speed to calculate the average likelihood of that ball taking a wicket. According to them, Mitchell Starc and Pat Cummins jointly bowled the most threatening opening spell since records began. Cummins has a laconic walk to his mark, legs bowed and gait rolling like has just hitched his horse outside. When he turns, he glides in, the whip of his arm and the work of his wrist angling the ball in towards a right-hander before cutting it away from the bat. The movement isn’t much, but that is his comparative strength. Some bowlers spend their careers beating the edge. Cummins takes it. In contrast, Starc bounds in like a cartoon tiger. He is all limbs and leap, even before the delivery stride. Out of this run he slings the ball down from a low release. This can make his line a lottery, his left-arm angle taking the ball either well wide of off stump or down the leg side. In this series he has spent more time close to the off stump, just wide enough to leave but close enough that players keep being drawn into reaching for it. Ten overs, two wickets, and a thick current of adrenaline buzzing through the place. Starc coming within millimetres of a hat-trick, so nearly completing it against the world’s form player in Joe Root. The noise already wild. And then comes Scott Boland , the local player on debut, first forcing England to employ a nightwatchman, then blasting him out in two balls. A player being bowled is cricket’s most visceral spectator experience. From a distant vantage, a catch behind looks no different to the ball beating the edge. A dismissal leg before wicket looks the same as one not given. When crowds cheer those moments they are cheering an extrapolation of what has happened, not what they know themselves. But when the bails fly, they know. The visual explosion mirrors the raising of voices and hands. And there is the sound, that delicious clunk that can be heard in the most distant seat. That was the moment, the way every person in the ground lit up. Jack Leach left the ball, seeing its line, trying to do the right thing. Instead his choice left him standing still with his bat raised high, front foot forward, not interfering with anyone’s view, underlining just how comprehensively he had been done in. Batting for a final hour was always going to be tough, but the hour became series-sealing drama. We may not be replete with great moments in this series, but that one deserves to last.","image_url":"https://i.guim.co.uk/img/media/cd825793574dfe60edc1e482dc3c0dee4a1484fe/459_326_4541_2725/master/4541.jpg?width=460&quality=85&auto=format&fit=max&s=b8f22366c408311a5d3923e901009422","source_id":"theguardian"},{"title":"Sachin Tendulkar’s son Arjun Tendulkar named in Mumbai Ranji squad; Prithvi Shaw to lead","link":"https://zeenews.india.com/cricket/sachin-tendulkar-s-son-arjun-tendulkar-named-in-mumbai-ranji-squad-prithvi-shaw-to-lead-2423759.html","keywords":null,"creator":null,"video_url":null,"description":"Last year, Arjun Tendulkar played a couple of matches for the limited-overs team of Mumbai but is yet to make his debut in red-ball cricket.","content":null,"pubDate":"2021-12-29 15:25:00","full_description":null,"image_url":null,"source_id":"zeenews"},{"title":"BBL Points Table: Which team is leading in Big Bash League 11 ladder?","link":"https://thesportsrush.com/cricket-news-bbl-points-table-which-team-is-leading-in-big-bash-league-11-ladder/","keywords":["Cricket","BBL 2021-22"],"creator":["Gurpreet Singh"],"video_url":null,"description":"BBL Points Table: The battle amongst franchises intensifies as the league almost reaches the halfway stage with grand final on January 28. The Big Bash League 2021-22 is up and running and has almost scampered through to the midway stage. It was a double header event on Wednesday where the Sydney Sixers were up against… The post BBL Points Table: Which team is leading in Big Bash League 11 ladder? appeared first on The SportsRush.","content":"BBL Points Table: The battle amongst franchises intensifies as the league almost reaches the halfway stage with grand final on January 28. The Big Bash League 2021-22 is up and running and has almost scampered through to the midway stage. It was a double header event on Wednesday where the Sydney Sixers were up against Brisbane Heat at the Sydney Cricket Ground earlier in the day. In what turned out to be a low scoring thriller, the home side chased down the target of 106 runs in the final delivery of the game to prevail by 2 wickets. Later in the day, during match no. 26 at the Docklands Stadium in Melbourne, the fans were lucky yet again to witness the Ben McDermott special, who smashed his third century in the marquee league for the Hobart Hurricanes to take his side home by 85 runs against the Melbourne Renegades. A massive victory at Marvel! #BBL11 pic.twitter.com/AElL2XCmEB — KFC Big Bash League (@BBL) December 29, 2021 McDermott’s innings of 127 off mere 65 deliveries comprised if 9 fours and as many maximums to power the Hurricanes’ score to 206-5 after 20 Overs. In reply, the Renegades, despite wicketkeeper-batter Sam Harper’s innings of 57 (35) right at the top, fell short of the target by 85 runs as they got bundled up for mere 121 in 15.5 Overs. BBL Points Table Winning the first game on Wednesday’s double header, the Sydney Sixers have pipped the Perth Scorchers marginally on the Net run-rate count after match no.27 of BBL 2021-22. Having played a total of 7 games each so far, both the Sixers and the Scorchers have won 6 matches each with 21 points respectively under their belt. Sixers (NRR- +1.264) are placed on the top of the ladder at the moment above Scorchers (NRR- +1.188). In fact, the Perth Scorchers were leading the points table until they lost their first game of the tournament on Tuesday against Sydney Thunder by 34 runs. The Melbourne Renegades, on the other hand, are reeling at the bottom of the points table with a solitary win out of 6 matches, garnering mere 5 points so far after match no.26. BBL P W L D NRR Pts 1 Sydney Sixers 7 6 1 0 1.246 21 2 Perth Scorchers 7 6 1 0 1.188 21 3 Hobart Hurricanes 7 4 3 0 0.417 17 4 Sydney Thunder 6 3 3 0 0.442 13 5 Brisbane Heat 7 2 5 0 -0.280 10 6 Melbourne Stars 6 3 3 0 -1.114 10 7 Adelaide Strikers 6 1 5 0 -0.525 7 8 Melbourne Renegades 6 1 5 0 -1.758 5   The post BBL Points Table: Which team is leading in Big Bash League 11 ladder? appeared first on The SportsRush.","pubDate":"2021-12-29 15:20:39","full_description":null,"image_url":null,"source_id":"thesportsrush"},{"title":"IND vs SA 1st Test Day 4 Live Score Updates: India Eye Wickets As Dean Elgar Steadies South Africa Ship - NDTV Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMiowFodHRwczovL3Nwb3J0cy5uZHR2LmNvbS9zb3V0aC1hZnJpY2EtdnMtaW5kaWEtMjAyMS0yMi9pbmRpYS12cy1zb3V0aC1hZnJpY2EtMXN0LXRlc3QtZGF5LTQtbGl2ZS1zY29yZS11cGRhdGVzLWluZC12cy1zYS0xc3QtdGVzdC1pbmRpYS10b3VyLW9mLXNvdXRoLWFmcmljYS0yNjc3MzMz0gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"IND vs SA 1st Test Day 4 Live Score Updates: India Eye Wickets As Dean Elgar Steadies South Africa Ship  NDTV SportsIndia vs South Africa 1st Test Live Score Updates, Day 4: Elgar, van der Dussen steady South Africa after early blows  Times of IndiaHow The World Reacted To India Pacer Mohammed Shami's 200 Test Wickets  NDTVSports.comLIVE IND vs SA Live Cricket Score 1st Test, Day 4 Live Match Today Updates: Elgar, Van Der Dussen Lead South  India.com'India Will Be Bowled Out': Ex-India Opener's Bold Prediction Ahead of 'Exciting' Day 4  News18View Full coverage on Google News","content":null,"pubDate":"2021-12-29 15:12:04","image_url":null,"source_id":"google"},{"title":"LIVE IND vs SA Live Cricket Score 1st Test, Day 4 Live Match Today Updates: Siraj, Shami Strike to Spoil Sout - India.com","link":"https://news.google.com/__i/rss/rd/articles/CBMi7gFodHRwczovL3d3dy5pbmRpYS5jb20vc3BvcnRzL2luZC12cy1zYS1saXZlLWNyaWNrZXQtc2NvcmUtMXN0LXRlc3QtYm94aW5nLWRheTQtdXBkYXRlcy1pbmRpYS12cy1zb3V0aC1hZnJpY2EtbGl2ZS1zdHJlYW1pbmctY3JpY2tldC1ob3N0YXItdmlkZW8tYmFsbC1ieS1iYWxsLWNvbW1lbnRhcnktc2EtdnMtaW5kLWxpdmUtbWF0Y2gtc3RyZWFtLWppb3R2LXNoYW1pLXNpcmFqLWJ1bXJhaC1lbGdhci1rLTUxNjEwMzQv0gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"LIVE IND vs SA Live Cricket Score 1st Test, Day 4 Live Match Today Updates: Siraj, Shami Strike to Spoil Sout  India.comS Africa 22-1 at tea in pursuit of 305 for victory over India  ReutersIndia vs South Africa 1st Test Live Score Updates, Day 4: Siraj scalps Petersen, South Africa in trouble  Times of IndiaHow The World Reacted To India Pacer Mohammed Shami's 200 Test Wickets  NDTVSports.com'India Will Be Bowled Out': Ex-India Opener's Bold Prediction Ahead of 'Exciting' Day 4  News18View Full coverage on Google News","content":null,"pubDate":"2021-12-29 14:29:32","image_url":null,"source_id":"google"}]}