{"newsArray":[{"title":"IPL 2022 | ‘We played stupid cricket with the bat,’ says Lucknow captain KL Rahul","link":"https://www.thehindu.com/sport/cricket/ipl-2022-we-played-stupid-cricket-with-the-bat-says-lucknow-captain-kl-rahul/article65369371.ece","keywords":null,"creator":["\n        PTI  \n    "],"video_url":null,"description":"LSG managed 153 for 8 before their bowlers rallied to restrict Punjab Kings to 133 for 8","content":null,"pubDate":"2022-04-29 22:41:32","full_description":"Quinton De Kock and Deepak Hooda of Lucknow Super Giants had a steady partnership before wickets fell quickly | Photo Credit: PTI \"We played stupid cricket with the bat,\" said Lucknow Super Giants skipper KL Rahul after eking out a 20-run win over Punjab Kings in a low-scoring IPL game. LSG managed 153 for 8 before their bowlers rallied to restrict Punjab to 133 for eight. \"I was disappointed and fuming at the end of the first innings. Stupid cricket with the bat,\" Rahul said at the post match presentation. \"We need to get better with the bat. Half-time, when Quinny (de Kock) and Deepak (Hooda) were batting. They paced it really really well to get to 60 in 9 overs on a tricky wicket. Had we batted smartly, we could have gotten to 180-190. \"I think we just need to be smarter in reading the game. If we could have not played too many shots we could have done better. We have been good on the field and good with the ball. Just need to keep repeating the good things.\" After an underwhelming show with the bat, LSG bowlers put up a spirited display as pacer Dushmantha Chameera (2/17) and Krunal Pandya (2/11) grabbed two wickets each. \"The way we responded with the ball was phenomenal. Krunal has been brilliant throughout the tournament. This season he has really worked on his bowling. Bowling economically is important but he has been giving us two, three wickets in the middle overs,\" Rahul added. Meanwhile, a disappointed Punjab Kings skipper Mayank Agarwal rued the dismal batting effort. \"I think we just kept losing wickets. We had batsmen who were set and we kept getting out. So many soft dismissals for us. It is disappointing and we have to face the truth. We didn't bat well enough and we were below par with the bat.\" Our code of editorial values Printable version | Apr 30, 2022 4:14:03 am | https://www.thehindu.com/sport/cricket/ipl-2022-we-played-stupid-cricket-with-the-bat-says-lucknow-captain-kl-rahul/article65369371.ece © THG PUBLISHING PVT LTD.","image_url":null,"source_id":"thehindu","country":["india"],"category":["sports"],"language":"english"},{"title":"Faf du Plessis vs Rashid Khan IPL record: Rashid Khan vs RCB record and Faf du Plessis at Brabourne Stadium stats","link":"https://thesportsrush.com/cricket-news-faf-du-plessis-vs-rashid-khan-ipl-record-rashid-khan-vs-rcb-record-and-faf-du-plessis-at-brabourne-stadium-stats/","keywords":["Cricket","Gujarat Titans","IPL 2022","RCB","Faf Du Plessis","GT","Indian Premier League","rashid khan","Royal Challengers Bangalore"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Faf du Plessis vs Rashid Khan: The captain of Royal Challengers Bangalore and vice-captain of Gujarat Titans will be locking horns for the seventh time in T20s. The first-ever Indian Premier League match between Gujarat Titans and Royal Challengers Bangalore will be played at the Brabourne Stadium on the eighth double-header day of the ongoing… The post Faf du Plessis vs Rashid Khan IPL record: Rashid Khan vs RCB record and Faf du Plessis at Brabourne Stadium stats appeared first on The SportsRush.","content":"Faf du Plessis vs Rashid Khan: The captain of Royal Challengers Bangalore and vice-captain of Gujarat Titans will be locking horns for the seventh time in T20s. The first-ever Indian Premier League match between Gujarat Titans and Royal Challengers Bangalore will be played at the Brabourne Stadium on the eighth double-header day of the ongoing 15th season of the tournament today. Playing their maiden season of the biggest T20 league across the globe, Titans are currently at the top of the points table on the back of seven wins in eight matches. Royal Challengers, on the contrary, are at the fifth position after winning five and losing four out of their nine matches this season. Faf du Plessis vs Rashid Khan IPL record Gujarat vice-captain Rashid Khan and Bangalore captain Faf du Plessis will hog the limelight in this afternoon clash. In what will be their seventh encounter against each other in T20s, Rashid would look to continue his domination over du Plessis in this format. Readers must note that all du Plessis has scored against Rashid is 22 (34) with the help of a solitary four which includes a couple of dismissals. Rashid, who has played 10 matches against RCB across five seasons, has picked 11 wickets at an average of 27, an economy rate of 7.43 and a strike rate of 21.82. In what will only be Rashid’s second T20 at the Cricket Club of India, he had picked bowling figures of 4-0-22-3 against Punjab Kings at this venue earlier this season. This is what the #TataIPL is all about, you fight till the end! @rahultewatia02 I am glad we could get those runs together partner! #GTvSRH #AavaDe #TataIPL2022 pic.twitter.com/DzhwHwysmv — Rashid Khan (@rashidkhan_19) April 27, 2022 As far as du Plessis is concerned, he doesn’t have much to take confidence from as far as his past record at the Brabourne Stadium is concerned. du Plessis’ 40 runs across a couple of innings here have come at a strike rate of 148.15. The post Faf du Plessis vs Rashid Khan IPL record: Rashid Khan vs RCB record and Faf du Plessis at Brabourne Stadium stats appeared first on The SportsRush.","pubDate":"2022-04-29 20:12:21","full_description":"Faf du Plessis vs Rashid Khan: The captain of Royal Challengers Bangalore and vice-captain of Gujarat Titans will be locking horns for the seventh time in T20s. The first-ever Indian Premier League match between Gujarat Titans and Royal Challengers Bangalore will be played at the Brabourne Stadium on the eighth double-header day of the ongoing 15th season of the tournament today. Playing their maiden season of the biggest T20 league across the globe, Titans are currently at the top of the points table on the back of seven wins in eight matches. Royal Challengers, on the contrary, are at the fifth position after winning five and losing four out of their nine matches this season. Gujarat vice-captain Rashid Khan and Bangalore captain Faf du Plessis will hog the limelight in this afternoon clash. In what will be their seventh encounter against each other in T20s, Rashid would look to continue his domination over du Plessis in this format. Readers must note that all du Plessis has scored against Rashid is 22 (34) with the help of a solitary four which includes a couple of dismissals. Rashid, who has played 10 matches against RCB across five seasons, has picked 11 wickets at an average of 27, an economy rate of 7.43 and a strike rate of 21.82. In what will only be Rashid’s second T20 at the Cricket Club of India, he had picked bowling figures of 4-0-22-3 against Punjab Kings at this venue earlier this season. This is what the #TataIPL is all about, you fight till the end! @rahultewatia02 I am glad we could get those runs together partner! 💪 #GTvSRH #AavaDe #TataIPL2022 pic.twitter.com/DzhwHwysmv — Rashid Khan (@rashidkhan_19) April 27, 2022 As far as du Plessis is concerned, he doesn’t have much to take confidence from as far as his past record at the Brabourne Stadium is concerned. du Plessis’ 40 runs across a couple of innings here have come at a strike rate of 148.15.","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"“Stupid Cricket with the bat”: KL Rahul expresses disappointment over LSG batting performance despite 20-run win vs Punjab Kings in IPL 2022","link":"https://thesportsrush.com/cricket-news-stupid-cricket-with-the-bat-kl-rahul-expresses-disappointment-over-lsg-batting-performance-despite-20-run-win-vs-punjab-kings-in-ipl-2022/","keywords":["Cricket","IPL 2022","Lucknow Super Giants","Indian Premier League","IPL","KL Rahul","LSG"],"creator":["Gurpreet Singh"],"video_url":null,"description":"KL Rahul expresses disappointment over LSG’s lackluster performance with the bat after being put into bat first against PBKS in IPL 2022. During the 42nd match of the ongoing 15th season of the Indian Premier League at the MCA Stadium in Pune, the Lucknow Super Giants (LSG), continuing with their impressive all-round performance in their… The post “Stupid Cricket with the bat”: KL Rahul expresses disappointment over LSG batting performance despite 20-run win vs Punjab Kings in IPL 2022 appeared first on The SportsRush.","content":"KL Rahul expresses disappointment over LSG’s lackluster performance with the bat after being put into bat first against PBKS in IPL 2022. During the 42nd match of the ongoing 15th season of the Indian Premier League at the MCA Stadium in Pune, the Lucknow Super Giants (LSG), continuing with their impressive all-round performance in their debut IPL season, defeated the Punjab Kings (PBKS) by 20 runs. Having posted a modest total of 153/8 in their 20 Overs, on a pitch that was a tad challenging to bat on, the LSG bowlers came back beautifully during the middle Overs of the Punjab chase, to restrict the PBKS batters to a paltry 133/8 in their 20 Overs. Krunal Pandya, for his impressive bowling figures of 4-1-11-2, including a wicket-maiden during the 14th Over, was adjudged the ‘Player of the match’. Chalo chalo chalo, Lucknow! Behtareen pradarshan! LSG 153/8 PBKS 133/8 Lucknow Super Giants won by 20 runs #AbApniBaariHai #IPL2022 #LSGvsPBKS pic.twitter.com/NvRJjBowxz — Lucknow Super Giants (@LucknowIPL) April 29, 2022 KL Rahul expresses disappointment over LSG’s batting performance Earlier, despite losing their skipper KL Rahul (6 off 11) in the 3rd Over of the match, the LSG stitched a solid 85-run partnership for the 2nd wicket between Deepak Hooda (34 off 28) and Quinton de Kock (46 off 37) to come back into the contest. However, post losing de Kock in the 13th Over, the rest of the batters fell like ninepins as the scorecard, from 98/1, read 111/6 in no time. A few crucial hits from the lower order, meant that KL Rahul’s men huffed and puffed to 153/8 to provide their bowlers a decent enough cushion on a sluggish track. Post the victory, KL Rahul, despite a comfortable victory in the end, revealed that he was ‘disappointed and fuming’ after the end of the innings despite acknowledging that it wasn’t an ideal pitch to post a huge total on. “I was disappointed and fuming at the end of the first innings. Stupid cricket with the bat. It does happen but we did talk about it at the time-out. We did talk that we can defend 160 as this wasn’t a great pitch. The crucial runs at the back end and then the execution with the ball helped us win. We need to get better with the bat,” exclaimed Rahul during the post-match presentation. With 6 wins out of 9 matches, LSG are now placed at the third spot in the points table. The post “Stupid Cricket with the bat”: KL Rahul expresses disappointment over LSG batting performance despite 20-run win vs Punjab Kings in IPL 2022 appeared first on The SportsRush.","pubDate":"2022-04-29 18:54:37","full_description":"KL Rahul expresses disappointment over LSG’s lackluster performance with the bat after being put into bat first against PBKS in IPL 2022. During the 42nd match of the ongoing 15th season of the Indian Premier League at the MCA Stadium in Pune, the Lucknow Super Giants (LSG), continuing with their impressive all-round performance in their debut IPL season, defeated the Punjab Kings (PBKS) by 20 runs. Having posted a modest total of 153/8 in their 20 Overs, on a pitch that was a tad challenging to bat on, the LSG bowlers came back beautifully during the middle Overs of the Punjab chase, to restrict the PBKS batters to a paltry 133/8 in their 20 Overs. Krunal Pandya, for his impressive bowling figures of 4-1-11-2, including a wicket-maiden during the 14th Over, was adjudged the ‘Player of the match’. Chalo chalo chalo, Lucknow! Behtareen pradarshan! 💙💙 LSG 153/8 PBKS 133/8 Lucknow Super Giants won by 20 runs 🎉🥳 #AbApniBaariHai #IPL2022 #LSGvsPBKS pic.twitter.com/NvRJjBowxz — Lucknow Super Giants (@LucknowIPL) April 29, 2022 Earlier, despite losing their skipper KL Rahul (6 off 11) in the 3rd Over of the match, the LSG stitched a solid 85-run partnership for the 2nd wicket between Deepak Hooda (34 off 28) and Quinton de Kock (46 off 37) to come back into the contest. However, post losing de Kock in the 13th Over, the rest of the batters fell like ninepins as the scorecard, from 98/1, read 111/6 in no time. A few crucial hits from the lower order, meant that KL Rahul’s men huffed and puffed to 153/8 to provide their bowlers a decent enough cushion on a sluggish track. Post the victory, KL Rahul, despite a comfortable victory in the end, revealed that he was ‘disappointed and fuming’ after the end of the innings despite acknowledging that it wasn’t an ideal pitch to post a huge total on. “I was disappointed and fuming at the end of the first innings. Stupid cricket with the bat. It does happen but we did talk about it at the time-out. We did talk that we can defend 160 as this wasn’t a great pitch. The crucial runs at the back end and then the execution with the ball helped us win. We need to get better with the bat,” exclaimed Rahul during the post-match presentation. With 6 wins out of 9 matches, LSG are now placed at the third spot in the points table .","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Happy Birthday Rohit Sharma Birthday wishes: Best Birthday wishes for Rohit Sharma","link":"https://thesportsrush.com/cricket-news-happy-birthday-rohit-sharma-birthday-wishes-best-birthday-wishes-for-rohit-sharma/","keywords":["Cricket","IPL 2022","Mumbai Indians","India","Indian Premier League","MI","Rohit Sharma"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Rohit Sharma Birthday wishes: The Indian captain started to receive heartfelt wishes from midnight on his 35th birthday. India and Mumbai Indians captain Rohit Sharma has turned 35 today. While former South Africa all-rounder Chris Morris was also born on the same day in 1987, Sharma also shares his birthday with former Australia wicket-keeper batter… The post Happy Birthday Rohit Sharma Birthday wishes: Best Birthday wishes for Rohit Sharma appeared first on The SportsRush.","content":"Rohit Sharma Birthday wishes: The Indian captain started to receive heartfelt wishes from midnight on his 35th birthday. India and Mumbai Indians captain Rohit Sharma has turned 35 today. While former South Africa all-rounder Chris Morris was also born on the same day in 1987, Sharma also shares his birthday with former Australia wicket-keeper batter Ian Healy (58) among notable cricketers. Sharma, who enjoys a loyal fan-base like other Indian cricketers of his stature, had started to receive heartfelt birthday wishes even before midnight. Currently playing in the ongoing 15th season of the Indian Premier League, Sharma is amid a terrible patch both as a captain and as a batter. While Mumbai have lost eight matches on the trot, Sharma has managed to score just 153 runs at an average and strike rate of 19.12 and 126.44 respectively. In such a rare but dreadful phase, it isn’t a surprise as to why Sharma’s bountiful fans seem eager to post morale-boosting birthday wishes for him across social media platforms. Readers must note that Sharma is scheduled to face Rajasthan Royals at the Dr DY Patil Sports Academy tonight. Hence, his fans would be hoping for him to return to form on his 35th birthday. It is worth mentioning that this will be only the third time (after 2009 and 2014) when Sharma will be playing an IPL match on his birthday. In the previous two instances against Deccan Chargers and Sunrisers Hyderabad, Sharma had scored 17 (20) and 1 (5) respectively (both in losing causes). Rohit Sharma Birthday wishes 30th April bole toh आपल्या रोहित चा बर्थडे! पलटन, मग होऊ द्या की replies मध्ये सेलिब्रेशन! #OneFamily #DilKholKe #MumbaiIndians @ImRo45 pic.twitter.com/iPbA9dFJDH — Mumbai Indians (@mipaltan) April 29, 2022 Happy Birthday @ImRo45 – one of the greats in this generation, dominating white-ball format as an opener, showed his determination and skill in longer format, 5 hundreds in 2019 ODI World Cup, 5 time IPL winning captain, Asia Cup winning captain. #HappyBirthdayRohit pic.twitter.com/L70OhcPC0S — Johns. (@CricCrazyJohns) April 29, 2022 Happy Birthday to the Greatest opener of all time. To the most successful and best captain of IPL. To the guy who was told that he can’t play test, and became highest ranked indian test Batsman and captain of the team. To the guy who never GAVE UP. @ImRo45 #HappyBirthdayRohit pic.twitter.com/z5DNDJJ5YF — ANSHUMAN (@AvengerReturns) April 29, 2022 Hey @ImRo45 , Happy Birthday Champ You have no idea how special you are for me and for all of your fans You make us happy ,you make us proud .You inspire us every single day . Words can’t describe what you mean to us but still We are always Proud of you #HappyBirthdayRohit pic.twitter.com/icVALUWsRi — RG (@_dark_crusadeer) April 29, 2022 Rohit Sharma Only in history of cricket:- •3+ Tons in all three formats. •3 Double ton in ODIs. •4 Hundreds in T20Is. •5 IPL Titles as captain. •2 T20I Ton as captain •Most Tons in ODI WC & single WC edition. •Hundreds in all formats in a single tour.#HappyBirthdayRohit pic.twitter.com/v2jLtH78g3 — CricketMAN2 (@ImTanujSingh) April 29, 2022 Happy Birthday Captain @ImRo45 Forever grateful for your contribution to Mumbai Indians franchise. I believe in Rohit Sharma supremacy always and forever. #HappyBirthdayRohit pic.twitter.com/L6MF5Xg5x3 — R A T N I S H (@LoyalSachinFan) April 29, 2022 While Sharma has scored 613 runs in 26 innings at an average and strike rate of 23.58 and 129.05 respectively against Rajasthan in the past, his record in Navi Mumbai T20s (82 runs in seven innings at 11.71) is quite disappointing. The post Happy Birthday Rohit Sharma Birthday wishes: Best Birthday wishes for Rohit Sharma appeared first on The SportsRush.","pubDate":"2022-04-29 18:44:38","full_description":"Rohit Sharma Birthday wishes: The Indian captain started to receive heartfelt wishes from midnight on his 35th birthday. India and Mumbai Indians captain Rohit Sharma has turned 35 today. While former South Africa all-rounder Chris Morris was also born on the same day in 1987, Sharma also shares his birthday with former Australia wicket-keeper batter Ian Healy (58) among notable cricketers. Sharma, who enjoys a loyal fan-base like other Indian cricketers of his stature, had started to receive heartfelt birthday wishes even before midnight. Currently playing in the ongoing 15th season of the Indian Premier League, Sharma is amid a terrible patch both as a captain and as a batter. While Mumbai have lost eight matches on the trot, Sharma has managed to score just 153 runs at an average and strike rate of 19.12 and 126.44 respectively. In such a rare but dreadful phase, it isn’t a surprise as to why Sharma’s bountiful fans seem eager to post morale-boosting birthday wishes for him across social media platforms. Readers must note that Sharma is scheduled to face Rajasthan Royals at the Dr DY Patil Sports Academy tonight. Hence, his fans would be hoping for him to return to form on his 35th birthday. It is worth mentioning that this will be only the third time (after 2009 and 2014) when Sharma will be playing an IPL match on his birthday. In the previous two instances against Deccan Chargers and Sunrisers Hyderabad, Sharma had scored 17 (20) and 1 (5) respectively (both in losing causes). 30th April bole toh आपल्या रोहित चा बर्थडे! 🤩 पलटन, मग होऊ द्या की replies मध्ये सेलिब्रेशन! 🎂 #OneFamily #DilKholKe #MumbaiIndians @ImRo45 pic.twitter.com/iPbA9dFJDH — Mumbai Indians (@mipaltan) April 29, 2022 Happy birthday @ImRo45 bhai 😊 My inspiration since I was a youngster, and inspiring me every day now at @mipaltan 💙 pic.twitter.com/OP13C33CNJ — Tilak Varma (@TilakV9) April 29, 2022 Happy Birthday @ImRo45 Paji 🎂🎂 God Bless you ❤️❤️ pic.twitter.com/T0mSl6FfwB — Anmol Singh (@iamanmolpreet28) April 29, 2022 Happy birthday Rohit paji 🥳 God bless 🙏🏼 Thank you for being there 😇 @ImRo45 pic.twitter.com/HvvQExkNQ6 — Ramandeep Singh (@Ramandeep__13) April 29, 2022 Happy Birthday @ImRo45 – one of the greats in this generation, dominating white-ball format as an opener, showed his determination and skill in longer format, 5 hundreds in 2019 ODI World Cup, 5 time IPL winning captain, Asia Cup winning captain. #HappyBirthdayRohit pic.twitter.com/L70OhcPC0S — Johns. (@CricCrazyJohns) April 29, 2022 Happy Birthday to the Greatest opener of all time. To the most successful and best captain of IPL. To the guy who was told that he can’t play test, and became highest ranked indian test Batsman and captain of the team. To the guy who never GAVE UP. @ImRo45 ❤️ #HappyBirthdayRohit pic.twitter.com/z5DNDJJ5YF — ANSHUMAN🚩 (@AvengerReturns) April 29, 2022 Hey @ImRo45 , Happy Birthday Champ You have no idea how special you are for me and for all of your fans You make us happy ,you make us proud .You inspire us every single day . Words can’t describe what you mean to us but still We are always Proud of you ❤️ #HappyBirthdayRohit pic.twitter.com/icVALUWsRi — RG 🌟 (@_dark_crusadeer) April 29, 2022 Rohit Sharma Only in history of cricket:- •3+ Tons in all three formats. •3 Double ton in ODIs. •4 Hundreds in T20Is. •5 IPL Titles as captain. •2 T20I Ton as captain •Most Tons in ODI WC & single WC edition. •Hundreds in all formats in a single tour. #HappyBirthdayRohit pic.twitter.com/v2jLtH78g3 — CricketMAN2 (@ImTanujSingh) April 29, 2022 While Sharma has scored 613 runs in 26 innings at an average and strike rate of 23.58 and 129.05 respectively against Rajasthan in the past, his record in Navi Mumbai T20s (82 runs in seven innings at 11.71) is quite disappointing.","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"KKR co-owner Shah Rukh Khan REVEALS plans to build a cricket stadium in Los Angeles, USA","link":"https://www.dnaindia.com/cricket/report-kkr-co-owner-shah-rukh-khan-reveals-plans-to-build-a-cricket-stadium-in-los-angeles-usa-2949451","keywords":["Sports","Cricket"],"creator":["DNA Web Team"],"video_url":null,"description":"According to a statement from KKR co-owner SRK, the franchise plans to build a state-of-the-art cricket stadium in Los Angeles, USA.","content":null,"pubDate":"2022-04-29 17:48:43","image_url":"https://cdn.dnaindia.com/sites/default/files/styles/third/public/2022/04/29/1651647-fotojet-6.jpg","source_id":"dnaindia","country":["india"],"category":["sports"],"language":"english"},{"title":"Punjab Kings vs Lucknow Super Giants: IPL 2022 Live Cricket Score, Live Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/punjab-kings-vs-lucknow-super-giants-live-score-over-match-42-t20-6-10-updates-2933157","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Punjab Kings vs Lucknow Super Giants from Maharashtra Cricket Association Stadium, Pune. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-04-29 16:46:03","full_description":"Follow the Indian Premier League 2022 live cricket score on Sports.NDTV.com . After 10.2 overs, Punjab Kings, chasing a target of 154, are 74/3. Get live score, ball by ball commentary and much more. Keep track of Indian Premier League 2022 today match between Punjab Kings and Lucknow Super Giants. Everything related to Punjab Kings and Lucknow Super Giants match will be available on Sports.NDTV.com . Stay updated with Punjab Kings vs Lucknow Super Giants live score. Do check for Punjab Kings vs Lucknow Super Giants scorecard. You can get scorecard updates, match related facts. Get quick live updates with ads, Sports.NDTV.com , which is the perfect destination for live cricket score. 9.6 overs (0 Run) Another dot to end! A tidy over then from Krunal Pandya! Shorter and outside off, Liam cuts but to point. 9.5 overs (1 Run) Fires it on the pads, Jonny Bairstow looks to flick but misses, it hits the pad and rolls on the leg side. A leg bye taken. 9.4 overs (1 Run) Slightly shorter and on off, this is pushed down to long off for one. 9.3 overs (0 Run) Three dots in a row! On middle, Liam Livingstone plays it to the right of the bowler. 9.2 overs (0 Run) Slows it up and lands it on middle, blocked. 9.1 overs (0 Run) Fires it on middle, it is pushed to cover. Drinks! Lucknow have made a come back in this game by taking quick wickets. Punjab were off to a flier but not find themselves in some kind of trouble. Although, with Liam Livingstone and Jonny Bairstow still out in the middle. Punjab still have an opportunity to get over the victory unless these lose more wickets. Stick around to find out how things pan out. 8.6 overs (1 Run) Outside off, Liam Livingstone guides it past point for one. 8.5 overs (0 Run) Fuller and on middle, Liam Livingstone plays it back to the bowler. 8.4 overs (1 Run) Angled into the pads, Jonny Bairstow works it through square leg for one. 8.4 overs (1 Run) WIDE! Yet another extra! Down the leg side, Jonny Bairstow looks to flick but misses. 8.3 overs (1 Run) On middle, this is eased down to long on for one. 8.2 overs (0 Run) Nothing from it! This is flatter and angled into middle, Liam Livingstone looks to heave it on the leg side but misses. It hits the leg pole. 8.2 overs (2 Runs) Another googly, this one turns back in, Bairstow looks to push at it, it goes off the inner half through square leg for one. The SIREN GOES ON! Ravi has overstepped! Free Hit for Liam Livingstone. He though does not need an invitation. 8.2 overs (1 Run) WIDE! Down the leg side, Bairstow looks to flick but misses. Wided. 8.1 overs (0 Run) On middle, this is worked to mid-wicket. Liam Livingstone walks out at number 5. 7.6 overs (0 Run) OUT! IN THE AIR... TAKEN! Number three down and Punjab in big trouble now! Bhanuka Rajapaksa walks back and Krunal Pandya strikes in his first over! This is on middle, angled away from the batter. Bhanuka Rajapaksa looks to work it on the leg side as he feels it will turn back in. It ends up being against the angle, it goes off the leading edge and the fielder at point runs towards the ball and takes it. 96 needed in 72. 7.5 overs (2 Runs) Falls safe and two in the end! On middle, Bhanuka Rajapaksa gets the slog sweep out, a little bit of extra bounce, it goes off the top edge towards deep square leg, wide of the fielder. Two. 7.4 overs (1 Run) This is swept, powerfully through square leg for one. 7.3 overs (1 Run) Another easy run! On off, this is worked down to long on for one. 7.2 overs (1 Run) Just the one again! On middle, Jonny Bairstow flicks it through mid-wicket for one. 7.1 overs (1 Run) Shorter and on middle, this is worked through mid-wicket for one. 7.1 overs (1 Run) WIDE! Starts off with one down the leg side, a little bit of turn too. Rajapaksha looks to flick but misses. Wided. 6.6 overs (1 Run) Flatter again and outside off, Bhanuka Rajapaksa waits and then guides it towards short third man for one. A wicket-taking over then by Ravi. 6.5 overs (4 Runs) FOUR! Over the fielder and a boundary! A good way to get off the mark and that is how Bhanuka Rajapaksa will play. He will go for it! steps out and gets to the pitch of the ball, hits it over covers for a boundary. 6.4 overs (0 Run) Fuller and on off, Bhanuka Rajapaksa pushes it back to the bowler. Bishnoi fumbles but no run. Bhanuka Rajapaksa is the new batter in. 6.3 overs (0 Run) OUT! TIMBER! That is a huge, huge wicket. Shikhar Dhawan's struggle ends. He was the man in-form for Punjab and he is now dismissed! This is full and on middle, Dhawan looks to sweep but the length is not right. It is way too full. It goes under the bat and the middle pole is uprooted. All those dots by Dhawan probably led to his wicket. He was under the pump and looked to target Bishnoi. Probably picked the wrong bowler. 6.2 overs (0 Run) Another dot! Fuller and on off, Dhawan plays it to the right of the bowler. 6.1 overs (0 Run) A very quick full toss on off, Dhawan mistimes it to covers. Ravi Bishnoi comes into the attack now. 5.6 overs (4 Runs) FOUR! Thumped down the ground! The last ball spoils the over totally! A poor ball to end! Short and outside off, Bairstow slaps it past mid off and this races away to the fence. A decent Powerplay for Punjab, they are 46 for 1 after the first 6. Another 108 needed in 84. 5.5 overs (0 Run) Yet again, does not time it that well! Shorter and outside off, Jonny Bairstow looks to cut but it goes off the underedge towards cover. 5.4 overs (1 Run) On the pads, Dhawan looks to flick but misses, it hits the pad and rolls on the leg side. A leg bye taken. 5.3 overs (1 Run) Good length and on off, Jonny Bairstow opens the face of the bat and guides it down to third man for one. 5.2 overs (0 Run) Length and outside off, Jonny Bairstow slaps it but to covers. 5.1 overs (4 Runs) FOUR! That races away to the fence! Fortunate boundary! Shorter and outside off, Jonny Bairstow slashes at it, it goes off the outside edge, just wide of the first slip fielder and into the third man fence.","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637868673549414165.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Watch: Cheteshwar Pujara Scores 3rd Consecutive Century In County Cricket","link":"https://sports.ndtv.com/cricket/cheteshwar-pujara-scores-3rd-consecutive-century-in-county-cricket-watch-2933118","keywords":null,"creator":null,"video_url":null,"description":"Cheteshwar Pujara carried on his stellar form in the County Championship for Sussex as he brought up a third consecutive century.","content":null,"pubDate":"2022-04-29 16:17:33","image_url":"https://c.ndtvimg.com/2022-04/5kduv688_cheteshwar-pujara_625x300_18_April_22.jpg?im=FeatureCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"“This guy is a Test bowler”: Kevin Pietersen makes case for Umran Malik’s Test debut during England tour after remarkable IPL 2022 for SRH","link":"https://thesportsrush.com/cricket-news-this-guy-is-a-test-bowler-kevin-pietersen-makes-case-for-umran-maliks-test-debut-during-england-tour-after-remarkable-ipl-2022-for-srh/","keywords":["Cricket","IPL 2022","Sunrisers Hyderabad","Indian Premier League","IPL","kevin pietersen","Umran Malik"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Kevin Pietersen makes case for Umran Malik’s Test debut for India after yet another impressive display of fast bowling in IPL 2022. The young fast bowling sensation Umran Malik, who has managed to garner the Cricket fraternity’s attention with sheer raw pace, bagged his maiden five-wicket haul against the Gujarat Titans (GT) on Wednesday in… The post “This guy is a Test bowler”: Kevin Pietersen makes case for Umran Malik’s Test debut during England tour after remarkable IPL 2022 for SRH appeared first on The SportsRush.","content":"Kevin Pietersen makes case for Umran Malik’s Test debut for India after yet another impressive display of fast bowling in IPL 2022. The young fast bowling sensation Umran Malik, who has managed to garner the Cricket fraternity’s attention with sheer raw pace, bagged his maiden five-wicket haul against the Gujarat Titans (GT) on Wednesday in the ongoing IPL 2022. One of the retained players for the Sunrisers Hyderabad (SRH) in the ongoing IPL season, Malik, in line with his reputation, has not only consistently bowled above the 145 km/h speed mark, but has also got rid of the best of batters in the tournament so far. Against GT, off the five dismissals, he clean bowled as many as four batters with his sheer pace, including the likes of in-form Shubman Gill, the well set Wriddhiman Saha, David Miller and Abhinav Manohar. Although his effort came in a losing cause, he was fittingly adjudged the ‘Player of the Match’ for his maiden five-fer. All heart and sheer pace! #UmranMalik pic.twitter.com/jah3VSdpx8 — Washington Sundar (@Sundarwashi5) April 27, 2022 Kevin Pietersen makes case for Umran Malik’s Test debut A rare individual from India to possess the ability to consistently click the 150 km/h mark, Umran Malik continues to receive praises for the same from fans and former International player alike. Joining the list was former England skipper Kevin Pietersen, who, impressed with his remarkable aforementioned five-fer against GT, went on to make a case for his Test debut for India against England in July this year. “I think so [on playing Umran]. I’m playing him. I’m gonna be calling that Test match, and he better be playing,” Pietersen remarked on Star Sports. Pietersen further asserted that no batter in the world likes to face the pace at which Umran bowls and that the Indian team could well build their fast-bowling around the 22-year-old quick. “Just have a look at some of the great sides, some of the great Australian sides that we’ve played against, [they had] the Brett Lees, the Mitchell Johnsons. This guy is a Test bowler, no one likes to face this [pace]. “Look at those figures, 5-25, the best figures in this year’s IPL. You can bowl him for an over, bowl him for two overs, bowl him for three overs. Let him run in, bowl around him. Build your fast-bowling around him,” Pietersen further added. India are scheduled to tour England for three ODIs, three T20Is and one Test in July this year. The one (and the final) Test match will be the last Test match of the previous series, as the same was postponed due to COVID-19 last year. ALSO READ: Michael Vaughan urges BCCI to send Umran Malik to play County Cricket The post “This guy is a Test bowler”: Kevin Pietersen makes case for Umran Malik’s Test debut during England tour after remarkable IPL 2022 for SRH appeared first on The SportsRush.","pubDate":"2022-04-29 15:36:43","full_description":"Kevin Pietersen makes case for Umran Malik’s Test debut for India after yet another impressive display of fast bowling in IPL 2022. The young fast bowling sensation Umran Malik , who has managed to garner the Cricket fraternity’s attention with sheer raw pace, bagged his maiden five-wicket haul against the Gujarat Titans (GT) on Wednesday in the ongoing IPL 2022. One of the retained players for the Sunrisers Hyderabad (SRH) in the ongoing IPL season, Malik, in line with his reputation, has not only consistently bowled above the 145 km/h speed mark, but has also got rid of the best of batters in the tournament so far. Against GT, off the five dismissals, he clean bowled as many as four batters with his sheer pace, including the likes of in-form Shubman Gill, the well set Wriddhiman Saha, David Miller and Abhinav Manohar. Although his effort came in a losing cause, he was fittingly adjudged the ‘Player of the Match’ for his maiden five-fer. All heart and sheer pace! 🔝 🔥🔥 #UmranMalik pic.twitter.com/jah3VSdpx8 — Washington Sundar (@Sundarwashi5) April 27, 2022 A rare individual from India to possess the ability to consistently click the 150 km/h mark, Umran Malik continues to receive praises for the same from fans and former International player alike. Joining the list was former England skipper Kevin Pietersen, who, impressed with his remarkable aforementioned five-fer against GT, went on to make a case for his Test debut for India against England in July this year. “I think so [on playing Umran]. I’m playing him. I’m gonna be calling that Test match, and he better be playing,” Pietersen remarked on Star Sports. Pietersen further asserted that no batter in the world likes to face the pace at which Umran bowls and that the Indian team could well build their fast-bowling around the 22-year-old quick. “Just have a look at some of the great sides, some of the great Australian sides that we’ve played against, [they had] the Brett Lees, the Mitchell Johnsons. This guy is a Test bowler, no one likes to face this [pace]. “Look at those figures, 5-25, the best figures in this year’s IPL. You can bowl him for an over, bowl him for two overs, bowl him for three overs. Let him run in, bowl around him. Build your fast-bowling around him,” Pietersen further added. India are scheduled to tour England for three ODIs, three T20Is and one Test in July this year. The one (and the final) Test match will be the last Test match of the previous series, as the same was postponed due to COVID-19 last year. ALSO READ : Michael Vaughan urges BCCI to send Umran Malik to play County Cricket","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"I used to work at this Pakistani guy's perfume shop in Elizabeth, New Jersey: Harshal Patel","link":"https://www.indiatvnews.com/sports/cricket/ipl-2022-harshal-patel-from-royal-challengers-bangalore-says-used-to-work-at-this-pakistani-guy-s-perfume-shop-in-elizabeth-new-jersey-2022-04-29-773112","keywords":null,"creator":null,"video_url":null,"description":"Harshal Patel is among the most sought-after bowlers in Indian cricket today. Be it RCB or the team India, he has cemented his place in the playing 11.","content":null,"pubDate":"2022-04-29 15:35:59","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL 2022, PBKS vs LSG Live Score Updates: Rabada takes 4th wicket, Chameera goes back as Lucknow lose 8th - The Indian Express","link":"https://news.google.com/__i/rss/rd/articles/CBMiXGh0dHBzOi8vaW5kaWFuZXhwcmVzcy5jb20vYXJ0aWNsZS9zcG9ydHMvaXBsL2lwbC0yMDIyLXBia3MtdnMtbHNnLWxpdmUtc2NvcmUtb25saW5lLTc4OTM3MTIv0gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"IPL 2022, PBKS vs LSG Live Score Updates: Rabada takes 4th wicket, Chameera goes back as Lucknow lose 8th  The Indian ExpressPBKS vs LSG, IPL 2022 stats: Head-to-Head record, players to watch out for, predicted XI  SportstarMatch Preview - Punjab Kings vs Super Giants, Indian Premier League 2022, 42nd Match  ESPNcricinfoTATA IPL 2022: LSG vs PBKS Match Preview | LSGvPBKS Dream11 Picks | Fantasy Team Tips | The 12th Man  The Free Press JournalPunjab Kings vs Lucknow Super Giants Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update- Tata IPL 2022  Cricket AddictorView Full coverage on Google News","content":null,"pubDate":"2022-04-29 15:28:50","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL 2022: Why is Rishi Dhawan wearing a face shield?","link":"https://sportstar.thehindu.com/cricket/ipl/ipl-news/why-is-rishi-dhawan-wearing-protective-face-shield-in-ipl-2022-pbks-vs-lsg/article38482101.ece","keywords":null,"creator":["Team Sportstar"],"video_url":null,"description":"IPL 2022: Punjab Kings all-rounder Rishi Dhawan was seen wearing a protective face shield while bowling against Lucknow Super Giants in an Indian Premier League match at the Maharashtra Cricket Association Stadium in Pune on Friday.","content":null,"pubDate":"2022-04-29 14:57:56","full_description":"Punjab Kings all-rounder Rishi Dhawan was seen wearing a protective face shield while bowling against Lucknow Super Giants in an Indian Premier League (IPL) match at the Maharashtra Cricket Association (MCA) Stadium in Pune on Friday. Dhawan had sported the headgear in his first match of IPL 2022 against Chennai Super Kings on Sunday. The Himachal Pradesh captain had suffered a blow on the face in a Ranji Trophy match following which he had to undergo surgery and decided to wear the face shield to prevent further injury. What's more dangerous than a lion?. #SherSquad , tune in to this video to find out the reason behind @rishid100 's initial absence & how he is all set for a roaring comeback now #SaddaPunjab #PunjabKings #IPL2022 # #RishiDhawan pic.twitter.com/mnKKULSSrz \"I felt very happy when I saw that Punjab Kings had bid for me. I feel good coming back to Punjab Kings because I've been a player here for four years and I've come back for my fifth year. I have a lot of memories of when I was here last time and I hope we do one better than the loss in the IPL 2014 final this year. I'm making an IPL comeback after four (six) years so it was a little disheartening when I got injured in the Ranji Trophy. I had to go through surgery which ruled me out of the first four matches but I'm totally fine and available for selection now. I've been training hard and hope to have a strong comeback. \"It was absolutely a low phase for me because I had worked so hard to make a comeback and I finally got a chance in the IPL after four (six) years. I performed well in domestic cricket. I tried continuously for three to four years to make a comeback so I was a little scared wondering whether I would miss out on playing due to my injury. But this happens in cricket. Sometimes we are happy and other times we are sad. My experience has helped me realise that there will be ups and downs. I kept myself mentally strong thinking I would overcome this and make a good comeback. Everything has gone well till now. I have missed four games but I hope I prove myself whenever I get the chance and try to make a good comeback,\" Dhawan said. The 32-year-old is making his IPL comeback this season after six years, having last played a match in the marquee T20 league in 2016. Dhawan was roped in for Rs. 55 lakh by Punjab Kings at the IPL 2022 auctions and immediately made an impression, picking the wickets of Shivam Dube and Mahendra Singh Dhoni, and returning figures of two for 39 in his quota of four overs.","image_url":null,"source_id":"sportstar","country":["india"],"category":["sports"],"language":"english"},{"title":"“One game I wouldn’t be wishing well for Mayank”: KL Rahul gives funny reply on playing vs Punjab Kings captain Mayank Agarwal in 2022 IPL","link":"https://thesportsrush.com/cricket-news-one-game-i-wouldnt-be-wishing-well-for-mayank-kl-rahul-gives-funny-reply-on-playing-vs-punjab-kings-captain-mayank-agarwal-in-2022-ipl/","keywords":["Cricket","IPL 2022","Lucknow Super Giants","Punjab Kings","Indian Premier League","KL Rahul","LSG","Mayank Agarwal","PBKS"],"creator":["Dixit Bhargav"],"video_url":null,"description":"KL Rahul given funny reply: The star Indian batter is playing a match against Punjab Kings after as many as six years. Lucknow Super Giants captain KL Rahul couldn’t leave a mark in his first-ever match against Punjab Kings in six years. Apart from the time interval, a primary reason why Rahul vs Punjab was… The post “One game I wouldn’t be wishing well for Mayank”: KL Rahul gives funny reply on playing vs Punjab Kings captain Mayank Agarwal in 2022 IPL appeared first on The SportsRush.","content":"KL Rahul given funny reply: The star Indian batter is playing a match against Punjab Kings after as many as six years. Lucknow Super Giants captain KL Rahul couldn’t leave a mark in his first-ever match against Punjab Kings in six years. Apart from the time interval, a primary reason why Rahul vs Punjab was being looked forwarded to was because the former had begun his captaincy career at PBKS during IPL 2020. Opening the batting with wicket-keeper batter Quinton de Kock, Rahul became the first batter to get out after edging a Kagiso Rabada delivery to wicket-keeper batter Jitesh Sharma. Rabada, who had an upper hand against Rahul in their previous four IPL encounters, was successful in dismissing Rahul for the second time in the biggest T20 tournament across the world. Kagiso: You may go! Bowls an absolute peach to dismiss KL Rahul! #SaddaPunjab #PunjabKings #IPL2022 #ਸਾਡਾਪੰਜਾਬ #PBKSvLSG pic.twitter.com/aJ2bpM9cJx — Punjab Kings (@PunjabKingsIPL) April 29, 2022 KL Rahul gives funny reply on playing vs Punjab Kings captain Mayank Agarwal in 2022 IPL Other than playing against Kings, Rahul’s close friend and former opening partner Mayank Agarwal is his counterpart at the Maharashtra Cricket Association tonight. Readers must note that the two go back a long way having played age-group cricket for Karnataka during their formative years. Being asked about the prospect of facing Agarwal, Rahul sounded unperturbed and unaffected about locking horns with a close aid. While a practical response witnessed Rahul focusing on a couple of a points, a funnier side of him saw him “not wishing well” for Agarwal. “Quite balanced, we are going to look at this as another game, another opportunity for us to get two points. We all enjoy playing this tournament and every game is important. Regardless of which opposition we are playing, we try to enjoy our cricket, try and execute our plans. This is one game I wouldn’t be wishing well for Mayank [Agarwal],” Rahul told Star Sports at the toss. The post “One game I wouldn’t be wishing well for Mayank”: KL Rahul gives funny reply on playing vs Punjab Kings captain Mayank Agarwal in 2022 IPL appeared first on The SportsRush.","pubDate":"2022-04-29 14:45:58","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Rahul Dravid shares his wisdom with players from northeast and plate group","link":"https://www.indiatvnews.com/sports/cricket/rahul-dravid-interacts-with-players-from-northeast-and-plate-group-at-the-nca-2022-04-29-773104","keywords":null,"creator":null,"video_url":null,"description":"India head coach and veteran batsman Rahul Dravid interacted with cricketers from the northeast and plate group at the National Cricket Academy, on April 29, Friday.","content":null,"pubDate":"2022-04-29 14:42:29","full_description":"India head coach and veteran batsman Rahul Dravid interacted with cricketers from the northeast and plate group at the National Cricket Academy, on April 29, Friday. Dravid, who worked extensively on the up and coming cricketers as India U-19 coach and then as the NCA chief, spent about 45 minutes with the players who are honing their skills in the camp organised under the tutelage of world-class coaches including Ashes-winning bowling coach Troy Cooley. The training camp began on April 18, and will go till May 12. \"It was a memorable interaction for the players. The session lasted around 45 minutes,\" a BCCI source told PTI. Dravid's successor at NCA, his longtime India teammate VVS Laxman, was also part of the interaction. \"Many thanks to my good friend & Team India head coach Rahul Dravid for having taken the time to speak to players from the North East & Plate group attending the NCA camp in Bengaluru. I am sure the boys would have welcomed the chance to take a peek into Rahul's mind,\" Laxman tweeted. The BCCI has organised the camp to ensure that players from Mizoram, Manipur, Meghalaya, Arunachal Pradesh and Sikkim get the best coaching and infrastructure to be on par with the other domestic sides. Dravid, who is based out of Bengaluru, is currently not on national duty with the running till May 29. (With inputs from PTI)","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"Why is Manish Pandey not playing today’s IPL 2022 match between Punjab Kings and Lucknow Super Giants?","link":"https://thesportsrush.com/cricket-news-why-is-manish-pandey-not-playing-todays-ipl-2022-match-between-punjab-kings-and-lucknow-super-giants/","keywords":["Cricket","IPL 2022","Lucknow Super Giants","Punjab Kings","Indian Premier League","LSG","PBKS"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Why Manish Pandey not playing today: Lucknow Super Giants have made a solitary change to their Playing XI for this match. During the 42nd match of the ongoing 15th season of the Indian Premier League between Punjab Kings and Lucknow Super Giants in Pune, Punjab Kings captain Mayank Agarwal has won the toss and chose… The post Why is Manish Pandey not playing today’s IPL 2022 match between Punjab Kings and Lucknow Super Giants? appeared first on The SportsRush.","content":"Why Manish Pandey not playing today: Lucknow Super Giants have made a solitary change to their Playing XI for this match. During the 42nd match of the ongoing 15th season of the Indian Premier League between Punjab Kings and Lucknow Super Giants in Pune, Punjab Kings captain Mayank Agarwal has won the toss and chose to bowl. “We are going to bowl first. We’d like to know what total to chase. We’d like to get first use of the conditions with the ball. There is very less dew here,” Agarwal told Star Sports at the toss. “The guys are very chill about it [change in combination]. They are quite flexible. If we win the games, these things are not too much of an issue. We might not have had the kind of stats every other team would like to have, but it’s fine as long as we get two points on the board.” Muskuraiye #SherSquad, hum toss jeet chuke hain! #SaddaPunjab #IPL2022 #PunjabKings #ਸਾਡਾਪੰਜਾਬ #PBKSvLSG pic.twitter.com/hDdP2DZR6Q — Punjab Kings (@PunjabKingsIPL) April 29, 2022 Coming on the back of a 11-run victory against defending champions Chennai Super Kings, Kings haven’t made any change to their Playing XI for this match. Why is Manish Pandey not playing vs Punjab Kings today? Unlike PBKS, Lucknow Super Giants have made a lone change to their Playing XI by bringing in fast bowler Avesh Khan for batter Manish Pandey. Readers must note that this is their first-ever match at the Maharashtra Cricket Association Stadium. “When dew is not around, it’s quite an even game. It’s important for us to start well, really assess the conditions in the first couple of overs, set-up a really solid base and then enjoy our batting and explode. I have played here before, we’ll have to bat smartly,” Rahul told Star Sports at the toss. Pandey, who has scored 88 runs in six innings this season at an average and strike rate of 14.66 and 110 respectively, appeared to be the likeliest of names to be left out (for the second time this season) when his team was looking to play an extra bowler at this particular venue. “It’s a high boundary-scoring ground, one extra bowler would give more options. It’ll be a good opportunity for Jason to bat at seven. Ideally wouldn’t want him to bat, but if he does, it’s a good opportunity to show his batting skills,” Rahul added. In his seven IPL 2022 matches, Avesh has picked 11 wickets at an average of 20.09, an economy rate of 8.28 and a strike rate of 14.5 to be LSG’s highest wicket-taker this season thus far. The post Why is Manish Pandey not playing today’s IPL 2022 match between Punjab Kings and Lucknow Super Giants? appeared first on The SportsRush.","pubDate":"2022-04-29 14:05:17","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Punjab Kings vs Lucknow Super Giants Live Score Ball by Ball, IPL 2022 Live Cricket Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/punjab-kings-vs-lucknow-super-giants-live-score-over-match-42-t20-1-5-updates-2932465","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Punjab Kings vs Lucknow Super Giants from Maharashtra Cricket Association Stadium, Pune. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-04-29 13:53:49","full_description":"A dedicated team of experts bring you live score, live cricket score, live match update on Sports.NDTV.com . After 5.2 overs, Lucknow Super Giants are 35/1. The live updates of Punjab Kings vs Lucknow Super Giants scorecard is also available. It is the perfect platform to follow your favourite teams in Indian Premier League 2022. Keep a track on your favourite batsmen and bowlers through Indian Premier League 2022 today match, ball by ball commentary, Punjab Kings vs Lucknow Super Giants, Punjab Kings vs Lucknow Super Giants live score, Punjab Kings vs Lucknow Super Giants scorecard. Follow the excitement of the Indian Premier League 2022 on Sports.NDTV.com as you can follow live match updates and live cricket score through our platform. 4.6 overs (1 Run) Another single to end a really good over for Lucknow. On off, this is pushed to mid off for one. A much-needed over for Lucknow. 4.5 overs (1 Run) Hooda takes one! Length and on off, this one takes off after landing. It hits the splice of the bat as Hooda looks to drive, it goes to mid off for one. 4.4 overs (1 Run) Now takes one, good sensible batting! On middle, this is pushed down to mid on for one. 4.3 overs (6 Runs) SIX! BANG! That is trademark de Kock! This is probably his favourite shot! This is shortish and on off, de Kock picks the length early and heaves it over the mid-wicket fence for a biggie. Two in a row and he has surely got going. 4.2 overs (6 Runs) SIX! That has hit the fence on the full! Will this get de Kock going now? This is full and right in the slot, it is smashed down the ground, it hits the ropes on the full and it is the first biggie of the game. 4.1 overs (0 Run) De Kock is probably trying to hit the ball way too hard here! This is a full toss, a low one outside off. De Kock swings but it goes off the underedge and to the keeper. 4.1 overs (1 Run) WIDE! Good take in the end! This is well wide outside off, swings away further. De Kock goes after it but misses. 3.6 overs (0 Run) Yet another dot! Lucknow really struggling to get going here! Length and outside off, Hooda waits and then guides it but straight to short third man. 3.5 overs (1 Run) Just the single again! Length and on off, de Kock pushes it to mid off and gets to the other end. 3.4 overs (1 Run) Cracked away! There is a fielder in the deep though! Shorter and outside off, Hooda cuts it through point and takes one. 3.3 overs (1 Run) De Kock gets off strike! Shorter and outside off, this is cut to point for one. 3.2 overs (0 Run) That is yet another lovely delivery! Begins on middle and then moves away. De Kock looks to go downtown this time but is beaten. Some nice bounce for the bowlers. 3.1 overs (0 Run) Slashes but misses! This is wide outside off, room on offer. De Kock goes after it but misses. 2.6 overs (0 Run) A good delivery to welcome the new batter! Goes full and straight, on middle, this is pushed to mid on. End of a wicket-taking over from Rabada. Deepak Hooda walks out at number 3. 2.5 overs (0 Run) OUT! EDGED AND TAKEN! Rabada strikes in the Powerplay yet again and he gets the big fish, the in-form KL Rahul! Another beauty of a delivery. This starts on middle, it is angling in but then leaves the batter. Rahul is rooted to his crease and ends up pushing ahead of his body, this goes off the outside edge and it is a low catch taken by Sharma by diving to his right behind the sticks. Early wicket for Punjab, just the start they needed. 2.4 overs (0 Run) That is a good comeback! After serving a half volley on the last ball, Rabada bowls this one on a length and around middle, Rahul looks to defend but it goes off the outer half to short third man. 2.3 overs (4 Runs) FOUR! That is beautifully timed! Length and on off, shaping away. Rahul leans into it and creams it through covers for a boundary. 2.2 overs (1 Run) Probably de Kock was a little surprised there! This one is a full toss, Rabada was going for a yorker but end up bowling a full toss, de Kock is early in the flick, it goes off the inner half wide of mid on for one. 2.1 overs (1 Run) A quick run! On middle, Rahul pushes it to mid on for a single. 1.6 overs (0 Run) Looks to be innovative but it does not come off! This one is well wide outside off, de Kock looks to play the scoop on the leg side but misses by a long way. Really good start by Sandeep. 1.5 overs (0 Run) Really good five deliveries! Length and on off, de Kock pushes it to covers. 1.4 overs (0 Run) Leading edge but safe! This starts around the leg pole. Shapes away. De Kock looks to flick, it is against the swing, it goes off the leading edge but lands well short of point. 1.3 overs (1 Run) Rahul is off the mark! Length and on middle, this is pushed down to long on for one. 1.2 overs (0 Run) Slashes but misses! Outside off, shaping away. Rahul goes after it but no connection. 1.1 overs (1 Run) Some shape for Sandeep too! Fuller and around off, this one moves away. De Kock looks to drive, it goes off the outer half through point for one. Who will bowl from the other end? It will be Sandeep Sharma. 0.6 over (4 Runs) FOUR LEG BYES! Fails to end the over well! Ends up with one on the pads, Rahul does not put bat on ball but it hits the pad, goes past the keeper and into the fine leg fence. First boundary of the game. A steady start for Lucknow. 0.5 over (0 Run) Now gets this one to shape away! Length and on off, Rahul hangs back and defends. Can he end the over well now? 0.4 over (0 Run) Another loud appeal but it is probably going down leg! Yet again, Arshdeep Singh gets nice amount of movement into the right-hander. The line though is on the pads, Rahul looks to flick but misses to get hit on the pads. Sharma from behind the stumps indicates it is going down leg. 0.3 over (0 Run) Yet again, this one shapes back in nicely but the length is slightly short, on middle, Rahul has enough time to adjust and defend it. 0.2 over (0 Run) This one does come back in a touch! The line is a little too straight though. Rahul looks to flick but misses to get hit on the pads. 0.1 over (1 Run) De Kock and Lucknow are underway! Length and on off, shaping away. De Kock opens the face of the bat and guides it towards point for one. Time for the action to begin! The players make their way out to the middle. Quinton de Kock and KL Rahul are the openers for Lucknow. Arshdeep Singh has the new ball in hand. Here we go... Marcus Stoinis is up for a chat. He says he is looking forward to the game after a 5-day break. Mentions he bats when needed, they are still not sure about his best position. He adds he would love to bat up the order but he will bat wherever needed. Mentions the bowling is going good but not sure if he will be needed. Ends by saying, the wicket seems like it will have good bounce. KL Rahul says there has not been much dew and hence, it is an even game and whoever plays well, will win. States it is now about enjoying their batting and they need to bat smartly. Informs they have one change, Manish misses out and Avesh Khan comes in. Mayank Agarwal says they would want to know what they are chasing and informs they are playing the same team. Mentions the dew does not arrive and it is now more about trying to restrict them early and chase whatever they put up on board. Mentions the guys are quite flexible and if they win, then who plays and who does not is not an issue. Ends by saying he is looking forward to play against Rahul. LUCKNOW (PLAYING XI) - Quinton de Kock (WK), KL Rahul (C), Deepak Hooda, Marcus Stoinis, Ayush Badoni, Krunal Pandya, Jason Holder, Dushmantha Chameera, Ravi Bishnoi, Avesh Khan (IN FOR Manish Pandey), Mohsin Khan. PUNJAB (PLAYING XI) - Mayank Agarwal (C), Shikhar Dhawan, Bhanuka Rajapaksa, Jonny Bairstow, Liam Livingstone, Jitesh Sharma (WK), Rishi Dhawan, Kagiso Rabada, Rahul Chahar, Sandeep Sharma, Arshdeep Singh. TOSS - Punjab win the toss and ELECT TO FIELD! PITCH REPORT - Danny Morrison says the straighter boundaries are longer. Adds one needs to bowl length and probably short on this wicket and there is even covering of grass in that area and the pacers will love it. Lucknow have been really good so far. They sit in the top 4 with 5 games won and three lost out of the 8 they have played. Punjab on the other hand, have won and lost the same number of games. They have been a tad inconsistent so far but head into this game on the back of a good win. Can they continue the good work is what we will have to see. A win here will see them go level on points with the sides placed on 3rd and 4th. They'll have to play really well if they are to beat Lucknow. Toss and teams in a bit… Three of the most successful franchise are struggling big time as Kolkata tasted yet another defeat at the hands of Delhi. It is a new day and two new teams will be facing of as the action shifts to Pune. It is a clash between the new entrants this year, Lucknow and Punjab. This promises to be an absolute cracker. ... MATCH DAY ...","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637868570214395420.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Cricket South Africa announces new franchise-based T20 league","link":"https://sportstar.thehindu.com/cricket/cricket-south-africa-csa-franchise-t20-league-cricket-news-ipl/article38482073.ece","keywords":null,"creator":["PTI"],"video_url":null,"description":"Thirty-three matches will be played over three to four weeks. Like the Indian Premier League (IPL), the tournament will allow up to four international players to feature in the playing XIs of each team.","content":null,"pubDate":"2022-04-29 13:35:16","full_description":"Cricket South Africa (CSA) on Friday announced a new six-team franchise based T20 league, to be played in January next year. The league is set to comprise six privately owned franchises playing each other in a double round before the top three sides move to the playoff stages. Thirty-three matches will be played over three to four weeks. Like the Indian Premier League (IPL), the tournament will allow up to four international players to feature in the playing XIs of each team. The date of the auction, fixtures and details will be announced at a later date. READ | Nasser Hussain warns Ben Stokes against 'captaining by committee' The first edition of the competition will be played in January 2023, immediately after South Africa's tour to Australia. The first month of the year will then become the window for the league. “We are excited by the formation of something this fresh and invigorating, which also offers the opportunity for private investment into the franchises,” said Pholetsi Moseki, CSA CEO. “CSA has already received interest from a number of potential local and international investors,” he added. Moseki said that a sustainable business model had been created for both the league and the teams, with a healthy salary bill to attract the very best local and international players. A new company formed by CSA and broadcaster SuperSport will manage the tournament. The league is also actively looking at the possibility of a women’s T20 event to coincide in the coming years.","image_url":null,"source_id":"sportstar","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL 2022 Live: PBKS Look To Register Back-To-Back Wins In Match vs LSG","link":"https://sports.ndtv.com/cricket/live-ipl-score-pbks-vs-lsg-live-cricket-score-punjab-kings-vs-lucknow-super-giants-live-scoreboard-and-updates-2932345","keywords":null,"creator":null,"video_url":null,"description":"IPL 2022, Punjab Kings vs Lucknow Super Giants Live IPL Score Updates: Punjab Kings and Lucknow Super Giants will look to grab their second win on the trot at the Maharashtra Cricket Association...","content":null,"pubDate":"2022-04-29 13:03:17","image_url":"https://c.ndtvimg.com/2022-04/ef9v3bmc_pbks_625x300_29_April_22.jpg?im=FeatureCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Tata IPL 2022 MI vs RR Live Streaming: Mumbai Indians vs Rajasthan Royals Live Coverage, venue, date, timing","link":"https://www.firstpost.com/firstcricket/sports-news/mumbai-indians-vs-rajasthan-royals-indian-premier-league-live-streaming-today-check-mi-vs-rr-live-coverage-venue-date-streaming-channel-date-time-10614821.html","keywords":["First Cricket News"],"creator":["FP Trending"],"video_url":null,"description":"Tata IPL 2022 MI vs RR Live Streaming: Mumbai Indians vs Rajasthan Royals Live Coverage, venue, date, timing","content":"Rajasthan Royals vs Mumbai Indians live score streaming, IPL 2022: Riding on the momentum of winning three matches on the bounce, a confident Rajasthan Royals will take on bottom-placed and out-of-sorts Mumbai Indians in the Indian Premier League at the DY Patil Stadium in Mumbai.Rajasthan Royals come into this match placed second in the standings and they have lost only two games and won six while Mumbai Indians are already out of the race after having lost all their eight matches so far.There will be a lot of focus on Mumbai Indians’ batting order against a well-rounded Rajasthan bowling unit, especially after their failure in their last match against Lucknow Super Giants.When will the Rajasthan Royals and Mumbai Indians match be played?The RR vs MI IPL 2022 match will take place on 30 April.Where will the Rajasthan Royals and Mumbai Indians match be held?The RR vs MI IPL 2022 match will be held at Mumbai’s DY Patil Stadium.What time will the Rajasthan Royals and Mumbai Indians match start?The RR vs MI IPL 2022 match will begin from 7:30 pm onwards. The toss will happen at 7 pm on the same day.Where can you watch RR vs MI IPL 2022 match on TV and online?The RR vs MI IPL 2022 match will be broadcast live on Star Sports Network channels — Star Sports 1 HD, Star Sports Select 1, Star Sports Select 1 HD (Dugout) and Star Sports 1. The match will also be streamed live on Disney+ Hotstar.You can also follow firstpost.com to check out the live scores and commentary of the RR vs MI IPL 2022 match.Complete Squads:Rajasthan Royals: Jos Buttler, Sanju Samson (c), Yashasvi Jaiswal, Shimron Hetmyer, Ravichandran Ashwin, Yuzvendra Chahal, Prasidh Krishna, Riyan Parag, Nathan Coulter-Nile, Devdutt Padikkal, Navdeep Saini, Karun Nair, Rassie van der Dussen, Anunay Singh, James Neesham, Daryl Mitchell, Dhruv Jurel, Shubham Garhwal, Kuldip Yadav, Kuldeep Sen, Obed McCoy, Tejas Baroka, KC CariappaMumbai Indians: Rohit Sharma (c), Ishan Kishan, Kieron Pollard, Suryakumar Yadav, Jasprit Bumrah, Tim David, Jaydev Unadkat, Tymal Mills, Jofra Archer (injured), Riley Meredith, Daniel Sams, Fabian Allen, Mayank Markande, Murugan Ashwin, Anmolpreet Singh, Basil Thampi, Dewald Brevis, Tilak Varma, Aryan Juyal, Arjun Tendulkar, Ramandeep Singh, Rahul Buddhi, Hrithik Shokeen, Sanjay Yadav, Arshad KhanRead all the Latest News, Trending News, Cricket News, IPL Live Score, IPL 2022 schedule, IPL 2022 Points table and Entertainment News. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-04-29 12:12:41","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/04/RR640-4.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"PBKS vs LSG Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update- Tata IPL 2022 - Cricket Addictor","link":"https://news.google.com/__i/rss/rd/articles/CBMioQFodHRwczovL2NyaWNrZXRhZGRpY3Rvci5jb20vZmFudGFzeS1jcmlja2V0L3Bia3MtdnMtbHNnLWRyZWFtMTEtcHJlZGljdGlvbi1mYW50YXN5LWNyaWNrZXQtdGlwcy1kcmVhbTExLXRlYW0tcGxheWluZy14aS1waXRjaC1yZXBvcnQtaW5qdXJ5LXVwZGF0ZS10YXRhLWlwbC0yMDIyL9IBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"PBKS vs LSG Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update- Tata IPL 2022  Cricket AddictorPBKS vs LSG, IPL 2022 stats: Head-to-Head record, players to watch out for, predicted XI  SportstarMatch Preview - Punjab Kings vs Super Giants, Indian Premier League 2022, 42nd Match  ESPNcricinfoTATA IPL 2022: LSG vs PBKS Match Preview | LSGvPBKS Dream11 Picks | Fantasy Team Tips | The 12th Man  The Free Press JournalPBKS vs LSG Live Score, IPL 2022: Childhood buddies Mayank, Rahul clash in Lucknow-Punjab tie  Times of IndiaView Full coverage on Google News","content":null,"pubDate":"2022-04-29 11:56:57","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"PBKS VS LSG Dream11 IPL 2022: Fantasy Cricket Tips, Dream 11, Probable Playing XI for Punjab vs Lucknow","link":"https://www.indiatvnews.com/sports/cricket/pbks-vs-lsg-dream11-ipl-2022-fantasy-cricket-tips-dream-11-probable-playing-xi-for-punjab-kings-vs-lucknow-super-giants-2022-04-29-773047","keywords":null,"creator":null,"video_url":null,"description":"PBKS vs LSG Dream11 IPL 2022: Fantasy Cricket Tips, Dream 11, Probable Playing XI for Punjab Kings vs Lucknow Super Giants Match Details","content":null,"pubDate":"2022-04-29 10:59:26","full_description":"Punjab Kings vs Lucknow Super Giants 2022, Match No. 42 Friday, 7:30 PM Maharashtra Cricket Association Stadium, Pune (C), , Liam Livingstone, (VC), Jitesh Sharma (Wk), Deepak Hooda, , , , Arshdeep Singh, Rahul Chahar Shikhar Dhawan, Mayank Agarwal (C), Bhanuka Rajapaksa, Liam Livingstone, , Jitesh Sharma (Wk), Rishi Dhawan, , Rahul Chahar, Arshdeep Singh, Sandeep Sharma (Wk), (C), , Krunal Pandya, Deepak Hooda, Ayush Badoni, Marcus Stoinis, Jason Holder, Avesh Khan, Dushmantha Chameera, Ravi Bishnoi Star Sports Network - Star Sports 1 and Star Sports 1HD, Star Sports Select 1 and Star Sports Select 1HD (Dugout). The match will be streamed live on Hotstar Friday, 29th April 7:30 PM IST Maharashtra Cricket Association Stadium, Pune Mayank Agarwal(c), Shikhar Dhawan, Bhanuka Rajapaksa, Jonny Bairstow, Liam Livingstone, Jitesh Sharma(w), Rishi Dhawan, Kagiso Rabada, Rahul Chahar, Sandeep Sharma, Arshdeep Singh, Shahrukh Khan, Odean Smith, Vaibhav Arora, Harpreet Brar, Nathan Ellis, Prabhsimran Singh, Benny Howell, Baltej Singh, Writtick Chatterjee, Prerak Mankad, Ishan Porel, Atharva Taide, Ansh Patel, Raj Bawa Quinton de Kock(w), KL Rahul(c), Manish Pandey, Deepak Hooda, Marcus Stoinis, Ayush Badoni, Krunal Pandya, Jason Holder, Dushmantha Chameera, Ravi Bishnoi, Mohsin Khan, Avesh Khan, Krishnappa Gowtham, Manan Vohra, Kyle Mayers, , Shahbaz Nadeem, Ankit Rajpoot, Andrew Tye, Karan Sharma, Mayank Yadav","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"Virat Kohli is not...: Laxman Sivaramakrishnan makes a big statement on RCB batter's poor form in IPL 2022","link":"https://zeenews.india.com/cricket/virat-kohli-is-not-laxman-sivaramakrishnan-makes-a-big-statement-on-rcb-batters-poor-form-in-ipl-2022-2458604.html","keywords":null,"creator":null,"video_url":null,"description":"While many suggest that Kohli should 'take a break' from cricket, former India player and current cricket commentator Laxman Sivaramakrishnan believes Kohli is someone who cannot be dropped from the T20I squad of India","content":null,"pubDate":"2022-04-29 10:39:00","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"There is nothing agricultural about KL Rahul's batting: Gavaskar","link":"https://www.tribuneindia.com/news/ipl-2022/there-is-nothing-agricultural-about-kl-rahuls-batting-gavaskar-390410","keywords":null,"creator":null,"video_url":null,"description":"Mumbai, April 29The elegant KL Rahul's ability to score at a healthy rate by playing textbook stroke has caught the attention of none other than batting great Sunil Gavaskar, who feels it's a message that one doesn't need to manufacture shots to score quickly.In the ongoing IPL-15, Lucknow Super Giants skipper Rahul has been in sublime form at the top of order and has already hit two hundreds -- both against Mumbai Indians.With 368 runs, he is the second highest run-getter so far this season, just behind Rajasthan Royals' Jos Buttler.Speaking on Cricket Live on Star Sports, Gavaskar said, \"He's been outstanding. The best part about KL Rahul's batting is that nothing is agricultural in his cricketing shots. Every shot that he plays is a proper textbook stroke.\"So what he has actually told you with his shot-making skills is that you don't have to manufacture shots. If you've got the shots, use them and the selection of his shots has been outstanding.\" Former England captain Kevin Pietersen also lavished praise on the Karnataka batter claiming his batting to be a breath of fresh air.Pietersen said, \"He has a wide range of shots in his armoury. So he can hit you over back-foot point, he can slice you for a six. He can hit you over extra-cover, he can hit you down the ground, and he can pick you over midwicket.\"So, he really is a 360-degree batter. I mean, he's a breath of fresh air. You can switch on the TV and watch him bat all day.\" Former India all-rounder Irfan Pathan said the right-handed batter plays according to the situation.Irfan said, \"Lokesh Rahul is the batsman who can increase or decrease the striker rate according to the situation. He has the style, the elegance and aggression to build his innings the way he wants.\"He has a sound technique and a good temperament. He is gauging the situations and batting accordingly. Rahul knows very well when he needs to shift gears.\"","content":null,"pubDate":"2022-04-29 10:34:19","full_description":"PTI Mumbai, April 29 The elegant KL Rahul's ability to score at a healthy rate by playing textbook stroke has caught the attention of none other than batting great Sunil Gavaskar, who feels it's a message that one doesn't need to manufacture shots to score quickly. In the ongoing IPL-15, Lucknow Super Giants skipper Rahul has been in sublime form at the top of order and has already hit two hundreds -- both against Mumbai Indians. With 368 runs, he is the second highest run-getter so far this season, just behind Rajasthan Royals' Jos Buttler. Speaking on Cricket Live on Star Sports, Gavaskar said, \"He's been outstanding. The best part about KL Rahul's batting is that nothing is agricultural in his cricketing shots. Every shot that he plays is a proper textbook stroke. \"So what he has actually told you with his shot-making skills is that you don't have to manufacture shots. If you've got the shots, use them and the selection of his shots has been outstanding.\" Former England captain Kevin Pietersen also lavished praise on the Karnataka batter claiming his batting to be a breath of fresh air. Pietersen said, \"He has a wide range of shots in his armoury. So he can hit you over back-foot point, he can slice you for a six. He can hit you over extra-cover, he can hit you down the ground, and he can pick you over midwicket. \"So, he really is a 360-degree batter. I mean, he's a breath of fresh air. You can switch on the TV and watch him bat all day.\" Former India all-rounder Irfan Pathan said the right-handed batter plays according to the situation. Irfan said, \"Lokesh Rahul is the batsman who can increase or decrease the striker rate according to the situation. He has the style, the elegance and aggression to build his innings the way he wants. \"He has a sound technique and a good temperament. He is gauging the situations and batting accordingly. Rahul knows very well when he needs to shift gears.\"","image_url":"https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/4/2022_4$largeimg_1872436617.JPG","source_id":"tribuneindia","country":["india"],"category":["sports"],"language":"english"},{"title":"Rabada vs Quinton de Kock IPL record: QDK vs Punjab Kings IPL stats and last 5 innings list","link":"https://thesportsrush.com/cricket-news-rabada-vs-quinton-de-kock-ipl-record-qdk-vs-punjab-kings-ipl-stats-and-last-5-innings-list/","keywords":["Cricket","IPL 2022","Lucknow Super Giants","Punjab Kings","Indian Premier League","Kagiso Rabada","LSG","PBKS","Quinton De Kock"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Kagiso Rabada vs Quinton de Kock IPL record: The two ace cricketers from South Africa will be playing against each other tonight. Punjab Kings and Lucknow Super Giants will be locking horns against each other in the 42nd match of the ongoing 15th season of the IPL in Pune tonight. In the eight matches that… The post Rabada vs Quinton de Kock IPL record: QDK vs Punjab Kings IPL stats and last 5 innings list appeared first on The SportsRush.","content":"Kagiso Rabada vs Quinton de Kock IPL record: The two ace cricketers from South Africa will be playing against each other tonight. Punjab Kings and Lucknow Super Giants will be locking horns against each other in the 42nd match of the ongoing 15th season of the IPL in Pune tonight. In the eight matches that Punjab have played this season, they have won and lost four each to be at the seventh position on the points table. Lucknow, on the other hand, are at the fourth position on the back of winning and losing five and three IPL 2022 matches respectively. As far as playing at the Maharashtra Cricket Association Stadium is concerned, Kings have won two (including one this season) and lost six out of their eight matches at this venue over the years. Super Giants, on the other hand, will be playing their first-ever match here. Kagiso Rabada vs Quinton de Kock IPL record A contest to watch out for in this match will be the coming against each other of two ace South African cricketers namely PBKS fast bowler Kagiso Rabada and LSG wicket-keeper batter Quinton de Kock. ALSO READ: KL Rahul vs Kagiso Rabada IPL record Set to clash in the powerplay itself, fans would be waiting for this South African rivalry in the Indian Premier League. Readers must note that Rabada and de Kock have faced each other on seven previous occasions in the IPL. While neither of the two has gained an advantage per se, de Kock has scored 37 (29) with the help of three fours and two sixes without getting out against Rabada in the IPL. Pumped up pack of s primed for tonight’s #SaddaPunjab #IPL2022 #PunjabKings #PBKSvLSG #ਸਾਡਾਪੰਜਾਬ pic.twitter.com/kbyCdKql0c — Punjab Kings (@PunjabKingsIPL) April 29, 2022 de Kock, 29, has played 10 matches against Punjab for four franchises (Sunrisers Hyderabad, Delhi Daredevils, Royal Challengers Bangalore and Mumbai Indians) across six seasons. The left-handed batter’s 323 runs in 10 innings have come at an average and strike rate of 35.89 and 127.17 respectively including four half-centuries. Runs Balls 4s 6s Ground Year 27 29 2 0 Abu Dhabi 2021 3 5 0 0 Chennai 2021 53 43 3 3 Dubai 2020 0 5 0 0 Abu Dhabi 2020 24 23 2 0 Mumbai 2019 The post Rabada vs Quinton de Kock IPL record: QDK vs Punjab Kings IPL stats and last 5 innings list appeared first on The SportsRush.","pubDate":"2022-04-29 10:32:07","full_description":"Kagiso Rabada vs Quinton de Kock IPL record: The two ace cricketers from South Africa will be playing against each other tonight. Punjab Kings and Lucknow Super Giants will be locking horns against each other in the 42nd match of the ongoing 15th season of the IPL in Pune tonight. In the eight matches that Punjab have played this season, they have won and lost four each to be at the seventh position on the points table. Lucknow, on the other hand, are at the fourth position on the back of winning and losing five and three IPL 2022 matches respectively. As far as playing at the Maharashtra Cricket Association Stadium is concerned, Kings have won two (including one this season) and lost six out of their eight matches at this venue over the years. Super Giants, on the other hand, will be playing their first-ever match here. A contest to watch out for in this match will be the coming against each other of two ace South African cricketers namely PBKS fast bowler Kagiso Rabada and LSG wicket-keeper batter Quinton de Kock. ALSO READ: KL Rahul vs Kagiso Rabada IPL record Set to clash in the powerplay itself, fans would be waiting for this South African rivalry in the Indian Premier League. Readers must note that Rabada and de Kock have faced each other on seven previous occasions in the IPL. While neither of the two has gained an advantage per se, de Kock has scored 37 (29) with the help of three fours and two sixes without getting out against Rabada in the IPL. Pumped up pack of 🦁s primed for tonight’s ⚔️ #SaddaPunjab #IPL2022 #PunjabKings #PBKSvLSG #ਸਾਡਾਪੰਜਾਬ pic.twitter.com/kbyCdKql0c — Punjab Kings (@PunjabKingsIPL) April 29, 2022 de Kock, 29, has played 10 matches against Punjab for four franchises (Sunrisers Hyderabad, Delhi Daredevils, Royal Challengers Bangalore and Mumbai Indians) across six seasons. The left-handed batter’s 323 runs in 10 innings have come at an average and strike rate of 35.89 and 127.17 respectively including four half-centuries.","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"IPL 2022: Watch — Sachin Tendulkar bowls in nets, reminds Mumbai Indians of Moin Khan dismissal","link":"https://www.firstpost.com/firstcricket/sports-news/ipl-2022-watch-sachin-tendulkar-bowls-in-nets-reminds-mumbai-indians-of-moin-khan-dismissal-10613831.html","keywords":["First Cricket News"],"creator":["FP Trending"],"video_url":null,"description":"IPL 2022: Watch — Sachin Tendulkar bowls in nets, reminds Mumbai Indians of Moin Khan dismissal","content":"The official Twitter handle of Mumbai Indians recently shared a video wherein Master Blaster Sachin Tendulkar is seen bowling in MI nets.Taking to their social media handle, MI said that the first delivery by Tendulkar in the nets reminded them of the famous ball that got the wicket of former Pakistan wicketkeeper-batter Moin Khan. Further in the post, MI asked fans to explain their favourite memory of Sachin’s bowling.“The first delivery reminded us of THAT Moin Khan dismissal. What's your favourite memory of Sachin's bowling, Paltan?,” Mumbai Indians captioned the post.Check the video here: Moin Khan’s dismissal by Tendulkar was one of the most talked-about events during India’s tour of Pakistan in 2004. On the third day of the Multan Test, Tendulkar’s brilliant googly took his team mates, cricket experts and fans by surprise. In the third game at Rawalpindi, Team India won the series 2-1.Watch Moin Khan’s dismissal by Tendulkar here:Recently, the master blaster celebrated his 49th birthday and wishes poured in from all corners of the world. Cricketers Virat Kohli, Suresh Raina, Yuvraj Singh, Virender Sehwag among others greeted Tendulkar on the occasion.In the ongoing season of the IPL, MI have been going through a rough patch. With eight consecutive defeats since the beginning of the season, MI are out of the race for the playoffs. They will next face Rajasthan Royals at the DY Patil Stadium on Saturday.As a replacement for injured Arshad Khan, Mumbai Indians have signed left-arm spinner Kumar Kartikeya for the rest of IPL 2022. He has played eight T20s for Madhya Pradesh and also has nine wickets to his name.Kartikeya was the joint second-highest wicket-taker for his side at the 2021-22 Syed Mushtaq Ali Trophy. He took five wickets in as many games with an economy rate of 5.05.  ","pubDate":"2022-04-29 10:29:21","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/04/tendulkar-Mumbai-Indians-Sportzpics-640.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"\"Nothing Agricultural In His Shots\": Gavaskar Praises India Star","link":"https://sports.ndtv.com/cricket/nothing-agricultural-in-his-shots-gavaskar-praises-india-stars-sublime-batting-2931638","keywords":null,"creator":null,"video_url":null,"description":"Speaking on Cricket Live on Star Sports, Gavaskar said, \"He's been outstanding. The best part about KL Rahul's batting is that nothing is agricultural in his cricketing shots. Every shot that he plays...","content":null,"pubDate":"2022-04-29 10:10:25","full_description":"The elegant KL Rahul 's ability to score at a healthy rate by playing textbook stroke has caught the attention of none other than batting great Sunil Gavaskar , who feels it's a message that one doesn't need to manufacture shots to score quickly. In the ongoing IPL-15, Lucknow Super Giants skipper Rahul has been in sublime form at the top of order and has already hit two hundreds -- both against Mumbai Indians. With 368 runs, he is the second highest run-getter so far this season, just behind Rajasthan Royals' Jos Buttler . Speaking on Cricket Live on Star Sports, Gavaskar said, \"He's been outstanding. The best part about KL Rahul's batting is that nothing is agricultural in his cricketing shots. Every shot that he plays is a proper textbook stroke. \"So what he has actually told you with his shot-making skills is that you don't have to manufacture shots. If you've got the shots, use them and the selection of his shots has been outstanding.\" Former England captain Kevin Pietersen also lavished praise on the Karnataka batter claiming his batting to be a breath of fresh air. Pietersen said, \"He has a wide range of shots in his armoury. So he can hit you over back-foot point, he can slice you for a six. He can hit you over extra-cover, he can hit you down the ground, and he can pick you over midwicket. \"So, he really is a 360-degree batter. I mean, he's a breath of fresh air. You can switch on the TV and watch him bat all day.\" Former India all-rounder Irfan Pathan said the right-handed batter plays according to the situation. Irfan said, \"Lokesh Rahul is the batsman who can increase or decrease the striker rate according to the situation. He has the style, the elegance and aggression to build his innings the way he wants. Promoted \"He has a sound technique and a good temperament. He is gauging the situations and batting accordingly. Rahul knows very well when he needs to shift gears.\" (This story has not been edited by NDTV staff and is auto-generated from a syndicated feed.)","image_url":"https://c.ndtvimg.com/2022-03/4b24gmpo_sunil-gavaskar_625x300_08_March_22.jpg?im=FeatureCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Virat Kohli and Rohit Sharma are great players, they will get back in form: Sourav Ganguly","link":"https://www.firstpost.com/firstcricket/sports-news/virat-kohli-and-rohit-sharma-are-great-players-they-will-get-back-in-form-sourav-ganguly-10614661.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"Virat Kohli and Rohit Sharma are great players, they will get back in form: Sourav Ganguly","content":"Former India captain and BCCI president Sourav Ganguly has come out in support of batting stalwarts Virat Kohl and Rohit Sharma who are both struggling for runs in the ongoing IPL 2022.Current India skipper and Mumbai Indians captain Rohit has only accumulated 153 runs in eight matches so far at a dismal average of 19.13. Kohli had had an even worse run, with only 128 runs to his name in nine matches He has averaged 16.Ganguly, in an interview with News18, said that both Rohit and Kohli are players of high calibre and will soon be back in form.\"They are great players and I am sure they will get back in form. I hope they start scoring runs soon. I don’t know what is going on in Virat Kohli’s head but I am sure he will regain his form and get some good runs. He is a great player,\" Ganguly said.Kohli's form in particular has become a cause for major concern. The batter who ruled the batting charts for many years has not scored a competitive hundred since 2019. In this IPL, for the first time, he registered consecutive first-ball ducks in the cash-rich league.Many former cricketers including Ravi Sharti and Kevin Pietersen have adviced Kohli to take a break from the game to recharge his batteries, while Yuvraj Singh has asked him to get back to his old self to find his form back.Meanwhile, Ganguly also shared his opinion on the ongoing IPL and latest pace sensation Umran Malik.\"Oh, it’s very interesting, I am watching [the IPL]. Any team can win and everyone is playing well. The two new teams - Gujrat Titans and Lucknow Super Giants - are doing well. Umran Malik’s bowling has been eye-catching. Umesh Yadav too has bowled well and so has Khalil Ahmed. I would say Umran Malik has been the outstanding face of the league so far,\" Ganguly added.Read all the Latest News, Trending News, Cricket News, IPL Live Score, IPL 2022 schedule, IPL 2022 Points table and Entertainment News. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-04-29 10:09:28","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/04/Virat-Kohli1.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL 2022 PBKS vs LSG Predicted XI: Will Lucknow replace Manish Pandey with Manan Vohra in today's match?","link":"https://zeenews.india.com/cricket/ipl-2022-pbks-vs-lsg-predicted-playing-xi-will-lsg-replace-manish-pandey-with-manan-vohra-in-todays-match-vs-punjab-kings-2458578.html","keywords":null,"creator":null,"video_url":null,"description":"Lucknow Super Giants and Punjab Kings will take on each other in Match 42 of IPL 2022 at the Maharashtra Cricket Association Stadium in Pune on April 29 (Friday).","content":null,"pubDate":"2022-04-29 09:59:00","full_description":"Lucknow Super Giants and Punjab Kings will take on each other in Match 42 of IPL 2022 at the Maharashtra Cricket Association Stadium in Pune on April 29 (Friday). Both teams are coming into this contest with a win in their respective last matches. One of the biggest headaches for LSG is their No 3 position. No batter who has been tried so far in this slot - Evin Lewis and Manish Pandey - have performed as per expectations. @im_manishpandey back in the nets prepping for the next big day. #IPL2022 _ #bhaukaalmachadenge #lsg #LucknowSuperGiants #T20 #TataIPL #Lucknow #UttarPradesh #LSG2022 pic.twitter.com/mFw8lI8cZi — Lucknow Super Giants (@LucknowIPL) April 27, 2022 Manish, in particular, has been struggling to get going, not being able to score runs with a healthy strike rate. Even in the last match, he scored a run-a-ball 22 which put extra pressure on KL Rahul. Problem with Manish at No 3 is that LSG then have two many anchors in their team. Rahul plays that role already and with Manish also playing cautiously or getting stuck at the crease, it affects the team's total at the end of the innings. The one good option in the team to replace Manish is Manan Vohra who is not new to IPL. He has played previously for RCB and PBKS. But has not got any chance so far at LSG. With Manish struggling for form, Vohra can be tried. The last call however is KL Rahul's. LSG Probable XI : Quinton de Kock (Wk), KL Rahul (C), Manan Vohra, Krunal Pandya, Deepak Hooda, Ayush Badoni, Marcus Stoinis, Jason Holder, Avesh Khan/Mohsin Khan, Dushmantha Chameera, Ravi Bishnoi PBKS Probable XI : Shikhar Dhawan, Mayank Agarwal (C), Bhanuka Rajapaksa, Liam Livingstone, Jonny Bairstow, Jitesh Sharma (Wk), Rishi Dhawan, Kagiso Rabada, Rahul Chahar, Arshdeep Singh, Sandeep Sharma","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"Happy Birthday Ashish Nehra: Wishes pour in for former India pacer as he turns 43","link":"https://www.firstpost.com/firstcricket/sports-news/happy-birthday-ashish-nehra-wishes-pour-in-for-former-india-pacer-as-he-turns-43-10613331.html","keywords":["First Cricket News"],"creator":["FP Trending"],"video_url":null,"description":"Happy Birthday Ashish Nehra: Wishes pour in for former India pacer as he turns 43","content":"Former India pacer Ashish Nehra turns 43 today, 29 April. The left-arm pacer, who made his debut in 1999 in a Test match against Sri Lanka is currently the head coach of debutant team Gujarat Titans in the on-going edition of the Indian Premier League.Born in 1979 in New Delhi, Nehra has represented India in all formats of the game. The pacer had the ability to swing the ball both ways and had subtle variations in his armoury as well.The pacer made his Test debut in 1999. Nehra had to wait for his ODI debut until 2001, when he played his maiden game against Zimbabwe at Harare. In his career, he has played 120 ODIs with 157 wickets to his name. The left-arm pacer also played for India in the T20 format, where he picked up 34 wickets in 27 matches.As the pacer turns a year older, below are few wishes for the cricketer:The Board of Control for Cricket in India (BCCI) wished the star player on his birthday, while highlighting his records in international matches. The official handle of Gujarat Titans also wished the pacer with a note saying \"To the smile that lights up our heart\". Even the official handle of Delhi Capitals wished the cricketer a great year, and praised his career \"from being a vital cog of the 2011 World Cup winning team to receiving a good farewell at Qila Kotla\". Here are few more reactions on his special day:    Nehra has proudly been part of the Men in Blue in major ICC tournaments such as 2011 World Cup as well as three Champions Trophies and two Asia Cups for the nation. After a 18-year-long career in international cricket, Nehra hung his boots after playing his last T20 match at Feroz Shah Kotla.","pubDate":"2022-04-29 09:38:12","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/01/Ashish-Nehra-land.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Tata IPL 2022 GT vs RCB Live Streaming: Gujarat Titans vs Royal Challengers Bangalore live coverage, venue, date, timing","link":"https://www.firstpost.com/firstcricket/sports-news/gujarat-titans-vs-royal-challengers-bangalore-indian-premier-league-live-streaming-today-check-gt-vs-rcb-live-coverage-venue-date-streaming-channel-date-time-10614411.html","keywords":["First Cricket News"],"creator":["FP Trending"],"video_url":null,"description":"Tata IPL 2022 GT vs RCB Live Streaming: Gujarat Titans vs Royal Challengers Bangalore live coverage, venue, date, timing","content":"Gujarat Titans vs Royal Challengers Bangalore live score streaming, IPL 2022: Royal Challengers Bangalore will be looking to shrug off their recent defeats when they lock horns with Gujarat Titans for the first time in this season of the Indian Premier League.Coming into this match, Gujarat Titans are at the top of the points table with seven wins and one loss while the Royal Challengers Bangalore are fifth with five wins and four losses.Wriddhiman Saha was superb for the Gujarat Titans in the last match and now they would want the likes of Shubman Gill and Hardik Pandya to make vital contributions.On the other hand, the Royal Challengers Bangalore have not had the expected results from their top order. Virat Kohli needs to score runs and captain Faf du Plessis has to rekindle some of the form he had shown earlier in the tournament.When will the Gujarat Titans and Royal Challengers Bangalore match be played?The GT vs RCB IPL 2022 match will take place on 30 April.Where will the Gujarat Titans and Royal Challengers Bangalore match be held?The GT vs RCB IPL 2022 match will be held at Mumbai’s Brabourne Stadium.What time will the Gujarat Titans and Royal Challengers Bangalore match start?The GT vs RCB IPL 2022 match will begin from 3:30 pm onwards. The toss will be held at 3 pm on the same day.Where can you watch GT vs RCB IPL 2022 match on TV and online?The GT vs RCB IPL 2022 match will be broadcast live on Star Sports Network channels — Star Sports 1 HD, Star Sports Select 1, Star Sports Select 1 HD (Dugout) and Star Sports 1. The GT vs RCB match will also be streamed live on Disney+ Hotstar.You can also follow firstpost.com to check out the live scores and commentary of the GT vs RCB IPL 2022 match.Complete Squads:Gujarat Titans: Hardik Pandya (c), Abhinav Manohar, David Miller, Gurkeerat Singh, B Sai Sudarshan, Shubman Gill, Rahul Tewatia, Vijay Shankar, Matthew Wade, Mohammed Shami, Rahmanullah Gurbaz, Wriddhiman Saha, Alzarri Joseph, Darshan Nalkande, Dominic Drakes, Jayant Yadav, Lockie Ferguson, Noor Ahmad, Pradeep Sangwan, Rashid Khan, Ravisrinivasan Sai Kishore, Varun Aaron, Yash DayalRoyal Challengers Bangalore: Faf du Plessis (c), Virat Kohli, Glenn Maxwell, Mohammed Siraj, Harshal Patel, Wanindu Hasaranga, Dinesh Karthik, Josh Hazlewood, Shahbaz Ahmed, Akash Deep,Sherfane Rutherford, Mahipal Lomror, Finn Allen, Jason Behrendorff, Suyash Prabhudesai, Chama Milind, Anuj Rawat, Aneeshwar Gautam, Karn Sharma, David Willey, Rajat Patidar, Siddharth KaulRead all the Latest News, Trending News, Cricket News, IPL Live Score, IPL 2022 schedule, IPL 2022 Points table and Entertainment News. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-04-29 09:19:16","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/04/Virat-Kohli-PBKS-RCB-IPL-2022-Sportzpics-640.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Cricket-Hussain warns Stokes against &#039;captaining by committee&#039;","link":"https://www.thestar.com.my/sport/cricket/2022/04/29/cricket-hussain-warns-stokes-against-039captaining-by-committee039","keywords":null,"creator":null,"video_url":null,"description":"LONDON (Reuters) - England's new test skipper Ben Stokes must learn to trust his own decisions rather than \"captain by committee\" and should perhaps limit his bowling responsibilities to prevent burnout, former captain Nasser Hussain said. Read full story","content":null,"pubDate":"2022-04-29 08:54:00","full_description":"LONDON (Reuters) - England's new test skipper Ben Stokes must learn to trust his own decisions rather than \"captain by committee\" and should perhaps limit his bowling responsibilities to prevent burnout, former captain Nasser Hussain said. Stokes was unveiled as Joe Root's successor on Thursday with England hoping for a turnaround in their test fortunes under the talismanic all-rounder. England won just one of their last 17 tests with Root at the helm, a run which included a 4-0 Ashes thrashing in Australia and a 1-0 series defeat in West Indies. \"The point is that Ben is his own man. He's driven, he's got a good cricket brain ...,\" Hussain wrote in his Daily Mail column. \"Ben will have to use his gut, and my only advice is that he shouldn't captain by committee. \"Sometimes with Root there was too much input from those off the field, so he never found a gut feel for tactics.\" Stokes has battled injuries in recent times and took a break last year to look after his mental health. Hussain said Rob Key, who was appointed the new managing director of England men's cricket earlier this month, would have to protect Stokes from burnout. \"Clearly, his workload will need managing. Key has to work out what, in golf terms, are his majors,\" added Hussain. \"For a team who have won just one out of 17 and are bottom of the World Test Championship, stringing together some victories is the No 1 priority.\" Hussain expected Stokes to either skip bilateral one-day series or play those purely as a batter \"Whatever happens, if he needs resting - and Stokes will have to be honest with Key and the selectors - then England should pay attention. \"There is no point bowling himself into the ground, which then affects the balance of the team. He should be England's fifth bowler, no more.\" Stokes begins his tenure with a two-test series against the country of his birth, New Zealand, in June. (Reporting by Amlan Chakraborty in New Delhi; editing by Peter Rutherford)","image_url":"https://apicms.thestar.com.my/uploads/images/2022/04/29/1569343.jpg","source_id":"thestar_my","country":["malaysia"],"category":["sports"],"language":"english"}]}