{"newsArray":[{"title":"Thrilling Cricket on day one of Batball Nile Edition","link":"https://kawowo.com/2022/12/17/thrilling-cricket-on-day-one-of-batball-nile-edition/","keywords":["Cricket"],"creator":["Denis Musali"],"video_url":null,"description":"Event: Batball Open Nile Edition Day OneVenue: Jinja SS Cricket Oval Summary of Day One GamesBuutu Vs EmpunguBuutu 90/5 in 10 oversEmpungu 55/4 in 10 oversBuutu won by 35 runs Amakubi Vs AmakokotaziAmakubi 63/5 in 10 oversAmakokotazi 64/4 in 10 oversAmakokotazi won by 6 wickets Buutu Vs AmakokotaziBuutu 71/5 in 10 oversAmakokotazi 47/4 in 10 […] The post Thrilling Cricket on day one of Batball Nile Edition appeared first on Kawowo Sports.","content":"Event: Batball Open Nile Edition Day One Venue: Jinja SS Cricket Oval Buutu Vs Empungu Buutu 90/5 in 10 overs Empungu 55/4 in 10 overs Buutu won by 35 runs Amakubi Vs Amakokotazi Amakubi 63/5 in 10 overs Amakokotazi 64/4 in 10 overs Amakokotazi won by 6 wickets Buutu Vs Amakokotazi Buutu 71/5 in 10 overs Amakokotazi 47/4 in 10 overs Buutu won by 24 runs Empungu Vs Amakubi Empugu 49/7 in 10 overs Amakubi 52/3 in 7.3 overs Amakubi won y 7 wickets Amakubi Vs Buutu Amakubi 58/4 in 10 overs Buutu 62/4 in 8.1 overs Buutu won by 6 wickets After successfully hosting the 1st Bat Ball regional tournament in Soroti City last weekend, the second tournament was hosted by Jinja City at the Jinja SSS Oval. The second tournament was locally organized by the Jinja Association of Cricket Clubs (JACC) and as has been the norm for each tournament to support a local social cause, the Nile edition has been about the ending of teenage pregnancies in the Nile region. The Nile edition had four teams featuring in it, Buutu, Amakubi, Amakokotazi, and Empungu battling for bragging rights over the two days of action. The games were played on a T10 format and were available to the World via a live stream on Batball.TV. Aggressiveness and passion were some of the key factors that headlined most of the games that were played with a number of good strikes from the players. Buutu was the better team of day one, as they went on to win all their three games of the day. Buutu currently tops the table of four and their phenomenal performance earned them an automatic qualification to the finals that will be played on Sunday 18th December 2022. Amakokotazi, Amakubi, and Empungu also have a chance to meet Buutu at the finals as there will be playoff games that shall determine who joins Buutu at the finals. Four games shall be played tomorrow to complete the tournament fixture with the best 16 players from the tournament earning a big chance to represent the region at Batball X next year. There will be more to play and fight for as Batball Open Nile Edition takes the final day tomorrow.","pubDate":"2022-12-17 18:36:54","image_url":null,"source_id":"kawowo","country":["uganda"],"category":["sports"],"language":"english"},{"title":"Travis Head puts Australia in charge against South Africa after Warner’s duck - The Guardian","link":"https://news.google.com/__i/rss/rd/articles/CBMiXmh0dHBzOi8vd3d3LnRoZWd1YXJkaWFuLmNvbS9zcG9ydC8yMDIyL2RlYy8xNy9hdXN0cmFsaWEtc291dGgtYWZyaWNhLWZpcnN0LXRlc3QtZGF5LW9uZS1yZXBvcnTSAV5odHRwczovL2FtcC50aGVndWFyZGlhbi5jb20vc3BvcnQvMjAyMi9kZWMvMTcvYXVzdHJhbGlhLXNvdXRoLWFmcmljYS1maXJzdC10ZXN0LWRheS1vbmUtcmVwb3J0?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Travis Head puts Australia in charge against South Africa after Warner’s duck  The GuardianNew ball dominates before Head fights fire with fire | Australia v South Africa 2022-23  cricket.com.auHeartbreak for Steve Smith in late twist  news.com.auA snapshot of day one of the first Test  The Canberra TimesFLEM'S VERDICT: Herculean Head worthy of Gilchrist comparisons... but don't count out South Africa just yet  The RoarView Full coverage on Google News","content":null,"pubDate":"2022-12-17 17:57:00","image_url":null,"source_id":"google","country":["australia"],"category":["sports"],"language":"english"},{"title":"AUS vs SA 1st test: ऑस्ट्रेलिया के खिलाफ दक्षिण अफ्रीका के इस खिलाड़ी ने पकड़ा इस साल का बेस्ट कैच! देखें VIDEO","link":"https://www.abplive.com/sports/cricket/aus-vs-sa-1st-test-south-african-player-khaya-zondo-probably-took-the-2022-s-best-catch-see-video-2284691","keywords":["Cricket"],"creator":["ABP Live"],"video_url":null,"description":"AUS vs SA 1st test: ऑस्ट्रेलिया और दक्षिण अफ्रीका के बीच तीन टेस्ट मैचों की सीरीज़ का पहला मैच खेला जा रहा है. यह मैच गाबा, ब्रिस्बेन में खेला जा रहा है. इस मैच में पहले ही दिन कई कारनामे देखने को मिले, इसमें से एक डेविड वॉर्नर का कैच भी रहा. पहले बल्लेबाज़ी करने उतरी दक्षिण अफ्रीका की टीम टी ब्रेक से पहले ही 152 रनों पर सिमट गई. इसके बाद अपनी पहली पारी के लिए बल्लेबाज़ी करने आई ऑस्ट्रेलियाई टीम ने पहले दिन का खेल खत्म होने तक 145 रनों पर 5 विकेट गंवा दिए. इसमें अफ्रीका ने पहली गेंद पर शानदार कैच के ज़रिए विकेट झटक लिया. इस कैच को साल का सर्वश्रेष्ठ कैच भी कहा जा सकता है. इस खिलाड़ी ने पकड़ा हैरानी भरा कैच ऑस्ट्रेलियाई ओपनर डेविड वॉर्नर पारी की पहली ही गेंद पर आउट होकर पवेलियन लौटे. अफ्रीका की तरफ से पारी का पहला ओवर फेंकने आए कगीसो रबाडा ने वॉर्नर को एक खास रणनीति के तहत चलता किया. रबाडा ने वॉर्नर के लिए शॉर्ट लेग पर खाया ज़ोंडो को लगा दिया था. उन्होंने फील्डिंग के हिसाब से पहली गेंद हल्की की शॉर्ट वॉर्नर की बॉडी पर फेंकी और वॉर्नर खुद को बचाने के लिए बल्ला आगे लेकर आए, गेंद बल्ले से लगते ही शॉर्ट लेग पर खड़े खाया ज़ोंडो की तरफ गई और उन्होंने उछलकर एक शानदार कैच पकड़ा. ज़ोंडो का यह कैच वाकई हैरान कर देने वाला था. वायरल हो रही वीडियो में आप देख सकते हैं कि उन्होंने किस शानदार तरीके से इस कैच को लपका. Zondo pulls it in! 😱Rabada removes Warner off the first ball of the innings! #PlayOfTheDay #AUSvSA | @nrmainsurance pic.twitter.com/7nwJkAqD0X — cricket.com.au (@cricketcomau) December 17, 2022 गेंदबाज़ों का रहा दबदबा गाबा में पहले दिन गेंदबाजों का दबदबा देखने को मिला. पहले ही दिन कुल 15 विकेट गिरे. गाबा की पिच से गेंदबज़ों को काफी मदद मिल रही है. अफ्रीका की बल्लेबाज़ी में ऑस्ट्रेलियाई गेंदबाज़ मिचेल स्टार्क और नाथन लायन ने 3-3 विकेट अपने नाम किए. जबकि पेट कमिंस और बोलैंड ने 2-2 विकेट झटके. इसके बाद ऑस्ट्रेलिया की पारी में कगीसो रबाडा और एनरिक नॉर्किया अब तक 2-2 अपने नाम कर चुके हैं. वहीं मार्को जेनसन ने एक विकेट चटकाया लिया है.  ये भी पढ़ें... Bumrah-Jadeja Injury Update: जल्द मैदान पर वापसी करेंगे जसप्रीत बुमराह और रविंद्र जडेजा, इस सीरीज़ में आएंगे नज़र","content":"AUS vs SA 1st test: ऑस्ट्रेलिया और दक्षिण अफ्रीका के बीच तीन टेस्ट मैचों की सीरीज़ का पहला मैच खेला जा रहा है. यह मैच गाबा, ब्रिस्बेन में खेला जा रहा है. इस मैच में पहले ही दिन कई कारनामे देखने को मिले, इसमें से एक डेविड वॉर्नर का कैच भी रहा. पहले बल्लेबाज़ी करने उतरी दक्षिण अफ्रीका की टीम टी ब्रेक से पहले ही 152 रनों पर सिमट गई. इसके बाद अपनी पहली पारी के लिए बल्लेबाज़ी करने आई ऑस्ट्रेलियाई टीम ने पहले दिन का खेल खत्म होने तक 145 रनों पर 5 विकेट गंवा दिए. इसमें अफ्रीका ने पहली गेंद पर शानदार कैच के ज़रिए विकेट झटक लिया. इस कैच को साल का सर्वश्रेष्ठ कैच भी कहा जा सकता है. इस खिलाड़ी ने पकड़ा हैरानी भरा कैच ऑस्ट्रेलियाई ओपनर डेविड वॉर्नर पारी की पहली ही गेंद पर आउट होकर पवेलियन लौटे. अफ्रीका की तरफ से पारी का पहला ओवर फेंकने आए कगीसो रबाडा ने वॉर्नर को एक खास रणनीति के तहत चलता किया. रबाडा ने वॉर्नर के लिए शॉर्ट लेग पर खाया ज़ोंडो को लगा दिया था. उन्होंने फील्डिंग के हिसाब से पहली गेंद हल्की की शॉर्ट वॉर्नर की बॉडी पर फेंकी और वॉर्नर खुद को बचाने के लिए बल्ला आगे लेकर आए, गेंद बल्ले से लगते ही शॉर्ट लेग पर खड़े खाया ज़ोंडो की तरफ गई और उन्होंने उछलकर एक शानदार कैच पकड़ा. ज़ोंडो का यह कैच वाकई हैरान कर देने वाला था. वायरल हो रही वीडियो में आप देख सकते हैं कि उन्होंने किस शानदार तरीके से इस कैच को लपका. Zondo pulls it in! 😱 googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); News Reels Rabada removes Warner off the first ball of the innings! #PlayOfTheDay #AUSvSA | @nrmainsurance pic.twitter.com/7nwJkAqD0X — cricket.com.au (@cricketcomau) December 17, 2022 गेंदबाज़ों का रहा दबदबा गाबा में पहले दिन गेंदबाजों का दबदबा देखने को मिला. पहले ही दिन कुल 15 विकेट गिरे. गाबा की पिच से गेंदबज़ों को काफी मदद मिल रही है. अफ्रीका की बल्लेबाज़ी में ऑस्ट्रेलियाई गेंदबाज़ मिचेल स्टार्क और नाथन लायन ने 3-3 विकेट अपने नाम किए. जबकि पेट कमिंस और बोलैंड ने 2-2 विकेट झटके. इसके बाद ऑस्ट्रेलिया की पारी में कगीसो रबाडा और एनरिक नॉर्किया अब तक 2-2 अपने नाम कर चुके हैं. वहीं मार्को जेनसन ने एक विकेट चटकाया लिया है. ये भी पढ़ें... Bumrah-Jadeja Injury Update: जल्द मैदान पर वापसी करेंगे जसप्रीत बुमराह और रविंद्र जडेजा, इस सीरीज़ में आएंगे नज़र var _fireSc=!0;document.addEventListener(\"scroll\",(e=>{if(_fireSc){var c=document.createElement(\"script\");c.src=\"//asset.fwpub1.com/js/embed-feed.js\",c.async=!0,document.getElementsByTagName(\"head\")[0].appendChild(c),_fireSc=!1}}));","pubDate":"2022-12-17 17:46:08","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2022/12/17/36724dbc995dc6cc4c863e86084a55b51671298979193582_original.jpg","source_id":"abplive","country":["india"],"category":["sports"],"language":"hindi"},{"title":"Rumble In Kampala: Ouma arrives in Uganda prior to Okwiri bout on Boxing Day","link":"https://kawowo.com/2022/12/17/rumble-in-kampala-ouma-arrives-in-uganda-prior-to-okwiri-bout-on-boxing-day/","keywords":["Boxing"],"creator":["David Isabirye"],"video_url":null,"description":"Legendary professional boxer Kassim “The Dream” Ouma has arrived in Uganda prior to his high profile fight against Kenyan Rayton “Boom-Boom” Okwiri. Ouma, 44, arrived at Entebbe International Airport on Saturday afternoon oozing with confidence from Germany where he has been pitching camp for the past five years now since relocating from the United States […] The post Rumble In Kampala: Ouma arrives in Uganda prior to Okwiri bout on Boxing Day appeared first on Kawowo Sports.","content":"Kassim \"The Dream\" Ouma will face Kenya's Rayton \"Boom-Boom\" Okwiri during a 10 round middle weight contest at the Lugogo Cricket Oval in Kampala on 26th December 2022 (Boxing Day) Legendary professional boxer Kassim “The Dream” Ouma has arrived in Uganda prior to his high profile fight against Kenyan Rayton “Boom-Boom” Okwiri. Ouma, 44, arrived at Entebbe International Airport on Saturday afternoon oozing with confidence from Germany where he has been pitching camp for the past five years now since relocating from the United States of America (USA). “I am happy to be home. I want to put up a special display and inspire many youngsters” Ouma who was flanked by Salim Uhuru (president of Uganda Professional Boxing Commission) revealed. The former IBF Junior Middle weight World Cup will take on the two time Kenyan Olympian in a 10 round middle weight contest. Ouma has played as many as 47 fights. Of these, he has won 29 bouts (18 by knockout and 11 by decision), 16 losses (4 by knock outs and 12 by decision) and one draw. This will be his first ever professional fight in Uganda and the second on the African continent after the bout against Adam Katumwa that was held in Okapi Hotel, Kigali – Rwanda. His opponent Rayton Okwiri from Kenya has fought 6 times with 5 wins (4 knock-outs and 1 by decision), with one draw. He won over four Tanzanians Hussein Itaba, Pascal Kimaru, Salehe Mkalekwa and Daudi Imano Kawalya as well as over country mate Patrick Amote. The draw was against American Aleem Moshea on 19 October 2017 at May Flower Hotel, Washington D.C. There are , Lugogo Cricket Oval during a boxing bonanza dubbed “Rumble in Kampala”. The co-main fight will be in the heavy weight category between Uganda’s Yusuf Babu and Tanzanian Alphonce Muchumiatumbo for 8 rounds. Olympian David “De Animal” Ssemujju will face off with Tanzania’s Salehe Mkalekwa in the uper-welter weight for the regional title that will last 12 rounds. : In the Light-Welter weight category, Isaac “Spartaa” Ssebuufu takes on Mubarak “Senor” Sseguya for 10 rounds. The other light-welter bouts will witness Farahat “King Falat” Manirola against Jamilu “Mr Pantsman” Kayiwa for 8 rounds and Swalik “Tyson” Kisitu against Richard Ndifuna (8 rounds). Kamada “Sure-Fire” Ntege shall square up against Medi “Cobra” Bukenya in Super-Middle (10 rounds). : Henry “Stopper” Kasujja, making his third professional fight will face off the veteran fighter Robert “Ring Doctor” Kamya in Super Welter (8 rounds). There will be three light heavy fights, all lasting for 8 rounds each. Hamza “Champion” Latigo will play Taafu “Tough” Odoyi, Saulo “Mr Bad Intentions” Male against Saidi Chako and Abdul “Breaker-Breaker” Njego plays Jamada Wangobola. Meanwhile, Umar Badru “Faza Lee” Nyombi shall take on Yasin Kakungulu (4 Rounds) in the Cruiserweight category. For the Bantamweight, Rogers “Bantam” Kamulegeya squares up against Isma “Afaba” Ssekitto (8 rounds) as Conrad “King Kong” Sseruyange will take on Ali “Messiah” Mirembe in Super Feather weight category (six rounds). The promoter of Rumble in Kampala is Stephen Sembuya Magulu under the 12 Rounds Sports Promotion. The match maker Ali Faisal Ashinda. “We have organized the best match-ups and the bouts will be interesting. We encourage all the boxing fanatics to turn up on Boxing Day at the Lugogo Cricket Oval in Kampala for these fights that will be climaxed by Kassim Ouma against Rayton Okwiri fight. We promised the best organization on the day” Ashinda reveals. Uganda Professional Boxing Commission (UPBC) has commissioned all the fights. The main organizers are 12 Rounds Sports Promotions, Yuvraj Tvs, Uhuru Restaurant, African Chocolate Company, Visage Salon, Bukedde TV 1 :","pubDate":"2022-12-17 17:29:12","image_url":null,"source_id":"kawowo","country":["uganda"],"category":["sports"],"language":"english"},{"title":"Cricket: Black Caps spinner Ish Sodhi tightens approach to earn test spot on Pakistan tour","link":"https://www.nzherald.co.nz/sport/cricket-black-caps-spinner-ish-sodhi-tightens-approach-to-earn-test-spot-on-pakistan-tour/MPELDWYCARCXLEXG3RRC26MDME/","keywords":null,"creator":null,"video_url":null,"description":"There was one element of his test recall that sparked particular joy for Ish Sodhi.","content":"There was one element of his test recall that sparked particular joy for Ish Sodhi. The legspinner was this week included in the Black Caps squad for their two-match series against Pakistan, having waited more than four years since the last of his 17 test appearances. After hearing the good news, Sodhi was quick to dig through the clutter that had accumulated during his long wait, keen to locate a prized possession. “It’s obviously a huge privilege being called back into the test side after four years,” Sodhi said. “It’s really exciting to be back and packing the baggy especially. “She’s a little bit dusty. It was actually quite nice to go and find it and dust it off a little bit and chuck it in the bag. “I’ve been on a lot of tours recently, and it’s been awesome playing white-ball cricket, but it’s really exciting and you’re filled with honour and privilege to be able to pack it and take it away.” Sodhi is certainly no stranger to the international game. He’s played 71 matches for the Black Caps since last pulling on that treasured baggy hat, part of an innings defeat by Pakistan in Dubai in 2018. The 30-year-old has shone brightest in T20 cricket - in October becoming the fifth man to collect 100 international wickets - and believes his success with a white ball can translate now more than ever to the test arena. Advertisement Advertise with NZME. But Sodhi did concede he occasionally wondered whether he would get another opportunity to put that theory into practice. “I would be lying if I said I didn’t [have doubts],” he said. “There were times that a lot of white-ball cricket was being played and you start to focus a lot of your attention on that. “But the gap’s gotten smaller in terms of what works in white-ball cricket will potentially work in red-ball cricket, as batters are becoming a lot more aggressive these days. “It’s pretty exciting and a bit of new territory - I haven’t played test cricket in a long time. There’s a little bit of learning as I go, which is funny to say at 30.” One recent lesson has particularly enhanced Sodhi’s threat at the bowling crease, lengthening his run up to generate more speed through the air, a factor he thinks will assist him on potentially docile Pakistani pitches. “The big thing that I’ve changed recently has been my run up, just to get a bit more energy to the crease,” he said. “It’s made my lines a little bit more consistent, and hopefully that helps me when I do get the chance to play some red-ball cricket again. “Although it’s in Asia, I don’t think the wickets have been turning a hell of a lot, so you’ve got to work out ways to get dismissals. It’s about bringing both edges into play - that’s going to be really important - and bowling a slightly quicker pace.” Although honing his approach in T20 cricket had proven crucial to his chances of starting the first test in Karachi on Boxing Day, it wasn’t just his cap that Sodhi was looking forward to leaving behind. Advertisement Advertise with NZME. “It’s really exciting to be able to go out there, potentially bowl some long spells and not necessarily have everyone try to hit you for six from every ball.” Save share Share this article Reminder, this is a Premium article and requires a subscription to read. facebook copy link twitter linkedin reddit email","pubDate":"2022-12-17 17:00:00","image_url":"https://www.nzherald.co.nz/resizer/L5HDeeesLqwYvtEvnEJmGb1M32U=/300x300/smart/filters:quality(70)/cloudfront-ap-southeast-2.images.arcpublishing.com/nzme/DY3G335N5RC27EEAJJC4NJEJDY.JPG","source_id":"nzherald","country":["new zealand"],"category":["sports"],"language":"english"},{"title":"Victoria Pearls fall to Tanzania In Nairobi","link":"https://kawowo.com/2022/12/17/victoria-pearls-fall-to-tanzania-in-nairobi/","keywords":["Cricket"],"creator":["Denis Musali"],"video_url":null,"description":"Match 4: Uganda W v Tanzania Tanzania 116/8 Uganda 102/8 Tanzania won by 12 runs The Victoria Pearls lost their 1st match at the Kenya Women’s T20I tournament going down by 12 runs against Tanzania. Uganda won the toss and elected to bowl 1st. Victoria Pearls have dominated the last three wins because of their […] The post Victoria Pearls fall to Tanzania In Nairobi appeared first on Kawowo Sports.","content":"Match 4: Uganda W v Tanzania Tanzania 116/8 Uganda 102/8 Tanzania won by 12 runs The Victoria Pearls lost their 1st match at the Kenya Women’s T20I tournament going down by 12 runs against Tanzania. Uganda won the toss and elected to bowl 1st. Victoria Pearls have dominated the last three wins because of their opening bowling combination of Irene Alumo and Evelyn Anyipo. Once they were put off their lines today, Tanzania was able to grow into the game eventually finishing on 116. In ladies’ cricket especially against sides that are evenly matched anything over 100 is more or less the winning runs. In the chase, Uganda lost the steady Kevin Awino very early but Janet Mbabazi (33) got a promotion to number 3 and held the Uganda innings together for most of the innings. However, Uganda kept losing wickets and this led the asking rate to keep going up. Rita Musamali (24) provided some flashes with the blade down the order but in the end, Uganda was short by 12 runs. Uganda lost by 12 runs and will blame themselves for gifting Tanzania 16 extras which in the end made the difference. The Victoria Pearls will also have to rethink the idea of batting second, apart from Captain Consy Aweko batting at number 9 none of the other batters has a strike rate over 90, which means that any challenging total will be a big task for them to chase down. The Victoria Pearls will be in action tomorrow as they take old enemy Kenya. The winner of this clash will be sure to play in the final.","pubDate":"2022-12-17 16:37:22","image_url":null,"source_id":"kawowo","country":["uganda"],"category":["sports"],"language":"english"},{"title":"Ramiz Raja likely to be removed as Pakistan Cricket Board chief, Here's why","link":"https://www.indiatvnews.com/sports/cricket/ramiz-raja-likely-to-be-removed-as-pakistan-cricket-board-chief-here-s-why-pakistan-vs-england-pak-vs-eng-2022-12-17-832026","keywords":null,"creator":null,"video_url":null,"description":"Ramiz Raja is likely to be removed as chairman of the Pakistan Cricket Board. This news comes after the national team's back-to-back Test defeats to England at home.","content":null,"pubDate":"2022-12-17 15:41:05","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"Was nervous initially but it was not difficult adjusting to Test after a long break: Kuldeep","link":"https://www.sentinelassam.com/sports/cricket/was-nervous-initially-but-it-was-not-difficult-adjusting-to-test-after-a-long-break-kuldeep-628596","keywords":["Sports,Cricket"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"India's left-arm spinner Kuldeep Yadav said on Friday that he faced neither pressure nor adjustment issues playing in the first Test against Bangladesh","content":"CHATTOGRAM: India's left-arm spinner Kuldeep Yadav said on Friday that he faced neither pressure nor adjustment issues playing in the first Test against Bangladesh, his first five-day match after nearly two years, at the Zahur Ahmed Chowdhury Stadium, here.Kuldeep Yadav completed his third five-for in the eighth Test match -- a career-best 5 for 40 and India bowled out Bangladesh for just 150, taking a lead of a massive 254-run lead. But the 28-year-old spinner said he did not experience any trouble in adjusting to Test cricket as he was not totally cut off from cricket, being involved in white-ball cricket for India. \"Kahne ke liye toh do saal hain par mujhe kabhi feel hi nahi huwa kyun ki main white-ball cricket khel raha tha (It might be nearly two years (22 months) but I never felt it that way because I was involved in white-ball cricket),\" Yadav told the media at the end of the third day's proceedings in Chattogram on Friday. Yadav said he did not feel any pressure playing his first Test in nearly two years as he was playing some form of cricket after gaining fitness following a knee surgery in 2021. The pace of the game and the formations may be a bit different but I did not face difficulty adapting to Test cricket, said Yadav. \"I was playing white-ball cricket since my comeback from injury -- playing T20 and One-day cricket. In between, I also played red-ball cricket for India A against New Zealand A and I bowled a long spell. Because of my bowling style, I did't find it much more difficult to switch from white-ball to red-ball cricket. \"Of course, I was a bit nervous as I was playing red-ball cricket after a long gap but I was not thinking about my performance. The formation is quite different and so are the field positions, you need to have more control in Test cricket -- so I was a bit nervous about these things but I felt quite good at the end of the first innings,\" said Kuldeep Yadav. Having scored a vital 40 off 114 balls batting down the order in India's first innings, Yadav said the pitch was perfect for batting. \"I believe it was a perfect wicket to bat on. I batted for 20 overs and it was really good to bat against spinners as well. Me and Ash bhai (R Ashwin) were initially looking at a first innings score of 360 but as time passed, batting became easier so we looked at a 400-run total. \"It's just keeping low sometimes and the odd ball is turning a bit. I think the wicket will remain the same. Probably on the fourth day, we will get more turn from spinners. So, we are hoping that in the second innings we will probably get more turn compared to the first innings,\" Yadav added. He did not agree to the suggestion that India delayed declaring their second innings as they were afraid (of Bangladesh chasing the target). IANS Also Read:  Trying to be a bit better with rhythm, which helps in pace turn, says left-arm wrist-spinner Kuldeep Also Watch:","pubDate":"2022-12-17 15:23:52","image_url":"https://assets.sentinelassam.com/h-upload/2022/12/17/422412-kul.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"TVNZ becomes New Zealand Cricket's domestic broadcaster for next three seasons","link":"https://www.sentinelassam.com/sports/cricket/tvnz-becomes-new-zealand-crickets-domestic-broadcaster-for-next-three-seasons-628593","keywords":["Sports,Cricket"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"TVNZ has become the exclusive domestic broadcaster for all New Zealand mens and womens international matches at home, as well as Super Smash matches for three years.","content":"AUCKLAND: TVNZ has become the exclusive domestic broadcaster for all New Zealand mens and womens international matches at home, as well as Super Smash matches for three years. The deal between TVNZ and New Zealand Cricket (NZC) will run from the start of the 2023/24 home summer until the end of the 2025/26 season. The decision comes due to Spark's decision to exit the sports streaming market — announced by the company on Friday morning.It means that more than 300 international and domestic cricket matches will be screened live on a combination of TVNZ1 and Duke over the agreed three-year period. In addition, the fixtures will also be streamed live on TVNZ+. IANS Also Read:  Kyle Jamieson looking to IPL for return to New Zealand set-upAlso Watch:","pubDate":"2022-12-17 15:05:44","image_url":"https://assets.sentinelassam.com/h-upload/2022/12/17/422409-tvnz.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"Rehan Ahmed earns maiden call up, to become youngest English Test cricketer","link":"https://www.sentinelassam.com/sports/cricket/rehan-ahmed-earns-maiden-call-up-to-become-youngest-english-test-cricketer-628592","keywords":["Sports,Cricket"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"Teenage leg-spinner Rehan Ahmed will become England’s youngest men’s Test cricketer after being handed his debut in the final game of the three-match series against Pakistan.","content":"KARACHI: Teenage leg-spinner Rehan Ahmed will become England's youngest men's Test cricketer after being handed his debut in the final game of the three-match series against Pakistan.The Leicestershire player will be 18 years and 126 days when the final Test begins on Saturday, beating the record of Brian Close, who was 18 years and 149 days when he played against New Zealand in July 1949. Ahmed is one of two changes to the England side for the third and final Test. The leg-spinner Rehan and wicketkeeper Ben Foakes come into the XI, in place of seamer James Anderson and off-spinning all-rounder Will Jacks. Earlier this year, Ahmed impressed in the ICC U19 Men's Cricket World Cup as England's second-highest wicket-taker with 12 wickets in four matches at an average of 12.58. England, who are leading the three-Test series 2-0, seek a historic 3-0 series sweep and a ninth win in 10 Tests since Ben Stokes became captain and Brendon McCullum head coach. England XI: Zak Crawley, Ben Duckett, Ollie Pope, Joe Root, Harry Brook, Ben Stokes (c), Ben Foakes, Rehan Ahmed, Ollie Robinson, Mark Wood, Jack Leach. IANS Also Read:  Uncapped Rehan Ahmed added to England Test squad Also Watch:","pubDate":"2022-12-17 14:57:56","image_url":"https://assets.sentinelassam.com/h-upload/2022/12/17/422408-youngest-copy.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"Azhar Ali to retire from Test cricket after England series","link":"https://www.sentinelassam.com/sports/cricket/azhar-ali-to-retire-from-test-cricket-after-england-series-628590","keywords":["Sports,Cricket"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"Azhar Ali, considered as one of Pakistan’s most successful batters in red-ball cricket, announced on Friday that he would be retiring from Test cricket following the third and final match of the series against England","content":"KARACHI: Azhar Ali, considered as one of Pakistan's most successful batters in red-ball cricket, announced on Friday that he would be retiring from Test cricket following the third and final match of the series against England, which begins on Saturday.The Karachi Test against England will be Ali's last and 97th Test match for Pakistan, since he made his debut in the format against Australia at Lord's in 2010. Till now, he has amassed 7,097 runs in 96 matches at an average of 42.49, including 19 centuries and 35 half-centuries. \"It has been a great honour and privilege for me to represent my country at the highest level. Deciding on when to call it a day is always tough, but, after contemplating deeply, I realised that this is the right time for me to retire from Test cricket. There are many people who I am grateful to in this strenuous, yet beautiful journey. I want to make a special mention of my family without whose sacrifices; I would not have been where I am today. My parents, wife, siblings, and children have been my strength throughout,\" said Ali in an official statement by the Pakistan Cricket Board (PCB). Ali is also Pakistan's fifth leading run-getter in Test cricket behind legendary batters Younis Khan (10,099), Javed Miandad (8,832), Inzamam-ul-Haq (8,829) and Mohammad Yousuf (7,530). In 2010, Azhar, shortly after his Test debut as a 25-year-old, scored his maiden Test half-century in only his Test second match. IANS Also Read:  Shafique, Azhar firm in response to Australia's 391 Also Watch:","pubDate":"2022-12-17 14:48:11","image_url":"https://assets.sentinelassam.com/h-upload/2022/12/17/422406-azhar-ali-pakistan-test-cricket5998060.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"Prem’s ton wins a thriller for SA Amberpet at HCA A3 division league","link":"https://telanganatoday.com/prems-ton-wins-a-thriller-for-sa-amberpet-at-hca-a3-division-league","keywords":["News","Sport","HCA","HCA A3 division league","Hyderabad"],"creator":["Telangana Today"],"video_url":null,"description":"G Prem scored 102 runs as his side SA Amberpet recorded a close one-wicket victory over Picket CC in the HCA A3 division","content":"Hyderabad: G Prem scored 102 runs as his side SA Amberpet recorded a close one-wicket victory over Picket CC in the HCA A3 division one-day league in Hyderabad on Saturday. In another match, Dinakar Kadhas slammed an unbeaten 106 topower Tarnaka to a seven-wicket victory. Brief Scores: Picket CC 197 in 30 overs (G Prem 3/32) bt SA Amberpet 161/9 in 30 overs (G Prem 102); Mahbub College 209/7 in 30 overs (Sumeeth 52) bt Adnan CC 101 in 23 overs (M Pavan 4/26); Gunrock 160 in 39 overs (Shiva Karthik 3/8) lost to Satya CC 164/8 in 38 overs (Ameer 55no; Akshith 3/30, Shashank 3/30); AB Colony 158 in 45 overs lost to Tarakarama 160/3 in 24.3 overs (Dinakar Kadhas 106no); Raju Cricket Academy 75 in 14.2 overs (R Mahender 3/16) lost to Sutton CC 78/5 in 12.4 overs.","pubDate":"2022-12-17 14:38:00","image_url":null,"source_id":"telanganatoday","country":["india"],"category":["sports"],"language":"english"},{"title":"Australia really tough place to play cricket, but rewarding too if one can get things right: Elgar","link":"https://www.sentinelassam.com/sports/cricket/australia-really-tough-place-to-play-cricket-but-rewarding-too-if-one-can-get-things-right-elgar-628588","keywords":["Sports,Cricket"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"On the eve of playing their first Test against Australia at The Gabba, South Africa captain Dean Elgar has described the opportunity to play in the country as ‘surreal’ and a ‘privilege’.","content":"BRISBANE: On the eve of playing their first Test against Australia at The Gabba, South Africa captain Dean Elgar has described the opportunity to play in the country as 'surreal' and a 'privilege'.Australia and South Africa will begin their three-match series at Brisbane on Saturday with the visitors hoping to build on their outstanding red-ball record in the country where they have won their last three series. \"(It takes) a lot of courage (to win in Australia). You have to have the mindset of playing to win. It's kind of something that I've been speaking at length about within our group, within our squad.\" \"Australia's a really tough place to play cricket but it's also such a rewarding place to play if you can get things right. You've got to take your opportunities and that kind of ties in with general Test cricket around the world.\" \"Playing Test cricket in Australia is such a privilege and you've got to go beyond what you're used to. You have to actually savour the moment, it's massive, and the legacy and history of South African cricket and Australian cricket are so rich. And we're just another talented group that can achieve something great in the future,\" he said in the pre-match press conference. South Africa have little experience playing at the famous Gabba - the only time they played there post-isolation was in 2012 when they drew with the hosts. That inexperience there is a good thing, according to Elgar, under whom South Africa are currently in second place in the World Test Championship (WTC) tally. IANS Also Read:  Warner, Starc return to Australia side in two-match T20I series Also Watch:","pubDate":"2022-12-17 14:35:36","image_url":"https://assets.sentinelassam.com/h-upload/2022/12/17/422404-austre.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"Mitchell Marsh reveals dealing with ankle injury for 12 months before surgery","link":"https://www.sentinelassam.com/sports/cricket/mitchell-marsh-reveals-dealing-with-ankle-injury-for-12-months-before-surgery-628585","keywords":["Sports,Cricket"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"Australias fast-bowling all-rounder Mitchell Marsh has revealed that he had been dealing with the ankle injury for 12 months before undergoing a surgery which has ruled him out of action till the Test tour of India next year.","content":"'Got a bit unenjoyable'NEW DELHI: Australias fast-bowling all-rounder Mitchell Marsh has revealed that he had been dealing with the ankle injury for 12 months before undergoing a surgery which has ruled him out of action till the Test tour of India next year. Now, on the road to recovery after undergoing a surgery to remove loose bone fragments and repair cartilage of his troublesome left ankle, Marsh believes he made the right call to go under the knife as the issue meant cricket had become a bit unenjoyable for him in those 12 months. \"Probably about 12 months I carried the injury for. It's obviously not ideal, but with the landscape of cricket these days being 12 months of the year, most guys carry things throughout the whole year,\" said Marsh on SEN WA Breakfast show. \"Mine sort of got to the point where (cricket) sort of got a bit unenjoyable to be honest and I want to enjoy playing my cricket and have a long time left in my career hopefully. This is all done on the basis that it's going to help me play as an all-rounder for the next five years at least and I'm really glad I got it done.\" It's probably not until you stop playing that you realise how sore you were at times. I want to be fully fit and play as an all rounder and play as much cricket for Australia as I possibly can,\" he added. IANS Also Read:  Warner, Starc return to Australia side in two-match T20I seriesAlso Watch:","pubDate":"2022-12-17 14:10:29","image_url":"https://assets.sentinelassam.com/h-upload/2022/12/17/422399-mitchell.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"Williamson took Blackcaps to unprecedented success in Test: Brendon Mc Cullum","link":"https://www.sentinelassam.com/sports/cricket/williamson-took-blackcaps-to-unprecedented-success-in-test-brendon-mc-cullum-628584","keywords":["Sports,Cricket"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"Former New Zealand captain Brendon Mc Cullum has lauded Kane Williamson for taking the side to unprecedented success in Test cricket","content":"NEW DELHI: Former New Zealand captain Brendon Mc Cullum has lauded Kane Williamson for taking the side to unprecedented success in Test cricket and believes that the right-handed batter has left the team in a better position than what it was under his time as skipper.On Thursday, Williamson stepped down as Test captain of the New Zealand team, bringing the end to his time in the role for six years, when he took over from McCullum in 2016. Under Williamson, New Zealand played in 40 Tests, winning 22, drawing eight and losing 10 matches (also two ending as no-result) and took the team to winning inaugural World Test Championship (WTC) in Southampton in June 2021. \"He took the Blackcaps to unprecedented success, he brought so much consistency of high performance (in) that side, right throughout all forms of the game he's achieved so much,\" said McCullum on SENZ Mornings radio show. \"He's done it in such an understated kind of a Kane Williamson, relaxed manner and I think he's been able to inspire fans not just from New Zealand to play cricket but also around the world there's lots of people who consider Kane Williamson's Blackcaps side as their second favourite team because of how they carry themselves and what they achieve.\" He's left the cap in a much better place, or the blazer as it is, when it comes to the New Zealand captaincy position. He's left the blazer in a better position than he found it, which was obviously off me. He's done a remarkable job and I look forward to sitting down with him at some stage and opening a nice bottle of wine and toasting to everything that he's achieved,\" he added. Though McCullum admitted to being surprised over Williamson leaving Test captaincy, he explained why the Tauranga-based batter stepped away from the role, with veteran pacer Tim Southee now appointed as the New Zealand skipper in Tests. \"I didn't think Kane was ready to step away just yet even though there'd been a couple of conversations recently. He sort of was trying to work out how to relax his workload a little bit. But I guess there's two parts to it: one is I think Tim Southee will do a fabulous job and he'll get all the support in the world from Kane as a foot soldier now, just as Tim gave everything that he could as a foot soldier to Kane in his captaincy. I think the second part is what an amazing job Kane did as captain of the Blackcaps for as long as he did,\" he said. The 34-year old Southee has led New Zealand in 22 T20Is and has served as Williamson's deputy alongside opener Tom Latham in the last few years. McCullum, currently England's Test coach, expects Southee, currently New Zealand's third-highest wicket-taker in history of the game, to lead the side through an aggressive and free-flowing brand of cricket. \"I think he'll do a fabulous job. I think it's a really good appointment, to be honest. I know obviously I'm on tour elsewhere and we're going to come up against New Zealand in six weeks' time or something but I think it's a really good appointment,\" said McCullum. \"(I'm excited to watch) how Tim goes about it because he's got a very aggressive cricketing mind as well and he'll want to play the game in a free-spirited way too so it'll be fascinating. It's exciting albeit there's a tinge of sadness for New Zealand as well,\" he added. Southee's first assignment as Test captain will be a two-match tour of Pakistan, starting from the first match in Karachi from December 26-30, followed by the second Test at Multan from January 3-7. Both matches are a part of the World Test Championship (WTC) cycle. IANS Also Read:  Tim Southee to take charge as Williamson steps down as New Zealand captainAlso Watch:","pubDate":"2022-12-17 14:05:05","image_url":"https://assets.sentinelassam.com/h-upload/2022/12/17/422398-kane.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"Ticket Prices Of India- Sri Lanka ODI At Guwahati Released","link":"https://www.sentinelassam.com/sports/cricket/ticket-prices-of-india-sri-lanka-odi-at-guwahati-released-628582","keywords":["Breaking News,Sports,Feature,News Ticker,Cricket"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"The prices of the tickets for the Jan 10 India- Sri Lanka ODI released by the ACA range from Rs 475 to Rs 5,000","content":"GUWAHATI: Cricket lovers are expectedly thrilled that another one- dayer will be played in Guwahati after the second T20 in the three match series between India and South Africa in October this year. Ending the suspense, ticket prices for the soon-to-be-held One Day International (ODI) match between India and Sri Lanka were announced by the Assam Cricket Association (ACA) on Friday, the 16th of December. The ODI cricket fixture at the Barsapara Stadium in the city is slated for January 10, 2023 The prices of the tickets for the India- Sri Lanka ODI released by the ACA range from Rs 475 to Rs 5,000 The ticket price list released by the ACA shows that the tickets for West stand 2nd floor (for students only) will cost Rs. 475, West Stand-1st floor will cost Rs 2,000, West Stand- Ground floor cost Rs. 3000, while the East Stand-1st floor will cost Rs. 2000, that for East Stand-Second floor is Rs 1,500, and the price for East Stand- Ground floor is Rs. 3000. The price of a ticket for North Stand- top floor is Rs. 2500, North Stand-2nd floor costs Rs. 5000, the rate for North Stand- Ground floor is pegged at Rs 3000, those on South Stand-Top floor is to cost Rs 2,500, a seat for South Stand-2nd floor will cost Rs 5,000, while a ticket to the South Stand-Ground floor will cost Rs 3,000. The Indian tour of the Sri Lankan Cricket team is slated in the month of January next year. In keeping with that, a Board of Control for Cricket in India (BCCI) team is scheduled to conduct inspections of the stadium after arriving in Guwahati for the purpose. Earlier, BCCI secretary Jay Shah and Assam Chief Minister Himanta Biswa Sarma met with its Northeast members in Guwahati on October 1, 2022. During the meeting, it was revealed that the Board of Control for Cricket in India (BCCI) is intending to open five indoor training facilities in the Northeast by January 1, 2024. Locations in Sikkim, Manipur, Nagaland, Mizoram, and Arunachal Pradesh have been designated by the BCCI so far. However, land issues are likely to cause a six-month delay in Meghalaya, it was revealed.Also read: Assam: Mukhtar Hussain Shortlisted For IPL 2023 Auction ListAlso watch: ","pubDate":"2022-12-17 13:55:53","image_url":"https://assets.sentinelassam.com/h-upload/2022/12/17/422395--barsapara-cricket-stadium.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"Sunil Ramesh, Ajay Kumar Reddy lead India to its hat-trick T20 Cricket World Cup for the Blind title","link":"https://economictimes.indiatimes.com/news/sports/sunil-ramesh-ajay-kumar-reddy-lead-india-to-its-hat-trick-t20-cricket-world-cup-for-the-blind-title/articleshow/96304679.cms","keywords":null,"creator":null,"video_url":null,"description":"Indian captain Ajay Kumar Reddy won the toss and elected to bat. In form batter Sunil Ramesh was joined by vice-captain D. Venkateswara Rao to open the innings.","content":null,"pubDate":"2022-12-17 13:42:58","image_url":"https://img.etimg.com/thumb/width-1200,imgsize-66908,resizemode-4,msid-96304679/sunil-ramesh-ajay-kumar-reddy-lead-india-to-its-hat-trick-t20-cricket-world-cup-for-the-blind-title.jpg","source_id":"economictimes_indiatimes","country":["india"],"category":["sports"],"language":"english"},{"title":"South Africa put their best and their worst on show at Gabba, exactly as expected - ESPNcricinfo","link":"https://news.google.com/__i/rss/rd/articles/CBMilAFodHRwczovL3d3dy5lc3BuY3JpY2luZm8uY29tL3N0b3J5L2F1cy12cy1zYS0xc3QtdGVzdC1nYWJiYS1zb3V0aC1hZnJpY2EtcHV0LXRoZWlyLWJlc3QtYW5kLXRoZWlyLXdvcnN0LW9uLXNob3ctYXQtZ2FiYmEtZXhhY3RseS1hcy1leHBlY3RlZC0xMzUwMDg40gGhAWh0dHBzOi8vd3d3LmVzcG5jcmljaW5mby5jb20vc3RvcnkvYXVzLXZzLXNhLTFzdC10ZXN0LWdhYmJhLXNvdXRoLWFmcmljYS1wdXQtdGhlaXItYmVzdC1hbmQtdGhlaXItd29yc3Qtb24tc2hvdy1hdC1nYWJiYS1leGFjdGx5LWFzLWV4cGVjdGVkLTEzNTAwODg_cGxhdGZvcm09YW1w?oc=5","keywords":null,"creator":null,"video_url":null,"description":"South Africa put their best and their worst on show at Gabba, exactly as expected  ESPNcricinfoGabba pitch didn't play as tough as it looked: Verreynne | Australia v South Africa 2022-23  cricket.com.auNortje and Proteas bowling brigade eye Brisbane battle  ICC CricketQuicks licking lips at green Gabba surface | Qantas Runway Report  cricket.com.auView Full coverage on Google News","content":null,"pubDate":"2022-12-17 12:43:54","image_url":null,"source_id":"google","country":["australia"],"category":["sports"],"language":"english"},{"title":"Blind T20 World Cup: भारतीय क्रिकेट टीम ने रचा इतिहास, बांग्लादेश को हराकर जीता नेत्रहीन टी20 वर्ल्ड कप","link":"https://www.abplive.com/sports/cricket/india-beat-bangladesh-blind-t20-world-cup-final-2022-2284451","keywords":["Cricket"],"creator":["ABP Live"],"video_url":null,"description":"India Win Blind T20 World Cup 2022: भारतीय क्रिकेट टीम ने नेत्रहीन टी20 वर्ल्ड कप जीत लिया है. शनिवार (17 दिसंबर) को बेंगलुरु के एम चिन्नास्वामी स्टेडियम में खेले गए खिताबी मुकाबले में उसने बांग्लादेश को 120 रन से शिकस्त दी. भारत ने यह खिताब तीसरी बार जीता है. इससे पहले भारत ने 2012 और 2017 में ब्लाइंड टी20 वर्ल्ड कप जीता था. टीम इंडिया के तीसरी बार वर्ल्ड कप जीतने पर पूर्व क्रिकेटरों समेत फैंस ने जमकर बधाई दी है.  भारत ने बनाए 277 रन चिन्नास्वामी स्टेडियम में खेले गए खिताबी मुकाबले में भारत ने पहले टॉस जीतकर बैटिंग. इस दरम्यान भारत ने धुआंधार बल्लेबाजी करते हुए 2 विकेट के नुकसान पर 277 रन बनाए. सुनील रमेश ने शतकीय पारी खेलते हुए 63 गेंद पर 136 रन बनाए. वहीं कप्तान अजय कुमार रेड्डी ने 50 गेंद पर 100 रन की पारी खेली. इन दोनों खिलाड़ियों ने तीसरे विकेट के लिए 247 रन की साझेदारी की. इससे पहले भारत ने 29 रन पर 2 विकेट खो दिए थे.  History 🔺 Defending Champions India retains the #T20WorldCup in Blind Cricket. Their third straight WC trophy 🏆 pic.twitter.com/vIQXCKSmmG — Doordarshan Sports (@ddsportschannel) December 17, 2022 बांग्लादेश ने बनाए 157 रन जीत के लिए 278 रन के लक्ष्य का पीछा करने उतरी बांग्लादेश की टीम निर्धारित 20 ओवर में 157 रन ही बना सकी. इस तरह उसे इस खिताबी मुकाबले में 120 रन से हार का सामना करना पड़ा. भारत की कसी गेंदबाजी के आगे बांग्लादेश के बल्लेबाज बेबस नजर आए. टीम इंडिया की तरफ से ललित मीना और अजय कुमार ने 1-1 विकेट लिया. भारत ने इस बार ब्लाइंड टी20 वर्ल्ड कप की मेजबानी की थी. अगले विश्व कप साल 2024 में पाकिस्तान में खेला जाएगा. यह भी पढ़ें: IND vs BAN: बांग्लादेश के लिए शतक जड़कर जाकिर हसन ने बनाया रिकॉर्ड, ऐसा करने वाले चौथे बल्लेबाज","content":null,"pubDate":"2022-12-17 11:36:40","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2022/12/17/969543378498e8dcc519c8a080dfc96a1671275969840366_original.jpg","source_id":"abplive","country":["india"],"category":["sports"],"language":"hindi"},{"title":"IND vs BAN 1st Test: Axar Patel helps India exert further grip; Bangladesh's fight weakens in Chattogram","link":"https://www.indiatvnews.com/sports/cricket/ind-vs-ban-1st-test-axar-patel-helps-india-exert-further-grip-bangladeshs-fight-weakens-in-chattogram-test-india-vs-bangladesh-1st-test-kuldeep-yadav-2022-12-17-831971","keywords":null,"creator":null,"video_url":null,"description":"IND vs BAN 1st Test: The Indian cricket team exerted more grip on the first Test match against Bangladesh in Chattogram. The Men in Blue scalped 6 wickets on the penultimate day of the Test as Bangladesh scored 272 runs in their pursuit of 513. Axar Patel starred for India as he took 3 wickets and sent shockwaves in Bangladesh's camp.","content":null,"pubDate":"2022-12-17 11:12:45","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"Assam: Mukhtar Hussain Shortlisted For IPL 2023 Auction List","link":"https://www.sentinelassam.com/north-east-india-news/assam-news/assam-mukhtar-hussain-shortlisted-for-ipl-2023-auction-list-628548","keywords":["Breaking News,NE News,Sports,Assam News,Feature,News Ticker,Cricket"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"Mukhtar Hussain from Assam's Dibrugarh district has been selected for the auction list of IPL 2023","content":"GUWAHATI : It is a matter of delight for cricket lovers in the state that a boy from Assam has been selected for the new season of Indian Premier League (IPL) in 2023 by 10 teams. Mukhtar Hussain, a 23 year old bowler from Assam's Dibrugarh district, has been shortlisted in the IPL auction list. It is to be noted that, out of 999 players registered for the 2023 IPL season, Assam boy has managed to secure a place among probables in the mega cricket match. It is worth mentioning that, Mukhtar Hussain came out with flying colours in the Vijay Hazare Trophy. By far, in his cricketing career, Mukhtar has played the Vijay Hazare Trophy from the year 2017-2018. According to sources, his name is in the IPL's auction list with the base price of Rs 20 lakhs. Mukhtar Hussain was born on 11th of January 1999 and is a right-hand batsman and a right-arm medium pace bowler. 273 out of the total 405 players for IPL 2023 are Indian cricketers . Amongst them, 132 are overseas player and rest 4 belongs from associate nations. The total number of capped players is 119, while 282 are uncapped players and 4 are from the associate nations.The Board of Cricket Control for India (BCCI) is ready to introduce an 'Impact Player Rule' for each team to make the game more exciting. According to source, the new rule was introduced by the governing council members of IPL on 1st of December, 2022. The rule was accepted without any argument by the domestic circuit coaches and players. The clause is similar to a player substitute in football. BCCI in its statement, said that, Indian Premier League 2023 is going to witness a new strategic concept to add on a new dimension to the game. This rule will allow one substitute player from each team to find a place in the IPL match. The regulations related to the concept are scheduled to be released soon, stated the BCCI. Also Read : Sikkim To Host Two G20 Meetings Next YearAlso Watch : ","pubDate":"2022-12-17 11:04:30","image_url":"https://assets.sentinelassam.com/h-upload/2022/12/17/422352-5b07dc40-7990-4327-94b6-0007315c5f0e.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"Lyon sheds light on harrowing Gabba police image - Courier Mail","link":"https://news.google.com/__i/rss/rd/articles/CBMiqQFodHRwczovL3d3dy5jb3VyaWVybWFpbC5jb20uYXUvc3BvcnQvY3JpY2tldC9hdXN0cmFsaWEtdi1zb3V0aC1hZnJpY2EtbmF0aGFuLWx5b24tc2hlZHMtbGlnaHQtb24taGFycm93aW5nLWdhYmJhLXBvbGljZS1pbWFnZS9uZXdzLXN0b3J5LzVkMmE4NzliMzU0YmYzYTBlODYzMjdkMTdhNDE3ODQ20gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Lyon sheds light on harrowing Gabba police image  Courier MailGabba crowd pays tribute to two police officers and member of the public killed in Queensland siege  ABC NewsFallen Queensland police officers honoured by cricketers and crowds at Brisbane Cricket Ground  9NewsCops reveal moment they knew colleagues were murdered  Toowoomba ChronicleHeartbreaking scenes at the Gabba as tears flow for fallen police officers  Sky News AustraliaView Full coverage on Google News","content":null,"pubDate":"2022-12-17 10:35:36","image_url":null,"source_id":"google","country":["australia"],"category":["sports"],"language":"english"},{"title":"‘Very grateful’: Test cricket’s tribute to the fallen police","link":"https://www.brisbanetimes.com.au/sport/cricket/very-grateful-test-cricket-s-tribute-to-the-fallen-police-20221217-p5c760.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Malcolm Conn"],"video_url":null,"description":"Nathan Lyon has paid tribute to the murdered police and neighbour after a minute’s silence at the first Test in Brisbane on Saturday.","content":"It was a day of sadness before the joy of cricket at the Gabba on Saturday, with Nathan Lyon later paying a heartfelt tribute to the fallen police and neighbour who were killed at Wieambilla, three hours west of Brisbane, last Monday. The Australian players were close by when a delegation of six police officers arrived to be part of a minute’s silence to honour Constables Matthew Arnold and Rachel McCrow before the usual welcome to country and national anthems before each Test. The Australian players offer their support to grieving police officers before the start of play on Saturday. Credit: Getty One policeman was clearly distraught at the loss of their colleagues, crying heavily on a fellow officer’s shoulder before gathering himself for the solemn silence in front of almost 30,000 fans, the largest crowd for the first day of a non-Ashes Test at the Gabba. This was followed by a generous round of applause from the crowd. “It was massive, to be honest with you,” Lyon said after play. “I actually said to Mitch Starc, ‘I don’t know whether I should go out and put my arm around him or not’. I don’t know what the protocols are or anything like that, but it hit everyone pretty hard. “I wasn’t aware that the police were coming out for that, but I’m very grateful that they did and they were able to see the support of the not just us cricketers, but the Australian public and everyone. “I thought it was absolutely fantastic and words can’t describe what they’re going through. It puts what we do in a pretty small basket. I’m pretty speechless, to be honest. I don’t know how to answer it and I’ll never do the two cops justice, or the gentleman who passed away. I don’t have much, more to be honest.” There were only a few minutes between the minute’s silence and when the match started, with both teams wearing black arm-bands in solidarity. Nathan Lyon. Credit: Getty Lyon claimed the players had no choice but to compose themselves and get on with the match after every Australian player went over and embraced the police to pay their respect. “That’s our job,” Lyon said. “It was a pretty amazing moment, and maybe it’s probably not the right word, but to go and say thank you to the cops or the police force after. I think that was a really nice moment. “I know we all had a little moment there and we all said how tough that was. But come cricket time we’ve got to do our job.” Save Log in , register or subscribe to save articles for later. License this article Australian cricket Test cricket South Africa Malcolm Conn is Chief Cricket Writer. Connect via Twitter or email . Most Viewed in Sport Loading","pubDate":"2022-12-17 10:03:12","image_url":null,"source_id":"brisbanetimes","country":["australia"],"category":["sports"],"language":"english"},{"title":"IND vs BAN 1st Test: Kuldeep Yadav spills beans about how he tweaked his bowling after surgery","link":"https://www.indiatvnews.com/sports/cricket/ind-vs-ban-1st-test-kuldeep-yadav-spills-beans-about-how-he-tweaked-his-bowling-after-surgery-india-vs-bangladesh-kuldeep-yadav-paras-mhambrey-2022-12-17-831960","keywords":null,"creator":null,"video_url":null,"description":"IND vs BAN 1st Test: India's left-arm chinaman Kuldeep Yadav made a comeback to Test cricket after being out of action for 21 months. Yadav, who once used to be a crucial artillery in India's spin department seemed pretty off-colour in recent years. He was not picked in the Indian team on regular basis and also lost his former IPL franchise Kolkata Knight Riders' confidence. But the spinner is making giant strides into the team and is delivering performances in the recent outings.","content":null,"pubDate":"2022-12-17 09:50:00","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"BCCI to construct indoor cricket training facility in Northeast states","link":"https://thenewsmill.com/2022/12/bcci-to-construct-indoor-cricket-training-facility-in-northeast-states/","keywords":["Cricket","Sports","ANI"],"creator":["ANI"],"video_url":null,"description":null,"content":null,"pubDate":"2022-12-17 09:31:23","image_url":null,"source_id":"thenewsmill","country":["india"],"category":["sports"],"language":"english"},{"title":"First Test as it happened: South Africa land double blow after Head runs riot - Sydney Morning Herald","link":"https://news.google.com/__i/rss/rd/articles/CBMif2h0dHBzOi8vd3d3LnNtaC5jb20uYXUvc3BvcnQvY3JpY2tldC9maXJzdC10ZXN0LWxpdmUtdXBkYXRlcy1hdXN0cmFsaWEtdi1zb3V0aC1hZnJpY2EtZGF5LW9uZS1hdC10aGUtZ2FiYmEtMjAyMjEyMTYtcDVjNnpsLmh0bWzSAX9odHRwczovL2FtcC5zbWguY29tLmF1L3Nwb3J0L2NyaWNrZXQvZmlyc3QtdGVzdC1saXZlLXVwZGF0ZXMtYXVzdHJhbGlhLXYtc291dGgtYWZyaWNhLWRheS1vbmUtYXQtdGhlLWdhYmJhLTIwMjIxMjE2LXA1YzZ6bC5odG1s?oc=5","keywords":null,"creator":null,"video_url":null,"description":"First Test as it happened: South Africa land double blow after Head runs riot  Sydney Morning HeraldOur Call Of Scott Boland Taking Two Wickets In An Over At The Gabba | Triple M Cricket  Triple MAustralia v South Africa: first Test, day one – as it happened  The GuardianScott Boland rocks South Africa in 'ridiculous' display in first Test  Yahoo Sport AustraliaFirst Test Talking Points: Boland's magic arm sends Saffers skittling, but Verreynne causes Aussies pain  The RoarView Full coverage on Google News","content":null,"pubDate":"2022-12-17 08:26:06","image_url":null,"source_id":"google","country":["australia"],"category":["sports"],"language":"english"},{"title":"Anderson: I can keep going for a number of years","link":"https://www.skysports.com/cricket/news/12040/12769795/james-anderson-feels-he-can-carry-on-playing-for-a-number-of-years-in-ben-stokes-exciting-england-team","keywords":null,"creator":null,"video_url":null,"description":"England seamer James Anderson feels he can carry on playing Test cricket \"for a number of years\" having been energised by the aggressive style championed by captain Ben Stokes.","content":null,"pubDate":"2022-12-17 08:25:00","image_url":"https://e2.365dm.com/22/12/1920x1080/james-anderson-england-test-cricket_5998983.jpg?20221217075429","source_id":"skysports","country":["united states of america","united kingdom","australia"],"category":["sports"],"language":"english"},{"title":"The burning Warner query that needs answering","link":"https://wwos.nine.com.au/cricket/australia-south-africa-first-test-2022-david-warner-first-ball-duck-retirement-ricky-ponting-comments/b92250e8-7206-44d8-8d60-0a98a441917e","keywords":null,"creator":["wwos"],"video_url":null,"description":"Following a lean run of form, Ricky Ponting believes David Warner deserves to be the one to call time on his career.","content":"Pressure on David Warner is continuing to mount after a first-ball duck in the first Test against South Africa at the Gabba.Warner faced the new ball against Proteas quick Kagiso Rabada, who sent a well-﻿directed short ball towards Warner's ribs.He succeeded only in fending the ball to Khaya Zondo﻿, who took a brilliant catch at short leg.READ MORE: How 2022 re-shaped the GOAT conversation﻿READ MORE: The unsung hero powering France to victory﻿READ MORE: 'Mind blowing' breakthrough erases 'sad' legacy﻿\"A good short one, David Warner just took his eye off the ball (and) got it high on the bat,\" Mark Waugh said in commentary for Fox Cricket.\"Nothing's gone David Warner's way – he keeps making mistakes and keeps paying a high price.\"Warner hasn't scored a century since the start of the pandemic, with January 2020 being the last time he tonned up.﻿Since the start of the last Ashes, Warner has averaged just 21.8.He's also 36, and Australia's next two international tours - an Ashes series in England and a tour of India - are not places he's traditionally done well at.Assuming he's picked, ﻿Warner will play his 100th test at the MCG next week.Former Test captain Ricky﻿ Ponting said he wouldn't put it past Warner to score a hundred in that match and shush the naysayers.\"He is a champion player - you never write off champion players ever,\" Ponting said on Channel 7.\"He is going through a lean trot now - we all want to see him scoring runs.\"When he finishes, he deserves to go out on his term. He has been a magnificent stalwart for Australian cricket.\"Ponting said Warner would have been disappointed to have not made big scores against the West Indies, but he deserved the chance to go out on his own accord.﻿\"That is the most disappointing thing for David. He got those 20s, and got the starts against the West Indies and didn't go on when everyone else at the top made the most of a weak West Indian side.\"He deserves the chance to finish the way he wants to finish. I would hate to see him get to an Indian tour or at the start of the Ashes tour and then get the tap on the shoulder.\"That would be a disappointing way for his career to end.\"Despite an early collapse to start Australia's innings, a strong 117-run partnership between Steve Smith and Travis Head﻿ offered a reprisal.With two late wickets on the verge of stumps, the Aussies will resume batting on day two on 5-145. They trail by seven runs after South Africa set a score of 152 earlier in the day.﻿For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here!","pubDate":"2022-12-17 08:07:49","image_url":"https://vms-network-images-prod.s3-ap-southeast-2.amazonaws.com/2022/12/474277/pickerimage.jpg","source_id":"nine","country":["australia"],"category":["sports"],"language":"english"},{"title":"India vs Bangladesh 1st Test Live Cricket Score Online: Litton and Zakir keep BAN steady - The Indian Express","link":"https://news.google.com/__i/rss/rd/articles/CBMiZmh0dHBzOi8vaW5kaWFuZXhwcmVzcy5jb20vYXJ0aWNsZS9zcG9ydHMvY3JpY2tldC9pbmQtdnMtYmFuLTFzdC10ZXN0LWRheS00LWxpdmUtc2NvcmUtdXBkYXRlcy04MzI5MDQzL9IBa2h0dHBzOi8vaW5kaWFuZXhwcmVzcy5jb20vYXJ0aWNsZS9zcG9ydHMvY3JpY2tldC9pbmQtdnMtYmFuLTFzdC10ZXN0LWRheS00LWxpdmUtc2NvcmUtdXBkYXRlcy04MzI5MDQzL2xpdGUv?oc=5","keywords":null,"creator":null,"video_url":null,"description":"India vs Bangladesh 1st Test Live Cricket Score Online: Litton and Zakir keep BAN steady  The Indian ExpressIND vs BAN: Watch: Cheteshwar Pujara Denies A Hug To Virat Kohli On Reaching His 100, Realizes Later  Cricket AddictorInd vs Ban 1st Test Live Score Updates: Bangladesh lose Yasir Ali, Najmul Hossain Shanto in quick succession vs India  Times of IndiaExplained: Why Bangladesh Could Not Review Shubman Gill's LBW Survival  NDTV SportsBangladesh 119-0 in 2nd innings to trail India by 394 runs  The Associated Press - en EspañolView Full coverage on Google News","content":null,"pubDate":"2022-12-17 07:56:41","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"‘Have some of that Smudge!’: Steve Smith’s weirdest quirk yet after nasty blow","link":"https://www.foxsports.com.au/cricket/australia/australia-vs-south-africa-cricket-first-test-2022-steve-smith-sledge-after-being-hit-video-have-some-of-that-smudge/news-story/15e9965eb1e93d3f460fd779a716475e","keywords":null,"creator":null,"video_url":null,"description":"Amid rediscovering his imposing Test cricket form this summer, Steve Smith’s odd idiosyncrasies seem as prominent as ever.","content":null,"pubDate":"2022-12-17 07:44:00","image_url":null,"source_id":"foxsports","country":["australia"],"category":["sports"],"language":"english"}]}