{"newsArray":[{"title":"Scott Boland in doubt for fifth Test in Hobart","link":"https://www.news.com.au/sport/cricket/scott-boland-in-doubt-for-fifth-test-in-hobart/video/6e412cd7bc7de259505928ae1967a960","keywords":null,"creator":null,"video_url":null,"description":"Cricket: Scott Boland is in doubt for the fifth and final Ashes Test in Hobart after suffering a fall during the fourth test at the SCG.","content":null,"pubDate":"2022-01-10 23:16:06","full_description":null,"image_url":null,"source_id":"news"},{"title":"West Indies v Ireland ODI slayed by COVID","link":"https://thewest.com.au/sport/cricket/west-indies-v-ireland-odi-slayed-by-covid-c-5258778","keywords":null,"creator":["AAP"],"video_url":null,"description":"The West Indies and Ireland have postponed their second one-day cricket international after further positive coronavirus tests within the tourists' camp.","content":null,"pubDate":"2022-01-10 21:51:17","full_description":null,"image_url":"https://images.thewest.com.au/publication/C-5258778/7eb57f677c719d1956e4265fa30c721b207cad17-16x9-x0y75w800h450.jpg","source_id":"thewest"},{"title":"West Indies v Ireland ODI slayed by COVID","link":"https://www.perthnow.com.au/sport/cricket/west-indies-v-ireland-odi-slayed-by-covid-c-5258769","keywords":null,"creator":["AAP"],"video_url":null,"description":"The West Indies and Ireland have postponed their second one-day cricket international after further positive coronavirus tests within the tourists' camp.","content":null,"pubDate":"2022-01-10 21:50:49","full_description":null,"image_url":"https://images.perthnow.com.au/publication/C-5258769/7eb57f677c719d1956e4265fa30c721b207cad17-16x9-x0y75w800h450.jpg","source_id":"perthnow"},{"title":"Sad twist in Hobart's historic Ashes Test","link":"https://wwos.nine.com.au/cricket/ashes-2021-2022-tim-paine-wont-attend-hobart-test-bellerive-oval/5ebfb5ee-fafd-42dd-b581-675ce41b0f60","keywords":null,"creator":["wwos"],"video_url":null,"description":"Former Australian skipper Tim Paine has been forced to make a brutal call ahead of the fifth Ashes.","content":"It was meant to be the finest moment of his career, but former Australian captain Tim Paine will not be in Hobart this week for the city's historic first Ashes Test match.Instead of leading Australia at Bellerive Oval, a match he pushed for, the Sydney Morning Herald reports that the 37-year-old is on holidays with his family, and won't return to Hobart for the match.Paine hasn't been spoken publicly since resigning the Test captaincy on the eve of the series, after a sexting scandal dating back to 2017 became public.READ MORE: Former Fremantle Dockers player dies aged 25READ MORE: Why Rafa now wants Novak in the Aussie OpenREAD MORE: Kyrgios in doubt for Australian OpenAccording to the Herald, Cricket Australia and Cricket Tasmania invited Paine to an official function at the match, while SEN was also keen to have the former skipper as part of their commentary team.\"We've been talking regularly, a couple times a week. He's going okay, is how I'd describe Tim,\" ACA boss Todd Greenberg told SEN.\"He's incredibly disappointed he's not playing cricket, and I'm disappointed he's not playing cricket too. But we're keeping in close contact, and we'll help him through it.\"We made it very clear to Cricket Australia we thought there was a different way that could have been handled, but we're not always going to agree. The players felt it could have been handled differently, and they felt like the governing body didn't have their back at that particular time.\"We're creating trust between the players and the governing body, and that's a big part of that. We took some steps backwards in that scenario, that's just being brutally honest.\"Even before the sexting scandal came to light, the fifth Ashes Test was looming as Paine's final match before retirement. His replacement, Alex Carey, endured a difficult Test in Sydney, dropping two chances to his right. Former Test wicketkeeper, Wayne Phillips, says there's no need to panic over Carey's form.\"His best is absolutely good enough, it's just those little errors that we've seen that have been exposed,\" Phillips said on Radio 5AA.\"It's a tiny little technical issue that needs to be addressed. It's not difficult at all, just a little half step to get in position. When you've got two going in between him and first slip something needs to be done but … I know Alex and he'll work on it as hard as any man has.\"For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here!","pubDate":"2022-01-10 20:53:15","full_description":"It was meant to be the finest moment of his career, but former Australian captain Tim Paine will not be in Hobart this week for the city's historic first Ashes Test match. Instead of leading Australia at Bellerive Oval, a match he pushed for, the Sydney Morning Herald reports that the 37-year-old is on holidays with his family, and won't return to Hobart for the match. Paine hasn't been spoken publicly since resigning the Test captaincy on the eve of the series, after a sexting scandal dating back to 2017 became public. READ MORE: Former Fremantle Dockers player dies aged 25 READ MORE: Why Rafa now wants Novak in the Aussie Open READ MORE: Kyrgios in doubt for Australian Open According to the Herald, Cricket Australia and Cricket Tasmania invited Paine to an official function at the match, while SEN was also keen to have the former skipper as part of their commentary team. \"We've been talking regularly, a couple times a week. He's going okay, is how I'd describe Tim,\" ACA boss Todd Greenberg told SEN. \"He's incredibly disappointed he's not playing cricket, and I'm disappointed he's not playing cricket too. But we're keeping in close contact, and we'll help him through it. \"We made it very clear to Cricket Australia we thought there was a different way that could have been handled, but we're not always going to agree. The players felt it could have been handled differently, and they felt like the governing body didn't have their back at that particular time. \"We're creating trust between the players and the governing body, and that's a big part of that. We took some steps backwards in that scenario, that's just being brutally honest.\" Even before the sexting scandal came to light, the fifth Ashes Test was looming as Paine's final match before retirement. His replacement, Alex Carey , endured a difficult Test in Sydney, dropping two chances to his right. Former Test wicketkeeper, Wayne Phillips, says there's no need to panic over Carey's form. \"His best is absolutely good enough, it's just those little errors that we've seen that have been exposed,\" Phillips said on Radio 5AA. \"It's a tiny little technical issue that needs to be addressed. It's not difficult at all, just a little half step to get in position. When you've got two going in between him and first slip something needs to be done but … I know Alex and he'll work on it as hard as any man has.\" For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here!","image_url":"https://vms-network-images-prod.s3-ap-southeast-2.amazonaws.com/2022/01/402880/pickerimage.jpg","source_id":"nine"},{"title":"Kiwis take complete control in second Test against Bangladesh","link":"https://www.news.com.au/sport/cricket/kiwis-take-complete-control-in-second-test-against-bangladesh/video/3581685a9fca2cdf2784015408b24d53","keywords":null,"creator":null,"video_url":null,"description":"Cricket:","content":null,"pubDate":"2022-01-10 20:28:09","full_description":null,"image_url":null,"source_id":"news"},{"title":"“World’s best players are involved in IPL, PSL, Big Bash, The Hundred”: Kevin Pietersen reckons a Hundred-style red ball franchise tournament as way forward for a struggling England Test team","link":"https://thesportsrush.com/cricket-news-worlds-best-players-are-involved-in-ipl-psl-big-bash-the-hundred-kevin-pietersen-reckons-a-hundred-style-red-ball-franchise-tournament-as-way-forward-for-a-struggling-england-test-team/","keywords":["Cricket","England","kevin pietersen"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Kevin Pietersen reckons a Hundred-style red ball franchise competition and not County championships as beneficial for England Test team. To say that the England men’s Cricket side had a forgetful 2021, would be an understatement. The year ended with yet another Ashes series loss Down Under, as Australia managed to retain the much coveted urn.… The post “World’s best players are involved in IPL, PSL, Big Bash, The Hundred”: Kevin Pietersen reckons a Hundred-style red ball franchise tournament as way forward for a struggling England Test team appeared first on The SportsRush.","content":"Kevin Pietersen reckons a Hundred-style red ball franchise competition and not County championships as beneficial for England Test team. To say that the England men’s Cricket side had a forgetful 2021, would be an understatement. The year ended with yet another Ashes series loss Down Under, as Australia managed to retain the much coveted urn. The English Cricket fans and experts had along expected lines began with their piercing words of humiliation and critiques after yet another hyped series went for a Toss. A significant section of the aforementioned fans and experts jumped on to blame the participation of the England Test players in the various franchise leagues in the world, including their own product- The Hundred, as the reason for the downfall in the longest format. However, someone like a Kevin Pietersen, who has played significant number of T20 leagues, has a different view point on England Test team’s downward spiral. Kevin Pietersen reckons a Hundred-style red ball franchise competition Post England’s Ashes series defeat at the Melbourne Cricket Ground (MCG) in the Boxing Day Test, Kevin Pietersen came up with a ‘proposal’ to save Test Cricket in England via a blog. The 41-year-old has in fact defended the various T20 franchises around the world, and has weighed in on a red-ball franchise tournament in England, modelled around their recent addition- The Hundred. Pietersen has went on to hail ECB’s concept of The Hundred as a ‘competition with some sort of value’, while opposing the County Championships with regard to its current form. “With the money elsewhere in the game, the (County) Championship in its current form is not fit to serve the Test team,” Pietersen remarked in his Betway blog. “The best players don’t want to play in it, so young English players aren’t learning from other greats like I did. Batters are being dismissed by average bowlers on poor wickets and the whole thing is spiralling. “In The Hundred, the ECB have actually produced a competition with some sort of value. “It is the best against the best, marketed properly, and the audience engaged with it. They got new people to the games and I can tell you that the players will have improved markedly for featuring alongside other greats. It’s such a valuable experience.” Weighing on the need to introduce a red-ball franchise Pietersen wrote, “They now need to introduce a similar franchise competition for red-ball cricket, whereby the best play against the best every single week. “They would make money available to attract some of the best overseas players in the world and the top English players would benefit from playing alongside them. “It would be a marketable, exciting competition, which would drive improvement in the standard and get people back through the gates for long-form cricket.” ALSO READ: When Pietersen threatened ECB with his Test retirement. An eight-team round-robin league The former right-handed batter went on to propose the format of the red-ball franchise competition. “I see it as an eight-team round-robin league in the middle of the summer. The pitches are monitored by the ECB so that we’re not seeing majorly bowler-friendly conditions like we do now. We have to have good pitches that reward and encourage strong batting techniques, batting for long periods of time, and that require skill from bowlers to take wickets,” he added. “I can promise you that the current England team and lots of the best youngsters in the system still see Test cricket, in particular Ashes cricket, as the pinnacle. “But the world’s best players are involved in the IPL, the PSL, the Big Bash, The Hundred, and so on, so it’s no good denying them the chance to make their millions anymore, as I was back in the day. “We need to produce lucrative, high-quality, interesting competitions that reward and improve the best players. This could be one.” BREAKING The county system is KILLING this Test team I look forward drawing on the past… Here’s my solution – https://t.co/bui00NUCNS — Kevin Pietersen (@KP24) December 31, 2021 For more Cricket related news, click here.             The post “World’s best players are involved in IPL, PSL, Big Bash, The Hundred”: Kevin Pietersen reckons a Hundred-style red ball franchise tournament as way forward for a struggling England Test team appeared first on The SportsRush.","pubDate":"2022-01-10 20:23:30","full_description":null,"image_url":null,"source_id":"thesportsrush"},{"title":"Railways, Mt Barker and Royals notch wins in rounds three and four of ADCA Twenty20 competition","link":"https://thewest.com.au/news/albany-advertiser/railways-mt-barker-and-royals-notch-wins-in-rounds-three-and-four-of-adca-twenty20-competition--c-5237580","keywords":null,"creator":["Cameron Newbold"],"video_url":null,"description":"A wrap-up of rounds three and four in the Albany and Districts Cricket Association Twenty20 competition on Saturday.","content":null,"pubDate":"2022-01-10 18:00:00","full_description":null,"image_url":"https://images.thewest.com.au/publication/C-5237580/afe304235f6c2482b8beae3bcb7f82194d1dcf8e-16x9-x539y408w4526h2546.jpg","source_id":"thewest"},{"title":"Royals are ADCA T20 champions after roaring to another grand final victory over Mt Barker","link":"https://thewest.com.au/news/albany-advertiser/royals-are-adca-t20-champions-after-roaring-to-another-grand-final-victory-over-mt-barker--c-5248194","keywords":null,"creator":["Cameron Newbold"],"video_url":null,"description":"The Albany and Districts Cricket Association T20 title has been won by Royals after a tight grand final with Mt Barker.","content":null,"pubDate":"2022-01-10 18:00:00","full_description":null,"image_url":"https://images.thewest.com.au/publication/C-5248194/c6b91b6bedfe2ef9278c4255fb6c421c39203b80-16x9-x0y313w6000h3375.jpg","source_id":"thewest"},{"title":"Bancroft flays opposition attack in big win for Newtown in latest round of Esperance cricket","link":"https://thewest.com.au/news/kalgoorlie-miner/bancroft-flays-opposition-attack-in-big-win-for-newtown-in-latest-round-of-esperance-cricket-c-5250840","keywords":null,"creator":["Neale Harvey"],"video_url":null,"description":"Jason Bancroft starred with the bat in the latest round of Esperance first-grade matches","content":null,"pubDate":"2022-01-10 18:00:00","full_description":null,"image_url":"https://images.thewest.com.au/publication/C-5250840/21beeb4af10fb6a67707479830273cb9830036ed-16x9-x0y156w3000h1688.jpg","source_id":"thewest"},{"title":"Hardik Pandya IPL 2022 team: Who is the captain of Ahmedabad in IPL 2022?","link":"https://thesportsrush.com/cricket-news-hardik-pandya-ipl-2022-team-who-is-the-captain-of-ahmedabad-in-ipl-2022/","keywords":["Cricket","IPL 2022","Hardik Pandya"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Hardik Pandya IPL 2022 team: The star Indian all-rounder is likely to be roped in by the Ahmedabad-based franchise in IPL 2022. After a delay and period of exasperation involving nearly two months post emerging as the second highest bidders to grab the Ahmedabad-based franchise, the CVC Capitals have finally been handed the ‘Letter of… The post Hardik Pandya IPL 2022 team: Who is the captain of Ahmedabad in IPL 2022? appeared first on The SportsRush.","content":"Hardik Pandya IPL 2022 team: The star Indian all-rounder is likely to be roped in by the Ahmedabad-based franchise in IPL 2022. After a delay and period of exasperation involving nearly two months post emerging as the second highest bidders to grab the Ahmedabad-based franchise, the CVC Capitals have finally been handed the ‘Letter of Intent’ by the BCCI on Monday. This means that the franchise is confirmed to partake in the 15th season of the Indian Premier League (IPL) alongside Lucknow, with the tournament set to be a 10-team affair this year onwards. It is worth mentioning that Ahmedabad’s participation had become a contentious issue after CVC Capitals’ involvement/stakes in foreign betting companies came to light. With the franchise getting a conformation nod, it has wasted no time to go ahead with its business. With the management having already zeroed in on their choice for the role of head coach, mentor, and director of Cricket of the team, they have, in all likelihood made up their mind on the man who would lead the team during its debut season. Hardik Pandya IPL 2022 team If the recent reports are to be believed, former Mumbai Indians flamboyant all-rounder Hardik Pandya is likely to be drafted-in by Ahmedabad as one of its three players ahead of the mega auction likely to take place on February 12 and 13 in Bengaluru. They have in fact, as per reports, also decided to name the 28-year-old as the captain of the side for the franchise’s maiden appearance in the lucrative league. Hailing from Gujarat as well, Pandya might act as a great brand for the franchise, coupled with a reputation that cannot be ignored. He however, has been struggling with form and a prolonged injury concern. Also, looking at plain numbers, he is far from his lethal best, and played as a liability for the whole of the last season for MI, scoring at an average of mere 14.11 in 11 innings, while not bowling at all. Hardik Pandya will be the captain of the brand new Ahmedabad franchise (not Shreyas). They’re getting Rashid Khan on board too. Action-packed week. : ) — KSR (@KShriniwasRao) January 10, 2022 Ahmedabad IPL team 2022: Ishan Kishan and Rashid Khan likely to be picked as well Alongside Pandya, the franchise has reportedly also struck deals with the Afghan leg-spinner Rashid Khan and southpaw Indian wicketkeeper-batter Ishan Kishan for IPL 2022. The above mentioned report is in contradiction with an earlier one from G.S. Vivek, Sports editor of ABP News, who had stated that the Lucknow-based franchise were in fact lining-up both Kishan and Rashid as the two draft-in players in their squad, with KL Rahul as their captain. Krunal Pandya too, is on the list and it might possibly be one of Krunal or Kishan who will in all likelihood be picked as the third draft player. Ishan Kishan also likely to sign up with Ahmedabad. Talks on. Action-packed week. : ) — KSR (@KShriniwasRao) January 10, 2022 For those unaware, the to-be debutant franchises- Ahmedabad and Lucknow have, as per reports, got their deadline for naming the three draft-in players extended till January 31.             The post Hardik Pandya IPL 2022 team: Who is the captain of Ahmedabad in IPL 2022? appeared first on The SportsRush.","pubDate":"2022-01-10 15:59:32","full_description":null,"image_url":null,"source_id":"thesportsrush"},{"title":"Virender Sehwag joins cricket NFT universe with Rario","link":"https://ca.sports.yahoo.com/news/virender-sehwag-joins-cricket-nft-150000724.html?src=rss","keywords":null,"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2022-01-10 15:00:00","image_url":null,"source_id":"yahoo"},{"title":"Virat Kohli REVEALS Dhoni’s advice to him for having a long international career","link":"https://zeenews.india.com/cricket/virat-kohli-reveals-dhoni-s-advice-to-him-for-having-a-long-international-career-2426893.html","keywords":null,"creator":null,"video_url":null,"description":"Kohli talked about mistakes that Rishabh Pant made in the second Test against South Africa and in the process the Team India Test skipper revealed advice Dhoni gave him on making mistakes in international cricket.","content":null,"pubDate":"2022-01-10 12:53:00","full_description":null,"image_url":null,"source_id":"zeenews"},{"title":"25 years of Cape Town magic","link":"https://sportstar.thehindu.com/cricket/sachin-tendulkar-mohammad-azharuddin-cape-town-sa-vs-ind-222-run-partnership-book-review/article38219193.ece","keywords":null,"creator":["Vijay Lokapally"],"video_url":null,"description":"Abhishek Mukherjee and Arunabha Sengupta bring us a delightful book 'Sachin and Azhar at Cape Town' which, in their words, is “Indian and South African cricket through the prism of a partnership.”","content":null,"pubDate":"2022-01-10 12:49:53","full_description":null,"image_url":null,"source_id":"sportstar"},{"title":"Sanjay Manjrekar Names Injured Mohammed Siraj's Replacement, Picks His India XI For 3rd Test Against.. - NDTVSports.com","link":"https://news.google.com/__i/rss/rd/articles/CBMioQFodHRwczovL3Nwb3J0cy5uZHR2LmNvbS9zb3V0aC1hZnJpY2EtdnMtaW5kaWEtMjAyMS0yMi9zYW5qYXktbWFuanJla2FyLW5hbWVzLWluanVyZWQtbW9oYW1tZWQtc2lyYWpzLXJlcGxhY2VtZW50LXBpY2tzLWluZGlhLXhpLWZvci0zcmQtdGVzdC1pbi1jYXBlLXRvd24tMjY5OTg1ONIBpwFodHRwczovL3Nwb3J0cy5uZHR2LmNvbS9zb3V0aC1hZnJpY2EtdnMtaW5kaWEtMjAyMS0yMi9zYW5qYXktbWFuanJla2FyLW5hbWVzLWluanVyZWQtbW9oYW1tZWQtc2lyYWpzLXJlcGxhY2VtZW50LXBpY2tzLWluZGlhLXhpLWZvci0zcmQtdGVzdC1pbi1jYXBlLXRvd24tMjY5OTg1OC9hbXAvMQ?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Sanjay Manjrekar Names Injured Mohammed Siraj's Replacement, Picks His India XI For 3rd Test Against..  NDTVSports.comMatch Preview - South Africa vs India, India in South Africa 2021/22, 3rd Test  ESPNcricinfoR Ashwin can be our spinning all-rounder in any condition - Virat Kohli, India cricket tour of South Africa, 2021-22 | Cricbuzz.com - Cricbuzz  CricbuzzKohli back fit but India lose Siraj for third Test at Newlands  News24I am absolutely fit, says Virat Kohli ahead of 3rd Test but rules out Mohammed Siraj  Times of IndiaView Full coverage on Google News","content":null,"pubDate":"2022-01-10 12:25:20","image_url":null,"source_id":"google"},{"title":"IPL 2022: CVC-owned Ahmedabad franchise eyes Hardik Pandya, Rashid Khan","link":"https://sportstar.thehindu.com/cricket/ipl/ipl-2022-cvc-ahmedabad-franchise-hardik-pandya-rashid-khan-cricket-mumbai-indians/article38217785.ece","keywords":null,"creator":["Shayan Acharya"],"video_url":null,"description":"The development comes after the investment firm CVC Capital Partners, which acquired the Ahmedabad franchise, formally received a Letter of Intent from the Board of Control for Cricket in India.","content":null,"pubDate":"2022-01-10 12:10:57","full_description":null,"image_url":null,"source_id":"sportstar"},{"title":"Sam Billings puts in the miles to pitch up for unexpected England Test debut","link":"https://www.theguardian.com/sport/2022/jan/10/sam-billings-puts-in-the-miles-to-pitch-up-for-overdue-england-test-debut-ashes-australia-cricket","keywords":["Ashes 2021-22","The Ashes","England cricket team","Australia cricket team","Kent","Australia sport","Cricket","Sport"],"creator":["Ali Martin in Hobart"],"video_url":null,"description":"In another era the Kent wicketkeeper-batsman might have played much more red-ball cricket but he is relishing a likely Test debut in HobartGraham Thorpe, the interim head coach, described England’s dressing room as like a scene from *M*A*S*H* during the dramatic drawn Sydney Test. And at the end, after two old warhorses in Jimmy Anderson and Stuart Broad cussedly held firm, one of the injured had to be airlifted out of this gruelling Ashes campaign.Ben Stokes and Jonny Bairstow, so central to the outcome of a bruising battle, have flown with the squad to Hobart hoping to grit their teeth through Friday’s fifth Test with side and thumb problems respectively. Mark Wood is nursing bruised toes from the Pat Cummins yorker that floored him. But Jos Buttler’s broken finger – collateral damage from a Wood delivery that kept low – was bad enough to end his tour of duty. Continue reading...","content":null,"pubDate":"2022-01-10 12:00:49","full_description":"G raham Thorpe, the interim head coach, described England’s dressing room as like a scene from *M*A*S*H* during the dramatic drawn Sydney Test . And at the end, after two old warhorses in Jimmy Anderson and Stuart Broad cussedly held firm, one of the injured had to be airlifted out of this gruelling Ashes campaign. Ben Stokes and Jonny Bairstow, so central to the outcome of a bruising battle, have flown with the squad to Hobart hoping to grit their teeth through Friday’s fifth Test with side and thumb problems respectively. Mark Wood is nursing bruised toes from the Pat Cummins yorker that floored him. But Jos Buttler’s broken finger – collateral damage from a Wood delivery that kept low – was bad enough to end his tour of duty. Bairstow is technically the spare wicketkeeper but the cracked thumb tip he suffered during the first of two belligerent scores of 113 and 41, rules out retaking the gloves. And though Ollie Pope surpassed expectations as a substitute for Buttler behind the stumps, a frontline replacement was sought by an England side trailing 3-0. Enter Sam Billings, fresh from the Big Bash League and having answered a call-up 90 minutes before his intended flight for the T20 team’s upcoming Caribbean tour. Assurances he could still feature against West Indies – even if the first international in Barbados on 22 January comes too soon – were sought by a perennial drinks carrier and now a 10-hour hire car road trip down the east coast, plus isolation at the team hotel, looks set to be rewarded with an unexpected Test debut and becoming England cap No 700. “I am 100% ready if required, and I will give absolutely everything I can,” said Billings. “I have been playing consistent cricket and scoring runs. It doesn’t really matter what format it is, it’s more about rhythm, confidence and mindset. Like any side I go into I will try to make a positive impact on and off the field, in any environment I am put into. “The three guys who came out to bat in Sydney with injuries, that’s incredible courage, and exactly what everyone involved in English cricket is about – playing for each other and that resilience. There’s a lot of inspiration we can take from that as a group, that character and over-my-dead-body attitude.” Billings, 30, makes for interesting case study during English cricket’s current existential crisis. A popular and ever-willing fringe player in the well-stocked white-ball setup – winning 58 ODI and T20 caps from a possible 175 since his debut in 2015 – he is among a generation outside the central contract list who have felt encouraged to pursue globetrotting T20 careers. When picked up by the Indian Premier League in particular, this overlaps with big chunks of the red-ball summer. “It’s a hard one,” said Billings. “I think the contract situation is always a contentious one. As a non-contract [England] player, you have to maximise opportunities because you don’t have that fallback of being picked in the next [national] squad. I’ve only got one career, let’s say five to seven years left of playing cricket. [T20] has been an avenue for me to play cricket. There’s no right or wrong with any of this stuff. It has hampered, I suppose, my chances of playing four-day cricket and ultimately Test cricket.” The 10 first-class matches Billings has played for Kent since a shoulder injury saw him miss out on the 2019 World Cup squad have returned a batting average of 44.58 and three centuries. Along with an orthodox technique, successes against the higher pace of international attacks and solid glovework in all formats, it points to a player who, in a different era, might have stated a greater case than simply being in the same country. His nearest brush with a Test cap came in the summer when he was notably the only IPL returnee to burst out of quarantine and act as reserve wicketkeeper to James Bracey in the 1-0 defeat to New Zealand. Though his career differs to that of Usman Khawaja, his Sydney Thunder teammate, Billings is inspired by the “nothing-to-lose” attitude that saw the Australian seize his chance with sparkling twin centuries at the SCG during what was supposed to be a one-off recall. Billings said: “I thought he spoke fantastically well in terms of having that perspective, having that really open mind to the potential of what’s in front of him, and taking his opportunities. I am in a really good place in my own game. I have made some technical changes over the last few years that I feel have really improved my all-round game regardless of the format, so I’m ready to go if needs be. It doesn’t really matter what format it is, it’s more about rhythm, confidence and mindset.” Billings arrived from the Covid-afflicted BBL but, touch wood, has not contracted the virus since the last English summer. He and Saqib Mahmood, another Caribbean-bound white-ball player, bubbled up and requested separate changing rooms to their Thunder teammates in the past fortnight to cut risk of transmission – with at least four cases in the squad to date, it looks a shrewd call. If picked, Billings would be a fifth Test wicketkeeper for England in the space of 12 months – the sixth if you count Pope’s substitute role – and goes against Chris Silverwood’s stated aim of not wanting to hand out debuts in Australia. As the Ashes battlefield has taught England’s head coach, who rejoins the camp after recovering from Covid-19, plans – best laid or otherwise – can go awry.","image_url":"https://i.guim.co.uk/img/media/1c65b230aae1ee308f4d90664c545e76c8189f71/212_188_3782_2269/master/3782.jpg?width=460&quality=85&auto=format&fit=max&s=8b8e579e886cfc9ecf56b12491e6ba7d","source_id":"theguardian"},{"title":"SA v IND: We have discussed it with Pant, he knows his mistake, says Kohli","link":"https://www.business-standard.com/article/sports/sa-v-ind-we-have-discussed-it-with-pant-he-knows-his-mistake-says-kohli-122011000953_1.html","keywords":null,"creator":null,"video_url":null,"description":"India Test captain Virat Kohli said that they have had conversations with Rishabh Pant in the practice sessions ahead of the third Test starting at the Newlands Cricket Ground from Tuesday","content":null,"pubDate":"2022-01-10 11:41:00","full_description":"India Test captain Virat Kohli said that they have had conversations with wicketkeeper-batter Rishabh Pant in the practice sessions ahead of the third Test starting at the Newlands Cricket Ground from Tuesday. Kohli added that Pant is someone who reflects on his mistakes and will make improvements on them in the future. In the second innings of the second Test at Johannesburg, Pant played a reckless shot to be out for zero. After being beaten outside the off-stump, Kagiso Rabada rattled Pant with a snorter of delivery, by hitting him on the gloves through a ball that bounced a bit. On the very next ball, Pant stepped out to slog on a short ball from Rabada but gave a feather edge behind to Verreynne. The manner of dismissal brought a lot of criticism for Pant from all quarters. \"We have had conversations with Rishabh Pant at practice. The batters know before everybody else whether they've played a shot to get out was the right shot or not. As long as an individual, everyone has to accept that responsibility, I think progress happens from there. We have had made mistakes in our careers in important situations,\" said Kohli in the pre-match press conference on Monday. \"We have been out due to pressure or our mistakes or even the bowler's skills. It is important to understand what was player s mindset and decision at that moment and where did the person make the mistake. Once we find our mistake, we can understand and improve upon it to make sure it doesn't happen,\" added Kohli. Kohli then went on to reveal an advice former India captain MS Dhoni gave him on making mistakes in international cricket. \"MS Dhoni gave me very good advice in the start. He once told me 'there should be a gap of at least 7-8 months between repeating one and another mistake. Only then can you have a long career in international cricket.\" \"This piece of advice really stuck with me that I won't make the same mistake all over again. It happens when you reflect upon your mistakes, which Rishabh does. I know this and will definitely improve going ahead. He will make sure that in important situations, he will stand for the team and will give a big performance after improving from his mistakes.\" Siraj unavailable Talking about his availability for the third Test, Kohli declared himself fit but added that Mohammed Siraj won't be available for the series decider. \"Yes. I'm absolutely fit. Siraj is still recovering from the niggle he had in the last game. At present, I don't think he's match-ready to take the field in the third Test. You cannot risk a guy who isn't 110% as a fast bowler because we know how that little niggle opening up and extending into an injury could be for the team. So, Siraj is not up to the mark but I am absolutely fit to play tomorrow.\" With Siraj unavailable for the winner takes it all affair, it will be a toss-up between Ishant Sharma and Umesh Yadav for another pacer's slot in the playing eleven. Kohli disclosed that the chat on Siraj's replacement is yet to happen within the team. \"We are yet to sit down. Myself, the head coach, vice-captain to decide what we want to do about the replacement. I say because of our bench strength, the fact I had mentioned that it is difficult to figure out who will play because everyone is at the top of their game, bowling well, batting well and these things become a point of discussion, contention.\" \"You have to have a healthy discussion around a decision like that and just agree everyone feels balanced about it. So, we are yet to have that discussion but I would rather be in this position where we have to decide who is going to play rather than to figure out other options with our balance and stuff like that.\" --IANS nr/bsk (Only the headline and picture of this report may have been reworked by the Business Standard staff; the rest of the content is auto-generated from a syndicated feed.)","image_url":"https://bsmedia.business-standard.com/_media/bs/img/article/default/1220110/thumb-122011000953.jpg","source_id":"business-standard"},{"title":"ICC Under-19 World Cup 2022 India Schedule: Dates, venues, timings and India squad; All you need to know","link":"https://www.indiatvnews.com/sports/cricket/icc-under-19-world-cup-2022-india-full-schedule-dates-venues-timings-in-ist-u-19-world-cup-2022-india-squad-details-captain-vice-captain-2022-01-10-753703","keywords":null,"creator":null,"video_url":null,"description":"ICC Under-19 World Cup 2022 India Schedule: Dates, venues, timings and India squad; All you need to know Delhi batsman Yash Dhull will lead the India Under-19 side while Andhra's SK Rasheed has been named his deputy. ICC Under-19 Men's Cricket World Cup to be played in the West Indies from January 14 to February 5, 2022, across four host countries.","content":null,"pubDate":"2022-01-10 11:22:14","full_description":"The four-time champions have named a 17-member squad with five players as stand-by. India have picked two wicket-keepers in the squad in Haryana's Dinesh Bana and Uttar Pradesh's Aaradhya Yadav. The 14th edition of the tournament will see 16 teams competing for the trophy in 48 matches. India is the most successful team having won four titles in 2000, 2008, 2012 and 2018. India have also been runner-up in 2016 and in the previous edition of the tournament held in 2020 in New Zealand. The format will see the top two teams from each of the four groups advance to the Super League while the remaining teams feature in the Plate across 23 days of competition. India U19 are placed in Group B. India will square off against South Africa on January 15 and then the side will lock horns against Ireland and Uganda on January 19 and 22.","image_url":null,"source_id":"indiatvnews"},{"title":"England needs to manage Anderson transition, says Vaughan","link":"https://sportstar.thehindu.com/cricket/ashes-england-need-to-manage-anderson-transition-vaughan/article38216383.ece","keywords":null,"creator":["Reuters"],"video_url":null,"description":"James Anderson is Test cricket's most prolific fast bowler with 640 wickets to his name, but former captain Michael Vaughan said it was time England begins to phase him out.","content":null,"pubDate":"2022-01-10 10:54:28","full_description":null,"image_url":null,"source_id":"sportstar"},{"title":"BCCI postpones Cooch Behar Trophy knockout games after massive COVID-19 outbreak","link":"https://www.indiatvnews.com/sports/cricket/bcci-postpones-cooch-behar-trophy-knockout-games-after-massive-covid-19-outbreak-2022-01-10-753695","keywords":null,"creator":null,"video_url":null,"description":"The Indian cricket board (BCCI) on Monday decided to postpone the knockout matches of the U-19 Cooch Behar Trophy due to an alarming number of COVID-19 cases among the participating teams.","content":null,"pubDate":"2022-01-10 10:53:30","full_description":"The Indian cricket board (BCCI) on Monday decided to postpone the knockout matches of the U-19 Cooch Behar Trophy due to an alarming number of COVID-19 cases among the participating teams. Around 50 positive cases across eight teams were detected ahead of the knockout stage beginning in Pune on Tuesday, news agency PTI reported. \"The Board of Control for Cricket in India (BCCI) on Monday announced the postponement of the knockout stage matches of the Cooch Behar Trophy following some positive COVID-19 cases within the team environment,\"said BCCI in a statement. \"Keeping everyone's health and safety in mind, the knockout matches to be held in Pune have been put on hold until further notice. The BCCI had conducted 93 matches across 20 venues in the league stage. The Board will continue to monitor the situation and identify a new window once the situation improves.\" Last week, the BCCI was forced to postpone all domestic events including the premier Ranji Trophy due to a surge in COVID-19 cases across the country. \"The decision was taken after around 50 positive cases were found, the report came last night and a decision to postpone the tournament was taken this morning,\" said a BCCI source. The tournament was to be played across four venues in Pune. As many as 1,79,723 new cases were reported in India on Monday.","image_url":null,"source_id":"indiatvnews"},{"title":"ICC Under-19 World Cup 2022 Full Schedule: Dates, venues and timings; all you need to know","link":"https://www.indiatvnews.com/sports/cricket/icc-under-19-world-cup-2022-full-schedule-dates-venues-timings-in-ist-u-19-world-cup-schedule-all-you-need-to-know-2022-01-10-753691","keywords":null,"creator":null,"video_url":null,"description":"ICC Under-19 World Cup 2022 Full Schedule The 2022 ICC Under-19 World Cup will be held in the West Indies between January 14-5 February with 16 teams taking part in the mega event. In what will be the 14th edition of the U-19 Cricket World Cup, the tournament comprises of 48 ODIs and will be played in Antigua, Guyana, Saint Kitts and Trinidad with Antigua hosting the final.","content":null,"pubDate":"2022-01-10 10:39:55","full_description":"Here's the full schedule of the ICC U-19 Cricket World Cup 2022. West Indies U19 vs Australia U19, 1st Match, Group D Providence Stadium, Guyana 7:30 PM Sri Lanka U19 vs Scotland U19, 2nd Match, Group D Everest Cricket Club Ground, Georgetown 7:30 PM Pakistan U19 vs Papua New Guinea U19, 6th Match, Group C Queen's Park Oval, Port of Spain, Trinidad 7:30 PM Ireland U19 vs Uganda U19, 5th Match, Group B Everest Cricket Club Ground, Georgetown 7:30 PM Canada U19 vs United Arab Emirates U19, 3rd Match, Group A Conaree Sports Club, Basseterre 7:30 PM Bangladesh U19 vs England U19, 7th Match, Group A Warner Park, Basseterre, St Kitts 7:30 PM Afghanistan U19 vs Zimbabwe U19, 8th Match, Group C Diego Martin Sporting Complex, Diego Martin 7:30 PM West Indies U19 vs Scotland U19, 9th Match, Group D Warner Park, Basseterre, St Kitts 7:30 PM Australia U19 vs Sri Lanka U19, 10th Match, Group D Conaree Sports Club, Basseterre 7:30 PM Afghanistan U19 vs Papua New Guinea U19, 13th Match, Group C Diego Martin Sporting Complex, Diego Martin 7:30 PM South Africa U19 vs Uganda U19, 12th Match, Group B Queen's Park Oval, Port of Spain, Trinidad 7:30 PM England U19 vs Canada U19, 11th Match, Group A Warner Park, Basseterre, St Kitts 7:30 PM Australia U19 vs Scotland U19, 14th Match, Group D Conaree Sports Club, Basseterre 7:30 PM Zimbabwe U19 vs Papua New Guinea U19, 19th Match, Group C Diego Martin Sporting Complex, Diego Martin 7:30 PM Pakistan U19 vs Afghanistan U19, 18th Match, Group C Brian Lara Stadium, Tarouba, Trinidad 7:30 PM Bangladesh U19 vs Canada U19, 17th Match, Group A Conaree Sports Club, Basseterre 7:30 PM England U19 vs United Arab Emirates U19, 16th Match, Group A Warner Park, Basseterre, St Kitts 7:30 PM West Indies U19 vs Sri Lanka U19, 20th Match, Group D Conaree Sports Club, Basseterre 7:30 PM South Africa U19 vs Ireland U19, 21st Match, Group B Brian Lara Stadium, Tarouba, Trinidad 7:30 PM Bangladesh U19 vs United Arab Emirates U19, 22nd Match, Group A Warner Park, Basseterre, St Kitts 7:30 PM Pakistan U19 vs Zimbabwe U19, 24th Match, Group C Queen's Park Oval, Port of Spain, Trinidad 7:30 PM TBC vs TBC, Plate Quarter-Final 1 (A3 v B4) Queen's Park Oval, Port of Spain, Trinidad 7:30 PM TBC vs TBC, Plate Quarter-Final 2 (B3 v A4) Brian Lara Stadium, Tarouba, Trinidad 7:30 PM TBC vs TBC, Super League Quarter-Final (A1 v B2) Sir Vivian Richards Stadium, North Sound, Antigua 7:30 PM TBC vs TBC, Plate Quarter-Final 3 (C3 v D4) Queen's Park Oval, Port of Spain, Trinidad 7:30 PM TBC vs TBC, Plate Quarter-Final 4 (D3 v C4) Diego Martin Sporting Complex, Diego Martin 7:30 PM TBC vs TBC, Super League Quarter-Final 4 (D1 v C2) Coolidge Cricket Ground, Antigua 7:30 PM TBC vs TBC, Plate Playoff Semi-Final 1 Diego Martin Sporting Complex, Diego Martin 7:30 PM TBC vs TBC, Plate Semi-Final 1 Queen's Park Oval, Port of Spain, Trinidad 7:30 PM TBC vs TBC, Super League Quarter-Final 3 (C1 v D2) Sir Vivian Richards Stadium, North Sound, Antigua 7:30 PM TBC vs TBC, Super League Quarter-Final 2 (B1 v A2) Coolidge Cricket Ground, Antigua 7:30 PM TBC vs TBC, Plate Playoff Semi-Final 2 Brian Lara Stadium, Tarouba, Trinidad 7:30 PM TBC vs TBC, Plate Semi-Final 2 Queen's Park Oval, Port of Spain, Trinidad 7:30 PM TBC vs TBC, 13th Place Playoff Diego Martin Sporting Complex, Diego Martin 7:30 PM TBC vs TBC, 15th Place Playoff Brian Lara Stadium, Tarouba, Trinidad 7:30 PM TBC vs TBC, Super League Playoff Semi-Final 1 Sir Vivian Richards Stadium, North Sound, Antigua 7:30 PM TBC vs TBC, Super League Playoff Semi-Final 2 Coolidge Cricket Ground, Antigua 7:30 PM TBC vs TBC, Plate Final Queen's Park Oval, Port of Spain, Trinidad 7:30 PM TBC vs TBC, 11th Place Playoff Diego Martin Sporting Complex, Diego Martin 7:30 PM TBC vs TBC, Super League Semi-Final 1 Sir Vivian Richards Stadium, North Sound, Antigua 7:30 PM TBC vs TBC, Super League Semi-Final 2 Coolidge Cricket Ground, Antigua 7:30 PM TBC vs TBC, 5th Place Playoff Sir Vivian Richards Stadium, North Sound, Antigua 7:30 PM TBC vs TBC, 7th Place Playoff Coolidge Cricket Ground, Antigua 7:30 PM TBC vs TBC, 3rd Place Playoff Coolidge Cricket Ground, Antigua 7:30 PM TBC vs TBC, Final Sir Vivian Richards Stadium, North Sound, Antigua 7:30 PM","image_url":null,"source_id":"indiatvnews"},{"title":"Three victories for Albany and Districts on day one of junior country week","link":"https://thewest.com.au/news/albany-advertiser/mixed-results-for-albany-and-districts-to-start-annual-junior-country-week-tournament-in-perth-c-5251695","keywords":null,"creator":["Taj Stubber"],"video_url":null,"description":"The Albany and Districts Cricket Association sent away three strong sides to the annual junior country week tournament.","content":null,"pubDate":"2022-01-10 10:18:00","full_description":null,"image_url":"https://images.thewest.com.au/publication/C-5251695/67eb7cf1d3cf6787efff51641995f480627009c1-16x9-x0y313w6000h3375.jpg","source_id":"thewest"},{"title":"Burning questions: Did Cummins get declaration wrong?","link":"https://www.cairnspost.com.au/sport/cricket/ashes-202122-burning-questions-for-australia-ahead-of-hobart-test/news-story/9493510754565548a19185c6ec0d69e2","keywords":["Cricket news and galleries","Sport news and galleries"],"creator":null,"video_url":null,"description":"Talk about the majesty of Test cricket …","content":null,"pubDate":"2022-01-10 07:27:00","full_description":null,"image_url":null,"source_id":"cairnspost"},{"title":"India vs South Africa: Virat Kohli Closes In On Rahul Dravid In Elite List Topped By Sachin Tendulka.. - NDTV Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMiogFodHRwczovL3Nwb3J0cy5uZHR2LmNvbS9zb3V0aC1hZnJpY2EtdnMtaW5kaWEtMjAyMS0yMi9pbmRpYS12cy1zb3V0aC1hZnJpY2EtdmlyYXQta29obGktY2xvc2VzLWluLW9uLXJhaHVsLWRyYXZpZC1pbi1lbGl0ZS1saXN0LXRvcHBlZC1ieS1zYWNoaW4tdGVuZHVsa2FyLTI2OTg5OTDSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"India vs South Africa: Virat Kohli Closes In On Rahul Dravid In Elite List Topped By Sachin Tendulka..  NDTV SportsIND vs SA: Virat Kohli on brink of breaking massive Rahul Dravid’s record as India gear up for final Test in Cape Town  Hindustan TimesVirat Kohli returns as India look to hit back against South Africa  Economic TimesVirat Kohli Hits Nets In Cape Town Ahead Of 3rd Test vs South Africa. See Pics  NDTVSports.comIND vs SA: Big Boost For Indian Team As Virat Kohli Starts Batting In Nets Ahead Of 3rd Test In Cape Town  Cricket AddictorView Full coverage on Google News","content":null,"pubDate":"2022-01-10 07:27:00","image_url":null,"source_id":"google"},{"title":"Nagaon win by 2 wickets","link":"https://www.sentinelassam.com/sports/cricket/nagaon-win-by-2-wickets-572455","keywords":["Sports,Cricket"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"Nagaon defeated Morigaon by 2 wickets in the JK Baruah Cricket held at Nagaon today.","content":"GUWAHATI, Jan 9: Nagaon defeated Morigaon by 2 wickets in the JK Baruah Cricket held at Nagaon today. Brief scores of different matches held on Sunday: Central Assam Zone (Venue– Nagaon): Morigaon 84 (28.3 overs)- Chandan Das 26, Faruk Sheikh 3-21, Nildipta Kashyap 3-13; Nagaon 85/8 (25.3 overs), Washim Ullah Khan 26, Priyangshu Dutta 33, Aziz Hassan 3-31, Shibaji Chowdhury 3-14. Northern Assam Zone (Venue- Dhemaji): Lakhimpur 105 (37.1 overs)- Kuldeep Gogoi 37; Biswanath 110/7 (34.5 overs), Dipankar Borah 34, Upper Assam Zone (Venue– Dibrugarh): Jorhat 161/9 (40 overs), Bhargav Dutta 33; Sibasagar 69 (27.1 overs), Debojit Borah 5-10. Lower Assam Zone (Venue – Barpeta): Kokrajhar 204 (40 overs)- Sagar Das 53, Samir Sutradhar 44, Harshit Raj Alamyan 3-27; Nalbari 125 ( 32.4 overs), Samrat Biswas 3-9.Also read: Secretary XI beat Guwahati by 9 runsAlso watch: ","pubDate":"2022-01-10 07:09:10","full_description":"GUWAHATI, Jan 9: Nagaon defeated Morigaon by 2 wickets in the JK Baruah Cricket held at Nagaon today. Brief scores of different matches held on Sunday: Central Assam Zone (Venue– Nagaon): Morigaon 84 (28.3 overs)- Chandan Das 26, Faruk Sheikh 3-21, Nildipta Kashyap 3-13; Nagaon 85/8 (25.3 overs), Washim Ullah Khan 26, Priyangshu Dutta 33, Aziz Hassan 3-31, Shibaji Chowdhury 3-14. Northern Assam Zone (Venue- Dhemaji): Lakhimpur 105 (37.1 overs)- Kuldeep Gogoi 37; Biswanath 110/7 (34.5 overs), Dipankar Borah 34, Upper Assam Zone (Venue– Dibrugarh): Jorhat 161/9 (40 overs), Bhargav Dutta 33; Sibasagar 69 (27.1 overs), Debojit Borah 5-10. Lower Assam Zone (Venue – Barpeta): Kokrajhar 204 (40 overs)- Sagar Das 53, Samir Sutradhar 44, Harshit Raj Alamyan 3-27; Nalbari 125 ( 32.4 overs), Samrat Biswas 3-9. Also read: Secretary XI beat Guwahati by 9 runs Also watch:","image_url":"https://assets.sentinelassam.com/h-upload/2022/01/10/295801-local.jpg","source_id":"sentinel"},{"title":"Watch: Ben Stokes' Epic Reaction To \"Nervy\" Final Over Of 4th Ashes Test Against Australia - NDTV Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMiggFodHRwczovL3Nwb3J0cy5uZHR2LmNvbS90aGUtYXNoZXMtMjAyMS0yMi9iZW4tc3Rva2VzLWVwaWMtcmVhY3Rpb24tdG8tbmVydnktZmluYWwtb3Zlci1vZi00dGgtdGVzdC1hZ2FpbnN0LWF1c3RyYWxpYS13YXRjaC0yNjk5MDg00gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Watch: Ben Stokes' Epic Reaction To \"Nervy\" Final Over Of 4th Ashes Test Against Australia  NDTV SportsTest cricket didn't just win, it showed why it will always win, Australia, England cricket, Ashes | Cricbuzz.com - Cricbuzz  CricbuzzAustralia's Intimidating Field Set Against England in Epic Test is Photo Worth Framing  News18England hold on for Ashes draw at SCG  Western AdvocateWatch: Joe Root's Poor Form Against Scott Boland Continues, Loses His Wicket Again  NDTVSports.comView Full coverage on Google News","content":null,"pubDate":"2022-01-10 07:04:11","image_url":null,"source_id":"google"},{"title":"Watch: Ben Stokes' Epic Reaction To \"Nervy\" Final Over Of 4th Ashes Test","link":"https://sports.ndtv.com/cricket/ben-stokes-epic-reaction-to-nervy-final-over-of-4th-test-against-australia-watch-2699084","keywords":null,"creator":null,"video_url":null,"description":"While cricket fans all over the world couldn't take their eyes off their television screens, Ben Stokes' epic reaction, amidst all the drama on the pitch, was caught on camera.","content":null,"pubDate":"2022-01-10 07:04:02","full_description":"It was deja vu all over again as the Sydney Cricket Ground (SCG) witnessed yet another Test match that went right down to the wire. After India's historic escape from the jaws of defeat against Australia last year, England staged a similar, yet slightly different fight back against the hosts on Day 5 of the fourth Ashes Test on Sunday . While India went on to win the series in Australia last year, England ended Australia's hopes of pulling off a whitewash in the five-match series. With Australia needing just two wickets in the final three overs, England tailenders somehow managed to survive, salvaging a well-deserved draw at the SCG. After Jack Leach and Stuart Broad played 69 deliveries between them before the former was dismissed by Steve Smith on the final ball of the 100th over. Broad contained Nathan Lyon's pressure in the penultimate over before James Anderson managed to see off a tense final over from Smith. While cricket fans all over the world couldn't take their eyes off their television screens, Ben Stokes' epic reaction amidst all the drama on the pitch was caught on camera. Promoted The all-rounder, who scored half-centuries in both the innings, couldn't bear watching the proceedings from the dugout. In fact, he had his head buried inside his t-shirt as Anderson blocked all the deliveries of the final over. Look at @benstokes38 . ???????????? #Ashes . #AUSvENG . pic.twitter.com/JUGE0ghXsT The fifth and final Test will be a day-night affair, starting January 14 at the Blundstone Arena in Hobart. England, however, will miss wicketkeeper-batter Jos Buttler during the final game as he will fly back to the UK after suffering a broken finger.","image_url":"https://c.ndtvimg.com/2022-01/tu38cqd8_ben-stokes-reaction_120x90_10_January_22.jpg","source_id":"ndtv"},{"title":"“Necessary” for obvious reasons","link":"https://sportstar.thehindu.com/magazine/last-word/last-word-book-review-pradeep-magazine-ayaz-memon-indian-cricket-kashmir-memoir/article38213624.ece","keywords":null,"creator":["Suresh Menon"],"video_url":null,"description":"Ayaz Memon and Pradeep Magazine have just published books that are best described as “necessary”. Magazine’s Not Just Cricket is a memoir of cricket, Kashmir and journalism while Ayaz has edited Indian Innings: The Journey of Indian Cricket from 1947.","content":null,"pubDate":"2022-01-10 06:22:40","full_description":null,"image_url":null,"source_id":"sportstar"},{"title":"NZ vs BAN, 2nd Test: Boult scalps 300 Test wickets, becomes 2nd fastest New Zealander to achieve this feat","link":"https://www.indiatvnews.com/sports/cricket/nz-vs-ban-2nd-test-trent-boult-scalps-300-test-wickets-becomes-2nd-fastest-new-zealander-to-achieve-this-feat-2022-01-10-753650","keywords":null,"creator":null,"video_url":null,"description":"New Zealand's speedster- Trent Boult achieved yet another milestone in the Test cricket. On Monday, Boult reached the mark of 300 Test wickets as he took a fifer against Bangladesh on Day 2 of the ongoing second Test match at Hagley Oval, Christchurch. The left-arm pacer achieved this feat in the 75th Test, while Richard Hadlee clinched the same in 61 matches, making Boult the 2nd fastest New Zealander to clinch the elusive feat.","content":null,"pubDate":"2022-01-10 06:17:49","full_description":"New Zealand's speedster- achieved yet another milestone in the Test cricket. On Monday, Boult reached the mark of 300 Test wickets as he took a fifer against Bangladesh on Day 2 of the ongoing second Test match at Hagley Oval, Christchurch. The left-arm pacer achieved this feat in the 75th Test, while Richard Hadlee clinched the same in 61 matches, making Boult the 2nd fastest New Zealander to clinch the elusive feat. By ticking this record in his checklist, Boult has also become the 36th bowler in the world and the fourth bowler from New Zealand to do so. Besides, his fifer has come as his ninth five wicket haul in the longest format of the game. 61 - Richard Hadley 75 - Trent Boult 76 - 94 - Daniel Vettori 431 - Richard Hadlee 361 - Daniel Vettori 328 - Tim Southee 301 - Trent Boult 233 - Chris Martin After being put to bat first, New Zealand declared their first innings at 521/6 with crucial knocks from captain Tom Latham (252 runs) and Devon Conway (109 runs). In reply, Bangladesh's first innings was reduced to just 126 runs. For New Zealand, Trent Boult took 5 wickets giving 43 runs in 13.2 overs.","image_url":null,"source_id":"indiatvnews"},{"title":"Cricket-Injured Stokes still hopes to play in fifth test: Anderson","link":"https://www.thestar.com.my/sport/cricket/2022/01/10/cricket-injured-stokes-still-hopes-to-play-in-fifth-test-anderson","keywords":null,"creator":null,"video_url":null,"description":"(Reuters) - All-rounder Ben Stokes hopes to be fit enough for the fifth and final Ashes test against Australia despite suffering a side strain while bowling in Sydney, England team mate James Anderson said. Read full story","content":null,"pubDate":"2022-01-10 06:12:00","full_description":"(Reuters) - All-rounder Ben Stokes hopes to be fit enough for the fifth and final Ashes test against Australia despite suffering a side strain while bowling in Sydney, England team mate James Anderson said. Stokes was treated for tightness in his left side just before lunch on the second day of the fourth test and has had a scan to determine the seriousness of the injury. While Stokes did not bowl in the second innings, he chipped in with the bat, scoring 60 runs as England held on for a draw. \"He's already saying that it feels a bit better,\" Anderson told the BBC on Sunday. \"He's still got his sights on playing that fifth test.\" Anderson added that Stokes' willingness to play through the pain showed how committed he was to the team. \"It shows what playing for this team means to him,\" Anderson said. \"Even though we're 3-0 down. It would be very easy for him to say 'I've pulled my side, I'll go home and get it sorted'. \"If you've never pulled your side, you don't know what pain like that is like. Every breath, you feel it. There are certain movements that are really painful.\" The fifth test will be played at the Bellerive Oval in Hobart between Jan. 14-18. Australia lead the five-match series 3-0. (Reporting by Aadi Nair in Bengaluru; Editing by Peter Rutherford)","image_url":null,"source_id":"thestar_my"}]}