{"newsArray":[{"title":"IPL public sale 2023: Curran invoice, a determine match for the Kings","link":"https://www.thetimesofbengal.com/sports/ipl-public-sale-2023-curran-invoice-a-determine-match-for-the-kings/","keywords":["Sports"],"creator":["admin"],"video_url":null,"description":"Categorical Information Service CHENNAI: December. Kings XI Punjab. Sam Curran turned one of many costliest The post IPL public sale 2023: Curran invoice, a determine match for the Kings appeared first on The Times of Bengal.","content":"Categorical Information Service CHENNAI: December. Kings XI Punjab. Sam Curran turned one of many costliest gamers on the mini-auction. The 12 months was 2018. The southpaw was a 20-year-old who was simply starting to switch his long-format abilities to the shortest one. His very second IPL recreation in 2019 noticed why the franchise made him a millionaire. He opened the batting (20 off 10) and opened the bowling earlier than choosing up a hat-trick on the dying. He helped his staff full an exhilarating 14-run heist over Delhi Capitals. Some three years and 5 days later, the now-rebranded Punjab Kings repeated that very same trick to make Curran the priciest IPL participant ever, signing him for a cool Rs 18.5 crore. However what Punjab are getting in 2022 is the actual deal. Once they made him a millionaire the primary time, they’d paid for potential, a tough jewel. Now? He is one of many best bowling all-rounders within the format, a refined diamond. Why is he the league’s costliest participant of all time? Whereas the mini-auction and recency bias has performed a job — he was the World T20 MVP — the skillsets he brings are very distinctive. Consider him as a Santa that has presents for all age teams. An all-phase bowler? Examine. Left-arm pacer? Examine. A lower-order hitter who can bat anyplace from No. 1 to No. 8? Examine. It is nearly like he is the Swiss Military Knives amongst cricketers within the shortest format. To stay with that very same dodgy analogy, he has upgraded a lot of the instruments in his Swiss Military Knife. He has a number of yorkers up his sleeve in addition to a imply slower ball, two essential weapons on the dying (it is what has made him right into a death-overs operator for England). With the brand new ball, his pure angle is a bonus. That he may extract some motion off the strip with the brand new ball makes him a wicket-taking possibility on the prime, though England do not use him on this function. It is doubtless Kings will backload Curran as a result of they did have issues on this facet final season. That Curran is a helpful lower-order hitter additionally helped bump up the value. His presence additionally permits the franchise to frontload Kagiso Rabada, who has discovered himself on the receiving finish of some punishment within the dying overs. Curran’s major worth is ‘unerring accuracy’ when batters are at their most aggressive. On the T20 World Cup, he gave away 70 runs from 64 balls when bowling within the final 4 overs, choosing up 9 wickets within the course of and solely conceding 4 fours and two sixes within the course of. These are obscene numbers. Certain, you’ll be able to argue that early-season worldwide cricket on greater grounds in Australia might be very completely different from taking part in on smallish Indian grounds in Summer time. However Curran was one of many stars of the staff’s T20 efficiency in Pakistan simply earlier than the World Cup. His financial system fee was 7.47 throughout six video games whereas choosing up seven wickets at 24.57. “Sam Curran has stepped up and been an absolute revelation,” Buttler had mentioned after Curran was adjudged man of the World Cup in Australia. “He is an excellent cricketer, he loves these crunch moments and he is a deserved participant of the event. He is a prime performer. He is solely going to get higher and higher although as he is nonetheless a younger man. However he is acquired plenty of expertise already on his shoulders and he simply needs the ball.” You solely should hearken to former England captain, Eoin Morgan, who gave Curran his white ball break. “He’s a man who compartmentalises issues very properly which is a large attribute to have if you end up a dying bowler,” he was quoted as saying by sky sports activities in October. “You could have to have the ability to park a foul ball when you have been smashed for a six or consecutive sixes and get again within the recreation and he has the flexibility to try this. Sam isn’t afraid to attempt issues.” If you take a look at the switch historical past of the franchise, they have an inclination to overspend or make questionable choices. Like shopping for Curran in 2018. However now, this may very well be a ‘W’. CHENNAI: December. Kings XI Punjab. Sam Curran turned one of many costliest gamers on the mini-auction. The 12 months was 2018. The southpaw was a 20-year-old who was simply starting to switch his long-format abilities to the shortest one. His very second IPL recreation in 2019 noticed why the franchise made him a millionaire. He opened the batting (20 off 10) and opened the bowling earlier than choosing up a hat-trick on the dying. He helped his staff full an exhilarating 14-run heist over Delhi Capitals. Some three years and 5 days later, the now-rebranded Punjab Kings repeated that very same trick to make Curran the priciest IPL participant ever, signing him for a cool Rs 18.5 crore. However what Punjab are getting in 2022 is the actual deal. Once they made him a millionaire the primary time, they’d paid for potential, a tough jewel. Now? He is one of many best bowling all-rounders within the format, a refined diamond. Why is he the league’s costliest participant of all time? Whereas the mini-auction and recency bias has performed a job — he was the World T20 MVP — the skillsets he brings are very distinctive. Consider him as a Santa that has presents for all age teams. An all-phase bowler? Examine. Left-arm pacer? Examine. A lower-order hitter who can bat anyplace from No. 1 to No. 8? Examine. It is nearly like he is the Swiss Military Knives amongst cricketers within the shortest format. To stay with that very same dodgy analogy, he has upgraded a lot of the instruments in his Swiss Military Knife. He has a number of yorkers up his sleeve in addition to a imply slower ball, two essential weapons on the dying (it is what has made him right into a death-overs operator for England). With the brand new ball, his pure angle is a bonus. That he may extract some motion off the strip with the brand new ball makes him a wicket-taking possibility on the prime, though England do not use him on this function. It is doubtless Kings will backload Curran as a result of they did have issues on this facet final season. That Curran is a helpful lower-order hitter additionally helped bump up the value. His presence additionally permits the franchise to frontload Kagiso Rabada, who has discovered himself on the receiving finish of some punishment within the dying overs. Curran’s major worth is ‘unerring accuracy’ when batters are at their most aggressive. On the T20 World Cup, he gave away 70 runs from 64 balls when bowling within the final 4 overs, choosing up 9 wickets within the course of and solely conceding 4 fours and two sixes within the course of. These are obscene numbers. Certain, you’ll be able to argue that early-season worldwide cricket on greater grounds in Australia might be very completely different from taking part in on smallish Indian grounds in Summer time. However Curran was one of many stars of the staff’s T20 efficiency in Pakistan simply earlier than the World Cup. His financial system fee was 7.47 throughout six video games whereas choosing up seven wickets at 24.57. “Sam Curran has stepped up and been an absolute revelation,” Buttler had mentioned after Curran was adjudged man of the World Cup in Australia. “He is an excellent cricketer, he loves these crunch moments and he is a deserved participant of the event. He is a prime performer. He is solely going to get higher and higher although as he is nonetheless a younger man. However he is acquired plenty of expertise already on his shoulders and he simply needs the ball.” You solely should hearken to former England captain, Eoin Morgan, who gave Curran his white ball break. “He’s a man who compartmentalises issues very properly which is a large attribute to have if you end up a dying bowler,” he was quoted as saying by sky sports activities in October. “You could have to have the ability to park a foul ball when you have been smashed for a six or consecutive sixes and get again within the recreation and he has the flexibility to try this. Sam isn’t afraid to attempt issues.” If you take a look at the switch historical past of the franchise, they have an inclination to overspend or make questionable choices. Like shopping for Curran in 2018. However now, this may very well be a ‘W’. Source link The post IPL public sale 2023: Curran invoice, a determine match for the Kings appeared first on The Times of Bengal.","pubDate":"2022-12-23 19:45:30","image_url":null,"source_id":"the_tob","country":["india"],"category":["sports"],"language":"english"},{"title":"Sam Curran turns into costliest participant in IPL historical past","link":"https://www.thetimesofbengal.com/sports/sam-curran-turns-into-costliest-participant-in-ipl-historical-past/","keywords":["Sports"],"creator":["admin"],"video_url":null,"description":"Sam Curran broke Chris Morris’ document (INR 16.25 crore) to grow to be the most The post Sam Curran turns into costliest participant in IPL historical past appeared first on The Times of Bengal.","content":"Sam Curran broke Chris Morris’ document (INR 16.25 crore) to grow to be the most costly purchase at an IPL public sale, when Punjab Kings outbid 5 different groups to signal him for INR 18.50 crore (USD 2.25 million roughly). At that worth, Curran can be the most costly participant in IPL historical past – much more than retained gamers like Virat Kohli and KL Rahul – and he was reunited with the franchise that first introduced him into the IPL with an INR 7.2-crore bid in 2019. The England allrounder was the Participant of the Last and the Match on the 2022 T20 World Cup in Australia, and since September this 12 months he has taken 25 wickets in 14 T20s at an economic system price of seven.08. He has additionally improved his batting, particularly towards spin: in 31 T20 innings since 2020, he has a mean of 27.07 and a strike price of 154.69. “Completely overwhelmed and extremely humbled to obtain that bid,” Curran instructed Star Sports activities. “Punjab is the place I did my debut season a couple of years in the past … Will probably be very completely different however I do know the stadium at Mohali fairly properly, and absolutely our team-mates will assist me … Extremely excited to return to India for this large alternative. So many issues operating by means of my thoughts. At 9am this morning I used to be struggling to discover a stream, it [the auction] wasn’t on TV in England. ̛I sat with my girlfriend and her dad to observe it. I really turned my cellphone off as a result of I believed I used to be behind and did not wish to see any messages saying congrats. I noticed the bids coming from Mumbai, then Chennai, having performed for Chennai earlier it was cool to see them [bidding].” Mumbai Indians went so far as INR 18.25 crore to try to line-up Curran alongside Jofra Archer, their different big-ticket England signing on the earlier public sale, however they have been ultimately outbid by Punjab, who had begun the public sale with the second-largest purse. Shortly after failing to purchase Curran, Mumbai received their palms on Cameron Inexperienced for INR 17.50 crore, making the 23-year previous Australian allrounder the second costliest participant in IPL public sale historical past. “I am pinching myself that this has all occurred. It is such a bizarre feeling watching an public sale for your self. I can not consider how nervous I used to be, and I used to be shaking like something when the ultimate name was confirmed,” Inexperienced stated. “I’ve all the time been an enormous fan of the IPL and it will be so cool to be part of it. The Mumbai Indians are one of many powerhouses of the competitors, so I really feel very humbled to be becoming a member of them. I can not wait to get there subsequent 12 months.” Inexperienced’s T20 shares have risen considerably within the final six months. Not a part of Australia’s T20 World Cup squad initially, he was a last-minute inclusion after Josh Inglis picked up an harm whereas enjoying golf. Inexperienced attracted the eye of IPL crew scouts in a giant method after a prolific T20I collection in India this 12 months, the place he made 118 runs, together with two half-centuries, at a strike price of 214.54 on the high of the order. His means to bat wherever within the order and bowl at a energetic tempo went in his favour on the public sale. Ben Stokes then turned Chennai Tremendous Kings’ costliest signing in an public sale at INR 16.25 crore, which additionally made him the joint-third costliest participant ever at an public sale. Stokes will line up alongside MS Dhoni within the IPL as soon as once more, after a short stint collectively at Rising Pune Supergiants. Royal Challengers Bangalore and Rajasthan Royals additionally bid for Stokes, but it surely quickly turned clear that their restricted budgets can be a constraint. Having come into the public sale with INR 20.45 crore, Tremendous Kings spent almost 80% of their finances on Stokes alone. He’s additionally a viable captaincy candidate because the franchise begins to discover the concept of succession planning after Dhoni. Sunrisers break the financial institution for Brook and Agarwal Harry Brook additionally made a splash when Sunrisers Hyderabad staved off aggressive bidding from Rajasthan Royals to purchase the England batter for INR 13.25 crore (USD 1.6 million approx.), essentially the most a franchise has paid to signal an abroad batter at an public sale. Brook, 23, is ready to function in his first IPL season following a breakout 12 months in worldwide cricket. Solely two months in the past in Pakistan – his first worldwide abroad journey – Brook impressed together with his power-hitting to win the Participant-of-the-Collection award after hitting 238 runs at a strike price of 163.01, in a T20I collection that England gained 4-3. Brook’s superior document throughout all T20s in Asia – 581 runs in 16 innings at a strike price of 167.43 – might have been a lovely proposition for groups. Extra just lately, Brook put behind a disappointing T20 World Cup marketing campaign to blast three centuries within the three-Take a look at collection that England gained 3-0 in Pakistan. Having signed Brook, Sunrisers additionally went onerous to safe opening batter Mayank Agarwal for INR 8.25 crore (USD 1 million approx.), thereby spending almost 51% of their public sale purse of INR 42.25 crore on back-to-back buys. This meant Sunrisers, who went as excessive as INR 14.75 crore to try to get Stokes, ultimately missed out on a marquee allrounder. Pooran takes dwelling greater than 1,000,000 {dollars} once more Nicholas Pooran started the 12 months by turning into the most costly West Indian ever bought at an IPL public sale, and he broke that document once more when Lucknow Tremendous Giants spent INR 16 crore (USD 2 million approx.) to purchase him. For some time, the combat for Pooran gave the impression to be a contest between Delhi Capitals and Rajasthan Royals, however as soon as Tremendous Giants swooped in with a bid nearing 1,000,000 {dollars}, it turned a two-team race between them and Capitals. Pooran’s endured a combined 12 months so far as his worldwide profession is anxious. He was named Kieron Pollard’s successor as West Indies’ T20I captain however stepped down following a dismal T20 World Cup marketing campaign the place West Indies didn’t make it out of the primary spherical after losses to Scotland and Eire. He had an honest IPL 2022, although, being among the many few notable performers in a disappointing season for Sunrisers. He made 306 runs together with two fifties at a mean of 38.25 and a strike price of 144.33. His power-hitting means was most just lately seen within the Abu Dhabi T10, the place he was adjudged Participant of the Match for his 345 runs, which got here at a mean of 49.28 and an exceptional strike price of 234.69. The discount buys Sikandar Raza broke an eight-year barren run when he turned the primary Zimbabwean to be purchased at an IPL public sale since Brendan Taylor in 2014. At his base worth of INR 50 lakh, Raza might be a steal for Punjab, given the shape he is been in. Raza was the highest run-getter (219 at a strike price of 147) and second highest wicket-taker (ten wickets) for Zimbabwe on the T20 World Cup. “As a good friend, I want somebody picks him,” Hardik Pandya stated with fun, when requested about Kane Williamson at a press convention previous to India’s T20I collection towards New Zealand final month. Now, they’ll crew up at Gujarat Titans, who secured Williamson’s providers at his base worth of INR 2 crore. At Titans, Williamson may also be reunited together with his one-time Sunrisers team-mate Rashid Khan. Having performed only one IPL recreation thus far, in 2021 for Punjab Kings, Adil Rashid will hope for a happier second stint. At INR 2 crore, the England legspinner was a steal for Sunrisers, who might have maybe been stunned on the lack of competitors. A key member of England’s T20 World Cup-winning squad, Rashid has a superb incorrect’un, bowls ripping legbreaks, and he can bowl within the powerplay too. And he’ll most likely be among the many most explosive batting choices at No. 10. Royal Challengers’ new signing Reece Topley had missed out on England’s T20 World Cup squad due to harm however he had a run of spectacular performances within the lead-up to the event. Topley’s top permits him to extract steep bounce even on docile surfaces and he has the power to maneuver the ball each methods. With Josh Hazlewood’s workload more likely to be monitored, given Australia have probably the World Take a look at Championship ultimate and Ashes arising after the IPL, Topley is a superb back-up choice for Royal Challengers at a base worth of INR 1.5 crore. “We needed to have a like-for-like substitute for Jason Behrendorff,” RCB head coach Sanjay Bangar stated. “We have stored tab on a lot of the left-armers obtainable. Josh is not going to be obtainable for the primary few video games, so we checked out availability of gamers and that is the place Topley slot in very well. To get a high-quality performer like him provides energy to our squad.” Knight Riders – the silent spectatorsHaving come into the public sale with the smallest purse (INR 7.05 crore), Knight Riders patiently watched proceedings; they entered the bidding simply as soon as – for South Africa batter Heinrich Klaasen – as the opposite franchises snapped up the primary 38 gamers. Curiously, Knight Riders have been keen to spend INR 2.4 crore on the uncapped Jammu & Kashmir allrounder Vivrant Sharma, who was ultimately purchased by Sunrisers. They got here alive after they made aggressive bids to get an Indian wicketkeeper, having let B Indrajith and Sheldon Jackson go. They ultimately received in-form N Jagadeesan for INR 90 lakh. Jagadeesan has been within the type of his life just lately, having racked up a document 5 Checklist A centuries final month. After shopping for Jagadeesan, Knight Riders purchased again allrounder Vaibhav Arora and tried onerous to purchase again quick bowler Shivam Mavi. Having launched Mavi to liberate INR 7.75 crore for this public sale, Knight Riders went so far as INR 1 crore earlier than bailing out. Mavi ultimately went to the Titans for INR 6 crore. In the direction of the top of the public sale, KKR snapped up abroad allrounders Shakib Al Hasan and David Wiese, and Bangladesh opener Litton Das to strengthen their squad. The notable uncapped Indian signings At a trial held to scout for expertise in Jammu & Kashmir, one participant – Vivrant Sharma – made a mark together with his composure and shot choice towards tempo. On Friday, these impressions translated into an IPL contract for the 23-year-old allrounder when Sunrisers signed him for INR 2.6 crore, having been a part of their camp as a internet bowler for IPL 2022. Along with his large hitting, Vivrant additionally bowls quick legbreaks and googlies. Eight years in the past, Mukesh Kumar was instructed he could not play cricket. He was anaemic and the bone edema in his knees was speculated to make bowling not possible. But, he persevered and made a mark in Bengal’s aggressive membership circuit and likewise the Ranji crew. A stellar efficiency in 2019-20, when Bengal made the Ranji Trophy ultimate, proved to be the turning level as Mukesh constructed on his breakout season to earn an India A and a nationwide call-up earlier this 12 months. He was meant to return in as a substitute participant in 2021 for RCB however missed out after contracting Covid-19. Earlier this 12 months, he was a internet bowler for Delhi Capitals and now he is a part of their squad for a worth of INR 5.5 crore, the second-highest quantity spent on an uncapped Indian participant this public sale. Final-minute buying There was a flurry of exercise proper on the finish of the public sale, as groups crammed up slots with gamers through the accelerated section. Delhi picked up South African batter Rilee Rossouw – who was unsold earlier – for INR 4.6 crore; KKR received Shakib and Royals received Adam Zampa for INR 1.5 crore every; And England’s Joe Root secured a maiden IPL contract – additionally with the Royals – at his INR 1 crore base worth. Source link The post Sam Curran turns into costliest participant in IPL historical past appeared first on The Times of Bengal.","pubDate":"2022-12-23 19:21:34","image_url":null,"source_id":"the_tob","country":["india"],"category":["sports"],"language":"english"},{"title":"“Pinching Myself”: Cameron Inexperienced After Being Picked By Mumbai Indians For Rs 17.5 Crore At IPL Public sale 2023 | Cricket Information","link":"https://www.thetimesofbengal.com/sports/pinching-myself-cameron-inexperienced-after-being-picked-by-mumbai-indians-for-rs-17-5-crore-at-ipl-public-sale-2023-cricket-information/","keywords":["Sports"],"creator":["admin"],"video_url":null,"description":"After being purchased by Mumbai Indians for the upcoming season of Indian Premier League (IPL) The post “Pinching Myself”: Cameron Inexperienced After Being Picked By Mumbai Indians For Rs 17.5 Crore At IPL Public sale 2023 | Cricket Information appeared first on The Times of Bengal.","content":"After being purchased by Mumbai Indians for the upcoming season of Indian Premier League (IPL) 2023, Australian all-rounder Cameron Inexperienced stated that he’s “pinching” himself and is humbled to affix the five-time champions, who he termed because the “one of many powerhouses of the competitors”. Australian all-rounder Cameron Inexperienced was purchased by five-time champions Mumbai Indians (MI) for INR 17.5 crore within the ongoing Indian Premier League (IPL) public sale in Kochi on Friday. “I’m pinching myself that this has all occurred,” Inexperienced was quoted as saying by cricket.com.au. “It’s such a bizarre feeling watching an public sale for your self. I can’t consider how nervous I used to be and I used to be shaking like something when the ultimate name was confirmed. I’ve at all times been an enormous fan of the IPL and it’ll be so cool to be part of it.” “The Mumbai Indians are one of many powerhouses of the competitors so I really feel very humbled to be becoming a member of them. I can’t wait to get there subsequent yr,” concluded the all-rounder. The younger Aussie all-rounder brought about a heavy bidding battle between Mumbai Indians and Delhi Capitals (DC). Issues ended with five-time champions prevailing and choosing up Inexperienced. This 23-year-old Western Australian all-rounder is his nation’s considered one of most fun up-and-coming skills. With age and his all-round capabilities, he would certainly be an asset for any facet. His two quickfire fifties as an opener towards India in three-match collection this yr as an opener made him a star to be careful for. He has performed 21 T20Is throughout which he has scored 245 runs with two fifties and has taken 5 wickets. Featured Video Of The Day Kolkata’s Tribute To Messi; Rally Full Of White And Blue Takes Over Metropolis Subjects talked about on this article Source link The post “Pinching Myself”: Cameron Inexperienced After Being Picked By Mumbai Indians For Rs 17.5 Crore At IPL Public sale 2023 | Cricket Information appeared first on The Times of Bengal.","pubDate":"2022-12-23 18:57:41","image_url":null,"source_id":"the_tob","country":["india"],"category":["sports"],"language":"english"},{"title":"Rajasthan Royals Full Squad: Full Listing Of RR Gamers After IPL Public sale 2023 | Cricket Information","link":"https://www.thetimesofbengal.com/sports/rajasthan-royals-full-squad-full-listing-of-rr-gamers-after-ipl-public-sale-2023-cricket-information/","keywords":["Sports"],"creator":["admin"],"video_url":null,"description":"Since Ben Stokes left, Rajasthan Royals needed to go for a tempo bowling all-rounder and The post Rajasthan Royals Full Squad: Full Listing Of RR Gamers After IPL Public sale 2023 | Cricket Information appeared first on The Times of Bengal.","content":"Since Ben Stokes left, Rajasthan Royals needed to go for a tempo bowling all-rounder and with solely 13 crore in its kitty, Ben Stokes and Cameron Inexperienced have been out of attain. They settled for Jason Holder, who might be a helpful possibility on the Sawai Man Singh floor the place batters get numerous worth for his or her pictures. His presence on the back-end will give coach Kumar Sangakkara and captain Sanju Samson numerous hope in addition to possibility of power-hitting. Equally, his nicely disguised slower ones may also be efficient on Indian tracks. Peak for Holder is simply an added benefit in bowling, whereas in batting, he can play helpful knocks for his facet. Rajasthan Royals received the inaugural IPL version however have did not win any title since then. They entered the ultimate of IPL in 2022, after a niche of 14 years solely to lose to newbies Gujarat Titans. RR can be seeking to go a step additional this time and win the trophy after including the likes of Joe Root and Adam Zampa, alongside Windies star Holder. That they had entered the mini public sale with a remaining purse quantity of 13.2 crore. Rajasthan Royals squad: Gamers purchased at IPL 2023 public sale – Joe Root (INR 1 crore), Abdul P A (INR 20 lakh), Akash Vashisht (INR 20 lakh), Murugan Ashwin (INR 20 lakh), KM Asif (INR 30 lakh), Adam Zampa (INR 1.5 crore), Kunal Rathore (INR 20 lakh), Donovan Ferreira (INR 50 lakh), Jason Holder (INR 5.75 crore) Gamers retained – Sanju Samson (c), Yashasvi Jaiswal, Shimron Hetmyer, Devdutt Padikkal, Jos Buttler, Dhruv Jurel, Riyan Parag, Prasidh Krishna, Trent Boult, Obed McCoy, Navdeep Saini, Kuldeep Sen, Kuldip Yadav, R Ashwin, Yuzvendra Chahal, KC Cariappa (With PTI Inputs) Featured Video Of The Day Viral: French President’s Speech In Dressing Room After Crew’s World Cup Miss Matters talked about on this article Source link The post Rajasthan Royals Full Squad: Full Listing Of RR Gamers After IPL Public sale 2023 | Cricket Information appeared first on The Times of Bengal.","pubDate":"2022-12-23 18:33:39","image_url":null,"source_id":"the_tob","country":["india"],"category":["sports"],"language":"english"},{"title":"He can become the biggest superstar in cricket: Irfan Pathan on Cameron Green","link":"https://thenewsmill.com/2022/12/he-can-become-the-biggest-superstar-in-cricket-irfan-pathan-on-cameron-green/","keywords":["Cricket","Sports","ANI"],"creator":["ANI"],"video_url":null,"description":null,"content":"Former Indian all-rounder Irfan Pathan said on Friday that Australian all-rounder Cameron Green has been picked by Mumbai Indians (MI) on basis of his potential and if he lives upto it, he can become the biggest superstar in cricket in coming years. Cameron Green was bought by five-time champions Mumbai Indians (MI) for INR 17.5 crore in the ongoing Indian Premier League (IPL) auction in Kochi on Friday. “He has been taken on basis of his potential. He is not proven player yet. He is 23 year old and exciting. If he lives upto his potential, he can become the biggest superstar in cricket. How to convert that potential into performance depends on the player. He will no doubt be a great option to play at the Wankhede Stadium (Mumbai Indians’ home ground),” Pathan told ANI. The all-rounder said that Sam Curran was always going to a “hot property” in the auction due to his peformances in ICC T20 World Cup in Australia, which saw him bowl at death overs and showcase “many dimensions”. “These players are popular among franchises. All rounders are not available heavily. When they are left handed bowlers, they make more impact. Well deserved for Curran. When price tag is big, you have to see how you take the pressure that comes with it,” added Pathan. Pathan also expressed happiness at the fact that 21 players from Jammu and Kashmir were a part of the auction. “I am privileged that I got to work with them (Kashmir cricketers). I feel happy when their name comes up in domestic cricket, in the auction list. I feel like their big brother. I hope their cricket grows on,” added Pathan. The IPL 2023 auction was held at Kochi today. (ANI). ALSO READ: 'Bikini Killer' Charles Sobhraj released from Nepal prison today This report is filed by ANI news service. TheNewsMill holds no responsibility for this content.","pubDate":"2022-12-23 18:31:17","image_url":null,"source_id":"thenewsmill","country":["india"],"category":["sports"],"language":"english"},{"title":"Ranji Trophy: How TNCA league cricket helped Andhra’s Shoaib derail Tamil Nadu","link":"https://www.thetimesofbengal.com/sports/ranji-trophy-how-tnca-league-cricket-helped-andhras-shoaib-derail-tamil-nadu/","keywords":["Sports"],"creator":["admin"],"video_url":null,"description":"The person who derailed Tamil Nadu within the Ranji Trophy duel right here on Friday, The post Ranji Trophy: How TNCA league cricket helped Andhra’s Shoaib derail Tamil Nadu appeared first on The Times of Bengal.","content":"The person who derailed Tamil Nadu within the Ranji Trophy duel right here on Friday, learnt his abilities in Chennai’s TNCA senior division league. It could not be a comforting thought for the host that a number of outstation cricketers are making higher use of the TNCA league than they themselves do. Talking to Sportstar after his match-winning six-for on ultimate day, Andhra off-spinner Shoaib Md. Khan stated, “I owe a big thanks to Nelson [his team in the league], to Srinivasa Raj sir, and the TNCA.’’ He added, “In fact, I learnt to bowl long spells and maintain my consistency only while operating in the TNCA first division league.” Shoaib’s Chennai connection doesn’t finish there. R. Ashwin is his position mannequin in off-spin. He studied eleventh and twelfth at St. Bede’s faculty, after which graduated from New Faculty. Requested about bowling in a excessive stress scenario within the Tamil Nadu second innings, Shoaib stated, “I enjoy bowling in these situations. It brings out the best in me.” He added, “I was taking it ball by ball. I was focussing on the next delivery and what I needed to do. I was not letting any pressure get to me.” On having to shoulder a large load – two of Andhra’s bowlers B. Ayappa and Lalith Mohan had been injured as the sport moved in the direction of the climactic section – Shoaib stated, “It made me bowl with greater control. The pressure brings out the best in me.” Shoaib stated he employed three kinds of deliveries. “My off-spinner, the one that comes with the arm and the one that holds its line. They brought me a lot of success.” He stated, “I wanted to settle into a good rhythm and bowl in the right areas because there was help from the pitch. Towards the end, as Tamil Nadu got closer, I knew it was a matter of just one wicket.” Amongst all his wickets, Shoaib relished dismissing B. Aparajith. “He can take the match away from you quickly. I bowled the perfect off-spinner’s delivery that went through the gate to castle him.” Shoaib then spoke about inspirational skipper Hanuma Vihari. “He is the very reason I am playing cricket. He is an inspiring figure who fills the players with confidence.” A free-stroking batter, Shoaib got here up with an innings of 84 towards Mumbai within the earlier Ranji sport. And his strokeful 28 right here on the fourth day was an important contribution. “I consider myself an all-rounder. And I practise a lot of batting in the nets,” he stated. No prizes for guessing the Man of the Match right here in Coimbatore. Source link The post Ranji Trophy: How TNCA league cricket helped Andhra’s Shoaib derail Tamil Nadu appeared first on The Times of Bengal.","pubDate":"2022-12-23 18:21:45","image_url":null,"source_id":"the_tob","country":["india"],"category":["sports"],"language":"english"},{"title":"Cricket: Black Caps Kane Williamson, Kyle Jamieson picked up at base prices in IPL auction","link":"https://www.nzherald.co.nz/sport/cricket-black-caps-kane-williamson-kyle-jamieson-picked-up-at-base-prices-in-ipl-auction/ALI3UEY3ZVAANIRVD2OPDVWZRQ/","keywords":null,"creator":null,"video_url":null,"description":"Kane Williamson will return to the IPL after being released by his former team","content":"After eight years with the Sunrisers Hyderabad, Kane Williamson has a new home in the Indian Premier League. Williamson was back on the auction block in the world’s richest domestic cricket competition, as teams had the opportunity to fight over the best talent for the upcoming season last night (NZ time). He was purchased by the Gujarat Titans, with the Black Caps T20 and ODI skipper being picked up at his base price of NIR 2 crore (about NZ$386,000). Look who's got a message for you, #TitansFAM ! 💌 Hear from our new recruit, Kane Williamson... 💙 Drop a welcome message for our Kiwi bhai ✍🏼 #IPLAuction | #TATATIPL | #AavaDe pic.twitter.com/NZQLQn6lpW — Gujarat Titans (@gujarat_titans) December 23, 2022 Williamson was one of two New Zealanders picked up at the auction, with fast bowler Kyle Jamieson being sold to the Chennai Super Kings at his base price of INR 1 crore (NZ$192,000). Jamieson’s signing might have come as a surprise to some, as the 27-year-old has been dealing with a back injury since June and has not been sighted in the professional game since. Advertisement Advertise with NZME. Speaking to NZME earlier this month, Jamieson said he was hopeful of returning in early 2023. “Everything is tracking pretty good. We’re cautiously optimistic of where things are. We’ve had quite a big body of work over the last few months. I’m certainly feeling pretty good and, when the time comes, I’ll be raring to go for sure.” While Jamieson has recently been hampered by injury, Williamson had his issues in that area during the 2022 IPL season. Dealing with a niggling elbow issue, he struggled at the crease and scored just 216 runs at a 93.50 strike rate – the lowest of any batsman in the competition who faced at least 100 deliveries. Advertisement Advertise with NZME. He will be hoping for a turnaround in form when he suits up in his new colours in 2023. Other Kiwis available at the auction included Adam Milne, Jimmy Neesham, Daryl Mitchell, Tom Latham, Michael Bracewell, Matt Henry, Ish Sodhi and Scott Kuggeleijn. They were all unsold. Lockie Ferguson, Tim Southee (Kolkata Knight Riders), Devon Conway, Mitchell Santner (Chennai Super Kings), Finn Allen (Royal Challengers Bangalore), and Glenn Phillips (Sunrisers Hyderabad) were all retained by their clubs following the 2022 campaign. English pace bowler Sam Curran cashed in on his success at this year’s T20 World Cup in Australia. The tournament’s second-highest wicket-taker and man of the match for England’s triumph in the final, the 24-year-old became the most expensive player in IPL history, signed by the Punjab Kings for INR 18.5 crore (NZ$3.5 million). Australian Cameron Green (NZ$3.3m), West Indian Nicholas Pooran (NZ$3m), and England’s Ben Stokes (NZ$3.1m) and Harry Brook (NZ$2.5m) rounded out the top five most expensive players. Some broke the bank 💵💰 Some entered an intense bidding war 🤜🤛 While some got the player of their choice 🎯 Here are the 🔝buys at the #TATAIPLAuction 2023 👌 pic.twitter.com/93LXEYegWa — IndianPremierLeague (@IPL) December 23, 2022 Save share Share this article facebook copy link twitter linkedin reddit email","pubDate":"2022-12-23 18:21:25","image_url":"https://www.nzherald.co.nz/resizer/2q7ECYwizzVqHQQZ9u8rlzJuvYg=/300x300/smart/filters:quality(70)/cloudfront-ap-southeast-2.images.arcpublishing.com/nzme/ENSGTFFOPNFLBJTMP7X66Z3O6I.jpg","source_id":"nzherald","country":["new zealand"],"category":["sports"],"language":"english"},{"title":"IPL franchises and abroad funding: It’s their selection, says chairman Arun Dhumal","link":"https://www.thetimesofbengal.com/sports/ipl-franchises-and-abroad-funding-its-their-selection-says-chairman-arun-dhumal/","keywords":["Sports"],"creator":["admin"],"video_url":null,"description":"Whereas the Indian Premier League (IPL) franchises have been hoping for Indian cricketers to be The post IPL franchises and abroad funding: It’s their selection, says chairman Arun Dhumal appeared first on The Times of Bengal.","content":"Whereas the Indian Premier League (IPL) franchises have been hoping for Indian cricketers to be allowed to take part in mushrooming T20 leagues throughout the globe, the Board of Management for Cricket in India (BCCI) has cautioned franchise house owners for investing in abroad properties. A number of franchise executives confirmed to Sportstar on anonymity that in a gathering between franchises and the BCCI hierarchy on Friday morning, the franchises have been suggested to chorus from investing in abroad leagues “to protect brand IPL”. Whereas the IPL franchises have been shocked with the suggestion, IPL chairman Arun Dhumal clarified that different boards and the franchise house owners have been free to take care of their curiosity. He pressured the BCCI will not be involved with both the growth of T20 leagues or funding of IPL house owners abroad. “Other boards have all the rights to start their league. But we have seen that the IPL is way ahead. Few of them (franchise owners) have interest in other leagues,” Dhumal stated after the IPL’s conclusion. “They have to look after their interests. We can’t stop them. They have money in their kitty, so it is their choice.” Whereas all of the six franchises within the soon-to-be launched SAT20 League are owned by IPL house owners, three groups within the Worldwide League T20 in United Arab Emirates have IPL house owners. Apart from, the IPL franchises have additionally invested within the Caribbean Premier League and Main League Cricket in USA. Source link The post IPL franchises and abroad funding: It’s their selection, says chairman Arun Dhumal appeared first on The Times of Bengal.","pubDate":"2022-12-23 17:56:34","image_url":null,"source_id":"the_tob","country":["india"],"category":["sports"],"language":"english"},{"title":"“My Mom, Grandmother Began Crying”: Harry Brook Reacts On Becoming a member of Sunrisers Hyderabad | Cricket Information","link":"https://www.thetimesofbengal.com/sports/my-mom-grandmother-began-crying-harry-brook-reacts-on-becoming-a-member-of-sunrisers-hyderabad-cricket-information/","keywords":["Sports"],"creator":["admin"],"video_url":null,"description":"London : After being acquired by Sunrisers Hyderabad for INR 13.25 cr, England batter Harry The post “My Mom, Grandmother Began Crying”: Harry Brook Reacts On Becoming a member of Sunrisers Hyderabad | Cricket Information appeared first on The Times of Bengal.","content":"London : After being acquired by Sunrisers Hyderabad for INR 13.25 cr, England batter Harry Brook expressed his happiness and mentioned he was misplaced for phrases and thanked SRH for choosing him for the upcoming Indian Premier League (IPL) 2023. Brook has been purchased by the Sunrisers Hyderabad (SRH) for the upcoming Indian Premier League (IPL) season in 2023 for Rs 13.25 crores.”Phew! That was fierce England’s Harry Brook is SOLD for INR 13.25 Crore to @SunRisers W.O.W,” tweeted IPL. “Hello Orange Military. I’m actually excited and grateful for this chance to return to the IPL this yr. I’m actually wanting ahead to play for the Sunrisers Hyderabad. I’ve heard the ambiance is unbelievable. Top-of-the-line grounds within the comp (competitors). So, I’m actually excited for us to be again to Uppal,” Brook mentioned in a video posted by Sunrisers Hyderabad on their Twitter deal with. Brook mentioned he was having dinner together with his household when SRH purchased him. He’ll make his IPL debut for the 2016 champions subsequent season. “I’ve misplaced phrases, I used to be having dinner with my mom and grandmother, they have been crying when SRH picked me up. Thanks a lot SRH,” Brook mentioned. Brook just lately emerged because the main run-scorer within the Take a look at collection in opposition to Pakistan, scoring 468 runs at a median of 93.60, with three centuries and one half-century and the very best rating of 153. He was additionally given the ‘Man of the Collection’ for his excellent efficiency within the longer format. Brook was additionally given the ‘Man of the Collection’ award for his excellent present within the seven-match T20I collection in opposition to the Asian giants that befell in September-October as part of the tour. In seven innings, he scored 238 runs at a median of 79.33, with one half-century and the very best rating of 81*. Brook turned the highest-bought participant by SRH on this public sale and obtained the third-highest profitable bid for an English participant after all-rounders Sam Curran (Rs 18.25cr) and Ben Stokes (Rs 16.25cr). (Apart from the headline, this story has not been edited by NDTV workers and is revealed from a syndicated feed.) Featured Video Of The Day Artist Makes Smoke Portrait Of Lionel Messi With FIFA World Cup Matters talked about on this article Source link The post “My Mom, Grandmother Began Crying”: Harry Brook Reacts On Becoming a member of Sunrisers Hyderabad | Cricket Information appeared first on The Times of Bengal.","pubDate":"2022-12-23 17:08:43","image_url":null,"source_id":"the_tob","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL Public sale 2023: Sam Curran, Cameron Inexperienced, Ben Stokes document costly bids","link":"https://www.thetimesofbengal.com/sports/ipl-public-sale-2023-sam-curran-cameron-inexperienced-ben-stokes-document-costly-bids/","keywords":["Sports"],"creator":["admin"],"video_url":null,"description":"Abroad gamers are normally the flavour on the Indian Premier League (IPL) mini-auctions. The development The post IPL Public sale 2023: Sam Curran, Cameron Inexperienced, Ben Stokes document costly bids appeared first on The Times of Bengal.","content":"Abroad gamers are normally the flavour on the Indian Premier League (IPL) mini-auctions. The development persevered within the sixteenth Participant Public sale on Friday. High 5 costliest gamers – and 7 of the ten costliest bids – have been foreigners as the ten franchises splurged a mixed quantity of Rs. 167 crore on 80 gamers. As anticipated, the highest three buys turned out to be the allrounder trio of Sam Curran (Rs. 18.50 crore, Punjab Kings), Cameron Inexperienced (Rs. 17.50 crore, Mumbai Indians) and Ben Stokes (Rs. 16.25 crore, Chennai Tremendous Kings). The truth is, all three of them attracted bids that have been equal to or greater than the earlier highest bid of Rs. 16.25 crore, attracted by Chris Morris for Rajasthan Royals in 2021. Whereas Harry Brook (Rs. 13.25 crore, Sunrisers Hyderabad) emerged as the primary entrant within the nine-crore bracket in his maiden IPL Public sale, Caribbean Nicholas Pooran walked away with a whopping sum (Rs. 16 crore, Lucknow Tremendous Giants). Mayank Agarwal (Rs. 8.25 crore, Sunrisers Hyderabad), the Punjab Kings’ captain in IPL 2022, attracted the best bid for an Indian cricketer. Uncapped pacers Shivam Mavi (Rs. 6 crore, Gujarat Titans) and Mukesh Kumar (Delhi Capitals, Rs. 5.5 crore) have been the opposite Indians within the top-10 buys. The development of abroad cricketers dominating the mini-auction was not stunning for a lot of, although. “It is not surprising, it is to be expected. As long as this format continues, that is going to be the trend ,” stated Venky Mysore, the Kolkata Knight Riders chief govt. “Because the good Indian players are rarely released to a mini-auction, it is foreign players (who are sought-after). That imbalance will be there.” Whereas the value tags might have raised many eyebrows, it was enterprise as normal within the public sale room. The truth is, just a few franchises have been anticipating the Rs. 20-crore barrier to be breached for the primary time. “The history suggests that in smaller auctions, the prices can be significantly high. We saw that again. It is the supply-demand scenario,” stated Mike Hesson, the Royal Challengers Bangalore Director of Cricket Operations. “We knew Curran and Stokes would be well beyond our reach. We thought they would go close to Rs 20 crore. There is no surprise there. A few teams have freed up cash to have a go at them.” As soon as the massive birds ate into the riches, not too many Indians, particularly uncapped home cricketers, had a windfall. 5 home cricketers turned crorepatis on the day. Apart from Mavi and Mukesh, Jammu & Kashmir allrounder Vivrant Sharma (Rs. 2.6 crore, Sunrisers Hyderabad), Himachal Pradesh’s Mayank Dagar (1.8 crore, Sunrisers Hyderabad) and Andhra wicketkeeper-batter Ok.S. Bharat (1.2 crore, Gujarat Titans) additionally earned eight-digit quantity. Source link The post IPL Public sale 2023: Sam Curran, Cameron Inexperienced, Ben Stokes document costly bids appeared first on The Times of Bengal.","pubDate":"2022-12-23 16:56:34","image_url":null,"source_id":"the_tob","country":["india"],"category":["sports"],"language":"english"},{"title":"Rehan Ahmed left out of England’s Test squad for New Zealand tour","link":"https://www.independent.co.uk/sport/cricket/england-test-squad-new-zealand-b2250513.html","keywords":["Cricket","Sport"],"creator":["Rory Dollard"],"video_url":null,"description":"Ahmed became the country’s youngest ever men’s Test cricket player when he lined up against Pakistan in Karachi last week","content":null,"pubDate":"2022-12-23 16:38:38","image_url":"https://static.independent.co.uk/2022/12/23/16/AFP_334U7TE.jpg?width=1200&auto=webp","source_id":"independentuk","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Chennai Tremendous Kings Full Squad: Full Checklist Of CSK Gamers After IPL Public sale 2023 | Cricket Information","link":"https://www.thetimesofbengal.com/sports/chennai-tremendous-kings-full-squad-full-checklist-of-csk-gamers-after-ipl-public-sale-2023-cricket-information/","keywords":["Sports"],"creator":["admin"],"video_url":null,"description":"Mahendra Singh Dhoni has a easy mantra — depend on tried and examined seniors, who’ve The post Chennai Tremendous Kings Full Squad: Full Checklist Of CSK Gamers After IPL Public sale 2023 | Cricket Information appeared first on The Times of Bengal.","content":"Mahendra Singh Dhoni has a easy mantra — depend on tried and examined seniors, who’ve been there and carried out that. It was seen within the IPL public sale as they went for Ben Stokes (Rs 16.25 crore) and Ajinkya Rahane (Rs 50 lakh). Constructing groups is one thing he has at all times left on different franchises. With IPL set to be again in house and away format, CSK will play seven house video games on the Chepauk, which will not precisely be a batter’s paradise. For Dhoni, Dwayne Bravo was a participant of immense worth and he needed that alternative. CSK checked out all-rounders, who may hit huge between overs 16-20 and exploit the cheesy Chennai floor with variations. They initially checked out Jason Holder however went complete hog for the England all-rounder. Take a look at CSK’s batting line-up: Devon Conway, Ruturaj Gaikwad, Ambati Rayudu/Ajinkya Rahane, Ben Stokes, MS Dhoni, Moeen Ali, Ravindra Jadeja. It is a dream T20 batting line-up on any floor with multi-skilled gamers. Stokes can each open the batting or bowling on days required and when the massive man bids adieu to his favorite canary yellow jersey, Stokes could possibly be the person main the sector. Chennai Tremendous Kings: Gamers purchased at IPL 2023 public sale – Bhagath Varma (INR 20 lakh), Ajay Mandal (INR 20 lakh), Kyle Jamieson (INR 1 crore), Nishant Sindhu (INR 60 lakh), Shaik Rasheed (INR 20 lakh), Ben Stokes (INR 16.25 crore), Ajinkya Rahane (INR 50 lakh) Gamers retained – MS Dhoni (c), Devon Conway, Ruturaj Gaikwad, Ambati Rayudu, Subhranshu Senapati, Moeen Ali, Shivam Dube, Rajvardhan Hangargekar, Dwaine Pretorius, Mitchell Santner, Ravindra Jadeja, Tushar Deshpande, Mukesh Chowdhary, Matheesha Pathirana, Simarjeet Singh, Deepak Chahar, Prashant Solanki, Maheesh Theekshana. Featured Video Of The Day India’s High FIFA World Cup Last Moments Subjects talked about on this article Source link The post Chennai Tremendous Kings Full Squad: Full Checklist Of CSK Gamers After IPL Public sale 2023 | Cricket Information appeared first on The Times of Bengal.","pubDate":"2022-12-23 16:32:53","image_url":null,"source_id":"the_tob","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL 2023 Auction | Speed… Speed… Mumbai’s fastest four ‘4J’ alliance!","link":"https://thenewsglory.com/ipl-2023-auction-speed-speed-mumbais-fastest-four-4j-alliance/","keywords":["Sports","Auction","Cricket","India","Indian Premier League","IPL","ipl 2023 auction","ipl auction","IPL Auction 2022","ipl mini auction","Teams"],"creator":["The News Glory"],"video_url":null,"description":"Cochin: The auction for the upcoming IPL season is underway in Kochi. In this, each team adds up their accounts and buys players. In this case, the Mumbai Indians bought the right-arm fast bowler Jay Richardson for 1.50 crore rupees in this auction. With this, it seems that the Mumbai team will threaten the opposing […]","content":"Cochin: The auction for the upcoming IPL season is underway in Kochi. In this, each team adds up their accounts and buys players. In this case, the Mumbai Indians bought the right-arm fast bowler Jay Richardson for 1.50 crore rupees in this auction. With this, it seems that the Mumbai team will threaten the opposing batsmen in the upcoming season with a high-speed bowling combination. The funny thing is that all four bowlers’ names start with the English letter ‘J’. There are four great fast bowlers in that team namely Jasprit Bumrah, Zobra Archer, Jason Berendorff and Jay Richardson. It is noteworthy that all four are players who have the ability to make an impact on the game. All of them are right-arm fast bowlers. Bumrah, Archer and Perendorf were all included in the team last season. Newly joined by Richardson. Bumrah needs no introduction. Archer plays for England in international cricket. After recovering from injury, he is set to return to action in January. Perendorf and Jay Richardson are both playing for Australia.","pubDate":"2022-12-23 16:11:43","image_url":null,"source_id":"thenewsglory","country":["india"],"category":["sports"],"language":"english"},{"title":"Cricket Cranes win T20 Tri-Nation In Kigali","link":"https://kawowo.com/2022/12/23/cricket-cranes-win-t20-tri-nation-in-kigali/","keywords":["Cricket"],"creator":["Denis Musali"],"video_url":null,"description":"Match 10: Uganda v Tanzania Match Summary: Uganda 183/5 Tanzania 176 all out Uganda won by 7 runs The Cricket Cranes won the Tri-Nation T20 tournament in Kigali after picking up their 8th win of the series but Tanzania never made it easy with them. Bilal Hassun took the ball in the final over with […] The post Cricket Cranes win T20 Tri-Nation In Kigali appeared first on Kawowo Sports.","content":"Match 10: Uganda v Tanzania Match Summary: Uganda 183/5 Tanzania 176 all out The Cricket Cranes won the Tri-Nation T20 tournament in Kigali after picking up their 8th win of the series but Tanzania never made it easy with them. Bilal Hassun took the ball in the final over with 11 runs required for the win, the challenge for Tanzania was that they had only two wickets in hand. The experienced Bilal Hassun held his nerve to 1st uproot the stumps of Metha Atul and then to run out the final wicket of Maurice Yalinde. In an entertaining game of T20 cricket which had everyone on their feet for most of the contest, Simon Ssesazi became the 1st Ugandan batter to score a T20I century as he helped Uganda score 183/5 in their 20 overs. Cyrus Kakuru (38) finally got some runs under his belt as he repaired some damage with Simon Ssesazi that had been caused by the loss of early wickets. In response, Tanzania came out guns blazing especially the blade of Ivan Suleiman who scored 39 off 15 balls to set off Tanzania. Even as they lost wickets in clusters Tanzania kept their foot on the gas with the contributions coming from everyone in the team as they kept in touch with the required rate. With very few options in the final four overs, Kenneth Waiswa took matters into his own as Captain and bowled the final two overs, he was able to pick up the 2/19 under pressure, with 17 runs required off 7 balls Mehta Atul threw the final spanner in the works when picked up Kenneth Waiswa and dropped him for a six to reduce the equation to just 11 off 6 balls. However, the experienced Bilal Hassun held his nerve to bowl the perfect final over and help Uganda register their 8th win of the series. Tanzania coming close for the second time in the tournament after a marginal loss of 2 runs in game 5 and this time falling short by 7 runs. The win means that no one can catch Uganda at the top of the table and win the Tri-Nation T20 Cup. The tournament concludes tomorrow with a doubleheader for Uganda, they will take on Rwanda in the morning and then Tanzania in the afternoon.","pubDate":"2022-12-23 15:59:16","image_url":null,"source_id":"kawowo","country":["uganda"],"category":["sports"],"language":"english"},{"title":"IPL 2023 Auction: Gautam Gambhir defends LSG's decision to spend INR 16 crore on Nicholas Pooran","link":"https://www.thehansindia.com/sports/cricket/ipl-2023-auction-gautam-gambhir-defends-lsgs-decision-to-spend-inr-16-crore-on-nicholas-pooran-774651","keywords":["Sports,Cricket"],"creator":["Ishka"],"video_url":null,"description":"LSG signed Nicholas Pooran at IPL 2023 auctionPooran became the joint-fourth most expensive player in IPL historyEven Yuvraj Singh had received INR 16 crore in 2015","content":"LSG signed Nicholas Pooran at IPL 2023 auctionLSG signed Nicholas Pooran at IPL 2023 auctionLucknow Super Giants (LSG) mentor Gautam Gambhir has defended Nicholas Pooran's price tag of INR 16 crore at the Indian Premier League (IPL) 2023 auction. Former West Indies captain Pooran was released by Sunrisers Hyderabad (SRH) due to his inconsistent run in IPL 2022. He was even sacked as West Indies' T20I captain after his side failed to make it to the Super 12s of the T20 World Cup 2022 in Australia. Pooran on Friday became the joint-fourth most expensive player in the history of IPL, along with Yuvraj Singh, who was bought by Royal Challengers Bangalore (RCB) for INR 16 crore ahead of the 2015 edition. Pooran's bid was next only to Sam Curran (INR 18.5 crore to Punjab Kings), Cameron Green (INR 17.5 crore to Mumbai Indians), and Ben Stokes (INR 16.25 crore to Chennai Super Kings).Speaking during the IPL 2023 auction, Gambhir backed LSG's decision to shell out INR 16 crore for Pooran, saying the big-hitter is an impact player like very few going around in T20 cricket. Gambhir also said that his side did not worry about Pooran's previous record in IPL and that he believed that the explosive batsman will only peak in the coming seasons.In the 2021 season, Pooran flopped with Punjab Kings (PBKS) as he manged just 85 runs in 12 games. As a result, Punjab released the Windies player ahead of the mega auction in 2021.\"We did not even think about what he did in the last IPL season. It was just his ability. We were clear on the fact that we had to have someone like him, someone of his caliber. He is 26-27 and probably he is going to start peaking from here on. It's not about how many runs you score, it's about the impact, if he can win 3-4 games, he has that ability. How many players have the ability to play in the top 4 and as well at 6-7? Nicholas has that ability,\" Gambhir said.\"He's a special talent. He'll actually win you games single-handedly,\" said Gambhir in a video posted by LSG on Twitter.🗣️: \"He's a special talent. He'll actually win you games single-handedly.\" - @GautamGambhir #SuperFam, from 😍 to 🔥, how excited are you to watch the Caribbean powerhouse? 💭#IPL2023 | #IPLAuction | #LucknowSuperGiants | #LSG pic.twitter.com/AljHaqsBGH— Lucknow Super Giants (@LucknowIPL) December 23, 2022 Gambhir also stated that Pooran can be a back-up wicketkeeping option too. LSG's current first-choice keeper is South Africa's Quinton de Kock, while skipper KL Rahul can also keep wickets.\"And on top of that, he can give us a wicketkeeping option as well. He is again a backup for Quinton de Kock as well,\" added Gambhir.Welcome to the #SuperGiant family @nicholas_47! 😍#IPL2023 | #IPLAuction | #LucknowSuperGiants | #LSG pic.twitter.com/sHW6KEjUKX— Lucknow Super Giants (@LucknowIPL) December 23, 2022 LSG came up with some clever buys as they bagged the likes of Jaydev Unadkat, Amit Mishra, Daniel Sams and Romaria Shepherd at their base prices on Friday. Gambhir said he was happy with the picks they were able to make despite having spent INR 16 crore on a player.\"You just have to be lucky. I won't see we were phenomenal. A lot of people might say we spent too much on Pooran but we got Unadkat at his base price, we have got Daniel Sams and Romario Shepherd at the base price, these were our targets,\" Gambhir said.","pubDate":"2022-12-23 15:34:51","image_url":"https://assets.thehansindia.com/h-upload/2022/12/23/500x300_1326661-nicholas-pooran.jpg","source_id":"thehansindia","country":["india"],"category":["sports"],"language":"english"},{"title":"England remembers Stuart Broad for take a look at sequence in New Zealand","link":"https://www.thetimesofbengal.com/sports/england-remembers-stuart-broad-for-take-a-look-at-sequence-in-new-zealand/","keywords":["Sports"],"creator":["admin"],"video_url":null,"description":"By PTI LONDON: Skilled bowler Stuart Broad has been recalled to England’s squad for the The post England remembers Stuart Broad for take a look at sequence in New Zealand appeared first on The Times of Bengal.","content":"By PTI LONDON: Skilled bowler Stuart Broad has been recalled to England’s squad for the two-test sequence in New Zealand whereas rising star Rehan Ahmed won’t make the journey. The 36-year-old Broad is again after lacking the latest 3-0 take a look at sequence sweep in Pakistan for the beginning of his first baby. The primary take a look at begins Feb.16 at Mount Maunganui. Ahmed turned the nation’s youngest ever males’s take a look at cricket participant when the 18-year-old legspinner lined up towards Pakistan in Karachi final week and took a decisive five-wicket haul. The exams in New Zealand usually are not more likely to favor spin and, with Jack Leach retaining his standing as first-choice, Ahmed didn’t make the 15-man squad with England additionally taking a cautious method over his improvement. Ahmed will play within the UAE T20 League in January. Mark Wooden, who impressed towards Pakistan after elbow surgical procedure earlier this yr, might be rested from all cricket in a bid to guard him from additional harm forward of the Ashes. England can be being cautious with Jofra Archer, who was picked for January’s ODI journey to South Africa however will wait longer to return to check cricket after a protracted spell on the sidelines. Together with Broad, the bowling shares are replenished by quick bowlers Matthew Potts and Olly Stone. Potts began his take a look at profession this summer time by taking 20 wickets at a mean of 28 in 5 appearances. Three different gamers who took half in England’s first take a look at journey to Pakistan in 17 years weren’t included. Liam Livingstone was injured on his debut in Rawalpindi, whereas opener Keaton Jennings and Jamie Overton, who didn’t characteristic within the three-match sequence, drop out. Essex batter Dan Lawrence joins for the primary time underneath the management of head coach Brendon McCullum – the previous New Zealand star – and captain Ben Stokes. England squad: Ben Stokes (captain), James Anderson, Stuart Broad, Harry Brook, Zak Crawley, Ben Duckett, Ben Foakes, Will Jacks, Dan Lawrence, Jack Leach, Ollie Pope, Matthew Potts, Ollie Robinson, Joe Root, Olly Stone. LONDON: Skilled bowler Stuart Broad has been recalled to England’s squad for the two-test sequence in New Zealand whereas rising star Rehan Ahmed won’t make the journey. The 36-year-old Broad is again after lacking the latest 3-0 take a look at sequence sweep in Pakistan for the beginning of his first baby. The primary take a look at begins Feb.16 at Mount Maunganui. Ahmed turned the nation’s youngest ever males’s take a look at cricket participant when the 18-year-old legspinner lined up towards Pakistan in Karachi final week and took a decisive five-wicket haul. The exams in New Zealand usually are not more likely to favor spin and, with Jack Leach retaining his standing as first-choice, Ahmed didn’t make the 15-man squad with England additionally taking a cautious method over his improvement. Ahmed will play within the UAE T20 League in January. Mark Wooden, who impressed towards Pakistan after elbow surgical procedure earlier this yr, might be rested from all cricket in a bid to guard him from additional harm forward of the Ashes. England can be being cautious with Jofra Archer, who was picked for January’s ODI journey to South Africa however will wait longer to return to check cricket after a protracted spell on the sidelines. Together with Broad, the bowling shares are replenished by quick bowlers Matthew Potts and Olly Stone. Potts began his take a look at profession this summer time by taking 20 wickets at a mean of 28 in 5 appearances. Three different gamers who took half in England’s first take a look at journey to Pakistan in 17 years weren’t included. Liam Livingstone was injured on his debut in Rawalpindi, whereas opener Keaton Jennings and Jamie Overton, who didn’t characteristic within the three-match sequence, drop out. Essex batter Dan Lawrence joins for the primary time underneath the management of head coach Brendon McCullum – the previous New Zealand star – and captain Ben Stokes. England squad: Ben Stokes (captain), James Anderson, Stuart Broad, Harry Brook, Zak Crawley, Ben Duckett, Ben Foakes, Will Jacks, Dan Lawrence, Jack Leach, Ollie Pope, Matthew Potts, Ollie Robinson, Joe Root, Olly Stone. Source link The post England remembers Stuart Broad for take a look at sequence in New Zealand appeared first on The Times of Bengal.","pubDate":"2022-12-23 15:09:29","image_url":null,"source_id":"the_tob","country":["india"],"category":["sports"],"language":"english"},{"title":"Josh Little becomes first Irish international to earn Indian Premier League deal","link":"https://www.cricketireland.ie/news/article/josh-little-becomes-first-irish-international-to-earn-indian-premier-league","keywords":null,"creator":null,"video_url":null,"description":"Cricket Ireland has agreed to grant Irish international Josh Little permission to join the Indian Premier League (IPL) in 2023 after he was picked up by the Gujarat Titans in today’s IPL Draft – Little becomes the first active Irish international to be offered a contract to play in the world’s biggest franchise tournament.","content":"Little, 23, made his international debut for Ireland in 2016. The left-arm seamer from Dublin has since played 22 ODIs and 53 T20Is for his country. While local Irish fans were aware of Little’s potential for many years, he burst onto the international radar in May 2019 in his ODI debut when he claimed 4-45 in a devastating spell of pace bowling against England in Dublin – which saw him remove three of the top four batters, including Eoin Morgan for a duck (Morgan is the only other Irish-born cricketer to feature in the IPL previously, however, he was playing for England at that time of his involvement). Little’s most recent bowling exploits for the national team were in the ICC T20 World Cup against New Zealand when he became the sixth bowler ever to register a hat-trick in a T20 World Cup. Little has also featured in several franchise leagues – Lanka Premier League and The Hundred – while last month he was picked up in the Pakistan Super League draft and has been offered a deal in the SA20. Aware of the potential for Little to be successful in today’s draft, Cricket Ireland had indicated to both the player and the tournament organiser that a No Objection Certificate (NOC) would be issued that would allow Little to participate in the entire IPL season, however with one brief exception that covers the three World Cup Super League ODIs against Bangladesh in May 2023. Richard Holdsworth , High Performance Director for Cricket Ireland, said: “We are delighted for Josh and wish him well in the IPL next year. Josh is a hard-working and dedicated athlete who has come up through the Irish system. He has been an essential part of the Irish set-up for several years now and we believe his development will only accelerate further through involvement in the IPL. “We have carved out the three ODIs against Bangladesh at home in early 2023 from the deal, given the potential crucial nature of those fixtures in the context of our World Cup qualification. “The impact of franchise cricket is increasingly front-of-mind for Cricket Ireland as our standing grows on the world stage and the profile of our players increases significantly. Our policy, in general, is that we maintain strong support of our international and contracted players playing in domestic leagues where this helps their development, provides cricket during gaps in our calendar and provides additional income for the player. “We release players to play in a high-quality domestic franchise event which the selectors deem beneficial to the player’s development, and which do not compromise the national team’s performance or development. This explains why Josh will be released for all but the most important of our pre-season international series, the World Cup Super League matches against Bangladesh in May. In addition, we will generally not release players after a squad selection has been announced. “Franchise cricket opportunities have become an increasing feature of modern-day cricket, so we remain somewhat flexible in our response to offers that arise, but in general we will maintain an ‘Ireland-first’ policy when the potential for conflict arises. “Our approach also allows us to blood new players who might not otherwise get game time for Ireland. Looking ahead, it will become ever-more important for us to expand our pool of players to accommodate the increasing quantity of fixtures happening at bilateral international, ICC Event and domestic franchise level. “Again, congratulations to Josh – everyone in Irish cricket wishes him well and it is indeed recognition not only for Josh, but Irish cricket itself that our players are now becoming well sought after by franchise leagues.” Josh Little said: “I’m delighted to have been signed by the defending champions, the Gujarat Titans, and look forward to playing under Hardik Pandya within such a high quality squad. I’m also looking forward to working with coach Ashish Nehra and would like to thank the management team at the Titans for believing in me. “I have loved playing international cricket for Ireland - and that will always remain my priority, but to be able to learn and play in the IPL will be an incredible opportunity and thanks to Cricket Ireland for supporting me in this.” The official IPL website is: https://www.iplt20.com/ #TATAIPL | #IPLAuction | #AavaDe pic.twitter.com/ScEnMwGtG5 — Gujarat Titans (@gujarat_titans) December 23, 2022","pubDate":"2022-12-23 15:08:01","image_url":null,"source_id":"cricketireland","country":["ireland"],"category":["sports"],"language":"english"},{"title":"Able to play the sport: Meg Lanning returns to captain Australia in opposition to Pakistan","link":"https://www.thetimesofbengal.com/sports/able-to-play-the-sport-meg-lanning-returns-to-captain-australia-in-opposition-to-pakistan/","keywords":["Sports"],"creator":["admin"],"video_url":null,"description":"By PTI MELBOURNE: “Refreshed and able to play the sport,” World Cup-winning skipper Meg Lanning The post Able to play the sport: Meg Lanning returns to captain Australia in opposition to Pakistan appeared first on The Times of Bengal.","content":"By PTI MELBOURNE: “Refreshed and able to play the sport,” World Cup-winning skipper Meg Lanning is ready to return from her break and lead Australia within the ODI collection in opposition to Pakistan subsequent month. The 30-year-old had taken time without work from the sport to concentrate on herself following Australia’s gold-medal end on the Commonwealth Video games in August. She missed the ladies’s Large Bash League and the recently-concluded tour of India as a result of her break, that lasted 5 months. “I am unable to wait to be out on the sector once more with @auswomencricket in opposition to Pakistan. Generally you simply need to hit pause, step again and take a breather. That is actually what I wanted,” Lanning posted on her Instagram on Friday. “The previous 6 months have taught me quite a bit. I’ve learnt a lot about myself and who and what’s essential to me. I’ve at all times performed my playing cards fairly near my chest.This expertise has given me a higher appreciation of how opening up and speaking to the those that care about you actually could make the powerful instances really feel simpler. It is alright to ask for assist and admit that you do not have the whole lot beneath management. Having loved a while and house. I really feel refreshed and able to play the sport that I really like in groups that love. It is such an thrilling time for the sport and I am unable to wait to be a part of it!” she added. Cricket Australia (CA) on Friday named a 13-member squad for the three-match ODI collection at dwelling, beginning January 16. “Meg brings a lot to the aspect each on and off the sector, and it is pleasing to welcome her again at such an essential time with the T20 World Cup simply over a month away,” nationwide selector Shawn Flegler was quoted as saying by cricket.com.au. Star wicketkeeper-batter Alyssa Healy, who led the Australian staff within the tour of India, will miss the collection as a result of a leg damage. Healy had strained her proper calf whereas batting within the fourth T20I final week. “Alyssa will not have recovered from her calf damage in time, in order that presents a chance for Beth to take the gloves in her absence,” Flegler stated. All-rounder Tahlia McGrath will function Lanning’s deputy. Squad ==== Meg Lanning (c), Tahlia McGrath, Darcie Brown, Nicola Carey, Ashleigh Gardner, Kim Garth, Jess Jonassen (topic to health), Alana King, Phoebe Litchfield, Beth Mooney, Ellyse Perry, Megan Schutt and Annabel Sutherland. MELBOURNE: “Refreshed and able to play the sport,” World Cup-winning skipper Meg Lanning is ready to return from her break and lead Australia within the ODI collection in opposition to Pakistan subsequent month. The 30-year-old had taken time without work from the sport to concentrate on herself following Australia’s gold-medal end on the Commonwealth Video games in August. She missed the ladies’s Large Bash League and the recently-concluded tour of India as a result of her break, that lasted 5 months. “I am unable to wait to be out on the sector once more with @auswomencricket in opposition to Pakistan. Generally you simply need to hit pause, step again and take a breather. That is actually what I wanted,” Lanning posted on her Instagram on Friday. “The previous 6 months have taught me quite a bit. I’ve learnt a lot about myself and who and what’s essential to me. I’ve at all times performed my playing cards fairly near my chest.This expertise has given me a higher appreciation of how opening up and speaking to the those that care about you actually could make the powerful instances really feel simpler. It is alright to ask for assist and admit that you do not have the whole lot beneath management. Having loved a while and house. I really feel refreshed and able to play the sport that I really like in groups that love. It is such an thrilling time for the sport and I am unable to wait to be a part of it!” she added. Cricket Australia (CA) on Friday named a 13-member squad for the three-match ODI collection at dwelling, beginning January 16. “Meg brings a lot to the aspect each on and off the sector, and it is pleasing to welcome her again at such an essential time with the T20 World Cup simply over a month away,” nationwide selector Shawn Flegler was quoted as saying by cricket.com.au. Star wicketkeeper-batter Alyssa Healy, who led the Australian staff within the tour of India, will miss the collection as a result of a leg damage. Healy had strained her proper calf whereas batting within the fourth T20I final week. “Alyssa will not have recovered from her calf damage in time, in order that presents a chance for Beth to take the gloves in her absence,” Flegler stated. All-rounder Tahlia McGrath will function Lanning’s deputy. Squad ==== Meg Lanning (c), Tahlia McGrath, Darcie Brown, Nicola Carey, Ashleigh Gardner, Kim Garth, Jess Jonassen (topic to health), Alana King, Phoebe Litchfield, Beth Mooney, Ellyse Perry, Megan Schutt and Annabel Sutherland. Source link The post Able to play the sport: Meg Lanning returns to captain Australia in opposition to Pakistan appeared first on The Times of Bengal.","pubDate":"2022-12-23 14:44:46","image_url":null,"source_id":"the_tob","country":["india"],"category":["sports"],"language":"english"},{"title":"Sports minister assures to setup cricket stadium in Karimnagar","link":"https://telanganatoday.com/sports-minister-assures-to-setup-cricket-stadium-in-karimnagar","keywords":["Karimnagar","News","Sport","Telangana","cricket stadium","V Srinivas Goud"],"creator":["Telangana Today"],"video_url":null,"description":"Minister assured to take the issue to the notice of the Chief Minister K Chadrashekhar Rao and get the sanction","content":"Home | Telangana | Sports Minister Assures To Setup Cricket Stadium In Karimnagar Sports minister assures to setup cricket stadium in Karimnagar Minister assured to take the issue to the notice of the Chief Minister K Chadrashekhar Rao and get the sanction By Telangana Today Published Date - 08:04 PM, Fri - 23 December 22 Sports Minister V Srinivas Goud along with sports persons at Regional Sports School in Karimnagar on Friday Karimnagar: Sports Minister V Srinivas Goud has promised to construct a cricket stadium in Karimnagar. The minister assured Civil Supplies Minister Gangula Kamalakar that the stadium would be constructed in 12 acres land available in old PG College premises. The minister assured to take the issue to the notice of the Chief Minister K Chadrashekhar Rao and get the sanctions. He was speaking after inaugurating the synthetic track along with TS Planning Board vice-chairman, B Vinod Kumar in Karimnagar Regional Sports School here on Friday. Also Read Supplying ‘Made in Telangana’ national flags to 22 States: Srinivas Goud Gangula wants doctor fraternity to make Karimnagar a health hub He said the government developed 7,800 rural sports grounds in the state to encourage rural sportspersons and enable them to excel in national and international events. Besides rural sports grounds, an indoor stadium is also being constructed in every constituency. While the construction of 45 stadiums have already been completed, the remaining were under progress, he said. Before Telangana was formed, the rulers played with lives of the unemployed youth. Besides sports, top priority was also given to education and 1,000 gurukulam schools were set up to provide quality education to the poor. A medical college has been established in every district. To attract national and international tourists, the Manair River Front project was taken up in Karimnagar. Kamalakar said that sportspersons from Telangana were neglected in united Andhra Pradesh. However, the situation has changed after the formation of a separate state. Besides health and education, top priority was given for sports. Vinod Kumar said that the Chief Minister, who has special affection for Karimnagar , was taking various developmental programmes. Being an MP, Chandrashekahar Rao had designed a number of plans for the development of Karimnagar. Follow Us : Tags cricket stadium Karimnagar V Srinivas Goud Related News BRS staged protest against Centre across erstwhile Karimnagar Sardar Ravinder Singh takes charge as Civil Supplies Corporation chairman Passport Seva Kendras (PSKs) to function on December 24 Physiotherapy College to set up in Mahabubnagar, classes to commence from January Karimnagar: Courier agencies exploit TSRTC cargo services Gangula wants doctor fraternity to make Karimnagar a health hub","pubDate":"2022-12-23 14:34:17","image_url":null,"source_id":"telanganatoday","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL 2023 Public sale: Participant reactions on social media- Sam Curran costliest purchase; Stokes reacts to CSK transfer; MI breaks financial institution for Inexperienced","link":"https://www.thetimesofbengal.com/sports/ipl-2023-public-sale-participant-reactions-on-social-media-sam-curran-costliest-purchase-stokes-reacts-to-csk-transfer-mi-breaks-financial-institution-for-inexperienced/","keywords":["Sports"],"creator":["admin"],"video_url":null,"description":"The IPL Public sale for the 2023 season in Kochi has damaged information. From England’s The post IPL 2023 Public sale: Participant reactions on social media- Sam Curran costliest purchase; Stokes reacts to CSK transfer; MI breaks financial institution for Inexperienced appeared first on The Times of Bengal.","content":"The IPL Public sale for the 2023 season in Kochi has damaged information. From England’s Sam Curran being the most costly participant in IPL Public sale historical past to fellow Englishman Harry Brook going for an unexpectedly excessive charge, the next are the social media reactions from a few of the gamers who’ve been picked within the public sale. Curran breaking information England worldwide Sam Curran turned the most costly participant in IPL Public sale historical past after Punjab Kings shelled out a whopping INR 18.5 CR for the all-rounder. Again to the place it began! Wanting ahead to it https://t.co/1lpsK8fX4V — Sam Curran (@CurranSM) December 23, 2022 Stokes is again within the IPL Ben Stokes marked his IPL return after fetching a big-money transfer to Chennai Tremendous Kings for INR 16.25 CR. He posted a easy, but impactful submit after his CSK transfer. pic.twitter.com/aa7XDgnvHO — Ben Stokes (@benstokes38) December 23, 2022 Sunrisers breaks the financial institution for Brook Sunrisers Hyderabad bought Harry Brook for INR 13.25 CR, as he turned the most costly participant within the historical past of the staff. “Really looking forward to playing for the Sunrisers Hyderabad. I’ve heard the atmosphere is unbelievable and it has one of the best grounds in the comp [competition]”, mentioned Brooks after the transfer. Mumbai Indians breaks the financial institution for Inexperienced Mumbai Indians purchased Australia all-rounder Cameron Inexperienced for INR 17.25 CR, making him the second-most costly participant within the IPL 2023 Public sale, after Sam Curran. Inexperienced addressed the Mumbai Indians followers by saying “Can’t wait to see you at the Wankhede Stadium.” Paltan, तुमच्यासाठी our very personal Inexperienced #OneFamily#DilKholKe#MumbaiIndians#TATAIPLAuction MI TV pic.twitter.com/snhN6JZWuc — Mumbai Indians (@mipaltan) December 23, 2022 Mayank goes Orange After getting a snub from his earlier staff Punjab Kings, Mayank Agarwal was purchased for INR 8.25 CR by the Sunrisers Hyderabad. “Super exicted and delighted to be part of the Sunrisers”, mentioned Agarwal on social media after his transfer. Rahane strikes down south Ajinkya Rahane, who performed for the Kolkata Knight Riders final season, made a transfer to four-time champion Chennai Tremendous Kings. He was offered on the his base value of INR 50 lakh. Ranjithame Rahane! You are considered one of us now! #WhistlePodu#Yellove @ajinkyarahane88pic.twitter.com/7HsUbfGexL — Chennai Tremendous Kings (@ChennaiIPL) December 23, 2022 Teen Nishant “can’t wait to whistle” Left-handed batsman Nishant Sharma was a part of the U-19 Indian cricket squad that received the World Cup in 2022 and in addition hit a century within the ultimate match towards England. The 18-year-old couldn’t include his pleasure after his CSK transfer. Thanks, #CSK. Cannot wait to whistle! https://t.co/rpvi42huXp — Nishant Sindhu (@NishantSindhu09) December 23, 2022 Lucknow inserting large hopes on Pooran Lucknow Tremendous Giants shelled out INR 16 CR for wicketkeeper-batsman Nicholas Pooran on the IPL Public sale 2023. Right here’s why the West-Indies worldwide fetched such a big-money transfer. : “He is a particular expertise. He’ll really win you video games single-handedly.” – @GautamGambhir#SuperFam, from to , how excited are you to look at the Caribbean powerhouse? #IPL2023 | #IPLAuction | #LucknowSuperGiants | #LSGpic.twitter.com/AljHaqsBGH — Lucknow Tremendous Giants (@LucknowIPL) December 23, 2022 Source link The post IPL 2023 Public sale: Participant reactions on social media- Sam Curran costliest purchase; Stokes reacts to CSK transfer; MI breaks financial institution for Inexperienced appeared first on The Times of Bengal.","pubDate":"2022-12-23 13:43:33","image_url":null,"source_id":"the_tob","country":["india"],"category":["sports"],"language":"english"},{"title":"NBA, NFL and cricket games to enjoy on Christmas Day","link":"https://www.dailymail.co.uk/sport/football/article-11565713/NBA-NFL-cricket-games-enjoy-Christmas-Day.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"There's been a drip feed of football entertainment in the past week - as the Football League gets up and running - but nothing quite like the thrills we saw in Qatar.","content":null,"pubDate":"2022-12-23 12:56:01","image_url":"https://i.dailymail.co.uk/1s/2022/12/22/10/65847093-0-image-a-26_1671706161238.jpg","source_id":"dailymailuk","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"England cricket star Sam Curran stands to make MILLIONS after IPL record","link":"https://www.dailymail.co.uk/sport/cricket/article-11569447/England-cricket-star-Sam-Curran-stands-make-MILLIONS-IPL-record.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Curran's is one of the most exciting - and most marketable - players in world cricket and he stands to earn a personal fortune of millions from this and other short-form tournaments.","content":null,"pubDate":"2022-12-23 12:53:03","image_url":"https://i.dailymail.co.uk/1s/2022/12/23/12/65883455-0-image-a-17_1671799657754.jpg","source_id":"dailymailuk","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"New Zealand coach, Gary Stead: England’s ‘Bazball’ thrilling for cricket","link":"https://www.thetimesofbengal.com/sports/new-zealand-coach-gary-stead-englands-bazball-thrilling-for-cricket/","keywords":["Sports"],"creator":["admin"],"video_url":null,"description":"A method of cricket named for considered one of New Zealand’s most profitable gamers will The post New Zealand coach, Gary Stead: England’s ‘Bazball’ thrilling for cricket appeared first on The Times of Bengal.","content":"A method of cricket named for considered one of New Zealand’s most profitable gamers will probably be in the back of Kiwi minds after they tackle Pakistan in a two-match Check sequence starting subsequent week, their head coach mentioned Friday. England humiliated Pakistan 3-0 in a sequence that ended Tuesday taking part in “Bazball” – an aggressive type named for its imported coach Brendon “Baz” McCullum, who performed 101 checks for New Zealand. The Kiwis are subsequent to tackle Pakistan, with the primary Check beginning in Karachi on Monday, and the second in Multan on January 3. “I think there’s no doubt that England are changing the face of Test cricket a little bit,” New Zealand coach Gary Stead advised a press convention Friday when requested about “Bazball”. “I think all teams will be thinking a little bit around how England play and the successes that they’ve had in this past year. So that’s exciting for them and, I think, it’s exciting for Test cricket,” he added. Regardless of Pakistan’s thrashing by the hands of England, Stead mentioned they’d not deal with the house staff evenly. “We are certainly not underestimating Pakistan at all in their home conditions,” mentioned Stead. “I think spin will take a bigger part than we are probably used to normally, and reverse swing will also be there.” New Zealand have solely received two of twenty-two Exams in Pakistan, however have received their final three sequence — as soon as at residence, and twice on impartial floor within the United Arab Emirates. Stead backed quick bowler Tim Southee to be an in a position alternative as skipper for Kane Williamson, who resigned from the captaincy forward of the tour however continues to be within the squad. “Tim’s got a great cricketing brain and we’re looking forward to the way that he manages the side through the series,” he mentioned. “Kane will still be a great leader in our group.” The groups will even play three one-day internationals on January 10, 12 and 14 – all in Karachi. Source link The post New Zealand coach, Gary Stead: England’s ‘Bazball’ thrilling for cricket appeared first on The Times of Bengal.","pubDate":"2022-12-23 12:16:41","image_url":null,"source_id":"the_tob","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL Public sale: Full Checklist Of Offered And Unsold Gamers – Sam Curran Turns into Most Costly IPL Public sale Purchase | Cricket Information","link":"https://www.thetimesofbengal.com/sports/ipl-public-sale-full-checklist-of-offered-and-unsold-gamers-sam-curran-turns-into-most-costly-ipl-public-sale-purchase-cricket-information/","keywords":["Sports"],"creator":["admin"],"video_url":null,"description":"IPL Public sale 2023 Reside: Intense bidding is on for younger Indian uncapped bowler Shivam Mavi, The post IPL Public sale: Full Checklist Of Offered And Unsold Gamers – Sam Curran Turns into Most Costly IPL Public sale Purchase | Cricket Information appeared first on The Times of Bengal.","content":"IPL Public sale 2023 Reside: Intense bidding is on for younger Indian uncapped bowler Shivam Mavi, who has performed a number of seasons for KKR prior to now. Younger J&Ok batter Vivrant Sharma was purchased for Rs 2.6 crore by Sunrisers Hyderabad. It has been a file breaking day on the IPL public sale as Punjab Kings shelled out Rs 18.5 crore for England’s T20 World Cup hero Sam Curran. Curran has now change into the costliest participant within the historical past of the IPL public sale, surpassing Chris Morris. One other participant shattered the file of Morris as younger Australia all-rounder Cameron Inexperienced was purchased for Rs 17.5 crore by Mumbai Indians. England star Ben Stokes was purchased for Rs 16.25 crore by Chennai Tremendous Kings. West Indies star Nicholas Pooran has been purchased by Lucknow Supergiants for Rs 16 crore. Harry Brook was ultimately bought for Rs 13.25 crore to Sunrisers Hyderabad after a three-way battle. Mayank Agarwal was additionally bagged by SRH for Rs 8.25 crore. Kane Williamson was the primary participant to be bought for Rs 2 crore to Gujarat Titans. Ajinkya Rahane went for his base worth of Rs 50 lakh to CSK. Joe Root and Rilee Rossouw went unsold within the first set. England’s star spinner Adil Rashid was purchased by Sunrisers Hyderabad for Rs 2 crore whereas England opener Phil Salt was picked for a similar quantity by Delhi Capitals. The full checklist of gamers which can be to be auctioned could be discovered right here Right here is the complete checklist of bought and unsold gamers in IPL 2023 Public sale 1) Kane Williamson – bought to Gujarat Lions Rs 2 crore 2) Harry Brook – bought to Sunrisers Hyderabad Rs 13.25 crore 3) Mayank Agarwal – bought to Sunrisers Hyderabad Rs 8.25 crore 4) Ajinkya Rahane –bought to Chennai Tremendous Kings for Rs 50 lakh 5) Joe Root – Unsold 6) Rilee Rossouw – Unsold 7) Shakib al Hasan– Unsold 8) Sam Curran – bought to Punjab Kings Rs 18.50 crore 9) Odean Smith – bought to Gujarat Titans for Rs 50 lakh 10) Sikandar Raza – bought to Punjab Kings for Rs 50 lakh 11) Jason Holder – bought to Rajasthan Royals for Rs 5.75 crore 12) Cameron Inexperienced – bought to Mumbai Indians for Rs 17.5 crore 13) Ben Stokes – bought to Chennai Tremendous Kings for Rs 16.25 crore 14) Litton Das – unsold 15) Nicholas Pooran –bought to Lucknow Supergiants for Rs 16 crore 16) Heinrich Klaasen – bought to Sunrisers Hyderabad for Rs 5.25 crore 17) Kusal Mendis – Unsold 18) Tom Banton –Unsold 19) Phil Salt – bought to Delhi Capitals for Rs 2 crore 20) Chris Jordan – unsold 21) Reece Topley – bought to Royal Challengers Bangalore for Rs 1.9 crore 22) Jaydev Unadkat – bought to Lucknow Supergiants for Rs 50 lakh 23) Adam Milne – unsold 24) Jhye Richardson – bought to Mumbai Indians for Rs 1.5 crore 25) Ishant Sharma – bought to Delhi Capitals for Rs 50 lakh 26) Adil Rashid – bought to Sunrisers Hyderabad for Rs 2 crore 27) Akeal Hosein – unsold 28) Adam Zampa – unsold 29) Tabraiz Shamsi – unsold 30) Mujeeb Rahman – unsold 31) Mayank Markande – bought to Sunrisers Hyderabad for Rs 50 lakh 32) Anmolpreet Singh – unsold 33) Chethan LR – unsold 34) Shubham Khajuria – unsold 35) Rohan Kunnummal – unsold 36) Shaik Rasheed – bought to Chennai Tremendous Kings for Rs 20 lakh 37) Himmat Singh– unsold 38) Vivrant Sharma – bought to Sunrisers Hyderabad for Rs 2.6 crore 39) Priyam Garg – unsold 40) Samarth Vyas – bought to Sunrisers Hyderabad for Rs 20 lakh 41) Saurabh Kumar – unsold 42) Corbin Bosch – unsold 43) Sanvir Singh – bought to Sunrisers Hyderabad for Rs 20 lakh 44) Abhimanyu Easwaran – unsold 45) Nishant Sindhu – bought to Chennai Tremendous Kings for Rs 60 lakh 46) Shashank Singh – unsold 47) Sumit Kumar – unsold 48) Dinesh Bana – unsold 49) N Jagadeesan – bought to Kolkata Knight Riders for Rs 90 lakh 50) KS Bharat –bought to Gujarat Titans for Rs 1.2 crore 51) Upendra Singh Rawat – bought to Sunrisers Hyderabad for Rs 25 lakh 52) Mohammad Azharuddeen – unsold 53) Vaibhav Arora –bought to Kolkata Knight Riders for Rs 60 lakh 54) Yash Thakur – bought to Lucknow Supergiants for Rs 45 lakh 55) KM Asif – unsold 56) Mujtaba Yousuf – unsold 57) Lance Morris – unsold 58) Shivam Mavi – Featured Video Of The Day “Soccer In Argentina Is A Ardour”: Argentinian Envoy To NDTV Matters talked about on this article Source link The post IPL Public sale: Full Checklist Of Offered And Unsold Gamers – Sam Curran Turns into Most Costly IPL Public sale Purchase | Cricket Information appeared first on The Times of Bengal.","pubDate":"2022-12-23 11:52:35","image_url":null,"source_id":"the_tob","country":["india"],"category":["sports"],"language":"english"},{"title":"Ahmed left out of England Test tour of NZ","link":"https://www.perthnow.com.au/sport/cricket/ahmed-left-out-of-england-test-tour-of-nz-c-9259783","keywords":null,"creator":["Staff Writers"],"video_url":null,"description":"Teenage leggie Rehan Ahmed has not been picked by England for February's Test tour of New Zealand as they manage his rapid rise to international cricket.","content":null,"pubDate":"2022-12-23 10:50:48","image_url":"https://images.perthnow.com.au/publication/C-9259783/8e356c9642f193d7de94953a3861103a9f8d51a3-16x9-x0y0w1280h720.jpg","source_id":"perthnow","country":["australia"],"category":["sports"],"language":"english"},{"title":"18 Years Of Dhoni | The great player who started his international cricket journey on this day in 2004!","link":"https://thenewsglory.com/18-years-of-dhoni-the-great-player-who-started-his-international-cricket-journey-on-this-day-in-2004/","keywords":["Sports","Cricket","Dhoni","game","India","MS Dhoni","online special"],"creator":["The News Glory"],"video_url":null,"description":"18 years ago on this day, the great Mahendra Singh Dhoni started his international cricket journey. No one would have expected then that he would be the all-time best player and captain of the cricket world. Let’s rewind a bit and see his path. If we turn back the wheel of time to 2004 on […]","content":"18 years ago on this day, the great Mahendra Singh Dhoni started his international cricket journey. No one would have expected then that he would be the all-time best player and captain of the cricket world. Let’s rewind a bit and see his path. If we turn back the wheel of time to 2004 on this day, Dhoni made his international debut at the MA Aziz Stadium in Chittagong, Bangladesh. In the first match he returned to the pavilion after being run out in one ball without scoring a run. In the first four ODIs he played, he scored three single-digit runs. He was only 23 years old then. Then in April 2005 he proved who he was by hitting 148 off 123 balls in the ODI series against Pakistan. He also made his debut in Test cricket. In the same year he scored 183 runs against Sri Lanka. With that, he became the wicket-keeper batsman of the Indian cricket team. Following his debut in international T20 cricket, his cricket career was on the upswing. With his long hair and action-packed game, Dhoni attracted cricket fans with his magnetism. That attraction has not waned even to this day. He effectively led the Indian team to win the 2007 T20 World Cup series. In the same way, the Indian team led by him became the champion in the 2011 ODI World Cup series. He also won the ICC Champions Trophy series. With that, he earned the fame of being the winningest captain in all the series conducted by the ICC. His impressive innings also included the 2011 final. Dhoni, who played subdued throughout the series, rose up in that match. He scored 91 runs off 79 balls. A sixer Vlasi won the game and the trophy. He retired from international cricket on August 15, 2020. International Record Drops: He is the most unbeaten batsman in ODI cricket. He returned to the pavilion without losing a wicket in total 84 times. He also holds the record for most stumpings by a wicketkeeper in ODI and T20 cricket. He is currently the captain of the Chennai Super Kings team in the IPL cricket arena. Under his leadership, the Chennai team has won the IPL trophy four times. Unforgettable Moment in Cricket Life: “The most memorable moment in my cricketing life was the immense love we got back in Mumbai after the 2007 T20 World Cup win and the moment when the entire crowd at the stadium sang ‘Vande Mataram’ at the 2011 ODI World Cup final. Country has always been my biggest motivation. I want the performance of the team to be better,” Dhoni had said a few years ago.","pubDate":"2022-12-23 10:05:37","image_url":null,"source_id":"thenewsglory","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL Public sale Dwell: Full Record Of Offered And Unsold Gamers | Cricket Information","link":"https://www.thetimesofbengal.com/sports/ipl-public-sale-dwell-full-record-of-offered-and-unsold-gamers-cricket-information/","keywords":["Sports"],"creator":["admin"],"video_url":null,"description":"The Indian Premier League Public sale (IPL Public sale 2023) is about to get underway The post IPL Public sale Dwell: Full Record Of Offered And Unsold Gamers | Cricket Information appeared first on The Times of Bengal.","content":"The Indian Premier League Public sale (IPL Public sale 2023) is about to get underway in Kochi and a complete of 405 gamers will go below the hammer. Kane Williamson was the primary participant to be bought for Rs 2 crore to Gujarat Titans. England’s Harry Brook is enticing a whole lot of curiosity and there may be intense bidding on for the center order batter. IPL Public sale Preview Large identify abroad gamers who’re within the fray embody Ben Stokes, Kane Williamson, Sam Curran, Jason Holder, Cameron Inexperienced amongst many different. Among the many large capped Indian names the likes of Ajinkya Rahane, Mayank Agarwal, Manish Pandey and Ishant Sharma would hope to discover a new dwelling for themselves. Sunrisers Hyderabad have the largest purse with Rs 42.25 crore of their kitty, behind them are Punjab Kings with Rs 32.20 crore of their bag. The full checklist of gamers which are to be auctioned may be discovered right here Right here is the total checklist of bought and unsold gamers in IPL 2023 Public sale 1) Kane Williamson – bought to Gujarat Lions Rs 2 crore 2) Harry Brook – bought to Featured Video Of The Day FIH Ladies’s Nations Cup: Victorious Crew India Receives Heat Welcome In Delhi Subjects talked about on this article Source link The post IPL Public sale Dwell: Full Record Of Offered And Unsold Gamers | Cricket Information appeared first on The Times of Bengal.","pubDate":"2022-12-23 09:24:30","image_url":null,"source_id":"the_tob","country":["india"],"category":["sports"],"language":"english"},{"title":"BBL: Afghanistan pacer Fazalhaq Farooqi’s contract terminated by Sydney Thunder","link":"https://sportstar.thehindu.com/cricket/afghanistan-pacer-fazalhaq-farooqi-bbl-contract-terminated-by-sydney-thunder/article66296551.ece","keywords":null,"creator":["\n        Team Sportstar  \n    "],"video_url":null,"description":"Cricket Australia refused to disclose the allegation against Farooqi. CA said the matter is “confidential” and “no further comment” will be made.","content":null,"pubDate":"2022-12-23 09:12:33","image_url":null,"source_id":"sportstar","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL 2023 Auction LIVE Updates: BCCI secretary Jay Shah, MI's Akash Ambani arrive at venue","link":"https://www.firstpost.com/firstcricket/sports-news/ipl-2023-auction-live-indian-premier-league-mini-auction-latest-updates-11860181.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"IPL 2023 Auction LIVE Updates: BCCI secretary Jay Shah, MI's Akash Ambani arrive at venue","content":"14:40 (IST)IPL 2023 Auction LIVE UpdatesIPL chairman Arun Singh Dhumal begins the event with a speech, and the auction is officially underway. He then allows auctioneer Hugh Edmeades to take over the proceedings.14:36 (IST)IPL 2023 Auction LIVE— Abhimanyu Easwaran has gone from uncapped wicketkeepers list to uncapped all-rounders list— Ben McDermott has withdrawn himself from the #IPLAuction— Rehan Ahmed's base price has changed to ₹50lakh14:26 (IST)IPL 2023 Auctions LIVE Sanjay Bangar speaks to broadcaster Star Sports minutes before the start of the Player Auction:\"We obviously have released two overseas players and three Indian players and all five of them were not in the playing XI. We will also try and fill up those backup positions. We have a relatively smaller purse, for a major part we are going to be mere spectators. We’ll wait and watch, and if there’s an opportunity for us to steal some bargains...\"14:18 (IST)IPL 2023 Auction: How 'Impact Player' rule works, impact on auctionWith a little over 10 minutes to go for the auction to begin at the Grand Hyatt Hotel in Kochi, we bring to you everything you need to know about the 'Impact Player' rule and the effect it could have on the the manner in which the franchise heads bid for players when they go under the hammer.Click here to read the full article14:10 (IST)IPL 2023 Auction LIVE Updates:BCCI secretary Jay Shah and Mumbai Indians owner Akash Ambani arrive at the Grand Hyatt in Kochi in the build-up to the IPL auctionThe Big Bosses Are Here, Jay Shah and Akash Ambani Enter The #IPLAuctions pic.twitter.com/J3W0jNd146— News18 CricketNext (@cricketnext) December 23, 202213:51 (IST)IPL Auction 2023: Previewing CSK's auction strategyThe upcoming IPL mini-auction in Kochi allows CSK an opportunity to rope in some local players. TN have shown lot of improvement in white-ball competitions in the last five years and plenty of players have dished out consistent performances with both bat and ball in the domestic circuit. Of the 405 players shortlisted for December 23 bidding, 16 are from TN.Sahil Malhotra analyses the moves that the four-time champions could come up with in Kochi.Click here to read the rest of the piece13:34 (IST)IPL 2023 Auction: Looking at biggest purchases in past auctions From Chennai Super Kings securing MS Dhoni's services in the inaugural IPL auction to Mumbai Indians breaking the bank for wicketkeeper-batter Ishan Kishan in the mega-auction earlier in February, we take a look at the most expensive players in each auction.Click here to read the full article13:11 (IST)IPL 2023 Auction StrategiesFrom CSK prioritising an all-rounder to replace the legendary Dwayne Bravo to defending champions Gujarat Titans hunting for a new speedster, we take a look at the strategies that the ten franchises are likely to come up with in the auction that begins in a little over an hour’s time.Click here to read the full article12:56 (IST)Mahela Jayawardene is in the house! MI have touched base. Akash Ambani walked in 20 mins ago and now Mahela, Zaheer, and other support staff have arrived. #IPL2023Auction #IPL2023 pic.twitter.com/5WdfBtPn3J— Sahil Malhotra (@Sahil_Malhotra1) December 23, 202212:46 (IST)Salary cap available across franchises: CSK: Rs 20.45 croreDC: Rs 19.45 croreGT: Rs 19.25 croreKKR: Rs 7.05 croreLSG: Rs 23.35 croreMI: Rs 20.55 crorePBKS: Rs 32.2 croreRCB: Rs 8.75 croreRR: Rs 13.2 croreSRH: Rs 42.25 croreTotal: Rs 206.5 croreFor more information on the auction, including number of available slots and the full list of players in the auction, click here12:34 (IST)\"RCB will always be my team. I love that franchise and I’m glad that I was a part of it\" In an exclusive conversation with Somya Kapoor, West Indian batting legend Chris Gayle discusses his best memories from the Indian Premier League, sharing the dressing room with Virat Kohli and AB de Villiers and answering the all important question — will there be another Universe Boss?Click here to read the full interview12:20 (IST)A glance at the Grand Hyatt Hotel that is set to host the mini auction later todayKochi applying final touches ahead of the #IPL2023Auction @cricketnext pic.twitter.com/ZsWMhCSiQa— Sahil Malhotra (@Sahil_Malhotra1) December 22, 202212:10 (IST)Auctioneer Edmeades has 'good nerves' after minor scareHugh Edmeades is back to conduct his fifth IPL auction. The 62-year-old collapsed midway through the mega auction earlier this year but is back with high spirits for the mini-auction in Kochi on 23 December.Edmeades admits there are nerves, but “good nerves” every time he conducts an auction and also threw light on the preparation which goes behind the stage to pull off the high-tension job.Click here to read the full article12:00 (IST)Tucked in the corner of the city, the Grand Hyatt Hotel in the Bolgatty region of Kochi is all set to host the IPL mini-auction on December 23. The preparations were in full swing on eve of the big day and franchise owners, coaches and other support staff started checking in as early as 12 PM in the day.Sahil Malhotra soaks in the vibe and paints an image of what it's like being at the venue on the day the franchises are set to battle it out for some of the most sought-after players in the world.Read: Kochi all set for ultimate 'mini' battle11:40 (IST)Hello and welcome to our live coverage of the mini player auction for the 16th edition of the Indian Premier League that is set to take place in Kochi, Kerala later today. A total of 405 players are set to go under the hammer in the event and no more than 87 of them can get picked by the franchises, with the total number of overseas players at 30.It’s time for cricket fans to welcome the Indian Premier League back into their lives, albeit momentarily, with the mini player auction for the 16th edition of the league taking place on Friday, 23 December.IPL 2023 Auction: Players sold/unsoldComplete squads: GT | SRH | RR | MI | PBKS | CSK | RCB | KKR | LSG | DCAfter having taken place in venues such as Bengaluru and Jaipur in recent years, it is time for the southern Indian city of Kochi to play host for the grand affair that will witness the franchises shell out millions for some of the most sought after players in the sport from across the globe.Nearly a thousand players had signed up for the mini auction this year, with less than half of them making it to the BCCI shortlist. From the 991 players that had registered, the board had originally shortlisted 369; it would then add another 36 at the behest of the franchises.MUST CHECK: IPL 2023 Auction: Players list, venue, date, time, livestream, purse remaining, rules, sold and unsold players; all you need to knowA maximum of 87 players can be picked by the franchises from the 405 players that are set to go under the hammer on Friday, 30 of them overseas players.India wicketkeeper-batter Ishan Kishan had fetched the highest bid in the mega-auction that took place in February earlier this year, and it remains to be seen if that bid can be surpassed this year.Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-12-23 08:43:36","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/12/IPL-640.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Royal Challengers Bangalore, IPL 2023 Auction: Full list of players bought by RCB, complete squad","link":"https://www.firstpost.com/firstcricket/sports-news/royal-challengers-bangalore-rcb-ipl-2023-auction-full-squad-player-list-11858751.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"Royal Challengers Bangalore, IPL 2023 Auction: Full list of players bought by RCB, complete squad","content":"The Indian Premier League (IPL) 2023 player auction was held in Kochi on Friday (23 December) ahead of its 16th season, with a total of 405 players going under the hammer.IPL 2023 Auction: LIVE UPDATES | Players sold/unsoldThere will be 273 Indian players taking part in the auction, while 132 players are from overseas countries, that includes four from associate nations. A total of 87 slots are up for grabs on Friday, with 30 of those reserved for overseas cricketers.Royal Challengers Bangalore (RCB) will be one of the teams raring to go in the IPL next season, with the prestigious title having eluded them for the last 15 years.Coming into the auction, RCB have seven slots left to fill, with two of them being overseas. They have a total of ₹8.75 crore remaining in the purse.Royal Challengers Bangalore at IPL 2023 auction: Bidding yet to startRoyal Challengers Bangalore squad:Wicketkeepers: Anuj Rawat, Dinesh Karthik.Batters: Faf du Plessis, Finn Allen, Virat Kohli, Rajat Patidar, Suyash Prabhudessai.All-rounders: Wanindu Hasaranga, Mahipal Lomror, Glenn Maxwell, Shahbaz Ahmed.Bowlers: Akash Deep, Josh Hazlewood, Siddarth Kaul, Mohammed Siraj, Harshal Patel, Karn Sharma, David Willey.Royal Challengers Bangalore released players: Jason Behrendorff, Aneeshwar Gautam, Chama Milind, Luvnith Sisodia, Sherfane RutherfordRead all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-12-23 08:21:44","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/04/Royal-Challengers-Bangalore-LSG-RCB-IPL-2022-Sportzpics-640.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"}]}