{"newsArray":[{"title":"After 15 years, Indian team may tour Pakistan for 2023 Asia Cup","link":"https://www.tribuneindia.com/news/sports/after-15-years-indian-team-may-tour-pakistan-for-2023-asia-cup-441308","keywords":null,"creator":null,"video_url":null,"description":"New Delhi, October 14 The Indian cricket team may tour Pakistan after a gap of 15 years, the BCCI has indicated ahead of its all important Annual General meeting (AGM) on October 18 in Mumbai. The BCCI has shared with all its state unit representatives a lowdown of the work done during the past year along with future plans and schedule of the national team's tours, which includes Asia Cup in Pakistan next year. According to the report, the Indian team will be participating in the ICC Women's T20 World Cup (South Africa), ICC Women's U-19 T20 World Cup (South Africa), Asia Cup (Pakistan) and ICC Cricket World Cup, India. With England, Australia, West Indies and Sri Lanka having already toured Pakistan in the past few years, it will be interesting to see how things pan out as the BCCI will need Centre's permission to allow the team to travel to Pakistan. \"Obviously, when the time comes, it will be a government decision. But there is one aspect. The government allows India versus Pakistan contests in global and continental events. So there is a chance of India travelling, but it will be too early to completely commit that a team will go to Pakistan. However, putting it on the report is a broad hint,\" a senior BCCI source, who did not want to be identified, said. Currently, the Asian Cricket Council is headed by BCCI secretary Jay Shah and his decision will hold a lot of weight going forward. — PTI Looking back The neighbours last played white-ball contest in 2012 when Pak came to India for 3 T20Is amp; 3 ODIs India last travelled to Pakistan in 2008 for the 50-over Asia Cup Bilateral cricket ties halted due to political tension between the two nations BCCI roster ICC Women's T20 World Cup (South Africa) ICC Women's U-19 T20 World Cup (South Africa) Asia Cup (Pakistan) ICC Cricket World Cup, India","content":null,"pubDate":"2022-10-14 23:40:44","image_url":"https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/10/2022_10$largeimg_336410059.jpg","source_id":"tribuneindia","country":["india"],"category":["sports"],"language":"english"},{"title":"Oz avoid England whitewash due to rain","link":"https://www.cairnspost.com.au/sport/cricket/oz-avoid-england-whitewash-due-to-rain/video/fb526c345fe82953fe3065e42657b419","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket: Australia narrowly avoided a 3-0 series whitewash to England in their T20 series after the third match was abandoned due to consistent rain.","content":null,"pubDate":"2022-10-14 22:09:18","image_url":null,"source_id":"cairnspost","country":["australia"],"category":["sports"],"language":"english"},{"title":"“Mistakes have been made which have damaged cricket”: Why was David Warner banned from Australia captaincy for life by Cricket Australia?","link":"https://thesportsrush.com/cricket-news-mistakes-have-been-made-which-have-damaged-cricket-why-was-david-warner-banned-from-australia-captaincy-for-life-by-cricket-australia/","keywords":["Cricket","Australia tour of South Africa 2018","David Warner","Sandpaper Gate"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Why was David Warner banned from captaining Australia in the future across formats following an incident during South Africa tour in 2018. Australian opener batter David Warner is likely to benefit from Cricket Australia’s proposal to change the rules and the code of conduct before its integrity head, which would make him eligible to appeal… The post “Mistakes have been made which have damaged cricket”: Why was David Warner banned from Australia captaincy for life by Cricket Australia? appeared first on The SportsRush.","content":"Australian opener batter David Warner is likely to benefit from Cricket Australia’s proposal to change the rules and the code of conduct before its integrity head, which would make him eligible to appeal against the Australian captaincy ban imposed on him since the year 2018. Warner is seen as the most appropriate individual to take over the ODI captaincy, after Aaron Finch decided to retire from the format post the recently concluded New Zealand series. Despite other captaincy for the role, and even the present Australia Test skipper have voiced their support for the Southpaw batter, who is also experiencing a decent run with the bat in the limited Overs format. As for Warner, the 35-year-old is as ready as ever to take up the responsibility, while keen to sit down with the integrity team as well, the board’s decision on the lifetime ban. It all happened during the third Test match at Cape Town, during Australia’s tour of South Africa in the year 2018. Australia’s Cameron Bancroft was caught on camera while attempting to artificially change the condition of the ball using a sandpaper, to perhaps facilitate early reverse swing. As per the investigation which was carried on later, it was found that David Warner was the one to have come up with the plan, and it had to be a junior player (Bancroft it was) to perform the task. Warner had not only persuaded Bancroft to implement the plan, but also demonstrated before him, as to how the ball tampering was supposed to be done. Skipper Steve Smith, on the other hand knew about the hatching of the potential plan in advance, and also directed the duo to conceal the evidence (sandpaper) at the field of play. Post the investigation, Bancroft was banned for a nine-month period, while Warner and Smith were banned from playing international Cricket for one year. Also, while Smith and Bancroft were banned from captaining Australia for at least the next two years, Warner was served a lifetime ban from the same for the rest of his international career.","pubDate":"2022-10-14 19:31:12","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"The duality of Indian batting’s innovative disruptor","link":"https://www.thehindu.com/sport/cricket/the-duality-of-indian-battings-innovative-disruptor/article66012114.ece","keywords":null,"creator":["\n        N. Sudarshan  \n    "],"video_url":null,"description":"Despite coming through the domestic ranks more than a decade ago, Suryakumar Yadav has kept pace with Twenty20 cricket’s evolution by accessing a batting style from the future. Both known quantity and enigma, he will be central to the team’s chances at the T20 World Cup","content":"Flex appeal: Dexterity is a standout feature of Suryakumar Yadav’s batting. International batters come in different hues. There are the imperious monarchs, such as Vivian Richards, whose mere presence is enough to drive a scare into the opposition. There are the stylists, like David Gower and V.V.S. Laxman, whose finesse charms even the most ruthless of opponents into developing a soft corner. There are the perfectionists, such as Sachin Tendulkar, who once reminded the legendary Don Bradman of himself. Suryakumar Yadav is among batting’s dazzling innovators. He is in his 30s, when techniques deteriorate, bowlers work batters out and the hunger for runs subsides. But for Suryakumar, who smashed 904 runs across two title-winning seasons in 2019 and 2020 for Mumbai Indians, the opposite is proving true. As Twenty20 cricket evolves, he is a player who is continuously rising to meet the challenge rather than being dragged down by it. So much so that in July, during his sensational 117 (55b) against England, a straight four off Chris Jordan ended with such an extravagant flourish — head still, elbow high, bat at the high point of the upswing and the front leg springing up and down like that of a prancing horse — that the commentator exclaimed, “it’s like Victor Trumper”. The shot may never be immortalised like Trumper’s was, first through George Beldam’s camera and then Gideon Haigh’s prose. But in most Indian cricket fans’ minds currently, it is that image of Suryakumar that is firmly etched. As India gears up for the ICC T20 World Cup in Australia, it’s the Mumbaikar who appears most crucial to the country’s chances. “He has the game to bat in any conditions,” Virat Kohli, the high priest of batting, said during the recent T20 series against Australia. “He got a hundred in England, then batted well in the Asia Cup. He is striking the ball as well as I have seen him. It’s just the array of shots, and to play the shots at the right time is such a good skill to have.” In a line-up that has Rohit Sharma, K.L. Rahul and Kohli, Suryakumar has come to be the mainstay. In T20 internationals this year, his 801 runs (from 23 matches) are the most in the world, and his strike rate of 184.56 (minimum 15 innings) the highest. In six hitting — the quality that most epitomises a successful T20 batter — the 32-year-old is again No.1, hammering 51 of them. The next best from among elite sides is Rovman Powell’s 37. “This is the kind of player he has always threatened to be,” says Abhinav Mukund, former India opening bat and now a commentator, about a player who debuted for Mumbai way back in 2010 but arrived on the international scene only in 2021. “We have played a lot of cricket together, in the A-tour set-up, since early 2012. He has always been one of those very rebellious characters. But he is a lot calmer now and crucially has not lost his fearlessness.” The game’s shortest format has made many a great batter’s art, Kohli’s included, seem anachronistic. But Suryakumar plays eminently futuristic cricket. If a large part of T20 tactics is about shrinking the size of the field, he manipulates space and unlocks areas of the ground like no other. Dexterity is a standout feature of Suryakumar’s batting. In an era where bowling straight and on the stumps is one of the key tactical plays, and where fielding teams place enormous focus on defending the boundaries, especially down the ground, his ability to hit shots across the entire arc on the off-side is unparalleled. He who can hit an inside-out drive off a short-of-a-length ball pitched on middle- and off-stump for six is special. To shuffle across, go down really low and hit a similar delivery that’s slightly pitched up over fine-leg for six is extra special. “He has got phenomenal wrists,” says Abhinav. “And he has figured out that playing shots over fine-leg or over wide long-on is something most teams don’t have a fielder for. And he plays the cut shot really well. More importantly, he has figured out a very good stable base from where he can generate great power.” And he is arguably the best player of spin in the World Cup squad which makes him a feared batter across the entirety of a T20 innings. The clearest evidence of this is the unbeaten 71 against Chennai Super Kings in Qualifier-1 of the 2019 IPL on a slow, turning Chepauk track against an attack comprising Harbhajan Singh, Ravindra Jadeja and Imran Tahir. “You will hardly find him stepping out and lagao [whacking] a ball somewhere into the deep,” says Abhinav. “You will see him hit a shot over cover beautifully. You see him sweeping very well, probably the only Indian batter in the top-six who sweeps consistently. DK [Dinesh Karthik] does it a bit. It is a very good shot to have if you want to succeed [against spin].” Fast-bowling in T20 has also evolved. Apart from the deceptive slower ones and yorkers at the death, bowling length deliveries at good pace on hard pitches — like the ones Down Under — is a tactic teams are increasingly employing. India quick Prasidh Krishna, who also plays for Rajasthan Royals, is adept at this. But the 26-year-old has often found Suryakumar incredibly hard to bowl at. “His ability to access 360 degrees of the ground is something a bowler will be wary of,” says Prasidh. “He has a few more shots than a normal batter. [But] more than skill, it’s his confidence. He is willing to try those [shots] in the nets, and in match situations they come instinctively. “I don’t think anybody can practise these unorthodox shots. But it is your instinct and the confidence that ensures you go through with them.” Suryakumar has admitted that a lot of these shots, like the ramp and the scoop, are premeditated, a feature that further deepens the notion purists have of T20 cricket being morally and intellectually inferior. But their execution requires high skill, which the right-hander seemingly possesses in abundance. “Batters will play their shots, no matter what the line or length is,” says Prasidh. “As a bowler, I would say, just try and execute the plan that the team has set for the batter and leave the rest. There is no other substitute. “Bowlers don’t really have a step-out or a scoop, so there is no mental advantage to be had. In a way it is very simple. You try and bowl to the field and that’s about it.” It’s part common sense and part helplessness, and teams’ success against India at the World Cup will hinge on how they negotiate this duality. Suryakumar is a known quantity and yet an enigma; a cheerfully exuberant personality who strikes fear in the bowler’s heart. Our code of editorial values Printable version | Oct 15, 2022 12:39:50 am | https://www.thehindu.com/sport/cricket/the-duality-of-indian-battings-innovative-disruptor/article66012114.ece © THG PUBLISHING PVT LTD.","pubDate":"2022-10-14 19:07:38","image_url":null,"source_id":"thehindu","country":["india"],"category":["sports"],"language":"english"},{"title":"ICC T20 World Cup prize money 2022: How much do the winners get and what is the breakdown?","link":"https://www.thesun.co.uk/sport/20113317/icc-t20-world-cup-prize-money-winners-breakdown/","keywords":["Cricket","Sport","Explainers","Men's T20 World Cup"],"creator":["Nyle Smith"],"video_url":null,"description":null,"content":"EVERYONE could do with an extra bit of money in life - and the winners of the ICC T20 World Cup will certainly get that. Australia's scintillating 2021 final win over New Zealand saw them pocket approximately £1.4million. While the Kiwis took home around £715,000 for their efforts which includes Super 12 wins. But what is the prize money for the winners of the 2022 edition? The ICC confirmed that the total prize pool is £5m which will be shared among the teams at this year's World Cup. And the winners will pocket the same amount as last year - £1.4m with the runners up guaranteed to take home - £715,000. Similar to 2021, each win in the Super 12 phase will earn a team an additional £35,000. However, for the sides not automatically through to the Super 12, a first round win will also be worth £35,000. The eighth edition of the ICC T20 World Cup will be held in Australia, across seven different cities. It is scheduled to get underway from Sunday, October 16 until Sunday, November 13. There will be a total of 45 matches with the Super 12 starting on Saturday, October 22. Australia 173-2 beat New Zealand 172-4 by 8 wickets in the final of the 2021 tournament.","pubDate":"2022-10-14 18:37:11","image_url":null,"source_id":"thesun","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Cricket: Australian T20 captain Aaron Finch says mankad is 'fair game' ahead of World Cup","link":"https://www.nzherald.co.nz/sport/news/article.cfm?c_id=4&objectid=12558873&ref=rss","keywords":null,"creator":null,"video_url":null,"description":"The Black Caps can consider themselves warned. Australian T20 cricket captain Aaron Finch says use of the mankad to dismiss an opponent is \"fair game\" just a week out from the teams' opening World Cup clash in Sydney.Finch, speaking...","content":null,"pubDate":"2022-10-14 18:26:07","image_url":null,"source_id":"nzherald","country":["new zealand"],"category":["sports"],"language":"english"},{"title":"Virat Kohli maintains highest fitness standards in Team India, know details","link":"https://www.indiatvnews.com/sports/cricket/virat-kohli-maintains-highest-fitness-standards-in-team-india-know-details-2022-10-14-816298","keywords":null,"creator":null,"video_url":null,"description":"Virat Kohli is one of the fittest athletes in the world. In terms of fitness, he is compared to star footballer Cristiano Ronaldo and NBA superstar LeBron James. After Kohli arrived in international cricket, the fitness level of all the cricketers of Team India improved. However, Kohli is more fit as compared to his fellow players by distance. A testimony to that is a BCCI report which revealed that at least 23 centrally-contracted Indian cricketers, except the former skipper, required a visit to NCA for rehabilitation in the 2021-22 season for some or other injury.","content":"is one of the fittest athletes in the world. In terms of fitness, he is compared to star footballer Cristiano Ronaldo and NBA superstar LeBron James. After Kohli arrived in international cricket, the fitness level of all the cricketers of Team India improved. However, Kohli is more fit as compared to his fellow players by distance. A testimony to that is a BCCI report which revealed that at least 23 centrally-contracted Indian cricketers, except the former skipper, required a visit to NCA for rehabilitation in the 2021-22 season for some or other injury. The report prepared by BCCI CEO Hemang Amin details the work done at the National Cricket Academy (NCA) in the last season. \"A total of 96 complex injuries to 70 players were treated by the NCA medical team during this period,\" according to the report. The 23 centrally contracted players included skipper (hamstring), his deputy (post hernia surgery), , , , , , Rishabh Pant, , Shreyas Iyer, Suryakumar Yadav, , , Washington Sundar, , Washington Sundar, Bhuvneshear Kumar, , R Ashwin, Axar Patel, and . According to an insider, Kohli never in the past year needed to check in at Bengaluru's Centre of Excellence for injury or fitness-related issues. \"To be fair, a lot of these injuries were on-field. Some were unlucky with fractures (Surya). Some had multiple issues at different times. \"But you have to give it to Kohli's fitness that he has managed himself so well that he never had any hamstring or muscle-related injuries, primarily because of the kind of fitness work he does throughout the year,\" a BCCI source said. To add a bit of context, the several players who required rehab were 10 years younger than Kohli and had extended periods of various types of injury lay-offs. The list included youngsters like , , Ruturaj Gaikwad, Venkatesh Iyer, KS Bharat, Kamlesh Nagarkoti, Sanju Samson, Ishan Kishan, Karthik Tyagi, Navdeep Saini, Rahul Chahar. In 2018, Kohli developed back-related (herniated disc) problem which prevented him from playing County cricket for Surrey but since then he has managed it well and is still the fittest senior Indian player in the park. (Inputs from PTI)","pubDate":"2022-10-14 18:12:11","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"What is a cricket ball made of and what are the types?","link":"https://www.thesun.co.uk/sport/20112629/what-is-cricket-ball-types-made-of/","keywords":["Cricket","Sport","Explainers","Sport Evergreen"],"creator":["Nyle Smith"],"video_url":null,"description":null,"content":"THEY say a handyman should never blame his tools – and the same applies in the case of a cricket ball. The late Australian legend Shane Warne amazed fans for years with his bowling technique, especially the Ball of the Century. EPAShane Warne was on of the world’s greatest bowlers[/caption] And Sri Lankan cricket idol Muttiah Muralitharan’s 7339.5 overs has also proved that bowling is all about talent and not just the ball. However, there are different cricket balls for different occasions and SunSport will be taking a deeper dive into what they are made of. What is a cricket ball made of? Similar to cricket bats, a cricket ball is made of entirely organic materials. Cork core – gives the ball its shape and density. Read More on cricket NO JONNY NO Bairstow shares gruesome pics of broken leg after freak accident playing golf MALAN BALLER Malan earns series win in Pakistan as England get big boost for T20 World Cup Twine layers – ensures the outside leather casting anchors to the cork which gives it some flexibility to the surface. Leather – forms a dynamic and durable surface that can change through the course of the match. Seam – gives the bowler a point of leverage to impart swing, cut or spin and it forces the batter to anticipate the movement of the ball in the air. What are the types of cricket balls? There are four different types of cricket balls which are used depending on the occasion, Most read in Sport BEING FRENK Man Utd target De Jong may finally quit Barca as he’s left 'DISGUSTED' at role SHAMED Riot police injured 'with one hit on head with chair' as chaos mars West Ham clash HAIR-RAISING Fans in shock as Mata shares pic with long wavy hair - but is it really him? ACE INFLUENCE I was tennis pro but now I'm taking over the game as its sexiest influencer WELL SPOTTED Fans all say same thing as footage of Saka's penalty shows Ramsdale reaction BEING FRANK Joshua told by Warren he can have 'two great fights' for comeback bout Clean white White balls were introduced to improve visibility against coloured clothing during night matches. But two balls are usually used during a match as the white leather deteriorates and loses its colour quicker than a red one and it is mainly used in T20’s or ODI’s. Standard red Before the introduction of World Series cricket in the 1970s, the red leather ball was the most common ball. It is mainly used in Test matches. Pink ball The pink ball is similar to the standard red as it is used in the longer Test matches. However, the seam of the pink ball is more firm which helps players to grip the ball better. Blind cricket balls Competition blind cricket first began in 1920 and has now become really popular. Blind cricket has two balls – both have bottle tops and metal weights inside which create a noise once the ball is hit. What is the record for the fastest bowl? The fastest bowl recorded at the time of this publication is 161.3km/h (100.23mph) by Pakistan icon Shoaib Akhtar. He achieved this against England in the 2003 World Cup and stats say that his bowl is faster than a cheetah.","pubDate":"2022-10-14 17:45:49","image_url":null,"source_id":"thesun","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"India Women vs Sri Lanka Women Live Telecast Channel in India: When and where to watch INDW vs SLW Women’s Asia Cup 2022 final?","link":"https://thesportsrush.com/cricket-news-india-women-vs-sri-lanka-women-live-telecast-channel-in-jndia-when-and-where-to-watch-indw-vs-slw-womens-asia-cup-2022-final/","keywords":["Cricket","Asia Cup 2022","India","Sri Lanka"],"creator":["Gurpreet Singh"],"video_url":null,"description":"India Women vs Sri Lanka Women Live Telecast Channel in India: Sri Lankan women have reached an Asia Cup final after 14 years. Defending a modest target of 122 during the semi-final against Pakistan, and staring at a likely defeat until at least the 18th Over of the chase, Sri Lanka made a stellar comeback… The post India Women vs Sri Lanka Women Live Telecast Channel in India: When and where to watch INDW vs SLW Women’s Asia Cup 2022 final? appeared first on The SportsRush.","content":"India Women vs Sri Lanka Women Live Telecast Channel in India: Sri Lankan women have reached an Asia Cup final after 14 years. Defending a modest target of 122 during the semi-final against Pakistan, and staring at a likely defeat until at least the 18th Over of the chase, Sri Lanka made a stellar comeback during the final 15 minutes, to ultimately prevail by 1 run, and reach the grand finale of the Women’s Asia Cup 2022; their first in the championship since the 2008 edition. The Indians, on the other hand, were not threatened one bit by the Thailand women, as they registered a thumping, one-sided, 74-run victory during the first semi-final earlier on Thursday. India and Sri Lanka will now lock horns for the Asian supremacy title 2022, at the Sylhet International Cricket Stadium on Saturday. ALSO READ: IND W vs SL W head to head record Earlier, during the round-robin stage of the tournament, India had defeated Sri Lanka by 41 runs, after posting 150/6 on the board in their 20 Overs. The Harmanpreet Kaur-led side will certainly start as favourites to lift the title on Saturday, while Sri Lanka will look to surprise the cricketing fraternity by playing to their potential best, akin the men’s side, who lifted the men’s Asia Cup by defeating Pakistan last month. India Women vs Sri Lanka Women Live Telecast Channel in India The Women’s Asia Cup 2022 grand finale will begin from 01:00 pm onwards (IST). As has been the case during all the matches so far in the tournament, the final too would be broadcast on the Star Sports network in India. The exact channels on which one can watch the clash is Star Sports 2 and Star Sports 2 HD. Online users will be able to live stream the grand finale on the Star network’s application Disney+Hotstar, although with a paid subscription. No other channel or app will provide with the live broadcast of the contest. The post India Women vs Sri Lanka Women Live Telecast Channel in India: When and where to watch INDW vs SLW Women’s Asia Cup 2022 final? appeared first on The SportsRush.","pubDate":"2022-10-14 17:18:14","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Man stabs friend to death after heated argument over Rohit Sharma, Virat Kohli: Report","link":"https://www.dnaindia.com/cricket/report-man-stabs-friend-to-death-after-heated-argument-over-rohit-sharma-virat-kohli-report-2992826","keywords":["Sports","Cricket"],"creator":["DNA Web Team"],"video_url":null,"description":"The incident took place in Tamil Nadu's Poyyur village, where a cricket fan murdered his friend for speaking ill of his favourite cricketers.","content":null,"pubDate":"2022-10-14 17:00:00","image_url":null,"source_id":"dnaindia","country":["india"],"category":["sports"],"language":"english"},{"title":"England’s T20 World Cup fixtures – TV channels and live stream","link":"https://www.thesun.co.uk/sport/20111930/england-t20-world-cup-fixtures-tv-channel-live-stream/","keywords":["Cricket","Sport","Explainers","Men's T20 World Cup"],"creator":["Nyle Smith"],"video_url":null,"description":null,"content":"ENGLAND will be determined to dethrone World Cup champions Australia come the end of November. The Aussies picked apart New Zealand in the 2021 final with David Warner and Mitchell Marsh both plundering half-centuries. And it was revenge for England who were beaten by the Kiwis in an action-packed semi-final. However, the time has come again for Matthew Mott's team to try and repeat their 2019 triumph at Lord's. But when is the ICC T20 World Cup 2022 and what are England's fixtures? The eighth edition of the ICC T20 World Cup will be held in Australia, across seven different cities. It is scheduled to get underway from Sunday, October 16 until Sunday, November 13. There will be a total of 45 matches with the Super 12 starting on Saturday, October 22. Australia 173-2 beat New Zealand 172-4 by 8 wickets in the final of the 2021 tournament. England have been drawn in Group 1 along with the like of New Zealand, Afghanistan and reigning champions Australia. Matthew Mott's side will also take on the first placed team from Group A and the runner up from Group B during the first round. The first stage of the World Cup involves eight teams that had to go through qualification. And the next group stage includes teams that already qualified alongside the top four teams from stage one. Group A: Namibia, Sri Lanka, United Arab Emirates, Netherlands Group B: Ireland, Scotland, Zimbabwe, West Indies Group 1: Australia, Afghanistan, England , New Zealand, Group A winner, Group B runner-up Group 2: Bangladesh, India, Pakistan, South Africa, Group A runner-up, Group B winner ALL the action will be broadcasted LIVE on Sky Sports Cricket in the UK. However, selected matches will be shown live on Sky Sports Main Event. Subscription members of Sky Sports can also head to the Sky Go app on your chosen device to stream the action. Alternatively, viewers can purchase a NOW TV pass to watch the World Cup fixtures.","pubDate":"2022-10-14 16:37:45","image_url":null,"source_id":"thesun","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"India may tour Pakistan in 2023 after 15-year long gap, here's all you need to know","link":"https://www.indiatvnews.com/sports/cricket/india-may-tour-pakistan-in-2023-after-15-year-long-gap-here-s-all-you-need-to-know-india-vs-pakistan-2022-10-14-816277","keywords":null,"creator":null,"video_url":null,"description":"The cricket team of India may tour Pakistan in 2023, the BCCI has indicated ahead of its Annual General Meeting (AGM) scheduled on October 18 in Mumbai.","content":null,"pubDate":"2022-10-14 16:29:29","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"Shan Masood last 10 T20 innings: Shan Masood score in last 10 T20Is innings list","link":"https://thesportsrush.com/cricket-news-shan-masood-last-10-t20-innings-shan-masood-score-in-last-10-t20is-innings-list/","keywords":["Cricket","Pakistan","Shan Masood"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Shan Masood last 10 T20 innings: The Southpaw batter made his T20I debut against England during the seven-match series in September-October. Pakistan emerged victorious in the New Zealand T20I Tri-Series 2022 by defeating New Zealand by 5 wickets in the grand finale which took place at the Hagley Oval, Christchurch on Friday. En route the… The post Shan Masood last 10 T20 innings: Shan Masood score in last 10 T20Is innings list appeared first on The SportsRush.","content":"Pakistan emerged victorious in the New Zealand T20I Tri-Series 2022 by defeating New Zealand by 5 wickets in the grand finale which took place at the Hagley Oval, Christchurch on Friday. En route the rather moderate target of 164, the Pakistan opening batting pair of Babar Azam (15 off 14) and Mohammad Rizwan (34 off 29) yet again took the conservative approach as per modern T20 standards, with the scorecard reading mere 64/1 after the 10-Over mark. Shan Masood, who came in post Babar’s dismissal in the fifth Over, failed to keep up with the required run rate as well, as he returned back during the 11th Over, at the individual score of 19 off 21 deliveries, at a strike rate of 90.48. With Rizwan getting dismissed in the next Over as well, the pair of Haider Ali (31 off 15) and Mohammad Nawaz (38 off 22) came to the team’s rescue, thereby giving a statement of sorts to the ones who have for quite some time now, criticized the average returns from the bat of the middle-order. The recent news coming from the Pakistan Cricket Board (PCB) is that the experienced left-handed batter Fakhar Zaman has been included in Pakistan’s 15-member squad for the imminent T20 World Cup. Fakhar has replaced leg-spinner Usman Qadir, who has not recovered from a hairline fracture on his right thumb, which he has sustained during the 4th T20I versus England last month. While Fakhar had earlier been relegated to the World Cup squad reserves after failing to recover from his knee injury, now that he has, the move to make him part of the main squad might have to do with Shan Masood’s average returns with the bat at the top since the England T20 series. During the four T20Is in the Tri-Series in New Zealand, Masood returned with scores of 31 (22), 0 (2), 14 (12), and 19 (21), at a strike rate of 112.28. Overall, across his 10 T20I innings for Pakistan so far, the 33-year-old has scored 220 runs at an average of 24.44, at the strike rate of 125.00. With and unlikely to change their batting approach at the top, it might not be feasible for the team management to have another batter playing at a strike rate in the 120-130 range, at any other position in the batting order.","pubDate":"2022-10-14 15:59:08","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"ICC T20 World Cup 2022: Dates, live stream, TV channel and confirmed teams for huge cricket tournament","link":"https://www.thesun.co.uk/sport/20110852/icc-t20-world-cup-dates-live-stream-tv-channel-confirmed-teams-cricket/","keywords":["Cricket","Sport","Explainers","Men's T20 World Cup"],"creator":["Nyle Smith"],"video_url":null,"description":null,"content":"BRACE yourselves cricket lovers as the ICC T20 World Cup has returned – and we’ll be making sure that you catch all the action live. Australia stormed to a victory in this iconic tournament towards the end of last year with a belligerent bating display against New Zealand. APAustralia beat New Zealand in the 2021 World Cup final[/caption] AFPEngland was victorious over New Zealand at Lord’s in 2019[/caption] David Warner and Mitchell Marsh’s half-centuries inspired the Aussies to a win by eight wickets in Dubai. And it meant that Australia had finally clinched their first T20 World Cup while the Kiwis suffered further agony following their dramatic defeat to England in 2019. But New Zealand will be out for revenge in the eighth edition of this showstopper and SunSport have all the knowledge on the World Cup below… When is the ICC T20 World Cup 2022? The eighth edition of the ICC T20 World Cup will be held in Australia, across seven different cities. Read More on cricket NO JONNY NO Bairstow shares gruesome pics of broken leg after freak accident playing golf MALAN BALLER Malan earns series win in Pakistan as England get big boost for T20 World Cup It is scheduled to get underway from Sunday, October 16 until Sunday, November 13. There will be a total of 45 matches with the Super 12 starting on Saturday, October 22. Australia 173-2 beat New Zealand 172-4 by 8 wickets in the final of the 2021 tournament. Where can I watch the ICC T20 World Cup 2022? ALL the action will be broadcasted LIVE on Sky Sports Cricket in the UK. Most read in Cricket NO JONNY NO Bairstow shares gruesome pics of broken leg after freak accident playing golf RIP RAUF Tributes paid as legendary cricket umpire dies after suffering cardiac arrest A SPIN OFF All the England fixtures and results from a packed 2022 schedule SILLY POINT Cricket fielding positions explained - What are the most common positions? BEEFY'S BEEF Moment cricket legend Ian Botham is ambushed by masked shooting protesters LEGEND LOST Shane Warne dies of 'heart attack' aged 52 after being found in Thai villa However, selected matches will be shown live on Sky Sports Main Event. Subscription members of Sky Sports can also head to the Sky Go app on your chosen device to stream the action. Alternatively, viewers can purchase a NOW TV pass to watch the World Cup fixtures. What are the confirmed teams? There will be a total of 16 teams participating in the ICC T20 World Cup 2022. AfghanistanAustraliaBangladeshEnglandIndiaIrelandNamibiaNetherlandsNew ZealandPakistanScotlandSouth AfricaSri LankaUnited Arab EmiratesWest IndiesZimbabwe","pubDate":"2022-10-14 15:38:20","image_url":null,"source_id":"thesun","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Tendulkar, Gavaskar, Manjrekar, Agarkar can’t vote in Mumbai Cricket elections as they don’t have voter ids and e-voting wasn’t allowed","link":"https://indianexpress.com/article/sports/cricket/tendulkar-gavaskar-manjrekar-agarkar-cant-vote-in-mumbai-cricket-elections-8209085/","keywords":["Cricket","Sports"],"creator":["Devendra Pandey"],"video_url":null,"description":null,"content":"SACHIN Tendulkar , Sunil Gavaskar, Ajit Agarkar, Sanjay Manjrekar, Wasim Jaffer, Vinod Kambli, Avishkar Salvi, and Paras Mhambrey won’t be allowed to vote in the Mumbai Cricket Association upcoming election on October 18. The reason? They didn’t submit their voter’s identity card and register before the election. Sandeep Patil, who is contesting for MCA president’s post, had requested to allow e-voting for MCA election but it was turned down. Gavaskar, Manjrekar, and Agarkar are expected to be on the commentary panel for the upcoming T20 World Cup to be held in Australia. While Mhambrey is India’s bowling coach, Salvi and Jaffer are away on coaching assignments. Sandeep Patil will take on Amol Kale, a sitting vice-president of MCA and a candidate backed by Sharad Pawar-Ashish Shelar group. The MCA election will also be contested for posts of honorary secretary, treasurer and Apex Council along with members of the governing council post. The retired Senior Inspector Deepak Patil has been declared unopposed as Jt Secretary, and the MCA won’t be having a contest for MCA’s vice-president post as all candidates decided to withdraw. Subscriber Only Stories View All Premium UPSC Key-October 14, 2022: Why you should read ‘Split Verdict’ or ‘Empath... Premium Did you know papier-mâché could be used on walls and ceilings? Premium Doctor G movie review: Ayushmann Khurrana, Rakul Preet film is just servi... Premium Toxic solvent, dodgy tests, gaps in data: Behind Maiden Pharma ban Buy at just Rs 108 per month now Top Sports News Now Mohammed Shami replaces Jasprit Bumrah in India's T20 World Cup squad T20 World Cup: How extreme pace and hard lengths have made a comeback in cricket's shortest format Rudrankksh Patil wins World Championship, rallying from 4-10 down to beating Sollazzo 17-13 in gold duel Click here for more “As I had filed for my nomination for the BCCI’s treasurer post, I have today withdrawn my name as a candidate for MCA’s president post. Our candidate will be Amol Kale, we had a discussion with Sharad Pawar and Kale’s nomination as president of MCA is already there. So he will be contesting a post from our group,” Shelar told reporters. Pawar, a NCP ( Nationalist Congress Party ) chief and Shelar, Bharatiya Janata Party ( BJP ) Mumbai’s chief, have joined hands to contest MCA election together. The Pawar-Shelar group also have backed former minister in Maha Vikas Aghadi Jitendra Awhad for a position in Apex Council while Maharashtra chief minister Uddhav Thackeray’s personal assistant Milind Narvekar too has been roped in from the same group. Vihang Sarnaik, son of MLA Pratap Sarnaik and a key member of Maharashtra chief minister Eknath Shinde ’s camp, has been declared chairman unopposed for the Mumbai Premier League T20 chairman’s post from the Pawar-Shelar group.","pubDate":"2022-10-14 14:57:31","image_url":null,"source_id":"indianexpress","country":["india"],"category":["sports"],"language":"english"},{"title":"Buttler, Woakes star before rain halts Manuka finale | Australia v England 2022-23 - cricket.com.au","link":"https://news.google.com/__i/rss/rd/articles/CBMiK2h0dHBzOi8vd3d3LnlvdXR1YmUuY29tL3dhdGNoP3Y9Q09UYlp2QnF2VmfSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Buttler, Woakes star before rain halts Manuka finale | Australia v England 2022-23  cricket.com.auAUS vs ENG Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update- England Tour of Australia, 3rd T20I  Cricket AddictorRecent Match Report - England vs Australia 3rd T20I 2022/23  ESPNcricinfoThird T20I at Manuka Oval washed out; England cricket take series 2-0 | Cricbuzz.com - Cricbuzz  CricbuzzRain ends England hopes of series whitewash after Chris Woakes and Jos Buttler star  The Cricketer","content":null,"pubDate":"2022-10-14 14:50:00","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"India may tour Pakistan after 15 years as BCCI puts Asia Cup in Pakistan on Indian team’s roster for 2023","link":"https://www.tribuneindia.com/news/sports/india-may-tour-pakistan-after-15-years-as-bcci-puts-asia-cup-in-pakistan-on-indian-teams-roster-for-2023-441278","keywords":null,"creator":null,"video_url":null,"description":"New Delhi, October 14 The Indian cricket team may tour Pakistan after a gap of 15 years, the BCCI has indicated ahead of its all important Annual General meeting (AGM) on October 18 in Mumbai. The BCCI has shared with all its state unit representatives a lowdown of the work done during the past year along with future plans and schedule of the national team's tours, which includes Asia Cup in Pakistan next year. According to the report, the Indian team will be participating in the ICC Women's T20 World Cup (South Africa), ICC Women's U-19 T20 World Cup (South Africa), Asia Cup (Pakistan) and ICC Cricket World Cup, India. With England, Australia, West Indies and Sri Lanka having already toured Pakistan in the past few years, it will be interesting to see how things pan out as BCCI will need central government's permission to allow the team to travel to Pakistan. \"Obviously, when the time comes, it will be a government decision. But there is one aspect. The government allows India versus Pakistan contests in global and continental events. So there is a chance of India travelling but it will be too early to completely commit that a team will go to Pakistan. But putting it on report is a broad hint,\" a senior BCCI source told PTI on conditions of anonymity. Currently, the Asian Cricket Council is headed by BCCI secretary Jay Shah and his decision will hold a lot of weight going forward. The two neighbours last played a bilateral white-ball contest back in 2012 when the Pakistan travelled to India for three T20Is and three ODIs. India last travelled to Pakistan in 2008 for the 50-over Asia Cup. The political tension between the two nations resulted in halting bilateral cricket ties.","content":"PTI New Delhi, October 14 The Indian cricket team may tour Pakistan after a gap of 15 years, the BCCI has indicated ahead of its all important Annual General meeting (AGM) on October 18 in Mumbai. The BCCI has shared with all its state unit representatives a lowdown of the work done during the past year along with future plans and schedule of the national team’s tours, which includes Asia Cup in Pakistan next year. According to the report, the Indian team will be participating in the ICC Women’s T20 World Cup (South Africa), ICC Women’s U-19 T20 World Cup (South Africa), Asia Cup (Pakistan) and ICC Cricket World Cup, India. With England, Australia, West Indies and Sri Lanka having already toured Pakistan in the past few years, it will be interesting to see how things pan out as BCCI will need central government’s permission to allow the team to travel to Pakistan. “Obviously, when the time comes, it will be a government decision. But there is one aspect. The government allows India versus Pakistan contests in global and continental events. So there is a chance of India travelling but it will be too early to completely commit that a team will go to Pakistan. But putting it on report is a broad hint,” a senior BCCI source told PTI on conditions of anonymity. Currently, the Asian Cricket Council is headed by BCCI secretary Jay Shah and his decision will hold a lot of weight going forward. The two neighbours last played a bilateral white-ball contest back in 2012 when the Pakistan travelled to India for three T20Is and three ODIs. India last travelled to Pakistan in 2008 for the 50-over Asia Cup. The political tension between the two nations resulted in halting bilateral cricket ties. #BCCI #Cricket #jay shah #Mumbai #Pakistan","pubDate":"2022-10-14 14:40:18","image_url":"https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/10/2022_10$largeimg_1159098315.jpeg","source_id":"tribuneindia","country":["india"],"category":["sports"],"language":"english"},{"title":"Cricket: Zaman replaces Qadir in Pakistan&#039;s squad for T20 World Cup","link":"https://www.thestar.com.my/sport/cricket/2022/10/14/cricket-zaman-replaces-qadir-in-pakistan039s-squad-for-t20-world-cup","keywords":null,"creator":null,"video_url":null,"description":"(Reuters) - Pakistan batsman Fakhar Zaman has been promoted to the team's 15-player squad for the Twenty20 World Cup while leg spinner Usman Qadir has been moved to the travelling reserves due to an injury, the country's cricket board (PCB) said on Friday. Read full story","content":null,"pubDate":"2022-10-14 13:34:00","image_url":"https://apicms.thestar.com.my/uploads/images/2022/10/14/1777130.jpg","source_id":"thestar_my","country":["malaysia"],"category":["sports"],"language":"english"},{"title":"Cricket: Zaman replaces Qadir in Pakistan's squad for T20 World Cup","link":"https://www.channelnewsasia.com/sport/cricket-zaman-replaces-qadir-pakistans-squad-t20-world-cup-3008406","keywords":null,"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2022-10-14 13:26:22","image_url":"https://onecms-res.cloudinary.com/image/upload/s--zpeoSLeX--/c_fill,h_900,w_1600/fl_relative,g_south_east,l_one-cms:core:watermark:reuters,w_0.1/f_auto,q_auto/v1/one-cms/core/2022-10-14t132622z_1_lynxmpei9d0pr_rtroptp_3_cricket-asiacup.jpg?itok=XjKufNV3","source_id":"channelnewsasia","country":["singapore"],"category":["sports"],"language":"english"},{"title":"Azeem Rafiq set to leave England after abuse and intimidation - report","link":"https://sportstar.thehindu.com/cricket/azeem-rafiq-to-leave-england-abuse-intimidation-racism-yorkshire-cricket-news/article66010586.ece","keywords":null,"creator":["\n        PTI  \n    "],"video_url":null,"description":"Azeem Rafiq, whose allegations of racism at Yorkshire led to reviews into the culture of cricket in England, is leaving the country to protect his family from abuse and intimidation.","content":"Azeem Rafiq, whose allegations of racism at Yorkshire led to reviews into the culture of cricket in England, is leaving the country to protect his family from abuse and intimidation. In 2020, the 31-year-old opened up about an “institutionally racist culture” at Yorkshire. The cricketer, whose family moved to the U.K. from Pakistan after a business partner of his father was murdered following a bungled kidnapping attempt, is being subjected to abuse and threats, according to The Cricketer . “Rafiq has received a series of threats both online and in person in recent times and in one case, captured by CCTV earlier this month, an individual was seen defecating in the garden of the home where his parents live. In another, a masked intruder was seen prowling around the outside of the property,” the report said. ALSO READ - Azeem Rafiq, Danni Wyatt among five cricketers reprimanded by ECB for racist social media posts Rafiq’s father suffers from a medical condition and needs an oxygen cylinder all the time. Rafiq and four others were recently reprimanded by the England Cricket Discipline Commission for use of “anti-Semitic language” on social media in 2011. Accepting the reprimand, Rafiq apologised to the Jewish community and said he was embarrassed. Rafiq was the whistleblower in the Yorkshire racism scandal - he first spoke about it in September 2020. He then gave his testimony to a group of MPs and said he was “close to taking his own life” for the “toxic” dressing room atmosphere when Gary Ballance was appointed skipper during his second spell at the club. Read more stories on Cricket.","pubDate":"2022-10-14 13:14:09","image_url":null,"source_id":"sportstar","country":["india"],"category":["sports"],"language":"english"},{"title":"'New team' in Rohit Sharma's cryptic tweet revealed, India and MI skipper says 'pumped to join....'","link":"https://www.dnaindia.com/cricket/report-new-team-in-rohit-sharma-s-cryptic-tweet-revealed-india-and-mi-skipper-says-pumped-to-join-ox-fancraze-csk-ipl-2992791","keywords":["Sports","Cricket"],"creator":["DNA Web Team"],"video_url":null,"description":"Rohit Sharma, along with several cricket stars and IPL franchises, sent fans into wonderland on Thursday with tweets about a \"new team\" in town.","content":null,"pubDate":"2022-10-14 13:14:00","image_url":null,"source_id":"dnaindia","country":["india"],"category":["sports"],"language":"english"},{"title":"Women Asia Cup 2022 Schedule, Points Table, Cricket, Live Telecast, Host Country List, India Women Team, Groups, India Women Squad, Teams, Live Score, Live Streaming Details - Cricket Addictor","link":"https://news.google.com/__i/rss/rd/articles/CBMizQFodHRwczovL2NyaWNrZXRhZGRpY3Rvci5jb20vY3JpY2tldC1uZXdzL3dvbWVuLWFzaWEtY3VwLTIwMjItc2NoZWR1bGUtcG9pbnRzLXRhYmxlLWNyaWNrZXQtbGl2ZS10ZWxlY2FzdC1ob3N0LWNvdW50cnktbGlzdC1pbmRpYS13b21lbi10ZWFtLWdyb3Vwcy1pbmRpYS13b21lbi1zcXVhZC10ZWFtcy1saXZlLXNjb3JlLWxpdmUtc3RyZWFtaW5nLWRldGFpbHMv0gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Women Asia Cup 2022 Schedule, Points Table, Cricket, Live Telecast, Host Country List, India Women Team, Groups, India Women Squad, Teams, Live Score, Live Streaming Details  Cricket AddictorWatch: Sri Lanka Players' Amazing Dance Post Beating Pakistan In Women's Asia Cup  NDTV SportsLive Cricket Score | Pakistan Women vs Sri Lanka Women Live Score & Commentary | PK-W vs SL-W Scorecard, Women's Asia Cup 2022  SportskeedaIND vs SL, Women's Asia Cup 2022 Final: Head to Head, Playing XI, Preview, Where to Watch on TV, Online, and Live Streaming Details  CricTracker'Tried a Lot of Combinations as World Cup is Around The Corner': India Captain Harmanpreet Kaur on Asia Cup  News18View Full coverage on Google News","content":null,"pubDate":"2022-10-14 12:57:53","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"AUS vs ENG Man of the Series in T20Is: Who won Man of the Series in today cricket match?","link":"https://thesportsrush.com/cricket-news-aus-vs-eng-man-of-the-series-in-t20is-who-won-man-of-the-series-in-today-cricket-match/","keywords":["Cricket","Australia","England","England tour of Australia 2022","Jos Buttler"],"creator":["Dixit Bhargav"],"video_url":null,"description":"AUS vs ENG Man of the Series in T20Is: The English captain has won his second series away in the shortest format. An abandoned third T20I between Australia and England in Canberra has denied the latter an opportunity to register their first-ever T20I series whitewash against the former. A match affected by multiple rain breaks… The post AUS vs ENG Man of the Series in T20Is: Who won Man of the Series in today cricket match? appeared first on The SportsRush.","content":"AUS vs ENG Man of the Series in T20Is: The English captain has won his second series away in the shortest format. An abandoned third T20I between Australia and England in Canberra has denied the latter an opportunity to register their first-ever T20I series whitewash against the former. A match affected by multiple rain breaks eventually witnessed no result despite being reduced to a 12-over contest. England, however, had the upper hand on the match after reducing Australia to 30/3 in 3.5 overs in a 130-run chase. Been asked to bat first for the third consecutive time on the tour, England captain Jos Buttler led from the front to score 65* (41) with the help of seven fours and a six amid rain interruptions. Buttler, who scored a 17th T20I half-century, 13th as an opening batter, ninth away from home, fifth against Australia, third as captain, second in Australia and in 2022, played a vital role in powering his team to 112/2 in 12 overs. Returning to the Playing XI tonight, England pacer Chris Woakes was exceptional with the new ball dismissing the Australian top-order in his first two overs. AUS vs ENG Man of the Series in T20Is While no Player of the Match was declared in an abandoned match, Buttler bagged the Player of the Series award for scoring 150 runs at an average and strike rate of 75 and 174.41 respectively. Highest run-scorer in a three-match series, Buttler has won his second T20I series award. Interestingly, both his series awards in the shortest format have come against Australia. “We’ve enjoyed it, making some good strides in Pakistan and came here and continued that form,” Buttler told Fox Cricket during the post-match presentation ceremony. © @englandcricket skipper @josbuttler with the Player of the Series and the Series winners trophies! Positive results and great preparation as a team ahead of the @T20WorldCup!#AUSvENG pic.twitter.com/ZG0GhiQrf9 — PCA (@PCA) October 14, 2022 “[Restarting after second rain break] Only two-and-a-bit overs left, just go as hard as we could. Unique sort of game, shame we couldn’t get a full game in.” The post AUS vs ENG Man of the Series in T20Is: Who won Man of the Series in today cricket match? appeared first on The SportsRush.","pubDate":"2022-10-14 12:52:10","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"“That’s so village”: Ben Stokes reacts to his hilarious boundary misjudgement during Australia vs England 3rd T20I","link":"https://thesportsrush.com/cricket-news-thats-so-village-ben-stokes-reacts-to-his-hilarious-boundary-misjudgement-during-australia-vs-england-3rd-t20i/","keywords":["Cricket","Ben Stokes","England tour of Australia 2022"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"Ben Stokes was involved in a hilarious incident during the 3rd T20I between Australia and England at the Manuka Oval in Canberra. Ahead of the T20 World Cup, England got some brilliant results under their belt. After beating Pakistan in their home conditions, the English team defeated the current T20 champions Australia as well by… The post “That’s so village”: Ben Stokes reacts to his hilarious boundary misjudgement during Australia vs England 3rd T20I appeared first on The SportsRush.","content":"Ben Stokes was involved in a hilarious incident during the 3rd T20I between Australia and England at the Manuka Oval in Canberra. Ahead of the T20 World Cup, England got some brilliant results under their belt. After beating Pakistan in their home conditions, the English team defeated the current T20 champions Australia as well by 2-0. The third T20I got abandoned due to rain. Australia opted to bowl first in Canberra, and the English inning was interrupted multiple times by rain. It was a 12-over contest, where England managed to score 112-2. Jos Buttler was at his very best, and he smashed 65 runs in just 41 balls with the help of 7 boundaries and 1 six. In reply, Australia got the worst start possible when English pacer Chris Woakes took the wickets of Aaron Finch and Mitch Marsh on the initial two balls of the innings. Later on, Woakes took the wicket of Glenn Maxwell as well. The rain then interrupted the game again, and it was called off. Ben Stokes reacts to his hilarious boundary misjudgement Ben Stokes was involved in a hilarious misjudgment on the last ball of the English innings. Glenn Maxwell was bowling the 12th over of the innings, and Stokes was at the crease. Maxwell bowled a length ball, and Stokes smoked the ball straight towards the boundary, and he started to walk off the pitch. ALSO READ: Moeen Ali optimistic about Ben Stokes’ form in T20 World Cup Stokes thought that it was an easy boundary, but the ball slowed down after bouncing on the ground, and it was easily stopped at the long-off boundary. Stokes then turned back to complete the single where he slipped and was sent back in trying for the 2nd run by Buttler. So, England could just get a single on the last ball. Stokes reacted on the same on Twitter. @ThatsSoVillage https://t.co/EUXD6YGmFg — Ben Stokes (@benstokes38) October 14, 2022 This was Stokes’ first T20I series after March 2020, where he faced India. Due to mental health and injury concerns, Stokes misses quite a few months of competitive cricket. He made his return in Ashes last year and was made the English test captain ahead of the home summer. Stokes will play a big part in England’s T20 World Cup campaign. The post “That’s so village”: Ben Stokes reacts to his hilarious boundary misjudgement during Australia vs England 3rd T20I appeared first on The SportsRush.","pubDate":"2022-10-14 12:41:40","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"England in Australia: Third Twenty20 abandoned because of rain in Canberra - BBC","link":"https://news.google.com/__i/rss/rd/articles/CBMiLGh0dHBzOi8vd3d3LmJiYy5jby51ay9zcG9ydC9jcmlja2V0LzYzMjU0MzY50gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"England in Australia: Third Twenty20 abandoned because of rain in Canberra  BBCAustralia v England: third men’s T20 cricket international abandoned – as it happened  The GuardianJos Buttler and Chris Woakes fire for England before third T20 vs Australia washed out  Sky SportsAustralia vs England: Live score and latest updates from third T20  The TelegraphEngland and Australia washed out but Jos Buttler finds his groove  The GuardianView Full coverage on Google News","content":null,"pubDate":"2022-10-14 12:41:39","image_url":null,"source_id":"google","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Mohammed Shami picked as Bumrah’s replacement in India’s T20I World Cup squad","link":"https://www.tribuneindia.com/news/sports/mohammed-shami-picked-as-bumrahs-replacement-in-indias-t20i-world-cup-squad-441263","keywords":null,"creator":null,"video_url":null,"description":"New Delhi, October 14The BCCI on Friday named seasoned pacer Mohammed Shami as injured Jasprit Bumrah's replacement in the Indian team for the upcoming T20 World Cup in Australia.\"The All-India Senior Selection Committee has named Mohammed Shami as Jasprit Bumrah's replacement in India's ICC Men's T20 World Cup squad. Shami has reached Australia and will link up with the squad in Brisbane ahead of the warm-up matches,' BCCI secretary Jay Shah was quoted in a press release.That Shami would replace Bumrah in the main squad was reported by PTI last month.Mohammed Siraj and Shardul Thakur have been named as backups and will travel to Australia shortly. The tournament will be held from October 16 to November 13.Bumrah has been ruled out of competitive cricket for an indefinite period due to stress related injury on his back.Shami had last played in T20 Internationals during the last edition of the ICC T20 World Cup in the UAE.He was supposed to play in the six T20Is at home against Australia and South Africa but tested positive for CIVID-19 and had to remain in isolation. On return he had to prove his fitness before NCA approved his trip to Australia.Shami has played 17 T20Is and has taken 18 wickets.","content":"PTI New Delhi, October 14 The BCCI on Friday named seasoned pacer Mohammed Shami as injured Jasprit Bumrah’s replacement in the Indian team for the upcoming T20 World Cup in Australia. “The All-India Senior Selection Committee has named Mohammed Shami as Jasprit Bumrah’s replacement in India’s ICC Men’s T20 World Cup squad. Shami has reached Australia and will link up with the squad in Brisbane ahead of the warm-up matches,’ BCCI secretary Jay Shah was quoted in a press release. That Shami would replace Bumrah in the main squad was reported by PTI last month. Mohammed Siraj and Shardul Thakur have been named as backups and will travel to Australia shortly. The tournament will be held from October 16 to November 13. Bumrah has been ruled out of competitive cricket for an indefinite period due to stress related injury on his back. Shami had last played in T20 Internationals during the last edition of the ICC T20 World Cup in the UAE. He was supposed to play in the six T20Is at home against Australia and South Africa but tested positive for CIVID-19 and had to remain in isolation. On return he had to prove his fitness before NCA approved his trip to Australia. Shami has played 17 T20Is and has taken 18 wickets. #Australia #BCCI #Cricket #Jasprit Bumrah","pubDate":"2022-10-14 12:40:28","image_url":"https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/10/2022_10$largeimg_2034480156.jpeg","source_id":"tribuneindia","country":["india"],"category":["sports"],"language":"english"},{"title":"World Cup 2023: BCCI could lose Rs 955 crore if ICC doesn't get tax exemption","link":"https://www.indiatvnews.com/sports/cricket/bcci-could-lose-rs-955-crore-if-icc-doesn-t-get-tax-exemption-world-cup-2023-2022-10-14-816223","keywords":null,"creator":null,"video_url":null,"description":"The Board of Control for Cricket in India (BCCI) could lose around Rs 955 crore if the central government sticks to its decision to levy a tax surcharge of 21.84 per cent tax on ICC's broadcast revenue from the upcoming 2023 ODI World Cup, according to a Board report.","content":"The Board of Control for Cricket in India (BCCI) could lose around Rs 955 crore if the central government sticks to its decision to levy a tax surcharge of 21.84 per cent tax on ICC's broadcast revenue from the upcoming 2023 ODI World Cup, according to a Board report. A tax surcharge is \"an additional charge, fee, or tax that is added to the cost of a good or service beyond the initially quoted price\". A surcharge is often added to an existing tax and is not included in the stated price of the good or service. India will host next year's 50-over World Cup in October-November. As per ICC norms, the host nation is required to get tax exemption from the government for hosting tournaments organised by the global body. However, India's tax rules don't allow such exemptions, the BCCI has already lost close to Rs 193 crore as the government didn't exempt tax surcharge for hosting the 2016 ICC T20 World Cup. The BCCI is still fighting that case in the ICC tribunal. \"The next ICC major men's event, which is the ICC Cricket World Cup 2023, is scheduled to be held in India in the month of October & November in 2023. The BCCI was obligated to deliver a tax exemption or a tax solution to the ICC for this event, latest by April 2022,\" stated the report circulated among state units ahead of the Board's October 18 AGM in Mumbai. \"This timeline was further extended by the ICC Board till 31st May 2022. At the start of this financial year, the BCCI had advised the ICC that in line with the tax order for the 2016 event, it was expected that a 10% (excluding surcharges) tax order could be obtained as an interim measure for the 2023 event within the required time frame. \"The ICC has now received a 20% (excluding surcharges) tax order for its broadcast revenue for the 2023 event from the tax authorities in India.\" According to the BCCI document shared with the state bodies, the adverse impact on the Board's revenue from the ICC, if a 21.84 percent tax is paid, would be USD 116.47 million. It is understood that the BCCI is still trying to negotiate and bring down the tax surcharge percentage to 10.92 percent from the existing demand of 21.84. If the BCCI can reduce the tax surcharge to 10.92 per cent, then the revenue loss would be around Rs 430 crore. \"The BCCI is currently working with the Ministry of Finance, Government of India and have represented against this 20% (excluding surcharges) tax order at the very highest level and are hopeful that a 10% (excluding surcharges) tax order would be forthcoming shortly. \"It is to be noted that any tax cost incurred by the ICC for the 2023 event in India will be adjusted with the BCCI's share of revenue from the ICC,\" the report further stated. The BCCI's share from the ICC's central revenue pool for the tenure of 2016 to 2023 is USD 405 million. The ICC is expecting USD 533.29 million (Rs 4400 crores approx) from the broadcasting revenue of the 2023 event in India. (Inputs by PTI)","pubDate":"2022-10-14 12:23:16","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"“We will take a couple of days off”: Aaron Finch announces 2-day break for Australian team to rejuvenate after losing England T20Is","link":"https://thesportsrush.com/cricket-news-we-will-take-a-couple-of-days-off-aaron-finch-announces-2-day-break-for-australian-team-to-rejuvenate-after-losing-england-t20is/","keywords":["Cricket","Aaron Finch","Australia","England","England tour of Australia 2022"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Aaron Finch: The Australian captain laid emphasis on enjoying each other’s company before kick-starting T20 World Cup preparations. Australia captain Aaron Finch has expressed frustration at not being able to play a full match due to inclement weather conditions in Canberra tonight. Although Australia faced a tough task of needing to score 100 runs in… The post “We will take a couple of days off”: Aaron Finch announces 2-day break for Australian team to rejuvenate after losing England T20Is appeared first on The SportsRush.","content":"Australia captain Aaron Finch has expressed frustration at not being able to play a full match due to inclement weather conditions in Canberra tonight. Although Australia faced a tough task of needing to score 100 runs in 49 deliveries with seven wickets in hand to win the third T20I at the time of the last rain break, players would’ve liked to challenge themselves than sit in the dressing room and witness an already curtailed match getting abandoned. Finch, however, didn’t shy away from crediting England for gaining a significant advantage not just in the last match but throughout the three-match T20I series. “Credit to England. They outplayed us in all the three games but I thought the fielding was better on a slightly greasy surface tonight,” Finch told during the post-match presentation ceremony. While Australia didn’t spill whatever limited catching opportunities came their way on Friday, all-rounder Glenn Maxwell, in particular, put on display an to save a few runs on the boundary in the penultimate over of the innings. Defending champions in this format, Australia wouldn’t have wanted to lose 0-2 to arch-rivals England days before the start of ICC T20 World Cup 2022. Probably in an attempt to rejuvenate by putting behind this series loss, Finch announced a two-day break for the Australian cricket team before finally starting their World Cup campaign. “We will take a couple of days off, recharge, enjoy each other’s company and start our preparations for the World Cup,” Finch added. Australia will now be traveling to Brisbane where they will lock horns against India in a warm-up match on Monday before facing New Zealand in their first World Cup match at the Sydney Cricket Ground on October 22.","pubDate":"2022-10-14 12:10:15","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Liam Livingstone: ‘I’m being thrown in the deep end. I feel ready to swim’","link":"https://www.theguardian.com/sport/2022/oct/14/liam-livingstone-im-being-thrown-in-the-deep-end-i-feel-ready-to-swim","keywords":["England cricket team","Cricket","Sport"],"creator":["Donald McRae"],"video_url":null,"description":"The England all-rounder on his excitement at his Test call-up, fun with franchises and his T20 World Cup hopes“You can guess how excited I am,” Liam Livingstone says as he remembers how we had spoken for more than an hour just over two weeks ago about his desire to play Test cricket. Now, the day after he heard that his boyhood dream had come a huge step closer with the news that he will be part of England’s 15-man Test squad to tour Pakistan in December, Livingstone is in an exuberant mood. He had been just as open and friendly at Old Trafford late last month but, then, his hopes of playing Test cricket were fuelled by yearning rather than concrete hope.It is different now. The T20 World Cup begins on Sunday and Livingstone, who is close to a full recovery from the ankle injury which affected his preparations, could be an important player for England in Australia. After his success in the IPL this year, when Livingstone smashed 34 sixes and was second only to Jos Buttler in clearing the ropes, his reputation as one of the most destructive batsmen in the world was cemented. This followed years of big hitting in various forms of white-ball franchise cricket which turned Livingstone into a millionaire. Continue reading...","content":null,"pubDate":"2022-10-14 12:02:56","image_url":"https://i.guim.co.uk/img/media/5d8e90d253459fb7c9c2670b6d428944d55ae29b/0_549_8192_4915/master/8192.jpg?width=460&quality=85&auto=format&fit=max&s=d94ff5dff86f34224b35905d2f613a59","source_id":"theguardian","country":["united kingdom","india","singapore","canada"],"category":["sports"],"language":"english"},{"title":"“It did not come from Baz”: Jonny Bairstow clueless on origin of Bazball in England Test team","link":"https://thesportsrush.com/cricket-news-it-did-not-come-from-baz-jonny-bairstow-clueless-on-origin-of-bazball-in-england-test-team/","keywords":["Cricket","Brendon McCullum","Jonny Bairstow"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"Jonny Bairstow has said that he has no idea where the term ‘Baz Ball’ came from, and it is just a name given by media. After the Ashes defeat last year, the English team was in shambles, and things worsened after the West Indies series. England went in their home test summer with a new… The post “It did not come from Baz”: Jonny Bairstow clueless on origin of Bazball in England Test team appeared first on The SportsRush.","content":"Jonny Bairstow has said that he has no idea where the term ‘Baz Ball’ came from, and it is just a name given by media. After the Ashes defeat last year, the English team was in shambles, and things worsened after the West Indies series. England went in their home test summer with a new captain and coach. Ben Stokes was named the captain of the side, whereas Brendon McCullum came in as red-ball coach. The duo of Ben Stokes and Brendon McCullum changed the way in which the side played test cricket. The New Zealand test series was their first assignment, and the English side whitewashed the World Test Championship winners. They chased 299 runs in Nottingham, which was the highest chase by any team at the ground. ALSO READ: Jos Buttler hails England on a brilliant victory in Nottingham England then defeated India to level the series 2-2, and the home season ended on a perfect note when they won the 3-match series against South Africa. Jonny Bairstow emerged as one of the most important batters of the side under the leadership of Stokes and McCullum. Jonny Bairstow clueless on origin of Bazball English opener Jonny Bairstow, who is currently injured is working as a pundit for BT Sports in Australia vs England T20I series. Between the breaks, he was asked about the term Baz Ball. The way the English team has played this season in red-ball under Brendon McCullum has been terrific, and it has been termed as Baz Ball. Bairstow said that he has no idea where the term Baz Ball came from. He said that it did not come from Brendon McCullum, and only the media and journalists started talking about the same. Bairstow insists that they are playing in the way in which Ben Stokes and McCullum want them to play. “We’ve no idea where Baz Ball came from. It didn’t come from Brendon McCullum, that’s for sure. It came from the media and the journalists,” Jonny Bairstow said on BT Sports. “What is Baz Ball? It’s nothing for a start. It’s a way in which the group of guys have come together, the way in which Ben & Brendon have said how we want to go by.” “We’ve no idea where ‘Baz-Ball’ came from?! It didn’t come from @Bazmccullum that is for sure” “What is Baz-Ball? It’s not anything for a start!” Brilliant listening to @jbairstow21 on the change in England’s approach to Test cricket in 2022… pic.twitter.com/osKO3kHcXE — Cricket on BT Sport (@btsportcricket) October 14, 2022 The English side has played an aggressive brand of cricket in the red-ball, and Bairstow said that he wants to change the way in which people see test cricket. Bairstow reminded that they need to inspire the kids to play test cricket when there is a plethora of franchise cricket going around. “We want to change the way people viewed test cricket and inspire kids to play test cricket,” Jonny Bairstow added. “When there is a layer of franchise cricket going around the world. How would we inspire the next generation of cricketers to play test cricket.” The post “It did not come from Baz”: Jonny Bairstow clueless on origin of Bazball in England Test team appeared first on The SportsRush.","pubDate":"2022-10-14 11:39:43","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"}]}