{"newsArray":[{"title":"Bengaluru pitch for India-Lanka 2nd Test rated as below average","link":"https://www.thehansindia.com/sports/cricket/bengaluru-pitch-for-india-lanka-2nd-test-rated-as-below-average-734286","keywords":["Sports,Today NewsPaper,Cricket"],"creator":["The Hans India"],"video_url":null,"description":"Match referee Javagal Srinath has rated the pitch at the M Chinnaswamy Stadium in Bengaluru that was used for the second Test between India and Sri Lanka as \"below average\".","content":"Dubai: Match referee Javagal Srinath has rated the pitch at the M Chinnaswamy Stadium in Bengaluru that was used for the second Test between India and Sri Lanka as \"below average\".The venue has thus received one demerit point under the ICC Pitch and Outfield Monitoring Process. The final Test between India and Sri Lanka saw 16 wickets falling on the opening day and the islanders getting thrashed inside three days in Bengaluru. \"The pitch offered a lot of turn on the first day itself and though it improved with every session, in my view, it was not an even contest between bat and ball,\" Srinath said in a statement. Srinath's report has been forwarded to the Board of Control for Cricket in India. In the revised ICC Pitch and Outfield Monitoring Process, which was introduced on January 4, 2018, if a pitch or outfield is rated as being substandard, that venue will be allocated a number of demerit points.","pubDate":"2022-03-20 21:01:22","full_description":"Dubai: Match referee Javagal Srinath has rated the pitch at the M Chinnaswamy Stadium in Bengaluru that was used for the second Test between India and Sri Lanka as \"below average\". The venue has thus received one demerit point under the ICC Pitch and Outfield Monitoring Process. The final Test between India and Sri Lanka saw 16 wickets falling on the opening day and the islanders getting thrashed inside three days in Bengaluru. \"The pitch offered a lot of turn on the first day itself and though it improved with every session, in my view, it was not an even contest between bat and ball,\" Srinath said in a statement. Srinath's report has been forwarded to the Board of Control for Cricket in India. In the revised ICC Pitch and Outfield Monitoring Process, which was introduced on January 4, 2018, if a pitch or outfield is rated as being substandard, that venue will be allocated a number of demerit points.","image_url":"https://assets.thehansindia.com/h-upload/2022/03/20/500x300_1282711-bengaluru.jpg","source_id":"thehansindia","country":["india"],"category":["sports"],"language":"english"},{"title":"Live West Indies vs England: second Test, day five: live score and latest updates - The Telegraph","link":"https://news.google.com/__i/rss/rd/articles/CBMibWh0dHBzOi8vd3d3LnRlbGVncmFwaC5jby51ay9jcmlja2V0LzIwMjIvMDMvMjAvd2VzdC1pbmRpZXMtdnMtZW5nbGFuZC1zZWNvbmQtdGVzdC1kYXktZml2ZS1saXZlLXNjb3JlLWxhdGVzdC_SAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Live West Indies vs England: second Test, day five: live score and latest updates  The TelegraphWest Indies v England: second Test, day five – live!  The GuardianLIVE: West Indies v England Cricket | 2nd Test Day 5 talkSPORT Stream  talkSPORTEngland need seven wickets for victory in second Test as West Indies dig in  The IndependentWest Indies’ Kraigg Brathwaite sets England tough task to win second Test  The GuardianView Full coverage on Google News","content":null,"pubDate":"2022-03-20 21:01:00","image_url":null,"source_id":"google","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Sarojini Academy felicitates chess wizard Praneeth","link":"https://www.thehansindia.com/sports/sarojini-academy-felicitates-chess-wizard-praneeth-734280","keywords":["Sports,Today NewsPaper"],"creator":["The Hans India"],"video_url":null,"description":"15-year-old pursues his passion despite his grim battle with Dystrophy","content":"Hyderabad: Sarojini Cricket and fitness Academy felicitated chess wizard K S S R A Praneeth, who fights against all odds to pursue his chess passion in spite of having Muscular Dystrophy.Dr. Ashok IAS (Retd) and G R Kiran (Secretary Sarojini Academy) and former National Volleyball player felicitated Praneeth and his brother Shourie and their parents Srinivas Rao and Pavani. It was inspiring and motivating for the students, their parents and the coaches of the Academy. For mobility even at home, Praneeth has to be on an automated wheelchair. But, he shows indefatigable spirit to make the right moves on the 64 squares despite a grim battle for survival. The 15-year-old's passion for chess transgresses all possible barriers, including mental and physical. Praneeth, former junior national chess champion for disabled, was given a special prize for his skills in the Brilliant Trophy Open (3rd place in under – 15 ) online chess tournament. \"He just cannot stay away from the game, he loves to keep playing,\" says his father K. Srinivas Rao, who works in an audit firm in the city. \"Unfortunately, both sons suffer from a genetic disorder i.e. DMD (Duchenne Muscular Dystrophy), that weakens the muscles that help the body move, an issue which prevents the body from making the proteins needed for healthy muscles,\" he said. \"Despite this major handicap, Praneeth was actually preparing for the IPCA selections scheduled for April or May, but he is now forced to abandon that plan to get treated in Kolkata,\" say Srinivas Rao and his wife Pavani. For his part, Praneeth says that chess is what keeps him going and he will continue to try his best to keep making the right moves. \"Yes, it is a huge challenge given my condition. But, that is not a deterrent,\" says the spirited chess player. Ironically, both Praneeth and his brother Shourie suffer from the same health issue which makes life all the more difficult for the parents who are forced to strike the right balance between taking care of the health of their children and at the same time let them continue with their respective passion. Their second son, though not a chess player, participates in various sports events. Recently, he participated in the BOCCIA National Championship 2020. The fact that they are forced to skip the idea of even pursuing education is a severe blow which is not easy to digest. \"We are making all out efforts to get Praneeth and Shourie treated. It is the biggest challenge for us,\" the parents said.","pubDate":"2022-03-20 20:31:22","full_description":"Hyderabad: Sarojini Cricket and fitness Academy felicitated chess wizard K S S R A Praneeth, who fights against all odds to pursue his chess passion in spite of having Muscular Dystrophy. Dr. Ashok IAS (Retd) and G R Kiran (Secretary Sarojini Academy) and former National Volleyball player felicitated Praneeth and his brother Shourie and their parents Srinivas Rao and Pavani. It was inspiring and motivating for the students, their parents and the coaches of the Academy. For mobility even at home, Praneeth has to be on an automated wheelchair. But, he shows indefatigable spirit to make the right moves on the 64 squares despite a grim battle for survival. The 15-year-old's passion for chess transgresses all possible barriers, including mental and physical. Praneeth, former junior national chess champion for disabled, was given a special prize for his skills in the Brilliant Trophy Open (3rd place in under – 15 ) online chess tournament. \"He just cannot stay away from the game, he loves to keep playing,\" says his father K. Srinivas Rao, who works in an audit firm in the city. \"Unfortunately, both sons suffer from a genetic disorder i.e. DMD (Duchenne Muscular Dystrophy), that weakens the muscles that help the body move, an issue which prevents the body from making the proteins needed for healthy muscles,\" he said. \"Despite this major handicap, Praneeth was actually preparing for the IPCA selections scheduled for April or May, but he is now forced to abandon that plan to get treated in Kolkata,\" say Srinivas Rao and his wife Pavani. For his part, Praneeth says that chess is what keeps him going and he will continue to try his best to keep making the right moves. \"Yes, it is a huge challenge given my condition. But, that is not a deterrent,\" says the spirited chess player. Ironically, both Praneeth and his brother Shourie suffer from the same health issue which makes life all the more difficult for the parents who are forced to strike the right balance between taking care of the health of their children and at the same time let them continue with their respective passion. Their second son, though not a chess player, participates in various sports events. Recently, he participated in the BOCCIA National Championship 2020. The fact that they are forced to skip the idea of even pursuing education is a severe blow which is not easy to digest. \"We are making all out efforts to get Praneeth and Shourie treated. It is the biggest challenge for us,\" the parents said.","image_url":"https://assets.thehansindia.com/h-upload/2022/03/20/500x300_1282705-chess.jpg","source_id":"thehansindia","country":["india"],"category":["sports"],"language":"english"},{"title":"UAE vs Nepal, Match 5, ICC Cricket World Cup League Two: Probable XIs, Match Prediction, Pitch Report, Weather Forecast and Live Streaming Details","link":"https://www.sportskeeda.com/cricket/uae-vs-nepal-match-5-icc-cricket-world-cup-league-two-probable-xis-match-prediction-pitch-report-weather-forecast-live-streaming-details?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Cricket"],"creator":["Sports4All Cricket"],"video_url":null,"description":null,"content":null,"pubDate":"2022-03-20 19:19:30","full_description":"The United Arab Emirates and Nepal will lock horns in the fifth match of the ongoing cricket World Cup League Two 2019-2023 at the Dubai International Cricket Stadium in Dubai on March 21, Monday. The 2019–2023 ICC Cricket World Cup League 2 is the inaugural edition of the tournament to identify the qualification teams. The top three teams make it to the 2023 World Cup qualifiers and the bottom four sides make it to the 2023 World Cup Qualifier playoffs. The UAE is currently in the top three of the tournament with nine wins and six defeats after playing 17 encounters. They bagged 20 points and are in the race to qualify for the ICC 2023 World Cup Qualifier. Nepal, on the other hand, are in sixth position with five wins and five defeats, bagging just 10 points. They are currently in the race to qualify for the inaugural edition of the ICC 2023 World Cup Qualifier Playoff. Match: UAE vs Nepal, Match 5. Date: 21 March 2022. Time: 11:00 AM IST. Venue: Dubai International Cricket Stadium, Dubai. The Dubai wicket is expected to assist bowlers more than batters. Any score above 250 would be tough for chasing teams to win the encounter. Spinners would love to bowl in these conditions. Batting first teams would have more chances of victory. The weather in Dubai is hot and humid, with both teams finding it tough to play in these conditions. Temperatures will hover around 30 to 32 degrees Celsius. UAE Muhammad Waseem, Chirag Suri, Vriitya Aravind (wk), Chundangapoyil Rizwan, Alishan Sharafu, Rohan Mustafa, Basil Hameed, Kashif Daud, Ahmed Raza (c), Zahoor Khan, Junaid Siddique Nepal Kushal Bhurtel, Aasif Sheikh (wk), Gyanendra Malla, Dipendra Singh Airee, Rohit Paudel, Aarif Sheikh, Kamal Singh Airee, Karan KC, Sompal Kami, Sandeep Lamichhane (c), Sagar Dhakal The United Arab Emirates side will have a proper track of home conditions and have a good record in the ongoing cricket World Cup League Two 2019-2023. Nepal, on the other hand, is having poor competition. We can expect the UAE to come out on top in this encounter and bag a better position in the table. Prediction: UAE to win this encounter TV: N/A Live Streaming: Fan Code","image_url":"https://static.sportskeeda.com/editor/2022/03/0d5cf-16477987877469-1920.jpg","source_id":"sportskeeda","country":["india"],"category":["sports"],"language":"english"},{"title":"“No wonder England are struggling in India”: When Bharat Army gave it back to Michael Vaughan over his jibe at Indian pitches","link":"https://thesportsrush.com/cricket-news-no-wonder-england-are-struggling-in-india-when-bharat-army-gave-it-back-to-michael-vaughan-over-his-jibe-at-indian-pitches/","keywords":["Cricket","Bharat Army","Michael vaughan"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Bharat Army gave it back to Michael Vaughan over latter’s comments on the quality of Indian pitches during England’s tour if India in 2021. During England’s tour of India last year, the third Test match at the Narendra Modi Stadium in Ahmedabad was witness to a humiliating loss suffered by the visitors. The Day/Night Test,… The post “No wonder England are struggling in India”: When Bharat Army gave it back to Michael Vaughan over his jibe at Indian pitches appeared first on The SportsRush.","content":"Bharat Army gave it back to Michael Vaughan over latter’s comments on the quality of Indian pitches during England’s tour if India in 2021. During England’s tour of India last year, the third Test match at the Narendra Modi Stadium in Ahmedabad was witness to a humiliating loss suffered by the visitors. The Day/Night Test, which lasted mere 140 Overs across four innings and a touch over two days, ended with England losing the match by 10 wickets. The pitch, which was a rank-turner, helped the Indian spinning duo of Ravichandran Ashwin and Axar Patel to pick 18 off the 20 English wickets. Post the loss, the English fans, experts, and certain sections of their media expressed their displeasure on the nature of the Ahmedabad pitch, which as per them was nothing but a poor advertisement for Test Cricket. Michael Vaughan posts a funny picture on social media Former England skipper and top-order batter Michael Vaughan took to his social media handle after England’s aforementioned loss, to post a picture of him with a bat in his hand, but standing on what looked like a ploughed field, to take a direct jibe at the nature of the pitch at Ahmedabad. The caption for the picture read – “Preparations going well for the 4th Test !!”. It is worth of a mention that the fourth and final Test match was also supposed to take place at the same venue.   View this post on Instagram   A post shared by Michael vaughan (@michaelvaughan) Bharat Army gave it back to Michael Vaughan The Bharat Army, Team India’s official support/fan group, gave it back in some style to Vaughan by stating that he should check his guard yet again, as he was seen exposing his off-stump too much. Not sure about that @MichaelVaughan Looks like you’re exposing that off stump a little too much. Maybe check your guard again? No wonder England are struggling in India! Move #OnOn #BharatArmy #BABants #COTI https://t.co/GJhBRjkyRh pic.twitter.com/YMCo60VXaP — The Bharat Army (@thebharatarmy) March 2, 2021 Vaughan then, came up with a rather graceful, yet witty reply by stating that he was covering for the straight one. The 47-year-old was perhaps referring to the way some English batters got out to the spinners, while playing for the turn. Covering for the straight one !!! https://t.co/HqJkNHJGVv — Michael Vaughan (@MichaelVaughan) March 2, 2021 For more Cricket-related news, click here. The post “No wonder England are struggling in India”: When Bharat Army gave it back to Michael Vaughan over his jibe at Indian pitches appeared first on The SportsRush.","pubDate":"2022-03-20 19:16:52","full_description":"Bharat Army gave it back to Michael Vaughan over latter’s comments on the quality of Indian pitches during England’s tour if India in 2021. During England’s tour of India last year, the third Test match at the Narendra Modi Stadium in Ahmedabad was witness to a humiliating loss suffered by the visitors. The Day/Night Test, which lasted mere 140 Overs across four innings and a touch over two days, ended with England losing the match by 10 wickets. The pitch, which was a rank-turner, helped the Indian spinning duo of Ravichandran Ashwin and Axar Patel to pick 18 off the 20 English wickets. Post the loss, the English fans, experts, and certain sections of their media expressed their displeasure on the nature of the Ahmedabad pitch, which as per them was nothing but a poor advertisement for Test Cricket. Former England skipper and top-order batter Michael Vaughan took to his social media handle after England’s aforementioned loss, to post a picture of him with a bat in his hand, but standing on what looked like a ploughed field, to take a direct jibe at the nature of the pitch at Ahmedabad. The caption for the picture read – “Preparations going well for the 4th Test !!”. It is worth of a mention that the fourth and final Test match was also supposed to take place at the same venue. A post shared by Michael vaughan (@michaelvaughan) The Bharat Army, Team India’s official support/fan group, gave it back in some style to Vaughan by stating that he should check his guard yet again, as he was seen exposing his off-stump too much. Not sure about that @MichaelVaughan Looks like you’re exposing that off stump a little too much. Maybe check your guard again? No wonder England are struggling in India! Move #OnOn 😴 #BharatArmy #BABants #COTI 🇮🇳 https://t.co/GJhBRjkyRh pic.twitter.com/YMCo60VXaP — The Bharat Army (@thebharatarmy) March 2, 2021 Vaughan then, came up with a rather graceful, yet witty reply by stating that he was covering for the straight one. The 47-year-old was perhaps referring to the way some English batters got out to the spinners, while playing for the turn. Covering for the straight one !!! 😜 https://t.co/HqJkNHJGVv — Michael Vaughan (@MichaelVaughan) March 2, 2021 For more Cricket-related news, click here .","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Women's WC, West Indies vs Pakistan: Live Cricket Score, Live Updates","link":"https://sports.ndtv.com/cricket/icc-womens-cricket-world-cup-west-indies-women-vs-pakistan-women-live-cricket-score-live-updates-seddon-park-hamilton-2833138","keywords":null,"creator":null,"video_url":null,"description":"ICC Women's Cricket World Cup Live Score And Updates: West Indies take on Pakistan in their upcoming league stage fixture in Hamilton, on Monday.","content":null,"pubDate":"2022-03-20 18:27:28","full_description":"West Indies face Pakistan in their league stage fixture of the ongoing ICC Women's Cricket World at Seddon Park in Hamilton, on Monday. Captained by Bismah Maroof, Pakistan have lost all four of their previous fixtures and are out of the competition, sitting bottom of the table. Meanwhile, West Indies are third in the table with three wins and two defeats. The Windies will be aiming to secure a win, and keep their semi-final hopes safe. ( LIVE SCORECARD ) It is time for game number 23 of the Women's World Cup, 2022. In this game, we will see a clash between West Indies and Pakistan. West Indies have managed to 3 out of their 5 games so far, which sees them placed thrid in the points table. The Carribean side started the campaign by two shocking victories. And they are back to winning ways after suffering two defeats. The likes of Hayley Matthews, Deandra Dottin can turn the game on its head. On the other hand, this has not been a kind outing for Pakistan, although it surely will play a crucial part as a learning curve for the players. The Pakistan middle order has been unable to destroy at the death. Their power-hitters surely need to step up now. Pakistan are still on a hunt for their first victory of the campaign after four outings. Pakistan had enough time to ponder upon their issues after facing a defeat against Bangladesh. This game should be a cracker. Who will get out on top? We shall find out together.","image_url":"https://c.ndtvimg.com/2022-03/trhu7mto_wi-afp_625x300_20_March_22.jpg?im=FeatureCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Shane Warne funeral: Family and famous friends attend private ceremony in Melbourne - The Independent","link":"https://news.google.com/__i/rss/rd/articles/CBMiV2h0dHBzOi8vd3d3LmluZGVwZW5kZW50LmNvLnVrL3Nwb3J0L2NyaWNrZXQvc2hhbmUtd2FybmUtZnVuZXJhbC1tZWxib3VybmUtYjIwMzk4NzcuaHRtbNIBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Shane Warne funeral: Family and famous friends attend private ceremony in Melbourne  The IndependentShane Warne funeral: Son Jackson holds cricket ball and kisses his father's coffin in final goodbye  Daily MailAustralian cricket legend Shane Warne has private funeral  ReutersShane Warne's children kiss his coffin at funeral as stars gather to send off cricket icon  The MirrorLiz Hurley holds son Damian's hand on eve of Shane Warne's funeral  Daily MailView Full coverage on Google News","content":null,"pubDate":"2022-03-20 17:28:42","image_url":null,"source_id":"google","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"When is the FA Cup semi-final draw? Start time UK, TV channel, live stream free, ball numbers as Crystal Palace qualify","link":"https://www.thesun.co.uk/sport/18005898/fa-cup-semi-final-draw-live-start-time-tv-stream-free-ball-numbers-chelsea/","keywords":["FA Cup","Football","Sport","Sport Live Blogs"],"creator":["Justin Lawrence"],"video_url":null,"description":"THE FA Cup is heading into its last four as teams dream of the final in May. Chelsea are already through after a 2-0 win at Middlesbrough in front of a small portion of away fans due to government sanctions on Roman Abramovich. And they have been joined by Crystal Palace, who secured a crushing […]","content":"THE FA Cup is heading into its last four as teams dream of the final in May. Chelsea are already through after a 2-0 win at Middlesbrough in front of a small portion of away fans due to government sanctions on Roman Abramovich. Getty - ContributorFans are eagerly awaiting the FA Cup semi-final draw[/caption] And they have been joined by Crystal Palace, who secured a crushing victory over Frank Lampard’s Everton. When is the FA Cup semi-final draw? The FA Cup semi-final draw takes place on Sunday, March 20 – TODAY.It commences before the match between Nottingham Forest vs Liverpool. Most read in Sport FIGHT NIGHT Latest reaction as Thor says Hall is welcome to rematch after FLOORING Brit COUT COUP Arsenal 'ready to make move' for Coutinho from Barcelona after star's Villa loan LAID TO REST Shane Warne's family say farewell to cricket star as mourners attend funeral THOR WOW! Hafthor Bjornsson dominates Eddie Hall to win heavyweight showdown in Dubai FOREVER BLUE Terry confirms £250m Chelsea takeover bid & links up with consortium YOU LEWS FIA admit human error cost Hamilton title but Verstappen will keep F1 crown What TV channel is the FA Cup semi-final draw on and can I live stream it free? The FA Cup semi-final draw is live on ITV.Coverage of Nottingham Forest vs Liverpool commences at 5.15pm with kick-off at 6pm.To stream the draw live, head to the ITV Hub.You can also watch it on the FA’s social media accounts.Both of these methods are FREE for UK viewers. Ball numbers Crystal PalaceNottingham Forest or LiverpoolChelseaSouthampton or Man City","pubDate":"2022-03-20 15:32:41","full_description":"THE FA Cup is heading into its last four as teams dream of the final in May. Chelsea are already through after a 2-0 win at Middlesbrough in front of a small portion of away fans due to government sanctions on Roman Abramovich. And they have been joined by Crystal Palace, who secured a crushing victory over Frank Lampard's Everton. Golden balls Here's the ball the numbers of each team. The balls will be picked to decide each team's opponent in the final four of the FA Cup. Ball numbers Semi-final draw time Good afternoon FA Cup fans The FA Cup semi-final draw will take place TODAY just before Liverpool take on Nottingham Forest at the City Ground. Chelsea have already booked their place in the last four after a 2-0 win over Middlesbrough on Saturday night. Boro had a good run in the competition after knocking out both Premier League giants Manchester United and Tottenham. But the Championship side were brought crashing down by the mighty Blues despite their problems off the pitch. And the Blues were joined in the semi's by Crystal Palace who thumped Everton 4-0 on Sunday afternoon. The last place in the final four will belong to either Manchester City or Southampton who are also going head to head on Sunday.","image_url":null,"source_id":"thesun","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"West Indies, 2nd Test, Day 5: Live Cricket Score, Live Updates","link":"https://sports.ndtv.com/cricket/west-indies-2nd-test-day-5-live-cricket-score-live-updates-kensington-oval-bridgetown-2832837","keywords":null,"creator":null,"video_url":null,"description":"West Indies vs England, 2nd Test, Day 5: West Indies face England at Kensington Oval in Bridgetown, Barbados.","content":null,"pubDate":"2022-03-20 14:15:50","full_description":"With an increasing lead, England take on West Indies on Day 5 of the ongoing second Test match at the Kensington Oval in Bridgetown, Barbados. West Indies were all out for 411 runs as England led the hosts by 136 runs at Stump on Day 4. Kraigg Brathwaite and Jermaine Blackwood registered centuries, smashing 160 and 102 runs respectively. Meanwhile, Jack Leach was in good form for the visiting bowling department, taking three wickets. Ben Stokes, Saqib Mahmood bagged two dismissals each and Dan Lawrence registered a wicket. ( LIVE SCORECARD ) We are back for the Windies' first innings! Joe Root and his men are out on the field. The Windies openers, Kraigg Brathwaite and John Campbell make their way out to the middle as well. Chris Woakes has the new red cherry in hand and is raring to go from the Malcolm Marshall end. Let's go... ... Second innings ... West Indies will be a relieved team at the moment. They could have been staring down a total of way more than 507 but wickets in the middle session helped put a brake on the English onslaught. Kemar Roach was the outstanding bowler and picked up important wickets in the afternoon session as well in the post-Tea session. The pitch is still flat but the ball has started to turn with Veerasammy Permaul getting good purchase in the final session as he finished with 3 wickets. West Indies openers will have to lay down the marker and get themselves set so as to be able to counter the spin of Jack Leach later on. Early wickets will make things really tough for the hosts. The second innings of the Test match coming up in a bit. Well, finally Joe Root has decided that they have enough runs on the board and England have declared with 507 runs on the board. After losing a wicket really early in the innings, the skipper Joe Root and Dan Lawrence put on a 164-run stand to give the English innings the impetus it needed on Day 1. On Day 2 it was all Ben Stokes as he hammered the Windies bowlers all around the park. The captain and vice-captain both made big centuries and Ben Foakes alongside Chris Woakes added additional runs to the total. England will now look to come out all guns blazing with the ball and all eyes will be on debutant Matthew Fisher and on how he bowls. OUT! STUMPING! Joe Root calls their batters and that will be the end of England's innings. Tossed up, full and outside off, turn again. Leach comes down the track and looks to heave but misses and the ball sneaks through. Joshua Da Silva behind removes the bails easily. England declare their innings at 507/9. Tossed up, on off. Defended out. FOUR! Tossed up, outside off. Leack steps down and smashes it through covers for a boundary. Around off, fuller and this is blocked out. Flatter and spinning around middle. Leach looks to defend but misses and gets hit high on the pads. Another spicy short ball, over middle again. Fisher does well to get his head under it in time. Short again, over middle. Matthew Fisher ducks under it. Angled into the pads, Fisher misses the tuck and the ball goes off the pads towards the keeper. Jack Leach is the new man in. OUT! TAKEN! The short ball ploy has worked for Kemar Roach and the Windies and the last recognized batter is back in the hut. Roach steams in and digs in another short ball, around the batter's helmet. Chris Woakes looks to take it on as he makes a bit of room and attempts the swat. The ball goes off the toe end of the bat and towards mid-wicket. A couple of fielders converge but its Jayden Seales who runs in from deep mid-wicket and takes a fine sliding catch. FOUR! Hoicked away and the 500 is up for England! Slower one, on the pads. Woakes gets down on one knee and whips it to the left of fine leg for a boundary. Roach is pepping Woakes with good short balls. This is over leg stump and Woakes is just not ready for it. Luckily for him, there's no edge on that one. On middle again, nudged onto the leg side. Darted into middle. Blocked out. The debutant, Matthew Fisher is out now. OUT! STUMPED! Classic off-spinner's dismissal and Veerasammy Permaul has his man. Nicely flighted, outside off and on a driving length. Ben Foakes is enticed into playing the drive but the ball is slower and there's turn on offer too. Foakes gets beaten in flight and Joshua Da Silva has way too much time to whips off the bails. Foakes departs with a score of 499 and finally there's some respite for Permaul.","image_url":"https://c.ndtvimg.com/2022-03/99g2fs78_england-afp_625x300_20_March_22.jpg?im=FeatureCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Abramovich could ‘push Chelsea into administration’ if he ‘refuses to accept offers from countries sanctioning Russia’","link":"https://www.thesun.co.uk/sport/18008343/abramovich-chelsea-administration-refusing-offers-from-countries-sanctioning-russia/","keywords":["Sport"],"creator":["Tom Hussey"],"video_url":null,"description":"CHELSEA owner Roman Abramovich could plunge his crisis gripped club into administration – if he ‘refuses’ to flog it to a country that have sanctioned Russian oligarchs, it has been claimed. The billionaire could influence the club’s sale despite having had all his assets seized by the British Government, according to The Mail on Sunday. […]","content":"CHELSEA owner Roman Abramovich could plunge his crisis gripped club into administration – if he ‘refuses’ to flog it to a country that have sanctioned Russian oligarchs, it has been claimed. The billionaire could influence the club’s sale despite having had all his assets seized by the British Government, according to The Mail on Sunday. APBillionaire Abramovich may not want to sell the club to buyers from nations that have sanctioned Russian oligarchs[/caption] RexChelsea face administration if Abramovich pushes to veto bidders[/caption] Abramovich – who has owned Chelsea since 2003 – has hired The Raine Group to flog the West London club. He reportedly has the power to veto bids from potential buyers in the United States and Britain, the sources claimed. The Sun Online have approached The Raine Group, the office of Mr Abramovich and Chelsea FC for comment. This would be in reaction to both countries sanctioning Russian oligarchs in response to the war in Ukraine. READ MORE SPORTS STORIES BLUES NEWS Chelsea bidder Nick Candy EXCLUSIVE, Blues BEAT Boro in FA Cup quarter-final RIGHT MESS James to miss England duty with Chelsea to leave Southgate with no right-back The means Chelsea could yet end up in administration as the highest remaining bid from outside the US and Europe is likely to be from the Saudi Media Group. The Saudi’s have reportedly tabled a whopping £2.66bn offer – but Chancellor Rishi Sunak, who is overseeing the process – is likely to turn it down. This is in light of the ferocious backlash following the takeover of Newcastle United by an investment fund linked to nation’s rulers. They paid £305 million for the Magpies in October 2021 – assisted by British businesswoman Amanda Staveley. Most read in Sport FIGHT NIGHT Latest reaction as Thor says Hall is welcome to rematch after FLOORING Brit LAID TO REST Shane Warne's family say farewell to cricket star as mourners attend funeral THOR WOW! Hafthor Bjornsson dominates Eddie Hall to win heavyweight showdown in Dubai FOREVER BLUE Terry confirms £250m Chelsea takeover and links up with True Blues consortium YOU LEWS FIA admit human error cost Hamilton title but Verstappen will keep F1 crown WEIGHT IS OVER All you need to know as Hall prepares to face Thor in 'heaviest fight ever' The Government could yet seize Chelsea, but even if a deal is agreed there would be questions around the proceeds. Government officials have already said Abramovich would not receive a penny for the sale given his links to Russian tyrant Vladimir Putin and the alleged origins of his wealth. The sanctions saw Abramovich’s London property portfolio – worth an estimated £200 million – seized, preventing him from accessing his homes. All his assets including the clubs bank cards were also frozen – Chelsea have also been banned from taking part in the summer transfer window. Chelsea are now haemorrhaging millions of pounds per week on wages and cannot earn money. US businessman Todd Boehly – who is worth $6.6 billion – has teamed up with Swiss billionaire Hansjorg Wyss and British property developer Jonathan Goldstein to bid on the club. The trio are are leading one of the two major American bids for Chelsea – estimated to be between £2bn and £2.5bn – this was reportedly raised hours before the deadline to try and beat rivals. According to the Mail on Sunday, their proposal appears to have gone a long way to reassuring the Government that they can do a quick deal. The Ricketts family, owners of the Chicago Cubs baseball team, based in Illinois, USA, have also lodged a bid. The family have an estimated wealth of $4.9 billion. TERRYFIC It comes as John Terry has entered the race to buy his former club – confirming he is heading up a £250million consortium. The True Blues consortium is looking to buy supporters a 10 per cent share in the club. The consortium will allow fans to buy a stake in the club for as little as £100 – they will also get voting rights on club decisions. Read More on The Sun MURDER PROBE Student 'murdered' at uni halls named as cops urge partner to hand himself in FRY HARDER I’m disgusted after £11 full English - you won't believe what was on the plate The consortium has won the backing of Stamford Bridge freeholders, Chelsea Pitch Owners, and the club’s supporters’ trust. Following the announcement, the former skipper and Chelsea legend said the club has been “such an important part of my life for 22 years”. ReutersFormer skipper and Chelsea legend is heading up a consortium to buy the club[/caption] GettyUS businessman Todd Boehly – who is worth $6.6 billion – has teamed up with Swiss billionaire Hansjorg Wyss and British property developer Jonathan Goldstein to buy the club[/caption] ReutersRoman Abramovich has been sanctioned by the UK Government for his links to Russian President Vladimir Putin[/caption]","pubDate":"2022-03-20 13:47:08","full_description":"CHELSEA owner Roman Abramovich could plunge his crisis-gripped club into administration - if he 'refuses' to flog it to a country that has sanctioned Russian oligarchs, it has been claimed. The billionaire could influence the club's sale despite having had all his assets seized by the British Government, according to The Mail on Sunday . If Chelsea were forced into administration it would see them hit with a nine-point deduction, putting their top four and Champions League hopes in jeopardy. Abramovich - who has owned Chelsea since 2003 - has hired The Raine Group to flog the West London club. He reportedly has the power to veto bids from potential buyers in the United States and Britain, the sources claimed. The Sun Online have approached The Raine Group, the office of Mr Abramovich and Chelsea FC for comment. This would be in reaction to both countries sanctioning Russian oligarchs in response to the war in Ukraine. The means Chelsea could yet end up in administration as the highest remaining bid from outside the US and Europe is likely to be from the Saudi Media Group. The Saudis have reportedly tabled a whopping £2.66bn offer - but Chancellor Rishi Sunak, who is overseeing the process - is likely to turn it down. This is in light of the ferocious backlash following the takeover of Newcastle United by an investment fund linked to nation's rulers . They paid £305million for the Magpies in October 2021 - assisted by British businesswoman Amanda Staveley. The Government could yet seize Chelsea, but even if a deal is agreed there would be questions around the proceeds. Government officials have already said Abramovich would not receive a penny for the sale given his links to Russian tyrant Vladimir Putin and the alleged origins of his wealth. The sanctions saw Abramovich's London property portfolio - worth an estimated £200 million - seized, preventing him from accessing his homes. All his assets including the clubs bank cards were also frozen - Chelsea have also been banned from taking part in the summer transfer window. Chelsea are now haemorrhaging millions of pounds per week on wages and cannot earn money . US businessman Todd Boehly - who is worth $6.6 billion - has teamed up with Swiss billionaire Hansjorg Wyss and British property developer Jonathan Goldstein to bid on the club. The trio are are leading one of the two major American bids for Chelsea - estimated to be between £2bn and £2.5bn - this was reportedly raised hours before the deadline to try and beat rivals. According to the Mail on Sunday, their proposal appears to have gone a long way to reassuring the Government that they can do a quick deal. The Ricketts family, owners of the Chicago Cubs baseball team, have also lodged a bid. The family have an estimated wealth of $4.9billion. It comes as John Terry has entered the race to buy his former club - confirming he is heading up a £250million consortium . The True Blues consortium is looking to buy supporters a 10 per cent share in the club. The consortium will allow fans to buy a stake in the club for as little as £100 - they will also get voting rights on club decisions. The consortium has won the backing of Stamford Bridge freeholders, Chelsea Pitch Owners, and the club's supporters' trust. Following the announcement, the former skipper and Chelsea legend said the club has been \"such an important part of my life for 22 years\".","image_url":null,"source_id":"thesun","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"DAT vs KHW Dream11 Prediction: Fantasy Cricket Tips, Today's Playing 11s and Pitch Report for Oman D10 League 2022, Match 25","link":"https://www.sportskeeda.com/fantasy-cricket-mantra/dat-vs-khw-dream11-prediction-fantasy-cricket-tips-today-s-playing-11s-pitch-report-oman-d10-league-2022-match-25?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Fantasy Cricket Mantra"],"creator":["Anjishnu Roy"],"video_url":null,"description":null,"content":null,"pubDate":"2022-03-20 13:19:16","full_description":"Darsait Titans (DAT) will take on Khuwair Warriors (KHW) in the 25th match of the Oman D10 League 2022 at the Al Amerat Cricket Ground in Oman on Sunday. The Titans are winless in five games thus far and are seventh in the points table. They suffered a six-wicket loss to Ruwi Rangers in their last outing. Meanwhile, Khuwair Warriors have also lost all of their matches so far. They are eighth in the points table and are coming off a loss against Bousher Busters by eight wickets in their previous match. Khurram Khan (wk), Khanwar Ali, Zeeshan Maqsood, Ubaid Ullah, Sachin Jagra, Amanpreet Sirah, Imran Mohammad, Arjun Kumar, Chaminda Lakmal, Ikram Sadaat (c), Nestro Dhamba. Aamir Kaleem (c), Zeeshan Siddiqui, Danish Mohammad, Azam Ali, Sean Nowak, Kuttiraja Shnmugrajan (wk), Muzahir Raza, Aditya Parag, Syed Amir Ali, Arjun Dhiman, Bilal Asim. Match: DAT vs KHW, Oman D10 League 2022, Match 26. Date and Time: March 20, 2022; 7:00 PM IST. Venue: Al Amerat Cricket Ground, Oman. Going by previous games, the track seems to be a batting paradise. High scores are pretty common, as the ball skids and comes on to the bat well. Spinners could prove to be key in the middle overs. K Khan is a wonderful choice for the wicketkeeper position in your Dream11 fantasy team. He scored 35 runs in his previous game against Ruwi Rangers. A Sirah is a wonderful player who can surprise the opposition with both bat and ball. He picked up a wicket in his last match and has been one of the most consistent performers for his teams. Z Maqsood is a brilliant all-rounder who has been consistent lately. He scored a 30-ball-50 in his last match and could prove to be an exciting captaincy choice in your DAT vs KHW Dream11 fantasy team. U Ullah has been in good form and has found success in every game he has played so far. He could be another reliable multiplier pick for your fantasy team. U Ullah (DAT) – 436 points A Sirah (DAT) – 364 points Z Maqsood (DAT) – 249 points K Khan (DAT) – 220 points A Dhiman (KHW) – 220 points. U Ullah: 108 runs and 8 wickets A Sirah: 52 runs and 7 wickets Z Maqsood: 116 runs and 2 wickets K Khan: 107 runs. Fantasy Suggestion #1: K Khan, A Sirah, I Sadaat, A Ali, Z Maqsood, A Dhiman, D Mohammad, A Kaleem, U Ullah, M Raza, A Gurumukhi Parag. Captain: Z Maqsood. Vice-Captain: U Ullah. Fantasy Suggestion #2: K Khan, A Sirah, I Sadaat, A Ali, Z Maqsood, A Dhiman, Z Siddiqui, A Kaleem, U Ullah, M Raza, A Gurumukhi Parag. Captain: A Sirah. Vice-Captain: K Khan.","image_url":"https://static.sportskeeda.com/editor/2022/03/436af-16477714418333-1920.jpg","source_id":"sportskeeda","country":["india"],"category":["sports"],"language":"english"},{"title":"ICC rates Bengaluru pitch where India played 2nd Test against Sri Lanka as ‘below average’","link":"https://www.tribuneindia.com/news/sports/icc-rates-bengaluru-pitch-where-india-played-2nd-test-against-sri-lanka-as-below-average-379215","keywords":null,"creator":null,"video_url":null,"description":"Dubai, March 20The Chinnaswamy Stadium pitch in Bengaluru, which was used for the second Test between India and Sri Lanka earlier this month, was on Sunday rated \"below average\" by the ICC.India had defeated Sri Lanka by 238 runs in the Test which began on March 12 and ended inside three days.The venue thus received one demerit point under the ICC Pitch and Outfield Monitoring Process.\"The pitch offered a lot of turn on the first day itself and though it improved with every session, in my view, it was not an even contest between the bat and ball,\" match referee Javagal Srinath said in a statement issued by ICC.Srinath's report has been forwarded to the BCCI.In 2017, the Bangalore wicket was rated as below average by ICC match referee Chris Broad after the second Test between India and Australia.According to the revised ICC Pitch and Outfield Monitoring Process, which was introduced on January 4, 2018, \"if a pitch or outfield is rated as being substandard, that venue will be allocated a number of demerit points.\" \"One demerit point will be awarded to venues whose pitches are rated by the match referees as below average, while three and five demerit points will be awarded to venues whose pitches are marked as poor and unfit, respectively.\"No demerit point will be awarded when the outfield is rated as below average, but two and five demerit points will be awarded to venues whose outfields are marked as poor and unfit, respectively.\" Demerit points will remain active for a rolling five-year period.When a venue accumulates five demerit points (or crosses that threshold), it will be suspended from hosting any international cricket for a period of 12 months, the ICC said.A venue will be suspended from staging any international cricket for 24 months when it reaches the threshold of 10 demerit points.","content":null,"pubDate":"2022-03-20 12:33:57","full_description":"PTI Dubai, March 20 The Chinnaswamy Stadium pitch in Bengaluru, which was used for the second Test between India and Sri Lanka earlier this month, was on Sunday rated “below average” by the ICC. India had defeated Sri Lanka by 238 runs in the Test which began on March 12 and ended inside three days. The venue thus received one demerit point under the ICC Pitch and Outfield Monitoring Process. “The pitch offered a lot of turn on the first day itself and though it improved with every session, in my view, it was not an even contest between the bat and ball,” match referee Javagal Srinath said in a statement issued by ICC. Srinath’s report has been forwarded to the BCCI. In 2017, the Bangalore wicket was rated as below average by ICC match referee Chris Broad after the second Test between India and Australia. According to the revised ICC Pitch and Outfield Monitoring Process, which was introduced on January 4, 2018, “if a pitch or outfield is rated as being substandard, that venue will be allocated a number of demerit points.” “One demerit point will be awarded to venues whose pitches are rated by the match referees as below average, while three and five demerit points will be awarded to venues whose pitches are marked as poor and unfit, respectively. “No demerit point will be awarded when the outfield is rated as below average, but two and five demerit points will be awarded to venues whose outfields are marked as poor and unfit, respectively.” Demerit points will remain active for a rolling five-year period. When a venue accumulates five demerit points (or crosses that threshold), it will be suspended from hosting any international cricket for a period of 12 months, the ICC said. A venue will be suspended from staging any international cricket for 24 months when it reaches the threshold of 10 demerit points.","image_url":"https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/3/2022_3$largeimg_1944115020.jpeg","source_id":"tribuneindia","country":["india"],"category":["sports"],"language":"english"},{"title":"IND vs SL: Bengaluru pitch rated below average after 3-day Test","link":"https://timesofindia.indiatimes.com/sports/cricket/sri-lanka-in-india/icc-rates-bengaluru-pitch-where-india-played-2nd-test-against-sri-lanka-as-below-average/articleshow/90336729.cms","keywords":null,"creator":null,"video_url":null,"description":"The M Chinnaswamy Stadium pitch used for the second Test between India and Sri Lanka has been rated below average by the match referee and received one demerit point, cricket's governing body (ICC) said on Sunday. The day-night pink ball Test finished inside three days as India beat Sri Lanka by 238 runs to win the two-test series 2-0.","content":null,"pubDate":"2022-03-20 12:08:49","full_description":"DUBAI: The Chinnaswamy Stadium pitch in Bengaluru, which was used for the second Test between India and Sri Lanka earlier this month, was on Sunday rated \"below average\" by the ICC . India had defeated Sri Lanka by 238 runs in the Test which began on March 12 and ended inside three days. The venue thus received one demerit point under the ICC Pitch and Outfield Monitoring Process . \"The pitch offered a lot of turn on the first day itself and though it improved with every session, in my view, it was not an even contest between the bat and ball,\" match referee Javagal Srinath said in a statement issued by ICC. Srinath's report has been forwarded to the BCCI . In 2017, the Bangalore wicket was rated as below average by ICC match referee Chris Broad after the second Test between India and Australia. According to the revised ICC Pitch and Outfield Monitoring Process, which was introduced on January 4, 2018, \"if a pitch or outfield is rated as being substandard, that venue will be allocated a number of demerit points.\" \"One demerit point will be awarded to venues whose pitches are rated by the match referees as below average, while three and five demerit points will be awarded to venues whose pitches are marked as poor and unfit, respectively. \"No demerit point will be awarded when the outfield is rated as below average, but two and five demerit points will be awarded to venues whose outfields are marked as poor and unfit, respectively.\" Demerit points will remain active for a rolling five-year period. When a venue accumulates five demerit points (or crosses that threshold), it will be suspended from hosting any international cricket for a period of 12 months, the ICC said. A venue will be suspended from staging any international cricket for 24 months when it reaches the threshold of 10 demerit points.","image_url":null,"source_id":"toi","country":["india"],"category":["sports"],"language":"english"},{"title":"ICC rates Bengaluru pitch where India played 2nd Test against Sri Lanka as 'below average' - Times of India","link":"https://news.google.com/__i/rss/rd/articles/CBMitwFodHRwczovL3RpbWVzb2ZpbmRpYS5pbmRpYXRpbWVzLmNvbS9zcG9ydHMvY3JpY2tldC9zcmktbGFua2EtaW4taW5kaWEvaWNjLXJhdGVzLWJlbmdhbHVydS1waXRjaC13aGVyZS1pbmRpYS1wbGF5ZWQtMm5kLXRlc3QtYWdhaW5zdC1zcmktbGFua2EtYXMtYmVsb3ctYXZlcmFnZS9hcnRpY2xlc2hvdy85MDMzNjcyOS5jbXPSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"ICC rates Bengaluru pitch where India played 2nd Test against Sri Lanka as 'below average'  Times of IndiaBengaluru pitch for IND-SL Test rated below average by ICC | Cricbuzz.com - Cricbuzz  CricbuzzBengaluru pitch gets 'below average' rating from ICC match referee  ESPNcricinfoICC delivers verdict on Bangalore pitch from India-Sri Lanka Test  International Cricket CouncilBengaluru Pitch Used For 2nd India vs Sri Lanka Test Rated As \"Below Average\"  NDTV SportsView Full coverage on Google News","content":null,"pubDate":"2022-03-20 12:08:00","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"\"Most Looking Forward To...\": Saini Keen To Meet This Royals Player","link":"https://sports.ndtv.com/cricket/most-looking-forward-to-navdeep-saini-keen-to-meet-new-zealand-legend-in-rajasthan-royals-camp-2832673","keywords":null,"creator":null,"video_url":null,"description":"IPL 2022: Being a bowler who relies on swing and accuracy, Navdeep Saini said he's looking forward to working with one of the biggest names in T20 cricket.","content":null,"pubDate":"2022-03-20 12:01:07","full_description":"Fast bowler Navdeep Saini has fallen off the radar after a couple of indifferent IPL seasons and will be looking to put his career back on track when he turns out for his new franchise, Rajasthan Royals, in IPL 2022. Saini will be looking to perform well for his new franchise in order get back into contention for a place in the Indian team again. He was of Delhi's Ranji Trophy team recently and would want shift his focus to the white-ball game ahead of the IPL season. Speaking on the opportunity of playing for the Royals, Saini said, \"It's wonderful to play for a franchise like Rajasthan Royals, who were the first-ever champions of the IPL. I'm looking forward to working with the very experienced coaching group and a talented group of players. The Royals are known for fostering a fantastic atmosphere around the group, and I'm simply looking to experience that and connect with everyone and get going this season.\" Being a bowler who relies on swing and accuracy, Saini said he's looking forward to working with one of the biggest names in T20 cricket. \"I am most looking forward to connecting with Trent Boult during the IPL. He is someone who has achieved so much in both international and IPL cricket, and it'll be a great experience to just speak to him about various aspects of fast bowling. I'll be most focused on observing him go about his business, and hopefully, that should also help in improving my own game,\" expressed Saini, who has 17 wickets in the IPL at an economy of 8.47. Promoted Rajasthan Royals have a new-look side this season and captain Sanju Samson will be hoping to take his team to the play-offs this time around. (With ANI Inputs)","image_url":"https://c.ndtvimg.com/2022-03/glldi7co_navdeep-saini-rajasthan-royals_120x90_20_March_22.jpg","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"“If you want to complain about ‘flat pitches’ then you should quit cricket”: Saeed Ajmal opens up on the criticism of flat pitches in Pakistan vs Australia test series","link":"https://thesportsrush.com/cricket-news-if-you-want-to-complain-about-flat-pitches-then-you-should-quit-cricket-saeed-ajmal-opens-up-on-the-criticism-of-flat-pitches-in-pakistan-vs-australia-test-series/","keywords":["Cricket","Flat Pitch","PAK vs AUS","Saeed Ajmal"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"Saeed Ajmal has opened up on the criticism of flat pitches in Pakistan vs Australia test series, and he has used some strong words. When Australia announced their tour to Pakistan after 24 years, it was expected to be a close and competitive series. However, the pitches in Rawalpindi and Karachi have almost killed the… The post “If you want to complain about ‘flat pitches’ then you should quit cricket”: Saeed Ajmal opens up on the criticism of flat pitches in Pakistan vs Australia test series appeared first on The SportsRush.","content":"Saeed Ajmal has opened up on the criticism of flat pitches in Pakistan vs Australia test series, and he has used some strong words. When Australia announced their tour to Pakistan after 24 years, it was expected to be a close and competitive series. However, the pitches in Rawalpindi and Karachi have almost killed the excitement of the series. Gone are the days when scoring piles of runs used to be entertaining, the contest between bat and ball is the demand of today’s game. There has been absolutely no help for any kind of bowlers in the matches so far. In the Rawalpindi test, 1187 runs were made for the loss of just 14 wickets. The Karachi test was a close affair, but the pitch was suiting the batters only. Australian batter David Warner and a lot of pundits heavily criticized the pitch of the Rawalpindi test. Even Pakistan’s all-rounder Mohammad Hafeez has criticized the pitches made in Pakistan for the series. Saeed Ajmal goes vocal on “flat pitches” issues Former Pakistani spinner Saeed Ajmal has used some strong words on the bowlers complaining about flat pitches. In an interview with Cricket Pakistan. He said that the spinners should be able to take wickets on any kind of surface. According to Ajmal, complaining about “flat pitch” is already a loss. “If the spinner is going to look at the pitch and then bowl, what is the point of being a spinner then? Spinners need to learn to perform in all conditions. These were flat pitches and honestly, many decks in Test cricket are like this,” Ajmal said. #OnThisDay in 2012. Pakistan bowled England out for 72 in Abu Dhabi. Abdur Rehman took a career-best 6 for 25 & Saeed Ajmal took 7 wickets in the match, which was his 19th Test, breaking Waqar Younis’ national record to become the fastest Pakistani to 100 Test wickets #Cricket pic.twitter.com/CLemS9p18r — Saj Sadiq (@SajSadiqCricket) January 28, 2022 Saeed Ajmal said that the spinners who can bowl in any conditions tend to get more wickets. He stated the fact that Pakistan’s team played a lot of games in the UAE, and the spinners had to work hard there. Ajmal insists that If you want to complain about ‘flat pitches’ then you should quit cricket. “To take wickets, you need temperament. You need to bowl a good 8-10 overs to play mind games with the batsmen and then you will be able to execute your plan. If you want to complain about ‘flat pitches’ then you should quit cricket,” Saeed Ajmal further added. Saeed Ajmal has scalped 178 test wickets in 35 games, whereas he also has 184 ODI wickets and 85 T20I wickets under his belt. The post “If you want to complain about ‘flat pitches’ then you should quit cricket”: Saeed Ajmal opens up on the criticism of flat pitches in Pakistan vs Australia test series appeared first on The SportsRush.","pubDate":"2022-03-20 12:01:06","full_description":"Saeed Ajmal has opened up on the criticism of flat pitches in Pakistan vs Australia test series, and he has used some strong words. When Australia announced their tour to Pakistan after 24 years, it was expected to be a close and competitive series. However, the pitches in Rawalpindi and Karachi have almost killed the excitement of the series. Gone are the days when scoring piles of runs used to be entertaining, the contest between bat and ball is the demand of today’s game. There has been absolutely no help for any kind of bowlers in the matches so far. In the Rawalpindi test, 1187 runs were made for the loss of just 14 wickets. The Karachi test was a close affair, but the pitch was suiting the batters only. Australian batter David Warner and a lot of pundits heavily criticized the pitch of the Rawalpindi test. Even Pakistan’s all-rounder Mohammad Hafeez has criticized the pitches made in Pakistan for the series. Former Pakistani spinner Saeed Ajmal has used some strong words on the bowlers complaining about flat pitches. In an interview with Cricket Pakistan. He said that the spinners should be able to take wickets on any kind of surface. According to Ajmal, complaining about “flat pitch” is already a loss. “If the spinner is going to look at the pitch and then bowl, what is the point of being a spinner then? Spinners need to learn to perform in all conditions. These were flat pitches and honestly, many decks in Test cricket are like this,” Ajmal said. #OnThisDay in 2012. Pakistan bowled England out for 72 in Abu Dhabi. Abdur Rehman took a career-best 6 for 25 & Saeed Ajmal took 7 wickets in the match, which was his 19th Test, breaking Waqar Younis’ national record to become the fastest Pakistani to 100 Test wickets #Cricket pic.twitter.com/CLemS9p18r — Saj Sadiq (@SajSadiqCricket) January 28, 2022 Saeed Ajmal said that the spinners who can bowl in any conditions tend to get more wickets. He stated the fact that Pakistan’s team played a lot of games in the UAE, and the spinners had to work hard there. Ajmal insists that If you want to complain about ‘flat pitches’ then you should quit cricket. “To take wickets, you need temperament. You need to bowl a good 8-10 overs to play mind games with the batsmen and then you will be able to execute your plan. If you want to complain about ‘flat pitches’ then you should quit cricket,” Saeed Ajmal further added. Saeed Ajmal has scalped 178 test wickets in 35 games, whereas he also has 184 ODI wickets and 85 T20I wickets under his belt.","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Bengaluru pitch gets 'below average' rating from ICC match referee - ESPNcricinfo","link":"https://news.google.com/__i/rss/rd/articles/CBMia2h0dHBzOi8vd3d3LmVzcG5jcmljaW5mby5jb20vc3RvcnkvYmVuZ2FsdXJ1LXBpdGNoLWdldHMtYmVsb3ctYXZlcmFnZS1yYXRpbmctZnJvbS1pY2MtbWF0Y2gtcmVmZXJlZS0xMzA2NTc00gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Bengaluru pitch gets 'below average' rating from ICC match referee  ESPNcricinfoICC delivers verdict on Bangalore pitch from India-Sri Lanka Test  International Cricket CouncilBengaluru pitch for IND-SL Test rated below average by ICC | Cricbuzz.com - Cricbuzz  CricbuzzICC rates Bengaluru pitch where India played 2nd Test against Sri Lanka as 'below average'  Times of IndiaBengaluru Pitch Used For 2nd India vs Sri Lanka Test Rated As \"Below Average\"  NDTV SportsView Full coverage on Google News","content":null,"pubDate":"2022-03-20 11:43:55","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Chennai Super Kings (CSK) all-rounder Moeen Ali having visa issues ahead of IPL 2022 [Details]","link":"https://www.thehansindia.com/sports/cricket/chennai-super-kings-csk-all-rounder-moeen-ali-having-visa-issues-ahead-of-ipl-2022-details-734243","keywords":["Sports,Cricket"],"creator":["Ishka"],"video_url":null,"description":"CSK won the IPL title last seasonThey are set to play the opening game of IPL 2022 against KKRIPL 2022 will go underway on March 26 in Mumbai","content":"Chennai Super Kings (CSK) all-rounder Moeen Ali Chennai Super Kings (CSK) all-rounder Moeen Ali Chennai Super Kings (CSK) all-rounder Moeen Ali has not left for India ahead of the Indian Premier League (IPL) 2022. Moeen's visa has not been approved yet, according to reports.IPL 2022 is scheduled to go underway on March 26. CSK CEO Kasi Viswanathan is, however, confident that the issue will be resolved soon. \"We spoke to him about the issue and he is hoping that matter will be resolved soon. All necessary documentation has been done but don't know why his visa approval hasn't come. As soon he will get his Visa he will fly to India and join the team,\" Viswanathan told India Today. CSK are set to play the opening game of IPL 2022 on Saturday against Kolkata Knight Riders (KKR) at Wankhede Stadium, Mumbai. It is the repeat of last season's final, where MS Dhoni-led CSK claimed their fourth title. In the lead up to the 15th edition of IPL, CSK players have been training in Surat. While the likes of MS Dhoni and Ambati Rayudu began training earlier this month, the other domestic stars and foreign players have started arriving.🦁 Lessons 101!#Yellove #WhistlePodu 💛 pic.twitter.com/6mEovdbxPm— Chennai Super Kings (@ChennaiIPL) March 19, 2022 Moeen will have to undergo three-day quarantine on arrival in India. He is not a part of the English side that is currently in the Caribbean playing Tests against West Indies. The left-arm spinner retired from Test cricket last year.Last year, Moeen scored 357 runs in 15 matches and also picked up six wickets. Overall, Moeen, who made his IPL debut in 2018, has 666 runs to his name, along with 16 wickets in 34 games.","pubDate":"2022-03-20 10:53:18","full_description":"Chennai Super Kings (CSK) all-rounder Moeen Ali Chennai Super Kings (CSK) all-rounder Moeen Ali has not left for India ahead of the Indian Premier League (IPL) 2022. Moeen's visa has not been approved yet, according to reports. IPL 2022 is scheduled to go underway on March 26. CSK CEO Kasi Viswanathan is, however, confident that the issue will be resolved soon. \"We spoke to him about the issue and he is hoping that matter will be resolved soon. All necessary documentation has been done but don't know why his visa approval hasn't come. As soon he will get his Visa he will fly to India and join the team,\" Viswanathan told India Today. CSK are set to play the opening game of IPL 2022 on Saturday against Kolkata Knight Riders (KKR) at Wankhede Stadium, Mumbai. It is the repeat of last season's final, where MS Dhoni-led CSK claimed their fourth title. In the lead up to the 15th edition of IPL, CSK players have been training in Surat. While the likes of MS Dhoni and Ambati Rayudu began training earlier this month, the other domestic stars and foreign players have started arriving. 🦁 Lessons 101! #Yellove #WhistlePodu 💛 pic.twitter.com/6mEovdbxPm Moeen will have to undergo three-day quarantine on arrival in India. He is not a part of the English side that is currently in the Caribbean playing Tests against West Indies. The left-arm spinner retired from Test cricket last year. Last year, Moeen scored 357 runs in 15 matches and also picked up six wickets. Overall, Moeen, who made his IPL debut in 2018, has 666 runs to his name, along with 16 wickets in 34 games.","image_url":"https://assets.thehansindia.com/h-upload/2022/03/20/500x300_1282673-chennai.jpg","source_id":"thehansindia","country":["india"],"category":["sports"],"language":"english"},{"title":"Sri Lanka to host Asia Cup T20, Asian Cricket Council extend Shah's term","link":"https://www.sentinelassam.com/sports/cricket/sri-lanka-to-host-asia-cup-t20-asian-cricket-council-extend-shahs-term-583594","keywords":["Sports,Cricket"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"The 2022 edition of the Asia Cup cricket tournament, which will be a T20I competition this year","content":"COLOMBO: The 2022 edition of the Asia Cup cricket tournament, which will be a T20I competition this year, will be held in Sri Lanka from August 27 to September 11, the Asian Cricket Council (ACC) announced on Saturday after its annual general meeting.All five Test teams — hosts Sri Lanka, India, Pakistan, Afghanistan and Bangladesh - will take part in the tournament while one more Asian side will be decided after a qualifying tournament which will be held from August 20. \"The Asia Cup 2022 (T20 Format) will be held in Sri Lanka from August 27-September 11 later this year. The Qualifiers for the same will be played from August 20 onwards,\" the ACC said in a tweet. The Asia Cup, which usually alternates between ODI and T20I formats, was last played in 2018 and won by India. However, the next edition of the tournament, which was set to be played in 2020 was postponed due to the Covid-19 pandemic. Sri Lanka was supposed to host the 2020 edition, but Covid-19 pushed the event to 2021 before finally being moved to 2022. They retained their rights to host the 2022 edition, with Pakistan in line to host the 2023 edition of the tournament. Defending champions India are the most successful team in Asia Cup, winning it seven times including the lone T20I edition in 2016 while Sri Lanka have won the competition five times. During the AGM, it was also unanimously decided that Jay Shah, the BCCI secretary, will continue as the Asian Cricket Council's (ACC) President for one more year till 2024. Shah had taken over the reins of the ACC in January last year from Nazmul Hassan, president of Bangladesh Cricket Board (BCB), making him the youngest administrator to be re-appointed as the ACC president. Meanwhile, Pankaj Khimji of Oman Cricket Board was appointed the vice-president of ACC and Mahinda Vallipuram of Malaysia Cricket Association was named the chairman of the developing committee. Addressing the AGM, Shah said, \"I would like to thank all of my esteemed colleagues at the ACC for reposing their faith in me and considering me worthy to carry on all the work we had begun. I humbly accept this honour and am committed to working hard with a view to organise, develop and promote our beloved sport of cricket in the region, aiding the ACC to steadily grow in stature.\" \"We remain committed towards ensuring the all-round development of cricket in the region, especially carrying forward the pioneering work in women's cricket and the multiple grassroots tournaments the ACC conducts in the region around the year. The pandemic hopefully is behind us and I am keen that we adapt, innovate and help the ACC grow from strength to strength from hereon,\" added Shah. The decision was taken in the Annual General Meeting of the ACC at Colombo on Saturday (March 19) alongside the decision to extend the tenure of Shah and its Executive Board and committees until the next AGM in 2024. Shah had taken over the reins from Bangladesh's Nazmul Hassan in January 2021. Shah's extension as the ACC President for one year was proposed by Sri Lanka Cricket (SLC) president Shammi Silva and the nomination was backed unanimously by all the members of the ACC. IANS Also Read:  Asia Cup T20 tournament meet postponed due to Covid-19Also Watch:","pubDate":"2022-03-20 10:44:35","full_description":"COLOMBO: The 2022 edition of the Asia Cup cricket tournament, which will be a T20I competition this year, will be held in Sri Lanka from August 27 to September 11, the Asian Cricket Council (ACC) announced on Saturday after its annual general meeting. All five Test teams — hosts Sri Lanka, India, Pakistan, Afghanistan and Bangladesh - will take part in the tournament while one more Asian side will be decided after a qualifying tournament which will be held from August 20. \"The Asia Cup 2022 (T20 Format) will be held in Sri Lanka from August 27-September 11 later this year. The Qualifiers for the same will be played from August 20 onwards,\" the ACC said in a tweet. The Asia Cup, which usually alternates between ODI and T20I formats, was last played in 2018 and won by India. However, the next edition of the tournament, which was set to be played in 2020 was postponed due to the Covid-19 pandemic. Sri Lanka was supposed to host the 2020 edition, but Covid-19 pushed the event to 2021 before finally being moved to 2022. They retained their rights to host the 2022 edition, with Pakistan in line to host the 2023 edition of the tournament. Defending champions India are the most successful team in Asia Cup, winning it seven times including the lone T20I edition in 2016 while Sri Lanka have won the competition five times. During the AGM, it was also unanimously decided that Jay Shah, the BCCI secretary, will continue as the Asian Cricket Council's (ACC) President for one more year till 2024. Shah had taken over the reins of the ACC in January last year from Nazmul Hassan, president of Bangladesh Cricket Board (BCB), making him the youngest administrator to be re-appointed as the ACC president. Meanwhile, Pankaj Khimji of Oman Cricket Board was appointed the vice-president of ACC and Mahinda Vallipuram of Malaysia Cricket Association was named the chairman of the developing committee. Addressing the AGM, Shah said, \"I would like to thank all of my esteemed colleagues at the ACC for reposing their faith in me and considering me worthy to carry on all the work we had begun. I humbly accept this honour and am committed to working hard with a view to organise, develop and promote our beloved sport of cricket in the region, aiding the ACC to steadily grow in stature.\" \"We remain committed towards ensuring the all-round development of cricket in the region, especially carrying forward the pioneering work in women's cricket and the multiple grassroots tournaments the ACC conducts in the region around the year. The pandemic hopefully is behind us and I am keen that we adapt, innovate and help the ACC grow from strength to strength from hereon,\" added Shah. The decision was taken in the Annual General Meeting of the ACC at Colombo on Saturday (March 19) alongside the decision to extend the tenure of Shah and its Executive Board and committees until the next AGM in 2024. Shah had taken over the reins from Bangladesh's Nazmul Hassan in January 2021. Shah's extension as the ACC President for one year was proposed by Sri Lanka Cricket (SLC) president Shammi Silva and the nomination was backed unanimously by all the members of the ACC. IANS Also Read: Asia Cup T20 tournament meet postponed due to Covid-19 Also Watch:","image_url":"https://assets.sentinelassam.com/h-upload/2022/03/20/326761-acc1.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"WE R North East, Rangia win in 4th T20 Challenge Trophy","link":"https://www.sentinelassam.com/north-east-india-news/local-sports/we-r-north-east-rangia-win-in-4th-t20-challenge-trophy-583589","keywords":["Sports,Local Sports"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"WE R North East and Rangia Cricket Association earned full points in the 4th T20 Challenge Trophy held at Mangaldoi","content":"Our Sports ReporterGUWAHATI: WE R North East and Rangia Cricket Association earned full points in the 4th T20 Challenge Trophy held at Mangaldoi today. WE R North East beat Gyanjyoti Milan Sangha by 130 runs. 22 Yards Glory lost to Rangia Cricket Association in a well conteste game by 6 runs. Brief result: 1st match- We R North East 210-6 (20 overs), Jitu Ali 51, Dhruv Raj Borah 47 no, Ayshman Malakar 34 no, Gyanjyoti Milan Sangha 80-9 (18.4 overs), Sondeep Rabha 3-15. 2nd match: Rangia Cricket Association 164-3 (20 overs), Somyadeep Das 78, Neelav Sarma 40 no, 22 Yards glory 158-8 (20 overs), Bitop Mahanta 46, Prasanta Sonowal 35. Also Read:  Triranga Club And Nirvana Sports Academy WinAlso Watch:","pubDate":"2022-03-20 10:27:42","full_description":"Our Sports Reporter GUWAHATI: WE R North East and Rangia Cricket Association earned full points in the 4th T20 Challenge Trophy held at Mangaldoi today. WE R North East beat Gyanjyoti Milan Sangha by 130 runs. 22 Yards Glory lost to Rangia Cricket Association in a well conteste game by 6 runs. Brief result: 1st match- We R North East 210-6 (20 overs), Jitu Ali 51, Dhruv Raj Borah 47 no, Ayshman Malakar 34 no, Gyanjyoti Milan Sangha 80-9 (18.4 overs), Sondeep Rabha 3-15. 2nd match: Rangia Cricket Association 164-3 (20 overs), Somyadeep Das 78, Neelav Sarma 40 no, 22 Yards glory 158-8 (20 overs), Bitop Mahanta 46, Prasanta Sonowal 35. Also Read: Triranga Club And Nirvana Sports Academy Win Also Watch:","image_url":"https://assets.sentinelassam.com/h-upload/2022/03/20/326756-crick.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"Narrow win for Tengapra in the final round of Assam Premier Club Cricket championship","link":"https://www.sentinelassam.com/north-east-india-news/local-sports/narrow-win-for-tengapra-in-the-final-round-of-assam-premier-club-cricket-championship-583588","keywords":["Sports,Local Sports"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"Tengapara Cricket club beat BDMTCCC in a well contested match by 4 runs in the final round of the Assam Premier Club Cricket championship held at Amingaon","content":"Our Sports ReporterGUWAHATI: Tengapara Cricket club beat BDMTCCC in a well contested match by 4 runs in the final round of the Assam Premier Club Cricket championship held at Amingaon today. Elected to bat, Tengapara Cricket club scored 131-9 in 20 overs. Raja Mallick and Moina scored 44 and 39 runs respectively while Rabi Chetry bagged 4 wickets. In reply Diptesh Saha (56) scored a half century but it was not enough for his team as a nice spell from Samrat Biswas (5-14) restricted BDMTCCC's innings 127-7 in 20 overs. Also Read:  Final Round Of Premier Club Cricket To Be Held From March 7 Also Watch:","pubDate":"2022-03-20 10:25:33","full_description":"Our Sports Reporter GUWAHATI: Tengapara Cricket club beat BDMTCCC in a well contested match by 4 runs in the final round of the Assam Premier Club Cricket championship held at Amingaon today. Elected to bat, Tengapara Cricket club scored 131-9 in 20 overs. Raja Mallick and Moina scored 44 and 39 runs respectively while Rabi Chetry bagged 4 wickets. In reply Diptesh Saha (56) scored a half century but it was not enough for his team as a nice spell from Samrat Biswas (5-14) restricted BDMTCCC's innings 127-7 in 20 overs. Also Read: Final Round Of Premier Club Cricket To Be Held From March 7 Also Watch:","image_url":"https://assets.sentinelassam.com/h-upload/2022/03/20/326755-cricket2.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"Shoaib Akhtar calls for unlimited bouncers, Bodyline to be legalised in Test cricket","link":"https://www.sentinelassam.com/sports/cricket/shoaib-akhtar-calls-for-unlimited-bouncers-bodyline-to-be-legalised-in-test-cricket-583584","keywords":["Sports,Cricket"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"Former Pakistan pace bowler Shoaib Akhtar has called for 'Bodyline' bowling to return to Test cricket","content":"KARACHI: Former Pakistan pace bowler Shoaib Akhtar has called for 'Bodyline' bowling to return to Test cricket and asked the International Cricket Council (ICC) to remove restrictions on the number of bouncers that can be bowled in the wake of two drawn Tests in the ongoing Pakistan v Australia three-match series.Akhtar, who has the fastest recorded legal delivery in Test cricket, added that modern-day cricketers are soft and that he wanted to hurt batsmen in his playing days. \"Nowadays, they (modern cricket players) are very soft. I don't think the aggression is as much there now. I don't know why. I'm old school, like Ian Chappell. I want unlimited bouncers. Bodyline bowling should be allowed. Why not? I want some character,\" Akhtar was quoted as saying by dailymail.co.uk on Saturday. Bodyline bowling has been outlawed for almost 90 years, and bowlers in Test cricket are restricted to two bouncers per over since 1994. Bodyline -- also called fast-leg theory bowling -- was employed by the English team during the 1932-33 Ashes. The tactics involved hurling the ball at the batsman's body, leaving him with the limited option of hitting straight to a fielder on the leg side or risk taking a nasty blow on the body. It was soon outlawed. But, with flat pitches being offered in the subcontinent, the West Indies and even in Australia, Akhtar has called for a return of Bodyline to give Test cricket 'character'. Recalled the infamous 2004/05 Test series in Australia in which he tried to unsettle Matthew Hayden, Justin Langer and Ricky Ponting, Akhtar said, \"I gave it to them. In the 2005 series, me and (Justin) Langer got into a fight. Me and (Matt) Hayden got into a fight. It's verbal, not physical. I wanted to display my talent (and show) that I am better than you. \"During the Test match, I thought (if nothing is happening) let's hurt somebody. That's why I bowled the fastest spell. I wanted to see if Ricky can match my pace and I was purposely bowling bouncers (to) see if I could beat him but before that I had never beaten him with my sheer pace. \"Had it not been Ricky Ponting… I would have chopped his (the batsman's) head off because it was furiously fast,\" added Akhtar. While not going so far as to demand Bodyline bowling to be legalised, players have demanded result-oriented pitches, which have something for the bowlers. Former Australian skipper Steven Smith has described the pitch for the opening Test in Rawalpindi as \"dead and benign\", while Ian Chappell wrote in his column for espncricinfo that, \"The last thing the five-day game needs is benign pitches, large first-innings scores, or distinctly uneven matches. Test cricket is a severely challenged format and for the game to prosper it requires serious consultation.\" Akhtar also said that he hopes someone would come along and break his record of 161.3 km/h. \"I genuinely want to believe that somebody should be out there who is ready to break my record. I'll be the first person to hug them,\" said Akhtar. IANS Also Read:  Shoaib Akhtar, Jayasuriya, Afridi included in Asia Lions teamAlso watch:","pubDate":"2022-03-20 10:15:37","full_description":"KARACHI: Former Pakistan pace bowler Shoaib Akhtar has called for 'Bodyline' bowling to return to Test cricket and asked the International Cricket Council (ICC) to remove restrictions on the number of bouncers that can be bowled in the wake of two drawn Tests in the ongoing Pakistan v Australia three-match series. Akhtar, who has the fastest recorded legal delivery in Test cricket, added that modern-day cricketers are soft and that he wanted to hurt batsmen in his playing days. \"Nowadays, they (modern cricket players) are very soft. I don't think the aggression is as much there now. I don't know why. I'm old school, like Ian Chappell. I want unlimited bouncers. Bodyline bowling should be allowed. Why not? I want some character,\" Akhtar was quoted as saying by dailymail.co.uk on Saturday. Bodyline bowling has been outlawed for almost 90 years, and bowlers in Test cricket are restricted to two bouncers per over since 1994. Bodyline -- also called fast-leg theory bowling -- was employed by the English team during the 1932-33 Ashes. The tactics involved hurling the ball at the batsman's body, leaving him with the limited option of hitting straight to a fielder on the leg side or risk taking a nasty blow on the body. It was soon outlawed. But, with flat pitches being offered in the subcontinent, the West Indies and even in Australia, Akhtar has called for a return of Bodyline to give Test cricket 'character'. Recalled the infamous 2004/05 Test series in Australia in which he tried to unsettle Matthew Hayden, Justin Langer and Ricky Ponting, Akhtar said, \"I gave it to them. In the 2005 series, me and (Justin) Langer got into a fight. Me and (Matt) Hayden got into a fight. It's verbal, not physical. I wanted to display my talent (and show) that I am better than you. \"During the Test match, I thought (if nothing is happening) let's hurt somebody. That's why I bowled the fastest spell. I wanted to see if Ricky can match my pace and I was purposely bowling bouncers (to) see if I could beat him but before that I had never beaten him with my sheer pace. \"Had it not been Ricky Ponting… I would have chopped his (the batsman's) head off because it was furiously fast,\" added Akhtar. While not going so far as to demand Bodyline bowling to be legalised, players have demanded result-oriented pitches, which have something for the bowlers. Former Australian skipper Steven Smith has described the pitch for the opening Test in Rawalpindi as \"dead and benign\", while Ian Chappell wrote in his column for espncricinfo that, \"The last thing the five-day game needs is benign pitches, large first-innings scores, or distinctly uneven matches. Test cricket is a severely challenged format and for the game to prosper it requires serious consultation.\" Akhtar also said that he hopes someone would come along and break his record of 161.3 km/h. \"I genuinely want to believe that somebody should be out there who is ready to break my record. I'll be the first person to hug them,\" said Akhtar. IANS Also Read: Shoaib Akhtar, Jayasuriya, Afridi included in Asia Lions team Also watch:","image_url":"https://assets.sentinelassam.com/h-upload/2022/03/20/326751-shaib.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"Jimmy Anderson not happy with England exclusion, keen to return 'later in the summer'","link":"https://www.sentinelassam.com/sports/cricket/jimmy-anderson-not-happy-with-england-exclusion-keen-to-return-later-in-the-summer-583583","keywords":["Sports,Cricket"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"England’s pace bowling stalwart Jimmy Anderson has not been able to come to terms with his omission from the Test squad for the three-match series against the West Indies","content":"LONDON: England's pace bowling stalwart Jimmy Anderson has not been able to come to terms with his omission from the Test squad for the three-match series against the West Indies currently underway in the Caribbean, and hopes to return to the side \"later in the summer\".Both Anderson and pace bowling partner Stuart Broad were surprisingly excluded for the West Indies tour following England's 4-0 thrashing in the Ashes series in Australia, although the two stalwarts bowled well and were therefore puzzling omissions. The 39-year-old Anderson and 35-year-old Broad were replaced by Chris Woakes and Craig Overton as interim England cricket chief Andrew Strauss said he was looking at \"exciting new bowling potential\". Speaking on boxing promoter Eddie Hearn's 'No Passion No Point' podcast, Anderson said that he will turn out for county side Lancashire in the interim but will continue aiming for England return. \"As long as I feel I can compete at the top level, then I want to do that. When that isn't the case, then I'll have to make a decision on what I do. Whether I play for England this year or not, it's a great opportunity to go back to Lancashire and play for them. \"I've had a central contract for 15 years or so now so I've not played a huge amount for them. So, actually giving something back to them would be nice and trying to help them win a Championship title,\" Anderson said in the podcast, reports dailymail.co.uk. Anderson is the highest wicket-taking pacer in Test history and the third-highest overall. \"I don't want to look too far ahead still, I'm thinking about the start of the season in April and at the minute I've got hunger and passion to play for Lancashire and hopefully that will take me on to England later in the summer,\" added Anderson. IANS Also Read:  Broad should be playing every Test match: Dominic CorkAlso watch:","pubDate":"2022-03-20 10:12:30","full_description":"LONDON: England's pace bowling stalwart Jimmy Anderson has not been able to come to terms with his omission from the Test squad for the three-match series against the West Indies currently underway in the Caribbean, and hopes to return to the side \"later in the summer\". Both Anderson and pace bowling partner Stuart Broad were surprisingly excluded for the West Indies tour following England's 4-0 thrashing in the Ashes series in Australia, although the two stalwarts bowled well and were therefore puzzling omissions. The 39-year-old Anderson and 35-year-old Broad were replaced by Chris Woakes and Craig Overton as interim England cricket chief Andrew Strauss said he was looking at \"exciting new bowling potential\". Speaking on boxing promoter Eddie Hearn's 'No Passion No Point' podcast, Anderson said that he will turn out for county side Lancashire in the interim but will continue aiming for England return. \"As long as I feel I can compete at the top level, then I want to do that. When that isn't the case, then I'll have to make a decision on what I do. Whether I play for England this year or not, it's a great opportunity to go back to Lancashire and play for them. \"I've had a central contract for 15 years or so now so I've not played a huge amount for them. So, actually giving something back to them would be nice and trying to help them win a Championship title,\" Anderson said in the podcast, reports dailymail.co.uk. Anderson is the highest wicket-taking pacer in Test history and the third-highest overall. \"I don't want to look too far ahead still, I'm thinking about the start of the season in April and at the minute I've got hunger and passion to play for Lancashire and hopefully that will take me on to England later in the summer,\" added Anderson. IANS Also Read: Broad should be playing every Test match: Dominic Cork Also watch:","image_url":"https://assets.sentinelassam.com/h-upload/2022/03/20/326750-jimmy.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"PAK vs AUS: Australia to field unchanged XI in decider Lahore Test, confirms Pat Cummins","link":"https://www.thehansindia.com/sports/pak-vs-aus-australia-to-field-unchanged-xi-in-decider-lahore-test-confirms-pat-cummins-734239","keywords":["Sports"],"creator":["Ishka"],"video_url":null,"description":"The second Test in Karachi ended in a drawThe series is currently at 0-0AUS and PAK are set to play decisive 3rd Test in Lahore","content":"Australia to field unchanged XI in decider Lahore Test, confirms Pat CumminsAustralia to field unchanged XI in decider Lahore Test, confirms Pat CumminsAustralia are set to field an unchanged side in the deciding third Test against Pakistan, starting Monday (March 21) in Lahore.It means pacer Josh Hazlewood will miss out on a second Test in a row. Spin duo Nathan Lyon and Mitchell Swepson has been backed to be at their best despite bowling more than 50 overs each in Pakistan's second innings last week in Karachi. It is understood that Lahore will have similar conditions as Karachi. Apart from Hazlewood, Australia have also overlooked Ashes hero Scott Boland, and all-rounder, Aston Agar. \"We were really happy with how all 11 players went last Test. Everyone has pulled up really well. We gave them an extra couple of days to make sure everyone has come up good. But there are no injury worries, everyone is freshened up, so we're confident in the XI. Only having two quick bowlers, I think reverse swing is going to be a big factor, and the way Starcy played last game was fantastic. It's always tough leaving out someone like Joshy, even Scotty Boland. But the class and the difference Starcy brings as a left-armer, a bit more air speed, we think that's the best chance to take 20 wickets,\" skipper Pat Cummins said on Sunday, according to cricket.com.au. After having a look at the pitch at the Gaddafi Stadium, Lahore, Cummins believes that the third Test will also see the batters dominate. \"There's not a lot of grass on it. I think it's had quite a lot of traffic throughout the PSL (Pakistan Super League) on it as well. It seems hard, but I can't see it being too much different from the other ones. We feel like we've got all bases covered if needed, whether it's reverse swing or swing later in the game,\" the Australian skipper explained further. The fast bowler also said that Australia's dominance throughout the second Test was testimony to the fact that their methods are correct. \"I think what's been clear … is the way we've gone about it is the right way. I've been really happy with how everyone has gone about their work (and) the tactics. I think it's just a matter of taking those chances. Wickets are at a premium in this series so you can't afford to drop too many chances. We created more than 10 chances (in the second innings in Karachi) we just, unfortunately, didn't take them, so that's going to be the challenge this week,\" added Cummins. View this post on Instagram A post shared by David Warner (@davidwarner31) The three-match Test is currently level at 0-0. A win in the third game will hand Australia their first Test series win on Asian soil since they beat Sri Lanka 1-0 in 2011.Australia XI: David Warner, Usman Khawaja, Marnus Labuschagne, Steve Smith, Travis Head, Cameron Green, Alex Carey (wk), Mitchell Starc, Pat Cummins (c), Mitchell Swepson, Nathan Lyon","pubDate":"2022-03-20 10:12:24","full_description":"Australia to field unchanged XI in decider Lahore Test, confirms Pat Cummins Australia are set to field an unchanged side in the deciding third Test against Pakistan, starting Monday (March 21) in Lahore. It means pacer Josh Hazlewood will miss out on a second Test in a row. Spin duo Nathan Lyon and Mitchell Swepson has been backed to be at their best despite bowling more than 50 overs each in Pakistan's second innings last week in Karachi. It is understood that Lahore will have similar conditions as Karachi. Apart from Hazlewood, Australia have also overlooked Ashes hero Scott Boland, and all-rounder, Aston Agar. \"We were really happy with how all 11 players went last Test. Everyone has pulled up really well. We gave them an extra couple of days to make sure everyone has come up good. But there are no injury worries, everyone is freshened up, so we're confident in the XI. Only having two quick bowlers, I think reverse swing is going to be a big factor, and the way Starcy played last game was fantastic. It's always tough leaving out someone like Joshy, even Scotty Boland. But the class and the difference Starcy brings as a left-armer, a bit more air speed, we think that's the best chance to take 20 wickets,\" skipper Pat Cummins said on Sunday, according to cricket.com.au. After having a look at the pitch at the Gaddafi Stadium, Lahore, Cummins believes that the third Test will also see the batters dominate. \"There's not a lot of grass on it. I think it's had quite a lot of traffic throughout the PSL (Pakistan Super League) on it as well. It seems hard, but I can't see it being too much different from the other ones. We feel like we've got all bases covered if needed, whether it's reverse swing or swing later in the game,\" the Australian skipper explained further. The fast bowler also said that Australia's dominance throughout the second Test was testimony to the fact that their methods are correct. \"I think what's been clear … is the way we've gone about it is the right way. I've been really happy with how everyone has gone about their work (and) the tactics. I think it's just a matter of taking those chances. Wickets are at a premium in this series so you can't afford to drop too many chances. We created more than 10 chances (in the second innings in Karachi) we just, unfortunately, didn't take them, so that's going to be the challenge this week,\" added Cummins. A post shared by David Warner (@davidwarner31) The three-match Test is currently level at 0-0. A win in the third game will hand Australia their first Test series win on Asian soil since they beat Sri Lanka 1-0 in 2011. Australia XI : David Warner, Usman Khawaja, Marnus Labuschagne, Steve Smith, Travis Head, Cameron Green, Alex Carey (wk), Mitchell Starc, Pat Cummins (c), Mitchell Swepson, Nathan Lyon","image_url":"https://assets.thehansindia.com/h-upload/2022/03/20/500x300_1282669-australia.jpg","source_id":"thehansindia","country":["india"],"category":["sports"],"language":"english"},{"title":"Australia opt to omit key bowler for 'grand final' - cricket.com.au","link":"https://news.google.com/__i/rss/rd/articles/CBMigAFodHRwczovL3d3dy5jcmlja2V0LmNvbS5hdS9uZXdzL2pvc2gtaGF6bGV3b29kLWF1c3RyYWxpYS1wYWtpc3Rhbi10aGlyZC10ZXN0LWxhaG9yZS1wYXQtY3VtbWlucy1iYWJhci1hemFtLWFsZXgtY2FyZXkvMjAyMi0wMy0yMNIBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Australia opt to omit key bowler for 'grand final'  cricket.com.auAussie heroes omitted for must-win Test  news.com.auAust unchanged for Test finale in Pakistan  Illawarra MercuryAussie players enjoy golf in Lahore  The News InternationalAussies name unchanged side for 3rd Test  Fox SportsView Full coverage on Google News","content":null,"pubDate":"2022-03-20 10:00:45","image_url":null,"source_id":"google","country":["australia"],"category":["sports"],"language":"english"},{"title":"Shane Warne funeral: Australian cricket legend's children lead tributes at private ceremony - Sky Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMijwFodHRwczovL3d3dy5za3lzcG9ydHMuY29tL2NyaWNrZXQvbmV3cy8xMjEyMy8xMjU3MDk4Mi9zaGFuZS13YXJuZS1mdW5lcmFsLWF1c3RyYWxpYW4tY3JpY2tldC1sZWdlbmRzLWNoaWxkcmVuLWxlYWQtdHJpYnV0ZXMtYXQtcHJpdmF0ZS1jZXJlbW9uedIBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Shane Warne funeral: Australian cricket legend's children lead tributes at private ceremony  Sky SportsShane Warne's son holds cricket ball and kisses his father's coffin  Daily MailShane Warne's children kiss his coffin at funeral as stars gather to send off cricket icon  The MirrorAustralian cricket superstar Warne honoured at private funeral | AFP  AFP News AgencyShane Warne funeral: Jackson kisses his father's coffin during funeral procession  Daily MailView Full coverage on Google News","content":null,"pubDate":"2022-03-20 09:36:04","image_url":null,"source_id":"google","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Injured England pacer Mark Wood out of IPL 2022","link":"https://www.sentinelassam.com/sports/cricket/injured-england-pacer-mark-wood-out-of-ipl-2022-583579","keywords":["Sports,Cricket"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"Fast bowler Mark Wood has been ruled out of IPL 2022 and the remainder of England's tour of the West Indies due to an elbow injury","content":"LONDON: Fast bowler Mark Wood has been ruled out of IPL 2022 and the remainder of England's tour of the West Indies due to an elbow injury, the England and Wales Cricket Board (ECB) said on Friday. Wood, who left the field due to the injury after sending down only five overs on day three of the first Test in Antigua, was set to play for newly-formed franchise Lucknow Super Giants in the IPL. Wood previously played for the Chennai Super Kings in 2018.\"Scan results have confirmed that Wood has a right elbow injury. He will return to the UK next week for a specialist opinion regarding the management of his injury,\" ECB said in a statement. Lucknow have not yet announced a replacement for Wood. AgenciesAlso Read:   Mark Wood ruled out of third Test Also watch:","pubDate":"2022-03-20 09:25:04","full_description":"LONDON: Fast bowler Mark Wood has been ruled out of IPL 2022 and the remainder of England's tour of the West Indies due to an elbow injury, the England and Wales Cricket Board (ECB) said on Friday. Wood, who left the field due to the injury after sending down only five overs on day three of the first Test in Antigua, was set to play for newly-formed franchise Lucknow Super Giants in the IPL. Wood previously played for the Chennai Super Kings in 2018. \"Scan results have confirmed that Wood has a right elbow injury. He will return to the UK next week for a specialist opinion regarding the management of his injury,\" ECB said in a statement. Lucknow have not yet announced a replacement for Wood. Agencies Also Read: Mark Wood ruled out of third Test Also watch:","image_url":"https://assets.sentinelassam.com/h-upload/2022/03/20/326747-mark.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"Shakib Al Hasan shines as Bangladesh claim first ever win in South Africa","link":"https://www.sentinelassam.com/sports/cricket/shakib-al-hasan-shines-as-bangladesh-claim-first-ever-win-in-south-africa-583575","keywords":["Sports,Cricket"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"All-rounder Shakib Al Hasan scored a superb 77 as Bangladesh claimed their first ever victory in South Africa with a 38-run win in the first One-Day International at Centurion Park","content":"CENTURION: All-rounder Shakib Al Hasan scored a superb 77 as Bangladesh claimed their first ever victory in South Africa with a 38-run win in the first One-Day International at Centurion Park on Friday.The visitors amassed an impressive 314 for seven in their 50 overs after being sent in to bat. South Africa were always battling in their reply and could only manage 276 all out in 48.5 overs as they slipped to a comprehensive defeat. It is the first time in six Tests, nine ODIs and four T20s that Bangladesh have won in South Africa, a further blow to the hosts in the ICC's ODI Cricket World Cup Super League as they languish in 10th and Bangladesh remain the surprise leaders. The leading eight sides will qualify automatically for the World Cup in India next year. Shakib, who had initially been rested for the tour but later joined the squad, anchored the Bangladesh innings with an attacking 77 from 64 balls while opener Litton Das and Yasir Ali, who both scored exactly 50, provided excellent support. Rassie van der Dussen (86) and David Miller (79) kept South Africa interest alive until the final 10 overs but brilliant seam bowling by Taskin Ahmed (3-36) and the wily spin of Mehidy Hasan Miraz (4-61) laid the platform for the visitors' win. The second match in the three-game series will be played in Johannesburg on Sunday, before the teams return to Pretoria for the finale on Wednesday. Brief scores: Bangladesh 314/7 in 50 overs (Tamim Iqbal 41, Litton Das 50, Shakib Al Hasan 77, Yasir Ali 50; Marco Jansen 2/57, Keshav Maharaj 2/56) beat South Africa 276 in 48.5 overs (Temba Bavuma 31, Rassie van der Dussen 86, David Miller 79; Shoriful Islam 2/47, Taskin Ahmed 3/36, Mehidy Hasan Miraz 4/61) by 38 runs. Agencies Also Read:  Shakib Al Hasan available to play for South Africa tourAlso watch:","pubDate":"2022-03-20 09:11:44","full_description":"CENTURION: All-rounder Shakib Al Hasan scored a superb 77 as Bangladesh claimed their first ever victory in South Africa with a 38-run win in the first One-Day International at Centurion Park on Friday. The visitors amassed an impressive 314 for seven in their 50 overs after being sent in to bat. South Africa were always battling in their reply and could only manage 276 all out in 48.5 overs as they slipped to a comprehensive defeat. It is the first time in six Tests, nine ODIs and four T20s that Bangladesh have won in South Africa, a further blow to the hosts in the ICC's ODI Cricket World Cup Super League as they languish in 10th and Bangladesh remain the surprise leaders. The leading eight sides will qualify automatically for the World Cup in India next year. Shakib, who had initially been rested for the tour but later joined the squad, anchored the Bangladesh innings with an attacking 77 from 64 balls while opener Litton Das and Yasir Ali, who both scored exactly 50, provided excellent support. Rassie van der Dussen (86) and David Miller (79) kept South Africa interest alive until the final 10 overs but brilliant seam bowling by Taskin Ahmed (3-36) and the wily spin of Mehidy Hasan Miraz (4-61) laid the platform for the visitors' win. The second match in the three-game series will be played in Johannesburg on Sunday, before the teams return to Pretoria for the finale on Wednesday. Brief scores: Bangladesh 314/7 in 50 overs (Tamim Iqbal 41, Litton Das 50, Shakib Al Hasan 77, Yasir Ali 50; Marco Jansen 2/57, Keshav Maharaj 2/56) beat South Africa 276 in 48.5 overs (Temba Bavuma 31, Rassie van der Dussen 86, David Miller 79; Shoriful Islam 2/47, Taskin Ahmed 3/36, Mehidy Hasan Miraz 4/61) by 38 runs. Agencies Also Read: Shakib Al Hasan available to play for South Africa tour Also watch:","image_url":"https://assets.sentinelassam.com/h-upload/2022/03/20/326742-shakib.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"Meg Lanning shines as Australia beat India, enter semis","link":"https://www.sentinelassam.com/sports/cricket/meg-lanning-shines-as-australia-beat-india-enter-semis-583574","keywords":["Sports,Cricket"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"Captain Meg Lanning led from the front as Australia entered the semifinals of the ICC Women’s Cricket World Cup with a six-wicket win over India at Eden Park","content":"AUCKLAND: Captain Meg Lanning led from the front as Australia entered the semifinals of the ICC Women's Cricket World Cup with a six-wicket win over India at Eden Park on Saturday.After Mithali Raj, Yastika Bhatia and Harmanpreet Kaur slammed fifties to help India post a competitive 277/7 in 50 overs, Australia chased down the total with three balls to spare and also the highest successful chase in the history of the tournament. Lanning led the controlled chase with 97 off 107 balls, laced with 13 boundaries in an innings where she collected runs and pierced gaps through point region for fun. But it was the opening partnership of 121 between Alyssa Healy (72) and Rachael Haynes (43) which set the tone for Australia's unbeaten run in the showpiece event apart from young pacer Darcie Brown taking 3/30 in eight overs. Australia began by picking nine boundaries in power-play, six of which were hammered by Alyssa Healy while three belonged to Rachael Haynes. Healy took charge of the chase from the word go, hitting boundaries against pacers Jhulan Goswami and Meghna Singh effortlessly via drives, flick, late steer and pull. Haynes, on the other hand, swept and sliced Rajeshwari Gayakwad for boundaries before signing off from power-play with a pull off Pooja Vastrakar. Healy then reached her 14th ODI fifty in 49 balls. The desperation was such from India to get a breakthrough that they emptied their quota of DRS reviews within first 17 overs of defending 277. Healy swept Gayakwad twice for boundaries but in an attempt to reverse-sweep off Sneh Rana, the right-handed batter picked out short third man, falling for 72 as the 121-run opening partnership came to an end. In the next over, Haynes departed at 43, giving a faint outer edge to keeper Richa Ghosh on a hook off Vastrakar. But captain Meg Lanning kept the scoreboard ticking with her creamy drives and punches while placing the cuts elegantly through square region on the off-side. Lanning fell three short of her 15th ODI century, slicing straight to point off Meghna. With eight needed off the final over, Mooney elegantly lofted Goswami over mid-wicket for four and then took two runs via drive through deep cover, followed by a four down the ground to maintain their clean slate in the tournament. Earlier, skipper Mithali Raj and number three Yastika Bhatia's 130-run stand built the platform before an unbeaten 57 off 47 balls from Harmanpreet and 28-ball 34 from Vastrakar took India to 277/7 as 77 runs came off last 10 overs. Australia weren't the best on the field nor with the ball as they conceded 29 extras, including 24 wides. India didn't have a great start in power-play, losing Smriti Mandhana and Shafali Verma to Brown in the first six overs. While Mandhana drove away from the body and nicked to slip, Verma's slash was snapped by Beth Mooney diving full length for a one-handed stunner at gully. Mithali and Yastika joined forces to stabilize India's innings, helped by Australia leaking runs. A total of 16 runs from the 12th over of Ellyse Perry got Mithali and Yastika to settle down without taking any further risk. Mithali, under pressure due to a lean run in the tournament, was a busy customer at the crease, getting her singles and made use of pace to get boundaries through square region in off-side. She looked delightful with the cover drive and used her feet well to slam a six down the ground. Yastika, more aggressive of the two, struck delightful boundaries and ensured the scoreboard was ticking. The duo reached their respective fifties in 77 balls to set the platform for a big total. But Yastika fell in the 32nd over, picking out deep backward point off Brown. Six overs later, Mithali didn't get the required elevation on slog-sweep and holed out to deep mid-wicket off leg-spinner Alana King. With Richa Ghosh stumped off Alana King and Sneh Rana bowled by Jess Jonassen, India were in trouble at 213/6 with almost eight overs left. But Harmanpreet and Pooja produced the big hits to put up a crucial stand of 64 off just 47 balls. Brief Scores: India 277/7 in 50 overs (Mithali Raj 68, Yastika Bhatia 59; Darcie Brown 3/30, Alana King 2/52) lost to Australia 280/4 in 49.3 overs (Meg Lanning 97, Alyssa Healy 72; Pooja Vastrakar 2/43, Sneh Rana 1/56) by six wickets. Also read:  South Africa beat New Zealand In ICC Women's Cricket World Cup clashAlso watch:","pubDate":"2022-03-20 09:09:12","full_description":"AUCKLAND: Captain Meg Lanning led from the front as Australia entered the semifinals of the ICC Women's Cricket World Cup with a six-wicket win over India at Eden Park on Saturday. After Mithali Raj, Yastika Bhatia and Harmanpreet Kaur slammed fifties to help India post a competitive 277/7 in 50 overs, Australia chased down the total with three balls to spare and also the highest successful chase in the history of the tournament. Lanning led the controlled chase with 97 off 107 balls, laced with 13 boundaries in an innings where she collected runs and pierced gaps through point region for fun. But it was the opening partnership of 121 between Alyssa Healy (72) and Rachael Haynes (43) which set the tone for Australia's unbeaten run in the showpiece event apart from young pacer Darcie Brown taking 3/30 in eight overs. Australia began by picking nine boundaries in power-play, six of which were hammered by Alyssa Healy while three belonged to Rachael Haynes. Healy took charge of the chase from the word go, hitting boundaries against pacers Jhulan Goswami and Meghna Singh effortlessly via drives, flick, late steer and pull. Haynes, on the other hand, swept and sliced Rajeshwari Gayakwad for boundaries before signing off from power-play with a pull off Pooja Vastrakar. Healy then reached her 14th ODI fifty in 49 balls. The desperation was such from India to get a breakthrough that they emptied their quota of DRS reviews within first 17 overs of defending 277. Healy swept Gayakwad twice for boundaries but in an attempt to reverse-sweep off Sneh Rana, the right-handed batter picked out short third man, falling for 72 as the 121-run opening partnership came to an end. In the next over, Haynes departed at 43, giving a faint outer edge to keeper Richa Ghosh on a hook off Vastrakar. But captain Meg Lanning kept the scoreboard ticking with her creamy drives and punches while placing the cuts elegantly through square region on the off-side. Lanning fell three short of her 15th ODI century, slicing straight to point off Meghna. With eight needed off the final over, Mooney elegantly lofted Goswami over mid-wicket for four and then took two runs via drive through deep cover, followed by a four down the ground to maintain their clean slate in the tournament. Earlier, skipper Mithali Raj and number three Yastika Bhatia's 130-run stand built the platform before an unbeaten 57 off 47 balls from Harmanpreet and 28-ball 34 from Vastrakar took India to 277/7 as 77 runs came off last 10 overs. Australia weren't the best on the field nor with the ball as they conceded 29 extras, including 24 wides. India didn't have a great start in power-play, losing Smriti Mandhana and Shafali Verma to Brown in the first six overs. While Mandhana drove away from the body and nicked to slip, Verma's slash was snapped by Beth Mooney diving full length for a one-handed stunner at gully. Mithali and Yastika joined forces to stabilize India's innings, helped by Australia leaking runs. A total of 16 runs from the 12th over of Ellyse Perry got Mithali and Yastika to settle down without taking any further risk. Mithali, under pressure due to a lean run in the tournament, was a busy customer at the crease, getting her singles and made use of pace to get boundaries through square region in off-side. She looked delightful with the cover drive and used her feet well to slam a six down the ground. Yastika, more aggressive of the two, struck delightful boundaries and ensured the scoreboard was ticking. The duo reached their respective fifties in 77 balls to set the platform for a big total. But Yastika fell in the 32nd over, picking out deep backward point off Brown. Six overs later, Mithali didn't get the required elevation on slog-sweep and holed out to deep mid-wicket off leg-spinner Alana King. With Richa Ghosh stumped off Alana King and Sneh Rana bowled by Jess Jonassen, India were in trouble at 213/6 with almost eight overs left. But Harmanpreet and Pooja produced the big hits to put up a crucial stand of 64 off just 47 balls. Brief Scores: India 277/7 in 50 overs (Mithali Raj 68, Yastika Bhatia 59; Darcie Brown 3/30, Alana King 2/52) lost to Australia 280/4 in 49.3 overs (Meg Lanning 97, Alyssa Healy 72; Pooja Vastrakar 2/43, Sneh Rana 1/56) by six wickets. Also read: South Africa beat New Zealand In ICC Women's Cricket World Cup clash Also watch:","image_url":"https://assets.sentinelassam.com/h-upload/2022/03/20/326741-lann.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"Shane Warne's children lead tributes at cricket legend's funeral","link":"https://www.skysports.com/cricket/news/12040/12570982/shane-warne-funeral-australian-cricket-legends-children-lead-tributes-at-private-ceremony","keywords":null,"creator":null,"video_url":null,"description":"Shane Warne's three children Brooke, Jackson and Summer led the private funeral service for the Australia cricketing great in Melbourne on Sunday.","content":null,"pubDate":"2022-03-20 09:00:00","full_description":"Last Updated: 20/03/22 9:30am Shane Warne's three children Brooke, Jackson and Summer led the private funeral service for the Australia cricketing great in Melbourne on Sunday. The invite-only event was attended by around 100 family and friends, including former England captain Michael Vaughan, ex-Australia captains Michael Clarke, Mark Taylor and Allan Border. Warne was an avid Australian Football League (AFL) supporter and a huge fan of team St Kilda, with the service held at the team's home ground. Television presenter Eddie McGuire, who anchors AFL show Fox Footy, hosted the service, which was also attended by former AFL greats. McGuire described Warne as \"Superman\" and in quotes reported by the Daily Mail added: \"You threw the ball to Warne, you sat in that (Melbourne Cricket Ground) Southern Stand and he did the things you dreamt of doing as a kid. \"The magic part about Shane Warne was that he sprinkled his gold dust everywhere he went.\" Please use Chrome browser for a more accessible video player Former AFL player Sam Newman also paid tribute along with entertainer Glenn Robbins, who Warne worked alongside on comedy show Kath and Kim. A lap of honour was carried out there before the service. Warne's former girlfriend, British actress Liz Hurley, was unable to attend the funeral due to work commitments. Hurley, 56, said on Instagram: \"My heart aches that I can't be in Australia for Shane's funeral. I was filming and, with the time jump, physically can't get there. It still hasn't really sunk in that he's gone.\" Around 50,000 cricket fans are expected to fill the MCG on March 30 for Warne's state memorial. Tickets for the event are expected to be made available to the public in the coming days. It has been reported that Sir Elton John will perform live via video link for the state funeral and that other video tributes will include performances from Ed Sheeran and Coldplay's Chris Martin. Warne shot to global fame with the 'ball of the century' to bamboozle and dismiss Mike Gatting in the 1993 Ashes series against England. He went on to claim 708 Test wickets, the second-highest in history, in a 15-year career spanning 145 matches and also took 293 one-day international wickets, helping Australia win the 1999 World Cup.","image_url":"https://e0.365dm.com/22/03/1920x1080/skysports-cricket-shane-warne_5694557.jpg?20220304204145","source_id":"skysports","country":["united states of america","united kingdom","australia"],"category":["sports"],"language":"english"}]}