{"newsArray":[{"title":"Yorkshire set to learn recommended sanctions for mishandling Azeem Rafiq case","link":"https://www.watfordobserver.co.uk/sport/national/23615720.yorkshire-set-learn-recommended-sanctions-mishandling-azeem-rafiq-case/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"The CDC panel will deliver its final sanctions at a later date.","content":"The England and Wales Cricket Board will make its sanctioning recommendations to an independent Cricket Discipline Commission (CDC) panel, with Yorkshire having admitted to four charges in February related to the mishandling of Rafiq’s case, the deletion of documents related to it and a failure to address the use of racist language at the club over a prolonged period. Yorkshire will then offer up arguments in mitigation to the panel, which will deliver the final sanctions at a later date. Update on charges against Yorkshire CCC and others — England and Wales Cricket Board (@ECB_cricket) Yorkshire released a statement on Monday which read: “In making representations to the CDC panel, we hope to achieve a reasonable sanction which takes into account our acceptance of the charges, YCCC’s current financial position and the robust work we have undertaken to build the foundations for a club which is truly inclusive and welcoming to all. “Over the past year and a half, the reputational and financial impact of the racism crisis included the loss of sponsors and the removal of the privilege of hosting international cricket at Headingley, which was reinstated following the club demonstrating adherence to a stringent 10-point plan outlined by the ECB. “We hope that any sanctions are reflective of the circumstances the club is in today and do not serve to hinder our ongoing commitment to create a brighter future for all associated with Yorkshire.” Any financial sanctions could hit the club hard, with Yorkshire chief executive Stephen Vaughan highlighting to members at the annual general meeting in March that there was a £3.5million cash shortfall this year and the need to repay £14.9m to the Graves Trust. The club said last week they were still having “positive conversations” around the long-term financial future of the club and would make an announcement “in due course”. Six former Yorkshire employees were sanctioned in May as part of the same case, with all of them found to have used the word “P***”. A seventh, former England captain Michael Vaughan, was cleared in March of using racist and/or discriminatory language towards a group of four players of Asian ethnicity, including Rafiq, before a Twenty20 match in 2009. The Yorkshire hearing coincides with the long-awaited publication of the Independent Commission for Equity in Cricket (ICEC) report. It has found racism remains “entrenched” within the sport in England and Wales.","pubDate":"2023-06-27 03:33:13","image_url":"https://www.watfordobserver.co.uk/resources/images/16932459/?type=app&htype=0","source_id":"watfordobserver","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Yorkshire set to learn recommended sanctions for mishandling Azeem Rafiq case","link":"https://www.independent.co.uk/sport/cricket/yorkshire-azeem-rafiq-cdc-michael-vaughan-london-b2364662.html","keywords":["Cricket","Sport"],"creator":["Jamie Gardner"],"video_url":null,"description":"The CDC panel will deliver its final sanctions at a later date.","content":"Yorkshire have called for “reasonable” sanctions as they face a key hearing in London today over their handling of the Azeem Rafiq case. The England and Wales Cricket Board will make its sanctioning recommendations to an independent Cricket Discipline Commission (CDC) panel, with Yorkshire having admitted to four charges in February related to the mishandling of Rafiq’s case, the deletion of documents related to it and a failure to address the use of racist language at the club over a prolonged period. Yorkshire will then offer up arguments in mitigation to the panel, which will deliver the final sanctions at a later date. Yorkshire released a statement on Monday which read: “In making representations to the CDC panel, we hope to achieve a reasonable sanction which takes into account our acceptance of the charges, YCCC’s current financial position and the robust work we have undertaken to build the foundations for a club which is truly inclusive and welcoming to all. “Over the past year and a half, the reputational and financial impact of the racism crisis included the loss of sponsors and the removal of the privilege of hosting international cricket at Headingley, which was reinstated following the club demonstrating adherence to a stringent 10-point plan outlined by the ECB. “We hope that any sanctions are reflective of the circumstances the club is in today and do not serve to hinder our ongoing commitment to create a brighter future for all associated with Yorkshire.” Any financial sanctions could hit the club hard, with Yorkshire chief executive Stephen Vaughan highlighting to members at the annual general meeting in March that there was a £3.5million cash shortfall this year and the need to repay £14.9m to the Graves Trust. The club said last week they were still having “positive conversations” around the long-term financial future of the club and would make an announcement “in due course”. Six former Yorkshire employees were sanctioned in May as part of the same case, with all of them found to have used the word “P***”. A seventh, former England captain Michael Vaughan , was cleared in March of using racist and/or discriminatory language towards a group of four players of Asian ethnicity, including Rafiq, before a Twenty20 match in 2009. The Yorkshire hearing coincides with the long-awaited publication of the Independent Commission for Equity in Cricket (ICEC) report. It has found racism remains “entrenched” within the sport in England and Wales.","pubDate":"2023-06-27 03:30:16","image_url":"https://static.independent.co.uk/2023/06/27/04/f515dd5c639dede59a5e183bbde71ae1Y29udGVudHNlYXJjaGFwaSwxNjg3ODcxMDcz-2.71578498.jpg?width=1200&auto=webp","source_id":"independentuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"WI vs IND: ये दो धारी तलवार है, सिलेक्शन विवाद पर सरफराज खान को मिली जिंदगी बदलने वाली सलाह","link":"https://navbharattimes.indiatimes.com/sports/cricket/cricket-news/dodda-ganesh-double-edged-sword-advice-to-sarfaraz-khan-on-blockbuster-reaction-on-test-snub/articleshow/101292921.cms","keywords":null,"creator":null,"video_url":null,"description":"विंडीज दौरे के लिए टेस्ट टीम में शामिल नहीं किए जाने को लेकर सरफराज खान ने इंस्टाग्राम पर प्रतिक्रिया दी थी। इसके बाद भूचाल सा आ गया। अब इस पर पूर्व भारतीय क्रिकेटर ने युवा बल्लेबाज को बड़ी सलाह दी है।","content":"सोशल मीडिया उपलब्धि पर खुशी या विफलता पर निराशा व्यक्त करने का सबसे बड़ा मंच बन गया है। पिछले कुछ वर्षों में खिलाड़ी इस प्लेटफॉर्म का इस्तेमाल अपनी बात रखने के लिए करते नजर आए हैं। ट्विटर, इंस्टाग्राम या फेसबुक पर की गई एक पोस्ट से फैंस अपने हीरो की स्थिति का अंदाजा लगा लेते हैं। सोशल मीडिया कई बार अच्छे मेसेज पहुंचाता है तो कई बार यहां रिएक्ट करना भारी भी पड़ जाता है। अब को ही ले लीजिए। सरफराज खान को तब 2023 में तीसरी बार नजरअंदाज कर दिया गया जब बीसीसीआई ने वेस्टइंडीज में दो टेस्ट मैचों की सीरीज के लिए 16 सदस्यीय टीम की घोषणा की थी। इसके बाद सरफराज ने सोशल मीडिया पर एक अपने रिकॉर्ड पर पोस्ट किया, जबकि सुनील गावस्कर सहित कई क्रिकेटर पहले ही उनके पक्ष में थे। इस क्रिप्टिक मेसेज के बाद लगातार उनका एक वीडियो वायरल होने लगा, जिसमें वह एग्रेसिव जश्न मनाते दिख रहे थे। इस पर तरह-तरह के निगेटिव दावे किए गए। पिछले साल बांग्लादेश दौरे के लिए नजरअंदाज किए जाने के बाद सरफराज को घरेलू सरजमीं पर बॉर्डर-गावस्कर सीरीज, लंदन में डब्ल्यूटीसी फाइनल और अब वेस्टइंडीज सीरीज के लिए इसी तरह के भाग्य का सामना करना पड़ा। उनकी किस्मत ऐसी रही कि पिछले तीन वर्षों में रणजी ट्रॉफी में ढेर सारे रन बनाने के बावजूद वह इस महीने की शुरुआत में ओवल मुकाबले के लिए स्टैंडबाय सूची में भी नहीं थे। वेस्टइंडीज दौरे के लिए टेस्ट में नहीं शामिल करने पर सरफराज ने इंस्टाग्राम पर 2022/23 रणजी ट्रॉफी सीजन के अपने हाइलाइट्स का एक वीडियो साझा किया था, जहां उन्होंने तीन शतक बनाए थे। किसी कैप्शन की आवश्यकता नहीं थी, लेकिन ब्लॉकबस्टर प्रतिक्रिया तुरंत पूरे सोशल मीडिया पर वायरल हो गई।इस पर भारत के पूर्व क्रिकेटर डोड्डा गणेश ने इस युवा खिलाड़ी को सलाह देते हुए इस पर प्रतिक्रिया व्यक्त की। उन्होंने ट्वीट किया- युवाओं को मेरी एक ही सलाह है: जब आपको नजरअंदाज किया जाए तो कृपया निराशा को अपने ऊपर हावी न होने दें। सोशल मीडिया एक दोधारी तलवार है। इसे बुद्धिमानी से उपयोग करें। अपने पिछले तीन रणजी ट्रॉफी सीजन में सरफराज ने 2566 रन बनाए। उन्होंने 2019/20 सीजन में 928 रन, 2022-23 में 982 और 2022-23 सीजन में 656 रन बनाए। इस आश्चर्यजनक रन ने उनके करियर की प्रथम श्रेणी औसत को 79.65 तक पहुंचा दिया, जो किसी भारतीय बल्लेबाज द्वारा सबसे अधिक और 37 मैचों में महानतम डॉन ब्रैडमैन (न्यूनतम 50 पारियों) के बाद दूसरा है। फिर भी मुंबई के बल्लेबाज को वेस्टइंडीज सीरीज के लिए रुतुराज गायकवाड़ को चुना गया, जिनका करियर औसत 42 से अधिक है।","pubDate":"2023-06-27 03:13:59","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Commission head highlights ‘rotten’ cricket culture in wake of report","link":"https://www.watfordobserver.co.uk/sport/national/23615718.commission-head-highlights-rotten-cricket-culture-wake-report/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"The ICEC Holding Up A Mirror report on cricket concluded there is racism, sexism and misogyny within the sport.","content":"Ms Butts told the BBC the report found widespread issues in the English and Welch game. “We heard of women being constantly stereotyped, demeaned, facing predatory behaviour,” she said. “We heard from women who are having to walk into scoreboxes and face signs that say ‘no bras allowed’. This is 2023, not 1923.” More than 4,000 people responded to the ICEC’s call for evidence for the Holding Up A Mirror To Cricket report. The commission made 44 recommendations, including a call for the England and Wales Cricket Board to make a public apology recognising that racism, sexism, elitism and class-based discrimination existed – and still exist – and recognise the impact of that upon victims. “We heard from a former Muslim player who had to endure the indignity of his team-mates laughing and joking about one of the players using the prayer mat to clean up after sex,” she said. “The stories were absolutely horrific and it goes to show that the culture in cricket is rotten.” Ms Butts said women are treated as “subordinate” to men in the sport and have been subjected to harassment. “What we’ve seen is that women are vulnerable when around a drinking culture, they are subjected to sexual harassment, lots of sexting,” she said. “We’ve heard from a number of women who talk about being vulnerable and being exposed and having unwanted advances made on them by men.” In a letter to her, ECB chair Richard Thompson apologised and said: “We will use this moment to reset cricket.” “Cricket should never exclude anyone on the basis of their ethnicity, gender or social background,” Mr Thompson said. “We apologise unreservedly for these experiences, and are thankful for the courage of those who have shared them with the ICEC, whilst recognising there will be many more who felt unable to give their accounts.” Among the recommendations is a call for a fundamental overhaul of the pay structure in the women’s professional game and equal representation for the women’s game throughout the governance structure of English and Welsh cricket.","pubDate":"2023-06-27 03:13:45","image_url":"https://www.watfordobserver.co.uk/resources/images/16932456/?type=app&htype=0","source_id":"watfordobserver","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Commission head highlights ‘rotten’ cricket culture in wake of report","link":"https://www.independent.co.uk/sport/cricket/richard-thompson-michael-collins-brendan-barber-english-cricket-b2364656.html","keywords":["Cricket","Sport"],"creator":["Cormac Pearson"],"video_url":null,"description":"The ICEC Holding Up A Mirror report on cricket concluded there is racism, sexism and misogyny within the sport.","content":"The chair of the Independent Commission for Equity in Cricket (ICEC) Cindy Butts said she heard “horrific” stories during a report which investigated racism, sexism and misogyny in Cricket. Ms Butts told the BBC the report found widespread issues in the English and Welch game. “We heard of women being constantly stereotyped, demeaned, facing predatory behaviour,” she said. “We heard from women who are having to walk into scoreboxes and face signs that say ‘no bras allowed’. This is 2023, not 1923.” More than 4,000 people responded to the ICEC’s call for evidence for the Holding Up A Mirror To Cricket report. The commission made 44 recommendations, including a call for the England and Wales Cricket Board to make a public apology recognising that racism, sexism, elitism and class-based discrimination existed – and still exist – and recognise the impact of that upon victims. “We heard from a former Muslim player who had to endure the indignity of his team-mates laughing and joking about one of the players using the prayer mat to clean up after sex,” she said. “The stories were absolutely horrific and it goes to show that the culture in cricket is rotten.” Ms Butts said women are treated as “subordinate” to men in the sport and have been subjected to harassment. “What we’ve seen is that women are vulnerable when around a drinking culture, they are subjected to sexual harassment, lots of sexting,” she said. “We’ve heard from a number of women who talk about being vulnerable and being exposed and having unwanted advances made on them by men.” In a letter to her, ECB chair Richard Thompson apologised and said: “We will use this moment to reset cricket.” “Cricket should never exclude anyone on the basis of their ethnicity, gender or social background,” Mr Thompson said. “We apologise unreservedly for these experiences, and are thankful for the courage of those who have shared them with the ICEC, whilst recognising there will be many more who felt unable to give their accounts.” Among the recommendations is a call for a fundamental overhaul of the pay structure in the women’s professional game and equal representation for the women’s game throughout the governance structure of English and Welsh cricket.","pubDate":"2023-06-27 03:06:40","image_url":"https://static.independent.co.uk/2023/06/27/04/dce57169a0976a18dfa0220b3d3796c6Y29udGVudHNlYXJjaGFwaSwxNjg3OTE5MTY4-2.43477530.jpg?width=1200&auto=webp","source_id":"independentuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Team India: NCA में लगी महफिल, पुराने दोस्तों से मिले ऋषभ पंत, शेयर की दिल छू लेने वाली तस्वीरें","link":"https://navbharattimes.indiatimes.com/sports/cricket/cricket-news/rishabh-pant-reunited-with-team-india-players-at-nca-photo-viral/articleshow/101292617.cms","keywords":null,"creator":null,"video_url":null,"description":"टीम इंडिया के स्टार विकेटकीपर बल्लेबाज ऋषभ पंत सोशल मीडिया पर काफी एक्टिव रहते हैं। वह आए दिन कुछ ना कुछ अपने फैंस के साथ साझा करते रहते हैं।","content":"भारतीय क्रिकेट टीम इन दिनों छुट्टी पर चल रही है। वर्ल्ड टेस्ट चैंपियनशिप 2023 के फाइनल के बाद से टीम इंडिया के प्लेयर्स आराम कर रहे हैं। कुछ खिलाड़ी छुट्टियों का आनंद ले रहे हैं तो कुछ अपनी फिटनेस पर मेहनत कर रहे हैं। वहीं कुछ चोटिल भारतीय खिलाड़ी मौजूदा वक्त में बेंगलुरु में स्थित नेशनल क्रिकेट अकेडमी में हैं, जिसमें और केएल राहुल भी हैं। जबकि कुछ प्लेयर्स आने वाली वेस्टइंडीज सीरीज के लिए वहां अपनी तैयारियां कर रहे हैं। ऐसे में एक बार फिर कुछ पुराने यार एक साथ नजर आए हैं। भारतीय क्रिकेट टीम के स्टार विकेटकीपर बल्लेबाज ऋषभ पंत पिछले 6 महीने से क्रिकेट से दूर चल रहे हैं। उनका दिसंबर 2022 के अंत में भयानक कार एक्ससीडेंट हुआ था, जिसके चलते वह काफी ज्यादा चोटिल हो गए थे। हालांकि सर्जरी के बाद से पंत तेजी से रिकवर कर रहे हैं। इसी के साथ पंत की मुलाकात नेशनल क्रिकेट अकेडमी में केएल राहुल, मोहम्मद सिराज, युजवेंद्र चहल और शार्दुल ठाकुर से हुई। आपस में सब काफी खुश नजर आ रहे थे। पंत ने खुद इस खास मुलाकात की तस्वीरें सोशल मीडिया के सबसे चर्चित प्लेटफॉर्म ट्विटर पर शेयर की हैं, जिसकी केप्शन में उन्होंने लिखा है, 'गैंग के साथ रीयूनियन करना हमेशा मजेदार रहता है। उनकी यह पोस्ट इस वक्त चर्चा में भी है। अगले महीने यानी जुलाई में टीम इंडिया वेस्टइंडीज जाएगी। जहां वह कैरेबियाई टीम के साथ 2 टेस्ट, 3 वनडे और 5 टी20 मुकाबले खेलने वाले हैं। दौरे की शुरुआत 12 जुलाई को टेस्ट मैच के साथ होगी। बीसीसीआई ने वेस्टइंडीज टूर के लिए भारत की टेस्ट और वनडे टीम की घोषणा भी कर दी है। रोहित शर्मा (कप्तान), शुभमन गिल, ऋतुराज गायकवाड़, विराट कोहली, यशस्वी जायसवाल, अजिंक्य रहाणे, केएस भरत, ईशान किशन, रविचंद्रन अश्विन, रविंद्र जडेजा, अक्षर पटेल, शार्दुल ठाकुर, नवदीप सैनी, जयदेव उनादकट, मोहममद सिराज और मुकेश कुमार। रोहित शर्मा (कप्तान), शुभमन गिल, ऋतुराज गायकवाड़, विराट कोहली, सूर्यकुमार यादव, संजू सेमसन, ईशान किशन, हार्दिक पंड्या, शार्दुल ठाकुर, रविंद्र जडेजा, अक्षर पटेल, युजवेंद्र चहल, कुलदीप यादव, जयदेव उनादकट, मोहममद सिराज, उमरान मलिक और मुकेश कुमार।","pubDate":"2023-06-27 02:31:23","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Sarfaraz Khan: सरफराज करेंगे सिलेक्टर्स के बुलावे का इंतजार, नजरअंदाज होने के बाद डोमेस्टिक सीजन में फिर बनेंगे आग","link":"https://navbharattimes.indiatimes.com/sports/cricket/cricket-news/sarfaraz-khan-getting-ready-for-duleep-trophy-waiting-for-selectors-call-again/articleshow/101291698.cms","keywords":null,"creator":null,"video_url":null,"description":"मुंबई के युवा बल्लेबाज सरफराज खान घरेलू क्रिकेट में जमकर रन बना रहे हैं। लेकिन इसके बावजूद उन्हें भारतीय टीम के चयनकर्ता लगातार नजरअंदाज कर रहे हैं। उन्हें आगमी वेस्टइंडीज टेस्ट सीरीज के लिए भी नहीं चुना गया।","content":"सरफराज का अर्थ ऊंचा, ऊंचे कद का, बुलंद, प्रतिष्ठित होता है। मुंबई के क्रिकेटर के हौसले तो बुलंद हैं और वह क्रिकेट के दुनिया में प्रतिष्ठित होने के लिए हर वह काम भी कर रहे हैं जिसकी अपेक्षा एक युवा क्रिकेटर से की जाती है। मगर, ऐसी 'अफवाह' है कि कद-काठी उनके आगे बढ़ने में आड़े आ रही है। घरेलू क्रिकेट में रनों का अंबार लगाने के बावजूद 25 साल के इस बल्लेबाज को नैशनल सिलेक्टर्स लगातार नजरअंदाज कर रहे हैं। वैसे सरफराज के करीबियों का कहना है कि यह युवा थोड़े समय के लिए हताश होने के बाद एक बार फिर अगले सीजन के लिए कमर कस चुका है। वह फिर से ढेर सारे रन बनाकर सिलेक्टर्स के बुलावे का इंतजार करेगा। सरफराज 5 जुलाई से होने वाले दलीप ट्रोफी सेमीफाइनल के लिए कड़ी मेहनत कर रहे हैं। सरफराज के पिता नौशाद खान खुद क्रिकेटर रह चुके हैं और बेटे के पहले कोच भी वही हैं। NBT ने जब नौशाद से बेटे को नहीं सिलेक्ट करने पर प्रतिक्रिया जाननी चाही तो उन्होंने कहा, 'प्रतिक्रिया देना हमारा काम नहीं। किसी भी बल्लेबाज का कम रन बनाना और मैच जीतना होता है।' इसके अलावा उन्होंने इस मुद्दे पर कुछ भी बोलने से इनकार कर दिया। सरफराज भी इस मुद्दे पर कुछ नहीं बोलने के बजाय बल्ले से बात करने की ठानी है। सरफराज के कुछ अन्य करीबियों ने इस मुद्दे पर सीधे तौर पर बात तो नहीं की, लेकिन इस बात को लेकर खफा दिखे कि उनके बारे में गलत बातें फैलाई जा रही हैं। उनके एक साथी ने कहा कि पिछले सीजन में दिल्ली के खिलाफ सेंचुरी बनाने के बाद सरफराज ने आक्रामक तरीके से जश्न जरूर मनाया था, लेकिन यह किसी को अपमानित करने के लिए नहीं था। यहां तक कि पहले जो कहा गया कि वह स्टेडियम में बैठे तत्कालीन चीफ सिलेक्टर की ओर उंगली दिखा रहे थे, गलत है। दरअसल, उस मैच में चेतन तो थे ही नहीं। सरफराज की 125 रन की पारी पर तो कोच अमोल मजूमदार ने अपनी कैप उतारकर उन्हें शाबाशी दी थी। सरफराज से जुड़े एक एक्सपर्ट ने कहा कि उनकी फिटनेस को लेकर भी गलत बातें फैलाई जा रही हैं। वह फर्स्ट क्लास मैच में चार या पांच दिन फील्ड पर रहते हैं और बैटिंग करते हुए लंबी-लंबी पारियां भी खेलते हैं। उनके नाम फर्स्ट क्लास में तिहरा शतक (301*) भी है। वह एक शानदार फील्डर भी हैं। सरफराज यो-यो टेस्ट पास करने के लिए जरूरी 16.5 का स्कोर भी हासिल कर चुके हैं। ऐसे में उनकी फिटनेस पर भी सवाल नहीं उठाए जा सकते। एक कोच ने कहा कि दुनिया में सरफराज की कद-काठी के कई बड़े क्रिकेटर हो चुके हैं। अर्जुन रणतुंगा और डेविड बून को आसानी से याद किया जा सकता है। सरफराज खान को भारतीय टीम में क्यों सिलेक्ट नहीं किया जा रहा है, इसका जवाब तो सिलेक्टर ही दे सकते हैं। मगर, शायद टीम कॉम्बिनेशन को देखते हुए उनकी जगह नहीं बन रही है। सरफराज पांचवें नंबर पर बैटिंग करते हैं। टेस्ट टीम में फिलहाल अजिंक्य रहाणे उस जगह पर उतरते हैं। रहाणे बीच में बाहर हुए थे, लेकिन वापसी पर उन्होंने वर्ल्ड टेस्ट चैंपियनशिप में एक अच्छी पारी खेली है। ऐसे में उनको ड्रॉप करना मुश्किल था। सरफराज को लगातार अच्छा प्रदर्शन करना होगा और अपनी बारी का इंतजार करना होगा। सरफराज को अपने प्रदर्शन से चयनकर्ताओं के दरवाजे पर महज दस्तक नहीं देनी होगी बल्कि ऐसा खेल दिखाना होगा कि दरवाजा ही ध्वस्त हो जाए।","pubDate":"2023-06-27 01:22:14","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Cricket Record: 1 ओवर में पड़े थे 77 रन, अंपायर से लेकर फैंस हर किसी का घूम गया था सिर, जानें कैसे हुआ मुमकिन?","link":"https://navbharattimes.indiatimes.com/sports/cricket/cricket-news/bert-vance-most-expensive-over-cricket-history-gavee-77-runs/articleshow/101291566.cms","keywords":null,"creator":null,"video_url":null,"description":"क्रिकेट के इतिहास में कई ऐसे कारनामे हुए हैं, जिनपर विश्वास करना मुश्किल ही नहीं नामुमकिन है। उनमें से ही एक है फर्स्ट क्लास मैच के एक ओवर में 77 रन पड़ना।","content":"इस समय वर्ल्डकप क्वालिफायर में खेले गए नीदरलैड्स और वेस्टइंडीज के मैच की जमकर चर्चा हो रही है। हर तरफ उसी मैच का खुमार है। नीदरलैंड्स और वेस्टइंडीज के बीच खेला गया मुकाबला क्रिकेट के इतिहास के सबसे रोचक मैचों में से एक था। वेस्टइंडीज ने पहले बल्लेबाजी करते हुए 6 विकेट पर 374 रन बनाए थे। इसके जवाब में नीदरलैंड्स ने भी 374 रन जड़ डाले। वहीं सुपर ओवर में डच टीम के ऑलराउंडर लोगन वैन बीक ने 30 रन जड़ दिए और रिकॉर्ड बना दिया। इतना ही नहीं बल्कि उन्होंने सुपर ओवर में 2 विकेट भी लिए और डच टीम को 22 रन से मैच जिता दिया।आपने वनडे और टी20 में ऐसे चमत्कार होते देखे हैं, जहां एक ओवर में 36 या उससे अधिक रन पड़ रहे हों। लेकिन क्या आपने किसी फर्स्ट क्लास मैच के एक ओवर में 77 रन पड़ते हुए देखे हैं? जी हां, आपने सही पढ़ा 77 रन। आइये आपको इस मैच के बारे में बताते हैं। यह फर्स्ट क्लास मुकाबला न्यूजीलैंड के क्राइस्टचर्च में हो रहे कैंटरबरी और वेलिंगटन के बीच में खेला गया था। शेल ट्रॉफी के इस मैच में गजब हो गया। 20 फरवरी को खेले गए इस मुकाबले के आखिरी दिन केंटरबरी को जीत के लिए दो ओवर में 77 रन की दरकार थी। ऐसे में वेलिंगटन ने बर्ट वेंस को बॉल थमाई और बल्लेबाजों को ललचाने का प्रयास किया। लेकिन यह प्लान उनपर ही उल्टा पड़ गया। बर्ट ने इस ओवर में कुल 22 गेंदें डाली, जिसमें से 17 नो बॉल थीं। इस ओवर में 8 छक्के और 6 चौके लगे। गौरतलब है कि बर्ट वेंस के इस ओवर में इतनी गेंद डली कि अंपायर ही गेंदों की गिनती भूल गया, जिसके चलते इस ओवर में सिर्फ 5 लीगल डिलिवरी ही डल पाई। आखिरी ओवर में कैंटरबरी को जीत के लिए 18 रन चाहिए थे। लेकिन वह 17 रन ही बना पाए और मैच ड्रॉ रहा। वेंस का वो ओवर कुछ इस प्रकार था- 0444664614106666600401","pubDate":"2023-06-27 00:43:15","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Pressure on Australia to host five-day women's Test","link":"https://thewest.com.au/sport/cricket/pressure-on-australia-to-host-five-day-womens-test-c-11101830","keywords":null,"creator":["Scott Bailey"],"video_url":null,"description":"England captain Heather Knight wants all women's Tests to be played over five days after the Trent Bridge success, including the next Ashes series in Australia.","content":"England captain Heather Knight has put the heat on Cricket Australia to schedule a five-day Test for their next Ashes tour, desperate for the era of four-day internationals to end. Australia's 89-run win over England in Nottingham snapped a run of six straight draws in women's Tests dating back to 2017. It coincided with the match being the first five-day Test for women since 1992, with all matches since then having been scheduled for no more than four days. A world record of 22,203 fans attended the contest at Trent Bridge, while the 3.67 run-rate was the highest ever for a women's Test and 40 wickets were taken for only the second time since 1995. Knight has long been a proponent of five-day Tests, having rallied administrators in England to make the change. Asked if all Test matches, including the 2024-25 Ashes clash in Australia, should now be five-day games, Knight said: \"I think so. \"The fact is we have been able to see Tammy get 200, Sutherland get a hundred batting at No.8, Sophie Ecclestone get two five-wicket hauls and Ash get an eight-wicket haul. \"They are really special performances we might not have seen if it wasn't over five days. \"It means if you play four, you really have to try and manufacture a result. I don't think the game gets the credit it deserves if that happens. \"I would love to see five days but that's above my head.\" Australia will host South Africa in a Test next February in Perth, but that is so far only scheduled for four days. CA's head of operations Peter Roach said last year that it would not alter its plan for four-day Tests, but that a fifth day could be added in reserve for bad weather. \"We acknowledge that Boards can select four or five days for women's Test matches,\" Roach said last September. \"At this stage we will continue with four-day Test matches in Australia but may consider a reserve fifth day for Tests significantly affected by the weather.\" Australia captain Alyssa Healy is also not entirely sold on the five-day argument, adamant results can still be achieved within four. \"We've also had results in a four-day Test match before so I'm not going to sit here and say five days is the way forward,\" Healy said after the Trent Bridge win. \"But I will say if there is a threat of rain, having that reserve day is not such a bad thing. \"We saw it in the Test Championship final for the men they had a reserved six day for the Test match.\" Sign up for our emails","pubDate":"2023-06-27 00:05:02","image_url":"https://images.thewest.com.au/publication/C-11101830/5d5e521a2877a7767de8063c6f874f60a0c3dbcb-16x9-x0y0w1280h720.jpg","source_id":"thewest","category":["sports"],"country":["australia"],"language":"english"},{"title":"‘Adrenaline does funny things’: Injured Gardner lifts Australia to Test triumph","link":"https://www.theage.com.au/sport/cricket/gardner-s-record-breaking-performance-lifts-australia-to-ashes-triumph-20230626-p5djnt.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":["Sport / Cricket"],"creator":["Scott Bailey"],"video_url":null,"description":"A stellar performance from Ashleigh Gardner led Australia to an 89-run Ashes Test victory at Trent Bridge, and she did it all with an injury to her spinning finger.","content":"Ashleigh Gardner has revealed her record-breaking 12 wickets against England came while battling ligament damage in her spinning finger during Australia’s Ashes Test win. Gardner was the star of Australia’s 89-run victory over England at Trent Bridge, bagging 8-66 in the fourth innings to help bowl England out for 178 and end their pursuit of 268. The haul left her with the best-ever figures by an Australian woman, and the second best of all time behind Neetu David’s 8-53 for India against England in 1995. Gardner’s match figures of 12-165 were also the second best in history to Shaiza Khan’s 13-226 for Pakistan from 2004, and the best of any Australian woman. But the more impressive part was the fact she did it with concerns over her right index finger. Gardner was hit on the end of the finger during slips practice during Australia’s warm-up match against England A, denying her the chance to bowl before the Test. Australia’s Ashleigh Gardner celebrates after taking the wicket of England’s Danni Wyatt. Credit: AP “My finger obviously bent backwards where it’s probably not supposed to. It’s almost stretched that ligament a little bit,” Gardner said. “Adrenaline does funny things and I completely forget about it as soon as the ball was in hand. “So as soon as I wasn’t bowling (at Trent Bridge), I put a splint straight on it, just to protect it because in the field is where I’m more likely to get hit. “It was quite frustrating but because I didn’t get that match practice in before the Test. England’s Danni Wyatt is out LBW. Credit: REUTERS “It was about trusting what I’d already done, I wasn’t going to lose a skill overnight. And know my good stuff was good enough.” Gardner took all five of England’s remaining wickets on day five to finish off the hosts, ending any chance of the chase and putting Australia in control of the multi-format series. She also did it off little sleep, after her mind was fixated on finishing off the match. “I was awake at 3am thinking about bowling, which was a bit tragic,” Gardner said. “I was wide awake, literally thinking about how I was going to get the batters out and I’ve never done that before.” Gardner’s performance marked a coming-of-age with the ball. Bowling on a deteriorating day-five pitch for the first time, the 27-year-old took wickets with balls that went straight on, spun sharply, stayed low and reared up. Once picked as a powerhouse batter, Gardner has now developed into a genuine all-rounder and a frontline spinner. “It has been something that I’ve worked really hard on,” Gardner said. “With both bat and ball, it’s about consistency. “I feel like I can play both roles in attacking and then trying to defend with the ball as well. It’s asking the captain, ‘what do you want me to do?’ at that point in time. “Today is something I’m going to remember for the rest of my life, and certainly for the rest of my career.” The result ends a run of six straight draws in women’s Tests, with this the first match since 1992 to be given a fifth day. AAP News, results and expert analysis from the weekend of sport sent every Monday. Sign up for our Sport newsletter . Watch every ball of the 2023 Ashes series live and exclusive on Nine and 9Now.","pubDate":"2023-06-26 23:22:57","image_url":null,"source_id":"theage","category":["sports"],"country":["australia"],"language":"english"},{"title":"Yorkshire set to learn recommended sanctions for mishandling Azeem Rafiq case","link":"https://www.watfordobserver.co.uk/sport/national/23615720.yorkshire-set-learn-recommended-sanctions-mishandling-azeem-rafiq-case/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"The CDC panel will deliver its final sanctions at a later date.","content":"The England and Wales Cricket Board will make its sanctioning recommendations to an independent Cricket Discipline Commission (CDC) panel, with Yorkshire having admitted to four charges in February related to the mishandling of Rafiq’s case, the deletion of documents related to it and a failure to address the use of racist language at the club over a prolonged period. Yorkshire will then offer up arguments in mitigation to the panel, which will deliver the final sanctions at a later date. Update on charges against Yorkshire CCC and others — England and Wales Cricket Board (@ECB_cricket) Yorkshire released a statement on Monday which read: “In making representations to the CDC panel, we hope to achieve a reasonable sanction which takes into account our acceptance of the charges, YCCC’s current financial position and the robust work we have undertaken to build the foundations for a club which is truly inclusive and welcoming to all. “Over the past year and a half, the reputational and financial impact of the racism crisis included the loss of sponsors and the removal of the privilege of hosting international cricket at Headingley, which was reinstated following the club demonstrating adherence to a stringent 10-point plan outlined by the ECB. “We hope that any sanctions are reflective of the circumstances the club is in today and do not serve to hinder our ongoing commitment to create a brighter future for all associated with Yorkshire.” Any financial sanctions could hit the club hard, with Yorkshire chief executive Stephen Vaughan highlighting to members at the annual general meeting in March that there was a £3.5million cash shortfall this year and the need to repay £14.9m to the Graves Trust. The club said last week they were still having “positive conversations” around the long-term financial future of the club and would make an announcement “in due course”. Six former Yorkshire employees were sanctioned in May as part of the same case, with all of them found to have used the word “P***”. A seventh, former England captain Michael Vaughan, was cleared in March of using racist and/or discriminatory language towards a group of four players of Asian ethnicity, including Rafiq, before a Twenty20 match in 2009. The Yorkshire hearing coincides with the long-awaited publication of the Independent Commission for Equity in Cricket (ICEC) report. It has found racism remains “entrenched” within the sport in England and Wales.","pubDate":"2023-06-27 03:33:13","image_url":"https://www.watfordobserver.co.uk/resources/images/16932459/?type=app&htype=0","source_id":"watfordobserver","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Yorkshire set to learn recommended sanctions for mishandling Azeem Rafiq case","link":"https://www.independent.co.uk/sport/cricket/yorkshire-azeem-rafiq-cdc-michael-vaughan-london-b2364662.html","keywords":["Cricket","Sport"],"creator":["Jamie Gardner"],"video_url":null,"description":"The CDC panel will deliver its final sanctions at a later date.","content":"Yorkshire have called for “reasonable” sanctions as they face a key hearing in London today over their handling of the Azeem Rafiq case. The England and Wales Cricket Board will make its sanctioning recommendations to an independent Cricket Discipline Commission (CDC) panel, with Yorkshire having admitted to four charges in February related to the mishandling of Rafiq’s case, the deletion of documents related to it and a failure to address the use of racist language at the club over a prolonged period. Yorkshire will then offer up arguments in mitigation to the panel, which will deliver the final sanctions at a later date. Yorkshire released a statement on Monday which read: “In making representations to the CDC panel, we hope to achieve a reasonable sanction which takes into account our acceptance of the charges, YCCC’s current financial position and the robust work we have undertaken to build the foundations for a club which is truly inclusive and welcoming to all. “Over the past year and a half, the reputational and financial impact of the racism crisis included the loss of sponsors and the removal of the privilege of hosting international cricket at Headingley, which was reinstated following the club demonstrating adherence to a stringent 10-point plan outlined by the ECB. “We hope that any sanctions are reflective of the circumstances the club is in today and do not serve to hinder our ongoing commitment to create a brighter future for all associated with Yorkshire.” Any financial sanctions could hit the club hard, with Yorkshire chief executive Stephen Vaughan highlighting to members at the annual general meeting in March that there was a £3.5million cash shortfall this year and the need to repay £14.9m to the Graves Trust. The club said last week they were still having “positive conversations” around the long-term financial future of the club and would make an announcement “in due course”. Six former Yorkshire employees were sanctioned in May as part of the same case, with all of them found to have used the word “P***”. A seventh, former England captain Michael Vaughan , was cleared in March of using racist and/or discriminatory language towards a group of four players of Asian ethnicity, including Rafiq, before a Twenty20 match in 2009. The Yorkshire hearing coincides with the long-awaited publication of the Independent Commission for Equity in Cricket (ICEC) report. It has found racism remains “entrenched” within the sport in England and Wales.","pubDate":"2023-06-27 03:30:16","image_url":"https://static.independent.co.uk/2023/06/27/04/f515dd5c639dede59a5e183bbde71ae1Y29udGVudHNlYXJjaGFwaSwxNjg3ODcxMDcz-2.71578498.jpg?width=1200&auto=webp","source_id":"independentuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"WI vs IND: ये दो धारी तलवार है, सिलेक्शन विवाद पर सरफराज खान को मिली जिंदगी बदलने वाली सलाह","link":"https://navbharattimes.indiatimes.com/sports/cricket/cricket-news/dodda-ganesh-double-edged-sword-advice-to-sarfaraz-khan-on-blockbuster-reaction-on-test-snub/articleshow/101292921.cms","keywords":null,"creator":null,"video_url":null,"description":"विंडीज दौरे के लिए टेस्ट टीम में शामिल नहीं किए जाने को लेकर सरफराज खान ने इंस्टाग्राम पर प्रतिक्रिया दी थी। इसके बाद भूचाल सा आ गया। अब इस पर पूर्व भारतीय क्रिकेटर ने युवा बल्लेबाज को बड़ी सलाह दी है।","content":"सोशल मीडिया उपलब्धि पर खुशी या विफलता पर निराशा व्यक्त करने का सबसे बड़ा मंच बन गया है। पिछले कुछ वर्षों में खिलाड़ी इस प्लेटफॉर्म का इस्तेमाल अपनी बात रखने के लिए करते नजर आए हैं। ट्विटर, इंस्टाग्राम या फेसबुक पर की गई एक पोस्ट से फैंस अपने हीरो की स्थिति का अंदाजा लगा लेते हैं। सोशल मीडिया कई बार अच्छे मेसेज पहुंचाता है तो कई बार यहां रिएक्ट करना भारी भी पड़ जाता है। अब को ही ले लीजिए। सरफराज खान को तब 2023 में तीसरी बार नजरअंदाज कर दिया गया जब बीसीसीआई ने वेस्टइंडीज में दो टेस्ट मैचों की सीरीज के लिए 16 सदस्यीय टीम की घोषणा की थी। इसके बाद सरफराज ने सोशल मीडिया पर एक अपने रिकॉर्ड पर पोस्ट किया, जबकि सुनील गावस्कर सहित कई क्रिकेटर पहले ही उनके पक्ष में थे। इस क्रिप्टिक मेसेज के बाद लगातार उनका एक वीडियो वायरल होने लगा, जिसमें वह एग्रेसिव जश्न मनाते दिख रहे थे। इस पर तरह-तरह के निगेटिव दावे किए गए। पिछले साल बांग्लादेश दौरे के लिए नजरअंदाज किए जाने के बाद सरफराज को घरेलू सरजमीं पर बॉर्डर-गावस्कर सीरीज, लंदन में डब्ल्यूटीसी फाइनल और अब वेस्टइंडीज सीरीज के लिए इसी तरह के भाग्य का सामना करना पड़ा। उनकी किस्मत ऐसी रही कि पिछले तीन वर्षों में रणजी ट्रॉफी में ढेर सारे रन बनाने के बावजूद वह इस महीने की शुरुआत में ओवल मुकाबले के लिए स्टैंडबाय सूची में भी नहीं थे। वेस्टइंडीज दौरे के लिए टेस्ट में नहीं शामिल करने पर सरफराज ने इंस्टाग्राम पर 2022/23 रणजी ट्रॉफी सीजन के अपने हाइलाइट्स का एक वीडियो साझा किया था, जहां उन्होंने तीन शतक बनाए थे। किसी कैप्शन की आवश्यकता नहीं थी, लेकिन ब्लॉकबस्टर प्रतिक्रिया तुरंत पूरे सोशल मीडिया पर वायरल हो गई।इस पर भारत के पूर्व क्रिकेटर डोड्डा गणेश ने इस युवा खिलाड़ी को सलाह देते हुए इस पर प्रतिक्रिया व्यक्त की। उन्होंने ट्वीट किया- युवाओं को मेरी एक ही सलाह है: जब आपको नजरअंदाज किया जाए तो कृपया निराशा को अपने ऊपर हावी न होने दें। सोशल मीडिया एक दोधारी तलवार है। इसे बुद्धिमानी से उपयोग करें। अपने पिछले तीन रणजी ट्रॉफी सीजन में सरफराज ने 2566 रन बनाए। उन्होंने 2019/20 सीजन में 928 रन, 2022-23 में 982 और 2022-23 सीजन में 656 रन बनाए। इस आश्चर्यजनक रन ने उनके करियर की प्रथम श्रेणी औसत को 79.65 तक पहुंचा दिया, जो किसी भारतीय बल्लेबाज द्वारा सबसे अधिक और 37 मैचों में महानतम डॉन ब्रैडमैन (न्यूनतम 50 पारियों) के बाद दूसरा है। फिर भी मुंबई के बल्लेबाज को वेस्टइंडीज सीरीज के लिए रुतुराज गायकवाड़ को चुना गया, जिनका करियर औसत 42 से अधिक है।","pubDate":"2023-06-27 03:13:59","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Commission head highlights ‘rotten’ cricket culture in wake of report","link":"https://www.watfordobserver.co.uk/sport/national/23615718.commission-head-highlights-rotten-cricket-culture-wake-report/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"The ICEC Holding Up A Mirror report on cricket concluded there is racism, sexism and misogyny within the sport.","content":"Ms Butts told the BBC the report found widespread issues in the English and Welch game. “We heard of women being constantly stereotyped, demeaned, facing predatory behaviour,” she said. “We heard from women who are having to walk into scoreboxes and face signs that say ‘no bras allowed’. This is 2023, not 1923.” More than 4,000 people responded to the ICEC’s call for evidence for the Holding Up A Mirror To Cricket report. The commission made 44 recommendations, including a call for the England and Wales Cricket Board to make a public apology recognising that racism, sexism, elitism and class-based discrimination existed – and still exist – and recognise the impact of that upon victims. “We heard from a former Muslim player who had to endure the indignity of his team-mates laughing and joking about one of the players using the prayer mat to clean up after sex,” she said. “The stories were absolutely horrific and it goes to show that the culture in cricket is rotten.” Ms Butts said women are treated as “subordinate” to men in the sport and have been subjected to harassment. “What we’ve seen is that women are vulnerable when around a drinking culture, they are subjected to sexual harassment, lots of sexting,” she said. “We’ve heard from a number of women who talk about being vulnerable and being exposed and having unwanted advances made on them by men.” In a letter to her, ECB chair Richard Thompson apologised and said: “We will use this moment to reset cricket.” “Cricket should never exclude anyone on the basis of their ethnicity, gender or social background,” Mr Thompson said. “We apologise unreservedly for these experiences, and are thankful for the courage of those who have shared them with the ICEC, whilst recognising there will be many more who felt unable to give their accounts.” Among the recommendations is a call for a fundamental overhaul of the pay structure in the women’s professional game and equal representation for the women’s game throughout the governance structure of English and Welsh cricket.","pubDate":"2023-06-27 03:13:45","image_url":"https://www.watfordobserver.co.uk/resources/images/16932456/?type=app&htype=0","source_id":"watfordobserver","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Commission head highlights ‘rotten’ cricket culture in wake of report","link":"https://www.independent.co.uk/sport/cricket/richard-thompson-michael-collins-brendan-barber-english-cricket-b2364656.html","keywords":["Cricket","Sport"],"creator":["Cormac Pearson"],"video_url":null,"description":"The ICEC Holding Up A Mirror report on cricket concluded there is racism, sexism and misogyny within the sport.","content":"The chair of the Independent Commission for Equity in Cricket (ICEC) Cindy Butts said she heard “horrific” stories during a report which investigated racism, sexism and misogyny in Cricket. Ms Butts told the BBC the report found widespread issues in the English and Welch game. “We heard of women being constantly stereotyped, demeaned, facing predatory behaviour,” she said. “We heard from women who are having to walk into scoreboxes and face signs that say ‘no bras allowed’. This is 2023, not 1923.” More than 4,000 people responded to the ICEC’s call for evidence for the Holding Up A Mirror To Cricket report. The commission made 44 recommendations, including a call for the England and Wales Cricket Board to make a public apology recognising that racism, sexism, elitism and class-based discrimination existed – and still exist – and recognise the impact of that upon victims. “We heard from a former Muslim player who had to endure the indignity of his team-mates laughing and joking about one of the players using the prayer mat to clean up after sex,” she said. “The stories were absolutely horrific and it goes to show that the culture in cricket is rotten.” Ms Butts said women are treated as “subordinate” to men in the sport and have been subjected to harassment. “What we’ve seen is that women are vulnerable when around a drinking culture, they are subjected to sexual harassment, lots of sexting,” she said. “We’ve heard from a number of women who talk about being vulnerable and being exposed and having unwanted advances made on them by men.” In a letter to her, ECB chair Richard Thompson apologised and said: “We will use this moment to reset cricket.” “Cricket should never exclude anyone on the basis of their ethnicity, gender or social background,” Mr Thompson said. “We apologise unreservedly for these experiences, and are thankful for the courage of those who have shared them with the ICEC, whilst recognising there will be many more who felt unable to give their accounts.” Among the recommendations is a call for a fundamental overhaul of the pay structure in the women’s professional game and equal representation for the women’s game throughout the governance structure of English and Welsh cricket.","pubDate":"2023-06-27 03:06:40","image_url":"https://static.independent.co.uk/2023/06/27/04/dce57169a0976a18dfa0220b3d3796c6Y29udGVudHNlYXJjaGFwaSwxNjg3OTE5MTY4-2.43477530.jpg?width=1200&auto=webp","source_id":"independentuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Team India: NCA में लगी महफिल, पुराने दोस्तों से मिले ऋषभ पंत, शेयर की दिल छू लेने वाली तस्वीरें","link":"https://navbharattimes.indiatimes.com/sports/cricket/cricket-news/rishabh-pant-reunited-with-team-india-players-at-nca-photo-viral/articleshow/101292617.cms","keywords":null,"creator":null,"video_url":null,"description":"टीम इंडिया के स्टार विकेटकीपर बल्लेबाज ऋषभ पंत सोशल मीडिया पर काफी एक्टिव रहते हैं। वह आए दिन कुछ ना कुछ अपने फैंस के साथ साझा करते रहते हैं।","content":"भारतीय क्रिकेट टीम इन दिनों छुट्टी पर चल रही है। वर्ल्ड टेस्ट चैंपियनशिप 2023 के फाइनल के बाद से टीम इंडिया के प्लेयर्स आराम कर रहे हैं। कुछ खिलाड़ी छुट्टियों का आनंद ले रहे हैं तो कुछ अपनी फिटनेस पर मेहनत कर रहे हैं। वहीं कुछ चोटिल भारतीय खिलाड़ी मौजूदा वक्त में बेंगलुरु में स्थित नेशनल क्रिकेट अकेडमी में हैं, जिसमें और केएल राहुल भी हैं। जबकि कुछ प्लेयर्स आने वाली वेस्टइंडीज सीरीज के लिए वहां अपनी तैयारियां कर रहे हैं। ऐसे में एक बार फिर कुछ पुराने यार एक साथ नजर आए हैं। भारतीय क्रिकेट टीम के स्टार विकेटकीपर बल्लेबाज ऋषभ पंत पिछले 6 महीने से क्रिकेट से दूर चल रहे हैं। उनका दिसंबर 2022 के अंत में भयानक कार एक्ससीडेंट हुआ था, जिसके चलते वह काफी ज्यादा चोटिल हो गए थे। हालांकि सर्जरी के बाद से पंत तेजी से रिकवर कर रहे हैं। इसी के साथ पंत की मुलाकात नेशनल क्रिकेट अकेडमी में केएल राहुल, मोहम्मद सिराज, युजवेंद्र चहल और शार्दुल ठाकुर से हुई। आपस में सब काफी खुश नजर आ रहे थे। पंत ने खुद इस खास मुलाकात की तस्वीरें सोशल मीडिया के सबसे चर्चित प्लेटफॉर्म ट्विटर पर शेयर की हैं, जिसकी केप्शन में उन्होंने लिखा है, 'गैंग के साथ रीयूनियन करना हमेशा मजेदार रहता है। उनकी यह पोस्ट इस वक्त चर्चा में भी है। अगले महीने यानी जुलाई में टीम इंडिया वेस्टइंडीज जाएगी। जहां वह कैरेबियाई टीम के साथ 2 टेस्ट, 3 वनडे और 5 टी20 मुकाबले खेलने वाले हैं। दौरे की शुरुआत 12 जुलाई को टेस्ट मैच के साथ होगी। बीसीसीआई ने वेस्टइंडीज टूर के लिए भारत की टेस्ट और वनडे टीम की घोषणा भी कर दी है। रोहित शर्मा (कप्तान), शुभमन गिल, ऋतुराज गायकवाड़, विराट कोहली, यशस्वी जायसवाल, अजिंक्य रहाणे, केएस भरत, ईशान किशन, रविचंद्रन अश्विन, रविंद्र जडेजा, अक्षर पटेल, शार्दुल ठाकुर, नवदीप सैनी, जयदेव उनादकट, मोहममद सिराज और मुकेश कुमार। रोहित शर्मा (कप्तान), शुभमन गिल, ऋतुराज गायकवाड़, विराट कोहली, सूर्यकुमार यादव, संजू सेमसन, ईशान किशन, हार्दिक पंड्या, शार्दुल ठाकुर, रविंद्र जडेजा, अक्षर पटेल, युजवेंद्र चहल, कुलदीप यादव, जयदेव उनादकट, मोहममद सिराज, उमरान मलिक और मुकेश कुमार।","pubDate":"2023-06-27 02:31:23","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Sarfaraz Khan: सरफराज करेंगे सिलेक्टर्स के बुलावे का इंतजार, नजरअंदाज होने के बाद डोमेस्टिक सीजन में फिर बनेंगे आग","link":"https://navbharattimes.indiatimes.com/sports/cricket/cricket-news/sarfaraz-khan-getting-ready-for-duleep-trophy-waiting-for-selectors-call-again/articleshow/101291698.cms","keywords":null,"creator":null,"video_url":null,"description":"मुंबई के युवा बल्लेबाज सरफराज खान घरेलू क्रिकेट में जमकर रन बना रहे हैं। लेकिन इसके बावजूद उन्हें भारतीय टीम के चयनकर्ता लगातार नजरअंदाज कर रहे हैं। उन्हें आगमी वेस्टइंडीज टेस्ट सीरीज के लिए भी नहीं चुना गया।","content":"सरफराज का अर्थ ऊंचा, ऊंचे कद का, बुलंद, प्रतिष्ठित होता है। मुंबई के क्रिकेटर के हौसले तो बुलंद हैं और वह क्रिकेट के दुनिया में प्रतिष्ठित होने के लिए हर वह काम भी कर रहे हैं जिसकी अपेक्षा एक युवा क्रिकेटर से की जाती है। मगर, ऐसी 'अफवाह' है कि कद-काठी उनके आगे बढ़ने में आड़े आ रही है। घरेलू क्रिकेट में रनों का अंबार लगाने के बावजूद 25 साल के इस बल्लेबाज को नैशनल सिलेक्टर्स लगातार नजरअंदाज कर रहे हैं। वैसे सरफराज के करीबियों का कहना है कि यह युवा थोड़े समय के लिए हताश होने के बाद एक बार फिर अगले सीजन के लिए कमर कस चुका है। वह फिर से ढेर सारे रन बनाकर सिलेक्टर्स के बुलावे का इंतजार करेगा। सरफराज 5 जुलाई से होने वाले दलीप ट्रोफी सेमीफाइनल के लिए कड़ी मेहनत कर रहे हैं। सरफराज के पिता नौशाद खान खुद क्रिकेटर रह चुके हैं और बेटे के पहले कोच भी वही हैं। NBT ने जब नौशाद से बेटे को नहीं सिलेक्ट करने पर प्रतिक्रिया जाननी चाही तो उन्होंने कहा, 'प्रतिक्रिया देना हमारा काम नहीं। किसी भी बल्लेबाज का कम रन बनाना और मैच जीतना होता है।' इसके अलावा उन्होंने इस मुद्दे पर कुछ भी बोलने से इनकार कर दिया। सरफराज भी इस मुद्दे पर कुछ नहीं बोलने के बजाय बल्ले से बात करने की ठानी है। सरफराज के कुछ अन्य करीबियों ने इस मुद्दे पर सीधे तौर पर बात तो नहीं की, लेकिन इस बात को लेकर खफा दिखे कि उनके बारे में गलत बातें फैलाई जा रही हैं। उनके एक साथी ने कहा कि पिछले सीजन में दिल्ली के खिलाफ सेंचुरी बनाने के बाद सरफराज ने आक्रामक तरीके से जश्न जरूर मनाया था, लेकिन यह किसी को अपमानित करने के लिए नहीं था। यहां तक कि पहले जो कहा गया कि वह स्टेडियम में बैठे तत्कालीन चीफ सिलेक्टर की ओर उंगली दिखा रहे थे, गलत है। दरअसल, उस मैच में चेतन तो थे ही नहीं। सरफराज की 125 रन की पारी पर तो कोच अमोल मजूमदार ने अपनी कैप उतारकर उन्हें शाबाशी दी थी। सरफराज से जुड़े एक एक्सपर्ट ने कहा कि उनकी फिटनेस को लेकर भी गलत बातें फैलाई जा रही हैं। वह फर्स्ट क्लास मैच में चार या पांच दिन फील्ड पर रहते हैं और बैटिंग करते हुए लंबी-लंबी पारियां भी खेलते हैं। उनके नाम फर्स्ट क्लास में तिहरा शतक (301*) भी है। वह एक शानदार फील्डर भी हैं। सरफराज यो-यो टेस्ट पास करने के लिए जरूरी 16.5 का स्कोर भी हासिल कर चुके हैं। ऐसे में उनकी फिटनेस पर भी सवाल नहीं उठाए जा सकते। एक कोच ने कहा कि दुनिया में सरफराज की कद-काठी के कई बड़े क्रिकेटर हो चुके हैं। अर्जुन रणतुंगा और डेविड बून को आसानी से याद किया जा सकता है। सरफराज खान को भारतीय टीम में क्यों सिलेक्ट नहीं किया जा रहा है, इसका जवाब तो सिलेक्टर ही दे सकते हैं। मगर, शायद टीम कॉम्बिनेशन को देखते हुए उनकी जगह नहीं बन रही है। सरफराज पांचवें नंबर पर बैटिंग करते हैं। टेस्ट टीम में फिलहाल अजिंक्य रहाणे उस जगह पर उतरते हैं। रहाणे बीच में बाहर हुए थे, लेकिन वापसी पर उन्होंने वर्ल्ड टेस्ट चैंपियनशिप में एक अच्छी पारी खेली है। ऐसे में उनको ड्रॉप करना मुश्किल था। सरफराज को लगातार अच्छा प्रदर्शन करना होगा और अपनी बारी का इंतजार करना होगा। सरफराज को अपने प्रदर्शन से चयनकर्ताओं के दरवाजे पर महज दस्तक नहीं देनी होगी बल्कि ऐसा खेल दिखाना होगा कि दरवाजा ही ध्वस्त हो जाए।","pubDate":"2023-06-27 01:22:14","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Cricket Record: 1 ओवर में पड़े थे 77 रन, अंपायर से लेकर फैंस हर किसी का घूम गया था सिर, जानें कैसे हुआ मुमकिन?","link":"https://navbharattimes.indiatimes.com/sports/cricket/cricket-news/bert-vance-most-expensive-over-cricket-history-gavee-77-runs/articleshow/101291566.cms","keywords":null,"creator":null,"video_url":null,"description":"क्रिकेट के इतिहास में कई ऐसे कारनामे हुए हैं, जिनपर विश्वास करना मुश्किल ही नहीं नामुमकिन है। उनमें से ही एक है फर्स्ट क्लास मैच के एक ओवर में 77 रन पड़ना।","content":"इस समय वर्ल्डकप क्वालिफायर में खेले गए नीदरलैड्स और वेस्टइंडीज के मैच की जमकर चर्चा हो रही है। हर तरफ उसी मैच का खुमार है। नीदरलैंड्स और वेस्टइंडीज के बीच खेला गया मुकाबला क्रिकेट के इतिहास के सबसे रोचक मैचों में से एक था। वेस्टइंडीज ने पहले बल्लेबाजी करते हुए 6 विकेट पर 374 रन बनाए थे। इसके जवाब में नीदरलैंड्स ने भी 374 रन जड़ डाले। वहीं सुपर ओवर में डच टीम के ऑलराउंडर लोगन वैन बीक ने 30 रन जड़ दिए और रिकॉर्ड बना दिया। इतना ही नहीं बल्कि उन्होंने सुपर ओवर में 2 विकेट भी लिए और डच टीम को 22 रन से मैच जिता दिया।आपने वनडे और टी20 में ऐसे चमत्कार होते देखे हैं, जहां एक ओवर में 36 या उससे अधिक रन पड़ रहे हों। लेकिन क्या आपने किसी फर्स्ट क्लास मैच के एक ओवर में 77 रन पड़ते हुए देखे हैं? जी हां, आपने सही पढ़ा 77 रन। आइये आपको इस मैच के बारे में बताते हैं। यह फर्स्ट क्लास मुकाबला न्यूजीलैंड के क्राइस्टचर्च में हो रहे कैंटरबरी और वेलिंगटन के बीच में खेला गया था। शेल ट्रॉफी के इस मैच में गजब हो गया। 20 फरवरी को खेले गए इस मुकाबले के आखिरी दिन केंटरबरी को जीत के लिए दो ओवर में 77 रन की दरकार थी। ऐसे में वेलिंगटन ने बर्ट वेंस को बॉल थमाई और बल्लेबाजों को ललचाने का प्रयास किया। लेकिन यह प्लान उनपर ही उल्टा पड़ गया। बर्ट ने इस ओवर में कुल 22 गेंदें डाली, जिसमें से 17 नो बॉल थीं। इस ओवर में 8 छक्के और 6 चौके लगे। गौरतलब है कि बर्ट वेंस के इस ओवर में इतनी गेंद डली कि अंपायर ही गेंदों की गिनती भूल गया, जिसके चलते इस ओवर में सिर्फ 5 लीगल डिलिवरी ही डल पाई। आखिरी ओवर में कैंटरबरी को जीत के लिए 18 रन चाहिए थे। लेकिन वह 17 रन ही बना पाए और मैच ड्रॉ रहा। वेंस का वो ओवर कुछ इस प्रकार था- 0444664614106666600401","pubDate":"2023-06-27 00:43:15","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Pressure on Australia to host five-day women's Test","link":"https://thewest.com.au/sport/cricket/pressure-on-australia-to-host-five-day-womens-test-c-11101830","keywords":null,"creator":["Scott Bailey"],"video_url":null,"description":"England captain Heather Knight wants all women's Tests to be played over five days after the Trent Bridge success, including the next Ashes series in Australia.","content":"England captain Heather Knight has put the heat on Cricket Australia to schedule a five-day Test for their next Ashes tour, desperate for the era of four-day internationals to end. Australia's 89-run win over England in Nottingham snapped a run of six straight draws in women's Tests dating back to 2017. It coincided with the match being the first five-day Test for women since 1992, with all matches since then having been scheduled for no more than four days. A world record of 22,203 fans attended the contest at Trent Bridge, while the 3.67 run-rate was the highest ever for a women's Test and 40 wickets were taken for only the second time since 1995. Knight has long been a proponent of five-day Tests, having rallied administrators in England to make the change. Asked if all Test matches, including the 2024-25 Ashes clash in Australia, should now be five-day games, Knight said: \"I think so. \"The fact is we have been able to see Tammy get 200, Sutherland get a hundred batting at No.8, Sophie Ecclestone get two five-wicket hauls and Ash get an eight-wicket haul. \"They are really special performances we might not have seen if it wasn't over five days. \"It means if you play four, you really have to try and manufacture a result. I don't think the game gets the credit it deserves if that happens. \"I would love to see five days but that's above my head.\" Australia will host South Africa in a Test next February in Perth, but that is so far only scheduled for four days. CA's head of operations Peter Roach said last year that it would not alter its plan for four-day Tests, but that a fifth day could be added in reserve for bad weather. \"We acknowledge that Boards can select four or five days for women's Test matches,\" Roach said last September. \"At this stage we will continue with four-day Test matches in Australia but may consider a reserve fifth day for Tests significantly affected by the weather.\" Australia captain Alyssa Healy is also not entirely sold on the five-day argument, adamant results can still be achieved within four. \"We've also had results in a four-day Test match before so I'm not going to sit here and say five days is the way forward,\" Healy said after the Trent Bridge win. \"But I will say if there is a threat of rain, having that reserve day is not such a bad thing. \"We saw it in the Test Championship final for the men they had a reserved six day for the Test match.\" Sign up for our emails","pubDate":"2023-06-27 00:05:02","image_url":"https://images.thewest.com.au/publication/C-11101830/5d5e521a2877a7767de8063c6f874f60a0c3dbcb-16x9-x0y0w1280h720.jpg","source_id":"thewest","category":["sports"],"country":["australia"],"language":"english"},{"title":"‘Adrenaline does funny things’: Injured Gardner lifts Australia to Test triumph","link":"https://www.theage.com.au/sport/cricket/gardner-s-record-breaking-performance-lifts-australia-to-ashes-triumph-20230626-p5djnt.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":["Sport / Cricket"],"creator":["Scott Bailey"],"video_url":null,"description":"A stellar performance from Ashleigh Gardner led Australia to an 89-run Ashes Test victory at Trent Bridge, and she did it all with an injury to her spinning finger.","content":"Ashleigh Gardner has revealed her record-breaking 12 wickets against England came while battling ligament damage in her spinning finger during Australia’s Ashes Test win. Gardner was the star of Australia’s 89-run victory over England at Trent Bridge, bagging 8-66 in the fourth innings to help bowl England out for 178 and end their pursuit of 268. The haul left her with the best-ever figures by an Australian woman, and the second best of all time behind Neetu David’s 8-53 for India against England in 1995. Gardner’s match figures of 12-165 were also the second best in history to Shaiza Khan’s 13-226 for Pakistan from 2004, and the best of any Australian woman. But the more impressive part was the fact she did it with concerns over her right index finger. Gardner was hit on the end of the finger during slips practice during Australia’s warm-up match against England A, denying her the chance to bowl before the Test. Australia’s Ashleigh Gardner celebrates after taking the wicket of England’s Danni Wyatt. Credit: AP “My finger obviously bent backwards where it’s probably not supposed to. It’s almost stretched that ligament a little bit,” Gardner said. “Adrenaline does funny things and I completely forget about it as soon as the ball was in hand. “So as soon as I wasn’t bowling (at Trent Bridge), I put a splint straight on it, just to protect it because in the field is where I’m more likely to get hit. “It was quite frustrating but because I didn’t get that match practice in before the Test. England’s Danni Wyatt is out LBW. Credit: REUTERS “It was about trusting what I’d already done, I wasn’t going to lose a skill overnight. And know my good stuff was good enough.” Gardner took all five of England’s remaining wickets on day five to finish off the hosts, ending any chance of the chase and putting Australia in control of the multi-format series. She also did it off little sleep, after her mind was fixated on finishing off the match. “I was awake at 3am thinking about bowling, which was a bit tragic,” Gardner said. “I was wide awake, literally thinking about how I was going to get the batters out and I’ve never done that before.” Gardner’s performance marked a coming-of-age with the ball. Bowling on a deteriorating day-five pitch for the first time, the 27-year-old took wickets with balls that went straight on, spun sharply, stayed low and reared up. Once picked as a powerhouse batter, Gardner has now developed into a genuine all-rounder and a frontline spinner. “It has been something that I’ve worked really hard on,” Gardner said. “With both bat and ball, it’s about consistency. “I feel like I can play both roles in attacking and then trying to defend with the ball as well. It’s asking the captain, ‘what do you want me to do?’ at that point in time. “Today is something I’m going to remember for the rest of my life, and certainly for the rest of my career.” The result ends a run of six straight draws in women’s Tests, with this the first match since 1992 to be given a fifth day. AAP News, results and expert analysis from the weekend of sport sent every Monday. Sign up for our Sport newsletter . Watch every ball of the 2023 Ashes series live and exclusive on Nine and 9Now.","pubDate":"2023-06-26 23:22:57","image_url":null,"source_id":"theage","category":["sports"],"country":["australia"],"language":"english"},{"title":"Yorkshire set to learn recommended sanctions for mishandling Azeem Rafiq case","link":"https://www.watfordobserver.co.uk/sport/national/23615720.yorkshire-set-learn-recommended-sanctions-mishandling-azeem-rafiq-case/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"The CDC panel will deliver its final sanctions at a later date.","content":"The England and Wales Cricket Board will make its sanctioning recommendations to an independent Cricket Discipline Commission (CDC) panel, with Yorkshire having admitted to four charges in February related to the mishandling of Rafiq’s case, the deletion of documents related to it and a failure to address the use of racist language at the club over a prolonged period. Yorkshire will then offer up arguments in mitigation to the panel, which will deliver the final sanctions at a later date. Update on charges against Yorkshire CCC and others — England and Wales Cricket Board (@ECB_cricket) Yorkshire released a statement on Monday which read: “In making representations to the CDC panel, we hope to achieve a reasonable sanction which takes into account our acceptance of the charges, YCCC’s current financial position and the robust work we have undertaken to build the foundations for a club which is truly inclusive and welcoming to all. “Over the past year and a half, the reputational and financial impact of the racism crisis included the loss of sponsors and the removal of the privilege of hosting international cricket at Headingley, which was reinstated following the club demonstrating adherence to a stringent 10-point plan outlined by the ECB. “We hope that any sanctions are reflective of the circumstances the club is in today and do not serve to hinder our ongoing commitment to create a brighter future for all associated with Yorkshire.” Any financial sanctions could hit the club hard, with Yorkshire chief executive Stephen Vaughan highlighting to members at the annual general meeting in March that there was a £3.5million cash shortfall this year and the need to repay £14.9m to the Graves Trust. The club said last week they were still having “positive conversations” around the long-term financial future of the club and would make an announcement “in due course”. Six former Yorkshire employees were sanctioned in May as part of the same case, with all of them found to have used the word “P***”. A seventh, former England captain Michael Vaughan, was cleared in March of using racist and/or discriminatory language towards a group of four players of Asian ethnicity, including Rafiq, before a Twenty20 match in 2009. The Yorkshire hearing coincides with the long-awaited publication of the Independent Commission for Equity in Cricket (ICEC) report. It has found racism remains “entrenched” within the sport in England and Wales.","pubDate":"2023-06-27 03:33:13","image_url":"https://www.watfordobserver.co.uk/resources/images/16932459/?type=app&htype=0","source_id":"watfordobserver","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Yorkshire set to learn recommended sanctions for mishandling Azeem Rafiq case","link":"https://www.independent.co.uk/sport/cricket/yorkshire-azeem-rafiq-cdc-michael-vaughan-london-b2364662.html","keywords":["Cricket","Sport"],"creator":["Jamie Gardner"],"video_url":null,"description":"The CDC panel will deliver its final sanctions at a later date.","content":"Yorkshire have called for “reasonable” sanctions as they face a key hearing in London today over their handling of the Azeem Rafiq case. The England and Wales Cricket Board will make its sanctioning recommendations to an independent Cricket Discipline Commission (CDC) panel, with Yorkshire having admitted to four charges in February related to the mishandling of Rafiq’s case, the deletion of documents related to it and a failure to address the use of racist language at the club over a prolonged period. Yorkshire will then offer up arguments in mitigation to the panel, which will deliver the final sanctions at a later date. Yorkshire released a statement on Monday which read: “In making representations to the CDC panel, we hope to achieve a reasonable sanction which takes into account our acceptance of the charges, YCCC’s current financial position and the robust work we have undertaken to build the foundations for a club which is truly inclusive and welcoming to all. “Over the past year and a half, the reputational and financial impact of the racism crisis included the loss of sponsors and the removal of the privilege of hosting international cricket at Headingley, which was reinstated following the club demonstrating adherence to a stringent 10-point plan outlined by the ECB. “We hope that any sanctions are reflective of the circumstances the club is in today and do not serve to hinder our ongoing commitment to create a brighter future for all associated with Yorkshire.” Any financial sanctions could hit the club hard, with Yorkshire chief executive Stephen Vaughan highlighting to members at the annual general meeting in March that there was a £3.5million cash shortfall this year and the need to repay £14.9m to the Graves Trust. The club said last week they were still having “positive conversations” around the long-term financial future of the club and would make an announcement “in due course”. Six former Yorkshire employees were sanctioned in May as part of the same case, with all of them found to have used the word “P***”. A seventh, former England captain Michael Vaughan , was cleared in March of using racist and/or discriminatory language towards a group of four players of Asian ethnicity, including Rafiq, before a Twenty20 match in 2009. The Yorkshire hearing coincides with the long-awaited publication of the Independent Commission for Equity in Cricket (ICEC) report. It has found racism remains “entrenched” within the sport in England and Wales.","pubDate":"2023-06-27 03:30:16","image_url":"https://static.independent.co.uk/2023/06/27/04/f515dd5c639dede59a5e183bbde71ae1Y29udGVudHNlYXJjaGFwaSwxNjg3ODcxMDcz-2.71578498.jpg?width=1200&auto=webp","source_id":"independentuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"WI vs IND: ये दो धारी तलवार है, सिलेक्शन विवाद पर सरफराज खान को मिली जिंदगी बदलने वाली सलाह","link":"https://navbharattimes.indiatimes.com/sports/cricket/cricket-news/dodda-ganesh-double-edged-sword-advice-to-sarfaraz-khan-on-blockbuster-reaction-on-test-snub/articleshow/101292921.cms","keywords":null,"creator":null,"video_url":null,"description":"विंडीज दौरे के लिए टेस्ट टीम में शामिल नहीं किए जाने को लेकर सरफराज खान ने इंस्टाग्राम पर प्रतिक्रिया दी थी। इसके बाद भूचाल सा आ गया। अब इस पर पूर्व भारतीय क्रिकेटर ने युवा बल्लेबाज को बड़ी सलाह दी है।","content":"सोशल मीडिया उपलब्धि पर खुशी या विफलता पर निराशा व्यक्त करने का सबसे बड़ा मंच बन गया है। पिछले कुछ वर्षों में खिलाड़ी इस प्लेटफॉर्म का इस्तेमाल अपनी बात रखने के लिए करते नजर आए हैं। ट्विटर, इंस्टाग्राम या फेसबुक पर की गई एक पोस्ट से फैंस अपने हीरो की स्थिति का अंदाजा लगा लेते हैं। सोशल मीडिया कई बार अच्छे मेसेज पहुंचाता है तो कई बार यहां रिएक्ट करना भारी भी पड़ जाता है। अब को ही ले लीजिए। सरफराज खान को तब 2023 में तीसरी बार नजरअंदाज कर दिया गया जब बीसीसीआई ने वेस्टइंडीज में दो टेस्ट मैचों की सीरीज के लिए 16 सदस्यीय टीम की घोषणा की थी। इसके बाद सरफराज ने सोशल मीडिया पर एक अपने रिकॉर्ड पर पोस्ट किया, जबकि सुनील गावस्कर सहित कई क्रिकेटर पहले ही उनके पक्ष में थे। इस क्रिप्टिक मेसेज के बाद लगातार उनका एक वीडियो वायरल होने लगा, जिसमें वह एग्रेसिव जश्न मनाते दिख रहे थे। इस पर तरह-तरह के निगेटिव दावे किए गए। पिछले साल बांग्लादेश दौरे के लिए नजरअंदाज किए जाने के बाद सरफराज को घरेलू सरजमीं पर बॉर्डर-गावस्कर सीरीज, लंदन में डब्ल्यूटीसी फाइनल और अब वेस्टइंडीज सीरीज के लिए इसी तरह के भाग्य का सामना करना पड़ा। उनकी किस्मत ऐसी रही कि पिछले तीन वर्षों में रणजी ट्रॉफी में ढेर सारे रन बनाने के बावजूद वह इस महीने की शुरुआत में ओवल मुकाबले के लिए स्टैंडबाय सूची में भी नहीं थे। वेस्टइंडीज दौरे के लिए टेस्ट में नहीं शामिल करने पर सरफराज ने इंस्टाग्राम पर 2022/23 रणजी ट्रॉफी सीजन के अपने हाइलाइट्स का एक वीडियो साझा किया था, जहां उन्होंने तीन शतक बनाए थे। किसी कैप्शन की आवश्यकता नहीं थी, लेकिन ब्लॉकबस्टर प्रतिक्रिया तुरंत पूरे सोशल मीडिया पर वायरल हो गई।इस पर भारत के पूर्व क्रिकेटर डोड्डा गणेश ने इस युवा खिलाड़ी को सलाह देते हुए इस पर प्रतिक्रिया व्यक्त की। उन्होंने ट्वीट किया- युवाओं को मेरी एक ही सलाह है: जब आपको नजरअंदाज किया जाए तो कृपया निराशा को अपने ऊपर हावी न होने दें। सोशल मीडिया एक दोधारी तलवार है। इसे बुद्धिमानी से उपयोग करें। अपने पिछले तीन रणजी ट्रॉफी सीजन में सरफराज ने 2566 रन बनाए। उन्होंने 2019/20 सीजन में 928 रन, 2022-23 में 982 और 2022-23 सीजन में 656 रन बनाए। इस आश्चर्यजनक रन ने उनके करियर की प्रथम श्रेणी औसत को 79.65 तक पहुंचा दिया, जो किसी भारतीय बल्लेबाज द्वारा सबसे अधिक और 37 मैचों में महानतम डॉन ब्रैडमैन (न्यूनतम 50 पारियों) के बाद दूसरा है। फिर भी मुंबई के बल्लेबाज को वेस्टइंडीज सीरीज के लिए रुतुराज गायकवाड़ को चुना गया, जिनका करियर औसत 42 से अधिक है।","pubDate":"2023-06-27 03:13:59","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Commission head highlights ‘rotten’ cricket culture in wake of report","link":"https://www.watfordobserver.co.uk/sport/national/23615718.commission-head-highlights-rotten-cricket-culture-wake-report/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"The ICEC Holding Up A Mirror report on cricket concluded there is racism, sexism and misogyny within the sport.","content":"Ms Butts told the BBC the report found widespread issues in the English and Welch game. “We heard of women being constantly stereotyped, demeaned, facing predatory behaviour,” she said. “We heard from women who are having to walk into scoreboxes and face signs that say ‘no bras allowed’. This is 2023, not 1923.” More than 4,000 people responded to the ICEC’s call for evidence for the Holding Up A Mirror To Cricket report. The commission made 44 recommendations, including a call for the England and Wales Cricket Board to make a public apology recognising that racism, sexism, elitism and class-based discrimination existed – and still exist – and recognise the impact of that upon victims. “We heard from a former Muslim player who had to endure the indignity of his team-mates laughing and joking about one of the players using the prayer mat to clean up after sex,” she said. “The stories were absolutely horrific and it goes to show that the culture in cricket is rotten.” Ms Butts said women are treated as “subordinate” to men in the sport and have been subjected to harassment. “What we’ve seen is that women are vulnerable when around a drinking culture, they are subjected to sexual harassment, lots of sexting,” she said. “We’ve heard from a number of women who talk about being vulnerable and being exposed and having unwanted advances made on them by men.” In a letter to her, ECB chair Richard Thompson apologised and said: “We will use this moment to reset cricket.” “Cricket should never exclude anyone on the basis of their ethnicity, gender or social background,” Mr Thompson said. “We apologise unreservedly for these experiences, and are thankful for the courage of those who have shared them with the ICEC, whilst recognising there will be many more who felt unable to give their accounts.” Among the recommendations is a call for a fundamental overhaul of the pay structure in the women’s professional game and equal representation for the women’s game throughout the governance structure of English and Welsh cricket.","pubDate":"2023-06-27 03:13:45","image_url":"https://www.watfordobserver.co.uk/resources/images/16932456/?type=app&htype=0","source_id":"watfordobserver","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Commission head highlights ‘rotten’ cricket culture in wake of report","link":"https://www.independent.co.uk/sport/cricket/richard-thompson-michael-collins-brendan-barber-english-cricket-b2364656.html","keywords":["Cricket","Sport"],"creator":["Cormac Pearson"],"video_url":null,"description":"The ICEC Holding Up A Mirror report on cricket concluded there is racism, sexism and misogyny within the sport.","content":"The chair of the Independent Commission for Equity in Cricket (ICEC) Cindy Butts said she heard “horrific” stories during a report which investigated racism, sexism and misogyny in Cricket. Ms Butts told the BBC the report found widespread issues in the English and Welch game. “We heard of women being constantly stereotyped, demeaned, facing predatory behaviour,” she said. “We heard from women who are having to walk into scoreboxes and face signs that say ‘no bras allowed’. This is 2023, not 1923.” More than 4,000 people responded to the ICEC’s call for evidence for the Holding Up A Mirror To Cricket report. The commission made 44 recommendations, including a call for the England and Wales Cricket Board to make a public apology recognising that racism, sexism, elitism and class-based discrimination existed – and still exist – and recognise the impact of that upon victims. “We heard from a former Muslim player who had to endure the indignity of his team-mates laughing and joking about one of the players using the prayer mat to clean up after sex,” she said. “The stories were absolutely horrific and it goes to show that the culture in cricket is rotten.” Ms Butts said women are treated as “subordinate” to men in the sport and have been subjected to harassment. “What we’ve seen is that women are vulnerable when around a drinking culture, they are subjected to sexual harassment, lots of sexting,” she said. “We’ve heard from a number of women who talk about being vulnerable and being exposed and having unwanted advances made on them by men.” In a letter to her, ECB chair Richard Thompson apologised and said: “We will use this moment to reset cricket.” “Cricket should never exclude anyone on the basis of their ethnicity, gender or social background,” Mr Thompson said. “We apologise unreservedly for these experiences, and are thankful for the courage of those who have shared them with the ICEC, whilst recognising there will be many more who felt unable to give their accounts.” Among the recommendations is a call for a fundamental overhaul of the pay structure in the women’s professional game and equal representation for the women’s game throughout the governance structure of English and Welsh cricket.","pubDate":"2023-06-27 03:06:40","image_url":"https://static.independent.co.uk/2023/06/27/04/dce57169a0976a18dfa0220b3d3796c6Y29udGVudHNlYXJjaGFwaSwxNjg3OTE5MTY4-2.43477530.jpg?width=1200&auto=webp","source_id":"independentuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Team India: NCA में लगी महफिल, पुराने दोस्तों से मिले ऋषभ पंत, शेयर की दिल छू लेने वाली तस्वीरें","link":"https://navbharattimes.indiatimes.com/sports/cricket/cricket-news/rishabh-pant-reunited-with-team-india-players-at-nca-photo-viral/articleshow/101292617.cms","keywords":null,"creator":null,"video_url":null,"description":"टीम इंडिया के स्टार विकेटकीपर बल्लेबाज ऋषभ पंत सोशल मीडिया पर काफी एक्टिव रहते हैं। वह आए दिन कुछ ना कुछ अपने फैंस के साथ साझा करते रहते हैं।","content":"भारतीय क्रिकेट टीम इन दिनों छुट्टी पर चल रही है। वर्ल्ड टेस्ट चैंपियनशिप 2023 के फाइनल के बाद से टीम इंडिया के प्लेयर्स आराम कर रहे हैं। कुछ खिलाड़ी छुट्टियों का आनंद ले रहे हैं तो कुछ अपनी फिटनेस पर मेहनत कर रहे हैं। वहीं कुछ चोटिल भारतीय खिलाड़ी मौजूदा वक्त में बेंगलुरु में स्थित नेशनल क्रिकेट अकेडमी में हैं, जिसमें और केएल राहुल भी हैं। जबकि कुछ प्लेयर्स आने वाली वेस्टइंडीज सीरीज के लिए वहां अपनी तैयारियां कर रहे हैं। ऐसे में एक बार फिर कुछ पुराने यार एक साथ नजर आए हैं। भारतीय क्रिकेट टीम के स्टार विकेटकीपर बल्लेबाज ऋषभ पंत पिछले 6 महीने से क्रिकेट से दूर चल रहे हैं। उनका दिसंबर 2022 के अंत में भयानक कार एक्ससीडेंट हुआ था, जिसके चलते वह काफी ज्यादा चोटिल हो गए थे। हालांकि सर्जरी के बाद से पंत तेजी से रिकवर कर रहे हैं। इसी के साथ पंत की मुलाकात नेशनल क्रिकेट अकेडमी में केएल राहुल, मोहम्मद सिराज, युजवेंद्र चहल और शार्दुल ठाकुर से हुई। आपस में सब काफी खुश नजर आ रहे थे। पंत ने खुद इस खास मुलाकात की तस्वीरें सोशल मीडिया के सबसे चर्चित प्लेटफॉर्म ट्विटर पर शेयर की हैं, जिसकी केप्शन में उन्होंने लिखा है, 'गैंग के साथ रीयूनियन करना हमेशा मजेदार रहता है। उनकी यह पोस्ट इस वक्त चर्चा में भी है। अगले महीने यानी जुलाई में टीम इंडिया वेस्टइंडीज जाएगी। जहां वह कैरेबियाई टीम के साथ 2 टेस्ट, 3 वनडे और 5 टी20 मुकाबले खेलने वाले हैं। दौरे की शुरुआत 12 जुलाई को टेस्ट मैच के साथ होगी। बीसीसीआई ने वेस्टइंडीज टूर के लिए भारत की टेस्ट और वनडे टीम की घोषणा भी कर दी है। रोहित शर्मा (कप्तान), शुभमन गिल, ऋतुराज गायकवाड़, विराट कोहली, यशस्वी जायसवाल, अजिंक्य रहाणे, केएस भरत, ईशान किशन, रविचंद्रन अश्विन, रविंद्र जडेजा, अक्षर पटेल, शार्दुल ठाकुर, नवदीप सैनी, जयदेव उनादकट, मोहममद सिराज और मुकेश कुमार। रोहित शर्मा (कप्तान), शुभमन गिल, ऋतुराज गायकवाड़, विराट कोहली, सूर्यकुमार यादव, संजू सेमसन, ईशान किशन, हार्दिक पंड्या, शार्दुल ठाकुर, रविंद्र जडेजा, अक्षर पटेल, युजवेंद्र चहल, कुलदीप यादव, जयदेव उनादकट, मोहममद सिराज, उमरान मलिक और मुकेश कुमार।","pubDate":"2023-06-27 02:31:23","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Sarfaraz Khan: सरफराज करेंगे सिलेक्टर्स के बुलावे का इंतजार, नजरअंदाज होने के बाद डोमेस्टिक सीजन में फिर बनेंगे आग","link":"https://navbharattimes.indiatimes.com/sports/cricket/cricket-news/sarfaraz-khan-getting-ready-for-duleep-trophy-waiting-for-selectors-call-again/articleshow/101291698.cms","keywords":null,"creator":null,"video_url":null,"description":"मुंबई के युवा बल्लेबाज सरफराज खान घरेलू क्रिकेट में जमकर रन बना रहे हैं। लेकिन इसके बावजूद उन्हें भारतीय टीम के चयनकर्ता लगातार नजरअंदाज कर रहे हैं। उन्हें आगमी वेस्टइंडीज टेस्ट सीरीज के लिए भी नहीं चुना गया।","content":"सरफराज का अर्थ ऊंचा, ऊंचे कद का, बुलंद, प्रतिष्ठित होता है। मुंबई के क्रिकेटर के हौसले तो बुलंद हैं और वह क्रिकेट के दुनिया में प्रतिष्ठित होने के लिए हर वह काम भी कर रहे हैं जिसकी अपेक्षा एक युवा क्रिकेटर से की जाती है। मगर, ऐसी 'अफवाह' है कि कद-काठी उनके आगे बढ़ने में आड़े आ रही है। घरेलू क्रिकेट में रनों का अंबार लगाने के बावजूद 25 साल के इस बल्लेबाज को नैशनल सिलेक्टर्स लगातार नजरअंदाज कर रहे हैं। वैसे सरफराज के करीबियों का कहना है कि यह युवा थोड़े समय के लिए हताश होने के बाद एक बार फिर अगले सीजन के लिए कमर कस चुका है। वह फिर से ढेर सारे रन बनाकर सिलेक्टर्स के बुलावे का इंतजार करेगा। सरफराज 5 जुलाई से होने वाले दलीप ट्रोफी सेमीफाइनल के लिए कड़ी मेहनत कर रहे हैं। सरफराज के पिता नौशाद खान खुद क्रिकेटर रह चुके हैं और बेटे के पहले कोच भी वही हैं। NBT ने जब नौशाद से बेटे को नहीं सिलेक्ट करने पर प्रतिक्रिया जाननी चाही तो उन्होंने कहा, 'प्रतिक्रिया देना हमारा काम नहीं। किसी भी बल्लेबाज का कम रन बनाना और मैच जीतना होता है।' इसके अलावा उन्होंने इस मुद्दे पर कुछ भी बोलने से इनकार कर दिया। सरफराज भी इस मुद्दे पर कुछ नहीं बोलने के बजाय बल्ले से बात करने की ठानी है। सरफराज के कुछ अन्य करीबियों ने इस मुद्दे पर सीधे तौर पर बात तो नहीं की, लेकिन इस बात को लेकर खफा दिखे कि उनके बारे में गलत बातें फैलाई जा रही हैं। उनके एक साथी ने कहा कि पिछले सीजन में दिल्ली के खिलाफ सेंचुरी बनाने के बाद सरफराज ने आक्रामक तरीके से जश्न जरूर मनाया था, लेकिन यह किसी को अपमानित करने के लिए नहीं था। यहां तक कि पहले जो कहा गया कि वह स्टेडियम में बैठे तत्कालीन चीफ सिलेक्टर की ओर उंगली दिखा रहे थे, गलत है। दरअसल, उस मैच में चेतन तो थे ही नहीं। सरफराज की 125 रन की पारी पर तो कोच अमोल मजूमदार ने अपनी कैप उतारकर उन्हें शाबाशी दी थी। सरफराज से जुड़े एक एक्सपर्ट ने कहा कि उनकी फिटनेस को लेकर भी गलत बातें फैलाई जा रही हैं। वह फर्स्ट क्लास मैच में चार या पांच दिन फील्ड पर रहते हैं और बैटिंग करते हुए लंबी-लंबी पारियां भी खेलते हैं। उनके नाम फर्स्ट क्लास में तिहरा शतक (301*) भी है। वह एक शानदार फील्डर भी हैं। सरफराज यो-यो टेस्ट पास करने के लिए जरूरी 16.5 का स्कोर भी हासिल कर चुके हैं। ऐसे में उनकी फिटनेस पर भी सवाल नहीं उठाए जा सकते। एक कोच ने कहा कि दुनिया में सरफराज की कद-काठी के कई बड़े क्रिकेटर हो चुके हैं। अर्जुन रणतुंगा और डेविड बून को आसानी से याद किया जा सकता है। सरफराज खान को भारतीय टीम में क्यों सिलेक्ट नहीं किया जा रहा है, इसका जवाब तो सिलेक्टर ही दे सकते हैं। मगर, शायद टीम कॉम्बिनेशन को देखते हुए उनकी जगह नहीं बन रही है। सरफराज पांचवें नंबर पर बैटिंग करते हैं। टेस्ट टीम में फिलहाल अजिंक्य रहाणे उस जगह पर उतरते हैं। रहाणे बीच में बाहर हुए थे, लेकिन वापसी पर उन्होंने वर्ल्ड टेस्ट चैंपियनशिप में एक अच्छी पारी खेली है। ऐसे में उनको ड्रॉप करना मुश्किल था। सरफराज को लगातार अच्छा प्रदर्शन करना होगा और अपनी बारी का इंतजार करना होगा। सरफराज को अपने प्रदर्शन से चयनकर्ताओं के दरवाजे पर महज दस्तक नहीं देनी होगी बल्कि ऐसा खेल दिखाना होगा कि दरवाजा ही ध्वस्त हो जाए।","pubDate":"2023-06-27 01:22:14","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Cricket Record: 1 ओवर में पड़े थे 77 रन, अंपायर से लेकर फैंस हर किसी का घूम गया था सिर, जानें कैसे हुआ मुमकिन?","link":"https://navbharattimes.indiatimes.com/sports/cricket/cricket-news/bert-vance-most-expensive-over-cricket-history-gavee-77-runs/articleshow/101291566.cms","keywords":null,"creator":null,"video_url":null,"description":"क्रिकेट के इतिहास में कई ऐसे कारनामे हुए हैं, जिनपर विश्वास करना मुश्किल ही नहीं नामुमकिन है। उनमें से ही एक है फर्स्ट क्लास मैच के एक ओवर में 77 रन पड़ना।","content":"इस समय वर्ल्डकप क्वालिफायर में खेले गए नीदरलैड्स और वेस्टइंडीज के मैच की जमकर चर्चा हो रही है। हर तरफ उसी मैच का खुमार है। नीदरलैंड्स और वेस्टइंडीज के बीच खेला गया मुकाबला क्रिकेट के इतिहास के सबसे रोचक मैचों में से एक था। वेस्टइंडीज ने पहले बल्लेबाजी करते हुए 6 विकेट पर 374 रन बनाए थे। इसके जवाब में नीदरलैंड्स ने भी 374 रन जड़ डाले। वहीं सुपर ओवर में डच टीम के ऑलराउंडर लोगन वैन बीक ने 30 रन जड़ दिए और रिकॉर्ड बना दिया। इतना ही नहीं बल्कि उन्होंने सुपर ओवर में 2 विकेट भी लिए और डच टीम को 22 रन से मैच जिता दिया।आपने वनडे और टी20 में ऐसे चमत्कार होते देखे हैं, जहां एक ओवर में 36 या उससे अधिक रन पड़ रहे हों। लेकिन क्या आपने किसी फर्स्ट क्लास मैच के एक ओवर में 77 रन पड़ते हुए देखे हैं? जी हां, आपने सही पढ़ा 77 रन। आइये आपको इस मैच के बारे में बताते हैं। यह फर्स्ट क्लास मुकाबला न्यूजीलैंड के क्राइस्टचर्च में हो रहे कैंटरबरी और वेलिंगटन के बीच में खेला गया था। शेल ट्रॉफी के इस मैच में गजब हो गया। 20 फरवरी को खेले गए इस मुकाबले के आखिरी दिन केंटरबरी को जीत के लिए दो ओवर में 77 रन की दरकार थी। ऐसे में वेलिंगटन ने बर्ट वेंस को बॉल थमाई और बल्लेबाजों को ललचाने का प्रयास किया। लेकिन यह प्लान उनपर ही उल्टा पड़ गया। बर्ट ने इस ओवर में कुल 22 गेंदें डाली, जिसमें से 17 नो बॉल थीं। इस ओवर में 8 छक्के और 6 चौके लगे। गौरतलब है कि बर्ट वेंस के इस ओवर में इतनी गेंद डली कि अंपायर ही गेंदों की गिनती भूल गया, जिसके चलते इस ओवर में सिर्फ 5 लीगल डिलिवरी ही डल पाई। आखिरी ओवर में कैंटरबरी को जीत के लिए 18 रन चाहिए थे। लेकिन वह 17 रन ही बना पाए और मैच ड्रॉ रहा। वेंस का वो ओवर कुछ इस प्रकार था- 0444664614106666600401","pubDate":"2023-06-27 00:43:15","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Pressure on Australia to host five-day women's Test","link":"https://thewest.com.au/sport/cricket/pressure-on-australia-to-host-five-day-womens-test-c-11101830","keywords":null,"creator":["Scott Bailey"],"video_url":null,"description":"England captain Heather Knight wants all women's Tests to be played over five days after the Trent Bridge success, including the next Ashes series in Australia.","content":"England captain Heather Knight has put the heat on Cricket Australia to schedule a five-day Test for their next Ashes tour, desperate for the era of four-day internationals to end. Australia's 89-run win over England in Nottingham snapped a run of six straight draws in women's Tests dating back to 2017. It coincided with the match being the first five-day Test for women since 1992, with all matches since then having been scheduled for no more than four days. A world record of 22,203 fans attended the contest at Trent Bridge, while the 3.67 run-rate was the highest ever for a women's Test and 40 wickets were taken for only the second time since 1995. Knight has long been a proponent of five-day Tests, having rallied administrators in England to make the change. Asked if all Test matches, including the 2024-25 Ashes clash in Australia, should now be five-day games, Knight said: \"I think so. \"The fact is we have been able to see Tammy get 200, Sutherland get a hundred batting at No.8, Sophie Ecclestone get two five-wicket hauls and Ash get an eight-wicket haul. \"They are really special performances we might not have seen if it wasn't over five days. \"It means if you play four, you really have to try and manufacture a result. I don't think the game gets the credit it deserves if that happens. \"I would love to see five days but that's above my head.\" Australia will host South Africa in a Test next February in Perth, but that is so far only scheduled for four days. CA's head of operations Peter Roach said last year that it would not alter its plan for four-day Tests, but that a fifth day could be added in reserve for bad weather. \"We acknowledge that Boards can select four or five days for women's Test matches,\" Roach said last September. \"At this stage we will continue with four-day Test matches in Australia but may consider a reserve fifth day for Tests significantly affected by the weather.\" Australia captain Alyssa Healy is also not entirely sold on the five-day argument, adamant results can still be achieved within four. \"We've also had results in a four-day Test match before so I'm not going to sit here and say five days is the way forward,\" Healy said after the Trent Bridge win. \"But I will say if there is a threat of rain, having that reserve day is not such a bad thing. \"We saw it in the Test Championship final for the men they had a reserved six day for the Test match.\" Sign up for our emails","pubDate":"2023-06-27 00:05:02","image_url":"https://images.thewest.com.au/publication/C-11101830/5d5e521a2877a7767de8063c6f874f60a0c3dbcb-16x9-x0y0w1280h720.jpg","source_id":"thewest","category":["sports"],"country":["australia"],"language":"english"},{"title":"‘Adrenaline does funny things’: Injured Gardner lifts Australia to Test triumph","link":"https://www.theage.com.au/sport/cricket/gardner-s-record-breaking-performance-lifts-australia-to-ashes-triumph-20230626-p5djnt.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":["Sport / Cricket"],"creator":["Scott Bailey"],"video_url":null,"description":"A stellar performance from Ashleigh Gardner led Australia to an 89-run Ashes Test victory at Trent Bridge, and she did it all with an injury to her spinning finger.","content":"Ashleigh Gardner has revealed her record-breaking 12 wickets against England came while battling ligament damage in her spinning finger during Australia’s Ashes Test win. Gardner was the star of Australia’s 89-run victory over England at Trent Bridge, bagging 8-66 in the fourth innings to help bowl England out for 178 and end their pursuit of 268. The haul left her with the best-ever figures by an Australian woman, and the second best of all time behind Neetu David’s 8-53 for India against England in 1995. Gardner’s match figures of 12-165 were also the second best in history to Shaiza Khan’s 13-226 for Pakistan from 2004, and the best of any Australian woman. But the more impressive part was the fact she did it with concerns over her right index finger. Gardner was hit on the end of the finger during slips practice during Australia’s warm-up match against England A, denying her the chance to bowl before the Test. Australia’s Ashleigh Gardner celebrates after taking the wicket of England’s Danni Wyatt. Credit: AP “My finger obviously bent backwards where it’s probably not supposed to. It’s almost stretched that ligament a little bit,” Gardner said. “Adrenaline does funny things and I completely forget about it as soon as the ball was in hand. “So as soon as I wasn’t bowling (at Trent Bridge), I put a splint straight on it, just to protect it because in the field is where I’m more likely to get hit. “It was quite frustrating but because I didn’t get that match practice in before the Test. England’s Danni Wyatt is out LBW. Credit: REUTERS “It was about trusting what I’d already done, I wasn’t going to lose a skill overnight. And know my good stuff was good enough.” Gardner took all five of England’s remaining wickets on day five to finish off the hosts, ending any chance of the chase and putting Australia in control of the multi-format series. She also did it off little sleep, after her mind was fixated on finishing off the match. “I was awake at 3am thinking about bowling, which was a bit tragic,” Gardner said. “I was wide awake, literally thinking about how I was going to get the batters out and I’ve never done that before.” Gardner’s performance marked a coming-of-age with the ball. Bowling on a deteriorating day-five pitch for the first time, the 27-year-old took wickets with balls that went straight on, spun sharply, stayed low and reared up. Once picked as a powerhouse batter, Gardner has now developed into a genuine all-rounder and a frontline spinner. “It has been something that I’ve worked really hard on,” Gardner said. “With both bat and ball, it’s about consistency. “I feel like I can play both roles in attacking and then trying to defend with the ball as well. It’s asking the captain, ‘what do you want me to do?’ at that point in time. “Today is something I’m going to remember for the rest of my life, and certainly for the rest of my career.” The result ends a run of six straight draws in women’s Tests, with this the first match since 1992 to be given a fifth day. AAP News, results and expert analysis from the weekend of sport sent every Monday. Sign up for our Sport newsletter . Watch every ball of the 2023 Ashes series live and exclusive on Nine and 9Now.","pubDate":"2023-06-26 23:22:57","image_url":null,"source_id":"theage","category":["sports"],"country":["australia"],"language":"english"}]}