{"newsArray":[{"article_id":"fb28c1434b6d670f4533447a02c27472","title":"Jason Roy is DROPPED from England's World Cup squad after suffering back spasms as Harry Brook is included for tournament in India despite struggling in New Zealand series","link":"https://www.dailymail.co.uk/sport/cricket/article-12528421/Jason-Roy-DROPPED-Englands-World-Cup-squad-suffering-spasms-Harry-Brook-included-tournament-India-despite-struggling-New-Zealand-series.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"It was not just that England realised they would have to create space for the generational talent of Brook. More pertinent was the failure of Roy to play against New Zealand.","content":"Jason Roy is DROPPED from England's World Cup squad after suffering back spasms as Harry Brook is included for tournament in India despite struggling in New Zealand series Roy played no part in England's 3-1 series win over New Zealand with back issues Brook wasn't originally in the squad and failed to make much of an impact But the selectors decided Brook was a safer bet given Roy's injury problems By Paul Newman for the Daily Mail Published: 14:30, 17 September 2023 | Updated: 23:16, 17 September 2023 e-mail 85 shares 15 View comments Jason Roy's England career was ended on Sunday when he was replaced in the World Cup squad by Harry Brook. Roy was named last month in what national selector Luke Wright insisted was the squad for the one-day series against New Zealand and also the World Cup. Although Roy revealed in an interview with Mail Sport h e had been told he would definitely be travelling to India for next month’s tournament it quickly became clear England would be forced into a U-turn and instead their World Cup squad became ‘provisional’. It was not just that England realised they would have to create space for the generational talent of Brook — even though he had a quiet time in the 50-over series against New Zealand, making just 37 runs from 68 balls in three innings. More pertinent was the failure of Roy to play throughout England’s 3-1 victory because of a series of back spasms that ruled him out, in two cases, even after he had taken part in the warm-ups. Opening batter Jason Roy has been left out of England's squad for next month's ODI World Cup in India The versatile Harry Brook has been called up in his place having controversially been left out the original 15 Roy has missed a run of games for his country after struggling with injury and his international future is now unclear Even as late as Friday when England completed their series victory thanks to a century from the man who took Roy’s opening place in Dawid Malan, captain Jos Buttler was talking about adding Roy to the second-string squad to play Ireland this week in the hope he could prove his form and fitness. But now Buttler has been forced to concede defeat in his backing of one of the most influential figures in England’s white-ball domination and has surely called time on his 50-over career following an equally difficult call in leaving him out of the squad that won the Twenty20 World Cup last year. ‘We have selected a squad we are confident can go to India and win the World Cup,’ said Wright. ‘We are blessed with an incredibly strong group of white-ball players which was underlined by the strong performances in the win against a very strong New Zealand. ‘The strength of the squad has meant we have had to make some tough decisions on world-class players with Jason Roy missing out and Harry Brook coming into the squad.’ Dawid Malan is England's form player entering the tournament and he made a century in the final ODI with New Zealand at Lord's on Friday England World Cup squad Jos Buttler (Lancashire – captain); Moeen Ali (Warwickshire); Gus Atkinson (Surrey); Jonny Bairstow (Yorkshire); Harry Brook (Yorkshire); Sam Curran (Surrey); Liam Livingstone (Lancashire); Dawid Malan (Yorkshire); Adil Rashid (Yorkshire); Joe Root (Yorkshire); Ben Stokes (Durham); Reece Topley (Surrey); David Willey (Northamptonshire); Mark Wood (Durham); Chris Woakes (Warwickshire) <!- - ad: https://mads.dailymail.co.uk/v8/gb/sport/cricket/article/other/mpu_factbox.html?id=mpu_factbox_1 - -> Advertisement Now Malan — who made himself undroppable in making 277 runs at 92.33 in three games against New Zealand, including that match-winning century at Lord’s — will step out alongside Jonny Bairstow to open at the start of England’s World Cup defence in Ahmedabad against New Zealand on October 5. Brook surely should have been included in the first place after announcing himself in spectacular fashion over the last 18 months, most notably in Test cricket where he has made 1,181 runs at 62.15 and a strike-rate of 91. Roy, meanwhile, has reached the end of the international road. He suffered from injury during the last two tournaments he played in and caused controversy in May when he asked to be released from his incremental contract to play in the inaugural Major League Cricket event in the US. He became a victim of the standards he helped set in his 116 ODIs, including what was England’s highest 50-over score of 180 until Ben Stokes broke it at the Oval last week. Roy was part of England's squad that won the tournament in 2019 and claimed he was told he would be in the travelling party Now, at 33, his future is at Surrey and, more regularly, as a leading figure in the franchise world. Brook, 24, was originally not in the World Cup squad named last month but was added to the squad for the New Zealand series and despite failing to impress with just 37 runs in three innings, England have decided to opt for the Yorkshireman rather than opener Roy after Dawid Malan all but certainly secured his spot at the top of the order with 277 runs across three innings against the Black Caps. Roy, who was an integral part of England's World Cup winning campaign in 2019, is now set to miss a second successive World Cup after he was also not picked for the T20 World Cup squad last winter. England begin their World Cup defence in Ahmedabad against New Zealand on October 5. Share or comment on this article: Jason Roy is DROPPED from England's World Cup squad after suffering back spasms as Harry Brook is included for tournament in India despite struggling in New Zealand series e-mail 85 shares Add comment Comments 15 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-09-17 22:16:52","image_url":"https://i.dailymail.co.uk/1s/2023/09/17/14/75528027-0-image-a-36_1694957419289.jpg","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"24a72e1f133cc25d201261fd845884a7","title":"Iconic Cricket Ground’s Potential £23m Sale to Safeguard Struggling Club’s Future","link":"https://insidexpress.com/sports-athletics/iconic-cricket-grounds-potential-23m-sale-to-safeguard-struggling-clubs-future/?utm_source=rss&utm_medium=rss&utm_campaign=iconic-cricket-grounds-potential-23m-sale-to-safeguard-struggling-clubs-future","keywords":["Sports & Athletics","23M","clubs","Cricket","future","Grounds","Iconic","Potential","Safeguard","Sale","struggling"],"creator":["The Insidexpress"],"video_url":null,"description":"YORKSHIRE are reportedly considering selling Headingley Cricket Ground in an attempt to guarantee the club’s survival. The county cricket club bought the ground in 2005 from Leeds Cricket, Football and…","content":"YORKSHIRE are reportedly considering selling Headingley Cricket Ground in an attempt to guarantee the club’s survival. The county cricket club bought the ground in 2005 from Leeds Cricket, Football and Athletic Company for a fee believed to be £12million. Yorkshire are reportedly considering selling Headingley Credit: Getty It is the ground that saw Ben Stokes’ heroics in 2019 Credit: Getty Chris Woakes (R) and Mark Wood (L) combined to beat Australia earlier this summer in the Ashes Credit: Getty The Daily Mail have now reported that the club are looking for £23m to sell the ground. The touted figure would represent a decent return for the club that has come under financial pressure. Yorkshire has been dealing with financial issues since the loss of sponsors and costs from the Azeem Rafiq racism scandal of around £3.5m. The report claims that Yorkshire are looking for £20m in new investment but have had no luck despite interest from former Newcastle United owner Mike Ashley, a Saudi prince and some IPL franchises. It is also suggested that Yorkshire are considering selling the ground and leasing it back in a similar model that has been utilised by football clubs. It is also thought that there have been several bids “rejected” to buy the club outright. This is because members still want control of the club. A sale of the ground would provide the necessary funds to pay a £15.9m bill that is owed to the family of former chairman Colin Graves. The remainder of the money left over from the sale could also pay running costs for several years. Headingley has played host to some special cricketing moments in recent years. It was the ground where Ben Stokes performed his heroics during the Ashes series in 2019. And again earlier this year, it was the ground that Mark Wood and Chris Woakes steered England to victory over the Aussies in the Ashes. The ground has been valued at £23million by a global real estate company Credit: Getty The money made from the Ashes Test earlier this summer was enough to get Yorkshire through the season. Yorkshire chief executive Stephen Vaughan told the Daily Mail: “We cannot comment on commercially sensitive information. “We are making strong progress on securing the long-term future of Yorkshire County Cricket Club and look forward to announcing positive developments shortly.” Publisher","pubDate":"2023-09-17 21:23:11","image_url":null,"source_id":"insidexpress","source_priority":2653465,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"ad5b2da5a022b767046df3a32e98f9d5","title":"Fiji blows away Wallabies in crucial match","link":"https://www.fbcnews.com.fj/sports/rwc-2023/fiji-blows-away-wallabies-in-crucial-match/","keywords":["RWC 2023"],"creator":["Fredrica Nagan"],"video_url":null,"description":"The Fiji Water Flying Fijians have created history after beating two time champions Australia 22-15 for the first time at a Rugby World Cup. It’s been 69 years since Fiji last beat the Wallabies in a Test following their 18-16 win at the Sydney Cricket Ground in 1954. Fiji played with heart throughout the 80 […]","content":"The Fiji Water Flying Fijians have created history after beating two time champions Australia 22-15 for the first time at a Rugby World Cup. It’s been 69 years since Fiji last beat the Wallabies in a Test following their 18-16 win at the Sydney Cricket Ground in 1954. Fiji played with heart throughout the 80 minutes and one can tell they were still hurting from the result last week against Wales and wanted to stay in the competition. An emotional head coach Simon Raiwalui says he couldn’t be more proud of the way his men played today. Two successive penalties against the national side saw Ben Donaldson converting one for a three-point lead. The national side regrouped and started pressuring the Aussies with some variations in their play. Josua Tuisova, Levani Botia, Viliame Mata and Lekima Tagitagivalu made some early strong carries that rattled Australia before Simione Kuruvoli slotted a penalty an offside penalty to lock the scores at 3-all after 11 minutes. Player of the Match Josua ‘The Bus’ Tuisova says it has been a long time coming. Australia openside flanker Fraser McReight was penalized at a breakdown six minutes later with Kuruvoli adding another three points. However, a 50-20 kick by halfback Nic White saw Mark Nawaqanitawase ran in to score after a confused Radradra thought it was Fiji’s throw in the lineout. Nawaqanitawase took a quick throw in to Kerevi before he was tackled by Nayacalevu close to the tryline but he was able to release the ball to his winger to score. Kuruvoli put Fiji back in front with his third penalty after the referee penalized White for a high tackle on our halfback before adding another for the Waisea Nayacalevu-captained side to lead 12-8 at halftime. Captain Waisea Nayacalevu says this win is special. Despite two lineouts inside their red zone, Australia still contested Fiji’s throws and were successful on two occasions before the break. Winger Jiuta Wainiqolo was injured after his first carry in the second spell and he was replaced by Vinaya Habosi. A box kick by Kuruvoli was uncontested by the Australians who let the ball bounce but it went straight into the hands of Tuisova who ran away to score. Kuruvoli added the extra two points for a personal tally of 14 points in the match before he was replaced by Frank Lomani. Australia’s coach Eddie Jones brought in Suliasi Vunivalu and moved Nawaqanitawase to fullback with Donaldson shifting to flyhalf. Jones’s counterpart Simon Raiwalui changed his front-row after 10 minutes with Peni Ravai, Tevita Ikanivere and Mesake Doge coming in. The Flying Fijians forwards never stepped back from the get go and were clinical in the contact zone with Botia winning the battle at the breakdown at crucial times. Tuisova was at his usual best and the Aussies had to work overtime when he gets the ball. Fiji’s demolition man, Botia, had to leave the field due to injury while Doge had an head injury assessment. Albert Tuisue was introduced as substitute for Botia while Tagi returned for Doge. Our side kept the scoreboard pressure after Lomani nailed a penalty 15 minutes from full-time but Australia closed the gap with Vunivalu crashing over from five meters out.","pubDate":"2023-09-17 20:38:14","image_url":"https://www.fbcnews.com.fj/wp-content/uploads/2023/09/SIMON-R.mp3","source_id":"fbcnews","source_priority":229234,"country":["fiji"],"category":["sports"],"language":"english"},{"article_id":"9e530ff67b47ea284a602f40a787afd8","title":"La Deporteca estrena nueva temporada","link":"https://www.marca.com/radio/2023/09/17/65031fb422601d65068b45e1.html","keywords":["Radio Marca","cultura","Otros Deportes"],"creator":["Natalia Freire"],"video_url":null,"description":null,"content":"omenzamos una nueva temporada de esta aventura llamada , que nació allá por septiembre de 2004, en la que se conjuga la cultura y el deporte. Después de diecinueve años seguimos demostrando que el deporte es cultura y que existe una cultura del deporte. En este primer programa presentamos a tres colaboradores de lujo que nos acompañarán esta temporada. , en su sección, , nos contará curiosidades y anécdotas de la música y los músicos relacionados con los deportes. , director de cine, realizador, guionista y profesor de actores, nos hablará en la sección, , de la conexión del deporte con el cine. , escritor y profesor, en su sección, , nos descubrirá a excéntricos y curiosos personajes relacionados con el deporte que inspiran relatos literarios. Además de todo esto, continuaremos con las entrevistas a músicos, autores y todo tipo de artistas que hayan encontrado una conexión entre el deporte y la cultura. Julio Ruiz estuvo durante cincuenta años al frente del programa en RNE. Tras su jubilación se embarcó en nuevas aventuras como el podcast que publica cada semana en y en la sección en donde cada semana nos cuenta curiosidades y anécdotas recogidas durante su larga carrera como periodista musical en la que ha tenido oportunidad de conocer de cerca a muchos músicos que encontraron inspiración en el deporte y publicaron trabajos relacionados con deportes o deportistas o bien se mostraron como aficionados o practicantes de algún deporte. Aprovechando la presentación de la nueva temporada Julio Ruiz nos brindó un aperitivo de lo que será su sección: en una charla reciente con de hablando sobre su proyecto en solitario, , el artista confirmó que su hijo estaba jugando al fútbol en un equipo de Granada y que apuntaba maneras. Con hablamos hace unos meses, en la víspera del inicio del Giro de Italia cuando recién acababa el rodaje de su última película, , que está en fase de montaje. Comenzó su trayecto cinematográfico en la Facultad de Bellas Artes de Cuenca, donde estudió y trabajó en varios proyectos conjuntos. Después realizó cursos de guion cinematográfico en Madrid y de dirección en UQAM (Université du Québec à Montréal) en Canadá, así como un master en 'Experto en dirección cinematográfica' en la Universidad Camilo José Cela. Ha filmado varios cortometrajes como ' ' o ' ' y los largometrajes ' ', y ' ', ' ' y la antes citada, ' ' en la que el periodista . Además, es en es un centro especializado en la formación y entrenamiento de actores y actrices para cine y televisión y para la formación integral del actor. En el ámbito literario tiene publicadas tres novelas: ' , (Premio nacional de novela histórica) y ' \". En el mundo del cómic he escrito la serie ' ', publicada en varios países y traducida a seis idiomas y, precisamente de este cómic nos habló en su debut como colaborador en La Deporteca. \"Fue de la mano del dibujante, , que es un dibujante consolidado dentro del mercado franco/belga, que es quizá en Europa el mercado más importante que hay en cómics. Nos conocimos, le conté la historia y él se la contó a los editores franceses a los que les pareció maravilloso porque es historia y deporte y a los franceses les apasionan esas dos cosas, el cómic y los deportes, así que nos lanzamos, la escribimos y ha sido un éxito\". En este cómic aparece un personaje del que nos habló Juanra Fernández: , un auriga que está considerado el deportista que más dinero ha ganado en la historia, por encima incluso de nombres como . Precisamente el personaje de aparece en el último libro del profesor y escritor . Ya son unas cuantas temporadas las que llevamos contando con la colaboración de este contador de historias divertidas y curiosas que pasan normalmente desapercibidas. Desde , apodado , que fingió ser futbolista durante muchos años pero que siempre se las arreglaba para no jugar ningún partido y que todo el mundo comprobara que no sabía jugar, hasta , conocido como y el personaje que interpretó en la película y que era amigo del Premio Nobel de Literatura, con el que compartía largas charlas sobre cricket. Cada semana en , y siempre que quieras en el podcast, tienes una cita con la cultura y el deporte.","pubDate":"2023-09-17 19:52:40","image_url":"https://phantom-marca.unidadeditorial.es/ced7ee89e37e8d3539634c449a1b7a5c/resize/600/assets/multimedia/imagenes/2023/09/14/16947145711659.jpg","source_id":"marca","source_priority":426,"country":["colombia"],"category":["sports"],"language":"spanish"},{"article_id":"15c99102a783b1e960bb3b4d60e96c7b","title":"“Not hot favourites”: Former cricketer Atul Wassan on India’s World Cup chances","link":"https://thenewsmill.com/2023/09/not-hot-favourites-former-cricketer-atul-wassan-on-indias-world-cup-chances/","keywords":["Cricket","Sports","ANI"],"creator":["ANI"],"video_url":null,"description":"The News Mill","content":"While India reigned supreme at the Premadasa on Sunday, humbling defending champions Sri Lanka by 10 wickets to lift their 8th Asia Cup, former international cricketer Atul Wassan said the ‘Men in Blue’ were not the “hot favourites” going into the ODI World Cup next month. The 50-over showpiece, to be hosted in India this year, will get underway in less than a couple of weeks from now. Weighing in on India’s chances to claim their third world crown after 2013 when a certain MS Dhoni led his boys to glory, Wassan said he believed that much of the team’s prospects in the tournament would depend on the nature of the surfaces they play on and whether they build on their success in the Asia Cup. “We are ready for the World Cup. The Indian fans believe that they are the hot favourites to lift the trophy this year. However, if our team goes into the tournament as the favourite and suffers an early exit, the fans will be left heartbroken as they have been over the last 13 years. Hence, I believe it is best to temper our expectations while being cautiously optimistic about our chances. I think we are not the hot favourites. Much of our chances in the tournament would depend on how we go from here (Asia Cup success) and the kind of pitches we play on,” the former India speedster told ANI. He added that he was in agreement with head coach Rahul Dravid’s tactic of employing new ball bowlers, who are best suited to red-ball or Test format, in 50-over cricket as they would extract more movement and swing from the red cherry in the early overs. “I would personally endorse Rahul Dravid’s thinking that bowlers, mostly suited to the Test format, will also do well in ODIs as the new ball swings and seams in the early overs and a team needs to go in with attacking bowlers who can get early breakthroughs. You can’t have attacking bowlers in ODIs operating on defensive lines and lengths and trying to save runs. It’s wickets that win you matches,” the former India opening bowler added. Hailing Team India’s dominating win in the Asia Cup final on Sunday, Wassan said the team does look settled ahead of the showpiece event, with key players back from injuries and on song. “Delighted as I am at India winning the Asia Cup after 5 years, I believe that this victory is only the beginning. It’s the beginning of a process that can take us to more glories down the road. Everyone is looking forward to India going well in the World Cup and our team does look balanced and settled,” Wassan signed off saying. (ANI)","pubDate":"2023-09-17 19:30:11","image_url":null,"source_id":"thenewsmill","source_priority":3781717,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"7ac65ccc4e854a140d4ef73effecefdd","title":"Sports Highlights: অষ্টমবার এশিয়াসেরা ভারত, কিশোর ভারতীতে লা লিগার অ্যাকাডেমি, এক নজরে খেলার সব খবর","link":"https://bengali.abplive.com/sports/sports-highlights-know-latest-updates-of-teams-players-matches-and-other-highlights-17th-september-1009884","keywords":["খেলা"],"creator":["ABP Ananda"],"video_url":null,"description":"কলকাতা: এশিয়া কাপের ফাইনালে শ্রীলঙ্কাকে ১০ উইকেটে দুরমুশ করে রেকর্ড অষ্টমবার এশিয়াসেরা হল ভারত। কিশোর ভারতীতেই হবে লা লিগার স্টেডিয়াম, বার্সেলোনা থেকে ঘোষণা বাংলার মুখ্যমন্ত্রীর। এক নজরে খেলার সারাদিনের সেরা খবরগুলি। এশিয়াসেরা ভারত শ্রীলঙ্কাকে (Sri Lanka Cricket Team) হারিয়ে অষ্টমবার এশিয়া কাপ (Asia Cup 2023) খেতাব জয়ের জন্য ভারতের (Indian Cricket Team) সামনে লক্ষ্য ছিল মাত্র ৫১ রান। এই রান তুলতে বেশি ঘাম ঝড়ানোর প্রয়োজন ছিল না। বেশি খাটা খাটনি করতে হল না। মাত্র ৬.১ ওভারেই ১০ উইকেটে ম্যাচ জিতে নিল ভারতীয় দল। শুভমন গিল ২৭ রান ও ঈশান কিষাণ ২৩ রানে অপরাজিত থাকেন। এদিন বল হাতে টসে হেরে প্রথমে বোলিং করতে হয় ভারতকে। বল হাতে মহম্মদ সিরাজ়ের বিধ্বংসী বোলিংয়ে কোনওক্রমে ৫০ পূর্ণ করে দ্বীপরাষ্ট্র। ছয় উইকেট নেন সিরাজ়। কিশোর ভারতীতে লা লিগা অ্যাকাডেমি মূলত বাংলায় লগ্নি টানতেই ১১ দিনের স্পেন সফরে গিয়েছেন মুখ্যমন্ত্রী মমতা বন্দোপাধ্যায় (Mamata Banerjee)। তবে শিল্পের পাশাপাশি খেলাধুলো বিশেষত ফুটবলের উন্নতি সাধনেও তৎপর মুখ্যমন্ত্রী। সেই মর্মে ইতিমধ্যেই লা লিগা কর্তৃপক্ষের সঙ্গে চুক্তি স্বাক্ষরও করেছেন তিনি। সেই চুক্তি অনুযায়ী বাংলায় অ্যাকাডেমি গড়বে লা লিগা (La Liga) কর্তৃপক্ষ। তবে ঠিক কোথায় সেই অ্যাকাডেমি গড়া হবে, তা জানানো হয়নি। আজ লা লিগার অ্যাকাডেমি গড়ার জন্য স্থান ঘোষণা করে দিলেন মমতা।  মাদ্রিদ সফর শেষে আজ আরেক প্রসিদ্ধ ফুটবল শহর বার্সেলোনায় গিয়েছেন মুখ্যমন্ত্রী। সেখানেই সকলের উদ্দেশে তিনি জানান যে লা লিগার অ্যাকাডেমি গড়ার জন্য কিশোর ভারতী স্টেডিয়ামই (Kishore Bharati Stadium) কর্তৃপক্ষের হাতে তুলে দিতে চলেছেন তিনি। মমতা বলেন, 'বিশ্বের সেরা সংগঠন এবং জনপ্রিয়তম লিগ লা লিগার সঙ্গে দিনকয়েক আগেই আমরা চুক্তি স্বাক্ষর করেছি। ওদের পেশাদারিত্ব নিয়ে কোনও প্রশ্ন থাকতে পারে না। লা লিগা কর্তৃপক্ষ বাংলায় অ্যাকাডেমি গড়তে আগ্রহ দেখিয়েছিলেন। দুই দিন আগেই এই বিষয়ে আমাদের মধ্যে কথা হয়েছিল। ওরা জমি পেলেই কলকাতায় অ্যাকাডেমি গড়ার কাজ শুরু করে দেবে বলেই জানিয়েছিল। আজ আমি এখান থেকেই ঘোষণা করছি, যে ওদের অ্যাকাডেমি গড়ার জন্য সমস্ত সুযোগ সুবিধাসহ বাংলার একটা গোটা স্টেডিয়াম দেব আমরা। আমার বন্ধুদের কাছে এই বার্তা পৌঁছে দিন। যত শীঘ্র সম্ভব কলকাতায় এসে অ্যাকাডেমি গড়ার কাজ শুরু করে দিন। কিশোর ভারতী স্টেডিয়ামটা আমি এর জন্য দিয়ে দিচ্ছি।' মন জিতলেন সিরাজ় স্বপ্নের বোলিং স্পেলে এশিয়া কাপ ফাইনালে (Asia Cup 2023 Final) শ্রীলঙ্কাকে ধরাশায়ী করেছেন মহম্মদ সিরাজ় (Mohammed Siraj)। ২১ রানের বিনিময়ে ছয় উইকেট নিয়ে গড়েছেন একগুচ্ছ রেকর্ডও। তার দুরন্ত বোলিংয়ে ভর করেই মাত্র ৫০ রানে শ্রীলঙ্কাকে অল আউট করে দেয় ভারতীয় দল। ১০ জিতে নেয় ফাইনাল। স্বাভাবিকভাবেই তাঁকে ম্যাচের সেরা ঘোষণা করা হয়। এরপরেই পুরস্কার বিতরণী অনুষ্ঠানে সিরাজের মানবিক মুখ ধরা পড়ল। ম্যাচ সেরা হওয়ার পর তিনি নিজের পুরস্কারমূল্যর পুরোটাই মাঠকর্মীদের উদ্দেশে দান করেন। তিনি বলেন, 'এই পুরস্কারমূল্যের পুরোটাই মাঠকর্মীদের জন্য। ওদের ছাড়া তো এই টুর্নামেন্টটা আয়োজন করা সম্ভবই হবে না।' নিজের বোলিং স্পেল নিয়ে প্রশ্ন করা হলে সিরাজ় অকপটে মেনে নেন যে এটাই তাঁর কেরিয়ারের সেরা বোলিং স্পেন। 'অনেকদিন ধরেই ভাল বোলিং করছি আমি। তবে আজকে সব বল ঠিকানায় পড়েছে। এই পিচে তো বল সিম করেই তো আজ বল সুইংও করেছিল। সেই কারণেই ফুল লেংথে বল করছিলাম। দলের সকল ফাস্ট বোলারের মধ্যেই কিন্তু সম্পর্ক খুব ভাল। দলের জন্য এটা খুবই ভাল বিষয়' বলেন ভারতের তারকা ফাস্ট বোলার। ডায়মন্ড লিগে দ্বিতীয় নীরজ   কিছুদিন আগেই অ্য়াথলেটিক্সের বিশ্ব চ্যাম্পিয়নশিপে সোনা জিতেছিলেন। এর আগে অলিম্পিক্সেও সোনা জিতেছেন। স্বপ্নের ফর্মে থাকলেও ডায়মন্ড লিগ ফাইনালে অল্পের জন্য সোনা খোয়াতে হল নীরজ চোপড়াকে। ১৬ সেপ্টেম্বর ফাইনালে ৮৩.৮০ মিটার থ্রো করে দ্বিতীয় স্থান অর্জন করেন পানিপথের তরুণ। ডায়মন্ড লিগের ফাইনাল জিতেছেন চেক প্রজাতন্ত্রের জাকুব ভ্যাডলেচ। যিনি তার প্রথম প্রচেষ্টায় ৮৪.২৪ মিটার থ্রো করেছিলেন। এদিন প্রথম থ্রো-টি ফাউল হয়ে যায় নীরজের। যদিও দ্বিতীয়বারের প্রচেষ্টাতেই ৮৩.৮০ মিটার দূরত্ব অতিক্রম করেন নীরজ। এর আগে ডায়মন্ড লিগ জিতেছিলেন নীরজ। কিন্তু এবার আর পারলেন না। চেক প্রজাতন্ত্রের ভিটেজস্লাভ ভেসেলি ২০১২ এবং ২০১৪ সালে খেতাব জিতেছিলেন। এছাড়া জাকুব ভ্যাডলেচ ২০১৬ এবং ২০১৭ সালে এই কৃতিত্ব অর্জন করেছিলেন। নীরজ এবার খেতাব জিতলে তিনি বিশ্বের তৃতীয় ও ভারতের প্রথম প্লেয়ার হিসেবে এই নজির গড়তেন। নীরজের নজরে এ বার এশিয়ান গেমস। জাকার্তা এশিয়ান গেমসে সোনার পদক জিতেছিলেন। হাংঝৌতে তাঁর কাছ থেকে সোনার প্রত্যাশায় ভারতীয় ক্রীড়াপ্রেমীরা। দিল্লির হেডকোচ বাংলার প্রাক্তনী তিনি বাংলার হয়ে ঘরোয়া ক্রিকেট খেলেছেন। বাংলা দলকে (Bengal Cricket Team) নেতৃত্বও দিয়েছিলেন। বাংলার জার্সিতে যে দুজন ক্রিকেটারের প্রথম শ্রেণির ক্রিকেটে ট্রিপল সেঞ্চুরি রয়েছে, তাঁদের মধ্যে অন্যতম তিনি। সেই দেবাঙ্গ গাঁধীকে (Devang Gandhi) হেড কোচ হিসাবে নিয়োগ করল দিল্লি ও জেলা ক্রিকেট সংস্থা। শনিবার সংস্থার তরফে ঘোষণা করা হল, আগামী মরশুমে দিল্লির প্রধান কোচ হিসাবে দায়িত্ব সামলাবেন দেবাঙ্গ। ঘরোয়া ক্রিকেটে দিল্লির সাম্প্রতির ফর্ম ভাল নয়। ব্যর্থতার সেই ছবিটা কাটাতে তৎপর দিল্লি ও জেলা ক্রিকেট সংস্থা। সেই জন্য কোচ হিসাবে নতুন মুখকে দায়িত্বে আনা হল। আপনার পছন্দের খবর আর আপডেট এখন পাবেন আপনার পছন্দের চ্যাটিং প্ল্যাটফর্ম টেলিগ্রামেও। যুক্ত হোন https://t.me/abpanandaofficial আরও পড়ুন: এশিয়া কাপে টুর্নামেন্টসেরা হয়ে রোহিতকে কৃতজ্ঞতা জানালেন কুলদীপ","content":"কলকাতা: এশিয়া কাপের ফাইনালে শ্রীলঙ্কাকে ১০ উইকেটে দুরমুশ করে রেকর্ড অষ্টমবার এশিয়াসেরা হল ভারত। কিশোর ভারতীতেই হবে লা লিগার স্টেডিয়াম, বার্সেলোনা থেকে ঘোষণা বাংলার মুখ্যমন্ত্রীর। এক নজরে খেলার সারাদিনের সেরা খবরগুলি। এশিয়াসেরা ভারত শ্রীলঙ্কাকে (Sri Lanka Cricket Team) হারিয়ে অষ্টমবার এশিয়া কাপ (Asia Cup 2023) খেতাব জয়ের জন্য ভারতের (Indian Cricket Team) সামনে লক্ষ্য ছিল মাত্র ৫১ রান। এই রান তুলতে বেশি ঘাম ঝড়ানোর প্রয়োজন ছিল না। বেশি খাটা খাটনি করতে হল না। মাত্র ৬.১ ওভারেই ১০ উইকেটে ম্যাচ জিতে নিল ভারতীয় দল । শুভমন গিল ২৭ রান ও ঈশান কিষাণ ২৩ রানে অপরাজিত থাকেন। এদিন বল হাতে টসে হেরে প্রথমে বোলিং করতে হয় ভারতকে। বল হাতে মহম্মদ সিরাজ়ের বিধ্বংসী বোলিংয়ে কোনওক্রমে ৫০ পূর্ণ করে দ্বীপরাষ্ট্র। ছয় উইকেট নেন সিরাজ়। কিশোর ভারতীতে লা লিগা অ্যাকাডেমি googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); মূলত বাংলায় লগ্নি টানতেই ১১ দিনের স্পেন সফরে গিয়েছেন মুখ্যমন্ত্রী মমতা বন্দোপাধ্যায় (Mamata Banerjee)। তবে শিল্পের পাশাপাশি খেলাধুলো বিশেষত ফুটবলের উন্নতি সাধনেও তৎপর মুখ্যমন্ত্রী। সেই মর্মে ইতিমধ্যেই লা লিগা কর্তৃপক্ষের সঙ্গে চুক্তি স্বাক্ষরও করেছেন তিনি। সেই চুক্তি অনুযায়ী বাংলায় অ্যাকাডেমি গড়বে লা লিগা (La Liga) কর্তৃপক্ষ। তবে ঠিক কোথায় সেই অ্যাকাডেমি গড়া হবে, তা জানানো হয়নি। আজ লা লিগার অ্যাকাডেমি গড়ার জন্য স্থান ঘোষণা করে দিলেন মমতা। মাদ্রিদ সফর শেষে আজ আরেক প্রসিদ্ধ ফুটবল শহর বার্সেলোনায় গিয়েছেন মুখ্যমন্ত্রী। সেখানেই সকলের উদ্দেশে তিনি জানান যে লা লিগার অ্যাকাডেমি গড়ার জন্য কিশোর ভারতী স্টেডিয়ামই (Kishore Bharati Stadium) কর্তৃপক্ষের হাতে তুলে দিতে চলেছেন তিনি। মমতা বলেন, 'বিশ্বের সেরা সংগঠন এবং জনপ্রিয়তম লিগ লা লিগার সঙ্গে দিনকয়েক আগেই আমরা চুক্তি স্বাক্ষর করেছি। ওদের পেশাদারিত্ব নিয়ে কোনও প্রশ্ন থাকতে পারে না। লা লিগা কর্তৃপক্ষ বাংলায় অ্যাকাডেমি গড়তে আগ্রহ দেখিয়েছিলেন। দুই দিন আগেই এই বিষয়ে আমাদের মধ্যে কথা হয়েছিল। ওরা জমি পেলেই কলকাতায় অ্যাকাডেমি গড়ার কাজ শুরু করে দেবে বলেই জানিয়েছিল। আজ আমি এখান থেকেই ঘোষণা করছি, যে ওদের অ্যাকাডেমি গড়ার জন্য সমস্ত সুযোগ সুবিধাসহ বাংলার একটা গোটা স্টেডিয়াম দেব আমরা। আমার বন্ধুদের কাছে এই বার্তা পৌঁছে দিন। যত শীঘ্র সম্ভব কলকাতায় এসে অ্যাকাডেমি গড়ার কাজ শুরু করে দিন। কিশোর ভারতী স্টেডিয়ামটা আমি এর জন্য দিয়ে দিচ্ছি।' মন জিতলেন সিরাজ় স্বপ্নের বোলিং স্পেলে এশিয়া কাপ ফাইনালে (Asia Cup 2023 Final) শ্রীলঙ্কাকে ধরাশায়ী করেছেন মহম্মদ সিরাজ় (Mohammed Siraj)। ২১ রানের বিনিময়ে ছয় উইকেট নিয়ে গড়েছেন একগুচ্ছ রেকর্ডও। তার দুরন্ত বোলিংয়ে ভর করেই মাত্র ৫০ রানে শ্রীলঙ্কাকে অল আউট করে দেয় ভারতীয় দল । ১০ জিতে নেয় ফাইনাল। স্বাভাবিকভাবেই তাঁকে ম্যাচের সেরা ঘোষণা করা হয়। এরপরেই পুরস্কার বিতরণী অনুষ্ঠানে সিরাজের মানবিক মুখ ধরা পড়ল। ম্যাচ সেরা হওয়ার পর তিনি নিজের পুরস্কারমূল্যর পুরোটাই মাঠকর্মীদের উদ্দেশে দান করেন। তিনি বলেন, 'এই পুরস্কারমূল্যের পুরোটাই মাঠকর্মীদের জন্য। ওদের ছাড়া তো এই টুর্নামেন্টটা আয়োজন করা সম্ভবই হবে না।' নিজের বোলিং স্পেল নিয়ে প্রশ্ন করা হলে সিরাজ় অকপটে মেনে নেন যে এটাই তাঁর কেরিয়ারের সেরা বোলিং স্পেন। 'অনেকদিন ধরেই ভাল বোলিং করছি আমি। তবে আজকে সব বল ঠিকানায় পড়েছে। এই পিচে তো বল সিম করেই তো আজ বল সুইংও করেছিল। সেই কারণেই ফুল লেংথে বল করছিলাম। দলের সকল ফাস্ট বোলারের মধ্যেই কিন্তু সম্পর্ক খুব ভাল। দলের জন্য এটা খুবই ভাল বিষয়' বলেন ভারতের তারকা ফাস্ট বোলার। ডায়মন্ড লিগে দ্বিতীয় নীরজ কিছুদিন আগেই অ্য়াথলেটিক্সের বিশ্ব চ্যাম্পিয়নশিপে সোনা জিতেছিলেন। এর আগে অলিম্পিক্সেও সোনা জিতেছেন। স্বপ্নের ফর্মে থাকলেও ডায়মন্ড লিগ ফাইনালে অল্পের জন্য সোনা খোয়াতে হল নীরজ চোপড়াকে। ১৬ সেপ্টেম্বর ফাইনালে ৮৩.৮০ মিটার থ্রো করে দ্বিতীয় স্থান অর্জন করেন পানিপথের তরুণ। ডায়মন্ড লিগের ফাইনাল জিতেছেন চেক প্রজাতন্ত্রের জাকুব ভ্যাডলেচ। যিনি তার প্রথম প্রচেষ্টায় ৮৪.২৪ মিটার থ্রো করেছিলেন। এদিন প্রথম থ্রো-টি ফাউল হয়ে যায় নীরজের। যদিও দ্বিতীয়বারের প্রচেষ্টাতেই ৮৩.৮০ মিটার দূরত্ব অতিক্রম করেন নীরজ। এর আগে ডায়মন্ড লিগ জিতেছিলেন নীরজ। কিন্তু এবার আর পারলেন না। চেক প্রজাতন্ত্রের ভিটেজস্লাভ ভেসেলি ২০১২ এবং ২০১৪ সালে খেতাব জিতেছিলেন। এছাড়া জাকুব ভ্যাডলেচ ২০১৬ এবং ২০১৭ সালে এই কৃতিত্ব অর্জন করেছিলেন। নীরজ এবার খেতাব জিতলে তিনি বিশ্বের তৃতীয় ও ভারতের প্রথম প্লেয়ার হিসেবে এই নজির গড়তেন। নীরজের নজরে এ বার এশিয়ান গেমস। জাকার্তা এশিয়ান গেমস ে সোনার পদক জিতেছিলেন। হাংঝৌতে তাঁর কাছ থেকে সোনার প্রত্যাশায় ভারতীয় ক্রীড়াপ্রেমীরা। দিল্লির হেডকোচ বাংলার প্রাক্তনী তিনি বাংলার হয়ে ঘরোয়া ক্রিকেট খেলেছেন। বাংলা দলকে (Bengal Cricket Team) নেতৃত্বও দিয়েছিলেন। বাংলার জার্সিতে যে দুজন ক্রিকেটারের প্রথম শ্রেণির ক্রিকেটে ট্রিপল সেঞ্চুরি রয়েছে, তাঁদের মধ্যে অন্যতম তিনি। সেই দেবাঙ্গ গাঁধীকে (Devang Gandhi) হেড কোচ হিসাবে নিয়োগ করল দিল্লি ও জেলা ক্রিকেট সংস্থা। শনিবার সংস্থার তরফে ঘোষণা করা হল, আগামী মরশুমে দিল্লির প্রধান কোচ হিসাবে দায়িত্ব সামলাবেন দেবাঙ্গ। ঘরোয়া ক্রিকেটে দিল্লির সাম্প্রতির ফর্ম ভাল নয়। ব্যর্থতার সেই ছবিটা কাটাতে তৎপর দিল্লি ও জেলা ক্রিকেট সংস্থা। সেই জন্য কোচ হিসাবে নতুন মুখকে দায়িত্বে আনা হল। আপনার পছন্দের খবর আর আপডেট এখন পাবেন আপনার পছন্দের চ্যাটিং প্ল্যাটফর্ম টেলিগ্রামেও। যুক্ত হোন https://t.me/abpanandaofficial আরও পড়ুন: এশিয়া কাপে টুর্নামেন্টসেরা হয়ে রোহিতকে কৃতজ্ঞতা জানালেন কুলদীপ var _fireSc=!0;document.addEventListener(\"scroll\",(e=>{if(_fireSc){var c=document.createElement(\"script\");c.src=\"//asset.fwpub1.com/js/storyblock.js\",c.async=!0,document.getElementsByTagName(\"head\")[0].appendChild(c),_fireSc=!1}}));","pubDate":"2023-09-17 19:15:51","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/09/18/321833c814aa0bd262a351e8f22f92c61694977639436507_original.jpg","source_id":"abplive","source_priority":10959,"country":["india"],"category":["sports"],"language":"bengali"},{"article_id":"afbc7f672fbc94ba39a6625533a4b219","title":"Asia Cup 2023: 'এই পারফরম্যান্স দীর্ঘদিন মনে থাকবে', এশিয়া কাপ জিতে দলের মানসিক দৃঢ়তার প্রশংসায় রোহিত","link":"https://bengali.abplive.com/sports/cricket/indian-captain-rohit-sharma-hails-team-mental-character-after-asia-cup-2023-final-victory-1009880","keywords":["ক্রিকেট"],"creator":["ABP Ananda"],"video_url":null,"description":"কলম্বো: প্রেমদাসা স্টেডিয়ামে এশিয়া কাপের (Asia Cup 2023) খেতাবি লড়াইয়ে মুখোমুখি হয়েছিল ভারত ও শ্রীলঙ্কা (IND vs Sri Lanka)। রবিবাসরীয় ফাইনালে শ্রীলঙ্কাকে পর্যুদস্ত করে রেকর্ড অষ্টমবার এশিয়া সেরা হয় ভারতীয় দল। মাত্র ৫০ রানেই শ্রীলঙ্কাকে অল আউট করার পর ১০ উইকেটে ম্যাচ জিতে নেয় ভারত। পাঁচ বছরের ট্রফির খরা কাটিয়ে ফের এশিয়া কাপ জিতে টিম ইন্ডিয়ার ক্রিকেটারদের মানসিক দৃঢ়তার প্রশংসা করেন ভারতীয় অধিনায়ক রোহিত শর্মা (Rohit Sharma)। ম্যাচের পুরস্কার বিতরণী অনুষ্ঠানে রোহিত বলেন, 'সত্যিই দল দুর্দান্ত পারফর্ম করেছে। কোনও টুর্নামেন্টের ফাইনালে এমন পারফরম্যান্স করাটা দলের মানসিক দৃঢ়তার পরিচয় দেয়। বল হাতে আমরা শুরুটাও অসাধারণ করেছি এবং ব্যাট হাতে ইনিংসটা শেষ করতেও আমরা বেশি সময় নিইনি। আমাদের ফাস্ট বোলাররা প্রচুর খাটা খাটনি করেছে। ওদের কী করতে হবে, না হবে, সেই বিষয়ে ওদের ধারণা খুব স্পষ্ট। এই পারফরম্যান্স দেখতেও বেশ ভাল লাগল।' এই পারফরম্যান্সে সহজে ভোলার নয় বলেই জানান রোহিত। 'এমন এক পারফরম্যান্স দীর্ঘদিন মনে থাকবে। বলটা যে এত সিম, সুইং হবে সেটা কিন্তু কল্পনাও করিনি। এর পুরো কৃতিত্বটাই বোলারদের দক্ষতার। সিরাজ বাহবা পাওয়ার যোগ্য। হাওয়ায় এবং পিচে, দুইভাবে বল মুভ করার দক্ষতাটা কিন্তু সকলের থাকে না। ও দারুণ উন্নতি করেছে।' বলেন তিনি। এশিয়া কাপ পকেটে পুরে নিয়েছে ভারত। এরপরেই বিশ্বকাপ। ঘরের মাটিতে ৫০ ওভারের বিশ্বকাপ শুরু হতে আর মাসখানেকও বাকি নেই। এশিয়া কাপ জয়ের পরেই এবার বিশ্বকাপ ও অস্ট্রেলিয়া সিরিজ় নিয়ে ভাবনাচিন্তা শুরু করে দিয়েছন ভারতীয় অধিনায়ক। তিনি বলেন, 'আমাদের যা যা সাফল্য লাভ করা সম্ভব, এশিয়া কাপে সেইসব সাফল্য পেয়েছি। হার্দিক ও ঈশান চাপের মুখে পাকিস্তানের বিরুদ্ধে যেমন ব্যাট করেছিল। তারপর কেএল এবং বিরাটের পাকিস্তানের বিরুদ্ধে শতরান। গিলও দারুণ খেলেছে। সব মিলিয়ে ভিন্ন ভিন্ন সময়ে ভিন্ন ভিন্ন ব্যক্তি দলের হয়ে সামনে এগিয়ে এসে পারফর্ম করেছেন। এরপর ভারতে যে সিরিজ আয়োজিত হবে আমাদের নজর সেইদিকে এবং অবশ্যই বিশ্বকাপের দিকে।' আপনার পছন্দের খবর আর আপডেট এখন পাবেন আপনার পছন্দের চ্যাটিং প্ল্যাটফর্ম টেলিগ্রামেও। যুক্ত হোন https://t.me/abpanandaofficial আরও পড়ুন: এশিয়া কাপে চ্যাম্পিয়ন হয়ে কত টাকা পেল ভারত? শ্রীলঙ্কার ঝুলিতে গেল কত অর্থ?","content":"কলম্বো: প্রেমদাসা স্টেডিয়ামে এশিয়া কাপের (Asia Cup 2023) খেতাবি লড়াইয়ে মুখোমুখি হয়েছিল ভারত ও শ্রীলঙ্কা (IND vs Sri Lanka)। রবিবাসরীয় ফাইনালে শ্রীলঙ্কাকে পর্যুদস্ত করে রেকর্ড অষ্টমবার এশিয়া সেরা হয় ভারতীয় দল । মাত্র ৫০ রানেই শ্রীলঙ্কাকে অল আউট করার পর ১০ উইকেটে ম্যাচ জিতে নেয় ভারত। পাঁচ বছরের ট্রফির খরা কাটিয়ে ফের এশিয়া কাপ জিতে টিম ইন্ডিয়ার ক্রিকেটারদের মানসিক দৃঢ়তার প্রশংসা করেন ভারতীয় অধিনায়ক রোহিত শর্মা (Rohit Sharma)। ম্যাচের পুরস্কার বিতরণী অনুষ্ঠানে রোহিত বলেন, 'সত্যিই দল দুর্দান্ত পারফর্ম করেছে। কোনও টুর্নামেন্টের ফাইনালে এমন পারফরম্যান্স করাটা দলের মানসিক দৃঢ়তার পরিচয় দেয়। বল হাতে আমরা শুরুটাও অসাধারণ করেছি এবং ব্যাট হাতে ইনিংসটা শেষ করতেও আমরা বেশি সময় নিইনি। আমাদের ফাস্ট বোলাররা প্রচুর খাটা খাটনি করেছে। ওদের কী করতে হবে, না হবে, সেই বিষয়ে ওদের ধারণা খুব স্পষ্ট। এই পারফরম্যান্স দেখতেও বেশ ভাল লাগল।' এই পারফরম্যান্সে সহজে ভোলার নয় বলেই জানান রোহিত। 'এমন এক পারফরম্যান্স দীর্ঘদিন মনে থাকবে। বলটা যে এত সিম, সুইং হবে সেটা কিন্তু কল্পনাও করিনি। এর পুরো কৃতিত্বটাই বোলারদের দক্ষতার। সিরাজ বাহবা পাওয়ার যোগ্য। হাওয়ায় এবং পিচে, দুইভাবে বল মুভ করার দক্ষতাটা কিন্তু সকলের থাকে না। ও দারুণ উন্নতি করেছে।' বলেন তিনি। এশিয়া কাপ পকেটে পুরে নিয়েছে ভারত। এরপরেই বিশ্বকাপ। ঘরের মাটিতে ৫০ ওভারের বিশ্বকাপ শুরু হতে আর মাসখানেকও বাকি নেই। এশিয়া কাপ জয়ের পরেই এবার বিশ্বকাপ ও অস্ট্রেলিয়া সিরিজ় নিয়ে ভাবনাচিন্তা শুরু করে দিয়েছন ভারতীয় অধিনায়ক। তিনি বলেন, 'আমাদের যা যা সাফল্য লাভ করা সম্ভব, এশিয়া কাপে সেইসব সাফল্য পেয়েছি। হার্দিক ও ঈশান চাপের মুখে পাকিস্তানের বিরুদ্ধে যেমন ব্যাট করেছিল। তারপর কেএল এবং বিরাটের পাকিস্তানের বিরুদ্ধে শতরান। গিলও দারুণ খেলেছে। সব মিলিয়ে ভিন্ন ভিন্ন সময়ে ভিন্ন ভিন্ন ব্যক্তি দলের হয়ে সামনে এগিয়ে এসে পারফর্ম করেছেন। এরপর ভারতে যে সিরিজ আয়োজিত হবে আমাদের নজর সেইদিকে এবং অবশ্যই বিশ্বকাপের দিকে।' googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); আপনার পছন্দের খবর আর আপডেট এখন পাবেন আপনার পছন্দের চ্যাটিং প্ল্যাটফর্ম টেলিগ্রামেও। যুক্ত হোন https://t.me/abpanandaofficial আরও পড়ুন: এশিয়া কাপে চ্যাম্পিয়ন হয়ে কত টাকা পেল ভারত? শ্রীলঙ্কার ঝুলিতে গেল কত অর্থ? var _fireSc=!0;document.addEventListener(\"scroll\",(e=>{if(_fireSc){var c=document.createElement(\"script\");c.src=\"//asset.fwpub1.com/js/storyblock.js\",c.async=!0,document.getElementsByTagName(\"head\")[0].appendChild(c),_fireSc=!1}}));","pubDate":"2023-09-17 19:01:37","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/09/18/a8b2fdcfb3c4443b5c6aa695a79bfd5d1694975712164507_original.jpg","source_id":"abplive","source_priority":10959,"country":["india"],"category":["sports"],"language":"bengali"},{"article_id":"938bbf60dc1656bdd5a9a1284f0b4eb5","title":"Marco Jansen Destroys Australian Top Order To Clinch Series For South Africa","link":"https://sports.ndtv.com/cricket/marco-jansen-destroys-australian-top-order-to-clinch-series-for-south-africa-4399375","keywords":null,"creator":null,"video_url":null,"description":"Marco Jansen dismissed the first five Australian batsmen to clinch a come-from-behind series win for South Africa.","content":"Left-arm fast bowler Marco Jansen dismissed the first five Australian batsmen to clinch a come-from-behind series win for South Africa in the fifth one-day international at the Wanderers Stadium on Sunday. Jansen took five for 39 as Australia were bowled out for 193 in reply to South Africa's 315 for nine. South African captain Temba Bavuma said the character of the team had shone through after they lost the first two matches of the series, which boded well for the World Cup in India next month. \"There is a lot of confidence we can take, in that we had our backs against the wall and we showed we have ways of getting on top of the game. We will go to India in probably the best state we can be.\" South Africa won each of the last three matches by more than 100 runs after they were sent in to bat by Australian captain Mitchell Marsh . Marsh admitted: \"We were outplayed in the last three games but we have a one-day game in India on Friday, a lot of players coming back and a big World Cup coming up.\" Several leading players, including regular captain Pat Cummins , fellow fast bowler Mitchell Starc , all-rounder Glenn Maxwell and star batsman Steve Smith, will join the team for a pre-World Cup series against India starting in Mohali on Friday. Marsh's decision to bowl first in the only day game of the series seemed justified on Sunday when his bowlers reduced South Africa to 103 for four in the 24th over on a pitch which offered sideways movement and bounce to the seamers. Player of the series Aiden Markram (93) and David Miller (63) put on 109 for the fifth wicket and lower order batsmen Jansen and Andile Phehlukwayo took the total past 300 with some big hitting towards the end. Jansen hit three sixes in scoring 47 off 29 balls and Phehlukwayo cleared the boundary four times in his unbeaten 39 off 19 deliveries. Marsh and David Warner blasted 34 off the first three overs of the Australian innings but Jansen came into the attack and dismissed Warner and Inglis in a double-wicket maiden over. Marsh (71) and Marnus Labuschagne (44) put on 90 for the third wicket but Jansen dismissed both set batsmen and Alex Carey in a burst of three wickets off seven balls to put South Africa in command. Advertisement (This story has not been edited by NDTV staff and is auto-generated from a syndicated feed.)","pubDate":"2023-09-17 18:53:33","image_url":null,"source_id":"ndtv","source_priority":1204,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"dedb656780ddd62c3bf1b216a9173d27","title":"“No team came so close to them”: Irfan Pathan lauds India’s dominance in Asia Cup","link":"https://thenewsmill.com/2023/09/no-team-came-so-close-to-them-irfan-pathan-lauds-indias-dominance-in-asia-cup/","keywords":["Cricket","Sports","ANI"],"creator":["ANI"],"video_url":null,"description":"The News Mill","content":"Former cricketer Irfan Pathan believes India’s thumping victory over Sri Lanka in the Asia Cup final will act as a major “confidence boost” for the team in the upcoming ODI World Cup. The defending champions failed to survive the threat posed by the Men in Blue’s star-studded pace bowling line-up which was spearheaded by Mohammed Siraj. Pathan reflected on India’s performance in the entire tournament and felt that no team was able to pose a challenge to the Asia Cup 2023 champions and how this kind of performance will play a major role in the upcoming tournament. “It was a very conventional victory and, convincing entry because, in Asia Cup, I think no team came so close to team India except Bangladesh where the main team wasn’t playing. But if you’re talking about the main, where top players played. No one came close. And, to have that kind of victory before the World Cup, I think it’s a great boost of confidence for Team India. And that’s great to see, especially the kind of fast growth that we saw against Sri Lanka,” Pathan told reporters. Coming to the match, after speedster, Mohammed Siraj’s fiery spell decimated Sri Lanka, the opening duo of Shubman Gill and Ishan Kishan’s fifty-run partnership helped India lift the Asia Cup trophy for the 8th time in style after beating co-hosts in the final at the R Premadasa Stadium in Colombo on Sunday. Leading the India fast bowling effort, Siraj ran through the Sri Lanka top-order in a dazzling performance in the summit clash. It just took a little more than two hours for India to win their 8th Asia Cup title in style. Men in Blue lifted the Asia Cup trophy after five years. The Asia Cup summit clash witnessed a remarkable turn of events as Indian paceman Siraj bowled a dream spell against Sri Lanka. In a stunning display of bowling prowess, Sri Lanka was bowled out for a mere 50 runs in just 15.2 overs, predominantly due to Siraj’s outstanding performance, claiming six wickets in seven overs. (ANI)","pubDate":"2023-09-17 18:30:11","image_url":null,"source_id":"thenewsmill","source_priority":3781717,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"0c7867e2194b87e82ea903c0deddf3ff","title":"Asia Cup 2023: এশিয়া কাপে টুর্নামেন্টসেরা হয়ে রোহিতকে কৃতজ্ঞতা জানালেন কুলদীপ","link":"https://bengali.abplive.com/sports/cricket/asia-cup-2023-kuldeep-yadav-credits-rohit-sharma-after-winning-man-of-the-series-award-1009875","keywords":["ক্রিকেট"],"creator":["ABP Ananda"],"video_url":null,"description":"কলম্বো: এশিয়া কাপের ফাইনালে (Asia Cup 2023 Final) শ্রীলঙ্কাকে কার্যত নাস্তানাবুদ করে অষ্টমবার এশিয়াসেরা হয়েছে ভারতীয় ক্রিকেট দল (Indian Cricket Team)। ১০ উইকেটে জিতে নিয়েছে ফাইনাল। খেতাবি লড়াইয়ে ফাস্ট বোলার, আরও নির্দিষ্ট করে বলতে গেলে মহম্মদ সিরাজ়ের দাপট দেখা গেলেও, টুর্নামেন্ট সেরার পুরস্কার কিন্তু জিতেছেন কুলদীপ যাদব (Kuldeep Yadav)।  ফাইনালে কোনও উইকেট পাননি কুলদীপ। বল করেছেন মাত্র দুই ওভার। তবে টুর্নামেন্টের সুপার ফোরে দুরন্ত ছন্দে ছিলেন তিনি। তাঁর দৌলতেই পরপর দুই দিন দুই ম্যাচে পাকিস্তান ও শ্রীলঙ্কাকে পরাজিত করেছিল ভারত। এক ম্যাচে পাঁচ ও পরের ম্যাচে চার উইকেট নেন তিনি। নয় উইকেট নিয়েই টুর্নামেন্ট সেরা হন কুলদীপ। বিগত দেড় বছর ধরে নিজের বোলিং নিয়ে খুবই খাটাখাটনি করেছেন এবং তার ফলেই এই সাফল্য পেয়েছেন বলে জানান কুলদীপ।  পুরস্কারবিতরণী অনুষ্ঠানে তিনি বলেন, 'আমার ছন্দে ফিরে পেতে বিগত বছর দেড়েক ধরে প্রচুর খাটা খাটনি করেছি। ক্রিজেও আরও আক্রমণাত্মকভাবে ছুটে আসছি। নিজের বোলিং দেখে আমার নিজেরও বেশ ভাল লেগেছে। টি-টোয়েন্টিতে সঠিক লেংথে বল করাটা বেশি জরুরি। উইকেট নেওয়ার বিষয়ে তেমনটা ভাবনাচিন্তার সুযোগ থাকে না। সেই কারণেই সঠিক লেংথে বোলিং করার দিকে নজর দিয়েছি।' এরপরেই নিজের সাফল্যের জন্য তিনি ভারতীয় অধিনায়ক রোহিত শর্মাকেও কৃতিত্ব দেন। রোহিতকে বাহবা দিয়ে কুলদীপ বলেন, 'আমার সাফল্যের অনেকটা কৃতিত্বই রোহিত ভাইয়ের। ওঁ আমায় আমার বলের গতি নিয়ে খাটার পরামর্শ দিয়েছিল। আমাদের ফাস্ট বোলাররাও তো পাওয়ার প্লেতে নিয়মিত উইকেট নিচ্ছেন। তাই পরবর্তী সময়ে স্পিনারদের বোলিং করাটা অনেকটাই সহজ হয়ে যায়।' অপরদিকে, গ্যালারিভর্তি দর্শকদের সামনে ম্যাচ হেরে অনুতপ্ত শ্রীলঙ্কান অধিনায়ক দাসুন শনাকা। সমর্থকদের কাছে ক্ষমাও চেয়ে নিলেন তিনি। ম্যাচের পুরস্কার বিতরণী অনুষ্ঠানে শ্রীলঙ্কার অধিনায়ক বলেছেন, 'আমি সমর্থকদের ধন্যবাদ জানাতে চাই। যাঁরা মাঠ ভরিয়েছিলেন। আমরা আপনাদের হতাশ করেছি। তার জন্য দুঃখিত। তবু এই নিঃশর্ত সমর্থনের জন্য কৃতজ্ঞ।' ভারতীয় দলকে খেতাব জয়ের জন্য কিন্তু অভিনন্দনও জানিয়েছেন শনাকা।  আপনার পছন্দের খবর আর আপডেট এখন পাবেন আপনার পছন্দের চ্যাটিং প্ল্যাটফর্ম টেলিগ্রামেও। যুক্ত হোন https://t.me/abpanandaofficial আরও পড়ুন: এশিয়া কাপে চ্যাম্পিয়ন হয়ে কত টাকা পেল ভারত? শ্রীলঙ্কার ঝুলিতে গেল কত অর্থ?  ","content":"কলম্বো: এশিয়া কাপের ফাইনালে (Asia Cup 2023 Final) শ্রীলঙ্কাকে কার্যত নাস্তানাবুদ করে অষ্টমবার এশিয়াসেরা হয়েছে ভারতীয় ক্রিকেট দল (Indian Cricket Team)। ১০ উইকেটে জিতে নিয়েছে ফাইনাল। খেতাবি লড়াইয়ে ফাস্ট বোলার, আরও নির্দিষ্ট করে বলতে গেলে মহম্মদ সিরাজ়ের দাপট দেখা গেলেও, টুর্নামেন্ট সেরার পুরস্কার কিন্তু জিতেছেন কুলদীপ যাদব (Kuldeep Yadav)। ফাইনালে কোনও উইকেট পাননি কুলদীপ। বল করেছেন মাত্র দুই ওভার। তবে টুর্নামেন্টের সুপার ফোরে দুরন্ত ছন্দে ছিলেন তিনি। তাঁর দৌলতেই পরপর দুই দিন দুই ম্যাচে পাকিস্তান ও শ্রীলঙ্কাকে পরাজিত করেছিল ভারত। এক ম্যাচে পাঁচ ও পরের ম্যাচে চার উইকেট নেন তিনি। নয় উইকেট নিয়েই টুর্নামেন্ট সেরা হন কুলদীপ। বিগত দেড় বছর ধরে নিজের বোলিং নিয়ে খুবই খাটাখাটনি করেছেন এবং তার ফলেই এই সাফল্য পেয়েছেন বলে জানান কুলদীপ। পুরস্কারবিতরণী অনুষ্ঠানে তিনি বলেন, 'আমার ছন্দে ফিরে পেতে বিগত বছর দেড়েক ধরে প্রচুর খাটা খাটনি করেছি। ক্রিজেও আরও আক্রমণাত্মকভাবে ছুটে আসছি। নিজের বোলিং দেখে আমার নিজেরও বেশ ভাল লেগেছে। টি-টোয়েন্টিতে সঠিক লেংথে বল করাটা বেশি জরুরি। উইকেট নেওয়ার বিষয়ে তেমনটা ভাবনাচিন্তার সুযোগ থাকে না। সেই কারণেই সঠিক লেংথে বোলিং করার দিকে নজর দিয়েছি।' এরপরেই নিজের সাফল্যের জন্য তিনি ভারতীয় অধিনায়ক রোহিত শর্মাকেও কৃতিত্ব দেন। রোহিতকে বাহবা দিয়ে কুলদীপ বলেন, 'আমার সাফল্যের অনেকটা কৃতিত্বই রোহিত ভাইয়ের। ওঁ আমায় আমার বলের গতি নিয়ে খাটার পরামর্শ দিয়েছিল। আমাদের ফাস্ট বোলাররাও তো পাওয়ার প্লেতে নিয়মিত উইকেট নিচ্ছেন। তাই পরবর্তী সময়ে স্পিনারদের বোলিং করাটা অনেকটাই সহজ হয়ে যায়।' googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); অপরদিকে, গ্যালারিভর্তি দর্শকদের সামনে ম্যাচ হেরে অনুতপ্ত শ্রীলঙ্কান অধিনায়ক দাসুন শনাকা। সমর্থকদের কাছে ক্ষমাও চেয়ে নিলেন তিনি। ম্যাচের পুরস্কার বিতরণী অনুষ্ঠানে শ্রীলঙ্কার অধিনায়ক বলেছেন, 'আমি সমর্থকদের ধন্যবাদ জানাতে চাই। যাঁরা মাঠ ভরিয়েছিলেন। আমরা আপনাদের হতাশ করেছি। তার জন্য দুঃখিত। তবু এই নিঃশর্ত সমর্থনের জন্য কৃতজ্ঞ।' ভারতীয় দল কে খেতাব জয়ের জন্য কিন্তু অভিনন্দনও জানিয়েছেন শনাকা। আপনার পছন্দের খবর আর আপডেট এখন পাবেন আপনার পছন্দের চ্যাটিং প্ল্যাটফর্ম টেলিগ্রামেও। যুক্ত হোন https://t.me/abpanandaofficial আরও পড়ুন: এশিয়া কাপে চ্যাম্পিয়ন হয়ে কত টাকা পেল ভারত? শ্রীলঙ্কার ঝুলিতে গেল কত অর্থ? var _fireSc=!0;document.addEventListener(\"scroll\",(e=>{if(_fireSc){var c=document.createElement(\"script\");c.src=\"//asset.fwpub1.com/js/storyblock.js\",c.async=!0,document.getElementsByTagName(\"head\")[0].appendChild(c),_fireSc=!1}}));","pubDate":"2023-09-17 18:29:05","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/09/17/12f6f51b2e54b8465a1b49407e9b237b1694974938275507_original.jpg","source_id":"abplive","source_priority":10959,"country":["india"],"category":["sports"],"language":"bengali"},{"article_id":"fb28c1434b6d670f4533447a02c27472","title":"Jason Roy is DROPPED from England's World Cup squad after suffering back spasms as Harry Brook is included for tournament in India despite struggling in New Zealand series","link":"https://www.dailymail.co.uk/sport/cricket/article-12528421/Jason-Roy-DROPPED-Englands-World-Cup-squad-suffering-spasms-Harry-Brook-included-tournament-India-despite-struggling-New-Zealand-series.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"It was not just that England realised they would have to create space for the generational talent of Brook. More pertinent was the failure of Roy to play against New Zealand.","content":"Jason Roy is DROPPED from England's World Cup squad after suffering back spasms as Harry Brook is included for tournament in India despite struggling in New Zealand series Roy played no part in England's 3-1 series win over New Zealand with back issues Brook wasn't originally in the squad and failed to make much of an impact But the selectors decided Brook was a safer bet given Roy's injury problems By Paul Newman for the Daily Mail Published: 14:30, 17 September 2023 | Updated: 23:16, 17 September 2023 e-mail 85 shares 15 View comments Jason Roy's England career was ended on Sunday when he was replaced in the World Cup squad by Harry Brook. Roy was named last month in what national selector Luke Wright insisted was the squad for the one-day series against New Zealand and also the World Cup. Although Roy revealed in an interview with Mail Sport h e had been told he would definitely be travelling to India for next month’s tournament it quickly became clear England would be forced into a U-turn and instead their World Cup squad became ‘provisional’. It was not just that England realised they would have to create space for the generational talent of Brook — even though he had a quiet time in the 50-over series against New Zealand, making just 37 runs from 68 balls in three innings. More pertinent was the failure of Roy to play throughout England’s 3-1 victory because of a series of back spasms that ruled him out, in two cases, even after he had taken part in the warm-ups. Opening batter Jason Roy has been left out of England's squad for next month's ODI World Cup in India The versatile Harry Brook has been called up in his place having controversially been left out the original 15 Roy has missed a run of games for his country after struggling with injury and his international future is now unclear Even as late as Friday when England completed their series victory thanks to a century from the man who took Roy’s opening place in Dawid Malan, captain Jos Buttler was talking about adding Roy to the second-string squad to play Ireland this week in the hope he could prove his form and fitness. But now Buttler has been forced to concede defeat in his backing of one of the most influential figures in England’s white-ball domination and has surely called time on his 50-over career following an equally difficult call in leaving him out of the squad that won the Twenty20 World Cup last year. ‘We have selected a squad we are confident can go to India and win the World Cup,’ said Wright. ‘We are blessed with an incredibly strong group of white-ball players which was underlined by the strong performances in the win against a very strong New Zealand. ‘The strength of the squad has meant we have had to make some tough decisions on world-class players with Jason Roy missing out and Harry Brook coming into the squad.’ Dawid Malan is England's form player entering the tournament and he made a century in the final ODI with New Zealand at Lord's on Friday England World Cup squad Jos Buttler (Lancashire – captain); Moeen Ali (Warwickshire); Gus Atkinson (Surrey); Jonny Bairstow (Yorkshire); Harry Brook (Yorkshire); Sam Curran (Surrey); Liam Livingstone (Lancashire); Dawid Malan (Yorkshire); Adil Rashid (Yorkshire); Joe Root (Yorkshire); Ben Stokes (Durham); Reece Topley (Surrey); David Willey (Northamptonshire); Mark Wood (Durham); Chris Woakes (Warwickshire) <!- - ad: https://mads.dailymail.co.uk/v8/gb/sport/cricket/article/other/mpu_factbox.html?id=mpu_factbox_1 - -> Advertisement Now Malan — who made himself undroppable in making 277 runs at 92.33 in three games against New Zealand, including that match-winning century at Lord’s — will step out alongside Jonny Bairstow to open at the start of England’s World Cup defence in Ahmedabad against New Zealand on October 5. Brook surely should have been included in the first place after announcing himself in spectacular fashion over the last 18 months, most notably in Test cricket where he has made 1,181 runs at 62.15 and a strike-rate of 91. Roy, meanwhile, has reached the end of the international road. He suffered from injury during the last two tournaments he played in and caused controversy in May when he asked to be released from his incremental contract to play in the inaugural Major League Cricket event in the US. He became a victim of the standards he helped set in his 116 ODIs, including what was England’s highest 50-over score of 180 until Ben Stokes broke it at the Oval last week. Roy was part of England's squad that won the tournament in 2019 and claimed he was told he would be in the travelling party Now, at 33, his future is at Surrey and, more regularly, as a leading figure in the franchise world. Brook, 24, was originally not in the World Cup squad named last month but was added to the squad for the New Zealand series and despite failing to impress with just 37 runs in three innings, England have decided to opt for the Yorkshireman rather than opener Roy after Dawid Malan all but certainly secured his spot at the top of the order with 277 runs across three innings against the Black Caps. Roy, who was an integral part of England's World Cup winning campaign in 2019, is now set to miss a second successive World Cup after he was also not picked for the T20 World Cup squad last winter. England begin their World Cup defence in Ahmedabad against New Zealand on October 5. Share or comment on this article: Jason Roy is DROPPED from England's World Cup squad after suffering back spasms as Harry Brook is included for tournament in India despite struggling in New Zealand series e-mail 85 shares Add comment Comments 15 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-09-17 22:16:52","image_url":"https://i.dailymail.co.uk/1s/2023/09/17/14/75528027-0-image-a-36_1694957419289.jpg","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"24a72e1f133cc25d201261fd845884a7","title":"Iconic Cricket Ground’s Potential £23m Sale to Safeguard Struggling Club’s Future","link":"https://insidexpress.com/sports-athletics/iconic-cricket-grounds-potential-23m-sale-to-safeguard-struggling-clubs-future/?utm_source=rss&utm_medium=rss&utm_campaign=iconic-cricket-grounds-potential-23m-sale-to-safeguard-struggling-clubs-future","keywords":["Sports & Athletics","23M","clubs","Cricket","future","Grounds","Iconic","Potential","Safeguard","Sale","struggling"],"creator":["The Insidexpress"],"video_url":null,"description":"YORKSHIRE are reportedly considering selling Headingley Cricket Ground in an attempt to guarantee the club’s survival. The county cricket club bought the ground in 2005 from Leeds Cricket, Football and…","content":"YORKSHIRE are reportedly considering selling Headingley Cricket Ground in an attempt to guarantee the club’s survival. The county cricket club bought the ground in 2005 from Leeds Cricket, Football and Athletic Company for a fee believed to be £12million. Yorkshire are reportedly considering selling Headingley Credit: Getty It is the ground that saw Ben Stokes’ heroics in 2019 Credit: Getty Chris Woakes (R) and Mark Wood (L) combined to beat Australia earlier this summer in the Ashes Credit: Getty The Daily Mail have now reported that the club are looking for £23m to sell the ground. The touted figure would represent a decent return for the club that has come under financial pressure. Yorkshire has been dealing with financial issues since the loss of sponsors and costs from the Azeem Rafiq racism scandal of around £3.5m. The report claims that Yorkshire are looking for £20m in new investment but have had no luck despite interest from former Newcastle United owner Mike Ashley, a Saudi prince and some IPL franchises. It is also suggested that Yorkshire are considering selling the ground and leasing it back in a similar model that has been utilised by football clubs. It is also thought that there have been several bids “rejected” to buy the club outright. This is because members still want control of the club. A sale of the ground would provide the necessary funds to pay a £15.9m bill that is owed to the family of former chairman Colin Graves. The remainder of the money left over from the sale could also pay running costs for several years. Headingley has played host to some special cricketing moments in recent years. It was the ground where Ben Stokes performed his heroics during the Ashes series in 2019. And again earlier this year, it was the ground that Mark Wood and Chris Woakes steered England to victory over the Aussies in the Ashes. The ground has been valued at £23million by a global real estate company Credit: Getty The money made from the Ashes Test earlier this summer was enough to get Yorkshire through the season. Yorkshire chief executive Stephen Vaughan told the Daily Mail: “We cannot comment on commercially sensitive information. “We are making strong progress on securing the long-term future of Yorkshire County Cricket Club and look forward to announcing positive developments shortly.” Publisher","pubDate":"2023-09-17 21:23:11","image_url":null,"source_id":"insidexpress","source_priority":2653465,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"ad5b2da5a022b767046df3a32e98f9d5","title":"Fiji blows away Wallabies in crucial match","link":"https://www.fbcnews.com.fj/sports/rwc-2023/fiji-blows-away-wallabies-in-crucial-match/","keywords":["RWC 2023"],"creator":["Fredrica Nagan"],"video_url":null,"description":"The Fiji Water Flying Fijians have created history after beating two time champions Australia 22-15 for the first time at a Rugby World Cup. It’s been 69 years since Fiji last beat the Wallabies in a Test following their 18-16 win at the Sydney Cricket Ground in 1954. Fiji played with heart throughout the 80 […]","content":"The Fiji Water Flying Fijians have created history after beating two time champions Australia 22-15 for the first time at a Rugby World Cup. It’s been 69 years since Fiji last beat the Wallabies in a Test following their 18-16 win at the Sydney Cricket Ground in 1954. Fiji played with heart throughout the 80 minutes and one can tell they were still hurting from the result last week against Wales and wanted to stay in the competition. An emotional head coach Simon Raiwalui says he couldn’t be more proud of the way his men played today. Two successive penalties against the national side saw Ben Donaldson converting one for a three-point lead. The national side regrouped and started pressuring the Aussies with some variations in their play. Josua Tuisova, Levani Botia, Viliame Mata and Lekima Tagitagivalu made some early strong carries that rattled Australia before Simione Kuruvoli slotted a penalty an offside penalty to lock the scores at 3-all after 11 minutes. Player of the Match Josua ‘The Bus’ Tuisova says it has been a long time coming. Australia openside flanker Fraser McReight was penalized at a breakdown six minutes later with Kuruvoli adding another three points. However, a 50-20 kick by halfback Nic White saw Mark Nawaqanitawase ran in to score after a confused Radradra thought it was Fiji’s throw in the lineout. Nawaqanitawase took a quick throw in to Kerevi before he was tackled by Nayacalevu close to the tryline but he was able to release the ball to his winger to score. Kuruvoli put Fiji back in front with his third penalty after the referee penalized White for a high tackle on our halfback before adding another for the Waisea Nayacalevu-captained side to lead 12-8 at halftime. Captain Waisea Nayacalevu says this win is special. Despite two lineouts inside their red zone, Australia still contested Fiji’s throws and were successful on two occasions before the break. Winger Jiuta Wainiqolo was injured after his first carry in the second spell and he was replaced by Vinaya Habosi. A box kick by Kuruvoli was uncontested by the Australians who let the ball bounce but it went straight into the hands of Tuisova who ran away to score. Kuruvoli added the extra two points for a personal tally of 14 points in the match before he was replaced by Frank Lomani. Australia’s coach Eddie Jones brought in Suliasi Vunivalu and moved Nawaqanitawase to fullback with Donaldson shifting to flyhalf. Jones’s counterpart Simon Raiwalui changed his front-row after 10 minutes with Peni Ravai, Tevita Ikanivere and Mesake Doge coming in. The Flying Fijians forwards never stepped back from the get go and were clinical in the contact zone with Botia winning the battle at the breakdown at crucial times. Tuisova was at his usual best and the Aussies had to work overtime when he gets the ball. Fiji’s demolition man, Botia, had to leave the field due to injury while Doge had an head injury assessment. Albert Tuisue was introduced as substitute for Botia while Tagi returned for Doge. Our side kept the scoreboard pressure after Lomani nailed a penalty 15 minutes from full-time but Australia closed the gap with Vunivalu crashing over from five meters out.","pubDate":"2023-09-17 20:38:14","image_url":"https://www.fbcnews.com.fj/wp-content/uploads/2023/09/SIMON-R.mp3","source_id":"fbcnews","source_priority":229234,"country":["fiji"],"category":["sports"],"language":"english"},{"article_id":"9e530ff67b47ea284a602f40a787afd8","title":"La Deporteca estrena nueva temporada","link":"https://www.marca.com/radio/2023/09/17/65031fb422601d65068b45e1.html","keywords":["Radio Marca","cultura","Otros Deportes"],"creator":["Natalia Freire"],"video_url":null,"description":null,"content":"omenzamos una nueva temporada de esta aventura llamada , que nació allá por septiembre de 2004, en la que se conjuga la cultura y el deporte. Después de diecinueve años seguimos demostrando que el deporte es cultura y que existe una cultura del deporte. En este primer programa presentamos a tres colaboradores de lujo que nos acompañarán esta temporada. , en su sección, , nos contará curiosidades y anécdotas de la música y los músicos relacionados con los deportes. , director de cine, realizador, guionista y profesor de actores, nos hablará en la sección, , de la conexión del deporte con el cine. , escritor y profesor, en su sección, , nos descubrirá a excéntricos y curiosos personajes relacionados con el deporte que inspiran relatos literarios. Además de todo esto, continuaremos con las entrevistas a músicos, autores y todo tipo de artistas que hayan encontrado una conexión entre el deporte y la cultura. Julio Ruiz estuvo durante cincuenta años al frente del programa en RNE. Tras su jubilación se embarcó en nuevas aventuras como el podcast que publica cada semana en y en la sección en donde cada semana nos cuenta curiosidades y anécdotas recogidas durante su larga carrera como periodista musical en la que ha tenido oportunidad de conocer de cerca a muchos músicos que encontraron inspiración en el deporte y publicaron trabajos relacionados con deportes o deportistas o bien se mostraron como aficionados o practicantes de algún deporte. Aprovechando la presentación de la nueva temporada Julio Ruiz nos brindó un aperitivo de lo que será su sección: en una charla reciente con de hablando sobre su proyecto en solitario, , el artista confirmó que su hijo estaba jugando al fútbol en un equipo de Granada y que apuntaba maneras. Con hablamos hace unos meses, en la víspera del inicio del Giro de Italia cuando recién acababa el rodaje de su última película, , que está en fase de montaje. Comenzó su trayecto cinematográfico en la Facultad de Bellas Artes de Cuenca, donde estudió y trabajó en varios proyectos conjuntos. Después realizó cursos de guion cinematográfico en Madrid y de dirección en UQAM (Université du Québec à Montréal) en Canadá, así como un master en 'Experto en dirección cinematográfica' en la Universidad Camilo José Cela. Ha filmado varios cortometrajes como ' ' o ' ' y los largometrajes ' ', y ' ', ' ' y la antes citada, ' ' en la que el periodista . Además, es en es un centro especializado en la formación y entrenamiento de actores y actrices para cine y televisión y para la formación integral del actor. En el ámbito literario tiene publicadas tres novelas: ' , (Premio nacional de novela histórica) y ' \". En el mundo del cómic he escrito la serie ' ', publicada en varios países y traducida a seis idiomas y, precisamente de este cómic nos habló en su debut como colaborador en La Deporteca. \"Fue de la mano del dibujante, , que es un dibujante consolidado dentro del mercado franco/belga, que es quizá en Europa el mercado más importante que hay en cómics. Nos conocimos, le conté la historia y él se la contó a los editores franceses a los que les pareció maravilloso porque es historia y deporte y a los franceses les apasionan esas dos cosas, el cómic y los deportes, así que nos lanzamos, la escribimos y ha sido un éxito\". En este cómic aparece un personaje del que nos habló Juanra Fernández: , un auriga que está considerado el deportista que más dinero ha ganado en la historia, por encima incluso de nombres como . Precisamente el personaje de aparece en el último libro del profesor y escritor . Ya son unas cuantas temporadas las que llevamos contando con la colaboración de este contador de historias divertidas y curiosas que pasan normalmente desapercibidas. Desde , apodado , que fingió ser futbolista durante muchos años pero que siempre se las arreglaba para no jugar ningún partido y que todo el mundo comprobara que no sabía jugar, hasta , conocido como y el personaje que interpretó en la película y que era amigo del Premio Nobel de Literatura, con el que compartía largas charlas sobre cricket. Cada semana en , y siempre que quieras en el podcast, tienes una cita con la cultura y el deporte.","pubDate":"2023-09-17 19:52:40","image_url":"https://phantom-marca.unidadeditorial.es/ced7ee89e37e8d3539634c449a1b7a5c/resize/600/assets/multimedia/imagenes/2023/09/14/16947145711659.jpg","source_id":"marca","source_priority":426,"country":["colombia"],"category":["sports"],"language":"spanish"},{"article_id":"15c99102a783b1e960bb3b4d60e96c7b","title":"“Not hot favourites”: Former cricketer Atul Wassan on India’s World Cup chances","link":"https://thenewsmill.com/2023/09/not-hot-favourites-former-cricketer-atul-wassan-on-indias-world-cup-chances/","keywords":["Cricket","Sports","ANI"],"creator":["ANI"],"video_url":null,"description":"The News Mill","content":"While India reigned supreme at the Premadasa on Sunday, humbling defending champions Sri Lanka by 10 wickets to lift their 8th Asia Cup, former international cricketer Atul Wassan said the ‘Men in Blue’ were not the “hot favourites” going into the ODI World Cup next month. The 50-over showpiece, to be hosted in India this year, will get underway in less than a couple of weeks from now. Weighing in on India’s chances to claim their third world crown after 2013 when a certain MS Dhoni led his boys to glory, Wassan said he believed that much of the team’s prospects in the tournament would depend on the nature of the surfaces they play on and whether they build on their success in the Asia Cup. “We are ready for the World Cup. The Indian fans believe that they are the hot favourites to lift the trophy this year. However, if our team goes into the tournament as the favourite and suffers an early exit, the fans will be left heartbroken as they have been over the last 13 years. Hence, I believe it is best to temper our expectations while being cautiously optimistic about our chances. I think we are not the hot favourites. Much of our chances in the tournament would depend on how we go from here (Asia Cup success) and the kind of pitches we play on,” the former India speedster told ANI. He added that he was in agreement with head coach Rahul Dravid’s tactic of employing new ball bowlers, who are best suited to red-ball or Test format, in 50-over cricket as they would extract more movement and swing from the red cherry in the early overs. “I would personally endorse Rahul Dravid’s thinking that bowlers, mostly suited to the Test format, will also do well in ODIs as the new ball swings and seams in the early overs and a team needs to go in with attacking bowlers who can get early breakthroughs. You can’t have attacking bowlers in ODIs operating on defensive lines and lengths and trying to save runs. It’s wickets that win you matches,” the former India opening bowler added. Hailing Team India’s dominating win in the Asia Cup final on Sunday, Wassan said the team does look settled ahead of the showpiece event, with key players back from injuries and on song. “Delighted as I am at India winning the Asia Cup after 5 years, I believe that this victory is only the beginning. It’s the beginning of a process that can take us to more glories down the road. Everyone is looking forward to India going well in the World Cup and our team does look balanced and settled,” Wassan signed off saying. (ANI)","pubDate":"2023-09-17 19:30:11","image_url":null,"source_id":"thenewsmill","source_priority":3781717,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"7ac65ccc4e854a140d4ef73effecefdd","title":"Sports Highlights: অষ্টমবার এশিয়াসেরা ভারত, কিশোর ভারতীতে লা লিগার অ্যাকাডেমি, এক নজরে খেলার সব খবর","link":"https://bengali.abplive.com/sports/sports-highlights-know-latest-updates-of-teams-players-matches-and-other-highlights-17th-september-1009884","keywords":["খেলা"],"creator":["ABP Ananda"],"video_url":null,"description":"কলকাতা: এশিয়া কাপের ফাইনালে শ্রীলঙ্কাকে ১০ উইকেটে দুরমুশ করে রেকর্ড অষ্টমবার এশিয়াসেরা হল ভারত। কিশোর ভারতীতেই হবে লা লিগার স্টেডিয়াম, বার্সেলোনা থেকে ঘোষণা বাংলার মুখ্যমন্ত্রীর। এক নজরে খেলার সারাদিনের সেরা খবরগুলি। এশিয়াসেরা ভারত শ্রীলঙ্কাকে (Sri Lanka Cricket Team) হারিয়ে অষ্টমবার এশিয়া কাপ (Asia Cup 2023) খেতাব জয়ের জন্য ভারতের (Indian Cricket Team) সামনে লক্ষ্য ছিল মাত্র ৫১ রান। এই রান তুলতে বেশি ঘাম ঝড়ানোর প্রয়োজন ছিল না। বেশি খাটা খাটনি করতে হল না। মাত্র ৬.১ ওভারেই ১০ উইকেটে ম্যাচ জিতে নিল ভারতীয় দল। শুভমন গিল ২৭ রান ও ঈশান কিষাণ ২৩ রানে অপরাজিত থাকেন। এদিন বল হাতে টসে হেরে প্রথমে বোলিং করতে হয় ভারতকে। বল হাতে মহম্মদ সিরাজ়ের বিধ্বংসী বোলিংয়ে কোনওক্রমে ৫০ পূর্ণ করে দ্বীপরাষ্ট্র। ছয় উইকেট নেন সিরাজ়। কিশোর ভারতীতে লা লিগা অ্যাকাডেমি মূলত বাংলায় লগ্নি টানতেই ১১ দিনের স্পেন সফরে গিয়েছেন মুখ্যমন্ত্রী মমতা বন্দোপাধ্যায় (Mamata Banerjee)। তবে শিল্পের পাশাপাশি খেলাধুলো বিশেষত ফুটবলের উন্নতি সাধনেও তৎপর মুখ্যমন্ত্রী। সেই মর্মে ইতিমধ্যেই লা লিগা কর্তৃপক্ষের সঙ্গে চুক্তি স্বাক্ষরও করেছেন তিনি। সেই চুক্তি অনুযায়ী বাংলায় অ্যাকাডেমি গড়বে লা লিগা (La Liga) কর্তৃপক্ষ। তবে ঠিক কোথায় সেই অ্যাকাডেমি গড়া হবে, তা জানানো হয়নি। আজ লা লিগার অ্যাকাডেমি গড়ার জন্য স্থান ঘোষণা করে দিলেন মমতা।  মাদ্রিদ সফর শেষে আজ আরেক প্রসিদ্ধ ফুটবল শহর বার্সেলোনায় গিয়েছেন মুখ্যমন্ত্রী। সেখানেই সকলের উদ্দেশে তিনি জানান যে লা লিগার অ্যাকাডেমি গড়ার জন্য কিশোর ভারতী স্টেডিয়ামই (Kishore Bharati Stadium) কর্তৃপক্ষের হাতে তুলে দিতে চলেছেন তিনি। মমতা বলেন, 'বিশ্বের সেরা সংগঠন এবং জনপ্রিয়তম লিগ লা লিগার সঙ্গে দিনকয়েক আগেই আমরা চুক্তি স্বাক্ষর করেছি। ওদের পেশাদারিত্ব নিয়ে কোনও প্রশ্ন থাকতে পারে না। লা লিগা কর্তৃপক্ষ বাংলায় অ্যাকাডেমি গড়তে আগ্রহ দেখিয়েছিলেন। দুই দিন আগেই এই বিষয়ে আমাদের মধ্যে কথা হয়েছিল। ওরা জমি পেলেই কলকাতায় অ্যাকাডেমি গড়ার কাজ শুরু করে দেবে বলেই জানিয়েছিল। আজ আমি এখান থেকেই ঘোষণা করছি, যে ওদের অ্যাকাডেমি গড়ার জন্য সমস্ত সুযোগ সুবিধাসহ বাংলার একটা গোটা স্টেডিয়াম দেব আমরা। আমার বন্ধুদের কাছে এই বার্তা পৌঁছে দিন। যত শীঘ্র সম্ভব কলকাতায় এসে অ্যাকাডেমি গড়ার কাজ শুরু করে দিন। কিশোর ভারতী স্টেডিয়ামটা আমি এর জন্য দিয়ে দিচ্ছি।' মন জিতলেন সিরাজ় স্বপ্নের বোলিং স্পেলে এশিয়া কাপ ফাইনালে (Asia Cup 2023 Final) শ্রীলঙ্কাকে ধরাশায়ী করেছেন মহম্মদ সিরাজ় (Mohammed Siraj)। ২১ রানের বিনিময়ে ছয় উইকেট নিয়ে গড়েছেন একগুচ্ছ রেকর্ডও। তার দুরন্ত বোলিংয়ে ভর করেই মাত্র ৫০ রানে শ্রীলঙ্কাকে অল আউট করে দেয় ভারতীয় দল। ১০ জিতে নেয় ফাইনাল। স্বাভাবিকভাবেই তাঁকে ম্যাচের সেরা ঘোষণা করা হয়। এরপরেই পুরস্কার বিতরণী অনুষ্ঠানে সিরাজের মানবিক মুখ ধরা পড়ল। ম্যাচ সেরা হওয়ার পর তিনি নিজের পুরস্কারমূল্যর পুরোটাই মাঠকর্মীদের উদ্দেশে দান করেন। তিনি বলেন, 'এই পুরস্কারমূল্যের পুরোটাই মাঠকর্মীদের জন্য। ওদের ছাড়া তো এই টুর্নামেন্টটা আয়োজন করা সম্ভবই হবে না।' নিজের বোলিং স্পেল নিয়ে প্রশ্ন করা হলে সিরাজ় অকপটে মেনে নেন যে এটাই তাঁর কেরিয়ারের সেরা বোলিং স্পেন। 'অনেকদিন ধরেই ভাল বোলিং করছি আমি। তবে আজকে সব বল ঠিকানায় পড়েছে। এই পিচে তো বল সিম করেই তো আজ বল সুইংও করেছিল। সেই কারণেই ফুল লেংথে বল করছিলাম। দলের সকল ফাস্ট বোলারের মধ্যেই কিন্তু সম্পর্ক খুব ভাল। দলের জন্য এটা খুবই ভাল বিষয়' বলেন ভারতের তারকা ফাস্ট বোলার। ডায়মন্ড লিগে দ্বিতীয় নীরজ   কিছুদিন আগেই অ্য়াথলেটিক্সের বিশ্ব চ্যাম্পিয়নশিপে সোনা জিতেছিলেন। এর আগে অলিম্পিক্সেও সোনা জিতেছেন। স্বপ্নের ফর্মে থাকলেও ডায়মন্ড লিগ ফাইনালে অল্পের জন্য সোনা খোয়াতে হল নীরজ চোপড়াকে। ১৬ সেপ্টেম্বর ফাইনালে ৮৩.৮০ মিটার থ্রো করে দ্বিতীয় স্থান অর্জন করেন পানিপথের তরুণ। ডায়মন্ড লিগের ফাইনাল জিতেছেন চেক প্রজাতন্ত্রের জাকুব ভ্যাডলেচ। যিনি তার প্রথম প্রচেষ্টায় ৮৪.২৪ মিটার থ্রো করেছিলেন। এদিন প্রথম থ্রো-টি ফাউল হয়ে যায় নীরজের। যদিও দ্বিতীয়বারের প্রচেষ্টাতেই ৮৩.৮০ মিটার দূরত্ব অতিক্রম করেন নীরজ। এর আগে ডায়মন্ড লিগ জিতেছিলেন নীরজ। কিন্তু এবার আর পারলেন না। চেক প্রজাতন্ত্রের ভিটেজস্লাভ ভেসেলি ২০১২ এবং ২০১৪ সালে খেতাব জিতেছিলেন। এছাড়া জাকুব ভ্যাডলেচ ২০১৬ এবং ২০১৭ সালে এই কৃতিত্ব অর্জন করেছিলেন। নীরজ এবার খেতাব জিতলে তিনি বিশ্বের তৃতীয় ও ভারতের প্রথম প্লেয়ার হিসেবে এই নজির গড়তেন। নীরজের নজরে এ বার এশিয়ান গেমস। জাকার্তা এশিয়ান গেমসে সোনার পদক জিতেছিলেন। হাংঝৌতে তাঁর কাছ থেকে সোনার প্রত্যাশায় ভারতীয় ক্রীড়াপ্রেমীরা। দিল্লির হেডকোচ বাংলার প্রাক্তনী তিনি বাংলার হয়ে ঘরোয়া ক্রিকেট খেলেছেন। বাংলা দলকে (Bengal Cricket Team) নেতৃত্বও দিয়েছিলেন। বাংলার জার্সিতে যে দুজন ক্রিকেটারের প্রথম শ্রেণির ক্রিকেটে ট্রিপল সেঞ্চুরি রয়েছে, তাঁদের মধ্যে অন্যতম তিনি। সেই দেবাঙ্গ গাঁধীকে (Devang Gandhi) হেড কোচ হিসাবে নিয়োগ করল দিল্লি ও জেলা ক্রিকেট সংস্থা। শনিবার সংস্থার তরফে ঘোষণা করা হল, আগামী মরশুমে দিল্লির প্রধান কোচ হিসাবে দায়িত্ব সামলাবেন দেবাঙ্গ। ঘরোয়া ক্রিকেটে দিল্লির সাম্প্রতির ফর্ম ভাল নয়। ব্যর্থতার সেই ছবিটা কাটাতে তৎপর দিল্লি ও জেলা ক্রিকেট সংস্থা। সেই জন্য কোচ হিসাবে নতুন মুখকে দায়িত্বে আনা হল। আপনার পছন্দের খবর আর আপডেট এখন পাবেন আপনার পছন্দের চ্যাটিং প্ল্যাটফর্ম টেলিগ্রামেও। যুক্ত হোন https://t.me/abpanandaofficial আরও পড়ুন: এশিয়া কাপে টুর্নামেন্টসেরা হয়ে রোহিতকে কৃতজ্ঞতা জানালেন কুলদীপ","content":"কলকাতা: এশিয়া কাপের ফাইনালে শ্রীলঙ্কাকে ১০ উইকেটে দুরমুশ করে রেকর্ড অষ্টমবার এশিয়াসেরা হল ভারত। কিশোর ভারতীতেই হবে লা লিগার স্টেডিয়াম, বার্সেলোনা থেকে ঘোষণা বাংলার মুখ্যমন্ত্রীর। এক নজরে খেলার সারাদিনের সেরা খবরগুলি। এশিয়াসেরা ভারত শ্রীলঙ্কাকে (Sri Lanka Cricket Team) হারিয়ে অষ্টমবার এশিয়া কাপ (Asia Cup 2023) খেতাব জয়ের জন্য ভারতের (Indian Cricket Team) সামনে লক্ষ্য ছিল মাত্র ৫১ রান। এই রান তুলতে বেশি ঘাম ঝড়ানোর প্রয়োজন ছিল না। বেশি খাটা খাটনি করতে হল না। মাত্র ৬.১ ওভারেই ১০ উইকেটে ম্যাচ জিতে নিল ভারতীয় দল । শুভমন গিল ২৭ রান ও ঈশান কিষাণ ২৩ রানে অপরাজিত থাকেন। এদিন বল হাতে টসে হেরে প্রথমে বোলিং করতে হয় ভারতকে। বল হাতে মহম্মদ সিরাজ়ের বিধ্বংসী বোলিংয়ে কোনওক্রমে ৫০ পূর্ণ করে দ্বীপরাষ্ট্র। ছয় উইকেট নেন সিরাজ়। কিশোর ভারতীতে লা লিগা অ্যাকাডেমি googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); মূলত বাংলায় লগ্নি টানতেই ১১ দিনের স্পেন সফরে গিয়েছেন মুখ্যমন্ত্রী মমতা বন্দোপাধ্যায় (Mamata Banerjee)। তবে শিল্পের পাশাপাশি খেলাধুলো বিশেষত ফুটবলের উন্নতি সাধনেও তৎপর মুখ্যমন্ত্রী। সেই মর্মে ইতিমধ্যেই লা লিগা কর্তৃপক্ষের সঙ্গে চুক্তি স্বাক্ষরও করেছেন তিনি। সেই চুক্তি অনুযায়ী বাংলায় অ্যাকাডেমি গড়বে লা লিগা (La Liga) কর্তৃপক্ষ। তবে ঠিক কোথায় সেই অ্যাকাডেমি গড়া হবে, তা জানানো হয়নি। আজ লা লিগার অ্যাকাডেমি গড়ার জন্য স্থান ঘোষণা করে দিলেন মমতা। মাদ্রিদ সফর শেষে আজ আরেক প্রসিদ্ধ ফুটবল শহর বার্সেলোনায় গিয়েছেন মুখ্যমন্ত্রী। সেখানেই সকলের উদ্দেশে তিনি জানান যে লা লিগার অ্যাকাডেমি গড়ার জন্য কিশোর ভারতী স্টেডিয়ামই (Kishore Bharati Stadium) কর্তৃপক্ষের হাতে তুলে দিতে চলেছেন তিনি। মমতা বলেন, 'বিশ্বের সেরা সংগঠন এবং জনপ্রিয়তম লিগ লা লিগার সঙ্গে দিনকয়েক আগেই আমরা চুক্তি স্বাক্ষর করেছি। ওদের পেশাদারিত্ব নিয়ে কোনও প্রশ্ন থাকতে পারে না। লা লিগা কর্তৃপক্ষ বাংলায় অ্যাকাডেমি গড়তে আগ্রহ দেখিয়েছিলেন। দুই দিন আগেই এই বিষয়ে আমাদের মধ্যে কথা হয়েছিল। ওরা জমি পেলেই কলকাতায় অ্যাকাডেমি গড়ার কাজ শুরু করে দেবে বলেই জানিয়েছিল। আজ আমি এখান থেকেই ঘোষণা করছি, যে ওদের অ্যাকাডেমি গড়ার জন্য সমস্ত সুযোগ সুবিধাসহ বাংলার একটা গোটা স্টেডিয়াম দেব আমরা। আমার বন্ধুদের কাছে এই বার্তা পৌঁছে দিন। যত শীঘ্র সম্ভব কলকাতায় এসে অ্যাকাডেমি গড়ার কাজ শুরু করে দিন। কিশোর ভারতী স্টেডিয়ামটা আমি এর জন্য দিয়ে দিচ্ছি।' মন জিতলেন সিরাজ় স্বপ্নের বোলিং স্পেলে এশিয়া কাপ ফাইনালে (Asia Cup 2023 Final) শ্রীলঙ্কাকে ধরাশায়ী করেছেন মহম্মদ সিরাজ় (Mohammed Siraj)। ২১ রানের বিনিময়ে ছয় উইকেট নিয়ে গড়েছেন একগুচ্ছ রেকর্ডও। তার দুরন্ত বোলিংয়ে ভর করেই মাত্র ৫০ রানে শ্রীলঙ্কাকে অল আউট করে দেয় ভারতীয় দল । ১০ জিতে নেয় ফাইনাল। স্বাভাবিকভাবেই তাঁকে ম্যাচের সেরা ঘোষণা করা হয়। এরপরেই পুরস্কার বিতরণী অনুষ্ঠানে সিরাজের মানবিক মুখ ধরা পড়ল। ম্যাচ সেরা হওয়ার পর তিনি নিজের পুরস্কারমূল্যর পুরোটাই মাঠকর্মীদের উদ্দেশে দান করেন। তিনি বলেন, 'এই পুরস্কারমূল্যের পুরোটাই মাঠকর্মীদের জন্য। ওদের ছাড়া তো এই টুর্নামেন্টটা আয়োজন করা সম্ভবই হবে না।' নিজের বোলিং স্পেল নিয়ে প্রশ্ন করা হলে সিরাজ় অকপটে মেনে নেন যে এটাই তাঁর কেরিয়ারের সেরা বোলিং স্পেন। 'অনেকদিন ধরেই ভাল বোলিং করছি আমি। তবে আজকে সব বল ঠিকানায় পড়েছে। এই পিচে তো বল সিম করেই তো আজ বল সুইংও করেছিল। সেই কারণেই ফুল লেংথে বল করছিলাম। দলের সকল ফাস্ট বোলারের মধ্যেই কিন্তু সম্পর্ক খুব ভাল। দলের জন্য এটা খুবই ভাল বিষয়' বলেন ভারতের তারকা ফাস্ট বোলার। ডায়মন্ড লিগে দ্বিতীয় নীরজ কিছুদিন আগেই অ্য়াথলেটিক্সের বিশ্ব চ্যাম্পিয়নশিপে সোনা জিতেছিলেন। এর আগে অলিম্পিক্সেও সোনা জিতেছেন। স্বপ্নের ফর্মে থাকলেও ডায়মন্ড লিগ ফাইনালে অল্পের জন্য সোনা খোয়াতে হল নীরজ চোপড়াকে। ১৬ সেপ্টেম্বর ফাইনালে ৮৩.৮০ মিটার থ্রো করে দ্বিতীয় স্থান অর্জন করেন পানিপথের তরুণ। ডায়মন্ড লিগের ফাইনাল জিতেছেন চেক প্রজাতন্ত্রের জাকুব ভ্যাডলেচ। যিনি তার প্রথম প্রচেষ্টায় ৮৪.২৪ মিটার থ্রো করেছিলেন। এদিন প্রথম থ্রো-টি ফাউল হয়ে যায় নীরজের। যদিও দ্বিতীয়বারের প্রচেষ্টাতেই ৮৩.৮০ মিটার দূরত্ব অতিক্রম করেন নীরজ। এর আগে ডায়মন্ড লিগ জিতেছিলেন নীরজ। কিন্তু এবার আর পারলেন না। চেক প্রজাতন্ত্রের ভিটেজস্লাভ ভেসেলি ২০১২ এবং ২০১৪ সালে খেতাব জিতেছিলেন। এছাড়া জাকুব ভ্যাডলেচ ২০১৬ এবং ২০১৭ সালে এই কৃতিত্ব অর্জন করেছিলেন। নীরজ এবার খেতাব জিতলে তিনি বিশ্বের তৃতীয় ও ভারতের প্রথম প্লেয়ার হিসেবে এই নজির গড়তেন। নীরজের নজরে এ বার এশিয়ান গেমস। জাকার্তা এশিয়ান গেমস ে সোনার পদক জিতেছিলেন। হাংঝৌতে তাঁর কাছ থেকে সোনার প্রত্যাশায় ভারতীয় ক্রীড়াপ্রেমীরা। দিল্লির হেডকোচ বাংলার প্রাক্তনী তিনি বাংলার হয়ে ঘরোয়া ক্রিকেট খেলেছেন। বাংলা দলকে (Bengal Cricket Team) নেতৃত্বও দিয়েছিলেন। বাংলার জার্সিতে যে দুজন ক্রিকেটারের প্রথম শ্রেণির ক্রিকেটে ট্রিপল সেঞ্চুরি রয়েছে, তাঁদের মধ্যে অন্যতম তিনি। সেই দেবাঙ্গ গাঁধীকে (Devang Gandhi) হেড কোচ হিসাবে নিয়োগ করল দিল্লি ও জেলা ক্রিকেট সংস্থা। শনিবার সংস্থার তরফে ঘোষণা করা হল, আগামী মরশুমে দিল্লির প্রধান কোচ হিসাবে দায়িত্ব সামলাবেন দেবাঙ্গ। ঘরোয়া ক্রিকেটে দিল্লির সাম্প্রতির ফর্ম ভাল নয়। ব্যর্থতার সেই ছবিটা কাটাতে তৎপর দিল্লি ও জেলা ক্রিকেট সংস্থা। সেই জন্য কোচ হিসাবে নতুন মুখকে দায়িত্বে আনা হল। আপনার পছন্দের খবর আর আপডেট এখন পাবেন আপনার পছন্দের চ্যাটিং প্ল্যাটফর্ম টেলিগ্রামেও। যুক্ত হোন https://t.me/abpanandaofficial আরও পড়ুন: এশিয়া কাপে টুর্নামেন্টসেরা হয়ে রোহিতকে কৃতজ্ঞতা জানালেন কুলদীপ var _fireSc=!0;document.addEventListener(\"scroll\",(e=>{if(_fireSc){var c=document.createElement(\"script\");c.src=\"//asset.fwpub1.com/js/storyblock.js\",c.async=!0,document.getElementsByTagName(\"head\")[0].appendChild(c),_fireSc=!1}}));","pubDate":"2023-09-17 19:15:51","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/09/18/321833c814aa0bd262a351e8f22f92c61694977639436507_original.jpg","source_id":"abplive","source_priority":10959,"country":["india"],"category":["sports"],"language":"bengali"},{"article_id":"afbc7f672fbc94ba39a6625533a4b219","title":"Asia Cup 2023: 'এই পারফরম্যান্স দীর্ঘদিন মনে থাকবে', এশিয়া কাপ জিতে দলের মানসিক দৃঢ়তার প্রশংসায় রোহিত","link":"https://bengali.abplive.com/sports/cricket/indian-captain-rohit-sharma-hails-team-mental-character-after-asia-cup-2023-final-victory-1009880","keywords":["ক্রিকেট"],"creator":["ABP Ananda"],"video_url":null,"description":"কলম্বো: প্রেমদাসা স্টেডিয়ামে এশিয়া কাপের (Asia Cup 2023) খেতাবি লড়াইয়ে মুখোমুখি হয়েছিল ভারত ও শ্রীলঙ্কা (IND vs Sri Lanka)। রবিবাসরীয় ফাইনালে শ্রীলঙ্কাকে পর্যুদস্ত করে রেকর্ড অষ্টমবার এশিয়া সেরা হয় ভারতীয় দল। মাত্র ৫০ রানেই শ্রীলঙ্কাকে অল আউট করার পর ১০ উইকেটে ম্যাচ জিতে নেয় ভারত। পাঁচ বছরের ট্রফির খরা কাটিয়ে ফের এশিয়া কাপ জিতে টিম ইন্ডিয়ার ক্রিকেটারদের মানসিক দৃঢ়তার প্রশংসা করেন ভারতীয় অধিনায়ক রোহিত শর্মা (Rohit Sharma)। ম্যাচের পুরস্কার বিতরণী অনুষ্ঠানে রোহিত বলেন, 'সত্যিই দল দুর্দান্ত পারফর্ম করেছে। কোনও টুর্নামেন্টের ফাইনালে এমন পারফরম্যান্স করাটা দলের মানসিক দৃঢ়তার পরিচয় দেয়। বল হাতে আমরা শুরুটাও অসাধারণ করেছি এবং ব্যাট হাতে ইনিংসটা শেষ করতেও আমরা বেশি সময় নিইনি। আমাদের ফাস্ট বোলাররা প্রচুর খাটা খাটনি করেছে। ওদের কী করতে হবে, না হবে, সেই বিষয়ে ওদের ধারণা খুব স্পষ্ট। এই পারফরম্যান্স দেখতেও বেশ ভাল লাগল।' এই পারফরম্যান্সে সহজে ভোলার নয় বলেই জানান রোহিত। 'এমন এক পারফরম্যান্স দীর্ঘদিন মনে থাকবে। বলটা যে এত সিম, সুইং হবে সেটা কিন্তু কল্পনাও করিনি। এর পুরো কৃতিত্বটাই বোলারদের দক্ষতার। সিরাজ বাহবা পাওয়ার যোগ্য। হাওয়ায় এবং পিচে, দুইভাবে বল মুভ করার দক্ষতাটা কিন্তু সকলের থাকে না। ও দারুণ উন্নতি করেছে।' বলেন তিনি। এশিয়া কাপ পকেটে পুরে নিয়েছে ভারত। এরপরেই বিশ্বকাপ। ঘরের মাটিতে ৫০ ওভারের বিশ্বকাপ শুরু হতে আর মাসখানেকও বাকি নেই। এশিয়া কাপ জয়ের পরেই এবার বিশ্বকাপ ও অস্ট্রেলিয়া সিরিজ় নিয়ে ভাবনাচিন্তা শুরু করে দিয়েছন ভারতীয় অধিনায়ক। তিনি বলেন, 'আমাদের যা যা সাফল্য লাভ করা সম্ভব, এশিয়া কাপে সেইসব সাফল্য পেয়েছি। হার্দিক ও ঈশান চাপের মুখে পাকিস্তানের বিরুদ্ধে যেমন ব্যাট করেছিল। তারপর কেএল এবং বিরাটের পাকিস্তানের বিরুদ্ধে শতরান। গিলও দারুণ খেলেছে। সব মিলিয়ে ভিন্ন ভিন্ন সময়ে ভিন্ন ভিন্ন ব্যক্তি দলের হয়ে সামনে এগিয়ে এসে পারফর্ম করেছেন। এরপর ভারতে যে সিরিজ আয়োজিত হবে আমাদের নজর সেইদিকে এবং অবশ্যই বিশ্বকাপের দিকে।' আপনার পছন্দের খবর আর আপডেট এখন পাবেন আপনার পছন্দের চ্যাটিং প্ল্যাটফর্ম টেলিগ্রামেও। যুক্ত হোন https://t.me/abpanandaofficial আরও পড়ুন: এশিয়া কাপে চ্যাম্পিয়ন হয়ে কত টাকা পেল ভারত? শ্রীলঙ্কার ঝুলিতে গেল কত অর্থ?","content":"কলম্বো: প্রেমদাসা স্টেডিয়ামে এশিয়া কাপের (Asia Cup 2023) খেতাবি লড়াইয়ে মুখোমুখি হয়েছিল ভারত ও শ্রীলঙ্কা (IND vs Sri Lanka)। রবিবাসরীয় ফাইনালে শ্রীলঙ্কাকে পর্যুদস্ত করে রেকর্ড অষ্টমবার এশিয়া সেরা হয় ভারতীয় দল । মাত্র ৫০ রানেই শ্রীলঙ্কাকে অল আউট করার পর ১০ উইকেটে ম্যাচ জিতে নেয় ভারত। পাঁচ বছরের ট্রফির খরা কাটিয়ে ফের এশিয়া কাপ জিতে টিম ইন্ডিয়ার ক্রিকেটারদের মানসিক দৃঢ়তার প্রশংসা করেন ভারতীয় অধিনায়ক রোহিত শর্মা (Rohit Sharma)। ম্যাচের পুরস্কার বিতরণী অনুষ্ঠানে রোহিত বলেন, 'সত্যিই দল দুর্দান্ত পারফর্ম করেছে। কোনও টুর্নামেন্টের ফাইনালে এমন পারফরম্যান্স করাটা দলের মানসিক দৃঢ়তার পরিচয় দেয়। বল হাতে আমরা শুরুটাও অসাধারণ করেছি এবং ব্যাট হাতে ইনিংসটা শেষ করতেও আমরা বেশি সময় নিইনি। আমাদের ফাস্ট বোলাররা প্রচুর খাটা খাটনি করেছে। ওদের কী করতে হবে, না হবে, সেই বিষয়ে ওদের ধারণা খুব স্পষ্ট। এই পারফরম্যান্স দেখতেও বেশ ভাল লাগল।' এই পারফরম্যান্সে সহজে ভোলার নয় বলেই জানান রোহিত। 'এমন এক পারফরম্যান্স দীর্ঘদিন মনে থাকবে। বলটা যে এত সিম, সুইং হবে সেটা কিন্তু কল্পনাও করিনি। এর পুরো কৃতিত্বটাই বোলারদের দক্ষতার। সিরাজ বাহবা পাওয়ার যোগ্য। হাওয়ায় এবং পিচে, দুইভাবে বল মুভ করার দক্ষতাটা কিন্তু সকলের থাকে না। ও দারুণ উন্নতি করেছে।' বলেন তিনি। এশিয়া কাপ পকেটে পুরে নিয়েছে ভারত। এরপরেই বিশ্বকাপ। ঘরের মাটিতে ৫০ ওভারের বিশ্বকাপ শুরু হতে আর মাসখানেকও বাকি নেই। এশিয়া কাপ জয়ের পরেই এবার বিশ্বকাপ ও অস্ট্রেলিয়া সিরিজ় নিয়ে ভাবনাচিন্তা শুরু করে দিয়েছন ভারতীয় অধিনায়ক। তিনি বলেন, 'আমাদের যা যা সাফল্য লাভ করা সম্ভব, এশিয়া কাপে সেইসব সাফল্য পেয়েছি। হার্দিক ও ঈশান চাপের মুখে পাকিস্তানের বিরুদ্ধে যেমন ব্যাট করেছিল। তারপর কেএল এবং বিরাটের পাকিস্তানের বিরুদ্ধে শতরান। গিলও দারুণ খেলেছে। সব মিলিয়ে ভিন্ন ভিন্ন সময়ে ভিন্ন ভিন্ন ব্যক্তি দলের হয়ে সামনে এগিয়ে এসে পারফর্ম করেছেন। এরপর ভারতে যে সিরিজ আয়োজিত হবে আমাদের নজর সেইদিকে এবং অবশ্যই বিশ্বকাপের দিকে।' googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); আপনার পছন্দের খবর আর আপডেট এখন পাবেন আপনার পছন্দের চ্যাটিং প্ল্যাটফর্ম টেলিগ্রামেও। যুক্ত হোন https://t.me/abpanandaofficial আরও পড়ুন: এশিয়া কাপে চ্যাম্পিয়ন হয়ে কত টাকা পেল ভারত? শ্রীলঙ্কার ঝুলিতে গেল কত অর্থ? var _fireSc=!0;document.addEventListener(\"scroll\",(e=>{if(_fireSc){var c=document.createElement(\"script\");c.src=\"//asset.fwpub1.com/js/storyblock.js\",c.async=!0,document.getElementsByTagName(\"head\")[0].appendChild(c),_fireSc=!1}}));","pubDate":"2023-09-17 19:01:37","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/09/18/a8b2fdcfb3c4443b5c6aa695a79bfd5d1694975712164507_original.jpg","source_id":"abplive","source_priority":10959,"country":["india"],"category":["sports"],"language":"bengali"},{"article_id":"938bbf60dc1656bdd5a9a1284f0b4eb5","title":"Marco Jansen Destroys Australian Top Order To Clinch Series For South Africa","link":"https://sports.ndtv.com/cricket/marco-jansen-destroys-australian-top-order-to-clinch-series-for-south-africa-4399375","keywords":null,"creator":null,"video_url":null,"description":"Marco Jansen dismissed the first five Australian batsmen to clinch a come-from-behind series win for South Africa.","content":"Left-arm fast bowler Marco Jansen dismissed the first five Australian batsmen to clinch a come-from-behind series win for South Africa in the fifth one-day international at the Wanderers Stadium on Sunday. Jansen took five for 39 as Australia were bowled out for 193 in reply to South Africa's 315 for nine. South African captain Temba Bavuma said the character of the team had shone through after they lost the first two matches of the series, which boded well for the World Cup in India next month. \"There is a lot of confidence we can take, in that we had our backs against the wall and we showed we have ways of getting on top of the game. We will go to India in probably the best state we can be.\" South Africa won each of the last three matches by more than 100 runs after they were sent in to bat by Australian captain Mitchell Marsh . Marsh admitted: \"We were outplayed in the last three games but we have a one-day game in India on Friday, a lot of players coming back and a big World Cup coming up.\" Several leading players, including regular captain Pat Cummins , fellow fast bowler Mitchell Starc , all-rounder Glenn Maxwell and star batsman Steve Smith, will join the team for a pre-World Cup series against India starting in Mohali on Friday. Marsh's decision to bowl first in the only day game of the series seemed justified on Sunday when his bowlers reduced South Africa to 103 for four in the 24th over on a pitch which offered sideways movement and bounce to the seamers. Player of the series Aiden Markram (93) and David Miller (63) put on 109 for the fifth wicket and lower order batsmen Jansen and Andile Phehlukwayo took the total past 300 with some big hitting towards the end. Jansen hit three sixes in scoring 47 off 29 balls and Phehlukwayo cleared the boundary four times in his unbeaten 39 off 19 deliveries. Marsh and David Warner blasted 34 off the first three overs of the Australian innings but Jansen came into the attack and dismissed Warner and Inglis in a double-wicket maiden over. Marsh (71) and Marnus Labuschagne (44) put on 90 for the third wicket but Jansen dismissed both set batsmen and Alex Carey in a burst of three wickets off seven balls to put South Africa in command. Advertisement (This story has not been edited by NDTV staff and is auto-generated from a syndicated feed.)","pubDate":"2023-09-17 18:53:33","image_url":null,"source_id":"ndtv","source_priority":1204,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"dedb656780ddd62c3bf1b216a9173d27","title":"“No team came so close to them”: Irfan Pathan lauds India’s dominance in Asia Cup","link":"https://thenewsmill.com/2023/09/no-team-came-so-close-to-them-irfan-pathan-lauds-indias-dominance-in-asia-cup/","keywords":["Cricket","Sports","ANI"],"creator":["ANI"],"video_url":null,"description":"The News Mill","content":"Former cricketer Irfan Pathan believes India’s thumping victory over Sri Lanka in the Asia Cup final will act as a major “confidence boost” for the team in the upcoming ODI World Cup. The defending champions failed to survive the threat posed by the Men in Blue’s star-studded pace bowling line-up which was spearheaded by Mohammed Siraj. Pathan reflected on India’s performance in the entire tournament and felt that no team was able to pose a challenge to the Asia Cup 2023 champions and how this kind of performance will play a major role in the upcoming tournament. “It was a very conventional victory and, convincing entry because, in Asia Cup, I think no team came so close to team India except Bangladesh where the main team wasn’t playing. But if you’re talking about the main, where top players played. No one came close. And, to have that kind of victory before the World Cup, I think it’s a great boost of confidence for Team India. And that’s great to see, especially the kind of fast growth that we saw against Sri Lanka,” Pathan told reporters. Coming to the match, after speedster, Mohammed Siraj’s fiery spell decimated Sri Lanka, the opening duo of Shubman Gill and Ishan Kishan’s fifty-run partnership helped India lift the Asia Cup trophy for the 8th time in style after beating co-hosts in the final at the R Premadasa Stadium in Colombo on Sunday. Leading the India fast bowling effort, Siraj ran through the Sri Lanka top-order in a dazzling performance in the summit clash. It just took a little more than two hours for India to win their 8th Asia Cup title in style. Men in Blue lifted the Asia Cup trophy after five years. The Asia Cup summit clash witnessed a remarkable turn of events as Indian paceman Siraj bowled a dream spell against Sri Lanka. In a stunning display of bowling prowess, Sri Lanka was bowled out for a mere 50 runs in just 15.2 overs, predominantly due to Siraj’s outstanding performance, claiming six wickets in seven overs. (ANI)","pubDate":"2023-09-17 18:30:11","image_url":null,"source_id":"thenewsmill","source_priority":3781717,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"0c7867e2194b87e82ea903c0deddf3ff","title":"Asia Cup 2023: এশিয়া কাপে টুর্নামেন্টসেরা হয়ে রোহিতকে কৃতজ্ঞতা জানালেন কুলদীপ","link":"https://bengali.abplive.com/sports/cricket/asia-cup-2023-kuldeep-yadav-credits-rohit-sharma-after-winning-man-of-the-series-award-1009875","keywords":["ক্রিকেট"],"creator":["ABP Ananda"],"video_url":null,"description":"কলম্বো: এশিয়া কাপের ফাইনালে (Asia Cup 2023 Final) শ্রীলঙ্কাকে কার্যত নাস্তানাবুদ করে অষ্টমবার এশিয়াসেরা হয়েছে ভারতীয় ক্রিকেট দল (Indian Cricket Team)। ১০ উইকেটে জিতে নিয়েছে ফাইনাল। খেতাবি লড়াইয়ে ফাস্ট বোলার, আরও নির্দিষ্ট করে বলতে গেলে মহম্মদ সিরাজ়ের দাপট দেখা গেলেও, টুর্নামেন্ট সেরার পুরস্কার কিন্তু জিতেছেন কুলদীপ যাদব (Kuldeep Yadav)।  ফাইনালে কোনও উইকেট পাননি কুলদীপ। বল করেছেন মাত্র দুই ওভার। তবে টুর্নামেন্টের সুপার ফোরে দুরন্ত ছন্দে ছিলেন তিনি। তাঁর দৌলতেই পরপর দুই দিন দুই ম্যাচে পাকিস্তান ও শ্রীলঙ্কাকে পরাজিত করেছিল ভারত। এক ম্যাচে পাঁচ ও পরের ম্যাচে চার উইকেট নেন তিনি। নয় উইকেট নিয়েই টুর্নামেন্ট সেরা হন কুলদীপ। বিগত দেড় বছর ধরে নিজের বোলিং নিয়ে খুবই খাটাখাটনি করেছেন এবং তার ফলেই এই সাফল্য পেয়েছেন বলে জানান কুলদীপ।  পুরস্কারবিতরণী অনুষ্ঠানে তিনি বলেন, 'আমার ছন্দে ফিরে পেতে বিগত বছর দেড়েক ধরে প্রচুর খাটা খাটনি করেছি। ক্রিজেও আরও আক্রমণাত্মকভাবে ছুটে আসছি। নিজের বোলিং দেখে আমার নিজেরও বেশ ভাল লেগেছে। টি-টোয়েন্টিতে সঠিক লেংথে বল করাটা বেশি জরুরি। উইকেট নেওয়ার বিষয়ে তেমনটা ভাবনাচিন্তার সুযোগ থাকে না। সেই কারণেই সঠিক লেংথে বোলিং করার দিকে নজর দিয়েছি।' এরপরেই নিজের সাফল্যের জন্য তিনি ভারতীয় অধিনায়ক রোহিত শর্মাকেও কৃতিত্ব দেন। রোহিতকে বাহবা দিয়ে কুলদীপ বলেন, 'আমার সাফল্যের অনেকটা কৃতিত্বই রোহিত ভাইয়ের। ওঁ আমায় আমার বলের গতি নিয়ে খাটার পরামর্শ দিয়েছিল। আমাদের ফাস্ট বোলাররাও তো পাওয়ার প্লেতে নিয়মিত উইকেট নিচ্ছেন। তাই পরবর্তী সময়ে স্পিনারদের বোলিং করাটা অনেকটাই সহজ হয়ে যায়।' অপরদিকে, গ্যালারিভর্তি দর্শকদের সামনে ম্যাচ হেরে অনুতপ্ত শ্রীলঙ্কান অধিনায়ক দাসুন শনাকা। সমর্থকদের কাছে ক্ষমাও চেয়ে নিলেন তিনি। ম্যাচের পুরস্কার বিতরণী অনুষ্ঠানে শ্রীলঙ্কার অধিনায়ক বলেছেন, 'আমি সমর্থকদের ধন্যবাদ জানাতে চাই। যাঁরা মাঠ ভরিয়েছিলেন। আমরা আপনাদের হতাশ করেছি। তার জন্য দুঃখিত। তবু এই নিঃশর্ত সমর্থনের জন্য কৃতজ্ঞ।' ভারতীয় দলকে খেতাব জয়ের জন্য কিন্তু অভিনন্দনও জানিয়েছেন শনাকা।  আপনার পছন্দের খবর আর আপডেট এখন পাবেন আপনার পছন্দের চ্যাটিং প্ল্যাটফর্ম টেলিগ্রামেও। যুক্ত হোন https://t.me/abpanandaofficial আরও পড়ুন: এশিয়া কাপে চ্যাম্পিয়ন হয়ে কত টাকা পেল ভারত? শ্রীলঙ্কার ঝুলিতে গেল কত অর্থ?  ","content":"কলম্বো: এশিয়া কাপের ফাইনালে (Asia Cup 2023 Final) শ্রীলঙ্কাকে কার্যত নাস্তানাবুদ করে অষ্টমবার এশিয়াসেরা হয়েছে ভারতীয় ক্রিকেট দল (Indian Cricket Team)। ১০ উইকেটে জিতে নিয়েছে ফাইনাল। খেতাবি লড়াইয়ে ফাস্ট বোলার, আরও নির্দিষ্ট করে বলতে গেলে মহম্মদ সিরাজ়ের দাপট দেখা গেলেও, টুর্নামেন্ট সেরার পুরস্কার কিন্তু জিতেছেন কুলদীপ যাদব (Kuldeep Yadav)। ফাইনালে কোনও উইকেট পাননি কুলদীপ। বল করেছেন মাত্র দুই ওভার। তবে টুর্নামেন্টের সুপার ফোরে দুরন্ত ছন্দে ছিলেন তিনি। তাঁর দৌলতেই পরপর দুই দিন দুই ম্যাচে পাকিস্তান ও শ্রীলঙ্কাকে পরাজিত করেছিল ভারত। এক ম্যাচে পাঁচ ও পরের ম্যাচে চার উইকেট নেন তিনি। নয় উইকেট নিয়েই টুর্নামেন্ট সেরা হন কুলদীপ। বিগত দেড় বছর ধরে নিজের বোলিং নিয়ে খুবই খাটাখাটনি করেছেন এবং তার ফলেই এই সাফল্য পেয়েছেন বলে জানান কুলদীপ। পুরস্কারবিতরণী অনুষ্ঠানে তিনি বলেন, 'আমার ছন্দে ফিরে পেতে বিগত বছর দেড়েক ধরে প্রচুর খাটা খাটনি করেছি। ক্রিজেও আরও আক্রমণাত্মকভাবে ছুটে আসছি। নিজের বোলিং দেখে আমার নিজেরও বেশ ভাল লেগেছে। টি-টোয়েন্টিতে সঠিক লেংথে বল করাটা বেশি জরুরি। উইকেট নেওয়ার বিষয়ে তেমনটা ভাবনাচিন্তার সুযোগ থাকে না। সেই কারণেই সঠিক লেংথে বোলিং করার দিকে নজর দিয়েছি।' এরপরেই নিজের সাফল্যের জন্য তিনি ভারতীয় অধিনায়ক রোহিত শর্মাকেও কৃতিত্ব দেন। রোহিতকে বাহবা দিয়ে কুলদীপ বলেন, 'আমার সাফল্যের অনেকটা কৃতিত্বই রোহিত ভাইয়ের। ওঁ আমায় আমার বলের গতি নিয়ে খাটার পরামর্শ দিয়েছিল। আমাদের ফাস্ট বোলাররাও তো পাওয়ার প্লেতে নিয়মিত উইকেট নিচ্ছেন। তাই পরবর্তী সময়ে স্পিনারদের বোলিং করাটা অনেকটাই সহজ হয়ে যায়।' googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); অপরদিকে, গ্যালারিভর্তি দর্শকদের সামনে ম্যাচ হেরে অনুতপ্ত শ্রীলঙ্কান অধিনায়ক দাসুন শনাকা। সমর্থকদের কাছে ক্ষমাও চেয়ে নিলেন তিনি। ম্যাচের পুরস্কার বিতরণী অনুষ্ঠানে শ্রীলঙ্কার অধিনায়ক বলেছেন, 'আমি সমর্থকদের ধন্যবাদ জানাতে চাই। যাঁরা মাঠ ভরিয়েছিলেন। আমরা আপনাদের হতাশ করেছি। তার জন্য দুঃখিত। তবু এই নিঃশর্ত সমর্থনের জন্য কৃতজ্ঞ।' ভারতীয় দল কে খেতাব জয়ের জন্য কিন্তু অভিনন্দনও জানিয়েছেন শনাকা। আপনার পছন্দের খবর আর আপডেট এখন পাবেন আপনার পছন্দের চ্যাটিং প্ল্যাটফর্ম টেলিগ্রামেও। যুক্ত হোন https://t.me/abpanandaofficial আরও পড়ুন: এশিয়া কাপে চ্যাম্পিয়ন হয়ে কত টাকা পেল ভারত? শ্রীলঙ্কার ঝুলিতে গেল কত অর্থ? var _fireSc=!0;document.addEventListener(\"scroll\",(e=>{if(_fireSc){var c=document.createElement(\"script\");c.src=\"//asset.fwpub1.com/js/storyblock.js\",c.async=!0,document.getElementsByTagName(\"head\")[0].appendChild(c),_fireSc=!1}}));","pubDate":"2023-09-17 18:29:05","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/09/17/12f6f51b2e54b8465a1b49407e9b237b1694974938275507_original.jpg","source_id":"abplive","source_priority":10959,"country":["india"],"category":["sports"],"language":"bengali"},{"article_id":"fb28c1434b6d670f4533447a02c27472","title":"Jason Roy is DROPPED from England's World Cup squad after suffering back spasms as Harry Brook is included for tournament in India despite struggling in New Zealand series","link":"https://www.dailymail.co.uk/sport/cricket/article-12528421/Jason-Roy-DROPPED-Englands-World-Cup-squad-suffering-spasms-Harry-Brook-included-tournament-India-despite-struggling-New-Zealand-series.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"It was not just that England realised they would have to create space for the generational talent of Brook. More pertinent was the failure of Roy to play against New Zealand.","content":"Jason Roy is DROPPED from England's World Cup squad after suffering back spasms as Harry Brook is included for tournament in India despite struggling in New Zealand series Roy played no part in England's 3-1 series win over New Zealand with back issues Brook wasn't originally in the squad and failed to make much of an impact But the selectors decided Brook was a safer bet given Roy's injury problems By Paul Newman for the Daily Mail Published: 14:30, 17 September 2023 | Updated: 23:16, 17 September 2023 e-mail 85 shares 15 View comments Jason Roy's England career was ended on Sunday when he was replaced in the World Cup squad by Harry Brook. Roy was named last month in what national selector Luke Wright insisted was the squad for the one-day series against New Zealand and also the World Cup. Although Roy revealed in an interview with Mail Sport h e had been told he would definitely be travelling to India for next month’s tournament it quickly became clear England would be forced into a U-turn and instead their World Cup squad became ‘provisional’. It was not just that England realised they would have to create space for the generational talent of Brook — even though he had a quiet time in the 50-over series against New Zealand, making just 37 runs from 68 balls in three innings. More pertinent was the failure of Roy to play throughout England’s 3-1 victory because of a series of back spasms that ruled him out, in two cases, even after he had taken part in the warm-ups. Opening batter Jason Roy has been left out of England's squad for next month's ODI World Cup in India The versatile Harry Brook has been called up in his place having controversially been left out the original 15 Roy has missed a run of games for his country after struggling with injury and his international future is now unclear Even as late as Friday when England completed their series victory thanks to a century from the man who took Roy’s opening place in Dawid Malan, captain Jos Buttler was talking about adding Roy to the second-string squad to play Ireland this week in the hope he could prove his form and fitness. But now Buttler has been forced to concede defeat in his backing of one of the most influential figures in England’s white-ball domination and has surely called time on his 50-over career following an equally difficult call in leaving him out of the squad that won the Twenty20 World Cup last year. ‘We have selected a squad we are confident can go to India and win the World Cup,’ said Wright. ‘We are blessed with an incredibly strong group of white-ball players which was underlined by the strong performances in the win against a very strong New Zealand. ‘The strength of the squad has meant we have had to make some tough decisions on world-class players with Jason Roy missing out and Harry Brook coming into the squad.’ Dawid Malan is England's form player entering the tournament and he made a century in the final ODI with New Zealand at Lord's on Friday England World Cup squad Jos Buttler (Lancashire – captain); Moeen Ali (Warwickshire); Gus Atkinson (Surrey); Jonny Bairstow (Yorkshire); Harry Brook (Yorkshire); Sam Curran (Surrey); Liam Livingstone (Lancashire); Dawid Malan (Yorkshire); Adil Rashid (Yorkshire); Joe Root (Yorkshire); Ben Stokes (Durham); Reece Topley (Surrey); David Willey (Northamptonshire); Mark Wood (Durham); Chris Woakes (Warwickshire) <!- - ad: https://mads.dailymail.co.uk/v8/gb/sport/cricket/article/other/mpu_factbox.html?id=mpu_factbox_1 - -> Advertisement Now Malan — who made himself undroppable in making 277 runs at 92.33 in three games against New Zealand, including that match-winning century at Lord’s — will step out alongside Jonny Bairstow to open at the start of England’s World Cup defence in Ahmedabad against New Zealand on October 5. Brook surely should have been included in the first place after announcing himself in spectacular fashion over the last 18 months, most notably in Test cricket where he has made 1,181 runs at 62.15 and a strike-rate of 91. Roy, meanwhile, has reached the end of the international road. He suffered from injury during the last two tournaments he played in and caused controversy in May when he asked to be released from his incremental contract to play in the inaugural Major League Cricket event in the US. He became a victim of the standards he helped set in his 116 ODIs, including what was England’s highest 50-over score of 180 until Ben Stokes broke it at the Oval last week. Roy was part of England's squad that won the tournament in 2019 and claimed he was told he would be in the travelling party Now, at 33, his future is at Surrey and, more regularly, as a leading figure in the franchise world. Brook, 24, was originally not in the World Cup squad named last month but was added to the squad for the New Zealand series and despite failing to impress with just 37 runs in three innings, England have decided to opt for the Yorkshireman rather than opener Roy after Dawid Malan all but certainly secured his spot at the top of the order with 277 runs across three innings against the Black Caps. Roy, who was an integral part of England's World Cup winning campaign in 2019, is now set to miss a second successive World Cup after he was also not picked for the T20 World Cup squad last winter. England begin their World Cup defence in Ahmedabad against New Zealand on October 5. Share or comment on this article: Jason Roy is DROPPED from England's World Cup squad after suffering back spasms as Harry Brook is included for tournament in India despite struggling in New Zealand series e-mail 85 shares Add comment Comments 15 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-09-17 22:16:52","image_url":"https://i.dailymail.co.uk/1s/2023/09/17/14/75528027-0-image-a-36_1694957419289.jpg","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"24a72e1f133cc25d201261fd845884a7","title":"Iconic Cricket Ground’s Potential £23m Sale to Safeguard Struggling Club’s Future","link":"https://insidexpress.com/sports-athletics/iconic-cricket-grounds-potential-23m-sale-to-safeguard-struggling-clubs-future/?utm_source=rss&utm_medium=rss&utm_campaign=iconic-cricket-grounds-potential-23m-sale-to-safeguard-struggling-clubs-future","keywords":["Sports & Athletics","23M","clubs","Cricket","future","Grounds","Iconic","Potential","Safeguard","Sale","struggling"],"creator":["The Insidexpress"],"video_url":null,"description":"YORKSHIRE are reportedly considering selling Headingley Cricket Ground in an attempt to guarantee the club’s survival. The county cricket club bought the ground in 2005 from Leeds Cricket, Football and…","content":"YORKSHIRE are reportedly considering selling Headingley Cricket Ground in an attempt to guarantee the club’s survival. The county cricket club bought the ground in 2005 from Leeds Cricket, Football and Athletic Company for a fee believed to be £12million. Yorkshire are reportedly considering selling Headingley Credit: Getty It is the ground that saw Ben Stokes’ heroics in 2019 Credit: Getty Chris Woakes (R) and Mark Wood (L) combined to beat Australia earlier this summer in the Ashes Credit: Getty The Daily Mail have now reported that the club are looking for £23m to sell the ground. The touted figure would represent a decent return for the club that has come under financial pressure. Yorkshire has been dealing with financial issues since the loss of sponsors and costs from the Azeem Rafiq racism scandal of around £3.5m. The report claims that Yorkshire are looking for £20m in new investment but have had no luck despite interest from former Newcastle United owner Mike Ashley, a Saudi prince and some IPL franchises. It is also suggested that Yorkshire are considering selling the ground and leasing it back in a similar model that has been utilised by football clubs. It is also thought that there have been several bids “rejected” to buy the club outright. This is because members still want control of the club. A sale of the ground would provide the necessary funds to pay a £15.9m bill that is owed to the family of former chairman Colin Graves. The remainder of the money left over from the sale could also pay running costs for several years. Headingley has played host to some special cricketing moments in recent years. It was the ground where Ben Stokes performed his heroics during the Ashes series in 2019. And again earlier this year, it was the ground that Mark Wood and Chris Woakes steered England to victory over the Aussies in the Ashes. The ground has been valued at £23million by a global real estate company Credit: Getty The money made from the Ashes Test earlier this summer was enough to get Yorkshire through the season. Yorkshire chief executive Stephen Vaughan told the Daily Mail: “We cannot comment on commercially sensitive information. “We are making strong progress on securing the long-term future of Yorkshire County Cricket Club and look forward to announcing positive developments shortly.” Publisher","pubDate":"2023-09-17 21:23:11","image_url":null,"source_id":"insidexpress","source_priority":2653465,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"ad5b2da5a022b767046df3a32e98f9d5","title":"Fiji blows away Wallabies in crucial match","link":"https://www.fbcnews.com.fj/sports/rwc-2023/fiji-blows-away-wallabies-in-crucial-match/","keywords":["RWC 2023"],"creator":["Fredrica Nagan"],"video_url":null,"description":"The Fiji Water Flying Fijians have created history after beating two time champions Australia 22-15 for the first time at a Rugby World Cup. It’s been 69 years since Fiji last beat the Wallabies in a Test following their 18-16 win at the Sydney Cricket Ground in 1954. Fiji played with heart throughout the 80 […]","content":"The Fiji Water Flying Fijians have created history after beating two time champions Australia 22-15 for the first time at a Rugby World Cup. It’s been 69 years since Fiji last beat the Wallabies in a Test following their 18-16 win at the Sydney Cricket Ground in 1954. Fiji played with heart throughout the 80 minutes and one can tell they were still hurting from the result last week against Wales and wanted to stay in the competition. An emotional head coach Simon Raiwalui says he couldn’t be more proud of the way his men played today. Two successive penalties against the national side saw Ben Donaldson converting one for a three-point lead. The national side regrouped and started pressuring the Aussies with some variations in their play. Josua Tuisova, Levani Botia, Viliame Mata and Lekima Tagitagivalu made some early strong carries that rattled Australia before Simione Kuruvoli slotted a penalty an offside penalty to lock the scores at 3-all after 11 minutes. Player of the Match Josua ‘The Bus’ Tuisova says it has been a long time coming. Australia openside flanker Fraser McReight was penalized at a breakdown six minutes later with Kuruvoli adding another three points. However, a 50-20 kick by halfback Nic White saw Mark Nawaqanitawase ran in to score after a confused Radradra thought it was Fiji’s throw in the lineout. Nawaqanitawase took a quick throw in to Kerevi before he was tackled by Nayacalevu close to the tryline but he was able to release the ball to his winger to score. Kuruvoli put Fiji back in front with his third penalty after the referee penalized White for a high tackle on our halfback before adding another for the Waisea Nayacalevu-captained side to lead 12-8 at halftime. Captain Waisea Nayacalevu says this win is special. Despite two lineouts inside their red zone, Australia still contested Fiji’s throws and were successful on two occasions before the break. Winger Jiuta Wainiqolo was injured after his first carry in the second spell and he was replaced by Vinaya Habosi. A box kick by Kuruvoli was uncontested by the Australians who let the ball bounce but it went straight into the hands of Tuisova who ran away to score. Kuruvoli added the extra two points for a personal tally of 14 points in the match before he was replaced by Frank Lomani. Australia’s coach Eddie Jones brought in Suliasi Vunivalu and moved Nawaqanitawase to fullback with Donaldson shifting to flyhalf. Jones’s counterpart Simon Raiwalui changed his front-row after 10 minutes with Peni Ravai, Tevita Ikanivere and Mesake Doge coming in. The Flying Fijians forwards never stepped back from the get go and were clinical in the contact zone with Botia winning the battle at the breakdown at crucial times. Tuisova was at his usual best and the Aussies had to work overtime when he gets the ball. Fiji’s demolition man, Botia, had to leave the field due to injury while Doge had an head injury assessment. Albert Tuisue was introduced as substitute for Botia while Tagi returned for Doge. Our side kept the scoreboard pressure after Lomani nailed a penalty 15 minutes from full-time but Australia closed the gap with Vunivalu crashing over from five meters out.","pubDate":"2023-09-17 20:38:14","image_url":"https://www.fbcnews.com.fj/wp-content/uploads/2023/09/SIMON-R.mp3","source_id":"fbcnews","source_priority":229234,"country":["fiji"],"category":["sports"],"language":"english"},{"article_id":"9e530ff67b47ea284a602f40a787afd8","title":"La Deporteca estrena nueva temporada","link":"https://www.marca.com/radio/2023/09/17/65031fb422601d65068b45e1.html","keywords":["Radio Marca","cultura","Otros Deportes"],"creator":["Natalia Freire"],"video_url":null,"description":null,"content":"omenzamos una nueva temporada de esta aventura llamada , que nació allá por septiembre de 2004, en la que se conjuga la cultura y el deporte. Después de diecinueve años seguimos demostrando que el deporte es cultura y que existe una cultura del deporte. En este primer programa presentamos a tres colaboradores de lujo que nos acompañarán esta temporada. , en su sección, , nos contará curiosidades y anécdotas de la música y los músicos relacionados con los deportes. , director de cine, realizador, guionista y profesor de actores, nos hablará en la sección, , de la conexión del deporte con el cine. , escritor y profesor, en su sección, , nos descubrirá a excéntricos y curiosos personajes relacionados con el deporte que inspiran relatos literarios. Además de todo esto, continuaremos con las entrevistas a músicos, autores y todo tipo de artistas que hayan encontrado una conexión entre el deporte y la cultura. Julio Ruiz estuvo durante cincuenta años al frente del programa en RNE. Tras su jubilación se embarcó en nuevas aventuras como el podcast que publica cada semana en y en la sección en donde cada semana nos cuenta curiosidades y anécdotas recogidas durante su larga carrera como periodista musical en la que ha tenido oportunidad de conocer de cerca a muchos músicos que encontraron inspiración en el deporte y publicaron trabajos relacionados con deportes o deportistas o bien se mostraron como aficionados o practicantes de algún deporte. Aprovechando la presentación de la nueva temporada Julio Ruiz nos brindó un aperitivo de lo que será su sección: en una charla reciente con de hablando sobre su proyecto en solitario, , el artista confirmó que su hijo estaba jugando al fútbol en un equipo de Granada y que apuntaba maneras. Con hablamos hace unos meses, en la víspera del inicio del Giro de Italia cuando recién acababa el rodaje de su última película, , que está en fase de montaje. Comenzó su trayecto cinematográfico en la Facultad de Bellas Artes de Cuenca, donde estudió y trabajó en varios proyectos conjuntos. Después realizó cursos de guion cinematográfico en Madrid y de dirección en UQAM (Université du Québec à Montréal) en Canadá, así como un master en 'Experto en dirección cinematográfica' en la Universidad Camilo José Cela. Ha filmado varios cortometrajes como ' ' o ' ' y los largometrajes ' ', y ' ', ' ' y la antes citada, ' ' en la que el periodista . Además, es en es un centro especializado en la formación y entrenamiento de actores y actrices para cine y televisión y para la formación integral del actor. En el ámbito literario tiene publicadas tres novelas: ' , (Premio nacional de novela histórica) y ' \". En el mundo del cómic he escrito la serie ' ', publicada en varios países y traducida a seis idiomas y, precisamente de este cómic nos habló en su debut como colaborador en La Deporteca. \"Fue de la mano del dibujante, , que es un dibujante consolidado dentro del mercado franco/belga, que es quizá en Europa el mercado más importante que hay en cómics. Nos conocimos, le conté la historia y él se la contó a los editores franceses a los que les pareció maravilloso porque es historia y deporte y a los franceses les apasionan esas dos cosas, el cómic y los deportes, así que nos lanzamos, la escribimos y ha sido un éxito\". En este cómic aparece un personaje del que nos habló Juanra Fernández: , un auriga que está considerado el deportista que más dinero ha ganado en la historia, por encima incluso de nombres como . Precisamente el personaje de aparece en el último libro del profesor y escritor . Ya son unas cuantas temporadas las que llevamos contando con la colaboración de este contador de historias divertidas y curiosas que pasan normalmente desapercibidas. Desde , apodado , que fingió ser futbolista durante muchos años pero que siempre se las arreglaba para no jugar ningún partido y que todo el mundo comprobara que no sabía jugar, hasta , conocido como y el personaje que interpretó en la película y que era amigo del Premio Nobel de Literatura, con el que compartía largas charlas sobre cricket. Cada semana en , y siempre que quieras en el podcast, tienes una cita con la cultura y el deporte.","pubDate":"2023-09-17 19:52:40","image_url":"https://phantom-marca.unidadeditorial.es/ced7ee89e37e8d3539634c449a1b7a5c/resize/600/assets/multimedia/imagenes/2023/09/14/16947145711659.jpg","source_id":"marca","source_priority":426,"country":["colombia"],"category":["sports"],"language":"spanish"},{"article_id":"15c99102a783b1e960bb3b4d60e96c7b","title":"“Not hot favourites”: Former cricketer Atul Wassan on India’s World Cup chances","link":"https://thenewsmill.com/2023/09/not-hot-favourites-former-cricketer-atul-wassan-on-indias-world-cup-chances/","keywords":["Cricket","Sports","ANI"],"creator":["ANI"],"video_url":null,"description":"The News Mill","content":"While India reigned supreme at the Premadasa on Sunday, humbling defending champions Sri Lanka by 10 wickets to lift their 8th Asia Cup, former international cricketer Atul Wassan said the ‘Men in Blue’ were not the “hot favourites” going into the ODI World Cup next month. The 50-over showpiece, to be hosted in India this year, will get underway in less than a couple of weeks from now. Weighing in on India’s chances to claim their third world crown after 2013 when a certain MS Dhoni led his boys to glory, Wassan said he believed that much of the team’s prospects in the tournament would depend on the nature of the surfaces they play on and whether they build on their success in the Asia Cup. “We are ready for the World Cup. The Indian fans believe that they are the hot favourites to lift the trophy this year. However, if our team goes into the tournament as the favourite and suffers an early exit, the fans will be left heartbroken as they have been over the last 13 years. Hence, I believe it is best to temper our expectations while being cautiously optimistic about our chances. I think we are not the hot favourites. Much of our chances in the tournament would depend on how we go from here (Asia Cup success) and the kind of pitches we play on,” the former India speedster told ANI. He added that he was in agreement with head coach Rahul Dravid’s tactic of employing new ball bowlers, who are best suited to red-ball or Test format, in 50-over cricket as they would extract more movement and swing from the red cherry in the early overs. “I would personally endorse Rahul Dravid’s thinking that bowlers, mostly suited to the Test format, will also do well in ODIs as the new ball swings and seams in the early overs and a team needs to go in with attacking bowlers who can get early breakthroughs. You can’t have attacking bowlers in ODIs operating on defensive lines and lengths and trying to save runs. It’s wickets that win you matches,” the former India opening bowler added. Hailing Team India’s dominating win in the Asia Cup final on Sunday, Wassan said the team does look settled ahead of the showpiece event, with key players back from injuries and on song. “Delighted as I am at India winning the Asia Cup after 5 years, I believe that this victory is only the beginning. It’s the beginning of a process that can take us to more glories down the road. Everyone is looking forward to India going well in the World Cup and our team does look balanced and settled,” Wassan signed off saying. (ANI)","pubDate":"2023-09-17 19:30:11","image_url":null,"source_id":"thenewsmill","source_priority":3781717,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"7ac65ccc4e854a140d4ef73effecefdd","title":"Sports Highlights: অষ্টমবার এশিয়াসেরা ভারত, কিশোর ভারতীতে লা লিগার অ্যাকাডেমি, এক নজরে খেলার সব খবর","link":"https://bengali.abplive.com/sports/sports-highlights-know-latest-updates-of-teams-players-matches-and-other-highlights-17th-september-1009884","keywords":["খেলা"],"creator":["ABP Ananda"],"video_url":null,"description":"কলকাতা: এশিয়া কাপের ফাইনালে শ্রীলঙ্কাকে ১০ উইকেটে দুরমুশ করে রেকর্ড অষ্টমবার এশিয়াসেরা হল ভারত। কিশোর ভারতীতেই হবে লা লিগার স্টেডিয়াম, বার্সেলোনা থেকে ঘোষণা বাংলার মুখ্যমন্ত্রীর। এক নজরে খেলার সারাদিনের সেরা খবরগুলি। এশিয়াসেরা ভারত শ্রীলঙ্কাকে (Sri Lanka Cricket Team) হারিয়ে অষ্টমবার এশিয়া কাপ (Asia Cup 2023) খেতাব জয়ের জন্য ভারতের (Indian Cricket Team) সামনে লক্ষ্য ছিল মাত্র ৫১ রান। এই রান তুলতে বেশি ঘাম ঝড়ানোর প্রয়োজন ছিল না। বেশি খাটা খাটনি করতে হল না। মাত্র ৬.১ ওভারেই ১০ উইকেটে ম্যাচ জিতে নিল ভারতীয় দল। শুভমন গিল ২৭ রান ও ঈশান কিষাণ ২৩ রানে অপরাজিত থাকেন। এদিন বল হাতে টসে হেরে প্রথমে বোলিং করতে হয় ভারতকে। বল হাতে মহম্মদ সিরাজ়ের বিধ্বংসী বোলিংয়ে কোনওক্রমে ৫০ পূর্ণ করে দ্বীপরাষ্ট্র। ছয় উইকেট নেন সিরাজ়। কিশোর ভারতীতে লা লিগা অ্যাকাডেমি মূলত বাংলায় লগ্নি টানতেই ১১ দিনের স্পেন সফরে গিয়েছেন মুখ্যমন্ত্রী মমতা বন্দোপাধ্যায় (Mamata Banerjee)। তবে শিল্পের পাশাপাশি খেলাধুলো বিশেষত ফুটবলের উন্নতি সাধনেও তৎপর মুখ্যমন্ত্রী। সেই মর্মে ইতিমধ্যেই লা লিগা কর্তৃপক্ষের সঙ্গে চুক্তি স্বাক্ষরও করেছেন তিনি। সেই চুক্তি অনুযায়ী বাংলায় অ্যাকাডেমি গড়বে লা লিগা (La Liga) কর্তৃপক্ষ। তবে ঠিক কোথায় সেই অ্যাকাডেমি গড়া হবে, তা জানানো হয়নি। আজ লা লিগার অ্যাকাডেমি গড়ার জন্য স্থান ঘোষণা করে দিলেন মমতা।  মাদ্রিদ সফর শেষে আজ আরেক প্রসিদ্ধ ফুটবল শহর বার্সেলোনায় গিয়েছেন মুখ্যমন্ত্রী। সেখানেই সকলের উদ্দেশে তিনি জানান যে লা লিগার অ্যাকাডেমি গড়ার জন্য কিশোর ভারতী স্টেডিয়ামই (Kishore Bharati Stadium) কর্তৃপক্ষের হাতে তুলে দিতে চলেছেন তিনি। মমতা বলেন, 'বিশ্বের সেরা সংগঠন এবং জনপ্রিয়তম লিগ লা লিগার সঙ্গে দিনকয়েক আগেই আমরা চুক্তি স্বাক্ষর করেছি। ওদের পেশাদারিত্ব নিয়ে কোনও প্রশ্ন থাকতে পারে না। লা লিগা কর্তৃপক্ষ বাংলায় অ্যাকাডেমি গড়তে আগ্রহ দেখিয়েছিলেন। দুই দিন আগেই এই বিষয়ে আমাদের মধ্যে কথা হয়েছিল। ওরা জমি পেলেই কলকাতায় অ্যাকাডেমি গড়ার কাজ শুরু করে দেবে বলেই জানিয়েছিল। আজ আমি এখান থেকেই ঘোষণা করছি, যে ওদের অ্যাকাডেমি গড়ার জন্য সমস্ত সুযোগ সুবিধাসহ বাংলার একটা গোটা স্টেডিয়াম দেব আমরা। আমার বন্ধুদের কাছে এই বার্তা পৌঁছে দিন। যত শীঘ্র সম্ভব কলকাতায় এসে অ্যাকাডেমি গড়ার কাজ শুরু করে দিন। কিশোর ভারতী স্টেডিয়ামটা আমি এর জন্য দিয়ে দিচ্ছি।' মন জিতলেন সিরাজ় স্বপ্নের বোলিং স্পেলে এশিয়া কাপ ফাইনালে (Asia Cup 2023 Final) শ্রীলঙ্কাকে ধরাশায়ী করেছেন মহম্মদ সিরাজ় (Mohammed Siraj)। ২১ রানের বিনিময়ে ছয় উইকেট নিয়ে গড়েছেন একগুচ্ছ রেকর্ডও। তার দুরন্ত বোলিংয়ে ভর করেই মাত্র ৫০ রানে শ্রীলঙ্কাকে অল আউট করে দেয় ভারতীয় দল। ১০ জিতে নেয় ফাইনাল। স্বাভাবিকভাবেই তাঁকে ম্যাচের সেরা ঘোষণা করা হয়। এরপরেই পুরস্কার বিতরণী অনুষ্ঠানে সিরাজের মানবিক মুখ ধরা পড়ল। ম্যাচ সেরা হওয়ার পর তিনি নিজের পুরস্কারমূল্যর পুরোটাই মাঠকর্মীদের উদ্দেশে দান করেন। তিনি বলেন, 'এই পুরস্কারমূল্যের পুরোটাই মাঠকর্মীদের জন্য। ওদের ছাড়া তো এই টুর্নামেন্টটা আয়োজন করা সম্ভবই হবে না।' নিজের বোলিং স্পেল নিয়ে প্রশ্ন করা হলে সিরাজ় অকপটে মেনে নেন যে এটাই তাঁর কেরিয়ারের সেরা বোলিং স্পেন। 'অনেকদিন ধরেই ভাল বোলিং করছি আমি। তবে আজকে সব বল ঠিকানায় পড়েছে। এই পিচে তো বল সিম করেই তো আজ বল সুইংও করেছিল। সেই কারণেই ফুল লেংথে বল করছিলাম। দলের সকল ফাস্ট বোলারের মধ্যেই কিন্তু সম্পর্ক খুব ভাল। দলের জন্য এটা খুবই ভাল বিষয়' বলেন ভারতের তারকা ফাস্ট বোলার। ডায়মন্ড লিগে দ্বিতীয় নীরজ   কিছুদিন আগেই অ্য়াথলেটিক্সের বিশ্ব চ্যাম্পিয়নশিপে সোনা জিতেছিলেন। এর আগে অলিম্পিক্সেও সোনা জিতেছেন। স্বপ্নের ফর্মে থাকলেও ডায়মন্ড লিগ ফাইনালে অল্পের জন্য সোনা খোয়াতে হল নীরজ চোপড়াকে। ১৬ সেপ্টেম্বর ফাইনালে ৮৩.৮০ মিটার থ্রো করে দ্বিতীয় স্থান অর্জন করেন পানিপথের তরুণ। ডায়মন্ড লিগের ফাইনাল জিতেছেন চেক প্রজাতন্ত্রের জাকুব ভ্যাডলেচ। যিনি তার প্রথম প্রচেষ্টায় ৮৪.২৪ মিটার থ্রো করেছিলেন। এদিন প্রথম থ্রো-টি ফাউল হয়ে যায় নীরজের। যদিও দ্বিতীয়বারের প্রচেষ্টাতেই ৮৩.৮০ মিটার দূরত্ব অতিক্রম করেন নীরজ। এর আগে ডায়মন্ড লিগ জিতেছিলেন নীরজ। কিন্তু এবার আর পারলেন না। চেক প্রজাতন্ত্রের ভিটেজস্লাভ ভেসেলি ২০১২ এবং ২০১৪ সালে খেতাব জিতেছিলেন। এছাড়া জাকুব ভ্যাডলেচ ২০১৬ এবং ২০১৭ সালে এই কৃতিত্ব অর্জন করেছিলেন। নীরজ এবার খেতাব জিতলে তিনি বিশ্বের তৃতীয় ও ভারতের প্রথম প্লেয়ার হিসেবে এই নজির গড়তেন। নীরজের নজরে এ বার এশিয়ান গেমস। জাকার্তা এশিয়ান গেমসে সোনার পদক জিতেছিলেন। হাংঝৌতে তাঁর কাছ থেকে সোনার প্রত্যাশায় ভারতীয় ক্রীড়াপ্রেমীরা। দিল্লির হেডকোচ বাংলার প্রাক্তনী তিনি বাংলার হয়ে ঘরোয়া ক্রিকেট খেলেছেন। বাংলা দলকে (Bengal Cricket Team) নেতৃত্বও দিয়েছিলেন। বাংলার জার্সিতে যে দুজন ক্রিকেটারের প্রথম শ্রেণির ক্রিকেটে ট্রিপল সেঞ্চুরি রয়েছে, তাঁদের মধ্যে অন্যতম তিনি। সেই দেবাঙ্গ গাঁধীকে (Devang Gandhi) হেড কোচ হিসাবে নিয়োগ করল দিল্লি ও জেলা ক্রিকেট সংস্থা। শনিবার সংস্থার তরফে ঘোষণা করা হল, আগামী মরশুমে দিল্লির প্রধান কোচ হিসাবে দায়িত্ব সামলাবেন দেবাঙ্গ। ঘরোয়া ক্রিকেটে দিল্লির সাম্প্রতির ফর্ম ভাল নয়। ব্যর্থতার সেই ছবিটা কাটাতে তৎপর দিল্লি ও জেলা ক্রিকেট সংস্থা। সেই জন্য কোচ হিসাবে নতুন মুখকে দায়িত্বে আনা হল। আপনার পছন্দের খবর আর আপডেট এখন পাবেন আপনার পছন্দের চ্যাটিং প্ল্যাটফর্ম টেলিগ্রামেও। যুক্ত হোন https://t.me/abpanandaofficial আরও পড়ুন: এশিয়া কাপে টুর্নামেন্টসেরা হয়ে রোহিতকে কৃতজ্ঞতা জানালেন কুলদীপ","content":"কলকাতা: এশিয়া কাপের ফাইনালে শ্রীলঙ্কাকে ১০ উইকেটে দুরমুশ করে রেকর্ড অষ্টমবার এশিয়াসেরা হল ভারত। কিশোর ভারতীতেই হবে লা লিগার স্টেডিয়াম, বার্সেলোনা থেকে ঘোষণা বাংলার মুখ্যমন্ত্রীর। এক নজরে খেলার সারাদিনের সেরা খবরগুলি। এশিয়াসেরা ভারত শ্রীলঙ্কাকে (Sri Lanka Cricket Team) হারিয়ে অষ্টমবার এশিয়া কাপ (Asia Cup 2023) খেতাব জয়ের জন্য ভারতের (Indian Cricket Team) সামনে লক্ষ্য ছিল মাত্র ৫১ রান। এই রান তুলতে বেশি ঘাম ঝড়ানোর প্রয়োজন ছিল না। বেশি খাটা খাটনি করতে হল না। মাত্র ৬.১ ওভারেই ১০ উইকেটে ম্যাচ জিতে নিল ভারতীয় দল । শুভমন গিল ২৭ রান ও ঈশান কিষাণ ২৩ রানে অপরাজিত থাকেন। এদিন বল হাতে টসে হেরে প্রথমে বোলিং করতে হয় ভারতকে। বল হাতে মহম্মদ সিরাজ়ের বিধ্বংসী বোলিংয়ে কোনওক্রমে ৫০ পূর্ণ করে দ্বীপরাষ্ট্র। ছয় উইকেট নেন সিরাজ়। কিশোর ভারতীতে লা লিগা অ্যাকাডেমি googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); মূলত বাংলায় লগ্নি টানতেই ১১ দিনের স্পেন সফরে গিয়েছেন মুখ্যমন্ত্রী মমতা বন্দোপাধ্যায় (Mamata Banerjee)। তবে শিল্পের পাশাপাশি খেলাধুলো বিশেষত ফুটবলের উন্নতি সাধনেও তৎপর মুখ্যমন্ত্রী। সেই মর্মে ইতিমধ্যেই লা লিগা কর্তৃপক্ষের সঙ্গে চুক্তি স্বাক্ষরও করেছেন তিনি। সেই চুক্তি অনুযায়ী বাংলায় অ্যাকাডেমি গড়বে লা লিগা (La Liga) কর্তৃপক্ষ। তবে ঠিক কোথায় সেই অ্যাকাডেমি গড়া হবে, তা জানানো হয়নি। আজ লা লিগার অ্যাকাডেমি গড়ার জন্য স্থান ঘোষণা করে দিলেন মমতা। মাদ্রিদ সফর শেষে আজ আরেক প্রসিদ্ধ ফুটবল শহর বার্সেলোনায় গিয়েছেন মুখ্যমন্ত্রী। সেখানেই সকলের উদ্দেশে তিনি জানান যে লা লিগার অ্যাকাডেমি গড়ার জন্য কিশোর ভারতী স্টেডিয়ামই (Kishore Bharati Stadium) কর্তৃপক্ষের হাতে তুলে দিতে চলেছেন তিনি। মমতা বলেন, 'বিশ্বের সেরা সংগঠন এবং জনপ্রিয়তম লিগ লা লিগার সঙ্গে দিনকয়েক আগেই আমরা চুক্তি স্বাক্ষর করেছি। ওদের পেশাদারিত্ব নিয়ে কোনও প্রশ্ন থাকতে পারে না। লা লিগা কর্তৃপক্ষ বাংলায় অ্যাকাডেমি গড়তে আগ্রহ দেখিয়েছিলেন। দুই দিন আগেই এই বিষয়ে আমাদের মধ্যে কথা হয়েছিল। ওরা জমি পেলেই কলকাতায় অ্যাকাডেমি গড়ার কাজ শুরু করে দেবে বলেই জানিয়েছিল। আজ আমি এখান থেকেই ঘোষণা করছি, যে ওদের অ্যাকাডেমি গড়ার জন্য সমস্ত সুযোগ সুবিধাসহ বাংলার একটা গোটা স্টেডিয়াম দেব আমরা। আমার বন্ধুদের কাছে এই বার্তা পৌঁছে দিন। যত শীঘ্র সম্ভব কলকাতায় এসে অ্যাকাডেমি গড়ার কাজ শুরু করে দিন। কিশোর ভারতী স্টেডিয়ামটা আমি এর জন্য দিয়ে দিচ্ছি।' মন জিতলেন সিরাজ় স্বপ্নের বোলিং স্পেলে এশিয়া কাপ ফাইনালে (Asia Cup 2023 Final) শ্রীলঙ্কাকে ধরাশায়ী করেছেন মহম্মদ সিরাজ় (Mohammed Siraj)। ২১ রানের বিনিময়ে ছয় উইকেট নিয়ে গড়েছেন একগুচ্ছ রেকর্ডও। তার দুরন্ত বোলিংয়ে ভর করেই মাত্র ৫০ রানে শ্রীলঙ্কাকে অল আউট করে দেয় ভারতীয় দল । ১০ জিতে নেয় ফাইনাল। স্বাভাবিকভাবেই তাঁকে ম্যাচের সেরা ঘোষণা করা হয়। এরপরেই পুরস্কার বিতরণী অনুষ্ঠানে সিরাজের মানবিক মুখ ধরা পড়ল। ম্যাচ সেরা হওয়ার পর তিনি নিজের পুরস্কারমূল্যর পুরোটাই মাঠকর্মীদের উদ্দেশে দান করেন। তিনি বলেন, 'এই পুরস্কারমূল্যের পুরোটাই মাঠকর্মীদের জন্য। ওদের ছাড়া তো এই টুর্নামেন্টটা আয়োজন করা সম্ভবই হবে না।' নিজের বোলিং স্পেল নিয়ে প্রশ্ন করা হলে সিরাজ় অকপটে মেনে নেন যে এটাই তাঁর কেরিয়ারের সেরা বোলিং স্পেন। 'অনেকদিন ধরেই ভাল বোলিং করছি আমি। তবে আজকে সব বল ঠিকানায় পড়েছে। এই পিচে তো বল সিম করেই তো আজ বল সুইংও করেছিল। সেই কারণেই ফুল লেংথে বল করছিলাম। দলের সকল ফাস্ট বোলারের মধ্যেই কিন্তু সম্পর্ক খুব ভাল। দলের জন্য এটা খুবই ভাল বিষয়' বলেন ভারতের তারকা ফাস্ট বোলার। ডায়মন্ড লিগে দ্বিতীয় নীরজ কিছুদিন আগেই অ্য়াথলেটিক্সের বিশ্ব চ্যাম্পিয়নশিপে সোনা জিতেছিলেন। এর আগে অলিম্পিক্সেও সোনা জিতেছেন। স্বপ্নের ফর্মে থাকলেও ডায়মন্ড লিগ ফাইনালে অল্পের জন্য সোনা খোয়াতে হল নীরজ চোপড়াকে। ১৬ সেপ্টেম্বর ফাইনালে ৮৩.৮০ মিটার থ্রো করে দ্বিতীয় স্থান অর্জন করেন পানিপথের তরুণ। ডায়মন্ড লিগের ফাইনাল জিতেছেন চেক প্রজাতন্ত্রের জাকুব ভ্যাডলেচ। যিনি তার প্রথম প্রচেষ্টায় ৮৪.২৪ মিটার থ্রো করেছিলেন। এদিন প্রথম থ্রো-টি ফাউল হয়ে যায় নীরজের। যদিও দ্বিতীয়বারের প্রচেষ্টাতেই ৮৩.৮০ মিটার দূরত্ব অতিক্রম করেন নীরজ। এর আগে ডায়মন্ড লিগ জিতেছিলেন নীরজ। কিন্তু এবার আর পারলেন না। চেক প্রজাতন্ত্রের ভিটেজস্লাভ ভেসেলি ২০১২ এবং ২০১৪ সালে খেতাব জিতেছিলেন। এছাড়া জাকুব ভ্যাডলেচ ২০১৬ এবং ২০১৭ সালে এই কৃতিত্ব অর্জন করেছিলেন। নীরজ এবার খেতাব জিতলে তিনি বিশ্বের তৃতীয় ও ভারতের প্রথম প্লেয়ার হিসেবে এই নজির গড়তেন। নীরজের নজরে এ বার এশিয়ান গেমস। জাকার্তা এশিয়ান গেমস ে সোনার পদক জিতেছিলেন। হাংঝৌতে তাঁর কাছ থেকে সোনার প্রত্যাশায় ভারতীয় ক্রীড়াপ্রেমীরা। দিল্লির হেডকোচ বাংলার প্রাক্তনী তিনি বাংলার হয়ে ঘরোয়া ক্রিকেট খেলেছেন। বাংলা দলকে (Bengal Cricket Team) নেতৃত্বও দিয়েছিলেন। বাংলার জার্সিতে যে দুজন ক্রিকেটারের প্রথম শ্রেণির ক্রিকেটে ট্রিপল সেঞ্চুরি রয়েছে, তাঁদের মধ্যে অন্যতম তিনি। সেই দেবাঙ্গ গাঁধীকে (Devang Gandhi) হেড কোচ হিসাবে নিয়োগ করল দিল্লি ও জেলা ক্রিকেট সংস্থা। শনিবার সংস্থার তরফে ঘোষণা করা হল, আগামী মরশুমে দিল্লির প্রধান কোচ হিসাবে দায়িত্ব সামলাবেন দেবাঙ্গ। ঘরোয়া ক্রিকেটে দিল্লির সাম্প্রতির ফর্ম ভাল নয়। ব্যর্থতার সেই ছবিটা কাটাতে তৎপর দিল্লি ও জেলা ক্রিকেট সংস্থা। সেই জন্য কোচ হিসাবে নতুন মুখকে দায়িত্বে আনা হল। আপনার পছন্দের খবর আর আপডেট এখন পাবেন আপনার পছন্দের চ্যাটিং প্ল্যাটফর্ম টেলিগ্রামেও। যুক্ত হোন https://t.me/abpanandaofficial আরও পড়ুন: এশিয়া কাপে টুর্নামেন্টসেরা হয়ে রোহিতকে কৃতজ্ঞতা জানালেন কুলদীপ var _fireSc=!0;document.addEventListener(\"scroll\",(e=>{if(_fireSc){var c=document.createElement(\"script\");c.src=\"//asset.fwpub1.com/js/storyblock.js\",c.async=!0,document.getElementsByTagName(\"head\")[0].appendChild(c),_fireSc=!1}}));","pubDate":"2023-09-17 19:15:51","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/09/18/321833c814aa0bd262a351e8f22f92c61694977639436507_original.jpg","source_id":"abplive","source_priority":10959,"country":["india"],"category":["sports"],"language":"bengali"},{"article_id":"afbc7f672fbc94ba39a6625533a4b219","title":"Asia Cup 2023: 'এই পারফরম্যান্স দীর্ঘদিন মনে থাকবে', এশিয়া কাপ জিতে দলের মানসিক দৃঢ়তার প্রশংসায় রোহিত","link":"https://bengali.abplive.com/sports/cricket/indian-captain-rohit-sharma-hails-team-mental-character-after-asia-cup-2023-final-victory-1009880","keywords":["ক্রিকেট"],"creator":["ABP Ananda"],"video_url":null,"description":"কলম্বো: প্রেমদাসা স্টেডিয়ামে এশিয়া কাপের (Asia Cup 2023) খেতাবি লড়াইয়ে মুখোমুখি হয়েছিল ভারত ও শ্রীলঙ্কা (IND vs Sri Lanka)। রবিবাসরীয় ফাইনালে শ্রীলঙ্কাকে পর্যুদস্ত করে রেকর্ড অষ্টমবার এশিয়া সেরা হয় ভারতীয় দল। মাত্র ৫০ রানেই শ্রীলঙ্কাকে অল আউট করার পর ১০ উইকেটে ম্যাচ জিতে নেয় ভারত। পাঁচ বছরের ট্রফির খরা কাটিয়ে ফের এশিয়া কাপ জিতে টিম ইন্ডিয়ার ক্রিকেটারদের মানসিক দৃঢ়তার প্রশংসা করেন ভারতীয় অধিনায়ক রোহিত শর্মা (Rohit Sharma)। ম্যাচের পুরস্কার বিতরণী অনুষ্ঠানে রোহিত বলেন, 'সত্যিই দল দুর্দান্ত পারফর্ম করেছে। কোনও টুর্নামেন্টের ফাইনালে এমন পারফরম্যান্স করাটা দলের মানসিক দৃঢ়তার পরিচয় দেয়। বল হাতে আমরা শুরুটাও অসাধারণ করেছি এবং ব্যাট হাতে ইনিংসটা শেষ করতেও আমরা বেশি সময় নিইনি। আমাদের ফাস্ট বোলাররা প্রচুর খাটা খাটনি করেছে। ওদের কী করতে হবে, না হবে, সেই বিষয়ে ওদের ধারণা খুব স্পষ্ট। এই পারফরম্যান্স দেখতেও বেশ ভাল লাগল।' এই পারফরম্যান্সে সহজে ভোলার নয় বলেই জানান রোহিত। 'এমন এক পারফরম্যান্স দীর্ঘদিন মনে থাকবে। বলটা যে এত সিম, সুইং হবে সেটা কিন্তু কল্পনাও করিনি। এর পুরো কৃতিত্বটাই বোলারদের দক্ষতার। সিরাজ বাহবা পাওয়ার যোগ্য। হাওয়ায় এবং পিচে, দুইভাবে বল মুভ করার দক্ষতাটা কিন্তু সকলের থাকে না। ও দারুণ উন্নতি করেছে।' বলেন তিনি। এশিয়া কাপ পকেটে পুরে নিয়েছে ভারত। এরপরেই বিশ্বকাপ। ঘরের মাটিতে ৫০ ওভারের বিশ্বকাপ শুরু হতে আর মাসখানেকও বাকি নেই। এশিয়া কাপ জয়ের পরেই এবার বিশ্বকাপ ও অস্ট্রেলিয়া সিরিজ় নিয়ে ভাবনাচিন্তা শুরু করে দিয়েছন ভারতীয় অধিনায়ক। তিনি বলেন, 'আমাদের যা যা সাফল্য লাভ করা সম্ভব, এশিয়া কাপে সেইসব সাফল্য পেয়েছি। হার্দিক ও ঈশান চাপের মুখে পাকিস্তানের বিরুদ্ধে যেমন ব্যাট করেছিল। তারপর কেএল এবং বিরাটের পাকিস্তানের বিরুদ্ধে শতরান। গিলও দারুণ খেলেছে। সব মিলিয়ে ভিন্ন ভিন্ন সময়ে ভিন্ন ভিন্ন ব্যক্তি দলের হয়ে সামনে এগিয়ে এসে পারফর্ম করেছেন। এরপর ভারতে যে সিরিজ আয়োজিত হবে আমাদের নজর সেইদিকে এবং অবশ্যই বিশ্বকাপের দিকে।' আপনার পছন্দের খবর আর আপডেট এখন পাবেন আপনার পছন্দের চ্যাটিং প্ল্যাটফর্ম টেলিগ্রামেও। যুক্ত হোন https://t.me/abpanandaofficial আরও পড়ুন: এশিয়া কাপে চ্যাম্পিয়ন হয়ে কত টাকা পেল ভারত? শ্রীলঙ্কার ঝুলিতে গেল কত অর্থ?","content":"কলম্বো: প্রেমদাসা স্টেডিয়ামে এশিয়া কাপের (Asia Cup 2023) খেতাবি লড়াইয়ে মুখোমুখি হয়েছিল ভারত ও শ্রীলঙ্কা (IND vs Sri Lanka)। রবিবাসরীয় ফাইনালে শ্রীলঙ্কাকে পর্যুদস্ত করে রেকর্ড অষ্টমবার এশিয়া সেরা হয় ভারতীয় দল । মাত্র ৫০ রানেই শ্রীলঙ্কাকে অল আউট করার পর ১০ উইকেটে ম্যাচ জিতে নেয় ভারত। পাঁচ বছরের ট্রফির খরা কাটিয়ে ফের এশিয়া কাপ জিতে টিম ইন্ডিয়ার ক্রিকেটারদের মানসিক দৃঢ়তার প্রশংসা করেন ভারতীয় অধিনায়ক রোহিত শর্মা (Rohit Sharma)। ম্যাচের পুরস্কার বিতরণী অনুষ্ঠানে রোহিত বলেন, 'সত্যিই দল দুর্দান্ত পারফর্ম করেছে। কোনও টুর্নামেন্টের ফাইনালে এমন পারফরম্যান্স করাটা দলের মানসিক দৃঢ়তার পরিচয় দেয়। বল হাতে আমরা শুরুটাও অসাধারণ করেছি এবং ব্যাট হাতে ইনিংসটা শেষ করতেও আমরা বেশি সময় নিইনি। আমাদের ফাস্ট বোলাররা প্রচুর খাটা খাটনি করেছে। ওদের কী করতে হবে, না হবে, সেই বিষয়ে ওদের ধারণা খুব স্পষ্ট। এই পারফরম্যান্স দেখতেও বেশ ভাল লাগল।' এই পারফরম্যান্সে সহজে ভোলার নয় বলেই জানান রোহিত। 'এমন এক পারফরম্যান্স দীর্ঘদিন মনে থাকবে। বলটা যে এত সিম, সুইং হবে সেটা কিন্তু কল্পনাও করিনি। এর পুরো কৃতিত্বটাই বোলারদের দক্ষতার। সিরাজ বাহবা পাওয়ার যোগ্য। হাওয়ায় এবং পিচে, দুইভাবে বল মুভ করার দক্ষতাটা কিন্তু সকলের থাকে না। ও দারুণ উন্নতি করেছে।' বলেন তিনি। এশিয়া কাপ পকেটে পুরে নিয়েছে ভারত। এরপরেই বিশ্বকাপ। ঘরের মাটিতে ৫০ ওভারের বিশ্বকাপ শুরু হতে আর মাসখানেকও বাকি নেই। এশিয়া কাপ জয়ের পরেই এবার বিশ্বকাপ ও অস্ট্রেলিয়া সিরিজ় নিয়ে ভাবনাচিন্তা শুরু করে দিয়েছন ভারতীয় অধিনায়ক। তিনি বলেন, 'আমাদের যা যা সাফল্য লাভ করা সম্ভব, এশিয়া কাপে সেইসব সাফল্য পেয়েছি। হার্দিক ও ঈশান চাপের মুখে পাকিস্তানের বিরুদ্ধে যেমন ব্যাট করেছিল। তারপর কেএল এবং বিরাটের পাকিস্তানের বিরুদ্ধে শতরান। গিলও দারুণ খেলেছে। সব মিলিয়ে ভিন্ন ভিন্ন সময়ে ভিন্ন ভিন্ন ব্যক্তি দলের হয়ে সামনে এগিয়ে এসে পারফর্ম করেছেন। এরপর ভারতে যে সিরিজ আয়োজিত হবে আমাদের নজর সেইদিকে এবং অবশ্যই বিশ্বকাপের দিকে।' googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); আপনার পছন্দের খবর আর আপডেট এখন পাবেন আপনার পছন্দের চ্যাটিং প্ল্যাটফর্ম টেলিগ্রামেও। যুক্ত হোন https://t.me/abpanandaofficial আরও পড়ুন: এশিয়া কাপে চ্যাম্পিয়ন হয়ে কত টাকা পেল ভারত? শ্রীলঙ্কার ঝুলিতে গেল কত অর্থ? var _fireSc=!0;document.addEventListener(\"scroll\",(e=>{if(_fireSc){var c=document.createElement(\"script\");c.src=\"//asset.fwpub1.com/js/storyblock.js\",c.async=!0,document.getElementsByTagName(\"head\")[0].appendChild(c),_fireSc=!1}}));","pubDate":"2023-09-17 19:01:37","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/09/18/a8b2fdcfb3c4443b5c6aa695a79bfd5d1694975712164507_original.jpg","source_id":"abplive","source_priority":10959,"country":["india"],"category":["sports"],"language":"bengali"},{"article_id":"938bbf60dc1656bdd5a9a1284f0b4eb5","title":"Marco Jansen Destroys Australian Top Order To Clinch Series For South Africa","link":"https://sports.ndtv.com/cricket/marco-jansen-destroys-australian-top-order-to-clinch-series-for-south-africa-4399375","keywords":null,"creator":null,"video_url":null,"description":"Marco Jansen dismissed the first five Australian batsmen to clinch a come-from-behind series win for South Africa.","content":"Left-arm fast bowler Marco Jansen dismissed the first five Australian batsmen to clinch a come-from-behind series win for South Africa in the fifth one-day international at the Wanderers Stadium on Sunday. Jansen took five for 39 as Australia were bowled out for 193 in reply to South Africa's 315 for nine. South African captain Temba Bavuma said the character of the team had shone through after they lost the first two matches of the series, which boded well for the World Cup in India next month. \"There is a lot of confidence we can take, in that we had our backs against the wall and we showed we have ways of getting on top of the game. We will go to India in probably the best state we can be.\" South Africa won each of the last three matches by more than 100 runs after they were sent in to bat by Australian captain Mitchell Marsh . Marsh admitted: \"We were outplayed in the last three games but we have a one-day game in India on Friday, a lot of players coming back and a big World Cup coming up.\" Several leading players, including regular captain Pat Cummins , fellow fast bowler Mitchell Starc , all-rounder Glenn Maxwell and star batsman Steve Smith, will join the team for a pre-World Cup series against India starting in Mohali on Friday. Marsh's decision to bowl first in the only day game of the series seemed justified on Sunday when his bowlers reduced South Africa to 103 for four in the 24th over on a pitch which offered sideways movement and bounce to the seamers. Player of the series Aiden Markram (93) and David Miller (63) put on 109 for the fifth wicket and lower order batsmen Jansen and Andile Phehlukwayo took the total past 300 with some big hitting towards the end. Jansen hit three sixes in scoring 47 off 29 balls and Phehlukwayo cleared the boundary four times in his unbeaten 39 off 19 deliveries. Marsh and David Warner blasted 34 off the first three overs of the Australian innings but Jansen came into the attack and dismissed Warner and Inglis in a double-wicket maiden over. Marsh (71) and Marnus Labuschagne (44) put on 90 for the third wicket but Jansen dismissed both set batsmen and Alex Carey in a burst of three wickets off seven balls to put South Africa in command. Advertisement (This story has not been edited by NDTV staff and is auto-generated from a syndicated feed.)","pubDate":"2023-09-17 18:53:33","image_url":null,"source_id":"ndtv","source_priority":1204,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"dedb656780ddd62c3bf1b216a9173d27","title":"“No team came so close to them”: Irfan Pathan lauds India’s dominance in Asia Cup","link":"https://thenewsmill.com/2023/09/no-team-came-so-close-to-them-irfan-pathan-lauds-indias-dominance-in-asia-cup/","keywords":["Cricket","Sports","ANI"],"creator":["ANI"],"video_url":null,"description":"The News Mill","content":"Former cricketer Irfan Pathan believes India’s thumping victory over Sri Lanka in the Asia Cup final will act as a major “confidence boost” for the team in the upcoming ODI World Cup. The defending champions failed to survive the threat posed by the Men in Blue’s star-studded pace bowling line-up which was spearheaded by Mohammed Siraj. Pathan reflected on India’s performance in the entire tournament and felt that no team was able to pose a challenge to the Asia Cup 2023 champions and how this kind of performance will play a major role in the upcoming tournament. “It was a very conventional victory and, convincing entry because, in Asia Cup, I think no team came so close to team India except Bangladesh where the main team wasn’t playing. But if you’re talking about the main, where top players played. No one came close. And, to have that kind of victory before the World Cup, I think it’s a great boost of confidence for Team India. And that’s great to see, especially the kind of fast growth that we saw against Sri Lanka,” Pathan told reporters. Coming to the match, after speedster, Mohammed Siraj’s fiery spell decimated Sri Lanka, the opening duo of Shubman Gill and Ishan Kishan’s fifty-run partnership helped India lift the Asia Cup trophy for the 8th time in style after beating co-hosts in the final at the R Premadasa Stadium in Colombo on Sunday. Leading the India fast bowling effort, Siraj ran through the Sri Lanka top-order in a dazzling performance in the summit clash. It just took a little more than two hours for India to win their 8th Asia Cup title in style. Men in Blue lifted the Asia Cup trophy after five years. The Asia Cup summit clash witnessed a remarkable turn of events as Indian paceman Siraj bowled a dream spell against Sri Lanka. In a stunning display of bowling prowess, Sri Lanka was bowled out for a mere 50 runs in just 15.2 overs, predominantly due to Siraj’s outstanding performance, claiming six wickets in seven overs. (ANI)","pubDate":"2023-09-17 18:30:11","image_url":null,"source_id":"thenewsmill","source_priority":3781717,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"0c7867e2194b87e82ea903c0deddf3ff","title":"Asia Cup 2023: এশিয়া কাপে টুর্নামেন্টসেরা হয়ে রোহিতকে কৃতজ্ঞতা জানালেন কুলদীপ","link":"https://bengali.abplive.com/sports/cricket/asia-cup-2023-kuldeep-yadav-credits-rohit-sharma-after-winning-man-of-the-series-award-1009875","keywords":["ক্রিকেট"],"creator":["ABP Ananda"],"video_url":null,"description":"কলম্বো: এশিয়া কাপের ফাইনালে (Asia Cup 2023 Final) শ্রীলঙ্কাকে কার্যত নাস্তানাবুদ করে অষ্টমবার এশিয়াসেরা হয়েছে ভারতীয় ক্রিকেট দল (Indian Cricket Team)। ১০ উইকেটে জিতে নিয়েছে ফাইনাল। খেতাবি লড়াইয়ে ফাস্ট বোলার, আরও নির্দিষ্ট করে বলতে গেলে মহম্মদ সিরাজ়ের দাপট দেখা গেলেও, টুর্নামেন্ট সেরার পুরস্কার কিন্তু জিতেছেন কুলদীপ যাদব (Kuldeep Yadav)।  ফাইনালে কোনও উইকেট পাননি কুলদীপ। বল করেছেন মাত্র দুই ওভার। তবে টুর্নামেন্টের সুপার ফোরে দুরন্ত ছন্দে ছিলেন তিনি। তাঁর দৌলতেই পরপর দুই দিন দুই ম্যাচে পাকিস্তান ও শ্রীলঙ্কাকে পরাজিত করেছিল ভারত। এক ম্যাচে পাঁচ ও পরের ম্যাচে চার উইকেট নেন তিনি। নয় উইকেট নিয়েই টুর্নামেন্ট সেরা হন কুলদীপ। বিগত দেড় বছর ধরে নিজের বোলিং নিয়ে খুবই খাটাখাটনি করেছেন এবং তার ফলেই এই সাফল্য পেয়েছেন বলে জানান কুলদীপ।  পুরস্কারবিতরণী অনুষ্ঠানে তিনি বলেন, 'আমার ছন্দে ফিরে পেতে বিগত বছর দেড়েক ধরে প্রচুর খাটা খাটনি করেছি। ক্রিজেও আরও আক্রমণাত্মকভাবে ছুটে আসছি। নিজের বোলিং দেখে আমার নিজেরও বেশ ভাল লেগেছে। টি-টোয়েন্টিতে সঠিক লেংথে বল করাটা বেশি জরুরি। উইকেট নেওয়ার বিষয়ে তেমনটা ভাবনাচিন্তার সুযোগ থাকে না। সেই কারণেই সঠিক লেংথে বোলিং করার দিকে নজর দিয়েছি।' এরপরেই নিজের সাফল্যের জন্য তিনি ভারতীয় অধিনায়ক রোহিত শর্মাকেও কৃতিত্ব দেন। রোহিতকে বাহবা দিয়ে কুলদীপ বলেন, 'আমার সাফল্যের অনেকটা কৃতিত্বই রোহিত ভাইয়ের। ওঁ আমায় আমার বলের গতি নিয়ে খাটার পরামর্শ দিয়েছিল। আমাদের ফাস্ট বোলাররাও তো পাওয়ার প্লেতে নিয়মিত উইকেট নিচ্ছেন। তাই পরবর্তী সময়ে স্পিনারদের বোলিং করাটা অনেকটাই সহজ হয়ে যায়।' অপরদিকে, গ্যালারিভর্তি দর্শকদের সামনে ম্যাচ হেরে অনুতপ্ত শ্রীলঙ্কান অধিনায়ক দাসুন শনাকা। সমর্থকদের কাছে ক্ষমাও চেয়ে নিলেন তিনি। ম্যাচের পুরস্কার বিতরণী অনুষ্ঠানে শ্রীলঙ্কার অধিনায়ক বলেছেন, 'আমি সমর্থকদের ধন্যবাদ জানাতে চাই। যাঁরা মাঠ ভরিয়েছিলেন। আমরা আপনাদের হতাশ করেছি। তার জন্য দুঃখিত। তবু এই নিঃশর্ত সমর্থনের জন্য কৃতজ্ঞ।' ভারতীয় দলকে খেতাব জয়ের জন্য কিন্তু অভিনন্দনও জানিয়েছেন শনাকা।  আপনার পছন্দের খবর আর আপডেট এখন পাবেন আপনার পছন্দের চ্যাটিং প্ল্যাটফর্ম টেলিগ্রামেও। যুক্ত হোন https://t.me/abpanandaofficial আরও পড়ুন: এশিয়া কাপে চ্যাম্পিয়ন হয়ে কত টাকা পেল ভারত? শ্রীলঙ্কার ঝুলিতে গেল কত অর্থ?  ","content":"কলম্বো: এশিয়া কাপের ফাইনালে (Asia Cup 2023 Final) শ্রীলঙ্কাকে কার্যত নাস্তানাবুদ করে অষ্টমবার এশিয়াসেরা হয়েছে ভারতীয় ক্রিকেট দল (Indian Cricket Team)। ১০ উইকেটে জিতে নিয়েছে ফাইনাল। খেতাবি লড়াইয়ে ফাস্ট বোলার, আরও নির্দিষ্ট করে বলতে গেলে মহম্মদ সিরাজ়ের দাপট দেখা গেলেও, টুর্নামেন্ট সেরার পুরস্কার কিন্তু জিতেছেন কুলদীপ যাদব (Kuldeep Yadav)। ফাইনালে কোনও উইকেট পাননি কুলদীপ। বল করেছেন মাত্র দুই ওভার। তবে টুর্নামেন্টের সুপার ফোরে দুরন্ত ছন্দে ছিলেন তিনি। তাঁর দৌলতেই পরপর দুই দিন দুই ম্যাচে পাকিস্তান ও শ্রীলঙ্কাকে পরাজিত করেছিল ভারত। এক ম্যাচে পাঁচ ও পরের ম্যাচে চার উইকেট নেন তিনি। নয় উইকেট নিয়েই টুর্নামেন্ট সেরা হন কুলদীপ। বিগত দেড় বছর ধরে নিজের বোলিং নিয়ে খুবই খাটাখাটনি করেছেন এবং তার ফলেই এই সাফল্য পেয়েছেন বলে জানান কুলদীপ। পুরস্কারবিতরণী অনুষ্ঠানে তিনি বলেন, 'আমার ছন্দে ফিরে পেতে বিগত বছর দেড়েক ধরে প্রচুর খাটা খাটনি করেছি। ক্রিজেও আরও আক্রমণাত্মকভাবে ছুটে আসছি। নিজের বোলিং দেখে আমার নিজেরও বেশ ভাল লেগেছে। টি-টোয়েন্টিতে সঠিক লেংথে বল করাটা বেশি জরুরি। উইকেট নেওয়ার বিষয়ে তেমনটা ভাবনাচিন্তার সুযোগ থাকে না। সেই কারণেই সঠিক লেংথে বোলিং করার দিকে নজর দিয়েছি।' এরপরেই নিজের সাফল্যের জন্য তিনি ভারতীয় অধিনায়ক রোহিত শর্মাকেও কৃতিত্ব দেন। রোহিতকে বাহবা দিয়ে কুলদীপ বলেন, 'আমার সাফল্যের অনেকটা কৃতিত্বই রোহিত ভাইয়ের। ওঁ আমায় আমার বলের গতি নিয়ে খাটার পরামর্শ দিয়েছিল। আমাদের ফাস্ট বোলাররাও তো পাওয়ার প্লেতে নিয়মিত উইকেট নিচ্ছেন। তাই পরবর্তী সময়ে স্পিনারদের বোলিং করাটা অনেকটাই সহজ হয়ে যায়।' googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); অপরদিকে, গ্যালারিভর্তি দর্শকদের সামনে ম্যাচ হেরে অনুতপ্ত শ্রীলঙ্কান অধিনায়ক দাসুন শনাকা। সমর্থকদের কাছে ক্ষমাও চেয়ে নিলেন তিনি। ম্যাচের পুরস্কার বিতরণী অনুষ্ঠানে শ্রীলঙ্কার অধিনায়ক বলেছেন, 'আমি সমর্থকদের ধন্যবাদ জানাতে চাই। যাঁরা মাঠ ভরিয়েছিলেন। আমরা আপনাদের হতাশ করেছি। তার জন্য দুঃখিত। তবু এই নিঃশর্ত সমর্থনের জন্য কৃতজ্ঞ।' ভারতীয় দল কে খেতাব জয়ের জন্য কিন্তু অভিনন্দনও জানিয়েছেন শনাকা। আপনার পছন্দের খবর আর আপডেট এখন পাবেন আপনার পছন্দের চ্যাটিং প্ল্যাটফর্ম টেলিগ্রামেও। যুক্ত হোন https://t.me/abpanandaofficial আরও পড়ুন: এশিয়া কাপে চ্যাম্পিয়ন হয়ে কত টাকা পেল ভারত? শ্রীলঙ্কার ঝুলিতে গেল কত অর্থ? var _fireSc=!0;document.addEventListener(\"scroll\",(e=>{if(_fireSc){var c=document.createElement(\"script\");c.src=\"//asset.fwpub1.com/js/storyblock.js\",c.async=!0,document.getElementsByTagName(\"head\")[0].appendChild(c),_fireSc=!1}}));","pubDate":"2023-09-17 18:29:05","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/09/17/12f6f51b2e54b8465a1b49407e9b237b1694974938275507_original.jpg","source_id":"abplive","source_priority":10959,"country":["india"],"category":["sports"],"language":"bengali"}]}