{"newsArray":[{"title":"Shane Warne was ‘extremely loyal’ and ‘loved entertaining’","link":"https://www.cairnspost.com.au/lifestyle/shane-warne-was-extremely-loyal-and-loved-entertaining/video/8bfb92b3f39f0a4412dded11201875ba","keywords":["Lifestyle - syndicated","Sport news and galleries"],"creator":null,"video_url":null,"description":"Comedian Andy Lee says Shane Warne’s memorial will be about remembering the cricket great. “They think a billion people will watch because it’s getting broadcast live into India, Sri Lanka, South Africa, England, I mean, he’s the only one that can handle this type of pressure,” he told Sky News Australia. “He’s a man who ate up pressure and he loved entertaining.”","content":null,"pubDate":"2022-03-29 22:41:49","full_description":null,"image_url":null,"source_id":"cairnspost","country":["australia"],"category":["sports"],"language":"english"},{"title":"Warne family request as fresh memorial details revealed","link":"https://www.cairnspost.com.au/sport/cricket/shane-warne-memorial-start-time-live-stream-and-how-to-watch/news-story/9ffb69ad59800c4e10d4c1476a9c5d2c","keywords":["Cricket news and galleries","Sport news and galleries"],"creator":null,"video_url":null,"description":"Australia says farewell to the late Shane Warne today with tens of thousands of people at Melbourne Cricket Ground for a televised state memorial service featuring stars such as Elton John and former partner Liz Hurley.","content":null,"pubDate":"2022-03-29 22:30:00","full_description":null,"image_url":null,"source_id":"cairnspost","country":["australia"],"category":["sports"],"language":"english"},{"title":"‘Warnie was just a wonderful character’: Allan Border reflects on Shane Warne’s life","link":"https://www.cairnspost.com.au/sport/warnie-was-just-a-wonderful-character-allan-border-reflects-on-shane-warnes-life/video/f2512ee578d718941f3baeabbae58782","keywords":["National","Sport news and galleries"],"creator":null,"video_url":null,"description":"Former Australian cricketer Allan Border has reflected on the life of Shane Warne - saying \"Warnie\" was \"just a wonderful character\". \"He was just one of those disarming characters that everyone liked,\" Mr Border told Sky News Australia. \"He was just that, sort of, personality ... larger-than-life character.\" Shane Warne’s state memorial will be broadcast from the Melbourne Cricket Ground around the nation on Wednesday evening with some stadiums around the country set to show the funeral. Australians wanting to pay their respects to the King of Spin will be able to watch the funeral on Sky News Australia and SkyNews.com.au from 7pm AEDT.","content":null,"pubDate":"2022-03-29 22:19:03","full_description":null,"image_url":null,"source_id":"cairnspost","country":["australia"],"category":["sports"],"language":"english"},{"title":"Details of Warne memorial leaked","link":"https://www.cairnspost.com.au/sport/cricket/everything-you-need-to-know-about-shane-warnes-state-memorial/news-story/5c03e996c9a91a8d5b26a826970b0103","keywords":["Cricket news and galleries","Sport news and galleries"],"creator":null,"video_url":null,"description":"Australians will be given the opportunity to farewell cricket legend Shane Warne at the spin king’s state funeral this evening, with more than 50,000 people expected at the MCG.","content":null,"pubDate":"2022-03-29 21:45:00","full_description":null,"image_url":null,"source_id":"cairnspost","country":["australia"],"category":["sports"],"language":"english"},{"title":"Aussie ace ‘ran out of time’ to prove fitness for World Cup semi as toss delayed: LIVE","link":"https://www.foxsports.com.au/cricket/icc-womens-world-cup/aussie-ace-ran-out-of-time-to-prove-fitness-ahead-of-crucial-world-cup-semi-live/news-story/bba9817a2f416684b88318159ea5e451","keywords":null,"creator":null,"video_url":null,"description":"Australia is hoping to continue their unbeaten run at the Cricket World Cup as they take on the West Indies in the semi-final.","content":null,"pubDate":"2022-03-29 21:40:00","full_description":"Australia is hoping to continue their unbeaten run at the Cricket World Cup as they take on the West Indies in the semi-final. The Aussies are looking to steal their crown back from England but they will have to do it without superstar Ellyse Perry, who misses out due to back issues. Watch The ICC Women’s Cricket World Cup Semi-Finals LIVE & FREE on Kayo Freebies. AUS v WIN Wed 30th March 9AM. Join Kayo Freebies Now > Perry also missed out in Australia’s last group game against Bangladesh. Before training on Monday, Perry felt that there was a “high percentage” she would play but in the end skipper Meg Lanning claimed she ultimately “ran out of time” to prove she would be good to go. “Unfortunately, for her and the team, a big blow, but we feel like we have got some good depth to cover it and we are going to have to do that,” Lanning said on Tuesday. Keep up with all the action as it happens in our live blog below! It’s unclear as to whether Perry would be good to go for the final, but Australia must get past the West Indies before any thought can be given to that. Follow Australia v West Indies in our Match Centre! Ellyse Perry will be absent from Australia’s semi-final against the West Indies. (Photo by DAVID ROWLAND / AFP) Source: AFP The West Indies finished fourth in the group with three wins and three losses and one no result due to the fixture against South Africa being washed out. Australia and the West Indies faced off in Round 4 in which the Aussies won by seven wickets, chasing down the Windies’ total of 131 in 31 overs thanks to a batting masterclass from Rachael Haynes who finished 83*. However, the two will have to wait a little while longer to get started as the coin toss was delayed. The covers had been on throughout the morning with mist hovering around, although it was not raining. Follow the action in our live blog below!","image_url":null,"source_id":"foxsports","country":["australia"],"category":["sports"],"language":"english"},{"title":"Travis Head stuns cricket world in never-before-seen moment","link":"https://au.sports.yahoo.com/australia-pakistan-2022-travis-head-stuns-cricket-world-212824635.html","keywords":null,"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2022-03-29 21:28:24","image_url":"https://s.yimg.com/os/creatr-uploaded-images/2022-03/ad5280e0-afa6-11ec-b40e-24068d485593","source_id":"yahoo","country":["australia"],"category":["sports"],"language":"english"},{"title":"Head and Zampa win first ODI for Aussies","link":"https://www.cairnspost.com.au/sport/cricket/head-and-zampa-win-first-odi-for-aussies/video/1c2cc640dfe92518dc6529309dbf944e","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket: A sensational century from Travis Head as well as a four wicket haul from Adam Zampa have helped the Aussies take out the first ODI against Pakistan by 88 runs.","content":null,"pubDate":"2022-03-29 21:18:19","full_description":null,"image_url":null,"source_id":"cairnspost","country":["australia"],"category":["sports"],"language":"english"},{"title":"Moody blames early no-balls for Sunrisers' crushing defeat - ESPNcricinfo","link":"https://news.google.com/__i/rss/rd/articles/CBMijAFodHRwczovL3d3dy5lc3BuY3JpY2luZm8uY29tL3N0b3J5L2lwbC0yMDIxLXNyaC12cy1yci1jb2FjaC10b20tbW9vZHktYmxhbWVzLWVhcmx5LW5vLWJhbGxzLWZvci1zdW5yaXNlcnMtaHlkZXJhYmFkcy1jcnVzaGluZy1kZWZlYXQtMTMwODExMNIBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Moody blames early no-balls for Sunrisers' crushing defeat  ESPNcricinfoSunrisers Hyderabad v Rajasthan Royals IPL Tips: Revamped Royals have firepower to score big  Betting.betfairLIVE SRH vs RR Cricket Score, Match 5, IPL 2022: Dominant Rajasthan Royals Steamroll Sunrisers Hyderabad By 61 Runs  India.comFantasy Expert Picks: Chris Lynn's XI for Rajasthan vs Hyderabad  ESPNcricinfoLive Cricket Score: SRH vs RR, Match 5, IPL 2022 | Cricbuzz.com - Cricbuzz  CricbuzzView Full coverage on Google News","content":null,"pubDate":"2022-03-29 19:42:00","image_url":null,"source_id":"google","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Warne was extremely good at playing mind games: Sachin Tendulkar","link":"https://www.thehansindia.com/sports/warne-was-extremely-good-at-playing-mind-games-sachin-tendulkar-735695","keywords":["Sports,Today NewsPaper"],"creator":["The Hans India"],"video_url":null,"description":"Calling Shane Warne a \"fierce competitor\" against whom he always had to prepare differently, iconic Sachin Tendulkar says as the Australian spin legend was good at playing mind games and gave nothing away with his body language.","content":"Warne was extremely good at playing mind games: Sachin TendulkarWarne was extremely good at playing mind games: Sachin TendulkarNew Delhi: Calling Shane Warne a \"fierce competitor\" against whom he always had to prepare differently, iconic Sachin Tendulkar says as the Australian spin legend was good at playing mind games and gave nothing away with his body language. \"My first proper series against Shane Warne was in 1998 in India and everyone tagged that series as Tendulkar versus Shane Warne clash. That kind of following is going to put you under pressure,\" said Tendulkar. \"When you are playing a world class bowler like him, you just can't turn up and hope that things are going to be okay. \"So I had to prepare properly, not just out being there at the nets but when you're sitting in the room, you have to be a step ahead of him, what he would be thinking because he was extremely good in putting pressure and playing mind games and trying to plan your dismissal.\" Tendulkar had many fierce battles with Warne and the 1998 series in India will remain a part of cricketing folklore. \"It didn't matter, you looked at his body language. One didn't know whether Warne had picked up four wickets, five wickets or he was bowling wicketless. Every delivery that he bowled, he was a fierce competitor. \"So even if you're facing the second last over of the day, one had to keep their eyes open, because he was always up to something and trying to figure out how could he dismissed.\" West Indies batting great Brain Lara also hailed Warne as the \"most potent player\", who sealed his place \"in the upper echelons of world cricket\" with his performances in the Ashes series, which included the ball of the century that he bowled to England's Mike Gatting in 1993. \"I grew up in a country where spin bowling dominated. The lower part of the Caribbean, Trinidad, Guyana, we played spin very well. And Warne posed a lot of trouble for a lot of other players. I found myself winning a lot of those battles, but he never gave up,\" he said. \"He always produced that miracle delivery the one that you didn't know was coming. So I always had my eyes open for Warne throughout my career. He was just a tremendous bowler, bowling in an attack which had awesome fast bowlers.\" Remembering his last meeting with Warne in 2021, Tendulkar said: \"After the last IPL, I went to spend some time in London where we got in touch. There was never a dull moment. He was full of entertainment, full of jokes and you know those battles those mini competitions. \"I realised that it was not just about spin, the swing also came naturally to him. He was a good golfer. I hate saying he was a good golfer because it's hard to accept what has happened and for us he will continue to live in our hearts. \"...He had this tremendous attitude towards life. Always positive and always welcoming. It's really hard to accept that he is no more among us...\" Tendulkar said \"there were number of good spinners, but Shane was different\".","pubDate":"2022-03-29 19:08:03","full_description":"Warne was extremely good at playing mind games: Sachin Tendulkar New Delhi: Calling Shane Warne a \"fierce competitor\" against whom he always had to prepare differently, iconic Sachin Tendulkar says as the Australian spin legend was good at playing mind games and gave nothing away with his body language. \"My first proper series against Shane Warne was in 1998 in India and everyone tagged that series as Tendulkar versus Shane Warne clash. That kind of following is going to put you under pressure,\" said Tendulkar. \"When you are playing a world class bowler like him, you just can't turn up and hope that things are going to be okay. \"So I had to prepare properly, not just out being there at the nets but when you're sitting in the room, you have to be a step ahead of him, what he would be thinking because he was extremely good in putting pressure and playing mind games and trying to plan your dismissal.\" Tendulkar had many fierce battles with Warne and the 1998 series in India will remain a part of cricketing folklore. \"It didn't matter, you looked at his body language. One didn't know whether Warne had picked up four wickets, five wickets or he was bowling wicketless. Every delivery that he bowled, he was a fierce competitor. \"So even if you're facing the second last over of the day, one had to keep their eyes open, because he was always up to something and trying to figure out how could he dismissed.\" West Indies batting great Brain Lara also hailed Warne as the \"most potent player\", who sealed his place \"in the upper echelons of world cricket\" with his performances in the Ashes series, which included the ball of the century that he bowled to England's Mike Gatting in 1993. \"I grew up in a country where spin bowling dominated. The lower part of the Caribbean, Trinidad, Guyana, we played spin very well. And Warne posed a lot of trouble for a lot of other players. I found myself winning a lot of those battles, but he never gave up,\" he said. \"He always produced that miracle delivery the one that you didn't know was coming. So I always had my eyes open for Warne throughout my career. He was just a tremendous bowler, bowling in an attack which had awesome fast bowlers.\" Remembering his last meeting with Warne in 2021, Tendulkar said: \"After the last IPL, I went to spend some time in London where we got in touch. There was never a dull moment. He was full of entertainment, full of jokes and you know those battles those mini competitions. \"I realised that it was not just about spin, the swing also came naturally to him. He was a good golfer. I hate saying he was a good golfer because it's hard to accept what has happened and for us he will continue to live in our hearts. \"...He had this tremendous attitude towards life. Always positive and always welcoming. It's really hard to accept that he is no more among us...\" Tendulkar said \"there were number of good spinners, but Shane was different\".","image_url":"https://assets.thehansindia.com/h-upload/2022/03/29/500x300_1284306-sachin-tendulkar.jpg","source_id":"thehansindia","country":["india"],"category":["sports"],"language":"english"},{"title":"Seamer in Cricket: Difference between swing and seam in Cricket","link":"https://thesportsrush.com/cricket-news-seamer-in-cricket-difference-between-swing-and-seam-in-cricket/","keywords":["Cricket","Seam bowling","Swing bowling"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Seamer in Cricket: Bouncy pitches coupled with a grass covering can help a seamer trouble the batters with some disciplined bowling. That ‘it is difficult being a fast bowler’, is the one phrase that Cricket fans must have heard on multiple occasions at some point in their lives while getting to understand the basics and… The post Seamer in Cricket: Difference between swing and seam in Cricket appeared first on The SportsRush.","content":"Seamer in Cricket: Bouncy pitches coupled with a grass covering can help a seamer trouble the batters with some disciplined bowling. That ‘it is difficult being a fast bowler’, is the one phrase that Cricket fans must have heard on multiple occasions at some point in their lives while getting to understand the basics and nuances of the sport. While it remains quite a challenge for a fast bowler in particular, to remain injury-free for most parts of his Cricketing career, the involvement of pace, the use of the seam, the generation of swing, along with the need to hit the required line and length with respect to the batters or the conditions of play are some of the ingredients that go into the making of his successful career. The two important facets of a pacer’s game, regardless the speed at which he/she bowls at, is the involvement of ‘seam’ and ‘swing’. While a bowler may rely completely on the use of swing as his main weapon, others might rely on their express pace to get the batter undone. But, there have not been many bowlers, who use both the combination of swing and seam as the equally important parts of their arsenal, as the same requires decent amount of pace, skill, accuracy, and consistency to nail the art. Seamer in Cricket The word ‘seamer’ gets the name due to the involvement of the seam present on a Cricket ball. A seam refers to the external stitching on the ball across its circumference which acts as a grip for the bowler. Seam bowling is basically an art to outfox or get a batter undone, due to the movement of the ball upon hitting the pitch. A bowler can grip the ball with a seam-up, a tilted seam, a cross-seam, or even a scrambled-seam – all of which is used to provide the Cricket ball some movement off-the pitch upon the seam’s impact on it. It is the unpredictability of the movement of the ball upon landing on the surface that makes it a challenge for the batter to not only survive, but also score runs. ALSO READ: Difference between Red and Black soil pitches Difference between swing and seam in Cricket While seam bowling relies on the movement of the ball’s seam upon its impact on the pitch, swing bowling is based on the movement of the ball while in the air. While breezy conditions do assist, the relatively heavy Cricket ball swings due a difference in the flow of air on either side of the seam. A bowler can control the degree of swing towards or away from the batter, known as inswing and outswing respectively. While this component depends on the shine of the ball, a bowler also needs to have a prefect grip on the seam in order to control the ball’s swing or to even come up with the desired direction of swing at all. Other factors that go into performing seam and swing bowling are requirement of ideal conditions such as a green-top surface for sharper movement of the ball on impact, or the type of ball used as well. Balls with a prominent, hard seam helps the ball move for longer duration off the surface. The post Seamer in Cricket: Difference between swing and seam in Cricket appeared first on The SportsRush.","pubDate":"2022-03-29 18:50:33","full_description":"Seamer in Cricket: Bouncy pitches coupled with a grass covering can help a seamer trouble the batters with some disciplined bowling. That ‘it is difficult being a fast bowler’, is the one phrase that Cricket fans must have heard on multiple occasions at some point in their lives while getting to understand the basics and nuances of the sport. While it remains quite a challenge for a fast bowler in particular, to remain injury-free for most parts of his Cricketing career, the involvement of pace, the use of the seam, the generation of swing, along with the need to hit the required line and length with respect to the batters or the conditions of play are some of the ingredients that go into the making of his successful career. The two important facets of a pacer’s game, regardless the speed at which he/she bowls at, is the involvement of ‘seam’ and ‘swing’. While a bowler may rely completely on the use of swing as his main weapon, others might rely on their express pace to get the batter undone. But, there have not been many bowlers, who use both the combination of swing and seam as the equally important parts of their arsenal, as the same requires decent amount of pace, skill, accuracy, and consistency to nail the art. The word ‘seamer’ gets the name due to the involvement of the seam present on a Cricket ball. A seam refers to the external stitching on the ball across its circumference which acts as a grip for the bowler. Seam bowling is basically an art to outfox or get a batter undone, due to the movement of the ball upon hitting the pitch. A bowler can grip the ball with a seam-up, a tilted seam, a cross-seam, or even a scrambled-seam – all of which is used to provide the Cricket ball some movement off-the pitch upon the seam’s impact on it. It is the unpredictability of the movement of the ball upon landing on the surface that makes it a challenge for the batter to not only survive, but also score runs. ALSO READ : Difference between Red and Black soil pitches While seam bowling relies on the movement of the ball’s seam upon its impact on the pitch, swing bowling is based on the movement of the ball while in the air. While breezy conditions do assist, the relatively heavy Cricket ball swings due a difference in the flow of air on either side of the seam. A bowler can control the degree of swing towards or away from the batter, known as inswing and outswing respectively. While this component depends on the shine of the ball, a bowler also needs to have a prefect grip on the seam in order to control the ball’s swing or to even come up with the desired direction of swing at all. Other factors that go into performing seam and swing bowling are requirement of ideal conditions such as a green-top surface for sharper movement of the ball on impact, or the type of ball used as well. Balls with a prominent, hard seam helps the ball move for longer duration off the surface.","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Shane Warne memorial: The lovable suburban kid who became a global superstar - ABC News","link":"https://news.google.com/__i/rss/rd/articles/CBMiXWh0dHBzOi8vd3d3LmFiYy5uZXQuYXUvbmV3cy8yMDIyLTAzLTMwL3NoYW5lLXdhcm5lLW1lbW9yaWFsLW9keXNzZXktcnVzc2VsbC1qYWNrc29uLzEwMDk0MzY5MtIBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Shane Warne memorial: The lovable suburban kid who became a global superstar  ABC NewsThousands of last-minute tickets available for Shane Warne's state memorial | 9 News Australia  9 News AustraliaEditorial: A fitting farewell for Shane Warne, an Australian cricket great  The West AustralianShane Warne was a cricket star, but his famous friends most remember him for his 'big heart'  ABC NewsHurley to take part in Warne’s memorial  news.com.auView Full coverage on Google News","content":null,"pubDate":"2022-03-29 18:44:03","image_url":null,"source_id":"google","country":["australia"],"category":["sports"],"language":"english"},{"title":"Women's WC, Australia vs West Indies, Semifinal: Live Score, Live Updates","link":"https://sports.ndtv.com/cricket/icc-womens-cricket-world-cup-australia-women-vs-west-indies-women-semifinal-live-cricket-score-live-updates-basin-reserve-wellington-2851122","keywords":null,"creator":null,"video_url":null,"description":"ICC Women's Cricket World Cup, Aus-W vs WI-W Live: Australia face West Indies in their semifinal clash at the Basin Reserve in Wellington.","content":null,"pubDate":"2022-03-29 18:22:46","full_description":"Australia and West Indies will square off in the first semi-final of the Women's World Cup at Basin Reserve in Wellington on Wednesday. Heading into the contest, Meg Lanning and Co are the clear favourites after being unbeaten in the competition so far. West Indies made it to the semi-finals after South Africa managed to defeat India in a thrilling encounter. But one cannot count out Stafanie Taylor's side as they defeated New Zealand and England in the group stages. Ahead of a crucial game, Australia received a huge blow as Ellyse Perry was ruled out of the semi-final clash. ( LIVE SCORECARD ) It is time for the semi-finals in the ICC Women's World Cup, 2022 and the first semi-final will be played between the six-time champions, Australia and West Indies at Wellington. Both these sides have fought hard in the round-robin stage and the Australians have been simply sensational as they won seven games on the trot and are unbeaten coming into the semi-final. Australia Women are a very dominant side and they have performed exceedingly well in all three departments. Their skipper, Meg Lanning has been leading from the front and is also the second-highest run-getter in this competition. However, this is a side that is not dependent only on a few individuals as all of their players can win games on their own. Rachael Haynes has also been in top form with the bat and their bowling has also been upto the mark more often than not. The Aussies will be high on confidence heading into this big game and they certainly start as favourites. West Indies Women, on the other hand, haven't had the best of times since they won their first two games, as they have been inconsistent in all the departments. They managed to win just three out of the seven games, one of which was abandoned due to rain. It is their bowling that has helped them to qualify for the semi-final and their batters will need to bring their A-game coming into the semi-final, especially against Australia. The likes of Hayley Matthews, Deandra Dottin and skipper, Stafanie Taylor would be keen to put their best foot forward heading into this is crunch game. It was because of a South African win against India, West Indies got the backdoor entry. The Windies have played well in patches but against Australia, they can't afford to make many mistakes as they are too good a side to not take advantage of those mistakes. This semi-final proves to be a cracking contest and it will be interesting to see which side progresses through to the final. Who do you think will come out victorious?","image_url":"https://c.ndtvimg.com/2022-03/uhonbtq_australia-afp_625x300_29_March_22.jpg?im=FeatureCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL 2022: Rajasthan Royals Defeat SunRisers Hyderabad By 61 Runs - NDTV Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMiemh0dHBzOi8vc3BvcnRzLm5kdHYuY29tL2lwbC0yMDIyL2luZGlhbi1wcmVtaWVyLWxlYWd1ZS0yMDIyLXJhamFzdGhhbi1yb3lhbHMtZGVmZWF0LXN1bnJpc2Vycy1oeWRlcmFiYWQtYnktNjEtcnVucy0yODUxMDg30gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"IPL 2022: Rajasthan Royals Defeat SunRisers Hyderabad By 61 Runs  NDTV SportsLive match blog - Royals vs Sunrisers 5th Match 2022 - Cricket Insights  ESPNcricinfoLive Cricket Score: SRH vs RR, Match 5, IPL 2022 | Cricbuzz.com - Cricbuzz  CricbuzzIPL 2022: Bhuvneshwar Kumar's No-Ball Reminds Fans Of ICC Champions Trophy Final  News18Recent Match Report - Royals vs Sunrisers 5th Match 2022  ESPNcricinfoView Full coverage on Google News","content":null,"pubDate":"2022-03-29 18:10:00","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL 2022: Sanju Samson, bowlers shine as RR thrash SRH by 61 runs","link":"https://zeenews.india.com/cricket/ipl-2022-sanju-samson-bowlers-shine-as-rr-thrash-srh-by-61-runs-2449065.html","keywords":null,"creator":null,"video_url":null,"description":"A solid batting followed by a clinical bowling performance helped Rajasthan Royals thrash Sunrisers Hyderabad by 61 runs in an IPL 2022 match at the Maharashtra Cricket Association Stadium, here on Tuesday.","content":null,"pubDate":"2022-03-29 18:03:00","full_description":"A solid batting followed by a clinical bowling performance helped Rajasthan Royals thrash Sunrisers Hyderabad by 61 runs in an IPL 2022 match at the Maharashtra Cricket Association Stadium, here on Tuesday. Riding on brilliant attacking knocks by skipper Sanju Samson (55 off 27), Devdutt Padikkal (41 off 29) and a late cameo by Shimron Hetmyer (32 off 13), Rajasthan Royals posted 210/6 in 20 overs. Apart from the trio of Samson, Padikkal and Hetmyer, Jos Buttler (35 off 28) and Yashasvi Jaiswal (20 off 16) also made valuable contributions with the bat. Umran Malik (2/39) and T Natarajan (2/43) were the top wicket-takers for Hyderabad. Match: 1 Points: 2 #दिलसेरॉयल | #TATAIPL2022 | #SRHvRR pic.twitter.com/VmaHAUplLZ — Rajasthan Royals (@rajasthanroyals) March 29, 2022 In reply, top-order batters -- Kane Williamson (2), Abhishek Sharma (9), Rahul Tripathi (0), Nicholas Pooran (0) couldn't do much for Hyderabad. Lower down the order, Aiden Markram (57 off 41), Romario Shepherd (24 off 18) and Washington Sundar (40 off 14) tried hard but it wasn't enough as Hyderabad were restricted to 149-7 in 20 overs. Yuzvendra Chahal (3/22), Prasidh Krishna (2/16) and Trent Boult (2/23) were the wicket-takers for Rajasthan. Brief scores: Rajasthan Royals 210/6 in 20 overs (Sanju Samson 55, Devdutt Padikkal 41; Umran Malik 2/39) beat Sunrisers Hyderabad 149/7 in 20 overs(Aiden Markram 57, Washington Sundar 40; Yuzvendra Chahal 3/22) by 61 runs.","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"AUS-W vs WI-W Dream11 Team Prediction, Fantasy Cricket Hints: Captain, Probable Playing 11s, Team News; Injury Updates For Today’s AUS-W vs WI-W ODI World Cup semi-final Match at Basin Reserve, Wellington 3:30 AM IST March 30","link":"https://zeenews.india.com/cricket/aus-w-vs-wi-w-dream11-team-prediction-fantasy-cricket-hints-captain-probable-playing-11s-team-news-injury-updates-for-today-s-aus-w-vs-wi-w-odi-world-cup-semi-final-match-at-basin-reserve-wellington-330-am-ist-march-30-2448968.html","keywords":null,"creator":null,"video_url":null,"description":"Australia women vs West Indies women Dream11 Team Prediction Australia women vs West Indies women ICC Women's World Cup ODI- Check My Dream11 Team, Best players list of AUS-W vs WI-W, Australia women Dream11 Team Player List, West Indies women Dream11 Team Player List, Dream11 Guru Tips, Fantasy Cricket Tips, Fantasy Cricket Tips, Fantasy Playing Tips.","content":null,"pubDate":"2022-03-29 17:54:00","full_description":"Australia Women and West Indies Women will clash in the first semi-final of the ICC Women's World Cup 2022 on Wednesday (March 30). Australia are on a roll as they are unbeaten in the tournament so far and were also the first team to qualify for this semi-finals. They finished the group stages as table leaders winning all seven games with 14 points. On the other hand, West Indies Women finished third in the table with 3 wins and 3 losses in their group stage. In their previous fixture, West Indies were forced to share a point with South Africa as the match was cancelled due to rain. Venue: Basin Reserv, Wellington Date & Time: 30th Match, 3:30 AM IST Live Streaming: Star Sports Network and Disney+Hotstar Wicketkeeper- Alyssa Healy Batters: Rachael Haynes, Meg Lanning, Deandra Dottin, Stafanie Taylor All-rounders: Hayley Matthews, Ashleigh Gardner, Tahlia McGrath Bowlers: Jess Jonassen, Megan Schutt, Afy Fletcher AUS-W: Alyssa Healy (wk), Rachael Haynes, Meg Lanning (c), Beth Mooney, Tahlia McGrath, Ashleigh Gardner, Annabel Sutherland, Jess Jonassen, Alana King, Megan Schutt, Darcie Brown WI-W: Deandra Dottin, Rashada Williams, Hayley Matthews, Stafanie Taylor (c), Shemaine Campbelle (wk), Chedean Nation, Kycia Knight, Afy Fletcher, Chinelle Henry, Karishma Ramharack, Shamilia Connell","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"Sunrisers Hyderabad vs Rajasthan Royals: IPL 2022 Live Cricket Score, Live Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/sunrisers-hyderabad-vs-rajasthan-royals-live-score-over-match-5-t20-16-20-updates-2851019","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Sunrisers Hyderabad vs Rajasthan Royals from Maharashtra Cricket Association Stadium, Pune. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-03-29 17:29:46","full_description":"Follow the Indian Premier League 2022 live cricket score on Sports.NDTV.com . After 18.5 overs, Sunrisers Hyderabad, chasing a target of 211, are 133/7. Get live score, ball by ball commentary and much more. Keep track of Indian Premier League 2022 today match between Sunrisers Hyderabad and Rajasthan Royals. Everything related to Sunrisers Hyderabad and Rajasthan Royals match will be available on Sports.NDTV.com . Stay updated with Sunrisers Hyderabad vs Rajasthan Royals live score. Do check for Sunrisers Hyderabad vs Rajasthan Royals scorecard. You can get scorecard updates, match related facts. Get quick live updates with ads, Sports.NDTV.com , which is the perfect destination for live cricket score. 18.5 overs (0 Run) OUT! c Shimron Hetmyer b Trent Boult. 18.5 overs (1 Run) WIDE! A slower bouncer, on off. Washington Sundar sways from the line. Wide called though. 18.4 overs (6 Runs) SIX! BANG! Washington Sundar moves to 40 off just 13 deliveries. Full length, on the fourth stump. Washington Sundar opens the face of the blade and smokes it over the long off fence for a maximum. 18.4 overs (1 Run) WIDE! Full, wide outside off. Washington Sundar leaves it alone. Wide called. 18.3 overs (4 Runs) FOUR! Thumped! Full and straight from Boult. Washington Sundar goes deep in his crease and drills it right back over the bowler's head for a boundary. 18.2 overs (1 Run) Slower this time, around the hips. Markram waits for it and pulls it behind square on the leg side for a single. 18.1 overs (1 Run) Full and straight, this is dug out towards mid off for a single. 17.6 overs (4 Runs) FOUR! Another good over from Hyderabad's prespective, but a little too late. Full length, outside off. Aiden Markram throws his blade at it. The ball takes the outside edge and flies towards the third man fence. Boundary. 17.5 overs (6 Runs) SIX! Aiden Markram freeing his arms now. It is full and wide outside off. Aiden Markram throws his blade at it and slices it over extra cover for a maximum. 17.4 overs (1 Run) Fuller, outside off. Washington Sundar guides it to third man for a single. 17.3 overs (1 Run) Full length, on off. Aiden Markram works it to deep point for a single. 17.2 overs (1 Run) Full length, wide outside off. Washington Sundar slices it to third man for a single. 17.1 overs (1 Run) On off, Aiden Markram drives it through covers for a single. Prasidh Krishna (3-1-2-2) to finish off his spell here. 16.6 overs (4 Runs) FOUR! Nicely played but gets lucky as Yuzvendra Chahal misjudges the ball in the deep. 24 runs come off the over. It is full, on the pads. Washington Sundar flicks it aerially towards deep square leg. Yuzvendra Chahal ends up being ahead of the ball and he tries to leap but the ball evades him. One bounce over the ropes. Earlier in the game, Nathan Coulter-Nile over ran a catch of Yuzvendra Chahal's bowling. 16.5 overs (4 Runs) FOUR! Washington Sundar only dealing in boundaries. He is putting a dent in this Rajasthan bowling attack. Full length, angled down leg. Washington Sundar flicks it to fine leg for a boundary. 16.4 overs (2 Runs) Full length, on middle and leg. Washington Sundar drills it down the ground to long on. Shimron Hetmyer coves a lot of ground to his right and saves a certain boundary. The batters take two. 16.3 overs (4 Runs) FOUR! Washington Sundar is on a roll. Length ball, outside off. Washington Sundar punches it down the ground. It beats the effort of the fielder at mid off and races away to the fence. 16.2 overs (4 Runs) FOUR! Washington Sundar stands tall and delivers this time. Back of a length, outside off. Washington Sundar slaps it through mid off for a boundary. 16.1 overs (6 Runs) SIX! All the way! Nathan Coulter-Nile errs in line this time. It is a length ball, sliding down the leg side. Washington Sundar stays back and flicks it over the fine leg fence for a maximum. Nathan Coulter-Nile (2-0-23-0) is back on. 15.6 overs (1 Run) Fuller, on middle and leg. Washington Sundar works it to mid on for a single. Yuzvendra Chahal ends his spell with three wickets to his name. He couldn't have asked for a better start with a new side. 15.5 overs (2 Runs) Touch short, on off. Washington Sundar pulls it to deep mid-wicket for a brace. It could've been curtains for Aiden Markram, if Yuzvendra Chahal would've knocked the stumps off at the non-striker's end. Strategic Time-Out! Rajasthan have the game in bag and it has been a completely dominant bowling performance from them. After the brilliant start by their pacers, Ravichandran Ashwin has held up one end well and this has allowed Yuzvendra Chahal to be attacking with the ball and he has picked up 3 wickets. The only decent partnership for Hyderabad, between Romario Shepherd and Aiden Markram has now been broken and it is now only a question of by how many runs they lose tonight. Markram though will be looking to get to his fifty. Washington Sundar comes in to bat next. 15.4 overs (0 Run) OUT! TIMBER! Yuzvendra Chahal, you beauty! He gets his 250th wicket in T20 career. This is full and on the leg stump. Romario Shepherd gets low and tries to sweep it away but misses. The ball goes through to shatter the stumps. Yuzvendra Chahal punches the air in delight. He picks up his third wicket of the game. 15.3 overs (0 Run) Floated, wide outside off. Romario Shepherd tries go downtown but only connects with thin air. 15.2 overs (1 Run) Fuller, on leg. Aiden Markram flicks it to deep mid-wicket for a single. 15.1 overs (0 Run) Quicker through the air, on middle and leg. Aiden Markram flicks it into his pads. It dies on the leg side.","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637841915782398672.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"SRH memes worst powerplay: Twitter reactions and funniest IPL memes on SRH scoring lowest pp score in IPL 2022","link":"https://thesportsrush.com/cricket-news-srh-memes-worst-powerplay-twitter-reactions-and-funniest-ipl-memes-on-srh-scoring-lowest-pp-score-in-ipl-2022/","keywords":["Cricket","IPL 2022","Rajasthan Royals","Sunrisers Hyderabad","Indian Premier League","rajasthan royals","RR","SRH"],"creator":["Dixit Bhargav"],"video_url":null,"description":"SRH memes: Sunrisers Hyderabad have registered a worst possible start to their Indian Premier League 2022 campaign.   SRH memes on lowest pp score in IPL #DavidWarner looking at #OrangeArmy #SRH team score😂😂#SRHvRR #TATAIPL2022 @SunRisers @rajasthanroyals pic.twitter.com/VlvJHjyZF4 — Ashmit (@Ashonell) March 29, 2022 #SRHvRR After watching @SunRisers batting…#OrangeArmy fans be like: pic.twitter.com/wTGgY2l6NO — G! (@Gadillashiva)… The post SRH memes worst powerplay: Twitter reactions and funniest IPL memes on SRH scoring lowest pp score in IPL 2022 appeared first on The SportsRush.","content":"SRH memes: Sunrisers Hyderabad have registered a worst possible start to their Indian Premier League 2022 campaign.   SRH memes on lowest pp score in IPL #DavidWarner looking at #OrangeArmy #SRH team score#SRHvRR #TATAIPL2022 @SunRisers @rajasthanroyals pic.twitter.com/VlvJHjyZF4 — Ashmit (@Ashonell) March 29, 2022 #SRHvRR After watching @SunRisers batting…#OrangeArmy fans be like: pic.twitter.com/wTGgY2l6NO — G! (@Gadillashiva) March 29, 2022 SRH every year:#SRHvRR @SunRisers #IPL #IPL2022 pic.twitter.com/9xMgWCvF5Z — Rounak Singh (@RounakSingh1694) March 29, 2022 SRH finding their team on points table #SRHvRR pic.twitter.com/SdlhfZ6oWK — Er. Kabir Dhillon (@bahotjaadasakht) March 29, 2022 #OrangeArmy mood rn –#SRHvRR #IPL2022 pic.twitter.com/W8dcLgABWl — The Sports Republic (@SportsR3public) March 29, 2022 For more cricket-related news, click here. The post SRH memes worst powerplay: Twitter reactions and funniest IPL memes on SRH scoring lowest pp score in IPL 2022 appeared first on The SportsRush.","pubDate":"2022-03-29 17:23:55","full_description":"SRH memes: Sunrisers Hyderabad have registered a worst possible start to their Indian Premier League 2022 campaign. If a cricketing innings going bad to worse needed an example, Sunrisers Hyderabad’s ongoing innings in the fifth Indian Premier League 2022 match against Rajasthan Royals in Pune would have been an apt solution. SRH, who would want to forget this match as soon as possible, must already be thinking about starting afresh in the second match against Lucknow Super Giants on April 4. Chasing a dominating 211-run target, Hyderabad were expected to make optimum use of their powerplay to at least cross the 50-run mark without losing many wickets. However, what happened in reality was them not being able to score runs losing three wickets in the process. A joint-lowest powerplay score was followed by Hyderabad continuing to lose wickets only to get reduced from 14/3 in the powerplay to 36/4 at the halfway mark. A required run rate of 17.5 had all but snatched all signs of Sunrisers sealing the chase at the Maharashtra Cricket Association Stadium tonight. While SRH’s top-order seemed to be incompetent and incapable of countering Trent Boult and Gujarat Titans. #DavidWarner looking at #OrangeArmy #SRH team score😂😂 #SRHvRR #TATAIPL2022 @SunRisers @rajasthanroyals pic.twitter.com/VlvJHjyZF4 — Ashmit (@Ashonell) March 29, 2022 #SRHvRR After watching @SunRisers batting… #OrangeArmy fans be like: pic.twitter.com/wTGgY2l6NO — G! (@Gadillashiva) March 29, 2022 SRH every year: #SRHvRR @SunRisers #IPL #IPL2022 pic.twitter.com/9xMgWCvF5Z — Rounak Singh (@RounakSingh1694) March 29, 2022 SRH finding their team on points table 😂 #SRHvRR pic.twitter.com/SdlhfZ6oWK — Er. Kabir Dhillon (@bahotjaadasakht) March 29, 2022 #OrangeArmy mood rn – #SRHvRR #IPL2022 pic.twitter.com/W8dcLgABWl — The Sports Republic (@SportsR3public) March 29, 2022 For more cricket-related news, click here .","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Fastest to 4000 runs in ODI: Full list of batters with fastest 4000 ODI runs","link":"https://thesportsrush.com/cricket-news-fastest-to-4000-runs-in-odi-full-list-of-batters-with-fastest-4000-odi-runs/","keywords":["Cricket","Australia tour of Pakistan 2022"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Fastest to 4000 runs in ODI: Pakistan skipper Babar Azam gets registered in the history books with another record under his name. During the first of the three match ODI series of Australia’s ongoing historic tour of Pakistan at the Gaddafi Stadium in Lahore, Pakistan skipper Babar Azam has struck his 18th half-century in ODIs… The post Fastest to 4000 runs in ODI: Full list of batters with fastest 4000 ODI runs appeared first on The SportsRush.","content":"Fastest to 4000 runs in ODI: Pakistan skipper Babar Azam gets registered in the history books with another record under his name. During the first of the three match ODI series of Australia’s ongoing historic tour of Pakistan at the Gaddafi Stadium in Lahore, Pakistan skipper Babar Azam has struck his 18th half-century in ODIs with his side chasing 313/7 posted by Australia in the first innings. With the chase still on, Babar Azam, before scoring his yet another fifty in the format in continuance with his purple patch of form, registered yet another noteworthy record after he became the fastest batter from Asia to reach the landmark of 4,000 ODI runs. Playing the 84th ODI for his country, the 27-year-old took mere 82 innings to surpass the 4,000-run mark in the 50-Over format of the game. The moment arrived during the 12th Over of Pakistan’s chase bowled by Mitchell Swepson. During the second delivery of the Over, Babar (batting on 14) cut a short and wide delivery bowled by the leg-spinner for a boundary, in front of the fielder stationed at backward point. 4⃣0⃣0⃣0⃣ runs for @babarazam258 in ODIs! pic.twitter.com/HHGtnIVaaV — Pakistan Cricket (@TheRealPCB) March 29, 2022 Fastest to 4000 runs in ODI Babar was already one inning short at arriving the landmark figure in ODIs and become the fastest to reach the same. Former South African batter Hashim Amla holds the record of completing 4,000 ODI runs in mere 81 innings, having arrived at the landmark during his 84th ODI as well. Next in the list is legendary West Indies batter Sir Vivian Richards, who reached the milestone in his 88th innings (96th ODI). Completing the top-5 list are England’s Joe Root and Virat Kohli, with them reaching the figure in their 91st and 93rd innings respectively. Full list of batters with fastest 4000 ODI runs (by innings) 81 – Hashim Amla 82 – Babar Azam 88 – Viv Richards 91 – Joe Root 93 93 – Virat Kohli and David Warner The post Fastest to 4000 runs in ODI: Full list of batters with fastest 4000 ODI runs appeared first on The SportsRush.","pubDate":"2022-03-29 17:20:54","full_description":"Fastest to 4000 runs in ODI: Pakistan skipper Babar Azam gets registered in the history books with another record under his name. During the first of the three match ODI series of Australia’s ongoing historic tour of Pakistan at the Gaddafi Stadium in Lahore, Pakistan skipper Babar Azam has struck his 18th half-century in ODIs with his side chasing 313/7 posted by Australia in the first innings. With the chase still on, Babar Azam, before scoring his yet another fifty in the format in continuance with his purple patch of form, registered yet another noteworthy record after he became the fastest batter from Asia to reach the landmark of 4,000 ODI runs. Playing the 84th ODI for his country, the 27-year-old took mere 82 innings to surpass the 4,000-run mark in the 50-Over format of the game. The moment arrived during the 12th Over of Pakistan’s chase bowled by Mitchell Swepson. During the second delivery of the Over, Babar (batting on 14) cut a short and wide delivery bowled by the leg-spinner for a boundary, in front of the fielder stationed at backward point. 🎉4⃣0⃣0⃣0⃣ runs for @babarazam258 in ODIs! 🎉 pic.twitter.com/HHGtnIVaaV — Pakistan Cricket (@TheRealPCB) March 29, 2022 Babar was already one inning short at arriving the landmark figure in ODIs and become the fastest to reach the same. Former South African batter Hashim Amla holds the record of completing 4,000 ODI runs in mere 81 innings, having arrived at the landmark during his 84th ODI as well. Next in the list is legendary West Indies batter Sir Vivian Richards, who reached the milestone in his 88th innings (96th ODI). Completing the top-5 list are England’s Joe Root and Virat Kohli, with them reaching the figure in their 91st and 93rd innings respectively. 81 – Hashim Amla 82 – Babar Azam 88 – Viv Richards 91 – Joe Root 93 93 – Virat Kohli and David Warner","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Sunrisers Hyderabad vs Rajasthan Royals: IPL 2022 Live Cricket Score, Live Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/sunrisers-hyderabad-vs-rajasthan-royals-live-score-over-match-5-t20-11-15-updates-2850980","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Sunrisers Hyderabad vs Rajasthan Royals from Maharashtra Cricket Association Stadium, Pune. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-03-29 17:04:03","full_description":"A dedicated team of experts bring you live score, live cricket score, live match update on Sports.NDTV.com . After 13.3 overs, Sunrisers Hyderabad, chasing a target of 211, are 58/5. The live updates of Sunrisers Hyderabad vs Rajasthan Royals scorecard is also available. It is the perfect platform to follow your favourite teams in Indian Premier League 2022. Keep a track on your favourite batsmen and bowlers through Indian Premier League 2022 today match, ball by ball commentary, Sunrisers Hyderabad vs Rajasthan Royals, Sunrisers Hyderabad vs Rajasthan Royals live score, Sunrisers Hyderabad vs Rajasthan Royals scorecard. Follow the excitement of the Indian Premier League 2022 on Sports.NDTV.com as you can follow live match updates and live cricket score through our platform. 13.1 overs (1 Run) 1 run. 12.6 overs (1 Run) Length, outside off. Aiden Markram punches it to cover. Shimron Hetmyer fumbles and the batters take a single. 12.5 overs (2 Runs) On middle, driven down towards wide long on for a brace. 12.4 overs (4 Runs) FOUR! Up and over! This is dragged down, outside off. Aiden Markram goes over extra cover and picks up a boundary. 12.3 overs (1 Run) Short and around off, slapped away to deep cover for one. 12.2 overs (2 Runs) Short delivery, on middle. Romario Shepherd plays it off the back foot towards wide long on and picks up a couple of runs. 12.1 overs (1 Run) Nathan Coulter-Nile has made a mess of it and Aiden Markram survives! Shorter ball, on off. Markram rocks back and mistimes the loft towards long off. Coulter-Nile comes racing in and puts in the slide before even reaching the ball. The ball falls behind him and the batters get one. 11.6 overs (1 Run) Flatter this time, close to the off stump. Markram works it through extra cover for a run. 11.5 overs (1 Run) On middle again, Romario Shepherd goes for the sweep but gets it off the gloves towards short fine leg. The batters get a quick single. 11.4 overs (0 Run) On middle, pushed away towards wide mid on. 11.3 overs (2 Runs) Ashwin gives it a bit more air and bowls it around off. Shepherd gets an outside edge past short third man for a couple of runs. 11.2 overs (0 Run) Quicker, darted into middle. Romario Shepherd manages to keep it out. 11.1 overs (1 Run) Flatter delivery, around off. Markram moves leg side and cuts it through covers for just another single. 10.6 overs (0 Run) Sliding into middle and leg, nudged away towards mid-wicket. 10.5 overs (1 Run) Shorter and quicker, on off. Aiden Markram makes room and slaps it to deep cover for a single. 10.4 overs (0 Run) This is pushed through on middle. Markram defends it out off the front foot. 10.3 overs (1 Run) Around middle, swept away in front of square on the leg side for a single. Romario Shepherd is the new man in. 10.2 overs (0 Run) OUT! TAKEN! Yuzvendra Chahal and Rajasthan running riot here! At this point, Abdul Samad just has to go for it but he holes out. This is tossed up, on a length and around leg stump. Samad skips down the track and launches it high in the air towards the cow corner fence. Riyan Parag runs around from deep mid-wicket and takes a good running catch. Chahal gets his second wicket and Hyderabad reeling at the moment. 10.1 overs (1 Run) Quicker one, sliding into middle and leg. Markram makes room and cuts it hard towards sweeper cover for one.","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637841900336168726.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Lowest IPL powerplay score: List of lowest powerplay score in IPL","link":"https://thesportsrush.com/cricket-news-lowest-ipl-powerplay-score-list-of-lowest-powerplay-score-in-ipl/","keywords":["Cricket","IPL 2022","Rajasthan Royals","Sunrisers Hyderabad","Indian Premier League","rajasthan royals","RR","SRH"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Lowest IPL powerplay score: Sunrisers Hyderabad have scored their lowest ever powerplay score at the MCA Stadium tonight. During the fifth match of the ongoing 15th season of the Indian Premier League between Sunrisers Hyderabad and Rajasthan Royals in Pune, Sunrisers Hyderabad kick-started their innings in a shambolic and uninspiring manner. Chasing a formidable 211-run… The post Lowest IPL powerplay score: List of lowest powerplay score in IPL appeared first on The SportsRush.","content":"Lowest IPL powerplay score: Sunrisers Hyderabad have scored their lowest ever powerplay score at the MCA Stadium tonight. During the fifth match of the ongoing 15th season of the Indian Premier League between Sunrisers Hyderabad and Rajasthan Royals in Pune, Sunrisers Hyderabad kick-started their innings in a shambolic and uninspiring manner. Chasing a formidable 211-run target in their season opener, Sunrisers’ top-order was found wanting against the pace and swing of Trent Boult and Prasidh Krishna to look clueless and unprepared in the middle. Royals, whose dangerous bowling attack had already been the talk of the town, put on display instant results to force batters into leaving deliveries when they were actually required to score in excess of 10 runs per over. While Krishna’s outgoing delivery took the edge of SRH captain Kane Williamson’s (2) bat in the second over, the right-arm bowler bowled a similar delivery to dismiss Rahul Tripathi (0) in his following over. ALSO READ: Highest successful Indian Premier League run chases Hyderabad wicket-keeper batter Nicholas Pooran (0) was the next batter to depart as he failed to score a run despite playing eight deliveries. Looking to play each ball across the line, Pooran was found wanting in front of the stumps after he aimed at flicking a fuller and straight Boult delivery. Opening the batting with Williamson, Abhishek Sharma (9) struggled visibly to not even managing to get bat on ball at the Maharashtra Cricket Association Stadium tonight Lowest IPL powerplay score As a result, all SRH could score in the power play was 14/3. In what was Sunrisers’ lowest score in the powerplay, they have joint Rajasthan Royals (14/2) in scoring just 14 runs in the first six overs. Power-played. #HallaBol | #TATAIPL2022 | #SRHvRR pic.twitter.com/goKUUpMO7k — Rajasthan Royals (@rajasthanroyals) March 29, 2022 Team Score Opposition Year SRH 14/3 RR 2022 RR 14/2 RCB 2009 CSK 15/2 KKR 2011 CSK 16/1 DD 2015 CSK 16/1 RCB 2019 The post Lowest IPL powerplay score: List of lowest powerplay score in IPL appeared first on The SportsRush.","pubDate":"2022-03-29 17:03:43","full_description":"Lowest IPL powerplay score: Sunrisers Hyderabad have scored their lowest ever powerplay score at the MCA Stadium tonight. During the fifth match of the ongoing 15th season of the Indian Premier League between Sunrisers Hyderabad and Rajasthan Royals in Pune, Sunrisers Hyderabad kick-started their innings in a shambolic and uninspiring manner. Chasing a formidable 211-run target in their season opener, Sunrisers’ top-order was found wanting against the pace and swing of Trent Boult and Prasidh Krishna to look clueless and unprepared in the middle. Royals, whose dangerous bowling attack had already been the talk of the town, put on display instant results to force batters into leaving deliveries when they were actually required to score in excess of 10 runs per over. While Krishna’s outgoing delivery took the edge of SRH captain Kane Williamson’s (2) bat in the second over, the right-arm bowler bowled a similar delivery to dismiss Rahul Tripathi (0) in his following over. ALSO READ: Highest successful Indian Premier League run chases Hyderabad wicket-keeper batter Nicholas Pooran (0) was the next batter to depart as he failed to score a run despite playing eight deliveries. Looking to play each ball across the line, Pooran was found wanting in front of the stumps after he aimed at flicking a fuller and straight Boult delivery. Opening the batting with Williamson, Abhishek Sharma (9) struggled visibly to not even managing to get bat on ball at the Maharashtra Cricket Association Stadium tonight As a result, all SRH could score in the power play was 14/3. In what was Sunrisers’ lowest score in the powerplay, they have joint Rajasthan Royals (14/2) in scoring just 14 runs in the first six overs. Power-played. 🔥 #HallaBol | #TATAIPL2022 | #SRHvRR pic.twitter.com/goKUUpMO7k — Rajasthan Royals (@rajasthanroyals) March 29, 2022","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Thorpe appointed head coach of Afghanistan","link":"https://sportstar.thehindu.com/cricket/graham-thorpe-appointed-head-coach-of-afghanistan-cricket-news/article38463703.ece","keywords":null,"creator":["Reuters"],"video_url":null,"description":"Former England batter Graham Thorpe has been named head coach of the Afghanistan senior men's team, the country's cricket board (ACB) announced on Tuesday.","content":null,"pubDate":"2022-03-29 16:43:14","full_description":"Former England batter Graham Thorpe has been named head coach of the Afghanistan senior men's team, the country's cricket board (ACB) announced on Tuesday. Thorpe, who played 100 test matches for England between 1993-2005, stepped down as England batting coach in February, following its 4-0 Ashes defeat by Australia. Warne will continue to live in our hearts - Tendulkar The 52-year-old was among a number of departures from the England set-up, including head coach Chris Silverwood and managing director Ashley Giles, and faced criticism for several batting collapses by the team in Australia. Thorpe will be replacing South African Lance Klusener, who left the Afghanistan role in November last year. \"The ACB had launched the recruitment process for hiring a new head coach, through which Graham Thorpe was selected as the best available nominee for the position,\" the board said in a statement. \"He will step up into the role of head coach ahead of the upcoming international events of Afghanistan.\"","image_url":null,"source_id":"sportstar","country":["india"],"category":["sports"],"language":"english"},{"title":"Sunrisers Hyderabad vs Rajasthan Royals Live Score Ball by Ball, IPL 2022 Live Cricket Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/sunrisers-hyderabad-vs-rajasthan-royals-live-score-over-match-5-t20-6-10-updates-2850933","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Sunrisers Hyderabad vs Rajasthan Royals from Maharashtra Cricket Association Stadium, Pune. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-03-29 16:40:09","full_description":"A dedicated team of experts bring you live score, live cricket score, live match update on Sports.NDTV.com . After 10.2 overs, Sunrisers Hyderabad, chasing a target of 211, are 37/5. The live updates of Sunrisers Hyderabad vs Rajasthan Royals scorecard is also available. It is the perfect platform to follow your favourite teams in Indian Premier League 2022. Keep a track on your favourite batsmen and bowlers through Indian Premier League 2022 today match, ball by ball commentary, Sunrisers Hyderabad vs Rajasthan Royals, Sunrisers Hyderabad vs Rajasthan Royals live score, Sunrisers Hyderabad vs Rajasthan Royals scorecard. Follow the excitement of the Indian Premier League 2022 on Sports.NDTV.com as you can follow live match updates and live cricket score through our platform. 9.6 overs (1 Run) 1 run. 9.5 overs (1 Run) It is a carrom ball, on off. Samad pushes it to mid off for a quick single. 9.4 overs (1 Run) Tossed up, on off. Markram pushes it to long off for a single. 9.3 overs (0 Run) Outside off, Markram pushes it to cover. 9.2 overs (1 Run) A quick single, could've been a risky one! On off, Samad pushes it to cover for a quick single. The fielder throws it to the keeper who clips the bails off and questions the square leg umpire. The umpire takes it upstairs to confirm. The replays show the batters was inside the crease. 9.1 overs (0 Run) On off, blocked back to the bowler on the front foot. 8.6 overs (1 Run) A single now as this is worked to long on. 8.5 overs (1 Run) Fuller, on the pads. Aiden Markram clips it to mid-wicket for a quick single. 8.4 overs (0 Run) Fuller, on middle and leg. Aiden Markram flicks it to short fine leg. 8.3 overs (1 Run) On the pads, Abdul Samad tucks it to mid-wicket for a single. Strategic Time-Out! Well, with 182 required to win off just 70 balls and 4 wickets back in the hut, Hyderabad will need a miracle of gigantic proportions to win the match. The pitch always had something in it for the pacers and Trent Boult and especially Prasidh Krishna have been able to take full advantage of it. They have rocked the Hyderabad top order and Yuzvendra Chahal too has picked up a wicket. Kane Williamson and his fellow batters have failed miserably so far and with the pressure on getting higher, they might just fall like nine pins here. Also, Abdul Samad walks in to bat next. 8.2 overs (0 Run) OUT! CAUGHT! Who said this pitch does not support the spinners? Yuzvendra Chahal surely has a magical arm. It is looped up, around off. Abhishek Sharma comes down the track and lofts it towards long on. He does not middle it and does not get the desired distance on it. Shimron Hetmyer settles under the ball and takes the simplest of catches to put Hyderabad in a spot of bother. 8.1 overs (1 Run) On the stumps. Aiden Markram pushes it to cover for a single. 7.6 overs (4 Runs) FOUR! Abhishek Sharma needs more of this! It is a full toss, outside off. Abhishek Sharma slaps it down the ground towards long off. Riyan Parag coves a lot of ground to his left but fails to stop it cleanly, as it rolls into the ropes. 7.5 overs (1 Run) On off, Markram hits it to long off for a single. 7.4 overs (0 Run) Short on the fifth stump. Aiden Markram cuts it to cover on the back foot. 7.3 overs (0 Run) Tossed up, around middle and leg. Aiden Markram defends it to the right of the bowler. 7.2 overs (1 Run) Fuller, on the stumps. Abhishek Sharma eases it to long off for a single. 7.1 overs (1 Run) On the pads. Aiden Markram tucks it to mid-wicket with soft hands for a single. Ravichandran Ashwin to have a bowl now. 6.6 overs (1 Run) A length ball, around middle and off. Aiden Markram works it into cover off the leading edge. They take one. 6.5 overs (4 Runs) FOUR! A much-needed boundary for Hyderabad. A short ball, outside off. Aiden Markram pulls it through the gap at mid-wicket for a boundary. 6.4 overs (0 Run) Full, outside off. Aiden Markram drives it to mid off. 6.4 overs (1 Run) WIDE! That is some take by Samson behind the sticks! A length ball, sliding down leg. It flies off the deck. Aiden Markram misses his flick. Sanju Samson dives to his left and pouches the ball brilliantly. Wide called. 6.3 overs (0 Run) An outswinging delivery, full and outside off. Aiden Markram leans in and drives it to cover. Unable to find the gap though. 6.2 overs (0 Run) Short ball, outside off, shaping away. Aiden Markram shuffles across and blocks it out watchfully. 6.1 overs (1 Run) Length ball, on the pads. Sharma flicks it to mid-wicket and gets across for a quick single. First change in the bowling as Nathan Coulter-Nile comes on to bowl. 5.6 overs (0 Run) BEATEN! Prasidh Krishna has given only 2 runs in 3 overs with 2 wickets to his name. A dream debut for him with Rajasthan. It is on a length, outside off. Aiden Markram looks to defend it out but gets beaten on the outside edge. Hyderabad are 14/3 at the end of Powerplay. 5.5 overs (1 Run) Length ball, on the stumps. Abhishek Sharma guides it towards backward point for a single. 5.4 overs (0 Run) Huge swing and a miss! The amount of bounce that Prasidh Krishna is able to extract is unreal. Good length, angled across the batter. It flies off the deck. Abhishek Sharma tries to hook it away on the back foot but misses it completely. 5.3 overs (0 Run) A length ball, on middle and leg, climbing up off the deck. Abhishek Sharma blocks it back to the bowler. 5.2 overs (0 Run) A short ball, angled across the left hander. Abhishek Sharma leaves it alone for the keeper. 5.1 overs (0 Run) A length ball, angled down the leg side. Abhishek Sharma tries to flick it away. It goes to the keeper off the thigh pad.","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637841886013666497.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL 2022, SRH vs RR Live Score Updates: Hyderabad Top-Order In Disarray, Prasidh Krishna, Trent Boult On Fire - NDTV Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMigQFodHRwczovL3Nwb3J0cy5uZHR2LmNvbS9pcGwtMjAyMi9pcGwtMjAyMi1zcmgtdnMtcnItbGl2ZS1zY29yZS11cGRhdGVzLXN1bnJpc2Vycy1oeWRlcmFiYWQtdnMtcmFqYXN0aGFuLXJveWFscy1saXZlLXNjb3JlLTI4NTAyNzjSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"IPL 2022, SRH vs RR Live Score Updates: Hyderabad Top-Order In Disarray, Prasidh Krishna, Trent Boult On Fire  NDTV SportsSRH vs RR, IPL 2022 stats: Head-to-head to record, players to watch out for  SportstarMatch Preview - Royals vs Sunrisers, Indian Premier League 2022, 5th Match  ESPNcricinfoSRH vs RR Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update- Tata IPL 2022  Cricket AddictorSRH vs RR Live Score, IPL 2022: Prasidh Krishna scalps Rahul Tripathi, Kane Williamson early  Times of IndiaView Full coverage on Google News","content":null,"pubDate":"2022-03-29 16:35:25","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Warne to be given epic farewell at MCG","link":"https://www.perthnow.com.au/sport/cricket/warne-to-be-given-epic-farewell-at-mcg-c-6254545","keywords":null,"creator":["Oliver Caffrey and Melissa Woods"],"video_url":null,"description":"Shane Warne's farewell at the MCG is set to be one of the highest-attended memorial services in Australian history in fashion befitting of the cricket legend.","content":null,"pubDate":"2022-03-29 16:33:13","full_description":"Shane Warne, one of Melbourne's biggest personalities, will be given one of the grandest farewells the city has ever seen. Almost four weeks since the cricket legend's death in Thailand, a memorial service at the MCG on Wednesday will be attended by up to 65,000 people. It will be a celebration like no other as celebrities and the Victorian public pay tribute to a larger-than-life character who transcended sport. With 50,000 seats already taken, another 10,000-15,000 tickets have been released to ensure it becomes one of the biggest memorial services in Australian history. An estimated 300,000 mourners turned out for General Sir John Monash's farewell in 1931, while more than 100,000 people lined the streets of Melbourne for long-serving Prime Minister Sir Robert Menzies' funeral in 1978. But this service will be as unique as Warne himself. A number of international stars, including Elton John, Chris Martin, Robbie Williams and Ed Sheeran will perform remotely, while Australian rocker Jon Stevens will front a band playing some of Warne's favourite INXS and Noiseworks songs. Iconic Australians Russell Crowe, Hugh Jackman, Kylie and Dannii Minogue, James Packer, Eric Bana, Greg Norman, as well as American surfing legend Kelly Slater, will also pay tribute to arguably the country's greatest-ever cricketer after Don Bradman. Great mate Aaron Hamill, who played 98 AFL games for Warne's beloved St Kilda, is confident the send-off will capture the larrikin's spirit. \"He'd be bloody shattered he's missed it,\" Hamill said. \"I know that - this sort of shindig would be right up his alley, particularly in Melbourne. \"I know he'd be really humbled, he'd be really proud to get the recognition, he never seeked it but he'd certainly be sitting up there, with probably a dart (cigarette) in hand, and very grateful. \"He often used to talk about seizing the moment and the opportunity and there is no fear within. And that's really how he attacked life.\" Four out of Australia's five free-to-air TV networks will broadcast the service, while Fox Sports have dedicated four of their channels to broadcast Warne content in the lead-up to the event. Warne's three children - Brooke, Summer and Jackson - his father Keith and brother Jason will also speak while the Shane Warne Stand, formerly known as the Great Southern Stand, will be formally unveiled. The two-hour event will get underway at 7pm AEDT.","image_url":"https://images.perthnow.com.au/publication/C-6254545/4759e5f3c2e98bb7b2cdf69f7befecf24db8fb42-16x9-x0y0w1280h720.jpg","source_id":"perthnow","country":["australia"],"category":["sports"],"language":"english"},{"title":"Warne to be given epic farewell at MCG","link":"https://thewest.com.au/sport/cricket/warne-to-be-given-epic-farewell-at-mcg-c-6254538","keywords":null,"creator":["Oliver Caffrey and Melissa Woods"],"video_url":null,"description":"Shane Warne's farewell at the MCG is set to be one of the highest-attended memorial services in Australian history in fashion befitting of the cricket legend.","content":null,"pubDate":"2022-03-29 16:33:03","full_description":"Shane Warne, one of Melbourne's biggest personalities, will be given one of the grandest farewells the city has ever seen. Almost four weeks since the cricket legend's death in Thailand, a memorial service at the MCG on Wednesday will be attended by up to 65,000 people. It will be a celebration like no other as celebrities and the Victorian public pay tribute to a larger-than-life character who transcended sport. With 50,000 seats already taken, another 10,000-15,000 tickets have been released to ensure it becomes one of the biggest memorial services in Australian history. An estimated 300,000 mourners turned out for General Sir John Monash's farewell in 1931, while more than 100,000 people lined the streets of Melbourne for long-serving Prime Minister Sir Robert Menzies' funeral in 1978. Don't miss the latest sports news! Was $13 now $7 per week for 12 weeks* (Digital + Print) Enjoy unlimited access to thewest.com.au and everyday digital editions on any device. Thursday - Monday papers home delivered with all of the latest footy news! But this service will be as unique as Warne himself. A number of international stars, including Elton John, Chris Martin, Robbie Williams and Ed Sheeran will perform remotely, while Australian rocker Jon Stevens will front a band playing some of Warne's favourite INXS and Noiseworks songs. Iconic Australians Russell Crowe, Hugh Jackman, Kylie and Dannii Minogue, James Packer, Eric Bana, Greg Norman, as well as American surfing legend Kelly Slater, will also pay tribute to arguably the country's greatest-ever cricketer after Don Bradman. Great mate Aaron Hamill, who played 98 AFL games for Warne's beloved St Kilda, is confident the send-off will capture the larrikin's spirit. \"He'd be bloody shattered he's missed it,\" Hamill said. \"I know that - this sort of shindig would be right up his alley, particularly in Melbourne. \"I know he'd be really humbled, he'd be really proud to get the recognition, he never seeked it but he'd certainly be sitting up there, with probably a dart (cigarette) in hand, and very grateful. \"He often used to talk about seizing the moment and the opportunity and there is no fear within. And that's really how he attacked life.\" Four out of Australia's five free-to-air TV networks will broadcast the service, while Fox Sports have dedicated four of their channels to broadcast Warne content in the lead-up to the event. Warne's three children - Brooke, Summer and Jackson - his father Keith and brother Jason will also speak while the Shane Warne Stand, formerly known as the Great Southern Stand, will be formally unveiled. The two-hour event will get underway at 7pm AEDT.","image_url":"https://images.thewest.com.au/publication/C-6254538/4759e5f3c2e98bb7b2cdf69f7befecf24db8fb42-16x9-x0y0w1280h720.jpg","source_id":"thewest","country":["australia"],"category":["sports"],"language":"english"},{"title":"Sunrisers Hyderabad vs Rajasthan Royals Live Score Ball by Ball, IPL 2022 Live Cricket Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/sunrisers-hyderabad-vs-rajasthan-royals-live-score-over-match-5-t20-1-5-updates-2850860","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Sunrisers Hyderabad vs Rajasthan Royals from Maharashtra Cricket Association Stadium, Pune. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-03-29 16:09:47","full_description":"A dedicated team of experts bring you live score, live cricket score, live match update on Sports.NDTV.com . After 5.3 overs, Sunrisers Hyderabad, chasing a target of 211, are 13/3. The live updates of Sunrisers Hyderabad vs Rajasthan Royals scorecard is also available. It is the perfect platform to follow your favourite teams in Indian Premier League 2022. Keep a track on your favourite batsmen and bowlers through Indian Premier League 2022 today match, ball by ball commentary, Sunrisers Hyderabad vs Rajasthan Royals, Sunrisers Hyderabad vs Rajasthan Royals live score, Sunrisers Hyderabad vs Rajasthan Royals scorecard. Follow the excitement of the Indian Premier League 2022 on Sports.NDTV.com as you can follow live match updates and live cricket score through our platform. 4.6 overs (4 Runs) Four! Aiden Markram is the new man in. 4.5 overs (0 Run) OUT! LBW! Three of the biggest names in the Hyderabad batting line up are back in the hut! Trent Boult kept of taking it away from the left-hander but now goes a bit fuller and angles it on the pads. Nicholas Pooran looks to work it leg side but misses and gets pinged on the pads. There is a huge appeal from the bowler and the finger is raised. This seems to be pretty plumb and that's why Pooran doesn't even review it. The replay shows that it was crashing into leg stump. Hyderabad almost out of the contest inside the Powerplay itself! 4.4 overs (0 Run) Nicholas Pooran is just looking to play one way and Trent Boult is taking advantage of it. Length, around off, Pooran swings across the line again and misses yet again. 4.4 overs (1 Run) WIDE! Boult angles this one down leg. Pooran looks to pick it off his hips but misses and a wide is called. 4.3 overs (0 Run) Another swing and a miss! Pitched up, around off and there's a hint of movement again. Pooran slogs across the line and doesn't connect. 4.2 overs (0 Run) There's swing in the air and Nicholas Pooran looks to swing across the line. Full, around off and shaping away. Pooran goes for the big hoick leg side but gets comprehensively beaten 4.1 overs (1 Run) Drifted onto the pads, tucked away towards square leg for a quick single. 3.6 overs (0 Run) A wicket-maiden from Prasidh Krishna! How often do we see that in a T20 match? Fuller in length, around middle. Pooran looks to work it leg side but only pushes it towards the bowler. 3.5 overs (0 Run) Length again, going across off stump. Nicholas Pooran leaves it alone. 3.4 overs (0 Run) Not sure how one will play at that delivery! Scrambled seam this time fro Krishna, angled across off. Pooran looks to drive but has to pull out as the ball straightens and gets beaten past the outside edge. 3.3 overs (0 Run) On middle this time, Pooran blocks it out. 3.2 overs (0 Run) Excellent again from Prasidh Krishna! On a good length, around off and zipping off the surface. Pooran doesn't play at it. Nicholas Pooran comes in at number 4. 3.1 overs (0 Run) OUT! CAUGHT BEHIND! A jaffa from Prasidh Krishna and he is getting the ball to talk! Krishna hits the length hard, at around 137 clicks and bowls it on the fifth stump line. Rahul Tripathi hangs back and looks to cut but the ball just shoots up off the surface, taking the batter by surprise and Tripathi can do nothing. The ball takes the outside edge and Sanju Samson takes a sharp catch behind the sticks. Rajasthan off to a perfect start with the ball and another big fish departs. 2.6 overs (0 Run) Around the top of off and just nipping back in sharply. Abhishek Sharma almost gets cut in half. 2.5 overs (4 Runs) FOUR LEG BYES! Trent Boult errs in length and Hyderabad get a much-needed boundary. Full and down leg, Sharma misses the flick. The ball goes off the pads and runs away fine, past the keeper and into the fine leg fence. 2.4 overs (0 Run) The dot balls keep piling up! Good-length, outside off and swinging further away. Abhishek Sharma has a slash at it but doesn't connect. 2.3 overs (0 Run) Boult goes a bit fuller and angles it into middle. Sharma blocks it out. 2.2 overs (0 Run) Around off, nudged towards point. Hyderabad need to get going here because the run rate is shooting up every ball. 2.1 overs (0 Run) Swing and lots of it! Full and wide, Sharma looks to cover drive but the ball spaes away a long way. 1.6 overs (0 Run) A sharp bouncer, on middle and leg. Rahul Tripathi dances down the track but leaves it alone in the end. A wicket-taking over by Prasidh Krishna comes to end. A delightful start with the ball for him. His first time in Rajasthan colors. 1.5 overs (0 Run) On a good length, around off. Tripathi looks to push at it but misses. 1.4 overs (0 Run) OUT! CAUGHT! Kane Williamson doesn't seem happy with it and reckons the ball has bounced in front of the field but he has to depart. Brilliant catch though from Devdutt Padikkal at first slip. A length ball, around the top of off. Williamson gets pushed onto the back foot as he looks to push it out. He plays at it with hard hands and gets the outside edge. Sanju Samson springs to his right and gets it off the gloves. Padikkal is alive to the situation and dives in front to take the catch. The decision is sent upstairs and the soft signal is out. It is a tough one but the third umpire has no conclusive evidence that the ball has bounced before getting pouched. Prasidh Krishna has the big fish. Rahul Tripathi is the new man in. Is that a clean catch? The umpires converge and take it upstairs to confirm. After several replays the third umpire is satisfied that Devdutt Padikkal had his fingers underneath the ball, so Kane Williamson does have to walk off. 1.3 overs (1 Run) On a good length, around off and there's a bit of an extra bouncer. Sharma guides it nicely towards third man for a single and gets off the mark as well. 1.2 overs (0 Run) Short and wide, there to be hit but just out of reach. Krishna bowls it a bit shorter and the ball moves away from the batter. Sharma looks to slap it away but misses. 1.1 overs (0 Run) Pitched up, around off. Abhishek Sharma stands tall and drives it firmly towards short cover. It is Prasidh Krishna to share the new ball from the other end. 0.6 over (0 Run) Another dot to end the first over and just 2 runs come off it. A bit fuller and wide, Williamson looks to drive away from the body but misses. 0.5 over (0 Run) Fuller in length, around off. This is blocked off the front foot. 0.4 over (0 Run) Boult with another perfect delivery, bowled into the channel around off and on a nagging length. Williamson plays inside the line of the ball again. 0.3 over (2 Runs) Another in-swinger, this time on the pads. Kane Williamson gets off the mark with a tuck towards deep square as he picks up a couple of runs. 0.2 over (0 Run) Beaten! Boult pitches it up a bit, on off and this one holds its line. Williamson plays inside the line of the ball and gets beaten past the outside edge. Lovely start from Trent Boult. 0.1 over (0 Run) Boult starts off with a lovely in-dipper! Length, on off and shaping back in beautifully, Kane Williamson gets cut it half as he tries to block and misses. The ball hits him high on the back leg and Boult appeals. The appeal is quickly turned down, maybe just too high.","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637841867785954874.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"RCB vs KKR Head to Head in IPL history | Royal Challengers Bangalore vs Kolkata Knight Riders records | IPL 2022 Match 6","link":"https://thesportsrush.com/cricket-news-rcb-vs-kkr-head-to-head-in-ipl-history-royal-challengers-bangalore-vs-kolkata-knight-riders-records-ipl-2022-match-6/","keywords":["Cricket","IPL 2022","KKR","RCB","Indian Premier League","Kolkata Knight riders","Royal Challengers Bangalore"],"creator":["Dixit Bhargav"],"video_url":null,"description":"RCB vs KKR Head to Head Record: The SportsRush presents for you the Head to Head statistics for IPL 2022 Match 6. The sixth match of the ongoing 15th season of the Indian Premier League will be played between Royal Challengers Bangalore and Kolkata Knight Riders at the Dr DY Patil Sports Academy tomorrow. While… The post RCB vs KKR Head to Head in IPL history | Royal Challengers Bangalore vs Kolkata Knight Riders records | IPL 2022 Match 6 appeared first on The SportsRush.","content":"RCB vs KKR Head to Head Record: The SportsRush presents for you the Head to Head statistics for IPL 2022 Match 6. The sixth match of the ongoing 15th season of the Indian Premier League will be played between Royal Challengers Bangalore and Kolkata Knight Riders at the Dr DY Patil Sports Academy tomorrow. While Royal Challengers had ended up on the losing side of their season opener against Punjab Kings, Knight Riders had managed to stage a victory against defending champions Chennai Super Kings on Saturday. RCB, who have won three out of their last five T20s against KKR, don’t have the overall backing of numbers with them. Keen to find their maiden IPL 2022 victory, RCB would be playing only their fourth match (one win and two losses till now) at this venue. Kolkata, who had played a couple of matches in Navi Mumbai over a decade ago, are yet to lose a match here. Having also won their last two matches against Bangalore, Kolkata have all the reasons to believe that they will be able to win their second match in a row. RCB vs KKR Head to Head in IPL history Total number of matches played: 30 Matches won by RCB: 13 Matches won by KKR: 17 Matches played in March: 1 (RCB 0, KKR 1) Matches played in India: 23 (RCB 9, KKR 14) Matches played at DY Patil Cricket Academy: 0 (RCB 0, KKR 0) RCB average score against KKR: 149 KKR average score against RCB: 156 Most runs for RCB: 774 (Virat Kohli) Most runs for KKR: 339 (Andre Russell) Most wickets for RCB: 8 (Mohammed Siraj) Most wickets for KKR: 20 (Sunil Narine) Most catches for RCB: 15 (Virat Kohli) Most catches for KKR: 4 (Andre Russell) Spin Kings in ! ️@chakaravarthy29 #SunilNarine #KKRHaiTaiyaar #IPL2022 pic.twitter.com/KrgFcHCUSu — KolkataKnightRiders (@KKRiders) March 29, 2022 The last Royal Challengers vs Knight Riders match was IPL 2021 Eliminator in Sharjah. Although not as convincingly as they would’ve wanted it to be, KKR had manage to seal a 139-run chase in the last over. NOTE: Only players part of current squads have been considered above (most runs, wickets and catches). The post RCB vs KKR Head to Head in IPL history | Royal Challengers Bangalore vs Kolkata Knight Riders records | IPL 2022 Match 6 appeared first on The SportsRush.","pubDate":"2022-03-29 15:47:51","full_description":"RCB vs KKR Head to Head Record: The SportsRush presents for you the Head to Head statistics for IPL 2022 Match 6. The sixth match of the ongoing 15th season of the Indian Premier League will be played between Royal Challengers Bangalore and Kolkata Knight Riders at the Dr DY Patil Sports Academy tomorrow. While Royal Challengers had ended up on the losing side of their season opener against Punjab Kings, Knight Riders had managed to stage a victory against defending champions Chennai Super Kings on Saturday. RCB, who have won three out of their last five T20s against KKR, don’t have the overall backing of numbers with them. Keen to find their maiden IPL 2022 victory, RCB would be playing only their fourth match (one win and two losses till now) at this venue. Kolkata, who had played a couple of matches in Navi Mumbai over a decade ago, are yet to lose a match here. Having also won their last two matches against Bangalore, Kolkata have all the reasons to believe that they will be able to win their second match in a row. Total number of matches played: 30 Matches won by RCB: 13 Matches won by KKR: 17 Matches played in March: 1 (RCB 0, KKR 1) Matches played in India: 23 (RCB 9, KKR 14) Matches played at DY Patil Cricket Academy: 0 (RCB 0, KKR 0) RCB average score against KKR: 149 KKR average score against RCB: 156 Most runs for RCB: 774 (Virat Kohli) Most runs for KKR: 339 (Andre Russell) Most wickets for RCB: 8 (Mohammed Siraj) Most wickets for KKR: 20 (Sunil Narine) Most catches for RCB: 15 (Virat Kohli) Most catches for KKR: 4 (Andre Russell) Spin Kings in ! ️ @chakaravarthy29 #SunilNarine #KKRHaiTaiyaar #IPL2022 pic.twitter.com/KrgFcHCUSu — KolkataKnightRiders (@KKRiders) March 29, 2022 The last Royal Challengers vs Knight Riders match was IPL 2021 Eliminator in Sharjah. Although not as convincingly as they would’ve wanted it to be, KKR had manage to seal a 139-run chase in the last over. NOTE: Only players part of current squads have been considered above (most runs, wickets and catches).","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Sunrisers Hyderabad vs Rajasthan Royals: IPL 2022 Live Cricket Score, Live Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/sunrisers-hyderabad-vs-rajasthan-royals-live-score-over-match-5-t20-16-20-updates-2850769","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Sunrisers Hyderabad vs Rajasthan Royals from Maharashtra Cricket Association Stadium, Pune. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-03-29 15:40:06","full_description":"A dedicated team of experts bring you live score, live cricket score, live match update on Sports.NDTV.com . After 20.0 overs, Rajasthan Royals are 210/6. The live updates of Sunrisers Hyderabad vs Rajasthan Royals scorecard is also available. It is the perfect platform to follow your favourite teams in Indian Premier League 2022. Keep a track on your favourite batsmen and bowlers through Indian Premier League 2022 today match, ball by ball commentary, Sunrisers Hyderabad vs Rajasthan Royals, Sunrisers Hyderabad vs Rajasthan Royals live score, Sunrisers Hyderabad vs Rajasthan Royals scorecard. Follow the excitement of the Indian Premier League 2022 on Sports.NDTV.com as you can follow live match updates and live cricket score through our platform. ... The Run Chase ... Right then. Hyderabad batters have their task cut out. There are some new names in the side with some young guns who shined at the fag end during the last outing. Nonetheless they need to bat out of their skins against a well balanced bowling line-up of Rajasthan. An enticing chase coming your way. Do not go anywhere. Devdutt Padikkal says that it was a first-time experience in the Indian T20 League to bat at number 4 but it was a pleasant one and he enjoyed it. Adds that it's been amazing with the new franchise and he gets treated like family. Mentions that there is something for the bowlers on this pitch and they batted exceptionally well tonight. Ends by saying that their bowlers can defend the total and just have to bowl in the right areas. We knew this was going to be a batters paradise but the way Bhuvneshwar Kumar started with the new ball, it could've gone either way. Although, it did not go in the favour of the bowlers, as they were taken to the cleaners. Umran Malik though made a sharp comeback after leaking 21 runs if his first over and ended his night with two wickets. He managed to break the highest ever third-wicket stand scored by Rajasthan against Hyderabad by getting the better of Devdutt Padikkal. It was not a pleasant day with the ball for T Natarajan early on, but he did took two scalps in the final over. WOW! This Rajasthan batting performance has left me speechless! Well, they surely lived up to the expectations. The top-order of this side is capable of taking the game away from the opposition and that was on display this evening. It was not an ideal start for Rajasthan with a drama-filled first over and a cautious start by Buttler did not make it any easy for him. Jos Buttler though made the most of reprieve eventually. The opening stand set up a solid platform. Even though both perished in quick succession. Later, Samson and Padikkal notched up stand worth 73 runs off just 41 deliveries and they kept the run rate hovering around 10 before slipping out. In the end, Shimron Hetmyer and Riyan Parag stepped on the gas from the word go and managed to take the score above the 200-run mark. Rajasthan did manage to turn up the heat in Pune. The tone has been set for this venue and surely, the rest of the teams would be taking some notes from this innings. Things could've been different for Hyderabad if Kumar hadn't stepped over the line when he got the better of Buttler on a duck. 19.6 overs (0 Run) OUT! CAUGHT BEHIND! A wicket to end the innings! Riyan Parag doesn't review and this means that there is bat involved but what a brilliant catch from Nicholas Pooran! T Natarajan looks for the toe-crushing yorker but spills it down the leg side. Parag looks to flick and gets a slight tickle on it. Pooran dives full stretch to his left and takes an amazing low catch. Natrajan gets his second wicket of the over and Rajasthan finish with a 210/6! 19.5 overs (1 Run) This is full and on off, pushed down to long off for a single. 19.4 overs (1 Run) Around leg again, Parag flicks it towards deep mid-wicket and settles for a single. 19.3 overs (1 Run) Leg bye! Around leg stump, Coulter-Nile fails to get it away. The ball hits the pads and goes nowhere but they are able to scamper through for a leg bye. 19.2 overs (0 Run) OUT! Cleaned up! T Natarajan has the last laugh but Shimron Hetmyer has done his job. Cross seam from Natarajan this time, very full and angled into middle and leg. Hetmyer makes room and looks to smoke it over mid-wicket but the ball sneaks under his willow. The ball then castles into middle and leg and Natarajan is elated. Perfect yorker from him this time! Nathan Coulter-Nile is the new batter in. 19.1 overs (4 Runs) FOUR! Skillful from Shimron Hetmyer and he is toying with the bowlers now. Full and straight, Hetmyer shuffles and picks it right off the base of middle stump and scoops it over short fine leg for a boundary. 18.6 overs (1 Run) Full and wide, driven towards deep cover for a single. 18.5 overs (0 Run) Gets the wide yorker in now does Kumar. Hetmyer can't get it through covers. 18.4 overs (6 Runs) SIX! Back-to-back maximums! Length this time, around off. Hetmyer powers it flat-bat style over the wide long on fence for another biggie. The 200 is up! 18.3 overs (6 Runs) SIX! The commentators curse at work again. The on-air commentators just discuss that Bhuvi is the only one who hasn't been hit for a maximum tonight and well, now he has. Banged in short, outside off. Shimron Hetmyer hangs deep and launches it over the long off fence. Top shot this! 18.2 overs (1 Run) Good stop from Aiden Markram and it will only be a single. Length this time, a bit slower and wide of off. Parag gets it up and over the extra cover fielder. Markram runs around from long off and saves three runs. 18.1 overs (1 Run) Leg bye! Kumar gets it into the blockhole around leg stump. Hetmyer looks to flick it away but misses. The ball goes off the pads and towards short fine leg. They scamper through for a leg bye. 17.6 overs (1 Run) Full and straight, worked towards deep mid-wicket for one. Rajasthan inching towards the 200-run mark. 17.5 overs (4 Runs) FOUR! Poor fielding from Washington Sundar and it has cost a boundary. Full and wide, Hetmyer creams it through covers. Sundar slides to his right but gets a bit of a bad bounce as well. The ball ends up in the ropes. 17.5 overs (1 Run) WIDE! Full and wide, beyond the tramline and left alone. Wide signalled. 17.4 overs (6 Runs) SIX! Muscled! T Natarajan misses the yorker on off stump and serves a low full toss. Shimron Hetmyer hangs deep in his crease, gets low and smokes it off the toe end of the bat over long on for a biggie. 17.3 overs (1 Run) Full and straight, almost in the blockhole. Parag jams it over the bowler's head for a single. 17.2 overs (4 Runs) FOUR! Sort of a helicopter shot from Riyan Parag and he has nailed it. Low full toss, on the pads, Parag wrists it powerfully between deep mid-wicket and long on for a boundary. 17.1 overs (1 Run) Full and wide, sliced behind point for a single. 16.6 overs (0 Run) Jagging back into middle and leg. Blocked. 16.5 overs (0 Run) Bhuvneshwar Kumar looked excited but Hyderabad lose two reviews in three deliveries! Bhuvneshwar Kumar bowls a length ball, on off and this one nips back in off the surface. Riyan Parag looks to block but misses and the ball goes through the gap between bat and pad. There is a noise once again and the review is taken for a caught behind decision. UltraEdge shows that the ball missed the bat and flicked the thigh pad. The lbw is also checked but Ball Tracker shows that the ball is going over middle stump. 16.4 overs (1 Run) Short of a length, on the body. Hetmyer works it leg side for a single. 16.4 overs (1 Run) A surprise short ball, on leg stump. Hetmyer looks to hook but misses. It's been called a wide but Kane Williamson has gone upstairs for a caught behind appeal. Shimron Hetmyer seems to have missed it on first glance but the third umpire checks the replay. No need for UltraEdge as the ball is well over the dangled willow of Hetmyer. After all that, it is only a WIDE! 16.3 overs (1 Run) Cloe to the off pole, dabbed down towards short third man for a quick single. 16.2 overs (4 Runs) FOUR! What a shot to play first ball! Length, around off. Riyan Parag cover drives it exquisitely and finds the extra cover fence. Riyan Parag comes in at number 6. 16.1 overs (0 Run) OUT! TAKEN! Bhuvneshwar Kumar comes back into the attack and gets the big breakthrough. Good-length ball, over off stump. Sanju Samson looks to pull it down the ground but it isn't short enough. Samson ends up forcing the lofted shot but it is dead straight. Abdul Samad does well to get around quickly from long on and he takes a good running catch. A sensational innings from the skipper comes to an end and Kumar is happy. 15.6 overs (2 Runs) Around the pads, tucked away through square leg for a couple of runs by Hetmyer. 15.5 overs (1 Run) Around off, caressed towards sweeper cover for one. 15.4 overs (6 Runs) SIX! Washington Sundar overcompensates by bowling it short and on the pads. Sanju Samson rocks back and smokes it way, way over the mid-wicket fence. He brings up his fifty as well and what an explosive innings this has been! 15.3 overs (6 Runs) SIX! Humongous hit! Tossed up, on middle. Sanju Samson gets down on one knee and hits it a mile up in the air. The ball clears the cow corner fence with ease and the 150 is up Rajasthan. 15.2 overs (0 Run) Cheeky attempt but in vain. This is angled across off and Sanju Samson goes for the reverse sweep but misses. 15.1 overs (0 Run) Flatter delivery, around off and Samson dabs it down to short third man.","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637841849983044778.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Sunrisers Hyderabad vs Rajasthan Royals Live Score Ball by Ball, IPL 2022 Live Cricket Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/sunrisers-hyderabad-vs-rajasthan-royals-live-score-over-match-5-t20-11-15-updates-2850691","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Sunrisers Hyderabad vs Rajasthan Royals from Maharashtra Cricket Association Stadium, Pune. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-03-29 15:18:06","full_description":"Follow the Indian Premier League 2022 live cricket score on Sports.NDTV.com . After 15.3 overs, Rajasthan Royals are 154/3. Get live score, ball by ball commentary and much more. Keep track of Indian Premier League 2022 today match between Sunrisers Hyderabad and Rajasthan Royals. Everything related to Sunrisers Hyderabad and Rajasthan Royals match will be available on Sports.NDTV.com . Stay updated with Sunrisers Hyderabad vs Rajasthan Royals live score. Do check for Sunrisers Hyderabad vs Rajasthan Royals scorecard. You can get scorecard updates, match related facts. Get quick live updates with ads, Sports.NDTV.com , which is the perfect destination for live cricket score. 14.6 overs (0 Run) OUT! TIMBER! What a beautiful delivery! Umran Malik has the last laugh here. Devdutt Padikkal's valiant knock comes to an end. It is a length ball, outside off. This one skids though. Devdutt Padikkal is caught inside his crease. He ends up playing all around the ball, as it goes through to crash into his stumps. Umran Malik ends his spell of 4 over with two wickets to his name. 14.5 overs (0 Run) Length ball, outside off. Devdutt Padikkal punches it to cover. Kane Williamson is there to protect it. 14.4 overs (1 Run) Full length, outside off. Sanju Samson slashes it to sweeper cover for a single. 14.3 overs (4 Runs) FOUR! Sanju Samson gets into his 40s now with this boundary. It is a race to 50. Who will get there first? Full length, down leg. Sanju Samson stays back and clips it over mid-wicket for a boundary. 14.2 overs (1 Run) Full length, on middle and leg. Devdutt Padikkal offer full face now and lofts it towards long on for a single. 14.1 overs (4 Runs) FOUR! Devdutt Padikkal is into his 40s! This is turning out to be a pacey innings. A short ball, around off. Devdutt Padikkal pulls it through mid-wicket for four. Umran Malik to bowl out here. 13.6 overs (1 Run) Full length, on off. Devdutt Padikkal drives it to long off for a single. 13.5 overs (0 Run) Back of a length, around off. Devdutt Padikkal leans back and leaves it alone. 13.4 overs (4 Runs) FOUR! Devdutt Padikkal only dealing in boundaries at the moment. Full length, angled down leg. Devdutt Padikkal glances it down to fine leg for a boundary. 13.3 overs (2 Runs) A length ball, on the pads. Devdutt Padikkal flicks it to deep square leg for a brace. 13.2 overs (6 Runs) SIX! BANG! Devdutt Padikkal shining on his debut! A picturesque shot, this! It is full, on off. Devdutt Padikkal gets under it and smokes it over the long off fence with good extension of the arms. 13.1 overs (4 Runs) FOUR! The stand moves to 50 now! This is brilliant. It is short, outside off. Devdutt Padikkal stands tall and pulls it to long on for a boundary. 12.6 overs (1 Run) LEG BYE! A length ball, angled in, at 133 clicks. Kills down a pace a bit this time. Devdutt Padikkal tries to flick it away but misses. The ball hits him on his thigh pads and goes to the left of the keeper. Nicholas Pooran races that side and makes a brilliant stop. The batters take a leg bye. 12.6 overs (1 Run) WIDE! Bangs in a short delivery, on leg. Devdutt Padikkal ducks under it. The umpire signals a wide. 12.5 overs (0 Run) Lovely delivery! On a length, outside off. Devdutt Padikkal tries to flirt away from his body but gets beaten by pace this time. 12.4 overs (1 Run) LEG BYE! Fuller, sliding down leg. Sanju Samson fails to flick it away. They cross for a leg bye, as the ball rolls away to fine leg. 12.4 overs (1 Run) WIDE! Short ball, wide outside off. Sanju Samson slashes but misses. Wide called. 12.3 overs (1 Run) A length ball, on the stumps. Devdutt Padikkal makes room and slashes it to deep point. A single now. 12.2 overs (0 Run) Length ball, outside off. Devdutt Padikkal tries to hammer it down the ground but fails to get any bat on it. 12.1 overs (2 Runs) Fuller, outside off. Devdutt Padikkal throws his blade at it. The ball goes to deep point off the outside edge. The batters take two comfortably. 11.6 overs (1 Run) Good length, on middle and leg. Devdutt Padikkal flicks it to mid-wicket for a quick single. He retains the strike. 11.5 overs (4 Runs) FOUR! Cruched! Full length, outside off. Devdutt Padikkal drills it down the ground and bags a boundary at long off. 11.4 overs (1 Run) Another single now! A length ball, on the stumps. Sanju Samson stays back, opens the face of the bat late and gets a single to third man. 11.3 overs (1 Run) Length ball, sliding down the leg side. Devdutt Padikkal tucks it to deep square leg for a singe. 11.2 overs (0 Run) A sharp bouncer now. Devdutt Padikkal ducks under it. 11.1 overs (6 Runs) SIX! BOOM! Devdutt Padikkal joins the party now. It is a short ball, outside off. Devdutt Padikkal stays back and smokes it over the mid-wicket fence for a biggie. No matter when he bats, Devdutt Padikkal never fails to rise to the occasion. 10.6 overs (0 Run) It is short again, wide of off. Sanju Samson hangs back and cuts it to point. He is unable to get it through the gap. Some respite for Sundar, as he ends his over with a dot. 10.5 overs (2 Runs) Floated, full and on the pads. Sanju Samson clips it through mid-wicket for a brace. Washington Sundar hasn't been accurate this evening. He usually bowls at the stumps. Sundar needs to work on his line here. 10.4 overs (4 Runs) FOUR! Sanju Samson only dealing in boundaries at the moment! It is touch short, outside off. Sanju Samson reverse-hits it to third man. One bounce and over the ropes. 10.3 overs (1 Run) Darted on the pads, Devdutt Padikkal flicks it to short fine leg for a single. 10.2 overs (1 Run) Tossed up, full, outside off. Sanju Samson guides it to third man for a single. 10.1 overs (6 Runs) SIX! This is huge! Sanju Samson is taking the charge here. It is short, just outside off. Sanju Samson hangs back and dispatches it over the long off fence. Washington Sundar continues to leak runs.","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637841836788449718.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"AB de Villiers net worth: AB de Villiers son name and family details","link":"https://thesportsrush.com/cricket-news-ab-de-villiers-net-worth-ab-de-villiers-son-name-and-family-details/","keywords":["Cricket","IPL 2022","AB de Villiers"],"creator":["Gurpreet Singh"],"video_url":null,"description":"AB de Villiers net worth: One of the most popular cricketers in world Cricket, AB de Villiers had been a prominent name for RCB in the IPL. One of the most revered cricketers in modern Cricket, AB De Villiers, left the Cricketing fraternity teary-eyed when he announced a sudden retirement from International Cricket in May… The post AB de Villiers net worth: AB de Villiers son name and family details appeared first on The SportsRush.","content":"AB de Villiers net worth: One of the most popular cricketers in world Cricket, AB de Villiers had been a prominent name for RCB in the IPL. One of the most revered cricketers in modern Cricket, AB De Villiers, left the Cricketing fraternity teary-eyed when he announced a sudden retirement from International Cricket in May 2018. However, with him continuing to play franchise Cricket, including the cash-rich Indian Premier League (IPL) for the Royal Challengers Bangalore (RCB) for another three years, meant that his loyal fans never felt the huge void he had left in international Cricket. But, with the now 38-year-old deciding to quit all forms of Cricket in November last year meant that the IPL and the RCB fans would no longer be able to witness the madness with which he bewitched everyone while holding the Willow on the 22-yard deck. Despite him being nowhere around as IPL begins with the 15th season, fans and experts continue to compare him with top-notch exciting talents that the Cricketing world continues to produce. Be it Dewald Brevis from the Under-19 World Cup, or more recently Ayush Badoni from the Lucknow Super Giants a day ago. We all miss AB de Villiers. But none more than Virat Kohli himself. Hopefully one day, he’ll be back here in some capacity. Hopefully! https://t.co/1A7URivfJU — Ajith Ramamurthy (@Ajith_tweets) March 29, 2022 AB de Villiers net worth With him not longer being a contracted player for Cricket South Africa, or for his IPL franchise RCB, de Villiers has witnessed some slump in his overall earnings, especially via his various IPL brand endorsements and his salary (INR 11 Crore for three seasons since 2018). However, with him still being associated with renowned independent brands in Montblanc, Puma, Audi, and MRF to name a few, the Proteas legend still earns a hefty amount via these deals. As per various reports, he earns about $ 1 million from these endorsements. As far as personal properties are concerned, the same is estimated to be worth $6 million, with him owning some luxury cars like Audi Q7 and a BMW X5, and a house worth approx INR 20 Crore (as per reports) in Durban. Thus, AB de Villiers’s net worth comes around a whopping Rs 137 crore or $19.8 million according to reports and estimates. AB de Villiers son name and family details AB de Villiers, who married his beloved Danielle de Villiers in 2013, recently became father for the third time with his wife giving birth to a girl in November 2020, who the couple named Yente de Villiers. The couple are now parents to two sons and a daughter, having welcomed their sons Abraham de Villiers and John Richard de Villliers in 2015 and 2017 respectively. AB de Villiers himself is the youngest amongst the three siblings. While Jan de Villiers is his eldest brother, Wessels de Villiers is the elder one. The post AB de Villiers net worth: AB de Villiers son name and family details appeared first on The SportsRush.","pubDate":"2022-03-29 15:09:29","full_description":"AB de Villiers net worth: One of the most popular cricketers in world Cricket, AB de Villiers had been a prominent name for RCB in the IPL. One of the most revered cricketers in modern Cricket, AB De Villiers, left the Cricketing fraternity teary-eyed when he announced a sudden retirement from International Cricket in May 2018. However, with him continuing to play franchise Cricket, including the cash-rich Indian Premier League (IPL) for the Royal Challengers Bangalore (RCB) for another three years, meant that his loyal fans never felt the huge void he had left in international Cricket. But, with the now 38-year-old deciding to quit all forms of Cricket in November last year meant that the IPL and the RCB fans would no longer be able to witness the madness with which he bewitched everyone while holding the Willow on the 22-yard deck. Despite him being nowhere around as IPL begins with the 15th season, fans and experts continue to compare him with top-notch exciting talents that the Cricketing world continues to produce. Be it Dewald Brevis from the Under-19 World Cup, or more recently Ayush Badoni from the Lucknow Super Giants a day ago. We all miss AB de Villiers. But none more than Virat Kohli himself. Hopefully one day, he’ll be back here in some capacity. Hopefully! 🤞🏼❤️ https://t.co/1A7URivfJU — Ajith Ramamurthy (@Ajith_tweets) March 29, 2022 With him not longer being a contracted player for Cricket South Africa, or for his IPL franchise RCB, de Villiers has witnessed some slump in his overall earnings, especially via his various IPL brand endorsements and his salary (INR 11 Crore for three seasons since 2018). However, with him still being associated with renowned independent brands in Montblanc, Puma, Audi, and MRF to name a few, the Proteas legend still earns a hefty amount via these deals. As per various reports, he earns about $ 1 million from these endorsements. As far as personal properties are concerned, the same is estimated to be worth $6 million, with him owning some luxury cars like Audi Q7 and a BMW X5, and a house worth approx INR 20 Crore (as per reports) in Durban. Thus, AB de Villiers’s net worth comes around a whopping Rs 137 crore or $19.8 million according to reports and estimates. AB de Villiers, who married his beloved Danielle de Villiers in 2013, recently became father for the third time with his wife giving birth to a girl in November 2020, who the couple named Yente de Villiers. The couple are now parents to two sons and a daughter, having welcomed their sons Abraham de Villiers and John Richard de Villliers in 2015 and 2017 respectively. AB de Villiers himself is the youngest amongst the three siblings. While Jan de Villiers is his eldest brother, Wessels de Villiers is the elder one.","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"}]}