{"newsArray":[{"title":"BUMBLE ON THE TEST: Jack Leach is England's trump card","link":"https://www.dailymail.co.uk/sport/cricket/article-11799773/BUMBLE-TEST-Jack-Leach-Englands-trump-card.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"DAVID LLOYD: The second Test between England and New Zealand hangs in the balance going into the final day. David 'Bumble' Lloyd casts his eye back over day four of the Test.","content":"BUMBLE ON THE TEST: Jack Leach is England's trump card - they needed him badly against New Zealand... and Zak Crawley should be dropped, with Haseeb Hameed coming back in to replace him The second Test between England and New Zealand hangs in the balance England need 210 more runs to win while the hosts require a further nine wickets Some of England's players have shone, but others have struggled massively By David Lloyd for the Daily Mail Published: 15:09 EST, 27 February 2023 | Updated: 17:01 EST, 27 February 2023 e-mail 1 View comments The second Test between England and New Zealand hangs in the balance going into the final day , with Ben Stokes ' side requiring 210 more runs for victory. After putting New Zealand back into bat in the follow on, Tim Southee's side put on an impressive 483, setting their visitors 258 runs to win. Zak Crawley fell for 24, but fellow opener Ben Duckett is 23 not out overnight and nightwatchman Ollie Robinson is unbeaten on one. New Zealand require nine wickets to square the series at one apiece, but, rain aside, we should see a result of sorts in Wellington. David 'Bumble' Lloyd casts his eye back over day four of the second Test. Bowler Jack Leach was England's trump card against New Zealand and was needed by his side Kane Williamson scored a fine century for New Zealand before being dismissed by Harry Brook Jack's a trump card There are many times when the balance of a team is discussed — whether to leave out the spinner to play an extra this or that. But boy did England need Jack Leach in this match. All 61.3 overs of him in the second innings. Yes, it looked like a seamer’s paradise at the start of proceedings but it would have been foolhardy not to include Leach, who turned in one of his best performances, occupying one end to give the seamers a rest and taking a five-for to boot. Brook has Midas touch Harry Brook can do no wrong. He has been batting like Don Bradman and now he fancies himself with the ball. England turned to the unlikeliest source in asking the 24-year-old to turn his arm over but he came up trumps with the prize wicket of New Zealand’s Kane Williamson. It was hardly Fred Trueman charging in from the Kirkstall Lane end, more like a slow motion Mike Procter, bowling off the wrong foot. Whatever it looked like, and however fortuitous the leg-side tickle, crucially it said ‘out’ in the book. Zak out, Hameed in I love the togetherness and loyalty in this England team but you cannot carry on with an opener who is not scoring runs. Another failure for Zak Crawley should provide an opportunity for someone else to come in and do the job. Sometimes it is better for the struggling player themselves to be left out. It would not be fair to ask Jonny Bairstow to open, so having watched lots of county cricket last year, my preference would be a recall for Haseeb Hameed — with honourable mentions for Dom Sibley and Keaton Jennings. Zak Crawley has struggled massively for England in recent times and may be out the side soon Captain Ben Stokes hasn't bowled much lately and his lack of overs is a worry for England Ben's bowling a big miss Ben Stokes is going to be a problem going forward if he is a captain-batter who only bowls occasionally. Knee niggles need careful management and the more you keep off them, the better they heal. But the issue I foresee is that an occasional bowler eventually doesn’t bowl at all, and if you don’t bowl at all you cannot develop rhythm or stamina. I think England will be crying out for one of Stokes’s signature spells this summer against Australia, the kind Andrew Flintoff used to produce, but miles in the legs are required to do that. Beefy's welly trip A Test in Wellington reminds me of England’s last trip there. Jonathan Agnew called the troops together in the build-up, the rendezvous point a local fish shack. A long lunch spilled into dinner over the road, where a certain IT Botham returned from the bar with a tray of drinks, fell down five steps but didn’t spill a drop! Such agility was inconspicuous at the end of the night, though. The harbour road in the city has four lanes each way and on sight of the green man, Beefy burst into a gentle jog… and landed face first on the ground. Share or comment on this article: BUMBLE ON THE TEST: Jack Leach is England's trump card e-mail Add comment Comments 1 Share what you think Newest Oldest Best rated Worst rated View all The comments below have been moderated in advance. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-02-27 21:55:54","image_url":"https://i.dailymail.co.uk/1s/2023/02/27/20/68140289-0-image-m-29_1677528037609.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"If you don’t score in India, you will get flak: Ganguly on K. L. Rahul","link":"https://kashmirreader.com/2023/02/28/if-you-dont-score-in-india-you-will-get-flak-ganguly-on-k-l-rahul/","keywords":["SPORTS"],"creator":["Press Trust of India"],"video_url":null,"description":"Stripped of vice-captaincy, Rahul hasn’t crossed 25-run mark in his last 10 tests NEW DELHI: It will be difficult for K.L. Rahul to avoid scathing criticism for his protracted poor run because of the enormous expectations attached with the job, especially when past cricketers have set high standards, says former India skipper Sourav Ganguly. Stripped […]","content":"Stripped of vice-captaincy, Rahul hasn’t crossed 25-run mark in his last 10 tests NEW DELHI: It will be difficult for K.L. Rahul to avoid scathing criticism for his protracted poor run because of the enormous expectations attached with the job, especially when past cricketers have set high standards, says former India skipper Sourav Ganguly. Stripped of vice-captaincy, Rahul hasn’t crossed 25-run mark in his last 10 Test knocks. An average of less than 35 in 47 Tests isn’t an actual realisation of his real potential. “When you don’t score runs in India, obviously you will get flak. KL Rahul hasn’t been the only one. There have been players in the past also,” Ganguly told PTI in an exclusive interview on the sidelines of Delhi Capitals’ IPL pre-season camp. Ganguly tried to put things in perspective as to why the Bengaluru man is being persisted with despite repeated failures. “There’s so much focus and attention with a lot of pressure on players. The team management thinks he is an important player for the team. At the end of the day, what coach and captain thinks is important,” the veteran of 113 Tests and 311 ODIs said. While Rahul has played some quality knocks in England and Australia, Ganguly said it’s obvious that people will expect way more from a talented player like Rahul, who has managed just five Test hundreds in nine years. “He has performed but obviously you expect a lot more from a top-order batter playing for India because the standards set by others are so high.” “When you fail for a while, obviously there will be criticism. I am sure Rahul has the ability and I am sure as and when he gets more opportunities, he will have to find ways to score,” he explained. So is Rahul’s problem technical or mental? “Both,” pat comes the reply. But the former BCCI President also gave an interesting insight into Rahul’s lack of runs as he is getting out to pacers as well as spinners in all conditions in recent times. “It also makes it hard if you are playing on these sort of pitches as the balls are turning and bouncing. There’s uneven bounce and when you are not in form, it makes it even more harder.” Shubman has to wait There has been a clamour to include Shubman Gill in the playing XI but Ganguly feels that the Punjab man will get his share of chances and there’s no harm if he has to wait a little bit. But what do you tell a Shubman, who has to cool his heels when he is in red hot form? “I am sure when his time comes, he will also get a lot of opportunities. I think the selectors, the captain and the coach think of him and rate him very highly. That’s why he is playing ODIs and T20Is, and he has performed as well.” “But at the present moment, perhaps message from team management is that he has to wait.” While India has cantered to victories in both the Tests, the top order batters except Rohit Sharma have flattered to deceive with none getting a fifty. Is the concept of dominant batters against spinners sounding too alien nowadays? “I don’t think so. These are very tough wickets. I saw in the first two Tests and it’s not easy boss. Playing Ashwin, Jadeja, Lyon and the new guy Todd Murphy, it is never easy with odd ball turning square. There is unevenness, there is everything happening for spinners.” This is not Steve Waugh’s team India has won two Test matches in a cumulative duration of five days of cricket and Ganguly isn’t surprised. “India is a different beast in India. They are a pretty good team all around but in India, they are pretty hard to beat. When it starts turning, they are a better side than anyone,” he was sharp in his response. Is the scoreline of 4-0 a real possibility for India? “I think so. I don’t know how Australia can stop it,” he was practical while assessing Australia’s performance. “The problem is, we keep comparing this Australian team to the teams of the past and it’s not the same. You don’t have a Matthew Hayden, Justin Langer, Ricky Ponting, Steve and Mark Waugh, (Adam) Gilchrist, you name them. You don’t have that quality.” “Steve Smith is a great player. (David) Warner hasn’t got going, (Marnus) Labuschagne is a good player but these are tough conditions for him as well.” “The mistake we make with Australian teams is that we think they are Steve Waugh’s Australia but that’s not the case. Different players get tested differently in different conditions.” Been in touch with Pant Ganguly is the Director of Cricket for the Delhi Capitals and one of the toughest challenges for him is to fill in the void created due to the unavailability of Rishabh Pant, who met with a horrific accident and underwent surgery recently. “I spoke to him a couple of times. Obviously, he is going through a tough period, through injuries and surgeries and I wish him well. In a year’s time or maybe in a couple of years’ time, he will be back playing for India,” Ganguly’s voice had a tinge of sadness as he spoke about a player he has been very fond of. Will he like to see Pant being with the team for some time during IPL which could also help in his recovery. “Don’t know. We will see,” Ganguly said. DC is yet to announce Pant’s replacement and Ganguly is still undecided on who is better between young turk Abhishek Porel and domestic veteran Sheldon Jackson. “We still need a bit of time to figure it out. The next camp starts before IPL.” While David Warner is set to lead DC, Axar Patel will be his deputy this season. Ganguly monitored a three-day camp in Kolkata which the likes of Prithvi Shaw, Ishant Sharma, Chetan Sakariya, Manish Pandey attended along with other domestic players. “The IPL is still a month away and the season has just started. It is difficult to get all the players together for the amount of cricket they play. There are four or five who are playing Irani Trophy. Sarfaraz has an injured finger and it’s not a broken finger. He should be okay for the IPL,” he concluded. PTI If you don’t score in India, you will get flak: Ganguly on K. L. Rahul added by Press Trust of India on 1:28 am February 28, 2023 View all posts by Press Trust of India → Press Trust of India Facebook Twitter WhatsApp Email Print Related","pubDate":"2023-02-27 19:58:44","image_url":null,"source_id":"kashmirreader","category":["sports"],"country":["india"],"language":"english"},{"title":"Richa Ghosh only Indian in ICC’s ‘Most Valuable Team’ of Women’s T20 World Cup","link":"https://kashmirreader.com/2023/02/28/richa-ghosh-only-indian-in-iccs-most-valuable-team-of-womens-t20-world-cup/","keywords":["SPORTS"],"creator":["KR Desk"],"video_url":null,"description":"NEW DELHI: Having made her presence felt in ICC Women’s Under-19 T20 World Cup, Richa Ghosh continued her good form into the senior Women’s T20 World Cup that concluded on Sunday. Richa’s aggressive batting during India’s run to the semi-finals of the Women’s T20 World Cup saw her make into the ICC’s Most Valuable Team […]","content":"NEW DELHI: Having made her presence felt in ICC Women’s Under-19 T20 World Cup, Richa Ghosh continued her good form into the senior Women’s T20 World Cup that concluded on Sunday. Richa’s aggressive batting during India’s run to the semi-finals of the Women’s T20 World Cup saw her make into the ICC’s Most Valuable Team of the tournament. The 19-year-old wicket-keeper is the only Indian to find a place in the team. The middle-order batter ended the tournament with 136 runs at a strike rate of 130.76 that included crucial knocks of 31 not out vs Pakistan, 44 not out vs West Indies and 47 not out vs England. She led the tournament in dismissals with seven (five catches, two stumpings). Four players from Australia, who lifted the trophy for a record-extending sixth time, figure in the XI. They are wicketkeeper-opener Alyssa Healy, who scored 189 runs at 47.25 and effected four dismissals, all-rounder Ashleigh Gardner, who scored 110 runs at 36.66 and grabbed 10 wickets at 12.50, Darcie Brown (seven wickets at 15.00) and Megan Schutt (10 wickets at 12.50). The team was chosen by a panel of experts, including commentator and former West Indies player Ian Bishop and ex-Australian woman cricketer Melanie Jones, among others. Most Valuable Team of the Women’s T20 World Cup (in batting order): Tazmin Brits (South Africa) 186 runs at 37.20; Alyssa Healy (wk) (Australia) 189 runs at 47.25 and four dismissals; Laura Wolvaardt (South Africa) 230 runs at 46.00; Nat Sciver-Brunt (c) (England) 216 runs at 72.00; Ashleigh Gardner (Australia) 110 runs at 36.66 and 10 wickets at 12.50; Richa Ghosh (India) 136 runs at 68.00; Sophie Ecclestone (England) 11 wickets at 7.54; Karishma Ramharack (West Indies) 5 wickets at 10.00; Shabnim Ismail (South Africa) 8 wickets at 16.12; Darcie Brown (Australia) 7 wickets at 15.00; Megan Schutt (Australia) 10 wickets at 12.50; 12th player: Orla Prendergast (Ireland) 109 runs at 27.25 and 3 wickets at 26.00. PTI /Agencies Richa Ghosh only Indian in ICC’s ‘Most Valuable Team’ of Women’s T20 World Cup added by KR Desk on 1:28 am February 28, 2023 View all posts by KR Desk → KR Desk Facebook Twitter WhatsApp Email Print Related","pubDate":"2023-02-27 19:58:16","image_url":null,"source_id":"kashmirreader","category":["sports"],"country":["india"],"language":"english"},{"title":"ITV to show 16 regular season games of this year's IPL","link":"https://www.dailymail.co.uk/sport/cricket/article-11799141/ITV-16-regular-season-games-years-IPL.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"EXCLUSIVE BY MATT HUGHES: The two broadcasters have combined to take the IPL from current rights holders Sky Sports on a five-year deal.","content":"ITV snap up IPL rights with one quarter of this year's tournament to be shown on free-to-air TV in the UK alongside main holder DAZN ITV are to share a portion of the coverage with main rights holders DAZN Comes after Sky Sports decided to walk away from the auction to host coverage The UK is the second biggest market for the tournament after India itself By Matt Hughes For The Daily Mail Published: 16:41, 27 February 2023 | Updated: 19:52, 27 February 2023 e-mail 1 View comments ITV and DAZN have bought live TV rights for this year’s IPL in an innovate deal that will see a quarter of the competition broadcast on free-to-air television. Sportsmail has learned that the two broadcasters have combined to take the IPL from current rights holders Sky Sports on a five-year deal, with 16 regular season matches to be shown exclusively on ITV and DAZN taking the other 58 games including the play-offs and final. DAZN are understood to be funding the majority of the deal in their first foray into cricket broadcasting in this country, but have opted to sub-licence some of the games to ITV in an attempt to grow a bigger audience. The streaming service already hold IPL rights in Australia and South Africa , but the UK is the biggest market outside India . All 74 matches will be shown live. The IPL has been broadcast by Sky Sports for the last three years with their willingness to walk away from the rights auction a sign of their increasingly cost-conscious approach and desire to focus on the English domestic season and ICC global events. ITV will show a quarter of this year's IPL meaning a return of the tournament to free-to-air television in the UK Sam Curran became the most expensive cricketer of all time in December when he was picked up by the Punjab Kings for £1.85m BT Sport have snapped up the rights for England tours to New Zealand, Australia and West Indies in recent years, with Sky preferring to concentrate on England’s home season, World Cups and the Hundred. ITV previously held the rights for the IPL between 2010 and 2014, and are expected to show this year’s competition on ITV4. The IPL’s domestic TV deal in India with Star Sports is worth £5billion, making it the second most lucrative competition in the world across all sports on a per-match basis at £14m-per-game after the NFL. The season starts with GT vs CSK on 31 March and the India rights are split between Star (TV) & Viacom (streaming). Share or comment on this article: ITV to show 16 regular season games of this year's IPL e-mail Add comment Comments 1 Share what you think Newest Oldest Best rated Worst rated View all The comments below have been moderated in advance. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-02-27 19:52:38","image_url":"https://i.dailymail.co.uk/1s/2023/02/27/16/68134841-0-image-m-35_1677515939207.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Quinton de Kock lands the ‘fish of a lifetime’ – PICTURES","link":"https://www.thesouthafrican.com/sport/cricket/proteas/quinton-de-kock-lands-fish-of-a-lifetime-images-pictures-breaking-27-february-2023/","keywords":["Proteas","Featured","fishing","Important","latest cricket news","Quinton de Kock"],"creator":["Garrin Lambley"],"video_url":null,"description":"Proteas wicketkeeper-batsman Quinton de Kock is not only handy with the willow, he is clearly and excellent fisherman too!","content":"Proteas wicketkeeper-batsman Quinton de Kock is not only handy with the willow, he is clearly an excellent fisherman too! ALSO READ: Duminy to quit Paarl, join Proteas De Kock seizes every available opportunity to take a break from wearing the gloves and get out his fishing rod in the hopes of landing his next ‘big one’. Quinton de Kock quit Test cricket in 2021 And that’s exactly what the 30-year-old did recently! ALSO READ: In and out: Proteas coach backs up his picks Taking to his Instagram page on Monday, 27 February 2023, De Kock wrote: “Finally landed the fish of a life time! Been searching for this dinosaur for a long time and today I finally got it !🤘🎣” ACE | WATCH: Quinton de Kock has a hole-in-one! It’s unclear where De Kock was fishing or what type of fish he landed (anyone able to help?) PICTURE | DE KOCK GOES FISHING ON NEW YEAR’S EVE – LANDS A MONSTER! De Kock more often than not can be spotted on the Knysna Lagoon. As reported by The South African website , De Kock sensationally quit the Test arena in late 2021, but remains part of the Proteas’ ODI and T20I squads. ALSO READ: Bavuma wants Proteas to move on","pubDate":"2023-02-27 19:45:10","image_url":"https://www.thesouthafrican.com/wp-content/themes/jnews-child/assets/images/normal.jpeg.optimal.jpeg","source_id":"thesouthafrican","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Shardul Thakur Marriage: शादी के बंधन में बंधे शार्दुल ठाकुर, मिताली पारुलकर के संग लिए सात फेरे, देखें तस्वीर","link":"https://sports.ndtv.com/hindi/cricket/shardul-thakur-marriage-seven-rounds-for-sharadul-thakur-mithali-parulkar-tied-in-marriage-see-the-picture-shardul-thakur-marriage-pics-and-videos-3820117#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"Shardul Thakur and Mitali Parulkar Marriage Photos: नवंबर 2021 में दोनों ने सगाई की थी. शार्दुल ठाकुर ने अपने इंस्टाग्राम पर भी शादी की तस्वीरें साझा की हैं जिसके ऊपर फैंस लगातार बधाई दे रहे हैं.","content":"शार्दुल ठाकुर, मिथली पारुलकर के साथ मुंबई में शादी के बंधन में बंध गए हैं, शादी समारोह में कई खास लोग शामिल हुए भारतीय टीम के कप्तान रोहित शर्मा (Rohit Sharma) समेत उनकी पत्नी रितिका (Ritika) के संग धनश्री (Chahal Wife Dhanashree) भारतीय टीम के स्टार खिलाड़ी श्रेयस अय्यर (Shreyas Iyer) भी शादी समारोह में शामिल हुए. Congratulations You Beautiful Couple Shardul Thakur and Mittali Parulkar🥹❤️ ✨ शार्दुल और मिताली (Shardul Thakur Marriage Photos) लम्बे समय से रिलेशनशिप में थे और नवंबर 2021 में दोनों ने सगाई भी की थी. शार्दुल ठाकुर ने अपने इंस्टाग्राम पर भी शादी की तस्वीरें साझा की हैं जिसके ऊपर फैंस लगातार बधाई दे रहे हैं. They dance so well! 😭❤️ * * पढ़ें , राजनीति, देश और दुनिया की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-02-27 18:59:21","image_url":"https://c.ndtvimg.com/2023-02/4np4avs8_shardul-thakur_625x300_26_February_23.jpg","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"News24.com | 'It's a special thing': Bavuma revels in elevation to 'most coveted' role of Test captain","link":"https://www.news24.com/sport/Cricket/Proteas/its-a-special-thing-bavuma-revels-in-elevation-to-most-coveted-role-of-test-captain-20230227","keywords":null,"creator":null,"video_url":null,"description":"The Proteas Test captaincy may be a bit of a poisoned chalice when paired with recent results, but it remains a cherished position for Temba Bavuma.","content":"The Proteas Test captaincy may be a bit of a poisoned chalice when paired with recent results, but it remains a cherished position for Temba Bavuma. The 32-year-old Bavuma was announced as Test captain last week Friday by new red-ball coach Shukri Conrad. His career has come full circle with the assumption of the leadership role just as the West Indies Test series is about to start, because it was against the team from the Caribbean that he made his Test debut back in 2014. Bavuma said the elevation means a lot to him and he is happy that Conrad considers him as the best man for the job. READ | 'My whole career was ripped underneath me': Proteas star Brits takes unique path to World Cup dream \"It's probably the most coveted one from a player's perspective but, first and foremost, the dream was always to play Test cricket,\" Bavuma said. \"To have lived that dream and also having the opportunity of leading the team makes it a lot more special and it means a lot to me. \"It means a lot to my family and the people who have supported me in this journey. It's a special thing. \"From him (Conrad), he believed I was the right man to do the job and I have been one of the consistent performers over the past couple of years. \"He believes I have what it takes to turn his vision into a reality.\" With 54 Tests under his belt, Bavuma said he felt more emboldened as a leader compared to when he assumed the white-ball leadership. READ | 'We're dealing with humans': Proteas coach on having to make difficult decisions in picking Test squad \"As great as it was to captain the white-ball team, I came in at a time where I didn't have a lot of experience in white-ball cricket,\" Bavuma, who retains the Proteas ODI captaincy, said. Rob Houwing | Centurion Test: The risk SA spinner is mostly just fielder \"I didn't have more than five games in T20 and ODI cricket (at the time), but things are a bit different now as I have a lot more experience in the red-ball game. \"I know my game and I know what I need to do, but it will be a challenge because the white-ball team has more experience than the red-ball team.\" A slight concern for the former T20 skipper is the lack of red-ball action in store for the Proteas this year, and how this will affect building momentum for the Test team. The Proteas have only three scheduled Tests left for the year: the two matches against the West Indies over the next two weeks and a Boxing Day engagement against India much later in the year. \"There are more opportunities to play white-ball cricket, while Test chances are a bit more limited, so it’s hard to build more substance with only three Tests this year.\"","pubDate":"2023-02-27 18:31:05","image_url":"https://scripts.24.co.za/img/sites/sport24.png","source_id":"news24","category":["sports"],"country":["south africa"],"language":"english"},{"title":"News24.com | Proteas Test skipper Bavuma hopes women's game gets more care after World Cup","link":"https://www.news24.com/sport/Cricket/Proteas/proteas-test-skipper-bavuma-hopes-womens-game-gets-more-care-after-world-cup-20230227","keywords":null,"creator":null,"video_url":null,"description":"Proteas captain Temba Bavuma said his team wants to channel the positive energy generated by the success of the women's national cricket team going into their Test series against the West Indies.","content":"Proteas captain Temba Bavuma said his team wants to channel the positive energy generated by the success of the women's national cricket team going into the Test series against the West Indies. Sune Luus's charges recovered from a shock opening T20 World Cup game loss to Sri Lank to bounce back and fight their way into Sunday's final, which they lost by 19 runs to Australia at a packed Newlands. They left the country brimming with pride despite defeat, with Bavuma saying the men's Proteas team have every reason to take inspiration from the achievements of their compatriots. PICS | The drama, elation and agony of SA cricket's maiden World Cup final The women's team became the first senior Proteas team to qualify for an International Cricket Council tournament final, succeeding where the South African men's teams have failed. They also became the first South African team to qualify for a home play-off. Bavuma, who has presided over two failed T20 World Cup campaigns and has since relinquished the T20 captaincy, hoped that the women's team will get better care invested in the women's game in the country. \"It was massive and not just for us, but for the nation,\" Bavuma said. \"All the guys were watching the semi-final and the final, supporting the ladies, and I think for us as a team, we look for areas everywhere where we can get energy and draw inspiration from. \"I'm sure we'll be using that energy going into our games because what the women's team achieved was big, especially with their limited resources. Rob Houwing | Proteas women enter whole new marketability realm \"I hope that with performances like this, there will be a lot more support and a lot more care that'll be invested into the women's team.\" The newly appointed Test captain's first assignment is against the West Indies when they play the first of two Tests starting at SuperSport Park on Tuesday. Bavuma missed the 2021 Test portion of the tour in West Indies due to injury, but he has seen enough of the Islanders to know where their strengths and weaknesses are. \"Looking at the West Indian team over the last while, they play old-fashioned cricket where the batters grind it out and the bowlers are looking to hit their areas,\" he said. READ | Proteas skipper calls on Cricket SA, government to drive women's development \"They've got guys who can stand up to the challenge. They have a guy like (captain Kraigg) Brathwaite, and we saw how he batted in Australia. \"We will have prepared well and as best as we can, as we would against any opposition. In their bowling attack, they have guys who can get the ball through, which is something you need when you play in South Africa. \"We'll have our work cut out and we'll be expecting their challenge.\"","pubDate":"2023-02-27 18:31:05","image_url":"https://scripts.24.co.za/img/sites/sport24.png","source_id":"news24","category":["sports"],"country":["south africa"],"language":"english"},{"title":"IND vs AUS: तीसरे टेस्ट से पहले Glenn McGrath ने ऑस्ट्रेलिया टीम पर ही उठाया सवाल, कह दी बड़ी बात","link":"https://sports.ndtv.com/hindi/cricket/ind-vs-aus-glenn-mcgrath-raised-questions-on-australia-team-before-the-third-test-said-a-big-thing-ind-vs-aus-3rd-test-schedule-ind-vs-aus-3rd-test-pl-3820016#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"IND vs AUS 3rd Test: ‘एमआरएफ पेस फाउंडेशन’ में कोचिंग के निदेशक मैकग्रा (Glenn McGrath) ने यहां कहा, ‘‘मुझे लगता है कि वे इस समय (स्टीव) स्मिथ और मार्नस (लाबुशेन) (Glenn McGrath on Steve Smith and Marnus Labuschagne) पर बहुत अधिक निर्भर है.","content":"Glenn McGrath बॉर्डर-गावस्कर ट्रॉफी के पिछले 2 मुकाबलों में भारतीय टीम ने ऑस्ट्रेलिया के ऊपर जबरदस्त जीत दर्ज की, जिसके बाद ऑस्ट्रेलिया के खिलाड़ियों के खेलने के अंदाज पर लगातार सवाल उठने लगे. इसी बीच पूर्व ऑस्ट्रेलियाई तेज गेंदबाज़ ग्लेन मैकग्रा ने ऑस्ट्रेलिया टीम पर ही सवाल उठा दिया है. ऑस्ट्रेलिया के पूर्व दिग्गज तेज गेंदबाज ग्लेन मैकग्रा (Glenn McGrath on Australia Team) ने सोमवार को यहां कहा कि ऑस्ट्रेलियाई टीम भारत में चल रही चार मैचों की टेस्ट श्रृंखला (Ind vs Aus Test Series) में स्टीव स्मिथ (Steve Smith) और मार्नस लाबुशेन (Marnus Labuschagne) पर बहुत अधिक निर्भर है. उन्होंने कहा कि श्रृंखला में वापसी के लिए पूरे बल्लेबाजी क्रम को एकजुट होकर प्रदर्शन करना होगा. भारत ने चार मैचों की श्रृंखला के शुरुआती दो मुकाबलों को जीत कर बॉर्डर-गावस्कर ट्रॉफी (Ind vs Aus 3rd Test Border-Gavaskar Trophy) अपने नाम कर ली है. ‘एमआरएफ पेस फाउंडेशन' में कोचिंग के निदेशक मैकग्रा ने यहां कहा, ‘‘मुझे लगता है कि वे इस समय (स्टीव) स्मिथ और मार्नस (लाबुशेन) (Glenn McGrath on Steve Smith and Marnus Labuschagne) पर बहुत अधिक निर्भर है. ट्रेविस हेड (Travis Head) के लिए यह साल अच्छा रहा है और अब पूरी बल्लेबाजी इकाई को एकजुटता दिखानी होगी.'' ऑस्ट्रेलिया के लिए 124 टेस्ट में 563 विकेट लेने वाले 53 साल के इस पूर्व खिलाड़ी ने कहा, ‘‘ मुझे लगता है कि वे भारत में स्पिन से निपटने की योजना पर अडिग नहीं रहे. पहले टेस्ट में, वे बहुत रक्षात्मक थे जबकि दूसरे टेस्ट में, वे बहुत आक्रामक थे. उन्हें बीच का रास्ता निकाल कर क्रीज पर अधिक समय बिताने पर ध्यान देना होगा.'' मैकग्रा (Glenn McGrath) ने आगे कहा कि तेज गेंदबाज जोश हेजलवुड (Josh Hazlewood), मिचेल स्टार्क (Mitchel Starc) और हरफनमौला कैमरून ग्रीन (Cameron Green) की गैरमौजूदगी ने टीम के संतुलन को प्रभावित किया, लेकिन साथ ही नागपुर में पहले टेस्ट के लिए हेड को बाहर करने जैसे चयन फैसलों पर भी सवाल उठाया. * * पढ़ें , राजनीति, देश और दुनिया की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-02-27 17:52:46","image_url":"https://c.ndtvimg.com/2019-05/irh4bd0o_glenn-mcgrath_625x300_27_May_19.jpg","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"News24.com | STAT ATTACK | Proteas lead the way at T20 World Cup as Wolvaardt, Brits, Kapp shine","link":"https://www.news24.com/sport/Cricket/Proteas/stat-attack-proteas-lead-the-way-at-t20-world-cup-as-wolvaardt-brits-kapp-shine-20230227","keywords":null,"creator":null,"video_url":null,"description":"South Africa might have finished runners-up but the hosts left the ICC T20 World Cup with their heads held high after leading the way among the star performers during the tournament.","content":"Proteas opener Laura Wolvaardt's batting heroics took SA to the brink of winning the ICC T20 Women's World Cup , where they fell 19 runs shy of beating Australia in the final at Newlands in Cape Town. But it was a tournament filled with star home performances. Wolvaardt finished as the highest run-scorer with 230, ahead of England's Nat Sciver-Brunt (216), Australian duo Beth Mooney (206) and Alyssa Healy (189), and Proteas teammate Tazmin Brits (186). Brits was not only in the run-getting column, but also rose highest in the catching statistics, recording seven scalps in six matches, the most by almost double. PICS | The drama, elation and agony of SA cricket's maiden World Cup final Here's a list of South Africa's best performers during the tournament: 230 - The most runs by any batter during the tournament, accumulated by the invaluable Wolvaardt . 117* - The highest batting partnership during the competition shared by Wolvaardt and Brits ' unbeaten opening stand to see off Bangladesh in the Proteas' final group-stage game. 9 - Most wickets by a South African - Marizanne Kapp came third overall in this category with nine wickets, one ahead of teammate Shabnim Ismail, who finished with eight. England's Sophie Ecclestone came out trumps with 11, with Australian pair Ash Gardner and Megan Schutt sharing second place with 10 wickets. 7 - Most tournament catches - Brits was a class apart in the field throughout. The ball really did follow her around the park, whether she was fielding in the inner ring or outfield. 3 - Most 50s - Again, Wolvaardt stood tall, joint-topping this list with Mooney.","pubDate":"2023-02-27 17:01:20","image_url":"https://scripts.24.co.za/img/sites/sport24.png","source_id":"news24","category":["sports"],"country":["south africa"],"language":"english"},{"title":"BUMBLE ON THE TEST: Jack Leach is England's trump card","link":"https://www.dailymail.co.uk/sport/cricket/article-11799773/BUMBLE-TEST-Jack-Leach-Englands-trump-card.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"DAVID LLOYD: The second Test between England and New Zealand hangs in the balance going into the final day. David 'Bumble' Lloyd casts his eye back over day four of the Test.","content":"BUMBLE ON THE TEST: Jack Leach is England's trump card - they needed him badly against New Zealand... and Zak Crawley should be dropped, with Haseeb Hameed coming back in to replace him The second Test between England and New Zealand hangs in the balance England need 210 more runs to win while the hosts require a further nine wickets Some of England's players have shone, but others have struggled massively By David Lloyd for the Daily Mail Published: 15:09 EST, 27 February 2023 | Updated: 17:01 EST, 27 February 2023 e-mail 1 View comments The second Test between England and New Zealand hangs in the balance going into the final day , with Ben Stokes ' side requiring 210 more runs for victory. After putting New Zealand back into bat in the follow on, Tim Southee's side put on an impressive 483, setting their visitors 258 runs to win. Zak Crawley fell for 24, but fellow opener Ben Duckett is 23 not out overnight and nightwatchman Ollie Robinson is unbeaten on one. New Zealand require nine wickets to square the series at one apiece, but, rain aside, we should see a result of sorts in Wellington. David 'Bumble' Lloyd casts his eye back over day four of the second Test. Bowler Jack Leach was England's trump card against New Zealand and was needed by his side Kane Williamson scored a fine century for New Zealand before being dismissed by Harry Brook Jack's a trump card There are many times when the balance of a team is discussed — whether to leave out the spinner to play an extra this or that. But boy did England need Jack Leach in this match. All 61.3 overs of him in the second innings. Yes, it looked like a seamer’s paradise at the start of proceedings but it would have been foolhardy not to include Leach, who turned in one of his best performances, occupying one end to give the seamers a rest and taking a five-for to boot. Brook has Midas touch Harry Brook can do no wrong. He has been batting like Don Bradman and now he fancies himself with the ball. England turned to the unlikeliest source in asking the 24-year-old to turn his arm over but he came up trumps with the prize wicket of New Zealand’s Kane Williamson. It was hardly Fred Trueman charging in from the Kirkstall Lane end, more like a slow motion Mike Procter, bowling off the wrong foot. Whatever it looked like, and however fortuitous the leg-side tickle, crucially it said ‘out’ in the book. Zak out, Hameed in I love the togetherness and loyalty in this England team but you cannot carry on with an opener who is not scoring runs. Another failure for Zak Crawley should provide an opportunity for someone else to come in and do the job. Sometimes it is better for the struggling player themselves to be left out. It would not be fair to ask Jonny Bairstow to open, so having watched lots of county cricket last year, my preference would be a recall for Haseeb Hameed — with honourable mentions for Dom Sibley and Keaton Jennings. Zak Crawley has struggled massively for England in recent times and may be out the side soon Captain Ben Stokes hasn't bowled much lately and his lack of overs is a worry for England Ben's bowling a big miss Ben Stokes is going to be a problem going forward if he is a captain-batter who only bowls occasionally. Knee niggles need careful management and the more you keep off them, the better they heal. But the issue I foresee is that an occasional bowler eventually doesn’t bowl at all, and if you don’t bowl at all you cannot develop rhythm or stamina. I think England will be crying out for one of Stokes’s signature spells this summer against Australia, the kind Andrew Flintoff used to produce, but miles in the legs are required to do that. Beefy's welly trip A Test in Wellington reminds me of England’s last trip there. Jonathan Agnew called the troops together in the build-up, the rendezvous point a local fish shack. A long lunch spilled into dinner over the road, where a certain IT Botham returned from the bar with a tray of drinks, fell down five steps but didn’t spill a drop! Such agility was inconspicuous at the end of the night, though. The harbour road in the city has four lanes each way and on sight of the green man, Beefy burst into a gentle jog… and landed face first on the ground. Share or comment on this article: BUMBLE ON THE TEST: Jack Leach is England's trump card e-mail Add comment Comments 1 Share what you think Newest Oldest Best rated Worst rated View all The comments below have been moderated in advance. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-02-27 21:55:54","image_url":"https://i.dailymail.co.uk/1s/2023/02/27/20/68140289-0-image-m-29_1677528037609.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"If you don’t score in India, you will get flak: Ganguly on K. L. Rahul","link":"https://kashmirreader.com/2023/02/28/if-you-dont-score-in-india-you-will-get-flak-ganguly-on-k-l-rahul/","keywords":["SPORTS"],"creator":["Press Trust of India"],"video_url":null,"description":"Stripped of vice-captaincy, Rahul hasn’t crossed 25-run mark in his last 10 tests NEW DELHI: It will be difficult for K.L. Rahul to avoid scathing criticism for his protracted poor run because of the enormous expectations attached with the job, especially when past cricketers have set high standards, says former India skipper Sourav Ganguly. Stripped […]","content":"Stripped of vice-captaincy, Rahul hasn’t crossed 25-run mark in his last 10 tests NEW DELHI: It will be difficult for K.L. Rahul to avoid scathing criticism for his protracted poor run because of the enormous expectations attached with the job, especially when past cricketers have set high standards, says former India skipper Sourav Ganguly. Stripped of vice-captaincy, Rahul hasn’t crossed 25-run mark in his last 10 Test knocks. An average of less than 35 in 47 Tests isn’t an actual realisation of his real potential. “When you don’t score runs in India, obviously you will get flak. KL Rahul hasn’t been the only one. There have been players in the past also,” Ganguly told PTI in an exclusive interview on the sidelines of Delhi Capitals’ IPL pre-season camp. Ganguly tried to put things in perspective as to why the Bengaluru man is being persisted with despite repeated failures. “There’s so much focus and attention with a lot of pressure on players. The team management thinks he is an important player for the team. At the end of the day, what coach and captain thinks is important,” the veteran of 113 Tests and 311 ODIs said. While Rahul has played some quality knocks in England and Australia, Ganguly said it’s obvious that people will expect way more from a talented player like Rahul, who has managed just five Test hundreds in nine years. “He has performed but obviously you expect a lot more from a top-order batter playing for India because the standards set by others are so high.” “When you fail for a while, obviously there will be criticism. I am sure Rahul has the ability and I am sure as and when he gets more opportunities, he will have to find ways to score,” he explained. So is Rahul’s problem technical or mental? “Both,” pat comes the reply. But the former BCCI President also gave an interesting insight into Rahul’s lack of runs as he is getting out to pacers as well as spinners in all conditions in recent times. “It also makes it hard if you are playing on these sort of pitches as the balls are turning and bouncing. There’s uneven bounce and when you are not in form, it makes it even more harder.” Shubman has to wait There has been a clamour to include Shubman Gill in the playing XI but Ganguly feels that the Punjab man will get his share of chances and there’s no harm if he has to wait a little bit. But what do you tell a Shubman, who has to cool his heels when he is in red hot form? “I am sure when his time comes, he will also get a lot of opportunities. I think the selectors, the captain and the coach think of him and rate him very highly. That’s why he is playing ODIs and T20Is, and he has performed as well.” “But at the present moment, perhaps message from team management is that he has to wait.” While India has cantered to victories in both the Tests, the top order batters except Rohit Sharma have flattered to deceive with none getting a fifty. Is the concept of dominant batters against spinners sounding too alien nowadays? “I don’t think so. These are very tough wickets. I saw in the first two Tests and it’s not easy boss. Playing Ashwin, Jadeja, Lyon and the new guy Todd Murphy, it is never easy with odd ball turning square. There is unevenness, there is everything happening for spinners.” This is not Steve Waugh’s team India has won two Test matches in a cumulative duration of five days of cricket and Ganguly isn’t surprised. “India is a different beast in India. They are a pretty good team all around but in India, they are pretty hard to beat. When it starts turning, they are a better side than anyone,” he was sharp in his response. Is the scoreline of 4-0 a real possibility for India? “I think so. I don’t know how Australia can stop it,” he was practical while assessing Australia’s performance. “The problem is, we keep comparing this Australian team to the teams of the past and it’s not the same. You don’t have a Matthew Hayden, Justin Langer, Ricky Ponting, Steve and Mark Waugh, (Adam) Gilchrist, you name them. You don’t have that quality.” “Steve Smith is a great player. (David) Warner hasn’t got going, (Marnus) Labuschagne is a good player but these are tough conditions for him as well.” “The mistake we make with Australian teams is that we think they are Steve Waugh’s Australia but that’s not the case. Different players get tested differently in different conditions.” Been in touch with Pant Ganguly is the Director of Cricket for the Delhi Capitals and one of the toughest challenges for him is to fill in the void created due to the unavailability of Rishabh Pant, who met with a horrific accident and underwent surgery recently. “I spoke to him a couple of times. Obviously, he is going through a tough period, through injuries and surgeries and I wish him well. In a year’s time or maybe in a couple of years’ time, he will be back playing for India,” Ganguly’s voice had a tinge of sadness as he spoke about a player he has been very fond of. Will he like to see Pant being with the team for some time during IPL which could also help in his recovery. “Don’t know. We will see,” Ganguly said. DC is yet to announce Pant’s replacement and Ganguly is still undecided on who is better between young turk Abhishek Porel and domestic veteran Sheldon Jackson. “We still need a bit of time to figure it out. The next camp starts before IPL.” While David Warner is set to lead DC, Axar Patel will be his deputy this season. Ganguly monitored a three-day camp in Kolkata which the likes of Prithvi Shaw, Ishant Sharma, Chetan Sakariya, Manish Pandey attended along with other domestic players. “The IPL is still a month away and the season has just started. It is difficult to get all the players together for the amount of cricket they play. There are four or five who are playing Irani Trophy. Sarfaraz has an injured finger and it’s not a broken finger. He should be okay for the IPL,” he concluded. PTI If you don’t score in India, you will get flak: Ganguly on K. L. Rahul added by Press Trust of India on 1:28 am February 28, 2023 View all posts by Press Trust of India → Press Trust of India Facebook Twitter WhatsApp Email Print Related","pubDate":"2023-02-27 19:58:44","image_url":null,"source_id":"kashmirreader","category":["sports"],"country":["india"],"language":"english"},{"title":"Richa Ghosh only Indian in ICC’s ‘Most Valuable Team’ of Women’s T20 World Cup","link":"https://kashmirreader.com/2023/02/28/richa-ghosh-only-indian-in-iccs-most-valuable-team-of-womens-t20-world-cup/","keywords":["SPORTS"],"creator":["KR Desk"],"video_url":null,"description":"NEW DELHI: Having made her presence felt in ICC Women’s Under-19 T20 World Cup, Richa Ghosh continued her good form into the senior Women’s T20 World Cup that concluded on Sunday. Richa’s aggressive batting during India’s run to the semi-finals of the Women’s T20 World Cup saw her make into the ICC’s Most Valuable Team […]","content":"NEW DELHI: Having made her presence felt in ICC Women’s Under-19 T20 World Cup, Richa Ghosh continued her good form into the senior Women’s T20 World Cup that concluded on Sunday. Richa’s aggressive batting during India’s run to the semi-finals of the Women’s T20 World Cup saw her make into the ICC’s Most Valuable Team of the tournament. The 19-year-old wicket-keeper is the only Indian to find a place in the team. The middle-order batter ended the tournament with 136 runs at a strike rate of 130.76 that included crucial knocks of 31 not out vs Pakistan, 44 not out vs West Indies and 47 not out vs England. She led the tournament in dismissals with seven (five catches, two stumpings). Four players from Australia, who lifted the trophy for a record-extending sixth time, figure in the XI. They are wicketkeeper-opener Alyssa Healy, who scored 189 runs at 47.25 and effected four dismissals, all-rounder Ashleigh Gardner, who scored 110 runs at 36.66 and grabbed 10 wickets at 12.50, Darcie Brown (seven wickets at 15.00) and Megan Schutt (10 wickets at 12.50). The team was chosen by a panel of experts, including commentator and former West Indies player Ian Bishop and ex-Australian woman cricketer Melanie Jones, among others. Most Valuable Team of the Women’s T20 World Cup (in batting order): Tazmin Brits (South Africa) 186 runs at 37.20; Alyssa Healy (wk) (Australia) 189 runs at 47.25 and four dismissals; Laura Wolvaardt (South Africa) 230 runs at 46.00; Nat Sciver-Brunt (c) (England) 216 runs at 72.00; Ashleigh Gardner (Australia) 110 runs at 36.66 and 10 wickets at 12.50; Richa Ghosh (India) 136 runs at 68.00; Sophie Ecclestone (England) 11 wickets at 7.54; Karishma Ramharack (West Indies) 5 wickets at 10.00; Shabnim Ismail (South Africa) 8 wickets at 16.12; Darcie Brown (Australia) 7 wickets at 15.00; Megan Schutt (Australia) 10 wickets at 12.50; 12th player: Orla Prendergast (Ireland) 109 runs at 27.25 and 3 wickets at 26.00. PTI /Agencies Richa Ghosh only Indian in ICC’s ‘Most Valuable Team’ of Women’s T20 World Cup added by KR Desk on 1:28 am February 28, 2023 View all posts by KR Desk → KR Desk Facebook Twitter WhatsApp Email Print Related","pubDate":"2023-02-27 19:58:16","image_url":null,"source_id":"kashmirreader","category":["sports"],"country":["india"],"language":"english"},{"title":"ITV to show 16 regular season games of this year's IPL","link":"https://www.dailymail.co.uk/sport/cricket/article-11799141/ITV-16-regular-season-games-years-IPL.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"EXCLUSIVE BY MATT HUGHES: The two broadcasters have combined to take the IPL from current rights holders Sky Sports on a five-year deal.","content":"ITV snap up IPL rights with one quarter of this year's tournament to be shown on free-to-air TV in the UK alongside main holder DAZN ITV are to share a portion of the coverage with main rights holders DAZN Comes after Sky Sports decided to walk away from the auction to host coverage The UK is the second biggest market for the tournament after India itself By Matt Hughes For The Daily Mail Published: 16:41, 27 February 2023 | Updated: 19:52, 27 February 2023 e-mail 1 View comments ITV and DAZN have bought live TV rights for this year’s IPL in an innovate deal that will see a quarter of the competition broadcast on free-to-air television. Sportsmail has learned that the two broadcasters have combined to take the IPL from current rights holders Sky Sports on a five-year deal, with 16 regular season matches to be shown exclusively on ITV and DAZN taking the other 58 games including the play-offs and final. DAZN are understood to be funding the majority of the deal in their first foray into cricket broadcasting in this country, but have opted to sub-licence some of the games to ITV in an attempt to grow a bigger audience. The streaming service already hold IPL rights in Australia and South Africa , but the UK is the biggest market outside India . All 74 matches will be shown live. The IPL has been broadcast by Sky Sports for the last three years with their willingness to walk away from the rights auction a sign of their increasingly cost-conscious approach and desire to focus on the English domestic season and ICC global events. ITV will show a quarter of this year's IPL meaning a return of the tournament to free-to-air television in the UK Sam Curran became the most expensive cricketer of all time in December when he was picked up by the Punjab Kings for £1.85m BT Sport have snapped up the rights for England tours to New Zealand, Australia and West Indies in recent years, with Sky preferring to concentrate on England’s home season, World Cups and the Hundred. ITV previously held the rights for the IPL between 2010 and 2014, and are expected to show this year’s competition on ITV4. The IPL’s domestic TV deal in India with Star Sports is worth £5billion, making it the second most lucrative competition in the world across all sports on a per-match basis at £14m-per-game after the NFL. The season starts with GT vs CSK on 31 March and the India rights are split between Star (TV) & Viacom (streaming). Share or comment on this article: ITV to show 16 regular season games of this year's IPL e-mail Add comment Comments 1 Share what you think Newest Oldest Best rated Worst rated View all The comments below have been moderated in advance. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-02-27 19:52:38","image_url":"https://i.dailymail.co.uk/1s/2023/02/27/16/68134841-0-image-m-35_1677515939207.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Quinton de Kock lands the ‘fish of a lifetime’ – PICTURES","link":"https://www.thesouthafrican.com/sport/cricket/proteas/quinton-de-kock-lands-fish-of-a-lifetime-images-pictures-breaking-27-february-2023/","keywords":["Proteas","Featured","fishing","Important","latest cricket news","Quinton de Kock"],"creator":["Garrin Lambley"],"video_url":null,"description":"Proteas wicketkeeper-batsman Quinton de Kock is not only handy with the willow, he is clearly and excellent fisherman too!","content":"Proteas wicketkeeper-batsman Quinton de Kock is not only handy with the willow, he is clearly an excellent fisherman too! ALSO READ: Duminy to quit Paarl, join Proteas De Kock seizes every available opportunity to take a break from wearing the gloves and get out his fishing rod in the hopes of landing his next ‘big one’. Quinton de Kock quit Test cricket in 2021 And that’s exactly what the 30-year-old did recently! ALSO READ: In and out: Proteas coach backs up his picks Taking to his Instagram page on Monday, 27 February 2023, De Kock wrote: “Finally landed the fish of a life time! Been searching for this dinosaur for a long time and today I finally got it !🤘🎣” ACE | WATCH: Quinton de Kock has a hole-in-one! It’s unclear where De Kock was fishing or what type of fish he landed (anyone able to help?) PICTURE | DE KOCK GOES FISHING ON NEW YEAR’S EVE – LANDS A MONSTER! De Kock more often than not can be spotted on the Knysna Lagoon. As reported by The South African website , De Kock sensationally quit the Test arena in late 2021, but remains part of the Proteas’ ODI and T20I squads. ALSO READ: Bavuma wants Proteas to move on","pubDate":"2023-02-27 19:45:10","image_url":"https://www.thesouthafrican.com/wp-content/themes/jnews-child/assets/images/normal.jpeg.optimal.jpeg","source_id":"thesouthafrican","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Shardul Thakur Marriage: शादी के बंधन में बंधे शार्दुल ठाकुर, मिताली पारुलकर के संग लिए सात फेरे, देखें तस्वीर","link":"https://sports.ndtv.com/hindi/cricket/shardul-thakur-marriage-seven-rounds-for-sharadul-thakur-mithali-parulkar-tied-in-marriage-see-the-picture-shardul-thakur-marriage-pics-and-videos-3820117#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"Shardul Thakur and Mitali Parulkar Marriage Photos: नवंबर 2021 में दोनों ने सगाई की थी. शार्दुल ठाकुर ने अपने इंस्टाग्राम पर भी शादी की तस्वीरें साझा की हैं जिसके ऊपर फैंस लगातार बधाई दे रहे हैं.","content":"शार्दुल ठाकुर, मिथली पारुलकर के साथ मुंबई में शादी के बंधन में बंध गए हैं, शादी समारोह में कई खास लोग शामिल हुए भारतीय टीम के कप्तान रोहित शर्मा (Rohit Sharma) समेत उनकी पत्नी रितिका (Ritika) के संग धनश्री (Chahal Wife Dhanashree) भारतीय टीम के स्टार खिलाड़ी श्रेयस अय्यर (Shreyas Iyer) भी शादी समारोह में शामिल हुए. Congratulations You Beautiful Couple Shardul Thakur and Mittali Parulkar🥹❤️ ✨ शार्दुल और मिताली (Shardul Thakur Marriage Photos) लम्बे समय से रिलेशनशिप में थे और नवंबर 2021 में दोनों ने सगाई भी की थी. शार्दुल ठाकुर ने अपने इंस्टाग्राम पर भी शादी की तस्वीरें साझा की हैं जिसके ऊपर फैंस लगातार बधाई दे रहे हैं. They dance so well! 😭❤️ * * पढ़ें , राजनीति, देश और दुनिया की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-02-27 18:59:21","image_url":"https://c.ndtvimg.com/2023-02/4np4avs8_shardul-thakur_625x300_26_February_23.jpg","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"News24.com | 'It's a special thing': Bavuma revels in elevation to 'most coveted' role of Test captain","link":"https://www.news24.com/sport/Cricket/Proteas/its-a-special-thing-bavuma-revels-in-elevation-to-most-coveted-role-of-test-captain-20230227","keywords":null,"creator":null,"video_url":null,"description":"The Proteas Test captaincy may be a bit of a poisoned chalice when paired with recent results, but it remains a cherished position for Temba Bavuma.","content":"The Proteas Test captaincy may be a bit of a poisoned chalice when paired with recent results, but it remains a cherished position for Temba Bavuma. The 32-year-old Bavuma was announced as Test captain last week Friday by new red-ball coach Shukri Conrad. His career has come full circle with the assumption of the leadership role just as the West Indies Test series is about to start, because it was against the team from the Caribbean that he made his Test debut back in 2014. Bavuma said the elevation means a lot to him and he is happy that Conrad considers him as the best man for the job. READ | 'My whole career was ripped underneath me': Proteas star Brits takes unique path to World Cup dream \"It's probably the most coveted one from a player's perspective but, first and foremost, the dream was always to play Test cricket,\" Bavuma said. \"To have lived that dream and also having the opportunity of leading the team makes it a lot more special and it means a lot to me. \"It means a lot to my family and the people who have supported me in this journey. It's a special thing. \"From him (Conrad), he believed I was the right man to do the job and I have been one of the consistent performers over the past couple of years. \"He believes I have what it takes to turn his vision into a reality.\" With 54 Tests under his belt, Bavuma said he felt more emboldened as a leader compared to when he assumed the white-ball leadership. READ | 'We're dealing with humans': Proteas coach on having to make difficult decisions in picking Test squad \"As great as it was to captain the white-ball team, I came in at a time where I didn't have a lot of experience in white-ball cricket,\" Bavuma, who retains the Proteas ODI captaincy, said. Rob Houwing | Centurion Test: The risk SA spinner is mostly just fielder \"I didn't have more than five games in T20 and ODI cricket (at the time), but things are a bit different now as I have a lot more experience in the red-ball game. \"I know my game and I know what I need to do, but it will be a challenge because the white-ball team has more experience than the red-ball team.\" A slight concern for the former T20 skipper is the lack of red-ball action in store for the Proteas this year, and how this will affect building momentum for the Test team. The Proteas have only three scheduled Tests left for the year: the two matches against the West Indies over the next two weeks and a Boxing Day engagement against India much later in the year. \"There are more opportunities to play white-ball cricket, while Test chances are a bit more limited, so it’s hard to build more substance with only three Tests this year.\"","pubDate":"2023-02-27 18:31:05","image_url":"https://scripts.24.co.za/img/sites/sport24.png","source_id":"news24","category":["sports"],"country":["south africa"],"language":"english"},{"title":"News24.com | Proteas Test skipper Bavuma hopes women's game gets more care after World Cup","link":"https://www.news24.com/sport/Cricket/Proteas/proteas-test-skipper-bavuma-hopes-womens-game-gets-more-care-after-world-cup-20230227","keywords":null,"creator":null,"video_url":null,"description":"Proteas captain Temba Bavuma said his team wants to channel the positive energy generated by the success of the women's national cricket team going into their Test series against the West Indies.","content":"Proteas captain Temba Bavuma said his team wants to channel the positive energy generated by the success of the women's national cricket team going into the Test series against the West Indies. Sune Luus's charges recovered from a shock opening T20 World Cup game loss to Sri Lank to bounce back and fight their way into Sunday's final, which they lost by 19 runs to Australia at a packed Newlands. They left the country brimming with pride despite defeat, with Bavuma saying the men's Proteas team have every reason to take inspiration from the achievements of their compatriots. PICS | The drama, elation and agony of SA cricket's maiden World Cup final The women's team became the first senior Proteas team to qualify for an International Cricket Council tournament final, succeeding where the South African men's teams have failed. They also became the first South African team to qualify for a home play-off. Bavuma, who has presided over two failed T20 World Cup campaigns and has since relinquished the T20 captaincy, hoped that the women's team will get better care invested in the women's game in the country. \"It was massive and not just for us, but for the nation,\" Bavuma said. \"All the guys were watching the semi-final and the final, supporting the ladies, and I think for us as a team, we look for areas everywhere where we can get energy and draw inspiration from. \"I'm sure we'll be using that energy going into our games because what the women's team achieved was big, especially with their limited resources. Rob Houwing | Proteas women enter whole new marketability realm \"I hope that with performances like this, there will be a lot more support and a lot more care that'll be invested into the women's team.\" The newly appointed Test captain's first assignment is against the West Indies when they play the first of two Tests starting at SuperSport Park on Tuesday. Bavuma missed the 2021 Test portion of the tour in West Indies due to injury, but he has seen enough of the Islanders to know where their strengths and weaknesses are. \"Looking at the West Indian team over the last while, they play old-fashioned cricket where the batters grind it out and the bowlers are looking to hit their areas,\" he said. READ | Proteas skipper calls on Cricket SA, government to drive women's development \"They've got guys who can stand up to the challenge. They have a guy like (captain Kraigg) Brathwaite, and we saw how he batted in Australia. \"We will have prepared well and as best as we can, as we would against any opposition. In their bowling attack, they have guys who can get the ball through, which is something you need when you play in South Africa. \"We'll have our work cut out and we'll be expecting their challenge.\"","pubDate":"2023-02-27 18:31:05","image_url":"https://scripts.24.co.za/img/sites/sport24.png","source_id":"news24","category":["sports"],"country":["south africa"],"language":"english"},{"title":"IND vs AUS: तीसरे टेस्ट से पहले Glenn McGrath ने ऑस्ट्रेलिया टीम पर ही उठाया सवाल, कह दी बड़ी बात","link":"https://sports.ndtv.com/hindi/cricket/ind-vs-aus-glenn-mcgrath-raised-questions-on-australia-team-before-the-third-test-said-a-big-thing-ind-vs-aus-3rd-test-schedule-ind-vs-aus-3rd-test-pl-3820016#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"IND vs AUS 3rd Test: ‘एमआरएफ पेस फाउंडेशन’ में कोचिंग के निदेशक मैकग्रा (Glenn McGrath) ने यहां कहा, ‘‘मुझे लगता है कि वे इस समय (स्टीव) स्मिथ और मार्नस (लाबुशेन) (Glenn McGrath on Steve Smith and Marnus Labuschagne) पर बहुत अधिक निर्भर है.","content":"Glenn McGrath बॉर्डर-गावस्कर ट्रॉफी के पिछले 2 मुकाबलों में भारतीय टीम ने ऑस्ट्रेलिया के ऊपर जबरदस्त जीत दर्ज की, जिसके बाद ऑस्ट्रेलिया के खिलाड़ियों के खेलने के अंदाज पर लगातार सवाल उठने लगे. इसी बीच पूर्व ऑस्ट्रेलियाई तेज गेंदबाज़ ग्लेन मैकग्रा ने ऑस्ट्रेलिया टीम पर ही सवाल उठा दिया है. ऑस्ट्रेलिया के पूर्व दिग्गज तेज गेंदबाज ग्लेन मैकग्रा (Glenn McGrath on Australia Team) ने सोमवार को यहां कहा कि ऑस्ट्रेलियाई टीम भारत में चल रही चार मैचों की टेस्ट श्रृंखला (Ind vs Aus Test Series) में स्टीव स्मिथ (Steve Smith) और मार्नस लाबुशेन (Marnus Labuschagne) पर बहुत अधिक निर्भर है. उन्होंने कहा कि श्रृंखला में वापसी के लिए पूरे बल्लेबाजी क्रम को एकजुट होकर प्रदर्शन करना होगा. भारत ने चार मैचों की श्रृंखला के शुरुआती दो मुकाबलों को जीत कर बॉर्डर-गावस्कर ट्रॉफी (Ind vs Aus 3rd Test Border-Gavaskar Trophy) अपने नाम कर ली है. ‘एमआरएफ पेस फाउंडेशन' में कोचिंग के निदेशक मैकग्रा ने यहां कहा, ‘‘मुझे लगता है कि वे इस समय (स्टीव) स्मिथ और मार्नस (लाबुशेन) (Glenn McGrath on Steve Smith and Marnus Labuschagne) पर बहुत अधिक निर्भर है. ट्रेविस हेड (Travis Head) के लिए यह साल अच्छा रहा है और अब पूरी बल्लेबाजी इकाई को एकजुटता दिखानी होगी.'' ऑस्ट्रेलिया के लिए 124 टेस्ट में 563 विकेट लेने वाले 53 साल के इस पूर्व खिलाड़ी ने कहा, ‘‘ मुझे लगता है कि वे भारत में स्पिन से निपटने की योजना पर अडिग नहीं रहे. पहले टेस्ट में, वे बहुत रक्षात्मक थे जबकि दूसरे टेस्ट में, वे बहुत आक्रामक थे. उन्हें बीच का रास्ता निकाल कर क्रीज पर अधिक समय बिताने पर ध्यान देना होगा.'' मैकग्रा (Glenn McGrath) ने आगे कहा कि तेज गेंदबाज जोश हेजलवुड (Josh Hazlewood), मिचेल स्टार्क (Mitchel Starc) और हरफनमौला कैमरून ग्रीन (Cameron Green) की गैरमौजूदगी ने टीम के संतुलन को प्रभावित किया, लेकिन साथ ही नागपुर में पहले टेस्ट के लिए हेड को बाहर करने जैसे चयन फैसलों पर भी सवाल उठाया. * * पढ़ें , राजनीति, देश और दुनिया की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-02-27 17:52:46","image_url":"https://c.ndtvimg.com/2019-05/irh4bd0o_glenn-mcgrath_625x300_27_May_19.jpg","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"News24.com | STAT ATTACK | Proteas lead the way at T20 World Cup as Wolvaardt, Brits, Kapp shine","link":"https://www.news24.com/sport/Cricket/Proteas/stat-attack-proteas-lead-the-way-at-t20-world-cup-as-wolvaardt-brits-kapp-shine-20230227","keywords":null,"creator":null,"video_url":null,"description":"South Africa might have finished runners-up but the hosts left the ICC T20 World Cup with their heads held high after leading the way among the star performers during the tournament.","content":"Proteas opener Laura Wolvaardt's batting heroics took SA to the brink of winning the ICC T20 Women's World Cup , where they fell 19 runs shy of beating Australia in the final at Newlands in Cape Town. But it was a tournament filled with star home performances. Wolvaardt finished as the highest run-scorer with 230, ahead of England's Nat Sciver-Brunt (216), Australian duo Beth Mooney (206) and Alyssa Healy (189), and Proteas teammate Tazmin Brits (186). Brits was not only in the run-getting column, but also rose highest in the catching statistics, recording seven scalps in six matches, the most by almost double. PICS | The drama, elation and agony of SA cricket's maiden World Cup final Here's a list of South Africa's best performers during the tournament: 230 - The most runs by any batter during the tournament, accumulated by the invaluable Wolvaardt . 117* - The highest batting partnership during the competition shared by Wolvaardt and Brits ' unbeaten opening stand to see off Bangladesh in the Proteas' final group-stage game. 9 - Most wickets by a South African - Marizanne Kapp came third overall in this category with nine wickets, one ahead of teammate Shabnim Ismail, who finished with eight. England's Sophie Ecclestone came out trumps with 11, with Australian pair Ash Gardner and Megan Schutt sharing second place with 10 wickets. 7 - Most tournament catches - Brits was a class apart in the field throughout. The ball really did follow her around the park, whether she was fielding in the inner ring or outfield. 3 - Most 50s - Again, Wolvaardt stood tall, joint-topping this list with Mooney.","pubDate":"2023-02-27 17:01:20","image_url":"https://scripts.24.co.za/img/sites/sport24.png","source_id":"news24","category":["sports"],"country":["south africa"],"language":"english"},{"title":"BUMBLE ON THE TEST: Jack Leach is England's trump card","link":"https://www.dailymail.co.uk/sport/cricket/article-11799773/BUMBLE-TEST-Jack-Leach-Englands-trump-card.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"DAVID LLOYD: The second Test between England and New Zealand hangs in the balance going into the final day. David 'Bumble' Lloyd casts his eye back over day four of the Test.","content":"BUMBLE ON THE TEST: Jack Leach is England's trump card - they needed him badly against New Zealand... and Zak Crawley should be dropped, with Haseeb Hameed coming back in to replace him The second Test between England and New Zealand hangs in the balance England need 210 more runs to win while the hosts require a further nine wickets Some of England's players have shone, but others have struggled massively By David Lloyd for the Daily Mail Published: 15:09 EST, 27 February 2023 | Updated: 17:01 EST, 27 February 2023 e-mail 1 View comments The second Test between England and New Zealand hangs in the balance going into the final day , with Ben Stokes ' side requiring 210 more runs for victory. After putting New Zealand back into bat in the follow on, Tim Southee's side put on an impressive 483, setting their visitors 258 runs to win. Zak Crawley fell for 24, but fellow opener Ben Duckett is 23 not out overnight and nightwatchman Ollie Robinson is unbeaten on one. New Zealand require nine wickets to square the series at one apiece, but, rain aside, we should see a result of sorts in Wellington. David 'Bumble' Lloyd casts his eye back over day four of the second Test. Bowler Jack Leach was England's trump card against New Zealand and was needed by his side Kane Williamson scored a fine century for New Zealand before being dismissed by Harry Brook Jack's a trump card There are many times when the balance of a team is discussed — whether to leave out the spinner to play an extra this or that. But boy did England need Jack Leach in this match. All 61.3 overs of him in the second innings. Yes, it looked like a seamer’s paradise at the start of proceedings but it would have been foolhardy not to include Leach, who turned in one of his best performances, occupying one end to give the seamers a rest and taking a five-for to boot. Brook has Midas touch Harry Brook can do no wrong. He has been batting like Don Bradman and now he fancies himself with the ball. England turned to the unlikeliest source in asking the 24-year-old to turn his arm over but he came up trumps with the prize wicket of New Zealand’s Kane Williamson. It was hardly Fred Trueman charging in from the Kirkstall Lane end, more like a slow motion Mike Procter, bowling off the wrong foot. Whatever it looked like, and however fortuitous the leg-side tickle, crucially it said ‘out’ in the book. Zak out, Hameed in I love the togetherness and loyalty in this England team but you cannot carry on with an opener who is not scoring runs. Another failure for Zak Crawley should provide an opportunity for someone else to come in and do the job. Sometimes it is better for the struggling player themselves to be left out. It would not be fair to ask Jonny Bairstow to open, so having watched lots of county cricket last year, my preference would be a recall for Haseeb Hameed — with honourable mentions for Dom Sibley and Keaton Jennings. Zak Crawley has struggled massively for England in recent times and may be out the side soon Captain Ben Stokes hasn't bowled much lately and his lack of overs is a worry for England Ben's bowling a big miss Ben Stokes is going to be a problem going forward if he is a captain-batter who only bowls occasionally. Knee niggles need careful management and the more you keep off them, the better they heal. But the issue I foresee is that an occasional bowler eventually doesn’t bowl at all, and if you don’t bowl at all you cannot develop rhythm or stamina. I think England will be crying out for one of Stokes’s signature spells this summer against Australia, the kind Andrew Flintoff used to produce, but miles in the legs are required to do that. Beefy's welly trip A Test in Wellington reminds me of England’s last trip there. Jonathan Agnew called the troops together in the build-up, the rendezvous point a local fish shack. A long lunch spilled into dinner over the road, where a certain IT Botham returned from the bar with a tray of drinks, fell down five steps but didn’t spill a drop! Such agility was inconspicuous at the end of the night, though. The harbour road in the city has four lanes each way and on sight of the green man, Beefy burst into a gentle jog… and landed face first on the ground. Share or comment on this article: BUMBLE ON THE TEST: Jack Leach is England's trump card e-mail Add comment Comments 1 Share what you think Newest Oldest Best rated Worst rated View all The comments below have been moderated in advance. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-02-27 21:55:54","image_url":"https://i.dailymail.co.uk/1s/2023/02/27/20/68140289-0-image-m-29_1677528037609.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"If you don’t score in India, you will get flak: Ganguly on K. L. Rahul","link":"https://kashmirreader.com/2023/02/28/if-you-dont-score-in-india-you-will-get-flak-ganguly-on-k-l-rahul/","keywords":["SPORTS"],"creator":["Press Trust of India"],"video_url":null,"description":"Stripped of vice-captaincy, Rahul hasn’t crossed 25-run mark in his last 10 tests NEW DELHI: It will be difficult for K.L. Rahul to avoid scathing criticism for his protracted poor run because of the enormous expectations attached with the job, especially when past cricketers have set high standards, says former India skipper Sourav Ganguly. Stripped […]","content":"Stripped of vice-captaincy, Rahul hasn’t crossed 25-run mark in his last 10 tests NEW DELHI: It will be difficult for K.L. Rahul to avoid scathing criticism for his protracted poor run because of the enormous expectations attached with the job, especially when past cricketers have set high standards, says former India skipper Sourav Ganguly. Stripped of vice-captaincy, Rahul hasn’t crossed 25-run mark in his last 10 Test knocks. An average of less than 35 in 47 Tests isn’t an actual realisation of his real potential. “When you don’t score runs in India, obviously you will get flak. KL Rahul hasn’t been the only one. There have been players in the past also,” Ganguly told PTI in an exclusive interview on the sidelines of Delhi Capitals’ IPL pre-season camp. Ganguly tried to put things in perspective as to why the Bengaluru man is being persisted with despite repeated failures. “There’s so much focus and attention with a lot of pressure on players. The team management thinks he is an important player for the team. At the end of the day, what coach and captain thinks is important,” the veteran of 113 Tests and 311 ODIs said. While Rahul has played some quality knocks in England and Australia, Ganguly said it’s obvious that people will expect way more from a talented player like Rahul, who has managed just five Test hundreds in nine years. “He has performed but obviously you expect a lot more from a top-order batter playing for India because the standards set by others are so high.” “When you fail for a while, obviously there will be criticism. I am sure Rahul has the ability and I am sure as and when he gets more opportunities, he will have to find ways to score,” he explained. So is Rahul’s problem technical or mental? “Both,” pat comes the reply. But the former BCCI President also gave an interesting insight into Rahul’s lack of runs as he is getting out to pacers as well as spinners in all conditions in recent times. “It also makes it hard if you are playing on these sort of pitches as the balls are turning and bouncing. There’s uneven bounce and when you are not in form, it makes it even more harder.” Shubman has to wait There has been a clamour to include Shubman Gill in the playing XI but Ganguly feels that the Punjab man will get his share of chances and there’s no harm if he has to wait a little bit. But what do you tell a Shubman, who has to cool his heels when he is in red hot form? “I am sure when his time comes, he will also get a lot of opportunities. I think the selectors, the captain and the coach think of him and rate him very highly. That’s why he is playing ODIs and T20Is, and he has performed as well.” “But at the present moment, perhaps message from team management is that he has to wait.” While India has cantered to victories in both the Tests, the top order batters except Rohit Sharma have flattered to deceive with none getting a fifty. Is the concept of dominant batters against spinners sounding too alien nowadays? “I don’t think so. These are very tough wickets. I saw in the first two Tests and it’s not easy boss. Playing Ashwin, Jadeja, Lyon and the new guy Todd Murphy, it is never easy with odd ball turning square. There is unevenness, there is everything happening for spinners.” This is not Steve Waugh’s team India has won two Test matches in a cumulative duration of five days of cricket and Ganguly isn’t surprised. “India is a different beast in India. They are a pretty good team all around but in India, they are pretty hard to beat. When it starts turning, they are a better side than anyone,” he was sharp in his response. Is the scoreline of 4-0 a real possibility for India? “I think so. I don’t know how Australia can stop it,” he was practical while assessing Australia’s performance. “The problem is, we keep comparing this Australian team to the teams of the past and it’s not the same. You don’t have a Matthew Hayden, Justin Langer, Ricky Ponting, Steve and Mark Waugh, (Adam) Gilchrist, you name them. You don’t have that quality.” “Steve Smith is a great player. (David) Warner hasn’t got going, (Marnus) Labuschagne is a good player but these are tough conditions for him as well.” “The mistake we make with Australian teams is that we think they are Steve Waugh’s Australia but that’s not the case. Different players get tested differently in different conditions.” Been in touch with Pant Ganguly is the Director of Cricket for the Delhi Capitals and one of the toughest challenges for him is to fill in the void created due to the unavailability of Rishabh Pant, who met with a horrific accident and underwent surgery recently. “I spoke to him a couple of times. Obviously, he is going through a tough period, through injuries and surgeries and I wish him well. In a year’s time or maybe in a couple of years’ time, he will be back playing for India,” Ganguly’s voice had a tinge of sadness as he spoke about a player he has been very fond of. Will he like to see Pant being with the team for some time during IPL which could also help in his recovery. “Don’t know. We will see,” Ganguly said. DC is yet to announce Pant’s replacement and Ganguly is still undecided on who is better between young turk Abhishek Porel and domestic veteran Sheldon Jackson. “We still need a bit of time to figure it out. The next camp starts before IPL.” While David Warner is set to lead DC, Axar Patel will be his deputy this season. Ganguly monitored a three-day camp in Kolkata which the likes of Prithvi Shaw, Ishant Sharma, Chetan Sakariya, Manish Pandey attended along with other domestic players. “The IPL is still a month away and the season has just started. It is difficult to get all the players together for the amount of cricket they play. There are four or five who are playing Irani Trophy. Sarfaraz has an injured finger and it’s not a broken finger. He should be okay for the IPL,” he concluded. PTI If you don’t score in India, you will get flak: Ganguly on K. L. Rahul added by Press Trust of India on 1:28 am February 28, 2023 View all posts by Press Trust of India → Press Trust of India Facebook Twitter WhatsApp Email Print Related","pubDate":"2023-02-27 19:58:44","image_url":null,"source_id":"kashmirreader","category":["sports"],"country":["india"],"language":"english"},{"title":"Richa Ghosh only Indian in ICC’s ‘Most Valuable Team’ of Women’s T20 World Cup","link":"https://kashmirreader.com/2023/02/28/richa-ghosh-only-indian-in-iccs-most-valuable-team-of-womens-t20-world-cup/","keywords":["SPORTS"],"creator":["KR Desk"],"video_url":null,"description":"NEW DELHI: Having made her presence felt in ICC Women’s Under-19 T20 World Cup, Richa Ghosh continued her good form into the senior Women’s T20 World Cup that concluded on Sunday. Richa’s aggressive batting during India’s run to the semi-finals of the Women’s T20 World Cup saw her make into the ICC’s Most Valuable Team […]","content":"NEW DELHI: Having made her presence felt in ICC Women’s Under-19 T20 World Cup, Richa Ghosh continued her good form into the senior Women’s T20 World Cup that concluded on Sunday. Richa’s aggressive batting during India’s run to the semi-finals of the Women’s T20 World Cup saw her make into the ICC’s Most Valuable Team of the tournament. The 19-year-old wicket-keeper is the only Indian to find a place in the team. The middle-order batter ended the tournament with 136 runs at a strike rate of 130.76 that included crucial knocks of 31 not out vs Pakistan, 44 not out vs West Indies and 47 not out vs England. She led the tournament in dismissals with seven (five catches, two stumpings). Four players from Australia, who lifted the trophy for a record-extending sixth time, figure in the XI. They are wicketkeeper-opener Alyssa Healy, who scored 189 runs at 47.25 and effected four dismissals, all-rounder Ashleigh Gardner, who scored 110 runs at 36.66 and grabbed 10 wickets at 12.50, Darcie Brown (seven wickets at 15.00) and Megan Schutt (10 wickets at 12.50). The team was chosen by a panel of experts, including commentator and former West Indies player Ian Bishop and ex-Australian woman cricketer Melanie Jones, among others. Most Valuable Team of the Women’s T20 World Cup (in batting order): Tazmin Brits (South Africa) 186 runs at 37.20; Alyssa Healy (wk) (Australia) 189 runs at 47.25 and four dismissals; Laura Wolvaardt (South Africa) 230 runs at 46.00; Nat Sciver-Brunt (c) (England) 216 runs at 72.00; Ashleigh Gardner (Australia) 110 runs at 36.66 and 10 wickets at 12.50; Richa Ghosh (India) 136 runs at 68.00; Sophie Ecclestone (England) 11 wickets at 7.54; Karishma Ramharack (West Indies) 5 wickets at 10.00; Shabnim Ismail (South Africa) 8 wickets at 16.12; Darcie Brown (Australia) 7 wickets at 15.00; Megan Schutt (Australia) 10 wickets at 12.50; 12th player: Orla Prendergast (Ireland) 109 runs at 27.25 and 3 wickets at 26.00. PTI /Agencies Richa Ghosh only Indian in ICC’s ‘Most Valuable Team’ of Women’s T20 World Cup added by KR Desk on 1:28 am February 28, 2023 View all posts by KR Desk → KR Desk Facebook Twitter WhatsApp Email Print Related","pubDate":"2023-02-27 19:58:16","image_url":null,"source_id":"kashmirreader","category":["sports"],"country":["india"],"language":"english"},{"title":"ITV to show 16 regular season games of this year's IPL","link":"https://www.dailymail.co.uk/sport/cricket/article-11799141/ITV-16-regular-season-games-years-IPL.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"EXCLUSIVE BY MATT HUGHES: The two broadcasters have combined to take the IPL from current rights holders Sky Sports on a five-year deal.","content":"ITV snap up IPL rights with one quarter of this year's tournament to be shown on free-to-air TV in the UK alongside main holder DAZN ITV are to share a portion of the coverage with main rights holders DAZN Comes after Sky Sports decided to walk away from the auction to host coverage The UK is the second biggest market for the tournament after India itself By Matt Hughes For The Daily Mail Published: 16:41, 27 February 2023 | Updated: 19:52, 27 February 2023 e-mail 1 View comments ITV and DAZN have bought live TV rights for this year’s IPL in an innovate deal that will see a quarter of the competition broadcast on free-to-air television. Sportsmail has learned that the two broadcasters have combined to take the IPL from current rights holders Sky Sports on a five-year deal, with 16 regular season matches to be shown exclusively on ITV and DAZN taking the other 58 games including the play-offs and final. DAZN are understood to be funding the majority of the deal in their first foray into cricket broadcasting in this country, but have opted to sub-licence some of the games to ITV in an attempt to grow a bigger audience. The streaming service already hold IPL rights in Australia and South Africa , but the UK is the biggest market outside India . All 74 matches will be shown live. The IPL has been broadcast by Sky Sports for the last three years with their willingness to walk away from the rights auction a sign of their increasingly cost-conscious approach and desire to focus on the English domestic season and ICC global events. ITV will show a quarter of this year's IPL meaning a return of the tournament to free-to-air television in the UK Sam Curran became the most expensive cricketer of all time in December when he was picked up by the Punjab Kings for £1.85m BT Sport have snapped up the rights for England tours to New Zealand, Australia and West Indies in recent years, with Sky preferring to concentrate on England’s home season, World Cups and the Hundred. ITV previously held the rights for the IPL between 2010 and 2014, and are expected to show this year’s competition on ITV4. The IPL’s domestic TV deal in India with Star Sports is worth £5billion, making it the second most lucrative competition in the world across all sports on a per-match basis at £14m-per-game after the NFL. The season starts with GT vs CSK on 31 March and the India rights are split between Star (TV) & Viacom (streaming). Share or comment on this article: ITV to show 16 regular season games of this year's IPL e-mail Add comment Comments 1 Share what you think Newest Oldest Best rated Worst rated View all The comments below have been moderated in advance. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-02-27 19:52:38","image_url":"https://i.dailymail.co.uk/1s/2023/02/27/16/68134841-0-image-m-35_1677515939207.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Quinton de Kock lands the ‘fish of a lifetime’ – PICTURES","link":"https://www.thesouthafrican.com/sport/cricket/proteas/quinton-de-kock-lands-fish-of-a-lifetime-images-pictures-breaking-27-february-2023/","keywords":["Proteas","Featured","fishing","Important","latest cricket news","Quinton de Kock"],"creator":["Garrin Lambley"],"video_url":null,"description":"Proteas wicketkeeper-batsman Quinton de Kock is not only handy with the willow, he is clearly and excellent fisherman too!","content":"Proteas wicketkeeper-batsman Quinton de Kock is not only handy with the willow, he is clearly an excellent fisherman too! ALSO READ: Duminy to quit Paarl, join Proteas De Kock seizes every available opportunity to take a break from wearing the gloves and get out his fishing rod in the hopes of landing his next ‘big one’. Quinton de Kock quit Test cricket in 2021 And that’s exactly what the 30-year-old did recently! ALSO READ: In and out: Proteas coach backs up his picks Taking to his Instagram page on Monday, 27 February 2023, De Kock wrote: “Finally landed the fish of a life time! Been searching for this dinosaur for a long time and today I finally got it !🤘🎣” ACE | WATCH: Quinton de Kock has a hole-in-one! It’s unclear where De Kock was fishing or what type of fish he landed (anyone able to help?) PICTURE | DE KOCK GOES FISHING ON NEW YEAR’S EVE – LANDS A MONSTER! De Kock more often than not can be spotted on the Knysna Lagoon. As reported by The South African website , De Kock sensationally quit the Test arena in late 2021, but remains part of the Proteas’ ODI and T20I squads. ALSO READ: Bavuma wants Proteas to move on","pubDate":"2023-02-27 19:45:10","image_url":"https://www.thesouthafrican.com/wp-content/themes/jnews-child/assets/images/normal.jpeg.optimal.jpeg","source_id":"thesouthafrican","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Shardul Thakur Marriage: शादी के बंधन में बंधे शार्दुल ठाकुर, मिताली पारुलकर के संग लिए सात फेरे, देखें तस्वीर","link":"https://sports.ndtv.com/hindi/cricket/shardul-thakur-marriage-seven-rounds-for-sharadul-thakur-mithali-parulkar-tied-in-marriage-see-the-picture-shardul-thakur-marriage-pics-and-videos-3820117#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"Shardul Thakur and Mitali Parulkar Marriage Photos: नवंबर 2021 में दोनों ने सगाई की थी. शार्दुल ठाकुर ने अपने इंस्टाग्राम पर भी शादी की तस्वीरें साझा की हैं जिसके ऊपर फैंस लगातार बधाई दे रहे हैं.","content":"शार्दुल ठाकुर, मिथली पारुलकर के साथ मुंबई में शादी के बंधन में बंध गए हैं, शादी समारोह में कई खास लोग शामिल हुए भारतीय टीम के कप्तान रोहित शर्मा (Rohit Sharma) समेत उनकी पत्नी रितिका (Ritika) के संग धनश्री (Chahal Wife Dhanashree) भारतीय टीम के स्टार खिलाड़ी श्रेयस अय्यर (Shreyas Iyer) भी शादी समारोह में शामिल हुए. Congratulations You Beautiful Couple Shardul Thakur and Mittali Parulkar🥹❤️ ✨ शार्दुल और मिताली (Shardul Thakur Marriage Photos) लम्बे समय से रिलेशनशिप में थे और नवंबर 2021 में दोनों ने सगाई भी की थी. शार्दुल ठाकुर ने अपने इंस्टाग्राम पर भी शादी की तस्वीरें साझा की हैं जिसके ऊपर फैंस लगातार बधाई दे रहे हैं. They dance so well! 😭❤️ * * पढ़ें , राजनीति, देश और दुनिया की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-02-27 18:59:21","image_url":"https://c.ndtvimg.com/2023-02/4np4avs8_shardul-thakur_625x300_26_February_23.jpg","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"News24.com | 'It's a special thing': Bavuma revels in elevation to 'most coveted' role of Test captain","link":"https://www.news24.com/sport/Cricket/Proteas/its-a-special-thing-bavuma-revels-in-elevation-to-most-coveted-role-of-test-captain-20230227","keywords":null,"creator":null,"video_url":null,"description":"The Proteas Test captaincy may be a bit of a poisoned chalice when paired with recent results, but it remains a cherished position for Temba Bavuma.","content":"The Proteas Test captaincy may be a bit of a poisoned chalice when paired with recent results, but it remains a cherished position for Temba Bavuma. The 32-year-old Bavuma was announced as Test captain last week Friday by new red-ball coach Shukri Conrad. His career has come full circle with the assumption of the leadership role just as the West Indies Test series is about to start, because it was against the team from the Caribbean that he made his Test debut back in 2014. Bavuma said the elevation means a lot to him and he is happy that Conrad considers him as the best man for the job. READ | 'My whole career was ripped underneath me': Proteas star Brits takes unique path to World Cup dream \"It's probably the most coveted one from a player's perspective but, first and foremost, the dream was always to play Test cricket,\" Bavuma said. \"To have lived that dream and also having the opportunity of leading the team makes it a lot more special and it means a lot to me. \"It means a lot to my family and the people who have supported me in this journey. It's a special thing. \"From him (Conrad), he believed I was the right man to do the job and I have been one of the consistent performers over the past couple of years. \"He believes I have what it takes to turn his vision into a reality.\" With 54 Tests under his belt, Bavuma said he felt more emboldened as a leader compared to when he assumed the white-ball leadership. READ | 'We're dealing with humans': Proteas coach on having to make difficult decisions in picking Test squad \"As great as it was to captain the white-ball team, I came in at a time where I didn't have a lot of experience in white-ball cricket,\" Bavuma, who retains the Proteas ODI captaincy, said. Rob Houwing | Centurion Test: The risk SA spinner is mostly just fielder \"I didn't have more than five games in T20 and ODI cricket (at the time), but things are a bit different now as I have a lot more experience in the red-ball game. \"I know my game and I know what I need to do, but it will be a challenge because the white-ball team has more experience than the red-ball team.\" A slight concern for the former T20 skipper is the lack of red-ball action in store for the Proteas this year, and how this will affect building momentum for the Test team. The Proteas have only three scheduled Tests left for the year: the two matches against the West Indies over the next two weeks and a Boxing Day engagement against India much later in the year. \"There are more opportunities to play white-ball cricket, while Test chances are a bit more limited, so it’s hard to build more substance with only three Tests this year.\"","pubDate":"2023-02-27 18:31:05","image_url":"https://scripts.24.co.za/img/sites/sport24.png","source_id":"news24","category":["sports"],"country":["south africa"],"language":"english"},{"title":"News24.com | Proteas Test skipper Bavuma hopes women's game gets more care after World Cup","link":"https://www.news24.com/sport/Cricket/Proteas/proteas-test-skipper-bavuma-hopes-womens-game-gets-more-care-after-world-cup-20230227","keywords":null,"creator":null,"video_url":null,"description":"Proteas captain Temba Bavuma said his team wants to channel the positive energy generated by the success of the women's national cricket team going into their Test series against the West Indies.","content":"Proteas captain Temba Bavuma said his team wants to channel the positive energy generated by the success of the women's national cricket team going into the Test series against the West Indies. Sune Luus's charges recovered from a shock opening T20 World Cup game loss to Sri Lank to bounce back and fight their way into Sunday's final, which they lost by 19 runs to Australia at a packed Newlands. They left the country brimming with pride despite defeat, with Bavuma saying the men's Proteas team have every reason to take inspiration from the achievements of their compatriots. PICS | The drama, elation and agony of SA cricket's maiden World Cup final The women's team became the first senior Proteas team to qualify for an International Cricket Council tournament final, succeeding where the South African men's teams have failed. They also became the first South African team to qualify for a home play-off. Bavuma, who has presided over two failed T20 World Cup campaigns and has since relinquished the T20 captaincy, hoped that the women's team will get better care invested in the women's game in the country. \"It was massive and not just for us, but for the nation,\" Bavuma said. \"All the guys were watching the semi-final and the final, supporting the ladies, and I think for us as a team, we look for areas everywhere where we can get energy and draw inspiration from. \"I'm sure we'll be using that energy going into our games because what the women's team achieved was big, especially with their limited resources. Rob Houwing | Proteas women enter whole new marketability realm \"I hope that with performances like this, there will be a lot more support and a lot more care that'll be invested into the women's team.\" The newly appointed Test captain's first assignment is against the West Indies when they play the first of two Tests starting at SuperSport Park on Tuesday. Bavuma missed the 2021 Test portion of the tour in West Indies due to injury, but he has seen enough of the Islanders to know where their strengths and weaknesses are. \"Looking at the West Indian team over the last while, they play old-fashioned cricket where the batters grind it out and the bowlers are looking to hit their areas,\" he said. READ | Proteas skipper calls on Cricket SA, government to drive women's development \"They've got guys who can stand up to the challenge. They have a guy like (captain Kraigg) Brathwaite, and we saw how he batted in Australia. \"We will have prepared well and as best as we can, as we would against any opposition. In their bowling attack, they have guys who can get the ball through, which is something you need when you play in South Africa. \"We'll have our work cut out and we'll be expecting their challenge.\"","pubDate":"2023-02-27 18:31:05","image_url":"https://scripts.24.co.za/img/sites/sport24.png","source_id":"news24","category":["sports"],"country":["south africa"],"language":"english"},{"title":"IND vs AUS: तीसरे टेस्ट से पहले Glenn McGrath ने ऑस्ट्रेलिया टीम पर ही उठाया सवाल, कह दी बड़ी बात","link":"https://sports.ndtv.com/hindi/cricket/ind-vs-aus-glenn-mcgrath-raised-questions-on-australia-team-before-the-third-test-said-a-big-thing-ind-vs-aus-3rd-test-schedule-ind-vs-aus-3rd-test-pl-3820016#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"IND vs AUS 3rd Test: ‘एमआरएफ पेस फाउंडेशन’ में कोचिंग के निदेशक मैकग्रा (Glenn McGrath) ने यहां कहा, ‘‘मुझे लगता है कि वे इस समय (स्टीव) स्मिथ और मार्नस (लाबुशेन) (Glenn McGrath on Steve Smith and Marnus Labuschagne) पर बहुत अधिक निर्भर है.","content":"Glenn McGrath बॉर्डर-गावस्कर ट्रॉफी के पिछले 2 मुकाबलों में भारतीय टीम ने ऑस्ट्रेलिया के ऊपर जबरदस्त जीत दर्ज की, जिसके बाद ऑस्ट्रेलिया के खिलाड़ियों के खेलने के अंदाज पर लगातार सवाल उठने लगे. इसी बीच पूर्व ऑस्ट्रेलियाई तेज गेंदबाज़ ग्लेन मैकग्रा ने ऑस्ट्रेलिया टीम पर ही सवाल उठा दिया है. ऑस्ट्रेलिया के पूर्व दिग्गज तेज गेंदबाज ग्लेन मैकग्रा (Glenn McGrath on Australia Team) ने सोमवार को यहां कहा कि ऑस्ट्रेलियाई टीम भारत में चल रही चार मैचों की टेस्ट श्रृंखला (Ind vs Aus Test Series) में स्टीव स्मिथ (Steve Smith) और मार्नस लाबुशेन (Marnus Labuschagne) पर बहुत अधिक निर्भर है. उन्होंने कहा कि श्रृंखला में वापसी के लिए पूरे बल्लेबाजी क्रम को एकजुट होकर प्रदर्शन करना होगा. भारत ने चार मैचों की श्रृंखला के शुरुआती दो मुकाबलों को जीत कर बॉर्डर-गावस्कर ट्रॉफी (Ind vs Aus 3rd Test Border-Gavaskar Trophy) अपने नाम कर ली है. ‘एमआरएफ पेस फाउंडेशन' में कोचिंग के निदेशक मैकग्रा ने यहां कहा, ‘‘मुझे लगता है कि वे इस समय (स्टीव) स्मिथ और मार्नस (लाबुशेन) (Glenn McGrath on Steve Smith and Marnus Labuschagne) पर बहुत अधिक निर्भर है. ट्रेविस हेड (Travis Head) के लिए यह साल अच्छा रहा है और अब पूरी बल्लेबाजी इकाई को एकजुटता दिखानी होगी.'' ऑस्ट्रेलिया के लिए 124 टेस्ट में 563 विकेट लेने वाले 53 साल के इस पूर्व खिलाड़ी ने कहा, ‘‘ मुझे लगता है कि वे भारत में स्पिन से निपटने की योजना पर अडिग नहीं रहे. पहले टेस्ट में, वे बहुत रक्षात्मक थे जबकि दूसरे टेस्ट में, वे बहुत आक्रामक थे. उन्हें बीच का रास्ता निकाल कर क्रीज पर अधिक समय बिताने पर ध्यान देना होगा.'' मैकग्रा (Glenn McGrath) ने आगे कहा कि तेज गेंदबाज जोश हेजलवुड (Josh Hazlewood), मिचेल स्टार्क (Mitchel Starc) और हरफनमौला कैमरून ग्रीन (Cameron Green) की गैरमौजूदगी ने टीम के संतुलन को प्रभावित किया, लेकिन साथ ही नागपुर में पहले टेस्ट के लिए हेड को बाहर करने जैसे चयन फैसलों पर भी सवाल उठाया. * * पढ़ें , राजनीति, देश और दुनिया की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-02-27 17:52:46","image_url":"https://c.ndtvimg.com/2019-05/irh4bd0o_glenn-mcgrath_625x300_27_May_19.jpg","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"News24.com | STAT ATTACK | Proteas lead the way at T20 World Cup as Wolvaardt, Brits, Kapp shine","link":"https://www.news24.com/sport/Cricket/Proteas/stat-attack-proteas-lead-the-way-at-t20-world-cup-as-wolvaardt-brits-kapp-shine-20230227","keywords":null,"creator":null,"video_url":null,"description":"South Africa might have finished runners-up but the hosts left the ICC T20 World Cup with their heads held high after leading the way among the star performers during the tournament.","content":"Proteas opener Laura Wolvaardt's batting heroics took SA to the brink of winning the ICC T20 Women's World Cup , where they fell 19 runs shy of beating Australia in the final at Newlands in Cape Town. But it was a tournament filled with star home performances. Wolvaardt finished as the highest run-scorer with 230, ahead of England's Nat Sciver-Brunt (216), Australian duo Beth Mooney (206) and Alyssa Healy (189), and Proteas teammate Tazmin Brits (186). Brits was not only in the run-getting column, but also rose highest in the catching statistics, recording seven scalps in six matches, the most by almost double. PICS | The drama, elation and agony of SA cricket's maiden World Cup final Here's a list of South Africa's best performers during the tournament: 230 - The most runs by any batter during the tournament, accumulated by the invaluable Wolvaardt . 117* - The highest batting partnership during the competition shared by Wolvaardt and Brits ' unbeaten opening stand to see off Bangladesh in the Proteas' final group-stage game. 9 - Most wickets by a South African - Marizanne Kapp came third overall in this category with nine wickets, one ahead of teammate Shabnim Ismail, who finished with eight. England's Sophie Ecclestone came out trumps with 11, with Australian pair Ash Gardner and Megan Schutt sharing second place with 10 wickets. 7 - Most tournament catches - Brits was a class apart in the field throughout. The ball really did follow her around the park, whether she was fielding in the inner ring or outfield. 3 - Most 50s - Again, Wolvaardt stood tall, joint-topping this list with Mooney.","pubDate":"2023-02-27 17:01:20","image_url":"https://scripts.24.co.za/img/sites/sport24.png","source_id":"news24","category":["sports"],"country":["south africa"],"language":"english"}]}