{"newsArray":[{"title":"Shane Warne dies age 52 – Liz Hurley pays tribute to cricket legend after star was found dead in Thailand villa","link":"https://www.thesun.co.uk/sport/17845101/shane-warne-death-news-liz-hurley/","keywords":["Cricket","Sport","Australia Cricket Team","Celebrity deaths","Live Blogs","Sport Live Blogs"],"creator":["Louis Allwood"],"video_url":null,"description":"LIZ HURLEY and her son broke silence to ‘Lionheart ex-fiance Shane Warne. Liz Hurley broke her silence to pay tribute to Warne, who was with pals at a luxury villa in Thailand when he was found unresponsive on Friday. She said: “I feel like the sun has gone behind a cloud forever. RIP my beloved Lionheart.” Liz […]","content":"LIZ HURLEY and her son broke silence to ‘Lionheart ex-fiance Shane Warne. Liz Hurley broke her silence to pay tribute to Warne, who was with pals at a luxury villa in Thailand when he was found unresponsive on Friday. She said: “I feel like the sun has gone behind a cloud forever. RIP my beloved Lionheart.” Liz also took to her Instagram to share seven touching snaps with the cricketer as she broke her silence. Hurley’s teenage son Damian also paid tribute. Taking to his Instagram, he wrote: “I’m still trying to wrap my head around this… “SW was a father figure to me for most of my formative years and was truly one the best men I’ve ever known. “My heart is broken. Thinking of and sending love to all SW’s family.”  The pair were in a relationship with the cricket legend, 52, for three years until they split in 2013. Read our Shane Warne live blog below for the latest updates…","pubDate":"2022-03-06 23:01:52","full_description":"LIZ HURLEY and her son broke silence to 'Lionheart ex-fiance Shane Warne. Liz Hurley broke her silence to pay tribute to Warne, who was with pals at a luxury villa in Thailand when he was found unresponsive on Friday. She said: \"I feel like the sun has gone behind a cloud forever. RIP my beloved Lionheart.\" Liz also took to her Instagram to share seven touching snaps with the cricketer as she broke her silence. Hurley's teenage son Damian also paid tribute . Taking to his Instagram, he wrote: \"I’m still trying to wrap my head around this… \"SW was a father figure to me for most of my formative years and was truly one the best men I’ve ever known. \"My heart is broken. Thinking of and sending love to all SW’s family.\" The pair were in a relationship with the cricket legend, 52, for three years until they split in 2013. Read our Shane Warne live blog below for the latest updates... Colonel Sirisombat said Warne’s family had told police the star was suffering health problems before jetting off. He explained: “He had asthma and had seen a doctor about his heart. We learned from his family that he had experienced chest pains when he was back home.” Police confirmed no alcohol or drugs were found in the room. Officers yesterday interviewed Warne’s friends for two hours. They are treating the death as non-suspicious and have ruled out foul play. There were no signs of a break-in or violent argument in the villa room. Warne’s body is due to be transferred to Surat Thani on the Thai mainland. PARAMEDICS told last night how they battled in vain to revive cricket legend Shane Warne as his friends shouted: “Come on, Shane.” His pals also gave CPR after finding tragic Shane, 52, unresponsive in his Thai villa . Paramedic Anuch Han-iam told The Sun on Sunday Warne was unresponsive by the time he and a colleague arrived at the two-storey villa at the Samujan resort at 5pm local time on Friday. He said: “ Shane’s friends were already trying to bring him back to life . \"I took over doing CPR while we waited for an ambulance. “They were desperate. I think one was crying. They were really stressed and panicked. “They kept trying to wake him and I heard someone saying, ‘Come on, Shane. Come on, Shane’. “I could see they were all shocked and I just tried to concentrate and do my best. “There were about four or five other people in the room. All men, there were no women. “ The villa was clean and I didn’t see any beer or cigarettes inside. “There was nothing unusual that made me think they’d been partying. I didn’t know when I arrived that it was Shane Warne. But I know who he is, he’s a star. “I did my best for him and gave all my energy. I’m so sorry that I couldn’t help him.” LIZ Hurley's teenage son Damian has said \"my heart is broken\" over Shane Warne's death. The 19-year-old described his mum's ex-fiance as a\"father figure\" to him growing up. Despite the couple's split in 2013, they continued to enjoy a close friendship, with Liz also paying tribute to him today. Damian wrote on Instagram: \"I’m still trying to wrap my head around this… \"SW was a father figure to me for most of my formative years and was truly one the best men I’ve ever known. \"My heart is broken. Thinking of and sending love to all SW’s family.\" SHANE Warne paid tribute to cricket legend Rod Marsh in a tragic final tweet just hours before he also died from a suspected heart attack. His death came hours after tweeting his “sadness” at the death of Marsh who suffered a heart attack aged 74. He said: “Sad to hear the news that Rod Marsh has passed. He was a legend of our great game & an inspiration to so many young boys & girls. “Rod cared deeply about cricket & gave so much-especially to Australia & England players. Sending lots & lots of love to Ros & the family. RIP mate.” JIMMY ANDERSON paid an emotional tribute to Shane Warne, saying: \"He was so great I thought he was invincible.\" Cricket legend Warne died on Friday after a suspected heart attack at the age of 52. A minute’s silence was held for Warne and ex-wicketkeeper Rod Marsh before Australia’s men and women’s matches against Pakistan and England yesterday. Both Aussie sides wore black armbands with some players donning an extra one to mark the passing of TWO greats. At the women’s World Cup, leggie Alana King touched her armband as a mark of respect after Tammy Beaumont was stumped by Alyssa Healy — niece of Warne’s former Oz team-mate, wicket-keeper Ian. Anderson faced Warne many times, including the leg-spinner’s final Test in the 2007 Ashes in Sydney. Shane Warne’s manager James Erskine shed light on the sportsman’s final moments in Fox Sport special, Remembering Shane Warne. He said the group were due to go for drinks at 5pm when pal Andrew Neophitou knocked on his door and realised “something was wrong”. James added: “He went in there and said ‘come on, you’re going to be late’ and then realised something was wrong. “And he turned him over and gave him CPR and mouth to mouth, which lasted about 20 minutes and then the ambulance came. “They took him to the hospital, which was about a 20-minute drive and I got a phone call about 45 minutes later saying he was pronounced dead.” Shane's only son Jackson, 22, certainly has a touch of his father's locks - and not afraid to go the hard yards. The youngster has even starred on Australia's version of SAS: Who Dares Wins back in 2020. In January 2022, Jackson was pictured with Shane at the Australian Open tennis tournament. And in 2021, the father and son duo shared the front cover of Men's Health Australia. Jackson is a professional poker player and loved to be competitive with his father. Warne and Hurley started dating shortly after her split from husband Arun Nayar in 2010. The couple, who met at the races in July 2010, were spotted kissing in London leading her to tweet that she and Arun had \"separated a few months ago\". Their relationship quickly developed and in 2011 he proposed \"on impulse\" on a yacht in the Med. The pair were engaged until 2013 when they cancelled their wedding. Warne admitted in 2020 that he \"still cares\" about his ex-fiancee and was \"sad\" about the split. Shane Warne was planning to get back to his peak physical condition just days before his tragic death. Warne died suddenly at the age of 52 after a suspected heart attack and was found unresponsive in his villa in Thailand. The Australian hero was putting together what he dubbed \"operation shred\" and was planning to return to top shape by July. The former Australia captain shared a throwback picture of himself on Instagram looking incredibly fit to show how he wanted to look by the summer. Warne posted just four days before his death: \"Operation shred has started (10 days in) & the goal by July is to get back to this shape from a few years ago ! Let’s go.\" Remembering Shane Warne - a repeat documentary in honour of the cricketing legend - is being aired on Sky. Watching it just two days after his death, Piers wrote: \"Felt quite choked up watching Sky’s tribute repeat of their brilliant Shane Warne doc ‘Warne In A Million’.\" He then shared a clip of Shane saying: \"In this day and age we've just got to be a little bit careful. \"But sometimes just say 'get stuffed' to the fun police.\" Piers added: \"Then I got to this bit and laughed out loud. He was so right.\" Like him, Piers says Shane had a deep-rooted aversion to the cancel culture woke brigade, whining snowflakes, lying politicians and political correctness. SHANE Warne had complained about chest pains and seen a doctor for his heart just weeks before his death, police say. The Aussie sporting hero , 52, was found unresponsive in his room by pal Andrew Neophitou at the luxury villa they were staying on Friday. Thai police confirmed they have ruled out any suspicious circumstances following Warne's death. Officers also cited information from the cricketer's family confirming he had asthma and heart issues. Superintendent Yuttana Sirisombat said Warne had experienced chest pains before his death and \"had seen a doctor about his heart\". Warne's body was picked up from a local hospital this morning in a motorcade flanked by the Australian ambassador and local police officers. Shane Warne's family have accepted the offer of a state funeral, says Victorian Premier Dan Andrews. \"It will be an opportunity for Victorians to pay tribute to his contribution to his sport, to our state and the country,\" Andrews said. State funerals are held to honour people of national significance. \"I've spoken with the Warne family again today and they have accepted my offer of a state funeral to remember Shane,\" Andrews said. \"Details will be finalised in the coming days.\" Flowers, beer and photographs have been left at Warne's statue at the Melbourne Cricket Ground as fans paid tribute to the cricket star. THE \"heartbroken\" son of Australian cricket legend Shane Warne still \"expects him to walk in the door\". Warne's long-time manager James Erskine says the entire family are shattered after the icon died from a suspected heart attack. Erskine said Warne’s ex-wife Simone and their three kids Jackson, Brooke and Summer were struggling to come to terms with the loss. Erskine told Weekend Today: “I think the three children are in complete shock. I spoke to them yesterday and again. “Jackson just said, ‘We just expect him to walk in the door. This is like a bad dream’. “I spoke to Simone, who was really upset, and obviously Keith, Shane’s father, is a pretty strong individual but, like everybody he’s just shattered. They can’t believe what’s happened. “I think that’s what happens when you have a sudden death and you’re not expecting it. \"One minute the kids are talking to him every day, the next minute they can’t talk to him and then they start thinking about, ‘he’s not going to be there for my 21st, he’s not going to take me down the aisle’. “All of those sorts of things go through your head. They are having a much harder time than anybody really.” Colonel Sirisombat said investigators were examining whether blood stains in the room were caused by attempts to revive him, or another medical issue. He went on: “So far, no suspicious issue found from the investigations. \"However, the blood stain was seen on the floor which the friends told police was the consequence of CPR practices. “Therefore, the investigators have to scrutinise it clearly before concluding the case and all assumptions still remain.” Colonel Sirisombat said Warne’s family had told police the star was suffering health problems before jetting off. He explained: “He had asthma and had seen a doctor about his heart. We learned from his family that he had experienced chest pains when he was back home.” Police confirmed no alcohol or drugs were found in the room. Officers yesterday interviewed Warne’s friends for two hours. They are treating the death as non-suspicious and have ruled out foul play. There were no signs of a break-in or violent argument in the villa room. Warne’s body is due to be transferred to Surat Thani on the Thai mainland. PARAMEDICS told last night how they battled in vain to revive cricket legend Shane Warne as his friends shouted: “Come on, Shane.” His pals also gave CPR after finding tragic Shane, 52, unresponsive in his Thai villa . Paramedic Anuch Han-iam told The Sun on Sunday Warne was unresponsive by the time he and a colleague arrived at the two-storey villa at the Samujan resort at 5pm local time on Friday. He said: “ Shane’s friends were already trying to bring him back to life . \"I took over doing CPR while we waited for an ambulance. “They were desperate. I think one was crying. They were really stressed and panicked. “They kept trying to wake him and I heard someone saying, ‘Come on, Shane. Come on, Shane’. “I could see they were all shocked and I just tried to concentrate and do my best. “There were about four or five other people in the room. All men, there were no women. “ The villa was clean and I didn’t see any beer or cigarettes inside. “There was nothing unusual that made me think they’d been partying. I didn’t know when I arrived that it was Shane Warne. But I know who he is, he’s a star. “I did my best for him and gave all my energy. I’m so sorry that I couldn’t help him.” Warne and Hurley started dating shortly after her split from husband Arun Nayar in 2010. The couple, who met at the races in July 2010, were spotted kissing in London leading her to tweet that she and Arun had \"separated a few months ago\". Their relationship quickly developed and in 2011 he proposed \"on impulse\" on a yacht in the Med. The pair were engaged until 2013 when they cancelled their wedding. The cricketer claimed no one was to blame for the breakdown of the romance. Warne admitted in 2020 that he \"still cares\" about his ex-fiancee and was \"sad\" about the split. LIZ Hurley's teenage son Damian has said \"my heart is broken\" over Shane Warne's death. The 19-year-old described his mum's ex-fiance as a\"father figure\" to him growing up. Despite the couple's split in 2013, they continued to enjoy a close friendship, with Liz also paying tribute to him today. Damian wrote on Instagram: \"I’m still trying to wrap my head around this… \"SW was a father figure to me for most of my formative years and was truly one the best men I’ve ever known. \"My heart is broken. Thinking of and sending love to all SW’s family.\" With you today is Milica Cosic , bringing you all the latest news and updates on Shane Warne's passing. Shane Warne's manager James Erskine shed light on the sportsman's final moments in Fox Sport special, Remembering Shane Warne. He said the group were due to go for drinks at 5pm when pal Andrew Neophitou knocked on his door and realised \"something was wrong\". James added: \"He went in there and said 'come on, you're going to be late' and then realised something was wrong. \"And he turned him over and gave him CPR and mouth to mouth, which lasted about 20 minutes and then the ambulance came. \"They took him to the hospital, which was about a 20-minute drive and I got a phone call about 45 minutes later saying he was pronounced dead.\" TV presenter Lizzie Cundy said she and Shane Warne shared “many laughs together” in a tribute on Twitter. She said: “I’m absolutely devastated to have just heard my friend Shane Warne has passed away. “A true cricket legend and really lovely chap. “We had many laughs together, I’m heartbroken. “My thoughts and prayers are with his family.” Shane Warne had arrived to Thailand on Thursday with friends for a lad's holiday. Warne had spent the day watching Australia's Test cricketers take on Pakistan from bedroom before the tragedy unfolded. Manager James Erskine explained Warne, who \"hadn't been drinking\", was \"having a lie down\" when he was discovered with no heartbeat. He added: \"He doesn't drink, never took drugs, ever. He hated drugs so nothing untoward. \"He was going to do the things he likes doing. He was going to play in one or two poker competitions, play a lot of golf, be with his kids, that was about it; [to] have time to himself.\" ELIZABETH Hurley has paid tribute to her \"Lionheart\" ex-fiance Shane Warne after he died from a suspected heart attack. The actress was in a relationship with the cricket legend, 52, for three years until they split in 2013. She said: \"I feel like the sun has gone behind a cloud forever. RIP my beloved Lionheart.\" Liz also shared seven touching snaps with the cricketer as she broke her silence on Instagram today. SHANE Warne's final moments have been revealed after the cricket legend died from a suspected heart attack on holiday in Thailand. The Aussie sporting hero , 52, was found unresponsive in his room by pal Andrew Neophitou at the luxury villa they were staying in yesterday. His manager James Erskine shed light on the sportsman's final moments in Fox Sport special, Remembering Shane Warne. He said the group were due to go for drinks at 5pm when Andrew knocked on his door and realised \"something was wrong\". James added: \"He went in there and said 'come on, you're going to be late' and then realised something was wrong. \"And he turned him over and gave him CPR and mouth to mouth, which lasted about 20 minutes and then the ambulance came. \"They took him to the hospital, which was about a 20-minute drive and I got a phone call about 45 minutes later saying he was pronounced dead.\"","image_url":null,"source_id":"thesun","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Striking Warne trait that stuck with Sam Newman","link":"https://wwos.nine.com.au/cricket/shane-warne-death-sam-newman-tribute-to-loyal-friend/118446dd-00bd-4cb3-b4e1-bb6fd45f4dd5","keywords":null,"creator":["wwos"],"video_url":null,"description":"Sam Newman has paid tribute to his great mate Shane Warne after his death, offering a unique insight on their friendship.","content":"Sam Newman has given a wonderful insight into what it was like being one of Shane Warne's friends, recalling the fallen legend's incredible loyalty.Newman was one of millions across the globe who were left in mourning over the weekend following Warne's tragic death in Thailand aged just 52.The pair grew close over the best part of the last three decades, becoming regular golfing buddies following Warne's retirement from all forms of cricket.READ MORE: Paramedic recalls chaotic scenes amid Warne revival attemptREAD MORE: How Warne really felt about Hollywood lifestyleREAD MORE: Warne had 'seen a doctor about his heart', say Thai PoliceNewman recalled how Warne had helped him cope with the sudden loss of his wife, Amanda Brown, in May last year.\"He was so concerned about any people that I introduced him to,\" Newman told 2GB's Ben Fordham.\"He was so engaged with them and so interested in him. He had so many things going on in his life with his business enterprises and sport and commentary, but he honestly went out of his way to make sure (I was okay).\"If you were a friend, you were an unconditional friend. The support he gave me was just amazing.\"I'm a quarter of a century older than him, but the respect he showed me and the concern he showed me because I was a friend of his was almost unrivalled.\"Newman said one of Warne's great traits was his ability to be fully present in a conversation with anyone he met.\"When you meet someone and shake their hand, you can tell someone's character when they shake your hand, he would pierce you with his eyes,\" he said.\"All my friends said he was like a magnet, he would look straight through your eyes and through to the back of your skull, just to see if you were with him.\"Newman has gone through his fair share of controversies during the pair's time as friends, but said Warne always backed him unconditionally.\"Over the 35 years I've known him, I've had some controversial moments in my life and he was always there and he was so fiercely loyal, unconditionally loyal,\" he said.\"He'd back you up and wouldn't have a bad word said about you. He was just a great person. He had an extraordinary magnetism.\"I know we overdo things about how good people are and what we should do with their memory, but you couldn't do enough for that man. He was just a fantastic bloke.\"For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here!","pubDate":"2022-03-06 22:44:52","full_description":"Sam Newman has given a wonderful insight into what it was like being one of Shane Warne 's friends, recalling the fallen legend's incredible loyalty. Newman was one of millions across the globe who were left in mourning over the weekend following Warne's tragic death in Thailand aged just 52 . The pair grew close over the best part of the last three decades, becoming regular golfing buddies following Warne's retirement from all forms of cricket. READ MORE: Paramedic recalls chaotic scenes amid Warne revival attempt READ MORE: How Warne really felt about Hollywood lifestyle READ MORE: Warne had 'seen a doctor about his heart', say Thai Police Newman recalled how Warne had helped him cope with the sudden loss of his wife, Amanda Brown, in May last year . \"He was so concerned about any people that I introduced him to,\" Newman told 2GB's Ben Fordham. \"He was so engaged with them and so interested in him. He had so many things going on in his life with his business enterprises and sport and commentary, but he honestly went out of his way to make sure (I was okay). \"If you were a friend, you were an unconditional friend. The support he gave me was just amazing. \"I'm a quarter of a century older than him, but the respect he showed me and the concern he showed me because I was a friend of his was almost unrivalled.\" Newman said one of Warne's great traits was his ability to be fully present in a conversation with anyone he met. \"When you meet someone and shake their hand, you can tell someone's character when they shake your hand, he would pierce you with his eyes,\" he said. \"All my friends said he was like a magnet, he would look straight through your eyes and through to the back of your skull, just to see if you were with him.\" Newman has gone through his fair share of controversies during the pair's time as friends, but said Warne always backed him unconditionally. \"Over the 35 years I've known him, I've had some controversial moments in my life and he was always there and he was so fiercely loyal, unconditionally loyal,\" he said. \"He'd back you up and wouldn't have a bad word said about you. He was just a great person. He had an extraordinary magnetism. \"I know we overdo things about how good people are and what we should do with their memory, but you couldn't do enough for that man. He was just a fantastic bloke.\" For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here!","image_url":"https://vms-network-images-prod.s3-ap-southeast-2.amazonaws.com/2022/03/415119/070322warnefinaljourney.png","source_id":"nine","country":["australia"],"category":["sports"],"language":"english"},{"title":"‘Shameful’: Indian legend slammed for ‘ordinary’ Warne claim","link":"https://www.foxsports.com.au/cricket/australia/shameful-indian-legend-slammed-for-ordinary-warne-claim/news-story/0d82857414fb9793a6bbc478400b929f","keywords":null,"creator":null,"video_url":null,"description":"Indian cricket great Sunil Gavaskar has been slammed for his untimely remarks over Shane Warne’s status in the game.","content":null,"pubDate":"2022-03-06 22:41:00","full_description":"Indian cricket great Sunil Gavaskar has been slammed for his untimely remarks over Shane Warne’s status in the game. Appearing on Indian show India Today , Gavaskar - the former Indian captain and legendary opening batsman - was asked if he believed Warne was cricket’s greatest spin bowler. Former Indian batsman Sunil Gavaskar has been slammed for his comments on Shane Warne Photo: AFP Source: AFP Gavaskar, who is now a regular pundit, said he believed Test cricket’s greatest wicket-taker and former Sri Lanka bowler Muttiah Muralitharan, as well as India’s litany of spinners, ranked ahead of Warne. “No, I wouldn’t say that no. For me the Indian spinners and Muttiah Muralitharan were better than Shane Warne,” he told India Today . Watch Australia’s Tour of Pakistan on Kayo. Every Test, ODI and T20 Live & On-Demand. New to Kayo? Try 14-Days Free Now > Cricket greats (L-R) Muttiah Muralitharan, Anil Kumble and Shane Warne. Source: News Corp Australia The simple reason for Gavaskar’s beliefs was that Warne did not have the same success against India as other Test playing nations. “Look at Shane Warne’s record against India,” Gavaskar said. “It was pretty ordinary. “In India, he got five wickets only once in Nagpur, and that too because Zaheer Khan swung wildly against him to give him a fifer. Because he did not have much success against Indian players who were very good players of spin, I don’t think I would call him the greatest. “Muttiah Muralitharan with a greater success he had against India, I would rank him over Warne in my book.” READ MORE TALKING POINTS: Awkward Khawaja debate ignites as Pakistan face big ‘problem’ of their own making SAD: Warnie’s perfect final meal revealed as details of Aussie cricket icon’s final hours emerge Shane Warne carries teammate Michael Clarke from field after Clarke's Man of the Match performance in their win over India in Bangalore, India 10/10/2004. Source: AP While Muralitharan (800) finished with more wickets than Warne (708), the Australian, who was voted by Wisden as one of five cricketers of the 20th century, is often regarded as the game’s greatest spinner. Interestingly, Warne played just three matches against Bangladesh and Zimbabwe, taking 17 wickets. Against the same opposition, Muralitharan took 176 wickets from 25 matches. India was the only Test nation that Warne averaged more than 30 against with the ball, with the leg-spinner taking just 43 wickets at 47.18 from 14 matches. Muralitharan took 105 wickets at 32.16 - his second worst record behind Australia, whom he took 59 wickets at 36.06 yet Down Under that average ballooned out to 75.41. Warne is by no means the only spinner whose record against India with the ball did not match the lofty heights it reached against other nations, but he still played a pivotal role in their drought-breaking series win in 2004. READ MORE ‘CAN’T BE GOOD FOR THE EGO’: Warner’s savage reaction to heated teen ‘WHY, OH WHY?’: Khawaja was one shot from perfection until fairytale took a dark wist 10 to remember: Warne's best wickets | 04:17 Nonetheless, the timing of Gavaskar’s comments have been questioned following Warne’s tragic passing on Friday to a suspected heart attack.","image_url":null,"source_id":"foxsports","country":["australia"],"category":["sports"],"language":"english"},{"title":"Warne's perfect final meal revealed by mate","link":"https://wwos.nine.com.au/cricket/shane-warne-death-final-meal-vegemite-on-toast/c5af5314-6dd2-40e9-bb04-06497eed6d4b","keywords":null,"creator":["wwos"],"video_url":null,"description":"One of the friends holidaying with Shane Warne at the Samujan resort has revealed the cricket legend's fitting final meal.","content":"Details surrounding the death of Shane Warne have continued to emerge following the 52-year-old's sudden death, including what he ate for his final meal.One of the friends holidaying with Warne at the Samujan resort in Thailand has shared the group's last moments together before the cricket legend suffered a suspected heart attack.Tom Hall met Warne 15 years ago at a charity poker match, where the pair struck up a relationship. As CEO of The Sporting News, Hall penned an article for that outlet paying tribute to \"the Shane Warne you don't know\".READ MORE: Warne had 'seen a doctor about his heart', say Thai PoliceREAD MORE: Former England captain breaks down during Warne tributeREAD MORE: Warne's manager reveals legend's final momentsAccording to Hall, the day began completely normal.After figuring out how to watch the Australia-Pakistan Test on TV, Hall said Warne had announced that he had brought him a present and \"excitedly\" disappeared into his room.\"You're never quite sure what that means with Shane; it could be a bottle of his 708 gin, his fragrance, some book he thought I would enjoy or a random T-shirt,\" Hall wrote.\"He came back with an armful of clothes looking like he had been at a yard sale. Neo and Gaz were obviously aware of what was going on as Neo pulled out his camera.\"Shane had been working with me at The Sporting News for the past year or so and he presented me with his jumper from the 2005 Ashes Test, his 2008 IPL shirt and a one-day international shirt and cap to place in the TSN offices in Australia and the UK. Amazing gifts I knew the teams would love and cherish.\"As we went through the shirts and jumpers, more stories came out about the first IPL season and how he had inherited a team which had several unknown players in it. They lost their opening game, but Shane told (Rajasthan Royals owner) Manoj Badale, 'Don't worry mate, we'll be OK'. They promptly won the rest of their games and the inaugural IPL title.\"Next, it was time to grab a snack, Warne settling on a reminder of home, an epitome of the larger than life Aussie that he was.\"After joking around with the various cricket gear and Rob and a few others getting pictures with Shane, we decide on a quick bite to eat,\" Hall wrote.\"The conversation ran from poker, to a planned trip to Tulum in Mexico, the upcoming IPL season and the usual assortment of golfing stories.\"I have dined with Shane in many fine establishments, but rather than sample some of the local Thai fare, we tuck into a plate of Vegemite on toast. Shane chomping away: 'Geez, you can't beat Vegemite with some butter, always great wherever you are in the world'.\"An Australian through and through — this was to turn out to be his last meal. Ever the caring father, as I was leaving, he headed up to his bedroom to call his kids.\"For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here!","pubDate":"2022-03-06 22:24:50","full_description":"Details surrounding the death of Shane Warne have continued to emerge following the 52-year-old's sudden death, including what he ate for his final meal. One of the friends holidaying with Warne at the Samujan resort in Thailand has shared the group's last moments together before the cricket legend suffered a suspected heart attack. Tom Hall met Warne 15 years ago at a charity poker match, where the pair struck up a relationship. As CEO of The Sporting News, Hall penned an article for that outlet paying tribute to \"the Shane Warne you don't know\". READ MORE: Warne had 'seen a doctor about his heart', say Thai Police READ MORE: Former England captain breaks down during Warne tribute READ MORE: Warne's manager reveals legend's final moments According to Hall, the day began completely normal. After figuring out how to watch the Australia-Pakistan Test on TV, Hall said Warne had announced that he had brought him a present and \"excitedly\" disappeared into his room. \"You're never quite sure what that means with Shane; it could be a bottle of his 708 gin, his fragrance, some book he thought I would enjoy or a random T-shirt,\" Hall wrote. \"He came back with an armful of clothes looking like he had been at a yard sale. Neo and Gaz were obviously aware of what was going on as Neo pulled out his camera. \"Shane had been working with me at The Sporting News for the past year or so and he presented me with his jumper from the 2005 Ashes Test , his 2008 IPL shirt and a one-day international shirt and cap to place in the TSN offices in Australia and the UK. Amazing gifts I knew the teams would love and cherish. \"As we went through the shirts and jumpers, more stories came out about the first IPL season and how he had inherited a team which had several unknown players in it. They lost their opening game, but Shane told (Rajasthan Royals owner) Manoj Badale, 'Don't worry mate, we'll be OK'. They promptly won the rest of their games and the inaugural IPL title.\" Next, it was time to grab a snack, Warne settling on a reminder of home, an epitome of the larger than life Aussie that he was. \"After joking around with the various cricket gear and Rob and a few others getting pictures with Shane, we decide on a quick bite to eat,\" Hall wrote. \"The conversation ran from poker, to a planned trip to Tulum in Mexico, the upcoming IPL season and the usual assortment of golfing stories. \"I have dined with Shane in many fine establishments, but rather than sample some of the local Thai fare, we tuck into a plate of Vegemite on toast. Shane chomping away: 'Geez, you can't beat Vegemite with some butter, always great wherever you are in the world'. \"An Australian through and through — this was to turn out to be his last meal. Ever the caring father, as I was leaving, he headed up to his bedroom to call his kids.\" For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here !","image_url":"https://vms-network-images-prod.s3-ap-southeast-2.amazonaws.com/2022/03/415119/070322warnefinaljourney.png","source_id":"nine","country":["australia"],"category":["sports"],"language":"english"},{"title":"‘Slow and dead’: Cricket greats slam ‘disappointing’ Pindi highway as Aussies plot late win","link":"https://www.foxsports.com.au/cricket/australia/cricket-2022-australia-vs-pakistan-rawalpindi-pitch-slammed-mark-taylor-reaction-steve-smith-video-highlights/news-story/926c57ea7cd54a78f9e6a6c0033dbda3","keywords":null,"creator":null,"video_url":null,"description":"He was the previous man to lead Australia to Pakistan and equalled Don Bradman’s record score of 334 on the same tour, but even Mark Taylor believes the Rawalpindi pitch is “disappointing”.","content":null,"pubDate":"2022-03-06 21:05:00","full_description":"He was the previous man to lead Australia to Pakistan and equalled Don Bradman’s record score of 334 on the same tour, but even Mark Taylor believes the Rawalpindi pitch is “disappointing”. After three days of cricket, six wickets have fallen for 747 runs - one of which was a spectacular run out by Marnus Labuschagne. Did anybody say road? Or is that highway, or runway? Watch Australia’s Tour of Pakistan on Kayo. Every Test, ODI and T20 Live & On-Demand. New to Kayo? Try 14-Days Free Now > Either way, cricket fans - and pundits - have felt a sense of disappointment at the flat Rawalpindi wicket, which has been a dream for batsmen in mild conditions, for what a series opener with such anticipation. Warner and Shah square off! | 01:06 Former Pakistan batsman Mohammad Hafeez slammed the wicket produced and hit out at his former nation for not forcing the issue. “Slow & dead pitch,” Hafeez tweeted. “Above all low intent so far fading out chances of result in this historic test match. One team have to play very poorly to give a result in this test match. Result oriented cricket is the future of Test cricket not dead drawn games please.” READ MORE ‘CAN’T BE GOOD FOR THE EGO’: Warner’s savage reaction to heated teen ‘WHY, OH WHY?’: Khawaja was one shot from perfection until fairytale took a dark wist Taylor, regarded as the best captain Shane Warne played under, lamented the pitch. “It’s not surprising, the type of pitch they put out. It’s a little disappointing I think, because it looks like a bit of a road,” Taylor said. “I don’t think they tend to change as much as they used to. They are generally a little bit harder and they don’t tend to break up as much.” Columnist CJ Werelman hit the nail on the head after play on day two and called on the ICC to take action. “Nobody wants to pay money to watch only 4 wickets fall for 480 runs over 2 full days of play. The ICC must set a standard for test match pitches!” he tweeted. Uzzie throws away wicket on 97! | 00:46 By the time Pakistan had declared their innings at 4-476, the home side’s scoring rate was just 2.93. Australia is 2-271 in response, with their run-rate a more than acceptable 3.71. READ MORE TALKING POINTS: Awkward Khawaja debate ignites as Pakistan face big ‘problem’ of their own making SAD: Warnie’s perfect final meal revealed as details of Aussie cricket icon’s final hours emerge Marnus FROTHS cracking run out | 00:36 If they manage to score quickly on day four, Pat Cummins’ men could be in a position to declare and try to conjure up a result late on day five. “When you’ve got nine wickets in the shed, I’d be thinking a minimum 300 runs on day two, minimum. I thought they (Pakistan) went very slowly,” Taylor added. “Now Australia only have to make 280 to avoid the follow-on. If they bat well enough in their first innings and make 350-plus, they are going to find themselves in a situation where they should be able to at least save the game, if not potentially win it. “They really haven’t got themselves into as strong of a position as they could have.” Australia finally batting in Pakistan | 01:43 Meanwhile, the cricket world also was left frustrated by the slow going nature of the match.","image_url":null,"source_id":"foxsports","country":["australia"],"category":["sports"],"language":"english"},{"title":"County chairs renew ECB power struggle with fresh blueprint for cricket","link":"https://www.theguardian.com/sport/2022/mar/06/county-chairs-england-and-wales-cricket-board-power-struggle-blueprint","keywords":["County Championship","ECB","Cricket","Sport","Sport politics"],"creator":["Exclusive by Justine Smith"],"video_url":null,"description":"Chairs propose overhaul to restore members to ECB boardCounty reps were ousted in 2018 diversity-minded restructure England’s county cricket club chairs have launched a blueprint for the game that would boost their power and influence at the England and Wales Cricket Board, four years after the governing body’s restructure replaced them to improve diversity.In a thinly veiled continuation of the power struggle between the sport’s governing body and its first–class counties, documents seen by the Guardian show the chairs are calling for an overhaul which would give them two seats on the ECB management board and bring them closer to the centre of the decision-making process. Their proposals also include the creation of a stakeholders’ board to oversee the performance of the ECB, which would include representatives from the management board, fans, player and sponsors’ bodies and would have powers to sack any director on the ECB board. Continue reading...","content":null,"pubDate":"2022-03-06 21:00:25","full_description":"England’s county cricket club chairs have launched a blueprint for the game that would boost their power and influence at the England and Wales Cricket Board, four years after the governing body’s restructure replaced them to improve diversity. In a thinly veiled continuation of the power struggle between the sport’s governing body and its first–class counties, documents seen by the Guardian show the chairs are calling for an overhaul which would give them two seats on the ECB management board and bring them closer to the centre of the decision-making process. Their proposals also include the creation of a stakeholders’ board to oversee the performance of the ECB, which would include representatives from the management board, fans, player and sponsors’ bodies and would have powers to sack any director on the ECB board. The Middlesex chair, Mike O’Farrell, emailed the interim ECB chair, Barry O’Brien, on Monday on behalf of the 18 county chairs plus the MCC, conceding that the clubs had not always “spoken with one voice”. He said: “We have challenged ourselves as to what we can do to be better partners with the ECB for the good of the game we all love.” The chairs want to change the name of the first-class counties to professional counties, create a chairs association to meet at least three times a year and a six-strong subcommittee chosen from the 19 chairs to represent the county game in all key ECB discussions and negotiations. The move comes four years after the ECB put into action its own governance improvement programme, which removed county chairs from its board and replaced them with directors from diverse backgrounds and with specific skill sets. The chairs’ plans to recover day-to-day influence at the ECB are being put forward at a time when the counties’ governance is under scrutiny with serious issues around racism at Yorkshire, Essex and other clubs , and while the governing body deals with the continuing inquest into the men’s disastrous Ashes tour and a series of high-profile departures at the top of the game. The selection of O’Farrell to lead the representation comes six weeks after he was forced to apologise for making comments deemed outmoded and offensive when called to defend the counties’ record on diversity at the digital, culture, media and sport (DCMS) select committee hearing into racism. He provoked outrage when he appeared to pass the blame for the drop-off of black, Asian and minority ethnic (BAME) players at professional level – from 30% at grassroots to just 3-4% at elite level – to those of Asian heritage for preferring education and to those with West Indian roots for choosing football. Azeem Rafiq, whose explosive testimony about his time as a player at Yorkshire at an earlier DCMS select committee hearing exposed “endemic” racism in cricket, said: “The chairs could at least have the decency to get their own counties in order before making an obvious power grab. This comes only weeks after the deplorable words we heard from O’Farrell and co at the select committee. “I fear they will resist rather than assist change. I urge Sport England, MPs and ministers to look into this situation before making any decisions about the future of the sport.” The chairs’ proposal does not address the issues around diversity which the creation of its suggested 19-member board and six-member subcommittee would throw up. Sport England’s code for governance sets a target of 30% female representation and proportional BAME representation at board level, which the ECB achieved last year. However, of the 19 first-class and MCC chairs, all are male, only two have BAME heritage and their average age is 64. While the proposal documents highlight the need to ensure a balance in representation on the recommended subcommittee between north and south, and the clubs that do and do not have international hosting rights, no mention is made of the need for diversity. An ECB spokesperson said: “The ECB’s game-wide plan committed to a review of governance and regulation. This work is ongoing, supported by Portas Consulting, who are consulting both the professional and recreational game. All options will be considered.”","image_url":"https://i.guim.co.uk/img/media/5ed56efea5eba96318497efe03df681a6ffad379/0_205_5719_3433/master/5719.jpg?width=460&quality=85&auto=format&fit=max&s=4f4dd4d9d205ba4540881ff6f26c477a","source_id":"theguardian","country":["united kingdom","india","singapore","canada"],"category":["sports"],"language":"english"},{"title":"Cricket fans pay tribute to Shane Warne","link":"https://www.cairnspost.com.au/sport/cricket-fans-pay-tribute-to-shane-warne/video/5da7961c477960a8038143e4bff93fa8","keywords":["National","Sport news and galleries"],"creator":null,"video_url":null,"description":"Cricket fans have paid tribute to Shane Warne at his bronze statue outside the Melbourne Cricket Ground. Flowers, cricket balls and bats, cigarettes and even beer have been left by fans at Warne's statue. Warne, 52, who died of a suspected heart attack in Thailand on Friday, is regarded as one of cricket's greatest ever players.","content":null,"pubDate":"2022-03-06 20:03:29","full_description":null,"image_url":null,"source_id":"cairnspost","country":["australia"],"category":["sports"],"language":"english"},{"title":"Cricket fans pay tribute to Shane Warne","link":"https://www.news.com.au/sport/cricket-fans-pay-tribute-to-shane-warne/video/5da7961c477960a8038143e4bff93fa8","keywords":null,"creator":null,"video_url":null,"description":"Cricket fans have paid tribute to Shane Warne at his bronze statue outside the Melbourne Cricket Ground. Flowers, cricket balls and bats, cigarettes and even beer have been left by fans at Warne's statue. Warne, 52, who died of a suspected heart attack in Thailand on Friday, is regarded as one of cricket's greatest ever players.","content":null,"pubDate":"2022-03-06 20:03:29","full_description":null,"image_url":null,"source_id":"news","country":["australia"],"category":["sports"],"language":"english"},{"title":"Jadeja, Ashwin make India's day","link":"https://www.thehansindia.com/sports/cricket/jadeja-ashwin-make-indias-day-732248","keywords":["Sports,Cricket"],"creator":["The Hans India"],"video_url":null,"description":"Ravindra Jadeja stood tall with his all-round brilliance as he complemented his unbeaten 175 with nine wickets in India's innings and 222-run win against a Sri Lankan team that looked anything but Test class in a match that ended inside three days.","content":"Jadeja, Ashwin make India’s dayJadeja, Ashwin make India’s dayMohali: Ravindra Jadeja stood tall with his all-round brilliance as he complemented his unbeaten 175 with nine wickets in India's innings and 222-run win against a Sri Lankan team that looked anything but Test class in a match that ended inside three days.After being bowled out for 174 in the first innings, Sri Lanka, who lost 16 wickets on the day, were dismissed for 178 in their second essay. In the first innings, they were one short of Jadeja's individual score and in the second they were three more, which speaks about their plight. India lead the two-match series 1-0, and will like to gain full 24 points from the rubber by winning the Pink Ball Test in Bengaluru, starting March 12. The match as a contest was over on the first day when India scored 357 and then piled on Sri Lanka's misery with Jadeja toying with a depleted bowling attack. It is after 60 years that an Indian has scored 150 runs and taken five wickets in an innings. Vinoo Mankad, in 1952 against England at Lord's, and Polly Umrigarh in 1962 versus West Indies at Delhi, are the other owners of this rare feat. If that wasn't enough, India got as many as 16 wickets on the third day to wrap up the match with a cumulative bowling effort of 125 overs across two innings. Jadeja (175 not out, 5/41 and 4/46) made the match his own while Ravichandran Ashwin (4/47 in 21 overs) also had a satisfying run. Such was the regularity of getting wickets that there was hardly any cause for celebrations and excitement as it seemed a foregone conclusion. There was no stomach for a fight by this Sri Lankan team and some of the players, like old guard Angelo Mathews and the controversial Niroshan Dickwella (first innings dismissal), seemed primarily disinterested during their stay at the crease. The wicket had its bit of turn and uneven bounce but nothing much to trouble the batters, but the Lankans made a heavy weather during their two stints, making both Jadeja and Ashwin look more menacing than they actually were. In fact none of the Lankan batters could understand which of Jadeja's delivery will be a straighter one and which ones will turn. The mess in their minds caused mess in their approach too. While the World Test Championships have added a context to every series, lopsided matches against teams who aren't skilled enough to compete for long periods of time makes it a bad advertisement for Test cricket. After Rohit Sharma asked Sri Lanka to follow-on after dismissing them for 174, 400 runs adrift of India's first-innings score of 574 for eight, the visitors were in trouble again after Lahiru Thirimanne became Ashwin's 433rd victim. Post lunch, it was first-innings half-centurion Pathum Nissanka whose outside edge to a delivery that didn't turn much, was snapped by Rishabh Pant to complete a memorable feat for Ashwin. In between, Mohammed Shami got Dimuth Karunaratne (27) to edge one to Pant, who took a low diving catch, while Ravindra Jadeja got his sixth scalp of the game by removing Dhananjaya de Silva (30). Mathews (27 batting) and Charith Asalanka (20 batting) hit some lusty blows to entertain the Sunday crowd. Earlier, Jadeja's superb all-round show helped the hosts end Sri Lanka's first innings in the first session itself. Kohli's 100th Test and Rohit Sharma's first game as skipper turned out to be Jadeja's match as his 5 for 41 in 13 overs had the islanders crashing in just 45 overs. Worse, Sri Lanka lost six wickets for 13 runs as they were 161 for four after the first hour, with Pathum Nissanka (61 no off 133 balls) and Charith Asalank adding 58 runs. It all changed after Jasprit Bumrah (2/36 in 14 overs) got one to straighten and trapped Asalanka leg-before. (PTI)","pubDate":"2022-03-06 20:02:19","full_description":"Jadeja, Ashwin make India’s day Mohali: Ravindra Jadeja stood tall with his all-round brilliance as he complemented his unbeaten 175 with nine wickets in India's innings and 222-run win against a Sri Lankan team that looked anything but Test class in a match that ended inside three days. After being bowled out for 174 in the first innings, Sri Lanka, who lost 16 wickets on the day, were dismissed for 178 in their second essay. In the first innings, they were one short of Jadeja's individual score and in the second they were three more, which speaks about their plight. India lead the two-match series 1-0, and will like to gain full 24 points from the rubber by winning the Pink Ball Test in Bengaluru, starting March 12. The match as a contest was over on the first day when India scored 357 and then piled on Sri Lanka's misery with Jadeja toying with a depleted bowling attack. It is after 60 years that an Indian has scored 150 runs and taken five wickets in an innings. Vinoo Mankad, in 1952 against England at Lord's, and Polly Umrigarh in 1962 versus West Indies at Delhi, are the other owners of this rare feat. If that wasn't enough, India got as many as 16 wickets on the third day to wrap up the match with a cumulative bowling effort of 125 overs across two innings. Jadeja (175 not out, 5/41 and 4/46) made the match his own while Ravichandran Ashwin (4/47 in 21 overs) also had a satisfying run. Such was the regularity of getting wickets that there was hardly any cause for celebrations and excitement as it seemed a foregone conclusion. There was no stomach for a fight by this Sri Lankan team and some of the players, like old guard Angelo Mathews and the controversial Niroshan Dickwella (first innings dismissal), seemed primarily disinterested during their stay at the crease. The wicket had its bit of turn and uneven bounce but nothing much to trouble the batters, but the Lankans made a heavy weather during their two stints, making both Jadeja and Ashwin look more menacing than they actually were. In fact none of the Lankan batters could understand which of Jadeja's delivery will be a straighter one and which ones will turn. The mess in their minds caused mess in their approach too. While the World Test Championships have added a context to every series, lopsided matches against teams who aren't skilled enough to compete for long periods of time makes it a bad advertisement for Test cricket. After Rohit Sharma asked Sri Lanka to follow-on after dismissing them for 174, 400 runs adrift of India's first-innings score of 574 for eight, the visitors were in trouble again after Lahiru Thirimanne became Ashwin's 433rd victim. Post lunch, it was first-innings half-centurion Pathum Nissanka whose outside edge to a delivery that didn't turn much, was snapped by Rishabh Pant to complete a memorable feat for Ashwin. In between, Mohammed Shami got Dimuth Karunaratne (27) to edge one to Pant, who took a low diving catch, while Ravindra Jadeja got his sixth scalp of the game by removing Dhananjaya de Silva (30). Mathews (27 batting) and Charith Asalanka (20 batting) hit some lusty blows to entertain the Sunday crowd. Earlier, Jadeja's superb all-round show helped the hosts end Sri Lanka's first innings in the first session itself. Kohli's 100th Test and Rohit Sharma's first game as skipper turned out to be Jadeja's match as his 5 for 41 in 13 overs had the islanders crashing in just 45 overs. Worse, Sri Lanka lost six wickets for 13 runs as they were 161 for four after the first hour, with Pathum Nissanka (61 no off 133 balls) and Charith Asalank adding 58 runs. It all changed after Jasprit Bumrah (2/36 in 14 overs) got one to straighten and trapped Asalanka leg-before. (PTI)","image_url":"https://assets.thehansindia.com/h-upload/2022/03/06/500x300_1280221-jadeja.jpg","source_id":"thehansindia","country":["india"],"category":["sports"],"language":"english"},{"title":"Gilly reveals Warne’s five-figure Ashes act for England","link":"https://www.news.com.au/sport/cricket/gilly-reveals-warnies-incredible-ashes-act-for-england-in-heartfelt-tribute/news-story/ff93f7afaafd8f44a53a32c6f0c5dda7","keywords":null,"creator":null,"video_url":null,"description":"Australian cricket legend Adam Gilchrist has penned an emotional tribute to his late friend Shane Warne after his tragic passing from a suspected heart attack at the age of 52.","content":null,"pubDate":"2022-03-06 19:39:00","full_description":"Australian cricket legend Adam Gilchrist has penned an emotional tribute to his late friend Shane Warne after his tragic passing from a suspected heart attack at the age of 52. In a column for The Daily Telegraph , Gilchrist revealed his disbelief at the news of Warne’s death before summing up what made the legendary cricketer and the man so special. “My family are not known as punters but on Saturday night in Perth we had an important little detour to the roulette tables,” Gilchrist wrote in The Daily Telegraph . Watch Australia’s Tour of Pakistan on Kayo. Every Test, ODI and T20 Live & On-Demand. New to Kayo? Try 14-Days Free Now > “We were celebrating my wife’s Mel’s 50th birthday at the Crown Casino and felt it essential to have a little dabble on 23 red … Shane Warne’s favourite number and one which will forever be linked with his name. “Warnie’s death still doesn’t feel real to me and I was so shocked when my son Archie told me he had heard the news from a mate I had to wait to have it officially confirmed before I believed it.” Warne’s passing came right on the heels of Gilchrist’s hero Rod Marsh’s death in a horror week for the former Australian wicket-keeper. “There are times when Rod Marsh or Shane Warne would call me and I couldn’t believe I had their number in my phone,” Gilchrist wrote. “Both may have passed but I promise you this — I could never delete their numbers from my phone. “Already I cast my mind forward to next summer and it feels empty. I know time heals and people come in but there’s only one Warnie. MORE COVERAGE ‘Had seen doctors’: Fresh details emerge as police seek answers into Warne’s death ‘Infuriating’: Pakistan gamble ruined amid ‘farcical’ scenes as Aussies saved from nervy test ‘I loved him’: Isa Guha’s emotional tribute to ‘magic’ Warne “I heard from Warnie just eight hours before he died because he contacted me to say he enjoyed a little tribute piece I did for Fox Cricket on Rod’s passing.” Gilchrist played with Warne in both test and One Day Cricket for over a decade and can thank Warne for a large chunk of his Australian record 416 dismissals. However it was the more personal memories with Warne that Gilchrist will always treasure and he paid tribute to the King of spin’s generosity of spirit. “Memories? Where do we start?” Gilchrist wrote. “His generosity, underestimated by those who didn’t know him, was a strong suit of Warnie’s. I remember flying home with a knee injury after the third Test at Old Trafford in 1997 and Warnie was on the same flight because his daughter Brooke was born. “We flew home together and he used his points to upgrade me to first class. Sitting next to a legend who had just become a father was an experience I will always cherish. “At Christmas he would pay for a lavish function at his home and I know the English team benefited from his generosity this summer. “A number of the English players flew via helicopter to an exclusive golf club outside Melbourne after Warnie arranged the flights and rounds of golf for them. “I know they gave Warnie a gift for doing so but when the bill came in it was five figures. When the bill arrived Warnie’s reaction was “oh, okay then.’’ “At no point did he say “are they going to pay me?’’ He just quietly fixed up the bill and moved on. “There was no complaining or whinging from Warnie. That was typical of the man and his generosity of spirit.” Gilchrist revealed the pair became even closer after their playing days as they worked together for Fox Cricket. “But it was his brilliance on the field that Gilchrist had front row seats to witness that he will always hold close to his heart. “My relationship with him which was already established from playing with him and it reached new heights in our four years together at Fox Cricket,” Gilchrist wrote. “There were times when Warnie’s brilliant mind games felt like a Spielberg production when I kept to him. “You could feel Warnie’s intimidation from the top of his mark. He’d wait and pause – and pause again – particularly to a new batter who would occasionally pull out of his stance which would only make Warnie start walking in. “He scrambled the batters mind and would turn and talk the umpire – he loved South Africa’s Rudi Koertzen – and say things like “get ready for that wrong un.’’ It was mesmerising.” Apart from his unrivalled skill, Gilchrist also remembered Warne’s stoic commitment to spin bowling and to doing everything in his power to help his teams win cricket games. “Toughness of mind and body was one of Warnie’s most underrated strengths,” Gilchrist wrote. “He may have lived the Hollywood lifestyle and been an A lister of the highest order but, in a cricketing sense, he got down and dirty and worked really, really hard and had shoulder and finger surgeries and just put them aside.” However Gilchrist will remember most the humour of the man and those magical Tests and One Day Internationals he spent watching the greatest bowler ever work his magic. “He was one of small number of people who called me Church after the day an English Kiwi fan called me Eric Gilchurch and I enjoyed it as a term of endearment,” Gilchrist wrote. “I’ve stated this always and will until I’m not around to say it around it any longer but the highlight of my cricket career was to wicketkeep to Warnie. “To sit behind the stumps and see the theatre unfold from a showman of the highest order was an experience I will cherish for life.” Originally published as Gilly reveals Warnie’s incredible Ashes act for England in heartfelt tribute One of Shane Warne’s closest mates with him in Thailand has opened up on their final moments together before the legend’s tragic death. Shane Warne was unlike any cricketer we’ve ever seen but behind the bravado there was an inner turmoil the public didn’t get to see. Paramedics have revealed how they battled in vain to revive Shane Warne after friends found him unresponsive in his Thai villa.","image_url":null,"source_id":"news","country":["australia"],"category":["sports"],"language":"english"},{"title":"Gilly reveals Warne’s five-figure Ashes act for England","link":"https://www.news.com.au/sport/cricket/gilly-reveals-warnies-incredible-ashes-act-for-england-in-heartfelt-tribute/news-story/ff93f7afaafd8f44a53a32c6f0c5dda7","keywords":null,"creator":null,"video_url":null,"description":"Australian cricket legend Adam Gilchrist has penned an emotional tribute to his late friend Shane Warne after his tragic passing from a suspected heart attack at the age of 52.","content":null,"pubDate":"2022-03-06 19:39:00","full_description":"Australian cricket legend Adam Gilchrist has penned an emotional tribute to his late friend Shane Warne after his tragic passing from a suspected heart attack at the age of 52. In a column for The Daily Telegraph , Gilchrist revealed his disbelief at the news of Warne’s death before summing up what made the legendary cricketer and the man so special. “My family are not known as punters but on Saturday night in Perth we had an important little detour to the roulette tables,” Gilchrist wrote in The Daily Telegraph . Watch Australia’s Tour of Pakistan on Kayo. Every Test, ODI and T20 Live & On-Demand. New to Kayo? Try 14-Days Free Now > “We were celebrating my wife’s Mel’s 50th birthday at the Crown Casino and felt it essential to have a little dabble on 23 red … Shane Warne’s favourite number and one which will forever be linked with his name. “Warnie’s death still doesn’t feel real to me and I was so shocked when my son Archie told me he had heard the news from a mate I had to wait to have it officially confirmed before I believed it.” Warne’s passing came right on the heels of Gilchrist’s hero Rod Marsh’s death in a horror week for the former Australian wicket-keeper. “There are times when Rod Marsh or Shane Warne would call me and I couldn’t believe I had their number in my phone,” Gilchrist wrote. “Both may have passed but I promise you this — I could never delete their numbers from my phone. “Already I cast my mind forward to next summer and it feels empty. I know time heals and people come in but there’s only one Warnie. MORE COVERAGE ‘Had seen doctors’: Fresh details emerge as police seek answers into Warne’s death ‘Infuriating’: Pakistan gamble ruined amid ‘farcical’ scenes as Aussies saved from nervy test ‘I loved him’: Isa Guha’s emotional tribute to ‘magic’ Warne “I heard from Warnie just eight hours before he died because he contacted me to say he enjoyed a little tribute piece I did for Fox Cricket on Rod’s passing.” Gilchrist played with Warne in both test and One Day Cricket for over a decade and can thank Warne for a large chunk of his Australian record 416 dismissals. However it was the more personal memories with Warne that Gilchrist will always treasure and he paid tribute to the King of spin’s generosity of spirit. “Memories? Where do we start?” Gilchrist wrote. “His generosity, underestimated by those who didn’t know him, was a strong suit of Warnie’s. I remember flying home with a knee injury after the third Test at Old Trafford in 1997 and Warnie was on the same flight because his daughter Brooke was born. “We flew home together and he used his points to upgrade me to first class. Sitting next to a legend who had just become a father was an experience I will always cherish. “At Christmas he would pay for a lavish function at his home and I know the English team benefited from his generosity this summer. “A number of the English players flew via helicopter to an exclusive golf club outside Melbourne after Warnie arranged the flights and rounds of golf for them. “I know they gave Warnie a gift for doing so but when the bill came in it was five figures. When the bill arrived Warnie’s reaction was “oh, okay then.’’ “At no point did he say “are they going to pay me?’’ He just quietly fixed up the bill and moved on. “There was no complaining or whinging from Warnie. That was typical of the man and his generosity of spirit.” Gilchrist revealed the pair became even closer after their playing days as they worked together for Fox Cricket. “But it was his brilliance on the field that Gilchrist had front row seats to witness that he will always hold close to his heart. “My relationship with him which was already established from playing with him and it reached new heights in our four years together at Fox Cricket,” Gilchrist wrote. “There were times when Warnie’s brilliant mind games felt like a Spielberg production when I kept to him. “You could feel Warnie’s intimidation from the top of his mark. He’d wait and pause – and pause again – particularly to a new batter who would occasionally pull out of his stance which would only make Warnie start walking in. “He scrambled the batters mind and would turn and talk the umpire – he loved South Africa’s Rudi Koertzen – and say things like “get ready for that wrong un.’’ It was mesmerising.” Apart from his unrivalled skill, Gilchrist also remembered Warne’s stoic commitment to spin bowling and to doing everything in his power to help his teams win cricket games. “Toughness of mind and body was one of Warnie’s most underrated strengths,” Gilchrist wrote. “He may have lived the Hollywood lifestyle and been an A lister of the highest order but, in a cricketing sense, he got down and dirty and worked really, really hard and had shoulder and finger surgeries and just put them aside.” However Gilchrist will remember most the humour of the man and those magical Tests and One Day Internationals he spent watching the greatest bowler ever work his magic. “He was one of small number of people who called me Church after the day an English Kiwi fan called me Eric Gilchurch and I enjoyed it as a term of endearment,” Gilchrist wrote. “I’ve stated this always and will until I’m not around to say it around it any longer but the highlight of my cricket career was to wicketkeep to Warnie. “To sit behind the stumps and see the theatre unfold from a showman of the highest order was an experience I will cherish for life.” Originally published as Gilly reveals Warnie’s incredible Ashes act for England in heartfelt tribute One of Shane Warne’s closest mates with him in Thailand has opened up on their final moments together before the legend’s tragic death. Shane Warne was unlike any cricketer we’ve ever seen but behind the bravado there was an inner turmoil the public didn’t get to see. Paramedics have revealed how they battled in vain to revive Shane Warne after friends found him unresponsive in his Thai villa.","image_url":null,"source_id":"news","country":["australia"],"category":["sports"],"language":"english"},{"title":"Final meal sums up Shane Warne to a tee","link":"https://www.news.com.au/sport/cricket/mate-holidaying-with-shane-warne-reveals-cricket-legends-selfless-final-act/news-story/6336cfe7f53c689d80cd78a624b3c1fa","keywords":null,"creator":null,"video_url":null,"description":"One of the friends holidaying with Shane Warne when he died in Thailand has opened up one of the cricket legend’s classy final acts — as well as his all-Aussie last meal that summed the 52-year-old up to a tee.","content":null,"pubDate":"2022-03-06 19:28:00","full_description":"One of the friends holidaying with Shane Warne when he died in Thailand has opened up one of the cricket legend’s classy final acts — as well as his all-Aussie last meal that summed the 52-year-old up to a tee. Tom Hall was part of the group staying at the Samujan resort on the island of Koh Samui when Warne tragically suffered a suspected heart attack. Hall, who met Warne about 15 years ago at a charity poker tournament and remained close ever since, penned an article on The Sporting News — which he is CEO of — paying tribute to the leg-spinner and detailing the last moments they shared together. After figuring out how to watch the Australia-Pakistan Test on TV, Hall said Warne told his mate he had “bought you a present” and headed off “excitedly” to his room. “You’re never quite sure what that means with Shane; it could be a bottle of his 708 gin, his fragrance, some book he thought I would enjoy or a random T-shirt,” Hall wrote. “He came back with an armful of clothes looking like he had been at a yard sale. Neo and Gaz were obviously aware of what was going on as Neo pulled out his camera. “Shane had been working with me at The Sporting News for the past year or so and he presented me with his jumper from the 2005 Ashes Test, his 2008 IPL shirt and a one-day international shirt and cap to place in the TSN offices in Australia and the UK. Amazing gifts I knew the teams would love and cherish. “As we went through the shirts and jumpers, more stories came out about the first IPL season and how he had inherited a team which had several unknown players in it. They lost their opening game, but Shane told (Rajasthan Royals owner) Manoj Badale, ‘Don’t worry mate, we’ll be OK’. They promptly won the rest of their games and the inaugural IPL title.” Then it was time for a bite to eat and Warne’s final meal will come as no surprise to anybody aware of his penchant for snacks such as cheese toasties, baked beans and Hawaiian pizzas. Hall also revealed after he left, Warne was going back to his room to call his kids. “After joking around with the various cricket gear and Rob and a few others getting pictures with Shane, we decide on a quick bite to eat,” Hall wrote. “The conversation ran from poker, to a planned trip to Tulum in Mexico, the upcoming IPL season and the usual assortment of golfing stories. “I have dined with Shane in many fine establishments, but rather than sample some of the local Thai fare, we tuck into a plate of Vegemite on toast. Shane chomping away: ‘Geez, you can’t beat Vegemite with some butter, always great wherever you are in the world’. “An Australian through and through — this was to turn out to be his last meal. Ever the caring father, as I was leaving, he headed up to his bedroom to call his kids.” Warne’s long-time manager James Erksine said Warne had just finished a “ridiculous” diet before his death, where he consumed mostly fluids for 14 days. “He did go on these ridiculous sorts of diets and he just finished one, where he basically only ate fluids for 14 days and he’d done this three or four times,” Erskine told Weekend Today . “It was a bit … all or nothing. It was either white buns with butter and lasagne stuffed in the middle or he would be having black and green juices. “I don’t know, he obviously smoked most of his life. I don’t know, I think it was just a massive heart attack. That’s what I think’s happened.” Meanwhile, paramedics have revealed the scene they were confronted with when called to Warne’s room and detailed their valiant — but ultimately futile — attempts to save his life. “Shane’s friends were already trying to bring him back to life,” Paramedic Anuch Han-iam told The Sun . “I took over doing CPR while we waited for an ambulance. They were desperate. I think one was crying. They were really stressed and panicked. “They kept trying to wake him and I heard someone saying, ‘Come on, Shane. Come on, Shane’. “I could see they were all shocked and I just tried to concentrate and do my best. “There were about four or five other people in the room. All men, there were no women. “The villa was clean and I didn’t see any beer or cigarettes inside. “There was nothing unusual that made me think they’d been partying. I didn’t know when I arrived that it was Shane Warne. But I know who he is, he’s a star. “I did my best for him and gave all my energy. I’m so sorry that I couldn’t help him.” Adam Gilchrist has penned an emotional tribute to his late friend Shane Warne after his tragic passing, revealing a generous act during the summer. Shane Warne was unlike any cricketer we’ve ever seen but behind the bravado there was an inner turmoil the public didn’t get to see. Paramedics have revealed how they battled in vain to revive Shane Warne after friends found him unresponsive in his Thai villa.","image_url":null,"source_id":"news","country":["australia"],"category":["sports"],"language":"english"},{"title":"\"I don't think I should be in the South Africa tour\" - Shakib al Hasan requests break from international cricket","link":"https://www.sportskeeda.com/cricket/news-i-think-i-south-africa-tour-shakib-al-hasan-requests-break-international-cricket?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Cricket"],"creator":["Aayushman Vishwanathan"],"video_url":null,"description":null,"content":null,"pubDate":"2022-03-06 19:24:59","full_description":"Bangladesh all-rounder Shakib al Hasan has said he needs a brief break from international cricket to be more productive. The veteran told BCB Cricket Operations Chairman Jalal Yunus about his wish to pull out of the upcoming South Africa tour. The selection committee named Shakib in both Test and ODI squads for the South Africa tour after BCB president Nazmul Hasan cited the all-rounder's availability. The left-arm spinner had earlier made himself unavailable for the series, hoping to play in the 15th season of the IPL. However, the 34-year old, who went unpicked at the IPL 2022 mega auction, feels he is not in the right physical and mental frame of mind for the rigours of international cricket. The former Bangladesh captain said he felt like a passenger in the home series against Afghanistan . He now has second thoughts about touring South Africa, telling ESPN Cricinfo in this regard: Shakib played both the Test and ODI series against Afghanistan, scoring 74 runs and taking seven wickets in three ODIs and two T20Is. Chief selector Minhajul Abedin, who announced the squads for the South Africa tour, said having the all-rounder and Tamim Iqbal in the Test squad is a significant boost. The 34-year old said that Jalal Yunus has asked him to ponder on his decision to pull out of the South Africa tour. Shakib hinted that he could miss the ODI series to play the Tests. The all-rounder said: The all-rounder added: Shakib continued: Bangladesh's tour of South Africa comprises two Tests and three ODIs. The series starts on March 18 with the ODIs.","image_url":"https://static.sportskeeda.com/editor/2022/03/524a0-16465912139533-1920.jpg","source_id":"sportskeeda","country":["india"],"category":["sports"],"language":"english"},{"title":"How 'trapped' Warne really felt about lifestyle","link":"https://wwos.nine.com.au/cricket/shane-warne-age-kerry-okeeffe-reflection/6a99690d-8d90-4a8c-a1a3-5ea3a084d28c","keywords":null,"creator":["wwos"],"video_url":null,"description":"Shane Warne didn't actually relish every moment of the Hollywood life he lived, according to a dear friend and colleague.","content":"Many probably think Shane Warne relished every moment of the Hollywood life he lived.Just about everywhere the Australian cricket legend went, he attracted flashing cameras, signatures and selfies, headlines, speculation and catch-cries.But another former leg-spinner of Australian cricket – dear friend and commentary colleague Kerry O'Keeffe – says the blinding and relentless spotlight didn't always sit well with Warne.READ MORE: Warne had 'seen a doctor about his heart', say Thai PoliceREAD MORE: Former England captain breaks down during Warne tributeREAD MORE: Warne's manager reveals legend's final moments\"It was not easy to live in his world,\" O'Keefe said on Fox Cricket.\"It was like a birdcage where he seemed trapped to a certain extent.\"If you got in a cab with him, suddenly the cab had 10 people looking for a selfie trying to hold up the cab, going, 'Warney, you legend'.\"Warne had a rockstar following from the moment a chubby blonde – who loved a meat pie, a drink, a smoke and the many other leisures that came with his full-throttle life – took his first big bag of wickets on the Test scene.In the Boxing Day Test of 1992, against what was then a mighty West Indies side, Warne hauled in 7-52 in the fourth innings to lift Australia to a 139-run win.The bright lights followed him through to and beyond his tragic death in the early hours of Saturday (AEDT), after he suffered a suspected heart attack in a Thailand villa.\"He accepted that life, which was life under the microscope 24 hours a day,\" O'Keeffe said.\"I love anonymity. Sometimes, he preferred anonymity, but he didn't get it much, did he? Because every time he walked into the room, the room stopped because of SK.\"For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here!","pubDate":"2022-03-06 19:20:52","full_description":"Many probably think Shane Warne relished every moment of the Hollywood life he lived. Just about everywhere the Australian cricket legend went, he attracted flashing cameras, signatures and selfies, headlines, speculation and catch-cries. But another former leg-spinner of Australian cricket – dear friend and commentary colleague Kerry O'Keeffe – says the blinding and relentless spotlight didn't always sit well with Warne. READ MORE: Warne had 'seen a doctor about his heart', say Thai Police READ MORE: Former England captain breaks down during Warne tribute READ MORE: Warne's manager reveals legend's final moments \"It was not easy to live in his world,\" O'Keefe said on Fox Cricket. \"It was like a birdcage where he seemed trapped to a certain extent. \"If you got in a cab with him, suddenly the cab had 10 people looking for a selfie trying to hold up the cab, going, 'Warney, you legend'.\" Warne had a rockstar following from the moment a chubby blonde – who loved a meat pie, a drink, a smoke and the many other leisures that came with his full-throttle life – took his first big bag of wickets on the Test scene. In the Boxing Day Test of 1992, against what was then a mighty West Indies side, Warne hauled in 7-52 in the fourth innings to lift Australia to a 139-run win. The bright lights followed him through to and beyond his tragic death in the early hours of Saturday (AEDT) , after he suffered a suspected heart attack in a Thailand villa. \"He accepted that life, which was life under the microscope 24 hours a day,\" O'Keeffe said. \"I love anonymity. Sometimes, he preferred anonymity, but he didn't get it much, did he? Because every time he walked into the room, the room stopped because of SK.\" For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here !","image_url":"https://vms-network-images-prod.s3-ap-southeast-2.amazonaws.com/2022/03/414987/060322healy.png","source_id":"nine","country":["australia"],"category":["sports"],"language":"english"},{"title":"Ranji Trophy: The other Kohli helps cricket take root in Mizoram","link":"https://indianexpress.com/article/sports/cricket/ranji-trophy-taruwar-kohli-helps-cricket-take-root-in-mizoram-7804170/","keywords":["Cricket","Sports"],"creator":["Ashish Satyam"],"video_url":null,"description":null,"content":null,"pubDate":"2022-03-06 19:11:09","full_description":"Having been asked to play as a professional cricketer for Mizoram, Taruwar Kohli is now making headlines in the domestic circuit. He amassed 151 runs on Sunday against Nagaland in the ongoing Ranji Trophy. His first-class record is bulging consistently. In the 49 first-class matches he has played, he has scored 3827 runs at a remarkable average of 51.02. “Ranji Trophy is one of my favorite formats. I enjoy batting in this format. I was the second-highest run-scorer in the last season. I love playing Ranji Trophy because it suits my batting also. I love batting for longer times. This format actually tests you both mentally and physically”, he tells The Indian Express straight from the airport in a telephonic conversation. Check Out Express Premium Putin lied… more at stake than Russia ties: German Ambassador Explained: The OBC vote in Uttar Pradesh Opinion: Our politicians in denial of climate change Click here for more Even after playing an outstanding inning of 151 runs, Taruwar was not gratified as his team lost the match. “It feels great but not completely because we lost the match. I tried my best, it is pleasing on one side and disappointing on the other. Being the captain, I could not help the team pull it off this time but as an individual it is pleasing,” he said. https://images.indianexpress.com/2020/08/1x1.png The 33-year-old held a cricket bat for the first time when he was just 3-4 years of age. From there on, there has been no looking back. “I was very young, I think I was 3-4 years old when my dad bought me a cricket bat. That was the first time I took a bat in my hand and still, I am passionate about holding a cricket bat,” he added. Lalchand Rajput, the current Zimbabwe coach, and former India coach has played a crucial role in Taruwar Kohli’s career. Kohli spoke highly about Rajput and stated, “I have played my U-17 for Punjab and then I went to NCA. I scored close to 380 runs in 5 innings. Eventually, I started doing well for Punjab, then I went to play U-19 where I did well in front of Lalchand Rajput. In that camp, I scored a century. Then, he wanted to pick me for the India U-19 squad.” Found this photograph in our comm box in Ranchi. The boys who lifted the 2008 U19 World Cup.. Two Kohlis, a local boy, a keeper and a southpaw in there. Let’s see who gets all@of them right … #IndvSA pic.twitter.com/PEIUhYon1p — Jatin Sapru (@jatinsapru) October 19, 2019 It has not been a comfortable ride for Kohli as he faced many ups and downs in his career after moving to seniors. Kohli initially donned Punjab’s jersey and then shifted his base to Mizoram. He expressed his gratitude towards Munish Bali who encouraged him in his early days. During his Punjab Ranji days, Vikram Rathour, current India batting coach, also guided Kohli a lot. In his late 20s, he had to make a decision and he said, “I was around 29 years old. I had a good run, I scored a triple century for Punjab. I also captained the Punjab team. But it was about being practical as I was not getting enough chances. I was 29 and they were looking for young talents. Players like Abhishek Sharma , Shubman Gill all those guys were coming in. So I looked ahead and I wanted to play the entire season without fail. That is why I moved to Mizoram. Mizoram gave me the golden opportunity to showcase my finesse. I am thankful to them.” Virat Kohli recently played his 100th Test match for India and it’s a huge feat for him as a player. Speaking about his U-19 colleague, Taruwar said, “ I think his hunger to be the best and to win games for his team makes him the best among the current lot of players. I am really happy for him as he has played his 100th Test match and I think he still has plenty of cricket left in him.” Kohli’s run in the English season He also plays for Cawthorne CC in the South Premier Yorkshire league. It did help him in improving his skill-set as a player and as a batsman. He feels grateful to have gotten an opportunity to play in the English league. Top Sports News Now Ravindra Jadeja feasts on Lankan ineptitude: All-rounder follows ton with nine-wicket match haul Pooja Vastrakar's journey: From playing with boys in MP's Shahdol to clinching a winner against Pakistan India win World Cup opener but Pakistan captain Bismah Maroof's daughter wins everyone's hearts Click here for more “It was an amazing experience. There are mostly seaming conditions in England . I was again in a similar role, I played every match and finished the season as the highest run-scorer,” he said. Mizoram’s love for football Kohli’s very first season with Mizoram was surprising. As soon as he landed in Mizoram, he found players practicing on cemented wickets. There were no turf wickets at that point. People were more inclined towards playing football than cricket. “In my first year, we practiced on the cement wicket, it was surprising. But slowly the culture is coming in and people are actually thinking that they can make a career out of this. Basically, the people there, are into football. They all love football more than cricket. They never used to play cricket initially”, Kohli said. Mizoram is in good hands and is on the road to improvement. People like Mr. Mamon Majumder are actually working day and night to provide decent infrastructure to the players of Mizoram. “Cards are turning and the Association led by Mamon Majumder sir is actually on the road of progress. He is also part of IPL governing council. I think he is a man with a vision. He has a vision of taking Mizoram cricket ahead. There are a lot of youngsters coming into the team. They are talented, hard-working and they do have the potential to do well. I believe they are heading in the right direction but it will take time. “ Kohli’s dual role After having truckloads of experience in the domestic circuit, Kohli actually wants youngsters to exploit his cricketing brain. Not only does he guide Mizoram’s young cricketers, but also runs a cricket academy called “Powerplay Cricket Academy” where he nurtures young talent. “Since I have a lot of experience, I share some of that with the youngsters. It does help them in grooming themselves. My role is not only contributing with the bat but also guiding the youngsters during net sessions, on and off the field”, he signed off.","image_url":null,"source_id":"indianexpress","country":["india"],"category":["sports"],"language":"english"},{"title":"“The Curator is expecting movement early”: Michael Vaughan posted farmer’s picture with cattle to mock at the Ahmedabad pitch; draws Indians’ ire on social media","link":"https://thesportsrush.com/cricket-news-the-curator-is-expecting-movement-early-michael-vaughan-posted-farmers-picture-with-cattle-to-mock-at-the-ahmedabad-pitch-draws-indians-ire-on-social-media/","keywords":["Cricket","England tour of India 2021","Michael vaughan"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Michael Vaughan posted farmer’s picture with cattle at a ploughing field to draw its comparison to the pitch at Ahmedabad. Former England skipper and top-order batter Michael Vaughan is one of the very few popular Overseas cricketers with a significant fan base on various social media sites, sometimes for the infamous of reasons. Despite his… The post “The Curator is expecting movement early”: Michael Vaughan posted farmer’s picture with cattle to mock at the Ahmedabad pitch; draws Indians’ ire on social media appeared first on The SportsRush.","content":"Michael Vaughan posted farmer’s picture with cattle at a ploughing field to draw its comparison to the pitch at Ahmedabad. Former England skipper and top-order batter Michael Vaughan is one of the very few popular Overseas cricketers with a significant fan base on various social media sites, sometimes for the infamous of reasons. Despite his huge followers’ base originating from India, Vaughan does not hold himself back while giving his opinion on an issue at hand fearing a possible backlash. One such instance took place during England’s tour of India last year in February-March. India had defeated England by 10 wickets within just a touch over two days at the Narendra Modi Stadium in Ahmedabad. With the entire match lasting for mere 140 odd Overs, the pitch, which suited the spinners, became a talking point amongst the Cricketing fraternity, with mostly the English fans and media expressing their unhappiness on the nature of the pitch, while claiming it to be a poor advertisement for Test Cricket. India’s spinners-Ravichandran Ashwin and Axar Patel combined together to pick up 18 English wickets in the encounter to hand their team a 2-1 lead with a match to go in the series at the same venue. Michael Vaughan posted farmer’s picture with cattle to comment on the pitch Michael Vaughan, post England’s humiliating loss, took to his social media handle, to post a picture of a farmer who is seen ploughing the field with his cattle. Taking a jibe at the nature of the Ahmedabad pitch during the 3rd Test match, Vaughan’s picture on his handle was posted with the caption-‘I can report that preparations for the 4th Test are going great … The Curator is expecting movement early, good carry & might spin on day 5 !!!.”   View this post on Instagram   A post shared by Michael vaughan (@michaelvaughan) Vaughan’s huge section of Indian followers took huge offence on the picture and took it as an insult meted out to a hard working Indian farmer, who symbolizes India’s prosperity and abundance. While some fans accused him of crying foul play after a crushing England loss, some asked why he remained mum when England lifted the World Cup despite the match ending in a Draw. Another user wrote- ‘Here’s a 46-year-old baby crying’, and so forth. Vaughan had earlier accused the BCCI for not preparing suitable pitches in accordance to Test match standards. He had remarked that more India is allowed to “get away with whatever they wish”, the more “toothless” the ICC will look. The post “The Curator is expecting movement early”: Michael Vaughan posted farmer’s picture with cattle to mock at the Ahmedabad pitch; draws Indians’ ire on social media appeared first on The SportsRush.","pubDate":"2022-03-06 19:02:53","full_description":"Michael Vaughan posted farmer’s picture with cattle at a ploughing field to draw its comparison to the pitch at Ahmedabad. Former England skipper and top-order batter Michael Vaughan is one of the very few popular Overseas cricketers with a significant fan base on various social media sites, sometimes for the infamous of reasons . Despite his huge followers’ base originating from India, Vaughan does not hold himself back while giving his opinion on an issue at hand fearing a possible backlash. One such instance took place during England’s tour of India last year in February-March. India had defeated England by 10 wickets within just a touch over two days at the Narendra Modi Stadium in Ahmedabad. With the entire match lasting for mere 140 odd Overs, the pitch, which suited the spinners, became a talking point amongst the Cricketing fraternity, with mostly the English fans and media expressing their unhappiness on the nature of the pitch, while claiming it to be a poor advertisement for Test Cricket. India’s spinners-Ravichandran Ashwin and Axar Patel combined together to pick up 18 English wickets in the encounter to hand their team a 2-1 lead with a match to go in the series at the same venue. Michael Vaughan, post England’s humiliating loss, took to his social media handle, to post a picture of a farmer who is seen ploughing the field with his cattle. Taking a jibe at the nature of the Ahmedabad pitch during the 3rd Test match, Vaughan’s picture on his handle was posted with the caption-‘I can report that preparations for the 4th Test are going great … The Curator is expecting movement early, good carry & might spin on day 5 !!!.” A post shared by Michael vaughan (@michaelvaughan) Vaughan’s huge section of Indian followers took huge offence on the picture and took it as an insult meted out to a hard working Indian farmer, who symbolizes India’s prosperity and abundance. While some fans accused him of crying foul play after a crushing England loss, some asked why he remained mum when England lifted the World Cup despite the match ending in a Draw. Another user wrote- ‘Here’s a 46-year-old baby crying’, and so forth. Vaughan had earlier accused the BCCI for not preparing suitable pitches in accordance to Test match standards. He had remarked that more India is allowed to “get away with whatever they wish”, the more “toothless” the ICC will look.","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Mate reveals Warne’s selfless last act","link":"https://www.cairnspost.com.au/sport/cricket/mate-holidaying-with-shane-warne-reveals-cricket-legends-selfless-final-act/news-story/6336cfe7f53c689d80cd78a624b3c1fa","keywords":["Cricket news and galleries","Sport news and galleries"],"creator":null,"video_url":null,"description":"One of the friends holidaying with Shane Warne when he died in Thailand has opened up one of the cricket legend’s final acts — as well as his all-Aussie last meal that summed the 52-year-old up to a tee.","content":null,"pubDate":"2022-03-06 18:55:00","full_description":null,"image_url":null,"source_id":"cairnspost","country":["australia"],"category":["sports"],"language":"english"},{"title":"Women's World Cup: New Zealand vs Bangladesh, Live Score And Updates","link":"https://sports.ndtv.com/cricket/new-zealand-women-vs-bangladesh-women-live-cricket-score-and-updates-2807263","keywords":null,"creator":null,"video_url":null,"description":"ICC Women's World Cup 2022, New Zealand Women vs Bangladesh Women, live cricket score and updates: New Zealand and Bangladesh face off in a 2022 ICC Women's World Cup match at the University Oval in...","content":null,"pubDate":"2022-03-06 18:07:12","full_description":"ICC Women's World Cup 2022, New Zealand Women vs Bangladesh Women, live cricket score and updates: New Zealand and Bangladesh face off in a 2022 ICC Women's World Cup match at the University Oval in Dunedin on Monday. Both sides began their respective campaigns with defeats and will look to notch a victory in this campaign to move up the standings. Hosts New Zealand suffered a heartbreaking three-run loss to the West Indies in their opening game on Friday. Bangladesh, on the other hand, were beaten by South Africa by 32 runs in their opener. ( LIVE SCORECARD ) The Women's Cricket World Cup has started with a bang and we have already witnessed some nail-biting matches and now we move to match 5 where we will see New Zealand Women cross swords against Bangladesh Women. The hosts surprisingly lost their opening game to West Indies Women where they fell just 3 runs short. Their skipper - Sophie Devine notched up a brilliant century and Katey Martin towards the end fought very hard and took the game deep but the side failed to score 6 runs in the final over as they lost 3 wickets and got bundled out for 256 chasing 260. The hosts now face the World Cup debutants, Bangladesh Women who also lost their opening game against South Africa Women but showed a good fighting spirit. Their bowlers did a splendid job restricting the Proteas to just 207 and their chase also started pretty well but lost wickets in clusters later and that cost them the match. Their batters need to rise on the occasion now and perform better while the White Ferns need to improve their fielding and also need to get better with the ball. Both teams are coming off a loss and both teams now would eye a win here and get 2 crucial points. The hosts might be favourites here but write Bangladesh Women off on your own peril. A cracking game beckons at University Oval, Dunedin.","image_url":"https://c.ndtvimg.com/2022-03/7ukc9128_bangladesh-women-afp_625x300_06_March_22.jpg?im=FeatureCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"NZ-W vs BAN-W Dream11 Team Prediction, Fantasy Cricket Hints: Captain, Probable Playing 11s, Team News; Injury Updates For Today’s NZ-W vs BAN-W ODI World Cup Match at University Oval, Dunedin 3:30 AM IST March 7","link":"https://zeenews.india.com/cricket/nz-w-vs-ban-w-dream11-team-prediction-fantasy-cricket-hints-captain-probable-playing-11s-team-news-injury-updates-for-today-s-nz-w-vs-ban-w-odi-world-cup-match-at-university-oval-dunedin-330-am-ist-march-7-2442796.html","keywords":null,"creator":null,"video_url":null,"description":"New Zealand women vs Bangladesh women Dream11 Team Prediction New Zealand women vs Bangladesh women ICC Women's World Cup ODI- Check My Dream11 Team, Best players list of NZ-W vs NZ-W, New Zealand women Dream11 Team Player List, Bangladesh women Dream11 Team Player List, Dream11 Guru Tips, Fantasy Cricket Tips, Fantasy Cricket Tips, Fantasy Playing Tips.","content":null,"pubDate":"2022-03-06 18:02:00","full_description":"New Zealand women will take on Bangladesh women in Match 5 of the ICC Women's ODI World Cup 2022 at University Oval ground in Dunedin. The White Ferns will start as favourites as they are a better team on pacer and on form. Quite recently, they beat India women 4-1 in the five-match ODI series and their main batter Suzie Bates is in red hot form at the moment. It will be a uphill task for Bangladesh women to overcome when they take on the home nation of this World Cup. Obviously, the home advantage remains with the New Zealand team. The match will be hosted at the University Oval, Dunedin at 3:30 am IST on March 7, Monday. Captain: Sophie Devine Vice-Captain: Lea Tahuhu Wicketkeeper: Shamima Sultana Batters: Suzie Bates, Amy Satterthwaite, Sharmin Akhter All-rounders: Sophie Devine, Amelia Kerr, Lea Tahuhu, Salma Khatun Bowlers: Jahanara Alam, Jess Kerr, Hannah Rowe New Zealand Women Possible Starting XI : Sophie Devine (c), Suzie Bates, Amelia Kerr, Amy Satterthwaite, Maddy Green, Brooke Halliday, Katey Martin (wk), Lea Tahuhu, Jess Kerr, Hannah Rowe, Fran Jonas Bangladesh Women Possible Starting XI : Shamima Sultana (wk), Sharmin Akhter, Fargana Hoque, Nigar Sultana (c), Rumana Ahmed, Murshida Khatun, Ritu Moni, Salma Khatun, Nahida Akter, Fariha Trisna, Jahanara Alam","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"Tomorrow weather Rawalpindi Day 4: What is the weather of Rawalpindi Cricket Stadium for PAK vs AUS Test?","link":"https://thesportsrush.com/cricket-news-tomorrow-weather-rawalpindi-day-4-what-is-the-weather-of-rawalpindi-cricket-stadium-for-pak-vs-aus-test/","keywords":["Cricket","Australia","Australia tour of Pakistan 2022","Pakistan"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Tomorrow weather Rawalpindi: The SportsRush presents before you the weather prediction for first PAK vs AUS Test. Pakistan might have started to play international cricket at home but the pitch for the ongoing first Test match against Australia reminds one of them playing Test cricket in the UAE. Such is the flatness of the surface… The post Tomorrow weather Rawalpindi Day 4: What is the weather of Rawalpindi Cricket Stadium for PAK vs AUS Test? appeared first on The SportsRush.","content":"Tomorrow weather Rawalpindi: The SportsRush presents before you the weather prediction for first PAK vs AUS Test. Pakistan might have started to play international cricket at home but the pitch for the ongoing first Test match against Australia reminds one of them playing Test cricket in the UAE. Such is the flatness of the surface at the Pindi Cricket Stadium that there still doesn’t appear a way for bowlers to dictate terms. With only six batters (including a run-out) dismissed across three days and 235 overs in the match so far, neither Pakistan nor Australia have emerged as the favourites in Rawalpindi. It is due to the same reason that former Pakistan captain Mohammad Hafeez had taken to social media platform Twitter to express disappointment with respect to the “show and dead” nature of the pitch. Slow & dead pitch.. above all low intent so far fading out chances of result in this historic test match. One team have to play very poorly to give a result in this test match. Result oriented cricket is the future of Test cricket not dead drawn games please — Mohammad Hafeez (@MHafeez22) March 5, 2022 Australia, who have eight wickets in hand, are trailing Pakistan by 205 runs in the first innings. The only possible way for this match to witness a result is at least one batting collapse. Expect players to participate in a dull draw in the remaining couple of days in the absence of one. Tomorrow weather Rawalpindi Day 4 The probability of a draw further increases when the weather is taken into consideration for the next two days. Speaking particularly for Day 4, AccuWeather predicts a 34% rain during the morning session in Rawalpindi. While the weather will remain on the cooler side throughout the day, rain probability decreases significantly to single digit figures post the first session. While rain might eat up some overs on a Monday morning, a change in climate might end up assisting the bowlers. Having said that, even if rain fails to bring back the bowlers into the match, a long toiling day awaits the Pakistani bowlers. Hourly Rawalpindi weather today 10:00 AM – 16 degree (Cool). 11:00 AM – 17 degree (Pleasant). 12:00 PM – 18 degree (Pleasant). 01:00 PM – 19 degree (Pleasant). 02:00 PM – 19 degree (Pleasant). 03:00 PM – 20 degree (Pleasant). 04:00 PM – 20 degree (Pleasant). 05:00 PM – 19 degree (Pleasant). 06:00 PM – 18 degree (Pleasant). The post Tomorrow weather Rawalpindi Day 4: What is the weather of Rawalpindi Cricket Stadium for PAK vs AUS Test? appeared first on The SportsRush.","pubDate":"2022-03-06 16:56:34","full_description":"Tomorrow weather Rawalpindi: The SportsRush presents before you the weather prediction for first PAK vs AUS Test. Pakistan might have started to play international cricket at home but the pitch for the ongoing first Test match against Australia reminds one of them playing Test cricket in the UAE. Such is the flatness of the surface at the Pindi Cricket Stadium that there still doesn’t appear a way for bowlers to dictate terms. With only six batters (including a run-out) dismissed across three days and 235 overs in the match so far, neither Pakistan nor Australia have emerged as the favourites in Rawalpindi. It is due to the same reason that former Pakistan captain Mohammad Hafeez had taken to social media platform Twitter to express disappointment with respect to the “show and dead” nature of the pitch. Slow & dead pitch.. above all low intent so far fading out chances of result in this historic test match. One team have to play very poorly to give a result in this test match. Result oriented cricket is the future of Test cricket not dead drawn games please 🙏 — Mohammad Hafeez (@MHafeez22) March 5, 2022 Australia, who have eight wickets in hand, are trailing Pakistan by 205 runs in the first innings. The only possible way for this match to witness a result is at least one batting collapse. Expect players to participate in a dull draw in the remaining couple of days in the absence of one. The probability of a draw further increases when the weather is taken into consideration for the next two days. Speaking particularly for Day 4, AccuWeather predicts a 34% rain during the morning session in Rawalpindi. While the weather will remain on the cooler side throughout the day, rain probability decreases significantly to single digit figures post the first session. While rain might eat up some overs on a Monday morning, a change in climate might end up assisting the bowlers. Having said that, even if rain fails to bring back the bowlers into the match, a long toiling day awaits the Pakistani bowlers. 10:00 AM – 16 degree (Cool). 11:00 AM – 17 degree (Pleasant). 12:00 PM – 18 degree (Pleasant). 01:00 PM – 19 degree (Pleasant). 02:00 PM – 19 degree (Pleasant). 03:00 PM – 20 degree (Pleasant). 04:00 PM – 20 degree (Pleasant). 05:00 PM – 19 degree (Pleasant). 06:00 PM – 18 degree (Pleasant).","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"IND vs SL: Watch - Ravindra Jadeja Welcomed With A Cake In Hotel After Winning Mohali Test By Indian Team - Cricket Addictor","link":"https://news.google.com/__i/rss/rd/articles/CBMilgFodHRwczovL2NyaWNrZXRhZGRpY3Rvci5jb20vc3JpLWxhbmthLXRvdXItb2YtaW5kaWEtMjAyMi93YXRjaC1yYXZpbmRyYS1qYWRlamEtd2VsY29tZWQtd2l0aC1hLWNha2UtaW4taG90ZWwtYWZ0ZXItd2lubmluZy1tb2hhbGktdGVzdC1ieS1pbmRpYW4tdGVhbS_SAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"IND vs SL: Watch - Ravindra Jadeja Welcomed With A Cake In Hotel After Winning Mohali Test By Indian Team  Cricket AddictorRavindra Jadeja or Ben Stokes? Who is a better all-rounder  Zee NewsStats - Jadeja continues love affair with Mohali; Ashwin goes past Kapil Dev  ESPNcricinfoIndia beat Sri Lanka by an innings and 222 runs in Mohali  The Tribune IndiaIndia vs Sri Lanka, 1st Test Day 3: Ravindra Jadeja and R Ashwin wrap it up for India inside 3 days, win  Times of IndiaView Full coverage on Google News","content":null,"pubDate":"2022-03-06 16:39:09","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Rohit Sharma: ‘Ashwin, for me, is an all-time great’","link":"https://sportstar.thehindu.com/cricket/ind-vs-sl-rohit-sharma-ashwin-all-time-great-mohali-test-cricket/article38450689.ece","keywords":null,"creator":["Abhishek Mukherjee"],"video_url":null,"description":"The India captain lauds R. Ashwin for his contribution to Indian cricket, saying he gets better with every game he plays.","content":null,"pubDate":"2022-03-06 14:34:06","full_description":"R. Ashwin went past Kapil Dev’s tally of 434 Test wickets on day three of the first Test at the PCA stadium here and is now ninth in the list of the highest wicket-takers in Test cricket. He was the most successful of all of India’s bowlers barring Ravindra Jadeja, picking six wickets, including four in the second innings. Ashwin contributed with the bat, too, scoring an elegant half-century (61, 82b, 8x4) in the first innings, contributing all those runs in a partnership of 130 with Jadeja for the seventh wicket. Rohit Sharma termed him an all-time great. “He’s been playing for so many years for India, and he has done so well. He’s given so many match-winning performances. So he’s an all-time great, for me,” he said after India’s innings-and-222-run victory. READ: IND vs SL: Jadeja bamboozles Sri Lanka to hand India innings win “I’ve been watching Ashwin for a long time now. Whenever I watch him, he seems to get better and better (sic). Ashwin is one of those kinds of players [who have confidence in their abilities] – whatever he wants to go out there and achieve for himself and then for the team as well. He played a crucial innings as well with the bat – got us a big partnership with Jadeja,” Rohit said. 'Hungry’ Rohit also lauded the other major contributor to the team’s win – Ravindra Jadeja, who scored a career-best 175 (unbeaten) and then took nine wickets across two innings (five in the first, four in the second). “To me, he’s one of the top [all-rounders in the game], definitely. Look at the performances – honestly, to get 175 not out, and then take nine wickets in the game – he’s just upping his game every time we see him. In the past as well, when we played in India, with his contribution with the bat lower down the order and picking those crucial wickets, he just seems to be adding a lot more to his game every time he plays. READ: IPL schedule 2022: Full fixtures list, date, match timings, teams and venues “He’s very hungry, as we can see. He’s quite hungry for success, he’s quite hungry to get runs and do well for the team. When I talk to him about certain things he is very open-minded, he wants to take responsibility, he wants to take the challenge. When we played Sri Lanka in the T20s, I just asked him, ‘would you be wanting to bat up the order?’ And he just agreed. As a captain, I feel I want to use Jadeja a lot more with the bat. We all know his bowling, and everyone knows about his fielding,” he said. Runs from lower-order batters Rohit felt the first Test against Sri Lanka was a near-perfect game for his team, but admitted that the fielding could be better. He was buoyed that lower-order batters had contributed heavily with the bat – from 228 for 5, they took India to 574 for 8. “I clearly remember, it was way back in 2015 when Virat took over as captain we wanted to see better contributions with the bat from the lower order, which is why we kept emphasising a lot on how important it is for all the bowlers to go and bat in the nets, try and improve one or the other skill if possible for them to go and put that contribution out. And I think we’re seeing that now; we’re getting to see a lot of guys who bat down the order are contributing a lot. READ: Prithvi Shaw: The moment you take things lightly, game hits you hard “Last Test match against England (Lord’s), [Jasprit] Bumrah and [Mohammed] Shami created that huge partnership which put us in a winning position. So we’re emphasising and focussing on lower-order contributions; at the same time, it is up to the individual also to take that responsibility and try and improve going out there and getting some hits in the nets and then see what they can do. Because it’s important, all 11 players contributing in different facets of the game is very, very crucial,” he said. And for those out of the team or warming the bench, clear communication is a challenging task but necessary for Indian cricket to make good progress, admitted Rohit. “It’s absolutely challenging and it is very, very important. It’s not just about 11 players; it’s also about those who are sitting outside wanting to get their chances. If you create the bench strength and start thinking from now, Indian cricket will be in good hands. And that is one of my challenges and one of my responsibilities that I want to take upon me to create that bench strength as much as possible.”","image_url":null,"source_id":"sportstar","country":["india"],"category":["sports"],"language":"english"},{"title":"Biggest win in Test cricket: List of India’s largest Test wins","link":"https://thesportsrush.com/cricket-news-biggest-win-in-test-cricket-list-of-indias-largest-test-wins/","keywords":["Cricket","india vs sri lanka","Sri Lanka tour of India 2022"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Biggest win in Test cricket: Team India won the first of the two-match Test series against Sri Lanka by an innings and 222 runs. The Rohit Sharma-juggernaut continues trampling down the oppositions as he registered his 13th consecutive international win since taking over as team India’s regular skipper. The latest win came against Sri Lanka… The post Biggest win in Test cricket: List of India’s largest Test wins appeared first on The SportsRush.","content":"Biggest win in Test cricket: Team India won the first of the two-match Test series against Sri Lanka by an innings and 222 runs. The Rohit Sharma-juggernaut continues trampling down the oppositions as he registered his 13th consecutive international win since taking over as team India’s regular skipper. The latest win came against Sri Lanka as his men handed their Asian rivals a heavy shellacking by an innings and 222 runs at the PCA IS Bindra Stadium in Mohali, to go 1-0 up in the two-match Test series. The stand-out performer and the ‘Player of the Match’ was India’s flamboyant all-rounder Ravindra Jadeja who not only smashed his career-best knock of 175 (228) during the first innings, but also picked up a total of nine wickets in the match, while narrowly missing on the rare list of players who’ve performed the double of a century and ten wickets in a single Test match. A round of applause for @imjadeja for his Man of the Match performance Victory for #TeamIndia indeed tastes sweet #INDvSL @Paytm pic.twitter.com/8RnNN7r38w — BCCI (@BCCI) March 6, 2022 With India posting a massive 574-6 d in the first innings, all Sri Lanka could do was play the catch-up game, as India operated with a spin-heavy attack. But, all Sri Lanka could manage were a couple of half-centuries by Pathum Nissanka (61 in the first innings) and Niroshan Dickwella (51* in the second innings), as Dimuth Karunaratne’s men could come up with scores of 174/10 and 178/10 in their two innings, losing as many as 16 wickets on Day 3. The famous spin-bowling duo of Ravichandran Ashwin and Ravindra Jadeja turned up yet again in an Indian home Test to together scalp 15 wickets in the match. Biggest win in Test cricket India’s win at Mohali was their fifth-largest victory ever in the Test format by an innings. As far as the biggest victory in Tests is concerned (by an innings), the record is held by England, who defeated Australia by an innings and 579 runs at ‘The Oval’ way back in the year 1938. Team India’s largest win by an innings came at Rajkot in 2018, when they humbled the West Indies by an innings and 272 runs. Their biggest win in terms of runs came against New Zealand a few months ago in December, when they defeated the Black Caps by 372 runs at the Wankhede Stadium in Mumbai. Team India largest Test wins (by an innings) Victory margin Opposition Year Venue Innings & 272 runs West Indies 2018 Rajkot Innings & 262 runs Afghanistan 2018 Bengaluru Innings & 239 runs Bangladesh 2007 Mirpur Innings & 239 runs Sri Lanka 2017 Nagpur Innings & 222 runs Sri Lanka 2022 Mohali Team India largest Test wins (by runs) Victory margin Opposition Year Venue 372 runs New Zealand 2021 Mumbai 337 runs South Africa 2015 Delhi 321 runs New Zealand 2016 Indore 320 runs Australia 2008 Mohali 318 runs West Indies 2019 North Sound   The post Biggest win in Test cricket: List of India’s largest Test wins appeared first on The SportsRush.","pubDate":"2022-03-06 14:27:45","full_description":"Biggest win in Test cricket: Team India won the first of the two-match Test series against Sri Lanka by an innings and 222 runs. The Rohit Sharma-juggernaut continues trampling down the oppositions as he registered his 13th consecutive international win since taking over as team India’s regular skipper. The latest win came against Sri Lanka as his men handed their Asian rivals a heavy shellacking by an innings and 222 runs at the PCA IS Bindra Stadium in Mohali, to go 1-0 up in the two-match Test series. The stand-out performer and the ‘Player of the Match’ was India’s flamboyant all-rounder Ravindra Jadeja who not only smashed his career-best knock of 175 (228) during the first innings, but also picked up a total of nine wickets in the match, while narrowly missing on the rare list of players who’ve performed the double of a century and ten wickets in a single Test match. A round of applause 👏👏 for @imjadeja for his Man of the Match performance 🔝 Victory for #TeamIndia indeed tastes sweet 🍰😉 #INDvSL @Paytm pic.twitter.com/8RnNN7r38w — BCCI (@BCCI) March 6, 2022 With India posting a massive 574-6 d in the first innings, all Sri Lanka could do was play the catch-up game, as India operated with a spin-heavy attack. But, all Sri Lanka could manage were a couple of half-centuries by Pathum Nissanka (61 in the first innings) and Niroshan Dickwella (51* in the second innings), as Dimuth Karunaratne’s men could come up with scores of 174/10 and 178/10 in their two innings, losing as many as 16 wickets on Day 3. The famous spin-bowling duo of Ravichandran Ashwin and Ravindra Jadeja turned up yet again in an Indian home Test to together scalp 15 wickets in the match. India’s win at Mohali was their fifth-largest victory ever in the Test format by an innings. As far as the biggest victory in Tests is concerned (by an innings), the record is held by England, who defeated Australia by an innings and 579 runs at ‘The Oval’ way back in the year 1938. Team India’s largest win by an innings came at Rajkot in 2018, when they humbled the West Indies by an innings and 272 runs. Their biggest win in terms of runs came against New Zealand a few months ago in December, when they defeated the Black Caps by 372 runs at the Wankhede Stadium in Mumbai.","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Shane Warne dies age 52 – Liz Hurley pays tribute to cricket legend after star was found dead in Thailand v... - The Sun","link":"https://news.google.com/__i/rss/rd/articles/CBMiSmh0dHBzOi8vd3d3LnRoZXN1bi5jby51ay9zcG9ydC8xNzg0NTEwMS9zaGFuZS13YXJuZS1kZWF0aC1uZXdzLWxpei1odXJsZXkv0gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Shane Warne dies age 52 – Liz Hurley pays tribute to cricket legend after star was found dead in Thailand v...  The SunShane Warne completed 'extreme' 14-day liquid diet before dying of a heart attack in Thailand  Daily MailShane Warne’s death is like that of a friend and gets worse with each hour  The GuardianShane Warne’s pals’ cry as medics battled to save cricket star after he spent final hours buying suit & hav...  The SunShane Warne's body transported from Koh Samui mortuary for post-mortem after Thailand death  Daily MailView Full coverage on Google News","content":null,"pubDate":"2022-03-06 14:16:36","image_url":null,"source_id":"google","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Ravindra Jadeja feasts on Lankan ineptitude: All-rounder follows ton with nine-wicket match haul - The Indian Express","link":"https://news.google.com/__i/rss/rd/articles/CBMifmh0dHBzOi8vaW5kaWFuZXhwcmVzcy5jb20vYXJ0aWNsZS9zcG9ydHMvY3JpY2tldC9yYXZpbmRyYS1qYWRlamEtZmVhc3RzLW9uLWxhbmthbi1pbmVwdGl0dWRlLWh1bmRyZWQtd2lja2V0cy1hbmFseXNpcy03ODAzOTgyL9IBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Ravindra Jadeja feasts on Lankan ineptitude: All-rounder follows ton with nine-wicket match haul  The Indian Express\"It Was My Suggestion..\": Ravindra Jadeja Reveals Why India Declared When He Was Batting On 175 On Day 2 vs SL In Mohali  Cricket AddictorIndia vs Sri Lanka, 1st Test Day 3: Ravindra Jadeja and R Ashwin wrap it up for India inside 3 days, win  Times of IndiaIndia beat Sri Lanka by an innings and 222 runs in Mohali  The Tribune IndiaStats - Jadeja continues love affair with Mohali; Ashwin goes past Kapil Dev  ESPNcricinfoView Full coverage on Google News","content":null,"pubDate":"2022-03-06 13:33:38","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"India W vs Pakistan W: Indian team snaps adorable picture with Pakistan skipper Bismah and her daughter","link":"https://www.indiatvnews.com/sports/cricket/india-w-vs-pakistan-w-indian-team-snaps-adorable-picture-with-pakistan-skipper-bismah-and-her-daughter-2022-03-06-762982","keywords":null,"creator":null,"video_url":null,"description":"After a dominating win in their opening clash of the ongoing Women's ODI World Cup, the Indian team posed with Pakistan skipper Bismah Maroof's daughter. In the picture shared by the International Cricket Council's (ICC) official Twitter account, Indian skipper Mithali Raj, Shafali Verma, Smriti Mandha and others could be seen posing with Bismah Maroof and her daughter, Fatima.","content":null,"pubDate":"2022-03-06 13:32:35","full_description":"After a dominating win in their opening clash of the ongoing Women's ODI World Cup, the Indian team posed with Pakistan skipper Bismah Maroof's daughter. In the picture shared by the International Cricket Council's (ICC) official Twitter account, Indian skipper , Shafali Verma, Smriti Mandha and others could be seen posing with Bismah Maroof and her daughter, Fatima. \"Little Fatima's first lesson in the spirit of cricket from India and Pakistan,\" ICC captioned the post. Twitteratis poured love and appreciation for the picture. Commenting on ICC's post, Pakistan all-rounder Kainat Imtiaz wrote, \"Our lil star\". Another user wrote, \"Great gesture shown by team India towards peace, hope another side will do the same. Peace and love should always prevail, rivalry should not because of enmity _it must be source of enjoyment_ anyway good luck and congratulations girls in blue.\" Fighting knocks of Sneh Rana and were backed up by all-around bowling performance as India defeated Pakistan by 107 runs in the fourth game of the ongoing ICC Women's 50-over World Cup. Earlier, Pooja Vastrakar (67), (52) and Sneh Rana (53*) were the standout performers as India posted 244/7. Vastrakar and Rana formed a 122-run stand for the seventh wicket. In the final five overs, India scored more runs to take the total past the 240-run mark. India will next lock horns against New Zealand in the tournament on Thursday.","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL 2022 Full Schedule: Date, Time And Venue Of All Matches","link":"https://sports.ndtv.com/cricket/ipl-2022-full-schedule-date-time-and-venue-of-all-matches-2806915","keywords":null,"creator":null,"video_url":null,"description":"IPL 2022 Full schedule with date, time and venue of all matches was announced by the Board of Control for Cricket in India (BCCI) on Sunday. IPL 2022 will be a 10-team affair with Lucknow Super Giants...","content":null,"pubDate":"2022-03-06 13:14:28","full_description":"IPL 2022 Full schedule with date, time and venue of all matches was announced by the Board of Control for Cricket in India (BCCI) on Sunday. IPL 2022 will be a 10-team affair with Lucknow Super Giants and Gijarat Titans playing in their first season. The first match will be played as Wankhede Stadium in Mumbai on March 26 and it will be a replay of last year's final, which will see defending champions Chennai Super Kings take on IPL 2021 runners-up Kolkata Knight Riders. It will be the first match as captain of KKR for Shreyas Iyer. 1 Saturday March 26, 2022 CSK vs KKR 7:30 PM Wankhede Stadium 2 Sunday March 27, 2022 DC vs MI 3:30 PM Brabourne – CCI 3 Sunday March 27, 2022 PBKS vs RCB 7:30 PM DY Patil Stadium 4 Monday March 28, 2022 GT vs LSG 7:30 PM Wankhede Stadium 5 Tuesday March 29, 2022 SRH vs RR 7:30 PM MCA Stadium, Pune 6 Wednesday March 30, 2022 RCB vs KKR 7:30 PM DY Patil Stadium 7 Thursday March 31, 2022 LSG vs CSK 7:30 PM Brabourne – CCI 8 Friday April 1, 2022 KKR vs PBKS 7:30 PM Wankhede Stadium 9 Saturday April 2, 2022 MI vs RR 3:30 PM DY Patil Stadium 10 Saturday April 2, 2022 GT vs DC 7:30 PM MCA Stadium, Pune 11 Sunday April 3, 2022 CSK vs PBKS 7:30 PM Brabourne – CCI 12 Monday April 4, 2022 SRH vs LSG 7:30 PM DY Patil Stadium 13 Tuesday April 5, 2022 RR vs RCB 7:30 PM Wankhede Stadium 14 Wednesday April 6, 2022 KKR vs MI 7:30 PM MCA Stadium, Pune 15 Thursday April 7, 2022 LSG vs DC 7:30 PM DY Patil Stadium 16 Friday April 8, 2022 PBKS vs GT 7:30 PM Brabourne – CCI 17 Saturday April 9, 2022 CSK vs SRH 3:30 PM DY Patil Stadium 18 Saturday April 9, 2022 RCB vs MI 7:30 PM MCA Stadium, Pune 19 Sunday April 10, 2022 KKR vs DC 3:30 PM Brabourne – CCI 20 Sunday April 10, 2022 RR vs LSG 7:30 PM Wankhede Stadium 21 Monday April 11, 2022 SRH vs GT 7:30 PM DY Patil Stadium 22 Tuesday April 12, 2022 CSK vs RCB 7:30 PM DY Patil Stadium 23 Wednesday April 13, 2022 MI vs PBKS 7:30 PM MCA Stadium, Pune 24 Thursday April 14, 2022 RR vs GT 7:30 PM DY Patil Stadium 25 Friday April 15, 2022 SRH vs KKR 7:30 PM Brabourne – CCI 26 Saturday April 16, 2022 MI vs LSG 3:30 PM Brabourne – CCI 27 Saturday April 16, 2022 DC vs RCB 7:30 PM Wankhede Stadium 28 Sunday April 17, 2022 PBKS vs SRH 3:30 PM Brabourne – CCI 29 Sunday April 17, 2022 GT vs CSK 7:30 PM MCA Stadium, Pune 30 Monday April 18, 2022 RR vs KKR 7:30 PM Brabourne – CCI 31 Tuesday April 19, 2022 LSG vs RCB 7:30 PM DY Patil Stadium 32 Wednesday April 20, 2022 DC vs PBKS 7:30 PM MCA Stadium, Pune 33 Thursday April 21, 2022 MI vs CSK 7:30 PM DY Patil Stadium 34 Friday April 22, 2022 DC vs RR 7:30 PM MCA Stadium, Pune 35 Saturday April 23, 2022 KKR vs GJ 3:30 PM DY Patil Stadium 36 Saturday April 23, 2022 RCB vs SRH 7:30 PM Brabourne – CCI 37 Sunday April 24, 2022 LSG vs MI 7:30 PM Wankhede Stadium 38 Monday April 25, 2022 PBKS vs CSK 7:30 PM Wankhede Stadium 39 Tuesday April 26, 2022 RCB vs RR 7:30 PM MCA Stadium, Pune 40 Wednesday April 27, 2022 GT vs SRH 7:30 PM Wankhede Stadium 41 Thursday April 28, 2022 DC vs KKR 7:30 PM Wankhede Stadium 42 Friday April 29, 2022 PBKS vs LSG 7:30 PM MCA Stadium, Pune 43 Saturday April 30, 2022 GT vs RCB 3:30 PM Brabourne – CCI 44 Saturday April 30, 2022 RR vs MI 7:30 PM DY Patil Stadium 45 Sunday May 1, 2022 DC vs LSG 3:30 PM Wankhede Stadium 46 Sunday May 1, 2022 SRH vs CSK 7:30 PM MCA Stadium, Pune 47 Monday May 2, 2022 KKR vs RR 7:30 PM Wankhede Stadium 48 Tuesday May 3, 2022 GT vs PBKS 7:30 PM DY Patil Stadium 49 Wednesday May 4, 2022 RCB vs CSK 7:30 PM MCA Stadium, Pune 50 Thursday May 5, 2022 DC vs SRH 7:30 PM Brabourne – CCI 51 Friday May 6, 2022 GT vs MI 7:30 PM Brabourne – CCI 52 Saturday May 7, 2022 PBKS vs RR 3:30 PM Wankhede Stadium 53 Saturday May 7, 2022 LSG vs KKR 3:30 PM MCA Stadium, Pune 54 Sunday May 8, 2022 SRH vs RCB 3:30 PM Wankhede Stadium 55 Sunday May 8, 2022 CSK vs DC 3:30 PM DY Patil Stadium 56 Monday May 9, 2022 MI vs KKR 7:30 PM DY Patil Stadium 57 Tuesday May 10, 2022 LSG vs GT 7:30 PM MCA Stadium, Pune 58 Wednesday May 11, 2022 RR vs DC 7:30 PM DY Patil Stadium 59 Thursday May 12, 2022 CSK vs MI 7:30 PM Wankhede Stadium 60 Friday May 13, 2022 RCB vs PBKS 7:30 PM Brabourne – CCI 61 Saturday May 14, 2022 KKR vs SRH 7:30 PM MCA Stadium, Pune 62 Sunday May 15, 2022 CSK vs GT 3:30 PM Wankhede Stadium 63 Sunday May 15, 2022 LSG vs RR 7:30 PM Brabourne – CCI 64 Monday May 16, 2022 PBKS vs DC 7:30 PM DY Patil Stadium 65 Tuesday May 17, 2022 MI vs SRH 7:30 PM Wankhede Stadium 66 Wednesday May 18, 2022 KKR vs LSG 7:30 PM DY Patil Stadium 67 Thursday May 19, 2022 RCB vs GT 7:30 PM Wankhede Stadium 68 Friday May 20, 2022 RR vs CSK 7:30 PM Brabourne – CCI 69 Saturday May 21, 2022 MI vs DC 7:30 PM Wankhede Stadium 70 Sunday May 22, 2022 SRH vs PBKS 7:30 PM Wankhede Stadium","image_url":"https://c.ndtvimg.com/2022-02/sh2t6ncg_ipl-auction-ipl_625x300_12_February_22.jpg?im=FeatureCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"RCB's Matches in IPL 2022: Bangalore to play first match vs Punjab Kings, check Royal Challengers Bangalore's full schedule here","link":"https://zeenews.india.com/cricket/rcbs-matches-in-ipl-2022-bangalore-to-play-first-match-vs-punjab-kings-check-royal-challengers-bangalores-full-schedule-here-2442734.html","keywords":null,"creator":null,"video_url":null,"description":"The Board of Control for Cricket in India (BCCI) on Sunday announced the schedule for Indian Premier League (IPL) 2022 which will be held in Mumbai and Pune.","content":null,"pubDate":"2022-03-06 12:39:00","full_description":"RCB Matches in IPL 2022: The Board of Control for Cricket in India (BCCI) on Sunday announced the schedule for Indian Premier League (IPL) 2022 which will be held in Mumbai and Pune. Check Full IPL 2022 Schedule here A total number of 70 league matches and 4 Playoff games will be played in the duration of 65 days. The 15th season will start on March 26 at the Wankhede stadium with a blockbuster clash between Chennai Super Kings and Kolkata Knight Riders. On March 27, the league will stage its first double-header starting off with a Day game at Brabourne where the Delhi Capitals will square off against Mumbai Indians. The DY Patil Stadium will host the clash between Punjab Kings and Royal Challengers Bangalore at night of March 27 RCB will be play their last game on May 19 against Gujarat Titains at Wankhede. 27th March vs PBKS, 7.30 pm at DY Patil Stadium. 30th March vs KKR, 7.30 pm IST at DY Patil Stadium 5th April vs RR, at 7.30 pm IST at Wankhede stadium 9th April vs MI, at 7.30 pm IST, at MCA Stadium, Pune 12th April vs CSK, at 7.30 pm IST at DY Patil Stadium 16th April vs DC, at 7.30 pm IST at Wankhede stadium 19th April vs LSG, at 7.30 PM IST at DY Patil Stadium 23rd April vs SRH, at 7.30 PM IST at Brabourne, CCI 26th April vs RR, at 7.30 PM IST at MCA Stadium in Pune 30th April vs GT, at 3.30 pm IST at Brabourne, CCI 4th May vs CSK, at 7.30 pm IST at MCA Stadium in Pune 8th May vs SRH at 3.30 pm IST at Wankhede stadium 13th May vs PBKS, at 7.30 pm IST at Brabourne, CCI 19th May vs GT, at 7.30 pm IST at Wankhede stadium","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL 2022 to start from March 26; CSK to face KKR in lung-opener","link":"https://www.thehindu.com/sport/cricket/ipl-2022-to-start-from-march-26-csk-to-face-kkr-in-lung-opener/article65198352.ece","keywords":null,"creator":["\n        PTI  \n    "],"video_url":null,"description":"All IPL games will be played across four venues -- Wankhede Stadium and Cricket Club of India in Mumbai, DY Patil stadium in Navi Mumbai and Maharashtra Cricket Association stadium in Pune","content":null,"pubDate":"2022-03-06 12:33:15","full_description":"The Board of Control for Cricket in India (BCCI) announced the schedule for the 15th edition of the Indian Premier League (IPL) on March 6, 2022. File | Photo Credit: Arjun Singh Defending champions Chennai Super Kings will face Kolkata Knight Riders in the opening game of the 15th edition of the Indian Premier League (IPL) at the Wankhede stadium in Mumbai on March 26. The Board of Control for Cricket in India (BCCI) on Sunday announced the schedule of the cash-rich league, which will be played across four venues -- Wankhede Stadium and Cricket Club of India in Mumbai, DY Patil stadium in Navi Mumbai and Maharashtra Cricket Association stadium in Pune. “A total number of 70 league matches and 4 playoff games will be played in the duration of 65 days,” BCCI secretary Jay Shah said in a media release. There will be 12 double-headers in the tournament and on such days, the first game will be played at 3.30 p.m. and the evening matches will be played at 7.30 p.m. The first-double header will be played on March 27 with a day-game at the Brabourne stadium (CCI) where the Delhi Capitals will square off five-time champions Mumbai Indians. Later, DY Patil Stadium will host the clash between Punjab Kings and Royal Challengers Bangalore in a night game. The first match in Pune will be played on March 29 when Sunrisers Hyderabad take on Rajasthan Royals. It was already announced by the BCCI, that in all, 20 matches each would be held at Wankhede stadium and DY Patil Stadium, while 15 games each would be played at the Brabourne stadium and in Pune. The final league game will also be played at the Wankhede stadium in Mumbai on May 22 between Sunrisers Hyderabad and Punjab Kings. Both the new teams Gujarat Titans and the Lucknow Super Giants with play their first match, against each other, at the Wankhede on March 28. The BCCI said that the schedule for the play-offs and the final to be played on May 29, would be announced later. Our code of editorial values Printable version | Mar 6, 2022 6:08:13 pm | https://www.thehindu.com/sport/cricket/ipl-2022-to-start-from-march-26-csk-to-face-kkr-in-lung-opener/article65198352.ece © THG PUBLISHING PVT LTD.","image_url":null,"source_id":"thehindu","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL: Chennai-Kolkata clash in opener; Delhi Capital play Mumbai on Mar 27","link":"https://www.business-standard.com/article/sports/ipl-chennai-kolkata-clash-in-opener-delhi-capital-play-mumbai-on-mar-27-122030600604_1.html","keywords":null,"creator":null,"video_url":null,"description":"The Board of Control for Cricket in India (BCCI) on Sunday announced the schedule for Indian Premier League (IPL) 2022 which will be held in Mumbai and Pune.A total number of 70 league matches and 4 Playoff games will be played in the duration of 65 days. The 15th season will start on March 26 at the Wankhede stadium with a blockbuster clash between Chennai Super Kings and Kolkata Knight Riders.On March 27, the league will stage its first double-header starting off with a Day game at Brabourne where the Delhi Capitals will square off against Mumbai Indians. The DY Patil Stadium will host the clash between Punjab Kings and Royal Challengers Bangalore at night.The MCA Stadium in Pune will host its first game on March 29 when Sunrisers Hyderabad take on Rajasthan Royals.In all, 20 matches each will be held at Wankhede Stadium and DY Patil Stadium, 15 matches each at Brabourne and MCA International stadium, Pune.There will be 12 doubleheaders in total with the first match starting at 3:30","content":null,"pubDate":"2022-03-06 12:26:00","full_description":"The Board of Control for Cricket in India (BCCI) on Sunday announced the schedule for Indian Premier League (IPL) 2022 which will be held in Mumbai and Pune. A total number of 70 league matches and 4 Playoff games will be played in the duration of 65 days. The 15th season will start on March 26 at the Wankhede stadium with a blockbuster clash between Chennai Super Kings and Kolkata Knight Riders. On March 27, the league will stage its first double-header starting off with a Day game at Brabourne where the Delhi Capitals will square off against Mumbai Indians. The DY Patil Stadium will host the clash between Punjab Kings and Royal Challengers Bangalore at night. The MCA Stadium in Pune will host its first game on March 29 when Sunrisers Hyderabad take on Rajasthan Royals. In all, 20 matches each will be held at Wankhede Stadium and DY Patil Stadium, 15 matches each at Brabourne and MCA International stadium, Pune. There will be 12 doubleheaders in total with the first match starting at 3:30 PM IST. All evening matches will start at 7:30 PM IST. The final game of the league stage will be played between Sunrisers Hyderabad and Punjab Kings on May 22 at the Wankhede Stadium. The schedule for the Playoffs and the IPL 2022 final to be played on May 29 will be announced later. The IPL 2022 season will be held from March 26-May 29. A total of 70 league matches will be played across four international standard venues in Mumbai and Pune. The venue for the playoff matches will be decided later. Interestingly, with regards to doubleheaders, there will be 12 matches/days. Mumbai, Wankhede Stadium will host 20 matches while 15 matches will be played at Brabourne Stadium (CCI). DY Patil Stadium, Mumbai will host 20 matches while Pune's MCA International Stadium will conduct 15 matches. Group A: Mumbai Indians, Delhi Capitals, Kolkata Knight Riders, Rajasthan Royals, and Lucknow Super Giants. Group B will consist of: Chennai Super Kings, Sunrises Hyderabad, Royal Challengers Bangalore, Punjab Kings, and Gujarat Titans. (Only the headline and picture of this report may have been reworked by the Business Standard staff; the rest of the content is auto-generated from a syndicated feed.)","image_url":"https://bsmedia.business-standard.com/_media/bs/img/article/default/1220306/thumb-122030600604.jpg","source_id":"business-standard","country":["india"],"category":["sports"],"language":"english"}]}