{"newsArray":[{"article_id":"acdb683e1b3118096ef509909f182dae","title":"How much money will Pakistan receive from ICC despite early exit from World Cup 2023?","link":"https://en.dailypakistan.com.pk/12-Nov-2023/how-much-money-will-pakistan-receive-from-icc-despite-early-exit-from-world-cup-2023","keywords":["Sports"],"creator":["Web Desk"],"video_url":null,"description":"LAHORE – The Pakistan cricket team is set to receive a substantial financial reward despite elimination from the ICC World Cup 2023 at the league stage.","content":"LAHORE – The Pakistan cricket team is set to receive a substantial financial reward despite elimination from the ICC World Cup 2023 at the league stage. The Green Shirts will receive $260,000 from the allocated prize money for the ICC World Cup. For their achievements, winning four matches and progressing to the group stage, Pakistan will be awarded a sum exceeding Rs73 million. Pakistan failed to finish in the top four of the ongoing World Cup. The Men in Green lost five of their league games, the first time ever at a single World Cup edition, which included an array of four straight losses, to finish fifth in the points table. The triumph in four matches helped them to fetch Pakistan $160,000. The International Cricket Council (ICC) has reserved a prize of $40,000 for each victorious match. In recognition of playing in the group stage, the Pakistan team will be granted $100,000. Meanwhile, teams losing semi-finals will be compensated with $800,000. The runner-up in the ICC World Cup is in line to receive $2 million, while the victorious team will pocket $4 million. The ICC has designated the total prize money for the World Cup at $10 million. Remember, the four semi-finalists have been confirmed for the knockout stage of the ICC Men's Cricket World Cup 2023. Semi-final 1: India vs New Zealand, Wednesday 15th November, Wankhede Stadium, Mumbai Semi-final 2: South Africa vs Australia, Thursday 16th November, Eden Gardens, Kolkata Final: India / New Zealand vs South Africa / Australia, Sunday 19th November, Narendra Modi Stadium, Ahmedabad","pubDate":"2023-11-12 18:22:39","image_url":"https://en.dailypakistan.com.pk/digital_images/large/2023-11-12/how-much-money-will-pakistan-receive-from-icc-despite-early-exit-from-world-cup-2023-1699813213-5977.png","source_id":"dailypakistanen","source_priority":97265,"country":["pakistan"],"category":["sports"],"language":"english"},{"article_id":"8363215bba0d6add15cfa36dd2ce0c53","title":"Has ICC invited Imran Khan to World Cup final ceremony?","link":"https://en.dailypakistan.com.pk/12-Nov-2023/has-icc-invited-imran-khan-to-world-cup-final-ceremony","keywords":["ODI World Cup Updates, Sports, Viral"],"creator":["Web Desk"],"video_url":null,"description":"The International Cricket Council (ICC) has reportedly invited all the winning captains to the World Cup 2023 final match ceremony slated to be held on November 19, 2023.","content":"The International Cricket Council (ICC) has reportedly invited all the winning captains to the World Cup 2023 final match ceremony slated to be held on November 19, 2023. As the World Cup action continues for over a month now, the leading ICC event is set to culminate with an extravagant ceremony. All the winning captains will gather at the Narendra Modi Stadium on the invitation of the top cricket body. Among all the World Cup winning captains, former cricket star turned politician Imran Khan remains a leading figure as he holds a massive fan following due to his charisma and populist style of politics. Khan remains the only player who lifted the World Cup trophy for Pakistan, and it was three decades back when he led a team that bagged the World Cup in Melbourne. Unverified reports say that ICC has invited Imran Khan and other players to the Winning Captains Ceremony, but it raised many questions as the former prime minister remains behind the bars for 100 days. The PTI chief’s visit to the neighboring country for the event is something that fans can assume but in reality it seems impossible as the former cricketer is facing over 150 cases related to terrorism, blasphemy and revealing national secrets. Amid the ongoing legal proceedings, the former skipper is highly unlikely to travel to India for the World Cup ceremony.","pubDate":"2023-11-12 17:13:08","image_url":"https://en.dailypakistan.com.pk/digital_images/large/2023-11-12/has-icc-invited-imran-khan-along-with-other-winning-captains-for-world-cup-ceremony-1699797028-6891.jpg","source_id":"dailypakistanen","source_priority":97265,"country":["pakistan"],"category":["sports"],"language":"english"},{"article_id":"ddb084942bbe5163199c7f07836c9c1e","title":"World Cup: Iyer, Rahul fireworks lead rout of Netherlands as India make it 9-in-a-row","link":"https://timesofindia.indiatimes.com/sports/cricket/icc-world-cup/news/world-cup-shreyas-iyer-kl-rahul-fireworks-lead-rout-of-netherlands-as-india-make-it-9-in-a-row/articleshow/105170606.cms","keywords":null,"creator":null,"video_url":null,"description":"Centuries from Shreyas Iyer and KL Rahul powered India to a 160-run World Cup win over the Netherlands as they completed the group stage with a perfect 9 wins in 9 games. Iyer (128*) and Rahul (102) put on 208 runs to guide India to 410 for 4. India then employed 9 bowlers, including part-timers Virat Kohli and Rohit Sharma, to dismiss the Dutch for 250. The victory over Dutch meant India surpassed their previous record of 8 straight wins registered in the 2003 edition.","content":"World Cup 2023| 49 cut-outs of Virat Kohli in Bengaluru as India lock horns with Netherlands World Cup: It's India vs NZ, SA vs AUS in semis Team India celebrates Diwali in Bengaluru England send Pakistan crashing out of World Cup Marsh's ton ensures Australia cruise past Bangladesh World Cup: South Africa scrape past spirited Afghanistan NZ edge closer to semifinal with clinical win over Sri Lanka Maxwell's stunning 201* guides Australia to WC semi-finals Bangladesh beat Sri Lanka after Mathews 'timed out' row Virat Kohli's four centuries at ODI World Cup Virat Kohli leads India stat attack against South Africa","pubDate":"2023-11-12 16:42:35","image_url":null,"source_id":"toi","source_priority":391,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"57f4a870c697e41bf066fea6e43c77cc","title":"On 'Cloud Nine': Shreyas, Rahul fireworks power India to 160-run win over Netherlands","link":"https://www.tribuneindia.com/news/world-cup-2023/on-cloud-nine-shreyas-rahul-fireworks-power-india-to-160-run-win-over-netherlands-561950","keywords":null,"creator":null,"video_url":null,"description":"Bengaluru, November 12KL Rahul's pillaging hundred, the fastest by an Indian in World Cup, and Shreyas Iyer's doubts-allaying 128 lit up the Diwali day as India mowed down Netherlands by 160 runs here on Sunday, registering their ninth consecutive victory in the showpiece.It helped India finish their league engagements with 18 points, and now they will move to Mumbai for the high-stakes semi-final clash against New Zealand on Wednesday.Rahul's blitz and Iyer's posh unbeaten 94-ball hundred combined well with fifties by Shubman Gill (51), Rohit Sharma (61) and Virat Kohli (51), powering India to a mammoth 410 for 4, their second highest World Cup total.Thus, India became the third team in this tournament to post 400 after South Africa and New Zealand. The Indian bowlers did not have to sweat much to skittle the Dutch for 250 as even Kohli and Rohit, who took the final scalp, found themselves among the wicket-takers.The Indian innings was dotted by two big stands that brilliantly exhibited aggressive batsmanship, so diligently followed by the hosts throughout this event.Rohit and Gill started the carnage with a forceful 100-run alliance off just 71 balls for the opening wicket. Rahul and Iyer exponentiated that collecting 208 runs for the fourth wicket in little over 21 overs, and 122 runs cascaded in the final 10 overs alone.The tons by Iyer and Rahul will delight the Indian management no end ahead of the knockouts in terms of middle-order batters' productivity.However, Iyer's knock will please the thinktank by that bit more. There has been chatter around the right-hander's susceptibility against short-pitched balls and he cleared it by some degree here.The Netherland pacers did try that strategy against Iyer but the Mumbaikar was right up to the task, playing the pulls with comfort.He made 82 runs on the on-side during his innings and 35 runs came off pulls or horizontal-batted shots. It might have filled him also with some level of confidence ahead of the crunch match against the Kiwis.But his innings was not just about clearing the doubts as he scientifically broke down the Dutch bowling unit. In fact, Iyer' was the kind of ODI innings that one can include in coaching archives as a model for budding cricketers.The biggest highlight of Iyer's batting is his ability to avoid risks ndash; the awareness of bowlers and areas to target to keep the run-flow steady. It was on full view at the Chinnaswamy stadium.Usually a fine player of spin, Iyer does have a weakness against the slow left-armers, evidenced by a reduced strike-rate of 90 against that type as compared to other exponents of slow bowling.In line with that, he played out Roelof van der Merwe for singles and twos while targeting offie Aryan Dutt and pacers Paul van Meekeren and Logan van Beek.Van Meekeren felt the heat in particular as Iyer lofted him for two 80m sixes over long-on and cover as the Dutch pacer gave too much width to free his hands.They were not manufactured shots but the balls were begging to be hit, and Iyer just obliged.Soon, he notched up his hundred with a single to mid-off off pacer Bas de Leede, and it took him just 84 balls.Rahul, in fact, started quite steadily, and focused more on giving strike to the in-touch Iyer.The first 30 balls he faced produced 26 runs, but once he decided to carve a place for himself in the partnership the next 33 balls saw Rahul pummelling 76 runs.The Bengaluru man unbundled some of those shots that make his batting a captivating view. Iyer preferred the on-side more to get his runs, but Rahul's shot-making touched all parts of the ground.While he made 58 runs on the leg-side, 44 runs came through the off. It is tough to bowl to Rahul when is on the button and the Netherlands bowlers, in particular Meekeren and De Leede, felt the heat.The signature swat-flick six off Van Meekeren over mid-wicket drew wows from the holiday crowd, while a slice-cut off Van Beek over deep backward point was all about instant innovation.The 31-year-old soon brought up his seventh one-day hundred in bright style too ndash; smashing two successive sixes off pacer De Leede over the mid-wicket region, and all he took was just 62 balls.With that hundred, Rahul overcame Rohit's World Cup record of 63-ball ton which the latter set during the match against Afghanistan.However, the marauding start at the top given by Rohit and Gill once India batted by choice was just as important.Gill did the early running for India on a Chinnaswamy pitch that offered a hint of bounce, producing his almost nil-follow through pulls and other range of shots predominantly on the leg-side.After a slightly sedate start, Rohit also slipped into overdrive to punish the Netherlands bowlers.But the ambition to accelerate led to the downfall of both of them, giving catches to the deep. But Kohli and Iyer added 71 runs off 66 balls to keep India chugging.Just as Kohli looked primed for that much-anticipated 50th ODI hundred, Van der Merwe castled him with a skidder that rushed under his downcoming bat.However, later Kohli had a sugary moment when he got the wicket of Dutch captain Scott Edwards, caught down the leg by Rahul behind the stumps, sending the spectators into a delirium.Even Gill and Suryakumar Yadav also turned their arms for a couple of overs giving the proceedings a fin-de-siecle touch as the hosts used nine bowlers.The Netherlands' chase had nothing to write home about, apart from a brisk fifty by Teja Nidamanuru (54 off 39 balls) as they unravelled gradually.","content":"PTI Bengaluru, November 12 KL Rahul's pillaging hundred, the fastest by an Indian in World Cup, and Shreyas Iyer's doubts-allaying 128 lit up the Diwali day as India mowed down Netherlands by 160 runs here on Sunday, registering their ninth consecutive victory in the showpiece. It helped India finish their league engagements with 18 points, and now they will move to Mumbai for the high-stakes semi-final clash against New Zealand on Wednesday. Rahul's blitz and Iyer's posh unbeaten 94-ball hundred combined well with fifties by Shubman Gill (51), Rohit Sharma (61) and Virat Kohli (51), powering India to a mammoth 410 for 4, their second highest World Cup total. Thus, India became the third team in this tournament to post 400 after South Africa and New Zealand. The Indian bowlers did not have to sweat much to skittle the Dutch for 250 as even Kohli and Rohit, who took the final scalp, found themselves among the wicket-takers. The Indian innings was dotted by two big stands that brilliantly exhibited aggressive batsmanship, so diligently followed by the hosts throughout this event. Rohit and Gill started the carnage with a forceful 100-run alliance off just 71 balls for the opening wicket. Rahul and Iyer exponentiated that collecting 208 runs for the fourth wicket in little over 21 overs, and 122 runs cascaded in the final 10 overs alone. The tons by Iyer and Rahul will delight the Indian management no end ahead of the knockouts in terms of middle-order batters' productivity. However, Iyer's knock will please the thinktank by that bit more. There has been chatter around the right-hander's susceptibility against short-pitched balls and he cleared it by some degree here. The Netherland pacers did try that strategy against Iyer but the Mumbaikar was right up to the task, playing the pulls with comfort. He made 82 runs on the on-side during his innings and 35 runs came off pulls or horizontal-batted shots. It might have filled him also with some level of confidence ahead of the crunch match against the Kiwis. But his innings was not just about clearing the doubts as he scientifically broke down the Dutch bowling unit. In fact, Iyer' was the kind of ODI innings that one can include in coaching archives as a model for budding cricketers. The biggest highlight of Iyer's batting is his ability to avoid risks – the awareness of bowlers and areas to target to keep the run-flow steady. It was on full view at the Chinnaswamy stadium. Usually a fine player of spin, Iyer does have a weakness against the slow left-armers, evidenced by a reduced strike-rate of 90 against that type as compared to other exponents of slow bowling. In line with that, he played out Roelof van der Merwe for singles and twos while targeting offie Aryan Dutt and pacers Paul van Meekeren and Logan van Beek. Van Meekeren felt the heat in particular as Iyer lofted him for two 80m sixes over long-on and cover as the Dutch pacer gave too much width to free his hands. They were not manufactured shots but the balls were begging to be hit, and Iyer just obliged. Soon, he notched up his hundred with a single to mid-off off pacer Bas de Leede, and it took him just 84 balls. Rahul, in fact, started quite steadily, and focused more on giving strike to the in-touch Iyer. The first 30 balls he faced produced 26 runs, but once he decided to carve a place for himself in the partnership the next 33 balls saw Rahul pummelling 76 runs. The Bengaluru man unbundled some of those shots that make his batting a captivating view. Iyer preferred the on-side more to get his runs, but Rahul's shot-making touched all parts of the ground. While he made 58 runs on the leg-side, 44 runs came through the off. It is tough to bowl to Rahul when is on the button and the Netherlands bowlers, in particular Meekeren and De Leede, felt the heat. The signature swat-flick six off Van Meekeren over mid-wicket drew wows from the holiday crowd, while a slice-cut off Van Beek over deep backward point was all about instant innovation. The 31-year-old soon brought up his seventh one-day hundred in bright style too – smashing two successive sixes off pacer De Leede over the mid-wicket region, and all he took was just 62 balls. With that hundred, Rahul overcame Rohit's World Cup record of 63-ball ton which the latter set during the match against Afghanistan. However, the marauding start at the top given by Rohit and Gill once India batted by choice was just as important. Gill did the early running for India on a Chinnaswamy pitch that offered a hint of bounce, producing his almost nil-follow through pulls and other range of shots predominantly on the leg-side. After a slightly sedate start, Rohit also slipped into overdrive to punish the Netherlands bowlers. But the ambition to accelerate led to the downfall of both of them, giving catches to the deep. But Kohli and Iyer added 71 runs off 66 balls to keep India chugging. Just as Kohli looked primed for that much-anticipated 50th ODI hundred, Van der Merwe castled him with a skidder that rushed under his downcoming bat. However, later Kohli had a sugary moment when he got the wicket of Dutch captain Scott Edwards, caught down the leg by Rahul behind the stumps, sending the spectators into a delirium. Even Gill and Suryakumar Yadav also turned their arms for a couple of overs giving the proceedings a fin-de-siecle touch as the hosts used nine bowlers. The Netherlands' chase had nothing to write home about, apart from a brisk fifty by Teja Nidamanuru (54 off 39 balls) as they unravelled gradually. #Cricket #Diwali #KL Rahul","pubDate":"2023-11-12 16:41:59","image_url":"https://englishtribuneimages.blob.core.windows.net/gallary-content/2023/11/2023_11$largeimg_968216865.JPG","source_id":"tribuneindia","source_priority":7916,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"af5fc82aab23ca6c880f29e5845b79cc","title":"India thrash Netherlands to extend World Cup winning streak","link":"https://www.skysports.com/cricket/news/20876/13006550/cricket-world-cup-india-thrash-netherlands-by-160-runs-to-complete-100-per-cent-group-record","keywords":null,"creator":null,"video_url":null,"description":"India completed a flawless World Cup group stage by hammering the Netherlands by 160 runs in Bengaluru.","content":"India completed a flawless World Cup group stage by hammering the Netherlands by 160 runs in Bengaluru. The hosts made it nine wins out of nine games after posting a huge 50-over total of 410-4, just three runs shy of their World Cup best against Bermuda in 2007. Shreyas Iyer top-scored with an unbeaten 128 from 94 balls and KL Rahul completed his century in the final over before being dismissed for 102. Rahul reached his hundred in 62 balls - the fastest by an Indian batter at a World Cup - and his fourth-wicket partnership of 208 with Iyer took the game away from the Dutch. Rohit Sharma (61), Shubman Gill (51) and Virat Kohli (51) also went past fifty as India claimed another World Cup record. It was the first time the top five of any team have all got half-centuries in the same innings in the competition - and only the third time in the history of ODI cricket. Kohli appeared well set to break the record of 49 ODI hundreds that he shares with countryman Sachin Tendulkar, only to miss a straight delivery from spinner Roelof van der Merwe and having to content himself with overtaking South Africa's Quinton de Kock as the tournament's leading run-scorer. India were always in control on a flat wicket and the Netherlands were eventually dismissed for 250 from 47.5 overs. Teja Nidamanuru (54) and Sybrand Engelbrecht (45) offered resistance as Mohammed Siraj, Jasprit Bumrah, Kuldeep Yadav and Ravindra Jadeja took two wickets apiece, while Kohli claimed his ODI wicket since 2014. Scorecard: India vs Netherlands Cricket World Cup: Latest headlines Latest CWC fixtures and results Final men's Cricket World Cup table Please use Chrome browser for a more accessible video player India captain Rohit Sharma: \"Since we started the tournament it was always about taking one game at a time and playing that game well. 11 games in all if you go all the way, that's a lot of games. It's important for us to break it down and focus on one game and play it well. \"That's what everyone did. You play in different conditions, you've got to adapt and that's what we did. We're very pleased with how we played in these nine games. We've been very clinical from game one until today. That's because different individuals have stepped up at different points.\" Please use Chrome browser for a more accessible video player Netherlands captain Scott Edwards: \"India showed pure class with the bat. I thought we bowled well in periods. They soaked up the pressure. They're going to be a hard side to beat in the rest of the tournament. As for ourselves, we're a young side still and it's about growth for us.\" The semi-final line-up is now confirmed, with India playing fourth-placed New Zealand in Mumbai on Wednesday before Australia take on South Africa in Kolkata a day later. Build-up of those matches begins on Sky Sports Cricket from 8am on those days, with matches starting at 8.30am. Watch every match from the Cricket World Cup live Sky Sports, including the final in Ahmedabad on Sunday November 19. Stream the tournament without a contract through NOW.","pubDate":"2023-11-12 16:41:00","image_url":"https://e2.365dm.com/23/11/1920x1080/skysports-virat-kohli-india_6357668.jpg?20231112160359","source_id":"skysports","source_priority":831,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"f5eacdf40a7ad3ee766969cd21f0b533","title":"IND vs NED HIGHLIGHTS, World Cup 2023: India Beat Netherlands To Taste Record Ninth Win In A Row","link":"https://news.abplive.com/sports/cricket/ind-vs-ned-highlights-world-cup-2023-india-beat-netherlands-to-taste-record-ninth-win-in-row-1642340","keywords":["Cricket"],"creator":["ABP News Bureau"],"video_url":null,"description":"India beat Netherlands by 160 runs to set a new record for themselves for the most successive wins in a single edition of a World Cup. In what was the final round-robin match of World Cup 2023, the hosts won the toss and elected to bat first before posting 410/4. Each of the first five-batters scored a fifty plus score- Rohit Sharma, Shubman Gill, Virat Kohli, Shreyas Iyer and KL Rahul- with the last two of them- Shreyas and Rahul going on to convert them into hundreds. In response, the Dutch were bundled out for 250 with Jasprit Bumrah, Mohammed Siraj, Kuldeep Yadav and Ravindra Jadeja all taking two wickets apiece. As India used nine bowlers, Virat Kohli and Rohit Sharma also scalped a wicket each with Suyrakumar Yadav and Shubman Gill also rolling their arms over. Teja Nidamanuru top-scored for the Men in Orange with 54 off 39. \"It's a little bit of a tricky one at the moment where we want to be. We are pretty confident with the style we play. The tournament was always going to be tough. They [India] are as good a side going around. We will have to be a lot better going into theT20 World Cup next year. They showed pure class with the bat. Playing to learn with that. They soaked up the pressure. When you are three down with ten overs left, you are going to score some runs. We are a very young side. Lots of young sides in the setup. We have some training camps coming. Fixtures wide, I am not sure about that,\" Netherlands captain Scott Edwards said at the post-match presentation. \"Since we started the tournament, it was all about one game at a time. We never wanted to look too far ahead. It is a long tournament, 11 games in all if we go all the way. It was important to break it down and focus on it,\" Indian skipper Rohit said.India will now lock horns against New Zealand in the first semifinal at the Wankhede Stadium in Mumbai on November 15 (Wednesday).","content":"googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); India beat Netherlands by 160 runs to set a new record for themselves for the most successive wins in a single edition of a World Cup. In what was the final round-robin match of World Cup 2023 , the hosts won the toss and elected to bat first before posting 410/4. Each of the first five-batters scored a fifty plus score- Rohit Sharma, Shubman Gill, Virat Kohli, Shreyas Iyer and KL Rahul- with the last two of them- Shreyas and Rahul going on to convert them into hundreds. In response, the Dutch were bundled out for 250 with Jasprit Bumrah, Mohammed Siraj, Kuldeep Yadav and Ravindra Jadeja all taking two wickets apiece. As India used nine bowlers, Virat Kohli and Rohit Sharma also scalped a wicket each with Suyrakumar Yadav and Shubman Gill also rolling their arms over. Teja Nidamanuru top-scored for the Men in Orange with 54 off 39. \"It's a little bit of a tricky one at the moment where we want to be. We are pretty confident with the style we play. The tournament was always going to be tough. They [India] are as good a side going around. We will have to be a lot better going into the T20 World Cup next year. They showed pure class with the bat. Playing to learn with that. They soaked up the pressure. When you are three down with ten overs left, you are going to score some runs. We are a very young side. Lots of young sides in the setup. We have some training camps coming. Fixtures wide, I am not sure about that,\" Netherlands captain Scott Edwards said at the post-match presentation. \"Since we started the tournament, it was all about one game at a time. We never wanted to look too far ahead. It is a long tournament, 11 games in all if we go all the way. It was important to break it down and focus on it,\" Indian skipper Rohit said. India will now lock horns against New Zealand in the first semifinal at the Wankhede Stadium in Mumbai on November 15 (Wednesday).","pubDate":"2023-11-12 16:28:52","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/11/12/11253d619b8c18d6342c81e797288bd41699806472503625_original.jpg","source_id":"abplive","source_priority":10959,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"34d726160f9d6d00ec3a7dfbbb72f779","title":"Sri Lanka cricket skipper pleads for ICC suspension to end","link":"https://a-sports.tv/sri-lanka-cricket-skipper-pleads-for-icc-suspension-to-end/","keywords":["Cricket","Sports","Top News","Top Picks","ICC","Kusal Mendis","Sri Lanka"],"creator":["AFP"],"video_url":null,"description":"Sri Lanka skipper Kusal Mendis appealed Sunday for the governing International Cricket Council (ICC) to lift its suspension of the country over alleged political interference in the local board. “This is our profession and we can’t be staying at home doing nothing,” Mendis told reporters in the capital Colombo. “We want to start practising as […] The post Sri Lanka cricket skipper pleads for ICC suspension to end appeared first on ASports.tv.","content":"Sri Lanka skipper Kusal Mendis appealed Sunday for the governing International Cricket Council (ICC) to lift its suspension of the country over alleged political interference in the local board. “This is our profession and we can’t be staying at home doing nothing,” Mendis told reporters in the capital Colombo. “We want to start practising as there are a few tours to happen next year.” The ICC said on Friday that Sri Lanka Cricket was “in serious breach” of its obligations as a member, highlighting “the requirement to manage its affairs autonomously and to ensure that there is no government interference”. The suspension came a day after Sri Lanka’s parliament asked the board to resign over allegations by sports minister Roshan Ranasinghe that it had syphoned off millions of dollars. “As players we had no control over that,” Kusal Mendis said. “As the captain I only hope for its (the ban’s) removal so that we can resume our game.” It was not immediately clear if the indefinite suspension would affect Sri Lanka hosting the Under-19 World Cup in January. The crisis involving the cricket board — the richest sporting organisation in the bankrupt island country — came to a head after Sri Lanka’s humiliating World Cup defeat by India earlier this month. Team manager Mahinda Halangoda said Sri Lanka’s players had been told to try and carry on as normal. “The team management had a discussion with the players and asked them to focus on cricket,” he said. READ: India ease past Netherlands to stay unbeaten in World Cup","pubDate":"2023-11-12 16:25:48","image_url":null,"source_id":"arynews","source_priority":41852,"country":["pakistan"],"category":["sports"],"language":"english"},{"article_id":"9b02fe62dbe2f0844448e51a4a648a6b","title":"On ‘Cloud Nine’: Shreyas, Rahul fireworks power India to 160-run win over Netherlands","link":"https://www.orissapost.com/on-cloud-nine-shreyas-rahul-fireworks-power-india-to-160-run-win-over-netherlands/","keywords":["Sports","cricket","ICC","India","netherlands","world cup"],"creator":["Post News Network"],"video_url":null,"description":"Bengaluru: KL Rahul’s pillaging hundred, the fastest by an Indian in World Cup, and Shreyas Iyer’s doubts-allaying 128 lit up the Diwali day as India mowed down Netherlands by 160 runs here Sunday, registering their ninth consecutive victory in the showpiece. It helped India finish their league engagements with 18 points, and now they will […]","content":"On ‘Cloud Nine’: Shreyas, Rahul fireworks power India to 160-run win over Netherlands PTI Updated: November 12th, 2023, 21:53 IST in Sports 0 Pic- IANS Share on Facebook Share on Twitter Share on WhatsApp Share on Linkedin Bengaluru: KL Rahul’s pillaging hundred, the fastest by an Indian in World Cup, and Shreyas Iyer’s doubts-allaying 128 lit up the Diwali day as India mowed down Netherlands by 160 runs here Sunday, registering their ninth consecutive victory in the showpiece. It helped India finish their league engagements with 18 points, and now they will move to Mumbai for the high-stakes semi-final clash against New Zealand Wednesday. Also Read Jos Buttler to lead England in white-ball Caribbean tour in December 10 hours ago Men’s ODI WC: Coach Arthur blames inconsistency for Pakistan’s sub-par show; wants Babar to stay as captain 10 hours ago Rahul’s blitz and Iyer’s posh unbeaten 94-ball hundred combined well with fifties by Shubman Gill (51), Rohit Sharma (61) and Virat Kohli (51), powering India to a mammoth 410 for 4, their second-highest World Cup total. Thus, India became the third team in this tournament to post 400 after South Africa and New Zealand. The Indian bowlers did not have to sweat much to skittle the Dutch for 250 as even Kohli and Rohit, who took the final scalp, found themselves among the wicket-takers. The Indian innings was dotted by two big stands that brilliantly exhibited aggressive batsmanship, so diligently followed by the hosts throughout this event. Rohit and Gill started the carnage with a forceful 100-run alliance off just 71 balls for the opening wicket. Rahul and Iyer exponentiated that collecting 208 runs for the fourth wicket in little over 21 overs, and 122 runs cascaded in the final 10 overs alone. The tons by Iyer and Rahul will delight the Indian management no end ahead of the knockouts in terms of middle-order batters’ productivity. However, Iyer’s knock will please the thinktank by that bit more. There has been chatter around the right-hander’s susceptibility against short-pitched balls and he cleared it by some degree here. The Netherland pacers did try that strategy against Iyer but the Mumbaikar was right up to the task, playing the pulls with comfort. He made 82 runs on the on-side during his innings and 35 runs came off pulls or horizontal-batted shots. It might have filled him also with some level of confidence ahead of the crunch match against the Kiwis. But his innings was not just about clearing the doubts as he scientifically broke down the Dutch bowling unit. In fact, Iyer’ was the kind of ODI innings that one can include in coaching archives as a model for budding cricketers. The biggest highlight of Iyer’s batting is his ability to avoid risks – the awareness of bowlers and areas to target to keep the run-flow steady. It was on full view at the Chinnaswamy stadium. Usually a fine player of spin, Iyer does have a weakness against the slow left-armers, evidenced by a reduced strike-rate of 90 against that type as compared to other exponents of slow bowling. In line with that, he played out Roelof van der Merwe for singles and twos while targeting offie Aryan Dutt and pacers Paul van Meekeren and Logan van Beek. Van Meekeren felt the heat in particular as Iyer lofted him for two 80m sixes over long-on and cover as the Dutch pacer gave too much width to free his hands. They were not manufactured shots but the balls were begging to be hit, and Iyer just obliged. Soon, he notched up his hundred with a single to mid-off off pacer Bas de Leede, and it took him just 84 balls. Rahul, in fact, started quite steadily, and focused more on giving strike to the in-touch Iyer. The first 30 balls he faced produced 26 runs, but once he decided to carve a place for himself in the partnership the next 33 balls saw Rahul pummelling 76 runs. The Bengaluru man unbundled some of those shots that make his batting a captivating view. Iyer preferred the on-side more to get his runs, but Rahul’s shot-making touched all parts of the ground. While he made 58 runs on the leg-side, 44 runs came through the off. It is tough to bowl to Rahul when is on the button and the Netherlands bowlers, in particular Meekeren and De Leede, felt the heat. The signature swat-flick six off Van Meekeren over mid-wicket drew wows from the holiday crowd, while a slice-cut off Van Beek over deep backward point was all about instant innovation. The 31-year-old soon brought up his seventh one-day hundred in bright style too – smashing two successive sixes off pacer De Leede over the mid-wicket region, and all he took was just 62 balls. With that hundred, Rahul overcame Rohit’s World Cup record of 63-ball ton which the latter set during the match against Afghanistan. However, the marauding start at the top given by Rohit and Gill once India batted by choice was just as important. Gill did the early running for India on a Chinnaswamy pitch that offered a hint of bounce, producing his almost nil-follow-through pulls and other range of shots predominantly on the leg-side. After a slightly sedate start, Rohit also slipped into overdrive to punish the Netherlands bowlers. But the ambition to accelerate led to the downfall of both of them, giving catches to the deep. But Kohli and Iyer added 71 runs off 66 balls to keep India chugging. Just as Kohli looked primed for that much-anticipated 50th ODI hundred, Van der Merwe castled him with a skidder that rushed under his downcoming bat. However, later Kohli had a sugary moment when he got the wicket of Dutch captain Scott Edwards, caught down the leg by Rahul behind the stumps, sending the spectators into a delirium. Even Gill and Suryakumar Yadav also turned their arms for a couple of overs giving the proceedings a fin-de-siecle touch as the hosts used nine bowlers. The Netherlands’ chase had nothing to write home about, apart from a brisk fifty by Teja Nidamanuru (54 off 39 balls) as they unravelled gradually. PTI Tags: cricket ICC India netherlands world cup Share Tweet Send Share Suggest A Correction Enter your email to get our daily news in your inbox. Leave this field empty if you're human:","pubDate":"2023-11-12 16:23:58","image_url":"https://www.orissapost.com/wp-content/uploads/2023/11/On-Cloud-Nine_Shreyas-Rahul-fireworks-power-India-to-160-run-win-over-Netherlands-300x197.jpg","source_id":"orissapost","source_priority":252515,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"36210ea2842c6c9732f2578c65fbca73","title":"KL Rahul Breaks Rohit Sharma's Record With Quickfire Ton In IND vs NED World Cup Clash","link":"https://news.abplive.com/photo-gallery/sports/cricket-kl-rahul-breaks-rohit-sharma-record-with-quickfire-ton-in-ind-vs-ned-world-cup-clash-1642339","keywords":["Cricket"],"creator":["ABP News Bureau"],"video_url":null,"description":"KL Rahul Breaks Rohit Sharma's Record With Quickfire Ton In IND vs NED World Cup Clash","content":"KL Rahul scored a record-breaking hundred as India's posted 410/4 against Netherlands in their last league match against Netherlands in Bengaluru. (Image Source: Getty) Rahul scored the fastest World Cup hundred by an Indian. He got the landmark in 62 balls at his home ground- the M Chinnaswamy Stadium. (Image Source: Getty) He broke Rohit Sharma's record which the India captain had set earlier in the competition. (Image Source: Getty) Rahul eventually got out for 102 off 62. (Image Source: Getty) Rahul and fellow centurion Shreyas Iyer stitched a 204-run stand and laid the foundation for India's 160-run win. (Image Source: Getty) Not A Fight We Want But Will Unequivocally Stand Up For Rule Of Law: Trudeau On India-Canada Diplomatic Row","pubDate":"2023-11-12 16:07:34","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/11/12/9802a4fc83c7cb8e4c1237e39326966a1699805226356625_original.jpg","source_id":"abplive","source_priority":10959,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"aae3643f61f9cfee70b9bd06df2414c1","title":"Virat Kohli takes first ODI wicket after nine years","link":"https://a-sports.tv/virat-kohli-takes-first-odi-wicket-after-nine-years/","keywords":["Cricket","Sports","Top News","Top Picks","ICC World Cup 2023","india","Netherlands","Virat Kohli"],"creator":["A Sports"],"video_url":null,"description":"BENGALURU: Star Indian batter Virat Kohli stunned the cricketing world as he picked up an ODI after nine years during his side’s ICC World Cup 2023 clash against the Netherlands. While the bottom-ranked side were batting cautiously in their 411-run pursuit, Indian captain Rohit Sharma handed the ball to Virat Kohli. The right-arm medium pace […] The post Virat Kohli takes first ODI wicket after nine years appeared first on ASports.tv.","content":"BENGALURU: Star Indian batter Virat Kohli stunned the cricketing world as he picked up an ODI after nine years during his side’s ICC World Cup 2023 clash against the Netherlands. While the bottom-ranked side were batting cautiously in their 411-run pursuit, Indian captain Rohit Sharma handed the ball to Virat Kohli. The right-arm medium pace bowler struck in his second over when a delivery drifting down the leg side, marked the end of Dutch skipper Scott Edwards’ knock. It was Virat Kohli’s fifth wicket in ODIs and his first since 2014 when he dismissed New Zealand captain Brendon McCullum in Wellington. His last wicket in international cricket, however, came back in 2016 when he dismissed the West Indian opener Johnson Charles in a high-octane T20 World Cup semi-final. Virat Kohli had a brief stint with the ball earlier in this World Cup when all-rounder Hardik Pandya limped off the field midway through an over against Bangladesh. In his usual role for India, Virat Kohli contributed significantly with an anchoring half-century. The right-handed batter scored 51 in 56 deliveries with the help of five boundaries and a six. He was one of the five Indian batters, who scored fifty-plus runs against the struggling Dutch bowling attack. Indian openers Rohit Sharma and top-ranked ODI batter Shubman Gill gave India a flying start with a sensational 100-run partnership. Gill was the first batter to be perished. He departed after scoring a 32-ball 51, laced with three boundaries and four sixes. Sharma soon followed him after a 54-ball 61 which included eight boundaries and two sixes. Virat Kohli then anchored the proceedings for India amid his 71-run partnership with Shreyas Iyer before the former perished soon after reaching his half-century. Iyer was then joined by KL Rahul and the duo bolstered India’s total past the 400-run mark with brisk centuries. Shreyas Iyer top-scored for India with an unbeaten 128 in 94 deliveries with the help of 10 boundaries and five sixes. Rahul, on the other hand, scored 102 in 64 deliveries, peppered with 11 boundaries and four sixes. READ: England announce white-ball squads for the Caribbean tour","pubDate":"2023-11-12 15:54:16","image_url":null,"source_id":"arynews","source_priority":41852,"country":["pakistan"],"category":["sports"],"language":"english"},{"article_id":"acdb683e1b3118096ef509909f182dae","title":"How much money will Pakistan receive from ICC despite early exit from World Cup 2023?","link":"https://en.dailypakistan.com.pk/12-Nov-2023/how-much-money-will-pakistan-receive-from-icc-despite-early-exit-from-world-cup-2023","keywords":["Sports"],"creator":["Web Desk"],"video_url":null,"description":"LAHORE – The Pakistan cricket team is set to receive a substantial financial reward despite elimination from the ICC World Cup 2023 at the league stage.","content":"LAHORE – The Pakistan cricket team is set to receive a substantial financial reward despite elimination from the ICC World Cup 2023 at the league stage. The Green Shirts will receive $260,000 from the allocated prize money for the ICC World Cup. For their achievements, winning four matches and progressing to the group stage, Pakistan will be awarded a sum exceeding Rs73 million. Pakistan failed to finish in the top four of the ongoing World Cup. The Men in Green lost five of their league games, the first time ever at a single World Cup edition, which included an array of four straight losses, to finish fifth in the points table. The triumph in four matches helped them to fetch Pakistan $160,000. The International Cricket Council (ICC) has reserved a prize of $40,000 for each victorious match. In recognition of playing in the group stage, the Pakistan team will be granted $100,000. Meanwhile, teams losing semi-finals will be compensated with $800,000. The runner-up in the ICC World Cup is in line to receive $2 million, while the victorious team will pocket $4 million. The ICC has designated the total prize money for the World Cup at $10 million. Remember, the four semi-finalists have been confirmed for the knockout stage of the ICC Men's Cricket World Cup 2023. Semi-final 1: India vs New Zealand, Wednesday 15th November, Wankhede Stadium, Mumbai Semi-final 2: South Africa vs Australia, Thursday 16th November, Eden Gardens, Kolkata Final: India / New Zealand vs South Africa / Australia, Sunday 19th November, Narendra Modi Stadium, Ahmedabad","pubDate":"2023-11-12 18:22:39","image_url":"https://en.dailypakistan.com.pk/digital_images/large/2023-11-12/how-much-money-will-pakistan-receive-from-icc-despite-early-exit-from-world-cup-2023-1699813213-5977.png","source_id":"dailypakistanen","source_priority":97265,"country":["pakistan"],"category":["sports"],"language":"english"},{"article_id":"8363215bba0d6add15cfa36dd2ce0c53","title":"Has ICC invited Imran Khan to World Cup final ceremony?","link":"https://en.dailypakistan.com.pk/12-Nov-2023/has-icc-invited-imran-khan-to-world-cup-final-ceremony","keywords":["ODI World Cup Updates, Sports, Viral"],"creator":["Web Desk"],"video_url":null,"description":"The International Cricket Council (ICC) has reportedly invited all the winning captains to the World Cup 2023 final match ceremony slated to be held on November 19, 2023.","content":"The International Cricket Council (ICC) has reportedly invited all the winning captains to the World Cup 2023 final match ceremony slated to be held on November 19, 2023. As the World Cup action continues for over a month now, the leading ICC event is set to culminate with an extravagant ceremony. All the winning captains will gather at the Narendra Modi Stadium on the invitation of the top cricket body. Among all the World Cup winning captains, former cricket star turned politician Imran Khan remains a leading figure as he holds a massive fan following due to his charisma and populist style of politics. Khan remains the only player who lifted the World Cup trophy for Pakistan, and it was three decades back when he led a team that bagged the World Cup in Melbourne. Unverified reports say that ICC has invited Imran Khan and other players to the Winning Captains Ceremony, but it raised many questions as the former prime minister remains behind the bars for 100 days. The PTI chief’s visit to the neighboring country for the event is something that fans can assume but in reality it seems impossible as the former cricketer is facing over 150 cases related to terrorism, blasphemy and revealing national secrets. Amid the ongoing legal proceedings, the former skipper is highly unlikely to travel to India for the World Cup ceremony.","pubDate":"2023-11-12 17:13:08","image_url":"https://en.dailypakistan.com.pk/digital_images/large/2023-11-12/has-icc-invited-imran-khan-along-with-other-winning-captains-for-world-cup-ceremony-1699797028-6891.jpg","source_id":"dailypakistanen","source_priority":97265,"country":["pakistan"],"category":["sports"],"language":"english"},{"article_id":"ddb084942bbe5163199c7f07836c9c1e","title":"World Cup: Iyer, Rahul fireworks lead rout of Netherlands as India make it 9-in-a-row","link":"https://timesofindia.indiatimes.com/sports/cricket/icc-world-cup/news/world-cup-shreyas-iyer-kl-rahul-fireworks-lead-rout-of-netherlands-as-india-make-it-9-in-a-row/articleshow/105170606.cms","keywords":null,"creator":null,"video_url":null,"description":"Centuries from Shreyas Iyer and KL Rahul powered India to a 160-run World Cup win over the Netherlands as they completed the group stage with a perfect 9 wins in 9 games. Iyer (128*) and Rahul (102) put on 208 runs to guide India to 410 for 4. India then employed 9 bowlers, including part-timers Virat Kohli and Rohit Sharma, to dismiss the Dutch for 250. The victory over Dutch meant India surpassed their previous record of 8 straight wins registered in the 2003 edition.","content":"World Cup 2023| 49 cut-outs of Virat Kohli in Bengaluru as India lock horns with Netherlands World Cup: It's India vs NZ, SA vs AUS in semis Team India celebrates Diwali in Bengaluru England send Pakistan crashing out of World Cup Marsh's ton ensures Australia cruise past Bangladesh World Cup: South Africa scrape past spirited Afghanistan NZ edge closer to semifinal with clinical win over Sri Lanka Maxwell's stunning 201* guides Australia to WC semi-finals Bangladesh beat Sri Lanka after Mathews 'timed out' row Virat Kohli's four centuries at ODI World Cup Virat Kohli leads India stat attack against South Africa","pubDate":"2023-11-12 16:42:35","image_url":null,"source_id":"toi","source_priority":391,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"57f4a870c697e41bf066fea6e43c77cc","title":"On 'Cloud Nine': Shreyas, Rahul fireworks power India to 160-run win over Netherlands","link":"https://www.tribuneindia.com/news/world-cup-2023/on-cloud-nine-shreyas-rahul-fireworks-power-india-to-160-run-win-over-netherlands-561950","keywords":null,"creator":null,"video_url":null,"description":"Bengaluru, November 12KL Rahul's pillaging hundred, the fastest by an Indian in World Cup, and Shreyas Iyer's doubts-allaying 128 lit up the Diwali day as India mowed down Netherlands by 160 runs here on Sunday, registering their ninth consecutive victory in the showpiece.It helped India finish their league engagements with 18 points, and now they will move to Mumbai for the high-stakes semi-final clash against New Zealand on Wednesday.Rahul's blitz and Iyer's posh unbeaten 94-ball hundred combined well with fifties by Shubman Gill (51), Rohit Sharma (61) and Virat Kohli (51), powering India to a mammoth 410 for 4, their second highest World Cup total.Thus, India became the third team in this tournament to post 400 after South Africa and New Zealand. The Indian bowlers did not have to sweat much to skittle the Dutch for 250 as even Kohli and Rohit, who took the final scalp, found themselves among the wicket-takers.The Indian innings was dotted by two big stands that brilliantly exhibited aggressive batsmanship, so diligently followed by the hosts throughout this event.Rohit and Gill started the carnage with a forceful 100-run alliance off just 71 balls for the opening wicket. Rahul and Iyer exponentiated that collecting 208 runs for the fourth wicket in little over 21 overs, and 122 runs cascaded in the final 10 overs alone.The tons by Iyer and Rahul will delight the Indian management no end ahead of the knockouts in terms of middle-order batters' productivity.However, Iyer's knock will please the thinktank by that bit more. There has been chatter around the right-hander's susceptibility against short-pitched balls and he cleared it by some degree here.The Netherland pacers did try that strategy against Iyer but the Mumbaikar was right up to the task, playing the pulls with comfort.He made 82 runs on the on-side during his innings and 35 runs came off pulls or horizontal-batted shots. It might have filled him also with some level of confidence ahead of the crunch match against the Kiwis.But his innings was not just about clearing the doubts as he scientifically broke down the Dutch bowling unit. In fact, Iyer' was the kind of ODI innings that one can include in coaching archives as a model for budding cricketers.The biggest highlight of Iyer's batting is his ability to avoid risks ndash; the awareness of bowlers and areas to target to keep the run-flow steady. It was on full view at the Chinnaswamy stadium.Usually a fine player of spin, Iyer does have a weakness against the slow left-armers, evidenced by a reduced strike-rate of 90 against that type as compared to other exponents of slow bowling.In line with that, he played out Roelof van der Merwe for singles and twos while targeting offie Aryan Dutt and pacers Paul van Meekeren and Logan van Beek.Van Meekeren felt the heat in particular as Iyer lofted him for two 80m sixes over long-on and cover as the Dutch pacer gave too much width to free his hands.They were not manufactured shots but the balls were begging to be hit, and Iyer just obliged.Soon, he notched up his hundred with a single to mid-off off pacer Bas de Leede, and it took him just 84 balls.Rahul, in fact, started quite steadily, and focused more on giving strike to the in-touch Iyer.The first 30 balls he faced produced 26 runs, but once he decided to carve a place for himself in the partnership the next 33 balls saw Rahul pummelling 76 runs.The Bengaluru man unbundled some of those shots that make his batting a captivating view. Iyer preferred the on-side more to get his runs, but Rahul's shot-making touched all parts of the ground.While he made 58 runs on the leg-side, 44 runs came through the off. It is tough to bowl to Rahul when is on the button and the Netherlands bowlers, in particular Meekeren and De Leede, felt the heat.The signature swat-flick six off Van Meekeren over mid-wicket drew wows from the holiday crowd, while a slice-cut off Van Beek over deep backward point was all about instant innovation.The 31-year-old soon brought up his seventh one-day hundred in bright style too ndash; smashing two successive sixes off pacer De Leede over the mid-wicket region, and all he took was just 62 balls.With that hundred, Rahul overcame Rohit's World Cup record of 63-ball ton which the latter set during the match against Afghanistan.However, the marauding start at the top given by Rohit and Gill once India batted by choice was just as important.Gill did the early running for India on a Chinnaswamy pitch that offered a hint of bounce, producing his almost nil-follow through pulls and other range of shots predominantly on the leg-side.After a slightly sedate start, Rohit also slipped into overdrive to punish the Netherlands bowlers.But the ambition to accelerate led to the downfall of both of them, giving catches to the deep. But Kohli and Iyer added 71 runs off 66 balls to keep India chugging.Just as Kohli looked primed for that much-anticipated 50th ODI hundred, Van der Merwe castled him with a skidder that rushed under his downcoming bat.However, later Kohli had a sugary moment when he got the wicket of Dutch captain Scott Edwards, caught down the leg by Rahul behind the stumps, sending the spectators into a delirium.Even Gill and Suryakumar Yadav also turned their arms for a couple of overs giving the proceedings a fin-de-siecle touch as the hosts used nine bowlers.The Netherlands' chase had nothing to write home about, apart from a brisk fifty by Teja Nidamanuru (54 off 39 balls) as they unravelled gradually.","content":"PTI Bengaluru, November 12 KL Rahul's pillaging hundred, the fastest by an Indian in World Cup, and Shreyas Iyer's doubts-allaying 128 lit up the Diwali day as India mowed down Netherlands by 160 runs here on Sunday, registering their ninth consecutive victory in the showpiece. It helped India finish their league engagements with 18 points, and now they will move to Mumbai for the high-stakes semi-final clash against New Zealand on Wednesday. Rahul's blitz and Iyer's posh unbeaten 94-ball hundred combined well with fifties by Shubman Gill (51), Rohit Sharma (61) and Virat Kohli (51), powering India to a mammoth 410 for 4, their second highest World Cup total. Thus, India became the third team in this tournament to post 400 after South Africa and New Zealand. The Indian bowlers did not have to sweat much to skittle the Dutch for 250 as even Kohli and Rohit, who took the final scalp, found themselves among the wicket-takers. The Indian innings was dotted by two big stands that brilliantly exhibited aggressive batsmanship, so diligently followed by the hosts throughout this event. Rohit and Gill started the carnage with a forceful 100-run alliance off just 71 balls for the opening wicket. Rahul and Iyer exponentiated that collecting 208 runs for the fourth wicket in little over 21 overs, and 122 runs cascaded in the final 10 overs alone. The tons by Iyer and Rahul will delight the Indian management no end ahead of the knockouts in terms of middle-order batters' productivity. However, Iyer's knock will please the thinktank by that bit more. There has been chatter around the right-hander's susceptibility against short-pitched balls and he cleared it by some degree here. The Netherland pacers did try that strategy against Iyer but the Mumbaikar was right up to the task, playing the pulls with comfort. He made 82 runs on the on-side during his innings and 35 runs came off pulls or horizontal-batted shots. It might have filled him also with some level of confidence ahead of the crunch match against the Kiwis. But his innings was not just about clearing the doubts as he scientifically broke down the Dutch bowling unit. In fact, Iyer' was the kind of ODI innings that one can include in coaching archives as a model for budding cricketers. The biggest highlight of Iyer's batting is his ability to avoid risks – the awareness of bowlers and areas to target to keep the run-flow steady. It was on full view at the Chinnaswamy stadium. Usually a fine player of spin, Iyer does have a weakness against the slow left-armers, evidenced by a reduced strike-rate of 90 against that type as compared to other exponents of slow bowling. In line with that, he played out Roelof van der Merwe for singles and twos while targeting offie Aryan Dutt and pacers Paul van Meekeren and Logan van Beek. Van Meekeren felt the heat in particular as Iyer lofted him for two 80m sixes over long-on and cover as the Dutch pacer gave too much width to free his hands. They were not manufactured shots but the balls were begging to be hit, and Iyer just obliged. Soon, he notched up his hundred with a single to mid-off off pacer Bas de Leede, and it took him just 84 balls. Rahul, in fact, started quite steadily, and focused more on giving strike to the in-touch Iyer. The first 30 balls he faced produced 26 runs, but once he decided to carve a place for himself in the partnership the next 33 balls saw Rahul pummelling 76 runs. The Bengaluru man unbundled some of those shots that make his batting a captivating view. Iyer preferred the on-side more to get his runs, but Rahul's shot-making touched all parts of the ground. While he made 58 runs on the leg-side, 44 runs came through the off. It is tough to bowl to Rahul when is on the button and the Netherlands bowlers, in particular Meekeren and De Leede, felt the heat. The signature swat-flick six off Van Meekeren over mid-wicket drew wows from the holiday crowd, while a slice-cut off Van Beek over deep backward point was all about instant innovation. The 31-year-old soon brought up his seventh one-day hundred in bright style too – smashing two successive sixes off pacer De Leede over the mid-wicket region, and all he took was just 62 balls. With that hundred, Rahul overcame Rohit's World Cup record of 63-ball ton which the latter set during the match against Afghanistan. However, the marauding start at the top given by Rohit and Gill once India batted by choice was just as important. Gill did the early running for India on a Chinnaswamy pitch that offered a hint of bounce, producing his almost nil-follow through pulls and other range of shots predominantly on the leg-side. After a slightly sedate start, Rohit also slipped into overdrive to punish the Netherlands bowlers. But the ambition to accelerate led to the downfall of both of them, giving catches to the deep. But Kohli and Iyer added 71 runs off 66 balls to keep India chugging. Just as Kohli looked primed for that much-anticipated 50th ODI hundred, Van der Merwe castled him with a skidder that rushed under his downcoming bat. However, later Kohli had a sugary moment when he got the wicket of Dutch captain Scott Edwards, caught down the leg by Rahul behind the stumps, sending the spectators into a delirium. Even Gill and Suryakumar Yadav also turned their arms for a couple of overs giving the proceedings a fin-de-siecle touch as the hosts used nine bowlers. The Netherlands' chase had nothing to write home about, apart from a brisk fifty by Teja Nidamanuru (54 off 39 balls) as they unravelled gradually. #Cricket #Diwali #KL Rahul","pubDate":"2023-11-12 16:41:59","image_url":"https://englishtribuneimages.blob.core.windows.net/gallary-content/2023/11/2023_11$largeimg_968216865.JPG","source_id":"tribuneindia","source_priority":7916,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"af5fc82aab23ca6c880f29e5845b79cc","title":"India thrash Netherlands to extend World Cup winning streak","link":"https://www.skysports.com/cricket/news/20876/13006550/cricket-world-cup-india-thrash-netherlands-by-160-runs-to-complete-100-per-cent-group-record","keywords":null,"creator":null,"video_url":null,"description":"India completed a flawless World Cup group stage by hammering the Netherlands by 160 runs in Bengaluru.","content":"India completed a flawless World Cup group stage by hammering the Netherlands by 160 runs in Bengaluru. The hosts made it nine wins out of nine games after posting a huge 50-over total of 410-4, just three runs shy of their World Cup best against Bermuda in 2007. Shreyas Iyer top-scored with an unbeaten 128 from 94 balls and KL Rahul completed his century in the final over before being dismissed for 102. Rahul reached his hundred in 62 balls - the fastest by an Indian batter at a World Cup - and his fourth-wicket partnership of 208 with Iyer took the game away from the Dutch. Rohit Sharma (61), Shubman Gill (51) and Virat Kohli (51) also went past fifty as India claimed another World Cup record. It was the first time the top five of any team have all got half-centuries in the same innings in the competition - and only the third time in the history of ODI cricket. Kohli appeared well set to break the record of 49 ODI hundreds that he shares with countryman Sachin Tendulkar, only to miss a straight delivery from spinner Roelof van der Merwe and having to content himself with overtaking South Africa's Quinton de Kock as the tournament's leading run-scorer. India were always in control on a flat wicket and the Netherlands were eventually dismissed for 250 from 47.5 overs. Teja Nidamanuru (54) and Sybrand Engelbrecht (45) offered resistance as Mohammed Siraj, Jasprit Bumrah, Kuldeep Yadav and Ravindra Jadeja took two wickets apiece, while Kohli claimed his ODI wicket since 2014. Scorecard: India vs Netherlands Cricket World Cup: Latest headlines Latest CWC fixtures and results Final men's Cricket World Cup table Please use Chrome browser for a more accessible video player India captain Rohit Sharma: \"Since we started the tournament it was always about taking one game at a time and playing that game well. 11 games in all if you go all the way, that's a lot of games. It's important for us to break it down and focus on one game and play it well. \"That's what everyone did. You play in different conditions, you've got to adapt and that's what we did. We're very pleased with how we played in these nine games. We've been very clinical from game one until today. That's because different individuals have stepped up at different points.\" Please use Chrome browser for a more accessible video player Netherlands captain Scott Edwards: \"India showed pure class with the bat. I thought we bowled well in periods. They soaked up the pressure. They're going to be a hard side to beat in the rest of the tournament. As for ourselves, we're a young side still and it's about growth for us.\" The semi-final line-up is now confirmed, with India playing fourth-placed New Zealand in Mumbai on Wednesday before Australia take on South Africa in Kolkata a day later. Build-up of those matches begins on Sky Sports Cricket from 8am on those days, with matches starting at 8.30am. Watch every match from the Cricket World Cup live Sky Sports, including the final in Ahmedabad on Sunday November 19. Stream the tournament without a contract through NOW.","pubDate":"2023-11-12 16:41:00","image_url":"https://e2.365dm.com/23/11/1920x1080/skysports-virat-kohli-india_6357668.jpg?20231112160359","source_id":"skysports","source_priority":831,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"f5eacdf40a7ad3ee766969cd21f0b533","title":"IND vs NED HIGHLIGHTS, World Cup 2023: India Beat Netherlands To Taste Record Ninth Win In A Row","link":"https://news.abplive.com/sports/cricket/ind-vs-ned-highlights-world-cup-2023-india-beat-netherlands-to-taste-record-ninth-win-in-row-1642340","keywords":["Cricket"],"creator":["ABP News Bureau"],"video_url":null,"description":"India beat Netherlands by 160 runs to set a new record for themselves for the most successive wins in a single edition of a World Cup. In what was the final round-robin match of World Cup 2023, the hosts won the toss and elected to bat first before posting 410/4. Each of the first five-batters scored a fifty plus score- Rohit Sharma, Shubman Gill, Virat Kohli, Shreyas Iyer and KL Rahul- with the last two of them- Shreyas and Rahul going on to convert them into hundreds. In response, the Dutch were bundled out for 250 with Jasprit Bumrah, Mohammed Siraj, Kuldeep Yadav and Ravindra Jadeja all taking two wickets apiece. As India used nine bowlers, Virat Kohli and Rohit Sharma also scalped a wicket each with Suyrakumar Yadav and Shubman Gill also rolling their arms over. Teja Nidamanuru top-scored for the Men in Orange with 54 off 39. \"It's a little bit of a tricky one at the moment where we want to be. We are pretty confident with the style we play. The tournament was always going to be tough. They [India] are as good a side going around. We will have to be a lot better going into theT20 World Cup next year. They showed pure class with the bat. Playing to learn with that. They soaked up the pressure. When you are three down with ten overs left, you are going to score some runs. We are a very young side. Lots of young sides in the setup. We have some training camps coming. Fixtures wide, I am not sure about that,\" Netherlands captain Scott Edwards said at the post-match presentation. \"Since we started the tournament, it was all about one game at a time. We never wanted to look too far ahead. It is a long tournament, 11 games in all if we go all the way. It was important to break it down and focus on it,\" Indian skipper Rohit said.India will now lock horns against New Zealand in the first semifinal at the Wankhede Stadium in Mumbai on November 15 (Wednesday).","content":"googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); India beat Netherlands by 160 runs to set a new record for themselves for the most successive wins in a single edition of a World Cup. In what was the final round-robin match of World Cup 2023 , the hosts won the toss and elected to bat first before posting 410/4. Each of the first five-batters scored a fifty plus score- Rohit Sharma, Shubman Gill, Virat Kohli, Shreyas Iyer and KL Rahul- with the last two of them- Shreyas and Rahul going on to convert them into hundreds. In response, the Dutch were bundled out for 250 with Jasprit Bumrah, Mohammed Siraj, Kuldeep Yadav and Ravindra Jadeja all taking two wickets apiece. As India used nine bowlers, Virat Kohli and Rohit Sharma also scalped a wicket each with Suyrakumar Yadav and Shubman Gill also rolling their arms over. Teja Nidamanuru top-scored for the Men in Orange with 54 off 39. \"It's a little bit of a tricky one at the moment where we want to be. We are pretty confident with the style we play. The tournament was always going to be tough. They [India] are as good a side going around. We will have to be a lot better going into the T20 World Cup next year. They showed pure class with the bat. Playing to learn with that. They soaked up the pressure. When you are three down with ten overs left, you are going to score some runs. We are a very young side. Lots of young sides in the setup. We have some training camps coming. Fixtures wide, I am not sure about that,\" Netherlands captain Scott Edwards said at the post-match presentation. \"Since we started the tournament, it was all about one game at a time. We never wanted to look too far ahead. It is a long tournament, 11 games in all if we go all the way. It was important to break it down and focus on it,\" Indian skipper Rohit said. India will now lock horns against New Zealand in the first semifinal at the Wankhede Stadium in Mumbai on November 15 (Wednesday).","pubDate":"2023-11-12 16:28:52","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/11/12/11253d619b8c18d6342c81e797288bd41699806472503625_original.jpg","source_id":"abplive","source_priority":10959,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"34d726160f9d6d00ec3a7dfbbb72f779","title":"Sri Lanka cricket skipper pleads for ICC suspension to end","link":"https://a-sports.tv/sri-lanka-cricket-skipper-pleads-for-icc-suspension-to-end/","keywords":["Cricket","Sports","Top News","Top Picks","ICC","Kusal Mendis","Sri Lanka"],"creator":["AFP"],"video_url":null,"description":"Sri Lanka skipper Kusal Mendis appealed Sunday for the governing International Cricket Council (ICC) to lift its suspension of the country over alleged political interference in the local board. “This is our profession and we can’t be staying at home doing nothing,” Mendis told reporters in the capital Colombo. “We want to start practising as […] The post Sri Lanka cricket skipper pleads for ICC suspension to end appeared first on ASports.tv.","content":"Sri Lanka skipper Kusal Mendis appealed Sunday for the governing International Cricket Council (ICC) to lift its suspension of the country over alleged political interference in the local board. “This is our profession and we can’t be staying at home doing nothing,” Mendis told reporters in the capital Colombo. “We want to start practising as there are a few tours to happen next year.” The ICC said on Friday that Sri Lanka Cricket was “in serious breach” of its obligations as a member, highlighting “the requirement to manage its affairs autonomously and to ensure that there is no government interference”. The suspension came a day after Sri Lanka’s parliament asked the board to resign over allegations by sports minister Roshan Ranasinghe that it had syphoned off millions of dollars. “As players we had no control over that,” Kusal Mendis said. “As the captain I only hope for its (the ban’s) removal so that we can resume our game.” It was not immediately clear if the indefinite suspension would affect Sri Lanka hosting the Under-19 World Cup in January. The crisis involving the cricket board — the richest sporting organisation in the bankrupt island country — came to a head after Sri Lanka’s humiliating World Cup defeat by India earlier this month. Team manager Mahinda Halangoda said Sri Lanka’s players had been told to try and carry on as normal. “The team management had a discussion with the players and asked them to focus on cricket,” he said. READ: India ease past Netherlands to stay unbeaten in World Cup","pubDate":"2023-11-12 16:25:48","image_url":null,"source_id":"arynews","source_priority":41852,"country":["pakistan"],"category":["sports"],"language":"english"},{"article_id":"9b02fe62dbe2f0844448e51a4a648a6b","title":"On ‘Cloud Nine’: Shreyas, Rahul fireworks power India to 160-run win over Netherlands","link":"https://www.orissapost.com/on-cloud-nine-shreyas-rahul-fireworks-power-india-to-160-run-win-over-netherlands/","keywords":["Sports","cricket","ICC","India","netherlands","world cup"],"creator":["Post News Network"],"video_url":null,"description":"Bengaluru: KL Rahul’s pillaging hundred, the fastest by an Indian in World Cup, and Shreyas Iyer’s doubts-allaying 128 lit up the Diwali day as India mowed down Netherlands by 160 runs here Sunday, registering their ninth consecutive victory in the showpiece. It helped India finish their league engagements with 18 points, and now they will […]","content":"On ‘Cloud Nine’: Shreyas, Rahul fireworks power India to 160-run win over Netherlands PTI Updated: November 12th, 2023, 21:53 IST in Sports 0 Pic- IANS Share on Facebook Share on Twitter Share on WhatsApp Share on Linkedin Bengaluru: KL Rahul’s pillaging hundred, the fastest by an Indian in World Cup, and Shreyas Iyer’s doubts-allaying 128 lit up the Diwali day as India mowed down Netherlands by 160 runs here Sunday, registering their ninth consecutive victory in the showpiece. It helped India finish their league engagements with 18 points, and now they will move to Mumbai for the high-stakes semi-final clash against New Zealand Wednesday. Also Read Jos Buttler to lead England in white-ball Caribbean tour in December 10 hours ago Men’s ODI WC: Coach Arthur blames inconsistency for Pakistan’s sub-par show; wants Babar to stay as captain 10 hours ago Rahul’s blitz and Iyer’s posh unbeaten 94-ball hundred combined well with fifties by Shubman Gill (51), Rohit Sharma (61) and Virat Kohli (51), powering India to a mammoth 410 for 4, their second-highest World Cup total. Thus, India became the third team in this tournament to post 400 after South Africa and New Zealand. The Indian bowlers did not have to sweat much to skittle the Dutch for 250 as even Kohli and Rohit, who took the final scalp, found themselves among the wicket-takers. The Indian innings was dotted by two big stands that brilliantly exhibited aggressive batsmanship, so diligently followed by the hosts throughout this event. Rohit and Gill started the carnage with a forceful 100-run alliance off just 71 balls for the opening wicket. Rahul and Iyer exponentiated that collecting 208 runs for the fourth wicket in little over 21 overs, and 122 runs cascaded in the final 10 overs alone. The tons by Iyer and Rahul will delight the Indian management no end ahead of the knockouts in terms of middle-order batters’ productivity. However, Iyer’s knock will please the thinktank by that bit more. There has been chatter around the right-hander’s susceptibility against short-pitched balls and he cleared it by some degree here. The Netherland pacers did try that strategy against Iyer but the Mumbaikar was right up to the task, playing the pulls with comfort. He made 82 runs on the on-side during his innings and 35 runs came off pulls or horizontal-batted shots. It might have filled him also with some level of confidence ahead of the crunch match against the Kiwis. But his innings was not just about clearing the doubts as he scientifically broke down the Dutch bowling unit. In fact, Iyer’ was the kind of ODI innings that one can include in coaching archives as a model for budding cricketers. The biggest highlight of Iyer’s batting is his ability to avoid risks – the awareness of bowlers and areas to target to keep the run-flow steady. It was on full view at the Chinnaswamy stadium. Usually a fine player of spin, Iyer does have a weakness against the slow left-armers, evidenced by a reduced strike-rate of 90 against that type as compared to other exponents of slow bowling. In line with that, he played out Roelof van der Merwe for singles and twos while targeting offie Aryan Dutt and pacers Paul van Meekeren and Logan van Beek. Van Meekeren felt the heat in particular as Iyer lofted him for two 80m sixes over long-on and cover as the Dutch pacer gave too much width to free his hands. They were not manufactured shots but the balls were begging to be hit, and Iyer just obliged. Soon, he notched up his hundred with a single to mid-off off pacer Bas de Leede, and it took him just 84 balls. Rahul, in fact, started quite steadily, and focused more on giving strike to the in-touch Iyer. The first 30 balls he faced produced 26 runs, but once he decided to carve a place for himself in the partnership the next 33 balls saw Rahul pummelling 76 runs. The Bengaluru man unbundled some of those shots that make his batting a captivating view. Iyer preferred the on-side more to get his runs, but Rahul’s shot-making touched all parts of the ground. While he made 58 runs on the leg-side, 44 runs came through the off. It is tough to bowl to Rahul when is on the button and the Netherlands bowlers, in particular Meekeren and De Leede, felt the heat. The signature swat-flick six off Van Meekeren over mid-wicket drew wows from the holiday crowd, while a slice-cut off Van Beek over deep backward point was all about instant innovation. The 31-year-old soon brought up his seventh one-day hundred in bright style too – smashing two successive sixes off pacer De Leede over the mid-wicket region, and all he took was just 62 balls. With that hundred, Rahul overcame Rohit’s World Cup record of 63-ball ton which the latter set during the match against Afghanistan. However, the marauding start at the top given by Rohit and Gill once India batted by choice was just as important. Gill did the early running for India on a Chinnaswamy pitch that offered a hint of bounce, producing his almost nil-follow-through pulls and other range of shots predominantly on the leg-side. After a slightly sedate start, Rohit also slipped into overdrive to punish the Netherlands bowlers. But the ambition to accelerate led to the downfall of both of them, giving catches to the deep. But Kohli and Iyer added 71 runs off 66 balls to keep India chugging. Just as Kohli looked primed for that much-anticipated 50th ODI hundred, Van der Merwe castled him with a skidder that rushed under his downcoming bat. However, later Kohli had a sugary moment when he got the wicket of Dutch captain Scott Edwards, caught down the leg by Rahul behind the stumps, sending the spectators into a delirium. Even Gill and Suryakumar Yadav also turned their arms for a couple of overs giving the proceedings a fin-de-siecle touch as the hosts used nine bowlers. The Netherlands’ chase had nothing to write home about, apart from a brisk fifty by Teja Nidamanuru (54 off 39 balls) as they unravelled gradually. PTI Tags: cricket ICC India netherlands world cup Share Tweet Send Share Suggest A Correction Enter your email to get our daily news in your inbox. Leave this field empty if you're human:","pubDate":"2023-11-12 16:23:58","image_url":"https://www.orissapost.com/wp-content/uploads/2023/11/On-Cloud-Nine_Shreyas-Rahul-fireworks-power-India-to-160-run-win-over-Netherlands-300x197.jpg","source_id":"orissapost","source_priority":252515,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"36210ea2842c6c9732f2578c65fbca73","title":"KL Rahul Breaks Rohit Sharma's Record With Quickfire Ton In IND vs NED World Cup Clash","link":"https://news.abplive.com/photo-gallery/sports/cricket-kl-rahul-breaks-rohit-sharma-record-with-quickfire-ton-in-ind-vs-ned-world-cup-clash-1642339","keywords":["Cricket"],"creator":["ABP News Bureau"],"video_url":null,"description":"KL Rahul Breaks Rohit Sharma's Record With Quickfire Ton In IND vs NED World Cup Clash","content":"KL Rahul scored a record-breaking hundred as India's posted 410/4 against Netherlands in their last league match against Netherlands in Bengaluru. (Image Source: Getty) Rahul scored the fastest World Cup hundred by an Indian. He got the landmark in 62 balls at his home ground- the M Chinnaswamy Stadium. (Image Source: Getty) He broke Rohit Sharma's record which the India captain had set earlier in the competition. (Image Source: Getty) Rahul eventually got out for 102 off 62. (Image Source: Getty) Rahul and fellow centurion Shreyas Iyer stitched a 204-run stand and laid the foundation for India's 160-run win. (Image Source: Getty) Not A Fight We Want But Will Unequivocally Stand Up For Rule Of Law: Trudeau On India-Canada Diplomatic Row","pubDate":"2023-11-12 16:07:34","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/11/12/9802a4fc83c7cb8e4c1237e39326966a1699805226356625_original.jpg","source_id":"abplive","source_priority":10959,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"aae3643f61f9cfee70b9bd06df2414c1","title":"Virat Kohli takes first ODI wicket after nine years","link":"https://a-sports.tv/virat-kohli-takes-first-odi-wicket-after-nine-years/","keywords":["Cricket","Sports","Top News","Top Picks","ICC World Cup 2023","india","Netherlands","Virat Kohli"],"creator":["A Sports"],"video_url":null,"description":"BENGALURU: Star Indian batter Virat Kohli stunned the cricketing world as he picked up an ODI after nine years during his side’s ICC World Cup 2023 clash against the Netherlands. While the bottom-ranked side were batting cautiously in their 411-run pursuit, Indian captain Rohit Sharma handed the ball to Virat Kohli. The right-arm medium pace […] The post Virat Kohli takes first ODI wicket after nine years appeared first on ASports.tv.","content":"BENGALURU: Star Indian batter Virat Kohli stunned the cricketing world as he picked up an ODI after nine years during his side’s ICC World Cup 2023 clash against the Netherlands. While the bottom-ranked side were batting cautiously in their 411-run pursuit, Indian captain Rohit Sharma handed the ball to Virat Kohli. The right-arm medium pace bowler struck in his second over when a delivery drifting down the leg side, marked the end of Dutch skipper Scott Edwards’ knock. It was Virat Kohli’s fifth wicket in ODIs and his first since 2014 when he dismissed New Zealand captain Brendon McCullum in Wellington. His last wicket in international cricket, however, came back in 2016 when he dismissed the West Indian opener Johnson Charles in a high-octane T20 World Cup semi-final. Virat Kohli had a brief stint with the ball earlier in this World Cup when all-rounder Hardik Pandya limped off the field midway through an over against Bangladesh. In his usual role for India, Virat Kohli contributed significantly with an anchoring half-century. The right-handed batter scored 51 in 56 deliveries with the help of five boundaries and a six. He was one of the five Indian batters, who scored fifty-plus runs against the struggling Dutch bowling attack. Indian openers Rohit Sharma and top-ranked ODI batter Shubman Gill gave India a flying start with a sensational 100-run partnership. Gill was the first batter to be perished. He departed after scoring a 32-ball 51, laced with three boundaries and four sixes. Sharma soon followed him after a 54-ball 61 which included eight boundaries and two sixes. Virat Kohli then anchored the proceedings for India amid his 71-run partnership with Shreyas Iyer before the former perished soon after reaching his half-century. Iyer was then joined by KL Rahul and the duo bolstered India’s total past the 400-run mark with brisk centuries. Shreyas Iyer top-scored for India with an unbeaten 128 in 94 deliveries with the help of 10 boundaries and five sixes. Rahul, on the other hand, scored 102 in 64 deliveries, peppered with 11 boundaries and four sixes. READ: England announce white-ball squads for the Caribbean tour","pubDate":"2023-11-12 15:54:16","image_url":null,"source_id":"arynews","source_priority":41852,"country":["pakistan"],"category":["sports"],"language":"english"},{"article_id":"acdb683e1b3118096ef509909f182dae","title":"How much money will Pakistan receive from ICC despite early exit from World Cup 2023?","link":"https://en.dailypakistan.com.pk/12-Nov-2023/how-much-money-will-pakistan-receive-from-icc-despite-early-exit-from-world-cup-2023","keywords":["Sports"],"creator":["Web Desk"],"video_url":null,"description":"LAHORE – The Pakistan cricket team is set to receive a substantial financial reward despite elimination from the ICC World Cup 2023 at the league stage.","content":"LAHORE – The Pakistan cricket team is set to receive a substantial financial reward despite elimination from the ICC World Cup 2023 at the league stage. The Green Shirts will receive $260,000 from the allocated prize money for the ICC World Cup. For their achievements, winning four matches and progressing to the group stage, Pakistan will be awarded a sum exceeding Rs73 million. Pakistan failed to finish in the top four of the ongoing World Cup. The Men in Green lost five of their league games, the first time ever at a single World Cup edition, which included an array of four straight losses, to finish fifth in the points table. The triumph in four matches helped them to fetch Pakistan $160,000. The International Cricket Council (ICC) has reserved a prize of $40,000 for each victorious match. In recognition of playing in the group stage, the Pakistan team will be granted $100,000. Meanwhile, teams losing semi-finals will be compensated with $800,000. The runner-up in the ICC World Cup is in line to receive $2 million, while the victorious team will pocket $4 million. The ICC has designated the total prize money for the World Cup at $10 million. Remember, the four semi-finalists have been confirmed for the knockout stage of the ICC Men's Cricket World Cup 2023. Semi-final 1: India vs New Zealand, Wednesday 15th November, Wankhede Stadium, Mumbai Semi-final 2: South Africa vs Australia, Thursday 16th November, Eden Gardens, Kolkata Final: India / New Zealand vs South Africa / Australia, Sunday 19th November, Narendra Modi Stadium, Ahmedabad","pubDate":"2023-11-12 18:22:39","image_url":"https://en.dailypakistan.com.pk/digital_images/large/2023-11-12/how-much-money-will-pakistan-receive-from-icc-despite-early-exit-from-world-cup-2023-1699813213-5977.png","source_id":"dailypakistanen","source_priority":97265,"country":["pakistan"],"category":["sports"],"language":"english"},{"article_id":"8363215bba0d6add15cfa36dd2ce0c53","title":"Has ICC invited Imran Khan to World Cup final ceremony?","link":"https://en.dailypakistan.com.pk/12-Nov-2023/has-icc-invited-imran-khan-to-world-cup-final-ceremony","keywords":["ODI World Cup Updates, Sports, Viral"],"creator":["Web Desk"],"video_url":null,"description":"The International Cricket Council (ICC) has reportedly invited all the winning captains to the World Cup 2023 final match ceremony slated to be held on November 19, 2023.","content":"The International Cricket Council (ICC) has reportedly invited all the winning captains to the World Cup 2023 final match ceremony slated to be held on November 19, 2023. As the World Cup action continues for over a month now, the leading ICC event is set to culminate with an extravagant ceremony. All the winning captains will gather at the Narendra Modi Stadium on the invitation of the top cricket body. Among all the World Cup winning captains, former cricket star turned politician Imran Khan remains a leading figure as he holds a massive fan following due to his charisma and populist style of politics. Khan remains the only player who lifted the World Cup trophy for Pakistan, and it was three decades back when he led a team that bagged the World Cup in Melbourne. Unverified reports say that ICC has invited Imran Khan and other players to the Winning Captains Ceremony, but it raised many questions as the former prime minister remains behind the bars for 100 days. The PTI chief’s visit to the neighboring country for the event is something that fans can assume but in reality it seems impossible as the former cricketer is facing over 150 cases related to terrorism, blasphemy and revealing national secrets. Amid the ongoing legal proceedings, the former skipper is highly unlikely to travel to India for the World Cup ceremony.","pubDate":"2023-11-12 17:13:08","image_url":"https://en.dailypakistan.com.pk/digital_images/large/2023-11-12/has-icc-invited-imran-khan-along-with-other-winning-captains-for-world-cup-ceremony-1699797028-6891.jpg","source_id":"dailypakistanen","source_priority":97265,"country":["pakistan"],"category":["sports"],"language":"english"},{"article_id":"ddb084942bbe5163199c7f07836c9c1e","title":"World Cup: Iyer, Rahul fireworks lead rout of Netherlands as India make it 9-in-a-row","link":"https://timesofindia.indiatimes.com/sports/cricket/icc-world-cup/news/world-cup-shreyas-iyer-kl-rahul-fireworks-lead-rout-of-netherlands-as-india-make-it-9-in-a-row/articleshow/105170606.cms","keywords":null,"creator":null,"video_url":null,"description":"Centuries from Shreyas Iyer and KL Rahul powered India to a 160-run World Cup win over the Netherlands as they completed the group stage with a perfect 9 wins in 9 games. Iyer (128*) and Rahul (102) put on 208 runs to guide India to 410 for 4. India then employed 9 bowlers, including part-timers Virat Kohli and Rohit Sharma, to dismiss the Dutch for 250. The victory over Dutch meant India surpassed their previous record of 8 straight wins registered in the 2003 edition.","content":"World Cup 2023| 49 cut-outs of Virat Kohli in Bengaluru as India lock horns with Netherlands World Cup: It's India vs NZ, SA vs AUS in semis Team India celebrates Diwali in Bengaluru England send Pakistan crashing out of World Cup Marsh's ton ensures Australia cruise past Bangladesh World Cup: South Africa scrape past spirited Afghanistan NZ edge closer to semifinal with clinical win over Sri Lanka Maxwell's stunning 201* guides Australia to WC semi-finals Bangladesh beat Sri Lanka after Mathews 'timed out' row Virat Kohli's four centuries at ODI World Cup Virat Kohli leads India stat attack against South Africa","pubDate":"2023-11-12 16:42:35","image_url":null,"source_id":"toi","source_priority":391,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"57f4a870c697e41bf066fea6e43c77cc","title":"On 'Cloud Nine': Shreyas, Rahul fireworks power India to 160-run win over Netherlands","link":"https://www.tribuneindia.com/news/world-cup-2023/on-cloud-nine-shreyas-rahul-fireworks-power-india-to-160-run-win-over-netherlands-561950","keywords":null,"creator":null,"video_url":null,"description":"Bengaluru, November 12KL Rahul's pillaging hundred, the fastest by an Indian in World Cup, and Shreyas Iyer's doubts-allaying 128 lit up the Diwali day as India mowed down Netherlands by 160 runs here on Sunday, registering their ninth consecutive victory in the showpiece.It helped India finish their league engagements with 18 points, and now they will move to Mumbai for the high-stakes semi-final clash against New Zealand on Wednesday.Rahul's blitz and Iyer's posh unbeaten 94-ball hundred combined well with fifties by Shubman Gill (51), Rohit Sharma (61) and Virat Kohli (51), powering India to a mammoth 410 for 4, their second highest World Cup total.Thus, India became the third team in this tournament to post 400 after South Africa and New Zealand. The Indian bowlers did not have to sweat much to skittle the Dutch for 250 as even Kohli and Rohit, who took the final scalp, found themselves among the wicket-takers.The Indian innings was dotted by two big stands that brilliantly exhibited aggressive batsmanship, so diligently followed by the hosts throughout this event.Rohit and Gill started the carnage with a forceful 100-run alliance off just 71 balls for the opening wicket. Rahul and Iyer exponentiated that collecting 208 runs for the fourth wicket in little over 21 overs, and 122 runs cascaded in the final 10 overs alone.The tons by Iyer and Rahul will delight the Indian management no end ahead of the knockouts in terms of middle-order batters' productivity.However, Iyer's knock will please the thinktank by that bit more. There has been chatter around the right-hander's susceptibility against short-pitched balls and he cleared it by some degree here.The Netherland pacers did try that strategy against Iyer but the Mumbaikar was right up to the task, playing the pulls with comfort.He made 82 runs on the on-side during his innings and 35 runs came off pulls or horizontal-batted shots. It might have filled him also with some level of confidence ahead of the crunch match against the Kiwis.But his innings was not just about clearing the doubts as he scientifically broke down the Dutch bowling unit. In fact, Iyer' was the kind of ODI innings that one can include in coaching archives as a model for budding cricketers.The biggest highlight of Iyer's batting is his ability to avoid risks ndash; the awareness of bowlers and areas to target to keep the run-flow steady. It was on full view at the Chinnaswamy stadium.Usually a fine player of spin, Iyer does have a weakness against the slow left-armers, evidenced by a reduced strike-rate of 90 against that type as compared to other exponents of slow bowling.In line with that, he played out Roelof van der Merwe for singles and twos while targeting offie Aryan Dutt and pacers Paul van Meekeren and Logan van Beek.Van Meekeren felt the heat in particular as Iyer lofted him for two 80m sixes over long-on and cover as the Dutch pacer gave too much width to free his hands.They were not manufactured shots but the balls were begging to be hit, and Iyer just obliged.Soon, he notched up his hundred with a single to mid-off off pacer Bas de Leede, and it took him just 84 balls.Rahul, in fact, started quite steadily, and focused more on giving strike to the in-touch Iyer.The first 30 balls he faced produced 26 runs, but once he decided to carve a place for himself in the partnership the next 33 balls saw Rahul pummelling 76 runs.The Bengaluru man unbundled some of those shots that make his batting a captivating view. Iyer preferred the on-side more to get his runs, but Rahul's shot-making touched all parts of the ground.While he made 58 runs on the leg-side, 44 runs came through the off. It is tough to bowl to Rahul when is on the button and the Netherlands bowlers, in particular Meekeren and De Leede, felt the heat.The signature swat-flick six off Van Meekeren over mid-wicket drew wows from the holiday crowd, while a slice-cut off Van Beek over deep backward point was all about instant innovation.The 31-year-old soon brought up his seventh one-day hundred in bright style too ndash; smashing two successive sixes off pacer De Leede over the mid-wicket region, and all he took was just 62 balls.With that hundred, Rahul overcame Rohit's World Cup record of 63-ball ton which the latter set during the match against Afghanistan.However, the marauding start at the top given by Rohit and Gill once India batted by choice was just as important.Gill did the early running for India on a Chinnaswamy pitch that offered a hint of bounce, producing his almost nil-follow through pulls and other range of shots predominantly on the leg-side.After a slightly sedate start, Rohit also slipped into overdrive to punish the Netherlands bowlers.But the ambition to accelerate led to the downfall of both of them, giving catches to the deep. But Kohli and Iyer added 71 runs off 66 balls to keep India chugging.Just as Kohli looked primed for that much-anticipated 50th ODI hundred, Van der Merwe castled him with a skidder that rushed under his downcoming bat.However, later Kohli had a sugary moment when he got the wicket of Dutch captain Scott Edwards, caught down the leg by Rahul behind the stumps, sending the spectators into a delirium.Even Gill and Suryakumar Yadav also turned their arms for a couple of overs giving the proceedings a fin-de-siecle touch as the hosts used nine bowlers.The Netherlands' chase had nothing to write home about, apart from a brisk fifty by Teja Nidamanuru (54 off 39 balls) as they unravelled gradually.","content":"PTI Bengaluru, November 12 KL Rahul's pillaging hundred, the fastest by an Indian in World Cup, and Shreyas Iyer's doubts-allaying 128 lit up the Diwali day as India mowed down Netherlands by 160 runs here on Sunday, registering their ninth consecutive victory in the showpiece. It helped India finish their league engagements with 18 points, and now they will move to Mumbai for the high-stakes semi-final clash against New Zealand on Wednesday. Rahul's blitz and Iyer's posh unbeaten 94-ball hundred combined well with fifties by Shubman Gill (51), Rohit Sharma (61) and Virat Kohli (51), powering India to a mammoth 410 for 4, their second highest World Cup total. Thus, India became the third team in this tournament to post 400 after South Africa and New Zealand. The Indian bowlers did not have to sweat much to skittle the Dutch for 250 as even Kohli and Rohit, who took the final scalp, found themselves among the wicket-takers. The Indian innings was dotted by two big stands that brilliantly exhibited aggressive batsmanship, so diligently followed by the hosts throughout this event. Rohit and Gill started the carnage with a forceful 100-run alliance off just 71 balls for the opening wicket. Rahul and Iyer exponentiated that collecting 208 runs for the fourth wicket in little over 21 overs, and 122 runs cascaded in the final 10 overs alone. The tons by Iyer and Rahul will delight the Indian management no end ahead of the knockouts in terms of middle-order batters' productivity. However, Iyer's knock will please the thinktank by that bit more. There has been chatter around the right-hander's susceptibility against short-pitched balls and he cleared it by some degree here. The Netherland pacers did try that strategy against Iyer but the Mumbaikar was right up to the task, playing the pulls with comfort. He made 82 runs on the on-side during his innings and 35 runs came off pulls or horizontal-batted shots. It might have filled him also with some level of confidence ahead of the crunch match against the Kiwis. But his innings was not just about clearing the doubts as he scientifically broke down the Dutch bowling unit. In fact, Iyer' was the kind of ODI innings that one can include in coaching archives as a model for budding cricketers. The biggest highlight of Iyer's batting is his ability to avoid risks – the awareness of bowlers and areas to target to keep the run-flow steady. It was on full view at the Chinnaswamy stadium. Usually a fine player of spin, Iyer does have a weakness against the slow left-armers, evidenced by a reduced strike-rate of 90 against that type as compared to other exponents of slow bowling. In line with that, he played out Roelof van der Merwe for singles and twos while targeting offie Aryan Dutt and pacers Paul van Meekeren and Logan van Beek. Van Meekeren felt the heat in particular as Iyer lofted him for two 80m sixes over long-on and cover as the Dutch pacer gave too much width to free his hands. They were not manufactured shots but the balls were begging to be hit, and Iyer just obliged. Soon, he notched up his hundred with a single to mid-off off pacer Bas de Leede, and it took him just 84 balls. Rahul, in fact, started quite steadily, and focused more on giving strike to the in-touch Iyer. The first 30 balls he faced produced 26 runs, but once he decided to carve a place for himself in the partnership the next 33 balls saw Rahul pummelling 76 runs. The Bengaluru man unbundled some of those shots that make his batting a captivating view. Iyer preferred the on-side more to get his runs, but Rahul's shot-making touched all parts of the ground. While he made 58 runs on the leg-side, 44 runs came through the off. It is tough to bowl to Rahul when is on the button and the Netherlands bowlers, in particular Meekeren and De Leede, felt the heat. The signature swat-flick six off Van Meekeren over mid-wicket drew wows from the holiday crowd, while a slice-cut off Van Beek over deep backward point was all about instant innovation. The 31-year-old soon brought up his seventh one-day hundred in bright style too – smashing two successive sixes off pacer De Leede over the mid-wicket region, and all he took was just 62 balls. With that hundred, Rahul overcame Rohit's World Cup record of 63-ball ton which the latter set during the match against Afghanistan. However, the marauding start at the top given by Rohit and Gill once India batted by choice was just as important. Gill did the early running for India on a Chinnaswamy pitch that offered a hint of bounce, producing his almost nil-follow through pulls and other range of shots predominantly on the leg-side. After a slightly sedate start, Rohit also slipped into overdrive to punish the Netherlands bowlers. But the ambition to accelerate led to the downfall of both of them, giving catches to the deep. But Kohli and Iyer added 71 runs off 66 balls to keep India chugging. Just as Kohli looked primed for that much-anticipated 50th ODI hundred, Van der Merwe castled him with a skidder that rushed under his downcoming bat. However, later Kohli had a sugary moment when he got the wicket of Dutch captain Scott Edwards, caught down the leg by Rahul behind the stumps, sending the spectators into a delirium. Even Gill and Suryakumar Yadav also turned their arms for a couple of overs giving the proceedings a fin-de-siecle touch as the hosts used nine bowlers. The Netherlands' chase had nothing to write home about, apart from a brisk fifty by Teja Nidamanuru (54 off 39 balls) as they unravelled gradually. #Cricket #Diwali #KL Rahul","pubDate":"2023-11-12 16:41:59","image_url":"https://englishtribuneimages.blob.core.windows.net/gallary-content/2023/11/2023_11$largeimg_968216865.JPG","source_id":"tribuneindia","source_priority":7916,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"af5fc82aab23ca6c880f29e5845b79cc","title":"India thrash Netherlands to extend World Cup winning streak","link":"https://www.skysports.com/cricket/news/20876/13006550/cricket-world-cup-india-thrash-netherlands-by-160-runs-to-complete-100-per-cent-group-record","keywords":null,"creator":null,"video_url":null,"description":"India completed a flawless World Cup group stage by hammering the Netherlands by 160 runs in Bengaluru.","content":"India completed a flawless World Cup group stage by hammering the Netherlands by 160 runs in Bengaluru. The hosts made it nine wins out of nine games after posting a huge 50-over total of 410-4, just three runs shy of their World Cup best against Bermuda in 2007. Shreyas Iyer top-scored with an unbeaten 128 from 94 balls and KL Rahul completed his century in the final over before being dismissed for 102. Rahul reached his hundred in 62 balls - the fastest by an Indian batter at a World Cup - and his fourth-wicket partnership of 208 with Iyer took the game away from the Dutch. Rohit Sharma (61), Shubman Gill (51) and Virat Kohli (51) also went past fifty as India claimed another World Cup record. It was the first time the top five of any team have all got half-centuries in the same innings in the competition - and only the third time in the history of ODI cricket. Kohli appeared well set to break the record of 49 ODI hundreds that he shares with countryman Sachin Tendulkar, only to miss a straight delivery from spinner Roelof van der Merwe and having to content himself with overtaking South Africa's Quinton de Kock as the tournament's leading run-scorer. India were always in control on a flat wicket and the Netherlands were eventually dismissed for 250 from 47.5 overs. Teja Nidamanuru (54) and Sybrand Engelbrecht (45) offered resistance as Mohammed Siraj, Jasprit Bumrah, Kuldeep Yadav and Ravindra Jadeja took two wickets apiece, while Kohli claimed his ODI wicket since 2014. Scorecard: India vs Netherlands Cricket World Cup: Latest headlines Latest CWC fixtures and results Final men's Cricket World Cup table Please use Chrome browser for a more accessible video player India captain Rohit Sharma: \"Since we started the tournament it was always about taking one game at a time and playing that game well. 11 games in all if you go all the way, that's a lot of games. It's important for us to break it down and focus on one game and play it well. \"That's what everyone did. You play in different conditions, you've got to adapt and that's what we did. We're very pleased with how we played in these nine games. We've been very clinical from game one until today. That's because different individuals have stepped up at different points.\" Please use Chrome browser for a more accessible video player Netherlands captain Scott Edwards: \"India showed pure class with the bat. I thought we bowled well in periods. They soaked up the pressure. They're going to be a hard side to beat in the rest of the tournament. As for ourselves, we're a young side still and it's about growth for us.\" The semi-final line-up is now confirmed, with India playing fourth-placed New Zealand in Mumbai on Wednesday before Australia take on South Africa in Kolkata a day later. Build-up of those matches begins on Sky Sports Cricket from 8am on those days, with matches starting at 8.30am. Watch every match from the Cricket World Cup live Sky Sports, including the final in Ahmedabad on Sunday November 19. Stream the tournament without a contract through NOW.","pubDate":"2023-11-12 16:41:00","image_url":"https://e2.365dm.com/23/11/1920x1080/skysports-virat-kohli-india_6357668.jpg?20231112160359","source_id":"skysports","source_priority":831,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"f5eacdf40a7ad3ee766969cd21f0b533","title":"IND vs NED HIGHLIGHTS, World Cup 2023: India Beat Netherlands To Taste Record Ninth Win In A Row","link":"https://news.abplive.com/sports/cricket/ind-vs-ned-highlights-world-cup-2023-india-beat-netherlands-to-taste-record-ninth-win-in-row-1642340","keywords":["Cricket"],"creator":["ABP News Bureau"],"video_url":null,"description":"India beat Netherlands by 160 runs to set a new record for themselves for the most successive wins in a single edition of a World Cup. In what was the final round-robin match of World Cup 2023, the hosts won the toss and elected to bat first before posting 410/4. Each of the first five-batters scored a fifty plus score- Rohit Sharma, Shubman Gill, Virat Kohli, Shreyas Iyer and KL Rahul- with the last two of them- Shreyas and Rahul going on to convert them into hundreds. In response, the Dutch were bundled out for 250 with Jasprit Bumrah, Mohammed Siraj, Kuldeep Yadav and Ravindra Jadeja all taking two wickets apiece. As India used nine bowlers, Virat Kohli and Rohit Sharma also scalped a wicket each with Suyrakumar Yadav and Shubman Gill also rolling their arms over. Teja Nidamanuru top-scored for the Men in Orange with 54 off 39. \"It's a little bit of a tricky one at the moment where we want to be. We are pretty confident with the style we play. The tournament was always going to be tough. They [India] are as good a side going around. We will have to be a lot better going into theT20 World Cup next year. They showed pure class with the bat. Playing to learn with that. They soaked up the pressure. When you are three down with ten overs left, you are going to score some runs. We are a very young side. Lots of young sides in the setup. We have some training camps coming. Fixtures wide, I am not sure about that,\" Netherlands captain Scott Edwards said at the post-match presentation. \"Since we started the tournament, it was all about one game at a time. We never wanted to look too far ahead. It is a long tournament, 11 games in all if we go all the way. It was important to break it down and focus on it,\" Indian skipper Rohit said.India will now lock horns against New Zealand in the first semifinal at the Wankhede Stadium in Mumbai on November 15 (Wednesday).","content":"googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); India beat Netherlands by 160 runs to set a new record for themselves for the most successive wins in a single edition of a World Cup. In what was the final round-robin match of World Cup 2023 , the hosts won the toss and elected to bat first before posting 410/4. Each of the first five-batters scored a fifty plus score- Rohit Sharma, Shubman Gill, Virat Kohli, Shreyas Iyer and KL Rahul- with the last two of them- Shreyas and Rahul going on to convert them into hundreds. In response, the Dutch were bundled out for 250 with Jasprit Bumrah, Mohammed Siraj, Kuldeep Yadav and Ravindra Jadeja all taking two wickets apiece. As India used nine bowlers, Virat Kohli and Rohit Sharma also scalped a wicket each with Suyrakumar Yadav and Shubman Gill also rolling their arms over. Teja Nidamanuru top-scored for the Men in Orange with 54 off 39. \"It's a little bit of a tricky one at the moment where we want to be. We are pretty confident with the style we play. The tournament was always going to be tough. They [India] are as good a side going around. We will have to be a lot better going into the T20 World Cup next year. They showed pure class with the bat. Playing to learn with that. They soaked up the pressure. When you are three down with ten overs left, you are going to score some runs. We are a very young side. Lots of young sides in the setup. We have some training camps coming. Fixtures wide, I am not sure about that,\" Netherlands captain Scott Edwards said at the post-match presentation. \"Since we started the tournament, it was all about one game at a time. We never wanted to look too far ahead. It is a long tournament, 11 games in all if we go all the way. It was important to break it down and focus on it,\" Indian skipper Rohit said. India will now lock horns against New Zealand in the first semifinal at the Wankhede Stadium in Mumbai on November 15 (Wednesday).","pubDate":"2023-11-12 16:28:52","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/11/12/11253d619b8c18d6342c81e797288bd41699806472503625_original.jpg","source_id":"abplive","source_priority":10959,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"34d726160f9d6d00ec3a7dfbbb72f779","title":"Sri Lanka cricket skipper pleads for ICC suspension to end","link":"https://a-sports.tv/sri-lanka-cricket-skipper-pleads-for-icc-suspension-to-end/","keywords":["Cricket","Sports","Top News","Top Picks","ICC","Kusal Mendis","Sri Lanka"],"creator":["AFP"],"video_url":null,"description":"Sri Lanka skipper Kusal Mendis appealed Sunday for the governing International Cricket Council (ICC) to lift its suspension of the country over alleged political interference in the local board. “This is our profession and we can’t be staying at home doing nothing,” Mendis told reporters in the capital Colombo. “We want to start practising as […] The post Sri Lanka cricket skipper pleads for ICC suspension to end appeared first on ASports.tv.","content":"Sri Lanka skipper Kusal Mendis appealed Sunday for the governing International Cricket Council (ICC) to lift its suspension of the country over alleged political interference in the local board. “This is our profession and we can’t be staying at home doing nothing,” Mendis told reporters in the capital Colombo. “We want to start practising as there are a few tours to happen next year.” The ICC said on Friday that Sri Lanka Cricket was “in serious breach” of its obligations as a member, highlighting “the requirement to manage its affairs autonomously and to ensure that there is no government interference”. The suspension came a day after Sri Lanka’s parliament asked the board to resign over allegations by sports minister Roshan Ranasinghe that it had syphoned off millions of dollars. “As players we had no control over that,” Kusal Mendis said. “As the captain I only hope for its (the ban’s) removal so that we can resume our game.” It was not immediately clear if the indefinite suspension would affect Sri Lanka hosting the Under-19 World Cup in January. The crisis involving the cricket board — the richest sporting organisation in the bankrupt island country — came to a head after Sri Lanka’s humiliating World Cup defeat by India earlier this month. Team manager Mahinda Halangoda said Sri Lanka’s players had been told to try and carry on as normal. “The team management had a discussion with the players and asked them to focus on cricket,” he said. READ: India ease past Netherlands to stay unbeaten in World Cup","pubDate":"2023-11-12 16:25:48","image_url":null,"source_id":"arynews","source_priority":41852,"country":["pakistan"],"category":["sports"],"language":"english"},{"article_id":"9b02fe62dbe2f0844448e51a4a648a6b","title":"On ‘Cloud Nine’: Shreyas, Rahul fireworks power India to 160-run win over Netherlands","link":"https://www.orissapost.com/on-cloud-nine-shreyas-rahul-fireworks-power-india-to-160-run-win-over-netherlands/","keywords":["Sports","cricket","ICC","India","netherlands","world cup"],"creator":["Post News Network"],"video_url":null,"description":"Bengaluru: KL Rahul’s pillaging hundred, the fastest by an Indian in World Cup, and Shreyas Iyer’s doubts-allaying 128 lit up the Diwali day as India mowed down Netherlands by 160 runs here Sunday, registering their ninth consecutive victory in the showpiece. It helped India finish their league engagements with 18 points, and now they will […]","content":"On ‘Cloud Nine’: Shreyas, Rahul fireworks power India to 160-run win over Netherlands PTI Updated: November 12th, 2023, 21:53 IST in Sports 0 Pic- IANS Share on Facebook Share on Twitter Share on WhatsApp Share on Linkedin Bengaluru: KL Rahul’s pillaging hundred, the fastest by an Indian in World Cup, and Shreyas Iyer’s doubts-allaying 128 lit up the Diwali day as India mowed down Netherlands by 160 runs here Sunday, registering their ninth consecutive victory in the showpiece. It helped India finish their league engagements with 18 points, and now they will move to Mumbai for the high-stakes semi-final clash against New Zealand Wednesday. Also Read Jos Buttler to lead England in white-ball Caribbean tour in December 10 hours ago Men’s ODI WC: Coach Arthur blames inconsistency for Pakistan’s sub-par show; wants Babar to stay as captain 10 hours ago Rahul’s blitz and Iyer’s posh unbeaten 94-ball hundred combined well with fifties by Shubman Gill (51), Rohit Sharma (61) and Virat Kohli (51), powering India to a mammoth 410 for 4, their second-highest World Cup total. Thus, India became the third team in this tournament to post 400 after South Africa and New Zealand. The Indian bowlers did not have to sweat much to skittle the Dutch for 250 as even Kohli and Rohit, who took the final scalp, found themselves among the wicket-takers. The Indian innings was dotted by two big stands that brilliantly exhibited aggressive batsmanship, so diligently followed by the hosts throughout this event. Rohit and Gill started the carnage with a forceful 100-run alliance off just 71 balls for the opening wicket. Rahul and Iyer exponentiated that collecting 208 runs for the fourth wicket in little over 21 overs, and 122 runs cascaded in the final 10 overs alone. The tons by Iyer and Rahul will delight the Indian management no end ahead of the knockouts in terms of middle-order batters’ productivity. However, Iyer’s knock will please the thinktank by that bit more. There has been chatter around the right-hander’s susceptibility against short-pitched balls and he cleared it by some degree here. The Netherland pacers did try that strategy against Iyer but the Mumbaikar was right up to the task, playing the pulls with comfort. He made 82 runs on the on-side during his innings and 35 runs came off pulls or horizontal-batted shots. It might have filled him also with some level of confidence ahead of the crunch match against the Kiwis. But his innings was not just about clearing the doubts as he scientifically broke down the Dutch bowling unit. In fact, Iyer’ was the kind of ODI innings that one can include in coaching archives as a model for budding cricketers. The biggest highlight of Iyer’s batting is his ability to avoid risks – the awareness of bowlers and areas to target to keep the run-flow steady. It was on full view at the Chinnaswamy stadium. Usually a fine player of spin, Iyer does have a weakness against the slow left-armers, evidenced by a reduced strike-rate of 90 against that type as compared to other exponents of slow bowling. In line with that, he played out Roelof van der Merwe for singles and twos while targeting offie Aryan Dutt and pacers Paul van Meekeren and Logan van Beek. Van Meekeren felt the heat in particular as Iyer lofted him for two 80m sixes over long-on and cover as the Dutch pacer gave too much width to free his hands. They were not manufactured shots but the balls were begging to be hit, and Iyer just obliged. Soon, he notched up his hundred with a single to mid-off off pacer Bas de Leede, and it took him just 84 balls. Rahul, in fact, started quite steadily, and focused more on giving strike to the in-touch Iyer. The first 30 balls he faced produced 26 runs, but once he decided to carve a place for himself in the partnership the next 33 balls saw Rahul pummelling 76 runs. The Bengaluru man unbundled some of those shots that make his batting a captivating view. Iyer preferred the on-side more to get his runs, but Rahul’s shot-making touched all parts of the ground. While he made 58 runs on the leg-side, 44 runs came through the off. It is tough to bowl to Rahul when is on the button and the Netherlands bowlers, in particular Meekeren and De Leede, felt the heat. The signature swat-flick six off Van Meekeren over mid-wicket drew wows from the holiday crowd, while a slice-cut off Van Beek over deep backward point was all about instant innovation. The 31-year-old soon brought up his seventh one-day hundred in bright style too – smashing two successive sixes off pacer De Leede over the mid-wicket region, and all he took was just 62 balls. With that hundred, Rahul overcame Rohit’s World Cup record of 63-ball ton which the latter set during the match against Afghanistan. However, the marauding start at the top given by Rohit and Gill once India batted by choice was just as important. Gill did the early running for India on a Chinnaswamy pitch that offered a hint of bounce, producing his almost nil-follow-through pulls and other range of shots predominantly on the leg-side. After a slightly sedate start, Rohit also slipped into overdrive to punish the Netherlands bowlers. But the ambition to accelerate led to the downfall of both of them, giving catches to the deep. But Kohli and Iyer added 71 runs off 66 balls to keep India chugging. Just as Kohli looked primed for that much-anticipated 50th ODI hundred, Van der Merwe castled him with a skidder that rushed under his downcoming bat. However, later Kohli had a sugary moment when he got the wicket of Dutch captain Scott Edwards, caught down the leg by Rahul behind the stumps, sending the spectators into a delirium. Even Gill and Suryakumar Yadav also turned their arms for a couple of overs giving the proceedings a fin-de-siecle touch as the hosts used nine bowlers. The Netherlands’ chase had nothing to write home about, apart from a brisk fifty by Teja Nidamanuru (54 off 39 balls) as they unravelled gradually. PTI Tags: cricket ICC India netherlands world cup Share Tweet Send Share Suggest A Correction Enter your email to get our daily news in your inbox. Leave this field empty if you're human:","pubDate":"2023-11-12 16:23:58","image_url":"https://www.orissapost.com/wp-content/uploads/2023/11/On-Cloud-Nine_Shreyas-Rahul-fireworks-power-India-to-160-run-win-over-Netherlands-300x197.jpg","source_id":"orissapost","source_priority":252515,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"36210ea2842c6c9732f2578c65fbca73","title":"KL Rahul Breaks Rohit Sharma's Record With Quickfire Ton In IND vs NED World Cup Clash","link":"https://news.abplive.com/photo-gallery/sports/cricket-kl-rahul-breaks-rohit-sharma-record-with-quickfire-ton-in-ind-vs-ned-world-cup-clash-1642339","keywords":["Cricket"],"creator":["ABP News Bureau"],"video_url":null,"description":"KL Rahul Breaks Rohit Sharma's Record With Quickfire Ton In IND vs NED World Cup Clash","content":"KL Rahul scored a record-breaking hundred as India's posted 410/4 against Netherlands in their last league match against Netherlands in Bengaluru. (Image Source: Getty) Rahul scored the fastest World Cup hundred by an Indian. He got the landmark in 62 balls at his home ground- the M Chinnaswamy Stadium. (Image Source: Getty) He broke Rohit Sharma's record which the India captain had set earlier in the competition. (Image Source: Getty) Rahul eventually got out for 102 off 62. (Image Source: Getty) Rahul and fellow centurion Shreyas Iyer stitched a 204-run stand and laid the foundation for India's 160-run win. (Image Source: Getty) Not A Fight We Want But Will Unequivocally Stand Up For Rule Of Law: Trudeau On India-Canada Diplomatic Row","pubDate":"2023-11-12 16:07:34","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/11/12/9802a4fc83c7cb8e4c1237e39326966a1699805226356625_original.jpg","source_id":"abplive","source_priority":10959,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"aae3643f61f9cfee70b9bd06df2414c1","title":"Virat Kohli takes first ODI wicket after nine years","link":"https://a-sports.tv/virat-kohli-takes-first-odi-wicket-after-nine-years/","keywords":["Cricket","Sports","Top News","Top Picks","ICC World Cup 2023","india","Netherlands","Virat Kohli"],"creator":["A Sports"],"video_url":null,"description":"BENGALURU: Star Indian batter Virat Kohli stunned the cricketing world as he picked up an ODI after nine years during his side’s ICC World Cup 2023 clash against the Netherlands. While the bottom-ranked side were batting cautiously in their 411-run pursuit, Indian captain Rohit Sharma handed the ball to Virat Kohli. The right-arm medium pace […] The post Virat Kohli takes first ODI wicket after nine years appeared first on ASports.tv.","content":"BENGALURU: Star Indian batter Virat Kohli stunned the cricketing world as he picked up an ODI after nine years during his side’s ICC World Cup 2023 clash against the Netherlands. While the bottom-ranked side were batting cautiously in their 411-run pursuit, Indian captain Rohit Sharma handed the ball to Virat Kohli. The right-arm medium pace bowler struck in his second over when a delivery drifting down the leg side, marked the end of Dutch skipper Scott Edwards’ knock. It was Virat Kohli’s fifth wicket in ODIs and his first since 2014 when he dismissed New Zealand captain Brendon McCullum in Wellington. His last wicket in international cricket, however, came back in 2016 when he dismissed the West Indian opener Johnson Charles in a high-octane T20 World Cup semi-final. Virat Kohli had a brief stint with the ball earlier in this World Cup when all-rounder Hardik Pandya limped off the field midway through an over against Bangladesh. In his usual role for India, Virat Kohli contributed significantly with an anchoring half-century. The right-handed batter scored 51 in 56 deliveries with the help of five boundaries and a six. He was one of the five Indian batters, who scored fifty-plus runs against the struggling Dutch bowling attack. Indian openers Rohit Sharma and top-ranked ODI batter Shubman Gill gave India a flying start with a sensational 100-run partnership. Gill was the first batter to be perished. He departed after scoring a 32-ball 51, laced with three boundaries and four sixes. Sharma soon followed him after a 54-ball 61 which included eight boundaries and two sixes. Virat Kohli then anchored the proceedings for India amid his 71-run partnership with Shreyas Iyer before the former perished soon after reaching his half-century. Iyer was then joined by KL Rahul and the duo bolstered India’s total past the 400-run mark with brisk centuries. Shreyas Iyer top-scored for India with an unbeaten 128 in 94 deliveries with the help of 10 boundaries and five sixes. Rahul, on the other hand, scored 102 in 64 deliveries, peppered with 11 boundaries and four sixes. READ: England announce white-ball squads for the Caribbean tour","pubDate":"2023-11-12 15:54:16","image_url":null,"source_id":"arynews","source_priority":41852,"country":["pakistan"],"category":["sports"],"language":"english"}]}