{"newsArray":[{"title":"Hales in line for England T20 recall","link":"https://www.skysports.com/cricket/news/12040/12691674/alex-hales-in-line-for-england-t20-squad-recall-as-jonny-bairstow-injury-replacement","keywords":null,"creator":null,"video_url":null,"description":"Alex Hales is in line for an England T20 squad recall as Jonny Bairstow's injury replacement after a three-year exile from International cricket.","content":null,"pubDate":"2022-09-06 21:17:00","image_url":"https://e0.365dm.com/22/09/1920x1080/skysports-alex-hales-cricket_5890040.jpg?20220906225323","source_id":"skysports","country":["united states of america","united kingdom","australia"],"category":["sports"],"language":"english"},{"title":"India lost against Sri Lanka","link":"https://thenewsglory.com/india-lost-against-sri-lanka/","keywords":["Sports","Asia Cup","Cricket","Dhoni","fans","India","MS Dhoni","Sri Lanka"],"creator":["The News Glory"],"video_url":null,"description":"In the current Asia Cup series, India’s chances of advancing to the finals are almost over. This was due to India’s defeat against Pakistan and Sri Lanka in the Super 4 round. In this case, the fans shared the picture of the old match in which Dhoni ran out and said on social media that […]","content":"In the current Asia Cup series, India’s chances of advancing to the finals are almost over. This was due to India’s defeat against Pakistan and Sri Lanka in the Super 4 round. In this case, the fans shared the picture of the old match in which Dhoni ran out and said on social media that they miss him a lot. It has gone viral on the internet. The main reason for the subsequent downfall of the Indian cricket team was the lack of fast bowling. It is in this awkward environment that fans are now recalling Dhoni’s contribution to the Indian team in international cricket. Shanaka, who was on strike, would have missed the fifth ball of the last over bowled by Arshdeep in the match against Sri Lanka yesterday (September 6). Then the team needed only 2 runs to win. It is sheltered in the hands of the keeper, Pant. However, the Sri Lankan batsmen were running to get bye runs. Pant tries a direct hit. For that he had taken off his right hand keeping glove in advance. However, the ball failed to clear the stumps. And it will be sheltered by bowler Harshdeep. He also tried to topple the stumps at the non-striker’s end and failed. In that interval the Sri Lankan team completed 2 runs and won. Like this, Dhoni has stopped many bye runs by the opponent when he was the wicket keeper. It also affects the end of the game. His ability is now being praised by his fans. They also said that they miss him especially. Bangladesh needed 2 runs to win from the last ball of the last over against India in the last T20 World Cup 2016 as it happened against Sri Lanka. Then similarly the batsmen of that team would have tried to run by runs. Dhoni, who predicted it correctly, destroyed the stumps and won the team by 1 run. That’s what fans are remembering now. If the Indian team players had done what Dhoni did that day, the fans would have had a chance in the game.","pubDate":"2022-09-06 20:10:05","image_url":null,"source_id":"thenewsglory","country":["india"],"category":["sports"],"language":"english"},{"title":"India vs Sri Lanka Asia Cup 2022 Super 4 Highlights : SL eke out stunning win, beat India by 6 wickets - The Indian Express","link":"https://news.google.com/__i/rss/rd/articles/CBMidWh0dHBzOi8vaW5kaWFuZXhwcmVzcy5jb20vYXJ0aWNsZS9zcG9ydHMvY3JpY2tldC9pbmRpYS12cy1zcmktbGFua2EtYXNpYS1jdXAtMjAyMi1zdXBlci00LWxpdmUtc2NvcmUtdXBkYXRlcy04MTM0MzM4L9IBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"India vs Sri Lanka Asia Cup 2022 Super 4 Highlights : SL eke out stunning win, beat India by 6 wickets  The Indian ExpressIndia vs Sri Lanka Live Score, Asia Cup 2022 Live Telecast Channel In India, Live Streaming In India- IND vs SL Live Score, Asia Cup 2022 Live Score  Cricket AddictorAsia Cup News LIVE Updates: Sri Lanka beat India by 6 wickets in Super Four match  Economic TimesIND vs SL Asia Cup 2022 Super 4 Highlights: Sri Lanka beat India by 6 wickets  Zee NewsAsia Cup Super 4: India vs Sri Lanka Today & more updates | The News  DD INDIAView Full coverage on Google News","content":null,"pubDate":"2022-09-06 19:54:06","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Does the Indian team miss Dinesh Karthik? – Expert opinion","link":"https://thenewsglory.com/does-the-indian-team-miss-dinesh-karthik-expert-opinion/","keywords":["Sports","Cricket","Dinesh Karthik","game","India"],"creator":["The News Glory"],"video_url":null,"description":"Dinesh Karthik has been included in the Indian squad for the ongoing Asia Cup series. However, he got a chance in the playing eleven only in the first two matches. He was not given a chance in the playing eleven in the next two matches. In this case, the question has arisen whether the Indian […]","content":"Dinesh Karthik has been included in the Indian squad for the ongoing Asia Cup series. However, he got a chance in the playing eleven only in the first two matches. He was not given a chance in the playing eleven in the next two matches. In this case, the question has arisen whether the Indian team misses him. Former cricketers have commented on it. Let’s see about it. Dinesh Karthik has been batting brilliantly in the death overs lately. His strike rate is 139.95. He has the power to destroy fast bowling in the death overs. A player with amazing form and experience. It was as if the Indian team had a clear plan for his role. But in the last two matches, the players who have played in his playing XI have not been up to the task. Due to that, the Indian team could not bat first and get the expected runs. It is also said that the reason why DK is not in the team is because of Jadeja’s injury. An example of this is the Super 4 match between India and Sri Lanka. A partnership of 97 runs between Rohit and Suryakumar Yadav. However, the Indian batsmen failed to continue the run accumulation from there. This is where India clearly misses Dinesh Karthik. Inzamam – Former Pakistan captain “When Cricket India announced it, I panicked. But looking at the changes being made in the Indian team, they seem to be under pressure. As far as I am concerned, I see that Dinesh Karthik has lost his chance in the playing XI without facing a single ball. Kiran More – Former Indian cricketer “DK has proven himself to be a finisher. It is not fair not to give Dinesh Karthik a chance. He may have been selected in the batting eleven for the right-left batting combination. Robin Uthappa – Former Indian cricketer “I think Dinesh Karthik should be playing in the playing XI. Make him play his role. It is necessary. Deepak Hooda can be played in the No. 5 batsman role played by Rishabh. Because Rishabh has played brilliantly in T20 cricket as a top 4 batsman. “I don’t think he is needed to play in the top 4 position in the Indian team right now,” he said. During the Asia Cup series, India’s Rohit Sharma said that their experiment will continue in this too. Let’s hope the Indian team is working according to that plan now.","pubDate":"2022-09-06 19:09:05","image_url":null,"source_id":"thenewsglory","country":["india"],"category":["sports"],"language":"english"},{"title":"“This is where you miss Dhoni”: Hemang Badani rues absence of MS Dhoni after Rishabh Pant misses crucial last Over run-out opportunity vs Sri Lanka in Dubai","link":"https://thesportsrush.com/cricket-news-this-is-where-you-miss-dhoni-hemang-badani-rues-absence-of-ms-dhoni-after-rishabh-pant-misses-crucial-last-over-run-out-opportunity-vs-sri-lanka-in-dubai/","keywords":["Cricket","asia cup","Asia Cup 2022","Hemang Badani","MS Dhoni","rishabh pant"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Hemang Badani rues absence of MS Dhoni as India lose post a relatively easy run-out opportunity missed by Rishabh Pant versus Sri Lanka. During the ninth match of the ongoing Asia Cup 2022 between India and Sri Lanka at the Dubai International stadium, the Rohit Sharma-led side yet again fell agonizingly short of defending the… The post “This is where you miss Dhoni”: Hemang Badani rues absence of MS Dhoni after Rishabh Pant misses crucial last Over run-out opportunity vs Sri Lanka in Dubai appeared first on The SportsRush.","content":"Hemang Badani rues absence of MS Dhoni as India lose post a relatively easy run-out opportunity missed by Rishabh Pant versus Sri Lanka. During the ninth match of the ongoing Asia Cup 2022 between India and Sri Lanka at the Dubai International stadium, the Rohit Sharma-led side yet again fell agonizingly short of defending the target, to ultimately lose the humdinger of a match by 6 wickets. En route the target of 174, on what appeared to be a challenging pitch to bat on post India’s innings, the opening batting pair of Kusal Mendis (57 off 36) and Pathum Nissanka (52 off 37), literally punctured the Indian spirits, as they stitched together a 97-run stand off mere 67 deliveries. ALSO READ: Can India still qualify for Asia Cup 2022 grand finale? However, India’s premier leg-spinner Yuzvendra Chahal (4-0-34-3) struck thrice within his final two Overs, including those of both the openers, to make a staggering comeback in this do-or-die encounter. Despite it all, this resurgent Sri Lankan side, held on to their nerve, and unbeaten half-century stand for the fifth wicket between skipper Dasun Shanaka (33* off 18) and Southpaw batter Bhanuka Rajapaksa (25* off 17) saw their team home, and make it through to the grand finale. Hemang Badani rues absence of MS Dhoni Bhuvneshwar Kumar (4-0-30-0) yet again bowling a costly penultimate Over (14 runs), with Sri Lanka requiring 21 off the final two Overs. However, left-arm pacer Arshdeep Singh (3.4-0-40-0), yet again bowled a stellar final Over, and took the match to the penultimate delivery while needing to defend mere 7 runs for the second consecutive match in a row. However, with very little luck, and the equation reading 2 runs required off 2 deliveries, both the Sri Lankan batters attempted to sneak in a Bye, after Shanaka failed to get his bat on the ball off the short length delivery bowled by Arshdeep. Unfortunately, despite ample time and three stumps to aim at, wicket-keeper Rishabh Pant failed to hit the target, and with Arshdeep also failing to aim at the Stumps at his end, Sri Lanka completed the two remaining runs, with a ball to spare. Former India batter Hemang Badani took to his Twitter handle, to state that he missed former India skipper and wicket-keeper batter MS Dhoni at the aforementioned crucial juncture of the match, and that no way he (Dhoni) would have missed the run-out opportunity with all the three stumps to aim at. This is where you miss #dhoni. Never seen him miss a run out like this.3 stumps to hit with enough time, no way he would have missed #INDvsSL #AsiaCup2022 — Hemang Badani (@hemangkbadani) September 6, 2022 For more Cricket-related news, click here. The post “This is where you miss Dhoni”: Hemang Badani rues absence of MS Dhoni after Rishabh Pant misses crucial last Over run-out opportunity vs Sri Lanka in Dubai appeared first on The SportsRush.","pubDate":"2022-09-06 18:44:40","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"India cricket loss memes: IND vs SL Twitter reactions and Rohit Sharma memes","link":"https://thesportsrush.com/cricket-news-india-cricket-loss-memes-ind-vs-sl-twitter-reactions-and-rohit-sharma-memes/","keywords":["Cricket","asia cup","Asia Cup 2022","India","Sri Lanka"],"creator":["Dixit Bhargav"],"video_url":null,"description":"India cricket loss memes: The Indian cricket team has registered an embarrassing loss at the Dubai International Cricket Stadium tonight. India have continued their recent trend of playing substandard cricket in multi-nation tournaments. Having lost two Asia Cup 2022 Super 4 matches in a row, India are now all but out of the tournament. Although… The post India cricket loss memes: IND vs SL Twitter reactions and Rohit Sharma memes appeared first on The SportsRush.","content":"India cricket loss memes: The Indian cricket team has registered an embarrassing loss at the Dubai International Cricket Stadium tonight. India have continued their recent trend of playing substandard cricket in multi-nation tournaments. Having lost two Asia Cup 2022 Super 4 matches in a row, India are now all but out of the tournament. Although they still have to play a match, it is highly unlikely for them to qualify for the final. India’s most recent loss has come against Sri Lanka in Dubai after they failed to defend a 174-run target. Barring a minor stretch where they picked four wickets within three overs, Indian bowlers were found wanting against batters way more inexperienced than them. As a result, a 97-run opening partnership between Pathum Nissanka (52) and Kusal Mendis (57) and an unbeaten 64-run fifth-wicket partnership between batter Bhanuka Rajapaksa (25*) and captain Dasun Shanaka (33*) witnessed them sealing their third consecutive run-chase in the tournament. Sri Lanka, who were being talked about peaking at the right moment, have put on display stunning preparations for ICC T20 World Cup 2022 by virtue of these victories. Getting their act together as a unit, Shanaka and his men have been instrumental in qualifying for the final match of Asia Cup 2022. India, on the other hand, have a lot to ponder about amid facing severe criticism for all the right reasons. With valid questions being raised over the Indian squad, Playing XI and captaincy decisions, Rohit Sharma and his men don’t have a lot of time before turning things around ahead of a world event next month. India cricket loss memes BREAKING NEWS: India and TRP knocked out of Asia Cup. — Vipul Goyal (@HumorouslyVipul) September 6, 2022 Pakistani Cricket Fans Right Now!! #INDvsSL pic.twitter.com/lIsuLeQKnr — Natasha (Kitaabiii ) (@MissPinkyciouss) September 6, 2022 team india’s plane ready for departure to mumbai #INDvsSL pic.twitter.com/jMyVR15saX — fatima (@Fatima_i14) September 6, 2022 This is toooo much #INDvsSL pic.twitter.com/dHJcBjWs4O — JahanZaib (@JahanZaibb_) September 6, 2022 India helped Sri Lanka financially to stable their economy just for them to knock India out of Asia Cup pic.twitter.com/bHTkbvF01s — S3 (@Jamesmology) September 6, 2022 BCCI replacing Virat Kohli with Rohit Sharma as Captain #INDvSL #SackRohit pic.twitter.com/LRkWvsrNoy — Pranjal (@Pranjal_one8) September 6, 2022 Rohit sharma’s captaincy – pic.twitter.com/wKbA5aWRlN — prajwal (@normalindianguy) September 6, 2022 Whenever India losses match these days Dhoni Fans: pic.twitter.com/kc8PBDBeLK — Aman_Chain Mask Man (@Amanprabhat9) September 6, 2022 India will be playing their next match against Afghanistan at the same venue on Thursday. The post India cricket loss memes: IND vs SL Twitter reactions and Rohit Sharma memes appeared first on The SportsRush.","pubDate":"2022-09-06 18:38:27","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"IND vs SL Asia Cup 2022 Super 4 Highlights: Sri Lanka beat India by 6 wickets - Zee News","link":"https://news.google.com/__i/rss/rd/articles/CBMinQFodHRwczovL3plZW5ld3MuaW5kaWEuY29tL2NyaWNrZXQvbGl2ZS11cGRhdGVzL2luZGlhLXZzLXNyaS1sYW5rYS10MjBpLWFzaWEtY3VwLTIwMjItc3VwZXItNC10b2RheS1tYXRjaC1oaWdobGlnaHRzLXNyaS1sYW5rYS1iZWF0LWluZGlhLWJ5LTYtd2lja2V0cy0yNTA2NDM50gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"IND vs SL Asia Cup 2022 Super 4 Highlights: Sri Lanka beat India by 6 wickets  Zee NewsIndia vs Sri Lanka Live Score, Asia Cup 2022 Live Telecast Channel In India, Live Streaming In India- IND vs SL Live Score, Asia Cup 2022 Live Score  Cricket AddictorAsia Cup News LIVE Updates: Sri Lanka beat India by 6 wickets in Super Four match  Economic TimesIndia vs Sri Lanka Highlights: SL hold nerves to beat IND by six wickets  Hindustan TimesAsia Cup Super 4: India vs Sri Lanka Today & more updates | The News  DD INDIAView Full coverage on Google News","content":null,"pubDate":"2022-09-06 18:13:14","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Is India out from Asia Cup: If India loses today match what will happen?","link":"https://thesportsrush.com/cricket-news-is-india-out-from-asia-cup-if-india-loses-today-match-what-will-happen/","keywords":["Cricket","asia cup","Asia Cup 2022","India","Sri Lanka"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Is India out from Asia Cup: India have lost both their Asia Cup 2022 Super 4 matches at the Dubai International Cricket Stadium. During the ninth match of Asia Cup 2022 between India and Sri Lanka in Dubai, Sri Lanka beat India by 6 wickets to win their second Super 4 match. India, on the… The post Is India out from Asia Cup: If India loses today match what will happen? appeared first on The SportsRush.","content":"Is India out from Asia Cup: India have lost both their Asia Cup 2022 Super 4 matches at the Dubai International Cricket Stadium. During the ninth match of Asia Cup 2022 between India and Sri Lanka in Dubai, Sri Lanka beat India by 6 wickets to win their second Super 4 match. India, on the other hand, have lost both their Super 4 match thus far. Having sealed a 174-run chase with a ball remaining in the match, Sri Lanka have now managed to win three matches in a row while batting second. With all their three run-chases been in vicinity of 175 runs, Sri Lanka have been phenomenal to peak at exactly the right time. It was a brisk 97-run opening partnership between Pathum Nissanka (52) and Kusal Mendis (57) which set the tone for a Sri Lankan victory. Managing to not lose a wicket in the first 11 overs, Nissanka and Mendis hit a total of eight fours and five sixes between them to leave the Indian bowlers clueless. Tough one to accept that India lost against @OfficialSLC but fact is that Sri Lanka played some brilliant cricket to show they were a better side tonight.. disappointed with our result .. Hmmmmmmm #AsiaCup #INDvsSL @BCCI — Harbhajan Turbanator (@harbhajan_singh) September 6, 2022 India did stage a brief comeback by picking four wickets within three overs but a significant dent didn’t affect batter Bhanuka Rajapaksa (25*) and captain Dasun Shanaka (33*). An unbeaten 33-ball 64-run fifth-wicket partnership between Rajapaksa and Shanaka has all but powered Sri Lanka to the final of the 15th edition of the Asia Cup. Having further strengthened their position at the top of the points table, Sri Lanka now have four points from two matches. Meanwhile, India are yet to get off the mark on the points table with a negative NRR (Net Run Rate) under their belt. Readers must note that the possibility of India playing in the final has decreased by a significant margin after this loss. For India to play the final match at the Dubai International Cricket Stadium on Sunday, they will have to beat Afghanistan on Thursday and hope for Pakistan to lose both their matches. Even then, their NRR will come into play.","pubDate":"2022-09-06 18:10:35","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"IND vs SL | Sri Lanka win by 6 wickets: India out of the series?","link":"https://thenewsglory.com/ind-vs-sl-sri-lanka-win-by-6-wickets-india-out-of-the-series/","keywords":["Sports","Asia Cup","Cricket","game","India"],"creator":["The News Glory"],"video_url":null,"description":"Dubai: India and Sri Lanka played in the Super 4 round of the ongoing Asia Cup series. The Sri Lankan team has won the match by 6 wickets. The match went till the last over. The Sri Lankan team won the toss in this match held at the Dubai Cricket Stadium. Indian team batted first […]","content":"Dubai: India and Sri Lanka played in the Super 4 round of the ongoing Asia Cup series. The Sri Lankan team has won the match by 6 wickets. The match went till the last over. The Sri Lankan team won the toss in this match held at the Dubai Cricket Stadium. Indian team batted first and scored 173 runs. Sri Lanka chased down the target of 174 runs. India played to win this match.","pubDate":"2022-09-06 18:08:05","image_url":null,"source_id":"thenewsglory","country":["india"],"category":["sports"],"language":"english"},{"title":"India vs Sri Lanka Highlights: Sri Lanka Beat India By 6 Wickets, Rohit Sharma's Team India On Brink Of Ouster - NDTV Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMicGh0dHBzOi8vc3BvcnRzLm5kdHYuY29tL2FzaWEtY3VwLTIwMjIvaW5kaWEtdnMtc3JpLWxhbmthLWxpdmUtY3JpY2tldC1zY29yZS1pbmQtdnMtc2wtbGl2ZS1zY29yZS11cGRhdGVzLTMzMjA0NzXSAXZodHRwczovL3Nwb3J0cy5uZHR2LmNvbS9hc2lhLWN1cC0yMDIyL2luZGlhLXZzLXNyaS1sYW5rYS1saXZlLWNyaWNrZXQtc2NvcmUtaW5kLXZzLXNsLWxpdmUtc2NvcmUtdXBkYXRlcy0zMzIwNDc1L2FtcC8x?oc=5","keywords":null,"creator":null,"video_url":null,"description":"India vs Sri Lanka Highlights: Sri Lanka Beat India By 6 Wickets, Rohit Sharma's Team India On Brink Of Ouster  NDTV SportsIndia vs Sri Lanka Live Score, Asia Cup 2022 Live Telecast Channel In India, Live Streaming In India- IND vs SL Live Score, Asia Cup 2022 Live Score  Cricket AddictorAsia Cup Super 4: India vs Sri Lanka Today & more updates | The News  DD INDIAIndia vs Sri Lanka Highlights: SL hold nerves to beat IND by six wickets  Hindustan TimesIndia vs Sri Lanka - Free Hit 20-20 | Match Preview | #AsiaCup2022 | All India Radio  Prasar Bharati SportsView Full coverage on Google News","content":null,"pubDate":"2022-09-06 18:05:09","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Asia Cup 2022: India face Super 4 elimination after another final over defeat as Sri Lanka chase down 174 - India Today","link":"https://news.google.com/__i/rss/rd/articles/CBMikAFodHRwczovL3d3dy5pbmRpYXRvZGF5LmluL3Nwb3J0cy9jcmlja2V0L3N0b3J5L2FzaWEtY3VwLTIwMjItaW5kaWEtaW4tZGFuZ2VyLW9mLXN1cGVyLTQtZXhpdC1hZnRlci02LXdpY2tldC1sb3NzLXRvLXNyaS1sYW5rYS0xOTk3MjQ3LTIwMjItMDktMDbSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Asia Cup 2022: India face Super 4 elimination after another final over defeat as Sri Lanka chase down 174  India TodayIndia vs Sri Lanka Live Score, Asia Cup 2022 Live Telecast Channel In India, Live Streaming In India- IND vs SL Live Score, Asia Cup 2022 Live Score  Cricket AddictorAsia Cup News LIVE Updates: Sri Lanka beat India by 6 wickets in Super Four match  Economic TimesAsia Cup Super 4: India vs Sri Lanka Today & more updates | The News  DD INDIAIndia vs Sri Lanka Highlights: SL hold nerves to beat IND by six wickets  Hindustan TimesView Full coverage on Google News","content":null,"pubDate":"2022-09-06 17:46:35","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"The biggest brand in cricket around the world is IPL: David Gower","link":"https://www.thehindubusinessline.com/news/sports/the-biggest-brand-in-cricket-around-the-world-is-ipl-david-gower/article65858982.ece","keywords":null,"creator":["\n        Chitra Narayanan  \n    "],"video_url":null,"description":"The former stylish southpaw talks about money, branding and how IPL is defining cricket now","content":"Former cricketers Dilip Vengsarkar and David Gower during a panel discussion on the evolution of Cricket at the International Advertising Association’s Global Summit on Nations. The mops of angelic golden hair are gone – replaced by thinning silver strands, but the devastating charm is intact as David Gower, cricket’s most stylish southpaw takes the stage to talk about the game’s evolution into a big branded sport. The charismatic cricketer who had equally successful innings as a television commentator draws a chuckle from the audience when he starts off by talking about the number of lovely people he met in India over the last couple of days who talked to him about cover drives, and cuts but had one question. “Where is the hair?” “I apologise. Nature does things to all. The acres and acres of fluffy blond hair are gone. Take me as I am now, please,” he pleads. The event is the International Advertising Association’s Global Summit on Nations as Brands and Gower lucidly talks about Brand Cricket and the shift of power from England, its home, to India. The title of his talk ‘From Autograph to Photograph’ says it all. Just as today fans rarely whip out a pen to get signatures choosing a selfie with the star instead, the gentleman’s game has moved from the leisurely field to a television-driven billion-dollar spectator sport. Gower acknowledged how India drives the game today. “There is absolutely no denying that if you talk about cricket and if you talk about money, the first place you think about is India, where the entire business of cricket has changed the face of the game, the nature of it, and spread it around the world. The power lies here in India,” he said. And undeniably one platform has changed it all. “The biggest brand in cricket around the world is spelt with three very big capital letters – IPL,” he said emphatically. “The single world I can use to describe IPL is ‘Phenomenal’. From a competition people were suspicious about, today it is revered around the world. The success of IPL is there to see,” he said. The elegant Englishman noted, “In the early years IPL brought in big names like Shane Warne, Hayden, Gilchrist who gave it star quality. Now the situation is different. In order to be in IPL you have to be young, vibrant, and a big performer. It has brought many young Indian players to the foreground. “ Gower said the defining year for the shift in the game’s power was undoubtedly 1983 – the year India won the Prudential World Cup. “On India’s magnificent win in 1983, I would like to hold up my hand and say that I feel largely responsible. You might ask why. Well, if you go back to the day in the summer of 1983 when England played India in the semi-finals, we were favourites to win the game. I was averaging 70 plus in the tournament but in that game, I was caught Kirmani, bowled Amarnath for 17, and from that point, India’s win in the semi-finals was guaranteed,” points Gower. “1983 was the genesis of the belief in the entire nation of India on the one day game,” he said. Gower said that the timing of his career was “nigh on perfect” as the ability of cricket players to earn money was starting at that time. Kerry Packer had just happened around the time Gower made his debut at age 21. “If you were an England cricketer in 1977, you played a five-day game for 200 pounds, in other words English players took on the likes of Dennis Lillee and Jeff Thomson almost for free. You played for honour, you played for the challenge, you played for all kinds of amateurish reasons. In 1978, the year I made my debut, the fee had gone up by five times to 1,000 pounds,” he recalled. This was thanks to Cornhill Insurance sponsoring the English cricket team. “My first test match concluded with the start of sponsorship. This was the first experience we had of branding of the centuries-old game,” he pointed out. As an aside, he remarks how from insurance companies sponsoring the English team, now they have an online used car marketplace, Cinch, as a sponsor. In those early days, Gower pointed out how the tour fees barely covered the cost of a bottle of French wine in a country like India. Former Indian cricketer Dilip Vengsarkar, who joined him on stage for a panel discussion on the evolution of the game, also had amusing stories to share about small cheques and huge fines in the days when big money was yet to make inroads into cricket. In 1989, after the tour of the West Indies, Vengsarkar played a couple of exhibition matches in the US and was fined by BCCI to the tune of ₹50,000. “I was actually contemplating a loan to pay the fine,” disclosed Vengsarkar. On the future of cricket , Gower bats for balance. While the shorter formats have brought in spectators, sponsors, and money, the five-day game needs to be kept alive. “Just as we blend the paper, the pen, and the mobile phone, we need to keep all formats of the game intact,” he concluded.","pubDate":"2022-09-06 17:21:51","image_url":null,"source_id":"thehindubusinessline","country":["india"],"category":["sports"],"language":"english"},{"title":"IND vs SL, Asia Cup 2022 Super 4 Live Score Updates: India set up exciting finish in final overs - India Today","link":"https://news.google.com/__i/rss/rd/articles/CBMiigFodHRwczovL3d3dy5pbmRpYXRvZGF5LmluL3Nwb3J0cy9jcmlja2V0L3N0b3J5L2luZGlhLXZzLXNyaS1sYW5rYS1hc2lhLWN1cC0yMDIyLXN1cGVyLTQtbGl2ZS1zY29yZS11cGRhdGVzLWluZC1zbC1kdWJhaS0xOTk3MTI2LTIwMjItMDktMDbSAY4BaHR0cHM6Ly93d3cuaW5kaWF0b2RheS5pbi9hbXAvc3BvcnRzL2NyaWNrZXQvc3RvcnkvaW5kaWEtdnMtc3JpLWxhbmthLWFzaWEtY3VwLTIwMjItc3VwZXItNC1saXZlLXNjb3JlLXVwZGF0ZXMtaW5kLXNsLWR1YmFpLTE5OTcxMjYtMjAyMi0wOS0wNg?oc=5","keywords":null,"creator":null,"video_url":null,"description":"IND vs SL, Asia Cup 2022 Super 4 Live Score Updates: India set up exciting finish in final overs  India TodayIndia vs Sri Lanka Live Score, Asia Cup 2022 Live Telecast Channel In India, Live Streaming In India- IND vs SL Live Score, Asia Cup 2022 Live Score  Cricket AddictorIndia vs Sri Lanka Live Score: Yuzvendra Chahal's triple rattles SL top order  Hindustan TimesAsia Cup Super 4: India vs Sri Lanka Today & more updates | The News  DD INDIAIndia vs Sri Lanka Live Cricket Score Asia Cup 2022 Super Four: Chahal Triple-strike Leaves SL Wobbling in  News18View Full coverage on Google News","content":null,"pubDate":"2022-09-06 17:13:54","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"IND vs SL | Rohit – Suryakumar combination is amazing; 174 runs target for Sri Lanka","link":"https://thenewsglory.com/ind-vs-sl-rohit-suryakumar-combination-is-amazing-174-runs-target-for-sri-lanka/","keywords":["Sports","Asia Cup","Cricket","game","India","Rohit Sharma"],"creator":["The News Glory"],"video_url":null,"description":"Dubai: Indian cricket team has accumulated 173 runs against Sri Lanka. Players like Rahul and Kohli returned to the pavilion as fast as they came at the start. However, captain Rohit and Suryakumar Yadav rescued the team from that crisis by forming a partnership. India and Sri Lanka are playing in the Super 4 round […]","content":"Dubai: Indian cricket team has accumulated 173 runs against Sri Lanka. Players like Rahul and Kohli returned to the pavilion as fast as they came at the start. However, captain Rohit and Suryakumar Yadav rescued the team from that crisis by forming a partnership. India and Sri Lanka are playing in the Super 4 round match of the ongoing Asia Cup series. The match is being held at the Dubai Cricket Stadium. The Sri Lankan team won the toss and chose to bowl. So the Indian team batted first.","pubDate":"2022-09-06 17:07:04","image_url":null,"source_id":"thenewsglory","country":["india"],"category":["sports"],"language":"english"},{"title":"Cricket-Pope backs Brook to make England impact if selected","link":"https://www.thestar.com.my/sport/cricket/2022/09/07/cricket-pope-backs-brook-to-make-england-impact-if-selected","keywords":null,"creator":null,"video_url":null,"description":"LONDON (Reuters) - England batsman Ollie Pope says Jonny Bairstow, one of the team’s top performers of the summer, will be missed in the decisive third test against South Africa at The Oval, but has backed Harry Brook to rise to the occasion if selected. Read full story","content":"LONDON (Reuters) - England batsman Ollie Pope says Jonny Bairstow, one of the team’s top performers of the summer, will be missed in the decisive third test against South Africa at The Oval, but has backed Harry Brook to rise to the occasion if selected. Uncapped Brook is expected to come into the middle order to replace Bairstow, who was injured while playing golf last week. \"It's disappointing for us all,\" Pope told reporters on Tuesday. \"A freak incident took place and he's had an amazing summer. \"He's been amazing to watch and he's amazing around the lads, but it also provides an opportunity for whoever is coming in, so that's an exciting chance as well. \"We're going to miss him, but at the same time, we've got enough guys who've been around a long time to feed off each other. The energy has been so good around the lads as well, so I'm sure we'll make up for his lost voice in the field.\" Ben Duckett has been brought into the squad for the series decider that starts on Thursday. Yet with Brook having waited patiently for his chance, it is likely he will be selected, especially after scoring 140 off 170 balls for England Lions against the tourists ahead of the series. \"I've been on Under-19 tours with Harry, and I've played with him since I was 18 years old, and he's a seriously good player,\" Pope said. \"He's obviously been in ridiculous form this year and he's 100 percent got the game to go out and take that into Test cricket as well. \"He's got the mindset, he loves batting and he's all cricket as well, so I'm excited for him if he does get that opportunity this week. He's a top player and an exciting prospect.\" (Reporting by Nick Said; Editing by Toby Davis)","pubDate":"2022-09-06 16:27:00","image_url":"https://apicms.thestar.com.my/uploads/images/2022/09/07/1727374.jpg","source_id":"thestar_my","country":["malaysia"],"category":["sports"],"language":"english"},{"title":"David Gower uncut on cricket, cheques and sponsorships","link":"https://sportstar.thehindu.com/cricket/david-gower-ipl-business-broadcast-branding-money-indian-cricket-profit/article65858718.ece","keywords":null,"creator":["\n        Chitra Narayanan  \n    "],"video_url":null,"description":"The stylish southpaw on money, branding and how IPL is defining cricket now","content":"The mops of angelic golden hair are gone – replaced by thinning silver strands, but the devastating charm is intact as David Gower, cricket’s most stylish southpaw takes the stage to talk about the game’s evolution into a big branded sport. But first, the charismatic cricketer who had an equally successful innings as a television commentator, draws a chuckle from the audience when he starts off by talking about the number of lovely people he met in India over the last couple of days who talked to him about cover drives, and cuts but had one question. “Where is the hair?” “I apologise. Nature does things to all. The acres and acres of fluffy blond hair are gone. Take me as I am now, please,” he pleads. The event is the International Advertising Association’s Global Summit on Nations as Brands and Gower lucidly holds forth on Brand Cricket and the shift of power from England, its home, to India. The title of his talk ‘From Autograph to Photograph’ says it all. Just as today fans rarely whip out a pen to get signatures choosing a selfie with the star instead, the gentleman’s game has moved from the leisurely field to a television-driven billion dollar spectator sport. Gower acknowledged how India drives the game today. “There is absolutely no denying that if you talk about cricket and if you talk about money, the first place you think about is India, where the entire business of cricket has changed the face of the game, the nature of it, and spread it around the world. The power lies here in India,” he said. And undeniably one platform has changed it all. “The biggest brand in cricket around the world is spelt with three very big capital letters – IPL,” he said emphatically. “The single world I can use to describe IPL is ‘Phenomenal’. From a competition people were suspicious about, today it is revered around the world. The success of IPL is there to see,” he said. The elegant Englishman noted, “In the early years IPL brought in big names like Shane Warne, Hayden, Gilchrist who gave it star quality. Now the situation is different. In order to be in IPL you have to be young, vibrant, and a big performer. It has brought many young Indian players to the foreground. “ Gower said the defining year for the shift in the game’s power was undoubtedly 1983 – the year India won the Prudential World Cup. \"The biggest brand in cricket is spelt with three very big capital letters – IPL. From a competition people were suspicious about, today it is revered around the world.\" David Gower ( @David215Gower ) uncut on cricket, cheques and sponsorships 👉 https://t.co/oiwi7TU0zE ✍️ @ndcnn pic.twitter.com/bYKcVLMhze “On India’s magnificent win in 1983, I would like to hold up my hand and say that I feel largely responsible . You might ask why. Well, if you go bac to the day in the summer of 1983 when Egnland played India in the semi-finals, we were favourites to win the game. I was averaging 70 plus in the tournament but in that game I was caught Kirmani , bowled Amarnath for 17, and from that point India’s win in the semi-finals was guaranteed,” points Gower. “1983 was the genesis of the belief in the entire nation of India on the one day game,” he said. The advent of money Gower said that the timing of his career was “nigh on perfect” as the ability of cricket players to earn money was starting at that time. Kerry Packer had just happened around the time Gower made his debut at age 21. “If you were an England cricketer in 1977, you played a five-day game for 200 pounds, in other words English players took on the likes of Dennis Lillee and Jeff Thomson almost for free. You played for honour, you played for the challenge, you played for all kinds of amateurish reasons. In 1978, the year I made my debut, the fee had gone up by five times to 1,000 pounds,” he recalled. This was thanks to Cornhill Insurance sponsoring the English cricket team. “My first test match concluded with the start of sponsorship. This was the first experience we had of branding of the centuries old game,” he pointed out. As an aside, he remarks how from insurance companies sponsoring the English team, now you had an online used car marketplace, Cinch, as a sponsor In those early days, Gower pointed out how the tour fees barely covered the cost of a bottle of French wine in a country like India. Former Indian cricketer Dilip Vengsarkar, who joined him on stage for a panel discussion on the evolution of the game, also had amusing stories about small cheques and huge fines in the days when big money was yet to make inroads into cricket. In 1989, after the tour of West Indies, Vengsarkar played a couple of exhibition matches in the US and was fined by BCCI to the tune of Rs 50,000. “I was actually contemplating a loan to pay the fine,” disclosed Vengsarkar. On the future of the game, Gower bats for balance. While the shorter formats have brought in spectators, sponsors and money, the five day game needs to be kept alive. “Just as we blend the paper, the pen and the mobile phone, we need to keep all formats of the game intact,” he concluded. Read more stories on Cricket.","pubDate":"2022-09-06 16:04:04","image_url":null,"source_id":"sportstar","country":["india"],"category":["sports"],"language":"english"},{"title":"India vs Sri Lanka: Asia Cup, 2022 Live Cricket Score, Live Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/india-vs-sri-lanka-live-score-over-super-four-match-3-t20-16-20-updates-3321507","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between India vs Sri Lanka from Dubai International Cricket Stadium, Dubai. Check commentary and full scoreboard of the match.","content":"Follow the Asia Cup, 2022 live cricket score on Sports.NDTV.com . After 20.0 overs, India are 173/8. Get live score, ball by ball commentary and much more. Keep track of Asia Cup, 2022 today match between India and Sri Lanka. Everything related to India and Sri Lanka match will be available on Sports.NDTV.com . Stay updated with India vs Sri Lanka live score. Do check for India vs Sri Lanka scorecard. You can get scorecard updates, match related facts. Get quick live updates with ads, Sports.NDTV.com , which is the perfect destination for live cricket score. Sri Lanka were brilliant with the new ball and at the death but they would be disappointed with way they went about their business in the middle overs. They let Indian off the hook after taking two early wickets as their spinners, especially Wanindu Hasaranga had an off day today. However, young Dilshan Madushanka was brilliant both at the start and at the death and got three important wickets. Chamika Karunaratne also took two wickets and skipper, Dasun Shanaka was expensive but got two big wickets. Maheesh Theekshana got a solitary wicket of Rohit Sharma. Overall, a decent performance from the Lankans and they need to bat well now to chase this total. They have done that in the last two games and it would be interesting to see how they go about their business tonight. Stay tuned for the run-chase! India's start with the bat was not ideal as they lost two big wickets of Rahul and Kohli inside the first three overs. However, Rohit Sharma was in his elements today and never let the Sri Lankan bowlers dominate the proceedings. He smashed 72 runs from just 41 balls and was supported well by Yadav. The 97-run stand was broken in the 13th over when Rohit got out and after that India lost their way a bit. There were some decent contributions but India lost way too may wickets in the death overs and ended with 173 on the board. A very good finish by Sri Lanka at the death! At one stage, India look all set to get at least over 180 here but Sri Lanka got wickets at regular intervals in the end and have taken the momentum with them going into the second half. India still have got runs on the board and that can be crucial in a big game like this. 19.6 overs (2 Runs) Dropped! Slightly shorter and on off, Ravichandran Ashwin smashes it but mistimes it completely. The ball carries towards long on where Wanindu Hasaranga drops a sitter. They collect two. India end their innings for 173/8. 19.5 overs (6 Runs) SIX! Good shot. On a length and on off, Ravichandran Ashwin hangs back and heaves it over deep mid-wicket for a maximum. Important runs for India. 19.4 overs (1 Run) Fuller and on off, Arshdeep Singh hits it towards mid on and calls for one. The fielder has a shy at the non striker's end but misses. A direct hit and Arshdeep Singh was a goner. Arshdeep Singh is the next batter in. 19.3 overs (0 Run) OUT! BOWLED! Another one bites the dust. India lose their eighth wicket. This is fuller and on leg, slower too, Bhuvneshwar Kumar is too early to swing at it and misses. The ball hits the stumps and Bhuvneshwar Kumar walks out for a duck. 19.2 overs (1 Run) Shorter and on middle, Ravichandran Ashwin plays it towards long on for one. 19.1 overs (2 Runs) Fuller and outside off, Ravichandran Ashwin slices it into the gap through point. The fielder chases it well. They take two runs. Who will bowl the last over? It will be Chamika Karunaratne. 18.6 overs (0 Run) An end to an excellent over. Two wickets off it. Fuller and outside off, Bhuvneshwar Kumar looks to play at it but misses. Dot! 18.5 overs (1 Run) Bowls it outside off this time, Ravichandran Ashwin eases it to point for one. 18.4 overs (2 Runs) Fuller and on off, Ravichandran Ashwin flicks it to mid-wicket for a brace. Bhuvneshwar Kumar is the next batter in. 18.3 overs (0 Run) OUT! CAUGHT! This one is slightly shorter and on off, Rishabh Pant pulls it but mistimes it completely. The ball carries towards deep mid-wicket towards Pathum Nissanka who takes it easily. Dilshan Madushanka gets his third wicket! 18.2 overs (1 Run) Fuller one, outside off, Ravichandran Ashwin guides it to backward point for one. Ravichandran Ashwin is the next batter in. 18.1 overs (0 Run) OUT! TIMBER! Bowls it fuller and on the middle, Deepak Hooda moves to his off side to scoops it but misses. The ball knocks over the middle pole and Deepak Hooda has to walk away this time. Superb bowling from Dilshan Madushanka. 17.6 overs (2 Runs) Fuller one, on off, Rishabh Pant drills it to long off. The fielder does well at the boundary line. They collect a couple of runs. 17.6 overs (1 Run) Wide! Bowls it wide outside off, Rishabh Pant looks to play at it but misses. 17.5 overs (1 Run) Fuller and on off, Deepak Hooda drives it to covers for one. 17.4 overs (2 Runs) An attempted yorker but ends up bowling a low full toss. Deepak Hooda gets on his knee and swings it. The fielder does well at deep backward square leg. They collect two. 17.4 overs (1 Run) NO BALL! Oh, this is unbelievable! Sri Lankan players will feel that this is a harsh call. Dasun Shanaka bowls it short and around off. Hooda rides the bounce and slices it straight to the short third man fielder. He takes the catch and Lankan players start celebrating. However, the umpire decides to check for the height of the delivery. The wide ball was the first bouncer of the over and the replays roll in and the it is signalled as a no ball for height. So, Deepak Hooda survives and it will be Free Hit coming up as well now. 17.4 overs (1 Run) WIDE! Goes fuller and down the leg side. Hooda looks to flick it but misses. Deepak Hooda is the next batter in. 17.3 overs (0 Run) OUT! CAUGHT! The skipper gets his second wicket. This one lands fuller and on off, Hardik Pandya heaves it but doesn't get the power right. The ball carries towards deep mid-wicket. Pathum Nissanka settles under it and pouches it in safe hands. This is an important wicket for Sri Lanka at this stage in the game! 17.2 overs (2 Runs) Fuller and on off, Hardik Pandya flicks it to deep mid-wicket for a brace. 17.2 overs (1 Run) Wide! Shorter and on leg, Hardik Pandya leaves it alone. 17.1 overs (6 Runs) SIX! Into the crowd. Fuller and on off, slower too, Hardik Pandya lofts it over long off for a maximum. Excellent timing. Dasun Shanaka is back on. 16.6 overs (1 Run) Fuller and on off, Hardik Pandya hits it but gets a bottom edge towards mid on. They collect one. 16.5 overs (1 Run) Darts it on middle, Rishabh Pant awkwardly sweeps it to square leg for one. 16.4 overs (0 Run) Flatter and on middle, Rishabh Pant sweeps it but finds the fielder at square leg. Dot. 16.3 overs (1 Run) Bowls fuller and outside off, Hardik Pandya knocks it to mid off for one again. 16.2 overs (1 Run) Fuller again, on middle, Rishabh Pant sweeps it to square leg for one. 16.1 overs (1 Run) Wanindu Hasaranga bowls it fuller and on off, Hardik Pandya guides it to covers for one. 15.6 overs (0 Run) Another dot. Fuller and on off, Rishabh Pant eases it to covers. 15.5 overs (0 Run) Another one outside off, Rishabh Pant cuts it but finds the fielder at point. 15.4 overs (1 Run) Bowls it outside off, Hardik Pandya eases it to mid off for one again. 15.3 overs (1 Run) Fuller one this time, Rishabh Pant flicks it to mid-wicket for one. 15.2 overs (4 Runs) FOUR! Slightly shorter and down the leg side, Rishabh Pant pulls it hard and through deep mid-wicket for a boundary. 15.2 overs (1 Run) Wide! This one lands outside leg, Rishabh Pant looks to slog sweep it but misses. 15.1 overs (1 Run) Maheesh Theekshana bowls it fuller and on off, Hardik Pandya knocks it to long off for one.","pubDate":"2022-09-06 15:59:52","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637980965834225601.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Keep cricket free from personal attacks: Tendulkar to fans after Arshdeep Singh’s online abuse","link":"https://indianexpress.com/article/sports/cricket/sachin-tendulkar-backs-arshdeep-singh-8134997/","keywords":["Cricket","Sports"],"creator":null,"video_url":null,"description":null,"content":"Batting legend Sachin Tendulkar on Tuesday backed Arshdeep Singh and urged the fans to keep cricket “free from personal attacks” after the young pacer faced vitriolic online abuse in the aftermath of India’s five-wicket loss to Pakistan in the Asia Cup. Every athlete representing the country gives their best and plays for the nation always. They need our constant support & remember, that in sports you win some & you lose some. Let’s keep cricket or any other sport free from personal attacks. @arshdeepsinghh keep working hard.. — Sachin Tendulkar (@sachin_rt) September 6, 2022 The 23-year-old left-arm pacer was vehemently criticised and trolled on social media for spilling a catch in the crucial Super 4 clash against Pakistan in the Asia Cup in Dubai on Sunday. “Every athlete representing the country gives their best and plays for the nation always. They need our constant support & remember, that in sports you win some & you lose some. Let’s keep cricket or any other sport free from personal attacks. @arshdeepsinghh keep working hard,” Tendulkar tweeted. “and give the best reply by performing on the field. I am keenly following you. My best wishes.” Arshdeep had dropped a catching chance at short third man off spinner Ravi Bishnoi ’s bowling in the 18th over to hand a life to Pakistan batter Asif Ali during a tricky chase. The pacer, however, quickly regained his composure and trapped Ali in front of wicket with a perfect yorker in the final over after senior pacer colleague Bhuvneshwar Kumar bled 19 runs in the penultimate over. However, such was the vitriol, that some fans hacked and edited Arshdeep’s wikipedia page, adding the objectionable term “Khalistani” by his name. The hacker changed Arshdeep’s named to Major Arshdeep Singh Langra and then Major Arshdeep Singh Bajwa. Soon corrective measures were taken and the page was restored to its original form. Among other cricketers, Virat Kohli , Harbhajan Singh and Irfan Pathan too backed the young seamer.”Under pressure, anyone can make a mistake. Subscriber Only Stories View All Premium UPSC Key-September 6, 2022: Why you should read ‘Urban Flooding’ or ‘PM-S... Premium Across aisles, UP MLAs reach out to each other – as doctors, engineers, M... Premium Why Amit Shah’s Mumbai visit is so significant for BJP Premium ‘My Dear Comrade’ Vijayan to ‘my brother’ Rahul t... Subscribe Now to get 66% OFF Top Sports News Now India vs Sri Lanka Asia Cup 2022 Super 4 Live Score Updates Who is Frances Tiafoe ? The Nadal slayer in US Open Dropped by Man United, Maguire an issue for England Click here for more It’s a big match and the situation was tight,” Kohli had said during the post-match press conference. “I remember when I first played in the Champions Trophy. Against Pakistan, I remember I hit a very bad shot off Shahid Afridi . Till 5 am next morning, I was only staring at the ceiling, unable to sleep.”I thought I’ll never get a game again, my career is over. So it’s natural to feel like this.”","pubDate":"2022-09-06 15:47:02","image_url":null,"source_id":"indianexpress","country":["india"],"category":["sports"],"language":"english"},{"title":"“Hitman is on song”: R Vinay Kumar rejoices as Rohit Sharma scores 28th T20I half-century vs Sri Lanka in Dubai","link":"https://thesportsrush.com/cricket-news-hitman-is-on-song-r-vinay-kumar-rejoices-as-rohit-sharma-scores-28th-t20i-half-century-vs-sri-lanka-in-dubai/","keywords":["Cricket","asia cup","Asia Cup 2022","India","R Vinay Kumar","Rohit Sharma","Sri Lanka"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Rohit Sharma scores 28th T20I half-century: The Indian captain led from the front to bat at a strike rate of 175.60 tonight. During the ninth match of Asia Cup 2022 between India and Sri Lanka in Dubai, India captain Rohit Sharma scored his 28th T20I half-century to lay a solid foundation for the batters to… The post “Hitman is on song”: R Vinay Kumar rejoices as Rohit Sharma scores 28th T20I half-century vs Sri Lanka in Dubai appeared first on The SportsRush.","content":"Rohit Sharma scores 28th T20I half-century: The Indian captain led from the front to bat at a strike rate of 175.60 tonight. During the ninth match of Asia Cup 2022 between India and Sri Lanka in Dubai, India captain Rohit Sharma scored his 28th T20I half-century to lay a solid foundation for the batters to follow him. Opening the batting with KL Rahul (6), Sharma was stranded at the other end when Rahul and former captain Virat Kohli (0) were dismissed at the start of the innings. Dominated by Sharma, it was a 97-run third-wicket partnership between Sharma and Suryakumar Yadav (34) which put India back on track. It was in the fourth over of the innings when Sharma hit Sri Lanka all-rounder Chamika Karunaratne over mid-on for his first boundary of the match. Not looking to tinker with his approach by playing the waiting game to play a rescue act, Sharma targeted Sri Lanka pacer Asitha Fernando in the following over by hitting a six and a four. Having hit a boundary off spinner Maheesh Theekshana in the last over of the powerplay, Sharma once again attacked Fernando by hitting a six and a four in his second over. It was in this over that Sharma crossed the 50-run mark at the halfway mark. Sharma’s final assaulting move had come against all-rounder Wanindu Hasaranga when he hit the leg-spinner for two sixes and a four in the 12th over. It was in the next over that Sharma hit a Karunaratne delivery straight to Pathum Nissanka at sweeper cover. While Sharma’s innings was treated as a delight by one and all, former India pacer R Vinay Kumar, in particular, took to social media platform Twitter to notice Sharma’s flow at the Dubai International Cricket Stadium. Hitman is on song 🤩 #RohitSharma #AsiaCup2022 — Vinay Kumar R (@Vinay_Kumar_R) September 6, 2022 In what was Sharma’s maiden T20I half-century against Sri Lanka, it was his second in 2022, third in the UAE, ninth as captain, 11th at a neutral venue, 15th in Asia and 23rd as an opening batter. In addition to playing 22 ODIs and eight T20Is in the same Indian Playing XI between 2010-2013, Sharma and Kumar have also worked together at Mumbai Indians. Apart from representing Indians under Sharma between 2015-2017, Kumar had joined them as part of the Talent Scout team last year.","pubDate":"2022-09-06 15:40:50","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Keep cricket free from personal attacks: Sachin to fans after Arshdeep's online abuse","link":"https://timesofindia.indiatimes.com/sports/cricket/asia-cup/keep-cricket-free-from-personal-attacks-sachin-tendulkar-to-fans-after-arshdeep-singhs-online-abuse/articleshow/94034385.cms","keywords":null,"creator":null,"video_url":null,"description":"Batting legend Sachin Tendulkar on Tuesday backed Arshdeep Singh and urged the fans to keep cricket \"free from personal attacks\" after the young pacer faced vitriolic online abuse in the aftermath of India's five-wicket loss to Pakistan in the Asia Cup.","content":null,"pubDate":"2022-09-06 15:22:59","image_url":null,"source_id":"toi","country":["india"],"category":["sports"],"language":"english"},{"title":"India vs Sri Lanka Live Cricket Score Asia Cup 2022 Super Four: Rohit Sharma Hits Fluent Fifty to Drive IND - News18","link":"https://news.google.com/__i/rss/rd/articles/CBMiuQFodHRwczovL3d3dy5uZXdzMTguY29tL2NyaWNrZXRuZXh0L25ld3MvaW5kaWEtdnMtc3JpLWxhbmthLWxpdmUtc2NvcmUtY3JpY2tldC11cGRhdGVzLXN0cmVhbWluZy10MjAtYXNpYS1jdXAtMjAyMi1zdXBlci1mb3VyLWluZC12cy1zbC1sYXRlc3Qtc2NvcmVjYXJkLXRvZGF5LWR1YmFpLWxpdmVuZXdzLTU5MDIyOTEuaHRtbNIBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"India vs Sri Lanka Live Cricket Score Asia Cup 2022 Super Four: Rohit Sharma Hits Fluent Fifty to Drive IND  News18India v Sri Lanka, Super 4, Match 3: Preview  CricbuzzMatch Preview - India vs Sri Lanka, Asia Cup 2022, 9th Match, Super Four  ESPNcricinfoAsia Cup Super 4: India vs Sri Lanka Today & more updates | The News  DD INDIAIND vs SL Asia Cup 2022 Super 4 LIVE: Rohit Sharma departs for 72  Zee NewsView Full coverage on Google News","content":null,"pubDate":"2022-09-06 15:14:20","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Srinath waiting for the train… an old photo that went viral!","link":"https://thenewsglory.com/srinath-waiting-for-the-train-an-old-photo-that-went-viral/","keywords":["Sports","Fast bowler","Former cricketer","Indian team","Javagal Srinath","Karnataka","Shri Nath","Social networking sites"],"creator":["The News Glory"],"video_url":null,"description":"An old photo of Indian cricket team’s former fast bowler Srinath is currently going viral on social media. In particular, the photo is celebrated by netizens for its simplicity. Former fast bowler Srinath is known as an unforgettable face among Indian fast bowlers. Srinath, who retired from cricket in 2003, is currently working as an […]","content":"An old photo of Indian cricket team’s former fast bowler Srinath is currently going viral on social media. In particular, the photo is celebrated by netizens for its simplicity. Former fast bowler Srinath is known as an unforgettable face among Indian fast bowlers. Srinath, who retired from cricket in 2003, is currently working as an umpire in one-day internationals. A photo of him waiting for a train in 2017 is currently going viral. The picture was shared by a LinkedIn user named Ashu Singh. It said, “This is Javagal Srinath… waiting for his train at Mysore railway station. What you think is true. This great bowler is also simple. One of the best bowlers of our generation.” Following this, the photo went viral on social media. Netizens are praising Srinath’s simplicity and sharing the film. Srinath has taken 236 wickets in 67 Tests and 315 wickets in 229 ODIs.","pubDate":"2022-09-06 15:05:05","image_url":null,"source_id":"thenewsglory","country":["india"],"category":["sports"],"language":"english"},{"title":"Four-time world champion Sebastian Vettel claims athletes are discouraged to speak about Mental Health","link":"https://thesportsrush.com/f1-news-140-million-worth-world-champion-claims-athletes-are-discouraged-to-speak-about-mental-health/","keywords":["F1","Sebastian Vettel"],"creator":["Vachan Nandakumar Giriyapur"],"video_url":null,"description":"Sebastian Vettel has recently said that sports stars have been discouraged from publicly speaking about their mental health. Sebastian Vettel, four-time world champion, said that sports stars are discouraged from speaking about their mental health. The German recently announced his retirement from Formula 1 at the end of the 2022 season. Vettel said there is… The post Four-time world champion Sebastian Vettel claims athletes are discouraged to speak about Mental Health appeared first on The SportsRush.","content":"Sebastian Vettel has recently said that sports stars have been discouraged from publicly speaking about their mental health. Sebastian Vettel, four-time world champion, said that sports stars are discouraged from speaking about their mental health. The German recently announced his retirement from Formula 1 at the end of the 2022 season. Vettel said there is “no superman” in how athletes deal with self-doubt. He also believes that sports would display more humility if more open conversations were involved. ‘ The German told the media: “If I’ve learned anything its you’re never alone with the thoughts you have. And you’re not the first one to have these thoughts”. Vettel has been an ambassador for Formula 1 in other important issues. Speaking about mental health will add to his admirable list. In recent years, the four-time world champion has been outspoken over issues such as diversity and racism in sports. Vettel has also brought light to the deteriorating environmental issues in the world. Vettel will surely be a huge loss to Formula 1, not only on track but off track as well. Sebastian Vettel on the cover of “Road and Track” Magazine #Seb5 #Vettel #RoadandTrack #F1 pic.twitter.com/JkWA7jQIbv — out of context Sebastian Vettel (@ocsebvettel) September 6, 2022 Also Read: Formula E winner accuses 53 GP winner Sebastian Vettel of ‘greenwashing’ Sebastian Vettel says not speaking out is a sign of “weakness in our society” Sebastian Vettel is not the first Formula 1 driver to discuss the topic of mental health. Lewis Hamilton and Lando Norris have opened up about the topic. The British duo also revealed that they underwent therapy to deal with their issues. Other athletes that have spoken on the topic are tennis star Emma Raducanu and cricket stars Ben Stokes and Glenn Maxwell. The four-time world champion considers not opening up a weakness in our society. The German said: “I see it as weakness in our society because it gets seen as a sign of weakness if you talk about your feelings and you open up.” The German also added that things are different from 30 years ago. There’s a lot more going on these days. He also mentioned that everyone has self-doubts. Vettel may leave the sport at the end of the year, but one thing for sure is that he can be a great spokesperson for Formula 1 over important issues. Also Read: Charles Leclerc and Carlos Sainz feels 4-time World Champion will be best team principal in F1 The post Four-time world champion Sebastian Vettel claims athletes are discouraged to speak about Mental Health appeared first on The SportsRush.","pubDate":"2022-09-06 15:00:13","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Why Deepak Chahar is not playing today: Why is Jasprit Bumrah not playing today India vs Sri Lanka Asia Cup 2022 match in Dubai?","link":"https://thesportsrush.com/cricket-news-why-deepak-chahar-is-not-playing-today-why-is-jasprit-bumrah-not-playing-today-india-vs-sri-lanka-asia-cup-2022-match-in-dubai/","keywords":["Cricket","asia cup","Asia Cup 2022","Avesh Khan","deepak chahar","India","Jasprit Bumrah","Sri Lanka"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Why is Deepak Chahar is not playing today: India have made a solitary change to their Playing XI despite losing their last match. India were looking to start cautiously after being put in to bat first by Sri Lanka captain Dasun Shanaka in Asia Cup 2022 Match 9 at the Dubai International Cricket Stadium tonight.… The post Why Deepak Chahar is not playing today: Why is Jasprit Bumrah not playing today India vs Sri Lanka Asia Cup 2022 match in Dubai? appeared first on The SportsRush.","content":"Why is Deepak Chahar is not playing today: India have made a solitary change to their Playing XI despite losing their last match. India were looking to start cautiously after being put in to bat first by Sri Lanka captain Dasun Shanaka in Asia Cup 2022 Match 9 at the Dubai International Cricket Stadium tonight. However, opening batter KL Rahul (6) and former captain Virat Kohli (0) getting out within five deliveries has resulted in a disastrous start. Completely contrary to how captain Rohit Sharma had talked about playing freely at the toss, India losing two wickets in the first three overs isn’t the kind of start you expect from them in a must-win match. Rahul, who had stepped out to hit Sri Lanka spinner Maheesh Theekshana over mid-off for a boundary, tried leaving his crease on the following delivery as well. However, substantial drift into the batter found him wanting in front of the stumps. Kohli, on the other hand, couldn’t score a run after two back-to-back half-centuries against Hong Kong and Pakistan at the same venue. Wanting to dispatch Sri Lanka pacer Dilshan Madhushanka through the leg-side, Kohli completely missed the ball while playing across the line only to see his stumps getting castled. Coming on the back of a 5-wicket loss against Pakistan on Sunday, India made a lone change to their Playing XI by bringing in spinner Ravichandran Ashwin for spinner Ravi Bishnoi. Ashwin, an off-spinner, has been included into the XI to counter multiple left-handed Sri Lankan batters. The development means that India will continue to take field with only two specialist fast bowlers. India, who had picked only three specialist pacers in their squad , are left with only two after Avesh Khan falling ill. Part of the squad as a standby player, pacer Deepak Chahar can’t be added to the squad until Khan is completely ruled out. As far as spearhead Jasprit Bumrah is concerned, he isn’t part of this squad due to a back injury .","pubDate":"2022-09-06 14:36:32","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"India vs Sri Lanka, Asia Cup 2022, LIVE Updates: Dilshan Madhushanka Clean Bowls Virat Kohli For A Duck As India Lose 2 Wickets In Powerplay - NDTV Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMifWh0dHBzOi8vc3BvcnRzLm5kdHYuY29tL2FzaWEtY3VwLTIwMjIvaW5kaWEtdnMtc3JpbGFua2EtYXNpYS1jdXAtMjAyMi1zdXBlci1mb3VyLW1hdGNoLTktaW5kLXZzLXNsLWxpdmUtc2NvcmUtdXBkYXRlcy0zMzIwNDc10gGDAWh0dHBzOi8vc3BvcnRzLm5kdHYuY29tL2FzaWEtY3VwLTIwMjIvaW5kaWEtdnMtc3JpbGFua2EtYXNpYS1jdXAtMjAyMi1zdXBlci1mb3VyLW1hdGNoLTktaW5kLXZzLXNsLWxpdmUtc2NvcmUtdXBkYXRlcy0zMzIwNDc1L2FtcC8x?oc=5","keywords":null,"creator":null,"video_url":null,"description":"India vs Sri Lanka, Asia Cup 2022, LIVE Updates: Dilshan Madhushanka Clean Bowls Virat Kohli For A Duck As India Lose 2 Wickets In Powerplay  NDTV SportsMatch Preview - India vs Sri Lanka, Asia Cup 2022, 9th Match, Super Four  ESPNcricinfoAsia Cup 2022: What are India's chances of qualifying for final after Super 4 defeat to Pakistan?  India TodayAsia Cup Super 4: India vs Sri Lanka Today & more updates | The News  DD INDIAIndia vs Sri Lanka Live Cricket Score Asia Cup 2022 Super Four: Virat Kohli Out For a Duck; IND Wobble  News18View Full coverage on Google News","content":null,"pubDate":"2022-09-06 14:11:28","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Why Jadeja is not playing today: Why Dinesh Karthik is not playing today Asia Cup 2022 Super 4 match between India and Sri Lanka?","link":"https://thesportsrush.com/cricket-news-why-jadeja-is-not-playing-today-why-dinesh-karthik-is-not-playing-today-asia-cup-2022-super-4-match-between-india-and-sri-lanka/","keywords":["Cricket","asia cup","Asia Cup 2022","dinesh karthik","India","Ravindra Jadeja","Sri Lanka"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Why Dinesh Karthik is not playing today: India have once again picked Rishabh Pant ahead of Dinesh Karthik. During the ninth match of Asia Cup 2022 between India and Sri Lanka in Dubai, Sri Lanka captain Dasun Shanaka has won the toss and chose to bowl. “We’ll bowl first because of the record here. All… The post Why Jadeja is not playing today: Why Dinesh Karthik is not playing today Asia Cup 2022 Super 4 match between India and Sri Lanka? appeared first on The SportsRush.","content":"Why Dinesh Karthik is not playing today: India have once again picked Rishabh Pant ahead of Dinesh Karthik. During the ninth match of Asia Cup 2022 between India and Sri Lanka in Dubai, Sri Lanka captain Dasun Shanaka has won the toss and chose to bowl. “We’ll bowl first because of the record here. All the last three games have been chased down here. The approach has been outstanding by our batters and we hope to continue the same. The coaching staff and the players have created the environment for the new players to come in and deliver,” Shanaka told Star Sports at the toss. It goes without saying that Shanaka’s decision has been inspired from Sri Lanka brilliantly executing two back-to-back challenging run-chases in this tournament. As far as the overall record at the Dubai International Cricket Stadium is concerned, teams batting first have won here 36 times as compared to 43 victories by teams batting second. Why Dinesh Karthik is not playing today vs Sri Lanka? Much like the last match, India captain Rohit Sharma was looking to to chase a total at this venue tonight as well. Been asked to bat first for the second time in a row, Sharma didn’t want to deter from their approach of “playing freely”. “We would have bowled first as well. The pitch doesn’t change much and it only gets better to bat on. This gives us an opportunity to come out and play freely. We need to ensure that we are there from the word go,” Sharma told Star Sports at the toss. ALSO READ: When and where to watch India vs Sri Lanka Asia Cup match in India? While Sri Lanka will field an unchanged team on Tuesday, India have made one change by bringing in spinner Ravichandran Ashwin for spinner Ravi Bishnoi. Sharma confirmed that the change has been made looking at the combination of the Sri Lankan XI which consists of quite a few left-handed batters. The development means that India will be without all-rounder Ravindra Jadeja and wicket-keeper batter Dinesh Karthik yet again. Jadeja, who has been ruled out of Asia Cup 2022 due to a knee injury, has already undergone a surgery. Speedy Returns, Jaddu! More Power to you. #Yellove #WhistlePodu @imjadeja pic.twitter.com/GAeZZHEDAM — Chennai Super Kings (@ChennaiIPL) September 6, 2022 Karthik, on the other hand, has been left out for Rishabh Pant despite being picked ahead of him in the first match of the tournament. The team management would really be hoping for Pant to justify these repeated opportunities. The post Why Jadeja is not playing today: Why Dinesh Karthik is not playing today Asia Cup 2022 Super 4 match between India and Sri Lanka? appeared first on The SportsRush.","pubDate":"2022-09-06 13:55:15","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Suresh Raina Retires: From Gambhir to Rahul, here's how cricket fraternity reacted to Mr IPL's retirement","link":"https://zeenews.india.com/cricket/suresh-raina-retires-from-gautam-gambhir-to-kl-rahul-heres-how-cricket-fraternity-reacted-to-mr-ipls-retirement-2506547.html","keywords":null,"creator":null,"video_url":null,"description":"Raina was part of the 2011 World Cup-winning team under the captaincy of MS Dhoni. Raina will not play for Uttar Pradesh in the upcoming domestic season.","content":"Following Suresh Raina 's retirement from all formats of cricket, cricketers took to social media to extend their good wishes to the former Indian middle-order batsman for the next phase of his life. They also recalled their association with him. Former India batter Suresh Raina announced his retirement from all formats of cricket on Tuesday. Former Indian all-rounder Irfan Pathan took to social media to recall his under-19 days with the left-handed batter, saying that his \"batting charm was so special\". Unlocking the vault of super memories with Chinna Thala! _ #ChinnaThalaForever #Yellove #WhistlePodu __ @imraina pic.twitter.com/Op3APjSsB2 — Chennai Super Kings (@ChennaiIPL) September 6, 2022 \"My first memory of @ImRaina was when we played for u-19 India. That batting charm was so special to start with. Wishing you great life ahead brother. I'm sure we will see you play some more cricket,\" tweeted Raina. KL Rahul also thanked the middle-order batter for all the wonderful memories on and off the field. \"Thank you for all the wonderful memories on and off the field. Wishing you the best for your future endeavours,\" KL Rahul said. IPL franchise Chennai Super Kings also took to social media to congratulate Raina on a successful career. Raina won the Indian Premier League four times with the yellow franchise. \"The streets of Anbuden will never forget what Chinna Thala meant to each and every one of us! Thank You, Mr. IPL!,\" said a tweet from CSK's Twitter handle. Former Indian opener and teammate Gautam Gambhir also took to social media for congratulating Raina on the completion of his successful cricketing career. \"An all-rounder for all seasons! Welcome to the next season of life! #SureshRaina,\" tweeted Gambhir. Raina had announced his retirement from international cricket on August 15, 2020. Raina was part of the 2011 World Cup-winning team under the captaincy of MS Dhoni. Raina will not play for Uttar Pradesh in the upcoming domestic season. Taking to Twitter to announce his retirement, Raina Tweeted, \"It has been an absolute honour to represent my country and state UP. I would like to announce my retirement from all formats of Cricket. I would like to thank @BCCI, @UPCACricket, @ChennaiIPL, @ShuklaRajiv sir & all my fans for their support and unwavering faith in my abilities.\" In an international career spanning 13 years, Raina represented India in 18 Tests, 226 ODIs and 78 T20Is. Raina gathered 5615 runs from 226 ODIs at an average of 35.31. His best score in the format is 116*. Raina scored five centuries and 36 half-centuries in the format. In 78 T20Is, the left-hander has scored 1,605 runs at an average of 29.18. His best score in the format is 101. Raina scored one century and five half-centuries in the format. Across 31 innings in 18 Tests, Raina scored 768 runs at an average of 26.48. 120 is Raina's best score in the longer format of the game. He has scored a century and seven half-centuries in this format. He is also the first Indian to score hundreds in all three formats of cricket and his centuries were scored outside India. While playing in the Indian Premier League (IPL) Suresh Raina has 5,528 runs to his name in 205 IPL matches with 39 half-centuries and one century at a strike rate of 136.76 and an average of 32.52. His best score in IPL is 100. Raina is the fifth highest-run scorer in IPL of all time. He was one of the marquee players of the Chennai Super Kings (CSK) franchise, which he represented for the majority of his career. He also won two Champions League T20 titles with CSK. Raina represented Uttar Pradesh in domestic cricket, having made his debut for the team in the 2002-03 season and playing till the 2020-21 season. In 109 First-class cricket matches, Raina scored 6,871 runs at an average of 42.15. His best individual score in the format is 204*. He has scored 14 centuries and 45 half-centuries in the format. In List A cricket, Raina has scored 8,078 runs in 302 matches at an average of 35.42. His best score in the format is 129. Seven centuries and 55 half-centuries came out of his bat in this format. In 336 T20 matches, Raina has scored 8,654 runs at an average of 32.17. His best individual score in this format is 126*. Four centuries and 53 half-centuries have been scored by this stylish southpaw in the T20s.","pubDate":"2022-09-06 13:49:00","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"India vs Sri Lanka Live Score Ball by Ball, Asia Cup, 2022 Live Cricket Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/india-vs-sri-lanka-live-score-over-super-four-match-3-t20-1-5-updates-3321059","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between India vs Sri Lanka from Dubai International Cricket Stadium, Dubai. Check commentary and full scoreboard of the match.","content":"Follow the Asia Cup, 2022 live cricket score on Sports.NDTV.com . After 5.1 overs, India are 37/2. Get live score, ball by ball commentary and much more. Keep track of Asia Cup, 2022 today match between India and Sri Lanka. Everything related to India and Sri Lanka match will be available on Sports.NDTV.com . Stay updated with India vs Sri Lanka live score. Do check for India vs Sri Lanka scorecard. You can get scorecard updates, match related facts. Get quick live updates with ads, Sports.NDTV.com , which is the perfect destination for live cricket score. 4.6 overs (1 Run) Single to end the over and this is a good over for India, 14 from it! Asitha Fernando bowls it full and on the pads. Suryakumar Yadav flicks it to deep backward square leg for a single. 4.5 overs (1 Run) Nice timing again! Bowls it very full on off. Sharma flicks it towards mid-wicket. The fielder there misfields a bit and a single is taken. 4.4 overs (2 Runs) Drifts on the pads. Rohit Sharma clips it to deep backward square leg for a couple. 4.3 overs (4 Runs) FOUR! Sheer timing this time! Tad shorter and around off. Rohit Sharma rides the bounce and punches it off the middle of his bat through cover-point for a boundary. 4.2 overs (6 Runs) SIX! Rohit Sharma is not backing away! That's a brave shot! Rohit Sharma dances down the track and Asitha Fernando bangs it short, on middle. Rohit Sharma still goes for the pull shot and clears the fence at square leg for a maximum. 4.1 overs (0 Run) Starts off with a full delivery on off. It is over 140 clicks and Rohit Sharma drives it without much timing to mid on. Asitha Fernando comes into the attack. 3.6 overs (1 Run) Oh, a thick outside edge but short of the fielder at short third man. Chamika Karunaratne bowls it just short of good length and outside off. Sharma tries to punch it away. However, the ball catches the outside edge and the ball goes off the bounce to the fielder at short third man. A single taken. 3.5 overs (1 Run) Drags his length back a bit, around off. Suryakumar Yadav opens the face of his blade and guides it to third man for a single. 3.4 overs (0 Run) Bowls it full on middle at 132 kph. Suryakumar Yadav drives it firmly to mid off. 3.3 overs (1 Run) Back of a length, outside off. Rohit Sharma punches it off the outside half of his blade to deep backward point for a single. 3.2 overs (4 Runs) FOUR! That's a big statement from Rohit Sharma! This shows that India are not going to go into their shell here. This delivery is on the shorter side, on off. Rohit Sharma stays deep in his crease and pulls it to deep mid-wicket for a boundary. 3.1 overs (0 Run) On a length, on middle. Bit of extra bounce and Rohit Sharma defends it towards the leg side. Chamika Karunaratne comes into the attack. 2.6 overs (0 Run) Dot to end another successful over! On the shorter side, around off. Suryakumar Yadav with a solid block from his crease. 2.5 overs (2 Runs) Goes fuller on middle. Suryakumar Yadav flicks it to deep backward square leg for a couple. 2.4 overs (0 Run) OUT! KNOCKED HIM OVER! Virat Kohli departs! Dilshan Madushanka strikes and he is pumped up and so are other Lankan players, this is just brilliant from the youngster. He bowls a fullish delivery that swings into middle. Virat Kohli goes for the big heave across the line but misses. The ball shatters the stumps and this is a big blow to India. Have to say, this was a bad shot from the former Indian skipper. Suryakumar Yadav walks in next. 2.4 overs (1 Run) WIDE! Dilshan Madushanka goes for a yorker but misses his radar. He bowls it down the leg side and Kohli misses his flick shot. The Sri Lankan players are bit interested as they think that there might be some bat involved but makes a very late call and the time is up till then. The umpire calls it wide. 2.3 overs (0 Run) The ball just holds a bit off the surface. On the shorter side, around off. Kohli tries to punch it off the back foot but mistimes it to mid off. 2.2 overs (0 Run) Dot ball! Lands it on a length, on off. Kohli blocks it from his crease. Lankan bowlers have been superb so far. 2.1 overs (1 Run) Back of a length and around off. Sharma punches it to deep backward point for a single. 1.6 overs (0 Run) Bowls it fuller and around off at 100 kph. Kohli drives it to mid off. A successful first over from Maheesh Theekshana comes to an end. Virat Kohli is the new batter. 1.5 overs (0 Run) OUT! LBW! Maheesh Theekshana strikes and this is a big wicket of KL Rahul! India lose an early wicket and Sri Lankan fans in the ground are delighted. Maheesh Theekshana fires this on middle and Rahul tries to flick it by coming down the track again. He misses and gets hit on his boot. Maheesh Theekshana makes a loud appeal and the umpire raises his finger much to the disappointment of Indian fans. However, KL Rahul reviews it. The replays roll in and the UltraEdge shows no bat involved here. The Ball Tracking rolls and it shows umpire's call on wicket's hitting. So, the original decision stays and KL Rahul has to take the long walk back to the pavilion. 1.4 overs (4 Runs) FOUR! Finally an aggressive shot from the Indian batter and it is the first boundary of the game. A fuller delivery on middle. Rahul skips down the track and makes some room as well. He lifts it over the in-field towards the extra-cover region for a boundary. 1.3 overs (1 Run) Just a single again! This is pushed quicker again on middle. Sharma flicks it to deep mid-wicket for a single. 1.2 overs (1 Run) Bowls it flatter and quicker on middle at 99 kph. Rahul punches it to long on for a single. 1.1 overs (1 Run) Starts off with a fuller delivery on middle. Rohit Sharma clips it to deep mid-wicket for a single. 0.6 over (0 Run) Tidy start from Dilshan Madushanka! Serves it on a length, around off. Rahul defends it solidly off the front foot. 0.5 over (0 Run) Fraction short and outside off. Rahul looks to cut it but gets no timing in this shot. 0.4 over (0 Run) Hits him on the pad this time! Lands it on a length, on middle. The ball shapes in a bit and Rahul misses it as he tries to work it towards the leg side. The ball hits his back leg and there is a slight appeal from the bowler but nothing serious. 0.4 over (1 Run) Goes fuller but drifts down the leg side. Rahul tries to flick it but misses. 0.3 over (1 Run) Nice timing! Bowls back of a length and outside off. Rohit punches it nicely past the point fielder for a single. The Indian skipper is off the mark as well. 0.2 over (0 Run) Tad shorter and around off. Rohit Sharma blocks it off solidly from his crease. 0.2 over (1 Run) WIDE! Bowls it on a length and it is down the leg side this time. Sharma looks to clip it but misses. 0.1 over (1 Run) Lovely delivery to start the proceedings! Dilshan Madushanka serves it on a good length, on middle. Rahul tries to work it towards the leg side. However, he gets an outside edge and the ball runs towards the third man region. A single is taken and Rahul is off the mark. Sri Lankan players are seen out in a huddle. KL Rahul and Rohit Sharma as usual stroll out to the crease. Dilshan Madushanka to bowl. Here we go. We are all ready for the game. The match officials and the players walk in for their respective national anthems. It will be India's first followed by Sri Lanka's national anthem. Ravichandran Ashwin is in for a quick chat. He says that any India-Pakistan game is important from the fan's perspective and the team's perspective. Tells that the game against Pakistan was brilliant and both teams played quite well. Mentions that playing for India doesn't need any motivation and he tries to be upbeat and focus on his process. Says that while playing for India every game is a pressure game and they would like to be at their best in every game possible. Pitch Report - Ravi Shastri is down for the pitch report. He says that this is the same pitch that was used in the game against Pakistan. Tells that this pitch has less grass than last time and says that the pitch will behave quite well and there might be some help for the spinners. Says that overall it is a very good batting surface. Rohit Sharma the skipper of India says that they would have bowled first as the pitch slightly gets better in the second innings. Adds that they batted well in the last game but fell short of 10-15 runs and they need to stick to basics and finish well. Further says that those games make them learn a lot. Says that they need to find the right length and bowl towards the longer boundary and the pitch is a bit dry so they have made a tactical change as Ravichandran Ashwin comes in for Ravi Bishnoi. Dasun Shanaka the skipper of Sri Lanka says they will bowl first. Tells that it is because of the record here and chasing has been a preferred approach here. Tells that their batters have been doing well and they would like to continue the same in this game. Mentions that the coaching staff has done great work with the players and have created a great atmosphere for the players to come in and deliver. Sri Lanka (Unchanged Playing XI) - Pathum Nissanka, Kusal Mendis (WK), Charith Asalanka, Danushka Gunathilaka, Dasun Shanaka (C), Bhanuka Rajapaksa, Wanindu Hasaranga, Chamika Karunaratne, Maheesh Theekshana, Asitha Fernando, Dilshan Madushanka. India (Playing XI) - KL Rahul, Rohit Sharma (C), Virat Kohli, Suryakumar Yadav, Rishabh Pant (WK), Hardik Pandya, Deepak Hooda, Ravichandran Ashwin (In for Ravi Bishnoi), Bhuvneshwar Kumar, Arshdeep Singh, Yuzvendra Chahal. TOSS - Sri Lanka have won the toss and elected to BOWL first. Dasun Shanaka and his boys have done well in the last two games with the bat as they have chased down big totals with some finesse and style. However, this would be a tougher challenge for the Lankans and they need to be at their best to repeat the same magic here. Their bowlers have been a bit expensive in the competition so far and they need to come up with better execution against a top-class unit like India. The stakes are high and expect a close contest here. Stay tuned for the toss and other updates.","pubDate":"2022-09-06 13:47:55","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637980886588110066.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Looking back at Suresh Raina's last match in all formats of cricket","link":"https://www.sportskeeda.com/cricket/looking-back-suresh-raina-s-last-match-formats-cricket?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Cricket"],"creator":["Vinay Chhabria"],"video_url":null,"description":null,"content":null,"pubDate":"2022-09-06 13:37:32","image_url":"https://static.sportskeeda.com/editor/2022/09/dcdc0-16624625479564.png","source_id":"sportskeeda","country":["india"],"category":["sports"],"language":"english"},{"title":"Green, Carey save Australia against NZ","link":"https://www.cairnspost.com.au/sport/cricket/green-carey-save-australia-against-nz/video/9316b361c6b19067ebddb90f0aec1340","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket: A strong Cameron Green innings grasped victory for the Aussies after a touch and go first ODI against New Zealand,","content":null,"pubDate":"2022-09-06 13:27:20","image_url":null,"source_id":"cairnspost","country":["australia"],"category":["sports"],"language":"english"}]}