{"newsArray":[{"title":"England coach's staggering Ashes revelation","link":"https://wwos.nine.com.au/cricket/ashes-2021-england-would-pick-the-same-team-says-coach-chris-silverwood/6eee1f75-1486-4124-a5f2-6abcf10df3f7","keywords":null,"creator":["wwos"],"video_url":null,"description":"England coach Chris Silverwood has made an astonishing claim about his side's start to the Ashes series.","content":"England coach Chris Silverwood has made the staggering claim that he'd pick the same starting side for the first two Ashes Tests, even if he had his time again.The tourists were hammered by nine wickets in Brisbane and 275 runs in Adelaide, and now face the mountainous task of needing to win all three remaining Test matches to regain the Ashes.Only Don Bradman's 1936-37 Australian side has turned a 2-0 series deficit into a 3-2 victory.READ MORE: Disgraced NRL star hammered in boxing debutREAD MORE: Hamilton's dramatic F1 loss sparks death threatsREAD MORE: Iconic cricket commentator hangs up the micThe selection of England's bowling attack has puzzled experts and fans alike, with the country's two most prolific Test wicket-takers of all time, James Anderson and Stuart Broad, both overlooked for Brisbane.That match saw spinner Jack Leach mauled by the Australian batsman, meaning England then went into the second match in Adelaide with five fast bowlers.\"There is always going to be divided opinion,\" Silverwood told the BBC.\"You pick a team and not everybody's going to agree with you.\"Asked if he'd pick the same sides for the first two Tests, a defiant Silverwood dug in, displaying more backbone than many of the English batters.\"To be honest, I would,\" he said.\"I was happy with the skillset we had in the pink-ball Test, so I would pick the same team again.\"Following Australia's convincing win in Adelaide, England captain Joe Root suggested his bowlers had made the same mistake they made in 2017-18, namely pitching too short.\"I don't think we bowled the right lengths,\" Root said.That resulted in a the English skipper copping a ferocious spray from former Australian captain Ricky Ponting, who said it was Root's responsibility to get the bowlers to adjust their length during the match, not complain about it afterwards.\"I nearly fell off my seat when I heard that,\" Ponting told cricket.com.au.\"Whose job is it then to make them change? Why are you captain then?\"If you can't influence your bowlers on what length to bowl, what are you doing on the field?\"Joe Root can come back and say whatever he likes but if you're captain, you've got to be able to sense when your bowlers aren't bowling where you want them to.\"And if they're not going to listen, you take them off, simple as that.\"For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here!","pubDate":"2021-12-21 23:23:47","full_description":"England coach Chris Silverwood has made the staggering claim that he'd pick the same starting side for the first two Ashes Tests , even if he had his time again. The tourists were hammered by nine wickets in Brisbane and 275 runs in Adelaide , and now face the mountainous task of needing to win all three remaining Test matches to regain the Ashes. Only Don Bradman's 1936-37 Australian side has turned a 2-0 series deficit into a 3-2 victory. READ MORE: Disgraced NRL star hammered in boxing debut READ MORE: Hamilton's dramatic F1 loss sparks death threats READ MORE: Iconic cricket commentator hangs up the mic The selection of England's bowling attack has puzzled experts and fans alike, with the country's two most prolific Test wicket-takers of all time, James Anderson and Stuart Broad, both overlooked for Brisbane. That match saw spinner Jack Leach mauled by the Australian batsman, meaning England then went into the second match in Adelaide with five fast bowlers. \"There is always going to be divided opinion,\" Silverwood told the BBC. \"You pick a team and not everybody's going to agree with you.\" Asked if he'd pick the same sides for the first two Tests, a defiant Silverwood dug in, displaying more backbone than many of the English batters. \"To be honest, I would,\" he said. \"I was happy with the skillset we had in the pink-ball Test, so I would pick the same team again.\" Following Australia's convincing win in Adelaide, England captain Joe Root suggested his bowlers had made the same mistake they made in 2017-18, namely pitching too short. \"I don't think we bowled the right lengths,\" Root said. That resulted in a the English skipper copping a ferocious spray from former Australian captain Ricky Ponting, who said it was Root's responsibility to get the bowlers to adjust their length during the match, not complain about it afterwards. \"I nearly fell off my seat when I heard that,\" Ponting told cricket.com.au. \"Whose job is it then to make them change? Why are you captain then? \"If you can't influence your bowlers on what length to bowl, what are you doing on the field? \"Joe Root can come back and say whatever he likes but if you're captain, you've got to be able to sense when your bowlers aren't bowling where you want them to. \"And if they're not going to listen, you take them off, simple as that.\" For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here!","image_url":"https://vms-network-images-prod.s3-ap-southeast-2.amazonaws.com/2021/12/400026/pickerimage.jpg","source_id":"nine"},{"title":"Rugby star dead at 32 after freak accident","link":"https://wwos.nine.com.au/rugby/spanish-rugby-player-kawa-leauma-dies-after-accident/7ddf36c2-d46d-449f-9d61-1bf82e1407e6","keywords":null,"creator":["wwos"],"video_url":null,"description":"The Spanish rugby federation said that lock Kawa Leauma has died after an accident in the Netherlands.","content":"The Spanish Rugby Federation has paid tribute to Kiwi lock Kawa Leauma after he died following a \"freak accident\" in the Netherlands. He was 32.The Auckland-born Leauma had been hospitalised and underwent surgery after he \"suffered an accident that caused severe head trauma\" on Saturday, the federation said.Spanish media reports said Leauma fell eight metres from a building in Amsterdam.The federation said his condition had \"slightly improved\" on Sunday after surgery but worsened 24 hours later.https://twitter.com/SuperRugbyFans/status/1473417763985133569?ref_src=twsrc%5EtfwREAD MORE: Disgraced NRL star hammered in boxing debutREAD MORE: Hamilton's dramatic F1 loss sparks death threatsREAD MORE: Iconic cricket commentator hangs up the mic\"World Rugby, and Spanish rugby in particular, is in mourning, and from the Spanish Rugby Federation we can only thank the commitment of a player admired and loved by all his team-mates from XV del León [Spain's national men's team] and his club, AMPO Ordizia,\" the federation said in its obituary to Leauma.Leauma, who played for the AMPO Ordizia club in Spain's Basque Country, was in Amsterdam for Spain's Rugby Europe Championship match against the Netherlands.The federation said he died because of a \"freak accident\" suffered just hours after Spain beat the Netherlands 52-7 in a match that doubled as a qualifier for the next Rugby World Cup in France in 2023.Watch the 2022 Japan Rugby League One season from January 8 on Stan Sport, ad free, live and on demand. Start your seven day free trial here!He was poised to make his official international debut for Spain after becoming eligible through three years of residency, but he was withdrawn at the last minute because of doubts about his eligibility. He played in a friendly for Spain against an Italian side in Madrid in October.The federation said its president Alfonso Feijoo and Ordizia sports director Iñigo Marotias would meet Leauma's wife when she arrived in Amsterdam.In its obituary, Leauma was described as \"a person who made himself loved\" and made his mark on Spanish rugby.At 197cm and weighing 110kg, Leauma was hoping to become a regular in Spain's team.The federation said they would honour his memory by trying to qualify for the World Cup for the first time since their only appearance in the UK in 1999.Leauma played for a handful of Auckland clubs, including Otahuhu, Papatoetoe, Mount Wellington and Manukau Rovers.A blindside flanker, No 8 or lock, he represented Samoa's under-20s and played for Auckland's sevens team.Leauma also took his rugby career to Australia, playing for the Sydney Rays and West Harbour clubs in New South Wales, before moving to Spain in 2018.The Mount Wellington and Papatoetoe clubs led the tributes for Leauma on social media.https://twitter.com/Kike_Marin_/status/1473415242390585346?ref_src=twsrc%5Etfw\"These posts aren't easy to do and this one in particular is pretty upsetting as this club acknowledges the passing of Kawa Leauma,\" Mount Wellington's Facebook post said.\"Kawa was an integral part of our Mount Wellington Premier side, great player and humble both on and off the field and we enjoyed seeing him continue to thrive beyond his time at our club. He will be sorely missed by many of our community and we extend our sincere condolences to his wife and family as they navigate this tough time in a foreign country.\"Papatoetoe tribute's said \"another brother gone way too soon\".\"Our sincere condolences go out to the family and friends of Kawwa Leuma who passed away in a tragic accident whilst living abroad in Spain,\" the club's Facebook post said.\"Kawwa had been playing professional rugby and just recently made his international debut for Spain. He was part of a strong Papatoetoe U21s team back in 2010.\"Rest in love brother Kawwa.\"World Rugby chairman Sir Bill Beaumont tweeted: \"Deeply saddened to hear of the passing of Spain international Kawa Leauma. My thoughts are with his teammates & family at this difficult time,\" Beaumont tweeted.For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here!","pubDate":"2021-12-21 23:02:01","full_description":"The Spanish Rugby Federation has paid tribute to Kiwi lock Kawa Leauma after he died following a \"freak accident\" in the Netherlands. He was 32. The Auckland-born Leauma had been hospitalised and underwent surgery after he \"suffered an accident that caused severe head trauma\" on Saturday, the federation said. Spanish media reports said Leauma fell eight metres from a building in Amsterdam. The federation said his condition had \"slightly improved\" on Sunday after surgery but worsened 24 hours later. READ MORE: Disgraced NRL star hammered in boxing debut READ MORE: Hamilton's dramatic F1 loss sparks death threats READ MORE: Iconic cricket commentator hangs up the mic \"World Rugby, and Spanish rugby in particular, is in mourning, and from the Spanish Rugby Federation we can only thank the commitment of a player admired and loved by all his team-mates from XV del León [Spain's national men's team] and his club, AMPO Ordizia,\" the federation said in its obituary to Leauma. Leauma, who played for the AMPO Ordizia club in Spain's Basque Country, was in Amsterdam for Spain's Rugby Europe Championship match against the Netherlands. The federation said he died because of a \"freak accident\" suffered just hours after Spain beat the Netherlands 52-7 in a match that doubled as a qualifier for the next Rugby World Cup in France in 2023. Watch the 2022 Japan Rugby League One season from January 8 on Stan Sport, ad free, live and on demand. Start your seven day free trial here! He was poised to make his official international debut for Spain after becoming eligible through three years of residency, but he was withdrawn at the last minute because of doubts about his eligibility. He played in a friendly for Spain against an Italian side in Madrid in October. The federation said its president Alfonso Feijoo and Ordizia sports director Iñigo Marotias would meet Leauma's wife when she arrived in Amsterdam. In its obituary, Leauma was described as \"a person who made himself loved\" and made his mark on Spanish rugby. At 197cm and weighing 110kg, Leauma was hoping to become a regular in Spain's team. The federation said they would honour his memory by trying to qualify for the World Cup for the first time since their only appearance in the UK in 1999. Leauma played for a handful of Auckland clubs, including Otahuhu, Papatoetoe, Mount Wellington and Manukau Rovers. A blindside flanker, No 8 or lock, he represented Samoa's under-20s and played for Auckland's sevens team. Leauma also took his rugby career to Australia, playing for the Sydney Rays and West Harbour clubs in New South Wales, before moving to Spain in 2018. The Mount Wellington and Papatoetoe clubs led the tributes for Leauma on social media. \"These posts aren't easy to do and this one in particular is pretty upsetting as this club acknowledges the passing of Kawa Leauma,\" Mount Wellington's Facebook post said. \"Kawa was an integral part of our Mount Wellington Premier side, great player and humble both on and off the field and we enjoyed seeing him continue to thrive beyond his time at our club. He will be sorely missed by many of our community and we extend our sincere condolences to his wife and family as they navigate this tough time in a foreign country.\" Papatoetoe tribute's said \"another brother gone way too soon\". \"Our sincere condolences go out to the family and friends of Kawwa Leuma who passed away in a tragic accident whilst living abroad in Spain,\" the club's Facebook post said. \"Kawwa had been playing professional rugby and just recently made his international debut for Spain. He was part of a strong Papatoetoe U21s team back in 2010. \"Rest in love brother Kawwa.\" World Rugby chairman Sir Bill Beaumont tweeted: \"Deeply saddened to hear of the passing of Spain international Kawa Leauma. My thoughts are with his teammates & family at this difficult time,\" Beaumont tweeted. For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here!","image_url":"https://vms-network-images-prod.s3-ap-southeast-2.amazonaws.com/2021/12/396973/pickerimage.jpg","source_id":"nine"},{"title":"Iconic TV legend gone after 22 years","link":"https://www.news.com.au/sport/cricket/david-bumble-lloyd-quits-cricket-commentary-after-22-years/news-story/f14e2dd39f00c878b44ebf33fc2cb25e","keywords":null,"creator":null,"video_url":null,"description":"Retiring cricket commentator David Lloyd has called “over” on his time as a Sky Sports pundit after 22 years.","content":null,"pubDate":"2021-12-21 22:19:00","full_description":"Retiring cricket commentator David Lloyd has called “over” on his time as a Sky Sports pundit after 22 years. “Bumble” follows the likes of friends and fellow cricket greats Ian Botham, David Gower and Michael Holding by hanging up the microphone after a solid innings with the British broadcaster. Catch every moment of The Ashes live and ad-break free during play on Kayo. New to Kayo? Try 14-days free now. The England icon, 74, said: “After 22 wonderful years with Sky Cricket, I’ve decided the time is now right to pass on the microphone. “It’s been an immense privilege to try and bring the sport I love into people’s homes up and down the country. “There are so many wonderful memories, so many terrific games and incredible performances. “I’ve been lucky to travel the world sharing Ashes highs and lows, World Cup wins and losses, heroics and heartaches with you all. “Sharing a commentary box in Australia in 2013 with my broadcasting hero Bill Lawry was a real highlight.” The Sun reports Lloyd enjoyed a fine first-class career with Lancashire and also featured 17 times for England across Test and one-day cricket, before taking up roles in umpiring and coaching after his retirement in 1983. But since quitting as England head coach in 1999, he has been a mainstay on English TV with his witty commentary and insightful analysis. He helped pioneer the launch of Twenty20 on Sky with great success, too. Lloyd added: “It has been a great pleasure to work alongside Ian Bishop, Ravi Shastri, Shane Warne, Shaun Pollock and Ian Smith amongst many others. “With the passing of Bob Willis and after the decision to move on by my good friends David Gower, Ian Botham and more recently Michael Holding, the commentary box feels a little emptier. “And so I feel it is time for me to do the same and move on to the next chapter. “I leave the Sky box in immensely capable hands led by my pals Michael Atherton, Nasser Hussain, Ian Ward and Rob Key. “To those that follow, cherish that mic. Inform and entertain so the next generation can fall in love with this wonderful game. “I’m done now with Sweet Caroline but in the words of Elton John, ‘I’m still standing!’ Much love, Bumble.” Tributes poured in for the popular broadcaster after he tweeted the news. Former England player and Sky Sports commentator Rob Key said: “What a sad day. The best person I know. By some distance as well. Love always @BumbleCricket. Nobody does it better. Congratulations on a magnificent career.” Ex-England cricketer Jeremy Snape wrote: “Congrats on ‘another’ amazing career @BumbleCricket your passion for the game and ability to see the lighter side will be sorely missed. Wishing you a healthy and happy retirement.” Sky Sports Cricket said: “David ‘Bumble’ Lloyd has been a star of the Sky Cricket commentary box for over two decades, with an extraordinary ability to inform and entertain in equal measure. “Perhaps his finest hour came during the Ashes Test match at Trent Bridge in 2015 - calling Stuart Broad’s amazing performance with perfection. “He is much loved and respected by his fellow commentators and production team who cherish the time spent working with him. Thank you Bumble for your service.” In November, Lloyd apologised to Azeem Rafiq who claimed Bumble had said “getting subs out of Asian players (at cricket clubs) was like trying to extract blood from a stone”. This story first appeared on The Sun and was reproduced with permission England captain Joe Root was angry when he fronted the media after the second Test loss and then turned to his players. Veteran Dan Christian reeled in one of the catches of the summer to help Sean Abbott overtake Ben Laughlin as the leading wicket-taker in BBL history. Watch it here. Most athletes use traditional methods of recovering from injuries, but Sydney Thunder star Ollie Davies has his own unique way.","image_url":null,"source_id":"news"},{"title":"Iconic TV legend gone after 22 years","link":"https://www.cairnspost.com.au/sport/cricket/david-bumble-lloyd-quits-cricket-commentary-after-22-years/news-story/f14e2dd39f00c878b44ebf33fc2cb25e","keywords":["Cricket news and galleries","Sport news and galleries"],"creator":null,"video_url":null,"description":"Retiring cricket commentator David Lloyd has called “over” on his time as a Sky Sports pundit after 22 years.","content":null,"pubDate":"2021-12-21 22:19:00","full_description":null,"image_url":null,"source_id":"cairnspost"},{"title":"Under-fire England chief Chris Silverwood insists he’s the ‘right man for the job’ despite consecutive Ashes hammerings","link":"https://www.thesun.co.uk/sport/17111045/england-cricket-chris-silverwood-ashes/","keywords":["Cricket","Sport","Australia Cricket Team","England Cricket","The Ashes 2021-22"],"creator":["John Etheridge"],"video_url":null,"description":"CHRIS SILVERWOOD remains convinced he is the right man to lead England out of their Ashes agony. Despite an error-filled embarrassment of a campaign, Silverwood has no plans to review his position as head coach or even accept England have twice picked the wrong team. He said there was an honest debrief after their crushing, […]","content":"CHRIS SILVERWOOD remains convinced he is the right man to lead England out of their Ashes agony. Despite an error-filled embarrassment of a campaign, Silverwood has no plans to review his position as head coach or even accept England have twice picked the wrong team. GettyChris Silverwood is adamant he remains the right man to lead England cricket[/caption] He said there was an honest debrief after their crushing, 275-run defeat in the Second Test at which “a few things were thrown around” — although he means words rather than objects. Silverwood is under the impression a “really good talk in the dressing room” is proof England can change course and that he is doing a good job. Asked whether he can help England improve, Silverwood insisted: “Yes, I believe I can. We had those honest chats and I believe I have the right coaching staff around me to make that happen. “When you take a job like this, you accept there will be talk. It is what it is. “Do I believe I’m the right man? Yes, I do, or I wouldn’t have taken the job in the first place. You’re under pressure constantly, aren’t you?” Silverwood is a likeable man with huge power because he is also chief selector. Most read in Cricket END OF ERA David 'Bumble' Lloyd, 74, retires from Sky Sports after legendary 22-year career ASHES IN RUINS Woeful England suffer more humiliation as Aussies crush tourists & lead 2-0 WIZARD OF AUS Watch as Aussie fan downs three pints of beer at Ashes to send crowd wild BALLSY MOVE England set for Ashes Second Test thumping as Root falls on final ball of day ASHEN-FACED England collapse AGAIN as Aussies run riot with huge lead in Second Ashes Test EVERY LITTLE HELPS BT Sport host takes a break from job as Tesco driver to cover the Ashes FREE BETS: GET OVER £2,000 IN NEW CUSTOMER DEALS But it is difficult to escape the thought that captain Joe Root needs a more forceful character as coach, somebody not afraid to turn on the hairdryer. With the white-ball team, captain Eoin Morgan fills that role. No player takes liberties with Morgan, so Silverwood can be the good cop. Root did criticise the players — including Stuart Broad and Jimmy Anderson, without actually naming them — after losing on  Monday. But he does not possess Morgan’s sharp edge and also lacks true instinctive or original cricket nous. There is no sign that Silverwood is capable of maverick thinking, either. So England need a hardliner with a brilliant cricket brain. If I was in charge of the ECB, I would go to former Aussie skipper Ricky Ponting with a blank cheque and ask him to run the England team — although he would almost certainly say no. THEY HAVE EVERYTHING THEY WANT ON THIS TOUR It is almost as though Silverwood does not want to upset the players, especially in these Covid times. But, crikey, they have everything they want on this tour — business class international flights, charters between cities, top hotels, plus wives, families and partners with them. There is not a person covering this tour who does not think England’s selection has been horrendous. It is blindingly obvious Broad should have played in the nine-wicket First Test defeat at Brisbane ahead of spinner Jack Leach — and equally clear Leach and Mark Wood should have played in Adelaide. It might not have altered the results but such basic mistakes make life easier for Australia. So do dropping catches, taking wickets with no-balls and feeble batting collapses. But Silverwood claimed: “That’s the beauty of sport, isn’t it? It divides opinion. I don’t accept we got it wrong. I’ve been happy with our attack in both games. Chris Silverwood “We played a spinner in Brisbane because we wanted variety in our attack — and I think that was the right thing. “Then in the pink-ball game, we played all the seamers. We have some very strong seamers with a lot of experience, so we picked what we believed was the best attack to take wickets. “No, I don’t accept we got it wrong. We picked the best attack for the conditions. I’ve been happy with our attack in both games.” He added: “We’ve had two collapses and we need to put things right. We had a good talk in the dressing room which was healthy and needed. “I think there are some lessons to be learned. We have to be better —  it’s as simple as that.” Meanwhile, Australia have added quick bowler Scott Boland to their squad for the Boxing Day Test because Josh Hazlewood remains doubtful with a side injury.","pubDate":"2021-12-21 22:00:00","full_description":"CHRIS SILVERWOOD remains convinced he is the right man to lead England out of their Ashes agony. Despite an error-filled embarrassment of a campaign , Silverwood has no plans to review his position as head coach or even accept England have twice picked the wrong team. He said there was an honest debrief after their crushing, 275-run defeat in the Second Test at which “a few things were thrown around” — although he means words rather than objects. Silverwood is under the impression a “really good talk in the dressing room” is proof England can change course and that he is doing a good job. Asked whether he can help England improve , Silverwood insisted: “Yes, I believe I can. We had those honest chats and I believe I have the right coaching staff around me to make that happen. “When you take a job like this, you accept there will be talk. It is what it is. “Do I believe I’m the right man? Yes, I do, or I wouldn’t have taken the job in the first place. You’re under pressure constantly, aren’t you?” Silverwood is a likeable man with huge power because he is also chief selector. FREE BETS: GET OVER £2,000 IN NEW CUSTOMER DEALS But it is difficult to escape the thought that captain Joe Root needs a more forceful character as coach , somebody not afraid to turn on the hairdryer. With the white-ball team, captain Eoin Morgan fills that role. No player takes liberties with Morgan, so Silverwood can be the good cop. Root did criticise the players — including Stuart Broad and Jimmy Anderson, without actually naming them — after losing on Monday. But he does not possess Morgan’s sharp edge and also lacks true instinctive or original cricket nous. There is no sign that Silverwood is capable of maverick thinking, either. So England need a hardliner with a brilliant cricket brain. If I was in charge of the ECB, I would go to former Aussie skipper Ricky Ponting with a blank cheque and ask him to run the England team — although he would almost certainly say no. It is almost as though Silverwood does not want to upset the players, especially in these Covid times. But, crikey, they have everything they want on this tour — business class international flights, charters between cities, top hotels, plus wives, families and partners with them. There is not a person covering this tour who does not think England’s selection has been horrendous. It is blindingly obvious Broad should have played in the nine-wicket First Test defeat at Brisbane ahead of spinner Jack Leach — and equally clear Leach and Mark Wood should have played in Adelaide. It might not have altered the results but such basic mistakes make life easier for Australia. So do dropping catches, taking wickets with no-balls and feeble batting collapses. But Silverwood claimed: “That’s the beauty of sport, isn’t it? It divides opinion. I don't accept we got it wrong. I've been happy with our attack in both games. “We played a spinner in Brisbane because we wanted variety in our attack — and I think that was the right thing. “Then in the pink-ball game, we played all the seamers. We have some very strong seamers with a lot of experience, so we picked what we believed was the best attack to take wickets. “No, I don’t accept we got it wrong. We picked the best attack for the conditions. I’ve been happy with our attack in both games.” He added: “We’ve had two collapses and we need to put things right. We had a good talk in the dressing room which was healthy and needed. “I think there are some lessons to be learned. We have to be better — it’s as simple as that.” Meanwhile, Australia have added quick bowler Scott Boland to their squad for the Boxing Day Test because Josh Hazlewood remains doubtful with a side injury.","image_url":null,"source_id":"thesun"},{"title":"Broncos moment that should have fans salivating","link":"https://wwos.nine.com.au/nrl/the-mole-2021-season-review-the-good-bad-ugly/d7f474a1-37db-441c-bfaf-d246da35bcbc","keywords":null,"creator":["wwos"],"video_url":null,"description":"In the first of a three part series, The Mole looks back at the The Good, The Bad and The Ugly from the 2021 season.","content":"Wide World of Sport' intrepid reporter The Mole watched every game played in 2021 - and has come up with a three-part season review of an unforgettable year in the game's history. Here is part one of The Good, The Bad and The Ugly …THE GOODThe father-son partnership of Ivan and Nathan Cleary leading Penrith to the promised land. Ivan was the cool, composed coach who masterminded the premiership success while Nathan was dynamic on the field.A touch of romance follows the Panthers' win, with cult hero winger Brian To'o proposing to his partner Moesha. She said 'yes'.Tom Trbojevic's stellar year as he broke records, steered Manly into the finals and won the Dally M Medal, the Wally Lewis medal, the Brad Fittler Medal and the RLPA's Players' Champion. After losing THAT race to 'Harry' on Manly's Corso, he never looked back.READ MORE: Disgraced NRL star hammered in boxing debutREAD MORE: Hamilton's dramatic F1 loss sparks death threatsREAD MORE: Iconic cricket commentator hangs up the micSouths may have lost the grand final, but what an effort by Wayne Bennett to take a fourth team to a grand final. Bennett has now racked up 10 premiership deciders - a modern day record.The emergence of a host of new faces in the rookie class of 2021, led by a couple of baby-faced youngsters - Roosters half Sam Walker and Warriors fullback Reece Walsh.The NRL's decision - against the wishes of many backward thinking clubs - to expand the competition to 17 teams in 2023. Welcome, The Dolphins.The attacking brilliance of Penrith, Melbourne, Manly and Souths at various stages of the season. Blessed with quality ball players and pace out wide, the four clubs dominated most rival teams and were great to watch.The NRL board made plenty of blunders throughout the season - but get full marks for keeping the premiership alive despite the ever-present danger of COVID. Officials from America's NFL were so impressed that they contacted the NRL for advice on how to combat the virus.Watching new Panthers' cult hero Brian To'o fearlessly run the ball was a joy for any league fan. He led the league in both run metres and post contact metres - by a long way.The Warriors became everyone's second favourite team, spending virtually the entire season in Australia and at times having to beg and borrow players from rival clubs to field a team. Despite the setbacks, they gave their all.The Storm's record-equalling streak of 19 straight wins was one of the highlights of the season. They didn't just win games, they thrashed most opponents, racking up over 70o points in their record run.Josh Addo-Carr's six tries for the Storm against the hapless Bulldogs in a 50-0 win. No player has achieved the feat since 1950 but the big question is - can The Foxx repeat his tryscoring feats for the battling Bulldogs in 2022?Still on tries - the marvellous work of Alex Johnson on the end of the red-hot Rabbitohs backline - he led the league with 30 tries - not bad for a player the club tried to bone not long ago.Brad Fittler's NSW Blues beating Queensland 2-1 despite the entire Origin series being held north of the border due to COVID. Never before, never again.The fighting qualities of the Roosters, who overcame one of the heaviest injury tolls in NRL history to reach the finals. Clearly a club with great culture and spirit.The Broncos had little to cheer about again in 2021, but produced one special performance against arch rivals the Titans. Down 22-0 after just 15 minutes, the Broncos fought back for a 36-28 win.Phil Gould returning to the Bulldogs - the club he coached to premiership glory back in 1988 - to get the under-performing club back on track. Watch the Bulldogs climb the ladder in 2022 after some impressive buys.For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here!","pubDate":"2021-12-21 20:49:55","full_description":"Wide World of Sport' intrepid reporter The Mole watched every game played in 2021 - and has come up with a three-part season review of an unforgettable year in the game's history. Here is part one of The Good, The Bad and The Ugly … THE GOOD The father-son partnership of Ivan and Nathan Cleary leading Penrith to the promised land . Ivan was the cool, composed coach who masterminded the premiership success while Nathan was dynamic on the field. A touch of romance follows the Panthers' win, with cult hero winger Brian To'o proposing to his partner Moesha . She said 'yes'. Tom Trbojevic's stellar year as he broke records, steered Manly into the finals and won the Dally M Medal, the Wally Lewis medal, the Brad Fittler Medal and the RLPA's Players' Champion. After losing THAT race to 'Harry' on Manly's Corso, he never looked back. READ MORE: Disgraced NRL star hammered in boxing debut READ MORE: Hamilton's dramatic F1 loss sparks death threats READ MORE: Iconic cricket commentator hangs up the mic Souths may have lost the grand final, but what an effort by Wayne Bennett to take a fourth team to a grand final. Bennett has now racked up 10 premiership deciders - a modern day record. The emergence of a host of new faces in the rookie class of 2021, led by a couple of baby-faced youngsters - Roosters half Sam Walker and Warriors fullback Reece Walsh . The NRL's decision - against the wishes of many backward thinking clubs - to expand the competition to 17 teams in 2023. Welcome, The Dolphins. The attacking brilliance of Penrith, Melbourne, Manly and Souths at various stages of the season. Blessed with quality ball players and pace out wide, the four clubs dominated most rival teams and were great to watch. The NRL board made plenty of blunders throughout the season - but get full marks for keeping the premiership alive despite the ever-present danger of COVID. Officials from America's NFL were so impressed that they contacted the NRL for advice on how to combat the virus. Watching new Panthers' cult hero Brian To'o fearlessly run the ball was a joy for any league fan. He led the league in both run metres and post contact metres - by a long way. The Warriors became everyone's second favourite team, spending virtually the entire season in Australia and at times having to beg and borrow players from rival clubs to field a team. Despite the setbacks, they gave their all. The Storm's record-equalling streak of 19 straight wins was one of the highlights of the season. They didn't just win games, they thrashed most opponents, racking up over 70o points in their record run. Josh Addo-Carr's six tries for the Storm against the hapless Bulldogs in a 50-0 win. No player has achieved the feat since 1950 but the big question is - can The Foxx repeat his tryscoring feats for the battling Bulldogs in 2022? Still on tries - the marvellous work of Alex Johnson on the end of the red-hot Rabbitohs backline - he led the league with 30 tries - not bad for a player the club tried to bone not long ago. Brad Fittler's NSW Blues beating Queensland 2-1 despite the entire Origin series being held north of the border due to COVID. Never before, never again. The fighting qualities of the Roosters, who overcame one of the heaviest injury tolls in NRL history to reach the finals. Clearly a club with great culture and spirit. The Broncos had little to cheer about again in 2021, but produced one special performance against arch rivals the Titans. Down 22-0 after just 15 minutes, the Broncos fought back for a 36-28 win. Phil Gould returning to the Bulldogs - the club he coached to premiership glory back in 1988 - to get the under-performing club back on track. Watch the Bulldogs climb the ladder in 2022 after some impressive buys. For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here!","image_url":"https://vms-network-images-prod.s3-ap-southeast-2.amazonaws.com/2021/10/384547/pickerimage.jpg","source_id":"nine"},{"title":"Cricket-Silverwood confident of turning around England&#039;s Ashes campaign","link":"https://www.thestar.com.my/sport/cricket/2021/12/22/cricket-silverwood-confident-of-turning-around-england039s-ashes-campaign","keywords":null,"creator":null,"video_url":null,"description":"(Reuters) - England head coach Chris Silverwood said he is the right person for the job and is confident of turning around the team's fortunes after they suffered heavy defeats in the first two tests of the Ashes series against Australia. Read full story","content":null,"pubDate":"2021-12-21 20:43:00","full_description":"(Reuters) - England head coach Chris Silverwood said he is the right person for the job and is confident of turning around the team's fortunes after they suffered heavy defeats in the first two tests of the Ashes series against Australia. England lost the opening test in Brisbane by nine wickets and suffered a 275-run defeat in the second test in Adelaide as they slipped 2-0 behind in the five-test series. Asked if his position was in danger given that England have won just one test from their last 11, Silverwood told British media on Tuesday: \"It always is. \"When you take a job like this you accept that. It is what it is. Do I believe I'm the right man? Yes, I do or I wouldn't have taken the job in the first place. You're under pressure constantly. \"I do believe I can turn it around. We have had those honest chats and I believe I have the right coaching staff around me to make that happen as well.\" Silverwood and Root picked spinner Jack Leach on a green surface in Brisbane and then an all-seam attack on a flat pitch in Adelaide. Silverwood took some responsibility for the two defeats but denied that England got their selection wrong. \"No, I don't (accept we got it wrong). We picked the best attack for those conditions and you look at the attack we had out, there's a lot of experience,\" Silverwood said. Silverwood said that England, who have not won an Ashes series in Australia since 2010-11, need to perform better in the remaining three tests, starting with the 'Boxing Day' test in Melbourne on Sunday. \"We had a really good talk in the dressing room which was needed... We have to be better, it's as simple as that,\" he said. \"It is not just batting and bowling. Look at how many chances we have given up in the field: dropped catches, missed run-outs and everything else. \"Wickets off no-balls are unacceptable. It is a basic error... We have had batting collapses. We have spoken about the two in these games. We have had collapses before and we can't afford to do that.\" (Reporting by Manasi Pathak in Bengaluru, editing by Pritha Sarkar)","image_url":"https://apicms.thestar.com.my/uploads/images/2021/12/22/1415918.jpg","source_id":"thestar_my"},{"title":"AMB vs PEA Dream11 Prediction: Fantasy Cricket Tips, Today's Playing 11s and Pitch Report for KCA T20 Pink Challenge 2021, Match 11","link":"https://www.sportskeeda.com/fantasy-cricket-mantra/amb-vs-pea-dream11-prediction-fantasy-cricket-tips-today-s-playing-11s-pitch-report-kca-t20-pink-challenge-2021-match-11?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Fantasy Cricket Mantra"],"creator":["Anjishnu Roy"],"video_url":null,"description":null,"content":null,"pubDate":"2021-12-21 19:28:00","full_description":"Team Amber will take on Team Pearl in the 11th match of the T20 Pink Challenge 2021 at the Sanatana Dharma College Ground in Alappuzha on Wednesday. Amber lost their last match against Team Ruby by nine wickets. In four matches so far in the competition, they have won twice. Team Pearl, meanwhile, emerged victorious in their last game. Much like their opponents, they’ve also won two games so far. H U Bhoomika, Jincy George, Sabu Malavika, Amit Unni Saraswathi, Sourabhya P, Mrudhula V S, Jayalekshmi Dev, Gayathri S, Sandra Suren, KK Aparna, M Aswathy. Sabin Miriam Keziah, Aswathy Babu, Maria George, Keerthi James, Ganesh Divya, Sreekrishna Haridas, Loordh Nithya, Athira Sanal, Anusree Anil Kumar, TP Sruthi, Aleena Shibu. Match: AMB vs PEA, KCA T20 Pink Challenge 2021, Match 11. Date and Time: 22nd December, 2021; 9:00 AM IST. Venue: Santana Dharma College Ground, Alappuzha. The surface is expected to favour bowlers, who will hope to be in control of proceedings. The highest score in the last four games is 128 runs. A score of 120 could prove to be par on this wicket, so the team winning the toss should look to bat first. A Babu could prove to be an effective wicketkeeper choice for your Dream11 Fantasy side. She has consistently scored runs. G Jincy was in inspired form in the game against Team Emerald. She remained not out on 69 runs, and played a key role for her team. She followed that up with a knock of 49 runs in her most recent game. A Kumar Anusree has shown her ability to pick up wickets regularly. She can also contribute with the bat, and could prove to be a wonderful multiplier choice for your AMB vs PEA Dream11 Fantasy side. Meanwhile, P Sourabhya is another must-have player from Team Amber in your Dream11 Fantasy team. She'll look to put up a stellar performance in this game. J Keerthi has been incredibly consistent and competitive with the ball. She has picked up five wickets in her last two games, and has been in unbelievable form in the tournament. J Keerthi (PEA) – 282 points. G Jincy (AMB) – 281 points. L Nithya (PEA) – 251 points. A Kumar Anusree (PEA) – 249 points. P Sourabhya (AMB) – 174 points. J Keerthi: 17 runs and 8 wickets. G Jincy: 191 runs and 1 wicket. L Nithya: 39 runs and 4 wickets. A Kumar Anusree: 16 runs and 5 wickets. Fantasy Suggestion #1: A Babu, G Jincy, HU Bhoomika, G Divya, A Kumar Anusree, P Sourabhya, KK Aparna, T Sruthi, J Keerthi, L Nithya, VS Mrudhula. Captain: G Jincy. Vice-Captain: J Keerthi. Fantasy Suggestion #2: A Babu, G Jincy, HU Bhoomika, G Divya, A Kumar Anusree, P Sourabhya, KK Aparna, S Sandra, J Keerthi, L Nithya, VS Mrudhula. Captain: A Kumar Anusree. Vice-Captain: P Sourabhya.","image_url":"https://static.sportskeeda.com/editor/2021/12/d0cc5-16401089929590-1920.jpg","source_id":"sportskeeda"},{"title":"Cricket-England&#039;s Archer ruled out until summer after second elbow surgery","link":"https://www.thestar.com.my/sport/cricket/2021/12/22/cricket-england039s-archer-ruled-out-until-summer-after-second-elbow-surgery","keywords":null,"creator":null,"video_url":null,"description":"(Reuters) - England fast bowler Jofra Archer has been ruled out until the summer after undergoing a second operation on his injured right elbow, the country's cricket board (ECB) said on Tuesday. Read full story","content":null,"pubDate":"2021-12-21 18:55:00","image_url":"https://apicms.thestar.com.my/uploads/images/2021/12/22/1415909.jpg","source_id":"thestar_my"},{"title":"“Root’s got a vulnerable defence; Smith is ‘momentum-driven'”: Ravichandran Ashwin decodes Joe Root and Steve Smith batting technique in Test Cricket","link":"https://thesportsrush.com/roots-got-a-vulnerable-defence-smith-is-momentum-driven-ravichandran-ashwin-decodes-joe-root-and-steve-smith-batting-technique-in-test-cricket/","keywords":["Cricket","Joe Root","Ravichandran Ashwin","Steve Smith"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Ravichandran Ashwin decodes Joe Root and Steve Smith: India’s premier all rounder brought out his sharp tactical and observational skills. To term Ravichandran Ashwin a ‘thinking cricketer’ would be a mere understatement. A big reason for his success, especially in the longest format of the game lies not only on his individual skill set which… The post “Root’s got a vulnerable defence; Smith is ‘momentum-driven'”: Ravichandran Ashwin decodes Joe Root and Steve Smith batting technique in Test Cricket appeared first on The SportsRush.","content":"Ravichandran Ashwin decodes Joe Root and Steve Smith: India’s premier all rounder brought out his sharp tactical and observational skills. To term Ravichandran Ashwin a ‘thinking cricketer’ would be a mere understatement. A big reason for his success, especially in the longest format of the game lies not only on his individual skill set which we witness before our television screens, but also on the fact that he devotes an equal amount of time (if not more) to keenly notice and observe how his opponents go about with their respective game plan when out on the 22-yards strip. How hugely has this particular ‘obsession’ (which we’ll get to know in a while) benefited him in his decade-long career up till now is evident from the records he has had under his name so far. Since the 35-year-old has made his debut, no other bowler has taken more Test wickets than him- 427 wickets in 81 matches. This, despite some of his immediate competitors- the likes of Nathan Lyon (99 Tests, 398 wickets), James Anderson (104 Tests, 395 wickets) and Stuart Broad (109 Tests, 394 wickets) having played more Tests than him. Ravichandran Ashwin decodes Joe Root and Steve Smith batting styles During a recent interview with EspnCricinfo, Ashwin laid stress on his tactical preparation- a vital part of his game before he begins his preparation for a series. “I don’t think people lay enough emphasis on the tactical stuff. Not saying tactical preparation is mandatory, because I have played in cricket environments where people mostly want to rely on their abilities, their strengths, rather than focusing on tactics,” said Ashwin. The Tamil Nadu all rounder stated that he takes help from the team analysts to understand the batting patterns of different players; and that he minutely watches the ball by ball innings of the batsman he is planning to target. “When England came to India, I watched their whole Sri Lanka series without missing one ball. I would immediately go back to Hari [the India analyst] and ask him what speed [Lasith] Embuldeniya was bowling, what speed Dilruwan [Perera] was bowling, what percentage of balls were within the stumps. We have this app where we can sort, so I watched again all the Dilruwan Perera videos. “For example, Joe Root will not block two balls in a row. He’s got a slightly vulnerable defence. And I think he knows that. Or he’s constantly on the move. So every time he defends a ball comfortably outside off, the next ball will be a sweep,” remarked Ashwin. On Steve Smith’s batting style, Ashwin observed that the Aussie masterclass is more of a ‘momentum-driven batsman’. “And with Steve Smith, his batting is very momentum-driven. Most of his batting comes from his hands, so my whole idea was to disturb his hands through the series (2020-21). He’s got certain hand-movement patterns. You have to pick them and be able to bowl in a way that disturbs his hand pattern. So I bowled with different load-ups, different speeds, different run-ups and all that. I realised I kind of got to him,” said Ashwin. Via @ESPNcricinfo “Between 2018 and 2020, I contemplated giving up the sport at various point.” “I used to bowl six balls and then I used to be gasping for breath. There would be pain all over the place.” From here, R Ashwin now has most Test wickets of any player in 2021. — Kausthub Gudipati (@kaustats) December 21, 2021 ALSO READ: R Ashwin felt he was thrown under the bus after Ravi Shastri hailed Kuldeep Yadav as India’s no.1 overseas spinner. He had, as a result got the better of Smith three out of four times during the aforementioned Border-Gavaskar Trophy in Australia in 2020-21. Ashwin, meanwhile, is with the Indian team contingent in South Africa set to play a 3-match Test series beginning with the Boxing Day Test on December 26 in Centurion.     The post “Root’s got a vulnerable defence; Smith is ‘momentum-driven'”: Ravichandran Ashwin decodes Joe Root and Steve Smith batting technique in Test Cricket appeared first on The SportsRush.","pubDate":"2021-12-21 18:06:21","full_description":null,"image_url":null,"source_id":"thesportsrush"},{"title":"Viewers cast aside winless form to dominate opening round of Twenty20 series","link":"https://thewest.com.au/news/kalgoorlie-miner/viewers-cast-aside-winless-form-to-dominate-opening-round-of-twenty20-series-c-5034522","keywords":null,"creator":["Neale Harvey"],"video_url":null,"description":"Lake View emerged from the Eastern Goldfields Cricket Association’s Twenty20 double-header last weekend with two victories","content":null,"pubDate":"2021-12-21 18:00:00","full_description":null,"image_url":"https://images.thewest.com.au/publication/C-5034522/0ee2a5bf75b4fb4f59d64bb98bf8afe094347a94-16x9-x0y209w4000h2250.jpg","source_id":"thewest"},{"title":"The Coastal Times’ definitive guide to backyard cricket this Christmas","link":"https://www.perthnow.com.au/community-news/mandurah-coastal-times/the-coastal-times-definitive-guide-to-backyard-cricket-this-christmas-c-4668614","keywords":null,"creator":["Aaron Kirby"],"video_url":null,"description":"Backyard cricket is about as Aussie as it gets for Christmas entertainment, but to save time on rule debates the Coastal Times has come up with a beginners’ guide.","content":null,"pubDate":"2021-12-21 18:00:00","full_description":null,"image_url":"https://images.perthnow.com.au/publication/C-4668614/09b290f8eecb6dd1a8f8eac283e321aaf4b2b5ff-16x9-x0y0w3783h2128.jpg","source_id":"perthnow"},{"title":"Dhoni, Williamson two of the calmest guys in cricket: Mitchell Santner","link":"https://indianexpress.com/article/sports/cricket/dhoni-williamson-two-of-the-calmest-guys-in-cricket-santner-7684260/","keywords":["Cricket","Sports"],"creator":["Pratyush Raj"],"video_url":null,"description":null,"content":null,"pubDate":"2021-12-21 17:53:35","full_description":"For a country with a population under five million, New Zealand’s prowess on the sporting stage has always appeared to be disproportionate. The country has produced several Olympic champions in rowing, sailing, canoeing and athletics and is a force in team sports such as rugby and cricket. Mitchell Santner, the New Zealand left-arm spinner, believes the country’s outdoors culture has played a key role in its sporting success. “I guess we are very fortunate in having a lot of space to run around. We play a lot of sports growing up, which is a culture. I did the same. I tried to play everything I could,” Santner tells The Indian Express . “Although cricket was my kind of No. 1 sport, I started taking it seriously when I was 16 or 17. I played golf, soccer, tried my hand at rugby, but I was quite small at school, so it didn’t work out well. I was on the swimming team also. Playing different sports at a younger age benefitted me as a professional cricketer.” WTC win a boost for NZ cricket https://images.indianexpress.com/2020/08/1x1.png In a country where cricket is way behind the All Blacks in terms of popularity, the World Test Championship (WTC) win against India has given the sport a boost. “Winning the WTC was pretty special for cricket in our country. The conditions in Southampton were in our favour, but it was still an outstanding effort from the boys to win it. It was our first major title. It came after the heartbreaks of making it into the (World Cup) final of 2015, drawing the final of 2019. This time we went on to do one better and finally won the title,” says Santner. “If you talk to some of the former players from years ago, winning an ICC trophy was never on their radar. But with the kind of depth we have now, winning the title has become our top-most priority. READ | Yearender 2021: Kohli not mincing words, Rahane’s composure and Ashwin’s retort’ “We have been close to winning a couple of more titles. Black Caps are one of the best sides in the world now, and it will drive the next generations to pick up cricket. In the past few years, with the kind of results the team is producing, there is a shift in cricket in New Zealand. A lot of people are watching cricket, enjoying cricket; that also comes with the expectation of doing well.” “The fan culture in New Zealand is nowhere near India or Pakistan. But post the 2019 World Cup final, there is a lot of hype about cricket. People are talking cricket on the streets. Cricket is definitely growing in New Zealand.” Albeit it comprises just six teams, Santner credits the Kiwi domestic cricket system for the all the talent coming through to the national team. “At the moment, we are fortunate to have some outstanding players in the team; some are waiting in the wings for their opportunities. We have got good depth, and credit goes to the domestic system. Especially in the last 5-6 years, the depth has increased immensely. Lots of good cricketers are trying to make it through,” says Santner. “The level of competition is very high at the domestic level. So it keeps you on your toes if you are in the team.” The underdogs tag Before any ICC tournament, New Zealand have always been called the underdogs. They are never the firm favourites to win world titles, but they often end up having a great run. Santner believes the underdogs tag is one of the reasons behind New Zealand’s consistency in ICC events. “We kind of like the underdogs tag going into global tournaments. So as a team, we try and stay away from the pre-tournament hype. We try to keep it very simple, back our plans. Our strategy is to take it one game at a time, and it is working in the last few ICC events,” explains Santner. READ | Ajaz Patel: ‘My Perfect 10 came after a lot of dramatic changes in my life and hard work’ “I think in the last 5-6 years what has changed is that we focus a lot on preparation and planning before any major tournament. What we have seen in recent ICC events is that different guys are standing up in different matches, which is quite outstanding. We saw that in the (T20 World Cup) semi-final match against England ; Daryl Mitchell’s knock and his partnership with James Neesham turned things around for us. “Our philosophy is always ‘team first.’ We try to take out the selfish side. Everyone plays for the same goal. You can see the results of the last few years, and hopefully it will continue.” Losing World Cup finals New Zealand have lost three World Cup finals in the past six years, but Santner feels they are getting closer to winning. “Yes, we have lost a couple of finals in the last few years, but if you are putting yourself in those positions consistently, that itself is a massive achievement too. Hopefully, we will get that coveted trophy at some stage in the near future.” Playing under Dhoni and Williamson Apart from his New Zealand captain Kane Williamson , Santner has also played under MS Dhoni for Chennai Super Kings in the IPL. He calls them two of the calmest guys in cricket, but with different leadership styles. “Dhoni is a very instinctive captain. He has captained in a lot of games. He has been in tricky situations a lot. He just has the knack of knowing what will happen in the game. He will give you pretty good views from behind the stumps. It’s quite awesome to be involved with CSK for the last four years and to play under one of the greatest captains and players of our time. Top Sports News Now Yearender 2021: Kohli not mincing words, Rahane's composure and Ashwin's retort Shopkeeper’s son Siddharth Yadav in India U-19, one of many from small towns Ajaz Patel: 'My Perfect 10 came after a lot of dramatic changes in my life and hard work' Click here for more “On the other hand, Kane is someone who does a lot of planning beforehand. He is very relaxed and calm. It helps you as a player when you are under the pump.” Leading New Zealand Santner has been stand-in captain for New Zealand in three T20Is, most recently against India in Kolkata. He says watching the likes of Brendon McCullum , Dhoni and Kane Willamson from close quarters has helped him. “I have been lucky enough to play under Brendon, Kane and MS over the years. You note down stuff from your captains and try to implement it when you lead the team. If I manage to pick up a few stuffs from their rulebooks, I will do fine as a captain.” Santner feels exciting times are ahead with New Zealand’s home international cricket to be streamed live on the Amazon Prime Video OTT platform. “Amazon Prime Video is a big company in the global market, and it’s exciting from our point of view. Pretty excited to see how it unfolds,” he signs off.","image_url":null,"source_id":"indianexpress"},{"title":"Ashwin interview: R Ashwin exclaims he felt ‘absolutely crushed’ after Ravi Shastri termed Kuldeep Yadav as India’s no.1 overseas spinner","link":"https://thesportsrush.com/cricket-news-ashwin-interview-r-ashwin-exclaims-he-felt-absolutely-crushed-after-ravi-shastri-termed-kuldeep-yadav-as-indias-no-1-overseas-spinner/","keywords":["Cricket","kuldeep yadav","Ravi Shastri","Ravichandran Ashwin"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Ashwin interview: R Ashwin felt he was thrown under the bus after Ravi Shastri hailed Kuldeep Yadav as India’s no.1 overseas spinner. Having completed a decade in Test Cricket for India last month, Ravichandran Ashwin’s gleaming records in the format is evident enough to put him in the list of all-time greats in India’s rich… The post Ashwin interview: R Ashwin exclaims he felt ‘absolutely crushed’ after Ravi Shastri termed Kuldeep Yadav as India’s no.1 overseas spinner appeared first on The SportsRush.","content":"Ashwin interview: R Ashwin felt he was thrown under the bus after Ravi Shastri hailed Kuldeep Yadav as India’s no.1 overseas spinner. Having completed a decade in Test Cricket for India last month, Ravichandran Ashwin’s gleaming records in the format is evident enough to put him in the list of all-time greats in India’s rich Cricketing history. Having played mere 81 Tests, the 35-year-old is the second quickest to 400 Test wickets in the history of the game. A testimony to his greatness lies in the fact that since he has made his debut, no other bowler has taken more wickets than him. This, despite some of his immediate competitors- the likes of Nathan Lyon (99 Tests), James Anderson (104 Tests) and Stuart Broad (109 Tests) having played more Tests than him. As far as his dominance at home is concerned, Ashwin is second to none when it comes to spinners. ALSO READ: Ashwin likely to be picked by CSK in IPL 2022 mega auction. So when a person holding a record as impeccable as his, is compared to one who has played mere 7 Tests overall, be it in Tests overseas, one is bound to feel the excruciating prick. Ashwin interview: R Ashwin felt he was thrown under the bus post India’s maiden Test series victory in Australia During an interview with EspnCricinfo, India’s premier all rounder Ravichandran Ashwin opened up on a number of issues covering his struggles with injury, to thoughts of him contemplating his retirement at one point in time. He also shed light on how he felt ‘crushed’ after the then India head coach Ravi Shastri termed Kuldeep Yadav India’s no.1 overseas spinner following the latter’s five-for in Sydney Test in 2019. Post the draw in Sydney, Team India had created history by defeating the Aussies for the first time in a Test series Down Under. It was post this massive achievement, that Ravi Shastri had went on to remark that ‘there is a time for everyone (referring to Ashwin’s fitness and injury issues). But now Kuldeep is our frontline number one overseas spinner.’ Although having admitted being happy for his fellow team mate, Ashwin felt he was hard done by and was ‘thrown under the bus’ without getting due recognition for his match winning performance during the first Test in that series in Adelaide. “I hold Ravi bhai in high esteem. We all do. And I understand we all can say things and then retract them. In that moment, though, I felt crushed. Absolutely crushed. We all talk about how important it is to enjoy your team-mates’ success. And I was happy for Kuldeep. I have not been able to get a five-for but he has a five-for in Australia. I know how big it is. Even when I have bowled well [at other times], I haven’t ended up with a five-for. So I am genuinely happy for him. And it’s an extremely happy occasion, to win in Australia,” said Ashwin. “But if I have to come and partake in his happiness, and the success of the team, I must feel like I belong there. If I feel like I am being thrown under the bus, how am I supposed to get up and come for a party to enjoy the team’s or team-mate’s success? I went back to my room and then I spoke to my wife. And my children were there. So we were able to, you know, shrug it off, and I still made it to the party, because, end of the day, we had won a massive series,” he further added. “Boss, for me to not watch cricket is unreal.” Basically @ashwinravi99 is one of us. — Abhishek Mukherjee (@SachinAzharCT) (@ovshake42) December 21, 2021 India’s first win against Australia in that tour (2018/19) came on the back of the six wickets Ashwin had picked during the first Test in Adelaide. India went on to win that Test by 31 runs.     The post Ashwin interview: R Ashwin exclaims he felt ‘absolutely crushed’ after Ravi Shastri termed Kuldeep Yadav as India’s no.1 overseas spinner appeared first on The SportsRush.","pubDate":"2021-12-21 16:29:07","full_description":null,"image_url":null,"source_id":"thesportsrush"},{"title":"David Lloyd announces retirement from cricket commentary","link":"https://www.thehindu.com/sport/cricket/david-lloyd-announces-retirement-from-cricket-commentary/article38006744.ece","keywords":null,"creator":["PTI"],"video_url":null,"description":"David Lloyd announces retirement from commentary, invokes Elton John","content":null,"pubDate":"2021-12-21 16:17:07","full_description":null,"image_url":null,"source_id":"thehindu"},{"title":"David Lloyd leaves Sky Sports Cricket a month after 'racism' apology to Azeem Rafiq - The Telegraph","link":"https://news.google.com/__i/rss/rd/articles/CBMiZGh0dHBzOi8vd3d3LnRlbGVncmFwaC5jby51ay9jcmlja2V0LzIwMjEvMTIvMjEvYnVtYmxlLXJldGlyZXMtZGF2aWQtbGxveWQtbGVhdmVzLXNreS1zcG9ydHMtY3JpY2tldC_SAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"David Lloyd leaves Sky Sports Cricket a month after 'racism' apology to Azeem Rafiq  The TelegraphDavid 'Bumble' Lloyd retires from Sky Sports Cricket after 22 years  Sky SportsDavid 'Bumble' Lloyd set to leave the Sky Sports cricket commentary team after 22 years  Daily MailDavid Lloyd was a joyous antidote to today's bland commentators - Sky and the BBC need more pundits like him, not fewer  Telegraph.co.ukDavid Lloyd hangs up the mic as he leaves Sky commentary role  The Irish TimesView Full coverage on Google News","content":null,"pubDate":"2021-12-21 15:43:00","image_url":null,"source_id":"google"},{"title":"Paul Collingwood England coach: Why Paul Collingwood is selected as England team coach for T20I series vs West Indies?","link":"https://thesportsrush.com/cricket-news-paul-collingwood-england-coach-why-paul-collingwood-is-selected-as-england-team-coach-for-t20i-series-vs-west-indies/","keywords":["Cricket","England vs West Indies","Paul Collingwood"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Paul Collingwood England coach: Former England batter has been alleviated to the post of England team coach for T20Is against the Windies. The England men’s Cricket team is going through a torrid time in the ongoing Ashes 2021-22 series on Australian soil. Having not won an Ashes Test Down Under since 2011 under then captain… The post Paul Collingwood England coach: Why Paul Collingwood is selected as England team coach for T20I series vs West Indies? appeared first on The SportsRush.","content":"Paul Collingwood England coach: Former England batter has been alleviated to the post of England team coach for T20Is against the Windies. The England men’s Cricket team is going through a torrid time in the ongoing Ashes 2021-22 series on Australian soil. Having not won an Ashes Test Down Under since 2011 under then captain Andrew Strauss, the England Test team, with skipper Joe Root at the helm currently, might yet again embarrass themselves by keeping the record intact, lest they get together quickly for a turnaround. Having lost the Pink-Ball Test in Adelaide, they currently trail the Aussies 0-2, with three matches remaining. However, in another news, former England captain Paul Collingwood has been alleviated to the post of England head coach for the upcoming T20I series against West Indies, due to commence next month. His appointment comes at a time when Chris Silverwood- England head coach currently with the England Test side in Australia, is likely to face some heat following back-to-back one-sided losses at Brisbane and recently in Adelaide. Paul Collingwood England coach: Will Paul Collingwood replace Chris Silverwood as England coach? Chris Silverwood has taken series off from time to time in the last couple of years, owing to England’s busy Cricketing schedule. Thus, the decision to appoint Collingwood as the coach for Windies tour is another instance of the former taking a small break from his coaching duties. Collingwood had, during England’s ODI series against Ireland in the year 2020, led the team as head coach, while Graham Thorpe had taken over as the head coach during T20I series versus Pakistan later that year. Paul Collingwood has had a sofa made out of his old cricket shirts (: paulcollingwood5 / IG) pic.twitter.com/QZnKtQljjB — ESPNcricinfo (@ESPNcricinfo) June 16, 2021 Meanwhile, England are expected to name a squad for the West Indies tour next week, which is unlikely to include any of those involved in the ongoing Ashes Tests. The first of the five match T20I series will take place on January 2022, with the Kensington Oval in Barbados, to host all the five T20 Internationals. The likes of Jos Buttler, Dawid Malan and Jonny Bairstow are involved in the Ashes, while several players including Jofra Archer, Jason Roy, Sam and Tom Curran, Olly Stone, Lewis Gregory, Brydon Carse are currenlty down with injuries.         The post Paul Collingwood England coach: Why Paul Collingwood is selected as England team coach for T20I series vs West Indies? appeared first on The SportsRush.","pubDate":"2021-12-21 15:12:54","full_description":null,"image_url":null,"source_id":"thesportsrush"},{"title":"The ‘dark truth’ about Ole at Man Utd, ‘irresponsible’ Klopp and…","link":"https://www.football365.com/news/dark-truth-solskjaer-man-utd-klopp-liverpool-tottenham-kane-mailbox","keywords":["Chelsea","Front Page","Home Page","Liverpool","Mailbox","Manchester United","News","Tottenham Hotspur","mailbox","Mails","ole gunnar solskjaer"],"creator":["Joe Williams"],"video_url":null,"description":"Also in your afternoon Mailbox: Fixing … The post The ‘dark truth’ about Ole at Man Utd, ‘irresponsible’ Klopp and… appeared first on Football365.","content":"Are decisions still going Liverpool’s way? Was it just a myth about Ole Gunnar Solskjaer and the Man Utd academy? Keep your mails coming to theeditor@football365.com…   Short and sweet on Liverpool’s woes According to my commentary team, Robertson’s red card was Liverpool’s first in almost 2 years, and 79 premier league matches. So unless Pool fans would like to claim that their team play like angels, I’d say decisions are still very much going your way, overall. Ryan, Bermuda   Klopp’s ref criticisms are unfair I’m a Liverpool fan but I have to agree with the mail from John Collins in the Monday afternoon mailbox. Klopp’s comments about the ref were extremely irresponsible and out of line and as John rightly said, amplifies the awful abuse referees face on a daily basis especially online. It’s clear that so many Liverpool fans took their cue from him and not only did we see so much abuse of the ref on social media, but we also saw endless boring discussions about every other bad decision that has gone against Liverpool this season. Aside from Ronaldo v Messi, it’s hard to think of a more tedious topic than ‘see these other instances where my club didn’t get the right call from the referee’. Obviously we aren’t the only club which engages in this, but since this is my club I feel I need to do my part and call it out. The ref made some bad calls but everyone makes mistakes and most of us don’t have to do our jobs infront of thousands of people screaming abuse at you and expecting every big call to go in their favour. The fact that we live in a world in which such vile abuse of referees is considered normal (both on and off the pitch) is really quite something. Turiyo Damascene, Kigali, Rwanda   Refereeing… Over the last few weeks many teams have seen some extremely poor refereeing decisions. I watch quite a lot of bundesliga (I did say Sancho would take a season to settle) and Italian football and the level of officiating is much higher. Some common things which I think hold English referees back are a few biases which they need to ditch. 1. English refs seem to be scared of making big decisions in the first 10-20 minutes of game. Red cards penalties etc. – if a decision needs to be made the time it happens should never be a factor. Rules are rules. 2. English refs favour certain players. In both Gerrard and Beckham’s autobiographies, and also in comments from fergie too, they mention making an effort to be extra friendly with referees because it gets them favourable treatment. 3. Crowds – admittedly this plagues all refs everywhere. Refs should not be influenced by crowds but it’s no secret home teams get more decisions in their favour on average. Maybe take the ref off the field? We have enough tech these days that they can do their job from a special ref box. They’ll be less influenced by the crowd and they can’t be chased around by players either. More women – yeah, I know for all you “purists” out there you might not like the idea of female linesman and referees but when I’ve seen Massey officiate (which isn’t that often I’ll admit) she’s done a far better job than her male counterparts, she also doesn’t seem to get bullied by players either. That’s it. Lee   VAR needs to change I’ve always been fairly ambivalent about VAR. If they took it away tomorrow I wouldn’t care, but I’m also not spitting blood about the fact that it’s now a part of football. However, watching the Liverpool game on Sunday got me reflecting on the current state of VAR and how there is an element to it that makes absolutely no sense: the pitch side monitor. Currently, VAR is only supposed to intervene when there is a clear and obvious error. The VAR ref calls his mate and says “wait a minute Jeff, you’ve made a blunder here, you better go and have a look”. Consider that wording though. “Clear and obvious.” If the error is clear and obvious, why is there a need to check in on the pitch side monitor? The referee just literally just been told he’s made an “obvious” error. If he checks the screen and then doesn’t overturn his decision, one of two things is true: the VAR ref said there was an obvious error when there wasn’t or there was an obvious error but the referee ignores it. Either way one of them should lose their jobs. The Kane tackle is a perfect example of where surely the referee should at least be looking. Even if you think it wasn’t a red, it was definitely worth a second look. But the way the implementation of VAR works at the moment is that “go to the screen” means “change your mind, you got it wrong”. It’s almost certainly why the Kane decision wasn’t looked it. The VAR ref knows that if he asked the ref to check it, the ref has to send him off. There are two options here. 1) expand the number of decisions the ref can look at. Rather than “clear and obvious” it could be contentious decisions. The ref looks at the screen and maybe changes his mind, and maybe not. Rather than the near 100% of decisions that are currently changed when looking at the screen. 2) get rid of the screen. If it’s clear and obvious, just tell the ref he’s got it wrong and needs to change his mind, as they already do with offside. Speed up the game. The next thing that VAR needs to change is the clarity. In every other sport I’m aware of, fans can listen in to the decision being made. In rugby for example, it’s crystal clear. Even if you disagree with the decision, you can at least understand the logic behind it, and why it was made. However, football is just too cowardly to be put under that scrutiny. I think if we did hear the thought process it would highlight the fact that these decisions are often made without rhyme or reason. The refs can’t even explain why they made that call and making them do it in real time would expose that. When Liverpool played Man United this year I didn’t celebrate the first goal, because I thought it was offside and would be overturned. That’s the impact of VAR. It takes something away from football. If we’re going to sacrifice that, then it at least needs to get decisions right. At the moment it’s just a mess. Mike, LFC, London   Of course Liverpool fans are unhappy… Dear Editor Some predictable backlash from Spurs fans this morning in the mailbox- the usual whataboutery and accusations of lack of class that we all engage in (by the way, I’m not sure what is more indicative of a manager’s ‘class’, being the most vocal proponent of a collectivist attitude towards vaccination or moaning about dreadful referee performances). Of course Liverpool fans are unhappy about the fact that two game-changing decisions (Kane red and Jota penalty) went against them but while it’s us this week, next week it will some other set of fans who are complaining about poor decisions. The PL has the world’s best managers, the biggest collection of top players but a very mediocre set of officials. As fans we are much better off directing our dissatisfaction at the PGMOL rather than bitching at each other (as fun as that is!). There is one foreign referee, Jared Gillet, who was appointed this year and has officiated in four games this season, the lowest of any referee who has taken more than one game. The PL has thrived by attracting the best talent from all over the world, surely it’s time that we did that for officials as well? The PGMOL operates secretly both during and after games. In both cricket and rugby, the officials are miked up and when the TV official is involved we can hear the conversation between them. There are complications in doing this with football, in part because of the flow of the game leads to fewer breaks in play, but it is not beyond the wit of man or woman to resolve these. Being able to hear the real time rationale for decisions would a) keep refs honest and stop the pathetic post hoc rationalisation of bad decisions (Jota ‘stopping’ for instance when lining up a shot) that get leaked out and b) allow managers, players, pundits and fans to understand the process of decision making rather better and be more understanding that refs are humans who sometimes make mistakes. It won’t take controversy out of the game but sunlight really is the best disinfectant and will help both to raise standards of referring (and by extension professional and amateur punditry) and to restore some authority to referees. Andrew, Cambridge (LFC)   Just a quick one. Can everyone let me know the name of your local MP and I’ll write to them to make sure “Should Harry Kane have been sent off v Liverpool?” Is asked in Parliament. Thanks RossH   Enjoying the fallout from the Spurs – Liverpool game. Just a question for Liverpool fans – did Paul Tierney’s vendetta against you start before he refused to give James Milner a second yellow in the City game or was that part of it? Or maybe it was a bluff – throw everybody off the scent by giving an absolutely horrendous decision in your favour? Regards of the season, J, London Thank you mailbox, never change… If the bookies offered odds on the contents of the mailbox, I would make an absolute killing. It follows the same pattern whenever there’s a controversial decision involving Liverpool, especially if it’s gone against them. The first mailbox of the morning is full of Liverpool fans bemoaning the decision(s), the afternoon mailbox is a mixture of Liverpool fans continuing their complaints but with a few added “yeah, buts…” from opposition fans before we launch into full on “whataboutery” mode the following day. Every. Single. Time. You can guarantee whenever there is a bad tackle on a Liverpool player, some herbert will bring up the “VVD vs Napoli tackle” from 2018. Three years ago. For a challenge that was given as a free kick and VVD booked. Three years ago. And the Napoli player was able to play on (not stretchered off a la Elliot vs Leeds). Three frickin’ years ago! It’s as if, (in everyone else’s eyes at least), Liverpool fans are not allowed to complain because other incidents may have gone Liverpool’s way in the past, and woe betide anyone who has the temerity to question this. Regarding the officiating at the weekend, the two big decisions went against Liverpool before halftime. The general, agreed consensus is that Spurs should have been down to ten men and Liverpool should have had a penalty to go 2-1 up before half time. All the fluff about Dele’s outrageous dive (but Salah and Mane are the real divers, OK?), Matip’s foul on Winks (which was a foul but just outside the area), and Salah’s handball (which was incidental, not deliberate, therefore not a free kick) is irrelevant as it would have been a completely different game if the officials had done their jobs properly. Liverpool had every right to feel aggrieved at those decisions and no amount of “whataboutery” can change that. Just accept that Liverpool were hard done to on this occasion, it can happen you know! Regards, Duncan, Liverpool   Academic mistruths It’s can make you feel angry when you discover you’ve been lied to. It can also make you sad. Like when you find out <insert mythical seasonal character> doesn’t exist and your parents lied to you for 24 years. Complex and mixed emotions. Cue today, and the feel-good story about Lingard and Bruno sending a message to Angel Gomes for scoring his first goal in France. It’s nice, shows how these guys – Lingard in particular – are nice and actual friends with squad mates. But it pointed to a dark truth. It was Ole who failed to give Angel a decent chance, forcing him out. It was Ole who failed to support and play Lingard (even after showing what he could do at West Ham and this season) resulting in him probably leaving for free, Ole who continued to send Tuanzebe out on loan and will probably mean we lose him too and instead brought in Maguire, Ole who failed to give much development time to Hannibal, Mengi, Shoretire; who bought in extra back up keepers rather than use Henderson (who is now looking to go), who gave scant time to Elanga, Diallo and Pellestri. Who has kept sending players like Garner and Levitt out on pointless loans, instead playing aging players like Mata and Matic who are past it, or players who have rarely delivered like Pogba and Martial. Who bought and played AWB over Williams (who showed he could fill in for Shaw on the left too). Yes some of them are in the squad, but barely used. Instead he brought in players to go ahead of them in the queue, and may have cost us keeping some of them. Rashford and McTominay were already there, Greenwood a given. Angel should have been much the same, let alone Lingard. So, is it actually a myth about Ole and the academy? Does he not actually give youth a chance after all? I don’t know. There’s an argument can be made. But it’s a sad day if so. (Sancho can play either wing though, that’s a fact. And Ronaldo still isn’t carrying anyone.) Badwolf   Who are they kidding? The announcement by FIFA that a biennial World Cup would bring FIFA and additional $3.5B as a good thing for football is…so disingenuous. The self same organization whose members are in jail, awaiting sentencing or have not yet been rounded up for fraud. An organization that cares more about five star hotels and restaurants and will pay delegates for votes. At Euro 2020 players from the top 5 leagues played 71% of the minutes and 42% for the Copa America. So those clubs are bearing the burden of funding the players salaries and all the wrap around costs such as medical, physio and more. Clubs received some compensated but it would be spread across all the clubs providing players and is less than 10% of what FIFA brings in. Even the medical insurance should a player get injured has limits – it wouldn’t cover the costs of one of the top paid players. At a salary level of £100,000 per week, a top player is being paid approximately £20,000 per game – assuming going far in Champion’s League and at least one other cup. National teams play about 12 games a year not including tournaments, of which only a few are friendlies these days and clubs are legally bound to release their players. They do not receive compensation at the level of £20,000+ per game played. FIFA are slapping themselves on the back for coming up with this ‘great’ idea to fleece clubs by using their employees for a pittance while they rake in more money to be put into their own pockets. At least the Nations League idea pits similar level teams against each other creating more competitive games across the board. An expanded biennial World Cup is going to have far too many uncompetitive games, diluting it’s value, while attempting to skim off from a finite amount of sponsorship and broadcast funds. At some point the leagues and clubs will have to band together and fight this legally – to prevent organizations that regulate the game from competing with the participating teams. Paul McDevitt   Fixing AFCON AFCON is broken, but I can fix it. Managers moaning, players having to pick between international and wider career success, some teams being disadvantaged unfairly, integrity of the league damaged, calling up a whole continent of players in the middle of the season is rubbish for all involved, but it can be made more fair, much more easily. Call up every international player. Take the season disrupting international breaks of September, October, November and January, and have a month of international football. With far more fixtures, sides should call up more players and use greater rotation. UEFA and COMNEBOL can use this as a great opportunity to run through a full group of nations league fixtures, which helps logistically with them all being Europe based, and stops the local South American players from flying half way round the world every other month. Managers are on a more equal footing. Integrate the mid season break if we can get hold of one too, and stick it on the end, so teams can finish internationals and have a mini pre-season. It falls perfectly on 19/20 games played, so serves as a great half time refresher. Non-internationals can have more time off, whereas internationals would see greater rotation with a bigger squad. If AFCON wants to continue every 2 years, they’d have to squeeze their qualifying into the same period every other year. Whilst we’re at it too, take the March window and move it to the end of the season, extend it by a week if necessary to fit in fixtures, and again have bigger squads. These biannual training camps would give international managers more time to work with squads, to see them in training for their own teams, and would create a fairer playing field for the big money leagues. KC (a rather rare win-win-win scenario)   Weak argument Just got round to reading the mailbox and Marcel G outraged ‘Chelsea had 4 outfield players on the bench’ comment For your info Wolves have regularly failed to have a full bench all season, and have two goalkeepers as part of that too. They’re going to be totally screwed when AFCON starts and also lost players to Covid testing but they didn’t bleat about getting the game postponed. Your argument is weak so stop whining. This is exactly the reason clubs block the 5 subs, it only benefits the big 6 or 7 (whoever they are), not the rest of the league Bah I’m grumpy today Sara   No controversy Great match on Sunday between Spurs and Liverpool. So good to see that the introduction of VAR has ensured there isn’t any controversy about refereeing decisions that distract from the actual, you know, football. Not a problem in the Championship! Brian (BRFC)   Harry Kane… I know Kane is an easy target but even so, I thought the comparison you make with Robertson in your Winners and Losers column is unhelpful and disengous. For one Kane is a striker, not a full back, and they’ve always been different. When was the last time a player getting angry at being subbed wasn’t a striker? He probably does believe he was near the ball, especially as he admitted he hadn’t seen it back on camera (something you omitted to mention). Secondly, he was going for the ball (even if he was nowhere near it and Robertson could have been seriously injured). I have a lot of time for Robertson the player and person but that wasn’t a challenge, just a hack, and even his manager couldn’t defend it. Thirdly, Robertson’s apology was notable but on the field just after he’s done it, he has the Martin Keown look of having nothing wrong and argues with the ref. This isn’t to dig out Robertson. He’s one of the best full backs around, seems like a fun guy to go for a drink with and it was a classy apology. I wish he played for my club. I’ve just never been a big fan of pile ons, especially when specific information is left out. I don’t expect to change anyone’s mind but just thought it was important to speak up. Alexis London (wondering if you guys have an official number for highest and lowest emails in a day)   The post The ‘dark truth’ about Ole at Man Utd, ‘irresponsible’ Klopp and… appeared first on Football365.","pubDate":"2021-12-21 14:23:10","full_description":"Are decisions still going Liverpool’s way? Was it just a myth about Ole Gunnar Solskjaer and the Man Utd academy? Keep your mails coming to theeditor@football365.com… Short and sweet on Liverpool’s woes According to my commentary team, Robertson’s red card was Liverpool’s first in almost 2 years, and 79 premier league matches. So unless Pool fans would like to claim that their team play like angels, I’d say decisions are still very much going your way, overall. Ryan, Bermuda Klopp’s ref criticisms are unfair I’m a Liverpool fan but I have to agree with the mail from John Collins in the Monday afternoon mailbox . Klopp’s comments about the ref were extremely irresponsible and out of line and as John rightly said, amplifies the awful abuse referees face on a daily basis especially online. It’s clear that so many Liverpool fans took their cue from him and not only did we see so much abuse of the ref on social media, but we also saw endless boring discussions about every other bad decision that has gone against Liverpool this season. Aside from Ronaldo v Messi, it’s hard to think of a more tedious topic than ‘see these other instances where my club didn’t get the right call from the referee’. Obviously we aren’t the only club which engages in this, but since this is my club I feel I need to do my part and call it out. The ref made some bad calls but everyone makes mistakes and most of us don’t have to do our jobs infront of thousands of people screaming abuse at you and expecting every big call to go in their favour. The fact that we live in a world in which such vile abuse of referees is considered normal (both on and off the pitch) is really quite something. Turiyo Damascene, Kigali, Rwanda Refereeing… Over the last few weeks many teams have seen some extremely poor refereeing decisions. I watch quite a lot of bundesliga (I did say Sancho would take a season to settle) and Italian football and the level of officiating is much higher. Some common things which I think hold English referees back are a few biases which they need to ditch. 1. English refs seem to be scared of making big decisions in the first 10-20 minutes of game. Red cards penalties etc. – if a decision needs to be made the time it happens should never be a factor. Rules are rules. 2. English refs favour certain players. In both Gerrard and Beckham’s autobiographies, and also in comments from fergie too, they mention making an effort to be extra friendly with referees because it gets them favourable treatment. 3. Crowds – admittedly this plagues all refs everywhere. Refs should not be influenced by crowds but it’s no secret home teams get more decisions in their favour on average. Maybe take the ref off the field? We have enough tech these days that they can do their job from a special ref box. They’ll be less influenced by the crowd and they can’t be chased around by players either. More women – yeah, I know for all you “purists” out there you might not like the idea of female linesman and referees but when I’ve seen Massey officiate (which isn’t that often I’ll admit) she’s done a far better job than her male counterparts, she also doesn’t seem to get bullied by players either. That’s it. Lee VAR needs to change I’ve always been fairly ambivalent about VAR. If they took it away tomorrow I wouldn’t care, but I’m also not spitting blood about the fact that it’s now a part of football. However, watching the Liverpool game on Sunday got me reflecting on the current state of VAR and how there is an element to it that makes absolutely no sense: the pitch side monitor. Currently, VAR is only supposed to intervene when there is a clear and obvious error. The VAR ref calls his mate and says “wait a minute Jeff, you’ve made a blunder here, you better go and have a look”. Consider that wording though. “Clear and obvious.” If the error is clear and obvious, why is there a need to check in on the pitch side monitor? The referee just literally just been told he’s made an “obvious” error. If he checks the screen and then doesn’t overturn his decision, one of two things is true: the VAR ref said there was an obvious error when there wasn’t or there was an obvious error but the referee ignores it. Either way one of them should lose their jobs. The Kane tackle is a perfect example of where surely the referee should at least be looking. Even if you think it wasn’t a red, it was definitely worth a second look. But the way the implementation of VAR works at the moment is that “go to the screen” means “change your mind, you got it wrong”. It’s almost certainly why the Kane decision wasn’t looked it. The VAR ref knows that if he asked the ref to check it, the ref has to send him off. There are two options here. 1) expand the number of decisions the ref can look at. Rather than “clear and obvious” it could be contentious decisions. The ref looks at the screen and maybe changes his mind, and maybe not. Rather than the near 100% of decisions that are currently changed when looking at the screen. 2) get rid of the screen. If it’s clear and obvious, just tell the ref he’s got it wrong and needs to change his mind, as they already do with offside. Speed up the game. The next thing that VAR needs to change is the clarity. In every other sport I’m aware of, fans can listen in to the decision being made. In rugby for example, it’s crystal clear. Even if you disagree with the decision, you can at least understand the logic behind it, and why it was made. However, football is just too cowardly to be put under that scrutiny. I think if we did hear the thought process it would highlight the fact that these decisions are often made without rhyme or reason. The refs can’t even explain why they made that call and making them do it in real time would expose that. When Liverpool played Man United this year I didn’t celebrate the first goal, because I thought it was offside and would be overturned. That’s the impact of VAR. It takes something away from football. If we’re going to sacrifice that, then it at least needs to get decisions right. At the moment it’s just a mess. Mike, LFC, London Of course Liverpool fans are unhappy… Dear Editor Some predictable backlash from Spurs fans this morning in the mailbox- the usual whataboutery and accusations of lack of class that we all engage in (by the way, I’m not sure what is more indicative of a manager’s ‘class’, being the most vocal proponent of a collectivist attitude towards vaccination or moaning about dreadful referee performances). Of course Liverpool fans are unhappy about the fact that two game-changing decisions (Kane red and Jota penalty) went against them but while it’s us this week, next week it will some other set of fans who are complaining about poor decisions. The PL has the world’s best managers, the biggest collection of top players but a very mediocre set of officials. As fans we are much better off directing our dissatisfaction at the PGMOL rather than bitching at each other (as fun as that is!). There is one foreign referee, Jared Gillet, who was appointed this year and has officiated in four games this season, the lowest of any referee who has taken more than one game. The PL has thrived by attracting the best talent from all over the world, surely it’s time that we did that for officials as well? The PGMOL operates secretly both during and after games. In both cricket and rugby, the officials are miked up and when the TV official is involved we can hear the conversation between them. There are complications in doing this with football, in part because of the flow of the game leads to fewer breaks in play, but it is not beyond the wit of man or woman to resolve these. Being able to hear the real time rationale for decisions would a) keep refs honest and stop the pathetic post hoc rationalisation of bad decisions (Jota ‘stopping’ for instance when lining up a shot) that get leaked out and b) allow managers, players, pundits and fans to understand the process of decision making rather better and be more understanding that refs are humans who sometimes make mistakes. It won’t take controversy out of the game but sunlight really is the best disinfectant and will help both to raise standards of referring (and by extension professional and amateur punditry) and to restore some authority to referees. Andrew, Cambridge (LFC) Just a quick one. Can everyone let me know the name of your local MP and I’ll write to them to make sure “Should Harry Kane have been sent off v Liverpool?” Is asked in Parliament. Thanks RossH Enjoying the fallout from the Spurs – Liverpool game . Just a question for Liverpool fans – did Paul Tierney’s vendetta against you start before he refused to give James Milner a second yellow in the City game or was that part of it? Or maybe it was a bluff – throw everybody off the scent by giving an absolutely horrendous decision in your favour? Regards of the season, J, London Thank you mailbox, never change… If the bookies offered odds on the contents of the mailbox, I would make an absolute killing. It follows the same pattern whenever there’s a controversial decision involving Liverpool, especially if it’s gone against them. The first mailbox of the morning is full of Liverpool fans bemoaning the decision(s), the afternoon mailbox is a mixture of Liverpool fans continuing their complaints but with a few added “yeah, buts…” from opposition fans before we launch into full on “whataboutery” mode the following day. Every. Single. Time. You can guarantee whenever there is a bad tackle on a Liverpool player, some herbert will bring up the “VVD vs Napoli tackle” from 2018. Three years ago. For a challenge that was given as a free kick and VVD booked. Three years ago. And the Napoli player was able to play on (not stretchered off a la Elliot vs Leeds). Three frickin’ years ago! It’s as if, (in everyone else’s eyes at least), Liverpool fans are not allowed to complain because other incidents may have gone Liverpool’s way in the past, and woe betide anyone who has the temerity to question this. Regarding the officiating at the weekend, the two big decisions went against Liverpool before halftime. The general, agreed consensus is that Spurs should have been down to ten men and Liverpool should have had a penalty to go 2-1 up before half time. All the fluff about Dele’s outrageous dive (but Salah and Mane are the real divers, OK?), Matip’s foul on Winks (which was a foul but just outside the area), and Salah’s handball (which was incidental, not deliberate, therefore not a free kick) is irrelevant as it would have been a completely different game if the officials had done their jobs properly. Liverpool had every right to feel aggrieved at those decisions and no amount of “whataboutery” can change that. Just accept that Liverpool were hard done to on this occasion, it can happen you know! Regards, Duncan, Liverpool Academic mistruths It’s can make you feel angry when you discover you’ve been lied to. It can also make you sad. Like when you find out <insert mythical seasonal character> doesn’t exist and your parents lied to you for 24 years. Complex and mixed emotions. Cue today, and the feel-good story about Lingard and Bruno sending a message to Angel Gomes for scoring his first goal in France. It’s nice, shows how these guys – Lingard in particular – are nice and actual friends with squad mates. But it pointed to a dark truth. It was Ole who failed to give Angel a decent chance, forcing him out. It was Ole who failed to support and play Lingard (even after showing what he could do at West Ham and this season) resulting in him probably leaving for free, Ole who continued to send Tuanzebe out on loan and will probably mean we lose him too and instead brought in Maguire, Ole who failed to give much development time to Hannibal, Mengi, Shoretire; who bought in extra back up keepers rather than use Henderson (who is now looking to go), who gave scant time to Elanga, Diallo and Pellestri. Who has kept sending players like Garner and Levitt out on pointless loans, instead playing aging players like Mata and Matic who are past it, or players who have rarely delivered like Pogba and Martial. Who bought and played AWB over Williams (who showed he could fill in for Shaw on the left too). Yes some of them are in the squad, but barely used. Instead he brought in players to go ahead of them in the queue, and may have cost us keeping some of them. Rashford and McTominay were already there, Greenwood a given. Angel should have been much the same, let alone Lingard. So, is it actually a myth about Ole and the academy? Does he not actually give youth a chance after all? I don’t know. There’s an argument can be made. But it’s a sad day if so. (Sancho can play either wing though, that’s a fact. And Ronaldo still isn’t carrying anyone.) Badwolf Who are they kidding? The announcement by FIFA that a biennial World Cup would bring FIFA and additional $3.5B as a good thing for football is…so disingenuous. The self same organization whose members are in jail, awaiting sentencing or have not yet been rounded up for fraud. An organization that cares more about five star hotels and restaurants and will pay delegates for votes. At Euro 2020 players from the top 5 leagues played 71% of the minutes and 42% for the Copa America. So those clubs are bearing the burden of funding the players salaries and all the wrap around costs such as medical, physio and more. Clubs received some compensated but it would be spread across all the clubs providing players and is less than 10% of what FIFA brings in. Even the medical insurance should a player get injured has limits – it wouldn’t cover the costs of one of the top paid players. At a salary level of £100,000 per week, a top player is being paid approximately £20,000 per game – assuming going far in Champion’s League and at least one other cup. National teams play about 12 games a year not including tournaments, of which only a few are friendlies these days and clubs are legally bound to release their players. They do not receive compensation at the level of £20,000+ per game played. FIFA are slapping themselves on the back for coming up with this ‘great’ idea to fleece clubs by using their employees for a pittance while they rake in more money to be put into their own pockets. At least the Nations League idea pits similar level teams against each other creating more competitive games across the board. An expanded biennial World Cup is going to have far too many uncompetitive games, diluting it’s value, while attempting to skim off from a finite amount of sponsorship and broadcast funds. At some point the leagues and clubs will have to band together and fight this legally – to prevent organizations that regulate the game from competing with the participating teams. Paul McDevitt Fixing AFCON AFCON is broken, but I can fix it. Managers moaning, players having to pick between international and wider career success, some teams being disadvantaged unfairly, integrity of the league damaged, calling up a whole continent of players in the middle of the season is rubbish for all involved, but it can be made more fair, much more easily. Call up every international player. Take the season disrupting international breaks of September, October, November and January, and have a month of international football. With far more fixtures, sides should call up more players and use greater rotation. UEFA and COMNEBOL can use this as a great opportunity to run through a full group of nations league fixtures, which helps logistically with them all being Europe based, and stops the local South American players from flying half way round the world every other month. Managers are on a more equal footing. Integrate the mid season break if we can get hold of one too, and stick it on the end, so teams can finish internationals and have a mini pre-season. It falls perfectly on 19/20 games played, so serves as a great half time refresher. Non-internationals can have more time off, whereas internationals would see greater rotation with a bigger squad. If AFCON wants to continue every 2 years, they’d have to squeeze their qualifying into the same period every other year. Whilst we’re at it too, take the March window and move it to the end of the season, extend it by a week if necessary to fit in fixtures, and again have bigger squads. These biannual training camps would give international managers more time to work with squads, to see them in training for their own teams, and would create a fairer playing field for the big money leagues. KC (a rather rare win-win-win scenario) Weak argument Just got round to reading the mailbox and Marcel G outraged ‘Chelsea had 4 outfield players on the bench’ comment For your info Wolves have regularly failed to have a full bench all season, and have two goalkeepers as part of that too. They’re going to be totally screwed when AFCON starts and also lost players to Covid testing but they didn’t bleat about getting the game postponed. Your argument is weak so stop whining. This is exactly the reason clubs block the 5 subs, it only benefits the big 6 or 7 (whoever they are), not the rest of the league Bah I’m grumpy today Sara No controversy Great match on Sunday between Spurs and Liverpool. So good to see that the introduction of VAR has ensured there isn’t any controversy about refereeing decisions that distract from the actual, you know, football. Not a problem in the Championship! Brian (BRFC) Harry Kane… I know Kane is an easy target but even so, I thought the comparison you make with Robertson in your Winners and Losers column is unhelpful and disengous. For one Kane is a striker, not a full back, and they’ve always been different. When was the last time a player getting angry at being subbed wasn’t a striker? He probably does believe he was near the ball, especially as he admitted he hadn’t seen it back on camera (something you omitted to mention). Secondly, he was going for the ball (even if he was nowhere near it and Robertson could have been seriously injured). I have a lot of time for Robertson the player and person but that wasn’t a challenge, just a hack, and even his manager couldn’t defend it. Thirdly, Robertson’s apology was notable but on the field just after he’s done it, he has the Martin Keown look of having nothing wrong and argues with the ref. This isn’t to dig out Robertson. He’s one of the best full backs around, seems like a fun guy to go for a drink with and it was a classy apology. I wish he played for my club. I’ve just never been a big fan of pile ons, especially when specific information is left out. I don’t expect to change anyone’s mind but just thought it was important to speak up. Alexis London (wondering if you guys have an official number for highest and lowest emails in a day)","image_url":null,"source_id":"football365"},{"title":"Cricket-Pakistan&#039;s Abid diagnosed with heart condition after chest pain","link":"https://www.thestar.com.my/sport/cricket/2021/12/21/cricket-pakistan039s-abid-diagnosed-with-heart-condition-after-chest-pain","keywords":null,"creator":null,"video_url":null,"description":"(Reuters) - Pakistan opener Abid Ali has been diagnosed with acute coronary syndrome after he complained of chest pain during a domestic first-class match on Tuesday, the country's cricket board (PCB) said. Read full story","content":null,"pubDate":"2021-12-21 12:39:00","image_url":"https://apicms.thestar.com.my/uploads/images/2021/12/21/1415436.jpg","source_id":"thestar_my"},{"title":"David Lloyd Announces Retirement From Cricket Commentary","link":"https://sports.ndtv.com/cricket/david-lloyd-announces-retirement-from-cricket-commentary-2663409","keywords":null,"creator":null,"video_url":null,"description":"While announcing his decision, Lloyd said that the commentary box feels a little emptier following the departure of David Gower, Ian Botham and Michael Holding.","content":null,"pubDate":"2021-12-21 12:25:48","full_description":"Former England batter and coach David Lloyd on Tuesday announced his retirement from commentary. Lloyd was employed with Sky Sports and he was popularly known as 'Bumble' by his colleagues. While announcing his decision, Lloyd said that the commentary box feels a little emptier following the departure of David Gower, Ian Botham and Michael Holding. \"I've decided the time is now right to pass on the microphone,\" Lloyd said in a statement. \"It's been an immense privilege to try and bring the sport I love into people's homes up and down the country.\" pic.twitter.com/LXhLYdnfmh \"Sharing a commentary box in Australia in 2013 with my broadcasting hero Bill Lawry was a real highlight. It has been a great pleasure to work alongside Ian Bishop, Ravi Shastri, Shane Warne, Shaun Pollock, and Ian Smith amongst many others,\" he added. Further in his statement, Lloyd said: \"With the passing of Bob Willis and after the decision to move on by my good friends David Gower, Ian Botham and more recently, Michael Holding, the commentary box feels a little emptier. And so I feel it is time for me to do the same and move on to the next chapter.\" \"I leave the Sky box now in immensely capable hands led by my pals Michael Atherton, Nasser Hussain, Ian Ward and Rob Key. To those that follow, cherish that mic. Inform and entertain, so the next generation can fall in love with this wonderful game,\" he added. Promoted Lloyd's retirement news comes after a month he issued an apology to Yorkshire player Azeem Rafiq over an exchange in which he had questioned Rafiq's personal life. Lloyd had also made some disrespectful comments about the UK's Asian cricketing community.","image_url":"https://c.ndtvimg.com/2021-12/06ng1vk8_david-lloyd_120x90_21_December_21.jpg","source_id":"ndtv"},{"title":"Scott Boland added to Australian squad","link":"https://www.cairnspost.com.au/sport/cricket/scott-boland-added-to-australian-squad/video/24cb28df2a2b92109f60ba702e2051e1","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket: Fox Sports Cricket Reporter Justin Edwards joins the show to outline the impact of the COVID-19 situation on the Australian team as well as the changes to squad ahead of the Boxing Day test.","content":null,"pubDate":"2021-12-21 12:20:07","full_description":null,"image_url":null,"source_id":"cairnspost"},{"title":"Scott Boland added to Australian squad","link":"https://www.news.com.au/sport/cricket/scott-boland-added-to-australian-squad/video/24cb28df2a2b92109f60ba702e2051e1","keywords":null,"creator":null,"video_url":null,"description":"Cricket: Fox Sports Cricket Reporter Justin Edwards joins the show to outline the impact of the COVID-19 situation on the Australian team as well as the changes to squad ahead of the Boxing Day test.","content":null,"pubDate":"2021-12-21 12:20:07","full_description":null,"image_url":null,"source_id":"news"},{"title":"Cricket-Lloyd retires from commentary a month after Rafiq testimony and apology","link":"https://www.thestar.com.my/sport/cricket/2021/12/21/cricket-lloyd-retires-from-commentary-a-month-after-rafiq-testimony-and-apology","keywords":null,"creator":null,"video_url":null,"description":"(Reuters) - Cricket commentator David Lloyd announced his retirement from Sky Sports on Tuesday, a month after he was named by Azeem Rafiq in his testimony about a culture of widespread racism at his county club Yorkshire. Read full story","content":null,"pubDate":"2021-12-21 12:16:00","image_url":"https://apicms.thestar.com.my/uploads/images/2021/12/21/1415416.jpg","source_id":"thestar_my"},{"title":"Lloyd retires from cricket commentary team","link":"https://thewest.com.au/sport/cricket/lloyd-retires-from-cricket-commentary-team-c-5041973","keywords":null,"creator":["AAP"],"video_url":null,"description":"David Lloyd has announced his retirement from the cricket commentary box one month after he was named by Azeem Rafiq in the Yorkshire racism row.","content":null,"pubDate":"2021-12-21 12:13:32","full_description":null,"image_url":"https://images.thewest.com.au/publication/C-5041973/dfdb0c7010624645a90e05a8482169e7c2aee63b-16x9-x0y75w800h450.jpg","source_id":"thewest"},{"title":"Lloyd retires from cricket commentary team","link":"https://www.perthnow.com.au/sport/cricket/lloyd-retires-from-cricket-commentary-team-c-5041972","keywords":null,"creator":["AAP"],"video_url":null,"description":"David Lloyd has announced his retirement from the cricket commentary box one month after he was named by Azeem Rafiq in the Yorkshire racism row.","content":null,"pubDate":"2021-12-21 12:13:32","full_description":null,"image_url":"https://images.perthnow.com.au/publication/C-5041972/dfdb0c7010624645a90e05a8482169e7c2aee63b-16x9-x0y75w800h450.jpg","source_id":"perthnow"},{"title":"South Africa focused on beating India despite off-field woes","link":"https://timesofindia.indiatimes.com/sports/cricket/india-in-south-africa/south-africa-focused-on-beating-india-despite-off-field-woes/articleshow/88413324.cms","keywords":null,"creator":null,"video_url":null,"description":"Test captain Dean Elgar says he will not let the allegations of racist conduct that have come to light at Cricket South Africa in recent months become an excuse for failure as his side prepare to host India in a three-match series from Sunday.","content":null,"pubDate":"2021-12-21 12:02:24","full_description":null,"image_url":null,"source_id":"toi"},{"title":"Cricket-South Africa focused on beating India despite off-field woes","link":"https://www.thestar.com.my/sport/cricket/2021/12/21/cricket-south-africa-focused-on-beating-india-despite-off-field-woes","keywords":null,"creator":null,"video_url":null,"description":"(Please note offensive language in seventh paragraph) Read full story","content":null,"pubDate":"2021-12-21 11:52:00","image_url":"https://apicms.thestar.com.my/uploads/images/2021/12/21/1415385.jpg","source_id":"thestar_my"},{"title":"David ‘Bumble’ Lloyd leaves Sky Sports after 22 years in the commentary box","link":"https://www.breakingnews.ie/sport/david-bumble-lloyd-leaves-sky-sports-after-22-years-in-the-commentary-box-1231760.html","keywords":["Sport"],"creator":["BreakingNews.ie"],"video_url":null,"description":"Lloyd has been a popular part of Sky’s cricket coverage since 1999 with insightful analysis and witty remarks endearing him to a legion of fans.","content":null,"pubDate":"2021-12-21 11:20:42","full_description":null,"image_url":"https://img.resized.co/breaking-news/eyJkYXRhIjoie1widXJsXCI6XCJodHRwczpcXFwvXFxcL2ltYWdlcy5icmVha2luZ25ld3MuaWVcXFwvcHJvZFxcXC91cGxvYWRzXFxcLzIwMjFcXFwvMTJcXFwvMjExMjE1MzBcXFwvMi42NDQ1NDk3NS1lMTY0MDA4OTE5OTE5NS5qcGdcIixcIndpZHRoXCI6MTAyNCxcImhlaWdodFwiOm51bGwsXCJkZWZhdWx0XCI6XCJodHRwczpcXFwvXFxcL3d3dy5icmVha2luZ25ld3MuaWVcXFwvaW1hZ2VzXFxcL25vLWltYWdlLnBuZ1wiLFwib3B0aW9uc1wiOltdfSIsImhhc2giOiI3NjZjMzg0NDkyY2ExNzE1YTJlMDgzZTE4MzQ2NmYwYjdjMTYzZDhkIn0=/2-64454975-e1640089199195.jpg","source_id":"breakingnews_ie"},{"title":"‘Why are you captain then?’ Ricky Ponting adds to criticism of Joe Root - The Guardian","link":"https://news.google.com/__i/rss/rd/articles/CBMifWh0dHBzOi8vd3d3LnRoZWd1YXJkaWFuLmNvbS9zcG9ydC8yMDIxL2RlYy8yMS93aHktYXJlLXlvdS1jYXB0YWluLXRoZW4tcmlja3ktcG9udGluZy1qb2Utcm9vdC1hc2hlcy1hdXN0cmFsaWEtZW5nbGFuZC1jcmlja2V00gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"‘Why are you captain then?’ Ricky Ponting adds to criticism of Joe Root  The GuardianPonting can’t believe captain’s admission  NEWS.com.au'Recipe for disaster': Ponting picks apart England batters | HCL Ashes Analysis  cricket.com.auRoot under-fire amid captaincy questions  Busselton Dunsborough Mail‘Whose job is it?’: Root target in Ashes blame game  NEWS.com.auView Full coverage on Google News","content":null,"pubDate":"2021-12-21 10:57:00","image_url":null,"source_id":"google"},{"title":"Ashes 2021: Australia include THIS pacer in squad ahead of Boxing Day Test","link":"https://zeenews.india.com/cricket/ashes-2021-australia-include-this-pacer-in-squad-ahead-of-boxing-day-test-2421318.html","keywords":null,"creator":null,"video_url":null,"description":"The decision to add the uncapped Boland suggests that Cricket Australia (CA) has some fitness concerns over their fast bowlers, who have been England's nemesis so far in the series.","content":null,"pubDate":"2021-12-21 10:47:00","full_description":null,"image_url":null,"source_id":"zeenews"}]}