{"newsArray":[{"article_id":"303665a1e9ace8ab3d2c734d4d5baad0","title":"India breaks Pakistan record to achieve most wins in men's T20Is after Raipur triumph","link":"https://www.indiatvnews.com/sports/cricket/ind-vs-aus-india-breaks-pakistan-record-to-achieve-most-wins-in-men-s-t20is-after-raipur-triumph-2023-12-02-905329","keywords":null,"creator":null,"video_url":null,"description":"Team India stormed back into the ongoing five-match series against Australia with a series-clinching win in Raipur in the fourth T20I on Friday, December 1. The bowlers and batters combined to help India come up trumps by 20 runs despite a score of 174 not being a great one. The win not only helped India clinch the series and take an unassailable 3-1 lead but also become the most successful team in men's T20Is in terms of the number of wins.","content":"Team India stormed back into the ongoing five-match series against Australia with a series-clinching win in Raipur in the fourth T20I on Friday, December 1. The bowlers and batters combined to help India come up trumps by 20 runs despite a score of 174 not being a great one. The win not only helped India clinch the series and take an unassailable 3-1 lead but also become the most successful team in men's T20Is in terms of the number of wins. Team India broke Pakistan's record of most wins in men's T20Is as both were tied on 135 victories in the shortest format before Friday. No other team is even close as New Zealand, who are on third in the list have 102 wins to their name in the format. 136 - India, in 213 matches 135 - Pakistan, in 226 matches 102 - New Zealand, in 200 matches 95 - South Africa, in 171 matches 95 - Australia, in 181 matches Yes, India and Pakistan have played the most matches too but it is a no mean feat, which shows the consistency of the Men in Blue in the format over the years. Yes, the silverware has eluded since the inaugural World T20 edition in 2007, but the Indian team has been really consistent across formats and will hope that a repeat of 2007 is round the corner in T20Is. The preparation for the T20 World Cup 2024 has started for India with this series and the upcoming assignment against South Africa with the likes of Yashasvi Jaiswal, Rinku Singh and Mukesh Kumar coming good. Whether India stay with the young guns or a return of and is on the cards, only time will tell but for now, the team that is currently in action definitely holds promise.","pubDate":"2023-12-02 00:45:01","image_url":"https://resize.indiatvnews.com/en/resize/newbucket/715_-/2023/12/75930-1701456656.jpg","source_id":"indiatvnews","source_priority":10055,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"4feef1fb8b5578a7846f2c8b7e850ed8","title":"Harmanpreet to captain India in upcoming Tests","link":"http://www.newindianexpress.com/sport/cricket/2023/dec/02/harmanpreet-to-captain-india-in-upcoming-tests-2638068.html","keywords":null,"creator":null,"video_url":null,"description":"The squad for the T20I series against Australia will be announced later. After a hiatus of nine years, India will play two Tests on home soil. CHENNAI: Harmanpreet Kaur will lead the Indian squad in two Tests against England and Australia respectively, starting from December 14. BCCI has also announced the squad for the three-match T20I series against England. The squad for the T20I series against Australia will be announced later. After a hiatus of nine years, India will play two Tests on home soil. Saika Ishaque, one of the breakout performers from the Women’s Premier League and U19 T20 World Cup winner, Titas Sadhu, have found a place in the Test squad. After consistent performances, Shreyanka Patil has received a senior call-up for the first time. India’s T20Is squad vs England: Harmanpreet Kaur (C), Smriti Mandhana (VC), Jemimah Rodrigues, Shafali Verma, Deepti Sharma, Yastika Bhatia (wk), Richa Ghosh (wk), Amanjot Kaur, Shreyanka Patil, Mannat Kashyap, Saika Ishaque, Renuka Singh Thakur, Titas Sadhu, Pooja Vastrakar, Kanika Ahuja, Minnu Mani. For Tests vs England & Australia: H Kaur (C), S Mandhana (VC), J Rodrigues, Shafali Verma, Deepti Sharma, Y Bhatia (wk), Richa Ghosh (wk), Sneh Rana, Shubha Satheesh, Harleen Deol, Saika Ishaque, Renuka Thakur, Titas Sadhu, Meghna Singh, R Gayakwad, P Vastrakar.","content":"CHENNAI: Harmanpreet Kaur will lead the Indian squad in two Tests against England and Australia respectively, starting from December 14. BCCI has also announced the squad for the three-match T20I series against England. The squad for the T20I series against Australia will be announced later. After a hiatus of nine years, India will play two Tests on home soil. Saika Ishaque, one of the breakout performers from the Women’s Premier League and U19 T20 World Cup winner, Titas Sadhu, have found a place in the Test squad. After consistent performances, Shreyanka Patil has received a senior call-up for the first time. : Harmanpreet Kaur (C), Smriti Mandhana (VC), Jemimah Rodrigues, Shafali Verma, Deepti Sharma, Yastika Bhatia (wk), Richa Ghosh (wk), Amanjot Kaur, Shreyanka Patil, Mannat Kashyap, Saika Ishaque, Renuka Singh Thakur, Titas Sadhu, Pooja Vastrakar, Kanika Ahuja, Minnu Mani. : H Kaur (C), S Mandhana (VC), J Rodrigues, Shafali Verma, Deepti Sharma, Y Bhatia (wk), Richa Ghosh (wk), Sneh Rana, Shubha Satheesh, Harleen Deol, Saika Ishaque, Renuka Thakur, Titas Sadhu, Meghna Singh, R Gayakwad, P Vastrakar.","pubDate":"2023-12-02 00:33:00","image_url":"https://images.newindianexpress.com/uploads/user/imagelibrary/2023/12/2/original/333848W-preview.jpg","source_id":"newindianexpress","source_priority":15406,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"66d54a5135a1a71bbe2fc29d9be0f215","title":"77 स्लॉट.. 1166 खिलाड़ी, IPL 2024 के लिए हाई कंपटीशन, देखें प्लेयर्स की लिस्ट","link":"https://hindi.news18.com/cricket/1166-players-have-put-their-names-up-for-auction-for-77-slots-for-ipl-2024-7869444.html","keywords":null,"creator":null,"video_url":null,"description":"IPL 2024: आईपीएल 2024 के लिए टीमों और खिलाड़ियों ने पूरी तैयारी कर ली है. टूर्नामेंट के लिए ऑक्शन 19 दिसंबर को होना है. इसके पहले आईपीएल ने उन प्लेयर्स की लिस्ट शामिल कर दी है, जिन्होंने नीलामी के लिए अपना नाम दिया है.","content":"आईपीएल 2024 के लिए 1166 प्लेयर्स ने अपना नाम दिया है. (ipl) नई दिल्ली. आईपीएल (IPL 2024) के लिए सभी टीमें अपने-अपने खेमें प्लान करने में लग चुकी हैं. इसके लिए मिनी ऑक्शन में 3 हफ्ते से भी कम समय बचा हुआ है. वर्ल्ड कप में शानदार प्रदर्शन करने वाले खिलाड़ियों पर फ्रेंचाइजियों ने निश्चित तौर पर फोकस किया होगा. इसके अलावा कई युवाओं की उम्मीदें फ्रेंचाइजियों पर टिकी होंगी. आईपीएल ने शुक्रवार को आगामी सीजन के लिए 1166 खिलाड़ियों लंबी सूची शेयर की, जिन्होंने ऑक्शन के लिए अपना नाम दिया है. आईपीएल द्वारा दी गई सूची में एसोसिएट देशों के 45 खिलाड़ी शामिल हैं. इसके अलावा 909 अनकैप्ड खिलाड़ियों के नाम हैं जिसमें से 812 भारतीय हैं. लिस्ट में 18 कैप्ड भारतीय खिलाड़ी शामिल हैं. आईपीएल 2024 में 10 फ्रेंचाइजी हिस्सा ले रही हैं, जिनके पास भरने के लिए 77 स्लॉट हैं. इसमें से 30 स्लॉट विदेशी प्लेयर्स के लिए हो सकते हैं. वहीं, फ्रेंचाइजियों के कुल पर्स की बात करें तो नीलामी के लिए कुल 262.95 करोड़ रुपये रकम होगी. सबसे ज्यादा बेस प्राइस के साथ शामिल होने वाली खिलाड़ियों की लिस्ट में कुल 25 प्लेयर्स शामिल हैं. 2 करोड़ रुपये बेस प्राइस वाले खिलाड़ी हर्षल पटेल, शार्दुल ठाकुर, उमेश यादव, केदार जाधव, मुजीब उर रहमान, सीन एबॉट, पैट कमिंस, जोश हेजलवुड, ट्रैविस हेड, जोस इंग्लिस, मिचेल स्टार्क, स्टीव स्मिथ, मुस्ताफिजुर रहमान , टॉम बैंटन, हैरी ब्रुक, बेन डकेट, जेमी ओवरटन, आदिल राशिद, डेविड विली, क्रिस वोक्स, लॉकी फर्ग्यूसन, जेराल्ड कोएत्ज़ी, रिले रोसौव, रासी वैन डेर डुसेन, एंजेलो मैथ्यूज. 1.5 करोड़ रुपये बेस प्राइस वाले खिलाड़ी मोहम्मद नबी, मोइजेस हेनरिक्स, क्रिस लिन, केन रिचर्डसन, डैनियल सैम्स, डैनियल वॉरॉल, टॉम कुरेन, मर्चेंट डी लैंग, क्रिस जॉर्डन, डेविड मालन, टाइमल मिल्स, फिल साल्ट, कोरी एंडरसन , कॉलिन मुनरो, जिमी नीशम, टिम साउथी, कॉलिन इनग्राम, वानिंदु हसरंगा, जेसन होल्डर, शेरफेन रदरफोर्ड. IPL 2024: वर्ल्ड चैंपियन बनते ही बढ़े ऑस्ट्रेलियाई प्लेयर्स के दाम, ऑक्शन में टॉप बेस प्राइस से मारेंगे एंट्री, देखें लिस्ट 1 करोड़ रुपये बेस प्राइस वाले खिलाड़ी एश्टन एगर, रिले मेरेडिथ, डार्सी शॉर्ट, एश्टन टर्नर, गस एटकिंसन, सैम बिलिंग्स, माइकल ब्रेसवेल, मार्टिन गुप्टिल, काइल जैमीसन, एडम मिल्ने, डेरिल मिशेल, वेन पार्नेल, डेवाल्ड प्रिटोरियस, अल्ज़ारी जोसेफ, रोवमैन पॉवेल, डेविड विसे. . Tags: IPL , IPL Auction एक्टिंग डेब्यू के साथ सिंगिंग में आजमाया हाथ, 'दि आर्चीज' की रिलीज से पहले ही छाए वेदांग रैना Free Foods In Delhi: दिल्ली में इन जगहों पर घूमने के साथ-साथ खाएं फ्री खाना, जानें लोकेशन 3 दिन तक लगाए चक्कर, नहीं माने सुपरस्टार तो तेलुगू फिल्म दिखा किया राजी, रीमेक हिट होते ही मेकर हुए मालामाल","pubDate":"2023-12-02 00:31:03","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/10/IPL-Trophy-1-2023-10-ba91f9a0002954c954797250d0f742b8-3x2.jpg","source_id":"hindinews18","source_priority":6509,"country":["india"],"category":["sports"],"language":"hindi"},{"article_id":"c63226386bb9840be329892fe5904038","title":"Ex-Pakistan Test captain Salman Butt appointed to first official role since he was jailed in 2011 for spot-fixing, being named as a consultant to new chief selector Wahab Riaz","link":"https://www.dailymail.co.uk/sport/cricket/article-12816501/Ex-Pakistan-Test-captain-Salman-Butt-appointed-official-role-jailed-2011-spot-fixing-named-consultant-new-chief-selector-Wahab-Riaz.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"DAVID KENT: The Pakistan Cricket Board have named Butt as one of three consultants to new chief selector Wahab Riaz. Butt was jailed for 30 months for his part in a spot-fixing conspiracy.","content":"Ex-Pakistan Test captain Salman Butt appointed to first official role since he was jailed in 2011 for spot-fixing, being named as a consultant to new chief selector Wahab Riaz Ex-Pakistan Test captain Salman Butt has been appointed to his first official role It comes after he was jailed in 2011 for spot-fixing and spent 30 months in prison He will work as a consultant to Pakistan's new chief selector Wahab Riaz By David Kent for the Daily Mail Published: 18:46 EST, 1 December 2023 | Updated: 18:46 EST, 1 December 2023 e-mail View comments Former Pakistan Test captain Salman Butt has been appointed to a first official role since he was jailed for spot-fixing. The Pakistan Cricket Board have named Butt as one of three consultants to new chief selector Wahab Riaz. In 2011, Butt was jailed for 30 months for his part in a conspiracy to bowl deliberate no-balls during the Test against England at Lord’s the previous summer. Butt was also handed a 10-year ban, with five years suspended, for his role in the controversy, which involved team-mates Mohammad Asif and Mohammad Amir. Butt, who returned to play domestic cricket in 2016, will take up his role with immediate effect ahead of the T20 series against New Zealand in January. Former Pakistan Test captain Salman Butt (middle) has been appointed as a consultant to Pakistan's chief selector Wahab Riaz It comes after Butt was jailed for 30 months in 2011 after he was found guilty of spot-fixing Butt returned to domestic cricket in 2016 and will take up his new role with immediate effect The move follows an overhaul of Pakistan’s set-up after their early exit from the World Cup. Mohammad Hafeez has come in as team director, with Shan Masood named Test skipper and Shaheen Afridi leading the T20 side after Babar Azam stepped down as captain in all formats. The move comes following Pakistan's early Cricket World Cup exit, with Riaz also taking up a new position New Zealand Share or comment on this article: Ex-Pakistan Test captain Salman Butt appointed to first official role since he was jailed in 2011 for spot-fixing, being named as a consultant to new chief selector Wahab Riaz e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-12-01 23:46:38","image_url":"https://i.dailymail.co.uk/1s/2023/12/01/23/78490923-0-image-m-91_1701474133042.jpg","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"01572508f7b30f22452750da2934f0b1","title":"Harbhajan Singh questions Yuzvendra Chahal’s ODI selection for SA tour, calls it a ‘lollypop’","link":"https://thenewsmill.com/2023/12/harbhajan-singh-questions-yuzvendra-chahals-odi-selection-for-sa-tour-calls-it-a-lollypop/","keywords":["Cricket","Sports","ANI"],"creator":["ANI"],"video_url":null,"description":"The News Mill","content":"A day after India announced their squad for the all-important tour of South Africa, former spinner Harbhajan Singh on Friday questioned Yuzvendra Chahal’s selection for the tour, and said that they gave him a “lollypop to suck on.” On Thursday, the Board of Control for Cricket in India (BCCI)’s selection committee, named the Men in Blue’s squad for all three formats. Chahal has been included in the Indian ODI team for SA tour. While speaking on his official YouTube channel, Bhajji said that it was beyond his understanding why the 33-year-old was selected to the ODI squad but not for the T20I team. “There is no Yuzvendra Chahal in T20 format. You kept him in ODIs but not T20Is. They just gave him a lollypop to suck on. We won’t take in the format where you do well but will take for other formats. It’s beyond my understanding,” Harbhajan said on his YouTube channel. Meanwhile, the former spinner said that the Proteas tour won’t be easy for the Indian players and will be tough for the batters since the ‘Men in Blue’ won’t have Cheteshwar Pujara and Ajinkya Rahane in their squad. “South Africa tour is not easy. It’s tough for batters. There you won’t have Cheteshwar Pujara and Ajinkya Rahane. Youth are indeed getting opportunities. It’s a good thing. But I don’t think that selectors had a chat with Rahane, Pujara, or Umesh Yadav because whenever Yadav has played in Tests, he has performed,” he added. On the other hand, following his inclusion on the ODI squad, Chahal took to his official social media account and wrote, “Here we go AGAIN!” https://x.com/yuzi_chahal/status/1730240586202878304?s=20 The tour will begin with the three-match T20I affair on December 10 at the Kingsmead Stadium. The second T20I will be played on December 12 at the St George’s Oval. The 20-over format will conclude on December 14 at the Wanderers Stadium. The 50-over clash will kick off on December 17 at the Wanderers Stadium. The second and final ODI will be played on December 19 and December 21 respectively. India’s squad for Tests: Rohit Sharma (C), Shubman Gill, Yashasvi Jaiswal, Virat Kohli, Shreyas Iyer, Ruturaj Gaikwad, Ishan Kishan (wk), KL Rahul (Wk), Ravichandran Ashwin, Ravindra Jadeja, Shardul Thakur, Mohd. Siraj, Mukesh Kumar, Mohd. Shami*, Jasprit Bumrah (VC), Prasidh Krishna. India’s squad for 3 T20Is: Yashasvi Jaiswal, Shubman Gill, Ruturaj Gaikwad, Tilak Varma, Suryakumar Yadav (C), Rinku Singh, Shreyas Iyer, Ishan Kishan (Wk), Jitesh Sharma (Wk), Ravindra Jadeja (VC), Washington Sundar, Ravi Bishnoi, Kuldeep Yadav, Arshdeep Singh, Mohd. Siraj, Mukesh Kumar, Deepak Chahar. India’s squad for 3 ODIs: Ruturaj Gaikwad, Sai Sudharsan, Tilak Varma, Rajat Patidar, Rinku Singh, Shreyas Iyer, KL Rahul (C) (Wk), Sanju Samson (Wk), Axar Patel, Washington Sundar, Kuldeep Yadav, Yuzvendra Chahal, Mukesh Kumar, Avesh Khan, Arshdeep Singh, Deepak Chahar. (ANI)","pubDate":"2023-12-01 23:31:06","image_url":"https://thenewsmill.com/wp-content/uploads/2023/12/harbhajan-singh-questions-yuzvendra-chahals-odi-selection-for-sa-tour-calls-it-a-lollypop.jpg","source_id":"thenewsmill","source_priority":3781717,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"4e20310fdfa2393c84f6ab21dbc4b857","title":"Danny Macklin reveals he has been found safe in Cornwall by police officers after appeal had been launched to find ex-AFC Wimbledon managing director following worrying social media posts - days on from his FA charge of misconduct","link":"https://www.dailymail.co.uk/sport/football/article-12816295/Danny-Macklin-reveals-safe-Cornwall-police-officers-appeal-launched-ex-AFC-Wimbledon-managing-director-following-worrying-social-media-posts-days-FA-charge-misconduct.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"He was last seen on foot in Great Notley near Braintree in Essex on Friday, but according to a Tweet posted on his X (formerly Twitter account) was found in Looe in Cornwall.","content":"Danny Macklin reveals he has been found safe in Cornwall by police officers after appeal had been launched to find ex-AFC Wimbledon managing director following worrying social media posts - days on from his FA charge of misconduct Former AFC Wimbledon chief Danny Macklin says he has been found safe An appeal had been launched to find MR Macklin after he had gone missing Mr Macklin stated that he was found in Looe, in Cornwall by Police on Friday By Ed Carruthers For Mailonline Published: 17:23 EST, 1 December 2023 | Updated: 17:58 EST, 1 December 2023 e-mail Former AFC Wimbledon managing director Danny Macklin has revealed he has been found safe in Cornwall by police officers, following an appeal to find the 32-year-old after he went missing, having also posted a worrying message on his social media. He was last seen on foot in Great Notley near Braintree in Essex on Friday, but according to a Tweet posted on his X (formerly Twitter ) account he was found safe in Looe, Cornwall. He wrote on his X account: 'I have been found safely by Cornwall Police in Looe just prior to going into what I can assure you was cold sea water! 'Thank you for all the well wishes - I will seek the help I need and sorry for the terrible pain I have caused so many and then seek to rebuild my career/life.' Mr Macklin had been charged with misconduct by the Football Association on Tuesday after hidden camera recordings unveiled the former Wimbledon director made abusive comments towards a female colleague. Danny Macklin has revealed on his social media that he has been found safe after he had gone missing Mr Macklin wrote on X (formerly Twitter) that he had been found by Cornwall Police in Looe The comments were made about Wimbledon's head of supporter services and ticketing Rebecca Markham. Mr Macklin was given until December 6 to provide the FA with a response. He said that he was 'not sexist' but said the private conversation was '100 per cent at fault' and revealed that his 'life is in tatters'. He added that the comments 'had caused so much pain for so many people' and deeply regretted his words. In his message on social media, Mr Macklin also apologised to his wife Claire and his Children, Harry and Ruby stating that he had been 'the opposite of a good husband'. He wrote: 'I should have put family first, not the determination to be a CEO in the Premier League.' Essex Police had issued a statement on Friday asking members of the public for any information on Mr Macklin's whereabouts. In a statement, they said: 'We want to find Danny Macklin, 32, last seen on foot in Great Notley at 10.50am,' police released in a statement. 'Danny is 6ft 4in, with a shaved head, wearing a long black coat, a grey and black bobble hat, black jeans and grey and white trainers. 'Please call 999 with incident 372 of today, 1 December.' AFC Wimbledon released a statement in response to the allegations ahead of the FA's charge One of Macklin's old clubs Leyton Orient gave their support, saying 'we are here for you' Mr Macklin, who left his post at Wimbledon on September 8, has also held positions at Leyton Orient, Southend United and Essex County Cricket Club. Orient posted a message of support for Mr Macklin on social media on Friday saying: 'Danny, we can't begin to understand how you are feeling right now but please just know that we are all here for you,' the club said in a statement. 'It takes a strong person to admit their mistakes, which you have done, and an even stronger one to overcome the adversity that follows them. We know you can do this too. We hope that the number of messages you have received today prove to you how valuable you are to this world. 'We are all here for you and will give you all the help you need.' More to follow... For confidential support call the Samaritans on 116123 or go to samaritans.org Twitter Wimbledon Share or comment on this article: Danny Macklin reveals he has been found safe in Cornwall by police officers after appeal had been launched to find ex-AFC Wimbledon managing director following worrying social media posts - days on from his FA charge of misconduct e-mail Sorry we are not currently accepting comments on this article.","pubDate":"2023-12-01 22:58:29","image_url":"https://i.dailymail.co.uk/1s/2023/12/01/22/78489439-0-image-a-114_1701469517873.jpg","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"dd7c1d6f88f2332f563bfec2ba32178e","title":"$137m war erupts over relocation plan for AFL and cricket during Gabba redevelopment for Olympics","link":"https://7news.com.au/sport/olympics/137m-war-erupts-over-relocation-plan-for-afl-and-cricket-during-gabba-redevelopment-for-olympics-c-12759609","keywords":null,"creator":["Laine Clark"],"video_url":null,"description":"‘They have hung the AFL and cricket out to dry.’","content":"A row has erupted over a temporary home for and in Brisbane, with the Queensland government warned its major project is “not a done deal”. Brisbane Lord Mayor Adrian Schrinner has refused to back a funding plan for a $137 million RNA Showgrounds revamp, accusing the government of mismanagement. The sports minister on Friday unveiled the plan to renovate the inner-city showgrounds, creating a base for the and Queensland Cricket during the Gabba Olympic rebuild. However, Stirling Hinchliffe said the state government would commit only $47.5 million, with the Brisbane City Council, Lions, cricket and RNA to pay the rest. Mr Schrinner wasn’t happy. “They decided to knock down the Gabba and they should also provide a temporary venue,” he said. “The government needs to fix the problem that they have created. They are trying to put the cost on to the ratepayers of Brisbane - we won’t have it. “This is not going to happen based on this funding model. This is not a done deal.” Mr Schrinner said the sports minister told him the $2.7 billion Gabba rebuild budget included relocation costs for the Lions and Queensland Cricket. Under the revamp plans, a 20,000-seat stadium will be built at the showgrounds that will be scaled back to 12,000 after the 2032 Games. The lord mayor said it made sense to revamp the showgrounds and was happy to discuss a “minor” funding contribution. “But for the state government ... to expect council to fund the majority of the project ... it is really disorganised planning on the state government’s part,” he said. “They seem to be playing political games and they have also hung out the AFL and cricket to dry.” Mr Schrinner claimed to have been kept in the dark, saying the state government told him last week an announcement for a temporary cricket and AFL venue was months away. He claimed the first he heard about the revamp project was via a “rushed” letter sent by Mr Hinchliffe late Thursday night. “I expect they had already told the media before they told us - it’s just not polite and it’s no way to manage a major project,” he said. “This is not the way you enter into a genuine partnership.” Mr Hinchliffe denied he had kept the lord mayor in the dark, accusing Mr Schrinner of the silent treatment. “The lord mayor has refused to respond to a phone call I made to him yesterday,” he said. “It became clear from the response from his office that there was going to be no further conversation between myself and the lord mayor immediately.” Asked why he had gone ahead with a Friday media conference, Mr Hinchliffe said: “It was important that we shared this information with the other stakeholders and with the community.” He said progress would need to be made soon if the revamp was going to be ready in time. “We know work needs to be starting next year for the refurbished main arena to be ready for a 2025-26 cricket season,” he said. “But this is the beginning of the negotiations that we need to have. “So I am very pleased we are able to identify what this project looks like and start working with all the partners on delivering an outcome.” The Lions backed a showgrounds relocation, describing Friday’s announcement as a “starting point”. “We will continue dialogue with government and other stakeholders regarding progressing the RNA as quickly as possible to ensure the project can be funded and the club is supported through displacement,” Lions CEO Greg Swann said.","pubDate":"2023-12-01 22:52:12","image_url":"https://images.7news.com.au/publication/C-12759609/2ad46ef695f5497249463a2ca4abe423e3d6d560-16x9-x0y0w1920h1080.jpg","source_id":"7news","source_priority":7652,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"8ab0aba3d575650602e9e32463c32047","title":"Danny Macklin: Ex-AFC Wimbledon chief confirms he's been \"found safely\" after police search","link":"https://www.mirror.co.uk/sport/football/news/danny-macklin-found-afc-wimbledon-31578957","keywords":["Sport"],"creator":["mirrornews@mirror.co.uk (Darren Wells)"],"video_url":null,"description":"Police launched an appeal for information regarding Danny Macklin's whereabouts just days after the former AFC Wimbledon chief was charged by the FA in relation to allegations made by a colleague","content":"Former AFC Wimbledon chief Danny Macklin has confirmed he's been \"found safely\" following a police search after concerns grew for his welfare. Police launched an appeal for information as to his whereabouts on Friday after he was last spotted in Great Notley, Essex at 10:50am. Macklin issued a message later on Friday to state he had been in contact with police in Looe, Cornwall, adding: \"Thank you for all the well wishes - I will seek the help I need and sorry for the terrible pain I have caused so many and then seek to rebuild my career / life.\" Macklin has held a number of executive roles in sport, including at Leyton Orient, Southend United and Essex County Cricket Club. He was managing director of AFC Wimbledon but left earlier this season after allegations were made against him by a colleague. He was charged by the FA on Wednesday in relation to those allegations before going missing on Friday, prompting a spokesperson for Essex Police to issue a statement which read: \"If you have seen Danny or have any information that may help us find him, please call 999 quoting incident 372 of Friday December 1.\" Football fans responded to Macklin's message by issuing their heartfelt thanks he was safe. Braintree Town FC wrote: \"We're all extremely glad to hear you are safe Danny, from the whole of the huge family you have at Braintree Town we wish you all the best and for your future safety.\" If you're struggling and need to talk, the Samaritans operate a free helpline open 24/7 on 116 123. Alternatively, you can email jo@samaritans.org or visit their site to find your local branch.","pubDate":"2023-12-01 22:51:12","image_url":"https://i2-prod.mirror.co.uk/incoming/article31576136.ece/ALTERNATES/s615/3_danny-macklin-the-first-interview.jpg","source_id":"mirroruk","source_priority":910,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"a650749b7a63736d1e0387e1a4023503","title":"20 years on, a transformed New Zealand looks back at ‘Lord of the Rings’","link":"https://www.mercurynews.com/2023/12/01/20-years-on-a-transformed-new-zealand-looks-back-at-lord-of-the-rings/","keywords":["Entertainment","Movies","Things To Do","Travel","network"],"creator":["Tribune News Service"],"video_url":null,"description":"The farmland that Jackson's crew turned into Hobbiton, the fictional Middle-earth village where the films are set, has drawn as many as 650,000 visitors a year, making it one of the top attractions in a country that relied on tourism for about 20% of its export earnings, pre-pandemic.","content":"WELLINGTON, New Zealand — New Zealand was primarily known abroad for its sheep, its wine and its rugby team on the September day in 1998 that filmmaker Peter Jackson’s helicopter landed on a sprawling family farm about 100 miles south of Auckland. The country’s film industry was another matter: Though New Zealand had produced crossover successes like Jackson’s “Heavenly Creatures” and Jane Campion’s Oscar winner “The Piano,” it was nearly as far from the thinking of Hollywood studios as it was from Hollywood itself. But that was about to change. The lush farmland on which Jackson’s crew alighted would soon become the backdrop for “The Lord of the Rings,” one of the most ambitious, influential and profitable film series ever made. And in the two decades since the release of “The Return of the King,” the Oscar-winning final film in Jackson’s trilogy, New Zealand has become a major player in the global motion picture industry. “It absolutely put us on the map,” said Jasmine Millet, head of creative industries at Tataki Auckland Unlimited and an advocate for the region’s filmmaking industry. “People started thinking about New Zealand, wanting to visit New Zealand en masse in a way that they never would have without those films. “The industry was already building up. That whole filmmaking process and that language of cinematic storytelling, all of that stuff was ready and ripe. What Peter and the team did was just absolutely take it to the next level.” The three films, combined for 30 Academy Award nominations and 17 wins and earned nearly $3 billion in worldwide box office receipts. It also pioneered new technologies in special effects and software systems and advancing the use of motion capture to animate digital characters. The movies were so popular they inspired a second Oscar-nominated trilogy, a decade later, which spurred its own tourism industry. The farmland that Jackson’s crew turned into Hobbiton, the fictional Middle-earth village where the films are set, has drawn as many as 650,000 visitors a year, making it one of the top attractions in a country that relied on tourism for about 20% of its export earnings, pre-pandemic. Before COVID-19, nearly one in five visitors said their decision to come to New Zealand was influenced by the hobbit films. “The trilogy is just a big advertisement for New Zealand,” said Shayne Forrest, general manager for tourism at the 12-acre Hobbiton movie set. “The filmmakers that made these movies, Peter Jackson and all his team, they’re all New Zealanders. So it really got to showcase New Zealand as being a creative hub that could punch well above its weight in the international arena.” Their success reversed an exodus that once saw successful filmmakers such as Campion and Lee Tamahori (“Once Were Warriors”) leave New Zealand to work in the U.S., Italy and the U.K. In 1998, the year Jackson began scouting locations for his Tolkien films, just five features made in New Zealand were released in theaters. Less than a decade later the country was turning out twice as many annually; among the major productions that followed “The Lord of the Rings” were “King Kong,” Disney’s live-action “Mulan,” James Cameron’s two and the first two installments of “The Chronicles of Narnia.” New Zealand’s film industry now generates about $2.08 billion in GDP annually. Millet said the transition from so-called “swords and sandals” TV series such as “Xena: Warrior Princess” and “Hercules: the Legendary Journeys” to more substantial storytelling began with which won three Academy Awards and was the highest-grossing New Zealand film of all time when it came out in 1993. “It got us to thinking, ‘What are our stories? How do we work as filmmakers, what’s our unique take on this craft?’” she said of Campion’s film, which was shot largely in and around Auckland. “So when Peter came with the opportunity of ‘The Lord of the Rings’ films, he knew that there was this whole seedbed of talent that was already here and that had this way of working that was really a group of friends, in many ways, who wanted to bring their best in a super-creative way, workshopping ideas. “That was the preparation, that gave him the confidence to say, ‘I can make this incredible trilogy at home. I don’t need to go somewhere else.’ And even though it blew everybody away, at some level from the New Zealand perspective, it was kind of like ‘Yeah, we know how to do this. This is in our blood.’” For Jackson, it helped that Richard Taylor had become one of his friends. The two met in Wellington, Taylor said, when Jackson was still living at home with his parents and working on his first movie, the 1987 science-fiction comedy horror film “Bad Taste.” “He saw our work on television and, through a mutual friend, we were introduced to him,” said Taylor, who along with his wife, Tania Rodger, went on to work on Jackson’s second film, the low-budget 1989 black comedy “Meet the Feebles.” That work won Taylor and Rodger a New Zealand film award; after carefully wrapping the prize in napkins for the trip back to Wellington, Taylor turned to Rodger and said “we better treasure this moment, because it won’t get better than this.” Of course, it didn’t exactly play out that way. After collaborating on Jackson’s next three films, “The Lord of the Rings” series brought Taylor’s Weta Workshop — founded alongside Rodger and Jackson and named after a species of giant flightless cricket endemic to New Zealand — the first of its five Academy Awards. The statuettes, displayed in a floor-to-ceiling display case off the workshop’s main lobby alongside miniature collectibles Wētā Workshop created for films and other projects, have all had their nameplates removed. “They say that I won them, but I didn’t win them. I collected them for a group of people back home,” said Taylor, who, like Jackson, was knighted in 2010 for his services to film in New Zealand. Taylor and a staff of 36 were working out of a building they shared with an ice cream manufacturer when Jackson gave him his choice of creative departments for “The Lord of the Rings.” Taylor chose to look after the design and creation of armor, weapons, miniatures, special makeup effects and prosthetics, and though the average age of the Weta Workshop staff was just 22 when they got going and only one-eighth of the crew had ever worked on a film or TV show before, the studio built more than 48,000 separate items for the trilogy. “You teeter toward the edge of the cliff and you can either leap off with faith [and] hope the wind catches under your wings, or step back from the edge of the cliff,” Taylor said. “So yeah, it’s where ‘LOTR’ all started for us, when Peter gave us that magical phone call.” Weta Workshop now has a staff of approximately 400 working out of multiple buildings on Wellington’s Miramar peninsula, making everything from movie props to museum exhibits, consumer products, video gaming, sculptures and collectibles. For Taylor, who started the company that would become the Wētā Workshop with Rodger in a back room of the Wellington flat they shared, the workshop’s growth in both size and prestige was born of the same innovation and can-do spirit that fueled the rise of New Zealand’s film industry. “Certainly Peter could have picked up and just headed off overseas and made films on the global circuit,” said David Wilks, general manager of the Wētā Workshop. “But this is where they wanted to put down roots and make a base. One of the things we’ve prided ourselves in is, we’ve now built a sustainable creative career for a whole bunch of artisans.” “New Zealand had a film industry that had been around a long time,” Wilks continued. “But ‘Lord of the Rings’ supercharged what we could do on the world stage.” It was the country that made the movie, Taylor insists, not the other way around. “There’s no doubt that you could have made an adaptation of ‘The Lord of the Rings’ in any country with any film company with any populace. It just wouldn’t have been this ‘Lord of the Rings,’” he said. “The benefits once you actually come to New Zealand are huge, the exchange rate being one of them,” he continued. “New Zealand crew still get together for the love of making a movie. They don’t get together because of the good business of working on a film. There’s a very fundamental difference in that. “That’s something that resonates with film directors and producers that come from overseas. That can-do Kiwi spirit. There’s no ‘that’s impossible.’ You just don’t have that.” Nature, however, may have provided New Zealand’s filmmakers with their most valuable asset. “The geographic benefit of New Zealand is that you can be in Wellington, with all the infrastructure necessary to make a major feature film [and with] one-and-a-half hours’ flight, you can reach anywhere in the world … visually. The only thing that New Zealand doesn’t really do is sand-swept deserts,” Taylor said. “Somewhere as diverse as Middle-earth, we’re on a journey from pastoral Hobbiton to apocalyptic Mordor. That demands that you are able to traverse an incredible diversity of environments. That’s what New Zealand could offer.” What Jackson’s team was looking for the day their helicopter circled the Alexander family’s 1,250-acre sheep and beef farm, located at the base of Kaimai Range on New Zealand’s North Island, were unspoiled pastures, green rolling hills, gnarled trees and wet, foggy weather to stand in for the fictional Shire of the Tolkien novels. What they found was a location so remote, so pristine, that the New Zealand army was enlisted to build roads to get the filmmaker’s equipment in and out. The soldiers were then recruited to act in the movies’ battle scenes. Soon enough, the films were inspiring fans to make pilgrimages to the tiny town of Matamata, a two-hour drive from Auckland, to pad around the farm — even though the sets built for the original trilogy were demolished when filming was finished. When Jackson returned 10 years later and asked the Alexanders for permission to film “The Hobbit” on their property, it came with a condition: This time, the structures built for the project had to be permanent. So the filmmakers left behind 44 hobbit holes, the Green Dragon Inn and dozens of other props, turning the farm into a proper tourist trap. The hobbit films helped make Weta Workshop a tourist destination as well. Years ago, when Taylor noticed tour buses were making regular trips to the workshop’s campus, he would step out of his office to answer questions from visitors. Someone on his staff quickly suggested a better way to get the Weta Workshop story out would be to let the visitors in. The workshop now welcomes more than 165,000 visitors a year to its facilities in Wellington and tens of thousands more to Wētā Workshop Unleashed, an immersive look at the special-effects process, in Auckland. One of those who came and stayed was Kate Malone, 42, who grew up in Ohio but fell in love with the natural beauty of rural New Zealand when she saw the first trilogy, making a pilgrimage there a dozen years ago to see it for herself. “I knew I wanted to work in tourism with ‘Lord of the Rings,’” she said. But the country needed social workers, not tour guides, so she became a social worker to qualify for a visa, then lived for a while in Auckland and Wellington before applying for permanent residency. When Jackson took out a newspaper ad for people shorter than 5-foot-3 to be hobbit extras in the second trilogy, Malone auditioned and got the part. Since then, she’s spent most of her time in Hobbiton, where she gives several two-hour tours each day. Twenty years after the epic’s conclusion, the international interest Jackson’s trilogy sparked in New Zealand — including Malone’s — continues. Even for those who don’t arrive in Hobbiton fresh off an in-flight binge. “We get people from all over the world,” she said. “Some of them are really big fans and some of them have never seen the movies.”","pubDate":"2023-12-01 22:10:26","image_url":"https://www.mercurynews.com/wp-content/uploads/2023/12/ENTER-MOVIE-LORD-RINGS-NEWZEALAND-GET.jpg?w=1400px&strip=all","source_id":"mercurynews","source_priority":2968,"country":["united states of america"],"category":["sports"],"language":"english"},{"article_id":"f31a674781e90e941485b6148bb76890","title":"Qadr rules the roost","link":"https://www.herald.co.zw/qadr-rules-the-roost/","keywords":["Sport","Top Stories"],"creator":["wenceslaus"],"video_url":null,"description":"Eddie Chikamhi Senior Sports Reporter UTILITY man Qadr Amini was last night in a state of delirium as he was accompanied by his two wives to receive the Soccer Star of the Year crown. This follows a stellar season in which he captained Ngezi Platinum Stars to their maiden Castle Lager Premier Soccer League title. […]","content":"UTILITY man Qadr Amini was last night in a state of delirium as he was accompanied by his two wives to receive the Soccer Star of the Year crown. This follows a stellar season in which he captained Ngezi Platinum Stars to their maiden Castle Lager Premier Soccer League title. The 33-year-old former Zimbabwe international beat competition from Dynamos midfield kingpin Donald Mudadi, who finished as the first runner-up, and Bulawayo Chiefs marksman Obriel, who was the second runner-up. “I’m speechless. I cant express my joy right now but I want to thank my teammates and my coach Takesure Chiragwi; you are the best. I also want to thank my wives who are here with me. I love you so much guys. They have been very supportive throughout,” said Amini. Amini pocketed US$7 500 for his efforts while Mudadi cashed US$4 500 and Chirinda walked home US$3 750 richer for being the third best. It was an evening to remember for Ngezi Platinum Stars after their coach Takesure Chiragwi also nailed the Coach of the Year, for the first time. Youthful forward from the Mhondoro side Takunda Benhura won the Top Goal Scorer award. Benhura received his Golden Boot award after scoring 13 goals in his first full season. He received US$6 375. Champions Ngezi Platinum dominated the evening where they were also presented with the league trophy by Guest of Honour, the Deputy Minister of Sports, Recreation, Arts and Culture, Emily Jesaya. For the second year running, they were also named the Most Disciplined Team of the Year. The Mhondoro side had three players on the 2023 PSL calendar, with goalkeeper Nelson Chadya and 22-year-old forward Takunda Benhura also joining Soccer Star Amini on the podium. But the evening belonged to Amini, who had a particularly impressive second half of the season to help the platinum miners reach the Promised Land. Veteran Highlanders goalkeeper Ariel Sibanda scooped the Goalkeeper of the Year award for his 19 clean sheets. Dynamos rookie Elton Chikona was voted the Most Promising Player of the Year. The teenage forward pipped teammate Junior Makunike in a close contest with fellow Glamour Boy. Voting was done by a hybrid panel comprising journalists, coaches and captains of the 18 PSL clubs, using a secure electronic voting platform. Convener of the selection panel Lawrence Moyo said the process was smoother this year although participation was not 100 percent. Herentals forward Tinotenda Benza, for the second year running was the Fans favourite. Brighton Chimene won the referee of the year for the third time, having previously won it in 2016 and 2019. Guest of Honour Jesaya hailed the football authorities in the country as well as sponsors Delta Beverages for keeping the game alive even during the period when the country was under FIFA suspension. “Notably, I would like to thank Delta Beverages for their unwavering support towards football and sport development in Zimbabwe. Under their different brands, Delta Beverages has changed the face of football through the Castle Lager Premier Soccer League as well as capacitating various football stakeholders through sponsoring training workshops and promoting sporting events. “The Ministry applauds you for your commitment towards sectoral growth The Government would like to commend the Sport and Recreation Commission (SRC), ZIFA and PSL for ensuring that domestic football continued during the FIFA suspension and providing entertainment to football lovers around the country and sustained footballer’s livelihoods,” said Jesaya. Delta Beverages Marketing Director Irimayi Muzorewa said it was a pleasure to celebrate the best players of the 2023 season. PSL chairman Farai Jere also hailed the XI finalists. He also challenged the local players to score more goals next season after the Golden Boot was won by 13 goals this year. Jere said 567 goals were scored from the 360 matches played during the season. This was a significant decrease from the 594 goals netted last season. “We expect our goals to go up each year but this year we had a challenge. The top goal scorer Takunda Benhura has 13 goals. Last year the top goal scorer had 17 goals. “So, it’s a challenge to the players to up their game. I would like to challenge our strikers to score more goals next season. “Our main objective is to improve our game so that it becomes attractive and makes it appealing to stakeholders,” said Jere. Qadr Amini (Ngezi Platinum Stars) Donald Mudadi (Dynamos) Obriel Chirinda (Bulawayo Chiefs) Takunda Benhura, Nelson Chadya (all Ngezi Platinum Stars), Tanaka Shandirwa (Dynamos), Andrew Mbeba, Ariel Sibanda (Highlanders), Tino Benza (Herentals), Fortune Binzi (Manica Diamonds) and Michael Charamba (Chicken Inn). Takunda Benhura (Ngezi Platinum Stars) Takesure Chiragwi (Ngezi Platinum Stars) Ariel Sibanda (Highlanders) Elton Chikona (Dynamos) : Tinotenda Benza (Herentals) Ngezi Platinum Stars Brighton Chimene Francis Chirwa Zondiwa Nkosana “Engineer, sound please…,” “ 1-2-3 testing, engineer, mic check, engineer volume bho-o here…” How many times have you heard such words, especially at a concert with artistes trying to rectify their sound quality production on stage during the middle of a show? With the advent of technology, it now seems a thing of the past, […] IN what is, undoubtedly, the lowest point for Zimbabwe Cricket, the national cricket team will not be taking part at the ICC Men’s T20 World Cup in the West Indies and the United States mid next year. Remarkably, Zimbabwe will be the only Test-playing nation missing at the tournament after failing to secure a Top […] Thupeyo Muleya Beitbridge Bureau Zimbabweans working and living in South Africa on the strength of a special three years’ permit have welcomed its extension by the host government for another two years. South Africa’s Home Affairs Minister Dr Aaron Motsoaledi announced that his government had further extended the lifeline of the Zimbabwe Exemption Permit (ZEP), […]","pubDate":"2023-12-01 22:03:50","image_url":null,"source_id":"herald_zw","source_priority":445177,"country":["zimbabwe"],"category":["sports"],"language":"english"},{"article_id":"303665a1e9ace8ab3d2c734d4d5baad0","title":"India breaks Pakistan record to achieve most wins in men's T20Is after Raipur triumph","link":"https://www.indiatvnews.com/sports/cricket/ind-vs-aus-india-breaks-pakistan-record-to-achieve-most-wins-in-men-s-t20is-after-raipur-triumph-2023-12-02-905329","keywords":null,"creator":null,"video_url":null,"description":"Team India stormed back into the ongoing five-match series against Australia with a series-clinching win in Raipur in the fourth T20I on Friday, December 1. The bowlers and batters combined to help India come up trumps by 20 runs despite a score of 174 not being a great one. The win not only helped India clinch the series and take an unassailable 3-1 lead but also become the most successful team in men's T20Is in terms of the number of wins.","content":"Team India stormed back into the ongoing five-match series against Australia with a series-clinching win in Raipur in the fourth T20I on Friday, December 1. The bowlers and batters combined to help India come up trumps by 20 runs despite a score of 174 not being a great one. The win not only helped India clinch the series and take an unassailable 3-1 lead but also become the most successful team in men's T20Is in terms of the number of wins. Team India broke Pakistan's record of most wins in men's T20Is as both were tied on 135 victories in the shortest format before Friday. No other team is even close as New Zealand, who are on third in the list have 102 wins to their name in the format. 136 - India, in 213 matches 135 - Pakistan, in 226 matches 102 - New Zealand, in 200 matches 95 - South Africa, in 171 matches 95 - Australia, in 181 matches Yes, India and Pakistan have played the most matches too but it is a no mean feat, which shows the consistency of the Men in Blue in the format over the years. Yes, the silverware has eluded since the inaugural World T20 edition in 2007, but the Indian team has been really consistent across formats and will hope that a repeat of 2007 is round the corner in T20Is. The preparation for the T20 World Cup 2024 has started for India with this series and the upcoming assignment against South Africa with the likes of Yashasvi Jaiswal, Rinku Singh and Mukesh Kumar coming good. Whether India stay with the young guns or a return of and is on the cards, only time will tell but for now, the team that is currently in action definitely holds promise.","pubDate":"2023-12-02 00:45:01","image_url":"https://resize.indiatvnews.com/en/resize/newbucket/715_-/2023/12/75930-1701456656.jpg","source_id":"indiatvnews","source_priority":10055,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"4feef1fb8b5578a7846f2c8b7e850ed8","title":"Harmanpreet to captain India in upcoming Tests","link":"http://www.newindianexpress.com/sport/cricket/2023/dec/02/harmanpreet-to-captain-india-in-upcoming-tests-2638068.html","keywords":null,"creator":null,"video_url":null,"description":"The squad for the T20I series against Australia will be announced later. After a hiatus of nine years, India will play two Tests on home soil. CHENNAI: Harmanpreet Kaur will lead the Indian squad in two Tests against England and Australia respectively, starting from December 14. BCCI has also announced the squad for the three-match T20I series against England. The squad for the T20I series against Australia will be announced later. After a hiatus of nine years, India will play two Tests on home soil. Saika Ishaque, one of the breakout performers from the Women’s Premier League and U19 T20 World Cup winner, Titas Sadhu, have found a place in the Test squad. After consistent performances, Shreyanka Patil has received a senior call-up for the first time. India’s T20Is squad vs England: Harmanpreet Kaur (C), Smriti Mandhana (VC), Jemimah Rodrigues, Shafali Verma, Deepti Sharma, Yastika Bhatia (wk), Richa Ghosh (wk), Amanjot Kaur, Shreyanka Patil, Mannat Kashyap, Saika Ishaque, Renuka Singh Thakur, Titas Sadhu, Pooja Vastrakar, Kanika Ahuja, Minnu Mani. For Tests vs England & Australia: H Kaur (C), S Mandhana (VC), J Rodrigues, Shafali Verma, Deepti Sharma, Y Bhatia (wk), Richa Ghosh (wk), Sneh Rana, Shubha Satheesh, Harleen Deol, Saika Ishaque, Renuka Thakur, Titas Sadhu, Meghna Singh, R Gayakwad, P Vastrakar.","content":"CHENNAI: Harmanpreet Kaur will lead the Indian squad in two Tests against England and Australia respectively, starting from December 14. BCCI has also announced the squad for the three-match T20I series against England. The squad for the T20I series against Australia will be announced later. After a hiatus of nine years, India will play two Tests on home soil. Saika Ishaque, one of the breakout performers from the Women’s Premier League and U19 T20 World Cup winner, Titas Sadhu, have found a place in the Test squad. After consistent performances, Shreyanka Patil has received a senior call-up for the first time. : Harmanpreet Kaur (C), Smriti Mandhana (VC), Jemimah Rodrigues, Shafali Verma, Deepti Sharma, Yastika Bhatia (wk), Richa Ghosh (wk), Amanjot Kaur, Shreyanka Patil, Mannat Kashyap, Saika Ishaque, Renuka Singh Thakur, Titas Sadhu, Pooja Vastrakar, Kanika Ahuja, Minnu Mani. : H Kaur (C), S Mandhana (VC), J Rodrigues, Shafali Verma, Deepti Sharma, Y Bhatia (wk), Richa Ghosh (wk), Sneh Rana, Shubha Satheesh, Harleen Deol, Saika Ishaque, Renuka Thakur, Titas Sadhu, Meghna Singh, R Gayakwad, P Vastrakar.","pubDate":"2023-12-02 00:33:00","image_url":"https://images.newindianexpress.com/uploads/user/imagelibrary/2023/12/2/original/333848W-preview.jpg","source_id":"newindianexpress","source_priority":15406,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"66d54a5135a1a71bbe2fc29d9be0f215","title":"77 स्लॉट.. 1166 खिलाड़ी, IPL 2024 के लिए हाई कंपटीशन, देखें प्लेयर्स की लिस्ट","link":"https://hindi.news18.com/cricket/1166-players-have-put-their-names-up-for-auction-for-77-slots-for-ipl-2024-7869444.html","keywords":null,"creator":null,"video_url":null,"description":"IPL 2024: आईपीएल 2024 के लिए टीमों और खिलाड़ियों ने पूरी तैयारी कर ली है. टूर्नामेंट के लिए ऑक्शन 19 दिसंबर को होना है. इसके पहले आईपीएल ने उन प्लेयर्स की लिस्ट शामिल कर दी है, जिन्होंने नीलामी के लिए अपना नाम दिया है.","content":"आईपीएल 2024 के लिए 1166 प्लेयर्स ने अपना नाम दिया है. (ipl) नई दिल्ली. आईपीएल (IPL 2024) के लिए सभी टीमें अपने-अपने खेमें प्लान करने में लग चुकी हैं. इसके लिए मिनी ऑक्शन में 3 हफ्ते से भी कम समय बचा हुआ है. वर्ल्ड कप में शानदार प्रदर्शन करने वाले खिलाड़ियों पर फ्रेंचाइजियों ने निश्चित तौर पर फोकस किया होगा. इसके अलावा कई युवाओं की उम्मीदें फ्रेंचाइजियों पर टिकी होंगी. आईपीएल ने शुक्रवार को आगामी सीजन के लिए 1166 खिलाड़ियों लंबी सूची शेयर की, जिन्होंने ऑक्शन के लिए अपना नाम दिया है. आईपीएल द्वारा दी गई सूची में एसोसिएट देशों के 45 खिलाड़ी शामिल हैं. इसके अलावा 909 अनकैप्ड खिलाड़ियों के नाम हैं जिसमें से 812 भारतीय हैं. लिस्ट में 18 कैप्ड भारतीय खिलाड़ी शामिल हैं. आईपीएल 2024 में 10 फ्रेंचाइजी हिस्सा ले रही हैं, जिनके पास भरने के लिए 77 स्लॉट हैं. इसमें से 30 स्लॉट विदेशी प्लेयर्स के लिए हो सकते हैं. वहीं, फ्रेंचाइजियों के कुल पर्स की बात करें तो नीलामी के लिए कुल 262.95 करोड़ रुपये रकम होगी. सबसे ज्यादा बेस प्राइस के साथ शामिल होने वाली खिलाड़ियों की लिस्ट में कुल 25 प्लेयर्स शामिल हैं. 2 करोड़ रुपये बेस प्राइस वाले खिलाड़ी हर्षल पटेल, शार्दुल ठाकुर, उमेश यादव, केदार जाधव, मुजीब उर रहमान, सीन एबॉट, पैट कमिंस, जोश हेजलवुड, ट्रैविस हेड, जोस इंग्लिस, मिचेल स्टार्क, स्टीव स्मिथ, मुस्ताफिजुर रहमान , टॉम बैंटन, हैरी ब्रुक, बेन डकेट, जेमी ओवरटन, आदिल राशिद, डेविड विली, क्रिस वोक्स, लॉकी फर्ग्यूसन, जेराल्ड कोएत्ज़ी, रिले रोसौव, रासी वैन डेर डुसेन, एंजेलो मैथ्यूज. 1.5 करोड़ रुपये बेस प्राइस वाले खिलाड़ी मोहम्मद नबी, मोइजेस हेनरिक्स, क्रिस लिन, केन रिचर्डसन, डैनियल सैम्स, डैनियल वॉरॉल, टॉम कुरेन, मर्चेंट डी लैंग, क्रिस जॉर्डन, डेविड मालन, टाइमल मिल्स, फिल साल्ट, कोरी एंडरसन , कॉलिन मुनरो, जिमी नीशम, टिम साउथी, कॉलिन इनग्राम, वानिंदु हसरंगा, जेसन होल्डर, शेरफेन रदरफोर्ड. IPL 2024: वर्ल्ड चैंपियन बनते ही बढ़े ऑस्ट्रेलियाई प्लेयर्स के दाम, ऑक्शन में टॉप बेस प्राइस से मारेंगे एंट्री, देखें लिस्ट 1 करोड़ रुपये बेस प्राइस वाले खिलाड़ी एश्टन एगर, रिले मेरेडिथ, डार्सी शॉर्ट, एश्टन टर्नर, गस एटकिंसन, सैम बिलिंग्स, माइकल ब्रेसवेल, मार्टिन गुप्टिल, काइल जैमीसन, एडम मिल्ने, डेरिल मिशेल, वेन पार्नेल, डेवाल्ड प्रिटोरियस, अल्ज़ारी जोसेफ, रोवमैन पॉवेल, डेविड विसे. . Tags: IPL , IPL Auction एक्टिंग डेब्यू के साथ सिंगिंग में आजमाया हाथ, 'दि आर्चीज' की रिलीज से पहले ही छाए वेदांग रैना Free Foods In Delhi: दिल्ली में इन जगहों पर घूमने के साथ-साथ खाएं फ्री खाना, जानें लोकेशन 3 दिन तक लगाए चक्कर, नहीं माने सुपरस्टार तो तेलुगू फिल्म दिखा किया राजी, रीमेक हिट होते ही मेकर हुए मालामाल","pubDate":"2023-12-02 00:31:03","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/10/IPL-Trophy-1-2023-10-ba91f9a0002954c954797250d0f742b8-3x2.jpg","source_id":"hindinews18","source_priority":6509,"country":["india"],"category":["sports"],"language":"hindi"},{"article_id":"c63226386bb9840be329892fe5904038","title":"Ex-Pakistan Test captain Salman Butt appointed to first official role since he was jailed in 2011 for spot-fixing, being named as a consultant to new chief selector Wahab Riaz","link":"https://www.dailymail.co.uk/sport/cricket/article-12816501/Ex-Pakistan-Test-captain-Salman-Butt-appointed-official-role-jailed-2011-spot-fixing-named-consultant-new-chief-selector-Wahab-Riaz.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"DAVID KENT: The Pakistan Cricket Board have named Butt as one of three consultants to new chief selector Wahab Riaz. Butt was jailed for 30 months for his part in a spot-fixing conspiracy.","content":"Ex-Pakistan Test captain Salman Butt appointed to first official role since he was jailed in 2011 for spot-fixing, being named as a consultant to new chief selector Wahab Riaz Ex-Pakistan Test captain Salman Butt has been appointed to his first official role It comes after he was jailed in 2011 for spot-fixing and spent 30 months in prison He will work as a consultant to Pakistan's new chief selector Wahab Riaz By David Kent for the Daily Mail Published: 18:46 EST, 1 December 2023 | Updated: 18:46 EST, 1 December 2023 e-mail View comments Former Pakistan Test captain Salman Butt has been appointed to a first official role since he was jailed for spot-fixing. The Pakistan Cricket Board have named Butt as one of three consultants to new chief selector Wahab Riaz. In 2011, Butt was jailed for 30 months for his part in a conspiracy to bowl deliberate no-balls during the Test against England at Lord’s the previous summer. Butt was also handed a 10-year ban, with five years suspended, for his role in the controversy, which involved team-mates Mohammad Asif and Mohammad Amir. Butt, who returned to play domestic cricket in 2016, will take up his role with immediate effect ahead of the T20 series against New Zealand in January. Former Pakistan Test captain Salman Butt (middle) has been appointed as a consultant to Pakistan's chief selector Wahab Riaz It comes after Butt was jailed for 30 months in 2011 after he was found guilty of spot-fixing Butt returned to domestic cricket in 2016 and will take up his new role with immediate effect The move follows an overhaul of Pakistan’s set-up after their early exit from the World Cup. Mohammad Hafeez has come in as team director, with Shan Masood named Test skipper and Shaheen Afridi leading the T20 side after Babar Azam stepped down as captain in all formats. The move comes following Pakistan's early Cricket World Cup exit, with Riaz also taking up a new position New Zealand Share or comment on this article: Ex-Pakistan Test captain Salman Butt appointed to first official role since he was jailed in 2011 for spot-fixing, being named as a consultant to new chief selector Wahab Riaz e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-12-01 23:46:38","image_url":"https://i.dailymail.co.uk/1s/2023/12/01/23/78490923-0-image-m-91_1701474133042.jpg","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"01572508f7b30f22452750da2934f0b1","title":"Harbhajan Singh questions Yuzvendra Chahal’s ODI selection for SA tour, calls it a ‘lollypop’","link":"https://thenewsmill.com/2023/12/harbhajan-singh-questions-yuzvendra-chahals-odi-selection-for-sa-tour-calls-it-a-lollypop/","keywords":["Cricket","Sports","ANI"],"creator":["ANI"],"video_url":null,"description":"The News Mill","content":"A day after India announced their squad for the all-important tour of South Africa, former spinner Harbhajan Singh on Friday questioned Yuzvendra Chahal’s selection for the tour, and said that they gave him a “lollypop to suck on.” On Thursday, the Board of Control for Cricket in India (BCCI)’s selection committee, named the Men in Blue’s squad for all three formats. Chahal has been included in the Indian ODI team for SA tour. While speaking on his official YouTube channel, Bhajji said that it was beyond his understanding why the 33-year-old was selected to the ODI squad but not for the T20I team. “There is no Yuzvendra Chahal in T20 format. You kept him in ODIs but not T20Is. They just gave him a lollypop to suck on. We won’t take in the format where you do well but will take for other formats. It’s beyond my understanding,” Harbhajan said on his YouTube channel. Meanwhile, the former spinner said that the Proteas tour won’t be easy for the Indian players and will be tough for the batters since the ‘Men in Blue’ won’t have Cheteshwar Pujara and Ajinkya Rahane in their squad. “South Africa tour is not easy. It’s tough for batters. There you won’t have Cheteshwar Pujara and Ajinkya Rahane. Youth are indeed getting opportunities. It’s a good thing. But I don’t think that selectors had a chat with Rahane, Pujara, or Umesh Yadav because whenever Yadav has played in Tests, he has performed,” he added. On the other hand, following his inclusion on the ODI squad, Chahal took to his official social media account and wrote, “Here we go AGAIN!” https://x.com/yuzi_chahal/status/1730240586202878304?s=20 The tour will begin with the three-match T20I affair on December 10 at the Kingsmead Stadium. The second T20I will be played on December 12 at the St George’s Oval. The 20-over format will conclude on December 14 at the Wanderers Stadium. The 50-over clash will kick off on December 17 at the Wanderers Stadium. The second and final ODI will be played on December 19 and December 21 respectively. India’s squad for Tests: Rohit Sharma (C), Shubman Gill, Yashasvi Jaiswal, Virat Kohli, Shreyas Iyer, Ruturaj Gaikwad, Ishan Kishan (wk), KL Rahul (Wk), Ravichandran Ashwin, Ravindra Jadeja, Shardul Thakur, Mohd. Siraj, Mukesh Kumar, Mohd. Shami*, Jasprit Bumrah (VC), Prasidh Krishna. India’s squad for 3 T20Is: Yashasvi Jaiswal, Shubman Gill, Ruturaj Gaikwad, Tilak Varma, Suryakumar Yadav (C), Rinku Singh, Shreyas Iyer, Ishan Kishan (Wk), Jitesh Sharma (Wk), Ravindra Jadeja (VC), Washington Sundar, Ravi Bishnoi, Kuldeep Yadav, Arshdeep Singh, Mohd. Siraj, Mukesh Kumar, Deepak Chahar. India’s squad for 3 ODIs: Ruturaj Gaikwad, Sai Sudharsan, Tilak Varma, Rajat Patidar, Rinku Singh, Shreyas Iyer, KL Rahul (C) (Wk), Sanju Samson (Wk), Axar Patel, Washington Sundar, Kuldeep Yadav, Yuzvendra Chahal, Mukesh Kumar, Avesh Khan, Arshdeep Singh, Deepak Chahar. (ANI)","pubDate":"2023-12-01 23:31:06","image_url":"https://thenewsmill.com/wp-content/uploads/2023/12/harbhajan-singh-questions-yuzvendra-chahals-odi-selection-for-sa-tour-calls-it-a-lollypop.jpg","source_id":"thenewsmill","source_priority":3781717,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"4e20310fdfa2393c84f6ab21dbc4b857","title":"Danny Macklin reveals he has been found safe in Cornwall by police officers after appeal had been launched to find ex-AFC Wimbledon managing director following worrying social media posts - days on from his FA charge of misconduct","link":"https://www.dailymail.co.uk/sport/football/article-12816295/Danny-Macklin-reveals-safe-Cornwall-police-officers-appeal-launched-ex-AFC-Wimbledon-managing-director-following-worrying-social-media-posts-days-FA-charge-misconduct.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"He was last seen on foot in Great Notley near Braintree in Essex on Friday, but according to a Tweet posted on his X (formerly Twitter account) was found in Looe in Cornwall.","content":"Danny Macklin reveals he has been found safe in Cornwall by police officers after appeal had been launched to find ex-AFC Wimbledon managing director following worrying social media posts - days on from his FA charge of misconduct Former AFC Wimbledon chief Danny Macklin says he has been found safe An appeal had been launched to find MR Macklin after he had gone missing Mr Macklin stated that he was found in Looe, in Cornwall by Police on Friday By Ed Carruthers For Mailonline Published: 17:23 EST, 1 December 2023 | Updated: 17:58 EST, 1 December 2023 e-mail Former AFC Wimbledon managing director Danny Macklin has revealed he has been found safe in Cornwall by police officers, following an appeal to find the 32-year-old after he went missing, having also posted a worrying message on his social media. He was last seen on foot in Great Notley near Braintree in Essex on Friday, but according to a Tweet posted on his X (formerly Twitter ) account he was found safe in Looe, Cornwall. He wrote on his X account: 'I have been found safely by Cornwall Police in Looe just prior to going into what I can assure you was cold sea water! 'Thank you for all the well wishes - I will seek the help I need and sorry for the terrible pain I have caused so many and then seek to rebuild my career/life.' Mr Macklin had been charged with misconduct by the Football Association on Tuesday after hidden camera recordings unveiled the former Wimbledon director made abusive comments towards a female colleague. Danny Macklin has revealed on his social media that he has been found safe after he had gone missing Mr Macklin wrote on X (formerly Twitter) that he had been found by Cornwall Police in Looe The comments were made about Wimbledon's head of supporter services and ticketing Rebecca Markham. Mr Macklin was given until December 6 to provide the FA with a response. He said that he was 'not sexist' but said the private conversation was '100 per cent at fault' and revealed that his 'life is in tatters'. He added that the comments 'had caused so much pain for so many people' and deeply regretted his words. In his message on social media, Mr Macklin also apologised to his wife Claire and his Children, Harry and Ruby stating that he had been 'the opposite of a good husband'. He wrote: 'I should have put family first, not the determination to be a CEO in the Premier League.' Essex Police had issued a statement on Friday asking members of the public for any information on Mr Macklin's whereabouts. In a statement, they said: 'We want to find Danny Macklin, 32, last seen on foot in Great Notley at 10.50am,' police released in a statement. 'Danny is 6ft 4in, with a shaved head, wearing a long black coat, a grey and black bobble hat, black jeans and grey and white trainers. 'Please call 999 with incident 372 of today, 1 December.' AFC Wimbledon released a statement in response to the allegations ahead of the FA's charge One of Macklin's old clubs Leyton Orient gave their support, saying 'we are here for you' Mr Macklin, who left his post at Wimbledon on September 8, has also held positions at Leyton Orient, Southend United and Essex County Cricket Club. Orient posted a message of support for Mr Macklin on social media on Friday saying: 'Danny, we can't begin to understand how you are feeling right now but please just know that we are all here for you,' the club said in a statement. 'It takes a strong person to admit their mistakes, which you have done, and an even stronger one to overcome the adversity that follows them. We know you can do this too. We hope that the number of messages you have received today prove to you how valuable you are to this world. 'We are all here for you and will give you all the help you need.' More to follow... For confidential support call the Samaritans on 116123 or go to samaritans.org Twitter Wimbledon Share or comment on this article: Danny Macklin reveals he has been found safe in Cornwall by police officers after appeal had been launched to find ex-AFC Wimbledon managing director following worrying social media posts - days on from his FA charge of misconduct e-mail Sorry we are not currently accepting comments on this article.","pubDate":"2023-12-01 22:58:29","image_url":"https://i.dailymail.co.uk/1s/2023/12/01/22/78489439-0-image-a-114_1701469517873.jpg","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"dd7c1d6f88f2332f563bfec2ba32178e","title":"$137m war erupts over relocation plan for AFL and cricket during Gabba redevelopment for Olympics","link":"https://7news.com.au/sport/olympics/137m-war-erupts-over-relocation-plan-for-afl-and-cricket-during-gabba-redevelopment-for-olympics-c-12759609","keywords":null,"creator":["Laine Clark"],"video_url":null,"description":"‘They have hung the AFL and cricket out to dry.’","content":"A row has erupted over a temporary home for and in Brisbane, with the Queensland government warned its major project is “not a done deal”. Brisbane Lord Mayor Adrian Schrinner has refused to back a funding plan for a $137 million RNA Showgrounds revamp, accusing the government of mismanagement. The sports minister on Friday unveiled the plan to renovate the inner-city showgrounds, creating a base for the and Queensland Cricket during the Gabba Olympic rebuild. However, Stirling Hinchliffe said the state government would commit only $47.5 million, with the Brisbane City Council, Lions, cricket and RNA to pay the rest. Mr Schrinner wasn’t happy. “They decided to knock down the Gabba and they should also provide a temporary venue,” he said. “The government needs to fix the problem that they have created. They are trying to put the cost on to the ratepayers of Brisbane - we won’t have it. “This is not going to happen based on this funding model. This is not a done deal.” Mr Schrinner said the sports minister told him the $2.7 billion Gabba rebuild budget included relocation costs for the Lions and Queensland Cricket. Under the revamp plans, a 20,000-seat stadium will be built at the showgrounds that will be scaled back to 12,000 after the 2032 Games. The lord mayor said it made sense to revamp the showgrounds and was happy to discuss a “minor” funding contribution. “But for the state government ... to expect council to fund the majority of the project ... it is really disorganised planning on the state government’s part,” he said. “They seem to be playing political games and they have also hung out the AFL and cricket to dry.” Mr Schrinner claimed to have been kept in the dark, saying the state government told him last week an announcement for a temporary cricket and AFL venue was months away. He claimed the first he heard about the revamp project was via a “rushed” letter sent by Mr Hinchliffe late Thursday night. “I expect they had already told the media before they told us - it’s just not polite and it’s no way to manage a major project,” he said. “This is not the way you enter into a genuine partnership.” Mr Hinchliffe denied he had kept the lord mayor in the dark, accusing Mr Schrinner of the silent treatment. “The lord mayor has refused to respond to a phone call I made to him yesterday,” he said. “It became clear from the response from his office that there was going to be no further conversation between myself and the lord mayor immediately.” Asked why he had gone ahead with a Friday media conference, Mr Hinchliffe said: “It was important that we shared this information with the other stakeholders and with the community.” He said progress would need to be made soon if the revamp was going to be ready in time. “We know work needs to be starting next year for the refurbished main arena to be ready for a 2025-26 cricket season,” he said. “But this is the beginning of the negotiations that we need to have. “So I am very pleased we are able to identify what this project looks like and start working with all the partners on delivering an outcome.” The Lions backed a showgrounds relocation, describing Friday’s announcement as a “starting point”. “We will continue dialogue with government and other stakeholders regarding progressing the RNA as quickly as possible to ensure the project can be funded and the club is supported through displacement,” Lions CEO Greg Swann said.","pubDate":"2023-12-01 22:52:12","image_url":"https://images.7news.com.au/publication/C-12759609/2ad46ef695f5497249463a2ca4abe423e3d6d560-16x9-x0y0w1920h1080.jpg","source_id":"7news","source_priority":7652,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"8ab0aba3d575650602e9e32463c32047","title":"Danny Macklin: Ex-AFC Wimbledon chief confirms he's been \"found safely\" after police search","link":"https://www.mirror.co.uk/sport/football/news/danny-macklin-found-afc-wimbledon-31578957","keywords":["Sport"],"creator":["mirrornews@mirror.co.uk (Darren Wells)"],"video_url":null,"description":"Police launched an appeal for information regarding Danny Macklin's whereabouts just days after the former AFC Wimbledon chief was charged by the FA in relation to allegations made by a colleague","content":"Former AFC Wimbledon chief Danny Macklin has confirmed he's been \"found safely\" following a police search after concerns grew for his welfare. Police launched an appeal for information as to his whereabouts on Friday after he was last spotted in Great Notley, Essex at 10:50am. Macklin issued a message later on Friday to state he had been in contact with police in Looe, Cornwall, adding: \"Thank you for all the well wishes - I will seek the help I need and sorry for the terrible pain I have caused so many and then seek to rebuild my career / life.\" Macklin has held a number of executive roles in sport, including at Leyton Orient, Southend United and Essex County Cricket Club. He was managing director of AFC Wimbledon but left earlier this season after allegations were made against him by a colleague. He was charged by the FA on Wednesday in relation to those allegations before going missing on Friday, prompting a spokesperson for Essex Police to issue a statement which read: \"If you have seen Danny or have any information that may help us find him, please call 999 quoting incident 372 of Friday December 1.\" Football fans responded to Macklin's message by issuing their heartfelt thanks he was safe. Braintree Town FC wrote: \"We're all extremely glad to hear you are safe Danny, from the whole of the huge family you have at Braintree Town we wish you all the best and for your future safety.\" If you're struggling and need to talk, the Samaritans operate a free helpline open 24/7 on 116 123. Alternatively, you can email jo@samaritans.org or visit their site to find your local branch.","pubDate":"2023-12-01 22:51:12","image_url":"https://i2-prod.mirror.co.uk/incoming/article31576136.ece/ALTERNATES/s615/3_danny-macklin-the-first-interview.jpg","source_id":"mirroruk","source_priority":910,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"a650749b7a63736d1e0387e1a4023503","title":"20 years on, a transformed New Zealand looks back at ‘Lord of the Rings’","link":"https://www.mercurynews.com/2023/12/01/20-years-on-a-transformed-new-zealand-looks-back-at-lord-of-the-rings/","keywords":["Entertainment","Movies","Things To Do","Travel","network"],"creator":["Tribune News Service"],"video_url":null,"description":"The farmland that Jackson's crew turned into Hobbiton, the fictional Middle-earth village where the films are set, has drawn as many as 650,000 visitors a year, making it one of the top attractions in a country that relied on tourism for about 20% of its export earnings, pre-pandemic.","content":"WELLINGTON, New Zealand — New Zealand was primarily known abroad for its sheep, its wine and its rugby team on the September day in 1998 that filmmaker Peter Jackson’s helicopter landed on a sprawling family farm about 100 miles south of Auckland. The country’s film industry was another matter: Though New Zealand had produced crossover successes like Jackson’s “Heavenly Creatures” and Jane Campion’s Oscar winner “The Piano,” it was nearly as far from the thinking of Hollywood studios as it was from Hollywood itself. But that was about to change. The lush farmland on which Jackson’s crew alighted would soon become the backdrop for “The Lord of the Rings,” one of the most ambitious, influential and profitable film series ever made. And in the two decades since the release of “The Return of the King,” the Oscar-winning final film in Jackson’s trilogy, New Zealand has become a major player in the global motion picture industry. “It absolutely put us on the map,” said Jasmine Millet, head of creative industries at Tataki Auckland Unlimited and an advocate for the region’s filmmaking industry. “People started thinking about New Zealand, wanting to visit New Zealand en masse in a way that they never would have without those films. “The industry was already building up. That whole filmmaking process and that language of cinematic storytelling, all of that stuff was ready and ripe. What Peter and the team did was just absolutely take it to the next level.” The three films, combined for 30 Academy Award nominations and 17 wins and earned nearly $3 billion in worldwide box office receipts. It also pioneered new technologies in special effects and software systems and advancing the use of motion capture to animate digital characters. The movies were so popular they inspired a second Oscar-nominated trilogy, a decade later, which spurred its own tourism industry. The farmland that Jackson’s crew turned into Hobbiton, the fictional Middle-earth village where the films are set, has drawn as many as 650,000 visitors a year, making it one of the top attractions in a country that relied on tourism for about 20% of its export earnings, pre-pandemic. Before COVID-19, nearly one in five visitors said their decision to come to New Zealand was influenced by the hobbit films. “The trilogy is just a big advertisement for New Zealand,” said Shayne Forrest, general manager for tourism at the 12-acre Hobbiton movie set. “The filmmakers that made these movies, Peter Jackson and all his team, they’re all New Zealanders. So it really got to showcase New Zealand as being a creative hub that could punch well above its weight in the international arena.” Their success reversed an exodus that once saw successful filmmakers such as Campion and Lee Tamahori (“Once Were Warriors”) leave New Zealand to work in the U.S., Italy and the U.K. In 1998, the year Jackson began scouting locations for his Tolkien films, just five features made in New Zealand were released in theaters. Less than a decade later the country was turning out twice as many annually; among the major productions that followed “The Lord of the Rings” were “King Kong,” Disney’s live-action “Mulan,” James Cameron’s two and the first two installments of “The Chronicles of Narnia.” New Zealand’s film industry now generates about $2.08 billion in GDP annually. Millet said the transition from so-called “swords and sandals” TV series such as “Xena: Warrior Princess” and “Hercules: the Legendary Journeys” to more substantial storytelling began with which won three Academy Awards and was the highest-grossing New Zealand film of all time when it came out in 1993. “It got us to thinking, ‘What are our stories? How do we work as filmmakers, what’s our unique take on this craft?’” she said of Campion’s film, which was shot largely in and around Auckland. “So when Peter came with the opportunity of ‘The Lord of the Rings’ films, he knew that there was this whole seedbed of talent that was already here and that had this way of working that was really a group of friends, in many ways, who wanted to bring their best in a super-creative way, workshopping ideas. “That was the preparation, that gave him the confidence to say, ‘I can make this incredible trilogy at home. I don’t need to go somewhere else.’ And even though it blew everybody away, at some level from the New Zealand perspective, it was kind of like ‘Yeah, we know how to do this. This is in our blood.’” For Jackson, it helped that Richard Taylor had become one of his friends. The two met in Wellington, Taylor said, when Jackson was still living at home with his parents and working on his first movie, the 1987 science-fiction comedy horror film “Bad Taste.” “He saw our work on television and, through a mutual friend, we were introduced to him,” said Taylor, who along with his wife, Tania Rodger, went on to work on Jackson’s second film, the low-budget 1989 black comedy “Meet the Feebles.” That work won Taylor and Rodger a New Zealand film award; after carefully wrapping the prize in napkins for the trip back to Wellington, Taylor turned to Rodger and said “we better treasure this moment, because it won’t get better than this.” Of course, it didn’t exactly play out that way. After collaborating on Jackson’s next three films, “The Lord of the Rings” series brought Taylor’s Weta Workshop — founded alongside Rodger and Jackson and named after a species of giant flightless cricket endemic to New Zealand — the first of its five Academy Awards. The statuettes, displayed in a floor-to-ceiling display case off the workshop’s main lobby alongside miniature collectibles Wētā Workshop created for films and other projects, have all had their nameplates removed. “They say that I won them, but I didn’t win them. I collected them for a group of people back home,” said Taylor, who, like Jackson, was knighted in 2010 for his services to film in New Zealand. Taylor and a staff of 36 were working out of a building they shared with an ice cream manufacturer when Jackson gave him his choice of creative departments for “The Lord of the Rings.” Taylor chose to look after the design and creation of armor, weapons, miniatures, special makeup effects and prosthetics, and though the average age of the Weta Workshop staff was just 22 when they got going and only one-eighth of the crew had ever worked on a film or TV show before, the studio built more than 48,000 separate items for the trilogy. “You teeter toward the edge of the cliff and you can either leap off with faith [and] hope the wind catches under your wings, or step back from the edge of the cliff,” Taylor said. “So yeah, it’s where ‘LOTR’ all started for us, when Peter gave us that magical phone call.” Weta Workshop now has a staff of approximately 400 working out of multiple buildings on Wellington’s Miramar peninsula, making everything from movie props to museum exhibits, consumer products, video gaming, sculptures and collectibles. For Taylor, who started the company that would become the Wētā Workshop with Rodger in a back room of the Wellington flat they shared, the workshop’s growth in both size and prestige was born of the same innovation and can-do spirit that fueled the rise of New Zealand’s film industry. “Certainly Peter could have picked up and just headed off overseas and made films on the global circuit,” said David Wilks, general manager of the Wētā Workshop. “But this is where they wanted to put down roots and make a base. One of the things we’ve prided ourselves in is, we’ve now built a sustainable creative career for a whole bunch of artisans.” “New Zealand had a film industry that had been around a long time,” Wilks continued. “But ‘Lord of the Rings’ supercharged what we could do on the world stage.” It was the country that made the movie, Taylor insists, not the other way around. “There’s no doubt that you could have made an adaptation of ‘The Lord of the Rings’ in any country with any film company with any populace. It just wouldn’t have been this ‘Lord of the Rings,’” he said. “The benefits once you actually come to New Zealand are huge, the exchange rate being one of them,” he continued. “New Zealand crew still get together for the love of making a movie. They don’t get together because of the good business of working on a film. There’s a very fundamental difference in that. “That’s something that resonates with film directors and producers that come from overseas. That can-do Kiwi spirit. There’s no ‘that’s impossible.’ You just don’t have that.” Nature, however, may have provided New Zealand’s filmmakers with their most valuable asset. “The geographic benefit of New Zealand is that you can be in Wellington, with all the infrastructure necessary to make a major feature film [and with] one-and-a-half hours’ flight, you can reach anywhere in the world … visually. The only thing that New Zealand doesn’t really do is sand-swept deserts,” Taylor said. “Somewhere as diverse as Middle-earth, we’re on a journey from pastoral Hobbiton to apocalyptic Mordor. That demands that you are able to traverse an incredible diversity of environments. That’s what New Zealand could offer.” What Jackson’s team was looking for the day their helicopter circled the Alexander family’s 1,250-acre sheep and beef farm, located at the base of Kaimai Range on New Zealand’s North Island, were unspoiled pastures, green rolling hills, gnarled trees and wet, foggy weather to stand in for the fictional Shire of the Tolkien novels. What they found was a location so remote, so pristine, that the New Zealand army was enlisted to build roads to get the filmmaker’s equipment in and out. The soldiers were then recruited to act in the movies’ battle scenes. Soon enough, the films were inspiring fans to make pilgrimages to the tiny town of Matamata, a two-hour drive from Auckland, to pad around the farm — even though the sets built for the original trilogy were demolished when filming was finished. When Jackson returned 10 years later and asked the Alexanders for permission to film “The Hobbit” on their property, it came with a condition: This time, the structures built for the project had to be permanent. So the filmmakers left behind 44 hobbit holes, the Green Dragon Inn and dozens of other props, turning the farm into a proper tourist trap. The hobbit films helped make Weta Workshop a tourist destination as well. Years ago, when Taylor noticed tour buses were making regular trips to the workshop’s campus, he would step out of his office to answer questions from visitors. Someone on his staff quickly suggested a better way to get the Weta Workshop story out would be to let the visitors in. The workshop now welcomes more than 165,000 visitors a year to its facilities in Wellington and tens of thousands more to Wētā Workshop Unleashed, an immersive look at the special-effects process, in Auckland. One of those who came and stayed was Kate Malone, 42, who grew up in Ohio but fell in love with the natural beauty of rural New Zealand when she saw the first trilogy, making a pilgrimage there a dozen years ago to see it for herself. “I knew I wanted to work in tourism with ‘Lord of the Rings,’” she said. But the country needed social workers, not tour guides, so she became a social worker to qualify for a visa, then lived for a while in Auckland and Wellington before applying for permanent residency. When Jackson took out a newspaper ad for people shorter than 5-foot-3 to be hobbit extras in the second trilogy, Malone auditioned and got the part. Since then, she’s spent most of her time in Hobbiton, where she gives several two-hour tours each day. Twenty years after the epic’s conclusion, the international interest Jackson’s trilogy sparked in New Zealand — including Malone’s — continues. Even for those who don’t arrive in Hobbiton fresh off an in-flight binge. “We get people from all over the world,” she said. “Some of them are really big fans and some of them have never seen the movies.”","pubDate":"2023-12-01 22:10:26","image_url":"https://www.mercurynews.com/wp-content/uploads/2023/12/ENTER-MOVIE-LORD-RINGS-NEWZEALAND-GET.jpg?w=1400px&strip=all","source_id":"mercurynews","source_priority":2968,"country":["united states of america"],"category":["sports"],"language":"english"},{"article_id":"f31a674781e90e941485b6148bb76890","title":"Qadr rules the roost","link":"https://www.herald.co.zw/qadr-rules-the-roost/","keywords":["Sport","Top Stories"],"creator":["wenceslaus"],"video_url":null,"description":"Eddie Chikamhi Senior Sports Reporter UTILITY man Qadr Amini was last night in a state of delirium as he was accompanied by his two wives to receive the Soccer Star of the Year crown. This follows a stellar season in which he captained Ngezi Platinum Stars to their maiden Castle Lager Premier Soccer League title. […]","content":"UTILITY man Qadr Amini was last night in a state of delirium as he was accompanied by his two wives to receive the Soccer Star of the Year crown. This follows a stellar season in which he captained Ngezi Platinum Stars to their maiden Castle Lager Premier Soccer League title. The 33-year-old former Zimbabwe international beat competition from Dynamos midfield kingpin Donald Mudadi, who finished as the first runner-up, and Bulawayo Chiefs marksman Obriel, who was the second runner-up. “I’m speechless. I cant express my joy right now but I want to thank my teammates and my coach Takesure Chiragwi; you are the best. I also want to thank my wives who are here with me. I love you so much guys. They have been very supportive throughout,” said Amini. Amini pocketed US$7 500 for his efforts while Mudadi cashed US$4 500 and Chirinda walked home US$3 750 richer for being the third best. It was an evening to remember for Ngezi Platinum Stars after their coach Takesure Chiragwi also nailed the Coach of the Year, for the first time. Youthful forward from the Mhondoro side Takunda Benhura won the Top Goal Scorer award. Benhura received his Golden Boot award after scoring 13 goals in his first full season. He received US$6 375. Champions Ngezi Platinum dominated the evening where they were also presented with the league trophy by Guest of Honour, the Deputy Minister of Sports, Recreation, Arts and Culture, Emily Jesaya. For the second year running, they were also named the Most Disciplined Team of the Year. The Mhondoro side had three players on the 2023 PSL calendar, with goalkeeper Nelson Chadya and 22-year-old forward Takunda Benhura also joining Soccer Star Amini on the podium. But the evening belonged to Amini, who had a particularly impressive second half of the season to help the platinum miners reach the Promised Land. Veteran Highlanders goalkeeper Ariel Sibanda scooped the Goalkeeper of the Year award for his 19 clean sheets. Dynamos rookie Elton Chikona was voted the Most Promising Player of the Year. The teenage forward pipped teammate Junior Makunike in a close contest with fellow Glamour Boy. Voting was done by a hybrid panel comprising journalists, coaches and captains of the 18 PSL clubs, using a secure electronic voting platform. Convener of the selection panel Lawrence Moyo said the process was smoother this year although participation was not 100 percent. Herentals forward Tinotenda Benza, for the second year running was the Fans favourite. Brighton Chimene won the referee of the year for the third time, having previously won it in 2016 and 2019. Guest of Honour Jesaya hailed the football authorities in the country as well as sponsors Delta Beverages for keeping the game alive even during the period when the country was under FIFA suspension. “Notably, I would like to thank Delta Beverages for their unwavering support towards football and sport development in Zimbabwe. Under their different brands, Delta Beverages has changed the face of football through the Castle Lager Premier Soccer League as well as capacitating various football stakeholders through sponsoring training workshops and promoting sporting events. “The Ministry applauds you for your commitment towards sectoral growth The Government would like to commend the Sport and Recreation Commission (SRC), ZIFA and PSL for ensuring that domestic football continued during the FIFA suspension and providing entertainment to football lovers around the country and sustained footballer’s livelihoods,” said Jesaya. Delta Beverages Marketing Director Irimayi Muzorewa said it was a pleasure to celebrate the best players of the 2023 season. PSL chairman Farai Jere also hailed the XI finalists. He also challenged the local players to score more goals next season after the Golden Boot was won by 13 goals this year. Jere said 567 goals were scored from the 360 matches played during the season. This was a significant decrease from the 594 goals netted last season. “We expect our goals to go up each year but this year we had a challenge. The top goal scorer Takunda Benhura has 13 goals. Last year the top goal scorer had 17 goals. “So, it’s a challenge to the players to up their game. I would like to challenge our strikers to score more goals next season. “Our main objective is to improve our game so that it becomes attractive and makes it appealing to stakeholders,” said Jere. Qadr Amini (Ngezi Platinum Stars) Donald Mudadi (Dynamos) Obriel Chirinda (Bulawayo Chiefs) Takunda Benhura, Nelson Chadya (all Ngezi Platinum Stars), Tanaka Shandirwa (Dynamos), Andrew Mbeba, Ariel Sibanda (Highlanders), Tino Benza (Herentals), Fortune Binzi (Manica Diamonds) and Michael Charamba (Chicken Inn). Takunda Benhura (Ngezi Platinum Stars) Takesure Chiragwi (Ngezi Platinum Stars) Ariel Sibanda (Highlanders) Elton Chikona (Dynamos) : Tinotenda Benza (Herentals) Ngezi Platinum Stars Brighton Chimene Francis Chirwa Zondiwa Nkosana “Engineer, sound please…,” “ 1-2-3 testing, engineer, mic check, engineer volume bho-o here…” How many times have you heard such words, especially at a concert with artistes trying to rectify their sound quality production on stage during the middle of a show? With the advent of technology, it now seems a thing of the past, […] IN what is, undoubtedly, the lowest point for Zimbabwe Cricket, the national cricket team will not be taking part at the ICC Men’s T20 World Cup in the West Indies and the United States mid next year. Remarkably, Zimbabwe will be the only Test-playing nation missing at the tournament after failing to secure a Top […] Thupeyo Muleya Beitbridge Bureau Zimbabweans working and living in South Africa on the strength of a special three years’ permit have welcomed its extension by the host government for another two years. South Africa’s Home Affairs Minister Dr Aaron Motsoaledi announced that his government had further extended the lifeline of the Zimbabwe Exemption Permit (ZEP), […]","pubDate":"2023-12-01 22:03:50","image_url":null,"source_id":"herald_zw","source_priority":445177,"country":["zimbabwe"],"category":["sports"],"language":"english"},{"article_id":"303665a1e9ace8ab3d2c734d4d5baad0","title":"India breaks Pakistan record to achieve most wins in men's T20Is after Raipur triumph","link":"https://www.indiatvnews.com/sports/cricket/ind-vs-aus-india-breaks-pakistan-record-to-achieve-most-wins-in-men-s-t20is-after-raipur-triumph-2023-12-02-905329","keywords":null,"creator":null,"video_url":null,"description":"Team India stormed back into the ongoing five-match series against Australia with a series-clinching win in Raipur in the fourth T20I on Friday, December 1. The bowlers and batters combined to help India come up trumps by 20 runs despite a score of 174 not being a great one. The win not only helped India clinch the series and take an unassailable 3-1 lead but also become the most successful team in men's T20Is in terms of the number of wins.","content":"Team India stormed back into the ongoing five-match series against Australia with a series-clinching win in Raipur in the fourth T20I on Friday, December 1. The bowlers and batters combined to help India come up trumps by 20 runs despite a score of 174 not being a great one. The win not only helped India clinch the series and take an unassailable 3-1 lead but also become the most successful team in men's T20Is in terms of the number of wins. Team India broke Pakistan's record of most wins in men's T20Is as both were tied on 135 victories in the shortest format before Friday. No other team is even close as New Zealand, who are on third in the list have 102 wins to their name in the format. 136 - India, in 213 matches 135 - Pakistan, in 226 matches 102 - New Zealand, in 200 matches 95 - South Africa, in 171 matches 95 - Australia, in 181 matches Yes, India and Pakistan have played the most matches too but it is a no mean feat, which shows the consistency of the Men in Blue in the format over the years. Yes, the silverware has eluded since the inaugural World T20 edition in 2007, but the Indian team has been really consistent across formats and will hope that a repeat of 2007 is round the corner in T20Is. The preparation for the T20 World Cup 2024 has started for India with this series and the upcoming assignment against South Africa with the likes of Yashasvi Jaiswal, Rinku Singh and Mukesh Kumar coming good. Whether India stay with the young guns or a return of and is on the cards, only time will tell but for now, the team that is currently in action definitely holds promise.","pubDate":"2023-12-02 00:45:01","image_url":"https://resize.indiatvnews.com/en/resize/newbucket/715_-/2023/12/75930-1701456656.jpg","source_id":"indiatvnews","source_priority":10055,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"4feef1fb8b5578a7846f2c8b7e850ed8","title":"Harmanpreet to captain India in upcoming Tests","link":"http://www.newindianexpress.com/sport/cricket/2023/dec/02/harmanpreet-to-captain-india-in-upcoming-tests-2638068.html","keywords":null,"creator":null,"video_url":null,"description":"The squad for the T20I series against Australia will be announced later. After a hiatus of nine years, India will play two Tests on home soil. CHENNAI: Harmanpreet Kaur will lead the Indian squad in two Tests against England and Australia respectively, starting from December 14. BCCI has also announced the squad for the three-match T20I series against England. The squad for the T20I series against Australia will be announced later. After a hiatus of nine years, India will play two Tests on home soil. Saika Ishaque, one of the breakout performers from the Women’s Premier League and U19 T20 World Cup winner, Titas Sadhu, have found a place in the Test squad. After consistent performances, Shreyanka Patil has received a senior call-up for the first time. India’s T20Is squad vs England: Harmanpreet Kaur (C), Smriti Mandhana (VC), Jemimah Rodrigues, Shafali Verma, Deepti Sharma, Yastika Bhatia (wk), Richa Ghosh (wk), Amanjot Kaur, Shreyanka Patil, Mannat Kashyap, Saika Ishaque, Renuka Singh Thakur, Titas Sadhu, Pooja Vastrakar, Kanika Ahuja, Minnu Mani. For Tests vs England & Australia: H Kaur (C), S Mandhana (VC), J Rodrigues, Shafali Verma, Deepti Sharma, Y Bhatia (wk), Richa Ghosh (wk), Sneh Rana, Shubha Satheesh, Harleen Deol, Saika Ishaque, Renuka Thakur, Titas Sadhu, Meghna Singh, R Gayakwad, P Vastrakar.","content":"CHENNAI: Harmanpreet Kaur will lead the Indian squad in two Tests against England and Australia respectively, starting from December 14. BCCI has also announced the squad for the three-match T20I series against England. The squad for the T20I series against Australia will be announced later. After a hiatus of nine years, India will play two Tests on home soil. Saika Ishaque, one of the breakout performers from the Women’s Premier League and U19 T20 World Cup winner, Titas Sadhu, have found a place in the Test squad. After consistent performances, Shreyanka Patil has received a senior call-up for the first time. : Harmanpreet Kaur (C), Smriti Mandhana (VC), Jemimah Rodrigues, Shafali Verma, Deepti Sharma, Yastika Bhatia (wk), Richa Ghosh (wk), Amanjot Kaur, Shreyanka Patil, Mannat Kashyap, Saika Ishaque, Renuka Singh Thakur, Titas Sadhu, Pooja Vastrakar, Kanika Ahuja, Minnu Mani. : H Kaur (C), S Mandhana (VC), J Rodrigues, Shafali Verma, Deepti Sharma, Y Bhatia (wk), Richa Ghosh (wk), Sneh Rana, Shubha Satheesh, Harleen Deol, Saika Ishaque, Renuka Thakur, Titas Sadhu, Meghna Singh, R Gayakwad, P Vastrakar.","pubDate":"2023-12-02 00:33:00","image_url":"https://images.newindianexpress.com/uploads/user/imagelibrary/2023/12/2/original/333848W-preview.jpg","source_id":"newindianexpress","source_priority":15406,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"66d54a5135a1a71bbe2fc29d9be0f215","title":"77 स्लॉट.. 1166 खिलाड़ी, IPL 2024 के लिए हाई कंपटीशन, देखें प्लेयर्स की लिस्ट","link":"https://hindi.news18.com/cricket/1166-players-have-put-their-names-up-for-auction-for-77-slots-for-ipl-2024-7869444.html","keywords":null,"creator":null,"video_url":null,"description":"IPL 2024: आईपीएल 2024 के लिए टीमों और खिलाड़ियों ने पूरी तैयारी कर ली है. टूर्नामेंट के लिए ऑक्शन 19 दिसंबर को होना है. इसके पहले आईपीएल ने उन प्लेयर्स की लिस्ट शामिल कर दी है, जिन्होंने नीलामी के लिए अपना नाम दिया है.","content":"आईपीएल 2024 के लिए 1166 प्लेयर्स ने अपना नाम दिया है. (ipl) नई दिल्ली. आईपीएल (IPL 2024) के लिए सभी टीमें अपने-अपने खेमें प्लान करने में लग चुकी हैं. इसके लिए मिनी ऑक्शन में 3 हफ्ते से भी कम समय बचा हुआ है. वर्ल्ड कप में शानदार प्रदर्शन करने वाले खिलाड़ियों पर फ्रेंचाइजियों ने निश्चित तौर पर फोकस किया होगा. इसके अलावा कई युवाओं की उम्मीदें फ्रेंचाइजियों पर टिकी होंगी. आईपीएल ने शुक्रवार को आगामी सीजन के लिए 1166 खिलाड़ियों लंबी सूची शेयर की, जिन्होंने ऑक्शन के लिए अपना नाम दिया है. आईपीएल द्वारा दी गई सूची में एसोसिएट देशों के 45 खिलाड़ी शामिल हैं. इसके अलावा 909 अनकैप्ड खिलाड़ियों के नाम हैं जिसमें से 812 भारतीय हैं. लिस्ट में 18 कैप्ड भारतीय खिलाड़ी शामिल हैं. आईपीएल 2024 में 10 फ्रेंचाइजी हिस्सा ले रही हैं, जिनके पास भरने के लिए 77 स्लॉट हैं. इसमें से 30 स्लॉट विदेशी प्लेयर्स के लिए हो सकते हैं. वहीं, फ्रेंचाइजियों के कुल पर्स की बात करें तो नीलामी के लिए कुल 262.95 करोड़ रुपये रकम होगी. सबसे ज्यादा बेस प्राइस के साथ शामिल होने वाली खिलाड़ियों की लिस्ट में कुल 25 प्लेयर्स शामिल हैं. 2 करोड़ रुपये बेस प्राइस वाले खिलाड़ी हर्षल पटेल, शार्दुल ठाकुर, उमेश यादव, केदार जाधव, मुजीब उर रहमान, सीन एबॉट, पैट कमिंस, जोश हेजलवुड, ट्रैविस हेड, जोस इंग्लिस, मिचेल स्टार्क, स्टीव स्मिथ, मुस्ताफिजुर रहमान , टॉम बैंटन, हैरी ब्रुक, बेन डकेट, जेमी ओवरटन, आदिल राशिद, डेविड विली, क्रिस वोक्स, लॉकी फर्ग्यूसन, जेराल्ड कोएत्ज़ी, रिले रोसौव, रासी वैन डेर डुसेन, एंजेलो मैथ्यूज. 1.5 करोड़ रुपये बेस प्राइस वाले खिलाड़ी मोहम्मद नबी, मोइजेस हेनरिक्स, क्रिस लिन, केन रिचर्डसन, डैनियल सैम्स, डैनियल वॉरॉल, टॉम कुरेन, मर्चेंट डी लैंग, क्रिस जॉर्डन, डेविड मालन, टाइमल मिल्स, फिल साल्ट, कोरी एंडरसन , कॉलिन मुनरो, जिमी नीशम, टिम साउथी, कॉलिन इनग्राम, वानिंदु हसरंगा, जेसन होल्डर, शेरफेन रदरफोर्ड. IPL 2024: वर्ल्ड चैंपियन बनते ही बढ़े ऑस्ट्रेलियाई प्लेयर्स के दाम, ऑक्शन में टॉप बेस प्राइस से मारेंगे एंट्री, देखें लिस्ट 1 करोड़ रुपये बेस प्राइस वाले खिलाड़ी एश्टन एगर, रिले मेरेडिथ, डार्सी शॉर्ट, एश्टन टर्नर, गस एटकिंसन, सैम बिलिंग्स, माइकल ब्रेसवेल, मार्टिन गुप्टिल, काइल जैमीसन, एडम मिल्ने, डेरिल मिशेल, वेन पार्नेल, डेवाल्ड प्रिटोरियस, अल्ज़ारी जोसेफ, रोवमैन पॉवेल, डेविड विसे. . Tags: IPL , IPL Auction एक्टिंग डेब्यू के साथ सिंगिंग में आजमाया हाथ, 'दि आर्चीज' की रिलीज से पहले ही छाए वेदांग रैना Free Foods In Delhi: दिल्ली में इन जगहों पर घूमने के साथ-साथ खाएं फ्री खाना, जानें लोकेशन 3 दिन तक लगाए चक्कर, नहीं माने सुपरस्टार तो तेलुगू फिल्म दिखा किया राजी, रीमेक हिट होते ही मेकर हुए मालामाल","pubDate":"2023-12-02 00:31:03","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/10/IPL-Trophy-1-2023-10-ba91f9a0002954c954797250d0f742b8-3x2.jpg","source_id":"hindinews18","source_priority":6509,"country":["india"],"category":["sports"],"language":"hindi"},{"article_id":"c63226386bb9840be329892fe5904038","title":"Ex-Pakistan Test captain Salman Butt appointed to first official role since he was jailed in 2011 for spot-fixing, being named as a consultant to new chief selector Wahab Riaz","link":"https://www.dailymail.co.uk/sport/cricket/article-12816501/Ex-Pakistan-Test-captain-Salman-Butt-appointed-official-role-jailed-2011-spot-fixing-named-consultant-new-chief-selector-Wahab-Riaz.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"DAVID KENT: The Pakistan Cricket Board have named Butt as one of three consultants to new chief selector Wahab Riaz. Butt was jailed for 30 months for his part in a spot-fixing conspiracy.","content":"Ex-Pakistan Test captain Salman Butt appointed to first official role since he was jailed in 2011 for spot-fixing, being named as a consultant to new chief selector Wahab Riaz Ex-Pakistan Test captain Salman Butt has been appointed to his first official role It comes after he was jailed in 2011 for spot-fixing and spent 30 months in prison He will work as a consultant to Pakistan's new chief selector Wahab Riaz By David Kent for the Daily Mail Published: 18:46 EST, 1 December 2023 | Updated: 18:46 EST, 1 December 2023 e-mail View comments Former Pakistan Test captain Salman Butt has been appointed to a first official role since he was jailed for spot-fixing. The Pakistan Cricket Board have named Butt as one of three consultants to new chief selector Wahab Riaz. In 2011, Butt was jailed for 30 months for his part in a conspiracy to bowl deliberate no-balls during the Test against England at Lord’s the previous summer. Butt was also handed a 10-year ban, with five years suspended, for his role in the controversy, which involved team-mates Mohammad Asif and Mohammad Amir. Butt, who returned to play domestic cricket in 2016, will take up his role with immediate effect ahead of the T20 series against New Zealand in January. Former Pakistan Test captain Salman Butt (middle) has been appointed as a consultant to Pakistan's chief selector Wahab Riaz It comes after Butt was jailed for 30 months in 2011 after he was found guilty of spot-fixing Butt returned to domestic cricket in 2016 and will take up his new role with immediate effect The move follows an overhaul of Pakistan’s set-up after their early exit from the World Cup. Mohammad Hafeez has come in as team director, with Shan Masood named Test skipper and Shaheen Afridi leading the T20 side after Babar Azam stepped down as captain in all formats. The move comes following Pakistan's early Cricket World Cup exit, with Riaz also taking up a new position New Zealand Share or comment on this article: Ex-Pakistan Test captain Salman Butt appointed to first official role since he was jailed in 2011 for spot-fixing, being named as a consultant to new chief selector Wahab Riaz e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-12-01 23:46:38","image_url":"https://i.dailymail.co.uk/1s/2023/12/01/23/78490923-0-image-m-91_1701474133042.jpg","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"01572508f7b30f22452750da2934f0b1","title":"Harbhajan Singh questions Yuzvendra Chahal’s ODI selection for SA tour, calls it a ‘lollypop’","link":"https://thenewsmill.com/2023/12/harbhajan-singh-questions-yuzvendra-chahals-odi-selection-for-sa-tour-calls-it-a-lollypop/","keywords":["Cricket","Sports","ANI"],"creator":["ANI"],"video_url":null,"description":"The News Mill","content":"A day after India announced their squad for the all-important tour of South Africa, former spinner Harbhajan Singh on Friday questioned Yuzvendra Chahal’s selection for the tour, and said that they gave him a “lollypop to suck on.” On Thursday, the Board of Control for Cricket in India (BCCI)’s selection committee, named the Men in Blue’s squad for all three formats. Chahal has been included in the Indian ODI team for SA tour. While speaking on his official YouTube channel, Bhajji said that it was beyond his understanding why the 33-year-old was selected to the ODI squad but not for the T20I team. “There is no Yuzvendra Chahal in T20 format. You kept him in ODIs but not T20Is. They just gave him a lollypop to suck on. We won’t take in the format where you do well but will take for other formats. It’s beyond my understanding,” Harbhajan said on his YouTube channel. Meanwhile, the former spinner said that the Proteas tour won’t be easy for the Indian players and will be tough for the batters since the ‘Men in Blue’ won’t have Cheteshwar Pujara and Ajinkya Rahane in their squad. “South Africa tour is not easy. It’s tough for batters. There you won’t have Cheteshwar Pujara and Ajinkya Rahane. Youth are indeed getting opportunities. It’s a good thing. But I don’t think that selectors had a chat with Rahane, Pujara, or Umesh Yadav because whenever Yadav has played in Tests, he has performed,” he added. On the other hand, following his inclusion on the ODI squad, Chahal took to his official social media account and wrote, “Here we go AGAIN!” https://x.com/yuzi_chahal/status/1730240586202878304?s=20 The tour will begin with the three-match T20I affair on December 10 at the Kingsmead Stadium. The second T20I will be played on December 12 at the St George’s Oval. The 20-over format will conclude on December 14 at the Wanderers Stadium. The 50-over clash will kick off on December 17 at the Wanderers Stadium. The second and final ODI will be played on December 19 and December 21 respectively. India’s squad for Tests: Rohit Sharma (C), Shubman Gill, Yashasvi Jaiswal, Virat Kohli, Shreyas Iyer, Ruturaj Gaikwad, Ishan Kishan (wk), KL Rahul (Wk), Ravichandran Ashwin, Ravindra Jadeja, Shardul Thakur, Mohd. Siraj, Mukesh Kumar, Mohd. Shami*, Jasprit Bumrah (VC), Prasidh Krishna. India’s squad for 3 T20Is: Yashasvi Jaiswal, Shubman Gill, Ruturaj Gaikwad, Tilak Varma, Suryakumar Yadav (C), Rinku Singh, Shreyas Iyer, Ishan Kishan (Wk), Jitesh Sharma (Wk), Ravindra Jadeja (VC), Washington Sundar, Ravi Bishnoi, Kuldeep Yadav, Arshdeep Singh, Mohd. Siraj, Mukesh Kumar, Deepak Chahar. India’s squad for 3 ODIs: Ruturaj Gaikwad, Sai Sudharsan, Tilak Varma, Rajat Patidar, Rinku Singh, Shreyas Iyer, KL Rahul (C) (Wk), Sanju Samson (Wk), Axar Patel, Washington Sundar, Kuldeep Yadav, Yuzvendra Chahal, Mukesh Kumar, Avesh Khan, Arshdeep Singh, Deepak Chahar. (ANI)","pubDate":"2023-12-01 23:31:06","image_url":"https://thenewsmill.com/wp-content/uploads/2023/12/harbhajan-singh-questions-yuzvendra-chahals-odi-selection-for-sa-tour-calls-it-a-lollypop.jpg","source_id":"thenewsmill","source_priority":3781717,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"4e20310fdfa2393c84f6ab21dbc4b857","title":"Danny Macklin reveals he has been found safe in Cornwall by police officers after appeal had been launched to find ex-AFC Wimbledon managing director following worrying social media posts - days on from his FA charge of misconduct","link":"https://www.dailymail.co.uk/sport/football/article-12816295/Danny-Macklin-reveals-safe-Cornwall-police-officers-appeal-launched-ex-AFC-Wimbledon-managing-director-following-worrying-social-media-posts-days-FA-charge-misconduct.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"He was last seen on foot in Great Notley near Braintree in Essex on Friday, but according to a Tweet posted on his X (formerly Twitter account) was found in Looe in Cornwall.","content":"Danny Macklin reveals he has been found safe in Cornwall by police officers after appeal had been launched to find ex-AFC Wimbledon managing director following worrying social media posts - days on from his FA charge of misconduct Former AFC Wimbledon chief Danny Macklin says he has been found safe An appeal had been launched to find MR Macklin after he had gone missing Mr Macklin stated that he was found in Looe, in Cornwall by Police on Friday By Ed Carruthers For Mailonline Published: 17:23 EST, 1 December 2023 | Updated: 17:58 EST, 1 December 2023 e-mail Former AFC Wimbledon managing director Danny Macklin has revealed he has been found safe in Cornwall by police officers, following an appeal to find the 32-year-old after he went missing, having also posted a worrying message on his social media. He was last seen on foot in Great Notley near Braintree in Essex on Friday, but according to a Tweet posted on his X (formerly Twitter ) account he was found safe in Looe, Cornwall. He wrote on his X account: 'I have been found safely by Cornwall Police in Looe just prior to going into what I can assure you was cold sea water! 'Thank you for all the well wishes - I will seek the help I need and sorry for the terrible pain I have caused so many and then seek to rebuild my career/life.' Mr Macklin had been charged with misconduct by the Football Association on Tuesday after hidden camera recordings unveiled the former Wimbledon director made abusive comments towards a female colleague. Danny Macklin has revealed on his social media that he has been found safe after he had gone missing Mr Macklin wrote on X (formerly Twitter) that he had been found by Cornwall Police in Looe The comments were made about Wimbledon's head of supporter services and ticketing Rebecca Markham. Mr Macklin was given until December 6 to provide the FA with a response. He said that he was 'not sexist' but said the private conversation was '100 per cent at fault' and revealed that his 'life is in tatters'. He added that the comments 'had caused so much pain for so many people' and deeply regretted his words. In his message on social media, Mr Macklin also apologised to his wife Claire and his Children, Harry and Ruby stating that he had been 'the opposite of a good husband'. He wrote: 'I should have put family first, not the determination to be a CEO in the Premier League.' Essex Police had issued a statement on Friday asking members of the public for any information on Mr Macklin's whereabouts. In a statement, they said: 'We want to find Danny Macklin, 32, last seen on foot in Great Notley at 10.50am,' police released in a statement. 'Danny is 6ft 4in, with a shaved head, wearing a long black coat, a grey and black bobble hat, black jeans and grey and white trainers. 'Please call 999 with incident 372 of today, 1 December.' AFC Wimbledon released a statement in response to the allegations ahead of the FA's charge One of Macklin's old clubs Leyton Orient gave their support, saying 'we are here for you' Mr Macklin, who left his post at Wimbledon on September 8, has also held positions at Leyton Orient, Southend United and Essex County Cricket Club. Orient posted a message of support for Mr Macklin on social media on Friday saying: 'Danny, we can't begin to understand how you are feeling right now but please just know that we are all here for you,' the club said in a statement. 'It takes a strong person to admit their mistakes, which you have done, and an even stronger one to overcome the adversity that follows them. We know you can do this too. We hope that the number of messages you have received today prove to you how valuable you are to this world. 'We are all here for you and will give you all the help you need.' More to follow... For confidential support call the Samaritans on 116123 or go to samaritans.org Twitter Wimbledon Share or comment on this article: Danny Macklin reveals he has been found safe in Cornwall by police officers after appeal had been launched to find ex-AFC Wimbledon managing director following worrying social media posts - days on from his FA charge of misconduct e-mail Sorry we are not currently accepting comments on this article.","pubDate":"2023-12-01 22:58:29","image_url":"https://i.dailymail.co.uk/1s/2023/12/01/22/78489439-0-image-a-114_1701469517873.jpg","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"dd7c1d6f88f2332f563bfec2ba32178e","title":"$137m war erupts over relocation plan for AFL and cricket during Gabba redevelopment for Olympics","link":"https://7news.com.au/sport/olympics/137m-war-erupts-over-relocation-plan-for-afl-and-cricket-during-gabba-redevelopment-for-olympics-c-12759609","keywords":null,"creator":["Laine Clark"],"video_url":null,"description":"‘They have hung the AFL and cricket out to dry.’","content":"A row has erupted over a temporary home for and in Brisbane, with the Queensland government warned its major project is “not a done deal”. Brisbane Lord Mayor Adrian Schrinner has refused to back a funding plan for a $137 million RNA Showgrounds revamp, accusing the government of mismanagement. The sports minister on Friday unveiled the plan to renovate the inner-city showgrounds, creating a base for the and Queensland Cricket during the Gabba Olympic rebuild. However, Stirling Hinchliffe said the state government would commit only $47.5 million, with the Brisbane City Council, Lions, cricket and RNA to pay the rest. Mr Schrinner wasn’t happy. “They decided to knock down the Gabba and they should also provide a temporary venue,” he said. “The government needs to fix the problem that they have created. They are trying to put the cost on to the ratepayers of Brisbane - we won’t have it. “This is not going to happen based on this funding model. This is not a done deal.” Mr Schrinner said the sports minister told him the $2.7 billion Gabba rebuild budget included relocation costs for the Lions and Queensland Cricket. Under the revamp plans, a 20,000-seat stadium will be built at the showgrounds that will be scaled back to 12,000 after the 2032 Games. The lord mayor said it made sense to revamp the showgrounds and was happy to discuss a “minor” funding contribution. “But for the state government ... to expect council to fund the majority of the project ... it is really disorganised planning on the state government’s part,” he said. “They seem to be playing political games and they have also hung out the AFL and cricket to dry.” Mr Schrinner claimed to have been kept in the dark, saying the state government told him last week an announcement for a temporary cricket and AFL venue was months away. He claimed the first he heard about the revamp project was via a “rushed” letter sent by Mr Hinchliffe late Thursday night. “I expect they had already told the media before they told us - it’s just not polite and it’s no way to manage a major project,” he said. “This is not the way you enter into a genuine partnership.” Mr Hinchliffe denied he had kept the lord mayor in the dark, accusing Mr Schrinner of the silent treatment. “The lord mayor has refused to respond to a phone call I made to him yesterday,” he said. “It became clear from the response from his office that there was going to be no further conversation between myself and the lord mayor immediately.” Asked why he had gone ahead with a Friday media conference, Mr Hinchliffe said: “It was important that we shared this information with the other stakeholders and with the community.” He said progress would need to be made soon if the revamp was going to be ready in time. “We know work needs to be starting next year for the refurbished main arena to be ready for a 2025-26 cricket season,” he said. “But this is the beginning of the negotiations that we need to have. “So I am very pleased we are able to identify what this project looks like and start working with all the partners on delivering an outcome.” The Lions backed a showgrounds relocation, describing Friday’s announcement as a “starting point”. “We will continue dialogue with government and other stakeholders regarding progressing the RNA as quickly as possible to ensure the project can be funded and the club is supported through displacement,” Lions CEO Greg Swann said.","pubDate":"2023-12-01 22:52:12","image_url":"https://images.7news.com.au/publication/C-12759609/2ad46ef695f5497249463a2ca4abe423e3d6d560-16x9-x0y0w1920h1080.jpg","source_id":"7news","source_priority":7652,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"8ab0aba3d575650602e9e32463c32047","title":"Danny Macklin: Ex-AFC Wimbledon chief confirms he's been \"found safely\" after police search","link":"https://www.mirror.co.uk/sport/football/news/danny-macklin-found-afc-wimbledon-31578957","keywords":["Sport"],"creator":["mirrornews@mirror.co.uk (Darren Wells)"],"video_url":null,"description":"Police launched an appeal for information regarding Danny Macklin's whereabouts just days after the former AFC Wimbledon chief was charged by the FA in relation to allegations made by a colleague","content":"Former AFC Wimbledon chief Danny Macklin has confirmed he's been \"found safely\" following a police search after concerns grew for his welfare. Police launched an appeal for information as to his whereabouts on Friday after he was last spotted in Great Notley, Essex at 10:50am. Macklin issued a message later on Friday to state he had been in contact with police in Looe, Cornwall, adding: \"Thank you for all the well wishes - I will seek the help I need and sorry for the terrible pain I have caused so many and then seek to rebuild my career / life.\" Macklin has held a number of executive roles in sport, including at Leyton Orient, Southend United and Essex County Cricket Club. He was managing director of AFC Wimbledon but left earlier this season after allegations were made against him by a colleague. He was charged by the FA on Wednesday in relation to those allegations before going missing on Friday, prompting a spokesperson for Essex Police to issue a statement which read: \"If you have seen Danny or have any information that may help us find him, please call 999 quoting incident 372 of Friday December 1.\" Football fans responded to Macklin's message by issuing their heartfelt thanks he was safe. Braintree Town FC wrote: \"We're all extremely glad to hear you are safe Danny, from the whole of the huge family you have at Braintree Town we wish you all the best and for your future safety.\" If you're struggling and need to talk, the Samaritans operate a free helpline open 24/7 on 116 123. Alternatively, you can email jo@samaritans.org or visit their site to find your local branch.","pubDate":"2023-12-01 22:51:12","image_url":"https://i2-prod.mirror.co.uk/incoming/article31576136.ece/ALTERNATES/s615/3_danny-macklin-the-first-interview.jpg","source_id":"mirroruk","source_priority":910,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"a650749b7a63736d1e0387e1a4023503","title":"20 years on, a transformed New Zealand looks back at ‘Lord of the Rings’","link":"https://www.mercurynews.com/2023/12/01/20-years-on-a-transformed-new-zealand-looks-back-at-lord-of-the-rings/","keywords":["Entertainment","Movies","Things To Do","Travel","network"],"creator":["Tribune News Service"],"video_url":null,"description":"The farmland that Jackson's crew turned into Hobbiton, the fictional Middle-earth village where the films are set, has drawn as many as 650,000 visitors a year, making it one of the top attractions in a country that relied on tourism for about 20% of its export earnings, pre-pandemic.","content":"WELLINGTON, New Zealand — New Zealand was primarily known abroad for its sheep, its wine and its rugby team on the September day in 1998 that filmmaker Peter Jackson’s helicopter landed on a sprawling family farm about 100 miles south of Auckland. The country’s film industry was another matter: Though New Zealand had produced crossover successes like Jackson’s “Heavenly Creatures” and Jane Campion’s Oscar winner “The Piano,” it was nearly as far from the thinking of Hollywood studios as it was from Hollywood itself. But that was about to change. The lush farmland on which Jackson’s crew alighted would soon become the backdrop for “The Lord of the Rings,” one of the most ambitious, influential and profitable film series ever made. And in the two decades since the release of “The Return of the King,” the Oscar-winning final film in Jackson’s trilogy, New Zealand has become a major player in the global motion picture industry. “It absolutely put us on the map,” said Jasmine Millet, head of creative industries at Tataki Auckland Unlimited and an advocate for the region’s filmmaking industry. “People started thinking about New Zealand, wanting to visit New Zealand en masse in a way that they never would have without those films. “The industry was already building up. That whole filmmaking process and that language of cinematic storytelling, all of that stuff was ready and ripe. What Peter and the team did was just absolutely take it to the next level.” The three films, combined for 30 Academy Award nominations and 17 wins and earned nearly $3 billion in worldwide box office receipts. It also pioneered new technologies in special effects and software systems and advancing the use of motion capture to animate digital characters. The movies were so popular they inspired a second Oscar-nominated trilogy, a decade later, which spurred its own tourism industry. The farmland that Jackson’s crew turned into Hobbiton, the fictional Middle-earth village where the films are set, has drawn as many as 650,000 visitors a year, making it one of the top attractions in a country that relied on tourism for about 20% of its export earnings, pre-pandemic. Before COVID-19, nearly one in five visitors said their decision to come to New Zealand was influenced by the hobbit films. “The trilogy is just a big advertisement for New Zealand,” said Shayne Forrest, general manager for tourism at the 12-acre Hobbiton movie set. “The filmmakers that made these movies, Peter Jackson and all his team, they’re all New Zealanders. So it really got to showcase New Zealand as being a creative hub that could punch well above its weight in the international arena.” Their success reversed an exodus that once saw successful filmmakers such as Campion and Lee Tamahori (“Once Were Warriors”) leave New Zealand to work in the U.S., Italy and the U.K. In 1998, the year Jackson began scouting locations for his Tolkien films, just five features made in New Zealand were released in theaters. Less than a decade later the country was turning out twice as many annually; among the major productions that followed “The Lord of the Rings” were “King Kong,” Disney’s live-action “Mulan,” James Cameron’s two and the first two installments of “The Chronicles of Narnia.” New Zealand’s film industry now generates about $2.08 billion in GDP annually. Millet said the transition from so-called “swords and sandals” TV series such as “Xena: Warrior Princess” and “Hercules: the Legendary Journeys” to more substantial storytelling began with which won three Academy Awards and was the highest-grossing New Zealand film of all time when it came out in 1993. “It got us to thinking, ‘What are our stories? How do we work as filmmakers, what’s our unique take on this craft?’” she said of Campion’s film, which was shot largely in and around Auckland. “So when Peter came with the opportunity of ‘The Lord of the Rings’ films, he knew that there was this whole seedbed of talent that was already here and that had this way of working that was really a group of friends, in many ways, who wanted to bring their best in a super-creative way, workshopping ideas. “That was the preparation, that gave him the confidence to say, ‘I can make this incredible trilogy at home. I don’t need to go somewhere else.’ And even though it blew everybody away, at some level from the New Zealand perspective, it was kind of like ‘Yeah, we know how to do this. This is in our blood.’” For Jackson, it helped that Richard Taylor had become one of his friends. The two met in Wellington, Taylor said, when Jackson was still living at home with his parents and working on his first movie, the 1987 science-fiction comedy horror film “Bad Taste.” “He saw our work on television and, through a mutual friend, we were introduced to him,” said Taylor, who along with his wife, Tania Rodger, went on to work on Jackson’s second film, the low-budget 1989 black comedy “Meet the Feebles.” That work won Taylor and Rodger a New Zealand film award; after carefully wrapping the prize in napkins for the trip back to Wellington, Taylor turned to Rodger and said “we better treasure this moment, because it won’t get better than this.” Of course, it didn’t exactly play out that way. After collaborating on Jackson’s next three films, “The Lord of the Rings” series brought Taylor’s Weta Workshop — founded alongside Rodger and Jackson and named after a species of giant flightless cricket endemic to New Zealand — the first of its five Academy Awards. The statuettes, displayed in a floor-to-ceiling display case off the workshop’s main lobby alongside miniature collectibles Wētā Workshop created for films and other projects, have all had their nameplates removed. “They say that I won them, but I didn’t win them. I collected them for a group of people back home,” said Taylor, who, like Jackson, was knighted in 2010 for his services to film in New Zealand. Taylor and a staff of 36 were working out of a building they shared with an ice cream manufacturer when Jackson gave him his choice of creative departments for “The Lord of the Rings.” Taylor chose to look after the design and creation of armor, weapons, miniatures, special makeup effects and prosthetics, and though the average age of the Weta Workshop staff was just 22 when they got going and only one-eighth of the crew had ever worked on a film or TV show before, the studio built more than 48,000 separate items for the trilogy. “You teeter toward the edge of the cliff and you can either leap off with faith [and] hope the wind catches under your wings, or step back from the edge of the cliff,” Taylor said. “So yeah, it’s where ‘LOTR’ all started for us, when Peter gave us that magical phone call.” Weta Workshop now has a staff of approximately 400 working out of multiple buildings on Wellington’s Miramar peninsula, making everything from movie props to museum exhibits, consumer products, video gaming, sculptures and collectibles. For Taylor, who started the company that would become the Wētā Workshop with Rodger in a back room of the Wellington flat they shared, the workshop’s growth in both size and prestige was born of the same innovation and can-do spirit that fueled the rise of New Zealand’s film industry. “Certainly Peter could have picked up and just headed off overseas and made films on the global circuit,” said David Wilks, general manager of the Wētā Workshop. “But this is where they wanted to put down roots and make a base. One of the things we’ve prided ourselves in is, we’ve now built a sustainable creative career for a whole bunch of artisans.” “New Zealand had a film industry that had been around a long time,” Wilks continued. “But ‘Lord of the Rings’ supercharged what we could do on the world stage.” It was the country that made the movie, Taylor insists, not the other way around. “There’s no doubt that you could have made an adaptation of ‘The Lord of the Rings’ in any country with any film company with any populace. It just wouldn’t have been this ‘Lord of the Rings,’” he said. “The benefits once you actually come to New Zealand are huge, the exchange rate being one of them,” he continued. “New Zealand crew still get together for the love of making a movie. They don’t get together because of the good business of working on a film. There’s a very fundamental difference in that. “That’s something that resonates with film directors and producers that come from overseas. That can-do Kiwi spirit. There’s no ‘that’s impossible.’ You just don’t have that.” Nature, however, may have provided New Zealand’s filmmakers with their most valuable asset. “The geographic benefit of New Zealand is that you can be in Wellington, with all the infrastructure necessary to make a major feature film [and with] one-and-a-half hours’ flight, you can reach anywhere in the world … visually. The only thing that New Zealand doesn’t really do is sand-swept deserts,” Taylor said. “Somewhere as diverse as Middle-earth, we’re on a journey from pastoral Hobbiton to apocalyptic Mordor. That demands that you are able to traverse an incredible diversity of environments. That’s what New Zealand could offer.” What Jackson’s team was looking for the day their helicopter circled the Alexander family’s 1,250-acre sheep and beef farm, located at the base of Kaimai Range on New Zealand’s North Island, were unspoiled pastures, green rolling hills, gnarled trees and wet, foggy weather to stand in for the fictional Shire of the Tolkien novels. What they found was a location so remote, so pristine, that the New Zealand army was enlisted to build roads to get the filmmaker’s equipment in and out. The soldiers were then recruited to act in the movies’ battle scenes. Soon enough, the films were inspiring fans to make pilgrimages to the tiny town of Matamata, a two-hour drive from Auckland, to pad around the farm — even though the sets built for the original trilogy were demolished when filming was finished. When Jackson returned 10 years later and asked the Alexanders for permission to film “The Hobbit” on their property, it came with a condition: This time, the structures built for the project had to be permanent. So the filmmakers left behind 44 hobbit holes, the Green Dragon Inn and dozens of other props, turning the farm into a proper tourist trap. The hobbit films helped make Weta Workshop a tourist destination as well. Years ago, when Taylor noticed tour buses were making regular trips to the workshop’s campus, he would step out of his office to answer questions from visitors. Someone on his staff quickly suggested a better way to get the Weta Workshop story out would be to let the visitors in. The workshop now welcomes more than 165,000 visitors a year to its facilities in Wellington and tens of thousands more to Wētā Workshop Unleashed, an immersive look at the special-effects process, in Auckland. One of those who came and stayed was Kate Malone, 42, who grew up in Ohio but fell in love with the natural beauty of rural New Zealand when she saw the first trilogy, making a pilgrimage there a dozen years ago to see it for herself. “I knew I wanted to work in tourism with ‘Lord of the Rings,’” she said. But the country needed social workers, not tour guides, so she became a social worker to qualify for a visa, then lived for a while in Auckland and Wellington before applying for permanent residency. When Jackson took out a newspaper ad for people shorter than 5-foot-3 to be hobbit extras in the second trilogy, Malone auditioned and got the part. Since then, she’s spent most of her time in Hobbiton, where she gives several two-hour tours each day. Twenty years after the epic’s conclusion, the international interest Jackson’s trilogy sparked in New Zealand — including Malone’s — continues. Even for those who don’t arrive in Hobbiton fresh off an in-flight binge. “We get people from all over the world,” she said. “Some of them are really big fans and some of them have never seen the movies.”","pubDate":"2023-12-01 22:10:26","image_url":"https://www.mercurynews.com/wp-content/uploads/2023/12/ENTER-MOVIE-LORD-RINGS-NEWZEALAND-GET.jpg?w=1400px&strip=all","source_id":"mercurynews","source_priority":2968,"country":["united states of america"],"category":["sports"],"language":"english"},{"article_id":"f31a674781e90e941485b6148bb76890","title":"Qadr rules the roost","link":"https://www.herald.co.zw/qadr-rules-the-roost/","keywords":["Sport","Top Stories"],"creator":["wenceslaus"],"video_url":null,"description":"Eddie Chikamhi Senior Sports Reporter UTILITY man Qadr Amini was last night in a state of delirium as he was accompanied by his two wives to receive the Soccer Star of the Year crown. This follows a stellar season in which he captained Ngezi Platinum Stars to their maiden Castle Lager Premier Soccer League title. […]","content":"UTILITY man Qadr Amini was last night in a state of delirium as he was accompanied by his two wives to receive the Soccer Star of the Year crown. This follows a stellar season in which he captained Ngezi Platinum Stars to their maiden Castle Lager Premier Soccer League title. The 33-year-old former Zimbabwe international beat competition from Dynamos midfield kingpin Donald Mudadi, who finished as the first runner-up, and Bulawayo Chiefs marksman Obriel, who was the second runner-up. “I’m speechless. I cant express my joy right now but I want to thank my teammates and my coach Takesure Chiragwi; you are the best. I also want to thank my wives who are here with me. I love you so much guys. They have been very supportive throughout,” said Amini. Amini pocketed US$7 500 for his efforts while Mudadi cashed US$4 500 and Chirinda walked home US$3 750 richer for being the third best. It was an evening to remember for Ngezi Platinum Stars after their coach Takesure Chiragwi also nailed the Coach of the Year, for the first time. Youthful forward from the Mhondoro side Takunda Benhura won the Top Goal Scorer award. Benhura received his Golden Boot award after scoring 13 goals in his first full season. He received US$6 375. Champions Ngezi Platinum dominated the evening where they were also presented with the league trophy by Guest of Honour, the Deputy Minister of Sports, Recreation, Arts and Culture, Emily Jesaya. For the second year running, they were also named the Most Disciplined Team of the Year. The Mhondoro side had three players on the 2023 PSL calendar, with goalkeeper Nelson Chadya and 22-year-old forward Takunda Benhura also joining Soccer Star Amini on the podium. But the evening belonged to Amini, who had a particularly impressive second half of the season to help the platinum miners reach the Promised Land. Veteran Highlanders goalkeeper Ariel Sibanda scooped the Goalkeeper of the Year award for his 19 clean sheets. Dynamos rookie Elton Chikona was voted the Most Promising Player of the Year. The teenage forward pipped teammate Junior Makunike in a close contest with fellow Glamour Boy. Voting was done by a hybrid panel comprising journalists, coaches and captains of the 18 PSL clubs, using a secure electronic voting platform. Convener of the selection panel Lawrence Moyo said the process was smoother this year although participation was not 100 percent. Herentals forward Tinotenda Benza, for the second year running was the Fans favourite. Brighton Chimene won the referee of the year for the third time, having previously won it in 2016 and 2019. Guest of Honour Jesaya hailed the football authorities in the country as well as sponsors Delta Beverages for keeping the game alive even during the period when the country was under FIFA suspension. “Notably, I would like to thank Delta Beverages for their unwavering support towards football and sport development in Zimbabwe. Under their different brands, Delta Beverages has changed the face of football through the Castle Lager Premier Soccer League as well as capacitating various football stakeholders through sponsoring training workshops and promoting sporting events. “The Ministry applauds you for your commitment towards sectoral growth The Government would like to commend the Sport and Recreation Commission (SRC), ZIFA and PSL for ensuring that domestic football continued during the FIFA suspension and providing entertainment to football lovers around the country and sustained footballer’s livelihoods,” said Jesaya. Delta Beverages Marketing Director Irimayi Muzorewa said it was a pleasure to celebrate the best players of the 2023 season. PSL chairman Farai Jere also hailed the XI finalists. He also challenged the local players to score more goals next season after the Golden Boot was won by 13 goals this year. Jere said 567 goals were scored from the 360 matches played during the season. This was a significant decrease from the 594 goals netted last season. “We expect our goals to go up each year but this year we had a challenge. The top goal scorer Takunda Benhura has 13 goals. Last year the top goal scorer had 17 goals. “So, it’s a challenge to the players to up their game. I would like to challenge our strikers to score more goals next season. “Our main objective is to improve our game so that it becomes attractive and makes it appealing to stakeholders,” said Jere. Qadr Amini (Ngezi Platinum Stars) Donald Mudadi (Dynamos) Obriel Chirinda (Bulawayo Chiefs) Takunda Benhura, Nelson Chadya (all Ngezi Platinum Stars), Tanaka Shandirwa (Dynamos), Andrew Mbeba, Ariel Sibanda (Highlanders), Tino Benza (Herentals), Fortune Binzi (Manica Diamonds) and Michael Charamba (Chicken Inn). Takunda Benhura (Ngezi Platinum Stars) Takesure Chiragwi (Ngezi Platinum Stars) Ariel Sibanda (Highlanders) Elton Chikona (Dynamos) : Tinotenda Benza (Herentals) Ngezi Platinum Stars Brighton Chimene Francis Chirwa Zondiwa Nkosana “Engineer, sound please…,” “ 1-2-3 testing, engineer, mic check, engineer volume bho-o here…” How many times have you heard such words, especially at a concert with artistes trying to rectify their sound quality production on stage during the middle of a show? With the advent of technology, it now seems a thing of the past, […] IN what is, undoubtedly, the lowest point for Zimbabwe Cricket, the national cricket team will not be taking part at the ICC Men’s T20 World Cup in the West Indies and the United States mid next year. Remarkably, Zimbabwe will be the only Test-playing nation missing at the tournament after failing to secure a Top […] Thupeyo Muleya Beitbridge Bureau Zimbabweans working and living in South Africa on the strength of a special three years’ permit have welcomed its extension by the host government for another two years. South Africa’s Home Affairs Minister Dr Aaron Motsoaledi announced that his government had further extended the lifeline of the Zimbabwe Exemption Permit (ZEP), […]","pubDate":"2023-12-01 22:03:50","image_url":null,"source_id":"herald_zw","source_priority":445177,"country":["zimbabwe"],"category":["sports"],"language":"english"}]}