{"newsArray":[{"title":"Spine-tingling scenes as legend Ross Taylor left in tears during emotional cricket farewell","link":"https://www.foxsports.com.au/cricket/cricket-nz-vs-netherlands-odi-ross-taylor-farewell-images-video-score-result/news-story/ca6a718339ce888aec7562c143ea8358","keywords":null,"creator":null,"video_url":null,"description":"A tearful Ross Taylor was given a standing ovation as the New Zealand great made an emotional farewell to international cricket on Monday after 16 years at the top.","content":null,"pubDate":"2022-04-04 22:52:00","full_description":"A tearful Ross Taylor was given a standing ovation as the New Zealand great made an emotional farewell to international cricket on Monday after 16 years at the top. The visiting Netherlands team gave the 38-year-old a guard of honour as he came out to bat at number four in the third one-day international at Seddon Park in Hamilton. He was dismissed for 14, before the home side went on to win the match by a dominant 115 runs to sweep the series 3-0, with Taylor taking the final catch to wrap up victory in fitting fashion. Watch Australia’s Tour of Pakistan on Kayo. Every ODI and T20 Live & On-Demand. New to Kayo? Try 14-Days Free Now > New Zealands Ross Taylor (2nd L) lines up for the national anthems with his children (C to R) Adelaide, Jonty and Mackenzie and teammate Martin Guptill (L) before the start of his last match for New Zealand. Source: AFP The Netherlands team form a guard of honour for Ross Taylor. Source: Getty Images Taylor announced in December that the series against the Dutch would be his last hurrah. With his children on one side and teammates on the other, Taylor was in tears before the match as the players lined up for the national anthems, in his 450th and final appearance for New Zealand. The Seddon Park spectators rose to their feet and applauded generously as he came to the crease for the final time, and then again when he came out to field. Taylor bowed out of Test cricket in style in January, taking the last Bangladesh wicket to ensure New Zealand won the second Test in Christchurch and drew the series. Watch The 2022 Indian Premier League on Kayo. Every Match Live & On-Demand. New to Kayo? Try 14-Days Free Now > Ross Taylor leaves the field after being caught out during the third and final one-day international cricket match. Source: Getty Images Taylor has been a mainstay in the New Zealand batting order since making his debut in 2006, amassing a plethora of records and achievements. Among them are a New Zealand record 7,683 Test runs and he also scored the most runs for the country in ODIs. He also made the highest Test score in Australia by a visiting player, 290 at Perth in 2015. Taylor gets guard of honour in last game | 01:56","image_url":null,"source_id":"foxsports","country":["australia"],"category":["sports"],"language":"english"},{"title":"Taylor caps his brilliant career in style","link":"https://www.cairnspost.com.au/sport/cricket/taylor-caps-his-brilliant-career-in-style/video/fa73204c1d3d0cfa72e67db1cc5d9718","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket: In his last game for the Black Caps, Ross Taylor finished off his career in style, taking a catch to help New Zealand a massive victory over the Netherlands.","content":null,"pubDate":"2022-04-04 22:36:20","full_description":null,"image_url":null,"source_id":"cairnspost","country":["australia"],"category":["sports"],"language":"english"},{"title":"Netherlands give Taylor a guard of honour in his last game","link":"https://www.cairnspost.com.au/sport/cricket/netherlands-give-taylor-a-guard-of-honour-in-his-last-game/video/471a2271b40f54350408a8e390f5a09d","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket: In his last game for the Black Caps, Ross Taylor was given a fitting farewell from the Netherlands team after they formed a guard of honour.","content":null,"pubDate":"2022-04-04 22:36:20","full_description":null,"image_url":null,"source_id":"cairnspost","country":["australia"],"category":["sports"],"language":"english"},{"title":"Twist in Rioli row reopens painful Goodes wounds","link":"https://wwos.nine.com.au/afl/2022-hawthorn-cyril-rioli-racism-jeff-kennett-shaun-burgoyne-adam-goodes-caroline-wilson/96d6b885-54cb-4b76-bee0-70354705c5d8","keywords":null,"creator":["wwos"],"video_url":null,"description":"New claims have emerged amid the Hawks racism shame involving Cyril Rioli – and they relate to the Adam Goodes story.","content":"There was a view among Hawthorn's Indigenous players during the Adam Goodes booing saga that the Hawks should have made a stand against the mistreatment of the Sydney superstar, according to Caroline Wilson.The senior footy journalist on Monday night made new claims amid the Hawthorn racism scandal involving Hawks great Cyril Rioli.An article by Wilson had on Saturday been published in The Age on the back of an interview with Rioli and his wife, Shannyn, in which the pair publicly addressed a controversial remark from Hawthorn president Jeff Kennett in 2018.READ MORE: Gus, Gallen clash over NRL bias claimsREAD MORE: Police investigating brawling Broncos videoREAD MORE: Cricket legend in tears at spine-tingling farewellRioli saw the comment as the final straw in the club's contentious relationship with its Indigenous players, leading to the former Norm Smith medallist making a shock retirement call in 2018, at the age of just 28.In Monday night's edition of Nine's Footy Classified, Wilson discussed the Hawthorn racism row and raised new claims stemming from the Hawks' clash with the Swans in round eight, 2015.It was during that game at the MCG that Goodes was booed by a significant number of match-goers for the first time, setting in motion his devastating spiral into retirement.Wilson said that several of Hawthorn's Indigenous players, including Rioli and Shaun Burgoyne, were \"very upset\" at the booing aimed at Goodes.The Footy Classified panellist also said that after the game the Indigenous Hawthorn players spoke to various leaders at the club about the booing.Wilson added that Burgoyne later in the week met then Hawthorn chief executive Stuart Fox and then Hawks president Andrew Newbold \"to talk about his very deep feelings\" regarding the Goodes scenario.Hawthorn did not put out a statement on the situation regarding Goodes despite a belief among the Hawks' Indigenous players that the club should, and in spite of the emotional impact of the events.According to Wilson, the view of Newbold at the time was the booing was not racially motivated.Footy Classified is now available as a podcast! Subscribe/follow via Apple, Spotify or Google Podcasts.\"This is just one thing that happened at Hawthorn – and other clubs didn't respond well to the booing of Adam Goodes, either – but I've always felt that Hawthorn should have taken a stand (after the match against Sydney),\" Wilson said.In an indication of the shattering impact Hawthorn's precarious relationship with its Indigenous players has had on Rioli, the 189-game icon told The Age that the Hawks were the only club he wouldn't be willing to work with at this stage.\"I'd be up for helping clubs if they wanted me… Richmond or West Coast… but I wouldn't go back to Hawthorn after what's gone on,\" Rioli said.\"It's the only club I wouldn't put my hand up for right now.\"For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here!","pubDate":"2022-04-04 22:08:06","full_description":"There was a view among Hawthorn 's Indigenous players during the Adam Goodes booing saga that the Hawks should have made a stand against the mistreatment of the Sydney superstar, according to Caroline Wilson . The senior footy journalist on Monday night made new claims amid the Hawthorn racism scandal involving Hawks great Cyril Rioli . An article by Wilson had on Saturday been published in The Age on the back of an interview with Rioli and his wife, Shannyn, in which the pair publicly addressed a controversial remark from Hawthorn president Jeff Kennett in 2018. READ MORE: Gus, Gallen clash over NRL bias claims READ MORE: Police investigating brawling Broncos video READ MORE: Cricket legend in tears at spine-tingling farewell Rioli saw the comment as the final straw in the club's contentious relationship with its Indigenous players, leading to the former Norm Smith medallist making a shock retirement call in 2018, at the age of just 28. In Monday night's edition of Nine's Footy Classified , Wilson discussed the Hawthorn racism row and raised new claims stemming from the Hawks' clash with the Swans in round eight, 2015. It was during that game at the MCG that Goodes was booed by a significant number of match-goers for the first time, setting in motion his devastating spiral into retirement. Wilson said that several of Hawthorn's Indigenous players, including Rioli and Shaun Burgoyne , were \"very upset\" at the booing aimed at Goodes. The Footy Classified panellist also said that after the game the Indigenous Hawthorn players spoke to various leaders at the club about the booing. Wilson added that Burgoyne later in the week met then Hawthorn chief executive Stuart Fox and then Hawks president Andrew Newbold \"to talk about his very deep feelings\" regarding the Goodes scenario. Hawthorn did not put out a statement on the situation regarding Goodes despite a belief among the Hawks' Indigenous players that the club should, and in spite of the emotional impact of the events. According to Wilson, the view of Newbold at the time was the booing was not racially motivated. Footy Classified is now available as a podcast! Subscribe/follow via Apple , Spotify or Google Podcasts . \"This is just one thing that happened at Hawthorn – and other clubs didn't respond well to the booing of Adam Goodes, either – but I've always felt that Hawthorn should have taken a stand (after the match against Sydney),\" Wilson said. In an indication of the shattering impact Hawthorn's precarious relationship with its Indigenous players has had on Rioli, the 189-game icon told The Age that the Hawks were the only club he wouldn't be willing to work with at this stage. \"I'd be up for helping clubs if they wanted me… Richmond or West Coast … but I wouldn't go back to Hawthorn after what's gone on,\" Rioli said. \"It's the only club I wouldn't put my hand up for right now.\" For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here !","image_url":"https://vms-network-images-prod.s3-ap-southeast-2.amazonaws.com/2022/04/421347/pickerimage.jpg","source_id":"nine","country":["australia"],"category":["sports"],"language":"english"},{"title":"Aussie contender named Warne's replacement","link":"https://wwos.nine.com.au/cricket/the-hundred-trevor-bayliss-takes-over-shane-warnes-coaching-duties-at-london-spirit/bdf64068-7c69-45b7-82d3-ed67060d53b9","keywords":null,"creator":["wwos"],"video_url":null,"description":"He may be the next Australian men's coach, but for the time being Trevor Bayliss will take an interim role at Shane Warne's old club London Spirit.","content":"He may be the next Australian men's coach, but for the time being Trevor Bayliss will take an interim role at Shane Warne's old club London Spirit.Bayliss will take over the franchise in England's short-form competition The Hundred, in a squad boasting England white ball captain Eoin Morgan as well as Australian gun Glenn Maxwell.Warne was the franchise's inaugural coach in the 2021 season, which was won by the Hampshire-based Southern Brave.READ MORE: Gus, Gallen clash over NRL bias claimsREAD MORE: Police investigating brawling Broncos videoREAD MORE: Cricket legend in tears at spine-tingling farewell\"It is obviously very bittersweet to take the role given the circumstances. It is an honour to try and build on the work Warnie started,\" Bayliss said.\"The side knew what he and Eoin were trying to build and I hope we can do that this year.\"Bayliss has been one of the names thrown about as a potential successor to Justin Langer, after almost 20 years of collecting accolades around the world.In his first year as a coach way back in 2004, Bayliss won the Sheffield Shield with New South Wales. In the two decades since he has led Sri Lanka to a World Cup final in 2011, and won the trophy with England in 2019.In between those two international gigs, Bayliss' time at the Sydney Sixers resulted in both a Big Bash and Champions League win.He said in February that he had not been contacted by Cricket Australia in regards to the future - and current interim coach Andrew McDonald remains in the box seat to take over on a permanent basis. The 59-year-old will take over the role for an initial period of one season, with the Spirit leaving the future open.\"This is a situation none of us ever wanted to be in and all of our thoughts remain with Shane's family and what is such a heart-breaking time,\" team manager Fraser Stewart said.\"We were so lucky to work with Shane last year and we hope that the team will play in a style that he would have been proud of this summer.\"Trevor and Eoin and completely committed to that and we hope they can give our fans a reason to smile.\"For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here!","pubDate":"2022-04-04 21:46:21","full_description":"He may be the next Australian men's coach, but for the time being Trevor Bayliss will take an interim role at Shane Warne's old club London Spirit. Bayliss will take over the franchise in England's short-form competition The Hundred, in a squad boasting England white ball captain Eoin Morgan as well as Australian gun Glenn Maxwell. Warne was the franchise's inaugural coach in the 2021 season, which was won by the Hampshire-based Southern Brave. READ MORE: Gus, Gallen clash over NRL bias claims READ MORE: Police investigating brawling Broncos video READ MORE: Cricket legend in tears at spine-tingling farewell \"It is obviously very bittersweet to take the role given the circumstances. It is an honour to try and build on the work Warnie started,\" Bayliss said. \"The side knew what he and Eoin were trying to build and I hope we can do that this year.\" Bayliss has been one of the names thrown about as a potential successor to Justin Langer , after almost 20 years of collecting accolades around the world. In his first year as a coach way back in 2004, Bayliss won the Sheffield Shield with New South Wales. In the two decades since he has led Sri Lanka to a World Cup final in 2011, and won the trophy with England in 2019. In between those two international gigs, Bayliss' time at the Sydney Sixers resulted in both a Big Bash and Champions League win. He said in February that he had not been contacted by Cricket Australia in regards to the future - and current interim coach Andrew McDonald remains in the box seat to take over on a permanent basis. The 59-year-old will take over the role for an initial period of one season, with the Spirit leaving the future open. \"This is a situation none of us ever wanted to be in and all of our thoughts remain with Shane's family and what is such a heart-breaking time,\" team manager Fraser Stewart said. \"We were so lucky to work with Shane last year and we hope that the team will play in a style that he would have been proud of this summer. \"Trevor and Eoin and completely committed to that and we hope they can give our fans a reason to smile.\" For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here !","image_url":"https://vms-network-images-prod.s3-ap-southeast-2.amazonaws.com/2022/03/420431/explainer-sequence.00_00_07_08.still143.jpg","source_id":"nine","country":["australia"],"category":["sports"],"language":"english"},{"title":"Liverpool manager eyes football history","link":"https://wwos.nine.com.au/football/uefa-champions-league-2022-liverpool-coach-jurgen-klopp-eyeing-off-quadruple/a4e1ff2d-d2bc-4f9e-81ea-302e7e05981e","keywords":null,"creator":["wwos"],"video_url":null,"description":"Liverpool manager Jurgen Klopp is back in Lisbon this week for a Champions League match and he has happy memories of the place.","content":"Liverpool manager Jurgen Klopp is back in Lisbon this week for a Champions League match and he has happy memories of the place.It’s where he received the phone call that changed his life.Without a job after leaving Borussia Dortmund a few months earlier, Klopp was visiting the Portuguese capital with his family in the autumn of 2015 when his cell phone rang while he was sitting outside a coffee house. It was his agent.READ MORE: Gus, Gallen clash over NRL bias claimsREAD MORE: Police investigating brawling Broncos videoREAD MORE: Cricket legend in tears at spine-tingling farewell“It’s Liverpool,” Klopp mouthed, somewhat excitedly, to his two sons.They’d heard the rumors of Liverpool’s interest in his father. Klopp hadn’t. But he didn’t have to think twice about the offer that was forthcoming.“It was clear we’d do it. It just felt right from the first second,” Klopp said Monday.And what a perfect match Klopp and Liverpool have been.Under the German coach, the English club has regained the formidable aura it had in the 1980s. English champion in 2020, for the first time in 30 years. European champion in 2019, for the sixth time in its history. Liverpool has been club world champion, too, under Klopp.This season could yet top the it all.Watch football's biggest superstars in the UEFA Champions League with every match streaming ad free, live and on demand only on Stan Sport. Start your seven day free trial here!The Reds headed into April still in contention to win all four major trophies, a feat never previously achieved by an English team. The League Cup has already been won, while Liverpool is in the FA Cup semifinals, is one point behind first-place Manchester City in the Premier League, and plays Benfica in the Champions League quarterfinals on Tuesday.“We just want to make this season unforgettable,” Liverpool defender Virgil van Dijk said. “The things that have been going on at the moment at Liverpool are things that no one should take for granted.”And it’s all being overseen by Klopp, the passionate, determined and at times quirky face of the club. He has the chance of leading Liverpool to its greatest ever achievement — and that’s saying a lot considering its rich history of winning titles.So how does Klopp approach the next two months, when he’ll have to juggle three competitions with big games coming pretty much every three or four days?Take the schedule for the next week, for example, when Liverpool faces two games against Benfica either side of a potential Premier League title decider against City on Sunday. Then an FA Cup semifinal match against City, followed by league matches against two teams — in Manchester United and Everton — who are historically Liverpool’s biggest rivals. After that could come a pair of matches in the Champions League semifinals.Klopp’s message is simple — just enjoy it.“We have no problem with it. It’s all good,” he said. “It’s a situation we’d have dreamed of if we’d have dreamed before the season. We are here now. Let’s try to make the most of it.”Along with Villarreal, Benfica was the best draw that Liverpool could have had in the quarterfinals. Not that Klopp would ever say that.And with Liverpool having a fully fit squad to choose from — Klopp said Monday it’s the first time this has been the case since he joined 6½ years ago — no wonder the squad is in buoyant mood.“We are still in all competitions, we are playing good, we have all the chance still to win all those competitions. So just go for it,” Van Dijk said. “Let’s enjoy the ride.”For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here!","pubDate":"2022-04-04 20:24:15","full_description":"Liverpool manager Jurgen Klopp is back in Lisbon this week for a Champions League match and he has happy memories of the place. It’s where he received the phone call that changed his life. Without a job after leaving Borussia Dortmund a few months earlier, Klopp was visiting the Portuguese capital with his family in the autumn of 2015 when his cell phone rang while he was sitting outside a coffee house. It was his agent. READ MORE: Gus, Gallen clash over NRL bias claims READ MORE: Police investigating brawling Broncos video READ MORE: Cricket legend in tears at spine-tingling farewell “It’s Liverpool,” Klopp mouthed, somewhat excitedly, to his two sons. They’d heard the rumors of Liverpool’s interest in his father. Klopp hadn’t. But he didn’t have to think twice about the offer that was forthcoming. “It was clear we’d do it. It just felt right from the first second,” Klopp said Monday. And what a perfect match Klopp and Liverpool have been. Under the German coach, the English club has regained the formidable aura it had in the 1980s. English champion in 2020, for the first time in 30 years. European champion in 2019, for the sixth time in its history. Liverpool has been club world champion, too, under Klopp. This season could yet top the it all. Watch football's biggest superstars in the UEFA Champions League with every match streaming ad free, live and on demand only on Stan Sport. Start your seven day free trial here! The Reds headed into April still in contention to win all four major trophies, a feat never previously achieved by an English team. The League Cup has already been won, while Liverpool is in the FA Cup semifinals, is one point behind first-place Manchester City in the Premier League, and plays Benfica in the Champions League quarterfinals on Tuesday. “We just want to make this season unforgettable,” Liverpool defender Virgil van Dijk said. “The things that have been going on at the moment at Liverpool are things that no one should take for granted.” And it’s all being overseen by Klopp, the passionate, determined and at times quirky face of the club. He has the chance of leading Liverpool to its greatest ever achievement — and that’s saying a lot considering its rich history of winning titles. So how does Klopp approach the next two months, when he’ll have to juggle three competitions with big games coming pretty much every three or four days? Take the schedule for the next week, for example, when Liverpool faces two games against Benfica either side of a potential Premier League title decider against City on Sunday. Then an FA Cup semifinal match against City, followed by league matches against two teams — in Manchester United and Everton — who are historically Liverpool’s biggest rivals. After that could come a pair of matches in the Champions League semifinals. Klopp’s message is simple — just enjoy it. “We have no problem with it. It’s all good,” he said. “It’s a situation we’d have dreamed of if we’d have dreamed before the season. We are here now. Let’s try to make the most of it.” Along with Villarreal, Benfica was the best draw that Liverpool could have had in the quarterfinals. Not that Klopp would ever say that. And with Liverpool having a fully fit squad to choose from — Klopp said Monday it’s the first time this has been the case since he joined 6½ years ago — no wonder the squad is in buoyant mood. “We are still in all competitions, we are playing good, we have all the chance still to win all those competitions. So just go for it,” Van Dijk said. “Let’s enjoy the ride.” For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here!","image_url":"https://vms-network-images-prod.s3-ap-southeast-2.amazonaws.com/2022/02/413627/pickerimage.jpg","source_id":"nine","country":["australia"],"category":["sports"],"language":"english"},{"title":"Wankhede Stadium Virat Kohli record: Wankhede Stadium last 5 IPL matches Virat Kohli innings list","link":"https://thesportsrush.com/cricket-news-wankhede-stadium-virat-kohli-record-wankhede-stadium-last-5-ipl-matches-virat-kohli-innings-list/","keywords":["Cricket","IPL 2022","RCB","Indian Premier League","Royal Challengers Bangalore","Virat Kohli","Wankhede Stadium"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Wankhede Stadium Virat Kohli record: The former captain of Royal Challengers Bangalore will be playing his 16 T20 at the Wankhede Stadium tonight. Rajasthan Royals and Royal Challengers Bangalore will be locking horns in the 13th match of the ongoing 15th season of the Indian Premier League at the Wankhede Stadium tonight. The only other… The post Wankhede Stadium Virat Kohli record: Wankhede Stadium last 5 IPL matches Virat Kohli innings list appeared first on The SportsRush.","content":"Wankhede Stadium Virat Kohli record: The former captain of Royal Challengers Bangalore will be playing his 16 T20 at the Wankhede Stadium tonight. Rajasthan Royals and Royal Challengers Bangalore will be locking horns in the 13th match of the ongoing 15th season of the Indian Premier League at the Wankhede Stadium tonight. The only other instance of Royals and Royal Challengers facing each other in Mumbai had come a year ago when a match-winning 181-run opening partnership between Virat Kohli (72*) and Devdutt Padikkal (101*) had powered them to a thumping victory in the 17th over. ALSO READ: RR vs RCB Pitch Report at Wankhede Stadium Kohli, who will be playing an IPL match at the Wankhede Stadium as a specialist batter after 11 years, will step on to the field to play an IPL match at this venue for the 13th time across 12 seasons. Wankhede Stadium Virat Kohli record Highest run-scorer in the history of the IPL, it is no surprise that Kohli has dominated proceedings across venues and oppositions in the biggest T20 tournament across the globe. New week & new challenges. We are ready. @RCBTweets pic.twitter.com/YD263yYyVd — Virat Kohli (@imVkohli) April 4, 2022 Wankhede Stadium Virat Kohli record has seen the legendary batter scoring as many as six half-centuries in 15 T20 innings between 2008-2021. Readers must note that three out of these 15 innings have come for India where Kohli managed to cross the 50-run mark twice. Matches Runs Highest Average SR 100 50 IPL 12 480 92* 68.57 143.71 0 4 T20 15 677 92* 84.63 157.44 0 6 T20I 3 197 89* 197 205.2 0 2 ODI 5 265 121 66.25 90.44 1 1 Test 5 469 235 58.62 58.69 1 3 International Cricket 13 931 235 71.61 78.36 2 6 While Kohli’s last instance of bowling in an IPL match at the Wankhede Stadium had come way back in 2011, his only T20 wicket here had come when he had bowled during the ICC World Twenty20 2016 semi-final against West Indies. As a fielder, Kohli has grabbed five catches and caught opposition batters short of the crease thrice in Wankhede T20s. Wankhede Stadium last 5 IPL matches Virat Kohli innings list Runs Balls 4s 6s Opposition Year 8 7 1 0 Chennai Super Kings 2021 72* 47 6 3 Rajasthan Royals 2021 8 9 1 0 Mumbai Indians 2019 92* 62 7 4 Mumbai Indians 2018 20 14 0 2 Mumbai Indians 2017 The post Wankhede Stadium Virat Kohli record: Wankhede Stadium last 5 IPL matches Virat Kohli innings list appeared first on The SportsRush.","pubDate":"2022-04-04 20:14:23","full_description":"Wankhede Stadium Virat Kohli record: The former captain of Royal Challengers Bangalore will be playing his 16 T20 at the Wankhede Stadium tonight. Rajasthan Royals and Royal Challengers Bangalore will be locking horns in the 13th match of the ongoing 15th season of the Indian Premier League at the Wankhede Stadium tonight. The only other instance of Royals and Royal Challengers facing each other in Mumbai had come a year ago when a match-winning 181-run opening partnership between Virat Kohli (72*) and Devdutt Padikkal (101*) had powered them to a thumping victory in the 17th over. ALSO READ: RR vs RCB Pitch Report at Wankhede Stadium Kohli, who will be playing an IPL match at the Wankhede Stadium as a specialist batter after 11 years, will step on to the field to play an IPL match at this venue for the 13th time across 12 seasons. Highest run-scorer in the history of the IPL, it is no surprise that Kohli has dominated proceedings across venues and oppositions in the biggest T20 tournament across the globe. New week & new challenges. We are ready. @RCBTweets pic.twitter.com/YD263yYyVd — Virat Kohli (@imVkohli) April 4, 2022 Wankhede Stadium Virat Kohli record has seen the legendary batter scoring as many as six half-centuries in 15 T20 innings between 2008-2021. Readers must note that three out of these 15 innings have come for India where Kohli managed to cross the 50-run mark twice. While Kohli’s last instance of bowling in an IPL match at the Wankhede Stadium had come way back in 2011, his only T20 wicket here had come when he had bowled during the ICC World Twenty20 2016 semi-final against West Indies. As a fielder, Kohli has grabbed five catches and caught opposition batters short of the crease thrice in Wankhede T20s.","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Gaddafi Stadium Lahore T20 records: List of batting and bowling stats and records in Lahore T20I matches","link":"https://thesportsrush.com/cricket-news-gaddafi-stadium-lahore-t20-records-list-of-batting-and-bowling-stats-and-records-in-lahore-t20i-matches/","keywords":["Cricket","Australia","Australia tour of Pakistan 2022","Pakistan"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Gaddafi Stadium Lahore T20 records: Gaddafi Stadium in Lahore will be hosting a T20I after more than a year on Tuesday. A one-off T20I between Pakistan and Australia will be played at the Gaddafi Stadium tonight to put an end to what has been a historic tour. While all the visiting players played international cricket… The post Gaddafi Stadium Lahore T20 records: List of batting and bowling stats and records in Lahore T20I matches appeared first on The SportsRush.","content":"Gaddafi Stadium Lahore T20 records: Gaddafi Stadium in Lahore will be hosting a T20I after more than a year on Tuesday. A one-off T20I between Pakistan and Australia will be played at the Gaddafi Stadium tonight to put an end to what has been a historic tour. While all the visiting players played international cricket in Pakistan for the first time in the last few weeks, they will now be representing Australia in their first-ever T20I in Pakistan. Having hosted Australia in both the Test and ODI format, Lahore will now be hosting them in the shortest format in what will be a T20I played here after more than a year. Pakistan, who have played each of the 14 T20Is here in the past, have won nine and lost five to have a commendable record. As far as the first match of a bilateral T20I series in Lahore is concerned, Pakistan have won on four occasions and lost just once. The hosts also have a same 4-1 winning streak in Lahore T20Is under captain Babar Azam. Gaddafi Stadium Lahore T20 records Speaking of Azam, ‘Man of the Series‘ in the recently concluded ODI series is also the highest run-scorer in Lahore T20Is on the back of scoring 371 runs at an average and strike rate of 37.10 and 130.17 respectively. Other active batters who have done well in T20Is at this venue are Shoaib Malik (217), Mohammad Rizwan (208), Tamim Iqbal (159) and David Miller (157). Practice session ahead of the T20I:@FakharZamanLive @KhushdilShah_ and @AasifAli2018 reflect on the preparation for the T20I clash against Australia tomorrow and the mood in the camp following the ODI series win.#BoysReadyHain I #PAKvAUS pic.twitter.com/8q0IvT5HGI — Pakistan Cricket (@TheRealPCB) April 4, 2022 As far as the bowlers are concerned, Sri Lanka all-rounder Wanindu Hasaranga (8) is the highest wicket-taker in T20Is played at the Gaddafi Stadium. Other active bowlers who have excelled at this venue are Nuwan Pradeep (7), Tabraiz Shamsi (6), Dwaine Pretorius (6) and Shadab Khan (6). Talking of T20s played at the Gaddafi Stadium, the Top Five run-scorers among active players are Shoaib Malik (1,347), Mohammad Hafeez (1,131), Rizwan (671), Azam (635) and Sharjeel Khan (602). In the bowling department, the Top Five wicket-takers among active players are Wahaz Riaz (49), Shaheen Shah Afridi (29), Hafeez (27), Imad Wasim (22) and Salman Irshad (22). Highest innings totals in Lahore T20Is Score Overs Team Opposition Year 197/5 20 Pakistan World XI 2017 183/4 20 Pakistan World XI 2017 182/6 20 Sri Lanka Pakistan 2019 180/3 20 Pakistan Sri Lanka 2017 177/7 20 World XI Pakistan 2017 The post Gaddafi Stadium Lahore T20 records: List of batting and bowling stats and records in Lahore T20I matches appeared first on The SportsRush.","pubDate":"2022-04-04 19:15:18","full_description":"Gaddafi Stadium Lahore T20 records: Gaddafi Stadium in Lahore will be hosting a T20I after more than a year on Tuesday. A one-off T20I between Pakistan and Australia will be played at the Gaddafi Stadium tonight to put an end to what has been a historic tour. While all the visiting players played international cricket in Pakistan for the first time in the last few weeks, they will now be representing Australia in their first-ever T20I in Pakistan. Having hosted Australia in both the Test and ODI format, Lahore will now be hosting them in the shortest format in what will be a T20I played here after more than a year. Pakistan, who have played each of the 14 T20Is here in the past, have won nine and lost five to have a commendable record. As far as the first match of a bilateral T20I series in Lahore is concerned, Pakistan have won on four occasions and lost just once. The hosts also have a same 4-1 winning streak in Lahore T20Is under captain Babar Azam. Speaking of Azam, ‘ Man of the Series ‘ in the recently concluded ODI series is also the highest run-scorer in Lahore T20Is on the back of scoring 371 runs at an average and strike rate of 37.10 and 130.17 respectively. Other active batters who have done well in T20Is at this venue are Shoaib Malik (217), Mohammad Rizwan (208), Tamim Iqbal (159) and David Miller (157). Practice session ahead of the T20I: @FakharZamanLive @KhushdilShah_ and @AasifAli2018 reflect on the preparation for the T20I clash against Australia tomorrow and the mood in the camp following the ODI series win. #BoysReadyHain I #PAKvAUS pic.twitter.com/8q0IvT5HGI — Pakistan Cricket (@TheRealPCB) April 4, 2022 As far as the bowlers are concerned, Sri Lanka all-rounder Wanindu Hasaranga (8) is the highest wicket-taker in T20Is played at the Gaddafi Stadium. Other active bowlers who have excelled at this venue are Nuwan Pradeep (7), Tabraiz Shamsi (6), Dwaine Pretorius (6) and Shadab Khan (6). Talking of T20s played at the Gaddafi Stadium, the Top Five run-scorers among active players are Shoaib Malik (1,347), Mohammad Hafeez (1,131), Rizwan (671), Azam (635) and Sharjeel Khan (602). In the bowling department, the Top Five wicket-takers among active players are Wahaz Riaz (49), Shaheen Shah Afridi (29), Hafeez (27), Imad Wasim (22) and Salman Irshad (22).","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Tata IPL 2022 SRH vs LSG Live Update: Williamson and Co look to get off the mark on points table - Firstpost","link":"https://news.google.com/__i/rss/rd/articles/CBMisAFodHRwczovL3d3dy5maXJzdHBvc3QuY29tL2ZpcnN0Y3JpY2tldC9zcG9ydHMtbmV3cy9oaWdobGlnaHRzLXRhdGEtaXBsLTIwMjItc3JoLXZzLWxzZy1mdWxsLWNyaWNrZXQtc2NvcmUtaG9sZGVyLWF2ZXNoLXN0YXItYXMtbHVja25vdy1zdXBlci1naWFudHMtd2luLWJ5LTEyLXJ1bnMtMTA1MTM2MjEuaHRtbNIBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Tata IPL 2022 SRH vs LSG Live Update: Williamson and Co look to get off the mark on points table  FirstpostLive match blog - Super Giants vs Sunrisers 12th Match 2022 - Cricket Insights  ESPNcricinfoLive Cricket Score: SRH vs LSG, Match 12, IPL 2022 | Cricbuzz.com - Cricbuzz  CricbuzzIPL 2022, SRH vs LSG Highlights: Lucknow Super Giants win by 12 runs  Hindustan TimesWhat should SRH's top four be? What role should Holder play?  ESPNcricinfoView Full coverage on Google News","content":null,"pubDate":"2022-04-04 18:27:51","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Sunrisers Hyderabad vs Lucknow Super Giants: IPL 2022 Live Cricket Score, Live Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/sunrisers-hyderabad-vs-lucknow-super-giants-live-score-over-match-12-t20-16-20-updates-2862797","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Sunrisers Hyderabad vs Lucknow Super Giants from Dr. DY Patil Sports Academy, Navi Mumbai. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-04-04 17:43:40","full_description":"A dedicated team of experts bring you live score, live cricket score, live match update on Sports.NDTV.com . After 20.0 overs, Sunrisers Hyderabad, chasing a target of 170, are 157/9. The live updates of Sunrisers Hyderabad vs Lucknow Super Giants scorecard is also available. It is the perfect platform to follow your favourite teams in Indian Premier League 2022. Keep a track on your favourite batsmen and bowlers through Indian Premier League 2022 today match, ball by ball commentary, Sunrisers Hyderabad vs Lucknow Super Giants, Sunrisers Hyderabad vs Lucknow Super Giants live score, Sunrisers Hyderabad vs Lucknow Super Giants scorecard. Follow the excitement of the Indian Premier League 2022 on Sports.NDTV.com as you can follow live match updates and live cricket score through our platform. The captain of Lucknow, KL Rahul says that in the three games they have played so far, they have found a way to get back into the match. Adds that losing a bunch of wickets in the Powerplay is not a good sign but won't think about it too much and adds that it is still a fresh wicket and they need to learn how to adapt to the bowling early on. Mentions that they don't really plan too much as opening batters him and de Kock and both of them try to go hard at the start as they have Holder as an additional batter but they have to be smart and assess the situations as a score of about 200 might not be possible every day. About Deepak Hooda he says that he has been batting really well in the nets and he is someone who is keen to learn and is making full use of the opportunity he has been handed and hopes that he can grow more and more. Time for the presentation ceremony... Now Krunal Pandya too joins in for a quick chat. Pandya says that it feels great to contribute and see the team winning. Tells that it feels like this is his first season and he is very excited. Adds that winning or losing is a part of the game but mentions that it is heartening to see the brand of cricket they are playing and says that they are playing good aggressive cricket. Tells that he has worked a lot on his bowling and he has worked on his action to get some bounce and he wants to continue the good work. Hyderabad skipper Kane Williamson is up for a quick chat. Williamson says that their performance was much better than the last game and adds that the start with the ball in the Powerplay was amazing. Tells that if they would have broken the partnership between Hooda and Rahul a bit early then it would have been very different. Tells that it was a good wicket and 170 is a challenge but they had the firepower to chase but it could not happen today. Tells that the bowling unit did its job and it is a game of small margins and it is important to not go far ahead of themselves and keep improving. Lucknow will be rejoicing at the moment as they have truly got out of jail and have shown great character to make it two wins on the trot. Avesh Khan was prolific at the top, dismissing both the opposition openers and he then came back in the 18th over to get the big wicket of Nicholas Pooran to turn the game on its head. Krunal Pandya was pretty good too as he pulled back the scoring rate and even got a couple of wickets, including that of the set-batter Rahul Tripathi. Jason Holder then added the icing on the cake with three wickets in the final over and Bishnoi and Tye played their parts as well. The latter being a tad expensive but he bowled some difficult overs as well. All in all, an uplifting performance from Lucknow. Hyderabad, oh Hyderabad! Shades of last season in this performance and they have thrown away a match that they seemed to be in control of for most of the game. After losing a couple of wickets in the Powerplay, Rahul Tripathi regained lost momentum and put them in command. Then again wickets started tumbling and Tripathi got out trying to up the ante. A good sign though for Hyderabad will be Nicholas Pooran getting back into form and after a very controlled innings he too got out at the wrong time. In the end, the lower order just had to do a bit too much and they just got bundled over by the opposition. What a sensational comeback this has been from Lucknow and they have snatched victory off Hyderabad's hands at the death! All credit goes to the skipper KL Rahul for bringing on Avesh Khan for the 18th over and that over completely changed the momentum of the game and Jason Holder has just sealed the deal with a fabulous final over. For the third night in a row, the team batting first has been able to defend just about a par score and the tournament just keeps on getting more and more exciting with every single game. 19.6 overs (0 Run) OUT! CAUGHT! Three wickets in the over for Jason Holder and the experienced lad has delivered for his team under pressure. This is a full delivery, on off. Romario Shepherd goes for a big heave across the line. He ends up slicing the ball to point. Ayush Badoni takes the catch and Lucknow win this close encounter by 12 runs! 19.5 overs (1 Run) A full ball, on off. Malik goes for a big swing across the line. He gets a thick outside edge to third man for a single. Umran Malik walks out to bat now. 19.4 overs (0 Run) OUT! CAUGHT BEHIND! Good catch by Quinton de Kock and this wicket and no run from it seals a deal for Lucknow now! A slower full delivery, on off. Kumar goes for a big swing across the line. He completely miscues it and the ball goes high in the air behind the keeper. Quinton de Kock moves back and to his right and takes a fine catch. 14 needed from 2 balls! 19.3 overs (1 Run) Just a single! A low full toss, around off. Romario Shepherd swings hard but mistimes it to deep mid-wicket for a single. 14 needed from 3 now! 19.2 overs (1 Run) A perfect yorker, outside off. Kumar digs it out to point and takes a single. Romario Shepherd will be on strike now! This coming ball need to go for a boundary, West Indian against a West Indian! Bhuvneshwar Kumar is in next. 19.1 overs (0 Run) OUT! CAUGHT! Holder strikes in the first ball and now Lucknow will feel that they the match is in their grasp now. A very full delivery on off. Sundar looks to clear the long fence but fails to get the distance. The ball goes left of long on and Rahul runs to his left and takes a fine catch. Pressure on Hyderabad now. 16 needed from 5 balls! Jason Holder has been entrusted with the final over. Can he defend 15 runs? 18.6 overs (0 Run) Dropped! However, it is a dot ball! 16 needed now from the final over! It is very full, outside off. Romario Shepherd gets deep in his crease and hits it hard to extra-cover fielder in the ring. Ravi Bishnoi there drops it. He is usually a very good fielder but it probably went too hard. 18.5 overs (6 Runs) SIX! Ohh...big shot and this is what Romario Shepherd can do! A low full toss on middle. Romario Shepherd gets under it and launches it over long on for a biggie. 18.4 overs (1 Run) A very full delivery, outside off. Sundar goes deep in his crease and hits it to long on for a single. 18.3 overs (1 Run) A low full toss, outside off. A Slower delivery again. Romario Shepherd mistimes his hit to extra-cover for a single. 18.2 overs (0 Run) A slower wide yorker. Just a brilliant delivery and Romario Shepherd fails to get under it. Misses. 18.2 overs (1 Run) WIDE! Tries a wide yorker but ends up bowling way too wide. Romario Shepherd goes chasing for it but misses. Wide called. 18.1 overs (1 Run) A fuller delivery, outside off. A slower one at 118.2 kph. Sundar hits it to deep cover for a single. Andrew Tye (3-0-29-0) to bowl the all-important penultimate over. 17.6 overs (0 Run) What an over from Avesh Khan! He has turned this game back in the favour of Lucknow! Dot ball to end and 7 runs with two wickets. This ball is delivery on a length and outside off. Romario Shepherd throws his bat at it but misses. 26 needed now from 12 balls! 17.6 overs (1 Run) WIDE! A full delivery but it is way too wide outside off. Romario Shepherd leaves it alone. 17.5 overs (0 Run) A perfect yorker on middle. Romario Shepherd manages to dig it out. Romario Shepherd comes in to face the hat-trick ball. 17.4 overs (0 Run) OUT! CAUGHT BEHIND! Abdul Samad departs for a gloden duck and Khan is turning it on for his team. This is full and outside off. Samad goes for a big booming drive but ball catches the faint edge of his blade. It goes back to Quinton de Kock and he takes an easy catch. So two in two now for Avesh Khan and he will be on a hat-trick now! Abdul Samad walks in at number 8. 17.3 overs (0 Run) OUT! TAKEN! Avesh Khan gets his revenge and the dangerous Nicholas Pooran departs! Lucknow are still in it. Big, big wicket this! A full toss on off. Nothing delivery really and it was there to hit. However, Pooram goes a bit too hard as he swings his blade. He miscues it and the ball goes towards long off. Deepak Hooda takes an easy catch and we have a match in our hands folks! 17.2 overs (0 Run) A perfect yorker, outside off. Pooran goes chasing for it but misses. 17.1 overs (6 Runs) SIX! This is a mighty blow from Pooran! A short ball on off. Pooran picks the length quickly and pulls it over deep square leg for a maximum. It was a slower delivery but picked by Pooran there. KL Rahul has gone for the risk and has brought his strike bowler on for the 18th over. Avesh Khan (3-0-17-2) is back on. 16.6 overs (4 Runs) Another over and another boundary from the last ball of the over! It is full and outside off. Sundar goes deep in his crease and powers it through extra-cover for a boundary. 33 needed from 18 balls! 16.5 overs (1 Run) A fuller delivery on off. Pooran heaves it but mistimes it to deep mid-wicket for a single. 16.4 overs (0 Run) Good short ball but it is a brave ball with third man and fine leg inside the circle! It is short, on off. Pooran gets across and looks to pull it but misses. 16.3 overs (1 Run) Nails a yorker this time, on middle and leg. Sundar somehow manages to dig it out towards square leg for a single. 16.2 overs (1 Run) A fuller delivery on off. Pooran drives it to covers for a single again. 16.1 overs (1 Run) NOT OUT! A slower one, outside off. Sundar mistimes his drive to covers and sets off for a single. The fielder in the cover fires a direct hit at the bowler's end. There is an appeal and the umpire takes it upstairs. The replays though show that Sundar is well inside his crease. So a single in the end. Drinks! Nicholas Pooran has pulled up his socks and has put his side in a match-winning position after Hyderabad seemed to be on the downfall in the middle overs with Aiden Markram and Rahul Tripathi both getting out. Krunal Pandya got Lucknow back into the match with his two wickets but from here on, Lucknow need more wickets to stay in the match. 41 needed off 24 balls and at an asking rate of just 10 runs per over should be fairly simple for Hyderabad but we have seen stranger things happen. Also, Andrew Tye is back into the attack. He still has a couple of overs to go but has been a bit expensive so far. 15.6 overs (4 Runs) FOUR! No, he can't! Pooran spoils the over with a quality shot off the last ball. 41 needed now from 24 balls! Coming to the ball - It is a fuller delivery on off;. Pooran leans forward and creams it through extra-cover for a boundary. This is the class of Pooran and now Lucknow will be feeling some pressure. 15.5 overs (1 Run) A fuller delivery on off. Sundar drives it to long off for a single. Can Ravi Bishnoi finish off this over well now? 15.4 overs (2 Runs) A fuller delivery on middle. Sundar works it to deep mid-wicket for a couple. 15.3 overs (0 Run) Dot ball now! Lovely delivery. He pitches this googly, around off. It turns away and beats Sundar as he looks to drive it away. Quinton de Kock collects the ball and whips the bails off. There is an appeal and the leg umpire takes it upstairs. The replays show that the back leg never went out of the crease or in the air so Sundar will continue. 15.2 overs (1 Run) So two singles from the first two balls. Shorter and outside off. Pooran cuts it to deep point for a single. 15.1 overs (1 Run) A fuller delivery on middle. Sundar works it to deep square leg for a single.","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637847108113975963.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL 2022: KL Rahul completes 50 half-centuries in T20 cricket","link":"https://timesofindia.indiatimes.com/sports/cricket/ipl/top-stories/ipl-2022-kl-rahul-achieves-milestone-completes-50-half-centuries-in-t20-cricket/articleshow/90649212.cms","keywords":null,"creator":null,"video_url":null,"description":"Indian opener and Lucknow Super Giants skipper KL Rahul on Monday achieved a milestone by completing 50 half-centuries in the T20 cricket during an IPL match against Sunrisers Hyderabad at the DY Patil Stadium in Navi Mumbai.","content":null,"pubDate":"2022-04-04 17:31:46","full_description":"NEW DELHI: Indian opener and Lucknow Super Giants skipper KL Rahul on Monday achieved a milestone by completing 50 half-centuries in the T20 cricket during an IPL match against Sunrisers Hyderabad at the DY Patil Stadium in Navi Mumbai. Rahul, who became the fifth Indian to get to the milestone, has joined the likes of Virat Kohli (76), Rohit Sharma (69), Shikhar Dhawan (63) and Suresh Raina (53) in the elite list. FIFTY for the #LSG Skipper @klrahul11 👌👌Live - https://t.co/89IMzVlZVN #SRHvLSG #TATAIPL https://t.co/XFXeKhalWX — IndianPremierLeague (@IPL) 1649085602000 Rahul, who scored 68 off 50 balls, hit six fours and a six to lead his side to a respectable total of 169/7 with the help of his responsible knock. Super Heroes have weapons,@rahulkl has his bat! Captain has scored his half century in 40 balls#AbApniBaariHai… https://t.co/GLLq7bJ16o — Lucknow Super Giants (@LucknowIPL) 1649085621000 After his team lost three wickets for just 27 runs in the powerplay, Rahul found an able ally in Deepak Hooda (51 off 33 balls) and added 87 runs for the fourth wicket to revive the innings.","image_url":null,"source_id":"toi","country":["india"],"category":["sports"],"language":"english"},{"title":"RR vs RCB Head to Head in IPL history: Rajasthan Royals vs Royal Challengers Bangalore records and stats IPL 2022","link":"https://thesportsrush.com/cricket-news-rr-vs-rcb-head-to-head-in-ipl-history-rajasthan-royals-vs-royal-challengers-bangalore-records-and-stats-ipl-2022/","keywords":["Cricket","IPL 2022","Rajasthan Royals","RCB","Indian Premier League","rajasthan royals","Royal Challengers Bangalore","RR"],"creator":["Dixit Bhargav"],"video_url":null,"description":"RR vs RCB Head to Head in IPL history: The SportsRush presents for you the Head to Head statistics for IPL 2022 Match 13. The 13th match of the ongoing 15th season of the Indian Premier League will be played between Rajasthan Royals and Royal Challengers Bangalore at the Wankhede Stadium tomorrow. Having registered back-to-back… The post RR vs RCB Head to Head in IPL history: Rajasthan Royals vs Royal Challengers Bangalore records and stats IPL 2022 appeared first on The SportsRush.","content":"RR vs RCB Head to Head in IPL history: The SportsRush presents for you the Head to Head statistics for IPL 2022 Match 13. The 13th match of the ongoing 15th season of the Indian Premier League will be played between Rajasthan Royals and Royal Challengers Bangalore at the Wankhede Stadium tomorrow. Having registered back-to-back clinical victories in their first two matches, Rajasthan are at the top of the points table at this point in time. Bangalore, on the other hand, are at the seventh position on the back of winning and losing a match each thus far. Royals, who’ve played a total of 13 T20s at the iconic Wankhede Stadium, have won six and lost seven over the years. Much like their position on the points table, Royal Challengers are lacking behind here as well on the back of winning four and losing eight out of their 12 matches at this venue. ALSO READ: Will Glenn Maxwell play RR vs RCB IPL 2022 match? Having said that, Faf du Plessis and his men would be taking confidence from their past head-to-head record against this opposition which includes four successive victories in the last four matches. RR vs RCB Head to Head in IPL history Total number of matches played: 25 Matches won by RR: 10 Matches won by RCB: 12 Matches played in April: 15 (RR 6, RCB 6) Matches played in India: 19 (RR 8, RCB 8) Matches played at Wankhede Stadium: 1 (RR 0, RCB 1) RR average score against RCB: 141 RCB average score against RR: 146 Most runs for RR: 260 (Sanju Samson) Most runs for RCB: 579 (Virat Kohli) Most wickets for RR: 14 (Shreyas Gopal) Most wickets for RCB: 12 (Harshal Patel) Most catches for RR: 7 (Sanju Samson) Most catches for RCB: 4 (Virat Kohli) The last RR vs RCB match was played at the Dubai International Cricket Stadium just over six months ago. Chasing a 150-run target, RCB had registered a 7-wicket victory with 17 balls to spare primarily due to a 69-run third-wicket partnership between wicket-keeper batter Srikar Bharat (44) and all-rounder Glenn Maxwell (50*). Yuzvendra Chahal, the then RCB spinner, had picked match-winning bowling figures of 4-0-18-2. Highest wicket-taker for RCB, this will be the first instance of Chahal playing against them in the IPL. https://t.co/i83Jrdsw5d — Yuzvendra Chahal (@yuzi_chahal) April 4, 2022 NOTE: Only players part of current squads have been considered above (most runs, wickets and catches). The post RR vs RCB Head to Head in IPL history: Rajasthan Royals vs Royal Challengers Bangalore records and stats IPL 2022 appeared first on The SportsRush.","pubDate":"2022-04-04 17:18:33","full_description":"RR vs RCB Head to Head in IPL history: The SportsRush presents for you the Head to Head statistics for IPL 2022 Match 13. The 13th match of the ongoing 15th season of the Indian Premier League will be played between Rajasthan Royals and Royal Challengers Bangalore at the Wankhede Stadium tomorrow. Having registered back-to-back clinical victories in their first two matches, Rajasthan are at the top of the points table at this point in time. Bangalore, on the other hand, are at the seventh position on the back of winning and losing a match each thus far. Royals, who’ve played a total of 13 T20s at the iconic Wankhede Stadium, have won six and lost seven over the years. Much like their position on the points table, Royal Challengers are lacking behind here as well on the back of winning four and losing eight out of their 12 matches at this venue. ALSO READ: Will Glenn Maxwell play RR vs RCB IPL 2022 match? Having said that, Faf du Plessis and his men would be taking confidence from their past head-to-head record against this opposition which includes four successive victories in the last four matches. Total number of matches played: 25 Matches won by RR: 10 Matches won by RCB: 12 Matches played in April: 15 (RR 6, RCB 6) Matches played in India: 19 (RR 8, RCB 8) Matches played at Wankhede Stadium: 1 (RR 0, RCB 1) RR average score against RCB: 141 RCB average score against RR: 146 Most runs for RR: 260 (Sanju Samson) Most runs for RCB: 579 (Virat Kohli) Most wickets for RR: 14 (Shreyas Gopal) Most wickets for RCB: 12 (Harshal Patel) Most catches for RR: 7 (Sanju Samson) Most catches for RCB: 4 (Virat Kohli) The last RR vs RCB match was played at the Dubai International Cricket Stadium just over six months ago. Chasing a 150-run target, RCB had registered a 7-wicket victory with 17 balls to spare primarily due to a 69-run third-wicket partnership between wicket-keeper batter Srikar Bharat (44) and all-rounder Glenn Maxwell (50*). Yuzvendra Chahal, the then RCB spinner, had picked match-winning bowling figures of 4-0-18-2. Highest wicket-taker for RCB, this will be the first instance of Chahal playing against them in the IPL. ❤️💗 https://t.co/i83Jrdsw5d — Yuzvendra Chahal (@yuzi_chahal) April 4, 2022 NOTE: Only players part of current squads have been considered above (most runs, wickets and catches).","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"IPL 2022, SRH vs LSG Live Score: Krunal Pandya Removes Aiden Markram, SunRisers Hyderabad 3 Down In Chase Of 170 - NDTV Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMihgFodHRwczovL3Nwb3J0cy5uZHR2LmNvbS9pcGwtMjAyMi9pcGwtMjAyMi1zcmgtdnMtbHNnLWxpdmUtc2NvcmUtdXBkYXRlcy1zdW5yaXNlcnMtaHlkZXJhYmFkLXZzLWx1Y2tub3ctc3VwZXItZ2lhbnRzLWxpdmUtc2NvcmUtMjg2MTkyNtIBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"IPL 2022, SRH vs LSG Live Score: Krunal Pandya Removes Aiden Markram, SunRisers Hyderabad 3 Down In Chase Of 170  NDTV SportsLive match blog - Super Giants vs Sunrisers 12th Match 2022 - Cricket Insights  ESPNcricinfoSRH vs LSG Live Score, IPL 2022: Rahul Tripathi, Aiden Markram resurrect Sunrisers Hyderabad run chase  Times of IndiaSRH vs LSG Live: Captain KL Rahul rescues LSG with Superb fifty  InsideSportWhat should SRH's top four be? What role should Holder play?  ESPNcricinfoView Full coverage on Google News","content":null,"pubDate":"2022-04-04 16:58:32","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Sunrisers Hyderabad vs Lucknow Super Giants Live Score Ball by Ball, IPL 2022 Live Cricket Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/sunrisers-hyderabad-vs-lucknow-super-giants-live-score-over-match-12-t20-11-15-updates-2862733","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Sunrisers Hyderabad vs Lucknow Super Giants from Dr. DY Patil Sports Academy, Navi Mumbai. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-04-04 16:51:25","full_description":"Follow the Indian Premier League 2022 live cricket score on Sports.NDTV.com . After 14.5 overs, Sunrisers Hyderabad, chasing a target of 170, are 115/4. Get live score, ball by ball commentary and much more. Keep track of Indian Premier League 2022 today match between Sunrisers Hyderabad and Lucknow Super Giants. Everything related to Sunrisers Hyderabad and Lucknow Super Giants match will be available on Sports.NDTV.com . Stay updated with Sunrisers Hyderabad vs Lucknow Super Giants live score. Do check for Sunrisers Hyderabad vs Lucknow Super Giants scorecard. You can get scorecard updates, match related facts. Get quick live updates with ads, Sports.NDTV.com , which is the perfect destination for live cricket score. 14.4 overs (1 Run) 1 run. 14.3 overs (3 Runs) Back of a length, angled across off. Washington Sundar stands tall and punches it off the back foot through extra cover. Evin Lewis has to cover a lot of ground to his left from the point fence but is able to cut it off. Three taken. 14.2 overs (1 Run) A low full toss, wide of off and this is sliced away behind point for a single. Pooran wants the second run but has to settle for one. 14.1 overs (4 Runs) FOUR! Nicholas Pooran upping the ante now. Short from Holder and slanted across. It sits up nicely and Pooran pulls it well in front of square for a boundary. 13.6 overs (1 Run) Fuller and on middle, turned through mid-wicket for a single. 65 needed off 36 balls. 13.5 overs (6 Runs) SIX! Half-tracker and Nicholas Pooran needed that to get going. Outside off and shorter in length. Pooran stays in his crease and launches it over the cow corner fence for a huge hit. 13.4 overs (1 Run) Slowed up and pushed a bit wider. Sundar pushes it towards the cover region for one more. 13.3 overs (1 Run) Very full, on off. This is drilled down to long off for just another single. 13.2 overs (1 Run) Flatter delivery, around the pads. Sundar goes deep in his crease to work it leg side for a single. Washington Sundar walks in at number 6. 13.1 overs (0 Run) OUT! CAUGHT! Krunal Pandya comes back into the attack and maybe, just maybe picks up the wicket that turns the game in Lucknow's favour. Nicholas Pooran hasn't got going and hence Rahul Tripathi has to take the risk and it doesn't pay off. Speared into middle, Tripathi gets low and gets a decent connection on the slog-sweep but hits it straight down the throat of the fielder at the mid-wicket fence. Ravi Bishnoi takes a sharp catch and Hyderabad crumbling under pressure. Krunal Pandya (3-0-17-1) is back on. 12.6 overs (0 Run) Beaten again! Nicholas Pooran does seem a bit out of touch at the moment. The cut shot is one of his favorite shots but he just can't connect. A touch fuller and a bit wider, going across. Pooran misses the cut yet again. Just 4 off the over. 12.5 overs (0 Run) Quicker again, at 97.3 kph and sliding across the off stump. Pooran goes for the cut shot but gets beaten past the outside edge. 12.4 overs (1 Run) Flatter this time, on off stump. Rahul Tripathi hangs back and bunts it out towards point for one more. 12.3 overs (1 Run) Another googly, sliding across off but this time Pooran manages to drive it down the ground for a run. 12.2 overs (0 Run) Ripper! This is pushed through quicker and on off by Ravi Bishnoi and it's the googly. Nicholas Pooran strides forward but is well beaten past the outside edge. 12.2 overs (1 Run) WIDE! Bishnoi goes full again but spills it down leg. Pooran misses the sweep and a wide is called. 12.1 overs (1 Run) Full and outside off, stroked away to sweeper cover by Tripathi for a single. 11.6 overs (1 Run) Around middle and leg, worked through mid-wicket for a single. 79 needed now off 48 balls. 11.5 overs (0 Run) This time the line is tighter around off stump and Tripathi can only manage to dab it towards short third man. 11.4 overs (4 Runs) FOUR! Rahul Tripathi finds the gap and picks up a boundary to ease the nerves a bit. Good-length but wide of off stump. This is cut away late and into the gap between backward point and short third man for a boundary. 11.3 overs (2 Runs) A bit of an awkward bounce for Evin Lewis and he fumbles. Full and wide, slashed away towards deep cover for a couple of runs by Tripathi. 11.2 overs (1 Run) On the bounce! Banged in short and Nicholas Pooran almost pulls it straight into the palms of the man at long on. Single taken. 11.1 overs (0 Run) Beaten! Khan pitches it up on off stump and this one just nips away a touch after pitching. There's extra bounce on offer as well and Pooran is taken aback. 10.6 overs (0 Run) This one slides on with the arm as well, from outside off and Tripathi cuts it straight towards point. 10.5 overs (0 Run) Just drifting down the leg side. It's the one that comes on with the arm from Krunal Pandya. Rahul Tripathi looks to work it leg side but misses and gets rapped on the pads. Stifled appeal from the keeper and nothing more. 10.4 overs (1 Run) Nicholas Pooran is finally off the mark. Shorter this time, pulled away to deep mid-wicket for a single. 10.3 overs (0 Run) Dot after dot and the pressure keeps on rising. This is pushed wider and Pooran cannot get it away. 10.2 overs (0 Run) On off, Pooran defends it back onto the deck. Nicholas Pooran is the next man in. 10.1 overs (0 Run) OUT! CAUGHT! Soft dismissal for Aiden Markram and has he now given Lucknow a way back into the match? Krunal Pandya pushes it quicker and fuller, around off. Markram makes a bit of room and looks to go inside-out. Markram neither gets the elevation nor the timing and hits it straight towards the fielder at extra cover. KL Rahul just puts his hands up above his head and takes a comfortable catch. The partnership is broken and Pandya is pumped up.","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637847076755201102.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Sunrisers Hyderabad vs Lucknow Super Giants: IPL 2022 Live Cricket Score, Live Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/sunrisers-hyderabad-vs-lucknow-super-giants-live-score-over-match-12-t20-6-10-updates-2862679","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Sunrisers Hyderabad vs Lucknow Super Giants from Dr. DY Patil Sports Academy, Navi Mumbai. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-04-04 16:50:11","full_description":"A dedicated team of experts bring you live score, live cricket score, live match update on Sports.NDTV.com . After 10.1 overs, Sunrisers Hyderabad, chasing a target of 170, are 82/3. The live updates of Sunrisers Hyderabad vs Lucknow Super Giants scorecard is also available. It is the perfect platform to follow your favourite teams in Indian Premier League 2022. Keep a track on your favourite batsmen and bowlers through Indian Premier League 2022 today match, ball by ball commentary, Sunrisers Hyderabad vs Lucknow Super Giants, Sunrisers Hyderabad vs Lucknow Super Giants live score, Sunrisers Hyderabad vs Lucknow Super Giants scorecard. Follow the excitement of the Indian Premier League 2022 on Sports.NDTV.com as you can follow live match updates and live cricket score through our platform. 9.6 overs (0 Run) No run. 9.5 overs (1 Run) Goes slightly shorter, around off. Aiden Markram chops it to deep point for a single. 9.4 overs (1 Run) This is pitched outside off. Rahul Tripathi gets across and looks to scoop it. The ball hits his glove and then brushes the thigh. Goes behind the stumps to Quinton de Kock. He looks to evade and gets a glove on it. The ball goes behind him and a single is taken. 9.3 overs (1 Run) Again on the shorter side, on off. Aiden Markram cuts it to deep cover for another single. 9.2 overs (1 Run) A googly, around off. Rahul Tripathi picks it and guides it to third man for a single. 9.1 overs (1 Run) Goes shorter and flatter on off. Aiden Markram makes a bit room and cuts it to sweeper cover for a single. Ravi Bishnoi (1-0-11-0) is back on. 8.6 overs (1 Run) Around off and slightly shorter. Aiden Markram punches it to long off for a single. 8.5 overs (0 Run) Darted on middle and leg. Aiden Markram works it behind square on the leg side but finds the fielder. 8.4 overs (1 Run) A fuller delivery on middle. Rahul Tripathi pushes it to long on for a single. 8.3 overs (2 Runs) Darted on middle and leg. Rahul Tripathi works it to deep mid-wicket for a couple. 8.2 overs (6 Runs) SIX! Rahul Tripathi is finding his range now! A full delivery on leg. Rahul Tripathi sweeps and sweeps it aerially. The ball goes just over the fielder at deep backward square leg and a maximum for Rahul Tripathi. 8.1 overs (1 Run) A flatter and quicker delivery on middle. Aiden Markram works it to long on for a single. Drinks! Hyderabad might have lost both their openers but are currently cruising along. Kane Williamson and Abhishek Sharma gave them a fast start but failed to capitalize as a resurgent Avesh Khan send both of them back to the pavillion. Rahul Tripathi has just started to play his shots and if he can get set, then the bowling side will have a headache. The key for Lucknow is to pick up regular wickets which will automatically keep the scoring rate in check. 104 runs required off 72 balls and the game is nicely poised at the moment. Also, Krunal Pandya is back into the attack. 7.6 overs (4 Runs) FOUR! Poor delivery but nice timing from Rahul Tripathi! A low full toss on the pads. Rahul Tripathi just flicks it off his pads and bisects the fielders at deep square leg and deep mid-wicket with perfection. In the gap and it races away for a boundary. 104 needed now from 72 balls! 7.5 overs (1 Run) Angling into middle and leg. Aiden Markram works it to deep mid-wicket for a single. 7.4 overs (1 Run) A fullish delivery on off. Rahul Tripathi drives it to deep cover for a single. 7.3 overs (4 Runs) FOUR! Deft touch this time, lovely batting! On the shorter side again, around off. Rahul Tripathi waits for it and then guides it towards thr third man fence for a boundary. 7.2 overs (4 Runs) FOUR! Firmly hit by Rahul Tripathi! Tye goes for an effort ball, short on off. Rahul Tripathi picks the length quickly and pulls it to deep mid-wicket for a boundary. 7.1 overs (1 Run) On the shorter side, on off. Aiden Markram gets on the top of the bounce and punches it to deep cover for a single. Andrew Tye (1-0-6-0) comes from the opposite end now. 6.6 overs (1 Run) A fuller delivery, outside off. Aiden Markram drives it right of the cover fielder in the ring. Rahul there makes a good stop and keeps it to just a single. 119 needed now from 78 balls! 6.5 overs (1 Run) Slightly shorter on middle. Rahul Tripathi works it to deep mid-wicket for a single. 6.4 overs (4 Runs) FOUR! Lovely shot! This is tossed up on off. Rahul Tripathi gets under it and hits it straight down the ground for a boundary. 6.3 overs (1 Run) Shorter and around off. Aiden Markram cuts it to sweeper cover for a single. 6.2 overs (2 Runs) A flatter delivery on middle. Aiden Markram drills it down the ground but the fielder in deep cuts it off. Two runs taken. 6.2 overs (1 Run) NO BALL! This is a fuller delivery, outside off. Aiden Markram drives it to covers yet again. However, Rahul Tripathi has overstepped and Free Hit coming up now. 6.1 overs (1 Run) A fuller delivery, outside off. Rahul Tripathi drives it to sweeper cover for a single. Ravi Bishnoi is into the attack now. 5.6 overs (1 Run) Back of a length, on middle. Rahul Tripathi pulls it to fine leg for a single. After Powerplay, Hyderabad are 40/2! 5.5 overs (0 Run) Back of a length, outside off. Rahul Tripathi cuts it to backward point. 5.4 overs (0 Run) Pitched up, on off. Rahul Tripathi drives it a bit uppishly towards mid off. 5.3 overs (0 Run) Dropped! Tough chance though! A length delivery, outside off. Rahul Tripathi cuts it hard and left of backward point. Deepak Hooda over there dives but fails to pouch it as it dips on him as well. Might prove to be a costly miss! 5.2 overs (1 Run) Back of a length, outside off. Aiden Markram punches it to deep cover for a single. Aiden Markram walks in at number 4. 5.1 overs (0 Run) OUT! CAUGHT! Avesh Khan strikes again and Manish Pandey does well to take a very high catch. Both the openers are back in the hut now. It is a full ball, on off. In the slot and Sharma goes for a big hit downtown. He completely miscues it and the ball goes high in the air towards mid off. Manish Pandey waits for it as the ball is way too high and settles under it to take a fine catch. So two early wickets and Hyderabad are in early trouble again.","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637847076025564658.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Sunrisers Hyderabad vs Lucknow Super Giants Live Score Ball by Ball, IPL 2022 Live Cricket Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/sunrisers-hyderabad-vs-lucknow-super-giants-live-score-over-match-12-t20-1-5-updates-2862626","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Sunrisers Hyderabad vs Lucknow Super Giants from Dr. DY Patil Sports Academy, Navi Mumbai. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-04-04 16:01:42","full_description":"Follow the Indian Premier League 2022 live cricket score on Sports.NDTV.com . After 2.5 overs, Sunrisers Hyderabad, chasing a target of 170, are 20/0. Get live score, ball by ball commentary and much more. Keep track of Indian Premier League 2022 today match between Sunrisers Hyderabad and Lucknow Super Giants. Everything related to Sunrisers Hyderabad and Lucknow Super Giants match will be available on Sports.NDTV.com . Stay updated with Sunrisers Hyderabad vs Lucknow Super Giants live score. Do check for Sunrisers Hyderabad vs Lucknow Super Giants scorecard. You can get scorecard updates, match related facts. Get quick live updates with ads, Sports.NDTV.com , which is the perfect destination for live cricket score. 2.4 overs (6 Runs) Six! 2.3 overs (1 Run) Short and wide, cut away hard in front of point for just a single by Abhishek Sharma. 2.3 overs (1 Run) WIDE! Holder tries to go full and wide but ends up pushing it beyond the tramline. 2.2 overs (1 Run) On the pads, clipped away through square leg for one. 2.1 overs (0 Run) This is on a good length, on middle and Holder gets a bit of an extra bounce due to his height. Williamson does well to keep it down towards short mid-wicket. 1.6 overs (1 Run) A fifth single to end the over. On the pads, worked away towards deep backward square leg for a run. 1.5 overs (1 Run) One more! Very full, around leg. Sharma chips it through mid on and rotates the strike. 1.4 overs (1 Run) Flatter this time, on off. Kane Williamson eases it down to long off for a run. 1.3 overs (0 Run) On middle, Williamson makes room but is unable to get it past the man at mid on. 1.2 overs (1 Run) Nicely bowled! Slowed up, on a length and on off stump. Sharma just bunts it out on the off side and collects a single. 1.1 overs (1 Run) On a length, sliding down leg. Williamson watchfully tucks it behind square on the leg side for a single. Krunal Pandya to start from the other end. 0.6 over (4 Runs) FOUR! Fine way to end the over by Abhishek Sharma. Short, on the body and Sharma half-pulls it past the man at short fine leg for the first boundary of the innings. Six runs come off the first over. 0.5 over (1 Run) Good running! The skipper is off the mark as well. Good-length, on off and dabbed down on the off side for a quick single. 0.4 over (0 Run) Pitched up, around off and this is firmly driven towards extra cover. 0.3 over (0 Run) Everyone knows how much Williamson likes to work the ball behind point and that's brilliant field placement from KL Rahul. Outside off, edged down with soft hands past the slip cordon but there's a fine short third man to cut it off. 0.2 over (0 Run) Nicely bowled! Fuller in length, angled into off and the ball just holds its line. Kane Williamson defends it under the eye line. 0.1 over (1 Run) Abhishek Sharma is up and running straight away! Jason Holder pitches it up on middle and there is movement in the air. Sharma plays it with soft hands towards mid-wicket for a quick single.","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637847046943355409.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Sunrisers Hyderabad vs Lucknow Super Giants Live Score Ball by Ball, IPL 2022 Live Cricket Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/sunrisers-hyderabad-vs-lucknow-super-giants-live-score-over-match-12-t20-16-20-updates-2862518","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Sunrisers Hyderabad vs Lucknow Super Giants from Dr. DY Patil Sports Academy, Navi Mumbai. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-04-04 15:33:52","full_description":"A dedicated team of experts bring you live score, live cricket score, live match update on Sports.NDTV.com . After 19.1 overs, Lucknow Super Giants are 154/6. The live updates of Sunrisers Hyderabad vs Lucknow Super Giants scorecard is also available. It is the perfect platform to follow your favourite teams in Indian Premier League 2022. Keep a track on your favourite batsmen and bowlers through Indian Premier League 2022 today match, ball by ball commentary, Sunrisers Hyderabad vs Lucknow Super Giants, Sunrisers Hyderabad vs Lucknow Super Giants live score, Sunrisers Hyderabad vs Lucknow Super Giants scorecard. Follow the excitement of the Indian Premier League 2022 on Sports.NDTV.com as you can follow live match updates and live cricket score through our platform. Romario Shepherd (3-0-25-2) to bowl the final over of the innings. 18.6 overs (1 Run) 1 run. 18.5 overs (1 Run) A very full ball, on off. Holder drills it to long off for a single. Jason Holder is in next. 18.4 overs (0 Run) OUT! BOWLED! This is what T Natarajan is known for and it is amazing to see how perfectly he has mastered this art of bowling yorkers. This is a yorker on middle and leg. Pandya looks to whip it away but the ball sneaks through as it beats him and shatters the stumps. Two wickets in the over for T Natarajan. 18.3 overs (4 Runs) FOUR! T Natarajan tries a short delivery on middle. Pandya pulls and pulls it well towards deep backward square leg for a boundary. 18.2 overs (2 Runs) A low full toss on middle and leg. Pandya whips it to deep square leg for a couple. Krunal Pandya is in at number 7. 18.1 overs (0 Run) OUT! LBW! T Natarajan strikes and the death-specialist does his job! This is a very full delivery on middle. Rahul looks to paddle it but misses. The ball hits his pads and there is a big appeal. The umpire raises his finger as it looks dead straight. Rahul takes a review though. The replays roll in and the UltraEdge shows no bat involved. The Ball Tracker shows three reds. So Rahul has to walk back and this is a big wicket for Hyderabad. T Natarajan (3-0-18-0) to bowl the penultimate over of the innings. 17.6 overs (1 Run) Another yorker to end the spell! On middle and all Rahul can dot is to somehow hit it to long off for a single. 17.5 overs (1 Run) A brilliant yorker again on middle. Ayush Badoni looks to hit it away but ends up getting it towards the leg side for a single. 17.4 overs (1 Run) A low full toss on middle. Rahul stays deep in his crease and hits it to long on for a single. 17.3 overs (0 Run) Nails a yorker on off. Rahul digs it out back to the bowler. 17.2 overs (2 Runs) Dropped! Brilliant effort from Abdul Samad though! A length delivery, outside off. Rahul hits it uppishly towards deep cover. Samad runs to his right and dives. He reaches towards the ball but fails to pouch it. Two runs taken. 17.1 overs (2 Runs) A full toss on middle. Rahul works it towards cow corner and gets a couple. 16.6 overs (4 Runs) FOUR! Top shot from Ayush Badoni! 17 runs from the over! This is full, around off. Ayush Badoni gets low and sweeps it to deep square leg. The fielder in the deep runs to his left and dives to stop it but makes a mess of it. Boundary. 16.5 overs (1 Run) Spears this quicker on off. Rahul again slog-sweeps it to deep mid-wicket for a single. 16.4 overs (1 Run) A single again! A flatter delivery on middle. Ayush Badoni dances down the track and heaves it to deep backward square leg for a single. 16.3 overs (1 Run) Goes fuller on off. Rahul slog-sweeps it to deep mid-wicket for a single. 16.2 overs (6 Runs) SIX! Giving 17th over to the spinner was always a gamble and Rahul is taking on Sundar here! Sundar fires it quicker but shorter on off. Rahul hangs back and deposits it over deep mid-wicket fence. 16.1 overs (4 Runs) FOUR! Rahul starts the over with a boundary! On the shorter side on middle. Rahul pulls it to deep backward square leg for a boundary. Washington Sundar (3-0-11-2) comes back in to finish his spell. 15.6 overs (0 Run) Hits the length hard again, on off. Ayush Badoni blocks it out. 15.5 overs (0 Run) On a length, on middle. Ayush Badoni works it to mid-wicket. 15.4 overs (4 Runs) FOUR! That will be the first boundary for Ayush Badoni today! It is full and outside off. Ayush Badoni creams it through cover-point. Abdul Samad runs to his left and dives to stop it but his body touches the ropes as he tries to stop the ball. 15.3 overs (1 Run) Fifty for KL Rahul! Another captain's knock from him, his team needed him to drop anchor and he has done it perfectly. A short ball, around off. Rahul pulls it to deep mid-wicket for a single. 15.2 overs (1 Run) Lands on a length, around off. Ayush Badoni opens the face of his blade and steers it towards third man for a single. He is off the mark. Ayush Badoni is in next for Lucknow. 15.1 overs (0 Run) OUT! CAUGHT! So Romario Shepherd comes back into the attack and gets rid of dangerous Deepak Hooda! End of a very fine knock from Deepak Hooda! It is on the shorter side on off. Hooda makes room and looks to launch it over deep mid-wicket. However, he fails to get enough distance and probaly it hits the bottom of his blade. The ball goes straight to Rahul Tripathi there and he takes a good catch. Can Hyderabad now restrict the scoring rate?","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637847030240215979.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"When will Maxwell join RCB: Will Maxwell play tomorrow match between RR and RCB?","link":"https://thesportsrush.com/cricket-news-when-will-maxwell-join-rcb-will-maxwell-play-tomorrow-match-between-rr-and-rcb/","keywords":["Cricket","IPL 2022","RCB","Glenn Maxwell","Indian Premier League","rajasthan royals","Royal Challengers Bangalore","RR"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Will Maxwell play tomorrow: The Australian all-rounder is yet to play an Indian Premier League 2022 match for Royal Challengers Bangalore. With the ongoing 15th season of the Indian Premier League into its second week now, fans are keenly waiting to see Australia all-rounder Glenn Maxwell participate in the biggest T20 tournament around the world.… The post When will Maxwell join RCB: Will Maxwell play tomorrow match between RR and RCB? appeared first on The SportsRush.","content":"Will Maxwell play tomorrow: The Australian all-rounder is yet to play an Indian Premier League 2022 match for Royal Challengers Bangalore. With the ongoing 15th season of the Indian Premier League into its second week now, fans are keenly waiting to see Australia all-rounder Glenn Maxwell participate in the biggest T20 tournament around the world. Maxwell, an archetype player of this format, is always expected to allure fans towards action both inside the stadiums and those watching at home. A centrally contracted player with CA (Cricket Australia) like Pat Cummins and David Warner, to name a few, Maxwell was always going to take part in what will be his 10th IPL season after April 5. However, unlike Cummins or Warner or other Australian players, Maxwell was neither playing in Pakistan nor rested for all this while. One of the three players retained by Royal Challengers ahead of the mega auction held earlier this year, Maxwell was occupied due to his marriage with long-time girlfriend Vini Raman. Will Maxwell play tomorrow match between RR and RCB? Maxwell, who had entered IPL’s bio-bubble in Mumbai on Friday, has finished his mandatory three-day quarantine period. Having joined the squad, it will be interesting to see if Maxwell is allowed to play the Royal Challengers Bangalore vs Rajasthan Royals match at the Wankhede Stadium tomorrow. Ability-wise, there is no reason why Maxwell shouldn’t play this match. However, an exception will have to be made on the part of CA to let him play on April 5. Some relationships will always remain special! @Gmaxi_32 @yuzi_chahal #PlayBold #WeAreChallengers #IPL2022 #Mission2022 #RCB #ನಮ್ಮRCB pic.twitter.com/UGtEvrES0v — Royal Challengers Bangalore (@RCBTweets) April 4, 2022 Maxwell, who was bought for a whopping INR 14.25 crore by Bangalore before IPL 2021, had justified his price by being the highest scorer for them and fifth-highest overall last season scoring 513 runs at an average and strike rate of 42.75 and 144.10 respectively including six half-centuries (three times his total number of half-centuries in last five IPL seasons). Royal Challengers, who retained Maxwell for INR 11 crore before this season, can accommodate him into their Playing XI easily in place of West Indies all-rounder Sherfane Rutherford. The post When will Maxwell join RCB: Will Maxwell play tomorrow match between RR and RCB? appeared first on The SportsRush.","pubDate":"2022-04-04 15:16:08","full_description":"Will Maxwell play tomorrow: The Australian all-rounder is yet to play an Indian Premier League 2022 match for Royal Challengers Bangalore. With the ongoing 15th season of the Indian Premier League into its second week now, fans are keenly waiting to see Australia all-rounder Glenn Maxwell participate in the biggest T20 tournament around the world. Maxwell, an archetype player of this format, is always expected to allure fans towards action both inside the stadiums and those watching at home. A centrally contracted player with CA (Cricket Australia) like Pat Cummins and David Warner, to name a few, Maxwell was always going to take part in what will be his 10th IPL season after April 5. However, unlike Cummins or Warner or other Australian players, Maxwell was neither playing in Pakistan nor rested for all this while. One of the three players retained by Royal Challengers ahead of the mega auction held earlier this year, Maxwell was occupied due to his marriage with long-time girlfriend Vini Raman . Maxwell, who had entered IPL’s bio-bubble in Mumbai on Friday, has finished his mandatory three-day quarantine period. Having joined the squad, it will be interesting to see if Maxwell is allowed to play the Royal Challengers Bangalore vs Rajasthan Royals match at the Wankhede Stadium tomorrow. Ability-wise, there is no reason why Maxwell shouldn’t play this match. However, an exception will have to be made on the part of CA to let him play on April 5. Some relationships will always remain special! ❤️ @Gmaxi_32 @yuzi_chahal #PlayBold #WeAreChallengers #IPL2022 #Mission2022 #RCB #ನಮ್ಮRCB pic.twitter.com/UGtEvrES0v — Royal Challengers Bangalore (@RCBTweets) April 4, 2022 Maxwell, who was bought for a whopping INR 14.25 crore by Bangalore before IPL 2021, had justified his price by being the highest scorer for them and fifth-highest overall last season scoring 513 runs at an average and strike rate of 42.75 and 144.10 respectively including six half-centuries (three times his total number of half-centuries in last five IPL seasons). Royal Challengers, who retained Maxwell for INR 11 crore before this season, can accommodate him into their Playing XI easily in place of West Indies all-rounder Sherfane Rutherford.","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Sunrisers Hyderabad vs Lucknow Super Giants: IPL 2022 Live Cricket Score, Live Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/sunrisers-hyderabad-vs-lucknow-super-giants-live-score-over-match-12-t20-11-15-updates-2862441","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Sunrisers Hyderabad vs Lucknow Super Giants from Dr. DY Patil Sports Academy, Navi Mumbai. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-04-04 15:06:01","full_description":"A dedicated team of experts bring you live score, live cricket score, live match update on Sports.NDTV.com . After 14.0 overs, Lucknow Super Giants are 108/3. The live updates of Sunrisers Hyderabad vs Lucknow Super Giants scorecard is also available. It is the perfect platform to follow your favourite teams in Indian Premier League 2022. Keep a track on your favourite batsmen and bowlers through Indian Premier League 2022 today match, ball by ball commentary, Sunrisers Hyderabad vs Lucknow Super Giants, Sunrisers Hyderabad vs Lucknow Super Giants live score, Sunrisers Hyderabad vs Lucknow Super Giants scorecard. Follow the excitement of the Indian Premier League 2022 on Sports.NDTV.com as you can follow live match updates and live cricket score through our platform. DRINKS! Lucknow have made a strong comeback after losing three early wickets and now have a platform to launch in the final six overs. KL Rahul has gone about his business in his usual clinical way but it has been the innings of Deepak Hooda that has provided them the impetus here. 13.6 overs (6 Runs) SIX! Pace is a good thing but when the line is not right, it can be used against you and Deepak Hooda is doing just that. On the hips and whipped away over the fine leg fence for a biggie. Umran Malik is proving to be really expensive here. 13.5 overs (0 Run) Big swing and a miss! Good-length, around off and Hooda throws the kitchen sink at it. He gets beaten for pace though. 13.4 overs (4 Runs) FOUR! The quicker the ball is, the quicker it's racing away to the fence. Length ball, at 152.4 kph. Deepak Hooda just makes room and swings through the line of the ball. He doesn't get a good connection but the ball skips across the turf and past mid on for a boundary. 13.3 overs (1 Run) Quick single this time. Angled into middle and leg, Rahul looks to heave it leg side but ends up getting an inside edge onto the pads and the ball goes towards short leg. They scamper through for a single. 13.2 overs (1 Run) Around 149 clicks, full again and close to the off stump. Hooda squeezes it out towards deep cover for one. 13.1 overs (4 Runs) FOUR! Carved away! Deepak Hooda seems to have Umran Malik's number. Full and wide at 150.1 kph. Hooda just goes over point and the ball ends up in the fence in a flash. Will we see another bowling change here? Yes, Umran Malik is back on. He has gone for 23 runs in his two overs so far. 12.6 overs (2 Runs) Nice bit of timing from Rahul. Length, around off and punched on the up to the right of the man at sweeper cover for two more. 12.5 overs (2 Runs) Bhuvi looks for the yorker tailing into the toes but serves a low full toss. KL Rahul clips it towards wide long on and picks up a couple of runs. 12.4 overs (1 Run) Around the top of off, Hooda hits it on the up and gets it down to long on for another single. 12.3 overs (1 Run) Just another single. Outside off, Rahul taps it towards deep cover and rotates the strike. 12.2 overs (1 Run) Full and straight, flicked away towards deep square leg for a run. 12.1 overs (0 Run) A slower length ball on off. Hooda looks to go big downtown but gets it off the inner half of the bat towards mid-wicket. 11.6 overs (0 Run) Nearly carried back to the bowler! Pitched up, around off. Rahul pushes it uppishly back towards the bowler but luckily for him, the ball falls short. 11.5 overs (1 Run) Shepherd sees Hooda advancing and bowls it slower again. Hooda can only push it towards wide long off for a single. 11.4 overs (0 Run) No wide given and rightly so. Deepak Hooda shuffles across and Shepherd bowls it slower and down the leg side. Hooda misses the lap and the ball goes a few inches past the leg stump. 11.3 overs (1 Run) Just short of a length, Rahul pulls it down to long on for a single. 11.2 overs (1 Run) Shepherd goes fuller and a bit slower. Hooda pushes it down to long on for one. 11.1 overs (6 Runs) SIX! Deepak Hooda on the charge here! Romario Shepherd comes back into the attack and tries to attack the pads, Hooda moves leg side and swings it high and handsome over the square leg fence for a biggie. The 50 partnership is also up between these two. Romario Shepherd is back on. He went for 10 runs in his first over and got the wicket of Manish Pandey. 10.6 overs (0 Run) This is bowled on middle, Rahul punches it to extra cover and calls for 'No' straightaway. Lucknow slowly but surely growing into the game. 10.5 overs (1 Run) Length, on the fifth stump line. Hooda nudges it through covers for a run. 10.4 overs (2 Runs) Full and wide, squeezed away to the left of the fielder at deep backward point and Deepak Hooda picks up a couple of runs. 10.3 overs (1 Run) Slower one, slanted into middle. Rahul bunts it down to long on and collects a single. 10.2 overs (2 Runs) Two more! Angling into middle and leg, just dabbed down in front of square on the leg side for an easy brace. 10.1 overs (2 Runs) Natarajan comes from over the wicket and bowls it on a length outside off. Rahul hangs back and slaps it towards deep point for a single.","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637847013528052973.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Glenn Maxwell IPL 2022 availability: When will Glenn Maxwell join RCB?","link":"https://thesportsrush.com/cricket-news-glenn-maxwell-ipl-2022-availability-when-will-glenn-maxwell-join-rcb/","keywords":["Cricket","IPL 2022","RCB","Glenn Maxwell","Indian Premier League","IPL","Royal Challengers Bangalore"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Glenn Maxwell IPL 2022 availability: The star Australian batter did not feature in both the initial matches for Royal Challengers Bangalore. When the 15th season of the Indian Premier League (IPL) commenced on March 26, most of the franchises had to begin their season campaign without majority of their overseas picks as they were busy… The post Glenn Maxwell IPL 2022 availability: When will Glenn Maxwell join RCB? appeared first on The SportsRush.","content":"Glenn Maxwell IPL 2022 availability: The star Australian batter did not feature in both the initial matches for Royal Challengers Bangalore. When the 15th season of the Indian Premier League (IPL) commenced on March 26, most of the franchises had to begin their season campaign without majority of their overseas picks as they were busy representing their respective national sides. With each of the ten franchises (barring SRH) having played at least two matches in the season so far, a majority players from England, West Indies, South Africa, and Bangladesh are now available for selection in the playing 11 for their teams. However, teams would still have to wait for a few players from Australia to mark their availability in IPL 2022. Glenn Maxwell IPL 2022 availability Australia’s flamboyant batter, and one of the three retained players for the Royal Challengers Bangalore (RCB) this season, Glenn Maxwell, recently tied the knot with his Indian-origin girlfriend last week in Melbourne. Maxwell is not only a match winner with the bat, but his off-spinning ability is a vital asset for any franchise, especially against a batting order laden with left-handers. As far as his availability for the ongoing season is concerned, the 33-year-old is set to miss RCB’s third match of the ongoing season against Rajasthan Royals (RR) on April 5 as well. This is due to Cricket Australia’s (CA) decision to hand the No Objection Certificates (for participating in the IPL) to its contracted players only on April 6 – a day after Australia plays its last match of the ongoing tour of Pakistan, which ends with a lone T20I against Pakistan on April 5. Hence, Maxwell (and other annually contracted Aussie players including Pat Cummins (KKR), David Warner (DC), and Mitchell Marsh (DC)) would only be available from RCB’s fourth match of the league against Mumbai Indians on April 9. To answer all the million comments and tweets asking us “When is Maxwell arriving?” Extremely excited to have you here, @Gmaxi_32! Let the show begin! #PlayBold #WeAreChallengers #IPL2022 #Mission2022 #RCB #ನಮ್ಮRCB pic.twitter.com/wB41EOJNP9 — Royal Challengers Bangalore (@RCBTweets) April 1, 2022 As per the latest report, the Victorian batter is out of quarantine and has started his practice session for his franchise. Yuzi Maxi. @yuzi_chahal @Gmaxi_32 pic.twitter.com/wiDYk1Kas2 — Rajasthan Royals (@rajasthanroyals) April 4, 2022 For more Cricket-related news, click here. The post Glenn Maxwell IPL 2022 availability: When will Glenn Maxwell join RCB? appeared first on The SportsRush.","pubDate":"2022-04-04 14:46:17","full_description":"Glenn Maxwell IPL 2022 availability: The star Australian batter did not feature in both the initial matches for Royal Challengers Bangalore. When the 15th season of the Indian Premier League (IPL) commenced on March 26, most of the franchises had to begin their season campaign without majority of their overseas picks as they were busy representing their respective national sides. With each of the ten franchises (barring SRH) having played at least two matches in the season so far, a majority players from England, West Indies, South Africa, and Bangladesh are now available for selection in the playing 11 for their teams. However, teams would still have to wait for a few players from Australia to mark their availability in IPL 2022. Australia’s flamboyant batter, and one of the three retained players for the Royal Challengers Bangalore (RCB) this season, Glenn Maxwell, recently tied the knot with his Indian-origin girlfriend last week in Melbourne. Maxwell is not only a match winner with the bat, but his off-spinning ability is a vital asset for any franchise, especially against a batting order laden with left-handers. As far as his availability for the ongoing season is concerned, the 33-year-old is set to miss RCB’s third match of the ongoing season against Rajasthan Royals (RR) on April 5 as well. This is due to Cricket Australia’s (CA) decision to hand the No Objection Certificates (for participating in the IPL) to its contracted players only on April 6 – a day after Australia plays its last match of the ongoing tour of Pakistan, which ends with a lone T20I against Pakistan on April 5. Hence, Maxwell (and other annually contracted Aussie players including Pat Cummins (KKR), David Warner (DC), and Mitchell Marsh (DC)) would only be available from RCB’s fourth match of the league against Mumbai Indians on April 9. To answer all the million comments and tweets asking us “When is Maxwell arriving?” 😎 Extremely excited to have you here, @Gmaxi_32 ! Let the show begin! 🤩 #PlayBold #WeAreChallengers #IPL2022 #Mission2022 #RCB #ನಮ್ಮRCB pic.twitter.com/wB41EOJNP9 — Royal Challengers Bangalore (@RCBTweets) April 1, 2022 As per the latest report, the Victorian batter is out of quarantine and has started his practice session for his franchise. Yuzi 🤗 Maxi. 💗❤️ @yuzi_chahal @Gmaxi_32 pic.twitter.com/wiDYk1Kas2 — Rajasthan Royals (@rajasthanroyals) April 4, 2022 For more Cricket-related news, click here .","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"IPL 2022, SRH vs LSG Live Score: SunRisers Hyderabad Bowlers Dominate, KL Rahul Key For Lucknow Super Giants - NDTV Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMihgFodHRwczovL3Nwb3J0cy5uZHR2LmNvbS9pcGwtMjAyMi9pcGwtMjAyMi1zcmgtdnMtbHNnLWxpdmUtc2NvcmUtdXBkYXRlcy1zdW5yaXNlcnMtaHlkZXJhYmFkLXZzLWx1Y2tub3ctc3VwZXItZ2lhbnRzLWxpdmUtc2NvcmUtMjg2MTkyNtIBjAFodHRwczovL3Nwb3J0cy5uZHR2LmNvbS9pcGwtMjAyMi9pcGwtMjAyMi1zcmgtdnMtbHNnLWxpdmUtc2NvcmUtdXBkYXRlcy1zdW5yaXNlcnMtaHlkZXJhYmFkLXZzLWx1Y2tub3ctc3VwZXItZ2lhbnRzLWxpdmUtc2NvcmUtMjg2MTkyNi9hbXAvMQ?oc=5","keywords":null,"creator":null,"video_url":null,"description":"IPL 2022, SRH vs LSG Live Score: SunRisers Hyderabad Bowlers Dominate, KL Rahul Key For Lucknow Super Giants  NDTV SportsMatch Preview - Super Giants vs Sunrisers, Indian Premier League 2022, 12th Match  ESPNcricinfoSunrisers Hyderabad vs Lucknow Super Giants Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update- Tata IPL 2022  Cricket AddictorSRH vs LSG Live: In-form batter Aiden Markram sends WARNING to LSG  InsideSportFantasy XI - Super Giants vs Sunrisers 12th Match 2022 - Cricket Insights  ESPNcricinfoView Full coverage on Google News","content":null,"pubDate":"2022-04-04 14:44:28","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Sunrisers Hyderabad vs Lucknow Super Giants Live Score Ball by Ball, IPL 2022 Live Cricket Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/sunrisers-hyderabad-vs-lucknow-super-giants-live-score-over-match-12-t20-6-10-updates-2862377","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Sunrisers Hyderabad vs Lucknow Super Giants from Dr. DY Patil Sports Academy, Navi Mumbai. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-04-04 14:42:09","full_description":"Follow the Indian Premier League 2022 live cricket score on Sports.NDTV.com . After 10.2 overs, Lucknow Super Giants are 72/3. Get live score, ball by ball commentary and much more. Keep track of Indian Premier League 2022 today match between Sunrisers Hyderabad and Lucknow Super Giants. Everything related to Sunrisers Hyderabad and Lucknow Super Giants match will be available on Sports.NDTV.com . Stay updated with Sunrisers Hyderabad vs Lucknow Super Giants live score. Do check for Sunrisers Hyderabad vs Lucknow Super Giants scorecard. You can get scorecard updates, match related facts. Get quick live updates with ads, Sports.NDTV.com , which is the perfect destination for live cricket score. 9.6 overs (6 Runs) SIX! Ohh... Bhuvneshwar Kumar got his hand to it but the ball just goes over the fence in the end! 9.5 overs (1 Run) A low full toss on middle. Rahul drives it to long on for a single. 9.4 overs (4 Runs) FOUR! Third boundary of the over! Lands on a length, around off. Rahul smashes it towards deep point for a boundary. 9.3 overs (4 Runs) FOUR! Lovely shot! This is on the shorter side, around off at 151.8 kph. Rahul sways away a bit and just opens the face of his blade. Uses the pace well and it races away towards the third man fence. 9.2 overs (1 Run) A fullish delivery, around off at 151.2 kph. Hooda drives it to sweeper cover for a single. 9.1 overs (4 Runs) FOUR! Good shot! Malik tries a yorker but it ends up being a low full toss on middle. Hooda makes room and creams it through covers for a boundary. Drinks! Hyderabad have come out today with an aggressive intent and so far it has worked wonders for them. Kane Williamson decided to use Washington Sundar right from the second over and he has uprooted two hard-hitting left-handers. KL Rahul has his work cut out in front of him and he will now look to stitch a partnership with Deepak Hooda to give Lucknow a platform to launch at the death. A couple of wickets in the middle overs for Hyderabad and they will be right on top of proceedings. Also, Umran Malik is brought back into the attack. 8.6 overs (0 Run) Good start from T Natarajan! Lands on a length and it is angled across Rahul. He looks to push it away but gets beaten. 8.5 overs (1 Run) Goes fuller and it's a slower delivery at 121.6 kph. Hooda works it to long on for a single. 8.4 overs (2 Runs) Slightly on the shorter side, outside off. Hooda punches it to deep extra-cover for a couple. 8.3 overs (1 Run) Another single! On a length, on middle. Rahul pushes it to long off for a single. 8.2 overs (1 Run) A fullish delivery, around off. Hooda drives it to deep cover for a single. 8.1 overs (0 Run) Lands on a length, on middle. Hooda works it to mid-wicket. 7.6 overs (1 Run) Slightly shorter and provides the width. Hooda cuts it to sweeper cover for just a single. 7.5 overs (1 Run) Goes flatter on off. Rahul knocks it down to long on for a single. 7.4 overs (1 Run) It is shorter on off. Hooda pulls it to long on for a single. 7.3 overs (0 Run) Very full and quicker on off. Hooda digs it out to point. 7.2 overs (1 Run) Goes fuller on off. Rahul drives it to long off for a single. 7.1 overs (4 Runs) FOUR! A gift from the bowler and Rahul is not going to miss out on that. A full toss on middle. Rahul smashes it straight down the ground for a boundary. Abdul Samad comes into the attack now. 6.6 overs (1 Run) This time a full ball, on middle. Rahul works it to mid-wicket. Good start from the pacer! 6.5 overs (0 Run) It is shorter and outside off. The pace if around 145 kph this time. Rahul looks to guide it away but misses. 6.4 overs (0 Run) 6.4: Umran Malik to KL Rahul, Goes fuller on off. Rahul drives it back to the bowler. 6.3 overs (1 Run) Goes fuller, outside off. Hooda drives but gets a thick outside edge. The ball goes just away from the diving point fielder for a single towards third man. A single taken. 6.2 overs (0 Run) Beats him for pace! Lands on a length and angling into middle and leg at 147.5 kph. Hooda looks to work it towards the leg side but misses. The ball hits him high on the pads and s stifled appeal follows but going down leg and too high. 6.1 overs (1 Run) Back of a length, outside off at 148 kph. Rahul punches it off the outside half of his blade to thired man for a single. 5.6 overs (1 Run) A low full toss on off. Rahul drives it to long on for a single. Good Powerplay for Hyderabad. Lucknow are 32/3 after the Powerplay. 5.5 overs (1 Run) Shorter and flatter on middle. Hooda punches it to long on for a single. 5.4 overs (1 Run) Pushed quicker again on off. Rahul turns it to mid-wicket for a single. 5.3 overs (1 Run) Goes fuller and quicker on off. Hooda drives it to long on for a single. 5.2 overs (1 Run) Goes slower and fuller on middle. Rahul works it to square leg for a single. 5.1 overs (0 Run) Sundar serves it flatter and slightly shorter on off. Rahul chops it to cover-point.","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637846999210349616.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"How a chance encounter with Raina changed 12-year-old Tilak Varma's mindset","link":"https://timesofindia.indiatimes.com/sports/cricket/ipl/top-stories/ipl-2022-how-a-chance-encounter-with-suresh-raina-changed-12-year-old-tilak-varmas-mindset/articleshow/90646413.cms","keywords":null,"creator":null,"video_url":null,"description":"Suresh Raina most certainly won't remember the chance encounter he had with a little known Hyderabad cricket coach Salam Bayash or the 12-year-old kid, who had accompanied him in tow during that evening at the HCA Stadium in Uppal back in 2014.","content":null,"pubDate":"2022-04-04 14:05:16","full_description":"NAVI MUMBAI: Suresh Raina most certainly won't remember the chance encounter he had with a little known Hyderabad cricket coach Salam Bayash or the 12-year-old kid, who had accompanied him in tow during that evening at the HCA Stadium in Uppal back in 2014. Chennai Super Kings were pitted against Sunrisers Hyderabad on the very next day and little did 'Chinna Thala' know that his five-minute interaction and a photo with a then 12-year-old Namboori Thakur Tilak Varma will have such an impact on 12-year-old's impressionable mind. Eight year hence, the now 20-year-old left-hander's lucid style of strokeplay must have brought a wide grin on Raina's face while watching him reverse sweep Ravichandran Ashwin for a six. \"I had a friend of mine, who was a local manager. I took his help to procure permission to watch the practice and had little Tilak accompany,\" it seemed as if it happened yesterday in the manner Bayash recollected events of that day. \"I distinctly remember a wide-eyed Tilak just watching Suresh Raina's batting with awe. He stood transfixed and watched every shot played by Raina. Then we clicked pictures with him and I strongly feel that the \"special meeting\" with Raina was enough for Tilak to decide that he wanted to become a cricketer,\" the childhood coach said about his ward, who has become the find of Mumbai Indians . MI lost to Rajasthan Royals but Tilak's 61 had garnered a lot of attention, especially after head coach Mahela Jayawardena showered him with glowing praise. Son of an electrician, Varma believes that the Rs 1.7 crore contract will help him provide a better life for his parents, who have sacrificed a lot to see their son realise his dream. But Bayash always knew that Varma was special and did play a huge role in shaping his career from age-group cricket to U-19 and now sending a near-finished product to Mumbai Indians. \"Had my coach and parents not backed me, I wouldn't have come so far. I dedicate this innings to all of them,\" the southpaw had said moments after his whirlwind innings. Bayash recalled how Varma's batting in a tennis ball match at a local ground caught his attention. \"I saw him and felt that the kid was doing well. Then I called his parents and persuaded them to take the kid to my academy. He had issues while commuting, so he used to accompany me for practice. We used to cover 40 km one way,\" Bayash remembered. Varma is a resident of Salala Barkas area in Belapur locality and travelled all the way to Lingapally to practice at the Legala cricket academy. He studied at the Cresent Model English school. \"I had taken special permission from school authorities and often he would have lunch at the academy before starting training in the afternoon session. While Tilak's family at that point had hardships, I must give credit to his parents, who were very supportive with his career choice,\" Bayash said. Bayash is elated that Varma was roped in by a champion outfit like MI where he can learn a lot from legends. \"Mumbai Indians, Chennai Super Kings, Kolkata Knight Riders are good teams and so is Punjab Kings, which gives a lot of opportunities to youngsters and it's luck that he landed in a champion team like MI. Which coach won't be proud if his student plays for MI,\" Bayash said. But amidst all these Bayash' real happiness lies somewhere else. When he played cricket, Bayash's only wish was to meet Sachin Tendulkar once in his lifetime, talk to him and seek his blessings. What he couldn't achieve, his favourite ward has done it. \"When I was playing, I nurtured only one dream to meet and greet Tendulkar. I am more pleased that my student is now meeting him and taking his tips,\" he signed off.","image_url":null,"source_id":"toi","country":["india"],"category":["sports"],"language":"english"},{"title":"Ash Barty retirement made new world number one Iga Świątek cry for 40 minutes - ABC News","link":"https://news.google.com/__i/rss/rd/articles/CBMicGh0dHBzOi8vd3d3LmFiYy5uZXQuYXUvbmV3cy8yMDIyLTA0LTA1L2FzaC1iYXJ0eS1yZXRpcmVtZW50LW1hZGUtaWdhLXN3aWF0ZWstY3J5LWZvci00MC1taW51dGVzLXRlbm5pcy8xMDA5NjU3ODTSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Ash Barty retirement made new world number one Iga Świątek cry for 40 minutes  ABC NewsTennis, cricket and now golf: Ashleigh Barty shows her sporting versatility as she bags tournament in Brisbane  SportskeedaAsh Barty wins £17 in a golf tournament in Brisbane following her retirement from tennis last month  Eurosport COMAsh Barty stokes rumours with first win since shock retirement  Fox SportsJustine Henin explains why Iga Swiatek could thrive as new No. 1  Tennis World USAView Full coverage on Google News","content":null,"pubDate":"2022-04-04 14:00:53","image_url":null,"source_id":"google","country":["australia"],"category":["sports"],"language":"english"},{"title":"Match Preview - Royals vs RCB, Indian Premier League 2022, 13th Match - ESPNcricinfo","link":"https://news.google.com/__i/rss/rd/articles/CBMilwFodHRwczovL3d3dy5lc3BuY3JpY2luZm8uY29tL3Nlcmllcy9pbmRpYW4tcHJlbWllci1sZWFndWUtMjAyMi0xMjk4NDIzL3JhamFzdGhhbi1yb3lhbHMtdnMtcm95YWwtY2hhbGxlbmdlcnMtYmFuZ2Fsb3JlLTEzdGgtbWF0Y2gtMTMwNDA1OS9tYXRjaC1wcmV2aWV30gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Match Preview - Royals vs RCB, Indian Premier League 2022, 13th Match  ESPNcricinfoCan RCB stall Rajasthan's early momentum? | Cricbuzz.com - Cricbuzz  CricbuzzRR v RCB: Everything you need to know | IPL 2022 | 12th Man TV  Royal Challengers BangaloreIPL 2022: Predicted XIs For RCB vs RR  The Cricket LoungeIPL 2022: Match 13, RR vs RCB Match Prediction – Who will win today’s IPL match between RR and RCB?  CricTrackerView Full coverage on Google News","content":null,"pubDate":"2022-04-04 13:51:03","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Sunrisers Hyderabad vs Lucknow Super Giants: IPL 2022 Live Cricket Score, Live Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/sunrisers-hyderabad-vs-lucknow-super-giants-live-score-over-match-12-t20-1-5-updates-2862235","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Sunrisers Hyderabad vs Lucknow Super Giants from Dr. DY Patil Sports Academy, Navi Mumbai. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-04-04 13:44:08","full_description":"Follow the Indian Premier League 2022 live cricket score on Sports.NDTV.com . After 1.5 overs, Lucknow Super Giants are 8/1. Get live score, ball by ball commentary and much more. Keep track of Indian Premier League 2022 today match between Sunrisers Hyderabad and Lucknow Super Giants. Everything related to Sunrisers Hyderabad and Lucknow Super Giants match will be available on Sports.NDTV.com . Stay updated with Sunrisers Hyderabad vs Lucknow Super Giants live score. Do check for Sunrisers Hyderabad vs Lucknow Super Giants scorecard. You can get scorecard updates, match related facts. Get quick live updates with ads, Sports.NDTV.com , which is the perfect destination for live cricket score. 1.5 overs (0 Run) No run. Evin Lewis walks in at number 3. 1.4 overs (0 Run) OUT! TAKEN! Skipper Kane Williamson takes a brilliant catch and the move to bring the off-spinner at the start has worked wonders for Hyderabad. This is flighted from 'round the wicket and bowled on middle. Quinton de Kock makes a bit of room and looks to cover drive. He does so but uppishly and times it well. Williamson though springs to his right at covers and pouches it with both hands. De Kock's weakness against the off-spin has been exploited and Sundar has given his side the perfect start. 1.3 overs (0 Run) Sundar gives it more air and drifts it into leg stump. De Kock pushes it back to the bowler. 1.2 overs (1 Run) Straightaway now Sundar pulls back his length. Shorter, on middle and leg. Rahul works it in front of square on the leg side for one. 1.1 overs (4 Runs) FOUR! Lovely shot from KL Rahul. Washington Sundar starts off with an overpitched delivery on middle. Rahul makes a bit of room and creams it through extra cover to bring up the first boundary of the match. Washington Sundar to start from the other end. 0.6 over (1 Run) Tidy start from Bhuvneshwar Kumar, just 3 runs off it. A bit wider this time and Rahul slashes it hard towards the right of third man for a run. 0.5 over (0 Run) A length ball, slanted into middle and leg. Rahul nudges it towards square leg. 0.4 over (1 Run) Bhuvi drifts onto the pads and de Kock is able to get off the mark. Sliding down leg, tucked away to fine leg for a single. 0.3 over (0 Run) Nicely timed but for no run. Full and wide, Quinton de Kock strokes it to the man at extra cover. 0.2 over (1 Run) KL Rahul and Lucknow are underway! Around off, pushed gently towards covers for a quick single. 0.1 over (0 Run) Bhuvneshwar Kumar starts off with a fullish delivery, on off. There's a bit of away shape on offer and KL Rahul gets solidly behind it to keep it out. We are all set to begin! The umpires make their way into the middle. Hyderabad players are in the huddle and they now disperse to take their respective postions. KL Rahul and Quinton de Kock are the openers for Lucknow. Bhuvneshwar Kumar to start with the ball for Hyderabad. KL Rahul will be on strike. Here we go... So Hyderabad going with an unchanged team and it will be interesting to see if they will make any changes to the batting order, with the likes of Aiden Markram more than capable to bat at the top of the order. However, they need to bowl well first and they will be banking on Bhuvneshwar Kumar to make early inroads with the new ball. Lucknow, on the other hand, now looks even stronger unit with Jason Holder in the lineup and let's see how he goes about his business against his former team. KL Rahul, the skipper of Lucknow, says that they would have wanted to bowl first as that has been the trend. Informs that they have once change willth Holder coming in for Dushmantha Chameera. Tells that with the new ball one always tries to hit that good area but is is about assessing the conditions and executing in the middle. Adds that Jason Holder is one of the top all-rounder and he strengthens both batting and bowling. Says that the win in the last game was a confidence booster and adds that the performance of the lower- middle order has given them confidence to go hard at top. Applauds Ayush Badoni for his performance and says that it is good to see him perform under pressure and stay calm in those situations and hopes that he can continue the same form. Kane Williamson, the skipper of Hyderabad, says they will have a bowl first. He adds that they take conditions into account while selecting the playing XI and the surface seems pretty similar to the ones that have been used and there's potential due on the cards as well. Mentions that the game is about fine margins and hopes to put on a better performance tonight. Informs that there are no changes to the playing XI and gives an update about his elbow and says that it is better now. Lucknow (Playing XI) - KL Rahul (C), Quinton de Kock (WK), Evin Lewis, Manish Pandey, Deepak Hooda, Ayush Badoni, Krunal Pandya, Jason Holder (In place of Dushmantha Chameera), Avesh Khan, Andrew Tye, Ravi Bishnoi. Hyderabad (Unchanged Playing XI) - Kane Williamson (C), Abhishek Sharma, Rahul Tripathi, Nicholas Pooran (WK), Aiden Markram, Abdul Samad, Romario Shepherd, Washington Sundar, Bhuvneshwar Kumar, Umran Malik, T Natarajan. TOSS - The coin goes up and lands in favour of Hyderabad. They have elected to BOWL first. PITCH REPORT - Rohan Gavaskar is pitchside and he says that it is a fresh pitch and it's an even 70 meters square of the wicket on both sides. He adds that at this stadium back of the length was the way and you couldn't pitch it up but tonight it is a different track and the pacers will look to pitch it up a bit further and the likes of Bhuvi will get more help. Jason Holder has got his cap in the Lucknow huddle. So expect at least one change in the Lucknow lineup. Hyderabad, on the other hand, had a forgettable outing in the last game. The bowling unit with enough quality bowlers leaked far too many runs while the new batting lineup just couldn't handle the pressure of the big score and failed miserably. They seem to be heavily dependent on a few international stars and they need their local talent to contribute with the bat if they want to go deep in the tournament. Can they lift themselves up and produce a better performance this time around? Or will Lucknow get their second win on the trot? We shall find out. Toss and teams sheets in a while. Lucknow, one of the newest entrants in the Indian T20 League started the tournament with a loss in a close encounter but came back with a more clinical display in the second game. In both the games so far, the new franchise has displayed great fighting spirit and the depth of their batting department has been the highlight of their performance so far. Jason Holder is set to be available for selection in this game and that will boost their seam attack which has been a tad expensive. However, it was Ravi Bishnoi who yet again displayed why he is rated so highly with his crafty spin bowling in the last game and Lucknow will hope that he continues in the same vein. It's time for the battle of Nawabs and Nizams as Lucknow get ready to lock horns against Hyderabad. We welcome everyone to our coverage as we get ready for another mouth-watering contest of this 15th edition of the Indian T20 League. ... MATCH DAY …","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637846964400739130.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Gujarat Titans reaping early rewards for strong bowling core, Mohammed Shami, Lockie Ferguson, GT | Cricbuzz.com - Cricbuzz - Cricbuzz","link":"https://news.google.com/__i/rss/rd/articles/CBMiZ2h0dHBzOi8vbS5jcmljYnV6ei5jb20vY3JpY2tldC1uZXdzLzEyMTgwMS9ndWphcmF0LXRpdGFucy1yZWFwaW5nLWVhcmx5LXJld2FyZHMtZm9yLXN0cm9uZy1ib3dsaW5nLWNvcmXSAZgBaHR0cDovL20uY3JpY2J1enouY29tL2FtcC9jcmlja2V0LW5ld3MvMTIxODAxL2d1amFyYXQtdGl0YW5zLXJlYXBpbmctZWFybHktcmV3YXJkcy1mb3Itc3Ryb25nLWJvd2xpbmctY29yZS1tb2hhbW1lZC1zaGFtaS1sb2NraWUtZmVyZ3Vzb24tZ3QtY3JpY2J1enpjb20?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Gujarat Titans reaping early rewards for strong bowling core, Mohammed Shami, Lockie Ferguson, GT | Cricbuzz.com - Cricbuzz  CricbuzzIPL 2022: \"One Of The Most Talented Players In World Cricket,\" Says Ravi Shastri On Gujarat Titans S..  NDTV SportsSRH vs LSG, IPL 2022 stats: Head-to-head record, players to watch out for, predicted XI  SportstarIPL 2022: 'Shubman Gill One of Most Talented Players in World Cricket' - Ravi Shastri  News18Gujarat Titans vs Delhi Capitals IPL 2022: 3 Reasons Why DC Lost  LatestLYView Full coverage on Google News","content":null,"pubDate":"2022-04-04 13:27:46","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"\"He is passionate about his cricket and wants to win every game\" - RCB's Siddharth Kaul on Virat Kohli","link":"https://www.sportskeeda.com/cricket/news-ipl-2022-he-passionate-cricket-wants-win-every-game-rcb-s-siddharth-kaul-virat-kohli?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Cricket"],"creator":["Aditya Suketu Desai"],"video_url":null,"description":null,"content":null,"pubDate":"2022-04-04 13:25:28","full_description":"Royal Challengers Bangalore (RCB) pacer Siddharth Kaul believes that Virat Kohli will surely guide Under-19 star Aneesh Gautam. He mentioned how the star batter has worked hard on his fitness and reached where he is today because of his work ethic. Kaul, who was a part of the Virat Kohli-led India Under-19 team in 2008, pointed out that the 33-year-old is very passionate about his game and strives to win each and every match when he's out there. He added that the seasoned campaigner will surely share details about his progression from junior cricket to senior cricket with Aneeshwar Gautam . The seamer made these remarks in a video shared by the Bangalore-based franchise earlier today. Siddharth Kaul said: He suggested that the Under-19 stars should look up to the likes of Ishan Kishan , Rishabh Pant, and Virat Kohli as they have successfully established themselves on the big stage after their respective ICC Under-19 World Cup stints. He feels that backing one's natural game is the key to success. Kaul added: It is worth mentioning that Aneeshwar Gautam was signed by RCB at the IPL 2022 auction earlier this year for ₹20 lakh. The talented youngster revealed that he wasn't really expecting to be picked for this year's cash-rich league. The 19-year-old revealed that he was unsure if his name would come up in the auction list. He even stated that he had not anticipated that RCB would place a bid for him after his name finally came. Gautam disclosed that he was overjoyed after bagging an IPL contract and added that his phone started buzzing as soon as he got picked. He said: He further added: RCB did not have an ideal start to their campaign, losing their inaugural fixture to Punjab Kings (PBKS) by 5 wickets. However, they did bounce back by claiming a stunning 3-wicket win over Kolkata Knight Riders (KKR) in their subsequent match. The Faf du Plessis-led side are currently placed seventh in the IPL points table. They will next be seen in action on Tuesday, when they lock horns against the Rajasthan Royals (RR) in the 13th match of the season.","image_url":"https://static.sportskeeda.com/editor/2022/04/4487c-16490755427072-1920.jpg","source_id":"sportskeeda","country":["india"],"category":["sports"],"language":"english"},{"title":"Ross Taylor Retires, Here's How The World Reacted","link":"https://sports.ndtv.com/cricket/ross-taylor-retires-heres-how-the-world-reacted-2862192","keywords":null,"creator":null,"video_url":null,"description":"Ross Taylor bid farewell to international cricket on Monday and also received a heartfelt tribute from Sachin Tendulkar.","content":null,"pubDate":"2022-04-04 13:20:15","full_description":"With Ross Taylor's international cricket career finally coming to an end, Sachin Tendulkar led reactions on social media to pay tribute to the New Zealand batter. Taylor's last outing in the Kiwi jersey was on Monday against Netherlands at Seddon Park in an ODI game and he was dismissed for 14. Taking to Twitter, the legendary Indian cricketer wrote, \"You've been a great ambassador of the game Ross! It was wonderful playing against you. The way you reinvented yourself over the years to adapt is an inspiration for all the young kids aspiring to be cricketers.\" \"Heartiest congratulations on a fabulous career\", he further added. You've been a great ambassador of the game Ross! It was wonderful playing against you. The way you reinvented yourself over the years to adapt is an inspiration for all the young kids aspiring to be cricketers. Heartiest congratulations on a fabulous career. pic.twitter.com/RpB62iuuD0 Here are the other reactions: One last stride out to the crease for Luteru Ross Poutoa Lote Taylor pic.twitter.com/u58mG9kVDA Ross Taylor got emotional during national anthem. pic.twitter.com/KfaKnaVr8i Thank you, Ross Taylor. End of a great career. pic.twitter.com/IB1IiWaXSj Special moments at Seddon Park. #ThanksRosco pic.twitter.com/ggbAOYEPj2 Taylor retired from Test cricket in January after a win against Bangladesh in Christchurch. The batter has been a crucial cog in the New Zealand batting order since making his debut in 2006. During his career, he has also broken many records and registered many milestones, including a record 7683 Test runs. He has also scored the most runs for his country in ODI cricket. Promoted On Monday when he came in to bat at number four, Taylor received a guard of honour from the visiting Netherlands team. Before the match, the 38-year-old was in tears with his children on one side and teammates on the other, as both teams lined up for their respective national anthems. The spectators at Seddon Park also rose up to applaud him as he came into bat for the final time.","image_url":"https://c.ndtvimg.com/2022-04/9qnq4l6_ross-taylor-afp_625x300_04_April_22.jpg?im=FitAndFill,algorithm=dnn,width=240,height=180","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL 2022, SRH vs LSG Live Cricket Score Online: Hyderabad to face Lucknow in Mumbai","link":"https://indianexpress.com/article/sports/ipl/ipl-2022-srh-vs-lsg-hyderabad-vs-lucknow-live-score-updates-7852362/","keywords":["IPL 2022","Sports"],"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2022-04-04 13:00:47","full_description":"Their campaign back on track after a poor start, new entrants Lucknow Super Giants will rely on their batting prowess to get past Sunrisers Hyderabad in an Indian Premier League match on Monday. LSG did not have the best start to their debut season, losing by five wickets against fellow IPL debutants Gujarat Titans. (Playing XI): (c), Quinton de Kock(w), , Evin Lewis, , Ayush Badoni, Krunal Pandya, Jason Holder, Andrew Tye, , (Playing XI): (c), , Rahul Tripathi, Nicholas Pooran(w), Aiden Markram, , Romario Shepherd, , , T Natarajan, Umran Malik Kane Williamson (C), Abhishek Sharma, Rahul Tripathi, Nicholas Pooran (WK), Aiden Markram, Abdul Samad, Romario Shepherd, Washington Sundar, Bhuvneshwar Kumar, Umran Malik, T Natarajan Here's our playing XI for the 2️⃣nd match of our season. KL Rahul (C), Quinton de Kock (WK), Manish Pandey, Evin Lewis, Deepak Hooda, Ayush Badoni, Krunal Pandya, Jason Holder, AJ Tye, Ravi Bishnoi, Avesh Khan Sunrisers Hyderabad won the toss and elected to field. Sunrisers are unchanged, while Lucknow have made one change. Jason Holder comes in for Dushmantha Chameera. have won the toss and will bowl first against . Live - West Indies all-rounder Jason Holder is all set to make his debut for Lucknow Super Giants. The Lucknow-base franchise has signed Holder for a whopping Rs 8.75 crores at the IPL mega auction, earlier this year. Congratulations to who is all set to make his debut for . Toss coming up shortly. Stay tuned. Last season's orange cap holder KL Rahul had a poor start to the IPL 2022. He got a peach from Mohammed Shami in Lucknow's opening encounter against fellow new entrant Gujarat Titans, but the LSG skipper looked in good touch against Chennai Super Kings with a fluent 40. Captain KooL Rahul is ready to rock the stadium Super Giant style! He seems to be in the mood tonight! Tune in tonight at 19.30 to support ! 💪 🏆 After a long injury layoff, T Natarajan is returning to competitive cricket. The left-arm pacer is celebrating his 31st birthday and the Sunrisers Hyderabad will be hoping that the yorker specialist will get his rhythm back against Lucknow Super Giants. His bowling takes the cake in the death overs. But his face takes the cake on his birthday. 🎂😂 A very happy birthday to our Yorker King, . 🧡 Hello and welcome to our live coverage of the IPL 2022. Sunrisers Hyderabad will face Lucknow SuperGiants at the DY Patil Stadium.","image_url":null,"source_id":"indianexpress","country":["india"],"category":["sports"],"language":"english"}]}