{"newsArray":[{"title":"News24.com | Ben Stokes' bold declaration on Day 1 of first Ashes Test 'no surprise' to Bairstow","link":"https://www.news24.com/sport/Cricket/International/ben-stokes-bold-declaration-on-day-1-of-first-ashes-test-no-surprise-to-bairstow-20230617","keywords":null,"creator":null,"video_url":null,"description":"England captain Ben Stokes' bold declaration on the opening day of the first Ashes Test may have shocked cricket traditionalists, but it was \"no surprise\" to teammate Jonny Bairstow.","content":"England captain Ben Stokes' bold declaration on the opening day of the first Ashes Test may have shocked cricket traditionalists, but it was \"no surprise\" to teammate Jonny Bairstow. England were 393-8 at Edgbaston, with Joe Root unbeaten on 118 and in superb touch after leading a revival from a mid-innings slump when Stokes called a halt. With 20 minutes left in the day, Stokes was prepared to lose the promise of extra runs in the hope of snaring an Australia wicket in the four overs remaining before Friday's close. READ: Ton-up Root revives England attack before Stokes declares on opening day There was no breakthrough, however, with Australia 14-0 at stumps after David Warner survived his latest encounter with Stuart Broad, who dismissed the left-hander seven times during the drawn 2019 Ashes series in England. Stokes has been no stranger to declarations while overseeing a run of 11 wins in 13 Tests since linking up with coach Brendon McCullum last year. \"I'm sure there's many decisions Ben has made that have taken commentators and other people by surprise, but it was no surprise to us,\" said Bairstow. 'Big dance' Bairstow allowed Stokes to make that decision with a run-a-ball 78 in his first Test innings since a freak golf accident in August last year left him with multiple injuries, including three separate fractures in his left leg. \"I'm delighted to be back out there on the big stage during the big dance. It's something you want to be part of, and it didn't disappoint,\" he said. Bairstow also helped former England captain Root add 121 for the sixth wicket, with his longtime friend and Yorkshire colleague ending an eight-year wait for an Ashes hundred. \"It was brilliant,\" said Bairstow. \"There are some special traits that he's got, and he does special things.\" \"As someone who has known him for a really long time, been through thick and thin, ups and downs and lots of different things together, it was an absolute pleasure to be out there with him.\" Australia paceman Josh Hazlewood, who marked his return to Test cricket with 2-61 in 15 overs, insisted Stokes' declaration did not take aback the tourists. \"I think once Joe got his hundred and they were playing a few shots, I sensed it was coming; that's sort of the way they're playing their cricket at the moment,\" said the 32-year-old seamer. Hazlewood, back in the side after left-arm quick Mitchell Starc was dropped from the team that beat India in last week's World Test Championship final, was adamant Australia had reason to be pleased with their day's work after losing the toss on a good batting pitch. \"The wicket was - not a great deal in it - it was very, very slow, not much sideways movement, it wasn't swinging or anything so 390 (for England), and we're 'none-for' so pretty even, I would say.\"","pubDate":"2023-06-17 05:12:08","image_url":"https://scripts.24.co.za/img/sites/sport24.png","source_id":"news24","category":["sports"],"country":["south africa"],"language":"english"},{"title":"जब एक बैटर का स्‍कोर ही पार नहीं कर पाई थी पाक टीम, दोनों बार 60 रन के अंदर आउट, दो दिन में हारी थी टेस्‍ट","link":"https://hindi.news18.com/news/sports/cricket-when-pakistan-team-dismissed-within-100-runs-in-both-innings-against-australia-lost-test-match-in-two-days-6560449.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"इस टेस्‍ट मैच में ऑस्‍ट्रेलिया के बैटर मैथ्‍यू हेडन ने जो स्‍कोर बनाया था,पाकिस्‍तान टीम दोनों पारियों को मिलाकर भी उसे पार नहीं कर पाई थी. यह टेस्‍ट अक्‍टूबर 2002 में शारजाह में खेला गया था. पाकिस्‍तान टीम के लचर प्रदर्शन के चलते मैच केवल दो दिन में खत्‍म हो गया था और ऑस्‍ट्रेलिया ने इसे एक पारी और 198 रनों के बड़े अंतर से जीता था. पाकिस्‍तान टीम पहली पारी में 59 और दूसरी पारी में 53 रन पर आउट हो गई थी.","content":"पाकिस्‍तान के खिलाफ अक्‍टूबर 2002 में हुए टेस्‍ट में मैथ्‍यू हेडन ने 119 रन की पारी खेली थी. (Matthew Hayden/Instagram) नई दिल्‍ली. पाकिस्‍तान टीम (Pakistan Team) को वैसे तो क्रिकेट में मुश्किल प्रतिद्वंद्वी माना जाता है. इसकी छवि किसी भी मैच में आखिर तक ‘लड़ने’ वाली टीम के रूप में है लेकिन आपको यह जानकर हैरत होगी कि 21वें सदी के एक टेस्‍ट में पाकिस्‍तान टीम दोनों पारियों में 60 रन के स्‍कोर के अंदर आउट हो गई थी. यह नहीं, इस मैच में विपक्षी टीम के एक बैटर ने जो स्‍कोर बनाया था, पाकिस्‍तान टीम दोनों पारियों को मिलाकर भी उसे पार नहीं कर पाई थी.जी हां…हम जिस टेस्‍ट की बात कर रहे हैं वह अक्‍टूबर 2002 में शारजाह में पाकिस्‍तान और ऑस्‍ट्रेलिया (Pakistan vs Australia) के बीच खेला गया था. पाकिस्‍तान टीम के लचर प्रदर्शन के चलते मैच केवल दो दिन में खत्‍म हो गया था और ऑस्‍ट्रेलिया ने इसे एक पारी और 198 रनों के बड़े अंतर से जीता था. जिस मैच की बात की जा रही है, वह 11 अक्‍टूबर को खेला गया था और 12 अक्‍टूबर को ऑस्‍ट्रेलिया की जीत के साथ खत्‍म हुआ था. हेडन के 119 रन से कम रहा पाक की दोनों पारियों का स्‍कोर मैच में टॉस जीतकर पाकिस्‍तान ने टॉस जीतकर बैटिंग चुनी थी लेकिन टीम 31.5ओवर में महज 59 रन बनाकर ढेर हो गई थी. 21 रन बनाने वाले अब्‍दुल रज्‍जाक (21) टॉप स्‍कोरर रहे थे जबकि चार बल्‍लेबाज 0 पर आउट हुए थे. ऑस्ट्रेलिया के शेन वॉर्न (Shane Warne) ने सर्वाधिक चार विकेट लिए थे जबकि मैग्राथ, ब्रेट ली और एंडी बिकेल को दो-दो विकेट मिले थे. जवाब में ऑस्‍ट्रेलिया ने मैथ्‍यू हेडन (Matthew Hayden) के शतक (119) की मदद से पहली पारी में 310 रन बनाए थे जबकि रिकी पोंटिंग ने 44 रनों का योगदान दिया था.पाकिस्‍तान के सकलैन मुश्‍ताक ने चार और रज्‍जाक ने तीन विकेट लिए थे. पहली पारी से भी खराब रहा दूसरी पारी का हाल पाकिस्‍तान की दूसरी पारी का हाल तो पहली पारी से भी खराब रहा था और टीम 24.5 ओवर में 53 रन पर ढेर हो गई थी. यह स्‍कोर पहली पारी के उसके स्‍कोर 59 रन से भी कम रहा. दूसरी पारी में भी पाकिस्‍तान के चार बैटर खाता नहीं खोल पाए थे. ओपनर इमरान नजीर 16 रन बनाकर टॉप स्‍कोरर रहे थे. गेंदबाजी में शेन वॉर्न ने फिर कमाल दिखाते हुए चार विकेट हासिल किए थे. मैच का फैसला महज दो दिन में ही हो गया था. बता दें, महज दो दिन में हारने वाली पाकिस्‍तान की यह टीम कमजोर नहीं थी और इसमें इमरान नजीर, तौफीक उमर, अब्‍दुल रज्‍जाक, यूनुस खान, मिस्‍बाह उल हक, फैजल इकबाल, राशिद खान, सकैलन मुश्‍ताक, शोएब अख्‍तर, वकार यूनुस (कप्‍तान) और दानिश कनेरिया शामिल थे. . Tags: Pakistan cricket team , Pakistan vs australia AC की याद ही नहीं आने देंगे ये 'जम्बो कूलर', कीमत है 5 हजार से भी कम, घर में ला देंगे आंधी! MS Dhoni jersey: एमएस धोनी क्यों पहनते हैं 7 नंबर की जर्सी ? अंधविश्वास या कुछ और? ये है वजह आदिपुरुष के 7 'छपरी' डायलॉग, सोशल मीडिया पर बटोर रहे सुर्खियां, मेकर्स पर गुस्सा निकाल रहे यूजर्स","pubDate":"2023-06-17 04:36:27","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/05/Matthew-Hayden-broken-Brian-Lara-Record-16830335033x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"MS Dhoni jersey: एमएस धोनी क्यों पहनते हैं 7 नंबर की जर्सी ? अंधविश्वास या कुछ और? ये है वजह","link":"https://hindi.news18.com/photogallery/sports/cricket-ms-dhoni-7-number-lucky-jersey-based-on-birth-date-7-july-mahi-revelead-ahead-of-ipl-check-full-details-6560317.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"MS Dhoni jersey: दिग्गज कप्तान महेंद्र सिंह धोनी ने हाल में चेन्नई सुपरकिंग्स को रिकॉर्ड 5वीं बार आईपीएल चैंपियन बनाया. आईसीसी के तीनों बड़े टूर्नामेंट जीतने वाले दुनिया के इकलौते कप्तान धोनी सोशल मीडिया पर ज्यादा ऐक्टिव नहीं रहते हैं. वह बहुत कम बोलने में विश्वास रखते हैं. हालांकि कभी कभी धोनी कुछ ऐसा कह जाते हैं जिसके बारे में लोग जानने को इच्छुक रहते हैं. धोनी को 7 नंबर से बहुत लगाव है. क्या धोनी अंधविश्वासी हैं, जो 7 नंबर की जर्सी पहनकर मैदान में उतरते हैं, आइए जानते हैं इसके पीछे की सच्चाई.","content":"MS Dhoni jersey: दिग्गज कप्तान महेंद्र सिंह धोनी ने हाल में चेन्नई सुपरकिंग्स को रिकॉर्ड 5वीं बार आईपीएल चैंपियन बनाया. आईसीसी के तीनों बड़े टूर्नामेंट जीतने वाले दुनिया के इकलौते कप्तान धोनी सोशल मीडिया पर ज्यादा ऐक्टिव नहीं रहते हैं. वह बहुत कम बोलने में विश्वास रखते हैं. हालांकि कभी कभी धोनी कुछ ऐसा कह जाते हैं जिसके बारे में लोग जानने को इच्छुक रहते हैं. धोनी को 7 नंबर से बहुत लगाव है. क्या धोनी अंधविश्वासी हैं, जो 7 नंबर की जर्सी पहनकर मैदान में उतरते हैं, आइए जानते हैं इसके पीछे की सच्चाई. टीम इंडिया के पूर्व कप्तान महेंद्र सिंह धोनी (Mahendra Singh Dhoni) जब देश के लिए खेलते थे तब, वह 7 नंबर की जर्सी पहनकर ग्राउंड में उतरते थे. माही अब इंटरनेशनल क्रिकेट को अलविदा कह चुके हैं लेकिन वह अभी आईपीएल में खेल रहे हैं. इस प्रतिष्ठित टी20 लीग में भी धोनी की जर्सी के पीछे 7 नंबर लिखा होता है. (AFP) महेंद्र सिंह धोनी (MS Dhoni) का जन्म 7 जुलाई 1981 को हुआ था. यानी 7 तारीख और 7वां महीना. धोनी अपने बर्थडे की वजह से 7 नंबर की जर्सी पहनते हैं. यह जर्सी धोनी के लिए लकी साबित हुआ है. उन्होंने इसी नंबर की जर्सी पहनकर भारत को 2008 में टी20 वर्ल्ड कप चैंपियन बनाया जबकि 2011 में माही की अगुआई में टीम इंडिया वनडे विश्व कप जीतने में सफल रही. इसके बाद धोनी की कप्तानी में भारतीय टीम ने 2013 में आईसीसी ट्रॉफी अपने नाम की. (AFP) महेंद्र सिंह धोनी ने आईपीएल के दौरान एक बार इंटरव्यू में बताया था कि सात ऐसी संख्या है, जो आपके पक्ष में ना जाए तो आपके खिलाफ भी नहीं जाती है. माही का कहना था कि अपनी जर्सी के नंबर का चुनाव करने से पहले उन्हें किसी चीज के बारे में जानना उचित नहीं लगा. (AFP) महेंद्र सिंह धोनी ने 23 दिसंबर 2004 में इंटरनेशनल क्रिकेट में कदम रखा था. तब टीम इंडिया के कप्तान सौरव गांगुली थे. गांगुली ने धोनी को उनके डेब्यू मैच में नंबर 7 पर बैटिंग के लिए भेजा, लेकिन माही खाता भी नहीं खोल सके. हालांकि किस खिलाड़ी को किस क्रम पर भेजना है और किसका क्या रोल रहेगा, इसपर फैसला टीम मैनेजमेंट लेती है. (AFP) डेब्यू मैच में शून्य के निजी स्कोर पर पवेलियन लौटने वाले माही का आत्मविश्वास डगमगाया नहीं, बल्कि और मजबूत हुआ और वह उसके बाद से सफलता की सीढ़ी चढ़ते चले गए. माही भारतीय क्रिकेट के सबसे सफलतम कप्तान हैं. उन्होंने भारत को 2 वर्ल्ड कप खिताब दिलाए हैं. (AFP) 42 वर्षीय माही की फैन फॉलोइंग दुनियाभर में हैं. ऐसी अटकलें लगाई जा रही थी कि आईपीएल 2023 धोनी के लिए आखिरी आईपीएल होगा लेकिन माही ने इसपर पूर्ण विराम लगा दिया है. धोनी अगले साल भी इस लीग में खेलते हुए नजर आएंगे. उन्होंन आईपीएल से संन्यास की घोषणा नहीं की है. उनका कहना है कि अभी आईपीएल के 17वें एडिशन के आयोजन में काफी समय है, इसलिए इस विषय पर वह अभी कुछ नहीं कहेंगे. (AFP) 'आदिपुरुष' पर बरसे रामानमंद सागर के बेटे प्रेम, डायरेक्टर ओम राउत को लगाई फटकार! बोले- क्रिएटिव फ्रीडम के... PHOTOS: असम में बाढ़ से हाहाकार! 11 जिलों में 34,000 से ज्यादा प्रभावित, IMD की चेतावनी अभी और होगी बारिश जब धोनी ने ऑस्ट्रेलिया को हराने के बाद जश्न मनाने से किया मना, सब हुए हैरान, जानें माही ने क्यों किया ऐसा? टीम इंडिया के पूर्व कप्तान महेंद्र सिंह धोनी (Mahendra Singh Dhoni) जब देश के लिए खेलते थे तब, वह 7 नंबर की जर्सी पहनकर ग्राउंड में उतरते थे. माही अब इंटरनेशनल क्रिकेट को अलविदा कह चुके हैं लेकिन वह अभी आईपीएल में खेल रहे हैं. इस प्रतिष्ठित टी20 लीग में भी धोनी की जर्सी के पीछे 7 नंबर लिखा होता है. (AFP)","pubDate":"2023-06-17 04:05:58","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/06/DHONI-7-16869743673x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"“You Tell Me What To Do”: Suresh Raina Reveals MS Dhoni’s Take On Robin Uthappa’s Inclusion In CSK’s Playing XI","link":"https://www.cricketcountry.com/news/you-tell-me-what-to-do-suresh-raina-reveals-ms-dhonis-take-on-robin-uthappas-inclusion-in-csks-playing-xi-1098861","keywords":["News","CSK","IPL","MS Dhoni​","Robin Uthappa","Suresh Raina"],"creator":["CricketCountry Staff"],"video_url":null,"description":"The ex-Chennai Super Kings star revealed his conversation with captain MS Dhoni before picking Robin Uthappa over him in the playing XI squad.","content":"The ex-Chennai Super Kings star revealed his conversation with captain MS Dhoni before picking Robin Uthappa over him in the playing XI squad. One of the most successful IPL teams, Chennai Super Kings, recently won their fifth IPL title after defeating Gujarat Titans in the final of the 2023 IPL. Dhoni-led CSK has produced many great players during all these years, including India's star batters Suresh Raina and Robin Uthappa. In 2021, Dhoni took the tough decision of picking Uthappa over Raina in the playing XI. The 37-year-old was a part of the Rajasthan Royals, and later, in 2021, he was bought by Chennai. In a recent interview with Jiocinema, in a conversation with Robin, Raina revealed that giving an opportunity to the right-handed batter was a tactical move and that CSK skipper Dhoni took his permission before excluding him. \"When MS Dhoni and I talked, I suggested him that 'you should try Robin Uthappa'. He (Dhoni) took permission from me to play you and I said him that 'he is the guy to give you the final, trust me',\" Raina told Uthappa on JioCinema. \"MS Dhoni said that 'see we have played since 2008 but I want to win this season. Now, you tell me what to do'. I said 'play Robin at number 3 and make sure he is in the playing XI till final. If you win, CSK will win. Whether I play or him, Robin and Raina are same',\" the CSK great added. Suresh Raina's IPL Journey Suresh Raina was part of 4 trophy-winning campaigns of Chennai Super Kings in the IPL. Raina remains CSK's highest run-getter, scoring 4687 runs in 176 matches for Chennai Super Kings from 2008 to 2021. The former India all-rounder announced his retirement from all forms of cricket on September 6. Whereas Uthappa scored 115 runs across four matches in IPL 2021 with a strike rate of 136.90 Also Read LIVE SCOREBOARD","pubDate":"2023-06-17 03:50:43","image_url":"https://www.cricketcountry.com//wp-content/uploads/2023/06/Collage-Maker-17-Jun-2023-09-17-AM-4567.jpg","source_id":"cricketcountry","category":["sports"],"country":["india"],"language":"english"},{"title":"Give Dravid a fair opportunity to rebuild, Rohit should hit the refresh button: Smith","link":"https://timesofindia.indiatimes.com/sports/cricket/news/give-rahul-dravid-a-fair-opportunity-to-rebuild-rohit-sharma-must-refresh-graeme-smith/articleshow/101058189.cms","keywords":null,"creator":null,"video_url":null,"description":"Post India’s defeat to Australia in the World Test Championship final, there has been a lot of talk about easing out India’s senior batsmen, whose averages have been declining over the years. Smith feels one game is not enough evidence to judge world-class players.","content":"Top-5: Most hundreds in the Ashes history Most Test runs by Indian batters in the Caribbean since 2010 Most Test wickets by Indian bowlers in the Caribbean since 2010 Most Test runs on India's tour of the West Indies in 2019 NBA champions Denver Nuggets' victory parade after maiden title Spain strike late against Italy to reach Nations League final ​Top-5: Highest run-getters in Ashes history Top-5: Players to watch out for in Ashes 2023 Top-5: Highest wicket-takers in Ashes history Top-5: Most wickets in an Ashes series since 2010","pubDate":"2023-06-17 03:19:40","image_url":null,"source_id":"toi","category":["sports"],"country":["india"],"language":"english"},{"title":"Is The Pitch Haunted?: Shahid Afridi Slams PCB For Refusing Ind vs Pak ODI World Cup Clash At Narendra Modi Stadium","link":"https://www.cricketcountry.com/news/is-the-pitch-haunted-shahid-afridi-slamms-pcb-for-refusing-ind-vs-pak-clash-at-narendra-modi-stadium-1098850","keywords":["News","Ind vs Pak","ODI World Cup","Pakistan Cricket Board","Shahid Afridi"],"creator":["CricketCountry Staff"],"video_url":null,"description":"Ex-Pakistan captain Shahid Afridi slammed Pakistan Cricket Board for refusing to play India vs Pakistan ODI World Cup clash in Ahemdabad.","content":"Ex-Pakistan captain Shahid Afridi slammed Pakistan Cricket Board for refusing to play India vs Pakistan ODI World Cup clash in Ahemdabad. India is all set to host the One-Day International Cricket World Cup later this year. While India has not been able to win an ICC Trophy in 10 years, it will be very exciting to watch if they are able to restrain the trophy at home. On the other hand, fans are very excited to watch their favourite team on the field fighting to lift the World Cup trophy. Once again, India will be seen against Pakistan, which is the most iconic clash. Narendra Modi Stadium in Ahmedabad, which holds a capacity of 100,000 spectators, is set to host the blockbuster India vs Pakistan clash on October 15 in the ODI World Cup. But a confirmation from the International Cricket Board is still awaited. Many reports have claimed that the Pakistan Cricket Board is hesitating to play the match at the venue. Former Pakistan captain Shahid Afridi slammed the PCB's hesitancy to play the match in Ahemdabad. He mockingly asked if the stadium is haunted. \"Why are they declining to play on Ahmedabad pitches? Does it hurl fire or is it haunted?. Go and play-go, play and win. If these are the foreseen challenges, then the only way to overcome them is through a comprehensive victory. What matters at the end of the day is Pakistan team's win. \"The crux only and only lies in there. Take this rather positively. If they [India] are comfortable there, you should go, pull a victory in front of packed Indian crowd and show them what you got, Afridi was quoted as saying by CricketPakistan.com to a local news channel. PCB Still Doubtful About Pakistan's Participation in WC? On the other hand PCB chief Najam Sethi seemed doubtful about Pakistan's participation in the ODI World Cup as he refused to even confirm their presence. \"PCB has told the ICC that it is decision of the government regarding travelling to India for the World Cup. The discussion on venues will be made after the government permits PCB to send the team to India,\" said Sethi in a press conference. \"Even if the schedule is announced and they keep our matches at certain venues, our government can decide to ask for those venues to be changed and can also decide to not send us to India for the World Cup at all. It depends on the ruling party closer to the event\", he added. Also Read LIVE SCOREBOARD","pubDate":"2023-06-17 03:04:44","image_url":"https://www.cricketcountry.com//wp-content/uploads/2023/06/Collage-Maker-17-Jun-2023-08-33-AM-8576.jpg","source_id":"cricketcountry","category":["sports"],"country":["india"],"language":"english"},{"title":"VIDEO: धोनी का बाइक चलाते वीडियो वायरल, साथी खिलाड़ी के साथ उठाया राइड का लुत्फ, कौन बैठा था पीछे?","link":"https://hindi.news18.com/news/sports/cricket-watch-video-ms-dhoni-enjoys-bike-ride-with-s-sreesanth-in-team-india-practice-jersey-mahi-went-viral-on-social-media-6559485.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"MS Dhoni Ride Bike: महेंद्र सिंह धोनी बाइक के काफी शौकीन हैं. उनके पास काफी महंगी बाइक्स है. इस बीच उनका एक पुराना वीडियो सोशल मीडिया पर काफी वायरल हो रहा है. जिसमें वह सड़क पर राइड करते हुए नजर आ रहे हैं. उनके साथ टीम इंडिया का साथी खिलाड़ी भी दिखाई दे रह है.","content":"बाइक चलाते एमएस धोनी का वीडियो वायरल. (screengrab/ AP) नई दिल्ली. महेंद्र सिंह धोनी भारत के सबसे सफल कप्तानों में से एक रहे हैं. वह साल 2020 में इंटरनेशनल क्रिकेट से संन्यास ले चुके हैं. धोनी अभी भी आईपीएल में खेलते हुए नजर आ जाते हैं. धोनी लाइमलाइट से काफी दूर रहते हैं. यहां तक कि उन्होंने अपना शहर भी नहीं छोड़ा है. वह रांची में ही रहते हैं. अगर आप धोनी के डाई हार्ट फैन हों तो आपको यह जरूर पता होगा कि धोनी बाइक के काफी शौकीन हैं. धोनी का एक ऐसा ही पुराना वीडियो सोशल मीडिया पर काफी वायरल हो रहा है. महेंद्र सिंह धोनी के पास बाइक्स का भंडार है. उनके पास एक से एक महंगी बाइक्स है. एमएस धोनी का एक पुराना वीडियो सोशल मीडिया पर काफी वायरल हो रहा है. जिसमें उनके साथी खिलाड़ी एस श्रीसंत भी साथ नजर आ रहे हैं. दरअसल, इस वीडियो में माही बाइक चलाते हुए नजर आ रहे हैं और एस श्रीसंत उनके पीछे बैठे दिखाई दे रहे हैं. दोनों ने ही टीम इंडिया की प्रैक्टिस जर्सी पहनी हुई है. हालांकि, वीडियो में क्या कहा जा रहा है यह समझना थोड़ा कठिन है. जब धोनी ने ऑस्ट्रेलिया को हराने के बाद जश्न मनाने से किया मना, सब हुए हैरान, जानें माही ने क्यों किया ऐसा? Unseen video of our Thala Dhoni with Sreesanth on Bike!! 💛 pic.twitter.com/YaVLrDGvYB — DIPTI MSDIAN (@Diptiranjan_7) June 14, 2023 बता दें कि एमएस धोनी ने अपना डेब्यू साल 2004 में किया था. 3 साल बाद साल 2007 में वह कप्तान बन गए. उन्होंने भारत को पहला टी20 विश्व कप साल 2007 में ही पाकिस्तान के खिलाफ फाइनल मैच जिताया था. बस तभी से धोनी ने भारतीय क्रिकेट में अलग ही सुर्खियां बटोरी. साल 2011 में दोबारा यह कारनामा करते हुए उन्होंने भारत को वनडे विश्व कप जिताया. अगला आईपीएल खेलेंगे माही महेंद्र सिंह धोनी जब आईपीएल 2023 में खेल रहे थे तो कुछ खिलाडी कह रहे थे कि वह अब संन्यास ले लेंगे. यह उनका आखिरी सीजन होगा. लेकिन ऐसा नहीं हुआ. एमएस धोनी ने एक बार फिर से फैंस को खुशखबरी देते हुए कोई संन्यास की घोषणा नहीं की है. वह अगला आईपीएल भी खेलते नजर आएंगे. . Tags: Ms dhoni , S Sreesanth , Team india AC की याद ही नहीं आने देंगे ये 'जम्बो कूलर', कीमत है 5 हजार से भी कम, घर में ला देंगे आंधी! MS Dhoni jersey: एमएस धोनी क्यों पहनते हैं 7 नंबर की जर्सी ? अंधविश्वास या कुछ और? ये है वजह आदिपुरुष के 7 'छपरी' डायलॉग, सोशल मीडिया पर बटोर रहे सुर्खियां, मेकर्स पर गुस्सा निकाल रहे यूजर्स","pubDate":"2023-06-17 02:44:23","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/06/ms-dhoni-bike-16869688643x2.jpeg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"'Dhoni Took Permission From Me': Raina On Veteran's Inclusion In CSK XI","link":"https://sports.ndtv.com/cricket/ms-dhoni-took-permission-from-me-suresh-raina-on-veterans-inclusion-in-csks-playing-xi-4126895","keywords":null,"creator":null,"video_url":null,"description":"Suresh Raina revealed that giving an opportunity to the veteran in CSK's playing XI during IPL 2021 was a tactical move and that CSK skipper MS Dhoni consulted him for it.","content":"The MS Dhoni -led Chennai Super Kings took a tough call towards the end of IPL 2021 by dropping their star player Suresh Raina to make place for Robin Uthappa . It was a match against Delhi Capitals that saw CSK's then new recruit Uthappa getting a chance. He was traded to the side from Rajasthan Royals ahead of IPL 2021. Back then, Dhoni had informed at the toss that Raina was injured. However, the player never returned into CSK's playing XI for the remainder of the season. During an interaction with Robin Uthappa, Raina revealed that giving an opportunity to the right-handed batter was a tactical move and that CSK skipper Dhoni consulted him for it. \"When MS Dhoni and I talked, I suggested him that 'you should try Robin Uthappa'. He (Dhoni) took permission from me to play you and I said him that 'he is the guy to give you the final, trust me',\" Raina told Uthappa on JioCinema . Raina added that he missing out on the final XI 'was not in the dictionary of Dhoni', but the batting southpaw convinced his skipper by saying that Uthappa deserved to be in the team. \"MS Dhoni said that 'see we have played since 2008 but I want to win this season. Now, you tell me what to do'. I said 'play Robin at number 3 and make sure he is in the playing XI till final. If you win, CSK will win. Whether I play or him, Robin and Raina are same',\" the CSK great added. While Uthappa scored 115 runs across four matches in IPL 2021 with a strike rate of 136.90, CSK went on to win the title by beating Kolkata Knight Riders by 27 runs in the final.","pubDate":"2023-06-17 02:38:27","image_url":null,"source_id":"ndtv","category":["sports"],"country":["india"],"language":"english"},{"title":"भारत और पाकिस्तान क्या अहमदाबाद में भिड़ेंगे? पीसीबी मुखिया ने झाड़ा पल्ला, सरकार के पाले में डाली गेंद","link":"https://hindi.news18.com/news/sports/cricket-najam-sethi-cast-a-major-doubt-2023-odi-world-cup-india-vs-pakistan-at-ahmedabad-narendra-modi-stadium-6559471.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"भारत और पाकिस्तान की टीमें अब सिर्फ आईसीसी के टूर्नामेंट में भिड़ती हैं. दोनों टीमें एक दूसरे के देश में जाकर सीरीज नहीं खेलना चाहती हैं. वनडे वर्ल्ड कप का आयोजन भारत में होना है. अब पाकिस्तान इस विश्व कप में हिस्सा लेने के लिए भारत का दौरा करेगा या नहीं, इसको लेकर स्थिति साफ नहीं है.","content":"भारत और पाकिस्तान की टीमें वनडे वर्ल्ड कप से पहले एशिया कप में होंगी आमने सामने. (AFP) नई दिल्ली. आईसीसी वनडे वर्ल्ड कप (2023 ODI World Cup) के 13वें एडिशन का आयोजन इस वर्ष भारत में होगा. इस टूर्नामेंट में पाकिस्तान की टीम शिरकत करेगी या नहीं, इसपर संदेह है. भारत ने आगामी एशिया कप के लिए पाकिस्तान जाने से इनकार कर दिया था. अब पाकिस्तान भी गीदड़ भभकी दे रहा है कि उसकी क्रिकेट टीम विश्व कप के लिए भारत का दौरा नहीं करेगी. पाकिस्तान क्रिकेट बोर्ड (PCB) के अध्यक्ष नजम सेठी (Najam Sethi) से जब इस बारे में पूछा गया तो उन्होंने गेंद सरकार के पाले में डाल दी. पीसीबी के अध्यक्ष नजम सेठी ने भारत में होने वाले वनडे वर्ल्ड कप में अपनी टीम की भागीदारी पर संदेह जताते हुए कहा कि यह ‘सरकार की मंजूरी के अधीन’ है. सेठी के इस रूख से अंतरराष्ट्रीय क्रिकेट परिषद (आईसीसी) के लिए विश्व कप के कार्यक्रम को अंतिम रूप देना मुश्किल होगा. यह भी पढ़ें: Joe Root Slams 30th Test Century: जो रूट का शतकीय प्रहार, डॉन ब्रैडमैन छूटे पीछे, फैब 4 में दूसरे नंबर पर पहुंचे एशियाई खेलों में भाग लेना चाहते हैं भारतीय पहलवान, लिखा पत्र, फिटनेस बनी समस्या जय शाह ने हाइब्रिड मॉडल पर जताई सहमति सेठी की टिप्पणी इस लिए भी आश्चर्यजनक है क्योंकि एशियाई क्रिकेट परिषद (एसीसी) के प्रमुख जय शाह सहित सभी हितधारकों ने पीसीबी प्रमुख द्वारा प्रस्तावित एशिया कप के ‘हाइब्रिड मॉडल’ पर आयोजन के लिए सहमति दे दी है. सेठी ने एक संवाददाता सम्मेलन के दौरान कहा, ‘जहां तक भारत और पाकिस्तान की बात है, न तो पीसीबी और न ही बीसीसीआई निर्णय ले सकते हैं. इसमें संबंधित सरकारें ही निर्णय ले सकती हैं.’ ‘इस मामले में हमारी सरकार फैसला करेगी’ बकौल सेठी, ‘इस मामले में हमारी सरकार को फैसला करना है, जैसे जब भारत की बात आती है, तो यह उनकी सरकार तय करती है कि वे कहां खेलेंगे. हमसे यह पूछने का कोई मतलब नहीं है कि हम अहमदाबाद में खेलेंगे या नहीं. समय आने पर यह तय होगा कि हम जा रहे हैं या नहीं, फिर सरकार तय करेगी की हम कहां खेल सकते हैं. हमारा फैसला इन दो महत्वपूर्ण शर्तों पर टिका होगा.’ . Tags: India Vs Pakistan , ODI World Cup जब धोनी ने ऑस्ट्रेलिया को हराने के बाद जश्न मनाने से किया मना, सब हुए हैरान, जानें माही ने क्यों किया ऐसा? सिल्क की साड़ी घर पर करना चाहती हैं साफ? अपनाएं 5 टिप्स, ड्राई क्लीनिंग की नहीं पड़ेगी जरूरत घर में पड़े-पड़े सूख रहा है खीरा, ऐसे बनाएं रोल ऑन और फेस टोनर, स्किन केयर में करेगा कमाल","pubDate":"2023-06-17 02:20:13","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/06/Rohit-Sharma-with-Babar-Azam-1-16869678133x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"World stunned by ‘best catch of all time’","link":"https://www.cairnspost.com.au/sport/cricket/brad-currie-takes-best-catch-of-alltime-in-vitality-blast-sends-cricket-world-into-meltdown/news-story/c3fe047c3dbaf29b467c424060fe321f","keywords":["Cricket news and galleries","Kayo","Sport news and galleries"],"creator":null,"video_url":null,"description":"The cricket world is pinching itself after one of the most extraordinary efforts you will ever see.","content":"Cricket Don't miss out on the headlines from Cricket. Followed categories will be added to My News. The cricket world is pinching itself after one of the most extraordinary efforts you will ever see. Brad Currie is a Scottish cricketer who only last year made his debut for Surrey in one-day cricket, and was out on his professional T20 debut for the county in their Vitality Blast fixture against Hampshire at Hove. Stream Over 50 Sports Live & On-Demand with Kayo. New to Kayo? Start your free trial now > After this effort, it’s certainly not going to be the last. With less than two overs remaining and Hampshire still needing a difficult 23 runs from 11 deliveries, Benny Howell hoicked Tymal Mills flat and hard across the line to the mid-wicket boundary for six – or so he thought. Currie, running across from square leg had other plans. Brad Currie takes insane catch Sprinting to his left, he launched himself horizontally into the air and plucked the ball out with his left hand, while somehow managing to stay within the confines of the boundary. An effort that needs to be seen to be believed, Currie’s exploits sent the cricket world into a frenzy, with no shortage of superlatives. STOP WHAT YOU ARE DOING BRAD CURRIE HAS JUST TAKEN THE BEST CATCH OF ALL TIME ð¤¯ #Blast23 pic.twitter.com/9tQTYmWxWI — Vitality Blast (@VitalityBlast) June 16, 2023 “Filthy,” acknowledged England Test captain Ben Stokes, fresh off his own team’s exploits in Day 1 of the First Ashes Test at Edgbaston. “Wowza,” said English all-rounder Danni Wyatt. “Ridiculous! Amazing!” said former Pakistan women’s captain Urooj Mumtaz Khan. Sportswriter Jeremy Blackmore called it an “absolute worldie”. More Coverage Bizarre call backfires after cricket history ‘Absurd’: England creates all sorts of history Currie is yet to establish himself in professional cricket, and his social media accounts still reference the fact he’s a keen Fantasy Premier League player, boasting about his overall ranking of 1000 in the 21/22 season ahead of the fact that he “plays a bit of cricket”. The catch was only part of Currie’s dream debut, taking 3-27 and the player of the match award to boot. Originally published as ‘Best catch of all-time’ sends cricket world into meltdown More related stories Cricket Detail in Prime Minister photo goes viral British Prime Minister Rishi Sunak has caused a stir online after an upload of him whipped around social media on Friday. Read more Cricket Australia would have hated being bossed by Bazball While Australia will naturally consider themselves very much in the game, this sense of being buffeted by a storm they are still trying to comprehend will disturb them writes SIMON WILDE. Read more","pubDate":"2023-06-17 02:00:00","image_url":null,"source_id":"cairnspost","category":["sports"],"country":["australia"],"language":"english"},{"title":"News24.com | Ben Stokes' bold declaration on Day 1 of first Ashes Test 'no surprise' to Bairstow","link":"https://www.news24.com/sport/Cricket/International/ben-stokes-bold-declaration-on-day-1-of-first-ashes-test-no-surprise-to-bairstow-20230617","keywords":null,"creator":null,"video_url":null,"description":"England captain Ben Stokes' bold declaration on the opening day of the first Ashes Test may have shocked cricket traditionalists, but it was \"no surprise\" to teammate Jonny Bairstow.","content":"England captain Ben Stokes' bold declaration on the opening day of the first Ashes Test may have shocked cricket traditionalists, but it was \"no surprise\" to teammate Jonny Bairstow. England were 393-8 at Edgbaston, with Joe Root unbeaten on 118 and in superb touch after leading a revival from a mid-innings slump when Stokes called a halt. With 20 minutes left in the day, Stokes was prepared to lose the promise of extra runs in the hope of snaring an Australia wicket in the four overs remaining before Friday's close. READ: Ton-up Root revives England attack before Stokes declares on opening day There was no breakthrough, however, with Australia 14-0 at stumps after David Warner survived his latest encounter with Stuart Broad, who dismissed the left-hander seven times during the drawn 2019 Ashes series in England. Stokes has been no stranger to declarations while overseeing a run of 11 wins in 13 Tests since linking up with coach Brendon McCullum last year. \"I'm sure there's many decisions Ben has made that have taken commentators and other people by surprise, but it was no surprise to us,\" said Bairstow. 'Big dance' Bairstow allowed Stokes to make that decision with a run-a-ball 78 in his first Test innings since a freak golf accident in August last year left him with multiple injuries, including three separate fractures in his left leg. \"I'm delighted to be back out there on the big stage during the big dance. It's something you want to be part of, and it didn't disappoint,\" he said. Bairstow also helped former England captain Root add 121 for the sixth wicket, with his longtime friend and Yorkshire colleague ending an eight-year wait for an Ashes hundred. \"It was brilliant,\" said Bairstow. \"There are some special traits that he's got, and he does special things.\" \"As someone who has known him for a really long time, been through thick and thin, ups and downs and lots of different things together, it was an absolute pleasure to be out there with him.\" Australia paceman Josh Hazlewood, who marked his return to Test cricket with 2-61 in 15 overs, insisted Stokes' declaration did not take aback the tourists. \"I think once Joe got his hundred and they were playing a few shots, I sensed it was coming; that's sort of the way they're playing their cricket at the moment,\" said the 32-year-old seamer. Hazlewood, back in the side after left-arm quick Mitchell Starc was dropped from the team that beat India in last week's World Test Championship final, was adamant Australia had reason to be pleased with their day's work after losing the toss on a good batting pitch. \"The wicket was - not a great deal in it - it was very, very slow, not much sideways movement, it wasn't swinging or anything so 390 (for England), and we're 'none-for' so pretty even, I would say.\"","pubDate":"2023-06-17 05:12:08","image_url":"https://scripts.24.co.za/img/sites/sport24.png","source_id":"news24","category":["sports"],"country":["south africa"],"language":"english"},{"title":"जब एक बैटर का स्‍कोर ही पार नहीं कर पाई थी पाक टीम, दोनों बार 60 रन के अंदर आउट, दो दिन में हारी थी टेस्‍ट","link":"https://hindi.news18.com/news/sports/cricket-when-pakistan-team-dismissed-within-100-runs-in-both-innings-against-australia-lost-test-match-in-two-days-6560449.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"इस टेस्‍ट मैच में ऑस्‍ट्रेलिया के बैटर मैथ्‍यू हेडन ने जो स्‍कोर बनाया था,पाकिस्‍तान टीम दोनों पारियों को मिलाकर भी उसे पार नहीं कर पाई थी. यह टेस्‍ट अक्‍टूबर 2002 में शारजाह में खेला गया था. पाकिस्‍तान टीम के लचर प्रदर्शन के चलते मैच केवल दो दिन में खत्‍म हो गया था और ऑस्‍ट्रेलिया ने इसे एक पारी और 198 रनों के बड़े अंतर से जीता था. पाकिस्‍तान टीम पहली पारी में 59 और दूसरी पारी में 53 रन पर आउट हो गई थी.","content":"पाकिस्‍तान के खिलाफ अक्‍टूबर 2002 में हुए टेस्‍ट में मैथ्‍यू हेडन ने 119 रन की पारी खेली थी. (Matthew Hayden/Instagram) नई दिल्‍ली. पाकिस्‍तान टीम (Pakistan Team) को वैसे तो क्रिकेट में मुश्किल प्रतिद्वंद्वी माना जाता है. इसकी छवि किसी भी मैच में आखिर तक ‘लड़ने’ वाली टीम के रूप में है लेकिन आपको यह जानकर हैरत होगी कि 21वें सदी के एक टेस्‍ट में पाकिस्‍तान टीम दोनों पारियों में 60 रन के स्‍कोर के अंदर आउट हो गई थी. यह नहीं, इस मैच में विपक्षी टीम के एक बैटर ने जो स्‍कोर बनाया था, पाकिस्‍तान टीम दोनों पारियों को मिलाकर भी उसे पार नहीं कर पाई थी.जी हां…हम जिस टेस्‍ट की बात कर रहे हैं वह अक्‍टूबर 2002 में शारजाह में पाकिस्‍तान और ऑस्‍ट्रेलिया (Pakistan vs Australia) के बीच खेला गया था. पाकिस्‍तान टीम के लचर प्रदर्शन के चलते मैच केवल दो दिन में खत्‍म हो गया था और ऑस्‍ट्रेलिया ने इसे एक पारी और 198 रनों के बड़े अंतर से जीता था. जिस मैच की बात की जा रही है, वह 11 अक्‍टूबर को खेला गया था और 12 अक्‍टूबर को ऑस्‍ट्रेलिया की जीत के साथ खत्‍म हुआ था. हेडन के 119 रन से कम रहा पाक की दोनों पारियों का स्‍कोर मैच में टॉस जीतकर पाकिस्‍तान ने टॉस जीतकर बैटिंग चुनी थी लेकिन टीम 31.5ओवर में महज 59 रन बनाकर ढेर हो गई थी. 21 रन बनाने वाले अब्‍दुल रज्‍जाक (21) टॉप स्‍कोरर रहे थे जबकि चार बल्‍लेबाज 0 पर आउट हुए थे. ऑस्ट्रेलिया के शेन वॉर्न (Shane Warne) ने सर्वाधिक चार विकेट लिए थे जबकि मैग्राथ, ब्रेट ली और एंडी बिकेल को दो-दो विकेट मिले थे. जवाब में ऑस्‍ट्रेलिया ने मैथ्‍यू हेडन (Matthew Hayden) के शतक (119) की मदद से पहली पारी में 310 रन बनाए थे जबकि रिकी पोंटिंग ने 44 रनों का योगदान दिया था.पाकिस्‍तान के सकलैन मुश्‍ताक ने चार और रज्‍जाक ने तीन विकेट लिए थे. पहली पारी से भी खराब रहा दूसरी पारी का हाल पाकिस्‍तान की दूसरी पारी का हाल तो पहली पारी से भी खराब रहा था और टीम 24.5 ओवर में 53 रन पर ढेर हो गई थी. यह स्‍कोर पहली पारी के उसके स्‍कोर 59 रन से भी कम रहा. दूसरी पारी में भी पाकिस्‍तान के चार बैटर खाता नहीं खोल पाए थे. ओपनर इमरान नजीर 16 रन बनाकर टॉप स्‍कोरर रहे थे. गेंदबाजी में शेन वॉर्न ने फिर कमाल दिखाते हुए चार विकेट हासिल किए थे. मैच का फैसला महज दो दिन में ही हो गया था. बता दें, महज दो दिन में हारने वाली पाकिस्‍तान की यह टीम कमजोर नहीं थी और इसमें इमरान नजीर, तौफीक उमर, अब्‍दुल रज्‍जाक, यूनुस खान, मिस्‍बाह उल हक, फैजल इकबाल, राशिद खान, सकैलन मुश्‍ताक, शोएब अख्‍तर, वकार यूनुस (कप्‍तान) और दानिश कनेरिया शामिल थे. . Tags: Pakistan cricket team , Pakistan vs australia AC की याद ही नहीं आने देंगे ये 'जम्बो कूलर', कीमत है 5 हजार से भी कम, घर में ला देंगे आंधी! MS Dhoni jersey: एमएस धोनी क्यों पहनते हैं 7 नंबर की जर्सी ? अंधविश्वास या कुछ और? ये है वजह आदिपुरुष के 7 'छपरी' डायलॉग, सोशल मीडिया पर बटोर रहे सुर्खियां, मेकर्स पर गुस्सा निकाल रहे यूजर्स","pubDate":"2023-06-17 04:36:27","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/05/Matthew-Hayden-broken-Brian-Lara-Record-16830335033x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"MS Dhoni jersey: एमएस धोनी क्यों पहनते हैं 7 नंबर की जर्सी ? अंधविश्वास या कुछ और? ये है वजह","link":"https://hindi.news18.com/photogallery/sports/cricket-ms-dhoni-7-number-lucky-jersey-based-on-birth-date-7-july-mahi-revelead-ahead-of-ipl-check-full-details-6560317.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"MS Dhoni jersey: दिग्गज कप्तान महेंद्र सिंह धोनी ने हाल में चेन्नई सुपरकिंग्स को रिकॉर्ड 5वीं बार आईपीएल चैंपियन बनाया. आईसीसी के तीनों बड़े टूर्नामेंट जीतने वाले दुनिया के इकलौते कप्तान धोनी सोशल मीडिया पर ज्यादा ऐक्टिव नहीं रहते हैं. वह बहुत कम बोलने में विश्वास रखते हैं. हालांकि कभी कभी धोनी कुछ ऐसा कह जाते हैं जिसके बारे में लोग जानने को इच्छुक रहते हैं. धोनी को 7 नंबर से बहुत लगाव है. क्या धोनी अंधविश्वासी हैं, जो 7 नंबर की जर्सी पहनकर मैदान में उतरते हैं, आइए जानते हैं इसके पीछे की सच्चाई.","content":"MS Dhoni jersey: दिग्गज कप्तान महेंद्र सिंह धोनी ने हाल में चेन्नई सुपरकिंग्स को रिकॉर्ड 5वीं बार आईपीएल चैंपियन बनाया. आईसीसी के तीनों बड़े टूर्नामेंट जीतने वाले दुनिया के इकलौते कप्तान धोनी सोशल मीडिया पर ज्यादा ऐक्टिव नहीं रहते हैं. वह बहुत कम बोलने में विश्वास रखते हैं. हालांकि कभी कभी धोनी कुछ ऐसा कह जाते हैं जिसके बारे में लोग जानने को इच्छुक रहते हैं. धोनी को 7 नंबर से बहुत लगाव है. क्या धोनी अंधविश्वासी हैं, जो 7 नंबर की जर्सी पहनकर मैदान में उतरते हैं, आइए जानते हैं इसके पीछे की सच्चाई. टीम इंडिया के पूर्व कप्तान महेंद्र सिंह धोनी (Mahendra Singh Dhoni) जब देश के लिए खेलते थे तब, वह 7 नंबर की जर्सी पहनकर ग्राउंड में उतरते थे. माही अब इंटरनेशनल क्रिकेट को अलविदा कह चुके हैं लेकिन वह अभी आईपीएल में खेल रहे हैं. इस प्रतिष्ठित टी20 लीग में भी धोनी की जर्सी के पीछे 7 नंबर लिखा होता है. (AFP) महेंद्र सिंह धोनी (MS Dhoni) का जन्म 7 जुलाई 1981 को हुआ था. यानी 7 तारीख और 7वां महीना. धोनी अपने बर्थडे की वजह से 7 नंबर की जर्सी पहनते हैं. यह जर्सी धोनी के लिए लकी साबित हुआ है. उन्होंने इसी नंबर की जर्सी पहनकर भारत को 2008 में टी20 वर्ल्ड कप चैंपियन बनाया जबकि 2011 में माही की अगुआई में टीम इंडिया वनडे विश्व कप जीतने में सफल रही. इसके बाद धोनी की कप्तानी में भारतीय टीम ने 2013 में आईसीसी ट्रॉफी अपने नाम की. (AFP) महेंद्र सिंह धोनी ने आईपीएल के दौरान एक बार इंटरव्यू में बताया था कि सात ऐसी संख्या है, जो आपके पक्ष में ना जाए तो आपके खिलाफ भी नहीं जाती है. माही का कहना था कि अपनी जर्सी के नंबर का चुनाव करने से पहले उन्हें किसी चीज के बारे में जानना उचित नहीं लगा. (AFP) महेंद्र सिंह धोनी ने 23 दिसंबर 2004 में इंटरनेशनल क्रिकेट में कदम रखा था. तब टीम इंडिया के कप्तान सौरव गांगुली थे. गांगुली ने धोनी को उनके डेब्यू मैच में नंबर 7 पर बैटिंग के लिए भेजा, लेकिन माही खाता भी नहीं खोल सके. हालांकि किस खिलाड़ी को किस क्रम पर भेजना है और किसका क्या रोल रहेगा, इसपर फैसला टीम मैनेजमेंट लेती है. (AFP) डेब्यू मैच में शून्य के निजी स्कोर पर पवेलियन लौटने वाले माही का आत्मविश्वास डगमगाया नहीं, बल्कि और मजबूत हुआ और वह उसके बाद से सफलता की सीढ़ी चढ़ते चले गए. माही भारतीय क्रिकेट के सबसे सफलतम कप्तान हैं. उन्होंने भारत को 2 वर्ल्ड कप खिताब दिलाए हैं. (AFP) 42 वर्षीय माही की फैन फॉलोइंग दुनियाभर में हैं. ऐसी अटकलें लगाई जा रही थी कि आईपीएल 2023 धोनी के लिए आखिरी आईपीएल होगा लेकिन माही ने इसपर पूर्ण विराम लगा दिया है. धोनी अगले साल भी इस लीग में खेलते हुए नजर आएंगे. उन्होंन आईपीएल से संन्यास की घोषणा नहीं की है. उनका कहना है कि अभी आईपीएल के 17वें एडिशन के आयोजन में काफी समय है, इसलिए इस विषय पर वह अभी कुछ नहीं कहेंगे. (AFP) 'आदिपुरुष' पर बरसे रामानमंद सागर के बेटे प्रेम, डायरेक्टर ओम राउत को लगाई फटकार! बोले- क्रिएटिव फ्रीडम के... PHOTOS: असम में बाढ़ से हाहाकार! 11 जिलों में 34,000 से ज्यादा प्रभावित, IMD की चेतावनी अभी और होगी बारिश जब धोनी ने ऑस्ट्रेलिया को हराने के बाद जश्न मनाने से किया मना, सब हुए हैरान, जानें माही ने क्यों किया ऐसा? टीम इंडिया के पूर्व कप्तान महेंद्र सिंह धोनी (Mahendra Singh Dhoni) जब देश के लिए खेलते थे तब, वह 7 नंबर की जर्सी पहनकर ग्राउंड में उतरते थे. माही अब इंटरनेशनल क्रिकेट को अलविदा कह चुके हैं लेकिन वह अभी आईपीएल में खेल रहे हैं. इस प्रतिष्ठित टी20 लीग में भी धोनी की जर्सी के पीछे 7 नंबर लिखा होता है. (AFP)","pubDate":"2023-06-17 04:05:58","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/06/DHONI-7-16869743673x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"“You Tell Me What To Do”: Suresh Raina Reveals MS Dhoni’s Take On Robin Uthappa’s Inclusion In CSK’s Playing XI","link":"https://www.cricketcountry.com/news/you-tell-me-what-to-do-suresh-raina-reveals-ms-dhonis-take-on-robin-uthappas-inclusion-in-csks-playing-xi-1098861","keywords":["News","CSK","IPL","MS Dhoni​","Robin Uthappa","Suresh Raina"],"creator":["CricketCountry Staff"],"video_url":null,"description":"The ex-Chennai Super Kings star revealed his conversation with captain MS Dhoni before picking Robin Uthappa over him in the playing XI squad.","content":"The ex-Chennai Super Kings star revealed his conversation with captain MS Dhoni before picking Robin Uthappa over him in the playing XI squad. One of the most successful IPL teams, Chennai Super Kings, recently won their fifth IPL title after defeating Gujarat Titans in the final of the 2023 IPL. Dhoni-led CSK has produced many great players during all these years, including India's star batters Suresh Raina and Robin Uthappa. In 2021, Dhoni took the tough decision of picking Uthappa over Raina in the playing XI. The 37-year-old was a part of the Rajasthan Royals, and later, in 2021, he was bought by Chennai. In a recent interview with Jiocinema, in a conversation with Robin, Raina revealed that giving an opportunity to the right-handed batter was a tactical move and that CSK skipper Dhoni took his permission before excluding him. \"When MS Dhoni and I talked, I suggested him that 'you should try Robin Uthappa'. He (Dhoni) took permission from me to play you and I said him that 'he is the guy to give you the final, trust me',\" Raina told Uthappa on JioCinema. \"MS Dhoni said that 'see we have played since 2008 but I want to win this season. Now, you tell me what to do'. I said 'play Robin at number 3 and make sure he is in the playing XI till final. If you win, CSK will win. Whether I play or him, Robin and Raina are same',\" the CSK great added. Suresh Raina's IPL Journey Suresh Raina was part of 4 trophy-winning campaigns of Chennai Super Kings in the IPL. Raina remains CSK's highest run-getter, scoring 4687 runs in 176 matches for Chennai Super Kings from 2008 to 2021. The former India all-rounder announced his retirement from all forms of cricket on September 6. Whereas Uthappa scored 115 runs across four matches in IPL 2021 with a strike rate of 136.90 Also Read LIVE SCOREBOARD","pubDate":"2023-06-17 03:50:43","image_url":"https://www.cricketcountry.com//wp-content/uploads/2023/06/Collage-Maker-17-Jun-2023-09-17-AM-4567.jpg","source_id":"cricketcountry","category":["sports"],"country":["india"],"language":"english"},{"title":"Give Dravid a fair opportunity to rebuild, Rohit should hit the refresh button: Smith","link":"https://timesofindia.indiatimes.com/sports/cricket/news/give-rahul-dravid-a-fair-opportunity-to-rebuild-rohit-sharma-must-refresh-graeme-smith/articleshow/101058189.cms","keywords":null,"creator":null,"video_url":null,"description":"Post India’s defeat to Australia in the World Test Championship final, there has been a lot of talk about easing out India’s senior batsmen, whose averages have been declining over the years. Smith feels one game is not enough evidence to judge world-class players.","content":"Top-5: Most hundreds in the Ashes history Most Test runs by Indian batters in the Caribbean since 2010 Most Test wickets by Indian bowlers in the Caribbean since 2010 Most Test runs on India's tour of the West Indies in 2019 NBA champions Denver Nuggets' victory parade after maiden title Spain strike late against Italy to reach Nations League final ​Top-5: Highest run-getters in Ashes history Top-5: Players to watch out for in Ashes 2023 Top-5: Highest wicket-takers in Ashes history Top-5: Most wickets in an Ashes series since 2010","pubDate":"2023-06-17 03:19:40","image_url":null,"source_id":"toi","category":["sports"],"country":["india"],"language":"english"},{"title":"Is The Pitch Haunted?: Shahid Afridi Slams PCB For Refusing Ind vs Pak ODI World Cup Clash At Narendra Modi Stadium","link":"https://www.cricketcountry.com/news/is-the-pitch-haunted-shahid-afridi-slamms-pcb-for-refusing-ind-vs-pak-clash-at-narendra-modi-stadium-1098850","keywords":["News","Ind vs Pak","ODI World Cup","Pakistan Cricket Board","Shahid Afridi"],"creator":["CricketCountry Staff"],"video_url":null,"description":"Ex-Pakistan captain Shahid Afridi slammed Pakistan Cricket Board for refusing to play India vs Pakistan ODI World Cup clash in Ahemdabad.","content":"Ex-Pakistan captain Shahid Afridi slammed Pakistan Cricket Board for refusing to play India vs Pakistan ODI World Cup clash in Ahemdabad. India is all set to host the One-Day International Cricket World Cup later this year. While India has not been able to win an ICC Trophy in 10 years, it will be very exciting to watch if they are able to restrain the trophy at home. On the other hand, fans are very excited to watch their favourite team on the field fighting to lift the World Cup trophy. Once again, India will be seen against Pakistan, which is the most iconic clash. Narendra Modi Stadium in Ahmedabad, which holds a capacity of 100,000 spectators, is set to host the blockbuster India vs Pakistan clash on October 15 in the ODI World Cup. But a confirmation from the International Cricket Board is still awaited. Many reports have claimed that the Pakistan Cricket Board is hesitating to play the match at the venue. Former Pakistan captain Shahid Afridi slammed the PCB's hesitancy to play the match in Ahemdabad. He mockingly asked if the stadium is haunted. \"Why are they declining to play on Ahmedabad pitches? Does it hurl fire or is it haunted?. Go and play-go, play and win. If these are the foreseen challenges, then the only way to overcome them is through a comprehensive victory. What matters at the end of the day is Pakistan team's win. \"The crux only and only lies in there. Take this rather positively. If they [India] are comfortable there, you should go, pull a victory in front of packed Indian crowd and show them what you got, Afridi was quoted as saying by CricketPakistan.com to a local news channel. PCB Still Doubtful About Pakistan's Participation in WC? On the other hand PCB chief Najam Sethi seemed doubtful about Pakistan's participation in the ODI World Cup as he refused to even confirm their presence. \"PCB has told the ICC that it is decision of the government regarding travelling to India for the World Cup. The discussion on venues will be made after the government permits PCB to send the team to India,\" said Sethi in a press conference. \"Even if the schedule is announced and they keep our matches at certain venues, our government can decide to ask for those venues to be changed and can also decide to not send us to India for the World Cup at all. It depends on the ruling party closer to the event\", he added. Also Read LIVE SCOREBOARD","pubDate":"2023-06-17 03:04:44","image_url":"https://www.cricketcountry.com//wp-content/uploads/2023/06/Collage-Maker-17-Jun-2023-08-33-AM-8576.jpg","source_id":"cricketcountry","category":["sports"],"country":["india"],"language":"english"},{"title":"VIDEO: धोनी का बाइक चलाते वीडियो वायरल, साथी खिलाड़ी के साथ उठाया राइड का लुत्फ, कौन बैठा था पीछे?","link":"https://hindi.news18.com/news/sports/cricket-watch-video-ms-dhoni-enjoys-bike-ride-with-s-sreesanth-in-team-india-practice-jersey-mahi-went-viral-on-social-media-6559485.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"MS Dhoni Ride Bike: महेंद्र सिंह धोनी बाइक के काफी शौकीन हैं. उनके पास काफी महंगी बाइक्स है. इस बीच उनका एक पुराना वीडियो सोशल मीडिया पर काफी वायरल हो रहा है. जिसमें वह सड़क पर राइड करते हुए नजर आ रहे हैं. उनके साथ टीम इंडिया का साथी खिलाड़ी भी दिखाई दे रह है.","content":"बाइक चलाते एमएस धोनी का वीडियो वायरल. (screengrab/ AP) नई दिल्ली. महेंद्र सिंह धोनी भारत के सबसे सफल कप्तानों में से एक रहे हैं. वह साल 2020 में इंटरनेशनल क्रिकेट से संन्यास ले चुके हैं. धोनी अभी भी आईपीएल में खेलते हुए नजर आ जाते हैं. धोनी लाइमलाइट से काफी दूर रहते हैं. यहां तक कि उन्होंने अपना शहर भी नहीं छोड़ा है. वह रांची में ही रहते हैं. अगर आप धोनी के डाई हार्ट फैन हों तो आपको यह जरूर पता होगा कि धोनी बाइक के काफी शौकीन हैं. धोनी का एक ऐसा ही पुराना वीडियो सोशल मीडिया पर काफी वायरल हो रहा है. महेंद्र सिंह धोनी के पास बाइक्स का भंडार है. उनके पास एक से एक महंगी बाइक्स है. एमएस धोनी का एक पुराना वीडियो सोशल मीडिया पर काफी वायरल हो रहा है. जिसमें उनके साथी खिलाड़ी एस श्रीसंत भी साथ नजर आ रहे हैं. दरअसल, इस वीडियो में माही बाइक चलाते हुए नजर आ रहे हैं और एस श्रीसंत उनके पीछे बैठे दिखाई दे रहे हैं. दोनों ने ही टीम इंडिया की प्रैक्टिस जर्सी पहनी हुई है. हालांकि, वीडियो में क्या कहा जा रहा है यह समझना थोड़ा कठिन है. जब धोनी ने ऑस्ट्रेलिया को हराने के बाद जश्न मनाने से किया मना, सब हुए हैरान, जानें माही ने क्यों किया ऐसा? Unseen video of our Thala Dhoni with Sreesanth on Bike!! 💛 pic.twitter.com/YaVLrDGvYB — DIPTI MSDIAN (@Diptiranjan_7) June 14, 2023 बता दें कि एमएस धोनी ने अपना डेब्यू साल 2004 में किया था. 3 साल बाद साल 2007 में वह कप्तान बन गए. उन्होंने भारत को पहला टी20 विश्व कप साल 2007 में ही पाकिस्तान के खिलाफ फाइनल मैच जिताया था. बस तभी से धोनी ने भारतीय क्रिकेट में अलग ही सुर्खियां बटोरी. साल 2011 में दोबारा यह कारनामा करते हुए उन्होंने भारत को वनडे विश्व कप जिताया. अगला आईपीएल खेलेंगे माही महेंद्र सिंह धोनी जब आईपीएल 2023 में खेल रहे थे तो कुछ खिलाडी कह रहे थे कि वह अब संन्यास ले लेंगे. यह उनका आखिरी सीजन होगा. लेकिन ऐसा नहीं हुआ. एमएस धोनी ने एक बार फिर से फैंस को खुशखबरी देते हुए कोई संन्यास की घोषणा नहीं की है. वह अगला आईपीएल भी खेलते नजर आएंगे. . Tags: Ms dhoni , S Sreesanth , Team india AC की याद ही नहीं आने देंगे ये 'जम्बो कूलर', कीमत है 5 हजार से भी कम, घर में ला देंगे आंधी! MS Dhoni jersey: एमएस धोनी क्यों पहनते हैं 7 नंबर की जर्सी ? अंधविश्वास या कुछ और? ये है वजह आदिपुरुष के 7 'छपरी' डायलॉग, सोशल मीडिया पर बटोर रहे सुर्खियां, मेकर्स पर गुस्सा निकाल रहे यूजर्स","pubDate":"2023-06-17 02:44:23","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/06/ms-dhoni-bike-16869688643x2.jpeg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"'Dhoni Took Permission From Me': Raina On Veteran's Inclusion In CSK XI","link":"https://sports.ndtv.com/cricket/ms-dhoni-took-permission-from-me-suresh-raina-on-veterans-inclusion-in-csks-playing-xi-4126895","keywords":null,"creator":null,"video_url":null,"description":"Suresh Raina revealed that giving an opportunity to the veteran in CSK's playing XI during IPL 2021 was a tactical move and that CSK skipper MS Dhoni consulted him for it.","content":"The MS Dhoni -led Chennai Super Kings took a tough call towards the end of IPL 2021 by dropping their star player Suresh Raina to make place for Robin Uthappa . It was a match against Delhi Capitals that saw CSK's then new recruit Uthappa getting a chance. He was traded to the side from Rajasthan Royals ahead of IPL 2021. Back then, Dhoni had informed at the toss that Raina was injured. However, the player never returned into CSK's playing XI for the remainder of the season. During an interaction with Robin Uthappa, Raina revealed that giving an opportunity to the right-handed batter was a tactical move and that CSK skipper Dhoni consulted him for it. \"When MS Dhoni and I talked, I suggested him that 'you should try Robin Uthappa'. He (Dhoni) took permission from me to play you and I said him that 'he is the guy to give you the final, trust me',\" Raina told Uthappa on JioCinema . Raina added that he missing out on the final XI 'was not in the dictionary of Dhoni', but the batting southpaw convinced his skipper by saying that Uthappa deserved to be in the team. \"MS Dhoni said that 'see we have played since 2008 but I want to win this season. Now, you tell me what to do'. I said 'play Robin at number 3 and make sure he is in the playing XI till final. If you win, CSK will win. Whether I play or him, Robin and Raina are same',\" the CSK great added. While Uthappa scored 115 runs across four matches in IPL 2021 with a strike rate of 136.90, CSK went on to win the title by beating Kolkata Knight Riders by 27 runs in the final.","pubDate":"2023-06-17 02:38:27","image_url":null,"source_id":"ndtv","category":["sports"],"country":["india"],"language":"english"},{"title":"भारत और पाकिस्तान क्या अहमदाबाद में भिड़ेंगे? पीसीबी मुखिया ने झाड़ा पल्ला, सरकार के पाले में डाली गेंद","link":"https://hindi.news18.com/news/sports/cricket-najam-sethi-cast-a-major-doubt-2023-odi-world-cup-india-vs-pakistan-at-ahmedabad-narendra-modi-stadium-6559471.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"भारत और पाकिस्तान की टीमें अब सिर्फ आईसीसी के टूर्नामेंट में भिड़ती हैं. दोनों टीमें एक दूसरे के देश में जाकर सीरीज नहीं खेलना चाहती हैं. वनडे वर्ल्ड कप का आयोजन भारत में होना है. अब पाकिस्तान इस विश्व कप में हिस्सा लेने के लिए भारत का दौरा करेगा या नहीं, इसको लेकर स्थिति साफ नहीं है.","content":"भारत और पाकिस्तान की टीमें वनडे वर्ल्ड कप से पहले एशिया कप में होंगी आमने सामने. (AFP) नई दिल्ली. आईसीसी वनडे वर्ल्ड कप (2023 ODI World Cup) के 13वें एडिशन का आयोजन इस वर्ष भारत में होगा. इस टूर्नामेंट में पाकिस्तान की टीम शिरकत करेगी या नहीं, इसपर संदेह है. भारत ने आगामी एशिया कप के लिए पाकिस्तान जाने से इनकार कर दिया था. अब पाकिस्तान भी गीदड़ भभकी दे रहा है कि उसकी क्रिकेट टीम विश्व कप के लिए भारत का दौरा नहीं करेगी. पाकिस्तान क्रिकेट बोर्ड (PCB) के अध्यक्ष नजम सेठी (Najam Sethi) से जब इस बारे में पूछा गया तो उन्होंने गेंद सरकार के पाले में डाल दी. पीसीबी के अध्यक्ष नजम सेठी ने भारत में होने वाले वनडे वर्ल्ड कप में अपनी टीम की भागीदारी पर संदेह जताते हुए कहा कि यह ‘सरकार की मंजूरी के अधीन’ है. सेठी के इस रूख से अंतरराष्ट्रीय क्रिकेट परिषद (आईसीसी) के लिए विश्व कप के कार्यक्रम को अंतिम रूप देना मुश्किल होगा. यह भी पढ़ें: Joe Root Slams 30th Test Century: जो रूट का शतकीय प्रहार, डॉन ब्रैडमैन छूटे पीछे, फैब 4 में दूसरे नंबर पर पहुंचे एशियाई खेलों में भाग लेना चाहते हैं भारतीय पहलवान, लिखा पत्र, फिटनेस बनी समस्या जय शाह ने हाइब्रिड मॉडल पर जताई सहमति सेठी की टिप्पणी इस लिए भी आश्चर्यजनक है क्योंकि एशियाई क्रिकेट परिषद (एसीसी) के प्रमुख जय शाह सहित सभी हितधारकों ने पीसीबी प्रमुख द्वारा प्रस्तावित एशिया कप के ‘हाइब्रिड मॉडल’ पर आयोजन के लिए सहमति दे दी है. सेठी ने एक संवाददाता सम्मेलन के दौरान कहा, ‘जहां तक भारत और पाकिस्तान की बात है, न तो पीसीबी और न ही बीसीसीआई निर्णय ले सकते हैं. इसमें संबंधित सरकारें ही निर्णय ले सकती हैं.’ ‘इस मामले में हमारी सरकार फैसला करेगी’ बकौल सेठी, ‘इस मामले में हमारी सरकार को फैसला करना है, जैसे जब भारत की बात आती है, तो यह उनकी सरकार तय करती है कि वे कहां खेलेंगे. हमसे यह पूछने का कोई मतलब नहीं है कि हम अहमदाबाद में खेलेंगे या नहीं. समय आने पर यह तय होगा कि हम जा रहे हैं या नहीं, फिर सरकार तय करेगी की हम कहां खेल सकते हैं. हमारा फैसला इन दो महत्वपूर्ण शर्तों पर टिका होगा.’ . Tags: India Vs Pakistan , ODI World Cup जब धोनी ने ऑस्ट्रेलिया को हराने के बाद जश्न मनाने से किया मना, सब हुए हैरान, जानें माही ने क्यों किया ऐसा? सिल्क की साड़ी घर पर करना चाहती हैं साफ? अपनाएं 5 टिप्स, ड्राई क्लीनिंग की नहीं पड़ेगी जरूरत घर में पड़े-पड़े सूख रहा है खीरा, ऐसे बनाएं रोल ऑन और फेस टोनर, स्किन केयर में करेगा कमाल","pubDate":"2023-06-17 02:20:13","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/06/Rohit-Sharma-with-Babar-Azam-1-16869678133x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"World stunned by ‘best catch of all time’","link":"https://www.cairnspost.com.au/sport/cricket/brad-currie-takes-best-catch-of-alltime-in-vitality-blast-sends-cricket-world-into-meltdown/news-story/c3fe047c3dbaf29b467c424060fe321f","keywords":["Cricket news and galleries","Kayo","Sport news and galleries"],"creator":null,"video_url":null,"description":"The cricket world is pinching itself after one of the most extraordinary efforts you will ever see.","content":"Cricket Don't miss out on the headlines from Cricket. Followed categories will be added to My News. The cricket world is pinching itself after one of the most extraordinary efforts you will ever see. Brad Currie is a Scottish cricketer who only last year made his debut for Surrey in one-day cricket, and was out on his professional T20 debut for the county in their Vitality Blast fixture against Hampshire at Hove. Stream Over 50 Sports Live & On-Demand with Kayo. New to Kayo? Start your free trial now > After this effort, it’s certainly not going to be the last. With less than two overs remaining and Hampshire still needing a difficult 23 runs from 11 deliveries, Benny Howell hoicked Tymal Mills flat and hard across the line to the mid-wicket boundary for six – or so he thought. Currie, running across from square leg had other plans. Brad Currie takes insane catch Sprinting to his left, he launched himself horizontally into the air and plucked the ball out with his left hand, while somehow managing to stay within the confines of the boundary. An effort that needs to be seen to be believed, Currie’s exploits sent the cricket world into a frenzy, with no shortage of superlatives. STOP WHAT YOU ARE DOING BRAD CURRIE HAS JUST TAKEN THE BEST CATCH OF ALL TIME ð¤¯ #Blast23 pic.twitter.com/9tQTYmWxWI — Vitality Blast (@VitalityBlast) June 16, 2023 “Filthy,” acknowledged England Test captain Ben Stokes, fresh off his own team’s exploits in Day 1 of the First Ashes Test at Edgbaston. “Wowza,” said English all-rounder Danni Wyatt. “Ridiculous! Amazing!” said former Pakistan women’s captain Urooj Mumtaz Khan. Sportswriter Jeremy Blackmore called it an “absolute worldie”. More Coverage Bizarre call backfires after cricket history ‘Absurd’: England creates all sorts of history Currie is yet to establish himself in professional cricket, and his social media accounts still reference the fact he’s a keen Fantasy Premier League player, boasting about his overall ranking of 1000 in the 21/22 season ahead of the fact that he “plays a bit of cricket”. The catch was only part of Currie’s dream debut, taking 3-27 and the player of the match award to boot. Originally published as ‘Best catch of all-time’ sends cricket world into meltdown More related stories Cricket Detail in Prime Minister photo goes viral British Prime Minister Rishi Sunak has caused a stir online after an upload of him whipped around social media on Friday. Read more Cricket Australia would have hated being bossed by Bazball While Australia will naturally consider themselves very much in the game, this sense of being buffeted by a storm they are still trying to comprehend will disturb them writes SIMON WILDE. Read more","pubDate":"2023-06-17 02:00:00","image_url":null,"source_id":"cairnspost","category":["sports"],"country":["australia"],"language":"english"},{"title":"News24.com | Ben Stokes' bold declaration on Day 1 of first Ashes Test 'no surprise' to Bairstow","link":"https://www.news24.com/sport/Cricket/International/ben-stokes-bold-declaration-on-day-1-of-first-ashes-test-no-surprise-to-bairstow-20230617","keywords":null,"creator":null,"video_url":null,"description":"England captain Ben Stokes' bold declaration on the opening day of the first Ashes Test may have shocked cricket traditionalists, but it was \"no surprise\" to teammate Jonny Bairstow.","content":"England captain Ben Stokes' bold declaration on the opening day of the first Ashes Test may have shocked cricket traditionalists, but it was \"no surprise\" to teammate Jonny Bairstow. England were 393-8 at Edgbaston, with Joe Root unbeaten on 118 and in superb touch after leading a revival from a mid-innings slump when Stokes called a halt. With 20 minutes left in the day, Stokes was prepared to lose the promise of extra runs in the hope of snaring an Australia wicket in the four overs remaining before Friday's close. READ: Ton-up Root revives England attack before Stokes declares on opening day There was no breakthrough, however, with Australia 14-0 at stumps after David Warner survived his latest encounter with Stuart Broad, who dismissed the left-hander seven times during the drawn 2019 Ashes series in England. Stokes has been no stranger to declarations while overseeing a run of 11 wins in 13 Tests since linking up with coach Brendon McCullum last year. \"I'm sure there's many decisions Ben has made that have taken commentators and other people by surprise, but it was no surprise to us,\" said Bairstow. 'Big dance' Bairstow allowed Stokes to make that decision with a run-a-ball 78 in his first Test innings since a freak golf accident in August last year left him with multiple injuries, including three separate fractures in his left leg. \"I'm delighted to be back out there on the big stage during the big dance. It's something you want to be part of, and it didn't disappoint,\" he said. Bairstow also helped former England captain Root add 121 for the sixth wicket, with his longtime friend and Yorkshire colleague ending an eight-year wait for an Ashes hundred. \"It was brilliant,\" said Bairstow. \"There are some special traits that he's got, and he does special things.\" \"As someone who has known him for a really long time, been through thick and thin, ups and downs and lots of different things together, it was an absolute pleasure to be out there with him.\" Australia paceman Josh Hazlewood, who marked his return to Test cricket with 2-61 in 15 overs, insisted Stokes' declaration did not take aback the tourists. \"I think once Joe got his hundred and they were playing a few shots, I sensed it was coming; that's sort of the way they're playing their cricket at the moment,\" said the 32-year-old seamer. Hazlewood, back in the side after left-arm quick Mitchell Starc was dropped from the team that beat India in last week's World Test Championship final, was adamant Australia had reason to be pleased with their day's work after losing the toss on a good batting pitch. \"The wicket was - not a great deal in it - it was very, very slow, not much sideways movement, it wasn't swinging or anything so 390 (for England), and we're 'none-for' so pretty even, I would say.\"","pubDate":"2023-06-17 05:12:08","image_url":"https://scripts.24.co.za/img/sites/sport24.png","source_id":"news24","category":["sports"],"country":["south africa"],"language":"english"},{"title":"जब एक बैटर का स्‍कोर ही पार नहीं कर पाई थी पाक टीम, दोनों बार 60 रन के अंदर आउट, दो दिन में हारी थी टेस्‍ट","link":"https://hindi.news18.com/news/sports/cricket-when-pakistan-team-dismissed-within-100-runs-in-both-innings-against-australia-lost-test-match-in-two-days-6560449.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"इस टेस्‍ट मैच में ऑस्‍ट्रेलिया के बैटर मैथ्‍यू हेडन ने जो स्‍कोर बनाया था,पाकिस्‍तान टीम दोनों पारियों को मिलाकर भी उसे पार नहीं कर पाई थी. यह टेस्‍ट अक्‍टूबर 2002 में शारजाह में खेला गया था. पाकिस्‍तान टीम के लचर प्रदर्शन के चलते मैच केवल दो दिन में खत्‍म हो गया था और ऑस्‍ट्रेलिया ने इसे एक पारी और 198 रनों के बड़े अंतर से जीता था. पाकिस्‍तान टीम पहली पारी में 59 और दूसरी पारी में 53 रन पर आउट हो गई थी.","content":"पाकिस्‍तान के खिलाफ अक्‍टूबर 2002 में हुए टेस्‍ट में मैथ्‍यू हेडन ने 119 रन की पारी खेली थी. (Matthew Hayden/Instagram) नई दिल्‍ली. पाकिस्‍तान टीम (Pakistan Team) को वैसे तो क्रिकेट में मुश्किल प्रतिद्वंद्वी माना जाता है. इसकी छवि किसी भी मैच में आखिर तक ‘लड़ने’ वाली टीम के रूप में है लेकिन आपको यह जानकर हैरत होगी कि 21वें सदी के एक टेस्‍ट में पाकिस्‍तान टीम दोनों पारियों में 60 रन के स्‍कोर के अंदर आउट हो गई थी. यह नहीं, इस मैच में विपक्षी टीम के एक बैटर ने जो स्‍कोर बनाया था, पाकिस्‍तान टीम दोनों पारियों को मिलाकर भी उसे पार नहीं कर पाई थी.जी हां…हम जिस टेस्‍ट की बात कर रहे हैं वह अक्‍टूबर 2002 में शारजाह में पाकिस्‍तान और ऑस्‍ट्रेलिया (Pakistan vs Australia) के बीच खेला गया था. पाकिस्‍तान टीम के लचर प्रदर्शन के चलते मैच केवल दो दिन में खत्‍म हो गया था और ऑस्‍ट्रेलिया ने इसे एक पारी और 198 रनों के बड़े अंतर से जीता था. जिस मैच की बात की जा रही है, वह 11 अक्‍टूबर को खेला गया था और 12 अक्‍टूबर को ऑस्‍ट्रेलिया की जीत के साथ खत्‍म हुआ था. हेडन के 119 रन से कम रहा पाक की दोनों पारियों का स्‍कोर मैच में टॉस जीतकर पाकिस्‍तान ने टॉस जीतकर बैटिंग चुनी थी लेकिन टीम 31.5ओवर में महज 59 रन बनाकर ढेर हो गई थी. 21 रन बनाने वाले अब्‍दुल रज्‍जाक (21) टॉप स्‍कोरर रहे थे जबकि चार बल्‍लेबाज 0 पर आउट हुए थे. ऑस्ट्रेलिया के शेन वॉर्न (Shane Warne) ने सर्वाधिक चार विकेट लिए थे जबकि मैग्राथ, ब्रेट ली और एंडी बिकेल को दो-दो विकेट मिले थे. जवाब में ऑस्‍ट्रेलिया ने मैथ्‍यू हेडन (Matthew Hayden) के शतक (119) की मदद से पहली पारी में 310 रन बनाए थे जबकि रिकी पोंटिंग ने 44 रनों का योगदान दिया था.पाकिस्‍तान के सकलैन मुश्‍ताक ने चार और रज्‍जाक ने तीन विकेट लिए थे. पहली पारी से भी खराब रहा दूसरी पारी का हाल पाकिस्‍तान की दूसरी पारी का हाल तो पहली पारी से भी खराब रहा था और टीम 24.5 ओवर में 53 रन पर ढेर हो गई थी. यह स्‍कोर पहली पारी के उसके स्‍कोर 59 रन से भी कम रहा. दूसरी पारी में भी पाकिस्‍तान के चार बैटर खाता नहीं खोल पाए थे. ओपनर इमरान नजीर 16 रन बनाकर टॉप स्‍कोरर रहे थे. गेंदबाजी में शेन वॉर्न ने फिर कमाल दिखाते हुए चार विकेट हासिल किए थे. मैच का फैसला महज दो दिन में ही हो गया था. बता दें, महज दो दिन में हारने वाली पाकिस्‍तान की यह टीम कमजोर नहीं थी और इसमें इमरान नजीर, तौफीक उमर, अब्‍दुल रज्‍जाक, यूनुस खान, मिस्‍बाह उल हक, फैजल इकबाल, राशिद खान, सकैलन मुश्‍ताक, शोएब अख्‍तर, वकार यूनुस (कप्‍तान) और दानिश कनेरिया शामिल थे. . Tags: Pakistan cricket team , Pakistan vs australia AC की याद ही नहीं आने देंगे ये 'जम्बो कूलर', कीमत है 5 हजार से भी कम, घर में ला देंगे आंधी! MS Dhoni jersey: एमएस धोनी क्यों पहनते हैं 7 नंबर की जर्सी ? अंधविश्वास या कुछ और? ये है वजह आदिपुरुष के 7 'छपरी' डायलॉग, सोशल मीडिया पर बटोर रहे सुर्खियां, मेकर्स पर गुस्सा निकाल रहे यूजर्स","pubDate":"2023-06-17 04:36:27","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/05/Matthew-Hayden-broken-Brian-Lara-Record-16830335033x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"MS Dhoni jersey: एमएस धोनी क्यों पहनते हैं 7 नंबर की जर्सी ? अंधविश्वास या कुछ और? ये है वजह","link":"https://hindi.news18.com/photogallery/sports/cricket-ms-dhoni-7-number-lucky-jersey-based-on-birth-date-7-july-mahi-revelead-ahead-of-ipl-check-full-details-6560317.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"MS Dhoni jersey: दिग्गज कप्तान महेंद्र सिंह धोनी ने हाल में चेन्नई सुपरकिंग्स को रिकॉर्ड 5वीं बार आईपीएल चैंपियन बनाया. आईसीसी के तीनों बड़े टूर्नामेंट जीतने वाले दुनिया के इकलौते कप्तान धोनी सोशल मीडिया पर ज्यादा ऐक्टिव नहीं रहते हैं. वह बहुत कम बोलने में विश्वास रखते हैं. हालांकि कभी कभी धोनी कुछ ऐसा कह जाते हैं जिसके बारे में लोग जानने को इच्छुक रहते हैं. धोनी को 7 नंबर से बहुत लगाव है. क्या धोनी अंधविश्वासी हैं, जो 7 नंबर की जर्सी पहनकर मैदान में उतरते हैं, आइए जानते हैं इसके पीछे की सच्चाई.","content":"MS Dhoni jersey: दिग्गज कप्तान महेंद्र सिंह धोनी ने हाल में चेन्नई सुपरकिंग्स को रिकॉर्ड 5वीं बार आईपीएल चैंपियन बनाया. आईसीसी के तीनों बड़े टूर्नामेंट जीतने वाले दुनिया के इकलौते कप्तान धोनी सोशल मीडिया पर ज्यादा ऐक्टिव नहीं रहते हैं. वह बहुत कम बोलने में विश्वास रखते हैं. हालांकि कभी कभी धोनी कुछ ऐसा कह जाते हैं जिसके बारे में लोग जानने को इच्छुक रहते हैं. धोनी को 7 नंबर से बहुत लगाव है. क्या धोनी अंधविश्वासी हैं, जो 7 नंबर की जर्सी पहनकर मैदान में उतरते हैं, आइए जानते हैं इसके पीछे की सच्चाई. टीम इंडिया के पूर्व कप्तान महेंद्र सिंह धोनी (Mahendra Singh Dhoni) जब देश के लिए खेलते थे तब, वह 7 नंबर की जर्सी पहनकर ग्राउंड में उतरते थे. माही अब इंटरनेशनल क्रिकेट को अलविदा कह चुके हैं लेकिन वह अभी आईपीएल में खेल रहे हैं. इस प्रतिष्ठित टी20 लीग में भी धोनी की जर्सी के पीछे 7 नंबर लिखा होता है. (AFP) महेंद्र सिंह धोनी (MS Dhoni) का जन्म 7 जुलाई 1981 को हुआ था. यानी 7 तारीख और 7वां महीना. धोनी अपने बर्थडे की वजह से 7 नंबर की जर्सी पहनते हैं. यह जर्सी धोनी के लिए लकी साबित हुआ है. उन्होंने इसी नंबर की जर्सी पहनकर भारत को 2008 में टी20 वर्ल्ड कप चैंपियन बनाया जबकि 2011 में माही की अगुआई में टीम इंडिया वनडे विश्व कप जीतने में सफल रही. इसके बाद धोनी की कप्तानी में भारतीय टीम ने 2013 में आईसीसी ट्रॉफी अपने नाम की. (AFP) महेंद्र सिंह धोनी ने आईपीएल के दौरान एक बार इंटरव्यू में बताया था कि सात ऐसी संख्या है, जो आपके पक्ष में ना जाए तो आपके खिलाफ भी नहीं जाती है. माही का कहना था कि अपनी जर्सी के नंबर का चुनाव करने से पहले उन्हें किसी चीज के बारे में जानना उचित नहीं लगा. (AFP) महेंद्र सिंह धोनी ने 23 दिसंबर 2004 में इंटरनेशनल क्रिकेट में कदम रखा था. तब टीम इंडिया के कप्तान सौरव गांगुली थे. गांगुली ने धोनी को उनके डेब्यू मैच में नंबर 7 पर बैटिंग के लिए भेजा, लेकिन माही खाता भी नहीं खोल सके. हालांकि किस खिलाड़ी को किस क्रम पर भेजना है और किसका क्या रोल रहेगा, इसपर फैसला टीम मैनेजमेंट लेती है. (AFP) डेब्यू मैच में शून्य के निजी स्कोर पर पवेलियन लौटने वाले माही का आत्मविश्वास डगमगाया नहीं, बल्कि और मजबूत हुआ और वह उसके बाद से सफलता की सीढ़ी चढ़ते चले गए. माही भारतीय क्रिकेट के सबसे सफलतम कप्तान हैं. उन्होंने भारत को 2 वर्ल्ड कप खिताब दिलाए हैं. (AFP) 42 वर्षीय माही की फैन फॉलोइंग दुनियाभर में हैं. ऐसी अटकलें लगाई जा रही थी कि आईपीएल 2023 धोनी के लिए आखिरी आईपीएल होगा लेकिन माही ने इसपर पूर्ण विराम लगा दिया है. धोनी अगले साल भी इस लीग में खेलते हुए नजर आएंगे. उन्होंन आईपीएल से संन्यास की घोषणा नहीं की है. उनका कहना है कि अभी आईपीएल के 17वें एडिशन के आयोजन में काफी समय है, इसलिए इस विषय पर वह अभी कुछ नहीं कहेंगे. (AFP) 'आदिपुरुष' पर बरसे रामानमंद सागर के बेटे प्रेम, डायरेक्टर ओम राउत को लगाई फटकार! बोले- क्रिएटिव फ्रीडम के... PHOTOS: असम में बाढ़ से हाहाकार! 11 जिलों में 34,000 से ज्यादा प्रभावित, IMD की चेतावनी अभी और होगी बारिश जब धोनी ने ऑस्ट्रेलिया को हराने के बाद जश्न मनाने से किया मना, सब हुए हैरान, जानें माही ने क्यों किया ऐसा? टीम इंडिया के पूर्व कप्तान महेंद्र सिंह धोनी (Mahendra Singh Dhoni) जब देश के लिए खेलते थे तब, वह 7 नंबर की जर्सी पहनकर ग्राउंड में उतरते थे. माही अब इंटरनेशनल क्रिकेट को अलविदा कह चुके हैं लेकिन वह अभी आईपीएल में खेल रहे हैं. इस प्रतिष्ठित टी20 लीग में भी धोनी की जर्सी के पीछे 7 नंबर लिखा होता है. (AFP)","pubDate":"2023-06-17 04:05:58","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/06/DHONI-7-16869743673x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"“You Tell Me What To Do”: Suresh Raina Reveals MS Dhoni’s Take On Robin Uthappa’s Inclusion In CSK’s Playing XI","link":"https://www.cricketcountry.com/news/you-tell-me-what-to-do-suresh-raina-reveals-ms-dhonis-take-on-robin-uthappas-inclusion-in-csks-playing-xi-1098861","keywords":["News","CSK","IPL","MS Dhoni​","Robin Uthappa","Suresh Raina"],"creator":["CricketCountry Staff"],"video_url":null,"description":"The ex-Chennai Super Kings star revealed his conversation with captain MS Dhoni before picking Robin Uthappa over him in the playing XI squad.","content":"The ex-Chennai Super Kings star revealed his conversation with captain MS Dhoni before picking Robin Uthappa over him in the playing XI squad. One of the most successful IPL teams, Chennai Super Kings, recently won their fifth IPL title after defeating Gujarat Titans in the final of the 2023 IPL. Dhoni-led CSK has produced many great players during all these years, including India's star batters Suresh Raina and Robin Uthappa. In 2021, Dhoni took the tough decision of picking Uthappa over Raina in the playing XI. The 37-year-old was a part of the Rajasthan Royals, and later, in 2021, he was bought by Chennai. In a recent interview with Jiocinema, in a conversation with Robin, Raina revealed that giving an opportunity to the right-handed batter was a tactical move and that CSK skipper Dhoni took his permission before excluding him. \"When MS Dhoni and I talked, I suggested him that 'you should try Robin Uthappa'. He (Dhoni) took permission from me to play you and I said him that 'he is the guy to give you the final, trust me',\" Raina told Uthappa on JioCinema. \"MS Dhoni said that 'see we have played since 2008 but I want to win this season. Now, you tell me what to do'. I said 'play Robin at number 3 and make sure he is in the playing XI till final. If you win, CSK will win. Whether I play or him, Robin and Raina are same',\" the CSK great added. Suresh Raina's IPL Journey Suresh Raina was part of 4 trophy-winning campaigns of Chennai Super Kings in the IPL. Raina remains CSK's highest run-getter, scoring 4687 runs in 176 matches for Chennai Super Kings from 2008 to 2021. The former India all-rounder announced his retirement from all forms of cricket on September 6. Whereas Uthappa scored 115 runs across four matches in IPL 2021 with a strike rate of 136.90 Also Read LIVE SCOREBOARD","pubDate":"2023-06-17 03:50:43","image_url":"https://www.cricketcountry.com//wp-content/uploads/2023/06/Collage-Maker-17-Jun-2023-09-17-AM-4567.jpg","source_id":"cricketcountry","category":["sports"],"country":["india"],"language":"english"},{"title":"Give Dravid a fair opportunity to rebuild, Rohit should hit the refresh button: Smith","link":"https://timesofindia.indiatimes.com/sports/cricket/news/give-rahul-dravid-a-fair-opportunity-to-rebuild-rohit-sharma-must-refresh-graeme-smith/articleshow/101058189.cms","keywords":null,"creator":null,"video_url":null,"description":"Post India’s defeat to Australia in the World Test Championship final, there has been a lot of talk about easing out India’s senior batsmen, whose averages have been declining over the years. Smith feels one game is not enough evidence to judge world-class players.","content":"Top-5: Most hundreds in the Ashes history Most Test runs by Indian batters in the Caribbean since 2010 Most Test wickets by Indian bowlers in the Caribbean since 2010 Most Test runs on India's tour of the West Indies in 2019 NBA champions Denver Nuggets' victory parade after maiden title Spain strike late against Italy to reach Nations League final ​Top-5: Highest run-getters in Ashes history Top-5: Players to watch out for in Ashes 2023 Top-5: Highest wicket-takers in Ashes history Top-5: Most wickets in an Ashes series since 2010","pubDate":"2023-06-17 03:19:40","image_url":null,"source_id":"toi","category":["sports"],"country":["india"],"language":"english"},{"title":"Is The Pitch Haunted?: Shahid Afridi Slams PCB For Refusing Ind vs Pak ODI World Cup Clash At Narendra Modi Stadium","link":"https://www.cricketcountry.com/news/is-the-pitch-haunted-shahid-afridi-slamms-pcb-for-refusing-ind-vs-pak-clash-at-narendra-modi-stadium-1098850","keywords":["News","Ind vs Pak","ODI World Cup","Pakistan Cricket Board","Shahid Afridi"],"creator":["CricketCountry Staff"],"video_url":null,"description":"Ex-Pakistan captain Shahid Afridi slammed Pakistan Cricket Board for refusing to play India vs Pakistan ODI World Cup clash in Ahemdabad.","content":"Ex-Pakistan captain Shahid Afridi slammed Pakistan Cricket Board for refusing to play India vs Pakistan ODI World Cup clash in Ahemdabad. India is all set to host the One-Day International Cricket World Cup later this year. While India has not been able to win an ICC Trophy in 10 years, it will be very exciting to watch if they are able to restrain the trophy at home. On the other hand, fans are very excited to watch their favourite team on the field fighting to lift the World Cup trophy. Once again, India will be seen against Pakistan, which is the most iconic clash. Narendra Modi Stadium in Ahmedabad, which holds a capacity of 100,000 spectators, is set to host the blockbuster India vs Pakistan clash on October 15 in the ODI World Cup. But a confirmation from the International Cricket Board is still awaited. Many reports have claimed that the Pakistan Cricket Board is hesitating to play the match at the venue. Former Pakistan captain Shahid Afridi slammed the PCB's hesitancy to play the match in Ahemdabad. He mockingly asked if the stadium is haunted. \"Why are they declining to play on Ahmedabad pitches? Does it hurl fire or is it haunted?. Go and play-go, play and win. If these are the foreseen challenges, then the only way to overcome them is through a comprehensive victory. What matters at the end of the day is Pakistan team's win. \"The crux only and only lies in there. Take this rather positively. If they [India] are comfortable there, you should go, pull a victory in front of packed Indian crowd and show them what you got, Afridi was quoted as saying by CricketPakistan.com to a local news channel. PCB Still Doubtful About Pakistan's Participation in WC? On the other hand PCB chief Najam Sethi seemed doubtful about Pakistan's participation in the ODI World Cup as he refused to even confirm their presence. \"PCB has told the ICC that it is decision of the government regarding travelling to India for the World Cup. The discussion on venues will be made after the government permits PCB to send the team to India,\" said Sethi in a press conference. \"Even if the schedule is announced and they keep our matches at certain venues, our government can decide to ask for those venues to be changed and can also decide to not send us to India for the World Cup at all. It depends on the ruling party closer to the event\", he added. Also Read LIVE SCOREBOARD","pubDate":"2023-06-17 03:04:44","image_url":"https://www.cricketcountry.com//wp-content/uploads/2023/06/Collage-Maker-17-Jun-2023-08-33-AM-8576.jpg","source_id":"cricketcountry","category":["sports"],"country":["india"],"language":"english"},{"title":"VIDEO: धोनी का बाइक चलाते वीडियो वायरल, साथी खिलाड़ी के साथ उठाया राइड का लुत्फ, कौन बैठा था पीछे?","link":"https://hindi.news18.com/news/sports/cricket-watch-video-ms-dhoni-enjoys-bike-ride-with-s-sreesanth-in-team-india-practice-jersey-mahi-went-viral-on-social-media-6559485.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"MS Dhoni Ride Bike: महेंद्र सिंह धोनी बाइक के काफी शौकीन हैं. उनके पास काफी महंगी बाइक्स है. इस बीच उनका एक पुराना वीडियो सोशल मीडिया पर काफी वायरल हो रहा है. जिसमें वह सड़क पर राइड करते हुए नजर आ रहे हैं. उनके साथ टीम इंडिया का साथी खिलाड़ी भी दिखाई दे रह है.","content":"बाइक चलाते एमएस धोनी का वीडियो वायरल. (screengrab/ AP) नई दिल्ली. महेंद्र सिंह धोनी भारत के सबसे सफल कप्तानों में से एक रहे हैं. वह साल 2020 में इंटरनेशनल क्रिकेट से संन्यास ले चुके हैं. धोनी अभी भी आईपीएल में खेलते हुए नजर आ जाते हैं. धोनी लाइमलाइट से काफी दूर रहते हैं. यहां तक कि उन्होंने अपना शहर भी नहीं छोड़ा है. वह रांची में ही रहते हैं. अगर आप धोनी के डाई हार्ट फैन हों तो आपको यह जरूर पता होगा कि धोनी बाइक के काफी शौकीन हैं. धोनी का एक ऐसा ही पुराना वीडियो सोशल मीडिया पर काफी वायरल हो रहा है. महेंद्र सिंह धोनी के पास बाइक्स का भंडार है. उनके पास एक से एक महंगी बाइक्स है. एमएस धोनी का एक पुराना वीडियो सोशल मीडिया पर काफी वायरल हो रहा है. जिसमें उनके साथी खिलाड़ी एस श्रीसंत भी साथ नजर आ रहे हैं. दरअसल, इस वीडियो में माही बाइक चलाते हुए नजर आ रहे हैं और एस श्रीसंत उनके पीछे बैठे दिखाई दे रहे हैं. दोनों ने ही टीम इंडिया की प्रैक्टिस जर्सी पहनी हुई है. हालांकि, वीडियो में क्या कहा जा रहा है यह समझना थोड़ा कठिन है. जब धोनी ने ऑस्ट्रेलिया को हराने के बाद जश्न मनाने से किया मना, सब हुए हैरान, जानें माही ने क्यों किया ऐसा? Unseen video of our Thala Dhoni with Sreesanth on Bike!! 💛 pic.twitter.com/YaVLrDGvYB — DIPTI MSDIAN (@Diptiranjan_7) June 14, 2023 बता दें कि एमएस धोनी ने अपना डेब्यू साल 2004 में किया था. 3 साल बाद साल 2007 में वह कप्तान बन गए. उन्होंने भारत को पहला टी20 विश्व कप साल 2007 में ही पाकिस्तान के खिलाफ फाइनल मैच जिताया था. बस तभी से धोनी ने भारतीय क्रिकेट में अलग ही सुर्खियां बटोरी. साल 2011 में दोबारा यह कारनामा करते हुए उन्होंने भारत को वनडे विश्व कप जिताया. अगला आईपीएल खेलेंगे माही महेंद्र सिंह धोनी जब आईपीएल 2023 में खेल रहे थे तो कुछ खिलाडी कह रहे थे कि वह अब संन्यास ले लेंगे. यह उनका आखिरी सीजन होगा. लेकिन ऐसा नहीं हुआ. एमएस धोनी ने एक बार फिर से फैंस को खुशखबरी देते हुए कोई संन्यास की घोषणा नहीं की है. वह अगला आईपीएल भी खेलते नजर आएंगे. . Tags: Ms dhoni , S Sreesanth , Team india AC की याद ही नहीं आने देंगे ये 'जम्बो कूलर', कीमत है 5 हजार से भी कम, घर में ला देंगे आंधी! MS Dhoni jersey: एमएस धोनी क्यों पहनते हैं 7 नंबर की जर्सी ? अंधविश्वास या कुछ और? ये है वजह आदिपुरुष के 7 'छपरी' डायलॉग, सोशल मीडिया पर बटोर रहे सुर्खियां, मेकर्स पर गुस्सा निकाल रहे यूजर्स","pubDate":"2023-06-17 02:44:23","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/06/ms-dhoni-bike-16869688643x2.jpeg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"'Dhoni Took Permission From Me': Raina On Veteran's Inclusion In CSK XI","link":"https://sports.ndtv.com/cricket/ms-dhoni-took-permission-from-me-suresh-raina-on-veterans-inclusion-in-csks-playing-xi-4126895","keywords":null,"creator":null,"video_url":null,"description":"Suresh Raina revealed that giving an opportunity to the veteran in CSK's playing XI during IPL 2021 was a tactical move and that CSK skipper MS Dhoni consulted him for it.","content":"The MS Dhoni -led Chennai Super Kings took a tough call towards the end of IPL 2021 by dropping their star player Suresh Raina to make place for Robin Uthappa . It was a match against Delhi Capitals that saw CSK's then new recruit Uthappa getting a chance. He was traded to the side from Rajasthan Royals ahead of IPL 2021. Back then, Dhoni had informed at the toss that Raina was injured. However, the player never returned into CSK's playing XI for the remainder of the season. During an interaction with Robin Uthappa, Raina revealed that giving an opportunity to the right-handed batter was a tactical move and that CSK skipper Dhoni consulted him for it. \"When MS Dhoni and I talked, I suggested him that 'you should try Robin Uthappa'. He (Dhoni) took permission from me to play you and I said him that 'he is the guy to give you the final, trust me',\" Raina told Uthappa on JioCinema . Raina added that he missing out on the final XI 'was not in the dictionary of Dhoni', but the batting southpaw convinced his skipper by saying that Uthappa deserved to be in the team. \"MS Dhoni said that 'see we have played since 2008 but I want to win this season. Now, you tell me what to do'. I said 'play Robin at number 3 and make sure he is in the playing XI till final. If you win, CSK will win. Whether I play or him, Robin and Raina are same',\" the CSK great added. While Uthappa scored 115 runs across four matches in IPL 2021 with a strike rate of 136.90, CSK went on to win the title by beating Kolkata Knight Riders by 27 runs in the final.","pubDate":"2023-06-17 02:38:27","image_url":null,"source_id":"ndtv","category":["sports"],"country":["india"],"language":"english"},{"title":"भारत और पाकिस्तान क्या अहमदाबाद में भिड़ेंगे? पीसीबी मुखिया ने झाड़ा पल्ला, सरकार के पाले में डाली गेंद","link":"https://hindi.news18.com/news/sports/cricket-najam-sethi-cast-a-major-doubt-2023-odi-world-cup-india-vs-pakistan-at-ahmedabad-narendra-modi-stadium-6559471.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"भारत और पाकिस्तान की टीमें अब सिर्फ आईसीसी के टूर्नामेंट में भिड़ती हैं. दोनों टीमें एक दूसरे के देश में जाकर सीरीज नहीं खेलना चाहती हैं. वनडे वर्ल्ड कप का आयोजन भारत में होना है. अब पाकिस्तान इस विश्व कप में हिस्सा लेने के लिए भारत का दौरा करेगा या नहीं, इसको लेकर स्थिति साफ नहीं है.","content":"भारत और पाकिस्तान की टीमें वनडे वर्ल्ड कप से पहले एशिया कप में होंगी आमने सामने. (AFP) नई दिल्ली. आईसीसी वनडे वर्ल्ड कप (2023 ODI World Cup) के 13वें एडिशन का आयोजन इस वर्ष भारत में होगा. इस टूर्नामेंट में पाकिस्तान की टीम शिरकत करेगी या नहीं, इसपर संदेह है. भारत ने आगामी एशिया कप के लिए पाकिस्तान जाने से इनकार कर दिया था. अब पाकिस्तान भी गीदड़ भभकी दे रहा है कि उसकी क्रिकेट टीम विश्व कप के लिए भारत का दौरा नहीं करेगी. पाकिस्तान क्रिकेट बोर्ड (PCB) के अध्यक्ष नजम सेठी (Najam Sethi) से जब इस बारे में पूछा गया तो उन्होंने गेंद सरकार के पाले में डाल दी. पीसीबी के अध्यक्ष नजम सेठी ने भारत में होने वाले वनडे वर्ल्ड कप में अपनी टीम की भागीदारी पर संदेह जताते हुए कहा कि यह ‘सरकार की मंजूरी के अधीन’ है. सेठी के इस रूख से अंतरराष्ट्रीय क्रिकेट परिषद (आईसीसी) के लिए विश्व कप के कार्यक्रम को अंतिम रूप देना मुश्किल होगा. यह भी पढ़ें: Joe Root Slams 30th Test Century: जो रूट का शतकीय प्रहार, डॉन ब्रैडमैन छूटे पीछे, फैब 4 में दूसरे नंबर पर पहुंचे एशियाई खेलों में भाग लेना चाहते हैं भारतीय पहलवान, लिखा पत्र, फिटनेस बनी समस्या जय शाह ने हाइब्रिड मॉडल पर जताई सहमति सेठी की टिप्पणी इस लिए भी आश्चर्यजनक है क्योंकि एशियाई क्रिकेट परिषद (एसीसी) के प्रमुख जय शाह सहित सभी हितधारकों ने पीसीबी प्रमुख द्वारा प्रस्तावित एशिया कप के ‘हाइब्रिड मॉडल’ पर आयोजन के लिए सहमति दे दी है. सेठी ने एक संवाददाता सम्मेलन के दौरान कहा, ‘जहां तक भारत और पाकिस्तान की बात है, न तो पीसीबी और न ही बीसीसीआई निर्णय ले सकते हैं. इसमें संबंधित सरकारें ही निर्णय ले सकती हैं.’ ‘इस मामले में हमारी सरकार फैसला करेगी’ बकौल सेठी, ‘इस मामले में हमारी सरकार को फैसला करना है, जैसे जब भारत की बात आती है, तो यह उनकी सरकार तय करती है कि वे कहां खेलेंगे. हमसे यह पूछने का कोई मतलब नहीं है कि हम अहमदाबाद में खेलेंगे या नहीं. समय आने पर यह तय होगा कि हम जा रहे हैं या नहीं, फिर सरकार तय करेगी की हम कहां खेल सकते हैं. हमारा फैसला इन दो महत्वपूर्ण शर्तों पर टिका होगा.’ . Tags: India Vs Pakistan , ODI World Cup जब धोनी ने ऑस्ट्रेलिया को हराने के बाद जश्न मनाने से किया मना, सब हुए हैरान, जानें माही ने क्यों किया ऐसा? सिल्क की साड़ी घर पर करना चाहती हैं साफ? अपनाएं 5 टिप्स, ड्राई क्लीनिंग की नहीं पड़ेगी जरूरत घर में पड़े-पड़े सूख रहा है खीरा, ऐसे बनाएं रोल ऑन और फेस टोनर, स्किन केयर में करेगा कमाल","pubDate":"2023-06-17 02:20:13","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/06/Rohit-Sharma-with-Babar-Azam-1-16869678133x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"World stunned by ‘best catch of all time’","link":"https://www.cairnspost.com.au/sport/cricket/brad-currie-takes-best-catch-of-alltime-in-vitality-blast-sends-cricket-world-into-meltdown/news-story/c3fe047c3dbaf29b467c424060fe321f","keywords":["Cricket news and galleries","Kayo","Sport news and galleries"],"creator":null,"video_url":null,"description":"The cricket world is pinching itself after one of the most extraordinary efforts you will ever see.","content":"Cricket Don't miss out on the headlines from Cricket. Followed categories will be added to My News. The cricket world is pinching itself after one of the most extraordinary efforts you will ever see. Brad Currie is a Scottish cricketer who only last year made his debut for Surrey in one-day cricket, and was out on his professional T20 debut for the county in their Vitality Blast fixture against Hampshire at Hove. Stream Over 50 Sports Live & On-Demand with Kayo. New to Kayo? Start your free trial now > After this effort, it’s certainly not going to be the last. With less than two overs remaining and Hampshire still needing a difficult 23 runs from 11 deliveries, Benny Howell hoicked Tymal Mills flat and hard across the line to the mid-wicket boundary for six – or so he thought. Currie, running across from square leg had other plans. Brad Currie takes insane catch Sprinting to his left, he launched himself horizontally into the air and plucked the ball out with his left hand, while somehow managing to stay within the confines of the boundary. An effort that needs to be seen to be believed, Currie’s exploits sent the cricket world into a frenzy, with no shortage of superlatives. STOP WHAT YOU ARE DOING BRAD CURRIE HAS JUST TAKEN THE BEST CATCH OF ALL TIME ð¤¯ #Blast23 pic.twitter.com/9tQTYmWxWI — Vitality Blast (@VitalityBlast) June 16, 2023 “Filthy,” acknowledged England Test captain Ben Stokes, fresh off his own team’s exploits in Day 1 of the First Ashes Test at Edgbaston. “Wowza,” said English all-rounder Danni Wyatt. “Ridiculous! Amazing!” said former Pakistan women’s captain Urooj Mumtaz Khan. Sportswriter Jeremy Blackmore called it an “absolute worldie”. More Coverage Bizarre call backfires after cricket history ‘Absurd’: England creates all sorts of history Currie is yet to establish himself in professional cricket, and his social media accounts still reference the fact he’s a keen Fantasy Premier League player, boasting about his overall ranking of 1000 in the 21/22 season ahead of the fact that he “plays a bit of cricket”. The catch was only part of Currie’s dream debut, taking 3-27 and the player of the match award to boot. Originally published as ‘Best catch of all-time’ sends cricket world into meltdown More related stories Cricket Detail in Prime Minister photo goes viral British Prime Minister Rishi Sunak has caused a stir online after an upload of him whipped around social media on Friday. Read more Cricket Australia would have hated being bossed by Bazball While Australia will naturally consider themselves very much in the game, this sense of being buffeted by a storm they are still trying to comprehend will disturb them writes SIMON WILDE. Read more","pubDate":"2023-06-17 02:00:00","image_url":null,"source_id":"cairnspost","category":["sports"],"country":["australia"],"language":"english"}]}