{"newsArray":[{"title":"‘Hope we do him proud’: Warnie’s son’s touching Saints tribute","link":"https://www.foxsports.com.au/afl/teams/st-kilda-saints/afl-2022-jackson-warne-to-toss-coin-for-st-kilda-in-honour-of-late-father-shane-warne-game-against-collingwood-magpies-tribute-instagram-post-social-media/news-story/8b953024689d796a331250c29c7e6533","keywords":null,"creator":null,"video_url":null,"description":"The grieving son of cricket legend Shane Warne will join his dad’s beloved AFL team in a special tribute to mark the first match of the season.","content":null,"pubDate":"2022-03-17 23:42:00","full_description":"The grieving son of cricket legend Shane Warne will join his dad’s beloved AFL team in a special tribute to mark the first match of the season. Shane Warne, who was a long-time fan of the St Kilda Football Club, died of a suspected heart attack on March 4 while holidaying in Thailand. In a special tribute, St Kilda will acknowledge the late cricketer when it takes on Collingwood at Marvel Stadium on Friday night, with his son Jackson set to toss a coin before the game. Stream every match of every round of the 2022 Toyota AFL Premiership Season Live & Ad-Break Free In-Play on Kayo. New to Kayo? Try 14-Days Free Now > Round 1 AFL Mar 16 7:10pm AEST FT Melbourne 97 Bulldogs 71 MATCH CENTRE *Odds are current as of 18th March 2022, 10:53am AEST VIEW ALL SCORES AFL Mar 17 7:25pm AEST FT Carlton 101 Richmond 76 MATCH CENTRE *Odds are current as of 18th March 2022, 10:53am AEST VIEW ALL SCORES AFL Mar 18 7:50pm AEST St Kilda Collingwood MATCH CENTRE $1.65 $2.25 BET *Odds are current as of 18th March 2022, 10:53am AEST VIEW ALL SCORES AFL Mar 19 2:10pm AEST Geelong Essendon MATCH CENTRE $1.59 $2.25 BET *Odds are current as of 18th March 2022, 10:53am AEST VIEW ALL SCORES AFL Mar 19 5:10pm AEST Greater Western Sydney Sydney MATCH CENTRE $1.97 $1.85 BET *Odds are current as of 18th March 2022, 10:53am AEST VIEW ALL SCORES AFL Mar 19 8:10pm AEST Brisbane Port Adelaide MATCH CENTRE $1.45 $2.75 BET *Odds are current as of 18th March 2022, 10:53am AEST VIEW ALL SCORES AFL Mar 20 1:10pm AEST Hawthorn North Melbourne MATCH CENTRE $1.85 $1.95 BET *Odds are current as of 18th March 2022, 10:53am AEST VIEW ALL SCORES AFL Mar 20 4:10pm AEST Adelaide Fremantle MATCH CENTRE $1.80 $2.00 BET *Odds are current as of 18th March 2022, 10:53am AEST VIEW ALL SCORES AFL Mar 20 7:40pm AEST West Coast Gold Coast MATCH CENTRE $2.05 $1.80 BET *Odds are current as of 18th March 2022, 10:53am AEST VIEW ALL SCORES “Warnie was a great Saints man who loved this footy club,” St Kilda captain Jack Steele said. “It’s a privilege to be able to represent Shane on-field and I hope we do him and all Saints fans proud.” Warne had hoped to pursue an AFL career prior to becoming one of Australia’s greatest cricketers. Shane Warne had hoped to pursue an AFL career and was a huge St Kilda fan. Source: Getty Images Warne and his son Jackson were best friends. Source: News Corp Australia Jackson Warne has taken to social media in the aftermath of his father’s death to remember his “brother, best friend and Dad”. The 21-year-old shared special memories of him and his dad through old photos and videos and posed in front of his father’s flower memorial set up by fans around a statue of Warne outside the Melbourne Cricket Ground. In a touching post to his father last week, Jackson said no one would be able to fill the void he had left in his heart. Jackson Warne has posted memories of his dad on social media. Source: Supplied “Sitting at the poker table, walking around the golf course, watching the Saints and eating pizza is never going to be the same,” he wrote. “But I know all you ever wanted for me is to be happy, no matter what. So that’s what I’m going to do, try and be happy. “I’m going to miss you so much Dad, I wish I could look you in the eyes one more time and give you one more hug. “You were truly the best father and best mate anyone could’ve asked for.” Shane Warne played under-19s and one reserves game at St Kilda and was often seen cheering the team on from the stands. St Kilda players will wear commemorative warm-up tops emblazoned with WARNE 23 instead of their usual numbers. Players will also wear the traditional black armbands to acknowledge Warne’s passing.","image_url":null,"source_id":"foxsports","country":["australia"],"category":["sports"],"language":"english"},{"title":"BAN-W vs WI-W Dream11 Team Prediction, Fantasy Cricket Hints: Captain, Probable Playing 11s, Team News; Injury Updates For Today’s BAN-W vs WI-W ODI World Cup Match at Bay Oval, Mount Maunganui 3:30 AM IST March 18","link":"https://zeenews.india.com/cricket/ban-w-vs-wi-w-dream11-team-prediction-fantasy-cricket-hints-captain-probable-playing-11s-team-news-injury-updates-for-today-s-ban-w-vs-wi-w-odi-world-cup-match-at-bay-oval-mount-maunganui-330-am-ist-march-18-2446026.html","keywords":null,"creator":null,"video_url":null,"description":"Bangladesh Women vs West Indies Women Dream11 Team Prediction Bangladesh Women vs West Indies Women ICC Women's World Cup ODI- Check My Dream11 Team, Best players list of BAN-W vs WI-W, Bangladesh Women Dream11 Team Player List, West Indies women Dream11 Team Player List, Dream11 Guru Tips, Fantasy Cricket Tips, Fantasy Cricket Tips, Fantasy Playing Tips.","content":null,"pubDate":"2022-03-17 23:30:00","full_description":"Bangladesh Women will take on West Indies Women in Match No.17 of the ICC Women's World Cup 2022. Bangladesh lost their opening game against New Zealand and South Africa, but bounced back with an impressive win over Pakistan by 9 runs. Previous match's fighting spirit and win will give them a major boost to face against tough teams. On the other hand, West Indies are struggling at the moment. They lost their previous two fixtures against Australia and India, by a huge margin of 7 wickets and 155 runs respectively. West Indies are failing in all departments and need to pick themselves up very soon else they will have no chance of qualifying in such form. Venue: Bay Oval, Moutn Maunganui Date & Time: 18th Match, 3:30 AM IST Wicketkeeper- Shemaine Campbelle, Nigar Sultana Batters- Deandra Dottin, Chedean Nation, Fargana Hoque (vc), Sharmin Akhter All-rounders- Stafanie Taylor, Hayley Matthews (c) Bowlers- Shamilia Connell, Jahanara Alam, Fahima Khatun BAN-W: Shamima Sultana (wk), Sharmin Akhter, Fargana Hoque, Nigar Sultana (c), Rumana Ahmed, Ritu Moni, Fahima Khatun, Salma Khatun, Nahida Akter, Jahanara Alam, Fariha Trisna WI-W: Deandra Dottin, Hayley Matthews, Kycia Knight, Stafanie Taylor (c), Shemaine Campbelle (wk), Chedean Nation, Chinelle Henry, Aaliyah Alleyne, Shakera Selman, Anisa Mohammed / Karishma Ramharack, Shamilia Connell","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"WWE News: Giannis Antetokounmpo Pays Tribute to Steve Austin, Seth Rollins Surprises Indian Cricket Player Venkatesh Iyer","link":"https://411mania.com/wrestling/wwe-news-giannis-antetokounmpo-pays-tribute-to-steve-austin-seth-rollins-surprises-indian-cricket-player-venkatesh-iyer/","keywords":["NBA","Seth Rollins","Steve Austin","WWE Now"],"creator":["JeffreyHarris"],"video_url":null,"description":"More WWE news... The post WWE News: Giannis Antetokounmpo Pays Tribute to Steve Austin, Seth Rollins Surprises Indian Cricket Player Venkatesh Iyer appeared first on 411MANIA.","content":null,"pubDate":"2022-03-17 20:03:17","full_description":"– Milwaukee Bucks player and NBA World champion Giannis Antentokounmpo celebrated Austin 3:16 day last night during a post-game press conference last night after the Bucks after a win over the Sacramento Kings. Giannis, a big-time wrestling fan, came out to the press conference wearing a “Giannis 3:16” shirt and a WWE hat. He then popped open a can of Coors Light in tribute to Stone Cold Steve Austin, which you can see below : If you know, you know. ☠️ @steveaustinBSR pic.twitter.com/3KfPB3BO8M — Giannis Antetokounmpo (@Giannis_An34) March 17, 2022 – In a new episode of WWE Now India, Seth Rollins surprised Indian Cricket player Venkatesh Iyer before the IPL. You can check out that video below:","image_url":null,"source_id":"411mania","country":["united states of america"],"category":["sports"],"language":"english"},{"title":"WA-W vs QUN-W Dream11 Prediction: Fantasy Cricket Tips, Today's Playing 11 and Pitch Report for WNCL 2021-22, Match 24","link":"https://www.sportskeeda.com/fantasy-cricket-mantra/wa-w-vs-qun-w-dream11-prediction-fantasy-cricket-tips-today-s-playing-11-pitch-report-wncl-2021-22-match-24?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Fantasy Cricket Mantra"],"creator":["Anjishnu Roy"],"video_url":null,"description":null,"content":null,"pubDate":"2022-03-17 19:28:39","full_description":"Western Australia Women (WA-W) will take on Queensland Fire (QUN-W) in the 24th match of the WNCL 2021-22 at the Chisholm Oval in Canberra on Friday. Western Australia Women are yet to win a game in the WNCL so far, with their batting unit not being up to the mark. They will be keen to end their campaign on a winning note. Queensland Fire Women, meanwhile, are fourth in the standings with two wins and three losses. They need a miracle to make it to the second spot, but Queensland did beat Western Australia by 69 runs the last time the two teams met. WA-W XI Chloe Piparo (c), Maddy Darke (wk), Maia Bouchier, Mathilda Carmichael, Piepa Cleary, Amy Edgar, Molly Healy, Taneale Peschel, Poppy Stockwell, Georgia Wyllie, Zoe Britcliffe QUN-W XI Tara Wheeler, Georgia Voll, Charli Knott, Mikayla Hinkley, Ellie Johnston, Laura Kimmence (c), Holly Ferling, Lucy Hamilton, Caitlin Mair (wk), Georgia Prestwidge, Grace Parsons WA-W vs QUN-W, WNCL 2021-22, Match 12 Date and Time: 18th March, 2022, 4:30 AM IST Venue: Chisholm Oval, Canberra The pitch at the Chisholm Oval in Canberra generally favors the bowlers, with big scores not being common at the venue. Batters will need to spend some time in the middle before shifting gears. 200 could prove to be the par score on this ground. Wicketkeeper Maddy Darke hasn’t been in the best of form lately, but she remains the best bet for the wicketkeeper-batter slot. Having scored just nine runs in the last match, she will be eyeing a big knock today. Batters Georgia Voll has scored 134 runs in five WNCL matches at an average of 26.8. She also has four wickets to her name. Maia Bouchier scored her first half-century of the tournament in the last match against Queensland Fire Women, albeit in a losing cause. She smashed 79 runs off 70 deliveries. All-rounder Amy Edgar has scored 165 runs at an average of 41.25 while also picking up six wickets from six matches. She will be a splendid multiplier choice for your WA-W vs QUN-W Dream11 fantasy team. Bowler Georgia Prestwidge is a prolific wicket-taker who has taken 11 wickets in six matches at an average of 16.45. Georgia Prestwidge (QUN-W) – 394 points Georgia Voll (QUN-W) – 320 points Charli Knott (QUN-W) – 285 points Amy Edgar (WA-W) – 283 points Zoe Britcliffe (WA-W) – 281 points Georgia Prestwidge: 11 wickets Georgia Voll: 134 runs and 4 wickets Amy Edgar: 165 runs and 6 wickets Zoe Britcliffe: 8 wickets Mikayla Hinkley: 178 runs Fantasy Suggestion #1: Maddy Darke, Georgia Voll, Charli Knott, Mikayla Hinkley, Maia Bouchier, Amy Edgar, Georgia Wyllie, Georgia Prestwidge, Zoe Britcliffe, Holly Ferling, Taneale Peschel. Captain: Amy Edgar. Vice-Captain: Georgia Prestwidge. Fantasy Suggestion #2: Maddy Darke, Georgia Voll, Charli Knott, Mikayla Hinkley, Maia Bouchier, Amy Edgar, Grace Parsons, Georgia Wyllie, Georgia Prestwidge, Zoe Britcliffe, Holly Ferling. Captain: Georgia Voll. Vice-captain: Mikayla Hinkley.","image_url":"https://static.sportskeeda.com/editor/2022/03/df737-16475367184098-1920.jpg","source_id":"sportskeeda","country":["india"],"category":["sports"],"language":"english"},{"title":"“Elephants, Cows….all in the middle of the road”: When Michael Vaughan’s observation of India did not go down well with his Indian followers","link":"https://thesportsrush.com/cricket-news-elephants-cows-all-in-the-middle-of-the-road-when-michael-vaughans-observation-of-india-did-not-go-down-well-with-his-indian-followers/","keywords":["Cricket","Michael vaughan"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Michael Vaughan’s observation of India during his visit to the country drew quite some flak from his Indian followers. Former England batter and skipper Michael Vaughan might have resorted to full-time Cricket punditry, but he also quite often comes up with a statement/opinion or an observation that does no good to him in terms of… The post “Elephants, Cows….all in the middle of the road”: When Michael Vaughan’s observation of India did not go down well with his Indian followers appeared first on The SportsRush.","content":"Michael Vaughan’s observation of India during his visit to the country drew quite some flak from his Indian followers. Former England batter and skipper Michael Vaughan might have resorted to full-time Cricket punditry, but he also quite often comes up with a statement/opinion or an observation that does no good to him in terms of his reputation as a former international cricketer. Quite active on social media sites, Vaughan has decent number of followers on a few of these platforms, most of which are Indians. Despite the fact, the 47-year-old, from time to time keeps taking digs (subtle or explicit) to rile up his Indian followers, be it on issues related to Cricket or not. ALSO READ: Michael Vaughan tweeted picture of a White flag to take a dig at the Indian team Michael Vaughan’s observation of India One such unapologetic tweet of his back in 2019 had a similar effect on his majority Indian followers on the site, inviting criticisms as well as below-the-belt remarks in the comments section. Apparently, Michael Vaughan had visited mainland India during the summer of April in the year 2019. Coming up with a rather backhanded compliment on his observation of the streets in the city he was in, Vaughan remarked that he loved travelling in the country as he could see elephants, cows, pigs etc. in the middle of the road. Fully aware of the potential backlash that was to come his way post the tweet, Vaughan was ready to face all of it, because maybe he did not care about them at all. Love traveling in #India … So far this morning we have seen Elephants,Cows,Camels,Sheep,Goats & Pigs all in the middle of the road … #OnOn — Michael Vaughan (@MichaelVaughan) April 9, 2019 focus on selecting the english team for the world cup and the ashes. Heard aussies are back in form just at the right time. — Sunit Sharma (@imsunitt) April 9, 2019 So u found England team there .. reunion of u guys — Cos_tubh (@UpmanyuKaustubh) April 9, 2019 I love travelling in #England … Instead of cow, sheep,… I found Michael Vaughan in middle of the road … #OnOn — as|am (@aslamixed) April 10, 2019 That’s so typically British ! Mentioning love travelling , at the same time mocking India 🙂 Sorry that you couldn’t find monkeys and donkeys , the whole UK is full of them ! — Dr Rikin Gogri (@dr_rikin) April 9, 2019 When the British were here, there were more dogs barking and shouting here. Now, there are dogs, but more cultured ones. 🙂 — Sreejith Mullappilli (@Mullappilli) April 9, 2019 Loved to see England Cricket Team reuniting in India in middle of the road.. #OnOn — Jay Chavda (@TheMsdian22) April 9, 2019 @MichaelVaughan still nothing is as chaotic as Brexit, isn’t it? Hope you will agree on that :p — Tavinder Saran (@tavinderss) April 9, 2019 What are you and the England Team doing in the middle of the road? Oh yeah, I forgot, you get paid to entertain us. So shut up and do what you’re supposed to – entertain us, lick our shoes for money and get lost after a month — Prashant Menon (@pm8686) April 9, 2019 For more Cricket-related news, click here. The post “Elephants, Cows….all in the middle of the road”: When Michael Vaughan’s observation of India did not go down well with his Indian followers appeared first on The SportsRush.","pubDate":"2022-03-17 18:50:37","full_description":"Michael Vaughan’s observation of India during his visit to the country drew quite some flak from his Indian followers. Former England batter and skipper Michael Vaughan might have resorted to full-time Cricket punditry, but he also quite often comes up with a statement/opinion or an observation that does no good to him in terms of his reputation as a former international cricketer. Quite active on social media sites, Vaughan has decent number of followers on a few of these platforms, most of which are Indians. Despite the fact, the 47-year-old, from time to time keeps taking digs (subtle or explicit) to rile up his Indian followers, be it on issues related to Cricket or not. ALSO READ : Michael Vaughan tweeted picture of a White flag to take a dig at the Indian team One such unapologetic tweet of his back in 2019 had a similar effect on his majority Indian followers on the site, inviting criticisms as well as below-the-belt remarks in the comments section. Apparently, Michael Vaughan had visited mainland India during the summer of April in the year 2019. Coming up with a rather backhanded compliment on his observation of the streets in the city he was in, Vaughan remarked that he loved travelling in the country as he could see elephants, cows, pigs etc. in the middle of the road. Fully aware of the potential backlash that was to come his way post the tweet, Vaughan was ready to face all of it, because maybe he did not care about them at all. Love traveling in #India … So far this morning we have seen Elephants,Cows,Camels,Sheep,Goats & Pigs all in the middle of the road … #OnOn — Michael Vaughan (@MichaelVaughan) April 9, 2019 focus on selecting the english team for the world cup and the ashes. Heard aussies are back in form just at the right time. — Sunit Sharma🇮🇳 (@imsunitt) April 9, 2019 So u found England team there .. reunion of u guys — Cos_tubh (@UpmanyuKaustubh) April 9, 2019 I love travelling in #England … Instead of cow, sheep,… I found Michael Vaughan in middle of the road … #OnOn — as|am⚓ (@aslamixed) April 10, 2019 That’s so typically British ! Mentioning love travelling , at the same time mocking India 🙂 Sorry that you couldn’t find monkeys and donkeys , the whole UK is full of them ! — Dr Rikin Gogri 🇮🇳 (@dr_rikin) April 9, 2019 When the British were here, there were more dogs barking and shouting here. Now, there are dogs, but more cultured ones. 🙂 — Sreejith Mullappilli (@Mullappilli) April 9, 2019 Loved to see England Cricket Team reuniting in India in middle of the road.. 👏👏 #OnOn — Jay Chavda (@TheMsdian22) April 9, 2019 @MichaelVaughan still nothing is as chaotic as Brexit, isn’t it? Hope you will agree on that :p — Tavinder Saran (@tavinderss) April 9, 2019 What are you and the England Team doing in the middle of the road? Oh yeah, I forgot, you get paid to entertain us. So shut up and do what you’re supposed to – entertain us, lick our shoes for money and get lost after a month — Prashant Menon (@pm8686) April 9, 2019 For more Cricket-related news, click here.","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Fastest 5000 runs in Test: Ben Stokes reaches rare milestone during West Indies vs England 2nd Test match at Barbados","link":"https://thesportsrush.com/cricket-news-fastest-5000-runs-in-test-ben-stokes-reaches-rare-milestone-during-west-indies-vs-england-2nd-test-match-at-barbados/","keywords":["Cricket","Ben Stokes","England tour of West Indies 2022"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Fastest 5000 runs in Test: England all-rounder Ben Stokes completed 5,000 runs in Test Cricket during the ongoing 2nd Test match versus WI. During the second Test match of the ongoing England tour of West Indies at the Kensington Oval in Barbados, England’s flamboyant all-rounder Ben Stokes completed 5,000 runs in his Test career while… The post Fastest 5000 runs in Test: Ben Stokes reaches rare milestone during West Indies vs England 2nd Test match at Barbados appeared first on The SportsRush.","content":"Fastest 5000 runs in Test: England all-rounder Ben Stokes completed 5,000 runs in Test Cricket during the ongoing 2nd Test match versus WI. During the second Test match of the ongoing England tour of West Indies at the Kensington Oval in Barbados, England’s flamboyant all-rounder Ben Stokes completed 5,000 runs in his Test career while also powering his team to a position of strength heading towards a massive first innings total. Stokes’ landmark moment arrived just a couple of Overs before Lunch, during the 114th Over of England’s first innings. Having smashed West Indies pacer Alzarri Joseph for three consecutive Fours on the first three deliveries of the Over, Stokes smashed a powerful Six straight down the ground on the ultimate delivery to achieve the landmark feat in his 78th Test match for England. Ben Stokes achieves rare double of 150 wickets and 5000 Test runs The flamboyant all-rounder has also become only the fifth player in Test match history to complete 5,000 runs while also having picked over 150 Test wickets. With 170 Test wickets under his belt already, the 30-year-old has joined the eminent club of Sir Garfield Sobers, Ian Botham, Kapil Dev and Jacques Kallis to achieve the rare double. At the time of writing, Stokes was on the verge of smashing his 11th Test century. pic.twitter.com/oASEvNsruE — England Cricket (@englandcricket) March 17, 2022 Fastest 5000 runs in Test Stokes completing the feat in his 143rd innings is, however, nowhere near to the legendary cricketer who holds the record by quite some distance. The record for scoring the fastest 5,000 runs in Test Cricket is held by the legendary Aussie batter Sir Don Bradman, who achieved the landmark moment in only his 56th innings (36th Test match) against England at Leeds in 1938. Placed miles ahead at the second spot is England’s Jack Hobbs, who completed the same during his 91st innings (55th Test match). Amongst the active players, the fastest to the landmark number is Australia’s Steve Smith, who completed his 5000 Test runs in the year 2017, during his 97th innings (53rd Test match) for his country against India in Ranchi. The post Fastest 5000 runs in Test: Ben Stokes reaches rare milestone during West Indies vs England 2nd Test match at Barbados appeared first on The SportsRush.","pubDate":"2022-03-17 17:31:31","full_description":"Fastest 5000 runs in Test: England all-rounder Ben Stokes completed 5,000 runs in Test Cricket during the ongoing 2nd Test match versus WI. During the second Test match of the ongoing England tour of West Indies at the Kensington Oval in Barbados, England’s flamboyant all-rounder Ben Stokes completed 5,000 runs in his Test career while also powering his team to a position of strength heading towards a massive first innings total. Stokes’ landmark moment arrived just a couple of Overs before Lunch, during the 114th Over of England’s first innings. Having smashed West Indies pacer Alzarri Joseph for three consecutive Fours on the first three deliveries of the Over, Stokes smashed a powerful Six straight down the ground on the ultimate delivery to achieve the landmark feat in his 78th Test match for England. The flamboyant all-rounder has also become only the fifth player in Test match history to complete 5,000 runs while also having picked over 150 Test wickets. With 170 Test wickets under his belt already, the 30-year-old has joined the eminent club of Sir Garfield Sobers, Ian Botham, Kapil Dev and Jacques Kallis to achieve the rare double. At the time of writing, Stokes was on the verge of smashing his 11th Test century. ❤️ pic.twitter.com/oASEvNsruE — England Cricket (@englandcricket) March 17, 2022 Stokes completing the feat in his 143rd innings is, however, nowhere near to the legendary cricketer who holds the record by quite some distance. The record for scoring the fastest 5,000 runs in Test Cricket is held by the legendary Aussie batter Sir Don Bradman, who achieved the landmark moment in only his 56th innings (36th Test match) against England at Leeds in 1938. Placed miles ahead at the second spot is England’s Jack Hobbs, who completed the same during his 91st innings (55th Test match). Amongst the active players, the fastest to the landmark number is Australia’s Steve Smith, who completed his 5000 Test runs in the year 2017, during his 97th innings (53rd Test match) for his country against India in Ranchi.","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"West Indies v England: second Test, day two – live! - The Guardian","link":"https://news.google.com/__i/rss/rd/articles/CBMib2h0dHBzOi8vd3d3LnRoZWd1YXJkaWFuLmNvbS9zcG9ydC9saXZlLzIwMjIvbWFyLzE3L3dlc3QtaW5kaWVzLXYtZW5nbGFuZC1zZWNvbmQtdGVzdC1kYXktdHdvLWxpdmUtc2NvcmUtdXBkYXRlc9IBb2h0dHBzOi8vYW1wLnRoZWd1YXJkaWFuLmNvbS9zcG9ydC9saXZlLzIwMjIvbWFyLzE3L3dlc3QtaW5kaWVzLXYtZW5nbGFuZC1zZWNvbmQtdGVzdC1kYXktdHdvLWxpdmUtc2NvcmUtdXBkYXRlcw?oc=5","keywords":null,"creator":null,"video_url":null,"description":"West Indies v England: second Test, day two – live!  The GuardianLIVE: West Indies v England Cricket | 2nd Test Day 2 talkSPORT Stream  talkSPORTEngland make steady start with the bat after late line-up change in Barbados  The IndependentEngland’s Root and Lawrence take centre stage against West Indies  The GuardianEngland hand Yorkshire seamer Matthew Fisher surprise Test debut  Chester and District StandardView Full coverage on Google News","content":null,"pubDate":"2022-03-17 17:29:17","image_url":null,"source_id":"google","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Darren Gough hails England new boy Matt Fisher as a ‘terrific leader’ and backs him as possible future Yorkshire captain","link":"https://talksport.com/sport/cricket/1066216/darren-gough-england-new-boy-matt-fisher-yorkshire-captain/","keywords":["Cricket","Sport","England Cricket","Yorkshire"],"creator":["talkSPORT"],"video_url":null,"description":"Darren Gough has sung the praises of England debutant Matt Fisher – and believes he could be a future captain of Yorkshire. Gough, who knows Fisher well through his role as interim managing director of cricket at the county club, was speaking as part of talkSPORT 2’s commentary team during the second Test against the […]","content":"Darren Gough has sung the praises of England debutant Matt Fisher – and believes he could be a future captain of Yorkshire. Gough, who knows Fisher well through his role as interim managing director of cricket at the county club, was speaking as part of talkSPORT 2’s commentary team during the second Test against the West Indies. Fisher receives his maiden England cap from Joe RootGETTY Fisher was a late addition to the starting line-up in Barbados after Craig Overton withdrew on the morning of the game through illness. This is the first England Test squad that Fisher has been a part of, having got the call up after impressing on the England Lions tour of Australia before Christmas. In their match against Australia A, Fisher only took two wickets but that included the scalp of Usman Khawaja, who would later go on to score twin tons against England in the Sydney Test match. “I know [Matt] very well from over the last three months,” Gough said on commentary. “And from what I’ve seen, he’s a guy who since he’s come back from the England A tour is a lot fitter than he’d been from the reports I’d got. “He looks trim and from all the testing we’ve been doing in the last four or five weeks he’s very fit.” Fisher is highly regarded by YorkshireGETTY Fisher has long been considered somewhat of a cricketing prodigy, having made his professional debut at just 15 years old when he played in a one-day game for Yorkshire against Leicestershire in 2013. Since then, injuries have prevented him from playing with any real regularity and in the seven years since his first-class debut in 2015 he has played just 21 matches with the red-ball. However, from those appearances he has an excellent record having taken 63 wickets at an average of 27.52. “He can bowl, let me tell you,” Gough said. “He’s a very impressive character, a very intelligent young man, very outspoken, but what else would you expect? He’s a Yorkshireman. “But, he’s got a lot of empathy with it, he’s a terrific leader of men and I think from all the young men I’ve met at Yorkshire he was one of the first that stood out to me. And I was thinking that later down the line this is a possible captain, even though he’s so young and he’s a bowler. But he has definitely got true character.” Uninterrupted ball-by-ball coverage of the West Indies vs England tour is live on talkSPORT 2 this month","pubDate":"2022-03-17 16:50:49","full_description":"Darren Gough has sung the praises of England debutant Matt Fisher – and believes he could be a future captain of Yorkshire. Gough, who knows Fisher well through his role as interim managing director of cricket at the county club, was speaking as part of talkSPORT 2’s commentary team during the second Test against the West Indies. Fisher was a late addition to the starting line-up in Barbados after Craig Overton withdrew on the morning of the game through illness. This is the first England Test squad that Fisher has been a part of, having got the call up after impressing on the England Lions tour of Australia before Christmas. In their match against Australia A, Fisher only took two wickets but that included the scalp of Usman Khawaja, who would later go on to score twin tons against England in the Sydney Test match. “I know [Matt] very well from over the last three months,” Gough said on commentary. “And from what I’ve seen, he’s a guy who since he’s come back from the England A tour is a lot fitter than he’d been from the reports I’d got. “He looks trim and from all the testing we’ve been doing in the last four or five weeks he’s very fit.” Fisher has long been considered somewhat of a cricketing prodigy, having made his professional debut at just 15 years old when he played in a one-day game for Yorkshire against Leicestershire in 2013. Since then, injuries have prevented him from playing with any real regularity and in the seven years since his first-class debut in 2015 he has played just 21 matches with the red-ball. However, from those appearances he has an excellent record having taken 63 wickets at an average of 27.52. “He can bowl, let me tell you,” Gough said. “He’s a very impressive character, a very intelligent young man, very outspoken, but what else would you expect? He’s a Yorkshireman. “But, he’s got a lot of empathy with it, he’s a terrific leader of men and I think from all the young men I’ve met at Yorkshire he was one of the first that stood out to me. And I was thinking that later down the line this is a possible captain, even though he’s so young and he’s a bowler. But he has definitely got true character.” Uninterrupted ball-by-ball coverage of the West Indies vs England tour is live on talkSPORT 2 this month","image_url":null,"source_id":"talksport","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"From Stones To Selfies: Australian Cricket Fan's Tale In Pakistan","link":"https://sports.ndtv.com/cricket/from-stones-to-selfies-australian-super-fan-welcomed-in-pakistan-2829102","keywords":null,"creator":null,"video_url":null,"description":"Gillian is back in Pakistan with a small contingent of Australian fans on their first tour of the country in nearly a quarter of a century -- and has been blown away by the welcome they have received.","content":null,"pubDate":"2022-03-17 15:13:53","full_description":"When Australian cricket fan Luke Gillian last visited Pakistan in 1998, home supporters threw stones at him when he ventured out in public. These days everyone wants a selfie. Gillian is back in Pakistan with a small contingent of Australian fans on their first tour of the country in nearly a quarter of a century -- and has been blown away by the welcome they have received. Australia for 24 years, along with many international teams, declined to tour Pakistan on security grounds. The situation became worse after a fatal terror attack on the Sri Lanka team bus in Lahore in 2009, after which Pakistan had to play \"home\" games abroad for a decade, mostly in the United Arab Emirates. But the cricket-mad nation is lapping up the current tour by the world's top-ranked Test team, which will see the three-Test series go to a decider in Lahore next week after draws in Rawalpindi and Karachi. \"It was perceived to be too dangerous to go outside,\" Gillian said of his visit on Australia's last tour in 1998. \"When I did get outside there were large groups of people walking in the streets and I had rocks thrown at me. \"And I went, 'Nah, I am just going to go back home, I don't need to put up with this'.\" Nearly a quarter of a century later, attitudes have changed. \"I reckon, in Rawalpindi, 500 photographs were taken of me every day, easily,\" the 51-year-old from Victoria told AFP. Piece of cake \"I have been given I don't know how many cups of tea, how many pieces of cake, bottles of Pepsi, water and just little incidentals people have given us as a 'thank you' -- free haircuts, free laundry.\" Like most Australians, Gillian took to cricket as a child. \"You grow up with cricket in your blood,\" he said. \"You often hold a cricket bat or a ball before you know how to walk, and as soon as you can walk, you mark your run-up to bowl.\" Over the years he has visited every major cricket-playing nation -- even socialising with Australian greats such as Shane Warne, Adam Gilchrist, Michael Clarke and Justin Langer. But those days are a thing of the past, with modern players under intense social media scrutiny, coupled with strict anti-match fixing protocols to keep players away from \"undesirable\" elements such as illegal bookmakers. \"Now there is a strong disconnect between myself and the team,\" said Gillian. \"Let's go back 15 years... I would still get text messages (from players), saying: 'We are going to go for a beer in this place after the game, if you want to join us'. It's gone and I miss it,\" he said. Gillian said he decided to make this trip as much to support Pakistan's efforts to re-establish itself as a safe cricketing destination as to shout for Australia. \"I am here for the game, to show the outside world that we can actually watch cricket and travel to Pakistan and be safe, be happy and enjoy,\" he said. Socially this is so much more relaxed than it was 24 years ago. It is so much easier to be here. So much easier to enjoy Pakistan. \"I think that love, and the embrace of each other and the game itself, if that goes across to the wider audience, then it can sell the great game and sell the connect between the two nations and two cultures. Promoted \"Win or lose, it doesn't matter.\" (This story has not been edited by NDTV staff and is auto-generated from a syndicated feed.)","image_url":"https://c.ndtvimg.com/2022-03/neshut98_luke-gillian-afp_625x300_17_March_22.jpg?im=FeatureCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"SuperSport Park Centurion ODI records: List of batting and bowling stats and records in Centurion ODIs","link":"https://thesportsrush.com/cricket-news-supersport-park-centurion-odi-records-list-of-batting-and-bowling-stats-and-records-in-centurion-odis/","keywords":["Cricket","Bangladesh","Bangladesh tour of South Africa 2022","South Africa"],"creator":["Dixit Bhargav"],"video_url":null,"description":"SuperSport Park Centurion ODI records and stats: SuperSport Park will be hosting an ODI after 11 months tomorrow. Three ODIs and two Test matches of Bangladesh’s tour of South Africa 2022 will be the last leg of this South African summer. Having defeated India across formats, South Africa have all the reasons to believe that… The post SuperSport Park Centurion ODI records: List of batting and bowling stats and records in Centurion ODIs appeared first on The SportsRush.","content":"SuperSport Park Centurion ODI records and stats: SuperSport Park will be hosting an ODI after 11 months tomorrow. Three ODIs and two Test matches of Bangladesh’s tour of South Africa 2022 will be the last leg of this South African summer. Having defeated India across formats, South Africa have all the reasons to believe that they can emerge as the victorious side in the imminent ODI series. SuperSport Park, Centurion, will be hosting the first ODI on Friday. While this venue has hosted international cricket across formats this summer, local fans would be relieved at the prospect of a day-night ODI series. It is noteworthy all the three ODIs played against India earlier this year were day contests. South Africa, who have been part of 43 out of the 57 ODIs which Centurion has hosted in the last three decades, have won 26 and lost 15. Bangladesh, on the other hand, have never played an ODI at the SuperSport Park. Out of the nine ODIs that they’ve played in South Africa, Bangladesh have never won a match here. SuperSport Park Centurion ODI records Barring South Africa wicket-keeper batter Quinton de Kock (709), all other Top Five highest ODI run-scorers in Centurion are former South African players namely Hashim Amla (904), Graeme Smith (804), Jacques Kallis (781) and AB de Villiers (637). Below is the list of highest run-scorers at this venue among active players: Batters Matches Runs Highest Average SR 100 50 Quinton de Kock (SA) 10 709 178 70.9 113.98 4 1 Rilee Rossouw (SA) 3 284 132 94.66 111.37 1 2 Babar Azam (PAK) 3 266 103 88.66 103.1 1 2 Faf du Plessis (SA) 9 265 57 37.85 94.3 0 1 David Miller (SA) 11 225 56* 28.12 103.21 0 2 ALSO READ: When and where to watch South Africa vs Bangladesh 1st ODI? Much like the batting list, there’s a solitary active player among the highest wicket-takers in Centurion ODIs. The Top Five are Shaun Pollock (32), Dale Steyn (24), Wayne Parnell (23), Makhaya Ntini (16) and Alan Donald (15). Below is the list of highest wicket-takers at this venue among active players: Batters Matches Wickets Average Economy SR 4 Wayne Parnell (SA) 10 23 17.6 5.79 18.2 2 Kagiso Rabada (SA) 8 10 40.7 5.56 43.9 0 Yuzvendra Chahal (IND) 2 7 8.57 3.27 15.7 0 Ishant Sharma (IND) 3 7 18.85 5.17 21.8 0 Andile Phehlukwayo (SA) 8 7 39.85 6.2 38.5 1 Highest ODI innings totals at SuperSport Park As far as the highest ODI innings totals at the SuperSport Park are concerned, South Africa have been a consistent team in the list of Top Five ODI scores here. Team Score Opposition Year South Africa 392/6 Pakistan 2007 South Africa 384/6 Sri Lanka 2017 South Africa 361/5 West Indies 2015 South Africa 331/5 Zimbabwe 2009 South Africa 324/4 New Zealand 2000 The post SuperSport Park Centurion ODI records: List of batting and bowling stats and records in Centurion ODIs appeared first on The SportsRush.","pubDate":"2022-03-17 15:11:14","full_description":"SuperSport Park Centurion ODI records and stats: SuperSport Park will be hosting an ODI after 11 months tomorrow. Three ODIs and two Test matches of Bangladesh’s tour of South Africa 2022 will be the last leg of this South African summer. Having defeated India across formats, South Africa have all the reasons to believe that they can emerge as the victorious side in the imminent ODI series. SuperSport Park, Centurion, will be hosting the first ODI on Friday. While this venue has hosted international cricket across formats this summer, local fans would be relieved at the prospect of a day-night ODI series. It is noteworthy all the three ODIs played against India earlier this year were day contests. South Africa, who have been part of 43 out of the 57 ODIs which Centurion has hosted in the last three decades, have won 26 and lost 15. Bangladesh, on the other hand, have never played an ODI at the SuperSport Park. Out of the nine ODIs that they’ve played in South Africa, Bangladesh have never won a match here. Barring South Africa wicket-keeper batter Quinton de Kock (709), all other Top Five highest ODI run-scorers in Centurion are former South African players namely Hashim Amla (904), Graeme Smith (804), Jacques Kallis (781) and AB de Villiers (637). Below is the list of highest run-scorers at this venue among active players: ALSO READ: When and where to watch South Africa vs Bangladesh 1st ODI? Much like the batting list, there’s a solitary active player among the highest wicket-takers in Centurion ODIs. The Top Five are Shaun Pollock (32), Dale Steyn (24), Wayne Parnell (23), Makhaya Ntini (16) and Alan Donald (15). Below is the list of highest wicket-takers at this venue among active players: As far as the highest ODI innings totals at the SuperSport Park are concerned, South Africa have been a consistent team in the list of Top Five ODI scores here.","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Zondo earns maiden call-up for Bangladesh Tests | Cricbuzz.com - Cricbuzz - Cricbuzz","link":"https://news.google.com/__i/rss/rd/articles/CBMiWmh0dHBzOi8vbS5jcmljYnV6ei5jb20vY3JpY2tldC1uZXdzLzEyMTUxOS96b25kby1lYXJucy1tYWlkZW4tY2FsbC11cC1mb3ItYmFuZ2xhZGVzaC10ZXN0c9IBaWh0dHA6Ly9tLmNyaWNidXp6LmNvbS9hbXAvY3JpY2tldC1uZXdzLzEyMTUxOS96b25kby1lYXJucy1tYWlkZW4tY2FsbC11cC1mb3ItYmFuZ2xhZGVzaC10ZXN0cy1jcmljYnV6emNvbQ?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Zondo earns maiden call-up for Bangladesh Tests | Cricbuzz.com - Cricbuzz  Cricbuzz\"CSA Not At Liberty To Refuse\": South Africa's IPL Contracted Players To Skip Bangladesh Test Series..  NDTV SportsSouth Africa announce second-string squad for Bangladesh Tests  CricTrackerNo IPL-Bound Players Included As South Africa Announce Squad For Test Series vs Bangladesh  Cricket AddictorIPL 2022: \"Had no option\" - CSA chief on SA stars preferring IPL  InsideSportView Full coverage on Google News","content":null,"pubDate":"2022-03-17 14:03:05","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"\"CSA Not At Liberty To Refuse\": South Africa's IPL Contracted Players To Skip Bangladesh Test Series.. - NDTV Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMieWh0dHBzOi8vc3BvcnRzLm5kdHYuY29tL2lwbC0yMDIyL3NvdXRoLWFmcmljYXMtaXBsLWNvbnRyYWN0ZWQtcGxheWVycy10by1za2lwLWJhbmdsYWRlc2gtdGVzdC1zZXJpZXMtY29uZmlybXMtY3NhLTI4Mjg4OTPSAX9odHRwczovL3Nwb3J0cy5uZHR2LmNvbS9pcGwtMjAyMi9zb3V0aC1hZnJpY2FzLWlwbC1jb250cmFjdGVkLXBsYXllcnMtdG8tc2tpcC1iYW5nbGFkZXNoLXRlc3Qtc2VyaWVzLWNvbmZpcm1zLWNzYS0yODI4ODkzL2FtcC8x?oc=5","keywords":null,"creator":null,"video_url":null,"description":"\"CSA Not At Liberty To Refuse\": South Africa's IPL Contracted Players To Skip Bangladesh Test Series..  NDTV SportsZondo earns maiden call-up for Bangladesh Tests | Cricbuzz.com - Cricbuzz  CricbuzzNo IPL-Bound Players Included As South Africa Announce Squad For Test Series vs Bangladesh  Cricket AddictorIPL 2022: \"Had no option\" - CSA chief on SA stars preferring IPL  InsideSportDean Elgar worst fears come true as stars pick IPL over Bangladesh Tests | Cricbuzz.com - Cricbuzz  CricbuzzView Full coverage on Google News","content":null,"pubDate":"2022-03-17 13:58:47","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Ashwin on Mankading: Bowlers should not have any second thoughts now","link":"https://www.indiatvnews.com/sports/cricket/ipl-2022-ashwin-on-mankading-bowlers-should-not-have-any-second-thoughts-now-after-mcc-amends-cricket-law-2022-03-17-764837","keywords":null,"creator":null,"video_url":null,"description":"Star India off-spinner Ravichandran Ashwin has welcomed MCC's decision to amend its laws regarding run-out at the non striker's end, saying bowlers now should not have any \"second thoughts\" in dismissing the batter if he steps out before the delivery is released. Custodians of cricket laws, the Marylebone Cricket Club earlier this month re-classified the controversial runout, from law 41's 'unfair play' and incorporated it within law 38 pertaining to legitimate run-outs. It's one of the nine changes that the MCC made to its code, which is set to come into effect from October this year. Ashwin said the decision to not run-out the bowler's end batter can have a career-destroying impact. \"My dear fellow bowlers, please understand. The extra step the non-striker is taking might end up destroying your entire career,\" Ashwin, who had ignited a debate about the tactic's legitimacy by dismissing England's Jos Buttler in an Indian Premier League match in 2019, said in a Youtube video. \"If the non-striker ends up on strike because of that extra step he is taking, he might smash a six. Whereas the current striker might have gotten out. If you take a wicket, you will grow in your career, whereas if you are smashed for a six, your career may go downwards. So the impact is huge. \"So, the bowlers should not have any second thoughts on running the non-striker out is my opinion. The non-striker is very specific on the non-striker not taking that extra yard before the bowler delivers the ball. They are giving the allowance to the bowler. This is the significance of the rule.\" Having faced criticism all these years for his controversial bowler's end run-out of Buttler, Ashwin hoped people would stop ridiculing him now, especially now that he has become a teammate of the English allrounder at the Rajasthan Royals. \"During my school days, if a guy was interested in a girl, their friends would shout the guy's name when the girl passed by. Likewise, when I'm playing, the crowd is shouting 'Buttler, Buttler' when they see me. Why do you guys do that? We are now teammates, guys. \"Non-striker leaving the crease early is the actual unfair play in this whole scenario, not the bowler running them out,\" said Ashwin, who was picked by Rajasthan Royals for Rs 5 crore for the upcoming IPL. The dismissal came to be known as \"Mankad run-out\" after the legendary former India allrounder Vinoo Mankad twice ran out Australia opener Bill Brown at the non-striker's end -- once in a tour game against an Australia XI at the SCG in 1947, and then again in the second Test of the ensuing series. \"It has been changed now to run out. They (MCC) have destigmatized the entire concept and have termed it a run-out law. The bowler was earlier expected to give a warning when the batter leaves the crease at the non-striker's end,\" Ashwin said. \"Now they have announced that what the non-striker is doing is wrong and, therefore, bowlers can actually run them out if the non-striker tries to leave the crease before the ball is delivered by the bowler. \"Bowlers used to feel bad about doing this, wondering how our team batters would feel and what the cricketing world would think if we did it. So, thinking about these consequences, they used not to run them out.\"","content":null,"pubDate":"2022-03-17 13:58:43","full_description":"Star India off-spinner Ravichandran Ashwin has welcomed MCC's decision to amend its laws regarding run-out at the non striker's end, saying bowlers now should not have any \"second thoughts\" in dismissing the batter if he steps out before the delivery is released. Custodians of cricket laws, the Marylebone Cricket Club earlier this month re-classified the controversial runout, from law 41's 'unfair play' and incorporated it within law 38 pertaining to legitimate run-outs. It's one of the nine changes that the MCC made to its code, which is set to come into effect from October this year. Ashwin said the decision to not run-out the bowler's end batter can have a career-destroying impact. \"My dear fellow bowlers, please understand. The extra step the non-striker is taking might end up destroying your entire career,\" Ashwin, who had ignited a debate about the tactic's legitimacy by dismissing England's in an Indian Premier League match in 2019, said in a Youtube video. \"If the non-striker ends up on strike because of that extra step he is taking, he might smash a six. Whereas the current striker might have gotten out. If you take a wicket, you will grow in your career, whereas if you are smashed for a six, your career may go downwards. So the impact is huge. \"So, the bowlers should not have any second thoughts on running the non-striker out is my opinion. The non-striker is very specific on the non-striker not taking that extra yard before the bowler delivers the ball. They are giving the allowance to the bowler. This is the significance of the rule.\" Having faced criticism all these years for his controversial bowler's end run-out of Buttler, Ashwin hoped people would stop ridiculing him now, especially now that he has become a teammate of the English allrounder at the Rajasthan Royals. \"During my school days, if a guy was interested in a girl, their friends would shout the guy's name when the girl passed by. Likewise, when I'm playing, the crowd is shouting 'Buttler, Buttler' when they see me. Why do you guys do that? We are now teammates, guys. \"Non-striker leaving the crease early is the actual unfair play in this whole scenario, not the bowler running them out,\" said Ashwin, who was picked by Rajasthan Royals for Rs 5 crore for the upcoming . The dismissal came to be known as \"Mankad run-out\" after the legendary former India allrounder Vinoo Mankad twice ran out Australia opener Bill Brown at the non-striker's end -- once in a tour game against an Australia XI at the SCG in 1947, and then again in the second Test of the ensuing series. \"It has been changed now to run out. They (MCC) have destigmatized the entire concept and have termed it a run-out law. The bowler was earlier expected to give a warning when the batter leaves the crease at the non-striker's end,\" Ashwin said. \"Now they have announced that what the non-striker is doing is wrong and, therefore, bowlers can actually run them out if the non-striker tries to leave the crease before the ball is delivered by the bowler. \"Bowlers used to feel bad about doing this, wondering how our team batters would feel and what the cricketing world would think if we did it. So, thinking about these consequences, they used not to run them out.\"","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL 2022: Steyn arrives in India to start new chapter as SRH bowling coach","link":"https://www.indiatvnews.com/sports/cricket/ipl-2022-steyn-arrives-in-india-to-start-new-chapter-as-srh-bowling-coach-2022-03-17-764835","keywords":null,"creator":null,"video_url":null,"description":"South African pace legend Dale Steyn on Thursday arrived in India to kickstart his new journey as the bowling coach of Sunrisers Hyderabad in the Indian Premier League beginning here on March 26. The 38-year-old, who hung his bowling shoes last August, will join the SRH coaching staff that comprises head coach Tom Moody, batting coach Brian Lara, and spin bowling coach Muttiah Muralitharan. \"Yeah, very happy to be back. I've been in India for quite some time so I'm quite excited to be back. Just driving from the airport brought back so many memories,\" Steyn, who has taken 97 wickets in 95 matches for Sunrisers Hyderabad, said in a video posted by the franchise on twitter. \"I've been here before, whether with the South African or IPL teams, so I'm excited. A new role for me, a coaching role which I'm really excited about. It's a whole new role looking at the players, which is fantastic. I'm looking forward to hitting the ground running. Steyn, who retired from Test cricket in 2019, had a commentary stint at the T20 World Cup after calling time on his international career in August. \"I was doing some commentary not so long ago with a jacket and a tie and I felt I should in the ground in shorts and t-shirts and cricket shoes. So, I am happy to be back in that kind of role and I'm looking forward to what the next couple of weeks hold,\" he said. SRH had parted ways with Trevor Bayliss after the team finished at the bottom of the IPL points table with just three wins last year. The franchise decided to retain captain Kane Williamson along with batter Abdul Samad and young Kashmiri speedster Umran Malik. Sunrisers Hyderabad will start their 2022 IPL campaign with a clash against Rajasthan Royals on March 29 at the Maharashtra Cricket Association Stadium in Pune.","content":null,"pubDate":"2022-03-17 13:49:26","full_description":"South African pace legend on Thursday arrived in India to kickstart his new journey as the bowling coach of Sunrisers Hyderabad in the Indian Premier League beginning here on March 26. The 38-year-old, who hung his bowling shoes last August, will join the SRH coaching staff that comprises head coach Tom Moody, batting coach Brian Lara, and spin bowling coach Muttiah Muralitharan. \"Yeah, very happy to be back. I've been in India for quite some time so I'm quite excited to be back. Just driving from the airport brought back so many memories,\" Steyn, who has taken 97 wickets in 95 matches for Sunrisers Hyderabad, said in a video posted by the franchise on twitter. \"I've been here before, whether with the South African or teams, so I'm excited. A new role for me, a coaching role which I'm really excited about. It's a whole new role looking at the players, which is fantastic. I'm looking forward to hitting the ground running. Steyn, who retired from Test cricket in 2019, had a commentary stint at the T20 World Cup after calling time on his international career in August. \"I was doing some commentary not so long ago with a jacket and a tie and I felt I should in the ground in shorts and t-shirts and cricket shoes. So, I am happy to be back in that kind of role and I'm looking forward to what the next couple of weeks hold,\" he said. SRH had parted ways with Trevor Bayliss after the team finished at the bottom of the IPL points table with just three wins last year. The franchise decided to retain captain along with batter Abdul Samad and young Kashmiri speedster Umran Malik. Sunrisers Hyderabad will start their 2022 IPL campaign with a clash against Rajasthan Royals on March 29 at the Maharashtra Cricket Association Stadium in Pune.","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"South Africa vs Bangladesh 1st ODI Live Telecast Channel in India and South Africa: When and where to watch SA vs BAN Centurion ODI?","link":"https://thesportsrush.com/cricket-news-south-africa-vs-bangladesh-1st-odi-live-telecast-channel-in-india-and-south-africa-when-and-where-to-watch-sa-vs-ban-centurion-odi/","keywords":["Cricket","Bangladesh","Bangladesh tour of South Africa 2022","South Africa"],"creator":["Dixit Bhargav"],"video_url":null,"description":"South Africa vs Bangladesh 1st ODI Live Telecast: The SportsRush presents before you the timing and live streaming details of the 1st SA vs BAN ODI. The first ODI of the ongoing Bangladesh’s tour of South Africa will be played at the SuperSport Park tomorrow. Centurion, which had hosted international cricket across formats last year,… The post South Africa vs Bangladesh 1st ODI Live Telecast Channel in India and South Africa: When and where to watch SA vs BAN Centurion ODI? appeared first on The SportsRush.","content":"South Africa vs Bangladesh 1st ODI Live Telecast: The SportsRush presents before you the timing and live streaming details of the 1st SA vs BAN ODI. The first ODI of the ongoing Bangladesh’s tour of South Africa will be played at the SuperSport Park tomorrow. Centurion, which had hosted international cricket across formats last year, will also be hosting the third ODI on March 23. Having faced each other last in this format during the ICC Cricket World Cup 2019 in England, South Africa and Bangladesh will be locking horns after almost three years. In what will be the sixth bilateral ODI series between these two teams, South Africa have won four and lost one in the past. However, the Proteas have never lost an ODI against Bangladesh at home. Touring South Africa after almost five years, a first-choice Bangladesh squad would be eager to register an elusive ODI victory here. South Africa vs Bangladesh 1st ODI Live Telecast Channel in India and South Africa Star Sports Network are broadcasting the live streaming of Bangladesh’s tour of South Africa 2022 in India. Unlike the case during India’s tour of South Africa earlier this year, multiple channels in multiple languages won’t be televising this series. Centurion ODI between South Africa and Bangladesh will be televised on Star Sports First in India which is most likely to comprise of only commentary in only English. Online users can stream the match on Star’s streaming application named Disney+Hotstar. It is worth mentioning that the match won’t be available on any other streaming platform in India. Heading to South Africa. Keep me in your prayers. #SAvBAN pic.twitter.com/Uhotmlgnxv — Mustafizur Rahman (@Mustafiz90) March 11, 2022 As far as the fans in South Africa are concerned, they will be able to watch this ODI on their televisions by tuning in to tried and tested SuperSport. Local fans in Bangladesh are likely to be able to watch this series on T Sports. Date – 18/03/2022 (Wednesday). Match start Time – 01:00 PM (South Africa), 04:30 PM (India) and 05:00 PM (Bangladesh). TV Channel – Star Sports First (India), SuperSport (South Africa) and T Sports (Bangladesh). Online platform – Disney+Hotstar (India). The post South Africa vs Bangladesh 1st ODI Live Telecast Channel in India and South Africa: When and where to watch SA vs BAN Centurion ODI? appeared first on The SportsRush.","pubDate":"2022-03-17 13:28:56","full_description":"South Africa vs Bangladesh 1st ODI Live Telecast: The SportsRush presents before you the timing and live streaming details of the 1st SA vs BAN ODI. The first ODI of the ongoing Bangladesh’s tour of South Africa will be played at the SuperSport Park tomorrow. Centurion, which had hosted international cricket across formats last year, will also be hosting the third ODI on March 23. Having faced each other last in this format during the ICC Cricket World Cup 2019 in England, South Africa and Bangladesh will be locking horns after almost three years. In what will be the sixth bilateral ODI series between these two teams, South Africa have won four and lost one in the past. However, the Proteas have never lost an ODI against Bangladesh at home. Touring South Africa after almost five years, a first-choice Bangladesh squad would be eager to register an elusive ODI victory here. Star Sports Network are broadcasting the live streaming of Bangladesh’s tour of South Africa 2022 in India. Unlike the case during India’s tour of South Africa earlier this year, multiple channels in multiple languages won’t be televising this series. Centurion ODI between South Africa and Bangladesh will be televised on Star Sports First in India which is most likely to comprise of only commentary in only English. Online users can stream the match on Star’s streaming application named Disney+Hotstar. It is worth mentioning that the match won’t be available on any other streaming platform in India. Heading to South Africa. Keep me in your prayers. #SAvBAN pic.twitter.com/Uhotmlgnxv — Mustafizur Rahman (@Mustafiz90) March 11, 2022 As far as the fans in South Africa are concerned, they will be able to watch this ODI on their televisions by tuning in to tried and tested SuperSport. Local fans in Bangladesh are likely to be able to watch this series on T Sports. Date – 18/03/2022 (Wednesday). Match start Time – 01:00 PM (South Africa), 04:30 PM (India) and 05:00 PM (Bangladesh). TV Channel – Star Sports First (India), SuperSport (South Africa) and T Sports (Bangladesh). Online platform – Disney+Hotstar (India).","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"“They’re a world-class side, so we do our homework on them”: Tahlia McGrath opens up ahead of ICC Women’s World Cup match against India","link":"https://thesportsrush.com/cricket-news-theyre-a-world-class-side-so-we-do-our-homework-on-them-tahlia-mcgrath-opens-up-ahead-of-icc-womens-world-cup-game-against-india/","keywords":["Cricket","IND W vs AUS W","Tahlia McGrath"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"Australian all-rounder Tahlia McGrath called India “World Class” ahead of ICC Women’s World Cup game against India in Auckland. The Women’s World Cup 2022 has reached its halfway stage, and we have seen some incredible games this year. India Women will take on Australia in an all-important match on 19 March 2022. Australia Women came… The post “They’re a world-class side, so we do our homework on them”: Tahlia McGrath opens up ahead of ICC Women’s World Cup match against India appeared first on The SportsRush.","content":"Australian all-rounder Tahlia McGrath called India “World Class” ahead of ICC Women’s World Cup game against India in Auckland. The Women’s World Cup 2022 has reached its halfway stage, and we have seen some incredible games this year. India Women will take on Australia in an all-important match on 19 March 2022. Australia Women came in the tournament as the favourites, and they have won all four of their games. India Women, on the other hand, have just won a couple of their four games. The Australian women have certainly fixed their spots in the knockouts, whereas the Indian team is still hanging on. The Indian team toured Australia for a multi-format series in September-October 2021. India Women managed to win just one ODI on the entire tour. In terms of head to head, the Aussie side has an incredible record. Australia’s Rachael Haynes is currently the highest run-scorer of the ICC Women’s World Cup. Tahlia McGrath calls India a “World Class” side Australia’s all-rounder Tahlia McGrath opened up in media before the game against India. India eliminated Australia in the 2017 Cricket World Cup, and the Australian team was criticized a lot as well. Both teams faced each other in the historic ICC T20 World Cup 2022 final at the MCG as well, where Australia won the title. In recent history, the Australian team certainly has had an edge over India. McGrath said that despite the recent success, India is a world-class team and anything can happen in the game. “We’ve had a fair bit of success against them in the recent India series but [it’s a] new location, new tournament, so anything can happen,” McGrath said in Auckland. “They’re a world-class side, so we do our homework on them.” Hard to believe it’s Tahlia McGrath’s first World Cup experience, but safe to say she’s loving every minute! #CWC22 #TeamAustralia pic.twitter.com/tt6DxgINUy — Australian Women’s Cricket Team (@AusWomenCricket) March 17, 2022 Tahlia McGrath insists that they will take this game as just another one, and they won’t have any special approach for it. The Australians are playing a brilliant brand of cricket, and McGrath is satisfied with the same. “So we’re just pretty simple with our approach. Take every game as it comes and play the type of cricket that we want to play. So we’re really happy with the brand we’re playing at moment and hopefully more to come,” Tahlia McGrath said. If India can turn the table and beat the Australian team, they will almost ensure their place in the knockouts. In the case of a defeat, the India vs South Africa game can be a potential virtual knockout for the Indian team. The post “They’re a world-class side, so we do our homework on them”: Tahlia McGrath opens up ahead of ICC Women’s World Cup match against India appeared first on The SportsRush.","pubDate":"2022-03-17 12:00:35","full_description":"Australian all-rounder Tahlia McGrath called India “World Class” ahead of ICC Women’s World Cup game against India in Auckland. The Women’s World Cup 2022 has reached its halfway stage, and we have seen some incredible games this year. India Women will take on Australia in an all-important match on 19 March 2022. Australia Women came in the tournament as the favourites, and they have won all four of their games. India Women, on the other hand, have just won a couple of their four games. The Australian women have certainly fixed their spots in the knockouts, whereas the Indian team is still hanging on. The Indian team toured Australia for a multi-format series in September-October 2021. India Women managed to win just one ODI on the entire tour. In terms of head to head, the Aussie side has an incredible record. Australia’s Rachael Haynes is currently the highest run-scorer of the ICC Women’s World Cup. Australia’s all-rounder Tahlia McGrath opened up in media before the game against India. India eliminated Australia in the 2017 Cricket World Cup, and the Australian team was criticized a lot as well. Both teams faced each other in the historic ICC T20 World Cup 2022 final at the MCG as well, where Australia won the title. In recent history, the Australian team certainly has had an edge over India. McGrath said that despite the recent success, India is a world-class team and anything can happen in the game. “We’ve had a fair bit of success against them in the recent India series but [it’s a] new location, new tournament, so anything can happen,” McGrath said in Auckland. “They’re a world-class side, so we do our homework on them.” Hard to believe it’s Tahlia McGrath’s first World Cup experience, but safe to say she’s loving every minute! #CWC22 #TeamAustralia pic.twitter.com/tt6DxgINUy — Australian Women’s Cricket Team 🏏 (@AusWomenCricket) March 17, 2022 Tahlia McGrath insists that they will take this game as just another one, and they won’t have any special approach for it. The Australians are playing a brilliant brand of cricket, and McGrath is satisfied with the same. “So we’re just pretty simple with our approach. Take every game as it comes and play the type of cricket that we want to play. So we’re really happy with the brand we’re playing at moment and hopefully more to come,” Tahlia McGrath said. If India can turn the table and beat the Australian team, they will almost ensure their place in the knockouts. In the case of a defeat, the India vs South Africa game can be a potential virtual knockout for the Indian team.","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"SA vs BAN Head to Head Record in ODIs | South Africa vs Bangladesh Stats | SuperSport Park ODI","link":"https://thesportsrush.com/cricket-news-sa-vs-ban-head-to-head-record-in-odis-south-africa-vs-bangladesh-stats-supersport-park-odi/","keywords":["Cricket","Bangladesh","Bangladesh tour of South Africa 2022","South Africa"],"creator":["Dixit Bhargav"],"video_url":null,"description":"SA vs BAN Head to Head Record: The SportsRush presents for you the Head to Head statistics for the first SA vs BAN ODI. Bangladesh’s tour of South Africa 2022 will kick-start with the first ODI to be played in Centurion tomorrow. Other than a three-match ODI series, Bangladesh will also be taking part in… The post SA vs BAN Head to Head Record in ODIs | South Africa vs Bangladesh Stats | SuperSport Park ODI appeared first on The SportsRush.","content":"SA vs BAN Head to Head Record: The SportsRush presents for you the Head to Head statistics for the first SA vs BAN ODI. Bangladesh’s tour of South Africa 2022 will kick-start with the first ODI to be played in Centurion tomorrow. Other than a three-match ODI series, Bangladesh will also be taking part in a two-match Test series in South Africa. While the Test series is almost certain of being played without a few star players from the home team, both the teams will field a full-strength side during ODI series in Centurion (first and third ODI) and Johannesburg (second ODI). South Africa, who have enjoyed their time in international cricket on the back of crucial victories across formats against top oppositions in the last few months, will doubtlessly start this series as favourites. As far as past numbers are concerned, their stellar head-to-head ODI record against Bangladesh witnesses them maintaining an unbeaten spree at home. Furthermore, the first ODI of their previous five bilateral series has always been won by South Africa. Bangladesh team training at Centurion (16 March 2022)#BCB #Cricket pic.twitter.com/INoZcowG5y — Bangladesh Cricket (@BCBtigers) March 16, 2022 Having said that, the last South Africa vs Bangladesh ODI had resulted in a 21-run Bangladeshi victory. Chasing a 331-run target in an ICC Cricket World Cup 2019 match at The Oval, South Africa were reduced to 309/8 in 50 overs. In what was a dream World Cup for him, all-rounder Shakib Al Hasan had won the match award for his all-round contribution (75 and 1/50). SA vs BAN Head to Head Record in ODIs Total number of matches played: 21 Matches won by SA: 17 Matches won by BAN: 4 Matches played in South Africa: 9 (SA 9, BAN 0) Matches played in Bangladesh: 9 (SA 7, BAN 2) Most runs for SA: 354 (Quinton de Kock) Most runs for BAN: 397 (Shakib Al Hasan) Most wickets for SA: 13 (Kagiso Rabada) Most wickets for BAN: 13 (Shakib Al Hasan) Most catches for SA: 7 (Quinton de Kock) Most catches for BAN: 6 (Mushfiqur Rahim) NOTE: Only players part of current squads have been considered above (most runs, wickets and catches). The post SA vs BAN Head to Head Record in ODIs | South Africa vs Bangladesh Stats | SuperSport Park ODI appeared first on The SportsRush.","pubDate":"2022-03-17 11:55:26","full_description":"SA vs BAN Head to Head Record: The SportsRush presents for you the Head to Head statistics for the first SA vs BAN ODI. Bangladesh’s tour of South Africa 2022 will kick-start with the first ODI to be played in Centurion tomorrow. Other than a three-match ODI series, Bangladesh will also be taking part in a two-match Test series in South Africa. While the Test series is almost certain of being played without a few star players from the home team, both the teams will field a full-strength side during ODI series in Centurion (first and third ODI) and Johannesburg (second ODI). South Africa, who have enjoyed their time in international cricket on the back of crucial victories across formats against top oppositions in the last few months, will doubtlessly start this series as favourites. As far as past numbers are concerned, their stellar head-to-head ODI record against Bangladesh witnesses them maintaining an unbeaten spree at home. Furthermore, the first ODI of their previous five bilateral series has always been won by South Africa. Bangladesh team training at Centurion (16 March 2022) #BCB #Cricket pic.twitter.com/INoZcowG5y — Bangladesh Cricket (@BCBtigers) March 16, 2022 Having said that, the last South Africa vs Bangladesh ODI had resulted in a 21-run Bangladeshi victory. Chasing a 331-run target in an ICC Cricket World Cup 2019 match at The Oval, South Africa were reduced to 309/8 in 50 overs. In what was a dream World Cup for him, all-rounder Shakib Al Hasan had won the match award for his all-round contribution (75 and 1/50). Total number of matches played: 21 Matches won by SA: 17 Matches won by BAN: 4 Matches played in South Africa: 9 (SA 9, BAN 0) Matches played in Bangladesh: 9 (SA 7, BAN 2) Most runs for SA: 354 (Quinton de Kock) Most runs for BAN: 397 (Shakib Al Hasan) Most wickets for SA: 13 (Kagiso Rabada) Most wickets for BAN: 13 (Shakib Al Hasan) Most catches for SA: 7 (Quinton de Kock) Most catches for BAN: 6 (Mushfiqur Rahim) NOTE: Only players part of current squads have been considered above (most runs, wickets and catches).","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Sangakkara: Royals has two best spinners of the IPL in Ashwin, Chahal","link":"https://sportstar.thehindu.com/cricket/ipl/rajasthan-royals-sangakkara-ashwin-chahal-jos-buttler-ipl-2022-news-cricket/article38457547.ece","keywords":null,"creator":["P.K. Ajith Kumar"],"video_url":null,"description":"Rajasthan Royals director of cricket and head coach Kumar Sangakkara's objective for the new season is to win the trophy.","content":null,"pubDate":"2022-03-17 11:37:51","full_description":"Kumar Sangakkara believes the Rajasthan Royals management has succeeded in putting together an exciting and strong squad for the 15th edition of the IPL. “We know we had quite a bit of work to do in the off-season with regards to our team,\" said Sangakkara, the director of cricket and head coach at Royals. “I think we managed to identify the key areas which needed our attention and having had a proper process when it comes to selecting players at the auction, we managed to kind of hit the markers that we set for ourselves. I think the franchise has done an amazing job to put this exciting and strong squad together.” READ| Zaheer: Rohit Sharma is a player's captain He is excited about the new signings such as R. Ashwin and Yuzvendra Chahal. “We’ve got the two best spinners in the IPL in terms of off-spin and leg-spin in Chahal and Ashwin,” the Lankan batting legend said. “We have (Trent) Boult, Prasidh (Krishna), (Navdeep) Saini, (Nathan) Coulter-Nile and (Obed) McCoy, who make up for a very exciting pace unit supported by of course the retentions of (batters) Yashasvi (Jaiswal), (Sanju) Samson and (Jos) Buttler. We have secured depth in every department, with (James) Neesham, (Daryl) Mitchell and (Rassie) van der Dussen being exciting cricketers.” READ| IPL 2022 new rules: Two DRS referrals per innings; stringent penalties for bubble breach Sangakkara said the Royals’ objectives for the new season was to win the trophy and play good cricket. “We have our own performance metrics that we’ll match each individual's and the team’s performance after each match,” he said. He also paid homage to Shane Warne, who had led Royals to its only IPL title, in the tournament’s inaugural edition in 2008. “He's a great loss for the cricket world, a great loss for cricketers around the world, because he was such an approachable guy, who had great knowledge,” Sangakkara said. “He was a very good friend, and I really enjoyed my time with him, the conversations we used to have. I think everyone will miss him.”","image_url":null,"source_id":"sportstar","country":["india"],"category":["sports"],"language":"english"},{"title":"In one-day series, Bangladesh seek to end South Africa drought","link":"https://sportstar.thehindu.com/cricket/in-one-day-series-bangladesh-seek-to-end-south-africa-drought-cricket/article38457555.ece","keywords":null,"creator":["AFP"],"video_url":null,"description":"Bangladesh has a settled one-day side and currently is on top of the International Cricket Council's World Cup Super League, while South Africa are languishing in tenth place.","content":null,"pubDate":"2022-03-17 11:37:38","full_description":"Bangladesh has lost every match across all formats that it has played in South Africa - but go into a one-day series against the Proteas on Friday with reasonable hopes of ending the drought. The series opens with a day-night game at SuperSport Park in Centurion on Friday. Bangladesh has a settled one-day side and currently is on top of the International Cricket Council's World Cup Super League, while South Africa are languishing in tenth place. READ | Zaheer: Rohit Sharma is a player's captain The tourist has batting depth, especially since star all-rounder Shakib Al Hasan reversed an earlier decision to take a break from the game. They also have local knowledge in the form of three South Africans in head coach Russell Domingo, who previously coached South Africa, bowling coach Allan Donald and power-hitting coach Albie Morkel. South Africa, though, will be at full strength and will be backing their fast bowlers to capitalise on the pace and bounce that is a feature of the pitches at Centurion and the Wanderers in Johannesburg, the two venues for the series. The log table may not be a true reflection of the respective strength of the teams given the disparity in the number of matches played and the quality of opposition but South Africa will be keen to climb up the standings. Only the seven top teams plus host India qualify automatically for the 2023 World Cup. South Africa has made a poor start to its Super League campaign, losing at home to Pakistan and away to Sri Lanka, while it was only able to share a series in Ireland, with one match rained off. READ | 'The Hundred' draft pushed back to avoid clash with Warne's state funeral It also had a weather-induced no-result against the Netherlands, leaving them with plenty of ground to make up. Bangladesh, by contrast, has won series against West Indies, Sri Lanka, Zimbabwe and Afghanistan with its only series defeat coming in New Zealand, where it lost all three matches. The one-day series will be followed by two Test matches in which South Africa are likely to be without several key players. The Tests clash with the lucrative Indian Premier League and South Africa's IPL players, given the option of choosing where to play, are expected to head to India after the one-day games. Squads: South Africa: Temba Bavuma (captain), Keshav Maharaj (vice-captain), Quinton de Kock (wkt), Zubayr Hamza, Marco Jansen, Janneman Malan, Aiden Markram, David Miller, Lungi Ngidi, Wayne Parnell, Andile Phehlukwayo, Dwaine Pretorius, Kagiso Rabada, Tabraiz Shamsi, Rassie van der Dussen, Kyle Verreynne. Bangladesh: Tamim Iqbal (captain), Afif Hossain, Ebadot Hossain, Khaled Ahmed, Litton Das (wkt), Mahmudul Hasan Joy, Mahmudullah, Mehidy Hasan, Mushfiqur Rahim (wkt), Mustafizur Rahman, Najmul Hossain Shanto, Nasum Ahmed, Shakib Al Hasan, Shoriful Islam, Taskin Ahmed, Yasir Ali. Fixtures: March 18, Centurion (day/night) March 20, Johannesburg (day) March 23, Centurion (day/night)","image_url":null,"source_id":"sportstar","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL 2022: Sangakkara confident of Rajasthan Royals' turnaround with Ashwin, Chahal in squad","link":"https://www.indiatvnews.com/sports/cricket/ipl-2022-sangakkara-confident-of-rajasthan-royals-turnaround-with-ashwin-chahal-in-squad-2022-03-17-764812","keywords":null,"creator":null,"video_url":null,"description":"Rajasthan Royals director of cricket and head coach Kumar Sangakkara believes they have a \"very competent\" squad at their disposal to script a turnaround after three dismal IPL seasons. Rajasthan finished 7th, 8th and 7th in the last three seasons. The IPL's upcoming edition begins on March 26. \"We know we had quite a bit of work to do in the off-season with regards to our team. I think we managed to identify the key areas which needed our attention and having had a proper process when it comes to selecting players at the auction, we managed to kind of hit the markers that we set for ourselves,\" said the Sri Lankan legend in a team statement. \"I think the franchise has done an amazing job to put this exciting and strong squad together,\" he added. Commenting on the make-up of his squad, Sangakkara said the presence of Yuzvendra Chahal and R Ashwin will make a huge difference. \"We've got the two best spinners in the IPL in terms of off-spin and leg-spin in Chahal and Ashwin. We have Boult, Prasidh, Saini, Coulter-Nile, McCoy, which makes up for a very exciting pace unit supported by of course the retentions of Yashasvi, Samson and Buttler. \"We have secured depth in every department, with Neesham, Mitchell and van der Dussen being exciting cricketers. We've got some really exciting and young cricketers from India as well. The main thing is that we have a very competent side. We tried to get the core right and get the right players for the roles. \"But now, the main thing irrespective of what the squad is, is actual match performance on the field, and how we can give everyone the freedom to go out there and perform,\" expressed Sangakkara. Asked what the team learned from last season's disappointing second part of the campaign, Kumar said, \"I think there were a lot of different reasons for that, not just one or two. \"Whether it was player availability, split tournament, bigger break, and not the best of match performances in terms of batting or bowling. But that is all in the past now, and that's why the squad has changed.\" Explaining the additions of his compatriot Lasith Malinga and Paddy Upton to the Royals' coaching staff, the former Sri Lankan captain added: \"My job really is to add value to the franchise through myself or through people that I would recommend. \"It's first about what value that person brings and how constantly they can help us improve. It's pretty obvious for everyone to see the standards of both Lasith and Paddy. They've had stellar careers with their respective teams in their jobs and can prove to be vital elements in our quest for the title.\" He also paid tribute to former Royals captain Shane Warne, who passed away earlier this month. \"He's a great loss for the cricket world, a great loss for cricketers around the world, because he was such an approachable guy, who had great knowledge. He was a very good friend, and I really enjoyed my time with him, the conversations we used to have. I think everyone will miss him.\"","content":null,"pubDate":"2022-03-17 11:27:36","full_description":"Rajasthan Royals director of cricket and head coach Kumar Sangakkara believes they have a \"very competent\" squad at their disposal to script a turnaround after three dismal seasons. Rajasthan finished 7th, 8th and 7th in the last three seasons. The IPL's upcoming edition begins on March 26. \"We know we had quite a bit of work to do in the off-season with regards to our team. I think we managed to identify the key areas which needed our attention and having had a proper process when it comes to selecting players at the auction, we managed to kind of hit the markers that we set for ourselves,\" said the Sri Lankan legend in a team statement. \"I think the franchise has done an amazing job to put this exciting and strong squad together,\" he added. Commenting on the make-up of his squad, Sangakkara said the presence of and R Ashwin will make a huge difference. \"We've got the two best spinners in the IPL in terms of off-spin and leg-spin in Chahal and Ashwin. We have Boult, Prasidh, Saini, Coulter-Nile, McCoy, which makes up for a very exciting pace unit supported by of course the retentions of Yashasvi, Samson and Buttler. \"We have secured depth in every department, with Neesham, Mitchell and van der Dussen being exciting cricketers. We've got some really exciting and young cricketers from India as well. The main thing is that we have a very competent side. We tried to get the core right and get the right players for the roles. \"But now, the main thing irrespective of what the squad is, is actual match performance on the field, and how we can give everyone the freedom to go out there and perform,\" expressed Sangakkara. Asked what the team learned from last season's disappointing second part of the campaign, Kumar said, \"I think there were a lot of different reasons for that, not just one or two. \"Whether it was player availability, split tournament, bigger break, and not the best of match performances in terms of batting or bowling. But that is all in the past now, and that's why the squad has changed.\" Explaining the additions of his compatriot and Paddy Upton to the Royals' coaching staff, the former Sri Lankan captain added: \"My job really is to add value to the franchise through myself or through people that I would recommend. \"It's first about what value that person brings and how constantly they can help us improve. It's pretty obvious for everyone to see the standards of both Lasith and Paddy. They've had stellar careers with their respective teams in their jobs and can prove to be vital elements in our quest for the title.\" He also paid tribute to former Royals captain Shane Warne, who passed away earlier this month. \"He's a great loss for the cricket world, a great loss for cricketers around the world, because he was such an approachable guy, who had great knowledge. He was a very good friend, and I really enjoyed my time with him, the conversations we used to have. I think everyone will miss him.\"","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"Women's WC: SA Captain Luus Looking Forward For Upcoming Match With Aus","link":"https://sports.ndtv.com/cricket/icc-womens-cricket-world-cup-south-africa-captain-sune-luus-looking-forward-for-upcoming-match-with-australia-2828412","keywords":null,"creator":null,"video_url":null,"description":"ICC Women's Cricket World Cup: South Africa captain Sune Luus spoke about her side's upcoming match vs Australia and predicted it to be a \"good competitive game\".","content":null,"pubDate":"2022-03-17 10:39:54","full_description":"After defeating New Zealand in Match 16 of the ongoing ICC Women's World Cup on Thursday, South Africa skipper Sune Luus said that her side is not taking much pressure for the upcoming clash against Australia. Ayabonga Khaka and Shabnim Ismail's fiery spell backed by Laura Wolvaardt's blistering knock helped South Africa to defeat New Zealand by three wickets in the ongoing ICC Women's ODI World Cup here at Seddon Park. \"It is a roller-coster of emotions. We probably made it harder than it was supposed to be. But at the end of the day we will take the points and go. I don't think we did too bad, we started off well and had a good powerplay. Devine played a good knock in the middle but we brought back nicely at the end. They were 200 around the 40th over and we did well to restrict them to 228,\" said Sune Luus after the game. \"We regrouped nicely and my partnership with Laura was crucial, we should have probably stayed till the end and seen it through, but Kapp did a brilliant job. Australia is always a good competitive game. There's not too much pressure on us. We will look to improve the small things and take it from there,\" she added. Sophie Devine's innings of 93 went in vain as South Africa bowlers Ismail and Khaka scalped three wickets respectively that bowled out New Zealand on 228. Chasing 229, South Africa had a quick start but opener Lizelle Lee was run out in the fifth over with 25 runs on the board. Laura Wolvaardt and Tazmin Brits then steadied the ship for the second wicket. They mixed caution with aggression perfectly to ensure that there was no further damage. But later Brits was sent back to the pavilion by Amelia Kerr on 18 runs. At the halfway stage, South Africa were 105/2, needing 124 more runs for victory. Skipper Sune Luus took her side to the 150-run mark with Wolvaardt. Laura Wolvaardt smashed a brilliant 50, her 3rd in a row. Their partnership was broken in the 35th over by Amelia Kerr as Wolvaardt got dismissed after scoring 67 runs. Mignon du Preez joined the skipper but she was sent back by Kerr after scoring one run. Luus smashed a crucial fifty in 38th over. Luus departed soon after reaching her fifty as Hannah Rowe gave her side a big breakthrough in the 40th over. Promoted Later, Marizanne Kapp ensured that there was no further damage. She kept on thrashing the New Zealand bowlers and brought her side home with two wickets and their fourth consecutive win in the ongoing tournament. Earlier hosts failed to register a big score against a disciplined South African attack. An excellent innings of 93 from Sophie Devine has helped New Zealand post a decent total in the match against South Africa.","image_url":"https://c.ndtvimg.com/2022-03/se498fpg_sune-luus-afp_625x300_17_March_22.jpg?im=FeatureCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Women's World Cup 2022: Kapp leads South Africa to a nervy two-wicket win over New Zealand","link":"https://www.indiatvnews.com/sports/cricket/women-s-world-cup-2022-kapp-leads-south-africa-to-a-nervy-two-wicket-win-over-new-zealand-2022-03-17-764799","keywords":null,"creator":null,"video_url":null,"description":"Marizanne Kapp held her nerve with the bat as South Africa claimed a two-wicket win over New Zealand in their ICC Women's Cricket World Cup clash at Seddon Park on Thursday.","content":null,"pubDate":"2022-03-17 10:19:07","full_description":"Marizanne Kapp held her nerve with the bat as South Africa claimed a two-wicket win over New Zealand in their ICC Women's Cricket World Cup clash at Seddon Park on Thursday. With this victory, South Africa remained unbeaten at the World Cup, with four wins from as many matches while New Zealand faced their third loss in five matches. This was also South Africa's first win over New Zealand in a Women's Cricket World Cup and are now on par with Australia in terms of eight points but are second-placed due to the net run rate. It was also the third time South Africa won in a tight last-over finish in the ongoing tournament. After restricting the hosts to 228 all out in 47.5 overs, South Africa looked like they would cruise to the target, thanks to fifties from opener Laura Wolvaardt (67) and captain Sune Luus (51), who added 88 for the third wicket. But the pair departed in quick succession, triggering a mini-collapse. Kapp, who had led another tense chase against England in a solid all-round performance, was again entrusted with the task to see South Africa home. She hit an unbeaten 34 off 35 balls, comprising four boundaries, including back-to-back ones in the 47th over and kept her cool to collect more runs even as she lost partners. After slog-sweeping Frankie Mackay for a four and taking a single through mid-wicket, Ayabonga Khaka took a tight single to mid-off to complete a sensational chase with three balls to spare. Earlier, Kapp, with 2/44, along with Khaka's 3/31 and Shabnim Ismail picking 3/27 were instrumental in keeping New Zealand to 228 all out' The trio's bowling efforts, especially in the last ten overs, were good enough to overshadow home skipper Sophie Devine's excellent 93. Devine's 101-ball innings included 12 fours and one massive six, as her partnerships of 81 with Amelia Kerr (42) and 80 with Maddy Green (30) formed the backbone of the New Zealand innings. But Devine's dismissal in the 41st over led to a late collapse, with the tournament hosts losing their final six wickets for just 30 runs to be all out inside 48 overs. Devine lost fellow opener Suzie Bates (4) in the third over as the hosts were reduced to six for one. But Kerr joined her captain as the pair set about resurrecting the early damage. The duo looked solid and put on 81 for the second wicket until South Africa captain Sune Luus (1/48) intervened with the big wicket of Kerr. Luus had the New Zealand number three trapped LBW for 42 and experienced batter Amy Satterthwaite (1) fell in the next over to Khaka as the Proteas quickly gained the upper hand. Devine then fell to a lovely Khaka yorker and the rot then fell in as South Africa cleaned up the New Zealand tail to ensure their victory target would not be too high. Despite losing the services of another pacer Masabata Klass to a shoulder injury and Ismail's foot causing her discomfort, South Africa ensured that New Zealand never got the finishing flourish they aimed for, which proved to be decisive in the end for a nail-biting win. New Zealand 228 all out in 47.5 overs (Sophie Devine 93, Amelia Kerr 42; Shabnim Ismail 3/27, Ayabonga Khaka 3/31) lost to South Africa 229/8 in 49.3 overs (Laura Wolvaardt 67, Sune Luus 51; Amelia Kerr 3/50, Frankie Mackay 2/49) by two wickets.","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"3rd PAK vs AUS Test match tickets Gaddafi Stadium: How to book Pakistan vs Australia Lahore Test match tickets?","link":"https://thesportsrush.com/cricket-news-3rd-pak-vs-aus-test-match-tickets-gaddafi-stadium-how-to-book-pakistan-vs-australia-lahore-test-match-tickets/","keywords":["Cricket","Australia","Australia tour of Pakistan 2022","Pakistan"],"creator":["Dixit Bhargav"],"video_url":null,"description":"3rd PAK vs AUS Test match tickets: The SportsRush present before you full ticketing details for third Pakistan vs Australia Test. The third Test match of the ongoing Australia’s tour of Pakistan will be played in Lahore between March 21-25. An outright weekday contest, both teams will be vying for a victory in the third… The post 3rd PAK vs AUS Test match tickets Gaddafi Stadium: How to book Pakistan vs Australia Lahore Test match tickets? appeared first on The SportsRush.","content":"3rd PAK vs AUS Test match tickets: The SportsRush present before you full ticketing details for third Pakistan vs Australia Test. The third Test match of the ongoing Australia’s tour of Pakistan will be played in Lahore between March 21-25. An outright weekday contest, both teams will be vying for a victory in the third Test. In addition to a series win, a victory will also aid a team in gaining ICC World Test Championship points which is a necessity especially after a couple of draws in Rawalpindi and Karachi. The iconic Gaddafi Stadium, which had last hosted a T20I over a year ago, will be hosting a Test match after as many as 13 years. Considering how Pakistani fans have registered sold out venues in both the previous Tests, there is no reason why this match wouldn’t be played in front of a jam-packed stadium. Despite the recently concluded second Test finishing in a riveting draw, one can’t deny that the pitch at the Gaddafi Stadium will have to be better than both Pindi Cricket Stadium and National Stadium. Hence, it will be interesting to see how PCB’s (Pakistan Cricket Board) new move of hiring Toby Lumsden (Head Curator at ICC Academy) will affect the surface for this match. Toby Lumsden, Head Curator at ICC Academy takes a look at the Lahore pitch. #BoysReadyHain l #PAKvAUS pic.twitter.com/271krFmo3M — Pakistan Cricket (@TheRealPCB) March 17, 2022 3rd PAK vs AUS Test match tickets Third Pakistan vs Australia Lahore Test match tickets can be bought from Book Me. Fans can visit either their website or application to book tickets for this series-decider. All you have to do is click on the “Cricket” icon on the homepage. The next page will require you to click on “Book Your tickets Now”. Subsequently, select the preferred match day and click on “Book Me”. The next page will ask you to select your preferred ticket(s) according to various stands of the stadium. Upon selecting the required number of tickets of your preferred price category, follow simple steps to complete the online transaction. To easily reach the Book Me page for booking Pakistan vs Australia tickets at the Gaddafi Stadium, click below: Pakistan vs Australia 3rd Test (March 21-25) – Lahore. The post 3rd PAK vs AUS Test match tickets Gaddafi Stadium: How to book Pakistan vs Australia Lahore Test match tickets? appeared first on The SportsRush.","pubDate":"2022-03-17 10:17:27","full_description":"3rd PAK vs AUS Test match tickets: The SportsRush present before you full ticketing details for third Pakistan vs Australia Test. The third Test match of the ongoing Australia’s tour of Pakistan will be played in Lahore between March 21-25. An outright weekday contest, both teams will be vying for a victory in the third Test. In addition to a series win, a victory will also aid a team in gaining ICC World Test Championship points which is a necessity especially after a couple of draws in Rawalpindi and Karachi. The iconic Gaddafi Stadium, which had last hosted a T20I over a year ago, will be hosting a Test match after as many as 13 years. Considering how Pakistani fans have registered sold out venues in both the previous Tests, there is no reason why this match wouldn’t be played in front of a jam-packed stadium. Despite the recently concluded second Test finishing in a riveting draw, one can’t deny that the pitch at the Gaddafi Stadium will have to be better than both Pindi Cricket Stadium and National Stadium. Hence, it will be interesting to see how PCB’s (Pakistan Cricket Board) new move of hiring Toby Lumsden (Head Curator at ICC Academy) will affect the surface for this match. Toby Lumsden, Head Curator at ICC Academy takes a look at the Lahore pitch. #BoysReadyHain l #PAKvAUS pic.twitter.com/271krFmo3M — Pakistan Cricket (@TheRealPCB) March 17, 2022 Third Pakistan vs Australia Lahore Test match tickets can be bought from Book Me. Fans can visit either their website or application to book tickets for this series-decider. All you have to do is click on the “Cricket” icon on the homepage. The next page will require you to click on “Book Your tickets Now”. Subsequently, select the preferred match day and click on “Book Me”. The next page will ask you to select your preferred ticket(s) according to various stands of the stadium. Upon selecting the required number of tickets of your preferred price category, follow simple steps to complete the online transaction. To easily reach the Book Me page for booking Pakistan vs Australia tickets at the Gaddafi Stadium, click below: Pakistan vs Australia 3rd Test (March 21-25) – Lahore .","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Aakash Chopra slams PCB chief Ramiz Raja over his 'impossible' plan to make PSL better than IPL","link":"https://zeenews.india.com/cricket/aakash-chopra-slams-pcb-chief-ramiz-raja-over-his-impossible-plan-to-make-psl-better-than-ipl-2445983.html","keywords":null,"creator":null,"video_url":null,"description":"Pakistan Cricket Board (PCB) chief Ramiz Raja is working to change many things in his country's cricket. From making better pitches, to fixing domestic cricket to better remuneration to players, he is trying to take Pakistan cricket one level up.","content":null,"pubDate":"2022-03-17 09:56:00","full_description":"Pakistan Cricket Board (PCB) chief Ramiz Raja is working to change many things in his country's cricket. From making better pitches, to fixing domestic cricket to better remuneration for players, he is trying to take Pakistan cricket one level up. One of his wishes or plans is to see Pakistan Super League beat the Indian Premier League one day, in terms of brand size. And that can be done when more money comes into and from PSL. Currently, IPL is so big that PSL cannot be compared with it and we are not talking cricket here but the two leagues as a brand. Ramiz, however, has made a big statement that he is going to soon replace the current draft system in PSL with auction system, which is an IPL thing. And he added that if that becomes a reality then players will choose PSL over IPL. \"The market forces are conducive, but we'll sit down with the franchise owners to discuss it. This is a game of money. When the cricket economy grows in Pakistan, our respect will rise. The main driver of that financial economy is the PSL. If we take the PSL to auction model, increase the purse, then I'll put it in the IPL bracket. And then we'll see who goes to play the IPL over the PSL,\" he had said. But former India batter and commentator Aakash Chopra feels Ramiz's idea has no base. He proved him wrong by giving a class in economics and said that a player will never be sold for Rs 16 crore in PSL as market dynamics are different. \"There's money from selling rights; on the basis of that, you analyse the value of the league and the value of the teams. Then, you divide the purse and start the league, whether by auction or by draft. Ramiz bhai says that if there's an auction in the PSL, the price limit will increase which is the case. But you won't see a player being sold for ₹16 crore in PSL. It is not possible. Market dynamics are not going to allow that to happen. It's as simple as that,\" said Aakash on his official YouTube channel. Rajasthan Royals had bought South Africa's Chris Morris for rs 16 crore, two auctions ago. Chopra added that what works for IPL is that it has massive fan following in a country of billions. \"The biggest thing that India has is the people who watch the game, they're the ones who pay a lot of money. Our population of 130 crores is an asset,\" said Aakash. \"You don't have 100 crore people. Suppose Rohit Sharma plays in the PSL. Do you think the broadcaster, who was, let's assume, earlier paying 7000 crores, will suddenly increase the money to ₹35,000 crore? It isn't as if more people in Pakistan will start watching because a Virat Kohli or a Rohit Sharma is playing in PSL. You can maybe consider a 10 percent increase in viewership from the NRIs, but that is not going to suddenly increase your valuation,\" said Aakash. \"India have the audience. It's not down to the Indian players. It is not down to the player salaries, it is not down to auction or draft. I don't think anyone can compete with the Indian Premier League. So, Ramiz bhai, with all due respect, the truth is that cricket economics is not going to work with draft or auction.\"","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"'The Hundred' draft pushed back to avoid clash with Warne's state funeral","link":"https://www.indiatvnews.com/sports/cricket/the-hundred-draft-pushed-back-to-avoid-clash-with-shane-warne-s-state-funeral-2022-03-17-764792","keywords":null,"creator":null,"video_url":null,"description":"The men's Hundred draft and the announcement of the new women's signings for the second edition of the tournament have been postponed to April 5 in order to avoid a clash with Australian spin legend Shane Warne's state funeral on March 30. The men's draft picks and the new women's signings for the second season of the tournament were earlier due to be announced on March 30, the same day as Warne's memorial at the Melbourne Cricket Ground. \"The men's picks from The Hundred Draft and new women's signings will now be announced on Tuesday 5 April, with the next Priority Access window opening on the same date,\" a statement from The Hundred read. \"This is a week later than previously advertised due to Shane Warne state funeral taking place on Wednesday 30 March,\" it added. Warne, who is credited with reviving the art of leg-spin bowling by taking 708 wickets in 145 Tests in an illustrious career spanning 15 years, died at the age of 52 of a suspected heart attack in Koh Samui, Thailand on March 4. \"Shane was a much loved part of The Hundred, and played an important role in launching the competition as Head Coach of London Spirit's men's team. He will be hugely missed by everyone involved in the competition.\" Warne had coached the London Spirit's men's side in the inaugural edition of The Hundred last year and was due to lead the team again this season.","content":null,"pubDate":"2022-03-17 09:55:03","full_description":"The men's Hundred draft and the announcement of the new women's signings for the second edition of the tournament have been postponed to April 5 in order to avoid a clash with Australian spin legend Shane Warne's state funeral on March 30. The men's draft picks and the new women's signings for the second season of the tournament were earlier due to be announced on March 30, the same day as Warne's memorial at the Melbourne Cricket Ground. \"The men's picks from The Hundred Draft and new women's signings will now be announced on Tuesday 5 April, with the next Priority Access window opening on the same date,\" a statement from The Hundred read. \"This is a week later than previously advertised due to Shane Warne state funeral taking place on Wednesday 30 March,\" it added. Warne, who is credited with reviving the art of leg-spin bowling by taking 708 wickets in 145 Tests in an illustrious career spanning 15 years, died at the age of 52 of a suspected heart attack in Koh Samui, Thailand on March 4. \"Shane was a much loved part of The Hundred, and played an important role in launching the competition as Head Coach of London Spirit's men's team. He will be hugely missed by everyone involved in the competition.\" Warne had coached the London Spirit's men's side in the inaugural edition of The Hundred last year and was due to lead the team again this season.","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"Imran Khan praises Babar Azam's leadership in 2nd Test, says couldn't watch match as he was 'fighting match fixing' - Hindustan Times","link":"https://news.google.com/__i/rss/rd/articles/CBMihgFodHRwczovL3d3dy5oaW5kdXN0YW50aW1lcy5jb20vY3JpY2tldC9pbXJhbi1raGFuLWJhYmFyLWF6YW0tcGFraXN0YW4tdnMtYXVzdHJhbGlhLTJuZC10ZXN0LWZpZ2h0aW5nLW1hdGNoLWZpeGluZy0xMDE2NDc1MDc3MDY1MzkuaHRtbNIBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Imran Khan praises Babar Azam's leadership in 2nd Test, says couldn't watch match as he was 'fighting match fixing'  Hindustan TimesWatch: Entire Australian Team Applauds For Babar Azam From Behind After Pakistan Captain Walks Back ..  NDTV SportsUpdated ICC World Test Championship 2021-23 Points Table After Pakistan vs Australia 2nd Test  Cricket AddictorWatch: Girl asks Babar Azam to meet and marry her  Geo NewsMeet Urooj Mumtaz, the woman commentator from Pakistan who made Babar Azam’s century special  ThePrintView Full coverage on Google News","content":null,"pubDate":"2022-03-17 09:45:26","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"South Africa stay unbeaten at World Cup","link":"https://www.perthnow.com.au/sport/cricket/south-africa-stay-unbeaten-at-world-cup-c-6104648","keywords":null,"creator":["Steve McMorran"],"video_url":null,"description":"South Africa have kept an unbeaten record after four matches at the Women's Cricket World Cup, defeating tournament hosts New Zealand in a tense encounter.","content":null,"pubDate":"2022-03-17 09:27:20","full_description":"Marizanne Kapp made a nerveless 36 not out from 35 balls as South Africa beat New Zealand by two wickets with three balls remaining to stay unbeaten after four matches at the Women's Cricket World Cup. At Hamilton, New Zealand, half-centuries to Laura Wolvaardt and captain Sune Luus put South Africa on the road to victory as it chased down New Zealand's total of 228 and rejoined Australia atop the points table in the tournament. But it was the veteran Kapp, who had taken 2-44 during the New Zealand innings, who was left to steer her team home in an increasingly nervous run chase. \"I think these games have to stop now, I'm tired,\" the 32-year-old Kapp said. \"Again it was a team effort, again we weren't at our best but I believe the perfect game is just around the corner. \"I'm always nervous, I'm not going to lie. (Wolvaardt and Luus) batted well today but you can't get too relaxed because, as you saw, the game can change like that. \"Luckily today we got away with the win and I'm happy to be standing on the winning side.\" South Africa needed 39 runs off their last six overs with five wickets in hand, 31 off their last five. With two overs remaining it came down to 14 off 12 balls and Sophie Devine bravely stepped up to bowl the penultimate over. She immediately dismissed Shabnim Ismael for 4 to leave South Africa needing 12 runs from 10 balls. But Kapp gained the strike, hit a four and South Africa came to the last over needing six runs from six balls with Klaas on strike. Frances Mackay bowled the final over and Kapp struck the first ball for four, took a single from the second. Ayabonga Khaka was left on strike and she managed to turn the ball into a gap in the field for the winning single. New Zealand's future in the tournament now is tenuous with only two wins from five games. South Africa are almost assured of a place in the semi-finals.","image_url":"https://images.perthnow.com.au/publication/C-6104648/b919da2c767af2a1af03f8decbe176d0dc64e2f1-16x9-x0y0w1280h720.jpg","source_id":"perthnow","country":["australia"],"category":["sports"],"language":"english"},{"title":"South Africa stay unbeaten at World Cup","link":"https://thewest.com.au/sport/cricket/south-africa-stay-unbeaten-at-world-cup-c-6104636","keywords":null,"creator":["Steve McMorran"],"video_url":null,"description":"South Africa have kept an unbeaten record after four matches at the Women's Cricket World Cup, defeating tournament hosts New Zealand in a tense encounter.","content":null,"pubDate":"2022-03-17 09:27:03","full_description":"Marizanne Kapp made a nerveless 36 not out from 35 balls as South Africa beat New Zealand by two wickets with three balls remaining to stay unbeaten after four matches at the Women's Cricket World Cup. At Hamilton, New Zealand, half-centuries to Laura Wolvaardt and captain Sune Luus put South Africa on the road to victory as it chased down New Zealand's total of 228 and rejoined Australia atop the points table in the tournament. But it was the veteran Kapp, who had taken 2-44 during the New Zealand innings, who was left to steer her team home in an increasingly nervous run chase. \"I think these games have to stop now, I'm tired,\" the 32-year-old Kapp said. \"Again it was a team effort, again we weren't at our best but I believe the perfect game is just around the corner. \"I'm always nervous, I'm not going to lie. (Wolvaardt and Luus) batted well today but you can't get too relaxed because, as you saw, the game can change like that. \"Luckily today we got away with the win and I'm happy to be standing on the winning side.\" South Africa needed 39 runs off their last six overs with five wickets in hand, 31 off their last five. With two overs remaining it came down to 14 off 12 balls and Sophie Devine bravely stepped up to bowl the penultimate over. She immediately dismissed Shabnim Ismael for 4 to leave South Africa needing 12 runs from 10 balls. But Kapp gained the strike, hit a four and South Africa came to the last over needing six runs from six balls with Klaas on strike. Frances Mackay bowled the final over and Kapp struck the first ball for four, took a single from the second. Ayabonga Khaka was left on strike and she managed to turn the ball into a gap in the field for the winning single. New Zealand's future in the tournament now is tenuous with only two wins from five games. South Africa are almost assured of a place in the semi-finals.","image_url":"https://images.thewest.com.au/publication/C-6104636/b919da2c767af2a1af03f8decbe176d0dc64e2f1-16x9-x0y0w1280h720.jpg","source_id":"thewest","country":["australia"],"category":["sports"],"language":"english"},{"title":"IPL 2022: Kumar Sangakkara confident of turnaround with competent squad","link":"https://timesofindia.indiatimes.com/sports/cricket/ipl/top-stories/ipl-2022-kumar-sangakkara-confident-of-turnaround-with-competent-squad/articleshow/90287765.cms","keywords":null,"creator":null,"video_url":null,"description":"Rajasthan Royals director of cricket and head coach Kumar Sangakkara believes they have a \"very competent\" squad at their disposal to script a turnaround after three dismal IPL seasons.","content":null,"pubDate":"2022-03-17 08:31:18","full_description":"MUMBAI: Rajasthan Royals director of cricket and head coach Kumar Sangakkara believes they have a \"very competent\" squad at their disposal to script a turnaround after three dismal IPL seasons. Rajasthan finished 7th, 8th and 7th in the last three seasons. The IPL's upcoming edition begins on March 26. \"We know we had quite a bit of work to do in the off-season with regards to our team. I think we managed to identify the key areas which needed our attention and having had a proper process when it comes to selecting players at the auction, we managed to kind of hit the markers that we set for ourselves,\" said the Sri Lankan legend in a team statement. \"I think the franchise has done an amazing job to put this exciting and strong squad together,\" he added. Want to know how @MahelaJay reacted to @ninety9sl joining our #RoyalsFamily? 👀👇 https://t.co/aVZspya1MC — Rajasthan Royals (@rajasthanroyals) 1647488015000 Commenting on the make-up of his squad, Sangakkara said the presence of Yuzvendra Chahal and R Ashwin will make a huge difference. \"We've got the two best spinners in the IPL in terms of off-spin and leg-spin in Chahal and Ashwin. We have Boult, Prasidh, Saini, Coulter-Nile , McCoy, which makes up for a very exciting pace unit supported by of course the retentions of Yashasvi, Samson and Buttler. \"We have secured depth in every department, with Neesham, Mitchell and van der Dussen being exciting cricketers. We've got some really exciting and young cricketers from India as well. The main thing is that we have a very competent side. We tried to get the core right and get the right players for the roles. \"But now, the main thing irrespective of what the squad is, is actual match performance on the field, and how we can give everyone the freedom to go out there and perform,\" expressed Sangakkara. Asked what the team learned from last season's disappointing second part of the campaign, Kumar said, \"I think there were a lot of different reasons for that, not just one or two. \"Whether it was player availability, split tournament, bigger break, and not the best of match performances in terms of batting or bowling. But that is all in the past now, and that's why the squad has changed.\" Read Also Rajasthan Royals all-rounder Riyan Parag wants to pick Ravichandran Ashwin's brain in IPL 2022 Excited to share the dressing room with Ravichandran Ashwin, young Rajasthan Royals all-rounder Riyan Parag said he wants to \"pick the brains\" of the ace Indian off-spinner in the upcoming IPL. Explaining the additions of his compatriot Lasith Malinga and Paddy Upton to the Royals' coaching staff, the former Sri Lankan captain added: \"My job really is to add value to the franchise through myself or through people that I would recommend. \"It's first about what value that person brings and how constantly they can help us improve. It's pretty obvious for everyone to see the standards of both Lasith and Paddy. They've had stellar careers with their respective teams in their jobs and can prove to be vital elements in our quest for the title.\" He also paid tribute to former Royals captain Shane Warne , who passed away earlier this month. \"He's a great loss for the cricket world, a great loss for cricketers around the world, because he was such an approachable guy, who had great knowledge. He was a very good friend, and I really enjoyed my time with him, the conversations we used to have. I think everyone will miss him.\"","image_url":null,"source_id":"toi","country":["india"],"category":["sports"],"language":"english"},{"title":"Familiar frailties with bat come back to haunt India","link":"https://www.sentinelassam.com/sports/cricket/familiar-frailties-with-bat-come-back-to-haunt-india-583189","keywords":["Sports,Cricket"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"A day before losing by four wickets to England on Wednesday, vice-captain Harmanpreet Kaur had mentioned about India being wary of losing wickets in a cluster.","content":"Mount Maunganui: If one has a close look at India's up-and-down campaign in the ICC Women's Cricket World Cup, there seems to be a pattern which has come up. The top-order hasn't been scoring runs and often, India have been guilty of losing wickets in a cluster, a phenomenon which has been happening in the showpiece event consistently.A day before losing by four wickets to England on Wednesday, vice-captain Harmanpreet Kaur had mentioned about India being wary of losing wickets in a cluster. \"Sometimes, we are losing back-to-back wickets and if we can work on that... otherwise, things are the way we want them.\" In this campaign, the wobbles have made constant appearances. Against Pakistan, they were 114/6 before Sneh Rana and Pooja Vastrakar saved the day. When facing New Zealand, they were 95/5 and eventually lost by 62 runs. Against West Indies, India were 78/3 before Harmanpreet and Smriti Mandhana slammed centuries for an emphatic win. In Wednesday's match, India was tottering at 86/7 and were bowled out for 134. \"There are no solutions like that (for batting collapses). There is a process. Some days, top-order will work, some days middle-order won't work. In bowling also, one day bowlers will not bowl well, some other will come and support. That's the way this game has been played. Everyday we try to address certain issues. We will definitely solve and come back stronger in the next game,\" were veteran pacer Jhulan Goswami's assuring words after the match. But what has been a glaring issue in the Indian top-order collapses have been the lack of runs from Mithali Raj and Deepti Sharma. Sharma has made scores of 40, 5, 15 and 0 in four matches, twice at No. 3 before moving to No. 4 in the last two games. Mithali, the highest run-getter in ODIs, in particular, has been off-colour in the World Cup. Before the mega event, Raj had scores of 59, 66 not out, 23, 30 and 54 not out in the bilateral series against New Zealand. But in the ongoing mega event, she's registered scores of 9, 31, 5 and 1. Moreover, after batting at No. 4 in the first two matches, Mithali moved up to No. 3, primarily as a move to break the monotony of three left-handed top-order batters and take time to get a big total. But none of that has happened yet. It seems that Mithali hasn't got the start she needed and, in search of getting a springboard or release shot to get going, she's consuming a lot of dot balls, hasn't rotated the strike much and therefore, is yet to find her groove. \"I don't think it's a concern. Who is batting at number three? It's Mithali Raj, she is just one big knock away from a start. In the past series also, she was batting fantastically against New Zealand and is just one big knock away in this tournament. I don't think we have issues. I think Deepti also did a pretty decent job and at number five, Harman is playing. So, I don't think we have an issue. It's just one bad day that we as a batting unit couldn't perform well,\" insisted Goswami. The lack of runs from the top-order and wickets falling in a heap meant that Harmanpreet and Smriti Mandhana have been shouldering the majority of batting runs. The duo's stunning centuries against the West Indies covered up for India's batting flaws at Hamilton but when the duo tried to replicate the same act against England at Bay Oval, it just didn't happen. Though Richa Ghosh and Goswami herself hit some big shots, a meagre total of 134 was the result of top-order failure. \"Honestly speaking, yes, at this moment, the top-order hasn't fired the way we had thought. But I am sure we will be very positive about that because they have done really well in the past. I am very much hopeful they will come back hard in the next game because everyone wants to do well and no one will get a bigger platform than this,\" stated Goswami. With six-time champions Australia coming up on Saturday followed by Bangladesh and South Africa in the coming week, India have just three days in hand to sort out their top-order conundrum as well as losing wickets in a cluster. As the race for the semifinals of the World Cup intensifies, India will be mindful of avoiding their all-familiar frailties with the bat. Also read: We really need to work very hard in the next game: MithaliAlso watch: ","pubDate":"2022-03-17 08:06:24","full_description":"Mount Maunganui: If one has a close look at India's up-and-down campaign in the ICC Women's Cricket World Cup, there seems to be a pattern which has come up. The top-order hasn't been scoring runs and often, India have been guilty of losing wickets in a cluster, a phenomenon which has been happening in the showpiece event consistently. A day before losing by four wickets to England on Wednesday, vice-captain Harmanpreet Kaur had mentioned about India being wary of losing wickets in a cluster. \"Sometimes, we are losing back-to-back wickets and if we can work on that... otherwise, things are the way we want them.\" In this campaign, the wobbles have made constant appearances. Against Pakistan, they were 114/6 before Sneh Rana and Pooja Vastrakar saved the day. When facing New Zealand, they were 95/5 and eventually lost by 62 runs. Against West Indies, India were 78/3 before Harmanpreet and Smriti Mandhana slammed centuries for an emphatic win. In Wednesday's match, India was tottering at 86/7 and were bowled out for 134. \"There are no solutions like that (for batting collapses). There is a process. Some days, top-order will work, some days middle-order won't work. In bowling also, one day bowlers will not bowl well, some other will come and support. That's the way this game has been played. Everyday we try to address certain issues. We will definitely solve and come back stronger in the next game,\" were veteran pacer Jhulan Goswami's assuring words after the match. But what has been a glaring issue in the Indian top-order collapses have been the lack of runs from Mithali Raj and Deepti Sharma. Sharma has made scores of 40, 5, 15 and 0 in four matches, twice at No. 3 before moving to No. 4 in the last two games. Mithali, the highest run-getter in ODIs, in particular, has been off-colour in the World Cup. Before the mega event, Raj had scores of 59, 66 not out, 23, 30 and 54 not out in the bilateral series against New Zealand. But in the ongoing mega event, she's registered scores of 9, 31, 5 and 1. Moreover, after batting at No. 4 in the first two matches, Mithali moved up to No. 3, primarily as a move to break the monotony of three left-handed top-order batters and take time to get a big total. But none of that has happened yet. It seems that Mithali hasn't got the start she needed and, in search of getting a springboard or release shot to get going, she's consuming a lot of dot balls, hasn't rotated the strike much and therefore, is yet to find her groove. \"I don't think it's a concern. Who is batting at number three? It's Mithali Raj, she is just one big knock away from a start. In the past series also, she was batting fantastically against New Zealand and is just one big knock away in this tournament. I don't think we have issues. I think Deepti also did a pretty decent job and at number five, Harman is playing. So, I don't think we have an issue. It's just one bad day that we as a batting unit couldn't perform well,\" insisted Goswami. The lack of runs from the top-order and wickets falling in a heap meant that Harmanpreet and Smriti Mandhana have been shouldering the majority of batting runs. The duo's stunning centuries against the West Indies covered up for India's batting flaws at Hamilton but when the duo tried to replicate the same act against England at Bay Oval, it just didn't happen. Though Richa Ghosh and Goswami herself hit some big shots, a meagre total of 134 was the result of top-order failure. \"Honestly speaking, yes, at this moment, the top-order hasn't fired the way we had thought. But I am sure we will be very positive about that because they have done really well in the past. I am very much hopeful they will come back hard in the next game because everyone wants to do well and no one will get a bigger platform than this,\" stated Goswami. With six-time champions Australia coming up on Saturday followed by Bangladesh and South Africa in the coming week, India have just three days in hand to sort out their top-order conundrum as well as losing wickets in a cluster. As the race for the semifinals of the World Cup intensifies, India will be mindful of avoiding their all-familiar frailties with the bat. Also read: We really need to work very hard in the next game: Mithali Also watch:","image_url":"https://assets.sentinelassam.com/h-upload/2022/03/17/325806-frailties.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"}]}