{"newsArray":[{"article_id":"2b44d9da4f898b27c150ec3ca72930fa","title":"IND vs ENG: রোহিত, শামির ইতিহাস, বাটলারদের লজ্জা, পরিসংখ্যানে ভারত বনাম ইংল্যান্ড ম্যাচ","link":"https://bengali.abplive.com/photo-gallery/sports/cricket-rohit-sharma-mohammed-shami-achieves-milestones-as-india-beat-england-in-lucknow-in-odi-world-cup-2023-match-1020108","keywords":["ক্রিকেট"],"creator":["ABP Ananda"],"video_url":null,"description":"IND vs ENG: রোহিত, শামির ইতিহাস, বাটলারদের লজ্জা, পরিসংখ্যানে ভারত বনাম ইংল্যান্ড ম্যাচ","content":"লখনউয়ের মাঠে ইংল্যান্ডকে ১০০ রানে হারিয়ে চলতি বিশ্বকাপে ছয়ে ছয় করে ফেলেছে ভারতীয় দল। এই জয়ের সুবাদে একদিকে যেখানে ইংল্যান্ড সেমিফাইনালের পৌঁছনো প্রায় অসম্ভব, সেখানে ভারতের শেষ চারে পৌঁছনো কার্যত নিশ্চিত। ইংল্যান্ডের বিরুদ্ধে শূন্য রানে আউট হন বিরাট কোহলি। এই প্রথমবার সীমিত ওভারের বিশ্বকাপে কোহলিকে খাতা খোলার আগেই সাজঘরে ফিরতে হল। তাঁর ৫৬ ম্যাচের দৌড় থামল। এটিই আবার ভারতীয় অধিনায়ক হিসাবে রোহিত শর্মার শততম ম্যাচ ছিল। সপ্তম ভারতীয় অধিনায়ক হিসাবে এই মাইলফলক স্পর্শ করলেন রোহিত। মাইলফলক ম্যাচে অনবদ্য ৮৭ রানের ইনিংস খেলেন ভারতীয় অধিনায়ক। সচিন তেন্ডুলকর, রাহুল দ্রাবিড়, সৌরভ গঙ্গোপাধ্যায় ও বিরাট কোহলির পর মাত্র পঞ্চম ভারতীয় হিসাবে আন্তর্জাতিক ক্রিকেটে ১৮ হাজার রানের গণ্ডি পার করলেন রোহিত শর্মা। এই নিয়ে বিশ্বকাপে রোহিত ১২ নম্বর বার অর্ধশতরানের গণ্ডি পার করলেন। পঞ্চম ব্যাটার হিসাবে এই কৃতিত্ব গড়েন তিনি। কোহলির পাশাপাশি ইংল্যান্ড তারকা জো রুটও এদিন শূন্য রানে আউট হন। প্রথমবার তিনি ৫০ ওভারের বিশ্বকাপে শূন্য রানে ফিরলেন। এই প্রথমবার ওয়ান ডে বিশ্বকাপের ইতিহাসে দুই দলেরই তিন নম্বরে নামা ব্যাটার শূন্য রানে আউট হলেন। মহম্মদ শামি ম্যাচে চারটি উইকেট নিয়ে। দ্রুততম বোলার হিসাবে মাত্র ১৩ ইনিংসে বিশ্বকাপে শামি ৪০টি উইকেট নেওয়ার কৃতিত্ব নিজের নামে করলেন। ইংল্যান্ডের ছয় ব্যাটার এদিন বোল্ড হন। বিশ্বকাপের ইতিহাসে এক ম্যাচ এর থেকে বেশি কেবল এক দলের (১৯৭৫ সালে পূর্ব আফ্রিকা) ব্যাটাররাই বোল্ড হয়েছিলেন। এই নিয়ে প্রথমবার বিশ্বকাপের মঞ্চে টানা চার ম্যাচ হারতে হল ইংল্যান্ডকে। বিশ্বকাপে ইতিমধ্যেই পাঁচ ম্যাচ হেরেছেন বাটলাররা, যা যে কোনও বিশ্বকাপে গতবারের চ্যাম্পিয়নদের জন্য সর্বাধিক। বিশ্বকাপের মঞ্চে এটি ভারতের ৫৯তম জয়। ভারত জয়ের নিরিখে নিউজ়িল্যান্ডকে পিছনে ফেলে দিল। কেবল অস্ট্রেলিয়া বিশ্বকাপের মঞ্চে ভারতের থেকে অধিক ম্যাচ (৭৩) জিতেছে। IND vs ENG LIVE Score Today: ছয়ে ছয়! দুরন্ত বোলিংয়ে ভর করে ইংল্যান্ডকে ১০০ রানে উড়িয়ে দিল ভারত","pubDate":"2023-10-29 22:28:31","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/10/30/680250a7547c1fe2289ab3c6c425c4751698618662354507_original.jpg","source_id":"abplive","source_priority":10959,"country":["india"],"category":["sports"],"language":"bengali"},{"article_id":"3f47cc0f184d9b7888a42ee15f4273e0","title":"Freddie Flintoff training guide dog as England cricket icon recovers from horror crash","link":"https://www.dailystar.co.uk/sport/other-sports/freddie-flintoff-injuries-dog-cricket-31311087","keywords":["Sport"],"creator":null,"video_url":null,"description":"England cricket legend Andrew 'Freddie' Flintoff suffered injuries last December, when his open-topped, three-wheeled car flipped over on the Top Gear test track","content":"Freddie Flintoff has been training a guide dog as he continues to recover from his horror Top Gear crash injuries. The retired England cricket hero is caring for the pooch as part of his rehab after suffering ‘life-altering’ facial wounds. He was spotted out walking the Labrador puppy near his £5.25million home in Hale, Manchester. Freddie, 45, looked relaxed as he strolled along wearing a beanie hat, backpack and tinted glasses. But pals have revealed when he first started training his new furry friend, he was prone to taking a tumble. Last month former team-mate Steve Harmison, 45, described meeting up with the injured star a few weeks earlier. He said: “Believe it or not, he was training a guide dog. Which I’m sure is going better now than it was, because he tripped over about three times on his way around the field.” Fans have been thrilled to see the dad-of-four back on his feet after the smash in December, when his open-topped, three-wheeled car flipped over on the Top Gear test track. He was airlifted to hospital from Dunsford Aerodrome in Surrey. Freddie was not wearing a helmet when he lost control of the Morgan Super 3 roadster while taking a corner at 22mph. He quit his presenting job soon afterwards and the BBC cancelled the last series of the show. After months of hiding his injuries, he made his first public appearance in September when he coached England cricketers in Cardiff. Speaking afterwards, Steve said: “It was great to see him back. You’ve seen the pictures of him with a smile on his face but I saw him about six weeks ago – but at that time he covered his face up.” Freddie is said to have received £9million in compensation for the accident – a figure based on two years’ lost earnings. The BBC says no final decision has been made about the future of Top Gear. However, Flintoff will return to the corporation for a second series of Field Of Dreams, mentoring youngsters in cricket.","pubDate":"2023-10-29 21:24:10","image_url":"https://i2-prod.dailystar.co.uk/incoming/article31311091.ece/ALTERNATES/s98/1_Britain-Cricket-England-New-Zealand-23256385165522.jpg","source_id":"dailystar","source_priority":3076,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"54fdf70cd7ec8358b6381afeb57e01e6","title":"England admit to being clueless about significant Cricket World Cup rule change to Champions Trophy qualification","link":"https://7news.com.au/sport/cricket/england-admit-to-being-clueless-about-significant-cricket-world-cup-rule-change-after-defeat-to-india-c-12370880","keywords":null,"creator":["Glenn Valencich"],"video_url":null,"description":"The reigning champions’ tournament has gone from bad to worse after an alarming discovery during a heavy loss to India.","content":"England coach Matthew Mott has owned up to being in the dark on a significant rule change for the . The reigning champions suffered their fifth defeat in six matches at the tournament when they collapsed to all out for 129 chasing just 230 for victory against hosts India. Defeat anchored England to 10th and rock bottom on the table, behind both the Netherlands and Bangladesh, with matches against Australia, the Dutch and Pakistan to come. One victory might be enough for Mott’s side to avoid finishing last but two are likely to be required to avoid an ignominious consequence: missing out on the next major 50-over global competition. Places at the 2025 Champions Trophy are allocated based on performances in this year’s World Cup, with hosts Pakistan joined by the seventh highest finishers. It had previously been linked to world rankings. The switch was ratified by the ICC board in November 2021 but the information appears to have been missed in the handovers to Mott and ECB chief executive Richard Gould. It reared its head again during England’s loss to India, prompting questions in the post-match press conference. Asked when he learned about the Champions Trophy headache, Mott conceded “about an hour and a half ago.” “The ICC do change the rules quite a bit with qualification,” the Australian added. “But to be honest, I don’t think it would affect in any way the way we’ve played in this tournament, so it’s not a big deal.” The Champions Trophy has become an ugly duckling in the ICC’s calendar since the T20 World Cup came to prominence, with the former officially on the scrapheap twice before it was reintroduced first for 2017 and again for 2025. In spite of its relatively lowly status it would still be an embarrassment for England, one of the richest nations in cricket, to miss out on the event. The ECB hosted in 2013 and stepped up to do so again in 2017 when the tournament was brought back from the dead. Meanwhile, Mott has rejected suggestions from England’s 2019 World Cup-winning captain Eoin Morgan about the team being “unsettled” behind the scenes. The pair worked together when Mott took over the white-ball side 18 months ago but the skipper retired soon after. Morgan’s word still carries plenty of weight and his observations about his old teammates have raised eyebrows. Speaking to Sky Sports prior to England’s loss to India, Morgan said the side were “definitely unsettled”. Responding to the idea they were simply off form, he added: “There’s something else going on - there has to be”. Mott said he would approach Morgan in a bid to set things straight. “Eoin’s entitled to his opinion. He’s obviously been away (from India) for a couple of weeks with the birth of his child and he hasn’t been in and around the rooms,” Mott said. “But I’ll certainly take that up with him and have a chat to him. We’ve got a really good relationship with him so if he’s seeing something I’m not I’ll definitely have that conversation. “I don’t think that (is the case) at all. Anyone inside our tent at the moment would say, despite our results, we’re an incredibly tight-knit unit. “I can only say, from my opinion, that the group has been incredibly strong. Chris Woakes also stood up for the unity of the squad, telling Sky: “I can firmly say there is nothing wrong with the dressing room.”","pubDate":"2023-10-29 20:25:38","image_url":"https://images.7news.com.au/publication/C-12370880/9947b1a09b445ca21f76b0fd28c52bd9963f5738-16x9-x0y0w1304h734.jpg","source_id":"7news","source_priority":7652,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"4087b93a182d125d5a64b593dc46db03","title":"Every Perfect 40 Score in Strictly Come Dancing History","link":"https://markmeets.com/entertainment/every-perfect-40-score-in-strictly-come-dancing-history/?utm_source=rss&utm_medium=rss&utm_campaign=every-perfect-40-score-in-strictly-come-dancing-history","keywords":["Entertainment","Dancing","markmeets","Perfect","Routine","Scored","Strictly"],"creator":["Lee Clarke"],"video_url":null,"description":"Strictly Come Dancing contestants aim for one thing during their journey on the BBC TV series – a perfect score of 40. The post Every Perfect 40 Score in Strictly Come Dancing History first appeared on MarkMeets | Entertainment, Music, Movie, TV & London Film Premiere News.","content":"Strictly Come Dancing contestants aim for one thing during their journey on the BBC TV series – a perfect score of 40. This coveted accolade is bestowed by all four judges, and it’s a rare feat, but when achieved, it marks a remarkable performance. Over the 19-year history of the show, there have been more than 70 dances that earned a perfect 40. While the 2023 cast is yet to join this elite group, let’s revisit some of the most memorable routines that achieved perfection. Jill Halfpenny and Darren Bennett’s Jive (Series 2) In the early days of Strictly Come Dancing, actress Jill Halfpenny and her partner Darren Bennett wowed the audience with a high-tempo Jive set to “I’m Still Standing.” Their electric performance in the series two finale earned them the very first perfect score of 40 from all four judges – Len Goodman, Arlene Phillips, Craig Revel Horwood, and Bruno Tonioli. Jill went on to win the entire series in 2004 and even made a return to the show to reprise her impressive Jive. Mark Ramprakash and Karen Hardy’s Salsa (Series 4) It wasn’t until series four that perfection was achieved once more. Cricketer Mark Ramprakash and his partner Karen Hardy danced a thrilling Salsa to “Hot Hot Hot.” Their journey to perfection had a rocky start when Mark’s microphone got tangled in Karen’s dress, causing them to restart the routine. Despite this setback, they managed to score 36 and later delivered a flawless performance in the final, earning the coveted 40. Matt Di Angelo and Flavia Cacace’s Viennese Waltz (Series 5) Matt Di Angelo and Flavia Cacace made history by becoming the first couple to earn a perfect 40 before the final. Their romantic semi-final Viennese Waltz, danced to “Open Arms” in series five, showcased their exceptional chemistry and skill. Despite their exceptional performance, they did not secure the series win. Alesha Dixon and her partner Matthew Cutler claimed the glitterball trophy, even though they never managed to score a perfect 40. Alesha later became a judge on the show from series seven before departing after three years. Lisa Snowdon and Brendan Cole’s Hat-Trick (Series 6) Lisa Snowdon and Brendan Cole etched their names in Strictly history by becoming the first couple to achieve a perfect 40 in not one but three different routines. Their remarkable hat-trick included a semi-final Quickstep set to Frank Sinatra’s “Dancing in the Dark,” a Foxtrot danced to “Walkin’ My Baby Back Home,” and a Cha-cha-cha performed to “Tears Dry on Their Own” in the final. Despite their impressive scores, Tom Chambers and Camilla Dallerup won series six. Rachel Stevens and Vincent Simone’s Foxtrot (Series 6) In the same series, S Club 7 singer Rachel Stevens proved her prowess in the ballroom with a captivating Foxtrot. Set to “They Long to Be Close to You,” her Foxtrot earned a perfect 40 in both week 10 and the final when she reprised it with her partner Vincent Simone. Ali Bastian and Brian Fortuna’s Double Perfect (Series 7) Series seven saw an increase in perfect scores, with three couples earning a 40. Starting with actor Ali Bastian, who danced a stunning Viennese Waltz to “Do Right Woman, Do Right Man” during the Blackpool episode. As a new addition, guest judge Darcey Bussell made it possible to score 50. Ali achieved this feat with her American Smooth to “Come Dance with Me.” Chris Hollins and Ola Jordan’s Charleston (Series 7) The introduction of Blackpool as a regular venue and the Charleston as a new dance style added to the excitement. Cricketer and journalist Chris Hollins and his partner Ola Jordan performed a Charleston to “Fat Sam’s Grand Slam” from the “Bugsy Malone” film, scoring a perfect 50 and clinching the series victory. Pamela Stephenson and James Jordan’s Movie Magic (Series 8) In series eight, James Jordan and Pamela Stephenson were the only couple to achieve a perfect 40. Their Movie Week Viennese Waltz to “Unchained Melody” from “Ghost” did it twice – once in week ten, and again when they performed it in the final. Their Quickstep to “Steppin’ Out with My Baby” also reached perfection. However, it was Kara Tointon and Artem Chigvintsev who won and went on to become a real-life couple. Harry Judd and Aliona Vilani’s Dynamic Duo (Series 9) Series nine witnessed another trio of couples earning perfect scores of 40. Harry Judd and Aliona Vilani, the eventual winners, delivered captivating performances. Their Quickstep to “Don’t Get Me Wrong” and Argentine Tango to “Asi se baila el tango” became the first perfect 40s for this style of dance. Jason Donovan and Kristina Rihanoff’s Theatrical Argentine Tango (Series 9) Jason Donovan added to the series nine perfection with a compelling Argentine Tango to “El Tango de Roxanne.” His charismatic performance proved he was more than a one-trick pony, and it highlighted the show’s diverse dance styles. Chelsee Healey and Pasha Kovalev’s Passionate Paso Doble (Series 9) Hollyoaks actor Chelsee Healey may not have won the series, but she was a fan favorite. Her fiery Paso Doble to “Malagueña” showcased her impressive skills, earning her a perfect 40 and leaving a lasting mark on the show. Kimberley Walsh and Pasha Kovalev’s Triple 40 Triumph (Series 10) Series ten marked the addition of Darcey Bussell to the judging panel, replacing Alesha Dixon. This series also introduced the fusion of two dance styles. Kimberley Walsh’s cha-cha-cha/tango hybrid to “It’s Raining Men” impressed the judges. Her Charleston to “Those Magnificent Men in Their Flying Machines” and Tango to “When Doves Cry” also secured perfect 40 scores. Denise Van Outen and James Jordan’s Energetic Showmanship (Series 10) TV personality Denise Van Outen showcased her growth throughout the series with a dynamic Showdance to “What a Feeling” from “Flashdance.” Her equally energetic Charleston to “Walk Like an Egyptian” earned her another perfect score. Louis Smith and Flavia Cacace’s Gymnastic Glory (Series 10) Series ten was a tough competition, but gymnast Louis Smith emerged victorious with his Showdance to “Rule the World.” His incredible performance showcased his Olympic strength and earned him a perfect score, making him the series champion. Abbey Clancy and Aljaž Škorjanec’s Salsa Sensation (Series 11) Nine years after the last perfect 40 for a Salsa, model Abbey Clancy broke the dance’s curse with a scorching routine to “You Should Be Dancing” from “Saturday Night Fever.” Switching gears, she also delivered a beautiful Waltz to “Kissing You,” securing her victory and the coveted Glitterball trophy. Natalie Gumede and Artem Chigvintsev’s Stellar Salsa (Series 11) Although Abbey Clancy took home the trophy, actress Natalie Gumede gave her tough competition. Her sultry Salsa to “Wanna Be Startin’ Somethin’” and Showdance to “Steppin’ Out with My Baby” both earned her perfect 40 scores and showcased her incredible dancing abilities. Caroline Flack and Pasha Kovalev’s Perfection in Variety (Series 12) Caroline Flack made history in series 12 as the first contestant to not drop a single mark in the final. Alongside her partner Pasha Kovalev, she delivered a lively Cha-cha-cha to “Can You Feel It,” a fairytale Showdance to “Angels,” and a playful Charleston to “Istanbul.” Her versatility and consistency made her the series champion. Simon Webbe and Kristina Rihanoff’s Argentine Tango Excellence (Series 12) Simon Webbe and Kristina Rihanoff’s Argentine Tango made waves in Blackpool and nearly secured a perfect 40. Their moody performance to “El Tango de Roxanne” left a lasting impression. Kellie Bright and Kevin Clifton’s Double Perfect (Series 13) In series 13, Kellie Bright and Kevin Clifton made history by achieving a perfect 40 in two separate routines. Their finale Showdance to “The Ding-Dong Daddy of the D-Car Line” and Charleston to “Chicago’s Hot Honey Rag” captivated the judges, although it was Jay McGuiness and Aliona Vilani who claimed the series victory. Ore Oduba and Joanne Clifton’s Jive and Showdance (Series 14) Presenter Ore Oduba delivered the first perfect Jive of the series with “Runaway Baby” and earned top marks for his Showdance to “I Got Rhythm.” His stellar performances secured his victory in series 14, but he wasn’t the only one to earn a perfect 40. Louise Redknapp and Kevin Clifton’s Sensational Argentine Tango (Series 14) Louise Redknapp and Kevin Clifton’s Argentine Tango to “Tanguera” was an exceptional performance that earned them a perfect score. Kevin continued his streak of 40s with this mesmerizing routine. Danny Mac and Oti Mabuse’s Spectacular Trio (Series 14) In a series filled with talent, actor Danny Mac delivered a trio of perfect 40s. His Charleston to “Puttin’ On the Ritz,” Showdance to “Set Fire to the Rain,” and Samba to “Magalenha” wowed the judges and the audience. His exceptional dancing skills and consistency impressed everyone. Debbie McGee and Giovanni Pernice’s Tango Magic (Series 15) Series 15, the first with Shirley Ballas as a judge, featured three couples earning perfect scores of 40. Debbie McGee’s Tango to “I Gotta Feeling” was a standout routine, as was her captivating high kick in the Argentine Tango to “Por una Cabeza.” Her flawless performances added to the series’ perfect 40s. Alexandra Burke and Gorka Marquez’s Show-Stopping American Smooth and Jive (Series 15) Singer Alexandra Burke proved to be one of the series’ most talented dancers. Her American Smooth to “Wouldn’t It Be Loverly” and incredibly quick Jive to “Proud Mary” were nothing short of incredible, earning her perfect 40s. Joe McFadden and Katya Jones’ Charismatic Charleston (Series 15) Joe McFadden’s Charleston to “Alexander’s Ragtime Band” sent him to the top of the leaderboard and into the nation’s hearts. His charismatic performance earned him a perfect score and secured his victory in series 15. Ashley Roberts and Pasha Kovalev’s Remarkable Quartet (Series 16) Ashley Roberts dazzled the audience with a quartet of perfect 40s in the final. Her Salsa to “(I’ve Had) The Time of My Life” from “Dirty Dancing,” featuring an epic lift, her Showdance to “Keeping Your Head Up,” and her Charleston to “Witch Doctor” left a lasting mark on the series. She also earned a perfect 40 for her Jive to “Shake a Tail Feather” in Blackpool. Faye Tozer and Giovanni Pernice’s Fantastic Four (Series 16) Steps singer Faye Tozer secured perfect 40s in four separate routines. Her Charleston to “The Lonely Goatherd,” Viennese Waltz to “It’s a Man’s Man’s Man’s World,” Showdance to “Lullaby of Broadway,” and Theatre/Jazz to “Fever” showcased her versatility and dance prowess. However, it was Stacey Dooley and Kevin Clifton who won series 16. Kelvin Fletcher and Oti Mabuse’s Ballroom Brilliance (Series 17) Kelvin Fletcher won series 17, and his quickstep to “The Lady is a Tramp” showcased his ballroom mastery. His Showdance to “Shout” was equally impressive, highlighting his versatility as a dancer. Karim Zeroual and Amy Dowden’s Sensational Jive and Quickstep (Series 17) Kelvin and Oti may have clinched the victory, but Karim Zeroual and Amy Dowden had the dance of the series with their Jive to “You Can’t Stop the Beat” from “Hairspray.” Their exceptional performance earned them a perfect score, not just once but twice – in Blackpool and at the finale. They also achieved a 40/40 for their Quickstep to “Mr. Pinstripe Suit.” Bill Bailey and Oti Mabuse’s Grand Finale (Series 18) Series 18 faced unique challenges due to Covid-19 travel restrictions, leading to a reduced judging panel. With three judges instead of four, a score of 30 became the new 40. Comedian Bill Bailey, partnered with Oti Mabuse, secured the highest available score of 30 for his Showdance to “The Show Must Go On.” Bill’s remarkable journey culminated in his victory, making Oti champion for two consecutive years. Maisie Smith and Gorka Marquez’s Street/Commercial and Festive Finale (Series 18) Actor Maisie Smith was a strong contender throughout the series. Her street/commercial dance to “Gettin’ Jiggy wit It” and festive Showdance to “We Need a Little Christmas” both earned perfect scores of 30. HRVY and Janette Manrara’s Street/Commercial, Charleston, and American Smooth (Series 18) HRVY made his presence known in the competition by achieving a perfect score of 30 an impressive three times. His street/commercial dance to “A Sky Full of Stars,” Charleston to “Another Day of Sun” from “La La Land,” and American Smooth to “One (Singular Sensation)” were undeniably brilliant. Rhys Stephenson and Nancy Xu’s Charleston: A Toe-Tapping Triumph One of the most delightful moments in Strictly history came when CBBC presenter Rhys Stephenson and the talented Nancy Xu took to the dance floor to perform the Charleston. The choice of music, “The Charleston,” was not only aptly named but also perfectly suited to the infectious energy and charm that Rhys and Nancy brought to their routine. While the duo fell just short of making it to the final, they won the hearts of the audience with their Charleston performance. This lively and exuberant dance, characterized by its energetic kicks and twirls, transported viewers back to the Roaring Twenties, where flappers and jazz music reigned supreme. Rhys and Nancy’s interpretation of the Charleston was a masterclass in capturing the spirit of the era. AJ Odudu and Kai Widdrington’s Quickstep: A Bittersweet Journey AJ Odudu, known for her role as the host of Big Brother, made a significant impact on Strictly with her impressive Quickstep performance, accompanied by her partner Kai Widdrington. However, their journey was bittersweet, as AJ had to withdraw from the competition due to an injury just before the final. In the semi-finals, AJ and Kai delivered a Quickstep that earned them a perfect score of 40. Their dance was set to the classic tune “Sing, Sing, Sing (With a Swing).” The Quickstep is known for its fast-paced, joyful movements, and AJ and Kai executed it with precision and style. Their partnership on the dance floor was a testament to the dedication and hard work that contestants put into the competition. John Whaite and Johannes Radebe’s Pasodoble and Showdance: Breaking Boundaries John Whaite and Johannes Radebe made history on Strictly Come Dancing as the first all-male pairing. Their performances were nothing short of spectacular, leaving a lasting impression on both the judges and the audience. Two of their standout routines were the Paso Doble and the Showdance. For the Paso Doble, John and Johannes danced to “He’s a Pirate” from “Pirates of the Caribbean: The Curse of the Black Pearl” during the movie-themed week. The Paso Doble is a passionate and dramatic dance, and their portrayal was nothing less than spectacular. Their choreography was filled with intensity and precision, earning them rave reviews. The Showdance was another highlight of their journey, set to “You’ve Got the Love.” Their dance was a beautiful and emotional display of their partnership, showcasing their incredible chemistry and skill. It was no surprise that their efforts were rewarded with the ultimate recognition. Rose Ayling-Ellis and Giovanni Pernice: A Historic Tango and a Poetic Couple’s Choice Actor Rose Ayling-Ellis and her partner Giovanni Pernice etched their names in the Strictly history books with their remarkable performances. In week six, they delivered a Tango that received a perfect score of 40, marking the earliest occurrence of a perfect score in the show’s history. The dance was set to “Shivers” and showcased their exceptional talent and chemistry. Their Couple’s Choice performance was a standout moment for its unique and poetic approach. Dancing to “Symphony,” they performed a sequence in silence, celebrating Rose, who is deaf. This moving and visually stunning routine was a testament to the power of dance as a universal language that transcends barriers. To add to their achievements, Rose and Giovanni’s Showdance, set to “The Rose,” was nothing short of epic. Their chemistry and storytelling through dance were unparalleled, making it clear why they emerged as the winners of series 19. Helen Skelton and Gorka Marquez’s Mesmerizing Couple’s Choice In a more recent series, TV presenter Helen Skelton graced the Strictly dance floor with her mesmerizing Couple’s Choice routine. This unique and contemporary dance style allows couples to express themselves without the constraints of traditional ballroom or Latin steps. Helen’s Couple’s Choice performance was set to “Mein Herr” from the musical “Cabaret.” It was an exquisite fusion of dance styles and emotions, earning her full marks. What made this routine even more exceptional was her flawless execution in the finale, securing her a place in the annals of epic Strictly routines. Fleur East and Vito Coppola’s Dynamic Tribute Fleur East, a singer and songwriter, paid a vibrant and dynamic tribute to her favorite band, Destiny’s Child, with a Couple’s Choice performance. This unconventional dance style allowed Fleur and her partner, Vito Coppola, to let loose and showcase their incredible talent. Their routine featured a medley of Destiny’s Child hits, and it was a true spectacle of energy and creativity. The freedom that Couple’s Choice offers was evident as they brought the spirit of Destiny’s Child to life on the dance floor. Fleur and Vito’s journey didn’t stop there. They also took on the Samba, a lively and rhythmically challenging Latin dance. Dancing to “Hot Hot Hot,” they followed in the footsteps of a memorable performance by Mark and Karen from the early days of Strictly, earning a perfect score of 40. Their ability to master different dance styles and bring their unique flair to each performance was a testament to their artistry. Strictly Come Dancing has been a treasure trove of exceptional dance performances over the years. From the lively and exuberant Charleston of Rhys Stephenson and Nancy Xu to the history-making routines of John Whaite and Johannes Radebe, the show continues to dazzle its audience with the artistry and passion of its contestants. These standout performances remind us of the transformative power of dance and its ability to transcend boundaries and create moments of pure magic. Strictly Come Dancing remains a beloved institution that celebrates the joy of dance and the remarkable talents of its participants. As the show continues to evolve and push the boundaries of dance, we can look forward to many more epic routines that will leave a lasting mark on the world of entertainment.","pubDate":"2023-10-29 19:50:00","image_url":null,"source_id":"markmeets","source_priority":90417,"country":["united states of america"],"category":["sports"],"language":"english"},{"article_id":"9ba7e53d339a847f178f0fceac1e8cb7","title":"ویسٹ انڈیز اے نے پاکستان کیخلاف ون ڈے سیریز جیت لی","link":"https://pni.net.pk/sports-news/cricket-news/497544/","keywords":["کرکٹ","کھیل"],"creator":["Tuba Zafar"],"video_url":null,"description":"لاہور ( آئی این پی) ویسٹ انڈیز ویمن اے ٹیم نے پاکستان ویمن اے کے خلاف تین میچوں پر مشتمل ون ڈے سیریز دو، ایک سے اپنے نام کر لی۔لاہور قذافی سٹیڈیم میں کھیلے گئے ون ڈے سیریز کے تیسرے اور آخری میچ میں پاکستان [...] The post ویسٹ انڈیز اے نے پاکستان کیخلاف ون ڈے سیریز جیت لی appeared first on Pakistan News International - Latest Pakistani News in Urdu.","content":"لاہور ( آئی این پی) ویسٹ انڈیز ویمن اے ٹیم نے پاکستان ویمن اے کے خلاف تین میچوں پر مشتمل ون ڈے سیریز دو، ایک سے اپنے نام کر لی۔لاہور قذافی سٹیڈیم میں کھیلے گئے ون ڈے سیریز کے تیسرے اور آخری میچ میں پاکستان اے نے پہلے بیٹنگ کرتے ہوئے 44.4اوورز میں 162رنز بنائے تھے جبکہ ویسٹ انڈیز اے نے 44.5اوورز میں سات وکٹوں کے نقصان پر مطلوبہ ہدف مکمل کر لیا۔ فاتح ٹیم کی جانب سے جنابا جوزف نے ناقابل شکست 51رنز کی اننگ کھیلی جبکہ پاکستان کی جانب سے رامین شمیم نے تین وکٹیں حاصل کیں۔اس سے قبل پاکستانی اننگ میں سدرا نواز نے 27، شوال ذوالفقار نے 22اور انوشا ناصر نے 23رنز بنائے تھے جبکہ مہمان ٹیم کی جانب سے جہازارا کلاکسٹن نے چار کھلاڑیوں کو آئوٹ کیا تھا۔۔۔","pubDate":"2023-10-29 19:43:11","image_url":null,"source_id":"pninet","source_priority":5220220,"country":["pakistan"],"category":["sports"],"language":"urdu"},{"article_id":"7955640f42bd9dc17e6d08fdc8762f42","title":"Lanka confident of beating Afghanistan today","link":"https://www.dailynews.lk/2023/10/30/sports/196262/lanka-confident-of-beating-afghanistan-today/","keywords":["Sports"],"creator":["malinga"],"video_url":null,"description":"After getting back to back victories Sri Lanka cricket team is poised to record their third win against Afghanistan to make semi… The post Lanka confident of beating Afghanistan today appeared first on DailyNews.","content":"After getting back to back victories Sri Lanka cricket team is poised to record their third win against Afghanistan to make semi final of the world cup and in their match at Maharashtra Cricket Association (MCA) Stadium in Pune today (30) from 2pm onwards. This will be very important game to continue the momentum to go forward and Sri Lanka team is confident said Sri Lanka teams most experienced player Angelo Matthew yesterday. We are not underestimating any team but we have a good chance as already we have played more matches against Afghanistan recently and know about them very well. However in this world cup Afghan team has proved their potential to beat top teams before the Sri Lanka match. I had a good game in my first world cup game against England at Bangalore. I bowled and got an early breakthrough taking Dawid Malans wicket .We had two pacemen Kasun Rajitha and Dilshan Madushanka who were among the wickets and bowled well That was the reason we started with that pace duo against England and as a third bowler I started to bowl and got an early breakthrough. when I was not in the world cup I used train hard to build up my talent as well as kept my fitness. I had a chat with Chaminda Vass the fast bowling legend and got some tips and that is my success in bowling. I always had an idea to play franchise tournament and focused on that I used to get hard training. I knew when I get a ball I have to put pressure and I did that against England and got successful results taking two important wickets of Malan and Moein Ali.when I start to bowl I normally do more variations during my over. Line and length, bowling outswinger, inswinger all this type of balls I use my experience to do variations to put pressure and that always brings success said Mathews. I never think about my bowling position. Skipper Kusal Mendis trusted me and he had a plan and I was bowling according to the team s needs said former skipper Mathews. We all believe as a team we can still have a chance to enter semi final. and want can do well in next four matches Afghanistan, India, Bangladesh and New Zealand he said. Here in India I think wickets are very good for batsmen. The day who will perform well they can win but we want to focus on our performance. I couldn’t bat in my last game. I practice hard during my batting we all think same way. We know every batsmen can score heavily in every match but one or two battesr have to play long innings and others have to play with them Kusal Mendis,Charith Asalanka, Pathum Nissanka, Sadeera Samarawickrama, Dilshan Madushanka Dunith Wellalage are young players and they maintain good form and have to build up skills to focus on next world cup If we will do that we will make a good team. What ever decision in future I have to maintain fitness and already proved my fitness by playing matches said Angelo. Meanwhile Sri Lanka also looking to name their final eleven after yesterday training session and most probably opener Dimuth Karunaratne the experienced player will get chance to play for Kusal Janith Perera who is not in good form as an opener. Rest of the team players have good chance to play today’s game. Meanwhile Afghanistan team also hope to make challenge against Sri Lanka today after having two good wins and they also have an idea to enter semi final. Afghanistan skipper Hasthamatullah Shahidi said we have good plans. We played before in Chennai but here in Pune different conditions. I think we have good all round players but match going to be very tough. We played more matches against Sri Lanka, India, Pakistan and Bangladesh recently and we work hard to play game today but always very pressure to play against Sri Lanka. We were struggling against Sri Lanka recently and tried to correct our mistakes to come up today’s game. We had good preparation from last two years to focus on this world cup and our coach Jonathan Trott give good support to us. I believe on the day who perform well can win and want to play positive said Afghanistan skipper.","pubDate":"2023-10-29 19:40:00","image_url":null,"source_id":"dailynews","source_priority":375855,"country":["sri lanka"],"category":["sports"],"language":"english"},{"article_id":"16ddbf82c5ec9d27ad4d11dc303aeb07","title":"Chameera replaces Lahiru Kumara in Sri Lanka squad","link":"https://www.dailynews.lk/2023/10/30/sports/196318/chameera-replaces-lahiru-kumara-in-sri-lanka-squad/","keywords":["Sports"],"creator":["malinga"],"video_url":null,"description":"The Event Technical Committee of the ICC Men’s Cricket World Cup 2023 has approved Dushmantha Chameera as a replacement for Lahiru Kumara… The post Chameera replaces Lahiru Kumara in Sri Lanka squad appeared first on DailyNews.","content":"The Event Technical Committee of the ICC Men’s Cricket World Cup 2023 has approved Dushmantha Chameera as a replacement for Lahiru Kumara in the Sri Lanka squad. This is the second replacement for the Sri Lanka team following Angelo Matthews. Chameera, a seasoned player with 44 ODIs under his belt, steps in for Kumara, who suffered a left thigh muscle injury during training in Pune. The inclusion of Chameera, who is the most experienced bowler of the team, known for his pace and versatile swing bowling, is expected to be advantageous for Sri Lanka in their upcoming matches. Chameera, who had previously been dealing with an injury, has made a full recovery and has demonstrated strong performance during training sessions, earning his place as a replacement. Both Angelo Matthews and Chameera were initially part of the tour as travel reserves but now have joined the squad. Skipper Dasun Shanaka, although making good progress in his recovery, remains as a travel reserve. (DR)","pubDate":"2023-10-29 19:37:00","image_url":null,"source_id":"dailynews","source_priority":375855,"country":["sri lanka"],"category":["sports"],"language":"english"},{"article_id":"da045ce76f7c3f701e48ac2a11960779","title":"Success of Indian shuttlers is due to facilities and correct guidance","link":"https://www.dailynews.lk/2023/10/30/sports/195978/success-of-indian-shuttlers-is-due-to-facilities-and-correct-guidance/","keywords":["Sports"],"creator":["malinga"],"video_url":null,"description":"Former Indian National Badminton player Vimal Kumar who is the Present Director of Prakash Padukone Badminton Academy in Bangalore said the correct… The post Success of Indian shuttlers is due to facilities and correct guidance appeared first on DailyNews.","content":"Former Indian National Badminton player Vimal Kumar who is the Present Director of Prakash Padukone Badminton Academy in Bangalore said the correct guidance and providing good facilities are the reasons for the success of Indian Badminton. Vimal Kumar who played with former Indian number one and National champion Prakash Padukone said this in an exclusive interview with the Daily News. We started this Prakash Padukone Badminton Academy in 1994 and from then up-to-date we have done lot of work to develop India Badminton and as a result today India have Olympic medal champion as well as world level champions We are working independently and no involvement with National Badminton Federation of India .But this Academy is open to any shuttler.We have some standard to select players for this and standard of the players always high level to get service from our well qualified Badminton coaches who do everything for the selected shuttlers said Vimal Kumar. I played for India from 1979 for 15 years I gave my service to India team till1994 Prakash Padukone my self and Vivek Kumar are three good friends from those days while former State champion Vivek is the man who invested more to set up this Badminton Academy.Vivek is dedicated to Prakash Padukone. There are more five or six sports in this Academy . Football, Swimming , Badminton,Cricket and Hockey and Vivek Kumar planned to different centres to locate here .First we started Badminton Academy and then other Academics. some Sri Lankan shuttlers got service from this Academy.Niluka Karunaratne was able to get service from this . We saw two Sri Lanka badminton players take part in Indian challenge International tournament played here this time . The 16 acre land for this Academy and Vivek Kumar invested and dedicated for Prakash and Rahul . Actually many National players produced from here. Indonesia, Malaysia, Denmark, France , England players come for training and very few Sri Lankan among them. Vimal Kumar further said we haven’t any commercial programs here . We have a talent search program and select players to this Academy. Then we give all facilities high standard badminton courts ,very good Badminton coaches , medical service provided by Doctors, Physiotherapists and Masseurs and food and accommodation also given to the players . We normally conduct tournaments to give chance for the players.We conducted many National championship but this is a mainly training centre. Indian Olympic bronze medalist Saina Nehwal 2012 and P.V Sindhu silver medalist in 2016 were also trained here","pubDate":"2023-10-29 19:35:00","image_url":null,"source_id":"dailynews","source_priority":375855,"country":["sri lanka"],"category":["sports"],"language":"english"},{"article_id":"51a2f1b759829d909962f87ef3bfa0a2","title":"Rugby star Ajith Abeyratne makes his last journey today","link":"https://www.dailynews.lk/2023/10/30/sports/196016/rugby-star-ajith-abeyratne-makes-his-last-journey-today/","keywords":["Sports"],"creator":["malinga"],"video_url":null,"description":"Sportsman Ajith Abeyatne born in 1948 was one of Kandy’s sporting icons, who died a few days back will make his last… The post Rugby star Ajith Abeyratne makes his last journey today appeared first on DailyNews.","content":"Sportsman Ajith Abeyatne born in 1948 was one of Kandy’s sporting icons, who died a few days back will make his last journey today He will be cremated on Monday evening at 5 pm at General Cemetery, Borella Ajith was a top class sportsman produced by Trinity College, Kandy in the 1960s. He played rugby for the school at the age of 15, and besides playing rugby; he performed with distinction in cricket, basketball, tennis and athletics. During his time his name was a household one in sports in Kandy. He captained Trinity rugby team in 1967 and 1968 being awarded the Rugby Lion in 1968 and Ryde Gold Medal for the best all round student in the same year. A gentleman to his fingertips Ajith Abeyratne played club rugby for CR and FC as a Number Eight from 1969 to 1974 and played a major role in CR and FC winning the Clifford Cup in 1969 and 1971 and unbeaten league champions in 1973 and 1974 He donned the Sri Lanka jersey. from 1969 to 1972. As a coach Ajith Abeyratne also took the Sri Lanka team to the World Rugby Sevens in Sydney in 1987. He was a Consultant of CR & FC for nearly 20 years. , Ajith was a fine rugby commentator. He hailed from a sporting family with his uncle Hilary Abeyratne playing cricket for Trinity with distinction in 1941 and 1942 ending up as the Vice Principal of Trinity College while his younger brother Seneka played as a centre for Royal College in 1969 and 1970 while the yonngest brother Harsha played cricket for Royal in 1980 and 1981. As Coach of CR & FC 1977 they were SLRFU Trophy champions led by Shiraz Fernando beating Army by 22-9 in the final Ajith toured Wales, Australia, Hong Kong,Bangkok, Taiwan, Singapore, etc. He also coached St. Peter’s College in 1995,beating Trinity and Isipathana twice in one season. He coached champion ‘CR again in 2001 and 2006. (Clifford Cup champions) He also coached the Army team in 1982 and 1983 and guided the Solders to win the SLRFU Presidents Trophy in 1982 under John Senaweera with a 13 -3 win over league champions CH and FC and in 1983 Army led by G Chandra were runners up to CRand FC losing 9-12 in the finals He was Sri Lanka coach from 1985 to 1988 the side were runners up in 1986 and 1987 at the Hong Kong Sevens.","pubDate":"2023-10-29 19:30:00","image_url":null,"source_id":"dailynews","source_priority":375855,"country":["sri lanka"],"category":["sports"],"language":"english"},{"article_id":"1f6df96ea28e1b583957b7994cede69a","title":"Lyon's match at Marseille abandoned after manager injured in team bus attack","link":"https://www.skysports.com/football/news/20876/12996133/lyons-ligue-1-match-at-marseille-abandoned-after-team-bus-attacked","keywords":null,"creator":null,"video_url":null,"description":"Lyon's Ligue 1 match at Marseille has been abandoned after the team's bus was attacked.","content":"Lyon's Ligue 1 match at Marseille has been abandoned after the team's bus was attacked. Lyon manager Fabio Grosso suffered a head injury as the team bus came under attack from fans throwing projectiles before the match. The Lyon bus was hit on the way to Stade Velodrome, shattering some windows. Grosso was injured by falling shards of glass and needed medical treatment with his face heavily bleeding. During his playing days, Grosso famously scored the winning penalty kick for Italy in the shootout victory over France in the 2006 World Cup final. Both clubs have been under pressure lately. Despite replacing Marcelino with Gennaro Gattuso as coach in September, Marseille have still been in poor form with one win and three losses in its last four league games. Lyon are the only team still winless in the league. Ligue 1 table Ligue 1 results Get Sky Sports Download the Sky Sports App Replacing Laurent Blanc with Grosso as coach in September has yet to pay off for Lyon, who sit in last place. More to follow.... This is a breaking news story that is being updated and more details will be published shortly. Please refresh this page for the latest updates. Sky Sports brings you live updates as they happen. Get breaking sports news, analysis, exclusive interviews, replays and highlights. Sky Sports is your trusted source for breaking sports news headlines and live updates. Watch live coverage of your favourite sports: Football, F1, Boxing, Cricket, Golf, Tennis, Rugby League, Rugby Union, NFL, Darts, Netball and get the latest transfers news, results, scores and more. Visit skysports.com or the Sky Sports App for all the breaking sports news headlines . You can receive push notifications from the Sky Sports app for the latest news from your favourite sports and you can also follow @SkySportsNews on Twitter to get the latest updates. Correctly predict six scorelines to win £250,000 for free with Super 6. Entries by 3pm Saturday.","pubDate":"2023-10-29 19:27:00","image_url":"https://e0.365dm.com/23/10/1920x1080/skysports-lyon-bus-bus-attack_6340961.jpg?20231029200110","source_id":"skysports","source_priority":831,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"2b44d9da4f898b27c150ec3ca72930fa","title":"IND vs ENG: রোহিত, শামির ইতিহাস, বাটলারদের লজ্জা, পরিসংখ্যানে ভারত বনাম ইংল্যান্ড ম্যাচ","link":"https://bengali.abplive.com/photo-gallery/sports/cricket-rohit-sharma-mohammed-shami-achieves-milestones-as-india-beat-england-in-lucknow-in-odi-world-cup-2023-match-1020108","keywords":["ক্রিকেট"],"creator":["ABP Ananda"],"video_url":null,"description":"IND vs ENG: রোহিত, শামির ইতিহাস, বাটলারদের লজ্জা, পরিসংখ্যানে ভারত বনাম ইংল্যান্ড ম্যাচ","content":"লখনউয়ের মাঠে ইংল্যান্ডকে ১০০ রানে হারিয়ে চলতি বিশ্বকাপে ছয়ে ছয় করে ফেলেছে ভারতীয় দল। এই জয়ের সুবাদে একদিকে যেখানে ইংল্যান্ড সেমিফাইনালের পৌঁছনো প্রায় অসম্ভব, সেখানে ভারতের শেষ চারে পৌঁছনো কার্যত নিশ্চিত। ইংল্যান্ডের বিরুদ্ধে শূন্য রানে আউট হন বিরাট কোহলি। এই প্রথমবার সীমিত ওভারের বিশ্বকাপে কোহলিকে খাতা খোলার আগেই সাজঘরে ফিরতে হল। তাঁর ৫৬ ম্যাচের দৌড় থামল। এটিই আবার ভারতীয় অধিনায়ক হিসাবে রোহিত শর্মার শততম ম্যাচ ছিল। সপ্তম ভারতীয় অধিনায়ক হিসাবে এই মাইলফলক স্পর্শ করলেন রোহিত। মাইলফলক ম্যাচে অনবদ্য ৮৭ রানের ইনিংস খেলেন ভারতীয় অধিনায়ক। সচিন তেন্ডুলকর, রাহুল দ্রাবিড়, সৌরভ গঙ্গোপাধ্যায় ও বিরাট কোহলির পর মাত্র পঞ্চম ভারতীয় হিসাবে আন্তর্জাতিক ক্রিকেটে ১৮ হাজার রানের গণ্ডি পার করলেন রোহিত শর্মা। এই নিয়ে বিশ্বকাপে রোহিত ১২ নম্বর বার অর্ধশতরানের গণ্ডি পার করলেন। পঞ্চম ব্যাটার হিসাবে এই কৃতিত্ব গড়েন তিনি। কোহলির পাশাপাশি ইংল্যান্ড তারকা জো রুটও এদিন শূন্য রানে আউট হন। প্রথমবার তিনি ৫০ ওভারের বিশ্বকাপে শূন্য রানে ফিরলেন। এই প্রথমবার ওয়ান ডে বিশ্বকাপের ইতিহাসে দুই দলেরই তিন নম্বরে নামা ব্যাটার শূন্য রানে আউট হলেন। মহম্মদ শামি ম্যাচে চারটি উইকেট নিয়ে। দ্রুততম বোলার হিসাবে মাত্র ১৩ ইনিংসে বিশ্বকাপে শামি ৪০টি উইকেট নেওয়ার কৃতিত্ব নিজের নামে করলেন। ইংল্যান্ডের ছয় ব্যাটার এদিন বোল্ড হন। বিশ্বকাপের ইতিহাসে এক ম্যাচ এর থেকে বেশি কেবল এক দলের (১৯৭৫ সালে পূর্ব আফ্রিকা) ব্যাটাররাই বোল্ড হয়েছিলেন। এই নিয়ে প্রথমবার বিশ্বকাপের মঞ্চে টানা চার ম্যাচ হারতে হল ইংল্যান্ডকে। বিশ্বকাপে ইতিমধ্যেই পাঁচ ম্যাচ হেরেছেন বাটলাররা, যা যে কোনও বিশ্বকাপে গতবারের চ্যাম্পিয়নদের জন্য সর্বাধিক। বিশ্বকাপের মঞ্চে এটি ভারতের ৫৯তম জয়। ভারত জয়ের নিরিখে নিউজ়িল্যান্ডকে পিছনে ফেলে দিল। কেবল অস্ট্রেলিয়া বিশ্বকাপের মঞ্চে ভারতের থেকে অধিক ম্যাচ (৭৩) জিতেছে। IND vs ENG LIVE Score Today: ছয়ে ছয়! দুরন্ত বোলিংয়ে ভর করে ইংল্যান্ডকে ১০০ রানে উড়িয়ে দিল ভারত","pubDate":"2023-10-29 22:28:31","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/10/30/680250a7547c1fe2289ab3c6c425c4751698618662354507_original.jpg","source_id":"abplive","source_priority":10959,"country":["india"],"category":["sports"],"language":"bengali"},{"article_id":"3f47cc0f184d9b7888a42ee15f4273e0","title":"Freddie Flintoff training guide dog as England cricket icon recovers from horror crash","link":"https://www.dailystar.co.uk/sport/other-sports/freddie-flintoff-injuries-dog-cricket-31311087","keywords":["Sport"],"creator":null,"video_url":null,"description":"England cricket legend Andrew 'Freddie' Flintoff suffered injuries last December, when his open-topped, three-wheeled car flipped over on the Top Gear test track","content":"Freddie Flintoff has been training a guide dog as he continues to recover from his horror Top Gear crash injuries. The retired England cricket hero is caring for the pooch as part of his rehab after suffering ‘life-altering’ facial wounds. He was spotted out walking the Labrador puppy near his £5.25million home in Hale, Manchester. Freddie, 45, looked relaxed as he strolled along wearing a beanie hat, backpack and tinted glasses. But pals have revealed when he first started training his new furry friend, he was prone to taking a tumble. Last month former team-mate Steve Harmison, 45, described meeting up with the injured star a few weeks earlier. He said: “Believe it or not, he was training a guide dog. Which I’m sure is going better now than it was, because he tripped over about three times on his way around the field.” Fans have been thrilled to see the dad-of-four back on his feet after the smash in December, when his open-topped, three-wheeled car flipped over on the Top Gear test track. He was airlifted to hospital from Dunsford Aerodrome in Surrey. Freddie was not wearing a helmet when he lost control of the Morgan Super 3 roadster while taking a corner at 22mph. He quit his presenting job soon afterwards and the BBC cancelled the last series of the show. After months of hiding his injuries, he made his first public appearance in September when he coached England cricketers in Cardiff. Speaking afterwards, Steve said: “It was great to see him back. You’ve seen the pictures of him with a smile on his face but I saw him about six weeks ago – but at that time he covered his face up.” Freddie is said to have received £9million in compensation for the accident – a figure based on two years’ lost earnings. The BBC says no final decision has been made about the future of Top Gear. However, Flintoff will return to the corporation for a second series of Field Of Dreams, mentoring youngsters in cricket.","pubDate":"2023-10-29 21:24:10","image_url":"https://i2-prod.dailystar.co.uk/incoming/article31311091.ece/ALTERNATES/s98/1_Britain-Cricket-England-New-Zealand-23256385165522.jpg","source_id":"dailystar","source_priority":3076,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"54fdf70cd7ec8358b6381afeb57e01e6","title":"England admit to being clueless about significant Cricket World Cup rule change to Champions Trophy qualification","link":"https://7news.com.au/sport/cricket/england-admit-to-being-clueless-about-significant-cricket-world-cup-rule-change-after-defeat-to-india-c-12370880","keywords":null,"creator":["Glenn Valencich"],"video_url":null,"description":"The reigning champions’ tournament has gone from bad to worse after an alarming discovery during a heavy loss to India.","content":"England coach Matthew Mott has owned up to being in the dark on a significant rule change for the . The reigning champions suffered their fifth defeat in six matches at the tournament when they collapsed to all out for 129 chasing just 230 for victory against hosts India. Defeat anchored England to 10th and rock bottom on the table, behind both the Netherlands and Bangladesh, with matches against Australia, the Dutch and Pakistan to come. One victory might be enough for Mott’s side to avoid finishing last but two are likely to be required to avoid an ignominious consequence: missing out on the next major 50-over global competition. Places at the 2025 Champions Trophy are allocated based on performances in this year’s World Cup, with hosts Pakistan joined by the seventh highest finishers. It had previously been linked to world rankings. The switch was ratified by the ICC board in November 2021 but the information appears to have been missed in the handovers to Mott and ECB chief executive Richard Gould. It reared its head again during England’s loss to India, prompting questions in the post-match press conference. Asked when he learned about the Champions Trophy headache, Mott conceded “about an hour and a half ago.” “The ICC do change the rules quite a bit with qualification,” the Australian added. “But to be honest, I don’t think it would affect in any way the way we’ve played in this tournament, so it’s not a big deal.” The Champions Trophy has become an ugly duckling in the ICC’s calendar since the T20 World Cup came to prominence, with the former officially on the scrapheap twice before it was reintroduced first for 2017 and again for 2025. In spite of its relatively lowly status it would still be an embarrassment for England, one of the richest nations in cricket, to miss out on the event. The ECB hosted in 2013 and stepped up to do so again in 2017 when the tournament was brought back from the dead. Meanwhile, Mott has rejected suggestions from England’s 2019 World Cup-winning captain Eoin Morgan about the team being “unsettled” behind the scenes. The pair worked together when Mott took over the white-ball side 18 months ago but the skipper retired soon after. Morgan’s word still carries plenty of weight and his observations about his old teammates have raised eyebrows. Speaking to Sky Sports prior to England’s loss to India, Morgan said the side were “definitely unsettled”. Responding to the idea they were simply off form, he added: “There’s something else going on - there has to be”. Mott said he would approach Morgan in a bid to set things straight. “Eoin’s entitled to his opinion. He’s obviously been away (from India) for a couple of weeks with the birth of his child and he hasn’t been in and around the rooms,” Mott said. “But I’ll certainly take that up with him and have a chat to him. We’ve got a really good relationship with him so if he’s seeing something I’m not I’ll definitely have that conversation. “I don’t think that (is the case) at all. Anyone inside our tent at the moment would say, despite our results, we’re an incredibly tight-knit unit. “I can only say, from my opinion, that the group has been incredibly strong. Chris Woakes also stood up for the unity of the squad, telling Sky: “I can firmly say there is nothing wrong with the dressing room.”","pubDate":"2023-10-29 20:25:38","image_url":"https://images.7news.com.au/publication/C-12370880/9947b1a09b445ca21f76b0fd28c52bd9963f5738-16x9-x0y0w1304h734.jpg","source_id":"7news","source_priority":7652,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"4087b93a182d125d5a64b593dc46db03","title":"Every Perfect 40 Score in Strictly Come Dancing History","link":"https://markmeets.com/entertainment/every-perfect-40-score-in-strictly-come-dancing-history/?utm_source=rss&utm_medium=rss&utm_campaign=every-perfect-40-score-in-strictly-come-dancing-history","keywords":["Entertainment","Dancing","markmeets","Perfect","Routine","Scored","Strictly"],"creator":["Lee Clarke"],"video_url":null,"description":"Strictly Come Dancing contestants aim for one thing during their journey on the BBC TV series – a perfect score of 40. The post Every Perfect 40 Score in Strictly Come Dancing History first appeared on MarkMeets | Entertainment, Music, Movie, TV & London Film Premiere News.","content":"Strictly Come Dancing contestants aim for one thing during their journey on the BBC TV series – a perfect score of 40. This coveted accolade is bestowed by all four judges, and it’s a rare feat, but when achieved, it marks a remarkable performance. Over the 19-year history of the show, there have been more than 70 dances that earned a perfect 40. While the 2023 cast is yet to join this elite group, let’s revisit some of the most memorable routines that achieved perfection. Jill Halfpenny and Darren Bennett’s Jive (Series 2) In the early days of Strictly Come Dancing, actress Jill Halfpenny and her partner Darren Bennett wowed the audience with a high-tempo Jive set to “I’m Still Standing.” Their electric performance in the series two finale earned them the very first perfect score of 40 from all four judges – Len Goodman, Arlene Phillips, Craig Revel Horwood, and Bruno Tonioli. Jill went on to win the entire series in 2004 and even made a return to the show to reprise her impressive Jive. Mark Ramprakash and Karen Hardy’s Salsa (Series 4) It wasn’t until series four that perfection was achieved once more. Cricketer Mark Ramprakash and his partner Karen Hardy danced a thrilling Salsa to “Hot Hot Hot.” Their journey to perfection had a rocky start when Mark’s microphone got tangled in Karen’s dress, causing them to restart the routine. Despite this setback, they managed to score 36 and later delivered a flawless performance in the final, earning the coveted 40. Matt Di Angelo and Flavia Cacace’s Viennese Waltz (Series 5) Matt Di Angelo and Flavia Cacace made history by becoming the first couple to earn a perfect 40 before the final. Their romantic semi-final Viennese Waltz, danced to “Open Arms” in series five, showcased their exceptional chemistry and skill. Despite their exceptional performance, they did not secure the series win. Alesha Dixon and her partner Matthew Cutler claimed the glitterball trophy, even though they never managed to score a perfect 40. Alesha later became a judge on the show from series seven before departing after three years. Lisa Snowdon and Brendan Cole’s Hat-Trick (Series 6) Lisa Snowdon and Brendan Cole etched their names in Strictly history by becoming the first couple to achieve a perfect 40 in not one but three different routines. Their remarkable hat-trick included a semi-final Quickstep set to Frank Sinatra’s “Dancing in the Dark,” a Foxtrot danced to “Walkin’ My Baby Back Home,” and a Cha-cha-cha performed to “Tears Dry on Their Own” in the final. Despite their impressive scores, Tom Chambers and Camilla Dallerup won series six. Rachel Stevens and Vincent Simone’s Foxtrot (Series 6) In the same series, S Club 7 singer Rachel Stevens proved her prowess in the ballroom with a captivating Foxtrot. Set to “They Long to Be Close to You,” her Foxtrot earned a perfect 40 in both week 10 and the final when she reprised it with her partner Vincent Simone. Ali Bastian and Brian Fortuna’s Double Perfect (Series 7) Series seven saw an increase in perfect scores, with three couples earning a 40. Starting with actor Ali Bastian, who danced a stunning Viennese Waltz to “Do Right Woman, Do Right Man” during the Blackpool episode. As a new addition, guest judge Darcey Bussell made it possible to score 50. Ali achieved this feat with her American Smooth to “Come Dance with Me.” Chris Hollins and Ola Jordan’s Charleston (Series 7) The introduction of Blackpool as a regular venue and the Charleston as a new dance style added to the excitement. Cricketer and journalist Chris Hollins and his partner Ola Jordan performed a Charleston to “Fat Sam’s Grand Slam” from the “Bugsy Malone” film, scoring a perfect 50 and clinching the series victory. Pamela Stephenson and James Jordan’s Movie Magic (Series 8) In series eight, James Jordan and Pamela Stephenson were the only couple to achieve a perfect 40. Their Movie Week Viennese Waltz to “Unchained Melody” from “Ghost” did it twice – once in week ten, and again when they performed it in the final. Their Quickstep to “Steppin’ Out with My Baby” also reached perfection. However, it was Kara Tointon and Artem Chigvintsev who won and went on to become a real-life couple. Harry Judd and Aliona Vilani’s Dynamic Duo (Series 9) Series nine witnessed another trio of couples earning perfect scores of 40. Harry Judd and Aliona Vilani, the eventual winners, delivered captivating performances. Their Quickstep to “Don’t Get Me Wrong” and Argentine Tango to “Asi se baila el tango” became the first perfect 40s for this style of dance. Jason Donovan and Kristina Rihanoff’s Theatrical Argentine Tango (Series 9) Jason Donovan added to the series nine perfection with a compelling Argentine Tango to “El Tango de Roxanne.” His charismatic performance proved he was more than a one-trick pony, and it highlighted the show’s diverse dance styles. Chelsee Healey and Pasha Kovalev’s Passionate Paso Doble (Series 9) Hollyoaks actor Chelsee Healey may not have won the series, but she was a fan favorite. Her fiery Paso Doble to “Malagueña” showcased her impressive skills, earning her a perfect 40 and leaving a lasting mark on the show. Kimberley Walsh and Pasha Kovalev’s Triple 40 Triumph (Series 10) Series ten marked the addition of Darcey Bussell to the judging panel, replacing Alesha Dixon. This series also introduced the fusion of two dance styles. Kimberley Walsh’s cha-cha-cha/tango hybrid to “It’s Raining Men” impressed the judges. Her Charleston to “Those Magnificent Men in Their Flying Machines” and Tango to “When Doves Cry” also secured perfect 40 scores. Denise Van Outen and James Jordan’s Energetic Showmanship (Series 10) TV personality Denise Van Outen showcased her growth throughout the series with a dynamic Showdance to “What a Feeling” from “Flashdance.” Her equally energetic Charleston to “Walk Like an Egyptian” earned her another perfect score. Louis Smith and Flavia Cacace’s Gymnastic Glory (Series 10) Series ten was a tough competition, but gymnast Louis Smith emerged victorious with his Showdance to “Rule the World.” His incredible performance showcased his Olympic strength and earned him a perfect score, making him the series champion. Abbey Clancy and Aljaž Škorjanec’s Salsa Sensation (Series 11) Nine years after the last perfect 40 for a Salsa, model Abbey Clancy broke the dance’s curse with a scorching routine to “You Should Be Dancing” from “Saturday Night Fever.” Switching gears, she also delivered a beautiful Waltz to “Kissing You,” securing her victory and the coveted Glitterball trophy. Natalie Gumede and Artem Chigvintsev’s Stellar Salsa (Series 11) Although Abbey Clancy took home the trophy, actress Natalie Gumede gave her tough competition. Her sultry Salsa to “Wanna Be Startin’ Somethin’” and Showdance to “Steppin’ Out with My Baby” both earned her perfect 40 scores and showcased her incredible dancing abilities. Caroline Flack and Pasha Kovalev’s Perfection in Variety (Series 12) Caroline Flack made history in series 12 as the first contestant to not drop a single mark in the final. Alongside her partner Pasha Kovalev, she delivered a lively Cha-cha-cha to “Can You Feel It,” a fairytale Showdance to “Angels,” and a playful Charleston to “Istanbul.” Her versatility and consistency made her the series champion. Simon Webbe and Kristina Rihanoff’s Argentine Tango Excellence (Series 12) Simon Webbe and Kristina Rihanoff’s Argentine Tango made waves in Blackpool and nearly secured a perfect 40. Their moody performance to “El Tango de Roxanne” left a lasting impression. Kellie Bright and Kevin Clifton’s Double Perfect (Series 13) In series 13, Kellie Bright and Kevin Clifton made history by achieving a perfect 40 in two separate routines. Their finale Showdance to “The Ding-Dong Daddy of the D-Car Line” and Charleston to “Chicago’s Hot Honey Rag” captivated the judges, although it was Jay McGuiness and Aliona Vilani who claimed the series victory. Ore Oduba and Joanne Clifton’s Jive and Showdance (Series 14) Presenter Ore Oduba delivered the first perfect Jive of the series with “Runaway Baby” and earned top marks for his Showdance to “I Got Rhythm.” His stellar performances secured his victory in series 14, but he wasn’t the only one to earn a perfect 40. Louise Redknapp and Kevin Clifton’s Sensational Argentine Tango (Series 14) Louise Redknapp and Kevin Clifton’s Argentine Tango to “Tanguera” was an exceptional performance that earned them a perfect score. Kevin continued his streak of 40s with this mesmerizing routine. Danny Mac and Oti Mabuse’s Spectacular Trio (Series 14) In a series filled with talent, actor Danny Mac delivered a trio of perfect 40s. His Charleston to “Puttin’ On the Ritz,” Showdance to “Set Fire to the Rain,” and Samba to “Magalenha” wowed the judges and the audience. His exceptional dancing skills and consistency impressed everyone. Debbie McGee and Giovanni Pernice’s Tango Magic (Series 15) Series 15, the first with Shirley Ballas as a judge, featured three couples earning perfect scores of 40. Debbie McGee’s Tango to “I Gotta Feeling” was a standout routine, as was her captivating high kick in the Argentine Tango to “Por una Cabeza.” Her flawless performances added to the series’ perfect 40s. Alexandra Burke and Gorka Marquez’s Show-Stopping American Smooth and Jive (Series 15) Singer Alexandra Burke proved to be one of the series’ most talented dancers. Her American Smooth to “Wouldn’t It Be Loverly” and incredibly quick Jive to “Proud Mary” were nothing short of incredible, earning her perfect 40s. Joe McFadden and Katya Jones’ Charismatic Charleston (Series 15) Joe McFadden’s Charleston to “Alexander’s Ragtime Band” sent him to the top of the leaderboard and into the nation’s hearts. His charismatic performance earned him a perfect score and secured his victory in series 15. Ashley Roberts and Pasha Kovalev’s Remarkable Quartet (Series 16) Ashley Roberts dazzled the audience with a quartet of perfect 40s in the final. Her Salsa to “(I’ve Had) The Time of My Life” from “Dirty Dancing,” featuring an epic lift, her Showdance to “Keeping Your Head Up,” and her Charleston to “Witch Doctor” left a lasting mark on the series. She also earned a perfect 40 for her Jive to “Shake a Tail Feather” in Blackpool. Faye Tozer and Giovanni Pernice’s Fantastic Four (Series 16) Steps singer Faye Tozer secured perfect 40s in four separate routines. Her Charleston to “The Lonely Goatherd,” Viennese Waltz to “It’s a Man’s Man’s Man’s World,” Showdance to “Lullaby of Broadway,” and Theatre/Jazz to “Fever” showcased her versatility and dance prowess. However, it was Stacey Dooley and Kevin Clifton who won series 16. Kelvin Fletcher and Oti Mabuse’s Ballroom Brilliance (Series 17) Kelvin Fletcher won series 17, and his quickstep to “The Lady is a Tramp” showcased his ballroom mastery. His Showdance to “Shout” was equally impressive, highlighting his versatility as a dancer. Karim Zeroual and Amy Dowden’s Sensational Jive and Quickstep (Series 17) Kelvin and Oti may have clinched the victory, but Karim Zeroual and Amy Dowden had the dance of the series with their Jive to “You Can’t Stop the Beat” from “Hairspray.” Their exceptional performance earned them a perfect score, not just once but twice – in Blackpool and at the finale. They also achieved a 40/40 for their Quickstep to “Mr. Pinstripe Suit.” Bill Bailey and Oti Mabuse’s Grand Finale (Series 18) Series 18 faced unique challenges due to Covid-19 travel restrictions, leading to a reduced judging panel. With three judges instead of four, a score of 30 became the new 40. Comedian Bill Bailey, partnered with Oti Mabuse, secured the highest available score of 30 for his Showdance to “The Show Must Go On.” Bill’s remarkable journey culminated in his victory, making Oti champion for two consecutive years. Maisie Smith and Gorka Marquez’s Street/Commercial and Festive Finale (Series 18) Actor Maisie Smith was a strong contender throughout the series. Her street/commercial dance to “Gettin’ Jiggy wit It” and festive Showdance to “We Need a Little Christmas” both earned perfect scores of 30. HRVY and Janette Manrara’s Street/Commercial, Charleston, and American Smooth (Series 18) HRVY made his presence known in the competition by achieving a perfect score of 30 an impressive three times. His street/commercial dance to “A Sky Full of Stars,” Charleston to “Another Day of Sun” from “La La Land,” and American Smooth to “One (Singular Sensation)” were undeniably brilliant. Rhys Stephenson and Nancy Xu’s Charleston: A Toe-Tapping Triumph One of the most delightful moments in Strictly history came when CBBC presenter Rhys Stephenson and the talented Nancy Xu took to the dance floor to perform the Charleston. The choice of music, “The Charleston,” was not only aptly named but also perfectly suited to the infectious energy and charm that Rhys and Nancy brought to their routine. While the duo fell just short of making it to the final, they won the hearts of the audience with their Charleston performance. This lively and exuberant dance, characterized by its energetic kicks and twirls, transported viewers back to the Roaring Twenties, where flappers and jazz music reigned supreme. Rhys and Nancy’s interpretation of the Charleston was a masterclass in capturing the spirit of the era. AJ Odudu and Kai Widdrington’s Quickstep: A Bittersweet Journey AJ Odudu, known for her role as the host of Big Brother, made a significant impact on Strictly with her impressive Quickstep performance, accompanied by her partner Kai Widdrington. However, their journey was bittersweet, as AJ had to withdraw from the competition due to an injury just before the final. In the semi-finals, AJ and Kai delivered a Quickstep that earned them a perfect score of 40. Their dance was set to the classic tune “Sing, Sing, Sing (With a Swing).” The Quickstep is known for its fast-paced, joyful movements, and AJ and Kai executed it with precision and style. Their partnership on the dance floor was a testament to the dedication and hard work that contestants put into the competition. John Whaite and Johannes Radebe’s Pasodoble and Showdance: Breaking Boundaries John Whaite and Johannes Radebe made history on Strictly Come Dancing as the first all-male pairing. Their performances were nothing short of spectacular, leaving a lasting impression on both the judges and the audience. Two of their standout routines were the Paso Doble and the Showdance. For the Paso Doble, John and Johannes danced to “He’s a Pirate” from “Pirates of the Caribbean: The Curse of the Black Pearl” during the movie-themed week. The Paso Doble is a passionate and dramatic dance, and their portrayal was nothing less than spectacular. Their choreography was filled with intensity and precision, earning them rave reviews. The Showdance was another highlight of their journey, set to “You’ve Got the Love.” Their dance was a beautiful and emotional display of their partnership, showcasing their incredible chemistry and skill. It was no surprise that their efforts were rewarded with the ultimate recognition. Rose Ayling-Ellis and Giovanni Pernice: A Historic Tango and a Poetic Couple’s Choice Actor Rose Ayling-Ellis and her partner Giovanni Pernice etched their names in the Strictly history books with their remarkable performances. In week six, they delivered a Tango that received a perfect score of 40, marking the earliest occurrence of a perfect score in the show’s history. The dance was set to “Shivers” and showcased their exceptional talent and chemistry. Their Couple’s Choice performance was a standout moment for its unique and poetic approach. Dancing to “Symphony,” they performed a sequence in silence, celebrating Rose, who is deaf. This moving and visually stunning routine was a testament to the power of dance as a universal language that transcends barriers. To add to their achievements, Rose and Giovanni’s Showdance, set to “The Rose,” was nothing short of epic. Their chemistry and storytelling through dance were unparalleled, making it clear why they emerged as the winners of series 19. Helen Skelton and Gorka Marquez’s Mesmerizing Couple’s Choice In a more recent series, TV presenter Helen Skelton graced the Strictly dance floor with her mesmerizing Couple’s Choice routine. This unique and contemporary dance style allows couples to express themselves without the constraints of traditional ballroom or Latin steps. Helen’s Couple’s Choice performance was set to “Mein Herr” from the musical “Cabaret.” It was an exquisite fusion of dance styles and emotions, earning her full marks. What made this routine even more exceptional was her flawless execution in the finale, securing her a place in the annals of epic Strictly routines. Fleur East and Vito Coppola’s Dynamic Tribute Fleur East, a singer and songwriter, paid a vibrant and dynamic tribute to her favorite band, Destiny’s Child, with a Couple’s Choice performance. This unconventional dance style allowed Fleur and her partner, Vito Coppola, to let loose and showcase their incredible talent. Their routine featured a medley of Destiny’s Child hits, and it was a true spectacle of energy and creativity. The freedom that Couple’s Choice offers was evident as they brought the spirit of Destiny’s Child to life on the dance floor. Fleur and Vito’s journey didn’t stop there. They also took on the Samba, a lively and rhythmically challenging Latin dance. Dancing to “Hot Hot Hot,” they followed in the footsteps of a memorable performance by Mark and Karen from the early days of Strictly, earning a perfect score of 40. Their ability to master different dance styles and bring their unique flair to each performance was a testament to their artistry. Strictly Come Dancing has been a treasure trove of exceptional dance performances over the years. From the lively and exuberant Charleston of Rhys Stephenson and Nancy Xu to the history-making routines of John Whaite and Johannes Radebe, the show continues to dazzle its audience with the artistry and passion of its contestants. These standout performances remind us of the transformative power of dance and its ability to transcend boundaries and create moments of pure magic. Strictly Come Dancing remains a beloved institution that celebrates the joy of dance and the remarkable talents of its participants. As the show continues to evolve and push the boundaries of dance, we can look forward to many more epic routines that will leave a lasting mark on the world of entertainment.","pubDate":"2023-10-29 19:50:00","image_url":null,"source_id":"markmeets","source_priority":90417,"country":["united states of america"],"category":["sports"],"language":"english"},{"article_id":"9ba7e53d339a847f178f0fceac1e8cb7","title":"ویسٹ انڈیز اے نے پاکستان کیخلاف ون ڈے سیریز جیت لی","link":"https://pni.net.pk/sports-news/cricket-news/497544/","keywords":["کرکٹ","کھیل"],"creator":["Tuba Zafar"],"video_url":null,"description":"لاہور ( آئی این پی) ویسٹ انڈیز ویمن اے ٹیم نے پاکستان ویمن اے کے خلاف تین میچوں پر مشتمل ون ڈے سیریز دو، ایک سے اپنے نام کر لی۔لاہور قذافی سٹیڈیم میں کھیلے گئے ون ڈے سیریز کے تیسرے اور آخری میچ میں پاکستان [...] The post ویسٹ انڈیز اے نے پاکستان کیخلاف ون ڈے سیریز جیت لی appeared first on Pakistan News International - Latest Pakistani News in Urdu.","content":"لاہور ( آئی این پی) ویسٹ انڈیز ویمن اے ٹیم نے پاکستان ویمن اے کے خلاف تین میچوں پر مشتمل ون ڈے سیریز دو، ایک سے اپنے نام کر لی۔لاہور قذافی سٹیڈیم میں کھیلے گئے ون ڈے سیریز کے تیسرے اور آخری میچ میں پاکستان اے نے پہلے بیٹنگ کرتے ہوئے 44.4اوورز میں 162رنز بنائے تھے جبکہ ویسٹ انڈیز اے نے 44.5اوورز میں سات وکٹوں کے نقصان پر مطلوبہ ہدف مکمل کر لیا۔ فاتح ٹیم کی جانب سے جنابا جوزف نے ناقابل شکست 51رنز کی اننگ کھیلی جبکہ پاکستان کی جانب سے رامین شمیم نے تین وکٹیں حاصل کیں۔اس سے قبل پاکستانی اننگ میں سدرا نواز نے 27، شوال ذوالفقار نے 22اور انوشا ناصر نے 23رنز بنائے تھے جبکہ مہمان ٹیم کی جانب سے جہازارا کلاکسٹن نے چار کھلاڑیوں کو آئوٹ کیا تھا۔۔۔","pubDate":"2023-10-29 19:43:11","image_url":null,"source_id":"pninet","source_priority":5220220,"country":["pakistan"],"category":["sports"],"language":"urdu"},{"article_id":"7955640f42bd9dc17e6d08fdc8762f42","title":"Lanka confident of beating Afghanistan today","link":"https://www.dailynews.lk/2023/10/30/sports/196262/lanka-confident-of-beating-afghanistan-today/","keywords":["Sports"],"creator":["malinga"],"video_url":null,"description":"After getting back to back victories Sri Lanka cricket team is poised to record their third win against Afghanistan to make semi… The post Lanka confident of beating Afghanistan today appeared first on DailyNews.","content":"After getting back to back victories Sri Lanka cricket team is poised to record their third win against Afghanistan to make semi final of the world cup and in their match at Maharashtra Cricket Association (MCA) Stadium in Pune today (30) from 2pm onwards. This will be very important game to continue the momentum to go forward and Sri Lanka team is confident said Sri Lanka teams most experienced player Angelo Matthew yesterday. We are not underestimating any team but we have a good chance as already we have played more matches against Afghanistan recently and know about them very well. However in this world cup Afghan team has proved their potential to beat top teams before the Sri Lanka match. I had a good game in my first world cup game against England at Bangalore. I bowled and got an early breakthrough taking Dawid Malans wicket .We had two pacemen Kasun Rajitha and Dilshan Madushanka who were among the wickets and bowled well That was the reason we started with that pace duo against England and as a third bowler I started to bowl and got an early breakthrough. when I was not in the world cup I used train hard to build up my talent as well as kept my fitness. I had a chat with Chaminda Vass the fast bowling legend and got some tips and that is my success in bowling. I always had an idea to play franchise tournament and focused on that I used to get hard training. I knew when I get a ball I have to put pressure and I did that against England and got successful results taking two important wickets of Malan and Moein Ali.when I start to bowl I normally do more variations during my over. Line and length, bowling outswinger, inswinger all this type of balls I use my experience to do variations to put pressure and that always brings success said Mathews. I never think about my bowling position. Skipper Kusal Mendis trusted me and he had a plan and I was bowling according to the team s needs said former skipper Mathews. We all believe as a team we can still have a chance to enter semi final. and want can do well in next four matches Afghanistan, India, Bangladesh and New Zealand he said. Here in India I think wickets are very good for batsmen. The day who will perform well they can win but we want to focus on our performance. I couldn’t bat in my last game. I practice hard during my batting we all think same way. We know every batsmen can score heavily in every match but one or two battesr have to play long innings and others have to play with them Kusal Mendis,Charith Asalanka, Pathum Nissanka, Sadeera Samarawickrama, Dilshan Madushanka Dunith Wellalage are young players and they maintain good form and have to build up skills to focus on next world cup If we will do that we will make a good team. What ever decision in future I have to maintain fitness and already proved my fitness by playing matches said Angelo. Meanwhile Sri Lanka also looking to name their final eleven after yesterday training session and most probably opener Dimuth Karunaratne the experienced player will get chance to play for Kusal Janith Perera who is not in good form as an opener. Rest of the team players have good chance to play today’s game. Meanwhile Afghanistan team also hope to make challenge against Sri Lanka today after having two good wins and they also have an idea to enter semi final. Afghanistan skipper Hasthamatullah Shahidi said we have good plans. We played before in Chennai but here in Pune different conditions. I think we have good all round players but match going to be very tough. We played more matches against Sri Lanka, India, Pakistan and Bangladesh recently and we work hard to play game today but always very pressure to play against Sri Lanka. We were struggling against Sri Lanka recently and tried to correct our mistakes to come up today’s game. We had good preparation from last two years to focus on this world cup and our coach Jonathan Trott give good support to us. I believe on the day who perform well can win and want to play positive said Afghanistan skipper.","pubDate":"2023-10-29 19:40:00","image_url":null,"source_id":"dailynews","source_priority":375855,"country":["sri lanka"],"category":["sports"],"language":"english"},{"article_id":"16ddbf82c5ec9d27ad4d11dc303aeb07","title":"Chameera replaces Lahiru Kumara in Sri Lanka squad","link":"https://www.dailynews.lk/2023/10/30/sports/196318/chameera-replaces-lahiru-kumara-in-sri-lanka-squad/","keywords":["Sports"],"creator":["malinga"],"video_url":null,"description":"The Event Technical Committee of the ICC Men’s Cricket World Cup 2023 has approved Dushmantha Chameera as a replacement for Lahiru Kumara… The post Chameera replaces Lahiru Kumara in Sri Lanka squad appeared first on DailyNews.","content":"The Event Technical Committee of the ICC Men’s Cricket World Cup 2023 has approved Dushmantha Chameera as a replacement for Lahiru Kumara in the Sri Lanka squad. This is the second replacement for the Sri Lanka team following Angelo Matthews. Chameera, a seasoned player with 44 ODIs under his belt, steps in for Kumara, who suffered a left thigh muscle injury during training in Pune. The inclusion of Chameera, who is the most experienced bowler of the team, known for his pace and versatile swing bowling, is expected to be advantageous for Sri Lanka in their upcoming matches. Chameera, who had previously been dealing with an injury, has made a full recovery and has demonstrated strong performance during training sessions, earning his place as a replacement. Both Angelo Matthews and Chameera were initially part of the tour as travel reserves but now have joined the squad. Skipper Dasun Shanaka, although making good progress in his recovery, remains as a travel reserve. (DR)","pubDate":"2023-10-29 19:37:00","image_url":null,"source_id":"dailynews","source_priority":375855,"country":["sri lanka"],"category":["sports"],"language":"english"},{"article_id":"da045ce76f7c3f701e48ac2a11960779","title":"Success of Indian shuttlers is due to facilities and correct guidance","link":"https://www.dailynews.lk/2023/10/30/sports/195978/success-of-indian-shuttlers-is-due-to-facilities-and-correct-guidance/","keywords":["Sports"],"creator":["malinga"],"video_url":null,"description":"Former Indian National Badminton player Vimal Kumar who is the Present Director of Prakash Padukone Badminton Academy in Bangalore said the correct… The post Success of Indian shuttlers is due to facilities and correct guidance appeared first on DailyNews.","content":"Former Indian National Badminton player Vimal Kumar who is the Present Director of Prakash Padukone Badminton Academy in Bangalore said the correct guidance and providing good facilities are the reasons for the success of Indian Badminton. Vimal Kumar who played with former Indian number one and National champion Prakash Padukone said this in an exclusive interview with the Daily News. We started this Prakash Padukone Badminton Academy in 1994 and from then up-to-date we have done lot of work to develop India Badminton and as a result today India have Olympic medal champion as well as world level champions We are working independently and no involvement with National Badminton Federation of India .But this Academy is open to any shuttler.We have some standard to select players for this and standard of the players always high level to get service from our well qualified Badminton coaches who do everything for the selected shuttlers said Vimal Kumar. I played for India from 1979 for 15 years I gave my service to India team till1994 Prakash Padukone my self and Vivek Kumar are three good friends from those days while former State champion Vivek is the man who invested more to set up this Badminton Academy.Vivek is dedicated to Prakash Padukone. There are more five or six sports in this Academy . Football, Swimming , Badminton,Cricket and Hockey and Vivek Kumar planned to different centres to locate here .First we started Badminton Academy and then other Academics. some Sri Lankan shuttlers got service from this Academy.Niluka Karunaratne was able to get service from this . We saw two Sri Lanka badminton players take part in Indian challenge International tournament played here this time . The 16 acre land for this Academy and Vivek Kumar invested and dedicated for Prakash and Rahul . Actually many National players produced from here. Indonesia, Malaysia, Denmark, France , England players come for training and very few Sri Lankan among them. Vimal Kumar further said we haven’t any commercial programs here . We have a talent search program and select players to this Academy. Then we give all facilities high standard badminton courts ,very good Badminton coaches , medical service provided by Doctors, Physiotherapists and Masseurs and food and accommodation also given to the players . We normally conduct tournaments to give chance for the players.We conducted many National championship but this is a mainly training centre. Indian Olympic bronze medalist Saina Nehwal 2012 and P.V Sindhu silver medalist in 2016 were also trained here","pubDate":"2023-10-29 19:35:00","image_url":null,"source_id":"dailynews","source_priority":375855,"country":["sri lanka"],"category":["sports"],"language":"english"},{"article_id":"51a2f1b759829d909962f87ef3bfa0a2","title":"Rugby star Ajith Abeyratne makes his last journey today","link":"https://www.dailynews.lk/2023/10/30/sports/196016/rugby-star-ajith-abeyratne-makes-his-last-journey-today/","keywords":["Sports"],"creator":["malinga"],"video_url":null,"description":"Sportsman Ajith Abeyatne born in 1948 was one of Kandy’s sporting icons, who died a few days back will make his last… The post Rugby star Ajith Abeyratne makes his last journey today appeared first on DailyNews.","content":"Sportsman Ajith Abeyatne born in 1948 was one of Kandy’s sporting icons, who died a few days back will make his last journey today He will be cremated on Monday evening at 5 pm at General Cemetery, Borella Ajith was a top class sportsman produced by Trinity College, Kandy in the 1960s. He played rugby for the school at the age of 15, and besides playing rugby; he performed with distinction in cricket, basketball, tennis and athletics. During his time his name was a household one in sports in Kandy. He captained Trinity rugby team in 1967 and 1968 being awarded the Rugby Lion in 1968 and Ryde Gold Medal for the best all round student in the same year. A gentleman to his fingertips Ajith Abeyratne played club rugby for CR and FC as a Number Eight from 1969 to 1974 and played a major role in CR and FC winning the Clifford Cup in 1969 and 1971 and unbeaten league champions in 1973 and 1974 He donned the Sri Lanka jersey. from 1969 to 1972. As a coach Ajith Abeyratne also took the Sri Lanka team to the World Rugby Sevens in Sydney in 1987. He was a Consultant of CR & FC for nearly 20 years. , Ajith was a fine rugby commentator. He hailed from a sporting family with his uncle Hilary Abeyratne playing cricket for Trinity with distinction in 1941 and 1942 ending up as the Vice Principal of Trinity College while his younger brother Seneka played as a centre for Royal College in 1969 and 1970 while the yonngest brother Harsha played cricket for Royal in 1980 and 1981. As Coach of CR & FC 1977 they were SLRFU Trophy champions led by Shiraz Fernando beating Army by 22-9 in the final Ajith toured Wales, Australia, Hong Kong,Bangkok, Taiwan, Singapore, etc. He also coached St. Peter’s College in 1995,beating Trinity and Isipathana twice in one season. He coached champion ‘CR again in 2001 and 2006. (Clifford Cup champions) He also coached the Army team in 1982 and 1983 and guided the Solders to win the SLRFU Presidents Trophy in 1982 under John Senaweera with a 13 -3 win over league champions CH and FC and in 1983 Army led by G Chandra were runners up to CRand FC losing 9-12 in the finals He was Sri Lanka coach from 1985 to 1988 the side were runners up in 1986 and 1987 at the Hong Kong Sevens.","pubDate":"2023-10-29 19:30:00","image_url":null,"source_id":"dailynews","source_priority":375855,"country":["sri lanka"],"category":["sports"],"language":"english"},{"article_id":"1f6df96ea28e1b583957b7994cede69a","title":"Lyon's match at Marseille abandoned after manager injured in team bus attack","link":"https://www.skysports.com/football/news/20876/12996133/lyons-ligue-1-match-at-marseille-abandoned-after-team-bus-attacked","keywords":null,"creator":null,"video_url":null,"description":"Lyon's Ligue 1 match at Marseille has been abandoned after the team's bus was attacked.","content":"Lyon's Ligue 1 match at Marseille has been abandoned after the team's bus was attacked. Lyon manager Fabio Grosso suffered a head injury as the team bus came under attack from fans throwing projectiles before the match. The Lyon bus was hit on the way to Stade Velodrome, shattering some windows. Grosso was injured by falling shards of glass and needed medical treatment with his face heavily bleeding. During his playing days, Grosso famously scored the winning penalty kick for Italy in the shootout victory over France in the 2006 World Cup final. Both clubs have been under pressure lately. Despite replacing Marcelino with Gennaro Gattuso as coach in September, Marseille have still been in poor form with one win and three losses in its last four league games. Lyon are the only team still winless in the league. Ligue 1 table Ligue 1 results Get Sky Sports Download the Sky Sports App Replacing Laurent Blanc with Grosso as coach in September has yet to pay off for Lyon, who sit in last place. More to follow.... This is a breaking news story that is being updated and more details will be published shortly. Please refresh this page for the latest updates. Sky Sports brings you live updates as they happen. Get breaking sports news, analysis, exclusive interviews, replays and highlights. Sky Sports is your trusted source for breaking sports news headlines and live updates. Watch live coverage of your favourite sports: Football, F1, Boxing, Cricket, Golf, Tennis, Rugby League, Rugby Union, NFL, Darts, Netball and get the latest transfers news, results, scores and more. Visit skysports.com or the Sky Sports App for all the breaking sports news headlines . You can receive push notifications from the Sky Sports app for the latest news from your favourite sports and you can also follow @SkySportsNews on Twitter to get the latest updates. Correctly predict six scorelines to win £250,000 for free with Super 6. Entries by 3pm Saturday.","pubDate":"2023-10-29 19:27:00","image_url":"https://e0.365dm.com/23/10/1920x1080/skysports-lyon-bus-bus-attack_6340961.jpg?20231029200110","source_id":"skysports","source_priority":831,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"2b44d9da4f898b27c150ec3ca72930fa","title":"IND vs ENG: রোহিত, শামির ইতিহাস, বাটলারদের লজ্জা, পরিসংখ্যানে ভারত বনাম ইংল্যান্ড ম্যাচ","link":"https://bengali.abplive.com/photo-gallery/sports/cricket-rohit-sharma-mohammed-shami-achieves-milestones-as-india-beat-england-in-lucknow-in-odi-world-cup-2023-match-1020108","keywords":["ক্রিকেট"],"creator":["ABP Ananda"],"video_url":null,"description":"IND vs ENG: রোহিত, শামির ইতিহাস, বাটলারদের লজ্জা, পরিসংখ্যানে ভারত বনাম ইংল্যান্ড ম্যাচ","content":"লখনউয়ের মাঠে ইংল্যান্ডকে ১০০ রানে হারিয়ে চলতি বিশ্বকাপে ছয়ে ছয় করে ফেলেছে ভারতীয় দল। এই জয়ের সুবাদে একদিকে যেখানে ইংল্যান্ড সেমিফাইনালের পৌঁছনো প্রায় অসম্ভব, সেখানে ভারতের শেষ চারে পৌঁছনো কার্যত নিশ্চিত। ইংল্যান্ডের বিরুদ্ধে শূন্য রানে আউট হন বিরাট কোহলি। এই প্রথমবার সীমিত ওভারের বিশ্বকাপে কোহলিকে খাতা খোলার আগেই সাজঘরে ফিরতে হল। তাঁর ৫৬ ম্যাচের দৌড় থামল। এটিই আবার ভারতীয় অধিনায়ক হিসাবে রোহিত শর্মার শততম ম্যাচ ছিল। সপ্তম ভারতীয় অধিনায়ক হিসাবে এই মাইলফলক স্পর্শ করলেন রোহিত। মাইলফলক ম্যাচে অনবদ্য ৮৭ রানের ইনিংস খেলেন ভারতীয় অধিনায়ক। সচিন তেন্ডুলকর, রাহুল দ্রাবিড়, সৌরভ গঙ্গোপাধ্যায় ও বিরাট কোহলির পর মাত্র পঞ্চম ভারতীয় হিসাবে আন্তর্জাতিক ক্রিকেটে ১৮ হাজার রানের গণ্ডি পার করলেন রোহিত শর্মা। এই নিয়ে বিশ্বকাপে রোহিত ১২ নম্বর বার অর্ধশতরানের গণ্ডি পার করলেন। পঞ্চম ব্যাটার হিসাবে এই কৃতিত্ব গড়েন তিনি। কোহলির পাশাপাশি ইংল্যান্ড তারকা জো রুটও এদিন শূন্য রানে আউট হন। প্রথমবার তিনি ৫০ ওভারের বিশ্বকাপে শূন্য রানে ফিরলেন। এই প্রথমবার ওয়ান ডে বিশ্বকাপের ইতিহাসে দুই দলেরই তিন নম্বরে নামা ব্যাটার শূন্য রানে আউট হলেন। মহম্মদ শামি ম্যাচে চারটি উইকেট নিয়ে। দ্রুততম বোলার হিসাবে মাত্র ১৩ ইনিংসে বিশ্বকাপে শামি ৪০টি উইকেট নেওয়ার কৃতিত্ব নিজের নামে করলেন। ইংল্যান্ডের ছয় ব্যাটার এদিন বোল্ড হন। বিশ্বকাপের ইতিহাসে এক ম্যাচ এর থেকে বেশি কেবল এক দলের (১৯৭৫ সালে পূর্ব আফ্রিকা) ব্যাটাররাই বোল্ড হয়েছিলেন। এই নিয়ে প্রথমবার বিশ্বকাপের মঞ্চে টানা চার ম্যাচ হারতে হল ইংল্যান্ডকে। বিশ্বকাপে ইতিমধ্যেই পাঁচ ম্যাচ হেরেছেন বাটলাররা, যা যে কোনও বিশ্বকাপে গতবারের চ্যাম্পিয়নদের জন্য সর্বাধিক। বিশ্বকাপের মঞ্চে এটি ভারতের ৫৯তম জয়। ভারত জয়ের নিরিখে নিউজ়িল্যান্ডকে পিছনে ফেলে দিল। কেবল অস্ট্রেলিয়া বিশ্বকাপের মঞ্চে ভারতের থেকে অধিক ম্যাচ (৭৩) জিতেছে। IND vs ENG LIVE Score Today: ছয়ে ছয়! দুরন্ত বোলিংয়ে ভর করে ইংল্যান্ডকে ১০০ রানে উড়িয়ে দিল ভারত","pubDate":"2023-10-29 22:28:31","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/10/30/680250a7547c1fe2289ab3c6c425c4751698618662354507_original.jpg","source_id":"abplive","source_priority":10959,"country":["india"],"category":["sports"],"language":"bengali"},{"article_id":"3f47cc0f184d9b7888a42ee15f4273e0","title":"Freddie Flintoff training guide dog as England cricket icon recovers from horror crash","link":"https://www.dailystar.co.uk/sport/other-sports/freddie-flintoff-injuries-dog-cricket-31311087","keywords":["Sport"],"creator":null,"video_url":null,"description":"England cricket legend Andrew 'Freddie' Flintoff suffered injuries last December, when his open-topped, three-wheeled car flipped over on the Top Gear test track","content":"Freddie Flintoff has been training a guide dog as he continues to recover from his horror Top Gear crash injuries. The retired England cricket hero is caring for the pooch as part of his rehab after suffering ‘life-altering’ facial wounds. He was spotted out walking the Labrador puppy near his £5.25million home in Hale, Manchester. Freddie, 45, looked relaxed as he strolled along wearing a beanie hat, backpack and tinted glasses. But pals have revealed when he first started training his new furry friend, he was prone to taking a tumble. Last month former team-mate Steve Harmison, 45, described meeting up with the injured star a few weeks earlier. He said: “Believe it or not, he was training a guide dog. Which I’m sure is going better now than it was, because he tripped over about three times on his way around the field.” Fans have been thrilled to see the dad-of-four back on his feet after the smash in December, when his open-topped, three-wheeled car flipped over on the Top Gear test track. He was airlifted to hospital from Dunsford Aerodrome in Surrey. Freddie was not wearing a helmet when he lost control of the Morgan Super 3 roadster while taking a corner at 22mph. He quit his presenting job soon afterwards and the BBC cancelled the last series of the show. After months of hiding his injuries, he made his first public appearance in September when he coached England cricketers in Cardiff. Speaking afterwards, Steve said: “It was great to see him back. You’ve seen the pictures of him with a smile on his face but I saw him about six weeks ago – but at that time he covered his face up.” Freddie is said to have received £9million in compensation for the accident – a figure based on two years’ lost earnings. The BBC says no final decision has been made about the future of Top Gear. However, Flintoff will return to the corporation for a second series of Field Of Dreams, mentoring youngsters in cricket.","pubDate":"2023-10-29 21:24:10","image_url":"https://i2-prod.dailystar.co.uk/incoming/article31311091.ece/ALTERNATES/s98/1_Britain-Cricket-England-New-Zealand-23256385165522.jpg","source_id":"dailystar","source_priority":3076,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"54fdf70cd7ec8358b6381afeb57e01e6","title":"England admit to being clueless about significant Cricket World Cup rule change to Champions Trophy qualification","link":"https://7news.com.au/sport/cricket/england-admit-to-being-clueless-about-significant-cricket-world-cup-rule-change-after-defeat-to-india-c-12370880","keywords":null,"creator":["Glenn Valencich"],"video_url":null,"description":"The reigning champions’ tournament has gone from bad to worse after an alarming discovery during a heavy loss to India.","content":"England coach Matthew Mott has owned up to being in the dark on a significant rule change for the . The reigning champions suffered their fifth defeat in six matches at the tournament when they collapsed to all out for 129 chasing just 230 for victory against hosts India. Defeat anchored England to 10th and rock bottom on the table, behind both the Netherlands and Bangladesh, with matches against Australia, the Dutch and Pakistan to come. One victory might be enough for Mott’s side to avoid finishing last but two are likely to be required to avoid an ignominious consequence: missing out on the next major 50-over global competition. Places at the 2025 Champions Trophy are allocated based on performances in this year’s World Cup, with hosts Pakistan joined by the seventh highest finishers. It had previously been linked to world rankings. The switch was ratified by the ICC board in November 2021 but the information appears to have been missed in the handovers to Mott and ECB chief executive Richard Gould. It reared its head again during England’s loss to India, prompting questions in the post-match press conference. Asked when he learned about the Champions Trophy headache, Mott conceded “about an hour and a half ago.” “The ICC do change the rules quite a bit with qualification,” the Australian added. “But to be honest, I don’t think it would affect in any way the way we’ve played in this tournament, so it’s not a big deal.” The Champions Trophy has become an ugly duckling in the ICC’s calendar since the T20 World Cup came to prominence, with the former officially on the scrapheap twice before it was reintroduced first for 2017 and again for 2025. In spite of its relatively lowly status it would still be an embarrassment for England, one of the richest nations in cricket, to miss out on the event. The ECB hosted in 2013 and stepped up to do so again in 2017 when the tournament was brought back from the dead. Meanwhile, Mott has rejected suggestions from England’s 2019 World Cup-winning captain Eoin Morgan about the team being “unsettled” behind the scenes. The pair worked together when Mott took over the white-ball side 18 months ago but the skipper retired soon after. Morgan’s word still carries plenty of weight and his observations about his old teammates have raised eyebrows. Speaking to Sky Sports prior to England’s loss to India, Morgan said the side were “definitely unsettled”. Responding to the idea they were simply off form, he added: “There’s something else going on - there has to be”. Mott said he would approach Morgan in a bid to set things straight. “Eoin’s entitled to his opinion. He’s obviously been away (from India) for a couple of weeks with the birth of his child and he hasn’t been in and around the rooms,” Mott said. “But I’ll certainly take that up with him and have a chat to him. We’ve got a really good relationship with him so if he’s seeing something I’m not I’ll definitely have that conversation. “I don’t think that (is the case) at all. Anyone inside our tent at the moment would say, despite our results, we’re an incredibly tight-knit unit. “I can only say, from my opinion, that the group has been incredibly strong. Chris Woakes also stood up for the unity of the squad, telling Sky: “I can firmly say there is nothing wrong with the dressing room.”","pubDate":"2023-10-29 20:25:38","image_url":"https://images.7news.com.au/publication/C-12370880/9947b1a09b445ca21f76b0fd28c52bd9963f5738-16x9-x0y0w1304h734.jpg","source_id":"7news","source_priority":7652,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"4087b93a182d125d5a64b593dc46db03","title":"Every Perfect 40 Score in Strictly Come Dancing History","link":"https://markmeets.com/entertainment/every-perfect-40-score-in-strictly-come-dancing-history/?utm_source=rss&utm_medium=rss&utm_campaign=every-perfect-40-score-in-strictly-come-dancing-history","keywords":["Entertainment","Dancing","markmeets","Perfect","Routine","Scored","Strictly"],"creator":["Lee Clarke"],"video_url":null,"description":"Strictly Come Dancing contestants aim for one thing during their journey on the BBC TV series – a perfect score of 40. The post Every Perfect 40 Score in Strictly Come Dancing History first appeared on MarkMeets | Entertainment, Music, Movie, TV & London Film Premiere News.","content":"Strictly Come Dancing contestants aim for one thing during their journey on the BBC TV series – a perfect score of 40. This coveted accolade is bestowed by all four judges, and it’s a rare feat, but when achieved, it marks a remarkable performance. Over the 19-year history of the show, there have been more than 70 dances that earned a perfect 40. While the 2023 cast is yet to join this elite group, let’s revisit some of the most memorable routines that achieved perfection. Jill Halfpenny and Darren Bennett’s Jive (Series 2) In the early days of Strictly Come Dancing, actress Jill Halfpenny and her partner Darren Bennett wowed the audience with a high-tempo Jive set to “I’m Still Standing.” Their electric performance in the series two finale earned them the very first perfect score of 40 from all four judges – Len Goodman, Arlene Phillips, Craig Revel Horwood, and Bruno Tonioli. Jill went on to win the entire series in 2004 and even made a return to the show to reprise her impressive Jive. Mark Ramprakash and Karen Hardy’s Salsa (Series 4) It wasn’t until series four that perfection was achieved once more. Cricketer Mark Ramprakash and his partner Karen Hardy danced a thrilling Salsa to “Hot Hot Hot.” Their journey to perfection had a rocky start when Mark’s microphone got tangled in Karen’s dress, causing them to restart the routine. Despite this setback, they managed to score 36 and later delivered a flawless performance in the final, earning the coveted 40. Matt Di Angelo and Flavia Cacace’s Viennese Waltz (Series 5) Matt Di Angelo and Flavia Cacace made history by becoming the first couple to earn a perfect 40 before the final. Their romantic semi-final Viennese Waltz, danced to “Open Arms” in series five, showcased their exceptional chemistry and skill. Despite their exceptional performance, they did not secure the series win. Alesha Dixon and her partner Matthew Cutler claimed the glitterball trophy, even though they never managed to score a perfect 40. Alesha later became a judge on the show from series seven before departing after three years. Lisa Snowdon and Brendan Cole’s Hat-Trick (Series 6) Lisa Snowdon and Brendan Cole etched their names in Strictly history by becoming the first couple to achieve a perfect 40 in not one but three different routines. Their remarkable hat-trick included a semi-final Quickstep set to Frank Sinatra’s “Dancing in the Dark,” a Foxtrot danced to “Walkin’ My Baby Back Home,” and a Cha-cha-cha performed to “Tears Dry on Their Own” in the final. Despite their impressive scores, Tom Chambers and Camilla Dallerup won series six. Rachel Stevens and Vincent Simone’s Foxtrot (Series 6) In the same series, S Club 7 singer Rachel Stevens proved her prowess in the ballroom with a captivating Foxtrot. Set to “They Long to Be Close to You,” her Foxtrot earned a perfect 40 in both week 10 and the final when she reprised it with her partner Vincent Simone. Ali Bastian and Brian Fortuna’s Double Perfect (Series 7) Series seven saw an increase in perfect scores, with three couples earning a 40. Starting with actor Ali Bastian, who danced a stunning Viennese Waltz to “Do Right Woman, Do Right Man” during the Blackpool episode. As a new addition, guest judge Darcey Bussell made it possible to score 50. Ali achieved this feat with her American Smooth to “Come Dance with Me.” Chris Hollins and Ola Jordan’s Charleston (Series 7) The introduction of Blackpool as a regular venue and the Charleston as a new dance style added to the excitement. Cricketer and journalist Chris Hollins and his partner Ola Jordan performed a Charleston to “Fat Sam’s Grand Slam” from the “Bugsy Malone” film, scoring a perfect 50 and clinching the series victory. Pamela Stephenson and James Jordan’s Movie Magic (Series 8) In series eight, James Jordan and Pamela Stephenson were the only couple to achieve a perfect 40. Their Movie Week Viennese Waltz to “Unchained Melody” from “Ghost” did it twice – once in week ten, and again when they performed it in the final. Their Quickstep to “Steppin’ Out with My Baby” also reached perfection. However, it was Kara Tointon and Artem Chigvintsev who won and went on to become a real-life couple. Harry Judd and Aliona Vilani’s Dynamic Duo (Series 9) Series nine witnessed another trio of couples earning perfect scores of 40. Harry Judd and Aliona Vilani, the eventual winners, delivered captivating performances. Their Quickstep to “Don’t Get Me Wrong” and Argentine Tango to “Asi se baila el tango” became the first perfect 40s for this style of dance. Jason Donovan and Kristina Rihanoff’s Theatrical Argentine Tango (Series 9) Jason Donovan added to the series nine perfection with a compelling Argentine Tango to “El Tango de Roxanne.” His charismatic performance proved he was more than a one-trick pony, and it highlighted the show’s diverse dance styles. Chelsee Healey and Pasha Kovalev’s Passionate Paso Doble (Series 9) Hollyoaks actor Chelsee Healey may not have won the series, but she was a fan favorite. Her fiery Paso Doble to “Malagueña” showcased her impressive skills, earning her a perfect 40 and leaving a lasting mark on the show. Kimberley Walsh and Pasha Kovalev’s Triple 40 Triumph (Series 10) Series ten marked the addition of Darcey Bussell to the judging panel, replacing Alesha Dixon. This series also introduced the fusion of two dance styles. Kimberley Walsh’s cha-cha-cha/tango hybrid to “It’s Raining Men” impressed the judges. Her Charleston to “Those Magnificent Men in Their Flying Machines” and Tango to “When Doves Cry” also secured perfect 40 scores. Denise Van Outen and James Jordan’s Energetic Showmanship (Series 10) TV personality Denise Van Outen showcased her growth throughout the series with a dynamic Showdance to “What a Feeling” from “Flashdance.” Her equally energetic Charleston to “Walk Like an Egyptian” earned her another perfect score. Louis Smith and Flavia Cacace’s Gymnastic Glory (Series 10) Series ten was a tough competition, but gymnast Louis Smith emerged victorious with his Showdance to “Rule the World.” His incredible performance showcased his Olympic strength and earned him a perfect score, making him the series champion. Abbey Clancy and Aljaž Škorjanec’s Salsa Sensation (Series 11) Nine years after the last perfect 40 for a Salsa, model Abbey Clancy broke the dance’s curse with a scorching routine to “You Should Be Dancing” from “Saturday Night Fever.” Switching gears, she also delivered a beautiful Waltz to “Kissing You,” securing her victory and the coveted Glitterball trophy. Natalie Gumede and Artem Chigvintsev’s Stellar Salsa (Series 11) Although Abbey Clancy took home the trophy, actress Natalie Gumede gave her tough competition. Her sultry Salsa to “Wanna Be Startin’ Somethin’” and Showdance to “Steppin’ Out with My Baby” both earned her perfect 40 scores and showcased her incredible dancing abilities. Caroline Flack and Pasha Kovalev’s Perfection in Variety (Series 12) Caroline Flack made history in series 12 as the first contestant to not drop a single mark in the final. Alongside her partner Pasha Kovalev, she delivered a lively Cha-cha-cha to “Can You Feel It,” a fairytale Showdance to “Angels,” and a playful Charleston to “Istanbul.” Her versatility and consistency made her the series champion. Simon Webbe and Kristina Rihanoff’s Argentine Tango Excellence (Series 12) Simon Webbe and Kristina Rihanoff’s Argentine Tango made waves in Blackpool and nearly secured a perfect 40. Their moody performance to “El Tango de Roxanne” left a lasting impression. Kellie Bright and Kevin Clifton’s Double Perfect (Series 13) In series 13, Kellie Bright and Kevin Clifton made history by achieving a perfect 40 in two separate routines. Their finale Showdance to “The Ding-Dong Daddy of the D-Car Line” and Charleston to “Chicago’s Hot Honey Rag” captivated the judges, although it was Jay McGuiness and Aliona Vilani who claimed the series victory. Ore Oduba and Joanne Clifton’s Jive and Showdance (Series 14) Presenter Ore Oduba delivered the first perfect Jive of the series with “Runaway Baby” and earned top marks for his Showdance to “I Got Rhythm.” His stellar performances secured his victory in series 14, but he wasn’t the only one to earn a perfect 40. Louise Redknapp and Kevin Clifton’s Sensational Argentine Tango (Series 14) Louise Redknapp and Kevin Clifton’s Argentine Tango to “Tanguera” was an exceptional performance that earned them a perfect score. Kevin continued his streak of 40s with this mesmerizing routine. Danny Mac and Oti Mabuse’s Spectacular Trio (Series 14) In a series filled with talent, actor Danny Mac delivered a trio of perfect 40s. His Charleston to “Puttin’ On the Ritz,” Showdance to “Set Fire to the Rain,” and Samba to “Magalenha” wowed the judges and the audience. His exceptional dancing skills and consistency impressed everyone. Debbie McGee and Giovanni Pernice’s Tango Magic (Series 15) Series 15, the first with Shirley Ballas as a judge, featured three couples earning perfect scores of 40. Debbie McGee’s Tango to “I Gotta Feeling” was a standout routine, as was her captivating high kick in the Argentine Tango to “Por una Cabeza.” Her flawless performances added to the series’ perfect 40s. Alexandra Burke and Gorka Marquez’s Show-Stopping American Smooth and Jive (Series 15) Singer Alexandra Burke proved to be one of the series’ most talented dancers. Her American Smooth to “Wouldn’t It Be Loverly” and incredibly quick Jive to “Proud Mary” were nothing short of incredible, earning her perfect 40s. Joe McFadden and Katya Jones’ Charismatic Charleston (Series 15) Joe McFadden’s Charleston to “Alexander’s Ragtime Band” sent him to the top of the leaderboard and into the nation’s hearts. His charismatic performance earned him a perfect score and secured his victory in series 15. Ashley Roberts and Pasha Kovalev’s Remarkable Quartet (Series 16) Ashley Roberts dazzled the audience with a quartet of perfect 40s in the final. Her Salsa to “(I’ve Had) The Time of My Life” from “Dirty Dancing,” featuring an epic lift, her Showdance to “Keeping Your Head Up,” and her Charleston to “Witch Doctor” left a lasting mark on the series. She also earned a perfect 40 for her Jive to “Shake a Tail Feather” in Blackpool. Faye Tozer and Giovanni Pernice’s Fantastic Four (Series 16) Steps singer Faye Tozer secured perfect 40s in four separate routines. Her Charleston to “The Lonely Goatherd,” Viennese Waltz to “It’s a Man’s Man’s Man’s World,” Showdance to “Lullaby of Broadway,” and Theatre/Jazz to “Fever” showcased her versatility and dance prowess. However, it was Stacey Dooley and Kevin Clifton who won series 16. Kelvin Fletcher and Oti Mabuse’s Ballroom Brilliance (Series 17) Kelvin Fletcher won series 17, and his quickstep to “The Lady is a Tramp” showcased his ballroom mastery. His Showdance to “Shout” was equally impressive, highlighting his versatility as a dancer. Karim Zeroual and Amy Dowden’s Sensational Jive and Quickstep (Series 17) Kelvin and Oti may have clinched the victory, but Karim Zeroual and Amy Dowden had the dance of the series with their Jive to “You Can’t Stop the Beat” from “Hairspray.” Their exceptional performance earned them a perfect score, not just once but twice – in Blackpool and at the finale. They also achieved a 40/40 for their Quickstep to “Mr. Pinstripe Suit.” Bill Bailey and Oti Mabuse’s Grand Finale (Series 18) Series 18 faced unique challenges due to Covid-19 travel restrictions, leading to a reduced judging panel. With three judges instead of four, a score of 30 became the new 40. Comedian Bill Bailey, partnered with Oti Mabuse, secured the highest available score of 30 for his Showdance to “The Show Must Go On.” Bill’s remarkable journey culminated in his victory, making Oti champion for two consecutive years. Maisie Smith and Gorka Marquez’s Street/Commercial and Festive Finale (Series 18) Actor Maisie Smith was a strong contender throughout the series. Her street/commercial dance to “Gettin’ Jiggy wit It” and festive Showdance to “We Need a Little Christmas” both earned perfect scores of 30. HRVY and Janette Manrara’s Street/Commercial, Charleston, and American Smooth (Series 18) HRVY made his presence known in the competition by achieving a perfect score of 30 an impressive three times. His street/commercial dance to “A Sky Full of Stars,” Charleston to “Another Day of Sun” from “La La Land,” and American Smooth to “One (Singular Sensation)” were undeniably brilliant. Rhys Stephenson and Nancy Xu’s Charleston: A Toe-Tapping Triumph One of the most delightful moments in Strictly history came when CBBC presenter Rhys Stephenson and the talented Nancy Xu took to the dance floor to perform the Charleston. The choice of music, “The Charleston,” was not only aptly named but also perfectly suited to the infectious energy and charm that Rhys and Nancy brought to their routine. While the duo fell just short of making it to the final, they won the hearts of the audience with their Charleston performance. This lively and exuberant dance, characterized by its energetic kicks and twirls, transported viewers back to the Roaring Twenties, where flappers and jazz music reigned supreme. Rhys and Nancy’s interpretation of the Charleston was a masterclass in capturing the spirit of the era. AJ Odudu and Kai Widdrington’s Quickstep: A Bittersweet Journey AJ Odudu, known for her role as the host of Big Brother, made a significant impact on Strictly with her impressive Quickstep performance, accompanied by her partner Kai Widdrington. However, their journey was bittersweet, as AJ had to withdraw from the competition due to an injury just before the final. In the semi-finals, AJ and Kai delivered a Quickstep that earned them a perfect score of 40. Their dance was set to the classic tune “Sing, Sing, Sing (With a Swing).” The Quickstep is known for its fast-paced, joyful movements, and AJ and Kai executed it with precision and style. Their partnership on the dance floor was a testament to the dedication and hard work that contestants put into the competition. John Whaite and Johannes Radebe’s Pasodoble and Showdance: Breaking Boundaries John Whaite and Johannes Radebe made history on Strictly Come Dancing as the first all-male pairing. Their performances were nothing short of spectacular, leaving a lasting impression on both the judges and the audience. Two of their standout routines were the Paso Doble and the Showdance. For the Paso Doble, John and Johannes danced to “He’s a Pirate” from “Pirates of the Caribbean: The Curse of the Black Pearl” during the movie-themed week. The Paso Doble is a passionate and dramatic dance, and their portrayal was nothing less than spectacular. Their choreography was filled with intensity and precision, earning them rave reviews. The Showdance was another highlight of their journey, set to “You’ve Got the Love.” Their dance was a beautiful and emotional display of their partnership, showcasing their incredible chemistry and skill. It was no surprise that their efforts were rewarded with the ultimate recognition. Rose Ayling-Ellis and Giovanni Pernice: A Historic Tango and a Poetic Couple’s Choice Actor Rose Ayling-Ellis and her partner Giovanni Pernice etched their names in the Strictly history books with their remarkable performances. In week six, they delivered a Tango that received a perfect score of 40, marking the earliest occurrence of a perfect score in the show’s history. The dance was set to “Shivers” and showcased their exceptional talent and chemistry. Their Couple’s Choice performance was a standout moment for its unique and poetic approach. Dancing to “Symphony,” they performed a sequence in silence, celebrating Rose, who is deaf. This moving and visually stunning routine was a testament to the power of dance as a universal language that transcends barriers. To add to their achievements, Rose and Giovanni’s Showdance, set to “The Rose,” was nothing short of epic. Their chemistry and storytelling through dance were unparalleled, making it clear why they emerged as the winners of series 19. Helen Skelton and Gorka Marquez’s Mesmerizing Couple’s Choice In a more recent series, TV presenter Helen Skelton graced the Strictly dance floor with her mesmerizing Couple’s Choice routine. This unique and contemporary dance style allows couples to express themselves without the constraints of traditional ballroom or Latin steps. Helen’s Couple’s Choice performance was set to “Mein Herr” from the musical “Cabaret.” It was an exquisite fusion of dance styles and emotions, earning her full marks. What made this routine even more exceptional was her flawless execution in the finale, securing her a place in the annals of epic Strictly routines. Fleur East and Vito Coppola’s Dynamic Tribute Fleur East, a singer and songwriter, paid a vibrant and dynamic tribute to her favorite band, Destiny’s Child, with a Couple’s Choice performance. This unconventional dance style allowed Fleur and her partner, Vito Coppola, to let loose and showcase their incredible talent. Their routine featured a medley of Destiny’s Child hits, and it was a true spectacle of energy and creativity. The freedom that Couple’s Choice offers was evident as they brought the spirit of Destiny’s Child to life on the dance floor. Fleur and Vito’s journey didn’t stop there. They also took on the Samba, a lively and rhythmically challenging Latin dance. Dancing to “Hot Hot Hot,” they followed in the footsteps of a memorable performance by Mark and Karen from the early days of Strictly, earning a perfect score of 40. Their ability to master different dance styles and bring their unique flair to each performance was a testament to their artistry. Strictly Come Dancing has been a treasure trove of exceptional dance performances over the years. From the lively and exuberant Charleston of Rhys Stephenson and Nancy Xu to the history-making routines of John Whaite and Johannes Radebe, the show continues to dazzle its audience with the artistry and passion of its contestants. These standout performances remind us of the transformative power of dance and its ability to transcend boundaries and create moments of pure magic. Strictly Come Dancing remains a beloved institution that celebrates the joy of dance and the remarkable talents of its participants. As the show continues to evolve and push the boundaries of dance, we can look forward to many more epic routines that will leave a lasting mark on the world of entertainment.","pubDate":"2023-10-29 19:50:00","image_url":null,"source_id":"markmeets","source_priority":90417,"country":["united states of america"],"category":["sports"],"language":"english"},{"article_id":"9ba7e53d339a847f178f0fceac1e8cb7","title":"ویسٹ انڈیز اے نے پاکستان کیخلاف ون ڈے سیریز جیت لی","link":"https://pni.net.pk/sports-news/cricket-news/497544/","keywords":["کرکٹ","کھیل"],"creator":["Tuba Zafar"],"video_url":null,"description":"لاہور ( آئی این پی) ویسٹ انڈیز ویمن اے ٹیم نے پاکستان ویمن اے کے خلاف تین میچوں پر مشتمل ون ڈے سیریز دو، ایک سے اپنے نام کر لی۔لاہور قذافی سٹیڈیم میں کھیلے گئے ون ڈے سیریز کے تیسرے اور آخری میچ میں پاکستان [...] The post ویسٹ انڈیز اے نے پاکستان کیخلاف ون ڈے سیریز جیت لی appeared first on Pakistan News International - Latest Pakistani News in Urdu.","content":"لاہور ( آئی این پی) ویسٹ انڈیز ویمن اے ٹیم نے پاکستان ویمن اے کے خلاف تین میچوں پر مشتمل ون ڈے سیریز دو، ایک سے اپنے نام کر لی۔لاہور قذافی سٹیڈیم میں کھیلے گئے ون ڈے سیریز کے تیسرے اور آخری میچ میں پاکستان اے نے پہلے بیٹنگ کرتے ہوئے 44.4اوورز میں 162رنز بنائے تھے جبکہ ویسٹ انڈیز اے نے 44.5اوورز میں سات وکٹوں کے نقصان پر مطلوبہ ہدف مکمل کر لیا۔ فاتح ٹیم کی جانب سے جنابا جوزف نے ناقابل شکست 51رنز کی اننگ کھیلی جبکہ پاکستان کی جانب سے رامین شمیم نے تین وکٹیں حاصل کیں۔اس سے قبل پاکستانی اننگ میں سدرا نواز نے 27، شوال ذوالفقار نے 22اور انوشا ناصر نے 23رنز بنائے تھے جبکہ مہمان ٹیم کی جانب سے جہازارا کلاکسٹن نے چار کھلاڑیوں کو آئوٹ کیا تھا۔۔۔","pubDate":"2023-10-29 19:43:11","image_url":null,"source_id":"pninet","source_priority":5220220,"country":["pakistan"],"category":["sports"],"language":"urdu"},{"article_id":"7955640f42bd9dc17e6d08fdc8762f42","title":"Lanka confident of beating Afghanistan today","link":"https://www.dailynews.lk/2023/10/30/sports/196262/lanka-confident-of-beating-afghanistan-today/","keywords":["Sports"],"creator":["malinga"],"video_url":null,"description":"After getting back to back victories Sri Lanka cricket team is poised to record their third win against Afghanistan to make semi… The post Lanka confident of beating Afghanistan today appeared first on DailyNews.","content":"After getting back to back victories Sri Lanka cricket team is poised to record their third win against Afghanistan to make semi final of the world cup and in their match at Maharashtra Cricket Association (MCA) Stadium in Pune today (30) from 2pm onwards. This will be very important game to continue the momentum to go forward and Sri Lanka team is confident said Sri Lanka teams most experienced player Angelo Matthew yesterday. We are not underestimating any team but we have a good chance as already we have played more matches against Afghanistan recently and know about them very well. However in this world cup Afghan team has proved their potential to beat top teams before the Sri Lanka match. I had a good game in my first world cup game against England at Bangalore. I bowled and got an early breakthrough taking Dawid Malans wicket .We had two pacemen Kasun Rajitha and Dilshan Madushanka who were among the wickets and bowled well That was the reason we started with that pace duo against England and as a third bowler I started to bowl and got an early breakthrough. when I was not in the world cup I used train hard to build up my talent as well as kept my fitness. I had a chat with Chaminda Vass the fast bowling legend and got some tips and that is my success in bowling. I always had an idea to play franchise tournament and focused on that I used to get hard training. I knew when I get a ball I have to put pressure and I did that against England and got successful results taking two important wickets of Malan and Moein Ali.when I start to bowl I normally do more variations during my over. Line and length, bowling outswinger, inswinger all this type of balls I use my experience to do variations to put pressure and that always brings success said Mathews. I never think about my bowling position. Skipper Kusal Mendis trusted me and he had a plan and I was bowling according to the team s needs said former skipper Mathews. We all believe as a team we can still have a chance to enter semi final. and want can do well in next four matches Afghanistan, India, Bangladesh and New Zealand he said. Here in India I think wickets are very good for batsmen. The day who will perform well they can win but we want to focus on our performance. I couldn’t bat in my last game. I practice hard during my batting we all think same way. We know every batsmen can score heavily in every match but one or two battesr have to play long innings and others have to play with them Kusal Mendis,Charith Asalanka, Pathum Nissanka, Sadeera Samarawickrama, Dilshan Madushanka Dunith Wellalage are young players and they maintain good form and have to build up skills to focus on next world cup If we will do that we will make a good team. What ever decision in future I have to maintain fitness and already proved my fitness by playing matches said Angelo. Meanwhile Sri Lanka also looking to name their final eleven after yesterday training session and most probably opener Dimuth Karunaratne the experienced player will get chance to play for Kusal Janith Perera who is not in good form as an opener. Rest of the team players have good chance to play today’s game. Meanwhile Afghanistan team also hope to make challenge against Sri Lanka today after having two good wins and they also have an idea to enter semi final. Afghanistan skipper Hasthamatullah Shahidi said we have good plans. We played before in Chennai but here in Pune different conditions. I think we have good all round players but match going to be very tough. We played more matches against Sri Lanka, India, Pakistan and Bangladesh recently and we work hard to play game today but always very pressure to play against Sri Lanka. We were struggling against Sri Lanka recently and tried to correct our mistakes to come up today’s game. We had good preparation from last two years to focus on this world cup and our coach Jonathan Trott give good support to us. I believe on the day who perform well can win and want to play positive said Afghanistan skipper.","pubDate":"2023-10-29 19:40:00","image_url":null,"source_id":"dailynews","source_priority":375855,"country":["sri lanka"],"category":["sports"],"language":"english"},{"article_id":"16ddbf82c5ec9d27ad4d11dc303aeb07","title":"Chameera replaces Lahiru Kumara in Sri Lanka squad","link":"https://www.dailynews.lk/2023/10/30/sports/196318/chameera-replaces-lahiru-kumara-in-sri-lanka-squad/","keywords":["Sports"],"creator":["malinga"],"video_url":null,"description":"The Event Technical Committee of the ICC Men’s Cricket World Cup 2023 has approved Dushmantha Chameera as a replacement for Lahiru Kumara… The post Chameera replaces Lahiru Kumara in Sri Lanka squad appeared first on DailyNews.","content":"The Event Technical Committee of the ICC Men’s Cricket World Cup 2023 has approved Dushmantha Chameera as a replacement for Lahiru Kumara in the Sri Lanka squad. This is the second replacement for the Sri Lanka team following Angelo Matthews. Chameera, a seasoned player with 44 ODIs under his belt, steps in for Kumara, who suffered a left thigh muscle injury during training in Pune. The inclusion of Chameera, who is the most experienced bowler of the team, known for his pace and versatile swing bowling, is expected to be advantageous for Sri Lanka in their upcoming matches. Chameera, who had previously been dealing with an injury, has made a full recovery and has demonstrated strong performance during training sessions, earning his place as a replacement. Both Angelo Matthews and Chameera were initially part of the tour as travel reserves but now have joined the squad. Skipper Dasun Shanaka, although making good progress in his recovery, remains as a travel reserve. (DR)","pubDate":"2023-10-29 19:37:00","image_url":null,"source_id":"dailynews","source_priority":375855,"country":["sri lanka"],"category":["sports"],"language":"english"},{"article_id":"da045ce76f7c3f701e48ac2a11960779","title":"Success of Indian shuttlers is due to facilities and correct guidance","link":"https://www.dailynews.lk/2023/10/30/sports/195978/success-of-indian-shuttlers-is-due-to-facilities-and-correct-guidance/","keywords":["Sports"],"creator":["malinga"],"video_url":null,"description":"Former Indian National Badminton player Vimal Kumar who is the Present Director of Prakash Padukone Badminton Academy in Bangalore said the correct… The post Success of Indian shuttlers is due to facilities and correct guidance appeared first on DailyNews.","content":"Former Indian National Badminton player Vimal Kumar who is the Present Director of Prakash Padukone Badminton Academy in Bangalore said the correct guidance and providing good facilities are the reasons for the success of Indian Badminton. Vimal Kumar who played with former Indian number one and National champion Prakash Padukone said this in an exclusive interview with the Daily News. We started this Prakash Padukone Badminton Academy in 1994 and from then up-to-date we have done lot of work to develop India Badminton and as a result today India have Olympic medal champion as well as world level champions We are working independently and no involvement with National Badminton Federation of India .But this Academy is open to any shuttler.We have some standard to select players for this and standard of the players always high level to get service from our well qualified Badminton coaches who do everything for the selected shuttlers said Vimal Kumar. I played for India from 1979 for 15 years I gave my service to India team till1994 Prakash Padukone my self and Vivek Kumar are three good friends from those days while former State champion Vivek is the man who invested more to set up this Badminton Academy.Vivek is dedicated to Prakash Padukone. There are more five or six sports in this Academy . Football, Swimming , Badminton,Cricket and Hockey and Vivek Kumar planned to different centres to locate here .First we started Badminton Academy and then other Academics. some Sri Lankan shuttlers got service from this Academy.Niluka Karunaratne was able to get service from this . We saw two Sri Lanka badminton players take part in Indian challenge International tournament played here this time . The 16 acre land for this Academy and Vivek Kumar invested and dedicated for Prakash and Rahul . Actually many National players produced from here. Indonesia, Malaysia, Denmark, France , England players come for training and very few Sri Lankan among them. Vimal Kumar further said we haven’t any commercial programs here . We have a talent search program and select players to this Academy. Then we give all facilities high standard badminton courts ,very good Badminton coaches , medical service provided by Doctors, Physiotherapists and Masseurs and food and accommodation also given to the players . We normally conduct tournaments to give chance for the players.We conducted many National championship but this is a mainly training centre. Indian Olympic bronze medalist Saina Nehwal 2012 and P.V Sindhu silver medalist in 2016 were also trained here","pubDate":"2023-10-29 19:35:00","image_url":null,"source_id":"dailynews","source_priority":375855,"country":["sri lanka"],"category":["sports"],"language":"english"},{"article_id":"51a2f1b759829d909962f87ef3bfa0a2","title":"Rugby star Ajith Abeyratne makes his last journey today","link":"https://www.dailynews.lk/2023/10/30/sports/196016/rugby-star-ajith-abeyratne-makes-his-last-journey-today/","keywords":["Sports"],"creator":["malinga"],"video_url":null,"description":"Sportsman Ajith Abeyatne born in 1948 was one of Kandy’s sporting icons, who died a few days back will make his last… The post Rugby star Ajith Abeyratne makes his last journey today appeared first on DailyNews.","content":"Sportsman Ajith Abeyatne born in 1948 was one of Kandy’s sporting icons, who died a few days back will make his last journey today He will be cremated on Monday evening at 5 pm at General Cemetery, Borella Ajith was a top class sportsman produced by Trinity College, Kandy in the 1960s. He played rugby for the school at the age of 15, and besides playing rugby; he performed with distinction in cricket, basketball, tennis and athletics. During his time his name was a household one in sports in Kandy. He captained Trinity rugby team in 1967 and 1968 being awarded the Rugby Lion in 1968 and Ryde Gold Medal for the best all round student in the same year. A gentleman to his fingertips Ajith Abeyratne played club rugby for CR and FC as a Number Eight from 1969 to 1974 and played a major role in CR and FC winning the Clifford Cup in 1969 and 1971 and unbeaten league champions in 1973 and 1974 He donned the Sri Lanka jersey. from 1969 to 1972. As a coach Ajith Abeyratne also took the Sri Lanka team to the World Rugby Sevens in Sydney in 1987. He was a Consultant of CR & FC for nearly 20 years. , Ajith was a fine rugby commentator. He hailed from a sporting family with his uncle Hilary Abeyratne playing cricket for Trinity with distinction in 1941 and 1942 ending up as the Vice Principal of Trinity College while his younger brother Seneka played as a centre for Royal College in 1969 and 1970 while the yonngest brother Harsha played cricket for Royal in 1980 and 1981. As Coach of CR & FC 1977 they were SLRFU Trophy champions led by Shiraz Fernando beating Army by 22-9 in the final Ajith toured Wales, Australia, Hong Kong,Bangkok, Taiwan, Singapore, etc. He also coached St. Peter’s College in 1995,beating Trinity and Isipathana twice in one season. He coached champion ‘CR again in 2001 and 2006. (Clifford Cup champions) He also coached the Army team in 1982 and 1983 and guided the Solders to win the SLRFU Presidents Trophy in 1982 under John Senaweera with a 13 -3 win over league champions CH and FC and in 1983 Army led by G Chandra were runners up to CRand FC losing 9-12 in the finals He was Sri Lanka coach from 1985 to 1988 the side were runners up in 1986 and 1987 at the Hong Kong Sevens.","pubDate":"2023-10-29 19:30:00","image_url":null,"source_id":"dailynews","source_priority":375855,"country":["sri lanka"],"category":["sports"],"language":"english"},{"article_id":"1f6df96ea28e1b583957b7994cede69a","title":"Lyon's match at Marseille abandoned after manager injured in team bus attack","link":"https://www.skysports.com/football/news/20876/12996133/lyons-ligue-1-match-at-marseille-abandoned-after-team-bus-attacked","keywords":null,"creator":null,"video_url":null,"description":"Lyon's Ligue 1 match at Marseille has been abandoned after the team's bus was attacked.","content":"Lyon's Ligue 1 match at Marseille has been abandoned after the team's bus was attacked. Lyon manager Fabio Grosso suffered a head injury as the team bus came under attack from fans throwing projectiles before the match. The Lyon bus was hit on the way to Stade Velodrome, shattering some windows. Grosso was injured by falling shards of glass and needed medical treatment with his face heavily bleeding. During his playing days, Grosso famously scored the winning penalty kick for Italy in the shootout victory over France in the 2006 World Cup final. Both clubs have been under pressure lately. Despite replacing Marcelino with Gennaro Gattuso as coach in September, Marseille have still been in poor form with one win and three losses in its last four league games. Lyon are the only team still winless in the league. Ligue 1 table Ligue 1 results Get Sky Sports Download the Sky Sports App Replacing Laurent Blanc with Grosso as coach in September has yet to pay off for Lyon, who sit in last place. More to follow.... This is a breaking news story that is being updated and more details will be published shortly. Please refresh this page for the latest updates. Sky Sports brings you live updates as they happen. Get breaking sports news, analysis, exclusive interviews, replays and highlights. Sky Sports is your trusted source for breaking sports news headlines and live updates. Watch live coverage of your favourite sports: Football, F1, Boxing, Cricket, Golf, Tennis, Rugby League, Rugby Union, NFL, Darts, Netball and get the latest transfers news, results, scores and more. Visit skysports.com or the Sky Sports App for all the breaking sports news headlines . You can receive push notifications from the Sky Sports app for the latest news from your favourite sports and you can also follow @SkySportsNews on Twitter to get the latest updates. Correctly predict six scorelines to win £250,000 for free with Super 6. Entries by 3pm Saturday.","pubDate":"2023-10-29 19:27:00","image_url":"https://e0.365dm.com/23/10/1920x1080/skysports-lyon-bus-bus-attack_6340961.jpg?20231029200110","source_id":"skysports","source_priority":831,"country":["united kingdom"],"category":["sports"],"language":"english"}]}