{"newsArray":[{"title":"पृथ्वी साव से भी खतरनाक है यह कोहली, घरेलू क्रिकेट में मचा रखा है कोहराम","link":"https://navbharattimes.indiatimes.com/sports/cricket/cricket-news/taruwar-kohli-scoring-consistently-in-domestic-cricket-including-ranji-trophy/articleshow/97325410.cms","keywords":null,"creator":null,"video_url":null,"description":"Ranji Trophy: पृथ्वी साव घरेलू क्रिकेट में लगातार रन बना रहे हैं और उन्हें टीम इंडिया में शामिल करने की मांग हो रही है। वहीं एक ऐसा भी खिलाड़ी हैं, जो पिछले कई सालों में लगातार रन बना रहा है। लेकिन इस कोहली को अभी तक टीम इंडिया में मौका नहीं मिला।","content":"भारत ने 2008 अंडर-19 वर्ल्ड कप जीता था। विराट कोहली उस टीम के कप्तान थे। उसी साल वह टीम इंडिया का हिस्सा भी बन गए। फिर विराट भारत के कप्तान बने और दुनिया के सबसे बेहतरीन बल्लेबाजों की लिस्ट में जगह बना ली। उसी टीम में एक और कोहली थे- तरुवर कोहली। जालंधर के तरुवर का बल्ला आज भी रन उगल रहा है लेकिन उन्हें टीम में लेने की चर्चा कभी नहीं हुई। 34 साल के तरुवर दाएं हाथ के बल्लेबाज और दाएं हाथ के ही मीडियम पेस गेंदबाज हैं। रणजी ट्रॉफी के इस सीजन में भी तरुवर कोहली का बल्ला जमकर बोल रहा है। वह मिजोरम के लिए खेल रहे हैं। 6 मैचों की 10 पारियों में कोहली ने 74.6 की औसत से 746 रन बनाए हैं। उनके बल्ले से तीन शतक और तीन फिफ्टी निकली है। कोहली की सबसे बड़ी पारी 203 रनों की है। वह सबसे ज्यादा रन बनाने वाले बल्लेबाजों की लिस्ट में चौथे नंबर पर हैं। सके अलावा उन्होंने 24 बल्लेबाजों का शिकार भी किया है। टूर्नामेंट के पिछले सीजन में तरुवर को सिर्फ तीन ही मैच खेलने का मौका मिला था। इसमें उन्होंने 131.50 की औसत से 526 रन ठोके थे। उन्होंने इस दौरान तीन शतक भी लगाए थे। 55 फर्स्ट क्लास मैच में तरुवर के बल्ले से 53.8 की औसत से 4573 रन निकले हैं। उनके नाम 74 विकेट भी हैं। लिस्ट ए की 60 पारियों में उन्होंने 40 की औसत से 1913 रन बनाए हैं। साथ ही 41 विकेट भी लिये हैं। तरुवर कोहली ने 2008 अंडर-19 वर्ल्ड कप के तीन मैचों में फिफ्टी ठोकी थी। 6 मैचों में 218 रन बनाने के साथ वह टूर्नामेंट के 5वें सबसे सफल खिलाड़ी थे। उसी साल उन्होंने पंजाब के लिए रणजी डेब्यू किया था। उस मुकाबले में तरुवर के बल्ले से 79 रनों की पारी निकली थी। 2019/20 रणजी सीजन में पहले दूसरे सबसे ज्यादा रन बनाने वाले बल्लेबाज थे। 16 पारियों में तरुवर ने 71 की औसत से 998 रन बनाए थे। इसमें 307 रनों की पारी भी थी। उन्होंने पंजाब के लिए भी तिहरा शतक लगाया था।","pubDate":"2023-01-26 00:30:00","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Jofra Archer ready to do the ‘hard yards’ for Ashes and World Cup challenges","link":"https://www.independent.co.uk/sport/cricket/jofra-archer-england-odi-south-africa-australia-b2269181.html","keywords":["Cricket","Sport"],"creator":["David Charlesworth"],"video_url":null,"description":"The 27-year-old has seen his career railroaded by elbow and back injuries.","content":"Jofra Archer is ready to do the “hard yards” for the twin challenges of the Ashes and World Cup this year but is aware of the expectation he faces ahead of his England return. Archer was England’s pace spearhead in the 2019 50-over World Cup triumph and then took 22 wickets at a dizzying 20.27 in that summer’s Ashes, but his career has been railroaded by elbow and back injuries. Having collected eight wickets in five matches on his competitive comeback in the SA20 this month, Archer is on the verge of a first England appearance since March 2021 in an ODI series against South Africa this week. While a red-ball outing remains some way off for Archer, who says he is now at “about 80 per cent” fitness, he is happy to do whatever it takes to feature for England against Australia this summer. “It is an exciting prospect to think about playing with the guys again, especially with the brand of cricket they are playing, which is very exciting,” Archer said. “I need to spend the next two, three, four months finetuning the body and making myself a bit more resilient. Let me sort that out first then I can look forward to holding the red ball in my hand again. “Overs are overs and you train and bowl until you feel good. Obviously, I might have to do some extra bowling during the weeks when I’m in India (for the Indian Premier League, likely in April and May). “But that is absolutely fine because I want to play in the Ashes, so I’m going to have to do all the hard yards to tick those boxes.” His breakout displays in 2019 mean Archer is held in the utmost regard and the 27-year-old accepted the flip side is there will be a lot of curiosity regarding how he fares in the weeks and months ahead. Red and white-ball captains Ben Stokes and Jos Buttler have attempted to put Archer’s mind at ease, with the fast bowler seemingly set for England’s first ODI of the year in Bloemfontein on Friday which marks the start of the countdown towards the defence of their World Cup title in India in the autumn. “(Ben) said there is no expectation, so did Jos,” Archer said. “It’s nice to hear it, but people will have expectations anyway. Hopefully I can do a half decent job to help the team. “If I don’t do well when I play, a lot of people will be watching. I will be judged again and no one will remember the good stuff I’ve done in SA20. You are only as good as your last game. “This is our first ODI of the year so I’m very glad to be playing from the start and, when we do get to India, hopefully I’ll be there, and everything will seem worth it.” Being part of England’s team environment is important to Archer, who revealed the toughest moments of being sidelined for so long were watching the last two T20 World Cups from thousands of miles away. Archer was sorely missed as England bowed out of the semi-finals in 2021 and he even contemplated flying out to Australia ahead of their successful campaign last November. “The hardest part of watching is not being able to help,” he said. “That was the hardest part. You don’t even have to play, just being there. I almost bought a ticket to Oz.” Archer was originally supposed to play two matches for MI Cape Town in South Africa’s newly-created T20 league but has played three more after England’s two practice matches here were scrapped. His injury struggles in the last couple of years mean he draws comfort from every outing for his franchise, whereupon taking a wicket he has started copying the celebration of Manchester United forward Marcus Rashford by putting a finger to his temple. “I don’t know what it means, but I’ve seen him do it and he’s a pretty nailed-on guy so I can’t imagine it having a bad reason to it,” United fan Archer said. “Every game I play relaxes me a little bit more. In the back of my mind I’m thinking I’m still not out of the waters yet.”","pubDate":"2023-01-25 18:00:06","image_url":"https://static.independent.co.uk/2023/01/25/18/5d1fb06327f49e23bcaac422f04ad926Y29udGVudHNlYXJjaGFwaSwxNjc0NzUxNzE3-2.45229326.jpg?width=1200&auto=webp","source_id":"independentuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Do you recognise this man: John Smit, Shaun Pollock OR … ?","link":"https://www.thesouthafrican.com/news/who-is-this-man-john-smit-shaun-pollock-chris-hipkins-breaking-25-january-2023/","keywords":["News","Proteas","Springboks","Chris Hipkins","Featured","John Smit","New Zealand Prime Minister","Shaun Pollock"],"creator":["Garrin Lambley"],"video_url":null,"description":"Does the man below look familiar? Do you feel you've seen him somewhere before, perhaps on the rugby or cricket field?","content":"Does the man above look familiar? Do you feel you’ve seen him somewhere before, perhaps on the rugby or cricket field? FOR MORE SPORT AND POLITICS NEWS VISIT THE SOUTH AFRICAN WEBSITE Is it former Springbok captain John Smit who played 111 Tests for his country and led the national team to Rugby World Cup victory in 2007 in France? Is it former Proteas all-rounder Shaun Pollock who played 108 Tests, 303 ODIs and 12 T20Is for South Africa, taking a total of 829 wickets? Or is it New Zealand’s new Prime Minister Chris Hipkins who took over as Kiwi leader following Jacinda Ardern’s shock decision to step down last week? Answers on a postcard or an email to info@thesouthafrican.com or a WhatsApp to 060 011 0211 – or leave a comment below. You can also follow @TheSAnews on Twitter and The South African on Facebook .","pubDate":"2023-01-25 17:58:26","image_url":"https://www.thesouthafrican.com/wp-content/themes/jnews-child/assets/images/normal.jpeg.optimal.jpeg","source_id":"thesouthafrican","category":["sports"],"country":["south africa"],"language":"english"},{"title":"[WATCH] Jemimah Rodrigues and Women in Blue sing 'Pehli Nazar Mein' song, enjoy a fun day at the beach","link":"https://www.sportskeeda.com/cricket/news-watch-jemimah-rodrigues-women-blue-sing-pehli-nazar-mein-song-enjoy-fun-day-beach?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Cricket"],"creator":["James Kuanal"],"video_url":null,"description":null,"content":null,"pubDate":"2023-01-25 17:57:11","image_url":"https://static.sportskeeda.com/editor/2023/01/c3f03-16746499198543-1920.jpg","source_id":"sportskeeda","category":["sports"],"country":["india"],"language":"english"},{"title":"3 Indian players whose form will be closely watched during the T20I series vs New Zealand","link":"https://www.sportskeeda.com/cricket/3-indian-players-whose-form-will-closely-watched-t20i-series-vs-new-zealand?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Cricket"],"creator":["Sai Krishna"],"video_url":null,"description":null,"content":null,"pubDate":"2023-01-25 17:38:15","image_url":"https://static.sportskeeda.com/editor/2023/01/5c9c8-16746487454170-1920.jpg","source_id":"sportskeeda","category":["sports"],"country":["india"],"language":"english"},{"title":"Grambusch brothers take Germany to semifinals, Netherlands join them","link":"https://www.orissapost.com/grambusch-brothers-take-germany-to-semifinals-netherlands-join-them/","keywords":["Sports","Germany","hockey","netherlands","world cup"],"creator":["Post News Network"],"video_url":null,"description":"Bhubaneswar: Germany edged out England in penalty shootout under dramatic circumstances after trailing 0-2 two minutes before regulation time to book a berth in the FIH Men’s World Cup semifinals where Netherlands joined them with a win over South Korea here Wednesday. Germany struck in the 58th and 59th minutes through captain Mats Grambusch and […]","content":"Grambusch brothers take Germany to semifinals, Netherlands join them PTI Updated: January 25th, 2023, 23:07 IST in Sports 0 Share on Facebook Share on Twitter Share on WhatsApp Share on Linkedin Bhubaneswar: Germany edged out England in penalty shootout under dramatic circumstances after trailing 0-2 two minutes before regulation time to book a berth in the FIH Men’s World Cup semifinals where Netherlands joined them with a win over South Korea here Wednesday. Germany struck in the 58th and 59th minutes through captain Mats Grambusch and his younger brother Tom to take the quarterfinal match to the penalty shootout where they prevailed over a heart-broken England team 4-3, snatching win from the jaws of defeat. Our guests for today !! Secy Sports, @IndiaSports Ms Sujata Chaturvedi along with Editor, Dharitri Sri @SatpathyLive graced the 3rd quarter Final between @DHB_hockey & @EnglandHockey as pre-match guests and wished both the teams the best. pic.twitter.com/CcWbnUZGV3 — Odisha Sports (@sports_odisha) January 25, 2023 Germany, who had finished second in Pool B and defeated France 5-1 in the crossover match, face three-time champions and last edition bronze medallists Australia in the semifinals Friday. In the second quarterfinal match of the day at the Kalinga Stadium, last two editions runners-up Netherlands ended gritty South Korea’s more-than-expected run in the tournament with a 5-1 win to set up a last-four clash with Belgium Friday. Van Harte Gefeliciteerd @oranjehockey ! #HockeyWorldCup2023 #HWC2023 #HockeyComesHome #HockeyWorldCup #OdishaForHockey #NEDvsKOR pic.twitter.com/qcFlZ3R2bM — Odisha Sports (@sports_odisha) January 25, 2023 South Korea, who had stunned 2016 Rio Olympics champions Argentina in the crossover match on Monday, yet again punched above their weight as they gave a spirited fight to their more fancied opponents, ranked third in the world. South Korea are ranked ninth in the world. South Korea were the only Asian side that remained in the quarterfinals. The vociferous spectators at the Kalinga Stadium thought that England would wrap up the match comfortably after Zachary Wallace (12th) and Liam Ansell (33rd) had given them a 2-0 lead but, to their astonishment, the Germans came back roaring to score goals in the 58th and 59th minutes through Mats and Tom Grambusch respectively. Just before that Christopher Ruhr had wasted a chance from the penalty stroke in the 57th minute. When Germany was training 1-2 and got a penalty stroke with one minute to go in the match, Mats asked his younger brother Tom to take it. Tom made no mistake from the spot to take the match to the penalty shootout. Niklas Wellen, Hannes Muller, Prinz Thies and Christopher Ruhr scored for Germany in the shootout. For England, James Albery, Zachary Wallace, Phil Roper struck while David Goodfield missed. “It was a crazy match for sure, we were behind for most of the match. But we were able to convert the chances that came our way late in the match. It shows the character of the team,” Mats said. “Our parents must be watching this match and they must be extremely happy seeing that we both scored in a crucial match for the team and country,” Tom said. The German fightback was reminiscent of their national football team which is famous for its never-say-die attitude. “It is a cruel game, you were 2-0 up less than five minutes to go in the match and you lost the game,” rued England captain David Ames. England had directly made it to the quarterfinals after topping Pool D ahead of India. They started as the more attacking side and took the lead in the 12th minute after Jack Waller, Stuart Rushemere and Zachary Wallace combined beautifully. Waller cut into the striking circle from the right and Rushemere weaved around three German defenders before Wallace slammed home with a tennis-like volley. Wallace had another go at the German goal but his shot, after dodging past a defender in the second quarter, was blocked by the goalkeeper. Germany pressed in the second quarter with lot more players upfront but England defended well with man-to-man marking. But the relentless German attack resulted to their and the match’s first penalty corner, which they wasted. The Englishman did not give space to the Germans whenever they entered the striking circle. Harry Martin got space and time to take a shot but the goalkeeper was again at the thick of things as he blocked Germany’s second penalty corner two minutes from half time. Trailing 0-1 at half time, Germany let themselves down as Timur Oruz received a green card in the 31st minute for a two-minute suspension, and England pounded on that advantage to earn two back-to-back penalty corners and double their lead from the second one. Liam Ansell made a soft touch of the ball after the stopper put it on his path and then sent a powerful shot which beat the German goalkeeper Alexander Stadler all ends up. Germany were under tremendous pressure in the third quarter as Christopher Ruhr was shown a yellow card in the 38th minute for a five-minute suspension. Just before the end of the third quarter, play was stopped after England’s Liam Sanford fell down on the turf and a few of his team-mates surrounded Ruhr but the umpires were able to calm the players down. Germany got a penalty stroke in the 57th minute but Christopher Ruhr’s shot hit the crossbar. But one minute later, captain Mats Grambusch pulled one back with a field goal. The match ended 2-2 in dramatic fashion and just a few seconds later, Mats’ brother Tom scored from the penalty stroke. With 38 seconds left in the regulation time, Germany earned a penalty corner but England defended it under tense circumstances. In the second quarterfinal match, Koen Bijen (27th and 31st) struck twice while Justen Blok (36th), Steijn van Heijningen (50th) and Teun Beins (58th) scored the other goals for the Netherlands. Inwoo Seo (51st) scored the consolation goal for South Korea. One would have thought that the Netherlands would roll over South Korea. But it was not to be as the small Asian country fought tooth and nail and were not intimidated by the reputation of their opponents. Both South Korea and the Netherlands were goal-less in the first quarter with both sides earning two penalty corners each without utilising any of them. The Netherlands were the dominant side in the second session with more circle penetration and took the lead three minutes from the first half, with Koen Bijen scoring a field goal. The nimble-footed Koreans, however, did not just sit back. They made quick counter-attacks and forced two penalty corners though they could not convert any of them. From the second penalty corner, penalty corner specialist Jang Jonghyun’s drag flick hit German umpire Ben Goentgen on the face after the ball deflected from the stick of a Dutch defender. Goentgen, who fell down in pain before regaining composure, was helped out of the field and reserve umpire, Raghu Prasad of India, took charge for the remainder of the match. The Netherlands took the game out of South Korea’s reach in the third quarter with two goals in the space of five minutes. Bijen got his second goal from a penalty corner in the 31st minute before Justen Blok struck a field goal in the 36th minute. PTI Tags: Germany hockey netherlands world cup Share Tweet Send Share Suggest A Correction Enter your email to get our daily news in your inbox. Leave this field empty if you're human: Related Posts Germany subdues England in penalty shootout, enters Hockey World Cup semifinal January 25, 2023 Suryakumar Yadav named ICC Men’s Cricketer of the Year January 25, 2023 He is India’s No 1 opener, says Irfan Pathan on Shubman Gill’s hundred January 25, 2023 Sania Mirza-Rohan Bopanna sails into Australian Open mixed doubles final January 25, 2023 Rohit Sharma hopeful of Jasprit Bumrah’s availability in last two Tests against Aussies January 25, 2023 Russian athletes should not take part in 2024 Olympics Volodymyr Zelensky January 25, 2023 Leave a Reply Cancel reply Your email address will not be published. Required fields are marked * Comment * Name * Email * Website Save my name, email, and website in this browser for the next time I comment.","pubDate":"2023-01-25 17:37:54","image_url":"https://www.orissapost.com/wp-content/uploads/2023/01/Quaterfinal-match-Hockey-world-cup-_Germany-vs-England..-Germany-win-Shootout-4-3-goal-3-300x186.jpeg","source_id":"orissapost","category":["sports"],"country":["india"],"language":"english"},{"title":"Big Bash League 2022-23 Most Runs and Most Wickets standings: Matthew Short and Sean Abbott lead charts - Updated after Match 56","link":"https://www.sportskeeda.com/cricket/news-big-bash-league-2022-most-runs-most-wickets-standings-matthew-short-sean-abbott-lead-charts-updated-match-56?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Cricket"],"creator":["Sportz Connect"],"video_url":null,"description":null,"content":null,"pubDate":"2023-01-25 17:27:47","image_url":"https://static.sportskeeda.com/editor/2023/01/a84bf-16746479231360-1920.jpg","source_id":"sportskeeda","category":["sports"],"country":["india"],"language":"english"},{"title":"रोहित शर्मा ने जीत के बाद किसके हाथ में थमाई ट्रॉफी, बिना मैच खेले मिला बड़ा सम्मान","link":"https://hindi.news18.com/photogallery/sports/cricket-rohit-sharma-gives-trophy-to-ks-bharat-after-clean-sweep-against-new-zealand-wins-heart-ms-dhoni-traditon-continue-5278941.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"भारतीय टीम ने न्यूजीलैंड के खिलाफ वनडे सीरीज जीतकर 34 साल से चले आ रहे सिलसिले को जारी रखा. भारत दौरे पर कीवी टीम को कभी भी वनडे सीरीज में जीत नहीं मिली और इस बार भी वही हुआ. 3-0 से रोहित शर्मा की कप्तानी में क्लीन स्वीप करने के बाद उन्होंने कुछ ऐसा किया जिसने हर किसी का दिल जीत लिया.","content":"Loading... Loading... Loading... Loading... भारतीय टीम ने रोहित शर्मा की कप्तानी में न्यूजीलैंड का वनडे सीरीज में क्लीन स्वीप किया. पहला मुकाबला भारत ने 12 रन से जीता था जबकि दूसरे मैच में 8 विकेट की एकतरफा जीत दर्ज की थी. तीसरा मुकाबला 90 रन से जीतकर भारत ने 3-0 से सीरीज अपने नाम की.-AP तीसरे वनडे में भारतीय टीम के कप्तान रोहित शर्मा के बल्ले से शानदार शतकीय पारी निकली. साल 2020 के बाद वनडे में यह उनका पहला शतक था. 3 साल से चले आ रहे सूखे को उन्होंने खत्म किया.-AP तीसरे वनडे में भारत ने रोहित शर्मा और शुभमन गिल के शतक के दम पर 9 विकेट के नुकसान पर 385 रन का स्कोर खड़ा किया. न्यूजीलैंड की टीम के लिए डेवोन कॉन्वे ने शतकीय पारी खेली लेकिन टीम 295 रन पर ही ऑलराउट हो गई.-AP सीरीज के पहले दो मैच जीतकर 2-0 की अजेय बढ़त बना चुकी टीम इंडिया ने आखिरी मुकाबला जीता और फिर जो हुआ उसने सबका दिल जीत लिया. कप्तान रोहित शर्मा को जब ट्रॉफी दी गई तो उन्होंने उस खिलाड़ी को उसे थमाया जिसने एक भी मैच नहीं खेला.-AP टीम इंडिया में महेंद्र सिंह धौनी ने अपनी कप्तानी में ये प्रथा शुरू की थी कि जो भी टीम का नया या युवा खिलाड़ी हो उसे सीरीज जीत के बाद ट्रॉफी दी जाए. रोहित ने विकेटकीपर केएस भरत को जीत के बाद ट्रॉफी उठाने का मौका दिया.-AP","pubDate":"2023-01-25 17:24:46","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/01/KS-Bhrat-with-trophy-nz-16746671493x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"WPL Team Name: वुमेंस प्रीमियर लीग की टीमों का नामकरण शुरू, सामने आया अहमदाबाद फ्रेंचाइजी का नाम","link":"https://www.indiatv.in/sports/cricket/women-s-premier-league-ahmedabad-franchise-name-gujarat-giants-adani-sportsline-owns-costliest-team-of-wpl-2023-01-25-925330","keywords":null,"creator":null,"video_url":null,"description":"वुमेंस प्रीमियर लीग की बोली जीतने वाली पांच फ्रेंचाइजीज सामने आ चुकी हैं। हर फ्रेंचाइजी के मालिकों के बारे में भी पता चल चुका है और किस टीम पर कितने पैसे खर्च किए गए इसकी खबर भी आ चुकी है। अब इन टीमों के नामकरण का सिलसिला शुरू हो गया और इस कड़ी में अहमदाबाद फ्रेंचाइजी का नाम सामने आया है।","content":"वुमेंस प्रीमियर लीग (WPL) की टोटल बीडिंग की रकम का खुलासा होने के बाद इसका हिस्सा बनने वाली तमाम फ्रेंचाइजीज भी सामने आ गई। अब WPL के लिए बोली लगाने और जीतने वाली फ्रेंचाइजी के नामकरण के सिलसिले का भी आगाज हो गया है। वुमेंस प्रीमियर लीग में बतौर टीम बोली जीतने वाली पांच टीमों में सबसे महंगी रही अहमदाबाद फ्रेंचाइजी ने इस कड़ी में बाजी मारी है। इस फ्रेंचाइजी की मालिक अडानी स्पोर्ट्सलाइन है। अडानी ग्रुप के स्पोर्ट्स ब्रांच ने इस बारे में बुधवार को ऐलान किया। अहमदाबाद फ्रेंचाइजी को 'गुजरात जायंट्स' नाम से जाना जाएगा। यह वुमेंस प्रीमियर लीग की सबसे महंगी टीम भी है। अहमदाबाद फ्रेंचाइजी को अडानी ग्रुप ने बुधवार को भारतीय क्रिकेट कंट्रोल बोर्ड (बीसीसीआई) द्वारा आयोजित नीलामी में 1289 करोड़ रुपए की उच्चतम बोली के साथ खरीदा। बता दें कि आगामी वुमेंस प्रीमियर लीग में गुजरात जायंट्स क्रिकेट फ्रेंचाइजी की मालिक अडानी स्पोर्ट्सलाइन पहले से अन्य लीग में भी कुछ अन्य टीमों का भी स्वामित्व रखता है। उसके पास यूएई में चल रहे आईएलटी20 में गल्फ जायंट्स और प्रो कबड्डी लीग में गुजरात जायंट्स हैं। अडानी एंटरप्राइजेज के निदेशक प्रणव अडानी ने कहा कि भारतीय महिला क्रिकेट टीम असाधारण रूप से अच्छा प्रदर्शन कर रही है और महिलाओं के लिए क्रिकेट लीग उनके लिए और ज्यादा अवसर पैदा करेगा। उन्होंने कहा, \"क्रिकेट देश में काफी लोकप्रिय है और अडानी स्पोर्ट्सलाइन वुमेंस प्रीमियर लीग के पहले सीजन के साथ अपना जुड़ाव शुरू करने का इच्छुक था। जबकि मैं हर दूसरी फ्रेंचाइजी को शुभकामनाएं देता हूं, मैं 'गुजरात जायंट्स' के साथ खड़े होने की उम्मीद करता हूं। अडानी स्पोर्ट्सलाइन के अलावा इंडियाविन स्पोर्ट्स प्रा लिमिटेड ने 912.99 करोड़ रुपये की बोली के साथ मुंबई फ्रेंचाइजी का अधिग्रहण किया। रॉयल चैलेंजर्स स्पोर्ट्स प्रा लिमिटेड ने 901 करोड़ रुपए में बैंगलोर की फ्रेंचाइजी को अपने नाम किया, जेएसडब्ल्यू जीएमआर क्रिकेट प्रा लिमिटेड 810 करोड़ रुपए में दिल्ली की फ्रेंचाइजी खरीदने में सफल रही और कैपरी ग्लोबल होल्डिंग्स प्रा लिमिटेड ने 757 करोड़ रुपए में लखनऊ की टीम को अपने नाम किया। डब्ल्यूपीएल का पहला सीजन इस साल मार्च में आयोजित किए जाने की संभावना जताई जा रही है। इस लीग की पांच टीमों के लिए खिलाड़ियों की नीलामी अगले महीने फरवरी में हो सकती है। इसके बारे में बीसीसआई ने अब तक कोई आधिकारिक ऐलान नहीं किया है।","pubDate":"2023-01-25 17:00:04","image_url":null,"source_id":"indiatv","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Indian cricket fraternity extends birthday wishes to Cheteshwar Pujara","link":"https://thenewsmill.com/2023/01/indian-cricket-fraternity-extends-birthday-wishes-to-cheteshwar-pujara/","keywords":["Cricket","Sports","ANI"],"creator":["ANI"],"video_url":null,"description":null,"content":"The Indian cricketing fraternity took to social media to extend birthday wishes to the middle-order veteran Cheteshwar Pujara, who turned 35 on Wednesday. The Board of Control for Cricket in India (BCCI) took to Twitter to extend their wishes to the veteran batter. “103 intl. matches 7,065 intl. runs 19 intl. tons Here’s wishing @cheteshwar1 – one of the grittiest modern-day batters – a very happy birthday. #TeamIndia,” tweeted BCCI. Legendary Indian cricketer Sachin Tendulkar also extended wishes to the “rock in India’s batting lineup”. “Not all five fingers are the same. Not every Test batsman needs to be a big hitter. An aggressive batting lineup should also be able to defend well. Pujara, you have been a rock in India’s batting lineup. Stay unique, stay you! Happy birthday,” tweeted Tendulkar. Star Indian batter Virat Kohli also took to Instagram to wish Pujara. “Happy birthday Puji. Have a good one,” said the caption of Virat’s story. Indian opener KL Rahul also took to Instagram and wished his teammate a very happy birthday. “Happy birthday bro, @cheteshwarpujara,” said the caption of Rahul’s story. India’s up-and-coming middle-order star Shreyas Iyer, also took to Instagram to wish Pujara on his birthday, saying on his story, “happy birthday @cheteshwarpujara.” Chennai Super Kings (CSK), Pujara’s IPL team with who he won the title in 2021, also tweeted, “To the man who rises above challenges with indomitable will! Super Birthday, Pujara!” Former Indian World-Cup winning all-rounder Yuvraj Singh also wished Pujara on his birthday via an Instagram story, saying that he is “a champ who teaches the art of patience to the opposition each time he steps on to the park” Pujara has made a name for himself with his solid technique and his defensive batting style that has bailed India out of difficulties on many occasions. His batting style has earned him comparisons with former India batter and current national side head coach Rahul Dravid, also known as ‘The Wall’. In 98 Tests so far, he has scored 7,014 runs at an average of 44.39. Nineteen centuries and 34 half-centuries have come out of his bat in the format with a best of 206*. He is a vital part of Team India which completed the historic Border-Gavaskar Trophy series win against Australia in their home territory in 2018-19 and 2020-21 season. In fact, Pujara top-scored with 521 runs at an average of 74.42, three centuries and a fifty in 2018-19 series, which India won 2-1. Pujara has also represented India in five ODIs, in which he could make only 51 runs at an average of 10.20, with best of 27. He will be seen in action during the Border-Gavaskar Trophy against Australia from February 9 onwards. India will be aiming that this middle-order batter displays his top form and helps his team in defending the trophy. (ANI) This report is filed by ANI news service. TheNewsMill holds no responsibility for this content.","pubDate":"2023-01-25 16:32:02","image_url":null,"source_id":"thenewsmill","category":["sports"],"country":["india"],"language":"english"},{"title":"पृथ्वी साव से भी खतरनाक है यह कोहली, घरेलू क्रिकेट में मचा रखा है कोहराम","link":"https://navbharattimes.indiatimes.com/sports/cricket/cricket-news/taruwar-kohli-scoring-consistently-in-domestic-cricket-including-ranji-trophy/articleshow/97325410.cms","keywords":null,"creator":null,"video_url":null,"description":"Ranji Trophy: पृथ्वी साव घरेलू क्रिकेट में लगातार रन बना रहे हैं और उन्हें टीम इंडिया में शामिल करने की मांग हो रही है। वहीं एक ऐसा भी खिलाड़ी हैं, जो पिछले कई सालों में लगातार रन बना रहा है। लेकिन इस कोहली को अभी तक टीम इंडिया में मौका नहीं मिला।","content":"भारत ने 2008 अंडर-19 वर्ल्ड कप जीता था। विराट कोहली उस टीम के कप्तान थे। उसी साल वह टीम इंडिया का हिस्सा भी बन गए। फिर विराट भारत के कप्तान बने और दुनिया के सबसे बेहतरीन बल्लेबाजों की लिस्ट में जगह बना ली। उसी टीम में एक और कोहली थे- तरुवर कोहली। जालंधर के तरुवर का बल्ला आज भी रन उगल रहा है लेकिन उन्हें टीम में लेने की चर्चा कभी नहीं हुई। 34 साल के तरुवर दाएं हाथ के बल्लेबाज और दाएं हाथ के ही मीडियम पेस गेंदबाज हैं। रणजी ट्रॉफी के इस सीजन में भी तरुवर कोहली का बल्ला जमकर बोल रहा है। वह मिजोरम के लिए खेल रहे हैं। 6 मैचों की 10 पारियों में कोहली ने 74.6 की औसत से 746 रन बनाए हैं। उनके बल्ले से तीन शतक और तीन फिफ्टी निकली है। कोहली की सबसे बड़ी पारी 203 रनों की है। वह सबसे ज्यादा रन बनाने वाले बल्लेबाजों की लिस्ट में चौथे नंबर पर हैं। सके अलावा उन्होंने 24 बल्लेबाजों का शिकार भी किया है। टूर्नामेंट के पिछले सीजन में तरुवर को सिर्फ तीन ही मैच खेलने का मौका मिला था। इसमें उन्होंने 131.50 की औसत से 526 रन ठोके थे। उन्होंने इस दौरान तीन शतक भी लगाए थे। 55 फर्स्ट क्लास मैच में तरुवर के बल्ले से 53.8 की औसत से 4573 रन निकले हैं। उनके नाम 74 विकेट भी हैं। लिस्ट ए की 60 पारियों में उन्होंने 40 की औसत से 1913 रन बनाए हैं। साथ ही 41 विकेट भी लिये हैं। तरुवर कोहली ने 2008 अंडर-19 वर्ल्ड कप के तीन मैचों में फिफ्टी ठोकी थी। 6 मैचों में 218 रन बनाने के साथ वह टूर्नामेंट के 5वें सबसे सफल खिलाड़ी थे। उसी साल उन्होंने पंजाब के लिए रणजी डेब्यू किया था। उस मुकाबले में तरुवर के बल्ले से 79 रनों की पारी निकली थी। 2019/20 रणजी सीजन में पहले दूसरे सबसे ज्यादा रन बनाने वाले बल्लेबाज थे। 16 पारियों में तरुवर ने 71 की औसत से 998 रन बनाए थे। इसमें 307 रनों की पारी भी थी। उन्होंने पंजाब के लिए भी तिहरा शतक लगाया था।","pubDate":"2023-01-26 00:30:00","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Jofra Archer ready to do the ‘hard yards’ for Ashes and World Cup challenges","link":"https://www.independent.co.uk/sport/cricket/jofra-archer-england-odi-south-africa-australia-b2269181.html","keywords":["Cricket","Sport"],"creator":["David Charlesworth"],"video_url":null,"description":"The 27-year-old has seen his career railroaded by elbow and back injuries.","content":"Jofra Archer is ready to do the “hard yards” for the twin challenges of the Ashes and World Cup this year but is aware of the expectation he faces ahead of his England return. Archer was England’s pace spearhead in the 2019 50-over World Cup triumph and then took 22 wickets at a dizzying 20.27 in that summer’s Ashes, but his career has been railroaded by elbow and back injuries. Having collected eight wickets in five matches on his competitive comeback in the SA20 this month, Archer is on the verge of a first England appearance since March 2021 in an ODI series against South Africa this week. While a red-ball outing remains some way off for Archer, who says he is now at “about 80 per cent” fitness, he is happy to do whatever it takes to feature for England against Australia this summer. “It is an exciting prospect to think about playing with the guys again, especially with the brand of cricket they are playing, which is very exciting,” Archer said. “I need to spend the next two, three, four months finetuning the body and making myself a bit more resilient. Let me sort that out first then I can look forward to holding the red ball in my hand again. “Overs are overs and you train and bowl until you feel good. Obviously, I might have to do some extra bowling during the weeks when I’m in India (for the Indian Premier League, likely in April and May). “But that is absolutely fine because I want to play in the Ashes, so I’m going to have to do all the hard yards to tick those boxes.” His breakout displays in 2019 mean Archer is held in the utmost regard and the 27-year-old accepted the flip side is there will be a lot of curiosity regarding how he fares in the weeks and months ahead. Red and white-ball captains Ben Stokes and Jos Buttler have attempted to put Archer’s mind at ease, with the fast bowler seemingly set for England’s first ODI of the year in Bloemfontein on Friday which marks the start of the countdown towards the defence of their World Cup title in India in the autumn. “(Ben) said there is no expectation, so did Jos,” Archer said. “It’s nice to hear it, but people will have expectations anyway. Hopefully I can do a half decent job to help the team. “If I don’t do well when I play, a lot of people will be watching. I will be judged again and no one will remember the good stuff I’ve done in SA20. You are only as good as your last game. “This is our first ODI of the year so I’m very glad to be playing from the start and, when we do get to India, hopefully I’ll be there, and everything will seem worth it.” Being part of England’s team environment is important to Archer, who revealed the toughest moments of being sidelined for so long were watching the last two T20 World Cups from thousands of miles away. Archer was sorely missed as England bowed out of the semi-finals in 2021 and he even contemplated flying out to Australia ahead of their successful campaign last November. “The hardest part of watching is not being able to help,” he said. “That was the hardest part. You don’t even have to play, just being there. I almost bought a ticket to Oz.” Archer was originally supposed to play two matches for MI Cape Town in South Africa’s newly-created T20 league but has played three more after England’s two practice matches here were scrapped. His injury struggles in the last couple of years mean he draws comfort from every outing for his franchise, whereupon taking a wicket he has started copying the celebration of Manchester United forward Marcus Rashford by putting a finger to his temple. “I don’t know what it means, but I’ve seen him do it and he’s a pretty nailed-on guy so I can’t imagine it having a bad reason to it,” United fan Archer said. “Every game I play relaxes me a little bit more. In the back of my mind I’m thinking I’m still not out of the waters yet.”","pubDate":"2023-01-25 18:00:06","image_url":"https://static.independent.co.uk/2023/01/25/18/5d1fb06327f49e23bcaac422f04ad926Y29udGVudHNlYXJjaGFwaSwxNjc0NzUxNzE3-2.45229326.jpg?width=1200&auto=webp","source_id":"independentuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Do you recognise this man: John Smit, Shaun Pollock OR … ?","link":"https://www.thesouthafrican.com/news/who-is-this-man-john-smit-shaun-pollock-chris-hipkins-breaking-25-january-2023/","keywords":["News","Proteas","Springboks","Chris Hipkins","Featured","John Smit","New Zealand Prime Minister","Shaun Pollock"],"creator":["Garrin Lambley"],"video_url":null,"description":"Does the man below look familiar? Do you feel you've seen him somewhere before, perhaps on the rugby or cricket field?","content":"Does the man above look familiar? Do you feel you’ve seen him somewhere before, perhaps on the rugby or cricket field? FOR MORE SPORT AND POLITICS NEWS VISIT THE SOUTH AFRICAN WEBSITE Is it former Springbok captain John Smit who played 111 Tests for his country and led the national team to Rugby World Cup victory in 2007 in France? Is it former Proteas all-rounder Shaun Pollock who played 108 Tests, 303 ODIs and 12 T20Is for South Africa, taking a total of 829 wickets? Or is it New Zealand’s new Prime Minister Chris Hipkins who took over as Kiwi leader following Jacinda Ardern’s shock decision to step down last week? Answers on a postcard or an email to info@thesouthafrican.com or a WhatsApp to 060 011 0211 – or leave a comment below. You can also follow @TheSAnews on Twitter and The South African on Facebook .","pubDate":"2023-01-25 17:58:26","image_url":"https://www.thesouthafrican.com/wp-content/themes/jnews-child/assets/images/normal.jpeg.optimal.jpeg","source_id":"thesouthafrican","category":["sports"],"country":["south africa"],"language":"english"},{"title":"[WATCH] Jemimah Rodrigues and Women in Blue sing 'Pehli Nazar Mein' song, enjoy a fun day at the beach","link":"https://www.sportskeeda.com/cricket/news-watch-jemimah-rodrigues-women-blue-sing-pehli-nazar-mein-song-enjoy-fun-day-beach?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Cricket"],"creator":["James Kuanal"],"video_url":null,"description":null,"content":null,"pubDate":"2023-01-25 17:57:11","image_url":"https://static.sportskeeda.com/editor/2023/01/c3f03-16746499198543-1920.jpg","source_id":"sportskeeda","category":["sports"],"country":["india"],"language":"english"},{"title":"3 Indian players whose form will be closely watched during the T20I series vs New Zealand","link":"https://www.sportskeeda.com/cricket/3-indian-players-whose-form-will-closely-watched-t20i-series-vs-new-zealand?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Cricket"],"creator":["Sai Krishna"],"video_url":null,"description":null,"content":null,"pubDate":"2023-01-25 17:38:15","image_url":"https://static.sportskeeda.com/editor/2023/01/5c9c8-16746487454170-1920.jpg","source_id":"sportskeeda","category":["sports"],"country":["india"],"language":"english"},{"title":"Grambusch brothers take Germany to semifinals, Netherlands join them","link":"https://www.orissapost.com/grambusch-brothers-take-germany-to-semifinals-netherlands-join-them/","keywords":["Sports","Germany","hockey","netherlands","world cup"],"creator":["Post News Network"],"video_url":null,"description":"Bhubaneswar: Germany edged out England in penalty shootout under dramatic circumstances after trailing 0-2 two minutes before regulation time to book a berth in the FIH Men’s World Cup semifinals where Netherlands joined them with a win over South Korea here Wednesday. Germany struck in the 58th and 59th minutes through captain Mats Grambusch and […]","content":"Grambusch brothers take Germany to semifinals, Netherlands join them PTI Updated: January 25th, 2023, 23:07 IST in Sports 0 Share on Facebook Share on Twitter Share on WhatsApp Share on Linkedin Bhubaneswar: Germany edged out England in penalty shootout under dramatic circumstances after trailing 0-2 two minutes before regulation time to book a berth in the FIH Men’s World Cup semifinals where Netherlands joined them with a win over South Korea here Wednesday. Germany struck in the 58th and 59th minutes through captain Mats Grambusch and his younger brother Tom to take the quarterfinal match to the penalty shootout where they prevailed over a heart-broken England team 4-3, snatching win from the jaws of defeat. Our guests for today !! Secy Sports, @IndiaSports Ms Sujata Chaturvedi along with Editor, Dharitri Sri @SatpathyLive graced the 3rd quarter Final between @DHB_hockey & @EnglandHockey as pre-match guests and wished both the teams the best. pic.twitter.com/CcWbnUZGV3 — Odisha Sports (@sports_odisha) January 25, 2023 Germany, who had finished second in Pool B and defeated France 5-1 in the crossover match, face three-time champions and last edition bronze medallists Australia in the semifinals Friday. In the second quarterfinal match of the day at the Kalinga Stadium, last two editions runners-up Netherlands ended gritty South Korea’s more-than-expected run in the tournament with a 5-1 win to set up a last-four clash with Belgium Friday. Van Harte Gefeliciteerd @oranjehockey ! #HockeyWorldCup2023 #HWC2023 #HockeyComesHome #HockeyWorldCup #OdishaForHockey #NEDvsKOR pic.twitter.com/qcFlZ3R2bM — Odisha Sports (@sports_odisha) January 25, 2023 South Korea, who had stunned 2016 Rio Olympics champions Argentina in the crossover match on Monday, yet again punched above their weight as they gave a spirited fight to their more fancied opponents, ranked third in the world. South Korea are ranked ninth in the world. South Korea were the only Asian side that remained in the quarterfinals. The vociferous spectators at the Kalinga Stadium thought that England would wrap up the match comfortably after Zachary Wallace (12th) and Liam Ansell (33rd) had given them a 2-0 lead but, to their astonishment, the Germans came back roaring to score goals in the 58th and 59th minutes through Mats and Tom Grambusch respectively. Just before that Christopher Ruhr had wasted a chance from the penalty stroke in the 57th minute. When Germany was training 1-2 and got a penalty stroke with one minute to go in the match, Mats asked his younger brother Tom to take it. Tom made no mistake from the spot to take the match to the penalty shootout. Niklas Wellen, Hannes Muller, Prinz Thies and Christopher Ruhr scored for Germany in the shootout. For England, James Albery, Zachary Wallace, Phil Roper struck while David Goodfield missed. “It was a crazy match for sure, we were behind for most of the match. But we were able to convert the chances that came our way late in the match. It shows the character of the team,” Mats said. “Our parents must be watching this match and they must be extremely happy seeing that we both scored in a crucial match for the team and country,” Tom said. The German fightback was reminiscent of their national football team which is famous for its never-say-die attitude. “It is a cruel game, you were 2-0 up less than five minutes to go in the match and you lost the game,” rued England captain David Ames. England had directly made it to the quarterfinals after topping Pool D ahead of India. They started as the more attacking side and took the lead in the 12th minute after Jack Waller, Stuart Rushemere and Zachary Wallace combined beautifully. Waller cut into the striking circle from the right and Rushemere weaved around three German defenders before Wallace slammed home with a tennis-like volley. Wallace had another go at the German goal but his shot, after dodging past a defender in the second quarter, was blocked by the goalkeeper. Germany pressed in the second quarter with lot more players upfront but England defended well with man-to-man marking. But the relentless German attack resulted to their and the match’s first penalty corner, which they wasted. The Englishman did not give space to the Germans whenever they entered the striking circle. Harry Martin got space and time to take a shot but the goalkeeper was again at the thick of things as he blocked Germany’s second penalty corner two minutes from half time. Trailing 0-1 at half time, Germany let themselves down as Timur Oruz received a green card in the 31st minute for a two-minute suspension, and England pounded on that advantage to earn two back-to-back penalty corners and double their lead from the second one. Liam Ansell made a soft touch of the ball after the stopper put it on his path and then sent a powerful shot which beat the German goalkeeper Alexander Stadler all ends up. Germany were under tremendous pressure in the third quarter as Christopher Ruhr was shown a yellow card in the 38th minute for a five-minute suspension. Just before the end of the third quarter, play was stopped after England’s Liam Sanford fell down on the turf and a few of his team-mates surrounded Ruhr but the umpires were able to calm the players down. Germany got a penalty stroke in the 57th minute but Christopher Ruhr’s shot hit the crossbar. But one minute later, captain Mats Grambusch pulled one back with a field goal. The match ended 2-2 in dramatic fashion and just a few seconds later, Mats’ brother Tom scored from the penalty stroke. With 38 seconds left in the regulation time, Germany earned a penalty corner but England defended it under tense circumstances. In the second quarterfinal match, Koen Bijen (27th and 31st) struck twice while Justen Blok (36th), Steijn van Heijningen (50th) and Teun Beins (58th) scored the other goals for the Netherlands. Inwoo Seo (51st) scored the consolation goal for South Korea. One would have thought that the Netherlands would roll over South Korea. But it was not to be as the small Asian country fought tooth and nail and were not intimidated by the reputation of their opponents. Both South Korea and the Netherlands were goal-less in the first quarter with both sides earning two penalty corners each without utilising any of them. The Netherlands were the dominant side in the second session with more circle penetration and took the lead three minutes from the first half, with Koen Bijen scoring a field goal. The nimble-footed Koreans, however, did not just sit back. They made quick counter-attacks and forced two penalty corners though they could not convert any of them. From the second penalty corner, penalty corner specialist Jang Jonghyun’s drag flick hit German umpire Ben Goentgen on the face after the ball deflected from the stick of a Dutch defender. Goentgen, who fell down in pain before regaining composure, was helped out of the field and reserve umpire, Raghu Prasad of India, took charge for the remainder of the match. The Netherlands took the game out of South Korea’s reach in the third quarter with two goals in the space of five minutes. Bijen got his second goal from a penalty corner in the 31st minute before Justen Blok struck a field goal in the 36th minute. PTI Tags: Germany hockey netherlands world cup Share Tweet Send Share Suggest A Correction Enter your email to get our daily news in your inbox. Leave this field empty if you're human: Related Posts Germany subdues England in penalty shootout, enters Hockey World Cup semifinal January 25, 2023 Suryakumar Yadav named ICC Men’s Cricketer of the Year January 25, 2023 He is India’s No 1 opener, says Irfan Pathan on Shubman Gill’s hundred January 25, 2023 Sania Mirza-Rohan Bopanna sails into Australian Open mixed doubles final January 25, 2023 Rohit Sharma hopeful of Jasprit Bumrah’s availability in last two Tests against Aussies January 25, 2023 Russian athletes should not take part in 2024 Olympics Volodymyr Zelensky January 25, 2023 Leave a Reply Cancel reply Your email address will not be published. Required fields are marked * Comment * Name * Email * Website Save my name, email, and website in this browser for the next time I comment.","pubDate":"2023-01-25 17:37:54","image_url":"https://www.orissapost.com/wp-content/uploads/2023/01/Quaterfinal-match-Hockey-world-cup-_Germany-vs-England..-Germany-win-Shootout-4-3-goal-3-300x186.jpeg","source_id":"orissapost","category":["sports"],"country":["india"],"language":"english"},{"title":"Big Bash League 2022-23 Most Runs and Most Wickets standings: Matthew Short and Sean Abbott lead charts - Updated after Match 56","link":"https://www.sportskeeda.com/cricket/news-big-bash-league-2022-most-runs-most-wickets-standings-matthew-short-sean-abbott-lead-charts-updated-match-56?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Cricket"],"creator":["Sportz Connect"],"video_url":null,"description":null,"content":null,"pubDate":"2023-01-25 17:27:47","image_url":"https://static.sportskeeda.com/editor/2023/01/a84bf-16746479231360-1920.jpg","source_id":"sportskeeda","category":["sports"],"country":["india"],"language":"english"},{"title":"रोहित शर्मा ने जीत के बाद किसके हाथ में थमाई ट्रॉफी, बिना मैच खेले मिला बड़ा सम्मान","link":"https://hindi.news18.com/photogallery/sports/cricket-rohit-sharma-gives-trophy-to-ks-bharat-after-clean-sweep-against-new-zealand-wins-heart-ms-dhoni-traditon-continue-5278941.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"भारतीय टीम ने न्यूजीलैंड के खिलाफ वनडे सीरीज जीतकर 34 साल से चले आ रहे सिलसिले को जारी रखा. भारत दौरे पर कीवी टीम को कभी भी वनडे सीरीज में जीत नहीं मिली और इस बार भी वही हुआ. 3-0 से रोहित शर्मा की कप्तानी में क्लीन स्वीप करने के बाद उन्होंने कुछ ऐसा किया जिसने हर किसी का दिल जीत लिया.","content":"Loading... Loading... Loading... Loading... भारतीय टीम ने रोहित शर्मा की कप्तानी में न्यूजीलैंड का वनडे सीरीज में क्लीन स्वीप किया. पहला मुकाबला भारत ने 12 रन से जीता था जबकि दूसरे मैच में 8 विकेट की एकतरफा जीत दर्ज की थी. तीसरा मुकाबला 90 रन से जीतकर भारत ने 3-0 से सीरीज अपने नाम की.-AP तीसरे वनडे में भारतीय टीम के कप्तान रोहित शर्मा के बल्ले से शानदार शतकीय पारी निकली. साल 2020 के बाद वनडे में यह उनका पहला शतक था. 3 साल से चले आ रहे सूखे को उन्होंने खत्म किया.-AP तीसरे वनडे में भारत ने रोहित शर्मा और शुभमन गिल के शतक के दम पर 9 विकेट के नुकसान पर 385 रन का स्कोर खड़ा किया. न्यूजीलैंड की टीम के लिए डेवोन कॉन्वे ने शतकीय पारी खेली लेकिन टीम 295 रन पर ही ऑलराउट हो गई.-AP सीरीज के पहले दो मैच जीतकर 2-0 की अजेय बढ़त बना चुकी टीम इंडिया ने आखिरी मुकाबला जीता और फिर जो हुआ उसने सबका दिल जीत लिया. कप्तान रोहित शर्मा को जब ट्रॉफी दी गई तो उन्होंने उस खिलाड़ी को उसे थमाया जिसने एक भी मैच नहीं खेला.-AP टीम इंडिया में महेंद्र सिंह धौनी ने अपनी कप्तानी में ये प्रथा शुरू की थी कि जो भी टीम का नया या युवा खिलाड़ी हो उसे सीरीज जीत के बाद ट्रॉफी दी जाए. रोहित ने विकेटकीपर केएस भरत को जीत के बाद ट्रॉफी उठाने का मौका दिया.-AP","pubDate":"2023-01-25 17:24:46","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/01/KS-Bhrat-with-trophy-nz-16746671493x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"WPL Team Name: वुमेंस प्रीमियर लीग की टीमों का नामकरण शुरू, सामने आया अहमदाबाद फ्रेंचाइजी का नाम","link":"https://www.indiatv.in/sports/cricket/women-s-premier-league-ahmedabad-franchise-name-gujarat-giants-adani-sportsline-owns-costliest-team-of-wpl-2023-01-25-925330","keywords":null,"creator":null,"video_url":null,"description":"वुमेंस प्रीमियर लीग की बोली जीतने वाली पांच फ्रेंचाइजीज सामने आ चुकी हैं। हर फ्रेंचाइजी के मालिकों के बारे में भी पता चल चुका है और किस टीम पर कितने पैसे खर्च किए गए इसकी खबर भी आ चुकी है। अब इन टीमों के नामकरण का सिलसिला शुरू हो गया और इस कड़ी में अहमदाबाद फ्रेंचाइजी का नाम सामने आया है।","content":"वुमेंस प्रीमियर लीग (WPL) की टोटल बीडिंग की रकम का खुलासा होने के बाद इसका हिस्सा बनने वाली तमाम फ्रेंचाइजीज भी सामने आ गई। अब WPL के लिए बोली लगाने और जीतने वाली फ्रेंचाइजी के नामकरण के सिलसिले का भी आगाज हो गया है। वुमेंस प्रीमियर लीग में बतौर टीम बोली जीतने वाली पांच टीमों में सबसे महंगी रही अहमदाबाद फ्रेंचाइजी ने इस कड़ी में बाजी मारी है। इस फ्रेंचाइजी की मालिक अडानी स्पोर्ट्सलाइन है। अडानी ग्रुप के स्पोर्ट्स ब्रांच ने इस बारे में बुधवार को ऐलान किया। अहमदाबाद फ्रेंचाइजी को 'गुजरात जायंट्स' नाम से जाना जाएगा। यह वुमेंस प्रीमियर लीग की सबसे महंगी टीम भी है। अहमदाबाद फ्रेंचाइजी को अडानी ग्रुप ने बुधवार को भारतीय क्रिकेट कंट्रोल बोर्ड (बीसीसीआई) द्वारा आयोजित नीलामी में 1289 करोड़ रुपए की उच्चतम बोली के साथ खरीदा। बता दें कि आगामी वुमेंस प्रीमियर लीग में गुजरात जायंट्स क्रिकेट फ्रेंचाइजी की मालिक अडानी स्पोर्ट्सलाइन पहले से अन्य लीग में भी कुछ अन्य टीमों का भी स्वामित्व रखता है। उसके पास यूएई में चल रहे आईएलटी20 में गल्फ जायंट्स और प्रो कबड्डी लीग में गुजरात जायंट्स हैं। अडानी एंटरप्राइजेज के निदेशक प्रणव अडानी ने कहा कि भारतीय महिला क्रिकेट टीम असाधारण रूप से अच्छा प्रदर्शन कर रही है और महिलाओं के लिए क्रिकेट लीग उनके लिए और ज्यादा अवसर पैदा करेगा। उन्होंने कहा, \"क्रिकेट देश में काफी लोकप्रिय है और अडानी स्पोर्ट्सलाइन वुमेंस प्रीमियर लीग के पहले सीजन के साथ अपना जुड़ाव शुरू करने का इच्छुक था। जबकि मैं हर दूसरी फ्रेंचाइजी को शुभकामनाएं देता हूं, मैं 'गुजरात जायंट्स' के साथ खड़े होने की उम्मीद करता हूं। अडानी स्पोर्ट्सलाइन के अलावा इंडियाविन स्पोर्ट्स प्रा लिमिटेड ने 912.99 करोड़ रुपये की बोली के साथ मुंबई फ्रेंचाइजी का अधिग्रहण किया। रॉयल चैलेंजर्स स्पोर्ट्स प्रा लिमिटेड ने 901 करोड़ रुपए में बैंगलोर की फ्रेंचाइजी को अपने नाम किया, जेएसडब्ल्यू जीएमआर क्रिकेट प्रा लिमिटेड 810 करोड़ रुपए में दिल्ली की फ्रेंचाइजी खरीदने में सफल रही और कैपरी ग्लोबल होल्डिंग्स प्रा लिमिटेड ने 757 करोड़ रुपए में लखनऊ की टीम को अपने नाम किया। डब्ल्यूपीएल का पहला सीजन इस साल मार्च में आयोजित किए जाने की संभावना जताई जा रही है। इस लीग की पांच टीमों के लिए खिलाड़ियों की नीलामी अगले महीने फरवरी में हो सकती है। इसके बारे में बीसीसआई ने अब तक कोई आधिकारिक ऐलान नहीं किया है।","pubDate":"2023-01-25 17:00:04","image_url":null,"source_id":"indiatv","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Indian cricket fraternity extends birthday wishes to Cheteshwar Pujara","link":"https://thenewsmill.com/2023/01/indian-cricket-fraternity-extends-birthday-wishes-to-cheteshwar-pujara/","keywords":["Cricket","Sports","ANI"],"creator":["ANI"],"video_url":null,"description":null,"content":"The Indian cricketing fraternity took to social media to extend birthday wishes to the middle-order veteran Cheteshwar Pujara, who turned 35 on Wednesday. The Board of Control for Cricket in India (BCCI) took to Twitter to extend their wishes to the veteran batter. “103 intl. matches 7,065 intl. runs 19 intl. tons Here’s wishing @cheteshwar1 – one of the grittiest modern-day batters – a very happy birthday. #TeamIndia,” tweeted BCCI. Legendary Indian cricketer Sachin Tendulkar also extended wishes to the “rock in India’s batting lineup”. “Not all five fingers are the same. Not every Test batsman needs to be a big hitter. An aggressive batting lineup should also be able to defend well. Pujara, you have been a rock in India’s batting lineup. Stay unique, stay you! Happy birthday,” tweeted Tendulkar. Star Indian batter Virat Kohli also took to Instagram to wish Pujara. “Happy birthday Puji. Have a good one,” said the caption of Virat’s story. Indian opener KL Rahul also took to Instagram and wished his teammate a very happy birthday. “Happy birthday bro, @cheteshwarpujara,” said the caption of Rahul’s story. India’s up-and-coming middle-order star Shreyas Iyer, also took to Instagram to wish Pujara on his birthday, saying on his story, “happy birthday @cheteshwarpujara.” Chennai Super Kings (CSK), Pujara’s IPL team with who he won the title in 2021, also tweeted, “To the man who rises above challenges with indomitable will! Super Birthday, Pujara!” Former Indian World-Cup winning all-rounder Yuvraj Singh also wished Pujara on his birthday via an Instagram story, saying that he is “a champ who teaches the art of patience to the opposition each time he steps on to the park” Pujara has made a name for himself with his solid technique and his defensive batting style that has bailed India out of difficulties on many occasions. His batting style has earned him comparisons with former India batter and current national side head coach Rahul Dravid, also known as ‘The Wall’. In 98 Tests so far, he has scored 7,014 runs at an average of 44.39. Nineteen centuries and 34 half-centuries have come out of his bat in the format with a best of 206*. He is a vital part of Team India which completed the historic Border-Gavaskar Trophy series win against Australia in their home territory in 2018-19 and 2020-21 season. In fact, Pujara top-scored with 521 runs at an average of 74.42, three centuries and a fifty in 2018-19 series, which India won 2-1. Pujara has also represented India in five ODIs, in which he could make only 51 runs at an average of 10.20, with best of 27. He will be seen in action during the Border-Gavaskar Trophy against Australia from February 9 onwards. India will be aiming that this middle-order batter displays his top form and helps his team in defending the trophy. (ANI) This report is filed by ANI news service. TheNewsMill holds no responsibility for this content.","pubDate":"2023-01-25 16:32:02","image_url":null,"source_id":"thenewsmill","category":["sports"],"country":["india"],"language":"english"},{"title":"पृथ्वी साव से भी खतरनाक है यह कोहली, घरेलू क्रिकेट में मचा रखा है कोहराम","link":"https://navbharattimes.indiatimes.com/sports/cricket/cricket-news/taruwar-kohli-scoring-consistently-in-domestic-cricket-including-ranji-trophy/articleshow/97325410.cms","keywords":null,"creator":null,"video_url":null,"description":"Ranji Trophy: पृथ्वी साव घरेलू क्रिकेट में लगातार रन बना रहे हैं और उन्हें टीम इंडिया में शामिल करने की मांग हो रही है। वहीं एक ऐसा भी खिलाड़ी हैं, जो पिछले कई सालों में लगातार रन बना रहा है। लेकिन इस कोहली को अभी तक टीम इंडिया में मौका नहीं मिला।","content":"भारत ने 2008 अंडर-19 वर्ल्ड कप जीता था। विराट कोहली उस टीम के कप्तान थे। उसी साल वह टीम इंडिया का हिस्सा भी बन गए। फिर विराट भारत के कप्तान बने और दुनिया के सबसे बेहतरीन बल्लेबाजों की लिस्ट में जगह बना ली। उसी टीम में एक और कोहली थे- तरुवर कोहली। जालंधर के तरुवर का बल्ला आज भी रन उगल रहा है लेकिन उन्हें टीम में लेने की चर्चा कभी नहीं हुई। 34 साल के तरुवर दाएं हाथ के बल्लेबाज और दाएं हाथ के ही मीडियम पेस गेंदबाज हैं। रणजी ट्रॉफी के इस सीजन में भी तरुवर कोहली का बल्ला जमकर बोल रहा है। वह मिजोरम के लिए खेल रहे हैं। 6 मैचों की 10 पारियों में कोहली ने 74.6 की औसत से 746 रन बनाए हैं। उनके बल्ले से तीन शतक और तीन फिफ्टी निकली है। कोहली की सबसे बड़ी पारी 203 रनों की है। वह सबसे ज्यादा रन बनाने वाले बल्लेबाजों की लिस्ट में चौथे नंबर पर हैं। सके अलावा उन्होंने 24 बल्लेबाजों का शिकार भी किया है। टूर्नामेंट के पिछले सीजन में तरुवर को सिर्फ तीन ही मैच खेलने का मौका मिला था। इसमें उन्होंने 131.50 की औसत से 526 रन ठोके थे। उन्होंने इस दौरान तीन शतक भी लगाए थे। 55 फर्स्ट क्लास मैच में तरुवर के बल्ले से 53.8 की औसत से 4573 रन निकले हैं। उनके नाम 74 विकेट भी हैं। लिस्ट ए की 60 पारियों में उन्होंने 40 की औसत से 1913 रन बनाए हैं। साथ ही 41 विकेट भी लिये हैं। तरुवर कोहली ने 2008 अंडर-19 वर्ल्ड कप के तीन मैचों में फिफ्टी ठोकी थी। 6 मैचों में 218 रन बनाने के साथ वह टूर्नामेंट के 5वें सबसे सफल खिलाड़ी थे। उसी साल उन्होंने पंजाब के लिए रणजी डेब्यू किया था। उस मुकाबले में तरुवर के बल्ले से 79 रनों की पारी निकली थी। 2019/20 रणजी सीजन में पहले दूसरे सबसे ज्यादा रन बनाने वाले बल्लेबाज थे। 16 पारियों में तरुवर ने 71 की औसत से 998 रन बनाए थे। इसमें 307 रनों की पारी भी थी। उन्होंने पंजाब के लिए भी तिहरा शतक लगाया था।","pubDate":"2023-01-26 00:30:00","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Jofra Archer ready to do the ‘hard yards’ for Ashes and World Cup challenges","link":"https://www.independent.co.uk/sport/cricket/jofra-archer-england-odi-south-africa-australia-b2269181.html","keywords":["Cricket","Sport"],"creator":["David Charlesworth"],"video_url":null,"description":"The 27-year-old has seen his career railroaded by elbow and back injuries.","content":"Jofra Archer is ready to do the “hard yards” for the twin challenges of the Ashes and World Cup this year but is aware of the expectation he faces ahead of his England return. Archer was England’s pace spearhead in the 2019 50-over World Cup triumph and then took 22 wickets at a dizzying 20.27 in that summer’s Ashes, but his career has been railroaded by elbow and back injuries. Having collected eight wickets in five matches on his competitive comeback in the SA20 this month, Archer is on the verge of a first England appearance since March 2021 in an ODI series against South Africa this week. While a red-ball outing remains some way off for Archer, who says he is now at “about 80 per cent” fitness, he is happy to do whatever it takes to feature for England against Australia this summer. “It is an exciting prospect to think about playing with the guys again, especially with the brand of cricket they are playing, which is very exciting,” Archer said. “I need to spend the next two, three, four months finetuning the body and making myself a bit more resilient. Let me sort that out first then I can look forward to holding the red ball in my hand again. “Overs are overs and you train and bowl until you feel good. Obviously, I might have to do some extra bowling during the weeks when I’m in India (for the Indian Premier League, likely in April and May). “But that is absolutely fine because I want to play in the Ashes, so I’m going to have to do all the hard yards to tick those boxes.” His breakout displays in 2019 mean Archer is held in the utmost regard and the 27-year-old accepted the flip side is there will be a lot of curiosity regarding how he fares in the weeks and months ahead. Red and white-ball captains Ben Stokes and Jos Buttler have attempted to put Archer’s mind at ease, with the fast bowler seemingly set for England’s first ODI of the year in Bloemfontein on Friday which marks the start of the countdown towards the defence of their World Cup title in India in the autumn. “(Ben) said there is no expectation, so did Jos,” Archer said. “It’s nice to hear it, but people will have expectations anyway. Hopefully I can do a half decent job to help the team. “If I don’t do well when I play, a lot of people will be watching. I will be judged again and no one will remember the good stuff I’ve done in SA20. You are only as good as your last game. “This is our first ODI of the year so I’m very glad to be playing from the start and, when we do get to India, hopefully I’ll be there, and everything will seem worth it.” Being part of England’s team environment is important to Archer, who revealed the toughest moments of being sidelined for so long were watching the last two T20 World Cups from thousands of miles away. Archer was sorely missed as England bowed out of the semi-finals in 2021 and he even contemplated flying out to Australia ahead of their successful campaign last November. “The hardest part of watching is not being able to help,” he said. “That was the hardest part. You don’t even have to play, just being there. I almost bought a ticket to Oz.” Archer was originally supposed to play two matches for MI Cape Town in South Africa’s newly-created T20 league but has played three more after England’s two practice matches here were scrapped. His injury struggles in the last couple of years mean he draws comfort from every outing for his franchise, whereupon taking a wicket he has started copying the celebration of Manchester United forward Marcus Rashford by putting a finger to his temple. “I don’t know what it means, but I’ve seen him do it and he’s a pretty nailed-on guy so I can’t imagine it having a bad reason to it,” United fan Archer said. “Every game I play relaxes me a little bit more. In the back of my mind I’m thinking I’m still not out of the waters yet.”","pubDate":"2023-01-25 18:00:06","image_url":"https://static.independent.co.uk/2023/01/25/18/5d1fb06327f49e23bcaac422f04ad926Y29udGVudHNlYXJjaGFwaSwxNjc0NzUxNzE3-2.45229326.jpg?width=1200&auto=webp","source_id":"independentuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Do you recognise this man: John Smit, Shaun Pollock OR … ?","link":"https://www.thesouthafrican.com/news/who-is-this-man-john-smit-shaun-pollock-chris-hipkins-breaking-25-january-2023/","keywords":["News","Proteas","Springboks","Chris Hipkins","Featured","John Smit","New Zealand Prime Minister","Shaun Pollock"],"creator":["Garrin Lambley"],"video_url":null,"description":"Does the man below look familiar? Do you feel you've seen him somewhere before, perhaps on the rugby or cricket field?","content":"Does the man above look familiar? Do you feel you’ve seen him somewhere before, perhaps on the rugby or cricket field? FOR MORE SPORT AND POLITICS NEWS VISIT THE SOUTH AFRICAN WEBSITE Is it former Springbok captain John Smit who played 111 Tests for his country and led the national team to Rugby World Cup victory in 2007 in France? Is it former Proteas all-rounder Shaun Pollock who played 108 Tests, 303 ODIs and 12 T20Is for South Africa, taking a total of 829 wickets? Or is it New Zealand’s new Prime Minister Chris Hipkins who took over as Kiwi leader following Jacinda Ardern’s shock decision to step down last week? Answers on a postcard or an email to info@thesouthafrican.com or a WhatsApp to 060 011 0211 – or leave a comment below. You can also follow @TheSAnews on Twitter and The South African on Facebook .","pubDate":"2023-01-25 17:58:26","image_url":"https://www.thesouthafrican.com/wp-content/themes/jnews-child/assets/images/normal.jpeg.optimal.jpeg","source_id":"thesouthafrican","category":["sports"],"country":["south africa"],"language":"english"},{"title":"[WATCH] Jemimah Rodrigues and Women in Blue sing 'Pehli Nazar Mein' song, enjoy a fun day at the beach","link":"https://www.sportskeeda.com/cricket/news-watch-jemimah-rodrigues-women-blue-sing-pehli-nazar-mein-song-enjoy-fun-day-beach?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Cricket"],"creator":["James Kuanal"],"video_url":null,"description":null,"content":null,"pubDate":"2023-01-25 17:57:11","image_url":"https://static.sportskeeda.com/editor/2023/01/c3f03-16746499198543-1920.jpg","source_id":"sportskeeda","category":["sports"],"country":["india"],"language":"english"},{"title":"3 Indian players whose form will be closely watched during the T20I series vs New Zealand","link":"https://www.sportskeeda.com/cricket/3-indian-players-whose-form-will-closely-watched-t20i-series-vs-new-zealand?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Cricket"],"creator":["Sai Krishna"],"video_url":null,"description":null,"content":null,"pubDate":"2023-01-25 17:38:15","image_url":"https://static.sportskeeda.com/editor/2023/01/5c9c8-16746487454170-1920.jpg","source_id":"sportskeeda","category":["sports"],"country":["india"],"language":"english"},{"title":"Grambusch brothers take Germany to semifinals, Netherlands join them","link":"https://www.orissapost.com/grambusch-brothers-take-germany-to-semifinals-netherlands-join-them/","keywords":["Sports","Germany","hockey","netherlands","world cup"],"creator":["Post News Network"],"video_url":null,"description":"Bhubaneswar: Germany edged out England in penalty shootout under dramatic circumstances after trailing 0-2 two minutes before regulation time to book a berth in the FIH Men’s World Cup semifinals where Netherlands joined them with a win over South Korea here Wednesday. Germany struck in the 58th and 59th minutes through captain Mats Grambusch and […]","content":"Grambusch brothers take Germany to semifinals, Netherlands join them PTI Updated: January 25th, 2023, 23:07 IST in Sports 0 Share on Facebook Share on Twitter Share on WhatsApp Share on Linkedin Bhubaneswar: Germany edged out England in penalty shootout under dramatic circumstances after trailing 0-2 two minutes before regulation time to book a berth in the FIH Men’s World Cup semifinals where Netherlands joined them with a win over South Korea here Wednesday. Germany struck in the 58th and 59th minutes through captain Mats Grambusch and his younger brother Tom to take the quarterfinal match to the penalty shootout where they prevailed over a heart-broken England team 4-3, snatching win from the jaws of defeat. Our guests for today !! Secy Sports, @IndiaSports Ms Sujata Chaturvedi along with Editor, Dharitri Sri @SatpathyLive graced the 3rd quarter Final between @DHB_hockey & @EnglandHockey as pre-match guests and wished both the teams the best. pic.twitter.com/CcWbnUZGV3 — Odisha Sports (@sports_odisha) January 25, 2023 Germany, who had finished second in Pool B and defeated France 5-1 in the crossover match, face three-time champions and last edition bronze medallists Australia in the semifinals Friday. In the second quarterfinal match of the day at the Kalinga Stadium, last two editions runners-up Netherlands ended gritty South Korea’s more-than-expected run in the tournament with a 5-1 win to set up a last-four clash with Belgium Friday. Van Harte Gefeliciteerd @oranjehockey ! #HockeyWorldCup2023 #HWC2023 #HockeyComesHome #HockeyWorldCup #OdishaForHockey #NEDvsKOR pic.twitter.com/qcFlZ3R2bM — Odisha Sports (@sports_odisha) January 25, 2023 South Korea, who had stunned 2016 Rio Olympics champions Argentina in the crossover match on Monday, yet again punched above their weight as they gave a spirited fight to their more fancied opponents, ranked third in the world. South Korea are ranked ninth in the world. South Korea were the only Asian side that remained in the quarterfinals. The vociferous spectators at the Kalinga Stadium thought that England would wrap up the match comfortably after Zachary Wallace (12th) and Liam Ansell (33rd) had given them a 2-0 lead but, to their astonishment, the Germans came back roaring to score goals in the 58th and 59th minutes through Mats and Tom Grambusch respectively. Just before that Christopher Ruhr had wasted a chance from the penalty stroke in the 57th minute. When Germany was training 1-2 and got a penalty stroke with one minute to go in the match, Mats asked his younger brother Tom to take it. Tom made no mistake from the spot to take the match to the penalty shootout. Niklas Wellen, Hannes Muller, Prinz Thies and Christopher Ruhr scored for Germany in the shootout. For England, James Albery, Zachary Wallace, Phil Roper struck while David Goodfield missed. “It was a crazy match for sure, we were behind for most of the match. But we were able to convert the chances that came our way late in the match. It shows the character of the team,” Mats said. “Our parents must be watching this match and they must be extremely happy seeing that we both scored in a crucial match for the team and country,” Tom said. The German fightback was reminiscent of their national football team which is famous for its never-say-die attitude. “It is a cruel game, you were 2-0 up less than five minutes to go in the match and you lost the game,” rued England captain David Ames. England had directly made it to the quarterfinals after topping Pool D ahead of India. They started as the more attacking side and took the lead in the 12th minute after Jack Waller, Stuart Rushemere and Zachary Wallace combined beautifully. Waller cut into the striking circle from the right and Rushemere weaved around three German defenders before Wallace slammed home with a tennis-like volley. Wallace had another go at the German goal but his shot, after dodging past a defender in the second quarter, was blocked by the goalkeeper. Germany pressed in the second quarter with lot more players upfront but England defended well with man-to-man marking. But the relentless German attack resulted to their and the match’s first penalty corner, which they wasted. The Englishman did not give space to the Germans whenever they entered the striking circle. Harry Martin got space and time to take a shot but the goalkeeper was again at the thick of things as he blocked Germany’s second penalty corner two minutes from half time. Trailing 0-1 at half time, Germany let themselves down as Timur Oruz received a green card in the 31st minute for a two-minute suspension, and England pounded on that advantage to earn two back-to-back penalty corners and double their lead from the second one. Liam Ansell made a soft touch of the ball after the stopper put it on his path and then sent a powerful shot which beat the German goalkeeper Alexander Stadler all ends up. Germany were under tremendous pressure in the third quarter as Christopher Ruhr was shown a yellow card in the 38th minute for a five-minute suspension. Just before the end of the third quarter, play was stopped after England’s Liam Sanford fell down on the turf and a few of his team-mates surrounded Ruhr but the umpires were able to calm the players down. Germany got a penalty stroke in the 57th minute but Christopher Ruhr’s shot hit the crossbar. But one minute later, captain Mats Grambusch pulled one back with a field goal. The match ended 2-2 in dramatic fashion and just a few seconds later, Mats’ brother Tom scored from the penalty stroke. With 38 seconds left in the regulation time, Germany earned a penalty corner but England defended it under tense circumstances. In the second quarterfinal match, Koen Bijen (27th and 31st) struck twice while Justen Blok (36th), Steijn van Heijningen (50th) and Teun Beins (58th) scored the other goals for the Netherlands. Inwoo Seo (51st) scored the consolation goal for South Korea. One would have thought that the Netherlands would roll over South Korea. But it was not to be as the small Asian country fought tooth and nail and were not intimidated by the reputation of their opponents. Both South Korea and the Netherlands were goal-less in the first quarter with both sides earning two penalty corners each without utilising any of them. The Netherlands were the dominant side in the second session with more circle penetration and took the lead three minutes from the first half, with Koen Bijen scoring a field goal. The nimble-footed Koreans, however, did not just sit back. They made quick counter-attacks and forced two penalty corners though they could not convert any of them. From the second penalty corner, penalty corner specialist Jang Jonghyun’s drag flick hit German umpire Ben Goentgen on the face after the ball deflected from the stick of a Dutch defender. Goentgen, who fell down in pain before regaining composure, was helped out of the field and reserve umpire, Raghu Prasad of India, took charge for the remainder of the match. The Netherlands took the game out of South Korea’s reach in the third quarter with two goals in the space of five minutes. Bijen got his second goal from a penalty corner in the 31st minute before Justen Blok struck a field goal in the 36th minute. PTI Tags: Germany hockey netherlands world cup Share Tweet Send Share Suggest A Correction Enter your email to get our daily news in your inbox. Leave this field empty if you're human: Related Posts Germany subdues England in penalty shootout, enters Hockey World Cup semifinal January 25, 2023 Suryakumar Yadav named ICC Men’s Cricketer of the Year January 25, 2023 He is India’s No 1 opener, says Irfan Pathan on Shubman Gill’s hundred January 25, 2023 Sania Mirza-Rohan Bopanna sails into Australian Open mixed doubles final January 25, 2023 Rohit Sharma hopeful of Jasprit Bumrah’s availability in last two Tests against Aussies January 25, 2023 Russian athletes should not take part in 2024 Olympics Volodymyr Zelensky January 25, 2023 Leave a Reply Cancel reply Your email address will not be published. Required fields are marked * Comment * Name * Email * Website Save my name, email, and website in this browser for the next time I comment.","pubDate":"2023-01-25 17:37:54","image_url":"https://www.orissapost.com/wp-content/uploads/2023/01/Quaterfinal-match-Hockey-world-cup-_Germany-vs-England..-Germany-win-Shootout-4-3-goal-3-300x186.jpeg","source_id":"orissapost","category":["sports"],"country":["india"],"language":"english"},{"title":"Big Bash League 2022-23 Most Runs and Most Wickets standings: Matthew Short and Sean Abbott lead charts - Updated after Match 56","link":"https://www.sportskeeda.com/cricket/news-big-bash-league-2022-most-runs-most-wickets-standings-matthew-short-sean-abbott-lead-charts-updated-match-56?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Cricket"],"creator":["Sportz Connect"],"video_url":null,"description":null,"content":null,"pubDate":"2023-01-25 17:27:47","image_url":"https://static.sportskeeda.com/editor/2023/01/a84bf-16746479231360-1920.jpg","source_id":"sportskeeda","category":["sports"],"country":["india"],"language":"english"},{"title":"रोहित शर्मा ने जीत के बाद किसके हाथ में थमाई ट्रॉफी, बिना मैच खेले मिला बड़ा सम्मान","link":"https://hindi.news18.com/photogallery/sports/cricket-rohit-sharma-gives-trophy-to-ks-bharat-after-clean-sweep-against-new-zealand-wins-heart-ms-dhoni-traditon-continue-5278941.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"भारतीय टीम ने न्यूजीलैंड के खिलाफ वनडे सीरीज जीतकर 34 साल से चले आ रहे सिलसिले को जारी रखा. भारत दौरे पर कीवी टीम को कभी भी वनडे सीरीज में जीत नहीं मिली और इस बार भी वही हुआ. 3-0 से रोहित शर्मा की कप्तानी में क्लीन स्वीप करने के बाद उन्होंने कुछ ऐसा किया जिसने हर किसी का दिल जीत लिया.","content":"Loading... Loading... Loading... Loading... भारतीय टीम ने रोहित शर्मा की कप्तानी में न्यूजीलैंड का वनडे सीरीज में क्लीन स्वीप किया. पहला मुकाबला भारत ने 12 रन से जीता था जबकि दूसरे मैच में 8 विकेट की एकतरफा जीत दर्ज की थी. तीसरा मुकाबला 90 रन से जीतकर भारत ने 3-0 से सीरीज अपने नाम की.-AP तीसरे वनडे में भारतीय टीम के कप्तान रोहित शर्मा के बल्ले से शानदार शतकीय पारी निकली. साल 2020 के बाद वनडे में यह उनका पहला शतक था. 3 साल से चले आ रहे सूखे को उन्होंने खत्म किया.-AP तीसरे वनडे में भारत ने रोहित शर्मा और शुभमन गिल के शतक के दम पर 9 विकेट के नुकसान पर 385 रन का स्कोर खड़ा किया. न्यूजीलैंड की टीम के लिए डेवोन कॉन्वे ने शतकीय पारी खेली लेकिन टीम 295 रन पर ही ऑलराउट हो गई.-AP सीरीज के पहले दो मैच जीतकर 2-0 की अजेय बढ़त बना चुकी टीम इंडिया ने आखिरी मुकाबला जीता और फिर जो हुआ उसने सबका दिल जीत लिया. कप्तान रोहित शर्मा को जब ट्रॉफी दी गई तो उन्होंने उस खिलाड़ी को उसे थमाया जिसने एक भी मैच नहीं खेला.-AP टीम इंडिया में महेंद्र सिंह धौनी ने अपनी कप्तानी में ये प्रथा शुरू की थी कि जो भी टीम का नया या युवा खिलाड़ी हो उसे सीरीज जीत के बाद ट्रॉफी दी जाए. रोहित ने विकेटकीपर केएस भरत को जीत के बाद ट्रॉफी उठाने का मौका दिया.-AP","pubDate":"2023-01-25 17:24:46","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/01/KS-Bhrat-with-trophy-nz-16746671493x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"WPL Team Name: वुमेंस प्रीमियर लीग की टीमों का नामकरण शुरू, सामने आया अहमदाबाद फ्रेंचाइजी का नाम","link":"https://www.indiatv.in/sports/cricket/women-s-premier-league-ahmedabad-franchise-name-gujarat-giants-adani-sportsline-owns-costliest-team-of-wpl-2023-01-25-925330","keywords":null,"creator":null,"video_url":null,"description":"वुमेंस प्रीमियर लीग की बोली जीतने वाली पांच फ्रेंचाइजीज सामने आ चुकी हैं। हर फ्रेंचाइजी के मालिकों के बारे में भी पता चल चुका है और किस टीम पर कितने पैसे खर्च किए गए इसकी खबर भी आ चुकी है। अब इन टीमों के नामकरण का सिलसिला शुरू हो गया और इस कड़ी में अहमदाबाद फ्रेंचाइजी का नाम सामने आया है।","content":"वुमेंस प्रीमियर लीग (WPL) की टोटल बीडिंग की रकम का खुलासा होने के बाद इसका हिस्सा बनने वाली तमाम फ्रेंचाइजीज भी सामने आ गई। अब WPL के लिए बोली लगाने और जीतने वाली फ्रेंचाइजी के नामकरण के सिलसिले का भी आगाज हो गया है। वुमेंस प्रीमियर लीग में बतौर टीम बोली जीतने वाली पांच टीमों में सबसे महंगी रही अहमदाबाद फ्रेंचाइजी ने इस कड़ी में बाजी मारी है। इस फ्रेंचाइजी की मालिक अडानी स्पोर्ट्सलाइन है। अडानी ग्रुप के स्पोर्ट्स ब्रांच ने इस बारे में बुधवार को ऐलान किया। अहमदाबाद फ्रेंचाइजी को 'गुजरात जायंट्स' नाम से जाना जाएगा। यह वुमेंस प्रीमियर लीग की सबसे महंगी टीम भी है। अहमदाबाद फ्रेंचाइजी को अडानी ग्रुप ने बुधवार को भारतीय क्रिकेट कंट्रोल बोर्ड (बीसीसीआई) द्वारा आयोजित नीलामी में 1289 करोड़ रुपए की उच्चतम बोली के साथ खरीदा। बता दें कि आगामी वुमेंस प्रीमियर लीग में गुजरात जायंट्स क्रिकेट फ्रेंचाइजी की मालिक अडानी स्पोर्ट्सलाइन पहले से अन्य लीग में भी कुछ अन्य टीमों का भी स्वामित्व रखता है। उसके पास यूएई में चल रहे आईएलटी20 में गल्फ जायंट्स और प्रो कबड्डी लीग में गुजरात जायंट्स हैं। अडानी एंटरप्राइजेज के निदेशक प्रणव अडानी ने कहा कि भारतीय महिला क्रिकेट टीम असाधारण रूप से अच्छा प्रदर्शन कर रही है और महिलाओं के लिए क्रिकेट लीग उनके लिए और ज्यादा अवसर पैदा करेगा। उन्होंने कहा, \"क्रिकेट देश में काफी लोकप्रिय है और अडानी स्पोर्ट्सलाइन वुमेंस प्रीमियर लीग के पहले सीजन के साथ अपना जुड़ाव शुरू करने का इच्छुक था। जबकि मैं हर दूसरी फ्रेंचाइजी को शुभकामनाएं देता हूं, मैं 'गुजरात जायंट्स' के साथ खड़े होने की उम्मीद करता हूं। अडानी स्पोर्ट्सलाइन के अलावा इंडियाविन स्पोर्ट्स प्रा लिमिटेड ने 912.99 करोड़ रुपये की बोली के साथ मुंबई फ्रेंचाइजी का अधिग्रहण किया। रॉयल चैलेंजर्स स्पोर्ट्स प्रा लिमिटेड ने 901 करोड़ रुपए में बैंगलोर की फ्रेंचाइजी को अपने नाम किया, जेएसडब्ल्यू जीएमआर क्रिकेट प्रा लिमिटेड 810 करोड़ रुपए में दिल्ली की फ्रेंचाइजी खरीदने में सफल रही और कैपरी ग्लोबल होल्डिंग्स प्रा लिमिटेड ने 757 करोड़ रुपए में लखनऊ की टीम को अपने नाम किया। डब्ल्यूपीएल का पहला सीजन इस साल मार्च में आयोजित किए जाने की संभावना जताई जा रही है। इस लीग की पांच टीमों के लिए खिलाड़ियों की नीलामी अगले महीने फरवरी में हो सकती है। इसके बारे में बीसीसआई ने अब तक कोई आधिकारिक ऐलान नहीं किया है।","pubDate":"2023-01-25 17:00:04","image_url":null,"source_id":"indiatv","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Indian cricket fraternity extends birthday wishes to Cheteshwar Pujara","link":"https://thenewsmill.com/2023/01/indian-cricket-fraternity-extends-birthday-wishes-to-cheteshwar-pujara/","keywords":["Cricket","Sports","ANI"],"creator":["ANI"],"video_url":null,"description":null,"content":"The Indian cricketing fraternity took to social media to extend birthday wishes to the middle-order veteran Cheteshwar Pujara, who turned 35 on Wednesday. The Board of Control for Cricket in India (BCCI) took to Twitter to extend their wishes to the veteran batter. “103 intl. matches 7,065 intl. runs 19 intl. tons Here’s wishing @cheteshwar1 – one of the grittiest modern-day batters – a very happy birthday. #TeamIndia,” tweeted BCCI. Legendary Indian cricketer Sachin Tendulkar also extended wishes to the “rock in India’s batting lineup”. “Not all five fingers are the same. Not every Test batsman needs to be a big hitter. An aggressive batting lineup should also be able to defend well. Pujara, you have been a rock in India’s batting lineup. Stay unique, stay you! Happy birthday,” tweeted Tendulkar. Star Indian batter Virat Kohli also took to Instagram to wish Pujara. “Happy birthday Puji. Have a good one,” said the caption of Virat’s story. Indian opener KL Rahul also took to Instagram and wished his teammate a very happy birthday. “Happy birthday bro, @cheteshwarpujara,” said the caption of Rahul’s story. India’s up-and-coming middle-order star Shreyas Iyer, also took to Instagram to wish Pujara on his birthday, saying on his story, “happy birthday @cheteshwarpujara.” Chennai Super Kings (CSK), Pujara’s IPL team with who he won the title in 2021, also tweeted, “To the man who rises above challenges with indomitable will! Super Birthday, Pujara!” Former Indian World-Cup winning all-rounder Yuvraj Singh also wished Pujara on his birthday via an Instagram story, saying that he is “a champ who teaches the art of patience to the opposition each time he steps on to the park” Pujara has made a name for himself with his solid technique and his defensive batting style that has bailed India out of difficulties on many occasions. His batting style has earned him comparisons with former India batter and current national side head coach Rahul Dravid, also known as ‘The Wall’. In 98 Tests so far, he has scored 7,014 runs at an average of 44.39. Nineteen centuries and 34 half-centuries have come out of his bat in the format with a best of 206*. He is a vital part of Team India which completed the historic Border-Gavaskar Trophy series win against Australia in their home territory in 2018-19 and 2020-21 season. In fact, Pujara top-scored with 521 runs at an average of 74.42, three centuries and a fifty in 2018-19 series, which India won 2-1. Pujara has also represented India in five ODIs, in which he could make only 51 runs at an average of 10.20, with best of 27. He will be seen in action during the Border-Gavaskar Trophy against Australia from February 9 onwards. India will be aiming that this middle-order batter displays his top form and helps his team in defending the trophy. (ANI) This report is filed by ANI news service. TheNewsMill holds no responsibility for this content.","pubDate":"2023-01-25 16:32:02","image_url":null,"source_id":"thenewsmill","category":["sports"],"country":["india"],"language":"english"}]}