{"newsArray":[{"title":"Cricket-England captaincy had become unhealthy, says Root","link":"https://www.thestar.com.my/sport/cricket/2022/06/06/cricket-england-captaincy-had-become-unhealthy-says-root","keywords":null,"creator":null,"video_url":null,"description":"(Reuters) - A relieved Joe Root said the England test captaincy had taken a toll on his personal health after he guided his side to a memorable five-wicket win against New Zealand on Sunday in his first match since relinquishing the role. Read full story","content":null,"pubDate":"2022-06-06 02:58:00","image_url":"https://apicms.thestar.com.my/uploads/images/2022/06/06/1612452.jpg","source_id":"thestar_my","country":["malaysia"],"category":["sports"],"language":"english"},{"title":"Cricket’s massive pay gap isn’t good enough","link":"https://www.cairnspost.com.au/sport/cricket/womens-cricket/cricket-2022-the-shock-pay-gap-between-australias-mens-and-womens-stars-revealed/news-story/a51d1b79214cd1ccf0cd99338363088f","keywords":["Cricket news and galleries","Womens Cricket"],"creator":null,"video_url":null,"description":"The playing contracts for Australian cricket superstars Meg Lanning, Ellyse Perry and Alyssa Healy are worth just 10 per cent of their male counterparts in a sobering reminder of how far there is to go for equity in sport.","content":null,"pubDate":"2022-06-06 01:26:00","image_url":null,"source_id":"cairnspost","country":["australia"],"category":["sports"],"language":"english"},{"title":"Chamari hits ton as Sri Lanka record consolation win","link":"https://www.thenews.com.pk/print/963698-chamari-hits-ton-as-sri-lanka-record-consolation-win","keywords":null,"creator":null,"video_url":null,"description":"KARACHI: Chamari Athapaththu led from the front with an all-round display as Sri Lanka recorded a consolation win when they demolished Pakistan by 93 runs in the third and final game of the ODI series which concluded here at the Southend Club Cricket Stadium on Sunday.Chamari smashed a superb 101...","content":"KARACHI: Chamari Athapaththu led from the front with an all-round display as Sri Lanka recorded a consolation win when they demolished Pakistan by 93 runs in the third and final game of the ODI series which concluded here at the Southend Club Cricket Stadium on Sunday. .ads_between_content{ height:auto; width:auto; clear: both; text-align: center; } .ads_between_content .story_ads{ } /*@media (max-width:600px){ .ads_between_content{ float:none; margin:0px auto; text-align: center; } }*/ Chamari smashed a superb 101 to enable Sri Lanka to post 260-7. Chamari then took 2-20 in six overs to help the visitors fold the hosts for 167 in 41.4 overs. Chamari decided to bat first after winning the toss under hot conditions. After losing two early wickets for just four on the board, Chamari took charge and played with a sort of aggression which was a treat to watch. She managed strokes with ease against every bowler and smacked Diana Baig for three successive fours. Chamari completed her sixth ODI century off 82 balls. Her fifty had come off 50 deliveries. She struck 13 fours and one six in her massive 85-ball knock. She added 152 runs for the third wicket record stand with Hershitha Madavi who struck 75 off 128 balls which carried three fours. This is the highest partnership of Sri Lanka women for any wicket in ODI cricket. After losing the duo, Kavisha Dilhari (28) and Nilakshi de Silva (24*) took Sri Lanka to a decent total. Kavisha, who had an impressive series as an all-rounder, struck two fours from 44 balls. Nilakshi clobbered two fours in her unbeaten 18-ball knock. Pacer Fatima Sana (2-51) and left-arm spinner Anam Amin (2-43) were the successful bowlers for Pakistan. In response, Pakistan were at one stage 48-4 in the 12th over. Omaima Sohail (40) and Aliya Riaz (56) at this stage tried to revive the innings and shared 64 runs for the fifth wicket stand. Sugandika Kumari broke the partnership when she had Omaima, who attempted a reverse sweep but only dragged the ball onto her stumps. Omaima struck four fours from 61 balls. After her fall, wickets fell sharply and the whole team was folded well behind the target. Aliya, who was held in the deep by Oshadi off de Silva, struck four fours in her 82-ball effort. Earlier, Sidra Amin (19) and Muneeba Ali (16) provided a 41-run solid start to Pakistan. Sidra was unlucky to be given lbw off Chamari when she dragged the ball onto her pads. In the next over, Muneeba was run out by Chamari before Oshadi bowled skipper Bismah Maroof (0) to leave Pakistan reeling at 43-3. Chamari piled up misery on the hosts when she had experienced Nida Dar (5) to break the back of the hosts. Oshadi (2-29) and Chamari (2-20) bowled well. With the outcome Pakistan sealed the ODI series 2-1 to finish with four ICC Women Championship points. Sri Lanka, with the victory, got two vital points. Chamari was adjudged the player of the match while Sidra Amin got the player of the series award for her aggregate score of 218. \"Finally I scored some runs,\" Chamari said after the match. \"The win was needed as our India tour is two weeks away. India is a tough side but if we play positive game we can win the series,\" Chamari said. Pakistan captain Bismah Maroof praised Sri Lanka. \"It was their day. They played extremely well in all departments,\" she said.","pubDate":"2022-06-06 01:00:00","image_url":null,"source_id":"thenews","country":["pakistan"],"category":["sports"],"language":"english"},{"title":"SMIU sports gala ends","link":"https://www.thenews.com.pk/print/963702-smiu-sports-gala-ends","keywords":null,"creator":null,"video_url":null,"description":"KARACHI: The sports gala 2022 organised by Sindh Madressatul Islam University's sports department concluded here on Sunday.The competitions were conducted for both men and women in cricket, table tennis, badminton, throwball and futsal. Chairman Sindh Higher Education Commission Professor Dr Tariq...","content":"KARACHI: The sports gala 2022 organised by Sindh Madressatul Islam University's sports department concluded here on Sunday. .ads_between_content{ height:auto; width:auto; clear: both; text-align: center; } .ads_between_content .story_ads{ } /*@media (max-width:600px){ .ads_between_content{ float:none; margin:0px auto; text-align: center; } }*/ The competitions were conducted for both men and women in cricket, table tennis, badminton, throwball and futsal. Chairman Sindh Higher Education Commission Professor Dr Tariq Rafi graced the closing ceremony. He encouraged the winners and runners-up and congratulated the sports department of the university for organizing such healthy activities.","pubDate":"2022-06-06 01:00:00","image_url":null,"source_id":"thenews","country":["pakistan"],"category":["sports"],"language":"english"},{"title":"Cricket hero’s freak act goes viral","link":"https://www.cairnspost.com.au/sport/cricket/mr-dependable-joe-root-joins-10000run-club-as-freak-act-goes-viral/news-story/e2d7a7110fff9f74e0b10dca15cf923c","keywords":["Cricket news and galleries","Kayo","Sport news and galleries"],"creator":null,"video_url":null,"description":"Joe Root’s 26th Test century has guided England to a five-wicket victory over New Zealand at Lord’s, with the former skipper scoring an unbeaten 115 on day four of the series opener.","content":null,"pubDate":"2022-06-06 00:15:00","image_url":null,"source_id":"cairnspost","country":["australia"],"category":["sports"],"language":"english"},{"title":"Aussie women lose another cricket coach","link":"https://www.perthnow.com.au/sport/cricket/aussie-women-lose-another-cricket-coach-c-7064351","keywords":null,"creator":["Scott Bailey"],"video_url":null,"description":"Australia's highly-regarded women's assistant Ben Sawyer has taken up the top job with New Zealand, leaving Shelley Nitschke favourite to replace Matthew Mott.","content":"Overseas raids on Australia's women's cricket coaches have continued with assistant Ben Sawyer to take up the top job with New Zealand. Sawyer was confirmed as New Zealand's new women's coach on Monday, after three years serving as Australia's bowling coach. The news comes just weeks after Australia's former head coach Matthew Mott moved on, taking charge of England's men in white-ball cricket. It leaves Shelley Nitschke as a near certainty to replace Mott on a full-time basis. Nitschke was appointed as interim coach last month following Mott's exit, and players along with Mott himself had backed her or Sawyer to claim the full-time job. She was also handed her new assistants on Monday, with Dan Marsh and Jude Coleman appointed ahead of a Tri-series in Ireland and the Commonwealth Games. Meanwhile Sawyer's exit is a blow to Australian cricket. He had been a long-time coach of the Sydney Sixers' WBBL team, and therefore had a close relationship with the likes of Ellyse Perry, Alyssa Healy and Ashleigh Gardner. Perry in particular had regularly leaned on Sawyer as her bowling coach at both domestic and international level. \"Ben has been a brilliant resource for the side's emerging and experienced fast-bowlers and the work he's done with this exceptionally talented group of players should be acknowledged,\" Cricket Australia's head of performance Ben Oliver said. \"He's highly respected and so it comes as no surprise that New Zealand have identified Ben as an asset to their program. \"We understand Ben accepting this opportunity and wish him and his family all the best.\"","pubDate":"2022-06-05 23:42:16","image_url":"https://images.perthnow.com.au/publication/C-7064351/aac5ebe26a040411ab0d3692a5da6fc4bf6aa34f-16x9-x0y0w1280h720.jpg","source_id":"perthnow","country":["australia"],"category":["sports"],"language":"english"},{"title":"\"Just insane. Salute forever\" - Tendulkar to Sehwag, Indian cricket fraternity hails Rafael Nadal after 'King of Clay' wins 14th French Open title","link":"https://www.sportskeeda.com/cricket/news-indian-cricket-fraternity-hails-rafael-nadal-king-clay-wins-14th-french-open-title?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Cricket"],"creator":["Renin Wilben Albert"],"video_url":null,"description":null,"content":"Tennis legend Rafael Nadal reiterated his status as the \"King of Clay,\" winning the French Open title for the 14th time on Sunday. The 36-year-old Spaniard defeated Casper Ruud , the first Norwegian to reach a Grand Slam singles final, in straight sets (6-3, 6-3, 6-0). With his latest victory at Roland Garros, achieved in 2 hours and 18 minutes, Nadal became the oldest man to win a French Open title. He broke the record held by Andres Gimeno (also from Spain), who was 34 years and 305 days old when he captured Roland Garros in 1972. Nadal's terrific win on Sunday was his 22nd Grand Slam title, extending his lead over Roger Federer and Novak Djokovic, who have 20 Grand Slams each. The Indian cricketing fraternity was in awe of the Spaniard after he lifted yet another French Open crown. Here are some Twitter reactions: Story continues below ad Story continues below ad Story continues below ad Apart from the Indian cricketers, Pakistan all-rounder Shoaib Malik and former South African batter AB de Villiers also congratulated the Nadal on his fantastic achievement. Story continues below ad Story continues below ad Reacting after capturing his 14th French Open title, Nadal asserted that he will keep fighting to keep going. The 36-year-old has been suffering from a chronic left foot problem. Earlier this week, he conceded that he wasn't sure over how long he could continue. Speaking after yet another memorable win at Roland Garros, the Spaniard said: Expressing gratitude to everyone who has helped him deal with injury issues over the years, he added: Story continues below ad Nadal added about his French Open triumph on Sunday: Nadal won his maiden French Open crown back in 2005, defeating Argentina’s Mariano Puerta 6–7(6–8), 6–3, 6–1, 7–5. Q. 0 votes so far","pubDate":"2022-06-05 19:32:11","image_url":"https://static.sportskeeda.com/editor/2022/06/cbb01-16544529626722-1920.jpg","source_id":"sportskeeda","country":["india"],"category":["sports"],"language":"english"},{"title":"\"I am not given any chance by the board to tell anything\" - Tamim Iqbal on his future in T20I cricket","link":"https://www.sportskeeda.com/cricket/news-i-given-chance-board-tell-anything-tamim-iqbal-future-t20i-cricket?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Cricket"],"creator":["Gokul Nair"],"video_url":null,"description":null,"content":"Bangladesh opening batter Tamim Iqbal has opened up about his future in the shortest format with the national team. The 33-year-old last played a T20I fixture against Zimbabwe at the Sher-e-Bangla stadium on March 9, 2020. The veteran even pulled himself out of the 2021 T20 World Cup to ensure a fair chance for the batters who played in his absence. A long-standing knee injury forced him to miss several of Bangladesh's fixtures in the buildup to the tournament. Back then, the opener had made it clear that he was not retiring from T20Is but he is yet to make an appearance in the format since. Stating that he has not been given a fair chance to voice his opinion concerning his career in T20 cricket, Iqbal told reporters during a private function in Dhaka on Sunday: Story continues below ad He added: However, Bangladesh Cricket Board (BCB) cricket operations chairman Jalal Yunus' had earlier stated that they had staged talks with the batter. Jalal told reporters that the board have asked the senior player to return in time for the 2022 T20 World Cup, and are currently awaiting a response. In the absence of Iqbal, the Bangladesh think-tank has experimented with the likes of Mohammed Naim, Munim Shahriar, Najmul Hossain and Saif Hassan in the opening slots. Story continues below ad With youth stacked at the top of the order, which arguably suits the long-term plan, team batting coach Jamie Siddons had implied that Iqbal would be a perfect fit for the No.4 position in the batting order. Strongly refuting the suggestion of him batting in the middle-order, Iqbal said: The veteran has played an active role in each of Bangladesh's last two series. However, his involvement in the shortest format is yet to be decided until the friction between the player and the board has ceased. Q. 0 votes so far","pubDate":"2022-06-05 19:32:11","image_url":"https://static.sportskeeda.com/editor/2022/06/01615-16544539404036-1920.jpg","source_id":"sportskeeda","country":["india"],"category":["sports"],"language":"english"},{"title":"Joe Root scores 10000 runs in Test cricket: England win","link":"https://thenewsglory.com/joe-root-scores-10000-runs-in-test-cricket-england-win/","keywords":["Sports","England","Joe Root","New Zealand","Test cricket"],"creator":["The News Glory"],"video_url":null,"description":"London: Former England captain Joe Root has surpassed 10,000 runs in Test cricket. He also helped the Centurion team to victory in the match against New Zealand. Joe Root, 31, has been playing for England since 2012. He has played a total of 118 Test matches so far and has amassed 10,015 runs. This includes […]","content":"London: Former England captain Joe Root has surpassed 10,000 runs in Test cricket. He also helped the Centurion team to victory in the match against New Zealand. Joe Root, 31, has been playing for England since 2012. He has played a total of 118 Test matches so far and has amassed 10,015 runs. This includes 26 per cent and 53 half-cents. He became the second batsman to score 10,000 runs in Test cricket for England. Many international cricketers have praised his milestone. Root is the 14th player to score 10,000 runs in Test cricket. He reached this at a very young age (31 years 157 days). He has thus shattered Sachin’s record. Tendulkar set the record in Test cricket in 31 years and 326 days. The New Zealand team is touring England for a three-match Test series. The first match of the series was played at Lord’s Cricket Ground. Rudd scored a century in the second inning of the match to help his team win. It was then that he set this record in Test cricket. .","pubDate":"2022-06-05 18:50:24","image_url":null,"source_id":"thenewsglory","country":["india"],"category":["sports"],"language":"english"},{"title":"Ranji Trophy 2021-22: Mumbai begin heavy favourites in quarter-finals; UP bank on IPL stars","link":"https://www.firstpost.com/firstcricket/sports-news/ranji-trophy-2021-22-mumbai-begin-heavy-favourites-in-quarter-finals-up-bank-on-ipl-stars-10762561.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"Ranji Trophy 2021-22: Mumbai begin heavy favourites in quarter-finals; UP bank on IPL stars","content":"The knockout stage of the 2022 Ranji Trophy is almost upon us, with quarter-finals taking place simultaneously at various venues across the state of Karnataka starting Monday.The premier domestic competition in Indian cricket returns to action this week after a two-month hiatus during which the 15th edition of the Indian Premier League took place.The Ranji Trophy would normally take place during the course of the Indian home season in winter — starting December and concluding in March.While the Ranji Trophy had shelved last year due to the coronavirus pandemic, it returned to action in February this year with the BCCI opting to divide it into two phases.The final round of group matches concluded on 6 March while the pre-quarter-final to determine the eighth quarter-finalist took place between 12 to 16 March with Jharkhand holding Nagaland to a high-scoring draw and qualifying for the next stage.The quarter-finals take place over the course of the next five days, with the semi-finals then taking place starting 14 June. The final will be played at Bengaluru’s iconic M Chinnaswamy Stadium later this month between 22 to 26 June.Read: Teams, squads, fixtures, match timings and all you need to know about knockoutsWith defending champions Saurashtra having bowed out already after finishing second in Elite Group D behind Mumbai, the trophy is set for a change of hands this year.Before the games get underway on Monday morning, here’s a quick look at the four matches taking place:QF1: Bengal vs Jharkhand at Just Cricket Academy, BengaluruBengal are the only team so far to have won all three games in the group stage, having hammered Chandigarh by 152 runs in their last outing after posting wins over Baroda and Hyderabad.They will be missing out on wicketkeeper-batter Wriddhiman Saha’s services in the knockouts, with the latter stating he is “not willing” to represent his native state following differences with Cricket Association of Bengal.They start favourites against Jharkhand, a side that posted scores of 880 and 417/6 in the pre-quarter-final against Nagaland and ended up posting a lead worth 1,008 runs — the highest-ever in First-Class cricket.QF2: Mumbai vs Uttarakhand at KSCA Cricket (2) Ground, AlurMumbai will be hoping to add a 42nd title to their overcrowded cabinet, having last won the premier competition back in 2016. Led by India opener Prithvi Shaw, the powerhouses of Indian cricket will start solid favourites against Uttarakhand.Mumbai were held to a draw by Saurashtra in Ahmedabad and since then, it was a rat race between the two sides for the qualifier spot, which the side ultimately clinched with an innings and 109-run win over Odisha.Uttarakhand, on the other end, are coming off an eight-wicket loss against Andhra in their final group game, and will hope to shake that defeat off and start afresh come Monday. They are led by Jay Bista, who will be squaring off against his former side.QF3: Karnataka vs Uttar Pradesh at KSCA Cricket Ground, AlurThe most successful side in the Ranji Trophy after Mumbai with eight titles to their name, Karnataka too have been without a title for quite some time now, having not won the prestigious tournament since back-to-back titles in 2014 and 2015.They will be led by Punjab Kings captain Mayank Agarwal and also boast of other top names such as Manish Pandey, Devdutt Padikkal and Karun Nair. A key name missing out though is seamer Prasidh Krishna, who will be part of the upcoming T20I series against South Africa.They’re up against Uttar Pradesh, a side stacked with players who shone in the recent IPL — from KKR’s Rinku Singh to Yash Dayal and Mohsin Khan, who had a fantastic run for IPL debutants GT and LSG respectively.QF4: Punjab vs Madhya Pradesh at KSCA Cricket (3) Ground, AlurElite Group F toppers Punjab will be missing out on left-arm seamer Arshdeep Singh’s services given Singh, much like Karnataka’s Krishna, will be busy in the South Africa series. Punjab started off with a draw against Himachal Pradesh, but managed to scrape through in the end after convincing victories over neighbours Haryana and Tripura.They’re up against Madhya Pradesh, coached by the iconic Chandrakant Pandit — who had coached Vidarbha to back-to-back titles towards the fag end of the previous decade and also masterminded the last of Mumbai’s 41 titles in the 2015-16 season.Among the key players to watch out for in the MP squad is one Rajat Patidar, who has had a stellar run for the Royal Challengers Bangalore, especially in the playoffs.Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-06-05 18:27:42","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2020/08/Ranji-Trophy-Image-640-BCCI.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"FIFA World Cup 2022 Qualifiers: Wales book ticket to Qatar with 1-0 win over Ukraine in playoff final","link":"https://www.firstpost.com/sports/fifa-world-cup-2022-playoffs-wales-beat-ukraine-1-0-to-qualify-for-first-time-in-64-years-10762641.html","keywords":["Sports"],"creator":["Sonam Chauhan"],"video_url":null,"description":"FIFA World Cup 2022 Qualifiers: Wales book ticket to Qatar with 1-0 win over Ukraine in playoff final","content":"Cardiff: Gareth Bale led Wales to their first World Cup since 1958 as Ukraine's dreams of lifting the spirits of a war-torn country were cruelly denied by a 1-0 defeat in Cardiff on Sunday.Bale's free-kick, which was turned into his own net by Ukrainian captain Andriy Yarmolenko, separated the sides despite the visitors dominating the game in sodden conditions at the Cardiff City Stadium.Ukraine made a nation proud in beating Scotland 3-1 on Wednesday in their first competitive clash since Russia's invasion.Oleksandr Petrakov's men deserved much more from another exceptionally composed performance under the strain of carrying the hopes of a people devastated by Russian aggression.The Ukrainian national anthem was applauded by all sides of the stadium before the game and, just as on their trip to Scotland in midweek, the visitors were inspired rather than inhibited by the pressure put upon them.However, they were made to pay an exceptionally heavy price for not taking their chances and one moment of misfortune.Oleksandr Zinchenko did find the net after just three minutes, but the Manchester City man was deemed to have taken his free-kick that caught Wayne Hennessey off guard too quickly.Hennessey then had to be alert to prevent Roman Yaremchuk opening the scoring before Viktor Tsygankov sliced a glorious chance wide.Wales had barely threatened the Ukrainian goal, but in Bale have a star capable of changing the course of matches in an instant.The 32-year-old is without a club having brought down the curtain on nine years at Real Madrid by picking up a fifth Champions League winner's medal last weekend.Bale has reserved his best for international duty in recent years and will now get the chance to add a World Cup to a glorious career.His free-kick on 34 minutes was headed off target until Yarmolenko tried to head it to safety and only succeeded in deflecting the ball past the helpless Georgiy Bushchan.Ukraine refused to be crushed by that misfortune and were unlucky not to be given a penalty before half-time when Yarmolenko was clipped by Joe Allen inside the box.The pattern continued into the second half as Rob Page's men were pinned back inside their own half.But the home side did have big chances of their own to double their advantage on the counter-attack when Aaron Ramsey steered wide, Brennan Johnson hit the post and Bale shot meekly into the arms of Bushchan.At the other end, chances continued to come and go as Tsygkanov's effort was saved by Hennessey before Yaremchuk put the rebound wide.A last-ditch challenge from Ben Davies then prevented Yarmolenko the shot at redemption.Ukraine's day was summed up five minutes from time when Hennessey produced an incredible save to prevent substitute Artem Dovbyk's header finding the top corner.But Wales are now unbeaten in 19 home games stretching back nearly four years for a reason as they were roared home by the majority of the 33,000 crowd.The last time Wales were at a World Cup they were eliminated by a goal for Brazil by 17-year-old Pele in the quarter-finals.This generation of Welsh players achieved the seemingly impossible by getting to the semi-finals of Euro 2016 in their first major tournament for 58 years.Now they have written themselves into the history books once more when they get the chance to face England, USA and Iran in Qatar come November.Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-06-05 18:22:21","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/06/Wales640.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Karnataka vs Uttar Pradesh Ranji Trophy 2022 live quarterfinal: When and where to watch Ranji Trophy 2022 quarterfinal matches?","link":"https://thesportsrush.com/cricket-news-karnataka-vs-uttar-pradesh-ranji-trophy-2022-live-quarterfinal-when-and-where-to-watch-ranji-trophy-2022-quarterfinal-matches/","keywords":["Cricket","Ranji Trophy 2021-22"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Karnataka vs Uttar Pradesh Ranji Trophy 2022 live quarterfinal: The two sides would lock horns at the KSCA Cricket Ground in Alur. After an action-packed 15th season of the Indian Premier League (IPL), the BCCI’s premier longest format domestic tournament – the Ranji Trophy 2021-22 would commence with its second/knock-out phase from June 6 onwards,… The post Karnataka vs Uttar Pradesh Ranji Trophy 2022 live quarterfinal: When and where to watch Ranji Trophy 2022 quarterfinal matches? appeared first on The SportsRush.","content":"Karnataka vs Uttar Pradesh Ranji Trophy 2022 live quarterfinal: The two sides would lock horns at the KSCA Cricket Ground in Alur. After an action-packed 15th season of the Indian Premier League (IPL), the BCCI’s premier longest format domestic tournament – the Ranji Trophy 2021-22 would commence with its second/knock-out phase from June 6 onwards, with the quarter-final fixtures across Bengaluru. After the seven teams – Bengal, Karnataka, Madhya Pradesh, Mumbai, Punjab, Uttar Pradesh, and Uttarakhand made it through by topping their respective groups, Jharkhand became the eighth team to advance forward, courtesy of a huge victory against the Plate group toppers Nagaland in the pre-quarter-final. The four winners of today’s quarter-final fixtures would advance through to the semi-finals, set to take place from June 14-18, followed by the grand finale from June 22-26 at the M Chinnaswamy Stadium, in Bengaluru. Karnataka vs Uttar Pradesh Ranji Trophy 2022 live quarterfinal As far as the fixtures are concerned, favourites Bengal would face Jharkhand in quarter-final 1; Prithvi Shaw-led Mumbai would lock horns against Uttarakhand in quarter-final 2; Karnataka would be up against Uttar Pradesh in quarter-final 3, while Punjab would take on Madhya Pradesh in quarter-final 4. He started late but made his way to the top in no time The story of Royston Dias in his own words where he talks about his life along with Mumbai’s #RanjiTrophy Quarter-final against Uttarakhand #mca #Mumbai #Cricket #IndianCricket #Wankhede #BCCI #RanjiTrophy2022 pic.twitter.com/UwMYqFhjQy — Mumbai Cricket Association (MCA) (@MumbaiCricAssoc) June 5, 2022 As far the live streaming/telecast for the aforementioned quarter-final fixtures are concerned, only the quarter-final 3 fixture between Karnataka and Uttar Pradesh would be telecast on the Star Sports network from 09:30 am onwards today. The rest of the three matches would be live streamed on Star’s OTT platform Disney+Hotstar. When and where to watch Ranji Trophy 2022 quarterfinal matches? Date – 06/06/2022- 10/06/2022. Match start Time – 09:30 am onwards Quarter-final ‘1’ – Bengal vs. Jharkhand (Just Cricket Academy Ground, Bengaluru) on Disney+Hotstar Quarter-final ‘2’ – Mumbai vs. Uttarakhand (KSCA Cricket (2) Ground, Alur) on Disney+Hotstar Quarter-final ‘3’ – Karnataka vs. Uttar Pradesh (KSCA Cricket Ground, Alur) on Star Sports 1/Disney+Hotstar Quarter-final ‘4‘ – Punjab vs. Madhya Pradesh (KSCA Cricket (3) Ground, Alur) on Disney+Hotstar. The post Karnataka vs Uttar Pradesh Ranji Trophy 2022 live quarterfinal: When and where to watch Ranji Trophy 2022 quarterfinal matches? appeared first on The SportsRush.","pubDate":"2022-06-05 17:09:40","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Joe Root wins Test for England having been left to do what he does best | Andy Bull","link":"https://www.theguardian.com/sport/blog/2022/jun/05/joe-root-flourishes-doing-what-he-does-best-for-england","keywords":["England v New Zealand 2022","Joe Root","England cricket team","New Zealand cricket team","Cricket","Sport"],"creator":["Andy Bull at Lord’s"],"video_url":null,"description":"The former captain can now concentrate on his batting and he produced the most enjoyable of his 26 centuries for EnglandThe rain was hard enough to wake the sleeping on Sunday morning, and it was easy to imagine the players were up early to check the weather. It looked a good day for bowling – damp, dark and overcast, as if the English summer had got lost somewhere in the west after sunset the previous evening and was still trying to find its way back around to the ground. Tim Southee and Trent Boult, who have played a lot of cricket here in the past 14 years, knew that conditions don’t get much better for men in their line of business. “They were as good as you could hope for,” Kane Williamson said later.Mornings always feel a little foreboding for English batsmen these days given the way the team have been playing, but this one was especially ominous. Usually Joe Root would have been up suffering with worry about it. He says he had found it increasingly hard to sleep in the last few months of his captaincy, the cares he had gone to bed with the previous evening burst back in on him as soon as he was awake again – bowling changes, field placings, form, fitness, media commitments. He says it had become an “unhealthy relationship”, that it was affecting his fitness and dragging him, and his family, down. Continue reading...","content":"T he rain was hard enough to wake the sleeping on Sunday morning, and it was easy to imagine the players were up early to check the weather. It looked a good day for bowling – damp, dark and overcast, as if the English summer had got lost somewhere in the west after sunset the previous evening and was still trying to find its way back around to the ground. Tim Southee and Trent Boult, who have played a lot of cricket here in the past 14 years, knew that conditions don’t get much better for men in their line of business. “They were as good as you could hope for,” Kane Williamson said later. Mornings always feel a little foreboding for English batsmen these days given the way the team have been playing, but this one was especially ominous. Usually Joe Root would have been up suffering with worry about it. He says he had found it increasingly hard to sleep in the last few months of his captaincy, the cares he had gone to bed with the previous evening burst back in on him as soon as he was awake again – bowling changes, field placings, form, fitness, media commitments. He says it had become an “unhealthy relationship” , that it was affecting his fitness and dragging him, and his family, down. Root happy to focus on scoring runs after ‘unhealthy’ time as captain Read more “I think I was unaware of how much it was grabbing a hold of me, as soon as I made the decision to step down I knew it was the right thing to do. I felt like a big weight had been lifted. As hard as it was, I immediately felt a lot better.” From now on, Root doesn’t have to think about any of it. On this Sunday morning he had only one thing to worry about, the one thing that has always come easiest to him. His own batting. After three days, there was perhaps an hour left in the match. England needed 61 to win and, while they had five wickets in hand, their batting is so thin and brittle that New Zealand really only needed to take one of them, Root’s, and the match would swing back their way. All they needed was one more good ball, or one more bad shot. In the end, they didn’t get either. Root played so well, with such authority, that he made the game an anticlimax. England won so quickly that New Zealand didn’t even get to use the new ball they were waiting for, and the MCC ended up having to pay out a full refund to everyone who had come. Joe Root scores the runs to bring up his century and to get to 10,000 Test runs. Photograph: Stu Forster/Getty Images Pick, pack, pock, puck, a single here, two there, the odd four in between it all, a sweep, a drive, a nudge off his hips. At one point he cursed himself for picking out a fielder. He expects better of himself. Root has scored a lot of centuries for England, 26 altogether, and nine in the past two years. The unbeaten 115 he made here ended up as one of his very best. He had settled the innings when he came in on Saturday evening, took just 40 runs off his first 100 balls, then accelerated again after Ben Stokes had got out and took 37 off his next 41 while Ben Foakes held steady at the other end. That left Root 77 not out overnight, 23 runs away from his century, and 23 runs away, too, from reaching 10,000 runs in Test cricket. He is the second Englishman to get there, after Alastair Cook, but he wasn’t really thinking about the achievement. Joe Root hits century as England seal win over New Zealand in first Test Read more “Winning was all I could think about,” he said. “It’s been a long time for this team.” Nine months and eight days, to be exact, a run of nine Tests spread over three series in England, Australia and the West Indies. You guess he would happily give away some of those runs in exchange for a few more wins. It is not as if he couldn’t afford it. Root is only 31, he could go on and on, up to Cook’s final tally of 12,472 Test runs and beyond. Root pursued his lips when he was asked how highly he rated this century. He said it felt like one of the best he had ever played, but he is batting so very well that he is acutely aware of even the tiniest mistakes, so he dwelled on the one imperfection, when he cut the ball past his own stumps on 92. “I rode my luck a little bit.” They say the best Persian carpets always contain a deliberate mistake in the pattern just to prove they were made by someone mortal. That one false shot of his felt similar. The Spin: sign up and get our weekly cricket email. Root did say that it was perhaps the most enjoyable of his 26 centuries. He is obviously relishing this “next phase of his career”. Stokes is one of his best friends in the game, and he was genuinely delighted to be able to begin to pay him back for all the many occasions when he had dug his England team out of whatever hole they were in. “It’s my turn,” he said, “my turn, and that’s a great motivator for me, when I think about the amount of amazing things Ben has done for this team under my leadership, it’s a great opportunity for me to do just that for him. I’m not sure I’ll be able to do some of the things he’s done, but I’ll try.”","pubDate":"2022-06-05 16:52:03","image_url":"https://i.guim.co.uk/img/media/1ac9e456d25491778531ba08b00284e155711af3/0_35_4168_2502/master/4168.jpg?width=460&quality=85&auto=format&fit=max&s=4e3de25162df7e0230e676e21bb5b797","source_id":"theguardian","country":["united kingdom","india","singapore","canada"],"category":["sports"],"language":"english"},{"title":"French Open 2022: Rafael Nadal becomes oldest Roland Garros champion, other stats","link":"https://www.firstpost.com/sports/french-open-2022-rafael-nadal-becomes-oldest-roland-garros-champion-other-stats-10762481.html","keywords":["Sports"],"creator":["FP Sports"],"video_url":null,"description":"French Open 2022: Rafael Nadal becomes oldest Roland Garros champion, other stats","content":"Paris: Rafael Nadal beat Casper Ruud 6-3, 6-3, 6-0 in the French Open final for his 14th championship at Roland Garros and 22nd Grand Slam title overall, adding to two records he already owned.Nadal won the last 11 games after trailing 3-1 in the second set.Nadal’s victory Sunday came two days after his 36th birthday and made him the oldest title winner in the history of the clay-court tournament.The Spaniard’s first triumph here came in 2005 at age 19. No man or woman ever has won the singles trophy at any major event more than his 14 in Paris.And no man has won more Grand Slam titles than Nadal.He now is two ahead of rivals Roger Federer, who hasn’t played in almost a year after a series of knee operations, and Novak Djokovic, who missed the Australian Open in January because he is not vaccinated against COVID-19 and lost to Nadal at Roland Garros.More stats after Nadal's historic win in Paris on Sunday:# Nadal passed fellow Spaniard Andres Gimeno as the oldest Roland Garros men’s singles champion in history. Gimeno set the record 50 years ago# Nadal is 14-0 with the Coupe des Mousquetaires on the line. His 14 Roland Garros titles are the most won by any man at a single Grand Slam event in history, followed by Novak Djokovic’s nine at the Australian Open and Roger Federer’s eight at WimbledonBy the Numbers: @RafaelNadal at #RolandGarros 2,184-1,116 in games (.662) 335-34 in sets (.908) 112-3 in matches (.974) 90 straight-set wins 74 of 74 opponents defeated 39-match win streak ('10-15) 38-set win streak ('16-18) 24 sets won & 0 sets lost 6-0 7-1 on birthday (3 June)— ATP Media Info (@ATPMediaInfo) June 5, 2022# Nadal has swept the Australian Open and Roland Garros in the same year for the first time and equal his lowest ranking as a Grand Slam champion. He was also No. 5 at 2005 Roland Garros and the 2022 Australian OpenMOST SINGLES TITLES Jimmy Connors, 109 Roger Federer, 103 Ivan Lendl, 94 Rafael Nadal, 92 Novak Djokovic, 87— José Morgado (@josemorgado) June 5, 2022# Nadal is the third player to earn four Top-10 wins at a Grand Slam event since the ATP Rankings began in 1973 (also Mats Wilander at 1982 Roland Garros, Federer at 2017 Australian Open)Overall sets lost during @RafaelNadal's 14 title runs @rolandgarros 0 -- 2008, 2010, 2017, 2020 1 -- 2007, 2012, 2018 2 -- 2014, 2019 3 -- 2005, 2006, 2011, 2022 4 -- 2013— ATP Media Info (@ATPMediaInfo) June 5, 2022# Nadal's stats at Roland Garros: 14 titles, 112-3 win-loss record, 90 of 112 matches won in straight sets, 24 bagels (6-0) handed outWith French Open title, Rafael Nadal moves into the second position in all-time career earnings:1. Novak Djokovic, $156,543,9332. Rafael Nadal, $130,695,7723. Roger Federer, $130,594,339— Darren Rovell (@darrenrovell) June 5, 2022# Nadal won his maiden French Open (2005), 2011 and now 2022 all on 5 June# Nadal has now won the most clay court titles among men (63) ahead of Guillermo Vilas, Thomas Muster(with inputs from The Associated Press)Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-06-05 16:43:12","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/06/Nadal-RG-2022-AP-640.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"“It had become a very unhealthy relationship”: Joe Root reveals why he quit as England Test captain post smashing match-winning century vs New Zealand at Lord’s","link":"https://thesportsrush.com/cricket-news-it-had-become-a-very-unhealthy-relationship-joe-root-reveals-why-he-quit-as-england-test-captain-post-smashing-match-winning-century-vs-new-zealand-at-lords/","keywords":["Cricket","England","Joe Root","New Zealand","New Zealand tour of England","New Zealand tour of England 2022"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Joe Root reveals why he quit as England Test captain post smashing his 26th Test ton, at the Lord’s versus New Zealand. Continuing his purple patch of form in the Test format, especially since 2021, former England skipper Joe Root (115) smashed his 26th Test Century, to guide his team to a 5-wicket victory against… The post “It had become a very unhealthy relationship”: Joe Root reveals why he quit as England Test captain post smashing match-winning century vs New Zealand at Lord’s appeared first on The SportsRush.","content":"Joe Root reveals why he quit as England Test captain post smashing his 26th Test ton, at the Lord’s versus New Zealand. Continuing his purple patch of form in the Test format, especially since 2021, former England skipper Joe Root (115) smashed his 26th Test Century, to guide his team to a 5-wicket victory against New Zealand on ‘Day 4’ of the first Test match at the iconic Lord’s Cricket Ground. The century moment also added quite some feathers in Root’s cap, as he went on to become only the 14th batter to complete 10,000 runs in the Test format, and also the joint-youngest to arrive at the landmark moment. 📝 🙌 ❤️ 🏴󠁧󠁢󠁥󠁮󠁧󠁿 #ENGvNZ 🇳🇿 | @root66 pic.twitter.com/L0WBr58JDs — England Cricket (@englandcricket) June 5, 2022 The win has meant that the England side under the new captain-coach duo of Ben Stokes and Brendon McCullum have begun their journey on the best possible note, with the team winning their first Test after nine matches. Root, who made way for Stokes as the leader of the side, opened up post his match-winning knock, on the ‘unhealthy relationship’ he had with his captaincy in the past few months, and how it took a toll on his mental health. Post bagging his ‘Player of the Match’ award for a sublime knock under pressure in the fourth innings, Joe Root, for the first time opened up on his decision to relinquish the England Test captaincy post. The 31-year-old revealed that the relationship between him and his captaincy had become ‘unhealthy’, as it had taken a severe toll on his mental health. “It had become a very unhealthy relationship to be honest, the captaincy and me. It started to really take a bad toll on my own personal health. I couldn’t leave it at the ground anymore, it was coming home. It wasn’t fair on my family, on people close to me and it wasn’t fair on myself either,” remarked Root. “I had thrown everything at it and I was determined to help turn this team around but I realised over that time at home that it would have to be in a different way,” he further added. It is worth of a mention that Root had managed to secure just a solitary win in his last 17 Tests as England captain, which included a 0-4 Ashes drubbing earlier this year. Moreover, he also lost the Test series against the Windies 0-1 post Ashes, after almost the entire England coaching staff was stripped off from their respective posts due to intense criticism from the English fans and experts.","pubDate":"2022-06-05 16:10:08","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"French Open 2022 Men's Final Highlights: Rafael Nadal wins 14th Roland Garros title and 22nd major","link":"https://www.firstpost.com/sports/french-open-2022-mens-final-highlights-rafael-nadal-wins-14th-roland-garros-title-and-22nd-major-10760791.html","keywords":["Sports"],"creator":["FP Sports"],"video_url":null,"description":"French Open 2022 Men's Final Highlights: Rafael Nadal wins 14th Roland Garros title and 22nd major","content":"21:42 (IST)Roland Garros 2022 championsMen's singles: Rafael NadalWomen's singles: Iga SwiatekMen's doubles: Marcelo Arevalo/Jean-Julien RojerWomen's doubles: Kristina Mladenovic/Caroline GarciaMixed doubles: Ena Shibahara/Wesley Koolhof21:34 (IST)Rafa post trophy ceremonySpeaking to NBC’s Maria Taylor: “I would love to keep coming but we need to find a solution for the feet because I can’t keep going like this” 21:34 (IST)The thing we all wanted to hear!🗣️ \"I don't know what can happen in the future, but I'm going to keep fighting to try to keep going\" @RafaelNadal ❤️💪📹#RolandGarrospic.twitter.com/5Psh2mrXwi— ITF (@ITFTennis) June 5, 202221:31 (IST)👑Two Kings of Spain 😁#RolandGarros pic.twitter.com/W0VqQZAw2J— Roland-Garros (@rolandgarros) June 5, 202221:24 (IST)Rafael Nadal: \"Thank you very much! First of all, it's been a pleasure to play the final with you (Ruud). Congratulations on these two weeks. I'm very happy for you, your team and your family. Wish you all the luck for the future.\"\"My team, my family, who is there. It's completely amazing the things that are happening this year. Thank you for all we've done this year and over the years. All through the years with injuries. Nothing like this would be possible without your support. I would have retired much before!\"\"Thank you everyone who made this event possible. For me this tournament is best in the world. All the ball kids, volunteers, tournament directors, you are doing amazing. You make me feel like home. Just thank you to you all and French Federation\"\"For me personally, very difficult to describe the feelings. It's something that I've never believed. At 36, competitive, playing in most important court of my career, in a final. To try to keep going. Thank you to everyone in Paris! For me it's incredible to play here, for all the support. It's wonderful, thank you so much.\"\"I don't know what will happen in the future but I'll keep going, I'll keep fighting\"21:17 (IST)Casper Ruud: \"This is the first time for me! I want to congratulate Rafa. It's your 14th time here, 22nd at Slams. We all know what a champion you are. Today I got to play you in a final here. But I'm not the first victim! To you Rafa, your team, your academy for taking me into open arms. From me, my family, we hope you continue for some more time. To my team, it's been a long road. It is a road impossible without all your help. Hope we can continue this journey for more years, more finals and more Grand Slams. Thank you very much. To the city of Paris, supporters, it has been unbelievable. To see full stadiums is inspiring, you've been nice to me for whole two weeks so thank you. It gives me motivation to come back and hope next year I can speak some French. To the organisers, thank you for all the help. Thank you for the last three weeks. Merci!\"21:16 (IST)BJK with the trophy presentationForever a legend, @BillieJeanKing 👋#RolandGarros pic.twitter.com/4u1CsvsOx4— Roland-Garros (@rolandgarros) June 5, 202221:10 (IST)How Nadal got the job done!King of Clay x 14 👑@RafaelNadal remains undefeated in Paris finals, conquering Casper Ruud 6-3, 6-3, 6-0 for a 14th title#RolandGarros pic.twitter.com/GctcC17Ah8— Roland-Garros (@rolandgarros) June 5, 202221:07 (IST)Rafael Nadal is the French Open championRAFAEL NADAL IS THE FRENCH OPEN CHAMPION FOR A 14th TIME! He beats Casper Ruud 6-3, 6-3, 6-0 for his 22nd Grand Slam title and becomes the oldest champion at Roland GarrosUpdated record:Champion: 2005, 2006, 2007, 2008, 2010, 2011, 2012, 2013, 2014, 2017, 2018, 2019, 2020, 2022Win-loss: 112-321:01 (IST)Nadal 6-3, 6-3, 6-0 Ruud (* denotes next server)Ruud has lost the last 10 games and is now serving to avoid a bagel. Starts off by sending his forehand long and it is 0-15. Followed by a Nadal backhand winner down the line after pushing Ruud to the other corner. A 35th winner for Rafa. Nadal almost making it 0-40 after picking up a drop shot and almost getting a backhand smash back. Nadal with a backhand cross court winner and it brings up two championship points. One saved! Nadal's return on the serve is a mishit and it goes wide. The victory is sealed with a winner! Nadal is the French Open champion!20:51 (IST)Nadal* 6-3, 6-3, 4-0 Ruud (* denotes next server)Make that nine games in a row for Nadal. Ruud is broken at love after sending a volley right into the net. This is getting away from Ruud and rather quickly!20:50 (IST)Ruud may not be walking away with the winner's trophy today but he has played arguably the shot of the match👀🔥@CasperRuud98 | #RolandGarros pic.twitter.com/07yi2zgwbl— Live Tennis (@livetennis) June 5, 202220:50 (IST)6-3, 6-3, 3-0 to NadalRafael Nadal is motoring towards a 14th French Open title! He wins an eighth consecutive game to lead 6-3, 6-3, 3-0Ruud has won just 14 points in the last 8 games#RolandGarros Live: https://t.co/Jd1yEGjLBF pic.twitter.com/hiKzdccKyl— Firstpost Sports (@FirstpostSports) June 5, 202220:44 (IST)Just 24 days ago, Nadal could barely play without wincingI still can't believe this was just 24 days ago pic.twitter.com/LCJMPAbzHS— Bastien Fachan (@BastienFachan) June 5, 202220:41 (IST)Nadal* 6-3, 6-3, 2-0 Ruud (* denotes next server)Ruud's backhand hits the top of the net and the ball sits up perfectly for Nadal to run along and hit a forehand winner to bring up a break point at 30-40. BREAK! Nadal pounces, takes the backhand early and slaps a cross court winner with Ruud beaten20:33 (IST)Nadal after going two sets to love upAfter going up 2 sets to 0, Rafael Nadal is:- 12-0 in major finals (8-0 at French Open)- 33-0 in major semifinals/finals- 91-0 at the French Open- 236-2 at all majors pic.twitter.com/Imp98Sxpjb— ESPN Stats & Info (@ESPNStatsInfo) June 5, 202220:30 (IST)Just when you think you have Rafael Nadal beat...Nowhere on the court is safe 💪#RolandGarros | @RafaelNadal pic.twitter.com/jqClIqFn12— Roland-Garros (@rolandgarros) June 5, 202220:29 (IST)Set 2 in numbers20:28 (IST)Second set: Rafael Nadal 6-3Rafael Nadal takes five straight games to win the second set 6-3 over Casper Ruud and he is two sets to love up. Ruud handing the set with a double fault on fourth set point opportunityStat: Nadal when leading two sets to love: 256-3 and 90-0 at Roland Garros20:25 (IST)Nadal* 6-3, 6-3 Ruud (* denotes next server)Ruud serving to stay in this set. Nadal has the court gaping, plenty of time to place a short ball but does too much with the angle and it is 15-0. With a high ball at the net, Nadal deflects the backhand volley for a winner to make it 15-15. Nadal and Ruud going side-to-side before Casper's herculean effort to chase things down sees the ball go long. With the sun shining, Nadal has found his range so so well now. A forehand winner brings up two set points. The serve return goes long and that's one set point saved. Once again! Ruud swings and the Nadal slice backhand is into the gallery. Ruud's serve down the T is returned deep and he is required to play two more balls and misses a forehand to bring up a third set point for Rafa. Saved! Ruud and Nadal using plenty of wrist to find angles, to go cross, go deep and eventually Rafa errs. Ruud looks to go behind Nadal but the direction isn't right and it allows Rafa to hit a forehand winner to bring up a fourth set point. SECOND SET NADAL! A double fault from Ruud hands Nadal the second set20:16 (IST)Nadal 6-3, 5-3 *Ruud (* denotes next server)Nadal with a forehand into the corner after a big serve and Ruud's running shot is well long. The Spaniard holds to love with an ace down the T. 20:13 (IST)Nadal* 6-3, 4-3 Ruud (* denotes next server)Nadal rocks into his forehand and slaps a cross court winner with plenty of spin to it and it brings up a break point. BREAK! Nadal runs along to pick up a drop shot and the ball is at Ruud's feet. The Norwegian player plays a half-volley but it goes marginally long. The chair umpire confirms it is long and Nadal wins a third game in a row20:04 (IST)Reminiscent of the semi-final where Nadal saved four sets points in the first set tiebreak. But boy was that so, so much better!pic.twitter.com/1TKhJxQiHa— doublefault28 (@doublefault28) June 5, 202220:01 (IST)Nadal* 6-3, 2-3 Ruud (* denotes next server)Now Ruud has his serve put under pressure. At 30-30, he goes for a huge forehand but misses by a good margin. Break point for Nadal. BREAK BACK! Nadal with big celebrations as Ruud's sliding, defensive forehand goes wide. The Spaniard forcing Ruud into playing some defensive tennis and he's rewarded with a break19:58 (IST)Wow! What a run!Rafael Nadal has won 26 consecutive tour-level finals in which he's won the opening set. The last time he lost a tour final after winning the first set was 2014 in Rome against Novak Djokovic. pic.twitter.com/zb9bcUsLje— ESPN Stats & Info (@ESPNStatsInfo) June 5, 202219:55 (IST)Nadal 6-3, 1-3 *Ruud (* denotes next server)Nadal has his serve under the pump after missing a half volley to see it become 0-30. Ruud with perfect tennis - finding the angles, going cross court and then a sliding slice backhand that goes over the top part of the net and Nadal's shot is into the net. 0-40 and three break points. Double fault! Third double fault of the match from Nadal and Ruud BREAKS at love!19:52 (IST)Nadal* 6-3, 1-2 Ruud (* denotes next server)Nadal not coverting a solitary break point he had in the first game of the second set. Since then, it has been comfortable for both players to keep the second set on servepic.twitter.com/YdsuAyxtME— doublefault28 (@doublefault28) June 5, 202219:48 (IST)Celebrity watchCelebrities in attendance: 🇪🇸 King Felipe VI, 🇳🇴Crown Prince Haakon, Crown Princess Mette-Marit, actors Michael Douglas, Hugh Grant, Sienna Miller, former tennis players Billie Jean King, Edberg, Kuerten, Stan Smith, footballers Lewandowski, VerrattiLive: https://t.co/Jd1yEGjLBF pic.twitter.com/3HIkiZmtBD— Firstpost Sports (@FirstpostSports) June 5, 202219:37 (IST)First set in numbers19:36 (IST)First set: Rafael Nadal 6-3Rafael Nadal wins the opening set 6-3 over Casper Ruud and he is two sets away from a 14th French Open title. Nadal is 11-3 in first set of French Open finals. After three straight breaks in the opening stages, both players remain on serve for the rest.19:32 (IST)Nadal 6-3 *Ruud (* denotes next server)Rafa serving for the first set. Nadal with an error on 15-0 and then Ruud with a cruncher on the forehand for a down the line winner. 15-30. Nadal serve out wide and the Ruud return goes well long to make it 30-30. Another helpful serve, another return goes wide. Nadal with another angled first serve and the return almost takes out chair umpire James Keothavong. First set to Rafael Nadal!19:27 (IST)Nadal* 5-3 Ruud (* denotes next server)Casper Ruud serving to stay in the first set. Nadal, Ruud trade blows from the back before Rafa moves up to close the point out with a perfect volley. Up next, Ruud does the same. Eventually a comfortable hold for Ruud and puts the onus on Rafa to serve the first set out19:19 (IST)French Open sets attendance recordTotal attendance for this year's French Open, with the night sessions, was 613,500, according to FFT president Gilles Moretton.  Still far from the US Open record figure of 737,000 from 2019.19:16 (IST)Nadal* 4-2 Ruud (* denotes next server)Ruud starts off the sixth game exceptionally. Plays a delicate drop shot that is well disguised and perfectly hit to disallow Nadal from even bothering to chase it down. Nadal with a backhand into the tramlines and Ruud holds serve for the first time in the final19:12 (IST)Nadal 4-1 *Ruud (* denotes next server)The streak of breaks ends with Nadal holding serve by dropping just one point. He moved along to 40-0 before Ruud found the line and then hit a winner. But Nadal closes it out by forcing Ruud into a mistake19:07 (IST)Nadal* 3-1 Ruud (* denotes next server)Rafael Nadal BREAKS! Third break in the first four games of the final and this has been a very inconsistent start from both players. Neither finding their range, neither getting much on their shots. Is it because of the fact they know each other well having played on a practice court often? Anyway, a Ruud miss is into the net and Nadal has the two-game cushion back19:05 (IST)Celebrities in attendanceActor Michael Douglas, Sienna Miller, Hugh Grant, former tennis champions Stefan Edberg, Stan Smith, Gustavo Kuerten, footballers Robert Lewandowski, Marco Verratti18:59 (IST)Nadal 2-1 *Ruud (* denotes next server)Ruud breaks Nadal back straight away and the first set is back on serve. After breaking Ruud's serve, Nadal throws the advantage away with a shaky game. He serves two double faults and a tame forehand is into the net18:57 (IST)King in attendance for King on courtKing of Spain watching the King of Clay. pic.twitter.com/Wq7P3vUsX9— José Morgado (@josemorgado) June 5, 202218:51 (IST)Nadal 1-0 *Ruud (* denotes next server)Rafael Nadal gets the final underway. And he drops just one point to get himself on the board. Touch of nerves even when he's won this 13 times18:40 (IST)Chair umpire does the player intros and every year I'm amazed at how there is nothing better in tennis than hearing a countdown of Nadal's French Open titles18:37 (IST)It's go time!One more time...#RolandGarros | @RafaelNadal pic.twitter.com/eJdC0RG86k— Roland-Garros (@rolandgarros) June 5, 202218:28 (IST)What Casper Ruud is afterRuud, 23, is the first Scandinavian man in a Grand Slam final since Robin Soderling at 2010 Roland Garros. He would be the youngest Grand Slam men’s champion since Juan Martin del Potro, 20, at the 2009 US Open18:25 (IST)Preview: Nadal aiming to become oldest champion against young apprentice RuudRafael Nadal will become the oldest Roland Garros champion if he beats Casper Ruud, a player he has indirectly nurtured, in the final on Sunday. The Spaniard will take the court for the 14th time in a French Open final, where he is 13-0, and Ruud for only the first. [Read more]18:23 (IST)Former South Africa international cricketer AB de Villiers chimes in on the upcoming finalJust watched the most special tribute to Rafa Nadal on Supersport and realised all over again how special the man is. Also found out that Casper Ruud attended his academy and faces the master in the final today. Incredible! So, how good is Rafa’s academy then?😂— AB de Villiers (@ABdeVilliers17) June 5, 202218:21 (IST)10 minutes to go!It's almost go time ⏰ @RafaelNadal 🆚 @CasperRuud98 @rolandgarros | #RolandGarros pic.twitter.com/OWuA2oPffW— ATP Tour (@atptour) June 5, 202218:11 (IST)What is Nadal after?If Nadal wins today, he:- becomes the oldest RG men's champion in history- wins RG and AO in the same year for the first time- extends his record for most GS titles won at a single event to 14- extends his record for most GS titles won to 22— The Tennis Podcast (@TennisPodcast) June 5, 202218:07 (IST)Nadal in practice earlier today@RafaelNadal ha fet un breu entrenament per agafar sensacions de raqueta i pilota.La pista encara estava descoberta. La pilota baixava be. Apurant al màxim els 45min d’entrenament. pic.twitter.com/U2kXQ0TB0N— Marc Capó Aguiló (@MarcCapo) June 5, 202218:04 (IST)All those years back....Rafael Nadal’s game face the first time he stepped on Court Philippe Chatrier for a French Open final, 17 years ago today. pic.twitter.com/bWkEw98YXX— Nick Zaccardi (@nzaccardi) June 5, 202218:04 (IST)Casper Ruud on France TV: “I‘m going to pretend that it‘s just another practice with Rafa“French Open 2022 Men's Final Live: Rafael Nadal and Casper Ruud will play each other in the French Open men's final. Nadal seeks his 14th title at Roland Garros and 22nd Grand Slam trophy overall. Both would add to records he already owns. At 36, Nadal would be the oldest champion in French Open history.Ruud is 23 and appearing in his first major final, the first man from Norway to get that far in singles at any Grand Slam tournament. The two have never met in an official match but have played many practice sets against each other at Nadal's tennis academy in Mallorca because Ruud has been training there for a few years. Ruud considers Nadal his idol and recalls watching the Spaniard's past French Open finals on TV.Earlier, Iga Swiatek defeated American teenager Coco Gauff 6-1, 6-3 to clinch her second French Open title in three years on Saturday. Swiatek has now won 35 consecutive matches, equalling the longest unbeaten streak since Venus Williams in 2000.When will the French Open 2022 men's singles final match commence?Rafael Nadal and Casper Ruud will clash at 6.30 pm IST to clinch the French Open 2022 men's singles title.Where will the French Open 2022 men's singles final match be played?The French Open 2022 men's singles final will be played today (5 June) at the Philippe Chatrier Court, Stade Roland Garros in Paris.Where can you watch the French Open 2022 men's singles final match?The French Open 2022 men’s singles final match will be telecast live on Sony TEN 2, Sony TEN 3, Sony SIX and Sony TEN 4. Live streaming will also be available on the Sony LIV app. You can also follow the match live on our blog at firstpost.com.(With AP inputs)Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-06-05 16:09:51","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/06/Nadal-vs-Ruud-AP-640.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"England vs New Zealand: Joe Root enters elite club with match-winning ton at Lord's","link":"https://www.firstpost.com/firstcricket/sports-news/england-vs-new-zealand-joe-root-enters-elite-club-with-match-winning-ton-at-lords-10762071.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"England vs New Zealand: Joe Root enters elite club with match-winning ton at Lord's","content":"Joe Root entered an elite club in cricket on Sunday, becoming only the second Englishman after Alastair Cook to cross the 10,000-run barrier in the five-day format.The former England captain achieved the milestone en route to an unbeaten 115, which setup a memorable five-wicket victory for England in the first Test against New Zealand that gave a 1-0 lead in the three-match series.Root, who recently relinquished English Test captaincy to all-rounder Ben Stokes following a poor run of results, was back at his best with the bat as he brought up his 26th Test century, holding England's chase together after New Zealand rattled their top order to reduce them to 69/4 at one stage.Root shared vital partnerships with Stokes (54) and wicketkeeper-batter Ben Foakes (32 not out) — worth 90 and 120 respectively as the hosts reached home rather comfortably, in contrast to the tricky position they found themselves in on Saturday afternoon.Read: 'A mad, mad win', Twitter goes wild as Root seals memorable win for hosts at Lord'sOnly 14 batters have scored 10,000 runs or more in Test cricket, with Indian legend Sunil Gavaskar being the first to cross this milestone and ultimately finishing with 10,125 runs to his name. Sachin Tendulkar currently is the all-time leading run-scorer with 15,921 runs to his name in 200 Test appearances at an average of 53.78.Cook remains the all-time leading leading run-scorer among England batters, having collected 12,472 runs in 161 Tests at an average of 45.35.Incidentally, both Cook and Root were 31 years and 157 days of age when they achieved the milestone.Here are some of the reactions to Root's knock on Twitter: Ten thousand test runs is a great accomplishment. Modern great. #JoeRoot— Harsha Bhogle (@bhogleharsha) June 5, 2022 ROOOOOOOOOOT!! A very special innings from a very special cricketer #ENGvNZ pic.twitter.com/FW3CUTtocV — England Cricket (@englandcricket) June 5, 2022  Through all the trials and tribulations of the #Ashes Joe Root never lost his smile in Australia but it’s so good to see him smiling and laughing with England on the cusp of a famous win. Captain or not, good times or not, he’s stayed the same. Maybe his greatest legacy #ENGvNZ— Bharat Sundaresan (@beastieboy07) June 5, 2022 Cook completed 10,000 runs at 31 years, 157 days. Root completed 10,000 runs at 31 years, 157 days. — Johns. (@CricCrazyJohns) June 5, 2022 Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram","pubDate":"2022-06-05 15:20:11","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/06/Joe-Root-hundred-Lords-ENG-NZ-AP-640.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"'I couldn't leave it in the car or at the cricket ground' – Root happy to release England captaincy shackles","link":"https://uk.sports.yahoo.com/news/couldnt-leave-car-cricket-ground-150702160.html?src=rss","keywords":null,"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2022-06-05 15:07:02","image_url":null,"source_id":"yahoo","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Ranji Trophy: Formidable Bengal to battle capricious Jharkhand for a place in the semis","link":"https://sportstar.thehindu.com/cricket/domestic/ranji-trophy-2022-bengal-jharkhand-quarterfinals-domestic-cricket/article38500679.ece","keywords":null,"creator":["Dhruva Prasad"],"video_url":null,"description":"Bengal will go in with at least three fast bowlers in a likely seamer-friendly surface at the Just Cricket Academy Ground.","content":"It will be a battle between teams of contrasting fortunes when a high-flying Bengal takes on a resolute Jharkhand in the first quarterfinal of the Ranji Trophy here at the Just Cricket Academy Ground on Monday. While 2019-20 finalist Bengal emerged unscathed from Group B in the league stage with three outright wins, Jharkhand overcame a shock defeat against Chhattisgarh before stunning heavyweights Delhi and Tamil Nadu in close encounters to top Group H. Jharkhand proceeded to toy with Plate Group topper Nagaland in the pre-quarterfinal, amassing 880 in the first innings and ending the match with a 1008-run lead – the highest-ever in first-class cricket. ALSO READ - Uttar Pradesh to face Karnataka's might in quarterfinals The premier domestic red-ball tournament returns after a two-month frenzy of the Indian Premier League (IPL) and Bengal’s Shahbaz Ahmed will look to replicate the match-winning cameos he played for Royal Challengers Bangalore. His unbeaten 71 led Bengal’s chase of 350 against Baroda – its highest-ever in the Ranji Trophy – and he followed it up with 91 runs and four wickets in a 72-run win against Hyderabad. Both Bengal and Jharkhand have struggled with the bat but their bowlers have more than compensated for it. The pace trio of Ishan Porel, Akash Deep and Mukesh Kumar have picked a combined 39 wickets at an average of 20.74. ALSO READ - Ranji Trophy: Mumbai resumes quest for silverware “We'll go in with three pacers definitely, the choice we'll have to make tomorrow is about a fourth pacer or a spinner,” Bengal coach Arun Lal said ahead of the match. “There's a lot of bounce, there's some grass, the ball deviates off the seam,” he added. Jharkhand has relied more on spin, with Shahbaz Nadeem picking 18 wickets in four matches, including a match-winning ten-fer against Delhi. Bengal captain Abhimanyu Easwaran and his counterpart Saurabh Tiwary found form late in the league stage and will hope to build on it. While Easwaran struck 114 in Bengal’s win over Chandigarh in its last league game, Tiwary took Jharkhand over the line with scores of 58 and 93 against Tamil Nadu. After opting out of the league stage, Wriddhiman Saha has made himself unavailable for the knockouts and Abishek Porel is likely to continue being the first-choice keeper. National duty keeps Mohammed Shami out of Bengal’s squad.","pubDate":"2022-06-05 15:01:28","image_url":null,"source_id":"sportstar","country":["india"],"category":["sports"],"language":"english"},{"title":"England vs New Zealand: New era, same Joe Root as Stokes and Co script winning start to home season","link":"https://www.firstpost.com/firstcricket/sports-news/england-vs-new-zealand-new-era-same-joe-root-as-stokes-and-co-script-winning-start-to-home-season-10762081.html","keywords":["First Cricket News"],"creator":["Charles Reynolds"],"video_url":null,"description":"England vs New Zealand: New era, same Joe Root as Stokes and Co script winning start to home season","content":"New coach, new captain, new era – same Joe Root. For all that England will be enthused by the former, it is the latter which will prove most reassuring to their fans and which has ensured their summer is off to a winning start.It has been a long time since this side has tasted Test match victory, nine games, 281 days, whole fruitless tours of Australia and the Caribbean in the rear view mirror – but among those months of doom and gloom, and in fact going back even further than that, there has been one constant – Root.Since the start of the series against India last summer he now has six centuries in 13 Tests, while he has nine since the start of 2021, including two magnificent double hundreds. How much worse would things have been for England without Root? The English language might not yet be sufficiently evolved to adequately describe the horrors of that particular scenario, however what is certain is that without him they would not have even come close to victory here in the thrilling series opener at Lord’s.He came to the crease on Saturday afternoon as he so often does, England three wickets down with less than 50 runs on the board, the living embodiment of the “Ah s**t, here we go again” meme – England 231 runs short of their target against New Zealand’s bowling Cerberus of Boult, Southee and Jamieson, and with at least half of the remaining batsmen to come comfortably Test match number 11s.England have leant so heavily on Root in recent years it is fairly incredible he remains the same ebullient character, somehow undimmed by the strain and responsibility heaped on him as captain and chief, sometimes seemingly only, run-scorer. Staring down the barrel of a defeat that would have been equal parts disheartening and embarrassing having bowled New Zealand out for 132 on the first day, he once again came to England’s rescue with a magnificent, match-winning century.Saturday had seen Root, first with Stokes and then with Foakes, put England on the path to victory. When they arrived on Day Four they needed 61 more to win with five wickets remaining – simple enough on paper, far more complicated in reality, especially factoring in the aforementioned strength of New Zealand’s bowlers and the length of England’s tail, not to mention throwing in the heavily overcast conditions for good measure.Root though proved undaunted and in the end New Zealand weren’t given even a sliver of hope, as first a 26th Test hundred – remarkably his first in the fourth innings – and then victory by five wickets were knocked off, and much to the delight of the crowd, seven balls inside the 15 over cutoff that ensured they all got a full refund on their tickets.Root’s hundredth run of the innings was also his 10,000 in Test cricket, making him only the 14th man in history to reach the milestone, and extraordinarily the equal – to the day – youngest along with Alastair Cook.In his first Test freed from the shackles of captaincy, Root did what he has done for so much of his career – thrived – this time all the sweeter for carrying England to victory. Now back in the ranks he still has much of his career to come, names like Lara, Dravid, Ponting and Tendulkar to chase down in the all-time run-scorers list and more Tests to win for England, and when he plays like this long may that continue.Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram ","pubDate":"2022-06-05 15:00:04","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/06/Joe-Root-century-640_AP.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"“What a player, what a man”: Twitter reactions on Joe Root becoming the 14th player to complete 10000 runs in Test match history","link":"https://thesportsrush.com/cricket-news-what-a-player-what-a-man-twitter-reactions-on-joe-root-becoming-the-14th-player-to-complete-10000-runs-in-test-match-history/","keywords":["Cricket","England","Joe Root","New Zealand tour of England 2022"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Twitter reactions on Joe Root joining the list of batters to complete 10,000 in Tests, while guiding his team to victory as well at Lord’s. On ‘Day 4’ of the first Test match between England and New Zealand at the Lord’s Cricket Ground, a Joe Root master class with the bat, coupled with some excellent… The post “What a player, what a man”: Twitter reactions on Joe Root becoming the 14th player to complete 10000 runs in Test match history appeared first on The SportsRush.","content":"Twitter reactions on Joe Root joining the list of batters to complete 10,000 in Tests, while guiding his team to victory as well at Lord’s. On ‘Day 4’ of the first Test match between England and New Zealand at the Lord’s Cricket Ground, a Joe Root master class with the bat, coupled with some excellent pace bowling earlier, has helped England secure a 5-wicket victory, to go 1-0 up in the three-match series. While the English pacers played a significant role in restricting the New Zealand second innings lead to mere 276, the player to have hogged all the limelight was their former skipper Joe Root, who brought up his 26th Test match ton and completed 10,000 runs in the format simultaneously, on the same delivery. Along with becoming only the 14th Test batter in the rich Cricketing history to make it to the rare elite list, Root also became the joint-youngest to reach the feat. Moreover, he became the first batter in Test history to reach the milestone number in less than 10 years, having made his debut in the year 2012. 100 and 10,000 happened to Joe Root at the same time. This was obvious, given that √10000=100. — Abhishek Mukherjee (@ovshake42) June 5, 2022 Joe Root, the great crowd pleaser that he is, has secured victory quickly enough that 4th day ticket holders will receive a full refund. — George Dobell (@GeorgeDobell1) June 5, 2022 Ten thousand test runs is a great accomplishment. Modern great. #JoeRoot — Harsha Bhogle (@bhogleharsha) June 5, 2022 Cracking start for @benstokes38 . Life after Joe Root begins with a win inspired by Joe Root. — Gary Lineker 💙💛 (@GaryLineker) June 5, 2022 Joe Root is the first batter in Test history to reach 10,000 runs milestone in less than 10 years. #EngvNZ — Mazher Arshad (@MazherArshad) June 5, 2022 Amazing to think this was Joe Root’s first 4th innings ton. Second Englishman to cross 10000 Test runs and equal youngest ever with Sir Alistair Cook at 31yrs and 157 days. Job done for England – well played 👏👏 #ENGvsNZ — Isa Guha (@isaguha) June 5, 2022 Outstanding and so deserving for Joe Root.His home conditions are probably the toughest place to bat in the world. He does well in the subcontinent. He is superb in white ball as well. Need to celebrate Root a lot more. What a player!! #ENGvsNZ — Gaurav Sundararaman (@gaurav_sundar) June 5, 2022 Through all the trials and tribulations of the #Ashes Joe Root never lost his smile in Australia but it’s so good to see him smiling and laughing with England on the cusp of a famous win. Captain or not, good times or not, he’s stayed the same. Maybe his greatest legacy #ENGvNZ — Bharat Sundaresan (@beastieboy07) June 5, 2022 Joe Root has 10,000 Test runs. And he’s just 31 🤯 Well played and congratulations @root66 👏🏽 #ENGvNZ pic.twitter.com/l5dDL5v7Iz — Wasim Jaffer (@WasimJaffer14) June 5, 2022 Century in the fourth innings from Joe Root, which should win @ECB_cricket the Test, and 10,000 Test runs – he has to be the best Test batsman at the moment. #JoeRoot — Rahul Rawat (@rawatrahul9) June 5, 2022 First few matches after losing captaincy are always awkward. But Joe Root showed one doesn’t need to be a captain to be a leader. This 100 was important for him, Stokes, McCullum and England cricket. Congratulations on 10000 test runs @root66 — Mohammad Kaif (@MohammadKaif) June 5, 2022 Considering the state of the game, the quality of the New Zealand attack, the conditions, the expectation…this must rank as one of the greatest centuries for England. It may be a new era of English cricket…but the protagonist remains the same. The astounding Joe Root #ENGvsNZ pic.twitter.com/YV3LP8OfpC — Aatif Nawaz (@AatifNawaz) June 5, 2022 Joe Root could very well be the leading run getter in Test cricket by the time he retires! — Sarang Bhalerao (@bhaleraosarang) June 5, 2022 “What a player, what a man” ⏤ Ben Stokes on Joe Root. #ENGvNZ pic.twitter.com/H50djL0gvv — The Cricketer (@TheCricketerMag) June 5, 2022 Joe Roooooooot ..what a player what a knock under pressure ..an all time great .. @bcci @icc — Sourav Ganguly (@SGanguly99) June 5, 2022 For more Cricket-related news, click here.","pubDate":"2022-06-05 14:54:44","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"ENG vs NZ: Root’s ton powers England to victory","link":"https://telanganatoday.com/eng-vs-nz-roots-ton-powers-england-to-victory","keywords":["Cricket","News","Sport","England","Joe Root","New Zealand","Tim Southee"],"creator":["IANS"],"video_url":null,"description":"London: Joe Root finished unbeaten on 115 and also crossed the 10,000-run mark in the longest format of the game as England wrapped a five-wicket victory over New Zealand on day four of the opening Test at Lord’s on Sunday. With Ben Foakes (32 not out) playing an important role from the other end, Root […]","content":"London: Joe Root finished unbeaten on 115 and also crossed the 10,000-run mark in the longest format of the game as England wrapped a five-wicket victory over New Zealand on day four of the opening Test at Lord’s on Sunday. With Ben Foakes (32 not out) playing an important role from the other end, Root helped England knock off the remaining 61 runs to take a 1-0 lead in the three-match series. The victory also marked the winning start of Ben Stokes-Brendon McCullum era as captain-head coach in Test cricket for England. With a flick through leg-side for a brace against Tim Southee, Root completed his 26th Test hundred and also crossed the 10,000 Test runs milestone, becoming only the 14th cricketer and just the second Englishman after Sir Alastair Cook to achieve the landmark. At 31 years, five months and five days, Root has reached 10,000 Test runs landmark at exactly the same age as Cook – making the English pair the joint-youngest players to reach the milestone. Other batters to reach the milestone include Sachin Tendulkar, Ricky Ponting, Jacques Kallis, Rahul Dravid, Kumar Sangakkara, Brian Lara, Shivnarine Chanderpaul, Mahela Jayawardene, Allan Border, Steve Waugh, Sunil Gavaskar and Younis Khan. “I was so glad I was here to witness that – an unbelievable knock by an unbelievable player. He is the most complete England batsman in all forms. It is absolutely mad that it is exactly the same age. I am happy to call it a draw,” said Cook on BBC Test Match Special after Root entered the 10,000-run club on the back of a brilliant unbeaten knock under pressure, especially when England were 69/4 in a chase of 277. Resuming from 216/5 under overcast skies and needing 61 runs with five wickets in hand, England avoided any dismissals as Root and Foakes settled quickly. As Foakes got the runs through boundaries, Root, resuming from 77, entered the 90s on the back of good running between the wickets and a crisp straight drive. Root swiftly brought up his century off 156 balls, to thunderous applause from fans, home as well as away dressing rooms. Root smacked Southee for three boundaries, including the last one pulled fiercely through mid-wicket, to seal an outstanding win for England after see-saw first three days. It also meant Root put a full stop to chances of the second new ball coming for New Zealand’s crafty bowling attack. Root left the field to rapturous applause from the crowd, going a little emotional on his way back to the dressing room on an unforgettable day for the ex-England skipper. Brief Scores: England 141 & 279/5 in 78.5 overs (Joe Root 115 no, Ben Stokes 54, Kyle Jamieson 4/79) bt New Zealand 132 & 285 in 91.3 overs)","pubDate":"2022-06-05 14:19:08","image_url":null,"source_id":"telanganatoday","country":["india"],"category":["sports"],"language":"english"},{"title":"England vs New Zealand: 'A mad, mad win', Twitter goes wild as Root seals memorable win for hosts at Lord's","link":"https://www.firstpost.com/firstcricket/sports-news/england-vs-new-zealand-a-mad-mad-win-twitter-goes-wild-as-root-seals-memorable-win-for-hosts-at-lords-10761491.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"England vs New Zealand: 'A mad, mad win', Twitter goes wild as Root seals memorable win for hosts at Lord's","content":"What was expected to be a thrilling conclusion to the Lord's Test on the fourth day instead became a cakewalk for England. Thanks to former captain Joe Root's brilliant hundred, the hosts went 1-0 up in the three-match series with a five-wicket victory over New Zealand on Sunday.Root remained unbeaten on 115, his 26th ton in Test cricket, and in the process, became only the second English batter after Alastair Cook to complete 10,000 runs in the format. He was aided by wicketkeeper-batter Ben Foakes, who remained unbeaten on 32 and forged an unbroken 120-run stand for the sixth wicket.Root took charge after a top-order collapse left England at a shaky 69/4 in the afternoon session on Day 3 and brought them back on their feet with a 90-run stand with skipper Ben Stokes (54).Though they were in a relatively comfortable position at stumps, Root needed to ensure that the hosts did not suffer any further scares on the fourth day like the Black Caps did the previous day when they crumbled from 251/4 to 285 all out.And with this 328-ball knock that was studded with 12 fours, Root once again asserted himself as one of the world's foremost red-ball batters right up there with the likes of Steve Smith.The match did garner plenty of interest on social media, especially on microblogging website Twitter where \"ENGvNZ\" was among the top hashtags in India.Here are some of the top reactions from Cricket Twitter: WHAT A MAN!!A huge win to start the summer!#ENGvNZ pic.twitter.com/LYe4AJUn50— England Cricket (@englandcricket) June 5, 2022 Always love watching Test cricket in England. Just enough seam and swing on offer here for the quicks #ENGvNZ — Pat Cummins (@patcummins30) June 3, 2022  Massive day for England cricket. Need this guy to take us home (again) for Queen and Country. Good luck @root66 ! #ENGvNZ pic.twitter.com/GU9CVUiwsE— Piers Morgan (@piersmorgan) June 5, 2022 A mad, mad win for England, made possible by the mood-changing innings of Stokes and the class of Root. A five-wicket margin doesn't tell a fraction of the story. Well played, Ben Foakes, too. — Lawrence Booth (@the_topspin) June 5, 2022  Joe Root, the great crowd pleaser that he is, has secured victory quickly enough that 4th day ticket holders will receive a full refund.— George Dobell (@GeorgeDobell1) June 5, 2022 Never a nice sight for any Aussie to see England get a good win. That was world class from Joe Root. 10,000 runs and many more to come. Ben Foakes excellent too. Top chase.#ENGvNZ #ENGvsNZ — CricBlog ✍ (@cric_blog) June 5, 2022 Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram","pubDate":"2022-06-05 14:17:26","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/06/Joe-Root-celebrates-England-win-Lords-AP-640.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Youngest to 10000 test runs: List of players to score 10000 runs in Test match history","link":"https://thesportsrush.com/cricket-news-youngest-to-10000-test-runs-list-of-players-to-score-10000-runs-in-test-match-history/","keywords":["Cricket","England","Joe Root","New Zealand tour of New Zealand 2022"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Youngest to 10000 test runs: Joe Root smashed his 26th Test ton and accomplished the rare milestone of surpassing 10000 runs simultaneously. On ‘Day 4’ of the first Test match between England and New Zealand at the Lord’s Cricket Ground, a Joe Root spectacle with the bat in the fourth innings has helped England prevail… The post Youngest to 10000 test runs: List of players to score 10000 runs in Test match history appeared first on The SportsRush.","content":"Youngest to 10000 test runs: Joe Root smashed his 26th Test ton and accomplished the rare milestone of surpassing 10000 runs simultaneously. On ‘Day 4’ of the first Test match between England and New Zealand at the Lord’s Cricket Ground, a Joe Root spectacle with the bat in the fourth innings has helped England prevail by 5 wickets, to go 1-0 up in the three-match series. En route the chase of 277, a 90-run stand between skipper Ben Stokes and Joe Root for the fifth wicket on ‘Day 3’, had meant that England required mere 61 more runs on ‘Day 4’ with 5 wickets still left in the bank. Root and wicket-keeper batter Ben Foakes (32) made sure they nailed the chase unscathed, with the former hitting the winning boundary after some tough few months for his side under his reign. The talk of the entire Cricketing fraternity however, and deservedly so was Joe Root (115 off 170), who not only notched-up his 26th Test century, but also reached the landmark moment of completing 10,000 runs in the format on the same delivery, during the 77th Over of the chase. Already hailed as a modern day legend of the game, the 31-year-old went on to become the 14th player, and only the second from England (after Sir Alastair Cook) to reach the landmark moment. Through all the trials and tribulations of the #Ashes Joe Root never lost his smile in Australia but it’s so good to see him smiling and laughing with England on the cusp of a famous win. Captain or not, good times or not, he’s stayed the same. Maybe his greatest legacy #ENGvNZ — Bharat Sundaresan (@beastieboy07) June 5, 2022 One may term it a coincidence of the highest order, as Joe Root arrived at the landmark figure at the age of 31 years and 157 days, thus becoming the joint-youngest to reach there alongside Alastair Cook, who also completed 10,000 Test runs at same age and number of days. At the second spot is the legendary batter Sachin Tendulkar, who also arrived at the figure at 31 years of age, but took some 326 days. Moreover, the former England skipper also became only the third player after Gordon Greenidge and Naseer Hussain to score a fourth innings Hundred at the Lord’s Cricket ground. 31 years and 157 days – Joe Root 31 years and 157 days – Alastair Cook 31 years and 326 days – Sachin Tendulkar 33 years and 134 days – Jacques Kallis 33 years 162 days – Ricky Ponting ALSO READ : Players with fastest 10000 runs in Test match history","pubDate":"2022-06-05 14:15:45","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Root Hits Hundred to Win! | Highlights | England v New Zealand - Day 4 | 1st LV= Insurance Test 2022 - England & Wales Cricket Board","link":"https://news.google.com/__i/rss/rd/articles/CBMiK2h0dHBzOi8vd3d3LnlvdXR1YmUuY29tL3dhdGNoP3Y9eXBDVHc3cVlfVk3SAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Root Hits Hundred to Win! | Highlights | England v New Zealand - Day 4 | 1st LV= Insurance Test 2022  England & Wales Cricket BoardRecent Match Report - New Zealand vs England 1st Test 2022  ESPNcricinfoUpdated ICC World Test Championship Points Table After England vs New Zealand 1st Test  Cricket AddictorWatch: Crazy Co-Incidence As Ben Stokes, Trent Boult Involved In 2019 World Cup Final Deja Vu  NDTV SportsENG vs NZ 1st Test Highlights, Day 4 Scorecard: Root Stars As England Beat New Zealand By 5 Wickets  India.comView Full coverage on Google News","content":null,"pubDate":"2022-06-05 13:57:22","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Umran Malik says THIS about breaking Shoaib Akhtar's record of fastest ball in international cricket ahead of India vs South Africa T20 series","link":"https://zeenews.india.com/cricket/umran-malik-says-this-about-breaking-shoaib-akhtars-record-of-fastest-ball-in-international-cricket-ahead-of-india-vs-south-africa-t20-series-2470815.html","keywords":null,"creator":null,"video_url":null,"description":"Malik credited his statemate, Abdul Samad, for the pace he got in his bowling. Malik and Samad both are from Jammu & Kashmir state and have been practicing together since childhood.","content":"Umran Malik has emerged as the fastest bowler India has ever produced in the last two seasons of IPL playing for Sunrisers Hyderabad. After an outstanding season in IPL 2022, Umran got his maiden call up for Team India for the T20 series against South Africa at home starting from June 9. With Umran consistently bowling around 150 kph, cricket fans are curious if he could break Shoaib Akhtar's fastest delivery record of 161 kph. Opening up on the same question, Umran has said that he is not focusing on Akhtar's record. Shoaib Akhtar's fastest ball https://t.co/584idKBOnz — Akash Kharade (@cricaakash) June 5, 2022 Many young Indian bowlers impressed the experts and fans with their sheer pace in the recently concluded IPL 2022 but Malik was the standout performer because of his raw pace. The Sunrisers Hyderabad pacer had a breakout season as he picked 22 wickets in 14 matches and often clocked speeds in excess of 150 kmph. For his impressive performance in IPL 2022, Malik got the Emerging Player award. \"My focus is not on that record right now. I want to bowl well, bowl in the right areas and help my country win all five matches against South Africa. I want to keep it 150 or above to maintain my body and strength,\" Umran told News24 Sports. The 22-year-old seamer consistently produced quick deliveries in the IPL 2022. He bowled the second fastest delivery of the season 157 kph after Lockie Ferguson (157.3 kph) surpassed him in the final. Malik credited his statemate, Abdul Samad, for the pace he got in his bowling. Malik and Samad both are from Jammu & Kashmir state and have been practicing together since childhood. \"Abul motivated me a lot. Whenever I used to bowl to him, he would say I am bowling slow. So, then I would deliver with more pace. And then the gym and proper exercise helped me in this,\" Umran added.","pubDate":"2022-06-05 13:43:00","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"North West Cricket Results 04/06/2022","link":"https://highlandradio.com/2022/06/05/north-west-cricket-results-04-06-2022/","keywords":["Sport"],"creator":["highlandsport"],"video_url":null,"description":"There was a full programme of cricket played in glorious conditions across the North West on Saturday but not too many surprises on an afternoon where the formbook held firm. Pride of place on the honours board went to Ardmore’s Tyron Kane who picked up figures of 7 for 5, including a hat-trick, as the … North West Cricket Results 04/06/2022 Read More » The post North West Cricket Results 04/06/2022 appeared first on Highland Radio - Latest Donegal News and Sport.","content":"Sun, 5 Jun 2022 (+353) 07491 25000 (+353) 086 60 25000 Facebook-f Twitter Instagram Youtube News Sport Obituaries Bingo Playback Job Spot Shows Menu News Sport Obituaries Bingo Playback Job Spot Shows Listen Live News Sport Obituaries Bingo Playback Job Spot Shows Menu News Sport Obituaries Bingo Playback Job Spot Shows Listen Live Home / News & Sport / North West Cricket Results 04/06/2022 North West Cricket Results 04/06/2022 Sport June 5, 2022 There was a full programme of cricket played in glorious conditions across the North West on Saturday but not too many surprises on an afternoon where the formbook held firm. Pride of place on the honours board went to Ardmore’s Tyron Kane who picked up figures of 7 for 5, including a hat-trick, as the Bleachgreen side bowled St Johnston out for 28. Game of the day was just up the road in Strabane where neighbours Fox Lodge provided the opposition with strabane edging over the winning line with little to spare. Bready recovered from Friday night’s narrow defeat at Ardmore to account for Glendermott by 7 wickets. Coleraine got the better of a low-scoring affair to post a 4-wicket win at Killyclooney. Eglinton’s revival continued as they accounted for Ballyspallen at the village by 6-wickets. Donemana knocked Burndennett off top spot in the group in a high-scoring encounter at the Holm, thanks to a 71-run win. And Brigade kept their winning run going Bonds Glen claiming a 36-run victory. Advertisement Advertisement Advertisement Top Stories Audio , News , Top Stories New research shows 1 in 5 suffer with depression after contracting Covid 5 June 2022 News , Top Stories Number of Bus Eireann Donegal Town to Dublin routes cancelled today 5 June 2022 News , Top Stories Missing 6 year old boy may have travelled to border region 5 June 2022 Audio , News , Top Stories Dublin Airport queues reportedly running well today 5 June 2022 Advertisement Related News Audio , News , Top Stories New research shows 1 in 5 suffer with depression after contracting Covid 5 June 2022 News , Top Stories Number of Bus Eireann Donegal Town to Dublin routes cancelled today 5 June 2022 News , Top Stories Missing 6 year old boy may have travelled to border region 5 June 2022 Audio , News , Top Stories Dublin Airport queues reportedly running well today 5 June 2022 News , Top Stories New report claims those impacted by Brandon abuse are to sue HSE 5 June 2022 Audio , News , Top Stories Large majority of Irish population expecting recession in next year 5 June 2022 Highland Radio Pine Hill, Letterkenny, Co. Donegal, Ireland enquiries@highlandradio.com Telephone: (+353) 07491 25000 Text: (+353) 086 60 25000 Fax: (+353) 07491 25344 News Sport Obituaries Bingo Playback Job Spot Shows Menu News Sport Obituaries Bingo Playback Job Spot Shows Advertise Contact Us How to Listen Competition T&Cs Privacy Policy Menu Advertise Contact Us How to Listen Competition T&Cs Privacy Policy Advertisement Copyright ©2022 Highland Radio - All Rights Reserved Designed by Manna | Developed by Purposemakers News Sport Obituaries Bingo Playback Job Spot Shows Menu News Sport Obituaries Bingo Playback Job Spot Shows Advertise Contact Us How to Listen Competition T&Cs Privacy Policy Menu Advertise Contact Us How to Listen Competition T&Cs Privacy Policy Highland Radio Pine Hill, Letterkenny, Co. Donegal, Ireland (+353) 07491 25000 (+353) 086 60 25000 enquiries@highlandradio.com Facebook-f Twitter Instagram Youtube","pubDate":"2022-06-05 13:31:58","image_url":null,"source_id":"highlandradio","country":["ireland"],"category":["sports"],"language":"english"},{"title":"KET vs MID Dream11 Prediction: Fantasy Cricket Tips, Today's Playing 11 and Pitch Report for Vitality T20 Blast 2022, Match 46","link":"https://www.sportskeeda.com/fantasy-cricket-mantra/ket-vs-mid-dream11-prediction-fantasy-cricket-tips-today-s-playing-11-pitch-report-vitality-t20-blast-2022-match-46?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Fantasy Cricket Mantra"],"creator":["Anjishnu Roy"],"video_url":null,"description":null,"content":null,"pubDate":"2022-06-05 13:27:17","image_url":"https://static.sportskeeda.com/editor/2022/06/6915f-16544303944686-1920.jpg","source_id":"sportskeeda","country":["india"],"category":["sports"],"language":"english"},{"title":"WOR vs LEI Dream11 Prediction: Fantasy Cricket Tips, Today's Playing 11 And Pitch Report for Vitality T20 Blast, Match 49","link":"https://www.sportskeeda.com/fantasy-cricket-mantra/wor-vs-lei-dream11-prediction-fantasy-cricket-tips-today-s-playing-11-and-pitch-report-vitality-t20-blast-match-49?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Fantasy Cricket Mantra"],"creator":["Aman Chauhan"],"video_url":null,"description":null,"content":null,"pubDate":"2022-06-05 13:27:17","image_url":"https://static.sportskeeda.com/editor/2022/06/66cb3-16544264321754-1920.jpg","source_id":"sportskeeda","country":["india"],"category":["sports"],"language":"english"},{"title":"Joe Root hits century as England seal win over New Zealand in first Test - The Guardian","link":"https://news.google.com/__i/rss/rd/articles/CBMiYmh0dHBzOi8vd3d3LnRoZWd1YXJkaWFuLmNvbS9zcG9ydC8yMDIyL2p1bi8wNS9jcmlja2V0LWVuZ2xhbmQtbmV3LXplYWxhbmQtZGF5LWZvdXItcmVwb3J0LWpvZS1yb2900gFiaHR0cHM6Ly9hbXAudGhlZ3VhcmRpYW4uY29tL3Nwb3J0LzIwMjIvanVuLzA1L2NyaWNrZXQtZW5nbGFuZC1uZXctemVhbGFuZC1kYXktZm91ci1yZXBvcnQtam9lLXJvb3Q?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Joe Root hits century as England seal win over New Zealand in first Test  The GuardianShould Ben Stokes drop Ben Stokes for that shot? | England vs New Zealand | #PoliteEnquiries  ESPN UKHow England beat New Zealand in the first Test  Sky SportsEngland beat New Zealand by five wickets: first Test, day four – as it happened  The GuardianRoot Hits Hundred to Win! | Highlights | England v New Zealand - Day 4 | 1st LV= Insurance Test 2022  England & Wales Cricket BoardView Full coverage on Google News","content":null,"pubDate":"2022-06-05 13:15:00","image_url":null,"source_id":"google","country":["united kingdom"],"category":["sports"],"language":"english"}]}