{"newsArray":[{"title":"Ponting‘s role in ending ‘ugly’ Langer mess","link":"https://www.couriermail.com.au/sport/cricket/ricky-ponting-set-for-key-role-in-ending-ugly-justin-langer-mess/news-story/5261430b0d7c6878ebe96ccac0b90243","keywords":["Cricket news and galleries","Kayo","Sport news and galleries"],"creator":null,"video_url":null,"description":"Ricky Ponting could be key to solving the friction between Justin Langer and Cricket Australia as the former teammates reunite in media roles this summer.","content":"Ponting and Langer were long-time Australian teammates and forged a strong bond that could prove to be influential in the coming weeks. Australia heads into the first Test in Perth on Wednesday amid a potential firestorm triggered by an explosive interview Langer gave about his ugly exit as coach. Watch Australia v West Indies. Every test match live and ad-break in play on Kayo. New to Kayo? Start your free trial now >In the interview published by News Corp, Langer called out players he labelled as “cowards” for leaking against him to the media during his tenure. Now Langer is set to play a central role on Channel 7’s coverage of the Test summer, which starts in the 52-year-old’s home state and could see him garner extra support. Ponting will be aside him and could prove to be the calming influence needed for the situation. Ponting has said the pair are like “brothers” while Langer brought his former captain on as his assistant during the 2019 World Cup.While working with Ponting as his assistant, Langer was reportedly less prone to the mood swings that put him on the outer with some players. “Punter kept JL very even,” one current player told The Age and The Sydney Morning Herald.The publication reports that there is a wide belief the understanding between Ponting and Langer could be central to cooling any tension with current players.Also part of that 2019 coaching group was Brad Haddin who is concerned by how long the drama around Langer’s departure has been allowed to drag on.“This is just a really ugly situation,” Haddin told Triple M. “This has been going on now for some time, this has been going on for over 12 months. That takes it to a new level. Obviously at some stage during his tenure he lost the change room. Whatever opinion you have on that, that’s happened, that’s fact.“But to have this still going on after 10 months, this is a guy that’s played 100 Tests for Australia, he’s been a very successful coach. Yes it ended messy and by the looks of it there’s still a lot more to come out.“I don’t know where they go from there, what they want the end game to be. Do we want to play this out in the public is it time they do get behind closed doors and really nut this out, because we all love the game and this hasn’t been going on for a couple of weeks. There’s obviously a lot of tensions there, and maybe this can be the catalyst to end it.”In a positive step, Langer has rejected suggestions that he is at “war” with Pat Cummins and other members of the Australian cricket team after his interview. He told 7News Perth: “Ironically, I spoke to Patty on Monday, we had a long talk about how the team was going, how he’s going, how his family’s going. And some of this rubbish is complete and utter rubbish.“I’ve got so much respect for Patty Cummins, I think he’s a brilliant player, I think he’s an outstanding human being. So any thought there’s war between Patty and I could not be further from the truth.”","pubDate":"2022-11-25 00:55:00","image_url":null,"source_id":"couriermail","country":["australia"],"category":["sports"],"language":"english"},{"title":"Black Cap Martin Guptill signs with Melbourne Renegades in Big Bash T20 league","link":"https://www.newstalkzb.co.nz/news/sport/black-cap-martin-guptill-signs-with-melbourne-renegades-in-big-bash-t20-league/","keywords":null,"creator":null,"video_url":null,"description":"Martin Guptill has signed with the Melbourne Renegades for this summer’s Australian Big Bash Twenty20 competition, days after being released from his New Zealand Cricket (NZC) contract. He will replace England’s Liam Livingstone, who withdrew earlier this week due to international commitments. Guptill will slot in for the last 10 regular season games, from December 28. The Renegade’s Twitter account today said: “New Zealand’s all-time leading T20I run-scorer is a Renegade Welcome aboard, @martyguptill!” New Zealand's all-time leading T20I run-scorer is a Renegade 😤Welcome aboard, @martyguptill!#GETONRED pic.twitter.com/6SvemdUsPZ— Melbourne Renegades (@RenegadesBBL) November 24, 2022 NZC this week announced Guptill had been released from his central contract so he can pursue playing opportunities elsewhere. The 36-year-old opening batsman has been a fixture in Black Caps white ball squads for the best part of 14 years but did not play in the recently completed T20 World Cup, and was not selected for the current T20 and ODI series against India. New Zealand’s leading T20 run-scorer, the third-highest in the ODI format, and third on the world all-time T20 list, Guptill has emphasised he is not retiring from international cricket and still wishes to be considered for Black Caps selection when available. Earlier this week, NZC chief executive David White said: “We understand Martin’s position. He’s been a fantastic batsman for us for a long period of time, and we certainly don’t wish to stand in his way as he explores other opportunities. “Martin’s been a giant of the white ball game, a committed and well-respected member of the Black Caps, and has earned the right to play out his career on his own terms. “He leaves his contract with our best wishes.” Guptill has said he still wants to play for the national side. “Playing for my country has been a massive honour, and I’m grateful to everyone within the Black Caps and NZC for their support,” he said. “But, equally, I’m realistic enough to understand the need to consider my options in the current circumstances. “With this release, I’m still available for New Zealand, I have the chance to explore other opportunities, and I also get to spend more time with my family — which is important.”","content":null,"pubDate":"2022-11-25 00:36:48","image_url":"https://www.newstalkzb.co.nz/media/zmykbiff/black-caps-batter-martin-guptill-photosport.jpg","source_id":"newstalkzb","country":["new zealand"],"category":["sports"],"language":"english"},{"title":"India vs New Zealand Live score 1st ODI: IND take on NZ in Auckland, toss in a few minutes","link":"https://www.firstpost.com/firstcricket/sports-news/india-vs-new-zealand-1st-odi-ind-vs-nz-live-score-cricket-match-latest-updates-auckland-rain-weather-11691531.html","keywords":["First Cricket News"],"creator":["Somya Kapoor"],"video_url":null,"description":"India vs New Zealand Live score 1st ODI: IND take on NZ in Auckland, toss in a few minutes","content":"06:06 (IST)India vs New Zealand First things first. Sun is shining bright in Auckland at the moment. India's tour of New Zealand has been marred by rain. The first T20I was washed away, the second was a rain-affected one too and the third one ended as a tie after rain played spoilsport 05:57 (IST)Smiles, friendly banter & the trophy 🏆 unveil! #TeamIndia | #NZvIND pic.twitter.com/3R2zh0znZ3— BCCI (@BCCI) November 24, 202205:55 (IST)India vs New Zealand- Pre-match talks \"We guys have been performing well for a period of time. At the same time, talking about myself, I have to keep performing. I know till the time I perform, it would be good for me. It keeps me on my toes and keeps me hungry,\" said Shikhar Dhawan23:15 (IST)Hello and welcome to our live coverage of the first ODI between India and New Zealand at the Eden Park in Auckland. Team India will be hoping to maintain their winning run in the tour of New Zealand, having earlier taken the T20I series 1-0.Preview: Team India will begin its road to the 2023 World Cup on home soil when it takes on New Zealand in the first of three ODIs in Auckland on Friday.Shikhar Dhawan once again returns as the stand-in captain of the Indian team in the absence of regular skipper Rohit Sharma and other seniors such as Virat Kohli, KL Rahul, Jasprit Bumrah. Dhawan takes over from all-rounder Hardik Pandya, who led the Men in Blue to a 1-0 series win in the T20I leg of their tour of New Zealand that took place right after the T20 World Cup in Australia.Pandya has been rested from the ODIs along with the likes of veteran seamer Bhuvneshwar Kumar, Harshal Patel, Mohammed Siraj and wicketkeeper-batter Ishan Kishan while Shardul Thakur, Shahbaz Ahmed, Deepak Chahar and Kuldeep Sen have been included.Kane Williamson, who recently returned to form after struggling with the bat for the most part during the T20 World Cup, continues to lead the Black Caps in the one-dayers after the T20I series. He led the Kiwis in the 2nd T20I, which Team India won by a comfortable margin of 65 runs, but missed out on the third game due to a medical appointment, leading to senior bowler Tim Southee taking over the reins.Squads:New Zealand: Finn Allen, Devon Conway(w), Kane Williamson(c), Glenn Phillips, Daryl Mitchell, Michael Bracewell, James Neesham, Mitchell Santner, Lockie Ferguson, Tim Southee, Adam Milne, Matt Henry, Tom Latham.India: Shikhar Dhawan(c), Shubman Gill, Shreyas Iyer, Suryakumar Yadav, Sanju Samson(w), Deepak Hooda, Washington Sundar, Shardul Thakur, Deepak Chahar, Umran Malik, Arshdeep Singh, Yuzvendra Chahal, Kuldeep Yadav, Rishabh Pant.Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-11-25 00:36:44","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/11/Kane-Williamson-Shikhar-Dhawan-ODI-trophy-Twitter-1.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Jessica Ogden gets first Central Hinds call-up - Central Districts Cricket","link":"http://www.voxy.co.nz/sport/5/410283","keywords":["Sport"],"creator":null,"video_url":null,"description":"There's a potential Central Hinds debut on the cards as the team flies to Dunedin for round three of 2022/23 Hallyburton Johnstone Shield tomorrow against the Otago Sparks.","content":"There's a potential Central Hinds debut on the cards as the team flies to Dunedin for round three of 2022/23 Hallyburton Johnstone Shield tomorrow against the Otago Sparks. Manawatu youngster Jessica Ogden comes into the Hinds squad for the first time, and is the only change from the team's winning opening weekend. Said Hinds Head Coach Jamie Watkins, \"Jess has been a consistent performer over the past few seasons for Manawatu, and comes in after a successful CD U19 campaign in the title winning team of 2020. \"With such a strong bowling group in the Hinds set-up, it has been tough for her to break in, so we are really excited that she now gets a chance to join the squad. \"We’re confident that if Jess is selected in the playing XI tomorrow, she will make an impact with her ability to swing the ball with accuracy.\" The 20-year-old pace right-armer from Palmerston North gets her opportunity with strike bowler Rosemary Mair unavailable for the match, while top order batter Emily Cunningham is still out with a calf niggle sustained in the lead-up to last weekend. It's otherwise a strong, balanced and experienced squad preparing to take on the defending one-day national champions this Saturday. The Hinds are unbeaten after the first two rounds, after a convincing six-wicket win over the Auckland Hearts at Pukekura Park last Saturday. The experienced team hit the ground running, before a washout prevented a repeat dose on Sunday. The Hinds were sharp in the field, sticking most of their catches and chasing hard on a slow outfield with the showstopper a pinpoint throw from WHITE FERNS star Hannah Rowe from the deep square boundary to run out the dangerous and quick Katie Perkins. Rowe was also centre stage with the bat, bringing the win home with a run-a-ball 30 not out in an unbroken 48-run fifth wicket stand with captain Natalie Dodd (32 not out off 36 balls). HALLYBURTON JOHNSTONE SHIELD 2022/23 ROUND ONE - Saturday, 19 November Central Hinds beat Auckland Hearts at Pukekura Park by six wickets SCORECARD ROUND TWO - Sunday, 20 November Central Hinds v Auckland Hearts match abandoned with no toss at Pukekura Park (rain) ROUND THREE - Saturday, 26 November 10.30am Otago Sparks v Central Hinds at University of Otago Oval, Dunedin Free admission and free livestream at www.cdcricket.co.nz Natalie Dodd - captain, wicketkeeper, Taranaki Jess Watkin - vice-captain, Manawatu Georgia Atkinson, Manawatu Claudia Green, Nelson Mikaela Greig, Manawatu Melissa Hansen, Wairarapa Kate Gaging, Nelson Jessica Ogden, Manawatu - potential Hinds and List A debut Cate Pedersen, Hawke's Bay Monique Rees, Nelson Hannah Rowe, Manawatu Kerry Tomlinson, Hawke's Bay Head Coach - Jamie Watkins Contracted players unavailable for selection: Ashtuti Kumar and Ocean Bartlett (NZ Development tour of India) Emily Cunningham (calf injury) Rosemary Mair, Hawke's Bay (personal reasons) Otago Sparks Felicity Leydon-Davis - captain Gemma Adams Emma Black Caitlin Blakely Eden Carson / Jordan Meltzer Chloe Deerness Kate Ebrahim Polly Inglis Sophie Gray Molly Loe Sophie Oldershaw Saffron Wilson","pubDate":"2022-11-24 23:15:32","image_url":null,"source_id":"voxy","country":["new zealand"],"category":["sports"],"language":"english"},{"title":"Details of former CA exec’s sexual assault charges","link":"https://www.themercury.com.au/sport/cricket/former-cricket-australia-executive-charged-with-sexual-assault-of-employee/news-story/0dee16e6aeaa2f7104ff018ff9dd14ed","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"A former senior Cricket Australia executive is facing the possibility of jail time if convicted of two separate sexual assault charges involving a male colleague and another male cricket employee.","content":"Timothy Whittaker, 37, a trusted, long-serving Head of Communications at Cricket Australia who served under chief executives James Sutherland and Kevin Roberts, was before the Melbourne Magistrates’ Court on Thursday charged with the two unrelated counts of sexual assault.The first related to the alleged assault of a younger Cricket Australia employee in March 2019, and the second charge involved a different younger male cricket worker employed at Cricket Victoria, in January 2016.Mr Whittaker’s lawyer, Mark Sturges, indicated that he will enter a not guilty plea and will contest both charges. The matter has been adjourned for a seven-day hearing on May 1 next year at the Melbourne Magistrates’ Court.A special mention will take place beforehand on April 28.Whittaker had a composed and relaxed demeanour in the courtroom. He had his legs crossed for a lot of the hearing and was wearing a mask throughout.Whittaker was a senior figure at CA who travelled to Cape Town as Sutherland’s advisor in the wake of the Sandpapergate Scandal in 2018, and later that year was also privy to Cricket Australia’s Integrity unit investigation into captain Tim Paine over a sexting scandal.The Prosecution argued Whittaker’s moral culpability was high given he was essentially in an executive role in cricket, however it was accepted by the Court that Whittaker was not working in a role of authority above either of the two men.It was accepted by the Court that the second alleged victim from January 2016, did not work directly with Whittaker given Cricket Australia and Cricket Victoria are separate organisations. Magistrate Metcalf told the Court she accepted the submission of the prosecution that Whittaker’s alleged offending represented elements of predatory behaviour, although prosecutors did not allege it was prolonged behaviour.In both instances, the Court heard from the prosecutor that the two men were allegedly incapable of consenting due to their state of consciousness and intoxication and were completely vulnerable without an opportunity to defend themselves in an environment where they should have felt safe in the home of a work associate.The Court heard the two alleged incidents were embarrassing and traumatic for both men.If found guilty, Whittaker could face up to 10 years in prison.On Thursday, the Court heard the alleged assault of the Cricket Australia male co-worker took place at Whittaker’s private residence in Melbourne following a party in the first half of 2019.After a night of drinking at Half Acre Bar in Port Melbourne, the court heard that the alleged victim and others came back to Whittaker’s place to continue drinking.Later in the evening, other guests went home, leaving behind only the alleged victim, who had fallen asleep on Whittaker’s couch fully clothed.The court heard the alleged victim later woke up to Whittaker feeling his penis and giving him a hand job.When the alleged victim saw that Whittaker was the only other person on the bed at the time, Whittaker was allegedly pretending to be asleep.The alleged victim immediately left the residence before receiving a text asking where he was.Not familiar with the phone number, the alleged victim phoned back thinking it might be another friend, but upon learning it was Whittaker on the other end of the line, got verbally angry towards the accused.Whittaker said he didn’t know what he was talking about and invited him back for another drink. The alleged victim hung up on the accused.The matter was reported to police and Whittaker denied committing the alleged offence.In the wake of that charge being levelled in the Melbourne Magistrates’ Court late last year, another man came forward with a new complaint and Whittaker was subsequently charged with another assault of sexual assault involving a different male cricket employee, occurring three years earlier in January 2016.Whittaker and the second alleged victim had known each other for two years prior to the alleged incident occurring in January 2016, again after a night of drinking at a Melbourne Hotel.The court heard the alleged victim and one other person went back to Whittaker’s residence and the alleged victim felt drunk and decided to go to bed – stripping down to underpants and a shirt before getting into bed.The Court heard the man woke to the feeling of movement in his underpants and a hand stroking his penis.When the alleged victim stirred and turned the hand had moved away.After years of giving Whittaker the benefit of the doubt over what had occurred, the second victim becoming aware that allegations had been made against Whittaker from the incident in March 2019.On October 21, the second alleged victim spoke to Cricket Australia about what had occurred and the man subsequently made a statement to police, ultimately leading to the second charge being laid.Whittaker declined to be interviewed by police over the second alleged incident.The Court heard Whittaker had a problem with alcohol but had abstained from drinking for 12 months and was also working with a psychologist.sexual assault helpline","pubDate":"2022-11-24 23:04:00","image_url":null,"source_id":"mercury","country":["australia"],"category":["sports"],"language":"english"},{"title":"Jofra Archer nails Zak Crawley with VICIOUS bouncer","link":"https://www.themercury.com.au/sport/cricket/jofra-archer-nails-zak-crawley-with-vicious-bouncer/video/d0856d903552a636f336a738a9c0c48c","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket: Jofra Archer has made an encouraging return to cricket, after he nailed England opener Zak Crawley with a brutal bouncer.","content":"Cricket: Jofra Archer has made an encouraging return to cricket, after he nailed England opener Zak Crawley with a brutal bouncer.","pubDate":"2022-11-24 22:27:21","image_url":null,"source_id":"mercury","country":["australia"],"category":["sports"],"language":"english"},{"title":"Star locked in as No.1 pick’s replacement","link":"https://www.couriermail.com.au/sport/cricket/big-bash-martin-guptill-joins-melbourne-renegades-as-international-signing/news-story/d74e6195205ad53e2d83b60389073df6","keywords":["Big Bash News","Breaking News","Cricket news and galleries","National Breaking News","NewsWire","Sport news and galleries","SuperCoach BBL"],"creator":null,"video_url":null,"description":"A difficult decision to give up a national contract with New Zealand after 367 games over more than a decade was made easier by the excitement of rejoining the Big Bash for Martin Guptill.","content":"Thes all-time leading international T20 run-scorer for the Kiwis, Guptill, has signed with the Melbourne Renegades as the second part of a two-pronged international attack, with West Indian star Andre Russell, to replace No.1 draft pick Liam Livingstone. Guptill is a white-ball beast, having amassed almost 11,000 runs across 320 appearances for his country in ODI and T20I cricket. Only Indian megastars Virat Kohli and Rohit Sharma have scored more T20I runs than the Kiwi great. Following in the footsteps of countrymen Trent Boult and Colin de Grandhomme, Guptill, 36, asked for a release from his contract with New Zealand cricket to hit the worldwide T20 circuit, and his first stop will be the Big Bash. Guptill has played a single Big Bash game, with the Sydney Thunder in 2010, but returns to the competition with every intention to put on a show. “This is a new challenge for me, and it will be nice to call Melbourne home for the summer. I’ll be trying to make as many runs as I can,” he said. “I’ve crossed paths with a few of the guys over the years on the international circuit and know this will be a great team environment to be part of.”Guptill will link up with the Renegades following Russell’s four-game stint at the start of the tournament, replacing England batter Livingstone, who opted out of his deal due to growing international commitments. With Guptill potentially set to form an opening partnership with Aaron Finch, he’ll be available for 10 regular season games – starting with a December 28 clash against the Sydney Sixers – plus finals, should the Renegades qualify.“Signing Martin and Andre over the past month has been a great outcome for our club,” Renegades general manager James Rosengarten said.“With Andre playing the first four matches and Martin joining us from there, we now have a world-class player available for the duration of the tournament which will help give us every chance of success.”The Renegades will begin their campaign on December 15 against the Brisbane Heat in Cairns.RENEGADES SQUAD: Nic Maddinson (c), Zak Evans, Aaron Finch, Jake Fraser- McGurk, Martin Guptill*, Sam Harper, Marcus Harris, Mackenzie Harvey, Akeal Hosein*, Ruwantha Kellapotha*, Shaun Marsh, Jack Prestwidge, Kane Richardson, Corey Rocchiccioli, Tom Rogers, Andre Russell*, Will Sutherland, Mujeeb Ur Rahman*, Jon Wells. *Denotes international player","pubDate":"2022-11-24 22:00:00","image_url":null,"source_id":"couriermail","country":["australia"],"category":["sports"],"language":"english"},{"title":"India vs New Zealand: Eye on 2023 World Cup, India start 50-over auditions under temporary leader Dhawan","link":"https://kashmirreader.com/2022/11/25/india-vs-new-zealand-eye-on-2023-world-cup-india-start-50-over-auditions-under-temporary-leader-dhawan/","keywords":["SPORTS"],"creator":["Press Trust of India"],"video_url":null,"description":"AUCKLAND: Copping a lot of flak for its archaic approach in T20Is, the Indian cricket team is expected to turn a new leaf in a different format as it takes on New Zealand in a three-match ODI series, which will mark the start of preparations for next year’s World Cup. India had endured a nightmare […]","content":"AUCKLAND: Copping a lot of flak for its archaic approach in T20Is, the Indian cricket team is expected to turn a new leaf in a different format as it takes on New Zealand in a three-match ODI series, which will mark the start of preparations for next year’s World Cup. India had endured a nightmare back in 2020 in New Zealand when Virat Kohli’s side was blanked 0-3 in one of the most lopsided series where the bowling effort was below par. Exactly 11 months are left for the marquee event in India and the series starting on Friday will give the team an initial idea about some of the middle-order slots and also the bowling arsenal in India’s armoury. With five seniors — skipper Rohit Sharma, the talismanic Virat Kohli, team management’s favourite KL Rahul, pace spearhead Jasprit Bumrah and No.1 ODI all-rounder Ravindra Jadeja not part of this series, the management can only get a rough idea in which direction the team would move. All these big guns will now play a lot of of ODI cricket, starting with the Bangladesh series, and the team combination will undergo a sea change once they all come back in due course. Just like the dilemmas of T20Is, Indian coach Rahul Dravid will have a lot on his plate but for now, his understudy VVS Laxman also needs to do a tight rope walking as far as this series is concerned. Dhawan will be close to 38 during next year’s World Cup and in ODIs in the last two years, he has scored nearly 1000 runs. This is the only international format he plays. Since T20 got more precedence, his appearances has been pretty sporadic. But to put things in perspective, both Kohli and Rohit have played one third of the ODIs that Dhawan played as they concentrated more on Tests and T20Is with World Test Championship and back-to-back T20 World Cups lined up. In the meantime, Shubman Gill has shown his prowess as an ODI opener in a dozen of games he has played so far with an average of 57 plus and a strike-rate of 100 plus. But even in this format, Dhawan has been a cautious starter in Powerplays and then picked up pace. Team’s philosophy will be the main thing along with a decision whether the Delhi southpaw would be persisted for next one year with Rohit, Rahul and Gill also there. Rahul, in ODIs, has started batting down the order at times and Shreyas Iyer has been one of India’s consistent ODI players despite his problems with short ball. Suryakumar Yadav, who is in the form of his life can’t be dropped from the middle-order if he is fit to play. Sanju Samson, the phenomenal talent from Kerala, with his wide range of strokes can’t be ignored for a long time either and Deepak Hooda brings his all-round skills to the table. BOWLING ATTACK FOR 3 ODIS Coming back to the series, there are three 50-over games in a space of five days and fast bowlers’ recovery period will be paramount. Deepak Chahar is expected to start and is likely to have the seasoned Shardul Thakur for company since both offer decent batting option lower down the order. Arshdeep Singh is likely to be the third option but he has been constantly playing so there could be a chance to check out a Kuldeep Sen or an Umran Malik. The flip side is short ground. There is every chance that their pace could become a disadvantage. Washington Sundar is also likely to be in playing XI and due to the short dimensions of Eden Park ground, with its awkward angles, Dhawan might prefer an extra pacer instead of an extra spinner. —PTI New Zealand’s core for the series is more or less same like the T20s. With swing bowler Tim Southee, tearaway quicks Adam Milne, Lockie Ferguson, Matt Henry and spinner Mitchell Santner in its raks, the home teams’ attack looks formidable on paper. Add to it all-rounders Daryl Mitchell and Jimmy Neesham, who are more than decent with capability of bowling full 10 overs by themselves, the attack wears even a more menacing look. SQUADS: INDIA: Shikhar Dhawan (captain), Shubman Gill, Suryakumar Yadav, Shreyas Iyer, Rishabh Pant (wk), Sanju Samson (wk), Deepak Hooda, Shahbaz Ahmed, Washington Sundar, Kuldeep Yadav, Yuzvendra Chahal, Deepak Chahar, Arshdeep Singh, Shardul Thakur, Kuldeep Sen, Umran Malik. PTI India vs New Zealand: Eye on 2023 World Cup, India start 50-over auditions under temporary leader Dhawan added by Press Trust of India on 12:14 am November 25, 2022 View all posts by Press Trust of India → Press Trust of India Facebook Twitter WhatsApp Email Print Related","pubDate":"2022-11-24 18:44:40","image_url":null,"source_id":"kashmirreader","country":["india"],"category":["sports"],"language":"english"},{"title":"India begin World Cup preparation in New Zealand","link":"https://thenorthlines.com/india-begin-world-cup-preparation-in-new-zealand/","keywords":["Sports"],"creator":["Northlines"],"video_url":null,"description":"India skipper Shikhar Dhawan views the One-day series against New Zealand as part of their preparation for the home World Cup next year but rival captain Kane Williamson preferred to stay in the present on Thursday. India were eliminated in the semi-finals of the 20-overs World Cup in Australia earlier this month but prevailed in […] The post India begin World Cup preparation in New Zealand appeared first on Northlines.","content":"India skipper Shikhar Dhawan views the One-day series against New Zealand as part of their preparation for the home World Cup next year but rival captain Kane Williamson preferred to stay in the present on Thursday. India were eliminated in the semi-finals of the 20-overs World Cup in Australia earlier this month but prevailed in the T20 series against New Zealand. The importance of the three-match ODI series against New Zealand was not lost on Dhawan, who is leading an India side bereft of senior batters, including regular captain Rohit Sharma. “It’s a good exposure for the young boys to come and play in New Zealand and test their skills and characters in different conditions,” Dhawan told reporters on the eve of the first ODI in Auckland on Friday. “This is about preparing for the World Cup. The young boys have been doing well, which is great to watch. The World Cup is still far, but we have a fair idea about the players.” It is particularly an important year for Dhawan who plays only the 50-overs format for India though he has been appointed Punjab Kings captain for next year’s Indian Premier League. The left-handed opener, however, is at peace being a single-format international player. “I see it as blessing, because I get to do other stuff as well,” the 36-year-old explained. “I stay lot more fresh and feeling stronger than when I played all three formats.” For Williamson, the immediate target was to win the series against India. “After a large volume of T20 cricket and the World Cup, naturally the focus shifts to the next one and that is the (global) ODI tournament,” the 32-year-old said. “(I’m) reluctant to call it preparation, it’s very much focusing on the series at hand and the cricket we want to play.” “So focusing on what’s in front of us but no doubt there’s lot more one-day cricket coming up.” Match Starts: 07am IST Where to watch India’s tour of New Zealand: Amazon Prime Video will broadcast the three T20Is and three ODIs between India and New Zealand. There is no private TV broadcaster for the series.","pubDate":"2022-11-24 18:12:26","image_url":null,"source_id":"thenorthlines","country":["india"],"category":["sports"],"language":"english"},{"title":"India vs Bangladesh 2022: Best Predicted Playing 11 for Test Series - AK4TSay1 Cricalytics","link":"https://news.google.com/__i/rss/rd/articles/CBMiXGh0dHBzOi8vd3d3LmFrNHRzYXkxLmNvbS9pbmRpYS12cy1iYW5nbGFkZXNoLTIwMjItYmVzdC1wcmVkaWN0ZWQtcGxheWluZy0xMS1mb3ItdGVzdC1zZXJpZXMv0gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"India vs Bangladesh 2022: Best Predicted Playing 11 for Test Series  AK4TSay1 CricalyticsSPN bags TV rights for India tour of Bangladesh 2022  Exchange4MediaIndia Tour Of Bangladesh 2022 Schedule, Fixture, Squad, Players, Live Score, Live Streaming & Telecast  ICC CRICKET SCHEDULEIndia tour of Bangladesh: Sony Sports release promo for India vs Bangladesh series- Check out  InsideSportIndia Tour Of Bangladesh 2022: IND vs BAN, Complete Squad, Schedule, Venue, Country-Wise Live Streaming  KhelTalkView Full coverage on Google News","content":null,"pubDate":"2022-11-24 17:52:53","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"BBL: ट्रक ड्राइविंग करती है ऑस्ट्रेलिया की ये क्रिकेटर, बिग बैश लीग में रहा है अच्छा रिकॉर्ड","link":"https://www.abplive.com/sports/cricket/bbl-sammy-jo-johnson-australian-women-cricketer-who-drives-truck-as-her-second-job-2266805","keywords":null,"creator":["ABP Live"],"video_url":null,"description":"Sammy-Jo Johnson BBL: सैमी जो जॉनसन ऑस्ट्रेलियाई क्रिकेट का एक ऐसा नाम है जो फिलहाल क्रिकेट खेलने की बजाय मैदान के बाहर की चीजों को लेकर चर्चा में है. महिला क्रिकेटर जॉनसन क्रिकेट खेलने की बजाए ट्रक चलाने को लेकर काफी चर्चा में है. हाल ही में महिला बिग बैश लीग में खेलने वाली जॉनसन को ट्रक चलाते हुए देखा गया और यह जानकारी सामने आई है कि जब वह क्रिकेट नहीं खेल रही होती हैं तो ट्रक ही चलाती हुई दिखती हैं. जॉनसन जिस कंपनी में ट्रक चलाती हैं वहां केवल 2 महिला ड्राइवर ही हैं लेकिन वह चाहती हैं कि अधिक से अधिक महिलाएं इस पेशे में आएं और इसका आनंद लें. इस बार के बिग बैश लीग में जॉनसन का प्रदर्शन कुछ खास नहीं रहा था लेकिन वह वापस अपने दूसरे पेशे पर आकर काफी खुश हैं. उन्होंने इस काम को काफी सुखद बताया है. जॉनसन का मानना है कि ट्रक ड्राइवर होने का सबसे बड़ा फायदा यह है कि जब आप सुबह निकलते हैं तो आपको यह नहीं पता होता है कि आपकी यात्रा कहां समाप्त होने वाली है. बिग बैश में अच्छा रहा है प्रदर्शन जॉनसन महिला बिग बैश लीग में पहले सीजन से ही हिस्सा लेती आ रही हैं और इस टूर्नामेंट में उनका रिकॉर्ड काफी प्रभावी रहा है. उन्होंने अब तक इस टूर्नामेंट में 104 मैचों में 94 विकेट हासिल किए हैं और इस दौरान उनकी इकॉनमी 7 से कम की रही है. यदि टूर्नामेंट में सबसे अधिक विकेट लेने वाले गेंदबाजों की बात की जाए तो इस सूची में जॉनसन दसवें स्थान पर मौजूद हैं. इसके अलावा उन्होंने टूर्नामेंट में 805 रन भी बनाए हैं. Something that has been keeping me pre occupied outside of cricket. Hoping a few more females step outside their comfort zone and give it a go. The old boy would be pumped I'm giving it a crack! Thanks @thunderbbl & @cricketnsw for supporting me pursue stuff outside of cricket. pic.twitter.com/mOCKhp2ao6 — Sammy-Jo Johnson (@SammyJoJohnson2) November 23, 2022 यह भी पढ़ें: IND vs BAN: भारत के खिलाफ वनडे सीरीज के लिए बांग्लादेश ने घोषित की टीम, शाकिब अल हसन की वापसी","content":null,"pubDate":"2022-11-24 17:09:43","image_url":null,"source_id":"abplive","country":["india"],"category":["sports"],"language":"hindi"},{"title":"Dhawan opens up about Sanju Samson’s chances in the playing XI","link":"https://thenewsglory.com/dhawan-opens-up-about-sanju-samsons-chances-in-the-playing-xi/","keywords":["Sports","Cricket","Dhawan","India","Sanju Samson","Shikhar Dhawan"],"creator":["The News Glory"],"video_url":null,"description":"Captain Shikhar Dhawan has shared his opinion on Sanju Samson’s chances in the Indian playing XI. Dhawan will lead the Indian team in the ODI series against New Zealand. The Indian cricket team is playing a cricket series on tour in New Zealand. Both the teams played in T20 series recently. India won the series. […]","content":"Captain Shikhar Dhawan has shared his opinion on Sanju Samson’s chances in the Indian playing XI. Dhawan will lead the Indian team in the ODI series against New Zealand. The Indian cricket team is playing a cricket series on tour in New Zealand. Both the teams played in T20 series recently. India won the series. In this situation, the 3-match ODI series will start tomorrow. Dhawan has said this in this context. “I know most of the players have gone through that tough phase in their career where they have played well in the last few series and don’t get a chance in the playing XI. Sanju Samson is there now. The coaches and captain should talk to the players. Only then will players like Sanju get a clear understanding of why they were not picked in the team. Basically, this is a decision made for the benefit of the team. The playing eleven can be determined depending on the team’s combination,” said Dhawan. Sanju Samson made his debut in the Indian team in 2015. So far he has played a total of 10 ODIs and 16 T20Is. This wicket keeper batsman from Kerala has scored 294 runs in ODI cricket and 296 runs in T20 cricket.","pubDate":"2022-11-24 16:37:09","image_url":null,"source_id":"thenewsglory","country":["india"],"category":["sports"],"language":"english"},{"title":"LIVE | India vs New Zealand Updates, 1st ODI: Sanju Samson or Rishabh Pant - Who Gets PICKED? - India.com","link":"https://news.google.com/__i/rss/rd/articles/CBMi7gFodHRwczovL3d3dy5pbmRpYS5jb20vc3BvcnRzL2luZGlhLXZzLW5ldy16ZWFsYW5kLTFzdC1vZGktbGl2ZS11cGRhdGVzLWVkZW4tcGFyay1hdWNrbGFuZC13ZWF0aGVyLXJhaW4tbm92LTI1LWZyaS1pbmQtdnMtbnotbGl2ZS1zdHJlYW1pbmctYW1hem9uLXByaW1lLXZpZGVvLXRvc3Mtc3RhcnQtdGltZS1wbGF5aW5nLXhpLXNoaWtoYXItZGhhd2FuLXN1cnlha3VtYXItdW1yYW4tY3JpY2tldC1uZXdzLTU3NjM0MTcv0gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"LIVE | India vs New Zealand Updates, 1st ODI: Sanju Samson or Rishabh Pant - Who Gets PICKED?  India.comIND vs NZ Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update-  Cricket AddictorNew Zealand seek Super League boost against Dhawan-led India | Cricbuzz.com - Cricbuzz  Cricbuzz`I will take a decision that will...`, Captain Shikhar Dhawan makes a BIG statement ahead of IND vs NZ ODI...  Zee NewsMatch Preview - New Zealand vs India, India in New Zealand 2022/23, 1st ODI  ESPNcricinfoView Full coverage on Google News","content":null,"pubDate":"2022-11-24 16:33:00","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Archer keeps eyes on next year's Ashes","link":"https://thewest.com.au/sport/cricket/archer-keeps-eyes-on-next-years-ashes-c-8962172","keywords":null,"creator":["Staff Writers"],"video_url":null,"description":"England paceman Jofra Archer has said he does not plan to bow out of Test cricket with a home Ashes series against Australia on the horizon.","content":null,"pubDate":"2022-11-24 16:02:21","image_url":"https://images.thewest.com.au/publication/C-8962172/b12dee8426a0114ceaf5459b913e8fab80b9d9a4-16x9-x0y0w1280h720.jpg","source_id":"thewest","country":["australia"],"category":["sports"],"language":"english"},{"title":"Do you forget? Sachin Magic bowled the last over in the 1993 Hero Cup semi-final on this same day","link":"https://thenewsglory.com/do-you-forget-sachin-magic-bowled-the-last-over-in-the-1993-hero-cup-semi-final-on-this-same-day/","keywords":["Sports","Cricket","game","India","sachin tendulkar"],"creator":["The News Glory"],"video_url":null,"description":"The unforgettable victories of the Indian team in the game of cricket will remain forever etched in the hearts of many fans. One of the memorable victories of the Indian team is the semi-final match of the Hero Cup series held in 1993. Sachin bowled the last over in that match and did magic. India […]","content":"The unforgettable victories of the Indian team in the game of cricket will remain forever etched in the hearts of many fans. One of the memorable victories of the Indian team is the semi-final match of the Hero Cup series held in 1993. Sachin bowled the last over in that match and did magic. India had tasted that victory on this same day. Let’s rewind it a bit. India, Sri Lanka, South Africa, West Indies and Zimbabwe participated in the ODI cricket series in India in 1993 to mark the Diamond Jubilee of the Cricket Association of Bengal. Pakistan pulled out of the series at the last moment. West Indies, South Africa, India and Sri Lanka occupied the top four spots in the league. India and South Africa cricket teams played the first semi-final match. The match was held on the same day (November 24). Batting first at Eden Gardens, India scored 195 runs in 50 overs. South Africa chased down the target of 196 runs. The team needed 6 runs to win in the last over. Then the captain of the Indian team, Azharuddin, asked Sachin to throw the ball. Sachin did not bowl a single over in that match till then. But he bowled very accurately and conceded only 3 runs in that over. With that, the Indian team won by 2 runs and progressed to the final. The Indian team won the championship title in this series. WATCH: Tendulkar with the Golden Arm! #OnThisDay in 1993 at Eden Gardens, Kolkata, @sachin_rt bowled the last over of the match when South Africa required 6 runs to win at Eden Gardens in the Hero Cup Semi-final. The Rest is History! pic.twitter.com/iUrq14RSaa","pubDate":"2022-11-24 15:36:10","image_url":null,"source_id":"thenewsglory","country":["india"],"category":["sports"],"language":"english"},{"title":"Inside Qatar’s ‘other’ fan zone: a night watching football with Qatar’s migrant workers","link":"https://www.theguardian.com/global-development/2022/nov/24/inside-qatars-other-fan-zone-a-night-watching-football-with-qatars-migrant-workers","keywords":["World Cup 2022","World Cup","Qatar","Middle East and north Africa","World news","Global development"],"creator":["Pete Pattisson in Doha"],"video_url":null,"description":"Unable to go to the stadiums they helped build, hundreds of migrant workers gather in a cricket stadium in the desert outside Doha to celebrate the beautiful gameIt has the big screen, the pumping music and the Fifa branding, but this is a fan zone with a difference. There are no visiting supporters, no women, no team colours and certainly no beer. The clue is in the venue: a cricket stadium on the edge of Doha. Inside, thousands of mostly south Asian low-wage labourers, fill the stands or sit cross-legged on the grassy outfield.It is a world away from the polished face of Doha that most fans will see. The stadium fan zone is within Asian Town, a shopping and entertainment complex purpose-built for Qatar’s migrant workers about 30 minutes by car from the city centre. A vast expanse of warehouses, workshops and accommodation blocks stretches out for miles on one side, housing hundreds of thousands of workers, often in grim, crowded dorms. Continue reading...","content":null,"pubDate":"2022-11-24 14:57:42","image_url":"https://i.guim.co.uk/img/media/82d88a045ec6f17facc320daa575095a2baa3624/0_0_3500_2100/master/3500.jpg?width=460&quality=85&auto=format&fit=max&s=50f3deec120f18cc130fcf77322017fc","source_id":"theguardian","country":["united kingdom","india","singapore","canada"],"category":["sports"],"language":"english"},{"title":"IND vs NZ Dream11 Team Prediction, Match Preview, Fantasy Cricket Hints: Captain, Probable Playing 11s, Team News; Injury Updates For Today’s IND vs NZ 1st ODI match in Napier, 7 AM IST, November 25","link":"https://zeenews.india.com/cricket/ind-vs-nz-dream11-team-prediction-match-preview-fantasy-cricket-hints-captain-probable-playing-11s-team-news-injury-updates-for-today-s-ind-vs-nz-1st-odi-match-in-napier-7-am-ist-november-25-2539702.html","keywords":null,"creator":null,"video_url":null,"description":"India vs New Zealand Dream11 Team Prediction India vs New Zealand 1st ODI match Preview - Check My Dream11 Team, Best players list of IND vs NZ, India Dream11 Team Player List, New Zealand Dream11 Team Player List, Dream11 Guru Tips, Fantasy Cricket Tips, Fantasy Cricket Tips, Fantasy Playing Tips.","content":null,"pubDate":"2022-11-24 14:37:00","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"McGrath: I fear for future of ODIs","link":"https://thewest.com.au/sport/cricket/mcgrath-i-fear-for-future-of-odis-c-8961807","keywords":null,"creator":["Staff Writers"],"video_url":null,"description":"Australia great Glenn McGrath has warned that ODI cricket risks being squeezed out of the calendar after the dismal MCG turnout for England's recent match.","content":null,"pubDate":"2022-11-24 14:28:49","image_url":"https://images.thewest.com.au/publication/C-8961807/f0d69039fe4675a9abde0f79d82e2277118476ce-16x9-x0y0w1280h720.jpg","source_id":"thewest","country":["australia"],"category":["sports"],"language":"english"},{"title":"Jofra Archer determined to keep playing Test cricket for England","link":"https://www.belfasttelegraph.co.uk/sport/cricket/jofra-archer-determined-to-keep-playing-test-cricket-for-england-42170666.html","keywords":["Cricket"],"creator":null,"video_url":null,"description":"Jofra Archer insists he has no desire to leave Test cricket behind, with England planning a phased return to competitive action that builds towards next summer’s Ashes.","content":null,"pubDate":"2022-11-24 14:21:17","image_url":"https://www.belfasttelegraph.co.uk/sport/cricket/0a656/42170663.ece/AUTOCROP/w1240h700/bpanews_b75ac3f0-4118-45f3-ba51-04086d160605_1","source_id":"belfasttelegraph","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Jofra Archer targeting World Cup as he makes return from injury | 'This is a big year' - Sky Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMiiAFodHRwczovL3d3dy5za3lzcG9ydHMuY29tL2NyaWNrZXQvbmV3cy8xMjEyMy8xMjc1NDI5Ni9qb2ZyYS1hcmNoZXItdGFyZ2V0aW5nLXdvcmxkLWN1cC1hcy1oZS1tYWtlcy1yZXR1cm4tZnJvbS1pbmp1cnktdGhpcy1pcy1hLWJpZy15ZWFy0gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Jofra Archer targeting World Cup as he makes return from injury | 'This is a big year'  Sky SportsJofra Archer on return to England action: 'A small day but a big day'  ESPNcricinfoJofra Archer: 'I want to play all formats, all year round'  The TelegraphJofra Archer determined to keep playing Test cricket for England  Lancashire TelegraphJofra Archer: I'm fully back – now I want to play in the Ashes  The TimesView Full coverage on Google News","content":null,"pubDate":"2022-11-24 14:15:04","image_url":null,"source_id":"google","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Sri Lanka recall Lakshan, Rajitha, Kumara for Afghanistan ODIs - ESPNcricinfo","link":"https://news.google.com/__i/rss/rd/articles/CBMijgFodHRwczovL3d3dy5lc3BuY3JpY2luZm8uY29tL3N0b3J5L3NsLXZzLWFmZy0yMDIyLXNyaS1sYW5rYS1yZWNhbGwtZGhhbmFuamF5YS1sYWtzaGFuLWthc3VuLXJhaml0aGEtbGFoaXJ1LWt1bWFyYS1mb3ItYWZnaGFuaXN0YW4tb2Rpcy0xMzQ2MjE50gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Sri Lanka recall Lakshan, Rajitha, Kumara for Afghanistan ODIs  ESPNcricinfoRajapaksa opts for break from ODI cricket as Sri Lanka announce squad for Afghanistan series  ICC CricketSri Lanka, Afghanistan jostle for vital Super League points | Cricbuzz.com - Cricbuzz  CricbuzzSri Lanka need all the Super League points they can get, as Afghanistan ODIs kick off  ESPNcricinfoSL vs AFG Match Prediction- Who will win today's match between Sri Lanka vs Afghanistan?  CricTrackerView Full coverage on Google News","content":null,"pubDate":"2022-11-24 14:00:48","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Pakistan’s two rookie bowlers coming to threaten the England team in Test cricket!","link":"https://thenewsglory.com/pakistans-two-rookie-bowlers-coming-to-threaten-the-england-team-in-test-cricket/","keywords":["Sports","Abrar Ahmed","Bowlers","Cricket","England","Mystery Spinner","online special","Pakistan","Pakistan Cricket Board"],"creator":["The News Glory"],"video_url":null,"description":"England cricket team is going to tour Pakistan to play Test cricket series. Pakistan Cricket Board announced the squad for this series. Fast bowler Muhammad Ali and spinner Abrar Ahmed have also been included in this. It seems that both these rookie bowlers will threaten the England team. The path they both took… Muhammad Ali: […]","content":"England cricket team is going to tour Pakistan to play Test cricket series. Pakistan Cricket Board announced the squad for this series. Fast bowler Muhammad Ali and spinner Abrar Ahmed have also been included in this. It seems that both these rookie bowlers will threaten the England team. The path they both took… Muhammad Ali: He was first picked by former Pakistan leg-spinner Abdul Qadir to play for Zarai Tarakiati Bank in 2018. In other words, there were suggestions from the Sialkot cricket community to select fast bowler Mohammad Ali. Their recommendation also added strength as he trained at the Amir Wasim Cricket Academy. He was only 26 years old then. But he has the ability to make an immediate impact on the game with his bowling ability. He has performed it on that occasion. He and current Pakistan fast bowler Naseem Shah have played together in the PCB Patron Trophy. Muhammad Ali’s bowling style is reminiscent of former Australian fast bowler Jason Gillespie. Can throw accurately. He pitches the seam of the ball and throws it in a way that makes the ball soar. He has the power to bowl up to 25 overs per day. He is currently playing for Central Punjab in domestic cricket. He has taken 85 wickets in 22 first-class cricket matches. What… in 4 years you may ask, 85 wickets in 22 matches is a big deal if you understand that Pakistan’s dead pitches are the graveyard of fast bowlers. He has taken 27 wickets in 11 innings at Rawal Bindi pitch and 20 wickets at Multan. England will now play Tests at these two venues. Abrar Ahmed: Although officially known as a leg-spinner, he is capable of bowling googly and carom balls. Sri Lanka’s Mahesh Thiksana is another mystery spinner who bowls leg spin, off spin and carom balls with variety. This is confirmed by news from that country. His hard spin on the ball has attracted the attention of Karachi cricket fans. Karachi is the weakest cricket zone in Pakistan. But coming from there, he grabbed 53 wickets in 2016 and attracted attention. His bowling evolved at the Rashid Latif Academy. His name came to light in Pakistan Super League T20 cricket for Karachi Kings. He bowled 7 dot balls to Eoin Morgan was a talking point. It is noteworthy that Eoin Morgan scored 80 runs in 57 balls in this match. But he could not do anything about Abrar Ahmed. Sri Lankan legends Jayawardene and Sangakkara were shocked to see his bowling. His coach Masroor says about him, “A player capable of playing in all formats. Because he knows the art of taking wickets. He bowls a variety of balls and chokes. He is sure to be Pakistan’s main bowler. The Test series between England and Pakistan will be played from December 1 to December 21. It includes a total of 3 matches.","pubDate":"2022-11-24 13:34:11","image_url":null,"source_id":"thenewsglory","country":["india"],"category":["sports"],"language":"english"},{"title":"हार्दिक पंड्या की कप्तानी पर साथी बल्लेबाज का बड़ा बयान, बताया टीम इंडिया को T20 क्रिकेट में कैसे मिलेगा फायदा?","link":"https://hindi.news18.com/news/sports/cricket-david-miller-gave-a-big-statement-on-captaincy-of-hardik-pandya-how-team-india-will-get-benefit-in-t20-cricket-4950479.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"T20 cricket in India: हार्दिक पंड्या की कप्तानी में हाल में टीम इंडिया ने न्यूजीलैंड के खिलाफ टी20 सीरीज जीती है. हार्दिक खुद भी फुल टाइम कप्तान बनने की इच्छा इशारों-इशारों जाहिर कर चुके हैं. साथ ही वह कप्तानी मिलने पर क्या करेंगे, इसका अपना फ्यूचर प्लान भी बता चुके हैं कि वह टीम इंडिया को किस तरह से लीड करेंगे.","content":null,"pubDate":"2022-11-24 13:16:18","image_url":"https://images.news18.com/ibnkhabar/uploads/2022/11/hardik-pandya-captain-16691385403x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","country":["india"],"category":["sports"],"language":"hindi"},{"title":"Glenn McGrath concerned over ODI cricket’s future after seeing almost-empty MCG","link":"https://uk.sports.yahoo.com/news/glenn-mcgrath-concerned-over-odi-122441288.html?src=rss","keywords":null,"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2022-11-24 12:24:41","image_url":null,"source_id":"yahoo","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"'Back at it': Virat Kohli shares intense workout video ahead of Bangladesh tour","link":"https://www.firstpost.com/firstcricket/sports-news/back-at-it-virat-kohli-shares-intense-workout-video-ahead-of-bangladesh-tour-11689111.html","keywords":["First Cricket News"],"creator":["FP Trending"],"video_url":null,"description":"'Back at it': Virat Kohli shares intense workout video ahead of Bangladesh tour","content":"India were one of the top contenders for the T20 World Cup in Australia but failed to fulfil their dream of lifting the tournament trophy for the second time.One positive to take away from the marquee event was Virat Kohli’s form. The star batter, who made a smashing comeback during the 2022 Asia Cup, continued his brilliant run at the T20 World Cup. Kohli emerged as the highest run-scorer in the competition, with 296 runs in six games.While the right-handed batter has been rested for India’s ongoing tour of New Zealand, Kohli looks to be in no mood to take things slow. The ex-India skipper shared a video of his intense workout session ahead of the India-Bangladesh series.In the video, Kohli can be seen running on a treadmill and strengthening his back muscles on the cable machine. The star batter captioned the clip: “Back at it”. He also used the hashtag VKCAM, indicating that it was a self-shot video.Watch: View this post on Instagram A post shared by Virat Kohli (@virat.kohli) Kohli seems to be in no mood for slacking off as this clip indicates. Since his return to form, the star batter is keen to ensure that he remains at the top of his game.In Australia, Kohli proved that he is still one of the greatest batters of the era from the first fixture itself, when he scored 82 against Pakistan in a high-pressure situation. His innings was pivotal in India’s victory over their arch-rivals.The star batter followed it up with half centuries against Netherlands, Bangladesh and England. Unfortunately, India were knocked out of the World Cup after a 10-wicket loss against the Joss Buttler-led unit.Following the defeat, Virat Kohli had posted a long note on Instagram talking about his experience of playing in the T20 World Cup. In the note, he acknowledged his disappointment at not winning the tournament, and thanked his fans for their support.Check the post here: View this post on Instagram A post shared by Virat Kohli (@virat.kohli) “We leave Australian shores short of achieving our dream and with disappointment in our hearts but we can take back a lot of memorable moments as a group and aim to get better from here on. Thank you to all our fans who turned up in huge numbers throughout to support us in the stadiums. Always feel proud to wear this jersey and represent our country,” Kohli wrote.Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-11-24 12:14:53","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/11/Virat-Kohli-640_AP.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"'Change that word to coward': Justin Langer lashes out at Cricket Australia for running campaigns against him","link":"https://www.dnaindia.com/cricket/report-change-that-word-to-coward-justin-langer-lashes-out-at-cricket-australia-for-running-campaigns-against-him-3005195","keywords":["Sports","Cricket"],"creator":["DNA Web Team"],"video_url":null,"description":"The 52-year-old resigned in February after failing to obtain the public backing of key players and bitter contract negotiations with Cricket Australia","content":null,"pubDate":"2022-11-24 12:13:00","image_url":null,"source_id":"dnaindia","country":["india"],"category":["sports"],"language":"english"},{"title":"Williamson: Guptill will be missed but he has not retired - ESPNcricinfo","link":"https://news.google.com/__i/rss/rd/articles/CBMifmh0dHBzOi8vd3d3LmVzcG5jcmljaW5mby5jb20vc3RvcnkvbnotdnMtaW5kLTIwMjIta2FuZS13aWxsaWFtc29uLW1hcnRpbi1ndXB0aWxsLXdpbGwtYmUtbWlzc2VkLWJ1dC1oZS1oYXMtbm90LXJldGlyZWQtMTM0NjE0N9IBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Williamson: Guptill will be missed but he has not retired  ESPNcricinfo'He's exploring other options while still being available' - Kane Williamson denies Martin Guptill's retirement talks  CricTrackerMartin Guptill will be missed but he has not retired, says Kane Williamson after opener gives up central contract  India TodayIND vs NZ: “He's Made A Decision To Explore A Few Other Options\": Kane Williamson Said On Martin  Cricket AddictorMartin Guptill released from New Zealand central contract  The CricketerView Full coverage on Google News","content":null,"pubDate":"2022-11-24 12:04:38","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Hardik’s leadership skills can immensely help India in T20 cricket: David Miller","link":"https://www.orissapost.com/hardiks-leadership-skills-can-immensely-help-india-in-t20-cricket-david-miller/","keywords":["Sports","David Miller","Hardik Pandya"],"creator":["Post News Network"],"video_url":null,"description":"Abu Dhabi: South Africa’s go-to man in pressure situations, David Miller believes that as captain Hardik Pandya can infuse much-needed fearlessness into India’s T20 set-up with his exemplary clarity of mind and work ethic. Hardik is seen as the leader of the Indian team at the 2024 T20 World Cup with current skipper Rohit Sharma […]","content":"Hardik’s leadership skills can immensely help India in T20 cricket: David Miller IANS Updated: November 24th, 2022, 17:32 IST in Sports 0 The South African said that it is not just with his bowling, but Ashwin has also chipped in with useful contributions with the bat putting the team in good positions. Share on Facebook Share on Twitter Share on WhatsApp Share on Linkedin Abu Dhabi: South Africa’s go-to man in pressure situations, David Miller believes that as captain Hardik Pandya can infuse much-needed fearlessness into India’s T20 set-up with his exemplary clarity of mind and work ethic. Hardik is seen as the leader of the Indian team at the 2024 T20 World Cup with current skipper Rohit Sharma not expected to carry on in the shortest format for another two years. Miller, who has finally realised his rich potential and became one of the best finishers in the game over the last couple of years, said Hardik had played a crucial role in steering Gujarat Titans to the title on their IPL debut. “Just playing under him in the IPL, I feel he is a natural leader, People follow him. He allows you to play the way that you feel like you can. He is very inclusive as a leader, he wants everyone to be close to each other,” the South African said. “At the same time, he is clear with discipline. He has got a lot of good attributes of a leader. “In IPL he got better and better as the season progressed and I see him doing that (with the Indian team as well),” Miller told PTI on the sidelines of Abu Dhabi T10 League. India are in desperate need for a change in mindset, especially in the powerplay. Can Hardik effect that change and let the players not worry about fear of failure? “Yes. He will make the players a lot better in the mindset. 100 percent. He allows the guys to do what they want to do which is important,” said Miller, who was on Thursday named vice-captain of US-based T10 franchise Morrisville Samp Army. With so much cricket taking place around the world, a modern-day cricketer like Miller might not find time to reflect on his past mistakes. However, the southpaw spent a lot of time thinking about South Africa’s sudden elimination from the T20 World Cup in Australia. Having beaten India in their group, South Africa were looking strong but an unexpected loss to the Netherlands ended in another heartbreak for the perennial underachievers in international cricket. “Yes I did (reflect on the loss). Sometimes it is difficult to process things like that. At end of the day, I still feel we were one of the stronger teams in the competition. “There were many other upsets as well, it was not only us. It comes down to the last game and unfortunately for us, we needed to win and we couldn’t. That is the beauty and humility of cricket. Obviously very disappointed with that result,” he said. South Africa had hope against the Netherlands in the run chase as long as Miller was around but he fell to a stunning catch from Roelof van de Merwe, who once played for the Proteas. “I was hoping he would drop it. I was looking at the ball every second and it was coming up and down in the air and he managed to take a great catch. It is disappointing to finish like that but also the joys of World Cup,” Miller said. “You see different teams coming in and minor teams competing against major teams.” No target is insurmountable when Miller is in the middle. However, he has only built that reputation in the last couple of years, having made his international debut way back in 2010. Miller made a lot of mistakes along the way but managed to learn from them, resulting in remarkable consistency. “I have been playing for a long time now, I don’t want to say I know it all because I don’t at all. Still lots to learn but I have been playing professional cricket for 14 years (including first class debut). I have made a lot of mistakes in my life in my journey of cricket. “If you are not learning from mistakes you are not getting better. I am trying to implement that especially in pressure situations. When the pressure is there you are obviously making more mistakes,” he said. “But if you have the experience of playing in pressure you tend to think a lot clearer about requirement of the team and what you need to do and are not irrational. The way I think and the confidence that I have, I feel I can finish a game from any situation. That is probably the reason for consistency,” Miller said. On the T10 format, he added: “It is short, it is sharp, it is fast and it is exciting. You can play quite a few games in one day. It is more exciting than T20 in a sense that it is quicker. It has its challenges as well like every other format.” Tags: David Miller Hardik Pandya Share Tweet Send Share Suggest A Correction Enter your email to get our daily news in your inbox. Leave this field empty if you're human: Related Posts Embolo scores, Switzerland beat Cameroon 1-0 at World Cup November 24, 2022 It didn’t hurt me: Shikhar Dhawan after captaincy was taken away for Zimbabwe tour November 24, 2022 ISL: Fresh off thrilling wins, Odisha and Chennaiyin FC look to set the pace November 24, 2022 Japan gets 2 late goals to beat Germany 2-1 at World Cup November 23, 2022 Naveen buys first ticket of Hockey World Cup 2023 November 23, 2022 Senegal’s Kouyate to miss World Cup game against Qatar November 23, 2022 Leave a Reply Cancel reply Your email address will not be published. Required fields are marked * Comment Name * Email * Website Save my name, email, and website in this browser for the next time I comment.","pubDate":"2022-11-24 12:02:29","image_url":"https://www.orissapost.com/wp-content/uploads/2019/04/David-Miller-300x169.jpg","source_id":"orissapost","country":["india"],"category":["sports"],"language":"english"},{"title":"Abu Dhabi T10 2022: Match 3, MSA vs BT Match Prediction: Who will win today's T10 League match? - CricTracker","link":"https://news.google.com/__i/rss/rd/articles/CBMimAFodHRwczovL3d3dy5jcmljdHJhY2tlci5jb20vY3JpY2tldC1tYXRjaC1wcmVkaWN0aW9ucy9hYnUtZGhhYmktdDEwLTIwMjItbWF0Y2gtMy1tc2EtdnMtYnQtbWF0Y2gtcHJlZGljdGlvbi13aG8td2lsbC13aW4tdG9kYXlzLW1hdGNoLWJldHdlZW4tbXNhLXZzLWJ0L9IBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Abu Dhabi T10 2022: Match 3, MSA vs BT Match Prediction: Who will win today's T10 League match?  CricTrackerMSA vs BT Prediction – Who Will Win Today’s Match Between Morrisville Samp Army And Bangla Tigers? Abu Dhabi  Cricket AddictorAbu Dhabi T10 League 2022 - Fantasy Cricket Predictions and Betting Tips: All matches, 24th Nov  Cricket WorldBangla Tigers vs The Chennai Braves Live Streaming: When and Where to Watch Abu Dhabi T10 League 2022 Match  News18Abu Dhabi T10 2022: Match 6, NW vs DG Match Prediction: Who will win today's T10 League match?  CricTrackerView Full coverage on Google News","content":null,"pubDate":"2022-11-24 11:45:00","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Former India U-19 captain Unmukt Chand becomes first Indian to play in Bangladesh Premier League","link":"https://www.tribuneindia.com/news/sports/former-india-u-19-captain-unmukt-chand-becomes-first-indian-to-play-in-bangladesh-premier-league-454303","keywords":null,"creator":null,"video_url":null,"description":"ANI Chattogram (Bangladesh), November 24 Unmukt Chand, the captain of India's 2012 Under-19 World Cup-winning team and the first Indian to play in the BBL, will begin the 2019 Bangladesh Premier League (BPL) season by taking the field for Chattogram Challengers. Chand will become the first Indian to feature in the Bangladesh Premier League. The franchise was desperate to have an Indian player to draw into the fan base in the nation, therefore Chand, now 29 years old, was selected in Dhaka on Wednesday. The former U-19 captain is qualified because he stopped playing any cricket under the BCCI's jurisdiction in September of last year. He is now competing in league cricket in the USA in an effort to make the national squad, which may happen in 2024. Chand, who resides in San Francisco, has also agreed to a multi-year contract with Major League Cricket, which will begin play in the United States in 2023. His first season in the BBL last year was by no means noteworthy; he was only able to play in two games and managed to score 35 runs, with a personal high of 29. Chand, who made his BBL debut during the 2021-22 season, won't be joining the Melbourne Renegades this year, as things stand. Chand must stay in the country for 10 months each year for three years in order to be eligible to represent the USA in 2024. Participating in the BPL, which will only go from January 5 to February 15, won't likely interfere with Chand's prospects of meeting this requirement. However, accepting additional T20 contracts outside of the USA would be difficult. Chand played 67 first-class matches while representing Delhi in the home circuit of India, scoring 3,379 runs at an average of 31.57. In List A cricket, he performed better, scoring 4505 runs at an average of 41.33 in 120 games. He also got 1565 runs at an average of 22.35 and a strike rate of 116.09 in 77 T20s before quitting Indian cricket. He played for Rajasthan Royals, Mumbai Indians, and the IPL's former Delhi Daredevils, currently known as the Delhi Capitals. In total, he played in 21 games and had 300 runs scored in 20 innings, with a high of 58.","content":null,"pubDate":"2022-11-24 11:41:10","image_url":"https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/11/2022_11$largeimg_1792393168.JPG","source_id":"tribuneindia","country":["india"],"category":["sports"],"language":"english"}]}