{"newsArray":[{"title":"Hafeez slams PCB for 'mishandling' Shaheen","link":"https://www.thenews.com.pk/print/987261-hafeez-slams-pcb-for-mishandling-shaheen","keywords":null,"creator":null,"video_url":null,"description":"LAHORE: Former Pakistan captain Mohamamd Hafeez has declared the prolonged injury to key Pkaistan pacer Shaheen Shah Afridi as a criminal act on part of the Pakistan Cricket Board .Hafeez slammed PCB for mishandling Shaheen's injury, stating that he should have been sent for proper treatment when...","content":null,"pubDate":"2022-09-01 01:00:00","image_url":null,"source_id":"thenews","country":["pakistan"],"category":["sports"],"language":"english"},{"title":"De Grandhomme retires from internationals","link":"https://www.thenews.com.pk/print/987257-de-grandhomme-retires-from-internationals","keywords":null,"creator":null,"video_url":null,"description":"WELLINGTON: Colin de Grandhomme on Wednesday became the second New Zealand cricketer after Trent Boult to get a release from his central contract and join Australia’s Big Bash League.New Zealand Cricket bosses lamented the retirement from the Black Caps of the 36-year-old all-rounder after...","content":null,"pubDate":"2022-09-01 01:00:00","image_url":null,"source_id":"thenews","country":["pakistan"],"category":["sports"],"language":"english"},{"title":"'LIV can be the IPL of golf'","link":"https://www.thenews.com.pk/print/987264-liv-can-be-the-ipl-of-golf","keywords":null,"creator":null,"video_url":null,"description":"NEW DELHI: The breakaway LIV series can do for golf what the IPL did for cricket, India´s top player Anirban Lahiri has said after joining the lucrative Saudi-backed tour.The new circuit has sparked a bitter split that threatens to tear golf apart and sparked accusations of \"sportswashing\"...","content":null,"pubDate":"2022-09-01 01:00:00","image_url":null,"source_id":"thenews","country":["pakistan"],"category":["sports"],"language":"english"},{"title":"Australia picks Singapore-born David in T20 World Cup squad","link":"https://sportstar.thehindu.com/cricket/australia-t20-world-cup-squad-david-finch-maxwell-warner-starc-zampa-smith-kane-wc-news/article65834765.ece","keywords":null,"creator":["\n        Reuters  \n    "],"video_url":null,"description":"Singapore-born allrounder Tim David has been named in Australia’s Twenty20 World Cup squad, while leg spinner Mitchell Swepson has been omitted, Cricket Australia said on Thursday.","content":null,"pubDate":"2022-09-01 00:45:37","image_url":null,"source_id":"sportstar","country":["india"],"category":["sports"],"language":"english"},{"title":"Cricket-Australia pick Singapore-born David in T20 World Cup squad","link":"https://www.thestar.com.my/sport/cricket/2022/09/01/cricket-australia-pick-singapore-born-david-in-t20-world-cup-squad","keywords":null,"creator":null,"video_url":null,"description":"(Reuters) - Singapore-born all-rounder Tim David has been named in Australia's Twenty20 World Cup squad, while legspinner Mitchell Swepson has been omitted, Cricket Australia said on Thursday. Read full story","content":"(Reuters) - Singapore-born all-rounder Tim David has been named in Australia's Twenty20 World Cup squad, while legspinner Mitchell Swepson has been omitted, Cricket Australia said on Thursday. T20 specialist David, who was raised in Western Australia, burst into the spotlight in the Pakistan Super League last season and has become hot property as a finishing batsman in global leagues. \"Tim continues to establish himself with some quality performances in leagues around the world, earning a place in the squad,\" selector George Bailey said in a statement. \"He is a highly gifted, natural ball-striker who will add extra batting depth to the group which has had a lot of success in T20 cricket.\" David is the only notable inclusion in the squad for Australia's World Cup defence on home soil starting in October. \"Mitchell Swepson was unlucky to miss out based on conditions in the UAE at the last World Cup where we planned for tired, spinning wickets compared to what we would expect are good batting conditions along with the larger grounds in Australia,\" added Bailey. The Aaron Finch-captained squad will travel to India for three T20 Internationals in September before returning home to play the West Indies, England and India leading into the World Cup. Key batsman David Warner will miss the Indian tour as part of a \"managed period of preparation\", Cricket Australia said, while Cameron Green will join the squad for the Indian T20 Series. Australia T20 World Cup squad: Aaron Finch (capt), David Warner, Mitchell Marsh, Steven Smith, Glenn Maxwell, Marcus Stoinis, Matthew Wade, Tim David, Josh Inglis, Ashton Agar, Mitchell Starc, Pat Cummins, Adam Zampa, Josh Hazlewood, Kane Richardson (Reporting by Ian Ransom in Melbourne; Editing by Stephen Coates)","pubDate":"2022-08-31 23:54:00","image_url":null,"source_id":"thestar_my","country":["malaysia"],"category":["sports"],"language":"english"},{"title":"Australia v Zimbabwe: 2nd ODI highlights","link":"https://www.cairnspost.com.au/sport/cricket/australia-v-zimbabwe-2nd-odi-highlights/video/fd8d37e14ff267972c05c91115591c92","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket: Catch all of the major highlights from Australia's second ODI against Zimbabwe in Townsville.","content":null,"pubDate":"2022-08-31 22:27:20","image_url":null,"source_id":"cairnspost","country":["australia"],"category":["sports"],"language":"english"},{"title":"India vs Hong Kong, Asia Cup 2022: Virat Kohli's fifty, Surya's blitzkrieg and other talking points","link":"https://www.firstpost.com/firstcricket/sports-news/india-vs-hong-kong-asia-cup-2022-virat-kohlis-50-suryas-blitzkrieg-and-other-talking-points-11156761.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"India vs Hong Kong, Asia Cup 2022: Virat Kohli's fifty, Surya's blitzkrieg and other talking points","content":"India expectedly had no trouble defeating minnows Hong Kong in the Group A encounter of the Asia Cup 2022 to qualify for the Super Four stages. This was India’s second win in as many games as the Rohit Sharma-led outfit earlier defeated Pakistan in the opening game.Sent to bat first, Indian batters had a merry time during the lopsided match as they clobbered the hapless Hong Kong bowlers at will to take post a huge 192/2 in 20 overs. To the minnows’ credit, they did managed to go past 150 and played the entire quota of 20 overs against quality Indian bowling.There were plenty of points worth pondering about during the game and Firstpost takes a look at them:Suryakumar Yadav smashes bowlers at willHong Kong bowlers should have felt happy with their efforts midway through the innings as they contained the Indian top-order to mere 70 runs in the first 10 overs. All that changed once Suryakumar Yadav arrived in the 14th over with 94/2 on the board. The 31-year-old batter, who has been in fine form of late, scored a 26-ball 68 to give Indian bowlers a solid total to defend.The highlight of his knock was certainly the final over of his innings as he whacked an inexperienced medium pacer Haroon Arshad for 26 runs. The blitzkrieg included four sixes as he distorted the line and length of the 22-year-old Hongkonger throughout the park.Virat Kohli hits first half-century in T20I since February Surya’s firework overshadowed Virat Kohli’s return to form as the former Indian captain scored a 44-ball 59, laced with three boundaries and a six, for his first half-century since February in T20I. For the record, the last fifty. also his first of the year came against West Indies at the Eden Gardens in Kolkata.By his own high standard, the 33-year-old batter won’t claim it to be his best of innings as the amount of boundaries he hit during his knock. Kohli, in particular, was at discomfort against spinners for a change on a slow Dubai surface and could be a weakness for stronger teams to exploit later in the day.Also, a half-century against a weak Asian side won’t please many skeptics but could give Kohli the rhythm and confidence for the rest of the series.KL Rahul 39-ball 36 pleases fewKL Rahul managed to get some runs out of his bat with a 36-run knock after falling for a first-ball duck against Pakistan in the group opener. However, taking 39 deliveries for the knock and hitting just two sixes meant the opener had to face the ire of the fans and was soon the butt of all jokes on social media.During the last IPL, Rahul’s credential as a T20 batter was questioned as his inability to accelerate after the powerplay did opponents more favour than trouble.Bhuvneshwar Kumar pick among bowlers againIndian senior pacer Bhuvneshwar Kumar has turned his career around since IPL this season. It’s hard to believe the same pacer was struggling to earn the faith of other franchises at the auction earlier this year and could only fetch 4.20 crore against his 2 crore base price.And on Wednesday, the 32-year-old Indian pacer gave away just 15 runs in three overs while picking a wicket. His spell, along with Ravindra Jadeja (1/15) and Yuzvendra Chahal (0/18), never gave Hong Kong a shot at chasing.His spell comes after Bhuvi took 4/26 against Pakistan in the group opener, making him the most reliant pacer of the team.Avesh Khan and Arshdeep Singh go for a plentyThat’s because the remaining Indian pacers in the playing XI in Avesh Khan and Arshdeep Singh failed to impress and went for plenty against a weak batting outfit. The inexperienced of the duo was found wanting as Avesh gave away 53 runs in four overs while Arsdeep coughed up 44 runs in as many.And something that may bother India in the remaining games against considerably stronger teams is spinner Chahal goes another match without picking a wicket.Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-08-31 20:01:15","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/09/Virat-Kohli-Suryakumar-yadav.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Asia Cup 2022: Suryakumar Yadav, Virat Kohli anchor India to big win against Hong Kong","link":"https://www.firstpost.com/photos/asia-cup-2022-suryakumar-yadav-virat-kohli-anchor-india-to-big-win-against-hong-kong-11156801.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"Asia Cup 2022: Suryakumar Yadav, Virat Kohli anchor India to big win against Hong Kong","content":"Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-08-31 19:59:26","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/09/IND-vs-HK-1.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"BAL vs SOP Dream11 Prediction: Fantasy Cricket Tips, Today's Playing XIs, Player Stats, Pitch Report for National T20 Cup, Match 5","link":"https://www.sportskeeda.com/fantasy-cricket-mantra/bal-vs-sop-dream11-prediction-fantasy-cricket-tips-today-s-playing-xis-player-stats-pitch-report-national-t20-cup-match-5-1?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Fantasy Cricket Mantra"],"creator":["Adarsh Tabhane"],"video_url":null,"description":null,"content":null,"pubDate":"2022-08-31 19:25:14","image_url":"https://static.sportskeeda.com/editor/2022/08/520d9-16619676298636-1920.jpg","source_id":"sportskeeda","country":["india"],"category":["sports"],"language":"english"},{"title":"Short of words to describe it: Rohit Sharma applauds Suryakumar Yadav’s ‘fearless’ knock vs Hong Kong","link":"https://www.firstpost.com/firstcricket/sports-news/short-of-words-to-describe-it-rohit-sharma-applauds-suryakumar-yadavs-fearless-knock-vs-hong-kong-11156781.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"Short of words to describe it: Rohit Sharma applauds Suryakumar Yadav’s ‘fearless’ knock vs Hong Kong","content":"India skipper Rohit Sharma said he was lost for words that would appropriately describe Suryakumar Yadav’s 26-ball 68 against Hong Kong in the Asia Cup in Dubai on Wednesday.Suryakumar smashed six sixes and as many fours in his sizzling knock to lift India to 192 for two, enough to secure a 40-run win and a place in the Super 4 stage of the tournament.”The kind of innings he played today, the words will be short,” Rohit said at the post-match presentation.”We have seen that with him every now and then. He comes up with such kinds of knocks. He just comes out and bats fearlessly which is what the team expects from him.”Some of the shots he played today, those are not written anywhere in the book. It was very pleasing to watch. Shot selection was also crucial. We know he can play all around the park,” Rohit was all praise for Surya.India were off to a sedate beginning and both their openers Rohit and KL Rahul failed to convert their starts.But Virat Kohli held the innings together, scoring his first international half-century (59 not out from 44 balls) in more than six months, even as Suryakumar provided the much-needed impetus in the back-10. The duo put together 98 runs in an unbroken third-wicket stand.Suryakumar batted at No 4, days after Ravindra Jadeja played a match-winning knock after being promoted to the same position.”We have also informed the group about this (flexibility in the batting order) as well. Most of the guys are ready to take the opportunity and be ready to bat wherever required.”That’s the flexibility we need. We’ll take those chances. We are going to try and use the right match-ups,” Rohit said.Asked about his wide range of shots, Suryakumar said some of them were pre-determined.”Some of them (shots) were pre-determined, this format is all about what you think and how you prepare before you go out to bat,” Suryakumar said after being adjudged player of the match.”I felt the wicket was a bit slow. My plan was clear. My role was to go in and take the tempo up and just express myself, I just loved it.” On adapting to different positions, he said: ”You (have) got to be flexible, you should be equipped to bat at any number, and I have opened as well. I have batted at all number. I really enjoyed it.”Meanwhile, Hong Kong skipper Nizakat Khan also appreciated the way Suryakumar batted in his unbeaten knock of 68 off just 26 balls, saying that it was great to watch and rued the slip-ups made by his bowlers in the death overs after electing to bowl first.“I think the way we started with the ball, we were amazing till 13th over, fielding was good too. But we slipped after that, especially in the death overs, but the way Suryakumar batted, it was good to watch,” said Nizakat in post-match presentation ceremony.Hong Kong came into the Asia Cup main event after topping the qualifying tournament in Oman, winning all three matches against Singapore, Kuwait and UAE.“I think it (Asia Cup) was a big opportunity for all the boys. I know we were away for a long time, boys were playing with injuries, credit goes to them, I am very proud of them,” added Nizakat.India sealing one of the two Super Four spots meant Friday’s match between Hong Kong and Pakistan is a virtual quarterfinal clash for the second and last spot.“I think we’re going to sit down tomorrow (Thursday), we will look at our death bowling, we will improve in the next game (against Pakistan),” concluded Nizakat.With PTI inputsRead all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-08-31 19:10:02","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/08/Suryakumar-Yadav.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Asia Cup 2022: Twitter lauds Suryakumar Yadav's 'special knock' as India clinch 40-run win over Hong Kong","link":"https://www.firstpost.com/firstcricket/sports-news/asia-cup-2022-twitter-lauds-suryakumar-yadavs-special-knock-as-india-clinch-40-run-win-over-hong-kong-11156591.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"Asia Cup 2022: Twitter lauds Suryakumar Yadav's 'special knock' as India clinch 40-run win over Hong Kong","content":"India clinched a convincing win by 40 runs against Hong Kong in the Asia Cup 2022 fixture in Dubai after restricting them to 152/5 in 20 overs while chasing 193.The Indian bowlers picked up wickets at regular intervals and reduced to the opponents to 116/5 in the 18th over before Zeeshan Ali and Scott McKechnie chipped in with some quick runs. While Zeeshan scored 26 off 17, McKechnie remained unbeaten at 16 off 8.Ravindra Jadeja was the pick of the bowlers as he returned with figures of 1/15 in 4 overs.Afraid the bowling isn’t looking scary enough ……— Harsha Bhogle (@bhogleharsha) August 31, 2022And at that moment he knew, he messed up! #INDvHK pic.twitter.com/BLAEALznrR— Wasim Jaffer (@WasimJaffer14) August 31, 2022That’s that from our second match at the #AsiaCup2022. #TeamIndia win by 40 runs.Scorecard – https://t.co/k9H9a0e758 #INDvHK #AsiaCup2022 pic.twitter.com/fIPq7vPjdz— BCCI (@BCCI) August 31, 2022You know it’s special when the 👑 bows down 👏🇮🇳 pic.twitter.com/rEeNWJFuVs— Rajasthan Royals (@rajasthanroyals) August 31, 2022Good win today. A special knock by SKY. We’ll keep going. 🇮🇳 pic.twitter.com/wbSBWqLzOU— Virat Kohli (@imVkohli) August 31, 2022On to the next stage ➡️#INDvHK pic.twitter.com/PBu2JzuiGH— DK (@DineshKarthik) August 31, 2022Top of Group A ✅ Super Four qualification ✅With the win over Hong Kong, the #MenInBlue will return to action on Sunday 💯#INDvHK #AsiaCup2022 pic.twitter.com/nB1NuaUIyk— SunRisers Hyderabad (@SunRisers) August 31, 2022Silence in the jungle is a proof.. the king is back. #IndvsHK pic.twitter.com/M3YH3Wa38H— Amit Mishra (@MishiAmit) August 31, 2022Hardik,SKY batting in a different zone! Indian cricket so fortunate that both have hit these highs together. Sensational stuff! 👏🏼👏🏼👏🏼— Sanjay Manjrekar (@sanjaymanjrekar) August 31, 2022Earlier, it was Suryakumar Yadav and Virat Kohli who unleashed a batting masterclass with a stunning partnership of unbeaten 98 runs for the third wicket. While Kohli notched up a half-century and returned not out for 59 off 44, SKY hammered the Hong Kong bowlers all around the park and struck 68* in just 26 deliveries, a knock which included six sixes and as many fours including a 26-run final over.India eventually posted 192/2 in 20 overs.Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-08-31 19:00:47","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/08/SKY-640-1.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"India vs Hong Kong, Asia Cup Stat Attack: Suryakumar shatters multiple records, Rohit creates history and more","link":"https://www.firstpost.com/firstcricket/sports-news/india-vs-hong-kong-asia-cup-stat-attack-suryakumar-shatters-multiple-records-rohit-creates-history-and-more-11156721.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"India vs Hong Kong, Asia Cup Stat Attack: Suryakumar shatters multiple records, Rohit creates history and more","content":"Defending champions India defeated Hong Kong by 40 runs in their Asia Cup match in Dubai on Wednesday, registering their second successive win in the continental tournament.Sent into bat at the Dubai International Cricket Stadium, India scored 192 for two with Virat Kohli (59 not out) and Suryakumar Yadav (68 not out) being the team’s main contributors.In reply, Hong Kong were restricted for 152/5 in their allotted 20 overs as India entered the Super 4 stage of the tournament.After a sedate start when opener KL Rahul struggled to score freely, India upped the ante in the back-10, with Suryakumar going after the attack in the company of a fluent Kohli.Entering the final over on 42, Suryakumar smashed Haroon Arshad for four sixes from five balls, helping India amass 26 runs. He got to his fifty in just 22 balls and went onto score 68 runs in just 26 balls.We now take a look at some of the stats from the game:1) Rohit Sharma became the first men cricketer to score 3500 runs in T20I history. New Zealand’s Martin Guptill, who has scored 3497 runs, is in the second position and Virat Kohli is placed in the third position with 3,343 runs. Notably, Rohit is also the highest run-getter in the shortest version of the game.2) Suryakumar Yadav’s 68* is the highest score by a batter in the ongoing Asia Cup 2022.3) Suryakumar also smashed most sixes (6) by an Indian in a T20 Asia Cup match. No other Indian batter has slammed more than three sixes in a men’s T20 Asia Cup match.4) Suryakumar also recorded the most runs (26) by an Indian in the 20th over of a T20I match.5) Hong Kong is now the first associate side to register a 150+ score against India in T20Is.Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-08-31 18:47:01","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/08/Suryakumar-Yadav-vs-HK-640.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Asia Cup 2022: Virat Kohli, Suryakumar Yadav power India into Super Four with win over Hong Kong","link":"https://www.firstpost.com/firstcricket/sports-news/asia-cup-2022-virat-kohli-suryakumar-yadav-power-india-into-super-four-with-win-over-hong-kong-11156611.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"Asia Cup 2022: Virat Kohli, Suryakumar Yadav power India into Super Four with win over Hong Kong","content":"Dubai: Star batsman Virat Kohli and Suryakumar Yadav hit half-centuries to help India move into the Asia Cup Super Four stage with a 40-run win over Hong Kong on Wednesday.Kohli made 59 while Suryakumar smashed 68 off 26 balls as the pair put on an unbeaten stand of 98 to steer India to 192/2 after being put in to bat first in the Twenty20 tournament in Dubai.Hong Kong were limited to 152/5 in reply as India registered their second successive victory to join Afghanistan in the next round of the six-nation tournament, which acts as a tune-up to the T20 World Cup in October-November.But it was Suryakumar’s batting blitz that stood out as the number four blasted his way to a 22-ball fifty and finished the innings with four sixes in the final over.Hong Kong, who made the main draw after winning all three of their matches in the qualifiers in Oman, had largely kept India in check before losing their way once Suryakumar started teeing off.That’s that from our second match at the #AsiaCup2022. #TeamIndia win by 40 runs.Scorecard – https://t.co/k9H9a0e758 #INDvHK #AsiaCup2022 pic.twitter.com/fIPq7vPjdz— BCCI (@BCCI) August 31, 2022The 33-year-old Kohli, who is going through an extended batting slump and made 35 in his team’s opening win over Pakistan, also got going to complete his 31st half-century in his 101st T20 international.Skipper Rohit Sharma started cautiously before clubbing Hong Kong medium-pace bowler Haroon Arshad for two sixes and a four in a 22-run third over.Spinner Ehsan Khan slowed the scoring and seamer Ayush Shukla reaped the benefits in the next over as he took down Rohit with a slow off-cutter. He made 21.Kohli walked in to loud cheers from a sparse Indian crowd but struggled to play freely against a disciplined bowling attack which kept the runs down.Kohli finally opened up to get a boundary with a straight drive off leg-spinner Mohammad Ghazanfar and soon found some rhythm as he hit three sixes in his 44-ball knock.KL Rahul and Kohli kept the score ticking with singles and twos with occasional boundaries to put on 56 runs before Ghazanfar broke through with the wicket of Rahul (36).Left-arm quick Arshdeep Singh struck early for India with the wicket of Yasim Murtaza but Babar Hayat countered with some attacking shots.Skipper Nizakat Khan fell to a direct throw from Ravindra Jadeja, who then removed Hayat for 41 with his left-arm spin.Kinchit Shah (30) and Zeeshan Ali (26 not out) also played useful knocks to reduce the margin of defeat.Bangladesh and Sri Lanka will battle it out for a Super Four spot from Group B in a do-or-die match on Thursday after Afghanistan moved clear with two wins.Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-08-31 18:15:36","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/08/Kohli-SKY-640.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"India vs Hong Kong, Asia Cup 2022: KL Rahul, Rishabh Pant and question of playing spinners","link":"https://www.firstpost.com/firstcricket/sports-news/india-vs-hong-kong-asia-cup-2022-kl-rahul-rishabh-pant-and-question-of-playing-spinners-11156571.html","keywords":["First Cricket News"],"creator":["Jaideep Ghosh"],"video_url":null,"description":"India vs Hong Kong, Asia Cup 2022: KL Rahul, Rishabh Pant and question of playing spinners","content":"The win against Hong Kong in Asia Cup 2022 was not even a consideration and once India ended up scoring so over 190 runs, it was just for the records. This group has in any case been set up to ensure that India and Pakistan make it to the Super Four and Hong Kong is one match that would ensure enough points for the team finishing second to also make the grade.This was a match where everyone in question would be expected to get some serious match practice and score some runs that would make those who were a little hesitant about their form to get that sense of security.India duly won the match and topped Group A to make it to the Super Four. But even as a few wrinkles were ironed out in some manner, some interesting questions did crop up. While questions will always come, in every match, these were pertaining to things to do with the matches to come. Was Rishabh Pant inclusion wasted?There is an interesting one. Who among Rishabh Pant and Dinesh Karthik is the choice for the T20 World Cup? If the match with Pakistan is any indication, Karthik seems ahead, which is a little surprising and inconceivable, given that Pant has been the favourite for long and he is now also beginning to get comfortable in white-ball cricket.Also, if the change in the line-up does not merit a little bit of experimentation, why make any change at all? India’s winning combination against Pakistan just had that one change – Pant instead of Hardik Pandya – in the Hong Kong match. So, if Pant is in the side, surely, he needs to get a bat. If there is a change in personnel and no change in the batting order, especially in a match where no way all the top seven batters were going to get a hit, then why was the new player included?No other match will be as easy, irrespective of whoM you play. As it turns out, India have two big ones back-to-back in the Super Four, against Pakistan and then Afghanistan, on September 4 and 6 respectively, and definitely you need all your potential players to get a hit. In fact, all the reserves could have been fielded in the Hong Kong match, but that would be expecting too much.So, if tomorrow India need to play Pant in the XI against one of these matches, he will go in without any batting in the tournament. May not be a major issue, but could well become one.KL Rahul fails to convinceAfter Rahul’s first-ball duck against Pakistan, there was a lot of trolling of social media, saying that whatever he did in the Hong Kong match, he’d be in a corner. That, to an extent, is true.Rahul was nothing more than cautious in this match as well. He scored at a good pace, but at no stage looked convincing. In fact, at times he was positively straggling.Rahul too is surely in the World Cup consideration, so how he fares is important. He has so far looked quite unsure. One wonders if he has been brought back without being totally fit. Or is it just a mental thing?Playing spin bowlingThere was one stage during the Indian innings, with Rahul and Virat Kohli at the crease when one was left wondering, “if they are not being able to deal with these spinners, how will they fare against the better bowlers”?Both the batters found it difficult to get the spinners away, especially the slow left-arm Yasim Murtaza. Neither of them was able to deal with the slow pace and was unable to alter the normal game of stepping out and hitting him over the top. Rahul was not comfortable even against the leg-spin of Mohammad Ghazanfar. He did hit him for a six, and as Gautam Gambhir correctly observed in the commentary box, he didn’t go for another big shot even though it was merited, in the same over.Compare that with how Suryakumar Yadav dealt with Murtaza and the rest. A swept four off the first ball, another off the very next ball and by the time the Hong Kong bowlers realised what was going on, the scoring had gone through the roof.It was an easy win but little will be easy in the Super Four. Imagine getting stuck against Rashid Khan and the other Afghan bowlers. Even Bangladesh or Sri Lanka will pose a challenge and we are not even mentioning Pakistan.Big teams come good when it matters the most but these are questions that could still crop up, especially the spin issue. Will be interesting indeed to see how it all goes.Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-08-31 18:10:55","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/08/KL-Rahul-2.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Asia Cup points table: India, Afghanistan qualify for Super 4","link":"https://www.firstpost.com/firstcricket/sports-news/asia-cup-2022-poins-table-groups-super-4-qualification-india-pakistan-afghanistan-11150751.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"Asia Cup points table: India, Afghanistan qualify for Super 4","content":"Dubai: Asia Cup got underway on the weekend with Afghanistan beating Sri Lanka on 27 August. The Afghans won by 8 wickets in the tournament opener. Afghanistan added a second win by beating Bangladesh in the third match of the T20I competition. In so doing, Afghanistan have qualified for the Super 4 stage.In between these two fixtures, India got their campaign up and going with a 5-wicket win over Pakistan. The win came courtesy Hardik Pandya with two balls to spare.In their second fixture, India defeated Hong Kong by 40 runs to top Group A and confirm their berth in Super 4 of the tournament.After the group stage, comprising six teams, the countries will move on to the Super 4 stage with top-two teams from both groups advancing. India, Pakistan, and Hong Kong have been drawn into Group A while Sri Lanka, Bangladesh, and Afghanistan make up Group B.As things stand, India lead Group A with four points, while Pakistan and Hong Kong have zero. In the other group, Afghanistan have four points from two games to stand in the lead. Bangladesh are second and Sri Lanka third with net run rate being the difference maker.The Super 4 stage will have all the teams playing against each other once. The top two teams from this stage will play in the final on 11 September.We take a look at how things stand in the Asia Cup points table:Group ACountryMatchesWonLostPointsNRRIndia2204+1.096Pakistan1010-0.175Hong Kong1010-2.000 Group BCountryMatchesWonLostPointsNRRAfghanistan2204+2.467Bangladesh1010-0.731Sri Lanka1010-5.176Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-08-31 17:47:20","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/08/India-vs-Hong-Kong-LIVE-640.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Asia Cup: Suryakumar Yadav course correction sets up easy India win - Hindustan Times","link":"https://news.google.com/__i/rss/rd/articles/CBMilQFodHRwczovL3d3dy5oaW5kdXN0YW50aW1lcy5jb20vY3JpY2tldC9hc2lhLWN1cC0yMDIyLXN1cnlha3VtYXIteWFkYXYtY291cnNlLWNvcnJlY3Rpb24tc2V0cy11cC1lYXN5LWluZGlhLXdpbi1hZ2FpbnN0LWhvbmcta29uZy0xMDE2NjE5Njc3ODk3OTguaHRtbNIBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Asia Cup: Suryakumar Yadav course correction sets up easy India win  Hindustan TimesA tale of two India-Pakistan matches and the grand failure of ‘cricket diplomacy’  FirstpostIndia vs Hong Kong, Asia Cup 2022 Highlights: IND March Into Super 4s With Thumping Win Over HK  Cricket Country NewsAsia Cup 2022: India reaches Super 4 stage with 40-run win over Hong Kong  Sportstar'A high percentage of the boys are delivery drivers' - Hong Kong coach opens up about team's struggle  CricTrackerView Full coverage on Google News","content":null,"pubDate":"2022-08-31 17:45:11","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"India vs Hong Kong Asia Cup HIGHLIGHTS: India win by 40 runs, qualify for Super 4 stage","link":"https://www.firstpost.com/firstcricket/sports-news/india-vs-hong-kong-live-cricket-score-asia-cup-updates-commentary-streaming-11154711.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"India vs Hong Kong Asia Cup HIGHLIGHTS: India win by 40 runs, qualify for Super 4 stage","content":"23:27 (IST)Suryakumar Yadav was adjudged Player of the match for his brilliant knock. That's it from our end for this game. Hope you enjoyed our coverage. Stay with us for all the LIVE UPDATES from the tournament22:57 (IST)IND vs HK LIVE SCORE Hong Kong batters tried to put up a decent fight but they were eventually restricted to 152/5 in 20 overs as India won by 40 runs. The Men in Blue have qualified for the Super 4 stage22:55 (IST)IND vs HK LIVE SCORE FOUR! Arshdeep comes round the wicket, bowls a perfect yorker just outside off and Zeeshan gets the bat down at the right time and gets a boundary to the third man area22:51 (IST)IND vs HK LIVE SCORE FOUR! Some fireworks from Hong Kong batters in that over. Two consecutive boundaries now. First Scott McKechnie went over the fine leg fielder and now he has got one through the backward point area22:49 (IST)IND vs HK LIVE SCORE SIX! That's the second six of the over. Avesh once again bowls that short and wide and Scott McKechnie upper cuts that to fetch a six over third man boundary22:44 (IST)IND vs HK LIVE SCORE WICKET! Bhuvneshwar Kumar comes in and picks up a wicket. Length ball, a bit of width on offer to Shah who tries to go for an aggressive stroke but doesn't time it well and is caught by Ravi Bishnoi who runs in from long off and completes the catch in the third attempt22:30 (IST)IND vs HK LIVE SCORE WICKET! Avesh has the wicket finally. Straight and full from Avesh and Aizaz who tries to go for the big shot misses it completely and gets cleaned up22:29 (IST)IND vs HK LIVE SCORE FOUR! Just over Suryakumar Yadav stationed at mid wicket. Avesh bowls it back of the length and Aizaz pulls that for a boundary22:18 (IST)IND vs HK LIVE SCORE SIX! After a boundary in that over, Avesh has been hit for a maximum. He provides some width and Kinchit dispatches that over covers for a maximum22:12 (IST)IND vs HK LIVE SCORE WICKET! Now Jadeja has a wicket. The left-handed spinner comes round the wicket, gives some flight on it as it moves away from Hayat who tries to take the aerial route on it but miscues his stroke and is caught by Avesh Khan on the off side22:10 (IST)IND vs HK LIVE SCORE FOUR! Bad delivery from Yuzvendra Chahal. Tosses it up, bowls it around the leg stump and Kinchit Shah sweeps that to the deep fine leg region for a boundary21:53 (IST)IND vs HK LIVE SCORE WICKET! Ravindra Jadeja's incredible fielding effort has given India a wicket. Arshdeep came round the wicket on the final ball of the powerplay which was also a FREE HIT. He bowls it a bit slow and wide, Nizakat Khan plays it straight to Jadeja at point region and comes out of the crease but turns back. Meanwhile, Jadeja throws the ball on to the stumps at striker's end and hits the bull's eye. The replay shows that the Hong Kong batter was short of his crease21:48 (IST)IND vs HK LIVE SCORE FOUR! This is an expensive over from Arshdeep. He comes round the wicket to Nizakat Khan, bowls it full, coming into the right-hander and he hits that over extra cover for a boundary21:44 (IST)IND vs HK LIVE SCORE FOUR! Wrong line. You can't bowl there especially to a batter who is looking all set. Arshdeep bowls that full, on the leg stump line with the fine leg fielder up in the circle. Babar Hayat flicks that easily for a boundary21:41 (IST)IND vs HK LIVE SCORE FOUR! And Babar Hayat continues with his aggressive batting. Fuller, way outside off and the right-handed batter hits that over extra cover for another boundary21:40 (IST)IND vs HK LIVE SCORE SIX! Another six and once again down the ground. Avesh Khan bowls that touch fuller, outside off and Babar Hayat throws his bat on it and gets a maximum21:34 (IST)IND vs HK LIVE SCORE SIX! Bhuvneshwar Kumar bowls that touch fuller, just outside off and Babar Hayat hits that straight down the ground for a maximum21:31 (IST)IND vs HK LIVE SCORE WICKET! And here's the breakthrough that India needed. Arshdeep has an early wicket. He bowls that short and Yasim Murtaza goes for the pull, miscues his stroke as he top edges that and is caught at deep fine leg by Avesh Khan21:30 (IST)IND vs HK LIVE SCORE FOUR! That's the second four of the over. Arshdeep bowls that fuller, around the leg stump channel and Yasim Murtaza hits that over mid on21:20 (IST)IND vs HK LIVE SCORE \"I haven't practiced those strokes, but I used to play rubber ball cricket with my friends when I was a kid and that is where these shots come from. The pitch was a little sticky before. Before I got out to bat, I spoke to Rohit and Rishabh and told them that I would try to take the tempo up and look for 170-175. I think we have a good score on this wicket,\" said SKY after his phenomenal knock. 21:11 (IST)IND vs HK LIVE SCORE A couple to end the innings as India post 192/2 in 20 overs. 26 runs came of the last over. Kohli remains unbeaten at 59 off 44, SKY chips in with 68* off 2621:10 (IST)IND vs HK LIVE SCORE SIX! Back of the length, down the leg and had no pace on it. Suryakumar Yadav swing shis bat and gets another maximum to deep fine leg area21:08 (IST)IND vs HK LIVE SCORE SIX! Three in a row from Suryakumar Yadav. Haroon bowls that full, just outside off, SKY shuffles a bit and hammers that straight down the ground for another SIX!21:07 (IST)IND vs HK LIVE SCORE SIX! Now Suryakumar Yadav brings up a FIFTY!. Fuller, outside off from Haroon and SKY once again throws his bat on to it and gets a maximum over cover boundary21:06 (IST)IND vs HK LIVE SCORE SIX! That's a gift from the bowler to Suryakumar Yadav. Haroon Arshad bowls a full toss, offers width on it and SKY throws the kitchen sink on it to get a six over third man boundary21:03 (IST)IND vs HK LIVE SCORE SIX! A bit quicker and fuller from Ehsan and Kohli throws the bat on it to get another maximum, this time over cow corner21:01 (IST)IND vs HK LIVE SCORE Virat Kohli gets a couple and he notches up a FIFTY! A much-needed one for him. He is looking in good touch20:58 (IST)IND vs HK LIVE SCORE SIX! What perfect timing from Suryakumar Yadav. Fuller delivery, on the leg stump line and he flicks that over square leg boundary for a maximum 20:53 (IST)IND vs HK LIVE SCORE FOUR! Touch fuller, width on offer and Suryakumar Yadav hits that over mid off for a boundary. He is unstoppable20:46 (IST)IND vs HK LIVE SCORE SIX! He is toying with bowling. Touch fuller, on to the stumps from the bowler and Suryakumar Yadav shuffles across, ramps it for a maximum behind20:44 (IST)IND vs HK LIVE SCORE FOUR! Suryakumar Yadav is looking good. Length ball, outside off from the bowler, the third man fielder is up and SKY just cuts that over him to fetch another boundary on the off side20:43 (IST)IND vs HK LIVE SCORE SIX! He is in a different zone. Virat Kohli once again comes down the track on that touch fuller delivery that had no pace on it and hammers it over mid wicket for a maximum20:41 (IST)IND vs HK LIVE SCORE FOUR! Sloppy fielding at deep fine leg. Low full toss, going down the leg from the bowler, Suryakumar Yadav shuffles across and flicks that one. The ball goes straight to fielder stationed there but he mis fields it and SKY would get a boundary20:36 (IST)IND vs HK LIVE SCORE FOUR! Two in two. Yasim Murtaza once again comes round the wicket, tosses it up and this time Suryakumar Yadav sweeps that to the backward square leg boundary20:35 (IST)IND vs HK LIVE SCORE FOUR! Suryakumar Yadav brings up the team's 100 in style. He sweeps that to square leg boundary for a four. A good way to start the innings too20:32 (IST)IND vs HK LIVE SCORE WICKET! The partnership has been broken. KL Rahul tries to go for the slog but only manages to edge the ball to the wicket-keeper. He has to walk back after being caught behind20:30 (IST)IND vs HK LIVE SCORE SIX! Slightly tossed up from the leg spinner and Virat Kohli dispatches that over mid wicket for a maximum. Brilliant shot selection from the right-hander20:23 (IST)IND vs HK LIVE SCORE FOUR! Kohli is looking to break free now. He comes down the track against the spinner and gets a one bounce four to the long on region20:13 (IST)India vs Hong Kong LIVE SCORE SIX! The bottom hand comes into play. Fuller delivery, on the leg stump line from Aizaz Khan and KL Rahul hits that over cow corner for another maximum19:57 (IST)India vs Hong Kong LIVE SCORE WICKET! Shukla has the breakthrough as he bowls that back of the length, outside off. Rohit once again tries to go over mid on but miscues his stroke and is caught by Aizaz Khan who takes a good catch diving forward19:56 (IST)India vs Hong Kong LIVE SCORE FOUR! Straight down the ground from Rohit. He gives himself some room as Ayush Shukla bowls that full and into the slot19:46 (IST)India vs Hong Kong LIVE SCORE SIX! KL Rahul takes full advantage of the FREE HIT. Haroon bowls that touch fuller, just outside off and Rahul smashes that over mid wicket boundary for second six of the innings19:42 (IST)India vs Hong Kong LIVE SCORE SIX! That's the first one of the innings. Sharma dances down the track on that length ball, on to the stumps and hammers it over long for a maximum19:32 (IST)India vs Hong Kong LIVE SCORE The players are out in the middle. KL Rahul will open the innings with Rohit Sharma. Haroon Arshad will bowl the first over19:09 (IST)India vs Hong Kong LIVE SCORE Playing XI Hong Kong: Nizakat Khan(c), Yasim Murtaza, Kinchit Shah, Babar Hayat, Aizaz Khan, Zeeshan Ali, Scott McKechnie(w), Haroon Arshad, Ehsan Khan, Ayush Shukla, Mohammad Ghazanfar19:08 (IST)India vs Hong Kong LIVE SCORE Playing XI India: Rohit Sharma(c), KL Rahul, Virat Kohli, Suryakumar Yadav, Rishabh Pant, Ravindra Jadeja, Dinesh Karthik(w), Bhuvneshwar Kumar, Avesh Khan, Yuzvendra Chahal, Arshdeep Singh19:08 (IST)India vs Hong Kong LIVE SCORE India have rested Hardik Pandya for this game and Rishabh Pant is back in the XI. \"One change: Hardik is rested considering how important he is for us, Pant comes in,\" Rohit said at the toss 19:01 (IST)India vs Hong Kong LIVE SCORE Hong Kong have won the toss and they have elected to bowl first against India. \"We are going to bowl first. In Oman, we chased down well and that is what we are looking to do. The last time we played India, it was a godo game and we know we did some mistakes and want to make sure we capitalize on that. We have the same team we played against UAE,\" says the skipper. 18:54 (IST)India vs Hong Kong LIVE SCORE Virat Kohli looked good in the previous game against Pakistan but eventually got out after miscuing one of the strokes. The right-hander would be looking to continue from where he left and put up a big score18:46 (IST)IND vs HK LIVE SCORE This is a chance for KL Rahul to get back into the groove as he hasn't really scored runs since his return in the national side after the long injury lay-offIndia vs Hong Kong Asia cup HIGHLIGHTS: Hong Kong batters tried to put up a decent fight but they were eventually restricted to 152/5 in 20 overs as India won by 40 runsPREVIEW: India will lock horns with Hong Kong in their second Asia Cup 2022 match in Dubai. The Men in Blue are coming into this game with a win against Pakistan in a close encounter. The Rohit Sharma-led side rode on an emphatic all-round show from Hardik Pandya to clinch a win against the arch-rivals. A win for India in this match will mean that they qualify for the Super 4 stage.Hong Kong, on the other side made the qualification for the continental tournament and would be looking to begin the proceedings on a positive note now.SQUADSIndia: Rohit Sharma(c), KL Rahul, Virat Kohli, Suryakumar Yadav, Ravindra Jadeja, Hardik Pandya, Dinesh Karthik(w), Bhuvneshwar Kumar, Avesh Khan, Yuzvendra Chahal, Arshdeep Singh, Deepak Hooda, Rishabh Pant, Ravichandran Ashwin, Ravi BishnoiHong Kong: Nizakat Khan(c), Yasim Murtaza, Babar Hayat, Kinchit Shah, Aizaz Khan, Scott McKechnie(w), Zeeshan Ali, Haroon Arshad, Ehsan Khan, Mohammad Ghazanfar, Ayush Shukla, Ateeq Iqbal, Mohammad Waheed, Wajid Shah, Aftab Hussain, Dhananjay Rao, Ahan TrivediRead all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-08-31 17:36:33","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/08/Suryakumar-Yadav-vs-HK-640.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"IND vs HK: Virat Kohli bowls in T20I cricket after six years, concedes 6 runs in his over; watch video","link":"https://www.dnaindia.com/cricket/report-ind-vs-hk-virat-kohli-bowls-in-t20i-cricket-after-six-years-concedes-6-runs-in-his-over-watch-video-2981344","keywords":["Sports","Cricket"],"creator":["DNA Web Team"],"video_url":null,"description":"Virat Kohli was seen rolling his arm against Hong Kong, and in the shortest format, he bowled after six years, as he conceded six runs in his over.","content":null,"pubDate":"2022-08-31 17:25:00","image_url":null,"source_id":"dnaindia","country":["india"],"category":["sports"],"language":"english"},{"title":"Ponting backs Virat Kohli's month-long break from cricket","link":"https://timesofindia.indiatimes.com/sports/cricket/asia-cup/ponting-backs-virat-kohlis-month-long-break-from-cricket/articleshow/93912132.cms","keywords":null,"creator":null,"video_url":null,"description":"Following up his 35 against Pakistan in India's Asia Cup opener, former Indian skipper Virat Kohli struck a fluent 44-ball 59* versus Hong Kong in Dubai, his first international fifty since a 52 against the West Indies in a T20I in Kolkata on February 18 this year.","content":"MELBOURNE: Australian legend Ricky Ponting on Wednesday said Virat Kohli did the right thing by taking a month-long break from cricket. Following up his 35 against Pakistan in India's Asia Cup opener, former Indian skipper Kohli on Wednesday struck a fluent 44-ball 59 not out versus Hong Kong in Dubai, his first international half-century since a 52 against the West Indies in a T20I in Kolkata on February 18 this year. \"I just hope that we see him back at his best and in the World Cup,\" the two-time World Cup winning skipper Ponting said on the 'ICC Review'. \"I'd rather see Virat come out here (in Australia) and be one of the leading players in the tournament, but just make sure he doesn't score many runs against Australia when they play!\" Ponting's comments came after India's five-wicket win over Pakistan on Sunday. Coming back after a month-long break from cricket, Kohli scored a 34-ball 35 against the arch-rivals. \"First and foremost, great to see him back among the runs,\" Ponting said. \"No surprised that he did it in a run chase. We've always known that about him. His record suggests he is better when his team is chasing runs. \"When I saw his runs and then I've read on social media over the last few days, it sounded like he found himself in quite a dark place. Like a lot of us men, he wasn't willing to talk about it and share it. \"It sounds like when he started to share, started to talk, it might have just freed him up a bit and he started to feel better about himself again,\" the Aussie said, referring to Kohli's recent statement that he was \"faking intensity\" amid his struggles with the bat. Asked if he had faced anything similar, Ponting said: \"I don't think I can quite relate to the 'intensity' (comment)... \"When things aren't going well and you're not scoring the runs you used to score, the game all of a sudden seems to be too hard. \"I sort of faced it in the last couple of years of my career where my career tapered off quite quickly... It was almost, the harder I work, the worse I got. \"I was so focused and conscious on being perfect and doing things exactly right, thinking I had to do that to get the best out of myself, but all I was doing was putting pressure on myself and not letting myself play the game the way I always played it. I reckon it might be a bit of that creeping in with Virat as well. \"It's just human nature when things aren't going the way you want, you push harder, you try harder, and the harder you try the harder it gets.\" Ponting believes it was important that Kohli took an extended break to reset himself. \"One thing I'll say about, as international cricketers, and probably more so with the modern Indian players, the amount of cricket they're actually playing internationally and the IPL, you can quite often bluff yourself that you're feeling good and that you are fresh, that you have got plenty of energy. \"Because when you're tired, you have to tell yourself that, because you've got to get up and play again the next day. It's not until you have stopped and just have a few days off, or you have a week away, that you realise how tired physically and mentally you are. \"For someone like Virat, it was no good having a week off. The fact that he has taken that month off to get away, to sort of regather his thoughts, get himself back where we think he is in the right space mentally... there's lots of good signs there,\" Ponting concluded.","pubDate":"2022-08-31 17:21:57","image_url":null,"source_id":"toi","country":["india"],"category":["sports"],"language":"english"},{"title":"Asia Cup 2022: 6, 6, 6, 0, 6, 2; Suryakumar Yadav goes on maximum spree in 20th over","link":"https://www.firstpost.com/firstcricket/sports-news/asia-cup-2022-6-6-6-0-6-2-suryakumar-yadav-goes-on-maximum-spree-in-20th-over-india-vs-hong-kong-11156271.html","keywords":["First Cricket News"],"creator":["Aditya K Halder"],"video_url":null,"description":"Asia Cup 2022: 6, 6, 6, 0, 6, 2; Suryakumar Yadav goes on maximum spree in 20th over","content":"Suryakumar Yadav showed no mercy to minnows Hong Kong on Sunday as the 31-year-old Indian batter shot 26 runs in the final over to take his side to a 192/2 in 20 overs in their second group game of the Asia Cup 2022 in Dubai.Yadav finished his innings at 68 not out of 26 deliveries while striking at a rate of 261.54. The worst of it was bored by young medium pacer Haroon Arshad (0/53 in 3 overs), who was clobbered for four sixes in the final over of the match.The 22-year-old inexperienced bowler did invite trouble early on as his line length was there for the taking. He bowled a full toss at Surya outside off-stump in the first ball and the Indian batter swung it over sweeper cover for a six.The pacer was probably looking for a wide yorker but bowled it full but wide outside off stump in the next ball, which was again reached by the Mumbai Indians batter for a six over deep extra cover. This maximum also helped Surya reached his half century in just 22 deliveries.Arshad went straighter with his line of the next delivery and the batter made the most of it by swinging straight down the ground for a flat six into the sightscreen.Arshad did came back stronger of the next delivery by bowling a slow bouncer to surprise SKY but bowled it back of the length in the fifth ball for the batter to scoop-pull it over the fine leg boundary for the fourth and final six of the over.Haroon managed to save further embarrassment by giving away two runs of the final delivery as he took pace off a length ball, which was lofted drive by Surya to long-on.Among other valuable contributions during the game, Virat Kohli returned to form with a 44-ball 59 not out while openers Rohit Sharma (captain) and KL Rahul contributed 21 runs and 36 runs each. Hong Kong bowlers had little to celebrate on the day except for Ayush Shukla (1/29) as he took the prized scalp of the Indian skipper.At the time of writing, Hong Kong were 57/2 in 8 overs while chasing 193.Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-08-31 16:43:05","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/08/Suryakumar-yadav.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Watch: Virat Kohli bows to Suryakumar Yadav after 68-run blitz against Hong Kong","link":"https://www.firstpost.com/firstcricket/sports-news/watch-virat-kohli-bows-to-suryakumar-yadav-after-68-run-blitz-against-hong-kong-11156331.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"Watch: Virat Kohli bows to Suryakumar Yadav after 68-run blitz against Hong Kong","content":"Team India batter Suryakumar Yadav was in his element as he smashed an unbeaten 68 off 26 against Hong Kong in the fourth match of the Asia Cup 2022 at Dubai International Cricket Stadium on Wednesday.The hard-hitting batter Suryakumar entered the crease as the number four batter and scored back-to-back two fours of Yasim Murtaza’s bowling to ease the pressure on the Indian team. With some blistering shots by Suryakumar, team India ended the 14th over with 107 runs on the board and a loss of two wickets.In the 16th over of the innings, Suryakumar smashed back to back six and a four. He continued the form and in the 18th over, he hammered perfect back-to-back two fours and a six of the deliveries of Ayush Shukla.In the last over, Suryakumar slammed back-to-back three sixes followed by another six while also bringing up his half-century in 22 balls. Hong Kongs’s Haroon Arshad was hammered for 26 runs and India posted 192/2 on in 20 overs.Meanwhile, Virat Kohli, who himself scored an unbeaten 59, seemed impressed with Suryakumar’s fireworks as he bowed down to him after India’s innings got over. Watch the video of the incident here:bowed down to sarfaraz khan bowed down to rohit sharma bowed down to skykohli knows the best how to appreciate his teammates 💙 pic.twitter.com/iaZfYIBmM0— 👨🏻‍🦯 (@murdockistic) August 31, 2022Talking about the match, half-centuries by Suryakumar and Kohli helped India score 192/2 in their allotted 20 overs.Put to bat first, India got off to a flying start as their openers Rohit Sharma and KL Rahul hammered Hong Kong bowlers for 38 runs in under five overs.Rohit’s stint was cut short as he fell prey to Hong Kong’s Ayush Shukla’s delivery after scoring 21 runs in 13 balls. The Indian skipper mistimed his shot and was caught at mid-off.The loss of the captain’s wicket invited Virat Kohli, who played every ball with caution and kept rotating the strike. Rahul shifted the gears and smashed the ball on the stands with a marvelous six on Aizaz Khan’s delivery. Kohli then joined Rahul in thrashing the bowlers and smashed his first boundary of the night of Mohammad Ghazanfar’s delivery.After 10 overs, the duo of Rahul and Kohli took India’s total to 70-1. In the 11th over of the game, Hong Kong bowlers restricted India from scoring big shots.Mohammad Ghazanfar gave India a big blow as he dismissed KL Rahul, who scored 36 runs in 39 deliveries. His knock included two sixes.After Rahul’s dismissal, Kohli and Suryakumar steered India’s innings and stitched an unbeaten 98-run partnership to help the Men in Blue set a big target for Hong Kong.Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-08-31 16:42:03","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/08/kohli-suryakumar.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"How Suryakumar Yadav makes professional cricket look like gully cricket on steroids","link":"https://indianexpress.com/article/sports/cricket/how-suryakumar-yadav-makes-professional-cricket-look-like-gully-cricket-on-steroids-8123707/","keywords":["Cricket","Sports"],"creator":["Sriram Veera"],"video_url":null,"description":null,"content":"“Joke kaati-kitu irukaar Suryakumar Yadav!” (He is playing it as if it were a joke” That’s former India opener Abhinav Mukund on Tamil commentary after gasping at Suryakumar Yadav’s stunning six to bring up his hundred. Sitting next to him was another former India opener S Ramesh, the one with the languid wondrous wrists, who piped up: “Hardik Pandya looks stunned too and Rahul Dravid must be wondering, “what was that, we never played those shots in our time!”. Here is the shot. Just prior to release, Suryakumar had lunged across to the offside on a bent knee, suggesting he was going to sweep him over square-leg. The bowler adjusted to push it wider outside off stump. But Surya quickly re-adjusted his original thought, and somehow with great fluidity in the bat flow, sliced the ball over cover point for an outrageously skilled six. It’s another shot that stresses a point made on these pages before. That professional cricket is slowly aping tennis-ball cricket of the gullies. The good batsmen in our childhood would play all these shots with tennis ball against seamers – the lap, the reverse lap, the sweep, this Surya shot too (changing shots at last minute), and also, sending the yorker length ball over the infield to all parts with wristy whips. Even to this day, it happens in that unprofessional world. . @surya_14kumar set the stage on fire 🔥 🔥 & was our top performer from the first innings of the #INDvHK clash. 👏 👏 #TeamIndia | #AsiaCup2022 Here’s a summary of that superb knock 🔽 pic.twitter.com/d0ELeivTSp — BCCI (@BCCI) August 31, 2022 Back then not many thought it was even possible to do all this in serious hard-ball cricket. Just like how chasing big scores on the fifth day of a Test match was deemed impossible. “Arre how can you, the pitch is deteriorated, they can place fielders near the boundary, they can bowl wide, wider than in limited-overs game,” used to be the refrain even from the fans. Now, all that ‘wisdom’ has been pooh-poohed. The only difference is how all the zaniness of gully cricket has been so thoroughly professionalised. There is now method to achieve that zaniness. As if they have bottled that amateur spirit and perfected it in labs. The main ingredient they use is ‘shape’. In the series against West Indies, Suryakumar had the former Caribbean big hitter Darren Sammy gasp on air: “What wrong did (the bowler) Alzari Joseph do?” Surya had slammed a perfectly fine fast back-of-length delivery angling in on the off stump for a six over long-off. Advertisement The shot was appreciated in full before on these pages . Suryakumar Yadav against Hong Kong (PTI) In a nutshell, it comes down to how the modern-day batsmen hold shape, stretch the upper body, extend the arms to its fullest, strive to maintain balance even at that tipping over point – and wham. It’s all about positioning first – and then how to hold the rest of the body to allow for the violence to scientifically bloom to its fullest. No more there is a visceral thrill of watching a six like the old days. For starters it rains sixes these days. The gasp-worthy appreciation lies in how the batsmen combine various little movements (and a difficult stillness) to come splendidly together to carry out the vision. The positioning, the shape. Advertisement If you want to see the next big shot to come in serious leather-ball cricket, watch the YouTube videos of local tennis ball cricket in Pakistan and India. There are several of them out there, and one shot is crazier than the rest. It first becomes a possibility in that world, and then we get to see the polished professional version in our televisions. Subscriber Only Stories View All Premium UPSC Key-August 31, 2022: Why you should read ‘Sarpanch Pati’ or ‘La Ninã... Premium In the duel between ‘real’ Sena and ‘fake’ Sena, ... Premium The Mikhail Gorbachev era and the collapse of the Soviet Union: Key event... Premium Data gathering by public agencies picks up even as law hangs fire Subscribe Now to get 64% OFF Professional cricket is now gully cricket on steroids. What is next?","pubDate":"2022-08-31 16:36:41","image_url":null,"source_id":"indianexpress","country":["india"],"category":["sports"],"language":"english"},{"title":"IND vs HK: Team India fans trend 'Mr 360' as Suryakumar Yadav's shot selection wins internet","link":"https://www.dnaindia.com/cricket/report-ind-vs-hk-team-india-fans-trend-mr-360-as-suryakumar-yadav-s-shot-selection-wins-internet-virat-kohli-2981340","keywords":["Sports","Cricket"],"creator":["DNA Web Team"],"video_url":null,"description":"Suryakumar Yadav's batting created a storm on Indian social media, with fans hailing him as the new 'Mr 360' of cricket.","content":null,"pubDate":"2022-08-31 16:35:00","image_url":null,"source_id":"dnaindia","country":["india"],"category":["sports"],"language":"english"},{"title":"Virat Kohli last 50: Last half century of Virat Kohli in T20 international","link":"https://thesportsrush.com/cricket-news-virat-kohli-last-50-last-half-century-of-virat-kohli-in-t20-international/","keywords":["Cricket","asia cup","Asia Cup 2022","India","Virat Kohli"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Virat Kohli last 50 in T20I: The former Indian captain scored a T20I half-century after more than six months tonight. Former India captain Virat Kohli scored a 31st T20I half-century to let his fans take a sigh of relief post an extended lean patch across formats. While there was a lot of scope for improvement… The post Virat Kohli last 50: Last half century of Virat Kohli in T20 international appeared first on The SportsRush.","content":"Virat Kohli last 50 in T20I: The former Indian captain scored a T20I half-century after more than six months tonight. Former India captain Virat Kohli scored a 31st T20I half-century to let his fans take a sigh of relief post an extended lean patch across formats. While there was a lot of scope for improvement in Kohli’s innings especially before an ICC T20 World Cup, him making a contribution is definitely positive signs with respect his form. Coming in to bat at No. 3 in the fifth over at the Dubai International Cricket Stadium, Kohli scored 59* (44) with the help of a four and three sixes to register his 26th T20I half-century at No. 3, 24th in Asia, eighth at a neutral venue, second under Rohit Sharma (21), in the UAE and in 2022 and first against Hong Kong. Having scored 17 (19) at one point in time, Kohli hit his only four of the innings against Hong Kong spinner Mohammad Ghazanfar in the 11th over. In Ghazanfar’s next over, Kohli sat down on one knee to hit the leg-spinner over mid-wicket for a confident six. A 6⃣ by #KingKohli that left us 😍! Stand up & 👏 @imVkohli for his magnificent 5⃣0⃣ & watch him, LIVE NOW in #INDvHK , only on Star Sports & Disney+Hotstar. DP World #AsiaCup2022 #ViratKohli #BelieveInBlue #TeamIndia pic.twitter.com/aCLBD4xT3f — Star Sports (@StarSportsIndia) August 31, 2022 While batter Suryakumar Yadav (68*) had started to find boundaries at regular intervals, Kohli joined him by hitting Aizaz Khan for a six over mid-wicket in the 16th over. It was in the penultimate over of the innings that Kohli targeted Ehsan Khan to hit his third six. It was on the first delivery of this over when Kohli ran a couple of runs to cross the 50-run mark. Before Kohli scoring a half-century in Asia Cup 2022 Match 4 tonight, his last T20I half-century had come against West Indies in Kolkata six months ago. ALSO READ: Virat Kohli ODI half-centuries full list Despite scoring a couple of half-centuries for Royal Challengers Bangalore in Indian Premier League 2022, Kohli couldn’t prevent himself from putting on display a poor season .","pubDate":"2022-08-31 16:15:45","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Asia Cup 2022, India and Hong Kong Live Score Updates: India 192/2 In 20 Overs After Virat, SKY Fifties - News18","link":"https://news.google.com/__i/rss/rd/articles/CBMiuAFodHRwczovL3d3dy5uZXdzMTguY29tL2NyaWNrZXRuZXh0L25ld3MvaW5kaWEtdnMtaG9uZy1rb25nLWxpdmUtc2NvcmUtY3JpY2tldC11cGRhdGVzLXN0cmVhbWluZy10MjAtYXNpYS1jdXAtMjAyMi00dGgtbWF0Y2gtaW5kLXZzLWhrLWxhdGVzdC1zY29yZWNhcmQtdG9kYXktZHViYWktbGl2ZW5ld3MtNTg2MTA1My5odG1s0gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Asia Cup 2022, India and Hong Kong Live Score Updates: India 192/2 In 20 Overs After Virat, SKY Fifties  News18A tale of two India-Pakistan matches and the grand failure of ‘cricket diplomacy’  FirstpostMatch Preview - India vs Hong Kong, Asia Cup 2022, 4th Match, Group A  ESPNcricinfo\"Made One Mistake\": Pakistan Legend Points Out Fault In Babar Azam's Captaincy Post Loss To India  NDTV SportsWATCH: Arshdeep Singh, Avesh Khan Indulge in a Fun game, SKY Announces the Winner in Style  News18View Full coverage on Google News","content":null,"pubDate":"2022-08-31 15:46:27","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"India vs Hong Kong: Asia Cup, 2022 Live Cricket Score, Live Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/india-vs-hong-kong-live-score-over-match-4-t20-16-20-updates-3304202","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between India vs Hong Kong from Dubai International Cricket Stadium, Dubai. Check commentary and full scoreboard of the match.","content":"A dedicated team of experts bring you live score, live cricket score, live match update on Sports.NDTV.com . After 20.0 overs, India are 192/2. The live updates of India vs Hong Kong scorecard is also available. It is the perfect platform to follow your favourite teams in Asia Cup, 2022. Keep a track on your favourite batsmen and bowlers through Asia Cup, 2022 today match, ball by ball commentary, India vs Hong Kong, India vs Hong Kong live score, India vs Hong Kong scorecard. Follow the excitement of the Asia Cup, 2022 on Sports.NDTV.com as you can follow live match updates and live cricket score through our platform. Welcome back! The players are out in the middle. ... CHASE BEGINS ... For no reason, Hong Kong were looking on the back foot right from the start. They had their field spread out and didn't attack India. The pitch though was tough to play strokes and their spinners fared well to restrict India's scoring in the middle phase. Ehsan Khan and Yasim Murtaza were brilliant while Ayush Shukla also left his mark. In the end overs though, they lost the plot completely as India flexed their muscle and put them to the sword. Let's see how the Hong Kong batters approach this chase. Stay tuned... The man of the moment, Suryakumar Yadav (68* off 26 balls) starts by saying that he doesn't practice these shots but when he was young, he and his friends used to play rubber-ball cricket and these shots have come from those days. Adds that he had a chat with the coach and the skipper and they told him to express himself and he is glad that he managed to do exactly that. Reckons that the total they have on the board is a big one and is confident of their chances. Story of the innings - India started watchfully and took two overs to size up the conditions. After that, they used the third over to press on the accelerator and fetched 38 runs from the remaining overs of the Powerplay but lost Rohit Sharma in the process as well. The pitch was two-paced and the pair of Virat Kohli and KL Rahul struggled to middle their shots. After the Drinks break though, the approach from this pair changed, especially of Kohli, as he started to use his feet and attack more. Rahul's struggle had no end, and he eventually fell to make way for Suryakumar Yadav, who brought in the shift of momentum. Here he is giving a quick interview... Insane batting from Suryakumar Yadav! On a pitch where every batter struggled to time the shot, he arrived and changed the complexion of the Indian innings in a flash. His whirlwind knock has handed India a total of 192 which at one stage was not looking on the cards. Stunning performance. 78 runs from the last five overs - that's a massive finish from the Men in Blue. 19.6 overs (2 Runs) A couple to end and 26 runs off the final over in total! Length ball, angling into middle and leg, Suryakumar Yadav steps out and pushes it down towards long on. Virat Kohli straight away calls for two and they race back to complete the second run. India end with 192/2 on the board! 19.5 overs (6 Runs) SIX! SKY is back at it again and that's the fourth maximum in the over. Arshad attempts another slower bumper, on middle and leg this time but it is just too short. Suryakumar Yadav has enough time to pull it over the fine leg fence for a biggie. 24 off it with one delivery remaining. 19.4 overs (0 Run) Much better from Haroon Arshad! A slower bumper now, outside off and Suryakumar Yadav can't reach it. 19.3 overs (6 Runs) SIX! Make it a hat-trick of maximums now! This is unreal hitting from SKY! Overpitched on middle, SKY hangs deep in his crease and launches it into orbit. The ball goes a long way back over the bowler's head and into the stands. 19.2 overs (6 Runs) SIX! Two in a row now and Suryakumar Yadav has his FIFTY as well. What a player he is turning out to be for India! Fullish length, well outside off, SKY just shuffles a bit but then adjusts and just times it beautifully over the cover fence for a biggie. 12 off the first two deliveries and Haroon Arshad is under immense pressure here. 19.1 overs (6 Runs) SIX! Suryakumar Yadav is playing a blistering knock here but this is a gift from Haroon Arshad. A juicy full toss, around off, SKY uses his wrists to slice it away over the point fence for a maximum. 18.6 overs (0 Run) Full and straight, Virat Kohli gets down on one knee and aims for the slog-sweep but he goes a bit too hard at it. The ball goes off the inside edge and onto the pads, back onto the deck. Last over is to be bowled by Haroon Arshad. 18.6 overs (1 Run) WIDE! Fires it in, attacking the leg stump but this one goes down the leg side. Kohli leaves it alone and it is yet another sharp take by the keeper. A wide is called. 18.5 overs (2 Runs) A full toss now, around off, Kohli ends up slicing the lofted cover drive to the deep and picks up a couple of runs. 18.4 overs (6 Runs) SIX! Ehsan Khan just misses his length and gets dispatched with disdain. Right in the slot around middle, Virat Kohli plays the slog-sweep and launches it over the cow corner fence for a huge hit. 18.3 overs (1 Run) Ehsan fires it in full and on off, Suryakumar Yadav flicks it away towards mid-wicket and rotates the strike. 18.2 overs (1 Run) Full again, around middle and leg, this is driven down to long on for a single. 18.1 overs (2 Runs) FIFTY for Virat Kohli! It has been a bit of a wait but he has come good yet again for his side. This is fuller and on the pads, Kohli works it in front of mid-wicket and pushes hard for two. He gets it done with ease and this is also the first 50 in the main draw of this edition's Asia Cup by any player. 17.6 overs (0 Run) A bit on the shorter side and outside off, Suryakumar Yadav reaches out and taps it straight to the man at cover-point. 15 from the over! 17.5 overs (0 Run) Hard length from Shukla, around off, SKY throws his hands at it and gets a thickish edge down to short third man. Kohli declines the single. The replays find that it brushed the gloves of Scott McKechnie. 17.4 overs (6 Runs) SIX! Easily done! A half-volley floated up on the pads and Suryakumar Yadav whips it all the way over the square leg fence for a biggie. 17.3 overs (0 Run) NOT OUT! Good change-up from Ayush Shukla, banged in halfway down the track and over the off stump. Suryakumar Yadav looks to upper-cut it but misses. The keeper, Scott McKechnie does well again to collect the ball and in an instant, he whips off the bails as well. There is an appeal for stumping from Hong Kong and it is sent upstairs. UltraEdge shows that no bat is involved and the replays confirm that SKY had his back leg planted inside the crease. Appeal for a stumping, it's referred upstairs... Yadav tries to upper cut a short delivery with the keeper up to the stumps. He lifts his back leg up while doing so and Scott McKechnie breaks the stumps. The third umpire first checks for the edge which is absent and then the side-on angle finds that SKY has landed before the bails came off. 17.3 overs (1 Run) WIDE! Oh, harsh call but it will be a wide. This is very full and angling onto the leg stump. SKY shuffles across and looks to sweep it away but misses and the keeper does extremely well to collect the ball cleanly. The replays show that the ball did hit the boot. Hong Kong missed a trick there, should have reviewed it. 17.2 overs (4 Runs) FOUR! Back-to-back boundaries! Shukla brings the keeper up and bowls it on a hard length. The ball though is a bit wider and Suryakumar Yadav manages to edge it past the man at short third man for another boundary. The 50 partnership comes up between these two as well. 17.1 overs (4 Runs) FOUR! All the good work done by Ehsan Khan in the previous over is instantly undone. Pitched up, around off, Suryakumar Yadav backs away and lofts it over wide mid off for a boundary. Change in bowling. Ayush Shukla to bowl out. 1 for 14 from him so far. 16.6 overs (1 Run) Bye! Fires it in very full and wide, just inside the tramline outside off. Suryakumar Yadav leaves it alone and the keeper fails to collect it cleanly on the full. The ball goes towards short third man and the batters get a bye. Outstanding over by Ehsan, only 4 runs at this stage is gold. 16.5 overs (0 Run) Exceptional bowling this from Ehsan Khan and he is doing his best to curtail the damage here. Nails another yorker around middle and SKY can only jam it out. 16.4 overs (1 Run) Keeps it full and around off, nicely driven down to long off for just one more. 16.3 overs (1 Run) Nicely bowled! Fires in a yorker now on middle, Suryakumar Yadav looks to whip it away but the ball goes off the inside edge and onto the pads. The ball then rolls onto the off side as the batters sneak in a single. 16.2 overs (1 Run) Fired in again, on off stump, Kohli goes on the back foot and knocks it down to long on for a run. 16.1 overs (0 Run) Fuller and quicker, close to the off pole, Kohli tries the cheeky reverse-paddle but is beaten for pace. 15.6 overs (1 Run) Goes shorter now, around off, Kohli doesn't quite get the timing on the pull shot right and hits it towards deep mid-wicket for a single. 20 off that one, a huge over for India. Ehsan Khan is back on to bowl at the death. 0 for 10 in his 2 overs so far. 15.6 overs (1 Run) WIDE! Aizaz Khan errs in line this time and adds to his own misery. Attempted slower one, sliding down the leg side and a wide is called. 15.5 overs (1 Run) Hit hard but straight to the man. Good length, around off, Suryakumar Yadav skips down the track and hammers it uppishly towards sweeper cover for a single. 15.4 overs (6 Runs) SIX! 17 off the over and there are still a couple of deliveries left! This is just primetime Suryakumar Yadav. Length again, over middle and leg, SKY gets low and inside the line of the ball to scoop it back over the keeper's head for a maximum. 15.3 overs (4 Runs) FOUR! The boundaries just keep flowing from SKY's bat! Length again, there's width on offer as well. Yadav backs away and just lifts it off the top edge over short third man for a boundary. 15.2 overs (1 Run) Good length, around the top of off, Kohli hangs back and steers it towards short third man for a single. 15.1 overs (6 Runs) SIX! Bang goes Virat Kohli! Aizaz Khan serves a length ball, angling on the pads. Kohli steps out and lofts it high and handsome over the wide long on fence for a maximum.","pubDate":"2022-08-31 15:29:45","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637975763769510043.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"“Biggest fraud in Indian cricket”: KL Rahul memes and funniest Twitter reactions after struggling innings vs Hong Kong","link":"https://thesportsrush.com/cricket-news-biggest-fraud-in-indian-cricket-kl-rahul-memes-and-funniest-twitter-reactions-after-struggling-innings-vs-hong-kong/","keywords":["Cricket","asia cup","Asia Cup 2022","Hong Kong","India","KL Rahul"],"creator":["Dixit Bhargav"],"video_url":null,"description":"KL Rahul memes: The Indian vice-captain played a lacklustre knock at the Dubai International Cricket Stadium tonight. During the fourth match of Asia Cup 2022 between India and Hong Kong in Dubai, India vice-captain KL Rahul didn’t help himself or his position as an opening batter in the T20I squad by scoring 36 (39) at… The post “Biggest fraud in Indian cricket”: KL Rahul memes and funniest Twitter reactions after struggling innings vs Hong Kong appeared first on The SportsRush.","content":"KL Rahul memes: The Indian vice-captain played a lacklustre knock at the Dubai International Cricket Stadium tonight. During the fourth match of Asia Cup 2022 between India and Hong Kong in Dubai, India vice-captain KL Rahul didn’t help himself or his position as an opening batter in the T20I squad by scoring 36 (39) at a strike rate of 92.30. Opening the batting with captain Rohit Sharma (21), Rahul ditched India’s recently preferred attacking approach at the top of the order by scoring 16 (20) in the powerplay. Lack of pace in both the opposition’s bowling attack and Dubai International Cricket Stadium pitch, Rahul could neither generate any kind of pace nor find a way to break the shackles. The right-handed batter not taking enough risks further added to his woes tonight. While Rahul did try a few innovative shots against the spinners, lack of timing and execution resulted in him reaping minimum rewards. Looking out of sorts to an unbelievable extent, Rahul’s outdated approach acted as fuel to fire with respect to his approach in the shortest format. In times when contemporary top-order batters aren’t averse to playing risk-involving shots, Rahul adopting an archetype conventional approach is unequivocally objectionable. KL Rahul memes and funniest Twitter reactions after struggling innings vs Hong Kong KL Rahul is Biggest Fraud in Indian Cricket I REPEAT KL Rahul is Biggest Fraud in Indian Cricket — Amit Kumar (@AMIT_GUJJU) August 28, 2022 Yes, the pitch is slow. But 36 in 39 is a bizarre innings from KL Rahul. We’ve heard so much about India wanting to play a new brand of cricket when it comes to batting. No evidence of that in this tournament.#INDvHK #AsiaCup — Anand Vasu (@anandvasu) August 31, 2022 So much talk around the new template only to watch KL Rahul and Virat Kohli bat at run-a-ball. #INDvHK #AsiaCup — Subhayan Chakraborty (@CricSubhayan) August 31, 2022 Is there something in the pitch that is not visible. Simply can’t fathom this approach especially from KL Rahul. #IndvsHkg — Venkatesh Prasad (@venkateshprasad) August 31, 2022 KL Rahul on work that too against Hong Kong, setting such level of bars for upcoming youngsters KL Rahul the true ambassador of Academy #INDvHK — TukTuk Academy (@TukTuk_Academy) August 31, 2022 What on earth is driving KL Rahul to bat with this “approach” when India have been so vocal about aggressive intent. #INDvHK — Mayank (@kmayank9) August 31, 2022 It was an ordeal that’s just ended for KL Rahul – a real ordeal #INDvHK — Vikrant Gupta (@vikrantgupta73) August 31, 2022 KL Rahul’s attacking shots in the Powerplay: 1 The one he nailed for six off a free-hit. — Shashank Kishore (@captainshanky) August 31, 2022 Kl Rahul as an opener in T20Is is something I never liked! I would rather prefer opening with Rishabh Pant even if that means a lot of risk! #INDvHK #AsiaCup2022 — Mohsin Kamal (@64MohsinKamal) August 31, 2022 KL Rahul gone for 36 from 39. The knives will be out again. He’s not making it easy on himself, and neither are the selectors. He’s just not an effective enough opener in modern T20i’s. #INDvHK — Nikesh Rughani (@NikeshRughani) August 31, 2022 Indians reacting to KL Rahul’s wicket: pic.twitter.com/KZw5vY1ciR — Shibhhuu (@shibhhuu) August 31, 2022 Nothing just a picture of Indian fans watching KL Rahul’s horrendous inings #INDvHK #AsiaCupT20 pic.twitter.com/zLWwwHVarc — Shikhar Rai (@shikhar_29_03) August 31, 2022 Kl rahul to fans after playing statpading innings #klrahul #IndvsHkg #AsiaCup2022 pic.twitter.com/qlBdroJ0YH — gurkaran (@gurkaransinghhh) August 31, 2022   The post “Biggest fraud in Indian cricket”: KL Rahul memes and funniest Twitter reactions after struggling innings vs Hong Kong appeared first on The SportsRush.","pubDate":"2022-08-31 15:27:51","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"India vs Hong Kong, Asia Cup 2022 LIVE Updates: Suryakumar Yadav Blitz Continues As Virat Kohli Nears Fifty - NDTV Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMieWh0dHBzOi8vc3BvcnRzLm5kdHYuY29tL2FzaWEtY3VwLTIwMjIvaW5kaWEtdnMtaG9uZy1rb25nLWFzaWEtY3VwLTIwMjItZ3JvdXAtYS1tYXRjaC1pbmQtdnMtaGstbGl2ZS1zY29yZS11cGRhdGVzLTMzMDMyOTTSAX9odHRwczovL3Nwb3J0cy5uZHR2LmNvbS9hc2lhLWN1cC0yMDIyL2luZGlhLXZzLWhvbmcta29uZy1hc2lhLWN1cC0yMDIyLWdyb3VwLWEtbWF0Y2gtaW5kLXZzLWhrLWxpdmUtc2NvcmUtdXBkYXRlcy0zMzAzMjk0L2FtcC8x?oc=5","keywords":null,"creator":null,"video_url":null,"description":"India vs Hong Kong, Asia Cup 2022 LIVE Updates: Suryakumar Yadav Blitz Continues As Virat Kohli Nears Fifty  NDTV SportsA tale of two India-Pakistan matches and the grand failure of ‘cricket diplomacy’  FirstpostMatch Preview - India vs Hong Kong, Asia Cup 2022, 4th Match, Group A  ESPNcricinfoIndia vs Hong Kong Live: Kohli, SKY blazing away as IND look to take off  Hindustan Times\"Made One Mistake\": Pakistan Legend Points Out Fault In Babar Azam's Captaincy Post Loss To India  NDTV SportsView Full coverage on Google News","content":null,"pubDate":"2022-08-31 15:24:30","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Gautam Gambhir slams Rohit Sharma's team selection vs Hong Kong, says 'if you are playing Rishabh Pant..'","link":"https://zeenews.india.com/cricket/ind-vs-hong-kong-asia-cup-2022-gautam-gambhir-slams-rohit-sharmas-team-selection-says-if-you-are-playing-rishabh-pant-2504310.html","keywords":null,"creator":null,"video_url":null,"description":"Gambhir added that Pant has done well in Tests and he has just begun to do well in white-ball cricket for India. He said that he should be given a long run in white ball games.","content":"Former Indian batter Gautam Gambhir feels replacing Hardik Pandya with Rishabh Pant in the playing XI vs Hong Kong was not the best decision taken by captain Rohit Sharma on Wednesday (August 31). He did not say that Pant should not be in the playing XI, he said that if Pant is picked, he should be picked in place of Dinesh Karthik. Gambhir said that if Hardik is rested, then Deepak Hooda should have been picked in his place and not Pant. \"If you are playing Rishabh Pant then it should have been in place of Dinesh Karthik. If you are resting Hardik Pandya then Deepak Hooda should have played,\" Gambhir was speaking to Star Sports anchor Mayanti Langer ahead of the India vs Hong Kong clash in Asia Cup. Gambhir added that Pant has done well in Tests and he has just begun to do well in white-ball cricket for India. He said that he should be given a long run in white ball games. He added that he should go to T20 World Cup 2022 ahead of Rishabh Pant and not Dinesh Karthik as he is a left-handed batter and has experience of playing in Australia, where he has done very well. There has been a big depate in recent times over Dinesh Karthik and Rishabh Pant that who should be India's first choice wicketkeeper in the shortest format of the game. The debate used to be earlier between Pant and Ishan Kishan but things changed after IPL 2022 where Karthik played some outstanding knocks and became a big contender for a slot in the Indian team. Deepak Hooda too has taken a huge leap since IPL. He has proven his worth in the team with a fantastic 100 vs Ireland recently. Gambhir is a big fan of Deepak and that is why he picked him in his Lucknow Super Giants squad earlier this year.","pubDate":"2022-08-31 15:18:00","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"Caribbean Premier League 2022 All Teams squad and Player List","link":"https://thesportsrush.com/cricket-news-caribbean-premier-league-2022-all-teams-squad-and-player-list/","keywords":["Cricket","Caribbean Premier League","CPL","CPL 2022"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Caribbean Premier League 2022 All Teams squad: The 10th season of the Caribbean Premier League commences tonight. Cricket West Indies’ premier T20 tournament, the Caribbean Premier League (CPL) is all set to commence today, with six men’s teams to battle it out for the coveted title. Also, the three women’s team will compete in the… The post Caribbean Premier League 2022 All Teams squad and Player List appeared first on The SportsRush.","content":"Caribbean Premier League 2022 All Teams squad: The 10th season of the Caribbean Premier League commences tonight. Cricket West Indies’ premier T20 tournament, the Caribbean Premier League (CPL) is all set to commence today, with six men’s teams to battle it out for the coveted title. Also, the three women’s team will compete in the inaugural edition of the tournament, starting today as well. While the grand finale for the men will take place on October 1, the women’s championship will be a four-day affair with the finals to take place on September 5. The six men’s teams will play the 10th edition of league with the Jamaica Tallawahs and St Kitts & Nevis Patriots to play in the tournament opener at the Warner Park in St Kitts. Good morning from St Kitts & Nevis as we get set to start the WCPL and CPL! #CPL22 #WCPL #CricketPlayedLouder #BiggestPartyInSport pic.twitter.com/Lgo2bZlYNU — CPL T20 (@CPL) August 31, 2022 Caribbean Premier League 2022 All Teams squad (men’s) Barbados Royals David Miller (c), Jason Holder, Obed McCoy, Kyle Mayers, Hayden Walsh Jr., Devon Thomas, Oshane Thomas, Nyeem Young, Quinton de Kock, Mujeeb Ur Rahman, Azam Khan, Corbin Bosch, Rahkeem Cornwall, Joshua Bishop Justin Greaves Teddy Bishop, Ramon Simmonds, Harry Tector. Guyana Amazon Warriors Shimron Hetmyer (c), Odean Smith, Romario Shepherd, Chandrapaul Hemraj, Keemo Paul Gudakesh Motie, Imran Tahir, Tabraiz Shamsi, Colin Ingram, Paul Stirling, Heinrich Klaasen, Jermaine Blackwood, Veerasammy Permaul, Shai Hope, Ronsford Beaton, Matthew Nandu, Junior Sinclair, Shakib Al Hasan. Jamaica Tallawahs Rovman Powell (c), Fabian Allen, Brandon King, Kennar Lewis, Shamarh Brooks, Sandeep Lamichhane Imad Wasim, Mohammad Amir, Migael Pretorius, Chris Green, Raymon Reifer, Jamie Merchant, Amir Jangoo, Shamar Springer, Nicholson Gordon, Kirk McKenzie, Joshua James. St Kitts & Nevis Patriots Dwayne Bravo (c), Evin Lewis, Andre Fletcher, Darren Bravo, Sherfane Rutherford, Sheldon Cottrell, Dominic Drakes, Wanindu Hasaranga, Dwaine Pretorius, Dewald Brevis, Izharulhaq Naveed, Qasim Akram, Joshua Da Silva, Jon-Russ Jaggesar, Keacy Carty, Kelvin Pittman, Jaden Carmichael. Saint Lucia Kings Faf du Plessis (c), Roston Chase, Johnson Charles, Kesrick Williams, Alzarri Joseph, Mark Deyal, Jeavor Royal, Tim David, David Wiese, Scott Kuggeleijn, Matthew Forde, Leroy Lugg, Preston McSween, Larry Edwards, Ackeem Auguste, Rivaldo Clarke. Trinbago Knight Riders Kieron Pollard (c), Andre Russell, Sunil Narine, Nicholas Pooran, Akeal Hosein, Jayden Seales Tion Webster, Colin Munro, Maheesh Theekshana, Tim Seifert, Seekkuge Prasanna, Ali Khan, Khary Pierre, Anderson Phillip,Terrance Hinds, Leonardo Julien, Shaaron Lewis, Daryn Dupavillon. Caribbean Premier League 2022 All Teams squad (women’s) Barbados Royals Hayley Matthews (c), Shakera Selman, Fatima Sana, Chloe Tryon, Snigdha Paul, Reneice Boyce, Mandy Rangru, Britney Cooper, Aaliyah Alleyne, Shanika Bruce, Afy Fletcher, Qiana Joseph, Japhina Joseph, Chinelle Henry. Guyana Amazon Warriors Stafanie Taylor (c), Shermaine Campbell, Chamari Athapaththu, Ayabonga Khaka, Isani Vaghela, Rashada Williams, Rachel Vincent, Kaycia Schultz, Chedean Nationa, Cherry-Ann Fraser, Shamilla Connell, Karishma Ramharak, Shabika Gajnabi, Zaida James. Trinbago Knight Riders Deandra Dottin (c), Anisa Mohammed, Hayley Jensen, Sune Luus, Geetika Kodali, Lee Ann Kirby, Kyshona Knight, Kycia Knight, Natasha McLean, Sheneta Grimmond, Caneisha Isaac, Jannillea Glasgow, Steffie Soogrim, Shawnisha Hector. The post Caribbean Premier League 2022 All Teams squad and Player List appeared first on The SportsRush.","pubDate":"2022-08-31 15:15:49","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"}]}