{"newsArray":[{"title":"IND vs PAK: Pakistan's Abdul Razzaq Makes Shocking 'Bilateral Series' Allegation On Team India","link":"https://news.abplive.com/sports/cricket/pakistan-s-abdul-razzaq-makes-shocking-bilateral-series-allegation-on-team-india-1614819","keywords":["Cricket"],"creator":["ABP News Bureau"],"video_url":null,"description":"The 2023 edition of ODI World Cup begins in October where arch-nemesis India and Pakistan will square off at world's largest cricket stadium, Ahmedabad's Narendra Modi Stadium on October 15. Notably, this would be the first time since 2016 when Pakistan would play an international match in India. The last bilateral series between India and Pakistan was played in the year 2012-13 on Indian soil. Notably, Pakistan cricket team are yet to get an official clearance from their government to arrive in India for the mega tournament. ALSO WATCH: Crowd Showers Flowers On MS Dhoni As CSK Legend Arrives In Chennai For Movie Trailer Launch Ahead of the highly-anticipated India vs Pakistan ODI World Cup 2023 match, ex-Pakistan all-rounder Abdul Razzaq made a shocking statement about the 'Men in Blue'. Razzaq said that India hadn't played Pakistan much in 1997-98, because they were afraid of losing as Pakistan were too formidable. “We share mutual respect and friendship. There's only Indian team that doesn't play against Pakistan. From 1997-98, they didn't play much against us because we were too good, India always used to lose. Now, situation has changed, we are in 2023, but we have to change our thinking. No team is big or small, the performance on the day matters,” Razzaq told EHCricket. Encouraging bilateral series resumption between India and Pakistan, Razzaq said he would love to see the two nations play a series against each other in the future. \"Both teams are good. You can't say Pakistan team is weak. You see the Ashes series, can you point out which team is better? The team which performs wins, as simple as that. We have to get out of this and play matches, series against each other,\" he added. Before the 2023 ODI World Cup, Pakistan and India will square off in the Asia Cup 2023, jointly hosted by Pakistan and Sri Lanka.","content":"The 2023 edition of ODI World Cup begins in October where arch-nemesis India and Pakistan will square off at world's largest cricket stadium, Ahmedabad's Narendra Modi Stadium on October 15. Notably, this would be the first time since 2016 when Pakistan would play an international match in India. The last bilateral series between India and Pakistan was played in the year 2012-13 on Indian soil. Notably, Pakistan cricket team are yet to get an official clearance from their government to arrive in India for the mega tournament. ALSO WATCH: Crowd Showers Flowers On MS Dhoni As CSK Legend Arrives In Chennai For Movie Trailer Launch Ahead of the highly-anticipated India vs Pakistan ODI World Cup 2023 match, ex-Pakistan all-rounder Abdul Razzaq made a shocking statement about the 'Men in Blue'. Razzaq said that India hadn't played Pakistan much in 1997-98, because they were afraid of losing as Pakistan were too formidable. googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); “We share mutual respect and friendship. There's only Indian team that doesn't play against Pakistan. From 1997-98, they didn't play much against us because we were too good, India always used to lose. Now, situation has changed, we are in 2023, but we have to change our thinking. No team is big or small, the performance on the day matters,” Razzaq told EHCricket. Encouraging bilateral series resumption between India and Pakistan, Razzaq said he would love to see the two nations play a series against each other in the future. \"Both teams are good. You can't say Pakistan team is weak. You see the Ashes series, can you point out which team is better? The team which performs wins, as simple as that. We have to get out of this and play matches, series against each other,\" he added. Before the 2023 ODI World Cup, Pakistan and India will square off in the Asia Cup 2023, jointly hosted by Pakistan and Sri Lanka.","pubDate":"2023-07-10 05:44:20","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/07/10/51fdf69d25aebbd12e669117fe53de55168896780736424_original.jpg","source_id":"abplive","category":["sports"],"country":["india"],"language":"english"},{"title":"Happy Birthday Sunil Gavaskar: सुनील गावस्कर को जन्मदिन पर युवराज सिंह दी बधाई, लिखा \"आपका वर्ष अच्छे स्वास्थ्य, खुशियों और सफलता से भरा हो\"","link":"https://hindi.latestly.com/socially/sports/cricket/happy-birthday-sunil-gavaskar-yuvraj-singh-congratulated-sunil-gavaskar-on-his-birthday-in-this-way-see-tweet-1859579.html","keywords":null,"creator":null,"video_url":null,"description":"पूर्व भारतीय दिग्गज क्रिकेटर सुनील गावस्कर आज 74 वर्ष के हो गए है. गावस्कर क्रिकेट जगत के महानतम भारतीय बल्लेबाजों में से एक है, जिन्होंने टेस्ट क्रिकेट में सबसे पहले 10,000 रन बनाए.","content":"पूर्व भारतीय दिग्गज क्रिकेटर सुनील गावस्कर आज 74 वर्ष के हो गए है. गावस्कर क्रिकेट जगत के महानतम भारतीय बल्लेबाजों में से एक है, जिन्होंने टेस्ट क्रिकेट में सबसे पहले 10,000 रन बनाए. इस दौरान उनके जन्मदिन पर पूर्व भारतीय बल्लेबाज युवराज सिंह ने अपने ट्विटर हैंडल पर लिटिल मास्टर को शुभकामनाएं दीं, युवराज ने अपने ट्वीट में लिखा \" एक महान इंसान और एक महान व्यक्ति को जन्मदिन की बहुत-बहुत शुभकामनाएं, जो पीढ़ियों को प्रेरित करते रहे 🎂 आशा है कि आपका वर्ष अच्छे स्वास्थ्य, खुशियों और सफलता से भरा हो, सनी भाई\" देखें ट्वीट: Wishing a very Happy Birthday to a great human being and a legend who continues to inspire across generations 🎂 Hope you have a fabulous year filled with good health, happiness and success Sunny bhai 🤗 🎉 #SunilGavaskar @harbhajan_singh pic.twitter.com/enyrJXKiik — Yuvraj Singh (@YUVSTRONG12) July 10, 2023 (SocialLY के साथ पाएं लेटेस्ट ब्रेकिंग न्यूज, वायरल ट्रेंड और सोशल मीडिया की दुनिया से जुड़ी सभी खबरें. यहां आपको ट्विटर, इंस्टाग्राम और यूट्यूब पर वायरल होने वाले हर कंटेंट की सीधी जानकारी मिलेगी. ऊपर दिखाया गया पोस्ट अनएडिटेड कंटेंट है, जिसे सीधे सोशल मीडिया यूजर्स के अकाउंट से लिया गया है. लेटेस्टली स्टाफ द्वारा इसमें कोई बदलाव या एडिट नहीं किया गया है. सोशल मीडिया पोस्ट लेटेस्टली के विचारों और भावनाओं का प्रतिनिधित्व नहीं करता है, हम इस पोस्ट में मौजूद किसी भी कंटेंट के लिए कोई जिम्मेदारी या दायित्व स्वीकार नहीं करते हैं.)","pubDate":"2023-07-10 05:16:04","image_url":null,"source_id":"latestly","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Expected more from Rohit: Gavaskar left disappointed by Indian team skipper's captaincy","link":"https://www.indiatoday.in/sports/cricket/story/indian-cricket-team-rohit-sharma-captaincy-sunil-gavaskar-rahul-dravid-wtc-final-loss-2404267-2023-07-10?utm_source=rss","keywords":null,"creator":null,"video_url":null,"description":"Expected more from Rohit: Gavaskar left disappointed by Indian team skipper's captaincy","content":": Sunil Gavaskar has said that he has been disappointed with Rohit Sharma's tenure as the captain of the Indian team and said he expected more from the opening batter. took over as the full-time captain of the Indian side in February last year after Virat Kohli's time as the skipper came to an end. While India's record in bilateral home series has been good under the opener, the team has struggled to find success in major tournaments. India bowed out in the semi-finals of the T20 World Cup in Australia last year and went on to lose the World Test Championship 2023 final against the Aussies last month at the Oval. Speaking at the Indian Express Idea Exchange, Gavaskar said that he expected more from Rohit as the captain and has been left disappointed with a few aspects of his reign. “I expected more from him (Rohit). In India it is different, but when you do well overseas that is really the test. That is where he has been a little disappointing. Even in the T20 format, with all the experience of the IPL, hundreds of matches as captain, with a mix of best IPL players not being able to get to the finals has been disappointing.” Gavaskar also wanted to know if a review of the captain and the team management was done in the aftermath of the losses of the Indian team. The legendary batter specifically pointed out to the WTC Final and said Rohit and coach should have been asked about the decisions they made during the match. “They should be asking questions, ‘Why did you field first?’ Okay, it was explained at the toss that it was overcast and all. The question after that should be, ‘You didn’t know about Travis Head’s weakness against the short ball?’ Why was the bouncer employed only when he had scored 80 runs. You know, the moment Head came in to bat, in the commentary box, we had Ricky Ponting saying, ‘Bounce him, bounce him.’ Everyone knew about it but we didn’t try.”","pubDate":"2023-07-10 04:44:22","image_url":null,"source_id":"indiatoday","category":["sports"],"country":["india"],"language":"english"},{"title":"WATCH: Crowd Showers Flowers On MS Dhoni As CSK Legend Arrives In Chennai For Movie Trailer Launch","link":"https://news.abplive.com/sports/cricket/csk-ms-dhoni-viral-video-fans-showers-flowers-on-ms-dhoni-arrives-in-chennai-for-lsm-trailer-launch-1614805","keywords":["Cricket"],"creator":["ABP News Bureau"],"video_url":null,"description":"Five-time Indian Premier League title winner Mahendra Singh Dhoni received a thunderous welcome from fans gathered outside the arrival gate of Chennai airport to welcome 'Thala' at his second home. In an emotional gesture, fans showered flowers on legendary Chennai Super Kings captain, while cheering 'Dhoni, Dhoni'. It is believed that MS Dhoni arrived at Chennai to attend the trailer launch of a Tamil film titled LGM, which is being produced under the banner of Dhoni Entertainment Pvt Ltd. As per reports, the trailer launch will take place on July 10 (Monday) and Dhoni will be accompanied by his wife Sakshi at the event. ALSO WATCH | Virat Kohli Hailed As 'Biggest Name In Team India' By Fan In Dominica Ahead Of IND vs WI 1st Test Watch below viral video of MS Dhoni receiving grand welcome at Chennai airport from die-hard fans  Thala Dhoni in Chennai for the Audio and Trailer launch of his first production Movie LGM 💛#MSDhoni #LGM pic.twitter.com/hzwwcOcfAN — WhistlePodu Army ® - CSK Fan Club (@CSKFansOfficial) July 9, 2023 MS Dhoni-led Chennai Super Kings defeated Hardik Pandya-led Gujarat Titans to win their record-equalling fifth Indian Premier League trophy, making Dhoni join-most successful captain in the history of world's richest T20 tournament. It was highly anticipated that 42-year-Dhoni would announce retirement from IPL after this season. However, the legendary wicketkeeper hinted that if his body allows, he might return to play IPL 2024. \"Circumstantially, this is the best time to announce my retirement. But the amount of love I have received all over, the easy thing would be to walk away from here, but the harder thing would be to work hard for nine months and try to play another IPL. It would be a gift from me, won't be easy on the body,\" Dhoni had said in the post-match interview after winning the IPL 2023 final.","content":"Five-time Indian Premier League title winner Mahendra Singh Dhoni received a thunderous welcome from fans gathered outside the arrival gate of Chennai airport to welcome 'Thala' at his second home. In an emotional gesture, fans showered flowers on legendary Chennai Super Kings captain, while cheering 'Dhoni, Dhoni'. It is believed that MS Dhoni arrived at Chennai to attend the trailer launch of a Tamil film titled LGM, which is being produced under the banner of Dhoni Entertainment Pvt Ltd. As per reports, the trailer launch will take place on July 10 (Monday) and Dhoni will be accompanied by his wife Sakshi at the event. ALSO WATCH | Virat Kohli Hailed As 'Biggest Name In Team India' By Fan In Dominica Ahead Of IND vs WI 1st Test Watch below viral video of MS Dhoni receiving grand welcome at Chennai airport from die-hard fans Thala Dhoni in Chennai for the Audio and Trailer launch of his first production Movie LGM 💛 #MSDhoni #LGM pic.twitter.com/hzwwcOcfAN googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); — WhistlePodu Army ® - CSK Fan Club (@CSKFansOfficial) July 9, 2023 MS Dhoni-led Chennai Super Kings defeated Hardik Pandya-led Gujarat Titans to win their record-equalling fifth Indian Premier League trophy, making Dhoni join-most successful captain in the history of world's richest T20 tournament. It was highly anticipated that 42-year-Dhoni would announce retirement from IPL after this season. However, the legendary wicketkeeper hinted that if his body allows, he might return to play IPL 2024. \"Circumstantially, this is the best time to announce my retirement. But the amount of love I have received all over, the easy thing would be to walk away from here, but the harder thing would be to work hard for nine months and try to play another IPL. It would be a gift from me, won't be easy on the body,\" Dhoni had said in the post-match interview after winning the IPL 2023 final.","pubDate":"2023-07-10 04:38:08","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/07/10/a47c6881ad59b2b6cfb3ccca7e85c316168896382116724_original.jpg","source_id":"abplive","category":["sports"],"country":["india"],"language":"english"},{"title":"It was a brilliant game of cricket: Hussain as England win Headingley Test","link":"https://www.indiatoday.in/sports/cricket/story/ashes-2023-it-was-a-brilliant-game-of-cricket-says-nasser-hussain-as-england-win-headingley-test-2404262-2023-07-10?utm_source=rss","keywords":null,"creator":null,"video_url":null,"description":"It was a brilliant game of cricket: Hussain as England win Headingley Test","content":": Former England captain Nasser Hussain has said that the third Ashes 2023 Test was a brilliant game of cricket. by three wickets at Headingley to claim their first win of the series. Speaking after the third Test, Hussain said it was a brilliant match, adding that Australia would be trying to work out where they lost the game. England chased down a 251-run target on Day 4 at Headingley with three wickets in hand. “The third Test at Headingley was a brilliant game of cricket, and Australia will probably feel what England have felt in the past two games where they played a lot of good cricket and will try to work out where they lost it,” said Hussain. \"Mark Wood you little ripper!\" ð¬ Every Wood and Woakes boundary on our way to victory in Leeds! ðå | — England Cricket (@englandcricket) Speaking about England’s batting approach in the final innings, Hussain said both Chris Woakes and Mark Wood got their approach right when they came out ot bat on Day 4. Woakes remained unbeaten on 32, while Wood chipped in with an 8-ball 16. “In that situation, Wood fending it off and trying to survive is not going to score as many runs as Wood taking them on. It's the same with Chris Woakes; I thought he got it spot on with the tempo when he went in on day four. Hanging around was not going to do it, he had to put the pressure back on the opposition and he did it perfectly,” Husain added. He went on to heap praise on Wood, saying he is loved by the Headingley crown and his teammates because of his heart. Wood picked seven wickets and scored 40 quick-fire runs across the two innings to help England win at Headingley. “His stats aren't why his team-mates or why the Headingley crowd love Mark Wood, they love him because of his heart. You know when a cricketer is giving it everything. He'll get injured, he'll pick himself up and he'll go again, and that's all you can ask from a team-mate or an international cricketer,” said Hussain. With this victory, England now trail Australia 1-2 in the five-match Ashes 2023 series, with the fourth game set to be played at the Old Trafford Cricket Ground on July 19.","pubDate":"2023-07-10 04:36:48","image_url":null,"source_id":"indiatoday","category":["sports"],"country":["india"],"language":"english"},{"title":"Ashes 2023: \"टीम की जीत में योगदान देकर खुश हूँ\" मार्क वुड ने दिया बड़ा बयान","link":"https://hindi.latestly.com/sports/cricket/ashes-2023-happy-to-contribute-to-the-teams-victory-mark-wood-made-a-big-statement-1859474.html","keywords":null,"creator":null,"video_url":null,"description":"ऑस्ट्रेलिया के खिलाफ तीसरे एशेज टेस्ट में गेंद और बल्ले दोनों से महत्वपूर्ण प्रदर्शन के लिए मैन ऑफ द मैच चुने गए इंग्लैंड के मार्क वुड ने हालांकि कहा कि उन्हें एक ऑलराउंडर माना जाता है और उन्हें बल्लेबाजी के लिए आगे लाया जाता है, जिससे उन्हें फायदा होगा.","content":"लंदन, 10 जुलाई: ऑस्ट्रेलिया के खिलाफ तीसरे एशेज टेस्ट में गेंद और बल्ले दोनों से महत्वपूर्ण प्रदर्शन के लिए मैन ऑफ द मैच चुने गए इंग्लैंड के मार्क वुड ने हालांकि कहा कि उन्हें एक ऑलराउंडर माना जाता है और उन्हें बल्लेबाजी के लिए आगे लाया जाता है, जिससे उन्हें फायदा होगा. यह भी पढ़ें: ENG vs AUS 4th Test: एशेज सीरीज में इंग्लैंड ने की शानदार वापसी, तीसरे टेस्ट में ऑस्ट्रेलिया को तीन विकेट से रौंदा; हैरी ब्रूक ने खेली शानदार पारी वुड ने गेंद से अपना प्रभाव छोड़ा और 5-34 का दावा किया, जिससे ऑस्ट्रेलिया पहली पारी में 263 रन पर ढेर हो गया। इसके बाद उन्होंने निचले क्रम में महत्वपूर्ण 24 रन बनाए और कप्तान बेन स्टोक्स (80) की मदद से इंग्लैंड को 237 रन तक पहुंचाया और इस तरह ऑस्ट्रेलिया को बड़ी बढ़त नहीं लेने दी. वुड ने 2-66 का दावा किया और फिर क्रिस वोक्स (नाबाद 32) के साथ मैच जिताऊ नाबाद 24 रन की साझेदारी की और विजयी रन बनाकर हेडिंग्ले में जीत पक्की कर दी. उन्होंने कहा कि उन्हें इंग्लैंड को जीत दिलाने और उसका मार्गदर्शन करने में खुशी हो रही है, क्योंकि इससे सीरीज जीवित रहेगी. वुड ने यहां रविवार को मैच प्रस्तुति पोस्ट में कहा, \"निश्चित रूप से यहां आकर खुशी हुई, खासकर मैन ऑफ द मैच के रूप में. हमारे लिए शानदार जीत और इसने श्रृंखला को जीवित रखा. मैं उस ड्रेसिंग रूम में अच्छा नहीं था. दुनिया के कुछ सर्वश्रेष्ठ तेज गेंदबाजों के खिलाफ जाने के लिए यह पहली बार है कि मैंने बल्ले से इंग्लैंड को जीत दिलाई है, इसलिए मुझे खुशी है.\" यह पूछे जाने पर कि क्या गेंद और बल्ले दोनों से योगदान देने के बाद उन्हें एक ऑलराउंडर माना जाना चाहिए, तेज गेंदबाज ने कहा कि ऐसा करना जल्दबाजी होगी. \"इसके लिए बहुत जल्दी, इससे भी अधिक और मेरी नाक से खून बहने लगेगा। मुझे नहीं पता कि यह सबसे तेज़ है, लेकिन पहाड़ी से नीचे आते हुए मैं बॉब विलिस के बारे में सोच रहा था. स्टोक्सी मेरी भूमिका के बारे में बहुत स्पष्ट थे, छोटी गेंद फेंकना. उन्होंने कहा, ''तीखे स्पैल और वह सब कुछ जो मेरे पास है, दे दो. अभी भी कुछ चीजों पर काम करना बाकी है. दोनों पक्षों ने पूंछ पर कड़ी मेहनत की है और हमें इसका मुकाबला करना होगा.'' उन्होंने कहा कि उन्हें यकीन नहीं है कि पहली पारी में उनके 24 रनों ने बड़ा प्रभाव डाला या नहीं. वुड ने कहा, \"मैं इससे खुश था, प्रभाव के बारे में नहीं जानता. कुछ रन बनाकर खुशी हुई. हम जहां भी जाते हैं, वहां समर्थन अद्भुत है, लेकिन उत्तर में यह हमेशा बेहतर होता है, है ना?\"","pubDate":"2023-07-10 04:24:58","image_url":null,"source_id":"latestly","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Sunil Gavaskar Slams Rohit Sharma's Captaincy, Wants BCCI To Ask Tough Questions From Rahul Dravid","link":"https://news.abplive.com/sports/cricket/odi-world-cup-2023-latest-news-sunil-gavaskar-slams-rohit-sharma-s-captaincy-wants-bcci-to-ask-tough-questions-from-rahul-dravid-1614796","keywords":["Cricket"],"creator":["ABP News Bureau"],"video_url":null,"description":"Sunil Gavaskar On Rohit Sharma Captaincy: Team India's all-format captain Rohit Sharma faced tons of criticism after India's humiliating loss against Australia in the World Test Championship (WTC) final. After Virat Kohli's exit as India captain, Rohit was assigned as the new team leader in all three formats. Everyone expected the senior opener to end India's ICC trophy drought, but Rohit has not been able to do that so far and the upcoming ODI World Cup 2023, in all likelihood, will be his last assignment as India captain. ALSO WATCH | Virat Kohli Hailed As 'Biggest Name In Team India' By Fan In Dominica Ahead Of IND vs WI 1st Test Meanwhile, former India skipper Sunil Gavaskar stated his disappointment with Rohit Sharma and gave a scathing analysis of the senior opener's captaincy tenure. Gavaskar said that despite having some quality players and a lot of experience in T20, it was highly disappointing to not see the Indian team reach the final of the T20 World Cup 2023. Rohit-led India suffered an embarrassing 10-wicket loss against England in the semi-final. \"I expected more from him (Rohit). In India it is different, but when you do well overseas that is really the test. That is where he has been a little disappointing. Even in the T20 format, with all the experience of the IPL, hundreds of matches as captain, with a mix of best IPL players not being able to get to the finals has been disappointing,\" said Gavaskar to the Indian Express Idea Exchange. Gavaskar called upon the BCCI and selectors to ask tough questions to Rohit and Rahul Dravid.  \"They should be asking questions, Why did you field first? Okay, it was explained at the toss that it was overcast and all. The question after that should be, 'You didn't know about Travis Head's weakness against the short ball?' Why was the bouncer employed only when he had scored 80 runs. You know, the moment Head came in to bat, in the commentary box, we had Ricky Ponting saying, 'Bounce him, bounce him.' Everyone knew about it but we didn't try,\" Gavaskar added.","content":"Sunil Gavaskar On Rohit Sharma Captaincy: Team India's all-format captain Rohit Sharma faced tons of criticism after India's humiliating loss against Australia in the World Test Championship (WTC) final. After Virat Kohli's exit as India captain, Rohit was assigned as the new team leader in all three formats. Everyone expected the senior opener to end India's ICC trophy drought, but Rohit has not been able to do that so far and the upcoming ODI World Cup 2023 , in all likelihood, will be his last assignment as India captain. ALSO WATCH | Virat Kohli Hailed As 'Biggest Name In Team India' By Fan In Dominica Ahead Of IND vs WI 1st Test Meanwhile, former India skipper Sunil Gavaskar stated his disappointment with Rohit Sharma and gave a scathing analysis of the senior opener's captaincy tenure. Gavaskar said that despite having some quality players and a lot of experience in T20, it was highly disappointing to not see the Indian team reach the final of the T20 World Cup 2023. Rohit-led India suffered an embarrassing 10-wicket loss against England in the semi-final. \"I expected more from him (Rohit). In India it is different, but when you do well overseas that is really the test. That is where he has been a little disappointing. Even in the T20 format, with all the experience of the IPL, hundreds of matches as captain, with a mix of best IPL players not being able to get to the finals has been disappointing,\" said Gavaskar to the Indian Express Idea Exchange. googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); Gavaskar called upon the BCCI and selectors to ask tough questions to Rohit and Rahul Dravid. \"They should be asking questions, Why did you field first? Okay, it was explained at the toss that it was overcast and all. The question after that should be, 'You didn't know about Travis Head's weakness against the short ball?' Why was the bouncer employed only when he had scored 80 runs. You know, the moment Head came in to bat, in the commentary box, we had Ricky Ponting saying, 'Bounce him, bounce him.' Everyone knew about it but we didn't try,\" Gavaskar added.","pubDate":"2023-07-10 04:03:47","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/07/10/8fe7c2be807fd30c0cec66e8235c194f168896180504024_original.jpg","source_id":"abplive","category":["sports"],"country":["india"],"language":"english"},{"title":"Ashes 2023: Clarke feels Australia have enough options to replace misfiring Warner","link":"https://www.indiatoday.in/sports/cricket/story/ashes-2023-england-vs-australia-headingley-test-david-warner-poor-form-michael-clarke-2404249-2023-07-10?utm_source=rss","keywords":null,"creator":null,"video_url":null,"description":"Ashes 2023: Clarke feels Australia have enough options to replace misfiring Warner","content":": Michael Clarke feels that Australia have enough options to replace the misfiring David Warner and the decision on the future of the opener is the only call the selectors have to worry about. Warner had showed some fight in the Lord's Test as he scored an aggressive fifty in the first innings. However, the outing at Leeds was one to forget for the opener as he was dismissed twice by his arch-nemesis Stuart Broad. Broad has now dismissed Warner 17 times in his Test career as England won the match at Headingley by three wickets. After the match, Pat Cummins the opener's position in the side for the fourth Ashes 2023 Test at Manchester. Speaking to Sky Sports Radio, as quoted by Fox Sports, Clarke suggested that Australia have got enough options to replace Warner in the side with the former captain feeling that the likes of Mitchell Marsh, Travis Head and Marnus Labuschagne coming into the role to open the innings. “Tell me what they do now ... The No.1 issue is you’ve stuck with Warner, given him every opportunity, and (Stuart) Broad’s still got his number. Is it time?” Clarke said. “If it’s time, I wouldn’t even be thinking about who opens the batting because you’ve got options. “I reckon Mitch Marsh is in form. If he had to do it, he could do it. Alex Carey probably won’t because he’s got to keep, but Travis Head could do it. Marnus Labuschagne isn’t making as many runs as he should at No.3. He could open, Smithy could go to No.3 and Head to No.4 (with Marsh and Green No.5 and No.6).” Clarke said that the only thing selectors would need to think about is if Warner's time up in the side. The former Australian captain said that they should either persist with Warner or play with the batting order to keep Marsh in the side. “The thing you’ve got to think about first is, is David Warner’s time up? And the other thing, if you’re going to bring Cameron Green back in, is he 100 per cent fit to bowl the overs he needs to bowl?\" “I think they should either stick with Warner or play with the batting order and keep Mitch Marsh.”","pubDate":"2023-07-10 03:54:13","image_url":null,"source_id":"indiatoday","category":["sports"],"country":["india"],"language":"english"},{"title":"'Never Imagined The Journey Would...': Virat Kohli Shares Heartwarming Post With Rahul Dravid Ahead Of IND vs WI Dominica Test","link":"https://news.abplive.com/sports/cricket/india-vs-west-indies-1st-test-virat-kohli-shares-heartwarming-post-with-rahul-dravid-ahead-of-ind-vs-wi-dominica-test-1614790","keywords":["Cricket"],"creator":["ABP News Bureau"],"video_url":null,"description":"India vs West Indies Dominica Test: The Indian cricket team will kickstart the India tour of West Indies with the IND vs WI 1st Test from July 12 onwards at Windsor Park, Roseau, Dominica. Team India played its last Test match in Dominica in 2011. In that match, along with Virat Kohli, the current team India head coach Rahul Dravid was also part of the Indian squad, a revelation that Kohli made himself on social media. Rahul Dravid and Virat Kohli return to Dominica's Windsor Park after 12 years after playing together as teammates for the national team in 2011 at the same venue. ALSO WATCH | Virat Kohli Hailed As 'Biggest Name In Team India' By Fan In Dominica Ahead Of IND vs WI 1st Test Kohli took to Instagram to share a heartwarming picture featuring himself and India head coach Rahul Dravid, saying that they are the only two players who were part of the team in the last Test played at Dominica in 2011. \"The only two guys part of the last test we played at Dominica in 2011. Never imagined the journey would bring us back here in different capacities. Highly grateful,\" said Kohli.           View this post on Instagram                       A post shared by Virat Kohli (@virat.kohli)   Back in 2011, team India played a 3-match Test series against West Indies, in which the third Test was played in Dominica and the match ended in a draw. Rahul Dravid scored 5 runs in the first innings of this match and 34 runs in the second innings.Virat Kohli, who played only one innings, managed to score 30 runs. With the third and final Test ending in a draw, India had won the series 1-0. This was Virat Kohli's debut Test series. He made his Test debut for India after playing the first Test match of this series. India's Test team for IND vs WI Test series: Rohit Sharma (Capt), Shubman Gill, Ruturaj Gaikwad, Virat Kohli, Yashasvi Jaiswal, Ajinkya Rahane (VC), KS Bharat (wk), Ishan Kishan (wk), R Ashwin, R Jadeja, Shardul Thakur, Axar Patel, Mohd. Siraj, Mukesh Kumar, Jaydev Unadkat, Navdeep Saini.","content":"India vs West Indies Dominica Test: The Indian cricket team will kickstart the India tour of West Indies with the IND vs WI 1st Test from July 12 onwards at Windsor Park, Roseau, Dominica. Team India played its last Test match in Dominica in 2011. In that match, along with Virat Kohli, the current team India head coach Rahul Dravid was also part of the Indian squad, a revelation that Kohli made himself on social media. Rahul Dravid and Virat Kohli return to Dominica's Windsor Park after 12 years after playing together as teammates for the national team in 2011 at the same venue. ALSO WATCH | Virat Kohli Hailed As 'Biggest Name In Team India' By Fan In Dominica Ahead Of IND vs WI 1st Test Kohli took to Instagram to share a heartwarming picture featuring himself and India head coach Rahul Dravid, saying that they are the only two players who were part of the team in the last Test played at Dominica in 2011. \"The only two guys part of the last test we played at Dominica in 2011. Never imagined the journey would bring us back here in different capacities. Highly grateful,\" said Kohli. googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); View this post on Instagram A post shared by Virat Kohli (@virat.kohli) Back in 2011, team India played a 3-match Test series against West Indies, in which the third Test was played in Dominica and the match ended in a draw. Rahul Dravid scored 5 runs in the first innings of this match and 34 runs in the second innings.Virat Kohli, who played only one innings, managed to score 30 runs. With the third and final Test ending in a draw, India had won the series 1-0. This was Virat Kohli's debut Test series. He made his Test debut for India after playing the first Test match of this series. India's Test team for IND vs WI Test series: Rohit Sharma (Capt), Shubman Gill, Ruturaj Gaikwad, Virat Kohli, Yashasvi Jaiswal, Ajinkya Rahane (VC), KS Bharat (wk), Ishan Kishan (wk), R Ashwin, R Jadeja, Shardul Thakur, Axar Patel, Mohd. Siraj, Mukesh Kumar, Jaydev Unadkat, Navdeep Saini.","pubDate":"2023-07-10 03:15:05","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/07/10/10f014dfc11bb4cbcc9fca6193776dab168895873230124_original.jpg","source_id":"abplive","category":["sports"],"country":["india"],"language":"english"},{"title":"All Blacks captain Sam Cane says sorry after brutally kicking pitch invader after win over Argentina","link":"https://www.dailymail.co.uk/sport/rugbyunion/article-12281393/All-Blacks-captain-Sam-Cane-says-sorry-brutally-kicking-pitch-invader-win-Argentina.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Rugby fans have leapt to the defence of New Zealand skipper Sam Cane after he lashed out and kicked a pitch invader in Argentina, with fans split as to whether he should have to apologise.","content":"All Blacks captain brutally kicks pitch invader… with fans and rugby figures split over the act after the skipper said sorry: 'The only thing he should be apologising for is not going for the coat-hanger' Multiple pitch invaders took to the field All Blacks skipper brutally kicked one Came after side's big win over Argentina By Josh Alston For Daily Mail Australia Published: 22:58 EDT, 9 July 2023 | Updated: 23:04 EDT, 9 July 2023 e-mail View comments Rugby fans have leapt to the defence of New Zealand skipper Sam Cane after he lashed out and kicked a pitch invader in Argentina . The Kiwis were comfortable 41-12 winners over Los Pumas in Mendoza on Sunday morning, with the real drama coming after fulltime. Security staff were overwhelmed as a number of pitch invaders took to the field, coming dangerously close to players. Cane took action when one of the invaders came within a metre of All Blacks players, kicking the man and knocking him to the ground. It invoked memories of Andy Symonds shoulder charging a pitch invader in a cricket match, Sam Kerr shouldering a streaker to the ground in the UK and Johnny Bairstow removing a protestor from the field during The Ashes in another example of athlete's taking things into their own hands. Sam Cane has apologised via social media for kicking a pitch invader following this morning¿s test against Argentina Goes without saying, but this is not a good look for the All Blacks captain pic.twitter.com/M6baJk518A — Andrew Gourdie (@AndrewGourdie) July 9, 2023 New Zealand skipper Sam Cane kicked out at a pitch invader who came too close to the players after their win over Argentina in the Rugby Championship Cane has apologised for his actions on social media but could still face sanction from New Zealand Rugby Cane, 31, has an otherwise exemplary discipline record and is yet to receive a red card in 87 tests for the All Blacks or 150 matches for the Chiefs in Super Rugby level. He took to social media to apologise for the incident and it remains to be seen whether he will face further sanction from NZ Rugby. 'After the game someone ran onto the pitch and I made an error in judgment and played a part in stopping him,' Cane posted. 'I acknowledge this was not my role and it is out of character of me to act in such a way. I am really sorry and am disappointed in myself. 'I am trying my best to contact the individual to apologise and make things right.' He then later added: 'Through the help of many good people, I managed to track down Roman. 'Had a good catch up with him and his friends and I'm glad that we could leave things in a good place.' Footage showed Cane stepping away from the playing group to lash out at the pitch invader who was one of many that stormed the field after the match A pocket of rugby fans strangely leapt to the defence of the pitch invade and called for punishment to be handed down to the Kiwi captain. 'He should be banned for this,' one posted. 'The @AllBlacks coaches have surely got to be questioning what his decision making would be like in the heat of the game,' added another. 'Tripping is sending off infraction. Kane is useless anyway. He won't be missed,' posted another. But most supporters are in favour of Cane's actions, with some saying the pitch invader got off lightly. 'Goes without saying' jog on mate, pitch invaders need to be sorted out. Shame he didn't smash him harder. As soon as a pitch invader goes on the field, they can't complain if they get smashed,' one fan replied to the video of the incident. 'The only thing he should be apologising for is not going in for the coat-hanger,' added another. Cane, pictured with wife Harriet Allen, has an exemplary record and has never received a red card at Super Rugby or international level Cane was influential once again for the All Blacks on the field as New Zealand claimed a comfortable win over Argentina 'Bro players have tackled pitch invaders before why shouldn't he do that that person should know better,' posted another. Newstalk ZB's rugby editor Elliott Smith was at the ground and said there were at least 15 pitch invaders on the ground at the time and the Kiwi skipper had every right to protect himself. 'I have no real issue with what Sam Cane has done here. The pitch invaders were coming from left, right and centre from fulltime - I suspect there would have been 15 or so at least. One nearly took out Damian McKenzie and I as we were speaking for Sky,' Smith said on Twitter. Former All Black Israel Dagg also backed the actions of Cane. 'I would have done the same tbh .. maybe a lazy no arm shoulder!! Stay off the field,' he tweeted. Share or comment on this article: All Blacks captain Sam Cane says sorry after brutally kicking pitch invader after win over Argentina e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-10 03:04:46","image_url":"https://i.dailymail.co.uk/1s/2023/07/10/02/73028467-0-image-a-32_1688953671029.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"IND vs PAK: Pakistan's Abdul Razzaq Makes Shocking 'Bilateral Series' Allegation On Team India","link":"https://news.abplive.com/sports/cricket/pakistan-s-abdul-razzaq-makes-shocking-bilateral-series-allegation-on-team-india-1614819","keywords":["Cricket"],"creator":["ABP News Bureau"],"video_url":null,"description":"The 2023 edition of ODI World Cup begins in October where arch-nemesis India and Pakistan will square off at world's largest cricket stadium, Ahmedabad's Narendra Modi Stadium on October 15. Notably, this would be the first time since 2016 when Pakistan would play an international match in India. The last bilateral series between India and Pakistan was played in the year 2012-13 on Indian soil. Notably, Pakistan cricket team are yet to get an official clearance from their government to arrive in India for the mega tournament. ALSO WATCH: Crowd Showers Flowers On MS Dhoni As CSK Legend Arrives In Chennai For Movie Trailer Launch Ahead of the highly-anticipated India vs Pakistan ODI World Cup 2023 match, ex-Pakistan all-rounder Abdul Razzaq made a shocking statement about the 'Men in Blue'. Razzaq said that India hadn't played Pakistan much in 1997-98, because they were afraid of losing as Pakistan were too formidable. “We share mutual respect and friendship. There's only Indian team that doesn't play against Pakistan. From 1997-98, they didn't play much against us because we were too good, India always used to lose. Now, situation has changed, we are in 2023, but we have to change our thinking. No team is big or small, the performance on the day matters,” Razzaq told EHCricket. Encouraging bilateral series resumption between India and Pakistan, Razzaq said he would love to see the two nations play a series against each other in the future. \"Both teams are good. You can't say Pakistan team is weak. You see the Ashes series, can you point out which team is better? The team which performs wins, as simple as that. We have to get out of this and play matches, series against each other,\" he added. Before the 2023 ODI World Cup, Pakistan and India will square off in the Asia Cup 2023, jointly hosted by Pakistan and Sri Lanka.","content":"The 2023 edition of ODI World Cup begins in October where arch-nemesis India and Pakistan will square off at world's largest cricket stadium, Ahmedabad's Narendra Modi Stadium on October 15. Notably, this would be the first time since 2016 when Pakistan would play an international match in India. The last bilateral series between India and Pakistan was played in the year 2012-13 on Indian soil. Notably, Pakistan cricket team are yet to get an official clearance from their government to arrive in India for the mega tournament. ALSO WATCH: Crowd Showers Flowers On MS Dhoni As CSK Legend Arrives In Chennai For Movie Trailer Launch Ahead of the highly-anticipated India vs Pakistan ODI World Cup 2023 match, ex-Pakistan all-rounder Abdul Razzaq made a shocking statement about the 'Men in Blue'. Razzaq said that India hadn't played Pakistan much in 1997-98, because they were afraid of losing as Pakistan were too formidable. googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); “We share mutual respect and friendship. There's only Indian team that doesn't play against Pakistan. From 1997-98, they didn't play much against us because we were too good, India always used to lose. Now, situation has changed, we are in 2023, but we have to change our thinking. No team is big or small, the performance on the day matters,” Razzaq told EHCricket. Encouraging bilateral series resumption between India and Pakistan, Razzaq said he would love to see the two nations play a series against each other in the future. \"Both teams are good. You can't say Pakistan team is weak. You see the Ashes series, can you point out which team is better? The team which performs wins, as simple as that. We have to get out of this and play matches, series against each other,\" he added. Before the 2023 ODI World Cup, Pakistan and India will square off in the Asia Cup 2023, jointly hosted by Pakistan and Sri Lanka.","pubDate":"2023-07-10 05:44:20","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/07/10/51fdf69d25aebbd12e669117fe53de55168896780736424_original.jpg","source_id":"abplive","category":["sports"],"country":["india"],"language":"english"},{"title":"Happy Birthday Sunil Gavaskar: सुनील गावस्कर को जन्मदिन पर युवराज सिंह दी बधाई, लिखा \"आपका वर्ष अच्छे स्वास्थ्य, खुशियों और सफलता से भरा हो\"","link":"https://hindi.latestly.com/socially/sports/cricket/happy-birthday-sunil-gavaskar-yuvraj-singh-congratulated-sunil-gavaskar-on-his-birthday-in-this-way-see-tweet-1859579.html","keywords":null,"creator":null,"video_url":null,"description":"पूर्व भारतीय दिग्गज क्रिकेटर सुनील गावस्कर आज 74 वर्ष के हो गए है. गावस्कर क्रिकेट जगत के महानतम भारतीय बल्लेबाजों में से एक है, जिन्होंने टेस्ट क्रिकेट में सबसे पहले 10,000 रन बनाए.","content":"पूर्व भारतीय दिग्गज क्रिकेटर सुनील गावस्कर आज 74 वर्ष के हो गए है. गावस्कर क्रिकेट जगत के महानतम भारतीय बल्लेबाजों में से एक है, जिन्होंने टेस्ट क्रिकेट में सबसे पहले 10,000 रन बनाए. इस दौरान उनके जन्मदिन पर पूर्व भारतीय बल्लेबाज युवराज सिंह ने अपने ट्विटर हैंडल पर लिटिल मास्टर को शुभकामनाएं दीं, युवराज ने अपने ट्वीट में लिखा \" एक महान इंसान और एक महान व्यक्ति को जन्मदिन की बहुत-बहुत शुभकामनाएं, जो पीढ़ियों को प्रेरित करते रहे 🎂 आशा है कि आपका वर्ष अच्छे स्वास्थ्य, खुशियों और सफलता से भरा हो, सनी भाई\" देखें ट्वीट: Wishing a very Happy Birthday to a great human being and a legend who continues to inspire across generations 🎂 Hope you have a fabulous year filled with good health, happiness and success Sunny bhai 🤗 🎉 #SunilGavaskar @harbhajan_singh pic.twitter.com/enyrJXKiik — Yuvraj Singh (@YUVSTRONG12) July 10, 2023 (SocialLY के साथ पाएं लेटेस्ट ब्रेकिंग न्यूज, वायरल ट्रेंड और सोशल मीडिया की दुनिया से जुड़ी सभी खबरें. यहां आपको ट्विटर, इंस्टाग्राम और यूट्यूब पर वायरल होने वाले हर कंटेंट की सीधी जानकारी मिलेगी. ऊपर दिखाया गया पोस्ट अनएडिटेड कंटेंट है, जिसे सीधे सोशल मीडिया यूजर्स के अकाउंट से लिया गया है. लेटेस्टली स्टाफ द्वारा इसमें कोई बदलाव या एडिट नहीं किया गया है. सोशल मीडिया पोस्ट लेटेस्टली के विचारों और भावनाओं का प्रतिनिधित्व नहीं करता है, हम इस पोस्ट में मौजूद किसी भी कंटेंट के लिए कोई जिम्मेदारी या दायित्व स्वीकार नहीं करते हैं.)","pubDate":"2023-07-10 05:16:04","image_url":null,"source_id":"latestly","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Expected more from Rohit: Gavaskar left disappointed by Indian team skipper's captaincy","link":"https://www.indiatoday.in/sports/cricket/story/indian-cricket-team-rohit-sharma-captaincy-sunil-gavaskar-rahul-dravid-wtc-final-loss-2404267-2023-07-10?utm_source=rss","keywords":null,"creator":null,"video_url":null,"description":"Expected more from Rohit: Gavaskar left disappointed by Indian team skipper's captaincy","content":": Sunil Gavaskar has said that he has been disappointed with Rohit Sharma's tenure as the captain of the Indian team and said he expected more from the opening batter. took over as the full-time captain of the Indian side in February last year after Virat Kohli's time as the skipper came to an end. While India's record in bilateral home series has been good under the opener, the team has struggled to find success in major tournaments. India bowed out in the semi-finals of the T20 World Cup in Australia last year and went on to lose the World Test Championship 2023 final against the Aussies last month at the Oval. Speaking at the Indian Express Idea Exchange, Gavaskar said that he expected more from Rohit as the captain and has been left disappointed with a few aspects of his reign. “I expected more from him (Rohit). In India it is different, but when you do well overseas that is really the test. That is where he has been a little disappointing. Even in the T20 format, with all the experience of the IPL, hundreds of matches as captain, with a mix of best IPL players not being able to get to the finals has been disappointing.” Gavaskar also wanted to know if a review of the captain and the team management was done in the aftermath of the losses of the Indian team. The legendary batter specifically pointed out to the WTC Final and said Rohit and coach should have been asked about the decisions they made during the match. “They should be asking questions, ‘Why did you field first?’ Okay, it was explained at the toss that it was overcast and all. The question after that should be, ‘You didn’t know about Travis Head’s weakness against the short ball?’ Why was the bouncer employed only when he had scored 80 runs. You know, the moment Head came in to bat, in the commentary box, we had Ricky Ponting saying, ‘Bounce him, bounce him.’ Everyone knew about it but we didn’t try.”","pubDate":"2023-07-10 04:44:22","image_url":null,"source_id":"indiatoday","category":["sports"],"country":["india"],"language":"english"},{"title":"WATCH: Crowd Showers Flowers On MS Dhoni As CSK Legend Arrives In Chennai For Movie Trailer Launch","link":"https://news.abplive.com/sports/cricket/csk-ms-dhoni-viral-video-fans-showers-flowers-on-ms-dhoni-arrives-in-chennai-for-lsm-trailer-launch-1614805","keywords":["Cricket"],"creator":["ABP News Bureau"],"video_url":null,"description":"Five-time Indian Premier League title winner Mahendra Singh Dhoni received a thunderous welcome from fans gathered outside the arrival gate of Chennai airport to welcome 'Thala' at his second home. In an emotional gesture, fans showered flowers on legendary Chennai Super Kings captain, while cheering 'Dhoni, Dhoni'. It is believed that MS Dhoni arrived at Chennai to attend the trailer launch of a Tamil film titled LGM, which is being produced under the banner of Dhoni Entertainment Pvt Ltd. As per reports, the trailer launch will take place on July 10 (Monday) and Dhoni will be accompanied by his wife Sakshi at the event. ALSO WATCH | Virat Kohli Hailed As 'Biggest Name In Team India' By Fan In Dominica Ahead Of IND vs WI 1st Test Watch below viral video of MS Dhoni receiving grand welcome at Chennai airport from die-hard fans  Thala Dhoni in Chennai for the Audio and Trailer launch of his first production Movie LGM 💛#MSDhoni #LGM pic.twitter.com/hzwwcOcfAN — WhistlePodu Army ® - CSK Fan Club (@CSKFansOfficial) July 9, 2023 MS Dhoni-led Chennai Super Kings defeated Hardik Pandya-led Gujarat Titans to win their record-equalling fifth Indian Premier League trophy, making Dhoni join-most successful captain in the history of world's richest T20 tournament. It was highly anticipated that 42-year-Dhoni would announce retirement from IPL after this season. However, the legendary wicketkeeper hinted that if his body allows, he might return to play IPL 2024. \"Circumstantially, this is the best time to announce my retirement. But the amount of love I have received all over, the easy thing would be to walk away from here, but the harder thing would be to work hard for nine months and try to play another IPL. It would be a gift from me, won't be easy on the body,\" Dhoni had said in the post-match interview after winning the IPL 2023 final.","content":"Five-time Indian Premier League title winner Mahendra Singh Dhoni received a thunderous welcome from fans gathered outside the arrival gate of Chennai airport to welcome 'Thala' at his second home. In an emotional gesture, fans showered flowers on legendary Chennai Super Kings captain, while cheering 'Dhoni, Dhoni'. It is believed that MS Dhoni arrived at Chennai to attend the trailer launch of a Tamil film titled LGM, which is being produced under the banner of Dhoni Entertainment Pvt Ltd. As per reports, the trailer launch will take place on July 10 (Monday) and Dhoni will be accompanied by his wife Sakshi at the event. ALSO WATCH | Virat Kohli Hailed As 'Biggest Name In Team India' By Fan In Dominica Ahead Of IND vs WI 1st Test Watch below viral video of MS Dhoni receiving grand welcome at Chennai airport from die-hard fans Thala Dhoni in Chennai for the Audio and Trailer launch of his first production Movie LGM 💛 #MSDhoni #LGM pic.twitter.com/hzwwcOcfAN googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); — WhistlePodu Army ® - CSK Fan Club (@CSKFansOfficial) July 9, 2023 MS Dhoni-led Chennai Super Kings defeated Hardik Pandya-led Gujarat Titans to win their record-equalling fifth Indian Premier League trophy, making Dhoni join-most successful captain in the history of world's richest T20 tournament. It was highly anticipated that 42-year-Dhoni would announce retirement from IPL after this season. However, the legendary wicketkeeper hinted that if his body allows, he might return to play IPL 2024. \"Circumstantially, this is the best time to announce my retirement. But the amount of love I have received all over, the easy thing would be to walk away from here, but the harder thing would be to work hard for nine months and try to play another IPL. It would be a gift from me, won't be easy on the body,\" Dhoni had said in the post-match interview after winning the IPL 2023 final.","pubDate":"2023-07-10 04:38:08","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/07/10/a47c6881ad59b2b6cfb3ccca7e85c316168896382116724_original.jpg","source_id":"abplive","category":["sports"],"country":["india"],"language":"english"},{"title":"It was a brilliant game of cricket: Hussain as England win Headingley Test","link":"https://www.indiatoday.in/sports/cricket/story/ashes-2023-it-was-a-brilliant-game-of-cricket-says-nasser-hussain-as-england-win-headingley-test-2404262-2023-07-10?utm_source=rss","keywords":null,"creator":null,"video_url":null,"description":"It was a brilliant game of cricket: Hussain as England win Headingley Test","content":": Former England captain Nasser Hussain has said that the third Ashes 2023 Test was a brilliant game of cricket. by three wickets at Headingley to claim their first win of the series. Speaking after the third Test, Hussain said it was a brilliant match, adding that Australia would be trying to work out where they lost the game. England chased down a 251-run target on Day 4 at Headingley with three wickets in hand. “The third Test at Headingley was a brilliant game of cricket, and Australia will probably feel what England have felt in the past two games where they played a lot of good cricket and will try to work out where they lost it,” said Hussain. \"Mark Wood you little ripper!\" ð¬ Every Wood and Woakes boundary on our way to victory in Leeds! ðå | — England Cricket (@englandcricket) Speaking about England’s batting approach in the final innings, Hussain said both Chris Woakes and Mark Wood got their approach right when they came out ot bat on Day 4. Woakes remained unbeaten on 32, while Wood chipped in with an 8-ball 16. “In that situation, Wood fending it off and trying to survive is not going to score as many runs as Wood taking them on. It's the same with Chris Woakes; I thought he got it spot on with the tempo when he went in on day four. Hanging around was not going to do it, he had to put the pressure back on the opposition and he did it perfectly,” Husain added. He went on to heap praise on Wood, saying he is loved by the Headingley crown and his teammates because of his heart. Wood picked seven wickets and scored 40 quick-fire runs across the two innings to help England win at Headingley. “His stats aren't why his team-mates or why the Headingley crowd love Mark Wood, they love him because of his heart. You know when a cricketer is giving it everything. He'll get injured, he'll pick himself up and he'll go again, and that's all you can ask from a team-mate or an international cricketer,” said Hussain. With this victory, England now trail Australia 1-2 in the five-match Ashes 2023 series, with the fourth game set to be played at the Old Trafford Cricket Ground on July 19.","pubDate":"2023-07-10 04:36:48","image_url":null,"source_id":"indiatoday","category":["sports"],"country":["india"],"language":"english"},{"title":"Ashes 2023: \"टीम की जीत में योगदान देकर खुश हूँ\" मार्क वुड ने दिया बड़ा बयान","link":"https://hindi.latestly.com/sports/cricket/ashes-2023-happy-to-contribute-to-the-teams-victory-mark-wood-made-a-big-statement-1859474.html","keywords":null,"creator":null,"video_url":null,"description":"ऑस्ट्रेलिया के खिलाफ तीसरे एशेज टेस्ट में गेंद और बल्ले दोनों से महत्वपूर्ण प्रदर्शन के लिए मैन ऑफ द मैच चुने गए इंग्लैंड के मार्क वुड ने हालांकि कहा कि उन्हें एक ऑलराउंडर माना जाता है और उन्हें बल्लेबाजी के लिए आगे लाया जाता है, जिससे उन्हें फायदा होगा.","content":"लंदन, 10 जुलाई: ऑस्ट्रेलिया के खिलाफ तीसरे एशेज टेस्ट में गेंद और बल्ले दोनों से महत्वपूर्ण प्रदर्शन के लिए मैन ऑफ द मैच चुने गए इंग्लैंड के मार्क वुड ने हालांकि कहा कि उन्हें एक ऑलराउंडर माना जाता है और उन्हें बल्लेबाजी के लिए आगे लाया जाता है, जिससे उन्हें फायदा होगा. यह भी पढ़ें: ENG vs AUS 4th Test: एशेज सीरीज में इंग्लैंड ने की शानदार वापसी, तीसरे टेस्ट में ऑस्ट्रेलिया को तीन विकेट से रौंदा; हैरी ब्रूक ने खेली शानदार पारी वुड ने गेंद से अपना प्रभाव छोड़ा और 5-34 का दावा किया, जिससे ऑस्ट्रेलिया पहली पारी में 263 रन पर ढेर हो गया। इसके बाद उन्होंने निचले क्रम में महत्वपूर्ण 24 रन बनाए और कप्तान बेन स्टोक्स (80) की मदद से इंग्लैंड को 237 रन तक पहुंचाया और इस तरह ऑस्ट्रेलिया को बड़ी बढ़त नहीं लेने दी. वुड ने 2-66 का दावा किया और फिर क्रिस वोक्स (नाबाद 32) के साथ मैच जिताऊ नाबाद 24 रन की साझेदारी की और विजयी रन बनाकर हेडिंग्ले में जीत पक्की कर दी. उन्होंने कहा कि उन्हें इंग्लैंड को जीत दिलाने और उसका मार्गदर्शन करने में खुशी हो रही है, क्योंकि इससे सीरीज जीवित रहेगी. वुड ने यहां रविवार को मैच प्रस्तुति पोस्ट में कहा, \"निश्चित रूप से यहां आकर खुशी हुई, खासकर मैन ऑफ द मैच के रूप में. हमारे लिए शानदार जीत और इसने श्रृंखला को जीवित रखा. मैं उस ड्रेसिंग रूम में अच्छा नहीं था. दुनिया के कुछ सर्वश्रेष्ठ तेज गेंदबाजों के खिलाफ जाने के लिए यह पहली बार है कि मैंने बल्ले से इंग्लैंड को जीत दिलाई है, इसलिए मुझे खुशी है.\" यह पूछे जाने पर कि क्या गेंद और बल्ले दोनों से योगदान देने के बाद उन्हें एक ऑलराउंडर माना जाना चाहिए, तेज गेंदबाज ने कहा कि ऐसा करना जल्दबाजी होगी. \"इसके लिए बहुत जल्दी, इससे भी अधिक और मेरी नाक से खून बहने लगेगा। मुझे नहीं पता कि यह सबसे तेज़ है, लेकिन पहाड़ी से नीचे आते हुए मैं बॉब विलिस के बारे में सोच रहा था. स्टोक्सी मेरी भूमिका के बारे में बहुत स्पष्ट थे, छोटी गेंद फेंकना. उन्होंने कहा, ''तीखे स्पैल और वह सब कुछ जो मेरे पास है, दे दो. अभी भी कुछ चीजों पर काम करना बाकी है. दोनों पक्षों ने पूंछ पर कड़ी मेहनत की है और हमें इसका मुकाबला करना होगा.'' उन्होंने कहा कि उन्हें यकीन नहीं है कि पहली पारी में उनके 24 रनों ने बड़ा प्रभाव डाला या नहीं. वुड ने कहा, \"मैं इससे खुश था, प्रभाव के बारे में नहीं जानता. कुछ रन बनाकर खुशी हुई. हम जहां भी जाते हैं, वहां समर्थन अद्भुत है, लेकिन उत्तर में यह हमेशा बेहतर होता है, है ना?\"","pubDate":"2023-07-10 04:24:58","image_url":null,"source_id":"latestly","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Sunil Gavaskar Slams Rohit Sharma's Captaincy, Wants BCCI To Ask Tough Questions From Rahul Dravid","link":"https://news.abplive.com/sports/cricket/odi-world-cup-2023-latest-news-sunil-gavaskar-slams-rohit-sharma-s-captaincy-wants-bcci-to-ask-tough-questions-from-rahul-dravid-1614796","keywords":["Cricket"],"creator":["ABP News Bureau"],"video_url":null,"description":"Sunil Gavaskar On Rohit Sharma Captaincy: Team India's all-format captain Rohit Sharma faced tons of criticism after India's humiliating loss against Australia in the World Test Championship (WTC) final. After Virat Kohli's exit as India captain, Rohit was assigned as the new team leader in all three formats. Everyone expected the senior opener to end India's ICC trophy drought, but Rohit has not been able to do that so far and the upcoming ODI World Cup 2023, in all likelihood, will be his last assignment as India captain. ALSO WATCH | Virat Kohli Hailed As 'Biggest Name In Team India' By Fan In Dominica Ahead Of IND vs WI 1st Test Meanwhile, former India skipper Sunil Gavaskar stated his disappointment with Rohit Sharma and gave a scathing analysis of the senior opener's captaincy tenure. Gavaskar said that despite having some quality players and a lot of experience in T20, it was highly disappointing to not see the Indian team reach the final of the T20 World Cup 2023. Rohit-led India suffered an embarrassing 10-wicket loss against England in the semi-final. \"I expected more from him (Rohit). In India it is different, but when you do well overseas that is really the test. That is where he has been a little disappointing. Even in the T20 format, with all the experience of the IPL, hundreds of matches as captain, with a mix of best IPL players not being able to get to the finals has been disappointing,\" said Gavaskar to the Indian Express Idea Exchange. Gavaskar called upon the BCCI and selectors to ask tough questions to Rohit and Rahul Dravid.  \"They should be asking questions, Why did you field first? Okay, it was explained at the toss that it was overcast and all. The question after that should be, 'You didn't know about Travis Head's weakness against the short ball?' Why was the bouncer employed only when he had scored 80 runs. You know, the moment Head came in to bat, in the commentary box, we had Ricky Ponting saying, 'Bounce him, bounce him.' Everyone knew about it but we didn't try,\" Gavaskar added.","content":"Sunil Gavaskar On Rohit Sharma Captaincy: Team India's all-format captain Rohit Sharma faced tons of criticism after India's humiliating loss against Australia in the World Test Championship (WTC) final. After Virat Kohli's exit as India captain, Rohit was assigned as the new team leader in all three formats. Everyone expected the senior opener to end India's ICC trophy drought, but Rohit has not been able to do that so far and the upcoming ODI World Cup 2023 , in all likelihood, will be his last assignment as India captain. ALSO WATCH | Virat Kohli Hailed As 'Biggest Name In Team India' By Fan In Dominica Ahead Of IND vs WI 1st Test Meanwhile, former India skipper Sunil Gavaskar stated his disappointment with Rohit Sharma and gave a scathing analysis of the senior opener's captaincy tenure. Gavaskar said that despite having some quality players and a lot of experience in T20, it was highly disappointing to not see the Indian team reach the final of the T20 World Cup 2023. Rohit-led India suffered an embarrassing 10-wicket loss against England in the semi-final. \"I expected more from him (Rohit). In India it is different, but when you do well overseas that is really the test. That is where he has been a little disappointing. Even in the T20 format, with all the experience of the IPL, hundreds of matches as captain, with a mix of best IPL players not being able to get to the finals has been disappointing,\" said Gavaskar to the Indian Express Idea Exchange. googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); Gavaskar called upon the BCCI and selectors to ask tough questions to Rohit and Rahul Dravid. \"They should be asking questions, Why did you field first? Okay, it was explained at the toss that it was overcast and all. The question after that should be, 'You didn't know about Travis Head's weakness against the short ball?' Why was the bouncer employed only when he had scored 80 runs. You know, the moment Head came in to bat, in the commentary box, we had Ricky Ponting saying, 'Bounce him, bounce him.' Everyone knew about it but we didn't try,\" Gavaskar added.","pubDate":"2023-07-10 04:03:47","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/07/10/8fe7c2be807fd30c0cec66e8235c194f168896180504024_original.jpg","source_id":"abplive","category":["sports"],"country":["india"],"language":"english"},{"title":"Ashes 2023: Clarke feels Australia have enough options to replace misfiring Warner","link":"https://www.indiatoday.in/sports/cricket/story/ashes-2023-england-vs-australia-headingley-test-david-warner-poor-form-michael-clarke-2404249-2023-07-10?utm_source=rss","keywords":null,"creator":null,"video_url":null,"description":"Ashes 2023: Clarke feels Australia have enough options to replace misfiring Warner","content":": Michael Clarke feels that Australia have enough options to replace the misfiring David Warner and the decision on the future of the opener is the only call the selectors have to worry about. Warner had showed some fight in the Lord's Test as he scored an aggressive fifty in the first innings. However, the outing at Leeds was one to forget for the opener as he was dismissed twice by his arch-nemesis Stuart Broad. Broad has now dismissed Warner 17 times in his Test career as England won the match at Headingley by three wickets. After the match, Pat Cummins the opener's position in the side for the fourth Ashes 2023 Test at Manchester. Speaking to Sky Sports Radio, as quoted by Fox Sports, Clarke suggested that Australia have got enough options to replace Warner in the side with the former captain feeling that the likes of Mitchell Marsh, Travis Head and Marnus Labuschagne coming into the role to open the innings. “Tell me what they do now ... The No.1 issue is you’ve stuck with Warner, given him every opportunity, and (Stuart) Broad’s still got his number. Is it time?” Clarke said. “If it’s time, I wouldn’t even be thinking about who opens the batting because you’ve got options. “I reckon Mitch Marsh is in form. If he had to do it, he could do it. Alex Carey probably won’t because he’s got to keep, but Travis Head could do it. Marnus Labuschagne isn’t making as many runs as he should at No.3. He could open, Smithy could go to No.3 and Head to No.4 (with Marsh and Green No.5 and No.6).” Clarke said that the only thing selectors would need to think about is if Warner's time up in the side. The former Australian captain said that they should either persist with Warner or play with the batting order to keep Marsh in the side. “The thing you’ve got to think about first is, is David Warner’s time up? And the other thing, if you’re going to bring Cameron Green back in, is he 100 per cent fit to bowl the overs he needs to bowl?\" “I think they should either stick with Warner or play with the batting order and keep Mitch Marsh.”","pubDate":"2023-07-10 03:54:13","image_url":null,"source_id":"indiatoday","category":["sports"],"country":["india"],"language":"english"},{"title":"'Never Imagined The Journey Would...': Virat Kohli Shares Heartwarming Post With Rahul Dravid Ahead Of IND vs WI Dominica Test","link":"https://news.abplive.com/sports/cricket/india-vs-west-indies-1st-test-virat-kohli-shares-heartwarming-post-with-rahul-dravid-ahead-of-ind-vs-wi-dominica-test-1614790","keywords":["Cricket"],"creator":["ABP News Bureau"],"video_url":null,"description":"India vs West Indies Dominica Test: The Indian cricket team will kickstart the India tour of West Indies with the IND vs WI 1st Test from July 12 onwards at Windsor Park, Roseau, Dominica. Team India played its last Test match in Dominica in 2011. In that match, along with Virat Kohli, the current team India head coach Rahul Dravid was also part of the Indian squad, a revelation that Kohli made himself on social media. Rahul Dravid and Virat Kohli return to Dominica's Windsor Park after 12 years after playing together as teammates for the national team in 2011 at the same venue. ALSO WATCH | Virat Kohli Hailed As 'Biggest Name In Team India' By Fan In Dominica Ahead Of IND vs WI 1st Test Kohli took to Instagram to share a heartwarming picture featuring himself and India head coach Rahul Dravid, saying that they are the only two players who were part of the team in the last Test played at Dominica in 2011. \"The only two guys part of the last test we played at Dominica in 2011. Never imagined the journey would bring us back here in different capacities. Highly grateful,\" said Kohli.           View this post on Instagram                       A post shared by Virat Kohli (@virat.kohli)   Back in 2011, team India played a 3-match Test series against West Indies, in which the third Test was played in Dominica and the match ended in a draw. Rahul Dravid scored 5 runs in the first innings of this match and 34 runs in the second innings.Virat Kohli, who played only one innings, managed to score 30 runs. With the third and final Test ending in a draw, India had won the series 1-0. This was Virat Kohli's debut Test series. He made his Test debut for India after playing the first Test match of this series. India's Test team for IND vs WI Test series: Rohit Sharma (Capt), Shubman Gill, Ruturaj Gaikwad, Virat Kohli, Yashasvi Jaiswal, Ajinkya Rahane (VC), KS Bharat (wk), Ishan Kishan (wk), R Ashwin, R Jadeja, Shardul Thakur, Axar Patel, Mohd. Siraj, Mukesh Kumar, Jaydev Unadkat, Navdeep Saini.","content":"India vs West Indies Dominica Test: The Indian cricket team will kickstart the India tour of West Indies with the IND vs WI 1st Test from July 12 onwards at Windsor Park, Roseau, Dominica. Team India played its last Test match in Dominica in 2011. In that match, along with Virat Kohli, the current team India head coach Rahul Dravid was also part of the Indian squad, a revelation that Kohli made himself on social media. Rahul Dravid and Virat Kohli return to Dominica's Windsor Park after 12 years after playing together as teammates for the national team in 2011 at the same venue. ALSO WATCH | Virat Kohli Hailed As 'Biggest Name In Team India' By Fan In Dominica Ahead Of IND vs WI 1st Test Kohli took to Instagram to share a heartwarming picture featuring himself and India head coach Rahul Dravid, saying that they are the only two players who were part of the team in the last Test played at Dominica in 2011. \"The only two guys part of the last test we played at Dominica in 2011. Never imagined the journey would bring us back here in different capacities. Highly grateful,\" said Kohli. googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); View this post on Instagram A post shared by Virat Kohli (@virat.kohli) Back in 2011, team India played a 3-match Test series against West Indies, in which the third Test was played in Dominica and the match ended in a draw. Rahul Dravid scored 5 runs in the first innings of this match and 34 runs in the second innings.Virat Kohli, who played only one innings, managed to score 30 runs. With the third and final Test ending in a draw, India had won the series 1-0. This was Virat Kohli's debut Test series. He made his Test debut for India after playing the first Test match of this series. India's Test team for IND vs WI Test series: Rohit Sharma (Capt), Shubman Gill, Ruturaj Gaikwad, Virat Kohli, Yashasvi Jaiswal, Ajinkya Rahane (VC), KS Bharat (wk), Ishan Kishan (wk), R Ashwin, R Jadeja, Shardul Thakur, Axar Patel, Mohd. Siraj, Mukesh Kumar, Jaydev Unadkat, Navdeep Saini.","pubDate":"2023-07-10 03:15:05","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/07/10/10f014dfc11bb4cbcc9fca6193776dab168895873230124_original.jpg","source_id":"abplive","category":["sports"],"country":["india"],"language":"english"},{"title":"All Blacks captain Sam Cane says sorry after brutally kicking pitch invader after win over Argentina","link":"https://www.dailymail.co.uk/sport/rugbyunion/article-12281393/All-Blacks-captain-Sam-Cane-says-sorry-brutally-kicking-pitch-invader-win-Argentina.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Rugby fans have leapt to the defence of New Zealand skipper Sam Cane after he lashed out and kicked a pitch invader in Argentina, with fans split as to whether he should have to apologise.","content":"All Blacks captain brutally kicks pitch invader… with fans and rugby figures split over the act after the skipper said sorry: 'The only thing he should be apologising for is not going for the coat-hanger' Multiple pitch invaders took to the field All Blacks skipper brutally kicked one Came after side's big win over Argentina By Josh Alston For Daily Mail Australia Published: 22:58 EDT, 9 July 2023 | Updated: 23:04 EDT, 9 July 2023 e-mail View comments Rugby fans have leapt to the defence of New Zealand skipper Sam Cane after he lashed out and kicked a pitch invader in Argentina . The Kiwis were comfortable 41-12 winners over Los Pumas in Mendoza on Sunday morning, with the real drama coming after fulltime. Security staff were overwhelmed as a number of pitch invaders took to the field, coming dangerously close to players. Cane took action when one of the invaders came within a metre of All Blacks players, kicking the man and knocking him to the ground. It invoked memories of Andy Symonds shoulder charging a pitch invader in a cricket match, Sam Kerr shouldering a streaker to the ground in the UK and Johnny Bairstow removing a protestor from the field during The Ashes in another example of athlete's taking things into their own hands. Sam Cane has apologised via social media for kicking a pitch invader following this morning¿s test against Argentina Goes without saying, but this is not a good look for the All Blacks captain pic.twitter.com/M6baJk518A — Andrew Gourdie (@AndrewGourdie) July 9, 2023 New Zealand skipper Sam Cane kicked out at a pitch invader who came too close to the players after their win over Argentina in the Rugby Championship Cane has apologised for his actions on social media but could still face sanction from New Zealand Rugby Cane, 31, has an otherwise exemplary discipline record and is yet to receive a red card in 87 tests for the All Blacks or 150 matches for the Chiefs in Super Rugby level. He took to social media to apologise for the incident and it remains to be seen whether he will face further sanction from NZ Rugby. 'After the game someone ran onto the pitch and I made an error in judgment and played a part in stopping him,' Cane posted. 'I acknowledge this was not my role and it is out of character of me to act in such a way. I am really sorry and am disappointed in myself. 'I am trying my best to contact the individual to apologise and make things right.' He then later added: 'Through the help of many good people, I managed to track down Roman. 'Had a good catch up with him and his friends and I'm glad that we could leave things in a good place.' Footage showed Cane stepping away from the playing group to lash out at the pitch invader who was one of many that stormed the field after the match A pocket of rugby fans strangely leapt to the defence of the pitch invade and called for punishment to be handed down to the Kiwi captain. 'He should be banned for this,' one posted. 'The @AllBlacks coaches have surely got to be questioning what his decision making would be like in the heat of the game,' added another. 'Tripping is sending off infraction. Kane is useless anyway. He won't be missed,' posted another. But most supporters are in favour of Cane's actions, with some saying the pitch invader got off lightly. 'Goes without saying' jog on mate, pitch invaders need to be sorted out. Shame he didn't smash him harder. As soon as a pitch invader goes on the field, they can't complain if they get smashed,' one fan replied to the video of the incident. 'The only thing he should be apologising for is not going in for the coat-hanger,' added another. Cane, pictured with wife Harriet Allen, has an exemplary record and has never received a red card at Super Rugby or international level Cane was influential once again for the All Blacks on the field as New Zealand claimed a comfortable win over Argentina 'Bro players have tackled pitch invaders before why shouldn't he do that that person should know better,' posted another. Newstalk ZB's rugby editor Elliott Smith was at the ground and said there were at least 15 pitch invaders on the ground at the time and the Kiwi skipper had every right to protect himself. 'I have no real issue with what Sam Cane has done here. The pitch invaders were coming from left, right and centre from fulltime - I suspect there would have been 15 or so at least. One nearly took out Damian McKenzie and I as we were speaking for Sky,' Smith said on Twitter. Former All Black Israel Dagg also backed the actions of Cane. 'I would have done the same tbh .. maybe a lazy no arm shoulder!! Stay off the field,' he tweeted. Share or comment on this article: All Blacks captain Sam Cane says sorry after brutally kicking pitch invader after win over Argentina e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-10 03:04:46","image_url":"https://i.dailymail.co.uk/1s/2023/07/10/02/73028467-0-image-a-32_1688953671029.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"IND vs PAK: Pakistan's Abdul Razzaq Makes Shocking 'Bilateral Series' Allegation On Team India","link":"https://news.abplive.com/sports/cricket/pakistan-s-abdul-razzaq-makes-shocking-bilateral-series-allegation-on-team-india-1614819","keywords":["Cricket"],"creator":["ABP News Bureau"],"video_url":null,"description":"The 2023 edition of ODI World Cup begins in October where arch-nemesis India and Pakistan will square off at world's largest cricket stadium, Ahmedabad's Narendra Modi Stadium on October 15. Notably, this would be the first time since 2016 when Pakistan would play an international match in India. The last bilateral series between India and Pakistan was played in the year 2012-13 on Indian soil. Notably, Pakistan cricket team are yet to get an official clearance from their government to arrive in India for the mega tournament. ALSO WATCH: Crowd Showers Flowers On MS Dhoni As CSK Legend Arrives In Chennai For Movie Trailer Launch Ahead of the highly-anticipated India vs Pakistan ODI World Cup 2023 match, ex-Pakistan all-rounder Abdul Razzaq made a shocking statement about the 'Men in Blue'. Razzaq said that India hadn't played Pakistan much in 1997-98, because they were afraid of losing as Pakistan were too formidable. “We share mutual respect and friendship. There's only Indian team that doesn't play against Pakistan. From 1997-98, they didn't play much against us because we were too good, India always used to lose. Now, situation has changed, we are in 2023, but we have to change our thinking. No team is big or small, the performance on the day matters,” Razzaq told EHCricket. Encouraging bilateral series resumption between India and Pakistan, Razzaq said he would love to see the two nations play a series against each other in the future. \"Both teams are good. You can't say Pakistan team is weak. You see the Ashes series, can you point out which team is better? The team which performs wins, as simple as that. We have to get out of this and play matches, series against each other,\" he added. Before the 2023 ODI World Cup, Pakistan and India will square off in the Asia Cup 2023, jointly hosted by Pakistan and Sri Lanka.","content":"The 2023 edition of ODI World Cup begins in October where arch-nemesis India and Pakistan will square off at world's largest cricket stadium, Ahmedabad's Narendra Modi Stadium on October 15. Notably, this would be the first time since 2016 when Pakistan would play an international match in India. The last bilateral series between India and Pakistan was played in the year 2012-13 on Indian soil. Notably, Pakistan cricket team are yet to get an official clearance from their government to arrive in India for the mega tournament. ALSO WATCH: Crowd Showers Flowers On MS Dhoni As CSK Legend Arrives In Chennai For Movie Trailer Launch Ahead of the highly-anticipated India vs Pakistan ODI World Cup 2023 match, ex-Pakistan all-rounder Abdul Razzaq made a shocking statement about the 'Men in Blue'. Razzaq said that India hadn't played Pakistan much in 1997-98, because they were afraid of losing as Pakistan were too formidable. googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); “We share mutual respect and friendship. There's only Indian team that doesn't play against Pakistan. From 1997-98, they didn't play much against us because we were too good, India always used to lose. Now, situation has changed, we are in 2023, but we have to change our thinking. No team is big or small, the performance on the day matters,” Razzaq told EHCricket. Encouraging bilateral series resumption between India and Pakistan, Razzaq said he would love to see the two nations play a series against each other in the future. \"Both teams are good. You can't say Pakistan team is weak. You see the Ashes series, can you point out which team is better? The team which performs wins, as simple as that. We have to get out of this and play matches, series against each other,\" he added. Before the 2023 ODI World Cup, Pakistan and India will square off in the Asia Cup 2023, jointly hosted by Pakistan and Sri Lanka.","pubDate":"2023-07-10 05:44:20","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/07/10/51fdf69d25aebbd12e669117fe53de55168896780736424_original.jpg","source_id":"abplive","category":["sports"],"country":["india"],"language":"english"},{"title":"Happy Birthday Sunil Gavaskar: सुनील गावस्कर को जन्मदिन पर युवराज सिंह दी बधाई, लिखा \"आपका वर्ष अच्छे स्वास्थ्य, खुशियों और सफलता से भरा हो\"","link":"https://hindi.latestly.com/socially/sports/cricket/happy-birthday-sunil-gavaskar-yuvraj-singh-congratulated-sunil-gavaskar-on-his-birthday-in-this-way-see-tweet-1859579.html","keywords":null,"creator":null,"video_url":null,"description":"पूर्व भारतीय दिग्गज क्रिकेटर सुनील गावस्कर आज 74 वर्ष के हो गए है. गावस्कर क्रिकेट जगत के महानतम भारतीय बल्लेबाजों में से एक है, जिन्होंने टेस्ट क्रिकेट में सबसे पहले 10,000 रन बनाए.","content":"पूर्व भारतीय दिग्गज क्रिकेटर सुनील गावस्कर आज 74 वर्ष के हो गए है. गावस्कर क्रिकेट जगत के महानतम भारतीय बल्लेबाजों में से एक है, जिन्होंने टेस्ट क्रिकेट में सबसे पहले 10,000 रन बनाए. इस दौरान उनके जन्मदिन पर पूर्व भारतीय बल्लेबाज युवराज सिंह ने अपने ट्विटर हैंडल पर लिटिल मास्टर को शुभकामनाएं दीं, युवराज ने अपने ट्वीट में लिखा \" एक महान इंसान और एक महान व्यक्ति को जन्मदिन की बहुत-बहुत शुभकामनाएं, जो पीढ़ियों को प्रेरित करते रहे 🎂 आशा है कि आपका वर्ष अच्छे स्वास्थ्य, खुशियों और सफलता से भरा हो, सनी भाई\" देखें ट्वीट: Wishing a very Happy Birthday to a great human being and a legend who continues to inspire across generations 🎂 Hope you have a fabulous year filled with good health, happiness and success Sunny bhai 🤗 🎉 #SunilGavaskar @harbhajan_singh pic.twitter.com/enyrJXKiik — Yuvraj Singh (@YUVSTRONG12) July 10, 2023 (SocialLY के साथ पाएं लेटेस्ट ब्रेकिंग न्यूज, वायरल ट्रेंड और सोशल मीडिया की दुनिया से जुड़ी सभी खबरें. यहां आपको ट्विटर, इंस्टाग्राम और यूट्यूब पर वायरल होने वाले हर कंटेंट की सीधी जानकारी मिलेगी. ऊपर दिखाया गया पोस्ट अनएडिटेड कंटेंट है, जिसे सीधे सोशल मीडिया यूजर्स के अकाउंट से लिया गया है. लेटेस्टली स्टाफ द्वारा इसमें कोई बदलाव या एडिट नहीं किया गया है. सोशल मीडिया पोस्ट लेटेस्टली के विचारों और भावनाओं का प्रतिनिधित्व नहीं करता है, हम इस पोस्ट में मौजूद किसी भी कंटेंट के लिए कोई जिम्मेदारी या दायित्व स्वीकार नहीं करते हैं.)","pubDate":"2023-07-10 05:16:04","image_url":null,"source_id":"latestly","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Expected more from Rohit: Gavaskar left disappointed by Indian team skipper's captaincy","link":"https://www.indiatoday.in/sports/cricket/story/indian-cricket-team-rohit-sharma-captaincy-sunil-gavaskar-rahul-dravid-wtc-final-loss-2404267-2023-07-10?utm_source=rss","keywords":null,"creator":null,"video_url":null,"description":"Expected more from Rohit: Gavaskar left disappointed by Indian team skipper's captaincy","content":": Sunil Gavaskar has said that he has been disappointed with Rohit Sharma's tenure as the captain of the Indian team and said he expected more from the opening batter. took over as the full-time captain of the Indian side in February last year after Virat Kohli's time as the skipper came to an end. While India's record in bilateral home series has been good under the opener, the team has struggled to find success in major tournaments. India bowed out in the semi-finals of the T20 World Cup in Australia last year and went on to lose the World Test Championship 2023 final against the Aussies last month at the Oval. Speaking at the Indian Express Idea Exchange, Gavaskar said that he expected more from Rohit as the captain and has been left disappointed with a few aspects of his reign. “I expected more from him (Rohit). In India it is different, but when you do well overseas that is really the test. That is where he has been a little disappointing. Even in the T20 format, with all the experience of the IPL, hundreds of matches as captain, with a mix of best IPL players not being able to get to the finals has been disappointing.” Gavaskar also wanted to know if a review of the captain and the team management was done in the aftermath of the losses of the Indian team. The legendary batter specifically pointed out to the WTC Final and said Rohit and coach should have been asked about the decisions they made during the match. “They should be asking questions, ‘Why did you field first?’ Okay, it was explained at the toss that it was overcast and all. The question after that should be, ‘You didn’t know about Travis Head’s weakness against the short ball?’ Why was the bouncer employed only when he had scored 80 runs. You know, the moment Head came in to bat, in the commentary box, we had Ricky Ponting saying, ‘Bounce him, bounce him.’ Everyone knew about it but we didn’t try.”","pubDate":"2023-07-10 04:44:22","image_url":null,"source_id":"indiatoday","category":["sports"],"country":["india"],"language":"english"},{"title":"WATCH: Crowd Showers Flowers On MS Dhoni As CSK Legend Arrives In Chennai For Movie Trailer Launch","link":"https://news.abplive.com/sports/cricket/csk-ms-dhoni-viral-video-fans-showers-flowers-on-ms-dhoni-arrives-in-chennai-for-lsm-trailer-launch-1614805","keywords":["Cricket"],"creator":["ABP News Bureau"],"video_url":null,"description":"Five-time Indian Premier League title winner Mahendra Singh Dhoni received a thunderous welcome from fans gathered outside the arrival gate of Chennai airport to welcome 'Thala' at his second home. In an emotional gesture, fans showered flowers on legendary Chennai Super Kings captain, while cheering 'Dhoni, Dhoni'. It is believed that MS Dhoni arrived at Chennai to attend the trailer launch of a Tamil film titled LGM, which is being produced under the banner of Dhoni Entertainment Pvt Ltd. As per reports, the trailer launch will take place on July 10 (Monday) and Dhoni will be accompanied by his wife Sakshi at the event. ALSO WATCH | Virat Kohli Hailed As 'Biggest Name In Team India' By Fan In Dominica Ahead Of IND vs WI 1st Test Watch below viral video of MS Dhoni receiving grand welcome at Chennai airport from die-hard fans  Thala Dhoni in Chennai for the Audio and Trailer launch of his first production Movie LGM 💛#MSDhoni #LGM pic.twitter.com/hzwwcOcfAN — WhistlePodu Army ® - CSK Fan Club (@CSKFansOfficial) July 9, 2023 MS Dhoni-led Chennai Super Kings defeated Hardik Pandya-led Gujarat Titans to win their record-equalling fifth Indian Premier League trophy, making Dhoni join-most successful captain in the history of world's richest T20 tournament. It was highly anticipated that 42-year-Dhoni would announce retirement from IPL after this season. However, the legendary wicketkeeper hinted that if his body allows, he might return to play IPL 2024. \"Circumstantially, this is the best time to announce my retirement. But the amount of love I have received all over, the easy thing would be to walk away from here, but the harder thing would be to work hard for nine months and try to play another IPL. It would be a gift from me, won't be easy on the body,\" Dhoni had said in the post-match interview after winning the IPL 2023 final.","content":"Five-time Indian Premier League title winner Mahendra Singh Dhoni received a thunderous welcome from fans gathered outside the arrival gate of Chennai airport to welcome 'Thala' at his second home. In an emotional gesture, fans showered flowers on legendary Chennai Super Kings captain, while cheering 'Dhoni, Dhoni'. It is believed that MS Dhoni arrived at Chennai to attend the trailer launch of a Tamil film titled LGM, which is being produced under the banner of Dhoni Entertainment Pvt Ltd. As per reports, the trailer launch will take place on July 10 (Monday) and Dhoni will be accompanied by his wife Sakshi at the event. ALSO WATCH | Virat Kohli Hailed As 'Biggest Name In Team India' By Fan In Dominica Ahead Of IND vs WI 1st Test Watch below viral video of MS Dhoni receiving grand welcome at Chennai airport from die-hard fans Thala Dhoni in Chennai for the Audio and Trailer launch of his first production Movie LGM 💛 #MSDhoni #LGM pic.twitter.com/hzwwcOcfAN googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); — WhistlePodu Army ® - CSK Fan Club (@CSKFansOfficial) July 9, 2023 MS Dhoni-led Chennai Super Kings defeated Hardik Pandya-led Gujarat Titans to win their record-equalling fifth Indian Premier League trophy, making Dhoni join-most successful captain in the history of world's richest T20 tournament. It was highly anticipated that 42-year-Dhoni would announce retirement from IPL after this season. However, the legendary wicketkeeper hinted that if his body allows, he might return to play IPL 2024. \"Circumstantially, this is the best time to announce my retirement. But the amount of love I have received all over, the easy thing would be to walk away from here, but the harder thing would be to work hard for nine months and try to play another IPL. It would be a gift from me, won't be easy on the body,\" Dhoni had said in the post-match interview after winning the IPL 2023 final.","pubDate":"2023-07-10 04:38:08","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/07/10/a47c6881ad59b2b6cfb3ccca7e85c316168896382116724_original.jpg","source_id":"abplive","category":["sports"],"country":["india"],"language":"english"},{"title":"It was a brilliant game of cricket: Hussain as England win Headingley Test","link":"https://www.indiatoday.in/sports/cricket/story/ashes-2023-it-was-a-brilliant-game-of-cricket-says-nasser-hussain-as-england-win-headingley-test-2404262-2023-07-10?utm_source=rss","keywords":null,"creator":null,"video_url":null,"description":"It was a brilliant game of cricket: Hussain as England win Headingley Test","content":": Former England captain Nasser Hussain has said that the third Ashes 2023 Test was a brilliant game of cricket. by three wickets at Headingley to claim their first win of the series. Speaking after the third Test, Hussain said it was a brilliant match, adding that Australia would be trying to work out where they lost the game. England chased down a 251-run target on Day 4 at Headingley with three wickets in hand. “The third Test at Headingley was a brilliant game of cricket, and Australia will probably feel what England have felt in the past two games where they played a lot of good cricket and will try to work out where they lost it,” said Hussain. \"Mark Wood you little ripper!\" ð¬ Every Wood and Woakes boundary on our way to victory in Leeds! ðå | — England Cricket (@englandcricket) Speaking about England’s batting approach in the final innings, Hussain said both Chris Woakes and Mark Wood got their approach right when they came out ot bat on Day 4. Woakes remained unbeaten on 32, while Wood chipped in with an 8-ball 16. “In that situation, Wood fending it off and trying to survive is not going to score as many runs as Wood taking them on. It's the same with Chris Woakes; I thought he got it spot on with the tempo when he went in on day four. Hanging around was not going to do it, he had to put the pressure back on the opposition and he did it perfectly,” Husain added. He went on to heap praise on Wood, saying he is loved by the Headingley crown and his teammates because of his heart. Wood picked seven wickets and scored 40 quick-fire runs across the two innings to help England win at Headingley. “His stats aren't why his team-mates or why the Headingley crowd love Mark Wood, they love him because of his heart. You know when a cricketer is giving it everything. He'll get injured, he'll pick himself up and he'll go again, and that's all you can ask from a team-mate or an international cricketer,” said Hussain. With this victory, England now trail Australia 1-2 in the five-match Ashes 2023 series, with the fourth game set to be played at the Old Trafford Cricket Ground on July 19.","pubDate":"2023-07-10 04:36:48","image_url":null,"source_id":"indiatoday","category":["sports"],"country":["india"],"language":"english"},{"title":"Ashes 2023: \"टीम की जीत में योगदान देकर खुश हूँ\" मार्क वुड ने दिया बड़ा बयान","link":"https://hindi.latestly.com/sports/cricket/ashes-2023-happy-to-contribute-to-the-teams-victory-mark-wood-made-a-big-statement-1859474.html","keywords":null,"creator":null,"video_url":null,"description":"ऑस्ट्रेलिया के खिलाफ तीसरे एशेज टेस्ट में गेंद और बल्ले दोनों से महत्वपूर्ण प्रदर्शन के लिए मैन ऑफ द मैच चुने गए इंग्लैंड के मार्क वुड ने हालांकि कहा कि उन्हें एक ऑलराउंडर माना जाता है और उन्हें बल्लेबाजी के लिए आगे लाया जाता है, जिससे उन्हें फायदा होगा.","content":"लंदन, 10 जुलाई: ऑस्ट्रेलिया के खिलाफ तीसरे एशेज टेस्ट में गेंद और बल्ले दोनों से महत्वपूर्ण प्रदर्शन के लिए मैन ऑफ द मैच चुने गए इंग्लैंड के मार्क वुड ने हालांकि कहा कि उन्हें एक ऑलराउंडर माना जाता है और उन्हें बल्लेबाजी के लिए आगे लाया जाता है, जिससे उन्हें फायदा होगा. यह भी पढ़ें: ENG vs AUS 4th Test: एशेज सीरीज में इंग्लैंड ने की शानदार वापसी, तीसरे टेस्ट में ऑस्ट्रेलिया को तीन विकेट से रौंदा; हैरी ब्रूक ने खेली शानदार पारी वुड ने गेंद से अपना प्रभाव छोड़ा और 5-34 का दावा किया, जिससे ऑस्ट्रेलिया पहली पारी में 263 रन पर ढेर हो गया। इसके बाद उन्होंने निचले क्रम में महत्वपूर्ण 24 रन बनाए और कप्तान बेन स्टोक्स (80) की मदद से इंग्लैंड को 237 रन तक पहुंचाया और इस तरह ऑस्ट्रेलिया को बड़ी बढ़त नहीं लेने दी. वुड ने 2-66 का दावा किया और फिर क्रिस वोक्स (नाबाद 32) के साथ मैच जिताऊ नाबाद 24 रन की साझेदारी की और विजयी रन बनाकर हेडिंग्ले में जीत पक्की कर दी. उन्होंने कहा कि उन्हें इंग्लैंड को जीत दिलाने और उसका मार्गदर्शन करने में खुशी हो रही है, क्योंकि इससे सीरीज जीवित रहेगी. वुड ने यहां रविवार को मैच प्रस्तुति पोस्ट में कहा, \"निश्चित रूप से यहां आकर खुशी हुई, खासकर मैन ऑफ द मैच के रूप में. हमारे लिए शानदार जीत और इसने श्रृंखला को जीवित रखा. मैं उस ड्रेसिंग रूम में अच्छा नहीं था. दुनिया के कुछ सर्वश्रेष्ठ तेज गेंदबाजों के खिलाफ जाने के लिए यह पहली बार है कि मैंने बल्ले से इंग्लैंड को जीत दिलाई है, इसलिए मुझे खुशी है.\" यह पूछे जाने पर कि क्या गेंद और बल्ले दोनों से योगदान देने के बाद उन्हें एक ऑलराउंडर माना जाना चाहिए, तेज गेंदबाज ने कहा कि ऐसा करना जल्दबाजी होगी. \"इसके लिए बहुत जल्दी, इससे भी अधिक और मेरी नाक से खून बहने लगेगा। मुझे नहीं पता कि यह सबसे तेज़ है, लेकिन पहाड़ी से नीचे आते हुए मैं बॉब विलिस के बारे में सोच रहा था. स्टोक्सी मेरी भूमिका के बारे में बहुत स्पष्ट थे, छोटी गेंद फेंकना. उन्होंने कहा, ''तीखे स्पैल और वह सब कुछ जो मेरे पास है, दे दो. अभी भी कुछ चीजों पर काम करना बाकी है. दोनों पक्षों ने पूंछ पर कड़ी मेहनत की है और हमें इसका मुकाबला करना होगा.'' उन्होंने कहा कि उन्हें यकीन नहीं है कि पहली पारी में उनके 24 रनों ने बड़ा प्रभाव डाला या नहीं. वुड ने कहा, \"मैं इससे खुश था, प्रभाव के बारे में नहीं जानता. कुछ रन बनाकर खुशी हुई. हम जहां भी जाते हैं, वहां समर्थन अद्भुत है, लेकिन उत्तर में यह हमेशा बेहतर होता है, है ना?\"","pubDate":"2023-07-10 04:24:58","image_url":null,"source_id":"latestly","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Sunil Gavaskar Slams Rohit Sharma's Captaincy, Wants BCCI To Ask Tough Questions From Rahul Dravid","link":"https://news.abplive.com/sports/cricket/odi-world-cup-2023-latest-news-sunil-gavaskar-slams-rohit-sharma-s-captaincy-wants-bcci-to-ask-tough-questions-from-rahul-dravid-1614796","keywords":["Cricket"],"creator":["ABP News Bureau"],"video_url":null,"description":"Sunil Gavaskar On Rohit Sharma Captaincy: Team India's all-format captain Rohit Sharma faced tons of criticism after India's humiliating loss against Australia in the World Test Championship (WTC) final. After Virat Kohli's exit as India captain, Rohit was assigned as the new team leader in all three formats. Everyone expected the senior opener to end India's ICC trophy drought, but Rohit has not been able to do that so far and the upcoming ODI World Cup 2023, in all likelihood, will be his last assignment as India captain. ALSO WATCH | Virat Kohli Hailed As 'Biggest Name In Team India' By Fan In Dominica Ahead Of IND vs WI 1st Test Meanwhile, former India skipper Sunil Gavaskar stated his disappointment with Rohit Sharma and gave a scathing analysis of the senior opener's captaincy tenure. Gavaskar said that despite having some quality players and a lot of experience in T20, it was highly disappointing to not see the Indian team reach the final of the T20 World Cup 2023. Rohit-led India suffered an embarrassing 10-wicket loss against England in the semi-final. \"I expected more from him (Rohit). In India it is different, but when you do well overseas that is really the test. That is where he has been a little disappointing. Even in the T20 format, with all the experience of the IPL, hundreds of matches as captain, with a mix of best IPL players not being able to get to the finals has been disappointing,\" said Gavaskar to the Indian Express Idea Exchange. Gavaskar called upon the BCCI and selectors to ask tough questions to Rohit and Rahul Dravid.  \"They should be asking questions, Why did you field first? Okay, it was explained at the toss that it was overcast and all. The question after that should be, 'You didn't know about Travis Head's weakness against the short ball?' Why was the bouncer employed only when he had scored 80 runs. You know, the moment Head came in to bat, in the commentary box, we had Ricky Ponting saying, 'Bounce him, bounce him.' Everyone knew about it but we didn't try,\" Gavaskar added.","content":"Sunil Gavaskar On Rohit Sharma Captaincy: Team India's all-format captain Rohit Sharma faced tons of criticism after India's humiliating loss against Australia in the World Test Championship (WTC) final. After Virat Kohli's exit as India captain, Rohit was assigned as the new team leader in all three formats. Everyone expected the senior opener to end India's ICC trophy drought, but Rohit has not been able to do that so far and the upcoming ODI World Cup 2023 , in all likelihood, will be his last assignment as India captain. ALSO WATCH | Virat Kohli Hailed As 'Biggest Name In Team India' By Fan In Dominica Ahead Of IND vs WI 1st Test Meanwhile, former India skipper Sunil Gavaskar stated his disappointment with Rohit Sharma and gave a scathing analysis of the senior opener's captaincy tenure. Gavaskar said that despite having some quality players and a lot of experience in T20, it was highly disappointing to not see the Indian team reach the final of the T20 World Cup 2023. Rohit-led India suffered an embarrassing 10-wicket loss against England in the semi-final. \"I expected more from him (Rohit). In India it is different, but when you do well overseas that is really the test. That is where he has been a little disappointing. Even in the T20 format, with all the experience of the IPL, hundreds of matches as captain, with a mix of best IPL players not being able to get to the finals has been disappointing,\" said Gavaskar to the Indian Express Idea Exchange. googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); Gavaskar called upon the BCCI and selectors to ask tough questions to Rohit and Rahul Dravid. \"They should be asking questions, Why did you field first? Okay, it was explained at the toss that it was overcast and all. The question after that should be, 'You didn't know about Travis Head's weakness against the short ball?' Why was the bouncer employed only when he had scored 80 runs. You know, the moment Head came in to bat, in the commentary box, we had Ricky Ponting saying, 'Bounce him, bounce him.' Everyone knew about it but we didn't try,\" Gavaskar added.","pubDate":"2023-07-10 04:03:47","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/07/10/8fe7c2be807fd30c0cec66e8235c194f168896180504024_original.jpg","source_id":"abplive","category":["sports"],"country":["india"],"language":"english"},{"title":"Ashes 2023: Clarke feels Australia have enough options to replace misfiring Warner","link":"https://www.indiatoday.in/sports/cricket/story/ashes-2023-england-vs-australia-headingley-test-david-warner-poor-form-michael-clarke-2404249-2023-07-10?utm_source=rss","keywords":null,"creator":null,"video_url":null,"description":"Ashes 2023: Clarke feels Australia have enough options to replace misfiring Warner","content":": Michael Clarke feels that Australia have enough options to replace the misfiring David Warner and the decision on the future of the opener is the only call the selectors have to worry about. Warner had showed some fight in the Lord's Test as he scored an aggressive fifty in the first innings. However, the outing at Leeds was one to forget for the opener as he was dismissed twice by his arch-nemesis Stuart Broad. Broad has now dismissed Warner 17 times in his Test career as England won the match at Headingley by three wickets. After the match, Pat Cummins the opener's position in the side for the fourth Ashes 2023 Test at Manchester. Speaking to Sky Sports Radio, as quoted by Fox Sports, Clarke suggested that Australia have got enough options to replace Warner in the side with the former captain feeling that the likes of Mitchell Marsh, Travis Head and Marnus Labuschagne coming into the role to open the innings. “Tell me what they do now ... The No.1 issue is you’ve stuck with Warner, given him every opportunity, and (Stuart) Broad’s still got his number. Is it time?” Clarke said. “If it’s time, I wouldn’t even be thinking about who opens the batting because you’ve got options. “I reckon Mitch Marsh is in form. If he had to do it, he could do it. Alex Carey probably won’t because he’s got to keep, but Travis Head could do it. Marnus Labuschagne isn’t making as many runs as he should at No.3. He could open, Smithy could go to No.3 and Head to No.4 (with Marsh and Green No.5 and No.6).” Clarke said that the only thing selectors would need to think about is if Warner's time up in the side. The former Australian captain said that they should either persist with Warner or play with the batting order to keep Marsh in the side. “The thing you’ve got to think about first is, is David Warner’s time up? And the other thing, if you’re going to bring Cameron Green back in, is he 100 per cent fit to bowl the overs he needs to bowl?\" “I think they should either stick with Warner or play with the batting order and keep Mitch Marsh.”","pubDate":"2023-07-10 03:54:13","image_url":null,"source_id":"indiatoday","category":["sports"],"country":["india"],"language":"english"},{"title":"'Never Imagined The Journey Would...': Virat Kohli Shares Heartwarming Post With Rahul Dravid Ahead Of IND vs WI Dominica Test","link":"https://news.abplive.com/sports/cricket/india-vs-west-indies-1st-test-virat-kohli-shares-heartwarming-post-with-rahul-dravid-ahead-of-ind-vs-wi-dominica-test-1614790","keywords":["Cricket"],"creator":["ABP News Bureau"],"video_url":null,"description":"India vs West Indies Dominica Test: The Indian cricket team will kickstart the India tour of West Indies with the IND vs WI 1st Test from July 12 onwards at Windsor Park, Roseau, Dominica. Team India played its last Test match in Dominica in 2011. In that match, along with Virat Kohli, the current team India head coach Rahul Dravid was also part of the Indian squad, a revelation that Kohli made himself on social media. Rahul Dravid and Virat Kohli return to Dominica's Windsor Park after 12 years after playing together as teammates for the national team in 2011 at the same venue. ALSO WATCH | Virat Kohli Hailed As 'Biggest Name In Team India' By Fan In Dominica Ahead Of IND vs WI 1st Test Kohli took to Instagram to share a heartwarming picture featuring himself and India head coach Rahul Dravid, saying that they are the only two players who were part of the team in the last Test played at Dominica in 2011. \"The only two guys part of the last test we played at Dominica in 2011. Never imagined the journey would bring us back here in different capacities. Highly grateful,\" said Kohli.           View this post on Instagram                       A post shared by Virat Kohli (@virat.kohli)   Back in 2011, team India played a 3-match Test series against West Indies, in which the third Test was played in Dominica and the match ended in a draw. Rahul Dravid scored 5 runs in the first innings of this match and 34 runs in the second innings.Virat Kohli, who played only one innings, managed to score 30 runs. With the third and final Test ending in a draw, India had won the series 1-0. This was Virat Kohli's debut Test series. He made his Test debut for India after playing the first Test match of this series. India's Test team for IND vs WI Test series: Rohit Sharma (Capt), Shubman Gill, Ruturaj Gaikwad, Virat Kohli, Yashasvi Jaiswal, Ajinkya Rahane (VC), KS Bharat (wk), Ishan Kishan (wk), R Ashwin, R Jadeja, Shardul Thakur, Axar Patel, Mohd. Siraj, Mukesh Kumar, Jaydev Unadkat, Navdeep Saini.","content":"India vs West Indies Dominica Test: The Indian cricket team will kickstart the India tour of West Indies with the IND vs WI 1st Test from July 12 onwards at Windsor Park, Roseau, Dominica. Team India played its last Test match in Dominica in 2011. In that match, along with Virat Kohli, the current team India head coach Rahul Dravid was also part of the Indian squad, a revelation that Kohli made himself on social media. Rahul Dravid and Virat Kohli return to Dominica's Windsor Park after 12 years after playing together as teammates for the national team in 2011 at the same venue. ALSO WATCH | Virat Kohli Hailed As 'Biggest Name In Team India' By Fan In Dominica Ahead Of IND vs WI 1st Test Kohli took to Instagram to share a heartwarming picture featuring himself and India head coach Rahul Dravid, saying that they are the only two players who were part of the team in the last Test played at Dominica in 2011. \"The only two guys part of the last test we played at Dominica in 2011. Never imagined the journey would bring us back here in different capacities. Highly grateful,\" said Kohli. googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); View this post on Instagram A post shared by Virat Kohli (@virat.kohli) Back in 2011, team India played a 3-match Test series against West Indies, in which the third Test was played in Dominica and the match ended in a draw. Rahul Dravid scored 5 runs in the first innings of this match and 34 runs in the second innings.Virat Kohli, who played only one innings, managed to score 30 runs. With the third and final Test ending in a draw, India had won the series 1-0. This was Virat Kohli's debut Test series. He made his Test debut for India after playing the first Test match of this series. India's Test team for IND vs WI Test series: Rohit Sharma (Capt), Shubman Gill, Ruturaj Gaikwad, Virat Kohli, Yashasvi Jaiswal, Ajinkya Rahane (VC), KS Bharat (wk), Ishan Kishan (wk), R Ashwin, R Jadeja, Shardul Thakur, Axar Patel, Mohd. Siraj, Mukesh Kumar, Jaydev Unadkat, Navdeep Saini.","pubDate":"2023-07-10 03:15:05","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/07/10/10f014dfc11bb4cbcc9fca6193776dab168895873230124_original.jpg","source_id":"abplive","category":["sports"],"country":["india"],"language":"english"},{"title":"All Blacks captain Sam Cane says sorry after brutally kicking pitch invader after win over Argentina","link":"https://www.dailymail.co.uk/sport/rugbyunion/article-12281393/All-Blacks-captain-Sam-Cane-says-sorry-brutally-kicking-pitch-invader-win-Argentina.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Rugby fans have leapt to the defence of New Zealand skipper Sam Cane after he lashed out and kicked a pitch invader in Argentina, with fans split as to whether he should have to apologise.","content":"All Blacks captain brutally kicks pitch invader… with fans and rugby figures split over the act after the skipper said sorry: 'The only thing he should be apologising for is not going for the coat-hanger' Multiple pitch invaders took to the field All Blacks skipper brutally kicked one Came after side's big win over Argentina By Josh Alston For Daily Mail Australia Published: 22:58 EDT, 9 July 2023 | Updated: 23:04 EDT, 9 July 2023 e-mail View comments Rugby fans have leapt to the defence of New Zealand skipper Sam Cane after he lashed out and kicked a pitch invader in Argentina . The Kiwis were comfortable 41-12 winners over Los Pumas in Mendoza on Sunday morning, with the real drama coming after fulltime. Security staff were overwhelmed as a number of pitch invaders took to the field, coming dangerously close to players. Cane took action when one of the invaders came within a metre of All Blacks players, kicking the man and knocking him to the ground. It invoked memories of Andy Symonds shoulder charging a pitch invader in a cricket match, Sam Kerr shouldering a streaker to the ground in the UK and Johnny Bairstow removing a protestor from the field during The Ashes in another example of athlete's taking things into their own hands. Sam Cane has apologised via social media for kicking a pitch invader following this morning¿s test against Argentina Goes without saying, but this is not a good look for the All Blacks captain pic.twitter.com/M6baJk518A — Andrew Gourdie (@AndrewGourdie) July 9, 2023 New Zealand skipper Sam Cane kicked out at a pitch invader who came too close to the players after their win over Argentina in the Rugby Championship Cane has apologised for his actions on social media but could still face sanction from New Zealand Rugby Cane, 31, has an otherwise exemplary discipline record and is yet to receive a red card in 87 tests for the All Blacks or 150 matches for the Chiefs in Super Rugby level. He took to social media to apologise for the incident and it remains to be seen whether he will face further sanction from NZ Rugby. 'After the game someone ran onto the pitch and I made an error in judgment and played a part in stopping him,' Cane posted. 'I acknowledge this was not my role and it is out of character of me to act in such a way. I am really sorry and am disappointed in myself. 'I am trying my best to contact the individual to apologise and make things right.' He then later added: 'Through the help of many good people, I managed to track down Roman. 'Had a good catch up with him and his friends and I'm glad that we could leave things in a good place.' Footage showed Cane stepping away from the playing group to lash out at the pitch invader who was one of many that stormed the field after the match A pocket of rugby fans strangely leapt to the defence of the pitch invade and called for punishment to be handed down to the Kiwi captain. 'He should be banned for this,' one posted. 'The @AllBlacks coaches have surely got to be questioning what his decision making would be like in the heat of the game,' added another. 'Tripping is sending off infraction. Kane is useless anyway. He won't be missed,' posted another. But most supporters are in favour of Cane's actions, with some saying the pitch invader got off lightly. 'Goes without saying' jog on mate, pitch invaders need to be sorted out. Shame he didn't smash him harder. As soon as a pitch invader goes on the field, they can't complain if they get smashed,' one fan replied to the video of the incident. 'The only thing he should be apologising for is not going in for the coat-hanger,' added another. Cane, pictured with wife Harriet Allen, has an exemplary record and has never received a red card at Super Rugby or international level Cane was influential once again for the All Blacks on the field as New Zealand claimed a comfortable win over Argentina 'Bro players have tackled pitch invaders before why shouldn't he do that that person should know better,' posted another. Newstalk ZB's rugby editor Elliott Smith was at the ground and said there were at least 15 pitch invaders on the ground at the time and the Kiwi skipper had every right to protect himself. 'I have no real issue with what Sam Cane has done here. The pitch invaders were coming from left, right and centre from fulltime - I suspect there would have been 15 or so at least. One nearly took out Damian McKenzie and I as we were speaking for Sky,' Smith said on Twitter. Former All Black Israel Dagg also backed the actions of Cane. 'I would have done the same tbh .. maybe a lazy no arm shoulder!! Stay off the field,' he tweeted. Share or comment on this article: All Blacks captain Sam Cane says sorry after brutally kicking pitch invader after win over Argentina e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-10 03:04:46","image_url":"https://i.dailymail.co.uk/1s/2023/07/10/02/73028467-0-image-a-32_1688953671029.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"}]}