{"newsArray":[{"title":"Nine lands rights for two marquee cricket tournaments","link":"https://wwos.nine.com.au/cricket/icc-t20-world-cup-2022-icc-odi-world-cup-2023-australia-nine-wide-world-of-sports-broadcast-rights/2a003877-b623-4069-a5d3-08a5361d3617","keywords":null,"creator":["wwos"],"video_url":null,"description":"Nine has landed the free-to-air rights for the men's 2022 T20 World Cup and 2023 one-day international World Cup.","content":"Cricket is set to return to Nine's screens after it secured the free-to-air rights for the 2022 men's T20 World Cup and 2023 men's one-day international World Cup.Every Australian match and other headline matches will be broadcast live and free on Nine.The T20 World Cup, to be held in Australia for the first time, will start on October 16 and end with the final on November 13 at the Melbourne Cricket Ground.AS IT HAPPENED: 'Magnificent' Cilic forces stunning boiloverREAD MORE: Aftermath of Kyrgios altercation caught on cameraREAD MORE: Second star blasts 'disrespectful' Aussie crowdsAustralia will start their T20 title defence in a rematch of last year's final against New Zealand on October 22.The 2023 ODI World Cup, to be hosted by India, will get underway on a date in October yet to be revealed, with the final on November 26.Nine director of sport Brent Williams welcomed the news.\"Any cricket World Cup is a premium event on the international calendar and we're excited to be the free-to-air home of the 2022 T20 World Cup in Australia and the 2023 World Cup, which will be held in India,\" Williams said.\"Nine has a long and proud history with cricket and we look forward to that continuing with all Australian and key matches of these prestigious events being broadcast across Nine's platforms.\"Australia, under the captaincy of Aaron Finch, won their first men's T20 World Cup when they beat New Zealand by eight wickets in Dubai in November.They'll be out to repeat the heroics of their 2015 ODI World Cup triumph on home soil when this year's tournament kicks off.The 2015 victory saw captain Michael Clarke lead Australia to glory over New Zealand by seven wickets at the MCG.For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here!","pubDate":"2022-01-22 21:00:00","full_description":"Cricket is set to return to Nine's screens after it secured the free-to-air rights for the 2022 men's T20 World Cup and 2023 men's one-day international World Cup . Every Australian match and other headline matches will be broadcast live and free on Nine. The T20 World Cup, to be held in Australia for the first time, will start on October 16 and end with the final on November 13 at the Melbourne Cricket Ground. AS IT HAPPENED: 'Magnificent' Cilic forces stunning boilover READ MORE: Aftermath of Kyrgios altercation caught on camera READ MORE: Second star blasts 'disrespectful' Aussie crowds Australia will start their T20 title defence in a rematch of last year's final against New Zealand on October 22. The 2023 ODI World Cup, to be hosted by India, will get underway on a date in October yet to be revealed, with the final on November 26. Nine director of sport Brent Williams welcomed the news. \"Any cricket World Cup is a premium event on the international calendar and we're excited to be the free-to-air home of the 2022 T20 World Cup in Australia and the 2023 World Cup, which will be held in India,\" Williams said. \"Nine has a long and proud history with cricket and we look forward to that continuing with all Australian and key matches of these prestigious events being broadcast across Nine's platforms.\" Australia, under the captaincy of Aaron Finch , won their first men's T20 World Cup when they beat New Zealand by eight wickets in Dubai in November . They'll be out to repeat the heroics of their 2015 ODI World Cup triumph on home soil when this year's tournament kicks off. The 2015 victory saw captain Michael Clarke lead Australia to glory over New Zealand by seven wickets at the MCG. For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here!","image_url":"https://vms-network-images-prod.s3-ap-southeast-2.amazonaws.com/2021/11/393177/pickerimage.jpg","source_id":"nine"},{"title":"AU-A-W vs EN-A-W Dream11 Prediction: Fantasy Cricket Tips, Today's Playing 11 and Pitch Report for England Women A Tour of Australia, 3rd T20I","link":"https://www.sportskeeda.com/fantasy-cricket-mantra/au-a-w-vs-en-a-w-dream11-prediction-fantasy-cricket-tips-today-s-playing-11-pitch-report-england-women-a-tour-australia-3rd-t20i?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Fantasy Cricket Mantra"],"creator":["Anjishnu Roy"],"video_url":null,"description":null,"content":null,"pubDate":"2022-01-22 19:18:53","full_description":"Australia Women A will take on England Women A in the third T20I of the England Women A Tour of Australia at the Karen Rolton Oval in Adelaide on Sunday. Australia Women A have already pocketed the series with back-to-back victories in the first two games. They have been better than their opposition in all three departments. The hosts defeated England Women A by three wickets in the last match between the two sides and will be hoping to complete a whitewash here. England Women A, meanwhile, will have to go back to the drawing board to figure out what went wrong in the first two matches. They were beaten comprehensively and will try to salvage pride with a win here. AU-A-W XI Georgia Redmayne (c) (wk), Elyse Villani, Phoebe Litchfield, Georgia Voll, Heather Graham, Amanda-Jade Wellington, Maitlan Brown, Tess Flintoff, Stella Campbell, Courtney Sippel, Hannah Darlington EN-A-W XI Evelyn Jones (c), Bryony Smith, Alice Capsey, Emma Lamb, Georgia Elwiss, Mady Villiers, Charlotte Dean, Anya Shrubsole, Eleanor Threlkeld (wk), Tash Farrant, Kirstie Gordon, Lauren Bell AU-A-W vs EN-A-W, England Women A Tour of Australia, 3rd T20I Date and Time: 23rd January, 2022, 4:30 AM IST Venue: Karen Rolton Oval, Adelaide The surface is known to be seamer-friendly and bowlers are expected to wreak havoc in the initial stages of the game. Batters will need to put their anchors down and try to play longer knocks. Batting second would be a good option here. Wicketkeeper Georgia Redmayne is the best pick for the wicketkeeper-batter position for your Dream11 fantasy side. She has scored 56 runs in two games, including a half-century in the last match. Batters Elyse Villani has been in astounding form with the bat and it was on show in the previous encounter. She fell just six runs short of a century and had a strike rate of 149.21. Bryony Smith has been consistent with her knocks. She has scored 49 runs in two matches at a strike rate of 188.4. All-rounders Heather Graham has been nothing short of sensational for Australia Women A. She scored 25 runs and picked up four wickets in the first game and followed that up with another wicket in the second game. Graham is the best captaincy choice for your AUS-W-A vs EN-W-A Dream11 fantasy team. Bowlers Amanda Wellington has been a consistent wicket-taker during the series and has five scalps in two matches. Heather Graham (AU-A-W) – 207 points Amanda Wellington (AU-A-W) – 159 points Elyse Villani (AU-A-W) – 132 points Georgia Redmayne (AU-A-W) – 114 points Bryony Smith (EN-A-W) – 96 points Heather Graham: 25 runs and 5 wickets Amanda Wellington: 5 wickets Elyse Villani: 98 runs Georgia Redmayne: 56 runs Bryony Smith: 49 runs Fantasy Suggestion #1: Georgia Redmayne, Elyse Villani, Bryony Smith, Emma Lamb, Heather Graham, Alice Capsey, Georgia Elwiss, Amanda Wellington, Lauren Bell, Kirstie Gordon, Maitlan Brown Captain: Heather Graham , Vice-Captain: Amanda Wellington Fantasy Suggestion #2: Georgia Redmayne, Elyse Villani, Georgia Voll, Bryony Smith, Emma Lamb, Heather Graham, Alice Capsey, Georgia Elwiss, Amanda Wellington, Lauren Bell, Kirstie Gordon Captain: Elyse Villani , Vice-Captain: Georgia Redmayne","image_url":"https://static.sportskeeda.com/editor/2022/01/2807b-16428723334839-1920.jpg","source_id":"sportskeeda"},{"title":"OV vs CTB Dream11 Prediction: Fantasy Cricket Tips, Today's Playing 11 and Pitch Report for Super Smash 2021-22, Match 29","link":"https://www.sportskeeda.com/fantasy-cricket-mantra/otago-volts-vs-canterbury-kings-dream11-prediction-fantasy-cricket-tips-today-s-playing-11-pitch-report-super-smash-2021-22?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Fantasy Cricket Mantra"],"creator":["Sahil Jain"],"video_url":null,"description":null,"content":null,"pubDate":"2022-01-22 19:18:53","full_description":"Otago Volts (OV) will take on Canterbury Kings (CTB) in the 29th match of the Super Smash 2021-22 at the University Oval in Dunedin on Sunday. The Otago Volts have already been knocked out of the Super Smash 2021-22. They have just one win, seven losses and one washout to their name. Meanwhile, the Canterbury Kings have won six and lost thrice so far. A win in this game would guarantee them a second-spot finish at the end of the league phase. Otago Volts : Hamish Rutherford (c), Neil Broom, Nick Kelly, Dale Phillips, Llew Johnson, Anaru Kitchen, Michael Rippon, Max Chu (wk), Angus McKenzie, Jake Gibson, Jacob Duffy Canterbury Kings : Chad Bowes, Tom Latham, Daryl Mitchell, Leo Carter, Cole McConchie (c), Cam Fletcher (wk), Henry Shipley, Matt Henry, Todd Astle, William ORourke, Ed Nuttall OV vs CTB, 29th Match, Super Smash 2021-22 Date & Time: January 23rd 2022, 6:10 AM IST Venue: University Oval, Dunedin The pitch at the University Oval in Dunedin has been a good one to bat on. The average first-innings score in the Super Smash 2021-22 at the venue has been 165 runs. Wicketkeeper Cam Fletcher has batted really well throughout the Super Smash 2021-22, having scored 233 runs at a strike rate of 146.54. Batter Hamish Rutherford has looked in good touch, with the Otago captain scoring 223 runs in eight innings. All-rounder Anaru Kitchen has been one of the best players for Otago this season. He has 11 wickets to his name and has also scored 152 runs. Bowler Matt Henry has been bowling well and has taken 11 scalps from seven fixtures in the Super Smash 2021-22. Anaru Kitchen (OV): 582 points Henry Shipley (CTB): 566 points Ed Nuttall (CTB): 465 points Matt Henry (CTB): 465 points Chad Bowes (CTB): 419 points Anaru Kitchen: 152 runs & 11 wickets Henry Shipley: 140 runs & 11 wickets Ed Nuttall: 15 wickets Matt Henry: 11 wickets Fantasy Suggestion #1: Tom Latham, Cam Fletcher, Neil Broom, Hamish Rutherford, Chad Bowes, Michael Rippon, Anaru Kitchen, Henry Shipley, Jacob Duffy, Matt Henry, Ed Nuttall Captain: Anaru Kitchen. Vice-captain: Matt Henry. Fantasy Suggestion #2: Tom Latham, Cam Fletcher, Hamish Rutherford, Chad Bowes, Nick Kelly, Anaru Kitchen, Cole McConchie, Henry Shipley, Matt Henry, Ed Nuttall, Angus McKenzie Captain: Henry Shipley. Vice-captain: Chad Bowes.","image_url":"https://static.sportskeeda.com/editor/2022/01/01581-16428711984383-1920.jpg","source_id":"sportskeeda"},{"title":"NBL 2022: Sydney Kings to honour every player with Baggy Green-style number tribute","link":"https://thewest.com.au/sport/nbl-2022-sydney-kings-to-honour-every-player-with-baggy-green-style-number-tribute-c-5411771","keywords":null,"creator":["Matt Logue "],"video_url":null,"description":"The Sydney Kings have created a concept similar to one made famous by the Aussie cricket team to honour the 200-plus players who have donned the iconic purple and gold.","content":null,"pubDate":"2022-01-22 19:03:22","full_description":null,"image_url":"https://images.thewest.com.au/publication/C-5411771/a1f700b2f6fb6105e50b455dedfc928c1b1332c3-16x9-x225y0w1449h815.jpg","source_id":"thewest"},{"title":"NBL 2022: Sydney Kings to honour every player with Baggy Green-style number tribute","link":"https://www.perthnow.com.au/sport/nbl-2022-sydney-kings-to-honour-every-player-with-baggy-green-style-number-tribute-c-5411758","keywords":null,"creator":["Matt Logue "],"video_url":null,"description":"The Sydney Kings have created a concept similar to one made famous by the Aussie cricket team to honour the 200-plus players who have donned the iconic purple and gold.","content":null,"pubDate":"2022-01-22 19:03:02","full_description":"The Sydney Kings will honour every player in the club’s proud history as part of a ‘Baggy Green’ style number tribute later this season. The Kings will mark the 200-plus players who have donned the iconic purple and gold with an individual number and a commemorative gift in a special presentation during the club’s final home game in April, which will become the franchise’s official Old Boys Game. The concept is the brainchild of Sydney Kings fan and photographer Damien Garth, who has been supported by former Kings player and assistant coach Daniel Kickert. Watch Every Game of the 21/22 NBL Season Live & On-Demand with ESPN on Kayo. New to Kayo? Start Your Free Trial > Garth said the idea came from looking at other sporting codes and clubs who recognise their playing groups in numerical fashion, while the concept has been rarely used in Australian basketball. “Much is made in football circles of players making their debut, ‘such and such becomes Wests Tigers number 123’ or ‘Josh Hazlewood presents Scott Boland with Baggy Green number 463’,” Garth said. “It is a big deal. The player is joining a select club only a small number are a part of. They are now part of that club’s DNA.” The number allocation was determined by what NBL game the player made their debut in. The players were then judged on whether they started or came off the bench before being placed into alphabetical order and allocated a number, with foundation import guard Steve Carfino being given the honour of No.1. Kickert said it was important for any playing group to understand the history and legacy of their organisation. Kings coaching intern Liam Cavanagh-Downs has been putting together episodes for the playing group featuring old games and player interviews, which the current Kings have been watching to get a better understanding of the club’s history. “It helps the group buy into the culture we are building and get a sense that this is about more than just them,” Kickert said. “It’s recognition that when they see the faces of the past players looking on from the stand, they recognise them and understand that history. “They understand that one day it could be them with their jersey hanging from the rafters or their championship displayed in the window. “It’s an understanding that once you are a King, we will keep you in the fold and you’ll forever be a King.” Sydney Kings owner and chairman Paul Smith revealed the club will look at recognising Sydney Flames players in the same fashion sometime into the future, but missing WNBL records meant the Flames’ list was going the need significant further work.","image_url":"https://images.perthnow.com.au/publication/C-5411758/a1f700b2f6fb6105e50b455dedfc928c1b1332c3-16x9-x225y0w1449h815.jpg","source_id":"perthnow"},{"title":"Aussies to bare all with inside look at Paine scandal","link":"https://www.cairnspost.com.au/sport/cricket/australian-test-team-to-bare-all-with-inside-look-at-tim-paine-scandal-in-latest-documentary/news-story/98aa143144d275759b3aa9461a7e6230","keywords":["Cricket news and galleries","Sport news and galleries"],"creator":null,"video_url":null,"description":"The power shift in Australian cricket will be laid bare in a new fly-on-the-wall documentary about the men’s Test team.","content":null,"pubDate":"2022-01-22 19:00:00","full_description":null,"image_url":null,"source_id":"cairnspost"},{"title":"Legends League Cricket: Imran Tahir fifty helps World Giants stun India Maharajas","link":"https://sportstar.thehindu.com/cricket/imran-tahir-fifty-world-giants-beat-india-maharajas-legends-league-cricket-2022-naman-ojha-140/article38311265.ece","keywords":null,"creator":["Team Sportstar"],"video_url":null,"description":"Imran Tahir's 19-ball 52* helped World Giants earn its first win after a sensational 210-run chase against India Maharajas in Muscat on Saturday.","content":null,"pubDate":"2022-01-22 18:44:53","full_description":null,"image_url":null,"source_id":"sportstar"},{"title":"T20 World Cup 2022 Scotland Full Schedule, Match Timings in IST, Time Table, Venues and Dates","link":"https://www.indiatvnews.com/sports/cricket/t20-world-cup-2022-scotland-full-schedule-time-table-fixtures-match-timings-in-ist-venues-dates-all-teams-schedule-icc-t20wc-2022-2022-01-23-755800","keywords":null,"creator":null,"video_url":null,"description":"T20 World Cup 2022 Scotland Full Schedule, Match Timings in IST, Time Table, Venues and Dates Scotland became Associate Members of the International Cricket Council (ICC) in 1994 after severing links with the England cricket team two years earlier. Since then, they have played in three Cricket World Cups (1999, 2007 and 2015) and three T20 World Cup (2007, 2009 and 2016).","content":null,"pubDate":"2022-01-22 18:42:40","full_description":"In the 2022 World Cup, to be played Down Under, Namibia are drafted in Group B of Round 1 qualifiers and will begin their campaign against two-time champions West Indies on October 17.","image_url":null,"source_id":"indiatvnews"},{"title":"Who gets IPL auction money?: Does IPL auction money go to the player?","link":"https://thesportsrush.com/cricket-news-who-gets-ipl-auction-money-does-ipl-auction-money-go-to-the-player/","keywords":["Cricket","IPL","IPL Auction"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Who gets IPL auction money?: The players from across continents get themselves registered at a certain base price ahead of an IPL auction. The IPL season is back and it promises to be as exciting as ever, despite the COVID-19 scare refusing to bade farewell from peoples’ lives. With the 15th season of India’s lucrative… The post Who gets IPL auction money?: Does IPL auction money go to the player? appeared first on The SportsRush.","content":"Who gets IPL auction money?: The players from across continents get themselves registered at a certain base price ahead of an IPL auction. The IPL season is back and it promises to be as exciting as ever, despite the COVID-19 scare refusing to bade farewell from peoples’ lives. With the 15th season of India’s lucrative league just around the corner, as many as 1,214 players have reportedly registered themselves for the imminent auction, which includes 896 Indians and 318 overseas players. The list comprises 270 capped players, 903 uncapped, and as many as 41 players from Associate nations like the Netherlands, Oman, UAE, Scotland, and Nepal. As per Cricbuzz, at least 200 players (off 1,214) are likely to go under the hammer at the auction table, if the ten franchises were to have the maximum permissible number of 25 players in their squad. While the fate of the players rest on the franchises, a total of 49 players have put themselves in the highest base price amount bracket of INR 2 Crore, which includes 17 Indians and 32 Overseas Cricketers. Breaking- 27 March starting date for @IPL owner’s suggestion Mumbai/Pune combined for entire tournament. Dubai is back up plan not South Africa. Auction as of now remains same but will depend on covid situation. — Boria Majumdar (@BoriaMajumdar) January 22, 2022 Who gets IPL auction money? The important question which arises in the minds of Cricket fans, is whether or not the bidding price is actually entirely received by the player concerned or not. To begin the answer with, each player is assigned a base price which ranges from INR 20 Lakh to INR 2 Crore, which is decided by the players themselves before they register themselves at the auction. The bidding starts at the base price and the highest bid eventually becomes that player’s salary. The player is the sole claimant of the bidding amount, and no one else but him is entitled to that sum. The final price price however, is adjusted after deduction of relevant taxes. Also, in case of overseas players, the BCCI pays 20% of the player’s salary for that season to that particular player’s home board. The amount is deducted from BCCI’s central revenue pool and not from the particular player’s salary. As per the existing system, the BCCI and the remaining franchises share the central revenue amount at 50:50 ratio. Do players get full amount despite not playing all/some IPL matches? The player gets the entire bidding amount (post taxes) if he’s available for the entire season, even if the team management has decided not to play him at all. In case a player gets injured before the start of the league, the franchise doesn’t have to pay anything. However, if the player is not available for a few matches after the league has started, he is entitled to be paid on a pro-rata basis.                       The post Who gets IPL auction money?: Does IPL auction money go to the player? appeared first on The SportsRush.","pubDate":"2022-01-22 18:34:31","full_description":null,"image_url":null,"source_id":"thesportsrush"},{"title":"IPL 2022 to be held in India without crowd: BCCI sources","link":"https://www.thehansindia.com/sports/ipl-2022-to-be-held-in-india-without-crowd-bcci-sources-725823","keywords":["Sports,Today NewsPaper"],"creator":["The Hans India"],"video_url":null,"description":"TENTATIVE DATE: MARCH 27","content":"IPL 2022 to be held in India without crowd: BCCI sourcesIPL 2022 to be held in India without crowd: BCCI sourcesMumbai: The Indian Premier League (IPL) 2022 season will be held in India, top sources in the Board of Control for Cricket in India (BCCI) said. Sources in the know of developments confirmed that if the Covid-19 subsides in the country, then the board will go ahead with hosting the IPL 2022 in India.\"IPL 2022 will be held in India and the tournament will be staged without crowds in attendance. Likely venues for IPL 2022 are Wankhede Stadium, Cricket Club of India (CCI), DY Patil Stadium in Mumbai and if needed, we can look at Pune as well,\" the sources said. Meanwhile, IPL Governing Council chairman Brijesh Patel said that IPL 2022 is tentatively set to start from March 27. A source, which attended the meeting on Saturday, said the board is hopeful of having IPL 2022 played a home.The availability of multiple grounds in Mumbai and Pune will make it easier as the new season will have 10 teams, including 2 new teams -- one from Ahmedabad and the other from Lucknow, the sources said. The IPL player registration closed on January 20 and a total of 1,214 players (896 Indian and 318 overseas) have signed up to be part of the 2022 player auction. The two-day mega auction will see 10 teams bidding for some of the finest talents in world cricket. The players' list incorporates 270 capped, 903 uncapped, and 41 Associate players. The detailed list is as follows: Capped Indian (61 players), Capped International (209 players), Associate (41 players), Uncapped Indians who were a part of previous IPL seasons (143 players), Uncapped International who were a part of previous IPL seasons (6 players), Uncapped Indians (692 players), and Uncapped Internationals (62 players). The IPL auction is set to be held on February 12 and 13 in Bengaluru.","pubDate":"2022-01-22 18:32:31","full_description":null,"image_url":"https://assets.thehansindia.com/h-upload/2022/01/22/500x300_1196355-ipl.jpg","source_id":"thehansindia"},{"title":"Legends League | A wonderful initiative: Hafeez","link":"https://www.thehindu.com/sport/cricket/legends-league-a-wonderful-initiative-hafeez/article38311237.ece","keywords":null,"creator":["P.K. Ajith Kumar"],"video_url":null,"description":"Says he personally enjoyed playing with the former stars of world cricket","content":null,"pubDate":"2022-01-22 18:28:46","full_description":null,"image_url":null,"source_id":"thehindu"},{"title":"Sreesanth IPL 2022: What is S Sreesanth base price in IPL 2022 auction?","link":"https://thesportsrush.com/cricket-news-sreesanth-ipl-2022-what-is-s-sreesanth-base-price-in-ipl-2022-auction/","keywords":["Cricket","IPL 2022","IPL","S Sreesanth"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Sreesanth IPL 2022: Former Indian fast bowler S Sreesanth has yet again got his name registered for the upcoming IPL 2022 mega auction. Former Indian pacer S Sreesanth has registered himself for the upcoming mega auction ahead of IPL 2022. Sreesanth, who last played in the IPL in 2013 for the Rajasthan Royals (RR), had… The post Sreesanth IPL 2022: What is S Sreesanth base price in IPL 2022 auction? appeared first on The SportsRush.","content":"Sreesanth IPL 2022: Former Indian fast bowler S Sreesanth has yet again got his name registered for the upcoming IPL 2022 mega auction. Former Indian pacer S Sreesanth has registered himself for the upcoming mega auction ahead of IPL 2022. Sreesanth, who last played in the IPL in 2013 for the Rajasthan Royals (RR), had also registered his name during the previous mini auction in 2021 for a base price of INR 75 Lakh, but unfortunately couldn’t make it to the final list of players the eight franchises were interested in. The 38-year-old has thus joined the list of 1,214 players who have reportedly registered themselves for IPL 2022 auction, which includes 896 Indians and 318 overseas players. Players in IPL teams: CSK:Jadeja,MSD,Ali,Ruturaj MI:Rohit,Bumrah,SKY,Pollard KKR:Andre,Varun,V Iyer,Narine PBKS:Mayank,Arshdeep RCB:Virat,Maxwell,Siraj RR: Sanju,Buttler,Jaiswal SRH:Kane,Samad,Malik Ahmedabad:Hardik,Rashid,Gill Lucknow:KL,Stoinis,Bishnoi DC:Pant,Axar,Shaw,Nortje — Sarang Bhalerao (@bhaleraosarang) January 22, 2022 Sreesanth IPL 2022: What is Sreesanth’s base price? As per EspnCricinfo, the Keralite speedster has registered his base price at INR 50 lakh this time around. The right-arm pacer was set to return to First-Class Cricket for his home state Kerala with the 2021-22 Ranji Trophy season, which has been postponed indefinitely for second successive year, due to yet another surge in the COVID-19 cases in the country. He recently played in the Vijay Hazare Trophy during the 2020/21 season where he picked up a total of 13 wickets in 6 innings at an average of 24.38 for Kerala. Having previously played a total of 44 IPL matches for three franchises in Rajasthan Royals, Kochi Tuskers Kerala, and Kings XI Punjab, Sreesanth had picked up a total of 44 wickets. The right-handed pacer was banned for life by the BCCI in September 2013 while playing for the Rajasthan Royals, after his alleged involvement in the spot-fixing scandal came to light. The ban was reduced to seven years by a BCCI Ombudsman in 2019, and he was cleared to return to professional Cricket by September 2020. Before that, he had played a total of 10 T20Is for team India and picked up a total of 7 wickets at an average of 41.14 and at an economy rate of 8.47.       The post Sreesanth IPL 2022: What is S Sreesanth base price in IPL 2022 auction? appeared first on The SportsRush.","pubDate":"2022-01-22 17:12:06","full_description":null,"image_url":null,"source_id":"thesportsrush"},{"title":"Cricket-India-Windies series to be played in two cities due to COVID-19 - BCCI","link":"https://www.thestar.com.my/sport/cricket/2022/01/22/cricket-india-windies-series-to-be-played-in-two-cities-due-to-covid-19---bcci","keywords":null,"creator":null,"video_url":null,"description":"(Reuters) - India's upcoming One Day International and Twenty20 international series against West Indies will be hosted in two cities to minimise \"biosecurity risks\" amid the COVID-19 pandemic, the Indian cricket board (BCCI) said on Saturday. Read full story","content":null,"pubDate":"2022-01-22 15:55:00","full_description":"(Reuters) - India's upcoming One Day International and Twenty20 international series against West Indies will be hosted in two cities to minimise \"biosecurity risks\" amid the COVID-19 pandemic, the Indian cricket board (BCCI) said on Saturday. The white-ball series was originally intended to be played across six venues, including the Indian cities of Jaipur, Visakhapatnam, Cuttack and Thiruvananthapuram, but will now be hosted entirely in Ahmedabad (ODI) and Kolkata (T20). \"The decision ... has been done to mitigate biosecurity risks by cutting down on travel and movement of the teams, match officials, broadcasters, and other stakeholders,\" BCCI said in a statement. The two series will be played between Feb. 6-20. (Reporting by Aadi Nair in Bengaluru; Editing by Ken Ferris)","image_url":"https://apicms.thestar.com.my/uploads/images/2022/01/22/1454346.jpg","source_id":"thestar_my"},{"title":"IPL auction 2022 time: When will the auction of 2022 start?","link":"https://thesportsrush.com/cricket-news-ipl-auction-2022-time-when-will-the-auction-of-2022-start/","keywords":["Cricket","IPL 2022","IPL","IPL 2022 Auction"],"creator":["Gurpreet Singh"],"video_url":null,"description":"IPL auction 2022 time: The BCCI secretary has come up with the official dates for conduction of IPL mega auction for the upcoming season. The Board of Control for Cricket in India (BCCI) secretary Jay Shah has come up with an official announcement for the dates regarding the conduction of the much anticipated mega auction… The post IPL auction 2022 time: When will the auction of 2022 start? appeared first on The SportsRush.","content":"IPL auction 2022 time: The BCCI secretary has come up with the official dates for conduction of IPL mega auction for the upcoming season. The Board of Control for Cricket in India (BCCI) secretary Jay Shah has come up with an official announcement for the dates regarding the conduction of the much anticipated mega auction of IPL 2022. Shah announced on Saturday that the mega auction will take place on February 12 and 13, but has not confirmed the venue for the grand 2-day event. “The mega IPL Auction will take place on February 12-13th and we will lock in the venues before that,” BCCI secretary Jay Shah said in a statement released after the meeting with the owners of the IPL on Saturday. As per an earlier report, the auction event was supposed to be conducted in Benguluru, but the city’s largest premium meeting and conference destination- Sheraton Grand Bengaluru Whitefield Hotel and Convention Center has been booked for the ongoing Pro Kabaddi League (PKL) 2022. Thus, it remains to be seen whether the BCCI opt for another hotel or make some provision in the same hotel or decide upon a different venue. ALSO READ: List of players who’ve registered for IPL 2022 mega auction. IPL auction 2022 time: When will IPL 2022 start? Along with the dates of the auction, Jay Shah has also disclosed a tentative date for the commencement of IPL’s upcoming season. “I am delighted to confirm that the 15th season of the IPL will start in the last week of March and will run until May end,” Shah said. I am delighted to confirm that the 15th season of the IPL will start in the last week of March and will run until May end. A majority of the team owners expressed their wish that the tournament be held in India: BCCI Secretary Jay Shah#IPL2022 (File photo) pic.twitter.com/dUabG1p14h — ANI (@ANI) January 22, 2022 Earlier, as per Cricbuzz, the BCCI had internally conveyed to the key stakeholders that April 2, in all probability, is the date and Chennai, in all certainty, will be the venue for IPL 2022. However, with the number of matches to go up to 74 (as against 60) with the addition of two new franchises, the BCCI is keen to start the lucrative league a week earlier, to reduce the total number of day matches.       The post IPL auction 2022 time: When will the auction of 2022 start? appeared first on The SportsRush.","pubDate":"2022-01-22 15:49:20","full_description":null,"image_url":null,"source_id":"thesportsrush"},{"title":"Sharing dressing room with legends special: Mohammad Hafeez","link":"https://sportstar.thehindu.com/cricket/sharing-dressing-room-with-legends-special-mohammad-hafeez/article38309996.ece","keywords":null,"creator":["P. K. Ajith Kumar"],"video_url":null,"description":"Mohammad Hafeez has been one of cricket’s most durable men and was 41 when he announced his retirement from the international game early this month.","content":null,"pubDate":"2022-01-22 15:36:22","full_description":null,"image_url":null,"source_id":"sportstar"},{"title":"Ahmedabad To Host ODI Series vs West Indies, T20Is To Be Held In Kolkata","link":"https://sports.ndtv.com/cricket/ind-vs-wi-ahmedabad-to-host-indias-odi-series-vs-west-indies-t20is-to-be-held-in-kolkata-2724054","keywords":null,"creator":null,"video_url":null,"description":"The Board of Control for Cricket in India (BCCI) on Saturday announced a change in venues for the upcoming West Indies' Tour of India.","content":null,"pubDate":"2022-01-22 15:27:59","full_description":"The Board of Control for Cricket in India (BCCI) on Saturday announced a change in venues for the upcoming West Indies' Tour of India . The three ODIs will now be played at the Narendra Modi Stadium, Ahmedabad and three T20Is will be held at the Eden Gardens, Kolkata. \"The decision to limit the series to two venues instead of six as originally announced has been done to mitigate biosecurity risks by cutting down on travel and movement of the teams, match officials, broadcasters, and other stakeholders,\" stated an official BCCI release. On January 19, ANI had reported that the upcoming series between India and West Indies will be played across just two venues -- Ahmedabad and Kolkata. The series will kick start on February 6 and will end on February 20.","image_url":"https://c.ndtvimg.com/2022-01/sjv4ss1o_shikhar-dhawan_625x300_22_January_22.jpg?im=FeatureCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv"},{"title":"India Under 19 vs Uganda Under 19 Live Score: Angkrish Raghuvanshi Gives India Bright Start vs Uganda - NDTV Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMigQFodHRwczovL3Nwb3J0cy5uZHR2LmNvbS9pY2MtdW5kZXItMTktd29ybGQtY3VwLTIwMjIvaWNjLXUxOS13b3JsZC1jdXAtMjAyMi1pbmRpYS11bmRlci0xOS12cy11Z2FuZGEtMTktbGl2ZS1zY29yZS11cGRhdGVzLTI3MjM3MDfSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"India Under 19 vs Uganda Under 19 Live Score: Angkrish Raghuvanshi Gives India Bright Start vs Uganda  NDTV SportsCovid-19: Five Indians, including Yash Dhull, ruled out of Under-19 World Cup game against Uganda  ESPNcricinfoIndia vs Uganda, Live Score, ICC U19 World Cup 2022: Angkrish scores half-century  FirstpostSkipper Yash Dhull among five ruled out of Uganda game  Hindustan TimesIndia vs Uganda, Live Cricket Score, Under-19 World Cup 2022: India Bat First  News18View Full coverage on Google News","content":null,"pubDate":"2022-01-22 14:07:21","image_url":null,"source_id":"google"},{"title":"IPL 2022 to begin in last week of March: Jay Shah","link":"https://timesofindia.indiatimes.com/sports/cricket/ipl/top-stories/ipl-2022-to-begin-in-last-week-of-march-will-leave-no-stone-unturned-to-stage-it-in-india-jay-shah/articleshow/89062129.cms","keywords":null,"creator":null,"video_url":null,"description":"The Board of Control for Cricket in India (BCCI) secretary Jay Shah on Saturday confirmed that the IPL 2022 season will begin in the last week of March and the season will conclude in May.","content":null,"pubDate":"2022-01-22 13:53:34","full_description":null,"image_url":null,"source_id":"toi"},{"title":"IPL To Start In Last Week Of March, Mega Auction On Feb 12-13: Jay Shah","link":"https://sports.ndtv.com/cricket/ipl-2022-to-start-in-last-week-of-march-mega-auction-on-february-12-13-says-bcci-secretary-jay-shah-2723857","keywords":null,"creator":null,"video_url":null,"description":"Board of Control for Cricket in India (BCCI) secretary Jay Shah on Saturday confirmed that the IPL 2022 season will begin in the last week of March and the season will conclude in May.","content":null,"pubDate":"2022-01-22 13:43:23","full_description":"Board of Control for Cricket in India (BCCI) secretary Jay Shah on Saturday confirmed that the IPL 2022 season will begin in the last week of March and the season will conclude in May. \"I am delighted to confirm that the 15th season of the IPL will start in the last week of March and will run until May end. A majority of the team owners expressed their wish that the tournament be held in India. The BCCI was always keen on staging the 2022 edition that will see two new teams - Ahmedabad and Lucknow - in India,\" Shah said in an official statement. \"I can tell you that we will leave no stone unturned in ensuring that IPL stays in India. The BCCI has not compromised on the health and safety of its stakeholders in the past and will concurrently work on Plan B since the COVID-19 situation with new variants remains fluid. The mega IPL Auction will take place on February 12-13th and we will lock in venues before that,\" he added. The IPL player registration closed on January 20 and a total of 1,214 players (896 Indian and 318 overseas) have signed up to be part of the 2022 player auction. The two-day mega auction will see 10 teams bidding for some of the finest talents in world cricket. The players' list incorporates 270 capped, 903 uncapped, and 41 Associate players. Promoted The detailed list is as follows: Capped Indian (61 players), Capped International (209 players), Associate (41 players), Uncapped Indians who were a part of previous IPL seasons (143 players), Uncapped International who were a part of previous IPL seasons (6 players), Uncapped Indians (692 players), and Uncapped Internationals (62 players). The IPL auction is set to be held on February 12 and 13 in Bengaluru.","image_url":"https://c.ndtvimg.com/2021-05/7lotruq8_ipl-trophy_625x300_29_May_21.jpg?im=FaceCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv"},{"title":"India Maharajas vs World Giants LIVE Score, Legends League Cricket: Yusuf, Irfan in focus; Toss, Playing XI, Streaming updates","link":"https://sportstar.thehindu.com/cricket/india-maharajas-vs-world-giants-live-score-legends-league-cricket-match-3-updates/article38308866.ece","keywords":null,"creator":["Team Sportstar"],"video_url":null,"description":"Legends League Cricket 2022, IMR vs ALN: Get the cricket score, highlights, commentary, updates and more from match 1 between India Maharajas and Asia Lions in Oman.","content":null,"pubDate":"2022-01-22 13:37:15","full_description":null,"image_url":null,"source_id":"sportstar"},{"title":"IPL 2022: Sam Curran says he is not entering mega auction for THIS reason","link":"https://zeenews.india.com/cricket/ipl-2022-sam-curran-says-he-is-not-entering-mega-auction-to-focus-on-his-rehabilitation-2429966.html","keywords":null,"creator":null,"video_url":null,"description":"England all-rounder Sam Curran, who opted out from the mega auction ahead of the upcoming Indian Premier League (IPL) 2022, said that he will be focusing on his rehabilitation and will be starting his season with Surrey Cricket.","content":null,"pubDate":"2022-01-22 13:35:00","full_description":null,"image_url":null,"source_id":"zeenews"},{"title":"ICC U19 World Cup: Afghanistan U19 vs Zimbabwe U19 Live Score Updates","link":"https://sports.ndtv.com/cricket/icc-u19-world-cup-2022-afghanistan-u19-vs-zimbabwe-u19-live-score-updates-2723843","keywords":null,"creator":null,"video_url":null,"description":"ICC U19 World Cup 2022, Afghanistan U19 vs Zimbabwe U19 Live Score Updates: Afghanistan are taking on Zimbabwe in the ICC U-19 Men's Cricket World Cup 2022.","content":null,"pubDate":"2022-01-22 13:02:03","full_description":"ICC U19 World Cup 2022, Afghanistan U19 vs Zimbabwe U19 Live Score Updates: Afghanistan are taking on Zimbabwe in the ICC U-19 Men's Cricket World Cup 2022. The match is being played at the Diego Martin Sporting Complex in Trinidad & Tobago. Both sides have had identical results in the tournament from their two group matches so far. Both sides won against Papua New Guinea but lost to Pakistan in their group matches so far. With Pakistan primed to take the top spot, both sides are vying for the second spot in the group. ( LIVE SCORECARD )","image_url":"https://c.ndtvimg.com/2022-01/p0mfakp8_icc-u19-world-cup-2022-instagram_625x300_12_January_22.jpg?im=FaceCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv"},{"title":"3rd ODI: India look to avoid whitewash against South Africa","link":"https://www.tribuneindia.com/news/sports/3rd-odi-india-look-to-avoid-whitewash-against-south-africa-363530","keywords":null,"creator":null,"video_url":null,"description":"IANS Cape Town, January 22 Having already lost the ongoing ODI series against South Africa, India will look to adjust to the tempo of 50-over cricket and win the third and final match here on Sunday to avoid a whitewash. KL Rahul-led side lost the first ODI by 31 runs while they suffered a seven-wicket defeat in the second match of the three-match series on Friday. Having learned the lessons from the hosts' batting, India will have to alter their plans to find solutions to their middle-over woes. The batting lost its way in the middle overs in both matches despite promising starts and there could be potential changes to the Indian playing XI. The likes of Shikhar Dhawan, KL Rahul, Virat Kohli and Rishabh Pant have shown their glimpses of brilliance, but they need to fire collectively and score big if Team India wants to win. Venkatesh Iyer and Shreyas Iyer have failed to impress with the bat so the team management will try Suryakumar Yadav in the final ODI. The bowling, on the other hand, also hasn't really troubled South Africa much. India's bowlers have struggled to make inroads in the Powerplay in the last couple of years, and it is something the team will want to rectify in Cape Town, on what is expected to be a spicier pitch compared to the sluggish surface in Paarl. Bhuvneshwar Kumar, who has looked ordinary in the first two ODIs is likely to be replaced by Mohammed Siraj or Deepak Chahar. Jasprit Bumrah, who has played a lot of cricket consistently in the last few months, could be rested to manage his workload. Spinners Ravichandran Ashwin and Yuzvendra Chahal have bowled well but they have failed to pick wickets at crucial junctures. On the other hand, South Africans don't have as many concerns to address. Each of the top five batters have made significant contributions in at least one of the two matches while the spinners have done their job with the ball, bringing South Africa back into the contest in both matches. So far, they have been polished in their template in the first two ODIs, winning the first one by setting a score and then completing the highest-ever successful ODI run chase in Paarl in the second. Having replaced Marco Jansen with Sisanda Magala as their only change with the series on the line on Friday, it seems unlikely the South Africans will tinker too much with their XI. Unless they want to give rest to some of their players and give an opportunity to people who have sat on the bench all series. Since 2016, South Africa have completed seven ODI series whitewashes at home, blanking five different opponents -- Australia (2016 amp; 2020), Ireland (2016 - one-match series), Sri Lanka (2017 and 2019), Zimbabwe (2018), and Bangladesh (2017). India are in line to be the sixth team if everything goes to plan for the hosts on Sunday in Cape Town. Squads: India: KL Rahul (c), Shikhar Dhawan, Virat Kohli, Rishabh Pant (w), Shreyas Iyer, Venkatesh Iyer, Ravichandran Ashwin, Shardul Thakur, Bhuvneshwar Kumar, Jasprit Bumrah, Yuzvendra Chahal, Deepak Chahar, Suryakumar Yadav, Jayant Yadav, Navdeep Saini, Ishan Kishan, Prasidh Krishna, Mohammed Siraj, Ruturaj Gaikwad South Africa: Quinton de Kock (w), Janneman Malan, Temba Bavuma (c), Aiden Markram, Rassie van der Dussen, David Miller, Andile Phehlukwayo, Marco Jansen, Keshav Maharaj, Lungi Ngidi, Tabraiz Shamsi, Wayne Parnell, Dwaine Pretorius, Sisanda Magala, Zubayr Hamza, Kyle Verreynne --IANS","content":null,"pubDate":"2022-01-22 12:31:39","full_description":"IANS Cape Town, January 22 Having already lost the ongoing ODI series against South Africa, India will look to adjust to the tempo of 50-over cricket and win the third and final match here on Sunday to avoid a whitewash. KL Rahul-led side lost the first ODI by 31 runs while they suffered a seven-wicket defeat in the second match of the three-match series on Friday. Having learned the lessons from the hosts' batting, India will have to alter their plans to find solutions to their middle-over woes. The batting lost its way in the middle overs in both matches despite promising starts and there could be potential changes to the Indian playing XI. The likes of Shikhar Dhawan, KL Rahul, Virat Kohli and Rishabh Pant have shown their glimpses of brilliance, but they need to fire collectively and score big if Team India wants to win. Venkatesh Iyer and Shreyas Iyer have failed to impress with the bat so the team management will try Suryakumar Yadav in the final ODI. The bowling, on the other hand, also hasn't really troubled South Africa much. India's bowlers have struggled to make inroads in the Powerplay in the last couple of years, and it is something the team will want to rectify in Cape Town, on what is expected to be a spicier pitch compared to the sluggish surface in Paarl. Bhuvneshwar Kumar, who has looked ordinary in the first two ODIs is likely to be replaced by Mohammed Siraj or Deepak Chahar. Jasprit Bumrah, who has played a lot of cricket consistently in the last few months, could be rested to manage his workload. Spinners Ravichandran Ashwin and Yuzvendra Chahal have bowled well but they have failed to pick wickets at crucial junctures. On the other hand, South Africans don't have as many concerns to address. Each of the top five batters have made significant contributions in at least one of the two matches while the spinners have done their job with the ball, bringing South Africa back into the contest in both matches. So far, they have been polished in their template in the first two ODIs, winning the first one by setting a score and then completing the highest-ever successful ODI run chase in Paarl in the second. Having replaced Marco Jansen with Sisanda Magala as their only change with the series on the line on Friday, it seems unlikely the South Africans will tinker too much with their XI. Unless they want to give rest to some of their players and give an opportunity to people who have sat on the bench all series. Since 2016, South Africa have completed seven ODI series whitewashes at home, blanking five different opponents -- Australia (2016 & 2020), Ireland (2016 - one-match series), Sri Lanka (2017 and 2019), Zimbabwe (2018), and Bangladesh (2017). India are in line to be the sixth team if everything goes to plan for the hosts on Sunday in Cape Town. Squads: India: KL Rahul (c), Shikhar Dhawan, Virat Kohli, Rishabh Pant (w), Shreyas Iyer, Venkatesh Iyer, Ravichandran Ashwin, Shardul Thakur, Bhuvneshwar Kumar, Jasprit Bumrah, Yuzvendra Chahal, Deepak Chahar, Suryakumar Yadav, Jayant Yadav, Navdeep Saini, Ishan Kishan, Prasidh Krishna, Mohammed Siraj, Ruturaj Gaikwad South Africa: Quinton de Kock (w), Janneman Malan, Temba Bavuma (c), Aiden Markram, Rassie van der Dussen, David Miller, Andile Phehlukwayo, Marco Jansen, Keshav Maharaj, Lungi Ngidi, Tabraiz Shamsi, Wayne Parnell, Dwaine Pretorius, Sisanda Magala, Zubayr Hamza, Kyle Verreynne --IANS #IndiaSouthAfrica #ODI","image_url":"https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/1/2022_1$largeimg_1204428855.JPG","source_id":"tribuneindia"},{"title":"South Africa chase down to clinch series","link":"https://www.cairnspost.com.au/sport/cricket/south-africa-chase-down-to-clinch-series/video/6441112a5f942771042ac4f2ca4e267a","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket: South Africa has taken an unbeatable 2-0 lead in their One-Day series against India, defeating them by 7 wickets at Boland Park and Paarl.","content":null,"pubDate":"2022-01-22 12:20:05","full_description":null,"image_url":null,"source_id":"cairnspost"},{"title":"IPL 2022 to be held in India without crowd, say BCCI sources","link":"https://zeenews.india.com/cricket/breaking-ipl-2022-to-be-held-in-india-without-crowd-say-bcci-sources-2429943.html","keywords":null,"creator":null,"video_url":null,"description":"The Indian Premier League (IPL) 2022 season will be held in India itself, top sources in the Board of Control for Cricket in India (BCCI) confirmed.","content":null,"pubDate":"2022-01-22 12:17:00","full_description":null,"image_url":null,"source_id":"zeenews"},{"title":"Fan left red faced after attempted catch","link":"https://www.cairnspost.com.au/sport/cricket/fan-left-red-faced-after-attempted-catch/video/4215bf0eeb842eca14d3b69b51a791b2","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket: A spectator fell onto the pitch trying to pull of the spectacular, but instead embarrassed himself during the Sydney Sixers BBL clash with the Perth Scorchers.","content":null,"pubDate":"2022-01-22 12:08:08","full_description":null,"image_url":null,"source_id":"cairnspost"},{"title":"Big star names opt out of 2022 IPL","link":"https://www.cairnspost.com.au/sport/cricket/big-star-names-opt-out-of-2022-ipl/video/75c473bf3700cfc669286990421f94c6","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket: A number of big name players have opted to miss this year's Indian Premier League including Mitchell Starc, Ben Stokes and Joe Root.","content":null,"pubDate":"2022-01-22 12:08:06","full_description":null,"image_url":null,"source_id":"cairnspost"},{"title":"Dwarshuis tries to save Sixers, slogs 66","link":"https://www.cairnspost.com.au/sport/cricket/dwarshuis-tries-to-save-sixers-slogs-66/video/db2bdbd4256bc270c240b5c9dec03555","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket: Ben Dwarshuis had an impressive batting performance against the Perth Scorchers, scoring 66 runs from just 29 balls in a late effort to bring the Sydney Sixers back into the game.","content":null,"pubDate":"2022-01-22 12:04:06","full_description":null,"image_url":null,"source_id":"cairnspost"},{"title":"South Africa vs India, 3rd ODI Predicted Playing XI: Wholesale changes for India in dead rubber? - India Today","link":"https://news.google.com/__i/rss/rd/articles/CBMipgFodHRwczovL3d3dy5pbmRpYXRvZGF5LmluL3Nwb3J0cy9jcmlja2V0L3N0b3J5L3NvdXRoLWFmcmljYS12cy1pbmRpYS0zcmQtb2RpLXByZWRpY3RlZC14aS1rbC1yYWh1bC1kZWVwYWstY2hhaGFyLWJodXZuZXNod2FyLWt1bWFyLXN1cnlha3VtYXIteWFkYXYtMTkwMzE5OS0yMDIyLTAxLTIy0gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"South Africa vs India, 3rd ODI Predicted Playing XI: Wholesale changes for India in dead rubber?  India TodaySouth Africa v India, 3rd ODI: Preview  CricbuzzIND vs SA: Twitter Reacts As South Africa Secure ODI Series With Victory In Second ODI vs India  Cricket AddictorMatch Preview - South Africa vs India, India in South Africa 2021/22, 3rd ODI  ESPNcricinfoIndia seek solutions to middle order woes in dead rubber, South Africa cricket | Cricbuzz.com - Cricbuzz  CricbuzzView Full coverage on Google News","content":null,"pubDate":"2022-01-22 11:55:17","image_url":null,"source_id":"google"},{"title":"Covid: IPL 2022 to be held in India without crowd, says report","link":"https://www.business-standard.com/article/news-ani/ipl-2022-to-be-held-in-india-without-crowd-bcci-sources-122012200793_1.html","keywords":null,"creator":null,"video_url":null,"description":"'Likely venues for IPL 2022 are Wankhede Stadium, Cricket Club of India (CCI), DY Patil Stadium in Mumbai and if needed, we can look at Pune as well,' says a BCCI source","content":null,"pubDate":"2022-01-22 11:40:00","full_description":"The Indian Premier League (IPL) 2022 season will be held in India itself, top sources in the Board of Control for Cricket in India (BCCI) confirmed. Sources in the know of developments confirmed to ANI that if the COVID-19 subsides in the country, then the board will go ahead with hosting the IPL 2022 in India. \" IPL 2022 will be held in India and the tournament will be staged without crowds in attendance. Likely venues for IPL 2022 are Wankhede Stadium, Cricket Club of India (CCI), DY Patil Stadium in Mumbai and if needed, we can look at Pune as well,\" the source said. The IPL player registration closed on January 20 and a total of 1,214 players (896 Indian and 318 overseas) have signed up to be part of the 2022 player auction. The two-day mega auction will see 10 teams bidding for some of the finest talents in world cricket. The players' list incorporates 270 capped, 903 uncapped, and 41 Associate players. The detailed list is as follows: Capped Indian (61 players), Capped International (209 players), Associate (41 players), Uncapped Indians who were a part of previous IPL seasons (143 players), Uncapped International who were a part of previous IPL seasons (6 players), Uncapped Indians (692 players), and Uncapped Internationals (62 players). The IPL auction is set to be held on February 12 and 13 in Bengaluru. (Only the headline and picture of this report may have been reworked by the Business Standard staff; the rest of the content is auto-generated from a syndicated feed.)","image_url":"https://bsmedia.business-standard.com/_media/bs/img/article/default/1220122/thumb-122012200793.jpg","source_id":"business-standard"}]}