{"newsArray":[{"title":"VIDEO: लसिथ मलिंगा का नया अवतार, गेंदबाजी छोड़ पियानो से जमाई महफिल, दिल हार गए फैंस","link":"https://hindi.news18.com/news/sports/cricket-rajasthan-royals-shared-video-of-lasith-malinga-playing-the-piano-5333013.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"मौजूदा समय में लसिथ मलिंगा आईपीएल फ्रेंचाइजी राजस्थान रॉयल्स के गेंदबाजी कोच हैं. आईपीएल के 16वें सीजन में भी वह राजस्थान के गेंदबाजों को धार देते हुए नजर आएंगे. आईपीएल 2023 के शुरू होने से पहले राजस्थान रॉयल्स ने उनका एक वीडियो साझा किया है. इस वीडियो में वह पियानो बजाते हुए नजर आ रहे हैं.","content":"लसिथ मलिंगा का नया अवतार. (AP) नई दिल्ली. श्रीलंकाई पूर्व दिग्गज तेज गेंदबाज लसिथ मलिंगा (Lasith Malinga) के बारे में कौन नहीं जानता है. उन्होंने अपने समय में दुनिया के सभी बल्लेबाजों को परेशान कर रखा था. मलिंगा की स्लोवर यॉर्कर का विपक्षी टीम के बल्लेबाजों के पास कोई तोड़ नहीं था. उन्होंने मैदान में अपनी उम्दा गेंदबाजी के बदौलत कई बड़े रिकॉर्ड अपने नाम किए. यही वजह है कि मौजूदा समय में वह कई युवा तेज गेंदबाजों के आइडल हैं. राजस्थान रॉयल्स के गेंदबाजी कोच हैं मलिंगा: मौजूदा समय में लसिथ मलिंगा आईपीएल फ्रेंचाइजी राजस्थान रॉयल्स (Rajasthan Royals) के गेंदबाजी कोच हैं. आईपीएल के 16वें सीजन में भी वह राजस्थान के गेंदबाजों को धार देते हुए नजर आएंगे. आईपीएल 2023 के शुरू होने से पहले राजस्थान रॉयल्स ने उनका एक वीडियो साझा किया है. इस वीडियो में वह पियानो बजाते हुए नजर आ रहे हैं. A post shared by Rajasthan Royals (@rajasthanroyals) यह भी पढ़ें- रोहित के चाहने वालों के लिए बड़ा झटका, भारतीय दिग्गज ने कहा- टी20 वर्ल्ड कप में नहीं मिलेगा मौका मलिंगा ने 2021 में क्रिकेट के सभी प्रारूपों से लिया संन्यास. इंटरनेशनल क्रिकेट में श्रीलंका के लिए 340 मुकाबलों में शिरकत करने वाले मलिंगा ने सितंबर 2021 में क्रिकेट के सभी प्रारूपों से संन्यास ले लिया. जिसके बाद आईपीएल के 15वें सीजन के लिए राजस्थान रॉयल्स की टीम ने उन्हें अपना गेंदबाजी कोच नियुक्त किया. आरआर का साल 2022 में प्रदर्शन बेहद शानदार रहा. टीम ने उम्दा प्रदर्शन करते हुए फाइनल तक का सफर तय किया था. मलिंगा का आईपीएल करियर: मलिंगा का आईपीएल में प्रदर्शन बेहद शानदार रहा. उन्होंने यहां 122 मुकाबले खेलते हुए 122 पारियों में 19.79 की औसत से 170 सफलता प्राप्त की. आईपीएल में उनके नाम एक बार पांच विकेट लेने का भी कारनामा है. ब्रेकिंग न्यूज़ हिंदी में सबसे पहले पढ़ें News18 हिंदी| आज की ताजा खबर, लाइव न्यूज अपडेट, पढ़ें सबसे विश्वसनीय हिंदी न्यूज़ वेबसाइट News18 हिंदी| Tags: Indian premier league , IPL , Lasith malinga , Rajasthan Royals IND vs AUS: ऑस्ट्रेलिया के लिए बुरा सपना हैं चेतेश्वर पुजारा, 1 कदम और सचिन हो जाएंगे पीछे, देखें आंकड़े चर्च के गलियारों में पनपा प्‍यार…शादी करते ही करियर ने पकड़ी रफ्तार…अब भारत को मात देने आया धाकड़ बल्‍लेबाज पाकिस्तान के क्रिकेटर ने कप्तान की बेटी से की शादी, दुनिया के कई खिलाड़ी हैं रिश्तेदार, कुछ का हुआ दर्दनाक अंत","pubDate":"2023-02-05 01:17:48","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/01/Lasith-Malinga-AP-16739681423x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Ranji Trophy: सेमीफाइनल की लाइनअप तय... इन चार टीमों ने बनाई अंतिम-4 में जगह.. जानिए कब किस टीम की कहां होगी भिड़ंत","link":"https://hindi.news18.com/news/sports/cricket-madhya-pradesh-vs-bengal-saurashtra-vs-karnataka-ranji-trophy-semi-final-line-up-when-and-where-to-watch-live-telecast-streaming-5332997.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"Ranji Trophy: रणजी ट्रॉफी सेमीफाइनल की 4 टीमें कंफर्म हो गई हैं. सौराष्ट्र ने पांचवें और आखिरी दिन पंजाब को 71 रन से हराकर अंतिम-4 का टिकट कटाया. सेमीफाइनल के मुकाबले 8 फरवरी से खेले जाएंगे. पहला सेमीफाइनल इंदौर में जबकि दूसरा बेंगलुरु में खेला जाएगा. दोनों मुकाबले सुबह 9:30 बजे से खेले जाएंगे.","content":"रणजी ट्रॉफी के सेमीफाइनल मुकाबले 8 फरवरी से खेले जाएंगे. (BCCI/Twitter) नई दिल्ली. सौराष्ट्र की टीम रणजी ट्रॉफी 2022-23 (Ranji Trophy 2022-23) के सेमीफाइनल में पहुंचने वाली चौथी टीम बन गई. दूसरे क्वार्टर फाइनल में सौराष्ट्र ने पंजाब को 71 रन से पटखनी देकर अंतिम-4 का टिकट कटाया. इससे पहले कर्नाटक, बंगाल और मध्यप्रदेश की टीमों ने सेमीफाइनल के लिए क्वालीफाई किया था. तीन नतीजे मैच के चौथे दिन ही आ गए थे जबकि चौथा रिजल्ट शनिवार को आया. बंगाल ने क्वार्टर फाइनल में झारखंड को 9 विकेट से रौंदा वहीं कर्नाटक ने उत्तराखंड को पारी और 281 रन से पराजित किया था. मध्यप्रदेश ने इंदौर में खेले गए क्वार्टर फाइनल मुकाबले में आंध्र प्रदेश को 5 विकेट से हराकर सेमीफाइनल का टिकट कटाया. पंजाब को पांचवें दिन शनिवार को जीत के लिए 200 रन की जरूरत थी और उसके 5 विकेट बचे थे. सौराष्ट्र की टीम ने 128 रन के भीतर उसके पांचों विकेट झटक लिए और मुकाबले को 71 रन से जीतकर शान से अंतिम 4 में पहुंचे. यह भी पढ़ें: वीरेंद्र सहवाग का डेब्यू मैच में गालियों से हुआ वेलकम… 5 साल बाद पाकिस्तानियों को दिया था मुंहतोड़ जवाब ब्रेकिंग न्यूज़ हिंदी में सबसे पहले पढ़ें News18 हिंदी| आज की ताजा खबर, लाइव न्यूज अपडेट, पढ़ें सबसे विश्वसनीय हिंदी न्यूज़ वेबसाइट News18 हिंदी| Tags: Bengal , Karnatka , Ranji cricket , Ranji Trophy IND vs AUS: ऑस्ट्रेलिया के लिए बुरा सपना हैं चेतेश्वर पुजारा, 1 कदम और सचिन हो जाएंगे पीछे, देखें आंकड़े चर्च के गलियारों में पनपा प्‍यार…शादी करते ही करियर ने पकड़ी रफ्तार…अब भारत को मात देने आया धाकड़ बल्‍लेबाज पाकिस्तान के क्रिकेटर ने कप्तान की बेटी से की शादी, दुनिया के कई खिलाड़ी हैं रिश्तेदार, कुछ का हुआ दर्दनाक अंत","pubDate":"2023-02-05 01:15:41","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/02/RANJI-1-16755594383x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"IND vs AUS: ऑस्ट्रेलिया के लिए बुरा सपना हैं चेतेश्वर पुजारा, 1 कदम और सचिन हो जाएंगे पीछे, देखें आंकड़े","link":"https://hindi.news18.com/photogallery/sports/cricket-cheteshwar-pujara-two-double-century-against-australia-equal-sachin-tendulkar-record-border-gavaskar-trophy-ind-vs-aus-5332145.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"टीम इंडिया के लिए 2023 काफी महत्वपूर्ण है और भारत ने इस साल की शुरुआत शानदार की. लेकिन अब ब्लू आर्मी पहली चुनौती के करीब पहुंच चुकी है. वर्ल्ड टेस्ट चैंपियनशिप फाइनल खेलने के लिए भारतीय टीम के बीच है ऑस्ट्रेलिया. बॉर्डर गावस्कर ट्रॉफी में महज 1 हफ्ते का समय बचा है. आईए एक ऐसे खिलाड़ी की बात करते हैं जो कंगारू टीम के लिए बुरा सपना बना हुआ है. जी हां, हम बात कर रहे हैं चेतेश्ववर पुजारा की जो टेस्ट के लिहाज से भारत की जान हैं.","content":"Loading... Loading... Loading... Loading... आईए देखते हैं ऐसे टॉप तीन खिलाड़ियों को जिन्होंने ऑस्ट्रेलिया के खिलाफ सबसे ज्यादा दोहरे शतक लगाए हैं. इन प्लेयर्स में सचिन तेंदुलकर, वीवीएस लक्ष्मण और चेतेश्वर पुजारा का नाम है. पुजारा के आंकड़ों से अंदाजा लगाया जा सकता है कि वह ऑस्ट्रेलिया के लिए एक बुरा सपना हैं. (AP) सबसे पहले बात करते हैं क्रिकेट के भगवान के नाम से मशहूर सचिन तेंदुलकर का. मास्टर ब्लास्टर ने ऑस्ट्रेलिया के खिलाफ टेस्ट में कुल दो दोहरे शतक लगाए हैं. उन्होंने पहली बार 241 रन की पारी खेली और दूसरी बार 214 रन बना दिए. (PTI) लिस्ट में दूसरा नाम पूर्व दिग्गज वीवीएस लक्ष्मण का है. उन्होंने एक बार ऑस्ट्रेलिया के खिलाफ 281 रन की विशालकाय पारी खेली. उसके बाद लक्ष्मण ने एक बार नाबाद दोहरा शतक जमा दिया था. (AFP) लक्ष्मण ने कई बार टीम इंडिया को अपनी बेशकीमती पारियों से जीत दिलाई है. एक बार एडिलेड टेस्ट के दौरान 148 रन की पारी से उन्होंने भारत को जीत दिलाई. इसके बाद इस खिलाड़ी ने ऑस्ट्रेलिया का गुरूर तोड़ दिया था. (VVS Laxman/Instagram) सचिन तेंदुलकर और वीवीएस लक्ष्मण को टेस्ट में जो जिम्मेदारी मिली, उन्होंने बखूबी निभाई. दोनों दिग्गज खिलाड़ियों ने टीम इंडिया को कई बड़े मुकाबलों में जीत दिलाई थी. लेकिन अब बात करते हैं मॉडर्न क्रिकेट की. (AFP) इस लिस्ट में हैं चेतेश्वर पुजारा का नाम, जो अभी भी टीम इंडिया का हिस्सा हैं. पुजारा के आंकड़े इस बात की गवाही दे रहे हैं कि वह ऑस्ट्रेलिया के खिलाफ कितने घातक साबित हो सकते हैं. इस टीम के खिलाफ उन्होंने दो दोहरे शतक लगाए ही, लेकिन कई बार मुश्किल समय में टीम के लिए अड़े रहे. (Cheteshwar Pujara/Instagram) साल 2013 में पुजारा कंगारुओं पर हावी हुए और उन्होंने 341 गेंद में 204 रन की पारी खेली थी. उसके बाद 2017 में फिर उन्होंने इस टीम को टारगेट कर लिया. उस दौरान पुजारा ने 525 गेंद में 202 रन की पारी खेली. (AP) उम्मीद है कि 9 फरवरी में शुरू होने वाली बॉर्डर गावस्कर ट्रॉफी के लिए पुजारा ने कुछ बड़ा प्लान किया होगा. हाल ही में उन्होंने प्रैक्टिस करते हुए कुछ फोटोज सोशल मीडिया पर शेयर की थीं. यदि इस सीरीज में पुजारा एक दोहरा शतक लगा देते हैं तो वह इस लिस्ट में सचिन तेंदुलकर को भी पछाड़ देंगे. (AP)","pubDate":"2023-02-05 01:00:55","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/02/cheteshwar-pujara-100-vs-ban1-16755070123x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"चर्च के गलियारों में पनपा प्‍यार…शादी करते ही करियर ने पकड़ी रफ्तार…अब भारत को मात देने आया धाकड़ बल्‍लेबाज","link":"https://hindi.news18.com/photogallery/sports/cricket-india-vs-asustralia-marnus-labuschagne-love-story-with-wife-rebekah-labuschagne-5332441.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"ऑस्‍ट्रेलियाई टीम भारत दौरे पर अपनी पूरी ताकत लगा देना चाहती है. ऐसा इसलिए क्‍योंकि बीते दो ऑस्‍ट्रेलिया दौरों पर भारत ने मेजबान देश को टेस्‍ट सीरीज में मात दी थी. इससे पहले कोई भी एशियाई देश ऑस्‍ट्रेलिया को उन्‍हीं की धरती पर टेस्‍ट सीरीज नहीं हरा पाया था.","content":"Loading... Loading... Loading... Loading... नई दिल्‍ली. ऑस्‍ट्रेलिया की टीम नागपुर टेस्‍ट की तैयारियों में जुटी है. बेंगलुरू में पैट कमिंस के नेतृत्‍व वाली टीम ने नेट सेशन बीते तीन दिनों से जारी है. चार मैचों की इस टेस्‍ट सीरीज को लेकर कंगारू फिलहाल अपनी स्पिन बैट्री को और धारदार बनाने में जुटे हैं. टीम के साथ उनका एक धाकड़ बैटर भी भारत आया हुआ है. (Marnus Labuschagne Instagram) इस बैटर की लव स्‍टोरी ब्रिसबेन की एक चर्च से शुरू हुई. वो चर्च में बचपन में ही अपनी होने वाली वाइफ से मिल चुका था. दोनों का प्‍यार चर्च के गलियारों में ही पनपा और परवान चढ़ा. अब इस कंगारू बैटर की शादी को 5 साल बीत गए हैं. (Marnus Labuschagne Instagram) हम बात कर रहे हैं ऑस्‍ट्रेलिया की टीम के टॉप ऑर्डर बैटर मार्नस लैबशेन की. 28 साल का ये बैटर ऑस्‍ट्रेलिया की टेस्‍ट टीम नंबर-3 पर खेलता है. इस फॉर्मेट में लैबुशेन की बैटिंग औसत ऐसी है कि विराट कोहली भी काफी पीछे नजर आते हैं. वो करीब 60 की औसत से टेस्‍ट क्रिकेट में रन बनाते हैं. (Rebekah Labuschagne/Instagram) मार्नस लैबुशेन की लव स्‍टोरी काफी इंट्रस्टिंग है. खबरों की मानें तो महज 17 साल की उम्र में लैबुशेन अपनी पत्‍नी रैबेका लैबुशेन से मिले थे. दोनों की मुलाकात ब्रिसबेन के रेडलैंड में स्थित गेटवे बेपटिस्‍ट चर्च में हुई. दोनों के ही परिवार इसी चर्च में प्रे करने के लिए आया करते थे. (Rebekah Labuschagne/Instagram) इसी चर्च में दोनों परिवारों की आपस में मुलाकात हुई और गहरी दोस्‍ती हो गई. ईसाई धर्म के उपदेशों की दोनों ही परिवारों में बहुत गहरी मान्‍यता है. रिपोर्ट्स के मुताबिक रैबेका भी काफी ज्‍यादा धार्मिक प्रवृति की महिला हैं. वो लो-प्रोफाइल रहना पसंद करती हैं.(Rebekah Labuschagne/Instagram) चर्च में मार्नस और रैबेका की मुलाकातें होती चली गई जो धीरे-धीरे प्‍यार में बदल गई. साल 2017 में लैबुशेन ने शादी के लिए रैबेका को प्रपोज किया. इसी साल दोनों शादी के बंधन में भी बंध गए. वो अपनी पत्‍नी को काफी लकी मानते हैं. (Rebekah Labuschagne/Instagram) साल 2017 में शादी के बाद क्‍वीन्‍सलैंड के लिए उनका प्रदर्शन काफी आला दर्जे का हो गया. जिसके बाद साल 2019 में उन्‍हें ऑस्‍ट्रेलिया की टीम में भी जगह मिल गई. मार्नस का करियर चमकने के बाद पत्‍नी रैबेका भी काफी सुर्खियों में आने लगी. हालांकि वो निजी तौर पर इन सब से दूर ही रहने का प्रयास करती हैं. (Rebekah Labuschagne/Instagram)","pubDate":"2023-02-05 00:45:38","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/02/Marnus-Labuschagne-Life-Partner-2-16755384223x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"ACC Meeting: एशिया कप के बाद चैंपियंस ट्रॉफी से भी हाथ धोएगा पाकिस्‍तान! जय शाह ने तैयार किया प्‍लान","link":"https://hindi.news18.com/news/sports/cricket-after-asia-cup-2023-hosting-bcci-will-take-away-2023-champions-trophy-hosting-5332251.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"एशिया कप (Asia Cup 2023) का आयोजन इस बार 50 ओवरों के फॉर्मेट में किया जाना है. पाकिस्‍तान उम्‍मीद जता रहा था कि एशिया कप का आयोजन उनके अपने देश में होगा लेकिन बीसीसीआई (BCCI vs PCB) के सामने पड़ोसी देश की एक नहीं चली. एसीसी मीटिंग से साफ हो गया है कि भारत पाकिस्‍तान में जाकर क्रिकेट नहीं खेलेगा.","content":"एशिया कप 2023 को होस्‍ट करने का अधिकार पीसीबी को मिला है. (Twitter/ICC) नई दिल्‍ली . एशिया कप (Asia Cup 2023) का होस्‍ट बनने की इच्‍छा पाले बैठे पाकिस्‍तान को बीसीसीआई ने करार झटका दिया है. बेहरनी में हुई एशियन क्रिकेट काउंसिल (Asian Cricket Council) की बैठक के दौरान बीसीसीआई (BCCI) ने पाकिस्‍तान क्रिकेट बोर्ड (PCB) को करार झटका दिया है. बीसीसीआई सचिव जय शाह (Jay Shah) की तरफ से पहले ही यह साफ कर दिया गया था कि भारत की टीम एशिया कप खेलने के लिए पाकिस्‍तान का दौरा नहीं करेगी. इस बात से भिन्‍नाए पाकिस्‍तान ने एशियन क्रिकेट काउंसिल से हटने की धमकी तक दे डाली थी. शनिवार को हुई एसीसी की ताजा बैठक के बाद अब एशिया कप ही नहीं बल्कि 2025 में पाकिस्‍तान में होने वाली चैंपियंस ट्रॉफी (Champions Trophy) के अस्तित्‍तव पर भी सवाल उठने लगे हैं. साल 2009 में पाकिस्‍तान की धरती पर श्रीलंका की टीम पर हुए आतंकी हमले के बाद करीब डेढ़ दशक तक पड़ोसी देश में अंतरराष्‍ट्रीय क्रिकेट प्रभावित रहा. धीरे-धीरे एक-एक कर अब सभी टीमें पाकिस्‍तान का दौर कर चुकी हैं. केवल भारत ही इकलौता ऐसा देश है जिसने पाकिस्‍तान का दौरा नहीं किया है. भारत और पाकिस्‍तान के बीच मौजूदा संबंधों को देखते हुए बीसीसीआई ने पाकिस्‍तान जानें से इनकार कर दिया. न्‍यूज एजेंसी पीटीआई की खबर के मुताबिक एसीसी की मीटिंग में यह साफ हो गया है कि पाकिस्‍तान एशिया कप का आयोजन नहीं करेगा. नए वेन्‍यू को लेकर अभी स्थिति स्‍पष्‍ट नहीं है. माना जा रहा है कि यूएई या फिर श्रीलंका में एशिया कप का आयोजन हो सकता है. Border Gavaskar Trophy में कौन है सबसे कंजूस गेंदबाज? बल्‍लेबाजों को नहीं बनाने देता रन…देखें टॉप-10 लिस्‍ट Shaheen Afridi Wedding : निकाह के बाद रोमांटिक हुए पाक पेसर….बेगम संग खिंचवाई इंटीमेंट तस्‍वीरें…आपने देखी क्‍या? चैंपियंस ट्रॉफी से भी हाथ धोएगा पाकिस्‍तान! आईसीसी ने साल 2025 में होने वाली चैंपियंस ट्रॉफी को होस्‍ट करने का अधिकार पाकिस्‍तान को दिया है. एसीसी में पाकिस्‍तान की हेकड़ी निकालने के बाद अब जय शाह आईसीसी के सामने भी पड़ोसी देश के क्रिकेट बोर्ड को चारो खाने चित कर देंगे. बीसीसीआई सचिव ने इसे लेकर प्‍लान भी बना लिया है. ऐसा होना ज्‍यादा मुश्किल नजर नहीं आता. बीसीसीआई दुनिया का सबसे अमीर क्रिकेट बोर्ड है. भारतीय टीम जहां जाकर खेलती है वहीं स्‍पॉन्‍सर्स की लाइन लग जाती है. भले ही अन्‍य सभी देश पाकिस्‍तान का दौरा कर चुके हों लेकिन अगर एक बार बीसीसीआई ने आईसीसी में अपनी ताकत दिखाई तो पड़ोसी देश से चैंपियंस ट्रॉफी छिनना भी तय है. हालांकि चैंपियंस ट्रॉफी के आयोजन में अभी दो साल का वक्‍त है. ब्रेकिंग न्यूज़ हिंदी में सबसे पहले पढ़ें News18 हिंदी| आज की ताजा खबर, लाइव न्यूज अपडेट, पढ़ें सबसे विश्वसनीय हिंदी न्यूज़ वेबसाइट News18 हिंदी| Tags: Asia cup , BCCI , ICC , IND vs PAK , India Vs Pakistan , Pcb चर्च के गलियारों में पनपा प्‍यार…शादी करते ही करियर ने पकड़ी रफ्तार…अब भारत को मात देने आया धाकड़ बल्‍लेबाज पाकिस्तान के क्रिकेटर ने कप्तान की बेटी से की शादी, दुनिया के कई खिलाड़ी हैं रिश्तेदार, कुछ का हुआ दर्दनाक अंत अमेरिका में आर्कटिक ब्लास्ट से हालात बदतर, -79 डिग्री ठंड से लॉकडाउन जैसी स्थिति, स्कूल बंद","pubDate":"2023-02-05 00:30:48","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/02/BCCI-vs-PCB-16755311483x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Pakistan cricket legend Wasim Akram ‘looking forward’ to launching Saudi cricket league","link":"https://www.arabnews.com/node/2244751/sport","keywords":null,"creator":["bassam.zaazaa"],"video_url":null,"description":"Sat, 2023-02-04 21:14 ISLAMABAD: Former Pakistan cricket captain Wasim Akram has said he is “looking forward” to launching a cricket league in Saudi Arabia following his trip to Riyadh this week. The Pakistani pacer issued the statement after meeting Saudi Arabian Cricket Federation Chairman Prince Saud bin Mishal to discuss the future of the sport in the Kingdom. Akram’s visit follows a recent strengthening of cricket ties between the two countries.Main category: SportCricket","content":"ISLAMABAD: Former Pakistan cricket captain Wasim Akram has said he is “looking forward” to launching a cricket league in Saudi Arabia following his trip to Riyadh this week. The Pakistani pacer issued the statement after meeting Saudi Arabian Cricket Federation Chairman Prince Saud bin Mishal to discuss the future of the sport in the Kingdom. Akram’s visit follows a recent strengthening of cricket ties between the two countries. Last month, Javed Afridi, who owns Pakistan Super League franchise Peshawar Zalmi, announced that his team will play exhibition matches in Saudi Arabia. Pakistan Cricket Board Chairman Najam Sethi also said last month that the South Asian country is willing to share its expertise in the sport with the Kingdom, where cricket’s popularity is growing rapidly. “What a trip to Riyadh,” Akram wrote in a Facebook post this week. “Had a great meeting with H.H. Saud (bin) Mishal, talked about cricket in Saudi Arabia, and so looking forward to (starting) a Saudi league insha Allah very soon.” Pakistan and Saudi Arabia have strong economic, defense and cultural ties. Last month, Pakistan women’s football team were runners-up in a four-nation tournament in the Kingdom. Since its establishment in 2020, the Saudi Arabian Cricket Federation has launched a series of major initiatives, including a national championship, a corporate tournament, a league for expatriate workers, and social programs in several cities. The ruling body oversees 15 official associations representing the sport in nine regions, and has announced plans to set up additional associations in the remaining regions to ensure cricket is played across the Kingdom.","pubDate":"2023-02-04 18:17:14","image_url":null,"source_id":"arabnews","category":["sports"],"country":["saudi arabia"],"language":"english"},{"title":"Pakistan unlikely to host Asia Cup, venue to be finalised in March","link":"https://www.dnaindia.com/cricket/report-pakistan-unlikely-to-host-asia-cup-venue-to-be-finalised-in-march-2023-3021527","keywords":["Sports","Cricket"],"creator":["DNA Web Team"],"video_url":null,"description":"The Asia Cup was initially allotted to Pakistan and was scheduled in September this year but ACC chairman Jay Shah had announced last October that India will not travel to Pakistan due diplomatic tension between the two nations.","content":"New Delhi: The Asian Cricket Council (ACC) is expected to shift Asia Cup from Pakistan and decide on an alternate venue in March as BCCI secretary Jay Shah and PCB chairman Najam Sethi discussed the issue during a formal meeting in Bahrain on Saturday. All heads of ACC member nations attended the emergent meeting which was called at the behest of Sethi after the continental body released its itinerary and Pakistan wasn't named the hosts for the Asia Cup. The Asia Cup was initially allotted to Pakistan and was scheduled in September this year but Shah, who is also the ACC chairman, had announced last October that India will not travel to Pakistan due diplomatic tension between the two nations. \"The ACC had a constructive dialogue on the upcoming Asia Cup 2023. The Board agreed to continue discussions on operations, timelines and any other specifics with a view to ensure the success of the tournament. An update on the matter would be taken on the next ACC Executive Board Meeting to be held in March 2023,\" ACC said in a statement. While a decision will come only next month, a senior BCCI official privy to the development told PTI that it is highly unlikely that Pakistan will host the tournament. \"With India deciding against travelling to Pakistan, the tournament will have to be shifted. A tournament without Virat Kohli, Rohit Sharma and Shubman Gill will have the sponsors back out,\" the official said. One ACC insider said Sethi has just taken over PCB and if he had ceded ground on the hosting rights in the first meeting itself, then it would have led to a bad impression at home. Pakistan is currently going through an economic crisis. The inflation has hit the country very hard as one USD is now equal to 277 Pakistani Rupee. Organising a high-profile tournament like Asia Cup, even if ACC pays a grant could burn a hole in PCB coffers. So strategically, if the tournament is held in the UAE, there is every possibility that all the member nations will also get to earn apart from the broadcast revenues. In another decision, the ACC has decided to increase the annual budget allocated for Afghanistan Cricket Association to 15 percent from six. The ACC has assured that it will help the Afghanistan board in all possible ways so that women's cricket can be revived in the country. Women are banned from playing sport under Taliban rule. The Executive Board also approved of the inclusion of teams from Japan and Indonesia in the ACC pathway tournaments to participate in the events as invitees.","pubDate":"2023-02-04 18:16:00","image_url":null,"source_id":"dnaindia","category":["sports"],"country":["india"],"language":"english"},{"title":"Harmanpreet keen to not let WPL buzz affect preparation for India vs Pakistan clash","link":"https://www.indiatoday.in/sports/cricket/story/womens-t20-world-cup-2023-harmanpreet-kaur-doesnt-want-focus-to-shift-from-india-pakistan-clash-amid-wpl-buzz-2330555-2023-02-04?utm_source=rss","keywords":null,"creator":null,"video_url":null,"description":"Harmanpreet keen to not let WPL buzz affect preparation for India vs Pakistan clash","content":": Skipper said that it’s necessary not to get carried away by the buzz surrounding the Women’s Premier League (WPL) auction amid India’s preparations for the upcoming Women’s T20 World Cup in South Africa. If reports are to be believed, the auction for the inaugural edition of the WPL is scheduled to take place on February 14. But prior to that, the Indian players will take part in an all-important World Cup match against Pakistan on February 12 at the Newlands in Cape Town. Harmanpreet, who is the only centurion in T20Is among Indian women’s cricketers, said that India are currently focussed on their match against Pakistan. \"Before that [the auction], we have a very important game and we are just going to focus on that,\" Harmanpreet was quoted as saying at the T20 World Cup captains' pressers. While welcoming the idea of the WPL, Harmanpreet said how the Women’s Big Bash League (WBBL) and the Women’s Hundred contributed to the growth of Australian and English cricket. \"It's a really big day for all of us because we have been waiting for years and years now. The next two or three months are very important for women's cricket. We have seen how the WBBL and the Hundred have helped their countries improve their cricket. Hopefully, the same will happen for our country,\" she stated. Harmanpreet also talked about her experience of plying her trade in the Kia Super League, WBBL and Women’s Hundred over the years. \"That is something which has a very different feeling. When I got that opportunity, it was the biggest life-changing moment. Other girls will also experience this. It will be a great opportunity to improve cricket and grow the game,\" Harmanpreet said. \"The World Cup is more important than anything else. Our focus is on the ICC trophy. These things will keep coming, and as a player, you know what's important for you and how you need to keep your focus. We are all mature enough and know what is important for us,\" she stated. Before the World Cup, India are also scheduled to lock horns with Meg Lanning’s Australia and Nigar Sultana Joty’s Bangladesh in two warm-up matches on February 6 and 8 respectively. India played the World Cup final last time around in 2020, but lost to Australia at the iconic Melbourne Cricket Ground (MCG).","pubDate":"2023-02-04 17:59:28","image_url":null,"source_id":"indiatoday","category":["sports"],"country":["india"],"language":"english"},{"title":"IND vs AUS Test Series: ऑस्ट्रेलिया के अभ्यास मैच नहीं खेलने के फैसले पर पूर्व भारतीय स्टार ने जताई हैरानी","link":"https://sports.ndtv.com/hindi/cricket/suresh-raina-surprised-by-australias-decision-not-to-play-warm-up-match-before-test-series-ndtv-hindi-ndtv-india-3753952#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"IND vs AUS Test: पूर्व भारतीय बल्लेबाज सुरेश रैना (Suresh Raina) को भरोसा है कि भारत चार टेस्ट मैचों की सीरीज में अच्छा प्रदर्शन करेगा और रविंद्र जडेजा (Ravindra Jadeja) की वापसी टीम में अच्छा संतुलन लाएगी.","content":"Australia Test Team पूर्व भारतीय बल्लेबाज सुरेश रैना (Suresh Raina) नौ फरवरी से नागपुर में शुरू हो रही बॉर्डर गावस्कर ट्रॉफी (Border Gavaskar Trophy) से पहले ऑस्ट्रेलियाई टीम के अभ्यास मैचों में खेलने के बजाय परिस्थितिजन्य अभ्यास करने के फैसले से काफी हैरान हैं. ऑस्ट्रेलियाई टीम इस समय बेंगलुरु में ट्रेनिंग कर रही है और उछाल लेती पिचों पर अभ्यास कर रही है और बड़ौदा के स्पिनर महेश पिथिया को गेंदबाजी के लिए बुलाया गया है जिनका गेंदबाजी एक्शन रविचंद्रन अश्विन (Ravichandran Ashwin) से मिलता है. लेकिन भारत के सफेद गेंद के बेहतरीन खिलाड़ियों में से एक रैना को लगता है कि ऑस्ट्रेलियाई टीम को इसकी कमी खलेगी. रैना ने 'पुलिस परिवार कल्याण सोसाइटी' द्वारा आयोजित 'मिशन ओलंपिक्स' सालाना दिवस मुलाकात के मौके पर कहा, \"मैंने टेस्ट से पहले अभ्यास मैच खेले हैं और ये सचमुच महत्वपूर्ण हैं. वे (ऑस्ट्रेलिया) भारत की पिचों को उन पर खेलकर ही समझ सकते हैं.\" रैना को भरोसा है कि भारत चार टेस्ट मैचों की सीरीज (IND vs AUS Test Series) में अच्छा प्रदर्शन करेगा और रविंद्र जडेजा (Ravindra Jadeja) की वापसी टीम में अच्छा संतुलन लाएगी. उन्होंने कहा, \"मैं लंबे समय के बाद जडेजा की वापसी से खुश हूं.\" रैना ने कहा, \"हमारे स्पिनर आर अश्विन, अक्षर पटेल अच्छा कर रहे हैं. विराट कोहली और रोहित शर्मा अच्छी फॉर्म में हैं और मुझे लगता है कि हमें एक अच्छी श्रृंखला देखने को मिलेगी.\" * * * पढ़ें , , राजनीति, देश और दुनिया की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-02-04 17:55:58","image_url":"https://c.ndtvimg.com/2022-07/l7hl4ct8_australia-cricket-team-afp_625x300_01_July_22.jpg?im=FitAndFill,algorithm=dnn,width=806,height=605","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"फाइनल में पर्थ स्कॉचर्स ने ब्रिस्बेन हीट को 5 विकेट से रौंदा, पांचवी बार टीम बनी चैंपियन","link":"https://navbharattimes.indiatimes.com/sports/cricket/cricket-news/bbl-perth-scorchers-beat-brisbane-heat-by-5-wickets-in-the-final-became-champions-for-the-fifth-time/articleshow/97609188.cms","keywords":null,"creator":null,"video_url":null,"description":"BBL Final: बिग बैश लीग 2022-23 के फाइनल में पर्थ स्कॉचर्स ने ब्रिस्बेन हीट को 5 विकेट से हराकर खिताब को अपने नाम कर लिया है। पर्थ की टीम पांचवीं बार लीग की चैंपियन बनी है। दोनों टीमों के बीच यह मुकाबला पर्थ में खेला गया था और टक्कर कांटे की हुई थी।","content":"बिग बैश लीग 2022-23 के फाइनल मुकाबले में पर्थ स्कॉचर्स ने ब्रिस्बेन हीट को 5 विकेट से हरा दिया। इसके साथ ही पर्थ की टीम ने लीग में पांचवी बार चैंपियन बनने का गौरव हासिल किया है। इस मुकाबले में ब्रिस्बेन ने पहले बल्लेबाजी करते हुए निर्धारित 20 ओवर के खेल में 7 विकेट के नुकसान पर 175 रन बनाए थे। इसके जवाब में पर्थ की टीम ने 19.2 ओवर में 178 रन बनाकर मैच को जीत लिया। पर्थ की इस जीत में कप्तान एश्टन टर्नर ने 53 रनों की विस्फोटक अर्धशतकीय पारी खेली। उन्होंने 32 गेंदों का सामना किया जिसमें 5 चौके और दो छक्के लगाए। इसके अलावा जोश इंगलिश ने 26 और कूपर कोलनी ने आखिरी में 25 रनों की महत्वपूर्ण पारी खेली। हालांकि पर्थ जब लक्ष्य का पीछा करने उतरी थी तो उसकी शुरुआत कुछ खास नहीं रही थी। टीम ने अपना पहला सिर्फ 32 रन के स्कोर गंवा दिया था। ओपनर बल्लेबाज स्टीफन स्केनाजी सिर्फ 21 रन बनाकर आउट हुए जबकि कैमरून बैनक्रॉफ्ट सिर्फ 15 रन का योगदान दे सके। हालांकि कप्तान एश्टन टर्नर ने एक छोर से पारी को संभाले रखा को टीम को जीत की दहलीज पर पहुंचा दिया। फाइनल मैच में पहले बल्लेबाजी करने उतरे ब्रिस्बेन हीट के ओपनर बल्लेबाज उम्मीद के मुताबिक टीम को शुरुआत नहीं दिला सके। ब्रिस्बेन ने सिर्फ 25 रन के स्कोर अपना पहला विकेट गंवा दिया। सैम हेजलेट ने जरूर पारी को संभाला और 34 रन बनाकर आउट हुए। इसके अलावा तीसरे नंबर पर बल्लेबाजी करने उतरे नाथन मैकस्वीनी ने 37 गेंद में 41 रनों की पारी खेली। मध्यक्रम में मैक्स ब्रायंट ने भी 31 रनों महत्वपूर्ण पारी खेली जबकि सैम हेन ने 16 गेंद में 21 रनों का योगदान दिया। पहले गेंदबाजी के लिए मैदान पर उतरी पर्थ के लिए जेसन बेहरनडॉर्फ और मैथ्यू केली ने दो-दो विकेट अपने नाम किए। इसके अलावा डेविड पायने, एरोन हार्डी और एंड्रयू टाय को भी एक-एक सफलता हासिल हुई थी।","pubDate":"2023-02-04 17:22:43","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"VIDEO: लसिथ मलिंगा का नया अवतार, गेंदबाजी छोड़ पियानो से जमाई महफिल, दिल हार गए फैंस","link":"https://hindi.news18.com/news/sports/cricket-rajasthan-royals-shared-video-of-lasith-malinga-playing-the-piano-5333013.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"मौजूदा समय में लसिथ मलिंगा आईपीएल फ्रेंचाइजी राजस्थान रॉयल्स के गेंदबाजी कोच हैं. आईपीएल के 16वें सीजन में भी वह राजस्थान के गेंदबाजों को धार देते हुए नजर आएंगे. आईपीएल 2023 के शुरू होने से पहले राजस्थान रॉयल्स ने उनका एक वीडियो साझा किया है. इस वीडियो में वह पियानो बजाते हुए नजर आ रहे हैं.","content":"लसिथ मलिंगा का नया अवतार. (AP) नई दिल्ली. श्रीलंकाई पूर्व दिग्गज तेज गेंदबाज लसिथ मलिंगा (Lasith Malinga) के बारे में कौन नहीं जानता है. उन्होंने अपने समय में दुनिया के सभी बल्लेबाजों को परेशान कर रखा था. मलिंगा की स्लोवर यॉर्कर का विपक्षी टीम के बल्लेबाजों के पास कोई तोड़ नहीं था. उन्होंने मैदान में अपनी उम्दा गेंदबाजी के बदौलत कई बड़े रिकॉर्ड अपने नाम किए. यही वजह है कि मौजूदा समय में वह कई युवा तेज गेंदबाजों के आइडल हैं. राजस्थान रॉयल्स के गेंदबाजी कोच हैं मलिंगा: मौजूदा समय में लसिथ मलिंगा आईपीएल फ्रेंचाइजी राजस्थान रॉयल्स (Rajasthan Royals) के गेंदबाजी कोच हैं. आईपीएल के 16वें सीजन में भी वह राजस्थान के गेंदबाजों को धार देते हुए नजर आएंगे. आईपीएल 2023 के शुरू होने से पहले राजस्थान रॉयल्स ने उनका एक वीडियो साझा किया है. इस वीडियो में वह पियानो बजाते हुए नजर आ रहे हैं. A post shared by Rajasthan Royals (@rajasthanroyals) यह भी पढ़ें- रोहित के चाहने वालों के लिए बड़ा झटका, भारतीय दिग्गज ने कहा- टी20 वर्ल्ड कप में नहीं मिलेगा मौका मलिंगा ने 2021 में क्रिकेट के सभी प्रारूपों से लिया संन्यास. इंटरनेशनल क्रिकेट में श्रीलंका के लिए 340 मुकाबलों में शिरकत करने वाले मलिंगा ने सितंबर 2021 में क्रिकेट के सभी प्रारूपों से संन्यास ले लिया. जिसके बाद आईपीएल के 15वें सीजन के लिए राजस्थान रॉयल्स की टीम ने उन्हें अपना गेंदबाजी कोच नियुक्त किया. आरआर का साल 2022 में प्रदर्शन बेहद शानदार रहा. टीम ने उम्दा प्रदर्शन करते हुए फाइनल तक का सफर तय किया था. मलिंगा का आईपीएल करियर: मलिंगा का आईपीएल में प्रदर्शन बेहद शानदार रहा. उन्होंने यहां 122 मुकाबले खेलते हुए 122 पारियों में 19.79 की औसत से 170 सफलता प्राप्त की. आईपीएल में उनके नाम एक बार पांच विकेट लेने का भी कारनामा है. ब्रेकिंग न्यूज़ हिंदी में सबसे पहले पढ़ें News18 हिंदी| आज की ताजा खबर, लाइव न्यूज अपडेट, पढ़ें सबसे विश्वसनीय हिंदी न्यूज़ वेबसाइट News18 हिंदी| Tags: Indian premier league , IPL , Lasith malinga , Rajasthan Royals IND vs AUS: ऑस्ट्रेलिया के लिए बुरा सपना हैं चेतेश्वर पुजारा, 1 कदम और सचिन हो जाएंगे पीछे, देखें आंकड़े चर्च के गलियारों में पनपा प्‍यार…शादी करते ही करियर ने पकड़ी रफ्तार…अब भारत को मात देने आया धाकड़ बल्‍लेबाज पाकिस्तान के क्रिकेटर ने कप्तान की बेटी से की शादी, दुनिया के कई खिलाड़ी हैं रिश्तेदार, कुछ का हुआ दर्दनाक अंत","pubDate":"2023-02-05 01:17:48","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/01/Lasith-Malinga-AP-16739681423x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Ranji Trophy: सेमीफाइनल की लाइनअप तय... इन चार टीमों ने बनाई अंतिम-4 में जगह.. जानिए कब किस टीम की कहां होगी भिड़ंत","link":"https://hindi.news18.com/news/sports/cricket-madhya-pradesh-vs-bengal-saurashtra-vs-karnataka-ranji-trophy-semi-final-line-up-when-and-where-to-watch-live-telecast-streaming-5332997.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"Ranji Trophy: रणजी ट्रॉफी सेमीफाइनल की 4 टीमें कंफर्म हो गई हैं. सौराष्ट्र ने पांचवें और आखिरी दिन पंजाब को 71 रन से हराकर अंतिम-4 का टिकट कटाया. सेमीफाइनल के मुकाबले 8 फरवरी से खेले जाएंगे. पहला सेमीफाइनल इंदौर में जबकि दूसरा बेंगलुरु में खेला जाएगा. दोनों मुकाबले सुबह 9:30 बजे से खेले जाएंगे.","content":"रणजी ट्रॉफी के सेमीफाइनल मुकाबले 8 फरवरी से खेले जाएंगे. (BCCI/Twitter) नई दिल्ली. सौराष्ट्र की टीम रणजी ट्रॉफी 2022-23 (Ranji Trophy 2022-23) के सेमीफाइनल में पहुंचने वाली चौथी टीम बन गई. दूसरे क्वार्टर फाइनल में सौराष्ट्र ने पंजाब को 71 रन से पटखनी देकर अंतिम-4 का टिकट कटाया. इससे पहले कर्नाटक, बंगाल और मध्यप्रदेश की टीमों ने सेमीफाइनल के लिए क्वालीफाई किया था. तीन नतीजे मैच के चौथे दिन ही आ गए थे जबकि चौथा रिजल्ट शनिवार को आया. बंगाल ने क्वार्टर फाइनल में झारखंड को 9 विकेट से रौंदा वहीं कर्नाटक ने उत्तराखंड को पारी और 281 रन से पराजित किया था. मध्यप्रदेश ने इंदौर में खेले गए क्वार्टर फाइनल मुकाबले में आंध्र प्रदेश को 5 विकेट से हराकर सेमीफाइनल का टिकट कटाया. पंजाब को पांचवें दिन शनिवार को जीत के लिए 200 रन की जरूरत थी और उसके 5 विकेट बचे थे. सौराष्ट्र की टीम ने 128 रन के भीतर उसके पांचों विकेट झटक लिए और मुकाबले को 71 रन से जीतकर शान से अंतिम 4 में पहुंचे. यह भी पढ़ें: वीरेंद्र सहवाग का डेब्यू मैच में गालियों से हुआ वेलकम… 5 साल बाद पाकिस्तानियों को दिया था मुंहतोड़ जवाब ब्रेकिंग न्यूज़ हिंदी में सबसे पहले पढ़ें News18 हिंदी| आज की ताजा खबर, लाइव न्यूज अपडेट, पढ़ें सबसे विश्वसनीय हिंदी न्यूज़ वेबसाइट News18 हिंदी| Tags: Bengal , Karnatka , Ranji cricket , Ranji Trophy IND vs AUS: ऑस्ट्रेलिया के लिए बुरा सपना हैं चेतेश्वर पुजारा, 1 कदम और सचिन हो जाएंगे पीछे, देखें आंकड़े चर्च के गलियारों में पनपा प्‍यार…शादी करते ही करियर ने पकड़ी रफ्तार…अब भारत को मात देने आया धाकड़ बल्‍लेबाज पाकिस्तान के क्रिकेटर ने कप्तान की बेटी से की शादी, दुनिया के कई खिलाड़ी हैं रिश्तेदार, कुछ का हुआ दर्दनाक अंत","pubDate":"2023-02-05 01:15:41","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/02/RANJI-1-16755594383x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"IND vs AUS: ऑस्ट्रेलिया के लिए बुरा सपना हैं चेतेश्वर पुजारा, 1 कदम और सचिन हो जाएंगे पीछे, देखें आंकड़े","link":"https://hindi.news18.com/photogallery/sports/cricket-cheteshwar-pujara-two-double-century-against-australia-equal-sachin-tendulkar-record-border-gavaskar-trophy-ind-vs-aus-5332145.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"टीम इंडिया के लिए 2023 काफी महत्वपूर्ण है और भारत ने इस साल की शुरुआत शानदार की. लेकिन अब ब्लू आर्मी पहली चुनौती के करीब पहुंच चुकी है. वर्ल्ड टेस्ट चैंपियनशिप फाइनल खेलने के लिए भारतीय टीम के बीच है ऑस्ट्रेलिया. बॉर्डर गावस्कर ट्रॉफी में महज 1 हफ्ते का समय बचा है. आईए एक ऐसे खिलाड़ी की बात करते हैं जो कंगारू टीम के लिए बुरा सपना बना हुआ है. जी हां, हम बात कर रहे हैं चेतेश्ववर पुजारा की जो टेस्ट के लिहाज से भारत की जान हैं.","content":"Loading... Loading... Loading... Loading... आईए देखते हैं ऐसे टॉप तीन खिलाड़ियों को जिन्होंने ऑस्ट्रेलिया के खिलाफ सबसे ज्यादा दोहरे शतक लगाए हैं. इन प्लेयर्स में सचिन तेंदुलकर, वीवीएस लक्ष्मण और चेतेश्वर पुजारा का नाम है. पुजारा के आंकड़ों से अंदाजा लगाया जा सकता है कि वह ऑस्ट्रेलिया के लिए एक बुरा सपना हैं. (AP) सबसे पहले बात करते हैं क्रिकेट के भगवान के नाम से मशहूर सचिन तेंदुलकर का. मास्टर ब्लास्टर ने ऑस्ट्रेलिया के खिलाफ टेस्ट में कुल दो दोहरे शतक लगाए हैं. उन्होंने पहली बार 241 रन की पारी खेली और दूसरी बार 214 रन बना दिए. (PTI) लिस्ट में दूसरा नाम पूर्व दिग्गज वीवीएस लक्ष्मण का है. उन्होंने एक बार ऑस्ट्रेलिया के खिलाफ 281 रन की विशालकाय पारी खेली. उसके बाद लक्ष्मण ने एक बार नाबाद दोहरा शतक जमा दिया था. (AFP) लक्ष्मण ने कई बार टीम इंडिया को अपनी बेशकीमती पारियों से जीत दिलाई है. एक बार एडिलेड टेस्ट के दौरान 148 रन की पारी से उन्होंने भारत को जीत दिलाई. इसके बाद इस खिलाड़ी ने ऑस्ट्रेलिया का गुरूर तोड़ दिया था. (VVS Laxman/Instagram) सचिन तेंदुलकर और वीवीएस लक्ष्मण को टेस्ट में जो जिम्मेदारी मिली, उन्होंने बखूबी निभाई. दोनों दिग्गज खिलाड़ियों ने टीम इंडिया को कई बड़े मुकाबलों में जीत दिलाई थी. लेकिन अब बात करते हैं मॉडर्न क्रिकेट की. (AFP) इस लिस्ट में हैं चेतेश्वर पुजारा का नाम, जो अभी भी टीम इंडिया का हिस्सा हैं. पुजारा के आंकड़े इस बात की गवाही दे रहे हैं कि वह ऑस्ट्रेलिया के खिलाफ कितने घातक साबित हो सकते हैं. इस टीम के खिलाफ उन्होंने दो दोहरे शतक लगाए ही, लेकिन कई बार मुश्किल समय में टीम के लिए अड़े रहे. (Cheteshwar Pujara/Instagram) साल 2013 में पुजारा कंगारुओं पर हावी हुए और उन्होंने 341 गेंद में 204 रन की पारी खेली थी. उसके बाद 2017 में फिर उन्होंने इस टीम को टारगेट कर लिया. उस दौरान पुजारा ने 525 गेंद में 202 रन की पारी खेली. (AP) उम्मीद है कि 9 फरवरी में शुरू होने वाली बॉर्डर गावस्कर ट्रॉफी के लिए पुजारा ने कुछ बड़ा प्लान किया होगा. हाल ही में उन्होंने प्रैक्टिस करते हुए कुछ फोटोज सोशल मीडिया पर शेयर की थीं. यदि इस सीरीज में पुजारा एक दोहरा शतक लगा देते हैं तो वह इस लिस्ट में सचिन तेंदुलकर को भी पछाड़ देंगे. (AP)","pubDate":"2023-02-05 01:00:55","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/02/cheteshwar-pujara-100-vs-ban1-16755070123x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"चर्च के गलियारों में पनपा प्‍यार…शादी करते ही करियर ने पकड़ी रफ्तार…अब भारत को मात देने आया धाकड़ बल्‍लेबाज","link":"https://hindi.news18.com/photogallery/sports/cricket-india-vs-asustralia-marnus-labuschagne-love-story-with-wife-rebekah-labuschagne-5332441.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"ऑस्‍ट्रेलियाई टीम भारत दौरे पर अपनी पूरी ताकत लगा देना चाहती है. ऐसा इसलिए क्‍योंकि बीते दो ऑस्‍ट्रेलिया दौरों पर भारत ने मेजबान देश को टेस्‍ट सीरीज में मात दी थी. इससे पहले कोई भी एशियाई देश ऑस्‍ट्रेलिया को उन्‍हीं की धरती पर टेस्‍ट सीरीज नहीं हरा पाया था.","content":"Loading... Loading... Loading... Loading... नई दिल्‍ली. ऑस्‍ट्रेलिया की टीम नागपुर टेस्‍ट की तैयारियों में जुटी है. बेंगलुरू में पैट कमिंस के नेतृत्‍व वाली टीम ने नेट सेशन बीते तीन दिनों से जारी है. चार मैचों की इस टेस्‍ट सीरीज को लेकर कंगारू फिलहाल अपनी स्पिन बैट्री को और धारदार बनाने में जुटे हैं. टीम के साथ उनका एक धाकड़ बैटर भी भारत आया हुआ है. (Marnus Labuschagne Instagram) इस बैटर की लव स्‍टोरी ब्रिसबेन की एक चर्च से शुरू हुई. वो चर्च में बचपन में ही अपनी होने वाली वाइफ से मिल चुका था. दोनों का प्‍यार चर्च के गलियारों में ही पनपा और परवान चढ़ा. अब इस कंगारू बैटर की शादी को 5 साल बीत गए हैं. (Marnus Labuschagne Instagram) हम बात कर रहे हैं ऑस्‍ट्रेलिया की टीम के टॉप ऑर्डर बैटर मार्नस लैबशेन की. 28 साल का ये बैटर ऑस्‍ट्रेलिया की टेस्‍ट टीम नंबर-3 पर खेलता है. इस फॉर्मेट में लैबुशेन की बैटिंग औसत ऐसी है कि विराट कोहली भी काफी पीछे नजर आते हैं. वो करीब 60 की औसत से टेस्‍ट क्रिकेट में रन बनाते हैं. (Rebekah Labuschagne/Instagram) मार्नस लैबुशेन की लव स्‍टोरी काफी इंट्रस्टिंग है. खबरों की मानें तो महज 17 साल की उम्र में लैबुशेन अपनी पत्‍नी रैबेका लैबुशेन से मिले थे. दोनों की मुलाकात ब्रिसबेन के रेडलैंड में स्थित गेटवे बेपटिस्‍ट चर्च में हुई. दोनों के ही परिवार इसी चर्च में प्रे करने के लिए आया करते थे. (Rebekah Labuschagne/Instagram) इसी चर्च में दोनों परिवारों की आपस में मुलाकात हुई और गहरी दोस्‍ती हो गई. ईसाई धर्म के उपदेशों की दोनों ही परिवारों में बहुत गहरी मान्‍यता है. रिपोर्ट्स के मुताबिक रैबेका भी काफी ज्‍यादा धार्मिक प्रवृति की महिला हैं. वो लो-प्रोफाइल रहना पसंद करती हैं.(Rebekah Labuschagne/Instagram) चर्च में मार्नस और रैबेका की मुलाकातें होती चली गई जो धीरे-धीरे प्‍यार में बदल गई. साल 2017 में लैबुशेन ने शादी के लिए रैबेका को प्रपोज किया. इसी साल दोनों शादी के बंधन में भी बंध गए. वो अपनी पत्‍नी को काफी लकी मानते हैं. (Rebekah Labuschagne/Instagram) साल 2017 में शादी के बाद क्‍वीन्‍सलैंड के लिए उनका प्रदर्शन काफी आला दर्जे का हो गया. जिसके बाद साल 2019 में उन्‍हें ऑस्‍ट्रेलिया की टीम में भी जगह मिल गई. मार्नस का करियर चमकने के बाद पत्‍नी रैबेका भी काफी सुर्खियों में आने लगी. हालांकि वो निजी तौर पर इन सब से दूर ही रहने का प्रयास करती हैं. (Rebekah Labuschagne/Instagram)","pubDate":"2023-02-05 00:45:38","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/02/Marnus-Labuschagne-Life-Partner-2-16755384223x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"ACC Meeting: एशिया कप के बाद चैंपियंस ट्रॉफी से भी हाथ धोएगा पाकिस्‍तान! जय शाह ने तैयार किया प्‍लान","link":"https://hindi.news18.com/news/sports/cricket-after-asia-cup-2023-hosting-bcci-will-take-away-2023-champions-trophy-hosting-5332251.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"एशिया कप (Asia Cup 2023) का आयोजन इस बार 50 ओवरों के फॉर्मेट में किया जाना है. पाकिस्‍तान उम्‍मीद जता रहा था कि एशिया कप का आयोजन उनके अपने देश में होगा लेकिन बीसीसीआई (BCCI vs PCB) के सामने पड़ोसी देश की एक नहीं चली. एसीसी मीटिंग से साफ हो गया है कि भारत पाकिस्‍तान में जाकर क्रिकेट नहीं खेलेगा.","content":"एशिया कप 2023 को होस्‍ट करने का अधिकार पीसीबी को मिला है. (Twitter/ICC) नई दिल्‍ली . एशिया कप (Asia Cup 2023) का होस्‍ट बनने की इच्‍छा पाले बैठे पाकिस्‍तान को बीसीसीआई ने करार झटका दिया है. बेहरनी में हुई एशियन क्रिकेट काउंसिल (Asian Cricket Council) की बैठक के दौरान बीसीसीआई (BCCI) ने पाकिस्‍तान क्रिकेट बोर्ड (PCB) को करार झटका दिया है. बीसीसीआई सचिव जय शाह (Jay Shah) की तरफ से पहले ही यह साफ कर दिया गया था कि भारत की टीम एशिया कप खेलने के लिए पाकिस्‍तान का दौरा नहीं करेगी. इस बात से भिन्‍नाए पाकिस्‍तान ने एशियन क्रिकेट काउंसिल से हटने की धमकी तक दे डाली थी. शनिवार को हुई एसीसी की ताजा बैठक के बाद अब एशिया कप ही नहीं बल्कि 2025 में पाकिस्‍तान में होने वाली चैंपियंस ट्रॉफी (Champions Trophy) के अस्तित्‍तव पर भी सवाल उठने लगे हैं. साल 2009 में पाकिस्‍तान की धरती पर श्रीलंका की टीम पर हुए आतंकी हमले के बाद करीब डेढ़ दशक तक पड़ोसी देश में अंतरराष्‍ट्रीय क्रिकेट प्रभावित रहा. धीरे-धीरे एक-एक कर अब सभी टीमें पाकिस्‍तान का दौर कर चुकी हैं. केवल भारत ही इकलौता ऐसा देश है जिसने पाकिस्‍तान का दौरा नहीं किया है. भारत और पाकिस्‍तान के बीच मौजूदा संबंधों को देखते हुए बीसीसीआई ने पाकिस्‍तान जानें से इनकार कर दिया. न्‍यूज एजेंसी पीटीआई की खबर के मुताबिक एसीसी की मीटिंग में यह साफ हो गया है कि पाकिस्‍तान एशिया कप का आयोजन नहीं करेगा. नए वेन्‍यू को लेकर अभी स्थिति स्‍पष्‍ट नहीं है. माना जा रहा है कि यूएई या फिर श्रीलंका में एशिया कप का आयोजन हो सकता है. Border Gavaskar Trophy में कौन है सबसे कंजूस गेंदबाज? बल्‍लेबाजों को नहीं बनाने देता रन…देखें टॉप-10 लिस्‍ट Shaheen Afridi Wedding : निकाह के बाद रोमांटिक हुए पाक पेसर….बेगम संग खिंचवाई इंटीमेंट तस्‍वीरें…आपने देखी क्‍या? चैंपियंस ट्रॉफी से भी हाथ धोएगा पाकिस्‍तान! आईसीसी ने साल 2025 में होने वाली चैंपियंस ट्रॉफी को होस्‍ट करने का अधिकार पाकिस्‍तान को दिया है. एसीसी में पाकिस्‍तान की हेकड़ी निकालने के बाद अब जय शाह आईसीसी के सामने भी पड़ोसी देश के क्रिकेट बोर्ड को चारो खाने चित कर देंगे. बीसीसीआई सचिव ने इसे लेकर प्‍लान भी बना लिया है. ऐसा होना ज्‍यादा मुश्किल नजर नहीं आता. बीसीसीआई दुनिया का सबसे अमीर क्रिकेट बोर्ड है. भारतीय टीम जहां जाकर खेलती है वहीं स्‍पॉन्‍सर्स की लाइन लग जाती है. भले ही अन्‍य सभी देश पाकिस्‍तान का दौरा कर चुके हों लेकिन अगर एक बार बीसीसीआई ने आईसीसी में अपनी ताकत दिखाई तो पड़ोसी देश से चैंपियंस ट्रॉफी छिनना भी तय है. हालांकि चैंपियंस ट्रॉफी के आयोजन में अभी दो साल का वक्‍त है. ब्रेकिंग न्यूज़ हिंदी में सबसे पहले पढ़ें News18 हिंदी| आज की ताजा खबर, लाइव न्यूज अपडेट, पढ़ें सबसे विश्वसनीय हिंदी न्यूज़ वेबसाइट News18 हिंदी| Tags: Asia cup , BCCI , ICC , IND vs PAK , India Vs Pakistan , Pcb चर्च के गलियारों में पनपा प्‍यार…शादी करते ही करियर ने पकड़ी रफ्तार…अब भारत को मात देने आया धाकड़ बल्‍लेबाज पाकिस्तान के क्रिकेटर ने कप्तान की बेटी से की शादी, दुनिया के कई खिलाड़ी हैं रिश्तेदार, कुछ का हुआ दर्दनाक अंत अमेरिका में आर्कटिक ब्लास्ट से हालात बदतर, -79 डिग्री ठंड से लॉकडाउन जैसी स्थिति, स्कूल बंद","pubDate":"2023-02-05 00:30:48","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/02/BCCI-vs-PCB-16755311483x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Pakistan cricket legend Wasim Akram ‘looking forward’ to launching Saudi cricket league","link":"https://www.arabnews.com/node/2244751/sport","keywords":null,"creator":["bassam.zaazaa"],"video_url":null,"description":"Sat, 2023-02-04 21:14 ISLAMABAD: Former Pakistan cricket captain Wasim Akram has said he is “looking forward” to launching a cricket league in Saudi Arabia following his trip to Riyadh this week. The Pakistani pacer issued the statement after meeting Saudi Arabian Cricket Federation Chairman Prince Saud bin Mishal to discuss the future of the sport in the Kingdom. Akram’s visit follows a recent strengthening of cricket ties between the two countries.Main category: SportCricket","content":"ISLAMABAD: Former Pakistan cricket captain Wasim Akram has said he is “looking forward” to launching a cricket league in Saudi Arabia following his trip to Riyadh this week. The Pakistani pacer issued the statement after meeting Saudi Arabian Cricket Federation Chairman Prince Saud bin Mishal to discuss the future of the sport in the Kingdom. Akram’s visit follows a recent strengthening of cricket ties between the two countries. Last month, Javed Afridi, who owns Pakistan Super League franchise Peshawar Zalmi, announced that his team will play exhibition matches in Saudi Arabia. Pakistan Cricket Board Chairman Najam Sethi also said last month that the South Asian country is willing to share its expertise in the sport with the Kingdom, where cricket’s popularity is growing rapidly. “What a trip to Riyadh,” Akram wrote in a Facebook post this week. “Had a great meeting with H.H. Saud (bin) Mishal, talked about cricket in Saudi Arabia, and so looking forward to (starting) a Saudi league insha Allah very soon.” Pakistan and Saudi Arabia have strong economic, defense and cultural ties. Last month, Pakistan women’s football team were runners-up in a four-nation tournament in the Kingdom. Since its establishment in 2020, the Saudi Arabian Cricket Federation has launched a series of major initiatives, including a national championship, a corporate tournament, a league for expatriate workers, and social programs in several cities. The ruling body oversees 15 official associations representing the sport in nine regions, and has announced plans to set up additional associations in the remaining regions to ensure cricket is played across the Kingdom.","pubDate":"2023-02-04 18:17:14","image_url":null,"source_id":"arabnews","category":["sports"],"country":["saudi arabia"],"language":"english"},{"title":"Pakistan unlikely to host Asia Cup, venue to be finalised in March","link":"https://www.dnaindia.com/cricket/report-pakistan-unlikely-to-host-asia-cup-venue-to-be-finalised-in-march-2023-3021527","keywords":["Sports","Cricket"],"creator":["DNA Web Team"],"video_url":null,"description":"The Asia Cup was initially allotted to Pakistan and was scheduled in September this year but ACC chairman Jay Shah had announced last October that India will not travel to Pakistan due diplomatic tension between the two nations.","content":"New Delhi: The Asian Cricket Council (ACC) is expected to shift Asia Cup from Pakistan and decide on an alternate venue in March as BCCI secretary Jay Shah and PCB chairman Najam Sethi discussed the issue during a formal meeting in Bahrain on Saturday. All heads of ACC member nations attended the emergent meeting which was called at the behest of Sethi after the continental body released its itinerary and Pakistan wasn't named the hosts for the Asia Cup. The Asia Cup was initially allotted to Pakistan and was scheduled in September this year but Shah, who is also the ACC chairman, had announced last October that India will not travel to Pakistan due diplomatic tension between the two nations. \"The ACC had a constructive dialogue on the upcoming Asia Cup 2023. The Board agreed to continue discussions on operations, timelines and any other specifics with a view to ensure the success of the tournament. An update on the matter would be taken on the next ACC Executive Board Meeting to be held in March 2023,\" ACC said in a statement. While a decision will come only next month, a senior BCCI official privy to the development told PTI that it is highly unlikely that Pakistan will host the tournament. \"With India deciding against travelling to Pakistan, the tournament will have to be shifted. A tournament without Virat Kohli, Rohit Sharma and Shubman Gill will have the sponsors back out,\" the official said. One ACC insider said Sethi has just taken over PCB and if he had ceded ground on the hosting rights in the first meeting itself, then it would have led to a bad impression at home. Pakistan is currently going through an economic crisis. The inflation has hit the country very hard as one USD is now equal to 277 Pakistani Rupee. Organising a high-profile tournament like Asia Cup, even if ACC pays a grant could burn a hole in PCB coffers. So strategically, if the tournament is held in the UAE, there is every possibility that all the member nations will also get to earn apart from the broadcast revenues. In another decision, the ACC has decided to increase the annual budget allocated for Afghanistan Cricket Association to 15 percent from six. The ACC has assured that it will help the Afghanistan board in all possible ways so that women's cricket can be revived in the country. Women are banned from playing sport under Taliban rule. The Executive Board also approved of the inclusion of teams from Japan and Indonesia in the ACC pathway tournaments to participate in the events as invitees.","pubDate":"2023-02-04 18:16:00","image_url":null,"source_id":"dnaindia","category":["sports"],"country":["india"],"language":"english"},{"title":"Harmanpreet keen to not let WPL buzz affect preparation for India vs Pakistan clash","link":"https://www.indiatoday.in/sports/cricket/story/womens-t20-world-cup-2023-harmanpreet-kaur-doesnt-want-focus-to-shift-from-india-pakistan-clash-amid-wpl-buzz-2330555-2023-02-04?utm_source=rss","keywords":null,"creator":null,"video_url":null,"description":"Harmanpreet keen to not let WPL buzz affect preparation for India vs Pakistan clash","content":": Skipper said that it’s necessary not to get carried away by the buzz surrounding the Women’s Premier League (WPL) auction amid India’s preparations for the upcoming Women’s T20 World Cup in South Africa. If reports are to be believed, the auction for the inaugural edition of the WPL is scheduled to take place on February 14. But prior to that, the Indian players will take part in an all-important World Cup match against Pakistan on February 12 at the Newlands in Cape Town. Harmanpreet, who is the only centurion in T20Is among Indian women’s cricketers, said that India are currently focussed on their match against Pakistan. \"Before that [the auction], we have a very important game and we are just going to focus on that,\" Harmanpreet was quoted as saying at the T20 World Cup captains' pressers. While welcoming the idea of the WPL, Harmanpreet said how the Women’s Big Bash League (WBBL) and the Women’s Hundred contributed to the growth of Australian and English cricket. \"It's a really big day for all of us because we have been waiting for years and years now. The next two or three months are very important for women's cricket. We have seen how the WBBL and the Hundred have helped their countries improve their cricket. Hopefully, the same will happen for our country,\" she stated. Harmanpreet also talked about her experience of plying her trade in the Kia Super League, WBBL and Women’s Hundred over the years. \"That is something which has a very different feeling. When I got that opportunity, it was the biggest life-changing moment. Other girls will also experience this. It will be a great opportunity to improve cricket and grow the game,\" Harmanpreet said. \"The World Cup is more important than anything else. Our focus is on the ICC trophy. These things will keep coming, and as a player, you know what's important for you and how you need to keep your focus. We are all mature enough and know what is important for us,\" she stated. Before the World Cup, India are also scheduled to lock horns with Meg Lanning’s Australia and Nigar Sultana Joty’s Bangladesh in two warm-up matches on February 6 and 8 respectively. India played the World Cup final last time around in 2020, but lost to Australia at the iconic Melbourne Cricket Ground (MCG).","pubDate":"2023-02-04 17:59:28","image_url":null,"source_id":"indiatoday","category":["sports"],"country":["india"],"language":"english"},{"title":"IND vs AUS Test Series: ऑस्ट्रेलिया के अभ्यास मैच नहीं खेलने के फैसले पर पूर्व भारतीय स्टार ने जताई हैरानी","link":"https://sports.ndtv.com/hindi/cricket/suresh-raina-surprised-by-australias-decision-not-to-play-warm-up-match-before-test-series-ndtv-hindi-ndtv-india-3753952#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"IND vs AUS Test: पूर्व भारतीय बल्लेबाज सुरेश रैना (Suresh Raina) को भरोसा है कि भारत चार टेस्ट मैचों की सीरीज में अच्छा प्रदर्शन करेगा और रविंद्र जडेजा (Ravindra Jadeja) की वापसी टीम में अच्छा संतुलन लाएगी.","content":"Australia Test Team पूर्व भारतीय बल्लेबाज सुरेश रैना (Suresh Raina) नौ फरवरी से नागपुर में शुरू हो रही बॉर्डर गावस्कर ट्रॉफी (Border Gavaskar Trophy) से पहले ऑस्ट्रेलियाई टीम के अभ्यास मैचों में खेलने के बजाय परिस्थितिजन्य अभ्यास करने के फैसले से काफी हैरान हैं. ऑस्ट्रेलियाई टीम इस समय बेंगलुरु में ट्रेनिंग कर रही है और उछाल लेती पिचों पर अभ्यास कर रही है और बड़ौदा के स्पिनर महेश पिथिया को गेंदबाजी के लिए बुलाया गया है जिनका गेंदबाजी एक्शन रविचंद्रन अश्विन (Ravichandran Ashwin) से मिलता है. लेकिन भारत के सफेद गेंद के बेहतरीन खिलाड़ियों में से एक रैना को लगता है कि ऑस्ट्रेलियाई टीम को इसकी कमी खलेगी. रैना ने 'पुलिस परिवार कल्याण सोसाइटी' द्वारा आयोजित 'मिशन ओलंपिक्स' सालाना दिवस मुलाकात के मौके पर कहा, \"मैंने टेस्ट से पहले अभ्यास मैच खेले हैं और ये सचमुच महत्वपूर्ण हैं. वे (ऑस्ट्रेलिया) भारत की पिचों को उन पर खेलकर ही समझ सकते हैं.\" रैना को भरोसा है कि भारत चार टेस्ट मैचों की सीरीज (IND vs AUS Test Series) में अच्छा प्रदर्शन करेगा और रविंद्र जडेजा (Ravindra Jadeja) की वापसी टीम में अच्छा संतुलन लाएगी. उन्होंने कहा, \"मैं लंबे समय के बाद जडेजा की वापसी से खुश हूं.\" रैना ने कहा, \"हमारे स्पिनर आर अश्विन, अक्षर पटेल अच्छा कर रहे हैं. विराट कोहली और रोहित शर्मा अच्छी फॉर्म में हैं और मुझे लगता है कि हमें एक अच्छी श्रृंखला देखने को मिलेगी.\" * * * पढ़ें , , राजनीति, देश और दुनिया की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-02-04 17:55:58","image_url":"https://c.ndtvimg.com/2022-07/l7hl4ct8_australia-cricket-team-afp_625x300_01_July_22.jpg?im=FitAndFill,algorithm=dnn,width=806,height=605","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"फाइनल में पर्थ स्कॉचर्स ने ब्रिस्बेन हीट को 5 विकेट से रौंदा, पांचवी बार टीम बनी चैंपियन","link":"https://navbharattimes.indiatimes.com/sports/cricket/cricket-news/bbl-perth-scorchers-beat-brisbane-heat-by-5-wickets-in-the-final-became-champions-for-the-fifth-time/articleshow/97609188.cms","keywords":null,"creator":null,"video_url":null,"description":"BBL Final: बिग बैश लीग 2022-23 के फाइनल में पर्थ स्कॉचर्स ने ब्रिस्बेन हीट को 5 विकेट से हराकर खिताब को अपने नाम कर लिया है। पर्थ की टीम पांचवीं बार लीग की चैंपियन बनी है। दोनों टीमों के बीच यह मुकाबला पर्थ में खेला गया था और टक्कर कांटे की हुई थी।","content":"बिग बैश लीग 2022-23 के फाइनल मुकाबले में पर्थ स्कॉचर्स ने ब्रिस्बेन हीट को 5 विकेट से हरा दिया। इसके साथ ही पर्थ की टीम ने लीग में पांचवी बार चैंपियन बनने का गौरव हासिल किया है। इस मुकाबले में ब्रिस्बेन ने पहले बल्लेबाजी करते हुए निर्धारित 20 ओवर के खेल में 7 विकेट के नुकसान पर 175 रन बनाए थे। इसके जवाब में पर्थ की टीम ने 19.2 ओवर में 178 रन बनाकर मैच को जीत लिया। पर्थ की इस जीत में कप्तान एश्टन टर्नर ने 53 रनों की विस्फोटक अर्धशतकीय पारी खेली। उन्होंने 32 गेंदों का सामना किया जिसमें 5 चौके और दो छक्के लगाए। इसके अलावा जोश इंगलिश ने 26 और कूपर कोलनी ने आखिरी में 25 रनों की महत्वपूर्ण पारी खेली। हालांकि पर्थ जब लक्ष्य का पीछा करने उतरी थी तो उसकी शुरुआत कुछ खास नहीं रही थी। टीम ने अपना पहला सिर्फ 32 रन के स्कोर गंवा दिया था। ओपनर बल्लेबाज स्टीफन स्केनाजी सिर्फ 21 रन बनाकर आउट हुए जबकि कैमरून बैनक्रॉफ्ट सिर्फ 15 रन का योगदान दे सके। हालांकि कप्तान एश्टन टर्नर ने एक छोर से पारी को संभाले रखा को टीम को जीत की दहलीज पर पहुंचा दिया। फाइनल मैच में पहले बल्लेबाजी करने उतरे ब्रिस्बेन हीट के ओपनर बल्लेबाज उम्मीद के मुताबिक टीम को शुरुआत नहीं दिला सके। ब्रिस्बेन ने सिर्फ 25 रन के स्कोर अपना पहला विकेट गंवा दिया। सैम हेजलेट ने जरूर पारी को संभाला और 34 रन बनाकर आउट हुए। इसके अलावा तीसरे नंबर पर बल्लेबाजी करने उतरे नाथन मैकस्वीनी ने 37 गेंद में 41 रनों की पारी खेली। मध्यक्रम में मैक्स ब्रायंट ने भी 31 रनों महत्वपूर्ण पारी खेली जबकि सैम हेन ने 16 गेंद में 21 रनों का योगदान दिया। पहले गेंदबाजी के लिए मैदान पर उतरी पर्थ के लिए जेसन बेहरनडॉर्फ और मैथ्यू केली ने दो-दो विकेट अपने नाम किए। इसके अलावा डेविड पायने, एरोन हार्डी और एंड्रयू टाय को भी एक-एक सफलता हासिल हुई थी।","pubDate":"2023-02-04 17:22:43","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"VIDEO: लसिथ मलिंगा का नया अवतार, गेंदबाजी छोड़ पियानो से जमाई महफिल, दिल हार गए फैंस","link":"https://hindi.news18.com/news/sports/cricket-rajasthan-royals-shared-video-of-lasith-malinga-playing-the-piano-5333013.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"मौजूदा समय में लसिथ मलिंगा आईपीएल फ्रेंचाइजी राजस्थान रॉयल्स के गेंदबाजी कोच हैं. आईपीएल के 16वें सीजन में भी वह राजस्थान के गेंदबाजों को धार देते हुए नजर आएंगे. आईपीएल 2023 के शुरू होने से पहले राजस्थान रॉयल्स ने उनका एक वीडियो साझा किया है. इस वीडियो में वह पियानो बजाते हुए नजर आ रहे हैं.","content":"लसिथ मलिंगा का नया अवतार. (AP) नई दिल्ली. श्रीलंकाई पूर्व दिग्गज तेज गेंदबाज लसिथ मलिंगा (Lasith Malinga) के बारे में कौन नहीं जानता है. उन्होंने अपने समय में दुनिया के सभी बल्लेबाजों को परेशान कर रखा था. मलिंगा की स्लोवर यॉर्कर का विपक्षी टीम के बल्लेबाजों के पास कोई तोड़ नहीं था. उन्होंने मैदान में अपनी उम्दा गेंदबाजी के बदौलत कई बड़े रिकॉर्ड अपने नाम किए. यही वजह है कि मौजूदा समय में वह कई युवा तेज गेंदबाजों के आइडल हैं. राजस्थान रॉयल्स के गेंदबाजी कोच हैं मलिंगा: मौजूदा समय में लसिथ मलिंगा आईपीएल फ्रेंचाइजी राजस्थान रॉयल्स (Rajasthan Royals) के गेंदबाजी कोच हैं. आईपीएल के 16वें सीजन में भी वह राजस्थान के गेंदबाजों को धार देते हुए नजर आएंगे. आईपीएल 2023 के शुरू होने से पहले राजस्थान रॉयल्स ने उनका एक वीडियो साझा किया है. इस वीडियो में वह पियानो बजाते हुए नजर आ रहे हैं. A post shared by Rajasthan Royals (@rajasthanroyals) यह भी पढ़ें- रोहित के चाहने वालों के लिए बड़ा झटका, भारतीय दिग्गज ने कहा- टी20 वर्ल्ड कप में नहीं मिलेगा मौका मलिंगा ने 2021 में क्रिकेट के सभी प्रारूपों से लिया संन्यास. इंटरनेशनल क्रिकेट में श्रीलंका के लिए 340 मुकाबलों में शिरकत करने वाले मलिंगा ने सितंबर 2021 में क्रिकेट के सभी प्रारूपों से संन्यास ले लिया. जिसके बाद आईपीएल के 15वें सीजन के लिए राजस्थान रॉयल्स की टीम ने उन्हें अपना गेंदबाजी कोच नियुक्त किया. आरआर का साल 2022 में प्रदर्शन बेहद शानदार रहा. टीम ने उम्दा प्रदर्शन करते हुए फाइनल तक का सफर तय किया था. मलिंगा का आईपीएल करियर: मलिंगा का आईपीएल में प्रदर्शन बेहद शानदार रहा. उन्होंने यहां 122 मुकाबले खेलते हुए 122 पारियों में 19.79 की औसत से 170 सफलता प्राप्त की. आईपीएल में उनके नाम एक बार पांच विकेट लेने का भी कारनामा है. ब्रेकिंग न्यूज़ हिंदी में सबसे पहले पढ़ें News18 हिंदी| आज की ताजा खबर, लाइव न्यूज अपडेट, पढ़ें सबसे विश्वसनीय हिंदी न्यूज़ वेबसाइट News18 हिंदी| Tags: Indian premier league , IPL , Lasith malinga , Rajasthan Royals IND vs AUS: ऑस्ट्रेलिया के लिए बुरा सपना हैं चेतेश्वर पुजारा, 1 कदम और सचिन हो जाएंगे पीछे, देखें आंकड़े चर्च के गलियारों में पनपा प्‍यार…शादी करते ही करियर ने पकड़ी रफ्तार…अब भारत को मात देने आया धाकड़ बल्‍लेबाज पाकिस्तान के क्रिकेटर ने कप्तान की बेटी से की शादी, दुनिया के कई खिलाड़ी हैं रिश्तेदार, कुछ का हुआ दर्दनाक अंत","pubDate":"2023-02-05 01:17:48","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/01/Lasith-Malinga-AP-16739681423x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Ranji Trophy: सेमीफाइनल की लाइनअप तय... इन चार टीमों ने बनाई अंतिम-4 में जगह.. जानिए कब किस टीम की कहां होगी भिड़ंत","link":"https://hindi.news18.com/news/sports/cricket-madhya-pradesh-vs-bengal-saurashtra-vs-karnataka-ranji-trophy-semi-final-line-up-when-and-where-to-watch-live-telecast-streaming-5332997.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"Ranji Trophy: रणजी ट्रॉफी सेमीफाइनल की 4 टीमें कंफर्म हो गई हैं. सौराष्ट्र ने पांचवें और आखिरी दिन पंजाब को 71 रन से हराकर अंतिम-4 का टिकट कटाया. सेमीफाइनल के मुकाबले 8 फरवरी से खेले जाएंगे. पहला सेमीफाइनल इंदौर में जबकि दूसरा बेंगलुरु में खेला जाएगा. दोनों मुकाबले सुबह 9:30 बजे से खेले जाएंगे.","content":"रणजी ट्रॉफी के सेमीफाइनल मुकाबले 8 फरवरी से खेले जाएंगे. (BCCI/Twitter) नई दिल्ली. सौराष्ट्र की टीम रणजी ट्रॉफी 2022-23 (Ranji Trophy 2022-23) के सेमीफाइनल में पहुंचने वाली चौथी टीम बन गई. दूसरे क्वार्टर फाइनल में सौराष्ट्र ने पंजाब को 71 रन से पटखनी देकर अंतिम-4 का टिकट कटाया. इससे पहले कर्नाटक, बंगाल और मध्यप्रदेश की टीमों ने सेमीफाइनल के लिए क्वालीफाई किया था. तीन नतीजे मैच के चौथे दिन ही आ गए थे जबकि चौथा रिजल्ट शनिवार को आया. बंगाल ने क्वार्टर फाइनल में झारखंड को 9 विकेट से रौंदा वहीं कर्नाटक ने उत्तराखंड को पारी और 281 रन से पराजित किया था. मध्यप्रदेश ने इंदौर में खेले गए क्वार्टर फाइनल मुकाबले में आंध्र प्रदेश को 5 विकेट से हराकर सेमीफाइनल का टिकट कटाया. पंजाब को पांचवें दिन शनिवार को जीत के लिए 200 रन की जरूरत थी और उसके 5 विकेट बचे थे. सौराष्ट्र की टीम ने 128 रन के भीतर उसके पांचों विकेट झटक लिए और मुकाबले को 71 रन से जीतकर शान से अंतिम 4 में पहुंचे. यह भी पढ़ें: वीरेंद्र सहवाग का डेब्यू मैच में गालियों से हुआ वेलकम… 5 साल बाद पाकिस्तानियों को दिया था मुंहतोड़ जवाब ब्रेकिंग न्यूज़ हिंदी में सबसे पहले पढ़ें News18 हिंदी| आज की ताजा खबर, लाइव न्यूज अपडेट, पढ़ें सबसे विश्वसनीय हिंदी न्यूज़ वेबसाइट News18 हिंदी| Tags: Bengal , Karnatka , Ranji cricket , Ranji Trophy IND vs AUS: ऑस्ट्रेलिया के लिए बुरा सपना हैं चेतेश्वर पुजारा, 1 कदम और सचिन हो जाएंगे पीछे, देखें आंकड़े चर्च के गलियारों में पनपा प्‍यार…शादी करते ही करियर ने पकड़ी रफ्तार…अब भारत को मात देने आया धाकड़ बल्‍लेबाज पाकिस्तान के क्रिकेटर ने कप्तान की बेटी से की शादी, दुनिया के कई खिलाड़ी हैं रिश्तेदार, कुछ का हुआ दर्दनाक अंत","pubDate":"2023-02-05 01:15:41","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/02/RANJI-1-16755594383x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"IND vs AUS: ऑस्ट्रेलिया के लिए बुरा सपना हैं चेतेश्वर पुजारा, 1 कदम और सचिन हो जाएंगे पीछे, देखें आंकड़े","link":"https://hindi.news18.com/photogallery/sports/cricket-cheteshwar-pujara-two-double-century-against-australia-equal-sachin-tendulkar-record-border-gavaskar-trophy-ind-vs-aus-5332145.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"टीम इंडिया के लिए 2023 काफी महत्वपूर्ण है और भारत ने इस साल की शुरुआत शानदार की. लेकिन अब ब्लू आर्मी पहली चुनौती के करीब पहुंच चुकी है. वर्ल्ड टेस्ट चैंपियनशिप फाइनल खेलने के लिए भारतीय टीम के बीच है ऑस्ट्रेलिया. बॉर्डर गावस्कर ट्रॉफी में महज 1 हफ्ते का समय बचा है. आईए एक ऐसे खिलाड़ी की बात करते हैं जो कंगारू टीम के लिए बुरा सपना बना हुआ है. जी हां, हम बात कर रहे हैं चेतेश्ववर पुजारा की जो टेस्ट के लिहाज से भारत की जान हैं.","content":"Loading... Loading... Loading... Loading... आईए देखते हैं ऐसे टॉप तीन खिलाड़ियों को जिन्होंने ऑस्ट्रेलिया के खिलाफ सबसे ज्यादा दोहरे शतक लगाए हैं. इन प्लेयर्स में सचिन तेंदुलकर, वीवीएस लक्ष्मण और चेतेश्वर पुजारा का नाम है. पुजारा के आंकड़ों से अंदाजा लगाया जा सकता है कि वह ऑस्ट्रेलिया के लिए एक बुरा सपना हैं. (AP) सबसे पहले बात करते हैं क्रिकेट के भगवान के नाम से मशहूर सचिन तेंदुलकर का. मास्टर ब्लास्टर ने ऑस्ट्रेलिया के खिलाफ टेस्ट में कुल दो दोहरे शतक लगाए हैं. उन्होंने पहली बार 241 रन की पारी खेली और दूसरी बार 214 रन बना दिए. (PTI) लिस्ट में दूसरा नाम पूर्व दिग्गज वीवीएस लक्ष्मण का है. उन्होंने एक बार ऑस्ट्रेलिया के खिलाफ 281 रन की विशालकाय पारी खेली. उसके बाद लक्ष्मण ने एक बार नाबाद दोहरा शतक जमा दिया था. (AFP) लक्ष्मण ने कई बार टीम इंडिया को अपनी बेशकीमती पारियों से जीत दिलाई है. एक बार एडिलेड टेस्ट के दौरान 148 रन की पारी से उन्होंने भारत को जीत दिलाई. इसके बाद इस खिलाड़ी ने ऑस्ट्रेलिया का गुरूर तोड़ दिया था. (VVS Laxman/Instagram) सचिन तेंदुलकर और वीवीएस लक्ष्मण को टेस्ट में जो जिम्मेदारी मिली, उन्होंने बखूबी निभाई. दोनों दिग्गज खिलाड़ियों ने टीम इंडिया को कई बड़े मुकाबलों में जीत दिलाई थी. लेकिन अब बात करते हैं मॉडर्न क्रिकेट की. (AFP) इस लिस्ट में हैं चेतेश्वर पुजारा का नाम, जो अभी भी टीम इंडिया का हिस्सा हैं. पुजारा के आंकड़े इस बात की गवाही दे रहे हैं कि वह ऑस्ट्रेलिया के खिलाफ कितने घातक साबित हो सकते हैं. इस टीम के खिलाफ उन्होंने दो दोहरे शतक लगाए ही, लेकिन कई बार मुश्किल समय में टीम के लिए अड़े रहे. (Cheteshwar Pujara/Instagram) साल 2013 में पुजारा कंगारुओं पर हावी हुए और उन्होंने 341 गेंद में 204 रन की पारी खेली थी. उसके बाद 2017 में फिर उन्होंने इस टीम को टारगेट कर लिया. उस दौरान पुजारा ने 525 गेंद में 202 रन की पारी खेली. (AP) उम्मीद है कि 9 फरवरी में शुरू होने वाली बॉर्डर गावस्कर ट्रॉफी के लिए पुजारा ने कुछ बड़ा प्लान किया होगा. हाल ही में उन्होंने प्रैक्टिस करते हुए कुछ फोटोज सोशल मीडिया पर शेयर की थीं. यदि इस सीरीज में पुजारा एक दोहरा शतक लगा देते हैं तो वह इस लिस्ट में सचिन तेंदुलकर को भी पछाड़ देंगे. (AP)","pubDate":"2023-02-05 01:00:55","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/02/cheteshwar-pujara-100-vs-ban1-16755070123x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"चर्च के गलियारों में पनपा प्‍यार…शादी करते ही करियर ने पकड़ी रफ्तार…अब भारत को मात देने आया धाकड़ बल्‍लेबाज","link":"https://hindi.news18.com/photogallery/sports/cricket-india-vs-asustralia-marnus-labuschagne-love-story-with-wife-rebekah-labuschagne-5332441.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"ऑस्‍ट्रेलियाई टीम भारत दौरे पर अपनी पूरी ताकत लगा देना चाहती है. ऐसा इसलिए क्‍योंकि बीते दो ऑस्‍ट्रेलिया दौरों पर भारत ने मेजबान देश को टेस्‍ट सीरीज में मात दी थी. इससे पहले कोई भी एशियाई देश ऑस्‍ट्रेलिया को उन्‍हीं की धरती पर टेस्‍ट सीरीज नहीं हरा पाया था.","content":"Loading... Loading... Loading... Loading... नई दिल्‍ली. ऑस्‍ट्रेलिया की टीम नागपुर टेस्‍ट की तैयारियों में जुटी है. बेंगलुरू में पैट कमिंस के नेतृत्‍व वाली टीम ने नेट सेशन बीते तीन दिनों से जारी है. चार मैचों की इस टेस्‍ट सीरीज को लेकर कंगारू फिलहाल अपनी स्पिन बैट्री को और धारदार बनाने में जुटे हैं. टीम के साथ उनका एक धाकड़ बैटर भी भारत आया हुआ है. (Marnus Labuschagne Instagram) इस बैटर की लव स्‍टोरी ब्रिसबेन की एक चर्च से शुरू हुई. वो चर्च में बचपन में ही अपनी होने वाली वाइफ से मिल चुका था. दोनों का प्‍यार चर्च के गलियारों में ही पनपा और परवान चढ़ा. अब इस कंगारू बैटर की शादी को 5 साल बीत गए हैं. (Marnus Labuschagne Instagram) हम बात कर रहे हैं ऑस्‍ट्रेलिया की टीम के टॉप ऑर्डर बैटर मार्नस लैबशेन की. 28 साल का ये बैटर ऑस्‍ट्रेलिया की टेस्‍ट टीम नंबर-3 पर खेलता है. इस फॉर्मेट में लैबुशेन की बैटिंग औसत ऐसी है कि विराट कोहली भी काफी पीछे नजर आते हैं. वो करीब 60 की औसत से टेस्‍ट क्रिकेट में रन बनाते हैं. (Rebekah Labuschagne/Instagram) मार्नस लैबुशेन की लव स्‍टोरी काफी इंट्रस्टिंग है. खबरों की मानें तो महज 17 साल की उम्र में लैबुशेन अपनी पत्‍नी रैबेका लैबुशेन से मिले थे. दोनों की मुलाकात ब्रिसबेन के रेडलैंड में स्थित गेटवे बेपटिस्‍ट चर्च में हुई. दोनों के ही परिवार इसी चर्च में प्रे करने के लिए आया करते थे. (Rebekah Labuschagne/Instagram) इसी चर्च में दोनों परिवारों की आपस में मुलाकात हुई और गहरी दोस्‍ती हो गई. ईसाई धर्म के उपदेशों की दोनों ही परिवारों में बहुत गहरी मान्‍यता है. रिपोर्ट्स के मुताबिक रैबेका भी काफी ज्‍यादा धार्मिक प्रवृति की महिला हैं. वो लो-प्रोफाइल रहना पसंद करती हैं.(Rebekah Labuschagne/Instagram) चर्च में मार्नस और रैबेका की मुलाकातें होती चली गई जो धीरे-धीरे प्‍यार में बदल गई. साल 2017 में लैबुशेन ने शादी के लिए रैबेका को प्रपोज किया. इसी साल दोनों शादी के बंधन में भी बंध गए. वो अपनी पत्‍नी को काफी लकी मानते हैं. (Rebekah Labuschagne/Instagram) साल 2017 में शादी के बाद क्‍वीन्‍सलैंड के लिए उनका प्रदर्शन काफी आला दर्जे का हो गया. जिसके बाद साल 2019 में उन्‍हें ऑस्‍ट्रेलिया की टीम में भी जगह मिल गई. मार्नस का करियर चमकने के बाद पत्‍नी रैबेका भी काफी सुर्खियों में आने लगी. हालांकि वो निजी तौर पर इन सब से दूर ही रहने का प्रयास करती हैं. (Rebekah Labuschagne/Instagram)","pubDate":"2023-02-05 00:45:38","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/02/Marnus-Labuschagne-Life-Partner-2-16755384223x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"ACC Meeting: एशिया कप के बाद चैंपियंस ट्रॉफी से भी हाथ धोएगा पाकिस्‍तान! जय शाह ने तैयार किया प्‍लान","link":"https://hindi.news18.com/news/sports/cricket-after-asia-cup-2023-hosting-bcci-will-take-away-2023-champions-trophy-hosting-5332251.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"एशिया कप (Asia Cup 2023) का आयोजन इस बार 50 ओवरों के फॉर्मेट में किया जाना है. पाकिस्‍तान उम्‍मीद जता रहा था कि एशिया कप का आयोजन उनके अपने देश में होगा लेकिन बीसीसीआई (BCCI vs PCB) के सामने पड़ोसी देश की एक नहीं चली. एसीसी मीटिंग से साफ हो गया है कि भारत पाकिस्‍तान में जाकर क्रिकेट नहीं खेलेगा.","content":"एशिया कप 2023 को होस्‍ट करने का अधिकार पीसीबी को मिला है. (Twitter/ICC) नई दिल्‍ली . एशिया कप (Asia Cup 2023) का होस्‍ट बनने की इच्‍छा पाले बैठे पाकिस्‍तान को बीसीसीआई ने करार झटका दिया है. बेहरनी में हुई एशियन क्रिकेट काउंसिल (Asian Cricket Council) की बैठक के दौरान बीसीसीआई (BCCI) ने पाकिस्‍तान क्रिकेट बोर्ड (PCB) को करार झटका दिया है. बीसीसीआई सचिव जय शाह (Jay Shah) की तरफ से पहले ही यह साफ कर दिया गया था कि भारत की टीम एशिया कप खेलने के लिए पाकिस्‍तान का दौरा नहीं करेगी. इस बात से भिन्‍नाए पाकिस्‍तान ने एशियन क्रिकेट काउंसिल से हटने की धमकी तक दे डाली थी. शनिवार को हुई एसीसी की ताजा बैठक के बाद अब एशिया कप ही नहीं बल्कि 2025 में पाकिस्‍तान में होने वाली चैंपियंस ट्रॉफी (Champions Trophy) के अस्तित्‍तव पर भी सवाल उठने लगे हैं. साल 2009 में पाकिस्‍तान की धरती पर श्रीलंका की टीम पर हुए आतंकी हमले के बाद करीब डेढ़ दशक तक पड़ोसी देश में अंतरराष्‍ट्रीय क्रिकेट प्रभावित रहा. धीरे-धीरे एक-एक कर अब सभी टीमें पाकिस्‍तान का दौर कर चुकी हैं. केवल भारत ही इकलौता ऐसा देश है जिसने पाकिस्‍तान का दौरा नहीं किया है. भारत और पाकिस्‍तान के बीच मौजूदा संबंधों को देखते हुए बीसीसीआई ने पाकिस्‍तान जानें से इनकार कर दिया. न्‍यूज एजेंसी पीटीआई की खबर के मुताबिक एसीसी की मीटिंग में यह साफ हो गया है कि पाकिस्‍तान एशिया कप का आयोजन नहीं करेगा. नए वेन्‍यू को लेकर अभी स्थिति स्‍पष्‍ट नहीं है. माना जा रहा है कि यूएई या फिर श्रीलंका में एशिया कप का आयोजन हो सकता है. Border Gavaskar Trophy में कौन है सबसे कंजूस गेंदबाज? बल्‍लेबाजों को नहीं बनाने देता रन…देखें टॉप-10 लिस्‍ट Shaheen Afridi Wedding : निकाह के बाद रोमांटिक हुए पाक पेसर….बेगम संग खिंचवाई इंटीमेंट तस्‍वीरें…आपने देखी क्‍या? चैंपियंस ट्रॉफी से भी हाथ धोएगा पाकिस्‍तान! आईसीसी ने साल 2025 में होने वाली चैंपियंस ट्रॉफी को होस्‍ट करने का अधिकार पाकिस्‍तान को दिया है. एसीसी में पाकिस्‍तान की हेकड़ी निकालने के बाद अब जय शाह आईसीसी के सामने भी पड़ोसी देश के क्रिकेट बोर्ड को चारो खाने चित कर देंगे. बीसीसीआई सचिव ने इसे लेकर प्‍लान भी बना लिया है. ऐसा होना ज्‍यादा मुश्किल नजर नहीं आता. बीसीसीआई दुनिया का सबसे अमीर क्रिकेट बोर्ड है. भारतीय टीम जहां जाकर खेलती है वहीं स्‍पॉन्‍सर्स की लाइन लग जाती है. भले ही अन्‍य सभी देश पाकिस्‍तान का दौरा कर चुके हों लेकिन अगर एक बार बीसीसीआई ने आईसीसी में अपनी ताकत दिखाई तो पड़ोसी देश से चैंपियंस ट्रॉफी छिनना भी तय है. हालांकि चैंपियंस ट्रॉफी के आयोजन में अभी दो साल का वक्‍त है. ब्रेकिंग न्यूज़ हिंदी में सबसे पहले पढ़ें News18 हिंदी| आज की ताजा खबर, लाइव न्यूज अपडेट, पढ़ें सबसे विश्वसनीय हिंदी न्यूज़ वेबसाइट News18 हिंदी| Tags: Asia cup , BCCI , ICC , IND vs PAK , India Vs Pakistan , Pcb चर्च के गलियारों में पनपा प्‍यार…शादी करते ही करियर ने पकड़ी रफ्तार…अब भारत को मात देने आया धाकड़ बल्‍लेबाज पाकिस्तान के क्रिकेटर ने कप्तान की बेटी से की शादी, दुनिया के कई खिलाड़ी हैं रिश्तेदार, कुछ का हुआ दर्दनाक अंत अमेरिका में आर्कटिक ब्लास्ट से हालात बदतर, -79 डिग्री ठंड से लॉकडाउन जैसी स्थिति, स्कूल बंद","pubDate":"2023-02-05 00:30:48","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/02/BCCI-vs-PCB-16755311483x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Pakistan cricket legend Wasim Akram ‘looking forward’ to launching Saudi cricket league","link":"https://www.arabnews.com/node/2244751/sport","keywords":null,"creator":["bassam.zaazaa"],"video_url":null,"description":"Sat, 2023-02-04 21:14 ISLAMABAD: Former Pakistan cricket captain Wasim Akram has said he is “looking forward” to launching a cricket league in Saudi Arabia following his trip to Riyadh this week. The Pakistani pacer issued the statement after meeting Saudi Arabian Cricket Federation Chairman Prince Saud bin Mishal to discuss the future of the sport in the Kingdom. Akram’s visit follows a recent strengthening of cricket ties between the two countries.Main category: SportCricket","content":"ISLAMABAD: Former Pakistan cricket captain Wasim Akram has said he is “looking forward” to launching a cricket league in Saudi Arabia following his trip to Riyadh this week. The Pakistani pacer issued the statement after meeting Saudi Arabian Cricket Federation Chairman Prince Saud bin Mishal to discuss the future of the sport in the Kingdom. Akram’s visit follows a recent strengthening of cricket ties between the two countries. Last month, Javed Afridi, who owns Pakistan Super League franchise Peshawar Zalmi, announced that his team will play exhibition matches in Saudi Arabia. Pakistan Cricket Board Chairman Najam Sethi also said last month that the South Asian country is willing to share its expertise in the sport with the Kingdom, where cricket’s popularity is growing rapidly. “What a trip to Riyadh,” Akram wrote in a Facebook post this week. “Had a great meeting with H.H. Saud (bin) Mishal, talked about cricket in Saudi Arabia, and so looking forward to (starting) a Saudi league insha Allah very soon.” Pakistan and Saudi Arabia have strong economic, defense and cultural ties. Last month, Pakistan women’s football team were runners-up in a four-nation tournament in the Kingdom. Since its establishment in 2020, the Saudi Arabian Cricket Federation has launched a series of major initiatives, including a national championship, a corporate tournament, a league for expatriate workers, and social programs in several cities. The ruling body oversees 15 official associations representing the sport in nine regions, and has announced plans to set up additional associations in the remaining regions to ensure cricket is played across the Kingdom.","pubDate":"2023-02-04 18:17:14","image_url":null,"source_id":"arabnews","category":["sports"],"country":["saudi arabia"],"language":"english"},{"title":"Pakistan unlikely to host Asia Cup, venue to be finalised in March","link":"https://www.dnaindia.com/cricket/report-pakistan-unlikely-to-host-asia-cup-venue-to-be-finalised-in-march-2023-3021527","keywords":["Sports","Cricket"],"creator":["DNA Web Team"],"video_url":null,"description":"The Asia Cup was initially allotted to Pakistan and was scheduled in September this year but ACC chairman Jay Shah had announced last October that India will not travel to Pakistan due diplomatic tension between the two nations.","content":"New Delhi: The Asian Cricket Council (ACC) is expected to shift Asia Cup from Pakistan and decide on an alternate venue in March as BCCI secretary Jay Shah and PCB chairman Najam Sethi discussed the issue during a formal meeting in Bahrain on Saturday. All heads of ACC member nations attended the emergent meeting which was called at the behest of Sethi after the continental body released its itinerary and Pakistan wasn't named the hosts for the Asia Cup. The Asia Cup was initially allotted to Pakistan and was scheduled in September this year but Shah, who is also the ACC chairman, had announced last October that India will not travel to Pakistan due diplomatic tension between the two nations. \"The ACC had a constructive dialogue on the upcoming Asia Cup 2023. The Board agreed to continue discussions on operations, timelines and any other specifics with a view to ensure the success of the tournament. An update on the matter would be taken on the next ACC Executive Board Meeting to be held in March 2023,\" ACC said in a statement. While a decision will come only next month, a senior BCCI official privy to the development told PTI that it is highly unlikely that Pakistan will host the tournament. \"With India deciding against travelling to Pakistan, the tournament will have to be shifted. A tournament without Virat Kohli, Rohit Sharma and Shubman Gill will have the sponsors back out,\" the official said. One ACC insider said Sethi has just taken over PCB and if he had ceded ground on the hosting rights in the first meeting itself, then it would have led to a bad impression at home. Pakistan is currently going through an economic crisis. The inflation has hit the country very hard as one USD is now equal to 277 Pakistani Rupee. Organising a high-profile tournament like Asia Cup, even if ACC pays a grant could burn a hole in PCB coffers. So strategically, if the tournament is held in the UAE, there is every possibility that all the member nations will also get to earn apart from the broadcast revenues. In another decision, the ACC has decided to increase the annual budget allocated for Afghanistan Cricket Association to 15 percent from six. The ACC has assured that it will help the Afghanistan board in all possible ways so that women's cricket can be revived in the country. Women are banned from playing sport under Taliban rule. The Executive Board also approved of the inclusion of teams from Japan and Indonesia in the ACC pathway tournaments to participate in the events as invitees.","pubDate":"2023-02-04 18:16:00","image_url":null,"source_id":"dnaindia","category":["sports"],"country":["india"],"language":"english"},{"title":"Harmanpreet keen to not let WPL buzz affect preparation for India vs Pakistan clash","link":"https://www.indiatoday.in/sports/cricket/story/womens-t20-world-cup-2023-harmanpreet-kaur-doesnt-want-focus-to-shift-from-india-pakistan-clash-amid-wpl-buzz-2330555-2023-02-04?utm_source=rss","keywords":null,"creator":null,"video_url":null,"description":"Harmanpreet keen to not let WPL buzz affect preparation for India vs Pakistan clash","content":": Skipper said that it’s necessary not to get carried away by the buzz surrounding the Women’s Premier League (WPL) auction amid India’s preparations for the upcoming Women’s T20 World Cup in South Africa. If reports are to be believed, the auction for the inaugural edition of the WPL is scheduled to take place on February 14. But prior to that, the Indian players will take part in an all-important World Cup match against Pakistan on February 12 at the Newlands in Cape Town. Harmanpreet, who is the only centurion in T20Is among Indian women’s cricketers, said that India are currently focussed on their match against Pakistan. \"Before that [the auction], we have a very important game and we are just going to focus on that,\" Harmanpreet was quoted as saying at the T20 World Cup captains' pressers. While welcoming the idea of the WPL, Harmanpreet said how the Women’s Big Bash League (WBBL) and the Women’s Hundred contributed to the growth of Australian and English cricket. \"It's a really big day for all of us because we have been waiting for years and years now. The next two or three months are very important for women's cricket. We have seen how the WBBL and the Hundred have helped their countries improve their cricket. Hopefully, the same will happen for our country,\" she stated. Harmanpreet also talked about her experience of plying her trade in the Kia Super League, WBBL and Women’s Hundred over the years. \"That is something which has a very different feeling. When I got that opportunity, it was the biggest life-changing moment. Other girls will also experience this. It will be a great opportunity to improve cricket and grow the game,\" Harmanpreet said. \"The World Cup is more important than anything else. Our focus is on the ICC trophy. These things will keep coming, and as a player, you know what's important for you and how you need to keep your focus. We are all mature enough and know what is important for us,\" she stated. Before the World Cup, India are also scheduled to lock horns with Meg Lanning’s Australia and Nigar Sultana Joty’s Bangladesh in two warm-up matches on February 6 and 8 respectively. India played the World Cup final last time around in 2020, but lost to Australia at the iconic Melbourne Cricket Ground (MCG).","pubDate":"2023-02-04 17:59:28","image_url":null,"source_id":"indiatoday","category":["sports"],"country":["india"],"language":"english"},{"title":"IND vs AUS Test Series: ऑस्ट्रेलिया के अभ्यास मैच नहीं खेलने के फैसले पर पूर्व भारतीय स्टार ने जताई हैरानी","link":"https://sports.ndtv.com/hindi/cricket/suresh-raina-surprised-by-australias-decision-not-to-play-warm-up-match-before-test-series-ndtv-hindi-ndtv-india-3753952#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"IND vs AUS Test: पूर्व भारतीय बल्लेबाज सुरेश रैना (Suresh Raina) को भरोसा है कि भारत चार टेस्ट मैचों की सीरीज में अच्छा प्रदर्शन करेगा और रविंद्र जडेजा (Ravindra Jadeja) की वापसी टीम में अच्छा संतुलन लाएगी.","content":"Australia Test Team पूर्व भारतीय बल्लेबाज सुरेश रैना (Suresh Raina) नौ फरवरी से नागपुर में शुरू हो रही बॉर्डर गावस्कर ट्रॉफी (Border Gavaskar Trophy) से पहले ऑस्ट्रेलियाई टीम के अभ्यास मैचों में खेलने के बजाय परिस्थितिजन्य अभ्यास करने के फैसले से काफी हैरान हैं. ऑस्ट्रेलियाई टीम इस समय बेंगलुरु में ट्रेनिंग कर रही है और उछाल लेती पिचों पर अभ्यास कर रही है और बड़ौदा के स्पिनर महेश पिथिया को गेंदबाजी के लिए बुलाया गया है जिनका गेंदबाजी एक्शन रविचंद्रन अश्विन (Ravichandran Ashwin) से मिलता है. लेकिन भारत के सफेद गेंद के बेहतरीन खिलाड़ियों में से एक रैना को लगता है कि ऑस्ट्रेलियाई टीम को इसकी कमी खलेगी. रैना ने 'पुलिस परिवार कल्याण सोसाइटी' द्वारा आयोजित 'मिशन ओलंपिक्स' सालाना दिवस मुलाकात के मौके पर कहा, \"मैंने टेस्ट से पहले अभ्यास मैच खेले हैं और ये सचमुच महत्वपूर्ण हैं. वे (ऑस्ट्रेलिया) भारत की पिचों को उन पर खेलकर ही समझ सकते हैं.\" रैना को भरोसा है कि भारत चार टेस्ट मैचों की सीरीज (IND vs AUS Test Series) में अच्छा प्रदर्शन करेगा और रविंद्र जडेजा (Ravindra Jadeja) की वापसी टीम में अच्छा संतुलन लाएगी. उन्होंने कहा, \"मैं लंबे समय के बाद जडेजा की वापसी से खुश हूं.\" रैना ने कहा, \"हमारे स्पिनर आर अश्विन, अक्षर पटेल अच्छा कर रहे हैं. विराट कोहली और रोहित शर्मा अच्छी फॉर्म में हैं और मुझे लगता है कि हमें एक अच्छी श्रृंखला देखने को मिलेगी.\" * * * पढ़ें , , राजनीति, देश और दुनिया की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-02-04 17:55:58","image_url":"https://c.ndtvimg.com/2022-07/l7hl4ct8_australia-cricket-team-afp_625x300_01_July_22.jpg?im=FitAndFill,algorithm=dnn,width=806,height=605","source_id":"ndtv_in","category":["sports"],"country":["india"],"language":"hindi"},{"title":"फाइनल में पर्थ स्कॉचर्स ने ब्रिस्बेन हीट को 5 विकेट से रौंदा, पांचवी बार टीम बनी चैंपियन","link":"https://navbharattimes.indiatimes.com/sports/cricket/cricket-news/bbl-perth-scorchers-beat-brisbane-heat-by-5-wickets-in-the-final-became-champions-for-the-fifth-time/articleshow/97609188.cms","keywords":null,"creator":null,"video_url":null,"description":"BBL Final: बिग बैश लीग 2022-23 के फाइनल में पर्थ स्कॉचर्स ने ब्रिस्बेन हीट को 5 विकेट से हराकर खिताब को अपने नाम कर लिया है। पर्थ की टीम पांचवीं बार लीग की चैंपियन बनी है। दोनों टीमों के बीच यह मुकाबला पर्थ में खेला गया था और टक्कर कांटे की हुई थी।","content":"बिग बैश लीग 2022-23 के फाइनल मुकाबले में पर्थ स्कॉचर्स ने ब्रिस्बेन हीट को 5 विकेट से हरा दिया। इसके साथ ही पर्थ की टीम ने लीग में पांचवी बार चैंपियन बनने का गौरव हासिल किया है। इस मुकाबले में ब्रिस्बेन ने पहले बल्लेबाजी करते हुए निर्धारित 20 ओवर के खेल में 7 विकेट के नुकसान पर 175 रन बनाए थे। इसके जवाब में पर्थ की टीम ने 19.2 ओवर में 178 रन बनाकर मैच को जीत लिया। पर्थ की इस जीत में कप्तान एश्टन टर्नर ने 53 रनों की विस्फोटक अर्धशतकीय पारी खेली। उन्होंने 32 गेंदों का सामना किया जिसमें 5 चौके और दो छक्के लगाए। इसके अलावा जोश इंगलिश ने 26 और कूपर कोलनी ने आखिरी में 25 रनों की महत्वपूर्ण पारी खेली। हालांकि पर्थ जब लक्ष्य का पीछा करने उतरी थी तो उसकी शुरुआत कुछ खास नहीं रही थी। टीम ने अपना पहला सिर्फ 32 रन के स्कोर गंवा दिया था। ओपनर बल्लेबाज स्टीफन स्केनाजी सिर्फ 21 रन बनाकर आउट हुए जबकि कैमरून बैनक्रॉफ्ट सिर्फ 15 रन का योगदान दे सके। हालांकि कप्तान एश्टन टर्नर ने एक छोर से पारी को संभाले रखा को टीम को जीत की दहलीज पर पहुंचा दिया। फाइनल मैच में पहले बल्लेबाजी करने उतरे ब्रिस्बेन हीट के ओपनर बल्लेबाज उम्मीद के मुताबिक टीम को शुरुआत नहीं दिला सके। ब्रिस्बेन ने सिर्फ 25 रन के स्कोर अपना पहला विकेट गंवा दिया। सैम हेजलेट ने जरूर पारी को संभाला और 34 रन बनाकर आउट हुए। इसके अलावा तीसरे नंबर पर बल्लेबाजी करने उतरे नाथन मैकस्वीनी ने 37 गेंद में 41 रनों की पारी खेली। मध्यक्रम में मैक्स ब्रायंट ने भी 31 रनों महत्वपूर्ण पारी खेली जबकि सैम हेन ने 16 गेंद में 21 रनों का योगदान दिया। पहले गेंदबाजी के लिए मैदान पर उतरी पर्थ के लिए जेसन बेहरनडॉर्फ और मैथ्यू केली ने दो-दो विकेट अपने नाम किए। इसके अलावा डेविड पायने, एरोन हार्डी और एंड्रयू टाय को भी एक-एक सफलता हासिल हुई थी।","pubDate":"2023-02-04 17:22:43","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"}]}