{"newsArray":[{"article_id":"4006e103a621310121346a212cc71f99","title":"SLC strongly rejects malicious allegations made by Sports Minister","link":"https://www.ft.lk/sports/SLC-strongly-rejects-malicious-allegations-made-by-Sports-Minister/23-755424","keywords":null,"creator":null,"video_url":null,"description":null,"content":"Sri Lanka Cricket (SLC) in a statement yesterday unequivocally rejected the baseless and malicious allegations made by Sports Minister Roshan Ranasinghe during a media conference held on Sunday. Following is the full statement of SLC. The SLC asserts that the Minister’s statements were tainted with malice and appeared to be orchestrated to instigate the public, creating undue influence on pending and emerging matters related to the affairs of SLC. The SLC notes with concern that Ranasinghe, in his capacity as the Minister of Sports, seems to lack a comprehensive understanding of the intricacies surrounding the affairs of the Parent Body and its affiliated members. Particularly noteworthy is the fact that the President of SLC, as a Director of the ICC (International Cricket Council) Board of Directors, is duty bound to respect and further the objectives outlined in clause 5 of the Memorandum of Association of the ICC. It is imperative to clarify that each ICC Director, including the President of SLC, has an obligation to apprise the status of SLC affairs when there are reasons to believe that impending actions by the Minister of Sports may jeopardise the fulfilment of obligations set out in the ICC’s Articles of Association. SLC emphasises that it has consistently acted in the best interest of the cricket administration in Sri Lanka, striving to address issues through constructive dialogue. Regrettably, these endeavours proved futile, given the continuous and unfounded criticism by the Minister of Sports, aiming to wield unwarranted influence over SLC through the misuse of authority. It is noteworthy to mention that despite lacking any vested authority, the Minister of Sports has taken the unprecedented step of communicating with the ICC and its full members, making false claims that SLC officials were involved in corruption and malpractices based on a special audit report. However, it is crucial to emphasise that the said audit report did not reveal any corrupt conduct or malpractice, and the ICC and its Members were well aware of the groundlessness of these allegations. Moreover, SLC believes that the Minister’s continuous appeal to the general public and repeated false allegations of corrupt conduct and malpractice by SLC officials appear to be driven by political motives, aimed at enhancing his public image. As a member of the ICC, SLC is obligated to comply with its paramount obligation outlined in Article 2.4 (D), which mandates that SLC must operate autonomously without Government interference. Nevertheless, it appears that the Minister of Sports, by contravening these ICC principles, is wilfully causing harm and irreparable damage to SLC. SLC wishes to emphasise that the ICC’s decisions are reached during board meetings comprising directors representing all full member countries. The ICC, being a reputable international organisation, approaches decisions with careful consideration, particularly those that could result in the suspension of a member. Contrary to any assertions implying that SLC sought its suspension from the ICC, we want to clarify that such allegations are without merit, and SLC is steadfast in its commitment to earnestly address and lift the suspension imposed by the ICC. While SLC focuses on resolving the suspension issue, it appears that the Minister of Sports is pursuing a different agenda through media manipulation, without pursuing legal avenues to address the allegations. This raises concerns about his intention to influence public opinion and other stakeholders to achieve his objective of taking control of SLC through the misuse of his powers. SLC calls for a fair and unbiased examination of the facts and remains focused on its mission to uphold the integrity of cricket in Sri Lanka and is confident that the truth will prevail in due course.","pubDate":"2023-11-20 19:41:45","image_url":null,"source_id":"ft_lk","source_priority":1390226,"country":["sri lanka"],"category":["sports"],"language":"english"},{"article_id":"9550822ea9bd3b8618d34a64c6518f0d","title":"Cummins and the ‘Sound of Silence’","link":"https://www.ft.lk/sports/Cummins-and-the--Sound-of-Silence-/23-755425","keywords":null,"creator":null,"video_url":null,"description":null,"content":"AHMEDABAD: The popular song by Simon and Garfunkel ‘The Sound of Silence’ was given a new twist by Australian captain Pat Cummins at the Cricket World Cup final when he actually silenced the more than one lakh of Indian supporters who had filled the Narendra Modi Stadium to witness an Indian victory on Sunday. Prior to the final, Cummins had gone on record to state: “In sport, there’s nothing more satisfying than silencing the home crowd. That’s the aim for us tomorrow.” Australia simply did just that, restricting India to 13 fours and three sixes in their entire innings as compared to the match-winning knock of 137 by Travis Head which comprised 15 fours and four sixes. No doubt the crowd was silenced and even if they had a brief opportunity of raising their voices when Australia lost their first three wickets for 47 runs, it was again stifled by Head in partnership with Marnus Labuschagne that produced 192 runs for the fourth wicket which all but snuffed any chance India had of making a comeback. As a matter of fact, Head and Labuschagne were initially not in Australia’s team plans in the initial stages. “Travis Head was phenomenal. I think I said it on stage, a lot of credit should also go to Andrew McDonald and George Bailey, the selectors, to take a punt,” said Cummins. “He had a broken finger, a broken hand for the half of the tournament, but to keep him in the squad was a huge risk. And the medical team were fantastic, obviously, to get him into a place where he could perform. That was a big risk. I think we could have been made to look really silly if that didn’t pay off, but you got to take those risks to win a tournament.” “And Trav, the player we’ve seen in Test cricket, he just epitomised everything I want out of a cricket team. He takes the game on, he plays with a smile, he just puts the pressure right back onto the opposition and he’s just great fun to be around. I couldn’t be happier for Trav.” And then Labuschagne who was initially not included in the Australian World Cup squad but was a last-minute inclusion. “Marnus just showed his class and in South Africa you had to pick him, he was fantastic and he was playing a different style to probably what he did for the first start of his ODI career and it was paying off and we know he’s a gun so you had to try and find room for him.” It was a gamble that Australia took with these two players and it paid off handsomely in the final allowing them to win it for a record sixth time. “That’s huge, I think that’s the pinnacle of international cricket, winning a one-day World Cup. Especially over here in India, in front of a crowd like this,” was how Cummins described the victory at the post-match media conference. “It’s the pinnacle because just every international team comes together. You only get a shot at it every four years. Even if you have a ten-year career, you might only get two chances at it. It’s just the whole cricket world stops with this World Cup. It doesn’t get any better.” “Just seeing the sea of blue, walking, making its way to the ground, all the cars parked with their selfie cameras out, you kind of knew you were walking into something pretty special. And then to walk out for the toss and just see 130,000 blue Indian shirts, it’s an experience you’ll never forget. Awesome day and the good thing was they weren’t too noisy for most of it.” “It’s been a big year for everyone, but our cricket team has been here in India, Ashes, World Test Championship and to top it off with this is just huge and these are the moments that you’ll remember for the rest of your life.” India’s Head Coach Rahul Dravid reflecting on his side’s defeat said, “I mean we were the favourites because we were playing well but I think you can recognise that Australia is also a very good cricket team. They also came here with eight wins on the bounce, so we were under no illusions that this was going to be a tough contest. We were confident that if we played well, we’d get the right result but unfortunately on the day they played better than us.” “There is disappointment in the dressing room, and there is disappointment among the boys and among the support staff. There were a lot of emotions. It was tough to see as a coach because I know how hard these guys have worked, what they’ve put in, the sacrifices they’ve made. So, it’s tough.” “But that’s sport. That happens. And the better team won on the day. I’m sure that the sun will come up tomorrow morning. We’ll learn from it. We’ll reflect. And we’ll move on, as will everyone else. That’s what you do as sportsmen. You have some great highs in sport, and you have some lows in sport. And you keep moving on. You don’t stop. Because if you don’t put yourself on the line, you don’t put yourself in games like these, you don’t experience the great highs. And neither do you experience the great lows. And if you don’t do that, you don’t learn.”","pubDate":"2023-11-20 19:41:45","image_url":null,"source_id":"ft_lk","source_priority":1390226,"country":["sri lanka"],"category":["sports"],"language":"english"},{"article_id":"7c478fecb10ce44947b437e5480d6923","title":"Cara Delevingne, Kylie Minogue and a race that ticked all the boxes… Viva Las Vegas!","link":"https://metro.co.uk/2023/11/20/cara-kylie-a-las-vegas-grand-prix-ticked-boxes-19852072/","keywords":["F1","Sport","Cara Delevingne","Carlos Sainz Jr","Charles Leclerc","Ferrari","Formula One","George Russell","Kylie Minogue","Las Vegas","Max Verstappen","Mercedes Motorsport","Metro newspaper","Red Bull Racing","Toto Wolff"],"creator":["Adam Hay-Nicholls"],"video_url":null,"description":"After a shaky start, Las Vegas delivered.","content":"After a shambolic start to the Las Vegas Grand Prix weekend, we were rewarded on Sunday with a fantastic race – albeit one that was won by Max Verstappen for the 18th time this year. My weekend was book-ended by seeing Nile Rodgers play all his hits at a gig on Wednesday, to having a deep and meaningful conversation on Sunday morning in a nightclub after the race with Cara Delevingne about her mother’s laundry (we share the same dry cleaner in Pimlico). This wouldn’t happen at Spa-Francorchamps. Once things really got going on Friday after an inauspicious beginning, whereby a loose manhole cover wrecked Carlos Sainz ’s Ferrari and fans who’d paid thousands to watch only saw eight minutes of action, we witnessed an unpredictable event which looked for a long time like the spoils would go to the Scuderia. Charles Leclerc started on pole and probably would have taken victory had it not been for a second safety car. Verstappen received a five-second penalty for forcing Leclerc off the road at Turn 1, telling the stewards on the radio ‘give them my regards’. Somehow, he came back to win despite his Red Bull suffering considerable damage from a contretemps with George Russell ’s Mercedes. And if anyone should have got a penalty for that, it’d should’ve been Max not George. Sergio Perez, who started 11th and lost his front wing at Turn 1, led for a time and it looked like he might win his first race since Azerbaijan in April. However, both Verstappen and, on the last lap, Leclerc were able to draft past. For the second time in a fortnight, Perez was the losing driver in a photo finish, but at least he got on the podium. In Las Vegas, after parking up in Parc Ferme, the top three drivers were put in a Rolls-Royce Phantom and whisked to the Bellagio hotel for their post-race interviews. It might have been awkward, had Verstappen not taken the middle seat between the Mexican and the Monegasque. It was also a fantastic weekend for Alpine, with Esteban Ocon finishing fourth. The Enstone team celebrated by visiting Kylie Minogue’s Las Vegas residency at the Wynn hotel, where my dry cleaning chat with Cara occurred. Leclerc, despite finishing second, was relieved the weekend had ended up a win for Formula One. He said: ‘I really enjoyed it. I think we needed it [to be a success]. Of course, the weekend didn’t start the way it had to start, but I’m so happy that it ended that way. It’s such an incredible sport.’ The organisers offered fans who had a ticket for Thursday’s practice sessions a $200 voucher to be used at its merchandise concessions. A local law firm has launched a legal action to pursue a refund to the tune of $30,000 per spectator. Toto Wolff, who’d got incredibly worked up earlier in the week when asked about Thursday’s track chaos, felt satisfied the weekend had ended on a positive note. ‘Lots of things that were said look a little bit out of proportion or too negative because we are leaving Las Vegas after a great weekend,’ said the Mercedes supremo. Young dad found dead in bed just weeks after welcoming second daughter Woman raped in church grounds while walking home from night out Phil Spencer's mum's cause of death after harrowing accident revealed ‘I think it will have increased the popularity of Formula One in the United States, for sure. There’s nothing negative I can find. The drain cover was nothing, like I said. When I look back; a spectacular race, great audiences, a mega event and some good racing at the front. That is what I will remember of the inaugural Las Vegas race that ticked all the boxes.’ I put it to Carlos Sainz Jr that it was madness he was given a ten-place grid penalty when it was the track that was at fault for destroying his car during Thursday’s FP1, not Ferrari, when he hit a loose manhole cover on Las Vegas Boulevard. ‘When you put it like that, the thing speaks for itself, no?’ he said, with tears in his eyes. ‘There was clearly a safety issue at the track. That safety issue destroyed my car. My mechanics invested five hours in putting together a completely new car. I’m extremely disappointed and just upset and in a bad mood because I expected more from the sport.’ Apparently, it was Mercedes who objected to Ferrari getting a free pass for a battery change, due to the two constructors being so close in the championship, despite it being a case of force majeure. The prancing horse’s team principal, Fred Vasseur, was furious with the FIA and his old friend, Toto Wolff. ‘It’s not an easy one, to give a set of tyres or to give an engine, because it’s a gain of performance,’ he said. ‘But the battery? There is no performance into the battery.’ The accident cost, according to Vasseur, ‘millions’, and the Scuderia intends to have a ‘private discussion’ with the governing body to recoup its losses, which could impact its budget cap. ‘There will be a discussion,’ confirmed Fred. ‘The decision, it’s another thing.’ There is a precedent for the FIA paying out in events like this: they paid compensation to Haas in 2017 after Romain Grosjean hit a drain cover at the Malaysian Grand Prix. MORE : Ronnie O’Sullivan offers intense look into his world with The Edge of Everything MORE : Shane Warne’s Travis Head prediction resurfaces after Australia win Cricket World Cup final","pubDate":"2023-11-20 19:37:18","image_url":null,"source_id":"metro","source_priority":1797,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"d9ea9cf1d2e1f679c8c36e88a73ec3fe","title":"North Macedonia vs England - Euro 2024 qualifier: Live score, team news and updates as Rico Lewis makes his first start for Three Lions with Gareth Southgate resting Harry Kane and selecting an exciting midfield trio","link":"https://www.dailymail.co.uk/sport/live/article-12770953/North-Macedonia-vs-England-Euro-2024-qualifier-Live-score-team-news-updates-Rico-Lewis-looks-set-make-start-Gareth-Southgates-side.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Follow Mail Sport's live blog for the latest score, team news and updates as England take on North Macedonia in Eur 2024 qualifying action.","content":"LIVE North Macedonia vs England - Euro 2024 qualifier: Live score, team news and updates as Rico Lewis makes his first start for Three Lions with Gareth Southgate resting Harry Kane and selecting an exciting midfield trio By Spencer Morgan For Mailonline Published: 17:58, 20 November 2023 | Updated: 19:17, 20 November 2023 e-mail 13 View comments Advertisement Follow Mail Sport's live blog for the latest score, team news and updates as England take on North Macedonia in Eur 2024 qualifying action. 19:14 30 minutes to kick-off The players are out for the warm-ups and there's not long to go now.... 19:01 Walker captain for the first time 18:50 Ready to round off qualifying Gareth Southgate's men have already secured top spot in Group C with six wins and one draw from their first seven matches. They beat North Macedonia 7-0 in the return of this fixture and have to be fancied to end this campaign on a high. 18:36 England team news Rico Lewis does get his chance as expected with Ollie Watkins up top. Foden, Rice and Alexander-Arnold make up an exciting midfield with Grealish and Saka on the wings. 18:23 The Three Lions have arrived 18:12 England set to start with exciting midfield trio of Alexander-Arnold, Rice and Foden England will test out a new-look midfield against North Macedonia tonight that will feature Trent Alexander-Arnold, Declan Rice and Phil Foden. Three Lions manager Gareth Southgate has previously been criticised over his reliance on choosing a more defensive midfield but is set to take the handbrake off tonight. England set to start exciting midfield trio against North Macedonia England will test out a new-look midfield against North Macedonia tonight that will feature a trio of Premier League talent in the forms of Trent Alexander-Arnold, Declan Rice and Phil Foden. Mail Online 18:09 Tonight's arena 18:07 Kane rested, Watkins in England captain Harry Kane is rested for this one with Ollie Watkins getting his chance to impress. 18:02 Good evening! And welcome to Mail Sport's live coverage of North Macedonia vs England. Team news to follow with kick-off at 7.45pm. TOP STORIES England Euro 2024 squad: Raheem Sterling, Mason Mount and Reece James among the stars sweating on their places Man City teenager Rico Lewis set to START England's Euro 2024 qualifier against North Macedonia, with Gareth Southgate ready to hand rising star his full senior debut after Kieran Trippier's withdrawal Gareth Southgate CAN call upon both Trent Alexander-Arnold and Jude Bellingham in his England starting XI, Chris Sutton argues on It's All Kicking Off - but Liverpool star must be tested in new midfield role against top sides England start with an exciting midfield trio of Trent Alexander-Arnold, Declan Rice and Phil Foden against North Macedonia as Harry Kane is rested Ollie Watkins names an Arsenal legend as the best Premier League striker ever... but there was no space for Wayne Rooney in the Aston Villa star's greatest forwards list Are you the ultimate football fan? Do you recognise these England stars from when they were young? Jack Grealish hailed as a 'humble' after the star speaks to an England supporter in a wheelchair following the Three Lions win over Malta... despite not featuring at Wembley GRAEME SOUNESS: England CAN win the Euros - if only Gareth Southgate is bold enough to take off the handbrake and make them feel they have no one to fear No call-up for your country? Time for a real 'international break'! Stars jet off on holiday with no Premier League games for two weeks... as Thiago Silva returns to Brazil and Loris Karius and his TV host partner head for Dubai Jarrod Bowen becomes the SEVENTH England star to withdraw from Gareth Southgate's squad - as he picks up a training injury ahead of Monday's clash with North Macedonia Jarrod Bowen's knee injury is NOT as bad as first feared after West Ham star pulled out of England squad to face North Macedonia... with the Hammers hoping he won't be sidelined by the issue Formula 1 - Las Vegas Grand Prix RECAP: Max Verstappen wins thrilling Sin City race after multiple safety cars and retirements Harry Kane reveals the best defender he's ever faced, the Germany star he wished played for England and why Eric Dier is the worst team-mate to sit next to on a flight CRAIG HOPE'S POSTCARD FROM SKOPJE: Stray dogs, jugglers and pirate ships... just avoid the taxis! Gareth Southgate insists England can NOT take their foot off the gas despite already qualifying for Euro 2024... as Three Lions boss challenges his side to become No.1 rank in the world Lionesses trio Leah Williamson, Mary Earps and Chloe Kelly join Gary Lineker, Ian Wright and Alex Scott at glamorous GQ Men of the Year Awards Rico and Rice... and all things nice! Young guns relish England away day which is far cry from David Beckham death threats 20 years ago LAWRENCE BOOTH: Cricket World Cup highs and lows after Australia beat India to snatch international glory Chelsea and England star Cole Palmer admits he 'can't stop seeing' viral video of him singing Jamaican reggae dancehall song, as he opens up on his West Indies roots Jorginho must 'bow down' and stop taking penalties insists former Italy World Cup winner who slams the Arsenal midfielder's latest missed spot-kick and insists 'enough is enough' THE SHARPE END: England's drab performance against Malta bores fans into making paper planes and Trent Alexander-Arnold shines Marcus Rashford has often turned to England for solace from his Man United woes... but it didn't work against Malta and he faces a growing challenge for a Euro 2024 place Benjamin Mendy launches a 'multi-million pound' lawsuit against Man City for unpaid wages after they stopped his £100,000-per-week salary when he was charged with rape and sexual assault - before he was cleared David Beckham's ex-England manager Glenn Hoddle defends himself against Victoria and Becks' mum's scathing attack on him on Netflix, after Sandra said Three Lions boss is on her 'hit list' Man City wonderkid gives Brazil a taste of their own medicine in the Under 17 World Cup as Joel Ndala showcases his talents for the Young Lions in hard-fought defeat Former Premier League star reveals he is BANNED from UK golf course that costs £100,000 to be a member after drunken incident earlier this year Travis Kelce's mom Donna 'still berates herself' over Taylor Swift comment on The Today Show... despite her son immediately calling to tell her she did a 'super job' EXCLUSIVE: Naomi Osaka dreamed she would LOSE matches to end her tennis career and wanted to 'buy a farm and grow crops instead,' new biography claims India vs Australia - Cricket World Cup final: Aussies clinch SIXTH title as Travis Head hits incredible century to stun hosts India and give Pat Cummins his greatest moment as captain England boss Gareth Southgate voices concerns over pitch for Euro 2024 qualifier in North Macedonia, but he insists he won't take any chances with his players EXCLUSIVE: Tottenham are unhappy with Everton's 'absurd' claim that their £60m Richarlison deal caused them to breach Premier League spending rules - with their hopes of waiving £10m fee for Dele Alli now in jeopardy Travis Kelce warned about 'stagey and fake' Taylor Swift by Skip Bayless, who claims their kiss after her Eras show in Argentina was 'exaggerated': 'She's just painfully camera aware' Tiger Woods and Rory McIlroy delay launch of The Golf League by a YEAR after roof of custom-built venue in Florida COLLAPSED Michael Vaughan slams India for not staying out on the pitch to see Australia lift the World Cup... but former England captain later deletes social media post Andros Townsend makes surprising admission about Man United as he likens them to Jurgen Klopp's Liverpool... and Luton star picks out two of Erik ten Hag's players for special praise Mohamed Salah is escorted off by military officers and protected by his Egypt team-mates - as pitch invaders target Liverpool star during 2-0 win over Sierra Leone Travis Kelce and Taylor Swift's families 'could spend Thanksgiving TOGETHER' at his new $6million Kansas City mansion... despite the singer missing his game against brother Jason tonight due to rescheduled Eras date How Europe's FIFTH-WORST team - ranked 157th in the world - can qualify for Euro 2024 tonight... with just one win needed to make it to Germany despite only two victories and a goal a game so far Man United news RECAP: Erik ten Hag 'sets priority on defensive reinforcements' as club are linked with summer target Jean-Clair Todibo How much will Australia earn for winning the ODI World Cup? And what was England's total prize money following their disastrous title defence in India? F1 racing DOES belong in Sin City (despite an embarrassing start), Oscar Piastri is the real deal for McLaren and Lewis Hamilton is miles away from another race win - never mind a title! SIX THINGS WE LEARNED from the Las Vegas Grand Prix Man United are mocked by rival fans that Old Trafford is falling down. And on the day Mail Sport visit, the stench of decay after 18 years of Glazer rule is overwhelming Travis Kelce admits it has been 'f***ing mind-blowing' seeing how smart girlfriend Taylor Swift is... as he says he is 'learning' from her every day - and gushes that she is a GENIUS San Marino have only ever won ONE game, lost 195 matches and scored 30 goals in 37 years... they are the worst ranked side according to FIFA - but in other ways, they might just be the best team in the world Jason McAteer challenges 'salty' Roy Keane to a BOXING match as the Man United legend reignited their long-running feud last week... after saying his Ireland team-mate 'deserved' being elbowed in infamous 2002 clash Arsenal manager Mikel Arteta picks his dream five-a-side team which includes NO goalkeepers or defenders with Lionel Messi his 'number one choice' in a line-up full of attackers Part of Old Trafford's concrete ceiling falls on Manchester United supporters during derby as the state of the once iconic stadium falls further into disrepute Why Aussie cricket stars were BANNED from enjoying one of their biggest traditions after their stunning World Cup win over India Steven Gerrard changes his mind on the GOAT debate... picking Cristiano Ronaldo as the world's greatest player - a year after he named Lionel Messi as his No 1 UFC star Ailin Perez makes her OnlyFans account free to celebrate her win over Lucie Pudilova... after she capped off her victory at UFC Vegas 82 by TWERKING EXCLUSIVE: Lionel Messi's World Cup match shirts - including the kit he started iconic final against France in - set to sell for £8MILLION at auction... and it could overtake Michael Jordan for the memorabilia world record South Africa Rugby World Cup winner dies in a car accident, aged 58, after a 'collision with a taxi' in his homeland 'What was he trying to do?': Baffled fans question why Kai Havertz shielded the ball out of play for a throw-in immediately after he controlled it during Germany's defeat to Turkey Hosts India had it all in their favour in the World Cup final - the best batter, the best bowler and a 'home pitch' - but they blew it Ronnie O'Sullivan reveals his dad's parting message before being handed a life sentence for murder, as his mum recalls her son 'screaming down the phone' in a Thailand hotel room after finding out he was in prison Arsenal legend Gilberto Silva offers advice to Gunners as they consider signing a midfielder in January due to Thomas Partey's injury issues Tony Bellew reveals family tragedy just hours before heading into I'm A Celebrity jungle... as he pays heartfelt tribute to 'the boss of our house' before Sunday's opening episode Travis Kelce FINALLY opens up on his love life with 'hilarious' Taylor Swift... from first dates in New York to drunkenly singing 'Teenage Dirtbag' together... and how his friends begged him: 'Don't f*** this up!' West Ham star among three players sent home from international duty after partying in a nightclub less than 48 hours before crunch Euro 2024 qualifier Taylor Swift won't be at Chiefs vs. Eagles on Monday - where her parents 'are set to meet Travis Kelce's mom and dad' - after rescheduling Rio tour date due to extreme heat, a day after a fan died before a show Pat Cummins is caught up in VERY embarrassing scenes during 'the most awkward trophy presentation ever' at the World Cup Bill Burr defends his 'hilarious' wife over Donald Trump controversy after she was seen giving the former US President a double bird at UFC 295: 'Can we all be adults?' Roberto Firmino's father tragically dies after suffering a heart attack during family trip to Dubai - shortly after the former Liverpool star was pictured with relatives at an amusement park Kylian Mbappe beats Lionel Messi, Cristiano Ronaldo and Neymar to landmark record as PSG forward nets another hat-trick in France's 14-0 win against Gibraltar Travis Kelce drops his clothing line collab' with the Chiefs ahead of Monday Night Football showdown against Eagles... and fans love it: 'On his business era' Travis Kelce joins Patrick and Brittany Mahomes for an early Thanksgiving dinner in Kansas City - as girlfriend Taylor Swift reschedules a Brazil tour date after a fan died in extreme heat Former LSU guard Alexis Morris sounds off on star player Angel Reese amid tension with coach Kim Mulkey: 'I never cared about likes, media, NIL' Rugby race shame as pundit and former England wing Ugo Monye says fan shouted 'N***a, N***a' at him during Premiership match at Exeter, with club launching probe into incident Australia win the Cricket World Cup AGAIN! Travis Head hits incredible century to stun India and give Pat Cummins his greatest moment as captain Manchester United legend looks almost unrecognisable as he joins fellow former Red Devils for match against World XI side Female fan is captured snorting white powder in the stands during halftime of a Colombian soccer game EXCLUSIVE: Germany legend Lothar Matthaus hails Harry Kane and Jude Bellingham as he tips England for a Euros charge… and reveals what he said to Chris Waddle after THAT penalty miss Tom Aspinall stuns female interviewer by grimly asking sexual questions in a crude interview days after his UFC heavyweight title win Patrick Mahomes is adamant that his Chiefs 'brother' and teammate Travis Kelce's romance with Taylor Swift is NOT a 'distraction' to the NFL Moment Virat Kohli and Marnus Labuschagne share INTENSE staredown during Cricket World Cup final with Australia vs India on a knife edge EXCLUSIVE: Everton face a further NINE-POINT deduction - and almost certain relegation - with Toffees set to be plunged into administration if Burnley, Leicester and Leeds are successful with £300m compensation claim against Toffees Cristiano Ronaldo's watch obsession has EXPLODED since his Saudi move as he dishes them out as gifts - but will he ever eclipse the £1.6MILLION timepiece from his Juventus days? Indian fans at World Cup final are slammed for 'deeply embarrassing' treatment of Aussie stars as they stormed to victory Jets legend Joe Namath is accused of allowing child sex abuse by well-known prep school coach to take place at his football camp Manchester United are 'lining up a move for a former Barcelona centre-back' as Erik ten Hag 'sets priority on signing defensive reinforcements' amid growing injury issues Tyson Fury backs both Anthony Joshua and Deontay Wilder to LOSE their heavyweight clashes on the 'Day of Recknoning' in Saudi Arabia next month - as the Gypsy King shares his thoughts on the star-studded card Taylor Swift grew up a Philadelphia fan and wore an Eagles sweater only a few months ago... now her loyalty will be tested when boyfriend Travis Kelce takes on her family's team on Monday Arise King Kane! Harry has become an instant favourite at Bayern Munich as the England captain's goalscoring exploits show no signs of slowing down on the continent David Beckham and Shaquille O'Neal lead the stars out in force for Las Vegas GP - while influencer Veronika Rajek leaves little to the imagination with her outfit and TikToker Alix Earle hits the paddock CHRIS FOY: Why Maro Itoje losing his marquee status to Owen Farrell opens up a real can of worms... with England lock facing 50% pay cut and clubs in France and Japan ready to pounce Alabama freshman Ty Simpson DROPS the ball as he goes to celebrate a 79-yard run through to the end zone... forcing officials to overturn his touchdown in win vs UT Chattanooga Buffalo Bills safety Taylor Rapp is carted off the field in an ambulance after stumbling and falling to the ground following terrifying collision with teammate Taron Johnson The Caribbean connection: Cole Palmer's grandad reveals his family's journey from St Kitts to Manchester… and how the Chelsea star's musical roots run beyond rapping on TikTok England Football Gareth Southgate Share or comment on this article: North Macedonia vs England - Euro 2024 qualifier: Live score, team news and updates as Rico Lewis makes his first start for Three Lions with Gareth Southgate resting Harry Kane and selecting an exciting midfield trio e-mail It's so exciting! And I really hope that Gareth So... by hunkeydorey 13 Add comment Comments 17 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-11-20 18:50:50","image_url":"https://i.dailymail.co.uk/1s/2023/11/20/18/78031875-0-image-a-19_1700505606181.jpg","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"5c876b1cb465c548acf7c74da5dc5f89","title":"India's Cricket Is In Good Place: Wasim Akram","link":"https://sports.ndtv.com/cricket/indias-cricket-is-in-good-place-wasim-akram-4590848","keywords":null,"creator":null,"video_url":null,"description":"Australia ended India's run in the final with a six-wicket victory to extend their dominance in the tournament.","content":"The Pakistan cricket fraternity showered the Indian team with praise for their incredible run to the final of World Cup, with the legendary Wasim Akram saying their cricket \"is in a good place\" despite the loss to Australia in the title clash. Australia ended India's run in the final with a six-wicket victory to extend their dominance in the tournament. \"Obviously they must be shattered to lose the final but in cricket these things happen. India had one bad day, and unfortunately, it came in the final,\" Akram said. \"You look at their structure, the money for players, the well thought out programs and the back up talent and they really just need to continue doing these things. Their cricket is in a good place,\" he added. Akram said as a former player he knows how mentally tough the Australians are in knockout match. \"I was captain when we played them in the 1999 World Cup final and although we had beaten them in the league stage, in the final they were a different side just like yesterday in Ahmedabad.\" Some, like former Pakistan wicketkeeper Rashid Latif , felt the Indian team was in no way inferior to the Australians. \"Maybe it is just a psychological thing with the Indian players. This team was worthy of winning the World Cup final but all credit to the Australians for showing once again how mentally tough and organised they are in their sports,\" Latif said. Latif termed seamer Mohammad Shami's bowling in the World Cup as outstanding. \"You look at the way he has come up and done so well. He was in my opinion the standout player for India in this World Cup.\" Pakistan's former captain Misbah ul Haq felt that the Australians had read the pitch better than the Indians and the toss proved vital. \"A side batting first required over 300 on this pitch to defend it,\" he said. Misbah also praised Rohit Sharma and Virat Kohli for leading by example throughout the tournament. Advertisement \"I think the younger players must have learnt a lot from these two in the dressing room and otherwise in this World Cup.\" Former players Basit Ali and Kamran Akmal believed that it was time for India to start focussing on building a T20 side for next year's World Cup. \"...But it will be difficult for the Indian selectors to not consider Rohit, Virat or Jadeja for the series in South Africa or even the Champions Trophy in 2025,\" Basit said. Former batsman Mohsin Khan said that Pakistan must learn from how India and Australia had adapted themselves to the requirements of modern day cricket, especially in the World Cup. \"Instead of looking at India's defeat we must appreciate the fact that this year they have already played in two ICC finals, losing both times to Australia. They are doing something right.\"","pubDate":"2023-11-20 18:45:45","image_url":null,"source_id":"ndtv","source_priority":1204,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"5b11016e505d4bcbd951ce5cc8da1a57","title":"Australia's Mitchell Marsh Celebrates World Cup Win With Father Geoff","link":"https://sports.ndtv.com/cricket/2023-and-1987-australias-mitchell-marsh-celebrates-world-cup-win-with-father-geoff-4590829","keywords":null,"creator":null,"video_url":null,"description":"Mitchell Marsh had a solid Cricket World Cup. In 10 matches, Marsh scored 441 runs at an average of 49.00, with a strike rate of over 107","content":"Australian all-rounder Mitchell Marsh expressed happiness with his team's ICC Cricket World Cup title win, posting a picture with his father, legendary batter Geoff Marsh who has also lifted the gold with Aussies back in 1987. Marsh took to Instagram to post a picture of him holding the trophy with his father. \"2023 and 1987,\" said the caption of Marsh's story. Mitchell Marsh had a solid Cricket World Cup. In 10 matches, Marsh scored 441 runs at an average of 49.00, with a strike rate of over 107. He scored two centuries and a fifty in the tournament, with the best score of 177*. He ended up as the tenth-highest run-scorer in the tournament and also took two wickets. The all-rounder also won the 2015 Cricket World Cup with Australia. In that tournament, he featured in just three matches, scoring 31 runs with the best score of 23. He also took five wickets in the tournament, a five-wicket haul against England. Geoff was also the star of the 1987 World Cup winning team, ending as the third-highest run-scorer with 428 runs in eight matches at an average of 61.14, with two centuries and a fifty. His best score was 126*. Coming to the match, Australia opted to bowl first and bundled out India for 240 in 50 overs. Skipper Rohit Sharma (47 in 31 balls, with four boundaries and three sixes), Virat Kohli (54 in 63 balls, with four boundaries) and KL Rahul (66 in 107 balls, with one four) posted important knocks. Mitchell Starc (3/55) was the pick of the bowlers for Australia. Skipper Pat Cummins (2/34) and Josh Hazlewood (2/60) also bowled well. Adam Zampa and Glenn Maxwell got a wicket each. Defending 240, India started off really well and had the Aussies down at 47/3. Knocks from Travis Head (137 in 120 balls, with 15 fours and four sixes) and Marnus Labuschagne (58 in 110 balls, with four boundaries) left the Indian team without answers and guided Australia to a six-wicket win. Mohammed Shami took one wicket while Jasprit Bumrah took t","pubDate":"2023-11-20 18:23:10","image_url":null,"source_id":"ndtv","source_priority":1204,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"2e861fc0f83ebcafedcb6971a45dab6f","title":"Pakistan unveil Shan Masood-led Test squad for Australia tour, eye fresh start after disappointing World Cup","link":"https://www.firstpost.com/firstcricket/sports-news/pakistan-unveil-shan-masood-led-test-squad-for-australia-tour-eye-fresh-start-after-disappointing-world-cup-13409952.html","keywords":["First Cricket News"],"creator":["Amit Banerjee"],"video_url":null,"description":"Pakistan unveil Shan Masood-led Test squad for Australia tour, eye fresh start after disappointing World Cup","content":"Cricket Pakistan unveil Shan Masood-led Test squad for Australia tour, eye fresh start after disappointing World Cup Top-order batter Masood replaced Babar Azam as Test skipper following Pakistan's disappointing run in the recently-concluded World Cup, where they failed to reach the semi-finals after losing five out of nine matches. Agence France-Presse November 20, 2023 23:23:50 IST File image of newly-appointed Pakistan Test captain Shan Masood. AP Lahore : Under a new skipper in Shan Masood, Pakistan on Monday named a squad of fresh faces for a tough tour of Australia starting next month, seeking a fresh start after a disastrous World Cup campaign. Following the World Cup where Pakistan lost five of their nine matches and finished fifth, the country’s cricket board overhauled the national team, with Babar Azam resigning as captain of all three formats. Team director Mickey Arthur and head coach Grant Bradburn have been removed from their positions with former skipper Mohammad Hafeez taking over both their roles. Related Articles World Cup 2023: 'Qudrat Ka Nizam' doesn't come to rescue as Pakistan miss out on semis yet again World Cup 2023: Pakistan cricket team arrive in Lahore after dismal campaign; Watch Masood was given the reins of the Test captaincy while Shaheen Shah Afridi was appointed Twenty20 captain. 🚨 SQUAD ANNOUNCED 🚨 Our 18-member squad for the three-match Test series against Australia 🇵🇰 Read more ➡️ https://t.co/eHP9NXPkOu #AUSvPAK | #BackTheBoysInGreen pic.twitter.com/ioKnv0cBxJ — Pakistan Cricket (@TheRealPCB) November 20, 2023 Wahab Riaz, another former fast bowler, was appointed chief selector following Inzamam-ul-Haq’s resignation and stressed performers in domestic competition were chosen for the three-match Test tour. “Australia is always a tough tour but we think that these players have the capability and capacity to not only do well, but come out winners.” Pakistan have performed poorly in Australia, however, losing 14 Tests on the trot with a last success in 1995. The series starts with the first Test in Perth (14-18 December) followed by the Boxing Day Test in Melbourne (26-30 December) and Sydney (3-7 January). Uncapped fast bowler Khurram Shahzad is rewarded for being the highest wicket-taker in the country’s premier First-Class tournament this year with 36 wickets. Dashing left-hander Saim Ayub and all-rounder Aamer Jamal have represented Pakistan in Twenty20 internationals but are untested in the five-day format. Shaheen is the only fast bowler to have played in Australia, while Naseem Shah was not considered as he was still recovering from a shoulder injury that ruled him out of the World Cup. Squad : Shan Masood (captain), Aamer Jamal, Abdullah Shafique, Abrar Ahmed, Babar Azam, Faheem Ashraf, Hasan Ali, Imam-ul-Haq, Khurram Shahzad, Mir Hamza, Mohammad Rizwan, Mohammad Wasim, Noman Ali, Saim Ayub, Agha Salman, Sarfaraz Ahmed, Saud Shakeel, Shaheen Shah Afridi Join our Whatsapp channel to get the latest global news updates Published on: November 20, 2023 23:23:50 IST Tags: Australia Vs Pakistan Cricket Pakistan Cricket Team Shan Masood","pubDate":"2023-11-20 17:53:50","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2020/08/Shan-Masood-ton-ENGvPAK-1st-Test-640-photopost_AP.jpg","source_id":"firstpost","source_priority":5906,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"39c807057c3cc039dd1ce01b2c2bdfb1","title":"Indian pacers’ workload to be carefully managed during hectic winter schedule: Paras Mhambrey","link":"https://www.firstpost.com/firstcricket/sports-news/indian-pacers-workload-to-be-carefully-managed-during-hectic-winter-schedule-paras-mhambrey-13409962.html","keywords":["First Cricket News"],"creator":["Amit Banerjee"],"video_url":null,"description":"Indian pacers’ workload to be carefully managed during hectic winter schedule: Paras Mhambrey","content":"Cricket Indian pacers’ workload to be carefully managed during hectic winter schedule: Paras Mhambrey India have a hectic schedule this winter with two Tests in South Africa in December-January followed by five games against England at home between January and March. Press Trust of India November 20, 2023 23:09:13 IST Jasprit Bumrah and Mohammed Shami played key roles in India's run to the final of the 2023 ICC World Cup, with the latter finishing at the top of the wicket-takers' list. AP Ahmedabad : The Indian pacers’ workload will have to be carefully monitored during the upcoming World Test Championship series against South Africa and England comprising seven Tests, said bowling coach Paras Mhambrey India will play a two-Test series in the Rainbow Nation in December-January, followed by five games against England at home between January and March. Shami (24 wickets in 7 games, 48.5 overs), Bumrah (20 wickets, 11 games, 91.5 overs) and Siraj (14 wickets, 82.3 overs, 11 games) did a lot of bowling in the World Cup. They have been on the road since Asia Cup in August-September. Related Articles World Cup 2023: We have the right bowlers to exploit different conditions, says India bowling coach Paras Mhambrey World Cup 2023: Why current Indian bowling unit is among the greatest ever at showpiece event “We will have to be very smart with the way we go forward in terms of managing the workload. These guys have played a lot of cricket, so we need to see how we want to go about it. “We haven’t discussed it yet,” Mhambrey, whose contract also ended with World Cup, said during an interaction with reporters in mixed zone on Sunday. Mhambrey has had a quiet yet impactful back-room presence as he devised strategies with the pace unit for various oppositions. It will be interesting to see what will be Bumrah’s take on Test matches and whether his body will hold the rigours of the five-day game. “We missed Bumrah for a major part, and you see the difference he brings when he is in the side. The way he has gone in this tournament especially, it’s massive. “It has been challenging, but looking at the other side of it, it has also been an opportunity for us to work on the bench-strength,” the former Mumbai and India seamer said. While the Indian team has a fantastic front-line of pacers, Mhambrey is also excited about the next crop. “There is Mukesh (Kumar), Prasidh (Krishna), Avesh (Khan) and Kuldeep (Sen). I would look at it that way,” Mhambrey said. The bowling coach termed Shami’s wicket-taking spree as incredible despite not playing the first four games. “He (Shami) was incredible. He obviously hadn’t played the initial games, but the way he came back and bowled throughout the tournament was incredible. “That’s not something we expected, but we always knew that he always has that positive impact on the game. He has been phenomenal,” Mhambrey said. Join our Whatsapp channel to get the latest global news updates Published on: November 20, 2023 23:09:13 IST Tags: Cricket Indian Cricket Team Paras Mhambrey","pubDate":"2023-11-20 17:39:13","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/10/Jasprit-Bumrah-Mohammed-Shami-IND-ENG-WC-AP-640.jpg","source_id":"firstpost","source_priority":5906,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"80076dd40b2361ef95402c946c553e84","title":"Sport | Proteas World Cup ratings: Karate Kid kicks a record-breaking punch, Bavuma battles","link":"https://www.news24.com/sport/cricket/worldcup/proteas-world-cup-ratings-karate-kid-kicks-a-record-breaking-punch-bavuma-battles-20231120","keywords":null,"creator":null,"video_url":null,"description":"The Proteas delivered a heartening World Cup campaign that culminated in a semi-final loss that was much more than what was expected of them before the tournament started. News24 Sport runs the rule over each squad member's campaign.","content":null,"pubDate":"2023-11-20 17:31:23","image_url":"https://cdn.24.co.za/files/Cms/General/d/9592/015f9deb3e344c788328465cc42f8608.jpg","source_id":"news24","source_priority":1882,"country":["south africa"],"category":["sports"],"language":"english"},{"article_id":"78f3bafc41bba5187ddb77cfca43a08c","title":"World Cup 2023: From Babar Azam to Jos Buttler, top players who flopped in showpiece event","link":"https://www.firstpost.com/firstcricket/sports-news/world-cup-2023-from-babar-azam-to-jos-buttler-top-players-who-flopped-in-showpiece-event-13408112.html","keywords":["First Cricket News"],"creator":["PN Vishnu"],"video_url":null,"description":"World Cup 2023: From Babar Azam to Jos Buttler, top players who flopped in showpiece event","content":"Cricket World Cup 2023: From Babar Azam to Jos Buttler, top players who flopped in showpiece event There were a few players who flopped as well in the showpiece event. With the 13th edition of the ODI World Cup done and dusted, let’s now take a look at some top flops from the event. FirstCricket Staff November 20, 2023 22:59:16 IST Pakistan's captain Babar Azam managed just 320 runs from nine matches in the 2023 World Cup. AP He just-concluded 2023 Cricket World Cup produced some stellar individual performances with both the bat and ball. There were close finishes, game-changing bowling spells and catches those won matches. World Cup 2023: News | Schedule | Results | Points table The World Cup had it all. Top established stars like Virat Kohli and Glenn Maxwell broke records, whereas we also witnessed the arrival of players like Rachin Ravindra and Travis Head at the big stage. Related Articles Jos Buttler wants to remain England white-ball captain despite dismal World Cup 'Babar Azam could not prove himself as a good leader': Ex-cricketers slam Pakistan captain for World Cup woes Also read: Rohit Sharma’s India didn’t win World Cup, but captain’s blueprint is the way forward However, it was not always the stars that made the headlines. There were a few players who flopped as well in the showpiece event. With the 13th edition of the ODI World Cup done and dusted, let’s now take a look at some top flops from the event: Babar Azam (Pakistan) Babar Azam had a difficult outing as Pakistan skipper in the 2023 World Cup. He failed to lead his team to the semi-finals, with the Men in Green eventually finishing fifth with just eight points. The aftermath of that had a major impact on Pakistan cricket, with Babar stepping down as skipper across all formats. More so, Babar did not have the best of performances with the bat as well. He managed 320 runs from nine matches at an average of 40, but his strike rate of below 100 across matches came under scrutiny. He scored four fifties and not even a single century this tournament, which has led to further imbalance in the Pakistan batting lineup. Jos Buttler (England) England came into the World Cup as defending champions and a lot was riding on captain Jos Buttler. However, Buttler struggled with the bat big time. The highest score for the 33-year-old this World Cup was 43 against New Zealand in the opening match of the tournament, and things have gone downhill for Buttler ever since. Jos Buttler managed just 138 runs from nine matches. AP His next best score was 27 runs against Pakistan in England’s final game, and also endured four single-figure dismissals in these nine games. Shakib Al Hasan (Bangladesh) Much was expected from Bangladesh skipper Shakib Al Hasan. Shakib had finished with 606 runs in the 2019 edition of the Cricket World Cup in England, but failed to replicate that similar kind of form this time around. Shakib could not even score half of what he did in 2019, managing just 186 runs from seven matches at an average of 26.57. Add to this, he had a tournament to forget for reasons apart from his batting or captaincy. In particular, the way he dealt with the “Timed Out” dismissal of Angelo Mathews when Bangladesh took on Sri Lanka in Delhi. Shakib was eventually ruled out of Bangladesh’s final group game against Australia with a finger injury, that eventually meant Najmul Hossain Shanto led the team in his place. Kagiso Rabada (South Africa) In the absence of the injured Anrich Nortje, Kagiso Rabada was expected to lead the South African pace attack. While Rabada is pretty familiar with Indian conditions thanks to his IPL experience, the 28-year-old had a much below par performance with the ball, scalping just 13 wickets from nine games. Although Rabada would start strongly, picking seven wickets from the first three games, he would only manage to take another six wickets from the next six games, while also struggling in the powerplay against Australia in the semi-final, where he would get hit for a few sixes by David Warner and later Travis Head. Maheesh Theekshana (Sri Lanka) Maheesh Theekshana came into the World Cup following a productive run in the Asia Cup, having taken nine wickets from four games. However, Theekshana failed to find his rhythm in the World Cup, scalping just six wickets from eight games. And expensive figures of 0/55 and 0/67 against Afghanistan and India respectively did not help the off-spinners’ case. To add to these woes, Theekshana also missed having Wanindu Hasaranga as a spin-bowling partner in the middle overs, with Theekshana himself having said that bowling without the 26-year-old was challenging. Join our Whatsapp channel to get the latest global news updates Published on: November 20, 2023 16:57:47 IST Tags: Babar Azam Cricket Jos Buttler World Cup 2023","pubDate":"2023-11-20 17:29:16","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/11/Babar-Azam-640-ENGvPAK_AP.jpg","source_id":"firstpost","source_priority":5906,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"4006e103a621310121346a212cc71f99","title":"SLC strongly rejects malicious allegations made by Sports Minister","link":"https://www.ft.lk/sports/SLC-strongly-rejects-malicious-allegations-made-by-Sports-Minister/23-755424","keywords":null,"creator":null,"video_url":null,"description":null,"content":"Sri Lanka Cricket (SLC) in a statement yesterday unequivocally rejected the baseless and malicious allegations made by Sports Minister Roshan Ranasinghe during a media conference held on Sunday. Following is the full statement of SLC. The SLC asserts that the Minister’s statements were tainted with malice and appeared to be orchestrated to instigate the public, creating undue influence on pending and emerging matters related to the affairs of SLC. The SLC notes with concern that Ranasinghe, in his capacity as the Minister of Sports, seems to lack a comprehensive understanding of the intricacies surrounding the affairs of the Parent Body and its affiliated members. Particularly noteworthy is the fact that the President of SLC, as a Director of the ICC (International Cricket Council) Board of Directors, is duty bound to respect and further the objectives outlined in clause 5 of the Memorandum of Association of the ICC. It is imperative to clarify that each ICC Director, including the President of SLC, has an obligation to apprise the status of SLC affairs when there are reasons to believe that impending actions by the Minister of Sports may jeopardise the fulfilment of obligations set out in the ICC’s Articles of Association. SLC emphasises that it has consistently acted in the best interest of the cricket administration in Sri Lanka, striving to address issues through constructive dialogue. Regrettably, these endeavours proved futile, given the continuous and unfounded criticism by the Minister of Sports, aiming to wield unwarranted influence over SLC through the misuse of authority. It is noteworthy to mention that despite lacking any vested authority, the Minister of Sports has taken the unprecedented step of communicating with the ICC and its full members, making false claims that SLC officials were involved in corruption and malpractices based on a special audit report. However, it is crucial to emphasise that the said audit report did not reveal any corrupt conduct or malpractice, and the ICC and its Members were well aware of the groundlessness of these allegations. Moreover, SLC believes that the Minister’s continuous appeal to the general public and repeated false allegations of corrupt conduct and malpractice by SLC officials appear to be driven by political motives, aimed at enhancing his public image. As a member of the ICC, SLC is obligated to comply with its paramount obligation outlined in Article 2.4 (D), which mandates that SLC must operate autonomously without Government interference. Nevertheless, it appears that the Minister of Sports, by contravening these ICC principles, is wilfully causing harm and irreparable damage to SLC. SLC wishes to emphasise that the ICC’s decisions are reached during board meetings comprising directors representing all full member countries. The ICC, being a reputable international organisation, approaches decisions with careful consideration, particularly those that could result in the suspension of a member. Contrary to any assertions implying that SLC sought its suspension from the ICC, we want to clarify that such allegations are without merit, and SLC is steadfast in its commitment to earnestly address and lift the suspension imposed by the ICC. While SLC focuses on resolving the suspension issue, it appears that the Minister of Sports is pursuing a different agenda through media manipulation, without pursuing legal avenues to address the allegations. This raises concerns about his intention to influence public opinion and other stakeholders to achieve his objective of taking control of SLC through the misuse of his powers. SLC calls for a fair and unbiased examination of the facts and remains focused on its mission to uphold the integrity of cricket in Sri Lanka and is confident that the truth will prevail in due course.","pubDate":"2023-11-20 19:41:45","image_url":null,"source_id":"ft_lk","source_priority":1390226,"country":["sri lanka"],"category":["sports"],"language":"english"},{"article_id":"9550822ea9bd3b8618d34a64c6518f0d","title":"Cummins and the ‘Sound of Silence’","link":"https://www.ft.lk/sports/Cummins-and-the--Sound-of-Silence-/23-755425","keywords":null,"creator":null,"video_url":null,"description":null,"content":"AHMEDABAD: The popular song by Simon and Garfunkel ‘The Sound of Silence’ was given a new twist by Australian captain Pat Cummins at the Cricket World Cup final when he actually silenced the more than one lakh of Indian supporters who had filled the Narendra Modi Stadium to witness an Indian victory on Sunday. Prior to the final, Cummins had gone on record to state: “In sport, there’s nothing more satisfying than silencing the home crowd. That’s the aim for us tomorrow.” Australia simply did just that, restricting India to 13 fours and three sixes in their entire innings as compared to the match-winning knock of 137 by Travis Head which comprised 15 fours and four sixes. No doubt the crowd was silenced and even if they had a brief opportunity of raising their voices when Australia lost their first three wickets for 47 runs, it was again stifled by Head in partnership with Marnus Labuschagne that produced 192 runs for the fourth wicket which all but snuffed any chance India had of making a comeback. As a matter of fact, Head and Labuschagne were initially not in Australia’s team plans in the initial stages. “Travis Head was phenomenal. I think I said it on stage, a lot of credit should also go to Andrew McDonald and George Bailey, the selectors, to take a punt,” said Cummins. “He had a broken finger, a broken hand for the half of the tournament, but to keep him in the squad was a huge risk. And the medical team were fantastic, obviously, to get him into a place where he could perform. That was a big risk. I think we could have been made to look really silly if that didn’t pay off, but you got to take those risks to win a tournament.” “And Trav, the player we’ve seen in Test cricket, he just epitomised everything I want out of a cricket team. He takes the game on, he plays with a smile, he just puts the pressure right back onto the opposition and he’s just great fun to be around. I couldn’t be happier for Trav.” And then Labuschagne who was initially not included in the Australian World Cup squad but was a last-minute inclusion. “Marnus just showed his class and in South Africa you had to pick him, he was fantastic and he was playing a different style to probably what he did for the first start of his ODI career and it was paying off and we know he’s a gun so you had to try and find room for him.” It was a gamble that Australia took with these two players and it paid off handsomely in the final allowing them to win it for a record sixth time. “That’s huge, I think that’s the pinnacle of international cricket, winning a one-day World Cup. Especially over here in India, in front of a crowd like this,” was how Cummins described the victory at the post-match media conference. “It’s the pinnacle because just every international team comes together. You only get a shot at it every four years. Even if you have a ten-year career, you might only get two chances at it. It’s just the whole cricket world stops with this World Cup. It doesn’t get any better.” “Just seeing the sea of blue, walking, making its way to the ground, all the cars parked with their selfie cameras out, you kind of knew you were walking into something pretty special. And then to walk out for the toss and just see 130,000 blue Indian shirts, it’s an experience you’ll never forget. Awesome day and the good thing was they weren’t too noisy for most of it.” “It’s been a big year for everyone, but our cricket team has been here in India, Ashes, World Test Championship and to top it off with this is just huge and these are the moments that you’ll remember for the rest of your life.” India’s Head Coach Rahul Dravid reflecting on his side’s defeat said, “I mean we were the favourites because we were playing well but I think you can recognise that Australia is also a very good cricket team. They also came here with eight wins on the bounce, so we were under no illusions that this was going to be a tough contest. We were confident that if we played well, we’d get the right result but unfortunately on the day they played better than us.” “There is disappointment in the dressing room, and there is disappointment among the boys and among the support staff. There were a lot of emotions. It was tough to see as a coach because I know how hard these guys have worked, what they’ve put in, the sacrifices they’ve made. So, it’s tough.” “But that’s sport. That happens. And the better team won on the day. I’m sure that the sun will come up tomorrow morning. We’ll learn from it. We’ll reflect. And we’ll move on, as will everyone else. That’s what you do as sportsmen. You have some great highs in sport, and you have some lows in sport. And you keep moving on. You don’t stop. Because if you don’t put yourself on the line, you don’t put yourself in games like these, you don’t experience the great highs. And neither do you experience the great lows. And if you don’t do that, you don’t learn.”","pubDate":"2023-11-20 19:41:45","image_url":null,"source_id":"ft_lk","source_priority":1390226,"country":["sri lanka"],"category":["sports"],"language":"english"},{"article_id":"7c478fecb10ce44947b437e5480d6923","title":"Cara Delevingne, Kylie Minogue and a race that ticked all the boxes… Viva Las Vegas!","link":"https://metro.co.uk/2023/11/20/cara-kylie-a-las-vegas-grand-prix-ticked-boxes-19852072/","keywords":["F1","Sport","Cara Delevingne","Carlos Sainz Jr","Charles Leclerc","Ferrari","Formula One","George Russell","Kylie Minogue","Las Vegas","Max Verstappen","Mercedes Motorsport","Metro newspaper","Red Bull Racing","Toto Wolff"],"creator":["Adam Hay-Nicholls"],"video_url":null,"description":"After a shaky start, Las Vegas delivered.","content":"After a shambolic start to the Las Vegas Grand Prix weekend, we were rewarded on Sunday with a fantastic race – albeit one that was won by Max Verstappen for the 18th time this year. My weekend was book-ended by seeing Nile Rodgers play all his hits at a gig on Wednesday, to having a deep and meaningful conversation on Sunday morning in a nightclub after the race with Cara Delevingne about her mother’s laundry (we share the same dry cleaner in Pimlico). This wouldn’t happen at Spa-Francorchamps. Once things really got going on Friday after an inauspicious beginning, whereby a loose manhole cover wrecked Carlos Sainz ’s Ferrari and fans who’d paid thousands to watch only saw eight minutes of action, we witnessed an unpredictable event which looked for a long time like the spoils would go to the Scuderia. Charles Leclerc started on pole and probably would have taken victory had it not been for a second safety car. Verstappen received a five-second penalty for forcing Leclerc off the road at Turn 1, telling the stewards on the radio ‘give them my regards’. Somehow, he came back to win despite his Red Bull suffering considerable damage from a contretemps with George Russell ’s Mercedes. And if anyone should have got a penalty for that, it’d should’ve been Max not George. Sergio Perez, who started 11th and lost his front wing at Turn 1, led for a time and it looked like he might win his first race since Azerbaijan in April. However, both Verstappen and, on the last lap, Leclerc were able to draft past. For the second time in a fortnight, Perez was the losing driver in a photo finish, but at least he got on the podium. In Las Vegas, after parking up in Parc Ferme, the top three drivers were put in a Rolls-Royce Phantom and whisked to the Bellagio hotel for their post-race interviews. It might have been awkward, had Verstappen not taken the middle seat between the Mexican and the Monegasque. It was also a fantastic weekend for Alpine, with Esteban Ocon finishing fourth. The Enstone team celebrated by visiting Kylie Minogue’s Las Vegas residency at the Wynn hotel, where my dry cleaning chat with Cara occurred. Leclerc, despite finishing second, was relieved the weekend had ended up a win for Formula One. He said: ‘I really enjoyed it. I think we needed it [to be a success]. Of course, the weekend didn’t start the way it had to start, but I’m so happy that it ended that way. It’s such an incredible sport.’ The organisers offered fans who had a ticket for Thursday’s practice sessions a $200 voucher to be used at its merchandise concessions. A local law firm has launched a legal action to pursue a refund to the tune of $30,000 per spectator. Toto Wolff, who’d got incredibly worked up earlier in the week when asked about Thursday’s track chaos, felt satisfied the weekend had ended on a positive note. ‘Lots of things that were said look a little bit out of proportion or too negative because we are leaving Las Vegas after a great weekend,’ said the Mercedes supremo. Young dad found dead in bed just weeks after welcoming second daughter Woman raped in church grounds while walking home from night out Phil Spencer's mum's cause of death after harrowing accident revealed ‘I think it will have increased the popularity of Formula One in the United States, for sure. There’s nothing negative I can find. The drain cover was nothing, like I said. When I look back; a spectacular race, great audiences, a mega event and some good racing at the front. That is what I will remember of the inaugural Las Vegas race that ticked all the boxes.’ I put it to Carlos Sainz Jr that it was madness he was given a ten-place grid penalty when it was the track that was at fault for destroying his car during Thursday’s FP1, not Ferrari, when he hit a loose manhole cover on Las Vegas Boulevard. ‘When you put it like that, the thing speaks for itself, no?’ he said, with tears in his eyes. ‘There was clearly a safety issue at the track. That safety issue destroyed my car. My mechanics invested five hours in putting together a completely new car. I’m extremely disappointed and just upset and in a bad mood because I expected more from the sport.’ Apparently, it was Mercedes who objected to Ferrari getting a free pass for a battery change, due to the two constructors being so close in the championship, despite it being a case of force majeure. The prancing horse’s team principal, Fred Vasseur, was furious with the FIA and his old friend, Toto Wolff. ‘It’s not an easy one, to give a set of tyres or to give an engine, because it’s a gain of performance,’ he said. ‘But the battery? There is no performance into the battery.’ The accident cost, according to Vasseur, ‘millions’, and the Scuderia intends to have a ‘private discussion’ with the governing body to recoup its losses, which could impact its budget cap. ‘There will be a discussion,’ confirmed Fred. ‘The decision, it’s another thing.’ There is a precedent for the FIA paying out in events like this: they paid compensation to Haas in 2017 after Romain Grosjean hit a drain cover at the Malaysian Grand Prix. MORE : Ronnie O’Sullivan offers intense look into his world with The Edge of Everything MORE : Shane Warne’s Travis Head prediction resurfaces after Australia win Cricket World Cup final","pubDate":"2023-11-20 19:37:18","image_url":null,"source_id":"metro","source_priority":1797,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"d9ea9cf1d2e1f679c8c36e88a73ec3fe","title":"North Macedonia vs England - Euro 2024 qualifier: Live score, team news and updates as Rico Lewis makes his first start for Three Lions with Gareth Southgate resting Harry Kane and selecting an exciting midfield trio","link":"https://www.dailymail.co.uk/sport/live/article-12770953/North-Macedonia-vs-England-Euro-2024-qualifier-Live-score-team-news-updates-Rico-Lewis-looks-set-make-start-Gareth-Southgates-side.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Follow Mail Sport's live blog for the latest score, team news and updates as England take on North Macedonia in Eur 2024 qualifying action.","content":"LIVE North Macedonia vs England - Euro 2024 qualifier: Live score, team news and updates as Rico Lewis makes his first start for Three Lions with Gareth Southgate resting Harry Kane and selecting an exciting midfield trio By Spencer Morgan For Mailonline Published: 17:58, 20 November 2023 | Updated: 19:17, 20 November 2023 e-mail 13 View comments Advertisement Follow Mail Sport's live blog for the latest score, team news and updates as England take on North Macedonia in Eur 2024 qualifying action. 19:14 30 minutes to kick-off The players are out for the warm-ups and there's not long to go now.... 19:01 Walker captain for the first time 18:50 Ready to round off qualifying Gareth Southgate's men have already secured top spot in Group C with six wins and one draw from their first seven matches. They beat North Macedonia 7-0 in the return of this fixture and have to be fancied to end this campaign on a high. 18:36 England team news Rico Lewis does get his chance as expected with Ollie Watkins up top. Foden, Rice and Alexander-Arnold make up an exciting midfield with Grealish and Saka on the wings. 18:23 The Three Lions have arrived 18:12 England set to start with exciting midfield trio of Alexander-Arnold, Rice and Foden England will test out a new-look midfield against North Macedonia tonight that will feature Trent Alexander-Arnold, Declan Rice and Phil Foden. Three Lions manager Gareth Southgate has previously been criticised over his reliance on choosing a more defensive midfield but is set to take the handbrake off tonight. England set to start exciting midfield trio against North Macedonia England will test out a new-look midfield against North Macedonia tonight that will feature a trio of Premier League talent in the forms of Trent Alexander-Arnold, Declan Rice and Phil Foden. Mail Online 18:09 Tonight's arena 18:07 Kane rested, Watkins in England captain Harry Kane is rested for this one with Ollie Watkins getting his chance to impress. 18:02 Good evening! And welcome to Mail Sport's live coverage of North Macedonia vs England. Team news to follow with kick-off at 7.45pm. TOP STORIES England Euro 2024 squad: Raheem Sterling, Mason Mount and Reece James among the stars sweating on their places Man City teenager Rico Lewis set to START England's Euro 2024 qualifier against North Macedonia, with Gareth Southgate ready to hand rising star his full senior debut after Kieran Trippier's withdrawal Gareth Southgate CAN call upon both Trent Alexander-Arnold and Jude Bellingham in his England starting XI, Chris Sutton argues on It's All Kicking Off - but Liverpool star must be tested in new midfield role against top sides England start with an exciting midfield trio of Trent Alexander-Arnold, Declan Rice and Phil Foden against North Macedonia as Harry Kane is rested Ollie Watkins names an Arsenal legend as the best Premier League striker ever... but there was no space for Wayne Rooney in the Aston Villa star's greatest forwards list Are you the ultimate football fan? Do you recognise these England stars from when they were young? Jack Grealish hailed as a 'humble' after the star speaks to an England supporter in a wheelchair following the Three Lions win over Malta... despite not featuring at Wembley GRAEME SOUNESS: England CAN win the Euros - if only Gareth Southgate is bold enough to take off the handbrake and make them feel they have no one to fear No call-up for your country? Time for a real 'international break'! Stars jet off on holiday with no Premier League games for two weeks... as Thiago Silva returns to Brazil and Loris Karius and his TV host partner head for Dubai Jarrod Bowen becomes the SEVENTH England star to withdraw from Gareth Southgate's squad - as he picks up a training injury ahead of Monday's clash with North Macedonia Jarrod Bowen's knee injury is NOT as bad as first feared after West Ham star pulled out of England squad to face North Macedonia... with the Hammers hoping he won't be sidelined by the issue Formula 1 - Las Vegas Grand Prix RECAP: Max Verstappen wins thrilling Sin City race after multiple safety cars and retirements Harry Kane reveals the best defender he's ever faced, the Germany star he wished played for England and why Eric Dier is the worst team-mate to sit next to on a flight CRAIG HOPE'S POSTCARD FROM SKOPJE: Stray dogs, jugglers and pirate ships... just avoid the taxis! Gareth Southgate insists England can NOT take their foot off the gas despite already qualifying for Euro 2024... as Three Lions boss challenges his side to become No.1 rank in the world Lionesses trio Leah Williamson, Mary Earps and Chloe Kelly join Gary Lineker, Ian Wright and Alex Scott at glamorous GQ Men of the Year Awards Rico and Rice... and all things nice! Young guns relish England away day which is far cry from David Beckham death threats 20 years ago LAWRENCE BOOTH: Cricket World Cup highs and lows after Australia beat India to snatch international glory Chelsea and England star Cole Palmer admits he 'can't stop seeing' viral video of him singing Jamaican reggae dancehall song, as he opens up on his West Indies roots Jorginho must 'bow down' and stop taking penalties insists former Italy World Cup winner who slams the Arsenal midfielder's latest missed spot-kick and insists 'enough is enough' THE SHARPE END: England's drab performance against Malta bores fans into making paper planes and Trent Alexander-Arnold shines Marcus Rashford has often turned to England for solace from his Man United woes... but it didn't work against Malta and he faces a growing challenge for a Euro 2024 place Benjamin Mendy launches a 'multi-million pound' lawsuit against Man City for unpaid wages after they stopped his £100,000-per-week salary when he was charged with rape and sexual assault - before he was cleared David Beckham's ex-England manager Glenn Hoddle defends himself against Victoria and Becks' mum's scathing attack on him on Netflix, after Sandra said Three Lions boss is on her 'hit list' Man City wonderkid gives Brazil a taste of their own medicine in the Under 17 World Cup as Joel Ndala showcases his talents for the Young Lions in hard-fought defeat Former Premier League star reveals he is BANNED from UK golf course that costs £100,000 to be a member after drunken incident earlier this year Travis Kelce's mom Donna 'still berates herself' over Taylor Swift comment on The Today Show... despite her son immediately calling to tell her she did a 'super job' EXCLUSIVE: Naomi Osaka dreamed she would LOSE matches to end her tennis career and wanted to 'buy a farm and grow crops instead,' new biography claims India vs Australia - Cricket World Cup final: Aussies clinch SIXTH title as Travis Head hits incredible century to stun hosts India and give Pat Cummins his greatest moment as captain England boss Gareth Southgate voices concerns over pitch for Euro 2024 qualifier in North Macedonia, but he insists he won't take any chances with his players EXCLUSIVE: Tottenham are unhappy with Everton's 'absurd' claim that their £60m Richarlison deal caused them to breach Premier League spending rules - with their hopes of waiving £10m fee for Dele Alli now in jeopardy Travis Kelce warned about 'stagey and fake' Taylor Swift by Skip Bayless, who claims their kiss after her Eras show in Argentina was 'exaggerated': 'She's just painfully camera aware' Tiger Woods and Rory McIlroy delay launch of The Golf League by a YEAR after roof of custom-built venue in Florida COLLAPSED Michael Vaughan slams India for not staying out on the pitch to see Australia lift the World Cup... but former England captain later deletes social media post Andros Townsend makes surprising admission about Man United as he likens them to Jurgen Klopp's Liverpool... and Luton star picks out two of Erik ten Hag's players for special praise Mohamed Salah is escorted off by military officers and protected by his Egypt team-mates - as pitch invaders target Liverpool star during 2-0 win over Sierra Leone Travis Kelce and Taylor Swift's families 'could spend Thanksgiving TOGETHER' at his new $6million Kansas City mansion... despite the singer missing his game against brother Jason tonight due to rescheduled Eras date How Europe's FIFTH-WORST team - ranked 157th in the world - can qualify for Euro 2024 tonight... with just one win needed to make it to Germany despite only two victories and a goal a game so far Man United news RECAP: Erik ten Hag 'sets priority on defensive reinforcements' as club are linked with summer target Jean-Clair Todibo How much will Australia earn for winning the ODI World Cup? And what was England's total prize money following their disastrous title defence in India? F1 racing DOES belong in Sin City (despite an embarrassing start), Oscar Piastri is the real deal for McLaren and Lewis Hamilton is miles away from another race win - never mind a title! SIX THINGS WE LEARNED from the Las Vegas Grand Prix Man United are mocked by rival fans that Old Trafford is falling down. And on the day Mail Sport visit, the stench of decay after 18 years of Glazer rule is overwhelming Travis Kelce admits it has been 'f***ing mind-blowing' seeing how smart girlfriend Taylor Swift is... as he says he is 'learning' from her every day - and gushes that she is a GENIUS San Marino have only ever won ONE game, lost 195 matches and scored 30 goals in 37 years... they are the worst ranked side according to FIFA - but in other ways, they might just be the best team in the world Jason McAteer challenges 'salty' Roy Keane to a BOXING match as the Man United legend reignited their long-running feud last week... after saying his Ireland team-mate 'deserved' being elbowed in infamous 2002 clash Arsenal manager Mikel Arteta picks his dream five-a-side team which includes NO goalkeepers or defenders with Lionel Messi his 'number one choice' in a line-up full of attackers Part of Old Trafford's concrete ceiling falls on Manchester United supporters during derby as the state of the once iconic stadium falls further into disrepute Why Aussie cricket stars were BANNED from enjoying one of their biggest traditions after their stunning World Cup win over India Steven Gerrard changes his mind on the GOAT debate... picking Cristiano Ronaldo as the world's greatest player - a year after he named Lionel Messi as his No 1 UFC star Ailin Perez makes her OnlyFans account free to celebrate her win over Lucie Pudilova... after she capped off her victory at UFC Vegas 82 by TWERKING EXCLUSIVE: Lionel Messi's World Cup match shirts - including the kit he started iconic final against France in - set to sell for £8MILLION at auction... and it could overtake Michael Jordan for the memorabilia world record South Africa Rugby World Cup winner dies in a car accident, aged 58, after a 'collision with a taxi' in his homeland 'What was he trying to do?': Baffled fans question why Kai Havertz shielded the ball out of play for a throw-in immediately after he controlled it during Germany's defeat to Turkey Hosts India had it all in their favour in the World Cup final - the best batter, the best bowler and a 'home pitch' - but they blew it Ronnie O'Sullivan reveals his dad's parting message before being handed a life sentence for murder, as his mum recalls her son 'screaming down the phone' in a Thailand hotel room after finding out he was in prison Arsenal legend Gilberto Silva offers advice to Gunners as they consider signing a midfielder in January due to Thomas Partey's injury issues Tony Bellew reveals family tragedy just hours before heading into I'm A Celebrity jungle... as he pays heartfelt tribute to 'the boss of our house' before Sunday's opening episode Travis Kelce FINALLY opens up on his love life with 'hilarious' Taylor Swift... from first dates in New York to drunkenly singing 'Teenage Dirtbag' together... and how his friends begged him: 'Don't f*** this up!' West Ham star among three players sent home from international duty after partying in a nightclub less than 48 hours before crunch Euro 2024 qualifier Taylor Swift won't be at Chiefs vs. Eagles on Monday - where her parents 'are set to meet Travis Kelce's mom and dad' - after rescheduling Rio tour date due to extreme heat, a day after a fan died before a show Pat Cummins is caught up in VERY embarrassing scenes during 'the most awkward trophy presentation ever' at the World Cup Bill Burr defends his 'hilarious' wife over Donald Trump controversy after she was seen giving the former US President a double bird at UFC 295: 'Can we all be adults?' Roberto Firmino's father tragically dies after suffering a heart attack during family trip to Dubai - shortly after the former Liverpool star was pictured with relatives at an amusement park Kylian Mbappe beats Lionel Messi, Cristiano Ronaldo and Neymar to landmark record as PSG forward nets another hat-trick in France's 14-0 win against Gibraltar Travis Kelce drops his clothing line collab' with the Chiefs ahead of Monday Night Football showdown against Eagles... and fans love it: 'On his business era' Travis Kelce joins Patrick and Brittany Mahomes for an early Thanksgiving dinner in Kansas City - as girlfriend Taylor Swift reschedules a Brazil tour date after a fan died in extreme heat Former LSU guard Alexis Morris sounds off on star player Angel Reese amid tension with coach Kim Mulkey: 'I never cared about likes, media, NIL' Rugby race shame as pundit and former England wing Ugo Monye says fan shouted 'N***a, N***a' at him during Premiership match at Exeter, with club launching probe into incident Australia win the Cricket World Cup AGAIN! Travis Head hits incredible century to stun India and give Pat Cummins his greatest moment as captain Manchester United legend looks almost unrecognisable as he joins fellow former Red Devils for match against World XI side Female fan is captured snorting white powder in the stands during halftime of a Colombian soccer game EXCLUSIVE: Germany legend Lothar Matthaus hails Harry Kane and Jude Bellingham as he tips England for a Euros charge… and reveals what he said to Chris Waddle after THAT penalty miss Tom Aspinall stuns female interviewer by grimly asking sexual questions in a crude interview days after his UFC heavyweight title win Patrick Mahomes is adamant that his Chiefs 'brother' and teammate Travis Kelce's romance with Taylor Swift is NOT a 'distraction' to the NFL Moment Virat Kohli and Marnus Labuschagne share INTENSE staredown during Cricket World Cup final with Australia vs India on a knife edge EXCLUSIVE: Everton face a further NINE-POINT deduction - and almost certain relegation - with Toffees set to be plunged into administration if Burnley, Leicester and Leeds are successful with £300m compensation claim against Toffees Cristiano Ronaldo's watch obsession has EXPLODED since his Saudi move as he dishes them out as gifts - but will he ever eclipse the £1.6MILLION timepiece from his Juventus days? Indian fans at World Cup final are slammed for 'deeply embarrassing' treatment of Aussie stars as they stormed to victory Jets legend Joe Namath is accused of allowing child sex abuse by well-known prep school coach to take place at his football camp Manchester United are 'lining up a move for a former Barcelona centre-back' as Erik ten Hag 'sets priority on signing defensive reinforcements' amid growing injury issues Tyson Fury backs both Anthony Joshua and Deontay Wilder to LOSE their heavyweight clashes on the 'Day of Recknoning' in Saudi Arabia next month - as the Gypsy King shares his thoughts on the star-studded card Taylor Swift grew up a Philadelphia fan and wore an Eagles sweater only a few months ago... now her loyalty will be tested when boyfriend Travis Kelce takes on her family's team on Monday Arise King Kane! Harry has become an instant favourite at Bayern Munich as the England captain's goalscoring exploits show no signs of slowing down on the continent David Beckham and Shaquille O'Neal lead the stars out in force for Las Vegas GP - while influencer Veronika Rajek leaves little to the imagination with her outfit and TikToker Alix Earle hits the paddock CHRIS FOY: Why Maro Itoje losing his marquee status to Owen Farrell opens up a real can of worms... with England lock facing 50% pay cut and clubs in France and Japan ready to pounce Alabama freshman Ty Simpson DROPS the ball as he goes to celebrate a 79-yard run through to the end zone... forcing officials to overturn his touchdown in win vs UT Chattanooga Buffalo Bills safety Taylor Rapp is carted off the field in an ambulance after stumbling and falling to the ground following terrifying collision with teammate Taron Johnson The Caribbean connection: Cole Palmer's grandad reveals his family's journey from St Kitts to Manchester… and how the Chelsea star's musical roots run beyond rapping on TikTok England Football Gareth Southgate Share or comment on this article: North Macedonia vs England - Euro 2024 qualifier: Live score, team news and updates as Rico Lewis makes his first start for Three Lions with Gareth Southgate resting Harry Kane and selecting an exciting midfield trio e-mail It's so exciting! And I really hope that Gareth So... by hunkeydorey 13 Add comment Comments 17 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-11-20 18:50:50","image_url":"https://i.dailymail.co.uk/1s/2023/11/20/18/78031875-0-image-a-19_1700505606181.jpg","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"5c876b1cb465c548acf7c74da5dc5f89","title":"India's Cricket Is In Good Place: Wasim Akram","link":"https://sports.ndtv.com/cricket/indias-cricket-is-in-good-place-wasim-akram-4590848","keywords":null,"creator":null,"video_url":null,"description":"Australia ended India's run in the final with a six-wicket victory to extend their dominance in the tournament.","content":"The Pakistan cricket fraternity showered the Indian team with praise for their incredible run to the final of World Cup, with the legendary Wasim Akram saying their cricket \"is in a good place\" despite the loss to Australia in the title clash. Australia ended India's run in the final with a six-wicket victory to extend their dominance in the tournament. \"Obviously they must be shattered to lose the final but in cricket these things happen. India had one bad day, and unfortunately, it came in the final,\" Akram said. \"You look at their structure, the money for players, the well thought out programs and the back up talent and they really just need to continue doing these things. Their cricket is in a good place,\" he added. Akram said as a former player he knows how mentally tough the Australians are in knockout match. \"I was captain when we played them in the 1999 World Cup final and although we had beaten them in the league stage, in the final they were a different side just like yesterday in Ahmedabad.\" Some, like former Pakistan wicketkeeper Rashid Latif , felt the Indian team was in no way inferior to the Australians. \"Maybe it is just a psychological thing with the Indian players. This team was worthy of winning the World Cup final but all credit to the Australians for showing once again how mentally tough and organised they are in their sports,\" Latif said. Latif termed seamer Mohammad Shami's bowling in the World Cup as outstanding. \"You look at the way he has come up and done so well. He was in my opinion the standout player for India in this World Cup.\" Pakistan's former captain Misbah ul Haq felt that the Australians had read the pitch better than the Indians and the toss proved vital. \"A side batting first required over 300 on this pitch to defend it,\" he said. Misbah also praised Rohit Sharma and Virat Kohli for leading by example throughout the tournament. Advertisement \"I think the younger players must have learnt a lot from these two in the dressing room and otherwise in this World Cup.\" Former players Basit Ali and Kamran Akmal believed that it was time for India to start focussing on building a T20 side for next year's World Cup. \"...But it will be difficult for the Indian selectors to not consider Rohit, Virat or Jadeja for the series in South Africa or even the Champions Trophy in 2025,\" Basit said. Former batsman Mohsin Khan said that Pakistan must learn from how India and Australia had adapted themselves to the requirements of modern day cricket, especially in the World Cup. \"Instead of looking at India's defeat we must appreciate the fact that this year they have already played in two ICC finals, losing both times to Australia. They are doing something right.\"","pubDate":"2023-11-20 18:45:45","image_url":null,"source_id":"ndtv","source_priority":1204,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"5b11016e505d4bcbd951ce5cc8da1a57","title":"Australia's Mitchell Marsh Celebrates World Cup Win With Father Geoff","link":"https://sports.ndtv.com/cricket/2023-and-1987-australias-mitchell-marsh-celebrates-world-cup-win-with-father-geoff-4590829","keywords":null,"creator":null,"video_url":null,"description":"Mitchell Marsh had a solid Cricket World Cup. In 10 matches, Marsh scored 441 runs at an average of 49.00, with a strike rate of over 107","content":"Australian all-rounder Mitchell Marsh expressed happiness with his team's ICC Cricket World Cup title win, posting a picture with his father, legendary batter Geoff Marsh who has also lifted the gold with Aussies back in 1987. Marsh took to Instagram to post a picture of him holding the trophy with his father. \"2023 and 1987,\" said the caption of Marsh's story. Mitchell Marsh had a solid Cricket World Cup. In 10 matches, Marsh scored 441 runs at an average of 49.00, with a strike rate of over 107. He scored two centuries and a fifty in the tournament, with the best score of 177*. He ended up as the tenth-highest run-scorer in the tournament and also took two wickets. The all-rounder also won the 2015 Cricket World Cup with Australia. In that tournament, he featured in just three matches, scoring 31 runs with the best score of 23. He also took five wickets in the tournament, a five-wicket haul against England. Geoff was also the star of the 1987 World Cup winning team, ending as the third-highest run-scorer with 428 runs in eight matches at an average of 61.14, with two centuries and a fifty. His best score was 126*. Coming to the match, Australia opted to bowl first and bundled out India for 240 in 50 overs. Skipper Rohit Sharma (47 in 31 balls, with four boundaries and three sixes), Virat Kohli (54 in 63 balls, with four boundaries) and KL Rahul (66 in 107 balls, with one four) posted important knocks. Mitchell Starc (3/55) was the pick of the bowlers for Australia. Skipper Pat Cummins (2/34) and Josh Hazlewood (2/60) also bowled well. Adam Zampa and Glenn Maxwell got a wicket each. Defending 240, India started off really well and had the Aussies down at 47/3. Knocks from Travis Head (137 in 120 balls, with 15 fours and four sixes) and Marnus Labuschagne (58 in 110 balls, with four boundaries) left the Indian team without answers and guided Australia to a six-wicket win. Mohammed Shami took one wicket while Jasprit Bumrah took t","pubDate":"2023-11-20 18:23:10","image_url":null,"source_id":"ndtv","source_priority":1204,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"2e861fc0f83ebcafedcb6971a45dab6f","title":"Pakistan unveil Shan Masood-led Test squad for Australia tour, eye fresh start after disappointing World Cup","link":"https://www.firstpost.com/firstcricket/sports-news/pakistan-unveil-shan-masood-led-test-squad-for-australia-tour-eye-fresh-start-after-disappointing-world-cup-13409952.html","keywords":["First Cricket News"],"creator":["Amit Banerjee"],"video_url":null,"description":"Pakistan unveil Shan Masood-led Test squad for Australia tour, eye fresh start after disappointing World Cup","content":"Cricket Pakistan unveil Shan Masood-led Test squad for Australia tour, eye fresh start after disappointing World Cup Top-order batter Masood replaced Babar Azam as Test skipper following Pakistan's disappointing run in the recently-concluded World Cup, where they failed to reach the semi-finals after losing five out of nine matches. Agence France-Presse November 20, 2023 23:23:50 IST File image of newly-appointed Pakistan Test captain Shan Masood. AP Lahore : Under a new skipper in Shan Masood, Pakistan on Monday named a squad of fresh faces for a tough tour of Australia starting next month, seeking a fresh start after a disastrous World Cup campaign. Following the World Cup where Pakistan lost five of their nine matches and finished fifth, the country’s cricket board overhauled the national team, with Babar Azam resigning as captain of all three formats. Team director Mickey Arthur and head coach Grant Bradburn have been removed from their positions with former skipper Mohammad Hafeez taking over both their roles. Related Articles World Cup 2023: 'Qudrat Ka Nizam' doesn't come to rescue as Pakistan miss out on semis yet again World Cup 2023: Pakistan cricket team arrive in Lahore after dismal campaign; Watch Masood was given the reins of the Test captaincy while Shaheen Shah Afridi was appointed Twenty20 captain. 🚨 SQUAD ANNOUNCED 🚨 Our 18-member squad for the three-match Test series against Australia 🇵🇰 Read more ➡️ https://t.co/eHP9NXPkOu #AUSvPAK | #BackTheBoysInGreen pic.twitter.com/ioKnv0cBxJ — Pakistan Cricket (@TheRealPCB) November 20, 2023 Wahab Riaz, another former fast bowler, was appointed chief selector following Inzamam-ul-Haq’s resignation and stressed performers in domestic competition were chosen for the three-match Test tour. “Australia is always a tough tour but we think that these players have the capability and capacity to not only do well, but come out winners.” Pakistan have performed poorly in Australia, however, losing 14 Tests on the trot with a last success in 1995. The series starts with the first Test in Perth (14-18 December) followed by the Boxing Day Test in Melbourne (26-30 December) and Sydney (3-7 January). Uncapped fast bowler Khurram Shahzad is rewarded for being the highest wicket-taker in the country’s premier First-Class tournament this year with 36 wickets. Dashing left-hander Saim Ayub and all-rounder Aamer Jamal have represented Pakistan in Twenty20 internationals but are untested in the five-day format. Shaheen is the only fast bowler to have played in Australia, while Naseem Shah was not considered as he was still recovering from a shoulder injury that ruled him out of the World Cup. Squad : Shan Masood (captain), Aamer Jamal, Abdullah Shafique, Abrar Ahmed, Babar Azam, Faheem Ashraf, Hasan Ali, Imam-ul-Haq, Khurram Shahzad, Mir Hamza, Mohammad Rizwan, Mohammad Wasim, Noman Ali, Saim Ayub, Agha Salman, Sarfaraz Ahmed, Saud Shakeel, Shaheen Shah Afridi Join our Whatsapp channel to get the latest global news updates Published on: November 20, 2023 23:23:50 IST Tags: Australia Vs Pakistan Cricket Pakistan Cricket Team Shan Masood","pubDate":"2023-11-20 17:53:50","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2020/08/Shan-Masood-ton-ENGvPAK-1st-Test-640-photopost_AP.jpg","source_id":"firstpost","source_priority":5906,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"39c807057c3cc039dd1ce01b2c2bdfb1","title":"Indian pacers’ workload to be carefully managed during hectic winter schedule: Paras Mhambrey","link":"https://www.firstpost.com/firstcricket/sports-news/indian-pacers-workload-to-be-carefully-managed-during-hectic-winter-schedule-paras-mhambrey-13409962.html","keywords":["First Cricket News"],"creator":["Amit Banerjee"],"video_url":null,"description":"Indian pacers’ workload to be carefully managed during hectic winter schedule: Paras Mhambrey","content":"Cricket Indian pacers’ workload to be carefully managed during hectic winter schedule: Paras Mhambrey India have a hectic schedule this winter with two Tests in South Africa in December-January followed by five games against England at home between January and March. Press Trust of India November 20, 2023 23:09:13 IST Jasprit Bumrah and Mohammed Shami played key roles in India's run to the final of the 2023 ICC World Cup, with the latter finishing at the top of the wicket-takers' list. AP Ahmedabad : The Indian pacers’ workload will have to be carefully monitored during the upcoming World Test Championship series against South Africa and England comprising seven Tests, said bowling coach Paras Mhambrey India will play a two-Test series in the Rainbow Nation in December-January, followed by five games against England at home between January and March. Shami (24 wickets in 7 games, 48.5 overs), Bumrah (20 wickets, 11 games, 91.5 overs) and Siraj (14 wickets, 82.3 overs, 11 games) did a lot of bowling in the World Cup. They have been on the road since Asia Cup in August-September. Related Articles World Cup 2023: We have the right bowlers to exploit different conditions, says India bowling coach Paras Mhambrey World Cup 2023: Why current Indian bowling unit is among the greatest ever at showpiece event “We will have to be very smart with the way we go forward in terms of managing the workload. These guys have played a lot of cricket, so we need to see how we want to go about it. “We haven’t discussed it yet,” Mhambrey, whose contract also ended with World Cup, said during an interaction with reporters in mixed zone on Sunday. Mhambrey has had a quiet yet impactful back-room presence as he devised strategies with the pace unit for various oppositions. It will be interesting to see what will be Bumrah’s take on Test matches and whether his body will hold the rigours of the five-day game. “We missed Bumrah for a major part, and you see the difference he brings when he is in the side. The way he has gone in this tournament especially, it’s massive. “It has been challenging, but looking at the other side of it, it has also been an opportunity for us to work on the bench-strength,” the former Mumbai and India seamer said. While the Indian team has a fantastic front-line of pacers, Mhambrey is also excited about the next crop. “There is Mukesh (Kumar), Prasidh (Krishna), Avesh (Khan) and Kuldeep (Sen). I would look at it that way,” Mhambrey said. The bowling coach termed Shami’s wicket-taking spree as incredible despite not playing the first four games. “He (Shami) was incredible. He obviously hadn’t played the initial games, but the way he came back and bowled throughout the tournament was incredible. “That’s not something we expected, but we always knew that he always has that positive impact on the game. He has been phenomenal,” Mhambrey said. Join our Whatsapp channel to get the latest global news updates Published on: November 20, 2023 23:09:13 IST Tags: Cricket Indian Cricket Team Paras Mhambrey","pubDate":"2023-11-20 17:39:13","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/10/Jasprit-Bumrah-Mohammed-Shami-IND-ENG-WC-AP-640.jpg","source_id":"firstpost","source_priority":5906,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"80076dd40b2361ef95402c946c553e84","title":"Sport | Proteas World Cup ratings: Karate Kid kicks a record-breaking punch, Bavuma battles","link":"https://www.news24.com/sport/cricket/worldcup/proteas-world-cup-ratings-karate-kid-kicks-a-record-breaking-punch-bavuma-battles-20231120","keywords":null,"creator":null,"video_url":null,"description":"The Proteas delivered a heartening World Cup campaign that culminated in a semi-final loss that was much more than what was expected of them before the tournament started. News24 Sport runs the rule over each squad member's campaign.","content":null,"pubDate":"2023-11-20 17:31:23","image_url":"https://cdn.24.co.za/files/Cms/General/d/9592/015f9deb3e344c788328465cc42f8608.jpg","source_id":"news24","source_priority":1882,"country":["south africa"],"category":["sports"],"language":"english"},{"article_id":"78f3bafc41bba5187ddb77cfca43a08c","title":"World Cup 2023: From Babar Azam to Jos Buttler, top players who flopped in showpiece event","link":"https://www.firstpost.com/firstcricket/sports-news/world-cup-2023-from-babar-azam-to-jos-buttler-top-players-who-flopped-in-showpiece-event-13408112.html","keywords":["First Cricket News"],"creator":["PN Vishnu"],"video_url":null,"description":"World Cup 2023: From Babar Azam to Jos Buttler, top players who flopped in showpiece event","content":"Cricket World Cup 2023: From Babar Azam to Jos Buttler, top players who flopped in showpiece event There were a few players who flopped as well in the showpiece event. With the 13th edition of the ODI World Cup done and dusted, let’s now take a look at some top flops from the event. FirstCricket Staff November 20, 2023 22:59:16 IST Pakistan's captain Babar Azam managed just 320 runs from nine matches in the 2023 World Cup. AP He just-concluded 2023 Cricket World Cup produced some stellar individual performances with both the bat and ball. There were close finishes, game-changing bowling spells and catches those won matches. World Cup 2023: News | Schedule | Results | Points table The World Cup had it all. Top established stars like Virat Kohli and Glenn Maxwell broke records, whereas we also witnessed the arrival of players like Rachin Ravindra and Travis Head at the big stage. Related Articles Jos Buttler wants to remain England white-ball captain despite dismal World Cup 'Babar Azam could not prove himself as a good leader': Ex-cricketers slam Pakistan captain for World Cup woes Also read: Rohit Sharma’s India didn’t win World Cup, but captain’s blueprint is the way forward However, it was not always the stars that made the headlines. There were a few players who flopped as well in the showpiece event. With the 13th edition of the ODI World Cup done and dusted, let’s now take a look at some top flops from the event: Babar Azam (Pakistan) Babar Azam had a difficult outing as Pakistan skipper in the 2023 World Cup. He failed to lead his team to the semi-finals, with the Men in Green eventually finishing fifth with just eight points. The aftermath of that had a major impact on Pakistan cricket, with Babar stepping down as skipper across all formats. More so, Babar did not have the best of performances with the bat as well. He managed 320 runs from nine matches at an average of 40, but his strike rate of below 100 across matches came under scrutiny. He scored four fifties and not even a single century this tournament, which has led to further imbalance in the Pakistan batting lineup. Jos Buttler (England) England came into the World Cup as defending champions and a lot was riding on captain Jos Buttler. However, Buttler struggled with the bat big time. The highest score for the 33-year-old this World Cup was 43 against New Zealand in the opening match of the tournament, and things have gone downhill for Buttler ever since. Jos Buttler managed just 138 runs from nine matches. AP His next best score was 27 runs against Pakistan in England’s final game, and also endured four single-figure dismissals in these nine games. Shakib Al Hasan (Bangladesh) Much was expected from Bangladesh skipper Shakib Al Hasan. Shakib had finished with 606 runs in the 2019 edition of the Cricket World Cup in England, but failed to replicate that similar kind of form this time around. Shakib could not even score half of what he did in 2019, managing just 186 runs from seven matches at an average of 26.57. Add to this, he had a tournament to forget for reasons apart from his batting or captaincy. In particular, the way he dealt with the “Timed Out” dismissal of Angelo Mathews when Bangladesh took on Sri Lanka in Delhi. Shakib was eventually ruled out of Bangladesh’s final group game against Australia with a finger injury, that eventually meant Najmul Hossain Shanto led the team in his place. Kagiso Rabada (South Africa) In the absence of the injured Anrich Nortje, Kagiso Rabada was expected to lead the South African pace attack. While Rabada is pretty familiar with Indian conditions thanks to his IPL experience, the 28-year-old had a much below par performance with the ball, scalping just 13 wickets from nine games. Although Rabada would start strongly, picking seven wickets from the first three games, he would only manage to take another six wickets from the next six games, while also struggling in the powerplay against Australia in the semi-final, where he would get hit for a few sixes by David Warner and later Travis Head. Maheesh Theekshana (Sri Lanka) Maheesh Theekshana came into the World Cup following a productive run in the Asia Cup, having taken nine wickets from four games. However, Theekshana failed to find his rhythm in the World Cup, scalping just six wickets from eight games. And expensive figures of 0/55 and 0/67 against Afghanistan and India respectively did not help the off-spinners’ case. To add to these woes, Theekshana also missed having Wanindu Hasaranga as a spin-bowling partner in the middle overs, with Theekshana himself having said that bowling without the 26-year-old was challenging. Join our Whatsapp channel to get the latest global news updates Published on: November 20, 2023 16:57:47 IST Tags: Babar Azam Cricket Jos Buttler World Cup 2023","pubDate":"2023-11-20 17:29:16","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/11/Babar-Azam-640-ENGvPAK_AP.jpg","source_id":"firstpost","source_priority":5906,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"4006e103a621310121346a212cc71f99","title":"SLC strongly rejects malicious allegations made by Sports Minister","link":"https://www.ft.lk/sports/SLC-strongly-rejects-malicious-allegations-made-by-Sports-Minister/23-755424","keywords":null,"creator":null,"video_url":null,"description":null,"content":"Sri Lanka Cricket (SLC) in a statement yesterday unequivocally rejected the baseless and malicious allegations made by Sports Minister Roshan Ranasinghe during a media conference held on Sunday. Following is the full statement of SLC. The SLC asserts that the Minister’s statements were tainted with malice and appeared to be orchestrated to instigate the public, creating undue influence on pending and emerging matters related to the affairs of SLC. The SLC notes with concern that Ranasinghe, in his capacity as the Minister of Sports, seems to lack a comprehensive understanding of the intricacies surrounding the affairs of the Parent Body and its affiliated members. Particularly noteworthy is the fact that the President of SLC, as a Director of the ICC (International Cricket Council) Board of Directors, is duty bound to respect and further the objectives outlined in clause 5 of the Memorandum of Association of the ICC. It is imperative to clarify that each ICC Director, including the President of SLC, has an obligation to apprise the status of SLC affairs when there are reasons to believe that impending actions by the Minister of Sports may jeopardise the fulfilment of obligations set out in the ICC’s Articles of Association. SLC emphasises that it has consistently acted in the best interest of the cricket administration in Sri Lanka, striving to address issues through constructive dialogue. Regrettably, these endeavours proved futile, given the continuous and unfounded criticism by the Minister of Sports, aiming to wield unwarranted influence over SLC through the misuse of authority. It is noteworthy to mention that despite lacking any vested authority, the Minister of Sports has taken the unprecedented step of communicating with the ICC and its full members, making false claims that SLC officials were involved in corruption and malpractices based on a special audit report. However, it is crucial to emphasise that the said audit report did not reveal any corrupt conduct or malpractice, and the ICC and its Members were well aware of the groundlessness of these allegations. Moreover, SLC believes that the Minister’s continuous appeal to the general public and repeated false allegations of corrupt conduct and malpractice by SLC officials appear to be driven by political motives, aimed at enhancing his public image. As a member of the ICC, SLC is obligated to comply with its paramount obligation outlined in Article 2.4 (D), which mandates that SLC must operate autonomously without Government interference. Nevertheless, it appears that the Minister of Sports, by contravening these ICC principles, is wilfully causing harm and irreparable damage to SLC. SLC wishes to emphasise that the ICC’s decisions are reached during board meetings comprising directors representing all full member countries. The ICC, being a reputable international organisation, approaches decisions with careful consideration, particularly those that could result in the suspension of a member. Contrary to any assertions implying that SLC sought its suspension from the ICC, we want to clarify that such allegations are without merit, and SLC is steadfast in its commitment to earnestly address and lift the suspension imposed by the ICC. While SLC focuses on resolving the suspension issue, it appears that the Minister of Sports is pursuing a different agenda through media manipulation, without pursuing legal avenues to address the allegations. This raises concerns about his intention to influence public opinion and other stakeholders to achieve his objective of taking control of SLC through the misuse of his powers. SLC calls for a fair and unbiased examination of the facts and remains focused on its mission to uphold the integrity of cricket in Sri Lanka and is confident that the truth will prevail in due course.","pubDate":"2023-11-20 19:41:45","image_url":null,"source_id":"ft_lk","source_priority":1390226,"country":["sri lanka"],"category":["sports"],"language":"english"},{"article_id":"9550822ea9bd3b8618d34a64c6518f0d","title":"Cummins and the ‘Sound of Silence’","link":"https://www.ft.lk/sports/Cummins-and-the--Sound-of-Silence-/23-755425","keywords":null,"creator":null,"video_url":null,"description":null,"content":"AHMEDABAD: The popular song by Simon and Garfunkel ‘The Sound of Silence’ was given a new twist by Australian captain Pat Cummins at the Cricket World Cup final when he actually silenced the more than one lakh of Indian supporters who had filled the Narendra Modi Stadium to witness an Indian victory on Sunday. Prior to the final, Cummins had gone on record to state: “In sport, there’s nothing more satisfying than silencing the home crowd. That’s the aim for us tomorrow.” Australia simply did just that, restricting India to 13 fours and three sixes in their entire innings as compared to the match-winning knock of 137 by Travis Head which comprised 15 fours and four sixes. No doubt the crowd was silenced and even if they had a brief opportunity of raising their voices when Australia lost their first three wickets for 47 runs, it was again stifled by Head in partnership with Marnus Labuschagne that produced 192 runs for the fourth wicket which all but snuffed any chance India had of making a comeback. As a matter of fact, Head and Labuschagne were initially not in Australia’s team plans in the initial stages. “Travis Head was phenomenal. I think I said it on stage, a lot of credit should also go to Andrew McDonald and George Bailey, the selectors, to take a punt,” said Cummins. “He had a broken finger, a broken hand for the half of the tournament, but to keep him in the squad was a huge risk. And the medical team were fantastic, obviously, to get him into a place where he could perform. That was a big risk. I think we could have been made to look really silly if that didn’t pay off, but you got to take those risks to win a tournament.” “And Trav, the player we’ve seen in Test cricket, he just epitomised everything I want out of a cricket team. He takes the game on, he plays with a smile, he just puts the pressure right back onto the opposition and he’s just great fun to be around. I couldn’t be happier for Trav.” And then Labuschagne who was initially not included in the Australian World Cup squad but was a last-minute inclusion. “Marnus just showed his class and in South Africa you had to pick him, he was fantastic and he was playing a different style to probably what he did for the first start of his ODI career and it was paying off and we know he’s a gun so you had to try and find room for him.” It was a gamble that Australia took with these two players and it paid off handsomely in the final allowing them to win it for a record sixth time. “That’s huge, I think that’s the pinnacle of international cricket, winning a one-day World Cup. Especially over here in India, in front of a crowd like this,” was how Cummins described the victory at the post-match media conference. “It’s the pinnacle because just every international team comes together. You only get a shot at it every four years. Even if you have a ten-year career, you might only get two chances at it. It’s just the whole cricket world stops with this World Cup. It doesn’t get any better.” “Just seeing the sea of blue, walking, making its way to the ground, all the cars parked with their selfie cameras out, you kind of knew you were walking into something pretty special. And then to walk out for the toss and just see 130,000 blue Indian shirts, it’s an experience you’ll never forget. Awesome day and the good thing was they weren’t too noisy for most of it.” “It’s been a big year for everyone, but our cricket team has been here in India, Ashes, World Test Championship and to top it off with this is just huge and these are the moments that you’ll remember for the rest of your life.” India’s Head Coach Rahul Dravid reflecting on his side’s defeat said, “I mean we were the favourites because we were playing well but I think you can recognise that Australia is also a very good cricket team. They also came here with eight wins on the bounce, so we were under no illusions that this was going to be a tough contest. We were confident that if we played well, we’d get the right result but unfortunately on the day they played better than us.” “There is disappointment in the dressing room, and there is disappointment among the boys and among the support staff. There were a lot of emotions. It was tough to see as a coach because I know how hard these guys have worked, what they’ve put in, the sacrifices they’ve made. So, it’s tough.” “But that’s sport. That happens. And the better team won on the day. I’m sure that the sun will come up tomorrow morning. We’ll learn from it. We’ll reflect. And we’ll move on, as will everyone else. That’s what you do as sportsmen. You have some great highs in sport, and you have some lows in sport. And you keep moving on. You don’t stop. Because if you don’t put yourself on the line, you don’t put yourself in games like these, you don’t experience the great highs. And neither do you experience the great lows. And if you don’t do that, you don’t learn.”","pubDate":"2023-11-20 19:41:45","image_url":null,"source_id":"ft_lk","source_priority":1390226,"country":["sri lanka"],"category":["sports"],"language":"english"},{"article_id":"7c478fecb10ce44947b437e5480d6923","title":"Cara Delevingne, Kylie Minogue and a race that ticked all the boxes… Viva Las Vegas!","link":"https://metro.co.uk/2023/11/20/cara-kylie-a-las-vegas-grand-prix-ticked-boxes-19852072/","keywords":["F1","Sport","Cara Delevingne","Carlos Sainz Jr","Charles Leclerc","Ferrari","Formula One","George Russell","Kylie Minogue","Las Vegas","Max Verstappen","Mercedes Motorsport","Metro newspaper","Red Bull Racing","Toto Wolff"],"creator":["Adam Hay-Nicholls"],"video_url":null,"description":"After a shaky start, Las Vegas delivered.","content":"After a shambolic start to the Las Vegas Grand Prix weekend, we were rewarded on Sunday with a fantastic race – albeit one that was won by Max Verstappen for the 18th time this year. My weekend was book-ended by seeing Nile Rodgers play all his hits at a gig on Wednesday, to having a deep and meaningful conversation on Sunday morning in a nightclub after the race with Cara Delevingne about her mother’s laundry (we share the same dry cleaner in Pimlico). This wouldn’t happen at Spa-Francorchamps. Once things really got going on Friday after an inauspicious beginning, whereby a loose manhole cover wrecked Carlos Sainz ’s Ferrari and fans who’d paid thousands to watch only saw eight minutes of action, we witnessed an unpredictable event which looked for a long time like the spoils would go to the Scuderia. Charles Leclerc started on pole and probably would have taken victory had it not been for a second safety car. Verstappen received a five-second penalty for forcing Leclerc off the road at Turn 1, telling the stewards on the radio ‘give them my regards’. Somehow, he came back to win despite his Red Bull suffering considerable damage from a contretemps with George Russell ’s Mercedes. And if anyone should have got a penalty for that, it’d should’ve been Max not George. Sergio Perez, who started 11th and lost his front wing at Turn 1, led for a time and it looked like he might win his first race since Azerbaijan in April. However, both Verstappen and, on the last lap, Leclerc were able to draft past. For the second time in a fortnight, Perez was the losing driver in a photo finish, but at least he got on the podium. In Las Vegas, after parking up in Parc Ferme, the top three drivers were put in a Rolls-Royce Phantom and whisked to the Bellagio hotel for their post-race interviews. It might have been awkward, had Verstappen not taken the middle seat between the Mexican and the Monegasque. It was also a fantastic weekend for Alpine, with Esteban Ocon finishing fourth. The Enstone team celebrated by visiting Kylie Minogue’s Las Vegas residency at the Wynn hotel, where my dry cleaning chat with Cara occurred. Leclerc, despite finishing second, was relieved the weekend had ended up a win for Formula One. He said: ‘I really enjoyed it. I think we needed it [to be a success]. Of course, the weekend didn’t start the way it had to start, but I’m so happy that it ended that way. It’s such an incredible sport.’ The organisers offered fans who had a ticket for Thursday’s practice sessions a $200 voucher to be used at its merchandise concessions. A local law firm has launched a legal action to pursue a refund to the tune of $30,000 per spectator. Toto Wolff, who’d got incredibly worked up earlier in the week when asked about Thursday’s track chaos, felt satisfied the weekend had ended on a positive note. ‘Lots of things that were said look a little bit out of proportion or too negative because we are leaving Las Vegas after a great weekend,’ said the Mercedes supremo. Young dad found dead in bed just weeks after welcoming second daughter Woman raped in church grounds while walking home from night out Phil Spencer's mum's cause of death after harrowing accident revealed ‘I think it will have increased the popularity of Formula One in the United States, for sure. There’s nothing negative I can find. The drain cover was nothing, like I said. When I look back; a spectacular race, great audiences, a mega event and some good racing at the front. That is what I will remember of the inaugural Las Vegas race that ticked all the boxes.’ I put it to Carlos Sainz Jr that it was madness he was given a ten-place grid penalty when it was the track that was at fault for destroying his car during Thursday’s FP1, not Ferrari, when he hit a loose manhole cover on Las Vegas Boulevard. ‘When you put it like that, the thing speaks for itself, no?’ he said, with tears in his eyes. ‘There was clearly a safety issue at the track. That safety issue destroyed my car. My mechanics invested five hours in putting together a completely new car. I’m extremely disappointed and just upset and in a bad mood because I expected more from the sport.’ Apparently, it was Mercedes who objected to Ferrari getting a free pass for a battery change, due to the two constructors being so close in the championship, despite it being a case of force majeure. The prancing horse’s team principal, Fred Vasseur, was furious with the FIA and his old friend, Toto Wolff. ‘It’s not an easy one, to give a set of tyres or to give an engine, because it’s a gain of performance,’ he said. ‘But the battery? There is no performance into the battery.’ The accident cost, according to Vasseur, ‘millions’, and the Scuderia intends to have a ‘private discussion’ with the governing body to recoup its losses, which could impact its budget cap. ‘There will be a discussion,’ confirmed Fred. ‘The decision, it’s another thing.’ There is a precedent for the FIA paying out in events like this: they paid compensation to Haas in 2017 after Romain Grosjean hit a drain cover at the Malaysian Grand Prix. MORE : Ronnie O’Sullivan offers intense look into his world with The Edge of Everything MORE : Shane Warne’s Travis Head prediction resurfaces after Australia win Cricket World Cup final","pubDate":"2023-11-20 19:37:18","image_url":null,"source_id":"metro","source_priority":1797,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"d9ea9cf1d2e1f679c8c36e88a73ec3fe","title":"North Macedonia vs England - Euro 2024 qualifier: Live score, team news and updates as Rico Lewis makes his first start for Three Lions with Gareth Southgate resting Harry Kane and selecting an exciting midfield trio","link":"https://www.dailymail.co.uk/sport/live/article-12770953/North-Macedonia-vs-England-Euro-2024-qualifier-Live-score-team-news-updates-Rico-Lewis-looks-set-make-start-Gareth-Southgates-side.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Follow Mail Sport's live blog for the latest score, team news and updates as England take on North Macedonia in Eur 2024 qualifying action.","content":"LIVE North Macedonia vs England - Euro 2024 qualifier: Live score, team news and updates as Rico Lewis makes his first start for Three Lions with Gareth Southgate resting Harry Kane and selecting an exciting midfield trio By Spencer Morgan For Mailonline Published: 17:58, 20 November 2023 | Updated: 19:17, 20 November 2023 e-mail 13 View comments Advertisement Follow Mail Sport's live blog for the latest score, team news and updates as England take on North Macedonia in Eur 2024 qualifying action. 19:14 30 minutes to kick-off The players are out for the warm-ups and there's not long to go now.... 19:01 Walker captain for the first time 18:50 Ready to round off qualifying Gareth Southgate's men have already secured top spot in Group C with six wins and one draw from their first seven matches. They beat North Macedonia 7-0 in the return of this fixture and have to be fancied to end this campaign on a high. 18:36 England team news Rico Lewis does get his chance as expected with Ollie Watkins up top. Foden, Rice and Alexander-Arnold make up an exciting midfield with Grealish and Saka on the wings. 18:23 The Three Lions have arrived 18:12 England set to start with exciting midfield trio of Alexander-Arnold, Rice and Foden England will test out a new-look midfield against North Macedonia tonight that will feature Trent Alexander-Arnold, Declan Rice and Phil Foden. Three Lions manager Gareth Southgate has previously been criticised over his reliance on choosing a more defensive midfield but is set to take the handbrake off tonight. England set to start exciting midfield trio against North Macedonia England will test out a new-look midfield against North Macedonia tonight that will feature a trio of Premier League talent in the forms of Trent Alexander-Arnold, Declan Rice and Phil Foden. Mail Online 18:09 Tonight's arena 18:07 Kane rested, Watkins in England captain Harry Kane is rested for this one with Ollie Watkins getting his chance to impress. 18:02 Good evening! And welcome to Mail Sport's live coverage of North Macedonia vs England. Team news to follow with kick-off at 7.45pm. TOP STORIES England Euro 2024 squad: Raheem Sterling, Mason Mount and Reece James among the stars sweating on their places Man City teenager Rico Lewis set to START England's Euro 2024 qualifier against North Macedonia, with Gareth Southgate ready to hand rising star his full senior debut after Kieran Trippier's withdrawal Gareth Southgate CAN call upon both Trent Alexander-Arnold and Jude Bellingham in his England starting XI, Chris Sutton argues on It's All Kicking Off - but Liverpool star must be tested in new midfield role against top sides England start with an exciting midfield trio of Trent Alexander-Arnold, Declan Rice and Phil Foden against North Macedonia as Harry Kane is rested Ollie Watkins names an Arsenal legend as the best Premier League striker ever... but there was no space for Wayne Rooney in the Aston Villa star's greatest forwards list Are you the ultimate football fan? Do you recognise these England stars from when they were young? Jack Grealish hailed as a 'humble' after the star speaks to an England supporter in a wheelchair following the Three Lions win over Malta... despite not featuring at Wembley GRAEME SOUNESS: England CAN win the Euros - if only Gareth Southgate is bold enough to take off the handbrake and make them feel they have no one to fear No call-up for your country? Time for a real 'international break'! Stars jet off on holiday with no Premier League games for two weeks... as Thiago Silva returns to Brazil and Loris Karius and his TV host partner head for Dubai Jarrod Bowen becomes the SEVENTH England star to withdraw from Gareth Southgate's squad - as he picks up a training injury ahead of Monday's clash with North Macedonia Jarrod Bowen's knee injury is NOT as bad as first feared after West Ham star pulled out of England squad to face North Macedonia... with the Hammers hoping he won't be sidelined by the issue Formula 1 - Las Vegas Grand Prix RECAP: Max Verstappen wins thrilling Sin City race after multiple safety cars and retirements Harry Kane reveals the best defender he's ever faced, the Germany star he wished played for England and why Eric Dier is the worst team-mate to sit next to on a flight CRAIG HOPE'S POSTCARD FROM SKOPJE: Stray dogs, jugglers and pirate ships... just avoid the taxis! Gareth Southgate insists England can NOT take their foot off the gas despite already qualifying for Euro 2024... as Three Lions boss challenges his side to become No.1 rank in the world Lionesses trio Leah Williamson, Mary Earps and Chloe Kelly join Gary Lineker, Ian Wright and Alex Scott at glamorous GQ Men of the Year Awards Rico and Rice... and all things nice! Young guns relish England away day which is far cry from David Beckham death threats 20 years ago LAWRENCE BOOTH: Cricket World Cup highs and lows after Australia beat India to snatch international glory Chelsea and England star Cole Palmer admits he 'can't stop seeing' viral video of him singing Jamaican reggae dancehall song, as he opens up on his West Indies roots Jorginho must 'bow down' and stop taking penalties insists former Italy World Cup winner who slams the Arsenal midfielder's latest missed spot-kick and insists 'enough is enough' THE SHARPE END: England's drab performance against Malta bores fans into making paper planes and Trent Alexander-Arnold shines Marcus Rashford has often turned to England for solace from his Man United woes... but it didn't work against Malta and he faces a growing challenge for a Euro 2024 place Benjamin Mendy launches a 'multi-million pound' lawsuit against Man City for unpaid wages after they stopped his £100,000-per-week salary when he was charged with rape and sexual assault - before he was cleared David Beckham's ex-England manager Glenn Hoddle defends himself against Victoria and Becks' mum's scathing attack on him on Netflix, after Sandra said Three Lions boss is on her 'hit list' Man City wonderkid gives Brazil a taste of their own medicine in the Under 17 World Cup as Joel Ndala showcases his talents for the Young Lions in hard-fought defeat Former Premier League star reveals he is BANNED from UK golf course that costs £100,000 to be a member after drunken incident earlier this year Travis Kelce's mom Donna 'still berates herself' over Taylor Swift comment on The Today Show... despite her son immediately calling to tell her she did a 'super job' EXCLUSIVE: Naomi Osaka dreamed she would LOSE matches to end her tennis career and wanted to 'buy a farm and grow crops instead,' new biography claims India vs Australia - Cricket World Cup final: Aussies clinch SIXTH title as Travis Head hits incredible century to stun hosts India and give Pat Cummins his greatest moment as captain England boss Gareth Southgate voices concerns over pitch for Euro 2024 qualifier in North Macedonia, but he insists he won't take any chances with his players EXCLUSIVE: Tottenham are unhappy with Everton's 'absurd' claim that their £60m Richarlison deal caused them to breach Premier League spending rules - with their hopes of waiving £10m fee for Dele Alli now in jeopardy Travis Kelce warned about 'stagey and fake' Taylor Swift by Skip Bayless, who claims their kiss after her Eras show in Argentina was 'exaggerated': 'She's just painfully camera aware' Tiger Woods and Rory McIlroy delay launch of The Golf League by a YEAR after roof of custom-built venue in Florida COLLAPSED Michael Vaughan slams India for not staying out on the pitch to see Australia lift the World Cup... but former England captain later deletes social media post Andros Townsend makes surprising admission about Man United as he likens them to Jurgen Klopp's Liverpool... and Luton star picks out two of Erik ten Hag's players for special praise Mohamed Salah is escorted off by military officers and protected by his Egypt team-mates - as pitch invaders target Liverpool star during 2-0 win over Sierra Leone Travis Kelce and Taylor Swift's families 'could spend Thanksgiving TOGETHER' at his new $6million Kansas City mansion... despite the singer missing his game against brother Jason tonight due to rescheduled Eras date How Europe's FIFTH-WORST team - ranked 157th in the world - can qualify for Euro 2024 tonight... with just one win needed to make it to Germany despite only two victories and a goal a game so far Man United news RECAP: Erik ten Hag 'sets priority on defensive reinforcements' as club are linked with summer target Jean-Clair Todibo How much will Australia earn for winning the ODI World Cup? And what was England's total prize money following their disastrous title defence in India? F1 racing DOES belong in Sin City (despite an embarrassing start), Oscar Piastri is the real deal for McLaren and Lewis Hamilton is miles away from another race win - never mind a title! SIX THINGS WE LEARNED from the Las Vegas Grand Prix Man United are mocked by rival fans that Old Trafford is falling down. And on the day Mail Sport visit, the stench of decay after 18 years of Glazer rule is overwhelming Travis Kelce admits it has been 'f***ing mind-blowing' seeing how smart girlfriend Taylor Swift is... as he says he is 'learning' from her every day - and gushes that she is a GENIUS San Marino have only ever won ONE game, lost 195 matches and scored 30 goals in 37 years... they are the worst ranked side according to FIFA - but in other ways, they might just be the best team in the world Jason McAteer challenges 'salty' Roy Keane to a BOXING match as the Man United legend reignited their long-running feud last week... after saying his Ireland team-mate 'deserved' being elbowed in infamous 2002 clash Arsenal manager Mikel Arteta picks his dream five-a-side team which includes NO goalkeepers or defenders with Lionel Messi his 'number one choice' in a line-up full of attackers Part of Old Trafford's concrete ceiling falls on Manchester United supporters during derby as the state of the once iconic stadium falls further into disrepute Why Aussie cricket stars were BANNED from enjoying one of their biggest traditions after their stunning World Cup win over India Steven Gerrard changes his mind on the GOAT debate... picking Cristiano Ronaldo as the world's greatest player - a year after he named Lionel Messi as his No 1 UFC star Ailin Perez makes her OnlyFans account free to celebrate her win over Lucie Pudilova... after she capped off her victory at UFC Vegas 82 by TWERKING EXCLUSIVE: Lionel Messi's World Cup match shirts - including the kit he started iconic final against France in - set to sell for £8MILLION at auction... and it could overtake Michael Jordan for the memorabilia world record South Africa Rugby World Cup winner dies in a car accident, aged 58, after a 'collision with a taxi' in his homeland 'What was he trying to do?': Baffled fans question why Kai Havertz shielded the ball out of play for a throw-in immediately after he controlled it during Germany's defeat to Turkey Hosts India had it all in their favour in the World Cup final - the best batter, the best bowler and a 'home pitch' - but they blew it Ronnie O'Sullivan reveals his dad's parting message before being handed a life sentence for murder, as his mum recalls her son 'screaming down the phone' in a Thailand hotel room after finding out he was in prison Arsenal legend Gilberto Silva offers advice to Gunners as they consider signing a midfielder in January due to Thomas Partey's injury issues Tony Bellew reveals family tragedy just hours before heading into I'm A Celebrity jungle... as he pays heartfelt tribute to 'the boss of our house' before Sunday's opening episode Travis Kelce FINALLY opens up on his love life with 'hilarious' Taylor Swift... from first dates in New York to drunkenly singing 'Teenage Dirtbag' together... and how his friends begged him: 'Don't f*** this up!' West Ham star among three players sent home from international duty after partying in a nightclub less than 48 hours before crunch Euro 2024 qualifier Taylor Swift won't be at Chiefs vs. Eagles on Monday - where her parents 'are set to meet Travis Kelce's mom and dad' - after rescheduling Rio tour date due to extreme heat, a day after a fan died before a show Pat Cummins is caught up in VERY embarrassing scenes during 'the most awkward trophy presentation ever' at the World Cup Bill Burr defends his 'hilarious' wife over Donald Trump controversy after she was seen giving the former US President a double bird at UFC 295: 'Can we all be adults?' Roberto Firmino's father tragically dies after suffering a heart attack during family trip to Dubai - shortly after the former Liverpool star was pictured with relatives at an amusement park Kylian Mbappe beats Lionel Messi, Cristiano Ronaldo and Neymar to landmark record as PSG forward nets another hat-trick in France's 14-0 win against Gibraltar Travis Kelce drops his clothing line collab' with the Chiefs ahead of Monday Night Football showdown against Eagles... and fans love it: 'On his business era' Travis Kelce joins Patrick and Brittany Mahomes for an early Thanksgiving dinner in Kansas City - as girlfriend Taylor Swift reschedules a Brazil tour date after a fan died in extreme heat Former LSU guard Alexis Morris sounds off on star player Angel Reese amid tension with coach Kim Mulkey: 'I never cared about likes, media, NIL' Rugby race shame as pundit and former England wing Ugo Monye says fan shouted 'N***a, N***a' at him during Premiership match at Exeter, with club launching probe into incident Australia win the Cricket World Cup AGAIN! Travis Head hits incredible century to stun India and give Pat Cummins his greatest moment as captain Manchester United legend looks almost unrecognisable as he joins fellow former Red Devils for match against World XI side Female fan is captured snorting white powder in the stands during halftime of a Colombian soccer game EXCLUSIVE: Germany legend Lothar Matthaus hails Harry Kane and Jude Bellingham as he tips England for a Euros charge… and reveals what he said to Chris Waddle after THAT penalty miss Tom Aspinall stuns female interviewer by grimly asking sexual questions in a crude interview days after his UFC heavyweight title win Patrick Mahomes is adamant that his Chiefs 'brother' and teammate Travis Kelce's romance with Taylor Swift is NOT a 'distraction' to the NFL Moment Virat Kohli and Marnus Labuschagne share INTENSE staredown during Cricket World Cup final with Australia vs India on a knife edge EXCLUSIVE: Everton face a further NINE-POINT deduction - and almost certain relegation - with Toffees set to be plunged into administration if Burnley, Leicester and Leeds are successful with £300m compensation claim against Toffees Cristiano Ronaldo's watch obsession has EXPLODED since his Saudi move as he dishes them out as gifts - but will he ever eclipse the £1.6MILLION timepiece from his Juventus days? Indian fans at World Cup final are slammed for 'deeply embarrassing' treatment of Aussie stars as they stormed to victory Jets legend Joe Namath is accused of allowing child sex abuse by well-known prep school coach to take place at his football camp Manchester United are 'lining up a move for a former Barcelona centre-back' as Erik ten Hag 'sets priority on signing defensive reinforcements' amid growing injury issues Tyson Fury backs both Anthony Joshua and Deontay Wilder to LOSE their heavyweight clashes on the 'Day of Recknoning' in Saudi Arabia next month - as the Gypsy King shares his thoughts on the star-studded card Taylor Swift grew up a Philadelphia fan and wore an Eagles sweater only a few months ago... now her loyalty will be tested when boyfriend Travis Kelce takes on her family's team on Monday Arise King Kane! Harry has become an instant favourite at Bayern Munich as the England captain's goalscoring exploits show no signs of slowing down on the continent David Beckham and Shaquille O'Neal lead the stars out in force for Las Vegas GP - while influencer Veronika Rajek leaves little to the imagination with her outfit and TikToker Alix Earle hits the paddock CHRIS FOY: Why Maro Itoje losing his marquee status to Owen Farrell opens up a real can of worms... with England lock facing 50% pay cut and clubs in France and Japan ready to pounce Alabama freshman Ty Simpson DROPS the ball as he goes to celebrate a 79-yard run through to the end zone... forcing officials to overturn his touchdown in win vs UT Chattanooga Buffalo Bills safety Taylor Rapp is carted off the field in an ambulance after stumbling and falling to the ground following terrifying collision with teammate Taron Johnson The Caribbean connection: Cole Palmer's grandad reveals his family's journey from St Kitts to Manchester… and how the Chelsea star's musical roots run beyond rapping on TikTok England Football Gareth Southgate Share or comment on this article: North Macedonia vs England - Euro 2024 qualifier: Live score, team news and updates as Rico Lewis makes his first start for Three Lions with Gareth Southgate resting Harry Kane and selecting an exciting midfield trio e-mail It's so exciting! And I really hope that Gareth So... by hunkeydorey 13 Add comment Comments 17 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-11-20 18:50:50","image_url":"https://i.dailymail.co.uk/1s/2023/11/20/18/78031875-0-image-a-19_1700505606181.jpg","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"5c876b1cb465c548acf7c74da5dc5f89","title":"India's Cricket Is In Good Place: Wasim Akram","link":"https://sports.ndtv.com/cricket/indias-cricket-is-in-good-place-wasim-akram-4590848","keywords":null,"creator":null,"video_url":null,"description":"Australia ended India's run in the final with a six-wicket victory to extend their dominance in the tournament.","content":"The Pakistan cricket fraternity showered the Indian team with praise for their incredible run to the final of World Cup, with the legendary Wasim Akram saying their cricket \"is in a good place\" despite the loss to Australia in the title clash. Australia ended India's run in the final with a six-wicket victory to extend their dominance in the tournament. \"Obviously they must be shattered to lose the final but in cricket these things happen. India had one bad day, and unfortunately, it came in the final,\" Akram said. \"You look at their structure, the money for players, the well thought out programs and the back up talent and they really just need to continue doing these things. Their cricket is in a good place,\" he added. Akram said as a former player he knows how mentally tough the Australians are in knockout match. \"I was captain when we played them in the 1999 World Cup final and although we had beaten them in the league stage, in the final they were a different side just like yesterday in Ahmedabad.\" Some, like former Pakistan wicketkeeper Rashid Latif , felt the Indian team was in no way inferior to the Australians. \"Maybe it is just a psychological thing with the Indian players. This team was worthy of winning the World Cup final but all credit to the Australians for showing once again how mentally tough and organised they are in their sports,\" Latif said. Latif termed seamer Mohammad Shami's bowling in the World Cup as outstanding. \"You look at the way he has come up and done so well. He was in my opinion the standout player for India in this World Cup.\" Pakistan's former captain Misbah ul Haq felt that the Australians had read the pitch better than the Indians and the toss proved vital. \"A side batting first required over 300 on this pitch to defend it,\" he said. Misbah also praised Rohit Sharma and Virat Kohli for leading by example throughout the tournament. Advertisement \"I think the younger players must have learnt a lot from these two in the dressing room and otherwise in this World Cup.\" Former players Basit Ali and Kamran Akmal believed that it was time for India to start focussing on building a T20 side for next year's World Cup. \"...But it will be difficult for the Indian selectors to not consider Rohit, Virat or Jadeja for the series in South Africa or even the Champions Trophy in 2025,\" Basit said. Former batsman Mohsin Khan said that Pakistan must learn from how India and Australia had adapted themselves to the requirements of modern day cricket, especially in the World Cup. \"Instead of looking at India's defeat we must appreciate the fact that this year they have already played in two ICC finals, losing both times to Australia. They are doing something right.\"","pubDate":"2023-11-20 18:45:45","image_url":null,"source_id":"ndtv","source_priority":1204,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"5b11016e505d4bcbd951ce5cc8da1a57","title":"Australia's Mitchell Marsh Celebrates World Cup Win With Father Geoff","link":"https://sports.ndtv.com/cricket/2023-and-1987-australias-mitchell-marsh-celebrates-world-cup-win-with-father-geoff-4590829","keywords":null,"creator":null,"video_url":null,"description":"Mitchell Marsh had a solid Cricket World Cup. In 10 matches, Marsh scored 441 runs at an average of 49.00, with a strike rate of over 107","content":"Australian all-rounder Mitchell Marsh expressed happiness with his team's ICC Cricket World Cup title win, posting a picture with his father, legendary batter Geoff Marsh who has also lifted the gold with Aussies back in 1987. Marsh took to Instagram to post a picture of him holding the trophy with his father. \"2023 and 1987,\" said the caption of Marsh's story. Mitchell Marsh had a solid Cricket World Cup. In 10 matches, Marsh scored 441 runs at an average of 49.00, with a strike rate of over 107. He scored two centuries and a fifty in the tournament, with the best score of 177*. He ended up as the tenth-highest run-scorer in the tournament and also took two wickets. The all-rounder also won the 2015 Cricket World Cup with Australia. In that tournament, he featured in just three matches, scoring 31 runs with the best score of 23. He also took five wickets in the tournament, a five-wicket haul against England. Geoff was also the star of the 1987 World Cup winning team, ending as the third-highest run-scorer with 428 runs in eight matches at an average of 61.14, with two centuries and a fifty. His best score was 126*. Coming to the match, Australia opted to bowl first and bundled out India for 240 in 50 overs. Skipper Rohit Sharma (47 in 31 balls, with four boundaries and three sixes), Virat Kohli (54 in 63 balls, with four boundaries) and KL Rahul (66 in 107 balls, with one four) posted important knocks. Mitchell Starc (3/55) was the pick of the bowlers for Australia. Skipper Pat Cummins (2/34) and Josh Hazlewood (2/60) also bowled well. Adam Zampa and Glenn Maxwell got a wicket each. Defending 240, India started off really well and had the Aussies down at 47/3. Knocks from Travis Head (137 in 120 balls, with 15 fours and four sixes) and Marnus Labuschagne (58 in 110 balls, with four boundaries) left the Indian team without answers and guided Australia to a six-wicket win. Mohammed Shami took one wicket while Jasprit Bumrah took t","pubDate":"2023-11-20 18:23:10","image_url":null,"source_id":"ndtv","source_priority":1204,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"2e861fc0f83ebcafedcb6971a45dab6f","title":"Pakistan unveil Shan Masood-led Test squad for Australia tour, eye fresh start after disappointing World Cup","link":"https://www.firstpost.com/firstcricket/sports-news/pakistan-unveil-shan-masood-led-test-squad-for-australia-tour-eye-fresh-start-after-disappointing-world-cup-13409952.html","keywords":["First Cricket News"],"creator":["Amit Banerjee"],"video_url":null,"description":"Pakistan unveil Shan Masood-led Test squad for Australia tour, eye fresh start after disappointing World Cup","content":"Cricket Pakistan unveil Shan Masood-led Test squad for Australia tour, eye fresh start after disappointing World Cup Top-order batter Masood replaced Babar Azam as Test skipper following Pakistan's disappointing run in the recently-concluded World Cup, where they failed to reach the semi-finals after losing five out of nine matches. Agence France-Presse November 20, 2023 23:23:50 IST File image of newly-appointed Pakistan Test captain Shan Masood. AP Lahore : Under a new skipper in Shan Masood, Pakistan on Monday named a squad of fresh faces for a tough tour of Australia starting next month, seeking a fresh start after a disastrous World Cup campaign. Following the World Cup where Pakistan lost five of their nine matches and finished fifth, the country’s cricket board overhauled the national team, with Babar Azam resigning as captain of all three formats. Team director Mickey Arthur and head coach Grant Bradburn have been removed from their positions with former skipper Mohammad Hafeez taking over both their roles. Related Articles World Cup 2023: 'Qudrat Ka Nizam' doesn't come to rescue as Pakistan miss out on semis yet again World Cup 2023: Pakistan cricket team arrive in Lahore after dismal campaign; Watch Masood was given the reins of the Test captaincy while Shaheen Shah Afridi was appointed Twenty20 captain. 🚨 SQUAD ANNOUNCED 🚨 Our 18-member squad for the three-match Test series against Australia 🇵🇰 Read more ➡️ https://t.co/eHP9NXPkOu #AUSvPAK | #BackTheBoysInGreen pic.twitter.com/ioKnv0cBxJ — Pakistan Cricket (@TheRealPCB) November 20, 2023 Wahab Riaz, another former fast bowler, was appointed chief selector following Inzamam-ul-Haq’s resignation and stressed performers in domestic competition were chosen for the three-match Test tour. “Australia is always a tough tour but we think that these players have the capability and capacity to not only do well, but come out winners.” Pakistan have performed poorly in Australia, however, losing 14 Tests on the trot with a last success in 1995. The series starts with the first Test in Perth (14-18 December) followed by the Boxing Day Test in Melbourne (26-30 December) and Sydney (3-7 January). Uncapped fast bowler Khurram Shahzad is rewarded for being the highest wicket-taker in the country’s premier First-Class tournament this year with 36 wickets. Dashing left-hander Saim Ayub and all-rounder Aamer Jamal have represented Pakistan in Twenty20 internationals but are untested in the five-day format. Shaheen is the only fast bowler to have played in Australia, while Naseem Shah was not considered as he was still recovering from a shoulder injury that ruled him out of the World Cup. Squad : Shan Masood (captain), Aamer Jamal, Abdullah Shafique, Abrar Ahmed, Babar Azam, Faheem Ashraf, Hasan Ali, Imam-ul-Haq, Khurram Shahzad, Mir Hamza, Mohammad Rizwan, Mohammad Wasim, Noman Ali, Saim Ayub, Agha Salman, Sarfaraz Ahmed, Saud Shakeel, Shaheen Shah Afridi Join our Whatsapp channel to get the latest global news updates Published on: November 20, 2023 23:23:50 IST Tags: Australia Vs Pakistan Cricket Pakistan Cricket Team Shan Masood","pubDate":"2023-11-20 17:53:50","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2020/08/Shan-Masood-ton-ENGvPAK-1st-Test-640-photopost_AP.jpg","source_id":"firstpost","source_priority":5906,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"39c807057c3cc039dd1ce01b2c2bdfb1","title":"Indian pacers’ workload to be carefully managed during hectic winter schedule: Paras Mhambrey","link":"https://www.firstpost.com/firstcricket/sports-news/indian-pacers-workload-to-be-carefully-managed-during-hectic-winter-schedule-paras-mhambrey-13409962.html","keywords":["First Cricket News"],"creator":["Amit Banerjee"],"video_url":null,"description":"Indian pacers’ workload to be carefully managed during hectic winter schedule: Paras Mhambrey","content":"Cricket Indian pacers’ workload to be carefully managed during hectic winter schedule: Paras Mhambrey India have a hectic schedule this winter with two Tests in South Africa in December-January followed by five games against England at home between January and March. Press Trust of India November 20, 2023 23:09:13 IST Jasprit Bumrah and Mohammed Shami played key roles in India's run to the final of the 2023 ICC World Cup, with the latter finishing at the top of the wicket-takers' list. AP Ahmedabad : The Indian pacers’ workload will have to be carefully monitored during the upcoming World Test Championship series against South Africa and England comprising seven Tests, said bowling coach Paras Mhambrey India will play a two-Test series in the Rainbow Nation in December-January, followed by five games against England at home between January and March. Shami (24 wickets in 7 games, 48.5 overs), Bumrah (20 wickets, 11 games, 91.5 overs) and Siraj (14 wickets, 82.3 overs, 11 games) did a lot of bowling in the World Cup. They have been on the road since Asia Cup in August-September. Related Articles World Cup 2023: We have the right bowlers to exploit different conditions, says India bowling coach Paras Mhambrey World Cup 2023: Why current Indian bowling unit is among the greatest ever at showpiece event “We will have to be very smart with the way we go forward in terms of managing the workload. These guys have played a lot of cricket, so we need to see how we want to go about it. “We haven’t discussed it yet,” Mhambrey, whose contract also ended with World Cup, said during an interaction with reporters in mixed zone on Sunday. Mhambrey has had a quiet yet impactful back-room presence as he devised strategies with the pace unit for various oppositions. It will be interesting to see what will be Bumrah’s take on Test matches and whether his body will hold the rigours of the five-day game. “We missed Bumrah for a major part, and you see the difference he brings when he is in the side. The way he has gone in this tournament especially, it’s massive. “It has been challenging, but looking at the other side of it, it has also been an opportunity for us to work on the bench-strength,” the former Mumbai and India seamer said. While the Indian team has a fantastic front-line of pacers, Mhambrey is also excited about the next crop. “There is Mukesh (Kumar), Prasidh (Krishna), Avesh (Khan) and Kuldeep (Sen). I would look at it that way,” Mhambrey said. The bowling coach termed Shami’s wicket-taking spree as incredible despite not playing the first four games. “He (Shami) was incredible. He obviously hadn’t played the initial games, but the way he came back and bowled throughout the tournament was incredible. “That’s not something we expected, but we always knew that he always has that positive impact on the game. He has been phenomenal,” Mhambrey said. Join our Whatsapp channel to get the latest global news updates Published on: November 20, 2023 23:09:13 IST Tags: Cricket Indian Cricket Team Paras Mhambrey","pubDate":"2023-11-20 17:39:13","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/10/Jasprit-Bumrah-Mohammed-Shami-IND-ENG-WC-AP-640.jpg","source_id":"firstpost","source_priority":5906,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"80076dd40b2361ef95402c946c553e84","title":"Sport | Proteas World Cup ratings: Karate Kid kicks a record-breaking punch, Bavuma battles","link":"https://www.news24.com/sport/cricket/worldcup/proteas-world-cup-ratings-karate-kid-kicks-a-record-breaking-punch-bavuma-battles-20231120","keywords":null,"creator":null,"video_url":null,"description":"The Proteas delivered a heartening World Cup campaign that culminated in a semi-final loss that was much more than what was expected of them before the tournament started. News24 Sport runs the rule over each squad member's campaign.","content":null,"pubDate":"2023-11-20 17:31:23","image_url":"https://cdn.24.co.za/files/Cms/General/d/9592/015f9deb3e344c788328465cc42f8608.jpg","source_id":"news24","source_priority":1882,"country":["south africa"],"category":["sports"],"language":"english"},{"article_id":"78f3bafc41bba5187ddb77cfca43a08c","title":"World Cup 2023: From Babar Azam to Jos Buttler, top players who flopped in showpiece event","link":"https://www.firstpost.com/firstcricket/sports-news/world-cup-2023-from-babar-azam-to-jos-buttler-top-players-who-flopped-in-showpiece-event-13408112.html","keywords":["First Cricket News"],"creator":["PN Vishnu"],"video_url":null,"description":"World Cup 2023: From Babar Azam to Jos Buttler, top players who flopped in showpiece event","content":"Cricket World Cup 2023: From Babar Azam to Jos Buttler, top players who flopped in showpiece event There were a few players who flopped as well in the showpiece event. With the 13th edition of the ODI World Cup done and dusted, let’s now take a look at some top flops from the event. FirstCricket Staff November 20, 2023 22:59:16 IST Pakistan's captain Babar Azam managed just 320 runs from nine matches in the 2023 World Cup. AP He just-concluded 2023 Cricket World Cup produced some stellar individual performances with both the bat and ball. There were close finishes, game-changing bowling spells and catches those won matches. World Cup 2023: News | Schedule | Results | Points table The World Cup had it all. Top established stars like Virat Kohli and Glenn Maxwell broke records, whereas we also witnessed the arrival of players like Rachin Ravindra and Travis Head at the big stage. Related Articles Jos Buttler wants to remain England white-ball captain despite dismal World Cup 'Babar Azam could not prove himself as a good leader': Ex-cricketers slam Pakistan captain for World Cup woes Also read: Rohit Sharma’s India didn’t win World Cup, but captain’s blueprint is the way forward However, it was not always the stars that made the headlines. There were a few players who flopped as well in the showpiece event. With the 13th edition of the ODI World Cup done and dusted, let’s now take a look at some top flops from the event: Babar Azam (Pakistan) Babar Azam had a difficult outing as Pakistan skipper in the 2023 World Cup. He failed to lead his team to the semi-finals, with the Men in Green eventually finishing fifth with just eight points. The aftermath of that had a major impact on Pakistan cricket, with Babar stepping down as skipper across all formats. More so, Babar did not have the best of performances with the bat as well. He managed 320 runs from nine matches at an average of 40, but his strike rate of below 100 across matches came under scrutiny. He scored four fifties and not even a single century this tournament, which has led to further imbalance in the Pakistan batting lineup. Jos Buttler (England) England came into the World Cup as defending champions and a lot was riding on captain Jos Buttler. However, Buttler struggled with the bat big time. The highest score for the 33-year-old this World Cup was 43 against New Zealand in the opening match of the tournament, and things have gone downhill for Buttler ever since. Jos Buttler managed just 138 runs from nine matches. AP His next best score was 27 runs against Pakistan in England’s final game, and also endured four single-figure dismissals in these nine games. Shakib Al Hasan (Bangladesh) Much was expected from Bangladesh skipper Shakib Al Hasan. Shakib had finished with 606 runs in the 2019 edition of the Cricket World Cup in England, but failed to replicate that similar kind of form this time around. Shakib could not even score half of what he did in 2019, managing just 186 runs from seven matches at an average of 26.57. Add to this, he had a tournament to forget for reasons apart from his batting or captaincy. In particular, the way he dealt with the “Timed Out” dismissal of Angelo Mathews when Bangladesh took on Sri Lanka in Delhi. Shakib was eventually ruled out of Bangladesh’s final group game against Australia with a finger injury, that eventually meant Najmul Hossain Shanto led the team in his place. Kagiso Rabada (South Africa) In the absence of the injured Anrich Nortje, Kagiso Rabada was expected to lead the South African pace attack. While Rabada is pretty familiar with Indian conditions thanks to his IPL experience, the 28-year-old had a much below par performance with the ball, scalping just 13 wickets from nine games. Although Rabada would start strongly, picking seven wickets from the first three games, he would only manage to take another six wickets from the next six games, while also struggling in the powerplay against Australia in the semi-final, where he would get hit for a few sixes by David Warner and later Travis Head. Maheesh Theekshana (Sri Lanka) Maheesh Theekshana came into the World Cup following a productive run in the Asia Cup, having taken nine wickets from four games. However, Theekshana failed to find his rhythm in the World Cup, scalping just six wickets from eight games. And expensive figures of 0/55 and 0/67 against Afghanistan and India respectively did not help the off-spinners’ case. To add to these woes, Theekshana also missed having Wanindu Hasaranga as a spin-bowling partner in the middle overs, with Theekshana himself having said that bowling without the 26-year-old was challenging. Join our Whatsapp channel to get the latest global news updates Published on: November 20, 2023 16:57:47 IST Tags: Babar Azam Cricket Jos Buttler World Cup 2023","pubDate":"2023-11-20 17:29:16","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/11/Babar-Azam-640-ENGvPAK_AP.jpg","source_id":"firstpost","source_priority":5906,"country":["india"],"category":["sports"],"language":"english"}]}