{"newsArray":[{"title":"Duleep Trophy 2022-23 LIVE Score Updates, Day 4: West Zone to resume batting with 367-run lead","link":"https://sportstar.thehindu.com/cricket/domestic/duleep-trophy-2022-live-score-updates-day-4-west-zone-vs-northeast-north-east-highlights-streaming-details/article65878007.ece","keywords":null,"creator":["\n        Team Sportstar  \n    "],"video_url":null,"description":"Duleep Trophy, Day 4, Indian domestic cricket: Here are the live score updates, highlights, commentary and more from the 2022-23 season’s first First-Class tournament.","content":null,"pubDate":"2022-09-11 03:18:03","image_url":null,"source_id":"sportstar","country":["india"],"category":["sports"],"language":"english"},{"title":"Asia Cup Final: Underdogs Sri Lanka face favourites Pakistan","link":"https://timesofindia.indiatimes.com/sports/cricket/asia-cup/asia-cup-2022-final-underdogs-sri-lanka-face-favourites-pakistan/articleshow/94125803.cms","keywords":null,"creator":null,"video_url":null,"description":"Every time the fixtures for the Asia Cup are drawn, it all about making up for the lack of India-Pakistan bilateral cricket.","content":"Team India's early exit may have disrupted plans of organisers but finalists Pakistan & Lanka have lit up the tournament with their passionate brand of cricket DUBAI: Every time the fixtures for the Asia Cup are drawn, it all about making up for the lack of India-Pakistan bilateral cricket. The scheduling, no doubt, gives precedence to India's convenience. The other teams hustle between Dubai and Sharjah. They get less breathing space going into a final. India are the marquee team, always. The market forces, broadcasters and caretakers of the game bank on India's presence right through the tournament. This time, though, there is no Indian team for the last four days of the tournament. The buzz has fizzled out real fast. It's sort of an anti-climax for the stakeholders. Yet, there is a final to be played on Sunday night. Pakistan and Sri Lanka , the two finalists, were made to play a meaningless game on Friday night. Both teams called off their training sessions and media interactions on the eve of the final. The final could signal the re-emergence of two teams which had fallen behind in cricket's power circuit over the last decade. On cricketing grounds, these two teams, along with spirited Afghanistan , have lit up the tournament. Four years ago, the organisers were in a similar space when Pakistan crashed out two nights before the final. India's presence was a respite. But this tournament has challenged t heir marketing strategies. The buzz here was always in anticipation of an India-Pakistan final, rounding off a possible three-match contest between the two teams. On pre-tournament form and environment, few would have fancied Sri Lanka, Bangladesh and Afghanistan to make the final. India's collapse in the tournament has created an awkward situation with tickets now. Roaming around the Dubai Sports City, which houses the Dubai International Cricket stadium, you could find Pakistan and Sri Lankan fans stressed about getting tickets for Sunday's game. The reason? The majority of tickets were already booked by Indian fans. A lot of the Indian fans are now trying to sell off their tickets on social media. India's early exit may have been a financial disruption. But that can't take away from the fact the two teams taking the field on Sunday are the teams that have played with immaculate planning and overwhelming passion. \"When it comes to Asian cricket it's India-Pakistan everyone talks about, but we've got a very good team, which can win. We would rather concentrate on the way we are playing,\" Lanka's captain Dasun Shanaka said. Pakistan captain Babar Azam , meanwhile, said, \"We have seen some great performances and different players have impressed. When building a team, it is great for us that different players have stood up. As a captain this is important for me, and it helps pave the path to future success for the team as well.\"","pubDate":"2022-09-11 02:35:50","image_url":null,"source_id":"toi","country":["india"],"category":["sports"],"language":"english"},{"title":"Pakistan vs Sri Lanka Asia Cup 2022 FINAL Live Streaming Details: When and where to watch SL vs PAK online, cricket schedule, TV timing, channel in India","link":"https://zeenews.india.com/cricket/pakistan-vs-sri-lanka-asia-cup-2022-final-live-streaming-details-when-and-where-to-watch-sl-vs-pak-online-cricket-schedule-tv-timing-channel-in-india-2508480.html","keywords":null,"creator":null,"video_url":null,"description":"Here's all you need to know about Asia Cup 2022 final between Sri Lanka and Pakistan: From live streaming, venue, probable playing XIs and more.","content":"The Asia Cup 2022 final is here and we have two top teams from the tournament in Sri Lanka and Pakistan taking on each other in the summit clash that will take place on September 11 (Sunday) in Dubai. The high-octane match will see the Asia giants clash with each other. While Babar Azam's Pakistan was expected to make the cut to the final, Sri Lanka have definitely surprised a few people by punching above their weight and beating India in the Super 4 stage to confirm their spot in the final. Dasun Shanaka's side started off the tournament on a bad note as Afghanistan thrashed them in the first match but since then they have not looked behind. They beat Bangladesh, India and Afghanistan to qualify for the final and not to forgetm, they have also beaten Pakistan in the last fixture of the Super 4s stage. One thing, however, that has gone in favour of them is the toss. Toss has been very crucial in Dubai, where teams who chase win often. That has been the case in this Asia Cup as well. It will continue to play a big role on Sunday's final also. We're dialing up the excitement as Sri Lanka __ and Pakistan __ greet each other for the Final of the DP World #AsiaCup 2022 _ tomorrow! Catch all the action LIVE exclusively on Disney+ Hotstar and Star Sports _ #SLvPAK #ACC #AsiaCup2022 #GetReadyForEpic #AsiaCup pic.twitter.com/1SOy9zAF0R — AsianCricketCouncil (@ACCMedia1) September 10, 2022 As far as Pakistan are concerned, the loss of Sri Lanka came as a shock to the cricket-mad nation. They need to pull up their socks and give their best. One of the major concerns for Men in Green is the form of their captain babar Azam who has not looked at his best in the tournament. Pakistan will hope he fires tonight as the T20 World Cup 2022 inches closer. Mohammad Rizwan, Naseem Shah, Shadab Khan will be other key players for Pakistan, who have delivered the goods in the tournament. Here's all you need to know about the Asia Cup 2022 final between Sri Lanka vs Pakistan When will Sri Lanka vs Pakistan Asia Cup 2022 final match take place? Sri Lanka vs Pakistan Asia Cup 2022 final match will be played on Sunday, September 11. Where will Sri Lanka vs Pakistan Asia Cup 2022 final match take place? Sri Lanka vs Pakistan Asia Cup 2022 final match will be played at Dubai International Stadium in Dubai. What time will Sri Lanka vs Pakistan Asia Cup 2022 final match begin? Sri Lanka vs Pakistan Asia Cup 2022 final match will begin at 7:30 PM IST. Where can you watch Sri Lanka vs Pakistan Asia Cup 2022 final match live on TV in India? Sri Lanka vs Pakistan Asia Cup 2022 final match will be telecasted on the Star Sports Network channels in India. Where can you watch Sri Lanka vs Pakistan Asia Cup 2022 final match live streaming in India? Sri Lanka vs Pakistan Asia Cup 2022 final match live streaming will be available on the Disney+Hotstar app and website in India.","pubDate":"2022-09-11 01:56:00","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"England's Robinson sparks SA collapse in third Test","link":"https://www.thenews.com.pk/print/990312-england-s-robinson-sparks-sa-collapse-in-third-test","keywords":null,"creator":null,"video_url":null,"description":"LONDON: Ollie Robinson took his best figures for England as South Africa slumped to 118 all out in the third and deciding Test at the Oval on Saturday after cricket paid its respects to Britain’s Queen Elizabeth II.Robinson took 5-49 in 14 overs, his third five-wickets in an innings haul at...","content":"LONDON: Ollie Robinson took his best figures for England as South Africa slumped to 118 all out in the third and deciding Test at the Oval on Saturday after cricket paid its respects to Britain’s Queen Elizabeth II. .ads_between_content{ height:auto; width:auto; clear: both; text-align: center; } .ads_between_content .story_ads{ } /*@media (max-width:600px){ .ads_between_content{ float:none; margin:0px auto; text-align: center; } }*/ Robinson took 5-49 in 14 overs, his third five-wickets in an innings haul at this level and the best of the 28-year-old Sussex seamer’s 11-Test career, surpassing his 5-65 against India at Leeds last year. He received excellent support from veteran England quick Stuart Broad, who took 4-41 as South Africa were bowled out in a mere 36.2 overs. At tea, England were 84-2, a first-innings deficit of just 34 runs. Ollie Pope was 38 not out on his Surrey home ground, with 32 of those runs coming in boundaries, while star batsman Joe Root was 23 not out – his first double-figure score of the series. Earlier, only two Proteas batsmen made it past 20, recalled quick Marco Jansen top-scoring with 30 and Khaya Zondo, in his first Test innings, making 23. Left-arm quick Jansen, unlucky to be dropped for the second Test at Old Trafford, where England won to level this three-match series at 1-1, then starred with the ball as he reduced the hosts to 43-2 by removing struggling openers Alex Lees (13) and Zak Crawley (five). He bowled left-hander Lees between bat and then had Crawley plumb lbw during a return of 2-19 in six overs. With the opening day washed out without a ball bowled and no play on Friday following the death of Britain’s longest-serving monarch on Thursday, concerns had been expressed as to whether the game could be completed inside three days. But that ignored the fact that South Africa had thrashed England by an innings and 12 runs at Lord’s inside three days before the hosts needed a similar amount of time to win the second Test in Manchester by an innings and 85 runs. Although there had been no play Thursday, the toss had taken place, with England captain Ben Stokes opting to bowl first and Saturday’s overcast conditions once more favoured the bowlers. After a minute’s silence had been observed in memory of the Queen, with the first rendition at a major sporting event of ‘God Save the King’ – Britain’s now altered national anthem given Charles III is the new monarch, South Africa’s longstanding top-order trouble again became apparent. Score Board England won the toss South Africa 1st Innings Elgar (c) b Robinson 1 Erwee cÜ Foakes b Anderson 0 Petersen b Robinson 12 Rickelton c ÜFoakes b Broad 11 Zondo c Lees b Broad 23 Verreynne Ü c ÜFoakes b Robinson 0 Mulder c ÜFoakes b Robinson 3 Jansen c Root b Robinson 30 Maharaj b Broad 18 Rabada not out 7 Nortje c Stokes b Broad 7 Extras: (lb 2, nb 4) 6 Total: 36.2 Ov (RR: 3.24) 118 Fall: 1-2, 1.3 ov, 2-7, 2.2 ov, 3-21, 5.4 ov, 4-31, 8.6 ov, 5-32, 9.3 ov, 6-36, 11.5 ov, 7-72, 24.6 ov, 8-99, 33.2 ov, 9-110, 34.5 ov, 10-118, 36.2 ov Bowling: James Anderson 8-2-16-1, Ollie Robinson 14-3-49-5, Stuart Broad 12.2-1-41-4, Jack Leach 2-1-10-0 Umpires: Nitin Menon, Richard Kettleborough","pubDate":"2022-09-11 01:00:00","image_url":null,"source_id":"thenews","country":["pakistan"],"category":["sports"],"language":"english"},{"title":"English cricket says farewell to Queen Elizabeth II","link":"https://www.thenews.com.pk/print/990322-english-cricket-says-farewell-to-queen-elizabeth-ii","keywords":null,"creator":null,"video_url":null,"description":"LONDON: The Oval has known many ´departures´ given it often stages the last Test of an English cricket season, with Australia great Don Bradman and former England captain Alastair Cook taking their leave of the international stage at the ground.But the south London venue fell silent on...","content":"LONDON: The Oval has known many ´departures´ given it often stages the last Test of an English cricket season, with Australia great Don Bradman and former England captain Alastair Cook taking their leave of the international stage at the ground. .ads_between_content{ height:auto; width:auto; clear: both; text-align: center; } .ads_between_content .story_ads{ } /*@media (max-width:600px){ .ads_between_content{ float:none; margin:0px auto; text-align: center; } }*/ But the south London venue fell silent on Saturday before the start of the third day´s play in the third Test between England and South Africa for a farewell of a very different kind as the ground paid tribute to Queen Elizabeth II. The death of Britain´s longest-serving monarch at the age of 96 on Thursday had led the England and Wales Cricket Board (ECB) to abandon Friday´s play. And with Thursday´s opening day washed out, it meant what should have been a five-day match had now been reduced to a three-day game. Unlike their counterparts at English football´s Premier League, who have suspended their fixtures this weekend, the ECB decided to resume play Saturday. - ´Incredible inspiration´ - \"It´s been very sad news for not only the nation but the world with the Queen´s passing,\" England captain Ben Stokes told Sky Sports before play on Saturday. \"She was someone who dedicated her life to the nation, someone that we take incredible inspiration from and we are honoured to be able to walk out on the field in memory of the Queen.\" The all-rounder added: \"We know how much the Queen loved this sport, and the show must go on. I´m sure she´ll be looking down on all the sport that´s still going ahead over this weekend and that we´re going out there in her honour. I´m very pleased and proud we can do that.\" As spectators took their seats at the Oval, they would have noticed a few changes, with the usual advertising signs on the perimeter hoardings replaced by black and white messages marking the death of the Queen. Then, 10 minutes before the scheduled start of play at 11:00 am (1000 GMT), the players and match officials -- all wearing black armbands as a sign of respect -- walked onto the outfield through a military guard of honour. Under grey skies, and with the Union flag flying alone above the pavilion -- where the England and South Africa flags would usually have been on display as well -- a near capacity crowd of 27,500 then observed a minute´s silence. With the teams and officials still lined up in front of the pavilion, professional singer Laura Wright -- well known for her performances at sporting events -- sung the South African national anthem unaccompanied as the crowd listened in silence before politely applauding. Wright then delivered the first performance of ´God Save the King´, Britain´s now slightly but significantly altered national anthem, at a major sporting event since the Queen´s death, with the crowd -- most of whom had never known about anything but ´God Save the Queen´ -- joining in. Honouring the Queen at the Oval, which staged the first Test in England in 1880, seemed all the more appropriate given the ground is owned by the Duchy of Cornwall private estate. The duchy, created in 1337 by King Edward III for his son and heir, was until Thursday controlled by the Duke of Cornwall, who is now the king. In one of his first acts as monarch, Charles made his elder son and heir Prince William the new Duke of Cornwall. Mark Henderson, attending the match with his wife Niki and their children Anna, a member of the Surrey Under-11 squad and nine-year-old Tom, had no doubt officials had been correct to restart the match on Saturday. \"I think it was absolutely the right thing to do,\" Henderson, 48, told AFP. \"I think the Queen more than anybody had a spirit of ´keep on, keeping on´, of keep doing things in difficult circumstances.\" Henderson, the director of communications at the Wellcome Trust health foundation, added: \"I think she would have wanted sport, which she cared a lot about particularly, to continue. I think the decision was completely vindicated by the reaction of the Oval crowd this morning.","pubDate":"2022-09-11 01:00:00","image_url":null,"source_id":"thenews","country":["pakistan"],"category":["sports"],"language":"english"},{"title":"Duleep Trophy: Yash Dhull hits 193 as North Zone take lead","link":"https://www.tribuneindia.com/news/sports/duleep-trophy-yash-dhull-hits-193-as-north-zone-take-lead-430552","keywords":null,"creator":null,"video_url":null,"description":"Puducherry Talented batter Yash Dhull hit a superb 193 decorated with 28 fours and two sixes to power North Zone to 433/3 in their first innings at stumps on Day 3 of the Duleep Trophy quarter-finals against East Zone here today. In Chennai, the formidable West Zone bowlers faced unexpected resistance from the North East Zone batters before dismissing them for 235 in 81.5 overs to secure a massive 367-run first innings lead on the third day of the other quarterfinal. New Delhi Injured Bopanna pulls out of Davis Cup tie vs Norway Veteran doubles ace Rohan Bopanna has pulled out of India's upcoming Davis Cup tie against Norway due to a knee injury. India will play an away tie on September 16 and 17. Kathmandu SAFF C'ship: India thrash Maldives, make it to semis Anju Tamang pumped in four goals, while Dangmei Grace struck a brace as India toyed with Maldives to register a thumping 9-0 win in the SAFF Women's Championship at the Dashrath Stadium today. Cairns (Australia) Australia captain Aaron Finch to retire from ODIs Australia captain Aaron Finch says he's retiring from One-day International cricket effective Sunday after the team plays New Zealand in the third and final ODI. Milan Inter's Brozovic grabs late goal to secure 1-0 victory A late goal from Marcelo Brozovic gave Inter Milan a 1-0 win at home to Torino in Serie A on Saturday but they also had to thank goalkeeper Samir Handanovic who made several fine saves. — Agencies","content":"Puducherry Talented batter Yash Dhull hit a superb 193 decorated with 28 fours and two sixes to power North Zone to 433/3 in their first innings at stumps on Day 3 of the Duleep Trophy quarter-finals against East Zone here today. In Chennai, the formidable West Zone bowlers faced unexpected resistance from the North East Zone batters before dismissing them for 235 in 81.5 overs to secure a massive 367-run first innings lead on the third day of the other quarterfinal. New Delhi Injured Bopanna pulls out of Davis Cup tie vs Norway Veteran doubles ace Rohan Bopanna has pulled out of India’s upcoming Davis Cup tie against Norway due to a knee injury. India will play an away tie on September 16 and 17. Kathmandu SAFF C’ship: India thrash Maldives, make it to semis Anju Tamang pumped in four goals, while Dangmei Grace struck a brace as India toyed with Maldives to register a thumping 9-0 win in the SAFF Women’s Championship at the Dashrath Stadium today. Cairns (Australia) Australia captain Aaron Finch to retire from ODIs Australia captain Aaron Finch says he’s retiring from One-day International cricket effective Sunday after the team plays New Zealand in the third and final ODI. Milan Inter’s Brozovic grabs late goal to secure 1-0 victory A late goal from Marcelo Brozovic gave Inter Milan a 1-0 win at home to Torino in Serie A on Saturday but they also had to thank goalkeeper Samir Handanovic who made several fine saves. — Agencies","pubDate":"2022-09-11 00:39:44","image_url":"https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/9/2022_9$largeimg_1425485416.jpg","source_id":"tribuneindia","country":["india"],"category":["sports"],"language":"english"},{"title":"Asia Cup: With their mojo back, can Sri Lanka conquer Asia?","link":"https://www.tribuneindia.com/news/sports/asia-cup-with-their-mojo-back-can-sri-lanka-conquer-asia-430536","keywords":null,"creator":null,"video_url":null,"description":"Dubai, September 10 Coming off a socio-economic crisis and the worst turmoil in the country's history, the Sri Lankan cricket team would like to provide the island nation with an emotional catharsis by beating the fancied Pakistan in the Asia Cup final here tomorrow. Sri Lanka were to host the tournament but due to a cruel twist of fate the tournament had to be shifted to the UAE for security reasons. It could have been infinitely sweeter had Dasun Shanaka and his men played the final at the iconic Khettarama Stadium (now Premadasa Stadium). Nevertheless, the performance they have produced in the Super 4s stage here would make anyone believe that they are the favourites against Babar Azam's Pakistan. However, Friday's loss to Sri Lanka is just the warning that Pakistan needed to be on their guard on Sunday. Sri Lanka look like a team rejuvenated. The team that Shanaka led during their away series in India some six months back had more or less the same bunch of players, but what Sri Lanka have now done successfully is to change their T20 gameplan, which is now filled with aggression. Even without Dushmantha Chameera, the bowling attack has looked potent. In the batting department, their top-five batters have been extremely effective — something India head coach Rahul Dravid should take note of. Two right-handed openers — Kusal Mendis and Pathum Nissanka — have been positivity personified at the top while likes of Danushka Gunathilaka, Bhanuka Rajapaksa, Shanaka himself and Chamika Karunaratne have all made runs when it mattered. In the five games so far, the Sri Lankan batters have hit 28 sixes and 62 fours, which gives a clue about their approach. In comparison, Pakistan have made it to the final but Azam's own form has deserted him throughout the tournament. Only 63 runs from five games isn't something one expects from a player of his calibre. The skipper would be looking to atone for it on Sunday. Pakistan's strength is their bowling attack that has Naseem Shah, showing improvement with each passing day, along with Harris Rauf and Mohammed Hasnain. They have good spin options too, including the wily Shadab Khan. — PTI 28 In the five games so far, the Sri Lankan batters have hit 28 sixes and 62 fours. 4 This is the fourth time Sri Lanka and Pakistan are playing an Asia Cup final, with Sri Lanka winning two of the previous three.","content":"Dubai, September 10 Coming off a socio-economic crisis and the worst turmoil in the country’s history, the Sri Lankan cricket team would like to provide the island nation with an emotional catharsis by beating the fancied Pakistan in the Asia Cup final here tomorrow. Sri Lanka were to host the tournament but due to a cruel twist of fate the tournament had to be shifted to the UAE for security reasons. It could have been infinitely sweeter had Dasun Shanaka and his men played the final at the iconic Khettarama Stadium (now Premadasa Stadium). Nevertheless, the performance they have produced in the Super 4s stage here would make anyone believe that they are the favourites against Babar Azam’s Pakistan. However, Friday’s loss to Sri Lanka is just the warning that Pakistan needed to be on their guard on Sunday. Sri Lanka look like a team rejuvenated. The team that Shanaka led during their away series in India some six months back had more or less the same bunch of players, but what Sri Lanka have now done successfully is to change their T20 gameplan, which is now filled with aggression. Even without Dushmantha Chameera, the bowling attack has looked potent. In the batting department, their top-five batters have been extremely effective — something India head coach Rahul Dravid should take note of. Two right-handed openers — Kusal Mendis and Pathum Nissanka — have been positivity personified at the top while likes of Danushka Gunathilaka, Bhanuka Rajapaksa, Shanaka himself and Chamika Karunaratne have all made runs when it mattered. In the five games so far, the Sri Lankan batters have hit 28 sixes and 62 fours, which gives a clue about their approach. In comparison, Pakistan have made it to the final but Azam’s own form has deserted him throughout the tournament. Only 63 runs from five games isn’t something one expects from a player of his calibre. The skipper would be looking to atone for it on Sunday. Pakistan’s strength is their bowling attack that has Naseem Shah, showing improvement with each passing day, along with Harris Rauf and Mohammed Hasnain. They have good spin options too, including the wily Shadab Khan. — PTI 28 In the five games so far, the Sri Lankan batters have hit 28 sixes and 62 fours. 4 This is the fourth time Sri Lanka and Pakistan are playing an Asia Cup final, with Sri Lanka winning two of the previous three.","pubDate":"2022-09-11 00:39:08","image_url":"https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/9/2022_9$largeimg_636071558.jpg","source_id":"tribuneindia","country":["india"],"category":["sports"],"language":"english"},{"title":"Finch made the right call, says Tubby","link":"https://www.theage.com.au/sport/cricket/finch-made-the-right-call-says-tubby-20220911-p5bh4w.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":null,"video_url":null,"description":"Australian cricket legend Mark Taylor says Aaron Finch made the right call to quit the ODI team.","content":null,"pubDate":"2022-09-11 00:35:15","image_url":null,"source_id":"theage","country":["australia"],"category":["sports"],"language":"english"},{"title":"Asia Cup Final 2022: Live streaming, How to watch Pakistan vs. Sri Lanka?","link":"https://www.business-standard.com/article/sports/asia-cup-final-2022-live-streaming-how-to-watch-pakistan-vs-sri-lanka-122091000820_1.html","keywords":null,"creator":null,"video_url":null,"description":"Asia Cup 2022: Pakistan cricket team is all set to avenge their defeat against Sri Lanka in the finals. Read this detailed report on where can you live stream the match or enjoy the live telecast","content":"Sri Lanka will play Pakistan for the fourth time in the Asia Cup finals on Sunday, September 11. Before that, Pakistan played thrice, won once, and lost thrice against the Lankan lions. Dominated as the table toppers, Sri Lanka will have an upper edge against Pakistan, who made an exceptional comeback in the Super 4. Also read | Asia Cup Final 2022, SL vs. PAK: Ticket prices and how to book them online Dubai International Cricket Stadium's pitch has been a sweet dream for batters who love chasing. With the dew factor coming in, most teams prefer to chase instead of setting up a total. Though Babar Azam's men had lost the rehearsal match, they hope to bounce back with a better performance against the five-time Asia cup champions, Sri Lanka . Also, read | Asia Cup 2022 points table: Sri Lanka stays on top of the table Asia Cup Final 2022: Live Streaming The official broadcasters of Asia Cup 2022 are Star Sports Network. Thus, you can enjoy live telecasts on Television on specific Star sports channels and live streaming online on the Disney Plus Hotstar app. Asia Cup Final 2022: Sri Lanka vs. Pakistan head-to-head Pakistan has the edge over Sri Lanka in the number of International matches won. Out of 234 International matches across three formats, Pakistan has won 126 times, while Sri Lanka won only 84. In the Asia cup finals, Sri Lanka won twice, while Pakistan defeated them only once, in the 2000 edition. Check out the table given below. Format Matches played Pakistan won Sri Lanka won No result Tied/Drawn ODI 155 92 58 4 1 T20I 22 13 9 0 0 Test 57 21 17 0 10 Total 234 126 84 4 11 Asia Cup Final 2022: Sri Lanka Squad Pathum Nissanka, Kusal Mendis (wk), Dhananjaya de Silva, Danushka Gunathilaka, Bhanuka Rajapaksa, Dasun Shanaka (c), Wanindu Hasaranga, Chamika Karunaratne, Pramod Madushan, Maheesh Theekshana, Dilshan Madushanka, Dinesh Chandimal, Jeffrey Vandersay, Ashen Bandara, Praveen Jayawickrama, Nuwanidu Fernando, Nuwan Thushara, Matheesha Pathirana, Charith Asalanka and Asitha Fernando Asia Cup Final 2022: Pakistan Squad Mohammad Rizwan (wk), Babar Azam (c), Fakhar Zaman, Iftikhar Ahmed, Khushdil Shah, Asif Ali, Mohammad Nawaz, Hasan Ali, Haris Rauf, Mohammad Hasnain, Usman Qadir, Haider Ali, Shahnawaz Dahani, Shadab Khan and Naseem Shah Asia Cup Final 2022: Sri Lanka in the last ten matches Date Opponent Venue Result 26/02/2022 India Himachal Pradesh Cricket Association Stadium India won by 7 wickets 27/02/2022 India Himachal Pradesh Cricket Association Stadium India won by 6 wickets 7/6/2022 Australia R Premadasa Stadium Australia won by 10 wickets 8/6/2022 Australia R Premadasa Stadium Australia won by 3 wickets 11/6/2022 Australia Pallekele International Cricket Stadium Sri Lanka won by 4 wickets 27/08/2022 Afghanistan Dubai International Cricket Stadium Afghanistan won by 8 wickets 1/9/2022 Bangladesh Dubai International Cricket Stadium Sri Lanka won by 2 wickets 3/9/2022 Afghanistan Sharjah Cricket Stadium Sri Lanka won by 4 wickets 6/9/2022 India Dubai International Cricket Stadium Sri Lanka won by 6 wickets 9/9/2022 Pakistan Dubai International Cricket Stadium Sri Lanka won by 5 wickets Asia Cup Final 2022: Pakistan in the last ten matches Date Opponent Venue Result 22/11/2021 Bangladesh Shere Bangla National Stadium Pakistan won by 5 wickets 13/12/2021 West Indies National Stadium (Karachi) Pakistan won by 63 runs 14/12/2021 West Indies National Stadium (Karachi) Pakistan won by 9 runs 16/12/2021 West Indies National Stadium (Karachi) Pakistan won by 7 wickets 5/4/2022 Australia Gaddafi Stadium Australia won by 3 wickets 28/08/2022 India Dubai International Cricket Stadium India won by 5 wickets 2/9/2022 Hong Kong Sharjah Cricket Stadium Pakistan won by 155 runs 4/9/2022 India Dubai International Cricket Stadium Pakistan won by 5 wickets 7/9/2022 Afghanistan Sharjah Cricket Stadium Pakistan won by 1 wicket 9/9/2022 Sri Lanka Dubai International Cricket Stadium Sri Lanka won by 5 wickets (Written by Zuhair Zaidi)","pubDate":"2022-09-11 00:30:00","image_url":"https://bsmedia.business-standard.com/_media/bs/img/article/default/1220910/thumb-122091000820.jpg","source_id":"business-standard","country":["india"],"category":["sports"],"language":"english"},{"title":"India Women vs England Women Match Highlights 1st T20I Updates: Dunkley, Glenn Help ENG Beat IND by 9 Wicke - News18","link":"https://news.google.com/__i/rss/rd/articles/CBMi0AFodHRwczovL3d3dy5uZXdzMTguY29tL2NyaWNrZXRuZXh0L25ld3MvbGl2ZS1jcmlja2V0LXNjb3JlLWluZGlhLXdvbWVuLXZzLWVuZ2xhbmQtd29tZW4tMXN0LXQyMGktbGF0ZXN0LXVwZGF0ZXMtaW5kLXZzLWVuZy1saXZlLXN0cmVhbWluZy1tYXRjaC1jb3ZlcmFnZS1oaWdobGlnaHRzLWZyb20tY2hlc3Rlci1sZS1zdHJlZXQtbGl2ZW5ld3MtNTkzMzUyNy5odG1s0gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"India Women vs England Women Match Highlights 1st T20I Updates: Dunkley, Glenn Help ENG Beat IND by 9 Wicke  News18Glenn & Dunkley Star | Highlights - England v India | 1st Women's Vitality IT20 2022  England & Wales Cricket BoardIND-W vs ENG-W LIVE Score, 1st T20I: Harmanpreet's India eyes winning start; Toss, Playing XI, match updates  SportstarEN-W vs IN-W Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update- India Women Tour of England, 1st T20I  Cricket AddictorSkipper Amy Jones delighted with ‘confident’ England victory over India  The IndependentView Full coverage on Google News","content":null,"pubDate":"2022-09-10 21:37:40","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Tom Bruce, Jess Watkin scoop major CD Cricket awards - Central Districts Cricket","link":"http://www.voxy.co.nz/sport/5/407015","keywords":["Sport"],"creator":null,"video_url":null,"description":"Two Central Districts captains have been recognised with top honours at the 2021/22 Central Districts Cricket Awards, announced in Napier on Friday evening.","content":"Two Central Districts captains have been recognised with top honours at the 2021/22 Central Districts Cricket Awards, announced in Napier on Friday evening. Central Stags white-ball captain Tom Bruce was named Central Stags Player of the Year for the first time, while Central Hinds T20 captain Jess Watkin was named Central Hinds Player of the Year for the third time in six seasons, at the awards ceremony in Napier that was postponed from the end of last summer due to the Omicron outbreak. Bruce, currently in India as co-captain of New Zealand A, will add the CD men’s silver salver to NZC's Domestic Player of the Year trophy that he won jointly with Auckland batsman Robbie O’Donnell earlier this season. The 31-year-old was also named the Stags’ Plunket Shield Player of the Year for first-class cricket, and (in a category voted for by the players themselves) the Men’s Players’ Player of the Year. The Taranaki batsman enjoyed a brilliant finish to the 2021/22 summer that saw him go on a career-best run spree, producing back-to-back unbeaten first-class double centuries in the last two matches of the season - unprecedented in the Plunket Shield’s long history, as well as leading the Stags to The Ford Trophy national Final. Hinds T20 captain Watkin was named both the Central Hinds Player of the Year and the one-day Hallyburton Johnstone Shield Player of the Year, after another strong season with the bat and ball. The 24-year-old power hitter and off-spinning allrounder will add the summer’s top award to her Hinds supreme trophies for the 2016/17 and 2019/20 seasons. Napier-based WHITE FERNS seamer Rosemary Mair was named T20 Player of the Year for the Hinds while ManawatÅ« wicketkeeper-batsman Dane Cleaver - also in India on the New Zealand A tour - was named the Stags’ Super Smash Player of the Year after a standout season that saw him strike his maiden T20 century and force his way into the BLACKCAPS. Other major category awards went to Nelson swing bowler Claudia Green (Central Hinds’ Players’ Player for the second year running); fast bowler Adam Milne (Ford Trophy Player of the Year); and young Wairarapa allrounder and newly contracted Hind Ocean Bartlett who won the Hinds award for Emerging Player of the Year. The awards evening began with a minute’s silence for Queen Elizabeth II who passed away earlier in the day. Central Districts CEO Lance Hamilton congratulated all finalists and winners, and said it was important to recognise last summer’s top achievers, albeit belatedly. \"With the prevalence of COVID-19 in the community at the time, the stars were not aligning for a ceremony at the end of last summer and, as an organisation, we elected to take a common-sense approach. \"The silver lining has been a small ceremony that has doubled as our new season launch. \"A few players are competing abroad, but it’s been an opportunity for the majority of us - staff, board, and our two flagship representative teams - to reconnect and rekindle our excitement as we look forward to a fresh summer of Domestic cricket.\" Nelson bowler Anna Gaging became the first winner of the Mike Shrimpton Trophy Player of the Year, the women’s inter-provincial competition that was expanded last season to include Nelson for the first time. Young Hawke’s Bay allrounder Will Clark won the men’s Hawke Cup player of the year, with Hawke’s Bay the current holders of the historic national trophy. Hawke’s Bay umpire Glen Walklin was again named CD Umpire of the Year and, in a season in which Central Districts won both of NZC’s national Under 19 titles, ManawatÅ« pair Curtis Heaphy (CD U19 men’s captain) and Ashtuti Kumar (CD U19 women) took home the premier CD age-group trophies for individual performance. 2021/22 CENTRAL DISTRICTS CRICKET AWARDS Central Stags Player of the Year - Tom Bruce (Taranaki) Super Smash Player of the Year - Dane Cleaver (ManawatÅ«) The Ford Trophy Player of the Year - Adam Milne (ManawatÅ«) Plunket Shield Player of the Year - Tom Bruce (Taranaki) Players’ Player of the Year - Tom Bruce (Taranaki) Central Hinds Player of the Year - Jess Watkin (ManawatÅ«) T20 Player of the Year - Rosemary Mair (Hawke’s Bay) Hallyburton Johnstone Shield Player of the Year - Jess Watkin (ManawatÅ«) Emerging Player of Year - Ocean Bartlett (Wairarapa) Players’ Player of the Year - Claudia Green (Nelson) Category Awards Mike Shrimpton Trophy Player of the Year - Anna Gaging (Nelson) Hawke Cup Player of the Year - Will Clark (Hawke’s Bay) CD U19 Player of the Year (Men) - Curtis Heaphy (ManawatÅ«) CD U19 Player of the Year (Women) - Ashtuti Kumar (ManawatÅ«) CD U17 Player of the Year - no award made (tournament not held due to COVID-19) CD Umpire of the Year - Glen Walklin (Hawke’s Bay) Scorer Recognition Award - Duncan Mitchell (ManawatÅ«) COACHES’ COMMENTS Jamie Watkins, Central Hinds head coach: \"Central Hinds Player of the Year Jess Watkin had an impactful season as our leading wicket taker in the Hallyburton Johnstone Shield one-day season - which was unfortunately highly impacted by rain. \"The Hinds were able to play just four of their 10 games, but even that was enough time for Jess to show her class with bat and ball. She contributed a couple of memorable innings with the bat, her 87 off 62 balls against Northern Districts an HBJ highlight. \"Jess was also in the top two wicket-takers in the Dream11 Super Smash for the Hinds, and hit 70 off 45 balls against Wellington Blaze. \"She showed yet again that she is the leading six-hitter in the country in the T20 format. Continuing to grow as an allrounder and as a leader, Jess is a hugely vital cog in the success of the Central Hinds.\" Rob Walter, Central Stags head coach: \"It's no real surprise that Tom has been acknowledged for these awards this evening. It was a stellar season for the Stags and will ultimately go down in history for his performances in the Plunket Shield at the back of end of the season. \"Whilst the double hundreds were the most notable, Tom also made significant contributions in both shorter formats last season as well. Beyond the on-field performances though, it's an acknowledgement of the hard work and tireless hours that Tom put into his game in order to give himself a chance to have these successes. \"Tom was also instrumental in his leadership on and off the field and this is reflected in his award from his peers as the Stags’ Players’ Player of the Year - which is often seen by the players as the number one award to receive on an awards evening. \"I hope that this is the catalyst for great things to come for Tom, and that his game continues to go from strength to strength. Already the cogs are in motion with his selection for the New Zealand A side currently in India.\" STATISTICS Season 2021/22 Jess Watkin Central Hinds Player of the Year, Hallyburton Johnstone Shield Player of the Year 128 runs and 11 wickets from four Hallyburton Johnstone Shield games, at a 32.00 batting average, with a season best of 87. Her haul of 4-28 was one of two occasions in the limited opportunities to get on the park that she took four wickets in an innings, at a 15.81 season bowling average Leading from the front in the T20s, Jess scored 168 Dream11 Super Smash runs from nine innings with a best of 70. With the ball, she took 9 wickets at 22.88. Tom Bruce Central Stags Player of the Year, Plunket Shield Player of the Year, Players’ Player Tom Bruce was New Zealand’s top run-scorer at first-class level last season with 358 Plunket Shield runs from 8 matches (13 innings, seven of them unbeaten) at a phenomenal season average of 143.00, including two unbeaten double centuries (a career-best 208 not out v Northern Districts in Whangarei in Round 7, and 204 not out v Auckland Aces at McLean Park, Napier a week later in the final match of the summer), as well as four half centuries Bruce’s 2021/22 first-class average places him in the top six all-time season averages in a New Zealand summer for batsmen with 500 runs or more in a first-class season (including Test batsmen from New Zealand and visiting teams) Leading the Central Stags to The Ford Trophy Grand Final, as the team’s white-ball captain Bruce contributed 193 runs from seven matches at a 32.16 average, including two half centuries and top-scoring with 63 in the Final In the Dream11 Super Smash, Bruce scored 267 runs from 10 matches at a 38.14 average, including a T20 Domestic career-best 93 not out against the Canterbury Kings at Pukekura Park. Dane Cleaver Men’s Super Smash Player of the Year Dane Cleaver was the second highest run-maker nationally with 369 runs at 46.12 (average), including his maiden T20 century and two half centuries at a strike rate of 166.21 from 9 innings His century, 114 not out against the Otago Volts in Dunedin, was the Stags’ highest score of the campaign and one of just two men’s T20 centuries struck during the Dream11 Super Smash summer nationally. Rosemary Mair Women’s T20 Player of the Year Strike bowler Rosemary Mair played nine T20 matches for the Hinds in 2021/22. Her 12 wickets, including a best of 3-22, made her the top contributor for the team in the wickets column, and ranked the WHITE FERN among the top 10 wicket-takers nationally With the bat, Mair was twice unbeaten with a high score of 34 just two runs shy of her personal best. Adam Milne The Ford Trophy Player of the Year In his swansong season for the Stags, fast bowler Adam Milne was at his commanding best with nine wickets from six games at a tight economy rate of 4.83 Milne also scored his maiden List A half century, reaching 50 off just 18 balls in a bonus point win against the Otago Volts in Dunedin, his season batting average of 28.75 his best yet at Domestic level.","pubDate":"2022-09-10 21:07:59","image_url":null,"source_id":"voxy","country":["new zealand"],"category":["sports"],"language":"english"},{"title":"17 Wickets Fall | Highlights - England v South Africa Day 3 | 3rd LV= Insurance Test 2022 - England & Wales Cricket Board","link":"https://news.google.com/__i/rss/rd/articles/CBMiK2h0dHBzOi8vd3d3LnlvdXR1YmUuY29tL3dhdGNoP3Y9blNfTlNNVUt3bWfSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"17 Wickets Fall | Highlights - England v South Africa Day 3 | 3rd LV= Insurance Test 2022  England & Wales Cricket BoardEngland vs South Africa: Conditions earlier in the morning were too bowling-friendly, says Stuart Broad on 3rd Test  India TodayEngland vs South Africa 3rd Test, Day 3: Ollie Robinson Strikes Before Proteas Fight Back vs England..  NDTV SportsEngland vs. South Africa reaction! Robinson and Jansen shine as wickets tumble | ESPNcricinfo  ESPN UKENG v SA: England on Top at Oval After Skittling S.Africa Out for 118  News18View Full coverage on Google News","content":null,"pubDate":"2022-09-10 20:03:03","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Reborn Khawaja’s plan for life beyond cricket","link":"https://www.themercury.com.au/sport/cricket/australia-v-new-zealand-third-odi-news-usman-khawaja-to-juggle-university-and-cricket/news-story/8fb91b4f08219ca323449abc616a55aa","keywords":["Cricket news and galleries","Sport news and galleries"],"creator":null,"video_url":null,"description":"As well as hitting boundaries, born again batsman Usman Khawaja will also be hitting the books on the road this season.","content":"Or at least the online version of them.Always his own man, Khawaja will undertake a path no Australian Test cricketer has taken as he studies for a Masters of Business Administration (MBA) while touring with the Australian team.Former fast bowler Michael Kasprowicz also has an MBA but completed it after his two decade cricket career ended.Khawaja, who has averaged 98 for the calendar year in a stunning resurgence featuring four centuries in seven Tests, will have a Bond University sticker on the back of his bat this summer to salute the Gold Coast University he has decided to join.Watch Australia’s Tour of India LIVE. Every match Live & On-Demand. New to Kayo? Start your free trial now >“After cricket I want to expand my horizons and give myself opportunities in the future,’’ said Khawaja, who also has a Bachelor of Aviation degree. “I still very much want to play cricket for a little while and after that I still probably want to be involved in cricket in some respect. Whether commentating or media, whatever it may be.“That’s probably the path I prefer, but who knows will happen later on in life and I’m always inquisitive. Things might be different for me at 40, 50 or 60. If I want to join a board down the track this will help my knowledge base.“We’re going to have a crack. I love the (Bond Uni) campus but the most important thing to me was the people and attention to detail. It’s a relatively small campus in terms of admissions so you have more chance to interact with your lecturers and tutors on a personal level.”“They give options to be able to do my degree and to play cricket at the same time.“It is supposed to be a year and half of study but I will dip my toes in and go pretty slowly. I will study on tour and it could be a good time to study.’’In some ways Khawaja’s decision to study while on tour shows my he has reinvigorated himself as an international player.The father of two has realised there more to life than cricket and he feels the acceptance of that fact freed his mindset.“It’s just perspective – as I am talking to you I am holding my daughter and am moving her from one arm to the other. It’s just different phases of your life.’’Bond University Vice Chancellor, Professor Tim Brailsford, said Khawaja would join a distinguished line of sports scholars to have studied at Bond including many Olympians.“The Bond Elite Sports Program supports dozens of top-tier athletes and complements our well-regarded sports science and related research programs,” Professor Brailsford said.","pubDate":"2022-09-10 20:00:00","image_url":null,"source_id":"mercury","country":["australia"],"category":["sports"],"language":"english"},{"title":"“It’s a critical time for Dravid” – former BCCI selector slams","link":"https://thenewsglory.com/its-a-critical-time-for-dravid-former-bcci-selector-slams/","keywords":["Sports","Asia Cup","BCCI","Dravid","Indian cricket team","Rahul Dravid","Team India"],"creator":["The News Glory"],"video_url":null,"description":"Mumbai: Ahead of the T20 World Cup starting in Australia in October, the Indian cricket team’s exit from the Asia Cup has drawn criticism. The Indian team, which is the leading team in the world cricket stage, lost to Pakistan and Sri Lanka in the Super 4 round of the 6-team Asia Cup series and […]","content":"Mumbai: Ahead of the T20 World Cup starting in Australia in October, the Indian cricket team’s exit from the Asia Cup has drawn criticism. The Indian team, which is the leading team in the world cricket stage, lost to Pakistan and Sri Lanka in the Super 4 round of the 6-team Asia Cup series and failed to enter the finals, has turned the criticism on the coach Rahul Dravid. Commenting on India’s defeat, former BCCI selector Saba Karim said, “This is a critical time for Dravid. Dravid knows that his honeymoon period as India’s coach is over. With the T20 World Cup coming up, the ODI World Cup next year. These two big ICC events, this If India can win both the championships, Rahul Dravid will be satisfied with the coaching he has given to the Indian team. The only way for Dravid to prove that he is sensible and intelligent and to complete his coaching career successfully is to win ICC trophies and Test series in England, South Africa, New Zealand and Australia. Rahul Dravid will be very happy with the performance of the Indian team as India start to win Test series in these countries.”","pubDate":"2022-09-10 19:46:07","image_url":null,"source_id":"thenewsglory","country":["india"],"category":["sports"],"language":"english"},{"title":"Kohli is more skilful than me: Ganguly","link":"https://kashmirreader.com/2022/09/11/kohli-is-more-skilful-than-me-ganguly/","keywords":["SPORTS"],"creator":["Press Trust of India"],"video_url":null,"description":"New Delhi: Back in form with a blazing century at the Asia Cup, Virat Kohli has earned praise from BCCI president Sourav Ganguly, who said the star Indian batter is “more skilful” than him as a player. Both played aggressive brand of cricket as captains, but Ganguly said in terms of skill set, Kohli is […]","content":"New Delhi: Back in form with a blazing century at the Asia Cup, Virat Kohli has earned praise from BCCI president Sourav Ganguly, who said the star Indian batter is “more skilful” than him as a player. Both played aggressive brand of cricket as captains, but Ganguly said in terms of skill set, Kohli is ahead of him. “I don’t think that (captaincy) should be the comparison… The comparison should be in terms of skill as a player. I think he is more skilful than I’m,” Ganguly said of Kohli in the ‘Ranveer Show’ on YouTube. —PTI   Press Trust of Indiakashmirreader.com","pubDate":"2022-09-10 18:47:50","image_url":null,"source_id":"kashmirreader","country":["india"],"category":["sports"],"language":"english"},{"title":"Why is Jemimah Rodrigues not playing today’s England women vs India women 1st T20I at Chester-le-Street?","link":"https://thesportsrush.com/cricket-news-why-is-jemimah-rodrigues-not-playing-todays-england-women-vs-india-women-1st-t20i-at-chester-le-street/","keywords":["Cricket","England Women","India Women","Jemimah Rodrigues"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Why is Jemimah Rodrigues not playing: The Indian right-handed batter displayed was in fine form during the Commonwealth Games 2022. During the first of the three match IT20 series between India women and England women at the Riverside Ground in Chester-le-Street, England captain cum wicket-keeper batter Amy Jones has won the Toss and elected to… The post Why is Jemimah Rodrigues not playing today’s England women vs India women 1st T20I at Chester-le-Street? appeared first on The SportsRush.","content":"Why is Jemimah Rodrigues not playing: The Indian right-handed batter displayed was in fine form during the Commonwealth Games 2022. During the first of the three match IT20 series between India women and England women at the Riverside Ground in Chester-le-Street, England captain cum wicket-keeper batter Amy Jones has won the Toss and elected to field first, amid overcast conditions. Due to heavy rain which took place earlier, the Toss had to be delayed by half-an-hour. “There’s been a bit of rain,” remarked England captain Amy Jones. “We want to have a look at the wicket and hopefully get something out of it early on.” As for India captain Harmanpreet Kaur, who wanted to bowl first as well, said, “we’re prepared for both, whether batting first or second”. While medium pacer Lauren Bell will be making her T20I debut for England, power-hitter Kiran Navgire will make her maiden international appearance for India tonight. India’s top-order batter Jamimah Rodrigues, who was part of the initial T20I squad for the ongoing England tour, has unfortunately been ruled out of the series after suffering from a hand injury last month, which had earlier also ruled her out of ‘The Hundred’ after playing a couple of matches for her franchise Northern Superchargers. While addressing the pre-match media interaction on Friday, India women’s team captain Harmanpreet Kaur had confirmed that Jemimah is still undergoing rehabilitation at the National Cricket Academy in Bengaluru. “Jemi is still at the NCA, she is getting well. Once we have information about her and she is going about the series, we will update you accordingly,” Harmanpreet remarked. As for India’s playing XI tonight, they have surprisingly picked mere two seamers in Renuka Singh and Pooja Vastrakar, despite overcast conditions. Sneh Rana, Deepti Sharma, and Radha Yadav are the three frontline spinners in the XI. England have won the toss and elect to bowl first in the first T20I. A look at our Playing XI for the game. Live – https://t.co/M3XbcmfVgG #ENGvIND pic.twitter.com/f0E3vLPmXj — BCCI Women (@BCCIWomen) September 10, 2022 For more Cricket-related news, click here .","pubDate":"2022-09-10 18:45:36","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Cricket great Adam Gilchrist shares special tribute to the Queen as he recalls meeting her","link":"https://thewest.com.au/news/queen-elizabeth-ii/cricket-great-adam-gilchrist-shares-special-tribute-to-the-queen-as-he-recalls-meeting-her-c-8184846","keywords":null,"creator":["Steve Butler"],"video_url":null,"description":"Cricket great Adam Gilchrist has remembered Queen Elizabeth II as a remarkable leader with a cheeky sense of humour.","content":null,"pubDate":"2022-09-10 18:00:00","image_url":"https://images.thewest.com.au/publication/C-8184846/198cf1c475f17b908f12b8457ee2a1a487bd7877-16x9-x0y0w3132h1762.jpg","source_id":"thewest","country":["australia"],"category":["sports"],"language":"english"},{"title":"Sehwag, Kallis to lead World Giants, Indian Maharajas for the Legends League Cricket match","link":"https://sportstar.thehindu.com/cricket/legends-league-cricket-2022-sehwag-kallis-indian-maharajas-vs-world-giants/article65875297.ece","keywords":null,"creator":["\n        Team Sportstar  \n    "],"video_url":null,"description":"The countdown for the Legends League Cricket has started as the cricketing greats from 10 nations are set to descend in Kolkata with the league kickstarting on September 16.","content":"The countdown for the Legends League Cricket has started as the Cricketing greats from 10 nations are set to descend in Kolkata with the league kickstarting on September 16. The benefit match between Indian Maharajas and World Giants will be led by India’s one of the most successful opening batters, Virender Sehwag and South African Cricketing great and revered allrounder, Jacques Kallis. With the urge to watch the Legends in action again, there has been a high demand for the tickets as fans are gearing up to watch their heroes dominate the 22 yards once again. Raman Raheja, Co-Founder & CEO, Legends League Cricket, said, “There has been huge demand from fans and we have already started feeling the excitement too. The numbers on BookmyShow are fast picking up across all cities as well as enquiries for hospitality packages have been very very encouraging. We hope to give fans a world class experience at every touch point whether on the field or digitally and that is the reason why we have handpicked our stakeholders too.” Delhi will be hosting three league stage matches, starting with India Capitals vs Bhilwara Kings on September 22 at the Arun Jaitley Stadium followed by Gujarat Giants and Bhilwara Kings and a marquee clash between the Giants and India Capitals at 4 PM, wherein both the Delhi Boys, Sehwag and Gambhir will play against each other. (Tickets for all matches are currently Live on Bookmyshow) Read more stories on Cricket.","pubDate":"2022-09-10 17:52:24","image_url":null,"source_id":"sportstar","country":["india"],"category":["sports"],"language":"english"},{"title":"Matthew Hayden named Pakistan team mentor for ICC Men's T20 World Cup","link":"https://www.sentinelassam.com/sports/cricket/matthew-hayden-named-pakistan-team-mentor-for-icc-mens-t20-world-cup-612253","keywords":["Sports,Cricket"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"Australia batting great Matthew Hayden on Friday was named as Pakistan's team mentor for the ICC Men's T20 World Cup in October-November","content":"LAHORE: Australia batting great Matthew Hayden on Friday was named as Pakistan's team mentor for the ICC Men's T20 World Cup in October-November, said the Pakistan Cricket Board (PCB). This will be Hayden's second stint with the Pakistan side after being their consultant batting coach during last year's T20 World Cup in the UAE, where the side reached the semifinals after defeating India, New Zealand, Afghanistan, Scotland and Namibia in the Super 10 league matches. Hayden will join the Pakistan side in Brisbane on October 15, on the day when the Babar Azam-led side arrives in the country from Christchurch after competing in the T20I tri-series also involving Bangladesh and hosts New Zealand. IANS Also Read: Chahal Has An Edge Over Kuldeep In The Battle Of Wrist-Spinners: Hayden Also Watch:","pubDate":"2022-09-10 17:31:13","image_url":"https://assets.sentinelassam.com/h-upload/2022/09/10/386356-math.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"“Don’t know who Urvashi Rautela is”: Naseem Shah denies recognizing Urvashi Rautela after actress shares fan’s video featuring the two","link":"https://thesportsrush.com/cricket-news-dont-know-who-urvashi-rautela-is-naseem-shah-denies-recognizing-urvashi-rautela-after-actress-shares-fans-video-featuring-the-two/","keywords":["Cricket","Asia Cup 2022","Naseem Shah","Urvashi Rautela"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Naseem Shah denies recognizing Urvashi Rautela after latter shares a rather romantic separate video frames of the two during Asia Cup 2022. Having made his T20I debut for Pakistan in the ongoing Asia Cup 2022 match versus India, 19-year-old pacer Naseem Shah has made notable contributions with both bat and the ball, during his team’s… The post “Don’t know who Urvashi Rautela is”: Naseem Shah denies recognizing Urvashi Rautela after actress shares fan’s video featuring the two appeared first on The SportsRush.","content":"Naseem Shah denies recognizing Urvashi Rautela after latter shares a rather romantic separate video frames of the two during Asia Cup 2022. Having made his T20I debut for Pakistan in the ongoing Asia Cup 2022 match versus India, 19-year-old pacer Naseem Shah has made notable contributions with both bat and the ball, during his team’s journey towards the grand finale of the tournament. With 6 wickets across 4 innings, at an average of 16.33, Naseem has emerged as Babar Azam’s go-to pacer this tournament, and has also left a lasting impression in the memories of every Pakistani Cricket fan, after having hit those two consecutive Sixes against Afghanistan during the ‘Super 4’ stage to win the thriller contest. However, prior to the aforementioned match, an off-field incident during Pakistan’s second match against India (during the Super ‘4’ stage) had placed him in a different sort of a limelight, when Bollywood actress Urvashi Rautela took matters to a different level. Post the aforementioned clash, Rautela took to her ‘Instagram Story’ section to post a fan-made video where both she and Naseem were seen smiling in different frames with a song sung by Pakistan singer Atif Aslam playing in the background. The video was suggestive enough that something was brewing between the two, with Cupid playing the matchmaker. Urvashi Rautela posted a video of herself and Naseem Shah on her Instagram story😂😂 pic.twitter.com/yH87gzEvH6 — Fatimah (@zkii25) September 6, 2022 However, during a recent media interaction, Naseem Shah has denied even recognizing the Indian actress, while also going on to state that his focus remains only on the matches that he plays for his nation. “Smile toh aapke question pe aa rha hai . I don’t know who Urvashi Rautela is. I only focus on my match. People usually send me videos but I have no idea. I have nothing special in me but I thank people who come to watch cricket and give a lot of respect,” replied the 19-year-old. Urvashi kon hai kya hai 😭😭😭 pic.twitter.com/E3DI6CXw8D — Bakhtawer (@bucctower) September 10, 2022 Urvashi’s aforementioned story might have a bit to do with her alleged issues with India’s wicket-keeper batter Rishabh Pant, after the two, a month ago, took dig at each other over a series of Instagram stories. Read more on the same by clicking here .","pubDate":"2022-09-10 17:27:00","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Michelle Tredenick steps down from Cricket Australia Board","link":"https://www.sentinelassam.com/sports/cricket/michelle-tredenick-steps-down-from-cricket-australia-board-612251","keywords":["Sports,Cricket"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"Independent director Michelle Tredenick has decided to step down from the Cricket Australia (CA) board at the Annual General Meeting in October.","content":"MELBOURNE: Independent director Michelle Tredenick has decided to step down from the Cricket Australia (CA) board at the Annual General Meeting in October. Michelle has been a member of the board since November 2015 and has informed Chair Lachlan Henderson that she will not stand for re-election due to increasing work commitments. \"I have served on the CA Board since 2015 and have decided this is the right time for me to step away having completed two terms as an independent director and with my increasing work commitments outside of cricket including just recently joining another ASX-listed board.\" CA chairman Lachlan Henderson thanked Michelle for her service and contribution to the board. \"Michelle has been an outstanding contributor to the Board and invaluable source of advice and expertise for me and all our directors.\" IANS Also Read: Mel Jones to step down from Cricket Australia Board Also Watch:","pubDate":"2022-09-10 17:26:13","image_url":"https://assets.sentinelassam.com/h-upload/2022/09/10/386354-mitc.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"This is crunch time for Rahul Dravid with T20, ODI World Cups coming up: Saba Karim","link":"https://www.sentinelassam.com/sports/cricket/this-is-crunch-time-for-rahul-dravid-with-t20-odi-world-cups-coming-up-saba-karim-612250","keywords":["Sports,Cricket"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"Former India wicketkeeper-batter and ex-member of the senior selection committee Saba Karim feels that the current time is a crunch one for men's head coach Rahul Dravid with two big events","content":"NEW DELHI: Former India wicketkeeper-batter and ex-member of the senior selection committee Saba Karim feels that the current time is a crunch one for men's head coach Rahul Dravid with two big events, T20 World Cup and ODI World Cup coming up in future. Since Dravid took over as the men's head coach after Ravi Shastri left the job, India got huge success in winning bilateral T20I series against New Zealand, West Indies (twice), Sri Lanka, England and drawing against South Africa. In the Asia Cup 2022, where India entered as defending champions, they won their group matches against Pakistan and Hong Kong. But losses to Pakistan and Sri Lanka in Super Four meant they missed out on playing the final and signed off from the tournament with a 101-run win over Afghanistan, sparking doubts over India's preparedness ahead of the T20 World Cup in Australia in October-November. \"Well even Rahul Dravid is aware that the honeymoon period is over, and he is trying his best to be an alchemist but so far, such metals haven't been converted into core. One would expect him to do that. This is crunch time for Rahul Dravid. \"With the World Cup T20 coming up, next year the ODI World Cup coming up. These two big ICC events, if India can win both these championships then only Rahul Dravid will be satisfied with the kind of inputs he has given to team India,\" said Karim on 'Sports Over The Top' show on Sports18. Karim further spoke about the inconsistent results under Dravid's coaching, like losing out on Test series wins in South Africa and England this year. \"If given an option, Rahul Dravid would love to have those Test series wins in South Africa and the last Test match in England. He would love to swap that with so many bilateral wins that India has got under his belt. But that's the nature of the challenges which Rahul Dravid has to face. \"See Rahul is sensible and intelligent enough to understand that the only way he can define a successful tenure of his coaching career is if India — number one, wins ICC events and number two it starts to win Test series in SENA countries. I'm not talking about Test wins. \"Test wins even while Rahul Dravid was playing, India has done that. But more importantly, when India starts to win in SENA countries, the Test series, that's when Rahul Dravid will be very happy with team India's performance.\" IANS Also Read: India cricket team head coach Rahul Dravid tests positive for Covid-19 Also Watch:","pubDate":"2022-09-10 17:23:21","image_url":"https://assets.sentinelassam.com/h-upload/2022/09/10/386353-rahul.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"India Legends vs South Africa Legends Highlights, Road Safety World Series: Tendulkar's IND beats SA by 61 runs; Binny, Yusuf, bowlers shine - Sportstar","link":"https://news.google.com/__i/rss/rd/articles/CBMiowFodHRwczovL3Nwb3J0c3Rhci50aGVoaW5kdS5jb20vY3JpY2tldC9pbmRpYS1sZWdlbmRzLXZzLXNvdXRoLWFmcmljYS1sZWdlbmRzLWxpdmUtc2NvcmUtc3RyZWFtaW5nLWluZm8tcm9hZC1zYWZldHktd29ybGQtc2VyaWVzLTIwMjItaGlnaGxpZ2h0cy9hcnRpY2xlNjU4NzQ4ODcuZWNl0gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"India Legends vs South Africa Legends Highlights, Road Safety World Series: Tendulkar's IND beats SA by 61 runs; Binny, Yusuf, bowlers shine  SportstarRoad Safety World Series 2022 Schedule, Teams, India Squad, Live Streaming, Match List, Tickets, Squads, Venues, Format, Timings, Live Telecast Channel In India  Cricket AddictorHighlights India vs South Africa Legends Cricket match score and updates, Road Safety World Series 2  Zee NewsIndia Legends vs South Africa Legends Highlights: IND L thrash SA L by 64 runs  Hindustan TimesIN-L vs SA-L Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update- Road Safety T20 World Series  Cricket AddictorView Full coverage on Google News","content":null,"pubDate":"2022-09-10 17:02:57","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Moment istoric » A fost intonat imnul „God Save the King” după mai bine de 70 de ani","link":"https://www.gsp.ro/sporturi/altele/a-fost-intonat-imnul-god-save-the-king-dupa-mai-bine-de-70-de-ani-674168.html","keywords":["Altele"],"creator":["redactia@gsp.ro (Redactia GSP)"],"video_url":null,"description":"Meciul de cricket dintre Anglia și Africa de Sud a debutat cu un omagiu dedicat Reginei Elisabeta a II-a a Marii Britanii, care a murit joi seara, la vârsta de 96 de ani. De asemenea, pe „Oval” a fost intonat imnul „God Save the King”. Charles al III-lea este noul suveran al Regatului Unit. Înaintea partidei, mulțimea de pe „Ovalul” londonez a făcut liniște zeci de secunde în timp ce reprezentații forțelor armate formau garda de onoare. ...","content":"SPORTURI » ALTELE » MAREA BRITANIE VIDEO Moment istoric » Unde a fost intonat imnul „God Save the King” după mai bine de 70 de ani Meciul de cricket dintre Anglia și Africa de Sud a debutat cu un omagiu dedicat Reginei Elisabeta a II-a a Marii Britanii, care a murit joi seara, la vârsta de 96 de ani Share pe Facebook Share pe Whatsapp LiveScore Video Ultima oră 0 Comentarii Articol de GSP - Publicat sambata, 10 septembrie 2022, 19:50 / Actualizat sambata, 10 septembrie 2022 20:20 Meciul de cricket dintre Anglia și Africa de Sud a debutat cu un omagiu dedicat Reginei Elisabeta a II-a a Marii Britanii, care a murit joi seara, la vârsta de 96 de ani . De asemenea, pe „Oval” a fost intonat imnul „God Save the King”. Charles al III-lea este noul suveran al Regatului Unit. Înaintea partidei, mulțimea de pe „Ovalul” londonez a făcut liniște zeci de secunde în timp ce reprezentații forțelor armate formau garda de onoare. WEST HAM - FCSB Silence pentru Regină » Imagini emoționante cu momentul de reculegere de pe London Stadium: mii de oameni în lacrimi „God Save the King” după 70 de ani A urmat un minut de reculegere, ținut după intrarea naționalelor pe teren. Ulterior, a fost intonat imnul Regatului Unit, „God Save the King”, pentru prima dată în această versiune la un eveniment spotiv televizat după mai bine de 70 de ani , informează The Guardian . A beautiful few moments as cricket pays its respects to Her Majesty The Queen. pic.twitter.com/3QnZiFEOKq — England Cricket (@englandcricket) September 10, 2022 „Știm cât de mult a iubit Regina acest sport, iar spectacolul trebuie să continue. Sunt sigur că Regina privește de sus toate competițiile sportive din acest weekend, vom juca în onoarea ei, sunt mândru de asta. Dispariția Majestății Sale a fost o veste tristă nu doar pentru națiunea noastră, ci pentru întreaga lume. Regina și-a dedicat viața acestui popor, o sursă imensă de inspirație! Suntem onorați să putem ieși pe teren în memoria Majestății Sale ”, a spus Ben Stokes, căpitanul Angliei, înainte de începerea jocului. A fost unul dintre puținele evenimente sportive de pe teritoriul Marii Britanii care s-a desfășurat în acest weekend. De exemplu, toate partidele din Premier League au fost suspendate . Regina Elisabeta a II-a, apropiată de lumea sportului Elisabeta a II-a nu a fost străină de lumea sportului. Robert Jobson, redactorul uneia dintre cărțile autobiografice ale Majestății Sale, dezvăluia că Regina obișnuia să joace fotbal în vacanțele pe care le petrecea la Norfolk, postul său fiind cel de portar. Cel mai emoționant moment s-a petrecut în 1966, când i-a înmânat trofeul Cupei Mondiale lui Bobby Moore, căpitanul primei reprezentative a Angliei. Primul trofeu pe care l-a înmânat în timpul domniei a fost Cupa Angliei din 1953, Regina Elisabeta a mai avut o mare pasiune, echitația. DECES Amintire cu Regina de la Jocurile Olimpice din 2012. Luminița Paul: „Atât de sprintenă la vârsta ei? Am rămas cu acea imagine” DOLIU ÎN ANGLIA Decesul Reginei Elisabeta a II-a poate trimite echipele engleze în străinătate! Ce stadion e în stand-by pentru a găzdui meciurile din Europa Rușii anunță că l-au eliminat pe liderul terorist care a organizat ... Libertatea AUTOGOLUL ANULUI vine din Liga 1! » Execuția antologică pe care o invidiază toţi marii atacanţi ai momentului GSP.RO Playtech: Imaginile cu Mihaela Rădulescu de care puţini au habar! Se întâmpla în tinereţe cu Ştefan Bănică Jr. Nu vrei să le ratezi! charles al III-lea Regina Elisabeta a II-a anglia africa de sud Comentarii (0) Articolul nu are încă nici un comentariu. Fii primul care comentează! Comentează Conectează-te la contul tău pentru a adăuga comentarii. 1500 de caractere rămase Sunt de acord cu regulile comunității Adaugă comentariu","pubDate":"2022-09-10 16:50:00","image_url":"https://cacheimg.gsp.ro/autocrop/smp-images-production/gsp.ro/10092022/6c5d14fa-a5fe-47fe-9983-9486a3747df6.jpg?width=290&height=208","source_id":"gsp","country":["romania"],"category":["sports"],"language":"romanian"},{"title":"“Take it easy on us please”: Brain Lara hilariously responds to Suresh Raina as he trains himself to partake in Road Safety World Series 2022","link":"https://thesportsrush.com/cricket-news-take-it-easy-on-us-please-brain-lara-hilariously-responds-to-suresh-raina-as-he-trains-himself-to-partake-in-road-safety-world-series-2022/","keywords":["Cricket","Brian Lara","Road Safety World Series 2022","Suresh Raina"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Brain Lara hilariously responds to Suresh Raina as the latter puts across his training video ahead of the opening match of RSWS 2022. During the first match of the second edition of the Road Safety World Series 2022 between India Legends and South Africa Legends at the Green Park Stadium in Kanpur, former India batter… The post “Take it easy on us please”: Brain Lara hilariously responds to Suresh Raina as he trains himself to partake in Road Safety World Series 2022 appeared first on The SportsRush.","content":"Brain Lara hilariously responds to Suresh Raina as the latter puts across his training video ahead of the opening match of RSWS 2022. During the first match of the second edition of the Road Safety World Series 2022 between India Legends and South Africa Legends at the Green Park Stadium in Kanpur, former India batter Suresh Raina played some exquisite strokes, to score a quick fire 33 off 22, after skipper Sachin Tendulkar opted to bat first. Coming into bat at his usual no.3 spot in the order, Raina opened his arms on only the second delivery that he faced to play up and over the covers for a boundary. He then managed to smash three more Fours, and a beautiful Six over long-off, to ultimately head back after striking at 150. On the match eve, the 35-year-old trained hard in the nets, and posted the video of the same on his Instagram handle. Raina posted the video with a caption ‘All set for the RSWS. Team #IndiaLegends.’ Brain Lara hilariously responds to Suresh Raina Legendary West Indian batter Brian Lara, who will lead the West Indies Legends in this eight-team tournament, hilariously responded to the former Southpaw Indian batter, requesting him to rather not come hard at his team during the series. After facing the Bangladesh Legends on Sunday (tomorrow), Brian Lars’s legends will take on the India Legends in their second match of the series at the Green Park itself. “Take it easy on us please”, Lara commented on Raina’s aforementioned video post.   View this post on Instagram   A post shared by Suresh Raina (@sureshraina3) As for Raina, the 35-year-old became eligible to partake in the ongoing tournament, after he decided to retire from all forms of Cricket under the tutelage of BCCI last week. The India Legends are the defending champions of the Road Safety World Series, having defeated Sri Lanka Legends in the grand finale last year. The post “Take it easy on us please”: Brain Lara hilariously responds to Suresh Raina as he trains himself to partake in Road Safety World Series 2022 appeared first on The SportsRush.","pubDate":"2022-09-10 16:06:34","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"T20 World Cup Squad: RP Singh shows faith in KL Rahul and Mohammed Shami for place in T20 WC","link":"https://www.indiatvnews.com/sports/cricket/t20-world-cup-squad-rp-singh-s-t20-world-cup-squad-2022-09-10-807167","keywords":null,"creator":null,"video_url":null,"description":"Former India pace sensation RP Singh has shown faith in KL Rahul and Mohammed Shami for the upcoming T20 World Cup in Australia as he chose his best Playing XI and squad. RP has also given place to Deepak Chahar and Ravichandran Ashwin while he has opted against Harshal Patel. The Board of Control for Cricket in India (BCCI) will soon announce the squad for the T20 World Cup, with the deadline soon approaching.","content":null,"pubDate":"2022-09-10 15:46:09","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"Road Safety World Series T20 2022 Live: Stuart Binny brings up his 50, India Legends stay steady - The Indian Express","link":"https://news.google.com/__i/rss/rd/articles/CBMilAFodHRwczovL2luZGlhbmV4cHJlc3MuY29tL2FydGljbGUvc3BvcnRzL2NyaWNrZXQvcm9hZC1zYWZldHktd29ybGQtc2VyaWVzLXQyMC0yMDIyLWluZGlhLWxlZ2VuZHMtdnMtc291dGgtYWZyaWNhLWxlZ2VuZHMtbGl2ZS1zY29yZS11cGRhdGVzLTgxNDI2NzYv0gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Road Safety World Series T20 2022 Live: Stuart Binny brings up his 50, India Legends stay steady  The Indian ExpressRoad Safety World Series 2022 Schedule, Teams, India Squad, Live Streaming, Match List, Tickets, Squads, Venues, Format, Timings, Live Telecast Channel In India  Cricket AddictorIndia Legends vs South Africa Legends Live Score: Stuart Binny scores fifty  Hindustan TimesRoad Safety World Series 2022: LIVE stream, time, format, full schedule, squads, matches - all you need to...  Zee NewsIndia Legends vs South Africa Legends Live Streaming Details, Live Telecast Channel In India- When And Where To Watch IND L vs SA L Match Live In Your Country? Road Safety World Series 2022 Match 1  Cricket AddictorView Full coverage on Google News","content":null,"pubDate":"2022-09-10 15:32:25","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"One of Arsenal’s biggest problems may have just been solved for them – Our View","link":"https://www.hitc.com/en-gb/2022/09/10/one-of-arsenals-biggest-problems-may-have-just-been-solved-for-them-our-view/?utm_source=rss&utm_medium=rss&utm_campaign=one-of-arsenals-biggest-problems-may-have-just-been-solved-for-them-our-view","keywords":["Arsenal","Competitions","Football","Premier League","Teams","thomas partey"],"creator":["Charles Jones"],"video_url":null,"description":"The footballing calendar has been ripped up after the death of The Queen, and it looks as though we won’t be seeing any Premier League... The post One of Arsenal’s biggest problems may have just been solved for them – Our View appeared first on HITC.","content":"The footballing calendar has been ripped up after the death of The Queen, and it looks as though we won’t be seeing any Premier League action until October, with next weekend’s games likely to be cancelled due to the former monarch’s funeral. Fans and pundits up and down the country questioned the decision to cancel the football, especially as cricket, rugby and horse racing are all set to go ahead, and while the postponements are frustrating, there may be some positives for certain teams to take from this rescheduling. Indeed, Arsenal may have just had one of their biggest issues solved for them with this schedule rewrite. Photo by Chris Brunskill/Fantasista/Getty Images The Gunners are in great form at the moment, but there is a severe element of concern around their midfield depth with both Thomas Partey and Mohamed Elneny currently sidelined with injury. However, with no Premier League games likely to be played until early October, Arsenal’s midfield problem should have subsided by the next round of fixtures. Elneny may not be back, but after being called up by Ghana for the next round of international fixtures, Partey should be fighting fit by the time the north London derby comes around. Arsenal could seriously have struggled over the next fortnight if they picked up another injury or Granit Xhaka got his bi-annual suspension, but now, with Partey set to be back for Arsenal’s next game, the Gunners can go forward feeling much more confident. Even beyond that game, with no space in the calendar for the two postponed fixtures until the new year, Elneny should be back in time for those, meaning that Arsenal will be stronger than they likely would have been for the two rescheduled fixtures. The post One of Arsenal’s biggest problems may have just been solved for them – Our View appeared first on HITC.","pubDate":"2022-09-10 15:30:00","image_url":null,"source_id":"hitc","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Asia Cup 2022: Sri Lanka beat Pakistan by 5 wickets","link":"https://www.sentinelassam.com/sports/cricket/asia-cup-2022-sri-lanka-beat-pakistan-by-5-wickets-612239","keywords":["Sports,Cricket"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"Sri Lanka produced a clinical all-round performance to beat Pakistan by five wickets in a Super Four match of the ongoing Asia Cup 2022 at Dubai International Cricket Stadium","content":"DUBAI: Sri Lanka produced a clinical all-round performance to beat Pakistan by five wickets in a Super Four match of the ongoing Asia Cup 2022 at Dubai International Cricket Stadium, here on Friday. Spinners Wanindu Hasaranga (3/21) and Maheesh Theekshana's (2/21) impressive bowling performance helped Sri Lanka bowl out Pakistan for 121 in 19.1 overs. Apart from Hasaranga and Theekshana, Pramod Madushan (2/21), Chamika Karunaratne (1/4) and Dhananjaya de Silva (1/18) also bowled with discipline and did a decent job for Sri Lanka. On the other hand, Babar Azam (30 off 29) and Mohammad Nawaz (26 off 18) were the top-scorers for Pakistan. IANS Also Read: Sri Lanka Beat India By 6 Wickets Rohit Sharma's Team On Brink Of Ouster Also Watch:","pubDate":"2022-09-10 15:15:10","image_url":"https://assets.sentinelassam.com/h-upload/2022/09/10/386342-paki.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"Brahmaputra Boys win Assam T20 Challengers Trophy title","link":"https://www.sentinelassam.com/north-east-india-news/local-sports/brahmaputra-boys-win-assam-t20-challengers-trophy-title-612238","keywords":["Sports,Local Sports"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"Brahmaputra Boys lifted the Assam T20 Challengers Trophy title defeating Dihing Patkai Riders by 9 wickets","content":"Our Sports Reporter GUWAHATI: Brahmaputra Boys lifted the Assam T20 Challengers Trophy title defeating Dihing Patkai Riders by 9 wickets in the final held at the Amingaon Cricket ground here today. Krishna Das (3-11) and Rishav Das (54 no) played crucial roles in the victory of Brahmaputra Boys. The closing ceremony of the tournament was held at the Amingaon Cricket Ground. It was attended by president and the secretary of the Assam Cricket Association Romen Dutta and Devajit Saikia respectively along with the other officials of the association., Brief scores: Dihing Patkai Riders 103 (20 overs), Pradyun Saikia 36, Nasir Ullah 24, Krishna Das 3-11, Rahul Singh 2-5, Brahmaputra Boys 104/1 (17.1 overs), Rishav Das 54(no), Rituraj Biswas 37(no). Individual awards:Man of the final: Krishna Das (Brahmaputra Boys), Best Bowler - Dharani Rabha (Barak Bravehearts), Best Batsman- Rishav Das (Brahmaputra Boys), Player of the Tournament -Nipan Deka (Dihing Patkai Riders). Also Read: Brahmaputra To Face Dihing In Final Also Watch:","pubDate":"2022-09-10 15:09:37","image_url":"https://assets.sentinelassam.com/h-upload/2022/09/10/386341-brahmaputra-boys.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"}]}