{"newsArray":[{"title":"Why we need this Ashes to keep Test cricket alive: England v Australia matters more than ever…","link":"https://www.dailymail.co.uk/sport/cricket/article-12183829/Why-need-Ashes-Test-cricket-alive-England-v-Australia-matters-ever.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"LAWRENCE BOOTH: It was at Rawalpindi in December, as England basked in an astonishing victory in the first Test against Pakistan, that Ben Stokes laid out his hopes and dreams.","content":"LAWRENCE BOOTH: England's clash with Australia matters more than ever as nations ditch five-day games and players cash in with opportunistic franchises... why we NEED this Ashes to keep Test cricket alive This year’s Ashes series is the most hotly anticipated series in recent memory Both teams are in great form and talking a big game ahead of the showdown Australia dominated the last series on their home turf, winning 4-0 By Lawrence Booth for MailOnline Published: 22:32, 11 June 2023 | Updated: 23:34, 11 June 2023 e-mail 1 View comments It was at Rawalpindi in December, as England basked in an astonishing victory in the first Test against Pakistan , that Ben Stokes laid out his hopes and dreams. His team had just won with minutes to spare, having scored 506 for four from 75 overs on the first day, then challenged Pakistan to make 343 in four sessions — a gettable target on a merciless pitch. It was a victory for the ages, a subversion of what seemed possible. ‘That’s how Test cricket should be played, always looking at the entertainment side of the sport, because Test cricket is something that needs to be looked after,’ said Stokes. ‘We don’t want Test cricket to fall off the face of the planet. It needs to stay around and we’ll do everything we possibly can as a team to keep it alive.’ Six months on, as England prepare for the most talked-about Ashes since 2005, his message feels even more urgent. T20 franchise cricket is taking over the game, one tournament at a time, and teams outside the so-called Big Three — India , England and Australia — have pared their Test commitments to the bone. For international cricket, the doomsday scenario is well underway: players are signing contracts with opportunistic conglomerates rather than the home boards who have nurtured them. The upcoming Ashes series represents a huge moment for Test cricket as a whole World Test champions Australia will be a massive challenge for England to overcome Nations are ditching five-day cricket with T20 franchise cricket appearing to take over England white-ball opener Jason Roy’s decision to plump for LA Knight Riders in America’s new Major League Cricket over an incremental contract with the ECB is just the iceberg’s tip. On the eve of the World Test Championship final at the Oval, the second question to Australia captain Pat Cummins was about the future of a format that has been around since 1876, and provided the game with the bulk of its most fabled moments. ‘Every Test player I have come up against still talks about their love of the game,’ he said, before half-addressing the elephant in the room. ‘But obviously times are changing.’ Not half, Pat. Not half. The impending demise of Test cricket has long been a favourite theme for the sport’s opinion formers, but the concerns are no longer in the realm of the theoretical. Private funds and made-up teams now exert a more powerful pull on players and administrators than the bilateral arrangements of old. Money talks. Correction: it screams. Some regard this development with fear and loathing. Others enthuse about the reach of the free market and the rewards for players with a short shelf-life. Everyone agrees a turning point has become a tipping point. It is against this backdrop that the Ashes begins this week. England v Australia has always been at the heart of Test cricket’s narrative. Starting with the teams’ first meeting, at Melbourne in March 1877, they have played each other 356 times — one in seven of all Tests. The next-most common fixture is England v West Indies, miles behind on 163. Australia hold the edge, with 150 victories to England’s 110, and the Australian philosopher David Stove thought he knew why: ‘Whereas the Australians hate the Poms, the Poms only despise the Australians.’ Jason Roy has forfeited an England contract to play in the new US T20 cricket league He was on to a deeper truth: this is a contest that transcends numbers, a clash of two cultures divided by a common sport. As Vic Marks, the former Somerset and England off-spinner, once put it: ‘When appealing, the Australians make a statement. We ask a question.’ Shane Warne, the genius leg-spinner whose death last year at the age of 52 still hangs over the game, would have enjoyed that almost as much as he would have enjoyed Bazball. This summer’s contest, between a rejuvenated England side and an Australia team desperate to win their first series in this country for 22 years, may yet go down as a classic. But the burden the Ashes now carries is becoming unsustainable. And next summer, when the Test tourists will be West Indies and Sri Lanka — no one’s idea of a drawcard — the debate about the format’s future will be more angst-ridden still. As other teams play less and less Test cricket, the Ashes — as well as games involving India — will become both more important and less exceptional. We will crave them, and — who knows — perhaps grow bored of them. Between this summer and the 2026-27 winter, 20 of England’s 43 Tests will be against Australia or India, a ridiculous imbalance. The number of series of more than two matches played by other teams will be negligible: New Zealand four, Pakistan three, South Africa two, West Indies one, Sri Lanka none. There is already talk of some teams horse-trading away a Test here and there to fit in more white-ball cricket. For many countries, hosting a Test series means losing money — unless the visitors are India, who bring lucrative broadcasting opportunities, or England, who bring a small army of fans. So, yes, when the Ashes begins on Friday, the global game could do with a reminder that no format does unforgettable drama quite like Test cricket. The Ashes could populate cricket’s half of fame by itself. From Australia’s urn-spawning defence of 85 at the Oval in 1882, to Gilbert Jessop’s 76-ball hundred in 1902, Douglas Jardine’s Bodyline tactics of 1932-33, Don Bradman’s 1948 Invincibles, Ian Botham’s heroics in 1981, the epic clash of 2005 and Ben Stokes at Headingley four summers ago — the menu is rich and deep. White-ball cricket cannot compete. You suspect we will need more such heroism in the weeks ahead if Test cricket is to keep its chair at the top table. In that sense, England believe they are taking the lead. ‘No doubt we have beaten teams in the last year who must have sat in their changing rooms and said, “Why don’t we play like that?”’ said Stuart Broad. ‘The landscape is changing rapidly, but what we might see is players coming into Test cricket off the IPL, and playing that style in Test cricket — if this style becomes more accepted.’ That’s the glass-half-full perspective. But it may yet rub up against reality. Ex-England captain Mike Brearley laments the absence of a ‘proper standing up’ to the process of ‘ownership of players from outside the game’. For him, Bazball may at least give Test cricket ‘an extra boost in the arm’. Meanwhile, an unnamed agent recently told Wisden Cricket Monthly: ‘I’ve been in negotiations with franchises where it has been made clear that their sole interest is the strengthening of the franchise world, and the monopolisation of their teams and leagues around the world. An increase in commitment from players to the franchise world is going to be expected of them.’ England head coach Brendon McCullum has his eyes wide open, suggesting national boards would be ‘naive if they think cricketers would turn down the T20 leagues’. At the same time, he understands the bigger picture: ‘The Ashes is the biggest stage. We have to entertain and captivate kids.’ Those two views sum up where cricket finds itself as we prepare for the latest iteration of a storied series. The Ashes is no longer the only show in town. But, for the sake of Test cricket, it has to be the best. Share or comment on this article: Why we need this Ashes to keep Test cricket alive: England v Australia matters more than ever… e-mail Add comment Comments 1 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-06-11 22:34:46","image_url":"https://i.dailymail.co.uk/1s/2023/06/11/22/72017041-0-image-a-4_1686519142023.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"’Just ridiculous’: Pundits slam Indian batting after WTC loss","link":"https://www.dailymirror.lk/cricket/’Just-ridiculous’:-Pundits-slam-Indian-batting-after-WTC-loss/315-260886","keywords":null,"creator":null,"video_url":null,"description":"Former cricketers including Sunil Gavaskar slammed India’s batting after a disappointing show in their loss to Australia in Sunday’s World Test Championship final.","content":"Former cricketers including Sunil Gavaskar slammed India's batting after a disappointing show in their loss to Australia in Sunday's World Test Championship final. Chasing 444 for victory, India resumed day five on 164-3 with star batter Virat Kohli at the crease, but crashed to 234 all out in the first session at the Oval. \"The batting was in shambles today. It was just ridiculous what we saw,\" Gavaskar told Star Sports after India's 209-run loss. \"India have not lasted a session with that batting line-up. I mean, come on!\" It was India's second successive defeat in the final of Test cricket's ultimate prize, extending a world-title drought since they won the 2013 Champions Trophy in the one-day format. Australia fast bowler Scott Boland triggered the collapse with a double strike in the space of three deliveries including Kohli, caught for 49. Rohit Sharma's side fell behind by 173 runs in the first innings, bowled out for 296 in response to Australia's 469. Ajinkya Rahane stood out for India with scores of 89 and 46 in the first and second innings of a Test which belonged to Australia's Travis Head for his first-innings 163. Former India batsman Sanjay Manjrekar tweeted: \"One technical observation I have of most Indian batters, is the keenness to get onto the front foot, to even short of length balls. These are balls Steve Smith, Kane Williamson & Joe Root play back to.\" Speaking on TV to India coach Rahul Dravid, former India captain Sourav Ganguly noted some ordinary batting averages posted by India's top six. Dravid admitted his side had not met their usual high standards. \"They (the batsmen) will agree this was not up to their standards,\" the coach said. \"But these are the same batters who have won two Test series in Australia, and have won Test matches in England.\" \"We are working on it,\" he added. \"Some of the wickets in this Test championship cycle have been quite challenging, but this was a good wicket. So the averages have fallen, but we admit that if we back our bowlers with runs they will win Tests for us.\" (AFP)","pubDate":"2023-06-11 21:40:27","image_url":"https://bmkltsly13vb.compat.objectstorage.ap-singapore-1.oraclecloud.com/cdn.sg.dailymirror.lk/assets/uploads/image_f85a7b7259.jpg","source_id":"dailymirror","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"SLC plays down cricketers’ check-in delay in Zimbabwe","link":"https://www.dailymirror.lk/breaking_news/SLC-plays-down-cricketers’-check-in-delay-in-Zimbabwe/108-260880","keywords":null,"creator":null,"video_url":null,"description":"Sri Lanka Cricket (SLC) clarified the delay faced by the national cricket team that travelled to Zimbabwe for the World Cup qualifiers, after several cricketers shared images on social media of them waiting to be checked-in into the hotel in Bulawayo.","content":"Sri Lanka Cricket (SLC) clarified the delay faced by the national cricket team that travelled to Zimbabwe for the World Cup qualifiers, after several cricketers shared images on social media of them waiting to be checked-in into the hotel in Bulawayo. Images shared on the verified accounts of Sadeera Samarawickrama and Maheesh Theekshana shows several players seated on the ground as they waited to be checked in. The images, shared via Instagram Stories, have since been deleted. \"The Sri Lankan team has arrived at the hotel today at noon, and at the time of the entry, another national cricket team, who arrived just before the Sri Lankan team, was in the process of \"checking in.’,\" a media statement released by SLC read. \"This situation resulted in a delay in some of the Sri Lankan National Team players being \"checked in.’\" \"However, SLC, after reporting this matter to the hotel management, was able to rectify the issue within a short period of time,\" SLC also said in its statement.","pubDate":"2023-06-11 21:08:00","image_url":"https://bmkltsly13vb.compat.objectstorage.ap-singapore-1.oraclecloud.com/cdn.sg.dailymirror.lk/assets/uploads/image_eb55e85617.jpg","source_id":"dailymirror","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Nipun Dhananjaya to captain Sri Lanka ‘A’ in four-day matches against South Africa ‘A’","link":"https://www.dailymirror.lk/cricket/Nipun-Dhananjaya-to-captain-Sri-Lanka-‘A’-in-four-day-matches-against-South-Africa-‘A’/315-260879","keywords":null,"creator":null,"video_url":null,"description":"Left-handed batsman Nipun Dhananjaya will captain the Sri Lanka ’A’ team for the two four-day games against South Africa ’A’ that start in Pallekele tomorrow.","content":"Left-handed batsman Nipun Dhananjaya will captain the Sri Lanka 'A' team for the two four-day games against South Africa 'A' that start in Pallekele tomorrow. Test spinners Ramesh Mendis, Lasith Embuldeniya and Praveen Jaywickrama have also been included in the squad, with Kamindu Mendis serving as Dhananjaya's deputy. Lahiru Samarakoon, who was the Player of the Tournament at the Major Club T20 tournament that ended today, has been drated in in place of injured left-arm fast bowler Vishwa Fernando. Squad: Nishan Madushka, Lasith Croospulle, Kamindu Mendis – Vice Captain, Pasindu Sooriyabandara, Nipun Dhananjaya - Captain, Lahiru Udara (WK), Janith Liyanage, Lasith Embuldeniya (to be replaced by Shashika Dulshan for second match), Lakshitha Rasanjana, Dilshan Madushanka, Milan Rathnayake, Praveen Jayawickrama, Lahiru Samarakoon, Ramesh Mendis, Minod Bhanuka (WK), Nuwanidu Fernando","pubDate":"2023-06-11 20:33:00","image_url":"https://bmkltsly13vb.compat.objectstorage.ap-singapore-1.oraclecloud.com/cdn.sg.dailymirror.lk/assets/uploads/image_d311a48c41.jpg","source_id":"dailymirror","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"India lose yet again as Australia win WTC title","link":"https://kashmirreader.com/2023/06/12/india-lose-yet-again-as-australia-win-wtc-title/","keywords":["SPORTS"],"creator":["Press Trust of India"],"video_url":null,"description":"The Oval: India, for all its financial clout and hoo-ha around its cricket, lost yet again when it mattered the most, as its underwhelming record in ICC tournaments continued with a 209-run hammering by Australia in the WTC final here on Sunday. Australian pacer Scott Boland produced a bowling spell of rare quality to get […]","content":"The Oval: India, for all its financial clout and hoo-ha around its cricket, lost yet again when it mattered the most, as its underwhelming record in ICC tournaments continued with a 209-run hammering by Australia in the WTC final here on Sunday. Australian pacer Scott Boland produced a bowling spell of rare quality to get rid of Virat Kohli and Ravindra Jadeja in the same over, effectively shutting the door on India, who were bowled out for 234 in their second innings on the final day at The Oval. Australia were clearly the better team on all fronts while India had only themselves to blame for yet another loss in a global event. India’s last ICC title came way back in 2013 and it was their second successive defeat in the WTC final, having gone down against New Zealand two years ago. India lost seven wickets for the addition of 70 runs on the final day. While the non selection of R Aswhin was the big talking point on the opening day, India lost the title contest mainly due to the failure of their high-profile batting line-up. The top four comprising Rohit Sharma, Shubman Gill, Cheteshwar Pujara and Kohli failed to deliver in the high-stake game. Chasing a record 444 at The Oval, Indian fans went into day five high on hope with Kohli (49) and Ajinkya Rahane (46) walking into the middle. However, Boland removing Kohli and Jadeja (0) in the seventh over of the morning pretty much shut the door on India, who resumed the day at 164 for three needing another 280 runs for an improbable win. Kohli, who had looked in extremely good touch on day four, had to make a big hundred if India had to get anywhere close to the massive target. On a surface with variable bounce, there was always going to be an odd ball that had your name on it, and that is what happened with both Kohli and Jadeja. Boland’s relentless pursuit around the off-stump has added an extra dimension to the Australian attack. Bowling from the pavilion end, the seamer pitched one wide and Kohli went for the drive only to be caught by a flying Steve Smith at second slip. Two balls later, he got one to seam away from round the wicket and Jadeja ended up offering an easy catch to the wicketkeeper, leaving India at 179 for five. K S Bharat then joined Rahane who played a couple of beautiful straight drives off Mitchell Starc to keep crowd going. Starc drew his length back soon after and Rahane went hard at a ball that he could have left to be caught behind, sealing his team’s fate. The experienced batter was left tapping his head in frustration knowing he went for the wrong shot. Shardul Thakur lasted just five balls, lbw off Nathan Lyon, to make it 213 for seven. It seemed the match would last till lunch but the Indian tail made the task easier for the Australians and were bowled out in the extra half hour of play. PTI India lose yet again as Australia win WTC title added by Press Trust of India on 1:09 am June 12, 2023 View all posts by Press Trust of India → Press Trust of India Facebook Twitter WhatsApp Email Print Related","pubDate":"2023-06-11 19:39:36","image_url":null,"source_id":"kashmirreader","category":["sports"],"country":["india"],"language":"english"},{"title":"Ravi Shastri places onus on players, BCCI","link":"https://kashmirreader.com/2023/06/12/ravi-shastri-places-onus-on-players-bcci/","keywords":["SPORTS"],"creator":["Press Trust of India"],"video_url":null,"description":"London: Former India coach Ravi Shastri on Sunday sounded sceptical about the possibility of players getting extended gap after the IPL or practice games ahead of future WTC final matches unless there is a change in thought by all the stakeholders. After India suffered a huge 209-run defeat against Australia at the Oval, head coach […]","content":"London: Former India coach Ravi Shastri on Sunday sounded sceptical about the possibility of players getting extended gap after the IPL or practice games ahead of future WTC final matches unless there is a change in thought by all the stakeholders. After India suffered a huge 209-run defeat against Australia at the Oval, head coach Rahul Dravid said arriving in England at least two weeks earlier and playing some side matches would have been ideal for the team ahead of the big game. However, Shastri did not buy into the idea and put the onus on the players to make a choice. “That’s never going to happen. Let’s be realistic. You’re going to get 20 days, but if that’s the case, you got to miss the IPL. The choice is yours (players),” Shastri said on Star Sports. Shastri also hinted that the Board of Control for Cricket in India will have to sit down with the IPL teams to chalk out a way forward. “It’s up to the establishment as well. I’m sure the BCCI is going to review this in the future. If the WTC Final is going to come after the IPL, in month of June, for that season, if your team qualifies for the final, there should be certain clauses put in for the franchises,” said Shastri. Earlier, Shastri had also criticised the shot selection of Indian top-order batters, who let down the team. “What’s amazed me though is the way that the pitch has behaved. Rohit Sharma and Cheteshwar Pujara will be kicking themselves for playing the shots that they played. They were poor shots when they were batting beautifully,” said Shastri. PTI Ravi Shastri places onus on players, BCCI added by Press Trust of India on 1:09 am June 12, 2023 View all posts by Press Trust of India → Press Trust of India Facebook Twitter WhatsApp Email Print Related","pubDate":"2023-06-11 19:39:25","image_url":null,"source_id":"kashmirreader","category":["sports"],"country":["india"],"language":"english"},{"title":"Magam Sports Stadium comes live with T-20 Cricket Tournament","link":"https://kashmirreader.com/2023/06/12/magam-sports-stadium-comes-live-with-t-20-cricket-tournament/","keywords":["SPORTS"],"creator":["KR Desk"],"video_url":null,"description":"Collaboration for sports is the way forward: Secretary Sports Council SRINAGAR: One of the major sports events in district Budgam under the umbrella of the ‘Jhan Bhaghidari’ campaign kept Sports Council’s Magam Stadium on the cusp of some thrilling cricket encounters between teams from many districts of J&K. The local organizers teamed up with J&K […]","content":"Collaboration for sports is the way forward: Secretary Sports Council SRINAGAR: One of the major sports events in district Budgam under the umbrella of the ‘Jhan Bhaghidari’ campaign kept Sports Council’s Magam Stadium on the cusp of some thrilling cricket encounters between teams from many districts of J&K. The local organizers teamed up with J&K Sports Council under the My Youth My Pride vertical of special activities for the Magam T20 Knockout Cricket Tournament which witnessed the participation of seventy-four teams and as many as 1480 players, compared to sixty-four teams in the last edition which was also a massive hit among the cricketing circles. The tournament was played in a league cum knockout format. J&K Sports Time was the media partner for the event which played an important role in streaming live matches on social media platforms throughout the tournament. Winners of the coveted tournament will earn a cash bounty of rupees one lakh while rupees fifty thousand and twenty thousand will go into the kitty of runner-up and team placed third respectively. Every match of the tournament attracted a crowd of thousands to the ground and as per the organizer of the events, the cumulative figure of cricket enthusiasts thronging the ground during the event will easily run into lakhs. The Secretary Sports Council, Nuzhat Gull presided over the final match ceremony as the chief guest while Parveez Rasool international cricketer was the special guest, and Managing Directors from Cricket Academy of Pathans Pune and Jaipur units were guests of honor on the occasion. Speaking on the occasion Nuzhat Gull highlighted the importance of collaboration of sports events for team spirit and camaraderie between people from different backgrounds. She also emphasized the importance of promoting gender equality in sports and supporting women in sports. The chief guest congratulated the organizers for the professional approach and urged all participants to continue pursuing their passion for sports and strive for excellence. The final match of the T-20 tournament was played between Shining Star Pampore Cricket Club and Green Line Cricket Club Srinagar. The match was in progress when a report was being filed. Meanwhile, the National Wushu coaching camp that commenced at Sher-i-Kashmir Indoor Stadium Srinagar earlier this month is in full swing. The camp shall conclude in the first week of August. The two-month-long preparatory camp of the Indian Wushu team for the forthcoming 19th Asian Games to be held in China and the 16th World Wushu championship in the USA shall select the best players after putting them through the battery of selection trials even as players are taught the nuances of the game by a group of elite coaches, including National Wushu Coach and Dhronacharya awardee Kuldeep Handoo as well. Pertinently the Sports Authority of India had sanctioned the National Wushu coaching camp at Srinagar on the recommendation of the Wushu President Mr. Bhupender Singh Bajwa during the ACTC Meeting held in New Delhi earlier this year. The Secretary Sports Council Nuzhal Gull thanked the Wushu Association of India and Sports Authority of India for conducting a national camp in J&K. She said the move comes in the wake of the fact that J&K has set up some world-class sports infrastructure in recent months in almost all districts of the union territory and we are prepared to host not only national events but international events in near future The Wushu Association of India and the Wushu Association of J&K have thanked Lieutenant Governor J&K, Manoj Sinha, Sarmad Hafeez Secretary Youth Services Sports, and Secretary Sports Council Nuzhat Gull for support in organizing the camp in Srinagar. Forty-five campers including seven coaches and two supporting staff are a part of the camp besides players who have a record of bagging medals at international events. The three campers from J&K are also part of the camp including Surya Bhanu Partap Singh (Asian Games Medalist) Abhishek Jamwal (National Games Medalist) and Owais Sarwar (National Games medalist) and the trio are pitched to make it to the national team for both the international events. The Chief Coach, Kuldeep Handoo while speaking to the desk thanked SAI, MYAS, and WAI for choosing UT J&K as the permanent center for wushu training in future official events and expressed his gratitude to the Secretary Sports Council support and assistance for the successful National Wushu coaching camp in J&K In the meantime, Rohil Rashid from the hamlet of Takya Behram Shah, South Kashmir has made sports circles of J&K proud by making it to the national Softball team for Asia Cup to be held at Kochi, Japan later this month. Rohil was selected based on his performance during the final selection trials conducted by the Softball Association of India. Rohil has been a regular in various national camps conducted by SBAI in various parts of the country earlier. Indian National Softball team will leave for participation in the championship in Japan later this month under the banner of the Softball Association of India. Magam Sports Stadium comes live with T-20 Cricket Tournament added by KR Desk on 1:08 am June 12, 2023 View all posts by KR Desk → KR Desk Facebook Twitter WhatsApp Email Print Related","pubDate":"2023-06-11 19:38:55","image_url":null,"source_id":"kashmirreader","category":["sports"],"country":["india"],"language":"english"},{"title":"Australia crowned world champions after emphatic victory over India in WTC final","link":"https://www.foxsports.com.au/cricket/australia/world-test-championship-final-2023-australia-vs-india-live-cricket-scores-day-5-updates-result-the-oval-video-latest-news/news-story/7c276d885eb50e45d618da3f45e6d061","keywords":null,"creator":null,"video_url":null,"description":"Australia has won Test cricket’s ultimate prize, comprehensively defeating India by 209 runs in the World Test Championship final to secure its legacy as one of cricket’s great modern teams.","content":"Australia has won Test cricket’s ultimate prize, comprehensively defeating India by 209 runs in the World Test Championship final to secure its legacy as one of cricket’s great modern teams. After being set a record target of 444 for victory at The Oval, India was bowled out for 234 following a frantic collapse of 7-55 on Sunday afternoon, losing their second consecutive WTC Final. Scott Boland ripped through India’s top order before Nathan Lyon cleaned up the tail to help Australia win its maiden title, redeeming themselves after missing the previous final due to a slow over-rate. It’s just reward for an Australian team that has dominated the Test arena over the last 18 months, remaining unbeaten at home across ten matches and clinching a historic 1-0 series victory in Pakistan. Stream Over 50 Sports Live & On-Demand with Kayo. New to Kayo? Start your free trial now > “It’s been amazing two years,” Australian captain Pat Cummins told reporters in the post-match press conference. “We’ve had this final in the diary for a while, it’s something that we’ve been building up for. “It’s something we’re going to savour. “I know we’ve got a big series (next), but we can worry about that in a couple of days. You only get a few of these moments in your career when you can sit back and acknowledge your achievements, and this is one of those times.” Meanwhile, India will be ruing Rohit Sharma’s decision to bowl first at the toss, the omission of world No. 1 Test bowler Ravichandran Ashwin and some questionable shot selection in the fourth innings. “I thought we started well in putting them into bat, we bowled well in the first session then let ourselves down a little bit,” Sharma said in the post-match press conference. “We have made two finals, you cannot take away what we have done in those years. “It’s unfortunate we couldn’t win the finals, but we will keep our heads high and fight for the next title.” MATCH CENTRE: Australia vs India, WTC day five scoreboard Nathan Lyon of Australia takes the final wicket. Photo by Ryan Pierse/Getty Images Source: Getty Images India resumed Sunday morning at 3-164 before Boland knocked over the dangerous Virat Kohli and Ravindra Jadeja in quick succession, shattering India’s hopes of chasing down the monster target. Kohli, who looked impenetrable the previous evening, was lured into fishing outside off stump, edging towards second slip where Steve Smith held onto a superb diving catch to his right. It was Boland’s first wide delivery of the morning, and Kohli took the bait, departing for 49. The Oval’s pro-Indian crowd fell silent as Kohli, the key to India’s unlikely comeback, trudged off the field. Boland broke through again two balls later, nipping a length delivery away from the left-handed Jadeja that was feathered through to wicketkeeper Alex Carey. The final delivery of Boland’s golden over struck Indian wicketkeeper Srikar Bharat on the gloves, narrowly evading a leaping David Warner at first slip for a streaky boundary. It was nothing magical from Boland — just consistent, probing bowling that should worry England’s batters ahead of the Ashes. “He just keeps finding another level, he’s unbelievable,” Cummins said. “He was our best bowler all game. Held it together, didn’t go for many runs, always looks threatening. “I’m sure he’ll play a huge role in the Ashes.” Scott Boland of Australia. Photo by Ryan Pierse/Getty Images Source: Getty Images The following over, Bharat underwent a concussion assessment after ducking into a Cummins bouncer that thudded into his helmet. Australia also burnt two reviews within the first 45 minutes — one was for a non-existent outside edge that only Marnus Labuschagne heard, the other being an LBW shout that slid comfortably down leg. Ajinkya Rahane looked on track to replicate his first-innings heroics before recklessly driving at a wide delivery from Mitchell Starc, nicking behind for 46 to expose India’s tail. Lyon joined the party the following over, trapping Shardul Thakur on the pads plumb LBW from around the wicket — the Indian all-rounder wasted a review before departing for a duck. A rip-snorting bouncer from Starc and an impressive one-handed grab from Carey saw the end of Umesh Yadav, who gloved the well-directed short ball down the leg side, gone for 1. Lyon then cleaned up the tail, removing Bharat and Mohammed Siraj in quick succession to seal Australia’s triumph. Head was named player of the match for his counterattacking 163 in the first innings. Australia has a short turnaround before their next challenge, the Ashes, which gets underway in Birmingham on Friday.","pubDate":"2023-06-11 19:20:00","image_url":null,"source_id":"foxsports","category":["sports"],"country":["australia"],"language":"english"},{"title":"Sir Alastair Cook strikes 74th first-class century as Essex dominate Somerset","link":"https://www.independent.co.uk/sport/cricket/alastair-cook-essex-somerset-england-lancashire-b2355570.html","keywords":["Cricket","Sport"],"creator":["Pa Sport Staff"],"video_url":null,"description":"Former England captain Cook converted to three figures in 210 balls before reaching 128.","content":"Sir Alastair Cook struck his 74th first-class century as Essex took advantage of perfect batting conditions in their LV= Insurance County Championship clash with Somerset . Former England captain Cook converted to three figures in 210 balls before reaching 128 as Essex racked up 360 for four on the opening day with Matt Critchley adding a sublime 119. A stand of 115 between makeshift opening partnership Phil Salt and George Balderson saw Lancashire take charge against Hampshire at Southport. Having dismissed the visitors for just 142, helped by three wickets apiece for Tom Bailey and Will Williams, Salt and Balderson made light work of Hampshire’s much-vaunted bowling attack as they powered their way to 139 for one at the close, trailing by three runs. A stellar century by Jordan Cox rescued Kent as they faced champions Surrey at Canterbury. The hosts recovered from 41 for five to 301 all out after losing five top-order wickets for seven runs in the space of 31 balls. Cox led the fightback with 133, exactly 100 of which came after he was dropped by Ben Foakes. Surrey’s Sean Abbott took four for 52, but the visitors were 18 for two at stumps, trailing by 283 after Agar claimed two late wickets. Sam Hain’s third century of the season helped Warwickshire get off to a strong start against Nottinghamshire at Trent Bridge. The visitors ended day one on 361 for five after Hain shared a fourth-wicket partnership of 171 with Dan Mousley (87), opener Alex Davies having earlier scored 93. In Division Two, Matthew Fisher delivered a timely demonstration of his international potential on a day of Yorkshire domination against Derbyshire at Chesterfield. Fisher – who played a Test Match in the Caribbean 15 months ago and could come into Ashes reckoning if England’s fast bowlers sustain injuries – returned career-best figures of five for 30 to skittle Derbyshire for 111. Yorkshire skipper Shan Masood heaped further misery on his former county with 67 – his highest score of the season – and Dawid Malan made an unbeaten 76 before rain ended play early with the visitors 272 for five, 161 ahead. Only 36 overs were possible between Gloucestershire and Leicestershire at Bristol because of heavily overcast skies and rain. By the close of a frustrating day, Gloucestershire had posted 108 for three, Ollie Price unbeaten on 26. Kiran Carlson scored a brilliant century to allow Glamorgan to post 390 with the bat against Durham at Seat Unique Riverside. Carlson was dropped on 67 and 107, and he duly made the hosts pay with his knock of 162 supported by 60 from Sam Northeast and a quickfire 45 from Billy Root. Tailenders Jack Carson and Henry Shipley helped Sussex mount a respectable score after an early stumble against Worcestershire. Sussex recovered from 142 for six to reach 338 for nine at stumps thanks to some late-order hitting from Nathan McAndrew, Carson and debutant Shipley, the latter two putting on 85 for the ninth wicket. Worcestershire’s Joe Leach finished the day with figures of six for 73.","pubDate":"2023-06-11 18:59:45","image_url":"https://static.independent.co.uk/2023/06/11/20/b2707ea12c136bd9284e4ec1d49a340bY29udGVudHNlYXJjaGFwaSwxNjg2NTk1OTc3-2.59475170.jpg?width=1200&auto=webp","source_id":"independentuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Australian openers flop as Scott Boland creates fresh Ashes headache: WTC Final Player Ratings","link":"https://www.foxsports.com.au/cricket/australian-openers-flop-as-scott-boland-creates-fresh-ashes-headache-wtc-final-player-ratings/news-story/b2c0438d94f00c87d59d880a3553490c","keywords":null,"creator":null,"video_url":null,"description":"Australia has secured its maiden World Test Championship title after thumping India by 209 runs at The Oval, capping a dominant 18 months in the Test arena.","content":"Australia has secured its maiden World Test Championship title after thumping India by 209 runs at The Oval , capping a dominant 18 months in the Test arena. India lost 7-55 in a dramatic collapse on Sunday morning, with Scott Boland and Nathan Lyon ripping through the team’s middle-order in the second innings. The Australians were far from their best in the WTC Final, but the contest was ideal preparation ahead of their five-Test Ashes campaign against England. Get all the latest cricket news, highlights and analysis delivered straight to your inbox with Fox Sports Sportmail. Sign up now! 'First Kohli, now Jadeja!' Aussies erupt | 00:43 DAVID WARNER — 5 43 and 1 Despite ongoing speculation about his future in the Test arena, David Warner has done enough to secure his spot for the first Ashes Test at Edgbaston. After surviving a probing opening spell on the morning of day one, when conditions were hardest for batting, the veteran opener looked in fine touch before gloving a pull shot down the leg side. But Warner’s questionable footwork in the second innings was a glaring concern ahead of his fourth and final Ashes campaign in the United Kingdom. The 36-year-old also put down a chance at first slip early on day three, albeit potentially disturbed by wicketkeeper Alex Carey. Warner takes Umesh to the cleaners | 00:40 USMAN KHAWAJA — 3 0 and 13 England’s quicks will be licking their lips after Usman Khawaja nicked behind in both innings of the World Test Championship final against India. Whether on the attack or in defence, the swinging Dukes ball remains Khawaja’s kryptonite, with his Test average in England slipping to 17.78. The Queenslander looked more in control during the second innings before a rush of blood to head, recklessly swatting at a wide delivery from Umesh Yadav on Friday afternoon. He also dropped a tough catch in the slips cordon during the opening over of day three, handing Shardul Thakar an early reprieve on zero. India strike as Uzzie departs for a duck | 00:33 MARNUS LABUSCHAGNE — 6 26 and 41 The world’s No. 1 Test batter has continued his frustrating trend of making starts without going on with them. Marnus Labuschagne threw his wicket away in the first innings with an extravagant drive against Mohammed Shami, bowled after the lunch break to leave Australia in a spot of bother at 3-76. The Queenslander batted valiantly on day three, copping a barrage of body blows as the spicy pitch started playing tricks in the evening session. But Labuschagne failed to convert into a half-century on Saturday morning, falling victim to Umesh Yadav caught at first slip. Marnus abruptly woken up by wicket! | 00:34 STEVE SMITH — 9 121 and 34 The Australian vice-captain’s love affair with The Oval continued this week, peeling off his third Test century at the Kennington venue in the World Test Championship final. After a patient start on day one, Steve Smith accelerated in the evening session and brought up his 31st Test ton on Thursday morning with back-to-back boundaries off Mohammed Siraj. Having revived the back-and-across trigger movement that worked wonders against England in 2019, Smith looks destined to replicate his batting heroics from four years ago in the upcoming Ashes. The 34-year-old’s uncharacteristic dismissal in the second innings, a village slog off Indian spinner Ravindra Jadeja, was hopefully a blip in an otherwise prolific winter campaign. Smith hits 31st ton as Aussies dominate | 02:43 TRAVIS HEAD — 9 163 and 18 The decision to drop Travis Head for the Border-Gavaskar Trophy series opener becomes more dumbfounding with every match. The South Australian brought up his first Test century outside Australia in the World Test Championship final this week, rescuing the Aussies with a counterattacking masterclass on day one at The Oval — the same venue where he was dropped four years earlier. He just keeps making the national selectors look foolish. Despite some vulnerability against the short ball and a cheap dismissal in the second innings, Head looms as a crucial figure for Australia ahead of the Ashes. Head bludgeons maiden ton against India | 02:40 CAMERON GREEN — 6 6 and 25, 2-44 and 0-13 We saw the best and worst of Cameron Green this week. After smacking his first Test delivery in England through gully for a classy boundary, the young West Australian was dismissed cheaply a few minutes later with a reckless swipe outside off. When Cheteshwar Pujara muscled a loose Green delivery through point for four on Thursday, the 24-year-old responded with a peach that nipped back and crashed into the Indian No. 3’s off stump. And after dropping a regulation catch at gully to gift Shardul Thakar an extra life early on day three, he redeemed himself with a pair of one-handed screamers. Meanwhile, Green’s second-innings dismissal was baffling, to say the least. The only thing he’s lacking is consistency — with bat, ball and in the field. Green takes absolute screamer on Day 3 | 00:32 ALEX CAREY — 8 48 and 66*, six catches Alex Carey has never mustered more runs in a Test match, top-scoring for Australia in the second innings of the World Test Championship final to help set an imposing fourth-innings chase for India. The South Australian shot himself in the foot on day two with an unwarranted reverse sweep, but otherwise batted impeccably throughout the match. Carey’s glovework was tidy, as always, but he was once again reluctant to dive in front of first slip when Ajinkya Rahane edged behind early on day three, a recurring problem for the 31-year-old. However, he redeemed himself with a spectacular one-handed grab above his head to remove Umesh Yadav during India’s collapse on day five. Deja vu - sweep burns Carey again! | 00:57 MITCHELL STARC — 5 2-71 and 2-77 Mitchell Starc’s spot for the Edgbaston Ashes Test is in jeopardy after an underwhelming bowling performance in the World Test Championship final against India. The left-armer was taken out of the attack after just two over in the first innings, struggling to find his length and failing to swing the fresh Dukes ball. He leaked almost six runs per over in the second innings, when he didn’t open the bowling, conceding boundaries regularly throughout Saturday’s evening session. However, Starc’s dismissals of Virat Kohli and Ajinkya Rahane showed why he’s such a valuable member of this Test side — he has a knack of taking wickets when the team desperately needs one. Kohli has no answer for Starc snorter | 00:37 PAT CUMMINS — 6 3-83 and 1-55 The Australian captain will be the first to admit he showed signs of rust in the World Test Championship final after his three-month break. Pat Cummins was plagued by front-foot no-balls throughout the match, registering ten of them across both innings, two of which proved costly — Ajinkya Rahane and Shardul Thakar were each gifted extra lives at the crease after the New South Welshman overstepped. Regardless, Cummins showed glimpses of his destructive potential against the Indians this week, and he’s hopefully cleared out the cobwebs ahead of the Ashes. Tiny overstep costs Cummins dearly | 00:46 NATHAN LYON — 8 1-19 and 4-41 He hardly bowled in the first innings, but Nathan Lyon still found a way to leave his mark on the World Test Championship final against India. Thrown the ball late on day two, the veteran off-spinner snared the crucial wicket of Ravindra Jadeja in his second over with a gorgeous delivery that kissed the left-hander’s outside edge. Lyon’s dismissal of rival captain Rohit Sharma changed the game’s momentum on Saturday evening before he returned the following morning to clean up India’s tail. He’s one step closer to the magical 500-wicket milestone. Boland bowling pearls through India | 00:27 SCOTT BOLAND — 9 2-59 and 3-46 It’s almost as though Scott Boland was created to bowl in English conditions. The Victorian, playing his first professional match in the United Kingdom, immediately looked at home with the Dukes ball this week, starting with a pair of maidens and the glorious dismissal of Shubman Gill. Boland, relentlessly accurate with the ball, was comfortably Australia’s most economical bowler in the first innings, leaking less than three runs per over in a high-scoring contest. Promoted to open the bowling in the second innings, he claimed the early scalp of Subman Gill before outsmarting Virat Kohli on Sunday morning, sealing India’s fate. Boland has given the national selectors a major headache ahead of the Ashes.","pubDate":"2023-06-11 18:40:00","image_url":null,"source_id":"foxsports","category":["sports"],"country":["australia"],"language":"english"},{"title":"Why we need this Ashes to keep Test cricket alive: England v Australia matters more than ever…","link":"https://www.dailymail.co.uk/sport/cricket/article-12183829/Why-need-Ashes-Test-cricket-alive-England-v-Australia-matters-ever.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"LAWRENCE BOOTH: It was at Rawalpindi in December, as England basked in an astonishing victory in the first Test against Pakistan, that Ben Stokes laid out his hopes and dreams.","content":"LAWRENCE BOOTH: England's clash with Australia matters more than ever as nations ditch five-day games and players cash in with opportunistic franchises... why we NEED this Ashes to keep Test cricket alive This year’s Ashes series is the most hotly anticipated series in recent memory Both teams are in great form and talking a big game ahead of the showdown Australia dominated the last series on their home turf, winning 4-0 By Lawrence Booth for MailOnline Published: 22:32, 11 June 2023 | Updated: 23:34, 11 June 2023 e-mail 1 View comments It was at Rawalpindi in December, as England basked in an astonishing victory in the first Test against Pakistan , that Ben Stokes laid out his hopes and dreams. His team had just won with minutes to spare, having scored 506 for four from 75 overs on the first day, then challenged Pakistan to make 343 in four sessions — a gettable target on a merciless pitch. It was a victory for the ages, a subversion of what seemed possible. ‘That’s how Test cricket should be played, always looking at the entertainment side of the sport, because Test cricket is something that needs to be looked after,’ said Stokes. ‘We don’t want Test cricket to fall off the face of the planet. It needs to stay around and we’ll do everything we possibly can as a team to keep it alive.’ Six months on, as England prepare for the most talked-about Ashes since 2005, his message feels even more urgent. T20 franchise cricket is taking over the game, one tournament at a time, and teams outside the so-called Big Three — India , England and Australia — have pared their Test commitments to the bone. For international cricket, the doomsday scenario is well underway: players are signing contracts with opportunistic conglomerates rather than the home boards who have nurtured them. The upcoming Ashes series represents a huge moment for Test cricket as a whole World Test champions Australia will be a massive challenge for England to overcome Nations are ditching five-day cricket with T20 franchise cricket appearing to take over England white-ball opener Jason Roy’s decision to plump for LA Knight Riders in America’s new Major League Cricket over an incremental contract with the ECB is just the iceberg’s tip. On the eve of the World Test Championship final at the Oval, the second question to Australia captain Pat Cummins was about the future of a format that has been around since 1876, and provided the game with the bulk of its most fabled moments. ‘Every Test player I have come up against still talks about their love of the game,’ he said, before half-addressing the elephant in the room. ‘But obviously times are changing.’ Not half, Pat. Not half. The impending demise of Test cricket has long been a favourite theme for the sport’s opinion formers, but the concerns are no longer in the realm of the theoretical. Private funds and made-up teams now exert a more powerful pull on players and administrators than the bilateral arrangements of old. Money talks. Correction: it screams. Some regard this development with fear and loathing. Others enthuse about the reach of the free market and the rewards for players with a short shelf-life. Everyone agrees a turning point has become a tipping point. It is against this backdrop that the Ashes begins this week. England v Australia has always been at the heart of Test cricket’s narrative. Starting with the teams’ first meeting, at Melbourne in March 1877, they have played each other 356 times — one in seven of all Tests. The next-most common fixture is England v West Indies, miles behind on 163. Australia hold the edge, with 150 victories to England’s 110, and the Australian philosopher David Stove thought he knew why: ‘Whereas the Australians hate the Poms, the Poms only despise the Australians.’ Jason Roy has forfeited an England contract to play in the new US T20 cricket league He was on to a deeper truth: this is a contest that transcends numbers, a clash of two cultures divided by a common sport. As Vic Marks, the former Somerset and England off-spinner, once put it: ‘When appealing, the Australians make a statement. We ask a question.’ Shane Warne, the genius leg-spinner whose death last year at the age of 52 still hangs over the game, would have enjoyed that almost as much as he would have enjoyed Bazball. This summer’s contest, between a rejuvenated England side and an Australia team desperate to win their first series in this country for 22 years, may yet go down as a classic. But the burden the Ashes now carries is becoming unsustainable. And next summer, when the Test tourists will be West Indies and Sri Lanka — no one’s idea of a drawcard — the debate about the format’s future will be more angst-ridden still. As other teams play less and less Test cricket, the Ashes — as well as games involving India — will become both more important and less exceptional. We will crave them, and — who knows — perhaps grow bored of them. Between this summer and the 2026-27 winter, 20 of England’s 43 Tests will be against Australia or India, a ridiculous imbalance. The number of series of more than two matches played by other teams will be negligible: New Zealand four, Pakistan three, South Africa two, West Indies one, Sri Lanka none. There is already talk of some teams horse-trading away a Test here and there to fit in more white-ball cricket. For many countries, hosting a Test series means losing money — unless the visitors are India, who bring lucrative broadcasting opportunities, or England, who bring a small army of fans. So, yes, when the Ashes begins on Friday, the global game could do with a reminder that no format does unforgettable drama quite like Test cricket. The Ashes could populate cricket’s half of fame by itself. From Australia’s urn-spawning defence of 85 at the Oval in 1882, to Gilbert Jessop’s 76-ball hundred in 1902, Douglas Jardine’s Bodyline tactics of 1932-33, Don Bradman’s 1948 Invincibles, Ian Botham’s heroics in 1981, the epic clash of 2005 and Ben Stokes at Headingley four summers ago — the menu is rich and deep. White-ball cricket cannot compete. You suspect we will need more such heroism in the weeks ahead if Test cricket is to keep its chair at the top table. In that sense, England believe they are taking the lead. ‘No doubt we have beaten teams in the last year who must have sat in their changing rooms and said, “Why don’t we play like that?”’ said Stuart Broad. ‘The landscape is changing rapidly, but what we might see is players coming into Test cricket off the IPL, and playing that style in Test cricket — if this style becomes more accepted.’ That’s the glass-half-full perspective. But it may yet rub up against reality. Ex-England captain Mike Brearley laments the absence of a ‘proper standing up’ to the process of ‘ownership of players from outside the game’. For him, Bazball may at least give Test cricket ‘an extra boost in the arm’. Meanwhile, an unnamed agent recently told Wisden Cricket Monthly: ‘I’ve been in negotiations with franchises where it has been made clear that their sole interest is the strengthening of the franchise world, and the monopolisation of their teams and leagues around the world. An increase in commitment from players to the franchise world is going to be expected of them.’ England head coach Brendon McCullum has his eyes wide open, suggesting national boards would be ‘naive if they think cricketers would turn down the T20 leagues’. At the same time, he understands the bigger picture: ‘The Ashes is the biggest stage. We have to entertain and captivate kids.’ Those two views sum up where cricket finds itself as we prepare for the latest iteration of a storied series. The Ashes is no longer the only show in town. But, for the sake of Test cricket, it has to be the best. Share or comment on this article: Why we need this Ashes to keep Test cricket alive: England v Australia matters more than ever… e-mail Add comment Comments 1 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-06-11 22:34:46","image_url":"https://i.dailymail.co.uk/1s/2023/06/11/22/72017041-0-image-a-4_1686519142023.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"’Just ridiculous’: Pundits slam Indian batting after WTC loss","link":"https://www.dailymirror.lk/cricket/’Just-ridiculous’:-Pundits-slam-Indian-batting-after-WTC-loss/315-260886","keywords":null,"creator":null,"video_url":null,"description":"Former cricketers including Sunil Gavaskar slammed India’s batting after a disappointing show in their loss to Australia in Sunday’s World Test Championship final.","content":"Former cricketers including Sunil Gavaskar slammed India's batting after a disappointing show in their loss to Australia in Sunday's World Test Championship final. Chasing 444 for victory, India resumed day five on 164-3 with star batter Virat Kohli at the crease, but crashed to 234 all out in the first session at the Oval. \"The batting was in shambles today. It was just ridiculous what we saw,\" Gavaskar told Star Sports after India's 209-run loss. \"India have not lasted a session with that batting line-up. I mean, come on!\" It was India's second successive defeat in the final of Test cricket's ultimate prize, extending a world-title drought since they won the 2013 Champions Trophy in the one-day format. Australia fast bowler Scott Boland triggered the collapse with a double strike in the space of three deliveries including Kohli, caught for 49. Rohit Sharma's side fell behind by 173 runs in the first innings, bowled out for 296 in response to Australia's 469. Ajinkya Rahane stood out for India with scores of 89 and 46 in the first and second innings of a Test which belonged to Australia's Travis Head for his first-innings 163. Former India batsman Sanjay Manjrekar tweeted: \"One technical observation I have of most Indian batters, is the keenness to get onto the front foot, to even short of length balls. These are balls Steve Smith, Kane Williamson & Joe Root play back to.\" Speaking on TV to India coach Rahul Dravid, former India captain Sourav Ganguly noted some ordinary batting averages posted by India's top six. Dravid admitted his side had not met their usual high standards. \"They (the batsmen) will agree this was not up to their standards,\" the coach said. \"But these are the same batters who have won two Test series in Australia, and have won Test matches in England.\" \"We are working on it,\" he added. \"Some of the wickets in this Test championship cycle have been quite challenging, but this was a good wicket. So the averages have fallen, but we admit that if we back our bowlers with runs they will win Tests for us.\" (AFP)","pubDate":"2023-06-11 21:40:27","image_url":"https://bmkltsly13vb.compat.objectstorage.ap-singapore-1.oraclecloud.com/cdn.sg.dailymirror.lk/assets/uploads/image_f85a7b7259.jpg","source_id":"dailymirror","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"SLC plays down cricketers’ check-in delay in Zimbabwe","link":"https://www.dailymirror.lk/breaking_news/SLC-plays-down-cricketers’-check-in-delay-in-Zimbabwe/108-260880","keywords":null,"creator":null,"video_url":null,"description":"Sri Lanka Cricket (SLC) clarified the delay faced by the national cricket team that travelled to Zimbabwe for the World Cup qualifiers, after several cricketers shared images on social media of them waiting to be checked-in into the hotel in Bulawayo.","content":"Sri Lanka Cricket (SLC) clarified the delay faced by the national cricket team that travelled to Zimbabwe for the World Cup qualifiers, after several cricketers shared images on social media of them waiting to be checked-in into the hotel in Bulawayo. Images shared on the verified accounts of Sadeera Samarawickrama and Maheesh Theekshana shows several players seated on the ground as they waited to be checked in. The images, shared via Instagram Stories, have since been deleted. \"The Sri Lankan team has arrived at the hotel today at noon, and at the time of the entry, another national cricket team, who arrived just before the Sri Lankan team, was in the process of \"checking in.’,\" a media statement released by SLC read. \"This situation resulted in a delay in some of the Sri Lankan National Team players being \"checked in.’\" \"However, SLC, after reporting this matter to the hotel management, was able to rectify the issue within a short period of time,\" SLC also said in its statement.","pubDate":"2023-06-11 21:08:00","image_url":"https://bmkltsly13vb.compat.objectstorage.ap-singapore-1.oraclecloud.com/cdn.sg.dailymirror.lk/assets/uploads/image_eb55e85617.jpg","source_id":"dailymirror","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Nipun Dhananjaya to captain Sri Lanka ‘A’ in four-day matches against South Africa ‘A’","link":"https://www.dailymirror.lk/cricket/Nipun-Dhananjaya-to-captain-Sri-Lanka-‘A’-in-four-day-matches-against-South-Africa-‘A’/315-260879","keywords":null,"creator":null,"video_url":null,"description":"Left-handed batsman Nipun Dhananjaya will captain the Sri Lanka ’A’ team for the two four-day games against South Africa ’A’ that start in Pallekele tomorrow.","content":"Left-handed batsman Nipun Dhananjaya will captain the Sri Lanka 'A' team for the two four-day games against South Africa 'A' that start in Pallekele tomorrow. Test spinners Ramesh Mendis, Lasith Embuldeniya and Praveen Jaywickrama have also been included in the squad, with Kamindu Mendis serving as Dhananjaya's deputy. Lahiru Samarakoon, who was the Player of the Tournament at the Major Club T20 tournament that ended today, has been drated in in place of injured left-arm fast bowler Vishwa Fernando. Squad: Nishan Madushka, Lasith Croospulle, Kamindu Mendis – Vice Captain, Pasindu Sooriyabandara, Nipun Dhananjaya - Captain, Lahiru Udara (WK), Janith Liyanage, Lasith Embuldeniya (to be replaced by Shashika Dulshan for second match), Lakshitha Rasanjana, Dilshan Madushanka, Milan Rathnayake, Praveen Jayawickrama, Lahiru Samarakoon, Ramesh Mendis, Minod Bhanuka (WK), Nuwanidu Fernando","pubDate":"2023-06-11 20:33:00","image_url":"https://bmkltsly13vb.compat.objectstorage.ap-singapore-1.oraclecloud.com/cdn.sg.dailymirror.lk/assets/uploads/image_d311a48c41.jpg","source_id":"dailymirror","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"India lose yet again as Australia win WTC title","link":"https://kashmirreader.com/2023/06/12/india-lose-yet-again-as-australia-win-wtc-title/","keywords":["SPORTS"],"creator":["Press Trust of India"],"video_url":null,"description":"The Oval: India, for all its financial clout and hoo-ha around its cricket, lost yet again when it mattered the most, as its underwhelming record in ICC tournaments continued with a 209-run hammering by Australia in the WTC final here on Sunday. Australian pacer Scott Boland produced a bowling spell of rare quality to get […]","content":"The Oval: India, for all its financial clout and hoo-ha around its cricket, lost yet again when it mattered the most, as its underwhelming record in ICC tournaments continued with a 209-run hammering by Australia in the WTC final here on Sunday. Australian pacer Scott Boland produced a bowling spell of rare quality to get rid of Virat Kohli and Ravindra Jadeja in the same over, effectively shutting the door on India, who were bowled out for 234 in their second innings on the final day at The Oval. Australia were clearly the better team on all fronts while India had only themselves to blame for yet another loss in a global event. India’s last ICC title came way back in 2013 and it was their second successive defeat in the WTC final, having gone down against New Zealand two years ago. India lost seven wickets for the addition of 70 runs on the final day. While the non selection of R Aswhin was the big talking point on the opening day, India lost the title contest mainly due to the failure of their high-profile batting line-up. The top four comprising Rohit Sharma, Shubman Gill, Cheteshwar Pujara and Kohli failed to deliver in the high-stake game. Chasing a record 444 at The Oval, Indian fans went into day five high on hope with Kohli (49) and Ajinkya Rahane (46) walking into the middle. However, Boland removing Kohli and Jadeja (0) in the seventh over of the morning pretty much shut the door on India, who resumed the day at 164 for three needing another 280 runs for an improbable win. Kohli, who had looked in extremely good touch on day four, had to make a big hundred if India had to get anywhere close to the massive target. On a surface with variable bounce, there was always going to be an odd ball that had your name on it, and that is what happened with both Kohli and Jadeja. Boland’s relentless pursuit around the off-stump has added an extra dimension to the Australian attack. Bowling from the pavilion end, the seamer pitched one wide and Kohli went for the drive only to be caught by a flying Steve Smith at second slip. Two balls later, he got one to seam away from round the wicket and Jadeja ended up offering an easy catch to the wicketkeeper, leaving India at 179 for five. K S Bharat then joined Rahane who played a couple of beautiful straight drives off Mitchell Starc to keep crowd going. Starc drew his length back soon after and Rahane went hard at a ball that he could have left to be caught behind, sealing his team’s fate. The experienced batter was left tapping his head in frustration knowing he went for the wrong shot. Shardul Thakur lasted just five balls, lbw off Nathan Lyon, to make it 213 for seven. It seemed the match would last till lunch but the Indian tail made the task easier for the Australians and were bowled out in the extra half hour of play. PTI India lose yet again as Australia win WTC title added by Press Trust of India on 1:09 am June 12, 2023 View all posts by Press Trust of India → Press Trust of India Facebook Twitter WhatsApp Email Print Related","pubDate":"2023-06-11 19:39:36","image_url":null,"source_id":"kashmirreader","category":["sports"],"country":["india"],"language":"english"},{"title":"Ravi Shastri places onus on players, BCCI","link":"https://kashmirreader.com/2023/06/12/ravi-shastri-places-onus-on-players-bcci/","keywords":["SPORTS"],"creator":["Press Trust of India"],"video_url":null,"description":"London: Former India coach Ravi Shastri on Sunday sounded sceptical about the possibility of players getting extended gap after the IPL or practice games ahead of future WTC final matches unless there is a change in thought by all the stakeholders. After India suffered a huge 209-run defeat against Australia at the Oval, head coach […]","content":"London: Former India coach Ravi Shastri on Sunday sounded sceptical about the possibility of players getting extended gap after the IPL or practice games ahead of future WTC final matches unless there is a change in thought by all the stakeholders. After India suffered a huge 209-run defeat against Australia at the Oval, head coach Rahul Dravid said arriving in England at least two weeks earlier and playing some side matches would have been ideal for the team ahead of the big game. However, Shastri did not buy into the idea and put the onus on the players to make a choice. “That’s never going to happen. Let’s be realistic. You’re going to get 20 days, but if that’s the case, you got to miss the IPL. The choice is yours (players),” Shastri said on Star Sports. Shastri also hinted that the Board of Control for Cricket in India will have to sit down with the IPL teams to chalk out a way forward. “It’s up to the establishment as well. I’m sure the BCCI is going to review this in the future. If the WTC Final is going to come after the IPL, in month of June, for that season, if your team qualifies for the final, there should be certain clauses put in for the franchises,” said Shastri. Earlier, Shastri had also criticised the shot selection of Indian top-order batters, who let down the team. “What’s amazed me though is the way that the pitch has behaved. Rohit Sharma and Cheteshwar Pujara will be kicking themselves for playing the shots that they played. They were poor shots when they were batting beautifully,” said Shastri. PTI Ravi Shastri places onus on players, BCCI added by Press Trust of India on 1:09 am June 12, 2023 View all posts by Press Trust of India → Press Trust of India Facebook Twitter WhatsApp Email Print Related","pubDate":"2023-06-11 19:39:25","image_url":null,"source_id":"kashmirreader","category":["sports"],"country":["india"],"language":"english"},{"title":"Magam Sports Stadium comes live with T-20 Cricket Tournament","link":"https://kashmirreader.com/2023/06/12/magam-sports-stadium-comes-live-with-t-20-cricket-tournament/","keywords":["SPORTS"],"creator":["KR Desk"],"video_url":null,"description":"Collaboration for sports is the way forward: Secretary Sports Council SRINAGAR: One of the major sports events in district Budgam under the umbrella of the ‘Jhan Bhaghidari’ campaign kept Sports Council’s Magam Stadium on the cusp of some thrilling cricket encounters between teams from many districts of J&K. The local organizers teamed up with J&K […]","content":"Collaboration for sports is the way forward: Secretary Sports Council SRINAGAR: One of the major sports events in district Budgam under the umbrella of the ‘Jhan Bhaghidari’ campaign kept Sports Council’s Magam Stadium on the cusp of some thrilling cricket encounters between teams from many districts of J&K. The local organizers teamed up with J&K Sports Council under the My Youth My Pride vertical of special activities for the Magam T20 Knockout Cricket Tournament which witnessed the participation of seventy-four teams and as many as 1480 players, compared to sixty-four teams in the last edition which was also a massive hit among the cricketing circles. The tournament was played in a league cum knockout format. J&K Sports Time was the media partner for the event which played an important role in streaming live matches on social media platforms throughout the tournament. Winners of the coveted tournament will earn a cash bounty of rupees one lakh while rupees fifty thousand and twenty thousand will go into the kitty of runner-up and team placed third respectively. Every match of the tournament attracted a crowd of thousands to the ground and as per the organizer of the events, the cumulative figure of cricket enthusiasts thronging the ground during the event will easily run into lakhs. The Secretary Sports Council, Nuzhat Gull presided over the final match ceremony as the chief guest while Parveez Rasool international cricketer was the special guest, and Managing Directors from Cricket Academy of Pathans Pune and Jaipur units were guests of honor on the occasion. Speaking on the occasion Nuzhat Gull highlighted the importance of collaboration of sports events for team spirit and camaraderie between people from different backgrounds. She also emphasized the importance of promoting gender equality in sports and supporting women in sports. The chief guest congratulated the organizers for the professional approach and urged all participants to continue pursuing their passion for sports and strive for excellence. The final match of the T-20 tournament was played between Shining Star Pampore Cricket Club and Green Line Cricket Club Srinagar. The match was in progress when a report was being filed. Meanwhile, the National Wushu coaching camp that commenced at Sher-i-Kashmir Indoor Stadium Srinagar earlier this month is in full swing. The camp shall conclude in the first week of August. The two-month-long preparatory camp of the Indian Wushu team for the forthcoming 19th Asian Games to be held in China and the 16th World Wushu championship in the USA shall select the best players after putting them through the battery of selection trials even as players are taught the nuances of the game by a group of elite coaches, including National Wushu Coach and Dhronacharya awardee Kuldeep Handoo as well. Pertinently the Sports Authority of India had sanctioned the National Wushu coaching camp at Srinagar on the recommendation of the Wushu President Mr. Bhupender Singh Bajwa during the ACTC Meeting held in New Delhi earlier this year. The Secretary Sports Council Nuzhal Gull thanked the Wushu Association of India and Sports Authority of India for conducting a national camp in J&K. She said the move comes in the wake of the fact that J&K has set up some world-class sports infrastructure in recent months in almost all districts of the union territory and we are prepared to host not only national events but international events in near future The Wushu Association of India and the Wushu Association of J&K have thanked Lieutenant Governor J&K, Manoj Sinha, Sarmad Hafeez Secretary Youth Services Sports, and Secretary Sports Council Nuzhat Gull for support in organizing the camp in Srinagar. Forty-five campers including seven coaches and two supporting staff are a part of the camp besides players who have a record of bagging medals at international events. The three campers from J&K are also part of the camp including Surya Bhanu Partap Singh (Asian Games Medalist) Abhishek Jamwal (National Games Medalist) and Owais Sarwar (National Games medalist) and the trio are pitched to make it to the national team for both the international events. The Chief Coach, Kuldeep Handoo while speaking to the desk thanked SAI, MYAS, and WAI for choosing UT J&K as the permanent center for wushu training in future official events and expressed his gratitude to the Secretary Sports Council support and assistance for the successful National Wushu coaching camp in J&K In the meantime, Rohil Rashid from the hamlet of Takya Behram Shah, South Kashmir has made sports circles of J&K proud by making it to the national Softball team for Asia Cup to be held at Kochi, Japan later this month. Rohil was selected based on his performance during the final selection trials conducted by the Softball Association of India. Rohil has been a regular in various national camps conducted by SBAI in various parts of the country earlier. Indian National Softball team will leave for participation in the championship in Japan later this month under the banner of the Softball Association of India. Magam Sports Stadium comes live with T-20 Cricket Tournament added by KR Desk on 1:08 am June 12, 2023 View all posts by KR Desk → KR Desk Facebook Twitter WhatsApp Email Print Related","pubDate":"2023-06-11 19:38:55","image_url":null,"source_id":"kashmirreader","category":["sports"],"country":["india"],"language":"english"},{"title":"Australia crowned world champions after emphatic victory over India in WTC final","link":"https://www.foxsports.com.au/cricket/australia/world-test-championship-final-2023-australia-vs-india-live-cricket-scores-day-5-updates-result-the-oval-video-latest-news/news-story/7c276d885eb50e45d618da3f45e6d061","keywords":null,"creator":null,"video_url":null,"description":"Australia has won Test cricket’s ultimate prize, comprehensively defeating India by 209 runs in the World Test Championship final to secure its legacy as one of cricket’s great modern teams.","content":"Australia has won Test cricket’s ultimate prize, comprehensively defeating India by 209 runs in the World Test Championship final to secure its legacy as one of cricket’s great modern teams. After being set a record target of 444 for victory at The Oval, India was bowled out for 234 following a frantic collapse of 7-55 on Sunday afternoon, losing their second consecutive WTC Final. Scott Boland ripped through India’s top order before Nathan Lyon cleaned up the tail to help Australia win its maiden title, redeeming themselves after missing the previous final due to a slow over-rate. It’s just reward for an Australian team that has dominated the Test arena over the last 18 months, remaining unbeaten at home across ten matches and clinching a historic 1-0 series victory in Pakistan. Stream Over 50 Sports Live & On-Demand with Kayo. New to Kayo? Start your free trial now > “It’s been amazing two years,” Australian captain Pat Cummins told reporters in the post-match press conference. “We’ve had this final in the diary for a while, it’s something that we’ve been building up for. “It’s something we’re going to savour. “I know we’ve got a big series (next), but we can worry about that in a couple of days. You only get a few of these moments in your career when you can sit back and acknowledge your achievements, and this is one of those times.” Meanwhile, India will be ruing Rohit Sharma’s decision to bowl first at the toss, the omission of world No. 1 Test bowler Ravichandran Ashwin and some questionable shot selection in the fourth innings. “I thought we started well in putting them into bat, we bowled well in the first session then let ourselves down a little bit,” Sharma said in the post-match press conference. “We have made two finals, you cannot take away what we have done in those years. “It’s unfortunate we couldn’t win the finals, but we will keep our heads high and fight for the next title.” MATCH CENTRE: Australia vs India, WTC day five scoreboard Nathan Lyon of Australia takes the final wicket. Photo by Ryan Pierse/Getty Images Source: Getty Images India resumed Sunday morning at 3-164 before Boland knocked over the dangerous Virat Kohli and Ravindra Jadeja in quick succession, shattering India’s hopes of chasing down the monster target. Kohli, who looked impenetrable the previous evening, was lured into fishing outside off stump, edging towards second slip where Steve Smith held onto a superb diving catch to his right. It was Boland’s first wide delivery of the morning, and Kohli took the bait, departing for 49. The Oval’s pro-Indian crowd fell silent as Kohli, the key to India’s unlikely comeback, trudged off the field. Boland broke through again two balls later, nipping a length delivery away from the left-handed Jadeja that was feathered through to wicketkeeper Alex Carey. The final delivery of Boland’s golden over struck Indian wicketkeeper Srikar Bharat on the gloves, narrowly evading a leaping David Warner at first slip for a streaky boundary. It was nothing magical from Boland — just consistent, probing bowling that should worry England’s batters ahead of the Ashes. “He just keeps finding another level, he’s unbelievable,” Cummins said. “He was our best bowler all game. Held it together, didn’t go for many runs, always looks threatening. “I’m sure he’ll play a huge role in the Ashes.” Scott Boland of Australia. Photo by Ryan Pierse/Getty Images Source: Getty Images The following over, Bharat underwent a concussion assessment after ducking into a Cummins bouncer that thudded into his helmet. Australia also burnt two reviews within the first 45 minutes — one was for a non-existent outside edge that only Marnus Labuschagne heard, the other being an LBW shout that slid comfortably down leg. Ajinkya Rahane looked on track to replicate his first-innings heroics before recklessly driving at a wide delivery from Mitchell Starc, nicking behind for 46 to expose India’s tail. Lyon joined the party the following over, trapping Shardul Thakur on the pads plumb LBW from around the wicket — the Indian all-rounder wasted a review before departing for a duck. A rip-snorting bouncer from Starc and an impressive one-handed grab from Carey saw the end of Umesh Yadav, who gloved the well-directed short ball down the leg side, gone for 1. Lyon then cleaned up the tail, removing Bharat and Mohammed Siraj in quick succession to seal Australia’s triumph. Head was named player of the match for his counterattacking 163 in the first innings. Australia has a short turnaround before their next challenge, the Ashes, which gets underway in Birmingham on Friday.","pubDate":"2023-06-11 19:20:00","image_url":null,"source_id":"foxsports","category":["sports"],"country":["australia"],"language":"english"},{"title":"Sir Alastair Cook strikes 74th first-class century as Essex dominate Somerset","link":"https://www.independent.co.uk/sport/cricket/alastair-cook-essex-somerset-england-lancashire-b2355570.html","keywords":["Cricket","Sport"],"creator":["Pa Sport Staff"],"video_url":null,"description":"Former England captain Cook converted to three figures in 210 balls before reaching 128.","content":"Sir Alastair Cook struck his 74th first-class century as Essex took advantage of perfect batting conditions in their LV= Insurance County Championship clash with Somerset . Former England captain Cook converted to three figures in 210 balls before reaching 128 as Essex racked up 360 for four on the opening day with Matt Critchley adding a sublime 119. A stand of 115 between makeshift opening partnership Phil Salt and George Balderson saw Lancashire take charge against Hampshire at Southport. Having dismissed the visitors for just 142, helped by three wickets apiece for Tom Bailey and Will Williams, Salt and Balderson made light work of Hampshire’s much-vaunted bowling attack as they powered their way to 139 for one at the close, trailing by three runs. A stellar century by Jordan Cox rescued Kent as they faced champions Surrey at Canterbury. The hosts recovered from 41 for five to 301 all out after losing five top-order wickets for seven runs in the space of 31 balls. Cox led the fightback with 133, exactly 100 of which came after he was dropped by Ben Foakes. Surrey’s Sean Abbott took four for 52, but the visitors were 18 for two at stumps, trailing by 283 after Agar claimed two late wickets. Sam Hain’s third century of the season helped Warwickshire get off to a strong start against Nottinghamshire at Trent Bridge. The visitors ended day one on 361 for five after Hain shared a fourth-wicket partnership of 171 with Dan Mousley (87), opener Alex Davies having earlier scored 93. In Division Two, Matthew Fisher delivered a timely demonstration of his international potential on a day of Yorkshire domination against Derbyshire at Chesterfield. Fisher – who played a Test Match in the Caribbean 15 months ago and could come into Ashes reckoning if England’s fast bowlers sustain injuries – returned career-best figures of five for 30 to skittle Derbyshire for 111. Yorkshire skipper Shan Masood heaped further misery on his former county with 67 – his highest score of the season – and Dawid Malan made an unbeaten 76 before rain ended play early with the visitors 272 for five, 161 ahead. Only 36 overs were possible between Gloucestershire and Leicestershire at Bristol because of heavily overcast skies and rain. By the close of a frustrating day, Gloucestershire had posted 108 for three, Ollie Price unbeaten on 26. Kiran Carlson scored a brilliant century to allow Glamorgan to post 390 with the bat against Durham at Seat Unique Riverside. Carlson was dropped on 67 and 107, and he duly made the hosts pay with his knock of 162 supported by 60 from Sam Northeast and a quickfire 45 from Billy Root. Tailenders Jack Carson and Henry Shipley helped Sussex mount a respectable score after an early stumble against Worcestershire. Sussex recovered from 142 for six to reach 338 for nine at stumps thanks to some late-order hitting from Nathan McAndrew, Carson and debutant Shipley, the latter two putting on 85 for the ninth wicket. Worcestershire’s Joe Leach finished the day with figures of six for 73.","pubDate":"2023-06-11 18:59:45","image_url":"https://static.independent.co.uk/2023/06/11/20/b2707ea12c136bd9284e4ec1d49a340bY29udGVudHNlYXJjaGFwaSwxNjg2NTk1OTc3-2.59475170.jpg?width=1200&auto=webp","source_id":"independentuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Australian openers flop as Scott Boland creates fresh Ashes headache: WTC Final Player Ratings","link":"https://www.foxsports.com.au/cricket/australian-openers-flop-as-scott-boland-creates-fresh-ashes-headache-wtc-final-player-ratings/news-story/b2c0438d94f00c87d59d880a3553490c","keywords":null,"creator":null,"video_url":null,"description":"Australia has secured its maiden World Test Championship title after thumping India by 209 runs at The Oval, capping a dominant 18 months in the Test arena.","content":"Australia has secured its maiden World Test Championship title after thumping India by 209 runs at The Oval , capping a dominant 18 months in the Test arena. India lost 7-55 in a dramatic collapse on Sunday morning, with Scott Boland and Nathan Lyon ripping through the team’s middle-order in the second innings. The Australians were far from their best in the WTC Final, but the contest was ideal preparation ahead of their five-Test Ashes campaign against England. Get all the latest cricket news, highlights and analysis delivered straight to your inbox with Fox Sports Sportmail. Sign up now! 'First Kohli, now Jadeja!' Aussies erupt | 00:43 DAVID WARNER — 5 43 and 1 Despite ongoing speculation about his future in the Test arena, David Warner has done enough to secure his spot for the first Ashes Test at Edgbaston. After surviving a probing opening spell on the morning of day one, when conditions were hardest for batting, the veteran opener looked in fine touch before gloving a pull shot down the leg side. But Warner’s questionable footwork in the second innings was a glaring concern ahead of his fourth and final Ashes campaign in the United Kingdom. The 36-year-old also put down a chance at first slip early on day three, albeit potentially disturbed by wicketkeeper Alex Carey. Warner takes Umesh to the cleaners | 00:40 USMAN KHAWAJA — 3 0 and 13 England’s quicks will be licking their lips after Usman Khawaja nicked behind in both innings of the World Test Championship final against India. Whether on the attack or in defence, the swinging Dukes ball remains Khawaja’s kryptonite, with his Test average in England slipping to 17.78. The Queenslander looked more in control during the second innings before a rush of blood to head, recklessly swatting at a wide delivery from Umesh Yadav on Friday afternoon. He also dropped a tough catch in the slips cordon during the opening over of day three, handing Shardul Thakar an early reprieve on zero. India strike as Uzzie departs for a duck | 00:33 MARNUS LABUSCHAGNE — 6 26 and 41 The world’s No. 1 Test batter has continued his frustrating trend of making starts without going on with them. Marnus Labuschagne threw his wicket away in the first innings with an extravagant drive against Mohammed Shami, bowled after the lunch break to leave Australia in a spot of bother at 3-76. The Queenslander batted valiantly on day three, copping a barrage of body blows as the spicy pitch started playing tricks in the evening session. But Labuschagne failed to convert into a half-century on Saturday morning, falling victim to Umesh Yadav caught at first slip. Marnus abruptly woken up by wicket! | 00:34 STEVE SMITH — 9 121 and 34 The Australian vice-captain’s love affair with The Oval continued this week, peeling off his third Test century at the Kennington venue in the World Test Championship final. After a patient start on day one, Steve Smith accelerated in the evening session and brought up his 31st Test ton on Thursday morning with back-to-back boundaries off Mohammed Siraj. Having revived the back-and-across trigger movement that worked wonders against England in 2019, Smith looks destined to replicate his batting heroics from four years ago in the upcoming Ashes. The 34-year-old’s uncharacteristic dismissal in the second innings, a village slog off Indian spinner Ravindra Jadeja, was hopefully a blip in an otherwise prolific winter campaign. Smith hits 31st ton as Aussies dominate | 02:43 TRAVIS HEAD — 9 163 and 18 The decision to drop Travis Head for the Border-Gavaskar Trophy series opener becomes more dumbfounding with every match. The South Australian brought up his first Test century outside Australia in the World Test Championship final this week, rescuing the Aussies with a counterattacking masterclass on day one at The Oval — the same venue where he was dropped four years earlier. He just keeps making the national selectors look foolish. Despite some vulnerability against the short ball and a cheap dismissal in the second innings, Head looms as a crucial figure for Australia ahead of the Ashes. Head bludgeons maiden ton against India | 02:40 CAMERON GREEN — 6 6 and 25, 2-44 and 0-13 We saw the best and worst of Cameron Green this week. After smacking his first Test delivery in England through gully for a classy boundary, the young West Australian was dismissed cheaply a few minutes later with a reckless swipe outside off. When Cheteshwar Pujara muscled a loose Green delivery through point for four on Thursday, the 24-year-old responded with a peach that nipped back and crashed into the Indian No. 3’s off stump. And after dropping a regulation catch at gully to gift Shardul Thakar an extra life early on day three, he redeemed himself with a pair of one-handed screamers. Meanwhile, Green’s second-innings dismissal was baffling, to say the least. The only thing he’s lacking is consistency — with bat, ball and in the field. Green takes absolute screamer on Day 3 | 00:32 ALEX CAREY — 8 48 and 66*, six catches Alex Carey has never mustered more runs in a Test match, top-scoring for Australia in the second innings of the World Test Championship final to help set an imposing fourth-innings chase for India. The South Australian shot himself in the foot on day two with an unwarranted reverse sweep, but otherwise batted impeccably throughout the match. Carey’s glovework was tidy, as always, but he was once again reluctant to dive in front of first slip when Ajinkya Rahane edged behind early on day three, a recurring problem for the 31-year-old. However, he redeemed himself with a spectacular one-handed grab above his head to remove Umesh Yadav during India’s collapse on day five. Deja vu - sweep burns Carey again! | 00:57 MITCHELL STARC — 5 2-71 and 2-77 Mitchell Starc’s spot for the Edgbaston Ashes Test is in jeopardy after an underwhelming bowling performance in the World Test Championship final against India. The left-armer was taken out of the attack after just two over in the first innings, struggling to find his length and failing to swing the fresh Dukes ball. He leaked almost six runs per over in the second innings, when he didn’t open the bowling, conceding boundaries regularly throughout Saturday’s evening session. However, Starc’s dismissals of Virat Kohli and Ajinkya Rahane showed why he’s such a valuable member of this Test side — he has a knack of taking wickets when the team desperately needs one. Kohli has no answer for Starc snorter | 00:37 PAT CUMMINS — 6 3-83 and 1-55 The Australian captain will be the first to admit he showed signs of rust in the World Test Championship final after his three-month break. Pat Cummins was plagued by front-foot no-balls throughout the match, registering ten of them across both innings, two of which proved costly — Ajinkya Rahane and Shardul Thakar were each gifted extra lives at the crease after the New South Welshman overstepped. Regardless, Cummins showed glimpses of his destructive potential against the Indians this week, and he’s hopefully cleared out the cobwebs ahead of the Ashes. Tiny overstep costs Cummins dearly | 00:46 NATHAN LYON — 8 1-19 and 4-41 He hardly bowled in the first innings, but Nathan Lyon still found a way to leave his mark on the World Test Championship final against India. Thrown the ball late on day two, the veteran off-spinner snared the crucial wicket of Ravindra Jadeja in his second over with a gorgeous delivery that kissed the left-hander’s outside edge. Lyon’s dismissal of rival captain Rohit Sharma changed the game’s momentum on Saturday evening before he returned the following morning to clean up India’s tail. He’s one step closer to the magical 500-wicket milestone. Boland bowling pearls through India | 00:27 SCOTT BOLAND — 9 2-59 and 3-46 It’s almost as though Scott Boland was created to bowl in English conditions. The Victorian, playing his first professional match in the United Kingdom, immediately looked at home with the Dukes ball this week, starting with a pair of maidens and the glorious dismissal of Shubman Gill. Boland, relentlessly accurate with the ball, was comfortably Australia’s most economical bowler in the first innings, leaking less than three runs per over in a high-scoring contest. Promoted to open the bowling in the second innings, he claimed the early scalp of Subman Gill before outsmarting Virat Kohli on Sunday morning, sealing India’s fate. Boland has given the national selectors a major headache ahead of the Ashes.","pubDate":"2023-06-11 18:40:00","image_url":null,"source_id":"foxsports","category":["sports"],"country":["australia"],"language":"english"},{"title":"Why we need this Ashes to keep Test cricket alive: England v Australia matters more than ever…","link":"https://www.dailymail.co.uk/sport/cricket/article-12183829/Why-need-Ashes-Test-cricket-alive-England-v-Australia-matters-ever.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"LAWRENCE BOOTH: It was at Rawalpindi in December, as England basked in an astonishing victory in the first Test against Pakistan, that Ben Stokes laid out his hopes and dreams.","content":"LAWRENCE BOOTH: England's clash with Australia matters more than ever as nations ditch five-day games and players cash in with opportunistic franchises... why we NEED this Ashes to keep Test cricket alive This year’s Ashes series is the most hotly anticipated series in recent memory Both teams are in great form and talking a big game ahead of the showdown Australia dominated the last series on their home turf, winning 4-0 By Lawrence Booth for MailOnline Published: 22:32, 11 June 2023 | Updated: 23:34, 11 June 2023 e-mail 1 View comments It was at Rawalpindi in December, as England basked in an astonishing victory in the first Test against Pakistan , that Ben Stokes laid out his hopes and dreams. His team had just won with minutes to spare, having scored 506 for four from 75 overs on the first day, then challenged Pakistan to make 343 in four sessions — a gettable target on a merciless pitch. It was a victory for the ages, a subversion of what seemed possible. ‘That’s how Test cricket should be played, always looking at the entertainment side of the sport, because Test cricket is something that needs to be looked after,’ said Stokes. ‘We don’t want Test cricket to fall off the face of the planet. It needs to stay around and we’ll do everything we possibly can as a team to keep it alive.’ Six months on, as England prepare for the most talked-about Ashes since 2005, his message feels even more urgent. T20 franchise cricket is taking over the game, one tournament at a time, and teams outside the so-called Big Three — India , England and Australia — have pared their Test commitments to the bone. For international cricket, the doomsday scenario is well underway: players are signing contracts with opportunistic conglomerates rather than the home boards who have nurtured them. The upcoming Ashes series represents a huge moment for Test cricket as a whole World Test champions Australia will be a massive challenge for England to overcome Nations are ditching five-day cricket with T20 franchise cricket appearing to take over England white-ball opener Jason Roy’s decision to plump for LA Knight Riders in America’s new Major League Cricket over an incremental contract with the ECB is just the iceberg’s tip. On the eve of the World Test Championship final at the Oval, the second question to Australia captain Pat Cummins was about the future of a format that has been around since 1876, and provided the game with the bulk of its most fabled moments. ‘Every Test player I have come up against still talks about their love of the game,’ he said, before half-addressing the elephant in the room. ‘But obviously times are changing.’ Not half, Pat. Not half. The impending demise of Test cricket has long been a favourite theme for the sport’s opinion formers, but the concerns are no longer in the realm of the theoretical. Private funds and made-up teams now exert a more powerful pull on players and administrators than the bilateral arrangements of old. Money talks. Correction: it screams. Some regard this development with fear and loathing. Others enthuse about the reach of the free market and the rewards for players with a short shelf-life. Everyone agrees a turning point has become a tipping point. It is against this backdrop that the Ashes begins this week. England v Australia has always been at the heart of Test cricket’s narrative. Starting with the teams’ first meeting, at Melbourne in March 1877, they have played each other 356 times — one in seven of all Tests. The next-most common fixture is England v West Indies, miles behind on 163. Australia hold the edge, with 150 victories to England’s 110, and the Australian philosopher David Stove thought he knew why: ‘Whereas the Australians hate the Poms, the Poms only despise the Australians.’ Jason Roy has forfeited an England contract to play in the new US T20 cricket league He was on to a deeper truth: this is a contest that transcends numbers, a clash of two cultures divided by a common sport. As Vic Marks, the former Somerset and England off-spinner, once put it: ‘When appealing, the Australians make a statement. We ask a question.’ Shane Warne, the genius leg-spinner whose death last year at the age of 52 still hangs over the game, would have enjoyed that almost as much as he would have enjoyed Bazball. This summer’s contest, between a rejuvenated England side and an Australia team desperate to win their first series in this country for 22 years, may yet go down as a classic. But the burden the Ashes now carries is becoming unsustainable. And next summer, when the Test tourists will be West Indies and Sri Lanka — no one’s idea of a drawcard — the debate about the format’s future will be more angst-ridden still. As other teams play less and less Test cricket, the Ashes — as well as games involving India — will become both more important and less exceptional. We will crave them, and — who knows — perhaps grow bored of them. Between this summer and the 2026-27 winter, 20 of England’s 43 Tests will be against Australia or India, a ridiculous imbalance. The number of series of more than two matches played by other teams will be negligible: New Zealand four, Pakistan three, South Africa two, West Indies one, Sri Lanka none. There is already talk of some teams horse-trading away a Test here and there to fit in more white-ball cricket. For many countries, hosting a Test series means losing money — unless the visitors are India, who bring lucrative broadcasting opportunities, or England, who bring a small army of fans. So, yes, when the Ashes begins on Friday, the global game could do with a reminder that no format does unforgettable drama quite like Test cricket. The Ashes could populate cricket’s half of fame by itself. From Australia’s urn-spawning defence of 85 at the Oval in 1882, to Gilbert Jessop’s 76-ball hundred in 1902, Douglas Jardine’s Bodyline tactics of 1932-33, Don Bradman’s 1948 Invincibles, Ian Botham’s heroics in 1981, the epic clash of 2005 and Ben Stokes at Headingley four summers ago — the menu is rich and deep. White-ball cricket cannot compete. You suspect we will need more such heroism in the weeks ahead if Test cricket is to keep its chair at the top table. In that sense, England believe they are taking the lead. ‘No doubt we have beaten teams in the last year who must have sat in their changing rooms and said, “Why don’t we play like that?”’ said Stuart Broad. ‘The landscape is changing rapidly, but what we might see is players coming into Test cricket off the IPL, and playing that style in Test cricket — if this style becomes more accepted.’ That’s the glass-half-full perspective. But it may yet rub up against reality. Ex-England captain Mike Brearley laments the absence of a ‘proper standing up’ to the process of ‘ownership of players from outside the game’. For him, Bazball may at least give Test cricket ‘an extra boost in the arm’. Meanwhile, an unnamed agent recently told Wisden Cricket Monthly: ‘I’ve been in negotiations with franchises where it has been made clear that their sole interest is the strengthening of the franchise world, and the monopolisation of their teams and leagues around the world. An increase in commitment from players to the franchise world is going to be expected of them.’ England head coach Brendon McCullum has his eyes wide open, suggesting national boards would be ‘naive if they think cricketers would turn down the T20 leagues’. At the same time, he understands the bigger picture: ‘The Ashes is the biggest stage. We have to entertain and captivate kids.’ Those two views sum up where cricket finds itself as we prepare for the latest iteration of a storied series. The Ashes is no longer the only show in town. But, for the sake of Test cricket, it has to be the best. Share or comment on this article: Why we need this Ashes to keep Test cricket alive: England v Australia matters more than ever… e-mail Add comment Comments 1 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-06-11 22:34:46","image_url":"https://i.dailymail.co.uk/1s/2023/06/11/22/72017041-0-image-a-4_1686519142023.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"’Just ridiculous’: Pundits slam Indian batting after WTC loss","link":"https://www.dailymirror.lk/cricket/’Just-ridiculous’:-Pundits-slam-Indian-batting-after-WTC-loss/315-260886","keywords":null,"creator":null,"video_url":null,"description":"Former cricketers including Sunil Gavaskar slammed India’s batting after a disappointing show in their loss to Australia in Sunday’s World Test Championship final.","content":"Former cricketers including Sunil Gavaskar slammed India's batting after a disappointing show in their loss to Australia in Sunday's World Test Championship final. Chasing 444 for victory, India resumed day five on 164-3 with star batter Virat Kohli at the crease, but crashed to 234 all out in the first session at the Oval. \"The batting was in shambles today. It was just ridiculous what we saw,\" Gavaskar told Star Sports after India's 209-run loss. \"India have not lasted a session with that batting line-up. I mean, come on!\" It was India's second successive defeat in the final of Test cricket's ultimate prize, extending a world-title drought since they won the 2013 Champions Trophy in the one-day format. Australia fast bowler Scott Boland triggered the collapse with a double strike in the space of three deliveries including Kohli, caught for 49. Rohit Sharma's side fell behind by 173 runs in the first innings, bowled out for 296 in response to Australia's 469. Ajinkya Rahane stood out for India with scores of 89 and 46 in the first and second innings of a Test which belonged to Australia's Travis Head for his first-innings 163. Former India batsman Sanjay Manjrekar tweeted: \"One technical observation I have of most Indian batters, is the keenness to get onto the front foot, to even short of length balls. These are balls Steve Smith, Kane Williamson & Joe Root play back to.\" Speaking on TV to India coach Rahul Dravid, former India captain Sourav Ganguly noted some ordinary batting averages posted by India's top six. Dravid admitted his side had not met their usual high standards. \"They (the batsmen) will agree this was not up to their standards,\" the coach said. \"But these are the same batters who have won two Test series in Australia, and have won Test matches in England.\" \"We are working on it,\" he added. \"Some of the wickets in this Test championship cycle have been quite challenging, but this was a good wicket. So the averages have fallen, but we admit that if we back our bowlers with runs they will win Tests for us.\" (AFP)","pubDate":"2023-06-11 21:40:27","image_url":"https://bmkltsly13vb.compat.objectstorage.ap-singapore-1.oraclecloud.com/cdn.sg.dailymirror.lk/assets/uploads/image_f85a7b7259.jpg","source_id":"dailymirror","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"SLC plays down cricketers’ check-in delay in Zimbabwe","link":"https://www.dailymirror.lk/breaking_news/SLC-plays-down-cricketers’-check-in-delay-in-Zimbabwe/108-260880","keywords":null,"creator":null,"video_url":null,"description":"Sri Lanka Cricket (SLC) clarified the delay faced by the national cricket team that travelled to Zimbabwe for the World Cup qualifiers, after several cricketers shared images on social media of them waiting to be checked-in into the hotel in Bulawayo.","content":"Sri Lanka Cricket (SLC) clarified the delay faced by the national cricket team that travelled to Zimbabwe for the World Cup qualifiers, after several cricketers shared images on social media of them waiting to be checked-in into the hotel in Bulawayo. Images shared on the verified accounts of Sadeera Samarawickrama and Maheesh Theekshana shows several players seated on the ground as they waited to be checked in. The images, shared via Instagram Stories, have since been deleted. \"The Sri Lankan team has arrived at the hotel today at noon, and at the time of the entry, another national cricket team, who arrived just before the Sri Lankan team, was in the process of \"checking in.’,\" a media statement released by SLC read. \"This situation resulted in a delay in some of the Sri Lankan National Team players being \"checked in.’\" \"However, SLC, after reporting this matter to the hotel management, was able to rectify the issue within a short period of time,\" SLC also said in its statement.","pubDate":"2023-06-11 21:08:00","image_url":"https://bmkltsly13vb.compat.objectstorage.ap-singapore-1.oraclecloud.com/cdn.sg.dailymirror.lk/assets/uploads/image_eb55e85617.jpg","source_id":"dailymirror","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Nipun Dhananjaya to captain Sri Lanka ‘A’ in four-day matches against South Africa ‘A’","link":"https://www.dailymirror.lk/cricket/Nipun-Dhananjaya-to-captain-Sri-Lanka-‘A’-in-four-day-matches-against-South-Africa-‘A’/315-260879","keywords":null,"creator":null,"video_url":null,"description":"Left-handed batsman Nipun Dhananjaya will captain the Sri Lanka ’A’ team for the two four-day games against South Africa ’A’ that start in Pallekele tomorrow.","content":"Left-handed batsman Nipun Dhananjaya will captain the Sri Lanka 'A' team for the two four-day games against South Africa 'A' that start in Pallekele tomorrow. Test spinners Ramesh Mendis, Lasith Embuldeniya and Praveen Jaywickrama have also been included in the squad, with Kamindu Mendis serving as Dhananjaya's deputy. Lahiru Samarakoon, who was the Player of the Tournament at the Major Club T20 tournament that ended today, has been drated in in place of injured left-arm fast bowler Vishwa Fernando. Squad: Nishan Madushka, Lasith Croospulle, Kamindu Mendis – Vice Captain, Pasindu Sooriyabandara, Nipun Dhananjaya - Captain, Lahiru Udara (WK), Janith Liyanage, Lasith Embuldeniya (to be replaced by Shashika Dulshan for second match), Lakshitha Rasanjana, Dilshan Madushanka, Milan Rathnayake, Praveen Jayawickrama, Lahiru Samarakoon, Ramesh Mendis, Minod Bhanuka (WK), Nuwanidu Fernando","pubDate":"2023-06-11 20:33:00","image_url":"https://bmkltsly13vb.compat.objectstorage.ap-singapore-1.oraclecloud.com/cdn.sg.dailymirror.lk/assets/uploads/image_d311a48c41.jpg","source_id":"dailymirror","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"India lose yet again as Australia win WTC title","link":"https://kashmirreader.com/2023/06/12/india-lose-yet-again-as-australia-win-wtc-title/","keywords":["SPORTS"],"creator":["Press Trust of India"],"video_url":null,"description":"The Oval: India, for all its financial clout and hoo-ha around its cricket, lost yet again when it mattered the most, as its underwhelming record in ICC tournaments continued with a 209-run hammering by Australia in the WTC final here on Sunday. Australian pacer Scott Boland produced a bowling spell of rare quality to get […]","content":"The Oval: India, for all its financial clout and hoo-ha around its cricket, lost yet again when it mattered the most, as its underwhelming record in ICC tournaments continued with a 209-run hammering by Australia in the WTC final here on Sunday. Australian pacer Scott Boland produced a bowling spell of rare quality to get rid of Virat Kohli and Ravindra Jadeja in the same over, effectively shutting the door on India, who were bowled out for 234 in their second innings on the final day at The Oval. Australia were clearly the better team on all fronts while India had only themselves to blame for yet another loss in a global event. India’s last ICC title came way back in 2013 and it was their second successive defeat in the WTC final, having gone down against New Zealand two years ago. India lost seven wickets for the addition of 70 runs on the final day. While the non selection of R Aswhin was the big talking point on the opening day, India lost the title contest mainly due to the failure of their high-profile batting line-up. The top four comprising Rohit Sharma, Shubman Gill, Cheteshwar Pujara and Kohli failed to deliver in the high-stake game. Chasing a record 444 at The Oval, Indian fans went into day five high on hope with Kohli (49) and Ajinkya Rahane (46) walking into the middle. However, Boland removing Kohli and Jadeja (0) in the seventh over of the morning pretty much shut the door on India, who resumed the day at 164 for three needing another 280 runs for an improbable win. Kohli, who had looked in extremely good touch on day four, had to make a big hundred if India had to get anywhere close to the massive target. On a surface with variable bounce, there was always going to be an odd ball that had your name on it, and that is what happened with both Kohli and Jadeja. Boland’s relentless pursuit around the off-stump has added an extra dimension to the Australian attack. Bowling from the pavilion end, the seamer pitched one wide and Kohli went for the drive only to be caught by a flying Steve Smith at second slip. Two balls later, he got one to seam away from round the wicket and Jadeja ended up offering an easy catch to the wicketkeeper, leaving India at 179 for five. K S Bharat then joined Rahane who played a couple of beautiful straight drives off Mitchell Starc to keep crowd going. Starc drew his length back soon after and Rahane went hard at a ball that he could have left to be caught behind, sealing his team’s fate. The experienced batter was left tapping his head in frustration knowing he went for the wrong shot. Shardul Thakur lasted just five balls, lbw off Nathan Lyon, to make it 213 for seven. It seemed the match would last till lunch but the Indian tail made the task easier for the Australians and were bowled out in the extra half hour of play. PTI India lose yet again as Australia win WTC title added by Press Trust of India on 1:09 am June 12, 2023 View all posts by Press Trust of India → Press Trust of India Facebook Twitter WhatsApp Email Print Related","pubDate":"2023-06-11 19:39:36","image_url":null,"source_id":"kashmirreader","category":["sports"],"country":["india"],"language":"english"},{"title":"Ravi Shastri places onus on players, BCCI","link":"https://kashmirreader.com/2023/06/12/ravi-shastri-places-onus-on-players-bcci/","keywords":["SPORTS"],"creator":["Press Trust of India"],"video_url":null,"description":"London: Former India coach Ravi Shastri on Sunday sounded sceptical about the possibility of players getting extended gap after the IPL or practice games ahead of future WTC final matches unless there is a change in thought by all the stakeholders. After India suffered a huge 209-run defeat against Australia at the Oval, head coach […]","content":"London: Former India coach Ravi Shastri on Sunday sounded sceptical about the possibility of players getting extended gap after the IPL or practice games ahead of future WTC final matches unless there is a change in thought by all the stakeholders. After India suffered a huge 209-run defeat against Australia at the Oval, head coach Rahul Dravid said arriving in England at least two weeks earlier and playing some side matches would have been ideal for the team ahead of the big game. However, Shastri did not buy into the idea and put the onus on the players to make a choice. “That’s never going to happen. Let’s be realistic. You’re going to get 20 days, but if that’s the case, you got to miss the IPL. The choice is yours (players),” Shastri said on Star Sports. Shastri also hinted that the Board of Control for Cricket in India will have to sit down with the IPL teams to chalk out a way forward. “It’s up to the establishment as well. I’m sure the BCCI is going to review this in the future. If the WTC Final is going to come after the IPL, in month of June, for that season, if your team qualifies for the final, there should be certain clauses put in for the franchises,” said Shastri. Earlier, Shastri had also criticised the shot selection of Indian top-order batters, who let down the team. “What’s amazed me though is the way that the pitch has behaved. Rohit Sharma and Cheteshwar Pujara will be kicking themselves for playing the shots that they played. They were poor shots when they were batting beautifully,” said Shastri. PTI Ravi Shastri places onus on players, BCCI added by Press Trust of India on 1:09 am June 12, 2023 View all posts by Press Trust of India → Press Trust of India Facebook Twitter WhatsApp Email Print Related","pubDate":"2023-06-11 19:39:25","image_url":null,"source_id":"kashmirreader","category":["sports"],"country":["india"],"language":"english"},{"title":"Magam Sports Stadium comes live with T-20 Cricket Tournament","link":"https://kashmirreader.com/2023/06/12/magam-sports-stadium-comes-live-with-t-20-cricket-tournament/","keywords":["SPORTS"],"creator":["KR Desk"],"video_url":null,"description":"Collaboration for sports is the way forward: Secretary Sports Council SRINAGAR: One of the major sports events in district Budgam under the umbrella of the ‘Jhan Bhaghidari’ campaign kept Sports Council’s Magam Stadium on the cusp of some thrilling cricket encounters between teams from many districts of J&K. The local organizers teamed up with J&K […]","content":"Collaboration for sports is the way forward: Secretary Sports Council SRINAGAR: One of the major sports events in district Budgam under the umbrella of the ‘Jhan Bhaghidari’ campaign kept Sports Council’s Magam Stadium on the cusp of some thrilling cricket encounters between teams from many districts of J&K. The local organizers teamed up with J&K Sports Council under the My Youth My Pride vertical of special activities for the Magam T20 Knockout Cricket Tournament which witnessed the participation of seventy-four teams and as many as 1480 players, compared to sixty-four teams in the last edition which was also a massive hit among the cricketing circles. The tournament was played in a league cum knockout format. J&K Sports Time was the media partner for the event which played an important role in streaming live matches on social media platforms throughout the tournament. Winners of the coveted tournament will earn a cash bounty of rupees one lakh while rupees fifty thousand and twenty thousand will go into the kitty of runner-up and team placed third respectively. Every match of the tournament attracted a crowd of thousands to the ground and as per the organizer of the events, the cumulative figure of cricket enthusiasts thronging the ground during the event will easily run into lakhs. The Secretary Sports Council, Nuzhat Gull presided over the final match ceremony as the chief guest while Parveez Rasool international cricketer was the special guest, and Managing Directors from Cricket Academy of Pathans Pune and Jaipur units were guests of honor on the occasion. Speaking on the occasion Nuzhat Gull highlighted the importance of collaboration of sports events for team spirit and camaraderie between people from different backgrounds. She also emphasized the importance of promoting gender equality in sports and supporting women in sports. The chief guest congratulated the organizers for the professional approach and urged all participants to continue pursuing their passion for sports and strive for excellence. The final match of the T-20 tournament was played between Shining Star Pampore Cricket Club and Green Line Cricket Club Srinagar. The match was in progress when a report was being filed. Meanwhile, the National Wushu coaching camp that commenced at Sher-i-Kashmir Indoor Stadium Srinagar earlier this month is in full swing. The camp shall conclude in the first week of August. The two-month-long preparatory camp of the Indian Wushu team for the forthcoming 19th Asian Games to be held in China and the 16th World Wushu championship in the USA shall select the best players after putting them through the battery of selection trials even as players are taught the nuances of the game by a group of elite coaches, including National Wushu Coach and Dhronacharya awardee Kuldeep Handoo as well. Pertinently the Sports Authority of India had sanctioned the National Wushu coaching camp at Srinagar on the recommendation of the Wushu President Mr. Bhupender Singh Bajwa during the ACTC Meeting held in New Delhi earlier this year. The Secretary Sports Council Nuzhal Gull thanked the Wushu Association of India and Sports Authority of India for conducting a national camp in J&K. She said the move comes in the wake of the fact that J&K has set up some world-class sports infrastructure in recent months in almost all districts of the union territory and we are prepared to host not only national events but international events in near future The Wushu Association of India and the Wushu Association of J&K have thanked Lieutenant Governor J&K, Manoj Sinha, Sarmad Hafeez Secretary Youth Services Sports, and Secretary Sports Council Nuzhat Gull for support in organizing the camp in Srinagar. Forty-five campers including seven coaches and two supporting staff are a part of the camp besides players who have a record of bagging medals at international events. The three campers from J&K are also part of the camp including Surya Bhanu Partap Singh (Asian Games Medalist) Abhishek Jamwal (National Games Medalist) and Owais Sarwar (National Games medalist) and the trio are pitched to make it to the national team for both the international events. The Chief Coach, Kuldeep Handoo while speaking to the desk thanked SAI, MYAS, and WAI for choosing UT J&K as the permanent center for wushu training in future official events and expressed his gratitude to the Secretary Sports Council support and assistance for the successful National Wushu coaching camp in J&K In the meantime, Rohil Rashid from the hamlet of Takya Behram Shah, South Kashmir has made sports circles of J&K proud by making it to the national Softball team for Asia Cup to be held at Kochi, Japan later this month. Rohil was selected based on his performance during the final selection trials conducted by the Softball Association of India. Rohil has been a regular in various national camps conducted by SBAI in various parts of the country earlier. Indian National Softball team will leave for participation in the championship in Japan later this month under the banner of the Softball Association of India. Magam Sports Stadium comes live with T-20 Cricket Tournament added by KR Desk on 1:08 am June 12, 2023 View all posts by KR Desk → KR Desk Facebook Twitter WhatsApp Email Print Related","pubDate":"2023-06-11 19:38:55","image_url":null,"source_id":"kashmirreader","category":["sports"],"country":["india"],"language":"english"},{"title":"Australia crowned world champions after emphatic victory over India in WTC final","link":"https://www.foxsports.com.au/cricket/australia/world-test-championship-final-2023-australia-vs-india-live-cricket-scores-day-5-updates-result-the-oval-video-latest-news/news-story/7c276d885eb50e45d618da3f45e6d061","keywords":null,"creator":null,"video_url":null,"description":"Australia has won Test cricket’s ultimate prize, comprehensively defeating India by 209 runs in the World Test Championship final to secure its legacy as one of cricket’s great modern teams.","content":"Australia has won Test cricket’s ultimate prize, comprehensively defeating India by 209 runs in the World Test Championship final to secure its legacy as one of cricket’s great modern teams. After being set a record target of 444 for victory at The Oval, India was bowled out for 234 following a frantic collapse of 7-55 on Sunday afternoon, losing their second consecutive WTC Final. Scott Boland ripped through India’s top order before Nathan Lyon cleaned up the tail to help Australia win its maiden title, redeeming themselves after missing the previous final due to a slow over-rate. It’s just reward for an Australian team that has dominated the Test arena over the last 18 months, remaining unbeaten at home across ten matches and clinching a historic 1-0 series victory in Pakistan. Stream Over 50 Sports Live & On-Demand with Kayo. New to Kayo? Start your free trial now > “It’s been amazing two years,” Australian captain Pat Cummins told reporters in the post-match press conference. “We’ve had this final in the diary for a while, it’s something that we’ve been building up for. “It’s something we’re going to savour. “I know we’ve got a big series (next), but we can worry about that in a couple of days. You only get a few of these moments in your career when you can sit back and acknowledge your achievements, and this is one of those times.” Meanwhile, India will be ruing Rohit Sharma’s decision to bowl first at the toss, the omission of world No. 1 Test bowler Ravichandran Ashwin and some questionable shot selection in the fourth innings. “I thought we started well in putting them into bat, we bowled well in the first session then let ourselves down a little bit,” Sharma said in the post-match press conference. “We have made two finals, you cannot take away what we have done in those years. “It’s unfortunate we couldn’t win the finals, but we will keep our heads high and fight for the next title.” MATCH CENTRE: Australia vs India, WTC day five scoreboard Nathan Lyon of Australia takes the final wicket. Photo by Ryan Pierse/Getty Images Source: Getty Images India resumed Sunday morning at 3-164 before Boland knocked over the dangerous Virat Kohli and Ravindra Jadeja in quick succession, shattering India’s hopes of chasing down the monster target. Kohli, who looked impenetrable the previous evening, was lured into fishing outside off stump, edging towards second slip where Steve Smith held onto a superb diving catch to his right. It was Boland’s first wide delivery of the morning, and Kohli took the bait, departing for 49. The Oval’s pro-Indian crowd fell silent as Kohli, the key to India’s unlikely comeback, trudged off the field. Boland broke through again two balls later, nipping a length delivery away from the left-handed Jadeja that was feathered through to wicketkeeper Alex Carey. The final delivery of Boland’s golden over struck Indian wicketkeeper Srikar Bharat on the gloves, narrowly evading a leaping David Warner at first slip for a streaky boundary. It was nothing magical from Boland — just consistent, probing bowling that should worry England’s batters ahead of the Ashes. “He just keeps finding another level, he’s unbelievable,” Cummins said. “He was our best bowler all game. Held it together, didn’t go for many runs, always looks threatening. “I’m sure he’ll play a huge role in the Ashes.” Scott Boland of Australia. Photo by Ryan Pierse/Getty Images Source: Getty Images The following over, Bharat underwent a concussion assessment after ducking into a Cummins bouncer that thudded into his helmet. Australia also burnt two reviews within the first 45 minutes — one was for a non-existent outside edge that only Marnus Labuschagne heard, the other being an LBW shout that slid comfortably down leg. Ajinkya Rahane looked on track to replicate his first-innings heroics before recklessly driving at a wide delivery from Mitchell Starc, nicking behind for 46 to expose India’s tail. Lyon joined the party the following over, trapping Shardul Thakur on the pads plumb LBW from around the wicket — the Indian all-rounder wasted a review before departing for a duck. A rip-snorting bouncer from Starc and an impressive one-handed grab from Carey saw the end of Umesh Yadav, who gloved the well-directed short ball down the leg side, gone for 1. Lyon then cleaned up the tail, removing Bharat and Mohammed Siraj in quick succession to seal Australia’s triumph. Head was named player of the match for his counterattacking 163 in the first innings. Australia has a short turnaround before their next challenge, the Ashes, which gets underway in Birmingham on Friday.","pubDate":"2023-06-11 19:20:00","image_url":null,"source_id":"foxsports","category":["sports"],"country":["australia"],"language":"english"},{"title":"Sir Alastair Cook strikes 74th first-class century as Essex dominate Somerset","link":"https://www.independent.co.uk/sport/cricket/alastair-cook-essex-somerset-england-lancashire-b2355570.html","keywords":["Cricket","Sport"],"creator":["Pa Sport Staff"],"video_url":null,"description":"Former England captain Cook converted to three figures in 210 balls before reaching 128.","content":"Sir Alastair Cook struck his 74th first-class century as Essex took advantage of perfect batting conditions in their LV= Insurance County Championship clash with Somerset . Former England captain Cook converted to three figures in 210 balls before reaching 128 as Essex racked up 360 for four on the opening day with Matt Critchley adding a sublime 119. A stand of 115 between makeshift opening partnership Phil Salt and George Balderson saw Lancashire take charge against Hampshire at Southport. Having dismissed the visitors for just 142, helped by three wickets apiece for Tom Bailey and Will Williams, Salt and Balderson made light work of Hampshire’s much-vaunted bowling attack as they powered their way to 139 for one at the close, trailing by three runs. A stellar century by Jordan Cox rescued Kent as they faced champions Surrey at Canterbury. The hosts recovered from 41 for five to 301 all out after losing five top-order wickets for seven runs in the space of 31 balls. Cox led the fightback with 133, exactly 100 of which came after he was dropped by Ben Foakes. Surrey’s Sean Abbott took four for 52, but the visitors were 18 for two at stumps, trailing by 283 after Agar claimed two late wickets. Sam Hain’s third century of the season helped Warwickshire get off to a strong start against Nottinghamshire at Trent Bridge. The visitors ended day one on 361 for five after Hain shared a fourth-wicket partnership of 171 with Dan Mousley (87), opener Alex Davies having earlier scored 93. In Division Two, Matthew Fisher delivered a timely demonstration of his international potential on a day of Yorkshire domination against Derbyshire at Chesterfield. Fisher – who played a Test Match in the Caribbean 15 months ago and could come into Ashes reckoning if England’s fast bowlers sustain injuries – returned career-best figures of five for 30 to skittle Derbyshire for 111. Yorkshire skipper Shan Masood heaped further misery on his former county with 67 – his highest score of the season – and Dawid Malan made an unbeaten 76 before rain ended play early with the visitors 272 for five, 161 ahead. Only 36 overs were possible between Gloucestershire and Leicestershire at Bristol because of heavily overcast skies and rain. By the close of a frustrating day, Gloucestershire had posted 108 for three, Ollie Price unbeaten on 26. Kiran Carlson scored a brilliant century to allow Glamorgan to post 390 with the bat against Durham at Seat Unique Riverside. Carlson was dropped on 67 and 107, and he duly made the hosts pay with his knock of 162 supported by 60 from Sam Northeast and a quickfire 45 from Billy Root. Tailenders Jack Carson and Henry Shipley helped Sussex mount a respectable score after an early stumble against Worcestershire. Sussex recovered from 142 for six to reach 338 for nine at stumps thanks to some late-order hitting from Nathan McAndrew, Carson and debutant Shipley, the latter two putting on 85 for the ninth wicket. Worcestershire’s Joe Leach finished the day with figures of six for 73.","pubDate":"2023-06-11 18:59:45","image_url":"https://static.independent.co.uk/2023/06/11/20/b2707ea12c136bd9284e4ec1d49a340bY29udGVudHNlYXJjaGFwaSwxNjg2NTk1OTc3-2.59475170.jpg?width=1200&auto=webp","source_id":"independentuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Australian openers flop as Scott Boland creates fresh Ashes headache: WTC Final Player Ratings","link":"https://www.foxsports.com.au/cricket/australian-openers-flop-as-scott-boland-creates-fresh-ashes-headache-wtc-final-player-ratings/news-story/b2c0438d94f00c87d59d880a3553490c","keywords":null,"creator":null,"video_url":null,"description":"Australia has secured its maiden World Test Championship title after thumping India by 209 runs at The Oval, capping a dominant 18 months in the Test arena.","content":"Australia has secured its maiden World Test Championship title after thumping India by 209 runs at The Oval , capping a dominant 18 months in the Test arena. India lost 7-55 in a dramatic collapse on Sunday morning, with Scott Boland and Nathan Lyon ripping through the team’s middle-order in the second innings. The Australians were far from their best in the WTC Final, but the contest was ideal preparation ahead of their five-Test Ashes campaign against England. Get all the latest cricket news, highlights and analysis delivered straight to your inbox with Fox Sports Sportmail. Sign up now! 'First Kohli, now Jadeja!' Aussies erupt | 00:43 DAVID WARNER — 5 43 and 1 Despite ongoing speculation about his future in the Test arena, David Warner has done enough to secure his spot for the first Ashes Test at Edgbaston. After surviving a probing opening spell on the morning of day one, when conditions were hardest for batting, the veteran opener looked in fine touch before gloving a pull shot down the leg side. But Warner’s questionable footwork in the second innings was a glaring concern ahead of his fourth and final Ashes campaign in the United Kingdom. The 36-year-old also put down a chance at first slip early on day three, albeit potentially disturbed by wicketkeeper Alex Carey. Warner takes Umesh to the cleaners | 00:40 USMAN KHAWAJA — 3 0 and 13 England’s quicks will be licking their lips after Usman Khawaja nicked behind in both innings of the World Test Championship final against India. Whether on the attack or in defence, the swinging Dukes ball remains Khawaja’s kryptonite, with his Test average in England slipping to 17.78. The Queenslander looked more in control during the second innings before a rush of blood to head, recklessly swatting at a wide delivery from Umesh Yadav on Friday afternoon. He also dropped a tough catch in the slips cordon during the opening over of day three, handing Shardul Thakar an early reprieve on zero. India strike as Uzzie departs for a duck | 00:33 MARNUS LABUSCHAGNE — 6 26 and 41 The world’s No. 1 Test batter has continued his frustrating trend of making starts without going on with them. Marnus Labuschagne threw his wicket away in the first innings with an extravagant drive against Mohammed Shami, bowled after the lunch break to leave Australia in a spot of bother at 3-76. The Queenslander batted valiantly on day three, copping a barrage of body blows as the spicy pitch started playing tricks in the evening session. But Labuschagne failed to convert into a half-century on Saturday morning, falling victim to Umesh Yadav caught at first slip. Marnus abruptly woken up by wicket! | 00:34 STEVE SMITH — 9 121 and 34 The Australian vice-captain’s love affair with The Oval continued this week, peeling off his third Test century at the Kennington venue in the World Test Championship final. After a patient start on day one, Steve Smith accelerated in the evening session and brought up his 31st Test ton on Thursday morning with back-to-back boundaries off Mohammed Siraj. Having revived the back-and-across trigger movement that worked wonders against England in 2019, Smith looks destined to replicate his batting heroics from four years ago in the upcoming Ashes. The 34-year-old’s uncharacteristic dismissal in the second innings, a village slog off Indian spinner Ravindra Jadeja, was hopefully a blip in an otherwise prolific winter campaign. Smith hits 31st ton as Aussies dominate | 02:43 TRAVIS HEAD — 9 163 and 18 The decision to drop Travis Head for the Border-Gavaskar Trophy series opener becomes more dumbfounding with every match. The South Australian brought up his first Test century outside Australia in the World Test Championship final this week, rescuing the Aussies with a counterattacking masterclass on day one at The Oval — the same venue where he was dropped four years earlier. He just keeps making the national selectors look foolish. Despite some vulnerability against the short ball and a cheap dismissal in the second innings, Head looms as a crucial figure for Australia ahead of the Ashes. Head bludgeons maiden ton against India | 02:40 CAMERON GREEN — 6 6 and 25, 2-44 and 0-13 We saw the best and worst of Cameron Green this week. After smacking his first Test delivery in England through gully for a classy boundary, the young West Australian was dismissed cheaply a few minutes later with a reckless swipe outside off. When Cheteshwar Pujara muscled a loose Green delivery through point for four on Thursday, the 24-year-old responded with a peach that nipped back and crashed into the Indian No. 3’s off stump. And after dropping a regulation catch at gully to gift Shardul Thakar an extra life early on day three, he redeemed himself with a pair of one-handed screamers. Meanwhile, Green’s second-innings dismissal was baffling, to say the least. The only thing he’s lacking is consistency — with bat, ball and in the field. Green takes absolute screamer on Day 3 | 00:32 ALEX CAREY — 8 48 and 66*, six catches Alex Carey has never mustered more runs in a Test match, top-scoring for Australia in the second innings of the World Test Championship final to help set an imposing fourth-innings chase for India. The South Australian shot himself in the foot on day two with an unwarranted reverse sweep, but otherwise batted impeccably throughout the match. Carey’s glovework was tidy, as always, but he was once again reluctant to dive in front of first slip when Ajinkya Rahane edged behind early on day three, a recurring problem for the 31-year-old. However, he redeemed himself with a spectacular one-handed grab above his head to remove Umesh Yadav during India’s collapse on day five. Deja vu - sweep burns Carey again! | 00:57 MITCHELL STARC — 5 2-71 and 2-77 Mitchell Starc’s spot for the Edgbaston Ashes Test is in jeopardy after an underwhelming bowling performance in the World Test Championship final against India. The left-armer was taken out of the attack after just two over in the first innings, struggling to find his length and failing to swing the fresh Dukes ball. He leaked almost six runs per over in the second innings, when he didn’t open the bowling, conceding boundaries regularly throughout Saturday’s evening session. However, Starc’s dismissals of Virat Kohli and Ajinkya Rahane showed why he’s such a valuable member of this Test side — he has a knack of taking wickets when the team desperately needs one. Kohli has no answer for Starc snorter | 00:37 PAT CUMMINS — 6 3-83 and 1-55 The Australian captain will be the first to admit he showed signs of rust in the World Test Championship final after his three-month break. Pat Cummins was plagued by front-foot no-balls throughout the match, registering ten of them across both innings, two of which proved costly — Ajinkya Rahane and Shardul Thakar were each gifted extra lives at the crease after the New South Welshman overstepped. Regardless, Cummins showed glimpses of his destructive potential against the Indians this week, and he’s hopefully cleared out the cobwebs ahead of the Ashes. Tiny overstep costs Cummins dearly | 00:46 NATHAN LYON — 8 1-19 and 4-41 He hardly bowled in the first innings, but Nathan Lyon still found a way to leave his mark on the World Test Championship final against India. Thrown the ball late on day two, the veteran off-spinner snared the crucial wicket of Ravindra Jadeja in his second over with a gorgeous delivery that kissed the left-hander’s outside edge. Lyon’s dismissal of rival captain Rohit Sharma changed the game’s momentum on Saturday evening before he returned the following morning to clean up India’s tail. He’s one step closer to the magical 500-wicket milestone. Boland bowling pearls through India | 00:27 SCOTT BOLAND — 9 2-59 and 3-46 It’s almost as though Scott Boland was created to bowl in English conditions. The Victorian, playing his first professional match in the United Kingdom, immediately looked at home with the Dukes ball this week, starting with a pair of maidens and the glorious dismissal of Shubman Gill. Boland, relentlessly accurate with the ball, was comfortably Australia’s most economical bowler in the first innings, leaking less than three runs per over in a high-scoring contest. Promoted to open the bowling in the second innings, he claimed the early scalp of Subman Gill before outsmarting Virat Kohli on Sunday morning, sealing India’s fate. Boland has given the national selectors a major headache ahead of the Ashes.","pubDate":"2023-06-11 18:40:00","image_url":null,"source_id":"foxsports","category":["sports"],"country":["australia"],"language":"english"}]}