{"newsArray":[{"title":"Former PCB chairman says increasing India’s share of ICC earnings makes ‘no sense’","link":"https://thefrontierpost.com/former-pcb-chairman-says-increasing-indias-share-of-icc-earnings-makes-no-sense/","keywords":["Sports"],"creator":["The Frontier Post"],"video_url":null,"description":"Monitoring Desk LAHORE: Former chairman of the Pakistan Cricket Board (PCB) Ehsan Mani is concerned about international cricket’s health following revelations that India would receive a significant share from the International Cricket Council’s (ICC) media rights deal for 2024-27, which is worth $3 billion. The Board of Control for Cricket in India (BCCI) is set […]","content":"Monitoring Desk LAHORE: Former chairman of the Pakistan Cricket Board (PCB) Ehsan Mani is concerned about international cricket’s health following revelations that India would receive a significant share from the International Cricket Council’s (ICC) media rights deal for 2024-27, which is worth $3 billion. The Board of Control for Cricket in India (BCCI) is set to receive 38.5% of the net surplus earnings from the ICC which is much higher compared to its 22% share in the current 2015-23 deal, according to ESPNcricinfo. “The (proposed revenue distribution model) will be giving the most money to the country that needs it the least, which makes no sense,” Mani, who was ICC president from 2003-06 and stepped down from the Pakistan Cricket Board in 2021, told Forbes in an exclusive interview. “I think it’s very unfortunate. There’s no strategic thinking about the development of the global game. There’s no vision.” Mani also stated that cricket should grow beyond its traditional base rather than just relying on India. “It only takes one downturn in an economic cycle for the ICC members to be affected. There is far too much reliance on India,” he said. “If the ICC wants a truly global game and diversify its financial reliance, the country to develop is the US I would have put $20-30 million into the US You also need to grow the game in Africa, that’s the future. “I think the global game (Associates) should have been allocated at least 30% (instead of 11%). That’s the only way to globalise the game.” Mani also called for financial parity among the 12 full members of the ICC rather than giving the lion’s share to India. “You have to give countries enough resources to not only develop their players but to pay them a fair amount, especially with the IPL and other T20 leagues targeting players,” he said. “The Indian market brings in a lot of money…it’s not the BCCI (India’s governing body). There are benefits to the Indian companies to advertise in the ICC events and worldwide. India are not playing on their own, they are playing against other members. It’s a two-way street.”","pubDate":"2023-05-12 17:13:29","image_url":null,"source_id":"thefrontierpost","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"IPL 2023: राशिद खान की खतरनाक बॉलिंग के आगे फेल हुए मुंबई इंडियंस के ओपनर्स, एक ही ओवर में भेजा पवेलियन","link":"https://www.abplive.com/sports/cricket/rashid-khan-took-wickets-of-ishan-kishan-and-rohit-sharma-in-same-over-ipl-2023-mi-vs-gt-2406389","keywords":["Cricket"],"creator":["ABP Live"],"video_url":null,"description":"MI vs GT, IPL 2023, Mumbai Indians, Gujarat Titans: मुंबई के वानखेड़े स्टेडियम में आज आईपीएल 2023 का 57वां मुकाबला खेला जा रहा है. मुंबई इंडियंस और गुजरात टाइटंस के बीच खेले जा रहे इस मैच में हार्दिक ने टॉस जीतकर पहले गेंदबाजी करने का फैसला लिया है. पहले बल्लेबाजी करने उतरी मुंबई इंडियंस को अच्छी शुरुआत मिली. रोहित शर्मा और ईशान किशन ने पावरप्ले में मिलकर 61 रन जोड़े. हालांकि इसके बाद राशिद खान ने गुजरात टाइटंस की वापसी करा दी.  रोहित ने बनाए 29 रन 7वें ओवर में गुजरात टाइटंस के दिग्गज स्पिनर ने मुंबई की सलामी जोड़ी को पवेलियन भेज दिया. ओवर की पहली गेंद पर राशिद ने रोहित शर्मा को राहुल तेवतिया के हाथों कैच आउट कराया. रोहित ने 18 गेंदों पर 29 रन बनाए. अपनी इस पारी में उन्होंने 3 चौके और 2 छक्के जड़ें. राशिद की आफ स्टंप की लाइन में गुड लेंथ गेंद रोहित के बल्ले का किनारा लेकर सीधे स्लिप पर तैनात तेवतिया के हाथों में जा पहुंची. ईशान ने बनाए 31 रन इसी ओवर की 5वीं गेंद पर राशिद ने गुजरात को दूसरी सफलता दिलाई. उन्होंने ताबड़तोड़ बल्लेबाजी कर रहे ईशान किशन को एलबीडल्यू आउट किया. उन्होंने 20 गेंदों पर 31 रन की पारी खेली. अपनी इस पारी में उन्होंने 4 चौके और 1 छक्का लगाया. राशिद की गेंद ईशान के पैड्स पर लगी और सीधी रह गई. स्वीप की कोशिश कर रहे किशन पूरी तरह से चूक गए और गेंद सीधे पैड्स पर लगी. अंपायर ने उंगली खड़ी कर दी. मुंबई का तीसरा विकेट भी राशिद ने ही चटकाया. उन्होंने नेहल वढेरा को बोल्ड किया. वढेरा ने 7 गेंदों पर 15 रन बनाए.   Rohit Sharma ✅Ishan Kishan ✅@rashidkhan_19 dismissed both #MI openers in the same overFollow the Match: https://t.co/o61rmJWtC5#TATAIPL | #MIvGT | @gujarat_titans pic.twitter.com/iW2PX7Q9fA — IndianPremierLeague (@IPL) May 12, 2023 ये भी पढ़ें:  IPL 2023: जब अनुष्का शर्मा से बात कर फूट-फूटकर रोए थे विराट, किंग कोहली ने बताया कौन सा था वो पल IPL 2023: यशस्वी जायसवाल की जल्द हो सकती है टीम इंडिया में एंट्री, जय शाह के इस ट्वीट से मिल रहे संकेत!","content":"MI vs GT, IPL 2023, Mumbai Indians, Gujarat Titans: मुंबई के वानखेड़े स्टेडियम में आज आईपीएल 2023 का 57वां मुकाबला खेला जा रहा है. मुंबई इंडियंस और गुजरात टाइटंस के बीच खेले जा रहे इस मैच में हार्दिक ने टॉस जीतकर पहले गेंदबाजी करने का फैसला लिया है. पहले बल्लेबाजी करने उतरी मुंबई इंडियंस को अच्छी शुरुआत मिली. रोहित शर्मा और ईशान किशन ने पावरप्ले में मिलकर 61 रन जोड़े. हालांकि इसके बाद राशिद खान ने गुजरात टाइटंस की वापसी करा दी. रोहित ने बनाए 29 रन 7वें ओवर में गुजरात टाइटंस के दिग्गज स्पिनर ने मुंबई की सलामी जोड़ी को पवेलियन भेज दिया. ओवर की पहली गेंद पर राशिद ने रोहित शर्मा को राहुल तेवतिया के हाथों कैच आउट कराया. रोहित ने 18 गेंदों पर 29 रन बनाए. अपनी इस पारी में उन्होंने 3 चौके और 2 छक्के जड़ें. राशिद की आफ स्टंप की लाइन में गुड लेंथ गेंद रोहित के बल्ले का किनारा लेकर सीधे स्लिप पर तैनात तेवतिया के हाथों में जा पहुंची. ईशान ने बनाए 31 रन googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); इसी ओवर की 5वीं गेंद पर राशिद ने गुजरात को दूसरी सफलता दिलाई. उन्होंने ताबड़तोड़ बल्लेबाजी कर रहे ईशान किशन को एलबीडल्यू आउट किया. उन्होंने 20 गेंदों पर 31 रन की पारी खेली. अपनी इस पारी में उन्होंने 4 चौके और 1 छक्का लगाया. राशिद की गेंद ईशान के पैड्स पर लगी और सीधी रह गई. स्वीप की कोशिश कर रहे किशन पूरी तरह से चूक गए और गेंद सीधे पैड्स पर लगी. अंपायर ने उंगली खड़ी कर दी. मुंबई का तीसरा विकेट भी राशिद ने ही चटकाया. उन्होंने नेहल वढेरा को बोल्ड किया. वढेरा ने 7 गेंदों पर 15 रन बनाए. Rohit Sharma ✅ Ishan Kishan ✅ @rashidkhan_19 dismissed both #MI openers in the same over Follow the Match: https://t.co/o61rmJWtC5 #TATAIPL | #MIvGT | @gujarat_titans pic.twitter.com/iW2PX7Q9fA — IndianPremierLeague (@IPL) May 12, 2023 ये भी पढ़ें: IPL 2023: जब अनुष्का शर्मा से बात कर फूट-फूटकर रोए थे विराट, किंग कोहली ने बताया कौन सा था वो पल IPL 2023: यशस्वी जायसवाल की जल्द हो सकती है टीम इंडिया में एंट्री, जय शाह के इस ट्वीट से मिल रहे संकेत!","pubDate":"2023-05-12 16:57:01","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/05/12/b32a8fe4e6fcb8571ba8fa1503c2d1e71683904531412430_original.jpg","source_id":"abplive","category":["sports"],"country":["india"],"language":"hindi"},{"title":"If India doesn't come to Pakistan, we will not be going to India for World Cup: PCB chief Najam Sethi","link":"https://economictimes.indiatimes.com/news/sports/if-india-doesnt-come-to-pakistan-we-will-not-be-going-to-india-for-world-cup-pcb-chief-najam-sethi/articleshow/100192426.cms","keywords":null,"creator":null,"video_url":null,"description":"Pakistan Cricket Board chairman Najam Sethi has stated that the country will only travel to India for the ODI World Cup if India is allowed to play in the 2025 Champions Trophy and the upcoming Asia Cup in Pakistan. Sethi proposed a “hybrid model” which was rejected by the Asian Cricket Council and is waiting for a response.","content":"Synopsis Pakistan Cricket Board chairman Najam Sethi has stated that the country will only travel to India for the ODI World Cup if India is allowed to play in the 2025 Champions Trophy and the upcoming Asia Cup in Pakistan. Sethi proposed a “hybrid model” which was rejected by the Asian Cricket Council and is waiting for a response. We have asked ICC to provide us with full detail of ideas and formulas underlying this model. Pakistan Cricket Board chairman Najam Sethi on Friday made it clear that Pakistan will travel to India for the ODI World Cup only if the Rohit Sharma-led team is allowed to play the upcoming Asia Cup and the 2025 Champions Trophy in his country. The Asian Cricket Council ( ACC ) recently rejected the \" hybrid model \", which the former journalist feels is the only feasible solution until India and Pakistan start playing each other in their respective nations. Sethi also said that if India comes to Pakistan, their national team will have no issues playing in any Indian city, including Ahmedabad. Excepts from an exclusive interview with the PTI: Q: What is the status of Asia Cup and what is ACC's reaction to your proposed Hybrid Model? A: In the current scenario, we have made it clear that let's play four matches in Pakistan and we will play the rest of the games at neutral venue which we can mutually agree upon. The Asian Cricket Council can take two decisions. Either they can say 'Okay, let's go ahead and issue the schedule' according to my proposal or they can say 'No, we want to play all the matches at neutral venue'. If they take the first position, everything will be sorted out and we will get cracking. If they take the second position, then I am afraid we won't participate in Asia Cup. That is the current position. We are waiting for response from Mr Jay Shah and other colleagues. Q: Does it make sense for Pakistan to stay in ACC if they don't play Asia Cup? A: That is for Asian Cricket Council to consider. The next turn for Asian Cricket Council presidency belongs to PCB . That's our turn. So we are very keen to stay in Asian Cricket Council. Let me go beyond that. There can't be any ACC without Pakistan. The two most important members who bring revenue to ACC are India and Pakistan. It's their matches that bring 80 percent of the broadcast rights. If Pakistan doesn't play Asia Cup, then the broadcaster, that is Star, is going to have problems. The 45 or 46 million dollars that are supposed to come for the series (Asia Cup) is mostly going to come from these matches and the way Asia Cup is structured, Pakistan and India play two matches minimum and if they qualify for final, there is a third match. That's why India and Pakistan are both critical to the cup and to the council. Therefore it must be mentioned that in Bahrain at last ACC meeting, I had presented the hybrid model to save the Asia Cup as India had refused to play in Pakistan, which is the host country, that's where the problem arose. I had said, one solution is I will find neutral venue for India games. The BCB president had then said, option of Pakistan not playing Asia Cup is ruled out. If India comes to Pakistan, the crowds will be hospitable but if India doesn't come and gives no rational reason for not coming to Pakistan, when the whole world is coming to Pakistan, then this is the solution I have in mind. We will play India at a neutral venue but rest of the countries must come and play their matches in Pakistan. We have gone so far to say play only four games in Pakistan and play rest of the games in the neutral venue. So we have given solution for not just one issue but also for World Cup and Champions Trophy (in Pakistan in 2025). Because if we don't go to India and play there's going to be a problem. And if India doesn't come to Pakistan for Champions Trophy (2025), then there's problem. Q: India not going to Pakistan is due to political tension but after former Prime Minister Imran Khan's arrest, don't you think other teams will be wary of going to Pakistan in current security situation? A: Imran Khan's protest situation is going on for six months. The New Zealand national team was playing in Rawalpindi, Lahore, Karachi when Imran Khan's protest was going on. So that's not an issue. The security provided to these teams are VVIP presidential security and it overrides everything else. If there is a bit of hiccup in Islamabad, you mean you can't have cricket in Pindi, Multan, Lahore or Karachi? No it doesn't mean that. Let me go further. This is the month of May and we are talking about Asia Cup in September. Give me a break. Are you saying in September, Pakistan will be up in flames and won't be able to play cricket. Well, then why not wait for September and see what happens. \"If situation is such, that security can't be provided to teams, I will be first one to say, let's move it to a neutral venue for all the matches. Do you think, we want our honourable guests to face riots in Pakistan? No, we don't. We care for them. Please allow us to be responsible. Q: Why can't Ahmedabad be a venue for India vs Pakistan match as Pakistan played at that very venue in 2005? A: I have never said that. All I have said is that no one from the BCCI has asked us anything about Ahmedabad. For some strange reason, this is putting cart before the horse. You are asking me whether we will play in Ahmedabad or not but I am telling you, the real question is whether we will play in India or not? We will play in India if India plays in Pakistan. But if India doesn't play in Pakistan, why should we play in India? So my solution was, let India vs Pakistan matches be played at neutral venue. That's all. You can't have your cake and eat it too. Now coming to Ahmedabad, if India comes to Pakistan, we will provide VVIP security at every venue and I dare say, we go India on reciprocal terms, if India asks us to play in Ahmedadbad in reciprocal terms, we will have no problems. We will play wherever they want us to play because we expect them to provide us the security that is needed just as India would want us to provide them with security at any venue if India were to play in Pakistan. So Ahmedabad is frankly not an issue. Let's first resolve India and Pakistan playing in each other's countries. Q: If the ACC agrees to a four-match hybrid model, will Pakistan play in India as hybrid model in World Cup with Pakistan playing India in Bangladesh might not be a feasible solution? A: Look, the issue right now is the Asia Cup. I would like the hybrid model to work and succeed. It is a formula going forward for World Cup and Champions Trophy. Because if India refuses to come to Pakistan for the Champions Trophy, we will have a problem. If Pakistan refuses to go to India, there will be problem, won't we? The root cause is India not coming to Pakistan. So either we don't play at all or have a compromise while moving the ball forward. So lets have a solution. India and Pakistan going forward in all tournaments -- Asia Cup, World Cup, Champions Trophy will not play each other in each other's country. No big deal. The game will still go on. Q: In the ICC revenue model India gets around 38.5 percent. It's a proposal but do you agree with that? A: We have asked ICC to provide us with full detail of ideas and formulas underlying this model. The ICC has provided us with something that we want but not everything that we want. We are writing to ICC to provide us with assumptions underlying this model and formulas used to arrive at this model. It is not enough to tell us that these are the figures. As per ICC constitution, it is every member's right to know how things are done and how certain decisions are taken. We are awaiting those details and we will take it from there. Don’t miss out on ET Prime stories! Get your daily dose of business updates on WhatsApp. click here! Friday, 12 May, 2023 Experience Your Economic Times Newspaper, The Digital Way! Read Complete Print Edition » Front Page Pure Politics Brands & Companies Companies More On Watchlist: Govt Seeks to Tax Netflix Income in India India is seeking to tax Netflix Inc.’s income earned from streaming services in the country, people familiar with the matter said. It’s the first such move to tax overseas digital companies providing electronic commerce services to consumers in India, they said. PhonePe Will Likely go for an India Listing Walmart president and chief executive officer Doug McMillon has said the performance of its payments company PhonePe has seen a significant upside, and if it chooses to enter the ecommerce business, it won’t compete with sister company Flipkart as both will be focused on serving their own set of customers. Adani in Talks for $2-2.5b Stake Sales in 3 Group Cos Adani Group is in discussions with potential investors to raise $2-2.5 billion via share sales in Adani Enterprises, Adani Transmission and Adani Green Energy, said people aware of the matter. Read More News on acc Najam Sethi PCB World Cup Asian Cricket Council Hybrid Model (Catch all the Business News , Breaking News Events and Latest News Updates on The Economic Times .) Download The Economic Times News App to get Daily Market Updates & Live Business News. ... more less ETPrime stories of the day Strategy Stock Radar: Down over 50% from highs! Is MRPL a value pick at current levels? 4 mins read Payments Replicating UPI’s success abroad will be tough. (Think high card penetration, reluctant banks) 9 mins read Fossil fuels SBI fossil fuel lending falls, but an exclusion policy is nowhere in sight 3 mins read Subscribe to ETPrime","pubDate":"2023-05-12 15:47:43","image_url":"https://img.etimg.com/thumb/width-1200,imgsize-27580,resizemode-4,msid-100192426/if-india-doesnt-come-to-pakistan-we-will-not-be-going-to-india-for-world-cup-pcb-chief-najam-sethi.jpg","source_id":"economictimes_indiatimes","category":["sports"],"country":["india"],"language":"english"},{"title":"Cricket South Africa announces Wandile Gwavu as fielding coach for white-ball format","link":"https://thenewsmill.com/2023/05/cricket-south-africa-announces-wandile-gwavu-as-fielding-coach-for-white-ball-format/","keywords":["Cricket","Sports","ANI"],"creator":["ANI"],"video_url":null,"description":"The News Mill","content":null,"pubDate":"2023-05-12 15:34:09","image_url":null,"source_id":"thenewsmill","category":["sports"],"country":["india"],"language":"english"},{"title":"Coley and Sammy new WI head coaches","link":"https://www.nationnews.com/2023/05/12/coley-sammy-new-wi-head-coaches/","keywords":["Sports"],"creator":[""],"video_url":null,"description":null,"content":"Cricket West Indies (CWI) on Friday announced the appointments of the new Head Coaches for the West Indies Senior Men’s Teams. Andre Coley has been appointed Head Coach for the Test and ‘A’ Teams and Daren Sammy has been appointed the Head Coach for the white ball One Day International (ODI) and T20 International (T20I) Teams. The new Head Coaches were selected following an open and transparent interview process, and the appointments were confirmed following the CWI Board of Directors meeting on Thursday 11 May. Daren Sammy’s first assignment will be the three-match ODI Series against the United Arab Emirates (UAE) in Sharjah in June, ahead of the ICC Men’s World Cup 2023 Qualifier tournament in Zimbabwe. Andre Coley’s first assignment will be the two-match Test Series against India in the Caribbean in July. Sammy is a former West Indies captain in all three formats, who led the West Indies to the ICC T20 World Cup titles in 2012 and 2016. Since retirement, he has coached franchise teams in the Pakistan Super League and the Caribbean Premier League. Coley is a former Jamaica wicket-keeper/batsman who has coached at all levels in West Indies cricket. He was Interim Head Coach of the West Indies team on the tours of Zimbabwe and South Africa earlier this year with his most recent assignment as Head Coach of the West Indies Academy.(PR)","pubDate":"2023-05-12 15:17:28","image_url":null,"source_id":"nationnews","category":["sports"],"country":["Barbados"],"language":"english"},{"title":"County cricket: Jimmy Anderson misses Lancashire action with ‘minor issue’ – live","link":"https://www.theguardian.com/sport/live/2023/may/12/county-cricket-lancashire-v-somerset-surrey-v-middlesex-and-more-live","keywords":["County Championship","Cricket","County Championship Division One","County Championship Division Two","Lancashire","Yorkshire","Sussex","Hampshire","Somerset","Warwickshire","Durham","Kent","Derbyshire","Gloucestershire","Worcestershire","Northamptonshire","Essex","Nottinghamshire","Sport"],"creator":["Tanya Aldred at Old Trafford"],"video_url":null,"description":"Latest updates from around the grounds on day twoGet in touch: email Tanya, tweet or comment BTLJofra Archer: elbowOlly Stone: hamstring Continue reading...","content":null,"pubDate":"2023-05-12 15:06:49","image_url":"https://i.guim.co.uk/img/media/7d8a4e16229e13e49e4a692f81595897a4db162c/0_91_3500_2101/master/3500.jpg?width=460&quality=85&auto=format&fit=max&s=37cd1d12bee5d247cf398bdb467f94ab","source_id":"theguardian","category":["sports"],"country":["canada","united kingdom","india","singapore"],"language":"english"},{"title":"Pakistan demands neutral World Cup venues in row with India","link":"https://www.samaaenglish.tv/news/40034852/sports-pakistan-demands-neutral-world-cup-venues-in-row-with-india","keywords":["Sports"],"creator":null,"video_url":null,"description":"The chairman of Pakistan’s cricket board is demanding his side’s World Cup games are moved out of host country India if their arch-rivals refuse to travel to Pakistan for September’s Asia Cup, a report said Friday. Arrangements for the one-day international World Cup, which is due to start in October, remain shrouded in mystery, with the Board of Control for Cricket in India (BCCI) so far failing to release a match schedule or list of venues. It is an extraordinary situation less than six months before the start of a quadrennial global sporting tournament. How to accommodate Pakistan appears to be at the heart of the delay, with the nuclear-armed neighbours – both of them cricket-obsessed, but who have fought multiple wars since independence from Britain in 1947 – mired in diplomatic disputes. Pakistan is itself hosting the Asia Cup, another 50-over tournament, in September, in which India normally participates. But the BCCI – the world’s richest and most powerful cricket body – has refused to travel to Pakistan for several years citing both the diplomatic tensions and the country’s challenging security situation. It wants its Asia Cup games moved out of Pakistan – and Pakistan Cricket Board chairman Najam Sethi demanded a reciprocal arrangement for the World Cup in an interview with The Indian Express newspaper on Friday. “If India now wants to have a neutral venue and accepts the hybrid model, then we’ll use the same hybrid model in the World Cup,” he said. Pakistan would be willing to play their World Cup games in Bangladesh or any other venue acceptable to India, he said, calling it “a model that goes forward and resolves this political logjam” between the two countries. The BCCI is headed by Jay Shah, the son of India’s powerful home minister Amit Shah. But Sethi, a former journalist turned cricket administrator, called on the Indian cricket body to “stand up” to New Delhi and insist on being allowed to travel to Pakistan as “it cannot cite security as an issue anymore”. There was no immediate reaction from the BCCI to Sethi’s comments.","content":"Arrangements for the one-day international World Cup, which is due to start in October, remain shrouded in mystery, with the Board of Control for Cricket in India (BCCI) so far failing to release a match schedule or list of venues. It is an extraordinary situation less than six months before the start of a quadrennial global sporting tournament. How to accommodate Pakistan appears to be at the heart of the delay, with the nuclear-armed neighbours – both of them cricket-obsessed, but who have fought multiple wars since independence from Britain in 1947 – mired in diplomatic disputes. Pakistan is itself hosting the Asia Cup, another 50-over tournament, in September, in which India normally participates. But the BCCI – the world’s richest and most powerful cricket body – has refused to travel to Pakistan for several years citing both the diplomatic tensions and the country’s challenging security situation. It wants its Asia Cup games moved out of Pakistan – and Pakistan Cricket Board chairman Najam Sethi demanded a reciprocal arrangement for the World Cup in an interview with The Indian Express newspaper on Friday. “If India now wants to have a neutral venue and accepts the hybrid model, then we’ll use the same hybrid model in the World Cup,” he said. Pakistan would be willing to play their World Cup games in Bangladesh or any other venue acceptable to India, he said, calling it “a model that goes forward and resolves this political logjam” between the two countries. The BCCI is headed by Jay Shah, the son of India’s powerful home minister Amit Shah. But Sethi, a former journalist turned cricket administrator, called on the Indian cricket body to “stand up” to New Delhi and insist on being allowed to travel to Pakistan as “it cannot cite security as an issue anymore”. There was no immediate reaction from the BCCI to Sethi’s comments.","pubDate":"2023-05-12 13:17:47","image_url":"https://i.samaaenglish.tv/large/2023/05/12181725f7370e5.jpg?r=181747","source_id":"samaaenglish","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"IPL 2023: यशस्वी जायसवाल की जल्द हो सकती है टीम इंडिया में एंट्री, जय शाह के इस ट्वीट से मिल रहे संकेत!","link":"https://www.abplive.com/sports/cricket/jai-shah-praised-yashasvi-jaiswal-kkr-vs-rr-ipl-2023-rajasthan-royals-2406300","keywords":["Cricket"],"creator":["ABP Live"],"video_url":null,"description":"KKR vs RR, IPL 2023, Yashasvi Jaiswal, Jay Shah: आईपीएल 2023 के 56वें मुकाबले में गुरुवार को राजस्थान रॉयल्स ने कोलकाता नाइटराइडर्स को 9 विकेट से मात दी. कोलकाता के ईडन गॉर्डन में खेले गए इस मैच में KKR ने टॉस हारकर पहले बल्लेबाजी करते हुए 20 ओवर में 8 विकेट खोकर 149 रन बनाए. जवाब में राजस्थान ने यशस्वी की पारी की बदौलत 13.1 ओवर में 1 विकेट खोकर 151 रन बनाए और 9 विकेट से मैच को जीत लिया. सलामी बल्लेबाजी यशस्वी जायसवाल शतक से चूक गए. वह 47 गेंदों पर 98 रन बनाकर नाबाद रहे. अपनी इस पारी में उन्होंने 13 चौके और 5 छक्के लगाए. उन्हें प्लेयर ऑफ द चुना गया. जायसवाल की इस पारी की जमकर तारीफ हो रही है. विराट कोहली, हरभजन सिंह से लेकर सूर्यकुमार यादव तक, सभी ने यशस्वी की पारी की तारीफ की है. जायसवाल ने आईपीएल इतिहास की सबसे तेज फिफ्टी लगाई. उन्होंने अर्धशतक के लिए मात्र 13 गेंदों का सामना किया. राजस्थान के युवा बल्लेबाज की इस पारी के बीसीसीआई सचिव जय शाह भी मरीद हो गए. उन्होंने सोशल मीडिया के जरिए यशस्वी की जमकर तारीफ की. जय शाह ने ट्विटर पर लिखा, \"युवा यशस्वी जायसवाल ने सबसे तेज आईपीएल अर्धशतक बनाने के लिए एक विशेष पारी खेली. उन्होंने अपने खेल के प्रति जबरदस्त धैर्य और जुनून दिखाया है. इतिहास हासिल करने के लिए.\" बधाई हो. आप भविष्य में भी इस बेहतरीन फॉर्म को जारी रख सकते हैं.\" शाह के इस ट्वीट के बाद सोशल मीडिया पर फैंस का कहना है कि यशस्वी जल्द ही इंटरनेशनल डेब्यू कर सकते हैं. वहीं, टीम इंडिया के पूर्व हेड कोच रवि शास्त्री ने कहा कि यशस्वी जायसवाल के टीम इंडिया के लिए खेलने का समय आ गया है.   A special knock by young @ybj_19 for hitting the fastest IPL fifty. He has shown tremendous grit and passion towards his game. Congratulations on achieving history. May you continue this fine form in future. #TATAIPL2023 — Jay Shah (@JayShah) May 11, 2023 बता दें कि यशस्वी ने आईपीएल 2023 में अब तक 12 मैच खेले हैं. इस दौरान 12 पारियों में उन्होंने 52.27 की औसत और 167.15 के स्ट्राइक रेट से 575 रन बनाए हैं. मौजूदा सीजन में अब तक वह 4 अर्धशतक और 1 शतक लगा चुके हैं. उनका सर्वाधिक स्कोर 124 रन है. ऑरेंज कैप की लिस्ट में यशस्वी दूसरे पायदान पर हैं. टॉप पर आरसीबी के कप्तान फाफ डूप्लेसिस हैं, जिन्होंने 11 मैच की 11 पारियों में 576 रन बनाए हैं.  ये भी पढ़ें:  IPL 2023: यशस्वी को लेकर पूर्व खिलाड़ी का बयान, कहा- 'मैं होता सिलेक्टर तो वर्ल्ड कप टीम में करता शामिल'","content":null,"pubDate":"2023-05-12 13:07:42","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/05/12/ad22c48be32ade345c0895578a86bc231683896383158430_original.jpg","source_id":"abplive","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Pakistan demands neutral World Cup venues in row with India","link":"https://www.dialoguepakistan.com/pakistan-demands-neutral-world-cup-venues-in-row-with-india/","keywords":["Sports","cricket","Dont Miss","Pakistan","Vanue"],"creator":["AFP"],"video_url":null,"description":"New Delhi, India: The chairman of Pakistan’s cricket board is demanding his side’s World Cup games are moved out of host country India if their arch-rivals refuse to travel to Pakistan for September’s Asia Cup, a report said Friday. Arrangements for the one-day international World Cup, which is due to start in October, remain shrouded in […] The post <strong>Pakistan demands neutral World Cup venues in row with India</strong> appeared first on Dialogue Pakistan.","content":"Arrangements for the one-day international World Cup, which is due to start in October, remain shrouded in mystery, with the Board of Control for Cricket in India (BCCI) so far failing to release a match schedule or list of venues. It is an extraordinary situation less than six months before the start of a quadrennial global sporting tournament. How to accommodate Pakistan appears to be at the heart of the delay, with the nuclear-armed neighbours — both of them cricket-obsessed, but who have fought multiple wars since independence from Britain in 1947 — mired in diplomatic disputes. Pakistan is itself hosting the Asia Cup, another 50-over tournament, in September, in which India normally participates. But the BCCI — the world’s richest and most powerful cricket body — has refused to travel to Pakistan for several years citing both the diplomatic tensions and the country’s challenging security situation. It wants its Asia Cup games moved out of Pakistan — and Pakistan Cricket Board chairman Najam Sethi demanded a reciprocal arrangement for the World Cup in an interview with The Indian Express newspaper on Friday. “If India now wants to have a neutral venue and accepts the hybrid model, then we’ll use the same hybrid model in the World Cup,” he said. Pakistan would be willing to play their World Cup games in Bangladesh or any other venue acceptable to India, he said, calling it “a model that goes forward and resolves this political logjam” between the two countries. The BCCI is headed by Jay Shah, the son of India’s powerful home minister Amit Shah. But Sethi, a former journalist turned cricket administrator, called on the Indian cricket body to “stand up” to New Delhi and insist on being allowed to travel to Pakistan as “it cannot cite security as an issue anymore”. There was no immediate reaction from the BCCI to Sethi’s comments.","pubDate":"2023-05-12 12:11:21","image_url":null,"source_id":"dialoguepakistan","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"Keemo Paul returns as West Indies name World Cup Qualifier squad","link":"https://a-sports.tv/keemo-paul-returns-west-indies-name-world-cup-qualifier-squad/","keywords":["Cricket","Sports","Top News","Top Picks","Uncategorized","Keemo Paul","West Indies","West Indies squad","West Indies World Cup Qualifier Squad","World Cup Qualifier"],"creator":["A Sports"],"video_url":null,"description":"West Indies have recalled bowling all-rounder Keemo Paul as the side announced their 15-member squad on Friday for the ICC ODI World Cup Qualifier, scheduled from June 18 to July 9 in Zimbabwe. Paul, who last played an ODI level back in July last year, was named in the squad along with left-arm spinner Gudakesh […] The post Keemo Paul returns as West Indies name World Cup Qualifier squad appeared first on ASports.tv.","content":"West Indies have recalled bowling all-rounder Keemo Paul as the side announced their 15-member squad on Friday for the ICC ODI World Cup Qualifier, scheduled from June 18 to July 9 in Zimbabwe. Paul, who last played an ODI level back in July last year, was named in the squad along with left-arm spinner Gudakesh Motie, who performed well in Zimbabwe during the West Indies Test tour earlier in the year. “Paul is a three-dimensional player, who can bowl the new ball effectively, he’s dynamic in the outfield and he can also make vital runs.” said lead West Indies selector Desmond Haynes “We see him as a potential match-winner for us.” Finishing ninth on the Cricket World Cup League standings, West Indies were compelled to play the Qualifier to earn a spot in the main event, scheduled later this year in India, South Africa, bagged the automatic place to the ODI World Cup this week after the first ODI between Bangladesh and Ireland was abandoned due to rain. The West Indies also went through the Qualifier in 2018 to secure a spot in 2019 Cricket World Cup in England and finished top of the Super Six group to confirm their place. As part of their preparation for the World Cup Qualifier, West Indies will play a three-match ODI series in Sharjah against hosts and tournament competitors UAE next month. Shai Hope will captain the side in both assignments. Brandon King will be his deputy for the UAE series, while T20I captain Rovman Powell, who is currently busy playing IPL, will serve as vice-captain for the World Cup Qualifier. Squad for World Cup Qualifier: Shai Hope (capt), Rovman Powell (vice-capt), Shamarh Brooks, Yannic Cariah, Keacy Carty, Roston Chase, Jason Holder, Akeal Hosein, Alzarri Joseph, Brandon King, Kyle Mayers, Gudakesh Motie, Keemo Paul, Nicholas Pooran, Romario Shepherd Squad for UAE series: Shai Hope (capt), Brandon King (vice-capt), Alick Athanaze, Shamarh Brooks, Yannic Cariah, Keacy Carty, Roston Chase, Dominic Drakes, Kavem Hodge, Akeem Jordan, Gudakesh Motie, Keemo Paul, Raymon Reifer, Odean Smith, Devon Thomas READ: David Miller opts for Babar’s cover drive over Kohli’s   The post Keemo Paul returns as West Indies name World Cup Qualifier squad appeared first on ASports.tv.","pubDate":"2023-05-12 11:36:12","image_url":null,"source_id":"arynews","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"Former PCB chairman says increasing India’s share of ICC earnings makes ‘no sense’","link":"https://thefrontierpost.com/former-pcb-chairman-says-increasing-indias-share-of-icc-earnings-makes-no-sense/","keywords":["Sports"],"creator":["The Frontier Post"],"video_url":null,"description":"Monitoring Desk LAHORE: Former chairman of the Pakistan Cricket Board (PCB) Ehsan Mani is concerned about international cricket’s health following revelations that India would receive a significant share from the International Cricket Council’s (ICC) media rights deal for 2024-27, which is worth $3 billion. The Board of Control for Cricket in India (BCCI) is set […]","content":"Monitoring Desk LAHORE: Former chairman of the Pakistan Cricket Board (PCB) Ehsan Mani is concerned about international cricket’s health following revelations that India would receive a significant share from the International Cricket Council’s (ICC) media rights deal for 2024-27, which is worth $3 billion. The Board of Control for Cricket in India (BCCI) is set to receive 38.5% of the net surplus earnings from the ICC which is much higher compared to its 22% share in the current 2015-23 deal, according to ESPNcricinfo. “The (proposed revenue distribution model) will be giving the most money to the country that needs it the least, which makes no sense,” Mani, who was ICC president from 2003-06 and stepped down from the Pakistan Cricket Board in 2021, told Forbes in an exclusive interview. “I think it’s very unfortunate. There’s no strategic thinking about the development of the global game. There’s no vision.” Mani also stated that cricket should grow beyond its traditional base rather than just relying on India. “It only takes one downturn in an economic cycle for the ICC members to be affected. There is far too much reliance on India,” he said. “If the ICC wants a truly global game and diversify its financial reliance, the country to develop is the US I would have put $20-30 million into the US You also need to grow the game in Africa, that’s the future. “I think the global game (Associates) should have been allocated at least 30% (instead of 11%). That’s the only way to globalise the game.” Mani also called for financial parity among the 12 full members of the ICC rather than giving the lion’s share to India. “You have to give countries enough resources to not only develop their players but to pay them a fair amount, especially with the IPL and other T20 leagues targeting players,” he said. “The Indian market brings in a lot of money…it’s not the BCCI (India’s governing body). There are benefits to the Indian companies to advertise in the ICC events and worldwide. India are not playing on their own, they are playing against other members. It’s a two-way street.”","pubDate":"2023-05-12 17:13:29","image_url":null,"source_id":"thefrontierpost","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"IPL 2023: राशिद खान की खतरनाक बॉलिंग के आगे फेल हुए मुंबई इंडियंस के ओपनर्स, एक ही ओवर में भेजा पवेलियन","link":"https://www.abplive.com/sports/cricket/rashid-khan-took-wickets-of-ishan-kishan-and-rohit-sharma-in-same-over-ipl-2023-mi-vs-gt-2406389","keywords":["Cricket"],"creator":["ABP Live"],"video_url":null,"description":"MI vs GT, IPL 2023, Mumbai Indians, Gujarat Titans: मुंबई के वानखेड़े स्टेडियम में आज आईपीएल 2023 का 57वां मुकाबला खेला जा रहा है. मुंबई इंडियंस और गुजरात टाइटंस के बीच खेले जा रहे इस मैच में हार्दिक ने टॉस जीतकर पहले गेंदबाजी करने का फैसला लिया है. पहले बल्लेबाजी करने उतरी मुंबई इंडियंस को अच्छी शुरुआत मिली. रोहित शर्मा और ईशान किशन ने पावरप्ले में मिलकर 61 रन जोड़े. हालांकि इसके बाद राशिद खान ने गुजरात टाइटंस की वापसी करा दी.  रोहित ने बनाए 29 रन 7वें ओवर में गुजरात टाइटंस के दिग्गज स्पिनर ने मुंबई की सलामी जोड़ी को पवेलियन भेज दिया. ओवर की पहली गेंद पर राशिद ने रोहित शर्मा को राहुल तेवतिया के हाथों कैच आउट कराया. रोहित ने 18 गेंदों पर 29 रन बनाए. अपनी इस पारी में उन्होंने 3 चौके और 2 छक्के जड़ें. राशिद की आफ स्टंप की लाइन में गुड लेंथ गेंद रोहित के बल्ले का किनारा लेकर सीधे स्लिप पर तैनात तेवतिया के हाथों में जा पहुंची. ईशान ने बनाए 31 रन इसी ओवर की 5वीं गेंद पर राशिद ने गुजरात को दूसरी सफलता दिलाई. उन्होंने ताबड़तोड़ बल्लेबाजी कर रहे ईशान किशन को एलबीडल्यू आउट किया. उन्होंने 20 गेंदों पर 31 रन की पारी खेली. अपनी इस पारी में उन्होंने 4 चौके और 1 छक्का लगाया. राशिद की गेंद ईशान के पैड्स पर लगी और सीधी रह गई. स्वीप की कोशिश कर रहे किशन पूरी तरह से चूक गए और गेंद सीधे पैड्स पर लगी. अंपायर ने उंगली खड़ी कर दी. मुंबई का तीसरा विकेट भी राशिद ने ही चटकाया. उन्होंने नेहल वढेरा को बोल्ड किया. वढेरा ने 7 गेंदों पर 15 रन बनाए.   Rohit Sharma ✅Ishan Kishan ✅@rashidkhan_19 dismissed both #MI openers in the same overFollow the Match: https://t.co/o61rmJWtC5#TATAIPL | #MIvGT | @gujarat_titans pic.twitter.com/iW2PX7Q9fA — IndianPremierLeague (@IPL) May 12, 2023 ये भी पढ़ें:  IPL 2023: जब अनुष्का शर्मा से बात कर फूट-फूटकर रोए थे विराट, किंग कोहली ने बताया कौन सा था वो पल IPL 2023: यशस्वी जायसवाल की जल्द हो सकती है टीम इंडिया में एंट्री, जय शाह के इस ट्वीट से मिल रहे संकेत!","content":"MI vs GT, IPL 2023, Mumbai Indians, Gujarat Titans: मुंबई के वानखेड़े स्टेडियम में आज आईपीएल 2023 का 57वां मुकाबला खेला जा रहा है. मुंबई इंडियंस और गुजरात टाइटंस के बीच खेले जा रहे इस मैच में हार्दिक ने टॉस जीतकर पहले गेंदबाजी करने का फैसला लिया है. पहले बल्लेबाजी करने उतरी मुंबई इंडियंस को अच्छी शुरुआत मिली. रोहित शर्मा और ईशान किशन ने पावरप्ले में मिलकर 61 रन जोड़े. हालांकि इसके बाद राशिद खान ने गुजरात टाइटंस की वापसी करा दी. रोहित ने बनाए 29 रन 7वें ओवर में गुजरात टाइटंस के दिग्गज स्पिनर ने मुंबई की सलामी जोड़ी को पवेलियन भेज दिया. ओवर की पहली गेंद पर राशिद ने रोहित शर्मा को राहुल तेवतिया के हाथों कैच आउट कराया. रोहित ने 18 गेंदों पर 29 रन बनाए. अपनी इस पारी में उन्होंने 3 चौके और 2 छक्के जड़ें. राशिद की आफ स्टंप की लाइन में गुड लेंथ गेंद रोहित के बल्ले का किनारा लेकर सीधे स्लिप पर तैनात तेवतिया के हाथों में जा पहुंची. ईशान ने बनाए 31 रन googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); इसी ओवर की 5वीं गेंद पर राशिद ने गुजरात को दूसरी सफलता दिलाई. उन्होंने ताबड़तोड़ बल्लेबाजी कर रहे ईशान किशन को एलबीडल्यू आउट किया. उन्होंने 20 गेंदों पर 31 रन की पारी खेली. अपनी इस पारी में उन्होंने 4 चौके और 1 छक्का लगाया. राशिद की गेंद ईशान के पैड्स पर लगी और सीधी रह गई. स्वीप की कोशिश कर रहे किशन पूरी तरह से चूक गए और गेंद सीधे पैड्स पर लगी. अंपायर ने उंगली खड़ी कर दी. मुंबई का तीसरा विकेट भी राशिद ने ही चटकाया. उन्होंने नेहल वढेरा को बोल्ड किया. वढेरा ने 7 गेंदों पर 15 रन बनाए. Rohit Sharma ✅ Ishan Kishan ✅ @rashidkhan_19 dismissed both #MI openers in the same over Follow the Match: https://t.co/o61rmJWtC5 #TATAIPL | #MIvGT | @gujarat_titans pic.twitter.com/iW2PX7Q9fA — IndianPremierLeague (@IPL) May 12, 2023 ये भी पढ़ें: IPL 2023: जब अनुष्का शर्मा से बात कर फूट-फूटकर रोए थे विराट, किंग कोहली ने बताया कौन सा था वो पल IPL 2023: यशस्वी जायसवाल की जल्द हो सकती है टीम इंडिया में एंट्री, जय शाह के इस ट्वीट से मिल रहे संकेत!","pubDate":"2023-05-12 16:57:01","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/05/12/b32a8fe4e6fcb8571ba8fa1503c2d1e71683904531412430_original.jpg","source_id":"abplive","category":["sports"],"country":["india"],"language":"hindi"},{"title":"If India doesn't come to Pakistan, we will not be going to India for World Cup: PCB chief Najam Sethi","link":"https://economictimes.indiatimes.com/news/sports/if-india-doesnt-come-to-pakistan-we-will-not-be-going-to-india-for-world-cup-pcb-chief-najam-sethi/articleshow/100192426.cms","keywords":null,"creator":null,"video_url":null,"description":"Pakistan Cricket Board chairman Najam Sethi has stated that the country will only travel to India for the ODI World Cup if India is allowed to play in the 2025 Champions Trophy and the upcoming Asia Cup in Pakistan. Sethi proposed a “hybrid model” which was rejected by the Asian Cricket Council and is waiting for a response.","content":"Synopsis Pakistan Cricket Board chairman Najam Sethi has stated that the country will only travel to India for the ODI World Cup if India is allowed to play in the 2025 Champions Trophy and the upcoming Asia Cup in Pakistan. Sethi proposed a “hybrid model” which was rejected by the Asian Cricket Council and is waiting for a response. We have asked ICC to provide us with full detail of ideas and formulas underlying this model. Pakistan Cricket Board chairman Najam Sethi on Friday made it clear that Pakistan will travel to India for the ODI World Cup only if the Rohit Sharma-led team is allowed to play the upcoming Asia Cup and the 2025 Champions Trophy in his country. The Asian Cricket Council ( ACC ) recently rejected the \" hybrid model \", which the former journalist feels is the only feasible solution until India and Pakistan start playing each other in their respective nations. Sethi also said that if India comes to Pakistan, their national team will have no issues playing in any Indian city, including Ahmedabad. Excepts from an exclusive interview with the PTI: Q: What is the status of Asia Cup and what is ACC's reaction to your proposed Hybrid Model? A: In the current scenario, we have made it clear that let's play four matches in Pakistan and we will play the rest of the games at neutral venue which we can mutually agree upon. The Asian Cricket Council can take two decisions. Either they can say 'Okay, let's go ahead and issue the schedule' according to my proposal or they can say 'No, we want to play all the matches at neutral venue'. If they take the first position, everything will be sorted out and we will get cracking. If they take the second position, then I am afraid we won't participate in Asia Cup. That is the current position. We are waiting for response from Mr Jay Shah and other colleagues. Q: Does it make sense for Pakistan to stay in ACC if they don't play Asia Cup? A: That is for Asian Cricket Council to consider. The next turn for Asian Cricket Council presidency belongs to PCB . That's our turn. So we are very keen to stay in Asian Cricket Council. Let me go beyond that. There can't be any ACC without Pakistan. The two most important members who bring revenue to ACC are India and Pakistan. It's their matches that bring 80 percent of the broadcast rights. If Pakistan doesn't play Asia Cup, then the broadcaster, that is Star, is going to have problems. The 45 or 46 million dollars that are supposed to come for the series (Asia Cup) is mostly going to come from these matches and the way Asia Cup is structured, Pakistan and India play two matches minimum and if they qualify for final, there is a third match. That's why India and Pakistan are both critical to the cup and to the council. Therefore it must be mentioned that in Bahrain at last ACC meeting, I had presented the hybrid model to save the Asia Cup as India had refused to play in Pakistan, which is the host country, that's where the problem arose. I had said, one solution is I will find neutral venue for India games. The BCB president had then said, option of Pakistan not playing Asia Cup is ruled out. If India comes to Pakistan, the crowds will be hospitable but if India doesn't come and gives no rational reason for not coming to Pakistan, when the whole world is coming to Pakistan, then this is the solution I have in mind. We will play India at a neutral venue but rest of the countries must come and play their matches in Pakistan. We have gone so far to say play only four games in Pakistan and play rest of the games in the neutral venue. So we have given solution for not just one issue but also for World Cup and Champions Trophy (in Pakistan in 2025). Because if we don't go to India and play there's going to be a problem. And if India doesn't come to Pakistan for Champions Trophy (2025), then there's problem. Q: India not going to Pakistan is due to political tension but after former Prime Minister Imran Khan's arrest, don't you think other teams will be wary of going to Pakistan in current security situation? A: Imran Khan's protest situation is going on for six months. The New Zealand national team was playing in Rawalpindi, Lahore, Karachi when Imran Khan's protest was going on. So that's not an issue. The security provided to these teams are VVIP presidential security and it overrides everything else. If there is a bit of hiccup in Islamabad, you mean you can't have cricket in Pindi, Multan, Lahore or Karachi? No it doesn't mean that. Let me go further. This is the month of May and we are talking about Asia Cup in September. Give me a break. Are you saying in September, Pakistan will be up in flames and won't be able to play cricket. Well, then why not wait for September and see what happens. \"If situation is such, that security can't be provided to teams, I will be first one to say, let's move it to a neutral venue for all the matches. Do you think, we want our honourable guests to face riots in Pakistan? No, we don't. We care for them. Please allow us to be responsible. Q: Why can't Ahmedabad be a venue for India vs Pakistan match as Pakistan played at that very venue in 2005? A: I have never said that. All I have said is that no one from the BCCI has asked us anything about Ahmedabad. For some strange reason, this is putting cart before the horse. You are asking me whether we will play in Ahmedabad or not but I am telling you, the real question is whether we will play in India or not? We will play in India if India plays in Pakistan. But if India doesn't play in Pakistan, why should we play in India? So my solution was, let India vs Pakistan matches be played at neutral venue. That's all. You can't have your cake and eat it too. Now coming to Ahmedabad, if India comes to Pakistan, we will provide VVIP security at every venue and I dare say, we go India on reciprocal terms, if India asks us to play in Ahmedadbad in reciprocal terms, we will have no problems. We will play wherever they want us to play because we expect them to provide us the security that is needed just as India would want us to provide them with security at any venue if India were to play in Pakistan. So Ahmedabad is frankly not an issue. Let's first resolve India and Pakistan playing in each other's countries. Q: If the ACC agrees to a four-match hybrid model, will Pakistan play in India as hybrid model in World Cup with Pakistan playing India in Bangladesh might not be a feasible solution? A: Look, the issue right now is the Asia Cup. I would like the hybrid model to work and succeed. It is a formula going forward for World Cup and Champions Trophy. Because if India refuses to come to Pakistan for the Champions Trophy, we will have a problem. If Pakistan refuses to go to India, there will be problem, won't we? The root cause is India not coming to Pakistan. So either we don't play at all or have a compromise while moving the ball forward. So lets have a solution. India and Pakistan going forward in all tournaments -- Asia Cup, World Cup, Champions Trophy will not play each other in each other's country. No big deal. The game will still go on. Q: In the ICC revenue model India gets around 38.5 percent. It's a proposal but do you agree with that? A: We have asked ICC to provide us with full detail of ideas and formulas underlying this model. The ICC has provided us with something that we want but not everything that we want. We are writing to ICC to provide us with assumptions underlying this model and formulas used to arrive at this model. It is not enough to tell us that these are the figures. As per ICC constitution, it is every member's right to know how things are done and how certain decisions are taken. We are awaiting those details and we will take it from there. Don’t miss out on ET Prime stories! Get your daily dose of business updates on WhatsApp. click here! Friday, 12 May, 2023 Experience Your Economic Times Newspaper, The Digital Way! Read Complete Print Edition » Front Page Pure Politics Brands & Companies Companies More On Watchlist: Govt Seeks to Tax Netflix Income in India India is seeking to tax Netflix Inc.’s income earned from streaming services in the country, people familiar with the matter said. It’s the first such move to tax overseas digital companies providing electronic commerce services to consumers in India, they said. PhonePe Will Likely go for an India Listing Walmart president and chief executive officer Doug McMillon has said the performance of its payments company PhonePe has seen a significant upside, and if it chooses to enter the ecommerce business, it won’t compete with sister company Flipkart as both will be focused on serving their own set of customers. Adani in Talks for $2-2.5b Stake Sales in 3 Group Cos Adani Group is in discussions with potential investors to raise $2-2.5 billion via share sales in Adani Enterprises, Adani Transmission and Adani Green Energy, said people aware of the matter. Read More News on acc Najam Sethi PCB World Cup Asian Cricket Council Hybrid Model (Catch all the Business News , Breaking News Events and Latest News Updates on The Economic Times .) Download The Economic Times News App to get Daily Market Updates & Live Business News. ... more less ETPrime stories of the day Strategy Stock Radar: Down over 50% from highs! Is MRPL a value pick at current levels? 4 mins read Payments Replicating UPI’s success abroad will be tough. (Think high card penetration, reluctant banks) 9 mins read Fossil fuels SBI fossil fuel lending falls, but an exclusion policy is nowhere in sight 3 mins read Subscribe to ETPrime","pubDate":"2023-05-12 15:47:43","image_url":"https://img.etimg.com/thumb/width-1200,imgsize-27580,resizemode-4,msid-100192426/if-india-doesnt-come-to-pakistan-we-will-not-be-going-to-india-for-world-cup-pcb-chief-najam-sethi.jpg","source_id":"economictimes_indiatimes","category":["sports"],"country":["india"],"language":"english"},{"title":"Cricket South Africa announces Wandile Gwavu as fielding coach for white-ball format","link":"https://thenewsmill.com/2023/05/cricket-south-africa-announces-wandile-gwavu-as-fielding-coach-for-white-ball-format/","keywords":["Cricket","Sports","ANI"],"creator":["ANI"],"video_url":null,"description":"The News Mill","content":null,"pubDate":"2023-05-12 15:34:09","image_url":null,"source_id":"thenewsmill","category":["sports"],"country":["india"],"language":"english"},{"title":"Coley and Sammy new WI head coaches","link":"https://www.nationnews.com/2023/05/12/coley-sammy-new-wi-head-coaches/","keywords":["Sports"],"creator":[""],"video_url":null,"description":null,"content":"Cricket West Indies (CWI) on Friday announced the appointments of the new Head Coaches for the West Indies Senior Men’s Teams. Andre Coley has been appointed Head Coach for the Test and ‘A’ Teams and Daren Sammy has been appointed the Head Coach for the white ball One Day International (ODI) and T20 International (T20I) Teams. The new Head Coaches were selected following an open and transparent interview process, and the appointments were confirmed following the CWI Board of Directors meeting on Thursday 11 May. Daren Sammy’s first assignment will be the three-match ODI Series against the United Arab Emirates (UAE) in Sharjah in June, ahead of the ICC Men’s World Cup 2023 Qualifier tournament in Zimbabwe. Andre Coley’s first assignment will be the two-match Test Series against India in the Caribbean in July. Sammy is a former West Indies captain in all three formats, who led the West Indies to the ICC T20 World Cup titles in 2012 and 2016. Since retirement, he has coached franchise teams in the Pakistan Super League and the Caribbean Premier League. Coley is a former Jamaica wicket-keeper/batsman who has coached at all levels in West Indies cricket. He was Interim Head Coach of the West Indies team on the tours of Zimbabwe and South Africa earlier this year with his most recent assignment as Head Coach of the West Indies Academy.(PR)","pubDate":"2023-05-12 15:17:28","image_url":null,"source_id":"nationnews","category":["sports"],"country":["Barbados"],"language":"english"},{"title":"County cricket: Jimmy Anderson misses Lancashire action with ‘minor issue’ – live","link":"https://www.theguardian.com/sport/live/2023/may/12/county-cricket-lancashire-v-somerset-surrey-v-middlesex-and-more-live","keywords":["County Championship","Cricket","County Championship Division One","County Championship Division Two","Lancashire","Yorkshire","Sussex","Hampshire","Somerset","Warwickshire","Durham","Kent","Derbyshire","Gloucestershire","Worcestershire","Northamptonshire","Essex","Nottinghamshire","Sport"],"creator":["Tanya Aldred at Old Trafford"],"video_url":null,"description":"Latest updates from around the grounds on day twoGet in touch: email Tanya, tweet or comment BTLJofra Archer: elbowOlly Stone: hamstring Continue reading...","content":null,"pubDate":"2023-05-12 15:06:49","image_url":"https://i.guim.co.uk/img/media/7d8a4e16229e13e49e4a692f81595897a4db162c/0_91_3500_2101/master/3500.jpg?width=460&quality=85&auto=format&fit=max&s=37cd1d12bee5d247cf398bdb467f94ab","source_id":"theguardian","category":["sports"],"country":["canada","united kingdom","india","singapore"],"language":"english"},{"title":"Pakistan demands neutral World Cup venues in row with India","link":"https://www.samaaenglish.tv/news/40034852/sports-pakistan-demands-neutral-world-cup-venues-in-row-with-india","keywords":["Sports"],"creator":null,"video_url":null,"description":"The chairman of Pakistan’s cricket board is demanding his side’s World Cup games are moved out of host country India if their arch-rivals refuse to travel to Pakistan for September’s Asia Cup, a report said Friday. Arrangements for the one-day international World Cup, which is due to start in October, remain shrouded in mystery, with the Board of Control for Cricket in India (BCCI) so far failing to release a match schedule or list of venues. It is an extraordinary situation less than six months before the start of a quadrennial global sporting tournament. How to accommodate Pakistan appears to be at the heart of the delay, with the nuclear-armed neighbours – both of them cricket-obsessed, but who have fought multiple wars since independence from Britain in 1947 – mired in diplomatic disputes. Pakistan is itself hosting the Asia Cup, another 50-over tournament, in September, in which India normally participates. But the BCCI – the world’s richest and most powerful cricket body – has refused to travel to Pakistan for several years citing both the diplomatic tensions and the country’s challenging security situation. It wants its Asia Cup games moved out of Pakistan – and Pakistan Cricket Board chairman Najam Sethi demanded a reciprocal arrangement for the World Cup in an interview with The Indian Express newspaper on Friday. “If India now wants to have a neutral venue and accepts the hybrid model, then we’ll use the same hybrid model in the World Cup,” he said. Pakistan would be willing to play their World Cup games in Bangladesh or any other venue acceptable to India, he said, calling it “a model that goes forward and resolves this political logjam” between the two countries. The BCCI is headed by Jay Shah, the son of India’s powerful home minister Amit Shah. But Sethi, a former journalist turned cricket administrator, called on the Indian cricket body to “stand up” to New Delhi and insist on being allowed to travel to Pakistan as “it cannot cite security as an issue anymore”. There was no immediate reaction from the BCCI to Sethi’s comments.","content":"Arrangements for the one-day international World Cup, which is due to start in October, remain shrouded in mystery, with the Board of Control for Cricket in India (BCCI) so far failing to release a match schedule or list of venues. It is an extraordinary situation less than six months before the start of a quadrennial global sporting tournament. How to accommodate Pakistan appears to be at the heart of the delay, with the nuclear-armed neighbours – both of them cricket-obsessed, but who have fought multiple wars since independence from Britain in 1947 – mired in diplomatic disputes. Pakistan is itself hosting the Asia Cup, another 50-over tournament, in September, in which India normally participates. But the BCCI – the world’s richest and most powerful cricket body – has refused to travel to Pakistan for several years citing both the diplomatic tensions and the country’s challenging security situation. It wants its Asia Cup games moved out of Pakistan – and Pakistan Cricket Board chairman Najam Sethi demanded a reciprocal arrangement for the World Cup in an interview with The Indian Express newspaper on Friday. “If India now wants to have a neutral venue and accepts the hybrid model, then we’ll use the same hybrid model in the World Cup,” he said. Pakistan would be willing to play their World Cup games in Bangladesh or any other venue acceptable to India, he said, calling it “a model that goes forward and resolves this political logjam” between the two countries. The BCCI is headed by Jay Shah, the son of India’s powerful home minister Amit Shah. But Sethi, a former journalist turned cricket administrator, called on the Indian cricket body to “stand up” to New Delhi and insist on being allowed to travel to Pakistan as “it cannot cite security as an issue anymore”. There was no immediate reaction from the BCCI to Sethi’s comments.","pubDate":"2023-05-12 13:17:47","image_url":"https://i.samaaenglish.tv/large/2023/05/12181725f7370e5.jpg?r=181747","source_id":"samaaenglish","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"IPL 2023: यशस्वी जायसवाल की जल्द हो सकती है टीम इंडिया में एंट्री, जय शाह के इस ट्वीट से मिल रहे संकेत!","link":"https://www.abplive.com/sports/cricket/jai-shah-praised-yashasvi-jaiswal-kkr-vs-rr-ipl-2023-rajasthan-royals-2406300","keywords":["Cricket"],"creator":["ABP Live"],"video_url":null,"description":"KKR vs RR, IPL 2023, Yashasvi Jaiswal, Jay Shah: आईपीएल 2023 के 56वें मुकाबले में गुरुवार को राजस्थान रॉयल्स ने कोलकाता नाइटराइडर्स को 9 विकेट से मात दी. कोलकाता के ईडन गॉर्डन में खेले गए इस मैच में KKR ने टॉस हारकर पहले बल्लेबाजी करते हुए 20 ओवर में 8 विकेट खोकर 149 रन बनाए. जवाब में राजस्थान ने यशस्वी की पारी की बदौलत 13.1 ओवर में 1 विकेट खोकर 151 रन बनाए और 9 विकेट से मैच को जीत लिया. सलामी बल्लेबाजी यशस्वी जायसवाल शतक से चूक गए. वह 47 गेंदों पर 98 रन बनाकर नाबाद रहे. अपनी इस पारी में उन्होंने 13 चौके और 5 छक्के लगाए. उन्हें प्लेयर ऑफ द चुना गया. जायसवाल की इस पारी की जमकर तारीफ हो रही है. विराट कोहली, हरभजन सिंह से लेकर सूर्यकुमार यादव तक, सभी ने यशस्वी की पारी की तारीफ की है. जायसवाल ने आईपीएल इतिहास की सबसे तेज फिफ्टी लगाई. उन्होंने अर्धशतक के लिए मात्र 13 गेंदों का सामना किया. राजस्थान के युवा बल्लेबाज की इस पारी के बीसीसीआई सचिव जय शाह भी मरीद हो गए. उन्होंने सोशल मीडिया के जरिए यशस्वी की जमकर तारीफ की. जय शाह ने ट्विटर पर लिखा, \"युवा यशस्वी जायसवाल ने सबसे तेज आईपीएल अर्धशतक बनाने के लिए एक विशेष पारी खेली. उन्होंने अपने खेल के प्रति जबरदस्त धैर्य और जुनून दिखाया है. इतिहास हासिल करने के लिए.\" बधाई हो. आप भविष्य में भी इस बेहतरीन फॉर्म को जारी रख सकते हैं.\" शाह के इस ट्वीट के बाद सोशल मीडिया पर फैंस का कहना है कि यशस्वी जल्द ही इंटरनेशनल डेब्यू कर सकते हैं. वहीं, टीम इंडिया के पूर्व हेड कोच रवि शास्त्री ने कहा कि यशस्वी जायसवाल के टीम इंडिया के लिए खेलने का समय आ गया है.   A special knock by young @ybj_19 for hitting the fastest IPL fifty. He has shown tremendous grit and passion towards his game. Congratulations on achieving history. May you continue this fine form in future. #TATAIPL2023 — Jay Shah (@JayShah) May 11, 2023 बता दें कि यशस्वी ने आईपीएल 2023 में अब तक 12 मैच खेले हैं. इस दौरान 12 पारियों में उन्होंने 52.27 की औसत और 167.15 के स्ट्राइक रेट से 575 रन बनाए हैं. मौजूदा सीजन में अब तक वह 4 अर्धशतक और 1 शतक लगा चुके हैं. उनका सर्वाधिक स्कोर 124 रन है. ऑरेंज कैप की लिस्ट में यशस्वी दूसरे पायदान पर हैं. टॉप पर आरसीबी के कप्तान फाफ डूप्लेसिस हैं, जिन्होंने 11 मैच की 11 पारियों में 576 रन बनाए हैं.  ये भी पढ़ें:  IPL 2023: यशस्वी को लेकर पूर्व खिलाड़ी का बयान, कहा- 'मैं होता सिलेक्टर तो वर्ल्ड कप टीम में करता शामिल'","content":null,"pubDate":"2023-05-12 13:07:42","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/05/12/ad22c48be32ade345c0895578a86bc231683896383158430_original.jpg","source_id":"abplive","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Pakistan demands neutral World Cup venues in row with India","link":"https://www.dialoguepakistan.com/pakistan-demands-neutral-world-cup-venues-in-row-with-india/","keywords":["Sports","cricket","Dont Miss","Pakistan","Vanue"],"creator":["AFP"],"video_url":null,"description":"New Delhi, India: The chairman of Pakistan’s cricket board is demanding his side’s World Cup games are moved out of host country India if their arch-rivals refuse to travel to Pakistan for September’s Asia Cup, a report said Friday. Arrangements for the one-day international World Cup, which is due to start in October, remain shrouded in […] The post <strong>Pakistan demands neutral World Cup venues in row with India</strong> appeared first on Dialogue Pakistan.","content":"Arrangements for the one-day international World Cup, which is due to start in October, remain shrouded in mystery, with the Board of Control for Cricket in India (BCCI) so far failing to release a match schedule or list of venues. It is an extraordinary situation less than six months before the start of a quadrennial global sporting tournament. How to accommodate Pakistan appears to be at the heart of the delay, with the nuclear-armed neighbours — both of them cricket-obsessed, but who have fought multiple wars since independence from Britain in 1947 — mired in diplomatic disputes. Pakistan is itself hosting the Asia Cup, another 50-over tournament, in September, in which India normally participates. But the BCCI — the world’s richest and most powerful cricket body — has refused to travel to Pakistan for several years citing both the diplomatic tensions and the country’s challenging security situation. It wants its Asia Cup games moved out of Pakistan — and Pakistan Cricket Board chairman Najam Sethi demanded a reciprocal arrangement for the World Cup in an interview with The Indian Express newspaper on Friday. “If India now wants to have a neutral venue and accepts the hybrid model, then we’ll use the same hybrid model in the World Cup,” he said. Pakistan would be willing to play their World Cup games in Bangladesh or any other venue acceptable to India, he said, calling it “a model that goes forward and resolves this political logjam” between the two countries. The BCCI is headed by Jay Shah, the son of India’s powerful home minister Amit Shah. But Sethi, a former journalist turned cricket administrator, called on the Indian cricket body to “stand up” to New Delhi and insist on being allowed to travel to Pakistan as “it cannot cite security as an issue anymore”. There was no immediate reaction from the BCCI to Sethi’s comments.","pubDate":"2023-05-12 12:11:21","image_url":null,"source_id":"dialoguepakistan","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"Keemo Paul returns as West Indies name World Cup Qualifier squad","link":"https://a-sports.tv/keemo-paul-returns-west-indies-name-world-cup-qualifier-squad/","keywords":["Cricket","Sports","Top News","Top Picks","Uncategorized","Keemo Paul","West Indies","West Indies squad","West Indies World Cup Qualifier Squad","World Cup Qualifier"],"creator":["A Sports"],"video_url":null,"description":"West Indies have recalled bowling all-rounder Keemo Paul as the side announced their 15-member squad on Friday for the ICC ODI World Cup Qualifier, scheduled from June 18 to July 9 in Zimbabwe. Paul, who last played an ODI level back in July last year, was named in the squad along with left-arm spinner Gudakesh […] The post Keemo Paul returns as West Indies name World Cup Qualifier squad appeared first on ASports.tv.","content":"West Indies have recalled bowling all-rounder Keemo Paul as the side announced their 15-member squad on Friday for the ICC ODI World Cup Qualifier, scheduled from June 18 to July 9 in Zimbabwe. Paul, who last played an ODI level back in July last year, was named in the squad along with left-arm spinner Gudakesh Motie, who performed well in Zimbabwe during the West Indies Test tour earlier in the year. “Paul is a three-dimensional player, who can bowl the new ball effectively, he’s dynamic in the outfield and he can also make vital runs.” said lead West Indies selector Desmond Haynes “We see him as a potential match-winner for us.” Finishing ninth on the Cricket World Cup League standings, West Indies were compelled to play the Qualifier to earn a spot in the main event, scheduled later this year in India, South Africa, bagged the automatic place to the ODI World Cup this week after the first ODI between Bangladesh and Ireland was abandoned due to rain. The West Indies also went through the Qualifier in 2018 to secure a spot in 2019 Cricket World Cup in England and finished top of the Super Six group to confirm their place. As part of their preparation for the World Cup Qualifier, West Indies will play a three-match ODI series in Sharjah against hosts and tournament competitors UAE next month. Shai Hope will captain the side in both assignments. Brandon King will be his deputy for the UAE series, while T20I captain Rovman Powell, who is currently busy playing IPL, will serve as vice-captain for the World Cup Qualifier. Squad for World Cup Qualifier: Shai Hope (capt), Rovman Powell (vice-capt), Shamarh Brooks, Yannic Cariah, Keacy Carty, Roston Chase, Jason Holder, Akeal Hosein, Alzarri Joseph, Brandon King, Kyle Mayers, Gudakesh Motie, Keemo Paul, Nicholas Pooran, Romario Shepherd Squad for UAE series: Shai Hope (capt), Brandon King (vice-capt), Alick Athanaze, Shamarh Brooks, Yannic Cariah, Keacy Carty, Roston Chase, Dominic Drakes, Kavem Hodge, Akeem Jordan, Gudakesh Motie, Keemo Paul, Raymon Reifer, Odean Smith, Devon Thomas READ: David Miller opts for Babar’s cover drive over Kohli’s   The post Keemo Paul returns as West Indies name World Cup Qualifier squad appeared first on ASports.tv.","pubDate":"2023-05-12 11:36:12","image_url":null,"source_id":"arynews","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"Former PCB chairman says increasing India’s share of ICC earnings makes ‘no sense’","link":"https://thefrontierpost.com/former-pcb-chairman-says-increasing-indias-share-of-icc-earnings-makes-no-sense/","keywords":["Sports"],"creator":["The Frontier Post"],"video_url":null,"description":"Monitoring Desk LAHORE: Former chairman of the Pakistan Cricket Board (PCB) Ehsan Mani is concerned about international cricket’s health following revelations that India would receive a significant share from the International Cricket Council’s (ICC) media rights deal for 2024-27, which is worth $3 billion. The Board of Control for Cricket in India (BCCI) is set […]","content":"Monitoring Desk LAHORE: Former chairman of the Pakistan Cricket Board (PCB) Ehsan Mani is concerned about international cricket’s health following revelations that India would receive a significant share from the International Cricket Council’s (ICC) media rights deal for 2024-27, which is worth $3 billion. The Board of Control for Cricket in India (BCCI) is set to receive 38.5% of the net surplus earnings from the ICC which is much higher compared to its 22% share in the current 2015-23 deal, according to ESPNcricinfo. “The (proposed revenue distribution model) will be giving the most money to the country that needs it the least, which makes no sense,” Mani, who was ICC president from 2003-06 and stepped down from the Pakistan Cricket Board in 2021, told Forbes in an exclusive interview. “I think it’s very unfortunate. There’s no strategic thinking about the development of the global game. There’s no vision.” Mani also stated that cricket should grow beyond its traditional base rather than just relying on India. “It only takes one downturn in an economic cycle for the ICC members to be affected. There is far too much reliance on India,” he said. “If the ICC wants a truly global game and diversify its financial reliance, the country to develop is the US I would have put $20-30 million into the US You also need to grow the game in Africa, that’s the future. “I think the global game (Associates) should have been allocated at least 30% (instead of 11%). That’s the only way to globalise the game.” Mani also called for financial parity among the 12 full members of the ICC rather than giving the lion’s share to India. “You have to give countries enough resources to not only develop their players but to pay them a fair amount, especially with the IPL and other T20 leagues targeting players,” he said. “The Indian market brings in a lot of money…it’s not the BCCI (India’s governing body). There are benefits to the Indian companies to advertise in the ICC events and worldwide. India are not playing on their own, they are playing against other members. It’s a two-way street.”","pubDate":"2023-05-12 17:13:29","image_url":null,"source_id":"thefrontierpost","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"IPL 2023: राशिद खान की खतरनाक बॉलिंग के आगे फेल हुए मुंबई इंडियंस के ओपनर्स, एक ही ओवर में भेजा पवेलियन","link":"https://www.abplive.com/sports/cricket/rashid-khan-took-wickets-of-ishan-kishan-and-rohit-sharma-in-same-over-ipl-2023-mi-vs-gt-2406389","keywords":["Cricket"],"creator":["ABP Live"],"video_url":null,"description":"MI vs GT, IPL 2023, Mumbai Indians, Gujarat Titans: मुंबई के वानखेड़े स्टेडियम में आज आईपीएल 2023 का 57वां मुकाबला खेला जा रहा है. मुंबई इंडियंस और गुजरात टाइटंस के बीच खेले जा रहे इस मैच में हार्दिक ने टॉस जीतकर पहले गेंदबाजी करने का फैसला लिया है. पहले बल्लेबाजी करने उतरी मुंबई इंडियंस को अच्छी शुरुआत मिली. रोहित शर्मा और ईशान किशन ने पावरप्ले में मिलकर 61 रन जोड़े. हालांकि इसके बाद राशिद खान ने गुजरात टाइटंस की वापसी करा दी.  रोहित ने बनाए 29 रन 7वें ओवर में गुजरात टाइटंस के दिग्गज स्पिनर ने मुंबई की सलामी जोड़ी को पवेलियन भेज दिया. ओवर की पहली गेंद पर राशिद ने रोहित शर्मा को राहुल तेवतिया के हाथों कैच आउट कराया. रोहित ने 18 गेंदों पर 29 रन बनाए. अपनी इस पारी में उन्होंने 3 चौके और 2 छक्के जड़ें. राशिद की आफ स्टंप की लाइन में गुड लेंथ गेंद रोहित के बल्ले का किनारा लेकर सीधे स्लिप पर तैनात तेवतिया के हाथों में जा पहुंची. ईशान ने बनाए 31 रन इसी ओवर की 5वीं गेंद पर राशिद ने गुजरात को दूसरी सफलता दिलाई. उन्होंने ताबड़तोड़ बल्लेबाजी कर रहे ईशान किशन को एलबीडल्यू आउट किया. उन्होंने 20 गेंदों पर 31 रन की पारी खेली. अपनी इस पारी में उन्होंने 4 चौके और 1 छक्का लगाया. राशिद की गेंद ईशान के पैड्स पर लगी और सीधी रह गई. स्वीप की कोशिश कर रहे किशन पूरी तरह से चूक गए और गेंद सीधे पैड्स पर लगी. अंपायर ने उंगली खड़ी कर दी. मुंबई का तीसरा विकेट भी राशिद ने ही चटकाया. उन्होंने नेहल वढेरा को बोल्ड किया. वढेरा ने 7 गेंदों पर 15 रन बनाए.   Rohit Sharma ✅Ishan Kishan ✅@rashidkhan_19 dismissed both #MI openers in the same overFollow the Match: https://t.co/o61rmJWtC5#TATAIPL | #MIvGT | @gujarat_titans pic.twitter.com/iW2PX7Q9fA — IndianPremierLeague (@IPL) May 12, 2023 ये भी पढ़ें:  IPL 2023: जब अनुष्का शर्मा से बात कर फूट-फूटकर रोए थे विराट, किंग कोहली ने बताया कौन सा था वो पल IPL 2023: यशस्वी जायसवाल की जल्द हो सकती है टीम इंडिया में एंट्री, जय शाह के इस ट्वीट से मिल रहे संकेत!","content":"MI vs GT, IPL 2023, Mumbai Indians, Gujarat Titans: मुंबई के वानखेड़े स्टेडियम में आज आईपीएल 2023 का 57वां मुकाबला खेला जा रहा है. मुंबई इंडियंस और गुजरात टाइटंस के बीच खेले जा रहे इस मैच में हार्दिक ने टॉस जीतकर पहले गेंदबाजी करने का फैसला लिया है. पहले बल्लेबाजी करने उतरी मुंबई इंडियंस को अच्छी शुरुआत मिली. रोहित शर्मा और ईशान किशन ने पावरप्ले में मिलकर 61 रन जोड़े. हालांकि इसके बाद राशिद खान ने गुजरात टाइटंस की वापसी करा दी. रोहित ने बनाए 29 रन 7वें ओवर में गुजरात टाइटंस के दिग्गज स्पिनर ने मुंबई की सलामी जोड़ी को पवेलियन भेज दिया. ओवर की पहली गेंद पर राशिद ने रोहित शर्मा को राहुल तेवतिया के हाथों कैच आउट कराया. रोहित ने 18 गेंदों पर 29 रन बनाए. अपनी इस पारी में उन्होंने 3 चौके और 2 छक्के जड़ें. राशिद की आफ स्टंप की लाइन में गुड लेंथ गेंद रोहित के बल्ले का किनारा लेकर सीधे स्लिप पर तैनात तेवतिया के हाथों में जा पहुंची. ईशान ने बनाए 31 रन googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); इसी ओवर की 5वीं गेंद पर राशिद ने गुजरात को दूसरी सफलता दिलाई. उन्होंने ताबड़तोड़ बल्लेबाजी कर रहे ईशान किशन को एलबीडल्यू आउट किया. उन्होंने 20 गेंदों पर 31 रन की पारी खेली. अपनी इस पारी में उन्होंने 4 चौके और 1 छक्का लगाया. राशिद की गेंद ईशान के पैड्स पर लगी और सीधी रह गई. स्वीप की कोशिश कर रहे किशन पूरी तरह से चूक गए और गेंद सीधे पैड्स पर लगी. अंपायर ने उंगली खड़ी कर दी. मुंबई का तीसरा विकेट भी राशिद ने ही चटकाया. उन्होंने नेहल वढेरा को बोल्ड किया. वढेरा ने 7 गेंदों पर 15 रन बनाए. Rohit Sharma ✅ Ishan Kishan ✅ @rashidkhan_19 dismissed both #MI openers in the same over Follow the Match: https://t.co/o61rmJWtC5 #TATAIPL | #MIvGT | @gujarat_titans pic.twitter.com/iW2PX7Q9fA — IndianPremierLeague (@IPL) May 12, 2023 ये भी पढ़ें: IPL 2023: जब अनुष्का शर्मा से बात कर फूट-फूटकर रोए थे विराट, किंग कोहली ने बताया कौन सा था वो पल IPL 2023: यशस्वी जायसवाल की जल्द हो सकती है टीम इंडिया में एंट्री, जय शाह के इस ट्वीट से मिल रहे संकेत!","pubDate":"2023-05-12 16:57:01","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/05/12/b32a8fe4e6fcb8571ba8fa1503c2d1e71683904531412430_original.jpg","source_id":"abplive","category":["sports"],"country":["india"],"language":"hindi"},{"title":"If India doesn't come to Pakistan, we will not be going to India for World Cup: PCB chief Najam Sethi","link":"https://economictimes.indiatimes.com/news/sports/if-india-doesnt-come-to-pakistan-we-will-not-be-going-to-india-for-world-cup-pcb-chief-najam-sethi/articleshow/100192426.cms","keywords":null,"creator":null,"video_url":null,"description":"Pakistan Cricket Board chairman Najam Sethi has stated that the country will only travel to India for the ODI World Cup if India is allowed to play in the 2025 Champions Trophy and the upcoming Asia Cup in Pakistan. Sethi proposed a “hybrid model” which was rejected by the Asian Cricket Council and is waiting for a response.","content":"Synopsis Pakistan Cricket Board chairman Najam Sethi has stated that the country will only travel to India for the ODI World Cup if India is allowed to play in the 2025 Champions Trophy and the upcoming Asia Cup in Pakistan. Sethi proposed a “hybrid model” which was rejected by the Asian Cricket Council and is waiting for a response. We have asked ICC to provide us with full detail of ideas and formulas underlying this model. Pakistan Cricket Board chairman Najam Sethi on Friday made it clear that Pakistan will travel to India for the ODI World Cup only if the Rohit Sharma-led team is allowed to play the upcoming Asia Cup and the 2025 Champions Trophy in his country. The Asian Cricket Council ( ACC ) recently rejected the \" hybrid model \", which the former journalist feels is the only feasible solution until India and Pakistan start playing each other in their respective nations. Sethi also said that if India comes to Pakistan, their national team will have no issues playing in any Indian city, including Ahmedabad. Excepts from an exclusive interview with the PTI: Q: What is the status of Asia Cup and what is ACC's reaction to your proposed Hybrid Model? A: In the current scenario, we have made it clear that let's play four matches in Pakistan and we will play the rest of the games at neutral venue which we can mutually agree upon. The Asian Cricket Council can take two decisions. Either they can say 'Okay, let's go ahead and issue the schedule' according to my proposal or they can say 'No, we want to play all the matches at neutral venue'. If they take the first position, everything will be sorted out and we will get cracking. If they take the second position, then I am afraid we won't participate in Asia Cup. That is the current position. We are waiting for response from Mr Jay Shah and other colleagues. Q: Does it make sense for Pakistan to stay in ACC if they don't play Asia Cup? A: That is for Asian Cricket Council to consider. The next turn for Asian Cricket Council presidency belongs to PCB . That's our turn. So we are very keen to stay in Asian Cricket Council. Let me go beyond that. There can't be any ACC without Pakistan. The two most important members who bring revenue to ACC are India and Pakistan. It's their matches that bring 80 percent of the broadcast rights. If Pakistan doesn't play Asia Cup, then the broadcaster, that is Star, is going to have problems. The 45 or 46 million dollars that are supposed to come for the series (Asia Cup) is mostly going to come from these matches and the way Asia Cup is structured, Pakistan and India play two matches minimum and if they qualify for final, there is a third match. That's why India and Pakistan are both critical to the cup and to the council. Therefore it must be mentioned that in Bahrain at last ACC meeting, I had presented the hybrid model to save the Asia Cup as India had refused to play in Pakistan, which is the host country, that's where the problem arose. I had said, one solution is I will find neutral venue for India games. The BCB president had then said, option of Pakistan not playing Asia Cup is ruled out. If India comes to Pakistan, the crowds will be hospitable but if India doesn't come and gives no rational reason for not coming to Pakistan, when the whole world is coming to Pakistan, then this is the solution I have in mind. We will play India at a neutral venue but rest of the countries must come and play their matches in Pakistan. We have gone so far to say play only four games in Pakistan and play rest of the games in the neutral venue. So we have given solution for not just one issue but also for World Cup and Champions Trophy (in Pakistan in 2025). Because if we don't go to India and play there's going to be a problem. And if India doesn't come to Pakistan for Champions Trophy (2025), then there's problem. Q: India not going to Pakistan is due to political tension but after former Prime Minister Imran Khan's arrest, don't you think other teams will be wary of going to Pakistan in current security situation? A: Imran Khan's protest situation is going on for six months. The New Zealand national team was playing in Rawalpindi, Lahore, Karachi when Imran Khan's protest was going on. So that's not an issue. The security provided to these teams are VVIP presidential security and it overrides everything else. If there is a bit of hiccup in Islamabad, you mean you can't have cricket in Pindi, Multan, Lahore or Karachi? No it doesn't mean that. Let me go further. This is the month of May and we are talking about Asia Cup in September. Give me a break. Are you saying in September, Pakistan will be up in flames and won't be able to play cricket. Well, then why not wait for September and see what happens. \"If situation is such, that security can't be provided to teams, I will be first one to say, let's move it to a neutral venue for all the matches. Do you think, we want our honourable guests to face riots in Pakistan? No, we don't. We care for them. Please allow us to be responsible. Q: Why can't Ahmedabad be a venue for India vs Pakistan match as Pakistan played at that very venue in 2005? A: I have never said that. All I have said is that no one from the BCCI has asked us anything about Ahmedabad. For some strange reason, this is putting cart before the horse. You are asking me whether we will play in Ahmedabad or not but I am telling you, the real question is whether we will play in India or not? We will play in India if India plays in Pakistan. But if India doesn't play in Pakistan, why should we play in India? So my solution was, let India vs Pakistan matches be played at neutral venue. That's all. You can't have your cake and eat it too. Now coming to Ahmedabad, if India comes to Pakistan, we will provide VVIP security at every venue and I dare say, we go India on reciprocal terms, if India asks us to play in Ahmedadbad in reciprocal terms, we will have no problems. We will play wherever they want us to play because we expect them to provide us the security that is needed just as India would want us to provide them with security at any venue if India were to play in Pakistan. So Ahmedabad is frankly not an issue. Let's first resolve India and Pakistan playing in each other's countries. Q: If the ACC agrees to a four-match hybrid model, will Pakistan play in India as hybrid model in World Cup with Pakistan playing India in Bangladesh might not be a feasible solution? A: Look, the issue right now is the Asia Cup. I would like the hybrid model to work and succeed. It is a formula going forward for World Cup and Champions Trophy. Because if India refuses to come to Pakistan for the Champions Trophy, we will have a problem. If Pakistan refuses to go to India, there will be problem, won't we? The root cause is India not coming to Pakistan. So either we don't play at all or have a compromise while moving the ball forward. So lets have a solution. India and Pakistan going forward in all tournaments -- Asia Cup, World Cup, Champions Trophy will not play each other in each other's country. No big deal. The game will still go on. Q: In the ICC revenue model India gets around 38.5 percent. It's a proposal but do you agree with that? A: We have asked ICC to provide us with full detail of ideas and formulas underlying this model. The ICC has provided us with something that we want but not everything that we want. We are writing to ICC to provide us with assumptions underlying this model and formulas used to arrive at this model. It is not enough to tell us that these are the figures. As per ICC constitution, it is every member's right to know how things are done and how certain decisions are taken. We are awaiting those details and we will take it from there. Don’t miss out on ET Prime stories! Get your daily dose of business updates on WhatsApp. click here! Friday, 12 May, 2023 Experience Your Economic Times Newspaper, The Digital Way! Read Complete Print Edition » Front Page Pure Politics Brands & Companies Companies More On Watchlist: Govt Seeks to Tax Netflix Income in India India is seeking to tax Netflix Inc.’s income earned from streaming services in the country, people familiar with the matter said. It’s the first such move to tax overseas digital companies providing electronic commerce services to consumers in India, they said. PhonePe Will Likely go for an India Listing Walmart president and chief executive officer Doug McMillon has said the performance of its payments company PhonePe has seen a significant upside, and if it chooses to enter the ecommerce business, it won’t compete with sister company Flipkart as both will be focused on serving their own set of customers. Adani in Talks for $2-2.5b Stake Sales in 3 Group Cos Adani Group is in discussions with potential investors to raise $2-2.5 billion via share sales in Adani Enterprises, Adani Transmission and Adani Green Energy, said people aware of the matter. Read More News on acc Najam Sethi PCB World Cup Asian Cricket Council Hybrid Model (Catch all the Business News , Breaking News Events and Latest News Updates on The Economic Times .) Download The Economic Times News App to get Daily Market Updates & Live Business News. ... more less ETPrime stories of the day Strategy Stock Radar: Down over 50% from highs! Is MRPL a value pick at current levels? 4 mins read Payments Replicating UPI’s success abroad will be tough. (Think high card penetration, reluctant banks) 9 mins read Fossil fuels SBI fossil fuel lending falls, but an exclusion policy is nowhere in sight 3 mins read Subscribe to ETPrime","pubDate":"2023-05-12 15:47:43","image_url":"https://img.etimg.com/thumb/width-1200,imgsize-27580,resizemode-4,msid-100192426/if-india-doesnt-come-to-pakistan-we-will-not-be-going-to-india-for-world-cup-pcb-chief-najam-sethi.jpg","source_id":"economictimes_indiatimes","category":["sports"],"country":["india"],"language":"english"},{"title":"Cricket South Africa announces Wandile Gwavu as fielding coach for white-ball format","link":"https://thenewsmill.com/2023/05/cricket-south-africa-announces-wandile-gwavu-as-fielding-coach-for-white-ball-format/","keywords":["Cricket","Sports","ANI"],"creator":["ANI"],"video_url":null,"description":"The News Mill","content":null,"pubDate":"2023-05-12 15:34:09","image_url":null,"source_id":"thenewsmill","category":["sports"],"country":["india"],"language":"english"},{"title":"Coley and Sammy new WI head coaches","link":"https://www.nationnews.com/2023/05/12/coley-sammy-new-wi-head-coaches/","keywords":["Sports"],"creator":[""],"video_url":null,"description":null,"content":"Cricket West Indies (CWI) on Friday announced the appointments of the new Head Coaches for the West Indies Senior Men’s Teams. Andre Coley has been appointed Head Coach for the Test and ‘A’ Teams and Daren Sammy has been appointed the Head Coach for the white ball One Day International (ODI) and T20 International (T20I) Teams. The new Head Coaches were selected following an open and transparent interview process, and the appointments were confirmed following the CWI Board of Directors meeting on Thursday 11 May. Daren Sammy’s first assignment will be the three-match ODI Series against the United Arab Emirates (UAE) in Sharjah in June, ahead of the ICC Men’s World Cup 2023 Qualifier tournament in Zimbabwe. Andre Coley’s first assignment will be the two-match Test Series against India in the Caribbean in July. Sammy is a former West Indies captain in all three formats, who led the West Indies to the ICC T20 World Cup titles in 2012 and 2016. Since retirement, he has coached franchise teams in the Pakistan Super League and the Caribbean Premier League. Coley is a former Jamaica wicket-keeper/batsman who has coached at all levels in West Indies cricket. He was Interim Head Coach of the West Indies team on the tours of Zimbabwe and South Africa earlier this year with his most recent assignment as Head Coach of the West Indies Academy.(PR)","pubDate":"2023-05-12 15:17:28","image_url":null,"source_id":"nationnews","category":["sports"],"country":["Barbados"],"language":"english"},{"title":"County cricket: Jimmy Anderson misses Lancashire action with ‘minor issue’ – live","link":"https://www.theguardian.com/sport/live/2023/may/12/county-cricket-lancashire-v-somerset-surrey-v-middlesex-and-more-live","keywords":["County Championship","Cricket","County Championship Division One","County Championship Division Two","Lancashire","Yorkshire","Sussex","Hampshire","Somerset","Warwickshire","Durham","Kent","Derbyshire","Gloucestershire","Worcestershire","Northamptonshire","Essex","Nottinghamshire","Sport"],"creator":["Tanya Aldred at Old Trafford"],"video_url":null,"description":"Latest updates from around the grounds on day twoGet in touch: email Tanya, tweet or comment BTLJofra Archer: elbowOlly Stone: hamstring Continue reading...","content":null,"pubDate":"2023-05-12 15:06:49","image_url":"https://i.guim.co.uk/img/media/7d8a4e16229e13e49e4a692f81595897a4db162c/0_91_3500_2101/master/3500.jpg?width=460&quality=85&auto=format&fit=max&s=37cd1d12bee5d247cf398bdb467f94ab","source_id":"theguardian","category":["sports"],"country":["canada","united kingdom","india","singapore"],"language":"english"},{"title":"Pakistan demands neutral World Cup venues in row with India","link":"https://www.samaaenglish.tv/news/40034852/sports-pakistan-demands-neutral-world-cup-venues-in-row-with-india","keywords":["Sports"],"creator":null,"video_url":null,"description":"The chairman of Pakistan’s cricket board is demanding his side’s World Cup games are moved out of host country India if their arch-rivals refuse to travel to Pakistan for September’s Asia Cup, a report said Friday. Arrangements for the one-day international World Cup, which is due to start in October, remain shrouded in mystery, with the Board of Control for Cricket in India (BCCI) so far failing to release a match schedule or list of venues. It is an extraordinary situation less than six months before the start of a quadrennial global sporting tournament. How to accommodate Pakistan appears to be at the heart of the delay, with the nuclear-armed neighbours – both of them cricket-obsessed, but who have fought multiple wars since independence from Britain in 1947 – mired in diplomatic disputes. Pakistan is itself hosting the Asia Cup, another 50-over tournament, in September, in which India normally participates. But the BCCI – the world’s richest and most powerful cricket body – has refused to travel to Pakistan for several years citing both the diplomatic tensions and the country’s challenging security situation. It wants its Asia Cup games moved out of Pakistan – and Pakistan Cricket Board chairman Najam Sethi demanded a reciprocal arrangement for the World Cup in an interview with The Indian Express newspaper on Friday. “If India now wants to have a neutral venue and accepts the hybrid model, then we’ll use the same hybrid model in the World Cup,” he said. Pakistan would be willing to play their World Cup games in Bangladesh or any other venue acceptable to India, he said, calling it “a model that goes forward and resolves this political logjam” between the two countries. The BCCI is headed by Jay Shah, the son of India’s powerful home minister Amit Shah. But Sethi, a former journalist turned cricket administrator, called on the Indian cricket body to “stand up” to New Delhi and insist on being allowed to travel to Pakistan as “it cannot cite security as an issue anymore”. There was no immediate reaction from the BCCI to Sethi’s comments.","content":"Arrangements for the one-day international World Cup, which is due to start in October, remain shrouded in mystery, with the Board of Control for Cricket in India (BCCI) so far failing to release a match schedule or list of venues. It is an extraordinary situation less than six months before the start of a quadrennial global sporting tournament. How to accommodate Pakistan appears to be at the heart of the delay, with the nuclear-armed neighbours – both of them cricket-obsessed, but who have fought multiple wars since independence from Britain in 1947 – mired in diplomatic disputes. Pakistan is itself hosting the Asia Cup, another 50-over tournament, in September, in which India normally participates. But the BCCI – the world’s richest and most powerful cricket body – has refused to travel to Pakistan for several years citing both the diplomatic tensions and the country’s challenging security situation. It wants its Asia Cup games moved out of Pakistan – and Pakistan Cricket Board chairman Najam Sethi demanded a reciprocal arrangement for the World Cup in an interview with The Indian Express newspaper on Friday. “If India now wants to have a neutral venue and accepts the hybrid model, then we’ll use the same hybrid model in the World Cup,” he said. Pakistan would be willing to play their World Cup games in Bangladesh or any other venue acceptable to India, he said, calling it “a model that goes forward and resolves this political logjam” between the two countries. The BCCI is headed by Jay Shah, the son of India’s powerful home minister Amit Shah. But Sethi, a former journalist turned cricket administrator, called on the Indian cricket body to “stand up” to New Delhi and insist on being allowed to travel to Pakistan as “it cannot cite security as an issue anymore”. There was no immediate reaction from the BCCI to Sethi’s comments.","pubDate":"2023-05-12 13:17:47","image_url":"https://i.samaaenglish.tv/large/2023/05/12181725f7370e5.jpg?r=181747","source_id":"samaaenglish","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"IPL 2023: यशस्वी जायसवाल की जल्द हो सकती है टीम इंडिया में एंट्री, जय शाह के इस ट्वीट से मिल रहे संकेत!","link":"https://www.abplive.com/sports/cricket/jai-shah-praised-yashasvi-jaiswal-kkr-vs-rr-ipl-2023-rajasthan-royals-2406300","keywords":["Cricket"],"creator":["ABP Live"],"video_url":null,"description":"KKR vs RR, IPL 2023, Yashasvi Jaiswal, Jay Shah: आईपीएल 2023 के 56वें मुकाबले में गुरुवार को राजस्थान रॉयल्स ने कोलकाता नाइटराइडर्स को 9 विकेट से मात दी. कोलकाता के ईडन गॉर्डन में खेले गए इस मैच में KKR ने टॉस हारकर पहले बल्लेबाजी करते हुए 20 ओवर में 8 विकेट खोकर 149 रन बनाए. जवाब में राजस्थान ने यशस्वी की पारी की बदौलत 13.1 ओवर में 1 विकेट खोकर 151 रन बनाए और 9 विकेट से मैच को जीत लिया. सलामी बल्लेबाजी यशस्वी जायसवाल शतक से चूक गए. वह 47 गेंदों पर 98 रन बनाकर नाबाद रहे. अपनी इस पारी में उन्होंने 13 चौके और 5 छक्के लगाए. उन्हें प्लेयर ऑफ द चुना गया. जायसवाल की इस पारी की जमकर तारीफ हो रही है. विराट कोहली, हरभजन सिंह से लेकर सूर्यकुमार यादव तक, सभी ने यशस्वी की पारी की तारीफ की है. जायसवाल ने आईपीएल इतिहास की सबसे तेज फिफ्टी लगाई. उन्होंने अर्धशतक के लिए मात्र 13 गेंदों का सामना किया. राजस्थान के युवा बल्लेबाज की इस पारी के बीसीसीआई सचिव जय शाह भी मरीद हो गए. उन्होंने सोशल मीडिया के जरिए यशस्वी की जमकर तारीफ की. जय शाह ने ट्विटर पर लिखा, \"युवा यशस्वी जायसवाल ने सबसे तेज आईपीएल अर्धशतक बनाने के लिए एक विशेष पारी खेली. उन्होंने अपने खेल के प्रति जबरदस्त धैर्य और जुनून दिखाया है. इतिहास हासिल करने के लिए.\" बधाई हो. आप भविष्य में भी इस बेहतरीन फॉर्म को जारी रख सकते हैं.\" शाह के इस ट्वीट के बाद सोशल मीडिया पर फैंस का कहना है कि यशस्वी जल्द ही इंटरनेशनल डेब्यू कर सकते हैं. वहीं, टीम इंडिया के पूर्व हेड कोच रवि शास्त्री ने कहा कि यशस्वी जायसवाल के टीम इंडिया के लिए खेलने का समय आ गया है.   A special knock by young @ybj_19 for hitting the fastest IPL fifty. He has shown tremendous grit and passion towards his game. Congratulations on achieving history. May you continue this fine form in future. #TATAIPL2023 — Jay Shah (@JayShah) May 11, 2023 बता दें कि यशस्वी ने आईपीएल 2023 में अब तक 12 मैच खेले हैं. इस दौरान 12 पारियों में उन्होंने 52.27 की औसत और 167.15 के स्ट्राइक रेट से 575 रन बनाए हैं. मौजूदा सीजन में अब तक वह 4 अर्धशतक और 1 शतक लगा चुके हैं. उनका सर्वाधिक स्कोर 124 रन है. ऑरेंज कैप की लिस्ट में यशस्वी दूसरे पायदान पर हैं. टॉप पर आरसीबी के कप्तान फाफ डूप्लेसिस हैं, जिन्होंने 11 मैच की 11 पारियों में 576 रन बनाए हैं.  ये भी पढ़ें:  IPL 2023: यशस्वी को लेकर पूर्व खिलाड़ी का बयान, कहा- 'मैं होता सिलेक्टर तो वर्ल्ड कप टीम में करता शामिल'","content":null,"pubDate":"2023-05-12 13:07:42","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/05/12/ad22c48be32ade345c0895578a86bc231683896383158430_original.jpg","source_id":"abplive","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Pakistan demands neutral World Cup venues in row with India","link":"https://www.dialoguepakistan.com/pakistan-demands-neutral-world-cup-venues-in-row-with-india/","keywords":["Sports","cricket","Dont Miss","Pakistan","Vanue"],"creator":["AFP"],"video_url":null,"description":"New Delhi, India: The chairman of Pakistan’s cricket board is demanding his side’s World Cup games are moved out of host country India if their arch-rivals refuse to travel to Pakistan for September’s Asia Cup, a report said Friday. Arrangements for the one-day international World Cup, which is due to start in October, remain shrouded in […] The post <strong>Pakistan demands neutral World Cup venues in row with India</strong> appeared first on Dialogue Pakistan.","content":"Arrangements for the one-day international World Cup, which is due to start in October, remain shrouded in mystery, with the Board of Control for Cricket in India (BCCI) so far failing to release a match schedule or list of venues. It is an extraordinary situation less than six months before the start of a quadrennial global sporting tournament. How to accommodate Pakistan appears to be at the heart of the delay, with the nuclear-armed neighbours — both of them cricket-obsessed, but who have fought multiple wars since independence from Britain in 1947 — mired in diplomatic disputes. Pakistan is itself hosting the Asia Cup, another 50-over tournament, in September, in which India normally participates. But the BCCI — the world’s richest and most powerful cricket body — has refused to travel to Pakistan for several years citing both the diplomatic tensions and the country’s challenging security situation. It wants its Asia Cup games moved out of Pakistan — and Pakistan Cricket Board chairman Najam Sethi demanded a reciprocal arrangement for the World Cup in an interview with The Indian Express newspaper on Friday. “If India now wants to have a neutral venue and accepts the hybrid model, then we’ll use the same hybrid model in the World Cup,” he said. Pakistan would be willing to play their World Cup games in Bangladesh or any other venue acceptable to India, he said, calling it “a model that goes forward and resolves this political logjam” between the two countries. The BCCI is headed by Jay Shah, the son of India’s powerful home minister Amit Shah. But Sethi, a former journalist turned cricket administrator, called on the Indian cricket body to “stand up” to New Delhi and insist on being allowed to travel to Pakistan as “it cannot cite security as an issue anymore”. There was no immediate reaction from the BCCI to Sethi’s comments.","pubDate":"2023-05-12 12:11:21","image_url":null,"source_id":"dialoguepakistan","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"Keemo Paul returns as West Indies name World Cup Qualifier squad","link":"https://a-sports.tv/keemo-paul-returns-west-indies-name-world-cup-qualifier-squad/","keywords":["Cricket","Sports","Top News","Top Picks","Uncategorized","Keemo Paul","West Indies","West Indies squad","West Indies World Cup Qualifier Squad","World Cup Qualifier"],"creator":["A Sports"],"video_url":null,"description":"West Indies have recalled bowling all-rounder Keemo Paul as the side announced their 15-member squad on Friday for the ICC ODI World Cup Qualifier, scheduled from June 18 to July 9 in Zimbabwe. Paul, who last played an ODI level back in July last year, was named in the squad along with left-arm spinner Gudakesh […] The post Keemo Paul returns as West Indies name World Cup Qualifier squad appeared first on ASports.tv.","content":"West Indies have recalled bowling all-rounder Keemo Paul as the side announced their 15-member squad on Friday for the ICC ODI World Cup Qualifier, scheduled from June 18 to July 9 in Zimbabwe. Paul, who last played an ODI level back in July last year, was named in the squad along with left-arm spinner Gudakesh Motie, who performed well in Zimbabwe during the West Indies Test tour earlier in the year. “Paul is a three-dimensional player, who can bowl the new ball effectively, he’s dynamic in the outfield and he can also make vital runs.” said lead West Indies selector Desmond Haynes “We see him as a potential match-winner for us.” Finishing ninth on the Cricket World Cup League standings, West Indies were compelled to play the Qualifier to earn a spot in the main event, scheduled later this year in India, South Africa, bagged the automatic place to the ODI World Cup this week after the first ODI between Bangladesh and Ireland was abandoned due to rain. The West Indies also went through the Qualifier in 2018 to secure a spot in 2019 Cricket World Cup in England and finished top of the Super Six group to confirm their place. As part of their preparation for the World Cup Qualifier, West Indies will play a three-match ODI series in Sharjah against hosts and tournament competitors UAE next month. Shai Hope will captain the side in both assignments. Brandon King will be his deputy for the UAE series, while T20I captain Rovman Powell, who is currently busy playing IPL, will serve as vice-captain for the World Cup Qualifier. Squad for World Cup Qualifier: Shai Hope (capt), Rovman Powell (vice-capt), Shamarh Brooks, Yannic Cariah, Keacy Carty, Roston Chase, Jason Holder, Akeal Hosein, Alzarri Joseph, Brandon King, Kyle Mayers, Gudakesh Motie, Keemo Paul, Nicholas Pooran, Romario Shepherd Squad for UAE series: Shai Hope (capt), Brandon King (vice-capt), Alick Athanaze, Shamarh Brooks, Yannic Cariah, Keacy Carty, Roston Chase, Dominic Drakes, Kavem Hodge, Akeem Jordan, Gudakesh Motie, Keemo Paul, Raymon Reifer, Odean Smith, Devon Thomas READ: David Miller opts for Babar’s cover drive over Kohli’s   The post Keemo Paul returns as West Indies name World Cup Qualifier squad appeared first on ASports.tv.","pubDate":"2023-05-12 11:36:12","image_url":null,"source_id":"arynews","category":["sports"],"country":["pakistan"],"language":"english"}]}