{"newsArray":[{"title":"Aussie cricket photo really not a good look","link":"https://www.cairnspost.com.au/sport/cricket/photo-of-aussie-cricket-players-not-a-good-look-right-now/news-story/036d8f06fff134827600e5feead2c242","keywords":["Cricket news and galleries","Sport news and galleries"],"creator":null,"video_url":null,"description":"A photo of Aussie cricketers sharing a laugh in the middle of Australia’s second innings trainwreck has been raising eyebrows.","content":"Cricket Don't miss out on the headlines from Cricket. Followed categories will be added to My News. A photo of Aussie cricketers sharing a laugh in the middle of Australia’s second innings trainwreck has been raising eyebrows. There has been an angry response from Aussie cricket fans after the tourists suffered a record breaking defeat of an innings and 132 runs in the First Test in Nagpur. Selectors have been the primary target of the social media backlash following the extraordinary decision to axe Travis Head, but it is now the Aussie dressing room itself that is facing the social media firing squad after the side was dismissed for just 91 in the second innings. Watch Australia’s Tour of India. Every Test & ODI live & ad-break free during play on Kayo. New to Kayo? Start your free trial now > The Aussie team’s attitude is now up for debate after Allan Border said on Day 3 Australia needs to play with a “harder edge” after watching Steve Smith give a thumbs up to India’s bowlers as they beat the bat. It’s why the photo of Aussie players smiling in the middle of the bloodbath is a particularly bad look as the playing group continues to face criticism over the so-called knifing of former coach Justin Langer. The former mentor was famously unapologetic for his intense, demanding leadership style and his drive to instil greater fight in his players. Fox Cricket cameras broadcast live footage of Aussie stars, including Matt Renshaw, Cameron Green, Ashton Agar and Lance Morris, all laughing on the sideline just moments after Australia had lost its seventh wicket. Matt Renshaw was spotted having a chuckle. Photo: Kayo. Renshaw’s contrbutions during the Test were a golden duck in the first innings and a score of two in the second innings. TV sport presenter Adam Hawse was among those to criticise the Aussie players for the poor look. “Wouldn’t have thought there’s too much to chuckle about. This is a hammering,” he wrote on Twitter. One fan wrote on Twitter: “Seeing this photo really annoys me!! You’re getting flogged but it’s ok to joke and laugh. It would never had happened in Allan Border/Bob Simpson reign”. Pat Cummins sounded devastated in his post-match interviews, but was also seen smiling at the start of the official post-match press conference. Earlier this summer, Sydney Thunder players were also criticised for smiling and sharing jokes in the aftermath of their historic total of just 15 runs. The Thunder recovered to qualify for the BBL finals. Pat Cummins after the Aussies were put out of their misery. Photo by Robert Cianflone/Getty Images. Border had earlier been scathing of the team’s meek collapse. He said the Australians “should be embarrassed by that performance”. “It’s just basic batting technique, we’re just struggling in these conditions, it’s as simple as that,” Border said. “Sometimes I feel we just overthought this particular tour, who should be there, who shouldn’t be there. I think Travis Head (being dropped) is the perfect example that it was chaos before it ever started.” He said of Smith’s friendly interactions with Indian players: “Play with a harder edge. I mean, we’re giving blokes the thumbs up when they’re beating us outside the off stump. “What the hell is going on? That is just ridiculous. Don’t go stupid but Australia play hard-nosed cricket. “We’re even giving someone thumbs up who’s beaten you outside the off-stump, bloody hell.” There was also criticism directed at Aussie officials for the optics coming out of the inner sanctum on the final day of the Test. More Coverage Storm erupts over two words from Test great Indian star found ‘guilty’ amid cream scandal National selector Tony Dodemaide was seen smiling away during conversations with Aussie players, something that has rubbed some the wrong way. There are expected to be several changes made to the Aussie side for the second Test, which begins Friday. Originally published as Photo of Aussie cricket players not a good look right now More related stories Cricket Aussies lose another bowler as bolter’s stocks rise Australia is set to lose another bowler from its squad, enhancing the chances of a shock inclusion from a spinner who will answer an SOS. Read more Cricket Have your say: Every Aussie rated after Nagpur nightmare Australia were embarrassed by India in the first Test in Nagpur, but how would you rate each player’s performance? HAVE YOUR SAY. Read more","pubDate":"2023-02-12 03:10:00","image_url":null,"source_id":"cairnspost","category":["sports"],"country":["australia"],"language":"english"},{"title":"Warner’s position under threat as Australia considers three spinners for second Test","link":"https://www.watoday.com.au/sport/cricket/warner-s-position-under-threat-as-australia-considers-three-spinners-for-second-test-20230212-p5cjuw.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Malcolm Conn"],"video_url":null,"description":"Australia’s cricket hierarchy will discuss replacing David Warner with Travis Head while Queensland spinner Matt Kuhnemann is flying in as a possible shock selection.","content":"Australia may replace David Warner with Travis Head at the top of the order as they consider changes among the wreckage of an innings first Test defeat in Nagpur. Queensland left arm finger spinner Matt Kuhnemann is also a chance to play his first Test after being summoned to India as a replacement for reserve leg-spinner Mitch Swepson, who is returning home for the birth of his child. Kuhnemann, 26, would be a shock selection but he is being considered as a potential third spinner if Cameron Green is fit and the pitch for the second Test in Delhi also aids spinners, as expected. A shock axing for the first Test, Head has been discussed as a possible opening batsman in the subcontinent, where he has struggled in the middle order on previous tours. Sources close to the Australian team confirmed those discussions were continuing after Warner’s double failure in the first Test. Australia lost by an innings and 132 runs inside three days after being bowled out for just 91 in their second innings on Saturday, their lowest score on Indian soil. Most Australian batsmen were completely bamboozled by exceptional Indian spinners Ravi Ashwin and Ravi Jadeja, who claimed 15 of the 20 wickets between them on a helpful surface. David Warner walks back to pavilion after his dismissal during the third day. Credit: AP However it was the way that Warner failed which has raised most concerns, playing late on a ball from Mohammed Shami to lose his off stump for one 13 balls into the Test, then rooted to the crease in the second innings before being trapped lbw for 10 from 41 balls by Ashwin. Warner had a cluttered, and topsy-turvy, home season with some beacons amid the gloom. He had a top score of just 25 in four T20 World Cup innings as Australia bombed out of the tournament at home, then made 86 and 106 in a three-match one-day series against an England side still celebrating their T20 World Cup win.","pubDate":"2023-02-12 02:45:14","image_url":null,"source_id":"watoday","category":["sports"],"country":["australia"],"language":"english"},{"title":"India vs Pakistan, Women's T20 World Cup 2023: When and where to watch?","link":"https://www.indiatoday.in/sports/cricket/story/india-vs-pakistan-womens-t20-world-cup-2023-when-and-where-to-watch-2333602-2023-02-12?utm_source=rss","keywords":null,"creator":null,"video_url":null,"description":"India vs Pakistan, Women's T20 World Cup 2023: When and where to watch?","content":": India will take on Pakistan in their opening match of the Women's T20 World Cup 2023 at Newlands, Cape Town on Sunday, February 12. In the Women's T20 World Cups, it will be the seventh meeting between the two sides. India lead the head-to-head record against Pakistan, having won four out of six matches. Overall, India lead Pakistan 10-3 in T20Is. Let's look at India versus Pakistan match details India and Pakistan will clash on Sunday (February 12). Fans should note that the match is scheduled to start at 6:30 PM IST. The much-awaited clash can be seen on Star Sports Network channels. Fans can also watch the live streaming of the match on Disney+ Hotstar app and website in India. India batting coach Hrishikesh Kanitkar played down the magnitude of India's duel with Pakistan on the eve of the match. He said that his team is looking forward to the challenge. \"When you are growing up you want to play in World Cups and play against strong teams and arch-rivals. These are all things you look forward to doing. Most of our team have played against Pakistan in the past, so they know what to expect and what the atmosphere is like,\" Kanitkar said. India will be without its star opener Smriti Mandhana as she has been ruled out with a finger injury. Kanitkar added that Mandhana will be available for India's second fixture. \"Smriti has a finger injury and is still recovery, so she won't play most-likely. It's not a fracture and we're hopeful she will be available from the second game onwards,\" said Kanitkar.","pubDate":"2023-02-12 02:39:49","image_url":null,"source_id":"indiatoday","category":["sports"],"country":["india"],"language":"english"},{"title":"There is only so much you can do: Shaun Tait defends David Warner","link":"https://www.indiatoday.in/sports/cricket/story/india-vs-australia-border-gavaskar-trophy-shaun-tait-defends-david-warner-after-nagpur-test-2333603-2023-02-12?utm_source=rss","keywords":null,"creator":null,"video_url":null,"description":"There is only so much you can do: Shaun Tait defends David Warner","content":": India routed Australia in the first Test match at . In the opening game of the Border Gavaskar Trophy, Australia succumbed to an innings and 132-run defeat with the game getting wrapped up on Day 3. Australia batted for just a little more than one session in their second outing at Nagpur, folding for just 91 runs in 32.3 overs of the match. Australian opener for his inability to play Ravichandran Ashwin in the second innings of the match. Former Australian cricketer Shaun Tait came in defence of the veteran batter and said that there was only so much that a batter can do when Ashwin is constantly threatening your off-stump. \"Warner showed some signs of playing well, but yes, Ashwin dominates him. You have to look at the sort of selections and say that Travis Head is not the guy you can go to, but then Warner averages 20-21 in these conditions in India. It's not like Warner has come here and had a huge amount of success anyway, so it is not a great surprise,\" Shaun Tait told ESPNcricinfo after the completion of the first Test match. Stating that Warner knows what he has to do in the Indian conditions, Tait said that the batter needs to look for ways of scoring runs in the series. \"David knows what he needs to do. He has spoken about concentrating and batting for long periods of time. But when Ashwin is constantly threatening that off stump, there is only so much you can do against a bowler in that form,\" Tait explained. \"Sitting against Ashwin and defending is not going to help Warner,\" he further added. India take on Australia next in New Delhi, on February 17.","pubDate":"2023-02-12 02:24:08","image_url":null,"source_id":"indiatoday","category":["sports"],"country":["india"],"language":"english"},{"title":"Women's T20 WC: Healy and Gardner shine as Australia overrun New Zealand by 97 runs","link":"https://www.indiatoday.in/sports/cricket/story/womens-t20-world-cup-alyssa-healy-and-ashleigh-gardner-shine-as-australia-overrun-new-zealand-by-97-runs-2333595-2023-02-12?utm_source=rss","keywords":null,"creator":null,"video_url":null,"description":"Women's T20 WC: Healy and Gardner shine as Australia overrun New Zealand by 97 runs","content":": Alyssa Healy and Ashleigh Gardner helped Australia to start their Women's T20 World Cup title defence with a massive 97-run victory over New Zealand in Paarl on February 11. Healy, along with her captain Meg Lanning, formed a 70-run partnership after opener Beth Mooney poked a Lea Tahuhu ball to depart for a two-ball duck. Healy and Lanning added 47 runs in the powerplay, which is Australia's best-ever score in the first six overs against New Zealand at the T20 World Cup. Amelia Kerr got the much-needed breakthrough for New Zealand as Lanning was bowled while playing a cut short at 41. One lead to two as Tahuhu dismissed Gardner cheaply for three. However, Ellyse Perry joined Healy to accelerate, stitching a 50-run partnership in just 28 balls. The star opener Healy eventually perished off a slower ball from Tahuhu for 55. Perry and Grace Harris then lit up the stadium with their fireworks, adding 22 runs in just eight balls. Amelia Kerr trapped Perry in front for 40 before a flurry of wickets led to Australia closing on 173/9 from 20 overs. In reply, New Zealand had the worst of the starts as both their openers and experienced campaigners Suzie Bates and Sophie Devine were back in the hut in the very first over. Megan Schutt trapped both the White Ferns in the space of just three balls, but not before the ball cleared the rope for five wides on the first ball. Bernadine Bezuidenhout and Amelia Kerr tried to stabilise things, but it did not last long as Gardner stormed through New Zealand's line-up. Gardner finished with 5/12, the best T20I figures for Australia across men and women, as New Zealand were bundled out for just 76 in 14 overs.","pubDate":"2023-02-12 01:54:51","image_url":null,"source_id":"indiatoday","category":["sports"],"country":["india"],"language":"english"},{"title":"टेस्ट क्रिकेट में इन 3 भारतीय बल्लेबाजों ने जमकर बनाए हैं रन, लेकिन शतक न लगाने का रहेगा अफसोस","link":"https://hindi.news18.com/news/sports/cricket-3-indian-players-who-have-scored-most-runs-in-test-cricket-without-scoring-a-century-5369507.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"टेस्ट प्रारूप में किसी भी खिलाड़ी के लिए शतक लगाना एक बड़ी उपलब्धि होती है. कुछ बल्लेबाजों ने उम्दा बल्लेबाजी करते हुए शतकों का ढेर लगाया है तो कुछ खिलाड़ी अपने पहले शतक के लिए भी तरसते रहे. बात करें भारतीय टीम के कुछ ऐसे खिलाड़ियों के बारे में जिन्होंने उम्दा बल्लेबाजी करते हुए रन तो बनाए, लेकिन शतक नहीं लगा सके तो टॉप तीन इस प्रकार हैं-","content":"टेस्ट में शतक नहीं लगा पाए हैं ये भारतीय बल्लेबाज. (jockmore/Instagram) नई दिल्ली. भारत और ऑस्ट्रेलिया के बीच खेले जाने वाले बॉर्डर गावस्कर ट्रॉफी (Border Gavaskar Trophy) का आगाज हो गया है. सीरीज का पहला मुकाबला नौ फरवरी से 11 फरवरी के बीच नागपुर में खेला गया. यहां कुछ खिलाड़ियों को छोड़ दें तो दोनों टीमों के बल्लेबाज प्रत्येक रनों के लिए जूझते हुए नजर आए, जो कि टेस्ट क्रिकेट में अक्सर देखने को मिलता है. टेस्ट प्रारूप में किसी भी खिलाड़ी के लिए शतक लगाना एक बड़ी उपलब्धि होती है. कुछ बल्लेबाजों ने उम्दा बल्लेबाजी करते हुए शतकों का ढेर लगाया है तो कुछ खिलाड़ी अपने पहले शतक के लिए भी तरसते रहे. बात करें भारतीय टीम के कुछ ऐसे खिलाड़ियों के बारे में जिन्होंने उम्दा बल्लेबाजी करते हुए रन तो बनाए, लेकिन शतक नहीं लगा सके तो टॉप तीन इस प्रकार हैं- यह भी पढ़ें- INDW vs PAKW: हाईवोल्टेज मुकाबले से पूर्व भारतीय महिला टीम को लगा बड़ा झटका, चोटिल उपकप्तान हुईं बाहर! चेतन चौहान (Chetan Chauhan): इस खास लिस्ट में सबसे पहला बड़ा नाम पूर्व क्रिकेटर चेतन चौहान का आता है. चौहान ने भारतीय टीम के लिए 1969 से 1981 के बीच कुल 40 टेस्ट मुकाबले खेले. इस बीच उनके बल्ले से 68 पारियों में 31.58 की औसत से 2084 रन निकले, लेकिन वह एक भी शतक नहीं लगाए पाए. चेतन चौहान के नाम टेस्ट क्रिकेट में 16 अर्द्धशतक दर्ज है और उनका व्यक्तिगत सर्वश्रेष्ठ बल्लेबाजी प्रदर्शन 97 रन है. किरण मोरे (Kiran More): दुसरे स्थान पर पूर्व क्रिकेटर किरण मोरे का नाम आता है. मोरे ने भारतीय टीम के लिए 1986 से लेकर 1993 के बीच 49 टेस्ट मुकाबले खेले. इस बीच उनके बल्ले से 64 पारियों में 25.7 की औसत से 1285 रन निकले, लेकिन वह एक भी शतक नहीं लगा सके. मोरे के नाम टेस्ट प्रारूप में सात अर्द्धशतक दर्ज है. टेस्ट क्रिकेट में उनका सर्वश्रेष्ठ बल्लेबाजी प्रदर्शन 73 रन है. रूसी सुर्ती (Rusi Surti): तीसरे स्थान पर पूर्व क्रिकेटर रूसी सुर्ती का नाम आता है. सुर्ती ने 1960 से 1969 के बीच भारतीय टीम के लिए 26 टेस्ट मुकाबले खेले. इसके बावजूद उनके बल्ले से एक भी शतक नहीं निकला. सुर्ती के नाम टेस्ट क्रिकेट में नौ अर्द्धशतकों के बदौलत 1263 रन दर्ज है. टेस्ट क्रिकेट में उनका सर्वश्रेष्ठ बल्लेबाजी प्रदर्शन 99 रन है. ब्रेकिंग न्यूज़ हिंदी में सबसे पहले पढ़ें News18 हिंदी| आज की ताजा खबर, लाइव न्यूज अपडेट, पढ़ें सबसे विश्वसनीय हिंदी न्यूज़ वेबसाइट News18 हिंदी| Tags: Kiran more , Team india , Test cricket पहले थिएटर में मिले, फिर इस सोशल प्लेटफॉर्म पर शुरु हुई बात, दिलचस्प है Kantara फेम ऋषभ शेट्टी की लव स्टोरी कभी पवन सिंह संग चरम पर थे अक्षरा सिंह के अफेयर के चर्चे, फिर मिली जान से मारने की धमकी! जानिए वजह बेहद हैंडसम और टैलेंटेड हैं कियारा के भाई मिशाल आडवाणी, बॉलीवुड में हैं एक्टिव, करते हैं ये काम","pubDate":"2023-02-12 01:51:38","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/02/Collage-Maker-12-Feb-2023-07.17-AM-16761664743x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"IND vs AUS: नाच न आवे आंगन टेड़ा...एक हार में ही तिलमिला गई ऑस्ट्रेलियाई मीडिया, अब अपनी टीम पर खड़े किए सवाल","link":"https://hindi.news18.com/news/sports/cricket-australian-media-accused-the-australian-team-after-jadeja-and-the-pitch-of-nagpur-ind-vs-australia-5368885.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"भारत ने नागपुर में ऑस्ट्रेलिया को 132 रन से शिकस्त देकर टेस्ट सीरीज में 1-0 से बढ़त बना ली है. यह मुकाबला विवादों से भरा रहा. पहली पारी के बाद से ही ऑस्ट्रेलियाई मीडिया द्वारा भारत पर गंभीर आरोप लगाए गए थे. वहीं, अब ऑस्ट्रेलिया टीम पर सवाल खड़े किए जा रहे हैं.","content":"ऑस्ट्रेलियाई मीडिया ने रवींद्र जडेजा पर बॉल टेंपरिंग के आरोप लगाए थे. (AP) नई दिल्ली. टीम इंडिया ने बॉर्डर गावस्कर सीरीज (Border Gavaskar Trophy) की आगाज शानदार तरीके से किया है. भारत ने मेहमानों को नागपुर टेस्ट में 132 रन से करारी शिकस्त देकर सीरीज में 1-0 से बढ़त बना ली. इस शर्मनाक हार के बाद ऑस्ट्रेलियाई मीडिया पूरी तरह से बौखला चुकी है. पहली पारी में ही भारतीय स्पिनर्स में मेहमानों को घुटने टेकने पर मजबूर कर दिया था. जिसके बाद पिच को लेकर भारत पर गंभीर आरोप लगाए गए थे. बात यहीं पर नहीं खत्म हुई थी, ऑस्ट्रेलियाई मीडिया द्वारा भारतीय ऑलराउंडर रविंद्र जडेजा पर भी बॉल टेंपरिंग आरोप लगा. जडेजा ने पूरे मैच में कुल 7 विकेट अपने नाम किए थे. बात जब दूसरी पारी की आई तो टीम इंडिया के फिरकी मास्टर अश्विन ने अपना जादू दिखा दिया. जिसके बाद ऑस्ट्रेलिया की पूरी टीम महज 91 रन पर ही सिमट गई. ऑस्ट्रेलियाई मीडिया ने सभी नाकाम कोशिशें कीं. वहीं, अब फॉक्स स्पोर्ट ने अपनी ही टीम को लेकर सवाल खड़े कर दिए हैं. कुछ मीडिया आउटलेट्स का मानना है कि भारतीय खिलाड़ी तकनीकी रूप से बेहतर थे. ट्रेविस हेड को लेकर हुए सवाल फॉक्स स्पोर्ट के मुताबिक ट्रेविस हेड को प्लेइंग इलेवन में न खिलाना ऑस्ट्रेलिया की एक बड़ी गलती थी. साथ ही अगले मैच में कैमरून ग्रीन को खिलाने की मांग की है. दोनों टीमों के बीच दूसरे टेस्ट की शुरुआत 17 फरवरी से होगी. अब देखना होगा कि मेहमान टीम अगले टेस्ट में वापसी करने में कामयाब हो पाती है या नहीं. सूर्यकुमार या केएल राहुल…सरफराज खान के सामने आखिर कौन बना दीवार? सेलेक्शन को लेकर गर्माया माहौल भारत ने बनाए 400 रन ऑस्ट्रेलियाई मीडिया ने स्पिन पिच को लेकर सवाल खड़े किए. जिसके बाद टीम इंडिया ने इसका जवाब अपनी बल्लेबाजी से दिया. रोहित शर्मा ने शानदार शतकीय पारी खेली. उसके बाद रवींद्र जडेजा के 60 और अक्षर पटेल के 84 रन की बदौलत भारत ने 400 रन का आंकड़ा छू लिया. जडेजा के प्रदर्शन के बाद उन्हें प्लेयर ऑफ द मैच से भी नवाजा गया है. ब्रेकिंग न्यूज़ हिंदी में सबसे पहले पढ़ें News18 हिंदी| आज की ताजा खबर, लाइव न्यूज अपडेट, पढ़ें सबसे विश्वसनीय हिंदी न्यूज़ वेबसाइट News18 हिंदी| Tags: Border Gavaskar Trophy , India vs Australia , Ravindra jadeja , Team india कभी पवन सिंह संग चरम पर थे अक्षरा सिंह के अफेयर के चर्चे, फिर मिली जान से मारने की धमकी! जानिए वजह बेहद हैंडसम और टैलेंटेड हैं कियारा के भाई मिशाल आडवाणी, बॉलीवुड में हैं एक्टिव, करते हैं ये काम घर में होने वाली है शादी, तैयारियों के समय 5 बातों का रखें ध्यान, लोगों को लाइफ टाइम याद रहेगी मैरिज","pubDate":"2023-02-12 01:30:42","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/02/jadeja-new-1-16759442263x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"शर्मनाक टेस्ट मैच के बाद ऑस्ट्रेलियाई दिग्गज पर टूटा दुखों का पहाड़, खोया बच्चा, क्रिकेट बोर्ड ने लगाई पाबंदी","link":"https://hindi.news18.com/photogallery/sports/cricket-david-warner-lost-big-thing-after-sand-paper-gate-against-south-africa-banned-for-1-year-by-cricket-australia-5368887.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"वर्ल्ड क्रिकेट में ऑस्ट्रेलिया का रुतबा काफी उंचा रहा है लेकिन ये भी सच है कि इस खेल पर कलंक भी इसी टीम ने लगाए हैं. साल 2018 में 'सैंडपेपर-गेट' ने पूरे क्रिकेट जगत को हिला कर रख दिया था. साउथ अफ्रीका के खिलाफ सीरीज में तब से कप्तान स्टीव स्मिथ, डेविड वार्नर और कैनरून बैनक्राफ्ट का नाम सामने आया था. तीनों के उपर खेल पर दाग लगाने के लिए क्रिकेट ऑस्ट्रेलिया ने कड़ा एक्शन लेते हुए सजा सुनाया था. इस घटना के बाद डेविड वार्नर पर दुखों का पहाड़ टूटा था.","content":"Loading... Loading... Loading... Loading... वर्ल्ड क्रिकेट के इतिहास में यूं तो कई शर्मसार करने वाली घटना हुई है लेकिन साउथ अफ्रीका और ऑस्ट्रेलिया के बीच 2018 का मुकाबला ऐसा था जिसने क्रिकेट बोर्ड का सिर शर्म से झुका दिया था. 'सैंडपेपर-गेट' मामले में तब से कप्तान स्टीव स्मिथ, डेविड वार्नर और कैनरून बैनक्राफ्ट का नाम सामने आया था. तीनों ही मैच में गेंद से छेड़छाड करते पाए गए थे.-AP मार्च 2018 में साउथ अफ्रीका के खिलाफ केप टाउन टेस्ट में स्टीव स्मिथ, डेविड वार्नर और कैनरून बैनक्राफ्ट ने गेंद को सैंड पेपर से घिसकर उसके साथ छेड़छाड़ की थी. यह घटना कैमरे में कैद हो गई और फिर इसको लेकर विवाद ने जोर पकड़ लिया. मामले पर एक्शन लेते हुए क्रिकेट ऑस्ट्रेलिया ने डेविड वार्नर पर एक साल के लिए क्रिकेट खेलने पर पाबंदी लगाई और आजीवन कप्तानी पर बैन लगाया. बाकी स्मिथ पर भी 1 साल का बैन लगा और एक साल कप्तानी पर अतिरिक्त प्रतिबंध लगाया गया.-AP 'सैंडपेपर-गेट' मामले के बाद ऑस्ट्रेलिया के ओपनर डेविड वार्नर पर दुखों का पहाड़ टूटा था. उनकी पत्नी कैंडिस ने एक इंटरव्यू में बताया था कि इस घटना के बाद उन्होंने अपना बच्चा खोया था और उनका गर्भपात हो गया था.-david warner Instagram कैंडिस ने अपने जीवन की इस दुखत घटना का जिक्र करते हुए कहा था, 'मैंने डेविड को बाथरूम के अंदर से बुलाकर बताया कि मेरा खून बह रहा है। उसी वक्त हमें यह पता चल गया था कि शायद मेरा गर्भपात हो गया है. हम एक-दूसरे के गले लगकर रोने लगे-david warner Instagram 1 साल का प्रतिबंध झेलने के बाद ऑस्ट्रेलिया के ओपनर डेविड वार्नर ने इंटरनेशनल क्रिकेट में वापसी की और उन्होंने 2021 में अपनी टीम को शानदार बल्लेबाजी करते हुए टी20 वर्ल्ड चैंपियन बनाया. 7 मुकाबले में 3 अर्धशतक के साथ उन्होंने 48.16 की औसत से 289 रन बनाए थे. डेविड वार्नर को आईसीसी टी20 वर्ल्ड कप 2021 का प्लेयर ऑफ द टूर्नामेंट चुना गया था.-AFP","pubDate":"2023-02-12 01:15:15","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/02/Mohammed-shami-vs-warner-test-1-7-16761477253x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"IND vs AUS: अश्विन को तिकड़ी की बैटिंग पर भी है भरोसा, जडेजा के साथ गेंदबाजी करके हुए गदगद","link":"https://hindi.news18.com/news/sports/cricket-ashwin-reacts-to-ravindra-jadeja-batting-and-bowling-after-india-vs-australia-nagpur-test-5368883.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"भारत ने पहले टेस्ट में ऑस्ट्रेलिया को 132 रन से मात देकर सीरीज में 1-0 से बढ़त बना ली है. पहले टेस्ट में भारतीय स्पिनर्स की तरफ से बेहतरीन प्रदर्शन देखने को मिला. आर अश्विन ने जडेजा के साथ गेंदबाजी करने का अनुभव साझा किया है.","content":"ऑस्ट्रेलिया के खिलाफ अश्विन और जडेजा की जोड़ी ने कमाल का प्रदर्शन किया.(PTI) नई दिल्ली. भारतीय टीम ने बॉर्डर गावस्कर सीरीज (Border Gavaskar Trophy) की शुरुआत में ही अपने तेवर दिखा दिए हैं. टीम इंडिया ने पहले टेस्ट में ऑस्ट्रेलिया को 132 रन से शिकस्त देकर सीरीज में 1-0 से बढ़त बना ली है. इस मैच में टीम इंडिया के ऑलराउंडर्स मेहमान टीम पर पूरी तरह से हावी दिखे. स्पिनर्स ने पहले ही दिन से ऑस्ट्रेलिया को बैकफुट पर ढकेल दिया था. भारत की जीत के बाद चर्चा है तो स्पिनर्स की तिकड़ी की. जिनके प्रदर्शन के बाद ऑस्ट्रेलिया को सबसे शर्मनाक हार का सामना करना पड़ा है. ऑस्ट्रेलिया ने टीम इंडिया के फिरकी मास्टर आर अश्विन का सामना करने के लिए योजना बनाई थी. लेकिन जडेजा की वापसी ने मेहमान टीम के जहन में खौफ भर दिया है. जडेजा ने पहली पारी में पांच बल्लेबाजों को आउट किया, उसके बाद दूसरे दिन बल्ले से कहर बरपाया. वहीं, अक्षर पटेल ने भी बहती गंगा में हाथ धोए और 80 रन की महत्वपूर्ण पारी खेली. उसके बाद तीसरे दिन अश्विन ने ऑस्ट्रेलिया की मेहनत पर पानी फेरा और 31वीं बार टेस्ट में पांच विकेट झटक दिए. इस मैच में अश्विन ने कुल 8 विकेट अपने नाम किए जबकि जडेजा ने 7 विकेट झटके. मैच के बाद अश्विन ने स्पिनर्स की बल्लेबाजी को लेकर भी बात की है. जडेजा से काफी मदद मिलती है- आर अश्विन अश्विन ने जडेजा के साथ गेंदबाजी को लेकर कहा, ‘उनके साथ गेंदबाजी करके काफी मदद मिलती है. जिस तरह से उन्होंने बॉलिंग और बैटिंग की, वह बेहतरीन फॉर्म में हैं. हमें इस बारे में चर्चा करने की आवश्यकता नहीं है कि वह मैदान में कितने अच्छे फील्डर है. वह हमेशा से एक शानदार प्लेयर रहे हैं. मैं इस बात के लिए बहुत आभारी हूं कि मुझे गेंदबाजी करने के लिए मुझे उनके जैसा साथी मिला है. हमारे पास स्पिनर्स का अच्छा समूह है और हम सभी बल्लेबाजी भी कर सकते हैं.’ सूर्यकुमार या केएल राहुल…सरफराज खान के सामने आखिर कौन बना दीवार? सेलेक्शन को लेकर गर्माया माहौल जडेजा को प्लेयर ऑफ द मैच चुना गया रवींद्र जडेजा ने लगभग 6 महीने बाद टीम में वापसी की है. वह लंबे समय से अपनी घुटने की चोट से उभर रहे थे. उन्होंने टीम इंडिया में शानदार तरीके से वापसी की है. जडेजा के हरफनमौला प्रदर्शन के बाद उन्हें प्लेयर ऑफ द मैच से भी नवाजा गया है. ब्रेकिंग न्यूज़ हिंदी में सबसे पहले पढ़ें News18 हिंदी| आज की ताजा खबर, लाइव न्यूज अपडेट, पढ़ें सबसे विश्वसनीय हिंदी न्यूज़ वेबसाइट News18 हिंदी| Tags: Border Gavaskar Trophy , India vs Australia , R ashwin , Ravindra jadeja , Team india पहले थिएटर में मिले, फिर इस सोशल प्लेटफॉर्म पर शुरु हुई बात, दिलचस्प है Kantara फेम ऋषभ शेट्टी की लव स्टोरी कभी पवन सिंह संग चरम पर थे अक्षरा सिंह के अफेयर के चर्चे, फिर मिली जान से मारने की धमकी! जानिए वजह बेहद हैंडसम और टैलेंटेड हैं कियारा के भाई मिशाल आडवाणी, बॉलीवुड में हैं एक्टिव, करते हैं ये काम","pubDate":"2023-02-12 01:00:44","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/02/Ravindra-Jadeja-Ravichandran-Ashwin-PTI-16755072603x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"तस्वीर में दिख रहा बच्चा बड़ा होकर बना क्रिकेट सुपर स्टार, ऑस्ट्रेलिया की नाक में किया दम, घुटने टेकने पर कर दिया मजबूर","link":"https://hindi.news18.com/photogallery/sports/cricket-harbhajan-singh-childhood-photo-with-family-created-history-become-1st-to-take-hat-trick-in-test-5368839.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"वर्ल्ड क्रिकेट में कई ऐसे सितारे हुए हैं जिनके नाम से बड़े-बड़े खिलाड़ी खौफ खाते थे. अगर जो बल्लेबाज विस्फोटक हो तो गेंदबाजों में डर होता था और जो गेंदबाज खतरनाक हो तो बल्लेबाज खौफ खाते थे. भारतीय क्रिकेट में एक ऐसा सितारा उभरा जिससे पूरी की पूरी ऑस्ट्रेलिया की टीम खौफ खाती थी. अपनी पहली ही सीरीज में हैट्रिक के साथ 32 विकेट लेकर अपनी ऐसी धाक जमाई जिसे आज भी कोई भूला नहीं पाया","content":"Loading... Loading... Loading... Loading... भारतीय क्रिकेट से सुपर स्टार टर्बनेटर के नाम से मशहूर हरभजन सिंह को किसी पहचान की जरूरत नहीं है. उनकी दूसरा गेंद ने अच्छे अच्छे बल्लेबाजों को गच्चा दिया. ऑस्ट्रेलिया के खिलाफ टेस्ट डेब्यू सीरीज ऐसी जिसने इतिहास रच दिया. -AFP साल 2001 में ऑस्ट्रेलिया की टीम भारत दौरे पर लगातार 15 टेस्ट मैच जीतकर पहुंची थी. यहां आने के बाद टीम के कप्तान स्टीव वॉ ने धाक जमाने की कोशिश की लेकिन सामना हो गया पंजाबी पुत्तर हरभजन सिंह से. उन्होंने सीरीज में कुल 32 विकेटें चटकाई और टेस्ट मैच तो महज आगाज था. भारतीय टीम ने सीरीज पर भी कब्जा जमाया था. -AFP हरभजन सिंह को वर्ल्ड क्रिकेट के सबसे बेहतरीन ऑफ स्पिनर में शुमार किया जाता है. भारत की तरफ से टेस्ट में हैट्रिक लेने का कमाल सबसे पहले हरभजन सिंह ने किया था. कोलकाता टेस्ट में 2001 की सीरीज के दौरान रिकी पोंटिंग, एडम गिलक्रिस्ट और शेन वार्न को आउट कर यह कमाल किया था -Harbhajan singh Instagram विवादों से भी हरभजन सिंह का नाता जुड़ा. ऑस्ट्रेलिया के दौरे पर 2007-08 में एंड्रयू सायमंड्स के साथ उनका गहरा विवाद हुआ था. सिडनी टेस्ट मैच के दौरान हरभजन सिहं ने सायमंड्स को कुछ कहा और फिर उस लेकर मामला ऐसा उलझा की सचिन तेंदुलकर तक को गवाही देनी पड़ी थी. इंडियन प्रीमियर लीग के दौरान हरभजन ने एस श्रीसंत को थप्पड़ मार दिया था. इसको लेकर भी काफी बड़ा विवाद हुआ था. भज्जी मुंबई इंडियंस में थे जबकि श्री पंजाब की टीम का हिस्सा हुआ करते थे.-AFP हरभजन सिंह भारत की तरफ से इंटरनेशनल क्रिकेट में 700 से ज्यादा विकेट लेने वाले अनिल कुंबले के बाद मात्र दूसरे स्पिनर हैं. साल 2007 में वो आईसीसी टी20 विश्व कप जबकि 2011 में आईसीसी वऩडे वर्ल्ड कप जीतने वाली टीम का हिस्सा थे. दोनों ही टूर्नामेंट में भारतीय टीम की कमान महेंद्र सिंह धोनी के हाथों में थी.-AFP हरभजन सिंह ने 103 टेस्ट, 236 वनडे और 28 टी20 इंटरनेशनल मैच खेले. इसमें टेस्ट में उनके नाम 417 विकेट हैं जिसमे 25 बार उन्होंने एक पारी में 5 विकेट चटकाए हैं. वनडे की बात करें तो यहां 269 विकेट है जबकि टी20 में भज्जी ने महज 25 विकेटें ही हासिल की हैं. हरभजन ने टेस्ट क्रिकेट में 2 शतक जबकि 9 अर्धशतक बनाया है.-AFP","pubDate":"2023-02-12 01:00:12","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/02/harbhajan-singh-childhood-photo-16761441963x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Aussie cricket photo really not a good look","link":"https://www.cairnspost.com.au/sport/cricket/photo-of-aussie-cricket-players-not-a-good-look-right-now/news-story/036d8f06fff134827600e5feead2c242","keywords":["Cricket news and galleries","Sport news and galleries"],"creator":null,"video_url":null,"description":"A photo of Aussie cricketers sharing a laugh in the middle of Australia’s second innings trainwreck has been raising eyebrows.","content":"Cricket Don't miss out on the headlines from Cricket. Followed categories will be added to My News. A photo of Aussie cricketers sharing a laugh in the middle of Australia’s second innings trainwreck has been raising eyebrows. There has been an angry response from Aussie cricket fans after the tourists suffered a record breaking defeat of an innings and 132 runs in the First Test in Nagpur. Selectors have been the primary target of the social media backlash following the extraordinary decision to axe Travis Head, but it is now the Aussie dressing room itself that is facing the social media firing squad after the side was dismissed for just 91 in the second innings. Watch Australia’s Tour of India. Every Test & ODI live & ad-break free during play on Kayo. New to Kayo? Start your free trial now > The Aussie team’s attitude is now up for debate after Allan Border said on Day 3 Australia needs to play with a “harder edge” after watching Steve Smith give a thumbs up to India’s bowlers as they beat the bat. It’s why the photo of Aussie players smiling in the middle of the bloodbath is a particularly bad look as the playing group continues to face criticism over the so-called knifing of former coach Justin Langer. The former mentor was famously unapologetic for his intense, demanding leadership style and his drive to instil greater fight in his players. Fox Cricket cameras broadcast live footage of Aussie stars, including Matt Renshaw, Cameron Green, Ashton Agar and Lance Morris, all laughing on the sideline just moments after Australia had lost its seventh wicket. Matt Renshaw was spotted having a chuckle. Photo: Kayo. Renshaw’s contrbutions during the Test were a golden duck in the first innings and a score of two in the second innings. TV sport presenter Adam Hawse was among those to criticise the Aussie players for the poor look. “Wouldn’t have thought there’s too much to chuckle about. This is a hammering,” he wrote on Twitter. One fan wrote on Twitter: “Seeing this photo really annoys me!! You’re getting flogged but it’s ok to joke and laugh. It would never had happened in Allan Border/Bob Simpson reign”. Pat Cummins sounded devastated in his post-match interviews, but was also seen smiling at the start of the official post-match press conference. Earlier this summer, Sydney Thunder players were also criticised for smiling and sharing jokes in the aftermath of their historic total of just 15 runs. The Thunder recovered to qualify for the BBL finals. Pat Cummins after the Aussies were put out of their misery. Photo by Robert Cianflone/Getty Images. Border had earlier been scathing of the team’s meek collapse. He said the Australians “should be embarrassed by that performance”. “It’s just basic batting technique, we’re just struggling in these conditions, it’s as simple as that,” Border said. “Sometimes I feel we just overthought this particular tour, who should be there, who shouldn’t be there. I think Travis Head (being dropped) is the perfect example that it was chaos before it ever started.” He said of Smith’s friendly interactions with Indian players: “Play with a harder edge. I mean, we’re giving blokes the thumbs up when they’re beating us outside the off stump. “What the hell is going on? That is just ridiculous. Don’t go stupid but Australia play hard-nosed cricket. “We’re even giving someone thumbs up who’s beaten you outside the off-stump, bloody hell.” There was also criticism directed at Aussie officials for the optics coming out of the inner sanctum on the final day of the Test. More Coverage Storm erupts over two words from Test great Indian star found ‘guilty’ amid cream scandal National selector Tony Dodemaide was seen smiling away during conversations with Aussie players, something that has rubbed some the wrong way. There are expected to be several changes made to the Aussie side for the second Test, which begins Friday. Originally published as Photo of Aussie cricket players not a good look right now More related stories Cricket Aussies lose another bowler as bolter’s stocks rise Australia is set to lose another bowler from its squad, enhancing the chances of a shock inclusion from a spinner who will answer an SOS. Read more Cricket Have your say: Every Aussie rated after Nagpur nightmare Australia were embarrassed by India in the first Test in Nagpur, but how would you rate each player’s performance? HAVE YOUR SAY. Read more","pubDate":"2023-02-12 03:10:00","image_url":null,"source_id":"cairnspost","category":["sports"],"country":["australia"],"language":"english"},{"title":"Warner’s position under threat as Australia considers three spinners for second Test","link":"https://www.watoday.com.au/sport/cricket/warner-s-position-under-threat-as-australia-considers-three-spinners-for-second-test-20230212-p5cjuw.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Malcolm Conn"],"video_url":null,"description":"Australia’s cricket hierarchy will discuss replacing David Warner with Travis Head while Queensland spinner Matt Kuhnemann is flying in as a possible shock selection.","content":"Australia may replace David Warner with Travis Head at the top of the order as they consider changes among the wreckage of an innings first Test defeat in Nagpur. Queensland left arm finger spinner Matt Kuhnemann is also a chance to play his first Test after being summoned to India as a replacement for reserve leg-spinner Mitch Swepson, who is returning home for the birth of his child. Kuhnemann, 26, would be a shock selection but he is being considered as a potential third spinner if Cameron Green is fit and the pitch for the second Test in Delhi also aids spinners, as expected. A shock axing for the first Test, Head has been discussed as a possible opening batsman in the subcontinent, where he has struggled in the middle order on previous tours. Sources close to the Australian team confirmed those discussions were continuing after Warner’s double failure in the first Test. Australia lost by an innings and 132 runs inside three days after being bowled out for just 91 in their second innings on Saturday, their lowest score on Indian soil. Most Australian batsmen were completely bamboozled by exceptional Indian spinners Ravi Ashwin and Ravi Jadeja, who claimed 15 of the 20 wickets between them on a helpful surface. David Warner walks back to pavilion after his dismissal during the third day. Credit: AP However it was the way that Warner failed which has raised most concerns, playing late on a ball from Mohammed Shami to lose his off stump for one 13 balls into the Test, then rooted to the crease in the second innings before being trapped lbw for 10 from 41 balls by Ashwin. Warner had a cluttered, and topsy-turvy, home season with some beacons amid the gloom. He had a top score of just 25 in four T20 World Cup innings as Australia bombed out of the tournament at home, then made 86 and 106 in a three-match one-day series against an England side still celebrating their T20 World Cup win.","pubDate":"2023-02-12 02:45:14","image_url":null,"source_id":"watoday","category":["sports"],"country":["australia"],"language":"english"},{"title":"India vs Pakistan, Women's T20 World Cup 2023: When and where to watch?","link":"https://www.indiatoday.in/sports/cricket/story/india-vs-pakistan-womens-t20-world-cup-2023-when-and-where-to-watch-2333602-2023-02-12?utm_source=rss","keywords":null,"creator":null,"video_url":null,"description":"India vs Pakistan, Women's T20 World Cup 2023: When and where to watch?","content":": India will take on Pakistan in their opening match of the Women's T20 World Cup 2023 at Newlands, Cape Town on Sunday, February 12. In the Women's T20 World Cups, it will be the seventh meeting between the two sides. India lead the head-to-head record against Pakistan, having won four out of six matches. Overall, India lead Pakistan 10-3 in T20Is. Let's look at India versus Pakistan match details India and Pakistan will clash on Sunday (February 12). Fans should note that the match is scheduled to start at 6:30 PM IST. The much-awaited clash can be seen on Star Sports Network channels. Fans can also watch the live streaming of the match on Disney+ Hotstar app and website in India. India batting coach Hrishikesh Kanitkar played down the magnitude of India's duel with Pakistan on the eve of the match. He said that his team is looking forward to the challenge. \"When you are growing up you want to play in World Cups and play against strong teams and arch-rivals. These are all things you look forward to doing. Most of our team have played against Pakistan in the past, so they know what to expect and what the atmosphere is like,\" Kanitkar said. India will be without its star opener Smriti Mandhana as she has been ruled out with a finger injury. Kanitkar added that Mandhana will be available for India's second fixture. \"Smriti has a finger injury and is still recovery, so she won't play most-likely. It's not a fracture and we're hopeful she will be available from the second game onwards,\" said Kanitkar.","pubDate":"2023-02-12 02:39:49","image_url":null,"source_id":"indiatoday","category":["sports"],"country":["india"],"language":"english"},{"title":"There is only so much you can do: Shaun Tait defends David Warner","link":"https://www.indiatoday.in/sports/cricket/story/india-vs-australia-border-gavaskar-trophy-shaun-tait-defends-david-warner-after-nagpur-test-2333603-2023-02-12?utm_source=rss","keywords":null,"creator":null,"video_url":null,"description":"There is only so much you can do: Shaun Tait defends David Warner","content":": India routed Australia in the first Test match at . In the opening game of the Border Gavaskar Trophy, Australia succumbed to an innings and 132-run defeat with the game getting wrapped up on Day 3. Australia batted for just a little more than one session in their second outing at Nagpur, folding for just 91 runs in 32.3 overs of the match. Australian opener for his inability to play Ravichandran Ashwin in the second innings of the match. Former Australian cricketer Shaun Tait came in defence of the veteran batter and said that there was only so much that a batter can do when Ashwin is constantly threatening your off-stump. \"Warner showed some signs of playing well, but yes, Ashwin dominates him. You have to look at the sort of selections and say that Travis Head is not the guy you can go to, but then Warner averages 20-21 in these conditions in India. It's not like Warner has come here and had a huge amount of success anyway, so it is not a great surprise,\" Shaun Tait told ESPNcricinfo after the completion of the first Test match. Stating that Warner knows what he has to do in the Indian conditions, Tait said that the batter needs to look for ways of scoring runs in the series. \"David knows what he needs to do. He has spoken about concentrating and batting for long periods of time. But when Ashwin is constantly threatening that off stump, there is only so much you can do against a bowler in that form,\" Tait explained. \"Sitting against Ashwin and defending is not going to help Warner,\" he further added. India take on Australia next in New Delhi, on February 17.","pubDate":"2023-02-12 02:24:08","image_url":null,"source_id":"indiatoday","category":["sports"],"country":["india"],"language":"english"},{"title":"Women's T20 WC: Healy and Gardner shine as Australia overrun New Zealand by 97 runs","link":"https://www.indiatoday.in/sports/cricket/story/womens-t20-world-cup-alyssa-healy-and-ashleigh-gardner-shine-as-australia-overrun-new-zealand-by-97-runs-2333595-2023-02-12?utm_source=rss","keywords":null,"creator":null,"video_url":null,"description":"Women's T20 WC: Healy and Gardner shine as Australia overrun New Zealand by 97 runs","content":": Alyssa Healy and Ashleigh Gardner helped Australia to start their Women's T20 World Cup title defence with a massive 97-run victory over New Zealand in Paarl on February 11. Healy, along with her captain Meg Lanning, formed a 70-run partnership after opener Beth Mooney poked a Lea Tahuhu ball to depart for a two-ball duck. Healy and Lanning added 47 runs in the powerplay, which is Australia's best-ever score in the first six overs against New Zealand at the T20 World Cup. Amelia Kerr got the much-needed breakthrough for New Zealand as Lanning was bowled while playing a cut short at 41. One lead to two as Tahuhu dismissed Gardner cheaply for three. However, Ellyse Perry joined Healy to accelerate, stitching a 50-run partnership in just 28 balls. The star opener Healy eventually perished off a slower ball from Tahuhu for 55. Perry and Grace Harris then lit up the stadium with their fireworks, adding 22 runs in just eight balls. Amelia Kerr trapped Perry in front for 40 before a flurry of wickets led to Australia closing on 173/9 from 20 overs. In reply, New Zealand had the worst of the starts as both their openers and experienced campaigners Suzie Bates and Sophie Devine were back in the hut in the very first over. Megan Schutt trapped both the White Ferns in the space of just three balls, but not before the ball cleared the rope for five wides on the first ball. Bernadine Bezuidenhout and Amelia Kerr tried to stabilise things, but it did not last long as Gardner stormed through New Zealand's line-up. Gardner finished with 5/12, the best T20I figures for Australia across men and women, as New Zealand were bundled out for just 76 in 14 overs.","pubDate":"2023-02-12 01:54:51","image_url":null,"source_id":"indiatoday","category":["sports"],"country":["india"],"language":"english"},{"title":"टेस्ट क्रिकेट में इन 3 भारतीय बल्लेबाजों ने जमकर बनाए हैं रन, लेकिन शतक न लगाने का रहेगा अफसोस","link":"https://hindi.news18.com/news/sports/cricket-3-indian-players-who-have-scored-most-runs-in-test-cricket-without-scoring-a-century-5369507.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"टेस्ट प्रारूप में किसी भी खिलाड़ी के लिए शतक लगाना एक बड़ी उपलब्धि होती है. कुछ बल्लेबाजों ने उम्दा बल्लेबाजी करते हुए शतकों का ढेर लगाया है तो कुछ खिलाड़ी अपने पहले शतक के लिए भी तरसते रहे. बात करें भारतीय टीम के कुछ ऐसे खिलाड़ियों के बारे में जिन्होंने उम्दा बल्लेबाजी करते हुए रन तो बनाए, लेकिन शतक नहीं लगा सके तो टॉप तीन इस प्रकार हैं-","content":"टेस्ट में शतक नहीं लगा पाए हैं ये भारतीय बल्लेबाज. (jockmore/Instagram) नई दिल्ली. भारत और ऑस्ट्रेलिया के बीच खेले जाने वाले बॉर्डर गावस्कर ट्रॉफी (Border Gavaskar Trophy) का आगाज हो गया है. सीरीज का पहला मुकाबला नौ फरवरी से 11 फरवरी के बीच नागपुर में खेला गया. यहां कुछ खिलाड़ियों को छोड़ दें तो दोनों टीमों के बल्लेबाज प्रत्येक रनों के लिए जूझते हुए नजर आए, जो कि टेस्ट क्रिकेट में अक्सर देखने को मिलता है. टेस्ट प्रारूप में किसी भी खिलाड़ी के लिए शतक लगाना एक बड़ी उपलब्धि होती है. कुछ बल्लेबाजों ने उम्दा बल्लेबाजी करते हुए शतकों का ढेर लगाया है तो कुछ खिलाड़ी अपने पहले शतक के लिए भी तरसते रहे. बात करें भारतीय टीम के कुछ ऐसे खिलाड़ियों के बारे में जिन्होंने उम्दा बल्लेबाजी करते हुए रन तो बनाए, लेकिन शतक नहीं लगा सके तो टॉप तीन इस प्रकार हैं- यह भी पढ़ें- INDW vs PAKW: हाईवोल्टेज मुकाबले से पूर्व भारतीय महिला टीम को लगा बड़ा झटका, चोटिल उपकप्तान हुईं बाहर! चेतन चौहान (Chetan Chauhan): इस खास लिस्ट में सबसे पहला बड़ा नाम पूर्व क्रिकेटर चेतन चौहान का आता है. चौहान ने भारतीय टीम के लिए 1969 से 1981 के बीच कुल 40 टेस्ट मुकाबले खेले. इस बीच उनके बल्ले से 68 पारियों में 31.58 की औसत से 2084 रन निकले, लेकिन वह एक भी शतक नहीं लगाए पाए. चेतन चौहान के नाम टेस्ट क्रिकेट में 16 अर्द्धशतक दर्ज है और उनका व्यक्तिगत सर्वश्रेष्ठ बल्लेबाजी प्रदर्शन 97 रन है. किरण मोरे (Kiran More): दुसरे स्थान पर पूर्व क्रिकेटर किरण मोरे का नाम आता है. मोरे ने भारतीय टीम के लिए 1986 से लेकर 1993 के बीच 49 टेस्ट मुकाबले खेले. इस बीच उनके बल्ले से 64 पारियों में 25.7 की औसत से 1285 रन निकले, लेकिन वह एक भी शतक नहीं लगा सके. मोरे के नाम टेस्ट प्रारूप में सात अर्द्धशतक दर्ज है. टेस्ट क्रिकेट में उनका सर्वश्रेष्ठ बल्लेबाजी प्रदर्शन 73 रन है. रूसी सुर्ती (Rusi Surti): तीसरे स्थान पर पूर्व क्रिकेटर रूसी सुर्ती का नाम आता है. सुर्ती ने 1960 से 1969 के बीच भारतीय टीम के लिए 26 टेस्ट मुकाबले खेले. इसके बावजूद उनके बल्ले से एक भी शतक नहीं निकला. सुर्ती के नाम टेस्ट क्रिकेट में नौ अर्द्धशतकों के बदौलत 1263 रन दर्ज है. टेस्ट क्रिकेट में उनका सर्वश्रेष्ठ बल्लेबाजी प्रदर्शन 99 रन है. ब्रेकिंग न्यूज़ हिंदी में सबसे पहले पढ़ें News18 हिंदी| आज की ताजा खबर, लाइव न्यूज अपडेट, पढ़ें सबसे विश्वसनीय हिंदी न्यूज़ वेबसाइट News18 हिंदी| Tags: Kiran more , Team india , Test cricket पहले थिएटर में मिले, फिर इस सोशल प्लेटफॉर्म पर शुरु हुई बात, दिलचस्प है Kantara फेम ऋषभ शेट्टी की लव स्टोरी कभी पवन सिंह संग चरम पर थे अक्षरा सिंह के अफेयर के चर्चे, फिर मिली जान से मारने की धमकी! जानिए वजह बेहद हैंडसम और टैलेंटेड हैं कियारा के भाई मिशाल आडवाणी, बॉलीवुड में हैं एक्टिव, करते हैं ये काम","pubDate":"2023-02-12 01:51:38","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/02/Collage-Maker-12-Feb-2023-07.17-AM-16761664743x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"IND vs AUS: नाच न आवे आंगन टेड़ा...एक हार में ही तिलमिला गई ऑस्ट्रेलियाई मीडिया, अब अपनी टीम पर खड़े किए सवाल","link":"https://hindi.news18.com/news/sports/cricket-australian-media-accused-the-australian-team-after-jadeja-and-the-pitch-of-nagpur-ind-vs-australia-5368885.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"भारत ने नागपुर में ऑस्ट्रेलिया को 132 रन से शिकस्त देकर टेस्ट सीरीज में 1-0 से बढ़त बना ली है. यह मुकाबला विवादों से भरा रहा. पहली पारी के बाद से ही ऑस्ट्रेलियाई मीडिया द्वारा भारत पर गंभीर आरोप लगाए गए थे. वहीं, अब ऑस्ट्रेलिया टीम पर सवाल खड़े किए जा रहे हैं.","content":"ऑस्ट्रेलियाई मीडिया ने रवींद्र जडेजा पर बॉल टेंपरिंग के आरोप लगाए थे. (AP) नई दिल्ली. टीम इंडिया ने बॉर्डर गावस्कर सीरीज (Border Gavaskar Trophy) की आगाज शानदार तरीके से किया है. भारत ने मेहमानों को नागपुर टेस्ट में 132 रन से करारी शिकस्त देकर सीरीज में 1-0 से बढ़त बना ली. इस शर्मनाक हार के बाद ऑस्ट्रेलियाई मीडिया पूरी तरह से बौखला चुकी है. पहली पारी में ही भारतीय स्पिनर्स में मेहमानों को घुटने टेकने पर मजबूर कर दिया था. जिसके बाद पिच को लेकर भारत पर गंभीर आरोप लगाए गए थे. बात यहीं पर नहीं खत्म हुई थी, ऑस्ट्रेलियाई मीडिया द्वारा भारतीय ऑलराउंडर रविंद्र जडेजा पर भी बॉल टेंपरिंग आरोप लगा. जडेजा ने पूरे मैच में कुल 7 विकेट अपने नाम किए थे. बात जब दूसरी पारी की आई तो टीम इंडिया के फिरकी मास्टर अश्विन ने अपना जादू दिखा दिया. जिसके बाद ऑस्ट्रेलिया की पूरी टीम महज 91 रन पर ही सिमट गई. ऑस्ट्रेलियाई मीडिया ने सभी नाकाम कोशिशें कीं. वहीं, अब फॉक्स स्पोर्ट ने अपनी ही टीम को लेकर सवाल खड़े कर दिए हैं. कुछ मीडिया आउटलेट्स का मानना है कि भारतीय खिलाड़ी तकनीकी रूप से बेहतर थे. ट्रेविस हेड को लेकर हुए सवाल फॉक्स स्पोर्ट के मुताबिक ट्रेविस हेड को प्लेइंग इलेवन में न खिलाना ऑस्ट्रेलिया की एक बड़ी गलती थी. साथ ही अगले मैच में कैमरून ग्रीन को खिलाने की मांग की है. दोनों टीमों के बीच दूसरे टेस्ट की शुरुआत 17 फरवरी से होगी. अब देखना होगा कि मेहमान टीम अगले टेस्ट में वापसी करने में कामयाब हो पाती है या नहीं. सूर्यकुमार या केएल राहुल…सरफराज खान के सामने आखिर कौन बना दीवार? सेलेक्शन को लेकर गर्माया माहौल भारत ने बनाए 400 रन ऑस्ट्रेलियाई मीडिया ने स्पिन पिच को लेकर सवाल खड़े किए. जिसके बाद टीम इंडिया ने इसका जवाब अपनी बल्लेबाजी से दिया. रोहित शर्मा ने शानदार शतकीय पारी खेली. उसके बाद रवींद्र जडेजा के 60 और अक्षर पटेल के 84 रन की बदौलत भारत ने 400 रन का आंकड़ा छू लिया. जडेजा के प्रदर्शन के बाद उन्हें प्लेयर ऑफ द मैच से भी नवाजा गया है. ब्रेकिंग न्यूज़ हिंदी में सबसे पहले पढ़ें News18 हिंदी| आज की ताजा खबर, लाइव न्यूज अपडेट, पढ़ें सबसे विश्वसनीय हिंदी न्यूज़ वेबसाइट News18 हिंदी| Tags: Border Gavaskar Trophy , India vs Australia , Ravindra jadeja , Team india कभी पवन सिंह संग चरम पर थे अक्षरा सिंह के अफेयर के चर्चे, फिर मिली जान से मारने की धमकी! जानिए वजह बेहद हैंडसम और टैलेंटेड हैं कियारा के भाई मिशाल आडवाणी, बॉलीवुड में हैं एक्टिव, करते हैं ये काम घर में होने वाली है शादी, तैयारियों के समय 5 बातों का रखें ध्यान, लोगों को लाइफ टाइम याद रहेगी मैरिज","pubDate":"2023-02-12 01:30:42","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/02/jadeja-new-1-16759442263x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"शर्मनाक टेस्ट मैच के बाद ऑस्ट्रेलियाई दिग्गज पर टूटा दुखों का पहाड़, खोया बच्चा, क्रिकेट बोर्ड ने लगाई पाबंदी","link":"https://hindi.news18.com/photogallery/sports/cricket-david-warner-lost-big-thing-after-sand-paper-gate-against-south-africa-banned-for-1-year-by-cricket-australia-5368887.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"वर्ल्ड क्रिकेट में ऑस्ट्रेलिया का रुतबा काफी उंचा रहा है लेकिन ये भी सच है कि इस खेल पर कलंक भी इसी टीम ने लगाए हैं. साल 2018 में 'सैंडपेपर-गेट' ने पूरे क्रिकेट जगत को हिला कर रख दिया था. साउथ अफ्रीका के खिलाफ सीरीज में तब से कप्तान स्टीव स्मिथ, डेविड वार्नर और कैनरून बैनक्राफ्ट का नाम सामने आया था. तीनों के उपर खेल पर दाग लगाने के लिए क्रिकेट ऑस्ट्रेलिया ने कड़ा एक्शन लेते हुए सजा सुनाया था. इस घटना के बाद डेविड वार्नर पर दुखों का पहाड़ टूटा था.","content":"Loading... Loading... Loading... Loading... वर्ल्ड क्रिकेट के इतिहास में यूं तो कई शर्मसार करने वाली घटना हुई है लेकिन साउथ अफ्रीका और ऑस्ट्रेलिया के बीच 2018 का मुकाबला ऐसा था जिसने क्रिकेट बोर्ड का सिर शर्म से झुका दिया था. 'सैंडपेपर-गेट' मामले में तब से कप्तान स्टीव स्मिथ, डेविड वार्नर और कैनरून बैनक्राफ्ट का नाम सामने आया था. तीनों ही मैच में गेंद से छेड़छाड करते पाए गए थे.-AP मार्च 2018 में साउथ अफ्रीका के खिलाफ केप टाउन टेस्ट में स्टीव स्मिथ, डेविड वार्नर और कैनरून बैनक्राफ्ट ने गेंद को सैंड पेपर से घिसकर उसके साथ छेड़छाड़ की थी. यह घटना कैमरे में कैद हो गई और फिर इसको लेकर विवाद ने जोर पकड़ लिया. मामले पर एक्शन लेते हुए क्रिकेट ऑस्ट्रेलिया ने डेविड वार्नर पर एक साल के लिए क्रिकेट खेलने पर पाबंदी लगाई और आजीवन कप्तानी पर बैन लगाया. बाकी स्मिथ पर भी 1 साल का बैन लगा और एक साल कप्तानी पर अतिरिक्त प्रतिबंध लगाया गया.-AP 'सैंडपेपर-गेट' मामले के बाद ऑस्ट्रेलिया के ओपनर डेविड वार्नर पर दुखों का पहाड़ टूटा था. उनकी पत्नी कैंडिस ने एक इंटरव्यू में बताया था कि इस घटना के बाद उन्होंने अपना बच्चा खोया था और उनका गर्भपात हो गया था.-david warner Instagram कैंडिस ने अपने जीवन की इस दुखत घटना का जिक्र करते हुए कहा था, 'मैंने डेविड को बाथरूम के अंदर से बुलाकर बताया कि मेरा खून बह रहा है। उसी वक्त हमें यह पता चल गया था कि शायद मेरा गर्भपात हो गया है. हम एक-दूसरे के गले लगकर रोने लगे-david warner Instagram 1 साल का प्रतिबंध झेलने के बाद ऑस्ट्रेलिया के ओपनर डेविड वार्नर ने इंटरनेशनल क्रिकेट में वापसी की और उन्होंने 2021 में अपनी टीम को शानदार बल्लेबाजी करते हुए टी20 वर्ल्ड चैंपियन बनाया. 7 मुकाबले में 3 अर्धशतक के साथ उन्होंने 48.16 की औसत से 289 रन बनाए थे. डेविड वार्नर को आईसीसी टी20 वर्ल्ड कप 2021 का प्लेयर ऑफ द टूर्नामेंट चुना गया था.-AFP","pubDate":"2023-02-12 01:15:15","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/02/Mohammed-shami-vs-warner-test-1-7-16761477253x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"IND vs AUS: अश्विन को तिकड़ी की बैटिंग पर भी है भरोसा, जडेजा के साथ गेंदबाजी करके हुए गदगद","link":"https://hindi.news18.com/news/sports/cricket-ashwin-reacts-to-ravindra-jadeja-batting-and-bowling-after-india-vs-australia-nagpur-test-5368883.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"भारत ने पहले टेस्ट में ऑस्ट्रेलिया को 132 रन से मात देकर सीरीज में 1-0 से बढ़त बना ली है. पहले टेस्ट में भारतीय स्पिनर्स की तरफ से बेहतरीन प्रदर्शन देखने को मिला. आर अश्विन ने जडेजा के साथ गेंदबाजी करने का अनुभव साझा किया है.","content":"ऑस्ट्रेलिया के खिलाफ अश्विन और जडेजा की जोड़ी ने कमाल का प्रदर्शन किया.(PTI) नई दिल्ली. भारतीय टीम ने बॉर्डर गावस्कर सीरीज (Border Gavaskar Trophy) की शुरुआत में ही अपने तेवर दिखा दिए हैं. टीम इंडिया ने पहले टेस्ट में ऑस्ट्रेलिया को 132 रन से शिकस्त देकर सीरीज में 1-0 से बढ़त बना ली है. इस मैच में टीम इंडिया के ऑलराउंडर्स मेहमान टीम पर पूरी तरह से हावी दिखे. स्पिनर्स ने पहले ही दिन से ऑस्ट्रेलिया को बैकफुट पर ढकेल दिया था. भारत की जीत के बाद चर्चा है तो स्पिनर्स की तिकड़ी की. जिनके प्रदर्शन के बाद ऑस्ट्रेलिया को सबसे शर्मनाक हार का सामना करना पड़ा है. ऑस्ट्रेलिया ने टीम इंडिया के फिरकी मास्टर आर अश्विन का सामना करने के लिए योजना बनाई थी. लेकिन जडेजा की वापसी ने मेहमान टीम के जहन में खौफ भर दिया है. जडेजा ने पहली पारी में पांच बल्लेबाजों को आउट किया, उसके बाद दूसरे दिन बल्ले से कहर बरपाया. वहीं, अक्षर पटेल ने भी बहती गंगा में हाथ धोए और 80 रन की महत्वपूर्ण पारी खेली. उसके बाद तीसरे दिन अश्विन ने ऑस्ट्रेलिया की मेहनत पर पानी फेरा और 31वीं बार टेस्ट में पांच विकेट झटक दिए. इस मैच में अश्विन ने कुल 8 विकेट अपने नाम किए जबकि जडेजा ने 7 विकेट झटके. मैच के बाद अश्विन ने स्पिनर्स की बल्लेबाजी को लेकर भी बात की है. जडेजा से काफी मदद मिलती है- आर अश्विन अश्विन ने जडेजा के साथ गेंदबाजी को लेकर कहा, ‘उनके साथ गेंदबाजी करके काफी मदद मिलती है. जिस तरह से उन्होंने बॉलिंग और बैटिंग की, वह बेहतरीन फॉर्म में हैं. हमें इस बारे में चर्चा करने की आवश्यकता नहीं है कि वह मैदान में कितने अच्छे फील्डर है. वह हमेशा से एक शानदार प्लेयर रहे हैं. मैं इस बात के लिए बहुत आभारी हूं कि मुझे गेंदबाजी करने के लिए मुझे उनके जैसा साथी मिला है. हमारे पास स्पिनर्स का अच्छा समूह है और हम सभी बल्लेबाजी भी कर सकते हैं.’ सूर्यकुमार या केएल राहुल…सरफराज खान के सामने आखिर कौन बना दीवार? सेलेक्शन को लेकर गर्माया माहौल जडेजा को प्लेयर ऑफ द मैच चुना गया रवींद्र जडेजा ने लगभग 6 महीने बाद टीम में वापसी की है. वह लंबे समय से अपनी घुटने की चोट से उभर रहे थे. उन्होंने टीम इंडिया में शानदार तरीके से वापसी की है. जडेजा के हरफनमौला प्रदर्शन के बाद उन्हें प्लेयर ऑफ द मैच से भी नवाजा गया है. ब्रेकिंग न्यूज़ हिंदी में सबसे पहले पढ़ें News18 हिंदी| आज की ताजा खबर, लाइव न्यूज अपडेट, पढ़ें सबसे विश्वसनीय हिंदी न्यूज़ वेबसाइट News18 हिंदी| Tags: Border Gavaskar Trophy , India vs Australia , R ashwin , Ravindra jadeja , Team india पहले थिएटर में मिले, फिर इस सोशल प्लेटफॉर्म पर शुरु हुई बात, दिलचस्प है Kantara फेम ऋषभ शेट्टी की लव स्टोरी कभी पवन सिंह संग चरम पर थे अक्षरा सिंह के अफेयर के चर्चे, फिर मिली जान से मारने की धमकी! जानिए वजह बेहद हैंडसम और टैलेंटेड हैं कियारा के भाई मिशाल आडवाणी, बॉलीवुड में हैं एक्टिव, करते हैं ये काम","pubDate":"2023-02-12 01:00:44","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/02/Ravindra-Jadeja-Ravichandran-Ashwin-PTI-16755072603x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"तस्वीर में दिख रहा बच्चा बड़ा होकर बना क्रिकेट सुपर स्टार, ऑस्ट्रेलिया की नाक में किया दम, घुटने टेकने पर कर दिया मजबूर","link":"https://hindi.news18.com/photogallery/sports/cricket-harbhajan-singh-childhood-photo-with-family-created-history-become-1st-to-take-hat-trick-in-test-5368839.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"वर्ल्ड क्रिकेट में कई ऐसे सितारे हुए हैं जिनके नाम से बड़े-बड़े खिलाड़ी खौफ खाते थे. अगर जो बल्लेबाज विस्फोटक हो तो गेंदबाजों में डर होता था और जो गेंदबाज खतरनाक हो तो बल्लेबाज खौफ खाते थे. भारतीय क्रिकेट में एक ऐसा सितारा उभरा जिससे पूरी की पूरी ऑस्ट्रेलिया की टीम खौफ खाती थी. अपनी पहली ही सीरीज में हैट्रिक के साथ 32 विकेट लेकर अपनी ऐसी धाक जमाई जिसे आज भी कोई भूला नहीं पाया","content":"Loading... Loading... Loading... Loading... भारतीय क्रिकेट से सुपर स्टार टर्बनेटर के नाम से मशहूर हरभजन सिंह को किसी पहचान की जरूरत नहीं है. उनकी दूसरा गेंद ने अच्छे अच्छे बल्लेबाजों को गच्चा दिया. ऑस्ट्रेलिया के खिलाफ टेस्ट डेब्यू सीरीज ऐसी जिसने इतिहास रच दिया. -AFP साल 2001 में ऑस्ट्रेलिया की टीम भारत दौरे पर लगातार 15 टेस्ट मैच जीतकर पहुंची थी. यहां आने के बाद टीम के कप्तान स्टीव वॉ ने धाक जमाने की कोशिश की लेकिन सामना हो गया पंजाबी पुत्तर हरभजन सिंह से. उन्होंने सीरीज में कुल 32 विकेटें चटकाई और टेस्ट मैच तो महज आगाज था. भारतीय टीम ने सीरीज पर भी कब्जा जमाया था. -AFP हरभजन सिंह को वर्ल्ड क्रिकेट के सबसे बेहतरीन ऑफ स्पिनर में शुमार किया जाता है. भारत की तरफ से टेस्ट में हैट्रिक लेने का कमाल सबसे पहले हरभजन सिंह ने किया था. कोलकाता टेस्ट में 2001 की सीरीज के दौरान रिकी पोंटिंग, एडम गिलक्रिस्ट और शेन वार्न को आउट कर यह कमाल किया था -Harbhajan singh Instagram विवादों से भी हरभजन सिंह का नाता जुड़ा. ऑस्ट्रेलिया के दौरे पर 2007-08 में एंड्रयू सायमंड्स के साथ उनका गहरा विवाद हुआ था. सिडनी टेस्ट मैच के दौरान हरभजन सिहं ने सायमंड्स को कुछ कहा और फिर उस लेकर मामला ऐसा उलझा की सचिन तेंदुलकर तक को गवाही देनी पड़ी थी. इंडियन प्रीमियर लीग के दौरान हरभजन ने एस श्रीसंत को थप्पड़ मार दिया था. इसको लेकर भी काफी बड़ा विवाद हुआ था. भज्जी मुंबई इंडियंस में थे जबकि श्री पंजाब की टीम का हिस्सा हुआ करते थे.-AFP हरभजन सिंह भारत की तरफ से इंटरनेशनल क्रिकेट में 700 से ज्यादा विकेट लेने वाले अनिल कुंबले के बाद मात्र दूसरे स्पिनर हैं. साल 2007 में वो आईसीसी टी20 विश्व कप जबकि 2011 में आईसीसी वऩडे वर्ल्ड कप जीतने वाली टीम का हिस्सा थे. दोनों ही टूर्नामेंट में भारतीय टीम की कमान महेंद्र सिंह धोनी के हाथों में थी.-AFP हरभजन सिंह ने 103 टेस्ट, 236 वनडे और 28 टी20 इंटरनेशनल मैच खेले. इसमें टेस्ट में उनके नाम 417 विकेट हैं जिसमे 25 बार उन्होंने एक पारी में 5 विकेट चटकाए हैं. वनडे की बात करें तो यहां 269 विकेट है जबकि टी20 में भज्जी ने महज 25 विकेटें ही हासिल की हैं. हरभजन ने टेस्ट क्रिकेट में 2 शतक जबकि 9 अर्धशतक बनाया है.-AFP","pubDate":"2023-02-12 01:00:12","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/02/harbhajan-singh-childhood-photo-16761441963x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Aussie cricket photo really not a good look","link":"https://www.cairnspost.com.au/sport/cricket/photo-of-aussie-cricket-players-not-a-good-look-right-now/news-story/036d8f06fff134827600e5feead2c242","keywords":["Cricket news and galleries","Sport news and galleries"],"creator":null,"video_url":null,"description":"A photo of Aussie cricketers sharing a laugh in the middle of Australia’s second innings trainwreck has been raising eyebrows.","content":"Cricket Don't miss out on the headlines from Cricket. Followed categories will be added to My News. A photo of Aussie cricketers sharing a laugh in the middle of Australia’s second innings trainwreck has been raising eyebrows. There has been an angry response from Aussie cricket fans after the tourists suffered a record breaking defeat of an innings and 132 runs in the First Test in Nagpur. Selectors have been the primary target of the social media backlash following the extraordinary decision to axe Travis Head, but it is now the Aussie dressing room itself that is facing the social media firing squad after the side was dismissed for just 91 in the second innings. Watch Australia’s Tour of India. Every Test & ODI live & ad-break free during play on Kayo. New to Kayo? Start your free trial now > The Aussie team’s attitude is now up for debate after Allan Border said on Day 3 Australia needs to play with a “harder edge” after watching Steve Smith give a thumbs up to India’s bowlers as they beat the bat. It’s why the photo of Aussie players smiling in the middle of the bloodbath is a particularly bad look as the playing group continues to face criticism over the so-called knifing of former coach Justin Langer. The former mentor was famously unapologetic for his intense, demanding leadership style and his drive to instil greater fight in his players. Fox Cricket cameras broadcast live footage of Aussie stars, including Matt Renshaw, Cameron Green, Ashton Agar and Lance Morris, all laughing on the sideline just moments after Australia had lost its seventh wicket. Matt Renshaw was spotted having a chuckle. Photo: Kayo. Renshaw’s contrbutions during the Test were a golden duck in the first innings and a score of two in the second innings. TV sport presenter Adam Hawse was among those to criticise the Aussie players for the poor look. “Wouldn’t have thought there’s too much to chuckle about. This is a hammering,” he wrote on Twitter. One fan wrote on Twitter: “Seeing this photo really annoys me!! You’re getting flogged but it’s ok to joke and laugh. It would never had happened in Allan Border/Bob Simpson reign”. Pat Cummins sounded devastated in his post-match interviews, but was also seen smiling at the start of the official post-match press conference. Earlier this summer, Sydney Thunder players were also criticised for smiling and sharing jokes in the aftermath of their historic total of just 15 runs. The Thunder recovered to qualify for the BBL finals. Pat Cummins after the Aussies were put out of their misery. Photo by Robert Cianflone/Getty Images. Border had earlier been scathing of the team’s meek collapse. He said the Australians “should be embarrassed by that performance”. “It’s just basic batting technique, we’re just struggling in these conditions, it’s as simple as that,” Border said. “Sometimes I feel we just overthought this particular tour, who should be there, who shouldn’t be there. I think Travis Head (being dropped) is the perfect example that it was chaos before it ever started.” He said of Smith’s friendly interactions with Indian players: “Play with a harder edge. I mean, we’re giving blokes the thumbs up when they’re beating us outside the off stump. “What the hell is going on? That is just ridiculous. Don’t go stupid but Australia play hard-nosed cricket. “We’re even giving someone thumbs up who’s beaten you outside the off-stump, bloody hell.” There was also criticism directed at Aussie officials for the optics coming out of the inner sanctum on the final day of the Test. More Coverage Storm erupts over two words from Test great Indian star found ‘guilty’ amid cream scandal National selector Tony Dodemaide was seen smiling away during conversations with Aussie players, something that has rubbed some the wrong way. There are expected to be several changes made to the Aussie side for the second Test, which begins Friday. Originally published as Photo of Aussie cricket players not a good look right now More related stories Cricket Aussies lose another bowler as bolter’s stocks rise Australia is set to lose another bowler from its squad, enhancing the chances of a shock inclusion from a spinner who will answer an SOS. Read more Cricket Have your say: Every Aussie rated after Nagpur nightmare Australia were embarrassed by India in the first Test in Nagpur, but how would you rate each player’s performance? HAVE YOUR SAY. Read more","pubDate":"2023-02-12 03:10:00","image_url":null,"source_id":"cairnspost","category":["sports"],"country":["australia"],"language":"english"},{"title":"Warner’s position under threat as Australia considers three spinners for second Test","link":"https://www.watoday.com.au/sport/cricket/warner-s-position-under-threat-as-australia-considers-three-spinners-for-second-test-20230212-p5cjuw.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Malcolm Conn"],"video_url":null,"description":"Australia’s cricket hierarchy will discuss replacing David Warner with Travis Head while Queensland spinner Matt Kuhnemann is flying in as a possible shock selection.","content":"Australia may replace David Warner with Travis Head at the top of the order as they consider changes among the wreckage of an innings first Test defeat in Nagpur. Queensland left arm finger spinner Matt Kuhnemann is also a chance to play his first Test after being summoned to India as a replacement for reserve leg-spinner Mitch Swepson, who is returning home for the birth of his child. Kuhnemann, 26, would be a shock selection but he is being considered as a potential third spinner if Cameron Green is fit and the pitch for the second Test in Delhi also aids spinners, as expected. A shock axing for the first Test, Head has been discussed as a possible opening batsman in the subcontinent, where he has struggled in the middle order on previous tours. Sources close to the Australian team confirmed those discussions were continuing after Warner’s double failure in the first Test. Australia lost by an innings and 132 runs inside three days after being bowled out for just 91 in their second innings on Saturday, their lowest score on Indian soil. Most Australian batsmen were completely bamboozled by exceptional Indian spinners Ravi Ashwin and Ravi Jadeja, who claimed 15 of the 20 wickets between them on a helpful surface. David Warner walks back to pavilion after his dismissal during the third day. Credit: AP However it was the way that Warner failed which has raised most concerns, playing late on a ball from Mohammed Shami to lose his off stump for one 13 balls into the Test, then rooted to the crease in the second innings before being trapped lbw for 10 from 41 balls by Ashwin. Warner had a cluttered, and topsy-turvy, home season with some beacons amid the gloom. He had a top score of just 25 in four T20 World Cup innings as Australia bombed out of the tournament at home, then made 86 and 106 in a three-match one-day series against an England side still celebrating their T20 World Cup win.","pubDate":"2023-02-12 02:45:14","image_url":null,"source_id":"watoday","category":["sports"],"country":["australia"],"language":"english"},{"title":"India vs Pakistan, Women's T20 World Cup 2023: When and where to watch?","link":"https://www.indiatoday.in/sports/cricket/story/india-vs-pakistan-womens-t20-world-cup-2023-when-and-where-to-watch-2333602-2023-02-12?utm_source=rss","keywords":null,"creator":null,"video_url":null,"description":"India vs Pakistan, Women's T20 World Cup 2023: When and where to watch?","content":": India will take on Pakistan in their opening match of the Women's T20 World Cup 2023 at Newlands, Cape Town on Sunday, February 12. In the Women's T20 World Cups, it will be the seventh meeting between the two sides. India lead the head-to-head record against Pakistan, having won four out of six matches. Overall, India lead Pakistan 10-3 in T20Is. Let's look at India versus Pakistan match details India and Pakistan will clash on Sunday (February 12). Fans should note that the match is scheduled to start at 6:30 PM IST. The much-awaited clash can be seen on Star Sports Network channels. Fans can also watch the live streaming of the match on Disney+ Hotstar app and website in India. India batting coach Hrishikesh Kanitkar played down the magnitude of India's duel with Pakistan on the eve of the match. He said that his team is looking forward to the challenge. \"When you are growing up you want to play in World Cups and play against strong teams and arch-rivals. These are all things you look forward to doing. Most of our team have played against Pakistan in the past, so they know what to expect and what the atmosphere is like,\" Kanitkar said. India will be without its star opener Smriti Mandhana as she has been ruled out with a finger injury. Kanitkar added that Mandhana will be available for India's second fixture. \"Smriti has a finger injury and is still recovery, so she won't play most-likely. It's not a fracture and we're hopeful she will be available from the second game onwards,\" said Kanitkar.","pubDate":"2023-02-12 02:39:49","image_url":null,"source_id":"indiatoday","category":["sports"],"country":["india"],"language":"english"},{"title":"There is only so much you can do: Shaun Tait defends David Warner","link":"https://www.indiatoday.in/sports/cricket/story/india-vs-australia-border-gavaskar-trophy-shaun-tait-defends-david-warner-after-nagpur-test-2333603-2023-02-12?utm_source=rss","keywords":null,"creator":null,"video_url":null,"description":"There is only so much you can do: Shaun Tait defends David Warner","content":": India routed Australia in the first Test match at . In the opening game of the Border Gavaskar Trophy, Australia succumbed to an innings and 132-run defeat with the game getting wrapped up on Day 3. Australia batted for just a little more than one session in their second outing at Nagpur, folding for just 91 runs in 32.3 overs of the match. Australian opener for his inability to play Ravichandran Ashwin in the second innings of the match. Former Australian cricketer Shaun Tait came in defence of the veteran batter and said that there was only so much that a batter can do when Ashwin is constantly threatening your off-stump. \"Warner showed some signs of playing well, but yes, Ashwin dominates him. You have to look at the sort of selections and say that Travis Head is not the guy you can go to, but then Warner averages 20-21 in these conditions in India. It's not like Warner has come here and had a huge amount of success anyway, so it is not a great surprise,\" Shaun Tait told ESPNcricinfo after the completion of the first Test match. Stating that Warner knows what he has to do in the Indian conditions, Tait said that the batter needs to look for ways of scoring runs in the series. \"David knows what he needs to do. He has spoken about concentrating and batting for long periods of time. But when Ashwin is constantly threatening that off stump, there is only so much you can do against a bowler in that form,\" Tait explained. \"Sitting against Ashwin and defending is not going to help Warner,\" he further added. India take on Australia next in New Delhi, on February 17.","pubDate":"2023-02-12 02:24:08","image_url":null,"source_id":"indiatoday","category":["sports"],"country":["india"],"language":"english"},{"title":"Women's T20 WC: Healy and Gardner shine as Australia overrun New Zealand by 97 runs","link":"https://www.indiatoday.in/sports/cricket/story/womens-t20-world-cup-alyssa-healy-and-ashleigh-gardner-shine-as-australia-overrun-new-zealand-by-97-runs-2333595-2023-02-12?utm_source=rss","keywords":null,"creator":null,"video_url":null,"description":"Women's T20 WC: Healy and Gardner shine as Australia overrun New Zealand by 97 runs","content":": Alyssa Healy and Ashleigh Gardner helped Australia to start their Women's T20 World Cup title defence with a massive 97-run victory over New Zealand in Paarl on February 11. Healy, along with her captain Meg Lanning, formed a 70-run partnership after opener Beth Mooney poked a Lea Tahuhu ball to depart for a two-ball duck. Healy and Lanning added 47 runs in the powerplay, which is Australia's best-ever score in the first six overs against New Zealand at the T20 World Cup. Amelia Kerr got the much-needed breakthrough for New Zealand as Lanning was bowled while playing a cut short at 41. One lead to two as Tahuhu dismissed Gardner cheaply for three. However, Ellyse Perry joined Healy to accelerate, stitching a 50-run partnership in just 28 balls. The star opener Healy eventually perished off a slower ball from Tahuhu for 55. Perry and Grace Harris then lit up the stadium with their fireworks, adding 22 runs in just eight balls. Amelia Kerr trapped Perry in front for 40 before a flurry of wickets led to Australia closing on 173/9 from 20 overs. In reply, New Zealand had the worst of the starts as both their openers and experienced campaigners Suzie Bates and Sophie Devine were back in the hut in the very first over. Megan Schutt trapped both the White Ferns in the space of just three balls, but not before the ball cleared the rope for five wides on the first ball. Bernadine Bezuidenhout and Amelia Kerr tried to stabilise things, but it did not last long as Gardner stormed through New Zealand's line-up. Gardner finished with 5/12, the best T20I figures for Australia across men and women, as New Zealand were bundled out for just 76 in 14 overs.","pubDate":"2023-02-12 01:54:51","image_url":null,"source_id":"indiatoday","category":["sports"],"country":["india"],"language":"english"},{"title":"टेस्ट क्रिकेट में इन 3 भारतीय बल्लेबाजों ने जमकर बनाए हैं रन, लेकिन शतक न लगाने का रहेगा अफसोस","link":"https://hindi.news18.com/news/sports/cricket-3-indian-players-who-have-scored-most-runs-in-test-cricket-without-scoring-a-century-5369507.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"टेस्ट प्रारूप में किसी भी खिलाड़ी के लिए शतक लगाना एक बड़ी उपलब्धि होती है. कुछ बल्लेबाजों ने उम्दा बल्लेबाजी करते हुए शतकों का ढेर लगाया है तो कुछ खिलाड़ी अपने पहले शतक के लिए भी तरसते रहे. बात करें भारतीय टीम के कुछ ऐसे खिलाड़ियों के बारे में जिन्होंने उम्दा बल्लेबाजी करते हुए रन तो बनाए, लेकिन शतक नहीं लगा सके तो टॉप तीन इस प्रकार हैं-","content":"टेस्ट में शतक नहीं लगा पाए हैं ये भारतीय बल्लेबाज. (jockmore/Instagram) नई दिल्ली. भारत और ऑस्ट्रेलिया के बीच खेले जाने वाले बॉर्डर गावस्कर ट्रॉफी (Border Gavaskar Trophy) का आगाज हो गया है. सीरीज का पहला मुकाबला नौ फरवरी से 11 फरवरी के बीच नागपुर में खेला गया. यहां कुछ खिलाड़ियों को छोड़ दें तो दोनों टीमों के बल्लेबाज प्रत्येक रनों के लिए जूझते हुए नजर आए, जो कि टेस्ट क्रिकेट में अक्सर देखने को मिलता है. टेस्ट प्रारूप में किसी भी खिलाड़ी के लिए शतक लगाना एक बड़ी उपलब्धि होती है. कुछ बल्लेबाजों ने उम्दा बल्लेबाजी करते हुए शतकों का ढेर लगाया है तो कुछ खिलाड़ी अपने पहले शतक के लिए भी तरसते रहे. बात करें भारतीय टीम के कुछ ऐसे खिलाड़ियों के बारे में जिन्होंने उम्दा बल्लेबाजी करते हुए रन तो बनाए, लेकिन शतक नहीं लगा सके तो टॉप तीन इस प्रकार हैं- यह भी पढ़ें- INDW vs PAKW: हाईवोल्टेज मुकाबले से पूर्व भारतीय महिला टीम को लगा बड़ा झटका, चोटिल उपकप्तान हुईं बाहर! चेतन चौहान (Chetan Chauhan): इस खास लिस्ट में सबसे पहला बड़ा नाम पूर्व क्रिकेटर चेतन चौहान का आता है. चौहान ने भारतीय टीम के लिए 1969 से 1981 के बीच कुल 40 टेस्ट मुकाबले खेले. इस बीच उनके बल्ले से 68 पारियों में 31.58 की औसत से 2084 रन निकले, लेकिन वह एक भी शतक नहीं लगाए पाए. चेतन चौहान के नाम टेस्ट क्रिकेट में 16 अर्द्धशतक दर्ज है और उनका व्यक्तिगत सर्वश्रेष्ठ बल्लेबाजी प्रदर्शन 97 रन है. किरण मोरे (Kiran More): दुसरे स्थान पर पूर्व क्रिकेटर किरण मोरे का नाम आता है. मोरे ने भारतीय टीम के लिए 1986 से लेकर 1993 के बीच 49 टेस्ट मुकाबले खेले. इस बीच उनके बल्ले से 64 पारियों में 25.7 की औसत से 1285 रन निकले, लेकिन वह एक भी शतक नहीं लगा सके. मोरे के नाम टेस्ट प्रारूप में सात अर्द्धशतक दर्ज है. टेस्ट क्रिकेट में उनका सर्वश्रेष्ठ बल्लेबाजी प्रदर्शन 73 रन है. रूसी सुर्ती (Rusi Surti): तीसरे स्थान पर पूर्व क्रिकेटर रूसी सुर्ती का नाम आता है. सुर्ती ने 1960 से 1969 के बीच भारतीय टीम के लिए 26 टेस्ट मुकाबले खेले. इसके बावजूद उनके बल्ले से एक भी शतक नहीं निकला. सुर्ती के नाम टेस्ट क्रिकेट में नौ अर्द्धशतकों के बदौलत 1263 रन दर्ज है. टेस्ट क्रिकेट में उनका सर्वश्रेष्ठ बल्लेबाजी प्रदर्शन 99 रन है. ब्रेकिंग न्यूज़ हिंदी में सबसे पहले पढ़ें News18 हिंदी| आज की ताजा खबर, लाइव न्यूज अपडेट, पढ़ें सबसे विश्वसनीय हिंदी न्यूज़ वेबसाइट News18 हिंदी| Tags: Kiran more , Team india , Test cricket पहले थिएटर में मिले, फिर इस सोशल प्लेटफॉर्म पर शुरु हुई बात, दिलचस्प है Kantara फेम ऋषभ शेट्टी की लव स्टोरी कभी पवन सिंह संग चरम पर थे अक्षरा सिंह के अफेयर के चर्चे, फिर मिली जान से मारने की धमकी! जानिए वजह बेहद हैंडसम और टैलेंटेड हैं कियारा के भाई मिशाल आडवाणी, बॉलीवुड में हैं एक्टिव, करते हैं ये काम","pubDate":"2023-02-12 01:51:38","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/02/Collage-Maker-12-Feb-2023-07.17-AM-16761664743x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"IND vs AUS: नाच न आवे आंगन टेड़ा...एक हार में ही तिलमिला गई ऑस्ट्रेलियाई मीडिया, अब अपनी टीम पर खड़े किए सवाल","link":"https://hindi.news18.com/news/sports/cricket-australian-media-accused-the-australian-team-after-jadeja-and-the-pitch-of-nagpur-ind-vs-australia-5368885.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"भारत ने नागपुर में ऑस्ट्रेलिया को 132 रन से शिकस्त देकर टेस्ट सीरीज में 1-0 से बढ़त बना ली है. यह मुकाबला विवादों से भरा रहा. पहली पारी के बाद से ही ऑस्ट्रेलियाई मीडिया द्वारा भारत पर गंभीर आरोप लगाए गए थे. वहीं, अब ऑस्ट्रेलिया टीम पर सवाल खड़े किए जा रहे हैं.","content":"ऑस्ट्रेलियाई मीडिया ने रवींद्र जडेजा पर बॉल टेंपरिंग के आरोप लगाए थे. (AP) नई दिल्ली. टीम इंडिया ने बॉर्डर गावस्कर सीरीज (Border Gavaskar Trophy) की आगाज शानदार तरीके से किया है. भारत ने मेहमानों को नागपुर टेस्ट में 132 रन से करारी शिकस्त देकर सीरीज में 1-0 से बढ़त बना ली. इस शर्मनाक हार के बाद ऑस्ट्रेलियाई मीडिया पूरी तरह से बौखला चुकी है. पहली पारी में ही भारतीय स्पिनर्स में मेहमानों को घुटने टेकने पर मजबूर कर दिया था. जिसके बाद पिच को लेकर भारत पर गंभीर आरोप लगाए गए थे. बात यहीं पर नहीं खत्म हुई थी, ऑस्ट्रेलियाई मीडिया द्वारा भारतीय ऑलराउंडर रविंद्र जडेजा पर भी बॉल टेंपरिंग आरोप लगा. जडेजा ने पूरे मैच में कुल 7 विकेट अपने नाम किए थे. बात जब दूसरी पारी की आई तो टीम इंडिया के फिरकी मास्टर अश्विन ने अपना जादू दिखा दिया. जिसके बाद ऑस्ट्रेलिया की पूरी टीम महज 91 रन पर ही सिमट गई. ऑस्ट्रेलियाई मीडिया ने सभी नाकाम कोशिशें कीं. वहीं, अब फॉक्स स्पोर्ट ने अपनी ही टीम को लेकर सवाल खड़े कर दिए हैं. कुछ मीडिया आउटलेट्स का मानना है कि भारतीय खिलाड़ी तकनीकी रूप से बेहतर थे. ट्रेविस हेड को लेकर हुए सवाल फॉक्स स्पोर्ट के मुताबिक ट्रेविस हेड को प्लेइंग इलेवन में न खिलाना ऑस्ट्रेलिया की एक बड़ी गलती थी. साथ ही अगले मैच में कैमरून ग्रीन को खिलाने की मांग की है. दोनों टीमों के बीच दूसरे टेस्ट की शुरुआत 17 फरवरी से होगी. अब देखना होगा कि मेहमान टीम अगले टेस्ट में वापसी करने में कामयाब हो पाती है या नहीं. सूर्यकुमार या केएल राहुल…सरफराज खान के सामने आखिर कौन बना दीवार? सेलेक्शन को लेकर गर्माया माहौल भारत ने बनाए 400 रन ऑस्ट्रेलियाई मीडिया ने स्पिन पिच को लेकर सवाल खड़े किए. जिसके बाद टीम इंडिया ने इसका जवाब अपनी बल्लेबाजी से दिया. रोहित शर्मा ने शानदार शतकीय पारी खेली. उसके बाद रवींद्र जडेजा के 60 और अक्षर पटेल के 84 रन की बदौलत भारत ने 400 रन का आंकड़ा छू लिया. जडेजा के प्रदर्शन के बाद उन्हें प्लेयर ऑफ द मैच से भी नवाजा गया है. ब्रेकिंग न्यूज़ हिंदी में सबसे पहले पढ़ें News18 हिंदी| आज की ताजा खबर, लाइव न्यूज अपडेट, पढ़ें सबसे विश्वसनीय हिंदी न्यूज़ वेबसाइट News18 हिंदी| Tags: Border Gavaskar Trophy , India vs Australia , Ravindra jadeja , Team india कभी पवन सिंह संग चरम पर थे अक्षरा सिंह के अफेयर के चर्चे, फिर मिली जान से मारने की धमकी! जानिए वजह बेहद हैंडसम और टैलेंटेड हैं कियारा के भाई मिशाल आडवाणी, बॉलीवुड में हैं एक्टिव, करते हैं ये काम घर में होने वाली है शादी, तैयारियों के समय 5 बातों का रखें ध्यान, लोगों को लाइफ टाइम याद रहेगी मैरिज","pubDate":"2023-02-12 01:30:42","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/02/jadeja-new-1-16759442263x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"शर्मनाक टेस्ट मैच के बाद ऑस्ट्रेलियाई दिग्गज पर टूटा दुखों का पहाड़, खोया बच्चा, क्रिकेट बोर्ड ने लगाई पाबंदी","link":"https://hindi.news18.com/photogallery/sports/cricket-david-warner-lost-big-thing-after-sand-paper-gate-against-south-africa-banned-for-1-year-by-cricket-australia-5368887.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"वर्ल्ड क्रिकेट में ऑस्ट्रेलिया का रुतबा काफी उंचा रहा है लेकिन ये भी सच है कि इस खेल पर कलंक भी इसी टीम ने लगाए हैं. साल 2018 में 'सैंडपेपर-गेट' ने पूरे क्रिकेट जगत को हिला कर रख दिया था. साउथ अफ्रीका के खिलाफ सीरीज में तब से कप्तान स्टीव स्मिथ, डेविड वार्नर और कैनरून बैनक्राफ्ट का नाम सामने आया था. तीनों के उपर खेल पर दाग लगाने के लिए क्रिकेट ऑस्ट्रेलिया ने कड़ा एक्शन लेते हुए सजा सुनाया था. इस घटना के बाद डेविड वार्नर पर दुखों का पहाड़ टूटा था.","content":"Loading... Loading... Loading... Loading... वर्ल्ड क्रिकेट के इतिहास में यूं तो कई शर्मसार करने वाली घटना हुई है लेकिन साउथ अफ्रीका और ऑस्ट्रेलिया के बीच 2018 का मुकाबला ऐसा था जिसने क्रिकेट बोर्ड का सिर शर्म से झुका दिया था. 'सैंडपेपर-गेट' मामले में तब से कप्तान स्टीव स्मिथ, डेविड वार्नर और कैनरून बैनक्राफ्ट का नाम सामने आया था. तीनों ही मैच में गेंद से छेड़छाड करते पाए गए थे.-AP मार्च 2018 में साउथ अफ्रीका के खिलाफ केप टाउन टेस्ट में स्टीव स्मिथ, डेविड वार्नर और कैनरून बैनक्राफ्ट ने गेंद को सैंड पेपर से घिसकर उसके साथ छेड़छाड़ की थी. यह घटना कैमरे में कैद हो गई और फिर इसको लेकर विवाद ने जोर पकड़ लिया. मामले पर एक्शन लेते हुए क्रिकेट ऑस्ट्रेलिया ने डेविड वार्नर पर एक साल के लिए क्रिकेट खेलने पर पाबंदी लगाई और आजीवन कप्तानी पर बैन लगाया. बाकी स्मिथ पर भी 1 साल का बैन लगा और एक साल कप्तानी पर अतिरिक्त प्रतिबंध लगाया गया.-AP 'सैंडपेपर-गेट' मामले के बाद ऑस्ट्रेलिया के ओपनर डेविड वार्नर पर दुखों का पहाड़ टूटा था. उनकी पत्नी कैंडिस ने एक इंटरव्यू में बताया था कि इस घटना के बाद उन्होंने अपना बच्चा खोया था और उनका गर्भपात हो गया था.-david warner Instagram कैंडिस ने अपने जीवन की इस दुखत घटना का जिक्र करते हुए कहा था, 'मैंने डेविड को बाथरूम के अंदर से बुलाकर बताया कि मेरा खून बह रहा है। उसी वक्त हमें यह पता चल गया था कि शायद मेरा गर्भपात हो गया है. हम एक-दूसरे के गले लगकर रोने लगे-david warner Instagram 1 साल का प्रतिबंध झेलने के बाद ऑस्ट्रेलिया के ओपनर डेविड वार्नर ने इंटरनेशनल क्रिकेट में वापसी की और उन्होंने 2021 में अपनी टीम को शानदार बल्लेबाजी करते हुए टी20 वर्ल्ड चैंपियन बनाया. 7 मुकाबले में 3 अर्धशतक के साथ उन्होंने 48.16 की औसत से 289 रन बनाए थे. डेविड वार्नर को आईसीसी टी20 वर्ल्ड कप 2021 का प्लेयर ऑफ द टूर्नामेंट चुना गया था.-AFP","pubDate":"2023-02-12 01:15:15","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/02/Mohammed-shami-vs-warner-test-1-7-16761477253x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"IND vs AUS: अश्विन को तिकड़ी की बैटिंग पर भी है भरोसा, जडेजा के साथ गेंदबाजी करके हुए गदगद","link":"https://hindi.news18.com/news/sports/cricket-ashwin-reacts-to-ravindra-jadeja-batting-and-bowling-after-india-vs-australia-nagpur-test-5368883.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"भारत ने पहले टेस्ट में ऑस्ट्रेलिया को 132 रन से मात देकर सीरीज में 1-0 से बढ़त बना ली है. पहले टेस्ट में भारतीय स्पिनर्स की तरफ से बेहतरीन प्रदर्शन देखने को मिला. आर अश्विन ने जडेजा के साथ गेंदबाजी करने का अनुभव साझा किया है.","content":"ऑस्ट्रेलिया के खिलाफ अश्विन और जडेजा की जोड़ी ने कमाल का प्रदर्शन किया.(PTI) नई दिल्ली. भारतीय टीम ने बॉर्डर गावस्कर सीरीज (Border Gavaskar Trophy) की शुरुआत में ही अपने तेवर दिखा दिए हैं. टीम इंडिया ने पहले टेस्ट में ऑस्ट्रेलिया को 132 रन से शिकस्त देकर सीरीज में 1-0 से बढ़त बना ली है. इस मैच में टीम इंडिया के ऑलराउंडर्स मेहमान टीम पर पूरी तरह से हावी दिखे. स्पिनर्स ने पहले ही दिन से ऑस्ट्रेलिया को बैकफुट पर ढकेल दिया था. भारत की जीत के बाद चर्चा है तो स्पिनर्स की तिकड़ी की. जिनके प्रदर्शन के बाद ऑस्ट्रेलिया को सबसे शर्मनाक हार का सामना करना पड़ा है. ऑस्ट्रेलिया ने टीम इंडिया के फिरकी मास्टर आर अश्विन का सामना करने के लिए योजना बनाई थी. लेकिन जडेजा की वापसी ने मेहमान टीम के जहन में खौफ भर दिया है. जडेजा ने पहली पारी में पांच बल्लेबाजों को आउट किया, उसके बाद दूसरे दिन बल्ले से कहर बरपाया. वहीं, अक्षर पटेल ने भी बहती गंगा में हाथ धोए और 80 रन की महत्वपूर्ण पारी खेली. उसके बाद तीसरे दिन अश्विन ने ऑस्ट्रेलिया की मेहनत पर पानी फेरा और 31वीं बार टेस्ट में पांच विकेट झटक दिए. इस मैच में अश्विन ने कुल 8 विकेट अपने नाम किए जबकि जडेजा ने 7 विकेट झटके. मैच के बाद अश्विन ने स्पिनर्स की बल्लेबाजी को लेकर भी बात की है. जडेजा से काफी मदद मिलती है- आर अश्विन अश्विन ने जडेजा के साथ गेंदबाजी को लेकर कहा, ‘उनके साथ गेंदबाजी करके काफी मदद मिलती है. जिस तरह से उन्होंने बॉलिंग और बैटिंग की, वह बेहतरीन फॉर्म में हैं. हमें इस बारे में चर्चा करने की आवश्यकता नहीं है कि वह मैदान में कितने अच्छे फील्डर है. वह हमेशा से एक शानदार प्लेयर रहे हैं. मैं इस बात के लिए बहुत आभारी हूं कि मुझे गेंदबाजी करने के लिए मुझे उनके जैसा साथी मिला है. हमारे पास स्पिनर्स का अच्छा समूह है और हम सभी बल्लेबाजी भी कर सकते हैं.’ सूर्यकुमार या केएल राहुल…सरफराज खान के सामने आखिर कौन बना दीवार? सेलेक्शन को लेकर गर्माया माहौल जडेजा को प्लेयर ऑफ द मैच चुना गया रवींद्र जडेजा ने लगभग 6 महीने बाद टीम में वापसी की है. वह लंबे समय से अपनी घुटने की चोट से उभर रहे थे. उन्होंने टीम इंडिया में शानदार तरीके से वापसी की है. जडेजा के हरफनमौला प्रदर्शन के बाद उन्हें प्लेयर ऑफ द मैच से भी नवाजा गया है. ब्रेकिंग न्यूज़ हिंदी में सबसे पहले पढ़ें News18 हिंदी| आज की ताजा खबर, लाइव न्यूज अपडेट, पढ़ें सबसे विश्वसनीय हिंदी न्यूज़ वेबसाइट News18 हिंदी| Tags: Border Gavaskar Trophy , India vs Australia , R ashwin , Ravindra jadeja , Team india पहले थिएटर में मिले, फिर इस सोशल प्लेटफॉर्म पर शुरु हुई बात, दिलचस्प है Kantara फेम ऋषभ शेट्टी की लव स्टोरी कभी पवन सिंह संग चरम पर थे अक्षरा सिंह के अफेयर के चर्चे, फिर मिली जान से मारने की धमकी! जानिए वजह बेहद हैंडसम और टैलेंटेड हैं कियारा के भाई मिशाल आडवाणी, बॉलीवुड में हैं एक्टिव, करते हैं ये काम","pubDate":"2023-02-12 01:00:44","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/02/Ravindra-Jadeja-Ravichandran-Ashwin-PTI-16755072603x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"तस्वीर में दिख रहा बच्चा बड़ा होकर बना क्रिकेट सुपर स्टार, ऑस्ट्रेलिया की नाक में किया दम, घुटने टेकने पर कर दिया मजबूर","link":"https://hindi.news18.com/photogallery/sports/cricket-harbhajan-singh-childhood-photo-with-family-created-history-become-1st-to-take-hat-trick-in-test-5368839.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"वर्ल्ड क्रिकेट में कई ऐसे सितारे हुए हैं जिनके नाम से बड़े-बड़े खिलाड़ी खौफ खाते थे. अगर जो बल्लेबाज विस्फोटक हो तो गेंदबाजों में डर होता था और जो गेंदबाज खतरनाक हो तो बल्लेबाज खौफ खाते थे. भारतीय क्रिकेट में एक ऐसा सितारा उभरा जिससे पूरी की पूरी ऑस्ट्रेलिया की टीम खौफ खाती थी. अपनी पहली ही सीरीज में हैट्रिक के साथ 32 विकेट लेकर अपनी ऐसी धाक जमाई जिसे आज भी कोई भूला नहीं पाया","content":"Loading... Loading... Loading... Loading... भारतीय क्रिकेट से सुपर स्टार टर्बनेटर के नाम से मशहूर हरभजन सिंह को किसी पहचान की जरूरत नहीं है. उनकी दूसरा गेंद ने अच्छे अच्छे बल्लेबाजों को गच्चा दिया. ऑस्ट्रेलिया के खिलाफ टेस्ट डेब्यू सीरीज ऐसी जिसने इतिहास रच दिया. -AFP साल 2001 में ऑस्ट्रेलिया की टीम भारत दौरे पर लगातार 15 टेस्ट मैच जीतकर पहुंची थी. यहां आने के बाद टीम के कप्तान स्टीव वॉ ने धाक जमाने की कोशिश की लेकिन सामना हो गया पंजाबी पुत्तर हरभजन सिंह से. उन्होंने सीरीज में कुल 32 विकेटें चटकाई और टेस्ट मैच तो महज आगाज था. भारतीय टीम ने सीरीज पर भी कब्जा जमाया था. -AFP हरभजन सिंह को वर्ल्ड क्रिकेट के सबसे बेहतरीन ऑफ स्पिनर में शुमार किया जाता है. भारत की तरफ से टेस्ट में हैट्रिक लेने का कमाल सबसे पहले हरभजन सिंह ने किया था. कोलकाता टेस्ट में 2001 की सीरीज के दौरान रिकी पोंटिंग, एडम गिलक्रिस्ट और शेन वार्न को आउट कर यह कमाल किया था -Harbhajan singh Instagram विवादों से भी हरभजन सिंह का नाता जुड़ा. ऑस्ट्रेलिया के दौरे पर 2007-08 में एंड्रयू सायमंड्स के साथ उनका गहरा विवाद हुआ था. सिडनी टेस्ट मैच के दौरान हरभजन सिहं ने सायमंड्स को कुछ कहा और फिर उस लेकर मामला ऐसा उलझा की सचिन तेंदुलकर तक को गवाही देनी पड़ी थी. इंडियन प्रीमियर लीग के दौरान हरभजन ने एस श्रीसंत को थप्पड़ मार दिया था. इसको लेकर भी काफी बड़ा विवाद हुआ था. भज्जी मुंबई इंडियंस में थे जबकि श्री पंजाब की टीम का हिस्सा हुआ करते थे.-AFP हरभजन सिंह भारत की तरफ से इंटरनेशनल क्रिकेट में 700 से ज्यादा विकेट लेने वाले अनिल कुंबले के बाद मात्र दूसरे स्पिनर हैं. साल 2007 में वो आईसीसी टी20 विश्व कप जबकि 2011 में आईसीसी वऩडे वर्ल्ड कप जीतने वाली टीम का हिस्सा थे. दोनों ही टूर्नामेंट में भारतीय टीम की कमान महेंद्र सिंह धोनी के हाथों में थी.-AFP हरभजन सिंह ने 103 टेस्ट, 236 वनडे और 28 टी20 इंटरनेशनल मैच खेले. इसमें टेस्ट में उनके नाम 417 विकेट हैं जिसमे 25 बार उन्होंने एक पारी में 5 विकेट चटकाए हैं. वनडे की बात करें तो यहां 269 विकेट है जबकि टी20 में भज्जी ने महज 25 विकेटें ही हासिल की हैं. हरभजन ने टेस्ट क्रिकेट में 2 शतक जबकि 9 अर्धशतक बनाया है.-AFP","pubDate":"2023-02-12 01:00:12","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/02/harbhajan-singh-childhood-photo-16761441963x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"}]}