{"newsArray":[{"title":"Madhevere hattrick inspires Chevrons","link":"https://www.herald.co.zw/madhevere-hattrick-inspires-chevrons/","keywords":["Sport","Top Stories"],"creator":["dayton"],"video_url":null,"description":"Eddie Chikamhi–Senior Sports Reporter ALL-ROUNDER Wessly Madhevere joined an exclusive company of hattrick heroes for the Zimbabwe national cricket team yesterday when he inspired the Chevrons to a thrilling one run win over Netherlands at Harare Sports Club. The victory was key for the Chevrons to level the series 1-1, ahead of the third match […]","content":"The Herald","pubDate":"2023-03-23 22:19:05","image_url":null,"source_id":"herald_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"WES, YOU BEAUTY!","link":"https://www.hmetro.co.zw/wes-you-beauty/","keywords":["Sport"],"creator":["aurora"],"video_url":null,"description":"Blessing Malinganiza SPINNER Wessly Madhevere said it was a dream come true after his stunning hat-trick guided the Chevrons to a nervy one-run win over the Netherlands to level the ODI series 1-1 at Harare Sports Club yesterday. The two sides will now meet in the decider, at the same venue, tomorrow which, according to […]","content":"H-Metro Blessing Malinganiza SPINNER Wessly Madhevere said it was a dream come true after his stunning hat-trick guided the Chevrons to a nervy one-run win over the Netherlands to level the ODI series 1-1 at Harare Sports Club yesterday. The two sides will now meet in the decider, at the same venue, tomorrow which, according to expectations, could break records for attendance figures, at the home of domestic cricket. “First of all it feels good,” said the all-rounder. “I never imagined myself getting a hat-trick but, I mean, it happened today. “All credit to the coaches, these are the guys that believed in me. “I mean, there’s no better feeling than this one to be honest. Hopefully I will be able to do it again.” His three successive wickets, in one over, inspired Zimbabwe to victory. The 25-year-old came into the attack with Netherlands on 213/3 needing 59 runs from 42 balls. Zimbabwe had laboured to 271 runs all out inside 49.2 overs. He had Colin Ackerman stumped by wicketkeeper, Clive Madande, off his first ball of the over. Madhevere bowled a beauty of a delivery, clean bowling Teja Nidamanuru, the first match hero for the Dutch, for a duck. He then broke Paul Van Meekeren’s timber off the third ball to complete his historic hat-trick. Madhevere became only the third Zimbabwean bowler to claim an ODI hat-trick. He joins an illustrious company that has the likes of Eddo Brandes, the former Zimbabwe seamer who picked a hattrick against England in 1997, at Harare Sports Club. And, former captain Prosper Utseya, who achieved his feat at the same ground against South Africa in 2014. Madhevere finished the match with three wickets for 36 runs from nine overs. He was named the player-of-the-match and walked away with a US$500 cheque. Sean Williams top-scoring with 77 on his return to the squad after a long lay off due to injury.","pubDate":"2023-03-23 22:10:47","image_url":null,"source_id":"hmetro_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"Madhevere’s stunning hat-trick levels ODI series for Chevrons","link":"https://www.chronicle.co.zw/madheveres-stunning-hat-trick-levels-odi-series-for-chevrons/","keywords":["Sport"],"creator":["peter"],"video_url":null,"description":"Brandon Moyo, Sports Reporter OFF spinner Wessly Madhevere became the first Zimbabwean bowler since Prosper Utseya to pick up a hat-trick in One Day Internationals, his sensational bowling seeing Zimbabwe overcome Netherlands by one run in the second ODI cricket encounter at Harare Sports Club to level the series 1-1. Utseya was the last Zimbabwe […]","content":"The Chronicle OFF spinner Wessly Madhevere became the first Zimbabwean bowler since Prosper Utseya to pick up a hat-trick in One Day Internationals, his sensational bowling seeing Zimbabwe overcome Netherlands by one run in the second ODI cricket encounter at Harare Sports Club to level the series 1-1. Utseya was the last Zimbabwe bowler to secure three consecutive wickets in ODIs when he did so against South Africa at Harare Sports Club in August 2014. Madhevere, having earlier on contributed 43 runs with the bat, got his three wickets in the 44th over to finish with 3/36 in nine overs. He dismissed Colin Ackermann, Teja Nidamanuru and Paul van Meekeren to leave Netherlands in all sorts of trouble in their run chase. The visitors were eventually all out for 270 in exactly 50 overs, having taken the contest all the way to the last over only to lose it by the slightest of margins. Zimbabwe, after winning the toss and opting to bat first, were bowled out for 271 in 49.2 overs, their highest scorer being Sean Williams with 77 while Clive Madande had 52. Zimbabwean openers put up a decent start which was however ruined by a dismal display from the middle order before Williams and Madande came to the rescue. Williams, batting while nursing an injured finger top scored with 77 runs off 73 balls while Madande fell for 52 runs from 57 balls as the pair put up a 100-run partnership to help guide Zimbabwe to a defendable total. Dutch spinner, Shariz Ahmad was the star with the ball for the visitors after picking up a five-wicket haul. He finished with figures of 5/43 in 10 overs while Van Meekeren and Ackermann took two scalps each. Max O’Dowd and Tom Cooper went on to score half centuries, finishing on 81 and 74 runs from 103 and 84 runs respectively as they finished as the top scorers. Captain Scott Edwards chipped in with 36 runs from 28 balls. It took a special hat-trick from Madhevere to give Zimbabwe life again leaving the Dutch on 213/6. Fellow off spinner Sikandar Raza compensated for his poor performance with the bat by taking three wickets, including a brilliantly bowled penultimate over to finish with figures of 3/39 in nine overs as well. Lanky fast bowler Blessing Muzarabani took one scalp for the home side, giving away 39 runs in six overs while veteran Tendai Chatara, who was entrusted with the last over did not take any wickets but managed to see the Chevrons through. The series is part of the International Cricket Council (ICC) ODI Super League which serves as a pathway for direct qualification to the World Cup in India in October. Both teams however missed out on direct entry and are using the series as part of their preparations for the World Cup Qualifiers which will be hosted by Zimbabwe in June where only two nations can book their tickets to the global showpiece. The win left everything to play for on Saturday between the two nations, however, the Chevrons will be fancying their chances playing in front of their home fans. — @brandon_malvin","pubDate":"2023-03-23 22:05:27","image_url":null,"source_id":"chronicle_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"Rafiq calls for Cricket Scotland chair to depart","link":"https://www.skysports.com/cricket/news/12040/12841173/azeem-rafiq-calls-for-cricket-scotland-chair-anjan-luthra-to-depart-after-quite-scary-lack-of-respect","keywords":null,"creator":null,"video_url":null,"description":"Azeem Rafiq has called for the chair of Cricket Scotland Anjan Luthra to step down, after showing \"a quite scary lack of respect to everyone\".","content":"Azeem Rafiq has called for the chair of Cricket Scotland Anjan Luthra to step down, after showing \"a quite scary lack of respect to everyone\". Luthra, who was only brought into the role in October 2022, recently claimed \"significant progress\" had been made around Cricket Scotland's approach to equality, diversity and inclusion (EDI) - something met with widespread disagreement. Indeed, Cricket Scotland has since been branded \"unfit for purpose\", \"tone deaf\" and \"arrogant\" following its latest update. Last July, Sky Sports News revealed a damning review found the governing body failed on almost all tests of institutional racism. \"What we saw over the last couple of days with the Cricket Scotland stuff, to be honest it felt like something was coming,\" Rafiq told Sky Sports on Thursday. \"I think the lack of respect shown by the chair towards everyone really, from what's been communicated to me, is quite scary considering he was brought in on the back of a pretty damning report. \"I think it's unfortunate, I'm not sure his position is tenable anymore, and they need to bring in someone who is going to start communicating with all key stakeholders. The Hundred Draft: Shaheen Afridi to spearhead Welsh Fire men's revival | Sophie Devine, Danni Wyatt stay put Dane van Niekerk: Former South Africa captain retires from international cricket aged 29 after Women's T20 World Cup omission Azeem Rafiq says he cannot explain discrepancy between his two versions of Michael Vaughan's alleged racist comment towards him England's 2023 tour of Bangladesh to be shown live on Sky Sports: Three ODIs, three T20s New Zealand vs England: Neil Wagner helps clinch dramatic one-run win - as it happened Women's T20 World Cup: Tahlia McGrath blasts Australia to six-wicket victory over South Africa \"We all have to be [frustrated by the pace of the change]. We've got to start becoming impatient. \"Yes, I accept and understand change takes time, but we've been hearing that for decades. I don't want my kids to be having these conversations. \"I want my kids to be treated fairly, equally, with respect, and if I have to continue putting my head above the parapet to do that, I will.\" Cricket Scotland was branded \"unfit for purpose\", \"tone deaf\" and \"arrogant\" following its latest update on steps taken to tackle racism. The full Cricket Scotland board stepped down last year prior to the publication of an independent review, with Gordon Arthur named interim CEO. Arthur is now stepping down from his role next month for personal reasons. Please use Chrome browser for a more accessible video player As part of Tuesday's update, a statement from new chair Luthra outlined significant progress made around Cricket Scotland's approach to equality, diversity and inclusion (EDI), and he cited a new diversity working group as another step in the right direction. However, anti-racism group Running Out Racism - which helped with the investigation last year - called those claims \"unsubstantiated nonsense\". Furthermore, the group says Cricket Scotland's statement has \"set back trust significantly\" and \"demonstrated that the governing body is failing in learning from mistakes of the past\". Running Out Racism also revealed it has tried to raise concerns in private but is \"sick of fighting for change in public with no results\". The statement read: \"The release by Cricket Scotland today has set back trust significantly and demonstrated that the governing body is failing in learning from the mistakes of the past. \"In order to address the issues in the sport, they must meaningfully engage with people. Not just Running Out Racism, but the wider cricketing community. \"Today's release flies in the face of that. It is tone deaf and arrogant. \"To say they have significantly upgraded [their] approach to EDI is unsubstantiated nonsense. Unless that substantial upgrade is referring to ticking boxes as opposed to the previous strategy of ignoring the problem. They continue to ignore the very people who have been ignored for so long. \"To cite the EDI working group as an achievement is frankly embarrassing. At the first meeting in January, formed after five months of faffing around, some members of the group raised significant concerns around the intent of the governing body to meaningfully engage with people who have expertise in this area. \"Following that, the governing body put out a positive update, which was astounding to some who sat in that same meeting, and has subsequently ignored the group. None of today's changes have made it to that group for consultation. A group that took five months to form and has only met once.\" The issues of institutional racism came to light following an interview on Sky Sports News with Scotland's Majid Haq and team-mate Qasim Sheikh The lawyer representing both players, Aamer Anwar, said: \"Despite the horrific exposure of institutional racism, Cricket Scotland's empty soundbites today shows that it remains unfit for purpose. \"Both Majid Haq and Qasim Sheikh are sad to see the chief executive Gordon Arthur step down, he was a man who genuinely fought for change to take place. \"My clients, both Majid and Qasim, believe the chair has failed to deliver or inspire genuine confidence from across the sport, and they regard the process as little more than an 'arrogant cosmetic box ticking exercise'. \"It's time that Sport Scotland stepped in with special measures, the only winners today are institutional racism and the dinosaurs who now appear even more entrenched.\" In July it was revealed there were 448 examples of institutional racism and discrimination identified within the game by the Changing The Boundaries report - which led to Cricket Scotland being put in special measures by funding body SportScotland. However, as part of the six-month update, Luthra said he expected the progress being made will lead to those measures being lifted. Luthra said: \"Our current trajectory means that we will exit special measures by October 31 and ensure Cricket Scotland continues its work towards becoming the most inclusive sport in the country over the long term.\" However, Scotland's national agency for sport responded by clarifying only it will make that decision. A SportScotland spokesperson said: \"We are considering the various points raised in Cricket Scotland's latest update. \"We welcome the progress that has been made to date but we are clear that only by engaging in real and meaningful consultation will cultural change be delivered within the sport. \"The final decision on whether Cricket Scotland exits special measures will be taken by SportScotland and will be dependent on all recommendations from the Changing The Boundaries report being met in full.\"","pubDate":"2023-03-23 21:40:00","image_url":"https://e2.365dm.com/22/10/1920x1080/skysports-azeem-rafiq-cricket_5930493.jpg?20221014120000","source_id":"skysports","category":["sports"],"country":["australia","united kingdom","united states of america"],"language":"english"},{"title":"News24.com | Captain Markram primed to lead Proteas: 'I've had my eye on Aiden for a very long time'","link":"https://www.news24.com/sport/Cricket/Proteas/captain-markram-primed-to-lead-proteas-ive-had-my-eye-on-aiden-for-a-very-long-time-20230323","keywords":null,"creator":null,"video_url":null,"description":"New Proteas white-ball coach Rob Walter has praised the array of options open to him, but says he has always been fully aware of the leadership capabilities offered by Aiden Markram.","content":"New Proteas white-ball coach Rob Walter has praised the array of options open to him, but says he has always been fully aware of the leadership capabilities offered by Aiden Markram. READ | World Cup fate: Proteas seniors must stay at the wheel as Dutch date with destiny looms Markram, who captained the Proteas on Tuesday in a four-wicket win over the West Indies to level the ODI series 1-1, captains South Africa in the three-match T20 series against the same opponents that starts on Saturday. Speaking to reporters on Thursday, Walter acknowledged that Markram, who also captained the SA U19 side to World Cup glory in 2014 and the Sunrisers Eastern Cape to the inaugural SA20 title earlier this year, had done a fine job in Temba Bavuma's absence during the third ODI. \"It wasn't a clincher. I've had my eye on Aiden for a very long time from a leadership point of view and have watched him go about his work,\" said Walter. \"I thought he did a very good job, and it's not surprising. I'm fully aware of his leadership capabilities, and I thought he marshalled the troops quite nicely. \"He made some good tactical decisions around bowling changes, which was good to see, so I'm just looking for more of the same,\" Walter added. The Proteas limited-overs mentor confirmed there were other reasons why Markram was given the captain's armband of the T20 side. \"Part of Aiden's appointment is also looking forward and understanding where he is in his cricketing cycle and how many years he'll hopefully be dedicating to the Proteas.\" \"I think the SA20 gave us a glimpse into his style and his ability from a leadership point of view, so I don't think we'll see anything different from that.\"","pubDate":"2023-03-23 19:52:40","image_url":"https://scripts.24.co.za/img/sites/sport24.png","source_id":"news24","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Sangakkara recommended Viyaskanth as net bowler for Rajasthan team","link":"https://www.dailymirror.lk/breaking_news/Sangakkara-recommended-Viyaskanth-as-net-bowler-for-Rajasthan-team/108-256426","keywords":null,"creator":null,"video_url":null,"description":"Vijayakanth Viyaskanth was recommended as a net bowler for the IPL’s Rajasthan Royals by the former Sri Lanka captain and the ex-MCC President Kumar Sangakkara.","content":"Vijayakanth Viyaskanth was recommended as a net bowler for the IPL’s Rajasthan Royals by the former Sri Lanka captain and the ex-MCC President Kumar Sangakkara. Sangakkara is the Director of Cricket at the Royals franchise team. Speaking to Daily Mirror, Viyaskanth said, \"First of all I would like to thank the Rajasthan Royals team for giving me such a wonderful opportunity. I heartily thank the respected Sangakkara for recommending my name as a net bowler.” \"I performed well in the LPL (Lanka Premier League) and the BPL (Bangladesh Premier League). I gained more experience in playing these big tournaments. Now I will be able to bowl at the world's leading batters in the IPL. The IPL is a big tournament. Though, at present I am there only as a new bowler but my hope is to take part in it\". \"Yes, I have much confidence now but being a youngster, I need to improve my skills which will be gained by doing hard work in my field. I wish to play for our national Sri Lankan team and establish my place in the T-20 team,” he said. Viyaskanth will be in India at the earliest once his visa formalities are completed this weekend. He will be based at Nagpur for the team's training sessions. (Bipin Dani)","pubDate":"2023-03-23 19:09:00","image_url":"https://bmkltsly13vb.compat.objectstorage.ap-singapore-1.oraclecloud.com/cdn.sg.dailymirror.lk/assets/uploads/image_b6c2951e96.jpg","source_id":"dailymirror","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Captain is proof scandal can enhance your reputation","link":"https://www.cairnspost.com.au/sport/cricket/australias-most-marketable-athlete-pat-cummins-proof-a-scandal-wont-derail-your-career/news-story/8607145351709707812e468b195d6853","keywords":["Cricket news and galleries","Sport news and galleries"],"creator":null,"video_url":null,"description":"Pat Cummins has brushed aside the Alinta Energy affair to be voted Australia’s most marketable athlete.","content":null,"pubDate":"2023-03-23 19:01:00","image_url":null,"source_id":"cairnspost","category":["sports"],"country":["australia"],"language":"english"},{"title":"The Hundred Draft 2023: London Spirit pick up Olly Stone as Oval Invincibles select Heinrich Klaasen","link":"https://www.standard.co.uk/sport/cricket/hundred-draft-2023-london-spirit-oval-invincibles-b1069566.html","keywords":["Cricket","Sport"],"creator":["Malik Ouzia"],"video_url":null,"description":"London Spirit have added Australia batter Mitchell Marsh and England quick Olly Stone to their men’s squad ahead of this summer’s Hundred, while Oval Invincibles selected South Africa’s Heinrich Klaasen, but high-profile overseas players were largely snubbed during Thursday’s Draft.","content":"have added Australia batter and quick to their men’s squad ahead of this summer’s Hundred, while selected South Africa’s Heinrich Klaasen, but high-profile overseas players were largely snubbed during Thursday’s Draft. The likes of Babar Azam, Trent Boult, Mohammad Rizwan and Shakib Al Hasan all went unselected as teams placed an emphasis on leading domestic talent and player availability ahead of star power, with the third edition of the competition due to overlap with several bilateral international series this summer. Marsh’s availability for Spirit will depend upon the scheduling of Australia’s white-ball tour to South Africa, which is yet to be finalised. As well as Klaasen, who excelled in the winter’s SA20 and for the Proteas in their recent ODI series victory over England, Invincibles have added exciting Pakistan quick Ihsanullah, the 20-year-old having been named player of the tournament at the PSL earlier this month. Last year’s bottom-ranked side Welsh Fire have also looked to Pakistan for pace, making Shaheen Afridi and Haris Rauf key components of their sizeable rebuild, having chosen to retain just five of a possible 11 players ahead of the Draft. SPONSORED The Fire used their top £125,000 selection to sign Tom Abell, who is expected to captain, and later added England seamer David Willey for £100,000, after their initial move for Tim David with the No1 pick was thwarted by Southern Brave as they exercised their Right To Match to re-sign the Australian hitter. Middlesex batter Stevie Eskinazi is also heading to Cardiff after being rewarded for his fine white-ball form over a prolonged period with a belated first Hundred gig. England Test opener Ben Duckett was one of those to have left the Fire and got his wish in joining the likes of Moeen Ali, Liam Livingstone and Will Smeed at Birmingham Phoenix on a £125,000 deal. Laurie Evans, who was this week cleared to return to action after having a provisional doping suspension lifted, was immediately picked up for £100,000 by Manchester Originals. Beyond the top salary brackets, New Zealand players proved popular, as expected, the Black Caps benefitting a clear international window during August and then facing England in an ODI series immediately after the Hundred. Glenn Phillips (Fire), Devon Conway (Brave) and Michael Bracewell (Northern Superchargers) all landed deals in the £60,000 bracket. The Fire also had the first pick in the women’s Draft, being staged for the first time, but were denied each of their first two selections as first Phoenix and then Brave used RTM cards on New Zealand batter Sophie Devine and England’s Danni Wyatt. The Fire eventually took Wyatt’s England opening partner Sophia Dunkley, who had also previously been at the Brave, with their first pick and used their hefty draft capital to add South African quick Shabnim Ismail and England’s Freya Davies. The Spirit, who finished second-bottom in last year’s tournament, moved quickly to nab Australian all-rounder Grace Harris and England spinner Sarah Glenn, while defending champions Oval have managed to reassemble the bulk of last year’s side after re-signing former captain Dane van Niekerk, batter Susie Bates and spinner Mady Villiers, though Ismail’s move to Wales is a blow. India captain Harmanpreet Kaur was the top selection for Trent Rockets, while in-form South African batter Laura Wolvaardt and England seamer Kate Cross effectively swapped places, taken in the top £31,250 salary bracket by the Originals and Superchargers, respectively. Each women’s team still has seven places to fill in their squad, with negotiations now due to take place in an open market, while the men’s squads will be completed with two wildcard selections following the first stage of the summer’s Vitality Blast.","pubDate":"2023-03-23 18:39:20","image_url":"https://static.standard.co.uk/2023/02/09/09/newFile-7.jpg?width=1200&auto=webp","source_id":"standarduk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"News24.com | Madhevere hat-trick sets up dramatic Zimbabwe win","link":"https://www.news24.com/sport/Cricket/madhevere-hat-trick-sets-up-dramatic-zimbabwe-win-20230323","keywords":null,"creator":null,"video_url":null,"description":"Wessly Madhevere took a hat-trick and set up a dramatic finish as Zimbabwe beat Netherlands by one run in the second of three World Cup Super League one-day internationals in Harare on Thursday.","content":"Wessly Madhevere took a hat-trick and set up a dramatic finish as Zimbabwe beat Netherlands by one run in the second of three World Cup Super League one-day internationals in Harare on Thursday. It went down to the last ball when last man Ryan Klein was run out attempting a near-impossible third run which would have tied the match. The Netherlands were seemingly cruising in pursuit of Zimbabwe's 271 all out at 213 for four before off-spinner Madhevere dismissed Colin Ackermann, Teja Nidamanuru and Paul van Meekeren off the first three balls of the 44th over. Netherlands captain Scott Edwards hit 36 but his team's hopes seemed over when he fell to off-spinner Sikandar Raza with 20 runs still needed off nine balls. It came down to 10 needed off the last two balls. Fred Klaassen hit a six off Tendai Chatara and then drove the last ball into the covers. The batsmen ran two but Brad Evans' throw to Chatara left Klein well short of his ground. Max O'Dowd (81) and Tom Cooper (74) laid the foundation for what seemed a likely Netherlands win with a second-wicket partnership of 125 off 152 balls. Sean Williams, returning after a finger injury, top-scored for Zimbabwe with 77 while 19-year-old leg-spinner Shariz Ahmad took five wickets for 43 runs for the Netherlands. The series decider will be played at the same venue on Saturday. Brief scores: Zimbabwe 271 in 49.2 overs (C. Ervine 39, W. Madhevere 43, S. Williams 77, C. Madande 52; P van Meekeren 2-66, C. Ackermann 2-51, Shariz Ahmad 5-43) v Netherlands 270 in 50 overs (M. O'Dowd 81, T. Cooper 74, S. Edwards 36; S. Raza 3-39, Madhevere 3-36) Result: Zimbabwe won by one run Series: Tied at 1-1 with one match to come on Saturday Toss: Zimbabwe","pubDate":"2023-03-23 18:22:10","image_url":"https://scripts.24.co.za/img/sites/sport24.png","source_id":"news24","category":["sports"],"country":["south africa"],"language":"english"},{"title":"The Hundred Draft: Afridi to lead Fire revival | Devine, Wyatt stay put","link":"https://www.skysports.com/cricket/news/12040/12840984/the-hundred-draft-shaheen-afridi-to-spearhead-welsh-fire-mens-revival-sophie-devine-danni-wyatt-stay-put","keywords":null,"creator":null,"video_url":null,"description":"Pakistan fast bowler Shaheen Afridi has been chosen to spearhead the Welsh Fire's attempted revival in The Hundred men's tournament in 2023 after going in the £100,000 category at the player draft.","content":"Pakistan fast bowler Shaheen Afridi has been chosen to spearhead the Welsh Fire's attempted revival in The Hundred men's tournament in 2023 after going in the £100,000 category at the player draft. The Fire are rebuilding following a difficult 2022 which saw them finish bottom of the table after losing all eight matches, with left-arm paceman Afridi joining the team's first pick in Thursday's player draft, Tom Abell, and another £125,000 selection in England all-rounder David Willey in the new-look squad. Afridi's compatriot and right-arm fast bowler Haris Rauf was chosen by the Fire in the later rounds too, yet several of the other big-name men's overseas players were not chosen. Bangladesh star Shakib Al Hasan, West Indies all-rounder Kieron Pollard and Australian duo Marcus Stoinis and Adam Zampa were not selected in the £125,000 category, while Pakistan captain Babar Azam, New Zealand seamer Trent Boult, and West Indies all-rounders Dwayne Bravo and Andre Russell were among those passed on in the £100,000 category. Elsewhere, England batter Ben Duckett got his wish of moving to Birmingham Phoenix from the Fire on the fourth pick, with the Cardiff franchise selecting his international team-mate Willey with the final pick of the first round. \"Difficult leaving a side I've played for, for the past two years, but for me personally it felt it was time to have a fresh start,\" Duckett said of his move to Edgbaston. \"Only winning a couple of games in two years, I hope they get on track this year, but three years in a career is a long time and Birmingham is a great ground to play at. The Hundred Draft: As it happened! The Hundred 2023 fixtures Please use Chrome browser for a more accessible video player \"[Phoenix] seem to have a great team playing against them, some explosive batters - I'll try and play anchor and get them on strike.\" Among the other England internationals up for grabs, Reece Topley is moving to Northern Superchargers from Oval Invincibles after being chosen in the second round, while fellow fast bowler Olly Stone is set for his Hundred bow this year after being picked up by London Spirit. The afternoon began with the historic first women's player draft in UK professional sport and Sophie Devine was the first name selected, being chosen by the Fire. However, the Phoenix opted to exercise their 'right to match' to retain the services of the New Zealander who scored 102 runs and took two wickets for the Edgbaston-based franchise in 2022. Birmingham Phoenix: Sophie Devine (right to match). Southern Brave: Danni Wyatt (right to match). Welsh Fire: Sophia Dunkley. London Spirit: Grace Harris. Manchester Originals: Laura Wolvaardt. Northern Superchargers: Kate Cross. Trent Rockets: Harmanpreet Kaur. Oval Invincibles: Suzie Bates. Meanwhile, India captain Harmanpreet Kaur, who topped the women's batting averages playing for the Manchester Originals in the first year of The Hundred, went to the Trent Rockets with the seventh pick of the draft. Another big overseas name to go in the first round was South African Laura Wolvaardt, who was chosen by the Originals, while compatriots Chloe Tryon and Lizelle Lee were chosen by the Southern Brave and Rockets respectively in the later rounds. Of the England internationals to go in the first round, Danni Wyatt remained with the Brave after they exercised their right to match and blocked the Fire again on the second pick. The Welsh franchise were eventually able to get Sophia Dunkley with the third pick of the draft, while the Northern Superchargers brought in Kate Cross. Please use Chrome browser for a more accessible video player \"Absolutely delighted to be back, I can't wait to get going again in the summer,\" Wyatt told Sky Sports after her return to the Brave was confirmed. \"We maybe need another bowler, another all-rounder is really handy, I've seen we've got Chloe Tryon and Anya [Shrubsole] back which is great news.\" Sky Sports will show all 68 games in The Hundred live this summer. Trent Rockets face Southern Brave in opening game of the 2023 Hundred on August 1, live on Sky Sports Cricket .","pubDate":"2023-03-23 18:05:00","image_url":"https://e2.365dm.com/23/03/1920x1080/skysports-shaheen-afridi-danni-wyatt_6098224.jpg?20230323175901","source_id":"skysports","category":["sports"],"country":["australia","united kingdom","united states of america"],"language":"english"},{"title":"Madhevere hattrick inspires Chevrons","link":"https://www.herald.co.zw/madhevere-hattrick-inspires-chevrons/","keywords":["Sport","Top Stories"],"creator":["dayton"],"video_url":null,"description":"Eddie Chikamhi–Senior Sports Reporter ALL-ROUNDER Wessly Madhevere joined an exclusive company of hattrick heroes for the Zimbabwe national cricket team yesterday when he inspired the Chevrons to a thrilling one run win over Netherlands at Harare Sports Club. The victory was key for the Chevrons to level the series 1-1, ahead of the third match […]","content":"The Herald","pubDate":"2023-03-23 22:19:05","image_url":null,"source_id":"herald_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"WES, YOU BEAUTY!","link":"https://www.hmetro.co.zw/wes-you-beauty/","keywords":["Sport"],"creator":["aurora"],"video_url":null,"description":"Blessing Malinganiza SPINNER Wessly Madhevere said it was a dream come true after his stunning hat-trick guided the Chevrons to a nervy one-run win over the Netherlands to level the ODI series 1-1 at Harare Sports Club yesterday. The two sides will now meet in the decider, at the same venue, tomorrow which, according to […]","content":"H-Metro Blessing Malinganiza SPINNER Wessly Madhevere said it was a dream come true after his stunning hat-trick guided the Chevrons to a nervy one-run win over the Netherlands to level the ODI series 1-1 at Harare Sports Club yesterday. The two sides will now meet in the decider, at the same venue, tomorrow which, according to expectations, could break records for attendance figures, at the home of domestic cricket. “First of all it feels good,” said the all-rounder. “I never imagined myself getting a hat-trick but, I mean, it happened today. “All credit to the coaches, these are the guys that believed in me. “I mean, there’s no better feeling than this one to be honest. Hopefully I will be able to do it again.” His three successive wickets, in one over, inspired Zimbabwe to victory. The 25-year-old came into the attack with Netherlands on 213/3 needing 59 runs from 42 balls. Zimbabwe had laboured to 271 runs all out inside 49.2 overs. He had Colin Ackerman stumped by wicketkeeper, Clive Madande, off his first ball of the over. Madhevere bowled a beauty of a delivery, clean bowling Teja Nidamanuru, the first match hero for the Dutch, for a duck. He then broke Paul Van Meekeren’s timber off the third ball to complete his historic hat-trick. Madhevere became only the third Zimbabwean bowler to claim an ODI hat-trick. He joins an illustrious company that has the likes of Eddo Brandes, the former Zimbabwe seamer who picked a hattrick against England in 1997, at Harare Sports Club. And, former captain Prosper Utseya, who achieved his feat at the same ground against South Africa in 2014. Madhevere finished the match with three wickets for 36 runs from nine overs. He was named the player-of-the-match and walked away with a US$500 cheque. Sean Williams top-scoring with 77 on his return to the squad after a long lay off due to injury.","pubDate":"2023-03-23 22:10:47","image_url":null,"source_id":"hmetro_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"Madhevere’s stunning hat-trick levels ODI series for Chevrons","link":"https://www.chronicle.co.zw/madheveres-stunning-hat-trick-levels-odi-series-for-chevrons/","keywords":["Sport"],"creator":["peter"],"video_url":null,"description":"Brandon Moyo, Sports Reporter OFF spinner Wessly Madhevere became the first Zimbabwean bowler since Prosper Utseya to pick up a hat-trick in One Day Internationals, his sensational bowling seeing Zimbabwe overcome Netherlands by one run in the second ODI cricket encounter at Harare Sports Club to level the series 1-1. Utseya was the last Zimbabwe […]","content":"The Chronicle OFF spinner Wessly Madhevere became the first Zimbabwean bowler since Prosper Utseya to pick up a hat-trick in One Day Internationals, his sensational bowling seeing Zimbabwe overcome Netherlands by one run in the second ODI cricket encounter at Harare Sports Club to level the series 1-1. Utseya was the last Zimbabwe bowler to secure three consecutive wickets in ODIs when he did so against South Africa at Harare Sports Club in August 2014. Madhevere, having earlier on contributed 43 runs with the bat, got his three wickets in the 44th over to finish with 3/36 in nine overs. He dismissed Colin Ackermann, Teja Nidamanuru and Paul van Meekeren to leave Netherlands in all sorts of trouble in their run chase. The visitors were eventually all out for 270 in exactly 50 overs, having taken the contest all the way to the last over only to lose it by the slightest of margins. Zimbabwe, after winning the toss and opting to bat first, were bowled out for 271 in 49.2 overs, their highest scorer being Sean Williams with 77 while Clive Madande had 52. Zimbabwean openers put up a decent start which was however ruined by a dismal display from the middle order before Williams and Madande came to the rescue. Williams, batting while nursing an injured finger top scored with 77 runs off 73 balls while Madande fell for 52 runs from 57 balls as the pair put up a 100-run partnership to help guide Zimbabwe to a defendable total. Dutch spinner, Shariz Ahmad was the star with the ball for the visitors after picking up a five-wicket haul. He finished with figures of 5/43 in 10 overs while Van Meekeren and Ackermann took two scalps each. Max O’Dowd and Tom Cooper went on to score half centuries, finishing on 81 and 74 runs from 103 and 84 runs respectively as they finished as the top scorers. Captain Scott Edwards chipped in with 36 runs from 28 balls. It took a special hat-trick from Madhevere to give Zimbabwe life again leaving the Dutch on 213/6. Fellow off spinner Sikandar Raza compensated for his poor performance with the bat by taking three wickets, including a brilliantly bowled penultimate over to finish with figures of 3/39 in nine overs as well. Lanky fast bowler Blessing Muzarabani took one scalp for the home side, giving away 39 runs in six overs while veteran Tendai Chatara, who was entrusted with the last over did not take any wickets but managed to see the Chevrons through. The series is part of the International Cricket Council (ICC) ODI Super League which serves as a pathway for direct qualification to the World Cup in India in October. Both teams however missed out on direct entry and are using the series as part of their preparations for the World Cup Qualifiers which will be hosted by Zimbabwe in June where only two nations can book their tickets to the global showpiece. The win left everything to play for on Saturday between the two nations, however, the Chevrons will be fancying their chances playing in front of their home fans. — @brandon_malvin","pubDate":"2023-03-23 22:05:27","image_url":null,"source_id":"chronicle_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"Rafiq calls for Cricket Scotland chair to depart","link":"https://www.skysports.com/cricket/news/12040/12841173/azeem-rafiq-calls-for-cricket-scotland-chair-anjan-luthra-to-depart-after-quite-scary-lack-of-respect","keywords":null,"creator":null,"video_url":null,"description":"Azeem Rafiq has called for the chair of Cricket Scotland Anjan Luthra to step down, after showing \"a quite scary lack of respect to everyone\".","content":"Azeem Rafiq has called for the chair of Cricket Scotland Anjan Luthra to step down, after showing \"a quite scary lack of respect to everyone\". Luthra, who was only brought into the role in October 2022, recently claimed \"significant progress\" had been made around Cricket Scotland's approach to equality, diversity and inclusion (EDI) - something met with widespread disagreement. Indeed, Cricket Scotland has since been branded \"unfit for purpose\", \"tone deaf\" and \"arrogant\" following its latest update. Last July, Sky Sports News revealed a damning review found the governing body failed on almost all tests of institutional racism. \"What we saw over the last couple of days with the Cricket Scotland stuff, to be honest it felt like something was coming,\" Rafiq told Sky Sports on Thursday. \"I think the lack of respect shown by the chair towards everyone really, from what's been communicated to me, is quite scary considering he was brought in on the back of a pretty damning report. \"I think it's unfortunate, I'm not sure his position is tenable anymore, and they need to bring in someone who is going to start communicating with all key stakeholders. The Hundred Draft: Shaheen Afridi to spearhead Welsh Fire men's revival | Sophie Devine, Danni Wyatt stay put Dane van Niekerk: Former South Africa captain retires from international cricket aged 29 after Women's T20 World Cup omission Azeem Rafiq says he cannot explain discrepancy between his two versions of Michael Vaughan's alleged racist comment towards him England's 2023 tour of Bangladesh to be shown live on Sky Sports: Three ODIs, three T20s New Zealand vs England: Neil Wagner helps clinch dramatic one-run win - as it happened Women's T20 World Cup: Tahlia McGrath blasts Australia to six-wicket victory over South Africa \"We all have to be [frustrated by the pace of the change]. We've got to start becoming impatient. \"Yes, I accept and understand change takes time, but we've been hearing that for decades. I don't want my kids to be having these conversations. \"I want my kids to be treated fairly, equally, with respect, and if I have to continue putting my head above the parapet to do that, I will.\" Cricket Scotland was branded \"unfit for purpose\", \"tone deaf\" and \"arrogant\" following its latest update on steps taken to tackle racism. The full Cricket Scotland board stepped down last year prior to the publication of an independent review, with Gordon Arthur named interim CEO. Arthur is now stepping down from his role next month for personal reasons. Please use Chrome browser for a more accessible video player As part of Tuesday's update, a statement from new chair Luthra outlined significant progress made around Cricket Scotland's approach to equality, diversity and inclusion (EDI), and he cited a new diversity working group as another step in the right direction. However, anti-racism group Running Out Racism - which helped with the investigation last year - called those claims \"unsubstantiated nonsense\". Furthermore, the group says Cricket Scotland's statement has \"set back trust significantly\" and \"demonstrated that the governing body is failing in learning from mistakes of the past\". Running Out Racism also revealed it has tried to raise concerns in private but is \"sick of fighting for change in public with no results\". The statement read: \"The release by Cricket Scotland today has set back trust significantly and demonstrated that the governing body is failing in learning from the mistakes of the past. \"In order to address the issues in the sport, they must meaningfully engage with people. Not just Running Out Racism, but the wider cricketing community. \"Today's release flies in the face of that. It is tone deaf and arrogant. \"To say they have significantly upgraded [their] approach to EDI is unsubstantiated nonsense. Unless that substantial upgrade is referring to ticking boxes as opposed to the previous strategy of ignoring the problem. They continue to ignore the very people who have been ignored for so long. \"To cite the EDI working group as an achievement is frankly embarrassing. At the first meeting in January, formed after five months of faffing around, some members of the group raised significant concerns around the intent of the governing body to meaningfully engage with people who have expertise in this area. \"Following that, the governing body put out a positive update, which was astounding to some who sat in that same meeting, and has subsequently ignored the group. None of today's changes have made it to that group for consultation. A group that took five months to form and has only met once.\" The issues of institutional racism came to light following an interview on Sky Sports News with Scotland's Majid Haq and team-mate Qasim Sheikh The lawyer representing both players, Aamer Anwar, said: \"Despite the horrific exposure of institutional racism, Cricket Scotland's empty soundbites today shows that it remains unfit for purpose. \"Both Majid Haq and Qasim Sheikh are sad to see the chief executive Gordon Arthur step down, he was a man who genuinely fought for change to take place. \"My clients, both Majid and Qasim, believe the chair has failed to deliver or inspire genuine confidence from across the sport, and they regard the process as little more than an 'arrogant cosmetic box ticking exercise'. \"It's time that Sport Scotland stepped in with special measures, the only winners today are institutional racism and the dinosaurs who now appear even more entrenched.\" In July it was revealed there were 448 examples of institutional racism and discrimination identified within the game by the Changing The Boundaries report - which led to Cricket Scotland being put in special measures by funding body SportScotland. However, as part of the six-month update, Luthra said he expected the progress being made will lead to those measures being lifted. Luthra said: \"Our current trajectory means that we will exit special measures by October 31 and ensure Cricket Scotland continues its work towards becoming the most inclusive sport in the country over the long term.\" However, Scotland's national agency for sport responded by clarifying only it will make that decision. A SportScotland spokesperson said: \"We are considering the various points raised in Cricket Scotland's latest update. \"We welcome the progress that has been made to date but we are clear that only by engaging in real and meaningful consultation will cultural change be delivered within the sport. \"The final decision on whether Cricket Scotland exits special measures will be taken by SportScotland and will be dependent on all recommendations from the Changing The Boundaries report being met in full.\"","pubDate":"2023-03-23 21:40:00","image_url":"https://e2.365dm.com/22/10/1920x1080/skysports-azeem-rafiq-cricket_5930493.jpg?20221014120000","source_id":"skysports","category":["sports"],"country":["australia","united kingdom","united states of america"],"language":"english"},{"title":"News24.com | Captain Markram primed to lead Proteas: 'I've had my eye on Aiden for a very long time'","link":"https://www.news24.com/sport/Cricket/Proteas/captain-markram-primed-to-lead-proteas-ive-had-my-eye-on-aiden-for-a-very-long-time-20230323","keywords":null,"creator":null,"video_url":null,"description":"New Proteas white-ball coach Rob Walter has praised the array of options open to him, but says he has always been fully aware of the leadership capabilities offered by Aiden Markram.","content":"New Proteas white-ball coach Rob Walter has praised the array of options open to him, but says he has always been fully aware of the leadership capabilities offered by Aiden Markram. READ | World Cup fate: Proteas seniors must stay at the wheel as Dutch date with destiny looms Markram, who captained the Proteas on Tuesday in a four-wicket win over the West Indies to level the ODI series 1-1, captains South Africa in the three-match T20 series against the same opponents that starts on Saturday. Speaking to reporters on Thursday, Walter acknowledged that Markram, who also captained the SA U19 side to World Cup glory in 2014 and the Sunrisers Eastern Cape to the inaugural SA20 title earlier this year, had done a fine job in Temba Bavuma's absence during the third ODI. \"It wasn't a clincher. I've had my eye on Aiden for a very long time from a leadership point of view and have watched him go about his work,\" said Walter. \"I thought he did a very good job, and it's not surprising. I'm fully aware of his leadership capabilities, and I thought he marshalled the troops quite nicely. \"He made some good tactical decisions around bowling changes, which was good to see, so I'm just looking for more of the same,\" Walter added. The Proteas limited-overs mentor confirmed there were other reasons why Markram was given the captain's armband of the T20 side. \"Part of Aiden's appointment is also looking forward and understanding where he is in his cricketing cycle and how many years he'll hopefully be dedicating to the Proteas.\" \"I think the SA20 gave us a glimpse into his style and his ability from a leadership point of view, so I don't think we'll see anything different from that.\"","pubDate":"2023-03-23 19:52:40","image_url":"https://scripts.24.co.za/img/sites/sport24.png","source_id":"news24","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Sangakkara recommended Viyaskanth as net bowler for Rajasthan team","link":"https://www.dailymirror.lk/breaking_news/Sangakkara-recommended-Viyaskanth-as-net-bowler-for-Rajasthan-team/108-256426","keywords":null,"creator":null,"video_url":null,"description":"Vijayakanth Viyaskanth was recommended as a net bowler for the IPL’s Rajasthan Royals by the former Sri Lanka captain and the ex-MCC President Kumar Sangakkara.","content":"Vijayakanth Viyaskanth was recommended as a net bowler for the IPL’s Rajasthan Royals by the former Sri Lanka captain and the ex-MCC President Kumar Sangakkara. Sangakkara is the Director of Cricket at the Royals franchise team. Speaking to Daily Mirror, Viyaskanth said, \"First of all I would like to thank the Rajasthan Royals team for giving me such a wonderful opportunity. I heartily thank the respected Sangakkara for recommending my name as a net bowler.” \"I performed well in the LPL (Lanka Premier League) and the BPL (Bangladesh Premier League). I gained more experience in playing these big tournaments. Now I will be able to bowl at the world's leading batters in the IPL. The IPL is a big tournament. Though, at present I am there only as a new bowler but my hope is to take part in it\". \"Yes, I have much confidence now but being a youngster, I need to improve my skills which will be gained by doing hard work in my field. I wish to play for our national Sri Lankan team and establish my place in the T-20 team,” he said. Viyaskanth will be in India at the earliest once his visa formalities are completed this weekend. He will be based at Nagpur for the team's training sessions. (Bipin Dani)","pubDate":"2023-03-23 19:09:00","image_url":"https://bmkltsly13vb.compat.objectstorage.ap-singapore-1.oraclecloud.com/cdn.sg.dailymirror.lk/assets/uploads/image_b6c2951e96.jpg","source_id":"dailymirror","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Captain is proof scandal can enhance your reputation","link":"https://www.cairnspost.com.au/sport/cricket/australias-most-marketable-athlete-pat-cummins-proof-a-scandal-wont-derail-your-career/news-story/8607145351709707812e468b195d6853","keywords":["Cricket news and galleries","Sport news and galleries"],"creator":null,"video_url":null,"description":"Pat Cummins has brushed aside the Alinta Energy affair to be voted Australia’s most marketable athlete.","content":null,"pubDate":"2023-03-23 19:01:00","image_url":null,"source_id":"cairnspost","category":["sports"],"country":["australia"],"language":"english"},{"title":"The Hundred Draft 2023: London Spirit pick up Olly Stone as Oval Invincibles select Heinrich Klaasen","link":"https://www.standard.co.uk/sport/cricket/hundred-draft-2023-london-spirit-oval-invincibles-b1069566.html","keywords":["Cricket","Sport"],"creator":["Malik Ouzia"],"video_url":null,"description":"London Spirit have added Australia batter Mitchell Marsh and England quick Olly Stone to their men’s squad ahead of this summer’s Hundred, while Oval Invincibles selected South Africa’s Heinrich Klaasen, but high-profile overseas players were largely snubbed during Thursday’s Draft.","content":"have added Australia batter and quick to their men’s squad ahead of this summer’s Hundred, while selected South Africa’s Heinrich Klaasen, but high-profile overseas players were largely snubbed during Thursday’s Draft. The likes of Babar Azam, Trent Boult, Mohammad Rizwan and Shakib Al Hasan all went unselected as teams placed an emphasis on leading domestic talent and player availability ahead of star power, with the third edition of the competition due to overlap with several bilateral international series this summer. Marsh’s availability for Spirit will depend upon the scheduling of Australia’s white-ball tour to South Africa, which is yet to be finalised. As well as Klaasen, who excelled in the winter’s SA20 and for the Proteas in their recent ODI series victory over England, Invincibles have added exciting Pakistan quick Ihsanullah, the 20-year-old having been named player of the tournament at the PSL earlier this month. Last year’s bottom-ranked side Welsh Fire have also looked to Pakistan for pace, making Shaheen Afridi and Haris Rauf key components of their sizeable rebuild, having chosen to retain just five of a possible 11 players ahead of the Draft. SPONSORED The Fire used their top £125,000 selection to sign Tom Abell, who is expected to captain, and later added England seamer David Willey for £100,000, after their initial move for Tim David with the No1 pick was thwarted by Southern Brave as they exercised their Right To Match to re-sign the Australian hitter. Middlesex batter Stevie Eskinazi is also heading to Cardiff after being rewarded for his fine white-ball form over a prolonged period with a belated first Hundred gig. England Test opener Ben Duckett was one of those to have left the Fire and got his wish in joining the likes of Moeen Ali, Liam Livingstone and Will Smeed at Birmingham Phoenix on a £125,000 deal. Laurie Evans, who was this week cleared to return to action after having a provisional doping suspension lifted, was immediately picked up for £100,000 by Manchester Originals. Beyond the top salary brackets, New Zealand players proved popular, as expected, the Black Caps benefitting a clear international window during August and then facing England in an ODI series immediately after the Hundred. Glenn Phillips (Fire), Devon Conway (Brave) and Michael Bracewell (Northern Superchargers) all landed deals in the £60,000 bracket. The Fire also had the first pick in the women’s Draft, being staged for the first time, but were denied each of their first two selections as first Phoenix and then Brave used RTM cards on New Zealand batter Sophie Devine and England’s Danni Wyatt. The Fire eventually took Wyatt’s England opening partner Sophia Dunkley, who had also previously been at the Brave, with their first pick and used their hefty draft capital to add South African quick Shabnim Ismail and England’s Freya Davies. The Spirit, who finished second-bottom in last year’s tournament, moved quickly to nab Australian all-rounder Grace Harris and England spinner Sarah Glenn, while defending champions Oval have managed to reassemble the bulk of last year’s side after re-signing former captain Dane van Niekerk, batter Susie Bates and spinner Mady Villiers, though Ismail’s move to Wales is a blow. India captain Harmanpreet Kaur was the top selection for Trent Rockets, while in-form South African batter Laura Wolvaardt and England seamer Kate Cross effectively swapped places, taken in the top £31,250 salary bracket by the Originals and Superchargers, respectively. Each women’s team still has seven places to fill in their squad, with negotiations now due to take place in an open market, while the men’s squads will be completed with two wildcard selections following the first stage of the summer’s Vitality Blast.","pubDate":"2023-03-23 18:39:20","image_url":"https://static.standard.co.uk/2023/02/09/09/newFile-7.jpg?width=1200&auto=webp","source_id":"standarduk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"News24.com | Madhevere hat-trick sets up dramatic Zimbabwe win","link":"https://www.news24.com/sport/Cricket/madhevere-hat-trick-sets-up-dramatic-zimbabwe-win-20230323","keywords":null,"creator":null,"video_url":null,"description":"Wessly Madhevere took a hat-trick and set up a dramatic finish as Zimbabwe beat Netherlands by one run in the second of three World Cup Super League one-day internationals in Harare on Thursday.","content":"Wessly Madhevere took a hat-trick and set up a dramatic finish as Zimbabwe beat Netherlands by one run in the second of three World Cup Super League one-day internationals in Harare on Thursday. It went down to the last ball when last man Ryan Klein was run out attempting a near-impossible third run which would have tied the match. The Netherlands were seemingly cruising in pursuit of Zimbabwe's 271 all out at 213 for four before off-spinner Madhevere dismissed Colin Ackermann, Teja Nidamanuru and Paul van Meekeren off the first three balls of the 44th over. Netherlands captain Scott Edwards hit 36 but his team's hopes seemed over when he fell to off-spinner Sikandar Raza with 20 runs still needed off nine balls. It came down to 10 needed off the last two balls. Fred Klaassen hit a six off Tendai Chatara and then drove the last ball into the covers. The batsmen ran two but Brad Evans' throw to Chatara left Klein well short of his ground. Max O'Dowd (81) and Tom Cooper (74) laid the foundation for what seemed a likely Netherlands win with a second-wicket partnership of 125 off 152 balls. Sean Williams, returning after a finger injury, top-scored for Zimbabwe with 77 while 19-year-old leg-spinner Shariz Ahmad took five wickets for 43 runs for the Netherlands. The series decider will be played at the same venue on Saturday. Brief scores: Zimbabwe 271 in 49.2 overs (C. Ervine 39, W. Madhevere 43, S. Williams 77, C. Madande 52; P van Meekeren 2-66, C. Ackermann 2-51, Shariz Ahmad 5-43) v Netherlands 270 in 50 overs (M. O'Dowd 81, T. Cooper 74, S. Edwards 36; S. Raza 3-39, Madhevere 3-36) Result: Zimbabwe won by one run Series: Tied at 1-1 with one match to come on Saturday Toss: Zimbabwe","pubDate":"2023-03-23 18:22:10","image_url":"https://scripts.24.co.za/img/sites/sport24.png","source_id":"news24","category":["sports"],"country":["south africa"],"language":"english"},{"title":"The Hundred Draft: Afridi to lead Fire revival | Devine, Wyatt stay put","link":"https://www.skysports.com/cricket/news/12040/12840984/the-hundred-draft-shaheen-afridi-to-spearhead-welsh-fire-mens-revival-sophie-devine-danni-wyatt-stay-put","keywords":null,"creator":null,"video_url":null,"description":"Pakistan fast bowler Shaheen Afridi has been chosen to spearhead the Welsh Fire's attempted revival in The Hundred men's tournament in 2023 after going in the £100,000 category at the player draft.","content":"Pakistan fast bowler Shaheen Afridi has been chosen to spearhead the Welsh Fire's attempted revival in The Hundred men's tournament in 2023 after going in the £100,000 category at the player draft. The Fire are rebuilding following a difficult 2022 which saw them finish bottom of the table after losing all eight matches, with left-arm paceman Afridi joining the team's first pick in Thursday's player draft, Tom Abell, and another £125,000 selection in England all-rounder David Willey in the new-look squad. Afridi's compatriot and right-arm fast bowler Haris Rauf was chosen by the Fire in the later rounds too, yet several of the other big-name men's overseas players were not chosen. Bangladesh star Shakib Al Hasan, West Indies all-rounder Kieron Pollard and Australian duo Marcus Stoinis and Adam Zampa were not selected in the £125,000 category, while Pakistan captain Babar Azam, New Zealand seamer Trent Boult, and West Indies all-rounders Dwayne Bravo and Andre Russell were among those passed on in the £100,000 category. Elsewhere, England batter Ben Duckett got his wish of moving to Birmingham Phoenix from the Fire on the fourth pick, with the Cardiff franchise selecting his international team-mate Willey with the final pick of the first round. \"Difficult leaving a side I've played for, for the past two years, but for me personally it felt it was time to have a fresh start,\" Duckett said of his move to Edgbaston. \"Only winning a couple of games in two years, I hope they get on track this year, but three years in a career is a long time and Birmingham is a great ground to play at. The Hundred Draft: As it happened! The Hundred 2023 fixtures Please use Chrome browser for a more accessible video player \"[Phoenix] seem to have a great team playing against them, some explosive batters - I'll try and play anchor and get them on strike.\" Among the other England internationals up for grabs, Reece Topley is moving to Northern Superchargers from Oval Invincibles after being chosen in the second round, while fellow fast bowler Olly Stone is set for his Hundred bow this year after being picked up by London Spirit. The afternoon began with the historic first women's player draft in UK professional sport and Sophie Devine was the first name selected, being chosen by the Fire. However, the Phoenix opted to exercise their 'right to match' to retain the services of the New Zealander who scored 102 runs and took two wickets for the Edgbaston-based franchise in 2022. Birmingham Phoenix: Sophie Devine (right to match). Southern Brave: Danni Wyatt (right to match). Welsh Fire: Sophia Dunkley. London Spirit: Grace Harris. Manchester Originals: Laura Wolvaardt. Northern Superchargers: Kate Cross. Trent Rockets: Harmanpreet Kaur. Oval Invincibles: Suzie Bates. Meanwhile, India captain Harmanpreet Kaur, who topped the women's batting averages playing for the Manchester Originals in the first year of The Hundred, went to the Trent Rockets with the seventh pick of the draft. Another big overseas name to go in the first round was South African Laura Wolvaardt, who was chosen by the Originals, while compatriots Chloe Tryon and Lizelle Lee were chosen by the Southern Brave and Rockets respectively in the later rounds. Of the England internationals to go in the first round, Danni Wyatt remained with the Brave after they exercised their right to match and blocked the Fire again on the second pick. The Welsh franchise were eventually able to get Sophia Dunkley with the third pick of the draft, while the Northern Superchargers brought in Kate Cross. Please use Chrome browser for a more accessible video player \"Absolutely delighted to be back, I can't wait to get going again in the summer,\" Wyatt told Sky Sports after her return to the Brave was confirmed. \"We maybe need another bowler, another all-rounder is really handy, I've seen we've got Chloe Tryon and Anya [Shrubsole] back which is great news.\" Sky Sports will show all 68 games in The Hundred live this summer. Trent Rockets face Southern Brave in opening game of the 2023 Hundred on August 1, live on Sky Sports Cricket .","pubDate":"2023-03-23 18:05:00","image_url":"https://e2.365dm.com/23/03/1920x1080/skysports-shaheen-afridi-danni-wyatt_6098224.jpg?20230323175901","source_id":"skysports","category":["sports"],"country":["australia","united kingdom","united states of america"],"language":"english"},{"title":"Madhevere hattrick inspires Chevrons","link":"https://www.herald.co.zw/madhevere-hattrick-inspires-chevrons/","keywords":["Sport","Top Stories"],"creator":["dayton"],"video_url":null,"description":"Eddie Chikamhi–Senior Sports Reporter ALL-ROUNDER Wessly Madhevere joined an exclusive company of hattrick heroes for the Zimbabwe national cricket team yesterday when he inspired the Chevrons to a thrilling one run win over Netherlands at Harare Sports Club. The victory was key for the Chevrons to level the series 1-1, ahead of the third match […]","content":"The Herald","pubDate":"2023-03-23 22:19:05","image_url":null,"source_id":"herald_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"WES, YOU BEAUTY!","link":"https://www.hmetro.co.zw/wes-you-beauty/","keywords":["Sport"],"creator":["aurora"],"video_url":null,"description":"Blessing Malinganiza SPINNER Wessly Madhevere said it was a dream come true after his stunning hat-trick guided the Chevrons to a nervy one-run win over the Netherlands to level the ODI series 1-1 at Harare Sports Club yesterday. The two sides will now meet in the decider, at the same venue, tomorrow which, according to […]","content":"H-Metro Blessing Malinganiza SPINNER Wessly Madhevere said it was a dream come true after his stunning hat-trick guided the Chevrons to a nervy one-run win over the Netherlands to level the ODI series 1-1 at Harare Sports Club yesterday. The two sides will now meet in the decider, at the same venue, tomorrow which, according to expectations, could break records for attendance figures, at the home of domestic cricket. “First of all it feels good,” said the all-rounder. “I never imagined myself getting a hat-trick but, I mean, it happened today. “All credit to the coaches, these are the guys that believed in me. “I mean, there’s no better feeling than this one to be honest. Hopefully I will be able to do it again.” His three successive wickets, in one over, inspired Zimbabwe to victory. The 25-year-old came into the attack with Netherlands on 213/3 needing 59 runs from 42 balls. Zimbabwe had laboured to 271 runs all out inside 49.2 overs. He had Colin Ackerman stumped by wicketkeeper, Clive Madande, off his first ball of the over. Madhevere bowled a beauty of a delivery, clean bowling Teja Nidamanuru, the first match hero for the Dutch, for a duck. He then broke Paul Van Meekeren’s timber off the third ball to complete his historic hat-trick. Madhevere became only the third Zimbabwean bowler to claim an ODI hat-trick. He joins an illustrious company that has the likes of Eddo Brandes, the former Zimbabwe seamer who picked a hattrick against England in 1997, at Harare Sports Club. And, former captain Prosper Utseya, who achieved his feat at the same ground against South Africa in 2014. Madhevere finished the match with three wickets for 36 runs from nine overs. He was named the player-of-the-match and walked away with a US$500 cheque. Sean Williams top-scoring with 77 on his return to the squad after a long lay off due to injury.","pubDate":"2023-03-23 22:10:47","image_url":null,"source_id":"hmetro_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"Madhevere’s stunning hat-trick levels ODI series for Chevrons","link":"https://www.chronicle.co.zw/madheveres-stunning-hat-trick-levels-odi-series-for-chevrons/","keywords":["Sport"],"creator":["peter"],"video_url":null,"description":"Brandon Moyo, Sports Reporter OFF spinner Wessly Madhevere became the first Zimbabwean bowler since Prosper Utseya to pick up a hat-trick in One Day Internationals, his sensational bowling seeing Zimbabwe overcome Netherlands by one run in the second ODI cricket encounter at Harare Sports Club to level the series 1-1. Utseya was the last Zimbabwe […]","content":"The Chronicle OFF spinner Wessly Madhevere became the first Zimbabwean bowler since Prosper Utseya to pick up a hat-trick in One Day Internationals, his sensational bowling seeing Zimbabwe overcome Netherlands by one run in the second ODI cricket encounter at Harare Sports Club to level the series 1-1. Utseya was the last Zimbabwe bowler to secure three consecutive wickets in ODIs when he did so against South Africa at Harare Sports Club in August 2014. Madhevere, having earlier on contributed 43 runs with the bat, got his three wickets in the 44th over to finish with 3/36 in nine overs. He dismissed Colin Ackermann, Teja Nidamanuru and Paul van Meekeren to leave Netherlands in all sorts of trouble in their run chase. The visitors were eventually all out for 270 in exactly 50 overs, having taken the contest all the way to the last over only to lose it by the slightest of margins. Zimbabwe, after winning the toss and opting to bat first, were bowled out for 271 in 49.2 overs, their highest scorer being Sean Williams with 77 while Clive Madande had 52. Zimbabwean openers put up a decent start which was however ruined by a dismal display from the middle order before Williams and Madande came to the rescue. Williams, batting while nursing an injured finger top scored with 77 runs off 73 balls while Madande fell for 52 runs from 57 balls as the pair put up a 100-run partnership to help guide Zimbabwe to a defendable total. Dutch spinner, Shariz Ahmad was the star with the ball for the visitors after picking up a five-wicket haul. He finished with figures of 5/43 in 10 overs while Van Meekeren and Ackermann took two scalps each. Max O’Dowd and Tom Cooper went on to score half centuries, finishing on 81 and 74 runs from 103 and 84 runs respectively as they finished as the top scorers. Captain Scott Edwards chipped in with 36 runs from 28 balls. It took a special hat-trick from Madhevere to give Zimbabwe life again leaving the Dutch on 213/6. Fellow off spinner Sikandar Raza compensated for his poor performance with the bat by taking three wickets, including a brilliantly bowled penultimate over to finish with figures of 3/39 in nine overs as well. Lanky fast bowler Blessing Muzarabani took one scalp for the home side, giving away 39 runs in six overs while veteran Tendai Chatara, who was entrusted with the last over did not take any wickets but managed to see the Chevrons through. The series is part of the International Cricket Council (ICC) ODI Super League which serves as a pathway for direct qualification to the World Cup in India in October. Both teams however missed out on direct entry and are using the series as part of their preparations for the World Cup Qualifiers which will be hosted by Zimbabwe in June where only two nations can book their tickets to the global showpiece. The win left everything to play for on Saturday between the two nations, however, the Chevrons will be fancying their chances playing in front of their home fans. — @brandon_malvin","pubDate":"2023-03-23 22:05:27","image_url":null,"source_id":"chronicle_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"Rafiq calls for Cricket Scotland chair to depart","link":"https://www.skysports.com/cricket/news/12040/12841173/azeem-rafiq-calls-for-cricket-scotland-chair-anjan-luthra-to-depart-after-quite-scary-lack-of-respect","keywords":null,"creator":null,"video_url":null,"description":"Azeem Rafiq has called for the chair of Cricket Scotland Anjan Luthra to step down, after showing \"a quite scary lack of respect to everyone\".","content":"Azeem Rafiq has called for the chair of Cricket Scotland Anjan Luthra to step down, after showing \"a quite scary lack of respect to everyone\". Luthra, who was only brought into the role in October 2022, recently claimed \"significant progress\" had been made around Cricket Scotland's approach to equality, diversity and inclusion (EDI) - something met with widespread disagreement. Indeed, Cricket Scotland has since been branded \"unfit for purpose\", \"tone deaf\" and \"arrogant\" following its latest update. Last July, Sky Sports News revealed a damning review found the governing body failed on almost all tests of institutional racism. \"What we saw over the last couple of days with the Cricket Scotland stuff, to be honest it felt like something was coming,\" Rafiq told Sky Sports on Thursday. \"I think the lack of respect shown by the chair towards everyone really, from what's been communicated to me, is quite scary considering he was brought in on the back of a pretty damning report. \"I think it's unfortunate, I'm not sure his position is tenable anymore, and they need to bring in someone who is going to start communicating with all key stakeholders. The Hundred Draft: Shaheen Afridi to spearhead Welsh Fire men's revival | Sophie Devine, Danni Wyatt stay put Dane van Niekerk: Former South Africa captain retires from international cricket aged 29 after Women's T20 World Cup omission Azeem Rafiq says he cannot explain discrepancy between his two versions of Michael Vaughan's alleged racist comment towards him England's 2023 tour of Bangladesh to be shown live on Sky Sports: Three ODIs, three T20s New Zealand vs England: Neil Wagner helps clinch dramatic one-run win - as it happened Women's T20 World Cup: Tahlia McGrath blasts Australia to six-wicket victory over South Africa \"We all have to be [frustrated by the pace of the change]. We've got to start becoming impatient. \"Yes, I accept and understand change takes time, but we've been hearing that for decades. I don't want my kids to be having these conversations. \"I want my kids to be treated fairly, equally, with respect, and if I have to continue putting my head above the parapet to do that, I will.\" Cricket Scotland was branded \"unfit for purpose\", \"tone deaf\" and \"arrogant\" following its latest update on steps taken to tackle racism. The full Cricket Scotland board stepped down last year prior to the publication of an independent review, with Gordon Arthur named interim CEO. Arthur is now stepping down from his role next month for personal reasons. Please use Chrome browser for a more accessible video player As part of Tuesday's update, a statement from new chair Luthra outlined significant progress made around Cricket Scotland's approach to equality, diversity and inclusion (EDI), and he cited a new diversity working group as another step in the right direction. However, anti-racism group Running Out Racism - which helped with the investigation last year - called those claims \"unsubstantiated nonsense\". Furthermore, the group says Cricket Scotland's statement has \"set back trust significantly\" and \"demonstrated that the governing body is failing in learning from mistakes of the past\". Running Out Racism also revealed it has tried to raise concerns in private but is \"sick of fighting for change in public with no results\". The statement read: \"The release by Cricket Scotland today has set back trust significantly and demonstrated that the governing body is failing in learning from the mistakes of the past. \"In order to address the issues in the sport, they must meaningfully engage with people. Not just Running Out Racism, but the wider cricketing community. \"Today's release flies in the face of that. It is tone deaf and arrogant. \"To say they have significantly upgraded [their] approach to EDI is unsubstantiated nonsense. Unless that substantial upgrade is referring to ticking boxes as opposed to the previous strategy of ignoring the problem. They continue to ignore the very people who have been ignored for so long. \"To cite the EDI working group as an achievement is frankly embarrassing. At the first meeting in January, formed after five months of faffing around, some members of the group raised significant concerns around the intent of the governing body to meaningfully engage with people who have expertise in this area. \"Following that, the governing body put out a positive update, which was astounding to some who sat in that same meeting, and has subsequently ignored the group. None of today's changes have made it to that group for consultation. A group that took five months to form and has only met once.\" The issues of institutional racism came to light following an interview on Sky Sports News with Scotland's Majid Haq and team-mate Qasim Sheikh The lawyer representing both players, Aamer Anwar, said: \"Despite the horrific exposure of institutional racism, Cricket Scotland's empty soundbites today shows that it remains unfit for purpose. \"Both Majid Haq and Qasim Sheikh are sad to see the chief executive Gordon Arthur step down, he was a man who genuinely fought for change to take place. \"My clients, both Majid and Qasim, believe the chair has failed to deliver or inspire genuine confidence from across the sport, and they regard the process as little more than an 'arrogant cosmetic box ticking exercise'. \"It's time that Sport Scotland stepped in with special measures, the only winners today are institutional racism and the dinosaurs who now appear even more entrenched.\" In July it was revealed there were 448 examples of institutional racism and discrimination identified within the game by the Changing The Boundaries report - which led to Cricket Scotland being put in special measures by funding body SportScotland. However, as part of the six-month update, Luthra said he expected the progress being made will lead to those measures being lifted. Luthra said: \"Our current trajectory means that we will exit special measures by October 31 and ensure Cricket Scotland continues its work towards becoming the most inclusive sport in the country over the long term.\" However, Scotland's national agency for sport responded by clarifying only it will make that decision. A SportScotland spokesperson said: \"We are considering the various points raised in Cricket Scotland's latest update. \"We welcome the progress that has been made to date but we are clear that only by engaging in real and meaningful consultation will cultural change be delivered within the sport. \"The final decision on whether Cricket Scotland exits special measures will be taken by SportScotland and will be dependent on all recommendations from the Changing The Boundaries report being met in full.\"","pubDate":"2023-03-23 21:40:00","image_url":"https://e2.365dm.com/22/10/1920x1080/skysports-azeem-rafiq-cricket_5930493.jpg?20221014120000","source_id":"skysports","category":["sports"],"country":["australia","united kingdom","united states of america"],"language":"english"},{"title":"News24.com | Captain Markram primed to lead Proteas: 'I've had my eye on Aiden for a very long time'","link":"https://www.news24.com/sport/Cricket/Proteas/captain-markram-primed-to-lead-proteas-ive-had-my-eye-on-aiden-for-a-very-long-time-20230323","keywords":null,"creator":null,"video_url":null,"description":"New Proteas white-ball coach Rob Walter has praised the array of options open to him, but says he has always been fully aware of the leadership capabilities offered by Aiden Markram.","content":"New Proteas white-ball coach Rob Walter has praised the array of options open to him, but says he has always been fully aware of the leadership capabilities offered by Aiden Markram. READ | World Cup fate: Proteas seniors must stay at the wheel as Dutch date with destiny looms Markram, who captained the Proteas on Tuesday in a four-wicket win over the West Indies to level the ODI series 1-1, captains South Africa in the three-match T20 series against the same opponents that starts on Saturday. Speaking to reporters on Thursday, Walter acknowledged that Markram, who also captained the SA U19 side to World Cup glory in 2014 and the Sunrisers Eastern Cape to the inaugural SA20 title earlier this year, had done a fine job in Temba Bavuma's absence during the third ODI. \"It wasn't a clincher. I've had my eye on Aiden for a very long time from a leadership point of view and have watched him go about his work,\" said Walter. \"I thought he did a very good job, and it's not surprising. I'm fully aware of his leadership capabilities, and I thought he marshalled the troops quite nicely. \"He made some good tactical decisions around bowling changes, which was good to see, so I'm just looking for more of the same,\" Walter added. The Proteas limited-overs mentor confirmed there were other reasons why Markram was given the captain's armband of the T20 side. \"Part of Aiden's appointment is also looking forward and understanding where he is in his cricketing cycle and how many years he'll hopefully be dedicating to the Proteas.\" \"I think the SA20 gave us a glimpse into his style and his ability from a leadership point of view, so I don't think we'll see anything different from that.\"","pubDate":"2023-03-23 19:52:40","image_url":"https://scripts.24.co.za/img/sites/sport24.png","source_id":"news24","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Sangakkara recommended Viyaskanth as net bowler for Rajasthan team","link":"https://www.dailymirror.lk/breaking_news/Sangakkara-recommended-Viyaskanth-as-net-bowler-for-Rajasthan-team/108-256426","keywords":null,"creator":null,"video_url":null,"description":"Vijayakanth Viyaskanth was recommended as a net bowler for the IPL’s Rajasthan Royals by the former Sri Lanka captain and the ex-MCC President Kumar Sangakkara.","content":"Vijayakanth Viyaskanth was recommended as a net bowler for the IPL’s Rajasthan Royals by the former Sri Lanka captain and the ex-MCC President Kumar Sangakkara. Sangakkara is the Director of Cricket at the Royals franchise team. Speaking to Daily Mirror, Viyaskanth said, \"First of all I would like to thank the Rajasthan Royals team for giving me such a wonderful opportunity. I heartily thank the respected Sangakkara for recommending my name as a net bowler.” \"I performed well in the LPL (Lanka Premier League) and the BPL (Bangladesh Premier League). I gained more experience in playing these big tournaments. Now I will be able to bowl at the world's leading batters in the IPL. The IPL is a big tournament. Though, at present I am there only as a new bowler but my hope is to take part in it\". \"Yes, I have much confidence now but being a youngster, I need to improve my skills which will be gained by doing hard work in my field. I wish to play for our national Sri Lankan team and establish my place in the T-20 team,” he said. Viyaskanth will be in India at the earliest once his visa formalities are completed this weekend. He will be based at Nagpur for the team's training sessions. (Bipin Dani)","pubDate":"2023-03-23 19:09:00","image_url":"https://bmkltsly13vb.compat.objectstorage.ap-singapore-1.oraclecloud.com/cdn.sg.dailymirror.lk/assets/uploads/image_b6c2951e96.jpg","source_id":"dailymirror","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Captain is proof scandal can enhance your reputation","link":"https://www.cairnspost.com.au/sport/cricket/australias-most-marketable-athlete-pat-cummins-proof-a-scandal-wont-derail-your-career/news-story/8607145351709707812e468b195d6853","keywords":["Cricket news and galleries","Sport news and galleries"],"creator":null,"video_url":null,"description":"Pat Cummins has brushed aside the Alinta Energy affair to be voted Australia’s most marketable athlete.","content":null,"pubDate":"2023-03-23 19:01:00","image_url":null,"source_id":"cairnspost","category":["sports"],"country":["australia"],"language":"english"},{"title":"The Hundred Draft 2023: London Spirit pick up Olly Stone as Oval Invincibles select Heinrich Klaasen","link":"https://www.standard.co.uk/sport/cricket/hundred-draft-2023-london-spirit-oval-invincibles-b1069566.html","keywords":["Cricket","Sport"],"creator":["Malik Ouzia"],"video_url":null,"description":"London Spirit have added Australia batter Mitchell Marsh and England quick Olly Stone to their men’s squad ahead of this summer’s Hundred, while Oval Invincibles selected South Africa’s Heinrich Klaasen, but high-profile overseas players were largely snubbed during Thursday’s Draft.","content":"have added Australia batter and quick to their men’s squad ahead of this summer’s Hundred, while selected South Africa’s Heinrich Klaasen, but high-profile overseas players were largely snubbed during Thursday’s Draft. The likes of Babar Azam, Trent Boult, Mohammad Rizwan and Shakib Al Hasan all went unselected as teams placed an emphasis on leading domestic talent and player availability ahead of star power, with the third edition of the competition due to overlap with several bilateral international series this summer. Marsh’s availability for Spirit will depend upon the scheduling of Australia’s white-ball tour to South Africa, which is yet to be finalised. As well as Klaasen, who excelled in the winter’s SA20 and for the Proteas in their recent ODI series victory over England, Invincibles have added exciting Pakistan quick Ihsanullah, the 20-year-old having been named player of the tournament at the PSL earlier this month. Last year’s bottom-ranked side Welsh Fire have also looked to Pakistan for pace, making Shaheen Afridi and Haris Rauf key components of their sizeable rebuild, having chosen to retain just five of a possible 11 players ahead of the Draft. SPONSORED The Fire used their top £125,000 selection to sign Tom Abell, who is expected to captain, and later added England seamer David Willey for £100,000, after their initial move for Tim David with the No1 pick was thwarted by Southern Brave as they exercised their Right To Match to re-sign the Australian hitter. Middlesex batter Stevie Eskinazi is also heading to Cardiff after being rewarded for his fine white-ball form over a prolonged period with a belated first Hundred gig. England Test opener Ben Duckett was one of those to have left the Fire and got his wish in joining the likes of Moeen Ali, Liam Livingstone and Will Smeed at Birmingham Phoenix on a £125,000 deal. Laurie Evans, who was this week cleared to return to action after having a provisional doping suspension lifted, was immediately picked up for £100,000 by Manchester Originals. Beyond the top salary brackets, New Zealand players proved popular, as expected, the Black Caps benefitting a clear international window during August and then facing England in an ODI series immediately after the Hundred. Glenn Phillips (Fire), Devon Conway (Brave) and Michael Bracewell (Northern Superchargers) all landed deals in the £60,000 bracket. The Fire also had the first pick in the women’s Draft, being staged for the first time, but were denied each of their first two selections as first Phoenix and then Brave used RTM cards on New Zealand batter Sophie Devine and England’s Danni Wyatt. The Fire eventually took Wyatt’s England opening partner Sophia Dunkley, who had also previously been at the Brave, with their first pick and used their hefty draft capital to add South African quick Shabnim Ismail and England’s Freya Davies. The Spirit, who finished second-bottom in last year’s tournament, moved quickly to nab Australian all-rounder Grace Harris and England spinner Sarah Glenn, while defending champions Oval have managed to reassemble the bulk of last year’s side after re-signing former captain Dane van Niekerk, batter Susie Bates and spinner Mady Villiers, though Ismail’s move to Wales is a blow. India captain Harmanpreet Kaur was the top selection for Trent Rockets, while in-form South African batter Laura Wolvaardt and England seamer Kate Cross effectively swapped places, taken in the top £31,250 salary bracket by the Originals and Superchargers, respectively. Each women’s team still has seven places to fill in their squad, with negotiations now due to take place in an open market, while the men’s squads will be completed with two wildcard selections following the first stage of the summer’s Vitality Blast.","pubDate":"2023-03-23 18:39:20","image_url":"https://static.standard.co.uk/2023/02/09/09/newFile-7.jpg?width=1200&auto=webp","source_id":"standarduk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"News24.com | Madhevere hat-trick sets up dramatic Zimbabwe win","link":"https://www.news24.com/sport/Cricket/madhevere-hat-trick-sets-up-dramatic-zimbabwe-win-20230323","keywords":null,"creator":null,"video_url":null,"description":"Wessly Madhevere took a hat-trick and set up a dramatic finish as Zimbabwe beat Netherlands by one run in the second of three World Cup Super League one-day internationals in Harare on Thursday.","content":"Wessly Madhevere took a hat-trick and set up a dramatic finish as Zimbabwe beat Netherlands by one run in the second of three World Cup Super League one-day internationals in Harare on Thursday. It went down to the last ball when last man Ryan Klein was run out attempting a near-impossible third run which would have tied the match. The Netherlands were seemingly cruising in pursuit of Zimbabwe's 271 all out at 213 for four before off-spinner Madhevere dismissed Colin Ackermann, Teja Nidamanuru and Paul van Meekeren off the first three balls of the 44th over. Netherlands captain Scott Edwards hit 36 but his team's hopes seemed over when he fell to off-spinner Sikandar Raza with 20 runs still needed off nine balls. It came down to 10 needed off the last two balls. Fred Klaassen hit a six off Tendai Chatara and then drove the last ball into the covers. The batsmen ran two but Brad Evans' throw to Chatara left Klein well short of his ground. Max O'Dowd (81) and Tom Cooper (74) laid the foundation for what seemed a likely Netherlands win with a second-wicket partnership of 125 off 152 balls. Sean Williams, returning after a finger injury, top-scored for Zimbabwe with 77 while 19-year-old leg-spinner Shariz Ahmad took five wickets for 43 runs for the Netherlands. The series decider will be played at the same venue on Saturday. Brief scores: Zimbabwe 271 in 49.2 overs (C. Ervine 39, W. Madhevere 43, S. Williams 77, C. Madande 52; P van Meekeren 2-66, C. Ackermann 2-51, Shariz Ahmad 5-43) v Netherlands 270 in 50 overs (M. O'Dowd 81, T. Cooper 74, S. Edwards 36; S. Raza 3-39, Madhevere 3-36) Result: Zimbabwe won by one run Series: Tied at 1-1 with one match to come on Saturday Toss: Zimbabwe","pubDate":"2023-03-23 18:22:10","image_url":"https://scripts.24.co.za/img/sites/sport24.png","source_id":"news24","category":["sports"],"country":["south africa"],"language":"english"},{"title":"The Hundred Draft: Afridi to lead Fire revival | Devine, Wyatt stay put","link":"https://www.skysports.com/cricket/news/12040/12840984/the-hundred-draft-shaheen-afridi-to-spearhead-welsh-fire-mens-revival-sophie-devine-danni-wyatt-stay-put","keywords":null,"creator":null,"video_url":null,"description":"Pakistan fast bowler Shaheen Afridi has been chosen to spearhead the Welsh Fire's attempted revival in The Hundred men's tournament in 2023 after going in the £100,000 category at the player draft.","content":"Pakistan fast bowler Shaheen Afridi has been chosen to spearhead the Welsh Fire's attempted revival in The Hundred men's tournament in 2023 after going in the £100,000 category at the player draft. The Fire are rebuilding following a difficult 2022 which saw them finish bottom of the table after losing all eight matches, with left-arm paceman Afridi joining the team's first pick in Thursday's player draft, Tom Abell, and another £125,000 selection in England all-rounder David Willey in the new-look squad. Afridi's compatriot and right-arm fast bowler Haris Rauf was chosen by the Fire in the later rounds too, yet several of the other big-name men's overseas players were not chosen. Bangladesh star Shakib Al Hasan, West Indies all-rounder Kieron Pollard and Australian duo Marcus Stoinis and Adam Zampa were not selected in the £125,000 category, while Pakistan captain Babar Azam, New Zealand seamer Trent Boult, and West Indies all-rounders Dwayne Bravo and Andre Russell were among those passed on in the £100,000 category. Elsewhere, England batter Ben Duckett got his wish of moving to Birmingham Phoenix from the Fire on the fourth pick, with the Cardiff franchise selecting his international team-mate Willey with the final pick of the first round. \"Difficult leaving a side I've played for, for the past two years, but for me personally it felt it was time to have a fresh start,\" Duckett said of his move to Edgbaston. \"Only winning a couple of games in two years, I hope they get on track this year, but three years in a career is a long time and Birmingham is a great ground to play at. The Hundred Draft: As it happened! The Hundred 2023 fixtures Please use Chrome browser for a more accessible video player \"[Phoenix] seem to have a great team playing against them, some explosive batters - I'll try and play anchor and get them on strike.\" Among the other England internationals up for grabs, Reece Topley is moving to Northern Superchargers from Oval Invincibles after being chosen in the second round, while fellow fast bowler Olly Stone is set for his Hundred bow this year after being picked up by London Spirit. The afternoon began with the historic first women's player draft in UK professional sport and Sophie Devine was the first name selected, being chosen by the Fire. However, the Phoenix opted to exercise their 'right to match' to retain the services of the New Zealander who scored 102 runs and took two wickets for the Edgbaston-based franchise in 2022. Birmingham Phoenix: Sophie Devine (right to match). Southern Brave: Danni Wyatt (right to match). Welsh Fire: Sophia Dunkley. London Spirit: Grace Harris. Manchester Originals: Laura Wolvaardt. Northern Superchargers: Kate Cross. Trent Rockets: Harmanpreet Kaur. Oval Invincibles: Suzie Bates. Meanwhile, India captain Harmanpreet Kaur, who topped the women's batting averages playing for the Manchester Originals in the first year of The Hundred, went to the Trent Rockets with the seventh pick of the draft. Another big overseas name to go in the first round was South African Laura Wolvaardt, who was chosen by the Originals, while compatriots Chloe Tryon and Lizelle Lee were chosen by the Southern Brave and Rockets respectively in the later rounds. Of the England internationals to go in the first round, Danni Wyatt remained with the Brave after they exercised their right to match and blocked the Fire again on the second pick. The Welsh franchise were eventually able to get Sophia Dunkley with the third pick of the draft, while the Northern Superchargers brought in Kate Cross. Please use Chrome browser for a more accessible video player \"Absolutely delighted to be back, I can't wait to get going again in the summer,\" Wyatt told Sky Sports after her return to the Brave was confirmed. \"We maybe need another bowler, another all-rounder is really handy, I've seen we've got Chloe Tryon and Anya [Shrubsole] back which is great news.\" Sky Sports will show all 68 games in The Hundred live this summer. Trent Rockets face Southern Brave in opening game of the 2023 Hundred on August 1, live on Sky Sports Cricket .","pubDate":"2023-03-23 18:05:00","image_url":"https://e2.365dm.com/23/03/1920x1080/skysports-shaheen-afridi-danni-wyatt_6098224.jpg?20230323175901","source_id":"skysports","category":["sports"],"country":["australia","united kingdom","united states of america"],"language":"english"}]}