{"newsArray":[{"title":"Al-Ettifaq 2-1 Al-Nassr: Steven Gerrard and Jordan Henderson get off to winning start in Saudi Arabia as Cristiano Ronaldo misses out through injury","link":"https://www.dailymail.co.uk/sport/football/article-12406471/Al-Ettifaq-2-1-Al-Nassr-Cristiano-Ronaldo-misses-injury-Steven-Gerrard-Jordan-Henderson-winning-start-Saudi-Arabia.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Gerrard's side struggled in the first half but turned it around with two quick goals in the second period. Robin Qaison netted the equaliser and Moussa Dembele poked in the winner just moments later.","content":"Al-Ettifaq 2-1 Al-Nassr: Steven Gerrard and Jordan Henderson get off to winning start in Saudi Arabia after comeback following Sadio Mane's opener as Cristiano Ronaldo misses out through injury Henderson picked up a fortunate assist as El-Ettifaq came from behind to win Sadio Mane scored the opener for the visitors and continued to threaten WATCH: 'It's All Kicking Off' - Episode 1 - Mail Sport's brand new football show By Mike Keegan For Mailonline Published: 21:14, 14 August 2023 | Updated: 00:58, 15 August 2023 e-mail 656 shares 41 View comments Around an hour before kick-off the Islamic call to prayer echoed around the compact, bowl-shaped stadium from a nearby speaker. Officials drenched in sweat stood on the athletics track enthusiastically waving arms and rehearsing chants with excited schoolchildren ahead of a game for which around 15,000 would be present, with 11,000 seats left unflipped. The night-time temperature was a 36 Celsius, so humid it felt like the last few seconds of a steam room session, in settings more akin to an Indian cricket ground rather than a Premier League arena. Camera operators took their places, placing wet towels on their heads. Outside, hawkers dealt almost exclusively in merchandise bearing the colours of the away team, who had almost as many followers inside as the hosts. This was not Liverpool. This was not Anfield. This was not Sunderland. This was the Prince Mohammed bin Fahad bin Abdulaziz Stadium, where Steven Gerrard and Jordan Henderson took the first steps of their Saudi Arabia careers with Al-Ettifaq on a steamy evening on the country’s east coast. Steven Gerrard got off to a winning start at Al-Ettifaq manager with a 2-1 victory over Al-Nassr Sadio Mane (left) scored or Al-Nassr and Jordan Henderson (right) picked up an assist Saudi Arabia poster boy Cristiano Ronaldo missed the game because of an injury Your browser does not support iframes. Just three minutes and thirty three seconds after kick-off the size of the task ahead presented itself when the Riyadh big guns of Al-Nassr, without an injured Cristiano Ronaldo, took the lead thanks to an old friend. Sadio Mane’s trip to the Middle East has gone comparatively unnoticed in the spending spree and none of Gerrard’s defenders spotted him here, as he stole in to slot home from close range. The away end, in which around 2,000 had gathered, celebrated, as did large pockets of yellow in the home sections. This felt like a smaller club against a relative giant. The first-half was low on quality. That was understandable for a much-changed Al-Nassr, involved in an exhausting Arab Club Champions Cup Final extra-time win on Saturday night. But Gerrard, hands on hips and dressed in black, appeared frustrated as he patrolled the edge of his technical area, shouting instructions and clapping his hands to little effect. There was at least some familiarity. Twice Henderson attempted his aerial through balls but here there was no Salah to run onto them and the goalkeeper came and collected on both occasions. He also twisted and turned in the area, sending a defender to the shops, but then miscued his cross over the bar. Mane shone and had a late equaliser ruled out for offside in the absence of Ronaldo Gerrard has hinted as the size of the task at hand but he got off to the perfect start on Monday Gerrard had hinted at this being a big job. He is not at a superpower and will have had to earn some of his giant salary at half-time. Dammam, Al-Ettifaq’s home, already has an integral place in Saudi’s history. It was here, in 1938, when a team of drillers from California finally struck the rich vein of oil that would transform the country’s fortunes. It is a city built on that oil, a giant Texas of the desert. But from a football perspective there have been barren years. Al-Ettifaq won the league twice in the 1980s but there has been no title since then. Henderson will know that feeling, although whether he can be part of a celebrated squad that breaks that run remains to be seen. But there was luck. Shortly after the restart – during which Gerrard (and his translator) had presumably issued stern words, Henderson launched a corner into the box and Al-Nassr keeper Nawaf Alaqidi, who appeared to have lost the ability to catch, fumbled a ball under no pressure. Swede Robin Quaison tapped in. Henderson and Mane, former Liverpool team-mates, were reunited at the toss as captains of their sides On 52 minutes, Al-Ettifaq had the lead when Alaqidi punched another cross and this time Moussa Dembele, formerly of Celtic, scrambled it home, The visitors pressed but could not find a response. Henderson, shirt stuck to his chest, exited on 87 minutes to an ovation. For a 33-year-old who covers every blade, the remainder of blazing summer will be a heavy introduction. Fourteen minutes were added, enough time for Mane to have an equaliser ruled out for offside. It was not pretty, but this was a decent start. This was not Liverpool, but it was three points. Share or comment on this article: Al-Ettifaq 2-1 Al-Nassr: Steven Gerrard and Jordan Henderson get off to winning start in Saudi Arabia as Cristiano Ronaldo misses out through injury e-mail 656 shares Add comment Comments 41 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-08-14 22:50:58","image_url":"https://i.dailymail.co.uk/1s/2023/08/14/22/74312125-0-image-a-76_1692047774062.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"News24.com | Guarded thumbs-up from Proteas mentor Walter as CSA relaxes controversial fitness criteria","link":"https://www.news24.com/sport/Cricket/Proteas/guarded-thumbs-up-from-proteas-mentor-walter-as-csa-relaxes-controversial-fitness-criteria-20230814","keywords":null,"creator":null,"video_url":null,"description":"Proteas white-ball mentor Rob Walter has implicitly given the thumbs-up to CSA's new fitness requirements for national players.","content":"Proteas white-ball coach Rob Walter has somewhat guardedly given his implicit approval to Cricket South Africa's (CSA) relaxed fitness criteria ahead of the new season, which is now focused on a catching-flies-with-honey approach than rigid enforcement. In a communique circulated to local players, the federation states that while its mildly controversial two-kilometre run standard remains 8 minutes 30 seconds and 9 minutes 30 seconds for men and women respectively, a new provision has been implemented whereby national players can still compete at international level at \"coaches' discretion\". The time requirement - along with overall skinfold counts - were placed squarely into focus last year after several national players missed out on selection due to them failing one of the two metrics. Sisanda Magala - included in Walter's ODI and T20 squads for the upcoming home series against Australia on Monday - and recently retired former Proteas women's skipper Dane van Niekerk fell foul of the two-kilometre trial, while Lizelle Lee called it quits in protest over being denied a non-objection certificate to play in T20 leagues on the basis of being overweight. To his credit, Magala eventually passed his test and proved to be one of the Proteas' key bowlers in white-ball play last season. It's understood CSA implemented the changes following its medical conference in June, which recognised a need for more flexibility. For Walter, who cut his coaching teeth as a fitness trainer before gradually evolving into a top-flight mentor, it's all about cultivating a team culture where players \"automatically\" strive to maintain the highest standards of overall fitness. \"I suppose the fitness roots never leave you,\" he said. \"From my point of view, I suppose it comes down to the old adage: it's a process. It's a process of getting guys fitter and up to standard. Everyone in any of my teams will attest to my obsession for everyone to be better and that's applicable to fitness too. \"I expect every player in my team to strive towards that and we as team management also have a responsibility to support them in those endeavours.\" The emphasis on a support structure will be somewhat bittersweet to Van Niekerk, who missed out on her final two-kilometer trial by an agonising 18 seconds and was accordingly omitted from the Proteas' squad for the T20 Women's World Cup at home despite losing a significant amount of weight and generally being fitter than ever before according to insiders. READ | Dewald Brevis earns maiden Proteas call-up for Australia series South Africa, however, coped well in her absence and reached the final of the tournament, becoming the first national cricket team to progress that far at a World Cup. The criteria will suit Magala too as, despite him clearly becoming a fitter player last season, he remains saddled with an inherently burly frame. Still, Walter won't look past his output on the field - the 32-year-old took the most limited overs wickets for the Proteas last season - should a fitness issue potentially creep up again. \"Sisanda, on the park, has been electric for us in the recent period and we want to acknowledge those performances,\" he said. \"But we also expect him and everyone else to get fitter, better and stronger because it gives us a better chance of performing. \"Our responsibility is to provide a platform for these guys.\" The Proteas' tussle with the Aussie commences with a three-match T20 series in Durban from 31 August.","pubDate":"2023-08-14 20:48:12","image_url":"https://scripts.24.co.za/img/sites/sport24.png","source_id":"news24","category":["sports"],"country":["south africa"],"language":"english"},{"title":"LPL 2023 Stars Miller, Hasaranga Reveal Cricket Techniques To Aspiring Youngsters","link":"https://www.thetimesofbengal.com/sports/lpl-2023-stars-miller-hasaranga-reveal-cricket-techniques-to-aspiring-youngsters/?utm_source=rss&utm_medium=rss&utm_campaign=lpl-2023-stars-miller-hasaranga-reveal-cricket-techniques-to-aspiring-youngsters","keywords":["Sports"],"creator":["admin"],"video_url":null,"description":"Home Sports LPL 2023 Stars Miller, Hasaranga Reveal Cricket Techniques To Aspiring Youngsters David Miller...","content":"David Miller and Wanindu Hasaranga are running riot in the ongoing Lanka Premier League (LPL) 2023 with their remarkable performances. National, August 14, 2023: David Miller and Wanindu Hasaranga are running riot in the ongoing Lanka Premier League (LPL) 2023 with their remarkable performances. Both the remarkable cricketers are known for their sublime skills which they are using to full effect in the tournament and now will be utilising to impart cricketing knowledge though IPG Pro Tip initiative, an initiative by IPG Group, the rights holders of the league. Star LPL cricketers through the campaign called “Pro Tip” will impart cricketing knowledge to young players to up their game. These aspiring young cricketers from across Sri Lanka are sending questions as recorded videos asking their favourite player to help them overcome the various cricketing challenges they face while they are playing cricket. Miller, known for his destructive pull shots, often puts bowlers in trouble in international cricket. The shot has worked for him in LPL 2023 as well where he is playing for Jaffna Kings. He explained, “For me, the danger ball is the fuller ball. So, I set myself up for it and when I see the shorter ball I try to get into line. I try to play it down just to get some control of the speed and bounce. With the bottom hand, you want a full extension of the bat; just pretend that you’ve got a tennis racket and it’s almost playing a shot into the far right corner.” “We aim to utilize the Lanka Premier League 2023 platform to give something back to the game. This initiative provides young, aspiring kids with a unique opportunity to connect with their cricketing idols and get answers from the stalwarts of the game. It’s a pure source of inspiration that will empower the next generation in Sri Lanka to dream big and pursue those dreams relentlessly,” said Anil Mohan Sankhdhar, Founder and CEO of IPG Group. Hasaranga, on the other hand, revealed the right technique to bowl a googly that has got him a lot of wickets in the LPL 2023. “With googly, I try to use my grip well and pitch the ball in line with the wickets because that will enable me to either get an LBW or a clean bowled,” he commented,” stated the Sri Lankan all-rounder. He further added, “If you watch my games, you may have noticed how I pitched the googly and how I get more wickets. I always try to pitch it in such a way that a batter is unable to play a stroke ensuring the ball doesn’t land too close to them, while keeping the ball in line with the stumps.” IPG plans to utilise other top cricketers playing in the League like Galle Titans skipper Dasun Shanaka and Babar Azam as well to promote and impart cricketing knowledge to young budding cricketers of Sri Lanka.","pubDate":"2023-08-14 20:37:48","image_url":null,"source_id":"the_tob","category":["sports"],"country":["india"],"language":"english"},{"title":"Dewald Brevis receives maiden call-up to Proteas squad for Australia visit","link":"https://www.dailymaverick.co.za/article/2023-08-14-dewald-brevis-receives-maiden-call-up-to-proteas-squad-for-australia-visit/","keywords":null,"creator":["Keanan Hemmonsbey"],"video_url":null,"description":"Proteas coach Rob Walter has named his white-ball squads for Australia’s visit at the end of the month, with four potential debutants in the T20I side. The post Dewald Brevis receives maiden call-up to Proteas squad for Australia visit appeared first on Daily Maverick.","content":"Cricket South Africa on Monday announced their squads for the three-match T20I series and five-match One-Day International series against Australia beginning at the end of August. In his first international call-up, exciting 20-year-old batter Dewald Brevis has been named in both white-ball squads. Brevis first rose to prominence when he smashed his way to become the leading run-scorer at the under-19 Cricket World Cup in January last year with 506 runs – the most by any batter in a single edition of the tournament. The swashbuckling batter also currently holds the record for the highest individual domestic T20 score in South Africa – 162 runs off 57 balls – which he struck in last season’s T20 Challenge for the Titans against the Knights. “It’s great to have Dewald in the squads,” said Rob Walter, Proteas white-ball coach. “He performed well in Sri Lanka (for South Africa ‘A’), he’s performed well domestically, he’s been involved in a number of leagues internationally… so it’s nice to be able to give him an opportunity. “He’s one of our up-and-coming youngsters, so we’ve said we wanted to just broaden our base a little bit, and this Aussie series has been a perfect opportunity to give him a run.” Joining Brevis in the T20I squad for the first time are his Titans teammates Donovan Ferreira and Gerald Coetzee – the latter could add to his Test and ODI caps if selected – as well as Warriors batter, Matthew Breetzke. Quinton de Kock, Heinrich Klaasen, David Miller, Anrich Nortje and Kagiso Rabada are rested for the three-match T20I series and will return for the five-match ODI series. Tony de Zorzi and Ryan Rickelton, who both featured for the Proteas in the ODI series against West Indies in March, have not been included in either squad. It is unlikely that any player not in the current 19-player ODI squad will make the ODI World Cup in India in October. The 15-player squad for the World Cup will be announced on 5 September, while the ODI series against Australia begins two days later. Another surprise inclusion in both the T20I (only second and third) and ODI squads is that of Keshav Maharaj. Maharaj sustained a ruptured Achilles tendon in March this year while playing a Test match for the Proteas against West Indies. An injury like this can keep an athlete off the park for up to a year, but it has only taken Maharaj five months to potentially get back on to the oval field. “He’s done exceptionally well to this point. He’s ahead of where we thought he would be, which is awesome, due in no short measure to the effort that he’s been putting in,” Walter said. “Things look positive, but you know it’s very difficult to guesstimate this last portion of his recovery and being match-ready and taking what you look like on the practice field into a match scenario.” Maharaj has been an integral part of the Proteas’ 50-over setup since his debut in 2017 and could potentially have a big role in South Africa’s quest for a maiden World Cup trophy in India. Walter, however, will not be tempted to rush the left-arm tweaker back into action. “We actually saw the T20I series – given that you know the lesser load in terms of overs bowled and time on feet – as a great opportunity just to see where he’s at, but we still have two weeks before that arrives and so we’ve got a camp to get through,” the coach said. “I’m quietly hopeful that he’ll be ready for those T20s, and if not then, we set our attention to the 50 overs and we just take it bit by bit… but things look positive at this stage.” Regular Proteas T20I middle-order batter Rilee Rossouw has been left out of the squad to take on Australia due to an ankle injury. Meanwhile, former T20 skipper Temba Bavuma as well as stalwart batter, Rassie van der Dussen, have both been drafted back into the shorter-format squad — after both missed out in the most recent series against West Indies. “When [Bavuma and Van Der Dussen] were omitted, it was in some cases a performance-based thing as well as the type of game we wanted to play as a T20 side,” Walter said. “But I was very specific in saying it’s our job to get them back into the team. So we spent – along with the players themselves – a lot of time working on their games. “Rassie’s been off to the Canada GT20, Temba has been working tirelessly back here. So with Quinny [de Kock], David [Miller], Heinrich Klaasen sitting out and Riley missing through injury, it’s a perfect opportunity to give them a run… and for them to be able to show that they are able to manoeuvre their games and grow their games. “I’m excited to see what they have to offer. I think they’re both wonderful players and they’ve both definitely got the qualities to do it.” DM Aiden Markram (captain, Titans), Temba Bavuma (Lions), Matthew Breetzke (Warriors), Dewald Brevis (Titans), Gerald Coetzee (Titans), Donovan Ferreira (Titans), Bjorn Fortuin (Lions), Reeza Hendricks (Lions), Marco Jansen (Warriors), Sisanda Magala (Lions), Keshav Maharaj (Dolphins), Lungi Ngidi (Titans), Tabraiz Shamsi (Titans), Tristan Stubbs (Warriors), Lizaad Williams (Titans) and Rassie van der Dussen (Lions). Temba Bavuma (captain, Lions), Dewald Brevis (Titans), Gerald Coetzee (Titans), Quinton de Kock (Titans), Bjorn Fortuin (Lions), Reeza Hendricks (Lions), Marco Jansen (Warriors), Heinrich Klaasen (Titans), Sisanda Magala (Lions), Keshav Maharaj (Dolphins), Aiden Markram (Titans), David Miller (Dolphins), Lungi Ngidi (Titans), Anrich Nortje (Warriors), Tabraiz Shamsi (Titans), Wayne Parnell (Western Province), Kagiso Rabada (Lions), Tristan Stubbs (Warriors), and Rassie van der Dussen (Lions).","pubDate":"2023-08-14 20:11:58","image_url":null,"source_id":"dailymaverick","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Arlene Kelly leads the way as Ireland Women defeat the Netherlands","link":"https://www.the42.ie/ireland-women-cricket-netherlands-6142853-Aug2023/","keywords":["Ireland Women Cricket"],"creator":null,"video_url":null,"description":"Kelly finished with career-best international figures of 5-12.","content":"A FIVE-WICKET haul by Arlene Kelly propelled Ireland Women to a comprehensive 10-wicket victory over The Netherlands in the first of their three-match T20 International series in Amstelveen. Kelly finished with career-best international figures of 5-12, and also took a catch in a player of the match performance, while Amy Hunter and Gaby Lewis scored an unbeaten 96-run opening partnership to seal the win. Hunter was left just short of her maiden T20I half-century - on 49* off 42 balls – while Lewis finished unbeaten on 43*, from 37 balls, as Ireland comfortably reached their target of 93. After winning the toss Ireland captain Laura Delany sent the Netherlands in to bat on what looked like a pretty decent batting track. That decision ultimately paid off as the Netherlands found themselves two wickets down in successive overs. Orla Prendergast took the wicket of Heather Siegers with a catch by Kelly, while Ava Canning removed Iris Zwilling thanks to a Lewis catch down low at short cover. In the fourth over Georgina Dempsey’s second delivery was over pitched and was duly hit for four by Rijke. However, she bounced back in style, nipping one back into Babette de Leede and smashing her off stump. She followed up a couple of balls later with a slower to Frédérique Overdijk all as Ireland had Netherlands in trouble on 18-4 after just five overs. Ireland introduced spin in the eighth over, but set batter Robine Rijke knocked Cara Murray for a couple of quick boundaries. However, Rijke’s fine innings came to an end on 38 with the first ball of the 12th over, when she scooped one to Prendergast just outside the ring off the bowling of Kelly. She went on take a double-wicket maiden by removing Eva Lynch for a duck as the Netherlands were reeling at 57-6. Ireland’s fielding was much improved, with chances taken and excellent chasing down to limit runs. That was particularly evident by Louise Little’s tremendous fielding out on the boundary, where she chased down numerous balls, turning what looked like boundaries into twos and threes. The wickets kept falling as Kelly’s line and length caused their batters all sorts of problems. And after Hannah Landheer departed for one, Kelly delivered a peach of a delivery when pitching the ball leg side, it turned back inside and clipped the back of the pad of debutant Carlijn Van Koolwijk and into the stumps. Kelly got her five-wicket-haul when Dekeling was caught by Sargent, as she finished with career-best International bowling figures of 5-12. The Netherlands did manage to bat out their innings as they finished on 92-9 after a last-wicket partnership of 23 between Phebe Molkenboer and Caroline de Lange. In the chase Ireland began aggressively and got off to a dream start, as Hunter and Lewis found the boundary rope at will. After two overs Ireland were 18-0, with Hunter hitting a slog-sweep to deep mid-wicket for six. If the Netherlands were to win the game fielding needed to be sharp, but errors started creeping into their game. Lewis brought up the 50-partnership after 7.2 overs with a four straight down the ground. Hunter went on to post her highest T20I score with yet another six to deep mid-wicket as she moved onto 49. But after two failed efforts to get the single she so desperately required; Lewis going on to score the winning runs with a boundary. The sides have a day off tomorrow, but will meet again at the same venue on Wednesday at 1pm. 92-9 (20 overs; R Rijke 38, P Molkenboer 23; A Kelly 5-12 96-0 (13.1 overs; A Hunter 49*, G Lewis 43*; P Molkenboer 0-9)","pubDate":"2023-08-14 18:48:34","image_url":"https://c0.thejournal.ie/media/2023/08/img_8168-630x420.jpg","source_id":"the42","category":["sports"],"country":["ireland"],"language":"english"},{"title":"Ben Stokes 'prepared to come out of one-day international retirement to help England defend the World Cup in India', after a passionate plea from white-ball coach Matthew Mott","link":"https://www.dailymail.co.uk/sport/cricket/article-12406177/Ben-Stokes-prepared-come-one-day-international-retirement-help-England-defend-World-Cup-India-passionate-plea-white-ball-coach-Matthew-Mott.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Ben Stokes is preparing to U-turn on his retirement from one-day international cricket and aid England's bid to retain the World Cup in India, according to a new report.","content":"Ben Stokes 'prepared to come out of one-day international retirement to help England defend the World Cup in India', after a passionate plea from white-ball coach Matthew Mott Ben Stokes is set to cancel his ODI retirement to help England in the World Cup White-ball coach Matthew Mott made a passionate plea to get Stokes back Jofra Archer is also being considered for the 18-man squad going to India By Samuel Draper For Mailonline Published: 19:45, 14 August 2023 | Updated: 19:45, 14 August 2023 e-mail View comments Ben Stokes is preparing to U-turn on his retirement from one-day international cricket and aid England's bid to retain the World Cup in India , according to a new report. The England Test captain is thought to be considering his stance on the shorter version of the game after quitting ODIs last year, even if it means missing out on the next instalment of the Indian Premier League. On Saturday, Mail Sport reported that white-ball coach Matthew Mott was going to plead with Stokes to unretire and join the England squad in October and November. And the Telegraph report that Stokes is planning to do just that if captain Jos Buttler asks, even if it means that Stokes is putting his next IPL season in jeopardy to recover from this year's exploits. Stokes earns £1.6m a year from the IPL, but clearly feels that helping England's defence of the World Cup trophy they won in a remarkable Super Over in 2019 is also a valuable endeavour. Ben Stokes is prepared to U-turn his ODI retirement to held England defend the World Cup White-ball coach Matthew Mott made a passionate plea to get Stokes back in time for India The 32-year-old would be likely to bat in the middle order for the ODI side, selected as a specialist batsman, amid fears about how much bowling he could do. All 15-man World Cup squads must be submitted to the ICC by September 5, but changes can be made for another 22 days after this time. England play four ODIs against New Zealand and three against Ireland before the final deadline on September 27. As previously revealed by Mail Sport, Mott is prepared to gamble on fast bowler Jofra Archer's fitness ahead of the World Cup defence, although they were waiting on an updated medical report before the England selectors meeting on Tuesday. Archer has not appeared during the English summer due to a stress fracture in the elbow, but he has been bowling in the nets with his Sussex team-mates recently. Archer achieved his career best ODI figures in South Africa earlier this year, after an 18 month spell on the sidelines. He also frequently broke the 90-mile-per-hour barrier in Bangladesh, under similar conditions expected in neighbouring India. Four years ago, Stokes held his nerve under pressure to get England to the finish line during the final at Lord's, before Archer bowled the Super Over that saw the hosts beat New Zealand by the barest of margins. England are willing to bring back Jofra Archer after his career-best ODI figures in South Africa Share or comment on this article: Ben Stokes 'prepared to come out of one-day international retirement to help England defend the World Cup in India', after a passionate plea from white-ball coach Matthew Mott e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-08-14 18:45:46","image_url":"https://i.dailymail.co.uk/1s/2023/08/14/19/74253057-0-image-m-30_1692038608913.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Tammy Beaumont creates history, becomes first woman to smash a century in the Hundred","link":"https://www.indiatvnews.com/sports/cricket/england-s-tammy-beaumont-creates-history-becomes-first-woman-to-smash-a-century-in-the-hundred-welsh-fire-2023-08-14-886761","keywords":null,"creator":null,"video_url":null,"description":"Veteran England opener Tammy Beaumont created history with a record-breaking knock in the women's Hundred while leading the Welsh Fire against Trent Rockets. Beaumont slammed the first-ever women's hundred in the 100-ball competition as she notched up the highest score in the tournament's history (men or women) after reaching the three-figure mark in just 52 balls. ","content":"Veteran England opener Tammy Beaumont created history with a record-breaking knock in the women's Hundred while leading the Welsh Fire against Trent Rockets. Beaumont slammed the first-ever women's hundred in the 100-ball competition as she notched up the highest score in the tournament's history (men or women) after reaching the three-figure mark in just 52 balls. Beaumont was in a different mood altogether on Monday, August 14 as she just started bashing from the outset. Sophia Dunkley at the other end just became a mere spectator as Beaumont just didn't stop. Apart from Alana King, no other bowler could have any effect and Bryony Smith got the most pasting as she gave away 52 runs in her 20-ball spell. Beaumont got out on the second last delivery of Welsh Fire's innings but not before smashing 20 fours and a couple of sixes. The 32-year-old became the third centurion in the Hundred history after Will Jacks and Will Smeed got it in the men's competition last year. 118 - Tammy Beaumont (Welsh Fire) vs Trent Rockets, 2023 97* - Beth Mooney (London Spirit) vs Southern Brave, 2022 92* - (Northern Superchargers) vs Welsh Fire, 2021 90* - Laura Wolvaardt (Northern Superchargers) vs Manchester Originals, 2022 81* - Nat Sciver-Brunt (Trent Rockets) vs London Spirit, 2023 118 - Tammy Beaumont (Welsh Fire) vs Trent Rockets, 2023 108* - Will Jacks (Oval Invincibles) vs Southern Brave, 2022 101* - Will Smeed (Birmingham Phoenix) vs Southern Brave, 2022 97* - Beth Mooney (London Spirit) vs Southern Brave, 2022 93 - Dan Lawrence (London Spirit) vs Trent Rockets, 2023 Beaumont's innings helped Welsh Fire get to a strong score of 181 runs, which eventually was too much for the Rockets as they could get to just 140/5 despite a rapid start by the openers Lizelle Lee and Bryony Smith. This was Welsh Fire women's fourth win and they are currently at the top of the table.","pubDate":"2023-08-14 18:26:08","image_url":null,"source_id":"indiatvnews","category":["sports"],"country":["india"],"language":"english"},{"title":"Indian Cricket Team: প্র্যাক্টিস ম্যাচ খেলবেন রাহুল-শ্রেয়স, এশিয়া কাপের দলে রাখা হবে?","link":"https://bengali.abplive.com/sports/indian-cricket-team-kl-rahul-shreyas-iyer-in-match-simulation-training-ahead-of-asia-cup-squad-selection-1001081","keywords":["খেলা"],"creator":["ABP Ananda"],"video_url":null,"description":"বেঙ্গালুরু: সামনেই এশিয়া কাপ। যে টুর্নামেন্টের দল নির্বাচন হবে দিন কয়েকের মধ্যে। তারপরই ওয়ান ডে বিশ্বকাপ। তার আগে কি সম্পূর্ণ সেরে উঠেছেন কে এল রাহুল (KL Rahul) ও শ্রেয়স আইয়ার (Shreyas Iyer)? বেঙ্গালুরুর জাতীয় ক্রিকেট অ্যাকাডেমি থেকে যে খবর পাওয়া যাচ্ছে, তাতে উচ্ছ্বসিত হতে পারেন ভারতীয় ক্রিকেট ভক্তরা। কারণ, ম্যাচ পরিস্থিতিতে ব্যাটিং শুরু করেছেন দুই তারকা। গোটা দুয়েক প্র্যাক্টিস ম্যাচ খেলবেন তাঁরা।  এই সপ্তাহে প্র্যাক্টিস ম্যাচগুলি খেলার কথা রাহুল ও শ্রেয়স আইয়ারের। সেই ম্যাচদুটি থেকে জাতীয় নির্বাচকদের একটা স্পষ্ট ধারণা হতে পারে ম্যাচ পরিস্থিতিতে দুজনে কেমন পারফর্ম করছেন, কতটা সাড়া দিচ্ছে তাঁদের শরীর।    আগামী সপ্তাহে, ২০ অগাস্ট এশিয়া কাপের দল ঘোষণা হওয়ার কথা। তার আগে রাহুল ও শ্রেয়সের শারীরিক অবস্থার আপডেটের দিকে নজর থাকবে জাতীয় নির্বাচকদেরও।   শনিবার ওয়েস্ট ইন্ডিজের বিরুদ্ধে পঞ্চম টি-টোয়েন্টি ম্যাচের পর ভারতীয় দলের কোচ রাহুল দ্রাবিড় বলেছিলেন, 'আমাদের কয়েকজন ক্রিকেটার চোট সারিয়ে দলে ফিরছে। আমরা তাদের এশিয়া কাপের দলে সুযোগ দিতে চাই। এখনই এশিয়া কাপের কথা ভাবছি না। ২৩ অগাস্ট থেকে বেঙ্গালুরুতে এক সপ্তাহের প্রস্তুতি শিবির রয়েছে। ওয়ান ডে দল হিসাবে সকলে সেখানে জড়ো হব। তারপর পরিস্থিতি বুঝে এগনো যাবে।'   ওয়াকিবহাল মহলের মতে, রাহুল ও আইয়ারের শারীরিক অবস্থার পরিস্থিতি দেখে নেওয়ার জন্য এশিয়া কাপের দল ঘোষণার আগে বাড়তি সময় নিচ্ছে বোর্ড। সেই কারণে দেরিতে হচ্ছে এশিয়া কাপের দল নির্বাচন। গত ২১ জুলাই বিবৃতি দিয়ে ভারতীয় ক্রিকেট বোর্ড জানিয়েছিল, রাহুল ও আইয়ার - দুই ব্যাটারই নেটে ব্যাটিং শুরু করেছেন। বোর্ড থেকে বিবৃতি দিয়ে জানানো হয়েছিল, আপাতত দুজনের স্ট্রেংথ ও ফিটনেসের কসরত চলছে। তাঁদের উন্নতি দেখে সন্তোষজনক মনে হয়েছে বিশেষজ্ঞদের। এবার তাঁদের প্রস্তুতির সূচি আরও কঠোর করা হবে। দ্রুত পুরোদমে প্র্যাক্টিস শুরু করবেন দুই ব্যাটার। ঋষভ পন্থের ফিটনেস আপডেটও দিয়েছে বোর্ড। ভারতীয় বোর্ড থেকে জানানো হয়েছে, দ্রুত উন্নতি করছেন ঋষভ পন্থ। নেটে ব্যাটিং ও কিপিং - দুইই শুরু করেছেন। তাঁর জন্য বিশেষ ফিটনেস সূচি তৈরি করা হয়েছে। যার মধ্যে রয়েছে স্ট্রেংথ ও ফ্লেক্সিবিলিটি ড্রিল ও দৌড়। সেই সূচি মেনেই চলছে পন্থের মাঠে ফেরার লড়াই। আরও পড়ুন: নেহরার দুধের গ্লাস ফাঁকা করে দিতেন বীরু! ভারতীয় দলের কৃপণতম ক্রিকেটার কে ছিলেন? আপনার পছন্দের খবর আর আপডেট এখন পাবেন আপনার পছন্দের চ্যাটিং প্ল্যাটফর্ম টেলিগ্রামেও। যুক্ত হোন https://t.me/abpanandaofficial","content":"বেঙ্গালুরু: সামনেই এশিয়া কাপ। যে টুর্নামেন্টের দল নির্বাচন হবে দিন কয়েকের মধ্যে। তারপরই ওয়ান ডে বিশ্বকাপ। তার আগে কি সম্পূর্ণ সেরে উঠেছেন কে এল রাহুল (KL Rahul) ও শ্রেয়স আইয়ার (Shreyas Iyer)? বেঙ্গালুরুর জাতীয় ক্রিকেট অ্যাকাডেমি থেকে যে খবর পাওয়া যাচ্ছে, তাতে উচ্ছ্বসিত হতে পারেন ভারতীয় ক্রিকেট ভক্তরা। কারণ, ম্যাচ পরিস্থিতিতে ব্যাটিং শুরু করেছেন দুই তারকা। গোটা দুয়েক প্র্যাক্টিস ম্যাচ খেলবেন তাঁরা। এই সপ্তাহে প্র্যাক্টিস ম্যাচগুলি খেলার কথা রাহুল ও শ্রেয়স আইয়ার ের। সেই ম্যাচদুটি থেকে জাতীয় নির্বাচকদের একটা স্পষ্ট ধারণা হতে পারে ম্যাচ পরিস্থিতিতে দুজনে কেমন পারফর্ম করছেন, কতটা সাড়া দিচ্ছে তাঁদের শরীর। আগামী সপ্তাহে, ২০ অগাস্ট এশিয়া কাপের দল ঘোষণা হওয়ার কথা। তার আগে রাহুল ও শ্রেয়সের শারীরিক অবস্থার আপডেটের দিকে নজর থাকবে জাতীয় নির্বাচকদেরও। শনিবার ওয়েস্ট ইন্ডিজের বিরুদ্ধে পঞ্চম টি-টোয়েন্টি ম্যাচের পর ভারতীয় দলের কোচ রাহুল দ্রাবিড় বলেছিলেন, 'আমাদের কয়েকজন ক্রিকেটার চোট সারিয়ে দলে ফিরছে। আমরা তাদের এশিয়া কাপের দলে সুযোগ দিতে চাই। এখনই এশিয়া কাপের কথা ভাবছি না। ২৩ অগাস্ট থেকে বেঙ্গালুরুতে এক সপ্তাহের প্রস্তুতি শিবির রয়েছে। ওয়ান ডে দল হিসাবে সকলে সেখানে জড়ো হব। তারপর পরিস্থিতি বুঝে এগনো যাবে।' ওয়াকিবহাল মহলের মতে, রাহুল ও আইয়ারের শারীরিক অবস্থার পরিস্থিতি দেখে নেওয়ার জন্য এশিয়া কাপের দল ঘোষণার আগে বাড়তি সময় নিচ্ছে বোর্ড। সেই কারণে দেরিতে হচ্ছে এশিয়া কাপ ের দল নির্বাচন। গত ২১ জুলাই বিবৃতি দিয়ে ভারতীয় ক্রিকেট বোর্ড জানিয়েছিল, রাহুল ও আইয়ার - দুই ব্যাটারই নেটে ব্যাটিং শুরু করেছেন। বোর্ড থেকে বিবৃতি দিয়ে জানানো হয়েছিল, আপাতত দুজনের স্ট্রেংথ ও ফিটনেসের কসরত চলছে। তাঁদের উন্নতি দেখে সন্তোষজনক মনে হয়েছে বিশেষজ্ঞদের। এবার তাঁদের প্রস্তুতির সূচি আরও কঠোর করা হবে। দ্রুত পুরোদমে প্র্যাক্টিস শুরু করবেন দুই ব্যাটার। ঋষভ পন্থের ফিটনেস আপডেটও দিয়েছে বোর্ড। ভারতীয় বোর্ড থেকে জানানো হয়েছে, দ্রুত উন্নতি করছেন ঋষভ পন্থ। নেটে ব্যাটিং ও কিপিং - দুইই শুরু করেছেন। তাঁর জন্য বিশেষ ফিটনেস সূচি তৈরি করা হয়েছে। যার মধ্যে রয়েছে স্ট্রেংথ ও ফ্লেক্সিবিলিটি ড্রিল ও দৌড়। সেই সূচি মেনেই চলছে পন্থের মাঠে ফেরার লড়াই। googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); আরও পড়ুন: নেহরার দুধের গ্লাস ফাঁকা করে দিতেন বীরু! ভারতীয় দলের কৃপণতম ক্রিকেটার কে ছিলেন? আপনার পছন্দের খবর আর আপডেট এখন পাবেন আপনার পছন্দের চ্যাটিং প্ল্যাটফর্ম টেলিগ্রামেও। যুক্ত হোন https://t.me/abpanandaofficial var _fireSc=!0;document.addEventListener(\"scroll\",(e=>{if(_fireSc){var c=document.createElement(\"script\");c.src=\"//asset.fwpub1.com/js/storyblock.js\",c.async=!0,document.getElementsByTagName(\"head\")[0].appendChild(c),_fireSc=!1}}));","pubDate":"2023-08-14 18:04:03","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/08/14/83ead29891490b8e7cffea04bec929c4169203483039050_original.jpg","source_id":"abplive","category":["sports"],"country":["india"],"language":"Bengali"},{"title":"England pacer Steve Finn announces retirement from all forms of cricket after 18 glorious years","link":"https://www.dnaindia.com/cricket/report-england-pacer-steve-finn-announces-retirement-from-all-forms-of-cricket-after-18-glorious-years-3055844","keywords":["Sports","Cricket"],"creator":["DNA  Web Team"],"video_url":null,"description":"The decision comes after a year-long battle with the knee injury, which sidelined him throughout 2023.","content":"England pacer Steven Finn has officially announced his retirement from all forms of cricket. The decision comes after a year-long battle with the knee injury, which sidelined him throughout 2023. Finn, a three-time Ashes series victor, has gracefully chosen to conclude his magnificent 18-year career. The 34-year-old, who has been an integral part of England's cricketing journey, expressed his sentiment regarding this pivotal moment. With his knee injury severely affecting his ability to perform, Finn decided that the time had come to bid farewell to a sport he has passionately embraced since making his debut for Middlesex in 2005. His journey, though marked by challenges, has been a labor of love that has left a mark on the cricketing world. Having graced the field in 126 matches for England, Finn's prolific career has seen him claim an impressive 254 wickets. His exceptional skills have not been limited to international cricket, as he has been an instrumental force for both Sussex and Middlesex in domestic matches. Finn's impact on the cricketing landscape is evident in his achievements. In his 36 Test matches for England, he managed to capture 125 wickets, with a standout performance of 6-79 against Australia during the 2015 Ashes series. Further, extended to white-ball formats as well, where he scalped 129 wickets in 90 matches representing his country. READ | Benzema to Neymar: Full list of superstars joining Cristiano Ronaldo in Saudi league this summer Addressing the media, Finn shared his sentiments, saying,\"I feel incredibly fortunate to have had the privilege of pursuing cricket as my profession ever since my debut for Middlesex in 2005. The journey has been a mix of highs and lows, yet I have cherished every moment.\" He went on to express his gratitude towards Sussex Cricket, particularly for their unwavering support during the past year. Finn acknowledged his affiliation with the club and regretted not being able to contribute more on the field since joining. He spoke fondly of Sussex as a remarkable place to play cricket. In his concluding words, Finn reflected, \"As I retire, I carry with me cherished memories from my time with England, Middlesex, and Sussex, all made special by the incredible individuals I've had the privilege to share them with.\" He expressed his deep appreciation for his followers and supporters, singling out his parents for their unwavering encouragement during his formative years. As his chapter on the field concludes, the cricketing world salutes Finn for his remarkable career and wishes him the best in his future endeavours.","pubDate":"2023-08-14 18:04:00","image_url":null,"source_id":"dnaindia","category":["sports"],"country":["india"],"language":"english"},{"title":"हार्दिक पंड्या से भी गट्सी निकले कुलदीप यादव, दो लाइन में कह दी अपनी पूरी बात","link":"https://navbharattimes.indiatimes.com/sports/cricket/cricket-news/kuldeep-yadav-gutted-more-hardik-pandya-said-his-whole-thing-in-two-lines/articleshow/102731685.cms","keywords":null,"creator":null,"video_url":null,"description":"Kuldeep Yadav: वेस्टइंडीज के खिलाफ टी20 सीरीज में भारतीय टीम को बेशक 3-2 से हार मिली है लेकिन कुछ खिलाड़ियों के लिए यह दौरा काफी शानदार रहा है, जिसमें कुलदीप यादव का नाम भी शामिल है।","content":"वेस्टइंडीज दौरे पर भारतीय क्रिकेट टीम ने जहां टेस्ट सीरीज में जीत के साथ अभियान की शुरुआत की थी तो टी20 सीरीज में उसे हार से संतोष करना पड़ा। पांच टी20 मैचों की सीरीज में भारतीय टीम को 3-2 से हार मिली। चार मैचों तक सीरीज 2-2 की बराबरी पर था लेकिन इसके बाद अंतिम मैच में टीम इंडिया मेजबान वेस्टइंडीज से पिछड़ गई। वेस्टइंडीज के खिलाफ इस टी20 सीरीज में टीम इंडिया के कई खिलाड़ियों ने दमदार खेल का प्रदर्शन किया। इसमें स्पिन गेंदबाज कुलदीप यादव का नाम भी शामिल है। हालांकि उनके दमदार खेल के बावजूद टीम इंडिया सीरीज नहीं जीत पाई लेकिन कुलदीप यादव का हौसला नहीं टूटा है। वह कप्तान हार्दिक पंड्या से भी मजबूत दिखे। कुलदीप ने इस सीरीज के बाद अपने ट्विटर हैंडल पर लिखा, बेशक हम सीरीज के परिणाम से निराश हैं, लेकिन पूरी सीरीज में जिस तरह टीम द्वारा खेल दिखाया गया उस पर मुझे गर्व है। कुछ सीख के साथ फिर वापस आएंगे, मजबूत और बेहतर तरीके से। बता दें कि कुलदीप यादव ने वेस्टइंडीज के खिलाफ कुल 4 टी20 मैचों में मैदान पर उतरे थे, जिसमें उन्होंने 7 विकेट हासिल किए। वापसी के बाद से ही कुलदीप अपने दमदार लय में दिख रहे हैं। ऐसे में उनके लिए वेस्टइंडीज दौरा काफी दमदार माना जा सकता है। वेस्टइंडीज के खिलाफ टीम इंडिया की कप्तानी करने वाले हार्दिक पंड्या भी सीरीज गंवाने से निराश दिखे थे। हालांकि उन्होंने कहा कि कभी-कभी हार से भी बहुत कुछ सीखने को मिलता है, लेकिन उन्हें उम्मीद है टीम इंडिया इस हार से हताश नहीं होगी और मजबूती के साथ वापसी करेगी।","pubDate":"2023-08-14 17:44:31","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Al-Ettifaq 2-1 Al-Nassr: Steven Gerrard and Jordan Henderson get off to winning start in Saudi Arabia as Cristiano Ronaldo misses out through injury","link":"https://www.dailymail.co.uk/sport/football/article-12406471/Al-Ettifaq-2-1-Al-Nassr-Cristiano-Ronaldo-misses-injury-Steven-Gerrard-Jordan-Henderson-winning-start-Saudi-Arabia.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Gerrard's side struggled in the first half but turned it around with two quick goals in the second period. Robin Qaison netted the equaliser and Moussa Dembele poked in the winner just moments later.","content":"Al-Ettifaq 2-1 Al-Nassr: Steven Gerrard and Jordan Henderson get off to winning start in Saudi Arabia after comeback following Sadio Mane's opener as Cristiano Ronaldo misses out through injury Henderson picked up a fortunate assist as El-Ettifaq came from behind to win Sadio Mane scored the opener for the visitors and continued to threaten WATCH: 'It's All Kicking Off' - Episode 1 - Mail Sport's brand new football show By Mike Keegan For Mailonline Published: 21:14, 14 August 2023 | Updated: 00:58, 15 August 2023 e-mail 656 shares 41 View comments Around an hour before kick-off the Islamic call to prayer echoed around the compact, bowl-shaped stadium from a nearby speaker. Officials drenched in sweat stood on the athletics track enthusiastically waving arms and rehearsing chants with excited schoolchildren ahead of a game for which around 15,000 would be present, with 11,000 seats left unflipped. The night-time temperature was a 36 Celsius, so humid it felt like the last few seconds of a steam room session, in settings more akin to an Indian cricket ground rather than a Premier League arena. Camera operators took their places, placing wet towels on their heads. Outside, hawkers dealt almost exclusively in merchandise bearing the colours of the away team, who had almost as many followers inside as the hosts. This was not Liverpool. This was not Anfield. This was not Sunderland. This was the Prince Mohammed bin Fahad bin Abdulaziz Stadium, where Steven Gerrard and Jordan Henderson took the first steps of their Saudi Arabia careers with Al-Ettifaq on a steamy evening on the country’s east coast. Steven Gerrard got off to a winning start at Al-Ettifaq manager with a 2-1 victory over Al-Nassr Sadio Mane (left) scored or Al-Nassr and Jordan Henderson (right) picked up an assist Saudi Arabia poster boy Cristiano Ronaldo missed the game because of an injury Your browser does not support iframes. Just three minutes and thirty three seconds after kick-off the size of the task ahead presented itself when the Riyadh big guns of Al-Nassr, without an injured Cristiano Ronaldo, took the lead thanks to an old friend. Sadio Mane’s trip to the Middle East has gone comparatively unnoticed in the spending spree and none of Gerrard’s defenders spotted him here, as he stole in to slot home from close range. The away end, in which around 2,000 had gathered, celebrated, as did large pockets of yellow in the home sections. This felt like a smaller club against a relative giant. The first-half was low on quality. That was understandable for a much-changed Al-Nassr, involved in an exhausting Arab Club Champions Cup Final extra-time win on Saturday night. But Gerrard, hands on hips and dressed in black, appeared frustrated as he patrolled the edge of his technical area, shouting instructions and clapping his hands to little effect. There was at least some familiarity. Twice Henderson attempted his aerial through balls but here there was no Salah to run onto them and the goalkeeper came and collected on both occasions. He also twisted and turned in the area, sending a defender to the shops, but then miscued his cross over the bar. Mane shone and had a late equaliser ruled out for offside in the absence of Ronaldo Gerrard has hinted as the size of the task at hand but he got off to the perfect start on Monday Gerrard had hinted at this being a big job. He is not at a superpower and will have had to earn some of his giant salary at half-time. Dammam, Al-Ettifaq’s home, already has an integral place in Saudi’s history. It was here, in 1938, when a team of drillers from California finally struck the rich vein of oil that would transform the country’s fortunes. It is a city built on that oil, a giant Texas of the desert. But from a football perspective there have been barren years. Al-Ettifaq won the league twice in the 1980s but there has been no title since then. Henderson will know that feeling, although whether he can be part of a celebrated squad that breaks that run remains to be seen. But there was luck. Shortly after the restart – during which Gerrard (and his translator) had presumably issued stern words, Henderson launched a corner into the box and Al-Nassr keeper Nawaf Alaqidi, who appeared to have lost the ability to catch, fumbled a ball under no pressure. Swede Robin Quaison tapped in. Henderson and Mane, former Liverpool team-mates, were reunited at the toss as captains of their sides On 52 minutes, Al-Ettifaq had the lead when Alaqidi punched another cross and this time Moussa Dembele, formerly of Celtic, scrambled it home, The visitors pressed but could not find a response. Henderson, shirt stuck to his chest, exited on 87 minutes to an ovation. For a 33-year-old who covers every blade, the remainder of blazing summer will be a heavy introduction. Fourteen minutes were added, enough time for Mane to have an equaliser ruled out for offside. It was not pretty, but this was a decent start. This was not Liverpool, but it was three points. Share or comment on this article: Al-Ettifaq 2-1 Al-Nassr: Steven Gerrard and Jordan Henderson get off to winning start in Saudi Arabia as Cristiano Ronaldo misses out through injury e-mail 656 shares Add comment Comments 41 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-08-14 22:50:58","image_url":"https://i.dailymail.co.uk/1s/2023/08/14/22/74312125-0-image-a-76_1692047774062.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"News24.com | Guarded thumbs-up from Proteas mentor Walter as CSA relaxes controversial fitness criteria","link":"https://www.news24.com/sport/Cricket/Proteas/guarded-thumbs-up-from-proteas-mentor-walter-as-csa-relaxes-controversial-fitness-criteria-20230814","keywords":null,"creator":null,"video_url":null,"description":"Proteas white-ball mentor Rob Walter has implicitly given the thumbs-up to CSA's new fitness requirements for national players.","content":"Proteas white-ball coach Rob Walter has somewhat guardedly given his implicit approval to Cricket South Africa's (CSA) relaxed fitness criteria ahead of the new season, which is now focused on a catching-flies-with-honey approach than rigid enforcement. In a communique circulated to local players, the federation states that while its mildly controversial two-kilometre run standard remains 8 minutes 30 seconds and 9 minutes 30 seconds for men and women respectively, a new provision has been implemented whereby national players can still compete at international level at \"coaches' discretion\". The time requirement - along with overall skinfold counts - were placed squarely into focus last year after several national players missed out on selection due to them failing one of the two metrics. Sisanda Magala - included in Walter's ODI and T20 squads for the upcoming home series against Australia on Monday - and recently retired former Proteas women's skipper Dane van Niekerk fell foul of the two-kilometre trial, while Lizelle Lee called it quits in protest over being denied a non-objection certificate to play in T20 leagues on the basis of being overweight. To his credit, Magala eventually passed his test and proved to be one of the Proteas' key bowlers in white-ball play last season. It's understood CSA implemented the changes following its medical conference in June, which recognised a need for more flexibility. For Walter, who cut his coaching teeth as a fitness trainer before gradually evolving into a top-flight mentor, it's all about cultivating a team culture where players \"automatically\" strive to maintain the highest standards of overall fitness. \"I suppose the fitness roots never leave you,\" he said. \"From my point of view, I suppose it comes down to the old adage: it's a process. It's a process of getting guys fitter and up to standard. Everyone in any of my teams will attest to my obsession for everyone to be better and that's applicable to fitness too. \"I expect every player in my team to strive towards that and we as team management also have a responsibility to support them in those endeavours.\" The emphasis on a support structure will be somewhat bittersweet to Van Niekerk, who missed out on her final two-kilometer trial by an agonising 18 seconds and was accordingly omitted from the Proteas' squad for the T20 Women's World Cup at home despite losing a significant amount of weight and generally being fitter than ever before according to insiders. READ | Dewald Brevis earns maiden Proteas call-up for Australia series South Africa, however, coped well in her absence and reached the final of the tournament, becoming the first national cricket team to progress that far at a World Cup. The criteria will suit Magala too as, despite him clearly becoming a fitter player last season, he remains saddled with an inherently burly frame. Still, Walter won't look past his output on the field - the 32-year-old took the most limited overs wickets for the Proteas last season - should a fitness issue potentially creep up again. \"Sisanda, on the park, has been electric for us in the recent period and we want to acknowledge those performances,\" he said. \"But we also expect him and everyone else to get fitter, better and stronger because it gives us a better chance of performing. \"Our responsibility is to provide a platform for these guys.\" The Proteas' tussle with the Aussie commences with a three-match T20 series in Durban from 31 August.","pubDate":"2023-08-14 20:48:12","image_url":"https://scripts.24.co.za/img/sites/sport24.png","source_id":"news24","category":["sports"],"country":["south africa"],"language":"english"},{"title":"LPL 2023 Stars Miller, Hasaranga Reveal Cricket Techniques To Aspiring Youngsters","link":"https://www.thetimesofbengal.com/sports/lpl-2023-stars-miller-hasaranga-reveal-cricket-techniques-to-aspiring-youngsters/?utm_source=rss&utm_medium=rss&utm_campaign=lpl-2023-stars-miller-hasaranga-reveal-cricket-techniques-to-aspiring-youngsters","keywords":["Sports"],"creator":["admin"],"video_url":null,"description":"Home Sports LPL 2023 Stars Miller, Hasaranga Reveal Cricket Techniques To Aspiring Youngsters David Miller...","content":"David Miller and Wanindu Hasaranga are running riot in the ongoing Lanka Premier League (LPL) 2023 with their remarkable performances. National, August 14, 2023: David Miller and Wanindu Hasaranga are running riot in the ongoing Lanka Premier League (LPL) 2023 with their remarkable performances. Both the remarkable cricketers are known for their sublime skills which they are using to full effect in the tournament and now will be utilising to impart cricketing knowledge though IPG Pro Tip initiative, an initiative by IPG Group, the rights holders of the league. Star LPL cricketers through the campaign called “Pro Tip” will impart cricketing knowledge to young players to up their game. These aspiring young cricketers from across Sri Lanka are sending questions as recorded videos asking their favourite player to help them overcome the various cricketing challenges they face while they are playing cricket. Miller, known for his destructive pull shots, often puts bowlers in trouble in international cricket. The shot has worked for him in LPL 2023 as well where he is playing for Jaffna Kings. He explained, “For me, the danger ball is the fuller ball. So, I set myself up for it and when I see the shorter ball I try to get into line. I try to play it down just to get some control of the speed and bounce. With the bottom hand, you want a full extension of the bat; just pretend that you’ve got a tennis racket and it’s almost playing a shot into the far right corner.” “We aim to utilize the Lanka Premier League 2023 platform to give something back to the game. This initiative provides young, aspiring kids with a unique opportunity to connect with their cricketing idols and get answers from the stalwarts of the game. It’s a pure source of inspiration that will empower the next generation in Sri Lanka to dream big and pursue those dreams relentlessly,” said Anil Mohan Sankhdhar, Founder and CEO of IPG Group. Hasaranga, on the other hand, revealed the right technique to bowl a googly that has got him a lot of wickets in the LPL 2023. “With googly, I try to use my grip well and pitch the ball in line with the wickets because that will enable me to either get an LBW or a clean bowled,” he commented,” stated the Sri Lankan all-rounder. He further added, “If you watch my games, you may have noticed how I pitched the googly and how I get more wickets. I always try to pitch it in such a way that a batter is unable to play a stroke ensuring the ball doesn’t land too close to them, while keeping the ball in line with the stumps.” IPG plans to utilise other top cricketers playing in the League like Galle Titans skipper Dasun Shanaka and Babar Azam as well to promote and impart cricketing knowledge to young budding cricketers of Sri Lanka.","pubDate":"2023-08-14 20:37:48","image_url":null,"source_id":"the_tob","category":["sports"],"country":["india"],"language":"english"},{"title":"Dewald Brevis receives maiden call-up to Proteas squad for Australia visit","link":"https://www.dailymaverick.co.za/article/2023-08-14-dewald-brevis-receives-maiden-call-up-to-proteas-squad-for-australia-visit/","keywords":null,"creator":["Keanan Hemmonsbey"],"video_url":null,"description":"Proteas coach Rob Walter has named his white-ball squads for Australia’s visit at the end of the month, with four potential debutants in the T20I side. The post Dewald Brevis receives maiden call-up to Proteas squad for Australia visit appeared first on Daily Maverick.","content":"Cricket South Africa on Monday announced their squads for the three-match T20I series and five-match One-Day International series against Australia beginning at the end of August. In his first international call-up, exciting 20-year-old batter Dewald Brevis has been named in both white-ball squads. Brevis first rose to prominence when he smashed his way to become the leading run-scorer at the under-19 Cricket World Cup in January last year with 506 runs – the most by any batter in a single edition of the tournament. The swashbuckling batter also currently holds the record for the highest individual domestic T20 score in South Africa – 162 runs off 57 balls – which he struck in last season’s T20 Challenge for the Titans against the Knights. “It’s great to have Dewald in the squads,” said Rob Walter, Proteas white-ball coach. “He performed well in Sri Lanka (for South Africa ‘A’), he’s performed well domestically, he’s been involved in a number of leagues internationally… so it’s nice to be able to give him an opportunity. “He’s one of our up-and-coming youngsters, so we’ve said we wanted to just broaden our base a little bit, and this Aussie series has been a perfect opportunity to give him a run.” Joining Brevis in the T20I squad for the first time are his Titans teammates Donovan Ferreira and Gerald Coetzee – the latter could add to his Test and ODI caps if selected – as well as Warriors batter, Matthew Breetzke. Quinton de Kock, Heinrich Klaasen, David Miller, Anrich Nortje and Kagiso Rabada are rested for the three-match T20I series and will return for the five-match ODI series. Tony de Zorzi and Ryan Rickelton, who both featured for the Proteas in the ODI series against West Indies in March, have not been included in either squad. It is unlikely that any player not in the current 19-player ODI squad will make the ODI World Cup in India in October. The 15-player squad for the World Cup will be announced on 5 September, while the ODI series against Australia begins two days later. Another surprise inclusion in both the T20I (only second and third) and ODI squads is that of Keshav Maharaj. Maharaj sustained a ruptured Achilles tendon in March this year while playing a Test match for the Proteas against West Indies. An injury like this can keep an athlete off the park for up to a year, but it has only taken Maharaj five months to potentially get back on to the oval field. “He’s done exceptionally well to this point. He’s ahead of where we thought he would be, which is awesome, due in no short measure to the effort that he’s been putting in,” Walter said. “Things look positive, but you know it’s very difficult to guesstimate this last portion of his recovery and being match-ready and taking what you look like on the practice field into a match scenario.” Maharaj has been an integral part of the Proteas’ 50-over setup since his debut in 2017 and could potentially have a big role in South Africa’s quest for a maiden World Cup trophy in India. Walter, however, will not be tempted to rush the left-arm tweaker back into action. “We actually saw the T20I series – given that you know the lesser load in terms of overs bowled and time on feet – as a great opportunity just to see where he’s at, but we still have two weeks before that arrives and so we’ve got a camp to get through,” the coach said. “I’m quietly hopeful that he’ll be ready for those T20s, and if not then, we set our attention to the 50 overs and we just take it bit by bit… but things look positive at this stage.” Regular Proteas T20I middle-order batter Rilee Rossouw has been left out of the squad to take on Australia due to an ankle injury. Meanwhile, former T20 skipper Temba Bavuma as well as stalwart batter, Rassie van der Dussen, have both been drafted back into the shorter-format squad — after both missed out in the most recent series against West Indies. “When [Bavuma and Van Der Dussen] were omitted, it was in some cases a performance-based thing as well as the type of game we wanted to play as a T20 side,” Walter said. “But I was very specific in saying it’s our job to get them back into the team. So we spent – along with the players themselves – a lot of time working on their games. “Rassie’s been off to the Canada GT20, Temba has been working tirelessly back here. So with Quinny [de Kock], David [Miller], Heinrich Klaasen sitting out and Riley missing through injury, it’s a perfect opportunity to give them a run… and for them to be able to show that they are able to manoeuvre their games and grow their games. “I’m excited to see what they have to offer. I think they’re both wonderful players and they’ve both definitely got the qualities to do it.” DM Aiden Markram (captain, Titans), Temba Bavuma (Lions), Matthew Breetzke (Warriors), Dewald Brevis (Titans), Gerald Coetzee (Titans), Donovan Ferreira (Titans), Bjorn Fortuin (Lions), Reeza Hendricks (Lions), Marco Jansen (Warriors), Sisanda Magala (Lions), Keshav Maharaj (Dolphins), Lungi Ngidi (Titans), Tabraiz Shamsi (Titans), Tristan Stubbs (Warriors), Lizaad Williams (Titans) and Rassie van der Dussen (Lions). Temba Bavuma (captain, Lions), Dewald Brevis (Titans), Gerald Coetzee (Titans), Quinton de Kock (Titans), Bjorn Fortuin (Lions), Reeza Hendricks (Lions), Marco Jansen (Warriors), Heinrich Klaasen (Titans), Sisanda Magala (Lions), Keshav Maharaj (Dolphins), Aiden Markram (Titans), David Miller (Dolphins), Lungi Ngidi (Titans), Anrich Nortje (Warriors), Tabraiz Shamsi (Titans), Wayne Parnell (Western Province), Kagiso Rabada (Lions), Tristan Stubbs (Warriors), and Rassie van der Dussen (Lions).","pubDate":"2023-08-14 20:11:58","image_url":null,"source_id":"dailymaverick","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Arlene Kelly leads the way as Ireland Women defeat the Netherlands","link":"https://www.the42.ie/ireland-women-cricket-netherlands-6142853-Aug2023/","keywords":["Ireland Women Cricket"],"creator":null,"video_url":null,"description":"Kelly finished with career-best international figures of 5-12.","content":"A FIVE-WICKET haul by Arlene Kelly propelled Ireland Women to a comprehensive 10-wicket victory over The Netherlands in the first of their three-match T20 International series in Amstelveen. Kelly finished with career-best international figures of 5-12, and also took a catch in a player of the match performance, while Amy Hunter and Gaby Lewis scored an unbeaten 96-run opening partnership to seal the win. Hunter was left just short of her maiden T20I half-century - on 49* off 42 balls – while Lewis finished unbeaten on 43*, from 37 balls, as Ireland comfortably reached their target of 93. After winning the toss Ireland captain Laura Delany sent the Netherlands in to bat on what looked like a pretty decent batting track. That decision ultimately paid off as the Netherlands found themselves two wickets down in successive overs. Orla Prendergast took the wicket of Heather Siegers with a catch by Kelly, while Ava Canning removed Iris Zwilling thanks to a Lewis catch down low at short cover. In the fourth over Georgina Dempsey’s second delivery was over pitched and was duly hit for four by Rijke. However, she bounced back in style, nipping one back into Babette de Leede and smashing her off stump. She followed up a couple of balls later with a slower to Frédérique Overdijk all as Ireland had Netherlands in trouble on 18-4 after just five overs. Ireland introduced spin in the eighth over, but set batter Robine Rijke knocked Cara Murray for a couple of quick boundaries. However, Rijke’s fine innings came to an end on 38 with the first ball of the 12th over, when she scooped one to Prendergast just outside the ring off the bowling of Kelly. She went on take a double-wicket maiden by removing Eva Lynch for a duck as the Netherlands were reeling at 57-6. Ireland’s fielding was much improved, with chances taken and excellent chasing down to limit runs. That was particularly evident by Louise Little’s tremendous fielding out on the boundary, where she chased down numerous balls, turning what looked like boundaries into twos and threes. The wickets kept falling as Kelly’s line and length caused their batters all sorts of problems. And after Hannah Landheer departed for one, Kelly delivered a peach of a delivery when pitching the ball leg side, it turned back inside and clipped the back of the pad of debutant Carlijn Van Koolwijk and into the stumps. Kelly got her five-wicket-haul when Dekeling was caught by Sargent, as she finished with career-best International bowling figures of 5-12. The Netherlands did manage to bat out their innings as they finished on 92-9 after a last-wicket partnership of 23 between Phebe Molkenboer and Caroline de Lange. In the chase Ireland began aggressively and got off to a dream start, as Hunter and Lewis found the boundary rope at will. After two overs Ireland were 18-0, with Hunter hitting a slog-sweep to deep mid-wicket for six. If the Netherlands were to win the game fielding needed to be sharp, but errors started creeping into their game. Lewis brought up the 50-partnership after 7.2 overs with a four straight down the ground. Hunter went on to post her highest T20I score with yet another six to deep mid-wicket as she moved onto 49. But after two failed efforts to get the single she so desperately required; Lewis going on to score the winning runs with a boundary. The sides have a day off tomorrow, but will meet again at the same venue on Wednesday at 1pm. 92-9 (20 overs; R Rijke 38, P Molkenboer 23; A Kelly 5-12 96-0 (13.1 overs; A Hunter 49*, G Lewis 43*; P Molkenboer 0-9)","pubDate":"2023-08-14 18:48:34","image_url":"https://c0.thejournal.ie/media/2023/08/img_8168-630x420.jpg","source_id":"the42","category":["sports"],"country":["ireland"],"language":"english"},{"title":"Ben Stokes 'prepared to come out of one-day international retirement to help England defend the World Cup in India', after a passionate plea from white-ball coach Matthew Mott","link":"https://www.dailymail.co.uk/sport/cricket/article-12406177/Ben-Stokes-prepared-come-one-day-international-retirement-help-England-defend-World-Cup-India-passionate-plea-white-ball-coach-Matthew-Mott.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Ben Stokes is preparing to U-turn on his retirement from one-day international cricket and aid England's bid to retain the World Cup in India, according to a new report.","content":"Ben Stokes 'prepared to come out of one-day international retirement to help England defend the World Cup in India', after a passionate plea from white-ball coach Matthew Mott Ben Stokes is set to cancel his ODI retirement to help England in the World Cup White-ball coach Matthew Mott made a passionate plea to get Stokes back Jofra Archer is also being considered for the 18-man squad going to India By Samuel Draper For Mailonline Published: 19:45, 14 August 2023 | Updated: 19:45, 14 August 2023 e-mail View comments Ben Stokes is preparing to U-turn on his retirement from one-day international cricket and aid England's bid to retain the World Cup in India , according to a new report. The England Test captain is thought to be considering his stance on the shorter version of the game after quitting ODIs last year, even if it means missing out on the next instalment of the Indian Premier League. On Saturday, Mail Sport reported that white-ball coach Matthew Mott was going to plead with Stokes to unretire and join the England squad in October and November. And the Telegraph report that Stokes is planning to do just that if captain Jos Buttler asks, even if it means that Stokes is putting his next IPL season in jeopardy to recover from this year's exploits. Stokes earns £1.6m a year from the IPL, but clearly feels that helping England's defence of the World Cup trophy they won in a remarkable Super Over in 2019 is also a valuable endeavour. Ben Stokes is prepared to U-turn his ODI retirement to held England defend the World Cup White-ball coach Matthew Mott made a passionate plea to get Stokes back in time for India The 32-year-old would be likely to bat in the middle order for the ODI side, selected as a specialist batsman, amid fears about how much bowling he could do. All 15-man World Cup squads must be submitted to the ICC by September 5, but changes can be made for another 22 days after this time. England play four ODIs against New Zealand and three against Ireland before the final deadline on September 27. As previously revealed by Mail Sport, Mott is prepared to gamble on fast bowler Jofra Archer's fitness ahead of the World Cup defence, although they were waiting on an updated medical report before the England selectors meeting on Tuesday. Archer has not appeared during the English summer due to a stress fracture in the elbow, but he has been bowling in the nets with his Sussex team-mates recently. Archer achieved his career best ODI figures in South Africa earlier this year, after an 18 month spell on the sidelines. He also frequently broke the 90-mile-per-hour barrier in Bangladesh, under similar conditions expected in neighbouring India. Four years ago, Stokes held his nerve under pressure to get England to the finish line during the final at Lord's, before Archer bowled the Super Over that saw the hosts beat New Zealand by the barest of margins. England are willing to bring back Jofra Archer after his career-best ODI figures in South Africa Share or comment on this article: Ben Stokes 'prepared to come out of one-day international retirement to help England defend the World Cup in India', after a passionate plea from white-ball coach Matthew Mott e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-08-14 18:45:46","image_url":"https://i.dailymail.co.uk/1s/2023/08/14/19/74253057-0-image-m-30_1692038608913.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Tammy Beaumont creates history, becomes first woman to smash a century in the Hundred","link":"https://www.indiatvnews.com/sports/cricket/england-s-tammy-beaumont-creates-history-becomes-first-woman-to-smash-a-century-in-the-hundred-welsh-fire-2023-08-14-886761","keywords":null,"creator":null,"video_url":null,"description":"Veteran England opener Tammy Beaumont created history with a record-breaking knock in the women's Hundred while leading the Welsh Fire against Trent Rockets. Beaumont slammed the first-ever women's hundred in the 100-ball competition as she notched up the highest score in the tournament's history (men or women) after reaching the three-figure mark in just 52 balls. ","content":"Veteran England opener Tammy Beaumont created history with a record-breaking knock in the women's Hundred while leading the Welsh Fire against Trent Rockets. Beaumont slammed the first-ever women's hundred in the 100-ball competition as she notched up the highest score in the tournament's history (men or women) after reaching the three-figure mark in just 52 balls. Beaumont was in a different mood altogether on Monday, August 14 as she just started bashing from the outset. Sophia Dunkley at the other end just became a mere spectator as Beaumont just didn't stop. Apart from Alana King, no other bowler could have any effect and Bryony Smith got the most pasting as she gave away 52 runs in her 20-ball spell. Beaumont got out on the second last delivery of Welsh Fire's innings but not before smashing 20 fours and a couple of sixes. The 32-year-old became the third centurion in the Hundred history after Will Jacks and Will Smeed got it in the men's competition last year. 118 - Tammy Beaumont (Welsh Fire) vs Trent Rockets, 2023 97* - Beth Mooney (London Spirit) vs Southern Brave, 2022 92* - (Northern Superchargers) vs Welsh Fire, 2021 90* - Laura Wolvaardt (Northern Superchargers) vs Manchester Originals, 2022 81* - Nat Sciver-Brunt (Trent Rockets) vs London Spirit, 2023 118 - Tammy Beaumont (Welsh Fire) vs Trent Rockets, 2023 108* - Will Jacks (Oval Invincibles) vs Southern Brave, 2022 101* - Will Smeed (Birmingham Phoenix) vs Southern Brave, 2022 97* - Beth Mooney (London Spirit) vs Southern Brave, 2022 93 - Dan Lawrence (London Spirit) vs Trent Rockets, 2023 Beaumont's innings helped Welsh Fire get to a strong score of 181 runs, which eventually was too much for the Rockets as they could get to just 140/5 despite a rapid start by the openers Lizelle Lee and Bryony Smith. This was Welsh Fire women's fourth win and they are currently at the top of the table.","pubDate":"2023-08-14 18:26:08","image_url":null,"source_id":"indiatvnews","category":["sports"],"country":["india"],"language":"english"},{"title":"Indian Cricket Team: প্র্যাক্টিস ম্যাচ খেলবেন রাহুল-শ্রেয়স, এশিয়া কাপের দলে রাখা হবে?","link":"https://bengali.abplive.com/sports/indian-cricket-team-kl-rahul-shreyas-iyer-in-match-simulation-training-ahead-of-asia-cup-squad-selection-1001081","keywords":["খেলা"],"creator":["ABP Ananda"],"video_url":null,"description":"বেঙ্গালুরু: সামনেই এশিয়া কাপ। যে টুর্নামেন্টের দল নির্বাচন হবে দিন কয়েকের মধ্যে। তারপরই ওয়ান ডে বিশ্বকাপ। তার আগে কি সম্পূর্ণ সেরে উঠেছেন কে এল রাহুল (KL Rahul) ও শ্রেয়স আইয়ার (Shreyas Iyer)? বেঙ্গালুরুর জাতীয় ক্রিকেট অ্যাকাডেমি থেকে যে খবর পাওয়া যাচ্ছে, তাতে উচ্ছ্বসিত হতে পারেন ভারতীয় ক্রিকেট ভক্তরা। কারণ, ম্যাচ পরিস্থিতিতে ব্যাটিং শুরু করেছেন দুই তারকা। গোটা দুয়েক প্র্যাক্টিস ম্যাচ খেলবেন তাঁরা।  এই সপ্তাহে প্র্যাক্টিস ম্যাচগুলি খেলার কথা রাহুল ও শ্রেয়স আইয়ারের। সেই ম্যাচদুটি থেকে জাতীয় নির্বাচকদের একটা স্পষ্ট ধারণা হতে পারে ম্যাচ পরিস্থিতিতে দুজনে কেমন পারফর্ম করছেন, কতটা সাড়া দিচ্ছে তাঁদের শরীর।    আগামী সপ্তাহে, ২০ অগাস্ট এশিয়া কাপের দল ঘোষণা হওয়ার কথা। তার আগে রাহুল ও শ্রেয়সের শারীরিক অবস্থার আপডেটের দিকে নজর থাকবে জাতীয় নির্বাচকদেরও।   শনিবার ওয়েস্ট ইন্ডিজের বিরুদ্ধে পঞ্চম টি-টোয়েন্টি ম্যাচের পর ভারতীয় দলের কোচ রাহুল দ্রাবিড় বলেছিলেন, 'আমাদের কয়েকজন ক্রিকেটার চোট সারিয়ে দলে ফিরছে। আমরা তাদের এশিয়া কাপের দলে সুযোগ দিতে চাই। এখনই এশিয়া কাপের কথা ভাবছি না। ২৩ অগাস্ট থেকে বেঙ্গালুরুতে এক সপ্তাহের প্রস্তুতি শিবির রয়েছে। ওয়ান ডে দল হিসাবে সকলে সেখানে জড়ো হব। তারপর পরিস্থিতি বুঝে এগনো যাবে।'   ওয়াকিবহাল মহলের মতে, রাহুল ও আইয়ারের শারীরিক অবস্থার পরিস্থিতি দেখে নেওয়ার জন্য এশিয়া কাপের দল ঘোষণার আগে বাড়তি সময় নিচ্ছে বোর্ড। সেই কারণে দেরিতে হচ্ছে এশিয়া কাপের দল নির্বাচন। গত ২১ জুলাই বিবৃতি দিয়ে ভারতীয় ক্রিকেট বোর্ড জানিয়েছিল, রাহুল ও আইয়ার - দুই ব্যাটারই নেটে ব্যাটিং শুরু করেছেন। বোর্ড থেকে বিবৃতি দিয়ে জানানো হয়েছিল, আপাতত দুজনের স্ট্রেংথ ও ফিটনেসের কসরত চলছে। তাঁদের উন্নতি দেখে সন্তোষজনক মনে হয়েছে বিশেষজ্ঞদের। এবার তাঁদের প্রস্তুতির সূচি আরও কঠোর করা হবে। দ্রুত পুরোদমে প্র্যাক্টিস শুরু করবেন দুই ব্যাটার। ঋষভ পন্থের ফিটনেস আপডেটও দিয়েছে বোর্ড। ভারতীয় বোর্ড থেকে জানানো হয়েছে, দ্রুত উন্নতি করছেন ঋষভ পন্থ। নেটে ব্যাটিং ও কিপিং - দুইই শুরু করেছেন। তাঁর জন্য বিশেষ ফিটনেস সূচি তৈরি করা হয়েছে। যার মধ্যে রয়েছে স্ট্রেংথ ও ফ্লেক্সিবিলিটি ড্রিল ও দৌড়। সেই সূচি মেনেই চলছে পন্থের মাঠে ফেরার লড়াই। আরও পড়ুন: নেহরার দুধের গ্লাস ফাঁকা করে দিতেন বীরু! ভারতীয় দলের কৃপণতম ক্রিকেটার কে ছিলেন? আপনার পছন্দের খবর আর আপডেট এখন পাবেন আপনার পছন্দের চ্যাটিং প্ল্যাটফর্ম টেলিগ্রামেও। যুক্ত হোন https://t.me/abpanandaofficial","content":"বেঙ্গালুরু: সামনেই এশিয়া কাপ। যে টুর্নামেন্টের দল নির্বাচন হবে দিন কয়েকের মধ্যে। তারপরই ওয়ান ডে বিশ্বকাপ। তার আগে কি সম্পূর্ণ সেরে উঠেছেন কে এল রাহুল (KL Rahul) ও শ্রেয়স আইয়ার (Shreyas Iyer)? বেঙ্গালুরুর জাতীয় ক্রিকেট অ্যাকাডেমি থেকে যে খবর পাওয়া যাচ্ছে, তাতে উচ্ছ্বসিত হতে পারেন ভারতীয় ক্রিকেট ভক্তরা। কারণ, ম্যাচ পরিস্থিতিতে ব্যাটিং শুরু করেছেন দুই তারকা। গোটা দুয়েক প্র্যাক্টিস ম্যাচ খেলবেন তাঁরা। এই সপ্তাহে প্র্যাক্টিস ম্যাচগুলি খেলার কথা রাহুল ও শ্রেয়স আইয়ার ের। সেই ম্যাচদুটি থেকে জাতীয় নির্বাচকদের একটা স্পষ্ট ধারণা হতে পারে ম্যাচ পরিস্থিতিতে দুজনে কেমন পারফর্ম করছেন, কতটা সাড়া দিচ্ছে তাঁদের শরীর। আগামী সপ্তাহে, ২০ অগাস্ট এশিয়া কাপের দল ঘোষণা হওয়ার কথা। তার আগে রাহুল ও শ্রেয়সের শারীরিক অবস্থার আপডেটের দিকে নজর থাকবে জাতীয় নির্বাচকদেরও। শনিবার ওয়েস্ট ইন্ডিজের বিরুদ্ধে পঞ্চম টি-টোয়েন্টি ম্যাচের পর ভারতীয় দলের কোচ রাহুল দ্রাবিড় বলেছিলেন, 'আমাদের কয়েকজন ক্রিকেটার চোট সারিয়ে দলে ফিরছে। আমরা তাদের এশিয়া কাপের দলে সুযোগ দিতে চাই। এখনই এশিয়া কাপের কথা ভাবছি না। ২৩ অগাস্ট থেকে বেঙ্গালুরুতে এক সপ্তাহের প্রস্তুতি শিবির রয়েছে। ওয়ান ডে দল হিসাবে সকলে সেখানে জড়ো হব। তারপর পরিস্থিতি বুঝে এগনো যাবে।' ওয়াকিবহাল মহলের মতে, রাহুল ও আইয়ারের শারীরিক অবস্থার পরিস্থিতি দেখে নেওয়ার জন্য এশিয়া কাপের দল ঘোষণার আগে বাড়তি সময় নিচ্ছে বোর্ড। সেই কারণে দেরিতে হচ্ছে এশিয়া কাপ ের দল নির্বাচন। গত ২১ জুলাই বিবৃতি দিয়ে ভারতীয় ক্রিকেট বোর্ড জানিয়েছিল, রাহুল ও আইয়ার - দুই ব্যাটারই নেটে ব্যাটিং শুরু করেছেন। বোর্ড থেকে বিবৃতি দিয়ে জানানো হয়েছিল, আপাতত দুজনের স্ট্রেংথ ও ফিটনেসের কসরত চলছে। তাঁদের উন্নতি দেখে সন্তোষজনক মনে হয়েছে বিশেষজ্ঞদের। এবার তাঁদের প্রস্তুতির সূচি আরও কঠোর করা হবে। দ্রুত পুরোদমে প্র্যাক্টিস শুরু করবেন দুই ব্যাটার। ঋষভ পন্থের ফিটনেস আপডেটও দিয়েছে বোর্ড। ভারতীয় বোর্ড থেকে জানানো হয়েছে, দ্রুত উন্নতি করছেন ঋষভ পন্থ। নেটে ব্যাটিং ও কিপিং - দুইই শুরু করেছেন। তাঁর জন্য বিশেষ ফিটনেস সূচি তৈরি করা হয়েছে। যার মধ্যে রয়েছে স্ট্রেংথ ও ফ্লেক্সিবিলিটি ড্রিল ও দৌড়। সেই সূচি মেনেই চলছে পন্থের মাঠে ফেরার লড়াই। googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); আরও পড়ুন: নেহরার দুধের গ্লাস ফাঁকা করে দিতেন বীরু! ভারতীয় দলের কৃপণতম ক্রিকেটার কে ছিলেন? আপনার পছন্দের খবর আর আপডেট এখন পাবেন আপনার পছন্দের চ্যাটিং প্ল্যাটফর্ম টেলিগ্রামেও। যুক্ত হোন https://t.me/abpanandaofficial var _fireSc=!0;document.addEventListener(\"scroll\",(e=>{if(_fireSc){var c=document.createElement(\"script\");c.src=\"//asset.fwpub1.com/js/storyblock.js\",c.async=!0,document.getElementsByTagName(\"head\")[0].appendChild(c),_fireSc=!1}}));","pubDate":"2023-08-14 18:04:03","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/08/14/83ead29891490b8e7cffea04bec929c4169203483039050_original.jpg","source_id":"abplive","category":["sports"],"country":["india"],"language":"Bengali"},{"title":"England pacer Steve Finn announces retirement from all forms of cricket after 18 glorious years","link":"https://www.dnaindia.com/cricket/report-england-pacer-steve-finn-announces-retirement-from-all-forms-of-cricket-after-18-glorious-years-3055844","keywords":["Sports","Cricket"],"creator":["DNA  Web Team"],"video_url":null,"description":"The decision comes after a year-long battle with the knee injury, which sidelined him throughout 2023.","content":"England pacer Steven Finn has officially announced his retirement from all forms of cricket. The decision comes after a year-long battle with the knee injury, which sidelined him throughout 2023. Finn, a three-time Ashes series victor, has gracefully chosen to conclude his magnificent 18-year career. The 34-year-old, who has been an integral part of England's cricketing journey, expressed his sentiment regarding this pivotal moment. With his knee injury severely affecting his ability to perform, Finn decided that the time had come to bid farewell to a sport he has passionately embraced since making his debut for Middlesex in 2005. His journey, though marked by challenges, has been a labor of love that has left a mark on the cricketing world. Having graced the field in 126 matches for England, Finn's prolific career has seen him claim an impressive 254 wickets. His exceptional skills have not been limited to international cricket, as he has been an instrumental force for both Sussex and Middlesex in domestic matches. Finn's impact on the cricketing landscape is evident in his achievements. In his 36 Test matches for England, he managed to capture 125 wickets, with a standout performance of 6-79 against Australia during the 2015 Ashes series. Further, extended to white-ball formats as well, where he scalped 129 wickets in 90 matches representing his country. READ | Benzema to Neymar: Full list of superstars joining Cristiano Ronaldo in Saudi league this summer Addressing the media, Finn shared his sentiments, saying,\"I feel incredibly fortunate to have had the privilege of pursuing cricket as my profession ever since my debut for Middlesex in 2005. The journey has been a mix of highs and lows, yet I have cherished every moment.\" He went on to express his gratitude towards Sussex Cricket, particularly for their unwavering support during the past year. Finn acknowledged his affiliation with the club and regretted not being able to contribute more on the field since joining. He spoke fondly of Sussex as a remarkable place to play cricket. In his concluding words, Finn reflected, \"As I retire, I carry with me cherished memories from my time with England, Middlesex, and Sussex, all made special by the incredible individuals I've had the privilege to share them with.\" He expressed his deep appreciation for his followers and supporters, singling out his parents for their unwavering encouragement during his formative years. As his chapter on the field concludes, the cricketing world salutes Finn for his remarkable career and wishes him the best in his future endeavours.","pubDate":"2023-08-14 18:04:00","image_url":null,"source_id":"dnaindia","category":["sports"],"country":["india"],"language":"english"},{"title":"हार्दिक पंड्या से भी गट्सी निकले कुलदीप यादव, दो लाइन में कह दी अपनी पूरी बात","link":"https://navbharattimes.indiatimes.com/sports/cricket/cricket-news/kuldeep-yadav-gutted-more-hardik-pandya-said-his-whole-thing-in-two-lines/articleshow/102731685.cms","keywords":null,"creator":null,"video_url":null,"description":"Kuldeep Yadav: वेस्टइंडीज के खिलाफ टी20 सीरीज में भारतीय टीम को बेशक 3-2 से हार मिली है लेकिन कुछ खिलाड़ियों के लिए यह दौरा काफी शानदार रहा है, जिसमें कुलदीप यादव का नाम भी शामिल है।","content":"वेस्टइंडीज दौरे पर भारतीय क्रिकेट टीम ने जहां टेस्ट सीरीज में जीत के साथ अभियान की शुरुआत की थी तो टी20 सीरीज में उसे हार से संतोष करना पड़ा। पांच टी20 मैचों की सीरीज में भारतीय टीम को 3-2 से हार मिली। चार मैचों तक सीरीज 2-2 की बराबरी पर था लेकिन इसके बाद अंतिम मैच में टीम इंडिया मेजबान वेस्टइंडीज से पिछड़ गई। वेस्टइंडीज के खिलाफ इस टी20 सीरीज में टीम इंडिया के कई खिलाड़ियों ने दमदार खेल का प्रदर्शन किया। इसमें स्पिन गेंदबाज कुलदीप यादव का नाम भी शामिल है। हालांकि उनके दमदार खेल के बावजूद टीम इंडिया सीरीज नहीं जीत पाई लेकिन कुलदीप यादव का हौसला नहीं टूटा है। वह कप्तान हार्दिक पंड्या से भी मजबूत दिखे। कुलदीप ने इस सीरीज के बाद अपने ट्विटर हैंडल पर लिखा, बेशक हम सीरीज के परिणाम से निराश हैं, लेकिन पूरी सीरीज में जिस तरह टीम द्वारा खेल दिखाया गया उस पर मुझे गर्व है। कुछ सीख के साथ फिर वापस आएंगे, मजबूत और बेहतर तरीके से। बता दें कि कुलदीप यादव ने वेस्टइंडीज के खिलाफ कुल 4 टी20 मैचों में मैदान पर उतरे थे, जिसमें उन्होंने 7 विकेट हासिल किए। वापसी के बाद से ही कुलदीप अपने दमदार लय में दिख रहे हैं। ऐसे में उनके लिए वेस्टइंडीज दौरा काफी दमदार माना जा सकता है। वेस्टइंडीज के खिलाफ टीम इंडिया की कप्तानी करने वाले हार्दिक पंड्या भी सीरीज गंवाने से निराश दिखे थे। हालांकि उन्होंने कहा कि कभी-कभी हार से भी बहुत कुछ सीखने को मिलता है, लेकिन उन्हें उम्मीद है टीम इंडिया इस हार से हताश नहीं होगी और मजबूती के साथ वापसी करेगी।","pubDate":"2023-08-14 17:44:31","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Al-Ettifaq 2-1 Al-Nassr: Steven Gerrard and Jordan Henderson get off to winning start in Saudi Arabia as Cristiano Ronaldo misses out through injury","link":"https://www.dailymail.co.uk/sport/football/article-12406471/Al-Ettifaq-2-1-Al-Nassr-Cristiano-Ronaldo-misses-injury-Steven-Gerrard-Jordan-Henderson-winning-start-Saudi-Arabia.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Gerrard's side struggled in the first half but turned it around with two quick goals in the second period. Robin Qaison netted the equaliser and Moussa Dembele poked in the winner just moments later.","content":"Al-Ettifaq 2-1 Al-Nassr: Steven Gerrard and Jordan Henderson get off to winning start in Saudi Arabia after comeback following Sadio Mane's opener as Cristiano Ronaldo misses out through injury Henderson picked up a fortunate assist as El-Ettifaq came from behind to win Sadio Mane scored the opener for the visitors and continued to threaten WATCH: 'It's All Kicking Off' - Episode 1 - Mail Sport's brand new football show By Mike Keegan For Mailonline Published: 21:14, 14 August 2023 | Updated: 00:58, 15 August 2023 e-mail 656 shares 41 View comments Around an hour before kick-off the Islamic call to prayer echoed around the compact, bowl-shaped stadium from a nearby speaker. Officials drenched in sweat stood on the athletics track enthusiastically waving arms and rehearsing chants with excited schoolchildren ahead of a game for which around 15,000 would be present, with 11,000 seats left unflipped. The night-time temperature was a 36 Celsius, so humid it felt like the last few seconds of a steam room session, in settings more akin to an Indian cricket ground rather than a Premier League arena. Camera operators took their places, placing wet towels on their heads. Outside, hawkers dealt almost exclusively in merchandise bearing the colours of the away team, who had almost as many followers inside as the hosts. This was not Liverpool. This was not Anfield. This was not Sunderland. This was the Prince Mohammed bin Fahad bin Abdulaziz Stadium, where Steven Gerrard and Jordan Henderson took the first steps of their Saudi Arabia careers with Al-Ettifaq on a steamy evening on the country’s east coast. Steven Gerrard got off to a winning start at Al-Ettifaq manager with a 2-1 victory over Al-Nassr Sadio Mane (left) scored or Al-Nassr and Jordan Henderson (right) picked up an assist Saudi Arabia poster boy Cristiano Ronaldo missed the game because of an injury Your browser does not support iframes. Just three minutes and thirty three seconds after kick-off the size of the task ahead presented itself when the Riyadh big guns of Al-Nassr, without an injured Cristiano Ronaldo, took the lead thanks to an old friend. Sadio Mane’s trip to the Middle East has gone comparatively unnoticed in the spending spree and none of Gerrard’s defenders spotted him here, as he stole in to slot home from close range. The away end, in which around 2,000 had gathered, celebrated, as did large pockets of yellow in the home sections. This felt like a smaller club against a relative giant. The first-half was low on quality. That was understandable for a much-changed Al-Nassr, involved in an exhausting Arab Club Champions Cup Final extra-time win on Saturday night. But Gerrard, hands on hips and dressed in black, appeared frustrated as he patrolled the edge of his technical area, shouting instructions and clapping his hands to little effect. There was at least some familiarity. Twice Henderson attempted his aerial through balls but here there was no Salah to run onto them and the goalkeeper came and collected on both occasions. He also twisted and turned in the area, sending a defender to the shops, but then miscued his cross over the bar. Mane shone and had a late equaliser ruled out for offside in the absence of Ronaldo Gerrard has hinted as the size of the task at hand but he got off to the perfect start on Monday Gerrard had hinted at this being a big job. He is not at a superpower and will have had to earn some of his giant salary at half-time. Dammam, Al-Ettifaq’s home, already has an integral place in Saudi’s history. It was here, in 1938, when a team of drillers from California finally struck the rich vein of oil that would transform the country’s fortunes. It is a city built on that oil, a giant Texas of the desert. But from a football perspective there have been barren years. Al-Ettifaq won the league twice in the 1980s but there has been no title since then. Henderson will know that feeling, although whether he can be part of a celebrated squad that breaks that run remains to be seen. But there was luck. Shortly after the restart – during which Gerrard (and his translator) had presumably issued stern words, Henderson launched a corner into the box and Al-Nassr keeper Nawaf Alaqidi, who appeared to have lost the ability to catch, fumbled a ball under no pressure. Swede Robin Quaison tapped in. Henderson and Mane, former Liverpool team-mates, were reunited at the toss as captains of their sides On 52 minutes, Al-Ettifaq had the lead when Alaqidi punched another cross and this time Moussa Dembele, formerly of Celtic, scrambled it home, The visitors pressed but could not find a response. Henderson, shirt stuck to his chest, exited on 87 minutes to an ovation. For a 33-year-old who covers every blade, the remainder of blazing summer will be a heavy introduction. Fourteen minutes were added, enough time for Mane to have an equaliser ruled out for offside. It was not pretty, but this was a decent start. This was not Liverpool, but it was three points. Share or comment on this article: Al-Ettifaq 2-1 Al-Nassr: Steven Gerrard and Jordan Henderson get off to winning start in Saudi Arabia as Cristiano Ronaldo misses out through injury e-mail 656 shares Add comment Comments 41 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-08-14 22:50:58","image_url":"https://i.dailymail.co.uk/1s/2023/08/14/22/74312125-0-image-a-76_1692047774062.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"News24.com | Guarded thumbs-up from Proteas mentor Walter as CSA relaxes controversial fitness criteria","link":"https://www.news24.com/sport/Cricket/Proteas/guarded-thumbs-up-from-proteas-mentor-walter-as-csa-relaxes-controversial-fitness-criteria-20230814","keywords":null,"creator":null,"video_url":null,"description":"Proteas white-ball mentor Rob Walter has implicitly given the thumbs-up to CSA's new fitness requirements for national players.","content":"Proteas white-ball coach Rob Walter has somewhat guardedly given his implicit approval to Cricket South Africa's (CSA) relaxed fitness criteria ahead of the new season, which is now focused on a catching-flies-with-honey approach than rigid enforcement. In a communique circulated to local players, the federation states that while its mildly controversial two-kilometre run standard remains 8 minutes 30 seconds and 9 minutes 30 seconds for men and women respectively, a new provision has been implemented whereby national players can still compete at international level at \"coaches' discretion\". The time requirement - along with overall skinfold counts - were placed squarely into focus last year after several national players missed out on selection due to them failing one of the two metrics. Sisanda Magala - included in Walter's ODI and T20 squads for the upcoming home series against Australia on Monday - and recently retired former Proteas women's skipper Dane van Niekerk fell foul of the two-kilometre trial, while Lizelle Lee called it quits in protest over being denied a non-objection certificate to play in T20 leagues on the basis of being overweight. To his credit, Magala eventually passed his test and proved to be one of the Proteas' key bowlers in white-ball play last season. It's understood CSA implemented the changes following its medical conference in June, which recognised a need for more flexibility. For Walter, who cut his coaching teeth as a fitness trainer before gradually evolving into a top-flight mentor, it's all about cultivating a team culture where players \"automatically\" strive to maintain the highest standards of overall fitness. \"I suppose the fitness roots never leave you,\" he said. \"From my point of view, I suppose it comes down to the old adage: it's a process. It's a process of getting guys fitter and up to standard. Everyone in any of my teams will attest to my obsession for everyone to be better and that's applicable to fitness too. \"I expect every player in my team to strive towards that and we as team management also have a responsibility to support them in those endeavours.\" The emphasis on a support structure will be somewhat bittersweet to Van Niekerk, who missed out on her final two-kilometer trial by an agonising 18 seconds and was accordingly omitted from the Proteas' squad for the T20 Women's World Cup at home despite losing a significant amount of weight and generally being fitter than ever before according to insiders. READ | Dewald Brevis earns maiden Proteas call-up for Australia series South Africa, however, coped well in her absence and reached the final of the tournament, becoming the first national cricket team to progress that far at a World Cup. The criteria will suit Magala too as, despite him clearly becoming a fitter player last season, he remains saddled with an inherently burly frame. Still, Walter won't look past his output on the field - the 32-year-old took the most limited overs wickets for the Proteas last season - should a fitness issue potentially creep up again. \"Sisanda, on the park, has been electric for us in the recent period and we want to acknowledge those performances,\" he said. \"But we also expect him and everyone else to get fitter, better and stronger because it gives us a better chance of performing. \"Our responsibility is to provide a platform for these guys.\" The Proteas' tussle with the Aussie commences with a three-match T20 series in Durban from 31 August.","pubDate":"2023-08-14 20:48:12","image_url":"https://scripts.24.co.za/img/sites/sport24.png","source_id":"news24","category":["sports"],"country":["south africa"],"language":"english"},{"title":"LPL 2023 Stars Miller, Hasaranga Reveal Cricket Techniques To Aspiring Youngsters","link":"https://www.thetimesofbengal.com/sports/lpl-2023-stars-miller-hasaranga-reveal-cricket-techniques-to-aspiring-youngsters/?utm_source=rss&utm_medium=rss&utm_campaign=lpl-2023-stars-miller-hasaranga-reveal-cricket-techniques-to-aspiring-youngsters","keywords":["Sports"],"creator":["admin"],"video_url":null,"description":"Home Sports LPL 2023 Stars Miller, Hasaranga Reveal Cricket Techniques To Aspiring Youngsters David Miller...","content":"David Miller and Wanindu Hasaranga are running riot in the ongoing Lanka Premier League (LPL) 2023 with their remarkable performances. National, August 14, 2023: David Miller and Wanindu Hasaranga are running riot in the ongoing Lanka Premier League (LPL) 2023 with their remarkable performances. Both the remarkable cricketers are known for their sublime skills which they are using to full effect in the tournament and now will be utilising to impart cricketing knowledge though IPG Pro Tip initiative, an initiative by IPG Group, the rights holders of the league. Star LPL cricketers through the campaign called “Pro Tip” will impart cricketing knowledge to young players to up their game. These aspiring young cricketers from across Sri Lanka are sending questions as recorded videos asking their favourite player to help them overcome the various cricketing challenges they face while they are playing cricket. Miller, known for his destructive pull shots, often puts bowlers in trouble in international cricket. The shot has worked for him in LPL 2023 as well where he is playing for Jaffna Kings. He explained, “For me, the danger ball is the fuller ball. So, I set myself up for it and when I see the shorter ball I try to get into line. I try to play it down just to get some control of the speed and bounce. With the bottom hand, you want a full extension of the bat; just pretend that you’ve got a tennis racket and it’s almost playing a shot into the far right corner.” “We aim to utilize the Lanka Premier League 2023 platform to give something back to the game. This initiative provides young, aspiring kids with a unique opportunity to connect with their cricketing idols and get answers from the stalwarts of the game. It’s a pure source of inspiration that will empower the next generation in Sri Lanka to dream big and pursue those dreams relentlessly,” said Anil Mohan Sankhdhar, Founder and CEO of IPG Group. Hasaranga, on the other hand, revealed the right technique to bowl a googly that has got him a lot of wickets in the LPL 2023. “With googly, I try to use my grip well and pitch the ball in line with the wickets because that will enable me to either get an LBW or a clean bowled,” he commented,” stated the Sri Lankan all-rounder. He further added, “If you watch my games, you may have noticed how I pitched the googly and how I get more wickets. I always try to pitch it in such a way that a batter is unable to play a stroke ensuring the ball doesn’t land too close to them, while keeping the ball in line with the stumps.” IPG plans to utilise other top cricketers playing in the League like Galle Titans skipper Dasun Shanaka and Babar Azam as well to promote and impart cricketing knowledge to young budding cricketers of Sri Lanka.","pubDate":"2023-08-14 20:37:48","image_url":null,"source_id":"the_tob","category":["sports"],"country":["india"],"language":"english"},{"title":"Dewald Brevis receives maiden call-up to Proteas squad for Australia visit","link":"https://www.dailymaverick.co.za/article/2023-08-14-dewald-brevis-receives-maiden-call-up-to-proteas-squad-for-australia-visit/","keywords":null,"creator":["Keanan Hemmonsbey"],"video_url":null,"description":"Proteas coach Rob Walter has named his white-ball squads for Australia’s visit at the end of the month, with four potential debutants in the T20I side. The post Dewald Brevis receives maiden call-up to Proteas squad for Australia visit appeared first on Daily Maverick.","content":"Cricket South Africa on Monday announced their squads for the three-match T20I series and five-match One-Day International series against Australia beginning at the end of August. In his first international call-up, exciting 20-year-old batter Dewald Brevis has been named in both white-ball squads. Brevis first rose to prominence when he smashed his way to become the leading run-scorer at the under-19 Cricket World Cup in January last year with 506 runs – the most by any batter in a single edition of the tournament. The swashbuckling batter also currently holds the record for the highest individual domestic T20 score in South Africa – 162 runs off 57 balls – which he struck in last season’s T20 Challenge for the Titans against the Knights. “It’s great to have Dewald in the squads,” said Rob Walter, Proteas white-ball coach. “He performed well in Sri Lanka (for South Africa ‘A’), he’s performed well domestically, he’s been involved in a number of leagues internationally… so it’s nice to be able to give him an opportunity. “He’s one of our up-and-coming youngsters, so we’ve said we wanted to just broaden our base a little bit, and this Aussie series has been a perfect opportunity to give him a run.” Joining Brevis in the T20I squad for the first time are his Titans teammates Donovan Ferreira and Gerald Coetzee – the latter could add to his Test and ODI caps if selected – as well as Warriors batter, Matthew Breetzke. Quinton de Kock, Heinrich Klaasen, David Miller, Anrich Nortje and Kagiso Rabada are rested for the three-match T20I series and will return for the five-match ODI series. Tony de Zorzi and Ryan Rickelton, who both featured for the Proteas in the ODI series against West Indies in March, have not been included in either squad. It is unlikely that any player not in the current 19-player ODI squad will make the ODI World Cup in India in October. The 15-player squad for the World Cup will be announced on 5 September, while the ODI series against Australia begins two days later. Another surprise inclusion in both the T20I (only second and third) and ODI squads is that of Keshav Maharaj. Maharaj sustained a ruptured Achilles tendon in March this year while playing a Test match for the Proteas against West Indies. An injury like this can keep an athlete off the park for up to a year, but it has only taken Maharaj five months to potentially get back on to the oval field. “He’s done exceptionally well to this point. He’s ahead of where we thought he would be, which is awesome, due in no short measure to the effort that he’s been putting in,” Walter said. “Things look positive, but you know it’s very difficult to guesstimate this last portion of his recovery and being match-ready and taking what you look like on the practice field into a match scenario.” Maharaj has been an integral part of the Proteas’ 50-over setup since his debut in 2017 and could potentially have a big role in South Africa’s quest for a maiden World Cup trophy in India. Walter, however, will not be tempted to rush the left-arm tweaker back into action. “We actually saw the T20I series – given that you know the lesser load in terms of overs bowled and time on feet – as a great opportunity just to see where he’s at, but we still have two weeks before that arrives and so we’ve got a camp to get through,” the coach said. “I’m quietly hopeful that he’ll be ready for those T20s, and if not then, we set our attention to the 50 overs and we just take it bit by bit… but things look positive at this stage.” Regular Proteas T20I middle-order batter Rilee Rossouw has been left out of the squad to take on Australia due to an ankle injury. Meanwhile, former T20 skipper Temba Bavuma as well as stalwart batter, Rassie van der Dussen, have both been drafted back into the shorter-format squad — after both missed out in the most recent series against West Indies. “When [Bavuma and Van Der Dussen] were omitted, it was in some cases a performance-based thing as well as the type of game we wanted to play as a T20 side,” Walter said. “But I was very specific in saying it’s our job to get them back into the team. So we spent – along with the players themselves – a lot of time working on their games. “Rassie’s been off to the Canada GT20, Temba has been working tirelessly back here. So with Quinny [de Kock], David [Miller], Heinrich Klaasen sitting out and Riley missing through injury, it’s a perfect opportunity to give them a run… and for them to be able to show that they are able to manoeuvre their games and grow their games. “I’m excited to see what they have to offer. I think they’re both wonderful players and they’ve both definitely got the qualities to do it.” DM Aiden Markram (captain, Titans), Temba Bavuma (Lions), Matthew Breetzke (Warriors), Dewald Brevis (Titans), Gerald Coetzee (Titans), Donovan Ferreira (Titans), Bjorn Fortuin (Lions), Reeza Hendricks (Lions), Marco Jansen (Warriors), Sisanda Magala (Lions), Keshav Maharaj (Dolphins), Lungi Ngidi (Titans), Tabraiz Shamsi (Titans), Tristan Stubbs (Warriors), Lizaad Williams (Titans) and Rassie van der Dussen (Lions). Temba Bavuma (captain, Lions), Dewald Brevis (Titans), Gerald Coetzee (Titans), Quinton de Kock (Titans), Bjorn Fortuin (Lions), Reeza Hendricks (Lions), Marco Jansen (Warriors), Heinrich Klaasen (Titans), Sisanda Magala (Lions), Keshav Maharaj (Dolphins), Aiden Markram (Titans), David Miller (Dolphins), Lungi Ngidi (Titans), Anrich Nortje (Warriors), Tabraiz Shamsi (Titans), Wayne Parnell (Western Province), Kagiso Rabada (Lions), Tristan Stubbs (Warriors), and Rassie van der Dussen (Lions).","pubDate":"2023-08-14 20:11:58","image_url":null,"source_id":"dailymaverick","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Arlene Kelly leads the way as Ireland Women defeat the Netherlands","link":"https://www.the42.ie/ireland-women-cricket-netherlands-6142853-Aug2023/","keywords":["Ireland Women Cricket"],"creator":null,"video_url":null,"description":"Kelly finished with career-best international figures of 5-12.","content":"A FIVE-WICKET haul by Arlene Kelly propelled Ireland Women to a comprehensive 10-wicket victory over The Netherlands in the first of their three-match T20 International series in Amstelveen. Kelly finished with career-best international figures of 5-12, and also took a catch in a player of the match performance, while Amy Hunter and Gaby Lewis scored an unbeaten 96-run opening partnership to seal the win. Hunter was left just short of her maiden T20I half-century - on 49* off 42 balls – while Lewis finished unbeaten on 43*, from 37 balls, as Ireland comfortably reached their target of 93. After winning the toss Ireland captain Laura Delany sent the Netherlands in to bat on what looked like a pretty decent batting track. That decision ultimately paid off as the Netherlands found themselves two wickets down in successive overs. Orla Prendergast took the wicket of Heather Siegers with a catch by Kelly, while Ava Canning removed Iris Zwilling thanks to a Lewis catch down low at short cover. In the fourth over Georgina Dempsey’s second delivery was over pitched and was duly hit for four by Rijke. However, she bounced back in style, nipping one back into Babette de Leede and smashing her off stump. She followed up a couple of balls later with a slower to Frédérique Overdijk all as Ireland had Netherlands in trouble on 18-4 after just five overs. Ireland introduced spin in the eighth over, but set batter Robine Rijke knocked Cara Murray for a couple of quick boundaries. However, Rijke’s fine innings came to an end on 38 with the first ball of the 12th over, when she scooped one to Prendergast just outside the ring off the bowling of Kelly. She went on take a double-wicket maiden by removing Eva Lynch for a duck as the Netherlands were reeling at 57-6. Ireland’s fielding was much improved, with chances taken and excellent chasing down to limit runs. That was particularly evident by Louise Little’s tremendous fielding out on the boundary, where she chased down numerous balls, turning what looked like boundaries into twos and threes. The wickets kept falling as Kelly’s line and length caused their batters all sorts of problems. And after Hannah Landheer departed for one, Kelly delivered a peach of a delivery when pitching the ball leg side, it turned back inside and clipped the back of the pad of debutant Carlijn Van Koolwijk and into the stumps. Kelly got her five-wicket-haul when Dekeling was caught by Sargent, as she finished with career-best International bowling figures of 5-12. The Netherlands did manage to bat out their innings as they finished on 92-9 after a last-wicket partnership of 23 between Phebe Molkenboer and Caroline de Lange. In the chase Ireland began aggressively and got off to a dream start, as Hunter and Lewis found the boundary rope at will. After two overs Ireland were 18-0, with Hunter hitting a slog-sweep to deep mid-wicket for six. If the Netherlands were to win the game fielding needed to be sharp, but errors started creeping into their game. Lewis brought up the 50-partnership after 7.2 overs with a four straight down the ground. Hunter went on to post her highest T20I score with yet another six to deep mid-wicket as she moved onto 49. But after two failed efforts to get the single she so desperately required; Lewis going on to score the winning runs with a boundary. The sides have a day off tomorrow, but will meet again at the same venue on Wednesday at 1pm. 92-9 (20 overs; R Rijke 38, P Molkenboer 23; A Kelly 5-12 96-0 (13.1 overs; A Hunter 49*, G Lewis 43*; P Molkenboer 0-9)","pubDate":"2023-08-14 18:48:34","image_url":"https://c0.thejournal.ie/media/2023/08/img_8168-630x420.jpg","source_id":"the42","category":["sports"],"country":["ireland"],"language":"english"},{"title":"Ben Stokes 'prepared to come out of one-day international retirement to help England defend the World Cup in India', after a passionate plea from white-ball coach Matthew Mott","link":"https://www.dailymail.co.uk/sport/cricket/article-12406177/Ben-Stokes-prepared-come-one-day-international-retirement-help-England-defend-World-Cup-India-passionate-plea-white-ball-coach-Matthew-Mott.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Ben Stokes is preparing to U-turn on his retirement from one-day international cricket and aid England's bid to retain the World Cup in India, according to a new report.","content":"Ben Stokes 'prepared to come out of one-day international retirement to help England defend the World Cup in India', after a passionate plea from white-ball coach Matthew Mott Ben Stokes is set to cancel his ODI retirement to help England in the World Cup White-ball coach Matthew Mott made a passionate plea to get Stokes back Jofra Archer is also being considered for the 18-man squad going to India By Samuel Draper For Mailonline Published: 19:45, 14 August 2023 | Updated: 19:45, 14 August 2023 e-mail View comments Ben Stokes is preparing to U-turn on his retirement from one-day international cricket and aid England's bid to retain the World Cup in India , according to a new report. The England Test captain is thought to be considering his stance on the shorter version of the game after quitting ODIs last year, even if it means missing out on the next instalment of the Indian Premier League. On Saturday, Mail Sport reported that white-ball coach Matthew Mott was going to plead with Stokes to unretire and join the England squad in October and November. And the Telegraph report that Stokes is planning to do just that if captain Jos Buttler asks, even if it means that Stokes is putting his next IPL season in jeopardy to recover from this year's exploits. Stokes earns £1.6m a year from the IPL, but clearly feels that helping England's defence of the World Cup trophy they won in a remarkable Super Over in 2019 is also a valuable endeavour. Ben Stokes is prepared to U-turn his ODI retirement to held England defend the World Cup White-ball coach Matthew Mott made a passionate plea to get Stokes back in time for India The 32-year-old would be likely to bat in the middle order for the ODI side, selected as a specialist batsman, amid fears about how much bowling he could do. All 15-man World Cup squads must be submitted to the ICC by September 5, but changes can be made for another 22 days after this time. England play four ODIs against New Zealand and three against Ireland before the final deadline on September 27. As previously revealed by Mail Sport, Mott is prepared to gamble on fast bowler Jofra Archer's fitness ahead of the World Cup defence, although they were waiting on an updated medical report before the England selectors meeting on Tuesday. Archer has not appeared during the English summer due to a stress fracture in the elbow, but he has been bowling in the nets with his Sussex team-mates recently. Archer achieved his career best ODI figures in South Africa earlier this year, after an 18 month spell on the sidelines. He also frequently broke the 90-mile-per-hour barrier in Bangladesh, under similar conditions expected in neighbouring India. Four years ago, Stokes held his nerve under pressure to get England to the finish line during the final at Lord's, before Archer bowled the Super Over that saw the hosts beat New Zealand by the barest of margins. England are willing to bring back Jofra Archer after his career-best ODI figures in South Africa Share or comment on this article: Ben Stokes 'prepared to come out of one-day international retirement to help England defend the World Cup in India', after a passionate plea from white-ball coach Matthew Mott e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-08-14 18:45:46","image_url":"https://i.dailymail.co.uk/1s/2023/08/14/19/74253057-0-image-m-30_1692038608913.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Tammy Beaumont creates history, becomes first woman to smash a century in the Hundred","link":"https://www.indiatvnews.com/sports/cricket/england-s-tammy-beaumont-creates-history-becomes-first-woman-to-smash-a-century-in-the-hundred-welsh-fire-2023-08-14-886761","keywords":null,"creator":null,"video_url":null,"description":"Veteran England opener Tammy Beaumont created history with a record-breaking knock in the women's Hundred while leading the Welsh Fire against Trent Rockets. Beaumont slammed the first-ever women's hundred in the 100-ball competition as she notched up the highest score in the tournament's history (men or women) after reaching the three-figure mark in just 52 balls. ","content":"Veteran England opener Tammy Beaumont created history with a record-breaking knock in the women's Hundred while leading the Welsh Fire against Trent Rockets. Beaumont slammed the first-ever women's hundred in the 100-ball competition as she notched up the highest score in the tournament's history (men or women) after reaching the three-figure mark in just 52 balls. Beaumont was in a different mood altogether on Monday, August 14 as she just started bashing from the outset. Sophia Dunkley at the other end just became a mere spectator as Beaumont just didn't stop. Apart from Alana King, no other bowler could have any effect and Bryony Smith got the most pasting as she gave away 52 runs in her 20-ball spell. Beaumont got out on the second last delivery of Welsh Fire's innings but not before smashing 20 fours and a couple of sixes. The 32-year-old became the third centurion in the Hundred history after Will Jacks and Will Smeed got it in the men's competition last year. 118 - Tammy Beaumont (Welsh Fire) vs Trent Rockets, 2023 97* - Beth Mooney (London Spirit) vs Southern Brave, 2022 92* - (Northern Superchargers) vs Welsh Fire, 2021 90* - Laura Wolvaardt (Northern Superchargers) vs Manchester Originals, 2022 81* - Nat Sciver-Brunt (Trent Rockets) vs London Spirit, 2023 118 - Tammy Beaumont (Welsh Fire) vs Trent Rockets, 2023 108* - Will Jacks (Oval Invincibles) vs Southern Brave, 2022 101* - Will Smeed (Birmingham Phoenix) vs Southern Brave, 2022 97* - Beth Mooney (London Spirit) vs Southern Brave, 2022 93 - Dan Lawrence (London Spirit) vs Trent Rockets, 2023 Beaumont's innings helped Welsh Fire get to a strong score of 181 runs, which eventually was too much for the Rockets as they could get to just 140/5 despite a rapid start by the openers Lizelle Lee and Bryony Smith. This was Welsh Fire women's fourth win and they are currently at the top of the table.","pubDate":"2023-08-14 18:26:08","image_url":null,"source_id":"indiatvnews","category":["sports"],"country":["india"],"language":"english"},{"title":"Indian Cricket Team: প্র্যাক্টিস ম্যাচ খেলবেন রাহুল-শ্রেয়স, এশিয়া কাপের দলে রাখা হবে?","link":"https://bengali.abplive.com/sports/indian-cricket-team-kl-rahul-shreyas-iyer-in-match-simulation-training-ahead-of-asia-cup-squad-selection-1001081","keywords":["খেলা"],"creator":["ABP Ananda"],"video_url":null,"description":"বেঙ্গালুরু: সামনেই এশিয়া কাপ। যে টুর্নামেন্টের দল নির্বাচন হবে দিন কয়েকের মধ্যে। তারপরই ওয়ান ডে বিশ্বকাপ। তার আগে কি সম্পূর্ণ সেরে উঠেছেন কে এল রাহুল (KL Rahul) ও শ্রেয়স আইয়ার (Shreyas Iyer)? বেঙ্গালুরুর জাতীয় ক্রিকেট অ্যাকাডেমি থেকে যে খবর পাওয়া যাচ্ছে, তাতে উচ্ছ্বসিত হতে পারেন ভারতীয় ক্রিকেট ভক্তরা। কারণ, ম্যাচ পরিস্থিতিতে ব্যাটিং শুরু করেছেন দুই তারকা। গোটা দুয়েক প্র্যাক্টিস ম্যাচ খেলবেন তাঁরা।  এই সপ্তাহে প্র্যাক্টিস ম্যাচগুলি খেলার কথা রাহুল ও শ্রেয়স আইয়ারের। সেই ম্যাচদুটি থেকে জাতীয় নির্বাচকদের একটা স্পষ্ট ধারণা হতে পারে ম্যাচ পরিস্থিতিতে দুজনে কেমন পারফর্ম করছেন, কতটা সাড়া দিচ্ছে তাঁদের শরীর।    আগামী সপ্তাহে, ২০ অগাস্ট এশিয়া কাপের দল ঘোষণা হওয়ার কথা। তার আগে রাহুল ও শ্রেয়সের শারীরিক অবস্থার আপডেটের দিকে নজর থাকবে জাতীয় নির্বাচকদেরও।   শনিবার ওয়েস্ট ইন্ডিজের বিরুদ্ধে পঞ্চম টি-টোয়েন্টি ম্যাচের পর ভারতীয় দলের কোচ রাহুল দ্রাবিড় বলেছিলেন, 'আমাদের কয়েকজন ক্রিকেটার চোট সারিয়ে দলে ফিরছে। আমরা তাদের এশিয়া কাপের দলে সুযোগ দিতে চাই। এখনই এশিয়া কাপের কথা ভাবছি না। ২৩ অগাস্ট থেকে বেঙ্গালুরুতে এক সপ্তাহের প্রস্তুতি শিবির রয়েছে। ওয়ান ডে দল হিসাবে সকলে সেখানে জড়ো হব। তারপর পরিস্থিতি বুঝে এগনো যাবে।'   ওয়াকিবহাল মহলের মতে, রাহুল ও আইয়ারের শারীরিক অবস্থার পরিস্থিতি দেখে নেওয়ার জন্য এশিয়া কাপের দল ঘোষণার আগে বাড়তি সময় নিচ্ছে বোর্ড। সেই কারণে দেরিতে হচ্ছে এশিয়া কাপের দল নির্বাচন। গত ২১ জুলাই বিবৃতি দিয়ে ভারতীয় ক্রিকেট বোর্ড জানিয়েছিল, রাহুল ও আইয়ার - দুই ব্যাটারই নেটে ব্যাটিং শুরু করেছেন। বোর্ড থেকে বিবৃতি দিয়ে জানানো হয়েছিল, আপাতত দুজনের স্ট্রেংথ ও ফিটনেসের কসরত চলছে। তাঁদের উন্নতি দেখে সন্তোষজনক মনে হয়েছে বিশেষজ্ঞদের। এবার তাঁদের প্রস্তুতির সূচি আরও কঠোর করা হবে। দ্রুত পুরোদমে প্র্যাক্টিস শুরু করবেন দুই ব্যাটার। ঋষভ পন্থের ফিটনেস আপডেটও দিয়েছে বোর্ড। ভারতীয় বোর্ড থেকে জানানো হয়েছে, দ্রুত উন্নতি করছেন ঋষভ পন্থ। নেটে ব্যাটিং ও কিপিং - দুইই শুরু করেছেন। তাঁর জন্য বিশেষ ফিটনেস সূচি তৈরি করা হয়েছে। যার মধ্যে রয়েছে স্ট্রেংথ ও ফ্লেক্সিবিলিটি ড্রিল ও দৌড়। সেই সূচি মেনেই চলছে পন্থের মাঠে ফেরার লড়াই। আরও পড়ুন: নেহরার দুধের গ্লাস ফাঁকা করে দিতেন বীরু! ভারতীয় দলের কৃপণতম ক্রিকেটার কে ছিলেন? আপনার পছন্দের খবর আর আপডেট এখন পাবেন আপনার পছন্দের চ্যাটিং প্ল্যাটফর্ম টেলিগ্রামেও। যুক্ত হোন https://t.me/abpanandaofficial","content":"বেঙ্গালুরু: সামনেই এশিয়া কাপ। যে টুর্নামেন্টের দল নির্বাচন হবে দিন কয়েকের মধ্যে। তারপরই ওয়ান ডে বিশ্বকাপ। তার আগে কি সম্পূর্ণ সেরে উঠেছেন কে এল রাহুল (KL Rahul) ও শ্রেয়স আইয়ার (Shreyas Iyer)? বেঙ্গালুরুর জাতীয় ক্রিকেট অ্যাকাডেমি থেকে যে খবর পাওয়া যাচ্ছে, তাতে উচ্ছ্বসিত হতে পারেন ভারতীয় ক্রিকেট ভক্তরা। কারণ, ম্যাচ পরিস্থিতিতে ব্যাটিং শুরু করেছেন দুই তারকা। গোটা দুয়েক প্র্যাক্টিস ম্যাচ খেলবেন তাঁরা। এই সপ্তাহে প্র্যাক্টিস ম্যাচগুলি খেলার কথা রাহুল ও শ্রেয়স আইয়ার ের। সেই ম্যাচদুটি থেকে জাতীয় নির্বাচকদের একটা স্পষ্ট ধারণা হতে পারে ম্যাচ পরিস্থিতিতে দুজনে কেমন পারফর্ম করছেন, কতটা সাড়া দিচ্ছে তাঁদের শরীর। আগামী সপ্তাহে, ২০ অগাস্ট এশিয়া কাপের দল ঘোষণা হওয়ার কথা। তার আগে রাহুল ও শ্রেয়সের শারীরিক অবস্থার আপডেটের দিকে নজর থাকবে জাতীয় নির্বাচকদেরও। শনিবার ওয়েস্ট ইন্ডিজের বিরুদ্ধে পঞ্চম টি-টোয়েন্টি ম্যাচের পর ভারতীয় দলের কোচ রাহুল দ্রাবিড় বলেছিলেন, 'আমাদের কয়েকজন ক্রিকেটার চোট সারিয়ে দলে ফিরছে। আমরা তাদের এশিয়া কাপের দলে সুযোগ দিতে চাই। এখনই এশিয়া কাপের কথা ভাবছি না। ২৩ অগাস্ট থেকে বেঙ্গালুরুতে এক সপ্তাহের প্রস্তুতি শিবির রয়েছে। ওয়ান ডে দল হিসাবে সকলে সেখানে জড়ো হব। তারপর পরিস্থিতি বুঝে এগনো যাবে।' ওয়াকিবহাল মহলের মতে, রাহুল ও আইয়ারের শারীরিক অবস্থার পরিস্থিতি দেখে নেওয়ার জন্য এশিয়া কাপের দল ঘোষণার আগে বাড়তি সময় নিচ্ছে বোর্ড। সেই কারণে দেরিতে হচ্ছে এশিয়া কাপ ের দল নির্বাচন। গত ২১ জুলাই বিবৃতি দিয়ে ভারতীয় ক্রিকেট বোর্ড জানিয়েছিল, রাহুল ও আইয়ার - দুই ব্যাটারই নেটে ব্যাটিং শুরু করেছেন। বোর্ড থেকে বিবৃতি দিয়ে জানানো হয়েছিল, আপাতত দুজনের স্ট্রেংথ ও ফিটনেসের কসরত চলছে। তাঁদের উন্নতি দেখে সন্তোষজনক মনে হয়েছে বিশেষজ্ঞদের। এবার তাঁদের প্রস্তুতির সূচি আরও কঠোর করা হবে। দ্রুত পুরোদমে প্র্যাক্টিস শুরু করবেন দুই ব্যাটার। ঋষভ পন্থের ফিটনেস আপডেটও দিয়েছে বোর্ড। ভারতীয় বোর্ড থেকে জানানো হয়েছে, দ্রুত উন্নতি করছেন ঋষভ পন্থ। নেটে ব্যাটিং ও কিপিং - দুইই শুরু করেছেন। তাঁর জন্য বিশেষ ফিটনেস সূচি তৈরি করা হয়েছে। যার মধ্যে রয়েছে স্ট্রেংথ ও ফ্লেক্সিবিলিটি ড্রিল ও দৌড়। সেই সূচি মেনেই চলছে পন্থের মাঠে ফেরার লড়াই। googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); আরও পড়ুন: নেহরার দুধের গ্লাস ফাঁকা করে দিতেন বীরু! ভারতীয় দলের কৃপণতম ক্রিকেটার কে ছিলেন? আপনার পছন্দের খবর আর আপডেট এখন পাবেন আপনার পছন্দের চ্যাটিং প্ল্যাটফর্ম টেলিগ্রামেও। যুক্ত হোন https://t.me/abpanandaofficial var _fireSc=!0;document.addEventListener(\"scroll\",(e=>{if(_fireSc){var c=document.createElement(\"script\");c.src=\"//asset.fwpub1.com/js/storyblock.js\",c.async=!0,document.getElementsByTagName(\"head\")[0].appendChild(c),_fireSc=!1}}));","pubDate":"2023-08-14 18:04:03","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/08/14/83ead29891490b8e7cffea04bec929c4169203483039050_original.jpg","source_id":"abplive","category":["sports"],"country":["india"],"language":"Bengali"},{"title":"England pacer Steve Finn announces retirement from all forms of cricket after 18 glorious years","link":"https://www.dnaindia.com/cricket/report-england-pacer-steve-finn-announces-retirement-from-all-forms-of-cricket-after-18-glorious-years-3055844","keywords":["Sports","Cricket"],"creator":["DNA  Web Team"],"video_url":null,"description":"The decision comes after a year-long battle with the knee injury, which sidelined him throughout 2023.","content":"England pacer Steven Finn has officially announced his retirement from all forms of cricket. The decision comes after a year-long battle with the knee injury, which sidelined him throughout 2023. Finn, a three-time Ashes series victor, has gracefully chosen to conclude his magnificent 18-year career. The 34-year-old, who has been an integral part of England's cricketing journey, expressed his sentiment regarding this pivotal moment. With his knee injury severely affecting his ability to perform, Finn decided that the time had come to bid farewell to a sport he has passionately embraced since making his debut for Middlesex in 2005. His journey, though marked by challenges, has been a labor of love that has left a mark on the cricketing world. Having graced the field in 126 matches for England, Finn's prolific career has seen him claim an impressive 254 wickets. His exceptional skills have not been limited to international cricket, as he has been an instrumental force for both Sussex and Middlesex in domestic matches. Finn's impact on the cricketing landscape is evident in his achievements. In his 36 Test matches for England, he managed to capture 125 wickets, with a standout performance of 6-79 against Australia during the 2015 Ashes series. Further, extended to white-ball formats as well, where he scalped 129 wickets in 90 matches representing his country. READ | Benzema to Neymar: Full list of superstars joining Cristiano Ronaldo in Saudi league this summer Addressing the media, Finn shared his sentiments, saying,\"I feel incredibly fortunate to have had the privilege of pursuing cricket as my profession ever since my debut for Middlesex in 2005. The journey has been a mix of highs and lows, yet I have cherished every moment.\" He went on to express his gratitude towards Sussex Cricket, particularly for their unwavering support during the past year. Finn acknowledged his affiliation with the club and regretted not being able to contribute more on the field since joining. He spoke fondly of Sussex as a remarkable place to play cricket. In his concluding words, Finn reflected, \"As I retire, I carry with me cherished memories from my time with England, Middlesex, and Sussex, all made special by the incredible individuals I've had the privilege to share them with.\" He expressed his deep appreciation for his followers and supporters, singling out his parents for their unwavering encouragement during his formative years. As his chapter on the field concludes, the cricketing world salutes Finn for his remarkable career and wishes him the best in his future endeavours.","pubDate":"2023-08-14 18:04:00","image_url":null,"source_id":"dnaindia","category":["sports"],"country":["india"],"language":"english"},{"title":"हार्दिक पंड्या से भी गट्सी निकले कुलदीप यादव, दो लाइन में कह दी अपनी पूरी बात","link":"https://navbharattimes.indiatimes.com/sports/cricket/cricket-news/kuldeep-yadav-gutted-more-hardik-pandya-said-his-whole-thing-in-two-lines/articleshow/102731685.cms","keywords":null,"creator":null,"video_url":null,"description":"Kuldeep Yadav: वेस्टइंडीज के खिलाफ टी20 सीरीज में भारतीय टीम को बेशक 3-2 से हार मिली है लेकिन कुछ खिलाड़ियों के लिए यह दौरा काफी शानदार रहा है, जिसमें कुलदीप यादव का नाम भी शामिल है।","content":"वेस्टइंडीज दौरे पर भारतीय क्रिकेट टीम ने जहां टेस्ट सीरीज में जीत के साथ अभियान की शुरुआत की थी तो टी20 सीरीज में उसे हार से संतोष करना पड़ा। पांच टी20 मैचों की सीरीज में भारतीय टीम को 3-2 से हार मिली। चार मैचों तक सीरीज 2-2 की बराबरी पर था लेकिन इसके बाद अंतिम मैच में टीम इंडिया मेजबान वेस्टइंडीज से पिछड़ गई। वेस्टइंडीज के खिलाफ इस टी20 सीरीज में टीम इंडिया के कई खिलाड़ियों ने दमदार खेल का प्रदर्शन किया। इसमें स्पिन गेंदबाज कुलदीप यादव का नाम भी शामिल है। हालांकि उनके दमदार खेल के बावजूद टीम इंडिया सीरीज नहीं जीत पाई लेकिन कुलदीप यादव का हौसला नहीं टूटा है। वह कप्तान हार्दिक पंड्या से भी मजबूत दिखे। कुलदीप ने इस सीरीज के बाद अपने ट्विटर हैंडल पर लिखा, बेशक हम सीरीज के परिणाम से निराश हैं, लेकिन पूरी सीरीज में जिस तरह टीम द्वारा खेल दिखाया गया उस पर मुझे गर्व है। कुछ सीख के साथ फिर वापस आएंगे, मजबूत और बेहतर तरीके से। बता दें कि कुलदीप यादव ने वेस्टइंडीज के खिलाफ कुल 4 टी20 मैचों में मैदान पर उतरे थे, जिसमें उन्होंने 7 विकेट हासिल किए। वापसी के बाद से ही कुलदीप अपने दमदार लय में दिख रहे हैं। ऐसे में उनके लिए वेस्टइंडीज दौरा काफी दमदार माना जा सकता है। वेस्टइंडीज के खिलाफ टीम इंडिया की कप्तानी करने वाले हार्दिक पंड्या भी सीरीज गंवाने से निराश दिखे थे। हालांकि उन्होंने कहा कि कभी-कभी हार से भी बहुत कुछ सीखने को मिलता है, लेकिन उन्हें उम्मीद है टीम इंडिया इस हार से हताश नहीं होगी और मजबूती के साथ वापसी करेगी।","pubDate":"2023-08-14 17:44:31","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"}]}