{"newsArray":[{"title":"Cricket-Australia&#039;s Carey in the pink ahead of home day-night test","link":"https://www.thestar.com.my/sport/cricket/2021/12/12/cricket-australia039s-carey-in-the-pink-ahead-of-home-day-night-test","keywords":null,"creator":null,"video_url":null,"description":"MELBOURNE (Reuters) - The pressure was on Alex Carey to perform behind the stumps in place of Tim Paine during the first Ashes test, and the South Australian more than delivered by taking a record eight catches for a debutant wicketkeeper in Australia's nine-wicket win. Read full story","content":null,"pubDate":"2021-12-12 00:17:00","full_description":"MELBOURNE (Reuters) - The pressure was on Alex Carey to perform behind the stumps in place of Tim Paine during the first Ashes test, and the South Australian more than delivered by taking a record eight catches for a debutant wicketkeeper in Australia's nine-wicket win. Carey will now have the chance to soak up a first test in front of family and friends at Adelaide Oval as Australia look to push for a 2-0 series lead against England at the second day-night clash starting Thursday. \"I'm really excited to now head to Adelaide and know what a pink ball test means,\" the 30-year-old told reporters. \"It's a really good atmosphere in Adelaide ... To have my family there it’s going to be very exciting. \"Obviously winning this test (in Brisbane) puts us in a good place to hopefully start really well on Thursday.\" South Australia has produced some brilliant test cricketers, including Greg Blewett and the Chappell brothers, but the state has contributed few in recent years compared to powerhouse New South Wales and other states. However, Adelaide fans can now cheer on two in-form players in the test team, with middle order batsman Travis Head named Man of the Match at the Gabba on Saturday after his sparkling 152 in the first innings. Long tipped for a glorious international career, Head has taken time to develop and was dropped during the 2-1 series defeat by India over the last home summer. His recall to the Ashes squad and selection ahead of the more experienced Usman Khawaja polarised former players and pundits but the 27-year-old repaid selectors' faith with interest at the Gabba. Carey said his state team mate was maturing as a player and a person. \"I think for Trav, it’s (about) not worrying about the external noise,\" said Carey. \"He’s really excited to get home and put on a good performance for his home crowd. If we see innings like that over the next 12 to 18 months, he’s going to be one of the best players in the world.\" (Reporting by Ian Ransom; Editing by Christian Radnedge)","image_url":"https://apicms.thestar.com.my/uploads/images/2021/12/12/1403051.jpg","source_id":"thestar_my"},{"title":"Amitabh Bachchan to represent 'Legends Cricket League'","link":"https://www.thehansindia.com/sports/cricket/amitabh-bachchan-to-represent-legends-cricket-league-719328","keywords":["Sports,Today NewsPaper,Cricket"],"creator":["N Lothungbeni Humtsoe"],"video_url":null,"description":"I have had the opportunity to play cricket in my younger days- Amitabh","content":"AmitabhAmitabhThe Legends Cricket League, a professional cricket league for retired international cricketers, has named Amitabh Bachchan as its League Ambassador. \"I am absolutely looking forward to the Legends League Cricket celebrating the Legends of Cricket from all across the world, bringing back the old rivalries for us to relive the nostalgia. It is a great opportunity for all cricket fans to get an opportunity to see them play live again,\" Amitabh Bachchan stated. \"I have had the opportunity to play cricket in my younger days and then also commentate with some of the greats of the game but now to become the face of such a wonderful initiative is an incredible feeling. To have these Legends of the game who have given such beautiful moments of happiness and pride always, back on the field again is exhilarating. Legends League Cricket will definitely present itself as an excellent opportunity for the Legends and their ardent fans like me to connect again,\" Amitabh Bachchan added. Raman Raheja, CEO of Legends League Cricket said \"We are honored to have Amitabh Bachchan with us. When it comes to the Legends space, you cannot think of a larger and more appropriate name to be your ambassador. Bachchan is a global icon and revered by all. He is also a big sports buff and elevates the stature of our League to gigantic proportions.\" Cricket fans all across the world will get to see the Legends of Cricket sweat it out at their competitive best in January 2022 at the Al Amerat Cricket Stadium in Oman between 3 power packed teams representing India, Asia and Rest of the World.","pubDate":"2021-12-11 20:21:08","full_description":"Amitabh The Legends Cricket League, a professional cricket league for retired international cricketers, has named Amitabh Bachchan as its League Ambassador. \"I am absolutely looking forward to the Legends League Cricket celebrating the Legends of Cricket from all across the world, bringing back the old rivalries for us to relive the nostalgia. It is a great opportunity for all cricket fans to get an opportunity to see them play live again,\" Amitabh Bachchan stated. \"I have had the opportunity to play cricket in my younger days and then also commentate with some of the greats of the game but now to become the face of such a wonderful initiative is an incredible feeling. To have these Legends of the game who have given such beautiful moments of happiness and pride always, back on the field again is exhilarating. Legends League Cricket will definitely present itself as an excellent opportunity for the Legends and their ardent fans like me to connect again,\" Amitabh Bachchan added. Raman Raheja, CEO of Legends League Cricket said \"We are honored to have Amitabh Bachchan with us. When it comes to the Legends space, you cannot think of a larger and more appropriate name to be your ambassador. Bachchan is a global icon and revered by all. He is also a big sports buff and elevates the stature of our League to gigantic proportions.\" Cricket fans all across the world will get to see the Legends of Cricket sweat it out at their competitive best in January 2022 at the Al Amerat Cricket Stadium in Oman between 3 power packed teams representing India, Asia and Rest of the World.","image_url":"https://assets.thehansindia.com/h-upload/2021/12/11/500x300_1131169-amitabh.jpg","source_id":"thehansindia"},{"title":"‘Tick, tick, tick’: Greats back Green as the gun Australia has needed for years","link":"https://www.foxsports.com.au/cricket/the-ashes/tick-tick-tick-greats-back-green-as-the-gun-australia-has-needed-for-years/news-story/86553c5989923c38112ea07cb8e14f89","keywords":null,"creator":null,"video_url":null,"description":"Cricket greats Brett Lee and Mark Waugh have declared Cameron Green Australia’s permanent No. 6, despite the recent efforts of Mitch Marsh.","content":null,"pubDate":"2021-12-11 19:00:00","full_description":"Cricket greats Brett Lee and Mark Waugh have declared Cameron Green Australia’s permanent No. 6, despite the recent efforts of Mitch Marsh. Green went for a golden duck after leaving his first ball and letting it crash into off stump in the Ashes series opener at the Gabba. But the 22-year-old bowled well in Australia’s nine-wicket victory and will hold his spot for the Adelaide Test, which starts on Wednesday. Sport’s greatest rivalry is just around the corner and you can catch the Ashes live and ad-break free during play. New to Kayo? Start your free trial today > Green was picked in the Ashes squad ahead of fellow all-rounder Marsh, who starred as Australia won the T20 World Cup last month. Marsh exploded again for Australia A batting at No. 6 against the England Lions on Saturday. After making 33 runs in the first innings, he slogged his way to 50 from 20 balls and finmished unbeaten on 60. He took 1-37 from 11 overs in the three-day match. Green went wicketless in his maiden Test series against India last summer after he was restricted to five-over spells in order to manage an existing back injury. But he bowled 15 overs in Brisbane, taking three wickets at a very tidy 9.6 - and Lee said Green’s game will only get better. “He’s 22 years of age and you’re nowhere near your peak at 22, that’s the thing, he’s got so much more left in the tank,” Lee said on Fox Cricket’s day four wrap show. Cameron Green of Australia celebrates taking the wicket of Chris Woakes. Source: AFP “As his body finishes growing and when he understands his body and how much more he can get out of it, the follow through, he can get another 5-10kph easily. “I reckon he can bowl high 140s, he’s got good height, beautiful seam position, shapes the ball away, looks like a terrific guy, he’s good in the gully region, he bats well. Tick, tick, tick. “Australia have finally found that guy that can come in and do that job.” MORE CRICKET NEWS INJURY CONCERNS: ‘We’ll take our time’: Star Aussie quick in doubt for pink ball Test as bowl off looms TAP ON THE SHOULDER: ‘It’s your turn’: Hidden Smith moment proves Aussies made right captaincy call GABBA MASSACRE: Aussies win first Test as ANOTHER batting collapse compounds Poms’ ‘humiliation’ AUS PLAYER RATINGS: Ashes perfection and a debut dream — but two big fails an Aussie concern ENG PLAYER RATINGS: A whopping FIVE fails — including opener’s shocker in Ashes flop UK VIEW: ‘Horrible loss’: England scorches its woeful side as Joe Root’s legacy questioned Waugh believes Green wasn’t bowled enough in the second innings by Pat Cummins, who was captaining Australia for the first time. “I thought even yesterday he was underbowled, he bowled seven overs... and actually looked the most dangerous,” Waugh said. “He got good zip off the pitch, presents a good seam. “He’s like a big puppy dog at the moment, when he turns into a full-grown male dog he’ll just get a bit more oomph in him, he could be a handful.” Australia's Cameron Green. Source: AFP However, Waugh does hold some concerns for Green’s batting technique. “I’m slightly worried about his batting, he’s just got that sign of being a bit worried about getting that front foot too across,” Waugh said. “That means he doesn’t get far enough across and he just lets the ball go like that and it just clips the off stump. “He’s got some work to do but he’s talented, he’s a genuine all-rounder.” MORE CRICKET NEWS ‘I KNEW IT WAS SANDPAPER’: Aussie star falls victim to hilarious Barmy Army prank ‘SEEING THEM LIKE FOOTBALLS’: Waugh lauds Carey’s record breaking debut as ‘one of the best’ ever GOAT: A groundsman plucked from obscurity, Lyon’s 400 proves a GOAT can be found in anyone ‘IT’S PRETTY OBVIOUS’: Lyon denied 400th wicket as Aussies count cost of ‘huge miss’ ‘IT’S HAPPENED AGAIN’: Australia’s fatal flaw exposed as ‘pressure mounts’ on Lyon UK VIEW: ‘It wasn’t in the script’ and Aussies ‘have cracked’. But ‘vital’ turning point still to come ‘COULD GET NASTY’: Aussies rocked by Root counter as Lyon ‘milked’ in 325-day pain","image_url":null,"source_id":"foxsports"},{"title":"Cricket-Ponting warns of Ashes whitewash after England collapse","link":"https://www.thestar.com.my/sport/cricket/2021/12/12/cricket-ponting-warns-of-ashes-whitewash-after-england-collapse","keywords":null,"creator":null,"video_url":null,"description":"(Reuters) - England's Ashes tour could end in a whitewash if they cannot bounce back from their crushing loss in the first test, former Australia captain Ricky Ponting said on Saturday, adding that the conditions going forward would be better suited to the hosts. Read full story","content":null,"pubDate":"2021-12-11 18:07:00","full_description":"(Reuters) - England's Ashes tour could end in a whitewash if they cannot bounce back from their crushing loss in the first test, former Australia captain Ricky Ponting said on Saturday, adding that the conditions going forward would be better suited to the hosts. Australia are 1-0 up in the series after an emphatic nine-wicket victory at the Gabba in Brisbane, where England lost eight wickets in a stunning batting collapse on day four. England have not won a test in Australia since the 2010-11 series, when they triumphed 3-1. The pink ball test in Adelaide begins on Thursday and Ponting believes a similar outcome to Australia's 5-0 victory in 2006-07 could be on the cards after England failed to take advantage of favourable conditions. \"The conditions are only going to get better for Australia. Those conditions (in Brisbane) were very English-like... They're probably not going to get that much movement anywhere else for the entire series,\" Ponting told cricket.com.au. \"We saw them bowl really well on the last tour in Adelaide under lights where everything just fell perfectly into place -- Australia had to bat for a session, the lights were on, brand new ball, clear night. \"We've also been to Adelaide at other times when the pink ball has done nothing, whether it's a new ball or not. If they don't win in Adelaide then there could be shades of '06-'07.\" Ponting criticised England's decision to rest both James Anderson and Stuart Broad -- who have taken 1,156 test wickets between them -- saying the visitors had got their selection wrong. Ben Stokes's fitness will also be a concern for England ahead of the Adelaide test after the all-rounder struggled with a knee injury in Brisbane. \"I can't see why they would have left (Broad and Anderson) out if they weren't just getting them prepped and ready for Adelaide. I'm still staggered to this point now... One of those two had to play,\" Ponting said. \"It might be that they're only going to play one of Broad or Anderson in Adelaide. A lot of it might just depend on how (Ben) Stokes pulls up between now and the start of the Adelaide game.\" (Reporting by Hritika Sharma in Bengaluru; editing by Clare Fallon)","image_url":"https://apicms.thestar.com.my/uploads/images/2021/12/12/1403004.jpg","source_id":"thestar_my"},{"title":"Ashes 2021 stats: Records galore as Australia beat England in first Ashes 2021-22 Test at The Gabba in Brisbane","link":"https://thesportsrush.com/cricket-news-ashes-2021-stats-records-galore-as-australia-beat-england-in-first-ashes-2021-22-test-at-the-gabba-in-brisbane/","keywords":["Cricket"],"creator":["Kuldeep Chavan"],"video_url":null,"description":"Ashes 2021 stats: The SportsRush presents before you the list of records created by Australia and England after 1st Ashes Test at The Gabba. Australia handed England a heavy drubbing by 9 wickets to prevail in the first Ashes Test 2021-22 at The Gabba, Brisbane. Having shown quite some promise by staging a stellar comeback… The post Ashes 2021 stats: Records galore as Australia beat England in first Ashes 2021-22 Test at The Gabba in Brisbane appeared first on The SportsRush.","content":"Ashes 2021 stats: The SportsRush presents before you the list of records created by Australia and England after 1st Ashes Test at The Gabba. Australia handed England a heavy drubbing by 9 wickets to prevail in the first Ashes Test 2021-22 at The Gabba, Brisbane. Having shown quite some promise by staging a stellar comeback on Day 3 after being humbled by Australia on the first two days, England lost it all pretty soon on Day 4, managing to add mere 77 runs while losing all their 8 remaining wickets, to hand a mere 20-run target before the Aussie batting line up. It cost Australia a wicket and 5.1 Overs to chase down the paltry target and thereby maintain their unbeaten winning streak against England at The Gabba in Ashes history. ALSO READ: Why England lost 5 World Test Championship points after loss versus Australia in Gabba Test? Trailing by just 58 runs on the back of a 159-run unbeaten partnership between Joe Root and David Malan at the end of Day 3, the former missed out on his maiden century on Australian soil, while Nathan Lyon got to his 400 Test wickets after what might have felt to him like a wait for eternity. Ashes 2021 stats: The Gabba Test witnessed plentiful records being created and broken Let’s have a look at the number of records created and broken by the Aussies and the English Cricketers after the end of first Test match at The Gabba in Brisbane. 1-Alex Carey became the first player to take 8 or more catches on their Test debut. 1-Joe Root (1544) overtook Michael Vaughan (1481) and now has the most Test runs for England in a calendar year. 8-Joe Root scored 4770 runs as Test captain, which is the eighth highest in the world. He surpassed Brian Lara (4685) during his knock of 89 runs against Australia. 1-Pat Cummins became the first player to take a five-wicket haul on the first day of a first-class captaincy career in a Test match. 50- Josh Hazlewood picked his 50th wicket in WTC during Day One of the recently concluded Test matches against England. He is the tenth bowler in the world to complete this milestone. 1-Joe Root recorded the highest number of Test half-centuries (16) in ICC World Test Championship by surpassing Marnus Labuschagne who smashed 15 half-centuries in WTC. 400- Nathan Lyon completed 400 Test wickets by bagging the wicket of Dawid Malan in the second innings of the Brisbane test match. 3-Nathan Lyon became the only third Australian bowler to reach 400 wickets in Test cricket. 2-Nathan Lyon became only second non-Asian spinner to reach 400 wickets in Test cricket after Shane Warne(708).   The post Ashes 2021 stats: Records galore as Australia beat England in first Ashes 2021-22 Test at The Gabba in Brisbane appeared first on The SportsRush.","pubDate":"2021-12-11 17:57:43","full_description":null,"image_url":null,"source_id":"thesportsrush"},{"title":"Mihir Patel to captain Canada cricket team at the ICC 2022 Men’s U-19 World Cup","link":"https://www.thestar.com/sports/cricket/2021/12/11/mihir-patel-to-captain-canada-cricket-team-at-the-icc-2022-mens-u-19-world-cup.html","keywords":null,"creator":["The Canadian Press"],"video_url":null,"description":null,"content":null,"pubDate":"2021-12-11 17:35:22","full_description":"TORONTO - Mihir Patel will captain the Canadian cricket team at the ICC 2022 Men’s U-19 World Cup next month in the Caribbean. The 19-year-old from Toronto has experience at the competition, scoring a notable 90 off 105 balls in a loss to the United Arab Emirates at the 2020 Under-19 World Cup where the young Canadians finished 13th. Sixteen teams will take part in the tournament that runs Jan. 14 to Feb. 5 across four Caribbean countries. Canada will play out of Group A with defending champion Bangladesh, England and the United Arab Emirates. Group B features India, Ireland, South Africa and Uganda while Group C comprises Afghanistan, Pakistan, Papua New Guinea and Zimbabwe. Group D is made up of Australia, Scotland, Sri Lanka and host West Indies. The top two from each of the four groups advance to the Super League with the remaining teams moving on to the Plate playoffs. Canada will open Jan. 15 against the United Arab Emirates in St. Kitts before taking on England on Jan. 18, and Bangladesh on Jan. 20. --- Canada Under-19 Cricket Team Mihir Patel, (capt.), Sahil Badin, Anoop Chima, Ethan Gibson, Parmveer Kharoud, Siddh Ladd, Yasir Mahmood, Sheel Patel, Gavin Niblock, Mohit Prashar, Harjap Saini, Jash Shah, Kairav Sharma, Gurnek Johal Singh, Arjuna Sukhu. Reserves: Yash Mondkar, Ramanvir Dhaliwal, Ashir Zamir, Eran Maliduwapathirana, Ayush Singh. Manager: Anil Khanna. Head coach: Farouk Kirmani. Assistant coach: Surrendra Seeraj. --- This report by The Canadian Press was first published Dec. 11, 2021. Anyone can read Conversations, but to contribute, you should be registered Torstar account holder. If you do not yet have a Torstar account, you can create one now (it is free) Sign In Register","image_url":null,"source_id":"thestar"},{"title":"“Virat’s phone is switched off”: Virat Kohli’s childhood coach Rajkumar Sharma expresses disappointment on BCCI for sacking Kohli as Team India ODI captain","link":"https://thesportsrush.com/virats-phone-is-switched-off-virat-kohlis-childhood-coach-rajkujmar-sharma-expresses-disappointment-on-bcci-for-sacking-kohli-as-team-india-odi-captain/","keywords":["Cricket","BCCI","Rajkumar Sharma","Team India","Virat Kohli"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Virat Kohli’s childhood coach Rajkumar Sharma expresses disappointment on BCCI, selectors post former’s sacking as Team India ODI captain. Ever since Virat Kohli’s alleged sacking by the BCCI as captain of the ODI format, a huge section of fans have criticized the richest Cricket board for the unfair and harsh treatment it has meted out… The post “Virat’s phone is switched off”: Virat Kohli’s childhood coach Rajkumar Sharma expresses disappointment on BCCI for sacking Kohli as Team India ODI captain appeared first on The SportsRush.","content":"Virat Kohli’s childhood coach Rajkumar Sharma expresses disappointment on BCCI, selectors post former’s sacking as Team India ODI captain. Ever since Virat Kohli’s alleged sacking by the BCCI as captain of the ODI format, a huge section of fans have criticized the richest Cricket board for the unfair and harsh treatment it has meted out to it’s most successful limited Overs skipper till date. While Rohit Sharma’s appointment as his new replacement has been welcomed by a significant section of fans as well, the manner of Kohli’s removal from the post without a valid explanation until some 24 hours of the decision says a lot about the consistency BCCI have been continuously exhibiting in terms of transparency before its biggest stakeholders- the fans. Although, BCCI president Sourav Ganguly did come up with an explanation, Virat Kohli is yet to react on the same which raises doubts whether both the parties are on the same page with the decision taken. Kohli’s childhood coach, Rajkumar Sharma, however has expressed his disappointment and surprise at BCCI for the sudden decision on such an imperative talking point. Virat Kohli’s childhood coach Rajkumar Sharma expresses disappointment on BCCI Rajkumar Sharma insisted that the selectors should’ve been clearer with Kohli on their stand when he stepped down from T20I captaincy. “I haven’t talked to him (Virat Kohli) yet. His phone is switched off for some reason. But as far as my opinion is concerned, he had specifically stepped down from T20 captaincy and the selectors should’ve straightaway asked him to step down from both the white-ball formats, or not step down at all,” Sharma said, while speaking on the Khelneeti podcast. Sharma further expressed surprise at Sourav Ganguly’s recent comments on the change in captaincy. The BCCI President had said that the board had requested Kohli “not to step down as T20I skipper.” “I read Sourav Ganguly’s comments recently that they had asked Kohli to not step down from T20I captaincy (before the World Cup). I don’t recall anything like that. This statement came as a surprise to me. There are different statements circulating around,” Sharma said. Not here to comment on whether or not it was the right decision. How good or bad a captain Kohli was has no relevance here. It’s about a cricket board casually replacing a captain of nearly 5 years with a one-liner at the end of an email. How shitty is that? #bcci #ViratKohli — Rohit Sankar (@imRohit_SN) December 8, 2021 It is worth mentioning that Virat had stepped down as team India’s skipper in the T20 format just before the team was about to begin their 2021 T20 World Cup campaign, and after yet another failure to win an IPL title for his franchise Royal Challengers Bangalore (RCB). Kohli had cited ‘workload management’ as one of the important reasons for him arriving at the decision, and had explicitly mentioned that he would continue leading the side in the ODI and the Test format. “The selection committee doesn’t provide a reason behind the decision. We don’t know what the management or the BCCI or the selectors want. There’s no clarification, no transparency at all. It’s a pity how this has happened. He has been such a successful one-day captain,” Rajkumar Sharma further remarked.     The post “Virat’s phone is switched off”: Virat Kohli’s childhood coach Rajkumar Sharma expresses disappointment on BCCI for sacking Kohli as Team India ODI captain appeared first on The SportsRush.","pubDate":"2021-12-11 17:16:50","full_description":null,"image_url":null,"source_id":"thesportsrush"},{"title":"Cricket-&#039;Can&#039;t just be Root&#039;: Former England captains urge batsmen to step up","link":"https://www.thestar.com.my/sport/cricket/2021/12/11/cricket-039can039t-just-be-root039-former-england-captains-urge-batsmen-to-step-up","keywords":null,"creator":null,"video_url":null,"description":"(Reuters) - England's batsmen must step up and come to the aid of skipper Joe Root who has constantly been fighting a lone battle to rescue the side after numerous batting collapses in recent years, former captains said on Saturday. Read full story","content":null,"pubDate":"2021-12-11 15:27:00","full_description":"(Reuters) - England's batsmen must step up and come to the aid of skipper Joe Root who has constantly been fighting a lone battle to rescue the side after numerous batting collapses in recent years, former captains said on Saturday. England lost the first Ashes test at the Gabba following a spectacular batting collapse where the tourists lost eight wickets in the first session, allowing Australia to go 1-0 up with an emphatic nine-wicket victory. \"For a long time now, England have found themselves 20-3, 30-3, 40-4. They were 29-4 in the first innings of this test and went on to be bowled out for 147,\" Nasser Hussain wrote in his Sky Sports column. \"Root has been their star player for a number of years and is the only one this year who averages over 40 in test cricket. Root and (Dawid) Malan are the only ones averaging over 30, Root and Rory Burns are the only ones with test hundreds. \"I'm afraid that's just not good enough, that is not going to win you that many test matches. It can't just be Root.\" Root had surpassed Michael Vaughan for the most test runs in a calendar year for England on Friday and even the former captain was critical of the way England collapsed. \"Problem for England is when they have a bad session, they have test match losing sessions with the bat. It's been happening for too long against the better teams,\" Vaughan wrote on Twitter. Michael Atherton, who led England in 54 tests, said although Root's decision to bat first at the \"Gabbatoir\" was a mistake, the manner of their dismissals were also a concern. \"Batting badly was a more costly mistake. Time and again, England's batting line-up underwhelms and Root himself can only carry so much weight,\" Atherton wrote in The Times. \"The first innings total was a hundred runs below par; with a competitive total it was possible to see a route to success batting first. Poor batting and missed chances resulted in a deficit too challenging to overcome.\" (Reporting by Rohith Nair in Bengaluru; editing by David Evans)","image_url":"https://apicms.thestar.com.my/uploads/images/2021/12/11/1402762.jpg","source_id":"thestar_my"},{"title":"‘Robbed’: Captain exposes Big Bash problem","link":"https://www.news.com.au/sport/cricket/big-bash/robbed-sydney-sixers-captain-moises-henriques-vents-frustration-with-big-bash-rule-changes/news-story/89655ccaad8b0a6b8750360b938715ae","keywords":null,"creator":null,"video_url":null,"description":"Twelve months after Cricket Australia introduced a trio of radical rule changes for the Big Bash League, it’s clear there are still some teething problems.","content":null,"pubDate":"2021-12-11 13:45:00","full_description":"Twelve months after Cricket Australia introduced a trio of radical rule changes for the Big Bash League, it’s clear there are still some teething problems. The Bash Boost, Power Surge and X-Factor returned for the eleventh edition of the T20 tournament this season – despite some pundits questioning their value in the competition. And during Saturday evening’s contest between the Sydney Sixers and Hobart Hurricanes at the SCG, a couple of minor flaws emerged. Watch every game of the KFC Big Bash League Live & On-Demand on Kayo or catch up for FREE with minis on Kayo Freebies. Join Kayo Now > The Sixers run chase was interrupted in the fifth over by a brief rain delay, and following a Duckworth-Lewis calculation, the innings was reduced by two overs and 18 runs were taken off the target. However, the Sixers’ Power Surge was cut in half – the men in pink were only allocated six deliveries to take advantage of the fielding restrictions, when the Hurricanes got a whole two overs during their innings. Just catching up on the #BBL11 The Sixers have lost an over in their innings because of a rain delay, but the one over they've taken is one of their Power Surge overs. That's doesn't seem right, they've lost an extra six balls with only two fielders out? “Duckworth-Lewis wasn’t exactly kind to us,” Sixers captain Moises Henriques told News Corp reporters after the match. “The Surge has completely changed the game. Last year, we saw how much it pumped the average score up. “When the opposition team gets to use their full Surge and you don’t get to use yours, you do feel a little bit robbed. But I guess if we got two Surge overs … they’d probably feel like they were robbed a little bit as well. “I still don’t see why you can’t have an over and then four balls in the next over that are under Surge rules, and just play two balls that aren’t. It would make more sense, and I think it would be more fair for all the teams. “But they’re the rules, and we’ve got to play by them, and we’ve got to find a way to adapt and still win those game.” During Saturday’s run chase, it was also revealed that the Bash Boost had been scrapped because of the 10-minute rain delay. Instead, the victorious side would be awarded four points on the BBL ladder regardless of their score at the 10-over mark. Henriques claimed the Sixers were not informed of the Bash Boost change until the seventh over of the run chase. “We didn’t get any sort of communication,” he explained. “I think some communication before we walk back out onto the field would be nice. “With these new rule changes, there’s a little bit of a trial period, and I guess we’ve just got to go with the flow.” Meanwhile, the reigning champions have rarely used the X-Factor since its introduction, preferring to stick with its starting XI for the game’s entirety. Henriques said it was “difficult” to envision a situation in which the Sixers would need to substitute someone for an X-Factor player. “We have a lot of fantastic cricketers sitting on the sideline unfortunately not getting an opportunity because of the strength of this side,” the 34-year-old said. “Having said that, when we walk out onto the field with the 11 guys that we have, it’s quite difficult to ask one of them to sit down, because from a captain’s point of view, I have the full belief in every single person that walks onto the field. “It’s really hard to try and take someone out of the game … it’s quite difficult for us to use that.” The Hurricanes secured a comfortable 44-run victory over the Sixers in front of 11,070 spectators in the New South Wales capital. Hurricanes skipper Matthew Wade continued his impressive form in the game’s shortest format, cracking 94 off 46 balls in the first innings while opener partner D’Arcy Short smacked an unbeaten 73 off 51 deliveries. In response, Sixers wicketkeeper Josh Philippe top-scored with 72 off 46 balls before Hurricanes seamer Joel Paris ended his knock in the 14th over. Paris finished with figures of 3/35 from four overs, having also dismissed England international James Vince and veteran all-rounder Dan Christian. “We actually thought at the halfway-mark that if we batted well, we could still get it,” Henriques said after the defeat. “They were too good tonight. I thought they defended really well with the ball – they were quite clinical there.” The Sixers will next face the Melbourne Stars at the MCG on Wednesday evening, with the first ball scheduled for 7.15pm AEDT. There’s an unexpected reason that Brisbane Heat young gun Xavier Bartlett has batted well so far in BBL|11. Young Aussie leg-spinner Tanveer Sangha has had an incredible year by anyone’s standards but it’s not over yet. Daniel Sams flew through the air to take a spectacular catch in the Big Bash tonight. When he got up to celebrate, he realised it wouldn’t count.","image_url":null,"source_id":"news"},{"title":"‘Robbed’: Captain exposes Big Bash problem","link":"https://www.cairnspost.com.au/sport/cricket/big-bash/robbed-sydney-sixers-captain-moises-henriques-vents-frustration-with-big-bash-rule-changes/news-story/89655ccaad8b0a6b8750360b938715ae","keywords":["Big Bash News","Cricket news and galleries","Kayo","Sport news and galleries"],"creator":null,"video_url":null,"description":"Twelve months after Cricket Australia introduced a trio of radical rule changes for the Big Bash League, it’s clear there are still some teething problems.","content":null,"pubDate":"2021-12-11 13:45:00","full_description":null,"image_url":null,"source_id":"cairnspost"},{"title":"Hits & Misses: Colin Munro stars for Perth Scorchers, amid bizarre empty stadium setting post-midnight","link":"https://thewest.com.au/sport/perth-scorchers/hits-misses-colin-munro-stars-for-perth-scorchers-amid-bizarre-empty-stadium-setting-post-midnight-c-4909255","keywords":null,"creator":["Chris Robinson"],"video_url":null,"description":"Colin Munro rode his luck to go LARGE, Rashid Khan’s magic fingers let him down, and we saw plenty of fireworks as the Scorchers won the latest-ever finish to a cricket match in Australia.","content":null,"pubDate":"2021-12-11 13:33:46","full_description":null,"image_url":"https://images.thewest.com.au/publication/C-4909255/f0a1ae32ab7d578660dd81f6a0b5a214df3b8622-16x9-x1y0w2446h1376.jpg","source_id":"thewest"},{"title":"ICC World Test Championship Standings After Australia's Win Over England In 1st Ashes Test - NDTVSports.com","link":"https://news.google.com/__i/rss/rd/articles/CBMiiwFodHRwczovL3Nwb3J0cy5uZHR2LmNvbS90aGUtYXNoZXMtMjAyMS0yMi9pY2Mtd29ybGQtdGVzdC1jaGFtcGlvbnNoaXAtc3RhbmRpbmdzLWFmdGVyLWF1c3RyYWxpYXMtd2luLW92ZXItZW5nbGFuZC1pbi0xc3QtYXNoZXMtdGVzdC0yNjQ2NzAz0gGRAWh0dHBzOi8vc3BvcnRzLm5kdHYuY29tL3RoZS1hc2hlcy0yMDIxLTIyL2ljYy13b3JsZC10ZXN0LWNoYW1waW9uc2hpcC1zdGFuZGluZ3MtYWZ0ZXItYXVzdHJhbGlhcy13aW4tb3Zlci1lbmdsYW5kLWluLTFzdC1hc2hlcy10ZXN0LTI2NDY3MDMvYW1wLzE?oc=5","keywords":null,"creator":null,"video_url":null,"description":"ICC World Test Championship Standings After Australia's Win Over England In 1st Ashes Test  NDTVSports.comEngland collapse as ruthless Aussies claim first Test | Men's Ashes 2021-22  Updated World Test Championship Points Table After Australia vs England 1st Test  Cricket AddictorThe best of Nathan Lyon: Galle debut, Bengaluru eight-for, Adelaide game-changer, and more  ESPNcricinfoAustralia Beats England In First Ashes Test | 10 News First  10 News FirstView Full coverage on Google News","content":null,"pubDate":"2021-12-11 11:24:21","image_url":null,"source_id":"google"},{"title":"ICC World Test Championship Standings After Australia's Win Over England In 1st Ashes Test - NDTV Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMiiwFodHRwczovL3Nwb3J0cy5uZHR2LmNvbS90aGUtYXNoZXMtMjAyMS0yMi9pY2Mtd29ybGQtdGVzdC1jaGFtcGlvbnNoaXAtc3RhbmRpbmdzLWFmdGVyLWF1c3RyYWxpYXMtd2luLW92ZXItZW5nbGFuZC1pbi0xc3QtYXNoZXMtdGVzdC0yNjQ2NzAz0gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"ICC World Test Championship Standings After Australia's Win Over England In 1st Ashes Test  NDTV SportsEngland collapse as ruthless Aussies claim first Test | Men's Ashes 2021-22  Lyon leads Australia's march to 1-0 lead in The Ashes | Cricbuzz.com - Cricbuzz  CricbuzzStats - Nathan Lyon, the second non-Asian spinner with 400 Test wickets  ESPNcricinfoNathan Lyon's 400th Test Wicket As Called By Triple M | Triple M Cricket  Triple MView Full coverage on Google News","content":null,"pubDate":"2021-12-11 11:24:21","image_url":null,"source_id":"google"},{"title":"Matthew Wade posts top score of BBL season so far as Hurricanes beat Sixers - Wide World of Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMipQFodHRwczovL3d3b3MubmluZS5jb20uYXUvY3JpY2tldC9iYmwtMjAyMS1tYXR0aGV3LXdhZGUtYmxhc3RzLXRvcC1zY29yZS1vZi1zZWFzb24tc28tZmFyLWFzLWhvYmFydC1odXJyaWNhbmVzLWJlYXQtc3lkbmV5LXNpeGVycy9iOTBmOTc1NC1iZGQzLTQ2NTAtYTg5Zi0zODZjZjNkMDk1MzHSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Matthew Wade posts top score of BBL season so far as Hurricanes beat Sixers  Wide World of Sports‘Robbed’: Sydney Sixers captain Moises Henriques vents frustration with Big Bash rule changes  NEWS.com.au‘Unbeatable’ Wade lifts Hurricanes to BBL boilover against reigning champs  Fox SportsWade runs riot as Hurricanes crush Sixers | cricket.com.au  cricket.com.auWade stars as Hurricanes crush BBL Sixers  7NEWSView Full coverage on Google News","content":null,"pubDate":"2021-12-11 11:06:44","image_url":null,"source_id":"google"},{"title":"Nagaon, Dhemaji, Hailakandi, President XI win","link":"https://www.sentinelassam.com/north-east-india-news/local-sports/nagaon-dhemaji-hailakandi-president-xi-win-567372","keywords":["Sports,Local Sports"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"Nagaon beat Karimganj by 98 runs in a group league match in the RG Baruah Cricket at the ACA Stadium, Barsapara in the city today. Opener of Nagaon Pranjit Borah (130) scored century in the game.","content":"Our Sports ReporterGUWAHATI: Nagaon beat Karimganj by 98 runs in a group league match in the RG Baruah Cricket at the ACA Stadium, Barsapara in the city today. Opener of Nagaon Pranjit Borah (130) scored century in the game. Dhemaji in another game of the day at ACA Stadium, Barsapara beat NFRSA by 5 wickets. Hailakandi registered 56 runs victory over Sivasagar. The game was held at the Nehru Stadium. At the Amingaon Cricket ground, President XI thrashed Tinsukia by 8 wickets.Also Read: Simone Biles is Time's 'Athlete of the Year'Also Watch:","pubDate":"2021-12-11 11:05:59","full_description":"Our Sports Reporter GUWAHATI: Nagaon beat Karimganj by 98 runs in a group league match in the RG Baruah Cricket at the ACA Stadium, Barsapara in the city today. Opener of Nagaon Pranjit Borah (130) scored century in the game. Dhemaji in another game of the day at ACA Stadium, Barsapara beat NFRSA by 5 wickets. Hailakandi registered 56 runs victory over Sivasagar. The game was held at the Nehru Stadium. At the Amingaon Cricket ground, President XI thrashed Tinsukia by 8 wickets. Also Read: Simone Biles is Time's 'Athlete of the Year' Also Watch:","image_url":"https://assets.sentinelassam.com/h-upload/2021/12/11/281020-cricket-bat-ball-shut.jpg","source_id":"sentinel"},{"title":"ICC still not losing hope of featuring cricket in 2028 Olympics as additional sport","link":"https://www.indiatoday.in/sports/cricket/story/icc-still-not-losing-hope-of-featuring-cricket-in-2028-olympics-as-additional-sport-1886720-2021-12-11?utm_source=rss","keywords":null,"creator":null,"video_url":null,"description":"ICC still not losing hope of featuring cricket at 2028 Los Angeles Olympics","content":null,"pubDate":"2021-12-11 10:38:16","full_description":"The ICC is not losing hope of cricket being among \"additional sports\" to be played at the 2028 Los Angeles Games after the International Olympic Committee (IOC) started the process of identifying the core sports for the grand sporting spectacle. The IOC on Thursday named 28 sports in the \"initial programme\" for the 2028 Olympics with skateboarding, surfing and sport climbing finding places in them. Boxing, weightlifting and modern pentathlon were excluded and the respective international federations have been given time until 2023 to meet certain criteria to secure their spot at the 2028 Games. The list would be put to vote in the IOC Session in Beijing in February next year for approval, which is likely to be a formality. Host City Los Angeles can also propose additional sports in 2023 to be included in the 2028 Games and the ICC is hoping that cricket is among sports to get the nod of the IOC. Baseball, softball and a version of American football could be in the running to bid for additional sports in the 2028 Olympics. \"The process to pick additional sports by the host city starts next year (2023) and we are hoping cricket to be a part of that,\" an ICC Board member, who is privy to the process, told PTI on conditions of anonymity. \"We know it will be tough (for cricket to be included as an additional sport). There are no guarantees and we are up against some other great sports to try and get a spot in the 2028 LA Games.\" In August, the ICC had expressed its intention to bid for cricket's inclusion in the 2028 Los Angeles Olympics, which also had backing from the world's richest board BCCI. The ICC has also formed an Olympic Working Group which will work on making the game part of the Olympics starting from 2028. \"Our sport is united behind this bid, and we see the Olympics as a part of cricket's long-term future. We have more than a billion fans globally and almost 90 percent of them want to see cricket at the Olympics,\" ICC chairman Greg Barclay had said then. In 2024, the IOC will decide on the additional sports proposed by the LA Games organisers. Following Tokyo and Paris (2024), Los Angeles Olympics will be the third host which will propose additional sports in its programme. Six new sports -- baseball, softball, karate, skateboarding, sport climbing, and surfing -- were featured at the Tokyo Olympics as additional sports. Surfing and break-dancing will be among additional sports in the 2024 Paris Games. Host cities were allowed to propose additional sports as part of he IOC's \"Agenda 2020\" reforms with an aim to help host countries' most played sports gain exposure via the Olympics. Till 2016, there was a cap of 28 sports in Olympic programme but it was dropped by the IOC in a 2014 decision. Now, each summer Olympics will be restricted to 10,500 athletes and 310 events. The IOC has a list of main sports that were almost always present at the Olympics. Live TV Also Read | Teenage weightlifter Jeremy Lalrinnunga wins gold at Commonwealth Championships Also Read | IOC advises IOA to hold election in January, general assembly on December 19","image_url":null,"source_id":"indiatoday"},{"title":"Hobart likely to host fifth Ashes Test","link":"https://www.sentinelassam.com/sports/cricket/hobart-likely-to-host-fifth-ashes-test-567355","keywords":["Sports,Cricket"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"The Bellerive Oval in Hobart is set to be announced as the venue for the fifth and final Ashes Test, after it beat rivals Melbourne Cricket Ground (MCG) and Sydney Cricket Ground (SCG), reports emerging from Australia said.","content":"HOBART: The Bellerive Oval in Hobart is set to be announced as the venue for the fifth and final Ashes Test, after it beat rivals Melbourne Cricket Ground (MCG) and Sydney Cricket Ground (SCG), reports emerging from Australia said.The Test, scheduled to commence on January 14, was first awarded to Perth but because of the stringent Covid-19 protocols in Western Australia (WA) and the need for players to undergo 14 days of hard quarantine, the Optus Stadium lost the hosting rights for the concluding Ashes Test. \"It's a done deal for Hobart to host the series finale with a formal announcement expected this weekend,\" said Newscorp in a report on Friday. This means the Bellerive Oval will host a day-night game, the second pink-ball match of the series after Adelaide, which is the host for the second Test. Australian Prime Minster Scott Morrison, a great cricket fan, reportedly \"sided with Hobart's bid to host a first Test match since 2016\". IANS Also Read: Simone Biles is Time's 'Athlete of the Year'Also Watch:","pubDate":"2021-12-11 10:28:52","full_description":"HOBART: The Bellerive Oval in Hobart is set to be announced as the venue for the fifth and final Ashes Test, after it beat rivals Melbourne Cricket Ground (MCG) and Sydney Cricket Ground (SCG), reports emerging from Australia said. The Test, scheduled to commence on January 14, was first awarded to Perth but because of the stringent Covid-19 protocols in Western Australia (WA) and the need for players to undergo 14 days of hard quarantine, the Optus Stadium lost the hosting rights for the concluding Ashes Test. \"It's a done deal for Hobart to host the series finale with a formal announcement expected this weekend,\" said Newscorp in a report on Friday. This means the Bellerive Oval will host a day-night game, the second pink-ball match of the series after Adelaide, which is the host for the second Test. Australian Prime Minster Scott Morrison, a great cricket fan, reportedly \"sided with Hobart's bid to host a first Test match since 2016\". IANS Also Read: Simone Biles is Time's 'Athlete of the Year' Also Watch:","image_url":"https://assets.sentinelassam.com/h-upload/2021/12/11/280996-ho.jpg","source_id":"sentinel"},{"title":"Ashes 2021-22: England players docked five WTC points, entire match fee for slow over-rate in 1st Test","link":"https://zeenews.india.com/cricket/ashes-2021-22-england-players-docked-five-wtc-points-entire-match-fee-for-slow-over-rate-in-1st-test-2418341.html","keywords":null,"creator":null,"video_url":null,"description":"England have been fined their entire match fees and docked five World Test Championship points for maintaining a slow rate of overs during their nine-wicket defeat by Australia in the first Ashes test, cricket`s world governing body said on Saturday.","content":null,"pubDate":"2021-12-11 10:01:00","full_description":null,"image_url":null,"source_id":"zeenews"},{"title":"What’s the Buzz: SCG honour for Kerry Packer","link":"https://www.cairnspost.com.au/sport/whats-the-buzz-scg-adds-kerry-packer-to-media-hall-of-honour/news-story/7bc9a4b5c1bfe016151bb60230b6705b","keywords":["NRL News","Sport news and galleries"],"creator":null,"video_url":null,"description":"Australian sport would be a very different place if Kerry Packer didn’t love a punt or watching cricket and footy.","content":null,"pubDate":"2021-12-11 10:00:00","full_description":null,"image_url":null,"source_id":"cairnspost"},{"title":"The Ashes: Cricket Australia chief apologises after power outage at the Gabba disrupts global coverage","link":"https://www.indiatoday.in/sports/cricket/story/the-ashes-cricket-australia-chief-apologises-after-power-outage-at-the-gabba-disrupts-global-coverage-1886710-2021-12-11?utm_source=rss","keywords":null,"creator":null,"video_url":null,"description":"The Ashes: CA chief apologises after power outage disrupts global coverage on Day 4","content":null,"pubDate":"2021-12-11 09:54:08","full_description":"Cricket Australia (CA) chief executive Nick Hockley apologised for a power outage at the Gabba that disrupted global coverage early in the fourth day of the first Ashes Test on Saturday. A CA spokesperson said soon after the disruption that the power issue had affected the feed after the broadcast blackout. \"I just want to apologise to all the fans out there,\" Hockley told ABC Sport. \"I just want to say thank you to everyone working extremely hard to get that back up and running as quickly as possible and again, I can only say sorry to all the fans.\" A litany of technical issues have plagued the opening match of cricket's most enduring rivalry. Broadcasters reported on Thursday that the equipment used by the third umpire to check the front foot for no balls had broken down. The RTS 'Snicko' technology, which gauges noise from batting nicks to help the third umpire judge catch decisions, has also been unavailable for the test due to COVID-19 \"border restrictions\", CA said. Australia won the first Test by nine wickets after dismissing England for 297 on Saturday. It left them with a target of 20 to chase and Alex Carey opened the innings with Marcus Harris in place of the injured David Warner. Carey fell to Ollie Robinson and Marnus Labuschagne ended the match with a boundary.","image_url":null,"source_id":"indiatoday"},{"title":"The first Test at the WACA heralded a new king at the crease","link":"https://thewest.com.au/sport/cricket/the-first-test-at-the-waca-heralded-a-new-king-at-the-crease--c-4908037","keywords":null,"creator":["Catherine McGregor"],"video_url":null,"description":"On December 11, 1970, the atmosphere at the WACA was simply electric. The cricket did not always match the exhilaration of the crowd as the match petered out to a draw.","content":null,"pubDate":"2021-12-11 09:51:14","full_description":null,"image_url":"https://images.thewest.com.au/publication/C-4908037/3fbee5b0061ea47b30d1a7df33ce107fb88398af-16x9-x0y437w3586h2017.jpg","source_id":"thewest"},{"title":"England collapse as ruthless Aussies claim first Test | Men's Ashes 2021-22 -","link":"https://news.google.com/__i/rss/rd/articles/CBMiK2h0dHBzOi8vd3d3LnlvdXR1YmUuY29tL3dhdGNoP3Y9TS1ZWXE5YXFGOWfSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"England collapse as ruthless Aussies claim first Test | Men's Ashes 2021-22  The best of Nathan Lyon: Galle debut, Bengaluru eight-for, Adelaide game-changer, and more  ESPNcricinfoUpdated World Test Championship Points Table After Australia vs England 1st Test  Cricket AddictorLyon leads Australia's march to 1-0 lead in The Ashes | Cricbuzz.com - Cricbuzz  CricbuzzAustralia vs England, 1st Ashes Test: Milestone man Nathan Lyon spins Australia to thumping win  Times of IndiaView Full coverage on Google News","content":null,"pubDate":"2021-12-11 09:30:03","image_url":null,"source_id":"google"},{"title":"Cricket - England fined 100% of match fees for slow over rate in Ashes defeat","link":"https://www.thestar.com.my/sport/cricket/2021/12/11/cricket---england-fined-100-of-match-fees-for-slow-over-rate-in-ashes-defeat","keywords":null,"creator":null,"video_url":null,"description":"(Reuters) - England have been fined their entire match fees and docked five World Test Championship points for maintaining a slow rate of overs during their nine-wicket defeat by Australia in the first Ashes test, cricket's world governing body said on Saturday. Read full story","content":null,"pubDate":"2021-12-11 09:21:00","full_description":"(Reuters) - England have been fined their entire match fees and docked five World Test Championship points for maintaining a slow rate of overs during their nine-wicket defeat by Australia in the first Ashes test, cricket's world governing body said on Saturday. Joe Root's side were ruled to be five overs short of the target after time allowances were taken into consideration, with match referee David Boon imposing the sanction. Players are fined 20% of their match fee for every over their side fails to bowl in the allotted time, while the team is penalised one point for each over short. The ICC added that Australian batter Travis Head was fined 15% of his match fee for using bad language in the 77th over of their first innings on Thursday, when he was beaten by a ball from England all-rounder Ben Stokes. One demerit point was also added to Head's disciplinary record after his first offence in a 24-month period. When a player attains four or more demerit points in a two-year period, they are converted into suspension points that could bring a ban. Nathan Lyon captured a long-awaited 400th test victim and spun Australia to an emphatic nine-wicket victory in the test, with England losing eight wickets on day four in Brisbane. The second of the five tests will run from Dec. 16 to 20 in Adelaide. (Reporting by Shrivathsa Sridhar in Bengaluru; Editing by Clarence Fernandez)","image_url":null,"source_id":"thestar_my"},{"title":"Nasser Hussain says England collapse is part of long-term issue in Test cricket","link":"https://uk.sports.yahoo.com/news/nasser-hussain-says-england-collapse-090520244.html?src=rss","keywords":null,"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2021-12-11 09:05:20","image_url":null,"source_id":"yahoo"},{"title":"Wade’s INSANE fast 50!","link":"https://www.cairnspost.com.au/sport/cricket/wades-insane-fast-50/video/09a68f13d8efa46dad56e3c451f9f262","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket: Matthew Wade bagged himself a half-century from just 19 deliveries against the Sydney Sixers, scoring the fourth fastest fifty in BBL history.","content":null,"pubDate":"2021-12-11 08:52:09","full_description":null,"image_url":null,"source_id":"cairnspost"},{"title":"Wade’s INSANE fast 50!","link":"https://www.news.com.au/sport/cricket/wades-insane-fast-50/video/09a68f13d8efa46dad56e3c451f9f262","keywords":null,"creator":null,"video_url":null,"description":"Cricket: Matthew Wade bagged himself a half-century from just 19 deliveries against the Sydney Sixers, scoring the fourth fastest fifty in BBL history.","content":null,"pubDate":"2021-12-11 08:52:09","full_description":null,"image_url":null,"source_id":"news"},{"title":"Cricket - Australia's Cummins, Lyon excited by Green potential","link":"https://www.channelnewsasia.com/sport/cricket-australias-cummins-lyon-excited-green-potential-2373641","keywords":null,"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2021-12-11 08:49:26","full_description":null,"image_url":"https://onecms-res.cloudinary.com/image/upload/s--WoaQvOos--/c_fill%2Ch_900%2Cw_1600/fl_relative%2Cg_south_east%2Cl_one-cms:core:watermark:reuters%2Cw_0.1/f_auto%2Cq_auto/v1/one-cms/core/2021-12-11t084417z_1_lynxmpehba02k_rtroptp_3_cricket-australia-captain.jpg?itok=jgnksqso","source_id":"channelnewsasia"},{"title":"Cricket - Australia&#039;s Cummins, Lyon excited by Green potential","link":"https://www.thestar.com.my/sport/cricket/2021/12/11/cricket---australia039s-cummins-lyon-excited-by-green-potential","keywords":null,"creator":null,"video_url":null,"description":"(Reuters) - New Australian captain Pat Cummins described all-rounder Cameron Green as a genuine pace bowler, while team mate Nathan Lyon said he was excited by the 22-year-old's skill set after their nine-wicket victory over England in the Ashes opener on Saturday. Read full story","content":null,"pubDate":"2021-12-11 08:47:00","full_description":"(Reuters) - New Australian captain Pat Cummins described all-rounder Cameron Green as a genuine pace bowler, while team mate Nathan Lyon said he was excited by the 22-year-old's skill set after their nine-wicket victory over England in the Ashes opener on Saturday. Green, who made his test debut against India in Adelaide last December, picked up his first wicket by removing Ollie Pope on a disappointing opening day for England, before dismissing the dangerous Joe Root for 89 in the second innings. \"It's huge for us, not only having an all-rounder who bowls a bit but he's a genuine fourth quick,\" said Cummins, adding that the team was witnessing Green's full potential after repeated stress fractures over the last four years. \"Last summer was tough, it was literally straight after stress fractures, so not only did we not want to put too many overs into him, but little things like preparing for games and getting overs, he didn't have a lot of bowling behind him. \"This year he's had a real pre-season, bowled a bit more in Shield cricket, so he's back to what he was probably bowling a couple of years ago. \"He's a huge asset, bowls 140 kph (87 mph), can swing the ball and I really wanted to get him into the game.\" Lyon, who captured his 400th test wicket during the game, said Green's display was remarkable. \"Just to be fielding square of the wicket -- I'm used to seeing Josh (Hazlewood), Pat and Mitchell Starc hit the wicket and the pace and bounce that they get,\" Lyon said. \"I was blown away with Green's rhythm and the belief that he's come in with (and the way he) whacked the pitch to get something out of it. \"I'm proper excited about his skill set. His belief will keep growing day by day, training session by training session and test by test ... he's going to be an unbelievable asset for Australian cricket for a long period of time, hopefully.\" (Reporting by Shrivathsa Sridhar in Bengaluru; Editing by Clarence Fernandez)","image_url":"https://apicms.thestar.com.my/uploads/images/2021/12/11/1402427.jpg","source_id":"thestar_my"},{"title":"SCO vs STR Dream11 Team Prediction, Fantasy Cricket Hints: Captain, Probable Playing 11s, Team News; Injury Updates For Today’s BBL 2021 match at Perth Stadium, Perth at 4:00 PM IST December 11","link":"https://zeenews.india.com/cricket/sco-vs-str-dream11-team-prediction-fantasy-cricket-hints-captain-probable-playing-11s-team-news-injury-updates-for-today-s-bbl-2021-match-at-perth-stadium-perth-at-400-pm-ist-december-11-2418282.html","keywords":null,"creator":null,"video_url":null,"description":"Perth Scorchers vs Adelaide Strikers Dream11 Team Prediction Perth Scorchers vs Adelaide Strikers Match 9 - Check My Dream11 Team, Best players list of SCO vs STR, Perth Scorchers vs Adelaide Strikers, Perth Scorchers Dream11 Team Player List, Adelaide Strikers Dream11 Team Player List, Dream11 Guru Tips, Fantasy Cricket Tips Big Bash League 11, Fantasy Cricket Tips, Fantasy Playing Tips -","content":null,"pubDate":"2021-12-11 08:38:00","full_description":null,"image_url":null,"source_id":"zeenews"},{"title":"Vijay Hazare Trophy: Ruturaj Gaikwad in line to join Virat Kohli in elite list after 3 back-to-back hundreds - India Today","link":"https://news.google.com/__i/rss/rd/articles/CBMijwFodHRwczovL3d3dy5pbmRpYXRvZGF5LmluL3Nwb3J0cy9jcmlja2V0L3N0b3J5L3J1dHVyYWotZ2Fpa3dhcmQtdmlqYXktaGF6YXJlLXRyb3BoeS0zLWNlbnR1cmllcy1zb3V0aC1hZnJpY2Etb2RpLXNlcmllcy1jYXNlLTE4ODY2OTEtMjAyMS0xMi0xMdIBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Vijay Hazare Trophy: Ruturaj Gaikwad in line to join Virat Kohli in elite list after 3 back-to-back hundreds  India Today'Next CSK captain after Dhoni': Twitter lauds India youngster for incredible feat in Vijay Hazare Trophy  Hindustan TimesTwitter Reacts On Ruturaj Gaikwad's Three Consecutive Centuries In Vijay Hazare Trophy 2021-22  Cricket AddictorRuturaj Gaikwad smashes third consecutive hundred in Vijay Hazare Trophy  SportstarGaikwad, Venkatesh Iyer tons light up Round 2 | Cricbuzz.com - Cricbuzz  CricbuzzView Full coverage on Google News","content":null,"pubDate":"2021-12-11 08:24:41","image_url":null,"source_id":"google"}]}