{"newsArray":[{"title":"New Zealand's Southee happy with 'tough challenge' in UAE","link":"https://www.dubaieye1038.com/news/sports/new-zealands-southee-happy-with-tough-challenge-in-uae/","keywords":["Sports"],"creator":null,"video_url":null,"description":"New Zealand captain Tim Southee is happy with the tough challenge his team faced in the United Arab Emirates before eking out a 2-1 series victory on Sunday.","content":"New Zealand captain Tim Southee is happy with the tough challenge his team faced in the United Arab Emirates before eking out a 2-1 series victory on Sunday. The tourists, missing several frontline players, escaped to victory in the opener but were stunned in the second T20 match with UAE registering their first win against New Zealand in any format. New Zealand put up an improved display in Sunday's decider when Will Young smashed 56 in his first match of the series and Mark Chapman made 51 to help them post 166-5. The hosts managed 134-7, with Ben Lister claiming 3-35 for New Zealand in what Southee called their \"best performance of the series\". \"We expected a tough challenge in these conditions,\" Southee said referring to the heat after they prevailed by 32 runs at the Dubai International Cricket Stadium. \"As I said at the start of the series, they're a growing side, they're ever-improving and we saw that throughout the series they played extremely well in those first two games. \"We were able to build a partnership there with Chapman and Will Young – someone who came in after the first two games – so that was pleasing.\" New Zealand will travel to England later this month to play four T20 and as many one-day internationals before heading to India for the ODI World Cup in October-November.","pubDate":"2023-08-21 05:34:52","image_url":"https://mmo.aiircdn.com/265/64e30021bf37c.jpg","source_id":"dubaieye1038","source_priority":4083659,"country":["united arab emirates"],"category":["sports"],"language":"english"},{"title":"'Great headache to have': Jasprit Bumrah states picking India's Playing XI is hard job","link":"https://www.indiatvnews.com/sports/cricket/great-headache-to-have-jasprit-bumrah-states-picking-indias-playing-xi-is-hard-job-india-vs-ireland-t20i-series-ind-vs-ire-2023-08-21-887923","keywords":null,"creator":null,"video_url":null,"description":"As a young Indian team in Ireland builds up for the T20 World Cup 2024, stand-in T20I captain Jasprit Bumrah reflected on the job of a skipper to pick a Playing XI. India have fielded a second-string team and gave chances to many young players in a three-match T20I series against Ireland which India won with a game to go. The Men in Blue completed a series win with a victory in the second T20I by 33 runs on Sunday.","content":"As a young Indian team in Ireland builds up for the T20 World Cup 2024, stand-in T20I captain reflected on the job of a skipper to pick a Playing XI. India have fielded a second-string team and gave chances to many young players in a three-match T20I series against Ireland which India won with a game to go. The Men in Blue completed a series win with a victory in the second T20I by 33 runs on Sunday. Bumrah was a happy man after the match as he registered a T20I series win in his first attempt as a captain. However, he claimed that it is tough to pick a playing XI as everyone in the team is eager to play in the limited opportunities. \"I am feeling good. Today was a little drier. We thought it would get slower and hence batted first. It is very pleasing. It is tough to pick an XI. Great headache to have. Everyone is eager. Everyone is confident. All of us wanted to play for India. Eventually, everyone has to work their way up,\" Bumrah said after the win in Malahide. The team is without the services of key players like , , , , Shreyas Iyer, Suryakumar Yadav and Mohammed Siraj in the series against Ireland. This opened the doors for the likes of Yashasvi Jaiswal, Ruturaj Gaikwad, Rinku Singh and Ravi Bishnoi among others. The Indian pace merchant is happy to play without the baggage of having expectations pinned on him. \"If you play with baggage of expectation, you are under pressure. You have to keep those expectations aside. You are not doing yourself 100 per cent justice if you are playing with so many expectations,\" he added. India registered a thumping victory over the hosts Ireland in Malahide on Sunday to seal the three-match series with a game in hand. Vice-captain Ruturaj Gaikwad, wicket-keeper Sanju Samson and finisher Rinku Singh helped India get to 185 in the first innings. The bowlers then joined and despite a valiant effort from Andrew Balbirnie, India clinched the contest by 33 runs.","pubDate":"2023-08-21 03:30:57","image_url":null,"source_id":"indiatvnews","source_priority":10055,"country":["india"],"category":["sports"],"language":"english"},{"title":"Who Can Solve India's No. 4 Conundrum In Asia Cup 2023?","link":"https://sports.ndtv.com/cricket/who-can-solve-indias-no-4-conundrum-in-asia-cup-2023-4314400","keywords":null,"creator":null,"video_url":null,"description":"The absence of Rishabh Pant, KL Rahul and Shreyas Iyer has created a void in India's middle-order, with the management yet to finalise the no. 4 spot.","content":"With exactly nine days left for the start of the 2023 Asia Cup, the Board of Control for Cricket in India (BCCI) is expected to announce India's squad for the event on Monday. The squad announcement will take place during BCCI's meeting in Delhi, with both head coach Rahul Dravid and captain Rohit Sharma part of the conversation. From Jasprit Bumrah 's comeback in the ongoing T20I series against Ireland, to the fitnes off KL Rahul and Shreyas Iyer , the management will have plenty of tough calls to make before churning out the strongest-possible squad. Rahul and Iyer's injuries has created a void in India's middle-order, with the management yet to finalise the no. 4 spot. Rishabh Pant would've been another option, but he too is out for a lengthy period, having suffered a car crash last year. Iyer has scored the most number of runs for India at no. 4 in the current World Cup cycle, followed by Pant and Rahul. The Mumbai batter had establish himself as one of the most reliable batters, but an unfortunate injury now has the Indian team chasing shadows. India's possible options at no. 4? With Rahul and Iyer racing against time to be fit for the continental event, India will now have to pick between these four players -- Suryakumar Yadav , Ishan Kishan , Sanju Samson and Tilak Varma . Suryakumar Yadav is a prove match-winner when it comes to T20Is, but by his own admission, he has not able to replicate his riches in the One-Day Internationals. He averages 46.02 in T20Is, but only 24.33 in ODIs. Ishan Kishan and Sanju Samson are expected to make the Asia Cup, but only of them is likely to be in the XI as a wicketkeeper-batter. While both have previously batted at no. 4, the performances have been anything but convincing fro both parties. Tilak Varma has made a late claim for the no. 4 spot, following his debut tour of West Indies. Experts, Sourav Ganguly and Ravi Shastri , have vouched for his selection. If he gets into the side, Tilak could be a strong contender for the role. Also, India's don't have left-hander in their middle-order, and Tilak ticks that box too. Virat Kohli can also stake his claim for the role, having batted at no. 4 during India's triumphic World Cup campaign in 2011. However, he has only batted twice in that position. While Kishan, who has an ODI double century to his name, is more likely to fill in, Iyer and Rahul will force him out of the team once they are fit.","pubDate":"2023-08-21 02:36:48","image_url":null,"source_id":"ndtv","source_priority":1204,"country":["india"],"category":["sports"],"language":"english"},{"title":"दूसरा टी20 - गायकवाड़, सैमसन, रिंकू के शानदार प्रदर्शन से भारत ने आयरलैंड को 33 रनों से हराया","link":"https://www.khaskhabar.com/sports/cricket-news/sports-news-2nd-t20i--gaikwad-samson-rinku-shine-as-india-beat-ireland-by-33-runs-news-hindi-1-581303-KKN.html","keywords":null,"creator":null,"video_url":null,"description":"यहां रविवार को खेले गए दूसरा टी20 मैच में रुतुराज गायकवाड़ ने शानदार अर्धशतक","content":"डबलिन,। यहां रविवार को खेले गए दूसरा टी20 मैच में रुतुराज गायकवाड़ ने शानदार अर्धशतक के साथ भारत की पारी को आगे बढ़ाया, जबकि संजू सैमसन और रिंकू सिंह ने प्रभावशाली पारियां खेलकर भारत को 185-5 के प्रतिस्पर्धी स्कोर तक पहुंचाया और आयरलैंड को 33 रनों से हराकर तीन मैचों की सीरीज में 2-0 की अजेय बढ़त बना ली।सलामी बल्लेबाज एंडी बालबर्नी 51 गेंदों में 72 रन बनाकर आयरलैंड के लिए एकमात्र रनर थे, लेकिन यह व्यर्थ चला गया, क्योंकि भारत के गेंदबाजों ने शानदार जसप्रीत बुमरा के नेतृत्व में आयरलैंड को 152-8 पर रोक दिया। प्रसिद्ध कृष्णा ने पावरप्ले के अपने पहले ओवर में डबल स्ट्राइक की, साथ ही रवि बिश्‍नोई और अर्शदीप सिंह विकेटों के बीच मौजूद रहे।भारत के लिए गायकवाड़ ने 43 गेंदों में 58 रन बनाए और सैमसन के साथ 71 रनों की महत्वपूर्ण साझेदारी की। उन्होंने 26 गेंदों में 40 रनों की तेज पारी खेली। हालांकि ऐसा लग रहा था कि भारत पारी के अंत में कुछ गति खो रहा था, मगर रिंकू ने 21 गेंदों में 38 रन बनाए और शिवम दुबे 22 रन बनाकर नाबाद रहे। दोनों ने अंतिम 12 गेंदों में 42 रन बनाकर भारत को 180 के पार पहुंचाया।पहले बल्लेबाजी करने उतरे भारत के लिए दूसरे ओवर से रन बनने शुरू हो गए और गायकवाड़ ने जोश लिटिल को चार रन पर आउट कर दिया। यशस्वी जयसवाल ने बाएं हाथ के तेज गेंदबाज की गेंद पर चौका और छक्का लेने के लिए बैकफुट से दो बार घुमाया। जब बैरी मैक्कार्थी ने चौड़ाई दी, तो जयसवाल ने तुरंत उसे शॉर्ट थर्ड मैन के पार चार और रन के लिए कट कर दिया।गायकवाड़ ने लॉन्ग-ऑन और डीप स्क्वायर लेग के बीच आर्क में बैकफुट से तीन शानदार चौकों के साथ भारत को आगे बढ़ाया। दूसरे छोर से सैमसन ने तेज गेंदबाजों पर अपनी पांच चौकों में सही टाइमिंग और प्लेसमेंट पाया, जिसमें लिटिल की लगातार तीन गेंदें शामिल थीं।जब सैमसन ने 18 रन के 11वें ओवर में स्क्वायर लेग के पीछे से एक छक्का जड़ा तो मालाहाइड में खचाखच भरी भीड़ ने सबसे ज्यादा खुशी मनाई। उनकी 26 गेंदों की आक्रामक पारी 13वें ओवर में समाप्त हुई, जब उन्होंने लेग स्पिनर बेन व्हाइट की एक छोटी और वाइड गेंद के खिलाफ बड़ा शॉट लगाने के प्रयास में अपने स्टंप्स को काट दिया।गायकवाड़ ने व्हाइट की गेंद पर डीप स्क्वेयर लेग पर चार रन के लिए स्वीप करके अपना अर्धशतक पूरा किया और इसके बाद उसी ओवर में लॉन्ग-ऑन पर छक्का जड़ा। क्रीज पर उनका 43 गेंदों का प्रवास तब समाप्त हो गया जब 16वें ओवर में मैक्कार्थी की एक धीमी गेंद को लॉन्ग ऑफ पर चूक गए।पहली बार टी20ई में बल्लेबाजी कर रहे रिंकू ने दो चौके लगाए, इसके बाद मैक्कार्थी ने लॉन्ग-ऑन और अतिरिक्त कवर पर छक्के लगाए। दुबे अंतिम ओवर में फाइन लेग पर फ्लिक और मिडविकेट पर स्विंग के साथ छक्का मारने वाली पार्टी में शामिल हो गए। रिंकू ने ओवर का तीसरा छक्का डीप मिडविकेट पर एक गैर-जिम्मेदार पुल के साथ मारा, इससे पहले कि अगली ही गेंद पर वह आउट हो गए, जिससे भारत 180 का आंकड़ा पार कर गया।आयरलैंड के लक्ष्य का पीछा करने की शुरुआत बलबर्नी द्वारा दूसरे ओवर में अर्शदीप पर दो चौके लगाने से हुई। लेकिन कृष्णा ने अगले ओवर में शॉर्ट गेंदों पर पॉल स्टर्लिंग और लोर्कन टकर को आउट करके आयरलैंड को बैकफुट पर धकेल दिया। बिश्‍नाेई ने पावर-प्ले में हैरी टेक्टर को आउट कर आयरलैंड को दूसरा झटका दिया।लेकिन बालबर्नी ने आगे बढ़ना जारी रखा और आयरलैंड के लक्ष्य को फिर से जीवित कर दिया। उन्होंने पावर-प्ले समाप्त होने के तुरंत बाद वाशिंगटन सुंदर की गेंद पर दो चौके लगाकर शुरुआत की। हालांकि कर्टिस कैंपर बिश्‍नाेई को पॉइंट करने के लिए रिवर्स-पैडलिंग के बाद गिर गए, बलबर्नी ने दुबे को दो छक्के लगाए और बिश्‍नाेई को चार रन देकर अपना अर्धशतक पूरा किया। इसके बावजूद आयरलैंड की आवश्यक रन-रेट बढ़ती रही, हालांकि बालबर्नी और जॉर्ज डॉकरेल ने कृष्णा और बिश्‍नाेई की गेंद पर एक-एक छक्का लगाया। जब डॉकरेल को बिश्‍नाेई ने रन आउट किया तो भारत का पलड़ा मजबूत हो गया, जबकि बालबर्नी की गेंद पर अर्शदीप की गेंद पर सैमसन ने विकेट के पीछे कैच कर लिया। पारी के अंत में बुमराह ने मैक्कार्थी और मार्क अडायर को आउट किया, जिन्होंने अर्शदीप और प्रसिद्ध पर तीन छक्के लगाए। भारतीय कप्तान ने अपने चार ओवरों में कोई बाउंड्री नहीं दी, जिनमें से एक खेल के आखिरी ओवर में मेडन थी, क्योंकि मेहमान टीम ने अब एक मैच शेष रहते हुए श्रृंखला जीत ली है। संक्षिप्त स्कोर : भारत ने 20 ओवर में 185-5 (रुतुराज गायकवाड़ 58, संजू सैमसन 40, बैरी मैक्कार्थी 2-36, क्रेग यंग 1-29) ने आयरलैंड को 20 ओवर में 152-8 से हराया (एंडी बालबर्नी 72, जसप्रीत बुमरा 2-15, प्रसिद्ध कृष्णा 2-29) 33 रन से।","pubDate":"2023-08-21 01:58:26","image_url":null,"source_id":"khaskhabar","source_priority":5174519,"country":["india"],"category":["sports"],"language":"hindi"},{"title":"India seal series with easy win","link":"https://www.tribuneindia.com/news/sports/india-seal-series-with-easy-win-536788","keywords":null,"creator":null,"video_url":null,"description":"Dublin, August 20India beat Ireland by 33 runs to win the second T20 International and take an unassailable 2-0 lead in the three-match series.Batting first, India posted 185/5, riding on vice-captain Ruturaj Gaikwad's 58 off 43 balls, Sanju Samson's 40 off 26 deliveries and Rinku Singh's 38 off 21 balls.Today, I could run in and bowl a little faster. We wanted to put runs on the board and we thought the pitch will get slower. It did get slower. Jasprit Bumrah, India captainIn reply, Ireland were restricted to 152/8 with Prasidh Krishna taking 2/29 while Ravi Bishnoi scalped 2/37. Skipper Jasprit Bumrah had figures of 2/15. For Ireland, Andrew Balbirnie scored 72 off 51 balls.Brief Scores: India: 185/5 (Gaikwad 58, Samson 40, Rinku 38; McCarthy 2/36, Young 1/29); Ireland: 152/8 (Balbirnie 72; Bumrah 2/15, Krishna 2/29, Bishnoi 2/37).","content":"PTI Dublin, August 20 India beat Ireland by 33 runs to win the second T20 International and take an unassailable 2-0 lead in the three-match series. Batting first, India posted 185/5, riding on vice-captain Ruturaj Gaikwad’s 58 off 43 balls, Sanju Samson’s 40 off 26 deliveries and Rinku Singh’s 38 off 21 balls. Today, I could run in and bowl a little faster. We wanted to put runs on the board and we thought the pitch will get slower. It did get slower. Jasprit Bumrah, India captain In reply, Ireland were restricted to 152/8 with Prasidh Krishna taking 2/29 while Ravi Bishnoi scalped 2/37. Skipper Jasprit Bumrah had figures of 2/15. For Ireland, Andrew Balbirnie scored 72 off 51 balls. Brief Scores: India: 185/5 (Gaikwad 58, Samson 40, Rinku 38; McCarthy 2/36, Young 1/29); Ireland: 152/8 (Balbirnie 72; Bumrah 2/15, Krishna 2/29, Bishnoi 2/37). #Cricket","pubDate":"2023-08-21 01:38:19","image_url":"https://englishtribuneimages.blob.core.windows.net/gallary-content/2023/8/2023_8$largeimg_1401186234.jpg","source_id":"tribuneindia","source_priority":7916,"country":["india"],"category":["sports"],"language":"english"},{"title":"FIFA Women’s World Cup 2023 makes history as almost 19 million people tune in to the tournament","link":"https://thewest.com.au/sport/fifa-women-s-world-cup/fifa-womens-world-cup-2023-makes-history-as-almost-19-million-people-tune-in-to-the-tournament-c-11653653","keywords":null,"creator":["Lauren Higham"],"video_url":null,"description":"It’s official – Australians have been converted to soccer fanatics after record numbers tuned in to watch the FIFA Women’s World Cup 2023 tournament.","content":"It’s official – Australians have been converted to soccer fanatics after almost 19 million people tuned in to watch the FIFA Women’s World Cup. A record 18.6 million people — including the 5.54 million people who tuned in to Sunday night’s final match, where Spain triumphed over England 2-0 — tuned in across the tournament, making it the biggest broadcast and digital viewing event in Australian history. The final was the number one broadcast program on Sunday night nationally and in the capital cities in all people, 25 to 54s and 16 to 39s. It drew an average national total audience of 3.08 million on Seven and 7plus. Saturday’s playoff for third place between Australia and Sweden also saw huge numbers, with an average audience of 3.38 million witnessing the Matildas’ heartbreaking 2-0 loss. The match was the number one broadcast program on the night nationally and in the capital cities in all people, 25 to 54s and 16 to 39s. The Matildas’ semifinal against England on August 16 became the most-watched TV program in more than two decades, seeing an average audience of 7.2 million. It also made history as the most streamed event ever in Australia, with 957,000 viewers on 7plus. Managing Director Seven Melbourne and Head of Network Sport, Lewis Martin, said Seven’s broadcast of the Women’s World Cup highlighted the “growing passion” for women’s football in Australia. “Seven’s unparalleled live and free coverage of the event, underpinned by our team of passionate, expert commentators, reaffirms our ongoing commitment to celebrate and grow both men’s and women’s sports across all codes. From the AFLW and the WBBL to women’s international cricket and more, Seven has a strong legacy of bringing the best in sports to Australians that inspires the next generation,” he said. “This World Cup has been like no other and has set a new benchmark for future tournaments. The Matildas have been nothing short of spectacular, and we’re honoured to have shared their remarkable journey.” Seven West Media Chief Revenue Officer, Kurt Burnette, agreed, noting the sporting event “firmly cemented itself” as the biggest broadcast and digital viewing event in Australian history. “We knew it would be a cultural game changer, and it’s been just that – categorically shaping culture and changing behaviours. Audience numbers on Seven and 7plus, in partnership with Optus, surpassed our expectations to deliver incredible results for our brand partners while creating a halo effect across the rest of our schedule like we’ve never seen before,” he said. “No other medium other can create the same mass cultural impact as TV, and we’re proud that Seven’s coverage united Australia, created a shared sense of pride across the nation and produced lasting memories that will inspire a new generation.” Sign up for our emails","pubDate":"2023-08-21 01:35:14","image_url":"https://images.thewest.com.au/publication/C-11653653/63bb28c01159b8909a0689274ed1b2da66b4a6eb-16x9-x94y280w1234h694.jpg","source_id":"thewest","source_priority":106740,"country":["australia"],"category":["sports"],"language":"english"},{"title":"रिंकू सिंह 2023 में जड़ चुके 23 छक्के, फिर क्यों कहा- 10 साल बाद आया मौका, कप्तान बुमराह ने लगाया गले","link":"https://hindi.news18.com/cricket/rinku-singh-showed-amazing-in-his-debut-t20i-innings-team-india-won-series-against-ireland-jasprit-bumrah-7300289.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"Rinku Singh Player Of The Match: रिंकू सिंह ने अपनी इंटरनेशनल करियर की पहली पारी में ताबड़तोड़ बल्लेबाजी की. 25 साल के बैटर को प्लेयर ऑफ द मैच भी चुना गया. इसी के साथ टीम इंडिया ने आयरलैंड के खिलाफ दूसरा टी20 मैच जीतकर सीरीज पर भी कब्जा कर लिया है.","content":"Rinku Singh Player Of The Match: रिंकू सिंह ने ताबड़तोड़ पारी खेली और प्लेयर ऑफ द मैच रहे. (Bcci Twitter) नई दिल्ली. जसप्रीत बुमराह की कप्तानी में टीम इंडिया ने आयरलैंड के खिलाफ टी20 सीरीज में 2-0 की अजेय बढ़त बना ली है. भारतीय टीम ने दूसरे मैच में मेजबान टीम को 33 रन से हराया. सीरीज के पहले मैच में भारत को डकवर्थ लुइस नियम से 2 रन से जीत मिली थी. दूसरे मैच में की बात करें, तो भारतीय टीम ने पहले खेलते हुए 5 विकेट पर 185 रन का अच्छा स्कोर खड़ा किया. ऋतुराज गायकवाड़ ने 58, संजू सैमसन ने 40 और रिंकू सिंह ने 38 रन बनाए. रिंकू सिंह 2023 में अब तक टी20 के डेथ ओवर्स में 23 छक्के लगा चुके हैं. उनसे अधिक छक्के अन्य कोई भारतीय नहीं लगा सका है. जवाब में आयरलैंड की टीम निर्धारित 20 ओवर में 8 विकेट पर 152 रन ही बना सकी. सीरीज का तीसरा और अंतिम मुकाबला 23 अगस्त को खेला जाएगा. 25 साल के रिंकू सिंह पहली बार किसी इंटरनेशनल मैच में बल्लेबाजी करने उतरे और प्लेयर ऑफ द मैच भी रहे. उन्होंने 21 गेंद पर ताबड़तोड़ 38 रन बनाए. स्ट्राइक रेट 181 का रहा. 2 चौका और 3 छक्का जड़ा. मैच के बाद रिंकू ने कहा कि मुझे अपनी बल्लेबाजी पर भरोसा था और मैं आईपीएल के अनुभव का उपयोग करने की कोशिश कर रहा था. मैं पारी को अंत तक ले जाने की कोशिश कर रहा था. उन्होंने कहा कि मैं 10 साल से क्रिकेट खेल रहा हूं और अब कड़ी मेहनत का इनाम मिल रहा है. इंटरनेशनल क्रिकेट में पहले ही मैच में बल्लेबाजी करते हुए मैन ऑफ द मैच का पुरस्कार पाकर खुश हूं. मैच खत्म होने के बाद कप्तान जसप्रीत बुमराह ने रिंकू सिंह को गले भी लगाया. डेथ ओवर्स में स्ट्राइक रेट 200 का साल 2023 की बात करें, तो टी20 के डेथ ओवर्स में रिंकू सिंह का स्ट्राइक रेट 200 का है, जो बेहतरीन है. रिंकू ने इस साल अब तक 13 पारियों में 133 गेंद पर 266 रन बनाए हैं. औसत 38 का रहा है. इस दौरान उन्होंने 23 छक्के और 16 चौके लगाए हैं. यानी रिंकू अंतिम ओवरों में चौके से अधिक छक्के लगा रहे हैं. डेथ ओवर्स की बात करें, तो इस साल रिंकू से अधिक छक्के सिर्फ ऑस्ट्रेलिया के टिम डेविड ही लगा सके हैं. डेविड ने 22 पारियों में 28 छक्के जड़े हैं. सिर्फ सूर्यकुमार यादव से पीछे टी20 इंटरनेशनल में उप्र के रिंकू सिंह ने ताबड़तोड़ शुरुआत की. उन्होंने 181 के स्ट्राइक रेट से रन कूटे. भारतीय खिलाड़ियों के टी20 इंटरनेशनल के रिकॉर्ड को देखें, तो पहले मैच में स्ट्राइक रेट के मामले में रिंकू सिंह सिर्फ सूर्यकुमार यादव से पीछे हैं. टी20 के नंबर-1 बैटर सूर्या ने अपनी टी20 इंटरनेशनल की पहली पारी में 184 के स्ट्राइक रेट से रन बनाए थे. इसके अलावा तिलक वर्मा ने 177 तो ईशान किशन ने 175 के स्ट्राइक रेट से रन बनाए. Asia Cup की पिछली गलती से टीम को बचना होगा, गंवा दिया था वर्ल्ड कप! क्या रोहित और द्रविड़ लेंगे सबक? रिंकू सिंह ने अपनी पारी में 3 छक्के लगाए. वे टी20 इंटरनेशनल की पहली पारी में सबसे अधिक छक्के जड़ने के मामले में संयुक्त रूप से दूसरे नंबर पर हैं. ईशान किशान ने भारत की ओर से डेब्यू पारी में सबसे अधिक 4 छक्के लगाए हैं. इसके अलावा रिंकू सिंह, राहुल द्रविड़, मुरली विजय, सूर्यकुमार यादव और तिलक वर्मा ने 3-3 छक्के जड़े. आईपीएल 2023 में कोलकाता नाइट राइडर्स की ओर से खेलते हुए रिंकू सिंह ने 20 ओवरों की अंतिम 5 गेंद पर 5 छक्के जड़कर गुजरात टाइटंस के खिलाफ टीम को रोमांचक जीत दिलाई थी. रिंकू सिंह के ओवरऑल टी20 के रिकॉर्ड को देखें, ताे वे अब तक 82 पारियों में 31 की औसत से 1806 रन बना चुके हैं. 10 अर्धशतक ठोका है. स्ट्राइक रेट 142 का है. उन्होंने अपना पहला टी20 मैच साल 2014 में खेला था. यानी लगभग 9 साल पहले. . Tags: Jasprit Bumrah , Rinku Singh , Team india 25 हजार से करोड़पति बनाने वाला शेयर! 20 साल में दिया ऐसा धांसू रिटर्न, हर वर्ष 22 गुना बढ़ा निवेशकों का पैसा मुंह फुलाए बैठी नन्ही बच्ची, कभी अक्षय कुमार की थीं दीवानी, आज कहलाती हैं बॉलीवुड क्वीन, आंखों में छिपी पहचान हार्दिक पंड्या पर अहम फैसला! चयनकर्ता बैठक में उठा सकते हैं कड़ा कदम, एशिया कप से पहले लगेगा झटका?","pubDate":"2023-08-21 01:08:59","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/08/rinku-singh-2023-16925800173x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","source_priority":6509,"country":["india"],"category":["sports"],"language":"hindi"},{"title":"Test cricketer Naushad Ali passes away","link":"https://www.thenews.com.pk/print/1102138-test-cricketer-naushad-ali-passes-away","keywords":null,"creator":null,"video_url":null,"description":"ISLAMABAD: A human being of great qualities and a Test cricketer of incredible skill, Col Naushad Ali breathed his last at Shifa Hospital due to lung failure Sunday morning.Naushad, 79, served the game throughout his life in all capacities barring the Chairman Pakistan Cricket Board. The...","content":"ISLAMABAD: A human being of great qualities and a Test cricketer of incredible skill, Col (rtd) Naushad Ali breathed his last at Shifa Hospital due to lung failure Sunday morning. .ads_between_content{ height:auto; width:auto; clear: both; text-align: center; } .ads_between_content .story_ads{ } /*@media (max-width:600px){ .ads_between_content{ float:none; margin:0px auto; text-align: center; } }*/ Naushad, 79, served the game throughout his life in all capacities barring the Chairman Pakistan Cricket Board. The wicketkeeper-batsman started his Test career in the early sixties and toured with the Pakistani team to Australia and New Zealand in 1964 and England in 1971. Naushad played six Tests, all versus New Zealand. Unlike modern-day cricket, one rarely get opportunities of playing Test cricket in those days when even one tour or a series a year was considered sufficient to give players the required exposure. Top teams usually met once in a couple of years and even playing six Tests was considered a big achievement. Naushad in between joined the Army which halted his career as a cricketer. He then started his career as an official and even managed teams in the early eighties. He also served as Chief Executive PCB with Mujeebur Rehman for a brief stint. He also worked as chief selector and selector on numerous occasions in the nineties and early 2000s.","pubDate":"2023-08-21 01:00:00","image_url":null,"source_id":"thenews","source_priority":6495,"country":["pakistan"],"category":["sports"],"language":"english"},{"title":"Sethi slams BCCI over WC scheduling mess","link":"https://www.thenews.com.pk/print/1102134-sethi-slams-bcci-over-wc-scheduling-mess","keywords":null,"creator":null,"video_url":null,"description":"LAHORE: Former Pakistan Cricket Board Management Committee chief Najam Sethi has criticised Board of Control for Cricket in India on Sunday for making a mess of World Cup schedule and said that it could have been avoided if they had listened to him.Sethi tweeted that BCCI should have agreed with...","content":"LAHORE: Former Pakistan Cricket Board (PCB) Management Committee chief Najam Sethi has criticised Board of Control for Cricket in India (BCCI) on Sunday for making a mess of World Cup schedule and said that it could have been avoided if they had listened to him. .ads_between_content{ height:auto; width:auto; clear: both; text-align: center; } .ads_between_content .story_ads{ } /*@media (max-width:600px){ .ads_between_content{ float:none; margin:0px auto; text-align: center; } }*/ Sethi tweeted that BCCI should have agreed with him when he asked them to move out Pakistan’s matches from India and they should have been held in a neutral country. He said that BCCI is changing the schedule after every few days, due to the security problems they are facing. BCCI has already changed the schedule of nine World Cup matches, as Pakistan’s match against India was moved to 14 October from 15 October, due to Navratri festival in Ahmedabad. Pakistan’s match against England was moved to 11 November from 12 November in Kolkata due to “Kaali Puja” festival. Now there are reports that Hyderabad government officials have asked the BCCI to change date of Pakistan-Sri Lanka match, which is scheduled to be held on 10 October. The match was scheduled to be held on 12 October earlier, but the day was changed due to the change of schedule of Pakistan-India match. Hyderabad government officials have reportedly told BCCI that another match is scheduled to be held in Hyderabad on 9 October and it would be difficult for them to provide security in back-to-back matches. Pakistan are also scheduled to play their opening match in Hyderabad on 6 October against Netherlands.","pubDate":"2023-08-21 01:00:00","image_url":null,"source_id":"thenews","source_priority":6495,"country":["pakistan"],"category":["sports"],"language":"english"},{"title":"Asia cup 2023 : शार्दुल की प्रसिद्ध? चहल की अश्विन ? कुणाची लागणार वर्णी; आशिया चषकासाठी टीम इंडियाचे शिलेदार आज ठरणार","link":"https://marathi.abplive.com/sports/cricket/asia-cup-and-world-cup-squad-it-could-be-shardul-vs-prasidh-for-extra-pacers-slot-all-eyes-on-rahul-iyer-fitness-1202876","keywords":["क्रिकेट"],"creator":["पीटीआय वृत्तसंस्था"],"video_url":null,"description":"Asia cup 2023 : आशिया चषकासाठी आज भारतीय संघाची निवड होणार आहे. निवड समीतीचे अध्यक्ष अजित आगरकर दुपारी पत्रकार परिषद घेऊन संघाची घोषणा करतील. जसप्रीत बुमराह, मोहम्मद शामी आणि मोहम्मद सिराज यांची निवड निश्चित मानली जातेय. त्यांच्या जोडीला अतिरिक्त वेगवान गोलंदाज कोण? हा प्रश्न निवड समितीपुढे आहे. त्यासाठी शार्दूल ठाकूर, प्रसिद्ध कृष्णा आणि जयदेव उनादकट यांच्यामध्ये स्पर्धा आहे. आशिया चषक आणि विश्वचषकासाठी कुणाची वर्णी लागणार ? याकडे लक्ष लागलेय.  एक जागा, तीन स्पर्धक - शार्दुल ठाकूर याने गेल्या काही वर्षांत मधल्या षटकात धारधार गोलंदाजी केली आहे. विकेट घेण्यासोबत धावा रोखण्यातही शार्दूल यशस्वी झालाय. त्याशिवाय तो तळाला फलंदाजीही करु शकतो. त्यामुळे शार्दुल ठाकूर याची निवड होण्याची शक्यता वर्तवण्यात येत आहे. पण निवड समिती प्रसिद्ध कृष्णा आणि जयदेव उनादकट यांच्या नावाचाही विचार करत आहे. प्रसिद्ध कृष्णा याने आय़र्लंड दौऱ्यातून दमदार कमबॅक केलेय. पहिल्याच सामन्यात त्याने भेदक मारा केलाय. दुसरीकडे जयदेव उनादकट याने दहा वर्षांनंतर संघात कमबॅक केलेय. शार्दुल ठाकूर याने वनडेमध्ये 58 विकेट घेतल्या आहेत. त्याशिवाय अर्धशतकही ठोकलेय. तळाला तो वेगाने धावा करण्यात तरबेज आहे. त्याशिवाय मधल्या षटकात तो विकेट घेतोच. त्याशिवाय प्रतिस्पर्धी संघाची भागिदारी तोडण्यातही शार्दुलचा हातखंडा आहे. त्यामुळे एका जागेसाठी या तीन गोलंदाजांमध्ये चुरस असल्याचे दिसतेय.  अय्यर-राहुल यांच्या फिटनेसकडे लक्ष -  श्रेयस अय्यर आणि केएल राहुल दुखापतीमुळे काही दिवसांपासून संघाबाहेर आहेत. बेंगळरु येथील एनसीएमध्ये त्यांनी फिटनेसवर काम केलेय. फलंदाजी करतानाचे त्यांचे व्हिडीओ सोशल मीडियावर व्हायरल झाले होते. एनसीएमधील सराव सामन्यातही या दोघांनी भाग घेतला होता. राहुल पूर्णपणे तंदुरुस्त असल्याचं समोर आलेय. पण अय्यरच्या फिटनेसबाबत अद्याप संभ्रम आहे.  फिरकी गोलंदाज कोण ? विश्वचषकासाठी पाच फिरकी गोलंदाजांमध्ये स्पर्धा आहे. अष्टपैलू रविंद्र जाडेजा, चायनामन कुलदीप यादव, युजवेंद्र चहल, अक्षर पटेल आणि आर. अश्विन यांच्यामध्ये स्पर्धा रंगणार आहे. जाडेजा, अश्विन आणि अक्षर पटेल हे फिंगर स्पिनर आहेत. तर कुलदीप यादव चायनामन गोलंदाज आहे. लेगस्पिनगर म्हणून युजवेंद्र चहल याने दावा ठोकलाय. आर. अश्विन याच्याकडे आंतरराष्ट्रीय सामन्याचा तगडा अनुभवा आहे. त्याशिवाय तो तळाला फलंदाजीही करु शकतो. रविंद्र जाडेजा आणि कुलदीप यादव यांचे स्थान जवळपास निश्चित आहे. उर्वरित दोन जागांसाठी तीन गोलंदाजात चुरस आहे.  आशिया चषकासाठी भारताचा संभाव्य संघ - रोहित शर्मा (कर्णधार), शुभमन गिल, विराट कोहली, केएल राहुल (विकेटकिपर, subject to fitness), श्रेयस अय्यर (subject to fitness), हार्दिक पांड्या, रविंद्र जाडेजा, जसप्रीत बुमराह, मोहम्मद शामी, मोहम्मद सिराज, कुलदीप यादव, इशान किशन (विकेटकिपर), अक्षर पटेल, शार्दुल ठाकूर, सूर्यकुमार यादव, तिलक वर्मा, युजवेंद्र चहल/आर अश्विन ","content":"Asia cup 2023 : आशिया चषकासाठी आज भारतीय संघाची निवड होणार आहे. निवड समीतीचे अध्यक्ष अजित आगरकर दुपारी पत्रकार परिषद घेऊन संघाची घोषणा करतील. जसप्रीत बुमराह, मोहम्मद शामी आणि मोहम्मद सिराज यांची निवड निश्चित मानली जातेय. त्यांच्या जोडीला अतिरिक्त वेगवान गोलंदाज कोण? हा प्रश्न निवड समितीपुढे आहे. त्यासाठी शार्दूल ठाकूर, प्रसिद्ध कृष्णा आणि जयदेव उनादकट यांच्यामध्ये स्पर्धा आहे. आशिया चषक आणि विश्वचषकासाठी कुणाची वर्णी लागणार ? याकडे लक्ष लागलेय. एक जागा, तीन स्पर्धक - शार्दुल ठाकूर याने गेल्या काही वर्षांत मधल्या षटकात धारधार गोलंदाजी केली आहे. विकेट घेण्यासोबत धावा रोखण्यातही शार्दूल यशस्वी झालाय. त्याशिवाय तो तळाला फलंदाजीही करु शकतो. त्यामुळे शार्दुल ठाकूर याची निवड होण्याची शक्यता वर्तवण्यात येत आहे. पण निवड समिती प्रसिद्ध कृष्णा आणि जयदेव उनादकट यांच्या नावाचाही विचार करत आहे. प्रसिद्ध कृष्णा याने आय़र्लंड दौऱ्यातून दमदार कमबॅक केलेय. पहिल्याच सामन्यात त्याने भेदक मारा केलाय. दुसरीकडे जयदेव उनादकट याने दहा वर्षांनंतर संघात कमबॅक केलेय. शार्दुल ठाकूर याने वनडेमध्ये 58 विकेट घेतल्या आहेत. त्याशिवाय अर्धशतकही ठोकलेय. तळाला तो वेगाने धावा करण्यात तरबेज आहे. त्याशिवाय मधल्या षटकात तो विकेट घेतोच. त्याशिवाय प्रतिस्पर्धी संघाची भागिदारी तोडण्यातही शार्दुलचा हातखंडा आहे. त्यामुळे एका जागेसाठी या तीन गोलंदाजांमध्ये चुरस असल्याचे दिसतेय. अय्यर-राहुल यांच्या फिटनेसकडे लक्ष - googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); श्रेयस अय्यर आणि केएल राहुल दुखापतीमुळे काही दिवसांपासून संघाबाहेर आहेत. बेंगळरु येथील एनसीएमध्ये त्यांनी फिटनेसवर काम केलेय. फलंदाजी करतानाचे त्यांचे व्हिडीओ सोशल मीडियावर व्हायरल झाले होते. एनसीएमधील सराव सामन्यातही या दोघांनी भाग घेतला होता. राहुल पूर्णपणे तंदुरुस्त असल्याचं समोर आलेय. पण अय्यरच्या फिटनेसबाबत अद्याप संभ्रम आहे. फिरकी गोलंदाज कोण ? विश्वचषकासाठी पाच फिरकी गोलंदाजांमध्ये स्पर्धा आहे. अष्टपैलू रविंद्र जाडेजा, चायनामन कुलदीप यादव, युजवेंद्र चहल, अक्षर पटेल आणि आर. अश्विन यांच्यामध्ये स्पर्धा रंगणार आहे. जाडेजा, अश्विन आणि अक्षर पटेल हे फिंगर स्पिनर आहेत. तर कुलदीप यादव चायनामन गोलंदाज आहे. लेगस्पिनगर म्हणून युजवेंद्र चहल याने दावा ठोकलाय. आर. अश्विन याच्याकडे आंतरराष्ट्रीय सामन्याचा तगडा अनुभवा आहे. त्याशिवाय तो तळाला फलंदाजीही करु शकतो. रविंद्र जाडेजा आणि कुलदीप यादव यांचे स्थान जवळपास निश्चित आहे. उर्वरित दोन जागांसाठी तीन गोलंदाजात चुरस आहे. आशिया चषकासाठी भारताचा संभाव्य संघ - रोहित शर्मा (कर्णधार), शुभमन गिल, विराट कोहली, केएल राहुल (विकेटकिपर, subject to fitness), श्रेयस अय्यर (subject to fitness), हार्दिक पांड्या, रविंद्र जाडेजा, जसप्रीत बुमराह, मोहम्मद शामी, मोहम्मद सिराज, कुलदीप यादव, इशान किशन (विकेटकिपर), अक्षर पटेल, शार्दुल ठाकूर, सूर्यकुमार यादव, तिलक वर्मा, युजवेंद्र चहल/आर अश्विन","pubDate":"2023-08-21 00:41:00","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/08/02/829e1a62defda80294456a42183783c11690972848877689_original.jpg","source_id":"abplive","source_priority":10959,"country":["india"],"category":["sports"],"language":"marathi"},{"title":"New Zealand's Southee happy with 'tough challenge' in UAE","link":"https://www.dubaieye1038.com/news/sports/new-zealands-southee-happy-with-tough-challenge-in-uae/","keywords":["Sports"],"creator":null,"video_url":null,"description":"New Zealand captain Tim Southee is happy with the tough challenge his team faced in the United Arab Emirates before eking out a 2-1 series victory on Sunday.","content":"New Zealand captain Tim Southee is happy with the tough challenge his team faced in the United Arab Emirates before eking out a 2-1 series victory on Sunday. The tourists, missing several frontline players, escaped to victory in the opener but were stunned in the second T20 match with UAE registering their first win against New Zealand in any format. New Zealand put up an improved display in Sunday's decider when Will Young smashed 56 in his first match of the series and Mark Chapman made 51 to help them post 166-5. The hosts managed 134-7, with Ben Lister claiming 3-35 for New Zealand in what Southee called their \"best performance of the series\". \"We expected a tough challenge in these conditions,\" Southee said referring to the heat after they prevailed by 32 runs at the Dubai International Cricket Stadium. \"As I said at the start of the series, they're a growing side, they're ever-improving and we saw that throughout the series they played extremely well in those first two games. \"We were able to build a partnership there with Chapman and Will Young – someone who came in after the first two games – so that was pleasing.\" New Zealand will travel to England later this month to play four T20 and as many one-day internationals before heading to India for the ODI World Cup in October-November.","pubDate":"2023-08-21 05:34:52","image_url":"https://mmo.aiircdn.com/265/64e30021bf37c.jpg","source_id":"dubaieye1038","source_priority":4083659,"country":["united arab emirates"],"category":["sports"],"language":"english"},{"title":"'Great headache to have': Jasprit Bumrah states picking India's Playing XI is hard job","link":"https://www.indiatvnews.com/sports/cricket/great-headache-to-have-jasprit-bumrah-states-picking-indias-playing-xi-is-hard-job-india-vs-ireland-t20i-series-ind-vs-ire-2023-08-21-887923","keywords":null,"creator":null,"video_url":null,"description":"As a young Indian team in Ireland builds up for the T20 World Cup 2024, stand-in T20I captain Jasprit Bumrah reflected on the job of a skipper to pick a Playing XI. India have fielded a second-string team and gave chances to many young players in a three-match T20I series against Ireland which India won with a game to go. The Men in Blue completed a series win with a victory in the second T20I by 33 runs on Sunday.","content":"As a young Indian team in Ireland builds up for the T20 World Cup 2024, stand-in T20I captain reflected on the job of a skipper to pick a Playing XI. India have fielded a second-string team and gave chances to many young players in a three-match T20I series against Ireland which India won with a game to go. The Men in Blue completed a series win with a victory in the second T20I by 33 runs on Sunday. Bumrah was a happy man after the match as he registered a T20I series win in his first attempt as a captain. However, he claimed that it is tough to pick a playing XI as everyone in the team is eager to play in the limited opportunities. \"I am feeling good. Today was a little drier. We thought it would get slower and hence batted first. It is very pleasing. It is tough to pick an XI. Great headache to have. Everyone is eager. Everyone is confident. All of us wanted to play for India. Eventually, everyone has to work their way up,\" Bumrah said after the win in Malahide. The team is without the services of key players like , , , , Shreyas Iyer, Suryakumar Yadav and Mohammed Siraj in the series against Ireland. This opened the doors for the likes of Yashasvi Jaiswal, Ruturaj Gaikwad, Rinku Singh and Ravi Bishnoi among others. The Indian pace merchant is happy to play without the baggage of having expectations pinned on him. \"If you play with baggage of expectation, you are under pressure. You have to keep those expectations aside. You are not doing yourself 100 per cent justice if you are playing with so many expectations,\" he added. India registered a thumping victory over the hosts Ireland in Malahide on Sunday to seal the three-match series with a game in hand. Vice-captain Ruturaj Gaikwad, wicket-keeper Sanju Samson and finisher Rinku Singh helped India get to 185 in the first innings. The bowlers then joined and despite a valiant effort from Andrew Balbirnie, India clinched the contest by 33 runs.","pubDate":"2023-08-21 03:30:57","image_url":null,"source_id":"indiatvnews","source_priority":10055,"country":["india"],"category":["sports"],"language":"english"},{"title":"Who Can Solve India's No. 4 Conundrum In Asia Cup 2023?","link":"https://sports.ndtv.com/cricket/who-can-solve-indias-no-4-conundrum-in-asia-cup-2023-4314400","keywords":null,"creator":null,"video_url":null,"description":"The absence of Rishabh Pant, KL Rahul and Shreyas Iyer has created a void in India's middle-order, with the management yet to finalise the no. 4 spot.","content":"With exactly nine days left for the start of the 2023 Asia Cup, the Board of Control for Cricket in India (BCCI) is expected to announce India's squad for the event on Monday. The squad announcement will take place during BCCI's meeting in Delhi, with both head coach Rahul Dravid and captain Rohit Sharma part of the conversation. From Jasprit Bumrah 's comeback in the ongoing T20I series against Ireland, to the fitnes off KL Rahul and Shreyas Iyer , the management will have plenty of tough calls to make before churning out the strongest-possible squad. Rahul and Iyer's injuries has created a void in India's middle-order, with the management yet to finalise the no. 4 spot. Rishabh Pant would've been another option, but he too is out for a lengthy period, having suffered a car crash last year. Iyer has scored the most number of runs for India at no. 4 in the current World Cup cycle, followed by Pant and Rahul. The Mumbai batter had establish himself as one of the most reliable batters, but an unfortunate injury now has the Indian team chasing shadows. India's possible options at no. 4? With Rahul and Iyer racing against time to be fit for the continental event, India will now have to pick between these four players -- Suryakumar Yadav , Ishan Kishan , Sanju Samson and Tilak Varma . Suryakumar Yadav is a prove match-winner when it comes to T20Is, but by his own admission, he has not able to replicate his riches in the One-Day Internationals. He averages 46.02 in T20Is, but only 24.33 in ODIs. Ishan Kishan and Sanju Samson are expected to make the Asia Cup, but only of them is likely to be in the XI as a wicketkeeper-batter. While both have previously batted at no. 4, the performances have been anything but convincing fro both parties. Tilak Varma has made a late claim for the no. 4 spot, following his debut tour of West Indies. Experts, Sourav Ganguly and Ravi Shastri , have vouched for his selection. If he gets into the side, Tilak could be a strong contender for the role. Also, India's don't have left-hander in their middle-order, and Tilak ticks that box too. Virat Kohli can also stake his claim for the role, having batted at no. 4 during India's triumphic World Cup campaign in 2011. However, he has only batted twice in that position. While Kishan, who has an ODI double century to his name, is more likely to fill in, Iyer and Rahul will force him out of the team once they are fit.","pubDate":"2023-08-21 02:36:48","image_url":null,"source_id":"ndtv","source_priority":1204,"country":["india"],"category":["sports"],"language":"english"},{"title":"दूसरा टी20 - गायकवाड़, सैमसन, रिंकू के शानदार प्रदर्शन से भारत ने आयरलैंड को 33 रनों से हराया","link":"https://www.khaskhabar.com/sports/cricket-news/sports-news-2nd-t20i--gaikwad-samson-rinku-shine-as-india-beat-ireland-by-33-runs-news-hindi-1-581303-KKN.html","keywords":null,"creator":null,"video_url":null,"description":"यहां रविवार को खेले गए दूसरा टी20 मैच में रुतुराज गायकवाड़ ने शानदार अर्धशतक","content":"डबलिन,। यहां रविवार को खेले गए दूसरा टी20 मैच में रुतुराज गायकवाड़ ने शानदार अर्धशतक के साथ भारत की पारी को आगे बढ़ाया, जबकि संजू सैमसन और रिंकू सिंह ने प्रभावशाली पारियां खेलकर भारत को 185-5 के प्रतिस्पर्धी स्कोर तक पहुंचाया और आयरलैंड को 33 रनों से हराकर तीन मैचों की सीरीज में 2-0 की अजेय बढ़त बना ली।सलामी बल्लेबाज एंडी बालबर्नी 51 गेंदों में 72 रन बनाकर आयरलैंड के लिए एकमात्र रनर थे, लेकिन यह व्यर्थ चला गया, क्योंकि भारत के गेंदबाजों ने शानदार जसप्रीत बुमरा के नेतृत्व में आयरलैंड को 152-8 पर रोक दिया। प्रसिद्ध कृष्णा ने पावरप्ले के अपने पहले ओवर में डबल स्ट्राइक की, साथ ही रवि बिश्‍नोई और अर्शदीप सिंह विकेटों के बीच मौजूद रहे।भारत के लिए गायकवाड़ ने 43 गेंदों में 58 रन बनाए और सैमसन के साथ 71 रनों की महत्वपूर्ण साझेदारी की। उन्होंने 26 गेंदों में 40 रनों की तेज पारी खेली। हालांकि ऐसा लग रहा था कि भारत पारी के अंत में कुछ गति खो रहा था, मगर रिंकू ने 21 गेंदों में 38 रन बनाए और शिवम दुबे 22 रन बनाकर नाबाद रहे। दोनों ने अंतिम 12 गेंदों में 42 रन बनाकर भारत को 180 के पार पहुंचाया।पहले बल्लेबाजी करने उतरे भारत के लिए दूसरे ओवर से रन बनने शुरू हो गए और गायकवाड़ ने जोश लिटिल को चार रन पर आउट कर दिया। यशस्वी जयसवाल ने बाएं हाथ के तेज गेंदबाज की गेंद पर चौका और छक्का लेने के लिए बैकफुट से दो बार घुमाया। जब बैरी मैक्कार्थी ने चौड़ाई दी, तो जयसवाल ने तुरंत उसे शॉर्ट थर्ड मैन के पार चार और रन के लिए कट कर दिया।गायकवाड़ ने लॉन्ग-ऑन और डीप स्क्वायर लेग के बीच आर्क में बैकफुट से तीन शानदार चौकों के साथ भारत को आगे बढ़ाया। दूसरे छोर से सैमसन ने तेज गेंदबाजों पर अपनी पांच चौकों में सही टाइमिंग और प्लेसमेंट पाया, जिसमें लिटिल की लगातार तीन गेंदें शामिल थीं।जब सैमसन ने 18 रन के 11वें ओवर में स्क्वायर लेग के पीछे से एक छक्का जड़ा तो मालाहाइड में खचाखच भरी भीड़ ने सबसे ज्यादा खुशी मनाई। उनकी 26 गेंदों की आक्रामक पारी 13वें ओवर में समाप्त हुई, जब उन्होंने लेग स्पिनर बेन व्हाइट की एक छोटी और वाइड गेंद के खिलाफ बड़ा शॉट लगाने के प्रयास में अपने स्टंप्स को काट दिया।गायकवाड़ ने व्हाइट की गेंद पर डीप स्क्वेयर लेग पर चार रन के लिए स्वीप करके अपना अर्धशतक पूरा किया और इसके बाद उसी ओवर में लॉन्ग-ऑन पर छक्का जड़ा। क्रीज पर उनका 43 गेंदों का प्रवास तब समाप्त हो गया जब 16वें ओवर में मैक्कार्थी की एक धीमी गेंद को लॉन्ग ऑफ पर चूक गए।पहली बार टी20ई में बल्लेबाजी कर रहे रिंकू ने दो चौके लगाए, इसके बाद मैक्कार्थी ने लॉन्ग-ऑन और अतिरिक्त कवर पर छक्के लगाए। दुबे अंतिम ओवर में फाइन लेग पर फ्लिक और मिडविकेट पर स्विंग के साथ छक्का मारने वाली पार्टी में शामिल हो गए। रिंकू ने ओवर का तीसरा छक्का डीप मिडविकेट पर एक गैर-जिम्मेदार पुल के साथ मारा, इससे पहले कि अगली ही गेंद पर वह आउट हो गए, जिससे भारत 180 का आंकड़ा पार कर गया।आयरलैंड के लक्ष्य का पीछा करने की शुरुआत बलबर्नी द्वारा दूसरे ओवर में अर्शदीप पर दो चौके लगाने से हुई। लेकिन कृष्णा ने अगले ओवर में शॉर्ट गेंदों पर पॉल स्टर्लिंग और लोर्कन टकर को आउट करके आयरलैंड को बैकफुट पर धकेल दिया। बिश्‍नाेई ने पावर-प्ले में हैरी टेक्टर को आउट कर आयरलैंड को दूसरा झटका दिया।लेकिन बालबर्नी ने आगे बढ़ना जारी रखा और आयरलैंड के लक्ष्य को फिर से जीवित कर दिया। उन्होंने पावर-प्ले समाप्त होने के तुरंत बाद वाशिंगटन सुंदर की गेंद पर दो चौके लगाकर शुरुआत की। हालांकि कर्टिस कैंपर बिश्‍नाेई को पॉइंट करने के लिए रिवर्स-पैडलिंग के बाद गिर गए, बलबर्नी ने दुबे को दो छक्के लगाए और बिश्‍नाेई को चार रन देकर अपना अर्धशतक पूरा किया। इसके बावजूद आयरलैंड की आवश्यक रन-रेट बढ़ती रही, हालांकि बालबर्नी और जॉर्ज डॉकरेल ने कृष्णा और बिश्‍नाेई की गेंद पर एक-एक छक्का लगाया। जब डॉकरेल को बिश्‍नाेई ने रन आउट किया तो भारत का पलड़ा मजबूत हो गया, जबकि बालबर्नी की गेंद पर अर्शदीप की गेंद पर सैमसन ने विकेट के पीछे कैच कर लिया। पारी के अंत में बुमराह ने मैक्कार्थी और मार्क अडायर को आउट किया, जिन्होंने अर्शदीप और प्रसिद्ध पर तीन छक्के लगाए। भारतीय कप्तान ने अपने चार ओवरों में कोई बाउंड्री नहीं दी, जिनमें से एक खेल के आखिरी ओवर में मेडन थी, क्योंकि मेहमान टीम ने अब एक मैच शेष रहते हुए श्रृंखला जीत ली है। संक्षिप्त स्कोर : भारत ने 20 ओवर में 185-5 (रुतुराज गायकवाड़ 58, संजू सैमसन 40, बैरी मैक्कार्थी 2-36, क्रेग यंग 1-29) ने आयरलैंड को 20 ओवर में 152-8 से हराया (एंडी बालबर्नी 72, जसप्रीत बुमरा 2-15, प्रसिद्ध कृष्णा 2-29) 33 रन से।","pubDate":"2023-08-21 01:58:26","image_url":null,"source_id":"khaskhabar","source_priority":5174519,"country":["india"],"category":["sports"],"language":"hindi"},{"title":"India seal series with easy win","link":"https://www.tribuneindia.com/news/sports/india-seal-series-with-easy-win-536788","keywords":null,"creator":null,"video_url":null,"description":"Dublin, August 20India beat Ireland by 33 runs to win the second T20 International and take an unassailable 2-0 lead in the three-match series.Batting first, India posted 185/5, riding on vice-captain Ruturaj Gaikwad's 58 off 43 balls, Sanju Samson's 40 off 26 deliveries and Rinku Singh's 38 off 21 balls.Today, I could run in and bowl a little faster. We wanted to put runs on the board and we thought the pitch will get slower. It did get slower. Jasprit Bumrah, India captainIn reply, Ireland were restricted to 152/8 with Prasidh Krishna taking 2/29 while Ravi Bishnoi scalped 2/37. Skipper Jasprit Bumrah had figures of 2/15. For Ireland, Andrew Balbirnie scored 72 off 51 balls.Brief Scores: India: 185/5 (Gaikwad 58, Samson 40, Rinku 38; McCarthy 2/36, Young 1/29); Ireland: 152/8 (Balbirnie 72; Bumrah 2/15, Krishna 2/29, Bishnoi 2/37).","content":"PTI Dublin, August 20 India beat Ireland by 33 runs to win the second T20 International and take an unassailable 2-0 lead in the three-match series. Batting first, India posted 185/5, riding on vice-captain Ruturaj Gaikwad’s 58 off 43 balls, Sanju Samson’s 40 off 26 deliveries and Rinku Singh’s 38 off 21 balls. Today, I could run in and bowl a little faster. We wanted to put runs on the board and we thought the pitch will get slower. It did get slower. Jasprit Bumrah, India captain In reply, Ireland were restricted to 152/8 with Prasidh Krishna taking 2/29 while Ravi Bishnoi scalped 2/37. Skipper Jasprit Bumrah had figures of 2/15. For Ireland, Andrew Balbirnie scored 72 off 51 balls. Brief Scores: India: 185/5 (Gaikwad 58, Samson 40, Rinku 38; McCarthy 2/36, Young 1/29); Ireland: 152/8 (Balbirnie 72; Bumrah 2/15, Krishna 2/29, Bishnoi 2/37). #Cricket","pubDate":"2023-08-21 01:38:19","image_url":"https://englishtribuneimages.blob.core.windows.net/gallary-content/2023/8/2023_8$largeimg_1401186234.jpg","source_id":"tribuneindia","source_priority":7916,"country":["india"],"category":["sports"],"language":"english"},{"title":"FIFA Women’s World Cup 2023 makes history as almost 19 million people tune in to the tournament","link":"https://thewest.com.au/sport/fifa-women-s-world-cup/fifa-womens-world-cup-2023-makes-history-as-almost-19-million-people-tune-in-to-the-tournament-c-11653653","keywords":null,"creator":["Lauren Higham"],"video_url":null,"description":"It’s official – Australians have been converted to soccer fanatics after record numbers tuned in to watch the FIFA Women’s World Cup 2023 tournament.","content":"It’s official – Australians have been converted to soccer fanatics after almost 19 million people tuned in to watch the FIFA Women’s World Cup. A record 18.6 million people — including the 5.54 million people who tuned in to Sunday night’s final match, where Spain triumphed over England 2-0 — tuned in across the tournament, making it the biggest broadcast and digital viewing event in Australian history. The final was the number one broadcast program on Sunday night nationally and in the capital cities in all people, 25 to 54s and 16 to 39s. It drew an average national total audience of 3.08 million on Seven and 7plus. Saturday’s playoff for third place between Australia and Sweden also saw huge numbers, with an average audience of 3.38 million witnessing the Matildas’ heartbreaking 2-0 loss. The match was the number one broadcast program on the night nationally and in the capital cities in all people, 25 to 54s and 16 to 39s. The Matildas’ semifinal against England on August 16 became the most-watched TV program in more than two decades, seeing an average audience of 7.2 million. It also made history as the most streamed event ever in Australia, with 957,000 viewers on 7plus. Managing Director Seven Melbourne and Head of Network Sport, Lewis Martin, said Seven’s broadcast of the Women’s World Cup highlighted the “growing passion” for women’s football in Australia. “Seven’s unparalleled live and free coverage of the event, underpinned by our team of passionate, expert commentators, reaffirms our ongoing commitment to celebrate and grow both men’s and women’s sports across all codes. From the AFLW and the WBBL to women’s international cricket and more, Seven has a strong legacy of bringing the best in sports to Australians that inspires the next generation,” he said. “This World Cup has been like no other and has set a new benchmark for future tournaments. The Matildas have been nothing short of spectacular, and we’re honoured to have shared their remarkable journey.” Seven West Media Chief Revenue Officer, Kurt Burnette, agreed, noting the sporting event “firmly cemented itself” as the biggest broadcast and digital viewing event in Australian history. “We knew it would be a cultural game changer, and it’s been just that – categorically shaping culture and changing behaviours. Audience numbers on Seven and 7plus, in partnership with Optus, surpassed our expectations to deliver incredible results for our brand partners while creating a halo effect across the rest of our schedule like we’ve never seen before,” he said. “No other medium other can create the same mass cultural impact as TV, and we’re proud that Seven’s coverage united Australia, created a shared sense of pride across the nation and produced lasting memories that will inspire a new generation.” Sign up for our emails","pubDate":"2023-08-21 01:35:14","image_url":"https://images.thewest.com.au/publication/C-11653653/63bb28c01159b8909a0689274ed1b2da66b4a6eb-16x9-x94y280w1234h694.jpg","source_id":"thewest","source_priority":106740,"country":["australia"],"category":["sports"],"language":"english"},{"title":"रिंकू सिंह 2023 में जड़ चुके 23 छक्के, फिर क्यों कहा- 10 साल बाद आया मौका, कप्तान बुमराह ने लगाया गले","link":"https://hindi.news18.com/cricket/rinku-singh-showed-amazing-in-his-debut-t20i-innings-team-india-won-series-against-ireland-jasprit-bumrah-7300289.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"Rinku Singh Player Of The Match: रिंकू सिंह ने अपनी इंटरनेशनल करियर की पहली पारी में ताबड़तोड़ बल्लेबाजी की. 25 साल के बैटर को प्लेयर ऑफ द मैच भी चुना गया. इसी के साथ टीम इंडिया ने आयरलैंड के खिलाफ दूसरा टी20 मैच जीतकर सीरीज पर भी कब्जा कर लिया है.","content":"Rinku Singh Player Of The Match: रिंकू सिंह ने ताबड़तोड़ पारी खेली और प्लेयर ऑफ द मैच रहे. (Bcci Twitter) नई दिल्ली. जसप्रीत बुमराह की कप्तानी में टीम इंडिया ने आयरलैंड के खिलाफ टी20 सीरीज में 2-0 की अजेय बढ़त बना ली है. भारतीय टीम ने दूसरे मैच में मेजबान टीम को 33 रन से हराया. सीरीज के पहले मैच में भारत को डकवर्थ लुइस नियम से 2 रन से जीत मिली थी. दूसरे मैच में की बात करें, तो भारतीय टीम ने पहले खेलते हुए 5 विकेट पर 185 रन का अच्छा स्कोर खड़ा किया. ऋतुराज गायकवाड़ ने 58, संजू सैमसन ने 40 और रिंकू सिंह ने 38 रन बनाए. रिंकू सिंह 2023 में अब तक टी20 के डेथ ओवर्स में 23 छक्के लगा चुके हैं. उनसे अधिक छक्के अन्य कोई भारतीय नहीं लगा सका है. जवाब में आयरलैंड की टीम निर्धारित 20 ओवर में 8 विकेट पर 152 रन ही बना सकी. सीरीज का तीसरा और अंतिम मुकाबला 23 अगस्त को खेला जाएगा. 25 साल के रिंकू सिंह पहली बार किसी इंटरनेशनल मैच में बल्लेबाजी करने उतरे और प्लेयर ऑफ द मैच भी रहे. उन्होंने 21 गेंद पर ताबड़तोड़ 38 रन बनाए. स्ट्राइक रेट 181 का रहा. 2 चौका और 3 छक्का जड़ा. मैच के बाद रिंकू ने कहा कि मुझे अपनी बल्लेबाजी पर भरोसा था और मैं आईपीएल के अनुभव का उपयोग करने की कोशिश कर रहा था. मैं पारी को अंत तक ले जाने की कोशिश कर रहा था. उन्होंने कहा कि मैं 10 साल से क्रिकेट खेल रहा हूं और अब कड़ी मेहनत का इनाम मिल रहा है. इंटरनेशनल क्रिकेट में पहले ही मैच में बल्लेबाजी करते हुए मैन ऑफ द मैच का पुरस्कार पाकर खुश हूं. मैच खत्म होने के बाद कप्तान जसप्रीत बुमराह ने रिंकू सिंह को गले भी लगाया. डेथ ओवर्स में स्ट्राइक रेट 200 का साल 2023 की बात करें, तो टी20 के डेथ ओवर्स में रिंकू सिंह का स्ट्राइक रेट 200 का है, जो बेहतरीन है. रिंकू ने इस साल अब तक 13 पारियों में 133 गेंद पर 266 रन बनाए हैं. औसत 38 का रहा है. इस दौरान उन्होंने 23 छक्के और 16 चौके लगाए हैं. यानी रिंकू अंतिम ओवरों में चौके से अधिक छक्के लगा रहे हैं. डेथ ओवर्स की बात करें, तो इस साल रिंकू से अधिक छक्के सिर्फ ऑस्ट्रेलिया के टिम डेविड ही लगा सके हैं. डेविड ने 22 पारियों में 28 छक्के जड़े हैं. सिर्फ सूर्यकुमार यादव से पीछे टी20 इंटरनेशनल में उप्र के रिंकू सिंह ने ताबड़तोड़ शुरुआत की. उन्होंने 181 के स्ट्राइक रेट से रन कूटे. भारतीय खिलाड़ियों के टी20 इंटरनेशनल के रिकॉर्ड को देखें, तो पहले मैच में स्ट्राइक रेट के मामले में रिंकू सिंह सिर्फ सूर्यकुमार यादव से पीछे हैं. टी20 के नंबर-1 बैटर सूर्या ने अपनी टी20 इंटरनेशनल की पहली पारी में 184 के स्ट्राइक रेट से रन बनाए थे. इसके अलावा तिलक वर्मा ने 177 तो ईशान किशन ने 175 के स्ट्राइक रेट से रन बनाए. Asia Cup की पिछली गलती से टीम को बचना होगा, गंवा दिया था वर्ल्ड कप! क्या रोहित और द्रविड़ लेंगे सबक? रिंकू सिंह ने अपनी पारी में 3 छक्के लगाए. वे टी20 इंटरनेशनल की पहली पारी में सबसे अधिक छक्के जड़ने के मामले में संयुक्त रूप से दूसरे नंबर पर हैं. ईशान किशान ने भारत की ओर से डेब्यू पारी में सबसे अधिक 4 छक्के लगाए हैं. इसके अलावा रिंकू सिंह, राहुल द्रविड़, मुरली विजय, सूर्यकुमार यादव और तिलक वर्मा ने 3-3 छक्के जड़े. आईपीएल 2023 में कोलकाता नाइट राइडर्स की ओर से खेलते हुए रिंकू सिंह ने 20 ओवरों की अंतिम 5 गेंद पर 5 छक्के जड़कर गुजरात टाइटंस के खिलाफ टीम को रोमांचक जीत दिलाई थी. रिंकू सिंह के ओवरऑल टी20 के रिकॉर्ड को देखें, ताे वे अब तक 82 पारियों में 31 की औसत से 1806 रन बना चुके हैं. 10 अर्धशतक ठोका है. स्ट्राइक रेट 142 का है. उन्होंने अपना पहला टी20 मैच साल 2014 में खेला था. यानी लगभग 9 साल पहले. . Tags: Jasprit Bumrah , Rinku Singh , Team india 25 हजार से करोड़पति बनाने वाला शेयर! 20 साल में दिया ऐसा धांसू रिटर्न, हर वर्ष 22 गुना बढ़ा निवेशकों का पैसा मुंह फुलाए बैठी नन्ही बच्ची, कभी अक्षय कुमार की थीं दीवानी, आज कहलाती हैं बॉलीवुड क्वीन, आंखों में छिपी पहचान हार्दिक पंड्या पर अहम फैसला! चयनकर्ता बैठक में उठा सकते हैं कड़ा कदम, एशिया कप से पहले लगेगा झटका?","pubDate":"2023-08-21 01:08:59","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/08/rinku-singh-2023-16925800173x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","source_priority":6509,"country":["india"],"category":["sports"],"language":"hindi"},{"title":"Test cricketer Naushad Ali passes away","link":"https://www.thenews.com.pk/print/1102138-test-cricketer-naushad-ali-passes-away","keywords":null,"creator":null,"video_url":null,"description":"ISLAMABAD: A human being of great qualities and a Test cricketer of incredible skill, Col Naushad Ali breathed his last at Shifa Hospital due to lung failure Sunday morning.Naushad, 79, served the game throughout his life in all capacities barring the Chairman Pakistan Cricket Board. The...","content":"ISLAMABAD: A human being of great qualities and a Test cricketer of incredible skill, Col (rtd) Naushad Ali breathed his last at Shifa Hospital due to lung failure Sunday morning. .ads_between_content{ height:auto; width:auto; clear: both; text-align: center; } .ads_between_content .story_ads{ } /*@media (max-width:600px){ .ads_between_content{ float:none; margin:0px auto; text-align: center; } }*/ Naushad, 79, served the game throughout his life in all capacities barring the Chairman Pakistan Cricket Board. The wicketkeeper-batsman started his Test career in the early sixties and toured with the Pakistani team to Australia and New Zealand in 1964 and England in 1971. Naushad played six Tests, all versus New Zealand. Unlike modern-day cricket, one rarely get opportunities of playing Test cricket in those days when even one tour or a series a year was considered sufficient to give players the required exposure. Top teams usually met once in a couple of years and even playing six Tests was considered a big achievement. Naushad in between joined the Army which halted his career as a cricketer. He then started his career as an official and even managed teams in the early eighties. He also served as Chief Executive PCB with Mujeebur Rehman for a brief stint. He also worked as chief selector and selector on numerous occasions in the nineties and early 2000s.","pubDate":"2023-08-21 01:00:00","image_url":null,"source_id":"thenews","source_priority":6495,"country":["pakistan"],"category":["sports"],"language":"english"},{"title":"Sethi slams BCCI over WC scheduling mess","link":"https://www.thenews.com.pk/print/1102134-sethi-slams-bcci-over-wc-scheduling-mess","keywords":null,"creator":null,"video_url":null,"description":"LAHORE: Former Pakistan Cricket Board Management Committee chief Najam Sethi has criticised Board of Control for Cricket in India on Sunday for making a mess of World Cup schedule and said that it could have been avoided if they had listened to him.Sethi tweeted that BCCI should have agreed with...","content":"LAHORE: Former Pakistan Cricket Board (PCB) Management Committee chief Najam Sethi has criticised Board of Control for Cricket in India (BCCI) on Sunday for making a mess of World Cup schedule and said that it could have been avoided if they had listened to him. .ads_between_content{ height:auto; width:auto; clear: both; text-align: center; } .ads_between_content .story_ads{ } /*@media (max-width:600px){ .ads_between_content{ float:none; margin:0px auto; text-align: center; } }*/ Sethi tweeted that BCCI should have agreed with him when he asked them to move out Pakistan’s matches from India and they should have been held in a neutral country. He said that BCCI is changing the schedule after every few days, due to the security problems they are facing. BCCI has already changed the schedule of nine World Cup matches, as Pakistan’s match against India was moved to 14 October from 15 October, due to Navratri festival in Ahmedabad. Pakistan’s match against England was moved to 11 November from 12 November in Kolkata due to “Kaali Puja” festival. Now there are reports that Hyderabad government officials have asked the BCCI to change date of Pakistan-Sri Lanka match, which is scheduled to be held on 10 October. The match was scheduled to be held on 12 October earlier, but the day was changed due to the change of schedule of Pakistan-India match. Hyderabad government officials have reportedly told BCCI that another match is scheduled to be held in Hyderabad on 9 October and it would be difficult for them to provide security in back-to-back matches. Pakistan are also scheduled to play their opening match in Hyderabad on 6 October against Netherlands.","pubDate":"2023-08-21 01:00:00","image_url":null,"source_id":"thenews","source_priority":6495,"country":["pakistan"],"category":["sports"],"language":"english"},{"title":"Asia cup 2023 : शार्दुल की प्रसिद्ध? चहल की अश्विन ? कुणाची लागणार वर्णी; आशिया चषकासाठी टीम इंडियाचे शिलेदार आज ठरणार","link":"https://marathi.abplive.com/sports/cricket/asia-cup-and-world-cup-squad-it-could-be-shardul-vs-prasidh-for-extra-pacers-slot-all-eyes-on-rahul-iyer-fitness-1202876","keywords":["क्रिकेट"],"creator":["पीटीआय वृत्तसंस्था"],"video_url":null,"description":"Asia cup 2023 : आशिया चषकासाठी आज भारतीय संघाची निवड होणार आहे. निवड समीतीचे अध्यक्ष अजित आगरकर दुपारी पत्रकार परिषद घेऊन संघाची घोषणा करतील. जसप्रीत बुमराह, मोहम्मद शामी आणि मोहम्मद सिराज यांची निवड निश्चित मानली जातेय. त्यांच्या जोडीला अतिरिक्त वेगवान गोलंदाज कोण? हा प्रश्न निवड समितीपुढे आहे. त्यासाठी शार्दूल ठाकूर, प्रसिद्ध कृष्णा आणि जयदेव उनादकट यांच्यामध्ये स्पर्धा आहे. आशिया चषक आणि विश्वचषकासाठी कुणाची वर्णी लागणार ? याकडे लक्ष लागलेय.  एक जागा, तीन स्पर्धक - शार्दुल ठाकूर याने गेल्या काही वर्षांत मधल्या षटकात धारधार गोलंदाजी केली आहे. विकेट घेण्यासोबत धावा रोखण्यातही शार्दूल यशस्वी झालाय. त्याशिवाय तो तळाला फलंदाजीही करु शकतो. त्यामुळे शार्दुल ठाकूर याची निवड होण्याची शक्यता वर्तवण्यात येत आहे. पण निवड समिती प्रसिद्ध कृष्णा आणि जयदेव उनादकट यांच्या नावाचाही विचार करत आहे. प्रसिद्ध कृष्णा याने आय़र्लंड दौऱ्यातून दमदार कमबॅक केलेय. पहिल्याच सामन्यात त्याने भेदक मारा केलाय. दुसरीकडे जयदेव उनादकट याने दहा वर्षांनंतर संघात कमबॅक केलेय. शार्दुल ठाकूर याने वनडेमध्ये 58 विकेट घेतल्या आहेत. त्याशिवाय अर्धशतकही ठोकलेय. तळाला तो वेगाने धावा करण्यात तरबेज आहे. त्याशिवाय मधल्या षटकात तो विकेट घेतोच. त्याशिवाय प्रतिस्पर्धी संघाची भागिदारी तोडण्यातही शार्दुलचा हातखंडा आहे. त्यामुळे एका जागेसाठी या तीन गोलंदाजांमध्ये चुरस असल्याचे दिसतेय.  अय्यर-राहुल यांच्या फिटनेसकडे लक्ष -  श्रेयस अय्यर आणि केएल राहुल दुखापतीमुळे काही दिवसांपासून संघाबाहेर आहेत. बेंगळरु येथील एनसीएमध्ये त्यांनी फिटनेसवर काम केलेय. फलंदाजी करतानाचे त्यांचे व्हिडीओ सोशल मीडियावर व्हायरल झाले होते. एनसीएमधील सराव सामन्यातही या दोघांनी भाग घेतला होता. राहुल पूर्णपणे तंदुरुस्त असल्याचं समोर आलेय. पण अय्यरच्या फिटनेसबाबत अद्याप संभ्रम आहे.  फिरकी गोलंदाज कोण ? विश्वचषकासाठी पाच फिरकी गोलंदाजांमध्ये स्पर्धा आहे. अष्टपैलू रविंद्र जाडेजा, चायनामन कुलदीप यादव, युजवेंद्र चहल, अक्षर पटेल आणि आर. अश्विन यांच्यामध्ये स्पर्धा रंगणार आहे. जाडेजा, अश्विन आणि अक्षर पटेल हे फिंगर स्पिनर आहेत. तर कुलदीप यादव चायनामन गोलंदाज आहे. लेगस्पिनगर म्हणून युजवेंद्र चहल याने दावा ठोकलाय. आर. अश्विन याच्याकडे आंतरराष्ट्रीय सामन्याचा तगडा अनुभवा आहे. त्याशिवाय तो तळाला फलंदाजीही करु शकतो. रविंद्र जाडेजा आणि कुलदीप यादव यांचे स्थान जवळपास निश्चित आहे. उर्वरित दोन जागांसाठी तीन गोलंदाजात चुरस आहे.  आशिया चषकासाठी भारताचा संभाव्य संघ - रोहित शर्मा (कर्णधार), शुभमन गिल, विराट कोहली, केएल राहुल (विकेटकिपर, subject to fitness), श्रेयस अय्यर (subject to fitness), हार्दिक पांड्या, रविंद्र जाडेजा, जसप्रीत बुमराह, मोहम्मद शामी, मोहम्मद सिराज, कुलदीप यादव, इशान किशन (विकेटकिपर), अक्षर पटेल, शार्दुल ठाकूर, सूर्यकुमार यादव, तिलक वर्मा, युजवेंद्र चहल/आर अश्विन ","content":"Asia cup 2023 : आशिया चषकासाठी आज भारतीय संघाची निवड होणार आहे. निवड समीतीचे अध्यक्ष अजित आगरकर दुपारी पत्रकार परिषद घेऊन संघाची घोषणा करतील. जसप्रीत बुमराह, मोहम्मद शामी आणि मोहम्मद सिराज यांची निवड निश्चित मानली जातेय. त्यांच्या जोडीला अतिरिक्त वेगवान गोलंदाज कोण? हा प्रश्न निवड समितीपुढे आहे. त्यासाठी शार्दूल ठाकूर, प्रसिद्ध कृष्णा आणि जयदेव उनादकट यांच्यामध्ये स्पर्धा आहे. आशिया चषक आणि विश्वचषकासाठी कुणाची वर्णी लागणार ? याकडे लक्ष लागलेय. एक जागा, तीन स्पर्धक - शार्दुल ठाकूर याने गेल्या काही वर्षांत मधल्या षटकात धारधार गोलंदाजी केली आहे. विकेट घेण्यासोबत धावा रोखण्यातही शार्दूल यशस्वी झालाय. त्याशिवाय तो तळाला फलंदाजीही करु शकतो. त्यामुळे शार्दुल ठाकूर याची निवड होण्याची शक्यता वर्तवण्यात येत आहे. पण निवड समिती प्रसिद्ध कृष्णा आणि जयदेव उनादकट यांच्या नावाचाही विचार करत आहे. प्रसिद्ध कृष्णा याने आय़र्लंड दौऱ्यातून दमदार कमबॅक केलेय. पहिल्याच सामन्यात त्याने भेदक मारा केलाय. दुसरीकडे जयदेव उनादकट याने दहा वर्षांनंतर संघात कमबॅक केलेय. शार्दुल ठाकूर याने वनडेमध्ये 58 विकेट घेतल्या आहेत. त्याशिवाय अर्धशतकही ठोकलेय. तळाला तो वेगाने धावा करण्यात तरबेज आहे. त्याशिवाय मधल्या षटकात तो विकेट घेतोच. त्याशिवाय प्रतिस्पर्धी संघाची भागिदारी तोडण्यातही शार्दुलचा हातखंडा आहे. त्यामुळे एका जागेसाठी या तीन गोलंदाजांमध्ये चुरस असल्याचे दिसतेय. अय्यर-राहुल यांच्या फिटनेसकडे लक्ष - googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); श्रेयस अय्यर आणि केएल राहुल दुखापतीमुळे काही दिवसांपासून संघाबाहेर आहेत. बेंगळरु येथील एनसीएमध्ये त्यांनी फिटनेसवर काम केलेय. फलंदाजी करतानाचे त्यांचे व्हिडीओ सोशल मीडियावर व्हायरल झाले होते. एनसीएमधील सराव सामन्यातही या दोघांनी भाग घेतला होता. राहुल पूर्णपणे तंदुरुस्त असल्याचं समोर आलेय. पण अय्यरच्या फिटनेसबाबत अद्याप संभ्रम आहे. फिरकी गोलंदाज कोण ? विश्वचषकासाठी पाच फिरकी गोलंदाजांमध्ये स्पर्धा आहे. अष्टपैलू रविंद्र जाडेजा, चायनामन कुलदीप यादव, युजवेंद्र चहल, अक्षर पटेल आणि आर. अश्विन यांच्यामध्ये स्पर्धा रंगणार आहे. जाडेजा, अश्विन आणि अक्षर पटेल हे फिंगर स्पिनर आहेत. तर कुलदीप यादव चायनामन गोलंदाज आहे. लेगस्पिनगर म्हणून युजवेंद्र चहल याने दावा ठोकलाय. आर. अश्विन याच्याकडे आंतरराष्ट्रीय सामन्याचा तगडा अनुभवा आहे. त्याशिवाय तो तळाला फलंदाजीही करु शकतो. रविंद्र जाडेजा आणि कुलदीप यादव यांचे स्थान जवळपास निश्चित आहे. उर्वरित दोन जागांसाठी तीन गोलंदाजात चुरस आहे. आशिया चषकासाठी भारताचा संभाव्य संघ - रोहित शर्मा (कर्णधार), शुभमन गिल, विराट कोहली, केएल राहुल (विकेटकिपर, subject to fitness), श्रेयस अय्यर (subject to fitness), हार्दिक पांड्या, रविंद्र जाडेजा, जसप्रीत बुमराह, मोहम्मद शामी, मोहम्मद सिराज, कुलदीप यादव, इशान किशन (विकेटकिपर), अक्षर पटेल, शार्दुल ठाकूर, सूर्यकुमार यादव, तिलक वर्मा, युजवेंद्र चहल/आर अश्विन","pubDate":"2023-08-21 00:41:00","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/08/02/829e1a62defda80294456a42183783c11690972848877689_original.jpg","source_id":"abplive","source_priority":10959,"country":["india"],"category":["sports"],"language":"marathi"},{"title":"New Zealand's Southee happy with 'tough challenge' in UAE","link":"https://www.dubaieye1038.com/news/sports/new-zealands-southee-happy-with-tough-challenge-in-uae/","keywords":["Sports"],"creator":null,"video_url":null,"description":"New Zealand captain Tim Southee is happy with the tough challenge his team faced in the United Arab Emirates before eking out a 2-1 series victory on Sunday.","content":"New Zealand captain Tim Southee is happy with the tough challenge his team faced in the United Arab Emirates before eking out a 2-1 series victory on Sunday. The tourists, missing several frontline players, escaped to victory in the opener but were stunned in the second T20 match with UAE registering their first win against New Zealand in any format. New Zealand put up an improved display in Sunday's decider when Will Young smashed 56 in his first match of the series and Mark Chapman made 51 to help them post 166-5. The hosts managed 134-7, with Ben Lister claiming 3-35 for New Zealand in what Southee called their \"best performance of the series\". \"We expected a tough challenge in these conditions,\" Southee said referring to the heat after they prevailed by 32 runs at the Dubai International Cricket Stadium. \"As I said at the start of the series, they're a growing side, they're ever-improving and we saw that throughout the series they played extremely well in those first two games. \"We were able to build a partnership there with Chapman and Will Young – someone who came in after the first two games – so that was pleasing.\" New Zealand will travel to England later this month to play four T20 and as many one-day internationals before heading to India for the ODI World Cup in October-November.","pubDate":"2023-08-21 05:34:52","image_url":"https://mmo.aiircdn.com/265/64e30021bf37c.jpg","source_id":"dubaieye1038","source_priority":4083659,"country":["united arab emirates"],"category":["sports"],"language":"english"},{"title":"'Great headache to have': Jasprit Bumrah states picking India's Playing XI is hard job","link":"https://www.indiatvnews.com/sports/cricket/great-headache-to-have-jasprit-bumrah-states-picking-indias-playing-xi-is-hard-job-india-vs-ireland-t20i-series-ind-vs-ire-2023-08-21-887923","keywords":null,"creator":null,"video_url":null,"description":"As a young Indian team in Ireland builds up for the T20 World Cup 2024, stand-in T20I captain Jasprit Bumrah reflected on the job of a skipper to pick a Playing XI. India have fielded a second-string team and gave chances to many young players in a three-match T20I series against Ireland which India won with a game to go. The Men in Blue completed a series win with a victory in the second T20I by 33 runs on Sunday.","content":"As a young Indian team in Ireland builds up for the T20 World Cup 2024, stand-in T20I captain reflected on the job of a skipper to pick a Playing XI. India have fielded a second-string team and gave chances to many young players in a three-match T20I series against Ireland which India won with a game to go. The Men in Blue completed a series win with a victory in the second T20I by 33 runs on Sunday. Bumrah was a happy man after the match as he registered a T20I series win in his first attempt as a captain. However, he claimed that it is tough to pick a playing XI as everyone in the team is eager to play in the limited opportunities. \"I am feeling good. Today was a little drier. We thought it would get slower and hence batted first. It is very pleasing. It is tough to pick an XI. Great headache to have. Everyone is eager. Everyone is confident. All of us wanted to play for India. Eventually, everyone has to work their way up,\" Bumrah said after the win in Malahide. The team is without the services of key players like , , , , Shreyas Iyer, Suryakumar Yadav and Mohammed Siraj in the series against Ireland. This opened the doors for the likes of Yashasvi Jaiswal, Ruturaj Gaikwad, Rinku Singh and Ravi Bishnoi among others. The Indian pace merchant is happy to play without the baggage of having expectations pinned on him. \"If you play with baggage of expectation, you are under pressure. You have to keep those expectations aside. You are not doing yourself 100 per cent justice if you are playing with so many expectations,\" he added. India registered a thumping victory over the hosts Ireland in Malahide on Sunday to seal the three-match series with a game in hand. Vice-captain Ruturaj Gaikwad, wicket-keeper Sanju Samson and finisher Rinku Singh helped India get to 185 in the first innings. The bowlers then joined and despite a valiant effort from Andrew Balbirnie, India clinched the contest by 33 runs.","pubDate":"2023-08-21 03:30:57","image_url":null,"source_id":"indiatvnews","source_priority":10055,"country":["india"],"category":["sports"],"language":"english"},{"title":"Who Can Solve India's No. 4 Conundrum In Asia Cup 2023?","link":"https://sports.ndtv.com/cricket/who-can-solve-indias-no-4-conundrum-in-asia-cup-2023-4314400","keywords":null,"creator":null,"video_url":null,"description":"The absence of Rishabh Pant, KL Rahul and Shreyas Iyer has created a void in India's middle-order, with the management yet to finalise the no. 4 spot.","content":"With exactly nine days left for the start of the 2023 Asia Cup, the Board of Control for Cricket in India (BCCI) is expected to announce India's squad for the event on Monday. The squad announcement will take place during BCCI's meeting in Delhi, with both head coach Rahul Dravid and captain Rohit Sharma part of the conversation. From Jasprit Bumrah 's comeback in the ongoing T20I series against Ireland, to the fitnes off KL Rahul and Shreyas Iyer , the management will have plenty of tough calls to make before churning out the strongest-possible squad. Rahul and Iyer's injuries has created a void in India's middle-order, with the management yet to finalise the no. 4 spot. Rishabh Pant would've been another option, but he too is out for a lengthy period, having suffered a car crash last year. Iyer has scored the most number of runs for India at no. 4 in the current World Cup cycle, followed by Pant and Rahul. The Mumbai batter had establish himself as one of the most reliable batters, but an unfortunate injury now has the Indian team chasing shadows. India's possible options at no. 4? With Rahul and Iyer racing against time to be fit for the continental event, India will now have to pick between these four players -- Suryakumar Yadav , Ishan Kishan , Sanju Samson and Tilak Varma . Suryakumar Yadav is a prove match-winner when it comes to T20Is, but by his own admission, he has not able to replicate his riches in the One-Day Internationals. He averages 46.02 in T20Is, but only 24.33 in ODIs. Ishan Kishan and Sanju Samson are expected to make the Asia Cup, but only of them is likely to be in the XI as a wicketkeeper-batter. While both have previously batted at no. 4, the performances have been anything but convincing fro both parties. Tilak Varma has made a late claim for the no. 4 spot, following his debut tour of West Indies. Experts, Sourav Ganguly and Ravi Shastri , have vouched for his selection. If he gets into the side, Tilak could be a strong contender for the role. Also, India's don't have left-hander in their middle-order, and Tilak ticks that box too. Virat Kohli can also stake his claim for the role, having batted at no. 4 during India's triumphic World Cup campaign in 2011. However, he has only batted twice in that position. While Kishan, who has an ODI double century to his name, is more likely to fill in, Iyer and Rahul will force him out of the team once they are fit.","pubDate":"2023-08-21 02:36:48","image_url":null,"source_id":"ndtv","source_priority":1204,"country":["india"],"category":["sports"],"language":"english"},{"title":"दूसरा टी20 - गायकवाड़, सैमसन, रिंकू के शानदार प्रदर्शन से भारत ने आयरलैंड को 33 रनों से हराया","link":"https://www.khaskhabar.com/sports/cricket-news/sports-news-2nd-t20i--gaikwad-samson-rinku-shine-as-india-beat-ireland-by-33-runs-news-hindi-1-581303-KKN.html","keywords":null,"creator":null,"video_url":null,"description":"यहां रविवार को खेले गए दूसरा टी20 मैच में रुतुराज गायकवाड़ ने शानदार अर्धशतक","content":"डबलिन,। यहां रविवार को खेले गए दूसरा टी20 मैच में रुतुराज गायकवाड़ ने शानदार अर्धशतक के साथ भारत की पारी को आगे बढ़ाया, जबकि संजू सैमसन और रिंकू सिंह ने प्रभावशाली पारियां खेलकर भारत को 185-5 के प्रतिस्पर्धी स्कोर तक पहुंचाया और आयरलैंड को 33 रनों से हराकर तीन मैचों की सीरीज में 2-0 की अजेय बढ़त बना ली।सलामी बल्लेबाज एंडी बालबर्नी 51 गेंदों में 72 रन बनाकर आयरलैंड के लिए एकमात्र रनर थे, लेकिन यह व्यर्थ चला गया, क्योंकि भारत के गेंदबाजों ने शानदार जसप्रीत बुमरा के नेतृत्व में आयरलैंड को 152-8 पर रोक दिया। प्रसिद्ध कृष्णा ने पावरप्ले के अपने पहले ओवर में डबल स्ट्राइक की, साथ ही रवि बिश्‍नोई और अर्शदीप सिंह विकेटों के बीच मौजूद रहे।भारत के लिए गायकवाड़ ने 43 गेंदों में 58 रन बनाए और सैमसन के साथ 71 रनों की महत्वपूर्ण साझेदारी की। उन्होंने 26 गेंदों में 40 रनों की तेज पारी खेली। हालांकि ऐसा लग रहा था कि भारत पारी के अंत में कुछ गति खो रहा था, मगर रिंकू ने 21 गेंदों में 38 रन बनाए और शिवम दुबे 22 रन बनाकर नाबाद रहे। दोनों ने अंतिम 12 गेंदों में 42 रन बनाकर भारत को 180 के पार पहुंचाया।पहले बल्लेबाजी करने उतरे भारत के लिए दूसरे ओवर से रन बनने शुरू हो गए और गायकवाड़ ने जोश लिटिल को चार रन पर आउट कर दिया। यशस्वी जयसवाल ने बाएं हाथ के तेज गेंदबाज की गेंद पर चौका और छक्का लेने के लिए बैकफुट से दो बार घुमाया। जब बैरी मैक्कार्थी ने चौड़ाई दी, तो जयसवाल ने तुरंत उसे शॉर्ट थर्ड मैन के पार चार और रन के लिए कट कर दिया।गायकवाड़ ने लॉन्ग-ऑन और डीप स्क्वायर लेग के बीच आर्क में बैकफुट से तीन शानदार चौकों के साथ भारत को आगे बढ़ाया। दूसरे छोर से सैमसन ने तेज गेंदबाजों पर अपनी पांच चौकों में सही टाइमिंग और प्लेसमेंट पाया, जिसमें लिटिल की लगातार तीन गेंदें शामिल थीं।जब सैमसन ने 18 रन के 11वें ओवर में स्क्वायर लेग के पीछे से एक छक्का जड़ा तो मालाहाइड में खचाखच भरी भीड़ ने सबसे ज्यादा खुशी मनाई। उनकी 26 गेंदों की आक्रामक पारी 13वें ओवर में समाप्त हुई, जब उन्होंने लेग स्पिनर बेन व्हाइट की एक छोटी और वाइड गेंद के खिलाफ बड़ा शॉट लगाने के प्रयास में अपने स्टंप्स को काट दिया।गायकवाड़ ने व्हाइट की गेंद पर डीप स्क्वेयर लेग पर चार रन के लिए स्वीप करके अपना अर्धशतक पूरा किया और इसके बाद उसी ओवर में लॉन्ग-ऑन पर छक्का जड़ा। क्रीज पर उनका 43 गेंदों का प्रवास तब समाप्त हो गया जब 16वें ओवर में मैक्कार्थी की एक धीमी गेंद को लॉन्ग ऑफ पर चूक गए।पहली बार टी20ई में बल्लेबाजी कर रहे रिंकू ने दो चौके लगाए, इसके बाद मैक्कार्थी ने लॉन्ग-ऑन और अतिरिक्त कवर पर छक्के लगाए। दुबे अंतिम ओवर में फाइन लेग पर फ्लिक और मिडविकेट पर स्विंग के साथ छक्का मारने वाली पार्टी में शामिल हो गए। रिंकू ने ओवर का तीसरा छक्का डीप मिडविकेट पर एक गैर-जिम्मेदार पुल के साथ मारा, इससे पहले कि अगली ही गेंद पर वह आउट हो गए, जिससे भारत 180 का आंकड़ा पार कर गया।आयरलैंड के लक्ष्य का पीछा करने की शुरुआत बलबर्नी द्वारा दूसरे ओवर में अर्शदीप पर दो चौके लगाने से हुई। लेकिन कृष्णा ने अगले ओवर में शॉर्ट गेंदों पर पॉल स्टर्लिंग और लोर्कन टकर को आउट करके आयरलैंड को बैकफुट पर धकेल दिया। बिश्‍नाेई ने पावर-प्ले में हैरी टेक्टर को आउट कर आयरलैंड को दूसरा झटका दिया।लेकिन बालबर्नी ने आगे बढ़ना जारी रखा और आयरलैंड के लक्ष्य को फिर से जीवित कर दिया। उन्होंने पावर-प्ले समाप्त होने के तुरंत बाद वाशिंगटन सुंदर की गेंद पर दो चौके लगाकर शुरुआत की। हालांकि कर्टिस कैंपर बिश्‍नाेई को पॉइंट करने के लिए रिवर्स-पैडलिंग के बाद गिर गए, बलबर्नी ने दुबे को दो छक्के लगाए और बिश्‍नाेई को चार रन देकर अपना अर्धशतक पूरा किया। इसके बावजूद आयरलैंड की आवश्यक रन-रेट बढ़ती रही, हालांकि बालबर्नी और जॉर्ज डॉकरेल ने कृष्णा और बिश्‍नाेई की गेंद पर एक-एक छक्का लगाया। जब डॉकरेल को बिश्‍नाेई ने रन आउट किया तो भारत का पलड़ा मजबूत हो गया, जबकि बालबर्नी की गेंद पर अर्शदीप की गेंद पर सैमसन ने विकेट के पीछे कैच कर लिया। पारी के अंत में बुमराह ने मैक्कार्थी और मार्क अडायर को आउट किया, जिन्होंने अर्शदीप और प्रसिद्ध पर तीन छक्के लगाए। भारतीय कप्तान ने अपने चार ओवरों में कोई बाउंड्री नहीं दी, जिनमें से एक खेल के आखिरी ओवर में मेडन थी, क्योंकि मेहमान टीम ने अब एक मैच शेष रहते हुए श्रृंखला जीत ली है। संक्षिप्त स्कोर : भारत ने 20 ओवर में 185-5 (रुतुराज गायकवाड़ 58, संजू सैमसन 40, बैरी मैक्कार्थी 2-36, क्रेग यंग 1-29) ने आयरलैंड को 20 ओवर में 152-8 से हराया (एंडी बालबर्नी 72, जसप्रीत बुमरा 2-15, प्रसिद्ध कृष्णा 2-29) 33 रन से।","pubDate":"2023-08-21 01:58:26","image_url":null,"source_id":"khaskhabar","source_priority":5174519,"country":["india"],"category":["sports"],"language":"hindi"},{"title":"India seal series with easy win","link":"https://www.tribuneindia.com/news/sports/india-seal-series-with-easy-win-536788","keywords":null,"creator":null,"video_url":null,"description":"Dublin, August 20India beat Ireland by 33 runs to win the second T20 International and take an unassailable 2-0 lead in the three-match series.Batting first, India posted 185/5, riding on vice-captain Ruturaj Gaikwad's 58 off 43 balls, Sanju Samson's 40 off 26 deliveries and Rinku Singh's 38 off 21 balls.Today, I could run in and bowl a little faster. We wanted to put runs on the board and we thought the pitch will get slower. It did get slower. Jasprit Bumrah, India captainIn reply, Ireland were restricted to 152/8 with Prasidh Krishna taking 2/29 while Ravi Bishnoi scalped 2/37. Skipper Jasprit Bumrah had figures of 2/15. For Ireland, Andrew Balbirnie scored 72 off 51 balls.Brief Scores: India: 185/5 (Gaikwad 58, Samson 40, Rinku 38; McCarthy 2/36, Young 1/29); Ireland: 152/8 (Balbirnie 72; Bumrah 2/15, Krishna 2/29, Bishnoi 2/37).","content":"PTI Dublin, August 20 India beat Ireland by 33 runs to win the second T20 International and take an unassailable 2-0 lead in the three-match series. Batting first, India posted 185/5, riding on vice-captain Ruturaj Gaikwad’s 58 off 43 balls, Sanju Samson’s 40 off 26 deliveries and Rinku Singh’s 38 off 21 balls. Today, I could run in and bowl a little faster. We wanted to put runs on the board and we thought the pitch will get slower. It did get slower. Jasprit Bumrah, India captain In reply, Ireland were restricted to 152/8 with Prasidh Krishna taking 2/29 while Ravi Bishnoi scalped 2/37. Skipper Jasprit Bumrah had figures of 2/15. For Ireland, Andrew Balbirnie scored 72 off 51 balls. Brief Scores: India: 185/5 (Gaikwad 58, Samson 40, Rinku 38; McCarthy 2/36, Young 1/29); Ireland: 152/8 (Balbirnie 72; Bumrah 2/15, Krishna 2/29, Bishnoi 2/37). #Cricket","pubDate":"2023-08-21 01:38:19","image_url":"https://englishtribuneimages.blob.core.windows.net/gallary-content/2023/8/2023_8$largeimg_1401186234.jpg","source_id":"tribuneindia","source_priority":7916,"country":["india"],"category":["sports"],"language":"english"},{"title":"FIFA Women’s World Cup 2023 makes history as almost 19 million people tune in to the tournament","link":"https://thewest.com.au/sport/fifa-women-s-world-cup/fifa-womens-world-cup-2023-makes-history-as-almost-19-million-people-tune-in-to-the-tournament-c-11653653","keywords":null,"creator":["Lauren Higham"],"video_url":null,"description":"It’s official – Australians have been converted to soccer fanatics after record numbers tuned in to watch the FIFA Women’s World Cup 2023 tournament.","content":"It’s official – Australians have been converted to soccer fanatics after almost 19 million people tuned in to watch the FIFA Women’s World Cup. A record 18.6 million people — including the 5.54 million people who tuned in to Sunday night’s final match, where Spain triumphed over England 2-0 — tuned in across the tournament, making it the biggest broadcast and digital viewing event in Australian history. The final was the number one broadcast program on Sunday night nationally and in the capital cities in all people, 25 to 54s and 16 to 39s. It drew an average national total audience of 3.08 million on Seven and 7plus. Saturday’s playoff for third place between Australia and Sweden also saw huge numbers, with an average audience of 3.38 million witnessing the Matildas’ heartbreaking 2-0 loss. The match was the number one broadcast program on the night nationally and in the capital cities in all people, 25 to 54s and 16 to 39s. The Matildas’ semifinal against England on August 16 became the most-watched TV program in more than two decades, seeing an average audience of 7.2 million. It also made history as the most streamed event ever in Australia, with 957,000 viewers on 7plus. Managing Director Seven Melbourne and Head of Network Sport, Lewis Martin, said Seven’s broadcast of the Women’s World Cup highlighted the “growing passion” for women’s football in Australia. “Seven’s unparalleled live and free coverage of the event, underpinned by our team of passionate, expert commentators, reaffirms our ongoing commitment to celebrate and grow both men’s and women’s sports across all codes. From the AFLW and the WBBL to women’s international cricket and more, Seven has a strong legacy of bringing the best in sports to Australians that inspires the next generation,” he said. “This World Cup has been like no other and has set a new benchmark for future tournaments. The Matildas have been nothing short of spectacular, and we’re honoured to have shared their remarkable journey.” Seven West Media Chief Revenue Officer, Kurt Burnette, agreed, noting the sporting event “firmly cemented itself” as the biggest broadcast and digital viewing event in Australian history. “We knew it would be a cultural game changer, and it’s been just that – categorically shaping culture and changing behaviours. Audience numbers on Seven and 7plus, in partnership with Optus, surpassed our expectations to deliver incredible results for our brand partners while creating a halo effect across the rest of our schedule like we’ve never seen before,” he said. “No other medium other can create the same mass cultural impact as TV, and we’re proud that Seven’s coverage united Australia, created a shared sense of pride across the nation and produced lasting memories that will inspire a new generation.” Sign up for our emails","pubDate":"2023-08-21 01:35:14","image_url":"https://images.thewest.com.au/publication/C-11653653/63bb28c01159b8909a0689274ed1b2da66b4a6eb-16x9-x94y280w1234h694.jpg","source_id":"thewest","source_priority":106740,"country":["australia"],"category":["sports"],"language":"english"},{"title":"रिंकू सिंह 2023 में जड़ चुके 23 छक्के, फिर क्यों कहा- 10 साल बाद आया मौका, कप्तान बुमराह ने लगाया गले","link":"https://hindi.news18.com/cricket/rinku-singh-showed-amazing-in-his-debut-t20i-innings-team-india-won-series-against-ireland-jasprit-bumrah-7300289.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"Rinku Singh Player Of The Match: रिंकू सिंह ने अपनी इंटरनेशनल करियर की पहली पारी में ताबड़तोड़ बल्लेबाजी की. 25 साल के बैटर को प्लेयर ऑफ द मैच भी चुना गया. इसी के साथ टीम इंडिया ने आयरलैंड के खिलाफ दूसरा टी20 मैच जीतकर सीरीज पर भी कब्जा कर लिया है.","content":"Rinku Singh Player Of The Match: रिंकू सिंह ने ताबड़तोड़ पारी खेली और प्लेयर ऑफ द मैच रहे. (Bcci Twitter) नई दिल्ली. जसप्रीत बुमराह की कप्तानी में टीम इंडिया ने आयरलैंड के खिलाफ टी20 सीरीज में 2-0 की अजेय बढ़त बना ली है. भारतीय टीम ने दूसरे मैच में मेजबान टीम को 33 रन से हराया. सीरीज के पहले मैच में भारत को डकवर्थ लुइस नियम से 2 रन से जीत मिली थी. दूसरे मैच में की बात करें, तो भारतीय टीम ने पहले खेलते हुए 5 विकेट पर 185 रन का अच्छा स्कोर खड़ा किया. ऋतुराज गायकवाड़ ने 58, संजू सैमसन ने 40 और रिंकू सिंह ने 38 रन बनाए. रिंकू सिंह 2023 में अब तक टी20 के डेथ ओवर्स में 23 छक्के लगा चुके हैं. उनसे अधिक छक्के अन्य कोई भारतीय नहीं लगा सका है. जवाब में आयरलैंड की टीम निर्धारित 20 ओवर में 8 विकेट पर 152 रन ही बना सकी. सीरीज का तीसरा और अंतिम मुकाबला 23 अगस्त को खेला जाएगा. 25 साल के रिंकू सिंह पहली बार किसी इंटरनेशनल मैच में बल्लेबाजी करने उतरे और प्लेयर ऑफ द मैच भी रहे. उन्होंने 21 गेंद पर ताबड़तोड़ 38 रन बनाए. स्ट्राइक रेट 181 का रहा. 2 चौका और 3 छक्का जड़ा. मैच के बाद रिंकू ने कहा कि मुझे अपनी बल्लेबाजी पर भरोसा था और मैं आईपीएल के अनुभव का उपयोग करने की कोशिश कर रहा था. मैं पारी को अंत तक ले जाने की कोशिश कर रहा था. उन्होंने कहा कि मैं 10 साल से क्रिकेट खेल रहा हूं और अब कड़ी मेहनत का इनाम मिल रहा है. इंटरनेशनल क्रिकेट में पहले ही मैच में बल्लेबाजी करते हुए मैन ऑफ द मैच का पुरस्कार पाकर खुश हूं. मैच खत्म होने के बाद कप्तान जसप्रीत बुमराह ने रिंकू सिंह को गले भी लगाया. डेथ ओवर्स में स्ट्राइक रेट 200 का साल 2023 की बात करें, तो टी20 के डेथ ओवर्स में रिंकू सिंह का स्ट्राइक रेट 200 का है, जो बेहतरीन है. रिंकू ने इस साल अब तक 13 पारियों में 133 गेंद पर 266 रन बनाए हैं. औसत 38 का रहा है. इस दौरान उन्होंने 23 छक्के और 16 चौके लगाए हैं. यानी रिंकू अंतिम ओवरों में चौके से अधिक छक्के लगा रहे हैं. डेथ ओवर्स की बात करें, तो इस साल रिंकू से अधिक छक्के सिर्फ ऑस्ट्रेलिया के टिम डेविड ही लगा सके हैं. डेविड ने 22 पारियों में 28 छक्के जड़े हैं. सिर्फ सूर्यकुमार यादव से पीछे टी20 इंटरनेशनल में उप्र के रिंकू सिंह ने ताबड़तोड़ शुरुआत की. उन्होंने 181 के स्ट्राइक रेट से रन कूटे. भारतीय खिलाड़ियों के टी20 इंटरनेशनल के रिकॉर्ड को देखें, तो पहले मैच में स्ट्राइक रेट के मामले में रिंकू सिंह सिर्फ सूर्यकुमार यादव से पीछे हैं. टी20 के नंबर-1 बैटर सूर्या ने अपनी टी20 इंटरनेशनल की पहली पारी में 184 के स्ट्राइक रेट से रन बनाए थे. इसके अलावा तिलक वर्मा ने 177 तो ईशान किशन ने 175 के स्ट्राइक रेट से रन बनाए. Asia Cup की पिछली गलती से टीम को बचना होगा, गंवा दिया था वर्ल्ड कप! क्या रोहित और द्रविड़ लेंगे सबक? रिंकू सिंह ने अपनी पारी में 3 छक्के लगाए. वे टी20 इंटरनेशनल की पहली पारी में सबसे अधिक छक्के जड़ने के मामले में संयुक्त रूप से दूसरे नंबर पर हैं. ईशान किशान ने भारत की ओर से डेब्यू पारी में सबसे अधिक 4 छक्के लगाए हैं. इसके अलावा रिंकू सिंह, राहुल द्रविड़, मुरली विजय, सूर्यकुमार यादव और तिलक वर्मा ने 3-3 छक्के जड़े. आईपीएल 2023 में कोलकाता नाइट राइडर्स की ओर से खेलते हुए रिंकू सिंह ने 20 ओवरों की अंतिम 5 गेंद पर 5 छक्के जड़कर गुजरात टाइटंस के खिलाफ टीम को रोमांचक जीत दिलाई थी. रिंकू सिंह के ओवरऑल टी20 के रिकॉर्ड को देखें, ताे वे अब तक 82 पारियों में 31 की औसत से 1806 रन बना चुके हैं. 10 अर्धशतक ठोका है. स्ट्राइक रेट 142 का है. उन्होंने अपना पहला टी20 मैच साल 2014 में खेला था. यानी लगभग 9 साल पहले. . Tags: Jasprit Bumrah , Rinku Singh , Team india 25 हजार से करोड़पति बनाने वाला शेयर! 20 साल में दिया ऐसा धांसू रिटर्न, हर वर्ष 22 गुना बढ़ा निवेशकों का पैसा मुंह फुलाए बैठी नन्ही बच्ची, कभी अक्षय कुमार की थीं दीवानी, आज कहलाती हैं बॉलीवुड क्वीन, आंखों में छिपी पहचान हार्दिक पंड्या पर अहम फैसला! चयनकर्ता बैठक में उठा सकते हैं कड़ा कदम, एशिया कप से पहले लगेगा झटका?","pubDate":"2023-08-21 01:08:59","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/08/rinku-singh-2023-16925800173x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","source_priority":6509,"country":["india"],"category":["sports"],"language":"hindi"},{"title":"Test cricketer Naushad Ali passes away","link":"https://www.thenews.com.pk/print/1102138-test-cricketer-naushad-ali-passes-away","keywords":null,"creator":null,"video_url":null,"description":"ISLAMABAD: A human being of great qualities and a Test cricketer of incredible skill, Col Naushad Ali breathed his last at Shifa Hospital due to lung failure Sunday morning.Naushad, 79, served the game throughout his life in all capacities barring the Chairman Pakistan Cricket Board. The...","content":"ISLAMABAD: A human being of great qualities and a Test cricketer of incredible skill, Col (rtd) Naushad Ali breathed his last at Shifa Hospital due to lung failure Sunday morning. .ads_between_content{ height:auto; width:auto; clear: both; text-align: center; } .ads_between_content .story_ads{ } /*@media (max-width:600px){ .ads_between_content{ float:none; margin:0px auto; text-align: center; } }*/ Naushad, 79, served the game throughout his life in all capacities barring the Chairman Pakistan Cricket Board. The wicketkeeper-batsman started his Test career in the early sixties and toured with the Pakistani team to Australia and New Zealand in 1964 and England in 1971. Naushad played six Tests, all versus New Zealand. Unlike modern-day cricket, one rarely get opportunities of playing Test cricket in those days when even one tour or a series a year was considered sufficient to give players the required exposure. Top teams usually met once in a couple of years and even playing six Tests was considered a big achievement. Naushad in between joined the Army which halted his career as a cricketer. He then started his career as an official and even managed teams in the early eighties. He also served as Chief Executive PCB with Mujeebur Rehman for a brief stint. He also worked as chief selector and selector on numerous occasions in the nineties and early 2000s.","pubDate":"2023-08-21 01:00:00","image_url":null,"source_id":"thenews","source_priority":6495,"country":["pakistan"],"category":["sports"],"language":"english"},{"title":"Sethi slams BCCI over WC scheduling mess","link":"https://www.thenews.com.pk/print/1102134-sethi-slams-bcci-over-wc-scheduling-mess","keywords":null,"creator":null,"video_url":null,"description":"LAHORE: Former Pakistan Cricket Board Management Committee chief Najam Sethi has criticised Board of Control for Cricket in India on Sunday for making a mess of World Cup schedule and said that it could have been avoided if they had listened to him.Sethi tweeted that BCCI should have agreed with...","content":"LAHORE: Former Pakistan Cricket Board (PCB) Management Committee chief Najam Sethi has criticised Board of Control for Cricket in India (BCCI) on Sunday for making a mess of World Cup schedule and said that it could have been avoided if they had listened to him. .ads_between_content{ height:auto; width:auto; clear: both; text-align: center; } .ads_between_content .story_ads{ } /*@media (max-width:600px){ .ads_between_content{ float:none; margin:0px auto; text-align: center; } }*/ Sethi tweeted that BCCI should have agreed with him when he asked them to move out Pakistan’s matches from India and they should have been held in a neutral country. He said that BCCI is changing the schedule after every few days, due to the security problems they are facing. BCCI has already changed the schedule of nine World Cup matches, as Pakistan’s match against India was moved to 14 October from 15 October, due to Navratri festival in Ahmedabad. Pakistan’s match against England was moved to 11 November from 12 November in Kolkata due to “Kaali Puja” festival. Now there are reports that Hyderabad government officials have asked the BCCI to change date of Pakistan-Sri Lanka match, which is scheduled to be held on 10 October. The match was scheduled to be held on 12 October earlier, but the day was changed due to the change of schedule of Pakistan-India match. Hyderabad government officials have reportedly told BCCI that another match is scheduled to be held in Hyderabad on 9 October and it would be difficult for them to provide security in back-to-back matches. Pakistan are also scheduled to play their opening match in Hyderabad on 6 October against Netherlands.","pubDate":"2023-08-21 01:00:00","image_url":null,"source_id":"thenews","source_priority":6495,"country":["pakistan"],"category":["sports"],"language":"english"},{"title":"Asia cup 2023 : शार्दुल की प्रसिद्ध? चहल की अश्विन ? कुणाची लागणार वर्णी; आशिया चषकासाठी टीम इंडियाचे शिलेदार आज ठरणार","link":"https://marathi.abplive.com/sports/cricket/asia-cup-and-world-cup-squad-it-could-be-shardul-vs-prasidh-for-extra-pacers-slot-all-eyes-on-rahul-iyer-fitness-1202876","keywords":["क्रिकेट"],"creator":["पीटीआय वृत्तसंस्था"],"video_url":null,"description":"Asia cup 2023 : आशिया चषकासाठी आज भारतीय संघाची निवड होणार आहे. निवड समीतीचे अध्यक्ष अजित आगरकर दुपारी पत्रकार परिषद घेऊन संघाची घोषणा करतील. जसप्रीत बुमराह, मोहम्मद शामी आणि मोहम्मद सिराज यांची निवड निश्चित मानली जातेय. त्यांच्या जोडीला अतिरिक्त वेगवान गोलंदाज कोण? हा प्रश्न निवड समितीपुढे आहे. त्यासाठी शार्दूल ठाकूर, प्रसिद्ध कृष्णा आणि जयदेव उनादकट यांच्यामध्ये स्पर्धा आहे. आशिया चषक आणि विश्वचषकासाठी कुणाची वर्णी लागणार ? याकडे लक्ष लागलेय.  एक जागा, तीन स्पर्धक - शार्दुल ठाकूर याने गेल्या काही वर्षांत मधल्या षटकात धारधार गोलंदाजी केली आहे. विकेट घेण्यासोबत धावा रोखण्यातही शार्दूल यशस्वी झालाय. त्याशिवाय तो तळाला फलंदाजीही करु शकतो. त्यामुळे शार्दुल ठाकूर याची निवड होण्याची शक्यता वर्तवण्यात येत आहे. पण निवड समिती प्रसिद्ध कृष्णा आणि जयदेव उनादकट यांच्या नावाचाही विचार करत आहे. प्रसिद्ध कृष्णा याने आय़र्लंड दौऱ्यातून दमदार कमबॅक केलेय. पहिल्याच सामन्यात त्याने भेदक मारा केलाय. दुसरीकडे जयदेव उनादकट याने दहा वर्षांनंतर संघात कमबॅक केलेय. शार्दुल ठाकूर याने वनडेमध्ये 58 विकेट घेतल्या आहेत. त्याशिवाय अर्धशतकही ठोकलेय. तळाला तो वेगाने धावा करण्यात तरबेज आहे. त्याशिवाय मधल्या षटकात तो विकेट घेतोच. त्याशिवाय प्रतिस्पर्धी संघाची भागिदारी तोडण्यातही शार्दुलचा हातखंडा आहे. त्यामुळे एका जागेसाठी या तीन गोलंदाजांमध्ये चुरस असल्याचे दिसतेय.  अय्यर-राहुल यांच्या फिटनेसकडे लक्ष -  श्रेयस अय्यर आणि केएल राहुल दुखापतीमुळे काही दिवसांपासून संघाबाहेर आहेत. बेंगळरु येथील एनसीएमध्ये त्यांनी फिटनेसवर काम केलेय. फलंदाजी करतानाचे त्यांचे व्हिडीओ सोशल मीडियावर व्हायरल झाले होते. एनसीएमधील सराव सामन्यातही या दोघांनी भाग घेतला होता. राहुल पूर्णपणे तंदुरुस्त असल्याचं समोर आलेय. पण अय्यरच्या फिटनेसबाबत अद्याप संभ्रम आहे.  फिरकी गोलंदाज कोण ? विश्वचषकासाठी पाच फिरकी गोलंदाजांमध्ये स्पर्धा आहे. अष्टपैलू रविंद्र जाडेजा, चायनामन कुलदीप यादव, युजवेंद्र चहल, अक्षर पटेल आणि आर. अश्विन यांच्यामध्ये स्पर्धा रंगणार आहे. जाडेजा, अश्विन आणि अक्षर पटेल हे फिंगर स्पिनर आहेत. तर कुलदीप यादव चायनामन गोलंदाज आहे. लेगस्पिनगर म्हणून युजवेंद्र चहल याने दावा ठोकलाय. आर. अश्विन याच्याकडे आंतरराष्ट्रीय सामन्याचा तगडा अनुभवा आहे. त्याशिवाय तो तळाला फलंदाजीही करु शकतो. रविंद्र जाडेजा आणि कुलदीप यादव यांचे स्थान जवळपास निश्चित आहे. उर्वरित दोन जागांसाठी तीन गोलंदाजात चुरस आहे.  आशिया चषकासाठी भारताचा संभाव्य संघ - रोहित शर्मा (कर्णधार), शुभमन गिल, विराट कोहली, केएल राहुल (विकेटकिपर, subject to fitness), श्रेयस अय्यर (subject to fitness), हार्दिक पांड्या, रविंद्र जाडेजा, जसप्रीत बुमराह, मोहम्मद शामी, मोहम्मद सिराज, कुलदीप यादव, इशान किशन (विकेटकिपर), अक्षर पटेल, शार्दुल ठाकूर, सूर्यकुमार यादव, तिलक वर्मा, युजवेंद्र चहल/आर अश्विन ","content":"Asia cup 2023 : आशिया चषकासाठी आज भारतीय संघाची निवड होणार आहे. निवड समीतीचे अध्यक्ष अजित आगरकर दुपारी पत्रकार परिषद घेऊन संघाची घोषणा करतील. जसप्रीत बुमराह, मोहम्मद शामी आणि मोहम्मद सिराज यांची निवड निश्चित मानली जातेय. त्यांच्या जोडीला अतिरिक्त वेगवान गोलंदाज कोण? हा प्रश्न निवड समितीपुढे आहे. त्यासाठी शार्दूल ठाकूर, प्रसिद्ध कृष्णा आणि जयदेव उनादकट यांच्यामध्ये स्पर्धा आहे. आशिया चषक आणि विश्वचषकासाठी कुणाची वर्णी लागणार ? याकडे लक्ष लागलेय. एक जागा, तीन स्पर्धक - शार्दुल ठाकूर याने गेल्या काही वर्षांत मधल्या षटकात धारधार गोलंदाजी केली आहे. विकेट घेण्यासोबत धावा रोखण्यातही शार्दूल यशस्वी झालाय. त्याशिवाय तो तळाला फलंदाजीही करु शकतो. त्यामुळे शार्दुल ठाकूर याची निवड होण्याची शक्यता वर्तवण्यात येत आहे. पण निवड समिती प्रसिद्ध कृष्णा आणि जयदेव उनादकट यांच्या नावाचाही विचार करत आहे. प्रसिद्ध कृष्णा याने आय़र्लंड दौऱ्यातून दमदार कमबॅक केलेय. पहिल्याच सामन्यात त्याने भेदक मारा केलाय. दुसरीकडे जयदेव उनादकट याने दहा वर्षांनंतर संघात कमबॅक केलेय. शार्दुल ठाकूर याने वनडेमध्ये 58 विकेट घेतल्या आहेत. त्याशिवाय अर्धशतकही ठोकलेय. तळाला तो वेगाने धावा करण्यात तरबेज आहे. त्याशिवाय मधल्या षटकात तो विकेट घेतोच. त्याशिवाय प्रतिस्पर्धी संघाची भागिदारी तोडण्यातही शार्दुलचा हातखंडा आहे. त्यामुळे एका जागेसाठी या तीन गोलंदाजांमध्ये चुरस असल्याचे दिसतेय. अय्यर-राहुल यांच्या फिटनेसकडे लक्ष - googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); श्रेयस अय्यर आणि केएल राहुल दुखापतीमुळे काही दिवसांपासून संघाबाहेर आहेत. बेंगळरु येथील एनसीएमध्ये त्यांनी फिटनेसवर काम केलेय. फलंदाजी करतानाचे त्यांचे व्हिडीओ सोशल मीडियावर व्हायरल झाले होते. एनसीएमधील सराव सामन्यातही या दोघांनी भाग घेतला होता. राहुल पूर्णपणे तंदुरुस्त असल्याचं समोर आलेय. पण अय्यरच्या फिटनेसबाबत अद्याप संभ्रम आहे. फिरकी गोलंदाज कोण ? विश्वचषकासाठी पाच फिरकी गोलंदाजांमध्ये स्पर्धा आहे. अष्टपैलू रविंद्र जाडेजा, चायनामन कुलदीप यादव, युजवेंद्र चहल, अक्षर पटेल आणि आर. अश्विन यांच्यामध्ये स्पर्धा रंगणार आहे. जाडेजा, अश्विन आणि अक्षर पटेल हे फिंगर स्पिनर आहेत. तर कुलदीप यादव चायनामन गोलंदाज आहे. लेगस्पिनगर म्हणून युजवेंद्र चहल याने दावा ठोकलाय. आर. अश्विन याच्याकडे आंतरराष्ट्रीय सामन्याचा तगडा अनुभवा आहे. त्याशिवाय तो तळाला फलंदाजीही करु शकतो. रविंद्र जाडेजा आणि कुलदीप यादव यांचे स्थान जवळपास निश्चित आहे. उर्वरित दोन जागांसाठी तीन गोलंदाजात चुरस आहे. आशिया चषकासाठी भारताचा संभाव्य संघ - रोहित शर्मा (कर्णधार), शुभमन गिल, विराट कोहली, केएल राहुल (विकेटकिपर, subject to fitness), श्रेयस अय्यर (subject to fitness), हार्दिक पांड्या, रविंद्र जाडेजा, जसप्रीत बुमराह, मोहम्मद शामी, मोहम्मद सिराज, कुलदीप यादव, इशान किशन (विकेटकिपर), अक्षर पटेल, शार्दुल ठाकूर, सूर्यकुमार यादव, तिलक वर्मा, युजवेंद्र चहल/आर अश्विन","pubDate":"2023-08-21 00:41:00","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/08/02/829e1a62defda80294456a42183783c11690972848877689_original.jpg","source_id":"abplive","source_priority":10959,"country":["india"],"category":["sports"],"language":"marathi"}]}