{"newsArray":[{"title":"Skipper Williamson, head coach Stead to miss tour of India","link":"https://www.orissapost.com/skipper-williamson-head-coach-stead-to-miss-tour-of-india/","keywords":["Sports","Gary Stead","india tour","kane williamson"],"creator":["Post News Network"],"video_url":null,"description":"Wellington: New Zealand skipper Kane Williamson and head coach Gary Stead will miss the white-ball tour of India, starting next month, as part of their workload management. New Zealand Cricket (NZC) have named split ODI squads for the away series against Pakistan, which begins January 10, and India, scheduled to start January 18. Newly-appointed Test […]","content":"Wellington: New Zealand skipper Kane Williamson and head coach Gary Stead will miss the white-ball tour of India, starting next month, as part of their workload management. New Zealand Cricket (NZC) have named split ODI squads for the away series against Pakistan, which begins January 10, and India, scheduled to start January 18. Newly-appointed Test captain Tim Southee will also return home after the Pakistan tour to prepare for the home Test series against England in February. In Wiliamson and Stead’s absence, Tom Latham will lead the Kiwis while batting coach Luke Ronchi will serve as the head coach in the three-match ODI series against India. Ronchi will also be in charge as the head coach for the T20 series in India, the squad for which will be announced January 9. He will be assisted by former New Zealand women coach Bob Carter and former spinner Paul Wiseman. All-rounder Mark Chapman and pacer Jacob Duffy will replace Williamson and Southee in the squad for the India tour. In-form pace bowling all-rounder Henry Shipley has been handed a maiden call-up after impressing in the domestic circuit. He has been named in both squads. The tall (1.96m) right-arm pacer and middle-order power batter was the leading wicket-taker in last season’s Super Smash. “Henry’s an exciting talent who we’ve had our eye on for a while,” New Zealand selector Gavin Larsen said. “He’s taken his game to another level in the past 12 months, and we’re delighted to see his progression given how valuable genuine all-rounders are in any cricket team,” he added. Legspinner Ish Sodhi and batter Henry Nicholls, who had been omitted from the squad for the home ODI series against India, have also been named in both squads. Meanwhile, pacer Kyle Jamieson still remains unavailable for selection as he recovers from a back injury. He last played for New Zealand in June. Larsen said the two ODI series will help prepare for the 50-over World Cup in India next year. “This is a great opportunity to take on two quality white-ball sides in sub-continental conditions. It’s going to be tough cricket against world-class opposition which should prove a real test of a player’s skill and temperament. “With the one-day World Cup less than a year away in India, it’s the perfect time to be playing these sides at home as we look to nail down our game plans, and understand the different situations and conditions we may encounter.” Squads: For India: Tom Latham (c), Finn Allen,Michael Bracewell, Mark Chapman, Devon Conway,Jacob Duffy, Lockie Ferguson, Matt Henry, Adam Milne, Daryl Mitchell, Henry Nicholls, Glenn Phillips, Mitchell Santner, Henry Shipley and Ish Sodhi. For Pakistan: Kane Williamson (c),Tom Latham, Finn Allen, Michael Bracewell, Devon Conway, Lockie Ferguson, Matt Henry, Adam Milne, Daryl Mitchell, Henry Nicholls, Glenn Phillips, Mitchell Santner, Henry Shipley, Ish Sodhi and Tim Southee.","pubDate":"2022-12-19 05:28:37","image_url":"https://www.orissapost.com/wp-content/uploads/2022/12/nz-300x169.jpg","source_id":"orissapost","country":["india"],"category":["sports"],"language":"english"},{"title":"LIVE PAK vs ENG, 3rd Test, Day 3, Cricket Score: PAK make poor start to second innings","link":"https://www.indiatvnews.com/sports/cricket/pak-vs-eng-3rd-test-day-3-cricket-score-latest-updates-pakistan-vs-england-full-scorecard-ball-by-ball-commentary-ben-stokes-pak-vs-eng-2022-12-19-832321","keywords":null,"creator":null,"video_url":null,"description":"LIVE PAK vs ENG, 3rd Test, Day 3, Cricket Score: PAK make poor start to second innings","content":null,"pubDate":"2022-12-19 04:15:40","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"AUS vs RSA Boxing Day Test: Cricket Australia to honour Shane Warne with special tribute ahead of 2nd Test","link":"https://www.indiatvnews.com/sports/cricket/shane-warne-tribute-aus-vs-rsa-boxing-day-test-cricket-australia-to-honour-shane-warne-with-special-tribute-ahead-of-2nd-test-shane-warne-death-2022-12-19-832316","keywords":null,"creator":null,"video_url":null,"description":"Cricket Australia (CA) have announced that they will pay a special tribute to legendary former player Shane Warne to honour his career after he passed away on March 4, 2022. The spin magician’s sudden departure in March came as a big shock to the cricketing fraternity current and former players paid their tributes. The CA has now planned to take to the occasion on Boxing Day, the final international outing of 2022, to remember Warne who acquires a special place in Australian Cricket.","content":null,"pubDate":"2022-12-19 04:02:29","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"Chants of ‘Messi, Messi’ as Bangladeshis celebrate Argentina’s World Cup triumph","link":"https://www.capitalfm.co.ke/sports/2022/12/19/chants-of-messi-messi-as-bangladeshis-celebrate-argentinas-world-cup-triumph/","keywords":["Football","Sports","The 2022 FIFA World Cup"],"creator":["AGENCE FRANCE PRESSE"],"video_url":null,"description":"DHAKA, Bangladesh, Dec 19 – Bangladeshi football fans chanted “Messi, Messi,” shedding tears of joy and dancing in the streets to celebrate the triumph of Argentina — a country half a world away — over France in the World Cup final Sunday. According to police, hundreds of thousands of people defied chilly temperatures to watch […] The post Chants of ‘Messi, Messi’ as Bangladeshis celebrate Argentina’s World Cup triumph appeared first on Capital Sports.","content":"According to police, hundreds of thousands of people defied chilly temperatures to watch the match on giant screens set up in the capital Dhaka’s key squares, roads and football grounds. Many wore Argentina’s sky blue and white national colours and sported Lionel Messi’s iconic number 10 jersey. “I don’t know why I am crying, but I am crying for him,” Nafiun Rahman Zian, an 18-year old Messi fan, told AFP. “Years of wait (is over) to see the love of my life, the little magician, hold the most prestigious trophy which he desired so much,” he said. Bangladesh, a Muslim-majority country of 170 million people, is cricket mad, with its national team one of the best in the world. It is, however, ranked among the bottom in global football. But every four years during the World Cup, the country renews its love affair with the sport, as many young people divide themselves largely into two rival groups — one supporting Argentina, the other Brazil. Sunday’s biggest crowd gathered at the Dhaka University campus at the heart of the city, as many people painted the Argentinian flag on their cheeks to watch the proceedings from Qatar. Argentinian supporters react as they watch the final football match of the Qatar 2022 World Cup between Argentina and France in Dhaka, Bangladesh on December 18, 2022 © The crowd became ecstatic when Messi scored the first goal of the game, with a penalty. “I just can’t express how happy I am,” said Imon Gazi, wiping his eyes after Argentina’s Angel Di Maria scored to make it 2-0. The throng fell into an eerie silence as a brace from France’s Kylian Mbappe took the match into extra time at 2-2. “I felt like I would suffer a heart attack,” said Abdus Sabur, a 40-year-old motorbike driver, who says he is a Brazil supporter but switched to Argentina in the final because of Messi. “Mbappe is 23. He can play three more World Cups. This time the Cup should go to Messi,” he said, as another Mbappe penalty took the match into the a shootout, with the score at 3-3. But when Argentina’s Gonzalo Montiel slotted in the winning penalty, the horde at the university burst into wild celebrations. “Many of my friends, especially those who support Brazil, taunted me and fellow Argentina supporters that we did not win anything since the 1986 World Cup, when I was not even born,” said Mohammad Hasan, 19. Argentinian supporters react as they watch the final football match of the Qatar 2022 World Cup between Argentina and France in Dhaka, Bangladesh on December 18, 2022 © “Messi has proved he is the greatest player in the world. He is even greater than Diego Maradona or his rival Cristiano Ronaldo. The debate is over,” he said. Bangladesh’s Argentina-Brazil rivalry sees supporters in rural towns paint their houses in the countries’ respective colors, and at least seven people have died trying to display the national flags over their homes, according to police — after being electrocuted and falling off rooftops. At least three people have also died after rival football fans clashed in rural towns, police said.","pubDate":"2022-12-19 03:23:53","image_url":null,"source_id":"capitalfm","country":["kenya"],"category":["sports"],"language":"english"},{"title":"Pulling women’s cricket back from brink of extinction","link":"https://www.nzherald.co.nz/sport/pulling-womens-cricket-back-from-brink-of-extinction/2GGRUVHNF5DO5IE7AZRR73VXC4/","keywords":null,"creator":null,"video_url":null,"description":"The game is much healthier - but with still much work to do to achieve equity.","content":null,"pubDate":"2022-12-19 01:35:38","image_url":"https://www.nzherald.co.nz/resizer/AojGKP9H3uWtkDjuNqwAgKiygrw=/300x300/smart/filters:quality(70)/cloudfront-ap-southeast-2.images.arcpublishing.com/nzme/462I77BY3BFJJDSKOC3CXOGBJI.JPG","source_id":"nzherald","country":["new zealand"],"category":["sports"],"language":"english"},{"title":"Raging Lions win Road Safety Cricket Cup","link":"https://indianexpress.com/article/sports/cricket/raging-lions-win-road-safety-cricket-cup-8331849/","keywords":["Cricket","Sports"],"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2022-12-18 21:48:45","image_url":null,"source_id":"indianexpress","country":["india"],"category":["sports"],"language":"english"},{"title":"Buutu emerge winners of Batball Nile Edition","link":"https://kawowo.com/2022/12/18/buutu-emerge-winners-of-batball-nile-edition/","keywords":["Cricket"],"creator":["Denis Musali"],"video_url":null,"description":"Event: Batball Open Nile Edition Day 2 Venue: In Jinja City at Jinja SS Cricket oval Summary of Day 2 Games. Amakokotazi Vs Empungu Amakokotazi 94/6 in 10 overs Empungu 42/4 in 10 overs Amakokotazi won by 52 runs 3rd and 4th eliminator Amakubi Vs Empungu Amakubi 51/6 in 10 overs Empungu 52/2 in 6.5 […] The post Buutu emerge winners of Batball Nile Edition appeared first on Kawowo Sports.","content":"Event: Batball Open Nile Edition Day 2 Venue: In Jinja City at Jinja SS Cricket oval Summary of Day 2 Games. Amakokotazi Vs Empungu Amakokotazi 94/6 in 10 overs Empungu 42/4 in 10 overs Amakokotazi won by 52 runs Amakubi Vs Empungu Amakubi 51/6 in 10 overs Empungu 52/2 in 6.5 overs Empungu won by 8 wickets Amakokotazi Vs Empungu Amakokotazi 56/2 in 8 overs Empungu 35/4 in 8 overs Amakokotazi won by 23 runs on D/L Method Amakokotazi Vs Buutu Amakokotazi 61/2 in 10 overs Buutu 63/3 in 8.3 overs Buutu won by 7 wickets The Bat Ball Nile Edition came to an end today with Buutu claiming the title. The Nile Edition featured 4 teams and Buutu who went unbeaten through out the two day event were crowned champions. The Nile edition was hosted by Jinja Association of Cricket Clubs and was hosted at Jinja Cricket Oval. This was the second Batball tournament that followed the East edition that was held in Soroti. The Nile edition also supported the social cause of kicking out teenage pregnancies in the Busoga region. The Kingdom of Busoga was represented at the closing ceremony of the tournament by the Deputy Prime Minister Mr Osman Noor Mohammad who said I would like to thank all the bodies behind this project as its one of ways of promoting sports and end poverty in Busoga region,” The Batball CEO Aakarshit Madaan assured the youngsters that this was just the beginning for them. I would like to thank everyone who made this tournament a success and also assure the players that this is one of the many tournaments that shall be played. And I would like to encourage the parents to continue supporting their children towards their talents as they also keep adding value to themselves for the big stage There will be three more bat ball events in the Central, West and North before the best players from each region come together for the Bat Ball X.","pubDate":"2022-12-18 20:21:19","image_url":null,"source_id":"kawowo","country":["uganda"],"category":["sports"],"language":"english"},{"title":"Cricket Cranes unbeaten run tested by Tanzania","link":"https://kawowo.com/2022/12/18/cricket-cranes-unbeaten-run-tested-by-tanzania/","keywords":["Cricket"],"creator":["Denis Musali"],"video_url":null,"description":"Match 6: Uganda v Tanzania Match Summary: Uganda 107/9 Tanzania 105/9 Uganda won by 2 runs Joseph Baguma had a daunting task of defending 16 runs from the final, the usually cool operator had been picked out as the bowler to take on by Tanzania. From his three overs he had travelled for 33, the […] The post Cricket Cranes unbeaten run tested by Tanzania appeared first on Kawowo Sports.","content":"Match 6: Uganda v Tanzania Match Summary: Uganda 107/9 Tanzania 105/9 Joseph Baguma had a daunting task of defending 16 runs from the final, the usually cool operator had been picked out as the bowler to take on by Tanzania. From his three overs he had travelled for 33, the gamble by Brian Masaba nearly back fired as Mohammad Yunusu Sefu scored 3 back to back boundaries. On the 5th ball of the over Kenneth Waiswa gathered a drive down to long off and his decision to throw at the keepers end which was the longer side won the game for Uganda. Yunusu was caught out of his ground which meant the final man Maurice Yalinde would be the one one strike. He was never going to get the boundary Tanzania needed to inflict defeat on Uganda, the Cricket Cranes getting out jail in a seesaw game that might have come at a cost. Roger Mukasa scored 41 but most of it on one leg and he limped off after being dismissed. He might be touch and go for the double header tomorrow. Uganda won the toss and elected to bat in a short 15 over match but they failed to engage second gear limping to 107/9. The top and middle failing to hold with late flourishes from Cosmas Kyewuta (13) and Brian Masaba (13) getting them to a respectable total. The script to the chase was torn inside the 1st over with their tailsman Ivan Suleiman brilliantly run out by Kenneth Waiswa and then Frank Nsubuga picked up a wicket as well and by the third over the coastal team was 5/4. Everything looked dead and buried until Amal Rajeevan decided to take matters into his own hands. He found able partners in Ally Kimote (15) and Mohammad Yunusu (22) as they ensured they took the game deep. However, it wasn’t meant to be as Uganda despite playing poorly on the day won the game. Uganda got away with murder as they failed to put on a batting display and while Tanzania made a recovery from 5/4 to lose by 2 runs it was too much work in the end left for the bowlers to pick up the win. Cosmas Kyewuta picked up the Man of Match award with a brilliant display of aggressive fast bowling that saw him pick up 4/5, his best career T20I figures. A performance Uganda will want to quickly forget as they will have a double header tomorrow, they take on Rwanda in the morning and Tanzania in the afternoon.","pubDate":"2022-12-18 20:13:16","image_url":null,"source_id":"kawowo","country":["uganda"],"category":["sports"],"language":"english"},{"title":"1st Test: Kuldeep returns career-best figures in India’s massive 188-run win","link":"https://kashmirreader.com/2022/12/19/1st-test-kuldeep-returns-career-best-figures-in-indias-massive-188-run-win/","keywords":["SPORTS"],"creator":["Press Trust of India"],"video_url":null,"description":"Chattogram: Wrist-spinner Kuldeep Yadav registered his career-best match figures as India quickly wrapped up Bangladesh’s second innings for a comprehensive 188-run win in the opening Test, here Sunday. Needing four wickets to pocket the win, India finished the job in 11.2 overs, bowling the hosts out for 324 after the hosts began at overnight score […]","content":"Chattogram: Wrist-spinner Kuldeep Yadav registered his career-best match figures as India quickly wrapped up Bangladesh’s second innings for a comprehensive 188-run win in the opening Test, here Sunday. Needing four wickets to pocket the win, India finished the job in 11.2 overs, bowling the hosts out for 324 after the hosts began at overnight score of 276 for six. Left-arm wrist spinner Kuldeep scalped two of the remaining four batters while Mohammed Siraj and Axar Patel took one wicket each. Kuldeep, who cherished an impressive five-wicket haul in the first innings, added three more wickets in the second Bangladesh innings to finish with match figures of 8 for 113. “I love bowling with Kookaburra balls, it gives me better grip and control, compared to the SG ball,” said Kuldeep after the win. “If I were not playing cricket, it would have been very challenging but I have played a lot of white-ball matches. I have played IPL and with red ball India A matched, so my rhythm was set. “I could bowl with aggressive approach and in this rhythm, you need to make extra effort and it takes a toll on body,” he said. “I like playing all formats of cricket for India, nothing matches that pride. When I don’t play I keep training so that the confidence remains intact in matched but I stay relaxed,” he added. Kuldeep was ably supported by left-arm spinner Patel, who finished with figures of 4 for 77 in the second innings. With this win, India have climbed to the third place in the World Test Championship points table, pushing Sri Lanka to the fourth position. India now have 87 points with 55.77 percentage (PCT) while Sri Lanka have 64 points and 53.33 PCT. Australia lead the table with 75 PCT and are followed by South Africa (60 PCT) Resuming at the overnight score of 276 for 6, Bangladesh skipper Shakib-Al-Hasan came all out attacking, knowing very well it would not be easy to just survive the whole day. He went for his shots to score 84, studded with six fours and as many hits over the fence in his 108-ball stay. But the Indians played the patient game. KL Rahul, who registered his first Test win as skipper, started with pace-spin combination of Siraj (1/67) and Patel. Bangaldesh batters started aggressively as Mehidy Hasan Miraz delightfully drove Siraj through the covers in his first over for the day’s first boundary. At the other end, Shakib made his intentions clear, clobbering Patel over square leg. But Siraj had his man in his next over as Mehidy fell to a loose shot. Siraj sprayed the ball outside the off-stump again and Mehidy only managed to slash the delivery straight to Umesh Yadav at backward point. Shakib brought up his 30th Test fifty with a straight six off Patel. Shakib took his chances but the asking was too tall as Rahul introduced Kuldeep as the first change and the left-arm spinner picked up two wickets in consecutive overs, while Patel picked another as India ended Bangladesh’s dogged resistance. Kuldeep first cleaned up Shakib as the batter went for another slog sweep over extra cover and then had Ebadat Hossain caught by Shreyas Iyer. —PTI Axar completed the formalities by going through the defence of Taijul Islam. The second Test will begin from December 22 in Mirpur. PTI 1st Test: Kuldeep returns career-best figures in India’s massive 188-run win added by Press Trust of India on 1:14 am December 19, 2022 View all posts by Press Trust of India → Press Trust of India Facebook Twitter WhatsApp Email Print Related","pubDate":"2022-12-18 19:44:02","image_url":null,"source_id":"kashmirreader","country":["india"],"category":["sports"],"language":"english"},{"title":"Will Rohit be available for 2nd Test vs Bangladesh?","link":"https://thenorthlines.com/will-rohit-be-available-for-2nd-test-vs-bangladesh/","keywords":["Cricket","Sports"],"creator":["Northlines"],"video_url":null,"description":"NL Correspondent Injured Rohit Sharma&#39;s availability for the second Test against Bangladesh, starting in Mirpur from December 22, will be known in a day or two, stand-in India captain KL Rahul said on Sunday. Rohit, who led India in two ODIs in the preceding series, was ruled out of the first Test, which India won […] The post Will Rohit be available for 2nd Test vs Bangladesh? appeared first on Northlines.","content":"NL Correspondent Injured Rohit Sharma's availability for the second Test against Bangladesh, starting in Mirpur from December 22, will be known in a day or two, stand-in India captain KL Rahul said on Sunday. Rohit, who led India in two ODIs in the preceding series, was ruled out of the first Test, which India won by 188 runs on Sunday under Rahul's captaincy. Rohit had gone back to India after hurting his left thumb while fielding in the second ODI against Bangladesh in Mirpur on December 7. Abhimanyu Easwaran has come in as his replacement. \"About Rohit, we may be able to know (his status) in the next day or two, even I am not aware of it,\" Rahul said at the post-match press conference. Rahul termed the first Test win against Bangladesh as a complete performance, saying the team did well in all departments and played as a unit. \"Everything stood out. We batted really well, bowled really well. In fielding also, we took most of the catches that came our way. That is the way you win Test matches. Only one or two people cannot win matches, this is for all formats,\" he said. \"Kuldeep (Yadav), (Mohammed) Siraj bowled really well in the first innings (of Bangladesh) but others supported them well. In the second innings, Axar (Patel) bowled really well but Kuldeep and Ash (R Ashwin) kept the pressure on. Umesh (Yadav) and Siraj bowled some really good spells, kept it tight and beat the bat many times but were unlucky. \"Everybody did well and this was what we wanted to do as a team. The guys who performed well in particular also got support from others. Those who are supporting are also important.\" Rahul said the culture of the team is about collective needs and not individuals. \"Whether you have played 50 Test matches or you are playing your first or second match, it is the same. They don't matter,\" he said. He said bundling Bangladesh out for 150 in their first innings set up the match for India. \"That gave us a lot of time to try and win the match. Had Bangladesh got 350 in the first innings, the match could gone for a draw. \"In Test cricket , you are not going to get an easy win. We knew that and we have played enough Test cricket to understand that at times the opposition is going to play better and we need to respect that. We have to keep doing our job,\" Rahul said. \"I am very proud that throughout the five days we showed commitment and intensity. There was a bit of worry coming into the Test about how the body would react and be able to manage on the path for so long and still maintain our focus and intensity but we did pretty well, winning the first game.\" Rahul said wrist spinner Kuldeep was an asset for the team in pitches which doesn't offer much assistance to bowlers. \"There was not much (on the wicket) for the spinners and Ash (R Ashwin) also felt that but Kuldeep brought a different variety and that is why we played Kuldeep on a pitch like this.\" He said the 1-2 ODI series defeat was a bit disappointing. \"We played some good cricket but could not capitalise on the big moments. That was a bit disappointing. It is a completely new format now, new individuals, fresh energy coming in and you tend to forget what happened in the past and you try and focus what we have to do,\" Rahul said. \"Test cricket is something everyone in the dressing room is excited about playing. There is a positive energy how we look at playing Test cricket and want to win games of cricket. We know that it is challenging and that is the fun of Test cricket.\"","pubDate":"2022-12-18 18:16:44","image_url":null,"source_id":"thenorthlines","country":["india"],"category":["sports"],"language":"english"},{"title":"FIFA WC | Messi wave on the field: Ravi Shastri Tweet","link":"https://thenewsglory.com/fifa-wc-messi-wave-on-the-field-ravi-shastri-tweet/","keywords":["Sports","Argentina","FIFA","FIFA WC 2022","FIFA World Cup","FIFA World Cup Qatar 2022","FIFA WorldCup 2022","Football","France","Mbappe","Messi","World Cup"],"creator":["The News Glory"],"video_url":null,"description":"Lucille: The finals of the ongoing FIFA World Cup series between Argentina and France have been contested. Former Indian cricket team player and commentator Ravi Shastri has gone to Qatar to witness this match. He had posted some posts on social media from the Lusail Stadium where the final was being played. He said that […]","content":"Lucille: The finals of the ongoing FIFA World Cup series between Argentina and France have been contested. Former Indian cricket team player and commentator Ravi Shastri has gone to Qatar to witness this match. He had posted some posts on social media from the Lusail Stadium where the final was being played. He said that Messi is making waves on the field. This means that Messi’s fans are more likely to report that the team is on the field. This match was Messi’s last match. So his fans want him to win this. A total of 88000 fans can watch the match at Lusail Stadium. It is noteworthy that most of them are Argentina supporters. Indian film actor Ranveer Singh is also watching this match. Ravi Shastri shared a post along with him. In this match, Messi scored a goal using the penalty opportunity in the 23rd minute. This was his 6th goal in the current World Cup series.","pubDate":"2022-12-18 17:13:38","image_url":null,"source_id":"thenewsglory","country":["india"],"category":["sports"],"language":"english"},{"title":"BAH vs MAL Dream11 Prediction: Fantasy Cricket Tips, Today's Playing 11, Player Stats, Pitch Report for Malaysia Quadrangular Series 2022-23 Match 8","link":"https://www.sportskeeda.com/fantasy-cricket-mantra/bah-vs-mal-dream11-prediction-fantasy-cricket-tips-today-s-playing-11-player-stats-pitch-report-malaysia-quadrangular-series-2022-23-match-8?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Fantasy Cricket Mantra"],"creator":["Sahil Jain"],"video_url":null,"description":null,"content":null,"pubDate":"2022-12-18 16:49:51","image_url":"https://static.sportskeeda.com/editor/2022/12/873a5-16713626370462-1920.jpg","source_id":"sportskeeda","country":["india"],"category":["sports"],"language":"english"},{"title":"'Hypocrisy is mind-boggling', Sehwag slams Australia for Gabba pitch after two-day Test","link":"https://economictimes.indiatimes.com/news/sports/hypocrisy-is-mind-boggling-sehwag-slams-australia-for-gabba-pitch-after-two-day-test/articleshow/96323208.cms","keywords":null,"creator":null,"video_url":null,"description":"After the first Test between Australia and South Africa ended within two days, former cricketer Virender Sehwag slammed Australia for the Gabba pitch, saying that had it happened in India, it would have been labelled as the end of test cricket and what not.","content":"Synopsis After the first Test between Australia and South Africa ended within two days, former cricketer Virender Sehwag slammed Australia for the Gabba pitch, saying that had it happened in India, it would have been labelled as the end of test cricket and what not. IANS Virender Sehwag, Gautam Gambhir to captain Gujarat Giants, India Capitals in Legends League Cricket After the first Test between Australia and South Africa ended within two days, former cricketer Virender Sehwag slammed Australia for the Gabba pitch, saying that had it happened in India , it would have been labelled as the end of test cricket and what not. A total of 34 wickets fell over the course of six sessions and within two days of the first Test. South Africa were shot out for 152 and 99 runs in two innings while Australia were bundled out for 216 in their first innings and struggled to 35/4 in their second innings to win the match by six wickets on Sunday. In all, 19 wickets fell on the second day on a green top wicket that offered a lot of assistance to both teams' pace attacks. Taking to Twitter after the match, the former India opener pointed out the hypocrisy as the Australia captain and their supporters have been defending the 'dangerous' pitch. \"142 overs and not even lasting 2 days and they have the audacity to lecture on what kind of pitches are needed. Had it happened in India, it would have been labelled the end of Test cricket, ruining Test cricket and whatnot. The Hypocrisy is mind-boggling. #AUSvSA,\" Sehwag tweeted. Despite the sharp criticism of a heavily grassed Gabba strip, Australia captain Pat Cummins said the pitch was not dangerous. \"Personally, I don't mind when the groundsman errs on the greener side occasionally. I've played a lot of Test matches when they've erred on the flatter side, so I think it was the same for both teams,\" said Cummins. \"There was some sideways movement, a little bit of up and down bounce but it was fine. There's no balls jumping off a length or anything like that. No way (was it dangerous),\" he added. Sunday, 18 Dec, 2022 Experience Your Economic Times Newspaper, The Digital Way! Read Complete Print Edition » Front Page Pure Politics Bottom Line Deep Dive More GST Prosecution Threshold Up; Some Offences Decriminalised The Goods and Services Tax (GST) Council decided to decriminalise some violations and doubled the monetary threshold for launching prosecutions to ₹2 crore to prevent taxpayer harassment and improve ease of doing business. Twitter Restores Journo A/cs after Online Backlash Elon Musk’s Twitter reinstated several journalists’ accounts that were suspended for a day over a controversy on publishing public data about the billionaire’s plane. Edelweiss Platform Acquires L&T Road, Power Transmission Assets Infrastructure Yield Plus Strategy, the infrastructure platform managed by Edelweiss Alternatives, has acquired 100% equity stake in Larsen & Toubro Infrastructure Development Projects (L&T IDPL) for an enterprise value of about ₹6,000 crore. Read More News on sehwag australia hypocrisy india virender sehwag cummins pat cummins gabba (Catch all the Business News , Breaking News Events and Latest News Updates on The Economic Times .) Download The Economic Times News App to get Daily Market Updates & Live Business News. ... more less ETPrime stories of the day Policy and regulations Submitted report on autonomy, proposals must enable NFRA to spread its wings: NFRA’s TAC Chair 8 mins read Auto Ahead of Maruti True Value and Mahindra First Choice, Spinny is taking used cars out for a spin 10 mins read Energy security ONGC Videsh drills hard as India moves to get controlling stakes in Russian oil fields 7 mins read Subscribe to ETPrime","pubDate":"2022-12-18 14:37:45","image_url":"https://img.etimg.com/thumb/width-1200,imgsize-41264,resizemode-4,msid-96323208/hypocrisy-is-mind-boggling-sehwag-slams-australia-for-gabba-pitch-after-two-day-test.jpg","source_id":"economictimes_indiatimes","country":["india"],"category":["sports"],"language":"english"},{"title":"I don't see it as a fair contest: South Africa captain Dean Elgar calls out Gabba pitch as bad for Test cricket","link":"https://economictimes.indiatimes.com/news/sports/i-dont-see-it-as-a-fair-contest-south-africa-captain-dean-elgar-calls-out-gabba-pitch-as-bad-for-test-cricket/articleshow/96321860.cms","keywords":null,"creator":null,"video_url":null,"description":"South Africa captain Dean Elgar believes that the Proteas could have defended a target of around 100 runs in a quick match but the Gabba pitch prevented a \"fair combat\" between bat and ball.","content":null,"pubDate":"2022-12-18 12:57:19","image_url":"https://img.etimg.com/thumb/width-1200,imgsize-106050,resizemode-4,msid-96321860/i-dont-see-it-as-a-fair-contest-south-africa-captain-dean-elgar-calls-out-gabba-pitch-as-bad-for-test-cricket.jpg","source_id":"economictimes_indiatimes","country":["india"],"category":["sports"],"language":"english"},{"title":"You know what is coming: Suryakumar Yadav unleashes wristy hits in nets leading upto Ranji Trophy stint","link":"https://economictimes.indiatimes.com/news/sports/you-know-what-is-coming-suryakumar-yadav-unleashes-wristy-hits-in-nets-leading-upto-ranji-trophy-stint/articleshow/96321178.cms","keywords":null,"creator":null,"video_url":null,"description":"The batter took to Instagram to share a video of him smashing his stylish, wristy shots in the nets. SKY, as he is known to his fans, looks completely ready to tear apart his opponents in a bid to fulfill his aspirations to play Test cricket for India","content":null,"pubDate":"2022-12-18 12:21:35","image_url":"https://img.etimg.com/thumb/width-1200,imgsize-59486,resizemode-4,msid-96321178/you-know-what-is-coming-suryakumar-yadav-unleashes-wristy-hits-in-nets-leading-upto-ranji-trophy-stint.jpg","source_id":"economictimes_indiatimes","country":["india"],"category":["sports"],"language":"english"},{"title":"LIVE Pakistan vs England, 3rd Test, Karachi Score: ENG Gain Lead Of 50 Runs On PAK - Cricket Country News","link":"https://news.google.com/__i/rss/rd/articles/CBMi1QFodHRwczovL3d3dy5jcmlja2V0Y291bnRyeS5jb20vbmV3cy9saXZlLXNjb3JlLXBha2lzdGFuLXZzLWVuZ2xhbmQtM3JkLXRlc3QtY3JpY2tldC1rYXJhY2hpLTIwMjItdG9kYXktcGFrLXZzLWVuZy1saXZlLXN0cmVhbWluZy1zb255bGl2LWJhbGwtY29tbWVudGFyeS1iYWJhci1hemFtLWF6aGFyLWFsaS1iZW4tc3Rva2VzLWpvZS1yb290LWFicmFyLWFobWVkLTEwNTgyMTTSAdoBaHR0cHM6Ly93d3cuY3JpY2tldGNvdW50cnkuY29tL25ld3MvbGl2ZS1zY29yZS1wYWtpc3Rhbi12cy1lbmdsYW5kLTNyZC10ZXN0LWNyaWNrZXQta2FyYWNoaS0yMDIyLXRvZGF5LXBhay12cy1lbmctbGl2ZS1zdHJlYW1pbmctc29ueWxpdi1iYWxsLWNvbW1lbnRhcnktYmFiYXItYXphbS1hemhhci1hbGktYmVuLXN0b2tlcy1qb2Utcm9vdC1hYnJhci1haG1lZC0xMDU4MjE0L2FtcC8?oc=5","keywords":null,"creator":null,"video_url":null,"description":"LIVE Pakistan vs England, 3rd Test, Karachi Score: ENG Gain Lead Of 50 Runs On PAK  Cricket Country NewsRehan Ahmed shows early signs of substance as England relive their fragile legspin dream  ESPNcricinfo3rd Test: England dismiss Pakistan for 304 on Day 1  Rediff.comPakistan spinners reduce napping England to 140-4 in third Test  Geo NewsPAK vs ENG 3rd Test: Ramiz Raja`s PCB slammed for WORST FACILITY, DIRTY SEATS at Karachi stadium, fans shar...  Zee NewsView Full coverage on Google News","content":null,"pubDate":"2022-12-18 12:12:21","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"BBL 2022: Match 7, REN vs THU Match Prediction – Who will win today’s BBL match between Melbourne Renegades and Sydney Thunder? - CricTracker","link":"https://news.google.com/__i/rss/rd/articles/CBMisAFodHRwczovL3d3dy5jcmljdHJhY2tlci5jb20vY3JpY2tldC1tYXRjaC1wcmVkaWN0aW9ucy9iYmwtMjAyMi1tYXRjaC03LXJlbi12cy10aHUtbWF0Y2gtcHJlZGljdGlvbi13aG8td2lsbC13aW4tdG9kYXlzLWJibC1tYXRjaC1iZXR3ZWVuLW1lbGJvdXJuZS1yZW5lZ2FkZXMtYW5kLXN5ZG5leS10aHVuZGVyL9IBtgFodHRwczovL3d3dy5jcmljdHJhY2tlci5jb20vY3JpY2tldC1tYXRjaC1wcmVkaWN0aW9ucy9iYmwtMjAyMi1tYXRjaC03LXJlbi12cy10aHUtbWF0Y2gtcHJlZGljdGlvbi13aG8td2lsbC13aW4tdG9kYXlzLWJibC1tYXRjaC1iZXR3ZWVuLW1lbGJvdXJuZS1yZW5lZ2FkZXMtYW5kLXN5ZG5leS10aHVuZGVyLz9hbXA9MQ?oc=5","keywords":null,"creator":null,"video_url":null,"description":"BBL 2022: Match 7, REN vs THU Match Prediction – Who will win today’s BBL match between Melbourne Renegades and Sydney Thunder?  CricTrackerREN vs THU Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update- KFC Big Bash League  Cricket AddictorMelbourne Renegades vs Sydney Thunder Big Bash League 2022-23 Match No. 5 Preview, LIVE Streaming details a...  Zee NewsREN vs THU Dream11 Prediction, Fantasy Cricket Tips, Playing XI, Pitch Report & Injury Updates for Today Match 7  CricTrackerREN vs THU Dream11 Prediction: Fantasy Cricket Tips, Today's Playing 11, Player Stats, Pitch Report for BBL 2022-23, Match 7  SportskeedaView Full coverage on Google News","content":null,"pubDate":"2022-12-18 11:30:00","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"On Argentina Vs France FIFA World Cup Final Question, KL Rahul's Response To Journo Leaves Everyone .. - NDTV Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMikwFodHRwczovL3Nwb3J0cy5uZHR2LmNvbS9jcmlja2V0L29uLWFyZ2VudGluYS12cy1mcmFuY2UtZmlmYS13b3JsZC1jdXAtZmluYWwtcXVlc3Rpb24ta2wtcmFodWxzLXJlc3BvbnNlLXRvLWpvdXJuby1sZWF2ZXMtZXZlcnlvbmUtaW4tc3BsaXRzLTM2MTczODXSAZkBaHR0cHM6Ly9zcG9ydHMubmR0di5jb20vY3JpY2tldC9vbi1hcmdlbnRpbmEtdnMtZnJhbmNlLWZpZmEtd29ybGQtY3VwLWZpbmFsLXF1ZXN0aW9uLWtsLXJhaHVscy1yZXNwb25zZS10by1qb3Vybm8tbGVhdmVzLWV2ZXJ5b25lLWluLXNwbGl0cy0zNjE3Mzg1L2FtcC8x?oc=5","keywords":null,"creator":null,"video_url":null,"description":"On Argentina Vs France FIFA World Cup Final Question, KL Rahul's Response To Journo Leaves Everyone ..  NDTV Sports‘Will Team IND stand divided on ARG vs FRA?’: KL leaves reporters in splits  Hindustan TimesIndian Cricket Team: KL Rahul reveals, 'Indian team will watch FIFA WC Final tonight' Check who they are backing & Follow Argentina France Final LIVE  InsideSportFIFA World Cup Final: Messi Targets World Cup Glory Against Mbappe's France | NDTV 24x7 Live TV  NDTV'Don’t Know Who Argentina or France Supporters Are': KL Rahul Shares Indian Players' Plans For FIFA World C  News18View Full coverage on Google News","content":null,"pubDate":"2022-12-18 10:50:48","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"#39;Cricket had become an escape#39;: Devika Vaidya on transcending loss, mental-health battles with India comeback","link":"https://www.moneycontrol.com/news/sports/39cricket-had-becomeescape39-devika-vaidyatranscending-loss-mental-health-battlesindia-comeback_16778831.html","keywords":null,"creator":null,"video_url":null,"description":"Being an elite cricketer can often be a lonely place. Being one in India, ever more so.","content":"Devika Vaidya. (Photo: Twitter) The match-day vibe is unusually quiet among the Indian players. It is February 2019, and India’s Board President XI side, led by Smriti Mandhana, take on England Women in a one-day warm-up game under an hour at the Wankhede Stadium. But this group is far from their ebullient self, the buzz at the warm-up atypically muzzled. The Board President XI squad huddles near the media-box end on the Monday morning. Their black armbands come into view. Devika Vaidya, the India spin-bowling allrounder part of the squad, doesn’t, though — at any point through the match. It has barely been 24 hours since her mother’s sudden passing due to cardiac arrest. Vaidya, 21 at the time, had been practising with the squad at the Wankhede Stadium in Mumbai when the tragedy occurred, in her hometown Pune. *** Nearly four years on, Vaidya sits in the Coochbehar room at the Brabourne Stadium, a stone’s throw away from Wankhede. She is addressing her first press conference as an India player, after her side’s seven-run loss to Australia in the penultimate T20I of the five-match series on Saturday. Related stories World Cup Final: How to Watch Argentina vs France India beat Bangladesh by 188 runs in first Test Italy didn't qualify for the football world cup, but it’s all set to celebrate another trophy India women's cricket team after Super Overs win, 2022. (Photo: Twitter) On a night her 45-ball 72-run stand with captain Harmanpreet Kaur almost formed the pivot to a series-levelling win, Vaidya appears remarkably level-headed, self-assured. Until not long ago, she had been wrestling demons within her mind to attain a semblance of this equanimity. “I had sought professional help,” says Vaidya about the emotionally turbulent phase following her mother’s death where she found herself drifting away from the game and the world around her. “But then I realised that the best way to get out of such a zone is speaking it out. “I am not someone who would sit and talk about my problems with anyone or even with my family and friends. It took me a lot of efforts to speak up and that helped me. That’s how I started trusting people other than just my mom. Then I realised there is a world apart from my mom. It took some time but I am fine now.” To most on the Indian women’s cricket circuit, Vaidya’s mother, Maushami, was a constant presence on tours. Her premature demise left a void so big in Vaidya’s life, and career, her focus drowned amid the shriek of silence the tragedy birthed. \"It was a shock for the next one year. I couldn't realise what had happened because we were continuously playing,\" she recalls. \"That was some kind of an escape… playing was an escape because I didn't want to go home. Something has happened, I don't know what has happened. I didn't want to know or get used to the fact that she is not there. \"The first year was me escaping reality.\" The defeaning quiet the COVID-19 pandemic’s first wave plunged the world into only worsened matters for Vaidya, too, at a personal level. The solitude, however, also brought with it perspective and acceptance. “After COVID started, it hit me that the person so close to me was not with me anymore,” says Vaidya. “I then had to support my family also. It was a partnership there also — taking care of my grandparents, and they taking care of me. It was a long journey but then some things have to be accepted.” Even before the personal loss pushed her into a corner, a slew of ill-timed illnesses and injuries that preceded it upended her career. “It was all good until 2017,” remembers Vaidya, who played her only T20I before the ongoing series in 2014, at 17. She had good all-round showings in the 2017 ODI World Cup Qualifiers to make the squad for the tournament proper, too. But a shoulder injury a month out from the World Cup shoved her out of contention. \"Girls are not allowed here\" @OfficialDevika talks about the difficulties she faced in order to get a proper cricket training. Full conversation loading soon... #INDvAUS #CricketTwitter #TheOtherSide pic.twitter.com/k1gTtMffFI — Women’s CricZone (@WomensCricZone) December 14, 2022 Being an elite cricketer can often be a lonely place. Being one in India, ever more so. That’s down to mental-health well-being, by and large, remaining far from a priority in the country. The discourse around it is well off the mainstream, any structured support for cricketers across the food chain few and far between. In a recent conversation with ESPNcricinfo , former India men cricketer Robin Uthappa shed light on this harsh reality about cricket’s mental-health crisis. The emotional wreck the death of her sister and mother last year, during the devastating second COVID-19 wave in the country, left India women batter Veda Krishnamurthy remains another poignant exhibit. To Vaidya’s good fortune, though, she found allies when solace seemed unattainable. With support from friends, family, her state association Maharashtra, and fellow players, Vaidya pulled herself back from the brink. In longtime friend and Maharashtra teammate, Mandhana, the India T20I vice-captain, she found a confidante. “There were a couple of seniors… I used to speak with Smriti that, since we are playing together from childhood, we wanted to play and win a World Cup together,” Vaidya says. “We used to talk regularly and there were some India players who were in contact with me and the officials as well. They used to back me saying, ‘You are a good bowler and batter.’ It’s about getting in the right mindset and I would do well.” At her lowest, Vaidya remembers telling herself, “I knew that if I get through this phase, nothing can stop me.” The motivation to help India win a world title, a silverware that still eludes them, spurred her on to find her way back to a sport that’s both been a friend and foe. “At the end of the day, it was always a dream to come back, play for the country, win a couple of World Cups,” she says. “That dream actually kept me going. Whenever I used to think, “ Nahi khelna hai abhi, bass ho gaya (enough is enough, I don’t want to play anymore),” the thought that ‘if I don’t play now, how will I win a World Cup’? used to haunt me and kept me going. Thank you to everyone who came out in large numbers to support us. Also to the millions of people watching at home! pic.twitter.com/cuAspL6nx5 — Devika Vaidya (@OfficialDevika) December 12, 2022 The enterprise has held Vaidya in good stead. A promising show in the domestic season saw her score 130 runs in five innings at an average of 32.50 and a strike rate of 109.24, apart from picking up six wickets, in the inter-state T20s. On the back of it, she has now played all four T20Is of the Australia series, slotting in as the first-choice leg-spinner who is more than handy with the bat, too. Her three wickets in four innings so far have had classical leg-spin bowling at its core, on pitches both teams have scored over 170 almost at will. But it’s with the bat that Vaidya has left a more decisive imprint on the series and, potentially, on the squad to be soon picked for the T20 World Cup in South Africa in February. Coming in at No. 5 for all four fixtures but the third one, where she batted at No. 7, Vaidya, in the fashion of a resourceful accumulator, has played something of a foil to the big hitters. Most memorably, in India’s only win in the series so far, it was Vaidya’s last-ball four in a 5-ball 11 that took the match to a Super Over and, the home team eventually to victory, before a record 47,000-strong crowd. “My batting is totally upon the situation — whether I have to play my shots or to rotate strike and give confidence to myself and the other batter,” she says of her role in the line-up. “It depends on when we are batting and which phase and play accordingly. That’s the challenge and I am really enjoying it.” *** Short-statured, left-hand batter Vaidya doesn’t have the build, power, or reach to clear the boundary the way the likes of Harmanpreet, Mandhana, Shafali Verma or Richa Ghosh does. But she keeps the scoreboard ticking, albeit at a strike rate that can do with some working on, with a knack for finding the gaps every now and then. In Harleen Deol, a batting all-rounder who bowls leg-spin, she has a direct competition in the squad. And with the return of the big-hitting pace-bowling allrounder Pooja Vastrakar, who is missing this series through injury, a rejig in the make-up of the starting XI is imminent.","pubDate":"2022-12-18 10:26:48","image_url":null,"source_id":"money_control","country":["india"],"category":["sports"],"language":"english"},{"title":"IND vs BAN 1st Test: KL Rahul opens on Rohit Sharma's availability for second Test in Dhaka","link":"https://www.indiatvnews.com/sports/cricket/ind-vs-ban-1st-test-kl-rahul-opens-on-rohit-sharma-s-availability-for-second-test-in-dhaka-india-vs-bangladesh-rohit-sharma-injury-update-dhaka-test-2022-12-18-832175","keywords":null,"creator":null,"video_url":null,"description":"IND vs BAN 1st Test: KL Rahul led Indian cricket team defeated Shakib Al Hasan's Bangladesh in the first Test in Chattogram by 188 runs. The Indian team, who is facing a few injury issues were without their regular skipper Rohit Sharma in the Test match but managed to grab a 1-0 lead in the two-match series. It is not clear that Sharma, who was ruled out of the first Test due to a thumb injury, will be available for the second Test in Dhaka. However, the stand-in skipper KL Rahul has provided an update on Sharma.","content":null,"pubDate":"2022-12-18 10:08:04","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"Starc claims No. 300 with a trademark inswinger - ESPNcricinfo","link":"https://news.google.com/__i/rss/rd/articles/CBMifWh0dHBzOi8vd3d3LmVzcG5jcmljaW5mby5jb20vc3RvcnkvYXVzLXZzLXNhLTFzdC10ZXN0LTIwMjItMjMtbWl0Y2hlbGwtc3RhcmMtY2xhaW1zLW5vLTMwMC13aXRoLWEtdHJhZGVtYXJrLWluc3dpbmdlci0xMzUwMTgw0gGKAWh0dHBzOi8vd3d3LmVzcG5jcmljaW5mby5jb20vc3RvcnkvYXVzLXZzLXNhLTFzdC10ZXN0LTIwMjItMjMtbWl0Y2hlbGwtc3RhcmMtY2xhaW1zLW5vLTMwMC13aXRoLWEtdHJhZGVtYXJrLWluc3dpbmdlci0xMzUwMTgwP3BsYXRmb3JtPWFtcA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Starc claims No. 300 with a trademark inswinger  ESPNcricinfoStarc gets 300th Test wicket after Australia take slender lead | Cricbuzz.com - Cricbuzz  CricbuzzStarc storms to 300 with unplayable ball #PlayOfTheDay  cricket.com.auMitchell Starc makes Test history as 'crazy' carnage stuns cricket world  Yahoo New Zealand NewsOur Call Of Mitchell Starc's 300th Wicket | Triple M Cricket  Triple MView Full coverage on Google News","content":null,"pubDate":"2022-12-18 09:35:58","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"AUS vs SA: मिचेल स्टार्क का खुलासा- 'एलिसा हीली की वजह से मैंने कुछ समय तक टेस्ट क्रिकेट को नहीं दी प्राथमिकता'","link":"https://www.abplive.com/sports/cricket/aus-vs-sa-starc-said-he-has-sacrificed-some-time-of-his-test-career-to-spend-more-time-with-alyssa-healy-2285062","keywords":["Cricket"],"creator":["ABP Live"],"video_url":null,"description":"Mitchell Starc On Test Cricket: ऑस्ट्रेलिया के तेज गेंदबाज मिचेल स्टार्क और कंगारू महिला क्रिकेट टीम की विकेटकीपर बल्लेबाज एलिसा हीली क्रिकेट बिरादरी में सबसे पसंदीदा जोड़ियों में से एक है. यह स्टार जोड़ी अपने लिए तो समय निकालती ही है लेकिन जब दोनों में कोई बड़ा मुकाबला खेलता है तभी यह एक दूसरे को चीयर करने मैदान पर पहुंच जाते हैं. इस साल इंग्लैंड के खिलाफ महिला वनडे विश्व कप फाइनल में स्टार्क अपनी वाइफ को चीयर करने न्यूजीलैंड पहुंचे थे.  टेस्ट करियर का समय कुर्बान किया मिचेल स्टार्क ने कहा कि उन्होंने हीली के साथ समय बिताने के लिए अपने टेस्ट करियर का कुछ समय कुर्बान कर दिया है. स्टार्क और हीली बचपन के दोस्त हैं. दोनों ने साल 2016 में शादी की थी. जब मिचेल स्टार्क से पूछा गया क्या उन्होंने टेस्ट क्रिकेट को प्राथमिकता नहीं दी? इस सवाल के जवाब में उन्होंने कहा, मैंने इसे प्राथमिकता नहीं दी होगी. मैंने एलिसा के साथ अधिक समय बिताने के लिए कुछ समय का त्याग किया है. स्टार्क ने पूरे किए 300 टेस्ट विकेट मिचेल स्टार्क ने ब्रिस्बेन में साउथ अफ्रीका के खिलाफ मैच में अपने 300 टेस्ट विकेट पूरे किेए. उन्होंने दक्षिण अफ्रीका बल्लेबाज रासी वान डर डुसें को आउट कर यह उपलब्धि हासिल की. वह टेस्ट क्रिकेट में सबसे ज्यादा विकेट लेने वाले ऑस्ट्रेलिया के सातवें गेंदबाज हैं. ऑस्ट्रेलिया के लिए स्टार्क से ज्यादा टेस्ट विकेट शेन वॉर्न 708, ग्लेन मैक्ग्रा 563, नाथल लॉयन 454, डेनिस लिली 355, मिचेल जॉनसन 313 और ब्रेट ली ने 310 विकेट लिए हैं. वैसे स्टार्क ओवर ऑल टेस्ट क्रिकेट में सबसे ज्यादा विकेट लेने वाले विश्व के 37वें बॉलर हैं. यह भी पढ़ें: AUS vs SA: मिचेल स्टार्क की ट्रिपल सेंचुरी पूरी, साउथ अफ्रीका के बैटर को बोल्ड करने के बाद ऐसा था रिएक्शन, देखें VIDEO IND vs BAN: रोहित शर्मा की वापसी केएल राहुल ने दिया बड़ा अपडेट, जानें दूसरे टेस्ट में खेलेंगे या नहीं","content":null,"pubDate":"2022-12-18 09:25:50","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2022/12/18/e5f7f5fc2cf24eb6163a3d2b56b0fa381671355132578366_original.jpg","source_id":"abplive","country":["india"],"category":["sports"],"language":"hindi"},{"title":"Argentina v France World Cup Final: What is Emiliano Martinez’s record at penalties?","link":"https://www.hitc.com/en-gb/2022/12/18/argentina-v-france-world-cup-final-what-is-emiliano-martinezs-record-at-saving-penalties/?utm_source=rss&utm_medium=rss&utm_campaign=argentina-v-france-world-cup-final-what-is-emiliano-martinezs-record-at-saving-penalties","keywords":["Argentina Football Team","Aston Villa","Competitions","FIFA World Cup","Football","France Football Team","Premier League","Teams","emiliano martinez"],"creator":["Amir Mir"],"video_url":null,"description":"What is Emiliano Martinez’s record at penalties? Here we take a look at the Uber-confident Argentina and Aston Villa goalkeeper ahead of the 2022 World... The post Argentina v France World Cup Final: What is Emiliano Martinez’s record at penalties? appeared first on HITC.","content":"Photo by Eric Verhoeven/Soccrates/Getty Images What is Emiliano Martinez’s record at penalties? Here we take a look at the Uber-confident Argentina and Aston Villa goalkeeper ahead of the 2022 World Cup final against France in Qatar on Sunday. The 30-year-old, nicknamed ‘Dibu’, has already showcased his penalty-saving prowess when he stopped two spot-kicks during Argentina’s nerve-racking quarter-final win over The Netherlands. Two World Cup finals in history have gone to penalties, the most recent in 2006 when Italy beat France in that in-famous Zinedine Zidane headbutt final. One is surely due? Probably not if you are repping either Argentina or France, otherwise, bring it all on.  WHAT IS EMILIANO MARTINEZ’S RECORD AT SAVING PENALTIES? Photo by Jean Catuffe/Getty Images From his cricket-like sledging to super-confident body language, Villa’s number one has all the tools required to deny any man from the penalty spot, whether it’s flying five feet to his right or thrash-talking the opponent that he balloons his effort over the ball, and he has the record to back it up. During his senior career, the 30-year-old has faced 21 penalties, saving or watching ten of those being missed, according to transfermarkt. The former Arsenal man most recently faced a penalty in October against Fulham when Aleksandar Mitrovic scored past him in what was Steven Gerrard’s last game as Aston Villa manager. Photo by ODD ANDERSEN/AFP via Getty Images The last time he denied someone from the spot was when his thrash-talking resulted in Bruno Fernandes blazing over the bar during Villa’s 1-0 win over Manchester United at Old Trafford last season.  Added to that, he has been involved in two penalty shootouts – both on the international stage, including the one noted above against the Dutch. But one of Martinez’s most famous moments came when Argentina beat Colombia 3-2 on pens at the 2021 Copa America – he saved three penalties that day. Hugo Lloris may have the experience or the World Cup medal from 2018 already around his neck, but if it comes to a penalty shootout, then Martinez is going to back himself all the way ahead of France and Tottenham’s number one. The post Argentina v France World Cup Final: What is Emiliano Martinez’s record at penalties? appeared first on HITC.","pubDate":"2022-12-18 09:00:00","image_url":null,"source_id":"hitc","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Cummins pays tribute to Starc after 300th Test wicket | Australia v South Africa 2022-23 - cricket.com.au","link":"https://news.google.com/__i/rss/rd/articles/CBMiK2h0dHBzOi8vd3d3LnlvdXR1YmUuY29tL3dhdGNoP3Y9ZTBDeV8wUlB2MUXSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Cummins pays tribute to Starc after 300th Test wicket | Australia v South Africa 2022-23  cricket.com.au‘They can eat humble pie’: How ‘literally impossible’ moment made Starc a legend  Fox SportsOur Call Of Mitchell Starc's 300th Wicket | Triple M Cricket  Triple MStarc seals spot in the elite with Test wicket No.300  cricket.com.au'Superstar' Mitchell Starc joins exclusive club with 300th Test wicket for Australia  Wide World of SportsView Full coverage on Google News","content":null,"pubDate":"2022-12-18 08:57:45","image_url":null,"source_id":"google","country":["australia"],"category":["sports"],"language":"english"},{"title":"Elgar asked umpires if Gabba wicket was unsafe | Australia v South Africa 2022-23 - cricket.com.au","link":"https://news.google.com/__i/rss/rd/articles/CBMiK2h0dHBzOi8vd3d3LnlvdXR1YmUuY29tL3dhdGNoP3Y9MkYxcXF4VVY5SWvSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Elgar asked umpires if Gabba wicket was unsafe | Australia v South Africa 2022-23  cricket.com.auUmpires ignored questions about Gabba pitch - Dean Elgar | Cricbuzz.com - Cricbuzz  CricbuzzAustralia defeat South Africa to close in on World Test Championship final  ICC CricketAussies take 1-0 series lead after chaotic 19-wicket day | Australia v South Africa 2022-23  cricket.com.auPIX: Australia down South Africa in two-day farce  Rediff.comView Full coverage on Google News","content":null,"pubDate":"2022-12-18 08:31:23","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"AUS vs SA 1st Test: Aussie bowlers run riot in opening Test against Proteas; start series on high note","link":"https://www.indiatvnews.com/sports/cricket/aus-vs-sa-1st-test-aussies-bowlers-run-riot-in-opening-test-against-proteas-start-series-on-high-note-australia-vs-south-africa-wtc-2023-pat-cummins-2022-12-18-832152","keywords":null,"creator":null,"video_url":null,"description":"AUS vs SA 1st Test: The Australian Cricket Team on Sunday thumped the Proteas side in the opening Test of the three-match series. Led by skipper Pat Cummins, the Aussie bowlers run riot to the South African side and defeated them by 6 wickets inside two days of cricketing action in The Gabba, Brisbane. For his match-turning 92 in the first innings, Travis Head was adjudged the Player of the Match.","content":null,"pubDate":"2022-12-18 08:30:10","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"Spinner and teen freak wreak havoc for England - Geelong Advertiser","link":"https://news.google.com/__i/rss/rd/articles/CBMirgFodHRwczovL3d3dy5nZWVsb25nYWR2ZXJ0aXNlci5jb20uYXUvc3BvcnQvY3JpY2tldC9qYWNrLWxlYWNoLWFuZC1yZWhhbi1haG1lZC1zaGluZS1mb3ItZW5nbGFuZC1vcGVuaW5nLWRheS1vZi10aGlyZC1wYWtpc3Rhbi10ZXN0L25ld3Mtc3RvcnkvYzA0ZTk2NTNhZmEwNjVjNDU4M2M1ZDQwZjNjNzE4YjbSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Spinner and teen freak wreak havoc for England  Geelong AdvertiserEngland teen claims two scalps on dream debut  cricket.com.auEngland rookie celebrates first Test scalp  The West AustralianPakistan spinners reduce napping England to 140-4 in third Test  Geo NewsPakistan trail England by 29 runs at stumps: third Test, day two – as it happened  The GuardianView Full coverage on Google News","content":null,"pubDate":"2022-12-18 08:04:40","image_url":null,"source_id":"google","country":["australia"],"category":["sports"],"language":"english"},{"title":"Cricket: Pitch farce causes mayhem as Australia thump South Africa","link":"https://www.nzherald.co.nz/sport/cricket-pitch-farce-causes-mayhem-as-australia-thump-south-africa/VCYRJIRO2REYPMYF2KDIQG6AMY/","keywords":null,"creator":null,"video_url":null,"description":"Australia have defeated South Africa within two days on a green monster at the Gabba.","content":null,"pubDate":"2022-12-18 07:51:10","image_url":"https://www.nzherald.co.nz/resizer/rGb0Qf1Y0xFOI6x43nYq-SnTOwc=/300x300/smart/filters:quality(70)/cloudfront-ap-southeast-2.images.arcpublishing.com/nzme/3GZ625T77NBV5KJR5LFXI7HVNI.jpg","source_id":"nzherald","country":["new zealand"],"category":["sports"],"language":"english"},{"title":"Bangladesh vs India, 1st Test: KL Rahul shares an update on Rohit Sharma ahead of 2nd Test - India Today","link":"https://news.google.com/__i/rss/rd/articles/CBMimgFodHRwczovL3d3dy5pbmRpYXRvZGF5LmluL3Nwb3J0cy9jcmlja2V0L3N0b3J5L2JhbmdsYWRlc2gtdnMtaW5kaWEtMXN0LXRlc3Qta2wtcmFodWwtc2hhcmVzLWFuLXVwZGF0ZS1vbi1yb2hpdC1zaGFybWEtYWhlYWQtb2YtMm5kLXRlc3QtMjMxMDUzNS0yMDIyLTEyLTE40gGeAWh0dHBzOi8vd3d3LmluZGlhdG9kYXkuaW4vYW1wL3Nwb3J0cy9jcmlja2V0L3N0b3J5L2JhbmdsYWRlc2gtdnMtaW5kaWEtMXN0LXRlc3Qta2wtcmFodWwtc2hhcmVzLWFuLXVwZGF0ZS1vbi1yb2hpdC1zaGFybWEtYWhlYWQtb2YtMm5kLXRlc3QtMjMxMDUzNS0yMDIyLTEyLTE4?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Bangladesh vs India, 1st Test: KL Rahul shares an update on Rohit Sharma ahead of 2nd Test  India TodayShubman Gill Likely To Make Way For Rohit Sharma: Experts  NDTV‘Rohit ko bolo ghar baithe’: Jadeja reacts to reports of India captain’s return  Hindustan TimesIND Vs BAN: Rohit Sharma Recovered From His Thumb Injury, Likely To Be Available For 2nd Test Against Bangladesh  ICC CRICKET SCHEDULEKL Rahul Provides Update On Rohit Sharma's Availability For 2nd Test vs Bangladesh  NDTV SportsView Full coverage on Google News","content":null,"pubDate":"2022-12-18 07:43:21","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Updated World Test Championship Points Table: India Take Second Spot After Big Win As South Africa S.. - NDTV Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMijgFodHRwczovL3Nwb3J0cy5uZHR2LmNvbS9jcmlja2V0L3VwZGF0ZWQtd29ybGQtdGVzdC1jaGFtcGlvbnNoaXAtcG9pbnRzLXRhYmxlLWluZGlhLXRha2Utc2Vjb25kLXNwb3QtYWZ0ZXItYmlnLXdpbi1hcy1zb3V0aC1hZnJpY2Etc2xpcC0zNjE2OTYy0gGUAWh0dHBzOi8vc3BvcnRzLm5kdHYuY29tL2NyaWNrZXQvdXBkYXRlZC13b3JsZC10ZXN0LWNoYW1waW9uc2hpcC1wb2ludHMtdGFibGUtaW5kaWEtdGFrZS1zZWNvbmQtc3BvdC1hZnRlci1iaWctd2luLWFzLXNvdXRoLWFmcmljYS1zbGlwLTM2MTY5NjIvYW1wLzE?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Updated World Test Championship Points Table: India Take Second Spot After Big Win As South Africa S..  NDTV SportsUpdated ICC World Test Championship Points Table After India vs Bangladesh 1st Test, WTC Table  Cricket AddictorHow AUS' big win over SA puts India back in contention for WTC final  Hindustan TimesWTC 2023 Final: India in driving seat for WTC final spot after Aussies down South Africa in Gabba  India TV NewsBangladesh vs India: After KL Rahul and Co’s win in Chattogram in first Test, here’s how table looks  Scroll.inView Full coverage on Google News","content":null,"pubDate":"2022-12-18 07:26:14","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"}]}