{"newsArray":[{"title":"English county cricket star brings up his 400 with тАШmagnificentтАЩ six in recording-breaking knock","link":"https://247newsaroundtheworld.com/sports/english-county-cricket-star-brings-up-his-400-with-magnificent-six-in-recording-breaking-knock/","keywords":["Sports"],"creator":["247 News Around The World"],"video_url":null,"description":"247 News Around The World 247 News Around The World English county cricket star brings up his 400 with тАШmagnificentтАЩ six inтАж The post English county cricket star brings up his 400 with тАШmagnificentтАЩ six in recording-breaking knock appeared first on 247 News Around The World.","content":"247 News Around The World 247 News Around The World English county cricket star brings up his 400 with тАШmagnificentтАЩ six in recording-breaking knock for the ages Glamorgan batsman Sam Northeast spent 82 overs in the middle to score an unbeaten quadruple ton The 32-year-old brought up the record knock with consecutive sixes Northeast joins a quality list in first class cricket, with Brian Lara and Bradman By Stirling Taylor For Daily Mail Australia Published: 20:37 EDT, 23 July 2022 | Updated: 20:43 EDT, 23 July 2022 --> --> --> English county cricketer Sam Northeast has played himself into the first class record books, knocking a stunning 410 not out for his Glamorgan side on Saturday, that was stamped with a massive six past the four-century achievement. The 32-year-old patiently stroked his way to the quadruple ton after facing 450 deliveries in the middle, helping his Welsh side reach a club high 795 first innings total. Glamorgan batsman Sam Northeast slogs a huge six to bring up a record 400 not out innings, becoming the 11th individual to log the mammoth score Northeast came out against the Leicestershire bowling attack in the sixth over, after both openers were dismissed for three runs combined. The Englishman joins a world-class list of batsman to reach the mammoth total, becoming the 11th individual to smack 400 plus. The 192-game first class number four brought up 400 with a cracking slog sweep, smacking quick Roman Walker back over his head. He continued to run a muck, smoking another six on the following ball, embarrassing the home side. Northeast is just 34 runs short of 12,000 first class career runs and has an average of 40 across 325 innings. The England under-19 representative spent 82 overs in the middle, as Glamorgan led by 211 on the final stint of the four day test. Northeast raises the bat after reaching a century against Nottinghamshire on July 13 тАУ he has made 11966 first class runs The side went on to bowl out Leicestershire for 183, winning the division two match by an innings and 28 runs. Cricket fanatics were quick to congratulate Northeast on his huge innings. тАШTake a bow Sam NortheastтАжwho just became the first ever Glamorgan player to score 400 in an innings. And heтАЩs still going on 410 off 450 balls,тАЩ BBC commentator Aatif Nawaz wrote on Twitter. Northeast was joined by number seven Glamorgan batsman Chris Cooke, to combine for a record 461 run partnership, with Cooke not out on 191. West Indies legend Brian Lara creates cricket history in 1994 after surpassing Garfield Sobers first innings record of 365 Legends of the game Brian Lara and Donald Bradman are two batsman the Welshman played himself into a prestigious group with, scoring 501* and 452* respectively. In 1994, West Indian icon Brian Lara amassed 501 runs off 427 deliveries, including 62 fours and 10 sixes тАУ he remains the only first class batsman to surpass 500. Advertisement Share or comment on this article: Post source: Daily mail The post English county cricket star brings up his 400 with тАШmagnificentтАЩ six in recording-breaking knock appeared first on 247 News Around The World.","pubDate":"2022-07-24 02:11:04","image_url":null,"source_id":"247newsaroundtheworld","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"BCCI gave away Rs 4 crore in cash to Tokyo Olympic medalists: Report","link":"https://www.business-standard.com/article/sports/bcci-gave-away-rs-4-crore-in-cash-to-tokyo-olympic-medalists-report-122072400006_1.html","keywords":null,"creator":null,"video_url":null,"description":"The Board of Control for Cricket in India (BCCI) spent Rs 4 crore in giving cash awards to India's Tokyo Olympics medalists earlier this year, a report said","content":"The Board of Control for Cricket in India (BCCI) spent Rs 4 crore in giving cash awards to India's Tokyo Olympics medallists earlier this year, a report said. During its recent Apex Council meeting, the Indian cricket board revealed its expenditure on other stuff besides cricket to its members. As per the BCCI document, the board donated Rs 10 crore to the Indian Olympic Association to support the country's athletes competing at the Tokyo Olympic Games, a Times of India report said. Earlier, late in March, the Indian cricket board felicitated Olympic champion Neeraj Chopra, bronze medallist Lovlina Borgohain and members of the bronze-medal-winning Indian men's hockey team before the IPL's opening match. Javelin thrower Chopra was awarded Rs 1 crore while the hockey team was given Rs 1.25 crore in total. Boxer Lovlina Borgohain was awarded Rs 25 lakh. Apart from them, Rs 50 lakh each was also awarded to the two silver medallists -- weightlifter Mirabai Chanu and wrestler Ravi Dahiya. In line with Borgohain, the other bronze medallists -- shuttler PV Sindhu and wrestler Bajrang Punia -- were given Rs 25 lakh each. The BCCI spent Rs 5 crore on PM Care Mementos for Olympics participants. Close to ? 9.5 crore were also spent on 'Support to Indian Contingent for Tokyo Olympics' and its sub-categories. The report further said that BCCI also donated Rs 3.8 cr to buy Oxygen Concentrators during the second wave of the Covid-19 pandemic last year. Notably, on May 24, 2021, the BCCI had announced that it would contribute 2000 Oxygen concentrators (10-Litre capacity) to boost India's efforts in overcoming the deadly virus. \"The nation has been hit by an unprecedented second wave of the coronavirus with demands for medical equipment and life-saving oxygen witnessing a major spike. Over the next few months, the Board will distribute the concentrators across India with the hope that critical medical aid and care will be provided to the needy patients and this initiative will reduce the havoc unleashed by the pandemic,\" the BCCI had said in a statement at that time. --IANS avn/bsk (Only the headline and picture of this report may have been reworked by the Business Standard staff; the rest of the content is auto-generated from a syndicated feed.)","pubDate":"2022-07-24 02:09:00","image_url":"https://bsmedia.business-standard.com/_media/bs/img/article/default/1220724/thumb-122072400006.jpg","source_id":"business-standard","country":["india"],"category":["sports"],"language":"english"},{"title":"тАШMy goal is to play all three formats for EnglandтАЩ: Sam Curran is ready to be the new Ben Stokes","link":"https://247newsaroundtheworld.com/sports/my-goal-is-to-play-all-three-formats-for-england-sam-curran-is-ready-to-be-the-new-ben-stokes/","keywords":["Sports"],"creator":["247 News Around The World"],"video_url":null,"description":"247 News Around The World 247 News Around The World тАШMy goal is to play all three formats for EnglandтАЩ: Sam CurranтАж The post тАШMy goal is to play all three formats for EnglandтАЩ: Sam Curran is ready to be the new Ben Stokes appeared first on 247 News Around The World.","content":"247 News Around The World 247 News Around The World тАШMy goal is to play all three formats for EnglandтАЩ: Sam Curran prepares to show he can be the new Ben Stokes as the all-rounder looks to back up his impressive display at Old Trafford in the series decider against South Africa Sam Curran made a vital 35 off 18 balls against South Africa in the second ODI He also took the key wicket of David Miller as the Proteas slumped to 83 all out The all-rounder scored his maiden first class hundred earlier this season SurreyтАЩs Curran said his goal is to play тАШall three formats for EnglandтАЩ By Richard Gibson For The Mail On Sunday Published: 17:30 EDT, 23 July 2022 | Updated: 18:42 EDT, 23 July 2022 --> --> --> Sam Curran will get a further chance today to show he can fill the void created by Ben StokesтАЩs one-day international retirement as England attempt to complete a come-from-behind Royal London Series win over South Africa. Curran produced an impactful performance in the first match of the post-Stokes era at Emirates Old Trafford on Friday night, cracking 35 off 18 deliveries to resuscitate an England innings that had slipped to 101 for six. Then, having transformed the direction of the contest in Manchester with the bat, he effectively settled its outcome with ball in hand when he dismissed the dangerous David Miller to leave the Proteas 27 for five chasing 202 тАФ thus setting up SundayтАЩs decider at Headingley. Sam Curran scored his maiden first class hundred for Surrey earlier this summer тАШIтАЩve always looked up to Stokesy as a cricketer. I almost want to try to copy him. HeтАЩs obviously a huge loss and the boys are going to miss him,тАЩ Curran said. тАШIтАЩve always tried to follow the way he trains and the way he plays. Obviously heтАЩs retired from one-day cricket now but heтАЩll go down as one of the greats for England. тАШI try to be positive. ThatтАЩs the message Jos has given to me and the team. The situation we were in, we didnтАЩt want to scrape a target of 145 to 150.тАЩ Like his fellow left-hander Stokes, the 24-year-old is capable of turning matches on their head via aggressive batting, and buoyed by his maiden first-class hundred against Kent last month he blitzed the South African spinners with an aerial assault including three sixes. Curran described the fact he had not previously reached three figures as тАШannoyingтАЩ but hopes to push his claims for promotion in EnglandтАЩs line-ups by producing more man- of-the-match contributions. The all-rounder played a vital cameo of 35 off 18 in the second ODI against South Africa тАШFor Surrey, I have batted up the order, which has made me think as a batsman. I like to try to read situations well. Guys like Moeen Ali and Stokesy who have batted in that middle-order for so long тАФ I like chatting to them about options and when to take risks. They are the kind of areas IтАЩm working on,тАЩ he said. CurranтАЩs all-round versatility has made him an attractive proposition to Twenty20 franchises but he made it clear that events like the money-spinning new league in South Africa next January fall way behind international cricket in his list of priorities. тАШThere is so much cricket. My goal is to play all three formats for England. ThatтАЩs been my dream since I was a kid. There is no better feeling than winning games for your country,тАЩ he said, adding that he hopes to win a 25th Test cap in the near future too, having recovered from a stress fracture of the back. тАШI loved the way the guys played against New Zealand. Loved watching that. And hopefully, touch wood, my body is holding up OK getting through these 50-over games. He also played an important role with the ball by dismissing the dangerous David Miller тАШI was managed very carefully, which IтАЩm pleased about, because it was my first big injury. But the next step will be four-day cricket and bowling 20 overs in a day.тАЩ Heinrich KlaasenтАЩs pernickety, delaying tactics in the drizzle on Friday night тАФ the bid to waste time and therefore force a no-result by restricting the second innings to fewer than 20 overs simply led to an eight-minute delay while covering was secured behind the bowlerтАЩs arm тАФ incensed the England team and added piquancy to todayтАЩs finale. тАШThey have a bit of niggle and we have a bit of niggle as well. So, we look forward to clashing again,тАЩ Curran said. England are likely to retain the same line-up as they look to win a first series under Jos ButtlerтАЩs white-ball stewardship, with their alternative options in the bowling department reduced by a toe injury to Brydon Carse. Advertisement Share or comment on this article: Post source: Daily mail The post тАШMy goal is to play all three formats for EnglandтАЩ: Sam Curran is ready to be the new Ben Stokes appeared first on 247 News Around The World.","pubDate":"2022-07-23 23:04:58","image_url":null,"source_id":"247newsaroundtheworld","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Glamorgan star becomes first player since Brian Lara to reach 400 in first-class innings","link":"https://www.mirror.co.uk/sport/cricket/glmorgan-cricket-400-not-out-27559772","keywords":["Sport"],"creator":["mirrornews@mirror.co.uk (Liam Llewellyn)"],"video_url":null,"description":"Country cricketer Sam Northeast etched his name in the history books as he became the ninth man in the history of first-class cricket to score 400 runs in an innings","content":null,"pubDate":"2022-07-23 18:51:51","image_url":"https://i2-prod.mirror.co.uk/incoming/article27559964.ece/ALTERNATES/s615/1_Sam-Northeast-Brian-Lara.jpg","source_id":"mirroruk","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Headingley Leeds ODI records: Headingley Carnegie ODI records and highest innings total","link":"https://thesportsrush.com/cricket-news-headingley-leeds-odi-records-headingley-carnegie-odi-records-and-highest-innings-total/","keywords":["Cricket","England","South Africa","South Africa tour of England 2022"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Headingley Leeds ODI records and highest innings total: Headingley will be hosting an ODI after more than three years. England and South Africa will lock horns in a series-decider third ODI in Leeds tomorrow. Having hosted a Test match as recent as last month, Headingley will be hosting an ODI after more than three years.тАж The post Headingley Leeds ODI records: Headingley Carnegie ODI records and highest innings total appeared first on The SportsRush.","content":"Headingley Leeds ODI records and highest innings total: Headingley will be hosting an ODI after more than three years. England and South Africa will lock horns in a series-decider third ODI in Leeds tomorrow. Having hosted a Test match as recent as last month, Headingley will be hosting an ODI after more than three years. England, who had played the last of their 33 Leeds ODIs during the ICC Cricket World Cup 2019, have won 21 and lost 11 matches here over the years. South Africa, on the other hand, have lost all their four ODIs at this venue. Set to play an ODI at Headingley after half-a-decade, the Proteas would look to make amends by beating England for the first time in the fourth attempt here. Headingley Leeds ODI records Highest ODI run-scorers at Headingley are Eoin Morgan (477), Joe Root (421), Marcus Trescothick (408), Andrew Strauss (335) and Ben Stokes (271). A list of highest ODI run-scorers at this venue among active cricketers is provided below: Batters Matches Runs Highest Average SR 100 50 Joe Root (ENG) 6 421 113 84.2 90.14 2 2 Angelo Mathews (SL) 3 244 113 244 89.37 1 1 Moeen Ali (ENG) 7 168 77* 56 110.52 0 1 Jonny Bairstow (ENG) 5 154 61 30.8 106.2 0 1 Babar Azam (PAK) 3 137 80 45.66 88.28 0 1 Highest wicket-takers in Leeds ODIs are Chris Old (12), Adil Rashid (12), Ian Botham (11), Chris Woakes (10) and Lasith Malinga (10). A list of best ODI bowlers at this venue among active cricketers is given below: Bowler Matches Wickets Average ER SR Adil Rashid (ENG) 6 12 27.25 5.65 28.9 Chris Woakes (ENG) 4 10 17.5 5.3 19.8 Shaheen Shah Afridi (PAK) 2 8 16.12 6.45 15 Moeen Ali (ENG) 7 8 39.12 4.67 50.2 David Willey (ENG) 4 7 26.57 5.47 29.1 Since the current lot of South African cricketers havenтАЩt played a lot of ODI cricket at this venue, there arenтАЩt many records for the visitors. Headingley Carnegie ODI records and highest innings total Score Overs Team Opposition Year 351/9 50 England Pakistan 2019 339/6 50 England South Africa 2017 324/2 37.2 Sri Lanka England 2006 324/6 50 India England 2007 321/7 50 England Sri Lanka 2006 Third-highest innings total at Headingley is also the highest successful ODI run-chase here. Chasing a 322-run target 16 years ago, former Sri Lankan batters in Upul Tharanga and Sanath Jayasuriya had scored individual centuries in a 286-run opening stand. The only other 300 or 300+ ODI run-chase in Leeds belongs to hosts England, who had sealed a 300-run target in the penultimate over against Australia seven years ago. The post Headingley Leeds ODI records: Headingley Carnegie ODI records and highest innings total appeared first on The SportsRush.","pubDate":"2022-07-23 17:21:03","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Photo: рд╡рд╛рдЗрдл рд░рд┐рддрд┐рдХрд╛ рдХреЗ рд╕рд╛рде рдЫреБрдЯреНрдЯрд┐рдпрд╛рдВ рдордирд╛ рд░рд╣реЗ рд╣реИрдВ рдХрдкреНрддрд╛рди Rohit Sharma, рд╢реЗрдпрд░ рдХреА рдЦреВрдмрд╕реВрд░рдд рддрд╕реНрд╡реАрд░","link":"https://www.abplive.com/sports/cricket/rohit-sharma-on-vacation-with-wife-ritika-sajdeh-team-india-2175030","keywords":null,"creator":["ABP Live"],"video_url":null,"description":"<p><strong>Rohit Sharma Ritika Team India:</strong> рднрд╛рд░рддреАрдп рдХреНрд░рд┐рдХреЗрдЯ рдЯреАрдо рдЗрд╕ рд╕рдордп рд╡реЗрд╕реНрдЯрдЗрдВрдбреАрдЬ рджреМрд░реЗ рдкрд░ рд╣реИ. рджреЛрдиреЛрдВ рд╣реА рдЯреАрдореЛрдВ рдХреЗ рдмреАрдЪ рд╡рдирдбреЗ рд╕реАрд░реАрдЬ рдЦреЗрд▓реА рдЬрд╛ рд░рд╣реА рд╣реИ. рдЗрд╕ рджреМрд░реЗ рдкрд░ рд╢рд┐рдЦрд░ рдзрд╡рди рднрд╛рд░рдд рдХреА рд╡рдирдбреЗ рдЯреАрдо рдХреА рдХрдкреНрддрд╛рдиреА рдХрд░ рд░рд╣реЗ рд╣реИрдВ. рдЬрдмрдХрд┐ рдЯреАрдо рдХреЗ рдирд┐рдпрдорд┐рдд рдХрдкреНрддрд╛рди рд░реЛрд╣рд┐рдд рд╢рд░реНрдорд╛ рдХреЛ рдмреНрд░реЗрдХ рджрд┐рдпрд╛ рдЧрдпрд╛ рд╣реИ. рд░реЛрд╣рд┐рдд рдЗрд╕ рд╕рдордп рдЕрдкрдиреЗ рдкрд░рд┐рд╡рд╛рд░ рдХреЗ рд╕рд╛рде рдЫреБрдЯреНрдЯрд┐рдпрд╛рдВ рдордирд╛ рд░рд╣реЗ рд╣реИрдВ. рдЙрдиреНрд╣реЛрдВрдиреЗ рд╣рд╛рд▓ рд╣реА рдореЗрдВ рд╕реЛрд╢рд▓ рдореАрдбрд┐рдпрд╛ рдкрд░ рдПрдХ рдЦрд╛рд╕ рддрд╕реНрд╡реАрд░ рд╢реЗрдпрд░ рдХреА. рдЗрд╕реЗ рдлреИрдиреНрд╕ рдХрд╛рдлреА рдкрд╕рдВрдж рдХрд░ рд░рд╣реЗ рд╣реИрдВ.</p> <p>рд░реЛрд╣рд┐рдд рдиреЗ рдЕрдкрдиреЗ рдЗрдВрд╕реНрдЯрд╛рдЧреНрд░рд╛рдо рдЕрдХрд╛рдЙрдВрдЯ рдкрд░ рдЕрдкрдиреА рд╡рд╛рдЗрдл рд░рд┐рддрд┐рдХрд╛ рдХреЗ рд╕рд╛рде рдПрдХ рдлреЛрдЯреЛ рд╢реЗрдпрд░ рдХреА рд╣реИ. рд╡реЗ рд╡рд┐рджреЗрд╢ рдореЗрдВ рдШреВрдо рд░рд╣реЗ рд╣реИрдВ. рд░реЛрд╣рд┐рдд рдХреА рдЗрд╕ рддрд╕реНрд╡реАрд░ рдХреЛ рдлреИрдиреНрд╕ рдХрд╛рдлреА рдкрд╕рдВрдж рдХрд░ рд░рд╣реЗ рд╣реИрдВ. рдЗрд╕ рдлреЛрдЯреЛ рдХреЛ рдорд╣рдЬ 2 рдШрдВрдЯреЗ рдореЗрдВ 5 рд▓рд╛рдЦ рд╕реЗ рдЬреНрдпрд╛рджрд╛ рд▓реЛрдЧреЛрдВ рдиреЗ рд▓рд╛рдЗрдХ рдХрд┐рдпрд╛ рд╣реИ. рдЬрдмрдХрд┐ рдХрдИ рд▓реЛрдЧреЛрдВ рдиреЗ рдЗрд╕ рдкрд░ рдкреНрд░рддрд┐рдХреНрд░рд┐рдпрд╛ рджреА рд╣реИ. рд░реЛрд╣рд┐рдд рдХреЗ рдЕрдзрд┐рдХрддрд░ рдлреИрдиреНрд╕ рдиреЗ рдЗрд╕ рдлреЛрдЯреЛ рдХреА рддрд╛рд░реАрдл рдХреА рд╣реИ.</p> <p>рдЧреМрд░рддрд▓рдм рд╣реИ рдХрд┐ рд░реЛрд╣рд┐рдд рдиреЗ рдЯреАрдо рдЗрдВрдбрд┐рдпрд╛ рдХреЗ рд▓рд┐рдП рдЖрдЦрд┐рд░реА рдЯреА20 рдореИрдЪ рдЗрдВрдЧреНрд▓реИрдВрдб рдХреЗ рдЦрд┐рд▓рд╛рдл рдЯреНрд░реЗрдВрдЯ рдмреНрд░рд┐рдЬ рдореЗрдВ рдЦреЗрд▓рд╛ рдерд╛. рдЬрдмрдХрд┐ рдЖрдЦрд┐рд░реА рд╡рдирдбреЗ рдореИрдЪ 17 рдЬреБрд▓рд╛рдИ рдХреЛ рдУрд▓реНрдб рдЯреНрд░реЗрдлрд░реНрдб рдореЗрдВ рдЦреЗрд▓рд╛ рдерд╛. рд░реЛрд╣рд┐рдд рдХрд╛ рдЗрдВрдЯрд░рдиреЗрд╢рдирд▓ рд░рд┐рдХреЙрд░реНрдб рдХрд╛рдлреА рдЕрдЪреНрдЫрд╛ рд░рд╣рд╛ рд╣реИ. рдЙрдиреНрд╣реЛрдВрдиреЗ 233 рд╡рдирдбреЗ рдореИрдЪреЛрдВ рдореЗрдВ 9376 рд░рди рдмрдирд╛рдП рд╣реИрдВ. рдЬрдмрдХрд┐ 128 рдЯреА20 рдЗрдВрдЯрд░рдиреЗрд╢рдирд▓ рдореИрдЪреЛрдВ рдореЗрдВ 3379 рд░рди рдмрдирд╛ рдЪреБрдХреЗ рд╣реИрдВ.</p> <blockquote class=\"instagram-media\" style=\"background: #FFF; border: 0; border-radius: 3px; box-shadow: 0 0 1px 0 rgba(0,0,0,0.5),0 1px 10px 0 rgba(0,0,0,0.15); margin: 1px; max-width: 540px; min-width: 326px; padding: 0; width: calc(100% - 2px);\" data-instgrm-captioned=\"\" data-instgrm-permalink=\"https://www.instagram.com/p/CgW_7LxquF4/?utm_source=ig_embed&amp;utm_campaign=loading\" data-instgrm-version=\"14\"> <div style=\"padding: 16px;\"> <div style=\"display: flex; flex-direction: row; align-items: center;\"> <div style=\"background-color: #f4f4f4; border-radius: 50%; flex-grow: 0; height: 40px; margin-right: 14px; width: 40px;\">&nbsp;</div> <div style=\"display: flex; flex-direction: column; flex-grow: 1; justify-content: center;\"> <div style=\"background-color: #f4f4f4; border-radius: 4px; flex-grow: 0; height: 14px; margin-bottom: 6px; width: 100px;\">&nbsp;</div> <div style=\"background-color: #f4f4f4; border-radius: 4px; flex-grow: 0; height: 14px; width: 60px;\">&nbsp;</div> </div> </div> <div style=\"padding: 19% 0;\">&nbsp;</div> <div style=\"display: block; height: 50px; margin: 0 auto 12px; width: 50px;\">&nbsp;</div> <div style=\"padding-top: 8px;\"> <div style=\"color: #3897f0; font-family: Arial,sans-serif; font-size: 14px; font-style: normal; font-weight: 550; line-height: 18px;\">View this post on Instagram</div> </div> <div style=\"padding: 12.5% 0;\">&nbsp;</div> <div style=\"display: flex; flex-direction: row; margin-bottom: 14px; align-items: center;\"> <div> <div style=\"background-color: #f4f4f4; border-radius: 50%; height: 12.5px; width: 12.5px; transform: translateX(0px) translateY(7px);\">&nbsp;</div> <div style=\"background-color: #f4f4f4; height: 12.5px; transform: rotate(-45deg) translateX(3px) translateY(1px); width: 12.5px; flex-grow: 0; margin-right: 14px; margin-left: 2px;\">&nbsp;</div> <div style=\"background-color: #f4f4f4; border-radius: 50%; height: 12.5px; width: 12.5px; transform: translateX(9px) translateY(-18px);\">&nbsp;</div> </div> <div style=\"margin-left: 8px;\"> <div style=\"background-color: #f4f4f4; border-radius: 50%; flex-grow: 0; height: 20px; width: 20px;\">&nbsp;</div> <div style=\"width: 0; height: 0; border-top: 2px solid transparent; border-left: 6px solid #f4f4f4; border-bottom: 2px solid transparent; transform: translateX(16px) translateY(-4px) rotate(30deg);\">&nbsp;</div> </div> <div style=\"margin-left: auto;\"> <div style=\"width: 0px; border-top: 8px solid #F4F4F4; border-right: 8px solid transparent; transform: translateY(16px);\">&nbsp;</div> <div style=\"background-color: #f4f4f4; flex-grow: 0; height: 12px; width: 16px; transform: translateY(-4px);\">&nbsp;</div> <div style=\"width: 0; height: 0; border-top: 8px solid #F4F4F4; border-left: 8px solid transparent; transform: translateY(-4px) translateX(8px);\">&nbsp;</div> </div> </div> <div style=\"display: flex; flex-direction: column; flex-grow: 1; justify-content: center; margin-bottom: 24px;\"> <div style=\"background-color: #f4f4f4; border-radius: 4px; flex-grow: 0; height: 14px; margin-bottom: 6px; width: 224px;\">&nbsp;</div> <div style=\"background-color: #f4f4f4; border-radius: 4px; flex-grow: 0; height: 14px; width: 144px;\">&nbsp;</div> </div> <p style=\"color: #c9c8cd; font-family: Arial,sans-serif; font-size: 14px; line-height: 17px; margin-bottom: 0; margin-top: 8px; overflow: hidden; padding: 8px 0 7px; text-align: center; text-overflow: ellipsis; white-space: nowrap;\"><a style=\"color: #c9c8cd; font-family: Arial,sans-serif; font-size: 14px; font-style: normal; font-weight: normal; line-height: 17px; text-decoration: none;\" href=\"https://www.instagram.com/p/CgW_7LxquF4/?utm_source=ig_embed&amp;utm_campaign=loading\" target=\"_blank\" rel=\"noopener\">A post shared by Rohit Sharma (@rohitsharma45)</a></p> </div> </blockquote> <p> <script src=\"//www.instagram.com/embed.js\" async=\"\"></script> </p> <p><strong>рдпрд╣ рднреА рдкрдврд╝реЗрдВ : <a href=\"https://www.abplive.com/sports/cricket/faf-du-plessis-wife-imari-shared-video-caption-he-made-my-dreams-come-true-2175003\">VIDEO: рдлреИрдорд▓реА рдХреЗ рд╕рд╛рде рдмреЗрд╣рдж рдЦреВрдмрд╕реВрд░рдд рдЬрдЧрд╣ рдкрд░ рдЫреБрдЯреНрдЯрд┐рдпрд╛рдВ рдордирд╛ рд░рд╣реЗ рд╣реИрдВ Faf du Plessis, рд╡рд╛рдЗрдл рдиреЗ рд╢реЗрдпрд░ рдХрд┐рдпрд╛ рд╡реАрдбрд┐рдпреЛ</a></strong></p> <p><a href=\"https://www.abplive.com/sports/cricket/ind-vs-wi-2nd-odi-shikhar-dhawan-shreyas-iyer-have-chance-to-make-history-of-fours-port-of-spain-trinidad-2174964\"><strong>IND vs WI 2nd ODI: Dhawan рд╡рд░реНрд▓реНрдб рд░рд┐рдХреЙрд░реНрдб рдмрдирд╛рдиреЗ рд╕реЗ рджреЛ рдХрджрдо рджреВрд░, рдЕрдпреНрдпрд░ рдХреЗ рдирд╛рдо рджрд░реНрдЬ рд╣реЛ рд╕рдХрддреА рд╣реИ рдЦрд╛рд╕ рдЙрдкрд▓рдмреНрдзрд┐</strong></a></p>","content":null,"pubDate":"2022-07-23 17:18:06","image_url":null,"source_id":"abplive","country":["india"],"category":["sports"],"language":"hindi"},{"title":"Commonwealth Games рдореЗрдВ рдХреНрд░рд┐рдХреЗрдЯ рдХреА рд╡рд╛рдкрд╕реА рдкрд░ рдХреЛрдЪ рдкреЛрд╡рд╛рд░ рдиреЗ рджреА рдкреНрд░рддрд┐рдХреНрд░рд┐рдпрд╛, рдиреАрд░рдЬ рдЪреЛрдкрдбрд╝рд╛ рдХреЛ рд▓реЗрдХрд░ рдХрд╣реА рдЦрд╛рд╕ рдмрд╛рдд","link":"https://www.abplive.com/sports/cricket/indian-women-team-coach-ramesh-powar-says-about-cricket-come-back-in-commonwealth-games-2175023","keywords":null,"creator":["Agencies"],"video_url":null,"description":"<p style=\"text-align: justify;\"><strong>Indian Women Team Coach Ramesh Powar Commonwealth Games:</strong> рдмреИрдбрдорд┐рдВрдЯрди рд╕реНрдЯрд╛рд░ рдкреАрд╡реА. рд╕рд┐рдВрдзреБ рдФрд░ рднрд╛рд▓рд╛ рдлреЗрдВрдХ рдореЗрдВ рдУрд▓рдВрдкрд┐рдХ рдЪреИрдВрдкрд┐рдпрди рдиреАрд░рдЬ рдЪреЛрдкрдбрд╝рд╛ рднрд╛рд░рдд рдХреЗ рдореБрдЦреНрдп рдХреЛрдЪ рд░рдореЗрд╢ рдкреЛрд╡рд╛рд░ рдХреЗ рджрд┐рдорд╛рдЧ рдореЗрдВ рд╣реИрдВ. рд╕рд╛рде рд╣реА рдорд╣рд┐рд▓рд╛ рдЯреАрдо 2022 рд░рд╛рд╖реНрдЯреНрд░рдордВрдбрд▓ рдЦреЗрд▓реЛрдВ рдореЗрдВ рднрд╛рдЧ рд▓реЗрдиреЗ рдХреЗ рд▓рд┐рдП рдкреВрд░реА рддрд░рд╣ рддреИрдпрд╛рд░ рд╣реИ. рдЬреИрд╕рд╛ рдХрд┐ 24 рд╡рд░реНрд╖реЛ рдореЗрдВ рдкрд╣рд▓реА рдмрд╛рд░ рд░рд╛рд╖реНрдЯреНрд░рдордВрдбрд▓ рдЦреЗрд▓реЛрдВ рдореЗрдВ рдХреНрд░рд┐рдХреЗрдЯ рдХреА рд╡рд╛рдкрд╕реА рд╣реБрдИ рд╣реИ, рдкреЛрд╡рд╛рд░ рдФрд░ рдХрдкреНрддрд╛рди рд╣рд░рдордирдкреНрд░реАрдд рдХреМрд░ рдиреЗ рдкреНрд░рд╕реНрдерд╛рди рд╕реЗ рдкрд╣рд▓реЗ рд╡рд░реНрдЪреБрдЕрд▓ рдкреНрд░реЗрд╕ рдХреЙрдиреНрдлреНрд░реЗрдВрд╕ рдореЗрдВ рдЬрд┐рд╕ рддрд░рд╣ рд╕реЗ рдмрд╛рдд рдХреА, рдЙрдирдореЗрдВ рдЙрддреНрд╕рд╛рд╣ рд╕реНрдкрд╖реНрдЯ рдерд╛.</p> <p style=\"text-align: justify;\">рдкреЛрд╡рд╛рд░ рдиреЗ рдХрд╣рд╛ рдХрд┐ рдИрдорд╛рдирджрд╛рд░реА рд╕реЗ рдХрд╣реВрдВ рддреЛ рдЕрдЧрд░ рдореМрдХрд╛ рдорд┐рд▓реЗ рддреЛ рдореИрдВ рдкреАрд╡реА. рд╕рд┐рдВрдзреБ рдФрд░ рдиреАрд░рдЬ рдЪреЛрдкрдбрд╝рд╛ рдХреЗ рджрд┐рдорд╛рдЧ рдХреЛ рдкрдврд╝рдирд╛ рдкрд╕рдВрдж рдХрд░реВрдВрдЧрд╛. рдореИрдВ рдЙрдирдХреА рддреИрдпрд╛рд░реА рдХреЛ рд▓реЗрдХрд░ рдЙрддреНрд╕реБрдХ рд╣реВрдВ рдФрд░ рдЬрд┐рд╕ рддрд░рд╣ рд╕реЗ рд╡реЗ рдЕрд░рдмреЛрдВ рд▓реЛрдЧреЛрдВ рдХреА рдЙрдореНрдореАрджреЛрдВ рдХреЛ рд╕рдВрднрд╛рд▓ рд░рд╣реЗ рд╣реИрдВ, рд╡рд╣ рдХрд╛рдмрд┐рд▓реЗ рддрд╛рд░реАрдл рд╣реИ. рд╣рдо рдПрдХ рд╕рдореВрд╣ рдХреЗ рд░реВрдк рдореЗрдВ рдЗрди рджреЛ рд╢реАрд░реНрд╖ рд╢реНрд░реЗрдгреА рдХреЗ рдПрдерд▓реАрдЯреЛрдВ рдХреЗ рд╕рд╛рде рдХреБрдЫ рдиреЛрдЯреНрд╕ рдХрд╛ рдЖрджрд╛рди-рдкреНрд░рджрд╛рди рдХрд░рдирд╛ рдЪрд╛рд╣реЗрдВрдЧреЗ. рд░рд╛рд╖реНрдЯреНрд░рдордВрдбрд▓ рдЦреЗрд▓реЛрдВ рдореЗрдВ рдЦреЗрд▓рдиреЗ рдХреА рд╕рдВрднрд╛рд╡рдирд╛ рд╣рд░рдордирдкреНрд░реАрдд рдПрдВрдб рдХрдВрдкрдиреА рдХреЗ рд▓рд┐рдП рдПрдХ рдирдпрд╛ рдЕрдиреБрднрд╡ рд╣реЛрдЧрд╛, рдЬрд┐рд╕рдХреА рд╢реБрд░реВрдЖрдд рдЙрджреНрдШрд╛рдЯрди рд╕рдорд╛рд░реЛрд╣ рдореЗрдВ рдкреВрд░реЗ рднрд╛рд░рддреАрдп рджрд▓ рдХреЗ рд╕рд╛рде рдЪрд▓рдиреЗ, рдЕрдиреНрдп рд╡рд┐рд╖рдпреЛрдВ рдХреЗ рдПрдерд▓реАрдЯреЛрдВ рдХреЗ рд╕рд╛рде рдмрд╛рддрдЪреАрдд рдХрд░рдиреЗ рдФрд░ рдпрджрд┐ рд╕рдВрднрд╡ рд╣реЛ рддреЛ рд╕рдорд╛рдкрди рд╕рдорд╛рд░реЛрд╣ рдореЗрдВ рднреА рднрд╛рдЧ рд▓реЗрдиреЗ рд╕реЗ рд╣реЛрдЧреА.</p> <p style=\"text-align: justify;\">рдЙрдиреНрд╣реЛрдВрдиреЗ рдХрд╣рд╛ рдХрд┐ рдЬреИрд╕рд╛ рдХрд┐ рд╣рдо рдмреЛрд▓рддреЗ рд╣реИрдВ, рдореБрдЭреЗ рд╡рд╛рд╕реНрддрд╡ рдореЗрдВ рдРрд╕рд╛ рд▓рдЧрддрд╛ рд╣реИ рдЬреИрд╕реЗ рдореИрдВ рдЙрд╕ рд╕рдбрд╝рдХ рдкрд░ рдЪрд▓ рд░рд╣рд╛ рд╣реВрдВ. рдЗрд╕ рдмрд╛рд░ рд╣рдо рдмрд╣реБ-рдЦреЗрд▓ рдЖрдпреЛрдЬрди рдХрд╛ рд╣рд┐рд╕реНрд╕рд╛ рдмрдирдиреЗ рдЬрд╛ рд░рд╣реЗ рд╣реИрдВ, рдпрд╣ рдХреЗрд╡рд▓ рдХреНрд░рд┐рдХреЗрдЯ рдХреЗ рдмрд╛рд░реЗ рдореЗрдВ рдирд╣реАрдВ рд╣реИ, рдмрд▓реНрдХрд┐ рдЕрдиреНрдп рдЦреЗрд▓ рднреА рд╣реЛрдВрдЧреЗ. рд╣рдо рдЬреАрддрдиреЗ рд╡рд╛рд▓реЗ рдкреНрд░рддреНрдпреЗрдХ рдкрджрдХ рдХрд╛ рдЬрд╢реНрди рдордирд╛рдирд╛ рдЪрд╛рд╣рддреЗ рд╣реИрдВ, рд╣рдо рд╕рднреА рдмрд╣реБрдд рдЙрддреНрд╕рд╛рд╣рд┐рдд рд╣реИрдВ. рд╣рдо рд╕рднреА рдЖрдЧреЗ рджреЗрдЦ рд░рд╣реЗ рд╣реИрдВ рдФрд░ рд╣рдо рдЗрд╕ рдорд╣рд╛рди рдЖрдпреЛрдЬрди рдХрд╛ рд╣рд┐рд╕реНрд╕рд╛ рдмрдирдиреЗ рдХрд╛ рдЗрдВрддрдЬрд╛рд░ рдирд╣реАрдВ рдХрд░ рд╕рдХрддреЗ.</p> <p style=\"text-align: justify;\">рд╢реНрд░реАрд▓рдВрдХрд╛ рдХреЗ рдЦрд┐рд▓рд╛рдл рд╕реАрд░реАрдЬ рдореЗрдВ 2-1 рд╕реЗ рдЬреАрдд рдХреЗ рджрдо рдкрд░ рднрд╛рд░рдд рд░рд╛рд╖реНрдЯреНрд░рдордВрдбрд▓ рдЦреЗрд▓реЛрдВ рдореЗрдВ рдЙрддрд░реЗрдЧрд╛. рдПрдЬрдмреЗрд╕реНрдЯрди рдореЗрдВ, рдорд╣рд┐рд▓рд╛рдУрдВ рдХреЗ рдЯреА20 рдЖрдпреЛрдЬрди рдХреА рдореЗрдЬрдмрд╛рдиреА, рднрд╛рд░рдд рдСрд╕реНрдЯреНрд░реЗрд▓рд┐рдпрд╛, рдкрд╛рдХрд┐рд╕реНрддрд╛рди рдФрд░ рдмрд╛рд░рдмрд╛рдбреЛрд╕ рдХреЗ рд╕рд╛рде рдЧреНрд░реБрдк рдП рдореЗрдВ рд╣реИ. рднрд╛рд░рдд 29 рдЬреБрд▓рд╛рдИ рдХреЛ рдСрд╕реНрдЯреНрд░реЗрд▓рд┐рдпрд╛ рдХреЗ рдЦрд┐рд▓рд╛рдл рдЕрдкрдиреЗ рдЧреНрд░реБрдк рдП рдЕрднрд┐рдпрд╛рди рдХреА рд╢реБрд░реВрдЖрдд рдХрд░реЗрдЧрд╛ рдФрд░ рдкрджрдХ рдореИрдЪреЛрдВ рдХреЗ рд▓рд┐рдП рдиреЙрдХрдЖрдЙрдЯ рдореЗрдВ рдкрд╣реБрдВрдЪрдиреЗ рдХреЗ рд▓рд┐рдП рдХрдо рд╕реЗ рдХрдо рджреЛ рдЬреАрдд рд╣рд╛рд╕рд┐рд▓ рдХрд░рдиреЗ рдХреА рдЬрд░реВрд░рдд рд╣реИ.</p> <p style=\"text-align: justify;\"><strong>рдпрд╣ рднреА рдкрдврд╝реЗрдВ : <a href=\"https://www.abplive.com/sports/cricket/faf-du-plessis-wife-imari-shared-video-caption-he-made-my-dreams-come-true-2175003\">VIDEO: рдлреИрдорд▓реА рдХреЗ рд╕рд╛рде рдмреЗрд╣рдж рдЦреВрдмрд╕реВрд░рдд рдЬрдЧрд╣ рдкрд░ рдЫреБрдЯреНрдЯрд┐рдпрд╛рдВ рдордирд╛ рд░рд╣реЗ рд╣реИрдВ Faf du Plessis, рд╡рд╛рдЗрдл рдиреЗ рд╢реЗрдпрд░ рдХрд┐рдпрд╛ рд╡реАрдбрд┐рдпреЛ</a></strong></p> <p style=\"text-align: justify;\"><a href=\"https://www.abplive.com/sports/cricket/indian-cricketer-ajinkya-rahane-will-become-a-father-for-the-second-time-in-october-2174942\"><strong>Ajinkya Rahane: рджрд┐рд╡рд╛рд▓реА рдкрд░ рдЕрдВрдЬрд┐рдХреНрдп рд░рд╣рд╛рдгреЗ рдХреЗ рдШрд░ рдЖрдПрдВрдЧреА рдЦреБрд╢рд┐рдпрд╛рдВ, рджреВрд╕рд░реА рдмрд╛рд░ рдмрдиреЗрдВрдЧреЗ рдкрд┐рддрд╛</strong></a></p>","content":null,"pubDate":"2022-07-23 16:52:13","image_url":null,"source_id":"abplive","country":["india"],"category":["sports"],"language":"hindi"},{"title":"IND vs WI 2nd ODI live streaming: When and where to watch India vs West Indies 2nd ODI in Trinidad","link":"https://www.dnaindia.com/cricket/report-ind-vs-wi-2nd-odi-live-streaming-when-and-where-to-watch-india-vs-west-indies-2nd-odi-in-trinidad-fancode-2970954","keywords":["Sports","Cricket"],"creator":["DNA Web Team"],"video_url":null,"description":"Know all the details about the 2nd ODI match between India vs West Indies which will be played at the Queens Park Cricket Stadium on 24th July.","content":null,"pubDate":"2022-07-23 16:44:06","image_url":null,"source_id":"dnaindia","country":["india"],"category":["sports"],"language":"english"},{"title":"Ajinkya Rahane: рджрд┐рд╡рд╛рд▓реА рдкрд░ рдЕрдВрдЬрд┐рдХреНрдп рд░рд╣рд╛рдгреЗ рдХреЗ рдШрд░ рдЖрдПрдВрдЧреА рдЦреБрд╢рд┐рдпрд╛рдВ, рджреВрд╕рд░реА рдмрд╛рд░ рдмрдиреЗрдВрдЧреЗ рдкрд┐рддрд╛","link":"https://www.abplive.com/sports/cricket/indian-cricketer-ajinkya-rahane-will-become-a-father-for-the-second-time-in-october-2174942","keywords":null,"creator":["ABP Live"],"video_url":null,"description":"<p style=\"text-align: justify;\"><strong>Ajinkya Rahane Wife Post:</strong> рднрд╛рд░рддреАрдп рдХреНрд░рд┐рдХреЗрдЯрд░ рдЕрдВрдЬрд┐рдХреНрдп рд░рд╣рд╛рдгреЗ (Ajinkya Rahane) рдХреЗ рдШрд░ рдЬрд▓реНрдж рдЦреБрд╢рд┐рдпрд╛рдВ рдЖрдиреЗ рд╡рд╛рд▓реА рд╣реИ. рджрд░рдЕрд╕рд▓, рдЗрд╕ рджреАрд╡рд╛рд▓реА рдЕрдВрдЬрд┐рдХреНрдп рд░рд╣рд╛рдгреЗ рджреВрд╕рд░реА рдмрд╛рд░ рдкрд┐рддрд╛ рдмрдирдиреЗ рд╡рд╛рд▓реЗ рд╣реИрдВ. рднрд╛рд░рддреАрдп рдХреНрд░рд┐рдХреЗрдЯрд░ рдХреА рдкрддреНрдиреА рдиреЗ рдЗрдВрд╕реНрдЯрд╛рдЧреНрд░рд╛рдо (Instagram) рдкрд░ рдЕрдкрдиреЗ рдлреИрдВрд╕ рд╕реЗ рдпрд╣ рдЦреБрд╢рдЦрдмрд░реА рд╢реЗрдпрд░ рдХрд┐рдпрд╛ рд╣реИ. рдмрд╣рд░рд╣рд╛рд▓, рд░рд╛рдзрд┐рдХрд╛ рдиреЗ рдЕрдВрдЬрд┐рдХреНрдп рд░рд╣рд╛рдгреЗ рдХреЛ рдЯреИрдЧ рдХрд░рддреЗ рд╣реБрдП рдЗрдВрд╕реНрдЯрд╛рдЧреНрд░рд╛рдо рдкрд░ рдлреЛрдЯреЛ рд╕рд╛рдЭрд╛ рдХрд┐рдпрд╛ рд╣реИ.</p> <p style=\"text-align: justify;\"><strong>рдЗрдВрд╕реНрдЯрд╛рдЧреНрд░рд╛рдо рдкрд░ рдлреЛрдЯреЛ рд╢реЗрдпрд░ рдХрд░ рджреА рдЬрд╛рдирдХрд╛рд░реА</strong></p> <p style=\"text-align: justify;\">рдЕрдВрдЬрд┐рдХреНрдп рд░рд╣рд╛рдгреЗ (Ajinkya Rahane) рдХреА рдкрддреНрдиреА рд░рд╛рдзрд┐рдХрд╛ (Radhika) рдиреЗ рдЗрдВрд╕реНрдЯрд╛рдЧреНрд░рд╛рдо рдкрд░ рдЬреЛ рдлреЛрдЯреЛ рд╢реЗрдпрд░ рдХрд┐рдпрд╛ рд╣реИ, рдЙрд╕ рдлреЛрдЯреЛ рдореЗрдВ рдЕрдВрдЬрд┐рдХреНрдп рд░рд╣рд╛рдгреЗ рдХреЗ рдЕрд▓рд╛рд╡рд╛ рдФрд░ рдмреЗрдЯреА рдЖрд░реНрдпрд╛ рджрд┐рдЦ рд░рд╣реА рд╣реИрдВ. рдЗрд╕ рдЗрдВрд╕реНрдЯрд╛рдЧреНрд░рд╛рдо рдкреЛрд╕реНрдЯ (Instagram Post) рдореЗрдВ рдЕрдВрдЬрд┐рдХреНрдп рд░рд╣рд╛рдгреЗ рдЕрдкрдиреА рдлреИрдорд┐рд▓реА рдХреЗ рд╕рд╛рде рдХрд╛рдлреА рдЦреБрд╢ рджрд┐рдЦрд╛рдИ рджреЗ рд░рд╣реА рд╣реИ. рд╡рд╣реАрдВ, рдЕрдВрдЬрд┐рдХреНрдп рд░рд╣рд╛рдгреЗ рдХреА рдкрддреНрдиреА рд░рд╛рдзрд┐рдХрд╛ рд╣рдВрд╕рддреЗ рд╣реБрдП рдирдЬрд░ рдЖ рд░рд╣реА рд╣реИрдВ.</p> <blockquote class=\"instagram-media\" style=\"background: #FFF; border: 0; border-radius: 3px; box-shadow: 0 0 1px 0 rgba(0,0,0,0.5),0 1px 10px 0 rgba(0,0,0,0.15); margin: 1px; max-width: 540px; min-width: 326px; padding: 0; width: calc(100% - 2px);\" data-instgrm-captioned=\"\" data-instgrm-permalink=\"https://www.instagram.com/p/CgUYAptPbDu/?utm_source=ig_embed&amp;utm_campaign=loading\" data-instgrm-version=\"14\"> <div style=\"padding: 16px;\"> <div style=\"display: flex; flex-direction: row; align-items: center;\"> <div style=\"background-color: #f4f4f4; border-radius: 50%; flex-grow: 0; height: 40px; margin-right: 14px; width: 40px;\">&nbsp;</div> <div style=\"display: flex; flex-direction: column; flex-grow: 1; justify-content: center;\"> <div style=\"background-color: #f4f4f4; border-radius: 4px; flex-grow: 0; height: 14px; margin-bottom: 6px; width: 100px;\">&nbsp;</div> <div style=\"background-color: #f4f4f4; border-radius: 4px; flex-grow: 0; height: 14px; width: 60px;\">&nbsp;</div> </div> </div> <div style=\"padding: 19% 0;\">&nbsp;</div> <div style=\"display: block; height: 50px; margin: 0 auto 12px; width: 50px;\">&nbsp;</div> <div style=\"padding-top: 8px;\"> <div style=\"color: #3897f0; font-family: Arial,sans-serif; font-size: 14px; font-style: normal; font-weight: 550; line-height: 18px;\">View this post on Instagram</div> </div> <div style=\"padding: 12.5% 0;\">&nbsp;</div> <div style=\"display: flex; flex-direction: row; margin-bottom: 14px; align-items: center;\"> <div> <div style=\"background-color: #f4f4f4; border-radius: 50%; height: 12.5px; width: 12.5px; transform: translateX(0px) translateY(7px);\">&nbsp;</div> <div style=\"background-color: #f4f4f4; height: 12.5px; transform: rotate(-45deg) translateX(3px) translateY(1px); width: 12.5px; flex-grow: 0; margin-right: 14px; margin-left: 2px;\">&nbsp;</div> <div style=\"background-color: #f4f4f4; border-radius: 50%; height: 12.5px; width: 12.5px; transform: translateX(9px) translateY(-18px);\">&nbsp;</div> </div> <div style=\"margin-left: 8px;\"> <div style=\"background-color: #f4f4f4; border-radius: 50%; flex-grow: 0; height: 20px; width: 20px;\">&nbsp;</div> <div style=\"width: 0; height: 0; border-top: 2px solid transparent; border-left: 6px solid #f4f4f4; border-bottom: 2px solid transparent; transform: translateX(16px) translateY(-4px) rotate(30deg);\">&nbsp;</div> </div> <div style=\"margin-left: auto;\"> <div style=\"width: 0px; border-top: 8px solid #F4F4F4; border-right: 8px solid transparent; transform: translateY(16px);\">&nbsp;</div> <div style=\"background-color: #f4f4f4; flex-grow: 0; height: 12px; width: 16px; transform: translateY(-4px);\">&nbsp;</div> <div style=\"width: 0; height: 0; border-top: 8px solid #F4F4F4; border-left: 8px solid transparent; transform: translateY(-4px) translateX(8px);\">&nbsp;</div> </div> </div> <div style=\"display: flex; flex-direction: column; flex-grow: 1; justify-content: center; margin-bottom: 24px;\"> <div style=\"background-color: #f4f4f4; border-radius: 4px; flex-grow: 0; height: 14px; margin-bottom: 6px; width: 224px;\">&nbsp;</div> <div style=\"background-color: #f4f4f4; border-radius: 4px; flex-grow: 0; height: 14px; width: 144px;\">&nbsp;</div> </div> <p style=\"color: #c9c8cd; font-family: Arial,sans-serif; font-size: 14px; line-height: 17px; margin-bottom: 0; margin-top: 8px; overflow: hidden; padding: 8px 0 7px; text-align: center; text-overflow: ellipsis; white-space: nowrap;\"><a style=\"color: #c9c8cd; font-family: Arial,sans-serif; font-size: 14px; font-style: normal; font-weight: normal; line-height: 17px; text-decoration: none;\" href=\"https://www.instagram.com/p/CgUYAptPbDu/?utm_source=ig_embed&amp;utm_campaign=loading\" target=\"_blank\" rel=\"noopener\">A post shared by Radhika Rahane (@radhika_dhopavkar)</a></p> </div> </blockquote> <p style=\"text-align: justify;\"> <script src=\"//www.instagram.com/embed.js\" async=\"\"></script> </p> <p style=\"text-align: justify;\"><strong>рджреВрд╕рд░реА рдмрд╛рд░ рдкрд┐рддрд╛ рдмрдиреЗрдВрдЧреЗ рд░рд╣рд╛рдгреЗ</strong></p> <p style=\"text-align: justify;\">рдмрд╣рд░рд╣рд╛рд▓, рдЗрд╕ рдЗрдВрд╕реНрдЯрд╛рдЧреНрд░рд╛рдо рдкреЛрд╕реНрдЯ (Instagram Post) рдХреЗ рдЬрд░рд┐рдП рдмрддрд╛рдпрд╛ рдЧрдпрд╛ рд╣реИ рдХрд┐ рдЕрдВрдЬрд┐рдХреНрдп рд░рд╣рд╛рдгреЗ (Ajinkya Rahane) рдЬрд▓реНрдж рджреВрд╕рд░реА рдмрд╛рд░ рдкрд┐рддрд╛ рдмрдирдиреЗ рд╡рд╛рд▓реЗ рд╣реИрдВ. рдЗрд╕ рд╕рд╛рд▓ 24 рдЕрдХреНрдЯреВрдмрд░ рдХреЛ рджрд┐рд╡рд╛рд▓реА (Diwali) рд╣реИ, рдРрд╕реЗ рдореЗрдВ рднрд╛рд░рддреАрдп рдХреНрд░рд┐рдХреЗрдЯрд░ рдХреЗ рдШрд░ рдЦреБрд╢рд┐рдпрд╛рдВ рджреЛрдЧреБрдиреА рд╣реЛрдиреЗ рд╡рд╛рд▓реА рд╣реИ. рд░рд╛рдзрд┐рдХрд╛ (Radhika) рдХреЗ рдЗрд╕ рдЗрдВрд╕реНрдЯрд╛рдЧреНрд░рд╛рдо рдкреЛрд╕реНрдЯ рдкрд░ рдХреЛрд▓рдХрд╛рддрд╛ рдирд╛рдИрдЯ рд░рд╛рдЗрдбрд░реНрд╕ (KKR) рдХреЗ рдЕрд▓рд╛рд╡рд╛ рд░реЛрд╣рд┐рдд рд╢рд░реНрдорд╛ (Rohit Sharma) рдХреА рдкрддреНрдиреА рдЛрддрд┐рдХрд╛, рдЬрд╕рдкреНрд░реАрдд рдмреБрдорд░рд╛рд╣ (Jasprit Bumrah) рдХреА рдкрддреНрдиреА рд╕рдВрдЬрдирд╛ рдЧрдгреЗрд╕рди рдиреЗ рдХрдореЗрдВрдЯ рдХрд░ рдмрдзрд╛рдИ рджрд┐рдпрд╛ рд╣реИ.</p> <p style=\"text-align: justify;\"><strong>рдпреЗ рднреА рдкрдврд╝реЗрдВ-</strong></p> <p style=\"text-align: justify;\"><strong><a href=\"https://www.abplive.com/sports/cricket/indian-players-meet-brian-lara-in-dressing-room-after-west-indies-vs-india-1st-odi-2174754\">VIDEO: Team India рдХреЗ рдЦрд┐рд▓рд╛рдбрд╝рд┐рдпреЛрдВ рдиреЗ рдмреНрд░рд╛рдпрди рд▓рд╛рд░рд╛ рд╕реЗ рдбреНрд░реЗрд╕рд┐рдВрдЧ рд░реВрдо рдореЗрдВ рдХреА рдореБрд▓рд╛рдХрд╛рдд, рджреЗрдЦреЗрдВ рдзрд╡рди-рдЕрдпреНрдпрд░ рдХреЛ рдХреНрдпрд╛ рджрд┐рдП рдЯрд┐рдкреНрд╕</a><br /></strong></p> <p style=\"text-align: justify;\"><strong><a href=\"https://www.abplive.com/sports/cricket/shreyas-iyer-says-about-dance-during-first-odi-against-west-indies-mohammed-siraj-2174881\">IND vs WI: Shreyas Iyer рдиреЗ рдмрддрд╛рдпрд╛ рдореИрджрд╛рди рдкрд░ рдХреНрдпреЛрдВ рдХрд░рдиреЗ рд▓рдЧреЗ рдереЗ рдбрд╛рдВрд╕, рд╡реАрдбрд┐рдпреЛ рдореЗрдВ рд╕рд┐рд░рд╛рдЬ рдиреЗ рдмрддрд╛рдпрд╛ рдореИрдЪ рдХрд╛ рдЦрд╛рд╕ рдкреНрд▓рд╛рди</a><br /></strong></p>","content":null,"pubDate":"2022-07-23 16:29:26","image_url":null,"source_id":"abplive","country":["india"],"category":["sports"],"language":"hindi"},{"title":"Headingley Leeds pitch report 3rd ODI: Headingley pitch report ENG vs SA today match batting or bowling","link":"https://thesportsrush.com/cricket-news-headingley-leeds-pitch-report-3rd-odi-headingley-pitch-report-eng-vs-sa-today-match-batting-or-bowling/","keywords":["Cricket","Headingley","South Africa tour of England 2022"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Headingley Leeds pitch report 3rd ODI: The series decider third ODI between the two sides is set to be played tomorrow in Leeds. Starting the all-format tour with a comprehensive 62-run victory in the first ODI, South Africa were humbled during the second one-dayer in Manchester, receiving a 118-run drubbing from England, to level theтАж The post Headingley Leeds pitch report 3rd ODI: Headingley pitch report ENG vs SA today match batting or bowling appeared first on The SportsRush.","content":"Headingley Leeds pitch report 3rd ODI: The series decider third ODI between the two sides is set to be played tomorrow in Leeds. Starting the all-format tour with a comprehensive 62-run victory in the first ODI, South Africa were humbled during the second one-dayer in Manchester, receiving a 118-run drubbing from England, to level the three-match series 1-1. The lip-smacking series decider would now take place at the Headingley in Leeds tomorrow, with England expected to give it their all to avoid their second consecutive ODI series loss at home this summer. As for the Proteas, they would have to pull their socks up right away, after their ordinary batting effort during the second ODI saw them register their joint-second-worst total (83) in the format. South Africa would again bank on their top-order comprising Janneman Malan, Rassie van der Dussen, and Aiden Markram later. A lot is also expected from the experience of Quinton de Kock тАУ the only batter to have looked pale in both the ODIs. On to Leeds for the decider ЁЯЩМ ЁЯП┤єаБзєаБвєаБеєаБоєаБзєаБ┐ #ENGvSA ЁЯЗ┐ЁЯЗж pic.twitter.com/sBdvdprawK тАФ England Cricket (@englandcricket) July 22, 2022 The venue is set to host its first One-day international match since the 2019 ICC World Cup, when India defeated Sri Lanka by 7 wickets during the round-robin fixtures. The surface at the Headingley is expected to assist the batters throughout the duration of the match. Having said that, the fast bowlers are likely to extract some decent bounce and pace off the deck, especially with the new ball in hand. Traditionally, the batters have not had the best of times at this venue, with the average first innings total here in the format being 233. However, a fresh pitch is likely to turn out to be a batting friendly one, with the captain winning the Toss likely to prefer to chase the total down.","pubDate":"2022-07-23 16:23:16","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"VIDEO: рдлреИрдорд▓реА рдХреЗ рд╕рд╛рде рдмреЗрд╣рдж рдЦреВрдмрд╕реВрд░рдд рдЬрдЧрд╣ рдкрд░ рдЫреБрдЯреНрдЯрд┐рдпрд╛рдВ рдордирд╛ рд░рд╣реЗ рд╣реИрдВ Faf du Plessis, рд╡рд╛рдЗрдл рдиреЗ рд╢реЗрдпрд░ рдХрд┐рдпрд╛ рд╡реАрдбрд┐рдпреЛ","link":"https://www.abplive.com/sports/cricket/faf-du-plessis-wife-imari-shared-video-caption-he-made-my-dreams-come-true-2175003","keywords":null,"creator":["ABP Live"],"video_url":null,"description":"<p style=\"text-align: justify;\"><strong>Faf du Plessis VIDEO:</strong> рджрдХреНрд╖рд┐рдг рдЕрдлреНрд░реАрдХрд╛ рдХреЗ рджрд┐рдЧреНрдЧрдЬ рдЦрд┐рд▓рд╛рдбрд╝реА рдлрд╛рдл рдбреБ рдкреНрд▓реЗрд╕рд┐рд╕ рдХрд╛ рдЗрдВрдЯрд░рдиреЗрд╢рдирд▓ рд░рд┐рдХреЙрд░реНрдб рд╢рд╛рдирджрд╛рд░ рд░рд╣рд╛ рд╣реИ. рд╡реЗ рдЖрдИрдкреАрдПрд▓ 2022 рдХреЗ рдмрд╛рдж рд╕реЗ рдХреНрд░рд┐рдХреЗрдЯ рдХреЗ рдореИрджрд╛рди рд╕реЗ рджреВрд░ рдЪрд▓ рд░рд╣реЗ рд╣реИрдВ. рдбреБрдкреНрд▓реЗрд╕рд┐рд╕ рдиреЗ рдЗрдВрдбрд┐рдпрди рдкреНрд░реАрдорд┐рдпрд░ рд▓реАрдЧ рдореЗрдВ рднреА рд╢рд╛рдирджрд╛рд░ рдкреНрд░рджрд░реНрд╢рди рдХрд┐рдпрд╛ рд╣реИ. рдбреБ рдкреНрд▓реЗрд╕рд┐рд╕ рдлрд┐рд▓рд╣рд╛рд▓ рдкрд░рд┐рд╡рд╛рд░ рдХреЗ рд╕рд╛рде рдЫреБрдЯреНрдЯрд┐рдпрд╛рдВ рдордирд╛ рд░рд╣реЗ рд╣реИрдВ. рдЙрдирдХреА рд╡рд╛рдЗрдл рдЗрдорд╛рд░реА рдиреЗ рд╕реЛрд╢рд▓ рдореАрдбрд┐рдпрд╛ рдкрд░ рддрд╕реНрд╡реАрд░реЗрдВ рдФрд░ рд╡реАрдбрд┐рдпреЛ рд╢реЗрдпрд░ рдХрд┐рдпрд╛ рд╣реИ, рдЬрд┐рд╕рдореЗрдВ рд╡реЗ рдЗрдиреНрдЬреЙрдп рдХрд░рддреЗ рдирдЬрд░ рдЖ рд░рд╣реЗ рд╣реИрдВ.&nbsp;</p> <p style=\"text-align: justify;\">рдбреБ рдкреНрд▓реЗрд╕рд┐рд╕ рдиреЗ рдЗрдорд╛рд░реА рд╡рд┐рд╕реЗрд░ рд╕реЗ рд▓рдВрдмреЗ рд╕рдордп рддрдХ рд░рд┐рд▓реЗрд╢рди рдореЗрдВ рд░рд╣рдиреЗ рдХреЗ рдмрд╛рдж рд╢рд╛рджреА рдХреА рдереА. рдЕрдм рджреЛрдиреЛрдВ рдХреЗ рдмрдЪреНрдЪреЗ рднреА рд╣реИрдВ. рдбреБ рдкреНрд▓реЗрд╕рд┐рд╕ рдЫреБрдЯреНрдЯрд┐рдпреЛрдВ рдореЗрдВ рдкрд░рд┐рд╡рд╛рд░ рдХреЗ рд╕рд╛рде рдШреВрдордиреЗ рдирд┐рдХрд▓ рдЬрд╛рддреЗ рд╣реИрдВ. рдЗрд╕ рдмрд╛рд░ рд╡реЗ рдЗрдЯрд▓реА рдореЗрдВ рдШреВрдо рд░рд╣реЗ рд╣реИрдВ. рдбреБ рдкреНрд▓реЗрд╕рд┐рд╕ рдХреА рд╡рд╛рдЗрдл рдЗрдорд╛рд░реА рдиреЗ рд╕реЛрд╢рд▓ рдореАрдбрд┐рдпрд╛ рдкрд░ рдХреБрдЫ рд╡реАрдбрд┐рдпреЛ рдФрд░ рддрд╕реНрд╡реАрд░реЗрдВ рд╢реЗрдпрд░ рдХреА рд╣реИрдВ.</p> <p style=\"text-align: justify;\">рдЧреМрд░рддрд▓рдм рд╣реИ рдХрд┐ рдбреБ рдкреНрд▓реЗрд╕рд┐рд╕ рдиреЗ 143 рд╡рдирдбреЗ рдореИрдЪреЛрдВ рдореЗрдВ 5507 рд░рди &nbsp;рдмрдирд╛рдП рд╣реИрдВ. рдЗрд╕ рджреМрд░рд╛рди рдЙрдиреНрд╣реЛрдВрдиреЗ 12 рд╢рддрдХ рдФрд░ 35 рдЕрд░реНрдзрд╢рддрдХ рд▓рдЧрд╛рдП рд╣реИрдВ. рдЙрдиреНрд╣реЛрдВрдиреЗ 69 рдЯреЗрд╕реНрдЯ рдореБрдХрд╛рдмрд▓реЛрдВ рдореЗрдВ 4163 рд░рди рдмрдирд╛рдП рд╣реИрдВ. рдЗрд╕ рджреМрд░рд╛рди рдЙрдиреНрд╣реЛрдВрдиреЗ 10 рд╢рддрдХ рдФрд░ 21 рдЕрд░реНрдзрд╢рддрдХ рд▓рдЧрд╛рдП рд╣реИрдВ. рдЕрдЧрд░ рдЗрдВрдЯрд░рдиреЗрд╢рдирд▓ рдЯреА20 рдореИрдЪреЛрдВ рдХреА рдмрд╛рдд рдХрд░реЗрдВ рддреЛ рдбреБ рдкреНрд▓реЗрд╕рд┐рд╕ рдЗрд╕ рдлреЙрд░реНрдореЗрдЯ рдореЗрдВ 1528 рд░рди рдмрдирд╛ рдЪреБрдХреЗ рд╣реИрдВ.</p> <blockquote class=\"instagram-media\" style=\"background: #FFF; border: 0; border-radius: 3px; box-shadow: 0 0 1px 0 rgba(0,0,0,0.5),0 1px 10px 0 rgba(0,0,0,0.15); margin: 1px; max-width: 540px; min-width: 326px; padding: 0; width: calc(100% - 2px);\" data-instgrm-captioned=\"\" data-instgrm-permalink=\"https://www.instagram.com/p/CgW-U5DKF4a/?utm_source=ig_embed&amp;utm_campaign=loading\" data-instgrm-version=\"14\"> <div style=\"padding: 16px;\"> <div style=\"display: flex; flex-direction: row; align-items: center;\"> <div style=\"background-color: #f4f4f4; border-radius: 50%; flex-grow: 0; height: 40px; margin-right: 14px; width: 40px;\">&nbsp;</div> <div style=\"display: flex; flex-direction: column; flex-grow: 1; justify-content: center;\"> <div style=\"background-color: #f4f4f4; border-radius: 4px; flex-grow: 0; height: 14px; margin-bottom: 6px; width: 100px;\">&nbsp;</div> <div style=\"background-color: #f4f4f4; border-radius: 4px; flex-grow: 0; height: 14px; width: 60px;\">&nbsp;</div> </div> </div> <div style=\"padding: 19% 0;\">&nbsp;</div> <div style=\"display: block; height: 50px; margin: 0 auto 12px; width: 50px;\">&nbsp;</div> <div style=\"padding-top: 8px;\"> <div style=\"color: #3897f0; font-family: Arial,sans-serif; font-size: 14px; font-style: normal; font-weight: 550; line-height: 18px;\">View this post on Instagram</div> </div> <div style=\"padding: 12.5% 0;\">&nbsp;</div> <div style=\"display: flex; flex-direction: row; margin-bottom: 14px; align-items: center;\"> <div> <div style=\"background-color: #f4f4f4; border-radius: 50%; height: 12.5px; width: 12.5px; transform: translateX(0px) translateY(7px);\">&nbsp;</div> <div style=\"background-color: #f4f4f4; height: 12.5px; transform: rotate(-45deg) translateX(3px) translateY(1px); width: 12.5px; flex-grow: 0; margin-right: 14px; margin-left: 2px;\">&nbsp;</div> <div style=\"background-color: #f4f4f4; border-radius: 50%; height: 12.5px; width: 12.5px; transform: translateX(9px) translateY(-18px);\">&nbsp;</div> </div> <div style=\"margin-left: 8px;\"> <div style=\"background-color: #f4f4f4; border-radius: 50%; flex-grow: 0; height: 20px; width: 20px;\">&nbsp;</div> <div style=\"width: 0; height: 0; border-top: 2px solid transparent; border-left: 6px solid #f4f4f4; border-bottom: 2px solid transparent; transform: translateX(16px) translateY(-4px) rotate(30deg);\">&nbsp;</div> </div> <div style=\"margin-left: auto;\"> <div style=\"width: 0px; border-top: 8px solid #F4F4F4; border-right: 8px solid transparent; transform: translateY(16px);\">&nbsp;</div> <div style=\"background-color: #f4f4f4; flex-grow: 0; height: 12px; width: 16px; transform: translateY(-4px);\">&nbsp;</div> <div style=\"width: 0; height: 0; border-top: 8px solid #F4F4F4; border-left: 8px solid transparent; transform: translateY(-4px) translateX(8px);\">&nbsp;</div> </div> </div> <div style=\"display: flex; flex-direction: column; flex-grow: 1; justify-content: center; margin-bottom: 24px;\"> <div style=\"background-color: #f4f4f4; border-radius: 4px; flex-grow: 0; height: 14px; margin-bottom: 6px; width: 224px;\">&nbsp;</div> <div style=\"background-color: #f4f4f4; border-radius: 4px; flex-grow: 0; height: 14px; width: 144px;\">&nbsp;</div> </div> <p style=\"color: #c9c8cd; font-family: Arial,sans-serif; font-size: 14px; line-height: 17px; margin-bottom: 0; margin-top: 8px; overflow: hidden; padding: 8px 0 7px; text-align: center; text-overflow: ellipsis; white-space: nowrap;\"><a style=\"color: #c9c8cd; font-family: Arial,sans-serif; font-size: 14px; font-style: normal; font-weight: normal; line-height: 17px; text-decoration: none;\" href=\"https://www.instagram.com/p/CgW-U5DKF4a/?utm_source=ig_embed&amp;utm_campaign=loading\" target=\"_blank\" rel=\"noopener\">A post shared by Imari Du Plessis (@imagesbyimari)</a></p> </div> </blockquote> <p> <script src=\"//www.instagram.com/embed.js\" async=\"\"></script> </p> <blockquote class=\"instagram-media\" style=\"background: #FFF; border: 0; border-radius: 3px; box-shadow: 0 0 1px 0 rgba(0,0,0,0.5),0 1px 10px 0 rgba(0,0,0,0.15); margin: 1px; max-width: 540px; min-width: 326px; padding: 0; width: calc(100% - 2px);\" data-instgrm-captioned=\"\" data-instgrm-permalink=\"https://www.instagram.com/reel/CgW-zabK07b/?utm_source=ig_embed&amp;utm_campaign=loading\" data-instgrm-version=\"14\"> <div style=\"padding: 16px;\"> <div style=\"display: flex; flex-direction: row; align-items: center;\"> <div style=\"background-color: #f4f4f4; border-radius: 50%; flex-grow: 0; height: 40px; margin-right: 14px; width: 40px;\">&nbsp;</div> <div style=\"display: flex; flex-direction: column; flex-grow: 1; justify-content: center;\"> <div style=\"background-color: #f4f4f4; border-radius: 4px; flex-grow: 0; height: 14px; margin-bottom: 6px; width: 100px;\">&nbsp;</div> <div style=\"background-color: #f4f4f4; border-radius: 4px; flex-grow: 0; height: 14px; width: 60px;\">&nbsp;</div> </div> </div> <div style=\"padding: 19% 0;\">&nbsp;</div> <div style=\"display: block; height: 50px; margin: 0 auto 12px; width: 50px;\">&nbsp;</div> <div style=\"padding-top: 8px;\"> <div style=\"color: #3897f0; font-family: Arial,sans-serif; font-size: 14px; font-style: normal; font-weight: 550; line-height: 18px;\">View this post on Instagram</div> </div> <div style=\"padding: 12.5% 0;\">&nbsp;</div> <div style=\"display: flex; flex-direction: row; margin-bottom: 14px; align-items: center;\"> <div> <div style=\"background-color: #f4f4f4; border-radius: 50%; height: 12.5px; width: 12.5px; transform: translateX(0px) translateY(7px);\">&nbsp;</div> <div style=\"background-color: #f4f4f4; height: 12.5px; transform: rotate(-45deg) translateX(3px) translateY(1px); width: 12.5px; flex-grow: 0; margin-right: 14px; margin-left: 2px;\">&nbsp;</div> <div style=\"background-color: #f4f4f4; border-radius: 50%; height: 12.5px; width: 12.5px; transform: translateX(9px) translateY(-18px);\">&nbsp;</div> </div> <div style=\"margin-left: 8px;\"> <div style=\"background-color: #f4f4f4; border-radius: 50%; flex-grow: 0; height: 20px; width: 20px;\">&nbsp;</div> <div style=\"width: 0; height: 0; border-top: 2px solid transparent; border-left: 6px solid #f4f4f4; border-bottom: 2px solid transparent; transform: translateX(16px) translateY(-4px) rotate(30deg);\">&nbsp;</div> </div> <div style=\"margin-left: auto;\"> <div style=\"width: 0px; border-top: 8px solid #F4F4F4; border-right: 8px solid transparent; transform: translateY(16px);\">&nbsp;</div> <div style=\"background-color: #f4f4f4; flex-grow: 0; height: 12px; width: 16px; transform: translateY(-4px);\">&nbsp;</div> <div style=\"width: 0; height: 0; border-top: 8px solid #F4F4F4; border-left: 8px solid transparent; transform: translateY(-4px) translateX(8px);\">&nbsp;</div> </div> </div> <div style=\"display: flex; flex-direction: column; flex-grow: 1; justify-content: center; margin-bottom: 24px;\"> <div style=\"background-color: #f4f4f4; border-radius: 4px; flex-grow: 0; height: 14px; margin-bottom: 6px; width: 224px;\">&nbsp;</div> <div style=\"background-color: #f4f4f4; border-radius: 4px; flex-grow: 0; height: 14px; width: 144px;\">&nbsp;</div> </div> <p style=\"color: #c9c8cd; font-family: Arial,sans-serif; font-size: 14px; line-height: 17px; margin-bottom: 0; margin-top: 8px; overflow: hidden; padding: 8px 0 7px; text-align: center; text-overflow: ellipsis; white-space: nowrap;\"><a style=\"color: #c9c8cd; font-family: Arial,sans-serif; font-size: 14px; font-style: normal; font-weight: normal; line-height: 17px; text-decoration: none;\" href=\"https://www.instagram.com/reel/CgW-zabK07b/?utm_source=ig_embed&amp;utm_campaign=loading\" target=\"_blank\" rel=\"noopener\">A post shared by Imari Du Plessis (@imagesbyimari)</a></p> </div> </blockquote> <p> <script src=\"//www.instagram.com/embed.js\" async=\"\"></script> </p> <p style=\"text-align: justify;\"><strong>рдпрд╣ рднреА рдкрдврд╝реЗрдВ : <a href=\"https://www.abplive.com/sports/cricket/ind-vs-wi-2nd-odi-shikhar-dhawan-shreyas-iyer-have-chance-to-make-history-of-fours-port-of-spain-trinidad-2174964\">IND vs WI 2nd ODI: Dhawan рд╡рд░реНрд▓реНрдб рд░рд┐рдХреЙрд░реНрдб рдмрдирд╛рдиреЗ рд╕реЗ рджреЛ рдХрджрдо рджреВрд░, рдЕрдпреНрдпрд░ рдХреЗ рдирд╛рдо рджрд░реНрдЬ рд╣реЛ рд╕рдХрддреА рд╣реИ рдЦрд╛рд╕ рдЙрдкрд▓рдмреНрдзрд┐</a></strong></p> <p style=\"text-align: justify;\"><a href=\"https://www.abplive.com/sports/cricket/shreyas-iyer-says-about-dance-during-first-odi-against-west-indies-mohammed-siraj-2174881\"><strong>IND vs WI: Shreyas Iyer рдиреЗ рдмрддрд╛рдпрд╛ рдореИрджрд╛рди рдкрд░ рдХреНрдпреЛрдВ рдХрд░рдиреЗ рд▓рдЧреЗ рдереЗ рдбрд╛рдВрд╕, рд╡реАрдбрд┐рдпреЛ рдореЗрдВ рд╕рд┐рд░рд╛рдЬ рдиреЗ рдмрддрд╛рдпрд╛ рдореИрдЪ рдХрд╛ рдЦрд╛рд╕ рдкреНрд▓рд╛рди</strong></a></p>","content":null,"pubDate":"2022-07-23 16:20:31","image_url":null,"source_id":"abplive","country":["india"],"category":["sports"],"language":"hindi"},{"title":"Ahead of CWG 2022, Indian Women's cricket team wants to learn THIS from Neeraj Chopra, PV Sindhu","link":"https://www.dnaindia.com/cricket/report-ahead-of-cwg-2022-indian-womens-cricket-team-wants-to-learn-from-neeraj-chopra-pv-sindhu-says-ramesh-powar-2970948","keywords":["Sports","Cricket"],"creator":["DNA Web Team"],"video_url":null,"description":"Ahead of Commonwealth Games 2022, Indian Women's cricket team coach Ramesh Powar has said his side will be looking up to Neeraj Chopra and PV Sindhu.","content":null,"pubDate":"2022-07-23 16:11:59","image_url":null,"source_id":"dnaindia","country":["india"],"category":["sports"],"language":"english"},{"title":"Weather in Headingley Leeds July 24: Weather in Leeds forecast 3rd ODI England vs South Africa","link":"https://thesportsrush.com/cricket-news-weather-in-headingley-leeds-july-24-weather-in-leeds-forecast-3rd-odi-england-vs-south-africa/","keywords":["Cricket","England","South Africa","South Africa tour of England 2022"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Weather in Headingley Leeds: The SportsRush presents before you the weather prediction for the third ENG vs SA ODI. The third ODI of South AfricaтАЩs tour of England 2022 will be played in Leeds tomorrow. A series-decider fixture will be followed by a three-match T20I series and a three-match Test series before the culmination ofтАж The post Weather in Headingley Leeds July 24: Weather in Leeds forecast 3rd ODI England vs South Africa appeared first on The SportsRush.","content":"Weather in Headingley Leeds: The SportsRush presents before you the weather prediction for the third ENG vs SA ODI. The third ODI of South AfricaтАЩs tour of England 2022 will be played in Leeds tomorrow. A series-decider fixture will be followed by a three-match T20I series and a three-match Test series before the culmination of this English summer. With both the teams comprehensively winning matches while defending a total in this series, expect captains wanting to do the same on a Sunday morning as well. Unlike the first two ODIs, this match will be a day affair catering to the sub-continent audiences. Set to clash with Sri Lanka vs Pakistan Test and West Indies vs India ODI, cricket fans across the world have a lot to look forward to on July 24. A potential similarity between the second and third ODIs could be rain playing spoilsport. While the second match in Manchester was reduced to a 29-over affair yesterday, the same appears to be a possibility for tomorrow as well. RIP the British Heatwave ЁЯе▓ July 17th 2022 тАУ July 19th 2022 #ENGvSA pic.twitter.com/T9K9bpaq2R тАФ EnglandтАЩs Barmy Army (@TheBarmyArmy) July 22, 2022 An otherwise cool and pleasant day in Leeds comprises of plentiful chances of rainfall leaving a mark to the extent that players might have to face delays. Going by the weather prediction of AccuWeather, rain probability at Headingley will remain around 50% for most part of the day much like Galle . No significant reduction in the rain probability doesnтАЩt augur well for an uninterrupted 100-over contest. Hence, it shouldnтАЩt be a surprise if England and South Africa take part in two consecutive rain-curtailed matches. 11:00 AM тАУ 21 degree (Rain Probability тАУ 47%). 12:00 PM тАУ 21 degree (Rain Probability тАУ 46%). 01:00 PM тАУ 22 degree (Rain Probability тАУ 51%). 02:00 PM тАУ 24 degree (Rain Probability тАУ 44%). 03:00 PM тАУ 23 degree (Rain Probability тАУ 52%). 04:00 PM тАУ 22 degree (Rain Probability тАУ 44%). 05:00 PM тАУ 21 degree (Rain Probability тАУ 56%). 06:00 PM тАУ 20 degree (Rain Probability тАУ 49%). 07:00 PM тАУ 20 degree (Rain Probability тАУ 43%).","pubDate":"2022-07-23 15:44:11","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Scottish cricket found to be institutionally racist тАУ media","link":"https://www.rt.com/sport/559518-scottish-cricket-racism-haq/?utm_source=rss&utm_medium=rss&utm_campaign=RSS","keywords":null,"creator":["RT"],"video_url":null,"description":"A report set to be published on Monday will reveal that evidence of institutional racism has been found in Scottish cricket Read Full Article at RT.com","content":"A report published on Monday will make the revelation, according to the BBC An independent review should throw up evidence of institutional racism in cricket in Scotland, according to the BBC. SportScotland commissioned an investigation last year following allegations of racism and discrimination made by Scotland's all-time wicket-taker Majid Haq.┬а Haq played for his country more than 200 times, yet never again after he was sent home from the World Cup in 2015.┬а \"As an ethnic minority cricketer, you need to perform twice as well as a white counterpart to get the same opportunities,\" he stressed to BBC Scotland in November 2021. After┬аHaq's complaints, the review was then carried out by Plan4sport, who are equality and diversity specialists, with a number of allegations then passed on to Scottish police. In April, an interim report revealed how over 200 people had given evidence.┬а Read more тАШI have nothing to hideтАЩ: Ex-England captain denies making тАШtoo many of you lotтАЩ remark to Asians amid huge cricket racism scandal While local governing body Cricket Scotland has yet to lay eyes on the final report and was also unwilling to speculate on its findings, it has already offered an apology to anyone that has suffered racism across the sport. \"Cricket should be a welcoming place for everyone and not somewhere that racism or any form of discrimination takes place,\"┬аsaid a spokesperson from the body. \"The Cricket Scotland Board is truly sorry to everyone who has experienced racism in cricket in Scotland. \"We would like to sincerely thank everyone who has been involved in contributing to the review, however the board is not in a position to comment on the independent review's report as we will not see it until it is published publicly on Monday,\" the spokesperson concluded, while vowing that Cricket Scotland would implement any changes or recommendations made in the review. The BBC understands that SportScotland is extremely concerned by the findings of the review and will entertain all options including a total withdrawal of its funding to Cricket Scotland. Read more тАШP*kiтАЩ slurs were just тАШbanterтАЩ? Famous cricket club under fire after investigation while alleged victim also accused of racism Between 2019 and 2020 it provided over ┬г500,000 to the organization.┬а The potential scandal comes after ex-Yorkshire player Azeem Rafiq told British members of parliament that English cricket is \"institutionally racist\". In response to this, Yorkshire's ground Headingley was temporarily banned from hosting international matches and the England and Wales Cricket board created a 12-point plan aimed at┬аdealing with racism in the English game.","pubDate":"2022-07-23 15:38:27","image_url":"https://cdni.russiatoday.com/files/2022.07/thumbnail/62dc078985f54014aa25b6f5.jpg","source_id":"rt","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Legends League Cricket: рднрд╛рд░рдд рдореЗрдВ рд▓рдЧреЗрдЧрд╛ рдХреНрд░рд┐рдХреЗрдЯ рдХреЗ рд▓реАрдЬреЗрдВрдбреНрд╕ рдХрд╛ рдЬрдорд╛рд╡рдбрд╝рд╛, рд╕рд┐рддрдВрдмрд░ рдореЗрдВ рд╢реБрд░реВ рд╣реЛрдЧреА рд▓реАрдЧ","link":"https://navbharattimes.indiatimes.com/sports/cricket/cricket-news/season-2-of-legends-league-cricket-to-be-played-in-india/articleshow/93078510.cms","keywords":null,"creator":null,"video_url":null,"description":"Legends League Cricket in India: рд▓реАрдЬреЗрдВрдбреНрд╕ рд▓реАрдЧ рдХреНрд░рд┐рдХреЗрдЯ рдХреЗ рджреВрд╕рд░реЗ рд╕реАрдЬрди рдХрд╛ рдЖрдпреЛрдЬрди рднрд╛рд░рдд рдореЗрдВ рдХрд┐рдпрд╛ рдЬрд╛рдПрдЧрд╛ред рдЗрд╕рдХреА рд╢реБрд░реБрдЖрдд рд╕рд┐рддрдВрдмрд░ рдореЗрдВ рд╣реЛрдЧреАред рд▓реАрдЧ рдХрд╛ рдкрд╣рд▓рд╛ рд╕реАрдЬрди рдУрдорд╛рди рдореЗрдВ рдЦреЗрд▓рд╛ рдЧрдпрд╛ рдерд╛ред рдЗрд╕рдореЗрдВ рд╡реАрд░реЗрдВрджреНрд░ рд╕рд╣рд╡рд╛рдЧ, рдЬреИрдХ рдХреИрд▓рд┐рд╕ рд╕реЗ рд▓реЗрдХрд░ рдмреНрд░реЗрдЯ рд▓реА рдФрд░ рдореБрд░рд▓реАрдзрд░рди рдЬреИрд╕реЗ рдХреНрд░рд┐рдХреЗрдЯ рдХреЗ рдкреВрд░реНрд╡ рджрд┐рдЧреНрдЧрдЬ рдЦрд┐рд▓рд╛рдбрд╝реА рд╣рд┐рд╕реНрд╕рд╛ рд▓реЗрдВрдЧреЗред","content":null,"pubDate":"2022-07-23 15:34:36","image_url":null,"source_id":"navbharattimes","country":["india"],"category":["sports"],"language":"hindi"},{"title":"Virat Kohli рдХреЛ рд▓реЗрдХрд░ рдХрдкрд┐рд▓ рджреЗрд╡ рдХреЗ рдмрдпрд╛рди рдкрд░ рд░рд┐рдХреА рдкреЛрдВрдЯрд┐рдВрдЧ рдФрд░ рдЕрдЬреАрдд рдЕрдЧрд░рдХрд░ рдХрд╛ рдЬрд╡рд╛рдм, рдХрд╣реА рдпреЗ рдмрд╛рдд","link":"https://www.abplive.com/sports/cricket/former-australian-captain-ricky-ponting-said-that-if-virat-kohli-is-not-part-of-the-indian-team-then-it-will-be-a-relief-for-the-opposition-bowlers-2174846","keywords":null,"creator":["ABP Live"],"video_url":null,"description":"<p style=\"text-align: justify;\"><strong>Ricky Ponting On Virat Kohli:</strong> рд╡рд┐рд░рд╛рдЯ рдХреЛрд╣рд▓реА рдХреЗ рдЦрд░рд╛рдм рдлреЙрд░реНрдо рдкрд░ рдкреВрд░реНрд╡ рдХреНрд░рд┐рдХреЗрдЯрд░ рд▓рдЧрд╛рддрд╛рд░ рдЕрдкрдиреА рдкреНрд░рддрд┐рдХреНрд░рд┐рдпрд╛ рджреЗ рд░рд╣реЗ рд╣реИрдВ. рджрд░рдЕрд╕рд▓, рдкрд┐рдЫрд▓реЗ рджрд┐рдиреЛрдВ рдкреВрд░реНрд╡ рднрд╛рд░рддреАрдп рдЦрд┐рд▓рд╛рдбрд╝реА рдХрдкрд┐рд▓ рджреЗрд╡ (Kapil Dev) рдиреЗ рд╡рд┐рд░рд╛рдЯ рдХреЛрд╣рд▓реА (Virat Kohli) рдкрд░ рдмрдбрд╝рд╛ рдмрдпрд╛рди рджрд┐рдп рдерд╛. рдЙрдиреНрд╣реЛрдВрдиреЗ рдХрд╣рд╛ рдерд╛ рдХрд┐ рдЕрдЧрд░ рдЯреЗрд╕реНрдЯ рдХреНрд░рд┐рдХреЗрдЯ рдореЗрдВ рд░рд╡рд┐ рдЕрд╢реНрд╡рд┐рди (Ravi Ashwin) рдХреЛ рдмрд╛рд╣рд░ рдХрд┐рдпрд╛ рдЬрд╛ рд╕рдХрддрд╛ рд╣реИ рддреЛ рдЯреА20 рдХреНрд░рд┐рдХреЗрдЯ рдореЗрдВ рд╡рд┐рд░рд╛рдЯ рдХреЛрд╣рд▓реА рдХреЛ рдХреНрдпреЛрдВ рдирд╣реАрдВ. рд╡рд╣реАрдВ, рд╡реЗрд╕реНрдЯрдЗрдВрдбреАрдЬ рдХреЗ рдЦрд┐рд▓рд╛рдл рд╡рдирдбреЗ рд╕реАрд░реАрдЬ рдХреЗ рд▓рд┐рдП рд╡рд┐рд░рд╛рдЯ рдХреЛрд╣рд▓реА рдХреЛ рдЖрд░рд╛рдо рджрд┐рдпрд╛ рдЧрдпрд╛ рд╣реИ.</p> <p style=\"text-align: justify;\"><strong>'рдХреНрд░рд┐рдХреЗрдЯрд░ рдХреЗ рддреМрд░ рдкрд░ рдЙрддрд╛рд░-рдЪрдврд╝рд╛рд╡ рд▓рдЧрд╛ рд░рд╣рддрд╛ рд╣реИ'</strong></p> <p style=\"text-align: justify;\">рднрд╛рд░рддреАрдп рдХреНрд░рд┐рдХреЗрдЯ рдЯреАрдо рдореЗрдВ рд╡рд┐рд░рд╛рдЯ рдХреЛрд╣рд▓реА рдХреЗ рдЬрдЧрд╣ рдкрд░ рд▓рдЧрд╛рддрд╛рд░ рд╕рд╡рд╛рд▓ рдЙрда рд░рд╣реЗ рд╣реИрдВ, рд▓реЗрдХрд┐рди рдЕрдм рдкреВрд░реНрд╡ рдСрд╕реНрдЯреНрд░реЗрд▓рд┐рдпрд╛рдИ рдХрдкреНрддрд╛рди рд░рд┐рдХреА рдкреЛрдВрдЯрд┐рдВрдЧ рдФрд░ рдЕрдЬреАрдд рдЕрдЧрд░рдХрд░ рдиреЗ рд╡рд┐рд░рд╛рдЯ рдХреЛрд╣рд▓реА рдХрд╛ рдмрдЪрд╛рд╡ рдХрд┐рдпрд╛ рд╣реИ. рдЕрдЬреАрдд рдЕрдЧрд░рдХрд░ рдиреЗ рдХрд╣рд╛ рдХрд┐ рдХреНрд░рд┐рдХреЗрдЯрд░ рдХреЗ рддреМрд░ рдкрд░ рдЙрддрд╛рд░-рдЪрдврд╝рд╛рд╡ рд▓рдЧрд╛ рд░рд╣рддрд╛ рд╣реИ, рдпрд╣ рд╕рд╛рдорд╛рдиреНрдп рд╣реИ. рдЙрдиреНрд╣реЛрдВрдиреЗ рдХрд╣рд╛ рдХрд┐ 50 рдУрд╡рд░ рд╡рд░реНрд▓реНрдб рдХрдк рдореЗрдВ рддрдХрд░реАрдмрди 1 рд╕рд╛рд▓ рдХрд╛ рд╡рдХреНрдд рдмрдЪрд╛ рд╣реИ, рдРрд╕реЗ рдореЗрдВ рдореЗрд░рд╛ рдорд╛рдирдирд╛ рд╣реИ рдХрд┐ рджреЗрд░-рд╕рдмреЗрд░ рднрд╛рд░рддреАрдп рджрд┐рдЧреНрдЧрдЬ рд╡рд┐рд░рд╛рдЯ рдХреЛрд╣рд▓реА рдлреЙрд░реНрдо рдореЗрдВ рдЖ рдЬрд╛рдПрдВрдЧреЗ. рд╕рд╛рде рд╣реА рдЙрдиреНрд╣реЛрдВрдиреЗ рдХрд╣рд╛ рдХрд┐ рдлреИрдВрд╕ рдХреЗ рддреМрд░ рдкрд░ рдЖрдк рдмрд┐рд▓реНрдХреБрд▓ рдирд╣реАрдВ рдЪрд╛рд╣реЗрдВрдЧреЗ рдХрд┐ рд╡рд┐рд░рд╛рдЯ рдХреЛрд╣рд▓реА рд▓рдВрдмреЗ рд╡рдХреНрдд рддрдХ рдЖрдЙрдЯ рдСрдл рдлреЙрд░реНрдо рд░рд╣реЗ.</p> <p style=\"text-align: justify;\"><strong>'рдХреЛрд╣рд▓реА рдХрд╛ рдирд╣реАрдВ рд╣реЛрдирд╛ рд╡рд┐рдкрдХреНрд╖реА рдЯреАрдо рдХреЗ рд▓рд┐рдП рд░рд╛рд╣рдд рднрд░реА рдЦрдмрд░'</strong></p> <p style=\"text-align: justify;\">рдЧреМрд░рддрд▓рдм рд╣реИ рдХрд┐ рдкреВрд░реНрд╡ рдСрд╕реНрдЯреНрд░реЗрд▓рд┐рдпрд╛рдИ рдХрдкреНрддрд╛рди рд░рд┐рдХреА рдкреЛрдВрдЯрд┐рдВрдЧ (Ricky Ponting) рдиреЗ рдкрд┐рдЫрд▓реЗ рджрд┐рдиреЛрдВ рд╡рд┐рд░рд╛рдЯ рдХреЛрд╣рд▓реА (Virat Kohli) рдкрд░ рдмрдпрд╛рди рджрд┐рдпрд╛ рдерд╛. рдЙрдиреНрд╣реЛрдВрдиреЗ рдХрд╣рд╛ рдерд╛ рдХрд┐ рдЕрдЧрд░ рд╡рд┐рд░рд╛рдЯ рдХреЛрд╣рд▓реА рднрд╛рд░рддреАрдп рдЯреАрдо рдХрд╛ рд╣рд┐рд╕реНрд╕рд╛ рдирд╣реАрдВ рд╣реЛрддреЗ рд╣реИрдВ рддреЛ рдпрд╣ рд╡рд┐рдкрдХреНрд╖реА рдЧреЗрдВрджрдмрд╛рдЬреЛрдВ рдХреЗ рд▓рд┐рдП рд░рд╛рд╣рдд рднрд░реА рдЦрдмрд░ рд╣реЛрдЧреА. рд╡рд╣реАрдВ, рдкреВрд░реНрд╡ рднрд╛рд░рддреАрдп рдХреНрд░рд┐рдХреЗрдЯрд░ рдЕрдЬреАрдд рдЕрдЧрд░рдХрд░ (Ajit Agarkar) рдХрд╛ рдорд╛рдирдирд╛ рд╣реИ рдХрд┐ рд╡рд░реНрд▓реНрдб рдХрдк (World Cup) рдЬреИрд╕реЗ рдЯреВрд░реНрдирд╛рдореЗрдВрдЯ рдореЗрдВ рд╡рд┐рд░рд╛рдЯ рдХреЛрд╣рд▓реА рдЬреИрд╕реЗ рдЦрд┐рд▓рд╛рдбрд╝рд┐рдпреЛрдВ рдХреА рднреВрдорд┐рдХрд╛ рдХрд╛рдлреА рдЕрд╣рдо рд╣реЛ рдЬрд╛рддреА рд╣реИ. рд╡рд┐рд░рд╛рдЯ рдХреЛрд╣рд▓реА рдЬреИрд╕реЗ рдЦрд┐рд▓рд╛рдбрд╝реА рдмрд▓реНрд▓реЗ рд╕реЗ рд╣реА рдирд╣реАрдВ, рдмрд▓реНрдХрд┐ рдЕрдиреБрднрд╡ рднреА рдмреЗрд╣рдж рдЕрд╣рдо рд╣реИ.</p> <p style=\"text-align: justify;\"><strong>рдпреЗ рднреА рдкрдврд╝реЗрдВ-</strong></p> <p style=\"text-align: justify;\"><strong><a href=\"https://www.abplive.com/sports/cricket/ravi-shastri-gave-unique-twist-to-debate-on-ending-odi-format-gave-big-statement-about-test-cricket-2174523\">рд╡рдирдбреЗ рдлреЙрд░реНрдореЗрдЯ рдХреЛ рдЦрддреНрдо рдХрд░рдиреЗ рдХреА рдмрд╣рд╕ рдХреЛ Ravi Shastri рдиреЗ рджрд┐рдпрд╛ рдЕрдиреЛрдЦрд╛ рдореЛрдбрд╝, рдЯреЗрд╕реНрдЯ рдХреНрд░рд┐рдХреЗрдЯ рдХреЛ рд▓реЗрдХрд░ рджрд┐рдпрд╛ рдмрдбрд╝рд╛ рдмрдпрд╛рди</a><br /></strong></p> <p style=\"text-align: justify;\"><strong><a href=\"https://www.abplive.com/sports/cricket/indian-players-meet-brian-lara-in-dressing-room-after-west-indies-vs-india-1st-odi-2174754\">VIDEO: Team India рдХреЗ рдЦрд┐рд▓рд╛рдбрд╝рд┐рдпреЛрдВ рдиреЗ рдмреНрд░рд╛рдпрди рд▓рд╛рд░рд╛ рд╕реЗ рдбреНрд░реЗрд╕рд┐рдВрдЧ рд░реВрдо рдореЗрдВ рдХреА рдореБрд▓рд╛рдХрд╛рдд, рджреЗрдЦреЗрдВ рдзрд╡рди-рдЕрдпреНрдпрд░ рдХреЛ рдХреНрдпрд╛ рджрд┐рдП рдЯрд┐рдкреНрд╕</a><br /></strong></p>","content":null,"pubDate":"2022-07-23 15:32:38","image_url":null,"source_id":"abplive","country":["india"],"category":["sports"],"language":"hindi"},{"title":"Mithali Raj marks 5th anniversary of 2017 Women's World Cup final with a special post, says THIS","link":"https://zeenews.india.com/cricket/mithali-raj-marks-5th-anniversary-of-2017-womens-world-cup-final-with-a-special-post-says-this-2488920.html","keywords":null,"creator":null,"video_url":null,"description":"One of the finest players to ever play in women`s cricket and former India captain Mithali Raj remembered the fifth anniversary of the historic 2017 Women`s World Cup final on Saturday.Mithali, who led India to the iconic final against England at the `Mecca of Cricket` Lord`s Cricket Ground, said that they may not have won the ICC World Cup in 2017 but the event changed the landscape of women`s cricket.","content":"One of the finest players to ever play in women`s cricket and former India captain Mithali Raj remembered the fifth anniversary of the historic 2017 Women`s World Cup final on Saturday.Mithali, who led India to the iconic final against England at the `Mecca of Cricket` Lord`s Cricket Ground, said that they may not have won the ICC World Cup in 2017 but the event changed the landscape of women`s cricket. Mithali Raj took to Twitter and shared, \"This day at Lord`s in 2017 did not favour us but I believe it helped turn a page in Indian women`s cricket. It changed the perspective toward women`s cricket in India. The support our team received thereafter sparked a revolution with younger talents taking up the game.\" This day at Lord's in 2017 did not favour us but I believe it helped turn a page in Indian women's cricket. It changed the perspective toward women's cricket in India. The support our team received thereafter sparked a revolution with younger talents taking up the game. pic.twitter.com/cJkxyJIDQI тАФ Mithali Raj (@M_Raj03) July 23, 2022 India had concluded their World Cup campaign on the third spot in the points table with five victories in 7 matches in the round-robin stage of the tournament and faced Australia in the semi-finals. Harmanpreet Kaur`s record-breaking 171*-run knock destroyed the tournament`s favourite Australians as India qualified for the final.India lost the ICC Women`s World Cup 2017 final against England by nine runs. The Mithali Raj-led side was in a brilliant position to lift its first-ever trophy but Anya Shrubsole`s six-wicket haul snatched India`s happiness. With ANI inputs","pubDate":"2022-07-23 15:17:00","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"Galle cricket ground pitch report: Galle international stadium 2nd Test pitch report SL vs PAK","link":"https://thesportsrush.com/cricket-news-galle-cricket-ground-pitch-report-galle-international-stadium-2nd-test-pitch-report-sl-vs-pak/","keywords":["Cricket","Galle","Galle International stadium","Pakistan tour of Sri Lanka 2022"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Galle cricket ground pitch report: High in confidence Pakistan side take on Sri Lanka tomorrow with an eye on clinching the Test series. After registering their second-highest run-chase in Test match history last week, and the highest-ever at the Galle international stadium, Babar Azam-led Pakistan take on Sri Lanka in the second and final TestтАж The post Galle cricket ground pitch report: Galle international stadium 2nd Test pitch report SL vs PAK appeared first on The SportsRush.","content":"Galle cricket ground pitch report: High in confidence Pakistan side take on Sri Lanka tomorrow with an eye on clinching the Test series. After registering their second-highest run-chase in Test match history last week, and the highest-ever at the Galle international stadium, Babar Azam-led Pakistan take on Sri Lanka in the second and final Test of the tour tomorrow at the same venue. Having last toured the Island nation back in the year 2015, Pakistan would yet again eye on a series victory versus the hosts, when they take the field on Sunday. As for Sri Lanka, they would be kicking themselves for the first Test loss, after having dominated the proceedings till the first three days of the match. Some spirited and defiant batting performances from Pakistan skipper Babar Azam (first innings) and Abdullah Shafique (second innings), helped turn the tide in some fashion in favour of the visitors, who broke and created quite some records during the process. Prabath Jayasuriya, just two Test matches old, was yet again impressive with the ball in hand, bagging nine wickets in the match, albeit with very little support from the rest of the pack, especially during the second innings. ЁЯЧгя╕П Pakistan skipper @babarazam258 speaks on the much-needed break after the first Test and the morale of the squad before the second match against Sri Lanka ЁЯПП #SLvPAK | #BackTheBoysInGreen pic.twitter.com/p0hbKlHXRv тАФ Pakistan Cricket (@TheRealPCB) July 23, 2022 No points for guessing that the Galle pitch will offer decent turn, and the spinnersтАЩ performances might well dictate the match outcome yet again. During the first encounter between these two sides at the Galle international stadium, spinners returned with a total of 26 of the 36 wickets that fell in the Test. Having said that, the batters would not be playing on land mines either. The pitch is expected to stay true to the bounce, with the pacers likely to bowl with a predictable bounce, thereby making the run-scoring against them much easier. All in all, spinners are expected to have a crack yet again, while the batters can score big as well with some disciplined batting.","pubDate":"2022-07-23 15:12:38","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"IND vs WI 2nd ODI Dream11 prediction: Fantasy cricket tips for India vs West Indies in Trinidad","link":"https://www.dnaindia.com/cricket/report-ind-vs-wi-2nd-odi-dream11-prediction-fantasy-cricket-tips-for-india-vs-west-indies-in-trinidad-fancode-2970932","keywords":["Sports","Cricket"],"creator":["DNA Web Team"],"video_url":null,"description":"IND vs WI Dream 11 Team - Check My Dream11 Team, Best Player's list for India vs West Indies 2nd ODI","content":null,"pubDate":"2022-07-23 15:06:05","image_url":null,"source_id":"dnaindia","country":["india"],"category":["sports"],"language":"english"},{"title":"Indian women's cricket team want to learn THIS from Neeraj Chopra and PV Sindhu: Head coach Ramesh Powar ahead of Commonwealth Games 2022","link":"https://zeenews.india.com/cricket/indian-womens-cricket-team-want-to-learn-this-from-neeraj-chopra-and-pv-sindhu-head-coach-ramesh-powar-ahead-of-commonwealth-games-2022-2488917.html","keywords":null,"creator":null,"video_url":null,"description":"As cricket makes a return to the Commonwealth Games for the first time in 24 years, excitement was evident in the way Powar and skipper Harmanpreet Kaur spoke in the pre-departure virtual press conference.","content":"India's Olympics stars PV Sindhu and Neeraj Chopra have impressed not just Indian but sports fans all around the world with their ability to soak pressure and emerge victorious in crucial moments. Indian women's cricket team head coach Ramesh Powar has expressed that his side would like to meet Sindhu and Chopra and learn how to deal with pressure situations ahead of the 2022 Commonwealth Games. #TeamIndia captain @ImHarmanpreet speaks about the excitement to play in the @birminghamcg22 Commonwealth Games #B2022 pic.twitter.com/uOVnsKmwwU тАФ BCCI Women (@BCCIWomen) July 23, 2022 As cricket makes a return to the Commonwealth Games for the first time in 24 years, excitement was evident in the way Powar and skipper Harmanpreet Kaur spoke in the pre-departure virtual press conference. Powar expressed his wish to make the team meet Sindhu and Chopra if they find time at the Games Village to learn what makes the duo high-performing achievers in their own disciplines. \"Quite honestly, if there is an opportunity, we all would like to meet P.V. Sindhu and Neeraj Chopra. Both of them have set the bar high, I would love to go into their minds. I am curious about their preparation, and the way they handle the pressure of the expectations of billion people, it is commendable. We as a group would like to exchange some notes with these two top-class athletes.\" The prospect of playing in the Commonwealth Games will be a new experience for Harmanpreet & Co., starting off with walking with the whole Indian contingent in the opening ceremony, interacting with athletes from other disciplines and if possible, participating in the closing ceremony too. Harmanpreet has already started to imagine what it would be to feel the Games environment in reality. \"As we speak, I actually feel as if I am walking on that road (at the opening ceremony). This time, we are going to be a part of the multi-sport event, it is not only about cricket, but there would also be other sports as well. We want to celebrate each and every medal we will win, we all are very excited. We all are looking forward and we cannot wait to be part of this great event.\" India will be going into the Commonwealth Games on the back of a 2-1 series win against Sri Lanka. At Edgbaston, the host of women's T20 event, India are in Group A along with Australia, Pakistan and Barbados. India will kick off their Group A campaign against Australia on July 29 and need to secure at least two wins to get into knockouts for the medal matches. \"We all as cricketers and myself, have watched the Olympics and Commonwealth Games, where we see our nation's flag flying high. It is a kind of opportunity for all of us to showcase good performance, give our best and make the country proud. This is one of the competitions where you feel that you should put up a good show to give some enjoyment back to the country and make them feel proud about yourself,\" stated Powar. A couple of days ago, England captain Heather Knight had said that the women's T20 event at Commonwealth Games could prove to be a game changer for women's cricket. Harmanpreet, too, agrees with the same, especially with cricket pushing for a spot in the Olympics. \"Yes, because as a cricketer we are always wishing to play more cricket and this year, we are getting participation in a multi-sport event. I think that whenever you go to an event, it becomes very important to perform well and to show the capabilities of your team. In the future, if we get to participate in tournaments like this, definitely it is going to be very good for women's cricket.\" The talk about cricket's inclusion in the Olympics in the future will surely loom around. But for now, India's focus is on the Commonwealth Games, where they would be soaking in the environment of a multi-game event and get inspired by various athletes to clinch a historic medal in women's T20 cricket.","pubDate":"2022-07-23 15:06:00","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"IND vs WI 2nd ODI: Dhawan рд╡рд░реНрд▓реНрдб рд░рд┐рдХреЙрд░реНрдб рдмрдирд╛рдиреЗ рд╕реЗ рджреЛ рдХрджрдо рджреВрд░, рдЕрдпреНрдпрд░ рдХреЗ рдирд╛рдо рджрд░реНрдЬ рд╣реЛ рд╕рдХрддреА рд╣реИ рдЦрд╛рд╕ рдЙрдкрд▓рдмреНрдзрд┐","link":"https://www.abplive.com/sports/cricket/ind-vs-wi-2nd-odi-shikhar-dhawan-shreyas-iyer-have-chance-to-make-history-of-fours-port-of-spain-trinidad-2174964","keywords":null,"creator":["ABP Live"],"video_url":null,"description":"<p style=\"text-align: justify;\"><strong>Shikhar Dhawan Shreyas Iyer IND vs WI 2nd ODI:</strong> рдЯреАрдо рдЗрдВрдбрд┐рдпрд╛ рдФрд░ рд╡реЗрд╕реНрдЯрдЗрдВрдбреАрдЬ рдХреЗ рдмреАрдЪ рд╡рдирдбреЗ рд╕реАрд░реАрдЬ рдХрд╛ рджреВрд╕рд░рд╛ рдореИрдЪ рд░рд╡рд┐рд╡рд╛рд░ рдХреЛ рдЦреЗрд▓рд╛ рдЬрд╛рдПрдЧрд╛. рдЗрд╕ рдореБрдХрд╛рдмрд▓реЗ рдореЗрдВ рд╢рд┐рдЦрд░ рдзрд╡рди рдФрд░ рд╢реНрд░реЗрдпрд╕ рдЕрдпреНрдпрд░ рдЕрдкрдиреЗ рдирд╛рдо рдПрдХ рдЦрд╛рд╕ рдЙрдкрд▓рдмреНрдзрд┐ рдХрд░ рд╕рдХрддреЗ рд╣реИрдВ. рдзрд╡рди рдХреЗ рдкрд╛рд╕ рд╡рдирдбреЗ рдХрд░рд┐рдпрд░ рдореЗрдВ 800 рдЪреМрдХреЗ рдкреВрд░реЗ рдХрд░рдиреЗ рдХрд╛ рдореМрдХрд╛ рд╣реИ. рдЬрдмрдХрд┐ рдЕрдпреНрдпрд░ 100 рдЪреМрдХреЗ рдкреВрд░реЗ рдХрд░ рд╕рдХрддреЗ &nbsp;рд╣реИрдВ. рдзрд╡рди рдиреЗ рдкрд╣рд▓реЗ рд╡рдирдбреЗ рдореЗрдВ рд╢рд╛рдирджрд╛рд░ рдкреНрд░рджрд░реНрд╢рди рдХрд░рддреЗ рд╣реБрдП 97 рд░рди рдмрдирд╛рдП рдереЗ. рдЬрдмрдХрд┐ рдЕрдпреНрдпрд░ рдиреЗ рдЕрд░реНрдзрд╢рддрдХ рдЬрдбрд╝рд╛ рдерд╛.</p> <p style=\"text-align: justify;\">рдзрд╡рди рдиреЗ рд╡рдирдбреЗ рд╕реАрд░реАрдЬ рдХреЗ рдкрд╣рд▓реЗ рдореИрдЪ рдореЗрдВ 99 рдЧреЗрдВрджреЛрдВ рдХрд╛ рд╕рд╛рдордирд╛ рдХрд░рддреЗ рд╣реБрдП 97 рд░рди рдмрдирд╛рдП рдереЗ. рдЗрд╕ рджреМрд░рд╛рди рдЙрдиреНрд╣реЛрдВрдиреЗ 10 рдЪреМрдХреЗ рдФрд░ 3 рдЫрдХреНрдХреЗ рд▓рдЧрд╛рдП рдереЗ. рдзрд╡рди рд╡рдирдбреЗ рдлреЙрд░реНрдореЗрдЯ рдореЗрдВ 798 рдЪреМрдХреЗ рд▓рдЧрд╛ рдЪреБрдХреЗ рд╣реИрдВ. рдЗрд╕ рджреМрд░рд╛рди рдЙрдиреНрд╣реЛрдВрдиреЗ 153 рдореИрдЪреЛрдВ рдореЗрдВ 6422 рд░рди рдмрдирд╛рдП рд╣реИрдВ. рдзрд╡рди рдХреЗ рдкрд╛рд╕ рдЕрдм 800 рдЪреМрдХреЗ рдкреВрд░реЗ рдХрд░рдиреЗ рдХрд╛ рдореМрдХрд╛ рд╣реИ. рдЕрдЧрд░ рд╡реЗ рд╡реЗрд╕реНрдЯрдЗрдВрдбреАрдЬ рдХреЗ рдЦрд┐рд▓рд╛рдл рджреВрд╕рд░реЗ рд╡рдирдбреЗ рдореЗрдВ рджреЛ рдЪреМрдХреЗ рд▓рдЧрд╛ рджреЗрддреЗ рд╣реИрдВ рддреЛ рд╡реЗ рдЦрд╛рд╕ рдЙрдкрд▓рдмреНрдзрд┐ рд╣рд╛рд╕рд┐рд▓ рдХрд░ рд╕рдХрддреЗ рд╣реИрдВ.</p> <p style=\"text-align: justify;\">рдЕрдпреНрдпрд░ рд╡реЗрд╕реНрдЯрдЗрдВрдбреАрдЬ рдХреЗ рдЦрд┐рд▓рд╛рдл рдкрд╣рд▓реЗ рд╡рдирдбреЗ рдореЗрдВ рдирдВрдмрд░ 3 рдкрд░ рдмреИрдЯрд┐рдВрдЧ рдХрд░рдиреЗ рдЖрдП рдереЗ. рдЗрд╕ рджреМрд░рд╛рди рдЙрдиреНрд╣реЛрдВрдиреЗ 57 рдЧреЗрдВрджреЛрдВ рдХрд╛ рд╕рд╛рдордирд╛ рдХрд░рддреЗ рд╣реБрдП 54 рд░рди рдмрдирд╛рдП. рдЕрдпреНрдпрд░ рдХреА рдЗрд╕ рдкрд╛рд░реА рдореЗрдВ 5 рдЪреМрдХреЗ рдФрд░ 2 рдЫрдХреНрдХреЗ рд╢рд╛рдорд┐рд▓ рд░рд╣реЗ. рдЕрдм рдЙрдирдХреЗ рдкрд╛рд╕ рд╡рдирдбреЗ рдореИрдЪреЛрдВ рдореЗрдВ 100 рдЪреМрдХреЗ рдкреВрд░реЗ рдХрд░рдиреЗ рдХрд╛ рдореМрдХрд╛ рд╣реИ. рдЕрдЧрд░ рдЕрдпреНрдпрд░ рджреВрд╕рд░реЗ рд╡рдирдбреЗ рдореЗрдВ рджреЛ рдЪреМрдХреЗ рд▓рдЧрд╛ рджреЗрддреЗ рд╣реИрдВ рддреЛ рд╡реЗ рдпрд╣ рдЦрд╛рд╕ рдЙрдкрд▓рдмреНрдзрд┐ рд╣рд╛рд╕рд┐рд▓ рдХрд░ рд▓реЗрдВрдЧреЗ. рдЙрдиреНрд╣реЛрдВрдиреЗ 28 рд╡рдирдбреЗ рдореБрдХрд╛рдмрд▓реЗ рдореЗрдВ 98 рдЪреМрдХреЗ рд▓рдЧрд╛рдП рд╣реИрдВ.</p> <p style=\"text-align: justify;\"><strong>рдпрд╣ рднреА рдкрдврд╝реЗрдВ : <a href=\"https://www.abplive.com/sports/cricket/harmanpreet-kaur-says-about-debut-in-commonwealth-games-2022-indian-women-team-2174957\">Commonwealth Games 2022 рдореЗрдВ рдбреЗрдмреНрдпреВ рдкрд░ рд╣рд░рдордирдкреНрд░реАрдд рдХреМрд░ рдиреЗ рджреА рдкреНрд░рддрд┐рдХреНрд░рд┐рдпрд╛, Team India рдХреЛ рд▓реЗрдХрд░ рдХрд╣реА рдпрд╣ рдмрд╛рдд</a></strong></p> <p style=\"text-align: justify;\"><a href=\"https://www.abplive.com/sports/cricket/shreyas-iyer-says-about-dance-during-first-odi-against-west-indies-mohammed-siraj-2174881\"><strong>IND vs WI: Shreyas Iyer рдиреЗ рдмрддрд╛рдпрд╛ рдореИрджрд╛рди рдкрд░ рдХреНрдпреЛрдВ рдХрд░рдиреЗ рд▓рдЧреЗ рдереЗ рдбрд╛рдВрд╕, рд╡реАрдбрд┐рдпреЛ рдореЗрдВ рд╕рд┐рд░рд╛рдЬ рдиреЗ рдмрддрд╛рдпрд╛ рдореИрдЪ рдХрд╛ рдЦрд╛рд╕ рдкреНрд▓рд╛рди</strong></a></p>","content":null,"pubDate":"2022-07-23 15:00:07","image_url":null,"source_id":"abplive","country":["india"],"category":["sports"],"language":"hindi"},{"title":"Highest 6th wicket partnership: Highest partnership in first class cricket sixth wicket full list","link":"https://thesportsrush.com/cricket-news-highest-6th-wicket-partnership-highest-partnership-in-first-class-cricket-sixth-wicket-full-list/","keywords":["Cricket","Chris Cooke","County Championship 2022","Glamorgan","Leicestershire","Sam Northeast"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Highest 6th wicket partnership in first-class cricket: The Glamorgan-duo have made it to the record books on the back of a mammoth stand. During the fourth day of the 39th match of County Championship Division Two 2022 between Leicestershire and Glamorgan in Leicester, Glamorgan batter Sam Northeast and wicket-keeper batter Chris Cooke scored as manyтАж The post Highest 6th wicket partnership: Highest partnership in first class cricket sixth wicket full list appeared first on The SportsRush.","content":"Highest 6th wicket partnership in first-class cricket: The Glamorgan-duo have made it to the record books on the back of a mammoth stand. During the fourth day of the 39th match of County Championship Division Two 2022 between Leicestershire and Glamorgan in Leicester, Glamorgan batter Sam Northeast and wicket-keeper batter Chris Cooke scored as many as 232 runs in 31 overs in the first session to register a record partnership. Having batted together for close to 40 overs on Day 3, Northeast and Cooke didnтАЩt leave any stone unturned to assault the oppositionтАЩs bowling lineup. Resuming from their overnight score of 563/5 with 21 more runs needed to draw level with LeicestershireтАЩs first innings total, there was literally no stopping the duo today. In what ended up becoming the highest-ever partnership for a Glamorgan pair, Northeast and CookeтАЩs unbeaten 461-run sixth-wicket partnership is the second-highest partnership for this wicket in first-class cricket. 30th highest first-class stand in the history of cricket, it powered the visitors to 795/5d in 160 overs at lunch, Day 4. ! . What an innings. What a partnership. Chris Cooke and Sam Northeast, take a bow! : https://t.co/F3GGp6mm3i #LEIvGLAM | #GoGlam pic.twitter.com/yyUS5D3FCx тАФ Glamorgan Cricket (@GlamCricket) July 23, 2022 Northeast, who had registered a maiden first-class double and triple century yesterday, registered only the 11th quadruple first-class century today. Only the fourth such instance in County Championship, Northeast scored 410* (450) to bring up the ninth-highest individual score in this format. Cooke, on the other hand, missed out on a double century but a ninth first-class century saw him contributing with an attacking 191* (227) at Grace Road, Leicester.","pubDate":"2022-07-23 14:50:30","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"English cricketer enters exclusive club by hitting 410 runs in single inning","link":"https://www.tribuneindia.com/news/sports/english-cricketer-enters-exclusive-club-by-hitting-410-runs-in-single-inning-415042","keywords":null,"creator":null,"video_url":null,"description":"Leicester, England, July 23 Sam Northeast entered an exclusive group of cricketers to pass 400 runs in a single innings after hitting 410 not out for Glamorgan in an English County Championship match on Saturday. He didn't get a chance to challenge Brian Lara's world-record individual score of 501 тАФ set in 1994 while playing for Warwickshire, also in an English county match тАФ because Glamorgan chose to declare on 795-5 against Leicestershire. Northeast, a 32-year-old right-handed batter, hit 45 fours and three sixes in his 450-ball knock. It is the highest individual score this century in elite-level cricket, surpassing Lara's test-record 400 not out for West Indies against England in 2004, and the ninth highest of all time. Only eight players had previously ever made 400 or more in first-class cricket. Like Lara, Australian batter Bill Ponsford passed the 400 mark on two occasions, when playing for the state of Victoria in the 1920s. Northeast's knock was the fourth 400-plus score in the English county game, after Lara, Archie MacLaren (424) in 1895 and Graeme Hick (405) in 1988. AP","content":"Leicester, England, July 23 Sam Northeast entered an exclusive group of cricketers to pass 400 runs in a single innings after hitting 410 not out for Glamorgan in an English County Championship match on Saturday. He didnтАЩt get a chance to challenge Brian LaraтАЩs world-record individual score of 501 тАФ set in 1994 while playing for Warwickshire, also in an English county match тАФ because Glamorgan chose to declare on 795-5 against Leicestershire. Northeast, a 32-year-old right-handed batter, hit 45 fours and three sixes in his 450-ball knock. It is the highest individual score this century in elite-level cricket, surpassing LaraтАЩs test-record 400 not out for West Indies against England in 2004, and the ninth highest of all time. Only eight players had previously ever made 400 or more in first-class cricket. Like Lara, Australian batter Bill Ponsford passed the 400 mark on two occasions, when playing for the state of Victoria in the 1920s. NortheastтАЩs knock was the fourth 400-plus score in the English county game, after Lara, Archie MacLaren (424) in 1895 and Graeme Hick (405) in 1988. AP","pubDate":"2022-07-23 14:37:59","image_url":"https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/7/2022_7$largeimg_510713623.jpg","source_id":"tribuneindia","country":["india"],"category":["sports"],"language":"english"},{"title":"Keep Test cricket to top six teams; respect quality over quantity: Ravi Shastri","link":"https://www.sentinelassam.com/sports/cricket/keep-test-cricket-to-top-six-teams-respect-quality-over-quantity-ravi-shastri-604103","keywords":["Sports,Cricket"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"\"You cannot have 12 teams or ten teams. You keep the top six, keep the quality and respect quality over quantity,\" Ravi Shastri said.","content":"Manchester: Former India head coach Ravi Shastri stated that Test cricket should be restricted to only the top six teams in the format. Shastri, who is currently working in the United Kingdom for Sky Sports as a member of their commentary team, further said that emphasis has to be put on white-ball cricket and that it can be used to spread the game all over the world, citing the football model. \"You cannot have 12 teams or ten teams. You keep the top six, keep the quality and respect quality over quantity. That's the only way you open a window for other cricket to be played. Expand teams in one-day cricket and T20 cricket if you want the game to spread. But Test cricket will have to reduce the number of teams that play.\" \"The bottom line, it's the football model. You've got the EPL, La Liga, the German league, the South America Copa America. In the future it's going to be like that, you'll have one World Cup, the big one and then the rest of it will be all different leagues happening around the world,\" said Shastri. Adding to the way he wants the Test format, Shastri insisted that the format wouldn't be limited to only six sides, but teams will have to qualify for being part of the top six to be able to play the format. As per current rankings, the top six ranked teams in Test cricket are Australia, India, South Africa, England, New Zealand and Pakistan. As per Shastri's proposal, teams such as West Indies, Bangladesh, Zimbabwe and Sri Lanka would miss out on playing Tests, so as do Afghanistan and Ireland, which aren't on the Test rankings yet. \"Whether it's India, Australia, or England you have to qualify for red-ball series if you want to be around to play Test match cricket. Then it doesn't matter if England doesn't go to the West Indies, or West Indies come to England. If they're in the top six, they play, but if they're not in the top six they don't play.\" In complete contrast to Shastri's views, West Indies beat England 1-0 in a three-match series in March while Sri Lanka recently drew their two-match Test series against Australia 1-1. When asked if he would be pleased with keeping Test cricket to just six teams, Shastri, the former India all-rounder, replied in the affirmative. Also read: India will aim for gold at CWG, not just a podium finish: Smriti Mandhana Also watch:","pubDate":"2022-07-23 14:21:59","image_url":"https://assets.sentinelassam.com/h-upload/2022/07/23/367760-ravi-shashtri.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"Commonwealth Games 2022 рдореЗрдВ рдбреЗрдмреНрдпреВ рдкрд░ рд╣рд░рдордирдкреНрд░реАрдд рдХреМрд░ рдиреЗ рджреА рдкреНрд░рддрд┐рдХреНрд░рд┐рдпрд╛, Team India рдХреЛ рд▓реЗрдХрд░ рдХрд╣реА рдпрд╣ рдмрд╛рдд","link":"https://www.abplive.com/sports/cricket/harmanpreet-kaur-says-about-debut-in-commonwealth-games-2022-indian-women-team-2174957","keywords":null,"creator":["ABP Live"],"video_url":null,"description":"<p style=\"text-align: justify;\"><strong>Harmanpreet Kaur Team India Commonwealth Games:</strong> рдХреЙрдордиреЗрд╡реЗрд▓реНрде рдЧреЗрдореНрд╕ 2022 рдореЗрдВ рдорд╣рд┐рд▓рд╛ рдХреНрд░рд┐рдХреЗрдЯ рдХреЛ рднреА рд╢рд╛рдорд┐рд▓ рдХрд┐рдпрд╛ рдЧрдпрд╛ рд╣реИ. рдЯреВрд░реНрдирд╛рдореЗрдВрдЯ рдореЗрдВ рдкрд╣рд▓рд╛ рдореБрдХрд╛рдмрд▓рд╛ рдСрд╕реНрдЯреНрд░реЗрд▓рд┐рдпрд╛ рдФрд░ рднрд╛рд░рдд рдХреА рдорд╣рд┐рд▓рд╛ рдЯреАрдореЛрдВ рдХреЗ рдмреАрдЪ 29 рдЬреБрд▓рд╛рдИ рдХреЛ рдЦреЗрд▓рд╛ рдЬрд╛рдирд╛ рд╣реИ. рдЗрд╕ рдореИрдЪ рд╕реЗ рдкрд╣рд▓реЗ рднрд╛рд░рддреАрдп рдорд╣рд┐рд▓рд╛ рдЯреАрдо рдХреА рдХрдкреНрддрд╛рди рд╣рд░рдордирдкреНрд░реАрдд рдХреМрд░ рдиреЗ рдкреНрд░рддрд┐рдХреНрд░рд┐рдпрд╛ рджреА рд╣реИ. рдЙрдиреНрд╣реЛрдВрдиреЗ рдмрддрд╛рдпрд╛ рдХрд┐ рд╡реЗ рдХреЙрдордирд╡реЗрд▓реНрде рдЧреЗрдореНрд╕ рдореЗрдВ рдбреЗрдмреНрдпреВ рдХреЛ рд▓реЗрдХрд░ рдЙрддреНрд╕рд╛рд╣рд┐рдд рд╣реИрдВ. рдпрд╣ рдкрд╣рд▓реА рдмрд╛рд░ рд╣реИ рдЬрдм рдорд╣рд┐рд▓рд╛ рдХреНрд░рд┐рдХреЗрдЯ рдХреЛ рд░рд╛рд╖реНрдЯреНрд░рдордВрдбрд▓ рдЦреЗрд▓реЛрдВ рдореЗрдВ рдЬрдЧрд╣ рджреА рдЧрдИ рд╣реИ.</p> <p style=\"text-align: justify;\">рд╣рд░рдордирдкреНрд░реАрдд рдиреЗ рд╢рдирд┐рд╡рд╛рд░ рдХреЛ рдмрд░реНрдорд┐рдВрдШрдо рдЬрд╛рдиреЗ рд╕реЗ рдкрд╣рд▓реЗ рдХрд╣рд╛, &lsquo;&lsquo;рдпрд╣ рдЯреВрд░реНрдирд╛рдореЗрдВрдЯ рд╣рдорд╛рд░реЗ рд▓рд┐рдП рдмрд╣реБрдд рдорд╣рддреНрд╡рдкреВрд░реНрдг рд╣реИ. рдЗрд╕ рдмрд╛рд░ рд╣рдо рдореЗрдбрд▓ рдХреЗ рд▓рд┐рдП рдЦреЗрд▓ рд░рд╣реЗ рд╣реИрдВ. рдЕрдЧрд░ рдореИрдВ рдЦреБрдж рдХреЗ рдмрд╛рд░реЗ рдореЗрдВ рдмрд╛рдд рдХрд░реВрдВ рддреЛ рд╣рдо рдЗрд╕ рддрд░рд╣ рдХреЗ рдЯреВрд░реНрдирд╛рдореЗрдВрдЯ рджреЗрдЦрддреЗ рд╣реБрдП рдмрдбрд╝реЗ рд╣реБрдП рд╣реИрдВ рдФрд░ рд╣рдо рдЦреБрд╢ рд╣реИрдВ рдХрд┐ рд╣рдореЗрдВ рднреА рдПрдХ рдореМрдХрд╛ рдорд┐рд▓ рд░рд╣рд╛ рд╣реИ, рд╣рдо рднреА рдЗрд╕ рдмрдбрд╝реА рдкреНрд░рддрд┐рдпреЛрдЧрд┐рддрд╛ рдХрд╛ рд╣рд┐рд╕реНрд╕рд╛ рд╣реЛрдВрдЧреЗ.&rsquo;&rsquo;</p> <p style=\"text-align: justify;\">рдЙрдиреНрд╣реЛрдВрдиреЗ рдХрд╣рд╛, &lsquo;&lsquo;рдореБрдЭреЗ рд▓рдЧрддрд╛ рд╣реИ рдХрд┐ рдЕрдЧрд░ рд╣рдореЗрдВ рдЗрд╕ рддрд░рд╣ рдХреЗ рдореМрдХреЗ рдорд┐рд▓рддреЗ рд░рд╣реЗ рддреЛ рдпрд╣ рднрд╡рд┐рд╖реНрдп рдореЗрдВ рд╣рдорд╛рд░реЗ рд▓рд┐рдпреЗ рд╢рд╛рдирджрд╛рд░ рд╣реЛрдЧрд╛.&rsquo;&rsquo;</p> <p style=\"text-align: justify;\">рд╣рд░рдордирдкреНрд░реАрдд рдЗрд╕рд╕реЗ рдкрд╣рд▓реЗ рд╡рд┐рд╢реНрд╡ рдХрдк рдореЗрдВ рдЦреЗрд▓ рдЪреБрдХреА рд╣реИрдВ рдФрд░ рд╡рд╣ рдЗрд╕ рдЕрд▓рдЧ рддрд░рд╣ рдХреЗ рдЕрдиреБрднрд╡ рдХреЗ рд▓рд┐рдпреЗ рддреИрдпрд╛рд░ рд╣реИрдВ. рдЙрдиреНрд╣реЛрдВрдиреЗ рдХрд╣рд╛, &lsquo;&lsquo;рдЕрдм рдЗрд╕ рдкреНрд░рддрд┐рдпреЛрдЧрд┐рддрд╛ рдореЗрдВ рд╕рд┐рд░реНрдл рдХреНрд░рд┐рдХреЗрдЯ рдкрд░ рд╣реА рдЪрд░реНрдЪрд╛ рдирд╣реАрдВ рд╣реЛрдЧреА рдмрд▓реНрдХрд┐ рдЕрдиреНрдп (рд╕реНрдкрд░реНрдзрд╛ рдХреА) рдЯреАрдореЛрдВ рдкрд░ рднреА рд╣реЛрдЧреА рдФрд░ рд╣рдо рдЙрдирдХреЗ рд▓рд┐рдП &lsquo;рдЪреАрдпрд░&rsquo; рдХрд░реЗрдВрдЧреЗ. рд╣рдо рдкреНрд░рддреНрдпреЗрдХ рдкрджрдХ рдХрд╛ рдЬрд╢реНрди рдордирд╛рдирд╛ рдЪрд╛рд╣рддреЗ рд╣реИрдВ. рдпрд╣ рдЕрдиреБрднрд╡ рд╣рдорд╛рд░реЗ рд▓рд┐рдпреЗ рдкреВрд░реА рддрд░рд╣ рд╕реЗ рдЕрд▓рдЧ рд╣реЛрдЧрд╛, рдЬрд┐рд╕рд╕реЗ рд╣рдо рдмрд╣реБрдд рдЙрддреНрд╕рд╛рд╣рд┐рдд рд╣реИрдВ. &rsquo;&rsquo;</p> <p style=\"text-align: justify;\">рднрд╛рд░рдд рдХреЛ рдЧреНрд░реБрдк рдП рдореЗрдВ рдЪрд┐рд░ рдкреНрд░рддрд┐рджреНрд╡рдВрджреНрд╡реА рдкрд╛рдХрд┐рд╕реНрддрд╛рди, рдСрд╕реНрдЯреНрд░реЗрд▓рд┐рдпрд╛ рдФрд░ рдмрд╛рд░рдмрд╛рдбреЛрд╕ рдХреЗ рд╕рд╛рде рд░рдЦрд╛ рдЧрдпрд╛ рд╣реИ. рднрд╛рд░рддреАрдп рдЯреАрдо рдЕрдкрдирд╛ рдЕрднрд┐рдпрд╛рди 29 рдЬреБрд▓рд╛рдИ рдХреЛ рдСрд╕реНрдЯреНрд░реЗрд▓рд┐рдпрд╛ рдХреЗ рдЦрд┐рд▓рд╛рдл рд╢реБрд░реВ рдХрд░реЗрдЧреА.</p> <blockquote class=\"twitter-tweet\"> <p dir=\"ltr\" lang=\"en\"><a href=\"https://twitter.com/hashtag/TeamIndia?src=hash&amp;ref_src=twsrc%5Etfw\">#TeamIndia</a> captain <a href=\"https://twitter.com/ImHarmanpreet?ref_src=twsrc%5Etfw\">@ImHarmanpreet</a> speaks about the excitement to play in the <a href=\"https://twitter.com/birminghamcg22?ref_src=twsrc%5Etfw\">@birminghamcg22</a> Commonwealth Games ЁЯСН <a href=\"https://twitter.com/hashtag/B2022?src=hash&amp;ref_src=twsrc%5Etfw\">#B2022</a> <a href=\"https://t.co/uOVnsKmwwU\">pic.twitter.com/uOVnsKmwwU</a></p> &mdash; BCCI Women (@BCCIWomen) <a href=\"https://twitter.com/BCCIWomen/status/1550822408600203265?ref_src=twsrc%5Etfw\">July 23, 2022</a></blockquote> <p> <script src=\"https://platform.twitter.com/widgets.js\" async=\"\" charset=\"utf-8\"></script> </p> <p style=\"text-align: justify;\"><strong>рдпрд╣ рднреА рдкрдврд╝реЗрдВ : <a href=\"https://www.abplive.com/sports/cricket/shreyas-iyer-says-about-dance-during-first-odi-against-west-indies-mohammed-siraj-2174881\">IND vs WI: Shreyas Iyer рдиреЗ рдмрддрд╛рдпрд╛ рдореИрджрд╛рди рдкрд░ рдХреНрдпреЛрдВ рдХрд░рдиреЗ рд▓рдЧреЗ рдереЗ рдбрд╛рдВрд╕, рд╡реАрдбрд┐рдпреЛ рдореЗрдВ рд╕рд┐рд░рд╛рдЬ рдиреЗ рдмрддрд╛рдпрд╛ рдореИрдЪ рдХрд╛ рдЦрд╛рд╕ рдкреНрд▓рд╛рди</a></strong></p> <p style=\"text-align: justify;\"><a href=\"https://www.abplive.com/sports/cricket/ajay-jadeja-said-shikhar-dhawan-is-not-part-of-rohit-sharma-aggressive-team-india-ind-vs-wi-2174789\"><strong>Rohit Sharma рдХреА рдХрдкреНрддрд╛рдиреА рд╡рд╛рд▓реА рдЯреАрдо рдореЗрдВ рдлрд┐рдЯ рдирд╣реАрдВ рдмреИрдарддреЗ рдзрд╡рди? рдЕрдЬрдп рдЬрдбреЗрдЬрд╛ рдиреЗ рдмрддрд╛рдпрд╛ рдмрдбрд╝рд╛ рдХрд╛рд░рдг</strong></a></p>","content":null,"pubDate":"2022-07-23 14:12:59","image_url":null,"source_id":"abplive","country":["india"],"category":["sports"],"language":"hindi"},{"title":"Who needs one-day cricket?","link":"https://sportstar.thehindu.com/your-opinion/odi-cricket-wasim-akram-icc-t20-world-cup-test/article65674722.ece","keywords":null,"creator":["\n        Anindya Dutta  \n    "],"video_url":null,"description":"Squeezed between adrenaline-induced entertainment of the T20 format and the strategic machinations of the five-day format, ODI cricket is past its sell-by date.","content":"Three hundred sixty-five matches. 505 wickets. An average of 23.53 runs per stick. If Wasim Akram thought his staggering numbers were enough to express an opinion on the 50-over format of the sport, he now knows he was dead wrong. He has been hung, drawn and quartered this week on social media for having the temerity to suggest the ICC (International Cricket Council) scraps One-Day Internationals (ODIs) as they have outlived their usefulness. His exact words in response to the existential question on the format were, тАЬI think so (ODIs should be scrapped). In England you have full houses. In India, Pakistan especially, Sri Lanka, Bangladesh, South Africa, one-day cricket, you are not going to fill the stadiums.тАЭ Leaving AkramтАЩs opinion aside for a moment, letтАЩs look at the facts behind that statement. A research piece written by Abhinav Sacheti, Ian Gregory-Smith and David Patona in 2015 tracked ODI attendance between 1980 and 2015 in Australia and England, two nations where percentage stadium attendances in any case far surpass those in other nations, particularly for Test and ODI cricket. Their findings were that there had been a steady deterioration in attendance numbers in Australia across all ODI matches regardless of opposition. In England, the data was skewed by high attendance at matches involving the host and a top team, while matches against lower ranked sides were poorly attended. They concluded the paper with a warning that with the rising popularity of T20s, the authorities needed to do something different if they wanted ODIs to survive. In 2018, a Sydney Morning Herald report on attendance during the season talked about the declining numbers in the ODI series against South Africa, which had gone from 24,342 to 17,680 and 5,500 over the course of a week or so. It concluded with a telling comment, тАЬOne-day internationals, predominantly outside of the World Cup, have long lost the lustre they once had.тАЭ Seven years after the research report, the shortest format has skyrocketed in popularity beyond anything we could have envisaged then. The recent action of Cricket South Africa (CSA) in effectively jeopardising its chance of qualifying for the 2023 ODI World Cup by cancelling a bilateral series in Australia that could have gained it vital points, in order to support its new T20 domestic league , is proof positive that the warning of the authors of the 2015 paper and the conclusion in the 2018 Sydney Morning Herald article, have come to roost. One can indeed argue that cricket today is тАШconsumedтАЩ differently and online streaming and television numbers are more meaningful than bums filling stadium seats. A comparison between the two most recent World Cups across different formats - events that attract far more interest than bilateral matches - shows that the trend is not different. The previous T20 World Cup (2021) gathered 167 million television viewers over 112 billion telecast minutes. Video views over all digital channels numbered a staggering 4.3 billion. The 2019 ODI World Cup, the most watched in history thanks to the meteoric rise of digital media over the past few years, gathered 101 million television viewers and 3.6 billion digital channel hits. AkramтАЩs next comment in justification of his opinion is equally deserving of discussion rather than the derision it has drawn. тАЬThey are doing it just for the sake of doing it. After the first 10 overs, itтАЩs just тАШOK, just go [at] a run-a-ball, get a boundary, four fielders in and you get to 200, 220 in 40 overs and then have a go in the last 10 overs. Another 100. ItтАЩs kind of run-of-the-millтАЩ.тАЭ If there is something incorrect about that statement, I havenтАЩt noticed it yet. A few years ago I was in Sydney on work straddling a weekend. Over dinner that Friday night with my mentor and friend, veteran cricket writer Kersi Meher-Homji, I realised that the seasonтАЩs first ODI traditionally played between Australia and New Zealand was slated for Sunday. Kersi and I arranged to meet that morning outside the SCG (Sydney Cricket Ground) before he proceeded to the press box and I to my designated seat. I would be lying if I said my most vivid memories of that match are Aaron FinchтАЩs hard-hitting ton or Trent BoultтАЩs wickets. Both happened, but what sticks in my mind is the sheer boredom of sitting on my prime seat above the sight screen watching mechanical, non-attractive cricket between the 20th and 40th overs in both innings. As a lover of the sport, brought up on the miracle at LordтАЩs in 1983 and the 1985 Melbourne magic of Laxman Sivaramakrishnan and Ravi Shastri, this was an alien experience. It was the first time that it struck me how meaningless ODI cricket had become. Squeezed between adrenaline-induced entertainment of the T20 format and the strategic machinations of the five-day format, one-day cricket, I realized that day in Sydney, was past its sell-by date. In the years since, the evidence has just mounted in support of that view. The just-concluded ODI at Trinidad between West Indies and India (on July 22nd) saw both teams score at an average of over six runs an over. But to AkramтАЩs point, between overs 20 and 40, neither clocked much more than five. The bizarre concatenation of circumstances that led to the drama of the 2019 World Cup final, is perhaps the exception that proves the rule. As a writer who cares deeply about the history of the sport, I have long been convinced that the continued existence of Test cricket, whose imminent demise has been predicted for over a hundred years, is critical. Along with First-Class cricket, which is its feeder, Test cricket is the bedrock of producing technically competent cricketers. As important are the strategic lessons and resilience it demands from players. The recent resurgence in interest in the format even beyond Australia and England augurs well for the sport in general. The fact that Test cricket attracts spectator interest only when the top five to six teams in the world play each other should be no deterrent. There is in fact no logical reason why every team should play every format. I would argue that the sport can grow faster by propagating the T20 version among new cricketing nations given that cricket is competing for a slice of the overall global sporting audience. There is in fact absolute complementarity in this dual approach of preserving the purity and long-term benefits of Test cricket with the commercial benefits of T20. What it does is leave one-day cricket, at least the bilateral matches in the format, falling between the cracks. But that arguably is merely a stage in the evolution of the sport. The question is whether something can be done to turn around the format to bring interest back. As Charles Darwin, the father of the Theory of Evolution once reminded us, тАЬIt is not the strongest of the species that survives, nor the most intelligent that survives. It is the one that is most adaptable to change.тАЭ Only time will tell how the ODI fares in the evolution of the species that is cricket. In the meantime, perhaps we should think twice before dismissing the views of one of the greatest to have ever played the format. Read more stories on Your Opinion.","pubDate":"2022-07-23 14:05:37","image_url":null,"source_id":"sportstar","country":["india"],"category":["sports"],"language":"english"},{"title":"Sam Northeast of Glamorgan emulates Brian Lara to score 400 runs in an innings in first-class cricket","link":"https://www.indiatoday.in/sports/cricket/story/sam-northeast-of-glamorgan-emulates-brian-lara-to-score-400-runs-in-an-innings-in-first-class-cricket-1979143-2022-07-23?utm_source=rss","keywords":null,"creator":null,"video_url":null,"description":"Sam Northeast emulates Brian Lara to score 400 runs in an innings in first-class cricket","content":null,"pubDate":"2022-07-23 13:54:35","image_url":null,"source_id":"indiatoday","country":["india"],"category":["sports"],"language":"english"},{"title":"Dutch cricketers qualify for T20 World Cup in Australia","link":"https://www.dutchnews.nl/news/2022/07/dutch-cricketers-qualify-for-t20-world-cup-in-australia/","keywords":["Sport"],"creator":["robin"],"video_url":null,"description":"The NetherlandsтАЩ menтАЩs cricket team booked their berth at the T20 World Cup in Australia in October this year by...","content":"Photo: KNCB.nl The NetherlandsтАЩ menтАЩs cricket team booked their berth at the T20 World Cup in Australia in October this year by finishing as the runners-up at the T20 World Cup qualifier B held in Zimbabwe last week. The Dutch complete a group which includes the United Arab Emirates, whom they take on on October 16, Namibia and Sri Lanka, the two sides that defeated Oranje at last yearтАЩs World Cup, with the final game on October 20. Only the top two sides from the group go through to the Super 12s. At the qualifiers, the Dutch were drawn alongside Papua New Guinea, Uganda and Hong Kong in Group B and finished unbeaten to take on the United States of America, who finished second in Group A, in the semi-final. Having beaten them by a comfortable margin of seven wickets, the win ensured their fifth World Cup appearance but could not retain the title, losing to Zimbabwe in the final. To punch in their ticket to Australia, the bowlers ran the show while the batters played their best hits. Logan van Beek, who finished as the leading wicket-taker in the tournament with 11 wickets in four matches, picked up his first T20 hat trick against Hong Kong and Fred Klaassen produced his career-best haul of 5/19 against Uganda. While ZimbabweтАЩs Sikandar Raza was declared the player-of-the-tournament, for his 228 runs and five wickets, there was a lingering feeling that Bas de Leede, the Dutch all-rounder, who came of age with nine wickets and a career-best 91* against the USA, narrowly missed out on the award for his all-round contributions. In the first game against Papua New Guinea itself, de Leede gave a glimpse of what was to come with an anchoring 27-ball 33 and two wickets with the ball after openers Max OтАЩDowd (32) and Stephan Myburgh (39) helped the Dutch get off to a rapid start to post 163-7. In response, the bowlers closed out the game in convincing fashion to bowl out PNG for 111. Two out of two The bowlers shone once again, hitting unplayable hard lengths for the Hong Kong batters, to make it two wins out of two. Logan van Beek returned figures of 4-27, which featured a hattrick, to bowl out their Asian counterparts for 116 before OтАЩDowd (45) and de Leede (36) knocked off the target with 40 balls and seven wickets to spare. In their last league phase game against Uganda, the Dutch registered their second-highest win margin of 97 runs as they restricted their opponents to 90-9 after posting an imposing total of 187-3, courtesy a 121-run partnership between OтАЩDowd (73) and Tom Cooper (81*). Klaassen, then, reduced Uganda to 22-5 with his maiden T20 five-for. In the semi-final against USA, de Leede struck an unbeaten 67-ball 91, a knock that featured nine boundaries and three sixes, to quash the American dream after the bowlers had bowled them out for 138. Paul van Meekeren and de Leede took two wickets apiece after effecting four run-outs in USAтАЩs innings to continue their unbeaten run and qualify for this yearтАЩs World Cup. No dream It wasnтАЩt quite a dream finish for the Dutch as they failed to defend their title losing the final against Zimbabwe as they crumbled to a 37-run loss. The hosts were bowled out for 132 on a slow, weary pitch in a spirited bowling effort from the Dutch spearheaded by van BeekтАЩs 3-18 but Sikandar Raza, the Zimbabwean off-spinner, scythed through the Dutch middle-order to restrict them to 95. ЁЯЧЮя╕П | Zimbabwe beats Netherlands in T20 World Cup Qualifier final. Read our recap тмЗя╕П https://t.co/yeBxPLMI8F #T20WCQualifier #T20WorldCup #ZIMvNED #CricketNL тАФ CricketЁЯППNetherlands (@KNCBcricket) July 17, 2022 тАШWe got what we came here for in qualifying for the World Cup, itтАЩs just a little bit disappointing that we couldnтАЩt perform in the final,тАЩ Netherlands captain Scott Edwards said. тАШReally proud of the way the boys went about it, couldnтАЩt have asked for more. Each group (at the World Cup) has its challenges so weтАЩll prepare for Australia and the teams we are playing against and see how we go.тАЩ Summer of cricket The qualification was especially significant given that the Dutch had not played a single T20I since their premature World Cup exit after three successive losses in the UAE but were battle-hardened after One-Day Internationals against full members like New Zealand, West Indies and England lately. For van Beek, it was a тАШnice reward after a tough two-month toil against the bigger nationsтАЩ. The NetherlandsтАЩ summer of cricket continues with two T20Is against New Zealand in The Hague on August 4th and 5th with three ODIs against Pakistan to follow in Rotterdam from August 16 to 21. Head coach Ryan Campbell is expected to return to coaching after his recovery from a heart attack. Thank you for donating to DutchNews.nl The DutchNews.nl team would like to thank all the generous readers who have made a donation in recent weeks. Your financial support has helped us to expand our coverage of the coronavirus crisis into the evenings and weekends and make sure you are kept up to date with the latest developments. DutchNews.nl has been free for 14 years, but without the financial backing of our readers, we would not be able to provide you with fair and accurate news and features about all things Dutch. Your contributions make this possible. If you have not yet made a donation, but would like to, you can do so via Ideal, credit card or Paypal.","pubDate":"2022-07-23 13:23:17","image_url":null,"source_id":"dutchnews","country":["netherland"],"category":["sports"],"language":"english"},{"title":"IND vs WI: Shreyas Iyer рдиреЗ рдмрддрд╛рдпрд╛ рдореИрджрд╛рди рдкрд░ рдХреНрдпреЛрдВ рдХрд░рдиреЗ рд▓рдЧреЗ рдереЗ рдбрд╛рдВрд╕, рд╡реАрдбрд┐рдпреЛ рдореЗрдВ рд╕рд┐рд░рд╛рдЬ рдиреЗ рдмрддрд╛рдпрд╛ рдореИрдЪ рдХрд╛ рдЦрд╛рд╕ рдкреНрд▓рд╛рди","link":"https://www.abplive.com/sports/cricket/shreyas-iyer-says-about-dance-during-first-odi-against-west-indies-mohammed-siraj-2174881","keywords":null,"creator":["ABP Live"],"video_url":null,"description":"<p style=\"text-align: justify;\"><strong>Mohammed Siraj Shreyas Iyer Video West Indies vs India 1st ODI: </strong>рдЯреАрдо рдЗрдВрдбрд┐рдпрд╛ рдиреЗ рд╡реЗрд╕реНрдЯрдЗрдВрдбреАрдЬ рдХреЛ рд╡рдирдбреЗ рд╕реАрд░реАрдЬ рдХреЗ рдкрд╣рд▓реЗ рдореИрдЪ рдореЗрдВ 3 рд░рдиреЛрдВ рд╕реЗ рд╣рд░рд╛ рджрд┐рдпрд╛. рдЗрд╕ рдореБрдХрд╛рдмрд▓реЗ рдХреЗ рджреМрд░рд╛рди рд╢реНрд░реЗрдпрд╕ рдЕрдпреНрдпрд░ рдХрд╛ рдПрдХ рджрд┐рд▓рдЪрд╕реНрдк рдЕрдВрджрд╛рдЬ рджреЗрдЦрдиреЗ рдХреЛ рдорд┐рд▓рд╛. рдЕрдпреНрдпрд░ рдореИрджрд╛рди рдкрд░ рдХреИрдЪ рд▓реЗрдиреЗ рдХреЗ рдмрд╛рдж рдбрд╛рдВрд╕ рдХрд░рдиреЗ рд▓рдЧреЗ. рдЙрдиреНрд╣реЛрдВрдиреЗ рдЗрд╕ рдбрд╛рдВрд╕ рдХреЛ рд▓реЗрдХрд░ рджрд┐рд▓рдЪрд╕реНрдк рдЦреБрд▓рд╛рд╕рд╛ рдХрд┐рдпрд╛ рд╣реИ. рджреВрд╕рд░реА рдУрд░ рдореЛрд╣рдореНрдордж рд╕рд┐рд░рд╛рдЬ рдиреЗ рдЕрдкрдиреА рдмреЙрд▓рд┐рдВрдЧ рдХреЛ рд▓реЗрдХрд░ рдкреНрд░рддрд┐рдХреНрд░рд┐рдпрд╛ рджреА рд╣реИ. рдЙрдиреНрд╣реЛрдВрдиреЗ рдмрддрд╛рдпрд╛ рдХрд┐ рд╡реЗрд╕реНрдЯрдЗрдВрдбреАрдЬ рдХреЗ рдЦрд┐рд▓рд╛рдл рдХрд┐рд╕ рдкреНрд▓рд╛рди рд╕реЗ рдмреЙрд▓рд┐рдВрдЧ рдХрд░ рд░рд╣реЗ рдереЗ.</p> <p style=\"text-align: justify;\">рдЕрдпреНрдпрд░ рдиреЗ рдмрддрд╛рдпрд╛ рдХрд┐ рд╡реЗрд╕реНрдЯрдЗрдВрдбреАрдЬ рдХреЗ рдлреИрдиреНрд╕ рдЙрдиреНрд╣реЗрдВ рдХреИрдЪ рдЫреЛрдбрд╝рдиреЗ рдХреЗ рд▓рд┐рдП рдХрд╣ рд░рд╣реЗ рдереЗ рдФрд░ рдЪрд┐рдврд╝рд╛ рд░рд╣реЗ рдереЗ. рдЙрдиреНрд╣реЛрдВрдиреЗ рдХреИрдЪ рд▓реЗрдиреЗ рдХреЗ рдмрд╛рдж рдбрд╛рдВрд╕ рдХрд░рдХреЗ рдЗрд╕рдХрд╛ рдЬрд╡рд╛рдм рджрд┐рдпрд╛. рдЕрдпреНрдпрд░ рдиреЗ рд╕рд┐рд░рд╛рдЬ рд╕реЗ рдмрд╛рддрдЪреАрдд рдХреЗ рджреМрд░рд╛рди рдбрд╛рдВрд╕ рдХреЛ рд▓реЗрдХрд░ рдХрд╣рд╛, ''рд╡реЛ рд▓реЛрдЧ рдореБрдЭреЗ рдЪрд┐рдврд╝рд╛ рд░рд╣реЗ рдереЗ. рдХрд╣ рд░рд╣реЗ рдереЗ, рдбреНрд░реЙрдк рдЕ рдХреИрдЪ, рдбреНрд░реЙрдк рдЕ рдХреИрдЪ. рдореЗрд░реЗ рдкрд╛рд╕ рдХреИрдЪ рдЖрдпрд╛ рддреЛ рдореИрдВрдиреЗ рдЙрдирдХреА рддрд░рд╣ рдбрд╛рдВрд╕ рдХрд┐рдпрд╛.''&nbsp;</p> <p style=\"text-align: justify;\">рд╕рд┐рд░рд╛рдЬ рдиреЗ рдЖрдЦрд┐рд░реА рдУрд╡рд░ рдХреЛ рд▓реЗрдХрд░ рдХрд╣рд╛, ''рдореБрдЭреЗ рдпрд╣реА рд▓рдЧ рд░рд╣рд╛ рдерд╛ рдХрд┐ рдореЗрд░рд╛ рдпреЙрд░реНрдХрд░ рдЕрдЪреНрдЫрд╛ рдХрд╛рдо рдХрд░ рд░рд╣рд╛ рд╣реИ. рдЗрд╕рд▓рд┐рдП рдореИрдВ рдЙрд╕реА рдХреЛ рдмреИрдХ рдХрд░ рд░рд╣рд╛ рдерд╛. рдореЗрд░реА рд╣рд░реНрдЯ рдмреАрдЯ рддреЗрдЬ рд╣реЛ рдЧрдИ рдереА. рдореЗрд░рд╛ рдпрд╣реА рдкреНрд▓рд╛рди рдерд╛ рдХрд┐ рд╢реБрд░реБрдЖрддреА рдЪрд╛рд░ рдмреЙрд▓ рдЕрдЪреНрдЫреЗ рдЧрд┐рд░реЗ рддреЛ рдореИрдВ рдЙрд╕реА рдХреЛ рдмреИрдХ рдХрд░рддрд╛ рдЧрдпрд╛. рдореИрдВ рдЖрддреНрдорд╡рд┐рд╢реНрд╡рд╛рд╕ рд╕реЗ рдЧреЗрдВрджрдмрд╛рдЬреА рдХрд░ рд░рд╣рд╛ рдерд╛.''</p> <blockquote class=\"twitter-tweet\"> <p dir=\"ltr\" lang=\"en\">From last-over heroics in the 1st <a href=\"https://twitter.com/hashtag/WIvIND?src=hash&amp;ref_src=twsrc%5Etfw\">#WIvIND</a> ODI courtesy <a href=\"https://twitter.com/mdsirajofficial?ref_src=twsrc%5Etfw\">@mdsirajofficial</a> to rocking some dance moves ft <a href=\"https://twitter.com/ShreyasIyer15?ref_src=twsrc%5Etfw\">@ShreyasIyer15</a>, presenting a fun interview that oozes swag ЁЯШОЁЯШО - by <a href=\"https://twitter.com/28anand?ref_src=twsrc%5Etfw\">@28anand</a><br /><br />Full interview ЁЯСЗ<a href=\"https://t.co/tau2J3GcBh\">https://t.co/tau2J3GcBh</a> <a href=\"https://twitter.com/hashtag/TeamIndia?src=hash&amp;ref_src=twsrc%5Etfw\">#TeamIndia</a> <a href=\"https://t.co/4rou4918Zi\">pic.twitter.com/4rou4918Zi</a></p> &mdash; BCCI (@BCCI) <a href=\"https://twitter.com/BCCI/status/1550822274718404609?ref_src=twsrc%5Etfw\">July 23, 2022</a></blockquote> <p> <script src=\"https://platform.twitter.com/widgets.js\" async=\"\" charset=\"utf-8\"></script> </p> <p style=\"text-align: justify;\"><strong>рдпрд╣ рднреА рдкрдврд╝реЗрдВ : <a href=\"https://www.abplive.com/sports/cricket/shreyas-iyer-danced-towards-the-pavilion-after-catching-west-indies-batsman-shamarh-brooks-goes-viral-on-social-media-2174794\">Watch: рд╢рд╛рдорд░рд╛рд╣ рдмреНрд░реВрдХреНрд╕ рдХрд╛ рдХреИрдЪ рдкрдХрдбрд╝рдиреЗ рдХреЗ рдмрд╛рдж рд╢реНрд░реЗрдпрд╕ рдЕрдпреНрдпрд░ рдиреЗ рдХрд┐рдпрд╛ рдРрд╕рд╛ рдбрд╛рдВрд╕, рд╡реАрдбрд┐рдпреЛ рд╕реЛрд╢рд▓ рдореАрдбрд┐рдпрд╛ рдкрд░ рд╡рд╛рдпрд░рд▓</a></strong></p> <p style=\"text-align: justify;\"><a href=\"https://www.abplive.com/sports/cricket/ajay-jadeja-said-shikhar-dhawan-is-not-part-of-rohit-sharma-aggressive-team-india-ind-vs-wi-2174789\"><strong>Rohit Sharma рдХреА рдХрдкреНрддрд╛рдиреА рд╡рд╛рд▓реА рдЯреАрдо рдореЗрдВ рдлрд┐рдЯ рдирд╣реАрдВ рдмреИрдарддреЗ рдзрд╡рди? рдЕрдЬрдп рдЬрдбреЗрдЬрд╛ рдиреЗ рдмрддрд╛рдпрд╛ рдмрдбрд╝рд╛ рдХрд╛рд░рдг</strong></a></p>","content":null,"pubDate":"2022-07-23 13:05:35","image_url":null,"source_id":"abplive","country":["india"],"category":["sports"],"language":"hindi"},{"title":"India to play against Australia, South Africa ahead of T20 World Cup","link":"https://www.sentinelassam.com/sports/cricket/india-to-play-against-australia-south-africa-ahead-of-t20-world-cup-604084","keywords":["Sports,Cricket"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"The Indian cricket team will feature in a T20I series against Australia from September 20 to 25, followed by a limited-overs series against South Africa.","content":"Mumbai: Ahead of the T20 World Cup,the Indian cricket team will feature in a T20I series against Australia from September 20 to 25, followed by a limited-overs series against South Africa.According to the initial itinerary, Mohali will be hosting the first T20 against Australia, followed by Nagpur on September 23 and Hyderabad on September 25. The three-match T20I series against South Africa will begin in Thiruvananthapuram on September 28, followed by Guwahati on October 1 and Indore on October 3. The ODIs against South Africa will be played in Ranchi, Lucknow and Delhi on October 6, 9, 11. Also read: SA's decision to abandon ODIs against Australia has left cricket at a tipping point: Atherton Also watch:","pubDate":"2022-07-23 12:48:13","image_url":"https://assets.sentinelassam.com/h-upload/2022/07/23/367731-hiou.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"}]}