{"newsArray":[{"title":"Cricket world stunned by 'amazing' Stokes save","link":"https://wwos.nine.com.au/cricket/australia-vs-england-ben-stokes-extraordinary-boundary-save/011cde59-856d-49ea-8dc5-ffa603ad0f75","keywords":null,"creator":["wwos"],"video_url":null,"description":"B﻿en Stokes' effort on the boundary has been described as \"one of the best pieces of fielding I've ever seen.\"","content":"E﻿ngland all-rounder Ben Stokes has pulled off an extraordinary boundary save during his side's narrow victory over Australia in Canberra.Stokes was fielding at long-off when Mitchell Marsh launched a ball from Sam Curran into the outfield. It likely would have gone for six, but Stokes back-peddled to the rope, before throwing up his right hand in a desperate last-ditch attempt to save the ball.He was able to flick the ball back into play in mid-air as he fell over the rope, restricting the Australians to just two runs.READ MORE: 'Hated' Panthers grand final star shreds criticsREAD MORE: Post-match celebration lands team in hot waterREAD MORE: Ricciardo exposes brutal Formula 1 failings\"We all got up out of our seats,\" said Mark Waugh in commentary.\"That was amazing from Ben Stokes to keep it in the field of play.\"\"Outstanding,\" added Adam Gilchrist.\"Modern fielding of the highest quality.\"﻿Daily Mail cricket correspondent, Paul Newman, described it as \"one of the best pieces of fielding I've ever seen.\"https://twitter.com/Paul_NewmanDM/status/1580166346486083587?ref_src=twsrc%5EtfwNewman, however, did admit there will be lingering concerns over Stokes' form with the bat.Batting at number three, Stokes made nine off nine balls in game one in Perth, and seven off 11 balls at number four in Canberra.Stream every Australian men's T20 World Cup match plus selected other matches, including the finals, live and free on 9Now.England has a 2-0 lead in the three match series, having won both matches by the identical margin of eight runs. The third and final match of the series will be played in Canberra on ﻿Friday.Australia and England have also been placed in the same group for the upcoming T20 World Cup, along with New Zealand. Only two teams will progress from that group to the knockout stages.For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here","pubDate":"2022-10-12 23:50:33","image_url":"https://vms-network-images-prod.s3-ap-southeast-2.amazonaws.com/2022/10/460037/pickerimage.jpg","source_id":"nine","country":["australia"],"category":["sports"],"language":"english"},{"title":"Hazlewood: We have enough experience","link":"https://www.cairnspost.com.au/sport/cricket/hazlewood-we-have-enough-experience/video/8e63373778711fdf743e9b641b9f8994","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket: Josh Hazlewood speaks to media after they fell to England in their second T20 match ahead of the upcoming World Cup.","content":null,"pubDate":"2022-10-12 23:45:21","image_url":null,"source_id":"cairnspost","country":["australia"],"category":["sports"],"language":"english"},{"title":"Ben Stokes moment against Australia sends cricket world into meltdown","link":"https://au.sports.yahoo.com/cricket-2022-ben-stokes-extraordinary-fielding-england-t-20-victory-against-australia-205525560.html","keywords":null,"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2022-10-12 20:55:25","image_url":"https://s.yimg.com/os/creatr-uploaded-images/2022-10/a20ade80-4a6f-11ed-aebf-9324e629f485","source_id":"yahoo","country":["australia"],"category":["sports"],"language":"english"},{"title":"Australia v England 2nd T20I highlights","link":"https://www.cairnspost.com.au/sport/cricket/australia-v-england-2nd-t20i-highlights/video/6ac54b1269518b9c3d6c13af652a5767","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket: Australia fell narrowly short once again to England in their three match series as the English now lead 2-0.","content":"Cricket: Australia fell narrowly short once again to England in their three match series as the English now lead 2-0.","pubDate":"2022-10-12 20:36:21","image_url":null,"source_id":"cairnspost","country":["australia"],"category":["sports"],"language":"english"},{"title":"Ganguly left dejected after falling out of favour","link":"https://www.thehansindia.com/sports/cricket/ganguly-left-dejected-after-falling-out-of-favour-765192","keywords":["Sports,Cricket"],"creator":["The Hans India"],"video_url":null,"description":"Former India captain Sourav Ganguly, who is soon going to become a former BCCI president, has fallen out of favour in the board and is reportedly ending his term on a 'disappointing' note.","content":"Sourav Ganguly New Delhi: Former India captain Sourav Ganguly, who is soon going to become a former BCCI president, has fallen out of favour in the board and is reportedly ending his term on a 'disappointing' note. During the upcoming BCCI AGM and elections on October 18, most members of the outgoing administration are set to find places in the new dispensation, barring Ganguly and Jayesh George, the joint secretary. And, Ganguly is definitely not pleased with the developments in the last few days. The former India allrounder Roger Binny on Tuesday filed his nomination for the post of BCCI president and is likely to get elected unopposed since no other candidate has emerged so far as his challenger. As a normal practice, the outgoing BCCI president proposes the name of the upcoming board chief but a dejected Ganguly didn't do the same with Binny. The former cricketer was to himself on Tuesday at the board's office largely, while others were involved in the nomination process, a Cricbuzz report said. \"He clearly looked upset, disappointed and dejected,\" said a member who was present at the BCCI office. The 50-year old was the last one to leave the BCCI office after the nomination process ended, swiftly getting into his car and rolling up the glasses of the window. Outside the BCCI office, there were also murmurs among state representatives about the immediate future of Ganguly. \"Back to Kolkata,\" someone suggested. \"Back to Delhi,\" another chimed in, hinting that he will go back to Delhi Capitals franchise of the IPL, as a director. The report further said that Ganguly was told that his performance did not live up to the expectations although the official reason is that there is no precedent of a president holding two full terms, during an informal meeting among the senior past and current administrators from prominent state associations before the nomination day. Another reason for Ganguly not continuing at the coveted post is that the sponsors of Indian cricket boards were not happy with the cricketer, who endorses rival brands. The matter was often discussed among the members. Overall, the BCCI seems to have moved on from Ganguly which also means he is unlikely to be its candidate for the ICC Chair, the election for which is next month. It has been also learnt that Ganguly was offered the post of IPL chairman. However, the former left-handed batter politely declined the offer. His logic was that he cannot accept becoming head of a sub-committee in the BCCI after heading the same institution.","pubDate":"2022-10-12 18:45:41","image_url":"https://assets.thehansindia.com/h-upload/2022/10/12/500x300_1316122-ganguly.jpg","source_id":"thehansindia","country":["india"],"category":["sports"],"language":"english"},{"title":"IND-W vs TL-W Dream11 Team Prediction, Match Preview, Fantasy Cricket Hints: Captain, Probable Playing 11s, Team News; Injury Updates For Today’s IND-W vs TL-W Women’s Asia Cup 2022 semi-final in Sylhet, 830 AM IST, October 13","link":"https://zeenews.india.com/cricket/ind-w-vs-tl-w-dream11-team-prediction-match-preview-fantasy-cricket-hints-captain-probable-playing-11s-team-news-injury-updates-for-today-s-ind-w-vs-tl-w-women-s-asia-cup-2022-semi-final-in-sylhet-830-am-ist-october-13-2521150.html","keywords":null,"creator":null,"video_url":null,"description":"India women vs Thailand women Dream11 Team Prediction IND-W vs TL-W Women’s Asia Cup 2022 semi-final Match Preview - Check My Dream11 Team, Best players list of IND-W vs TL-W, Thailand women Dream11 Team Player List, India women Dream11 Team Player List, Dream11 Guru Tips, Fantasy Cricket Tips, Fantasy Cricket Tips, Fantasy Playing Tips.","content":null,"pubDate":"2022-10-12 18:13:00","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"Towns aim to return to finals as new Upper Great Southern Cricket Association begins","link":"https://thewest.com.au/news/narrogin-observer/towns-aim-to-return-to-finals-as-new-upper-great-southern-cricket-association-begins-c-8511095","keywords":null,"creator":["Calvin Sims"],"video_url":null,"description":"The 2022-23 season will have will have six teams competing for the premiership after Harrismith dropped down to B-grade.","content":null,"pubDate":"2022-10-12 18:00:00","image_url":"https://images.thewest.com.au/publication/C-8511095/99af89c8ca29c13f6cbebd40a03b84fb49c05a04-16x9-x0y255w4896h2754.jpg","source_id":"thewest","country":["australia"],"category":["sports"],"language":"english"},{"title":"Harrismith drop out of top grade for new Upper Great Southern Cricket Association season","link":"https://thewest.com.au/news/narrogin-observer/harrismith-drop-out-of-top-grade-for-new-upper-great-southern-cricket-association-season--c-8505737","keywords":null,"creator":["Calvin Sims"],"video_url":null,"description":"Harrismith finished bottom of the ladder in last season’s campaign and will play in the B-grade division for the upcoming season.","content":null,"pubDate":"2022-10-12 18:00:00","image_url":"https://images.thewest.com.au/publication/C-8505737/02fcd1ce0664ff9b1d019021d1a255deeb40b390-16x9-x219y611w4746h2669.jpg","source_id":"thewest","country":["australia"],"category":["sports"],"language":"english"},{"title":"Broomehill chasing back-to-back titles as new Great Southern Cricket Association season begins on Saturday","link":"https://thewest.com.au/news/great-southern-herald/broomehill-chasing-back-to-back-titles-as-new-great-southern-cricket-association-season-begins-on-saturday-c-8504653","keywords":null,"creator":["Calvin Sims"],"video_url":null,"description":"Broomehill’s premiership defence begins on Saturday against Kendenup in Kendenup while Wanderers and Australs are set to face off in an exciting Katanning derby.","content":null,"pubDate":"2022-10-12 18:00:00","image_url":"https://images.thewest.com.au/publication/C-8504653/bb813b5451ffaa0421e2d9f554caac88502249c9-16x9-x0y264w4093h2302.jpg","source_id":"thewest","country":["australia"],"category":["sports"],"language":"english"},{"title":"Davis delivers as Golden City beat Veterans in Kalgoorlie-Boulder Cricket Association action","link":"https://thewest.com.au/news/kalgoorlie-miner/davis-delivers-as-golden-city-beat-veterans-in-kalgoorlie-boulder-cricket-association-action-c-8503187","keywords":null,"creator":["Neale Harvey"],"video_url":null,"description":"Opener Jarred Davis lifted Golden City to a first-up win over Veterans in the Kalgoorlie-Boulder Cricket Association’s new season.","content":null,"pubDate":"2022-10-12 18:00:00","image_url":"https://images.thewest.com.au/publication/C-8503187/bb2a1915a87672209f88702f11ca2200cf0374cd-16x9-x0y107w2048h1152.jpg","source_id":"thewest","country":["australia"],"category":["sports"],"language":"english"},{"title":"Weather in Sylhet: Sylhet International Cricket Stadium weather forecast for IND W vs Thailand W Asia Cup 2022 semi final","link":"https://thesportsrush.com/cricket-news-weather-in-sylhet-sylhet-international-cricket-stadium-weather-forecast-for-ind-w-vs-thailand-w-asia-cup-2022-semi-final/","keywords":["Cricket","Asia Cup 2022","India Women","Sylhet International Stadium","Thailand Women"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Weather in Sylhet: The first semi-final of Women’s Asia Cup between India and Thailand will take place in less than 12 hours from now. Knock-out matches, especially as fickle and unpredictable as in the T20 format, should not be discounted in terms of teams’ strength on paper. However, team India will undoubtedly start as the… The post Weather in Sylhet: Sylhet International Cricket Stadium weather forecast for IND W vs Thailand W Asia Cup 2022 semi final appeared first on The SportsRush.","content":"Weather in Sylhet: The first semi-final of Women’s Asia Cup between India and Thailand will take place in less than 12 hours from now. Knock-out matches, especially as fickle and unpredictable as in the T20 format, should not be discounted in terms of teams’ strength on paper. However, team India will undoubtedly start as the sure shot favourites to win the first semi-final of the ongoing Women’s Asia Cup 2022, scheduled to take place on Thursday (October 13), at the Sylhet International Cricket Stadium. Topping the points table with 5 wins out of 6 round-robin league matches, team India looked like facing defending champions Bangladesh in tomorrow’s semi-final clash. However, with the Bangladesh versus UAE match getting washed out due to rain, it were the Thailand women, who managed to make it through to the final-four with 6 points, as against Bangladesh’s 5. Had Bangladesh won their last round-robin match against UAE, they would have made it through to the semi-final with 6 points, owing to a better Net Run Rate (NRR) against Thailand. ALSO READ: India Women vs Thailand Women T20 head to head record It is worth of a mention, that the highlight of Thailand women’s journey so far in the tournament, has been their maiden T20I win against Pakistan a week ago, which helped them go past Bangladesh ultimately. However, having lost against India earlier by 9 wickets after being bowled out on a paltry 37, they will have to come up with something spectacular to make it through to the grand finale. Weather in Sylhet With the match scheduled to take place at 08:30 am (local time), there is in fact a forecast of rain at around 07:00 am, as per Accuweather. However, there is no prediction of further rain from the next hour onwards, cloudy conditions are set to remain a constant throughout the remaining hours of the semi-final. It is worth of a mention that the aforementioned Bangladesh v/s. UAE encounter was washed out with the match scheduled to start early morning at this venue last Tuesday. Having said that, the match is expected to start on time amid overcast conditions tomorrow, iff the expected downpour earlier doesn’t make the outfield wet enough. The post Weather in Sylhet: Sylhet International Cricket Stadium weather forecast for IND W vs Thailand W Asia Cup 2022 semi final appeared first on The SportsRush.","pubDate":"2022-10-12 17:24:59","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"BAN vs PAK Dream11 Team Prediction, Match Preview, Fantasy Cricket Hints: Captain, Probable Playing 11s, Team News; Injury Updates For Today’s BAN vs PAK 6th T20I match in Christchurch, 730 AM IST, October 13","link":"https://zeenews.india.com/cricket/ban-vs-pak-dream11-team-prediction-match-preview-fantasy-cricket-hints-captain-probable-playing-11s-team-news-injury-updates-for-today-s-ban-vs-pak-6th-t20i-match-in-christchurch-730-am-ist-october-13-2521131.html","keywords":null,"creator":null,"video_url":null,"description":"Bangladesh vs Pakistan Dream11 Team Prediction Bangladesh vs Pakistan 6th T20I Match Preview - Check My Dream11 Team, Best players list of BAN vs PAK, Bangladesh Dream11 Team Player List, Pakistan Dream11 Team Player List, Dream11 Guru Tips, Fantasy Cricket Tips, Fantasy Cricket Tips, Fantasy Playing Tips.","content":"Shakib Al Hasan and his Bangladesh team have their task cut out. They take on Pakistan in their final match of the New Zealand T20I tri-series. They have already been knocked out and have no chance of qualifying even if they beat Babar Azam's Pakistan in the upcoming clash. But they would still want to win to at least finish the campaign with a win. In three matches in this series so far, Bangladesh have failed to win even a single match, which sort of statement on their current form. They are failing collectively in all departments and Shakib will need to motivate his guys to step up their game ahead of the all-important ICC T20 World Cup 2022 that kickstarts on October 16 in Australia. On the other hand, Pakistan would like to bounce back after thumping loss vs New Zealand in their last encounter in the same series. It has become a template for Pakistan. When their openers - Babar Azam and Mohammad Rizwan - don't fire, they struggle with the bat. That is exactly what happened in the last match as well with Babar and Rizwan failing and that lead to middle-order getting exposed. Batting first, Pakistan could make only 130/7 in 20 overs. The middle order conundrum continues for Pakistan, which is a big concern for them leading to the T20 World Cup. The captains and coaches meetup _ All smiles in the __ and __ camps ahead of the tri-series opener __ #PAKvBAN | #NZTriSeries pic.twitter.com/X7PYnc1AiF — Pakistan Cricket (@TheRealPCB) October 6, 2022 Shaheen Shah Afridi, the ace pacer who was injured is back for Pakistan but he will fly directly to Australia. He won't make a stop in New Zealand to play the final. However, Afridi will play the two warm-ups right before the World Cup starts. PAK vs BAN Dream11 Team Prediction Captain: Mohammad Rizwan Vice-Captain: Shakib Al Hasan Suggested Playing XI for PAK vs BAN Dream11 Fantasy Cricket: Wicketkeepers: Mohammad Rizwan, Liton Das Batsmen: Babar Azam, Afif Hossain, Nazmul Hossain Shanto All-rounders: Shakib Al Hasan, Shadab Khan, Mohammad Nawaz Bowlers: Mohammad Wasim, Mohammad Saifuddin, Haris Rauf PAK vs BAN Probable Playing XI: Pakistan Probable Playing 11 : Babar Azam (c), Mohammad Rizwan, Shan Masood, Haider Ali, Iftikhar Ahmed, Shadab Khan, Asif Ali, Mohammad Nawaz, Mohammad Wasim, Haris Rauf, Shahnawaz Dahani Bangladesh Probable Playing 11 : Yasir Ali, Nazmul Hossain Shanto, Afif Hossain, M Hossain, Shakib Al Hasan(c), Mehidy Hasan Miraz, Liton Das, Nurul Hasan, Taskin Ahmed, Mohammad Saifuddin, Shoriful Islam","pubDate":"2022-10-12 17:08:00","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"\"Pakistan 'A' Had Beaten India\": Butt On Pak Cricket's Past Infrastructure","link":"https://sports.ndtv.com/cricket/pakistan-a-had-beaten-india-salman-butt-on-pakistans-past-infrastructure-and-the-current-fall-3426324","keywords":["Cricket"],"creator":["NDTV"],"video_url":null,"description":"Salman Butt questioned Pakistan's current infrastructure, adding that the lack of One-Day and Four-Day cricket has been the Achilles heel behind the downfall.","content":"Pakistan's middle-order has been under the scanner since the start of the Asia Cup last month. Apart from openers, Babar Azam and Mohammad Rizwan, other Pakistan batters have struggled to find consistency in their game. With the T20 World Cup set to kick-off in less than a week's time, several current and former Pakistan players have suggested that the team might struggle to win games, especially with the middle-order misfiring. Speaking of the middle order, former Pakistan captain feels the management doesn't have much to explore. Butt recalled the time when Pakistan 'A' defeated India in a tour game back in 2004. \"I remember India came to Pakistan in 2004. They played against Pakistan 'A' in a warm-up match. And Pakistan 'A' had actually beaten India. Imran Nazir scored good runs, the match took place at the Gaddafi Stadium. It was a high-scoring game. Do you have a setup to prepare a team like that now?\" Butt said on his official YouTube channel. Butt further questioned Pakistan's current infrastructure, adding that the lack of One-Day and Four-Day cricket has been the Achilles heel behind the downfall. Promoted \"It used to be there. I have gone to South Africa with the 'A' teams. Even U19 tours used to take place. Now there are none. Who is to blame? What have you brought to the system? There's a lot to answer, but no one wants to answer,\" Butt said. Notably, India had toured Pakistan in 2004 to play five ODIs and three Tests. After losing the tour game by 6 wickets, India won the ODI series 3-2, before also clinching the Test series 2-1.","pubDate":"2022-10-12 16:27:17","image_url":"https://c.ndtvimg.com/2019-02/i4q22r48_salman-butt-pti_625x300_20_February_19.jpg?im=FaceCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"“Firm favourites”: Herschelle Gibbs considers England favourites to win T20 World Cup 2022 after defeating Australia in T20I series","link":"https://thesportsrush.com/cricket-news-firm-favourites-herschelle-gibbs-considers-england-favourites-to-win-t20-world-cup-2022-after-defeating-australia-in-t20i-series/","keywords":["Cricket","herschelle gibbs","T20 World Cup 2022"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Herschelle Gibbs considers England favourites to lift the imminent T20 World Cup after a successful triumph against Australia in T20 series. England’s men Cricket side have defeated a full-strength Australia by 8 runs during the second T20I at the second T20I at the Manuka Oval, in Canberra. Placed in a spot of bother after losing… The post “Firm favourites”: Herschelle Gibbs considers England favourites to win T20 World Cup 2022 after defeating Australia in T20I series appeared first on The SportsRush.","content":"England’s men Cricket side have defeated a full-strength Australia by 8 runs during the second T20I at the second T20I at the Manuka Oval, in Canberra. Placed in a spot of bother after losing their top-4 in the batting order within nine Overs of the first innings, the pair of in-form David Malan (82 off 49) and Moeen Ali (44 off 27), came to their side’s rescue, to ultimately post a respectable 178/7 in their 20 Overs. Impressive spells from the English bowling attack led by Sam Curran (4-0-25-3), made sure that they successfully managed to defend their team total for the second consecutive game, in front of a strong Aussie batting unit. Former South African aggressive batter Herschelle Gibbs, took to his social media handle to term England as the favourites to lift this year’s T20 World Cup, looking at their present form in Australia. Gibbs had, nearly a month ago, stated that it might turn out to be an this time around, with quite a few contendors to lift the all-important silverware of the shortest format. The 48-year-old did mention the same as well, while terming the Jos Buttler-led team as the side to beat in imminent month-long tournament. I did say it’s very much an open but Englands form in oz make them firm favourites.. — Herschelle Gibbs (@hershybru) The England squad will be further strengthened by the return back of the likes of Liam Livingstone and Chris Jordan, who have almost recovered back from their respective injuries. While Livingstone is likely to replace Harry Brook in the World Cup playing XI, David Willey/Chris Woakes might make way for Chris Jordan. However, much of the same has to do with the way Jordan turns up during the training sessions or the warm-up matches as well. The lone area of concern is the batting form of Ben Stokes as well, who has returned back to T20I action after more than a year gap.","pubDate":"2022-10-12 16:19:00","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Shastri: Binny has got all boxes ticked to become BCCI president","link":"https://sportstar.thehindu.com/cricket/ravi-shastri-roger-binny-bcci-president-sourav-ganguly/article66002546.ece","keywords":null,"creator":["\n        Shayan Acharya  \n    "],"video_url":null,"description":"Ravi Shastri is delighted to see Roger Binny, a member of the 1983 World Cup-winning team, leading the cricket board.","content":"Ravi Shastri and Roger Binny have been close friends and colleagues for over four decades now. And as Binny gears up to succeed Sourav Ganguly as the president of the Board of Control for Cricket in India (BCCI), Shastri is delighted to see a member of the 1983 World Cup-winning team leading the cricket board. “Roger’s name has come up and I am delighted. He was my colleague in the World Cup. There is continuity here because he was the president of the Karnataka State Cricket Association and now, he moves on to become the president of the BCCI. I am extremely happy because it’s a World Cup winner who is the president for the first time in the history of the BCCI,” Shastri said during an interaction at the Mumbai Press Club on Wednesday. The former India head coach also welcomed the latest Supreme Court verdict of relaxing the cooling off period. “With the new judgment, it gives the Board an opportunity to come back on track,” he said. On Tuesday, Binny filed his nomination for the president of the BCCI and despite his keenness, Ganguly did not get a chance to seek another term as the head of the Board. Shastri, who has had a hot and cold relationship with Ganguly over the years, believes that nothing is permanent in life. “As I read in the media, I don’t think anyone had a second term as president. So, the way things stand, it gives an opportunity for another cricketer. Nothing is permanent in life and you can only do certain things for so long and then you have to move on,” Shastri said. “Something I am doing today does not mean I will do the same thing for three years from now. There will be new people coming in, new people taking over. In a way, it’s healthy.” Having known Binny for years, Shastri believes that with an unquestionable credibility, his friend ticks all the boxes. “His credentials are unquestionable, you look at his integrity, his character… and like I mentioned, he is a World Cup winner. He’s got all the boxes ticked to become the president of the BCCI,” Shastri said. “Being a cricketer himself, he will ensure that the interest of cricketers is paramount, not the A tier that will sustain itself, but the grassroot level. Primarily, domestic cricket. I think it has been given a lot of attention to, but can be given a lot more attention,” Shastri said. So, being a former cricketer, Binny will need to give attention to women’s cricket as well. “Then there’s women’s cricket, that’s taking off across the globe, the team that we have, we are not far away from winning a World Cup. That will trigger something special in this country,” Shastri said. The 67-year-old Binny has had previous experiences of being an administrator. He was part of the KSCA panel along with Brijesh Patel and Anil Kumble about a decade ago, before rejoining as the president of the state unit in 2019. “He is a very amiable guy, he has got a mind of his own. He might not be a flippant type, but when he opens his mouth, he will definitely be heard especially on cricketing matters,” Shastri said. Despite being arguably the richest cricket board in the globe, BCCI has often drawn flak for failing to make stadiums spectator-friendly. Shastri feels that’s one area the Binny-led BCCI should look at. “The most important thing is that the facilities at the ground should be uplifted big time. It should be insisted upon,” Shastri said. With no one else filing nomination for the role, Binny is set to be elected unopposed during the BCCI’s AGM next week. Read more stories on Cricket.","pubDate":"2022-10-12 16:10:00","image_url":null,"source_id":"sportstar","country":["india"],"category":["sports"],"language":"english"},{"title":"India vs Thailand, Women's Asia Cup: When And Where To Watch Live Telecast","link":"https://sports.ndtv.com/cricket/india-vs-thailand-womens-asia-cup-when-and-where-to-watch-live-telecast-live-streaming-3426224","keywords":["Cricket"],"creator":["NDTV"],"video_url":null,"description":"India vs Thailand: India will clash against Thailand in the first semi-final of the ongoing Women's Asia Cup on Thursday at the Sylhet International Cricket Stadium","content":"India will clash against Thailand in the first semi-final of the ongoing Women's Asia Cup on Thursday at the Sylhet International Cricket Stadium. These two teams had squared off against one another on Monday in the group stage and the match saw Thailand being bundled out 37. Harmanpreet Kaur did not play the last two games for India and it saw Smriti Mandhana leading the side. It needs to be seen whether full-time skipper Harmanpreet returns for this contest against Thailand. The second semi-final would be played on the same day between Pakistan and Sri Lanka. When will the India vs Thailand, Women's Asia Cup, 1st semi-final be played? The India vs Thailand, Women's Asia Cup, 1st semi-final be played on Thursday, October 13. Where will the India vs Thailand, Women's Asia Cup, 1st semi-final be played? The India vs Thailand, Women's Asia Cup, 1st semi-final will be played at the Sylhet International Cricket Stadium. What time will India vs Thailand, Women's Asia Cup, 1st semi-final begin? The India vs Thailand, Women's Asia Cup, 1st semi-final will begin at 8:30 AM IST. Which channels will broadcast the India vs Thailand, Women's Asia Cup, 1st semi-final? The India vs Thailand, Women's Asia Cup, 1st semi-final will be broadcast on the Star Sports Network. Promoted Where will India vs Thailand, Women's Asia Cup, 1st semi-final be available for live streaming? The India vs Thailand, Women's Asia Cup, 1st semi-final will be available for streaming on Disney+ Hotstar.","pubDate":"2022-10-12 16:00:20","image_url":"https://c.ndtvimg.com/2022-09/6ir6mr38_harmanpreet-kaur-806_625x300_21_September_22.jpg?im=FaceCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"“Debate about one or two spots”: Aaron Finch yet to finalize ideal Australia Playing 11 for T20 World Cup 2022","link":"https://thesportsrush.com/cricket-news-debate-about-one-or-two-spots-aaron-finch-yet-to-finalize-ideal-australia-playing-11-for-t20-world-cup-2022/","keywords":["Cricket","Aaron Finch","Australia","Australia tour of England 2022","England"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Australia Playing 11: The Australian captain hinted at Australia deciding combinations according to the opposition. Australia captain Aaron Finch was all praises for batter Tim David for his performance in the second T20I against England in Canberra tonight. Although it came in a losing cause, David scoring 40 (23) with the help of five fours… The post “Debate about one or two spots”: Aaron Finch yet to finalize ideal Australia Playing 11 for T20 World Cup 2022 appeared first on The SportsRush.","content":"Australia captain Aaron Finch was all praises for batter Tim David for his performance in the second T20I against England in Canberra tonight. Although it came in a losing cause, David scoring 40 (23) with the help of five fours and a six kept the hosts in the match in a tricky situation. Australia, who needed 34 runs off 16 balls after David’s dismissal, fell short by 8 runs as wicket-keeper batter Matthew Wade (10*) batted with a strike rate of 100 in a rare scenario. “[Tim] David has been fantastic. His raw power has been fantastic. He will get better the more he plays at the international level,” Finch told during the post-match presentation ceremony. It was on the second delivery of the 18th over when England all-rounder Sam Curran bowled David round his legs to remind fans of a same to dismiss Andre Russell in Indian Premier League 2021. With just a couple of matches remaining before ICC T20 World Cup 2022, Australia took the field with their first-choice players at the Manuka Oval today. While Finch himself returned to the top of the order as by him after the first T20I in Perth on Sunday, the likes of Glenn Maxwell, Pat Cummins, Mitchell Starc, Adam Zampa and Josh Hazlewood returned to Playing XI making it their according to former England captain Michael Vaughan. Finch, however, slightly hesitated from calling the current XI as their ideal or best for the World Cup. In fact, Finch was of the opinion that they will make changes to this Playing XI according to the opposition. For the unversed, adopting a horses-for-courses strategy is quite a common strategy in this format. “[Best Playing XI] Depends on the opposition but [this XI] is close. Debate about one or two spots,” Finch added.","pubDate":"2022-10-12 15:37:15","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Mike Hussey England: Is Michael Hussey England T20 coach or England batting coach 2022?","link":"https://thesportsrush.com/cricket-news-mike-hussey-england-is-michael-hussey-england-t20-coach-or-england-batting-coach-2022/","keywords":["Cricket","England","Michael Hussey"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Mike Hussey England: The former Australian batter will be with the England men’s Cricket team during the T20 World Cup in Australia. Post defeating Pakistan (4-3) while fielding a second-string side during the recently concluded seven-match T20I series, the England men’s Cricket team have now taken an unassailable 2-0 lead in the three-match T20I series,… The post Mike Hussey England: Is Michael Hussey England T20 coach or England batting coach 2022? appeared first on The SportsRush.","content":"Mike Hussey England: The former Australian batter will be with the England men’s Cricket team during the T20 World Cup in Australia. Post defeating Pakistan (4-3) while fielding a second-string side during the recently concluded seven-match T20I series, the England men’s Cricket team have now taken an unassailable 2-0 lead in the three-match T20I series, with an 8-run victory during the second match in Canberra, on Wednesday. While they managed to defend a challenging total of 208/6 during the first T20I by eight runs as well, the second win would taste much sweeter, especially after having lost their first four wickets within nine Overs into the first innings. However, vital contributions off the bat of southpaws Dawid Malan (82 off 49) and Moeen Ali (44 off 27) first took them to a respectable 178/7, which was then successfully defended by Sam Curran (4-0-25-3) and co., in front of a strong Aussie batting line-up. Is Mike Hussey England T20 coach? Former coach of the Australian women’s team from 2015-2022, Matthew Mott, was appointed as England men’s team White ball head coach in May this year, and will continue in the same capacity for the next four years, including the imminent T20 World Cup as well. Mott will, additionally, have the services of former Australian international Michael Hussey, who was roped in last month as England’s coaching consultant, albeit only for the upcoming month-long T20 World Cup in Australia. ALSO READ: England cricket coaching staff 2022 Hussey will also have the assistance of former England men’s bowling coach (from 2010 to 2015) David Saker, who will also remain with the side till the end of the World Cup. While Mott and Saker are together since the tour of Pakistan last month, Hussey recently joined the squad during the ongoing T20I series against Australia. Australian legend Hussey, was part of the strong Australian side across formats from 2004-2013, and his also presently the batting coach of the four-time champion IPL franchise Chennai Super Kings (CSK). The post Mike Hussey England: Is Michael Hussey England T20 coach or England batting coach 2022? appeared first on The SportsRush.","pubDate":"2022-10-12 15:30:32","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"South Africa क्रिकेट टीम पर वर्ल्ड कप से बाहर होने का बड़ा खतरा, जानिए क्या हैं पूरे समीकरण","link":"https://www.indiatv.in/sports/cricket/world-cup-qualification-race-ends-for-south-africa-danger-of-getting-out-from-odi-world-cup-2023-2022-10-12-892574","keywords":null,"creator":null,"video_url":null,"description":"Cricket World Cup Qualification: साउथ अफ्रीका की टीम पर आगामी विश्व कप से बाहर होने का खतरा मंडरा रहा है। टीम की डायरेक्ट एंट्री की राह बंद हो गई है और उसे क्वालिफिकेशन राउंड खेलना होगा।","content":null,"pubDate":"2022-10-12 15:28:35","image_url":null,"source_id":"indiatv","country":["india"],"category":["sports"],"language":"hindi"},{"title":"Willow TV brightens festivities with fan-favorite cricket matches including ICC T20 World Cup and more","link":"https://www.prnewswire.com:443/news-releases/willow-tv-brightens-festivities-with-fan-favorite-cricket-matches-including-icc-t20-world-cup-and-more-301647504.html","keywords":["Entertainment","Television","General Sports","Sporting Events","SSE","TVN","SPT","ENT"],"creator":null,"video_url":null,"description":"REDWOOD CITY, Calif., Oct. 12, 2022 /PRNewswire/ -- This festive season cricket fans on Willow TV will be in for a treat as the American pay television sports channel and digital platform will telecast 9 new exciting cricket properties involving top teams including India, Australia,...","content":null,"pubDate":"2022-10-12 15:00:00","image_url":"https://mma.prnewswire.com/media/1919551/WillowTV_Logo.jpg?p=original","source_id":"cision","country":["singapore"],"category":["sports"],"language":"english"},{"title":"UAE based cricketer gets 14 year-ban for attempted match-fixing","link":"https://www.indiatvnews.com/sports/cricket/mehar-chhayakar-uae-based-cricketer-gets-14-year-ban-for-attempted-match-fixing-2022-10-12-815771","keywords":null,"creator":null,"video_url":null,"description":"Mehar Chhayakar, a United Arab Emirates cricketer, has been banned for 14 years by the International Cricket Council (ICC). The ICC tribunal banned the cricketer from all forms of cricket in 2019 for violating the ICC and Cricket Canada codes.","content":"Mehar Chhayakar, a United Arab Emirates cricketer, has been banned for 14 years by the International Cricket Council (ICC). The ICC tribunal banned the cricketer from all forms of cricket in 2019 for violating the ICC and Cricket Canada codes. Mehar Chhayakar is a domestic cricketer from UAE who has played in the top league as a wicket-keeper batsman. He was found guilty of attempting to fix matches during the UAE vs Zimbabwe ODI series in 2019 and the Global T20 franchise tournament in Canada in the same year. Mehar's companions confessed to the crime, but he denied the allegations. Former UAE players Qadir Khan and Ghulam Shabbir, who were Chhayakar's accomplices in this whole fixing case, accepted the ban imposed on themselves, but the main accused Mehar claimed to be innocent \"Mehar Chhayakar has been banned from all cricket for 14 years after an ICC Anti-Corruption Tribunal found him guilty of seven breaches of the ICC and Cricket Canada Anti-Corruption Codes,\" the ICC said in a statement on Wednesday. Chhayakar first came to the attention as a result of the 2018 Ajman Allstars tournament which the (Anti-Corruption Unit) ACU investigated and determined was a corrupt tournament. However, as the 2018 AA tournament did not constitute sanctioned or official cricket it did not fall within the jurisdiction of the ICC or any other National Cricket Federation and therefore no action could be taken back then. ICC General Manager, Integrity Unit, Alex Marshall said, “We first encountered Mehar Chhayakar through his involvement in organising a corrupt cricket tournament in Ajman, in 2018. The charges for which he has now received a lengthy ban are further examples of his continuing efforts to corrupt and damage our sport. We will be relentless in pursuing and disrupting the people who try to corrupt cricket. With a ban of 14 years, the Tribunal has sent a clear message to anyone intending to corrupt our game.\"","pubDate":"2022-10-12 14:52:56","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"Why World Cup down under is the mother of all entertainment cricket","link":"https://www.moneycontrol.com/news/sports/why-world-cup-down-under-ismotherall-entertainment-cricket_16651661.html","keywords":null,"creator":null,"video_url":null,"description":"There#39;s something about Australia that instantly evokes memories of cricketâ€™s premium event. Fasten your seatbelts for an entertaining tournament","content":null,"pubDate":"2022-10-12 14:37:03","image_url":null,"source_id":"moneycontrol","country":["india"],"category":["sports"],"language":"english"},{"title":"Cricket fans laud Ben Stokes after his 'ridiculous' acrobatics","link":"https://www.dailymail.co.uk/sport/cricket/article-11307145/Cricket-fans-laud-Ben-Stokes-ridiculous-acrobatics.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Defending a total of 178 runs, Stokes was called into action when Australia's Mitchell Marsh blasted a Sam Curran delivery back over his head, with the ball seemingly destined to clear the boundary.","content":null,"pubDate":"2022-10-12 14:28:13","image_url":"https://i.dailymail.co.uk/1s/2022/10/12/15/63381473-0-image-a-9_1665584381046.jpg","source_id":"dailymailuk","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"IND W vs THAI W T20 2022 records: India Women vs Thailand Women T20 head to head record","link":"https://thesportsrush.com/cricket-news-ind-w-vs-thai-w-t20-2022-records-india-women-vs-thailand-women-t20-head-to-head-record/","keywords":["Cricket","India Women","Thailand Women","Women's Asia Cup 2022"],"creator":["Dixit Bhargav"],"video_url":null,"description":"IND W vs THAI W T20 record: The SportsRush presents for you the Head to Head statistics for IND-W vs THI-W T20I. The first semi-final of Women’s Asia Cup 2022 will be played between India Women and Thailand Women in Sylhet tomorrow. It will be the third time when these two teams will be facing… The post IND W vs THAI W T20 2022 records: India Women vs Thailand Women T20 head to head record appeared first on The SportsRush.","content":"IND W vs THAI W T20 record: The SportsRush presents for you the Head to Head statistics for IND-W vs THI-W T20I. The first semi-final of Women’s Asia Cup 2022 will be played between India Women and Thailand Women in Sylhet tomorrow. It will be the third time when these two teams will be facing each other in any format. Hence, there isn’t a scope for lot of records. Having emerged as the table-toppers after a 21-match league stage, India are coming on the back of five wins and one loss in the tournament. Thailand, on the contrary, had finished at the fourth position on the points table post winning and losing three matches each. Going to play the semi-final of a continental tournament for the first time, that too against India, qualifying for this match is in itself a historic moment for Thailand. ALSO READ: Pitch report of Sylhet International Cricket Stadium for India Women vs Thailand Women semi-final That being said, Thailand would want to not only be playing this match but also making a mark in it unlike their last two T20Is against India. Yet to cross the 75-run mark in a T20I innings against this opposition, sky is the limit for Thailand when it comes to improving their record on Thursday. IND W vs THAI W T20 head to head record Total number of matches played: 2 Matches won by IND-W: 2 Matches won by THI-W: 0 Matches played in Bangladesh: 1 (IND-W 1, THI-W 0) Matches played in Asia: 2 (IND-W 2, THI-W 0) Matches played at Sylhet International Cricket Stadium: 1 (IND-W 1, THI-W 0) IND-W average score against THI-W: 86 THI-W average score against IND-W: 51.5 Most runs for IND-W: 29 (Smriti Mandhana) Most runs for THI-W: 28 (Nattaya Boochatham) Most wickets for IND-W: 4 (Deepti Sharma) Most wickets for THI-W: 2 (Nattaya Boochatham) Most catches for IND-W: 1 (Rajeshwari Gayakwad, Sabbhineni Meghana, Sneh Rana and Pooja Vastrakar) Most catches for THI-W: 2 (Sornnarin Tippoch) NOTE: Only players part of current squads have been considered above (most runs, wickets and catches). The post IND W vs THAI W T20 2022 records: India Women vs Thailand Women T20 head to head record appeared first on The SportsRush.","pubDate":"2022-10-12 14:20:47","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Dawid Malan’s blast helps England to T20 series victory over Australia - The Guardian","link":"https://news.google.com/__i/rss/rd/articles/CBMicmh0dHBzOi8vd3d3LnRoZWd1YXJkaWFuLmNvbS9zcG9ydC8yMDIyL29jdC8xMi9kYXdpZC1tYWxhbi1ibGFzdC1oZWxwcy1lbmdsYW5kLXRvLXQyMC1zZXJpZXMtdmljdG9yeS1vdmVyLWF1c3RyYWxpYdIBcmh0dHBzOi8vYW1wLnRoZWd1YXJkaWFuLmNvbS9zcG9ydC8yMDIyL29jdC8xMi9kYXdpZC1tYWxhbi1ibGFzdC1oZWxwcy1lbmdsYW5kLXRvLXQyMC1zZXJpZXMtdmljdG9yeS1vdmVyLWF1c3RyYWxpYQ?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Dawid Malan’s blast helps England to T20 series victory over Australia  The GuardianEngland in Australia: Dawid Malan and Sam Curran shine to help seal T20 series  BBCEngland beat Australia in T20 series as Dawid Malan and Sam Curran play key roles in Canberra  Sky SportsEngland beat Australia to win series: second men’s T20 cricket international – as it happened  The GuardianWhat happened in Perth and famous examples of obstructing the field | Unplayable Podcast  cricket.com.auView Full coverage on Google News","content":null,"pubDate":"2022-10-12 14:16:00","image_url":null,"source_id":"google","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"ZIM vs NAM Dream11 Prediction: Fantasy Cricket Tips, Today's Playing 11, Player Stats, Pitch Report for ICC T20 World Cup Warm-up Matches 2022 Match 6","link":"https://www.sportskeeda.com/fantasy-cricket-mantra/zimbabwe-vs-namibia-dream11-prediction-icc-t20-world-cup-warm-up-matches-2022?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Fantasy Cricket Mantra"],"creator":["Sahil Jain"],"video_url":null,"description":null,"content":"Zimbabwe will take on Namibia in the sixth game of the ICC T20 World Cup Warm-up match 2022 at Junction Oval, Melbourne on Thursday, September 13. Ahead of the match, here's all you need to know about the ZIM vs NAM Dream11 Prediction , including fantasy cricket tips, today's playing 11s and the pitch report for this game. This is the final warm-up game for both teams as they aim to iron out the chinks before the first round of this mega tournament gets underway. Zimbabwe lost their first warm-up encounter against Sri Lanka as they fell 33 runs short while chasing 189. Meanwhile, Namibia recorded an upset as they downed Ireland by 11 runs while defending 138. The sixth match of the ICC T20 World Cup Warm-up Matches 2022 between Zimbabwe and Namibia will be played on October 13, 2022, at Junction Oval, Melbourne. The game is set to take place at 5.30 am IST. The live score & commentary of the game can be followed in the Sportskeeda Live Score section . Match : ZIM vs NAM Date & Time : October 13, 2022, 5.30 am IST Venue : Junction Oval, Melbourne The track at Junction Oval in Melbourne is likely to be a very good one to bat on. 152 and 151 are the two scores posted by teams batting first in these warm-up fixtures at this venue. There could be some movement early on with the new ball for the pacers. No major injury concerns. Zimbabwe Squad : Regis Chakabva (wk), Craig Ervine (c), Wesley Madhevere, Sean Williams, Sikandar Raza , Milton Shumba, Ryan Burl, Tony Munyonga, Luke Jongwe, Wellington Masakadza, Richard Ngarava, Tendai Chatara, Blessing Muzarabani, Clive Madande, and Brad Evans. No major injury concerns. Namibia Squad : Divan la Cock, Michael van Lingen, Jan Nicol Loftie-Eaton, Gerhard Erasmus (c), Jan Frylinck, JJ Smit, David Wiese , Ruben Trumpelmann, Zane Green (wk), Bernard Scholtz, Tangeni Lungameni, Stephan Baard, Lohandre Louwrens, Pikky Ya France, Karl Birkenstock, and Ben Shikongo. Regis Chakabva has the ability to score substantially with the bat. He has mustered 227 runs while striking at 127.52 this year in the shortest format. Gerhard Erasmus has been superb in T20I cricket in 2022. The Namibia skipper has amassed 254 runs at a strike rate of 133.68 in eight encounters. He has also chipped in with eight wickets. Jan Frylinck could be effective with both bat and ball. He hit a 16-ball 26 against Ireland and also returned with figures of 2/13 from four overs. Overall, he has scored 42 runs in three innings and seven wickets in eight games this year. Blessing Muzarabani hasn't played a lot of T20Is for Zimbabwe this year. However, the ace fast bowler is a wicket-taking option and he also dishes out economical spells. Sikandar Raza couldn’t really get going with the bat in the last game and took 1/8 in two overs with the ball. The off-spinning all-rounder has been magnificent throughout this year, scoring 516 runs while striking at 152.21 and taking 15 wickets. David Wiese is an impact player. The veteran all-rounder has taken five scalps and has made 48 runs in five games in T20Is in 2022. He took 2/16 from 3.5 overs in the last warm-up game. Player Player Stats Sikandar Raza 516 runs & 15 wickets in 15 innings David Wiese 48 runs & 5 wickets in 5 matches Jan Frylinck 42 runs in 3 innings and 7 wickets in 8 innings Gerhard Erasmus 254 runs & 6 wickets in 8 matches Blessing Muzarabani 5 wickets in 5 matches Both teams boast some high-quality all-rounders and hence, at least three or four of them need to be picked. Moreover, all-rounders like David Wiese, Sikandar Raza, Sean Williams and Gerhard Erasmus will also be top captaincy picks. Wicket-keeper: Regis Chakabva Batters: Craig Ervine, Michael van Lingen, Gerhard Erasmus All-rounders: David Wiese, Sikandar Raza, Wesley Madhevere, Jan Frylinck Bowlers: Richard Ngarava, Blessing Muzarabani, Ruben Trumpelmann Wicket-keeper: Regis Chakabva Batters: Craig Ervine, JJ Smit, Gerhard Erasmus All-rounders: Sean Williams, David Wiese, Sikandar Raza, Jan Frylinck Bowlers: Bernard Scholtz, Blessing Muzarabani, Ben Shikongo Poll : 0 votes Quick Links","pubDate":"2022-10-12 13:44:01","image_url":"https://static.sportskeeda.com/editor/2022/10/e0d13-16655778346336-1920.jpg","source_id":"sportskeeda","country":["india"],"category":["sports"],"language":"english"},{"title":"Ambati Rayudu and Sheldon Jackson fight: What really happened in Baroda vs Saurashtra Syed Mushtaq Ali Trophy match?","link":"https://thesportsrush.com/cricket-news-ambati-rayudu-and-sheldon-jackson-fight-what-really-happened-in-baroda-vs-saurashtra-syed-mushtaq-ali-trophy-match/","keywords":["Cricket","Videos","Ambati Rayudu","Baroda","Saurashtra","Sheldon Jackson","Syed Mushtaq Ali Trophy"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Ambati Rayudu and Sheldon Jackson fight: The two senior cricketers were involved in a heated exchange at the Holkar Stadium today. Saurashtra beat Baroda by 4 wickets in a Group D league match of Syed Mushtaq Ali Trophy 2022-23 in Indore to reach at the top of the points table by handing the opposition their… The post Ambati Rayudu and Sheldon Jackson fight: What really happened in Baroda vs Saurashtra Syed Mushtaq Ali Trophy match? appeared first on The SportsRush.","content":"Ambati Rayudu and Sheldon Jackson fight: The two senior cricketers were involved in a heated exchange at the Holkar Stadium today. Saurashtra beat Baroda by 4 wickets in a Group D league match of Syed Mushtaq Ali Trophy 2022-23 in Indore to reach at the top of the points table by handing the opposition their first loss of the tournament. Saurashtra were able to chase down a 176-run target with a couple of balls remaining in the match on the back of batter Samarth Vyas’ third T20 half-century. Practically a one-man show, Vyas scored a match-winning 97 (52) comprising of five fours and nine sixes after coming in to bat at No. 3 in the first over itself. Although the 26-year old player missed out on a maiden T20 century, he played a titular role in powering Saurashtra to a win. Saurashtra captain Jaydev Unadkat (1/33 and 8) winning the toss and electing to field first had resulted in Baroda putting on board a competitive 175/4 in 20 overs. In spite of individual half-centuries from Mitesh Patel (60) and Vishnu Solanki (51), Baroda eventually fell short in the second innings. Ambati Rayudu and Sheldon Jackson fight The match, however, took an aggressive turn when Baroda captain Ambati Rayudu (0) and Saurashtra wicket-keeper batter Sheldon Jackson (17) were involved in a heated exchange at the Holkar Stadium. ALSO READ: When did Ambati Rayudu play his last international match for India? It all happened in the second innings when the two senior cricketers were seen walking towards each other whilst uttering words only to be interrupted by on-field umpires and Baroda all-rounder Krunal Pandya. pic.twitter.com/twhRAM0o2Y — cricket fan (@cricketfanvideo) October 12, 2022 If reports are to be believed, it is being said that Rayudu was irked with Jackson taking a lot of time during batting. Not known for holding back his emotions, Rayudu pointed out the same towards Jackson only to result in an altercation. The post Ambati Rayudu and Sheldon Jackson fight: What really happened in Baroda vs Saurashtra Syed Mushtaq Ali Trophy match? appeared first on The SportsRush.","pubDate":"2022-10-12 13:43:58","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Match Fixing in Cricket: क्रिकेट पर फिर लगा फिक्सिंग का दाग, इस क्रिकेटर पर लगा 14 साल का बैन","link":"https://www.indiatv.in/sports/cricket/match-fixing-in-cricketer-icc-banned-uae-cricketer-mehar-chhayakar-for-14-years-in-fixing-and-corruption-charges-2022-10-12-892538","keywords":null,"creator":null,"video_url":null,"description":"Match Fixing in Cricket: आईसीसी ने लंबे अरसे के बाद क्रिकेट में फिक्सिंग करने के मामले में एक क्रिकेटर को 14 साल के लिए प्रतिबंधित कर दिया।","content":null,"pubDate":"2022-10-12 13:37:28","image_url":null,"source_id":"indiatv","country":["india"],"category":["sports"],"language":"hindi"},{"title":"Cricket-Jennings and Livingstone get England test call, Broad misses Pakistan tour","link":"https://www.channelnewsasia.com/sport/cricket-jennings-and-livingstone-get-england-test-call-broad-misses-pakistan-tour-3004521","keywords":null,"creator":null,"video_url":null,"description":null,"content":"Best News Website or Mobile Service WAN-IFRA Digital Media Awards Worldwide Best News Website or Mobile Service Digital Media Awards Worldwide (Reuters) - Lancashire duo Keaton Jennings and Liam Livingstone have been called up to the England squad for their three-test tour of Pakistan starting in December, but veteran fast bowler Stuart Broad misses the trip. There is also a first test call-up for Surrey all-rounder Will Jacks after an impressive summer in which he impressed with bat and off-spin, helping Surrey win the County Championship Division One title. Jennings returns to the test squad for the first time since February 2019 after scoring 1,233 County Championship runs this summer, while T20 specialist Livingstone will be eyeing a test debut after joining the setup for the first time since 2018. Nottinghamshire seam bowler Broad was not considered for selection, with his partner expecting their first child towards the end of November. The 36-year-old, who returned to the England squad under the new leadership of coach Brendon McCullum and captain Ben Stokes, helped the team win six of their seven tests this summer by taking 29 wickets. Broad's absence is softened by the return of Durham's Mark Wood, included in the squad for the first time since March, while Surrey quick Jamie Overton is in after making his test debut earlier against New Zealand at Headingley in June. \"We are looking forward to touring Pakistan as a test team for the first time since 2005,\" said Rob Key, Managing Director for England Men's Cricket. \"It will be a historic tour and a compelling series against a good side. \"The selectors have picked a squad for the conditions we can expect in Pakistan. There is a strong blend of youth and experience and players who will adapt well to the types of pitches we are likely to get across the three-match series.\" The first of three tests between Pakistan and England gets under way in Rawalpindi on Dec. 1. England Men's test squad for Pakistan tour Ben Stokes (Durham) captain James Anderson (Lancashire) Harry Brook (Yorkshire) Zak Crawley (Kent) Ben Duckett (Nottinghamshire) Ben Foakes (Surrey) Will Jacks (Surrey) Keaton Jennings (Lancashire) Jack Leach (Somerset) Liam Livingstone (Lancashire) Jamie Overton (Surrey) Ollie Pope (Surrey) Ollie Robinson (Sussex) Joe Root (Yorkshire) Mark Wood (Durham)","pubDate":"2022-10-12 13:33:21","image_url":"https://onecms-res.cloudinary.com/image/upload/s--_b6HAcGF--/c_fill,h_900,w_1600/fl_relative,g_south_east,l_one-cms:core:watermark:reuters,w_0.1/f_auto,q_auto/v1/one-cms/core/2022-10-12t133321z_1_lynxmpei9b0qz_rtroptp_3_cricket-test-win-eng.jpg?itok=b0i_2E75","source_id":"channelnewsasia","country":["singapore"],"category":["sports"],"language":"english"},{"title":"“Yeah Jonny, miss you mate”: Moeen Ali sends heart-warming message to Jonny Bairstow after winning Canberra T20I","link":"https://thesportsrush.com/cricket-news-yeah-jonny-miss-you-mate-moeen-ali-sends-heart-warming-message-to-jonny-bairstow-after-winning-canberra-t20i/","keywords":["Cricket","England tour of Australia 2022","Jonny Bairstow","Moeen Ali"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"Moeen Ali sent a heart-warming message to English batter Jonny Bairstow, who will miss the World Cup with an injury. England defeated Australia by 8 runs in the 2nd T20I at the Manuka Oval in Canberra. With this win, they won the series as well. In the next match, they will aim to complete a… The post “Yeah Jonny, miss you mate”: Moeen Ali sends heart-warming message to Jonny Bairstow after winning Canberra T20I appeared first on The SportsRush.","content":"England defeated Australia by 8 runs in the 2nd T20I at the Manuka Oval in Canberra. With this win, they won the series as well. In the next match, they will aim to complete a whitewash over their arch-rivals. It is interesting that the English won both matches by the very same margin. The Australian team was bolstered by the return of their star players, but the English team again held their nerves. Alex Hales and Jos Buttler failed to repeat their Perth’s heroics in Canberra, but England still scored 178 runs with the help of Dawid Malan’s half-century. Australia, in reply, managed to score just 170 runs at the end. Mitchell Marsh and Tim David tried their best, but they fall short by 8 runs at the end. Sam Curran took three wickets for the visitors. After the match, Moeen Ali shared an emotional message to his fellow Englishman Jonny Bairstow, who will miss the T20 World Cup due to an injury. Bairstow had a while playing golf, and it is confirmed that Bairstow won’t make his return anytime before 2023. Ali said that the whole team is missing Bairstow as he is a top player. Bairstow is currently working as a pundit for BT Sport for the ongoing T20I series between England and Australia. “We really miss him because he’s a top player, world-class player… Yeah Jonny, miss you mate,” Moeen Ali said about Jonny Bairstow who was in the studio with BT Sports. “Jonny, I know you’re in the studio and hopefully we’ll get him back soon.” “We really miss him because he’s a top player, world-class player… Yeah Jonny, miss you mate.” Moeen Ali with a message for Jonny Bairstow ❤️ — Cricket on BT Sport (@btsportcricket) Ali insists that the English team is moving in the right direction ahead of the T20 World Cup in Australia. They won the recent T20I series against Pakistan, whereas they have sealed the Australian T20I series as well. Jos Buttler is also back in form after returning from injury. We’re progressing in the right direction, Pakistan was big for us, winning two here, Jos coming back and in form,” Moeen Ali added.","pubDate":"2022-10-12 13:02:49","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"}]}