{"newsArray":[{"title":"Scotland names squad for qualifiers","link":"https://www.sundaynews.co.zw/scotland-names-squad-for-qualifiers/","keywords":["Sports"],"creator":["Chronicle Editor"],"video_url":null,"description":"Brandon Moyo, Sports Reporter SCOTLAND have announced their 15-member squad that will take part in the upcoming 2023 Men’s Cricket World Cup Qualifiers that will be held in Zimbabwe next month. The European nation made two changes to the squad that won the International Cricket Council (ICC) Cricket World Cup League 2 title in February […]","content":"The Sunday News SCOTLAND have announced their 15-member squad that will take part in the upcoming 2023 Men’s Cricket World Cup Qualifiers that will be held in Zimbabwe next month. The European nation made two changes to the squad that won the International Cricket Council (ICC) Cricket World Cup League 2 title in February which guaranteed them a spot in the upcoming qualifiers. They brought in Alasdair Evans and Adrian Neill to replace Liam Naylor and the retired veteran Kyle Coetzer. Evans will be in line to play his first One Day International (ODI) since 2021 after signing a professional contract with Cricket Scotland for the 2023-2024 season. The World Cup qualifiers are scheduled to begin on 18 June and will be played across four venues in Harare and Bulawayo. In a statement from Cricket Scotland, the team’s interim head coach, Doug Watson said coming to Zimbabwe for the qualifiers is a good opportunity for them and they have a fairly good squad which is a mixture of senior and young players who are not new to the highest level of the game. He added that they will have to quickly adapt to the Zimbabwean conditions which will allow them to play their game. “I think there’s a good mixture in this squad of youth and senior players who’ve been around a while — the likes of Richie and George, as well as some exciting young talent in Jack Jarvis and Chris McBride. It’s obviously a wonderful opportunity coming up in Zimbabwe, and the guys that we’ve selected are all really excited and fizzing to go. “They know how tough the challenge is going to be. It’s moving into winter over there just now, and the conditions are changing, and will be quite spin-friendly, but the key thing will be for us to adapt to the conditions and approach the games the way we want to play them,” said Watson. The Scotland squad will fly to Pretoria in South Africa on 3 June, for a pre-tournament training camp. They will also play two warm up games against Nepal and Netherlands, before travelling on to Zimbabwe. A total of 10 teams are expected to battle it out for the remaining two spots to the World Cup which will be held in India later this year. However, the final fixtures schedule for the Qualifiers is yet to be announced by ICC. Richie Berrington (captain), Matthew Cross, Alasdair Evans, Chris Greaves, Jack Jarvis, Michael Leask, Tom Mackintosh, Chris McBride, Brandon McMullen, George Munsey, Adrian Neill, Safyaan Sharif, Chris Sole, Hamza Tahir, Mark Watt. — Follow on Twitter @brandon_malvin.","pubDate":"2023-05-20 22:03:30","image_url":null,"source_id":"sundaynews","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"Zimbabwe Select’s top order, time to get things right","link":"https://www.sundaynews.co.zw/zimbabwe-selects-top-order-time-to-get-things-right/","keywords":["Sports"],"creator":["Chronicle Editor"],"video_url":null,"description":"Brandon Moyo, Sports Reporter ZIMBABWE Select will go up against Pakistan ‘A’ today in the third one-day match at Harare Sports Club with one goal in mind, making it 3-0. However, a lot has to be done especially with the bat. Going into the match as favorites due to the quality they possess on paper, the […]","content":"The Sunday News ZIMBABWE Select will go up against Pakistan ‘A’ today in the third one-day match at Harare Sports Club with one goal in mind, making it 3-0. However, a lot has to be done especially with the bat. Going into the match as favorites due to the quality they possess on paper, the Zimbabwean top order has a lot to work on as they still look rusty with pressure piling up on them with each passing game. The Wellington Masakadza captained side has failed to bat out their 50 overs in the first two matches, being bowled out in 45,3 overs in the first game and 38,5 overs in the second, something that they will have to correct going into today’s encounter. They have had the time to settle and wipe out the rust in the first two games and it’s now time to go and give out their best as they eye the upcoming World Cup Qualifiers. The top order’s batting displays leave a lot to be desired. Innocent Kaia, Wessly Madhevere, Tadiwanashe Marumani and Craig Ervine have all looked out of touch in the first two games, thus, will have to bring their ‘A’ game. They have not yet performed up to their best, failing to set up a foundation for the middle order. After struggling in the opening match, the woes continued on Friday with the first two wickets falling with just 10 runs on the board. Kaia and Madhevere fell for two and zero runs respectively. It was Ryan Burl, Clive Madande and Blessing Muzarabani who came to the rescue once again as the home side went on to score two more runs than in the first match, finishing on 236 runs. More pressure on the bowlers once again to give their all while the batters have been misfiring. Zimbabwean bowlers have shown to be in good form, restricting their opponents to 156 runs all out to register a 80 runs win. For his 50 runs off 24 deliveries and 4/23 with the ball, Muzarabani was named player of the match. Going into today’s match, a lot is expected with the bat, the star-studded Zimbabwean team should look to bat out their 50 overs and avoid losing wickets in the first powerplay which will give them a good foundation for a good score. They have one job, bat out the 50 overs, should they go in to bat first like the first two matches. The bowlers have shown that they can do the job, it’s now up to the batters to follow suit and give it their all. The third 50-over game is scheduled to start at 9.30am at Harare Sports Club and a good performance will be a crucial confidence booster for the World Cup Qualifiers. The World Cup Qualifiers will see 10 teams competing for the two remaining places at the ICC Men’s Cricket World Cup 2023 in India later in the year. The matches will be staged across four venues in Harare and Bulawayo from 18 June to 9 July. — Follow on Twitter @brandon_malvin.","pubDate":"2023-05-20 22:02:02","image_url":null,"source_id":"sundaynews","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"Man City retain Premier League title after Arsenal lose to Forest","link":"https://timesofindia.indiatimes.com/sports/football/epl/top-stories/manchester-city-retain-premier-league-title-after-arsenal-lose-to-nottingham-forest/articleshow/100386017.cms","keywords":null,"creator":null,"video_url":null,"description":"Defending champions Manchester City were on Saturday confirmed Premier League champions after second-placed Arsenal were beaten 0-1 away at Nottingham Forest. Arsenal needed at least one point to stay mathematically alive in the title race but ended on the losing side against Forest. Arsenal's defeat ensured a fifth title in six seasons for the Pep Guardiola side.","content":"Rajasthan Royals eliminate Punjab Kings to stay alive IPL Top 5: Keepers with the most stumpings IPL: CSK take on DC with an aim at play-off spot The Big Stats of the Champions League 2022-2023 Bowlers with most 4-wicket hauls in IPL history Eye-catching NBA play-off moments IPL : LSG eye back-to-back playoff berth Centuries by the Protea batters in the IPL The 99 curse: Top players who missed a ton by 1 run in IPL Top 5: The oldest cricketers in IPL history","pubDate":"2023-05-20 18:51:23","image_url":null,"source_id":"toi","category":["sports"],"country":["india"],"language":"english"},{"title":"IPL 2023: प्लेऑफ की 3 टीमें पक्की, अब MI और RCB के बीच आखिरी जंग; खुल सकती है राजस्थान की किस्मत!","link":"https://www.indiatv.in/sports/cricket/csk-lsg-gujarat-titans-qualifies-for-ipl-2023-playoffs-rcb-and-mumbai-indians-fight-for-last-place-2023-05-20-962480","keywords":null,"creator":null,"video_url":null,"description":"आईपीएल 2023 के 68 मुकाबलों के बाद अब प्लेऑफ की तीन टीमें पक्की हो चुकी हैं। वहीं आखिरी स्थान के लिए अब आरसीबी और मुंबई इंडियंस के बीच जंग है।","content":"आईपीएल 2023 के 68वें मुकाबले में केकेआर को हराकर लखनऊ सुपर जायंट्स ने भी अपना प्लेऑफ का टिकट पक्का कर लिया है। इसी के साथ अब तीन टीमें अंतिम-4 के लिए तय हो गई हैं और उनकी पोजीशन भी अब तय हो गई हैं। गुजरात टाइटंस टॉप पर है जो अंत तक उसी स्थान पर रहेगी। वहीं सीएसके का भी अब दूसरे स्थान पर रहना तय है। साथ ही लखनऊ सुपर जायंट्स की टीम इस जीत के साथ 17 अंक लेकर तीसरे स्थान पर ही रहेगी। अब चौथे स्थान के लिए टक्कर है आरसीबी और मुंबई इंडियंस के बीच। अगर दोनों टीमें अपना-अपना आखिरी मैच हार जाती हैं तो राजस्थान की किस्मत खुल जाएगी। वहीं अगर मुंबई इंडियंस अपने आखिरी मैच में सनराइजर्स को हरा देती है और आरसीबी उधर गुजरात टाइटंस को हराती है, फिर वहां नेट रनरेट खेल में आ जाएगा। अगर अभी के हिसाब से देखें ते आरसीबी का नेट रनरेट 0.180 है और मुंबई का है -0.128 जो कि आरसीबी से बहुत कम है। इस स्थिति में अगर मुंबई करीबी मुकाबला जीतती है तो जीतकर भी बाहर हो जाएगी। यानी मुंबई को या तो बड़ी जीत की जरूरत है। या फिर अपनी जीत के बाद उसे आरसीबी की हार की कामना करनी पड़ेगी। अगर यह दोनों टीमें हारीं तो राजस्थान के लिए मौका बन जाएगा। राजस्थान की टीम अभी 14 में से 7 मैच जीती है और उसके 14 अंक हैं। वहीं राजस्थान का नेट रनरेट है 0.15 और आरसीबी का नेट रनरेट है 0.18 यानी सिर्फ 0.03 का अंतर है। मुंबई तो माइनस में है। अगर मुंबई और आरसीबी अपना मुकाबला हारती हैं तो उस स्थिति में राजस्थान रॉयल्स प्लेऑफ के लिए क्वालीफाई कर सकती है। यानी अभी यह कहना गलत होगा कि संजू सैमसन की टीम की उम्मीदें खत्म हो गई हैं। इसके अलावा अब यह भी साफ हो गया है कि चेन्नई सुपर किंग्स पॉइंट्स टेबल में दूसरे स्थान पर रहेगी और गुजरात टाइटंस अगर आखिरी मैच आरसीबी से हारती भी है तो भी टॉप पर रहेगी। यानी क्वालीफायर 1 जो कि चेपॉक में 23 मई को खेला जाएगा उसमें चेन्नई सुपर किंग्स का सामना गुजरात टाइटंस से होगा। इस मैच में जीतने वाली टीम फाइनल में जाएगी। वहीं हारने वाली टीम क्वालीफायर 2 में एलिमिनेटर की विजेता टीम से 26 मई को अहमदाबाद के नरेंद्र मोदी स्टेडियम में भिड़ेगी। 28 मई को टूर्नामेंट का फाइनल भी इसी मैदान पर खेला जाएगा।","pubDate":"2023-05-20 18:13:03","image_url":null,"source_id":"indiatv","category":["sports"],"country":["india"],"language":"hindi"},{"title":"धोनी नहीं, ये होनी है, एक नहीं हजारों 'माही' प्लेऑफ में पहुंचे","link":"https://navbharattimes.indiatimes.com/visual-story/cricket/ms-dhoni-csk-qualify-for-ipl-playoffs-2023/photoshow/100382567.cms","keywords":null,"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2023-05-20 14:14:10","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"चेन्नई सुपर किंग्स के ये पांच सूरमा जिसने 16वें सीजन में टीम को प्लेऑफ में पहुंचाया","link":"https://navbharattimes.indiatimes.com/sports/cricket/iplt20/photos/five-players-of-chennai-super-kings-who-take-team-to-playoffs-in-16th-season-of-ipl-ruturaj-gaikwad-devon-conway-ravindra-jadeja-shivam-dube/photoshow/100382887.cms","keywords":null,"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2023-05-20 14:03:27","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Shammi Silva elected uncontested as SLC President","link":"https://srilankamirror.com/sports/shammi-silva-elected-uncontested-as-slc-president/","keywords":["Sports","Cricket","lka","SriLanka"],"creator":["editor"],"video_url":null,"description":"Shammi Silva has been elected uncontested, as the President of Sri Lanka Cricket for the 2023 – 2025. The decision was declared by the Election Committee of Sri Lanka Cricket at the SLC Annual General Meeting currently being held in Colombo. This is Silva’s third term in office as the President of SLC.","content":"Shammi Silva has been elected uncontested, as the President of Sri Lanka Cricket for the 2023 – 2025. The decision was declared by the Election Committee of Sri Lanka Cricket at the SLC Annual General Meeting currently being held in Colombo. This is Silva’s third term in office as the President of SLC.","pubDate":"2023-05-20 14:01:25","image_url":null,"source_id":"srilankamirror","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Banyana looking to follow in the footsteps of SA women’s cricketers at World Cup","link":"https://www.iol.co.za/sport/soccer/banyana/banyana-looking-to-follow-in-the-footsteps-of-sa-womens-cricketers-at-world-cup-9e8d0660-784d-4bef-82c9-21ddd7d10851","keywords":null,"creator":["Mihlali Baleka"],"video_url":null,"description":"The national women’s cricketing team achieved the improbable in the T20 World Cup on home soil in February, reaching the final for the very first time before losing to Australia.","content":null,"pubDate":"2023-05-20 13:49:42","image_url":"https://image-prod.iol.co.za/16x9/800?source=https://xlibris.public.prod.oc.inl.infomaker.io:8443/opencontent/objects/2915821d-4889-53f4-a53a-732f1238264a&operation=CROP&offset=0x36&resize=4152x2332","source_id":"iol","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Chennai Super Kings crush Delhi Capitals to storm into IPL 2023 playoffs","link":"https://www.indiatoday.in/sports/cricket/story/dc-vs-csk-chennai-super-kings-crush-delhi-capitals-to-storm-into-ipl-2023-playoffs-2381975-2023-05-20?utm_source=rss","keywords":null,"creator":null,"video_url":null,"description":"Chennai Super Kings crush Delhi Capitals to storm into IPL 2023 playoffs","content":null,"pubDate":"2023-05-20 13:47:16","image_url":null,"source_id":"indiatoday","category":["sports"],"country":["india"],"language":"english"},{"title":"12वीं बार प्लेऑफ में पहुंची चेन्नई सुपरकिंग्स, धोनी को मिलने जा रही 'शाही विदाई'!","link":"https://navbharattimes.indiatimes.com/sports/cricket/iplt20/news/chennai-super-kings-qualified-for-ipl-2023-playoffs-beat-beat-delhi-capitals-shivam-dube-ruturaj-gaikwad-shines/articleshow/100381895.cms","keywords":null,"creator":null,"video_url":null,"description":"Chennai Super Kings IPL: दिल्ली का होमग्राउंड कोटला पर चेन्नई सुपरकिंग्स और उसके कप्तान महेंद्र सिंह धोनी के चाहने वालों से अटा पड़ा था। धोनी की टीम ने एकबार फिर आईपीएल प्लेऑफ में जगह बना ली है।","content":null,"pubDate":"2023-05-20 13:46:38","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Scotland names squad for qualifiers","link":"https://www.sundaynews.co.zw/scotland-names-squad-for-qualifiers/","keywords":["Sports"],"creator":["Chronicle Editor"],"video_url":null,"description":"Brandon Moyo, Sports Reporter SCOTLAND have announced their 15-member squad that will take part in the upcoming 2023 Men’s Cricket World Cup Qualifiers that will be held in Zimbabwe next month. The European nation made two changes to the squad that won the International Cricket Council (ICC) Cricket World Cup League 2 title in February […]","content":"The Sunday News SCOTLAND have announced their 15-member squad that will take part in the upcoming 2023 Men’s Cricket World Cup Qualifiers that will be held in Zimbabwe next month. The European nation made two changes to the squad that won the International Cricket Council (ICC) Cricket World Cup League 2 title in February which guaranteed them a spot in the upcoming qualifiers. They brought in Alasdair Evans and Adrian Neill to replace Liam Naylor and the retired veteran Kyle Coetzer. Evans will be in line to play his first One Day International (ODI) since 2021 after signing a professional contract with Cricket Scotland for the 2023-2024 season. The World Cup qualifiers are scheduled to begin on 18 June and will be played across four venues in Harare and Bulawayo. In a statement from Cricket Scotland, the team’s interim head coach, Doug Watson said coming to Zimbabwe for the qualifiers is a good opportunity for them and they have a fairly good squad which is a mixture of senior and young players who are not new to the highest level of the game. He added that they will have to quickly adapt to the Zimbabwean conditions which will allow them to play their game. “I think there’s a good mixture in this squad of youth and senior players who’ve been around a while — the likes of Richie and George, as well as some exciting young talent in Jack Jarvis and Chris McBride. It’s obviously a wonderful opportunity coming up in Zimbabwe, and the guys that we’ve selected are all really excited and fizzing to go. “They know how tough the challenge is going to be. It’s moving into winter over there just now, and the conditions are changing, and will be quite spin-friendly, but the key thing will be for us to adapt to the conditions and approach the games the way we want to play them,” said Watson. The Scotland squad will fly to Pretoria in South Africa on 3 June, for a pre-tournament training camp. They will also play two warm up games against Nepal and Netherlands, before travelling on to Zimbabwe. A total of 10 teams are expected to battle it out for the remaining two spots to the World Cup which will be held in India later this year. However, the final fixtures schedule for the Qualifiers is yet to be announced by ICC. Richie Berrington (captain), Matthew Cross, Alasdair Evans, Chris Greaves, Jack Jarvis, Michael Leask, Tom Mackintosh, Chris McBride, Brandon McMullen, George Munsey, Adrian Neill, Safyaan Sharif, Chris Sole, Hamza Tahir, Mark Watt. — Follow on Twitter @brandon_malvin.","pubDate":"2023-05-20 22:03:30","image_url":null,"source_id":"sundaynews","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"Zimbabwe Select’s top order, time to get things right","link":"https://www.sundaynews.co.zw/zimbabwe-selects-top-order-time-to-get-things-right/","keywords":["Sports"],"creator":["Chronicle Editor"],"video_url":null,"description":"Brandon Moyo, Sports Reporter ZIMBABWE Select will go up against Pakistan ‘A’ today in the third one-day match at Harare Sports Club with one goal in mind, making it 3-0. However, a lot has to be done especially with the bat. Going into the match as favorites due to the quality they possess on paper, the […]","content":"The Sunday News ZIMBABWE Select will go up against Pakistan ‘A’ today in the third one-day match at Harare Sports Club with one goal in mind, making it 3-0. However, a lot has to be done especially with the bat. Going into the match as favorites due to the quality they possess on paper, the Zimbabwean top order has a lot to work on as they still look rusty with pressure piling up on them with each passing game. The Wellington Masakadza captained side has failed to bat out their 50 overs in the first two matches, being bowled out in 45,3 overs in the first game and 38,5 overs in the second, something that they will have to correct going into today’s encounter. They have had the time to settle and wipe out the rust in the first two games and it’s now time to go and give out their best as they eye the upcoming World Cup Qualifiers. The top order’s batting displays leave a lot to be desired. Innocent Kaia, Wessly Madhevere, Tadiwanashe Marumani and Craig Ervine have all looked out of touch in the first two games, thus, will have to bring their ‘A’ game. They have not yet performed up to their best, failing to set up a foundation for the middle order. After struggling in the opening match, the woes continued on Friday with the first two wickets falling with just 10 runs on the board. Kaia and Madhevere fell for two and zero runs respectively. It was Ryan Burl, Clive Madande and Blessing Muzarabani who came to the rescue once again as the home side went on to score two more runs than in the first match, finishing on 236 runs. More pressure on the bowlers once again to give their all while the batters have been misfiring. Zimbabwean bowlers have shown to be in good form, restricting their opponents to 156 runs all out to register a 80 runs win. For his 50 runs off 24 deliveries and 4/23 with the ball, Muzarabani was named player of the match. Going into today’s match, a lot is expected with the bat, the star-studded Zimbabwean team should look to bat out their 50 overs and avoid losing wickets in the first powerplay which will give them a good foundation for a good score. They have one job, bat out the 50 overs, should they go in to bat first like the first two matches. The bowlers have shown that they can do the job, it’s now up to the batters to follow suit and give it their all. The third 50-over game is scheduled to start at 9.30am at Harare Sports Club and a good performance will be a crucial confidence booster for the World Cup Qualifiers. The World Cup Qualifiers will see 10 teams competing for the two remaining places at the ICC Men’s Cricket World Cup 2023 in India later in the year. The matches will be staged across four venues in Harare and Bulawayo from 18 June to 9 July. — Follow on Twitter @brandon_malvin.","pubDate":"2023-05-20 22:02:02","image_url":null,"source_id":"sundaynews","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"Man City retain Premier League title after Arsenal lose to Forest","link":"https://timesofindia.indiatimes.com/sports/football/epl/top-stories/manchester-city-retain-premier-league-title-after-arsenal-lose-to-nottingham-forest/articleshow/100386017.cms","keywords":null,"creator":null,"video_url":null,"description":"Defending champions Manchester City were on Saturday confirmed Premier League champions after second-placed Arsenal were beaten 0-1 away at Nottingham Forest. Arsenal needed at least one point to stay mathematically alive in the title race but ended on the losing side against Forest. Arsenal's defeat ensured a fifth title in six seasons for the Pep Guardiola side.","content":"Rajasthan Royals eliminate Punjab Kings to stay alive IPL Top 5: Keepers with the most stumpings IPL: CSK take on DC with an aim at play-off spot The Big Stats of the Champions League 2022-2023 Bowlers with most 4-wicket hauls in IPL history Eye-catching NBA play-off moments IPL : LSG eye back-to-back playoff berth Centuries by the Protea batters in the IPL The 99 curse: Top players who missed a ton by 1 run in IPL Top 5: The oldest cricketers in IPL history","pubDate":"2023-05-20 18:51:23","image_url":null,"source_id":"toi","category":["sports"],"country":["india"],"language":"english"},{"title":"IPL 2023: प्लेऑफ की 3 टीमें पक्की, अब MI और RCB के बीच आखिरी जंग; खुल सकती है राजस्थान की किस्मत!","link":"https://www.indiatv.in/sports/cricket/csk-lsg-gujarat-titans-qualifies-for-ipl-2023-playoffs-rcb-and-mumbai-indians-fight-for-last-place-2023-05-20-962480","keywords":null,"creator":null,"video_url":null,"description":"आईपीएल 2023 के 68 मुकाबलों के बाद अब प्लेऑफ की तीन टीमें पक्की हो चुकी हैं। वहीं आखिरी स्थान के लिए अब आरसीबी और मुंबई इंडियंस के बीच जंग है।","content":"आईपीएल 2023 के 68वें मुकाबले में केकेआर को हराकर लखनऊ सुपर जायंट्स ने भी अपना प्लेऑफ का टिकट पक्का कर लिया है। इसी के साथ अब तीन टीमें अंतिम-4 के लिए तय हो गई हैं और उनकी पोजीशन भी अब तय हो गई हैं। गुजरात टाइटंस टॉप पर है जो अंत तक उसी स्थान पर रहेगी। वहीं सीएसके का भी अब दूसरे स्थान पर रहना तय है। साथ ही लखनऊ सुपर जायंट्स की टीम इस जीत के साथ 17 अंक लेकर तीसरे स्थान पर ही रहेगी। अब चौथे स्थान के लिए टक्कर है आरसीबी और मुंबई इंडियंस के बीच। अगर दोनों टीमें अपना-अपना आखिरी मैच हार जाती हैं तो राजस्थान की किस्मत खुल जाएगी। वहीं अगर मुंबई इंडियंस अपने आखिरी मैच में सनराइजर्स को हरा देती है और आरसीबी उधर गुजरात टाइटंस को हराती है, फिर वहां नेट रनरेट खेल में आ जाएगा। अगर अभी के हिसाब से देखें ते आरसीबी का नेट रनरेट 0.180 है और मुंबई का है -0.128 जो कि आरसीबी से बहुत कम है। इस स्थिति में अगर मुंबई करीबी मुकाबला जीतती है तो जीतकर भी बाहर हो जाएगी। यानी मुंबई को या तो बड़ी जीत की जरूरत है। या फिर अपनी जीत के बाद उसे आरसीबी की हार की कामना करनी पड़ेगी। अगर यह दोनों टीमें हारीं तो राजस्थान के लिए मौका बन जाएगा। राजस्थान की टीम अभी 14 में से 7 मैच जीती है और उसके 14 अंक हैं। वहीं राजस्थान का नेट रनरेट है 0.15 और आरसीबी का नेट रनरेट है 0.18 यानी सिर्फ 0.03 का अंतर है। मुंबई तो माइनस में है। अगर मुंबई और आरसीबी अपना मुकाबला हारती हैं तो उस स्थिति में राजस्थान रॉयल्स प्लेऑफ के लिए क्वालीफाई कर सकती है। यानी अभी यह कहना गलत होगा कि संजू सैमसन की टीम की उम्मीदें खत्म हो गई हैं। इसके अलावा अब यह भी साफ हो गया है कि चेन्नई सुपर किंग्स पॉइंट्स टेबल में दूसरे स्थान पर रहेगी और गुजरात टाइटंस अगर आखिरी मैच आरसीबी से हारती भी है तो भी टॉप पर रहेगी। यानी क्वालीफायर 1 जो कि चेपॉक में 23 मई को खेला जाएगा उसमें चेन्नई सुपर किंग्स का सामना गुजरात टाइटंस से होगा। इस मैच में जीतने वाली टीम फाइनल में जाएगी। वहीं हारने वाली टीम क्वालीफायर 2 में एलिमिनेटर की विजेता टीम से 26 मई को अहमदाबाद के नरेंद्र मोदी स्टेडियम में भिड़ेगी। 28 मई को टूर्नामेंट का फाइनल भी इसी मैदान पर खेला जाएगा।","pubDate":"2023-05-20 18:13:03","image_url":null,"source_id":"indiatv","category":["sports"],"country":["india"],"language":"hindi"},{"title":"धोनी नहीं, ये होनी है, एक नहीं हजारों 'माही' प्लेऑफ में पहुंचे","link":"https://navbharattimes.indiatimes.com/visual-story/cricket/ms-dhoni-csk-qualify-for-ipl-playoffs-2023/photoshow/100382567.cms","keywords":null,"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2023-05-20 14:14:10","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"चेन्नई सुपर किंग्स के ये पांच सूरमा जिसने 16वें सीजन में टीम को प्लेऑफ में पहुंचाया","link":"https://navbharattimes.indiatimes.com/sports/cricket/iplt20/photos/five-players-of-chennai-super-kings-who-take-team-to-playoffs-in-16th-season-of-ipl-ruturaj-gaikwad-devon-conway-ravindra-jadeja-shivam-dube/photoshow/100382887.cms","keywords":null,"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2023-05-20 14:03:27","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Shammi Silva elected uncontested as SLC President","link":"https://srilankamirror.com/sports/shammi-silva-elected-uncontested-as-slc-president/","keywords":["Sports","Cricket","lka","SriLanka"],"creator":["editor"],"video_url":null,"description":"Shammi Silva has been elected uncontested, as the President of Sri Lanka Cricket for the 2023 – 2025. The decision was declared by the Election Committee of Sri Lanka Cricket at the SLC Annual General Meeting currently being held in Colombo. This is Silva’s third term in office as the President of SLC.","content":"Shammi Silva has been elected uncontested, as the President of Sri Lanka Cricket for the 2023 – 2025. The decision was declared by the Election Committee of Sri Lanka Cricket at the SLC Annual General Meeting currently being held in Colombo. This is Silva’s third term in office as the President of SLC.","pubDate":"2023-05-20 14:01:25","image_url":null,"source_id":"srilankamirror","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Banyana looking to follow in the footsteps of SA women’s cricketers at World Cup","link":"https://www.iol.co.za/sport/soccer/banyana/banyana-looking-to-follow-in-the-footsteps-of-sa-womens-cricketers-at-world-cup-9e8d0660-784d-4bef-82c9-21ddd7d10851","keywords":null,"creator":["Mihlali Baleka"],"video_url":null,"description":"The national women’s cricketing team achieved the improbable in the T20 World Cup on home soil in February, reaching the final for the very first time before losing to Australia.","content":null,"pubDate":"2023-05-20 13:49:42","image_url":"https://image-prod.iol.co.za/16x9/800?source=https://xlibris.public.prod.oc.inl.infomaker.io:8443/opencontent/objects/2915821d-4889-53f4-a53a-732f1238264a&operation=CROP&offset=0x36&resize=4152x2332","source_id":"iol","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Chennai Super Kings crush Delhi Capitals to storm into IPL 2023 playoffs","link":"https://www.indiatoday.in/sports/cricket/story/dc-vs-csk-chennai-super-kings-crush-delhi-capitals-to-storm-into-ipl-2023-playoffs-2381975-2023-05-20?utm_source=rss","keywords":null,"creator":null,"video_url":null,"description":"Chennai Super Kings crush Delhi Capitals to storm into IPL 2023 playoffs","content":null,"pubDate":"2023-05-20 13:47:16","image_url":null,"source_id":"indiatoday","category":["sports"],"country":["india"],"language":"english"},{"title":"12वीं बार प्लेऑफ में पहुंची चेन्नई सुपरकिंग्स, धोनी को मिलने जा रही 'शाही विदाई'!","link":"https://navbharattimes.indiatimes.com/sports/cricket/iplt20/news/chennai-super-kings-qualified-for-ipl-2023-playoffs-beat-beat-delhi-capitals-shivam-dube-ruturaj-gaikwad-shines/articleshow/100381895.cms","keywords":null,"creator":null,"video_url":null,"description":"Chennai Super Kings IPL: दिल्ली का होमग्राउंड कोटला पर चेन्नई सुपरकिंग्स और उसके कप्तान महेंद्र सिंह धोनी के चाहने वालों से अटा पड़ा था। धोनी की टीम ने एकबार फिर आईपीएल प्लेऑफ में जगह बना ली है।","content":null,"pubDate":"2023-05-20 13:46:38","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Scotland names squad for qualifiers","link":"https://www.sundaynews.co.zw/scotland-names-squad-for-qualifiers/","keywords":["Sports"],"creator":["Chronicle Editor"],"video_url":null,"description":"Brandon Moyo, Sports Reporter SCOTLAND have announced their 15-member squad that will take part in the upcoming 2023 Men’s Cricket World Cup Qualifiers that will be held in Zimbabwe next month. The European nation made two changes to the squad that won the International Cricket Council (ICC) Cricket World Cup League 2 title in February […]","content":"The Sunday News SCOTLAND have announced their 15-member squad that will take part in the upcoming 2023 Men’s Cricket World Cup Qualifiers that will be held in Zimbabwe next month. The European nation made two changes to the squad that won the International Cricket Council (ICC) Cricket World Cup League 2 title in February which guaranteed them a spot in the upcoming qualifiers. They brought in Alasdair Evans and Adrian Neill to replace Liam Naylor and the retired veteran Kyle Coetzer. Evans will be in line to play his first One Day International (ODI) since 2021 after signing a professional contract with Cricket Scotland for the 2023-2024 season. The World Cup qualifiers are scheduled to begin on 18 June and will be played across four venues in Harare and Bulawayo. In a statement from Cricket Scotland, the team’s interim head coach, Doug Watson said coming to Zimbabwe for the qualifiers is a good opportunity for them and they have a fairly good squad which is a mixture of senior and young players who are not new to the highest level of the game. He added that they will have to quickly adapt to the Zimbabwean conditions which will allow them to play their game. “I think there’s a good mixture in this squad of youth and senior players who’ve been around a while — the likes of Richie and George, as well as some exciting young talent in Jack Jarvis and Chris McBride. It’s obviously a wonderful opportunity coming up in Zimbabwe, and the guys that we’ve selected are all really excited and fizzing to go. “They know how tough the challenge is going to be. It’s moving into winter over there just now, and the conditions are changing, and will be quite spin-friendly, but the key thing will be for us to adapt to the conditions and approach the games the way we want to play them,” said Watson. The Scotland squad will fly to Pretoria in South Africa on 3 June, for a pre-tournament training camp. They will also play two warm up games against Nepal and Netherlands, before travelling on to Zimbabwe. A total of 10 teams are expected to battle it out for the remaining two spots to the World Cup which will be held in India later this year. However, the final fixtures schedule for the Qualifiers is yet to be announced by ICC. Richie Berrington (captain), Matthew Cross, Alasdair Evans, Chris Greaves, Jack Jarvis, Michael Leask, Tom Mackintosh, Chris McBride, Brandon McMullen, George Munsey, Adrian Neill, Safyaan Sharif, Chris Sole, Hamza Tahir, Mark Watt. — Follow on Twitter @brandon_malvin.","pubDate":"2023-05-20 22:03:30","image_url":null,"source_id":"sundaynews","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"Zimbabwe Select’s top order, time to get things right","link":"https://www.sundaynews.co.zw/zimbabwe-selects-top-order-time-to-get-things-right/","keywords":["Sports"],"creator":["Chronicle Editor"],"video_url":null,"description":"Brandon Moyo, Sports Reporter ZIMBABWE Select will go up against Pakistan ‘A’ today in the third one-day match at Harare Sports Club with one goal in mind, making it 3-0. However, a lot has to be done especially with the bat. Going into the match as favorites due to the quality they possess on paper, the […]","content":"The Sunday News ZIMBABWE Select will go up against Pakistan ‘A’ today in the third one-day match at Harare Sports Club with one goal in mind, making it 3-0. However, a lot has to be done especially with the bat. Going into the match as favorites due to the quality they possess on paper, the Zimbabwean top order has a lot to work on as they still look rusty with pressure piling up on them with each passing game. The Wellington Masakadza captained side has failed to bat out their 50 overs in the first two matches, being bowled out in 45,3 overs in the first game and 38,5 overs in the second, something that they will have to correct going into today’s encounter. They have had the time to settle and wipe out the rust in the first two games and it’s now time to go and give out their best as they eye the upcoming World Cup Qualifiers. The top order’s batting displays leave a lot to be desired. Innocent Kaia, Wessly Madhevere, Tadiwanashe Marumani and Craig Ervine have all looked out of touch in the first two games, thus, will have to bring their ‘A’ game. They have not yet performed up to their best, failing to set up a foundation for the middle order. After struggling in the opening match, the woes continued on Friday with the first two wickets falling with just 10 runs on the board. Kaia and Madhevere fell for two and zero runs respectively. It was Ryan Burl, Clive Madande and Blessing Muzarabani who came to the rescue once again as the home side went on to score two more runs than in the first match, finishing on 236 runs. More pressure on the bowlers once again to give their all while the batters have been misfiring. Zimbabwean bowlers have shown to be in good form, restricting their opponents to 156 runs all out to register a 80 runs win. For his 50 runs off 24 deliveries and 4/23 with the ball, Muzarabani was named player of the match. Going into today’s match, a lot is expected with the bat, the star-studded Zimbabwean team should look to bat out their 50 overs and avoid losing wickets in the first powerplay which will give them a good foundation for a good score. They have one job, bat out the 50 overs, should they go in to bat first like the first two matches. The bowlers have shown that they can do the job, it’s now up to the batters to follow suit and give it their all. The third 50-over game is scheduled to start at 9.30am at Harare Sports Club and a good performance will be a crucial confidence booster for the World Cup Qualifiers. The World Cup Qualifiers will see 10 teams competing for the two remaining places at the ICC Men’s Cricket World Cup 2023 in India later in the year. The matches will be staged across four venues in Harare and Bulawayo from 18 June to 9 July. — Follow on Twitter @brandon_malvin.","pubDate":"2023-05-20 22:02:02","image_url":null,"source_id":"sundaynews","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"Man City retain Premier League title after Arsenal lose to Forest","link":"https://timesofindia.indiatimes.com/sports/football/epl/top-stories/manchester-city-retain-premier-league-title-after-arsenal-lose-to-nottingham-forest/articleshow/100386017.cms","keywords":null,"creator":null,"video_url":null,"description":"Defending champions Manchester City were on Saturday confirmed Premier League champions after second-placed Arsenal were beaten 0-1 away at Nottingham Forest. Arsenal needed at least one point to stay mathematically alive in the title race but ended on the losing side against Forest. Arsenal's defeat ensured a fifth title in six seasons for the Pep Guardiola side.","content":"Rajasthan Royals eliminate Punjab Kings to stay alive IPL Top 5: Keepers with the most stumpings IPL: CSK take on DC with an aim at play-off spot The Big Stats of the Champions League 2022-2023 Bowlers with most 4-wicket hauls in IPL history Eye-catching NBA play-off moments IPL : LSG eye back-to-back playoff berth Centuries by the Protea batters in the IPL The 99 curse: Top players who missed a ton by 1 run in IPL Top 5: The oldest cricketers in IPL history","pubDate":"2023-05-20 18:51:23","image_url":null,"source_id":"toi","category":["sports"],"country":["india"],"language":"english"},{"title":"IPL 2023: प्लेऑफ की 3 टीमें पक्की, अब MI और RCB के बीच आखिरी जंग; खुल सकती है राजस्थान की किस्मत!","link":"https://www.indiatv.in/sports/cricket/csk-lsg-gujarat-titans-qualifies-for-ipl-2023-playoffs-rcb-and-mumbai-indians-fight-for-last-place-2023-05-20-962480","keywords":null,"creator":null,"video_url":null,"description":"आईपीएल 2023 के 68 मुकाबलों के बाद अब प्लेऑफ की तीन टीमें पक्की हो चुकी हैं। वहीं आखिरी स्थान के लिए अब आरसीबी और मुंबई इंडियंस के बीच जंग है।","content":"आईपीएल 2023 के 68वें मुकाबले में केकेआर को हराकर लखनऊ सुपर जायंट्स ने भी अपना प्लेऑफ का टिकट पक्का कर लिया है। इसी के साथ अब तीन टीमें अंतिम-4 के लिए तय हो गई हैं और उनकी पोजीशन भी अब तय हो गई हैं। गुजरात टाइटंस टॉप पर है जो अंत तक उसी स्थान पर रहेगी। वहीं सीएसके का भी अब दूसरे स्थान पर रहना तय है। साथ ही लखनऊ सुपर जायंट्स की टीम इस जीत के साथ 17 अंक लेकर तीसरे स्थान पर ही रहेगी। अब चौथे स्थान के लिए टक्कर है आरसीबी और मुंबई इंडियंस के बीच। अगर दोनों टीमें अपना-अपना आखिरी मैच हार जाती हैं तो राजस्थान की किस्मत खुल जाएगी। वहीं अगर मुंबई इंडियंस अपने आखिरी मैच में सनराइजर्स को हरा देती है और आरसीबी उधर गुजरात टाइटंस को हराती है, फिर वहां नेट रनरेट खेल में आ जाएगा। अगर अभी के हिसाब से देखें ते आरसीबी का नेट रनरेट 0.180 है और मुंबई का है -0.128 जो कि आरसीबी से बहुत कम है। इस स्थिति में अगर मुंबई करीबी मुकाबला जीतती है तो जीतकर भी बाहर हो जाएगी। यानी मुंबई को या तो बड़ी जीत की जरूरत है। या फिर अपनी जीत के बाद उसे आरसीबी की हार की कामना करनी पड़ेगी। अगर यह दोनों टीमें हारीं तो राजस्थान के लिए मौका बन जाएगा। राजस्थान की टीम अभी 14 में से 7 मैच जीती है और उसके 14 अंक हैं। वहीं राजस्थान का नेट रनरेट है 0.15 और आरसीबी का नेट रनरेट है 0.18 यानी सिर्फ 0.03 का अंतर है। मुंबई तो माइनस में है। अगर मुंबई और आरसीबी अपना मुकाबला हारती हैं तो उस स्थिति में राजस्थान रॉयल्स प्लेऑफ के लिए क्वालीफाई कर सकती है। यानी अभी यह कहना गलत होगा कि संजू सैमसन की टीम की उम्मीदें खत्म हो गई हैं। इसके अलावा अब यह भी साफ हो गया है कि चेन्नई सुपर किंग्स पॉइंट्स टेबल में दूसरे स्थान पर रहेगी और गुजरात टाइटंस अगर आखिरी मैच आरसीबी से हारती भी है तो भी टॉप पर रहेगी। यानी क्वालीफायर 1 जो कि चेपॉक में 23 मई को खेला जाएगा उसमें चेन्नई सुपर किंग्स का सामना गुजरात टाइटंस से होगा। इस मैच में जीतने वाली टीम फाइनल में जाएगी। वहीं हारने वाली टीम क्वालीफायर 2 में एलिमिनेटर की विजेता टीम से 26 मई को अहमदाबाद के नरेंद्र मोदी स्टेडियम में भिड़ेगी। 28 मई को टूर्नामेंट का फाइनल भी इसी मैदान पर खेला जाएगा।","pubDate":"2023-05-20 18:13:03","image_url":null,"source_id":"indiatv","category":["sports"],"country":["india"],"language":"hindi"},{"title":"धोनी नहीं, ये होनी है, एक नहीं हजारों 'माही' प्लेऑफ में पहुंचे","link":"https://navbharattimes.indiatimes.com/visual-story/cricket/ms-dhoni-csk-qualify-for-ipl-playoffs-2023/photoshow/100382567.cms","keywords":null,"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2023-05-20 14:14:10","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"चेन्नई सुपर किंग्स के ये पांच सूरमा जिसने 16वें सीजन में टीम को प्लेऑफ में पहुंचाया","link":"https://navbharattimes.indiatimes.com/sports/cricket/iplt20/photos/five-players-of-chennai-super-kings-who-take-team-to-playoffs-in-16th-season-of-ipl-ruturaj-gaikwad-devon-conway-ravindra-jadeja-shivam-dube/photoshow/100382887.cms","keywords":null,"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2023-05-20 14:03:27","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Shammi Silva elected uncontested as SLC President","link":"https://srilankamirror.com/sports/shammi-silva-elected-uncontested-as-slc-president/","keywords":["Sports","Cricket","lka","SriLanka"],"creator":["editor"],"video_url":null,"description":"Shammi Silva has been elected uncontested, as the President of Sri Lanka Cricket for the 2023 – 2025. The decision was declared by the Election Committee of Sri Lanka Cricket at the SLC Annual General Meeting currently being held in Colombo. This is Silva’s third term in office as the President of SLC.","content":"Shammi Silva has been elected uncontested, as the President of Sri Lanka Cricket for the 2023 – 2025. The decision was declared by the Election Committee of Sri Lanka Cricket at the SLC Annual General Meeting currently being held in Colombo. This is Silva’s third term in office as the President of SLC.","pubDate":"2023-05-20 14:01:25","image_url":null,"source_id":"srilankamirror","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Banyana looking to follow in the footsteps of SA women’s cricketers at World Cup","link":"https://www.iol.co.za/sport/soccer/banyana/banyana-looking-to-follow-in-the-footsteps-of-sa-womens-cricketers-at-world-cup-9e8d0660-784d-4bef-82c9-21ddd7d10851","keywords":null,"creator":["Mihlali Baleka"],"video_url":null,"description":"The national women’s cricketing team achieved the improbable in the T20 World Cup on home soil in February, reaching the final for the very first time before losing to Australia.","content":null,"pubDate":"2023-05-20 13:49:42","image_url":"https://image-prod.iol.co.za/16x9/800?source=https://xlibris.public.prod.oc.inl.infomaker.io:8443/opencontent/objects/2915821d-4889-53f4-a53a-732f1238264a&operation=CROP&offset=0x36&resize=4152x2332","source_id":"iol","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Chennai Super Kings crush Delhi Capitals to storm into IPL 2023 playoffs","link":"https://www.indiatoday.in/sports/cricket/story/dc-vs-csk-chennai-super-kings-crush-delhi-capitals-to-storm-into-ipl-2023-playoffs-2381975-2023-05-20?utm_source=rss","keywords":null,"creator":null,"video_url":null,"description":"Chennai Super Kings crush Delhi Capitals to storm into IPL 2023 playoffs","content":null,"pubDate":"2023-05-20 13:47:16","image_url":null,"source_id":"indiatoday","category":["sports"],"country":["india"],"language":"english"},{"title":"12वीं बार प्लेऑफ में पहुंची चेन्नई सुपरकिंग्स, धोनी को मिलने जा रही 'शाही विदाई'!","link":"https://navbharattimes.indiatimes.com/sports/cricket/iplt20/news/chennai-super-kings-qualified-for-ipl-2023-playoffs-beat-beat-delhi-capitals-shivam-dube-ruturaj-gaikwad-shines/articleshow/100381895.cms","keywords":null,"creator":null,"video_url":null,"description":"Chennai Super Kings IPL: दिल्ली का होमग्राउंड कोटला पर चेन्नई सुपरकिंग्स और उसके कप्तान महेंद्र सिंह धोनी के चाहने वालों से अटा पड़ा था। धोनी की टीम ने एकबार फिर आईपीएल प्लेऑफ में जगह बना ली है।","content":null,"pubDate":"2023-05-20 13:46:38","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"}]}