{"newsArray":[{"title":"NZ-W vs SA-W Dream11 Team Prediction, Fantasy Cricket Hints: Captain, Probable Playing 11s, Team News; Injury Updates For Today’s NZ-W vs SA-W ODI World Cup Match at Seddon Park, Hamilton 6:30 AM IST March 17","link":"https://zeenews.india.com/cricket/nz-w-vs-sa-w-dream11-team-prediction-fantasy-cricket-hints-captain-probable-playing-11s-team-news-injury-updates-for-today-s-nz-w-vs-sa-w-odi-world-cup-match-at-seddon-park-hamilton-630-am-ist-march-17-2445868.html","keywords":null,"creator":null,"video_url":null,"description":"New Zealand Women vs South Africa Women Dream11 Team Prediction New Zealand Women vs South Africa Women ICC Women's World Cup ODI- Check My Dream11 Team, Best players list of NZ-W vs SA-W, New Zealand women Dream11 Team Player List, South Africa women Dream11 Team Player List, Dream11 Guru Tips, Fantasy Cricket Tips, Fantasy Cricket Tips, Fantasy Playing Tips.","content":null,"pubDate":"2022-03-16 23:30:00","full_description":"New Zealand will take on South Africa in Match no 16 of the ICC Women's World Cup 2022. The match will take place at Seddon Park in Hamilton. SA are coming into the game with good win over England in their last encounter. They have been unbeaten in the tournament. On the other hand, New Zealand women have blown hot and cold in the tournament. They have lost two games and won two as well so far. NZ-W vs SA-W Match Details The match between NZ-W vs SA-W will be hosted at the Seddon Park, Hamilton at 6:30 am IST on March 17, Thursday. NZ-W vs SA-W Dream11 Team Prediction Captain: Lea Tahuhu Vice-Captain: Sophie Devine Suggested Playing XI for NZ-W vs SA-W Dream11 Fantasy Cricket Wicketkeeper: Katey Martin Batters: Suzie Bates, Amy Satterthwaite, Laura Wolvaardt All-rounders: Lea Tahuhu, Sophie Devine, Marizanne Kapp, Amelia Kerr Bowlers: Shabnim Ismail, Jess Kerr, Ayabonga Khaka New Zealand Women vs South Africa Women possible starting XI New Zealand Probable XI: Suzie Bates, Sophie Devine (c), Amelia Kerr, Amy Satterthwaite, Maddy Green, Katey Martin (wk), Hayley Jensen, Lea Tahuhu, Jess Kerr, Frances Mackay, Hannah Rowe South Africa Probable XI: Lizelle Lee, Laura Wolvaardt, Tazmin Brits, Sune Luus (c), Mignon du Preez, Marizanne Kapp, Chloe Tryon, Trisha Chetty (wk), Shabnim Ismail, Masabata Klaas, Ayabonga Khaka","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"800 expected to farewell Rod Marsh at Adelaide Oval","link":"https://www.cairnspost.com.au/news/south-australia/rod-marsh-to-be-farewelled-at-state-funeral-at-adelaide-oval/news-story/c1a6469b2cb19430c2488812853036e1","keywords":["Cricket news and galleries","News"],"creator":null,"video_url":null,"description":"Test cricket legend Rod Marsh will be farewelled in a state funeral at Adelaide Oval this morning.","content":null,"pubDate":"2022-03-16 21:41:00","full_description":null,"image_url":null,"source_id":"cairnspost","country":["australia"],"category":["sports"],"language":"english"},{"title":"Aussies and Pakistan settle for second draw","link":"https://www.cairnspost.com.au/sport/cricket/aussies-and-pakistan-settle-for-second-draw/video/51d0b8629f157e049b41de2598dba27b","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket: Despite a valiant effort by both teams on the final day to snatch a result, ultimately there was just not quite enough time and it ended in a draw.","content":null,"pubDate":"2022-03-16 21:00:26","full_description":null,"image_url":null,"source_id":"cairnspost","country":["australia"],"category":["sports"],"language":"english"},{"title":"Hundred draft put back over Warne funeral","link":"https://www.perthnow.com.au/sport/cricket/hundred-draft-put-back-over-warne-funeral-c-6086978","keywords":null,"creator":["AAP"],"video_url":null,"description":"English cricket's The Hundred competition has put back its draft to April 5, a week later than planned out of respect for Shane Warne's state funeral.","content":null,"pubDate":"2022-03-16 19:41:29","full_description":"The men's draft picks and new women's signings for English cricket's The Hundred competition have been put back until on April 5, a week later than planned, out of English cricket's respect for Shane Warne's state funeral. Warne, who died aged 52 on March 4, was head coach of London Spirit's men's side for the inaugural competition last season. His funeral will take place on March 30, with the draft pushed back to avoid taking place on the same date. \"Shane was a much loved part of The Hundred and played an important role in launching the competition as head coach of London Spirit's men's team,\" a statement from the competition on Wednesday read. \"He will be hugely missed by everyone involved in the competition.\" The second season of the 100-ball tournament begins on August 3 with defending men's champions Southern Brave hosting Welsh Fire. Spirit will get the first men's draft pick to fill the remaining slots in their squad due to their bottom-place finish in 2021. The overseas market is likely to be popular in next month's draft, with several big-name players set to be in the offing, although the international schedule may ultimately dictate availability. For the first time, both men's and women's sides will be able to select an additional fourth overseas player in a wildcard draft in June - although teams will still only be able to field three overseas players in their XI.","image_url":"https://images.perthnow.com.au/publication/C-6086978/5f7122212c5beba96adf5e2ecc5143eb9ce55add-16x9-x0y0w1280h720.jpg","source_id":"perthnow","country":["australia"],"category":["sports"],"language":"english"},{"title":"Hundred draft put back over Warne funeral","link":"https://thewest.com.au/sport/cricket/hundred-draft-put-back-over-warne-funeral-c-6086969","keywords":null,"creator":["AAP"],"video_url":null,"description":"English cricket's The Hundred competition has put back its draft to April 5, a week later than planned out of respect for Shane Warne's state funeral.","content":null,"pubDate":"2022-03-16 19:40:59","full_description":"The men's draft picks and new women's signings for English cricket's The Hundred competition have been put back until on April 5, a week later than planned, out of English cricket's respect for Shane Warne's state funeral. Warne, who died aged 52 on March 4, was head coach of London Spirit's men's side for the inaugural competition last season. His funeral will take place on March 30, with the draft pushed back to avoid taking place on the same date. \"Shane was a much loved part of The Hundred and played an important role in launching the competition as head coach of London Spirit's men's team,\" a statement from the competition on Wednesday read. \"He will be hugely missed by everyone involved in the competition.\" The second season of the 100-ball tournament begins on August 3 with defending men's champions Southern Brave hosting Welsh Fire. Spirit will get the first men's draft pick to fill the remaining slots in their squad due to their bottom-place finish in 2021. The overseas market is likely to be popular in next month's draft, with several big-name players set to be in the offing, although the international schedule may ultimately dictate availability. For the first time, both men's and women's sides will be able to select an additional fourth overseas player in a wildcard draft in June - although teams will still only be able to field three overseas players in their XI.","image_url":"https://images.thewest.com.au/publication/C-6086969/5f7122212c5beba96adf5e2ecc5143eb9ce55add-16x9-x0y0w1280h720.jpg","source_id":"thewest","country":["australia"],"category":["sports"],"language":"english"},{"title":"IPL time table 2022 Pune stadium: List of IPL 2022 matches at MCA Stadium in Pune","link":"https://thesportsrush.com/cricket-news-ipl-time-table-2022-pune-stadium-list-of-ipl-2022-matches-at-mca-stadium-in-pune/","keywords":["Cricket","IPL 2022","Indian Premier League","IPL"],"creator":["Gurpreet Singh"],"video_url":null,"description":"IPL time table 2022 Pune stadium: The Maharashtra Cricket Association stadium is one of the four venues for the upcoming season of the IPL. The 15th season of the Indian Premier League (IPL) is mere ten days away from the commencement with the opening encounter to take place between previous season finalists Chennai Super Kings… The post IPL time table 2022 Pune stadium: List of IPL 2022 matches at MCA Stadium in Pune appeared first on The SportsRush.","content":"IPL time table 2022 Pune stadium: The Maharashtra Cricket Association stadium is one of the four venues for the upcoming season of the IPL. The 15th season of the Indian Premier League (IPL) is mere ten days away from the commencement with the opening encounter to take place between previous season finalists Chennai Super Kings (CSK) and Kolkata Knight Riders (KKR) at the iconic Wankhede Stadium in Mumbai on March 26. With the country witnessing a sharp fall in the daily number of COVID-19 cases, the BCCI, while deciding to go forward to conduct the imminent edition in India itself, has only zeroed upon four stadiums across two neighboring cities in Mumbai and Pune to host the league phase of the tournament. While the Wankhede Stadium (20), DY Patil Stadium (20), and the Brabourne Stadium (15) – all in Mumbai, would host 55 league matches, Pune’s MCA Stadium would host 15 league matches to complete the 70 matches during the league phase. All the ten teams would play 4 matches each at the Wankhede Stadium and DY Patil stadium, while 3 matches each at the Brabourne Stadium and the MCA International stadium. IPL time table 2022 Pune stadium March 29 – Sunrisers Hyderabad vs. Rajasthan Royals; 7:30 pm onwards April 2 – Gujarat Titans vs. Delhi Capitals; 7:30 pm onwards April 6 – Kolkata Knight Riders vs. Mumbai Indians; 7:30 pm onwards April 9 – Royal Challengers Bangalore vs. Mumbai Indians; 7:30 pm onwards April 13 – Mumbai Indians vs. Punjab Kings; 7:30 pm onwards April 17 – Gujarat Titans vs. Chennai Super Kings; 7:30 pm onwards April 20 – Delhi Capitals vs. Punjab Kings; 7:30 pm onwards April 22 – Delhi Capitals vs. Rajasthan Royals; 7:30 pm onwards April 26 – Royal Challengers Bangalore vs. Rajasthan Royals; 7:30 pm onwards April 29 – Punjab Kings vs. Lucknow Super Giants; 7:30 pm onwards May 1 – Sunrisers Hyderabad vs. Chennai Super Kings; 7:30 pm onwards May 4 – Royal Challengers Bangalore vs. Chennai Super Kings; 7:30 pm onwards May 7 – Lucknow Super Giants vs. Kolkata Knight Riders; 7:30 pm onwards May 10 – Lucknow Super Giants vs. Gujarat Titans; 7:30 pm onwards May 14 – Kolkata Knight Riders vs. Sunrisers Hyderabad; 7:30 pm onwards. The post IPL time table 2022 Pune stadium: List of IPL 2022 matches at MCA Stadium in Pune appeared first on The SportsRush.","pubDate":"2022-03-16 18:53:27","full_description":"IPL time table 2022 Pune stadium: The Maharashtra Cricket Association stadium is one of the four venues for the upcoming season of the IPL. The 15th season of the Indian Premier League (IPL) is mere ten days away from the commencement with the opening encounter to take place between previous season finalists Chennai Super Kings (CSK) and Kolkata Knight Riders (KKR) at the iconic Wankhede Stadium in Mumbai on March 26. With the country witnessing a sharp fall in the daily number of COVID-19 cases, the BCCI, while deciding to go forward to conduct the imminent edition in India itself, has only zeroed upon four stadiums across two neighboring cities in Mumbai and Pune to host the league phase of the tournament. While the Wankhede Stadium (20), DY Patil Stadium (20), and the Brabourne Stadium (15) – all in Mumbai, would host 55 league matches, Pune’s MCA Stadium would host 15 league matches to complete the 70 matches during the league phase. All the ten teams would play 4 matches each at the Wankhede Stadium and DY Patil stadium, while 3 matches each at the Brabourne Stadium and the MCA International stadium. March 29 – Sunrisers Hyderabad vs. Rajasthan Royals; 7:30 pm onwards April 2 – Gujarat Titans vs. Delhi Capitals; 7:30 pm onwards April 6 – Kolkata Knight Riders vs. Mumbai Indians; 7:30 pm onwards April 9 – Royal Challengers Bangalore vs. Mumbai Indians; 7:30 pm onwards April 13 – Mumbai Indians vs. Punjab Kings; 7:30 pm onwards April 17 – Gujarat Titans vs. Chennai Super Kings; 7:30 pm onwards April 20 – Delhi Capitals vs. Punjab Kings; 7:30 pm onwards April 22 – Delhi Capitals vs. Rajasthan Royals; 7:30 pm onwards April 26 – Royal Challengers Bangalore vs. Rajasthan Royals; 7:30 pm onwards April 29 – Punjab Kings vs. Lucknow Super Giants; 7:30 pm onwards May 1 – Sunrisers Hyderabad vs. Chennai Super Kings; 7:30 pm onwards May 4 – Royal Challengers Bangalore vs. Chennai Super Kings; 7:30 pm onwards May 7 – Lucknow Super Giants vs. Kolkata Knight Riders; 7:30 pm onwards May 10 – Lucknow Super Giants vs. Gujarat Titans; 7:30 pm onwards May 14 – Kolkata Knight Riders vs. Sunrisers Hyderabad; 7:30 pm onwards.","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Harsh awakening for debut spinner as Khawaja lets perfect Test slip: Player ratings","link":"https://www.foxsports.com.au/cricket/australia/australia-vs-pakistan-cricket-scores-2022-second-test-player-ratings-wickets-mitchell-swepson-debut-nathan-lyon-usman-khawaja/news-story/2c94121a05f07e336b1f93263dd80366","keywords":null,"creator":null,"video_url":null,"description":"Pakistan has pulled off a cricket miracle, surviving 172 overs in Karachi to escape with a draw in the second Test against Australia.","content":null,"pubDate":"2022-03-16 18:53:00","full_description":"Pakistan has pulled off a cricket miracle , surviving 172 overs in Karachi to escape with a draw in the second Test against Australia. After a dominant display with that bat, Australia will be cursing its inability to capitalise in the field as Pakistan seized the series’ momentum. Here’s how every Australian rated in the second Test against Pakistan. ‘SIMPLY AMAZING’: Aussie curse strikes again as Pakistan completes miracle escape Watch Australia’s Tour of Pakistan on Kayo. Every Test, ODI and T20 Live & On-Demand. New to Kayo? Try 14-Days Free Now > DAVID WARNER — 3.5 36 and 7 Played aggressively from the onset to get the Aussies off to a flyer, but there was not much to speak of after that. He was stopped in his tracks on 36 in the first innings with a peach from the returning Faheem Ashraf. Only seven runs in the second innings but we can’t be too harsh about that as Warner effectively sacrificed himself for the cause while chasing quicks runs to set up an early declaration. USMAN KHAWAJA — 9 160 and 44* Another cracker of a Test for the left-hander with the bat. Khawaja has forged himself a reputation as a low-track specialist and it’s easy to see why with performances like these. Fresh off his 97 in the first Test, Khawaja made amends for not reaching three figures by scoring a daddy century in the first innings. His 160 led the way to Australia’s mammoth first innings total of 556 to set up the historic victory in Karachi. He did a fine job in the second innings too by scoring an unbeaten 44 to set up the declaration. Khawaja is now averaging 111.20 since returning to Australia’s Test XI in January. He had a perfect 10/10 right up until he dropped Mohammad Rizwan with three overs to go. It was Australia’s last chance at victory, so it was a hefty error. Khawaja tons up in DREAM homecoming | 02:27 MARNUS LABUSCHAGNE — 4 0 and 44 Took on a risky single that was never there in the first innings and paid a heavy price. The duck is just the second of his Test career, with his first coming in his debut match against Pakistan as well. Needless to say, he misses out on plenty of marks for the brief nine-ball stay at the crease when a mountain of runs were on offer. But he salvaged a respectable score by making 44 off just 49 balls in the second innings. His dismissal was a little unlucky too with the ball staying low to creep under the bat. He also picks up a point for a brilliant run-out of Hasan Ali. Loses a half-mark for dropping Babar Azam at bat-pad the ball after Travis Head did the same. It was a tough chance, though. STEVE SMITH — 5.5 72 More promising signs for the Australian No.4 but still no century. For the second time in as many Tests, Smith looked firmly on-track to end the drought but was undone in the seventies. This time, he was just seven balls away from day one stumps when Faheem pulled off a stunning one-hander at second slip to dismiss Smith. Smith needs to be penalised heavily in the rankings, however, for a shocker in the field. He missed two chances in the first innings before dropping a regulation catch off Abdullah Shafique that allowed his partnership with Babar Azam to thrive and play a massive role in saving the Test. Australia's Steve Smith after scoring his half century. Source: AFP TRAVIS HEAD — 2 23 It’s just not happening so far this series for Travis Head, albeit from limited chances with the bat. Head played all around one to Sajid Khan and his review came back as umpire’s call with ball-tracking just clipping leg. Australia was cruising at 4-347 at the time so it wasn’t a costly dismissal, but the left-hander will be eager to at least find some time at the crease to gain experience in the subcontinent before the series is done. Loses anoter half-mark for dropping Babar Azam when he was on 161, but it was also a sharp chance at bat-pad, similar to Labuschagne. CAMERON GREEN — 5 28 1-23 and 1-32 Green also failed to make an impact with the bat in a defensive display against Pakistan’s spinners. The all-rounder was kicking balls away before suddenly Nauman Ali found some extra spin. Green cautiously prodded but missed to see his off stump pegged back. He contributed well with the ball, accelerating Pakistan’s slide in the first innings by dismissing Faheem Ashraf, while his bouncer that didn’t bouncer dismissed a stubborn Azhar Ali in the second innings. Didn’t play a major role on the final day with Australia’s spinners carrying the workload. ALEX CAREY — 8 93 Three dismissals That was more like it from the wicketkeeper. Firstly, with the bat; this was Carey’s highest score in Test cricket that will relieve some pressure from the selectors. His 93 wasn’t a masterpiece but he played the spin well. Having swept, and reverse swept so well all innings, it was ironic that he botched the shot against batter Babar Azam of all people to end his hopes of a maiden Test ton. On the weight of his 159-ball innings, however, it was a strong display. He was also vastly improved with the gloves in Karachi where he was called on to save countless tricky deliveries that either kept low or swung down the leg side. Carey falls JUST short of maiden ton | 02:02 MITCHELL STARC — 6 3-29 and 0-58 With one spell on day three, Mitchell Starc blew the Test match wide open. He was Australia’s chief destroyer in the first innings, making the most of some handy reverse swing to obliterate the hosts. At one point, he was on a hat-trick, while he finished with 3-29 as Australia rolled Pakistan for 148. He couldn’t replicate that magic in short spells in the second innings, however, and went wicketless. Aussies claim all 10 wickets in a day! | 02:44 PAT CUMMINS — 5.5 1-39 and 2-75 Starc claimed the rewards but Cummins was also dangerous in that first innings with the Aussie quicks finding plenty of reverse swing. His ball to dismiss Mohammad Rizwan was a beauty that effectively opened up the tail for Australia to roll through. He also made a key breakthrough just before lunch on day five with another peach to Abdullah Shafique who was on 96. His captaincy was heavily under the microscope all Test with a number of big decisions to make to try and force a result. His decision to not enforce the follow-on will come back into sharp focus after Pakistan escaped with a draw. To be fair to him, 172 overs is normally enough time to take 10 wickets — and it would have been if not for a couple costly drops. NATHAN LYON — 8 1-13 and 4-112 Until late, it appeared that Lyon was once again going to struggle to take more than one or two wickets while hunting a result on day five. As reward for his persistence, he dismissed Babar Azam and Faheem Ashraf on consecutive balls late in the game to put an Australian win back on the table. In the end, it was too little too late. The story could have been different had he not been cruelled by the umpire’s call on an lbw decision earlier in the day. All in all, Lyon bowled well this Test, which included removing opener Imam-ul-Haq twice to gain early inroads for his side. MITCHELL SWEPSON — 4.5 2-32 and 0-156 In truth, the figures probably don’t tell the full story. Swepson toiled away alongside Lyon on day five for no reward. There were a number of near misses while he was also burned by the umpire’s call on an lbw decision that could have gone the other way. Nonetheless, he also struggled with his lengths at times, serving up several full tosses to Babar Azam who needed no invitation to send to the boundary. Australia sorely needed wickets from him on day five but none came, although Head and Labuschagne did put down tough catches at bat-pad off his bowling. Swepson claims first Test wicket! | 00:49","image_url":null,"source_id":"foxsports","country":["australia"],"category":["sports"],"language":"english"},{"title":"Bunbury’s Jayden Goodwin wins first Premier Cricket flag for Subiaco-Floreat in dramatic finish at the WACA","link":"https://thewest.com.au/news/south-western-times/bunburys-jayden-goodwin-wins-first-premier-cricket-flag-for-subiaco-floreat-in-dramatic-finish-at-the-waca--c-6077791","keywords":null,"creator":["Jackson Barrett"],"video_url":null,"description":"Bunbury star Jayden Goodwin has won his maiden first-grade premiership at the Premier Cricket club his father Murray once captained.","content":null,"pubDate":"2022-03-16 18:00:00","full_description":null,"image_url":"https://images.thewest.com.au/publication/C-6077791/2f975e7529f33a6bc07b40cb4d2aa7ffb705cd64-16x9-x0y187w2037h1146.jpg","source_id":"thewest","country":["australia"],"category":["sports"],"language":"english"},{"title":"BDCA awards: Eaton’s Julian Crudeli named Cricketer of the Year, takes home five awards","link":"https://thewest.com.au/news/south-western-times/bdca-awards-eatons-julian-crudeli-named-cricketer-of-the-year-takes-home-five-awards-c-6059558","keywords":null,"creator":["Carly Laden"],"video_url":null,"description":"Despite a heartbreaking grand final result, Eaton’s Julian Crudeli has pulled off an award sweep, including being named the Bunbury & Districts Cricket Association’s Cricketer of the Year.","content":null,"pubDate":"2022-03-16 18:00:00","full_description":null,"image_url":"https://images.thewest.com.au/publication/C-6059558/496f86f3a65b3b3b1265a790cfae22360846ec75-16x9-x0y248w3234h1819.jpg","source_id":"thewest","country":["australia"],"category":["sports"],"language":"english"},{"title":"Broomehill first team into grand final after semifinals washout in Great Southern Cricket Association","link":"https://thewest.com.au/news/great-southern-herald/broomehill-first-team-into-grand-final-after-semifinals-washout-in-great-southern-cricket-association-c-6059482","keywords":null,"creator":["Cameron Newbold"],"video_url":null,"description":"Two semifinals between the top four sides were set to be played on Saturday but heavy rain fell in the region that morning, forcing both games to be abandoned.","content":null,"pubDate":"2022-03-16 18:00:00","full_description":null,"image_url":"https://images.thewest.com.au/publication/C-6059482/a46361325453a893779319f32205c397cd429f30-16x9-x0y192w2048h1152.jpg","source_id":"thewest","country":["australia"],"category":["sports"],"language":"english"},{"title":"Pakistan pull off draw after Babar hits ton","link":"https://www.thehansindia.com/sports/cricket/pakistan-pull-off-draw-after-babar-hits-ton-733693","keywords":["Sports,Today NewsPaper,Cricket"],"creator":["The Hans India"],"video_url":null,"description":"Skipper Babar Azam produced a career-best 196 under immense pressure as Pakistan snatched draw from the jaws of defeat in the second Test against Australia on Wednesday.","content":"Karachi: Skipper Babar Azam produced a career-best 196 under immense pressure as Pakistan snatched draw from the jaws of defeat in the second Test against Australia on Wednesday. Chasing a record 506 for an improbable win, Pakistan's best bet was to bat out the final day and Babar led by example as they finished on 443-7, the sixth highest fourth innings total of all time. Babar's majestic knock, which included 21 fours and a six, will be an inspiration for his team heading into the third and final Test in Lahore on Monday. The hosts were on the back foot after folding for 148 in reply to Australia's massive first innings total of 556-9 at the National Stadium. The record victory target was never within Pakistan's reach but Babar's marathon 228-run partnership with opener Abdullah Shafique (96) kept them afloat in the contest. Nathan Lyon (4-112) injected fresh drama in the final session dismissing Babar and Faheem Ashraf with successive deliveries but Mohammad Rizwan's unbeaten 104 helped Pakistan salvage a draw. The opening Test in Rawalpindi had also ended in a draw. Earlier, Australia began the final day needing eight wickets to go 1-0 up in the three-Test series. Pakistan, on the other hand, required 314 runs in 90 overs to pull off Test cricket's greatest chase or, alternatively, bat out three sessions to force a draw. A burgeoning third wicket stand between Babar Azam and Abdullah Shafique had kept Pakistan in the contest and the duo continued to frustrate Australia when play resumed. Mitchell Starc and Pat Cummins could not make early inroads with the new ball and Babar greeted Mitchell Swepson with back-to-back fours when the leg spinner was introduced into the attack. Abdullah and Babar batted together for nearly 87 overs in a spectacular rear-guard before Cummins broke the 228-run stand in the penultimate over before lunch. The Australia captain induced Abdullah into a drive and Steve Smith, who had dropped the opener on 20 on Tuesday, took a waist-high catch at slip to complete the dismissal. Abdullah hit six fours and a six during his 305-ball vigil. Cummins struck again after lunch when he removed Fawad Alam caught behind for nine. Babar duly completed 150, his first in Test cricket, and the celebration was muted considering the task at hand. ","pubDate":"2022-03-16 17:45:33","full_description":"Karachi: Skipper Babar Azam produced a career-best 196 under immense pressure as Pakistan snatched draw from the jaws of defeat in the second Test against Australia on Wednesday. Chasing a record 506 for an improbable win, Pakistan's best bet was to bat out the final day and Babar led by example as they finished on 443-7, the sixth highest fourth innings total of all time. Babar's majestic knock, which included 21 fours and a six, will be an inspiration for his team heading into the third and final Test in Lahore on Monday. The hosts were on the back foot after folding for 148 in reply to Australia's massive first innings total of 556-9 at the National Stadium. The record victory target was never within Pakistan's reach but Babar's marathon 228-run partnership with opener Abdullah Shafique (96) kept them afloat in the contest. Nathan Lyon (4-112) injected fresh drama in the final session dismissing Babar and Faheem Ashraf with successive deliveries but Mohammad Rizwan's unbeaten 104 helped Pakistan salvage a draw. The opening Test in Rawalpindi had also ended in a draw. Earlier, Australia began the final day needing eight wickets to go 1-0 up in the three-Test series. Pakistan, on the other hand, required 314 runs in 90 overs to pull off Test cricket's greatest chase or, alternatively, bat out three sessions to force a draw. A burgeoning third wicket stand between Babar Azam and Abdullah Shafique had kept Pakistan in the contest and the duo continued to frustrate Australia when play resumed. Mitchell Starc and Pat Cummins could not make early inroads with the new ball and Babar greeted Mitchell Swepson with back-to-back fours when the leg spinner was introduced into the attack. Abdullah and Babar batted together for nearly 87 overs in a spectacular rear-guard before Cummins broke the 228-run stand in the penultimate over before lunch. The Australia captain induced Abdullah into a drive and Steve Smith, who had dropped the opener on 20 on Tuesday, took a waist-high catch at slip to complete the dismissal. Abdullah hit six fours and a six during his 305-ball vigil. Cummins struck again after lunch when he removed Fawad Alam caught behind for nine. Babar duly completed 150, his first in Test cricket, and the celebration was muted considering the task at hand.","image_url":"https://assets.thehansindia.com/h-upload/2022/03/16/500x300_1282070-babar-azam.jpg","source_id":"thehansindia","country":["india"],"category":["sports"],"language":"english"},{"title":"“He is some player”: Ian Bishop lauds Babar Azam after his stellar 4th innings knock during Pakistan vs Australia Karachi Test","link":"https://thesportsrush.com/cricket-news-he-is-some-player-ian-bishop-lauds-babar-azam-after-his-stellar-4th-innings-knock-during-pakistan-vs-australia-karachi-test/","keywords":["Cricket","Australia tour of Pakistan 2022","babar azam","Ian Bishop"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Ian Bishop lauds Babar Azam after latter played a marathon of an innings for Pakistan on Day 5 of the second Test match against Australia. A glance at the usual report of the second Test match of the ongoing Australia’s historic tour of Pakistan in Karachi would term Pakistan skipper Babar Azam as unlucky for… The post “He is some player”: Ian Bishop lauds Babar Azam after his stellar 4th innings knock during Pakistan vs Australia Karachi Test appeared first on The SportsRush.","content":"Ian Bishop lauds Babar Azam after latter played a marathon of an innings for Pakistan on Day 5 of the second Test match against Australia. A glance at the usual report of the second Test match of the ongoing Australia’s historic tour of Pakistan in Karachi would term Pakistan skipper Babar Azam as unlucky for missing out on an opportunity to score his maiden double century in Tests. However, coming into bat post Lunch on Day 4 with the scorecard reading 21/2, and with around 150 Overs yet to be bowled, Azam (196) stood his ground and kept batting and batting defiantly to play out as many as 425 deliveries on a track which had developed cracks, led to formation of roughs for the spinner, and had variable bounce – enough for the Australian bowlers to naturally expect batters to commit an error with the amount of time left in the match. But Azam and Abdullah Shafique (96) together batted a mind-boggling 137 Overs, as their 228-run partnership laid a foundation for the batters to even think of going for the chase at one point in time (as stated by Mohammad Rizwan post the match). Eventually, a late, spirited comeback by the Aussies during the final session, meant that Pakistan posted 443/7 in 171 Overs to register a famous Draw, while also entering into the record books. Ian Bishop lauds Babar Azam West Indies’ legendary pacer-turned commentator Ian Bishop took to his social media handle to heap praise on the Pakistani skipper, who became only the 4th batter in history of Test Cricket to face more than 400 deliveries during the fourth innings of a Test. While admitting to have watched him bat a bit, Bishop hailed Babar’s masterclass of an innings, while hoping that he goes on to dominate this decade with the bat. Watched a bit of the Babar Azam Master class this morning. He is some player, as we’ve know for a while. Here’s to hoping he goes on to dominate this decade as others have before him. — Ian Raphael Bishop (@irbishi) March 16, 2022 While this was the 27-year-old’s sixth century and his highest score in Test career so far, the batter from Lahore also struck the highest fourth-innings score by a captain in the longest format of the game. While the Pakistani batters merely fell 63 runs short of the seemingly improbable target, they batted out the fifth-most Overs ever during the fourth innings of a Test. The post “He is some player”: Ian Bishop lauds Babar Azam after his stellar 4th innings knock during Pakistan vs Australia Karachi Test appeared first on The SportsRush.","pubDate":"2022-03-16 17:43:49","full_description":"Ian Bishop lauds Babar Azam after latter played a marathon of an innings for Pakistan on Day 5 of the second Test match against Australia. A glance at the usual report of the second Test match of the ongoing Australia’s historic tour of Pakistan in Karachi would term Pakistan skipper Babar Azam as unlucky for missing out on an opportunity to score his maiden double century in Tests. However, coming into bat post Lunch on Day 4 with the scorecard reading 21/2, and with around 150 Overs yet to be bowled, Azam (196) stood his ground and kept batting and batting defiantly to play out as many as 425 deliveries on a track which had developed cracks, led to formation of roughs for the spinner, and had variable bounce – enough for the Australian bowlers to naturally expect batters to commit an error with the amount of time left in the match. But Azam and Abdullah Shafique (96) together batted a mind-boggling 137 Overs, as their 228-run partnership laid a foundation for the batters to even think of going for the chase at one point in time (as stated by Mohammad Rizwan post the match). Eventually, a late, spirited comeback by the Aussies during the final session, meant that Pakistan posted 443/7 in 171 Overs to register a famous Draw, while also entering into the record books. West Indies’ legendary pacer-turned commentator Ian Bishop took to his social media handle to heap praise on the Pakistani skipper, who became only the 4th batter in history of Test Cricket to face more than 400 deliveries during the fourth innings of a Test. While admitting to have watched him bat a bit, Bishop hailed Babar’s masterclass of an innings, while hoping that he goes on to dominate this decade with the bat. Watched a bit of the Babar Azam Master class this morning. He is some player, as we’ve know for a while. Here’s to hoping he goes on to dominate this decade as others have before him. — Ian Raphael Bishop (@irbishi) March 16, 2022 While this was the 27-year-old’s sixth century and his highest score in Test career so far, the batter from Lahore also struck the highest fourth-innings score by a captain in the longest format of the game. While the Pakistani batters merely fell 63 runs short of the seemingly improbable target, they batted out the fifth-most Overs ever during the fourth innings of a Test.","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Under pressure to deliver good pitches, PCB seeks help from ICC Academy's former chief curator","link":"https://zeenews.india.com/cricket/under-pressure-to-deliver-good-pitches-pcb-seeks-help-from-icc-academys-former-chief-curator-2445863.html","keywords":null,"creator":null,"video_url":null,"description":"After the end of the second Pakistan vs Australia Test at Karachi that saw a thrilling draw, the Pakistan Cricket Board (PCB) has taken a big decision.","content":null,"pubDate":"2022-03-16 17:23:00","full_description":"After the end of the second Pakistan vs Australia Test at Karachi that saw a thrilling draw , the Pakistan Cricket Board (PCB) has taken a big decision. Not to forget, this Test might have produced an exciting last couple of days, but the pitch in Karachi too came under the scanner after Rawalpindi track was given a bad rating by match referee. The under-pressure PCB is now calling former ICC Academy head curator Toby Lumsden to oversee the preparations for the final game at Gaddafi Stadium starting Monday. In the two Tests so far, eight centuries have been scored -- six by Pakistani batters and two by Australia in Karachi. Both games have produced over 2300 runs with 14 wickets falling in Pindi and 28 in Karachi. Karachi fans! _ Thank you for being an electric crowd, for hosting Test cricket at NSK and becoming part of this historic tour with us. #BoysReadyHain l #PAKvAUS pic.twitter.com/ui0PPEhy4c — Pakistan Cricket (@TheRealPCB) March 16, 2022 The PCB has confirmed that Lumsden has reached Lahore on a 10-day assignment and will use his experience to help the local curators prepare the third Test surface. A PCB official said he will also help the local curators understand the modern requirements for preparing pitches. Lumsden, who has also been curator at the MCG, is presently supervising all the preparation work in Lahore where the pitch is expected to produce a result after the first two tests have been drawn. Lumsden is not the first foreign curator to be hired by the PCB which has in the past also brought in other foreign curators during home series to help in preparing pitches. A reliable source in the board said that PCB Chairman, Ramiz Raja has been focusing a lot on improvement of pitches in Pakistan. \"He wants to also change and improve the process of preparing pitches and Lumsden might also be given a longer assignment to help train the local curators,\" he said. Get services of Indian curators to prepare \"turners\", says Aaqib Javed. With PTI inputs","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"Cricket South Africa Appoints Pholetsi Moseki As Permanent CEO","link":"https://sports.ndtv.com/cricket/cricket-south-africa-appoints-pholetsi-moseki-as-permanent-ceo-2827196","keywords":null,"creator":null,"video_url":null,"description":"Cricket South Africa on Wednesday appointed Pholetsi Moseki as the permanent chief executive officer (CEO).","content":null,"pubDate":"2022-03-16 16:30:52","full_description":"Cricket South Africa (CSA) on Wednesday announced Pholetsi Moseki as the permanent chief executive officer (CEO) of the cricketing body. Moseki has been the acting CEO of CSA since December 2020. Moseki's official tenure begins on April 1, for a period of five years. CSA has not had a full-time CEO since Thabang Moroe was suspended in December 2019. \"The path to finding a new CEO has been a critical component in the process of fixing cricket from the ground up and setting us on a path to renewal and growth,\" said CSA chairperson Lawson Naidoo. \"I am delighted that Pholetsi has agreed to take up this exciting challenge and have every confidence that he will ensure that cricket becomes a national game of winners that makes all South Africans proud.\" Promoted \"Pholetsi has displayed extraordinary dedication and commitment since he joined the CSA family. He has been the key link in the leadership chain, especially during challenging periods. He has played a key role in getting the organisation moving in the right direction,\" Naidoo concluded. (This story has not been edited by NDTV staff and is auto-generated from a syndicated feed.)","image_url":"https://c.ndtvimg.com/2022-03/pltpr8og_pholetsi-moseki-appointed-csas-permanent-ceo_120x90_16_March_22.jpg","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"AB de Villiers IPL 2022 team: Is AB de Villiers playing IPL 2022?","link":"https://thesportsrush.com/cricket-news-ab-de-villiers-ipl-2022-team-is-ab-de-villiers-playing-ipl-2022/","keywords":["Cricket","IPL 2022","Indian Premier League","IPL"],"creator":["Gurpreet Singh"],"video_url":null,"description":"AB de Villiers IPL 2022 team: The legendary South African batter featured in three IPL seasons post his international retirement in 2018. During the recently concluded second and final Test match between India and Sri Lanka at M.Chinnaswamy Stadium-the home ground of the popular IPL franchise Royal Challengers Bangalore (RCB) in Bengaluru, the crowd turned… The post AB de Villiers IPL 2022 team: Is AB de Villiers playing IPL 2022? appeared first on The SportsRush.","content":"AB de Villiers IPL 2022 team: The legendary South African batter featured in three IPL seasons post his international retirement in 2018. During the recently concluded second and final Test match between India and Sri Lanka at M.Chinnaswamy Stadium-the home ground of the popular IPL franchise Royal Challengers Bangalore (RCB) in Bengaluru, the crowd turned up in huge numbers to not only cheer team India, but also the local favourites in Virat Kohli and AB de Villiers. Kohli has been playing for the RCB ever since the inception of the tournament in 2008. The fact makes him the only player in the history of the league to play for a single franchise. De Villiers, on the other hand, had been with the franchise since the 2011 edition of the league, after playing for the Delhi Daredevils (now Delhi Capitals) for the three initial seasons starting 2008. AB de Villiers IPL 2022 team The Proteas star batter, at the age of 37, announced retirement from all forms of Cricket in November 2021, thereby marking an end to a stellar career that entertained Cricket fans for the past 18 years. It has been an incredible journey, but I have decided to retire from all cricket. Ever since the back yard matches with my older brothers, I have played the game with pure enjoyment and unbridled enthusiasm. Now, at the age of 37, that flame no longer burns so brightly. pic.twitter.com/W1Z41wFeli — AB de Villiers (@ABdeVilliers17) November 19, 2021 Having retired from international Cricket in May 2018, de Villiers played for the RCB for another three seasons until last year, after which he finally decided to hang up his boots, albiet unfortunately, without an IPL title under his belt. The development thus meant that de Villiers would not play in IPL 2022, and that the RCB supporters would not witness their Proteas superstar smashing the leather ball from this year onwards. The now 38-year-old played a total of 184 IPL matches and amassed a total of 5,162 runs at an average and strike rate of 39.70 and 151.68 respectively. He also struck 40 half-centuries and 3 centuries during his illustrious IPL career. Overall in his T20 career, AB de Villiers featured in 340 matches and scored 9,424 runs at a strike-rate of 150.13. The post AB de Villiers IPL 2022 team: Is AB de Villiers playing IPL 2022? appeared first on The SportsRush.","pubDate":"2022-03-16 16:25:06","full_description":"AB de Villiers IPL 2022 team: The legendary South African batter featured in three IPL seasons post his international retirement in 2018. During the recently concluded second and final Test match between India and Sri Lanka at M.Chinnaswamy Stadium-the home ground of the popular IPL franchise Royal Challengers Bangalore (RCB) in Bengaluru, the crowd turned up in huge numbers to not only cheer team India, but also the local favourites in Virat Kohli and AB de Villiers. Kohli has been playing for the RCB ever since the inception of the tournament in 2008. The fact makes him the only player in the history of the league to play for a single franchise. De Villiers, on the other hand, had been with the franchise since the 2011 edition of the league, after playing for the Delhi Daredevils (now Delhi Capitals) for the three initial seasons starting 2008. The Proteas star batter, at the age of 37, announced retirement from all forms of Cricket in November 2021, thereby marking an end to a stellar career that entertained Cricket fans for the past 18 years. It has been an incredible journey, but I have decided to retire from all cricket. Ever since the back yard matches with my older brothers, I have played the game with pure enjoyment and unbridled enthusiasm. Now, at the age of 37, that flame no longer burns so brightly. pic.twitter.com/W1Z41wFeli — AB de Villiers (@ABdeVilliers17) November 19, 2021 Having retired from international Cricket in May 2018, de Villiers played for the RCB for another three seasons until last year, after which he finally decided to hang up his boots, albiet unfortunately, without an IPL title under his belt. The development thus meant that de Villiers would not play in IPL 2022, and that the RCB supporters would not witness their Proteas superstar smashing the leather ball from this year onwards. The now 38-year-old played a total of 184 IPL matches and amassed a total of 5,162 runs at an average and strike rate of 39.70 and 151.68 respectively. He also struck 40 half-centuries and 3 centuries during his illustrious IPL career. Overall in his T20 career, AB de Villiers featured in 340 matches and scored 9,424 runs at a strike-rate of 150.13.","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Chelsea takeover frenzy sparks crazy £3bn bidding war – meet the billionaires scrambling in football’s biggest auction","link":"https://www.thesun.co.uk/sport/football/17967685/chelsea-takeover-billionaires-candy-boehly-bayrak/","keywords":["Football","Chelsea email","Chelsea transfer news","Premier League"],"creator":["Dylan Terry"],"video_url":null,"description":"CHELSEA have received a huge amount of interest since Roman Abramovich confirmed he was selling the club. The Blues owner released a statement revealing his intention to sell just days before the UK government placed the Russian billionaire on a list of oligarchs who were to be sanctioned. But that has not deterred billionaire tycoons […]","content":"CHELSEA have received a huge amount of interest since Roman Abramovich confirmed he was selling the club. The Blues owner released a statement revealing his intention to sell just days before the UK government placed the Russian billionaire on a list of oligarchs who were to be sanctioned. But that has not deterred billionaire tycoons from declaring their interest in the west London outfit. And with Abramovich pricing the club at £3billion, it is set to be the most expensive football club takeover in history. Here are the leading candidates to take over from the Russian at Stamford Bridge. Nick Candy Boyhood Chelsea fan and business tycoon Nick Candy is said to be ready to test Roman Abramovich’s resolve by bidding £2.5billion for his boyhood club, which would include a £1.5billion redevelopment of the ageing Stamford Bridge. The 47-year-old Londoner amassed his fortune alongside his older brother Christian as a luxury property developer, and owns several high-profile buildings around the world. Read more on Cheltenham Festival CHELTENHAM FESTIVAL Punters brave torrential rain and mud as Day 2 races get underway FREE BETS Cheltenham Festival - free bets: Claim £60 welcome bonus with William Hill Getty Images - GettyCandy is a lifelong Chelsea supporter and interested in buying the club[/caption] He is thought to be putting together a super consortium to secure the takeover of the club. Famously, he has been married to ex-Neighbours beauty Holly Valance since 2012, and they have two children together. Boehly and Wyss American billionaire Todd Boehly and his Swiss business partner Hansjorg Wyss reportedly made an offer to buy Chelsea last week. Most read in Football MEGA BUCKS Trump's billionaire pal offers £2bn to snatch Chelsea away from Saudi group 'TRAGIC ACCIDENT' Footy ace Hampshire dies aged 40 after being hit by car as cops in appeal PIQUE-BOO Memphis Depay accidentally posts video of Gerard Pique NAKED in dressing room SHUT IT Boro slam Chelsea's demand for Cup clash to be behind-closed-doors amid ticket ban RUBE AWAKENING Arsenal in Neves blow as Barcelona target Wolves star to succeed Busquets FUL THROTTLE Fulham lining up transfer swoop for Liverpool and England defender Joe Gomez CHELTENHAM FREE BETS AND SIGN UP OFFERS – ALL THE LATEST DEALS FOR THE RACING THIS WEEK Boehly is a part-owner of the LA Dodgers baseball team, while Wyss is a billionaire businessman and donor to politically liberal and environmental causes in the United States. They are thought to be waiting to hear back from Abramovich about their offer. Bernard Antwi Boasiako Bernard Antwi Boasiako launched arguably the most ambitious of the bids to buy Chelsea – but is hoping he can somehow strike gold. The gold mine owner, radio station boss and politician is a big deal in Ghana. But with a reported wealth of a mere £100m, that is unlikely to be enough to purchase the European champions. Muhsin Bayrak AB Grup HoldingBayrak has claimed he is in talks to buy Chelsea[/caption] A Turkish billionaire who made his money as Chairman of own company AB Group Holding, which has invested in tourism, cryptocurrency and construction. Reports have stated that Abramovich flew to Turkey earlier this month to meet Bayrak. And he has said that he is in talks to buy the Blues, with negotiations well underway. Read more on Chelsea RUDI HELL Man Utd should sign Antonio Rudiger to challenge Harry Maguire, says Pallister BLUES NEWS Chelsea plead for behind closed doors match, Havertz' classy gesture - updates Woody Johnson Woody Johnson, owner of the New York Jets NFL team and Donald Trump pal, has been tipped as another would-be buyer. He will be looking to bring his knowledge of American sports into the Premier League and Stamford Bridge. Jamie Reuben Jamie Reuben, whose dad and uncle bought a 10 per cent stake in Newcastle last year, is a Chelsea fan and would relish the chance to take ownership. But there would be a number of complications due to his mega-rich family’s interest and control at St James’ Park. Reuben Jr is pals with Boris Johnson, Kim Kardashian, Paris Hilton and Jamie Redknapp and owns a swanky £65m yacht. Saudi Media Group Saudi Media Group have made a £2.7billion offer to buy Chelsea, according to reports. According to CBS Sports’ Ben Jacobs, the Saudi Media Group have now entered the race. Headed by Chelsea fan Mohamed Alkhereiji, the private consortium have tabled a £2.7bn bid for the West London club. The Saudi Media Group have no direct ties to the country’s government – unlike the Public Investment Fund that purchased Newcastle earlier this season. Thomas Ricketts and Ken Griffin Griffin has made a fortune in property Chicago Cubs owner Thomas Ricketts is part of a consortium that has thrown its hat into the ring to buy Chelsea. The Ricketts family, who own the Illinois-based baseball team, have linked up with billionaire hedge fund tycoon Ken Griffin to put together an investment group which will aim to take over from Roman Abramovich. On Wednesday, a spokesman for the consortium told Sky News: “The Ricketts Family, owners of the Chicago Cubs, can confirm they will be leading an investment group that will make a formal bid for Chelsea Football Club this Friday. “As long-time operators of an iconic professional sports team, the Ricketts Family and their partners understand the importance of investing for success on the pitch, while respecting the traditions of the club, the fans and the community. “We look forward to sharing further details of our plans in due course.” Josh Harris US billionaire Josh Harris already owns a portfolio of sports teams, and is a minority stakeholder in Crystal Palace. According to the Financial Times, Chelsea are hoping to sell to either a European-based or American billionaire – favouring Harris. The 57-year-old bought an 18 per cent stake in Crystal Palace back in 2015. He would have to divest this in order to purchase Chelsea. Billy Beane Beane has thrown his hat into the ring Moneyball genius Billy Beane is part of a corporation eyeing up a bid. The 59-year-old American made his name as a baseball player before turning his hand to business where he used his famous ‘Moneyball’ approach as general manager of Major League Baseball’s Oakland A’s. He is now an executive at Oakland A’s baseball team. Javed Afridi Javed Afridi is CEO of consumer electrics giants Haier Pakistan, and he also owns an automobile company. The 36-year-old businessman already owns two cricket franchises – Peshawar Zalmi in the Pakistan Super League, and Benoni Zalmi in the South African T20 Global League. Michael Rubin Michael Rubin, owner of sports merchandise group Fanatics, is said to be interested in acquiring the club. His company Fanatics itself is claimed to be worth over £20bn – more than enough to satisfy Abramovich’s sale price. Sir Jim Ratcliffe Sir Jim Ratcliffe, the UK’s richest person in 2018, made his billions as a chemical engineer turned financier and industrialist. Although the Ineos chief is a Manchester United fan, he does hold a season ticket at Chelsea. He currently owns the Ligue 1 side Nice, the Ineos Grenadiers cycling team and sponsors the Mercedes F1 team.","pubDate":"2022-03-16 15:59:58","full_description":"CHELSEA have received a huge amount of interest since Roman Abramovich confirmed he was selling the club. The Blues owner released a statement revealing his intention to sell just days before the UK government placed the Russian billionaire on a list of oligarchs who were to be sanctioned. But that has not deterred billionaire tycoons from declaring their interest in the west London outfit. And with Abramovich pricing the club at £3billion, it is set to be the most expensive football club takeover in history. Here are the leading candidates to take over from the Russian at Stamford Bridge. Boyhood Chelsea fan and business tycoon Nick Candy is said to be ready to test Roman Abramovich's resolve by bidding £2.5billion for his boyhood club , which would include a £1.5billion redevelopment of the ageing Stamford Bridge. The 47-year-old Londoner amassed his fortune alongside his older brother Christian as a luxury property developer , and owns several high-profile buildings around the world. He is thought to be putting together a super consortium to secure the takeover of the club. Famously, he has been married to ex-Neighbours beauty Holly Valance since 2012, and they have two children together. American billionaire Todd Boehly and his Swiss business partner Hansjorg Wyss reportedly made an offer to buy Chelsea last week. CHELTENHAM FREE BETS AND SIGN UP OFFERS - ALL THE LATEST DEALS FOR THE RACING THIS WEEK Boehly is a part-owner of the LA Dodgers baseball team, while Wyss is a billionaire businessman and donor to politically liberal and environmental causes in the United States. They are thought to be waiting to hear back from Abramovich about their offer. Bernard Antwi Boasiako launched arguably the most ambitious of the bids to buy Chelsea - but is hoping he can somehow strike gold. The gold mine owner, radio station boss and politician is a big deal in Ghana. But with a reported wealth of a mere £100m, that is unlikely to be enough to purchase the European champions. A Turkish billionaire who made his money as Chairman of own company AB Group Holding, which has invested in tourism, cryptocurrency and construction. Reports have stated that Abramovich flew to Turkey earlier this month to meet Bayrak. And he has said that he is in talks to buy the Blues, with negotiations well underway . Woody Johnson, owner of the New York Jets NFL team and Donald Trump pal , has been tipped as another would-be buyer. He will be looking to bring his knowledge of American sports into the Premier League and Stamford Bridge. Jamie Reuben, whose dad and uncle bought a 10 per cent stake in Newcastle last year, is a Chelsea fan and would relish the chance to take ownership . But there would be a number of complications due to his mega-rich family's interest and control at St James' Park. Reuben Jr is pals with Boris Johnson, Kim Kardashian, Paris Hilton and Jamie Redknapp and owns a swanky £65m yacht . Saudi Media Group have made a £2.7billion offer to buy Chelsea, according to reports. According to CBS Sports' Ben Jacobs, the Saudi Media Group have now entered the race. Headed by Chelsea fan Mohamed Alkhereiji, the private consortium have tabled a £2.7bn bid for the West London club. The Saudi Media Group have no direct ties to the country's government - unlike the Public Investment Fund that purchased Newcastle earlier this season. Chicago Cubs owner Thomas Ricketts is part of a consortium that has thrown its hat into the ring to buy Chelsea. The Ricketts family, who own the Illinois-based baseball team, have linked up with billionaire hedge fund tycoon Ken Griffin to put together an investment group which will aim to take over from Roman Abramovich . On Wednesday, a spokesman for the consortium told Sky News : \"The Ricketts Family, owners of the Chicago Cubs, can confirm they will be leading an investment group that will make a formal bid for Chelsea Football Club this Friday. \"As long-time operators of an iconic professional sports team, the Ricketts Family and their partners understand the importance of investing for success on the pitch, while respecting the traditions of the club, the fans and the community. \"We look forward to sharing further details of our plans in due course.\" US billionaire Josh Harris already owns a portfolio of sports teams, and is a minority stakeholder in Crystal Palace. According to the Financial Times, Chelsea are hoping to sell to either a European-based or American billionaire - favouring Harris. The 57-year-old bought an 18 per cent stake in Crystal Palace back in 2015. He would have to divest this in order to purchase Chelsea. Moneyball genius Billy Beane is part of a corporation eyeing up a bid. The 59-year-old American made his name as a baseball player before turning his hand to business where he used his famous ‘Moneyball’ approach as general manager of Major League Baseball’s Oakland A’s. He is now an executive at Oakland A's baseball team. Javed Afridi is CEO of consumer electrics giants Haier Pakistan, and he also owns an automobile company. The 36-year-old businessman already owns two cricket franchises - Peshawar Zalmi in the Pakistan Super League, and Benoni Zalmi in the South African T20 Global League. Michael Rubin , owner of sports merchandise group Fanatics, is said to be interested in acquiring the club. His company Fanatics itself is claimed to be worth over £20bn - more than enough to satisfy Abramovich's sale price. Sir Jim Ratcliffe, the UK's richest person in 2018, made his billions as a chemical engineer turned financier and industrialist. Although the Ineos chief is a Manchester United fan, he does hold a season ticket at Chelsea. He currently owns the Ligue 1 side Nice, the Ineos Grenadiers cycling team and sponsors the Mercedes F1 team.","image_url":null,"source_id":"thesun","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"What is Yo Yo Test in cricket: How to pass Yo Yo Test in cricket?","link":"https://thesportsrush.com/cricket-news-what-is-yo-yo-test-in-cricket-how-to-pass-yo-yo-test-in-cricket/","keywords":["Cricket","BCCI","Yo-Yo Test"],"creator":["Gurpreet Singh"],"video_url":null,"description":"What is Yo Yo Test in cricket: The test, which is a standard measure of fitness of players, was introduced by the BCCI in the year 2017. The Board of Control for Cricket in India (BCCI), in a bid to check upon the fitness standards of all its centrally contracted injury-marred players ahead of the… The post What is Yo Yo Test in cricket: How to pass Yo Yo Test in cricket? appeared first on The SportsRush.","content":"What is Yo Yo Test in cricket: The test, which is a standard measure of fitness of players, was introduced by the BCCI in the year 2017. The Board of Control for Cricket in India (BCCI), in a bid to check upon the fitness standards of all its centrally contracted injury-marred players ahead of the imminent 15th season of the Indian Premier League (IPL), conducted the mandatory ‘Yo Yo Test’ at the NCA in Bengaluru. Skipper of the Gujarat Titans (GT) and out of action since the 2021 T20 World Cup in UAE, all-rounder Hardik Pandya, as per reports, passed the test with the score of 17. Flamboyant opening batter Prithvi Shaw, on the other hand, failed to pass the Test. However, the same will not hinder with his participation in the upcoming IPL, as the 22-year-old is not considered for selection in any of the formats for team India presently. What is Yo Yo Test in cricket The Yo Yo test is a running aerobic fitness test, where a player is required to ‘shuttle’ between two cones that are placed 20 metres apart. He/she is supposed to commence on the sound of a beep, and has to scamper through to the cone ahead before the second beep. The player then turns back, and completes what is known as one ‘shuttle’ before the third beep sound, with a ten second recovery period between each shuttle. With level 23 being the highest, the player begins with level 5 which comprises one shuttle. Next is level 9 (one shuttle), then level 11 (two shuttles), level 12 (three shuttles), level 13 (four shuttles), and finally 8 shuttles each from Level 14 onwards. Each shuttle covers a distance of 40 metres. As player moves up each level, the time available to complete each shuttle keeps on decreasing, thereby making it challenging to achieve the qualifying score. How to pass the Yo Yo test? The BCCI presently has set 17:1 as the qualifying speed level in order for its players to pass the Yo Yo test. It means it is mandatory for their players to finish the first shuttle of speed level 17, which is equal to the accumulated distance of 1,120 metres. The players’ speed/level is recorded until the point of the third warning. At the point of the third and last warning, which happens when the player has failed to complete the shuttle before the beep, the test ends. While India’s minimum level stands at 17:1, it is 17:4 for Pakistan, 19 for players from the West Indies, and as high as 20:1 for New Zealand. The post What is Yo Yo Test in cricket: How to pass Yo Yo Test in cricket? appeared first on The SportsRush.","pubDate":"2022-03-16 15:34:39","full_description":"What is Yo Yo Test in cricket: The test, which is a standard measure of fitness of players, was introduced by the BCCI in the year 2017. The Board of Control for Cricket in India (BCCI), in a bid to check upon the fitness standards of all its centrally contracted injury-marred players ahead of the imminent 15th season of the Indian Premier League (IPL) , conducted the mandatory ‘Yo Yo Test’ at the NCA in Bengaluru. Skipper of the Gujarat Titans (GT) and out of action since the 2021 T20 World Cup in UAE, all-rounder Hardik Pandya, as per reports, passed the test with the score of 17. Flamboyant opening batter Prithvi Shaw, on the other hand, failed to pass the Test. However, the same will not hinder with his participation in the upcoming IPL, as the 22-year-old is not considered for selection in any of the formats for team India presently. The Yo Yo test is a running aerobic fitness test, where a player is required to ‘shuttle’ between two cones that are placed 20 metres apart. He/she is supposed to commence on the sound of a beep, and has to scamper through to the cone ahead before the second beep. The player then turns back, and completes what is known as one ‘shuttle’ before the third beep sound, with a ten second recovery period between each shuttle. With level 23 being the highest, the player begins with level 5 which comprises one shuttle. Next is level 9 (one shuttle), then level 11 (two shuttles), level 12 (three shuttles), level 13 (four shuttles), and finally 8 shuttles each from Level 14 onwards. Each shuttle covers a distance of 40 metres. As player moves up each level, the time available to complete each shuttle keeps on decreasing, thereby making it challenging to achieve the qualifying score. The BCCI presently has set 17:1 as the qualifying speed level in order for its players to pass the Yo Yo test. It means it is mandatory for their players to finish the first shuttle of speed level 17, which is equal to the accumulated distance of 1,120 metres. The players’ speed/level is recorded until the point of the third warning. At the point of the third and last warning, which happens when the player has failed to complete the shuttle before the beep, the test ends. While India’s minimum level stands at 17:1, it is 17:4 for Pakistan, 19 for players from the West Indies, and as high as 20:1 for New Zealand.","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"West Indies v England LIVE commentary: Date, UK start time, confirmed teams and exclusive ball-by-ball coverage of the second Test in Barbados: England win the toss and elect to bat, Saqib Mahmood and Matt Fisher make Test debuts","link":"https://talksport.com/sport/cricket/1063087/west-indies-v-england-live-stream-commentary-start-time-scorecard-team-news-joe-root-saqib-mahmood-matt-fisher/","keywords":["Cricket","Sport","England Cricket","West Indies"],"creator":["Marc Williams"],"video_url":null,"description":"England take on the West Indies in the second Test of their Caribbean Tour today and the action will be live on talkSPORT 2 again. Joe Root’s men had to settle for a draw in the first Test against Windies despite a bold declaration and encouraging performance in Antigua. Root, Zak Crawley and Jonny Bairstow […]","content":"England take on the West Indies in the second Test of their Caribbean Tour today and the action will be live on talkSPORT 2 again. Joe Root’s men had to settle for a draw in the first Test against Windies despite a bold declaration and encouraging performance in Antigua. The West Indies and England are set to face off in their second Test Root, Zak Crawley and Jonny Bairstow all hit centuries at the Sir Vivian Richards Stadium while Jack Leach, Ben Stokes and Craig Overton impressed with the ball. But after a difficult year at Test level, England failed to register a much-needed victory and will be eager to do so in the second Test in Barbados. England have won the toss at the Kensington Oval and have elected to bat first. talkSPORT is bringing fans full coverage of England’s tour of the West Indies this month and the second Test is set up nicely for another cracking match. West Indies vs England: How to listen Uninterrupted ball-by-ball coverage of the West Indies vs England tour will be live on talkSPORT 2 this month. Our superb broadcast line-up includes Mark Nicholas, Steve Harmison, Matt Prior and Mark Butcher. The second Test will be held at the Kensington Oval in Bridgetown from Wednesday, March 16 and the action will get underway at 2pm on each day. We’ll also have full coverage of the third Test too – just ask your smart speaker to ‘play talkSPORT 2‘. To tune in to talkSPORT or talkSPORT 2, click HERE for the live stream. App iPhone – Download from the Apple storeAndroid – Download from Google PlayRadio – talkSPORT is available across the United Kingdom via DAB digital radio and on 1089 or 1053 AMTV – Listen to talkSPORT through your TV on the following channels: Sky: Channel 0108 Virgin Media: Channel 927 Freeview: Channel 723 Freesat: Channel 731 England's schedule in the West Indies First Test Match Drawn – March 8-12 (Sir Vivian Richards Stadium, North Sound) Second Test March 16-20 (Kensington Oval, Bridgetown) Third Test March 24-28 (National Cricket Stadium, St. George’s) Most read in Cricket plea Matt Prior pushing for change in cricket to stop children being priced out of game LIVE West Indies v England commentary: Crawley century puts England in control MOT England's misuse of 'Ferrari' Wood may have led to latest injury, believes Harmison tribute Shane Warne state funeral confirmed for March 30 after sudden death Emotional Gatting wishes he could hear Warne tell him how good THAT ball was one more time special ‘The Question of Sport green room was in some state’ - McCoist on meeting Warne West Indies vs England: Confirmed teams Mark Wood and Craig Overton have been ruled out through injury, which means that there will be TWO Test debuts for England. Saqib Mahmood and Matt Fisher from Lancashire and Yorkshire respectively have been handed the responsibility of taking wickets. Hopefully, they won’t be called into action too quickly! England star Bairstow hit a brilliant century against the West Indies in the first TestGetty England: Alex Lees, Zak Crawley, Joe Root (c), Dan Lawrence, Ben Stokes, Jonny Bairstow, Ben Foakes (wk), Chris Woakes Matt Fisher, Jack Leach, Saqib Mahmood. West Indies have named an unchanged team for the second Test. West Indies: Kraigg Brathwaite (c), John Campbell, Shamarh Brooks, Nkrumah Bonner, Jermaine Blackwood, Jason Holder, Joshua Da Silva (wk), Alzarri Joseph, Kemar Roach, Veerasammy Permaul, Jayden Seales. Umpires: Joel Wilson, Nigel Duguid and Leslie Reifer. Root and England will be desperate to beat the West Indies in the second TestSri Lanka Cricket West Indies vs England: What has been said? Joe Root said: “We showed a huge amount of character. “I’m really pleased with the way we played, especially given the position we were in after that first hour. “The guys stayed calm and showed great maturity to get us to a total, especially off the back of a difficult winter and a difficult year where we’ve not scored anywhere near enough runs. “The way the guys stuck at it, especially having one bowler down as well, showed a huge amount of character and it was a huge step forward in many respects. “No-one stopped believing or gave up all day. We really did give ourselves the best chance of winning this game.” Cheltenham Festival Betting Offers CLAIM ALL THE BEST CHELTENHAM FESTIVAL OFFERS HERE Sky Bet: Get 50/1 Shishkin to win the Champion Chase* – CLAIM HERE Bet365: Bet £10 Get £50 in Free Bets* – CLAIM HERE Sky Bet: NEW CUSTOMERS ONLY • MIN/MAX STAKE £1 • FREE BETS CREDITED ON TOP OF WINNINGS. • 5 X £10 BET TOKEN • FREE BET STAKES NOT INCLUDED IN RETURNS. • FREE BETS CANNOT BE USED ON VIRTUALS. • FREE BETS ARE NON-WITHDRAWABLE. • NO FREE BET EXPIRY. • ELIGIBILITY RESTRICTIONS AND FURTHER T&CS APPLY. • 18+. • BEGAMBLEAWARE.ORG 18+ begambleaware.org Bet365: Min deposit requirement. Free Bets are paid as Bet Credits and are available for use upon settlement of qualifying bets. Min odds, bet and payment method exclusions apply. Returns exclude Bet Credits stake. Time limits and T&Cs apply 18+ Begambleaware.org","pubDate":"2022-03-16 13:59:00","full_description":"England take on the West Indies in the second Test of their Caribbean Tour today and the action will be live on talkSPORT 2 again. Joe Root’s men had to settle for a draw in the first Test against Windies despite a bold declaration and encouraging performance in Antigua. Root, Zak Crawley and Jonny Bairstow all hit centuries at the Sir Vivian Richards Stadium while Jack Leach, Ben Stokes and Craig Overton impressed with the ball. But after a difficult year at Test level, England failed to register a much-needed victory and will be eager to do so in the second Test in Barbados. England won the toss at the Kensington Oval and elected to bat first; however, Crawley nicked off early on for 0 and Joe Root is in with Alex Lees. talkSPORT is bringing fans full coverage of England’s tour of the West Indies this month and the second Test is set up nicely for another cracking match. Uninterrupted ball-by-ball coverage of the West Indies vs England tour will be live on talkSPORT 2 this month. Our superb broadcast line-up includes Mark Nicholas, Steve Harmison, Matt Prior and Mark Butcher. The second Test will be held at the Kensington Oval in Bridgetown from Wednesday, March 16 and the action will get underway at 2pm on each day. We’ll also have full coverage of the third Test too – just ask your smart speaker to ‘play talkSPORT 2‘. To tune in to talkSPORT or talkSPORT 2, click HERE for the live stream. First Test Second Test Third Test Mark Wood and Craig Overton have been ruled out through injury, which means that there will be TWO Test debuts for England. Saqib Mahmood and Matt Fisher from Lancashire and Yorkshire respectively have been handed the responsibility of taking wickets. Hopefully, they won’t be called into action too quickly! England: Alex Lees, Zak Crawley, Joe Root (c), Dan Lawrence, Ben Stokes, Jonny Bairstow, Ben Foakes (wk), Chris Woakes Matt Fisher, Jack Leach, Saqib Mahmood. West Indies have named an unchanged team for the second Test. West Indies: Kraigg Brathwaite (c), John Campbell, Shamarh Brooks, Nkrumah Bonner, Jermaine Blackwood, Jason Holder, Joshua Da Silva (wk), Alzarri Joseph, Kemar Roach, Veerasammy Permaul , Jayden Seales. Umpires: Joel Wilson, Nigel Duguid and Leslie Reifer. Joe Root said: “We showed a huge amount of character. “I’m really pleased with the way we played, especially given the position we were in after that first hour. “The guys stayed calm and showed great maturity to get us to a total, especially off the back of a difficult winter and a difficult year where we’ve not scored anywhere near enough runs. “The way the guys stuck at it, especially having one bowler down as well, showed a huge amount of character and it was a huge step forward in many respects. “No-one stopped believing or gave up all day. We really did give ourselves the best chance of winning this game.” CLAIM ALL THE BEST CHELTENHAM FESTIVAL OFFERS HERE Sky Bet: Get 50/1 Shishkin to win the Champion Chase* – CLAIM HERE Bet365: Bet £10 Get £50 in Free Bets* – CLAIM HERE Sky Bet: NEW CUSTOMERS ONLY • MIN/MAX STAKE £1 • FREE BETS CREDITED ON TOP OF WINNINGS. • 5 X £10 BET TOKEN • FREE BET STAKES NOT INCLUDED IN RETURNS. • FREE BETS CANNOT BE USED ON VIRTUALS. • FREE BETS ARE NON-WITHDRAWABLE. • NO FREE BET EXPIRY. • ELIGIBILITY RESTRICTIONS AND FURTHER T&CS APPLY. • 18+. • BEGAMBLEAWARE.ORG 18+ begambleaware.org Bet365: Min deposit requirement. Free Bets are paid as Bet Credits and are available for use upon settlement of qualifying bets. Min odds, bet and payment method exclusions apply. Returns exclude Bet Credits stake. Time limits and T&Cs apply 18+ Begambleaware.org","image_url":null,"source_id":"talksport","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"‘He is one of our own’: PAK fans poke fun at Usman Khawaja for dropping Mohammad Rizwan on 91 in Karachi Test - Hindustan Times","link":"https://news.google.com/__i/rss/rd/articles/CBMikgFodHRwczovL3d3dy5oaW5kdXN0YW50aW1lcy5jb20vY3JpY2tldC91c21hbi1raGF3YWphLWNhdGNoLWRyb3AtbW9oYW1tYWQtcml6d2FuLXR3aXR0ZXItcmVhY3Rpb25zLXBhay12cy1hdXMtMm5kLXRlc3Qta2FyYWNoaS0xMDE2NDc0MzUwMjIzMjAuaHRtbNIBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"‘He is one of our own’: PAK fans poke fun at Usman Khawaja for dropping Mohammad Rizwan on 91 in Karachi Test  Hindustan TimesUnbreaking up like Babar Azam | Cricbuzz.com - Cricbuzz  CricbuzzUpdated ICC World Test Championship 2021-23 Points Table After Pakistan vs Australia 2nd Test  Cricket AddictorThrilled Melinda Farrell loved watching Babar Azam play against Australia  Geo News'If we took a couple of catches it might be a different scenario' - Pat Cummins rues missed chances  ESPNcricinfoView Full coverage on Google News","content":null,"pubDate":"2022-03-16 13:50:59","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL 2022: Hardik Pandya bowls at NCA, passes Yo-Yo test with flying colours","link":"https://www.indiatvnews.com/sports/cricket/ipl-2022-hardik-pandya-bowls-at-nca-passes-yo-yo-test-with-flying-colours-2022-03-16-764664","keywords":null,"creator":null,"video_url":null,"description":"Injury-ravaged India all-rounder Hardik Pandya has got the all clear to lead Gujarat Titans in the upcoming IPL after a general assessment at the National Cricket Academy (NCA) in Bengaluru where he bowled and also passed the 'Yo-Yo' Test comfortably.","content":null,"pubDate":"2022-03-16 13:44:48","full_description":"Injury-ravaged India all-rounder has got the all clear to lead Gujarat Titans in the upcoming after a general assessment at the National Cricket Academy (NCA) in Bengaluru where he bowled and also passed the 'Yo-Yo' Test comfortably. The BCCI is checking on all its centrally contracted players -- injured or otherwise -- before the IPL and Pandya's performance, during his two days at the NCA, can also be seen as a good sign for Indian cricket. \"Let's make it clear. Fitness test clearance is only for those who are coming back from injury. In case of Hardik, it was about getting a general fitness assessment going into the gruelling IPL season,\" a BCCI source told PTI on conditions of anonymity. \"He is an asset and one needed to check his current fitness standards,\" he added. In fact, in his fitness assessment module, the NCA team didn't even mandate him to bowl but the all-rounder apparently \"insisted\" on it to show that he is on track to make a comeback into the Indian team. \"He didn't need to bowl at NCA but he has bowled for considerable time and in the range of 135 kmph. On the second day, he crossed the Yo-Yo test with flying colours with a 17-plus score which is much above the cut-off level,\" the source said. fails 'Yo-Yo' test However, as per information received one player, who would be slightly disappointed with his current fitness status is out-of-favour opener Prithvi Shaw. The former U-19 World Cup winning captain, who is not a part of the central contract was also at the NCA to provide an update on his fitness status and the result wasn't exactly satisfactory. The current Yo-Yo test qualification score is 16.5 for men and it has been learnt that the Mumbai opener has scored less than 15. \"These are just fitness updates. Obviously, it doesn't stop Prithvi from playing for Delhi Capitals in IPL. It's just a fitness parameter and not the be all and end all,\" the source said. \"Look, he has played three Ranji matches back-to-back. Once you play three first-class games on the bounce, the fatigue can also affect your Yo-Yo score,\" he added. Shaw, of late, hasn't been among the fittest of Indian players and perhaps that is one of the reasons that of late, he has not been considered in any of the current senior teams across formats. Even as a replacement, the team management, in the white-ball format, has preferred as a reserve opener despite some underwhelming performances by the Karnataka man. \"If Prithvi is not being repeatedly considered, then perhaps his fitness standards aren't up to the mark, as in what is expected of a Team India player,\" the source said.","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"LIVE West Indies vs England Live Cricket Score 2nd Test Day 1 Match Updates from Barbados","link":"https://www.indiatvnews.com/sports/cricket/west-indies-vs-england-live-score-wi-vs-eng-2nd-test-day-1-live-cricket-score-and-updates-2022-03-16-764657","keywords":null,"creator":null,"video_url":null,"description":"LIVE West Indies vs England Live Cricket Score 2nd Test Day 1 Match Updates from Barbados","content":null,"pubDate":"2022-03-16 13:27:38","full_description":null,"image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"Man of the Match today PAK vs AUS 2nd Test: Who was awarded Man of the Match in Pakistan vs Australia Karachi Test?","link":"https://thesportsrush.com/cricket-news-man-of-the-match-today-pak-vs-aus-2nd-test-who-was-awarded-man-of-the-match-in-pakistan-vs-australia-karachi-test/","keywords":["Cricket","Australia","Australia tour of Pakistan 2022","babar azam","Pakistan"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Man of the Match today PAK vs AUS: The Pakistani captain won the match award for the first time in his Test career. The second Test match of the ongoing Australia’s tour of Pakistan ended in a draw but only after 22 players played five grueling days of Test cricket at the National Stadium. A… The post Man of the Match today PAK vs AUS 2nd Test: Who was awarded Man of the Match in Pakistan vs Australia Karachi Test? appeared first on The SportsRush.","content":"Man of the Match today PAK vs AUS: The Pakistani captain won the match award for the first time in his Test career. The second Test match of the ongoing Australia’s tour of Pakistan ended in a draw but only after 22 players played five grueling days of Test cricket at the National Stadium. A test of patience for both the players and audiences across the globe, the match finished with Pakistan batting for almost a couple of days to secure one of the best draws in the history of cricket. Captain Babar Azam (196), vice-captain Mohammad Rizwan (104*) and opening batter Abdullah Shafique (96) batted for a combined total of 907 deliveries to save the match for the home team. With bowling figures of 55-20-112-4, Australia spinner Nathan Lyon was the pick of their bowlers in the second innings. Apart from Lyon, captain Pat Cummins and all-rounder Cameron Green picked two and a wicket respectively. Man of the Match today PAK vs AUS 2nd Test In what Azam’s sixth Test century, it was his fourth one at home, second against Australia and first as captain. Azam, who became only the fourth batter in the history of cricket to play 400+ deliveries in the fourth innings of a Test match, also scored the highest-ever fourth innings score by a captain. A career-best knock had it in it to make Azam a deserving candidate for his maiden Man of the Match award in Test cricket. “The plan was to bat session-by-session and build partnerships. It was a team effort as others [Andullah Shafique and Mohammad Rizwan] chipped in with useful contributions too,” Azam told PTV during the post-match presentation ceremony in Karachi today. Sydney. Brisbane. Karachi. Third time in 15 months, Australia failed to seize the game in 4th innings. #PakvAus — Mazher Arshad (@MazherArshad) March 16, 2022 “We took the onus and the main focus was to build partnerships right throughout the day. Rizwan was outstanding as he saved the Test for us eventually. We wanted to continue to bat in the same way [after the tea break] and we tried to be positive and play our shots. The team needed this knock, so I tried to bat for as long as I could.” The post Man of the Match today PAK vs AUS 2nd Test: Who was awarded Man of the Match in Pakistan vs Australia Karachi Test? appeared first on The SportsRush.","pubDate":"2022-03-16 13:27:36","full_description":"Man of the Match today PAK vs AUS: The Pakistani captain won the match award for the first time in his Test career. The second Test match of the ongoing Australia’s tour of Pakistan ended in a draw but only after 22 players played five grueling days of Test cricket at the National Stadium. A test of patience for both the players and audiences across the globe, the match finished with Pakistan batting for almost a couple of days to secure one of the best draws in the history of cricket. Captain Babar Azam (196) , vice-captain Mohammad Rizwan (104*) and opening batter Abdullah Shafique (96) batted for a combined total of 907 deliveries to save the match for the home team. With bowling figures of 55-20-112-4, Australia spinner Nathan Lyon was the pick of their bowlers in the second innings. Apart from Lyon, captain Pat Cummins and all-rounder Cameron Green picked two and a wicket respectively. In what Azam’s sixth Test century, it was his fourth one at home, second against Australia and first as captain. Azam, who became only the fourth batter in the history of cricket to play 400+ deliveries in the fourth innings of a Test match, also scored the highest-ever fourth innings score by a captain. A career-best knock had it in it to make Azam a deserving candidate for his maiden Man of the Match award in Test cricket. “The plan was to bat session-by-session and build partnerships. It was a team effort as others [Andullah Shafique and Mohammad Rizwan] chipped in with useful contributions too,” Azam told PTV during the post-match presentation ceremony in Karachi today. Sydney. Brisbane. Karachi. Third time in 15 months, Australia failed to seize the game in 4th innings. #PakvAus — Mazher Arshad (@MazherArshad) March 16, 2022 “We took the onus and the main focus was to build partnerships right throughout the day. Rizwan was outstanding as he saved the Test for us eventually. We wanted to continue to bat in the same way [after the tea break] and we tried to be positive and play our shots. The team needed this knock, so I tried to bat for as long as I could.”","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"AMR vs BOB Dream11 Prediction: Fantasy Cricket Tips, Today's Playing 11 and Pitch Report for Oman D10 League 2022, Match 16","link":"https://www.sportskeeda.com/fantasy-cricket-mantra/amr-vs-bob-dream11-prediction-fantasy-cricket-tips-today-s-playing-11-pitch-report-oman-d10-league-2022-match-16?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Fantasy Cricket Mantra"],"creator":["Aman Chauhan"],"video_url":null,"description":null,"content":null,"pubDate":"2022-03-16 13:16:01","full_description":"The Amerat Royals (AMR) will take on Bousher Busters (BOB) in the 16th match of the Oman D10 League 2022 at the Al Amerat Cricket Ground in Oman on Wednesday. The Amerat Royals have been on a roll in this tournament and are sitting atop the table after winning all three of their games. They defeated the Darsait Titans by 49 runs in their previous match. Bousher Busters, on the other hand, are second in the points table with two wins and one loss. It will be interesting to see who wins today, as these are the top two teams in the competition. Pratik Athavale (wk), Akshay Patel, Karan Sonavale (c), Rafiullah-M, Mehran Khan, Vinayak Shukla, Viren Patel, Yasir Ali, Khafid Un Nabi Siddiqui, Hemal Tandel, Bilal Khan. Abdul Rauf (wk), Shubo Paul, Pruthvi Machhi, Adnan Sulehri, Hammad Ifraq, Asif khan-III, Sufyan Mehmood, Bilal Shah, Mehedi Hasan, Siddh Mehta, Fawad Ali. AMR vs BOB, Oman D10 League 2022, Match 16 Date and Time: March 16, 2022, 11:00 PM IST Venue: Al Amerat Cricket Ground, Oman Batters are expected to succeed on the pitch at Al Amerat Stadium. 120 runs could be the par score here, and the team that wins the toss should ideally bat first. Wicketkeeper Pratik Athavale: Athavale is currently the second-leading run-scorer for Amerat in the Oman D10 with 108 runs in three matches at an average of 36.00. He can be a crucial pick for your fantasy team. Batters Akshay Patel: He has been in good form in the last three games, scoring 134 runs at an average of 44.66. That makes him a must-have in your Dream11 fantasy team for this game. All-rounders Sufyan Mehmood: Sufyan has performed exceptionally well with both the bat and the ball thus far. He could be a valuable addition to your fantasy team for this match. Sufyan has picked up four wickets and scored 33 runs in three games at an average of 9.25. Bowlers Khafid Nabi Siddique: Khafid will lead AMR's bowling attack in the upcoming match, having picked up six wickets in three matches at an average of 6.16. He could prove to be an asset for your Dream11 fantasy team in this game. Rafiullah-M (AMR): 173 points Asif Khan-III (BOB): 166 points Mehran Khan (AMR): 108 points Bilal Shah - Five wickets in three games; bowling average: 6.00. Abdul Rauf - 76 runs in three games; batting average: 25.33 Hemal Tandel - Three wickets in three games; bowling average: 10.66. Fantasy Suggestion #1 : Pratik Athavale, Abdul Rauf, Akshay Patel, Vinayak Shukla, Pruthvi Machhi, Shubo Paul, Sufyan Mehmood, Rafiullah-M, Asif khan-III, Bilal Shah, Hemal Tandel, Khafid Un Nabi Siddiqui Captain : Bilal Shah Vice-captain : Rafiullah-M Fantasy Suggestion #2: Pratik Athavale, Akshay Patel, Pruthvi Machhi, Shubo Paul, Sufyan Mehmood, Mehran Khan, Rafiullah-M, Asif khan-III, Bilal Khan, Bilal Shah, Khafid Un Nabi Siddiqui Captain : Khafid Un Nabi Siddiqui Vice-captain : Akshay Patel","image_url":"https://static.sportskeeda.com/editor/2022/03/2d84a-16474295574900-1920.jpg","source_id":"sportskeeda","country":["india"],"category":["sports"],"language":"english"},{"title":"Usman Khawaja drop catch today: Khawaja drops Mohammad Rizwan with Australia needing 3 wickets to win Karachi Test","link":"https://thesportsrush.com/cricket-news-usman-khawaja-drop-catch-today-khawaja-drops-mohammad-rizwan-with-australia-needing-3-wickets-to-win-karachi-test/","keywords":["Cricket","Videos","Australia","Australia tour of Pakistan 2022","Mitchell Swepson","Mohammad Rizwan","Pakistan","usman khawaja"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Usman Khawaja drop catch: The Australian batter couldn’t hold on to a straightforward and highly vital catch today. During the fifth day of the second Test of the ongoing Australia’s tour of Pakistan in Karachi, Australia batter Usman Khawaja erred on the field to drop a catch at a crucial juncture in the match. It… The post Usman Khawaja drop catch today: Khawaja drops Mohammad Rizwan with Australia needing 3 wickets to win Karachi Test appeared first on The SportsRush.","content":"Usman Khawaja drop catch: The Australian batter couldn’t hold on to a straightforward and highly vital catch today. During the fifth day of the second Test of the ongoing Australia’s tour of Pakistan in Karachi, Australia batter Usman Khawaja erred on the field to drop a catch at a crucial juncture in the match. It all happened on the last delivery of the 169th over when Pakistan vice-captain Mohammad Rizwan hit a Mitchell Swepson delivery to Khawaja at short cover. Khawaja, who had scored his 11th Test century in the first innings, couldn’t manage to hold on to the ball with his helmet on. While a reprieve to Rizwan allowed him to complete a his second Test century, it also denied Swepson off his first wicket of the innings despite bowling 53 overs at that point in time. Having said that, in the larger context, Khawaja’s drop must’ve hurt Australia, who needed three more wickets to win the match. With three more overs remaining in the day, bowling to a Rizwan-less Pakistani lower-order would’ve presented a glance at victory for the visitors. While Pakistan captain Babar Azam (196) played a glorious career-best innings to receive accolades from across the world, Rizwan also ended up with 104* (177) to power the hosts to an unprecedented draw while chasing a 506-run target at the National Stadium. With bowling figures of 55-20-112-4, Australia spinner Nathan Lyon was the pick of their bowlers in the second innings. Apart from Lyon, captain Pat Cummins and all-rounder Cameron Green picked two and a wicket respectively. Usman Khawaja drop catch today Video to be uploaded soon. Twitter reactions on Usman Khawaja drop catch: Not meant to be for Usman Khawaja. #PAKvAUS pic.twitter.com/Ngb6HV6gu5 — Adam Collins (@collinsadam) March 16, 2022 Dropped catch of the century? #PakvAus — Mazher Arshad (@MazherArshad) March 16, 2022 Australia after @Uz_Khawaja has already called Rawalpindi and Karachi as his hometown and now drops a crucial catch: pic.twitter.com/xC6CWyVNzs — Urva Shafqat (@urvashafqat_) March 16, 2022 For more cricket-related news, click here. The post Usman Khawaja drop catch today: Khawaja drops Mohammad Rizwan with Australia needing 3 wickets to win Karachi Test appeared first on The SportsRush.","pubDate":"2022-03-16 13:05:56","full_description":"Usman Khawaja drop catch: The Australian batter couldn’t hold on to a straightforward and highly vital catch today. During the fifth day of the second Test of the ongoing Australia’s tour of Pakistan in Karachi, Australia batter Usman Khawaja erred on the field to drop a catch at a crucial juncture in the match. It all happened on the last delivery of the 169th over when Pakistan vice-captain Mohammad Rizwan hit a Mitchell Swepson delivery to Khawaja at short cover. Khawaja, who had scored his 11th Test century in the first innings, couldn’t manage to hold on to the ball with his helmet on. While a reprieve to Rizwan allowed him to complete a his second Test century, it also denied Swepson off his first wicket of the innings despite bowling 53 overs at that point in time. Having said that, in the larger context, Khawaja’s drop must’ve hurt Australia, who needed three more wickets to win the match. With three more overs remaining in the day, bowling to a Rizwan-less Pakistani lower-order would’ve presented a glance at victory for the visitors. While Pakistan captain Babar Azam (196) played a glorious career-best innings to receive accolades from across the world, Rizwan also ended up with 104* (177) to power the hosts to an unprecedented draw while chasing a 506-run target at the National Stadium. With bowling figures of 55-20-112-4, Australia spinner Nathan Lyon was the pick of their bowlers in the second innings. Apart from Lyon, captain Pat Cummins and all-rounder Cameron Green picked two and a wicket respectively. Video to be uploaded soon. Not meant to be for Usman Khawaja. #PAKvAUS pic.twitter.com/Ngb6HV6gu5 — Adam Collins (@collinsadam) March 16, 2022 Dropped catch of the century? #PakvAus — Mazher Arshad (@MazherArshad) March 16, 2022 Australia after @Uz_Khawaja has already called Rawalpindi and Karachi as his hometown and now drops a crucial catch: pic.twitter.com/xC6CWyVNzs — Urva Shafqat (@urvashafqat_) March 16, 2022 For more cricket-related news, click here .","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Skipper's heroics inspire epic draw with Aussies","link":"https://wwos.nine.com.au/cricket/pakistan-australia-2022-second-test-day-five-scores-babar-azam-century-video-pat-cummins/459e724e-49e2-4808-ae9f-d016d6d574a4","keywords":null,"creator":["wwos"],"video_url":null,"description":"Pakistan and Australia have played out a gripping draw in the second Test, sparked by an incredible Babar Azam knock.","content":"Somehow, out of relatively thin air, Australia and Pakistan have conjured up an enthralling fifth day of Test cricket, which ended in a thrilling draw.It's a funny game sometimes. The damp squib of the first Test, where some were predicting a draw by lunch on the first day, was followed up by more of the same for the first couple of days in Karachi.Instead, Australia's reluctance to enforce the follow-on and instead batting for a meagre total and then declaring blessed us with a day five where all three outcomes were on the table.READ MORE: Footy greats divided in huge Petracca debateREAD MORE: Icon's irresistible case to end hot stadium debateREAD MORE: World No.1 faces ban unless he denounces PutinThe target was 506, a world away from the record fourth-innings chase of 418 by the West Indies in 2003. And yet, thanks to Abdullah Shafique and Babar Azam's third-wicket stand, that mountain became progressively smaller as the day wore on, and a frustrated Australia toiled in the field.Shafique was eventually dismissed after a superb 96, and Fawad Alam shortly after.But it was when Mohammad Rizwan joined Babar at the crease that the unlikeliest of wins became a faint possibility.Babar has quietly established himself as one of the sport's top batters in recent years, but this latest knock, and the names he now sits above, highlight how good he is.He now owns the highest score by a captain in the fourth innings of a Test match - with Michael Atherton, Bevan Congdon, Don Bradman, Ricky Ponting (twice), Graeme Smith, Brian Lara, Virat Kohli and Wally Hammond all below him in the new top-10 list.But when his resistance was finally broken on 196, gloving one off the bowling of Nathan Lyon, Australia kicked the door wide open.Faheem Ashraf went for a golden duck, while Steve Smith had his second catch in four overs when Lyon got Sajid Khan, setting up a tense finish.Rizwan and Nauman Ali steered Pakistan to stumps, the last moment of drama coming when Usman Khawaja dropped a relatively simple catch with 19 balls remaining in the day.But there was one more moment for the home crowd to cheer.Rizwan began the penultimate over on 91, smacked Lyon for two boundaries and then pushed the final delivery away for a single, finishing the match on 104 when the fourth ball of debutant Mitchell Swepson's over, the last of the match, was sent to the ropes.Pakistan had stonewalled through 171.4 overs to avoid a 1-0 series deficit.https://twitter.com/AatifNawaz/status/1504066375526010882Despite everything that went right for the hosts, there is a sense of what might have been, which seems ridiculous when you consider they were chasing more than 500.But with Rizwan and Babar cruising in the second session, T20-esque theatrics weren't required, just a slight uptick in tempo.Instead, the shackles were locked in and the hosts were content to settle for a draw, which they very nearly didn't get.For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here!","pubDate":"2022-03-16 12:58:31","full_description":"Somehow, out of relatively thin air, Australia and Pakistan have conjured up an enthralling fifth day of Test cricket, which ended in a thrilling draw. It's a funny game sometimes. The damp squib of the first Test, where some were predicting a draw by lunch on the first day, was followed up by more of the same for the first couple of days in Karachi. Instead, Australia's reluctance to enforce the follow-on and instead batting for a meagre total and then declaring blessed us with a day five where all three outcomes were on the table. READ MORE: Footy greats divided in huge Petracca debate READ MORE: Icon's irresistible case to end hot stadium debate READ MORE: World No.1 faces ban unless he denounces Putin The target was 506, a world away from the record fourth-innings chase of 418 by the West Indies in 2003. And yet, thanks to Abdullah Shafique and Babar Azam's third-wicket stand, that mountain became progressively smaller as the day wore on, and a frustrated Australia toiled in the field. Shafique was eventually dismissed after a superb 96, and Fawad Alam shortly after. But it was when Mohammad Rizwan joined Babar at the crease that the unlikeliest of wins became a faint possibility. Babar has quietly established himself as one of the sport's top batters in recent years, but this latest knock, and the names he now sits above, highlight how good he is. He now owns the highest score by a captain in the fourth innings of a Test match - with Michael Atherton, Bevan Congdon, Don Bradman, Ricky Ponting (twice), Graeme Smith, Brian Lara, Virat Kohli and Wally Hammond all below him in the new top-10 list. But when his resistance was finally broken on 196, gloving one off the bowling of Nathan Lyon, Australia kicked the door wide open. Faheem Ashraf went for a golden duck, while Steve Smith had his second catch in four overs when Lyon got Sajid Khan, setting up a tense finish. Rizwan and Nauman Ali steered Pakistan to stumps, the last moment of drama coming when Usman Khawaja dropped a relatively simple catch with 19 balls remaining in the day. But there was one more moment for the home crowd to cheer. Rizwan began the penultimate over on 91, smacked Lyon for two boundaries and then pushed the final delivery away for a single, finishing the match on 104 when the fourth ball of debutant Mitchell Swepson's over, the last of the match, was sent to the ropes. Pakistan had stonewalled through 171.4 overs to avoid a 1-0 series deficit. Despite everything that went right for the hosts, there is a sense of what might have been, which seems ridiculous when you consider they were chasing more than 500. But with Rizwan and Babar cruising in the second session, T20-esque theatrics weren't required, just a slight uptick in tempo. Instead, the shackles were locked in and the hosts were content to settle for a draw, which they very nearly didn't get. For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here !","image_url":"https://vms-network-images-prod.s3-ap-southeast-2.amazonaws.com/2022/03/417329/pickerimage.jpg","source_id":"nine","country":["australia"],"category":["sports"],"language":"english"},{"title":"Hardik bowls at NCA, passes Yo-Yo test with flying colours as he gets ready for IPL","link":"https://timesofindia.indiatimes.com/sports/cricket/ipl/top-stories/hardik-pandya-bowls-at-nca-passes-yo-yo-test-with-flying-colours-as-he-gets-ready-for-ipl/articleshow/90272303.cms","keywords":null,"creator":null,"video_url":null,"description":"Injury-ravaged India all-rounder Hardik Pandya has got the all clear to lead Gujarat Titans in the upcoming IPL after a general assessment at the National Cricket Academy (NCA) in Bengaluru where he bowled and also passed the 'Yo-Yo' Test comfortably.","content":null,"pubDate":"2022-03-16 12:49:15","full_description":"NEW DELHI: Injury-ravaged India all-rounder Hardik Pandya has got the all clear to lead Gujarat Titans in the upcoming IPL after a general assessment at the National Cricket Academy ( NCA ) in Bengaluru where he bowled and also passed the 'Yo-Yo' Test comfortably. The BCCI is checking on all its centrally contracted players -- injured or otherwise -- before the IPL and Pandya's performance, during his two days at the NCA, can also be seen as a good sign for Indian cricket. \"Let's make it clear. Fitness test clearance is only for those who are coming back from injury. In case of Hardik, it was about getting a general fitness assessment going into the gruelling IPL season,\" a BCCI source told PTI on conditions of anonymity. Read Also Rahul Tewatia understands that he needs to take 'more responsibility' alongside Hardik Pandya He has been a one-match wonder in IPL but Gujarat Titans all-rounder Rahul Tewatia on Tuesday said that he would need to shoulder a lot of responsibility when he comes out to bat during the upcoming Indian Premier League.​ \"He is an asset and one needed to check his current fitness standards,\" he added. In fact, in his fitness assessment module, the NCA team didn't even mandate him to bowl but the all-rounder apparently \"insisted\" on it to show that he is on track to make a comeback into the Indian team. \"He didn't need to bowl at NCA but he has bowled for considerable time and in the range of 135 kmph. On the second day, he crossed the Yo-Yo test with flying colours with a 17-plus score which is much above the cut-off level,\" the source said. Prithvi Shaw fails 'Yo-Yo' test However, as per information received one player, who would be slightly disappointed with his current fitness status is out-of-favour opener Prithvi Shaw. The former U-19 World Cup winning captain, who is not a part of the central contract, was also at the NCA to provide an update on his fitness status and the result wasn't exactly satisfactory. (Photo by Charle Lombard/Gallo Images/Getty Images) The current Yo-Yo test qualification score is 16.5 for men and it has been learnt that the Mumbai opener has scored less than 15. \"These are just fitness updates. Obviously, it doesn't stop Prithvi from playing for Delhi Capitals in IPL. It's just a fitness parameter and not the be all and end all,\" the source said. \"Look, he has played three Ranji matches back-to-back. Once you play three first-class games on the bounce, the fatigue can also affect your Yo-Yo score,\" he added. Shaw, of late, hasn't been among the fittest of Indian players and perhaps that is one of the reasons that of late, he has not been considered in any of the current senior teams across formats. Even as a replacement, the team management, in the white-ball format, has preferred Mayank Agarwal as a reserve opener despite some underwhelming performances by the Karnataka man. \"If Prithvi is not being repeatedly considered, then perhaps his fitness standards aren't up to the mark, as in what is expected of a Team India player,\" the source said.","image_url":null,"source_id":"toi","country":["india"],"category":["sports"],"language":"english"},{"title":"Most balls faced in Test cricket career: Who has faced most balls faced in a Test innings 4th?","link":"https://thesportsrush.com/cricket-news-most-balls-faced-in-test-cricket-career-who-has-faced-most-balls-faced-in-a-test-innings-4th/","keywords":["Cricket","Australia","Australia tour of Pakistan 2022","babar azam","Pakistan"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Most balls faced in an innings in Test career: Yesteryear batters have played some absolutely gargantuan Test innings. Pakistan captain Babar Azam sixth Test century has seen him also registering a career-best score. Having surpassed the 150-run mark for the first time in his 39th Test, Azam missed out on scoring a 46th double century… The post Most balls faced in Test cricket career: Who has faced most balls faced in a Test innings 4th? appeared first on The SportsRush.","content":"Most balls faced in an innings in Test career: Yesteryear batters have played some absolutely gargantuan Test innings. Pakistan captain Babar Azam sixth Test century has seen him also registering a career-best score. Having surpassed the 150-run mark for the first time in his 39th Test, Azam missed out on scoring a 46th double century by a Pakistani batter. Resuming from his overnight score of 102*, absolutely nothing came in between Azam and a high level of concentration to bat with such discipline for a large part of the day on a Day 5 pitch in the ongoing second Test match against Australia in Karachi. A phenomenal innings was brought to an end by Australia spinner Nathan Lyon as Azam inside-edge a delivery to Marnus Labuschagne at short leg. A heroic effort saw Azam scoring 196 (425) with the help of 21 fours and a six to walk back to a standing ovation at the National Stadium. Leading from the front, Azam made it a point to bat throughout the day irrespective of whether they win or draw this match. A team batting for almost a couple of days to draw (if they manage to survive for a few more overs) a match whilst needing to chase a record 506-run target is nothing less than a victory. Who has faced most balls faced in the fourth innings of a Test match? It is worth mentioning that Azam facing 425 deliveries in a fourth innings of a Test match is only the fourth occasion of a batter lasting for 400+ deliveries in the fourth innings. Azam has joined an elite club comprising of former England captain Michael Atherton, former England batter Herbert Sutcliffe and former India captain Sunil Gavaskar. The longest 4th innings vigil (425 balls) in the last 26 years of Test cricket. That’s the stuff of legend from Babar Azam. Superb effort. #PakvAus — Mazher Arshad (@MazherArshad) March 16, 2022 Batters Balls Team Opposition Year Michael Atherton 492 England South Africa 1995 Herbert Sutcliffe 462 England Australia 1928 Sunil Gavaskar 443 India England 1979 Babar Azam 425 Pakistan Australia 2022 Most balls faced in Test cricket career As far as playing maximum deliveries in a Test innings is concerned, no batter from this century features in the Top Five in this aspect. While the same speaks a lot about modern-day batting known more for shot-making, the latest to face more than 500 deliveries in an innings was India’s Cheteshwar Pujara (525 balls faced vs Australia in Ranchi in 2017). Batters Runs Minutes Balls Team Opposition Ground Year Len Hutton 364 797 847 England Australia The Oval 1938 Glenn Turner 259 704 759 New Zealand West Indies Georgetown 1972 Bob Simpson 311 762 743 Austraia England Manchester 1964 Sid Barnes 234 649 667 Austraia England Sydney 1946 Gary Kirsten 275 878 642 South Africa England Durban 1999 The post Most balls faced in Test cricket career: Who has faced most balls faced in a Test innings 4th? appeared first on The SportsRush.","pubDate":"2022-03-16 12:05:03","full_description":"Most balls faced in an innings in Test career: Yesteryear batters have played some absolutely gargantuan Test innings. Pakistan captain Babar Azam sixth Test century has seen him also registering a career-best score. Having surpassed the 150-run mark for the first time in his 39th Test, Azam missed out on scoring a 46th double century by a Pakistani batter. Resuming from his overnight score of 102*, absolutely nothing came in between Azam and a high level of concentration to bat with such discipline for a large part of the day on a Day 5 pitch in the ongoing second Test match against Australia in Karachi. A phenomenal innings was brought to an end by Australia spinner Nathan Lyon as Azam inside-edge a delivery to Marnus Labuschagne at short leg. A heroic effort saw Azam scoring 196 (425) with the help of 21 fours and a six to walk back to a standing ovation at the National Stadium. Leading from the front, Azam made it a point to bat throughout the day irrespective of whether they win or draw this match. A team batting for almost a couple of days to draw (if they manage to survive for a few more overs) a match whilst needing to chase a record 506-run target is nothing less than a victory. It is worth mentioning that Azam facing 425 deliveries in a fourth innings of a Test match is only the fourth occasion of a batter lasting for 400+ deliveries in the fourth innings. Azam has joined an elite club comprising of former England captain Michael Atherton, former England batter Herbert Sutcliffe and former India captain Sunil Gavaskar. The longest 4th innings vigil (425 balls) in the last 26 years of Test cricket. That’s the stuff of legend from Babar Azam. Superb effort. #PakvAus — Mazher Arshad (@MazherArshad) March 16, 2022 As far as playing maximum deliveries in a Test innings is concerned, no batter from this century features in the Top Five in this aspect. While the same speaks a lot about modern-day batting known more for shot-making, the latest to face more than 500 deliveries in an innings was India’s Cheteshwar Pujara (525 balls faced vs Australia in Ranchi in 2017).","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"New RR captain 2022 IPL: Name of Rajasthan Royals captain 2022 IPL","link":"https://thesportsrush.com/cricket-news-new-rr-captain-2022-ipl-name-of-rajasthan-royals-captain-2022-ipl/","keywords":["Cricket","IPL 2022","Rajasthan Royals","Indian Premier League","rajasthan royals","RR","Sanju Samson","Yuzvendra Chahal"],"creator":["Dixit Bhargav"],"video_url":null,"description":"New RR captain 2022: Rajasthan Royals’ tweet has initiated discussion around their captain for Indian Premier League 2022. Social media interaction including interaction with both players and fans has become one of the common ways of building up to an Indian Premier League season. The upcoming 15th season is no different as all franchises are… The post New RR captain 2022 IPL: Name of Rajasthan Royals captain 2022 IPL appeared first on The SportsRush.","content":"New RR captain 2022: Rajasthan Royals’ tweet has initiated discussion around their captain for Indian Premier League 2022. Social media interaction including interaction with both players and fans has become one of the common ways of building up to an Indian Premier League season. The upcoming 15th season is no different as all franchises are already in the middle of uploading entertaining content across their social media platforms. Rajasthan Royals had a field day on social media platform Twitter where they staged a hilarious incident of spinner Yuzvendra Chahal hacking their account. In what started as Chahal posting his photo as the new captain of the franchise, it was followed by direct messages to fellow spinner Ravichandran Ashwin, wicket-keeper batter Jos Buttler and director of cricket Kumar Sangakkara. New RR captain 2022 It is worth mentioning that a series of tweets posted on Wednesday were just to allure fans’ interest in the build-up to IPL 2022. Therefore, Sanju Samson will continue to lead the franchise in his second season as captain. Highest wicket-taker for Royal Challengers Bangalore, Chahal has never led an IPL franchise in the past. Account was hacked, ignore all tweets and DMs pic.twitter.com/VTZsn7B35P — Rajasthan Royals (@rajasthanroyals) March 16, 2022 Samson, who had become Royals’s sixth captain in IPL 2021 to follow the likes of Shane Warne (55), Shane Watson (21), Rahul Dravid (34), Steven Smith (27) and Ajinkya Rahane (24), had failed to lead his team to the playoffs as five wins and nine losses in 14 league matches had resulted in RR finishing as the seventh-ranked team on the points table. Post retaining Samson (INR 14 crore), Buttler (INR 10 crore) and rookie batter Yashasvi Jaiswal (INR 4 crore), Rajasthan bought 21 more players (spending a grand total of INR 89.05 crore) during the mega auction held in Bengaluru last month. RR squad 2022 IPL Sanju Samson (c & wk), Jos Buttler, Yashasvi Jaiswal, Riyan Parag, Devdutt Padikkal, Ravichandran Ashwin, Trent Boult, Yuzvendra Chahal, Shimron Hetmyer, KC Cariappa, Prasidh Krishna, Navdeep Saini, Obed McCoy, Anunay Singh, Kuldeep Sen, Karun Nair, Dhruv Jurel, Tejas Baroka, Kuldip Yadav, Shubham Garhwal, James Neesham, Nathan Coulter-Nile, Rassie van der Dussen, Daryl Mitchell. The post New RR captain 2022 IPL: Name of Rajasthan Royals captain 2022 IPL appeared first on The SportsRush.","pubDate":"2022-03-16 11:23:24","full_description":"New RR captain 2022: Rajasthan Royals’ tweet has initiated discussion around their captain for Indian Premier League 2022. Social media interaction including interaction with both players and fans has become one of the common ways of building up to an Indian Premier League season. The upcoming 15th season is no different as all franchises are already in the middle of uploading entertaining content across their social media platforms. Rajasthan Royals had a field day on social media platform Twitter where they staged a hilarious incident of spinner Yuzvendra Chahal hacking their account. In what started as Chahal posting his photo as the new captain of the franchise , it was followed by direct messages to fellow spinner Ravichandran Ashwin, wicket-keeper batter Jos Buttler and director of cricket Kumar Sangakkara. It is worth mentioning that a series of tweets posted on Wednesday were just to allure fans’ interest in the build-up to IPL 2022. Therefore, Sanju Samson will continue to lead the franchise in his second season as captain. Highest wicket-taker for Royal Challengers Bangalore, Chahal has never led an IPL franchise in the past. Account was hacked, ignore all tweets and DMs 🙄 pic.twitter.com/VTZsn7B35P — Rajasthan Royals (@rajasthanroyals) March 16, 2022 Samson, who had become Royals’s sixth captain in IPL 2021 to follow the likes of Shane Warne (55), Shane Watson (21), Rahul Dravid (34), Steven Smith (27) and Ajinkya Rahane (24), had failed to lead his team to the playoffs as five wins and nine losses in 14 league matches had resulted in RR finishing as the seventh-ranked team on the points table . Post retaining Samson (INR 14 crore), Buttler (INR 10 crore) and rookie batter Yashasvi Jaiswal (INR 4 crore), Rajasthan bought 21 more players (spending a grand total of INR 89.05 crore) during the mega auction held in Bengaluru last month. Sanju Samson (c & wk), Jos Buttler, Yashasvi Jaiswal, Riyan Parag, Devdutt Padikkal, Ravichandran Ashwin, Trent Boult, Yuzvendra Chahal, Shimron Hetmyer, KC Cariappa, Prasidh Krishna, Navdeep Saini, Obed McCoy, Anunay Singh, Kuldeep Sen, Karun Nair, Dhruv Jurel, Tejas Baroka, Kuldip Yadav, Shubham Garhwal, James Neesham, Nathan Coulter-Nile, Rassie van der Dussen, Daryl Mitchell.","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"“Managed to middle a few”: Herschelle Gibbs reminisces hitting 6 sixes in 2007 ODI World Cup match vs Netherlands","link":"https://thesportsrush.com/cricket-news-managed-to-middle-a-few-herschelle-gibbs-reminisces-hitting-6-sixes-in-2007-odi-world-cup-match-vs-netherlands/","keywords":["Cricket","herschelle gibbs","Herschelle Gibbs 6 sixes"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"Herschelle Gibbs became the first batter to smash six sixes in international cricket during the 2007 Cricket World Cup in West Indies. On this day, 15 years ago, South African batter Herschelle Gibbs became the first player to hit sixes in an over in international cricket. Herschelle Gibbs achieved this feat against the Netherlands in… The post “Managed to middle a few”: Herschelle Gibbs reminisces hitting 6 sixes in 2007 ODI World Cup match vs Netherlands appeared first on The SportsRush.","content":"Herschelle Gibbs became the first batter to smash six sixes in international cricket during the 2007 Cricket World Cup in West Indies. On this day, 15 years ago, South African batter Herschelle Gibbs became the first player to hit sixes in an over in international cricket. Herschelle Gibbs achieved this feat against the Netherlands in the league game of the 2007 ICC World Cup in West Indies. South Africa were up against the Netherlands in the 7th game of the 2007 World Cup. Leg-spinner Daa van Bunge was bowling the 30th over of the innings, and Gibbs smashed Bunge all over the park in that over. The world saw history being made in front of their eyes. Gibbs smashed the first ball over long-on, whereas the next two balls were smashed over the long-off fence. The 4th ball was a full-toss by Bunge and Gibbs smashed it over mid-wicket, Gibbs smashed the 5th ball over the long-off fence again. The last ball was also in Gibbs’ slot, and he cracked it over the deep mid-wicket to create history. Herschelle Gibbs reminisces hitting 6 sixes ICC tweeted the video of Herschelle hitting six sixes on their Twitter handle, and Gibbs also acknowledged the same. “Managed to middle a few,” Gibbs tweeted. Managed to middle a few https://t.co/6Zxw9X2063 — Herschelle Gibbs (@hershybru) March 16, 2022 The South African opener scored 72 runs off just 40 balls and South Africa managed to score 353 runs in 40 overs. South Africa, in the end, won the game by 221 runs. The game was played at Warner Park in St Kitts. Gibbs scored 8094 ODI runs, courtesy of 21 hundreds, whereas he also has 6167 test runs under his belt. Gibbs is one of the finest South African batters to play the game. He although was involved in quite a few controversies as well. After Herschelle Gibbs smashed six sixes in the 2007 World Cup, Yuvraj Singh managed to level him in the same year in the T20 World Cup. Yuvraj Singh smashed six sixes against England at the 2007 ICC T20 World Cup against England.     The post “Managed to middle a few”: Herschelle Gibbs reminisces hitting 6 sixes in 2007 ODI World Cup match vs Netherlands appeared first on The SportsRush.","pubDate":"2022-03-16 10:50:56","full_description":"Herschelle Gibbs became the first batter to smash six sixes in international cricket during the 2007 Cricket World Cup in West Indies. On this day, 15 years ago, South African batter Herschelle Gibbs became the first player to hit sixes in an over in international cricket. Herschelle Gibbs achieved this feat against the Netherlands in the league game of the 2007 ICC World Cup in West Indies. South Africa were up against the Netherlands in the 7th game of the 2007 World Cup. Leg-spinner Daa van Bunge was bowling the 30th over of the innings, and Gibbs smashed Bunge all over the park in that over. The world saw history being made in front of their eyes. Gibbs smashed the first ball over long-on, whereas the next two balls were smashed over the long-off fence. The 4th ball was a full-toss by Bunge and Gibbs smashed it over mid-wicket, Gibbs smashed the 5th ball over the long-off fence again. The last ball was also in Gibbs’ slot, and he cracked it over the deep mid-wicket to create history. ICC tweeted the video of Herschelle hitting six sixes on their Twitter handle, and Gibbs also acknowledged the same. “Managed to middle a few,” Gibbs tweeted. Managed to middle a few 😉 https://t.co/6Zxw9X2063 — Herschelle Gibbs (@hershybru) March 16, 2022 The South African opener scored 72 runs off just 40 balls and South Africa managed to score 353 runs in 40 overs. South Africa, in the end, won the game by 221 runs. The game was played at Warner Park in St Kitts. Gibbs scored 8094 ODI runs, courtesy of 21 hundreds, whereas he also has 6167 test runs under his belt. Gibbs is one of the finest South African batters to play the game. He although was involved in quite a few controversies as well. After Herschelle Gibbs smashed six sixes in the 2007 World Cup, Yuvraj Singh managed to level him in the same year in the T20 World Cup. Yuvraj Singh smashed six sixes against England at the 2007 ICC T20 World Cup against England.","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"The Spin | Stop moaning about draws – they’re part of the fabric and majesty of Test cricket","link":"https://www.theguardian.com/sport/2022/mar/16/the-spin-draws-majesty-fabric-test-cricket","keywords":["Sport","Cricket"],"creator":["Simon Burnton"],"video_url":null,"description":"Is anything about drawn Test matches more irritating than how irritated everyone seems to get by them?For all the damnation and disappointment sparked by the inevitability of the result, there was something fitting about last week’s first Test between Pakistan and Australia ending in a draw. This, after all, is the spiritual home of stalemate: though only 32% of the 2,345 Tests in history have been drawn, in the first half-century of Test cricket in Pakistan 51% of all matches ended without a winner (65 of 128).Between October 1961 and March 1984 England played out 11 successive draws there, including three of the five all-drawn series Pakistan hosted in that time. Fully 69% of all Tests played in Pakistan in the 1960s were drawn, followed by 71% in the 1970s and 56% in the 1980s. Returning to the country for the first time in 24 years Australia picked up where they had left off, with a seventh draw in their last nine matches there going back to 1988. Continue reading...","content":null,"pubDate":"2022-03-16 10:32:51","full_description":"F or all the damnation and disappointment sparked by the inevitability of the result, there was something fitting about last week’s first Test between Pakistan and Australia ending in a draw. This, after all, is the spiritual home of stalemate: though only 32% of the 2,345 Tests in history have been drawn, in the first half-century of Test cricket in Pakistan 51% of all matches ended without a winner (65 of 128). Between October 1961 and March 1984 England played out 11 successive draws there, including three of the five all-drawn series Pakistan hosted in that time. Fully 69% of all Tests played in Pakistan in the 1960s were drawn, followed by 71% in the 1970s and 56% in the 1980s. Returning to the country for the first time in 24 years Australia picked up where they had left off, with a seventh draw in their last nine matches there going back to 1988. Steve Smith bemoaned a “benign, dead wicket”; Wasim Akram thought the pitch guaranteed cricket that “is quite boring, to be honest” and that “as an ex-fast bowler I knew this would be a draw after the second delivery”. “A drawn match is never a good advertisement for Test cricket,” said Ramiz Raja, the chairman of the Pakistan Cricket Board. Meanwhile in Antigua, the first Test between West Indies and England headed along a different path towards the same destination. The former Observer cricket correspondent RC Robertson-Glasgow – who for much of his life laboured under the nickname Crusoe after someone confused his name with that of Daniel Defoe’s castaway – once complained that “drawn matches are the threat and ruin of modern Tests: boring to anticipate, irritating in process, and unsatisfactory in retrospect”, and 84 years and several redefinitions of the word modern later many would still agree. In October 1956, looking back on a season marked by a decline in attendances at English first-class games, the Guardian’s Denys Rowbotham struck a contrasting tone. “To set the wrong right there have been the usual monotonously unvaried panaceas, changes in the laws and in equipment, in the manner of awarding penalties and rewards, and inevitably plans for reorganising the first-class programme,” he wrote. “The falling attendances are believed to be due to dull, tedious cricket. This may be so, it may not be so. Let it be assumed, however, that first-class cricket is boring the public. At once it becomes relevant to ask: was and is first-class cricket primarily intended as a form of entertainment for the general public?” The only possible answer to this question is negative. A Test is essentially an exercise in which one group of cricketers attempts ideally to beat, and failing that to avoid defeat by, another group of cricketers within the laws of the game, and which others may watch if they insist on doing so. For most of the game’s history so many people have chosen to watch that stands have had to be built to accommodate them, tickets have been issued, television cameras installed, commentators employed. But if the entertainment of any of those people were actually important, by now surely something would have been done to make it more likely. There are plenty of sports, and even other versions of cricket, which, like the theatre or a circus, are nothing if nobody is there to watch. Some sports – and this really is a very puzzling concept – last barely three hours from start to finish yet during even brief breaks in play troupes of dancers emerge to wave shimmering tinsel balls to a deafening soundtrack, lest any spectator think for an instant that they are not being constantly entertained. How boring must a spectacle be to require such adornment? And how its organisers must envy a sport that can last for five full days, not even guarantee a result, and offer spectators no entertainment during its regular extended breaks beyond lengthy bar queues. Such confidence! And yet, as a century of public hand-wringing attests, such insecurity! Tests are surely about moments, spells and sessions as much as they are about results, with thrilling climaxes rendered even more precious by how unlikely the format makes them. Is anything about drawn Tests more irritating than how irritated everyone gets by them? It is perfectly understandable to desire results and entertainment, and there are pastimes that guarantee those, but this is not one of them. If draws have been irritating and unsatisfactory for as long as they have without anyone legislating against them, then they’re obviously not irritating or unsatisfactory at all. In the final Ashes Test of 1963 at the SCG, Australia, set a target of 241 by England’s last-day declaration, laboured to 152 for four at the close of play having scored 2.11 runs per eight-ball over. A draw had long seemed inevitable, and only 14,000 people turned up to watch it be confirmed. “At the last, as the sun cast long shadows on the grass, no people congregated round the pavilion, and there were no calls for either side’s players or captain,” Rowbotham reported. “Enthusiasm had given way to disillusionment.” Ted Dexter, the England captain, admitted that “if there had been a thousand pounds per man for winning this game there would have been a result”. In the stands a certain John Baldry, an estate agent from Sydney’s Bellevue Hill, was miffed. He had taken time off work and spent £3 (Australia adopted dollars three years later) on attending, and had expected better. So he sued. “He is entitled to certain standards and certain competency,” said his lawyer when the case came to trial. “Above all, he is entitled to an effort by both sides to win the game. If he does not get this quality he is entitled to his money back.” On reflection, the judge decided he was not. This is an extract from the Guardian’s weekly cricket email, The Spin. To subscribe and get the full edition, visit this page and follow the instructions .","image_url":"https://i.guim.co.uk/img/media/ad02eae23d80ee921273a80733c6a830015525b6/0_19_1917_1150/master/1917.jpg?width=460&quality=85&auto=format&fit=max&s=c7ef25a0c359ff246ce621a7bb242b56","source_id":"theguardian","country":["united kingdom","india","singapore","canada"],"category":["sports"],"language":"english"}]}