{"newsArray":[{"title":"Hapless Sri Lanka look for consolation win against Pakistan","link":"https://www.thenews.com.pk/print/963492-hapless-sri-lanka-look-for-consolation-win-against-pakistan","keywords":null,"creator":null,"video_url":null,"description":"KARACHI: Following back-to-back wins, Pakistan women cricket team will be eyeing the third victory on the trot and complete a clean sweep of the series when they meet Sri Lanka in their third and last game of the ODI series here at the Southend Club Cricket Stadium on Sunday .As the series is also...","content":"KARACHI: Following back-to-back wins, Pakistan women cricket team will be eyeing the third victory on the trot and complete a clean sweep of the series when they meet Sri Lanka in their third and last game of the ODI series here at the Southend Club Cricket Stadium on Sunday (today). .ads_between_content{ height:auto; width:auto; clear: both; text-align: center; } .ads_between_content .story_ads{ } /*@media (max-width:600px){ .ads_between_content{ float:none; margin:0px auto; text-align: center; } }*/ As the series is also part of the ICC Women Championship 2022-2025 cycle, another win will add two more points to Pakistan’s tally. Pakistan currently have four points from two wins over Sri Lanka who have been struggling throughout the series. On the other hand, it will be another test for Chamari Athapaththu’s Sri Lanka as they were never seen prevailing over Pakistan at any stage of the series, which also contained three T20Is, won by the hosts 3-0. Having a strong bowling attack with multiple effective spin options, Bismah Maroof-side will be looking to repeat their last match batting performance. Powered by Sidra Amin’s fantastic 123 and Muneeba Ali’s sedate 56, Pakistan had put on 253-2 in the allotted 50 overs after opting to bat first in the second ODI on Friday. Fatima Sana, the young pacer, then got 4-26 in her quota of ten overs to restrict Sri Lanka to 180-9. Sri Lanka, although, have a good bowling combination, will have to bat with a solid plan in order to put a big total on the board in case of batting first. If they are going to chase then they will have to achieve the target with a sort of maturity which is needed for a team playing at this stage. Chamari had said after the second match that her unit would try to do well in the final game. \"There is one game left now and we will try to do well in that,\" she had said. Sri Lanka also will have to improve their fielding if they are to win the game against Pakistan which have ably exploited home conditions so far. Pakistan’s skipper Bismah Maroof said they would try to win the series and so to get two more points. \"Definitely we will go for a win and for the two more points,\" Bismah said after the second game which Pakistan won by 73 runs on Friday. Pakistan squad: Bismah Maroof (captain), Aiman Anwar, Aliya Riaz, Anam Amin, Diana Baig, Fatima Sana, Ghulam Fatima, Gull Feroza, Muneeba Ali Siddiqui (wicketkeeper), Nida Dar, Omaima Sohail, Sadaf Shamas, Sadia Iqbal, Sidra Amin and Sidra Nawaz (wicket-keeper). Sri Lanka squad: Chamari Athapaththu (captain), Achini Kulasuriya, Ama Kanchana, Anushka Sanjeewani, Harshitha Samarawickrama, Hansima Karunaratne, Hasini Perera, Inoka Ranaweera, Kavisha Dilhari, Nilakshi de Silva, Oshadhi Ranasinghe, Prasadani Weerakkody, Sachini Nisansala, and Sugandika Kumari.","pubDate":"2022-06-05 00:54:41","image_url":null,"source_id":"thenews","country":["pakistan"],"category":["sports"],"language":"english"},{"title":"Saqlain eyes clean sweep against Windies in Multan","link":"https://www.thenews.com.pk/print/963491-saqlain-eyes-clean-sweep-against-windies-in-multan","keywords":null,"creator":null,"video_url":null,"description":"ISLAMABAD: Pakistan’s head coach Saqlain Mushtaq is eyeing a clean sweep against West Indies, pointing out that the Green-shirts will have to play the best brand of cricket to beat \"tough opponents\".Talking to the media on Saturday, Saqlain said his team would go all out for a clean sweep in...","content":"ISLAMABAD: Pakistan’s head coach Saqlain Mushtaq is eyeing a clean sweep against West Indies, pointing out that the Green-shirts will have to play the best brand of cricket to beat \"tough opponents\". .ads_between_content{ height:auto; width:auto; clear: both; text-align: center; } .ads_between_content .story_ads{ } /*@media (max-width:600px){ .ads_between_content{ float:none; margin:0px auto; text-align: center; } }*/ Talking to the media on Saturday, Saqlain said his team would go all out for a clean sweep in theforthcoming ODI series. “We know well that we have cricketers capable of beating the best in the world. I have to admit that West Indies have got a powerful outfit, yet I am confident that we can win the ODI series 3-0.” At the same time, the national cricket team head coach called on his charges to play cricket at their best. “Every player is charged up to play his best cricket. Pakistan will have to play their A game to beat the West Indies. I am sure that every member is capable of that and ready for the top-quality cricket game.” He admitted that heat would be a huge factor in the series. “Multan’s heat is a vital factor. Our support staff is taking measures to counter the heat element. For a professional sportsman, it is important to give his best in all conditions.” Saqlain hoped that his team would be seen taking on the Caribbean team in the most professional manner. “Look every team has got its strength. We have our own and the West Indies have their own. Our cricketers have gone through the required rest period. Now they are charged up to perform and make the best use of the coming opportunity. The series is part of the qualification round for the 2023 World Cup. Therefore, looking at the importance of the series, I am confident that every cricketer would show his class,” the former off-spinner said. Replying to a question on Hasan Ali, Saqlain said he was a bit tired in recent times. “Now he is fit and ready for the series as he has gone through the required rest period,” he assured. The head coach spoke highly of Babar Azam as a leader and a player. “His contributions for the team have been of top quality. Babar is a quality leader and a player,” he said. He did not underestimate the West Indies team at all. “They are arriving here following the series against Holland. So, they are in-form and definitely in good shape. We haven’t worked on the strategy as yet, but we will be doing that shortly.\" Saqlain admitted that there had been examples where Pakistan got off to a slow start in the series played in the past. “We would try to overcome these flaws. If ever we have got off to a slow start, we would try to remove these by playing aggressive professional cricket. I am hopeful that my team is ready for that. All and all it would be an interesting series where you would see some quality brand of cricket.\"","pubDate":"2022-06-05 00:54:41","image_url":null,"source_id":"thenews","country":["pakistan"],"category":["sports"],"language":"english"},{"title":"The future of women’s cricket looks grim","link":"https://www.cairnspost.com.au/sport/cricket/really-disappointing-cricket-boss-casts-doubt-over-future-of-womens-tests/news-story/ab4ac5668bdb09e8cdb70deae29a2672","keywords":["Cricket news and galleries","Kayo","Sport news and galleries","Womens Cricket"],"creator":null,"video_url":null,"description":"International Cricket Council independent chair Greg Barclay has warned that women’s Tests might not be part of the sport’s landscape moving forward because white-ball cricket is “driving the money”.","content":null,"pubDate":"2022-06-04 20:45:00","image_url":null,"source_id":"cairnspost","country":["australia"],"category":["sports"],"language":"english"},{"title":"Primal power of Kyle Jamieson is one of Test cricket’s great wonders | Jonathan Liew","link":"https://www.theguardian.com/sport/blog/2022/jun/04/primal-power-kyle-jamieson-great-wonder-test-cricket-new-zealand-england","keywords":["England v New Zealand 2022","England cricket team","New Zealand cricket team","Cricket","Sport"],"creator":["Jonathan Liew at Lord's"],"video_url":null,"description":"The towering bowler’s almost mythic qualities will be a major hurdle for England to negotiate if they are to win at Lord’sIt was around a quarter to five, with Joe Root and Ben Stokes settling in and nerves just beginning to jangle, that Nasser Hussain on Sky Sports urged New Zealand to bring Kyle Jamieson back into the attack. Alas, on this occasion his timing was slightly unfortunate. For as the camera homed in on Jamieson at long-leg, the giant fast bowler was just in the process of stifling a large yawn.You couldn’t blame him, really. For one thing, he had already put in quite the shift earlier in the afternoon: eight back-breaking overs that had ripped out England’s top order and left them close to a chaotic defeat. For another, Test cricket when played at its normal pace must feel terribly languid and laborious to Jamieson, a man who in his short international career has become accustomed to things unfolding in a tremendous hurry. Continue reading...","content":"I t was around a quarter to five, with Joe Root and Ben Stokes settling in and nerves just beginning to jangle, that Nasser Hussain on Sky Sports urged New Zealand to bring Kyle Jamieson back into the attack. Alas, on this occasion his timing was slightly unfortunate. For as the camera homed in on Jamieson at long-leg, the giant fast bowler was just in the process of stifling a large yawn. You couldn’t blame him, really. For one thing, he had already put in quite the shift earlier in the afternoon: eight back-breaking overs that had ripped out England’s top order and left them close to a chaotic defeat. For another, Test cricket when played at its normal pace must feel terribly languid and laborious to Jamieson, a man who in his short international career has become accustomed to things unfolding in a tremendous hurry. Joe Root stands firm to give England hope of overhauling New Zealand Read more Let’s start with the average, both the most and least interesting thing about him. Given a minimum of 50 wickets, Jamieson currently has the lowest Test average of any male cricketer born since the end of the 19th century. It was 18.72 at the start of this match and has since dipped lower still. Statistically speaking, Jamieson is 13% better than Malcolm Marshall, 29% better than Shane Warne, 32% better than Jimmy Anderson. A numerical quirk that will even out in time? Or greatness in the making? There was some talk at the start of this series that after a mixed home summer against Bangladesh and South Africa, Jamieson had somehow been “worked out”: that after an incendiary first year in Test cricket, an inevitable regression to the mean was in progress. But the metaphor never quite seemed to fit, because there is no real mystery or secret to what Jamieson does. He runs in over 18 menacing steps, leaps into a powerful delivery stride and hurls the ball down from a height of about 2.3 metres with extreme accuracy, healthy pace and the ability to move the ball both ways. Great: you’ve worked Kyle Jamieson out. Anyway, best of luck playing him. New Zealand’s Kyle Jamieson is congratulated by his team-mates after taking Ben Stokes’ wicket on the third day of the first Test. Photograph: Tom Jenkins/The Observer The other thing that everyone talks about is Jamieson’s height. He stands 6ft 8in tall, New Zealand’s tallest cricketer, an asset that works on a practical and psychological level. The extra height gives him extra bounce off the pitch, more margin for error with his length, the best chance of extracting life from the surface. Batters are wary of driving him and so even when the ball is there to be driven they often fail to get fully forward, bringing the edge into play. But there is a primal and mythical power to Jamieson too, the long shadow and the broad gait and the flaxen mop, the way he seems to tower over you even when he is standing 40 yards away at the end of his run-up. Jamieson looks like a man who has just fought off an entire Spartan phalanx with his bare hands. Like a man who has just retrieved a magical hammer from the bottom of the ocean. He suffered from anger issues when he was younger – he is 27 now – and you still occasionally glimpse it in that smouldering glare, the follow-through that is just a few steps longer than it needs to be. There is not a batter on earth who relishes facing him. Particularly not Virat Kohli, who has frequently looked utterly bereft against Jamieson and was dismissed by him in both innings of last year’s World Test Championship final. Old warrior Broad lights up Lord’s to prove he still has appetite for the fight Read more And yet – obviously – there is more to Jamieson than pure physicality. Take his opening spell on Saturday, which featured three wickets captured via three forms of deception. Alex Lees was bowled shouldering arms to a vicious in-ducker. It looked like a magic ball and it was. But just as crucial was the setup: three shorter straighter deliveries that convinced Lees that he could leave on length. Next Zak Crawley was flummoxed by the wider angle on the crease, stabbing the ball to gully. Jonny Bairstow’s dismissal was perhaps the most comprehensive of all: four wide ones outside off stump, then the inswinger that jerked down the slope and bowled him off the inside edge. Then, with the shadows lengthening and Stokes threatening to cut loose, Jamieson got him with a searing bouncer that homed in on Stokes’s throat and brushed the glove. England’s Jonny Bairstow is bowled by Kyle Jamieson. Photograph: Tom Jenkins/The Observer The adjustments are subtle, minuscule, microscopic: a little tilt of the seam, an extra few inches of length. But amplified by his pace and bounce, the effect can be devastating: the hallmark of a bowler who for all his heart and height is also devilishly clever. The Spin: sign up and get our weekly cricket email. Maybe this is why Jamieson has thus far struggled to replicate his Test success in the Twenty20 game, where bowlers need six different deliveries for every ball, where batters do not wait to be set up. And doubtless in time that average will begin to tick up a few notches, once he has toiled on the featherbeds of south Asia, once he has been to Australia and South Africa. For now, though, Test cricket and New Zealand are fortunate to have him at his best. And as England edge towards their target , it is Jamieson who stands in their way: the titan guarding the gates of victory.","pubDate":"2022-06-04 20:08:15","image_url":"https://i.guim.co.uk/img/media/55099e221d41476774b47a19a332bd2b2e2412b9/1_0_4627_2777/master/4627.jpg?width=460&quality=85&auto=format&fit=max&s=145abbbbf7ee829e03973db964a5610d","source_id":"theguardian","country":["united kingdom","india","singapore","canada"],"category":["sports"],"language":"english"},{"title":"Grand Prix Badminton League launched with Sindhu, Srikanth, Prannoy as mentors","link":"https://www.thehansindia.com/sports/grand-prix-badminton-league-launched-with-sindhu-srikanth-prannoy-as-mentors-746818","keywords":["Sports,Today NewsPaper"],"creator":["The Hans India"],"video_url":null,"description":"Top Indian shuttlers like two-time Olympic medallist P.V. Sindhu, former World No. 1 Kidambi Srikanth","content":"Bengaluru: Top Indian shuttlers like two-time Olympic medallist P.V. Sindhu, former World No. 1 Kidambi Srikanth, World championship bronze medallist B. Sai Praneeth, Jwala Gutta, Ashwini Ponappa, Chirag Shetty, Satwiksairaj Rankireddy and H.S. Prannoy will act as mentors of the eight franchises that will clash for honours in the inaugural edition of Grand Prix Badminton League (GPBL) which will be held from July 1-10. The Grand Prix Badminton League, Karnataka's own Premier League, played under the aegis of the Karnataka Badminton Association, was officially launched at a function held here on Saturday. Sindhu, who is the co-owner of the City team Bengaluru Lions, said she was excited to be a part of GPBL. \"We all know what these kinds of leagues have done to games other than cricket. I think this is a platform to unearth talent while taking the game to the masses. I am super thrilled to be a part of GPBL,\" said Sindhu after unveiling the Trophy. Besides Bengaluru Lions, the seven other teams in the fray are Mangalore Sharks, Mandya Bulls, Mysore Panthers, Malnad Falcons, Bandipur Tuskers, KGF Wolves, and Kodagu Tigers. Each team comprises 10 players each, of which, a minimum of five players will have to be from the State and a minimum of three women players, the organisers informed in a release on Saturday. The total prize purse will be Rs 60 lakh with the winning team walking away with a cheque of Rs 24 lakh while the runners-up will pocket Rs 12 lakh. The semifinalists will be richer by Rs 6 lakh apiece while the 5th placed team will receive Rs 4 lakh. The last three placed teams will earn Rs 3 lakh, Rs 2 lakh and Rs 1 lakh respectively. Apart from the team honours, various individual performances in every game and the overall season will be awarded. The teams will be mentored by their respective superstars. Malnad Falcons will be mentored by Chirag Shetty while Bandipur Tuskers will have the expertise of Jwala Gutta, who is also the co-owner of the team. Mysore Panthers will be guided by Satwiksairaj Rankireddy while the Kodava Tigers will be guided by Ashwini Ponnappa. The Mandya Bulls will have the support of Sai Praneeth and KGF Wolves will be mentored by HS Prannoy. The Mangalore Sharks will have Srikanth Kidambi as their ambassador while the Bengaluru Lions will be tutored by Sindhu. Unique format The League will be played in a round-robin format until the top four teams qualify for the double-elimination stage (semifinals). Each encounter will consist of five matches -- men's singles, women's singles, mixed doubles, men's doubles and a 'Super Match' format where players can tag in teammates into the match at intervals of seven points. In this format, the match begins with two singles players for the first seven points, transforms into a doubles match for the next seven points and becomes triples for the last seven points. The first team to score 21 points wins the tie. As an additional innovation, the organisers have introduced a 'golden point' which would be worth two points if the server wins the point after announcing it to the opponent before serving. In case the player loses the point, the opponent will get two points. The golden point has to be mandatorily used in every game by both the players.","pubDate":"2022-06-04 19:28:15","image_url":"https://assets.thehansindia.com/h-upload/2022/06/04/500x300_1296088-sports.jpg","source_id":"thehansindia","country":["india"],"category":["sports"],"language":"english"},{"title":"PAT vs SMA Dream11 Prediction: Fantasy Cricket Tips, Today's Playing 11 and Pitch Report for Pondicherry T10 2022 Match 50","link":"https://www.sportskeeda.com/fantasy-cricket-mantra/pat-vs-sma-dream11-prediction-fantasy-cricket-tips-today-s-playing-11-pitch-report-pondicherry-t10-2022-match-50?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Fantasy Cricket Mantra"],"creator":["Sahil Jain"],"video_url":null,"description":null,"content":"Patriots will take on Smashers in match number 50 of the Pondicherry T10 2022 at the Cricket Association Puducherry Siechem Ground in Puducherry on Sunday. Patriots are in superb form and are sitting pretty at the top of the points table. They have eight wins and three losses apart from one tie. On the other hand, Smashers have been in good form and have a win-loss record of 7-5. They are currently third in the points table. Patriots : Naveen Karrthikeyan D (c & wk), S Parameeswaran, V Shashank, Jai Dagar, Nitin Kumar, Krishna Pandya, S Venkadesan, Subramaniyan K, Yathish Kumar-N, Avinash Badrinath, Jaya Surya Prabah Smashers : M Mathavan (c & wk), Mohit Mittan, P Sunil Kumar, Karthik B Nair, R Adithya Reddy, Vijay Rajaram, Akshay Jain S, Vishal Khokhar, Mohammed Shafeequddin, Rishi Raut, Sivakumar Subramani PAT vs SMA, Pondicherry T10 2022, Match 50 Date & Time: June 5, 2022, 8:30 AM IST Venue: Cricket Association Puducherry Siechem Ground, Puducherry The track at the Cricket Association Puducherry Siechem Ground in Puducherry is likely to be a good one to bat on. A high-scoring game may be on the cards. There could be some turn for the spinners. Wicketkeeper M Mathavan has chipped in nicely with the bat and has got 143 runs at a strike rate of 147.42. Story continues below ad Batters S Parameeswaran has had a huge impact with both bat and ball. He has returned with 209 runs, striking at 188.29 and has also taken 17 wickets with the ball. All-rounders Krishna Pandya is the third-highest run-getter in this competition and has scored 315 runs at a strike rate of 246.09. He also has eight wickets to his name. Bowlers Akshay Jain S is at the top of the wicket charts in this tournament. He has picked up 20 scalps at an economy rate of 7.09. S Parameeswaran (PAT): 936 points Krishna Pandya (PAT): 906 points Akshay Jain S (SMA): 796 points Mohit Mittan (SMA): 667 points R Adithya Reddy (SMA): 521 points Akshay Jain S: 20 wickets Mohit Mittan: 359 runs S Parameeswaran: 209 runs & 17 wickets Krishna Pandya: 315 runs & 8 wickets Story continues below ad Fantasy Suggestion #1: Naveen Karrthikeyan D, M Mathavan, V Shashank, S Parameeswaran, Mohit Mittan, Krishna Pandya, R Adithya Reddy, Vijay Rajaram, Avinash Badrinath, Mohammed Shafeequddin, Akshay Jain S Captain: Krishna Pandya Vice-captain: Akshay Jain S Story continues below ad Fantasy Suggestion #2: M Mathavan, V Shashank, Nitin Kumar, S Parameeswaran, Mohit Mittan, Krishna Pandya, R Adithya Reddy, Vijay Rajaram, Avinash Badrinath, Jaya Surya Prabah, Akshay Jain S Captain: S Parameeswaran Vice-captain: Mohit Mittan Q. 0 votes so far","pubDate":"2022-06-04 19:13:55","image_url":"https://staticg.sportskeeda.com/editor/2022/03/938e2-16482333895985-1920.jpg","source_id":"sportskeeda","country":["india"],"category":["sports"],"language":"english"},{"title":"Root Leads The Chase! | Highlights | England v New Zealand - Day 3 | 1st LV= Insurance Test 2022 - England & Wales Cricket Board","link":"https://news.google.com/__i/rss/rd/articles/CBMiK2h0dHBzOi8vd3d3LnlvdXR1YmUuY29tL3dhdGNoP3Y9M1drV3FoRjREaUnSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Root Leads The Chase! | Highlights | England v New Zealand - Day 3 | 1st LV= Insurance Test 2022  England & Wales Cricket BoardRecent Match Report - New Zealand vs England 1st Test 2022  ESPNcricinfoEngland vs New Zealand, 1st Test, Day 3 Live Score Updates: Joe Root Puts England On Top In Chase Of..  NDTV SportsWatch: Broad completes England team hat-trick, coach Brendon McCullum reacts  Hindustan TimesEngland vs New Zealand: Hosts start new era strongly, but old problems continue - Opinion News , Firstpost  FirstpostView Full coverage on Google News","content":null,"pubDate":"2022-06-04 18:48:24","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"‘Jashn-e-Gurez’ inter school volleyball tournament held","link":"https://kashmirreader.com/2022/06/05/jashn-e-gurez-inter-school-volleyball-tournament-held/","keywords":["SPORTS"],"creator":["KR Desk"],"video_url":null,"description":"Srinagar: As the Jashn-e-Gurez festival progressed into the 4th day of grand events, an inter school volleyball tournament was organised today at the Dawar Helipad ground in Gurez by the Indian Army in collaboration with the Zonal Physical Education Department, a statement issued by army said. More than 12 schools comprising of 84 boys and […]","content":"Srinagar: As the Jashn-e-Gurez festival progressed into the 4th day of grand events, an inter school volleyball tournament was organised today at the Dawar Helipad ground in Gurez by the Indian Army in collaboration with the Zonal Physical Education Department, a statement issued by army said. More than 12 schools comprising of 84 boys and girls from different parts of the valley participated in the event. The event was aimed at promoting sports and fitness among the youth in order to constructively engage the youth constructively. The gripping competition witnessed a tough battle amongst the teams and loud cheers from the supporting crowd. After gruelling round of matches and tough competition, Girls Higher Secondary School Dawar emerged as the winner and High School Wampora secured the Runners up position in the Girls under-17 category. In the Boys under-17 category, Boys Higher Secondary School was victorious and Army Goodwill School, Dawar secured the Runners up position. The Winners and Runner Up teams were awarded with special certificates and medals whereas all other teams were awarded participation certificates. The Jashn-e-Gurez Festival is being conducted in Gurez from 01-20 June by the Indian Army in Collaboration with the District Administration and the J&K Tourism department to boost the tourism potential of this pristine unexplored valley and promote it as an offbeat adventure tourism destination. Many more events such as Marathon, Cycle rally, Treks, Bike rally, cricket tournament, village games and cultural programs are being organised by the Indian Army during the 20 day long festival which will ensure a permanent mark of Gurez on the tourism map of the country. ‘Jashn-e-Gurez’ inter school volleyball tournament held added by KR Desk on 12:08 am June 5, 2022 View all posts by KR Desk → KR Desk Facebook Twitter WhatsApp Email Print Related","pubDate":"2022-06-04 18:38:42","image_url":null,"source_id":"kashmirreader","country":["india"],"category":["sports"],"language":"english"},{"title":"Ravichandran Ashwin: रविचंद्रन अश्विन ने शेयर किया ऐतिहासिक गाबा टेस्ट का किस्सा, कहा- हमारे कोच ड्रा चाहते थे, लेकिन यह खिलाड़ी...","link":"https://www.abplive.com/sports/ipl/ravichandran-ashwin-says-we-wanted-to-play-for-a-draw-in-the-historic-gabba-test-2139044","keywords":null,"creator":["ABP Live"],"video_url":null,"description":"<p style=\"text-align: justify;\"><strong>Ravichandran Ashwin On Gaba Test:</strong> भारतीय टीम ने साल 2020-21 में आस्ट्रेलियाई जमीन पर 2-1 से टेस्ट सीरीज अपने नाम किया था. टेस्ट क्रिकेट के इतिहास में यह भारतीय टीम की सबसे बड़ी उपलब्धियों में एक माना जाता है. इस सीरीज में विराट कोहली जैसे खिलाड़ी टीम का हिस्सा नहीं थे. इसके अलावा कई प्रमुख खिलाड़ी चोट के कारण नहीं खेल पाए थे. लेकिन इसके बावजूद भारतीय टीम ने इस सीरीज को अपने नाम किया. इस सीरीज जीत में दिग्गज स्पिनर रवि अश्विन का अहम योगदान रहा है. अब इस सीरीज से जुड़ा एक किस्सा रवि अश्विन ने शेयर किया है.</p> <p style=\"text-align: justify;\"><strong>'ऋषभ पंत के दिमाग को पढ़ना बहुत मुश्किल'</strong></p> <p style=\"text-align: justify;\">रवि अश्विन ने कहा कि ऋषभ पंत के दिमाग में क्या चल रहा होता है, यह पता करना बहुत मुश्किल होता है. वह कुछ भी कर सकते हैं. ऋषभ पंत के पास बड़े शॉट लगाने की गजब की क्षमता है. वह हर बॉल को बाउंड्री पार मार सकता है. उन्हें शांत रखना बहुत मुश्किल काम है. रवि अश्विन ने इस सीरीज के सिडनी टेस्ट का जिक्र करते हुए कहा कि जब ऋषभ पंत शतक के करीब थे तो हमने उसे शांत करने की कोशिश की. लेकिन उसने ऐसा नहीं किया. इस वजह से वह अपना शतक पूरा नहीं कर पाए. इसके बाद भारतीय ऑफ स्पिनर ने गाबा में खेले गए चौथे टेस्ट का जिक्र किया.</p> <p style=\"text-align: justify;\"><strong>'गाबा टेस्ट में हम ड्रा के लिए खेलना चाहते थे'</strong></p> <p style=\"text-align: justify;\">रवि अश्विन ने कहा कि गाबा टेस्ट में हम ड्रा के लिए खेलना चाहते थे. हम उस मैच को ड्रा कर सकते थे. लेकिन सबके पास अपना अलग प्लेन था. जब मैनें अंजिक्य रहाणे से पूछा कि क्या हमें इस मैच में जीत के लिए जाना चाहिए. इसके जवाब में रहाणे ने कहा कि ऋषभ पंत अपना गेम खेल रहा है. हम देखते हैं कि यह गेम किस तरफ जाता है. उसके बाद जब वाशिंगटन सुदंर बैटिंग करने आए और तकरीबन 20 रन बनाए तो हमारी सोच बदल गई. वाशिंगटन सुदंर की यह 20 रनों की पारी बेहद अहम पारी थी. गौरतलब है कि इस मैच में भारतीय टीम ने चौथी पारी में 329 रनों का पीछा कर ऐतिहासिक जीत दर्ज की थी.</p> <p style=\"text-align: justify;\"><strong>ये भी पढ़ें-</strong></p> <p style=\"text-align: justify;\"><strong><a href=\"https://www.abplive.com/sports/cricket/chennai-super-kings-bowler-mukesh-chaudhary-said-that-he-had-prepared-a-special-plan-for-the-match-against-mumbai-indians-2138947\">CSK के खिलाड़ी ने किया खुलासा, बताया- मुंबई इंडियंस के खिलाफ मैच के लिए तैयार किया था 'स्पेशल प्लान'</a><br /></strong></p> <p><strong><a href=\"https://www.abplive.com/sports/khelo-india-youth-games-2021-launched-in-panchkula-union-home-minister-amit-shah-attended-as-chief-guest-2139004\">Khelo India Youth Games 2021: पंचकुला में खेलो इंडिया यूथ गेम्स 2021 का शुभारंभ, मुख्य अतिथि के तौर पर शामिल हुए केंद्रीय गृह मंत्री अमित शाह</a></strong></p>","content":null,"pubDate":"2022-06-04 18:05:35","image_url":null,"source_id":"abplive","country":["india"],"category":["sports"],"language":"hindi"},{"title":"“Ben Stokes and his hand of God moment”: Ben Stokes recreates the 2019 ICC World Cup Final overthrows moment all over again during ENG vs NZ Test match at Lord’s","link":"https://thesportsrush.com/cricket-news-ben-stokes-and-his-hand-of-god-moment-ben-stokes-recreates-the-2019-icc-world-cup-final-overthrows-moment-all-over-again-during-eng-vs-nz-test-match-at-lords/","keywords":["Cricket","Ben Stokes","lords"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Ben Stokes recreates the 2019 ICC World Cup final overthrows moment yet again which helped them lift their maiden title in history. On ‘Day 3’ of the ongoing first Test match between England and New Zealand at the Lord’s Cricket Ground, the England skipper and all-rounder Ben Stokes almost pulled off that 2019 World Cup… The post “Ben Stokes and his hand of God moment”: Ben Stokes recreates the 2019 ICC World Cup Final overthrows moment all over again during ENG vs NZ Test match at Lord’s appeared first on The SportsRush.","content":"Ben Stokes recreates the 2019 ICC World Cup final overthrows moment yet again which had helped them lift their maiden title in history. On ‘Day 3’ of the ongoing first Test match between England and New Zealand at the Lord’s Cricket Ground, the England skipper and all-rounder Ben Stokes almost pulled off that 2019 World Cup final moment, where his dive at the striker’s end had the ball deflect off his bat for a boundary in the last Over. It all happened on the first delivery of the 43rd Over of England’s second innings. Joe Root pulled the short delivery bowled by Trent Boult towards the fielder stationed at mid-wicket, who affected a brilliant diving stop to his right. Stokes, at the non-striker’s end was in two minds to go for the run or not, as Root had his eyes on the ball and the fielder. With him almost halfway down the pitch, Root refused to take the run with the fielder also in a good enough position to aim at the stumps in the bowler’s end. Ultimately, while the fielder did aim at that end, a full stretch extension of his arms meant that Stokes was safely back home, but the ball deflected off his bat towards the mid-off region, to bring about smiles on almost everyone’s faces. Post the deflection, almost everyone in the ground went nostalgic and had flashbacks of the famous World Cup final overthrows moment, which had become a massive topic of debate for many days. While the batters decided to not go for the extra run, both Stokes and then Root put their hands up, to imitate the former’s ‘not guilty’ moment back then post that dive, which had cost New Zealand as many as six runs on the penultimate delivery of the World Cup final. Coincidence much, on both the occasions it was Trent Boult with the ball in hand with the match venue being the Lord’s Cricket Ground. Ben stokes and his hand of god moment.. https://t.co/B0uvMKgX5F — movieman (@movieman777) June 4, 2022 If you know, you know 😅 🏴󠁧󠁢󠁥󠁮󠁧󠁿 #ENGvNZ 🇳🇿 pic.twitter.com/ZyIcvwkk8B — England Cricket (@englandcricket) June 4, 2022 As far as the ongoing match is concerned, Stokes and Root stitched a 90-run partnership for the fifth wicket en route their chase of 277 runs, after the former got a reprieve at the score of one on his birthday after being cleaned-up by Colin de Grandhomme off a No Ball. The England skipper then went on to score 54 (110), before getting dismissed off a bouncer from Kyle Jamieson. With 5 wickets in hand, England now need under 100 runs for victory, with Root still at the crease.","pubDate":"2022-06-04 17:27:03","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"पॉप स्टार शकीरा ने ब्रेकअप की खबर को किया कंफर्म, 12 साल से स्टार फुटबॉलर गेरार्ड पिके से था रिश्ता","link":"https://www.abplive.com/sports/pop-star-shakira-confirms-breakup-was-in-relationship-with-star-footballer-gerard-piqu-for-12-years-2139046","keywords":null,"creator":["ABP Live"],"video_url":null,"description":"<p style=\"text-align: justify;\"><strong>Shakira Confirms Separation From Football Star Gerard Pique:</strong> कंबोडिया की पॉप स्टार शकीरा और उनके साथी स्पेनिश फुटबॉल खिलाड़ी गेरार्ड पिके अलग हो रहे हैं. इसकी जानकारी दोनों ने शनिवार को जारी बयान में दी है. दोनों ने शकीरा की जनसंपर्क फर्म द्वारा जारी बयान में कहा कि हमें यह पुष्टि करते हुए अफसोस हो रहा है कि हम अलग हो रहे हैं.</p> <p style=\"text-align: justify;\">बता दें कि दोनों 12 साल से रिश्ते में थे. हालांकि दोनों की शादी नहीं हुई है. बयान में आगे कहा गया, हमारे बच्चों की भलाई हमारी सबसे बड़ी प्राथमिकता है. &nbsp;हम चाहते हैं कि आप हमारी निजता का सम्मान करें. समझने के लिये धन्यवाद.&nbsp;</p> <p style=\"text-align: justify;\">45 साल की शकीरा की मुलाकात बार्सिलोना के डिफेंडर पिके से 2010 विश्व कप गान &lsquo;&lsquo;वाका वाका&rsquo;&rsquo; (दिस टाइम फॉर अफ्रीका) के प्रमोशन (प्रचार) के दौरान हो हुई थी. दोनों के दो बच्चे साशा और मिलान हैं.</p> <p style=\"text-align: justify;\">स्पेनिश मीडिया में हाल में दोनों के अलग होने की अटकलें चल रही थीं. खबरों में कहा जा रहा था कि पिके (35 वर्ष) बार्सिलोना में अपना घर छोड़कर शहर में अकेले कहीं और रह रहे थे.</p> <p><strong><a href=\"https://www.abplive.com/sports/ipl/former-cricketer-brad-hogg-said-that-tim-david-should-be-included-in-the-australian-team-for-the-t20-world-cup-2138854\">Tim David को टी20 वर्ल्ड कप के लिए ऑस्ट्रेलियन टीम में शामिल करने पर पूर्व दिग्गज का बड़ा बयान, कही ये बात</a><br /></strong></p> <p><strong><a href=\"https://www.abplive.com/sports/cricket/chennai-super-kings-bowler-mukesh-chaudhary-said-that-he-had-prepared-a-special-plan-for-the-match-against-mumbai-indians-2138947\">CSK के खिलाड़ी ने किया खुलासा, बताया- मुंबई इंडियंस के खिलाफ मैच के लिए तैयार किया था 'स्पेशल प्लान'</a></strong></p>","content":null,"pubDate":"2022-06-04 17:04:53","image_url":null,"source_id":"abplive","country":["india"],"category":["sports"],"language":"hindi"},{"title":"Ben Stokes turns 31: A look at top performances by England Test captain","link":"https://www.business-standard.com/article/sports/ben-stokes-turns-31-a-look-at-top-performances-by-england-test-captain-122060400871_1.html","keywords":null,"creator":null,"video_url":null,"description":"He was born in New Zealand and later moved to England where he has played some memorable knocks for the English National Cricket Team.","content":"All-rounder Ben Stokes, who turned 31 today, is the second England cricketer after Ian Botham to score over 4,000 runs and take over 100 wickets. He was born in New Zealand and later moved to England where he has played some memorable knocks for the English National Cricket Team. Stokes moved across the English Channel with his family after his father was appointed the coach of a local rugby club in UK. While Stokes' family moved back to New Zealand, he stayed back to pursue his dream of becoming a professional cricketer. Stokes made his debut for the national team on August 25, 2011, against Ireland in the ODI series. He got his first Test call on December 5, 2013, against Australia in the Ashes. Here is a look at the top performances by English all-rounders: 120 against Australia, Perth, 2013-14Making his debut in the Ashes 2013-14, Stokes could contribute only 29 runs to his side in two innings as England suffered a humiliating defeat in the second match of the series. But the Christchurch-born cricketer soon showed his calibre as a Test player.Chasing a mammoth 504 in the Perth Test of Ashes 2013-14, England was down at 121-4 when Stokes took charge of things. Stitching crucial partnerships with Ian Bell and Matt Prior, Stokes took the scorecard forward and smashed his maiden Test ton, scoring 120. While Australia eventually won the match, Stokes gave his side a chance to save the game. 135 against Australia (2019)England needed special innings to win the Headingly Test and keep themselves alive in the Ashes (2019-2020). Chasing a mammoth 359, Stokes displayed extraordinary batting that day. After scoring just 3 of the first 72 deliveries he faced, Stokes suddenly changed gears to launch a lethal attack of Australian bowlers. Stokes finished with 135, taking his side to a historic victory. 258 against South Africa (2016)In a draw as good as a victory, Stokes shone with a quickfire 258 off 198 deliveries. Making the highest score by any number six batter, Stokes stitched a record 339-run partnership with Jonny Bairstow and saved the match for England. 84 not out against New Zeland, ODI World Cup final 2019England had reached a World Cup final after more than three decades and that too in Lord's. The stakes were as high as they could get and the result was equally dramatic. Chasing New Zealand's 242, England was reeling at 86-4 before Stokes and Joss Buttler took charge of things. The duo added 110 runs before Buttler was dismissed at 59. England needed 46 to win and with wickets falling on one end and all eyes were on Stokes. With two required off the last ball, the contest ended in a tie, making way for the first super over in the World Cup final. But the super-over round also ended in a tie, with both teams finishing with 15 runs.England was eventually declared a winner by the rule of boundary count. Ben stokes' power hitting in the last overs of his 84-run innings proved to be a crucial factor behind England's first-ever World Cup victory. Rajasthan Royals, Stokes' IPL team in the 2020 season, wished him a happy birthday on their official Twitter account. \"What a sight when he's in full flow! Happy birthday, @benstokes38,\" tweeted by RR. England Cricket also tweeted for Stokes on his birthday. \"Happy Birthday,@BenStokes38. Our superman!\" they tweeted. (Only the headline and picture of this report may have been reworked by the Business Standard staff; the rest of the content is auto-generated from a syndicated feed.)","pubDate":"2022-06-04 16:56:00","image_url":"https://bsmedia.business-standard.com/_media/bs/img/article/default/1220604/thumb-122060400871.jpg","source_id":"business-standard","country":["india"],"category":["sports"],"language":"english"},{"title":"पाकिस्तानी गेंदबाज का बड़ा बयान, कहा- उमरान मलिक और लॉकी फर्ग्यूसन की तरह मैं भी तेज बॉल फेंक सकता हूं, लेकिन...","link":"https://www.abplive.com/sports/ipl/pakistan-fast-bowler-shaheen-afridi-statement-on-umran-malik-and-lockie-ferguson-2139023","keywords":null,"creator":["ABP Live"],"video_url":null,"description":"<p style=\"text-align: justify;\"><strong>Umran Malik:</strong> जम्मू कश्मीर के तेज गेंदबाज उमरान मलिक (Umran Malik) ने आईपीएल 2022 में अपने प्रदर्शन से खासा प्रभावित किया. खास तौर पर उमरान मलिक ने अपनी स्पीड से कई दिग्गजों का ध्यान आकर्षित किया. इस बीच पाकिस्तान के तेज गेंदबाज शाहीन अफरीदी ने उमरान मलिक पर बड़ा बयान दिया है. उन्होंने कहा कि स्पीड से कुछ नहीं होता है, अगर आपके पास लाइन, लेंथ और स्विंग नहीं है. उमरान मलिक पर शाहीन अफरीदी के इस बयान को बड़ा बयान माना जा रहा है. दरअसल, इस सीजन सनराइजर्स हैदराबाद के इस गेंदबाज ने सबसे ज्यादा 150 की रफ्तार से ओवर डालने का रिकॉर्ड अपने नाम किया है.</p> <p style=\"text-align: justify;\"><strong>साउथ अफ्रीका के खिलाफ सीरीज में मलिक को मिला मौका</strong></p> <p style=\"text-align: justify;\">उमरान मलिक को साउथ अफ्रीका के खिलाफ 5 टी20 मैचों की सीरीज के लिए भारतीय टीम में शामिल किया गया है. इस सीरीज का पहला मैच 9 जून को दिल्ली में खेला जाएगा. उमरान मलिक ने इस सीजन 14 मैचों में 22 विकेट अपने नाम किया. साथ ही अपनी स्पीड से बल्लेबाजों को खासा परेशान किया. साउथ अफ्रीका के खिलाफ इस सीरीज में रोहित शर्मा और विराट कोहली जैसे सीनियर खिलाड़ियों को आराम दिया गया है. आईपीएल में लखनऊ सुपर जॉइंट्स की कप्तानी करने वाले केएल राहुल को इस टीम का कप्तान बनाया गया है. आस्ट्रेलिया में होने वाले टी20 वर्ल्ड कप से पहले उमरान मलिक के लिए यह बेहतर मौका माना जा रहा है. अगर इस सीरीज में उमरान मलिक अच्छा प्रदर्शन करते हैं तो टी20 वर्ल्ड कप टीम में शामिल किया जा सकता है.</p> <p style=\"text-align: justify;\"><strong>टी20 वर्ल्ड कप में 23 अक्टूबर को भारत-पाकिस्तान मैच</strong></p> <p style=\"text-align: justify;\">गौरतलब है कि भारत और पाकिस्तान के बीच साल 2012 के बाद से कोई द्विपक्षीय सीरीज नहीं हुई है. हालांकि, दोनों देश आईसीसी टूर्नामेंट में आमने-सामने होते रहे हैं. भारत और पाकिस्तान की अगली भिड़त एशिया कप में होगी. यह एशिया कप श्रीलंका में खेला जाएगा. फिलहाल, एशिया कप का शेड्यूल जारी नहीं किया गया है. वहीं, इस साल आस्ट्रेलिया में होने वाले टी20 वर्ल्ड कप में 23 अक्टूबर को भारत-पाकिस्तान के बीच मैच होगा.</p> <p style=\"text-align: justify;\"><strong>ये भी पढ़ें-</strong></p> <p style=\"text-align: justify;\"><strong><a href=\"https://www.abplive.com/sports/ipl/former-cricketer-brad-hogg-said-that-tim-david-should-be-included-in-the-australian-team-for-the-t20-world-cup-2138854\">Tim David को टी20 वर्ल्ड कप के लिए ऑस्ट्रेलियन टीम में शामिल करने पर पूर्व दिग्गज का बड़ा बयान, कही ये बात</a><br /></strong></p> <p style=\"text-align: justify;\"><strong><a href=\"https://www.abplive.com/sports/cricket/chennai-super-kings-bowler-mukesh-chaudhary-said-that-he-had-prepared-a-special-plan-for-the-match-against-mumbai-indians-2138947\">CSK के खिलाड़ी ने किया खुलासा, बताया- मुंबई इंडियंस के खिलाफ मैच के लिए तैयार किया था 'स्पेशल प्लान'</a><br /></strong></p>","content":null,"pubDate":"2022-06-04 16:22:48","image_url":null,"source_id":"abplive","country":["india"],"category":["sports"],"language":"hindi"},{"title":"“Have no shame in saying that I work in the IPL”: Gautam Gambhir gives it back to a journalist questioning his involvement in IPL despite being a member of parliament","link":"https://thesportsrush.com/cricket-news-have-no-shame-in-saying-that-i-work-in-the-ipl-gautam-gambhir-gives-it-back-to-a-journalist-questioning-his-involvement-in-ipl-despite-being-a-member-of-parliament/","keywords":["Cricket","Gautam Gambhir","Indian Premier League","IPL"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Gautam Gambhir gives it back to a journalist questioning his role in the IPL and the commentary box despite being an Indian MP. When Lucknow Super Giants (LSG) made it through to the playoffs in only their maiden IPL season a few days ago, a fair share of the credit also went to their team… The post “Have no shame in saying that I work in the IPL”: Gautam Gambhir gives it back to a journalist questioning his involvement in IPL despite being a member of parliament appeared first on The SportsRush.","content":"Gautam Gambhir gives it back to a journalist questioning his role in the IPL and the commentary box despite being an Indian MP. When Lucknow Super Giants (LSG) made it through to the playoffs in only their maiden IPL season a few days ago, a fair share of the credit also went to their team mentor Gautam Gambhir, who played a vital role not only at the auction table, but also in the identification of the Indian talents who delivered with their consistent performances. Moreover, he was a regular figure in the LSG dug-out during each of their matches, visibly expressing his emotions during the highs and lows of the matches, and passing out vital inputs to players and the captain whenever required. Before his maiden season with the LSG, the former India opener was also a regular feature in the pre and post match shows of matches involving the Indian Cricket team with the broadcasting unit. However, Gambhir has also been questioned by a significant section of people for his involvement in disbursing his services in the aforementioned endeavors, despite being a member of the Indian parliament in the Narendra Modi government since the year 2019. Addressing a press conference on BJP’s eight years in power in the country, Gautam Gambhir was seen replying to a journalist upon being asked on his active role and jobs in Cricket despite being a full-time politician and an MP now. Gambhir gave a hard-hitting reply by stating that he feeds 5,000 people every month through his NGO in Delhi and has also set up a library worth INR 25 Lakh in his constituency. Moreover, the 40-year-old has also set up a kitchen in Delhi’s Gandhi Nagar where he feeds the poor and needy for mere INR 1 rupee, from his own pocket. “Why I commentate in IPL or work in it is because I spend INR 25 lakh every month to feed 5000 people. This translates to roughly Rs. 2.75 crore per year. I’ve also spent INR 25 lakh to build a library. “I spend all of this money from my own pocket and not from the MPLAD fund. The MPLAD fund doesn’t run my kitchen or other things that I do. I don’t have a tree in my house from where I can pluck money either. Only because I work, I’m able to feed those 5000 people or establish that library. I have no shame in saying that I do commentary and work in the IPL. All of this that I do has an ultimate goal,” Gambhir can be heard saying in the video which he himself shared via his social media handle. अगर ईमानदारी से पैसे कमाकर जनता के लिए मुफ़्त रसोइयां, लाइब्रेरी, स्मॉग टॉवर लगाना ग़लत है, तो मैं ये ग़लती बार बार करूंगा! pic.twitter.com/dj4srwSdZ4 — Gautam Gambhir (@GautamGambhir) June 4, 2022 For more Cricket-related news, click here .","pubDate":"2022-06-04 16:05:56","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"IPL 2022: Mitchell Marsh ने दिल्ली के फाइनल में न पहुंचने को लेकर दिया बड़ा बयान, जानिए क्या कहा","link":"https://www.abplive.com/sports/ipl/mitchell-marsh-makes-big-statement-about-not-reaching-delhi-capitals-ipl-2022-final-2139019","keywords":null,"creator":["ABP Live"],"video_url":null,"description":"<p style=\"text-align: justify;\"><strong>Mitchell Marsh On Delhi Capitals:</strong> ऑस्ट्रेलियाई क्रिकेटर मिशेल मार्श (<strong>Mitchell Marsh)</strong> ने स्वीकार किया है कि यह दुख की बात है कि उनकी टीम दिल्ली कैपिटल्स आईपीएल 2022 (IPL 2022) के प्लेऑफ में जगह नहीं बना सकी, क्योंकि मुंबई इंडियंस के खिलाफ करो या मरो मैच में उन्हें हार का सामना करना पड़ा था.</p> <p style=\"text-align: justify;\">दिल्ली कैपिटल्स को अपने अंतिम लीग मैच में रोहित शर्मा की टीम को हराने की जरूरत थी, जिससे उनकी प्लेऑफ में जगह पक्की हो जाती. लेकिन कोच रिकी पोंटिंग की टीम पांच विकेट से हार गई और आईपीएल 2022 से बाहर हो गई, जिसके बाद रॉयल चैलेंजर्स बैंगलोर में प्लेऑफ के लिए क्वालीफाई कर गई.</p> <p style=\"text-align: justify;\">मार्श के हवाले से सिडनी मॉनिर्ंग हेराल्ड ने शनिवार को बताया, \"उन्होंने लीग की शुरुआत में कोविड-19 को मात दी और सीजन के आखिरी पांच मैचों में दिल्ली के लिए शानदार प्रदर्शन किया, जिसमें 11 मई को राजस्थान रॉयल्स के खिलाफ 62 गेंदों में 89 रनों का प्रदर्शन शामिल था.\"</p> <p style=\"text-align: justify;\">30 वर्षीय मार्श ने कहा, \"यह दुख की बात है कि हम (आईपीएल) फाइनल में नहीं पहुंच सके. मुझे इस बात का वास्तविक एहसास हुआ कि वह मुख्य कोच रिकी पोंटिंग अपने खिलाड़ियों की कैसे परवाह करते हैं. पोंटिंग ने मुझे दिल्ली के लिए वास्तव में एक महत्वपूर्ण खिलाड़ी की तरह महसूस कराया.\"</p> <p style=\"text-align: justify;\">मार्श अब 7 जून से शुरू होने वाली श्रीलंका के खिलाफ तीन मैचों की टी20 श्रृंखला और बाद में आइलैंडर्स के खिलाफ पांच मैचों की वनडे सीरीज में आईपीएल फॉर्म लेना चाहते हैं. ऑस्ट्रेलियाई ने कहा कि वह नंबर 3 पर बल्लेबाजी जारी रखना चाहेंगे.</p> <p style=\"text-align: justify;\">मार्श ने कहा, \"उम्मीद है कि मैं तीसरे नंबर पर जितना हो सके उतना निरंतरता बनाए रख सकता हूं और वहां बना रह सकता हूं. अंतरराष्ट्रीय क्रिकेट वास्तव में कठिन है, लेकिन आपको विश्वास होना चाहिए कि आप अच्छा कर सकते हैं और मुझे लगता है कि पिछले 12 महीनों में मुझे विश्वास हो गया है कि मेरा सर्वश्रेष्ठ दुनिया में किसी के खिलाफ भी आ सकता है.\"</p> <p><strong>ये भी पढ़ें-</strong></p> <p><strong><a href=\"https://www.abplive.com/sports/ipl/no-bio-bubble-in-ind-vs-sa-t20-series-but-mandatory-daily-covid-tests-for-players-2138818\">IND vs SA T20 Series: साउथ अफ्रीका सीरीज में नहीं होगा बॉयो बबल, लेकिन खिलाड़ियों का डेली होगा कोविड टेस्ट</a><br /></strong></p> <p><strong><a href=\"https://www.abplive.com/sports/cricket/this-is-how-rashid-khan-practices-snake-shot-video-surfaced-2138752\">इस तरह Rashid Khan करते हैं 'स्नेक शॉट' की प्रैक्टिस, सामने आया वीडियो</a></strong></p>","content":null,"pubDate":"2022-06-04 16:05:32","image_url":null,"source_id":"abplive","country":["india"],"category":["sports"],"language":"hindi"},{"title":"Khelo India Youth Games 2021: पंचकुला में खेलो इंडिया यूथ गेम्स 2021 का शुभारंभ, मुख्य अतिथि के तौर पर शामिल हुए केंद्रीय गृह मंत्री अमित शाह","link":"https://www.abplive.com/sports/khelo-india-youth-games-2021-launched-in-panchkula-union-home-minister-amit-shah-attended-as-chief-guest-2139004","keywords":null,"creator":["ABP Live"],"video_url":null,"description":"<p style=\"text-align: justify;\"><strong>Khelo India:</strong> हरियाणा के पंचकुला में खेलो इंडिया यूथ गेम्स 2021 का शुभारंभ हुआ. इस मौके पर केंद्रीय गृह मंत्री अमित शाह मुख्य अतिथि के तौर पर शामिल हुए. साथ ही इस कार्यक्रम में 200 से ज्यादा छात्रों ने रंगारंग कार्यक्रम प्रस्तुत किया. केंद्रीय गृह मंत्री अमित शाह के अलावा हरियाणा के मुख्यमंत्री मनोहर लाल खट्टर, केंद्रीय युवा मामले और खेल मंत्री अनुराग सिंह ठाकुर और युवा मामले और खेल राज्य मंत्री निशीथ प्रमाणिक भी इस मौके पर उपस्थित रहे. इसके अलावा राज्य के खेल मंत्री संदीप सिंह सहित हरियाणा के अन्य जाने पहचाने चेहरे इस कार्यक्रम का हिस्सा बने.</p> <p style=\"text-align: justify;\"><strong>4,700 एथलीटों में 2,262 लड़कियां</strong></p> <p style=\"text-align: justify;\">खेलो इंडिया यूथ गेम्स 2021 में 4,700 एथलीट 25 खेलों में 269 गोल्ड, 269 सिल्वर और 358 ब्रॉन्ज के लिए उतरेंगे. इन एथलीटों में 2,262 लड़कियां शामिल हैं. खेलो इंडिया यूथ गेम्स 13 जून तक चलेगा. इस आयोजन में भारत के 37 राज्यों और केंद्र शासित प्रदेशों के एथलीट हिस्सा ले रहे हैं. यह 5 शहरों (पंचकूला, शाहबाद, अंबाला, चंडीगढ़ और दिल्ली) में आयोजित किया जाएगा। इन खेलों में कुल 25 खेल होंगे, जिनमें भारत के 5 स्वदेशी खेल - कलारीपयट्टू, थांग-ता, गतका, मल्लखंभा और योगासन शामिल हैं.</p> <p><iframe title=\"YouTube video player\" src=\"https://www.youtube.com/embed/SNF7IFyDAaM\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"></iframe></p> <p style=\"text-align: justify;\"><strong>इंडिया यूथ गेम्स-2021 का चौथा संस्करण</strong></p> <p style=\"text-align: justify;\">बताते चलें कि इंडिया यूथ गेम्स-2021 का यह चौथा संस्करण है. इस संस्करण में 8,500 खिलाड़ी, कोच और सहयोगी स्टाफ हिस्सा ले रहे हैं. दरअसल, इस प्रतिष्ठित प्रतियोगिता में पहली बार पांच पारंपरिक खेलों जैसे गतका, कलारीपयट्टू, थांग-ता, मलखंब और योगासन को भी शामिल किया गया है. इससे पहले यह इस आयोजन का हिस्सा नहीं था. यह खेल आयोजन पंचकूला, अंबाला, शाहाबाद, चंडीगढ़ और दिल्ली में आयोजित होंगे. जबकि ताऊ देवी लाल खेल परिसर पंचकूला इन खेल प्रतियोगिताओं का मुख्य आयोजन स्थल है.</p> <p style=\"text-align: justify;\"><strong>ये भी पढ़ें-</strong></p> <p style=\"text-align: justify;\"><strong><a href=\"https://www.abplive.com/sports/cricket/this-is-how-rashid-khan-practices-snake-shot-video-surfaced-2138752\">इस तरह Rashid Khan करते हैं 'स्नेक शॉट' की प्रैक्टिस, सामने आया वीडियो</a><br /></strong></p> <p style=\"text-align: justify;\"><strong><a href=\"https://www.abplive.com/sports/ipl/former-cricketer-brad-hogg-said-that-tim-david-should-be-included-in-the-australian-team-for-the-t20-world-cup-2138854\">Tim David को टी20 वर्ल्ड कप के लिए ऑस्ट्रेलियन टीम में शामिल करने पर पूर्व दिग्गज का बड़ा बयान, कही ये बात</a><br /></strong></p>","content":null,"pubDate":"2022-06-04 15:47:53","image_url":null,"source_id":"abplive","country":["india"],"category":["sports"],"language":"hindi"},{"title":"CSK के खिलाड़ी ने किया खुलासा, बताया- मुंबई इंडियंस के खिलाफ मैच के लिए तैयार किया था 'स्पेशल प्लान'","link":"https://www.abplive.com/sports/cricket/chennai-super-kings-bowler-mukesh-chaudhary-said-that-he-had-prepared-a-special-plan-for-the-match-against-mumbai-indians-2138947","keywords":null,"creator":["ABP Live"],"video_url":null,"description":"<p style=\"text-align: justify;\"><strong>Mukesh Chaudhary:</strong> चेन्नई सुपर किंग्स (CSK) के गेंदबाज मुकेश चौधरी (Mukesh Chaudhary) के लिए आईपीएल 2022 (IPL 2022) सीजन की शुरूआत अच्छी नहीं रही. लेकिन उन्होंने अगले कुछ मैचों में शानदार वापसी की. मुकेश चौधरी (Mukesh Chaudhary) ने कहा कि मुंबई इंडियंस (MI) के खिलाफ मैच के लिए उन्होंने विशेष तैयारी की थी. इस मैच में उन्होंने 4 ओवर में 17 देकर 4 विकेट लिए. मुकेश चौधरी (Mukesh Chaudhary) के इस प्रदर्शन के लिए उन्हें मैन ऑफ द मैच चुना गया. इस सीजन के शुरूआती मैचों में मुकेश चौधरी (Mukesh Chaudhary) काफी महंगे साबित हुए थे. पंजाब किंग्स (PBKS) के खिलाफ मैच में चौधरी के 4 ओवर में 52 रन बने थे. लेकिन इसके बाद इस गेंदबाज ने शानदार गेंदबाजी की. मुंबई इंडियंस (MI) के खिलाफ मैच में उन्होंने अपनी बॉलिंग से खासा प्रभावित किया.</p> <p style=\"text-align: justify;\"><strong>'मुंबई इंडियंस के खिलाफ मैच के लिए विशेष तैयारी'</strong></p> <p style=\"text-align: justify;\">चेन्नई सुपर किंग्स (CSK) ने एक वीडियो शेयर किया है. इस वीडियो में मुकेश चौधरी (Mukesh Chaudhary) ने कहा कि मुंबई इंडियंस (MI) के खिलाफ मैच से पहले उन्होंने काफी मेहनत की. इस मैच में मैं अपना 100 फीसदी देना चाहता था. इसके लिए मैंने बॉलिंग प्लान बनाया और मैच के दौरान उसके मुताबिक काम किया. इस मैच में चेन्नई सुपर किंग्स (CSK) के इस बॉलर ने पहले ओवर में मुंबई इंडियंस (MI) के कप्तान रोहित शर्मा (Rohit Sharma) और ईशान किशन (Ishan Kishan) को आउट किया. इसके बाद उन्होंने डेवाल्ड ब्रेविस (Dewald Brewis) को भी अपना शिकार बनाया. इस मैच में मुकेश चौधरी (Mukesh Chaudhary) की शानदार गेंदबाजी की बदौलत मुंबई इंडियंस (MI) 20 ओवर में 7 विकेट पर महज 155 रन बना सकी. जिसके जवाब में महेन्द्र सिंह धोनी (Mahendra Singh Dhoni) की बदौलत चेन्नई सुपर किंग्स (CSK) ने यादगार जीत दर्ज की.&nbsp;</p> <p style=\"text-align: justify;\"><strong>'कोच और मैनेजमेंट ने मेरे पर भरोसा किया'</strong></p> <p style=\"text-align: justify;\">मुकेश चौधरी (Mukesh Chaudhary) ने कहा कि जब मुझे चेन्नई सुपर किंग्स (CSK) के लिए चुना गया, तब भरोसा हो गया कि मेरे जरूर कुछ खास है. लेकिन 2 मैच खेलने के बाद काफी कंन्फ्यूज हो गया, क्योंकि मेरे लिए दोनों मैच निराशाजनक रहा. मुझे समझ नहीं आ रहा था कि कहां गलती हो रही है. मुझे यह पता नहीं था कि अगले मैच के लिए मेरा चयन होगा या नहीं. लेकिन टीम के कोच और मैनेजमेंट ने मेरे पर भरोसा किया. गौरतलब है कि इस सीजन मुकेश चौधरी (Mukesh Chaudhary) ने 13 मैचों में 16 विकेट लिए. इस दौरान औसत 26.50 जबकि स्ट्राइक रेट 17.06 रहा.</p> <p style=\"text-align: justify;\"><strong>ये भी पढ़ें-</strong></p> <p style=\"text-align: justify;\"><strong><a href=\"https://www.abplive.com/sports/ipl/no-bio-bubble-in-ind-vs-sa-t20-series-but-mandatory-daily-covid-tests-for-players-2138818\">IND vs SA T20 Series: साउथ अफ्रीका सीरीज में नहीं होगा बॉयो बबल, लेकिन खिलाड़ियों का डेली होगा कोविड टेस्ट</a><br /></strong></p> <p style=\"text-align: justify;\"><strong><a href=\"https://www.abplive.com/sports/cricket/this-is-how-rashid-khan-practices-snake-shot-video-surfaced-2138752\">इस तरह Rashid Khan करते हैं 'स्नेक शॉट' की प्रैक्टिस, सामने आया वीडियो</a><br /></strong></p>","content":null,"pubDate":"2022-06-04 14:56:21","image_url":null,"source_id":"abplive","country":["india"],"category":["sports"],"language":"hindi"},{"title":"पूर्व भारतीय खिलाड़ी का बड़ा बयान, कहा- Hardik Pandya को टी20 वर्ल्ड कप तक वनडे क्रिकेट नहीं खेलना चाहिए","link":"https://www.abplive.com/sports/ipl/former-indian-coach-ravi-shastri-said-that-hardik-pandya-should-not-play-odi-cricket-till-the-t20-world-cup-2138889","keywords":null,"creator":["ABP Live"],"video_url":null,"description":"<p style=\"text-align: justify;\"><strong>Ravi Shastri On Hardik Pabdya:</strong> पूर्व भारतीय कोच रवि शास्त्री (Ravi Shastri) का मानना है कि टी20 वर्ल्ड कप (T20 World Cup) तक हार्दिक पांड्या (Hardik Pandya) को वनडे क्रिकेट नहीं खेलना चाहिए. उन्होंने कहा कि हार्दिक पांड्या (Hardik Pandya) को आस्ट्रेलिया में होने वाले आगामी टी20 वर्ल्ड कप (T20 World Cup) तक केवल टी20 ही खेलना चाहिए. पूर्व भारतीय खिलाड़ी ने कहा कि अगर हार्दिक पांड्या (Hardik Pandya) बॉलिंग नहीं करते हैं तो मैं उन्हें बतौर बैट्समैन भी अपनी टीम में मौका दूंगा. आस्ट्रेलिया में होने वाले टी20 वर्ल्ड कप (T20 World Cup) में ज्यादा वक्त नहीं बचा है. ऐसे में हार्दिक पांड्या (Hardik Pandya) को वनडे क्रिकेट नहीं खेलना चाहिए. इस दौरान उन्हें बस टी20 क्रिकेट ही खेलना चाहिए. उन्होंने आगे कहा कि अगर हार्दिक पांड्या (Hardik Pandya) वनडे क्रिकेट खेलेंगे तो चोटिल होने का खतरा बना रहेगा.</p> <p style=\"text-align: justify;\"><strong>'हार्दिक पांड्या को टॉप-5 में बैटिंग करना चाहिए'</strong></p> <p style=\"text-align: justify;\">हार्दिक पांड्या (Hardik Pandya) पिछले साल टी20 वर्ल्ड कप (T20 World Cup) में भारतीय टीम का हिस्सा थे. जबकि भारतीय टीम के लिए उन्होंने आखिरी वनडे साल 2021 के जुलाई महीने में खेला था. पूर्व भारतीय कोच रवि शास्त्री (Ravi Shastri) ने कहा कि हार्दिक पांड्या (Hardik Pandya) ऐसे खिलाड़ी हैं जो 2 प्लेयर का काम अकेले संभाल सकते हैं. हार्दिक पांड्या (Hardik Pandya) को टॉप-5 में बैटिंग करना चाहिए. उन्होंने आगे कहा कि ऑलराउंडर के तौर पर हार्दिक पांड्या (Hardik Pandya) को नंबर-5 या नंबर-6 पर बल्लेबाजी करना चाहिए. इसके अलावा कम से कम 2 ओवर बॉलिंग डाल सकते हैं. हार्दिक पांड्या (Hardik Pandya) के भारतीय टीम में होने से गजब का संतुलन आता है. साथ ही उनके रहने से टीम भी काफी मजबूत दिखती है. उन्होंने आईपीएल (IPL) में शानदार प्रदर्शन किया. यह टी20 वर्ल्ड कप (T20 World Cup) से पहले भारतीय टीम के लिए अच्छे संकेत हैं.</p> <p style=\"text-align: justify;\"><strong>हार्दिक पांड्या की कप्तानी में गुजरात टाइटंस बनी चैंपियन</strong></p> <p style=\"text-align: justify;\">हार्दिक पांड्या (Hardik Pandya) को साउथ अफ्रीका (South Africa) के खिलाफ 5 मैचों की टी20 सीरीज के लिए भारतीय टीम (Indian Team) में शामिल किया गया है. उन्होंने आईपीएल 2022 (IPL 2022) में गुजरात टाइटंस (Gujarat Titans) के लिए शानदार प्रदर्शन किया. हार्दिक पांड्या (Hardik Pandya) की अगुवाई में गुजरात टाइटंस (Gujarat Titans) चैपिंयन बनी. पांड्या ने इस सीजन बैट और बॉल दोनों से शानदार प्रदर्शन किया. भारत और साउथ अफ्रीका के बीच पहला टी20 9 जून को दिल्ली के फिरोजशाह कोटला स्टेडियम में खेला जाएगा. इसके बाद भारतीय टीम इंग्लैंड और आयरलैंड के दौरे पर जाएगी.</p> <p style=\"text-align: justify;\"><strong>ये भी पढ़ें-</strong></p> <p style=\"text-align: justify;\"><strong><a href=\"https://www.abplive.com/sports/cricket/this-is-how-rashid-khan-practices-snake-shot-video-surfaced-2138752\">इस तरह Rashid Khan करते हैं 'स्नेक शॉट' की प्रैक्टिस, सामने आया वीडियो</a><br /></strong></p> <p style=\"text-align: justify;\"><strong><a href=\"https://www.abplive.com/sports/ipl/no-bio-bubble-in-ind-vs-sa-t20-series-but-mandatory-daily-covid-tests-for-players-2138818\">IND vs SA T20 Series: साउथ अफ्रीका सीरीज में नहीं होगा बॉयो बबल, लेकिन खिलाड़ियों का डेली होगा कोविड टेस्ट</a></strong></p> <p style=\"text-align: justify;\">&nbsp;</p>","content":null,"pubDate":"2022-06-04 14:43:50","image_url":null,"source_id":"abplive","country":["india"],"category":["sports"],"language":"hindi"},{"title":"Cricket-England 31-1 at lunch as they chase 277 for victory over New Zealand","link":"https://www.thestar.com.my/sport/cricket/2022/06/04/cricket-england-31-1-at-lunch-as-they-chase-277-for-victory-over-new-zealand","keywords":null,"creator":null,"video_url":null,"description":"LONDON (Reuters) - New Zealand grabbed the wicket of opener Alex Lees just before lunch as England began their chase of a 277-run target to win the first test against New Zealand at Lords on Saturday. Read full story","content":null,"pubDate":"2022-06-04 13:15:00","image_url":"https://apicms.thestar.com.my/uploads/images/2022/06/04/1610995.jpg","source_id":"thestar_my","country":["malaysia"],"category":["sports"],"language":"english"},{"title":"BAW vs VH Dream11 Prediction: Fantasy Cricket Tips, Today's Playing 11s and Pitch Report for Nature Isle T10 2022, Match 2nd Semi-Final","link":"https://www.sportskeeda.com/fantasy-cricket-mantra/baw-vs-vh-dream11-prediction-fantasy-cricket-tips-today-s-playing-11s-pitch-report-nature-isle-t10-2022-match-2nd-semi-final?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Fantasy Cricket Mantra"],"creator":["Aman Chauhan"],"video_url":null,"description":null,"content":null,"pubDate":"2022-06-04 13:09:47","image_url":"https://static.sportskeeda.com/editor/2022/06/f9844-16543412011064-1920.jpg","source_id":"sportskeeda","country":["india"],"category":["sports"],"language":"english"},{"title":"IND vs SA T20 Series: साउथ अफ्रीका सीरीज में नहीं होगा बॉयो बबल, खिलाड़ियों का डेली होगा कोविड टेस्ट","link":"https://www.abplive.com/sports/no-bio-bubble-in-ind-vs-sa-t20-series-but-mandatory-daily-covid-tests-for-players-2138824","keywords":null,"creator":["ABP Live"],"video_url":null,"description":"<p style=\"text-align: justify;\"><strong>India vs South Africa T20 Series 2022:</strong> भारतीय टीम साउथ अफ्रीका (South Africa) के साथ 5 टी20 मैचों की सीरीज खेलेगी. इस सीरीज में बॉयो बबल (Bio bubble) नहीं होगा. दरअसल, पिछले 2 सालों में पहली बार ऐसा होगा जब भारत में होने वाले किसी द्विपक्षीय श्रृंखला में बॉयो बबल (Bio bubble) नहीं होगा. पिछले कुछ दिनों में कोरोना संक्रमण (Corona Pandemic) के मामले तेजी से बढ़े हैं, इस कारण मैच से पहले दोनों टीमों के खिलाड़ियों का कोरोना टेस्ट (Corona Test) होगा. इस सीरीज का पहला मैच 9 जून को दिल्ली के अरूण जेटली स्टेडियम में खेला जाएगा. इससे पहले भारत टीम श्रीलंका के खिलाफ सीरीज खेली थी. उस सीरीज में सख्त बॉयो बबल (Bio bubble) का पालन करना जरूरी था. साथ ही खिलाड़ियों को भीड़-भाड़ वाले जगह पर जाने से बचने की सलाह दी गई थी.</p> <p style=\"text-align: justify;\"><strong>खिलाड़ियों का होगा कोरोना टेस्ट</strong></p> <p style=\"text-align: justify;\">BCCI के एक वरिष्ठ अधिकारी ने कहा कि इस सीरीज में बॉयो बबल (Bio bubble) नहीं होगा. उन्होंने आगे कहा कि चूंकि कोरोना संक्रमण (Corona Pandemic) के मामले बढ़ रहे हैं. इसलिए हमें कुछ प्रोटोकॉल का पालन करना होगा. दोनों टीमों के खिलाड़ियों के लिए मास्क जरूरी होगा. हमारी कोशिश होगी कि कोरोना मुक्त वातावरण में इस सीरीज का आयोजन किया जाए. इससे पहले BCCI सचिव जय शाह (Jay Shah) ने कहा कि आईपीएल 2022 (IPL 2022) में खिलाड़ियों के लिए बॉयो बबल (Bio bubble) था, लेकिन अब नहीं होगा. उन्होंने कहा कि दोनों टीमों के खिलाड़ियों की कोरोना जांच (Corona Test) होगी, लेकिन बॉयो बबल (Bio bubble) नहीं होगा.</p> <p style=\"text-align: justify;\"><strong>सीरीज से पहले भारतीय खिलाड़ियों का होगा फिटनेस टेस्ट</strong></p> <p style=\"text-align: justify;\">तेंबा बाबूमा (Temba Babuma) की अगुवाई वाली साउथ अफ्रीकन टीम ने दिल्ली (Delhi) में प्रैक्टिस शुरू कर दिया है. भारतीय टीम रविवार को दिल्ली पहुंचेगी, जबकि सोमवार प्रैक्टिस शुरू करेगी. वहीं, इस सीरीज से पहले भारतीय खिलाड़ियों को फिटनेस टेस्ट से भी गुजरना होगा. गौरतलब है कि इस सीरीज के लिए रोहित शर्मा (Rohit Sharma) और विराट कोहली (Virat Kohli) को आराम दिया गया है. जबकि केएल राहुल (KL Rahul) इस टीम के कप्तान होंगे.&nbsp;</p> <p style=\"text-align: justify;\"><strong>साउथ अफ्रीका सीरीज के लिए भारतीय टीम</strong></p> <p style=\"text-align: justify;\">केएल राहुल (कप्तान), ऋतुराज गायकवाड़, ईशान किशन, दीपक हुड्डा, श्रेयस अय्यर, ऋषभ पंत (विकेटकीपर), दिनेश कार्तिक, हार्दिक पांड्या, वेंकटेश अय्यर, युजवेन्द्र चहल, कुलदीप चहल, अक्षर पटेल, रवि बिश्नोई, भुवनेश्वर कुमार, हर्षल पटेल, आवेश खान, अर्शदीप सिंह, उमरान मलिक</p> <p style=\"text-align: justify;\"><strong>ये भी पढ़ें-</strong></p> <p style=\"text-align: justify;\"><strong><a href=\"https://www.abplive.com/sports/cricket/this-is-how-rashid-khan-practices-snake-shot-video-surfaced-2138752\">इस तरह Rashid Khan करते हैं 'स्नेक शॉट' की प्रैक्टिस, सामने आया वीडियो</a><br /></strong></p> <p><strong><a href=\"https://www.abplive.com/sports/ipl/kapil-dev-advice-to-arjun-tendulkar-go-and-enjoy-your-cricket-2138745\">Arjun Tendulkar को मिली कपिल देव से सलाह, 'अगर तुम अपने पिता की तरह 50% भी बन गए तो..'</a></strong></p>","content":null,"pubDate":"2022-06-04 12:49:41","image_url":null,"source_id":"abplive","country":["india"],"category":["sports"],"language":"hindi"},{"title":"Brad Hogg urges Cricket Australia to nurture ‘unique talent’ Tim David: You can't have a rule as stupid as that","link":"https://www.indiatoday.in/sports/cricket/story/brad-hogg-urges-cricket-australia-to-nurture-unique-talent-tim-david-you-can-t-have-a-rule-as-stupid-as-that-1958374-2022-06-04?utm_source=rss","keywords":null,"creator":null,"video_url":null,"description":"You can't have a rule as stupid as that: Hogg urges Australia to nurture ‘unique talent’ Tim David","content":"Former Australian cricketer Brad Hogg reckoned that Australia should try and give Tim David an opportunity to play at the international level. David, who has played for Singapore in international cricket, has been outstanding in the last 12 months, having played for the St Lucia Zouks, Multan Sultans, Hobart Hurricanes, Lancashire and Mumbai Indians. Hogg reckoned that David is the best No.6 batter at the present point in time and advised the Aussies to rope him in at the earliest. The veteran said that the right-hander has the “unique talent” of taking on the opposition bowling in the death overs right from the word go. \"You bring Smith up from the lower order and open the batting with him. Stoinis comes up at No.5 and Tim David comes in at No.6. Tim David, for me around the globe, is the best No.6 that you can have. He is the only player that consistently comes in the final four overs and finds the boundary straightaway. It is a unique talent to have and Australia have got to utilize it,\" Hogg said on his YouTube channel. Hogg also asked Cricket Australia (CA) to tweak one of their rules and he believed that David is too good a player to sit out for long. \"The other issue, Australia have a rule that if you're not contracted with a first-class state team to represent Australia in T20Is. He doesn't have that contract. Australia have got to change that rule. You can't have a rule as stupid as that, keeping a player like him out,\" he stated. In 14 T20Is, David has scored 558 runs at an average of 46.50 and a strike rate of 158.52 with a top score of 92* against Malaysia back in March 2020. Live TV --- ENDS --- Also Read | Lost my number one fan: Former Argentine striker Carlos Tevez announces retirement from football","pubDate":"2022-06-04 12:47:12","image_url":null,"source_id":"indiatoday","country":["india"],"category":["sports"],"language":"english"},{"title":"Cricket-New Zealand out for 285, England take team hat-trick","link":"https://www.thestar.com.my/sport/cricket/2022/06/04/cricket-new-zealand-out-for-285-england-take-team-hat-trick","keywords":null,"creator":null,"video_url":null,"description":"LONDON (Reuters) - Daryl Mitchell reached his century but Tom Blundell fell agonisingly short as New Zealand were bowled out for 285 runs in their second innings on Saturday, setting England a target of 277 to win the first test at Lords. Read full story","content":"LONDON (Reuters) - Daryl Mitchell reached his century but Tom Blundell fell agonisingly short as New Zealand were bowled out for 285 runs in their second innings on Saturday, setting England a target of 277 to win the first test at Lords. Mitchell and Blundell opened the play after a 30-minute rain delay at the start of the third day, both close to their centuries with the tourists on 236-4. Mitchell quickly notched his second test ton in the first over of the morning, but the Kiwis were then undone by the second new ball as Jimmy Anderson and Stuart Broad swept through the batting order, including a team hat-trick of three wickets in as many balls. Blundell was unable to match his opening partner and was trapped leg before wicket for 96. (Writing by Mark Gleeson in Cape Town; Editing by Hugh Lawson)","pubDate":"2022-06-04 12:15:00","image_url":"https://apicms.thestar.com.my/uploads/images/2022/06/04/1610957.jpg","source_id":"thestar_my","country":["malaysia"],"category":["sports"],"language":"english"},{"title":"“Absolutely brilliant from Daryl Mitchell”: Simon Doull lauds Daryl Mitchell for his outstanding hundred against England at Lord’s","link":"https://thesportsrush.com/cricket-news-absolutely-brilliant-from-daryl-mitchell-simon-doull-lauds-daryl-mitchell-for-his-outstanding-hundred-against-england-at-lords/","keywords":["Cricket","Daryl Mitchell","ENG vs NZ","Simon Doull"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"Daryl Mitchell scored his test century and combined for a 195 runs partnership with Tom Blundell to help New Zealand at Lord’s. The first test between England and New Zealand at the Lord’s in London has reached an exciting position. New Zealand managed to score 132 runs in the first innings and England could just… The post “Absolutely brilliant from Daryl Mitchell”: Simon Doull lauds Daryl Mitchell for his outstanding hundred against England at Lord’s appeared first on The SportsRush.","content":"Daryl Mitchell scored his test century and combined for a 195 runs partnership with Tom Blundell to help New Zealand at Lord’s. The first test between England and New Zealand at the Lord’s in London has reached an exciting position. New Zealand managed to score 132 runs in the first innings and England could just take a lead of 9 runs as they were all-out for just 141 in the first innings. In the 2nd innings as well, the Kiwis were struggling at 56-4, but then came the partnership of Daryl Mitchell and Tom Blundell. Both of them added 195 runs for the 5th wicket to bring back the Kiwis in the contest. Mitchell smashed his 2nd test century and scored 108 runs, whereas Blundell played a knock of 96 runs. After both of them got out, the lower order of Blackcaps failed, and they got all-out for just 285 runs. Stuart Broad and Matty Potts got three wickets each for the hosts. England needs 273 runs to win the test match. Former New Zealand cricketer and current commentator Simon Doull has applauded the efforts of Daryl Mitchell in the Lord’s test. Doull said that Mitchell deserves the success as he never lets the team down whenever he gets an opportunity. “Absolutely brilliant from Daryl Mitchell. Richly deserved for a player who never lets the team down when given an opportunity. #wellplayed #lords100,” Simon Doull Tweeted. Absolutely brilliant from @dazmitchell47 @HomeOfCricket Richly deserved for a player who never lets the team down when given an opportunity. #wellplayed #lords100 — Simon Doull (@Sdoull) June 4, 2022 Daryl Mitchell has not played much red-ball cricket for the national side, but he has been pretty impressive in the opportunities given to him. Mitchell has scored 524 test runs in 10 matches at an average of 43.67, courtesy of two centuries and three half-centuries. He played a bit of red-ball cricket for Middlesex last season. He also played a bit of grade cricket in Perth as well, and the results with the red-ball are quite visible with his consistent performances. Daryl Mitchell was a part of the IPL side Rajasthan Royals for the last two months, and the switch has been quite smooth for Mitchell from white-ball to red-ball.","pubDate":"2022-06-04 11:59:28","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"“The spirit of the side will not go down”: Temba Bavuma lauds the spirit of Team India even without Rohit Sharma and Virat Kohli","link":"https://thesportsrush.com/cricket-news-the-spirit-of-the-side-will-not-go-down-temba-bavuma-lauds-the-spirit-of-team-india-even-without-rohit-sharma-and-virat-kohli/","keywords":["Cricket","Ind vs SA","india vs south africa","Temba Bavuma"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"South African captain Temba Bavuma has said that the Indian team will not lose its spirit even without Rohit Sharma and Virat Kohli. After a competitive Indian Premier League, the focus shifts to international cricket. India will face South Africa in a 5-match T20I series starting on 9 June 2022 at the Arun Jaitley Stadium… The post “The spirit of the side will not go down”: Temba Bavuma lauds the spirit of Team India even without Rohit Sharma and Virat Kohli appeared first on The SportsRush.","content":"South African captain Temba Bavuma has said that the Indian team will not lose its spirit even without Rohit Sharma and Virat Kohli. After a competitive Indian Premier League, the focus shifts to international cricket. India will face South Africa in a 5-match T20I series starting on 9 June 2022 at the Arun Jaitley Stadium in Delhi. Cuttack, Visakhapatnam, Rajkot and Bengaluru will host the other four games. KL Rahul will lead the Indian side in the series, whereas Rishabh Pant will be his deputy. Virat Kohli, Rohit Sharma and Jasprit Bumrah are rested for the series, whereas Hardik Pandya is making his return after a successful IPL with Gujarat Titans. South African skipper Temba Bavuma addressed a virtual press conference ahead of the T20I series. Bavuma said they are looking to finalize their team for the T20 World Cup in Australia. He said that the conditions are different in Australia, but any kind of competitive games are good for them. Team India have rested their star players for the series, but Bavuma said that all these players are coming on the back of a brilliant IPL, and they are not looking at them as a “B” team. He insisted that they are very motivated and in a competitive mood ahead of the series. “It’s obviously a new-look Indian side. A lot of guys who have done well in the recent IPL have been given opportunities. From us as a team we wouldn’t be looking at it any differently,” Bavuma said in the virtual conference. “We don’t really see it as taking on a B’ side. So, going into the game, we’ll still be as motivated as ever. The competitiveness will be there.” The #INDvSA T20I series draws ever closer 🇿🇦 #BePartOfIt pic.twitter.com/Nurib2z380 — Cricket South Africa (@OfficialCSA) June 4, 2022 Temba Bavuma reiterated the fact that this Indian team has a lot of spirit and hunger, and even without Rohit Sharma and Virat Kohli, the spirit of the side will not go down. “The attitude, the mindset of the Indian team, in the last couple of years, has changed. It’s guys who play cricket hard, who play very competitively. Rohit Sharma and Virat Kohli are not there but the Indian fighting spirit will still be there,” Bavuma added.","pubDate":"2022-06-04 11:39:14","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Shame that Delhi Capitals couldn’t make it to IPL final: Mitchell Marsh","link":"https://www.tribuneindia.com/news/sports/shame-that-delhi-capitals-couldnt-make-it-to-ipl-final-mitchell-marsh-400981","keywords":null,"creator":null,"video_url":null,"description":"Colombo, June 4Delhi Capitals all-rounder Mitchell Marsh feels that it's a \"shame\" that his team couldn't make it to the IPL final after losing final league encounter to wooden spooners Mumbai Indians.DC's five-wicket defeat enabled Royal Challengers Bangalore to make it despite an inferior net run-rate throughout the tournament.\"It was a shame we couldn't get into the (IPL) finals,\" the 30-year-old said here ahead of the three-match T20I series against Sri Lanka, beginning on June 7.Australia will meet Sri Lanka in a five-match ODI series.Marsh overcame a bout of Covid-19 in the first-half of the tournament and formed the backbone of Delhi top-order with his Australian teammate David Warner.Coach Ricky Ponting entrusted him with batting at No 3 as he scored 251 runs at a strike-rate of 132.80.\"Everyone speaks about him (Ponting) so much and what he's achieved in the game. But I got a real sense of how much he cares for his players ndash; I guess that's probably what he was like as a captain and a leader of a team,\" he said.\"I got the real sense for how he (head coach Ricky Ponting) cares for his players and that was probably how he was as a captain and a leader of a team—it's the way he makes you feel. He made me feel like a really important player for Delhi,\" he added.On overcoming Covid-19, he said: \"After my first couple of weeks, there I thought that I was cursed in India,\" he said.\"I got through my initial injury ndash; which was very minor ndash; but then to play one game and get Covid, it was a bit of a shaky start but once I got going it was nice to put a few consistent performances on the board. I absolutely loved my time there.\" He further said he would like to continue batting at No 3.\"I have loved batting at number three, and I've been there a bit over 12 months now. I certainly feel like that's my best positioning in T20 cricket, and I've loved batting in the power play, I've batted a lot with David Warner and had some great partnerships with him — it's been really enjoyable.\" \"Hopefully, I can keep being as consistent as I possibly can at number three and stay up there. International cricket is really hard, but you've got to believe that you belong here and I think over the last 12 months.\"I have really gained the belief that my best can match up with anyone in the world,\" Marsh added.","content":"PTI Colombo, June 4 Delhi Capitals all-rounder Mitchell Marsh feels that it’s a “shame” that his team couldn’t make it to the IPL final after losing final league encounter to wooden spooners Mumbai Indians. DC’s five-wicket defeat enabled Royal Challengers Bangalore to make it despite an inferior net run-rate throughout the tournament. “It was a shame we couldn’t get into the (IPL) finals,” the 30-year-old said here ahead of the three-match T20I series against Sri Lanka, beginning on June 7. Australia will meet Sri Lanka in a five-match ODI series. Marsh overcame a bout of Covid-19 in the first-half of the tournament and formed the backbone of Delhi top-order with his Australian teammate David Warner. Coach Ricky Ponting entrusted him with batting at No 3 as he scored 251 runs at a strike-rate of 132.80. “Everyone speaks about him (Ponting) so much and what he’s achieved in the game. But I got a real sense of how much he cares for his players – I guess that’s probably what he was like as a captain and a leader of a team,” he said. “I got the real sense for how he (head coach Ricky Ponting) cares for his players and that was probably how he was as a captain and a leader of a team—it’s the way he makes you feel. He made me feel like a really important player for Delhi,” he added. On overcoming Covid-19, he said: “After my first couple of weeks, there I thought that I was cursed in India,” he said. “I got through my initial injury – which was very minor – but then to play one game and get Covid, it was a bit of a shaky start but once I got going it was nice to put a few consistent performances on the board. I absolutely loved my time there.” He further said he would like to continue batting at No 3. “I have loved batting at number three, and I’ve been there a bit over 12 months now. I certainly feel like that’s my best positioning in T20 cricket, and I’ve loved batting in the power play, I’ve batted a lot with David Warner and had some great partnerships with him — it’s been really enjoyable.” “Hopefully, I can keep being as consistent as I possibly can at number three and stay up there. International cricket is really hard, but you’ve got to believe that you belong here and I think over the last 12 months. “I have really gained the belief that my best can match up with anyone in the world,” Marsh added.","pubDate":"2022-06-04 11:36:29","image_url":"https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/6/2022_6$largeimg_2002708601.jpeg","source_id":"tribuneindia","country":["india"],"category":["sports"],"language":"english"},{"title":"England vs New Zealand, 1st Test, Day 3 Live Score Updates: England Fight Back As New Zealand Lose 4.. - NDTV Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMiYGh0dHBzOi8vc3BvcnRzLm5kdHYuY29tL2NyaWNrZXQvZW5nbGFuZC12cy1uZXctemVhbGFuZC0xc3QtdGVzdC1kYXktMy1saXZlLXNjb3JlLXVwZGF0ZXMtMzAzNzczNtIBZmh0dHBzOi8vc3BvcnRzLm5kdHYuY29tL2NyaWNrZXQvZW5nbGFuZC12cy1uZXctemVhbGFuZC0xc3QtdGVzdC1kYXktMy1saXZlLXNjb3JlLXVwZGF0ZXMtMzAzNzczNi9hbXAvMQ?oc=5","keywords":null,"creator":null,"video_url":null,"description":"England vs New Zealand, 1st Test, Day 3 Live Score Updates: England Fight Back As New Zealand Lose 4..  NDTV SportsEngland left longing for X-Factor as new Test management face up to home truths  ESPNcricinfoEngland vs New Zealand 1st Test Day 3 Live Score  Hindustan TimesENG vs NZ Live Score, 1st Test, Day 3: England off to steady start in 277-chase against New Zealand  SportstarENG vs NZ Live Cricket Score, England vs New Zealand 1st Test, Day 3: NZ Collapse Leaves ENG 277-Run Target  News18View Full coverage on Google News","content":null,"pubDate":"2022-06-04 11:13:00","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"“I thought that I was cursed in India”: Mitch Marsh opens up on his tough spell in India ahead of T20Is against Sri Lanka","link":"https://thesportsrush.com/cricket-news-i-thought-that-i-was-cursed-in-india-mitchell-marsh-opens-up-on-his-tough-spell-in-india-ahead-of-t20is-against-sri-lanka/","keywords":["Cricket","Delhi Capitals","IPL","mitch marsh"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"Mitch Marsh has been excellent for the Australian side in the last year and has emerged as one of the hottest properties of the T20 circuit. Mitchell Marsh has to be the most improved T20 cricketer since 2021. The year 2021 belonged to Mitchell Marsh, where he cemented his place as the new number three… The post “I thought that I was cursed in India”: Mitch Marsh opens up on his tough spell in India ahead of T20Is against Sri Lanka appeared first on The SportsRush.","content":"Mitch Marsh has been excellent for the Australian side in the last year and has emerged as one of the hottest properties of the T20 circuit. Mitchell Marsh has to be the most improved T20 cricketer since 2021. The year 2021 belonged to Mitchell Marsh, where he cemented his place as the new number three of the Australian T20I side. He also won the title of BBL with Perth Scorchers earlier this year. Mitchell Marsh was adjudged the Man of the Match in the ICC T20 World Cup final against New Zealand. He scored 627 T20I runs at 36.90 in 2021, whereas he also had some significant performances with the ball. Marsh was adjudged as the T20 Player of the year in the Cricket Australia awards. He is set to continue to bat at number three in the upcoming Sri Lanka T20Is as well. Ahead of the series, he addressed the press and talked about various aspects. Mitch Marsh talks about his IPL experience Australian all-rounder was bought by Delhi Capitals for a whopping price of INR 6.50 crores in the auction. However, he missed the initial few games due to an injury, and then he got Covid. Marsh said that he was very disappointed about the same and felt like he was cursed in India. “After my first couple of weeks there I thought that I was cursed in India,” Marsh told reporters from Colombo on Saturday. “I got through my initial injury – which was very minor – but then to play one game and get COVID, it was a bit of a shaky start but once I got going it was nice to put a few consistent performances on the board. I absolutely loved my time there.” All hail our new overlord – Mitch Marsh! #T20WorldCup pic.twitter.com/GErfr5Yv7j — cricket.com.au (@cricketcomau) November 14, 2021 After a tough start, Mitchell Marsh finished the tournament on a high. He scored 251 runs in the tournament, courtesy of a couple of half-centuries, whereas he scalped four wickets with the ball as well. Mitchell Marsh acknowledged the role of Ricky Ponting in getting his confidence back. He said that he did hear a lot about Pointing, but experiencing it in person was a different experience. Marsh lauded Ponting as the captain and leader of the team. “Everyone speaks about him so much and what he’s achieved in the game, but I got a real sense of how much he cares for his players – I guess that’s probably what he was like as a captain and a leader of a team,” Marsh said about Ricky Ponting. The post “I thought that I was cursed in India”: Mitch Marsh opens up on his tough spell in India ahead of T20Is against Sri Lanka appeared first on The SportsRush.","pubDate":"2022-06-04 10:11:28","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"ENG vs NZ, 1st Test, Day 3, Live Cricket Score: NZ 236/4 - Rain delays start; entire square under covers","link":"https://www.indiatvnews.com/sports/cricket/eng-vs-nz-1st-test-live-score-england-vs-new-zealand-lords-test-live-cricket-score-latest-match-updates-day-3-highlights-2022-06-04-781943","keywords":null,"creator":null,"video_url":null,"description":"ENG vs NZ, 1st Test, Day 3, Live Cricket Score: NZ 236/4 - Rain delays start; entire square under covers","content":null,"pubDate":"2022-06-04 10:05:04","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"\"Got An Extension In Captaincy\": Harbhajan On How He Helped Ganguly","link":"https://sports.ndtv.com/cricket/got-an-extension-in-captaincy-harbhajan-singh-on-how-he-helped-sourav-ganguly-with-his-2001-performance-3037835","keywords":null,"creator":null,"video_url":null,"description":"Harbhajan Singh performed brilliantly for the Sourav Ganguly-led Indian cricket team against Australia in the 2001 Test series at home","content":"The Indian cricket team's 2001 home Test series against Australia was an intensely-contested one. Some great performances from the likes of VVS Laxman , Rahul Dravid and Harbhajan Singh saw the Sourav Ganguly -led India defeat the mighty Australians, playing under Steve Waugh . Harbhajan finished the three-Test series with 32 wickets to be the top wicket-taker. He was crucial in India making a strong comeback in the series after losing the first Test in Mumbai by 10 wickets. Ganguly had backed Harbhajan then and he repaid the faith. Replying to a question on 'What if Sourav Ganguly had not backed Harbhajan Singh?', the spin great has now said: \" Toh woh captaani se hat jate . I think then he would not have been able to win series against Australia. If we would not have won the series, then Dada would not have been there. It's like God sent Sourav Ganguly for me, telling 'hold this kid's hand.' He held my hand and I held God's hand. And I kept doing my work. That is how I made my name and Sourav Ganguly also won a big series, due to which he got an extension in captaincy,\" Harbhajan said in an interview to Sportskeeda Cricket . Harbhajan added that he was thankful for the skipper's backing and added that it was ultimately a player's performance that helps him become special. Promoted \"Yes, he supported me, there is no doubt about that. I am always thankful for that. But side by side it's your performance that makes your career special. Captain can give you one opportunity, that Sourav Ganguly gave me at the right time. It was difficult period for me. After that it's on the person on how he performs,\" Harbhajan said. After losing the first Test in Mumbai, India won the second Test in Kolkata by 171 runs despite being asked to follow-on. Laxman and Dravid stitched a stand for the ages while Harbhajan took 13 wickets in the match. In the third Test in Chennai, Harbhajan took 15 wickets. India won the match by two wickets.","pubDate":"2022-06-04 09:49:09","image_url":"https://c.ndtvimg.com/2022-06/6ng2k3fo_sourav-ganguly-harbhajan-singh-afp_625x300_04_June_22.jpg?im=FeatureCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"}]}