{"newsArray":[{"article_id":"fc150ee4eb32f51a9d53e755439efac1","title":"Sai Sudharsan: 22 साल के साई सुदर्शन ने डेब्यू मैच बनाए रिकॉर्ड, ऐसा करने वाले बने चौथे बल्लेबाज","link":"https://hindi.latestly.com/sports/cricket/sai-sudharsan-22-year-old-sai-sudharsan-made-a-record-in-his-debut-match-became-the-fourth-batsman-to-do-so-2017004.html","keywords":null,"creator":null,"video_url":null,"description":"वांडरर्स, जोहान्सबर्ग में दक्षिण अफ्रीका ने टॉस जीतकर भारत के खिलाफ पहले बल्लेबाजी करने का फैसला किया. लेकिन यह फैसला उल्टा पड़ गया और मेजबान टीम 116 रन पर आउट हो गई. इस मैच में अर्शदीप सिंह ने अपने करियर का सर्वश्रेष्ठ प्रदर्शन करते हुए डेब्यू मैच में 37 रन देकर 5 विकेट लिए और वनडे में अपना पहला पांच विकेट हासिल किया.","content":"वांडरर्स, जोहान्सबर्ग में दक्षिण अफ्रीका ने टॉस जीतकर भारत के खिलाफ पहले बल्लेबाजी करने का फैसला किया. लेकिन यह फैसला उल्टा पड़ गया और मेजबान टीम 116 रन पर आउट हो गई. इस मैच में अर्शदीप सिंह ने अपने करियर का सर्वश्रेष्ठ प्रदर्शन करते हुए डेब्यू मैच में 37 रन देकर 5 विकेट लिए और वनडे में अपना पहला पांच विकेट हासिल किया. दूसरी ओर, आवेश खान ने 4 विकेट हासिल किए. जबकि कुलदीप यादव को एक विकेट मिला. दक्षिण अफ्रीका के लिए एंडिले फेहलुकवायो ने 49 गेंदों पर सर्वाधिक 33 रन बनाए। जवाब में, भारतीय टीम का पहला विकेट जल्दी गिर गया. ऋतुराज गायकवाड़ 5(10) बनाकर आउट हो गए.हालाँकि साई सुदर्शन ने अपना बल्ला चलाया और भारत को प्रोटियाज़ के खिलाफ व्यापक जीत दिलाई. अपने पहले वनडे में बल्लेबाजी करते हुए, तमिलनाडु के युवा खिलाड़ी ने 43 गेंदों पर 55 रन बनाए और दूसरे विकेट के लिए श्रेयस अय्यर के साथ 88 रन की साझेदारी भी की. वहीं श्रेयस िएर ने अर्धशतकीय पारी खेली।.इस बीच साई सुदर्शन ने एक बड़ा रिकॉर्ड अपने नाम किया। वह भारत की और से डेब्यू मैच अर्धशतक लगाने वाले चौथे ओपनर बन गए हैं. सुदर्शन से पहले इस लिस्ट रोबिन उथप्पा, केएल राहुल और फैज़ फजल का नाम है. उथप्पा ने 2006 में इंग्लैंड के खिलाफ 86 रनों की पारी खेली थी. वहीं केएल राहुल ने 2016 इंग्लैंड के खिलाफ नाबाद शतकीय पारी खेली थी. वहीं फैज़ फजल ने 2016 में नाबाद 55 रन ज़िम्बाब्वे के खिलाफ बनाए थे. 86 - रॉबिन उथप्पा बनाम इंग्लैंड, 2006 100* - केएल राहुल बनाम ज़िम्बाब्वे, 2016 55* - फ़ैज़ फ़ज़ल बनाम ज़िम्बाब्वे, 2016 55* - साई सुदर्शन बनाम साउथ अफ्रीका, 2023*","pubDate":"2023-12-18 04:31:51","image_url":"https://hist1.latestly.com/wp-content/uploads/2023/12/Sai-Sudharsan-1-380x214.jpg","source_id":"latestly","source_priority":5523,"country":["india"],"category":["sports"],"language":"hindi"},{"article_id":"82af6b08d6aedf65d327327ee3e9abf9","title":"IPL 2024 Trophy unveiled in Dubai ahead of the auction | Watch","link":"https://www.livemint.com/sports/cricket-news/ipl-2024-trophy-unveiled-in-dubai-ahead-of-the-auction-watch-11702870072548.html","keywords":null,"creator":null,"video_url":null,"description":"The trophy for IPL 2024 has been revealed ahead of the auction, which will be held in Dubai for the first time. Mumbai Indians have named Hardik Pandya as the new captain, replacing Rohit Sharma.","content":"IPL 2024: The trophy of the Indian Premier League (IPL) 2024 has been revealed ahead of the IPL 2024 auction which is scheduled to held on 19 December. The IPL 2024 auction will be held at the Coca-Cola Arena in Dubai, making it the first-ever instance of an auction taking place overseas. Taking to X, IPL official account on X wrote, “Welcome to Dubai! We are all set for the #IPLAuction The trophy in all its glory.\" Also Read: Recently, replaced as the captain and named Hardik Pandya as the new captain. Also Read: Coming back to the IPL 2024 auction, as per statement issued by the IPL, “Out of 333 players, 214 are Indians and 119 are overseas players of which 2 players are from associate nations. The total capped players are 116, uncapped players are 215 and 2 from associate nations.\" Also Read: Players in the top bracket list England batter Harry Brook and Australia's hero Travis Head have been placed in the top bracket of 2 crore for the upcoming IPL 2024 auction. Seven Australians players, including Head, have a starting bid of 2 crore. Australia's veteran batter Steve Smith headlined the first set of batters to go under the gavel in the IPL 2024 auction. Last week, the player retention window for the Indian Premier League 2024 season drew to a close where the 10 franchises cumulatively retained 173 players. Several renowned overseas players, including Australian fast bowler Mitchell Starc, Australia captain Pat Cummins and pacer Josh Hazlewood, India pacer Harshal Patel, Shardul Thakur, England bowler Chris Woakes, Josh Inglis, New Zealand bowler Lockie Ferguson, Umesh Yadav, Mujeeb Ur Rahman, Adil Rashid, Rassie Van der Dussen, James Vince, Sean Abbott, Jamie Overton, Ben Duckett and Mustafizur Rahman have been added in the highest reserve price list for IPL 2024. Also Read: New Zealand batter Rachin Ravindra, Cummins, South Africa pacer Gerald Coetzee and Shardul Thakur will feature in the second set while Australia bowler Mitchell Starc has been listed in the fourth set. According to the BCCI, the maximum salary cap is available with Gujarat Titans ( 38.15 crore), followed by Sunrisers Hyderabad ( 34 crore), Kolkata Knight Riders ( 32.7 crore), Chennai Super Kings ( 31.4 crore) and Punjab Kings ( 29.1 crore) while the lowest salary cap is available with Lucknow Super Giants ( 13.15 crore), followed by Rajasthan Royals ( 14.5 crore) and then Mumbai Indians ( 17.75 crore). Livemint tops charts as the fastest growing news website in the world to know more. Unlock a world of Benefits! From insightful newsletters to real-time stock tracking, breaking news and a personalized newsfeed – it's all here, just a click away!","pubDate":"2023-12-18 04:27:09","image_url":"https://www.livemint.com/lm-img/img/2023/12/18/1600x900/Capture_1702871283080_1702871292103.PNG","source_id":"livemint","source_priority":7134,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"d7d0485177b39d5e86b94c0a5b2cf054","title":"Humility and heart: how Nathan Lyon became the quietly turning key to Australia’s success","link":"https://www.theguardian.com/sport/blog/2023/dec/18/australia-vs-pakistan-2023-first-test-nathan-lyon","keywords":["Australia cricket team","Cricket","Nathan Lyon","Cricket Australia","Australia sport","Sport","Pakistan cricket team","Steve Smith"],"creator":["Geoff Lemon"],"video_url":null,"description":"After years of being doubted – and doubting himself – the off-spinner’s 500th wicket in the first Test against Pakistan has secured his legacy as one of the greats. And he’s not done yet.Looking back, the start of Nathan Lyon’s Test career can seem impossibly long ago. Taking the ball in Sri Lanka in 2011 is a baby version, head ringed in duck down, face thin and anxious. There are glimpses of his future - start with turn away from the left-hander to get Kumar Sangakkara at slip, end with a diving return catch for a fifth. But there is the confusion of his present, a player unsure how to celebrate when each wicket falls, waving his limbs and jumping sporadically like a foal tangled in a fence.Coming from outside the usual route, playing club cricket into his 20s instead of state age-group in his teens, Lyon for years was unconvinced he belonged. His physical presence has always reflected his jangling nerves: all angles and elbows, an unstuffed puppet with somebody overzealously yanking the strings. The appearance changed, that fuzzy head giving way to the sleek chrome dome that - until that fateful calf tear in London last June - fitted his mechanical reliability. But even before his comeback in Perth last week, on the way to Test wicket 500 and a win against Pakistan, his teammates said he was nervous again.Back in the early years, he had good reason. For years selectors didn’t fully believe in him, often retaining him because of the lack of alternatives. He was left out for four quicks in Perth in 2012, for Xavier Doherty in Hyderabad in 2013, returned for nine wickets in Delhi, then got dropped for the teenage Ashton Agar for that year’s Ashes. As recently as December 2016 he would have been swept out with the new broom after South Africa thrashed Australia in Hobart; five changes for Adelaide would have been six had the replacement spinner Steve O’Keefe not torn a muscle that week.Still, each of those exclusions only lasted one or two matches, and after that final flirtation with the abyss he consistently strengthened his position in the side. He was excellent in India in 2017, setting up what should have been a 2-0 lead but let down by his batters, and even better in Bangladesh in a hard-fought 1-1 series. Now fully equipped to bowl in Asia, you could sense the gradually growing belief that he wasn’t one bad day away from being dumped from the side.With all that insecurity, Lyon has assembled a line of defences as a public figure. Aside from a disastrous few months of attempting trash talk leading up to the sandpaper debacle, he has remained tucked in behind them. With longevity that means he has fronted more press conferences than most, you soon pick up on the repeat lines.“I can’t bat,” is his preface for any conversation about either team’s work with the blade, disingenuously for a guy who has reached or cleared the boundary 190 times in Tests. “To be brutally honest,” he says ahead of any uncontroversial observation, as if to disclaim responsibility should someone disagree. He gives a good workout to lines about not playing for milestones, and expresses embarrassment at being statistically associated with past greats. This week, looking at the significance of the 500, he allowed himself the indulgence of saying: “It’s something that I’m very proud about.” Continue reading...","content":"Looking back, the start of Nathan Lyon’s Test career can seem impossibly long ago. Taking the ball in Sri Lanka in 2011 is a baby version, head ringed in duck down, face thin and anxious. There are glimpses of his future - start with turn away from the left-hander to get Kumar Sangakkara at slip, end with a diving return catch for a fifth. But there is the confusion of his present, a player unsure how to celebrate when each wicket falls, waving his limbs and jumping sporadically like a foal tangled in a fence. Coming from outside the usual route, playing club cricket into his 20s instead of state age-group in his teens, Lyon for years was unconvinced he belonged. His physical presence has always reflected his jangling nerves: all angles and elbows, an unstuffed puppet with somebody overzealously yanking the strings. The appearance changed, that fuzzy head giving way to the sleek chrome dome that - until that fateful calf tear in London last June - fitted his mechanical reliability. But even before his comeback in Perth last week, on the way to Test wicket 500 and a win against Pakistan, his teammates said he was nervous again. Nathan Lyon claims 500th Test wicket as Australia cruise to victory over Pakistan Read more Back in the early years, he had good reason. For years selectors didn’t fully believe in him, often retaining him because of the lack of alternatives. He was left out for four quicks in Perth in 2012, for Xavier Doherty in Hyderabad in 2013, returned for nine wickets in Delhi, then got dropped for the teenage Ashton Agar for that year’s Ashes. As recently as December 2016 he would have been swept out with the new broom after South Africa thrashed Australia in Hobart; five changes for Adelaide would have been six had the replacement spinner Steve O’Keefe not torn a muscle that week. Still, each of those exclusions only lasted one or two matches, and after that final flirtation with the abyss he consistently strengthened his position in the side. He was excellent in India in 2017, setting up what should have been a 2-0 lead but let down by his batters, and even better in Bangladesh in a hard-fought 1-1 series. Now fully equipped to bowl in Asia, you could sense the gradually growing belief that he wasn’t one bad day away from being dumped from the side. With all that insecurity, Lyon has assembled a line of defences as a public figure. Aside from a disastrous few months of attempting trash talk leading up to the sandpaper debacle, he has remained tucked in behind them. With longevity that means he has fronted more press conferences than most, you soon pick up on the repeat lines. “I can’t bat,” is his preface for any conversation about either team’s work with the blade, disingenuously for a guy who has reached or cleared the boundary 190 times in Tests. “To be brutally honest,” he says ahead of any uncontroversial observation, as if to disclaim responsibility should someone disagree. He gives a good workout to lines about not playing for milestones, and expresses embarrassment at being statistically associated with past greats. This week, looking at the significance of the 500, he allowed himself the indulgence of saying: “It’s something that I’m very proud about.” Nathan Lyon bowls on day three of the first Test against Pakistan at Perth Stadium. Photograph: James Worsfold/CA/Cricket Australia/Getty Images Some observers mark spinners by their ability to bowl out teams in the fourth innings. Lyon had an albatross hung around his neck early, largely by Matthew Wade’s wicketkeeping, when South Africa got through 50 of his overs to draw in Adelaide in 2012. The prominent shortfalls include England at Headingley in 2019, India’s double miracle at Sydney and Brisbane in 2021, and the Sydney efforts of England in 2022 and India in 2015. On the counter, Lyon has dominated other tough games bowling last. That 2019 Ashes finished 2-2 thanks to his six wickets setting up the initial lead at Edgbaston. He took seven in the Adelaide epic against India in 2014, and five in the series clincher in Lahore in 2022 when Australia returned to Pakistan. He has taken wickets in 29 Australian wins that were sealed bowling last. But with Lyon there is something else: the reliability he offers in the first half of matches, especially in Australia where spinners are not expected to contribute. Especially orthodox finger spinners. Across the first and second innings of Tests in Australia, many of the game’s great visiting bowlers have paid for their wickets with bowling averages in the 50s, or 70s, or 90s. Lyon has 119 such wickets at 35, going at 2.8 runs per over, while also contributing in the field. Having him to set and forget at one end is the key to Australia’s fast-bowling success, the metronome that the others are able to play around. Doing that job fits with the humility that he has shown through his career. Perhaps the humility is excessive, a legacy of that initial insecurity. But it might also lend itself to longevity. You get the feeling that Lyon still can’t believe that he gets to play for Australia. Doing so has defined his life. So why call time any earlier than his body demands? He has 501 wickets now. Glenn McGrath’s 563 is close. Shane Warne’s 708 is distant but not impossible. He would probably never admit it was a goal, but Nathan Lyon is the kind of character who could just keep quietly grinding towards it.","pubDate":"2023-12-18 04:24:19","image_url":"https://i.guim.co.uk/img/media/efca5001866cf9fc19480232db71e142a668596e/0_211_6328_3800/master/6328.jpg?width=140&quality=85&auto=format&fit=max&s=5838aad58eaa57853768e8f03953608e","source_id":"theguardian","source_priority":106,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"508d8908549419033d486a4a319ce202","title":"Healy 'on track' to lead Australia in Test in India","link":"https://thewest.com.au/sport/cricket/healy-on-track-to-lead-australia-in-test-in-india-c-12943402","keywords":null,"creator":["Oliver Caffrey"],"video_url":null,"description":"Australia captain Alyssa Healy is firming to take part in the historic Test in India but management are reluctant to lock her into the XI just yet.","content":"Captain Alyssa Healy is tracking well to play in Australia's women's Test against India but management are yet confirm her as a certain starter. The star wicketkeeper-batter missed the entire WBBL after badly hurting her finger while trying to break up a fight between her two dogs. But Healy, who was earlier this month appointed the retired Meg Lanning's replacement as Australia captain, is yet to be locked in to play in the historic red-ball match at Mumbai's Wankhede Stadium, starting on Thursday. Australia coach Shelley Nitschke insisted \"everything's on track\" but failed to lock in Healy's spot in the XI. \"She didn't keep in the 50-over game, but that's just part of her progression back to playing,\" Nitschke said on Monday \"Everything's looking really positive for 'Midge' (Healy) and everything's on track, as we expected, so fingers crossed for her it continues to go that way. \"All things being equal, we'll see her out there, unless there's some significant change.\" Australia are expecting to encounter a spin-friendly pitch after India obliterated England by a record 347-margin in their Test last week. Spinner Deepti Sharma starred with bat and ball, bagging nine wickets to bamboozle England's batters. \"It was interesting to watch,\" Nitschke said. \"The conditions out there at DY (Stadium) certainly made it quite challenging. \"I think it's just about reading the conditions at Wankede Stadium, but we also know that things could get quite challenging, but just making sure that we're well prepared for that.\" Australia last played a Test in June when Ashleigh Gardner spun them to a famous Ashes win against England in Nottingham. Australia's women last played a Test in India back in 1984. \"It's a tough one to prepare for,\" Nitschke said. \"The girls are coming off the back of the WBBL and it looks like we're going to get some really traditional subcontinent conditions, but it's also really exciting. \"I think everyone's just embracing the challenge.\" The eagerly-anticipated tour will end with three ODIs and three T20s.","pubDate":"2023-12-18 04:23:54","image_url":"https://images.thewest.com.au/publication/C-12943402/ac3da4160c7cf434879a82f6a11a73721e561767-16x9-x0y0w1280h720.jpg","source_id":"thewest","source_priority":106740,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"078230c44e2ca54909172f9d87c4c2f5","title":"Healy 'on track' to lead Australia in Test in India","link":"https://www.perthnow.com.au/sport/cricket/healy-on-track-to-lead-australia-in-test-in-india-c-12943399","keywords":null,"creator":["Oliver Caffrey"],"video_url":null,"description":"Australia captain Alyssa Healy is firming to take part in the historic Test in India but management are reluctant to lock her into the XI just yet.","content":"Captain Alyssa Healy is tracking well to play in Australia's women's Test against India but management are yet confirm her as a certain starter. The star wicketkeeper-batter missed the entire WBBL after badly hurting her finger while trying to break up a fight between her two dogs. But Healy, who was earlier this month appointed the retired Meg Lanning's replacement as Australia captain, is yet to be locked in to play in the historic red-ball match at Mumbai's Wankhede Stadium, starting on Thursday. Australia coach Shelley Nitschke insisted \"everything's on track\" but failed to lock in Healy's spot in the XI. \"She didn't keep in the 50-over game, but that's just part of her progression back to playing,\" Nitschke said on Monday \"Everything's looking really positive for 'Midge' (Healy) and everything's on track, as we expected, so fingers crossed for her it continues to go that way. \"All things being equal, we'll see her out there, unless there's some significant change.\" Australia are expecting to encounter a spin-friendly pitch after India obliterated England by a record 347-margin in their Test last week. Spinner Deepti Sharma starred with bat and ball, bagging nine wickets to bamboozle England's batters. \"It was interesting to watch,\" Nitschke said. \"The conditions out there at DY (Stadium) certainly made it quite challenging. \"I think it's just about reading the conditions at Wankede Stadium, but we also know that things could get quite challenging, but just making sure that we're well prepared for that.\" Australia last played a Test in June when Ashleigh Gardner spun them to a famous Ashes win against England in Nottingham. Australia's women last played a Test in India back in 1984. \"It's a tough one to prepare for,\" Nitschke said. \"The girls are coming off the back of the WBBL and it looks like we're going to get some really traditional subcontinent conditions, but it's also really exciting. \"I think everyone's just embracing the challenge.\" The eagerly-anticipated tour will end with three ODIs and three T20s.","pubDate":"2023-12-18 04:23:53","image_url":"https://images.perthnow.com.au/publication/C-12943399/ac3da4160c7cf434879a82f6a11a73721e561767-16x9-x0y0w1280h720.jpg","source_id":"perthnow","source_priority":49457,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"055cc4798d6ba7f6cf9cd73b88a9c9b8","title":"Cricket-Australia's Labuschagne relieved after being cleared for second test","link":"https://www.thestar.com.my/sport/cricket/2023/12/18/cricket-australia039s-labuschagne-relieved-after-being-cleared-for-second-test","keywords":null,"creator":null,"video_url":null,"description":"MELBOURNE (Reuters) - With Cameron Green eager to break back into Australia's starting XI, Marnus Labuschagne felt a rush of relief when he was cleared to play in the 'Boxing Day' test against Pakistan after taking a nasty blow to his pinky finger in the hosts' series-opening win. Read full story","content":"MELBOURNE (Reuters) - With Cameron Green eager to break back into Australia's starting XI, Marnus Labuschagne felt a rush of relief when he was cleared to play in the 'Boxing Day' test against Pakistan after taking a nasty blow to his pinky finger in the hosts' series-opening win. Labuschagne needed medical attention after being struck on the right hand by debutant Khurram Shahzad early in the second innings in Perth before top-edging the Pakistan quick to be out for two. All-rounder Green, who lost his place in the squad to Mitchell Marsh, texted best wishes before Labuschagne went in for a scan. Labuschagne joked that he told Green not to get his hopes up. \"He just said, 'I hope it all goes well, good luck,'\" Labuschagne told reporters. \"I just said, 'It’s not going to make a difference, mate'. \"It’s going to have take something pretty serious to have me miss a game.\" Labuschagne was one of several batters sporting bruises in the wake of Australia's 360-run win on day four after the Perth Stadium pitch deteriorated rapidly. Marsh, Steve Smith and Usman Khawaja all suffered body blows, while Pakistan were skittled for 89 in their second innings. Pundits questioned whether the cracked wicket was too lively for a fair contest but Labuschagne stopped short of calling it unsafe. \"No one likes batting when it's like that, up-and-down. The sharp, steep bounce on a fast wicket. It's not a cup of tea for anyone,\" he said. \"But you just have to find a way when it's like that.\" All Australia's players have been cleared for the Dec. 26 test at the Melbourne Cricket Ground. The hosts are unlikely to make changes given the light workloads of captain Pat Cummins and fellow quicks Mitchell Starc and Josh Hazlewood with the trio having seven victims between them on day four. Spinner Nathan Lyon was also able to sneak in a couple of wickets, including his 500th test victim when he trapped Faheem Ashraf lbw. Lyon was hailed by Australian media on Monday for becoming the nation's third bowler to reach the milestone, joining legspinner Shane Warne and fast bowler Glenn McGrath. However, the 500th came only after plenty of debate in the middle with Cummins getting the referral in to the DRS right before the timer ran out. A sheepish Labuschagne, who has long fielded at short leg when Lyon bowls, said he had spoken against taking a review. \"I think I actually said it was high,\" he said. \"So I got that wrong.\" (Reporting by Ian Ransom in Melbourne; Editing by Peter Rutherford)","pubDate":"2023-12-18 04:16:00","image_url":"https://apicms.thestar.com.my/uploads/images/2023/12/18/2445082.jpg","source_id":"thestar_my","source_priority":37088,"country":["malaysia"],"category":["sports"],"language":"english"},{"article_id":"85c997d298c24a124a2a17d6a439afcd","title":"Perth wicket wasn't a danger, says battered Labuschagne","link":"https://thewest.com.au/sport/cricket/perth-wicket-wasnt-a-danger-says-battered-labuschagne-c-12943260","keywords":null,"creator":["Justin Chadwick"],"video_url":null,"description":"Marnus Labuschagne says his finger is feeling considerably better and he's in no doubt to face Pakistan in the Boxing Day Test at the MCG.","content":"Marnus Labuschagne says it would have taken more than a damaged finger to rule him out of the Boxing Day Test, and he doesn't hold any grudges against the cracking Optus Stadium wicket. Labuschagne was sent off for scans on his right little finger on Saturday night after being struck by debutant Pakistan paceman Khurram Shahzad. The cracking wicket created all sorts of problems for batters on days three and four. Steve Smith was struck twice, Usman Khawaja sustained a painful blow just below his right elbow, and Mitch Marsh was twice hit on the helmet. Pakistan were rolled for just 89 in the second innings as the ball wildly jagged and bounced, handing Australia a whopping 360-run win and a 1-0 lead in the series heading into Melbourne. Labuschagne was cleared of any fracture, guaranteeing he will be fit for the Boxing Day Test. It also means allrounder Cameron Green is unlikely to find a way back into the XI just yet. Labuschagne hinted that even if his scans had come back worse than they did, he would have played the Boxing Day test anyway. \"It was funny, Greeny messaged me on the way to getting a scan and he just said, 'I hope it all goes well, good luck',\" Labuschagne said. \"And I said, 'It's not going to make a difference'. It's going have to take something pretty serious I reckon to have me miss a game.\" Labuschagne proved to himself that he was all good to go by returning to the nets on Sunday to face firebrand Lance Morris. \"The finger's fine. There's no break,\" Labuschagne said. \"It hit me more on the knuckle side and sort of just jammed up my hand. \"I was a bit nervous out there because ... I've had a lot of finger blows but it felt a bit different. \"It just got me in a bit of an awkward spot. There was no padding on that side of the glove. \"But I've got some really good range in it, so it's all good.\" Barring late injuries, Australia will field an unchanged XI in Melbourne as they attempt to extend their home winning streak against Pakistan to 16 Tests. The unpredictability of the Optus Stadium pitch on days three and four created havoc for batters, but Labuschagne didn't think it was a dangerous surface. \"It was a bit of a brutal end there with the wicket's cracks opening up,\" Labuschagne said. \"I mean, no one likes batting when it's like that - up and down, the sharp, steep bounce on a fast wicket. \"That's not your cup of tea for anyone, but you just have to find a way when it's like that. \"Potentially if that's a day one wicket, there might be a few more questions asked. \"But I think that's sort of what you what you get coming here (to Perth). \"So no, I don't think it was was reaching that (dangerous) stage, but certainly it was just one of those tough games that you get here.\" Labuschagne is hungry for runs after posting just 16 and two in the series opener.","pubDate":"2023-12-18 04:15:49","image_url":"https://images.thewest.com.au/publication/C-12943260/2dec1b8199610e9e55a91f321a85e37a2a549013-16x9-x0y0w1280h720.jpg","source_id":"thewest","source_priority":106740,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"406b5ec760b7c4efadcdba9bc73de083","title":"Perth wicket wasn't a danger, says battered Labuschagne","link":"https://www.perthnow.com.au/sport/cricket/perth-wicket-wasnt-a-danger-says-battered-labuschagne-c-12943256","keywords":null,"creator":["Justin Chadwick"],"video_url":null,"description":"Marnus Labuschagne says his finger is feeling considerably better and he's in no doubt to face Pakistan in the Boxing Day Test at the MCG.","content":"Marnus Labuschagne says it would have taken more than a damaged finger to rule him out of the Boxing Day Test, and he doesn't hold any grudges against the cracking Optus Stadium wicket. Labuschagne was sent off for scans on his right little finger on Saturday night after being struck by debutant Pakistan paceman Khurram Shahzad. The cracking wicket created all sorts of problems for batters on days three and four. Steve Smith was struck twice, Usman Khawaja sustained a painful blow just below his right elbow, and Mitch Marsh was twice hit on the helmet. Pakistan were rolled for just 89 in the second innings as the ball wildly jagged and bounced, handing Australia a whopping 360-run win and a 1-0 lead in the series heading into Melbourne. Labuschagne was cleared of any fracture, guaranteeing he will be fit for the Boxing Day Test. It also means allrounder Cameron Green is unlikely to find a way back into the XI just yet. Labuschagne hinted that even if his scans had come back worse than they did, he would have played the Boxing Day test anyway. \"It was funny, Greeny messaged me on the way to getting a scan and he just said, 'I hope it all goes well, good luck',\" Labuschagne said. \"And I said, 'It's not going to make a difference'. It's going have to take something pretty serious I reckon to have me miss a game.\" Labuschagne proved to himself that he was all good to go by returning to the nets on Sunday to face firebrand Lance Morris. \"The finger's fine. There's no break,\" Labuschagne said. \"It hit me more on the knuckle side and sort of just jammed up my hand. \"I was a bit nervous out there because ... I've had a lot of finger blows but it felt a bit different. \"It just got me in a bit of an awkward spot. There was no padding on that side of the glove. \"But I've got some really good range in it, so it's all good.\" Barring late injuries, Australia will field an unchanged XI in Melbourne as they attempt to extend their home winning streak against Pakistan to 16 Tests. The unpredictability of the Optus Stadium pitch on days three and four created havoc for batters, but Labuschagne didn't think it was a dangerous surface. \"It was a bit of a brutal end there with the wicket's cracks opening up,\" Labuschagne said. \"I mean, no one likes batting when it's like that - up and down, the sharp, steep bounce on a fast wicket. \"That's not your cup of tea for anyone, but you just have to find a way when it's like that. \"Potentially if that's a day one wicket, there might be a few more questions asked. \"But I think that's sort of what you what you get coming here (to Perth). \"So no, I don't think it was was reaching that (dangerous) stage, but certainly it was just one of those tough games that you get here.\" Labuschagne is hungry for runs after posting just 16 and two in the series opener.","pubDate":"2023-12-18 04:15:48","image_url":"https://images.perthnow.com.au/publication/C-12943256/2dec1b8199610e9e55a91f321a85e37a2a549013-16x9-x0y0w1280h720.jpg","source_id":"perthnow","source_priority":49457,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"8d24b593f24a7be3f2347859d8c1d9f0","title":"New Zealand’s Jamieson rested from Bangladesh ODIs","link":"https://sportstar.thehindu.com/cricket/new-zealand-vs-bangladesh-kyle-jamieson-rested-hamstring-injury-odi-series/article67649585.ece","keywords":["Cricket"],"creator":null,"video_url":null,"description":"The towering quick bowled only four overs in the second test win against Bangladesh in Mirpur this month and missed Sunday’s 44-run victory in the opening ODI in Dunedin.","content":"New Zealand paceman Kyle Jamieson will be rested from the current ODI series against Bangladesh after experiencing a stiff hamstring on his return home from the test tour, New Zealand Cricket said on Monday. The towering quick bowled only four overs in the second test win against Bangladesh in Mirpur this month and missed Sunday’s 44-run victory in the opening ODI in Dunedin. He will miss the final matches of the series in Nelson on Wednesday and Napier on Saturday but should be available for the T20 series starting on Dec. 27 in Napier. Wellington Firebird fast bowler Ben Sears will remain with the squad after being called up as injury cover for Jamieson. The 25-year-old Sears, whose last taste of international cricket was a T20 match away to the Netherlands more than a year ago, will hope to make his ODI debut. New Zealand head coach Gary Stead said the selectors did not want to take any unnecessary risks with Jamieson, who has been blighted by back injuries for much of the past two seasons. “As we flagged when naming the ODI squad we see the series as a chance to provide opportunities to some new players, and Ben fits that category,” he added. Top order batsman Finn Allen will miss the Nelson ODI to play a domestic T20 match for Auckland but will rejoin the squad for the final ODI. Comments Related Topics","pubDate":"2023-12-18 04:10:45","image_url":"https://ss-i.thgim.com/public/incoming/sq9coi/article67649584.ece/alternates/LANDSCAPE_1200/2023-12-17T235547Z_1441493040_RC2N73ARDRSC_RTRMADP_3_CRICKET-ODI-NZL-BGD.JPG","source_id":"sportstar","source_priority":2972,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"6178446d823e710904cc86cf98f194fd","title":"\"कप्तानी की शर्त पर हार्दिक पांड्या ने...\" रोहित शर्मा को कप्तानी से हटाने जाने के बाद पूर्व भारतीय क्रिकेटर का माथा ठनका","link":"https://sports.ndtv.com/hindi/cricket/aakash-chopra-on-hardik-pandya-vs-rohit-sharma-mumba-indians-ipl-2024-auction-4694662#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"IPL 2024 Mumbai Indians, ऐसे में जब यह फैसला आया तो फैन्स हैरान रह गए हैं. फैन्स सोशल मीडिया पर मुंबई इंडियंस के खिलाफ रिएक्ट कर रहे हैं. ऐसे में अब भारत के पूर्व खिलाड़ी और कमेंटेटर आकाश चोपड़ा (Aakash Chopra on Mumbai Indians) ने इस बारे में बात की और अपनी राय रखी है.","content":"Aakash Chopra reaction On Hardik Pandya: हार्दिक को मुंबई का कप्तान बनाए जाने पर पूर्व क्रिकेटर ने किया रिएक्ट रोहित शर्मा के लिए 2024 का IPL मुंबई इंडियन्स (Mumbai Indians) की जर्सी में एक खिलाड़ी के रूप में का आखिरी सत्र हो सकता है, क्योंकि इस फ्रेंचाइजी ने हार्दिक पंड्या (Hardik Pandya) को अपना नया कप्तान घोषित किया रोहित की कप्तानी में टीम इस लीग की सबसे सफल फ्रेंचाइजी बनकर उभरी है. रोहित ने 11 सत्र में टीम की कप्तानी की जिसमें से मुंबई इंडियन्स पांच बार खिताब जीतने में सफल रहा. ऐसे में जब यह फैसला आया तो फैन्स हैरान रह गए हैं. फैन्स सोशल मीडिया पर मुंबई इंडियंस के खिलाफ रिएक्ट कर रहे हैं. ऐसे में अब भारत के पूर्व खिलाड़ी और कमेंटेटर आकाश चोपड़ा (Aakash Chopra on Mumbai Indians) ने इस बारे में बात की और अपनी राय रखी है. अपने पर बात करते हुए आकाश ने कहा कि, \"हार्दिक पंड्या के बारे में बात करने से पहले रोहित के बारे में बात करना चाहूंगा. हार्दिक के कप्तान बनने से ज्यादा रोहित के टीम से अलग होने के चर्चे हो रहे हैं. बेहतरीन कप्तान, आईपीएल के सबसे सफलतम कप्तान. देखिए रोहित एक ऐसे कप्तान रहे हैं जो टीम के खिलाड़ियों को साथ लेकर चलते हैं. जिस किसी ने भी रोहित की कप्तानी में क्रिकेट खेला है, वह यह कहते रहते हैं कि रोहित कप्तान बड़ा अच्छे हैं और इनकी कप्तानी में ही खेलना है. लेकिन अचानक ऐसा क्या हुआ कि हार्दिक को कप्तान बना दिया गया\". आकाश चोपड़ा ने इसके अलावा हार्दिक की मुंबई टीम में एंट्री को लेकर बात की और कहा कि, \"यह कोई अदंर की बात नहीं लगती है. मुझे लगता है कि हार्दिक ने गुजरात को इसी डील पर छोड़ा होगा कि उन्हें कप्तान के तौर पर टीम में जाना है. फैसला रोहित शर्मा को बताया भी गया होगा. फ्यूचर प्लान कहकर रोहित को जानकारी दी गई होगी. मुझे यह भी लगता है कि आशीष नेहरा गुजरात टाइटंस में हार्दिक के साथ थे जिन्होंने उन्हें अच्छा कप्तान बनाया. मुंबई को भी हार्दिक को असरदार बनाने के लिए समय-समय पर इनपुट लेने होंगे. क्योंकि मुझे अभी भी ऐसा नहीं लगता कि हार्दिक पांड्या बतौर कप्तान Finished Product बन पाए हैं.\" पूर्व भारतीय क्रिकेटर ने यह भी कहा कि, \"मुबई इंडियंस ने जो भी फैसला किया है वह रोहित से विचार करने के बाद ही लिया गया है. ऐसा नहीं हो सकता है कि उनसे फ्रेंचाइजी ने बात नहीं की होगी. देखिए जब रोहित को हैदराबाद से लेकर आए थे तो भी फ्यूचर को देखते हुए ही रणनीति बनाई गई थी. अब ऐसा ही हार्दिक को टीम में लाकर मुंबई ने किया है. इसमें कोई गलत बात नहीं है.\" पढ़ें ,राजनीति,खेल समाचार, और की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-12-18 04:08:53","image_url":"https://c.ndtvimg.com/2023-12/k0eqegd8_rohit-hardik-bcci_625x300_18_December_23.jpg","source_id":"ndtv_in","source_priority":129751,"country":["india"],"category":["sports"],"language":"hindi"},{"article_id":"fc150ee4eb32f51a9d53e755439efac1","title":"Sai Sudharsan: 22 साल के साई सुदर्शन ने डेब्यू मैच बनाए रिकॉर्ड, ऐसा करने वाले बने चौथे बल्लेबाज","link":"https://hindi.latestly.com/sports/cricket/sai-sudharsan-22-year-old-sai-sudharsan-made-a-record-in-his-debut-match-became-the-fourth-batsman-to-do-so-2017004.html","keywords":null,"creator":null,"video_url":null,"description":"वांडरर्स, जोहान्सबर्ग में दक्षिण अफ्रीका ने टॉस जीतकर भारत के खिलाफ पहले बल्लेबाजी करने का फैसला किया. लेकिन यह फैसला उल्टा पड़ गया और मेजबान टीम 116 रन पर आउट हो गई. इस मैच में अर्शदीप सिंह ने अपने करियर का सर्वश्रेष्ठ प्रदर्शन करते हुए डेब्यू मैच में 37 रन देकर 5 विकेट लिए और वनडे में अपना पहला पांच विकेट हासिल किया.","content":"वांडरर्स, जोहान्सबर्ग में दक्षिण अफ्रीका ने टॉस जीतकर भारत के खिलाफ पहले बल्लेबाजी करने का फैसला किया. लेकिन यह फैसला उल्टा पड़ गया और मेजबान टीम 116 रन पर आउट हो गई. इस मैच में अर्शदीप सिंह ने अपने करियर का सर्वश्रेष्ठ प्रदर्शन करते हुए डेब्यू मैच में 37 रन देकर 5 विकेट लिए और वनडे में अपना पहला पांच विकेट हासिल किया. दूसरी ओर, आवेश खान ने 4 विकेट हासिल किए. जबकि कुलदीप यादव को एक विकेट मिला. दक्षिण अफ्रीका के लिए एंडिले फेहलुकवायो ने 49 गेंदों पर सर्वाधिक 33 रन बनाए। जवाब में, भारतीय टीम का पहला विकेट जल्दी गिर गया. ऋतुराज गायकवाड़ 5(10) बनाकर आउट हो गए.हालाँकि साई सुदर्शन ने अपना बल्ला चलाया और भारत को प्रोटियाज़ के खिलाफ व्यापक जीत दिलाई. अपने पहले वनडे में बल्लेबाजी करते हुए, तमिलनाडु के युवा खिलाड़ी ने 43 गेंदों पर 55 रन बनाए और दूसरे विकेट के लिए श्रेयस अय्यर के साथ 88 रन की साझेदारी भी की. वहीं श्रेयस िएर ने अर्धशतकीय पारी खेली।.इस बीच साई सुदर्शन ने एक बड़ा रिकॉर्ड अपने नाम किया। वह भारत की और से डेब्यू मैच अर्धशतक लगाने वाले चौथे ओपनर बन गए हैं. सुदर्शन से पहले इस लिस्ट रोबिन उथप्पा, केएल राहुल और फैज़ फजल का नाम है. उथप्पा ने 2006 में इंग्लैंड के खिलाफ 86 रनों की पारी खेली थी. वहीं केएल राहुल ने 2016 इंग्लैंड के खिलाफ नाबाद शतकीय पारी खेली थी. वहीं फैज़ फजल ने 2016 में नाबाद 55 रन ज़िम्बाब्वे के खिलाफ बनाए थे. 86 - रॉबिन उथप्पा बनाम इंग्लैंड, 2006 100* - केएल राहुल बनाम ज़िम्बाब्वे, 2016 55* - फ़ैज़ फ़ज़ल बनाम ज़िम्बाब्वे, 2016 55* - साई सुदर्शन बनाम साउथ अफ्रीका, 2023*","pubDate":"2023-12-18 04:31:51","image_url":"https://hist1.latestly.com/wp-content/uploads/2023/12/Sai-Sudharsan-1-380x214.jpg","source_id":"latestly","source_priority":5523,"country":["india"],"category":["sports"],"language":"hindi"},{"article_id":"82af6b08d6aedf65d327327ee3e9abf9","title":"IPL 2024 Trophy unveiled in Dubai ahead of the auction | Watch","link":"https://www.livemint.com/sports/cricket-news/ipl-2024-trophy-unveiled-in-dubai-ahead-of-the-auction-watch-11702870072548.html","keywords":null,"creator":null,"video_url":null,"description":"The trophy for IPL 2024 has been revealed ahead of the auction, which will be held in Dubai for the first time. Mumbai Indians have named Hardik Pandya as the new captain, replacing Rohit Sharma.","content":"IPL 2024: The trophy of the Indian Premier League (IPL) 2024 has been revealed ahead of the IPL 2024 auction which is scheduled to held on 19 December. The IPL 2024 auction will be held at the Coca-Cola Arena in Dubai, making it the first-ever instance of an auction taking place overseas. Taking to X, IPL official account on X wrote, “Welcome to Dubai! We are all set for the #IPLAuction The trophy in all its glory.\" Also Read: Recently, replaced as the captain and named Hardik Pandya as the new captain. Also Read: Coming back to the IPL 2024 auction, as per statement issued by the IPL, “Out of 333 players, 214 are Indians and 119 are overseas players of which 2 players are from associate nations. The total capped players are 116, uncapped players are 215 and 2 from associate nations.\" Also Read: Players in the top bracket list England batter Harry Brook and Australia's hero Travis Head have been placed in the top bracket of 2 crore for the upcoming IPL 2024 auction. Seven Australians players, including Head, have a starting bid of 2 crore. Australia's veteran batter Steve Smith headlined the first set of batters to go under the gavel in the IPL 2024 auction. Last week, the player retention window for the Indian Premier League 2024 season drew to a close where the 10 franchises cumulatively retained 173 players. Several renowned overseas players, including Australian fast bowler Mitchell Starc, Australia captain Pat Cummins and pacer Josh Hazlewood, India pacer Harshal Patel, Shardul Thakur, England bowler Chris Woakes, Josh Inglis, New Zealand bowler Lockie Ferguson, Umesh Yadav, Mujeeb Ur Rahman, Adil Rashid, Rassie Van der Dussen, James Vince, Sean Abbott, Jamie Overton, Ben Duckett and Mustafizur Rahman have been added in the highest reserve price list for IPL 2024. Also Read: New Zealand batter Rachin Ravindra, Cummins, South Africa pacer Gerald Coetzee and Shardul Thakur will feature in the second set while Australia bowler Mitchell Starc has been listed in the fourth set. According to the BCCI, the maximum salary cap is available with Gujarat Titans ( 38.15 crore), followed by Sunrisers Hyderabad ( 34 crore), Kolkata Knight Riders ( 32.7 crore), Chennai Super Kings ( 31.4 crore) and Punjab Kings ( 29.1 crore) while the lowest salary cap is available with Lucknow Super Giants ( 13.15 crore), followed by Rajasthan Royals ( 14.5 crore) and then Mumbai Indians ( 17.75 crore). Livemint tops charts as the fastest growing news website in the world to know more. Unlock a world of Benefits! From insightful newsletters to real-time stock tracking, breaking news and a personalized newsfeed – it's all here, just a click away!","pubDate":"2023-12-18 04:27:09","image_url":"https://www.livemint.com/lm-img/img/2023/12/18/1600x900/Capture_1702871283080_1702871292103.PNG","source_id":"livemint","source_priority":7134,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"d7d0485177b39d5e86b94c0a5b2cf054","title":"Humility and heart: how Nathan Lyon became the quietly turning key to Australia’s success","link":"https://www.theguardian.com/sport/blog/2023/dec/18/australia-vs-pakistan-2023-first-test-nathan-lyon","keywords":["Australia cricket team","Cricket","Nathan Lyon","Cricket Australia","Australia sport","Sport","Pakistan cricket team","Steve Smith"],"creator":["Geoff Lemon"],"video_url":null,"description":"After years of being doubted – and doubting himself – the off-spinner’s 500th wicket in the first Test against Pakistan has secured his legacy as one of the greats. And he’s not done yet.Looking back, the start of Nathan Lyon’s Test career can seem impossibly long ago. Taking the ball in Sri Lanka in 2011 is a baby version, head ringed in duck down, face thin and anxious. There are glimpses of his future - start with turn away from the left-hander to get Kumar Sangakkara at slip, end with a diving return catch for a fifth. But there is the confusion of his present, a player unsure how to celebrate when each wicket falls, waving his limbs and jumping sporadically like a foal tangled in a fence.Coming from outside the usual route, playing club cricket into his 20s instead of state age-group in his teens, Lyon for years was unconvinced he belonged. His physical presence has always reflected his jangling nerves: all angles and elbows, an unstuffed puppet with somebody overzealously yanking the strings. The appearance changed, that fuzzy head giving way to the sleek chrome dome that - until that fateful calf tear in London last June - fitted his mechanical reliability. But even before his comeback in Perth last week, on the way to Test wicket 500 and a win against Pakistan, his teammates said he was nervous again.Back in the early years, he had good reason. For years selectors didn’t fully believe in him, often retaining him because of the lack of alternatives. He was left out for four quicks in Perth in 2012, for Xavier Doherty in Hyderabad in 2013, returned for nine wickets in Delhi, then got dropped for the teenage Ashton Agar for that year’s Ashes. As recently as December 2016 he would have been swept out with the new broom after South Africa thrashed Australia in Hobart; five changes for Adelaide would have been six had the replacement spinner Steve O’Keefe not torn a muscle that week.Still, each of those exclusions only lasted one or two matches, and after that final flirtation with the abyss he consistently strengthened his position in the side. He was excellent in India in 2017, setting up what should have been a 2-0 lead but let down by his batters, and even better in Bangladesh in a hard-fought 1-1 series. Now fully equipped to bowl in Asia, you could sense the gradually growing belief that he wasn’t one bad day away from being dumped from the side.With all that insecurity, Lyon has assembled a line of defences as a public figure. Aside from a disastrous few months of attempting trash talk leading up to the sandpaper debacle, he has remained tucked in behind them. With longevity that means he has fronted more press conferences than most, you soon pick up on the repeat lines.“I can’t bat,” is his preface for any conversation about either team’s work with the blade, disingenuously for a guy who has reached or cleared the boundary 190 times in Tests. “To be brutally honest,” he says ahead of any uncontroversial observation, as if to disclaim responsibility should someone disagree. He gives a good workout to lines about not playing for milestones, and expresses embarrassment at being statistically associated with past greats. This week, looking at the significance of the 500, he allowed himself the indulgence of saying: “It’s something that I’m very proud about.” Continue reading...","content":"Looking back, the start of Nathan Lyon’s Test career can seem impossibly long ago. Taking the ball in Sri Lanka in 2011 is a baby version, head ringed in duck down, face thin and anxious. There are glimpses of his future - start with turn away from the left-hander to get Kumar Sangakkara at slip, end with a diving return catch for a fifth. But there is the confusion of his present, a player unsure how to celebrate when each wicket falls, waving his limbs and jumping sporadically like a foal tangled in a fence. Coming from outside the usual route, playing club cricket into his 20s instead of state age-group in his teens, Lyon for years was unconvinced he belonged. His physical presence has always reflected his jangling nerves: all angles and elbows, an unstuffed puppet with somebody overzealously yanking the strings. The appearance changed, that fuzzy head giving way to the sleek chrome dome that - until that fateful calf tear in London last June - fitted his mechanical reliability. But even before his comeback in Perth last week, on the way to Test wicket 500 and a win against Pakistan, his teammates said he was nervous again. Nathan Lyon claims 500th Test wicket as Australia cruise to victory over Pakistan Read more Back in the early years, he had good reason. For years selectors didn’t fully believe in him, often retaining him because of the lack of alternatives. He was left out for four quicks in Perth in 2012, for Xavier Doherty in Hyderabad in 2013, returned for nine wickets in Delhi, then got dropped for the teenage Ashton Agar for that year’s Ashes. As recently as December 2016 he would have been swept out with the new broom after South Africa thrashed Australia in Hobart; five changes for Adelaide would have been six had the replacement spinner Steve O’Keefe not torn a muscle that week. Still, each of those exclusions only lasted one or two matches, and after that final flirtation with the abyss he consistently strengthened his position in the side. He was excellent in India in 2017, setting up what should have been a 2-0 lead but let down by his batters, and even better in Bangladesh in a hard-fought 1-1 series. Now fully equipped to bowl in Asia, you could sense the gradually growing belief that he wasn’t one bad day away from being dumped from the side. With all that insecurity, Lyon has assembled a line of defences as a public figure. Aside from a disastrous few months of attempting trash talk leading up to the sandpaper debacle, he has remained tucked in behind them. With longevity that means he has fronted more press conferences than most, you soon pick up on the repeat lines. “I can’t bat,” is his preface for any conversation about either team’s work with the blade, disingenuously for a guy who has reached or cleared the boundary 190 times in Tests. “To be brutally honest,” he says ahead of any uncontroversial observation, as if to disclaim responsibility should someone disagree. He gives a good workout to lines about not playing for milestones, and expresses embarrassment at being statistically associated with past greats. This week, looking at the significance of the 500, he allowed himself the indulgence of saying: “It’s something that I’m very proud about.” Nathan Lyon bowls on day three of the first Test against Pakistan at Perth Stadium. Photograph: James Worsfold/CA/Cricket Australia/Getty Images Some observers mark spinners by their ability to bowl out teams in the fourth innings. Lyon had an albatross hung around his neck early, largely by Matthew Wade’s wicketkeeping, when South Africa got through 50 of his overs to draw in Adelaide in 2012. The prominent shortfalls include England at Headingley in 2019, India’s double miracle at Sydney and Brisbane in 2021, and the Sydney efforts of England in 2022 and India in 2015. On the counter, Lyon has dominated other tough games bowling last. That 2019 Ashes finished 2-2 thanks to his six wickets setting up the initial lead at Edgbaston. He took seven in the Adelaide epic against India in 2014, and five in the series clincher in Lahore in 2022 when Australia returned to Pakistan. He has taken wickets in 29 Australian wins that were sealed bowling last. But with Lyon there is something else: the reliability he offers in the first half of matches, especially in Australia where spinners are not expected to contribute. Especially orthodox finger spinners. Across the first and second innings of Tests in Australia, many of the game’s great visiting bowlers have paid for their wickets with bowling averages in the 50s, or 70s, or 90s. Lyon has 119 such wickets at 35, going at 2.8 runs per over, while also contributing in the field. Having him to set and forget at one end is the key to Australia’s fast-bowling success, the metronome that the others are able to play around. Doing that job fits with the humility that he has shown through his career. Perhaps the humility is excessive, a legacy of that initial insecurity. But it might also lend itself to longevity. You get the feeling that Lyon still can’t believe that he gets to play for Australia. Doing so has defined his life. So why call time any earlier than his body demands? He has 501 wickets now. Glenn McGrath’s 563 is close. Shane Warne’s 708 is distant but not impossible. He would probably never admit it was a goal, but Nathan Lyon is the kind of character who could just keep quietly grinding towards it.","pubDate":"2023-12-18 04:24:19","image_url":"https://i.guim.co.uk/img/media/efca5001866cf9fc19480232db71e142a668596e/0_211_6328_3800/master/6328.jpg?width=140&quality=85&auto=format&fit=max&s=5838aad58eaa57853768e8f03953608e","source_id":"theguardian","source_priority":106,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"508d8908549419033d486a4a319ce202","title":"Healy 'on track' to lead Australia in Test in India","link":"https://thewest.com.au/sport/cricket/healy-on-track-to-lead-australia-in-test-in-india-c-12943402","keywords":null,"creator":["Oliver Caffrey"],"video_url":null,"description":"Australia captain Alyssa Healy is firming to take part in the historic Test in India but management are reluctant to lock her into the XI just yet.","content":"Captain Alyssa Healy is tracking well to play in Australia's women's Test against India but management are yet confirm her as a certain starter. The star wicketkeeper-batter missed the entire WBBL after badly hurting her finger while trying to break up a fight between her two dogs. But Healy, who was earlier this month appointed the retired Meg Lanning's replacement as Australia captain, is yet to be locked in to play in the historic red-ball match at Mumbai's Wankhede Stadium, starting on Thursday. Australia coach Shelley Nitschke insisted \"everything's on track\" but failed to lock in Healy's spot in the XI. \"She didn't keep in the 50-over game, but that's just part of her progression back to playing,\" Nitschke said on Monday \"Everything's looking really positive for 'Midge' (Healy) and everything's on track, as we expected, so fingers crossed for her it continues to go that way. \"All things being equal, we'll see her out there, unless there's some significant change.\" Australia are expecting to encounter a spin-friendly pitch after India obliterated England by a record 347-margin in their Test last week. Spinner Deepti Sharma starred with bat and ball, bagging nine wickets to bamboozle England's batters. \"It was interesting to watch,\" Nitschke said. \"The conditions out there at DY (Stadium) certainly made it quite challenging. \"I think it's just about reading the conditions at Wankede Stadium, but we also know that things could get quite challenging, but just making sure that we're well prepared for that.\" Australia last played a Test in June when Ashleigh Gardner spun them to a famous Ashes win against England in Nottingham. Australia's women last played a Test in India back in 1984. \"It's a tough one to prepare for,\" Nitschke said. \"The girls are coming off the back of the WBBL and it looks like we're going to get some really traditional subcontinent conditions, but it's also really exciting. \"I think everyone's just embracing the challenge.\" The eagerly-anticipated tour will end with three ODIs and three T20s.","pubDate":"2023-12-18 04:23:54","image_url":"https://images.thewest.com.au/publication/C-12943402/ac3da4160c7cf434879a82f6a11a73721e561767-16x9-x0y0w1280h720.jpg","source_id":"thewest","source_priority":106740,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"078230c44e2ca54909172f9d87c4c2f5","title":"Healy 'on track' to lead Australia in Test in India","link":"https://www.perthnow.com.au/sport/cricket/healy-on-track-to-lead-australia-in-test-in-india-c-12943399","keywords":null,"creator":["Oliver Caffrey"],"video_url":null,"description":"Australia captain Alyssa Healy is firming to take part in the historic Test in India but management are reluctant to lock her into the XI just yet.","content":"Captain Alyssa Healy is tracking well to play in Australia's women's Test against India but management are yet confirm her as a certain starter. The star wicketkeeper-batter missed the entire WBBL after badly hurting her finger while trying to break up a fight between her two dogs. But Healy, who was earlier this month appointed the retired Meg Lanning's replacement as Australia captain, is yet to be locked in to play in the historic red-ball match at Mumbai's Wankhede Stadium, starting on Thursday. Australia coach Shelley Nitschke insisted \"everything's on track\" but failed to lock in Healy's spot in the XI. \"She didn't keep in the 50-over game, but that's just part of her progression back to playing,\" Nitschke said on Monday \"Everything's looking really positive for 'Midge' (Healy) and everything's on track, as we expected, so fingers crossed for her it continues to go that way. \"All things being equal, we'll see her out there, unless there's some significant change.\" Australia are expecting to encounter a spin-friendly pitch after India obliterated England by a record 347-margin in their Test last week. Spinner Deepti Sharma starred with bat and ball, bagging nine wickets to bamboozle England's batters. \"It was interesting to watch,\" Nitschke said. \"The conditions out there at DY (Stadium) certainly made it quite challenging. \"I think it's just about reading the conditions at Wankede Stadium, but we also know that things could get quite challenging, but just making sure that we're well prepared for that.\" Australia last played a Test in June when Ashleigh Gardner spun them to a famous Ashes win against England in Nottingham. Australia's women last played a Test in India back in 1984. \"It's a tough one to prepare for,\" Nitschke said. \"The girls are coming off the back of the WBBL and it looks like we're going to get some really traditional subcontinent conditions, but it's also really exciting. \"I think everyone's just embracing the challenge.\" The eagerly-anticipated tour will end with three ODIs and three T20s.","pubDate":"2023-12-18 04:23:53","image_url":"https://images.perthnow.com.au/publication/C-12943399/ac3da4160c7cf434879a82f6a11a73721e561767-16x9-x0y0w1280h720.jpg","source_id":"perthnow","source_priority":49457,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"055cc4798d6ba7f6cf9cd73b88a9c9b8","title":"Cricket-Australia's Labuschagne relieved after being cleared for second test","link":"https://www.thestar.com.my/sport/cricket/2023/12/18/cricket-australia039s-labuschagne-relieved-after-being-cleared-for-second-test","keywords":null,"creator":null,"video_url":null,"description":"MELBOURNE (Reuters) - With Cameron Green eager to break back into Australia's starting XI, Marnus Labuschagne felt a rush of relief when he was cleared to play in the 'Boxing Day' test against Pakistan after taking a nasty blow to his pinky finger in the hosts' series-opening win. Read full story","content":"MELBOURNE (Reuters) - With Cameron Green eager to break back into Australia's starting XI, Marnus Labuschagne felt a rush of relief when he was cleared to play in the 'Boxing Day' test against Pakistan after taking a nasty blow to his pinky finger in the hosts' series-opening win. Labuschagne needed medical attention after being struck on the right hand by debutant Khurram Shahzad early in the second innings in Perth before top-edging the Pakistan quick to be out for two. All-rounder Green, who lost his place in the squad to Mitchell Marsh, texted best wishes before Labuschagne went in for a scan. Labuschagne joked that he told Green not to get his hopes up. \"He just said, 'I hope it all goes well, good luck,'\" Labuschagne told reporters. \"I just said, 'It’s not going to make a difference, mate'. \"It’s going to have take something pretty serious to have me miss a game.\" Labuschagne was one of several batters sporting bruises in the wake of Australia's 360-run win on day four after the Perth Stadium pitch deteriorated rapidly. Marsh, Steve Smith and Usman Khawaja all suffered body blows, while Pakistan were skittled for 89 in their second innings. Pundits questioned whether the cracked wicket was too lively for a fair contest but Labuschagne stopped short of calling it unsafe. \"No one likes batting when it's like that, up-and-down. The sharp, steep bounce on a fast wicket. It's not a cup of tea for anyone,\" he said. \"But you just have to find a way when it's like that.\" All Australia's players have been cleared for the Dec. 26 test at the Melbourne Cricket Ground. The hosts are unlikely to make changes given the light workloads of captain Pat Cummins and fellow quicks Mitchell Starc and Josh Hazlewood with the trio having seven victims between them on day four. Spinner Nathan Lyon was also able to sneak in a couple of wickets, including his 500th test victim when he trapped Faheem Ashraf lbw. Lyon was hailed by Australian media on Monday for becoming the nation's third bowler to reach the milestone, joining legspinner Shane Warne and fast bowler Glenn McGrath. However, the 500th came only after plenty of debate in the middle with Cummins getting the referral in to the DRS right before the timer ran out. A sheepish Labuschagne, who has long fielded at short leg when Lyon bowls, said he had spoken against taking a review. \"I think I actually said it was high,\" he said. \"So I got that wrong.\" (Reporting by Ian Ransom in Melbourne; Editing by Peter Rutherford)","pubDate":"2023-12-18 04:16:00","image_url":"https://apicms.thestar.com.my/uploads/images/2023/12/18/2445082.jpg","source_id":"thestar_my","source_priority":37088,"country":["malaysia"],"category":["sports"],"language":"english"},{"article_id":"85c997d298c24a124a2a17d6a439afcd","title":"Perth wicket wasn't a danger, says battered Labuschagne","link":"https://thewest.com.au/sport/cricket/perth-wicket-wasnt-a-danger-says-battered-labuschagne-c-12943260","keywords":null,"creator":["Justin Chadwick"],"video_url":null,"description":"Marnus Labuschagne says his finger is feeling considerably better and he's in no doubt to face Pakistan in the Boxing Day Test at the MCG.","content":"Marnus Labuschagne says it would have taken more than a damaged finger to rule him out of the Boxing Day Test, and he doesn't hold any grudges against the cracking Optus Stadium wicket. Labuschagne was sent off for scans on his right little finger on Saturday night after being struck by debutant Pakistan paceman Khurram Shahzad. The cracking wicket created all sorts of problems for batters on days three and four. Steve Smith was struck twice, Usman Khawaja sustained a painful blow just below his right elbow, and Mitch Marsh was twice hit on the helmet. Pakistan were rolled for just 89 in the second innings as the ball wildly jagged and bounced, handing Australia a whopping 360-run win and a 1-0 lead in the series heading into Melbourne. Labuschagne was cleared of any fracture, guaranteeing he will be fit for the Boxing Day Test. It also means allrounder Cameron Green is unlikely to find a way back into the XI just yet. Labuschagne hinted that even if his scans had come back worse than they did, he would have played the Boxing Day test anyway. \"It was funny, Greeny messaged me on the way to getting a scan and he just said, 'I hope it all goes well, good luck',\" Labuschagne said. \"And I said, 'It's not going to make a difference'. It's going have to take something pretty serious I reckon to have me miss a game.\" Labuschagne proved to himself that he was all good to go by returning to the nets on Sunday to face firebrand Lance Morris. \"The finger's fine. There's no break,\" Labuschagne said. \"It hit me more on the knuckle side and sort of just jammed up my hand. \"I was a bit nervous out there because ... I've had a lot of finger blows but it felt a bit different. \"It just got me in a bit of an awkward spot. There was no padding on that side of the glove. \"But I've got some really good range in it, so it's all good.\" Barring late injuries, Australia will field an unchanged XI in Melbourne as they attempt to extend their home winning streak against Pakistan to 16 Tests. The unpredictability of the Optus Stadium pitch on days three and four created havoc for batters, but Labuschagne didn't think it was a dangerous surface. \"It was a bit of a brutal end there with the wicket's cracks opening up,\" Labuschagne said. \"I mean, no one likes batting when it's like that - up and down, the sharp, steep bounce on a fast wicket. \"That's not your cup of tea for anyone, but you just have to find a way when it's like that. \"Potentially if that's a day one wicket, there might be a few more questions asked. \"But I think that's sort of what you what you get coming here (to Perth). \"So no, I don't think it was was reaching that (dangerous) stage, but certainly it was just one of those tough games that you get here.\" Labuschagne is hungry for runs after posting just 16 and two in the series opener.","pubDate":"2023-12-18 04:15:49","image_url":"https://images.thewest.com.au/publication/C-12943260/2dec1b8199610e9e55a91f321a85e37a2a549013-16x9-x0y0w1280h720.jpg","source_id":"thewest","source_priority":106740,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"406b5ec760b7c4efadcdba9bc73de083","title":"Perth wicket wasn't a danger, says battered Labuschagne","link":"https://www.perthnow.com.au/sport/cricket/perth-wicket-wasnt-a-danger-says-battered-labuschagne-c-12943256","keywords":null,"creator":["Justin Chadwick"],"video_url":null,"description":"Marnus Labuschagne says his finger is feeling considerably better and he's in no doubt to face Pakistan in the Boxing Day Test at the MCG.","content":"Marnus Labuschagne says it would have taken more than a damaged finger to rule him out of the Boxing Day Test, and he doesn't hold any grudges against the cracking Optus Stadium wicket. Labuschagne was sent off for scans on his right little finger on Saturday night after being struck by debutant Pakistan paceman Khurram Shahzad. The cracking wicket created all sorts of problems for batters on days three and four. Steve Smith was struck twice, Usman Khawaja sustained a painful blow just below his right elbow, and Mitch Marsh was twice hit on the helmet. Pakistan were rolled for just 89 in the second innings as the ball wildly jagged and bounced, handing Australia a whopping 360-run win and a 1-0 lead in the series heading into Melbourne. Labuschagne was cleared of any fracture, guaranteeing he will be fit for the Boxing Day Test. It also means allrounder Cameron Green is unlikely to find a way back into the XI just yet. Labuschagne hinted that even if his scans had come back worse than they did, he would have played the Boxing Day test anyway. \"It was funny, Greeny messaged me on the way to getting a scan and he just said, 'I hope it all goes well, good luck',\" Labuschagne said. \"And I said, 'It's not going to make a difference'. It's going have to take something pretty serious I reckon to have me miss a game.\" Labuschagne proved to himself that he was all good to go by returning to the nets on Sunday to face firebrand Lance Morris. \"The finger's fine. There's no break,\" Labuschagne said. \"It hit me more on the knuckle side and sort of just jammed up my hand. \"I was a bit nervous out there because ... I've had a lot of finger blows but it felt a bit different. \"It just got me in a bit of an awkward spot. There was no padding on that side of the glove. \"But I've got some really good range in it, so it's all good.\" Barring late injuries, Australia will field an unchanged XI in Melbourne as they attempt to extend their home winning streak against Pakistan to 16 Tests. The unpredictability of the Optus Stadium pitch on days three and four created havoc for batters, but Labuschagne didn't think it was a dangerous surface. \"It was a bit of a brutal end there with the wicket's cracks opening up,\" Labuschagne said. \"I mean, no one likes batting when it's like that - up and down, the sharp, steep bounce on a fast wicket. \"That's not your cup of tea for anyone, but you just have to find a way when it's like that. \"Potentially if that's a day one wicket, there might be a few more questions asked. \"But I think that's sort of what you what you get coming here (to Perth). \"So no, I don't think it was was reaching that (dangerous) stage, but certainly it was just one of those tough games that you get here.\" Labuschagne is hungry for runs after posting just 16 and two in the series opener.","pubDate":"2023-12-18 04:15:48","image_url":"https://images.perthnow.com.au/publication/C-12943256/2dec1b8199610e9e55a91f321a85e37a2a549013-16x9-x0y0w1280h720.jpg","source_id":"perthnow","source_priority":49457,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"8d24b593f24a7be3f2347859d8c1d9f0","title":"New Zealand’s Jamieson rested from Bangladesh ODIs","link":"https://sportstar.thehindu.com/cricket/new-zealand-vs-bangladesh-kyle-jamieson-rested-hamstring-injury-odi-series/article67649585.ece","keywords":["Cricket"],"creator":null,"video_url":null,"description":"The towering quick bowled only four overs in the second test win against Bangladesh in Mirpur this month and missed Sunday’s 44-run victory in the opening ODI in Dunedin.","content":"New Zealand paceman Kyle Jamieson will be rested from the current ODI series against Bangladesh after experiencing a stiff hamstring on his return home from the test tour, New Zealand Cricket said on Monday. The towering quick bowled only four overs in the second test win against Bangladesh in Mirpur this month and missed Sunday’s 44-run victory in the opening ODI in Dunedin. He will miss the final matches of the series in Nelson on Wednesday and Napier on Saturday but should be available for the T20 series starting on Dec. 27 in Napier. Wellington Firebird fast bowler Ben Sears will remain with the squad after being called up as injury cover for Jamieson. The 25-year-old Sears, whose last taste of international cricket was a T20 match away to the Netherlands more than a year ago, will hope to make his ODI debut. New Zealand head coach Gary Stead said the selectors did not want to take any unnecessary risks with Jamieson, who has been blighted by back injuries for much of the past two seasons. “As we flagged when naming the ODI squad we see the series as a chance to provide opportunities to some new players, and Ben fits that category,” he added. Top order batsman Finn Allen will miss the Nelson ODI to play a domestic T20 match for Auckland but will rejoin the squad for the final ODI. Comments Related Topics","pubDate":"2023-12-18 04:10:45","image_url":"https://ss-i.thgim.com/public/incoming/sq9coi/article67649584.ece/alternates/LANDSCAPE_1200/2023-12-17T235547Z_1441493040_RC2N73ARDRSC_RTRMADP_3_CRICKET-ODI-NZL-BGD.JPG","source_id":"sportstar","source_priority":2972,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"6178446d823e710904cc86cf98f194fd","title":"\"कप्तानी की शर्त पर हार्दिक पांड्या ने...\" रोहित शर्मा को कप्तानी से हटाने जाने के बाद पूर्व भारतीय क्रिकेटर का माथा ठनका","link":"https://sports.ndtv.com/hindi/cricket/aakash-chopra-on-hardik-pandya-vs-rohit-sharma-mumba-indians-ipl-2024-auction-4694662#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"IPL 2024 Mumbai Indians, ऐसे में जब यह फैसला आया तो फैन्स हैरान रह गए हैं. फैन्स सोशल मीडिया पर मुंबई इंडियंस के खिलाफ रिएक्ट कर रहे हैं. ऐसे में अब भारत के पूर्व खिलाड़ी और कमेंटेटर आकाश चोपड़ा (Aakash Chopra on Mumbai Indians) ने इस बारे में बात की और अपनी राय रखी है.","content":"Aakash Chopra reaction On Hardik Pandya: हार्दिक को मुंबई का कप्तान बनाए जाने पर पूर्व क्रिकेटर ने किया रिएक्ट रोहित शर्मा के लिए 2024 का IPL मुंबई इंडियन्स (Mumbai Indians) की जर्सी में एक खिलाड़ी के रूप में का आखिरी सत्र हो सकता है, क्योंकि इस फ्रेंचाइजी ने हार्दिक पंड्या (Hardik Pandya) को अपना नया कप्तान घोषित किया रोहित की कप्तानी में टीम इस लीग की सबसे सफल फ्रेंचाइजी बनकर उभरी है. रोहित ने 11 सत्र में टीम की कप्तानी की जिसमें से मुंबई इंडियन्स पांच बार खिताब जीतने में सफल रहा. ऐसे में जब यह फैसला आया तो फैन्स हैरान रह गए हैं. फैन्स सोशल मीडिया पर मुंबई इंडियंस के खिलाफ रिएक्ट कर रहे हैं. ऐसे में अब भारत के पूर्व खिलाड़ी और कमेंटेटर आकाश चोपड़ा (Aakash Chopra on Mumbai Indians) ने इस बारे में बात की और अपनी राय रखी है. अपने पर बात करते हुए आकाश ने कहा कि, \"हार्दिक पंड्या के बारे में बात करने से पहले रोहित के बारे में बात करना चाहूंगा. हार्दिक के कप्तान बनने से ज्यादा रोहित के टीम से अलग होने के चर्चे हो रहे हैं. बेहतरीन कप्तान, आईपीएल के सबसे सफलतम कप्तान. देखिए रोहित एक ऐसे कप्तान रहे हैं जो टीम के खिलाड़ियों को साथ लेकर चलते हैं. जिस किसी ने भी रोहित की कप्तानी में क्रिकेट खेला है, वह यह कहते रहते हैं कि रोहित कप्तान बड़ा अच्छे हैं और इनकी कप्तानी में ही खेलना है. लेकिन अचानक ऐसा क्या हुआ कि हार्दिक को कप्तान बना दिया गया\". आकाश चोपड़ा ने इसके अलावा हार्दिक की मुंबई टीम में एंट्री को लेकर बात की और कहा कि, \"यह कोई अदंर की बात नहीं लगती है. मुझे लगता है कि हार्दिक ने गुजरात को इसी डील पर छोड़ा होगा कि उन्हें कप्तान के तौर पर टीम में जाना है. फैसला रोहित शर्मा को बताया भी गया होगा. फ्यूचर प्लान कहकर रोहित को जानकारी दी गई होगी. मुझे यह भी लगता है कि आशीष नेहरा गुजरात टाइटंस में हार्दिक के साथ थे जिन्होंने उन्हें अच्छा कप्तान बनाया. मुंबई को भी हार्दिक को असरदार बनाने के लिए समय-समय पर इनपुट लेने होंगे. क्योंकि मुझे अभी भी ऐसा नहीं लगता कि हार्दिक पांड्या बतौर कप्तान Finished Product बन पाए हैं.\" पूर्व भारतीय क्रिकेटर ने यह भी कहा कि, \"मुबई इंडियंस ने जो भी फैसला किया है वह रोहित से विचार करने के बाद ही लिया गया है. ऐसा नहीं हो सकता है कि उनसे फ्रेंचाइजी ने बात नहीं की होगी. देखिए जब रोहित को हैदराबाद से लेकर आए थे तो भी फ्यूचर को देखते हुए ही रणनीति बनाई गई थी. अब ऐसा ही हार्दिक को टीम में लाकर मुंबई ने किया है. इसमें कोई गलत बात नहीं है.\" पढ़ें ,राजनीति,खेल समाचार, और की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-12-18 04:08:53","image_url":"https://c.ndtvimg.com/2023-12/k0eqegd8_rohit-hardik-bcci_625x300_18_December_23.jpg","source_id":"ndtv_in","source_priority":129751,"country":["india"],"category":["sports"],"language":"hindi"},{"article_id":"fc150ee4eb32f51a9d53e755439efac1","title":"Sai Sudharsan: 22 साल के साई सुदर्शन ने डेब्यू मैच बनाए रिकॉर्ड, ऐसा करने वाले बने चौथे बल्लेबाज","link":"https://hindi.latestly.com/sports/cricket/sai-sudharsan-22-year-old-sai-sudharsan-made-a-record-in-his-debut-match-became-the-fourth-batsman-to-do-so-2017004.html","keywords":null,"creator":null,"video_url":null,"description":"वांडरर्स, जोहान्सबर्ग में दक्षिण अफ्रीका ने टॉस जीतकर भारत के खिलाफ पहले बल्लेबाजी करने का फैसला किया. लेकिन यह फैसला उल्टा पड़ गया और मेजबान टीम 116 रन पर आउट हो गई. इस मैच में अर्शदीप सिंह ने अपने करियर का सर्वश्रेष्ठ प्रदर्शन करते हुए डेब्यू मैच में 37 रन देकर 5 विकेट लिए और वनडे में अपना पहला पांच विकेट हासिल किया.","content":"वांडरर्स, जोहान्सबर्ग में दक्षिण अफ्रीका ने टॉस जीतकर भारत के खिलाफ पहले बल्लेबाजी करने का फैसला किया. लेकिन यह फैसला उल्टा पड़ गया और मेजबान टीम 116 रन पर आउट हो गई. इस मैच में अर्शदीप सिंह ने अपने करियर का सर्वश्रेष्ठ प्रदर्शन करते हुए डेब्यू मैच में 37 रन देकर 5 विकेट लिए और वनडे में अपना पहला पांच विकेट हासिल किया. दूसरी ओर, आवेश खान ने 4 विकेट हासिल किए. जबकि कुलदीप यादव को एक विकेट मिला. दक्षिण अफ्रीका के लिए एंडिले फेहलुकवायो ने 49 गेंदों पर सर्वाधिक 33 रन बनाए। जवाब में, भारतीय टीम का पहला विकेट जल्दी गिर गया. ऋतुराज गायकवाड़ 5(10) बनाकर आउट हो गए.हालाँकि साई सुदर्शन ने अपना बल्ला चलाया और भारत को प्रोटियाज़ के खिलाफ व्यापक जीत दिलाई. अपने पहले वनडे में बल्लेबाजी करते हुए, तमिलनाडु के युवा खिलाड़ी ने 43 गेंदों पर 55 रन बनाए और दूसरे विकेट के लिए श्रेयस अय्यर के साथ 88 रन की साझेदारी भी की. वहीं श्रेयस िएर ने अर्धशतकीय पारी खेली।.इस बीच साई सुदर्शन ने एक बड़ा रिकॉर्ड अपने नाम किया। वह भारत की और से डेब्यू मैच अर्धशतक लगाने वाले चौथे ओपनर बन गए हैं. सुदर्शन से पहले इस लिस्ट रोबिन उथप्पा, केएल राहुल और फैज़ फजल का नाम है. उथप्पा ने 2006 में इंग्लैंड के खिलाफ 86 रनों की पारी खेली थी. वहीं केएल राहुल ने 2016 इंग्लैंड के खिलाफ नाबाद शतकीय पारी खेली थी. वहीं फैज़ फजल ने 2016 में नाबाद 55 रन ज़िम्बाब्वे के खिलाफ बनाए थे. 86 - रॉबिन उथप्पा बनाम इंग्लैंड, 2006 100* - केएल राहुल बनाम ज़िम्बाब्वे, 2016 55* - फ़ैज़ फ़ज़ल बनाम ज़िम्बाब्वे, 2016 55* - साई सुदर्शन बनाम साउथ अफ्रीका, 2023*","pubDate":"2023-12-18 04:31:51","image_url":"https://hist1.latestly.com/wp-content/uploads/2023/12/Sai-Sudharsan-1-380x214.jpg","source_id":"latestly","source_priority":5523,"country":["india"],"category":["sports"],"language":"hindi"},{"article_id":"82af6b08d6aedf65d327327ee3e9abf9","title":"IPL 2024 Trophy unveiled in Dubai ahead of the auction | Watch","link":"https://www.livemint.com/sports/cricket-news/ipl-2024-trophy-unveiled-in-dubai-ahead-of-the-auction-watch-11702870072548.html","keywords":null,"creator":null,"video_url":null,"description":"The trophy for IPL 2024 has been revealed ahead of the auction, which will be held in Dubai for the first time. Mumbai Indians have named Hardik Pandya as the new captain, replacing Rohit Sharma.","content":"IPL 2024: The trophy of the Indian Premier League (IPL) 2024 has been revealed ahead of the IPL 2024 auction which is scheduled to held on 19 December. The IPL 2024 auction will be held at the Coca-Cola Arena in Dubai, making it the first-ever instance of an auction taking place overseas. Taking to X, IPL official account on X wrote, “Welcome to Dubai! We are all set for the #IPLAuction The trophy in all its glory.\" Also Read: Recently, replaced as the captain and named Hardik Pandya as the new captain. Also Read: Coming back to the IPL 2024 auction, as per statement issued by the IPL, “Out of 333 players, 214 are Indians and 119 are overseas players of which 2 players are from associate nations. The total capped players are 116, uncapped players are 215 and 2 from associate nations.\" Also Read: Players in the top bracket list England batter Harry Brook and Australia's hero Travis Head have been placed in the top bracket of 2 crore for the upcoming IPL 2024 auction. Seven Australians players, including Head, have a starting bid of 2 crore. Australia's veteran batter Steve Smith headlined the first set of batters to go under the gavel in the IPL 2024 auction. Last week, the player retention window for the Indian Premier League 2024 season drew to a close where the 10 franchises cumulatively retained 173 players. Several renowned overseas players, including Australian fast bowler Mitchell Starc, Australia captain Pat Cummins and pacer Josh Hazlewood, India pacer Harshal Patel, Shardul Thakur, England bowler Chris Woakes, Josh Inglis, New Zealand bowler Lockie Ferguson, Umesh Yadav, Mujeeb Ur Rahman, Adil Rashid, Rassie Van der Dussen, James Vince, Sean Abbott, Jamie Overton, Ben Duckett and Mustafizur Rahman have been added in the highest reserve price list for IPL 2024. Also Read: New Zealand batter Rachin Ravindra, Cummins, South Africa pacer Gerald Coetzee and Shardul Thakur will feature in the second set while Australia bowler Mitchell Starc has been listed in the fourth set. According to the BCCI, the maximum salary cap is available with Gujarat Titans ( 38.15 crore), followed by Sunrisers Hyderabad ( 34 crore), Kolkata Knight Riders ( 32.7 crore), Chennai Super Kings ( 31.4 crore) and Punjab Kings ( 29.1 crore) while the lowest salary cap is available with Lucknow Super Giants ( 13.15 crore), followed by Rajasthan Royals ( 14.5 crore) and then Mumbai Indians ( 17.75 crore). Livemint tops charts as the fastest growing news website in the world to know more. Unlock a world of Benefits! From insightful newsletters to real-time stock tracking, breaking news and a personalized newsfeed – it's all here, just a click away!","pubDate":"2023-12-18 04:27:09","image_url":"https://www.livemint.com/lm-img/img/2023/12/18/1600x900/Capture_1702871283080_1702871292103.PNG","source_id":"livemint","source_priority":7134,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"d7d0485177b39d5e86b94c0a5b2cf054","title":"Humility and heart: how Nathan Lyon became the quietly turning key to Australia’s success","link":"https://www.theguardian.com/sport/blog/2023/dec/18/australia-vs-pakistan-2023-first-test-nathan-lyon","keywords":["Australia cricket team","Cricket","Nathan Lyon","Cricket Australia","Australia sport","Sport","Pakistan cricket team","Steve Smith"],"creator":["Geoff Lemon"],"video_url":null,"description":"After years of being doubted – and doubting himself – the off-spinner’s 500th wicket in the first Test against Pakistan has secured his legacy as one of the greats. And he’s not done yet.Looking back, the start of Nathan Lyon’s Test career can seem impossibly long ago. Taking the ball in Sri Lanka in 2011 is a baby version, head ringed in duck down, face thin and anxious. There are glimpses of his future - start with turn away from the left-hander to get Kumar Sangakkara at slip, end with a diving return catch for a fifth. But there is the confusion of his present, a player unsure how to celebrate when each wicket falls, waving his limbs and jumping sporadically like a foal tangled in a fence.Coming from outside the usual route, playing club cricket into his 20s instead of state age-group in his teens, Lyon for years was unconvinced he belonged. His physical presence has always reflected his jangling nerves: all angles and elbows, an unstuffed puppet with somebody overzealously yanking the strings. The appearance changed, that fuzzy head giving way to the sleek chrome dome that - until that fateful calf tear in London last June - fitted his mechanical reliability. But even before his comeback in Perth last week, on the way to Test wicket 500 and a win against Pakistan, his teammates said he was nervous again.Back in the early years, he had good reason. For years selectors didn’t fully believe in him, often retaining him because of the lack of alternatives. He was left out for four quicks in Perth in 2012, for Xavier Doherty in Hyderabad in 2013, returned for nine wickets in Delhi, then got dropped for the teenage Ashton Agar for that year’s Ashes. As recently as December 2016 he would have been swept out with the new broom after South Africa thrashed Australia in Hobart; five changes for Adelaide would have been six had the replacement spinner Steve O’Keefe not torn a muscle that week.Still, each of those exclusions only lasted one or two matches, and after that final flirtation with the abyss he consistently strengthened his position in the side. He was excellent in India in 2017, setting up what should have been a 2-0 lead but let down by his batters, and even better in Bangladesh in a hard-fought 1-1 series. Now fully equipped to bowl in Asia, you could sense the gradually growing belief that he wasn’t one bad day away from being dumped from the side.With all that insecurity, Lyon has assembled a line of defences as a public figure. Aside from a disastrous few months of attempting trash talk leading up to the sandpaper debacle, he has remained tucked in behind them. With longevity that means he has fronted more press conferences than most, you soon pick up on the repeat lines.“I can’t bat,” is his preface for any conversation about either team’s work with the blade, disingenuously for a guy who has reached or cleared the boundary 190 times in Tests. “To be brutally honest,” he says ahead of any uncontroversial observation, as if to disclaim responsibility should someone disagree. He gives a good workout to lines about not playing for milestones, and expresses embarrassment at being statistically associated with past greats. This week, looking at the significance of the 500, he allowed himself the indulgence of saying: “It’s something that I’m very proud about.” Continue reading...","content":"Looking back, the start of Nathan Lyon’s Test career can seem impossibly long ago. Taking the ball in Sri Lanka in 2011 is a baby version, head ringed in duck down, face thin and anxious. There are glimpses of his future - start with turn away from the left-hander to get Kumar Sangakkara at slip, end with a diving return catch for a fifth. But there is the confusion of his present, a player unsure how to celebrate when each wicket falls, waving his limbs and jumping sporadically like a foal tangled in a fence. Coming from outside the usual route, playing club cricket into his 20s instead of state age-group in his teens, Lyon for years was unconvinced he belonged. His physical presence has always reflected his jangling nerves: all angles and elbows, an unstuffed puppet with somebody overzealously yanking the strings. The appearance changed, that fuzzy head giving way to the sleek chrome dome that - until that fateful calf tear in London last June - fitted his mechanical reliability. But even before his comeback in Perth last week, on the way to Test wicket 500 and a win against Pakistan, his teammates said he was nervous again. Nathan Lyon claims 500th Test wicket as Australia cruise to victory over Pakistan Read more Back in the early years, he had good reason. For years selectors didn’t fully believe in him, often retaining him because of the lack of alternatives. He was left out for four quicks in Perth in 2012, for Xavier Doherty in Hyderabad in 2013, returned for nine wickets in Delhi, then got dropped for the teenage Ashton Agar for that year’s Ashes. As recently as December 2016 he would have been swept out with the new broom after South Africa thrashed Australia in Hobart; five changes for Adelaide would have been six had the replacement spinner Steve O’Keefe not torn a muscle that week. Still, each of those exclusions only lasted one or two matches, and after that final flirtation with the abyss he consistently strengthened his position in the side. He was excellent in India in 2017, setting up what should have been a 2-0 lead but let down by his batters, and even better in Bangladesh in a hard-fought 1-1 series. Now fully equipped to bowl in Asia, you could sense the gradually growing belief that he wasn’t one bad day away from being dumped from the side. With all that insecurity, Lyon has assembled a line of defences as a public figure. Aside from a disastrous few months of attempting trash talk leading up to the sandpaper debacle, he has remained tucked in behind them. With longevity that means he has fronted more press conferences than most, you soon pick up on the repeat lines. “I can’t bat,” is his preface for any conversation about either team’s work with the blade, disingenuously for a guy who has reached or cleared the boundary 190 times in Tests. “To be brutally honest,” he says ahead of any uncontroversial observation, as if to disclaim responsibility should someone disagree. He gives a good workout to lines about not playing for milestones, and expresses embarrassment at being statistically associated with past greats. This week, looking at the significance of the 500, he allowed himself the indulgence of saying: “It’s something that I’m very proud about.” Nathan Lyon bowls on day three of the first Test against Pakistan at Perth Stadium. Photograph: James Worsfold/CA/Cricket Australia/Getty Images Some observers mark spinners by their ability to bowl out teams in the fourth innings. Lyon had an albatross hung around his neck early, largely by Matthew Wade’s wicketkeeping, when South Africa got through 50 of his overs to draw in Adelaide in 2012. The prominent shortfalls include England at Headingley in 2019, India’s double miracle at Sydney and Brisbane in 2021, and the Sydney efforts of England in 2022 and India in 2015. On the counter, Lyon has dominated other tough games bowling last. That 2019 Ashes finished 2-2 thanks to his six wickets setting up the initial lead at Edgbaston. He took seven in the Adelaide epic against India in 2014, and five in the series clincher in Lahore in 2022 when Australia returned to Pakistan. He has taken wickets in 29 Australian wins that were sealed bowling last. But with Lyon there is something else: the reliability he offers in the first half of matches, especially in Australia where spinners are not expected to contribute. Especially orthodox finger spinners. Across the first and second innings of Tests in Australia, many of the game’s great visiting bowlers have paid for their wickets with bowling averages in the 50s, or 70s, or 90s. Lyon has 119 such wickets at 35, going at 2.8 runs per over, while also contributing in the field. Having him to set and forget at one end is the key to Australia’s fast-bowling success, the metronome that the others are able to play around. Doing that job fits with the humility that he has shown through his career. Perhaps the humility is excessive, a legacy of that initial insecurity. But it might also lend itself to longevity. You get the feeling that Lyon still can’t believe that he gets to play for Australia. Doing so has defined his life. So why call time any earlier than his body demands? He has 501 wickets now. Glenn McGrath’s 563 is close. Shane Warne’s 708 is distant but not impossible. He would probably never admit it was a goal, but Nathan Lyon is the kind of character who could just keep quietly grinding towards it.","pubDate":"2023-12-18 04:24:19","image_url":"https://i.guim.co.uk/img/media/efca5001866cf9fc19480232db71e142a668596e/0_211_6328_3800/master/6328.jpg?width=140&quality=85&auto=format&fit=max&s=5838aad58eaa57853768e8f03953608e","source_id":"theguardian","source_priority":106,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"508d8908549419033d486a4a319ce202","title":"Healy 'on track' to lead Australia in Test in India","link":"https://thewest.com.au/sport/cricket/healy-on-track-to-lead-australia-in-test-in-india-c-12943402","keywords":null,"creator":["Oliver Caffrey"],"video_url":null,"description":"Australia captain Alyssa Healy is firming to take part in the historic Test in India but management are reluctant to lock her into the XI just yet.","content":"Captain Alyssa Healy is tracking well to play in Australia's women's Test against India but management are yet confirm her as a certain starter. The star wicketkeeper-batter missed the entire WBBL after badly hurting her finger while trying to break up a fight between her two dogs. But Healy, who was earlier this month appointed the retired Meg Lanning's replacement as Australia captain, is yet to be locked in to play in the historic red-ball match at Mumbai's Wankhede Stadium, starting on Thursday. Australia coach Shelley Nitschke insisted \"everything's on track\" but failed to lock in Healy's spot in the XI. \"She didn't keep in the 50-over game, but that's just part of her progression back to playing,\" Nitschke said on Monday \"Everything's looking really positive for 'Midge' (Healy) and everything's on track, as we expected, so fingers crossed for her it continues to go that way. \"All things being equal, we'll see her out there, unless there's some significant change.\" Australia are expecting to encounter a spin-friendly pitch after India obliterated England by a record 347-margin in their Test last week. Spinner Deepti Sharma starred with bat and ball, bagging nine wickets to bamboozle England's batters. \"It was interesting to watch,\" Nitschke said. \"The conditions out there at DY (Stadium) certainly made it quite challenging. \"I think it's just about reading the conditions at Wankede Stadium, but we also know that things could get quite challenging, but just making sure that we're well prepared for that.\" Australia last played a Test in June when Ashleigh Gardner spun them to a famous Ashes win against England in Nottingham. Australia's women last played a Test in India back in 1984. \"It's a tough one to prepare for,\" Nitschke said. \"The girls are coming off the back of the WBBL and it looks like we're going to get some really traditional subcontinent conditions, but it's also really exciting. \"I think everyone's just embracing the challenge.\" The eagerly-anticipated tour will end with three ODIs and three T20s.","pubDate":"2023-12-18 04:23:54","image_url":"https://images.thewest.com.au/publication/C-12943402/ac3da4160c7cf434879a82f6a11a73721e561767-16x9-x0y0w1280h720.jpg","source_id":"thewest","source_priority":106740,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"078230c44e2ca54909172f9d87c4c2f5","title":"Healy 'on track' to lead Australia in Test in India","link":"https://www.perthnow.com.au/sport/cricket/healy-on-track-to-lead-australia-in-test-in-india-c-12943399","keywords":null,"creator":["Oliver Caffrey"],"video_url":null,"description":"Australia captain Alyssa Healy is firming to take part in the historic Test in India but management are reluctant to lock her into the XI just yet.","content":"Captain Alyssa Healy is tracking well to play in Australia's women's Test against India but management are yet confirm her as a certain starter. The star wicketkeeper-batter missed the entire WBBL after badly hurting her finger while trying to break up a fight between her two dogs. But Healy, who was earlier this month appointed the retired Meg Lanning's replacement as Australia captain, is yet to be locked in to play in the historic red-ball match at Mumbai's Wankhede Stadium, starting on Thursday. Australia coach Shelley Nitschke insisted \"everything's on track\" but failed to lock in Healy's spot in the XI. \"She didn't keep in the 50-over game, but that's just part of her progression back to playing,\" Nitschke said on Monday \"Everything's looking really positive for 'Midge' (Healy) and everything's on track, as we expected, so fingers crossed for her it continues to go that way. \"All things being equal, we'll see her out there, unless there's some significant change.\" Australia are expecting to encounter a spin-friendly pitch after India obliterated England by a record 347-margin in their Test last week. Spinner Deepti Sharma starred with bat and ball, bagging nine wickets to bamboozle England's batters. \"It was interesting to watch,\" Nitschke said. \"The conditions out there at DY (Stadium) certainly made it quite challenging. \"I think it's just about reading the conditions at Wankede Stadium, but we also know that things could get quite challenging, but just making sure that we're well prepared for that.\" Australia last played a Test in June when Ashleigh Gardner spun them to a famous Ashes win against England in Nottingham. Australia's women last played a Test in India back in 1984. \"It's a tough one to prepare for,\" Nitschke said. \"The girls are coming off the back of the WBBL and it looks like we're going to get some really traditional subcontinent conditions, but it's also really exciting. \"I think everyone's just embracing the challenge.\" The eagerly-anticipated tour will end with three ODIs and three T20s.","pubDate":"2023-12-18 04:23:53","image_url":"https://images.perthnow.com.au/publication/C-12943399/ac3da4160c7cf434879a82f6a11a73721e561767-16x9-x0y0w1280h720.jpg","source_id":"perthnow","source_priority":49457,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"055cc4798d6ba7f6cf9cd73b88a9c9b8","title":"Cricket-Australia's Labuschagne relieved after being cleared for second test","link":"https://www.thestar.com.my/sport/cricket/2023/12/18/cricket-australia039s-labuschagne-relieved-after-being-cleared-for-second-test","keywords":null,"creator":null,"video_url":null,"description":"MELBOURNE (Reuters) - With Cameron Green eager to break back into Australia's starting XI, Marnus Labuschagne felt a rush of relief when he was cleared to play in the 'Boxing Day' test against Pakistan after taking a nasty blow to his pinky finger in the hosts' series-opening win. Read full story","content":"MELBOURNE (Reuters) - With Cameron Green eager to break back into Australia's starting XI, Marnus Labuschagne felt a rush of relief when he was cleared to play in the 'Boxing Day' test against Pakistan after taking a nasty blow to his pinky finger in the hosts' series-opening win. Labuschagne needed medical attention after being struck on the right hand by debutant Khurram Shahzad early in the second innings in Perth before top-edging the Pakistan quick to be out for two. All-rounder Green, who lost his place in the squad to Mitchell Marsh, texted best wishes before Labuschagne went in for a scan. Labuschagne joked that he told Green not to get his hopes up. \"He just said, 'I hope it all goes well, good luck,'\" Labuschagne told reporters. \"I just said, 'It’s not going to make a difference, mate'. \"It’s going to have take something pretty serious to have me miss a game.\" Labuschagne was one of several batters sporting bruises in the wake of Australia's 360-run win on day four after the Perth Stadium pitch deteriorated rapidly. Marsh, Steve Smith and Usman Khawaja all suffered body blows, while Pakistan were skittled for 89 in their second innings. Pundits questioned whether the cracked wicket was too lively for a fair contest but Labuschagne stopped short of calling it unsafe. \"No one likes batting when it's like that, up-and-down. The sharp, steep bounce on a fast wicket. It's not a cup of tea for anyone,\" he said. \"But you just have to find a way when it's like that.\" All Australia's players have been cleared for the Dec. 26 test at the Melbourne Cricket Ground. The hosts are unlikely to make changes given the light workloads of captain Pat Cummins and fellow quicks Mitchell Starc and Josh Hazlewood with the trio having seven victims between them on day four. Spinner Nathan Lyon was also able to sneak in a couple of wickets, including his 500th test victim when he trapped Faheem Ashraf lbw. Lyon was hailed by Australian media on Monday for becoming the nation's third bowler to reach the milestone, joining legspinner Shane Warne and fast bowler Glenn McGrath. However, the 500th came only after plenty of debate in the middle with Cummins getting the referral in to the DRS right before the timer ran out. A sheepish Labuschagne, who has long fielded at short leg when Lyon bowls, said he had spoken against taking a review. \"I think I actually said it was high,\" he said. \"So I got that wrong.\" (Reporting by Ian Ransom in Melbourne; Editing by Peter Rutherford)","pubDate":"2023-12-18 04:16:00","image_url":"https://apicms.thestar.com.my/uploads/images/2023/12/18/2445082.jpg","source_id":"thestar_my","source_priority":37088,"country":["malaysia"],"category":["sports"],"language":"english"},{"article_id":"85c997d298c24a124a2a17d6a439afcd","title":"Perth wicket wasn't a danger, says battered Labuschagne","link":"https://thewest.com.au/sport/cricket/perth-wicket-wasnt-a-danger-says-battered-labuschagne-c-12943260","keywords":null,"creator":["Justin Chadwick"],"video_url":null,"description":"Marnus Labuschagne says his finger is feeling considerably better and he's in no doubt to face Pakistan in the Boxing Day Test at the MCG.","content":"Marnus Labuschagne says it would have taken more than a damaged finger to rule him out of the Boxing Day Test, and he doesn't hold any grudges against the cracking Optus Stadium wicket. Labuschagne was sent off for scans on his right little finger on Saturday night after being struck by debutant Pakistan paceman Khurram Shahzad. The cracking wicket created all sorts of problems for batters on days three and four. Steve Smith was struck twice, Usman Khawaja sustained a painful blow just below his right elbow, and Mitch Marsh was twice hit on the helmet. Pakistan were rolled for just 89 in the second innings as the ball wildly jagged and bounced, handing Australia a whopping 360-run win and a 1-0 lead in the series heading into Melbourne. Labuschagne was cleared of any fracture, guaranteeing he will be fit for the Boxing Day Test. It also means allrounder Cameron Green is unlikely to find a way back into the XI just yet. Labuschagne hinted that even if his scans had come back worse than they did, he would have played the Boxing Day test anyway. \"It was funny, Greeny messaged me on the way to getting a scan and he just said, 'I hope it all goes well, good luck',\" Labuschagne said. \"And I said, 'It's not going to make a difference'. It's going have to take something pretty serious I reckon to have me miss a game.\" Labuschagne proved to himself that he was all good to go by returning to the nets on Sunday to face firebrand Lance Morris. \"The finger's fine. There's no break,\" Labuschagne said. \"It hit me more on the knuckle side and sort of just jammed up my hand. \"I was a bit nervous out there because ... I've had a lot of finger blows but it felt a bit different. \"It just got me in a bit of an awkward spot. There was no padding on that side of the glove. \"But I've got some really good range in it, so it's all good.\" Barring late injuries, Australia will field an unchanged XI in Melbourne as they attempt to extend their home winning streak against Pakistan to 16 Tests. The unpredictability of the Optus Stadium pitch on days three and four created havoc for batters, but Labuschagne didn't think it was a dangerous surface. \"It was a bit of a brutal end there with the wicket's cracks opening up,\" Labuschagne said. \"I mean, no one likes batting when it's like that - up and down, the sharp, steep bounce on a fast wicket. \"That's not your cup of tea for anyone, but you just have to find a way when it's like that. \"Potentially if that's a day one wicket, there might be a few more questions asked. \"But I think that's sort of what you what you get coming here (to Perth). \"So no, I don't think it was was reaching that (dangerous) stage, but certainly it was just one of those tough games that you get here.\" Labuschagne is hungry for runs after posting just 16 and two in the series opener.","pubDate":"2023-12-18 04:15:49","image_url":"https://images.thewest.com.au/publication/C-12943260/2dec1b8199610e9e55a91f321a85e37a2a549013-16x9-x0y0w1280h720.jpg","source_id":"thewest","source_priority":106740,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"406b5ec760b7c4efadcdba9bc73de083","title":"Perth wicket wasn't a danger, says battered Labuschagne","link":"https://www.perthnow.com.au/sport/cricket/perth-wicket-wasnt-a-danger-says-battered-labuschagne-c-12943256","keywords":null,"creator":["Justin Chadwick"],"video_url":null,"description":"Marnus Labuschagne says his finger is feeling considerably better and he's in no doubt to face Pakistan in the Boxing Day Test at the MCG.","content":"Marnus Labuschagne says it would have taken more than a damaged finger to rule him out of the Boxing Day Test, and he doesn't hold any grudges against the cracking Optus Stadium wicket. Labuschagne was sent off for scans on his right little finger on Saturday night after being struck by debutant Pakistan paceman Khurram Shahzad. The cracking wicket created all sorts of problems for batters on days three and four. Steve Smith was struck twice, Usman Khawaja sustained a painful blow just below his right elbow, and Mitch Marsh was twice hit on the helmet. Pakistan were rolled for just 89 in the second innings as the ball wildly jagged and bounced, handing Australia a whopping 360-run win and a 1-0 lead in the series heading into Melbourne. Labuschagne was cleared of any fracture, guaranteeing he will be fit for the Boxing Day Test. It also means allrounder Cameron Green is unlikely to find a way back into the XI just yet. Labuschagne hinted that even if his scans had come back worse than they did, he would have played the Boxing Day test anyway. \"It was funny, Greeny messaged me on the way to getting a scan and he just said, 'I hope it all goes well, good luck',\" Labuschagne said. \"And I said, 'It's not going to make a difference'. It's going have to take something pretty serious I reckon to have me miss a game.\" Labuschagne proved to himself that he was all good to go by returning to the nets on Sunday to face firebrand Lance Morris. \"The finger's fine. There's no break,\" Labuschagne said. \"It hit me more on the knuckle side and sort of just jammed up my hand. \"I was a bit nervous out there because ... I've had a lot of finger blows but it felt a bit different. \"It just got me in a bit of an awkward spot. There was no padding on that side of the glove. \"But I've got some really good range in it, so it's all good.\" Barring late injuries, Australia will field an unchanged XI in Melbourne as they attempt to extend their home winning streak against Pakistan to 16 Tests. The unpredictability of the Optus Stadium pitch on days three and four created havoc for batters, but Labuschagne didn't think it was a dangerous surface. \"It was a bit of a brutal end there with the wicket's cracks opening up,\" Labuschagne said. \"I mean, no one likes batting when it's like that - up and down, the sharp, steep bounce on a fast wicket. \"That's not your cup of tea for anyone, but you just have to find a way when it's like that. \"Potentially if that's a day one wicket, there might be a few more questions asked. \"But I think that's sort of what you what you get coming here (to Perth). \"So no, I don't think it was was reaching that (dangerous) stage, but certainly it was just one of those tough games that you get here.\" Labuschagne is hungry for runs after posting just 16 and two in the series opener.","pubDate":"2023-12-18 04:15:48","image_url":"https://images.perthnow.com.au/publication/C-12943256/2dec1b8199610e9e55a91f321a85e37a2a549013-16x9-x0y0w1280h720.jpg","source_id":"perthnow","source_priority":49457,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"8d24b593f24a7be3f2347859d8c1d9f0","title":"New Zealand’s Jamieson rested from Bangladesh ODIs","link":"https://sportstar.thehindu.com/cricket/new-zealand-vs-bangladesh-kyle-jamieson-rested-hamstring-injury-odi-series/article67649585.ece","keywords":["Cricket"],"creator":null,"video_url":null,"description":"The towering quick bowled only four overs in the second test win against Bangladesh in Mirpur this month and missed Sunday’s 44-run victory in the opening ODI in Dunedin.","content":"New Zealand paceman Kyle Jamieson will be rested from the current ODI series against Bangladesh after experiencing a stiff hamstring on his return home from the test tour, New Zealand Cricket said on Monday. The towering quick bowled only four overs in the second test win against Bangladesh in Mirpur this month and missed Sunday’s 44-run victory in the opening ODI in Dunedin. He will miss the final matches of the series in Nelson on Wednesday and Napier on Saturday but should be available for the T20 series starting on Dec. 27 in Napier. Wellington Firebird fast bowler Ben Sears will remain with the squad after being called up as injury cover for Jamieson. The 25-year-old Sears, whose last taste of international cricket was a T20 match away to the Netherlands more than a year ago, will hope to make his ODI debut. New Zealand head coach Gary Stead said the selectors did not want to take any unnecessary risks with Jamieson, who has been blighted by back injuries for much of the past two seasons. “As we flagged when naming the ODI squad we see the series as a chance to provide opportunities to some new players, and Ben fits that category,” he added. Top order batsman Finn Allen will miss the Nelson ODI to play a domestic T20 match for Auckland but will rejoin the squad for the final ODI. Comments Related Topics","pubDate":"2023-12-18 04:10:45","image_url":"https://ss-i.thgim.com/public/incoming/sq9coi/article67649584.ece/alternates/LANDSCAPE_1200/2023-12-17T235547Z_1441493040_RC2N73ARDRSC_RTRMADP_3_CRICKET-ODI-NZL-BGD.JPG","source_id":"sportstar","source_priority":2972,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"6178446d823e710904cc86cf98f194fd","title":"\"कप्तानी की शर्त पर हार्दिक पांड्या ने...\" रोहित शर्मा को कप्तानी से हटाने जाने के बाद पूर्व भारतीय क्रिकेटर का माथा ठनका","link":"https://sports.ndtv.com/hindi/cricket/aakash-chopra-on-hardik-pandya-vs-rohit-sharma-mumba-indians-ipl-2024-auction-4694662#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"IPL 2024 Mumbai Indians, ऐसे में जब यह फैसला आया तो फैन्स हैरान रह गए हैं. फैन्स सोशल मीडिया पर मुंबई इंडियंस के खिलाफ रिएक्ट कर रहे हैं. ऐसे में अब भारत के पूर्व खिलाड़ी और कमेंटेटर आकाश चोपड़ा (Aakash Chopra on Mumbai Indians) ने इस बारे में बात की और अपनी राय रखी है.","content":"Aakash Chopra reaction On Hardik Pandya: हार्दिक को मुंबई का कप्तान बनाए जाने पर पूर्व क्रिकेटर ने किया रिएक्ट रोहित शर्मा के लिए 2024 का IPL मुंबई इंडियन्स (Mumbai Indians) की जर्सी में एक खिलाड़ी के रूप में का आखिरी सत्र हो सकता है, क्योंकि इस फ्रेंचाइजी ने हार्दिक पंड्या (Hardik Pandya) को अपना नया कप्तान घोषित किया रोहित की कप्तानी में टीम इस लीग की सबसे सफल फ्रेंचाइजी बनकर उभरी है. रोहित ने 11 सत्र में टीम की कप्तानी की जिसमें से मुंबई इंडियन्स पांच बार खिताब जीतने में सफल रहा. ऐसे में जब यह फैसला आया तो फैन्स हैरान रह गए हैं. फैन्स सोशल मीडिया पर मुंबई इंडियंस के खिलाफ रिएक्ट कर रहे हैं. ऐसे में अब भारत के पूर्व खिलाड़ी और कमेंटेटर आकाश चोपड़ा (Aakash Chopra on Mumbai Indians) ने इस बारे में बात की और अपनी राय रखी है. अपने पर बात करते हुए आकाश ने कहा कि, \"हार्दिक पंड्या के बारे में बात करने से पहले रोहित के बारे में बात करना चाहूंगा. हार्दिक के कप्तान बनने से ज्यादा रोहित के टीम से अलग होने के चर्चे हो रहे हैं. बेहतरीन कप्तान, आईपीएल के सबसे सफलतम कप्तान. देखिए रोहित एक ऐसे कप्तान रहे हैं जो टीम के खिलाड़ियों को साथ लेकर चलते हैं. जिस किसी ने भी रोहित की कप्तानी में क्रिकेट खेला है, वह यह कहते रहते हैं कि रोहित कप्तान बड़ा अच्छे हैं और इनकी कप्तानी में ही खेलना है. लेकिन अचानक ऐसा क्या हुआ कि हार्दिक को कप्तान बना दिया गया\". आकाश चोपड़ा ने इसके अलावा हार्दिक की मुंबई टीम में एंट्री को लेकर बात की और कहा कि, \"यह कोई अदंर की बात नहीं लगती है. मुझे लगता है कि हार्दिक ने गुजरात को इसी डील पर छोड़ा होगा कि उन्हें कप्तान के तौर पर टीम में जाना है. फैसला रोहित शर्मा को बताया भी गया होगा. फ्यूचर प्लान कहकर रोहित को जानकारी दी गई होगी. मुझे यह भी लगता है कि आशीष नेहरा गुजरात टाइटंस में हार्दिक के साथ थे जिन्होंने उन्हें अच्छा कप्तान बनाया. मुंबई को भी हार्दिक को असरदार बनाने के लिए समय-समय पर इनपुट लेने होंगे. क्योंकि मुझे अभी भी ऐसा नहीं लगता कि हार्दिक पांड्या बतौर कप्तान Finished Product बन पाए हैं.\" पूर्व भारतीय क्रिकेटर ने यह भी कहा कि, \"मुबई इंडियंस ने जो भी फैसला किया है वह रोहित से विचार करने के बाद ही लिया गया है. ऐसा नहीं हो सकता है कि उनसे फ्रेंचाइजी ने बात नहीं की होगी. देखिए जब रोहित को हैदराबाद से लेकर आए थे तो भी फ्यूचर को देखते हुए ही रणनीति बनाई गई थी. अब ऐसा ही हार्दिक को टीम में लाकर मुंबई ने किया है. इसमें कोई गलत बात नहीं है.\" पढ़ें ,राजनीति,खेल समाचार, और की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-12-18 04:08:53","image_url":"https://c.ndtvimg.com/2023-12/k0eqegd8_rohit-hardik-bcci_625x300_18_December_23.jpg","source_id":"ndtv_in","source_priority":129751,"country":["india"],"category":["sports"],"language":"hindi"}]}