{"newsArray":[{"title":"Sydney Test day two LIVE updates: Khawaja closes in on 100 as Australia cashes in","link":"https://www.smh.com.au/sport/cricket/sydney-test-day-two-live-updates-khawaja-smith-to-resume-at-scg-20230105-p5cagx.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Dan Walsh"],"video_url":null,"description":"All eyes are on the skies at the Sydney Cricket Ground as Usman Khawaja and Steve Smith head to the crease after a rain-affected opening day of the third Test.","content":null,"pubDate":"2023-01-04 22:12:15","image_url":null,"source_id":"smh","country":["australia"],"category":["sports"],"language":"english"},{"title":"PAK vs NZ: धोनी, मैकुलम वाली लिस्ट में शामिल हुए सरफराज अहमद, लगातार तीसरे अर्धशतक के साथ बनाए कई रिकॉर्ड","link":"https://sports.ndtv.com/hindi/cricket/sarfaraz-ahmed-continues-to-impress-with-return-to-pakistan-breaks-records-with-third-consecutive-half-century-3664051#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"Pakistan vs New Zealand: 35 वर्षीय सरफराज अहमद (Sarfaraz Ahmed) ने बुधवार को 109 गेंदों पर 10 चौकों की मदद से 78 रन बनाए और तीसरे दिन टी ब्रेक से ठीक पहले आउट हो गए. सरफराज ने हाल ही में करीब चार साल के अंतराल के बाद टेस्ट क्रिकेट में वापसी की है.","content":"Sarfaraz Ahmed and Babar Azam अनुभवी सरफराज अहमद (Sarfaraz Ahmed) बुधवार (4 जनवरी) को अंतरराष्ट्रीय क्रिकेट में 6000 रन बनाने वाले दूसरे पाकिस्तानी विकेटकीपर बन गए. 35 वर्षीय ने कराची के नेशनल स्टेडियम में न्यूजीलैंड के खिलाफ दूसरे टेस्ट (Pakistan vs New Zealand) के तीसरे दिन ये उपलब्धि हासिल की. सरफराज ने 229 मैचों में 34.32 की औसत से 6007 रन बनाए हैं, जिसमें पांच शतक और 35 अर्धशतक शामिल हैं. कामरान अकमल अंतरराष्ट्रीय क्रिकेट में सबसे ज्यादा रन बनाने वाले पाकिस्तानी विकेटकीपर हैं. अकमल ने आखिरी बार 2014 में एक कीपर के रूप में पाकिस्तान के लिए खेला था. उन्होंने 260 मैचों में 26.87 की औसत से 6692 रन बनाए हैं, जिसमें 11 शतक और 27 अर्धशतक शामिल हैं. सरफराज 6 हजार से ज्यादा रन बनाने वाले 14वें विकेटकीपर बल्लेबाज हैं. इस लिस्ट में भारत के एमएस धोनी और न्यूजीलैंड के बैंडन मैकुलम जैसे खिलाड़ी शुमार हैं. 35 वर्षीय सरफराज (Sarfaraz Ahmed Stats) ने बुधवार को 109 गेंदों पर 10 चौकों की मदद से 78 रन बनाए और तीसरे दिन टी ब्रेक से ठीक पहले आउट हो गए. उन्होंने सऊद शकील के साथ पांचवें विकेट के लिए 150 रन की साझेदारी की. इसी पारी में शकील ने अपना पहला टेस्ट शतक बनाने में सफल रहे. 𝐓𝐡𝐢𝐫𝐝 𝐬𝐮𝐜𝐜𝐞𝐬𝐬𝐢𝐯𝐞 𝐟𝐢𝐟𝐭𝐲 continues his brilliant run since his return to the side 👏 | सरफराज ने पहले टेस्ट (PAK vs NZ) में दो अर्धशतक भी जड़े थे, लेकिन उन्हें शतकों में नहीं बदल सके. बाबर आजम (Babar Azam) के रन आउट होने के बाद सरफराज बल्लेबाजी के लिए आए. आजम ने 41 गेंदों पर तीन चौकों और एक छक्के की मदद से 24 रन बनाए. हालांकि सरफराज किसी भी मैच में शतक नहीं बना पाने से थोड़ा निराश होंगे. सरफराज ने हाल ही में करीब चार साल के अंतराल के बाद (Sarfaraz Ahmed Return) टेस्ट क्रिकेट में वापसी की है. उन्होंने मोहम्मद रिजवान का स्थान लिया. रिजवान ने इंग्लैंड के खिलाफ सीरीज काफी निराशाजनक रहे थे. पाकिस्तान वो 0-3 से हार गया था. सरफराज ने कायद-ए-आजम ट्रॉफी के पिछले सीजन में भी सिंध के लिए अच्छा खेला था. सरफराज टेस्ट में सबसे अधिक रन बनाने वाले पाकिस्तानी विकेटकीपर हैं. उन्होंने 51 मैचों में तीन शतक और 21 अर्धशतक के साथ 2874 रन बनाए हैं. * * पढ़ें देश और दुनिया की ताजा ख़बरें अब हिंदी में ( ) | शिक्षा समाचार ( ), शहर ( ), और राजनीति के समाचार at NDTV.in लाइव खबर देखें: फॉलो करे:","pubDate":"2023-01-04 18:20:33","image_url":"https://c.ndtvimg.com/2022-12/1fvac93_babar-sarfaraz-afp_625x300_26_December_22.jpg?im=FaceCrop,algorithm=dnn,width=806,height=605","source_id":"ndtv_in","country":["india"],"category":["sports"],"language":"hindi"},{"title":"VIDEO: सरफराज अहमद की स्टंपिंग से खड़ा हुआ बड़ा विवाद, अंपायर के फैसले से नाखुश फैंस भड़के","link":"https://sports.ndtv.com/hindi/cricket/sarfaraz-ahmed-s-controversial-stumping-out-makes-fans-unhappy-during-2nd-test-vs-new-zealand-3664317#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"Pakistan vs New Zealand: दूसरे टेस्ट के तीसरे दिन के टी ब्रेक से पहले सरफराज अहमद (Sarfaraz Ahmed) आखिरी ओवर में 78 रन पर स्टंप आउट हो गए. यह 100वें ओवर में हुआ, जब डेरिल मिचेल की गेंद पर अहमद को विकेटकीपर टॉम ब्लंडेल ने स्टंपिंग किया.","content":"PAK vs NZ 2nd Test: न्यूजीलैंड के खिलाफ दूसरे टेस्ट में पाकिस्तान की स्थिति नाजुक बनी हुई है. बाएं हाथ के बल्लेबाज सऊद शकील (Saud Shakeel) ने बुधवार को अपना पहला टेस्ट शतक जड़ टीम को मजबूती दिलाने का सफल प्रयास किया. पाकिस्तान ने 407-9 के स्कोर पर तीसरे दिन की समाप्ति की और अभी भी न्यूजीलैंड ने उन पर 42 रन की बढ़त बनाई हुई है.दिन का खेल खत्म होने तक शकील 124 रन पर नाबाद थे, जबकि अबरार अहमद 9 गेंद खेलकर स्कोर नहीं कर पाए हैं. न्यूजीलैंड ने आखिरी सेशन में 70 रन देकर चार विकेट लिए. शकील ने बुधवार को पूरे दिन बल्लेबाजी की और चौथे विकेट के लिए इमाम-उल-हक (83) के साथ 83 रन और सरफराज अहमद (Sarfaraz Ahmed) (78) के साथ पांचवें विकेट के लिए 150 रन जोड़े.हालांकि, सरफराज के साथ उनकी साझेदारी विवादास्पद नोट पर खत्म हुई. सरफराज टी ब्रेक से पहले आखिरी ओवर में 78 रन पर स्टंप आउट (Sarfaraz Ahmed Stumping) हो गए. यह 100वें ओवर में हुआ, जब डेरिल मिचेल की गेंद पर अहमद को विकेटकीपर टॉम ब्लंडेल ने स्टंपिंग किया. कई रिप्ले के बाद, तीसरे अंपायर अहसान रजा ने फैसला किया कि जब ब्लंडेल ने गिल्लियां हटाईं तो सरफराज के जूता मैदान पर नहीं था. उन्होंने सीरीज का लगातार तीसरा अर्धशतक बनाया.Out or not out❓#PAKvNZ | #TayyariKiwiHai pic.twitter.com/CrWUuFuTZD— Pakistan Cricket (@TheRealPCB) January 4, 2023हालांकि, फैंस को ऐसा नहीं लगा और उन्होंने अपना गुस्सा ट्विटर पर निकाला है.I need to know what weed third umpire was smoking. Spikes of shoes were clearly touching the ground when keeper took off the bails. Another dismal 3rd umpire decision. https://t.co/m0vCSZXMIa pic.twitter.com/GKXoTFEqko— Moonis Shoaib - #CR7? (@MoonisShoaib) January 4, 2023Not out according to the laws, but not according to Ahsan Raza ? pic.twitter.com/vrGG5UJzNS— Mojo Jojo ? (@ReecyJames_) January 4, 2023It's clearly not Out. Very bad decision by Umpire.— Usama Awan (@UsamaAw82435824) January 4, 2023मैच के बारे में बात करते हुए शकील ने कहा कि वह अपने घरेलू मैदान पर शतक बनाकर खुश हैं.उन्होंने कहा, \"मेरे साथ सरफराज का होना भी बहुत अच्छा था क्योंकि जब मैं नब्बे रन में था तब उन्होंने मुझे आत्मविश्वास दिया था.\"न्यूजीलैंड के विकेटकीपर टॉम ब्लंडेल का मानना ​​था कि विकेट अभी भी बल्लेबाजी के लिए अच्छी थी.उन्होंने कहा, \"हमें आखिरी विकेट (गुरुवार) लेना है और फिर, मुझे लगता है, फिर से आकलन करना होगा क्योंकि पाकिस्तान एक अच्छी बल्लेबाजी करने वाली टीम है, इसलिए शायद एक बड़े टोटल की जरूरत है.”* PAK vs NZ: सरफराज अहमद की ताबड़तोड़ वापसी, लगातार तीसरे अर्धशतक के साथ बनाए कई रिकॉर्ड* BCCI की मेडिकल टीम की निगरानी में होगी ऋषभ पंत की सर्जरी, लंबे समय के लिए क्रिकेट से हो जाएंगे दूर* जीत के फॉर्मूले के साथ गौतम गंभीर ने बताया, पिछले दो वनडे वर्ल्ड कप में भारत ने कहां हुई गलतीBCCI की रिव्यू मीटिंग में इंजरी मैनेजमेंट पर रहा फोकस, लिए गए बड़े फैसले","pubDate":"2023-01-04 15:50:59","image_url":"https://c.ndtvimg.com/2023-01/crkd42r_sarfaraz-ahmed-afp_625x300_04_January_23.jpg?im=FeatureCrop,algorithm=dnn,width=806,height=605","source_id":"ndtv_in","country":["india"],"category":["sports"],"language":"hindi"},{"title":"Cricket-NZ spinners strike after Saud hundred in Karachi","link":"https://www.thestar.com.my/sport/cricket/2023/01/04/cricket-nz-spinners-strike-after-saud-hundred-in-karachi","keywords":null,"creator":null,"video_url":null,"description":"KARACHI, Pakistan (Reuters) - Saud Shakeel registered his maiden test century but Pakistan's lower-order collapse left the second test against New Zealand evenly poised at Karachi's National Stadium on Wednesday. Read full story","content":null,"pubDate":"2023-01-04 13:21:00","image_url":"https://apicms.thestar.com.my/uploads/images/2023/01/04/1888254.jpg","source_id":"thestar_my","country":["malaysia"],"category":["sports"],"language":"english"},{"title":"News24.com | Waugh calls for 'common sense' in Test cricket: 'Not using lights for bad light doesn’t make sense'","link":"https://www.news24.com/sport/Cricket/Proteas/waugh-calls-for-common-sense-in-test-cricket-not-using-lights-for-bad-light-doesnt-make-sense-20230104","keywords":null,"creator":null,"video_url":null,"description":"Australian cricket legend and former captain Steve Waugh took to Instagram to berate Test cricket’s law-makers after day one of his nation’s third Test against South Africa in Sydney was called off early for bad light.","content":null,"pubDate":"2023-01-04 12:39:17","image_url":"https://scripts.24.co.za/img/sites/sport24.png","source_id":"news24","country":["south africa"],"category":["sports"],"language":"english"},{"title":"Crystal Palace vs Tottenham: Get Kane, Son and Zaha at 4/1 to have 1+ shot on target each with Sky Bet","link":"https://www.thescottishsun.co.uk/sport/9959901/sky-bet-odds-football-price-boost-free-bets-2/","keywords":["Sport","Football","Premier League","Sky Bet"],"creator":["James Anderson"],"video_url":null,"description":null,"content":"SKY BET have a special price boost for tonight’s clash between Crystal Palace and Tottenham. The bookies have DOUBLED their odds on Harry Kane, Son Heung-min and Wilfried Zaha each to have 1+ shot on target to 4/1 — that’s available to new and existing Sky Bet customers! Add this 4/1 special to your bet slip HERE Sky Bet offer: Get £30 in free bets when you stake £10GETTY SKY BET: GET £30 IN FREE BETS* Want more? Go on then… New Sky Bet customers who stake £10 on any sports market, including tonight’s Premier League action, will be rewarded with £30 in free bets! To access this offer, simply click HERE* and register a new account. Deposit and place a tenner on football, horse racing, tennis or cricket and you’ll have your account credited with 3 x £10 in free bets! You could use one of those £10 free bets on Harry Kane, Son Heung-min and Wilfried Zaha each to have 1+ shot on target tonight. Kane and Son have had 1+ shot on target in 12 of their 15 starts together in the Premier League this season, while Zaha scored when the teams last met at Selhurst Park. Kane has also had 2+ shots on target in SIX of his last NINE away top-flight games. Crystal Palace vs Tottenham Sky Bet Harry Kane, Son Heung-min and Wilfried Zaha each to have 1+ shot on target Was offered at 2/1Now available at 4/1 after Sky Bet boostClick HERE to claim this price boost SKY BET: GET £30 IN FREE BETS* FREE BETS AND SIGN UP DEALS – BEST NEW CUSTOMER OFFERS Most Read in Sport JUR KIDDING Celtic hero in Josip Juranovic and Ange Postecoglou 'bust up' claim SNUBBED Lee Johnson BLANKED Hibs players following Edinburgh derby loss as pressure mounts SPOT CHECK Celtic, Rangers and every Prem club's penalty record - before and AFTER VAR firm warning I wore a Celtic leotard to greet Rangers fans at Ibrox - things got heated NOT AGAIN Greg Taylor and physio targeted as 'metal object thrown' during Gers-Celtic clash BOTTLE YOB Celtic fan left bleeding after being 'hit with bottle' during clash with Rangers hibees woe Latest on Lee Johnson's Hibs future amid rumours he was SACKED after Hearts loss 'HAS THERE BEEN A HANDBALL?' Goldson Old Firm flashpoint assessed by ex-ref Stuart Dougal 'perfect time' Ex-Rangers star retires aged just 32 with emotional message about his dad TRANSFERS LIVE Fleck and defender tipped for Gers, Patterson to Hearts latest Remember to gamble responsibly A responsible gambler is someone who: Establishes time and monetary limits before playingOnly gambles with money they can afford to loseNever chase their lossesDoesn’t gamble if they’re upset, angry or depressedGamcare – www.gamcare.org.ukGamble Aware – www.begambleaware.org For help with a gambling problem, call the National Gambling Helpline on 0808 8020 133 or go to www.gamstop.co.uk to be excluded from all UK-regulated gambling websites. *New customers only, first single & e/w bet only, 5p minimum stake, 3 x £10 bet tokens. Free bet stakes not included in returns. Free bets exclude virtuals. Free bets are non withdrawable. No free bet expiry. Eligibility restrictions and further T&Cs apply. 18+ begambleaware.Org Most read in Sport JUR KIDDING Celtic hero in Josip Juranovic and Ange Postecoglou 'bust up' claim SNUBBED Lee Johnson BLANKED Hibs players following Edinburgh derby loss as pressure mounts SPOT CHECK Celtic, Rangers and every Prem club's penalty record - before and AFTER VAR firm warning I wore a Celtic leotard to greet Rangers fans at Ibrox - things got heated NOT AGAIN Greg Taylor and physio targeted as 'metal object thrown' during Gers-Celtic clash BOTTLE YOB Celtic fan left bleeding after being 'hit with bottle' during clash with Rangers","pubDate":"2023-01-04 12:30:00","image_url":null,"source_id":"thescottishsun","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"BSK vs FWU Dream11 Prediction: Fantasy Cricket Tips, Today's Playing 11 and Pitch Report for Nepal T20 League, Match 24","link":"https://www.sportskeeda.com/fantasy-cricket-mantra/bsk-vs-fwu-dream11-prediction-fantasy-cricket-tips-today-s-playing-11-pitch-report-nepal-t20-league-match-24?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Fantasy Cricket Mantra"],"creator":["Ishaan Mahajan"],"video_url":null,"description":null,"content":null,"pubDate":"2023-01-04 12:26:07","image_url":"https://static.sportskeeda.com/editor/2023/01/d617a-16728155655296-1920.jpg","source_id":"sportskeeda","country":["india"],"category":["sports"],"language":"english"},{"title":"DWR-W vs UNR-W Dream11 Prediction: Fantasy Cricket Tips, Today's Playing XIs and Pitch Report for Tripura Women's T20 2022, Match 26","link":"https://www.sportskeeda.com/fantasy-cricket-mantra/dwr-w-vs-unr-w-dream11-prediction-fantasy-cricket-tips-today-s-playing-xis-pitch-report-tripura-women-s-t20-2022-match-26?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Fantasy Cricket Mantra"],"creator":["Ishaan Mahajan"],"video_url":null,"description":null,"content":null,"pubDate":"2023-01-04 12:03:30","image_url":"https://static.sportskeeda.com/editor/2023/01/5b100-16728141832035-1920.jpg","source_id":"sportskeeda","country":["india"],"category":["sports"],"language":"english"},{"title":"Gary Ballance named in Zimbabwe T20 squad after switch of allegiance","link":"https://timesofindia.indiatimes.com/sports/cricket/news/gary-ballance-named-in-zimbabwe-t20-squad-after-switch-of-allegiance/articleshow/96738243.cms","keywords":null,"creator":null,"video_url":null,"description":"Former England batsman Gary Ballance is set to make his Zimbabwe debut later this month after he was named on Wednesday in the squad for this month's three-match Twenty20 series against Ireland. The 33-year-old left-handed batter last month signed a two-year contract to play domestic and international cricket in the country of his birth following his release from county cricket side Yorkshire.","content":null,"pubDate":"2023-01-04 11:28:49","image_url":null,"source_id":"toi","country":["india"],"category":["sports"],"language":"english"},{"title":"Cricket-Ballance named in Zimbabwe T20 squad after switch of allegiance","link":"https://www.thestar.com.my/sport/cricket/2023/01/04/cricket-ballance-named-in-zimbabwe-t20-squad-after-switch-of-allegiance","keywords":null,"creator":null,"video_url":null,"description":"(Reuters) - Former England batsman Gary Ballance is set to make his Zimbabwe debut later this month after he was named on Wednesday in the squad for this month's three-match Twenty20 series against Ireland. Read full story","content":null,"pubDate":"2023-01-04 11:03:00","image_url":"https://apicms.thestar.com.my/uploads/images/2023/01/04/1888075.jpg","source_id":"thestar_my","country":["malaysia"],"category":["sports"],"language":"english"},{"title":"A chat with Tyrone Kane as date change announced","link":"https://www.cricketireland.ie/news/article/a-chat-with-tyrone-kane-as-date-change-announced","keywords":null,"creator":null,"video_url":null,"description":"HARARE and DUBLIN – Cricket Ireland has agreed to a date change in the fixture schedule of the men’s tour to Zimbabwe, while recalled all-rounder Tyrone Kane is looking forward to his first senior tour.","content":null,"pubDate":"2023-01-04 10:50:26","image_url":null,"source_id":"cricketireland","country":["ireland"],"category":["sports"],"language":"english"},{"title":"David Warner reveals retirement pact to help avoid Aussie cricket disaster","link":"https://www.foxsports.com.au/cricket/australia/david-warner-reveals-retirement-pact-to-help-avoid-aussie-cricket-disaster/news-story/4a9cbe1d9613d9ee7d811a6d8ec55609","keywords":null,"creator":null,"video_url":null,"description":"David Warner has revealed he and opening partner Usman Khawaja have made a pact not to leave Australia in the lurch by retiring at the same time.","content":null,"pubDate":"2023-01-04 10:47:00","image_url":null,"source_id":"foxsports","country":["australia"],"category":["sports"],"language":"english"},{"title":"\"World Cup More Important\": Gambhir's Stern Message To India's IPL Stars","link":"https://sports.ndtv.com/cricket/world-cup-far-more-important-than-ipl-gautam-gambhirs-blunt-message-to-india-stars-3663041","keywords":null,"creator":null,"video_url":null,"description":"Gambhir said if need be Indian cricketers should avoid playing the IPL and need to prioritise 50-over cricket keeping the World Cup in mind.","content":null,"pubDate":"2023-01-04 10:33:35","image_url":null,"source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Nortje’s double strike leaves Australia at 147-2 on rain-hit day","link":"https://www.capitalfm.co.ke/sports/2023/01/04/nortjes-double-strike-leaves-australia-at-147-2-on-rain-hit-day/","keywords":["Cricket","Sports"],"creator":["AGENCE FRANCE PRESSE"],"video_url":null,"description":"SYDNEY, Australia, Jan 4 – South Africa strike bowler Anrich Nortje claimed the key wickets of David Warner and Marnus Labuschagne on Wednesday to prise Australia’s grip on the third Test in Sydney as rain plagued the opening day. Nortje was the Proteas’ star man as he removed Warner cheaply for 10 and late in […] The post Nortje’s double strike leaves Australia at 147-2 on rain-hit day appeared first on Capital Sports.","content":"SYDNEY, Australia, Jan 4 – South Africa strike bowler Anrich Nortje claimed the key wickets of David Warner and Marnus Labuschagne on Wednesday to prise Australia’s grip on the third Test in Sydney as rain plagued the opening day. Nortje was the Proteas’ star man as he removed Warner cheaply for 10 and late in the day denied Labuschagne (79) his 11th Test hundred. As bad light and rain conspired to prematurely end the first day, Australia were 147 for two with Usman Khawaja, who averages 98 in Sydney Tests, unbeaten on 54 and Steven Smith yet to score. Nortje got the big breakthrough with a ripper, taking the edge of Labuschagne’s bat to get him caught behind and end his 151-ball stay. “I was trying to hit good areas, not trying to be fancy, just trying to keep it simple and try to hit the wicket as hard as I could,” Nortje said of the crucial dismissal. “Luckily I got something out of it. It wasn’t really a big set-up, just more to try and stay consistent and luckily we got some nip and bounce there.” The pacer earlier struck in his second over of the day when he had Melbourne Test double-centurion Warner caught at slip by Marco Jansen for 10. No sooner had Smith arrived at the wicket after Labuschagne’s departure that the players left the field for bad light for the final time. “Definitely very frustrated. Obviously, it always makes you very angry as a batter when you get out and then everyone walks with you off the field,” Labuschagne said of his dismissal. “But at the end of the day he bowled a really good set there and that one obviously just kicked.” It is the sixth bedevilled Sydney Test out of the past seven to be affected by rain. ‘Thought it was out’ There was controversy earlier in Labuschagne’s innings when on 70 he edged Jansen to Simon Harmer at slip. The on-field umpires referred the decision with a soft signal of out, only for third umpire Richard Kettleborough to rule that the ball had touched the ground between the fingers of Harmer. Nortje said of the decision: “All of us thought it was out. Simon was convinced that it went straight in and from the angles, to us it looked as though he got his fingers underneath it… so unfortunately we didn’t get that one.” Khawaja also survived a review straight after lunch on 25 as he reverse-swept Harmer and was given out leg before wicket, but replays showed the ball touching the glove. The opening day was also marked by Matt Renshaw, recalled for his first Test for Australia since April 2018, returning a positive Covid-19 test after the toss was taken and the team composition confirmed. But team officials said he would continue to play in the match with his symptoms only described as mild. Renshaw was transferred to a separate dressing room from his teammates where he will prepare for the rest of the match, and spent most of play sitting away from the team runners near the Australian dug-out. Marnus Labuschagne (L) and Usman Khawaja both scored fifties to put Australia in a commanding position in the third Test against South Africa. PHOTO/AFP Skipper Pat Cummins won his fifth successive toss and decided to play an extra spinner with left-armer Ashton Agar, and Renshaw coming in to bolster the batting, squeezing out in-form paceman Scott Boland on a dry cracking Sydney Cricket Ground pitch. South Africa did likewise, with off-spinner Harmer ousting Lungi Ngidi while Heinrich Klaasen replaced Theunis de Bruyn at number three. The Australians have already wrapped up the three-match series after hammering the Proteas by an innings and 182 runs in Melbourne following a six-wicket rout in the opener in Brisbane inside two days. The post Nortje’s double strike leaves Australia at 147-2 on rain-hit day appeared first on Capital Sports.","pubDate":"2023-01-04 10:19:17","image_url":null,"source_id":"capitalfm","country":["kenya"],"category":["sports"],"language":"english"},{"title":"The Spin | Women’s cricket team of the year: from Alice Capsey to the Kerr sisters","link":"https://www.theguardian.com/sport/2023/jan/04/womens-cricket-team-of-the-year-from-alice-capsey-to-kerr-sisters","keywords":["Cricket","Sport","England women's cricket team","Australia women's cricket team","Australia sport"],"creator":["Raf Nicholson"],"video_url":null,"description":"After a year that included a World Cup and Commonwealth Games, here are our picks for the best women’s all-format XIIt’s been another big year for women’s cricket (is there ever a quiet one, these days?) It began with an Ashes series and a 50-over World Cup in New Zealand, but the highlight was surely a maiden appearance at the Commonwealth Games in Birmingham. Only two Tests were played, though, so this team is an all-format XI – with a slight bias towards Test performances. That perhaps reflects The Spin’s Christmas wish to see more multi-day cricket for women in 2023, please! Continue reading...","content":null,"pubDate":"2023-01-04 10:18:43","image_url":"https://i.guim.co.uk/img/media/897ed22e478f516bed50561fec769fb0c7fca4f4/0_0_5000_3000/master/5000.jpg?width=460&quality=85&auto=format&fit=max&s=af3cf4e980860e604181637a1121ac34","source_id":"theguardian","country":["united kingdom","india","singapore","canada"],"category":["sports"],"language":"english"},{"title":"Cricket-India&#039;s Pant to undergo ligament surgery in Mumbai following car crash","link":"https://www.thestar.com.my/sport/cricket/2023/01/04/cricket-india039s-pant-to-undergo-ligament-surgery-in-mumbai-following-car-crash","keywords":null,"creator":null,"video_url":null,"description":"NEW DELHI (Reuters) - India player Rishabh Pant is being flown to Mumbai where he will undergo surgeries having suffered multiple injuries in a car crash last week, the country's cricket board (BCCI) said on Wednesday. Read full story","content":null,"pubDate":"2023-01-04 10:16:00","image_url":"https://apicms.thestar.com.my/uploads/images/2023/01/04/1888014.jpg","source_id":"thestar_my","country":["malaysia"],"category":["sports"],"language":"english"},{"title":"Ticket sale for Formula E race in Hyderabad begins","link":"https://telanganatoday.com/ticket-sale-for-formula-e-race-in-hyderabad-begins","keywords":["Hyderabad","News","Other Sports","Sport","Formula E"],"creator":["Telangana Today"],"video_url":null,"description":"Around 22,500 tickets were put on sale by organisers and the fans can buy them online at Bookmyshow and on AceNetGen.","content":"Hyderabad: The ticket sale for India’s first-ever Formula E race, to be held at the Street Circuit in Hyderabad on February 11, began on Wednesday. Around 22,500 tickets were put on sale by organisers and the fans can buy them online at Bookmyshow and on AceNetGen. The denomination of the tickets was: Rs 1,000 for Grandstands, Rs 3,500 for Charged Grandstands, Rs 6,000 for Premium Grandstand and Rs 10,000 for Ace Grandstands. The seating capacity for the race is around 25,000 and 22,500 tickets were on sale. The sale of tickets will be only online. “With the experience of ticket sales of cricket that led to chaos at the Gymkhana recently, all the tickets for the Formula E event will be sold online alone. We are happy that the city of Hyderabad is hosting such a prestigious event. Our aim is to make Hyderabad among the top 25 cities in the world and the race will put the city of Hyderabad among the top league in the world,” said Arvind Kumar, the Special Chief Secretary, MA & UD, Government of Telangana. “The 2.8km track with 18 turns will see 11 teams with 22 drivers racing through the streets of Hyderabad. Arrangements are being made to make it a grand success. The Indian Racing League, that was held last month, gave us good inputs in terms of arranging entry, exit of fans, parking places and others. Three firms are doing the safety audit. The 18 turns make the race exciting,” he added. He further said that the traffic advisory on traffic restrictions will be given in advance to the people of Hyderabad. “We have a huge response for tickets already. We can’t give the tickets for free as it makes it tough for us to control the crowd. We will also arrange big screens for the viewers. The track will be blocked three days before the race. The first two days of the event will be open to school children and families for free. They can get a glimpse of the event,” Arvind added.","pubDate":"2023-01-04 09:05:54","image_url":null,"source_id":"telanganatoday","country":["india"],"category":["sports"],"language":"english"},{"title":"Rishabh Pant accident: Big UPDATE every cricket fan need to know","link":"https://www.dnaindia.com/cricket/report-rishabh-pant-health-update-cricketer-to-be-shifted-to-mumbai-for-further-treatment-3014928","keywords":["Sports","Cricket"],"creator":["DNA Web Team"],"video_url":null,"description":"Star Indian cricketer Rishabh Pant will be flown to Mumbai on Wednesday (January 4) for further treatment.","content":null,"pubDate":"2023-01-04 08:25:00","image_url":null,"source_id":"dnaindia","country":["india"],"category":["sports"],"language":"english"},{"title":"Shivam Mavi trends on Twitter as he claims four-fer on debut","link":"https://telanganatoday.com/shivam-mavi-trends-on-twitter-as-he-claims-four-fer-on-debut","keywords":["News","Sport","Pragyan Ojha","Shivam Mavi"],"creator":["Telangana Today"],"video_url":null,"description":"Shivam Mavi gave India a perfect start as he clean-bowled Pathum Nissanka to claim his maiden wicket in the very first over of his spell.","content":"Hyderabad: Indian fast bowler Shivam Mavi, who made his debut in yesterday’s T20I match, claimed a four-fer against Sri Lanka. His heroics helped India defend a modest total at the Wankhede Stadium. He took the 4 wickets and conceded only 22 runs in his quota of four overs. Earlier, it was only Pragyan Ojha and Barinder Sran, who claimed 4 wickets in a match playing for India. Batting first, India posted a modest total of 162 runs on the scoreboard. Thanks to Axar Patel and Deepak Hooda as the duo stitched a 68-run partnership for the 6th wicket when team India was struggling at 94/5. India desperately needed a good start, particularly with the kind of performances the team Sri Lanka has put up in recent months. Shivam Mavi gave India a perfect start as he clean-bowled Pathum Nissanka to claim his maiden wicket in the very first over of his spell. He then claimed the wicket of Dhananjaya De Silva in his second over. Mavi again struck twice in his second spell by taking the wickets of Hasaranga and Theekshana. Other fast bowlers like Harshal Patel and Umran Malik supported the 24-year-old by taking wickets at regular intervals to keep the Sri Lankan team under pressure. However, Chamika Karunaratne smashed a couple of sixes to take the match to the final over. With 13 needed off the last 6 balls, Karunaratne gave his Sri Lanka a chance by hitting a six in the final over, but Azar Patel managed to restrict the Lankan batsman from scoring the required runs. “Dream debut for Shivam Mavi the fabulous performance (sic),” wrote a user. “Superb Debut For #shivam Mavi,” tweeted another. Check out the other reactions: Shivam Mavi Family#INDvSL @ShivamMavi23 pic.twitter.com/SSoMZsDIJi — Cricket My (@fanofcricket143) January 4, 2023 pic.twitter.com/0cWnnKRtCc #shivammavi #CricketTwitter #INDvsSL — Rajat Gupta (@Rajatgupta199) January 3, 2023 Shivam Mavi said – \"I will call up my mother and family\". (Yesterday after his performance on debut match) — Mdasim_bage (@MdasimB) January 4, 2023 Whatta way to start his international career sensational performance by debutant on his debut t20i match 22-4 (4) #ShivamMavi #INDvSL pic.twitter.com/uJo0UYmk5E — Shivam Dubey (@ShivamDubey45) January 3, 2023 Virat Kohli's childhood coach said – \"It was wonderful to see Shivam Mavi and Umran Malik in this fashion. This shows that the future is bright for Indian cricket. Both are going to be a superstar in the future\". (To India news) — CricketMAN2 (@ImTanujSingh) January 4, 2023","pubDate":"2023-01-04 08:24:50","image_url":null,"source_id":"telanganatoday","country":["india"],"category":["sports"],"language":"english"},{"title":"Rishabh Pant being shifted to Mumbai for further treatment, confirms DDCA Director","link":"https://telanganatoday.com/rishabh-pant-being-shifted-to-mumbai-for-further-treatment-confirms-ddca-director","keywords":["Cricket","News","Sport","District Cricket Association (DDCA)","Shyam Sharma"],"creator":["IANS"],"video_url":null,"description":"On December 30, early in the morning, Pant suffered multiple injuries when his car collided with a road divider and caught fire on the Delhi-Dehradun highway.","content":"New Delhi: Injured India wicket-keeper batter Rishabh Pant is in the process of being shifted to Mumbai from Dehradun on Wednesday for further treatment, said Shyam Sharma, Delhi & District Cricket Association (DDCA) Director. On December 30, early in the morning, Pant suffered multiple injuries when his car collided with a road divider and caught fire on the Delhi-Dehradun highway. The horrific car accident happened between Manglaur and Narsan in the Haridwar district in the state of Uttarakhand. The 25-year old is currently admitted at Max Hospital in Dehradun after being initially taken to Saksham Hospital Multispecialty and Trauma Centre. He was on his way to his hometown Roorkee from New Delhi and was driving his Mercedes car. In the latest development, (DDCA) Director confirmed that Pant will now be taken to Mumbai for further treatment and recovery from the injuries. “He (Rishabh Pant) will be shifted to Mumbai today. To which hospital where he will be admitted, will be told later,” said Sharma to IANS. As per an official statement from the BCCI on Friday afternoon, Pant has two cuts on his forehead, a ligament tear in his right knee and has also hurt his right wrist, ankle, and toe and has suffered abrasion injuries on his back after the car accident. Later in the evening, a medical bulletin said the results of Pant’s MRI of the brain and spine came out as normal. It added that Pant also underwent plastic surgery to manage his facial injuries, lacerated wounds and abrasions. But excessive pain and swelling meant that Pant’s MRI of right knee and ankle was held back. Sharma added that rest of the tests, including the MRI, will now happen in Mumbai. “All of his tests (including the MRI) will happen there and he will be taken care of very well. God willing, everything will be fine,” he added. The DDCA Director earlier on Monday had said that Rishabh had been shifted to a private suite from the ICU at Max Hospital, Dehradun, due to a high risk of catching infection. Pant was part of the India Test squad that sealed a 2-0 series victory over Bangladesh in Dhaka in December 2022. In that match which ended on December 25, he hit a match-winning 93 in the first innings of the second Test at the Sher-e-Bangla National Cricket Stadium.","pubDate":"2023-01-04 08:15:03","image_url":null,"source_id":"telanganatoday","country":["india"],"category":["sports"],"language":"english"},{"title":"Rishabh Pant Car Accident: पंत को लेकर आया बड़ा अपडेट, यहां होगा आगे का इलाज","link":"https://sports.ndtv.com/hindi/cricket/rishabh-pant-car-accident-pant-further-treatment-in-mumbai-rishabh-pant-health-update-3662336#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"Rishabh Pant Car Accident: मुंबई में होगा ऋषभ पंत का इलाज, एक भयानक कार दुर्घटना में बाल-बाल बच गए, जब वे दिल्ली से अपने गृहनगर रुड़की जा रहे थे, लेकिन NH-58 राजमार्ग पर नियंत्रण खो बैठे और डिवाइडर से टकरा गए थे.","content":"Rishabh Pant Car Accident: मुंबई में होगा ऋषभ पंत का इलाज, बीसीसीआई के सूत्रों ने बुधवार को बताया कि भारत के स्टार बल्लेबाज ऋषभ पंत को देहरादून के अस्पताल से मुंबई के एक अस्पताल में स्थानांतरित किया जाएगा, जहां घुटने और टखने की चोट के कारण उनका व्यापक उपचार किया जाएगा. \"ऋषभ को उनकी लिगामेंट चोटों के निदान और उपचार के लिए मुंबई में स्थानांतरित किया जा रहा है और आगे की कार्रवाई के बारे में फैसला किया जाएगा. उनके बीसीसीआई द्वारा सूचीबद्ध प्रसिद्ध खेल आर्थोपेडिक डॉ दिनशॉ पारदीवाला की देखरेख में रहने की उम्मीद है. अगर सर्जरी के लिए सलाह है, अगर यह ब्रिटेन या अमेरिका में होगा तो फैसला किया जाएगा. पंत, 25, एक भयानक कार दुर्घटना में बाल-बाल बच गए, जब वे दिल्ली से अपने गृहनगर रुड़की जा रहे थे, लेकिन NH-58 राजमार्ग पर नियंत्रण खो बैठे और डिवाइडर से टकरा गए. पंत के माथे पर चोट के निशान थे, पीठ में गंभीर चोट के साथ-साथ उनके घुटने और टखने में चोटें थीं. जबकि अधिकांश चोटें सही हैं, चिंताजनक कारक टखना और घुटना होगा क्योंकि उनका इलाज मैक्स, देहरादून में हुआ था.Rishabh Pant will be shifted to Mumbai today for further treatments.— Mufaddal Vohra (@mufaddal_vohra) January 4, 2023Rishabh Pant will be shifted to Mumbai for further treatment: DDCA directorRead @ANI Story | https://t.co/SZROuSeA1L#RishabhPant #RishabhPantaccident #cricket #TeamIndia pic.twitter.com/aWhDcSwwbV— ANI Digital (@ani_digital) January 4, 2023यह भी पढ़ें: * Ms Dhoni के कौशल को पहचान दिलाने वाले प्रकाश पोद्दार का निधन* IND vs SL: कप्तान हार्दिक ने बताया क्यों आखिरी ओवर में अक्षर को गेंद थमाया","pubDate":"2023-01-04 07:32:36","image_url":"https://c.ndtvimg.com/2022-12/u1ba5uo8_rishabh-pant_640x480_30_December_22.jpg","source_id":"ndtv_in","country":["india"],"category":["sports"],"language":"hindi"},{"title":"Rishabh Pant airlifted to Mumbai, set to undergo surgery: BCCI","link":"https://timesofindia.indiatimes.com/sports/cricket/news/bcci-to-shift-rishabh-pant-to-mumbai-for-treatment-of-his-ligament-injury/articleshow/96730387.cms","keywords":null,"creator":null,"video_url":null,"description":"Star India batter Rishabh Pant is all set to \"undergo surgery for ligament tears\", the BCCI stated on Wednesday, effectively ruling him out of competitive cricket for an indefinite period.","content":null,"pubDate":"2023-01-04 06:50:22","image_url":null,"source_id":"toi","country":["india"],"category":["sports"],"language":"english"},{"title":"Board of Control for Cricket in India (BCCI) invites tender for right to own teams in Women's IPL","link":"https://www.sentinelassam.com/sports/cricket/board-of-control-for-cricket-in-india-bcci-invites-tender-for-right-to-own-teams-in-womens-ipl-631388","keywords":["Sports,Cricket"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"BCCI on Tuesday issued a tender inviting interested parties to own and operate teams in the inaugural edition of the Women's Indian Premier League (WIPL)","content":"MUMBAI: The Board of Control for Cricket in India (BCCI) on Tuesday issued a tender inviting interested parties to own and operate teams in the inaugural edition of the Women's Indian Premier League (WIPL). The inaugural season of the Women's IPL is likely to be held from March 3 to 26, just before the men's IPL. ''Board of Control for Cricket in India (BCCI) announces release of Invitation to Tender for the right to own and operate a team in Women's Indian Premier League,'' the Indian cricket board said in a statement. ''The Governing Council of the IPL invites bids from reputed entities to acquire the right to own and operate a team in Women's Indian Premier League, through a tender process,\" it added. The ITT will be available for purchase for a non-refundable fee of Rs five lakh till January 21, 2023. IANSAlso Read: Injured India wicket-keeper batter Rishabh Pant shifted to private suite from ICUAlso Watch:","pubDate":"2023-01-04 06:46:09","image_url":"https://assets.sentinelassam.com/h-upload/2023/01/04/427308-418096-400168-1665406443photo-2.avif","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"Star speedster Jasprit Bumrah included in ODI series against Sri Lanka","link":"https://www.sentinelassam.com/sports/cricket/star-speedster-jasprit-bumrah-included-in-odi-series-against-sri-lanka-631383","keywords":["Sports,Cricket"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"Bumrah has been out of action since September 2022 and was subsequently ruled out of the ICC Men’s T20 World Cup due to a back injury.","content":"MUMBAI: Star speedster Jasprit Bumrah has been added to India's squad for the upcoming three-match ODI series against Sri Lanka, the Board of Control for Cricket in India (BCCI) announced on Tuesday.Bumrah has been out of action since September 2022 and was subsequently ruled out of the ICC Men's T20 World Cup due to a back injury. \"The pacer has undergone rehabilitation and has been declared fit by the National Cricket Academy (NCA). He will be joining the Team India ODI squad soon,\" the BCCI said in a statement. The ODI series against Sri Lanka starts on January 10 in Guwahati. The second and third matches will be played on January 12 and 15 in Kolkata and Thiruvananthapuram. India had announced the ODI squad in December and Bumrah was initially not included with reports citing that the BCCI was cautious about rushing the pacer back into the mix. Besides Bumrah, Mohammad Shami, Mohammed Siraj, Umran Malik and Arshdeep Singh are the other pacers in the squad with all-rounder Hardik Pandya also in the mix. Squad for Sri Lanka ODIs: Rohit Sharma (C), Shubman Gill, Virat Kohli, Suryakumar Yadav, Shreyas Iyer, KL Rahul (wk), Ishan Kishan (wk), Hardik Pandya (VC), Washington Sundar, Yuzvendra Chahal, Kuldeep Yadav, Axar Patel, Jasprit Bumrah, Mohd. Shami, Mohd. Siraj, Umran Malik, Arshdeep Singh. IANS Also Read: Injured India wicket-keeper batter Rishabh Pant shifted to private suite from ICUAlso Watch:","pubDate":"2023-01-04 06:37:42","image_url":"https://assets.sentinelassam.com/h-upload/2023/01/04/427303-jaspritbumrahsad-sixteennine.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"How to stop a stampede on day one of a Sydney cricket test","link":"https://www.watoday.com.au/sport/cricket/how-to-stop-a-stampede-on-day-one-of-a-sydney-cricket-test-20230104-p5cacf.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Harriet Alexander"],"video_url":null,"description":"Excitement is high as the clock ticks down towards day one of the Sydney Test. One woman stands between the throng of members and their favourite seats. Can she prevail?","content":null,"pubDate":"2023-01-04 05:32:07","image_url":null,"source_id":"watoday","country":["australia"],"category":["sports"],"language":"english"},{"title":"India vs Sri Lanka: 'Kept my dream alive,' says Shivam Mavi after memorable international debut","link":"https://www.thehansindia.com/sports/cricket/india-vs-sri-lanka-kept-my-dream-alive-says-shivam-mavi-after-memorable-international-debut-776197","keywords":["Sports,Cricket"],"creator":["Ishka"],"video_url":null,"description":"India beat Sri Lanka by 2 runs in 1st T20IShivam Mavi picked up 4 for 22It was the third-best figures by an Indian on T20I debut","content":"Shivam MaviShivam MaviShivam Mavi has said that it took a little longer to fulfill his dream of playing for India but over the last few years, he did not give up on it.The 24-year-old pacer made his India debut on Tuesday during their first T20I against Sri Lanka at Wankhede Stadium. In what turned out to be a special first appearance in the blue shirt, Mavi picked up four wickets and helped India win the game by a narrow margin of two runs. Mavi's 4 for 22 was the third-best T20I figures for India on debut after Barinder Sran (4 for 10) in 2016 and Pragyan Ojha (4 for 21) in 2009. Having played for Kolkata Knight Riders (KKR) from 2018 to 2022 in the Indian Premier League (IPL), Mavi said that he was less nervous on Tuesday in his maiden game for India, thanks to his experience in the Indian T20 league.\"The landing zone was a little slippery. Was waiting for six years after playing U19. Had to work hard in those six years - got injured as well. For a while it looked like my dream will remain a dream. But I kept at it. Having played the IPL, the nervousness is a little less. My idea in the powerplay is to attack and get them out. Favourite dismissal was the first one, getting him bowled,\" said Mavi after India's two-run win.That maiden T20I wicket feeling 🔥#INDvSL pic.twitter.com/8oyguA9gzc— ESPNcricinfo (@ESPNcricinfo) January 3, 2023 India vs Sri Lanka: 'We won because of young guns,' says Hardik Pandya Meanwhile, stand-in skipper Hardik Pandya backed Mavi, saying he had seen him bowl in the IPL and knew he was capable to doing well on the big stage as well. Mavi, who is set to play under Hardik at Gujarat Titans (GT) in the upcoming edition of IPL, has so far picked up 30 wickets in 32 games.\"The conversation was very simple, I have seen him (Mavi) bowl well in the IPL and I know what his strengths are, just back yourself and don't worry about getting hit,\" said Hardik in the post-match presentation. After India picked up five wickets inside 10 overs, Sri Lanka captain Dasun Shanaka took matters into his hands. He struck three fours and as many sixes in his knock of 45 off 27 balls that brought back the tourists into the game. \"I want to put this team in difficult situations because it will help us in big games (on Axar bowling the last over). Bilaterals we are very good at and this is how we are going to challenge ourselves. To be honest, all the young guns got us out of the situation today,\" added Hardik. The GT captain bowled three overs on Tuesday and gave away just 12 runs. He said he has been bowling in the nets and has been working on bowling inswingers.\"Now, yes definitely (getting used to being called captain). It was just cramps. Now I have a tendency to scare people but if I am smiling then everything is fine. I did not sleep well, and did not drink enough water and hence my glutes were stiff. If the same situation is there then yes, I have worked on my swing bowling and I have worked on that (inswinger), I am bowling in nets and I like bowling with the new ball,\" said Hardik further.India are 1-0 up in the three-match T20I series, with the second game scheduled to take place on Thursday at Maharashtra Cricket Association Stadium, Pune.","pubDate":"2023-01-04 05:07:49","image_url":"https://assets.thehansindia.com/h-upload/2023/01/04/500x300_1328324-shivam-mavi.jpg","source_id":"thehansindia","country":["india"],"category":["sports"],"language":"english"},{"title":"Shorter BBL season could come next summer","link":"https://www.perthnow.com.au/sport/cricket/shorter-bbl-season-could-come-next-summer-c-9350581","keywords":null,"creator":["Scott Bailey"],"video_url":null,"description":"Cricket Australia would be open to shortening the Big Bash League a season early next summer, with broadcasters, sponsors and teams supportive of the move.","content":null,"pubDate":"2023-01-04 05:03:44","image_url":"https://images.perthnow.com.au/publication/C-9350581/6bceb1eb18e3bbcbb9a299dea8fedd767cc7185c-16x9-x0y0w1280h720.jpg","source_id":"perthnow","country":["australia"],"category":["sports"],"language":"english"},{"title":"Mavi steals the show","link":"https://www.tribuneindia.com/news/sports/mavi-steals-the-show-467237","keywords":null,"creator":null,"video_url":null,"description":"Mumbai, January 3 Shivam Mavi made a dream debut with a relentless display of fast bowling as his four-wicket haul made the difference in India's narrow two-run win over a spirited Sri Lanka in the first T20I here today. While Shivam Mavi ended with envious figures of 4/22 in four overs. PTI India's batters found the Sri Lankan spinners hard to put away before Deepak Hooda (41 not out off 23) and Axar Patel (31 not out off 20) took the hosts to 162/5. Sri Lanka surely had the firepower to chase down 163 but Mavi's strikes at the start and the back end of the innings tilted the game in favour of the home team. The game went down to the wire with spinner Axar Patel managing to defend 13 runs in the final over. Mavi ended with envious figures of 4/22 in four overs. The fighting knocks from skipper Dasun Shanaka (45 off 27) and Chamika Karunaratne (23 not out off 16) went in vain as Sri Lanka ended at 160 all out in 20 overs. This was the lowest total India defended at the stadium. Skipper Hardik Pandya decided to bowl the first over and the pressure created by him helped Mavi at the other end. Hardik bowled full tilt and hardly gave anything away, conceding only 12 runs in his three-over spell. Mavi's moment to cherish came in his first over as he showed remarkable composure to strike back after being hit for two fours by Kusal Mendis. Pathum Nissanka had no clue as Mavi's delivery jagged back to shatter the stumps. Earlier, Hooda and Axar shared an unbeaten 68-run stand off 38 balls for the sixth wicket after India found themselves at a shaky 94/5. Brief scores: India: 162/5 (Hooda 41*, Kishan 37, Axar 31*; Hasaranga 1/22); Sri Lanka: 160 all out in 20 overs (Shanaka 45, Kusal 28; Mavi 4/22, Umran 2/27, Harshal 2/41). — PTI I was waiting for this moment for the last six years. Had injuries in between and it felt my dream will never come true. Nerves were 3-4 on a scale of 10 because you know what to expect when you have played the IPL. The first wicket was my favouriteRs Shivam Mavi I try to practise for every position and try to give my best at every position. We knew if we got the momentum on our side, we would reach 160 — Deepak Hooda, player of the match I have seen him (Mavi) bowling well in the IPL and I just told him to simply bowl. I told him, 'I am backing you. Even if you get hit, it's fine.' — Hardik Pandya, india captain Really disappointed with the way we finished, it was a game we should have won. At Wankhede, the batters need to cross the line easily when you are chasing 163 — Dasun Shanaka, Sri lanka captain Bumrah added to India's ODI squad for SL series Mumbai: Star pacer Jasprit Bumrah was today added to India's ODI squad for the three games against Sri Lanka after the National Cricket Academy declared him fit for the home series beginning January 10. Bumrah last played for India in September and had also missed the T20 World Cup in Australia due to a back injury. BCCI invites bids for women's IPL teams New delhi: The Indian cricket board (BCCI) today invited bids for the right to \"own and operate\" teams in the first ever women's Indian Premier League (IPL). In December, the BCCI also floated tenders for the women's league's media rights for the 2023-27 cycle. \"The Governing Council of the IPL invites bids from reputed entities to acquire the right to own and operate a team in Women's Indian Premier League, through a tender process,\" the BCCI said in a statement. \"The (Invitation to Tender) will be available for purchase till January 21, 2023.\" The inaugural season of the women's IPL is likely to be played on March 3-26. A three-team Women's T20 Challenge had been staged alongside the men's IPL since 2018, but the BCCI have been urged to set up an expanded tournament for women with more teams and players. Nervy Pak trail NZ by 295 in 2nd Test Karachi: Matt Henry and Ajaz Patel's last-wicket century stand helped New Zealand take control of the second Test against a jittery Pakistan today. Henry made a career-best unbeaten 68 off 81 balls while Patel also notched his Test-best of 35 as they added 104 for the 10th wicket and propelled New Zealand to 449 on Day 2. Both Henry and Patel then struck early blows and captain Babar Azam was run out in a bizarre mix-up with Imam-ul-Haq in the final session before Pakistan struggled to reach 154/3 at stumps. Imam was unbeaten on 74. Zampa fails 'Mankad' attempt in BBL melbourne: Australia leg-spinner Adam Zampa found himself in an embarrassing situation on Tuesday when his attempt to get Melbourne Renegades' Tom Rogers run out with a \"Mankad\" went awry. Melbourne Stars captain Zampa aborted a ball during his run-up after seeing Rogers leave his crease early and whipped off the bails, with umpires initially giving it as a run out. However, the decision was overturned by the third umpire, who determined Zampa's arm to have \"gone past the vertical\". Agencies","content":null,"pubDate":"2023-01-04 03:31:08","image_url":"https://englishtribuneimages.blob.core.windows.net/gallary-content/2023/1/2023_1$largeimg_1826243586.JPG","source_id":"tribuneindia","country":["india"],"category":["sports"],"language":"english"},{"title":"\"Let Me Be Fully On...\": Hardik's Response On His Return To Test Cricket","link":"https://sports.ndtv.com/cricket/let-me-be-fully-on-hardik-pandyas-brilliant-response-on-his-return-to-test-cricket-3660058","keywords":null,"creator":null,"video_url":null,"description":"All-rounder Hardik Pandya led Team India to a 2-run win over Sri Lanka in the first T20I of a three-match series on Tuesday","content":null,"pubDate":"2023-01-04 02:45:12","image_url":null,"source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Lanning to return with Victoria this week","link":"https://www.perthnow.com.au/sport/cricket/lanning-to-return-with-victoria-this-week-c-9348030","keywords":null,"creator":["Jasper Bruce"],"video_url":null,"description":"National captain Meg Lanning will make her return to cricket with the Victorian state side after taking five months away from the sport to focus on herself.","content":null,"pubDate":"2023-01-04 01:13:20","image_url":"https://images.perthnow.com.au/publication/C-9348030/0d9568cbef99823b3ca7fd6c049747bbda7e593e-16x9-x0y0w1280h720.jpg","source_id":"perthnow","country":["australia"],"category":["sports"],"language":"english"}]}