{"newsArray":[{"title":"SL-W vs IND-W Dream11 Team Prediction, Fantasy Cricket Hints: Captain, Probable Playing 11s, Team News; Injury Updates For Today’s SL-W vs IND-W 1st T20 at Rangiri Dambulla International Stadium, Dambulla, 2.30 PM IST June 23","link":"https://zeenews.india.com/cricket/sl-w-vs-ind-w-dream11-team-prediction-fantasy-cricket-hints-captain-probable-playing-11s-team-news-injury-updates-for-today-s-sl-w-vs-ind-w-1st-t20-at-rangiri-dambulla-international-stadium-dambulla-2-30-pm-ist-june-23-2476819.html","keywords":null,"creator":null,"video_url":null,"description":"Sri Lanka Women vs India Women Dream11 Team Prediction Sri Lanka Women vs India Women 1st T20 - Check My Dream11 Team, Best players list of SL-W vs IND-W, Sri Lanka Women Dream11 Team Player List, India Women Dream11 Team Player List, Dream11 Guru Tips, Fantasy Cricket Tips, Fantasy Cricket Tips, Fantasy Playing Tips.","content":"With the women’s T20 event of Commonwealth Games 2022 a little over a month away, both India and Sri Lanka will be aiming to fine-tune their combinations from the first T20I, starting from Thursday at the Rangiri Dambulla International Cricket Stadium. For India, who last played a T20I during their trip to New Zealand ahead of the 50-over World Cup, the trip to Sri Lanka serves them a chance to zero in on their first-choice combination which will be there for the Commonwealth Games, something which head coach Ramesh Powar and skipper Harmanpreet Kaur had stressed on ahead of their departure. “This Sri Lanka tour will give us the opportunity to try a few players. We are trying to plan our next eight months according to the situations we have to face ahead. It is more of a planning phase right now and we will execute those plans once we go ahead in the series and tournaments. To add to that, we will freeze down a combination of 11 which will take part in Commonwealth so that we are confident walking into the tournament. And the players will be confident that they are going to play in the first game,” Powar had said, before leaving for Sri Lanka. With Shafali Verma and Smriti Mandhana set to open the batting, it will be interesting to witness where Harmanpreet would bat along with a returning Jemimah Rodrigues, who had a brilliant time in the Women’s T20 Challenge, especially with a 44-ball 66 for Supernovas. Then, there is Sabbhineni Meghana’s emergence as a dependable batter, especially seen from her 47-ball 73 for Trailblazers in the Women’s T20 Challenge, in a year where she made 4, 49, and 61 in ODI series against New Zealand earlier this year. Eyes will be on the Indian team management over how Meghana fits in the T20I eleven, given that the side has a issue of lack of consistency in maintaining the momentum while batting first or chasing a target. On the bowling front, India would want spin quartet of Deepti Sharma, Poonam Yadav, Radha Yadav and Rajeshwari Gayakwad to prosper in spin-friendly conditions while wishing for Meghna Singh (uncapped in T20Is), Pooja Vastrakar and Renuka Singh to do an admirable job with fast bowling. Sri Lanka, on the other hand, are coming fresh off their first bilateral series in nearly two years, a tour of Pakistan, where they were swept 3-0 while managing to win the third and final ODI after losing the series as well. Match Details Sri Lanka Women vs India Women, 1st T20 Venue: Rangiri Dambulla International Stadium, Dambulla Date & Time: June 23 at 2.30 PM IST Live Streaming and TV details: Fancode SL-W vs IND-W Dream 11 Prediction Wicketkeeper: Richa Ghosh Batters: Smriti Mandhana, Shafali Verma, Nilakshi Silva, Hasini Perera All-rounders: Harmanpreet Kaur, Deepti Sharma, Chamari Athapaththu Bowlers: Sugandika Kumari, Rajeshwari Gayakwad, Oshadi Ranasinghe Captain: Harmanpreet Kaur Vice-Captain: Oshadi Ranasinghe SL-W vs IND-W Probable Playing XI Sri Lanka Women: Hasini Perera, Chamari Athapaththu (c), Oshadi Ranasinghe, Nilakshi de Silva, Harshitha Madavi, Ama Kanchana, Kavisha Dilhari, Anushka Sanjeewani (wk), Sachini Nisansala, Sugandika Kumari, Udeshika Prabodhani India Women: Smriti Mandhana, Shafali Verma, Yastika Bhatia (wk), Jemimah Rodrigues, Harmanpreet Kaur (c), Deepti Sharma, Poonam Yadav, Richa Ghosh (wk), Pooja Vastrakar, Meghna Singh, Rajeshwari Gayakwad","pubDate":"2022-06-23 02:01:00","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"Women begin new chapter without Mithali Raj","link":"https://www.tribuneindia.com/news/sports/women-begin-new-chapter-without-mithali-raj-406160","keywords":null,"creator":null,"video_url":null,"description":"Dambulla, June 22The Indian women's cricket team will be eyeing a good start under new all-format skipper Harmanpreet Kaur against Sri Lanka in the first T20 International of the three-match series starting here tomorrow.Women's T20I seriesAs a team, there are quite a few areas we are currently working on to improve keeping in mind this series against Sri Lanka. While our core strength is our batting, we are giving extra efforts to improve our fielding Harmanpreet Kaur, India skipperIndia will look to begin their campaign on a high, with T20I cricket set to feature in the upcoming Birmingham Commonwealth Games. This will be the first international assignment for India since the disappointment at the 50-over World Cup, played in March-April.Notably, the Indian team will be without the legendary Mithali Raj — the former skipper retired earlier this month after an illustrious 23-year career. On the personal front, Harmanpreet will be eyeing a milestone. The 33-year-old batter, who has amassed 2,319 runs from 121 matches, needs another 46 runs to eclipse Mithali in the shortest format.Hosts Sri Lanka, on the other hand, will be looking to put behind their 0-3 loss to Pakistan suffered in their T20I series recently. However, the Indians will have to be vigilant against the likes of Sri Lankan veterans Oshadi Ranasinghe and Chamari Athapaththu.","content":"PTI Dambulla, June 22 The Indian women’s cricket team will be eyeing a good start under new all-format skipper Harmanpreet Kaur against Sri Lanka in the first T20 International of the three-match series starting here tomorrow. Women’s T20I series As a team, there are quite a few areas we are currently working on to improve keeping in mind this series against Sri Lanka. While our core strength is our batting, we are giving extra efforts to improve our fielding Harmanpreet Kaur, India skipper India will look to begin their campaign on a high, with T20I cricket set to feature in the upcoming Birmingham Commonwealth Games. This will be the first international assignment for India since the disappointment at the 50-over World Cup, played in March-April. Notably, the Indian team will be without the legendary Mithali Raj — the former skipper retired earlier this month after an illustrious 23-year career. On the personal front, Harmanpreet will be eyeing a milestone. The 33-year-old batter, who has amassed 2,319 runs from 121 matches, needs another 46 runs to eclipse Mithali in the shortest format. Hosts Sri Lanka, on the other hand, will be looking to put behind their 0-3 loss to Pakistan suffered in their T20I series recently. However, the Indians will have to be vigilant against the likes of Sri Lankan veterans Oshadi Ranasinghe and Chamari Athapaththu.","pubDate":"2022-06-23 01:36:12","image_url":"https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/6/2022_6$largeimg_1476509361.jpg","source_id":"tribuneindia","country":["india"],"category":["sports"],"language":"english"},{"title":"PCB BoG meeting today","link":"https://www.thenews.com.pk/print/968420-pcb-bog-meeting-today","keywords":null,"creator":null,"video_url":null,"description":"LAHORE:·The 69th meeting of the Board of Governors of the Pakistan Cricket Board will be held on Thursday with the PCB chairman Ramiz Raja seeking approval to hold the Junior Premier League and for the annual PCB budget.The meeting will start at 11.30 am at the National High Performance...","content":"LAHORE:·The 69th meeting of the Board of Governors (BoG) of the Pakistan Cricket Board (PCB) will be held on Thursday (today) with the PCB chairman Ramiz Raja seeking approval to hold the Junior Premier League and for the annual PCB budget. .ads_between_content{ height:auto; width:auto; clear: both; text-align: center; } .ads_between_content .story_ads{ } /*@media (max-width:600px){ .ads_between_content{ float:none; margin:0px auto; text-align: center; } }*/ The meeting will start at 11.30 am at the National High Performance Centre in Lahore and in this high-profile meeting, PCB's chairman Ramiz Raja, COO Salman Naseer and CFO Javed Murtaza will present financial budget for 2022-23. According to sources, central contracts for players will be announced this week after the approval of annual budget. Reportedly, for the first time in history, PCB is going to give separate contracts for ODIs and Test matches. Those playing all three formats regularly will get two contracts. These players are Babar Azam, Shaheen Shah Afridi, Mohammad Rizwan, Imam-ul-Haq, and Hassan Ali.","pubDate":"2022-06-23 01:00:00","image_url":null,"source_id":"thenews","country":["pakistan"],"category":["sports"],"language":"english"},{"title":"CP, Northern CCA squads announced","link":"https://www.thenews.com.pk/print/968429-cp-northern-cca-squads-announced","keywords":null,"creator":null,"video_url":null,"description":"LAHORE: Pakistan Cricket Board on Wednesday announced 19 and 11 teams of Central Punjab and Northern, respectively, for the City Cricket Association Tournament 2022-23.With this, the PCB has unveiled all 93 City Cricket Association sides .The tournament has already commenced in Balochistan,...","content":null,"pubDate":"2022-06-23 01:00:00","image_url":null,"source_id":"thenews","country":["pakistan"],"category":["sports"],"language":"english"},{"title":"Cricket world goes bonkers over 'insane' moment: 'What the hell'","link":"https://au.sports.yahoo.com/cricket-2022-fans-bonkers-insane-jos-buttler-moment-001107666.html","keywords":null,"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2022-06-23 00:11:23","image_url":"https://s.yimg.com/os/creatr-uploaded-images/2022-06/86311380-f288-11ec-bf5f-e24913571a49","source_id":"yahoo","country":["australia"],"category":["sports"],"language":"english"},{"title":"Gayle spruiks cricket's newest format","link":"https://www.theage.com.au/sport/cricket/gayle-spruiks-crickets-newest-format-20220623-p5avyx.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":null,"video_url":null,"description":"West Indies icon Chris Gayle spruiks cricket's newest format, the 6ixty.","content":null,"pubDate":"2022-06-23 00:00:13","image_url":null,"source_id":"theage","country":["australia"],"category":["sports"],"language":"english"},{"title":"Mitch Marsh reflects on Sri Lanka ODI loss","link":"https://www.cairnspost.com.au/sport/cricket/mitch-marsh-reflects-on-sri-lanka-odi-loss/video/5cbb0fc1e7a81a0c3554a9e46c0b7bc3","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket: After dropping the fourth ODI and the series to Sri Lanka, Australian all-rounder Mitch Marsh has reflected on his side's performance.","content":null,"pubDate":"2022-06-22 22:00:19","image_url":null,"source_id":"cairnspost","country":["australia"],"category":["sports"],"language":"english"},{"title":"India vs Leicestershire 2022 team squad: Team India squad for practice match in England vs Leicestershire","link":"https://thesportsrush.com/cricket-news-india-vs-leicestershire-2022-team-squad-team-india-squad-for-practice-match-in-england-vs-leicestershire/","keywords":["Cricket","India","Leicester","Leicestershire"],"creator":["Gurpreet Singh"],"video_url":null,"description":"India vs Leicestershire 2022 team squad: India’s tour of England would start with a 4-day warm-up match against Leicestershire. After having arrived at the England shores the past Sunday, team India has had long training sessions which have continued until Wednesday, as they gear themselves up for a four-day Warm-up match against the Leicestershire County… The post India vs Leicestershire 2022 team squad: Team India squad for practice match in England vs Leicestershire appeared first on The SportsRush.","content":"India vs Leicestershire 2022 team squad: India’s tour of England would start with a 4-day warm-up match against Leicestershire. After having arrived at the England shores the past Sunday, team India has had long training sessions which have continued until Wednesday, as they gear themselves up for a four-day Warm-up match against the Leicestershire County Club (LCCC) on Thursday, June 23. The aforementioned practice match would precede the rescheduled fifth Test match against England set to take place from July 1, which was postponed last year due to the COVID-19 scare in the Indian camp, with the series score line reading 2-1. Interestingly, post receiving permissions from the LCCC, BCCI, and the England and Wales Cricket Board (ECB), batters – Cheteshwar Pujara , Rishabh Pant, and bowlers – Jasprit Bumrah and Prasidh Krishna would play for the Leicestershire side, with each team allowed to field a total 13 players each. 1 DAY TO GO Leicestershire CCC @BCCI . . . #IndiaTourMatch | #LEIvIND — Leicestershire Foxes (@leicsccc) June 22, 2022 The Warm-up match today would be an ideal preparation ground for the likes of Shubman Gill and veteran batter Cheteshwar Pujara, both of who would be eyeing for a spot in the playing 11, post being out of action for different reasons. The focus might be on the battle between the likes of Rohit Sharma and Virat Kohli against Jasprit Bumrah, with both the experienced batters going through a lean patch of individual form for quite some time now. Apart from them, eyes would also bee on Ravindra Jadeja, who is returning back from a rib injury and a forgetful IPL 2022 campaign as CSK skipper. In the absence of Ravichandran Ashwin, the all rounder’s role becomes even more vital in the team. India : Rohit Sharma (C), Shubman Gill, Virat Kohli, Shreyas Iyer, Hanuma Vihari, KS Bharat (wk), Ravindra Jadeja, Shardul Thakur, Mohammed Shami, Mohammed Siraj, Umesh Yadav. Leicestershire: Sam Evans (Capt), Rehan Ahmed, Sam Bates (wk), Nat Bowley, Will Davis, Joey Evison, Louis Kimber, Abi Sakande, Roman Walker, Cheteshwar Pujara, Rishabh Pant, Jasprit Bumrah and Prasidh Krishna.","pubDate":"2022-06-22 17:36:57","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"West Indies Cricket launches new 60-ball tournament","link":"https://www.iol.co.za/sport/cricket/international/west-indies-cricket-launches-new-60-ball-tournament-158cfedf-8292-4849-9d74-45c0ab580da9","keywords":null,"creator":["AFP"],"video_url":null,"description":"The 6ixty will see six men's teams and three women's teams compete in a new T10 tournament which organisers say will feature ‘many of the best cricketers from around the world’.","content":null,"pubDate":"2022-06-22 17:36:16","image_url":"https://image-prod.iol.co.za/16x9/800?source=https://xlibris.public.prod.oc.inl.infomaker.io:8443/opencontent/objects/5a5e397d-ab79-5287-96b8-80706027849b&operation=CROP&offset=0x36&resize=3600x2022","source_id":"iol","country":["south africa"],"category":["sports"],"language":"english"},{"title":"Sachin Tendulkar जैसे दिग्गज की श्रेणी में शामिल हुए सरफराज खान, रणजी क्रिकेट में 80 से ऊपर का एवरेज","link":"https://www.abplive.com/sports/cricket/mumbai-batsman-sarfaraz-khan-has-a-better-average-than-rahul-dravid-and-vvs-laxman-in-ranji-trophy-2152334","keywords":null,"creator":["ABP Live"],"video_url":null,"description":"<p style=\"text-align: justify;\"><strong>Ranji Trophy Final:</strong> रणजी ट्रॉफी के मौजूदा सीजन में सरफराज खान (Sarfaraz Khan) का शानदार प्रदर्शन जारी है. वह अब तक इस सीजन में 800 से अधिक रन बना चुके हैं. ऐसा करने वाले वह एक मात्र बल्लेबाज हैं. दरअसल, 24 वर्षीय इस खिलाड़ी ने पूर्व भारतीय दिग्गज राहुल द्रविड़ (Rahul Dravid) और वीवीएस लक्ष्मण (VVS Laxman) जैसे खिलाड़ियों को पीछे छोड़ दिया है. वहीं, अगर रणजी ट्रॉफी (Ranji Trophy) में 2000 से अधिक रन बनाने वाले खिलाड़ियों के औसत की बात करें, तो सरफराज खान (Sarfaraz Khan) ओवरऑल तीसरे नंबर पर हैं.</p> <p style=\"text-align: justify;\"><strong>आगे निकले सरफराज खान</strong></p> <p style=\"text-align: justify;\">दरअसल, सरफराज खान (Sarfaraz Khan) का औसत रणजी ट्रॉफी (Ranji Trophy) में तकरीबन 82 का रहा है. वहीं, विजय मर्चेंट (Vijay Merchant) 98 की औसत के साथ पहले और सचिन तेंदुलकर (Sachin Tendulkar) 87 की औसत के साथ दूसरे नंबर पर हैं. इसके अलावा पूर्व भारतीय कप्तान राहुल द्रविड़ (Rahul Dravid) ने 81 और वीवीएस लक्ष्मण (VVS Laxman) ने 80 की औसत से रन बनाए हैं. इस मुकाबले से पहले तक सरफराज ने 24 फर्स्ट क्लास मैच (First Class Match) में 81 की औसत से 2351 रन बनाए थे. इस दौरान सरफराज खान (Sarfaraz Khan) ने 7 शतक और 7 अर्धशतकीय पारी खेली है.जबकि सर्वाधिक स्कोर (Best Score) 301 रहा है.</p> <p style=\"text-align: justify;\"><strong>यशस्वी जायसवाल ने बनाया अर्धशतक</strong></p> <p style=\"text-align: justify;\">वहीं, रणजी ट्रॉफी फाइनल (Ranji Trophy Final) में मध्य प्रदेश (MP) के खिलाफ मुंबई (Mumbai) के कप्तान पृथ्वी शॉ (Prithvi Shaw) ने टॉस जीतकर पहले बल्लेबाजी करने का फैसला किया. कप्तान पृथ्वी शॉ (Prithvi Shaw) और यशस्वी जायसवाल (Yashasvi Jaiswal) ने पहले विकेट के लिए 87 रन जोड़े. कप्तान पृथ्वी शॉ (Prithvi Shaw) अपने अर्धशतक से चूक गए, वहीं यशस्वी जायसवाल (Yashasvi Jaiswal) ने 78 रनों की पारी खेली. सरफराज खान (Sarfaraz Khan) 40 रन बनाकर नाबाद हैं. पृथ्वी शॉ (Prithvi Shaw) 79 गेंद पर 47 रन बनाकर तेज गेंदबाज पुनित अग्रवाल (Punit Agarwal) का शिकार बने. जबकि अरमान जाफर (Armaan Jaffer) 26 रन बनाकर स्पिनर कुमार कार्तिकेय (Kumar Karthikeya) की बॉल पर आउट हुए.</p> <p style=\"text-align: justify;\"><strong>ये भी पढ़ें-</strong></p> <p style=\"text-align: justify;\"><strong><a href=\"https://www.abplive.com/sports/cricket/david-warner-not-unhappy-with-the-series-defeat-against-sri-lanka-2152149\">Sri Lanka के खिलाफ मिली हार से निराश नहीं हैं डेविड वार्नर, आगे की चुनौती के लिए अभी से तैयार</a><br /></strong></p> <p style=\"text-align: justify;\"><strong><a href=\"https://www.abplive.com/sports/cricket/big-bash-league-introduces-draft-system-to-pick-overseas-players-know-details-2152234\">Big Bash League में ड्राफ्ट सिस्टम से होगा विदेशी खिलाड़ियों का चयन, 4 कैटेगरी में होंगे प्लेयर्स</a><br /></strong></p>","content":null,"pubDate":"2022-06-22 17:34:46","image_url":null,"source_id":"abplive","country":["india"],"category":["sports"],"language":"hindi"},{"title":"Netizens react as West Indies announce new 10 over per side tournament named '6ixty'","link":"https://www.dnaindia.com/cricket/report-netizens-react-as-west-indies-announce-new-10-over-per-side-tournament-named-6ixty-2962824","keywords":["Sports","Cricket"],"creator":["DNA Web Team"],"video_url":null,"description":"The Caribbean Premier League and Cricket West Indies will launch with a T10 tournament named 'The 6ixty'.","content":null,"pubDate":"2022-06-22 16:55:00","image_url":"https://cdn.dnaindia.com/sites/default/files/styles/third/public/2022/06/22/2430102-fotojet-6.jpg","source_id":"dnaindia","country":["india"],"category":["sports"],"language":"english"},{"title":"India vs Leicestershire practice match pitch report: Leicester cricket ground pitch report India practice match in England","link":"https://thesportsrush.com/cricket-news-india-vs-leicestershire-practice-match-pitch-report-leicester-cricket-ground-pitch-report-india-practice-match-in-england/","keywords":["Cricket","India","Leicester","Leicestershire","Leicestershire Foxes"],"creator":["Gurpreet Singh"],"video_url":null,"description":"India vs Leicestershire practice match pitch report: India’s tour of England would start with a 4-day warm-up match against Leicestershire. India’s tour of England would commence with a 4-day Warm-up match against the Leicestershire County Cricket Club at the Uptonsteel County Ground from June 23 onwards. Team India’s 15-member squad, all of which arrived in… The post India vs Leicestershire practice match pitch report: Leicester cricket ground pitch report India practice match in England appeared first on The SportsRush.","content":"India vs Leicestershire practice match pitch report: India’s tour of England would start with a 4-day warm-up match against Leicestershire. India’s tour of England would commence with a 4-day Warm-up match against the Leicestershire County Cricket Club at the Uptonsteel County Ground from June 23 onwards. Team India’s 15-member squad , all of which arrived in two batches by yesterday, would stay at Leicester until June 26, post which they would leave for Birmingham to play the rescheduled fifth Test match against England which was postponed last year due to the COVID-19 scare in the Indian camp, with the series score line reading 2-1. Rohit Sharma would lead the team for the first time in an overseas tour, and is reportedly set to open the Indian innings alongside Shubman Gill, after KL Rahul failed to recover from the groin injury he had picked up right before the home T20I series against South Africa. As generally is the case with Test format practice matches, Thursday’s unofficial match between India and Leicestershire County Club, would be played by 13 players each from both the teams. | @ImRo45 is ramping the intensity. ✊ The stage is set for . ️: https://t.co/uu0mGLEuym #IndiaTourMatch | #LEIvIND pic.twitter.com/VgzJazvriJ — Leicestershire Foxes (@leicsccc) June 22, 2022 As has been witnessed during Leicestershire’s recent County Championship Division Two matches at the venue off-late, the pitch has been good enough for the batters with runs on offer during each of the four innings. Additionally, the pitch has been conducive enough for the seam bowlers as well, as the pacers have had the assistance of the grass on the pitch which helps the ball carry through to the keeper much quickly than anticipated, providing them that extra zip to hurry the batters. As for the outfield, the Grace Road ground has the second biggest boundary dimension after the one at The Oval, in the whole of England. ALSO READ : Ticket booking process of India vs Leicestershire warm-up match","pubDate":"2022-06-22 16:40:38","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"West Indies, CPL launch THE 6IXTY tournament: All you need to know about cricket's new format","link":"https://www.indiatoday.in/sports/cricket/story/the-6ixty-cricket-format-cpl-2022-rules-explained-west-indies-1965610-2022-06-22?utm_source=rss","keywords":null,"creator":null,"video_url":null,"description":"West Indies, CPL launch THE 6IXTY: All you need to know about cricket's new format","content":null,"pubDate":"2022-06-22 16:29:27","image_url":null,"source_id":"indiatoday","country":["india"],"category":["sports"],"language":"english"},{"title":"The Spin | Lord Patel must see off Yorkshire backlash if reforms are to work","link":"https://www.theguardian.com/sport/2022/jun/22/cricket-the-spin-lord-patel-must-see-off-yorkshire-discontent-if-reforms-are-to-work","keywords":["Cricket","Yorkshire","Sport"],"creator":["Andy Bull"],"video_url":null,"description":"Four ex-Yorkshire chairmen want an inquiry into the ECB’s handling of the Rafiq affair, but the new one needs backingWelcome to The Spin, the Guardian’s weekly (and free) cricket newsletter. Here’s an extract from this week’s edition. To receive the full version every Wednesday, just pop your email in below:They have two summer sports in Yorkshire: playing cricket and arguing about it. It’s been this way since at least the 1950s, on into the Boycott years, right up to the present day and the ongoing row about the attempts to reform the club made by Lord Patel since he took over as chairman last November. Continue reading...","content":"Welcome to The Spin, the Guardian’s weekly (and free) cricket newsletter. Here’s an extract from this week’s edition. To receive the full version every Wednesday, just pop your email in below: They have two summer sports in Yorkshire: playing cricket and arguing about it. It’s been this way since at least the 1950s, on into the Boycott years, right up to the present day and the ongoing row about the attempts to reform the club made by Lord Patel since he took over as chairman last November. “I didn’t want anyone at Yorkshire to lose their jobs, I just wanted an acknowledgment that I had been treated dreadfully,” Azeem Rafiq wrote in this year’s Wisden Almanack in an article reflecting on the abuse scandal. “We are where we are now because Yorkshire wanted a fight.” And some of them still haven’t quit. Yorkshire cricket’s great divide: ‘We’ve got to stop looking over the fence at each other’ Read more Patel saw off an attempt by one of his predecessors, Robin Smith, to derail the process at an extraordinary general meeting in March, but Smith has come back for more in the runup to the third Test at Headingley. Yorkshire have gone to great lengths to get this game back on after the England and Wales Cricket Board took it away from them. “We accept that we’re under scrutiny and that the eyes of the world will be on us,” their chief operating officer, Andy Dawson, told the Yorkshire Post this week. And now in lunges Smith. He is one of four former Yorkshire chairmen who are calling for an inquiry into the ECB’s handling of the case, along with Steve Denison, Roger Hutton and Colin Graves. Graves was, of course, chairman of the ECB until 2020. If he wants to launch an inquiry into institutional incompetence at the governing body, you might assume he is willing to be questioned about his own part in it during the five years he was in charge. There are signs of discontent among the playing staff too. David Willey, the club’s Twenty20 captain, is off back to Northamptonshire. He offered a parting shot at the men who have taken over the running of the club, Ottis Gibson and Darren Gough. “The circumstances surrounding the club have made my work unsettling,” Willey said. “There are some great lads and fantastic players at Yorkshire and I hope complications at the club will not take priority and overshadow their talents. The cricket and the current players seem to be secondary at the moment to repairing the club’s reputation.” David Willey has announced his departure from Yorkshire. ‘The circumstances surrounding the club have made my work unsettling,’ he said. Photograph: Nathan Stirk/ECB/Getty Images Tom Kohler-Cadmore is going too. He kept quiet about the reasons why. But his father, Mick, was a dressing-room attendant, and had walked out in protest at the mass sacking of 16 members of staff. A lot of people were upset by the decision to get rid of the backroom staff as well as the men in senior positions. Those dismissals gave a degree of legitimacy to the existing grievances some felt about the way the club was being treated in all this. There is talk of an exodus of players at the end of the season, quelled for now by the news that two of them, Harry Brook and Dom Leech, have just agreed new contracts. Time to end ECB spin and give English cricket the governing body it deserves | Barney Ronay Read more Patel is equal to it. He once took part in an oral history project about British Asian cricketers. In it he talked about growing up poor in Bradford in the 1960s. His father worked on the buses so his family could live in a one-bed back-to-back terrace house, where they washed in the cellar and went to the toilet outside. There were seven of them, till one of the children died of rheumatism. Patel was seven before he went to school, where he was bullied mercilessly, and nine before he learned how to read and write. And he played cricket day and night, in the back streets when he was little, and then in parks and clubs and leagues, five days a week. The game became his “escape from the harsh realities of life”. It is a very Yorkshire story, blunt and tough and proud. They say that the yorker takes its name from the old phrase “to put Yorkshire on someone”, which meant to outwit or deceive them. There is little chance of anyone doing it to Patel, who is as Yorkshire as they come. He talks about how he worked his way up from sweeping floors in a restaurant to a job managing a hotel bar to a third selling life insurance and a fourth working in Ladbrokes to a fifth driving an ambulance and a sixth as a special constable, before he finally went to university so he could become a social worker and then an academic and a professor and, eventually, a cross-bench peer in the House of Lords. Towards the end of the interview Patel reflects on some of the lessons learned in his life’s work. One of them is this: “Tinkering at the edges doesn’t work, if something’s not broken, don’t fix it, but if it is broken, don’t tinker with it, be radical, get it changed, alter it.” Yorkshire were broken when he took over. And he isn’t tinkering trying to fix it. New Zealand in the nets during a nets session at Headingley on Wednesday. Photograph: Gareth Copley/Getty Images Radical change hurts and there are a lot of wounded, angry people around Yorkshire cricket. But then the club have been trying, and failing, to get to grips with these problems for 40 years already, during the tenures of all four of those previous chairmen and more before them. Patel knows all about the barriers for British-Asian cricketers, because he faced them himself. And he knows that English cricket isn’t so big that it can afford to go on alienating its British Asian population, who make up a third of its recreational playing base. Given the strength of their resources, the depth of the untapped talent in cities such as Bradford, Yorkshire could, and should, be the model of a modern, multicultural English cricket club. Patel is the man who is finally trying to make it happen. He may have made mistakes in doing it, but what matters most is whether he can, not the hurt feelings of those who don’t want to be part of it with him. Do you have an opinion on the issues raised in this article? If you would like to submit a letter of up to 300 words to be considered for publication, email it to us at guardian.letters@theguardian.com","pubDate":"2022-06-22 16:00:23","image_url":"https://i.guim.co.uk/img/media/37e4aac5b9dd691a2fa5177dea9a0725bcd22aa2/0_93_5026_3015/master/5026.jpg?width=460&quality=85&auto=format&fit=max&s=6d625220cdc14725a2599604a6c346d1","source_id":"theguardian","country":["united kingdom","india","singapore","canada"],"category":["sports"],"language":"english"},{"title":"TNPL 2022: Tamil Nadu's marquee Twenty20 contest returns in action on July 23","link":"https://sportstar.thehindu.com/cricket/domestic/tnpl-2022-tamil-nadu-premier-league-returns-in-action-on-july-23/article38505090.ece","keywords":null,"creator":["S. Dinakar"],"video_url":null,"description":"Tamil Nadu Premier League takes cricket to far corners of the State, ferrets out youngsters with talent, and does wonders for the State’s talent pool and depth.","content":null,"pubDate":"2022-06-22 15:57:35","image_url":null,"source_id":"sportstar","country":["india"],"category":["sports"],"language":"english"},{"title":"PSG next manager news – odds: Club president confirms Mauricio Pochettino sacking and reveals Christophe Galtier talks","link":"https://www.thesun.co.uk/sport/betting-tips/15086079/psg-manager-next-latest-odds-christophe-galtier-pochettino-sacked/","keywords":["Betting Tips","Betting","Football","Ligue 1"],"creator":["James Anderson"],"video_url":null,"description":"PSG look set to appoint Christophe Galtier as head coach. That’s according to bookmakers Sky Bet after a frenzy of activity in the betting market over the last 48 hours. SKY BET: GET £30 IN FREE BETS* The 55-year-old Frenchman trailed previous frontrunner Zinedine Zidane at 6/1. However, Sky Bet have SLASHED his price to […]","content":"PSG look set to appoint Christophe Galtier as head coach. That’s according to bookmakers Sky Bet after a frenzy of activity in the betting market over the last 48 hours. Christophe Galtier is odds-on favourite for the PSG job, according to Sky BetGETTY SKY BET: GET £30 IN FREE BETS* The 55-year-old Frenchman trailed previous frontrunner Zinedine Zidane at 6/1. However, Sky Bet have SLASHED his price to 1/10 to replace Mauricio Pochettino in Paris. The Athletic claimed that Galtier would be installed within the next week after a compensation deal has been agreed with Nice. And the club’s president Nasser Al-Khelaifi suggested as much this afternoon, and also confirmed the departure of Pochettino. He told Le Parisien: “As for the manager who will embody this project, we have a shortlist of coaches. “We’re in discussions with Nice; that’s no secret. I hope that we reach an agreement soon, but I respect Nice and President Rivere. We’re all defending our own interests.” Pochettino won Ligue 1 by 15 points during his first full season in charge at the Parc des Princes. But he’s been unable to repair the damage of their Champions League last-16 collapse to eventual winners, Real Madrid. PSG next manager Sky Bet odds Christophe Galtier – 1/10 Zinedine Zidane – 6/1 Marcelo Gallardo – 25/1 Ruben Amorim – 25/1 Thiago Motta – 25/1 Antonio Conte – 33/1 Jose Mourinho – 33/1 Julen Lopetegui – 33/1 Roberto Mancini – 33/1 Sergio Conceicao – 33/1 SKY BET: GET £30 IN FREE BETS* PSG recently announced the arrival of Luis Campos, who has joined the club as their new football advisor. Campos will decide which fringe players can leave the club, and who will lead them into the 2022-23 campaign. He worked alongside Galtier before Lille’s Ligue 1 success and wants to be reunited in the French capital. Al-Khelaifi added: “Luis will focus on the first team. We need to explore new directions, and we need to find players who will be proud to come to Paris for the club, for the football and for nothing else.” Zinedine Zidane is next in the market at 6/1. Reports had claimed that a deal was close to being agreed with the club’s owners particularly keen on Zidane. But other reports suggest the 49-year-old’s preference is to manage the French national side when Didier Deschamps exits the role. SKY BET: GET £30 IN FREE BETS* FREE BETS AND SIGN UP DEALS – BEST NEW CUSTOMER OFFERS FOOTBALL OFFERS SUPER DEAL New customers get £30 in FREE BETS when you stake any amount - 18+ T&Cs apply BET BOOST Get £30 in FREE BETS on football, tennis, cricket and golf with William Hill BET BOOST Get Money back as CASH if any of your first five bets lose - 18+ T&Cs apply CASINO DEALS The best casino offers from free spins and bonus cash to no deposit deals Commercial content notice: Taking one of the bookmaker offers featured in this article may result in a payment to The Sun. 18+. T&Cs apply. Begambleaware.org Remember to gamble responsibly A responsible gambler is someone who: Establishes time and monetary limits before playingOnly gambles with money they can afford to loseNever chase their lossesDoesn’t gamble if they’re upset, angry or depressedGamcare – www.gamcare.org.ukGamble Aware – www.begambleaware.org For help with a gambling problem, call the National Gambling Helpline on 0808 8020 133 or go to www.gamstop.co.uk to be excluded from all UK-regulated gambling websites. *New customers only, first single & e/w bet only, 5p minimum stake, 3 x £10 bet tokens. Free bet stakes not included in returns. Free bets exclude virtuals. Free bets are non withdrawable. No free bet expiry. Eligibility restrictions and further T&Cs apply. 18+ begambleaware.Org Most read in Betting Tips WINNER WINNER Win a Mercedes A45s AMG from just 79p with exclusive discount from the Sun BRO BATTLE Armando Broja transfer news: West Ham favourites ahead of Everton and Leeds NEXT STOP Jesse Lingard transfer news: Brighton inch closer after HUGE odds drop overnight BET BOOST Get Liverpool and Man City to win their opening three games at 11/1 with Sky Bet RICH DEAL Tottenham favourites to land Richarlison but Chelsea could 'trump' rivals WING KING Man Utd join race for Rangers ace Kent but Steven Gerrard's Aston Villa lead way","pubDate":"2022-06-22 15:50:00","image_url":null,"source_id":"thesun","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Ravi Shastri behind Virat Kohli's poor form, Pakistan cricketer slams former India coach","link":"https://zeenews.india.com/cricket/ravi-shastri-behind-virat-kohlis-slump-pakistan-cricketer-slams-former-india-coach-2476702.html","keywords":null,"creator":null,"video_url":null,"description":"The former Pakistan cricketer Rashid Latif also said that it was wrong to sideline a player like Anil Kumble and get Ravi Shastri in as head coach of the Indian men's cricket team.","content":"Former India coach Ravi Shastri is the person who is behind the slump in form of former Indian captain Virat Kohli , believes Ex-Pakistan wicketkeeper and batter Rashid Latid. Speaking over his YouTube channel Latif said that he does not know whether Shastri had the accreditation or not to become Team India coach. He said that the decision to appoint him as captain is now backfiring. Kohli has been out of form for some time now. He has not scored a single ton since 2019. His last international century came against Bangladesh in November 2019 in a home Test. Latif feels Shastri's coaching has led to Kohli's bat getting quieter by the year. The former Pakistan cricketer also said that it was wrong to sideline a player like Anil Kumble and get Ravi Shastri in. \"It is because of him (Shastri) that this has happened. In 2019, you sidelined a player like Kumble and in came Ravi Shastri. Whether he had the accreditation or not, I have no idea.\" “He was a broadcaster. Had no business in coaching. Barring Virat Kohli, I am sure there would have been other people who played a role in getting Shastri in. But that is backfiring now, isn’t it? Had he not become the coach, he (Kohli) wouldn’t have gone out (of form),\" Latif said on his channel 'Caught Behind'. Virat eyes 71st international ton The stage is set in Edgbaston for the fifth and last Test of the series vs England. The match starts on July 1 and India are eyeing their first series win since 2007-08. All eyes will be on Kohli, who returns to England in white clothing. It would be fitting to see him come back to form and also complete his long-pending 71st international ton. What would also interests fans is Kohli vs James Anderson clash, this battle within a battle is always talked about since 2014 whenever India and England engage in a Test series.","pubDate":"2022-06-22 15:47:00","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"Jason Roy smashes century as England cruise to Netherlands series whitewash with Eoin Morgan’s future in more doubt","link":"https://www.thesun.co.uk/sport/18971271/england-netherland-roy-century-morgan-doubt/","keywords":["Cricket","Sport"],"creator":["Oscar Paul"],"video_url":null,"description":"ENGLAND cruised to a 3-0 whitewash over the second-rate Netherlands – but doubts continue over skipper Eoin Morgan’s future.  Morgan missed the final ODI with a groin problem, depriving him of the chance to prove he still has it after two ducks against the minnows. Jos Buttler stood in as captain and led England to […]","content":"ENGLAND cruised to a 3-0 whitewash over the second-rate Netherlands – but doubts continue over skipper Eoin Morgan’s future.  Morgan missed the final ODI with a groin problem, depriving him of the chance to prove he still has it after two ducks against the minnows. Jason Roy clubbed his tenth ODI century as England cruised to a 3-0 series whitewash against the NetherlandsGetty Eoin Morgan is under increasing pressure after two ducks in the opening two games against the Netherlands before England cruised to a win without him in the thirdGetty Jos Buttler stood in as captain and led England to an easy eight-wicket victory to go top of the ICC Super League rankings.  Set 245 to win, Jason Roy smashed 101 off 86 balls while Buttler made a classy 86 to see them home after just 30.1 overs.  Focus now turns to the Test arena and New Zealand but there is a packed one-day schedule before the autumn’s T20 World Cup in Australia.  And the white-ball leader’s spot is under more scrutiny than ever given his rotten form and creaking body.  READ MORE SPORT STORIES ORANJE-BOOM! England break their own ODI world record after smashing 498 against Holland FREE BONUS Join Sun Vegas now to get £10 free with no deposit required - offer has paused A legend for life after lifting the 2019 World Cup, his abilities as leader and tactician are not in question.  But Morgan’s batting – just one half-century in his past 65 innings – is of serious concern. Ex-Test captain Joe Root piled on the runs yet couldn’t buy a result – Morgan is leading but being carried by a winning machine. He turns 36 in September and competition in this power-packed outfit is fierce.  Most read in Cricket DOUBLE DUTCH WIN England coast to One Day win against Holland as Morgan struggles again IN THE DOCK Vaughan among FOUR ex-England aces charged by ECB amid Yorkshire racism scandal YOU KEBABING A LAUGH? England fans in stitches at Pope's kebab as team party after NZ win BAIR THRILLS Blistering 77-ball Bairstow ton fires England to one of THE great Test wins BEN'S BATTLE Stokes suffered panic attacks in toilet with England amid mental health fight CRICKET IN MOURNING Australia legend Andrew Symonds, 46, tragically dies after car accident SUN BINGO GET £50 BONUS & 50 FREE SPINS TODAY Jonny Bairstow and Ben Stokes will both come back in, while county smashers Harry Brook and Sam Pain are knocking on the door.  Whether Morgan soldiers on, walks or is pushed remains to be seen.  But in replacement Buttler, 31, England have a natural leader and arguably the best one-day batsman in the world.  Yet after winning the toss in baking Amsterdam he denied England fans the opportunity to see them smash 500 putting by the Dutch into bat.  The mediocre hosts were bowled out in the last over for a modest 244.  But it should have been plenty more given three of the top five reached 50 and they were 203-3 with 10 overs remaining.  David Willey was the pick of the bowlers with 4/36 off eight while 30-year-old Gloucestershire seamer David Payne bagged a late wicket on debut.  Openers Phil Salt and Roy raced to 85 from nine overs before Phil Salt was bowled for 49.  Read More on The Sun 'fix it' Love Island fans beg producers to help after spotting issue with Tasha Ghouri EVERY BODY I'm size 8 & my pal's an 18, we wore the same to show how things look different Paul van Meekeren cleaned Dawid Malan up around his legs two balls later and the Netherlands suddenly had a sniff – until Buttler walked in at four.  He and Roy cantered to half-centuries before both upped the ante with Roy bringing up the century – his 10th in ODIs – off 86 balls before Buttler hit the winning runs next ball with 119 balls to spare.","pubDate":"2022-06-22 15:44:37","image_url":null,"source_id":"thesun","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Cricket-Roy century as England crush Netherlands again","link":"https://www.thestar.com.my/sport/cricket/2022/06/22/cricket-roy-century-as-england-crush-netherlands-again","keywords":null,"creator":null,"video_url":null,"description":"(Reuters) - England completed a 3-0 drubbing of the Netherlands by winning the last match of their ODI series by eight wickets on Wednesday despite the absence of injured captain Eoin Morgan. Read full story","content":null,"pubDate":"2022-06-22 15:44:00","image_url":"https://apicms.thestar.com.my/uploads/images/2022/06/22/1632567.jpg","source_id":"thestar_my","country":["malaysia"],"category":["sports"],"language":"english"},{"title":"Big Bash League में ड्राफ्ट सिस्टम से होगा विदेशी खिलाड़ियों का चयन, 4 कैटेगरी में होंगे प्लेयर्स","link":"https://www.abplive.com/sports/cricket/big-bash-league-introduces-draft-system-to-pick-overseas-players-know-details-2152234","keywords":null,"creator":["ABP Live"],"video_url":null,"description":"<p style=\"text-align: justify;\"><strong>BBL Draft System:</strong> बिग बैश लीग (Big Bash League) में अब विदेशी खिलाड़ियों को ड्ऱाफ्ट सिस्टम (Draft System) से चुना जाएगा. यह ड्राफ्ट सिस्टम (Draft System) अगले संस्करण (Edition) से लागू होगा. इस ड्राफ्ट सिस्टम (Draft System) के तहत सभी टीमों को कम से कम 2 खिलाड़ियों को चुनने होंगे, वहीं ज्यादा से ज्यादा 3 खिलाड़ियों को चुना जा सकता है. ऐसा माना जा रहा है कि इस ड्राफ्ट सिस्टम (Draft System) के लिए अगले कुछ महीनों में नॉमिनेशन (Nomination) शुरू हो जाएगा.</p> <p style=\"text-align: justify;\"><strong>प्लेटिनम समेत 4 कैटेगरी होंगे</strong></p> <p style=\"text-align: justify;\">दरअसल, इस ड्राफ्ट में 4 कैटेगरी होंगे. प्लेटिनम (Platinum), गोल्ड (Gold), सिल्वर (Silver) और ब्रॉन्ज (Bronze) के तौर पर 4 कैटेगरी होंगे. अलग-अलग कैटेगरी में शामिल खिलाड़ियों के प्राइस अलग-अलग होंगे. प्लेटिनम कैटेगरी (Platinum Category) में शामिल खिलाड़ियों की कीमत सबसे ज्यादा होगी. वहीं, ड्राफ्ट ऑर्डर (Draft Order) का फैसला लॉटरी के माध्यम से किया जाएगा. जबकि इसके अलावा सभी टीमों के पास खिलाड़ियों को रिटेन (Retain) करने का विकल्प रहेगा.</p> <p style=\"text-align: justify;\"><strong>फर्स्ट राउंड में शामिल होंगे प्लेटिनम कैटेगरी के खिलाड़ी</strong></p> <p style=\"text-align: justify;\">पहले राउंड में प्लेटिनम कैटेगरी (Platinum Category) में शामिल खिलाड़ी होंगे. सभी बिग बैश टीमों (Big Bash Teams) को कम से कम 2 और ज्यादा से ज्यादा 3 विदेशी खिलाड़ी (Overseas Players)चुनने की अनुमति होगी. इसके अलावा इस लीग में शामिल सभी टीमें ज्यादा से ज्यादा 18 खिलाड़ियों की स्कॉड (Squad) बना सकती है. जिसमें 2-3 विदेशी खिलाड़ी (Overseas Players) होंगे, जबकि बाकी घरेलू खिलाड़ी (Domestic Players) होंगे.</p> <p style=\"text-align: justify;\"><strong>ये भी पढ़ें-</strong></p> <p style=\"text-align: justify;\"><strong><a href=\"https://www.abplive.com/sports/cricket/david-warner-not-unhappy-with-the-series-defeat-against-sri-lanka-2152149\">Sri Lanka के खिलाफ मिली हार से निराश नहीं हैं डेविड वार्नर, आगे की चुनौती के लिए अभी से तैयार</a><br /></strong></p> <p style=\"text-align: justify;\"><strong><a href=\"https://www.abplive.com/sports/cricket/james-anderson-will-be-fit-to-play-against-india-in-final-test-ben-stokes-said-2152201\">IND Vs ENG: क्या भारत के खिलाफ खेलेंगें जेम्स एंडरसन? कप्तान बेन स्टोक्स ने किया यह दावा</a><br /></strong></p>","content":null,"pubDate":"2022-06-22 15:43:40","image_url":null,"source_id":"abplive","country":["india"],"category":["sports"],"language":"hindi"},{"title":"Virat Kohli के खराब फॉर्म के लिए रवि शास्त्री जिम्मेदार, पूर्व पाकिस्तानी दिग्गज का बड़ा बयान","link":"https://www.abplive.com/sports/cricket/former-pakistani-player-rashid-latif-said-that-former-coach-ravi-shastri-is-responsible-for-virat-kohli-s-poor-form-2152277","keywords":null,"creator":["ABP Live"],"video_url":null,"description":"<p style=\"text-align: justify;\"><strong>Rashid Latif On Ravi Shastri:</strong> भारतीय कोच के तौर पर रवि शास्त्री (Ravi Shastri) का कार्यकाल शानदार रहा. पूर्व भारतीय खिलाड़ी को सबसे सफल कोचों में एक माना जाता है. इस बीच पूर्व पाकिस्तानी खिलाड़ी राशिद लतीफ (Rashid Latif) ने रवि शास्त्री (Ravi Shastri) पर निशाना साधा है. दरअसल, उन्होंने पूर्व भारतीय कप्तान विराट कोहली (Virat Kohli) के खराब फॉर्म के लिए रवि शास्त्री (Ravi Shastri) को जिम्मेदार बताया है. राशिद लतीफ के मुताबिक, अगर शास्त्री भारतीय टीम (Indian Team) के हेड कोच (Head Coach) नहीं बनते तो विराट कोहली (Virat Kohli) आउट ऑफ फॉर्म नहीं होते.</p> <p style=\"text-align: justify;\"><strong>'विराट कोहली के खराब फॉर्म के लिए शास्त्री जिम्मेदार'</strong></p> <p style=\"text-align: justify;\">पूर्व पाकिस्तानी विकेटकीपर राशिद लतीफ (Rashid Latif) ने कहा कि रवि शास्त्री (Ravi Shastri) 2017 से 2021 तक भारतीय टीम के मुख्य कोच थे, तब वह भारतीय टीम को कोचिंग देने का कोई काम नहीं करते थे. गौरतलब है कि दिग्गज भारतीय खिलाड़ी विराट कोहली (Virat Kohli) तकरीबन 2 साल से इंटरनेशनल क्रिकेट (International Cricket) में शतक लगाने में नाकाम रहे हैं. वहीं, आईपीएल (IPL) में भी इस बल्लेबाज का प्रदर्शन निराशाजनक रहा है. दरअसल, विराट कोहली (Virat Kohli) ने नवंबर 2019 में आखिरी बार इंटरनेशनल क्रिकेट (International Cricket) में शतक लगाया था.</p> <p style=\"text-align: justify;\"><strong>'रवि शास्त्री को कोच बनाने का फैसला उल्टा पड़ा'</strong></p> <p style=\"text-align: justify;\">राशिद लतीफ (Rashid Latif) ने कहा कि विराट कोहली (Virat Kohli) के खराब फॉर्म के लिए पूर्व कोच रवि शास्त्री (Ravi Shastri) जिम्मेदार हैं. उन्होंने कहा कि आपने अनिल कुंबले (Anil Kumble) जैसे दिग्गज खिलाड़ी को दरकिनार कर दिया और रवि शास्त्री कोच (Ravi Shastri) के तौर पर जिम्मेदारी संभालने आए. उनके पास कोचिंग की मान्यता थी या नहीं, मुझे नहीं पता. उन्होंने आगे कहा कि पूर्व कोच रवि शास्त्री (Ravi Shastri) टीवी प्रेजेंटर थे. कोचिंग का उन्हें कोई अनुभव नहीं था. विराट कोहली (Virat Kohli) को छोड़कर, मुझे यकीन है कि और भी लोग होंगे जिन्होंने शास्त्री को अंदर लाने में भूमिका निभाई होगी लेकिन अब यह उलटा पड़ रहा है.</p> <p style=\"text-align: justify;\"><strong>ये भी पढ़ें-</strong></p> <p style=\"text-align: justify;\"><strong><a href=\"https://www.abplive.com/sports/cricket/james-anderson-will-be-fit-to-play-against-india-in-final-test-ben-stokes-said-2152201\">IND Vs ENG: क्या भारत के खिलाफ खेलेंगें जेम्स एंडरसन? कप्तान बेन स्टोक्स ने किया यह दावा</a><br /></strong></p> <p style=\"text-align: justify;\"><strong><a href=\"https://www.abplive.com/sports/cricket/hardik-pandya-might-be-india-s-captain-for-the-first-t20-against-england-2152258\">England के खिलाफ पहले टी20 में टीम की कमान संभाल सकते हैं हार्दिक पांड्या, जानें क्या है इसकी वजह</a><br /></strong></p>","content":null,"pubDate":"2022-06-22 15:43:29","image_url":null,"source_id":"abplive","country":["india"],"category":["sports"],"language":"hindi"},{"title":"Ganguly's Test Debut: आज ही के दिन सौरव गांगुली ने लॉड्स में किया था टेस्ट डेब्यू, पहले ही मैच में बनाया शानदार शतक","link":"https://www.abplive.com/sports/cricket/on-this-day-sourav-ganguly-cracks-century-at-lord-s-on-test-debut-know-details-2152303","keywords":null,"creator":["ABP Live"],"video_url":null,"description":"<p style=\"text-align: justify;\"><strong>Saurav Ganguly:</strong> आज का दिन भारतीय क्रिकेट (Indian cricket) फैंस के लिए बेहद खास है. दरअसल, आज ही के दिन 26 साल पहले लॉर्ड्स (Lords) के मैदान पर भारतीय टीम (Indian Team) के पूर्व कप्तान और मौजूदा बीसीसीआई अध्यक्ष (BCCI President) सौरव गांगुली (Sourav Ganguly) ने पहली बार अपना दम दिखाया था. वैसे तो सौरव गांगुली (Saurav Ganguly) ने साल 1992 में ही अपना इंटरनेशनल डेब्यू किया था, लेकिन तकरीबन 4 साल तक वह अपनी काबिलियत दिखाने में नाकामयाब रहे.</p> <p style=\"text-align: justify;\"><strong>सौरव गांगुली ने डेब्यू टेस्ट में बनाया शतक</strong></p> <p style=\"text-align: justify;\">भारतीय टीम (Indian Team) साल 1996 में इंग्लैंड दौरे (England Tour) पर गई थी. इस टीम के कप्तान मोहम्मद अजहरूद्दीन (Mohammad Azharuddin) थे. कप्तान मोहम्मद अजहरूद्दीन (Mohammad Azharuddin) ने सौरव गांगुली (Saurav Ganguly) पर अपना भरोसा दिखाया. वहीं, सौरव गांगुली (Saurav Ganguly) ने अपने कप्तान मोहम्मद अजहरूद्दीन (Mohammad Azharuddin) को निराश नहीं किया. उन्होंने अपने टेस्ट में शतक बनाकर क्रिकेट दिग्गजों को खासा प्रभावित किया. सौरव गांगुली (Saurav Ganguly) ने अपनी इस पारी में 301 बॉल पर 20 चौकों की मदद से 131 रन बनाए. इस दौरान दादा तकरीबन 435 मिनट तक क्रीज पर जमे रहे.</p> <p style=\"text-align: justify;\"><strong>भारतीय क्रिकेट के सबसे सफलतम कप्तानों में एक हैं दादा</strong></p> <p style=\"text-align: justify;\">दरअसल, सौरव गांगुली (Saurav Ganguly) ने इस पारी के बाद भारतीय टीम (Indian Team) में अपनी जगह मजबूत कर ली, फिर उन्होंने पीछे मुड़कर नहीं देखा. टेस्ट क्रिकेट (Test Cricket) के अलावा वनडे मैचों में भी सौरव गांगुली (Saurav Ganguly) बेहद सफल रहे. सौरव गांगुली (Saurav Ganguly) साल 2000 में भारतीय क्रिकेट टीम (Indian Cricket Team) के कप्तान बने. उन्होंने वीरेन्द्र सहवाग (Virendra Sehwag), युवराज सिंह (Yuvraj Singh), जहीर खान (Zaheer Khan), मोहम्मद कैफ (Mohammad Kaif) और आशीष नेहरा (Ashish Nehra) जैसे युवा खिलाड़ियों के साथ मिलकर नई टीम बनाई. गौरतलब है कि साल 2003 वर्ल्ड कप (World Cup 2003) में भारतीय टीम सौरव गांगुली (Saurav Ganguly) की कप्तानी में फाइनल (Final) तक पहुंची. हालांकि, फाइनल (Final) में आस्ट्रेलिया (Australia) के खिलाफ भारत को हार का सामना करना पड़ा.</p> <p style=\"text-align: justify;\"><strong>ये भी पढ़ें-</strong></p> <p style=\"text-align: justify;\"><strong><a href=\"https://www.abplive.com/sports/cricket/hardik-pandya-might-be-india-s-captain-for-the-first-t20-against-england-2152258\">England के खिलाफ पहले टी20 में टीम की कमान संभाल सकते हैं हार्दिक पांड्या, जानें क्या है इसकी वजह</a><br /></strong></p> <p style=\"text-align: justify;\"><strong><a href=\"https://www.abplive.com/sports/cricket/david-warner-not-unhappy-with-the-series-defeat-against-sri-lanka-2152149\">Sri Lanka के खिलाफ मिली हार से निराश नहीं हैं डेविड वार्नर, आगे की चुनौती के लिए अभी से तैयार</a><br /></strong></p>","content":null,"pubDate":"2022-06-22 15:43:20","image_url":null,"source_id":"abplive","country":["india"],"category":["sports"],"language":"hindi"},{"title":"India Tour of Ireland: आयरलैंड से कोई टी20 मैच नहीं हारा है भारत, हार्दिक पर इतिहास दोहराने का जिम्मा","link":"https://www.abplive.com/sports/cricket/india-tour-of-ireland-india-has-not-lost-any-t20-match-against-ireland-2152294","keywords":null,"creator":["ABP Live"],"video_url":null,"description":"<p style=\"text-align: justify;\"><strong>India Tour of Ireland:</strong> भारत और आयरलैंड (Ind vs Ireland) के बीच दो टी20 मैचों की सीरीज (T20I Series) 26 जून से खेली जाएगी. दोनों ही देशों ने पहले ही अपनी टीम का ऐलान कर दिया था. भारत की कमान जहां हार्दिक पांड्या (Hardik Pandya) को सौंपी गई है तो वहीं आयरलैंड का जिम्मा एंड्रयू बलबर्नी (Andrew Balbirnie) के कंधों पर है. आईपीएल 2022 (IPL 2022) में हार्दिक ने अपनी कप्तानी में गुजरात टाइटंस (Gujarat Titans) को चैंपियन बनाया था.&nbsp;</p> <p style=\"text-align: justify;\"><strong>भारत का रिकॉर्ड है शानदार</strong><br />टी20 में आयलैंड के खिलाफ भारत का रिकॉर्ड शानदार है. दोनों टीमों के बीच अब तक 3 टी20 मैच हुए हैं और हर बार टीम इंडिया ने आयरिश टीम को मात दी है. पहली बार ये दोनों टीमें 2009 में आमने-सामने आईं थी. भारत ने यह मैच 8 विकेट से जीता था.&nbsp;</p> <p style=\"text-align: justify;\"><strong>हार्दिक पर इतिहास दोहराने का जिम्मा</strong><br />भारत और आयरलैंड के बीच सिर्फ 1 टी20 सीरीज हुई है. इस सीरीज में भारत ने आयरलैंड के घर में जाकर उसका सूपड़ा साफ किया था. सीरीज के दोनों मैच डबलिन में खेले गए थे. इस बार भी दोनों मैच इसी मैदान पर होने हैं. हार्दिक पांड्या के ऊपर दोनों मैच जीतकर इतिहास दोहराने की जिम्मेदारी होगी.&nbsp;</p> <ul> <li style=\"text-align: justify;\">पहला टी20 मैच: 26 जून, डबलिन</li> <li style=\"text-align: justify;\">दूसरा टी20 मैच: 28 जून, डबलिन</li> </ul> <p style=\"text-align: justify;\"><strong>दोनों टीमें इस प्रकार हैं</strong></p> <ul> <li style=\"text-align: justify;\"><strong>भारतीय टीम:</strong> हार्दिक पांड्या (कप्तान), भुवनेश्वर कुमार (उपकप्तान), ऋतुराज गायकवाड़, इशान किशन, सूर्यकुमार यादव, संजू सैमसन, राहुल त्रिपाठी, दीपक हुड्डा, वेंकटेश्वर अय्यर, अक्षर पटेल, दिनेश कार्तिक (विकेटकीपर), आवेश खान, हर्षल पटेल, उमरान मलिक, अर्शदीप सिंह, युजवेंद्र चहल और रवि बिश्नोई.</li> <li style=\"text-align: justify;\"><strong>आयरलैंड टीम:</strong> एंड्रयू बालबर्नी (कप्तान), मार्क अडायर, कर्टिस कैंपर, गैरेथ डेलानी, जॉर्ज डॉकरेल, स्टीफन डोहेनी, जोश लिटिल, एंड्रयू मैकब्राइन, बैरी मैकार्थी, कॉनर ओल्फर्ट, पॉल स्टर्लिंग, हैरी टेक्टर, लोर्कन टकर और क्रेग यंग.</li> </ul> <p style=\"text-align: justify;\"><strong>ये भी पढ़ें...</strong></p> <p style=\"text-align: justify;\"><strong><a href=\"https://www.abplive.com/sports/cricket/england-playing-11-for-the-third-test-against-new-zealand-overton-to-debut-2152121\">England Playing 11: इंग्लैंड ने तीसरे टेस्ट के लिए प्लेइंग 11 घोषित की, एंडरसन के स्थान पर यह खिलाड़ी करेगा डेब्यू</a></strong></p> <p style=\"text-align: justify;\"><strong><a href=\"https://www.abplive.com/sports/cricket/icc-test-all-rounder-ranking-shakib-reached-second-place-leaving-behind-ashwin-holder-and-stokes-jadeja-reign-continues-2152076\">ICC Test All Rounder Ranking: अश्विन-होल्डर और स्टोक्स को पीछे छोड़ दूसरे नंबर पर पहुंचे शाकिब, जडेजा की बादशाहत कायम</a></strong></p>","content":null,"pubDate":"2022-06-22 15:40:17","image_url":null,"source_id":"abplive","country":["india"],"category":["sports"],"language":"hindi"},{"title":"Vijay Mallya ने Chris Gayle गेल के साथ शेयर की तस्वीर, सोशल मीडिया यूजर्स ने कर दिया ट्रोल","link":"https://www.abplive.com/sports/cricket/vijay-mallya-viral-photo-with-chris-gayle-on-social-media-twitter-fans-troll-2152251","keywords":null,"creator":["ABP Live"],"video_url":null,"description":"<p style=\"text-align: justify;\"><strong>Vijay Mallya updates:</strong> दिग्गज क्रिकेटर क्रिस गेल (Chris Gayle) की एक तस्वीर आज सोशल मीडिया पर तेजी से वायरल हो रही है. इस तस्वीर में वह भगोड़ा कारोबारी विजय माल्या (Vijay Mallya) के साथ नजर आ रहे हैं. रॉयल चैलेंजर्स बैंगलोर (RCB) के पूर्व मालिक विजय माल्या ने गेल के साथ सोशल मीडिया पर तस्वीर शेयर की है. इसके बाद से ही माल्या और गेल सोशल मीडिया पर ट्रोल हो रहे हैं. माल्या ने पोस्ट में गेल को अपना अच्छा दोस्त बताया है.</p> <p style=\"text-align: justify;\"><strong>ट्वीट में कही ये बात</strong><br />माल्या ने अपने ट्वीट में लिखा- मेरे अच्छे दोस्त क्रिस्टोफर हेनरी गेल, यूनिवर्स बॉस के साथ मुलाकात शानदार रही. जब मैंने उन्हें आरसीबी टीम के लिए खरीदा था तब से हमारी अच्छी बहुत अच्छी है, 'सुपर फ्रेंडशिप'. किसी खिलाड़ी की अब तक की सबसे अच्छी खरीद.</p> <blockquote class=\"twitter-tweet\"> <p dir=\"ltr\" lang=\"en\">Great to catch up with my good friend Christopher Henry Gayle ⁦<a href=\"https://twitter.com/henrygayle?ref_src=twsrc%5Etfw\">@henrygayle</a>⁩ , the Universe Boss. Super friendship since I recruited him for RCB. Best acquisition of a player ever. <a href=\"https://t.co/X5Ny9d6n6t\">pic.twitter.com/X5Ny9d6n6t</a></p> &mdash; Vijay Mallya (@TheVijayMallya) <a href=\"https://twitter.com/TheVijayMallya/status/1539402382022410240?ref_src=twsrc%5Etfw\">June 22, 2022</a></blockquote> <p> <script src=\"https://platform.twitter.com/widgets.js\" async=\"\" charset=\"utf-8\"></script> </p> <p style=\"text-align: justify;\"><strong>यूजर्स कर रहे हैं ट्रोल</strong><br />विजय माल्या के इस ट्वीट पर 63 हजार से ज्यादा लाइक्स और कई कमेंट्स आ चुके हैं. सोशल मीडिया यूजर्स दोनों को ही ट्रोल कर रहे हैं. इसके अलावा ये ट्वीट 2800 से ज्यादा री-ट्वीट भी हो चुका है. माल्या की इस पोस्ट पर एक यूजर ने लिखा, क्यों भाई गेल तुझे भी लूटके भागना है? &nbsp;वहीं एक अन्य यूजर ने लिखा- आज तो बैंक हॉलीडे भी नहीं है.</p> <p style=\"text-align: justify;\"><strong>भागना ही है तो ओलंपिक में भागो</strong><br />एक सोशल मीडिया यूजर ने इस तस्वीर पर लिखा- सर कभी अपने दूसरे दोस्त एसबीआई (SBI) को भी याद कर लो. आपकी याद में परेशान है. एक और यूजर ने लिखा- भागना ही है तो ओलंपिक में भागो, इससे भारत का नाम होगा, इस तरह भागने का क्या मतलब है. वहीं तीसरे यूजर ने लिखा- घर आ जाओ और पैसे वापस कर दो, तुम्हें शर्म भी नहीं आती पैसा लेकर बैठे हो.</p> <p style=\"text-align: justify;\"><strong>ये भी पढ़ें...</strong></p> <p style=\"text-align: justify;\"><strong><a href=\"https://www.abplive.com/sports/cricket/ms-dhoni-kollywood-debut-csk-skipper-ms-dhoni-to-star-and-produce-thalapathy-vijay-starter-under-his-production-banner-2152054\">MS Dhoni Kollywood Debut: फिल्मों में एंट्री को तैयार माही, थलापति विजय के साथ आएंगे नजर!</a></strong></p> <p style=\"text-align: justify;\"><strong><a href=\"https://www.abplive.com/sports/cricket/ishan-kishan-only-indian-batter-in-top-10-of-icc-t20-rankings-2152049\">ICC T20 Rankings: टॉप 10 में अकेले भारतीय बल्लेबाज हैं ईशान किशन, इस साल बनाए हैं सबसे ज्यादा रन</a></strong></p>","content":null,"pubDate":"2022-06-22 15:40:10","image_url":null,"source_id":"abplive","country":["india"],"category":["sports"],"language":"hindi"},{"title":"'A dangerous message' - Knight hits back in defence of women's Tests","link":"https://www.skysports.com/cricket/news/12040/12638624/england-captain-heather-knight-unhappy-with-greg-barclays-dangerous-message-over-womens-tests","keywords":null,"creator":null,"video_url":null,"description":"England captain Heather Knight has described International Cricket Council (ICC) chair Greg Barclay's comments questioning the future of women's Test cricket as a \"dangerous message\".","content":"Last Updated: 22/06/22 5:05pm England captain Heather Knight has described International Cricket Council (ICC) chair Greg Barclay's comments questioning the future of women's Test cricket as a \"dangerous message\". Barclay said in an interview earlier this month that he did not see women's Test cricket \"evolving at any particular speed\" or consider it being \"part of the landscape moving forward to any real extent at all\". But Knight, speaking before Monday's LV= Insurance women's Test against South Africa in Taunton, said: \"Those comments made me sad. As a player I want to play Test cricket, it is seen by a lot of people as the pinnacle. \"It is marketed as the pinnacle and seen as the best and most challenging form of the game, which I definitely agree with. \"It's probably not a great message from the ICC, or the comments from Greg, that suggested women shouldn't be playing it. \"I think it's quite a dangerous message to send that women shouldn't be playing what is seen as the pinnacle of the game. I'm sure it wasn't that well thought through. \"We shouldn't limit what women's cricket should be, and can do. \"With the right conditions and the right players, as you saw in Canberra (when England played Australia last winter), women's Test match cricket can be really exciting and a great spectacle.\" England's last Test, against Australia in January, ended in a thrilling draw that went down to the final ball of the match. But only England, Australia and India have played women's Tests in the past seven years, with South Africa's previous match coming in 2014. Women's Tests are played over four days as opposed to five in the men's game, and the five Test matches that have been played since 2017 have all ended in a draw. The solitary four-day Test is the start of a multi-format series, with three one-day internationals and three Twenty20 matches to follow. Knight said: \"I certainly think there's scope for Test cricket. \"It's worked really well as part of a multi-format series. It keeps women's Test match cricket alive, and as players we get to learn our craft a little bit. \"We don't play any multi-format cricket in domestic stuff. You're kind of learning on the job, particularly the players coming in, as the skills need to be a bit different for white-ball cricket. Please use Chrome browser for a more accessible video player \"T20 cricket in the women's game has grown and developed commercially. But there's room for white-ball cricket and the purest form of the game.\" It is 14 years since England last played a Test match without Anya Shrubsole or Katherine Brunt in their attack. Shrubsole ended her international career in April and long-time new-ball partner Brunt quit the longest format this month to focus on the white-ball game . Uncapped seamers Emily Arlott and Lauren Bell form part of a 13-strong squad, which includes other fresh faces in fast-medium bowler Freya Davies, all-rounder Alice Davidson-Richards and opening batter Emma Lamb. \"They're certainly going to leave some holes in the team,\" Knight said of the double loss of Shrubsole and Brunt. \"But what a chance for some of the young players. We've got some top young talent coming through, it's a chance for them to put their mark on Test cricket and show they deserve the chance to take on the mantle. \"It feels the professional system is more embedded now and I've seen the depth and skill level improve. \"The way we approached that game in Canberra was exactly the way I want us to approach the game next week. \"As batters and bowlers I want us to take the game forward at every opportunity we've got.\"","pubDate":"2022-06-22 15:38:00","image_url":"https://e2.365dm.com/22/03/1920x1080/skysports-heather-knight-england_5700646.jpg?20220309224256","source_id":"skysports","country":["united states of america","united kingdom","australia"],"category":["sports"],"language":"english"},{"title":"PAK vs SL 2022: श्रीलंकाई दौरे के लिए इस दिग्गज गेंदबाज की पाकिस्तानी टीम में वापसी, बाबर आजम होंगे कप्तान","link":"https://www.abplive.com/sports/cricket/leg-spinner-yasir-shah-has-returned-to-the-pakistan-team-for-the-test-series-against-sri-lanka-2152193","keywords":null,"creator":["ABP Live"],"video_url":null,"description":"<p style=\"text-align: justify;\"><strong>Yasir Shah:</strong> पाकिस्तानी लेग स्पिनर यासिर शाह (Yasir Shah) की राष्ट्रीय टीम (National Team) में वापसी हुई है. दरअसल, पाकिस्तानी टीम श्रीलंका के दौरे पर जाएगी. इस दौरे पर मेहमान टीम 2 टेस्ट मैच खेलेगी. 36 वर्षीय लेग स्पिनर यासिर शाह (Yasir Shah) को 18 सदस्यीय टीम में शामिल किया गया है. इसके ऑलराउंडर मोहम्मद नवाज (Mohammad Nawaj) को भी टीम में शामिल किया गया है. इससे पहले आस्ट्रेलिया (Australia) के खिलाफ सीरीज में ऑलराउंडर मोहम्मद नवाज (Mohammad Nawaj) को शामिल किया गया था, लेकिन चोट के कारण वह उस सीरीज में नहीं खेल पाए थे. वहीं, अनकैप्ड खिलाड़ी सलमान अली आगा (Salman Ali Agha) को भी शामिल किया गया है.</p> <p style=\"text-align: justify;\"><strong>पाकिस्तानी टीम में यासिर शाह की वापसी</strong></p> <p style=\"text-align: justify;\">यासिर शाह (Yasir Shah) ने अगस्त 2021 में अपना आखिरी टेस्ट खेला था. पाकिस्तान (Pakistan) ने साल 2015 में श्रीलंकाई सरजमीं पर सीरीज अपने नाम किया था. उस सीरीज में यासिर शाह (Yasir Shah) ने शानदार प्रदर्शन किया था. उन्होंने श्रीलंका के खिलाफ उस सीरीज में 19.33 की औसत से 24 विकेट लिए थे. पाकिस्तान के चीफ सेलेक्टर मोहम्मद वसीम (Mohammad Wasim) ने कहा कि यासिर शाह (Yasir Shah) की वापसी से हमारी स्पिन बॉलिंग मजबूत हुई है. श्रीलंका के पिछले दौरे पर वह हमारे लिए मैच विनर (Match Winner) साबित हुए थे.</p> <p style=\"text-align: justify;\"><strong>श्रीलंका दौरे के लिए पाकिस्तानी टीम</strong><br />बाबर आजम (कप्तान), मोहम्मद रिजवान (उप कप्तान), अब्दुला शफीक, अजहर अली, फहीम अशरफ, फवाद आलम, हारिस राउफ, हसन अली, इमाम उल हक, मोहम्मद नवाज, नुमन अली, सलमान अली आघा, सरफराज अहमद (विकेटकीपर), साउद शकील, शाहीन अफरीदी, शान मसूद, यासिर शाह</p> <p style=\"text-align: justify;\"><strong>ये भी पढ़ें-</strong></p> <p style=\"text-align: justify;\"><strong><a href=\"https://www.abplive.com/sports/cricket/icc-test-all-rounder-ranking-shakib-reached-second-place-leaving-behind-ashwin-holder-and-stokes-jadeja-reign-continues-2152076\">ICC Test All Rounder Ranking: अश्विन-होल्डर और स्टोक्स को पीछे छोड़ दूसरे नंबर पर पहुंचे शाकिब, जडेजा की बादशाहत कायम</a><br /></strong></p> <p style=\"text-align: justify;\"><strong><a href=\"https://www.abplive.com/sports/cricket/david-warner-not-unhappy-with-the-series-defeat-against-sri-lanka-2152149\">Sri Lanka के खिलाफ मिली हार से निराश नहीं हैं डेविड वार्नर, आगे की चुनौती के लिए अभी से तैयार</a><br /></strong></p>","content":null,"pubDate":"2022-06-22 15:37:58","image_url":null,"source_id":"abplive","country":["india"],"category":["sports"],"language":"hindi"},{"title":"The 6IXTY format: What is The 6IXTY? Rules and start date of SIXTY league","link":"https://thesportsrush.com/cricket-news-the-6ixty-format-what-is-the-6ixty-rules-and-start-date-of-sixty-league/","keywords":["Cricket","Caribbean Premier League","CPL","West Indies"],"creator":["Gurpreet Singh"],"video_url":null,"description":"The 6IXTY format: Cricket West Indies are set to introduce the inaugural edition of a new 60-ball tournament in a couple of months. Although debatable, but the entertainment quotient in the game of Cricket these days have become inversely proportional to the duration of each of these matches. The investment in new innovative formats perhaps… The post The 6IXTY format: What is The 6IXTY? Rules and start date of SIXTY league appeared first on The SportsRush.","content":"The 6IXTY format: Cricket West Indies are set to introduce the inaugural edition of a new 60-ball tournament in a couple of months. Although debatable, but the entertainment quotient in the game of Cricket these days have become inversely proportional to the duration of each of these matches. The investment in new innovative formats perhaps suggest that this might be the way forward as far as the franchise-based leagues are concerned. Thus, after the successful introduction of the various T20 leagues by Cricket boards across the world, innovative formats like the T10 league and ‘The Hundred’ followed suit as well. Now, the West Indies board along with the organizers of the Caribbean Premier League (CPL) are all set to commence with what is known as ‘The 6IXTY’ – a brand new 60-ball tournament with some interesting twists, which will be played amongst the men’s and women’s CPL franchise teams. The debut season of ‘The 6IXTY’ is slated to be played between August 24 and August 28 this year, with the present six men’s CPL franchise and the newly announced three women’s CPL franchises to be the partaking teams. As the name suggests, 60 legal deliveries would be bowled in each innings, with the cushion of only 6 wickets available with each team. But, this is just the tip of an iceberg. While each team will be granted the two Powerplay Overs, if the batting side manages to hit a couple of Sixes in the first 12 deliveries of the innings, an extra Powerplay Over gets activated as a bonus. Additionally, the bowling teams would bowl 30 deliveries from one end, and then the remaining 30 from the other end, with the swapping of ends to not take place after each Over (comprising six balls). Moreover, if the fielding team fails to bowl out the Overs within 45 minutes, a fielder will be removed for the final over of the innings as the slow Over rate penalty. A bit ambiguous as of now, there is also a concept of the ‘mystery free hit’, which would be awarded randomly by the fans via a voting system during any time in the innings. Legendary Windies batter Chris Gayle has been appointed the brand ambassador of ‘The 6IXTY’. The 6IXTY IS HERE!🙌 Welcome to Cricket’s Power Game – the world’s newest and most exciting format! @6ixtycricket #The6ixty pic.twitter.com/I5G1gKMyiE — Windies Cricket (@windiescricket) June 22, 2022 For more Cricket-related news, click here.","pubDate":"2022-06-22 15:35:22","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Chelsea striker targets – latest transfer odds: Bookies reveal full list of forwards who could replace Romelu Lukaku","link":"https://www.thesun.co.uk/sport/betting-tips/18968100/chelsea-transfer-news-striker-targets-betfair-gossip-latest-odds/","keywords":["Betting Tips","Betfair","Betting","Football"],"creator":["James Anderson"],"video_url":null,"description":"CHELSEA are looking for attacking reinforcements after the departure of Romelu Lukaku. And bookmakers Betfair have revealed WHO are the most likely arrivals to replace the Belgium international at Stamford Bridge. BETFAIR: GET £30 IN FREE BETS* The Blues signed the 29-year-old from Inter Milan for £97.5million in August 2021, but he’s heading back to […]","content":"CHELSEA are looking for attacking reinforcements after the departure of Romelu Lukaku. And bookmakers Betfair have revealed WHO are the most likely arrivals to replace the Belgium international at Stamford Bridge. GETTYOusmane Dembele is Chelsea’s most likely summer arrival, according to Betfair[/caption] BETFAIR: GET £30 IN FREE BETS* The Blues signed the 29-year-old from Inter Milan for £97.5million in August 2021, but he’s heading back to the Serie A heavyweights having struggled last season. Lukaku scored 15 goals in all competitions for Chelsea but registered just three in the final 15 Premier League matches. His departure leaves manager Thomas Tuchel with 20-year-old Armando Broja and Timo Werner as his striker options. The Blues, now owned by Todd Boehly, could be set to make a splash in the transfer market and a forward is their top priority. Betfair think that Barcelona’s Ousmane Dembele is the most likely signing at odds of 8/15. The French winger will be available on a free transfer in just over a week with his contract set to expire. Spanish publication Sport claim he’s got an offer on the table from Xavi’s side, but Tuchel is a big admirer of the 25-year-old. Chelsea striker targets -- latest odds Betfair odds Ousmane Dembele – 8/15 Raheem Sterling – 4/6 Richarlison – 5/2 Gabriel Jesus – 5/1 Raphinha – 6/1 Eden Hazard – 6/1 Neymar – 8/1 Robert Lewandowski – 10/1 Harry Kane – 14/1 Alvaro Morata – 14/1 Riyad Mahrez – 16/1 Maxwel Cornet – 16/1 Jarrod Bowen – 20/1 Serge Gnabry – 22/1 Gareth Bale – 25/1 Cristiano Ronaldo – 25/1 Ivan Toney – 25/1 Dominic Calvert-Lewin – 33/1 Mohamed Salah – 33/1 Paulo Dybala – 33/1 BETFAIR: GET £30 IN FREE BETS* Manchester City’s Raheem Sterling is also odds-on to join Chelsea this summer at 4/6. Sterling, 27, has scored 131 goals and provided 95 assists in 339 appearances since joining from Liverpool for £57million in 2015. But his days alongside Pep Guardiola could be numbered with his deal set to expire in June 2023. Richarlison is offered at 5/2. The Everton superstar has made his feelings clear that he’s looking for a new challenge but the Toffees are holding out for a whopping £70million. Arsenal target Gabriel Jesus is 5/1 with City reportedly prepared to offload him after the arrivals of Erling Haaland and River Plate prospect Julian Alvarez. Raphinha and Eden Hazard are locked together at 6/1, while PSG’s Neymar is further behind at 8s. Genuine centre-forwards Robert Lewandowski (10/1), Harry Kane (14/1) and Alvaro Morata (14/1) follow next, while free agent Gareth Bale is also considered a possibility at 25/1. BETFAIR: GET £30 IN FREE BETS* FREE BETS AND SIGN UP DEALS – BEST NEW CUSTOMER OFFERS FOOTBALL OFFERS SUPER DEAL New customers get £30 in FREE BETS when you stake any amount - 18+ T&Cs apply BET BOOST Get £30 in FREE BETS on football, tennis, cricket and golf with William Hill BET BOOST Get Money back as CASH if any of your first five bets lose - 18+ T&Cs apply CASINO DEALS The best casino offers from free spins and bonus cash to no deposit deals Commercial content notice: Taking one of the bookmaker offers featured in this article may result in a payment to The Sun. 18+. T&Cs apply. Begambleaware.org Remember to gamble responsibly A responsible gambler is someone who: Establishes time and monetary limits before playingOnly gambles with money they can afford to loseNever chase their lossesDoesn’t gamble if they’re upset, angry or depressedGamcare – www.gamcare.org.ukGamble Aware – www.begambleaware.org For help with a gambling problem, call the National Gambling Helpline on 0808 8020 133 or go to www.gamstop.co.uk to be excluded from all UK-regulated gambling websites. *Place a min £10 bet on the Sportsbook on odds of min 1/2 (1.5), get £30 in Free Bets. Rewards valid for 30 days. SMS verification required. Only deposits via cards will qualify. T&Cs apply. Please Gamble Responsibly 18+ begambleaware.org Most read in Betting Tips WINNER WINNER Win a Mercedes A45s AMG from just 79p with exclusive discount from the Sun NEXT STOP Jesse Lingard transfer news: Brighton inch closer after HUGE odds drop overnight BET BOOST Get Liverpool and Man City to win their opening three games at 11/1 with Sky Bet RICH DEAL Tottenham favourites to land Richarlison but Chelsea could 'trump' rivals WING KING Man Utd join race for Rangers ace Kent but Steven Gerrard's Aston Villa lead way TOP TIER PSG next manager news - latest odds: Galtier set to replace Pochettino this week","pubDate":"2022-06-22 15:31:04","image_url":null,"source_id":"thesun","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Arsenal transfer news – latest odds: Gabriel Jesus likely but Raphinha, Gnabry and Calvert-Lewin all attacking options","link":"https://www.thesun.co.uk/sport/betting-tips/18969740/arsenal-transfer-news-latest-jesus-raphinha-gnabry-calvert-lewin/","keywords":["Betting Tips","Arsenal transfer news","Football","Premier League"],"creator":["Craig Mahood"],"video_url":null,"description":"ARSENAL’S summer rebuild is already well underway as preparations continue for the new season. They recently added attacking midfielder Fabio Viera to their ranks for over £30million after signing youngster Marquinhos from Brazil. SKY BET: GET £30 IN FREE BETS* Eddie Nketiah has agreed a new long-term contract to continue to lead the line as […]","content":"ARSENAL’S summer rebuild is already well underway as preparations continue for the new season. They recently added attacking midfielder Fabio Viera to their ranks for over £30million after signing youngster Marquinhos from Brazil. Arsenal boss Mikel Arteta SKY BET: GET £30 IN FREE BETS* Eddie Nketiah has agreed a new long-term contract to continue to lead the line as he did towards the end of last season. But with Alexandre Lacazette and Pierre-Emerick Aubameyang leaving in the past few months, there remains a gap for another attacking option. We look at who Mikel Arteta could sign this summer, with the help of odds from Sky Bet. Gabriel Jesus 1/5 Has seemed a move that is inevitable for a period of time now. Was linked with the switch towards end of the season as he found himself out the Manchester City team despite there being no striker. Erling Haaland’s arrival will only hamper his game time and negotiations are reported to be at the ‘very advanced’ stage, with Spurs and PSG circling. Raphinha 5/6 Was strongly linked with Barcelona towards end of campaign. Very likely he will leave Leeds this summer after helping them stay in division last season. Arsenal odds have tumbled as the window has gone on and he’s now odds-on to head for the Emirates. Serge Gnabry 3/1 A former Gooner who is going into the final year of his Bayern Munich contract. The arrival of Sadio Mane puts his limited game time in jeopardy, with Kicker reporting he is set to be on the move. Real Madrid are favourites to sign him as Bayern look set to cash in but Arsenal could make the move to bring him home. Former Arsenal star Serge Gnabry Dominic Calvert-Lewin 9/2 Probably the toughest season of his career to date last term but returned to help Everton stay up. Everton are in need of a rebuild and could offload the centre-forward who has an England spot to compete for. Has been tipped with a move to Newcastle but a big target man could be the way to go for the Gunners. Alvaro Morata 7/1 Not likely to have a future at Atletico Madrid and being eyed by Juventus to make a return. But Italian reports linked Arsenal with a move for the Spanish international. May want to right some wrongs from his previous London spell. Arsenal's attacking options Sky Bet odds Gabriel Jesus 1/5 Raphinha 5/6 Serge Gnabry 3/1 Dominic Calvert-Lewin 9/2 Alvaro Morata 7/1 Ivan Toney 8/1 Marcus Rashford 9/1 Ollie Watkins 10/1 Eden Hazard 10/1 Jarrod Bowen 10/1 Riyad Mahrez 20/1 SKY BET: GET £30 IN FREE BETS* Ivan Toney 8/1 Made the seamless step up from League One to Championship and then again to Premier League. He managed 12 Premier League goals in his debut top flight season for the Bees. Another who is a much shorter price with Sky Bet to join Newcastle but would offer a different option. Marcus Rashford 9/1 Has struggled in a poor Manchester United team but hopefully on the mend to full fitness. Doesn’t appear to be in any great rush to leave Old Trafford, nor being pushed out. World Cup spot at serious risk and needs a big start to season. Ollie Watkins 10/1 Has shone at Aston Villa and proved valuable enough to earn an England call-up. Eleven league goals last season after 14 the year before but still has three years on his Villa deal. West Ham understood to be interested too. Villa and England star Ollie Watkins Eden Hazard 10/1 Barely featured for Real Madrid after his move from Chelsea. A couple of years left on his Bernabeu contract but could angle for more game time. Chelsea favourites to re-sign him but one to watch this summer. Jarrod Bowen 10/1 Shot to prominence after stunning West Ham campaign. Now an England international and has been linked to Liverpool after last season’s exploits. Likely to command big money but Arsenal are favourites at the 10/1. Riyad Mahrez 20/1 Another right winger who is probably unlikely to leave. A big part of the Man City success but heading into the final year of his City contract. A huge price with Sky Bet to head south to London. SKY BET: GET £30 IN FREE BETS* FREE BETS AND SIGN UP DEALS – BEST NEW CUSTOMER OFFERS FOOTBALL OFFERS SUPER DEAL New customers get £30 in FREE BETS when you stake any amount - 18+ T&Cs apply BET BOOST Get £30 in FREE BETS on football, tennis, cricket and golf with William Hill BET BOOST Get Money back as CASH if any of your first five bets lose - 18+ T&Cs apply CASINO DEALS The best casino offers from free spins and bonus cash to no deposit deals Commercial content notice: Taking one of the bookmaker offers featured in this article may result in a payment to The Sun. 18+. T&Cs apply. Begambleaware.org Remember to gamble responsibly A responsible gambler is someone who: Establishes time and monetary limits before playingOnly gambles with money they can afford to loseNever chase their lossesDoesn’t gamble if they’re upset, angry or depressedGamcare – www.gamcare.org.ukGamble Aware – www.begambleaware.org *New customers only, first single & e/w bet only, 5p minimum stake, 3 x £10 bet tokens. Free bet stakes not included in returns. Free bets exclude virtuals. Free bets are non withdrawable. No free bet expiry. Eligibility restrictions and further t&cs apply. 18+ begambleaware.Org Most read in Betting Tips WINNER WINNER Win a Mercedes A45s AMG from just 79p with exclusive discount from the Sun NEXT STOP Jesse Lingard transfer news: Brighton inch closer after HUGE odds drop overnight BET BOOST Get Liverpool and Man City to win their opening three games at 11/1 with Sky Bet RICH DEAL Tottenham favourites to land Richarlison but Chelsea could 'trump' rivals WING KING Man Utd join race for Rangers ace Kent but Steven Gerrard's Aston Villa lead way TOP TIER PSG next manager news - latest odds: Galtier set to replace Pochettino this week","pubDate":"2022-06-22 15:27:28","image_url":null,"source_id":"thesun","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Boria Majumdar के साथ विवाद पर बोले रिद्धिमान साहा- अगर उस शख्स को गलती पर अफसोस नहीं तो फिर चुप कैसे रहूं?","link":"https://www.abplive.com/sports/cricket/indian-wicket-keeper-batsman-wriddhiman-saha-said-that-journalist-boria-majumdar-does-not-regret-his-mistake-2152110","keywords":null,"creator":["ABP Live"],"video_url":null,"description":"<p style=\"text-align: justify;\"><strong>Wriddhiman Saha On Boria Majumdar:</strong> भारतीय विकेटकीपर बल्लेबाज रिद्धिमान साहा (Wriddhiman Saha) ने इस साल 19 फरवरी के दिन ट्विटर (Twitter) पर एक स्क्रीनशॉट शेयर किया. इस ट्वीट में भारतीय क्रिकेटर ने कहा कि पत्रकार बोरिया मजूमदार (Boria Majumdar) वाट्सअप्प चैट (Whatsapp Chat) के दौरान गलत भाषाओं का प्रयोग कर रहे हैं. उन्होंने पत्रकार बोरिया मजूमदार (Boria Majumdar) के साथ वाट्सअप्प चैट (Whatsapp Chat) का स्क्रीनशॉट (Screen Shot) ट्विटर (Twitter) पर शेयर किया. दरअसल, भारतीय खिलाड़ी ने कहा कि बोरिया मजूमदार (Boria Majumdar) ने उन्हें इंटरव्यू (Interview) देने के लिए कहा, लेकिन जब वह तैयार नहीं हुए तो उन्होंने कहा कि यह मेरा व्यक्तिगत अपमान है और भविष्य में तुम्हारा इंटरव्यू (Interview) कभी नहीं करूंगा.</p> <p style=\"text-align: justify;\"><strong>'बोरिया मजूमदार ने पहले भी कई बार ऐसा किया'</strong></p> <p style=\"text-align: justify;\">भारतीय क्रिकेटर रिद्धिमान साहा (Wriddhiman Saha) के आरोप के बाद बीसीसीआई (BCCI) ने पत्रकार बोरिया मजूमदार (Boria Majumdar) को 2 साल के लिए बैन कर दिया. अब इस मामले पर तकरीबन 4 साल बाद रिद्धिमान साहा (Wriddhiman Saha) ने बड़ा बयान दिया है. उन्होंने कहा कि दरअसल, यह कोई पहली बार नहीं था, जब पत्रकार बोरिया मजूमदार (Boria Majumdar) ने उनके साथ ऐसा किया हो. इससे पहले भी वह कई बार ऐसा कर चुके हैं. साहा ने आगे कहा कि मेरा मकसद यह दिखाना था कि एक पत्रकार इंटरव्यू के लिए क्या कुछ कर सकता है. उन्होंने मेरे साथ पहले भी ऐसा किया है.</p> <p style=\"text-align: justify;\"><strong>'बोरिया मजूमदार को अपनी गलती पर अफसोस नहीं'</strong></p> <p style=\"text-align: justify;\">रिद्धिमान साहा (Wriddhiman Saha) ने कहा कि पत्रकार बोरिया मजूमदार (Boria Majumdar) ने मेरे साथ पहले भी ऐसा किया, लेकिन मैं उस वक्त बीसीसीआई (BCCI) के साथ कॉन्ट्रेक्ट (Contract) में था, इस वजह से मैंने कोई कदम उठाना उचित नहीं समझा. उन्होंने कहा कि बीसीसीआई (BCCI) ने बोरिया मजूमदार (Boria Majumdar) मामले पर कमिटी से जांच करवाई और सजा सुनाई, यह शानदार फैसला है. रिद्धिमान साहा (Wriddhiman Saha) ने कहा कि इस विवाद के बाद भी पत्रकार बोरिया मजूमदार (Boria Majumdar) को किसी तरह का कोई अफसोस नहीं है.</p> <p style=\"text-align: justify;\"><strong>ये भी पढ़ें-</strong></p> <p style=\"text-align: justify;\"><strong><a href=\"https://www.abplive.com/sports/cricket/sunil-gavaskar-made-big-prediction-about-dinesh-karthik-t20-world-cup-team-know-what-he-said-2152043\">Dinesh Karthik के टी20 विश्व कप टीम में शामिल होने को लेकर Sunil Gavaskar ने की बड़ी भविष्यवाणी, जानिए क्या कहा</a><br /></strong></p> <p style=\"text-align: justify;\"><strong><a href=\"https://www.abplive.com/sports/cricket/icc-test-all-rounder-ranking-shakib-reached-second-place-leaving-behind-ashwin-holder-and-stokes-jadeja-reign-continues-2152076\">ICC Test All Rounder Ranking: अश्विन-होल्डर और स्टोक्स को पीछे छोड़ दूसरे नंबर पर पहुंचे शाकिब, जडेजा की बादशाहत कायम</a><br /></strong></p>","content":null,"pubDate":"2022-06-22 15:22:07","image_url":null,"source_id":"abplive","country":["india"],"category":["sports"],"language":"hindi"}]}