{"newsArray":[{"title":"“Should not create dispute over this…”: Rajeev Shukla on Shubman Gill’s dismissal in WTC","link":"https://thenewsmill.com/2023/06/should-not-create-dispute-over-this-rajeev-shukla-on-shubman-gills-dismissal-in-wtc/","keywords":["Cricket","Sports","ANI"],"creator":["ANI"],"video_url":null,"description":"The News Mill","content":"The Board of Control for Cricket in India (BCCI) vice president Rajeev Shukla has revealed his thoughts on the Cameron Green catch that saw India opener Shubman Gill dismissed at a crucial stage of the ICC World Test Championship (WTC) final on Day 4 against Australia. On the fourth day of a gripping match at The Oval, Gill was declared out by TV umpire Richard Kettleborough at the stroke of tea after India got a strong start in their run chase, with 444 needed to win. Pacer Scott Boland found the edge of India’s opener’s bat and Cameron Green dove to his left in his preferred gully position to complete the catch, but the debate has opened up in the cricket world on whether the Australia all-rounder was successful in getting his hands under the ball and controlling it. Green immediately started celebrating the superb catch with his teammates. Fans and many players debated whether the batter was out or not as well as whether Green avoided hitting the ball on the grass when his hand came on the ground after catching it as soon as the ‘out’ decision was shown on the huge screen. Gill and India captain Rohit Sharma were left unconvinced by the decision. “We should not create a dispute over this. We should accept the decision of the Third umpire,” Rajeev Shukla told ANI. The success of India will depend on the two players who are in the middle when play resumes. Rahane’s outstanding performance for Chennai Super Kings (CSK) in the Indian Premier League (IPL) helped him gain a spot back in the India Test XI, and his brilliant 89 in the first innings demonstrated that he is back to his entertaining best. And with an unbeaten 44* on Saturday, Kohli went beyond a career tally of 2000 runs in Tests against Australia, becoming only the fifth Indian batter in history to do so. “Ajinkya Rahane and Virat Kohli are batting well and if everyone plays safe we can chase down the target as the target is not that big,” Shukla further added. Coming to the match, an eventful day of cricket came to an end with Virat Kohli and Ajinkya Rahane holding down India’s fort at the end of Day-4 of the ongoing World Test Championship Final 2023 between India and Australia on Saturday. At the end of the day, India scored 164/3 in 40 overs with Ajinkya Rahane 20(59) and Virat Kohli 44(60) unbeaten at the crease. (ANI)","pubDate":"2023-06-10 20:34:21","image_url":null,"source_id":"thenewsmill","category":["sports"],"country":["india"],"language":"english"},{"title":"100 per cent everyone believes India will win WTC final: Mohammed Shami","link":"https://thenewsmill.com/2023/06/100-per-cent-everyone-believes-india-will-win-wtc-final-mohammed-shami/","keywords":["Cricket","Sports","ANI"],"creator":["ANI"],"video_url":null,"description":"The News Mill","content":"Veteran pacer Mohammed Shami said that India will return to The Oval on the Day 5 of the ongoing ICC World Test Championship (WTC) final with full belief that they can win ‘The Ultimate Test’ against Australia An eventful day of cricket came to an end with Virat Kohli and Ajinkya Rahane holding down India’s fort at the end of Day-4 of the ongoing World Test Championship Final 2023 between India and Australia on Saturday. At the end of the day, India scored 164/3 in 40 overs with Ajinkya Rahane and Virat Kohli at the crease with scores of 20(59)* and 44(60)*. And if they succeed in chasing a target of 444 runs to win the WTC Final, it will mark the biggest fourth-inning run chase in Test history. “One hundred per cent everyone believes that tomorrow we will win the match. We always fight, we perform well around the world. So we believe and we will all come together to win this match,” Mohammed Shami said in a post-match press conference. Shami’s assurance is consistent with what Indian bowler Shardul Thakur said following day three when he stated that the squad believed they were capable of chasing down “450, maybe more”. “It doesn’t matter what happened in Sydney or Brisbane, we are playing here. We have to think about tomorrow and we will win the match,” he added. “I believe that the Test match should go until the fifth day and maybe until the last session. That’s the real test. So we have to bat well and they have to bowl well to save themselves,” said the India pacer. India’s batting stalwart Virat Kohli joined an elite list as he became the fifth Indian batter to score more than 2000 runs against Australia. While Rahane, who was impressive for Chennai Super Kings (CSK) in the Indian Premier League (IPL) and won his recall to the India Test XI in part because of that performance, demonstrated that he is back to his entertaining best with a brilliant 89 in the first innings. Shami believes India should be able to score the remaining 280 runs if the hitters continue to perform well. “If you bat well, 280 runs is not a big score. So I think you should bat normally as a Test match; focus on playing ball by ball. You should not look at the long target. When you keep small goals and targets, you will get more success,” Shami added. (ANI)","pubDate":"2023-06-10 20:34:09","image_url":null,"source_id":"thenewsmill","category":["sports"],"country":["india"],"language":"english"},{"title":"“Caught it in heat of moment…. thought it was clean”: Cameron Green on taking Shubman Gill’s catch","link":"https://thenewsmill.com/2023/06/caught-it-in-heat-of-moment-thought-it-was-clean-cameron-green-on-taking-shubman-gills-catch/","keywords":["Cricket","Sports","ANI"],"creator":["ANI"],"video_url":null,"description":"The News Mill","content":"Australia all-rounder Cameron Green is sure that he held on to the catch that ended India opener Shubman Gill’s innings during a pivotal moment of the ICC World Test Championship (WTC) final at The Oval on Saturday. On the fourth day of a gripping match at The Oval, Gill was declared out by TV umpire Richard Kettleborough at the stroke of tea after India got a strong start in their run chase, with 444 needed to win. Pacer Scott Boland found the edge of India opener’s bat and Cameron Green dove to his left in his preferred gully position to complete the catch, but the debate has opened up in the cricket world on whether the Australia all-rounder was successful in getting his hands under the ball and controlling it. Green immediately started celebrating the superb catch with his teammates. Fans and many players debated whether the batter was out or not as well as whether Green avoided hitting the ball on the grass when his hand came on the ground after catching it as soon as the ‘out’ decision was shown on the huge screen. Gill and India captain Rohit Sharma were left unconvinced by the decision as tea was taken right away. “At the time I definitely thought I caught it. I think in the heat of the moment, I thought it was clean and threw it up and obviously showed no sign of any doubt. And then it’s left up to the third umpire (Kettleborough) and he agreed,” Cameron Green said in a post-match press conference. The 24-year-old also displayed his athletic prowess by seizing an even better opportunity to knock top scorer Ajinkya Rahane during India’s opening innings. While Green is more known for his bowling and batting skills, he is now beginning to field quite the highlight reel in the challenging gully position he has finally mastered. “Ever since I’ve grown up I have put a lot of time and effort into it (catching). I think growing up I would always try to get myself in first or second slip and I have done that basically my whole junior career,” Green said. “I back myself that I can take a few nice catches and I was a bit disappointed the first day dropping that (easy) one, but it’s always nice to repay,” the all-rounder added. On what could be an exciting final day in south London, Green has advised his fellow bowlers to practise patience as they look for the final seven breakthroughs. Green is aware that there is still much work for both he and his teammates to complete. “It will be crucial (to stay patient) as it was today to kind of keep our nerve… one or two wickets and we’re back on top. We have to definitely be patient,” Green added. At the end of the day, India scored 164/3 in 40 overs with Ajinkya Rahane and Virat Kohli at the crease with scores of 20(59)* and 44(60)*. (ANI)","pubDate":"2023-06-10 19:34:23","image_url":null,"source_id":"thenewsmill","category":["sports"],"country":["india"],"language":"english"},{"title":"WTC final: Shubman Gill posts cryptic tweet about his controversial dismissal with image of Cameron Green’s catch","link":"https://thenewsmill.com/2023/06/wtc-final-shubman-gill-posts-cryptic-tweet-about-his-controversial-dismissal-with-image-of-cameron-greens-catch/","keywords":["Cricket","Sports","ANI"],"creator":["ANI"],"video_url":null,"description":"The News Mill","content":"India opener Shubman Gill’s controversial dismissal on the fourth day of the ongoing World Test Championship (WTC) final against Australia at the Oval stirred debate on social media platforms worldwide, and the situation only got worse until the star opener finally addressed it on his official social media accounts. On the fourth day of a gripping match at The Oval, Gill was declared out by TV umpire Richard Kettleborough at the stroke of tea after India got a strong start in their run chase, with 444 needed to win. Pacer Scott Boland found the edge of India opener’s bat and Cameron Green dove to his left in his preferred gully position to complete the catch, but the debate has opened up in the cricket world on whether the Australia all-rounder was successful in getting his hands under the ball and controlling it. Green immediately started celebrating the superb catch with his teammates. Fans and many players debated whether the batter was out or not as well as whether Green avoided hitting the ball on the grass when his hand came on the ground after catching it as soon as the ‘out’ decision was shown on the huge screen. Gill and India captain Rohit Sharma were left unconvinced by the decision as tea was taken right away. Virender Sehwag, Ravi Shastri, and many fans questioned the verdict of the TV umpire. Shubman has finally spoken out about being dismissed with a controversial catch. On his Twitter account, Gill uploaded a picture of Cameron Green’s catch along with two magnifying glass emojis and a disappointed expression emoji. He even shared the identical photo along with four clapping emojis on his Instagram story. ‍[?] pic.twitter.com/pOnHYfgb6L — Shubman Gill (@ShubmanGill) June 10, 2023 Coming to the match, An eventful day of cricket came to an end with Virat Kohli and Ajinkya Rahane holding down India’s fort at the end of Day-4 of the ongoing World Test Championship Final 2023 between India and Australia on Saturday. At the end of the day, India scored 164/3 in 40 overs with Ajinkya Rahane and Virat Kohli at the crease with scores of 20(59)* and 44(60)*. (ANI)","pubDate":"2023-06-10 19:34:11","image_url":null,"source_id":"thenewsmill","category":["sports"],"country":["india"],"language":"english"},{"title":"کرکٹ میچ کے دوران شہد کی مکھیوں کا حملہ، ویڈیو وائرل","link":"https://www.bolnewsurdu.com/news/sports-news/Story/92924/","keywords":["کھیلوں کی خبریں"],"creator":["Ahsan MuGhaL"],"video_url":null,"description":"آئرلینڈ میں کرکٹ میچ کے دوران گراؤنڈ میں ہزاروں شہد کی مکھیوں نے دھاوا بول دیا جس کے باعث میچ روکنا پڑگیا۔ عالمی میڈیا رپورٹس کے مطابق آئرلینڈ کے شہر کورک میں ڈومیسٹک کرکٹ کا میچ کھیلا جارہا تھا کہ اس دوران شہد کی ہزاروں مکھیوں نے گراؤنڈ پر دھاوا بول دیا۔ #ICYMI When bees trumped … The post کرکٹ میچ کے دوران شہد کی مکھیوں کا حملہ، ویڈیو وائرل appeared first on BOL News Urdu - بول نیوز اردو.","content":"عالمی میڈیا رپورٹس کے مطابق آئرلینڈ کے شہر کورک میں ڈومیسٹک کرکٹ کا میچ کھیلا جارہا تھا کہ اس دوران شہد کی ہزاروں مکھیوں نے گراؤنڈ پر دھاوا بول دیا۔ شہد کی مکھیوں کی آمد پر فوری طور پر امپائر سمیت تمام کھلاڑی گراؤنڈ میں حفاظتی اقدام کے طور پر منہ کے بل لیٹ گئے اور میچ کو روک دیا گیا۔ اس دوران شہدکی مکھیاں گراؤنڈ میں ہرطرف پھیل گئیں جس کے باعث مقامی بلدیہ سے مدد مانگی گئی اور بلدیہ کے عملے نے آکر مکھیوں کو گراؤنڈ سے نکالا، اس دوران میچ تقریباً ڈیڑھ گھنٹے تک معطل رہا جس کی وجہ سے 50 اوورز کے میچ میں سے 12 اوورز کم کرنا پڑے۔","pubDate":"2023-06-10 18:59:06","image_url":null,"source_id":"bolnewsurdu","category":["sports"],"country":["pakistan"],"language":"Urdu"},{"title":"News24.com | Kohli holds firm against Aussies as India chase record total to win World Test Championship","link":"https://www.news24.com/sport/Cricket/kohli-holds-firm-against-aussies-as-india-chase-record-total-to-win-world-test-championship-20230610","keywords":null,"creator":null,"video_url":null,"description":"Virat Kohli defied Australia on Saturday to give India hope of an extraordinary win in the World Test Championship final at The Oval.","content":"Virat Kohli defied Australia on Saturday to give India hope of an extraordinary win in the World Test Championship final at The Oval. India were 164-3 at stumps, still needing a further 280 runs to reach what would be a record-breaking total of 444 on Sunday's scheduled fifth and final day. Star batsman Kohli, however, was 44 not out, while Ajinkya Rahane was unbeaten on 20 after he had already marked his first Test in over a year by top-scoring with 89 in India's first-innings 296. SCOREBOARD | World Test Championship final: Australia v India The scale of India's task was emphasised by the fact that only four teams in 146 years of Test cricket have made more than 400 to win in the fourth innings, with the West Indies' 418-7 against Australia at St John's in 2003 the highest such total. Australia, by contrast, require just seven more wickets Sunday to win the only major global men's trophy to have so far eluded them and ensure they head into next week's Ashes opener against England at Edgbaston in buoyant mood. India captain Rohit Sharma set the initial tone for a daunting chase with several boundaries, including a pulled six off left-arm quick Mitchell Starc. But on the stroke of tea, opening partner Shubman Gill fell to a controversial catch when Cameron Green, who had taken an undisputed blinder in the first innings to remove Rahane, dived low to his left following an edge off Scott Boland. The decision was referred by the on-field umpires to TV official Richard Kettleborough. And with the 'soft signal' recently abolished, there was no on-field guidance for Kettleborough to follow in determining if the ball had brushed the turf after Green had grabbed hold. \"Kohli, Kohli, Kohli\" Kettleborough eventually ruled in Australia's favour, prompting chants of \"cheats, cheats, cheats\" from the massed ranks of India fans in a crowd of nearly 25,000 when the decision was flashed up on The Oval's giant screens. Rohit and Cheteshwar Pujara continued to attack Australia's quicks as India looked to go one better after losing the inaugural 2021 WTC final to New Zealand in Southampton. Spin, however, proved Rohit's undoing on a wearing pitch when he missed an attempted sweep against Nathan Lyon, bowling from around the wicket, with the batsman lbw for 43 off 60 balls despite his review. India lost another wicket without adding another run when Pujara, renowned as a patient accumulator of runs, attempted an extravagant upper-cut off Australia captain Pat Cummmins only to guide a simple catch to wicketkeeper Alex Carey as he fell for 27. But Kohli regained the initiative for India by clipping and driving Starc for boundaries greeted by chants of \"Kohli, Kohli, Kohli\" from his adoring fans in the stands. Earlier, Australia made 270-8 in their second innings before Cummins declared. Marnus Labuschagne, the world's top-ranked Test batsman, departed for his overnight 41 when he tentatively edged Umesh Yadav to Pujara at first slip. Ravindra Jadeja, who had accounted for first-innings century-makers Steve Smith and Travis Head on Friday, again bowled well, with the left-arm spinner removing Green for 25 in a return 3-58 in 23 overs. Jadeja's miserly haul may have left India questioning their decision to omit star off-spinner Ravichandran Ashwin, the world's top-ranked Test bowler, in order to play an extra seamer. But Carey, missed in the slips on 41, played Pujara well while top-scoring with 66 not out after adding a valuable seventh-wicket stand of 93 with the hard-hitting Starc (41).","pubDate":"2023-06-10 18:12:39","image_url":"https://scripts.24.co.za/img/sites/sport24.png","source_id":"news24","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Test pinnacle starts to complicate Australia’s Ashes plans","link":"https://www.watoday.com.au/sport/cricket/test-pinnacle-starts-to-complicate-australia-s-ashes-plans-20230610-p5dfkt.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Daniel Brettig"],"video_url":null,"description":"Perhaps only in European football is there a parallel with a Test Championship finale a matter of days before the Ashes.","content":"Manchester City’s legendary manager Pep Guardiola had some ideas on the thoughts running through Australian minds on day four at the Oval. Perhaps only in European football, where the FA Cup showpiece can be closely followed by an appearance in the Champions League decider , is there a parallel with the Test Championship final reaching its endgame a matter of days before the Ashes. Pat Cummins celebrates the wicket of Cheteshwar Pujara. Credit: Getty While Guardiola had to ponder the balance of his squad between those two tightly-packed assignments, Pat Cummins and Australia faced questions of time and resources after Alex Carey and Mitchell Starc ensured a declaration would be possible. Usually, a captain will ponder the number of runs being set, the sessions and hours left in the game, the deterioration of the surface and the notional tally of overs to be bowled. This time, it was impossible for Cummins and the coaching staff not to think about the looming date with England at Edgbaston. On Friday they will come face-to-face with the team of Ben Stokes and his fearless “Bazball” blueprint with coach Brendon McCullum. Loading As Australia were slogging it out with India at the Oval for the right to be called World Test Champions, England’s players were intermingling training with rounds of golf in Scotland, ensuring they will be fresh and loose for the Ashes. The scenario Cummins wished to avoid was one where he, Scott Boland, Mitchell Starc and Cameron Green were compelled to bowl a big chunk of overs with minimal room for recovery before turning out in Birmingham. Partly, this is because Josh Hazlewood, ostensibly the first reserve, has an uncertain recent fitness record and was also held back until the second Test of the previous Ashes series in England in 2019.","pubDate":"2023-06-10 17:54:48","image_url":null,"source_id":"watoday","category":["sports"],"country":["australia"],"language":"english"},{"title":"Australia find Virat Kohli in way to World Test Championship title","link":"https://timesofindia.indiatimes.com/sports/cricket/icc-world-test-championship/australia-find-virat-kohli-in-way-to-world-test-championship-title/articleshow/100904167.cms","keywords":null,"creator":null,"video_url":null,"description":"A resolute Virat Kohli and first innings hero Ajinkya Rahane stand in Australia's way to the World Test Championship title as India head into the final day of the intriguing summit clash, requiring another 280 runs in the record chase of 444. The Kohli and Rahane duo added crucial 71-run unbeaten stand after an intent-filled knock from Rohit Sharma (43) in the final session as India ended the penultimate day of the 'Ultimate Test' at 164 for three at the Oval.","content":"Australia all-rounder Cameron Green might have taken a one-handed blinder in gully region to dismiss Shubman Gill but it sparked a debate in the cricketing fraternity over TV umpire's decision to rule in favour of the Aussies. World No. 1 Swiatek clinches third French Open title Top-5 highest scores by Indian players in ICC finals Top-5: Ajinkya Rahane’s overseas Test knocks Shardul equals Don Bradman and Allan Border's feat NBA Finals: Nuggets take 3-1 lead vs Heat after Game 4 Djokovic knocks Alcaraz out of the French Open Ajinkya Rahane: From Test wilderness to WTC Final WTC Final: Australia heap misery on floundering India Rahane becomes 13th Indian to score 5000 runs in Tests Highest Test scores by Australian batters vs India","pubDate":"2023-06-10 17:44:17","image_url":null,"source_id":"toi","category":["sports"],"country":["india"],"language":"english"},{"title":"Gill Posts Cryptic Tweet About Controversial Catch, Uses 'Facepalm' Emoji","link":"https://sports.ndtv.com/cricket/wtc-final-shubman-gill-posts-cryptic-tweet-about-controversial-catch-uses-facepalm-emoji-4111180","keywords":null,"creator":null,"video_url":null,"description":"Shubman Gill posted a picture of Cameron Green's catch along with an interesting caption after Day 4 of the WTC Final.","content":"Shubman Gill took to social media to post a screenshot of Cameron Green 's controversial catch to dismiss him on Day 4 of the World Test Championship (WTC) Final at The Oval on Saturday. Experts were divided over whether Green was able to complete the catch properly at third slip with some videos and pictures suggesting that the ball touched the ground when his hand made impact. However, the third umpire thought that the catch was fair and Gill was given out. The in-form India opener posted a picture of the catch on Twitter along with a cryptic caption which included the 'facepalm' emoji. pic.twitter.com/pOnHYfgb6L A focussed Virat Kohli stood between Australia and World Test Championship mace as India require another 280 runs to create history on what promises to be an intriguing final day of the summit clash. Kohli was batting on 44 off 60 balls and had Ajinkya Rahane (20 batting) for company during a stand of 71 for the fourth wicket as India ended the fourth day on 164 for 3 in pursuit of world record chase of 444. Having been set a mammoth target, India lost Shubman Gill (18 off 19) to a contentious catch before skipper Rohit Sharma (43 off 60) and Cheteshwar Pujara (27 off 47) brought about their own downfall to make it 93 for three in 31st over. Australia had declared their second innings at 270 for 8 midway into the afternoon session after an unbeaten 66 from Alex Carey . (With PTI inputs)","pubDate":"2023-06-10 17:39:21","image_url":null,"source_id":"ndtv","category":["sports"],"country":["india"],"language":"english"},{"title":"Why soft-signal rule didn’t come into play in Shubman Gill’s dismissal","link":"https://thenewsmill.com/2023/06/why-soft-signal-rule-didnt-come-into-play-in-shubman-gills-dismissal/","keywords":["Cricket","Sports","ANI"],"creator":["ANI"],"video_url":null,"description":"The News Mill","content":"Shubman Gill’s dismissal on the final ball of the second session became one of the biggest talking points on Day 4 of the ongoing World Test Championship (WTC) on Saturday. The question on everyone’s lips was: why wasn’t the soft dismissal call made? Shubman Gill’s edge off Scott Boland flew close to Cameron Green in the slips. The tall all-rounder dived towards his left to take a low catch. However, at first glance, there appeared to be some doubt over whether or not the ball touched the ground before Green took the one-handed catch. Amid the uncertainty on whether the catch was clean, the matter was referred to television umpire Richard Kettleborough. Camera angles showed Green getting some fingers under the ball as took the catch, but it couldn’t be said conclusively if the catch was clean. After an extended period, during which the catch was played and replayed from different camera angles, the television umpire ruled that the catch was clean. The decision was received with disbelief by Gill, who looked visibly disappointed as he trudged off the field of play. However, the decision became a bone of contention due to the lack of application of the soft signal. The soft signal didn’t come into play as the regulation was removed from the ICC Playing Conditions at the start of June, with the new laws coming into play for the first time when England played Ireland at Lord’s a week ago. The decision to withdraw the soft-signal rule was taken by a committee of the International Cricket Council (ICC), which has former India captain Sourav Ganguly as a member. “The on-field umpires will consult with the TV umpire before any decisions are taken,” the ICC confirmed when the changes were announced in May. “Soft signals have been discussed at previous cricket committee meetings over the last couple of years. The committee deliberated this at length and concluded that soft signals were unnecessary and at times confusing since referrals of catches may seem inconclusive in replays,” Ganguly, who represents the ICC’s Men’s Cricket Committee, said earlier. (ANI)","pubDate":"2023-06-10 17:34:09","image_url":null,"source_id":"thenewsmill","category":["sports"],"country":["india"],"language":"english"},{"title":"“Should not create dispute over this…”: Rajeev Shukla on Shubman Gill’s dismissal in WTC","link":"https://thenewsmill.com/2023/06/should-not-create-dispute-over-this-rajeev-shukla-on-shubman-gills-dismissal-in-wtc/","keywords":["Cricket","Sports","ANI"],"creator":["ANI"],"video_url":null,"description":"The News Mill","content":"The Board of Control for Cricket in India (BCCI) vice president Rajeev Shukla has revealed his thoughts on the Cameron Green catch that saw India opener Shubman Gill dismissed at a crucial stage of the ICC World Test Championship (WTC) final on Day 4 against Australia. On the fourth day of a gripping match at The Oval, Gill was declared out by TV umpire Richard Kettleborough at the stroke of tea after India got a strong start in their run chase, with 444 needed to win. Pacer Scott Boland found the edge of India’s opener’s bat and Cameron Green dove to his left in his preferred gully position to complete the catch, but the debate has opened up in the cricket world on whether the Australia all-rounder was successful in getting his hands under the ball and controlling it. Green immediately started celebrating the superb catch with his teammates. Fans and many players debated whether the batter was out or not as well as whether Green avoided hitting the ball on the grass when his hand came on the ground after catching it as soon as the ‘out’ decision was shown on the huge screen. Gill and India captain Rohit Sharma were left unconvinced by the decision. “We should not create a dispute over this. We should accept the decision of the Third umpire,” Rajeev Shukla told ANI. The success of India will depend on the two players who are in the middle when play resumes. Rahane’s outstanding performance for Chennai Super Kings (CSK) in the Indian Premier League (IPL) helped him gain a spot back in the India Test XI, and his brilliant 89 in the first innings demonstrated that he is back to his entertaining best. And with an unbeaten 44* on Saturday, Kohli went beyond a career tally of 2000 runs in Tests against Australia, becoming only the fifth Indian batter in history to do so. “Ajinkya Rahane and Virat Kohli are batting well and if everyone plays safe we can chase down the target as the target is not that big,” Shukla further added. Coming to the match, an eventful day of cricket came to an end with Virat Kohli and Ajinkya Rahane holding down India’s fort at the end of Day-4 of the ongoing World Test Championship Final 2023 between India and Australia on Saturday. At the end of the day, India scored 164/3 in 40 overs with Ajinkya Rahane 20(59) and Virat Kohli 44(60) unbeaten at the crease. (ANI)","pubDate":"2023-06-10 20:34:21","image_url":null,"source_id":"thenewsmill","category":["sports"],"country":["india"],"language":"english"},{"title":"100 per cent everyone believes India will win WTC final: Mohammed Shami","link":"https://thenewsmill.com/2023/06/100-per-cent-everyone-believes-india-will-win-wtc-final-mohammed-shami/","keywords":["Cricket","Sports","ANI"],"creator":["ANI"],"video_url":null,"description":"The News Mill","content":"Veteran pacer Mohammed Shami said that India will return to The Oval on the Day 5 of the ongoing ICC World Test Championship (WTC) final with full belief that they can win ‘The Ultimate Test’ against Australia An eventful day of cricket came to an end with Virat Kohli and Ajinkya Rahane holding down India’s fort at the end of Day-4 of the ongoing World Test Championship Final 2023 between India and Australia on Saturday. At the end of the day, India scored 164/3 in 40 overs with Ajinkya Rahane and Virat Kohli at the crease with scores of 20(59)* and 44(60)*. And if they succeed in chasing a target of 444 runs to win the WTC Final, it will mark the biggest fourth-inning run chase in Test history. “One hundred per cent everyone believes that tomorrow we will win the match. We always fight, we perform well around the world. So we believe and we will all come together to win this match,” Mohammed Shami said in a post-match press conference. Shami’s assurance is consistent with what Indian bowler Shardul Thakur said following day three when he stated that the squad believed they were capable of chasing down “450, maybe more”. “It doesn’t matter what happened in Sydney or Brisbane, we are playing here. We have to think about tomorrow and we will win the match,” he added. “I believe that the Test match should go until the fifth day and maybe until the last session. That’s the real test. So we have to bat well and they have to bowl well to save themselves,” said the India pacer. India’s batting stalwart Virat Kohli joined an elite list as he became the fifth Indian batter to score more than 2000 runs against Australia. While Rahane, who was impressive for Chennai Super Kings (CSK) in the Indian Premier League (IPL) and won his recall to the India Test XI in part because of that performance, demonstrated that he is back to his entertaining best with a brilliant 89 in the first innings. Shami believes India should be able to score the remaining 280 runs if the hitters continue to perform well. “If you bat well, 280 runs is not a big score. So I think you should bat normally as a Test match; focus on playing ball by ball. You should not look at the long target. When you keep small goals and targets, you will get more success,” Shami added. (ANI)","pubDate":"2023-06-10 20:34:09","image_url":null,"source_id":"thenewsmill","category":["sports"],"country":["india"],"language":"english"},{"title":"“Caught it in heat of moment…. thought it was clean”: Cameron Green on taking Shubman Gill’s catch","link":"https://thenewsmill.com/2023/06/caught-it-in-heat-of-moment-thought-it-was-clean-cameron-green-on-taking-shubman-gills-catch/","keywords":["Cricket","Sports","ANI"],"creator":["ANI"],"video_url":null,"description":"The News Mill","content":"Australia all-rounder Cameron Green is sure that he held on to the catch that ended India opener Shubman Gill’s innings during a pivotal moment of the ICC World Test Championship (WTC) final at The Oval on Saturday. On the fourth day of a gripping match at The Oval, Gill was declared out by TV umpire Richard Kettleborough at the stroke of tea after India got a strong start in their run chase, with 444 needed to win. Pacer Scott Boland found the edge of India opener’s bat and Cameron Green dove to his left in his preferred gully position to complete the catch, but the debate has opened up in the cricket world on whether the Australia all-rounder was successful in getting his hands under the ball and controlling it. Green immediately started celebrating the superb catch with his teammates. Fans and many players debated whether the batter was out or not as well as whether Green avoided hitting the ball on the grass when his hand came on the ground after catching it as soon as the ‘out’ decision was shown on the huge screen. Gill and India captain Rohit Sharma were left unconvinced by the decision as tea was taken right away. “At the time I definitely thought I caught it. I think in the heat of the moment, I thought it was clean and threw it up and obviously showed no sign of any doubt. And then it’s left up to the third umpire (Kettleborough) and he agreed,” Cameron Green said in a post-match press conference. The 24-year-old also displayed his athletic prowess by seizing an even better opportunity to knock top scorer Ajinkya Rahane during India’s opening innings. While Green is more known for his bowling and batting skills, he is now beginning to field quite the highlight reel in the challenging gully position he has finally mastered. “Ever since I’ve grown up I have put a lot of time and effort into it (catching). I think growing up I would always try to get myself in first or second slip and I have done that basically my whole junior career,” Green said. “I back myself that I can take a few nice catches and I was a bit disappointed the first day dropping that (easy) one, but it’s always nice to repay,” the all-rounder added. On what could be an exciting final day in south London, Green has advised his fellow bowlers to practise patience as they look for the final seven breakthroughs. Green is aware that there is still much work for both he and his teammates to complete. “It will be crucial (to stay patient) as it was today to kind of keep our nerve… one or two wickets and we’re back on top. We have to definitely be patient,” Green added. At the end of the day, India scored 164/3 in 40 overs with Ajinkya Rahane and Virat Kohli at the crease with scores of 20(59)* and 44(60)*. (ANI)","pubDate":"2023-06-10 19:34:23","image_url":null,"source_id":"thenewsmill","category":["sports"],"country":["india"],"language":"english"},{"title":"WTC final: Shubman Gill posts cryptic tweet about his controversial dismissal with image of Cameron Green’s catch","link":"https://thenewsmill.com/2023/06/wtc-final-shubman-gill-posts-cryptic-tweet-about-his-controversial-dismissal-with-image-of-cameron-greens-catch/","keywords":["Cricket","Sports","ANI"],"creator":["ANI"],"video_url":null,"description":"The News Mill","content":"India opener Shubman Gill’s controversial dismissal on the fourth day of the ongoing World Test Championship (WTC) final against Australia at the Oval stirred debate on social media platforms worldwide, and the situation only got worse until the star opener finally addressed it on his official social media accounts. On the fourth day of a gripping match at The Oval, Gill was declared out by TV umpire Richard Kettleborough at the stroke of tea after India got a strong start in their run chase, with 444 needed to win. Pacer Scott Boland found the edge of India opener’s bat and Cameron Green dove to his left in his preferred gully position to complete the catch, but the debate has opened up in the cricket world on whether the Australia all-rounder was successful in getting his hands under the ball and controlling it. Green immediately started celebrating the superb catch with his teammates. Fans and many players debated whether the batter was out or not as well as whether Green avoided hitting the ball on the grass when his hand came on the ground after catching it as soon as the ‘out’ decision was shown on the huge screen. Gill and India captain Rohit Sharma were left unconvinced by the decision as tea was taken right away. Virender Sehwag, Ravi Shastri, and many fans questioned the verdict of the TV umpire. Shubman has finally spoken out about being dismissed with a controversial catch. On his Twitter account, Gill uploaded a picture of Cameron Green’s catch along with two magnifying glass emojis and a disappointed expression emoji. He even shared the identical photo along with four clapping emojis on his Instagram story. ‍[?] pic.twitter.com/pOnHYfgb6L — Shubman Gill (@ShubmanGill) June 10, 2023 Coming to the match, An eventful day of cricket came to an end with Virat Kohli and Ajinkya Rahane holding down India’s fort at the end of Day-4 of the ongoing World Test Championship Final 2023 between India and Australia on Saturday. At the end of the day, India scored 164/3 in 40 overs with Ajinkya Rahane and Virat Kohli at the crease with scores of 20(59)* and 44(60)*. (ANI)","pubDate":"2023-06-10 19:34:11","image_url":null,"source_id":"thenewsmill","category":["sports"],"country":["india"],"language":"english"},{"title":"کرکٹ میچ کے دوران شہد کی مکھیوں کا حملہ، ویڈیو وائرل","link":"https://www.bolnewsurdu.com/news/sports-news/Story/92924/","keywords":["کھیلوں کی خبریں"],"creator":["Ahsan MuGhaL"],"video_url":null,"description":"آئرلینڈ میں کرکٹ میچ کے دوران گراؤنڈ میں ہزاروں شہد کی مکھیوں نے دھاوا بول دیا جس کے باعث میچ روکنا پڑگیا۔ عالمی میڈیا رپورٹس کے مطابق آئرلینڈ کے شہر کورک میں ڈومیسٹک کرکٹ کا میچ کھیلا جارہا تھا کہ اس دوران شہد کی ہزاروں مکھیوں نے گراؤنڈ پر دھاوا بول دیا۔ #ICYMI When bees trumped … The post کرکٹ میچ کے دوران شہد کی مکھیوں کا حملہ، ویڈیو وائرل appeared first on BOL News Urdu - بول نیوز اردو.","content":"عالمی میڈیا رپورٹس کے مطابق آئرلینڈ کے شہر کورک میں ڈومیسٹک کرکٹ کا میچ کھیلا جارہا تھا کہ اس دوران شہد کی ہزاروں مکھیوں نے گراؤنڈ پر دھاوا بول دیا۔ شہد کی مکھیوں کی آمد پر فوری طور پر امپائر سمیت تمام کھلاڑی گراؤنڈ میں حفاظتی اقدام کے طور پر منہ کے بل لیٹ گئے اور میچ کو روک دیا گیا۔ اس دوران شہدکی مکھیاں گراؤنڈ میں ہرطرف پھیل گئیں جس کے باعث مقامی بلدیہ سے مدد مانگی گئی اور بلدیہ کے عملے نے آکر مکھیوں کو گراؤنڈ سے نکالا، اس دوران میچ تقریباً ڈیڑھ گھنٹے تک معطل رہا جس کی وجہ سے 50 اوورز کے میچ میں سے 12 اوورز کم کرنا پڑے۔","pubDate":"2023-06-10 18:59:06","image_url":null,"source_id":"bolnewsurdu","category":["sports"],"country":["pakistan"],"language":"Urdu"},{"title":"News24.com | Kohli holds firm against Aussies as India chase record total to win World Test Championship","link":"https://www.news24.com/sport/Cricket/kohli-holds-firm-against-aussies-as-india-chase-record-total-to-win-world-test-championship-20230610","keywords":null,"creator":null,"video_url":null,"description":"Virat Kohli defied Australia on Saturday to give India hope of an extraordinary win in the World Test Championship final at The Oval.","content":"Virat Kohli defied Australia on Saturday to give India hope of an extraordinary win in the World Test Championship final at The Oval. India were 164-3 at stumps, still needing a further 280 runs to reach what would be a record-breaking total of 444 on Sunday's scheduled fifth and final day. Star batsman Kohli, however, was 44 not out, while Ajinkya Rahane was unbeaten on 20 after he had already marked his first Test in over a year by top-scoring with 89 in India's first-innings 296. SCOREBOARD | World Test Championship final: Australia v India The scale of India's task was emphasised by the fact that only four teams in 146 years of Test cricket have made more than 400 to win in the fourth innings, with the West Indies' 418-7 against Australia at St John's in 2003 the highest such total. Australia, by contrast, require just seven more wickets Sunday to win the only major global men's trophy to have so far eluded them and ensure they head into next week's Ashes opener against England at Edgbaston in buoyant mood. India captain Rohit Sharma set the initial tone for a daunting chase with several boundaries, including a pulled six off left-arm quick Mitchell Starc. But on the stroke of tea, opening partner Shubman Gill fell to a controversial catch when Cameron Green, who had taken an undisputed blinder in the first innings to remove Rahane, dived low to his left following an edge off Scott Boland. The decision was referred by the on-field umpires to TV official Richard Kettleborough. And with the 'soft signal' recently abolished, there was no on-field guidance for Kettleborough to follow in determining if the ball had brushed the turf after Green had grabbed hold. \"Kohli, Kohli, Kohli\" Kettleborough eventually ruled in Australia's favour, prompting chants of \"cheats, cheats, cheats\" from the massed ranks of India fans in a crowd of nearly 25,000 when the decision was flashed up on The Oval's giant screens. Rohit and Cheteshwar Pujara continued to attack Australia's quicks as India looked to go one better after losing the inaugural 2021 WTC final to New Zealand in Southampton. Spin, however, proved Rohit's undoing on a wearing pitch when he missed an attempted sweep against Nathan Lyon, bowling from around the wicket, with the batsman lbw for 43 off 60 balls despite his review. India lost another wicket without adding another run when Pujara, renowned as a patient accumulator of runs, attempted an extravagant upper-cut off Australia captain Pat Cummmins only to guide a simple catch to wicketkeeper Alex Carey as he fell for 27. But Kohli regained the initiative for India by clipping and driving Starc for boundaries greeted by chants of \"Kohli, Kohli, Kohli\" from his adoring fans in the stands. Earlier, Australia made 270-8 in their second innings before Cummins declared. Marnus Labuschagne, the world's top-ranked Test batsman, departed for his overnight 41 when he tentatively edged Umesh Yadav to Pujara at first slip. Ravindra Jadeja, who had accounted for first-innings century-makers Steve Smith and Travis Head on Friday, again bowled well, with the left-arm spinner removing Green for 25 in a return 3-58 in 23 overs. Jadeja's miserly haul may have left India questioning their decision to omit star off-spinner Ravichandran Ashwin, the world's top-ranked Test bowler, in order to play an extra seamer. But Carey, missed in the slips on 41, played Pujara well while top-scoring with 66 not out after adding a valuable seventh-wicket stand of 93 with the hard-hitting Starc (41).","pubDate":"2023-06-10 18:12:39","image_url":"https://scripts.24.co.za/img/sites/sport24.png","source_id":"news24","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Test pinnacle starts to complicate Australia’s Ashes plans","link":"https://www.watoday.com.au/sport/cricket/test-pinnacle-starts-to-complicate-australia-s-ashes-plans-20230610-p5dfkt.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Daniel Brettig"],"video_url":null,"description":"Perhaps only in European football is there a parallel with a Test Championship finale a matter of days before the Ashes.","content":"Manchester City’s legendary manager Pep Guardiola had some ideas on the thoughts running through Australian minds on day four at the Oval. Perhaps only in European football, where the FA Cup showpiece can be closely followed by an appearance in the Champions League decider , is there a parallel with the Test Championship final reaching its endgame a matter of days before the Ashes. Pat Cummins celebrates the wicket of Cheteshwar Pujara. Credit: Getty While Guardiola had to ponder the balance of his squad between those two tightly-packed assignments, Pat Cummins and Australia faced questions of time and resources after Alex Carey and Mitchell Starc ensured a declaration would be possible. Usually, a captain will ponder the number of runs being set, the sessions and hours left in the game, the deterioration of the surface and the notional tally of overs to be bowled. This time, it was impossible for Cummins and the coaching staff not to think about the looming date with England at Edgbaston. On Friday they will come face-to-face with the team of Ben Stokes and his fearless “Bazball” blueprint with coach Brendon McCullum. Loading As Australia were slogging it out with India at the Oval for the right to be called World Test Champions, England’s players were intermingling training with rounds of golf in Scotland, ensuring they will be fresh and loose for the Ashes. The scenario Cummins wished to avoid was one where he, Scott Boland, Mitchell Starc and Cameron Green were compelled to bowl a big chunk of overs with minimal room for recovery before turning out in Birmingham. Partly, this is because Josh Hazlewood, ostensibly the first reserve, has an uncertain recent fitness record and was also held back until the second Test of the previous Ashes series in England in 2019.","pubDate":"2023-06-10 17:54:48","image_url":null,"source_id":"watoday","category":["sports"],"country":["australia"],"language":"english"},{"title":"Australia find Virat Kohli in way to World Test Championship title","link":"https://timesofindia.indiatimes.com/sports/cricket/icc-world-test-championship/australia-find-virat-kohli-in-way-to-world-test-championship-title/articleshow/100904167.cms","keywords":null,"creator":null,"video_url":null,"description":"A resolute Virat Kohli and first innings hero Ajinkya Rahane stand in Australia's way to the World Test Championship title as India head into the final day of the intriguing summit clash, requiring another 280 runs in the record chase of 444. The Kohli and Rahane duo added crucial 71-run unbeaten stand after an intent-filled knock from Rohit Sharma (43) in the final session as India ended the penultimate day of the 'Ultimate Test' at 164 for three at the Oval.","content":"Australia all-rounder Cameron Green might have taken a one-handed blinder in gully region to dismiss Shubman Gill but it sparked a debate in the cricketing fraternity over TV umpire's decision to rule in favour of the Aussies. World No. 1 Swiatek clinches third French Open title Top-5 highest scores by Indian players in ICC finals Top-5: Ajinkya Rahane’s overseas Test knocks Shardul equals Don Bradman and Allan Border's feat NBA Finals: Nuggets take 3-1 lead vs Heat after Game 4 Djokovic knocks Alcaraz out of the French Open Ajinkya Rahane: From Test wilderness to WTC Final WTC Final: Australia heap misery on floundering India Rahane becomes 13th Indian to score 5000 runs in Tests Highest Test scores by Australian batters vs India","pubDate":"2023-06-10 17:44:17","image_url":null,"source_id":"toi","category":["sports"],"country":["india"],"language":"english"},{"title":"Gill Posts Cryptic Tweet About Controversial Catch, Uses 'Facepalm' Emoji","link":"https://sports.ndtv.com/cricket/wtc-final-shubman-gill-posts-cryptic-tweet-about-controversial-catch-uses-facepalm-emoji-4111180","keywords":null,"creator":null,"video_url":null,"description":"Shubman Gill posted a picture of Cameron Green's catch along with an interesting caption after Day 4 of the WTC Final.","content":"Shubman Gill took to social media to post a screenshot of Cameron Green 's controversial catch to dismiss him on Day 4 of the World Test Championship (WTC) Final at The Oval on Saturday. Experts were divided over whether Green was able to complete the catch properly at third slip with some videos and pictures suggesting that the ball touched the ground when his hand made impact. However, the third umpire thought that the catch was fair and Gill was given out. The in-form India opener posted a picture of the catch on Twitter along with a cryptic caption which included the 'facepalm' emoji. pic.twitter.com/pOnHYfgb6L A focussed Virat Kohli stood between Australia and World Test Championship mace as India require another 280 runs to create history on what promises to be an intriguing final day of the summit clash. Kohli was batting on 44 off 60 balls and had Ajinkya Rahane (20 batting) for company during a stand of 71 for the fourth wicket as India ended the fourth day on 164 for 3 in pursuit of world record chase of 444. Having been set a mammoth target, India lost Shubman Gill (18 off 19) to a contentious catch before skipper Rohit Sharma (43 off 60) and Cheteshwar Pujara (27 off 47) brought about their own downfall to make it 93 for three in 31st over. Australia had declared their second innings at 270 for 8 midway into the afternoon session after an unbeaten 66 from Alex Carey . (With PTI inputs)","pubDate":"2023-06-10 17:39:21","image_url":null,"source_id":"ndtv","category":["sports"],"country":["india"],"language":"english"},{"title":"Why soft-signal rule didn’t come into play in Shubman Gill’s dismissal","link":"https://thenewsmill.com/2023/06/why-soft-signal-rule-didnt-come-into-play-in-shubman-gills-dismissal/","keywords":["Cricket","Sports","ANI"],"creator":["ANI"],"video_url":null,"description":"The News Mill","content":"Shubman Gill’s dismissal on the final ball of the second session became one of the biggest talking points on Day 4 of the ongoing World Test Championship (WTC) on Saturday. The question on everyone’s lips was: why wasn’t the soft dismissal call made? Shubman Gill’s edge off Scott Boland flew close to Cameron Green in the slips. The tall all-rounder dived towards his left to take a low catch. However, at first glance, there appeared to be some doubt over whether or not the ball touched the ground before Green took the one-handed catch. Amid the uncertainty on whether the catch was clean, the matter was referred to television umpire Richard Kettleborough. Camera angles showed Green getting some fingers under the ball as took the catch, but it couldn’t be said conclusively if the catch was clean. After an extended period, during which the catch was played and replayed from different camera angles, the television umpire ruled that the catch was clean. The decision was received with disbelief by Gill, who looked visibly disappointed as he trudged off the field of play. However, the decision became a bone of contention due to the lack of application of the soft signal. The soft signal didn’t come into play as the regulation was removed from the ICC Playing Conditions at the start of June, with the new laws coming into play for the first time when England played Ireland at Lord’s a week ago. The decision to withdraw the soft-signal rule was taken by a committee of the International Cricket Council (ICC), which has former India captain Sourav Ganguly as a member. “The on-field umpires will consult with the TV umpire before any decisions are taken,” the ICC confirmed when the changes were announced in May. “Soft signals have been discussed at previous cricket committee meetings over the last couple of years. The committee deliberated this at length and concluded that soft signals were unnecessary and at times confusing since referrals of catches may seem inconclusive in replays,” Ganguly, who represents the ICC’s Men’s Cricket Committee, said earlier. (ANI)","pubDate":"2023-06-10 17:34:09","image_url":null,"source_id":"thenewsmill","category":["sports"],"country":["india"],"language":"english"},{"title":"“Should not create dispute over this…”: Rajeev Shukla on Shubman Gill’s dismissal in WTC","link":"https://thenewsmill.com/2023/06/should-not-create-dispute-over-this-rajeev-shukla-on-shubman-gills-dismissal-in-wtc/","keywords":["Cricket","Sports","ANI"],"creator":["ANI"],"video_url":null,"description":"The News Mill","content":"The Board of Control for Cricket in India (BCCI) vice president Rajeev Shukla has revealed his thoughts on the Cameron Green catch that saw India opener Shubman Gill dismissed at a crucial stage of the ICC World Test Championship (WTC) final on Day 4 against Australia. On the fourth day of a gripping match at The Oval, Gill was declared out by TV umpire Richard Kettleborough at the stroke of tea after India got a strong start in their run chase, with 444 needed to win. Pacer Scott Boland found the edge of India’s opener’s bat and Cameron Green dove to his left in his preferred gully position to complete the catch, but the debate has opened up in the cricket world on whether the Australia all-rounder was successful in getting his hands under the ball and controlling it. Green immediately started celebrating the superb catch with his teammates. Fans and many players debated whether the batter was out or not as well as whether Green avoided hitting the ball on the grass when his hand came on the ground after catching it as soon as the ‘out’ decision was shown on the huge screen. Gill and India captain Rohit Sharma were left unconvinced by the decision. “We should not create a dispute over this. We should accept the decision of the Third umpire,” Rajeev Shukla told ANI. The success of India will depend on the two players who are in the middle when play resumes. Rahane’s outstanding performance for Chennai Super Kings (CSK) in the Indian Premier League (IPL) helped him gain a spot back in the India Test XI, and his brilliant 89 in the first innings demonstrated that he is back to his entertaining best. And with an unbeaten 44* on Saturday, Kohli went beyond a career tally of 2000 runs in Tests against Australia, becoming only the fifth Indian batter in history to do so. “Ajinkya Rahane and Virat Kohli are batting well and if everyone plays safe we can chase down the target as the target is not that big,” Shukla further added. Coming to the match, an eventful day of cricket came to an end with Virat Kohli and Ajinkya Rahane holding down India’s fort at the end of Day-4 of the ongoing World Test Championship Final 2023 between India and Australia on Saturday. At the end of the day, India scored 164/3 in 40 overs with Ajinkya Rahane 20(59) and Virat Kohli 44(60) unbeaten at the crease. (ANI)","pubDate":"2023-06-10 20:34:21","image_url":null,"source_id":"thenewsmill","category":["sports"],"country":["india"],"language":"english"},{"title":"100 per cent everyone believes India will win WTC final: Mohammed Shami","link":"https://thenewsmill.com/2023/06/100-per-cent-everyone-believes-india-will-win-wtc-final-mohammed-shami/","keywords":["Cricket","Sports","ANI"],"creator":["ANI"],"video_url":null,"description":"The News Mill","content":"Veteran pacer Mohammed Shami said that India will return to The Oval on the Day 5 of the ongoing ICC World Test Championship (WTC) final with full belief that they can win ‘The Ultimate Test’ against Australia An eventful day of cricket came to an end with Virat Kohli and Ajinkya Rahane holding down India’s fort at the end of Day-4 of the ongoing World Test Championship Final 2023 between India and Australia on Saturday. At the end of the day, India scored 164/3 in 40 overs with Ajinkya Rahane and Virat Kohli at the crease with scores of 20(59)* and 44(60)*. And if they succeed in chasing a target of 444 runs to win the WTC Final, it will mark the biggest fourth-inning run chase in Test history. “One hundred per cent everyone believes that tomorrow we will win the match. We always fight, we perform well around the world. So we believe and we will all come together to win this match,” Mohammed Shami said in a post-match press conference. Shami’s assurance is consistent with what Indian bowler Shardul Thakur said following day three when he stated that the squad believed they were capable of chasing down “450, maybe more”. “It doesn’t matter what happened in Sydney or Brisbane, we are playing here. We have to think about tomorrow and we will win the match,” he added. “I believe that the Test match should go until the fifth day and maybe until the last session. That’s the real test. So we have to bat well and they have to bowl well to save themselves,” said the India pacer. India’s batting stalwart Virat Kohli joined an elite list as he became the fifth Indian batter to score more than 2000 runs against Australia. While Rahane, who was impressive for Chennai Super Kings (CSK) in the Indian Premier League (IPL) and won his recall to the India Test XI in part because of that performance, demonstrated that he is back to his entertaining best with a brilliant 89 in the first innings. Shami believes India should be able to score the remaining 280 runs if the hitters continue to perform well. “If you bat well, 280 runs is not a big score. So I think you should bat normally as a Test match; focus on playing ball by ball. You should not look at the long target. When you keep small goals and targets, you will get more success,” Shami added. (ANI)","pubDate":"2023-06-10 20:34:09","image_url":null,"source_id":"thenewsmill","category":["sports"],"country":["india"],"language":"english"},{"title":"“Caught it in heat of moment…. thought it was clean”: Cameron Green on taking Shubman Gill’s catch","link":"https://thenewsmill.com/2023/06/caught-it-in-heat-of-moment-thought-it-was-clean-cameron-green-on-taking-shubman-gills-catch/","keywords":["Cricket","Sports","ANI"],"creator":["ANI"],"video_url":null,"description":"The News Mill","content":"Australia all-rounder Cameron Green is sure that he held on to the catch that ended India opener Shubman Gill’s innings during a pivotal moment of the ICC World Test Championship (WTC) final at The Oval on Saturday. On the fourth day of a gripping match at The Oval, Gill was declared out by TV umpire Richard Kettleborough at the stroke of tea after India got a strong start in their run chase, with 444 needed to win. Pacer Scott Boland found the edge of India opener’s bat and Cameron Green dove to his left in his preferred gully position to complete the catch, but the debate has opened up in the cricket world on whether the Australia all-rounder was successful in getting his hands under the ball and controlling it. Green immediately started celebrating the superb catch with his teammates. Fans and many players debated whether the batter was out or not as well as whether Green avoided hitting the ball on the grass when his hand came on the ground after catching it as soon as the ‘out’ decision was shown on the huge screen. Gill and India captain Rohit Sharma were left unconvinced by the decision as tea was taken right away. “At the time I definitely thought I caught it. I think in the heat of the moment, I thought it was clean and threw it up and obviously showed no sign of any doubt. And then it’s left up to the third umpire (Kettleborough) and he agreed,” Cameron Green said in a post-match press conference. The 24-year-old also displayed his athletic prowess by seizing an even better opportunity to knock top scorer Ajinkya Rahane during India’s opening innings. While Green is more known for his bowling and batting skills, he is now beginning to field quite the highlight reel in the challenging gully position he has finally mastered. “Ever since I’ve grown up I have put a lot of time and effort into it (catching). I think growing up I would always try to get myself in first or second slip and I have done that basically my whole junior career,” Green said. “I back myself that I can take a few nice catches and I was a bit disappointed the first day dropping that (easy) one, but it’s always nice to repay,” the all-rounder added. On what could be an exciting final day in south London, Green has advised his fellow bowlers to practise patience as they look for the final seven breakthroughs. Green is aware that there is still much work for both he and his teammates to complete. “It will be crucial (to stay patient) as it was today to kind of keep our nerve… one or two wickets and we’re back on top. We have to definitely be patient,” Green added. At the end of the day, India scored 164/3 in 40 overs with Ajinkya Rahane and Virat Kohli at the crease with scores of 20(59)* and 44(60)*. (ANI)","pubDate":"2023-06-10 19:34:23","image_url":null,"source_id":"thenewsmill","category":["sports"],"country":["india"],"language":"english"},{"title":"WTC final: Shubman Gill posts cryptic tweet about his controversial dismissal with image of Cameron Green’s catch","link":"https://thenewsmill.com/2023/06/wtc-final-shubman-gill-posts-cryptic-tweet-about-his-controversial-dismissal-with-image-of-cameron-greens-catch/","keywords":["Cricket","Sports","ANI"],"creator":["ANI"],"video_url":null,"description":"The News Mill","content":"India opener Shubman Gill’s controversial dismissal on the fourth day of the ongoing World Test Championship (WTC) final against Australia at the Oval stirred debate on social media platforms worldwide, and the situation only got worse until the star opener finally addressed it on his official social media accounts. On the fourth day of a gripping match at The Oval, Gill was declared out by TV umpire Richard Kettleborough at the stroke of tea after India got a strong start in their run chase, with 444 needed to win. Pacer Scott Boland found the edge of India opener’s bat and Cameron Green dove to his left in his preferred gully position to complete the catch, but the debate has opened up in the cricket world on whether the Australia all-rounder was successful in getting his hands under the ball and controlling it. Green immediately started celebrating the superb catch with his teammates. Fans and many players debated whether the batter was out or not as well as whether Green avoided hitting the ball on the grass when his hand came on the ground after catching it as soon as the ‘out’ decision was shown on the huge screen. Gill and India captain Rohit Sharma were left unconvinced by the decision as tea was taken right away. Virender Sehwag, Ravi Shastri, and many fans questioned the verdict of the TV umpire. Shubman has finally spoken out about being dismissed with a controversial catch. On his Twitter account, Gill uploaded a picture of Cameron Green’s catch along with two magnifying glass emojis and a disappointed expression emoji. He even shared the identical photo along with four clapping emojis on his Instagram story. ‍[?] pic.twitter.com/pOnHYfgb6L — Shubman Gill (@ShubmanGill) June 10, 2023 Coming to the match, An eventful day of cricket came to an end with Virat Kohli and Ajinkya Rahane holding down India’s fort at the end of Day-4 of the ongoing World Test Championship Final 2023 between India and Australia on Saturday. At the end of the day, India scored 164/3 in 40 overs with Ajinkya Rahane and Virat Kohli at the crease with scores of 20(59)* and 44(60)*. (ANI)","pubDate":"2023-06-10 19:34:11","image_url":null,"source_id":"thenewsmill","category":["sports"],"country":["india"],"language":"english"},{"title":"کرکٹ میچ کے دوران شہد کی مکھیوں کا حملہ، ویڈیو وائرل","link":"https://www.bolnewsurdu.com/news/sports-news/Story/92924/","keywords":["کھیلوں کی خبریں"],"creator":["Ahsan MuGhaL"],"video_url":null,"description":"آئرلینڈ میں کرکٹ میچ کے دوران گراؤنڈ میں ہزاروں شہد کی مکھیوں نے دھاوا بول دیا جس کے باعث میچ روکنا پڑگیا۔ عالمی میڈیا رپورٹس کے مطابق آئرلینڈ کے شہر کورک میں ڈومیسٹک کرکٹ کا میچ کھیلا جارہا تھا کہ اس دوران شہد کی ہزاروں مکھیوں نے گراؤنڈ پر دھاوا بول دیا۔ #ICYMI When bees trumped … The post کرکٹ میچ کے دوران شہد کی مکھیوں کا حملہ، ویڈیو وائرل appeared first on BOL News Urdu - بول نیوز اردو.","content":"عالمی میڈیا رپورٹس کے مطابق آئرلینڈ کے شہر کورک میں ڈومیسٹک کرکٹ کا میچ کھیلا جارہا تھا کہ اس دوران شہد کی ہزاروں مکھیوں نے گراؤنڈ پر دھاوا بول دیا۔ شہد کی مکھیوں کی آمد پر فوری طور پر امپائر سمیت تمام کھلاڑی گراؤنڈ میں حفاظتی اقدام کے طور پر منہ کے بل لیٹ گئے اور میچ کو روک دیا گیا۔ اس دوران شہدکی مکھیاں گراؤنڈ میں ہرطرف پھیل گئیں جس کے باعث مقامی بلدیہ سے مدد مانگی گئی اور بلدیہ کے عملے نے آکر مکھیوں کو گراؤنڈ سے نکالا، اس دوران میچ تقریباً ڈیڑھ گھنٹے تک معطل رہا جس کی وجہ سے 50 اوورز کے میچ میں سے 12 اوورز کم کرنا پڑے۔","pubDate":"2023-06-10 18:59:06","image_url":null,"source_id":"bolnewsurdu","category":["sports"],"country":["pakistan"],"language":"Urdu"},{"title":"News24.com | Kohli holds firm against Aussies as India chase record total to win World Test Championship","link":"https://www.news24.com/sport/Cricket/kohli-holds-firm-against-aussies-as-india-chase-record-total-to-win-world-test-championship-20230610","keywords":null,"creator":null,"video_url":null,"description":"Virat Kohli defied Australia on Saturday to give India hope of an extraordinary win in the World Test Championship final at The Oval.","content":"Virat Kohli defied Australia on Saturday to give India hope of an extraordinary win in the World Test Championship final at The Oval. India were 164-3 at stumps, still needing a further 280 runs to reach what would be a record-breaking total of 444 on Sunday's scheduled fifth and final day. Star batsman Kohli, however, was 44 not out, while Ajinkya Rahane was unbeaten on 20 after he had already marked his first Test in over a year by top-scoring with 89 in India's first-innings 296. SCOREBOARD | World Test Championship final: Australia v India The scale of India's task was emphasised by the fact that only four teams in 146 years of Test cricket have made more than 400 to win in the fourth innings, with the West Indies' 418-7 against Australia at St John's in 2003 the highest such total. Australia, by contrast, require just seven more wickets Sunday to win the only major global men's trophy to have so far eluded them and ensure they head into next week's Ashes opener against England at Edgbaston in buoyant mood. India captain Rohit Sharma set the initial tone for a daunting chase with several boundaries, including a pulled six off left-arm quick Mitchell Starc. But on the stroke of tea, opening partner Shubman Gill fell to a controversial catch when Cameron Green, who had taken an undisputed blinder in the first innings to remove Rahane, dived low to his left following an edge off Scott Boland. The decision was referred by the on-field umpires to TV official Richard Kettleborough. And with the 'soft signal' recently abolished, there was no on-field guidance for Kettleborough to follow in determining if the ball had brushed the turf after Green had grabbed hold. \"Kohli, Kohli, Kohli\" Kettleborough eventually ruled in Australia's favour, prompting chants of \"cheats, cheats, cheats\" from the massed ranks of India fans in a crowd of nearly 25,000 when the decision was flashed up on The Oval's giant screens. Rohit and Cheteshwar Pujara continued to attack Australia's quicks as India looked to go one better after losing the inaugural 2021 WTC final to New Zealand in Southampton. Spin, however, proved Rohit's undoing on a wearing pitch when he missed an attempted sweep against Nathan Lyon, bowling from around the wicket, with the batsman lbw for 43 off 60 balls despite his review. India lost another wicket without adding another run when Pujara, renowned as a patient accumulator of runs, attempted an extravagant upper-cut off Australia captain Pat Cummmins only to guide a simple catch to wicketkeeper Alex Carey as he fell for 27. But Kohli regained the initiative for India by clipping and driving Starc for boundaries greeted by chants of \"Kohli, Kohli, Kohli\" from his adoring fans in the stands. Earlier, Australia made 270-8 in their second innings before Cummins declared. Marnus Labuschagne, the world's top-ranked Test batsman, departed for his overnight 41 when he tentatively edged Umesh Yadav to Pujara at first slip. Ravindra Jadeja, who had accounted for first-innings century-makers Steve Smith and Travis Head on Friday, again bowled well, with the left-arm spinner removing Green for 25 in a return 3-58 in 23 overs. Jadeja's miserly haul may have left India questioning their decision to omit star off-spinner Ravichandran Ashwin, the world's top-ranked Test bowler, in order to play an extra seamer. But Carey, missed in the slips on 41, played Pujara well while top-scoring with 66 not out after adding a valuable seventh-wicket stand of 93 with the hard-hitting Starc (41).","pubDate":"2023-06-10 18:12:39","image_url":"https://scripts.24.co.za/img/sites/sport24.png","source_id":"news24","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Test pinnacle starts to complicate Australia’s Ashes plans","link":"https://www.watoday.com.au/sport/cricket/test-pinnacle-starts-to-complicate-australia-s-ashes-plans-20230610-p5dfkt.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Daniel Brettig"],"video_url":null,"description":"Perhaps only in European football is there a parallel with a Test Championship finale a matter of days before the Ashes.","content":"Manchester City’s legendary manager Pep Guardiola had some ideas on the thoughts running through Australian minds on day four at the Oval. Perhaps only in European football, where the FA Cup showpiece can be closely followed by an appearance in the Champions League decider , is there a parallel with the Test Championship final reaching its endgame a matter of days before the Ashes. Pat Cummins celebrates the wicket of Cheteshwar Pujara. Credit: Getty While Guardiola had to ponder the balance of his squad between those two tightly-packed assignments, Pat Cummins and Australia faced questions of time and resources after Alex Carey and Mitchell Starc ensured a declaration would be possible. Usually, a captain will ponder the number of runs being set, the sessions and hours left in the game, the deterioration of the surface and the notional tally of overs to be bowled. This time, it was impossible for Cummins and the coaching staff not to think about the looming date with England at Edgbaston. On Friday they will come face-to-face with the team of Ben Stokes and his fearless “Bazball” blueprint with coach Brendon McCullum. Loading As Australia were slogging it out with India at the Oval for the right to be called World Test Champions, England’s players were intermingling training with rounds of golf in Scotland, ensuring they will be fresh and loose for the Ashes. The scenario Cummins wished to avoid was one where he, Scott Boland, Mitchell Starc and Cameron Green were compelled to bowl a big chunk of overs with minimal room for recovery before turning out in Birmingham. Partly, this is because Josh Hazlewood, ostensibly the first reserve, has an uncertain recent fitness record and was also held back until the second Test of the previous Ashes series in England in 2019.","pubDate":"2023-06-10 17:54:48","image_url":null,"source_id":"watoday","category":["sports"],"country":["australia"],"language":"english"},{"title":"Australia find Virat Kohli in way to World Test Championship title","link":"https://timesofindia.indiatimes.com/sports/cricket/icc-world-test-championship/australia-find-virat-kohli-in-way-to-world-test-championship-title/articleshow/100904167.cms","keywords":null,"creator":null,"video_url":null,"description":"A resolute Virat Kohli and first innings hero Ajinkya Rahane stand in Australia's way to the World Test Championship title as India head into the final day of the intriguing summit clash, requiring another 280 runs in the record chase of 444. The Kohli and Rahane duo added crucial 71-run unbeaten stand after an intent-filled knock from Rohit Sharma (43) in the final session as India ended the penultimate day of the 'Ultimate Test' at 164 for three at the Oval.","content":"Australia all-rounder Cameron Green might have taken a one-handed blinder in gully region to dismiss Shubman Gill but it sparked a debate in the cricketing fraternity over TV umpire's decision to rule in favour of the Aussies. World No. 1 Swiatek clinches third French Open title Top-5 highest scores by Indian players in ICC finals Top-5: Ajinkya Rahane’s overseas Test knocks Shardul equals Don Bradman and Allan Border's feat NBA Finals: Nuggets take 3-1 lead vs Heat after Game 4 Djokovic knocks Alcaraz out of the French Open Ajinkya Rahane: From Test wilderness to WTC Final WTC Final: Australia heap misery on floundering India Rahane becomes 13th Indian to score 5000 runs in Tests Highest Test scores by Australian batters vs India","pubDate":"2023-06-10 17:44:17","image_url":null,"source_id":"toi","category":["sports"],"country":["india"],"language":"english"},{"title":"Gill Posts Cryptic Tweet About Controversial Catch, Uses 'Facepalm' Emoji","link":"https://sports.ndtv.com/cricket/wtc-final-shubman-gill-posts-cryptic-tweet-about-controversial-catch-uses-facepalm-emoji-4111180","keywords":null,"creator":null,"video_url":null,"description":"Shubman Gill posted a picture of Cameron Green's catch along with an interesting caption after Day 4 of the WTC Final.","content":"Shubman Gill took to social media to post a screenshot of Cameron Green 's controversial catch to dismiss him on Day 4 of the World Test Championship (WTC) Final at The Oval on Saturday. Experts were divided over whether Green was able to complete the catch properly at third slip with some videos and pictures suggesting that the ball touched the ground when his hand made impact. However, the third umpire thought that the catch was fair and Gill was given out. The in-form India opener posted a picture of the catch on Twitter along with a cryptic caption which included the 'facepalm' emoji. pic.twitter.com/pOnHYfgb6L A focussed Virat Kohli stood between Australia and World Test Championship mace as India require another 280 runs to create history on what promises to be an intriguing final day of the summit clash. Kohli was batting on 44 off 60 balls and had Ajinkya Rahane (20 batting) for company during a stand of 71 for the fourth wicket as India ended the fourth day on 164 for 3 in pursuit of world record chase of 444. Having been set a mammoth target, India lost Shubman Gill (18 off 19) to a contentious catch before skipper Rohit Sharma (43 off 60) and Cheteshwar Pujara (27 off 47) brought about their own downfall to make it 93 for three in 31st over. Australia had declared their second innings at 270 for 8 midway into the afternoon session after an unbeaten 66 from Alex Carey . (With PTI inputs)","pubDate":"2023-06-10 17:39:21","image_url":null,"source_id":"ndtv","category":["sports"],"country":["india"],"language":"english"},{"title":"Why soft-signal rule didn’t come into play in Shubman Gill’s dismissal","link":"https://thenewsmill.com/2023/06/why-soft-signal-rule-didnt-come-into-play-in-shubman-gills-dismissal/","keywords":["Cricket","Sports","ANI"],"creator":["ANI"],"video_url":null,"description":"The News Mill","content":"Shubman Gill’s dismissal on the final ball of the second session became one of the biggest talking points on Day 4 of the ongoing World Test Championship (WTC) on Saturday. The question on everyone’s lips was: why wasn’t the soft dismissal call made? Shubman Gill’s edge off Scott Boland flew close to Cameron Green in the slips. The tall all-rounder dived towards his left to take a low catch. However, at first glance, there appeared to be some doubt over whether or not the ball touched the ground before Green took the one-handed catch. Amid the uncertainty on whether the catch was clean, the matter was referred to television umpire Richard Kettleborough. Camera angles showed Green getting some fingers under the ball as took the catch, but it couldn’t be said conclusively if the catch was clean. After an extended period, during which the catch was played and replayed from different camera angles, the television umpire ruled that the catch was clean. The decision was received with disbelief by Gill, who looked visibly disappointed as he trudged off the field of play. However, the decision became a bone of contention due to the lack of application of the soft signal. The soft signal didn’t come into play as the regulation was removed from the ICC Playing Conditions at the start of June, with the new laws coming into play for the first time when England played Ireland at Lord’s a week ago. The decision to withdraw the soft-signal rule was taken by a committee of the International Cricket Council (ICC), which has former India captain Sourav Ganguly as a member. “The on-field umpires will consult with the TV umpire before any decisions are taken,” the ICC confirmed when the changes were announced in May. “Soft signals have been discussed at previous cricket committee meetings over the last couple of years. The committee deliberated this at length and concluded that soft signals were unnecessary and at times confusing since referrals of catches may seem inconclusive in replays,” Ganguly, who represents the ICC’s Men’s Cricket Committee, said earlier. (ANI)","pubDate":"2023-06-10 17:34:09","image_url":null,"source_id":"thenewsmill","category":["sports"],"country":["india"],"language":"english"}]}