{"newsArray":[{"title":"Candice Warner addresses David’s BBL future","link":"https://www.cairnspost.com.au/sport/cricket/candice-warner-addresses-davids-bbl-future/video/3d87c2507433e520f4e1e33a05733cf7","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket: Candice Warner has addressed the future of husband David Warner, with reports he may not play again in the BBL.","content":null,"pubDate":"2022-08-02 23:36:20","image_url":null,"source_id":"cairnspost","country":["australia"],"category":["sports"],"language":"english"},{"title":"IND vs WI 3rd T20 2022 highlights: India vs West Indies 3rd T20 highlights 2022 how to watch","link":"https://thesportsrush.com/cricket-news-ind-vs-wi-3rd-t20-2022-highlights-india-vs-west-indies-3rd-t20-highlights-2022-how-to-watch/","keywords":["Cricket","India tour of West Indies 2022"],"creator":["Gurpreet Singh"],"video_url":null,"description":"IND vs WI 3rd T20 2022 highlights: Suryakumar Yadav’s masterclass with the bat helped team India nail the run-chase at St Kitts. During the third T20I of the ongoing India’s tour of West Indies at Basseterre in St Kitts, team India nailed the run-chase in emphatic fashion by 7 wickets, to go 2-1 up in… The post IND vs WI 3rd T20 2022 highlights: India vs West Indies 3rd T20 highlights 2022 how to watch appeared first on The SportsRush.","content":"IND vs WI 3rd T20 2022 highlights: Suryakumar Yadav’s masterclass with the bat helped team India nail the run-chase at St Kitts. During the third T20I of the ongoing India’s tour of West Indies at Basseterre in St Kitts, team India nailed the run-chase in emphatic fashion by 7 wickets, to go 2-1 up in the five-match T20I series. En route the target of 165, team India, akin the second T20I a day before, lost Rohit Sharma early, albeit this time around, he was forced to retire hurt during the second Over of the chase. However, after a string of low scores, Rohit’s opening partner in the ongoing series, Suryakumar Yadav, did what he does best, to nearly single-handedly rule the match in India’s favour, with a stellar innings of 76 off 44 deliveries, aided by the help of 8 Fours and 4 Sixes. Shreyas Iyer (24 off 27) and Rishabh Pant (33* off 26) proved to be Kumar’s able partners at the other end, as India clinched the match with an Over to spare. The boys fought hard today – but feel short vs 🇮🇳 @BCCI in a competitive encounter. However the series remains alive #WIvIND #MenInMaroon pic.twitter.com/tIWzDIN9Zd — Windies Cricket (@windiescricket) August 2, 2022 Earlier, on the back of a scintillating innings from the Windies Southpaw opener Kyle Mayers (73 off 50), the ‘Men in Maroon’ posted 164/5 in their 20 Overs. Hardik Pandya (4-0-19-1) yet again was economical in the third successive T20I, while Arshdeep Singh (4-0-33-1) was impressive again during the death Overs. No points for guessing that it was Suryakumar Yadav, who was fittingly adjudged the ‘Player of the Match’ for a match-winning half-century knock. Fans can watch the highlights of the 3rd T20I on the FanCode app. However, only those who have paid the subscription fees for the tour are eligible for the same. Other than that, fans can also watch the highlights of the same on the West Indies YouTube channel. However, one will have to wait till early morning (IST) for the video to be uploaded on the platform. Click here, to watch the highlights of the 3rd T20I between India and West Indies.","pubDate":"2022-08-02 20:57:46","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"“Hopefully it should be okay”: Rohit Sharma confident of playing 4th T20 vs West Indies in Lauderhill despite back spasm","link":"https://thesportsrush.com/cricket-news-hopefully-it-should-be-okay-rohit-sharma-confident-of-playing-4th-t20-vs-west-indies-in-lauderhill-despite-back-spasm/","keywords":["Cricket","India","India tour of West Indies 2022","Rohit Sharma","West Indies"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Rohit Sharma confident of playing 4th T20 vs West Indies: The Indian captain suffered a back spasm while batting at Warner Park tonight. India captain Rohit Sharma has expressed pleasure in watching opening partner Suryakumar Yadav play a match-winning knock to seal a 165-run chase in the recently concluded third T20I against West Indies in… The post “Hopefully it should be okay”: Rohit Sharma confident of playing 4th T20 vs West Indies in Lauderhill despite back spasm appeared first on The SportsRush.","content":"Rohit Sharma confident of playing 4th T20 vs West Indies: The Indian captain suffered a back spasm while batting at Warner Park tonight. India captain Rohit Sharma has expressed pleasure in watching opening partner Suryakumar Yadav play a match-winning knock to seal a 165-run chase in the recently concluded third T20I against West Indies in Basseterre. Opening the batting for the third consecutive time, Yadav didn’t take much time before finding his rhythm. Having entered his zone on the back of playing some eye-catching shots, there was no stopping Yadav as he raced through to a stroke-filled 76 (44) at a strike rate of 171.72. Yadav, 31, hit eight fours and four sixes to win his fourth match award in 22nd T20I. “It is very important that if you get a start in this format, you should convert it. It does well for the team. The 30s and 40s look good but when you get past 70-80 and get a hundred [as well], then you’re scoring those runs for the team,” Sharma told ESPN Caribbean during the post-match presentation ceremony. Sky’s range is something that troubles even some of the top class bowlers in t20s. Brilliant batting @surya_14kumar — Irfan Pathan (@IrfanPathan) August 2, 2022 “Good partnership with [Shreyas] Iyer. When you are chasing a target like that anything can happen. It was not an easy target and the pitch had something for the bowlers. It was important for us to pick the right shots off the right balls.” Sharma, who himself hit a four and six each during his five-ball stay at the Warner Park, walked back to the pavilion in the second over to give a massive scare to the fans of the Indian cricket team. It was only after some time that BCCI (Board of Control for Cricket in India) tweeted to confirm Sharma suffering a back spasm . The 35-year old player was seen sitting in the dugout by the end of the match to provide a sigh of relief to one and all. Being asked about the extent of the injury, Sharma sounded comfortable and fit enough to take part in the fourth T20I on Saturday. “My body is OK, we have a few days in between so hopefully it should be OK,” Sharma said. A three-day break between the third and fourth T20Is should be enough for Sharma to recover assuming his injury isn’t a major one.","pubDate":"2022-08-02 20:40:57","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Cricket-Yadav powers India to 2-1 series lead in West Indies","link":"https://www.thestar.com.my/sport/cricket/2022/08/03/cricket-yadav-powers-india-to-2-1-series-lead-in-west-indies","keywords":null,"creator":null,"video_url":null,"description":"(Reuters) - Opener Suryakumar Yadav scored an impressive 76 as India defeated West Indies by seven wickets in the third Twenty20 international in Basseterre on Tuesday, taking a 2-1 lead in the five-match series. Read full story","content":null,"pubDate":"2022-08-02 19:57:00","image_url":"https://apicms.thestar.com.my/uploads/images/2022/08/03/1682601.jpg","source_id":"thestar_my","country":["malaysia"],"category":["sports"],"language":"english"},{"title":"India vs West Indies, 3rd T20I Highlights: Suryakumar Yadav Stars As India Beat West Indies To Take .. - NDTV Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMiamh0dHBzOi8vc3BvcnRzLm5kdHYuY29tL3dlc3QtaW5kaWVzLXZzLWluZGlhLTIwMjIvaW5kaWEtdnMtd2VzdC1pbmRpZXMtM3JkLXQyMGktbGl2ZS1zY29yZS11cGRhdGVzLTMyMTgyMTnSAXBodHRwczovL3Nwb3J0cy5uZHR2LmNvbS93ZXN0LWluZGllcy12cy1pbmRpYS0yMDIyL2luZGlhLXZzLXdlc3QtaW5kaWVzLTNyZC10MjBpLWxpdmUtc2NvcmUtdXBkYXRlcy0zMjE4MjE5L2FtcC8x?oc=5","keywords":null,"creator":null,"video_url":null,"description":"India vs West Indies, 3rd T20I Highlights: Suryakumar Yadav Stars As India Beat West Indies To Take ..  NDTV SportsStart of third West Indies vs India T20I pushed back by 90 minutes  ESPNcricinfoIndia vs West Indies Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update- India Tour of West Indies, 3rd T20I  Cricket AddictorIND vs WI 3rd T20 Highlights: India win by 7 wickets, restores series lead to 2-1  The Indian ExpressIndia vs West Indies 3rd T20I Highlights: India Beat Windies By 7 Wickets, Take 2-1 Lead  News18View Full coverage on Google News","content":null,"pubDate":"2022-08-02 19:41:15","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Massive boilover as young star upstages McKeon","link":"https://www.themercury.com.au/sport/commonwealth-games/commonwealth-games-day-5-latest-news-results-medal-tally-from-birmingham/news-story/8c2fab6430a59e209164661879bba2b7","keywords":["Commonwealth Games","Sport news and galleries"],"creator":null,"video_url":null,"description":"It was an Australian clean sweep in the women’s 100m freestyle final but the order was a huge shock with the greatest female swimmer on the planet beaten by a rising star.","content":"Emma McKeon finished with bronze behind Shayna Jack in second and an incredible swim won Mollie O’Callaghan the gold.“I’m really happy. And I’m happy for these amazing girls,” O’Callaghan said afterwards. “Especially Emma. She is an absolute idol so it is really nice to race alongside her at this time. And especially Shayna Jack too. Coming back from stuff, so I’m very happy.”Despite missing out on gold, McKeon, who will swim 16 races in six days at the Games, was equally thrilled to be challenged by the best in the world.“It is incredible. We get to push each other, year in and year out and it ups the standard every time,” McKeon said.“I know all over the world there will be young ones coming through and I have these two back home to race all the time. And I’m still hungry as ever. I think that I put into perspective, I’ve probably done better than I should have here as well. “So, I’m just so stoked to be here and be in the hundred with those girls.”Metros Comm Games MTkickerFOLLOW THE LATEST NEWS BELOWCODY SIMPSON TAKE A BOWCody Simpson has finished fifth in his first Commonwealth Games final. Canada’s Joshua Liendo Edwards stormed home to capture the gold in 51.24 seconds ahead of James Guy of England and Australia’s Matthew Temple.Eyes were on Simpson. though, given his profile in the world of pop music.“It was an amazing experience. I told my coach before the race and he said whatever happens, it is gathering intel, gaining experience. And I’m glad I went out there and put together the best race I could tonight. Just off my PB, so, I cannot ask for much more, aside from learning how to deal with the experience and pressure bit. It is very exciting,” he told Channel 7.Asked what was more nerve-wracking, a Commonwealth Games final or performing in front of 10,000 screaming girls, Simpson reckoned it was the former.“Right now, I think it is this. I think with experience comes confidence. And I’m still gathering the experience, so still gathering the experience, so still gaining confidence, I am happy to be here. And I think, win or lose today, I’m going to go back to the drawing board and make sure I come back stronger. I’ve already way ahead where I thought I would be at this stage.“People are swimming later into their 20s, it leaves so much room to be able to come into it later if you want to. And I want to inspire young people to know that they can do whatever it is they want to do. Even if they feel like it is too late they are too old to pick something up, it is never too late.”DEKKERS SHOWS HER CLASS TO TAKE GOLDAustralian teenager Lizzie Dekkers has won gold in the women’s 200 metres butterfly at the Commonwealth Games.The 18-year-old flashed home over the last lap after being second at the final turn to win in 2:07.26, just ahead of England’s Laura Stephens.Brianna Throssell won the bronze for Australia, edging out her team mate Abbey Connor.One of Australia’s brightest talents, Dekkers was unlucky to miss the Dolphins team for last year’s Tokyo Olympics when she finished second at the trials but missed the qualifying time.BRONZE AND SILVER START THE NIGHT IN THE POOLChelsea Hodges began the fifth night of finals at the Commonwealth Games by claiming bronze in the 100m breaststroke for Australia. The South African pair of Lara Van Niekerk and Tatjana Schoenmaker taking the top two spots.After the race all finalists gathered together in a group hug in a touching moment and then exited the pool together.“We actually planned in marshalling that all eight of us are going to come together and show everyone how close we all are and how much we love each other. It is the friendly games and I think we showed that to everyone tonight.”Crucially for Hodges, who turned 21 last month, the bronze medal also assures her of a start in the Australian women’s medley relay team on Thursday, where Australia will start as the gold medal favourites.Bradley Woodward then finished like a train down the last 50m of the 200m backstroke to take silver in one of the races of the Games. Brodie Williams of England touching in 1:56.40, only one hundredth of a second in front of Woodward.CHALMERS NOT NAMED IN RELAYBy Julian LindenKyle Chalmers has been left off the Australian team for the mixed medley relay final at the Commonwealth Games after the Dolphins selectors stuck with the same lineup used in last year’s Tokyo Olympics.Chalmers has been in great form in Birmingham, winning three gold medals, but the coaches decided to retain the same combination that performed so well in Tokyo last year, winning a bronze medal.That means Emma McKeon - Australia’s greatest swimmer - will swim the concluding freestyle leg.World record holder Kaylee McKeown will swim the backstroke leg while Zac Stubblety-Cook will do breaststroke and Matt Temple butterfly.The team is at unbackable odds to win the gold.A new event on the Commonwealth Games program, the makeup of mixed relays is always one of the trickiest for selectors to make because of the different options available.Many team use male swimmers for the first two legs then females for the last two.Australia’s preference is to start and finish with females. Australia’s biggest rivals for the gold medal - England - have also opted for the same combination.Although he missed out on the mixed medley relay, Chalmers is expected to be an automatic pick for the men’s medley relay on the final day of competition.AGONY IN THE 100m HEATSThere was drama during the 100m heats with Swaziland’s Ayanda Malaza spectacularly crashing to the track after just 20m.Malaza had pinged his hamstring and lay motionless for several minutes before officials rushed to his aid.The 19-year-old broke down in tears and was eventually taken off the track in a wheelchair with the capacity crowd at Alexander Stadium giving him a rousing reception.It was a dramatic race whihc had already suffered a false start after Nigeria’s Godson Oke Oghenebrume began too early.Malaza could be seen clutching his hamstring as he waved his arm for attention.And medics quickly rushed to the scene as Malaza began crying.There was no chance of the star being able to walk off the track.Meanwhile, Australia’s fastest man Rohan Browning has put his world championships debacle behind him by cruising through to the semi-finals.Browning didn’t get out of the heats in Eugene last month but the Flying Mullet was back in town, finishing in 10.10sec.“I’ve been wondering where that’s been all year. It’s been a real season of ups and downs.The losses started to pile up,” Browning said.“But I heard a great quote over on the PGA Tour earlier this week, a winner is just a loser who kept on trying. I tried to channel a bit of that in this Commonwealth Games. Always good to win the heat.”COUGHLAN TAKES JUDO GOLDAustralia’s Aofie Coughlan has won gold in the under 70kg women’s judo match after outlasting Jamaica’s Ebony Drysdale Daley.The two couldn’t be separated after allotted time and had to go into a golden score.Coughlan was the aggressor throughout, nearly getting an ippon with a minute to go, but Drysdale Daley, the first Jamaican to compete for gold, held on throughout.But she received three shidos, with Coughlan winning via disqualification.It’s the third medal for Australia from the Coventry Arena this evening.Jake Benstead won via ippon over Northern Ireland’s Josuha Green in the bronze medal match in the men’s under 73kg.Katharina Haecker won via ippon over Jamaica’s Lauren Semple in the under 63kg women’s event.ULTIMATE SACRIFICEBy Eliza BarrA team-mate’s selfless sacrifice has proved worth it after Australia’s Tyson Bull took out the horizontal bar silver silver medal in the Commonwealth Games artistic gymnastics - after fellow Australian Clay Stephens sacrificed his reserve spot to give Bull the opportunity.Bull had crashed out in his qualifier on the apparatus and failing to make the final.When team-mate Jesse Moore pulled out due to injury, Stephens would have qualified as the first reserve - but he gave up his spot to give Bull his chance as the second reserve.He held the gold medal position the entire final, until he was pipped at the post by Cyprus’ Ilia’s Georgiou with just 0.233 between them.Mitchell Morgans was also denied the bronze by a narrow margin, coming in fourth to Cyprus’ Marios Georgiou when Ilias took the top position on the leaderboard.After falling short in Monday’s finals, there were tears from Australia’s Emily Whitehead when she clinched the bronze medal on floor.It is the only medal for the reigning Oceania all-round champion at this year’s games.GOLDEN BEAMBy Eliza BarrIt’s double the fun and double the glory for Australia’s female gymnasts, with debutante Kate McDonald claiming gold in the balance beam and Georgia Godwin taking out silver in her fourth medal of the Commonwealth Games.Melbourne’s McDonald had fallen just short of her own expectations in the uneven bars on Monday - but the moment she knew she had secured a spot on the podium, and overcome her senior team-mate Godwin, prompted instant tears on the sidelines.Godwin had come in strong with a solid gold medal performance in the all-around and another on the vault, followed by a silver in the uneven bars.James Bacueti has changed the cruel fortunes of Australia’s male artistic gymnasts by landing a bronze medal in the vault. The Australian men’s team just missed out on bronze and teen star Jesse Moore pulled out of the all-around, the horizontal bar and the rings finalsBacueti broke the duck to finish on the podium behind England’s Jake Jarman and Gianni Regini-Moran.Tyson Bull and Mitchell Morgans were out of luck in the men’s parallel bars, placing outside the medal positions.WALES NO MATCH FOR DIAMONDSBy Erin BarrIt was far from a perfect game but despite missing key midcourter Paige Hadley, ruled out with an injury, the Diamonds claimed their fourth win of the Commonwealth Games.Hadley, who hobbled off the court in the win against South Africa, watched the bench with a heavily strapped up right calf muscle. A few shaky moments, including some out of character handling errors, helped keep Wales in touch with the table leaders Australia in the first quarter, which ended 20-11. Diamonds emerged for the second quarter with a bit of extra focus - stepping it up and keeping Wales to just seven goals.Gretel Bueta started at GA tonight and is yet to drop a shot, netting 18 goals. Diamonds go into the second half up 42-18. The dominance continued in the second half with Diamonds rounding out the game 79-33.CHALMERS ON TRACK FOR NO.4Kyle Chalmers is on track to win his fourth gold medal at the Commonwealth Games after Australia smashed the opposition to qualify fastest for the final of the mixed medley relay.Chalmers did not swim in Tuesday night’s heats but is a certainty to be selected for the anchor leg in Wednesday morning’s final after blowing his rivals away 24 hours earlier to win the individual 100m freestyle final.King Kyle has also won two gold medals in freestyle relays in Birmingham and it would take a major upset for Australia not to win the mixed medley because of the incredible talent they have at their disposal.The lineup for the final won’t be announced until the start of the finals season but is likely to include Kaylee McKeown (backstroke), Zac Stubblety-Cook (breaststroke), Emma McKeon (butterfly) and Chalmers.With Prince William and the Duchess of Cambridge Kate Middleton watching from the stands, Australia was represented by Mitch Larkin, Sam Williamson, Alex Perkins and Madi Wilson, who combined to post the fastest overall time of 3:45.34 - almost six seconds clear of the next best.Swimming wrap - Men’s 50m freestyleThe Aussie teenage star who’s been beating Chalmers’ national age group records has stormed into the semifinals of his first individual race at the Commonwealth Games in Birmingham.Flynn Southam, 17, has already won two gold medals in relays in his maiden appearance at a senior international event.And now the gun youngster has made it through to the semis of the men’s one-lap sprint, even though it’s not his strongest event.He only got the call up when Isaac Cooper was sent home for ‘wellbeing’ issues but safely made it through the heats, posting the 12th fastest time overall.Australia’s Tom Nowakowski, the national champion, was second quickest overall for Wednesday morning’s semis while Grayson Bell advanced with the ninth best time.Women’s 50m backstrokeAussie ironwoman Kaylee McKeown eased into the semi finals of the 50m backstroke with a controlled heat swim.McKeown has already won gold medals in the 100m and 200m backstroke and a silver in the 200m individual medley but is still firing with three more events to go, including two relays.She finished second in her heat in a time of 28.09 to qualify fourth quickest overall behind her Canadian rival Kyle Masse.Australia’s Bronte Job, swimming in the lane next to Masse, was second overall while teenage star Mollie O’Callaghan - won her heat and was fifth overall. She already has three golds and a silver and is also through to the 100m freestyle final.Men’s 1500m freestyleRising teenage distance swimmer Sam Short put himself in position to win gold in the best event on the program after setting the fastest time for Thursday morning’s final.A silver medallist in the 400m, Short won his heat in 15:02.66 - more than 20 second clear of the next best, his Aussie team mate Kieren Pollard (15:23.46).Short’s prospects of winning gold were given a massive lift following the withdrawal of Welshman Dan Jervis, who was the likely favourite.Jervis contracted Covid after making the final at last month’s world championships and issued a heartfelt statement explaining that he had been unable to properly train in the weeks between.Men’s 200m backstrokeAustralia’s three entrants all qualified directly for the final.Brad Woodward was the fastest Aussie, finishing second in his heat to qualify third overall.Josh Edwards-Smith won his heat to be sixth while Mitch Larkin was second in the same heat and seventh.England’s Luke Greenback, the bronze medallist in the event at last year’s Tokyo Olympics, posted the top time to go into the final as the gold medal favourite.Women’s 200m butterflyAustralian teenager Lizzie Dekkers was nearly two seconds faster than her nearest rival as she topped the charts in a time of 2:07.62.With world champion Summer McIntosh skipped the race, Dekkers has a great shot at winning her first gold medal at senior international level.Her team mate Abbey Connor was third while another Aussie, Brianna Throssell also made the final as the fifth best qualifier.9:15PM FLYING MULLET INTO FINALROHAN Browning has declared there will be no repeat of Tokyo as he eyes a berth in the Commonwealth Games 100m final.Australia’s fastest man bounced back from his world championships disappointment with a stunning 10.10sec heat victory.The Flying Mullet became a household name after winning his heat at the Olympic Games last year but then failed to get out of the semi-finals.Browning, 24, was brimming with confidence after his first look at Alexander Stadium, stating he had plenty left for Wednesday night’s finals.“It is by far my best run for the year,” he said. “Now I don’t want a repeat of Tokyo where I was out in the semis, I want to keep a little bit of powder dry for the final.”Browning was the equal fourth fastest through to the semi-finals with Sri Lanka’s Yupun Abeykoon clocking the fastest time of 10.06sec in the qualifying round.He will be joined in the semi-finals by his Australian teammate Jake Doran who finished second (10.39sec) in an earlier heat.It has been an interrupted year for Browning through illness and injury and it found him out at the world championships in Eugene, Oregon, where he ran 10.22sec to be eliminated.“I tried not to take it to heart, there is always that humiliation element of when you get run out in the heats,” he said.“I tried to bounce back from it, not take it to heart and just trust that the form is there, it’s just in the execution. I think I have tapped into a good vein of form for these championships.“This year I have struggled a bit on the circuit, the losses really started to pile up and I’ve been wondering where that’s been all year.“It’s been a real season of ups and downs but I heard a great quote over on the PGA Tour earlier this week, a winner is just a loser who keeps on trying. I tried to channel a bit of that in this Commonwealth Games.“I knew I had a run like that in me, I stumbled a bit out of the blocks, it was far from the perfect race. The conditions out here are pretty average and I just want to keep progressing.”9:05PM AUSSIE INJURY ISSUESAustralian midcourter Paige Hadley will miss today’s match against Wales with a calf injury.Hadley, 29, injured her right calf in the Diamonds’ 25-goal win over South Africa yesterday.“Paige is one of the toughest competitors in netball, and we will continue to work with our medical team on her return to the court,” said Australian Diamonds head coach Stacey Marinkovich.“We have a versatile and dynamic team, and we are focused on improving performance as we progress towards the business end of the Birmingham 2022 Commonwealth Games.”freak accident at the world championships last month has made Australian runner Catriona Bisset hungrier than ever as she hunts for gold at Commonwealth Games.The 800m athlete was left with 11 stitches in her thigh after being knocked over on the home straight and accidentally stamped on by a rival’s spikes on the home straight in Oregon.Incredibly, Bisset picked herself up, finished the race and qualified for the semi-finals.While the injury has not impacted her running, Bisset gave a stomach-turning description of the recovery.“It’s all closed and scabbed over now, so there’s none of that gnarly, pussy, gross stuff,” the 28-year-old said.“All the bruising’s disappeared now, as well, so it’s finally a normal skin colour, rather than bright purple.“It gives me a lot of motivation to run in this next one.“I feel like I didn’t really get a good crack at worlds and I’m in really good shape. It’s been a pretty flawless build-up to these majors, which is why it’s definitely really heartbreaking to have this freak accident.”AUSSIE GETS THORUGH ON THE LINEBy Scott GullanAustralia’s second fastest man Jake Doran has qualified for the 100m semi-finals.The national champion finished second in his heat in 10.39sec which got him an automatic passage through to Wednesday’s finals.Gold medal favourite South Africa’s Akani Simbine won the heat in 10.09sec.Australia’s fastest man Rohan Browning is set to go in the ninth heat.It is a cut-throat qualifying in the 100m with only the first two in each heat guaranteed a spot in the semi-finals with the next seven fastest also advancing.Australia enjoyed an excellent start to the athletics program with heptathlete Taneille Crase winning the opening event on the track, the 100 hurdles in a personal best 13.42sec.And moments later Henry Frayne confirmed his place in the long jump final by leaping 7.85m with his first qualifying jump.He will be joined in the final by teammate Chris Mitrevski who recorded 7.76m with his second jump.HOCKEYROOS IN TENSE WINBy Joe BartonFor the second time in 24 hours, Australian hockey reigned supreme over arch rivals New Zealand – this time with the Hockeyroos doing the damage.12 hours after the Kookaburras destroyed their rivals 7-2 to move atop Pool A in the men’s tournament, Australia’s women repeated the dose with a tense 1-0 victory on Tuesday morning.The win keeps Australia’s perfect record at Birmingham intact and puts them in the box seat to finish on top of Pool B with just a match against Scotland to come on Wednesday.This was a match the Hockeyroos had circled since the draw was made public, with a chance for some retribution for the gold medal defeat on the Gold Coast four years ago.Now comes one final pool game, against Scotland on Wednesday, and potentially two more victories to secure the ultimate redemption of Commonwealth Games gold.In a cagey match, in which Australia was frequently saved by last-ditch defensive efforts from the likes of Renee Taylor and Claire Colwill, it was the first-quarter goal to Kaitlin Nobbs that split the teams at the break.Nobbs converted from the penalty spot after New Zealand’s defence denied a certain goal with a foot – leading to a penalty stroke being awarded.It continues a dream tournament for Nobbs, who has five goals for the tournament, hammered home a hat-trick in the opener against Kenya and also brought up her 100th game in green and gold this week.6:57AM SPLIT LOYALTIES FOR AUSSIE Cricket star Mitchell Starc will arrive in Birmingham this week – but his eyes may be focused away from Edgbaston Stadium, where wife Alyssa Healy is leading Australia’s women’s cricket charge.Australia have started with consecutive wins, following a scare against India in their opener, but Starc hasn’t been in the stands.Instead, he was back home to attend some weddings — including that of Test captain Pat Cummins to Becky Boston in Byron on Friday. Starc is sure to be in the stands watching the women’s bid to win the maiden Commonwealth Games T20 gold, but Healy believes the major drawcard that lured the left-arm quick to the UK was brother Brandon, who is competing in the high jump.“I think he’s coming over for Brandon more than me,” she said.SWIM STAR WOULD HAVE ‘CUT FINGER OFF’ TO WIN Making history at the Commonwealth Games was not enough for South Africa’s swimming hero Chad Le Clos with the 18-time medallist denied gold in the men’s 200 metres butterfly. The medal saw Le Clos join shooters Michael Gault and Phil Adams as the most decorated Commonwealth Games athletes of all time and also came 10 years to the day since he beat Michael Phelps in the same event at the 2012 London Olympics. But the 30-year-old could not hide his frustrations. “I’m gutted not to have won, I’ll be honest,” he said afterwards. “I would’ve cut my finger off to win tonight. It meant everything to me and my family – everyone’s in the stands, my friends flew out for this race.” Le Clos was beaten to the wall by New Zealand’s Lewis Clareburt with a winning time of 1:55.60 seconds. “Fair play to Lewis, he had a great race,” he added. “He said he watched me growing up and I said, ‘man, did you have to do it on my day? Could you not have given me one more time?” Le Clos’s medal haul from four Commonwealth Games includes seven gold, four silver and seven bronze.FANS ANGRY OVER BIZARRE COMM GAMES INCIDENTS Eliza Barr A bus crash involving an allegedly intoxicated driver, illegal parking and snaking queues for major events are among the dramas that have been overcome by organisers since the Commonwealth Games kicked off last week.Several people were injured when a bus carrying spectators from the Rugby Sevens in Coventry back to the Birmingham city centre collided with three cars on July 30.There were no serious injuries and a 27-year-old man was subsequently arrested over allegations of drug driving and causing injury to a minor, West Midlands police said.Meanwhile, hordes of cars in Birmingham were plastered with $85 tickets after motorists fell foul of temporary Games parking restrictions designed to ease parking access for residents with so many visitors expected near Games venues.Other spectators took to social media to complain about “shambolic” planning as queues for the men’s artistic gymnastics team final snaked for hundreds of metres outside Arena Birmingham on Day 1 of the Games, causing some punters to miss 45 minutes of the event.The access issues appeared to be resolved by Day 3, with queues moving into the venue much more smoothly.Updates to story","pubDate":"2022-08-02 19:00:00","image_url":null,"source_id":"mercury","country":["australia"],"category":["sports"],"language":"english"},{"title":"Ireland vs South Africa 1st T20I Live Telecast Channel in India and UK: When and where to watch IRE vs SA Bristol T20I?","link":"https://thesportsrush.com/cricket-news-ireland-vs-south-africa-1st-t20i-live-telecast-channel-in-india-and-uk-when-and-where-to-watch-ire-vs-sa-bristol-t20i/","keywords":["Cricket","Ireland","South Africa","South Africa tour of Ireland 2022"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Ireland vs South Africa 1st T20I Live Telecast: The SportsRush presents before you the timing and live streaming details of the first IRE vs SA T20I. The first T20I of South Africa’s tour of Ireland 2022 will be played in Bristol tomorrow. With The Hundred 2022 beginning in England, the Proteas will be playing a… The post Ireland vs South Africa 1st T20I Live Telecast Channel in India and UK: When and where to watch IRE vs SA Bristol T20I? appeared first on The SportsRush.","content":"Ireland vs South Africa 1st T20I Live Telecast: The SportsRush presents before you the timing and live streaming details of the first IRE vs SA T20I. The first T20I of South Africa’s tour of Ireland 2022 will be played in Bristol tomorrow. With The Hundred 2022 beginning in England, the Proteas will be playing a couple of T20Is in Ireland before returning to England for a three-match Test series. There is no hiding to the fact that South Africa’s presence has further upped the level of the ongoing Irish summer. Arguably their most high-profile home summer, Ireland have already hosted England, India and New Zealand this season. In what is South Africa’s third tour of Ireland, they will be adding to their three T20Is played against them last year. Ireland, who had defeated South Africa in a home ODI in 2021, would be confident of doing the same in the shortest format this time round. Going by their recent form, it wouldn’t be surprising to see the Irish challenging the Proteas in this series. Final prep #BackingGreen pic.twitter.com/SRot6wFrcm — Cricket Ireland (@cricketireland) August 2, 2022 Ireland vs South Africa 1st T20I Live Telecast Channel in India and UK Continuing with an unwanted trend of international cricket in West Indies, New Zealand, Bangladesh and some other nations in the recent years, South Africa’s tour of Ireland 2022 is no different in terms of not finding a television viewing platform for the Indian audiences. Having said that, streaming platform Fan Code will be streaming the same at a nominal price. Fans, who wish to buy a pass for the whole white-ball tour, will have to pay a 62% discounted price of INR 19 on the website or mobile application of FanCode. As far as the local fans in Ireland and UK are concerned, they are most likely to watch this series on their televisions by tuning in to BT Sport. Name of the exact channels will be updated upon official confirmation. Date – 03/08/2022 (Wednesday). Match start Time – 06:30 PM (local) and 11:00 PM (India). TV Channel – Not available (India), BT Sport (Ireland and UK). Online platform – FanCode (India). The post Ireland vs South Africa 1st T20I Live Telecast Channel in India and UK: When and where to watch IRE vs SA Bristol T20I? appeared first on The SportsRush.","pubDate":"2022-08-02 18:56:46","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Can retired hurt batsman bat again: When can retired hurt batsman return? Can retired hurt player come back in T20?","link":"https://thesportsrush.com/cricket-news-can-retired-hurt-batsman-bat-again-when-can-retired-hurt-batsman-return-can-retired-hurt-player-come-back-in-t20/","keywords":["Cricket","India tour of West Indies 2022","Retired hurt"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Can retired hurt batsman bat again: India skipper Rohit Sharma suddenly trudged off the field after some deliberation with the physio. During the third T20I of India’s tour of West Indies 2022 at Basseterre in St Kitts, team India skipper Rohit Sharma was forced to make a long walk back towards the dressing room after… The post Can retired hurt batsman bat again: When can retired hurt batsman return? Can retired hurt player come back in T20? appeared first on The SportsRush.","content":"Can retired hurt batsman bat again: India skipper Rohit Sharma suddenly trudged off the field after some deliberation with the physio. During the third T20I of India’s tour of West Indies 2022 at Basseterre in St Kitts, team India skipper Rohit Sharma was forced to make a long walk back towards the dressing room after a few balls into his innings. It all happened during the second Over of the 165-run chase handed by the West Indies. Rohit had smashed pacer Alzarri Joseph for a Six while playing his renowned pull shot towards the deep backward square leg fence. A couple of deliveries later, he steeped down the pitch in his bid to dismiss the ball from his sight, but only to get an under edge off his bat towards the fine leg fence for a Four. After playing the next delivery gently towards the point region, Rohit seemed to be in quite some discomfort, as the team physio scampered through to the pitch to address the concern, which perhaps was the result of his aforementioned across the line whack for a Four. After some deliberation with the physio, the 35-year-old decided to ‘retire hurt’, and was seen holding his back during his walk back, perhaps a cue for a possible case of a muscle pull. Rohit Sharma retired hurt in the second over, but India are on the charge in St Kitts 🔥 Watch #WIvIND for FREE on https://t.co/CPDKNxoJ9v (in select regions) 📺 | 📝 Scorecard: https://t.co/EI8Ehn8VCq pic.twitter.com/qxW7wd9Vg5 — ICC (@ICC) August 2, 2022 Despite getting ‘retired hurt’, Rohit Sharma can definitely come out to bat again after the fall of a wicket , and during any phase/Over of the chase. As per ‘Law 25’ of the Marylebone Cricket Club (MCC) under the head – ‘Batters retiring’, a batter may retire at any time during his/her innings when the ball is dead. The umpires, before allowing play to proceed, shall be informed of the reason for a batter retiring (law 25.4.1). Furthermore, if a batter retires because of illness, injury or any other unavoidable cause, that batter is entitled to resume his/her innings. If for any reason this does not happen, that batter is to be recorded as ‘Retired – not out’ (law 25.4.2). Also, for those unaware, a batter cannot resume his innings in case he is ‘retired out’, as was the case with Ravichandran Ashwin during IPL 2022 match between Rajasthan Royals and Lucknow Super Giants.","pubDate":"2022-08-02 18:43:56","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Rohit Sharma Injury Update: What happened to Rohit Sharma in today match? Is Rohit Sharma hurt?","link":"https://thesportsrush.com/cricket-news-rohit-sharma-injury-update-what-happened-to-rohit-sharma-in-today-match-is-rohit-sharma-hurt/","keywords":["Cricket","India","India tour of West Indies 2022","Rohit Sharma","West Indies"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Rohit Sharma Injury Update: The Indian captain left the field midway through his innings at the Warner Park tonight. During the third T20I of India’s tour of West Indies in Basseterre, India captain Rohit Sharma has left the whole of Indian cricket fans scared post him retiring hurt midway through his innings. Opening the batting… The post Rohit Sharma Injury Update: What happened to Rohit Sharma in today match? Is Rohit Sharma hurt? appeared first on The SportsRush.","content":"Rohit Sharma Injury Update: The Indian captain left the field midway through his innings at the Warner Park tonight. During the third T20I of India’s tour of West Indies in Basseterre, India captain Rohit Sharma has left the whole of Indian cricket fans scared post him retiring hurt midway through his innings. Opening the batting with Suryakumar Yadav in a 165-run chase, Sharma had nailed a pull off West Indies fast bowler Alzarri Joseph to hit a six off just the second ball that he faced. On the third delivery of the same over, Sharma aimed to step down the track but had to make a last-minute change to another short delivery. While a bottom edge aided Sharma in finding a fortunate boundary through the fine-leg region, it also appeared to have done something to his body. Rohit Sharma Injury Update A sudden swivel to adjust to the short delivery perhaps threw Sharma in a region of discomfort. Sharma, who guided the following delivery to point, immediately called for medical attention. A brief interaction with the Indian physio ended in Sharma opting to walk back to the pavilion. Considering the suddenness of the move and the absence of any official statement from the Indian team management, it seems that Sharma has faced a lower back niggle. With the amount of cricket to be played in the next few months, both Sharma and Indian fans would be hoping for the injury to not be very serious. Rohit goes out. Injury ka dard player aur uske parivar walon ke baad sabse zyada Fantasy Players ko mehsoos hota hai. Captain tha apna — Aakash Chopra (@cricketaakash) August 2, 2022 As far as the chase is concerned, Yadav and Shreyas Iyer have managed to power India to 56/0 in the powerplay to put on display a quickfire start. The post Rohit Sharma Injury Update: What happened to Rohit Sharma in today match? Is Rohit Sharma hurt? appeared first on The SportsRush.","pubDate":"2022-08-02 18:28:22","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Live Cricket Score India vs West Indies 3rd T20I Latest Updates: India Chase 165 For 2-1 Lead In St Kitts - News18","link":"https://news.google.com/__i/rss/rd/articles/CBMi0QFodHRwczovL3d3dy5uZXdzMTguY29tL2NyaWNrZXRuZXh0L25ld3MvbGl2ZS1jcmlja2V0LXNjb3JlLWluZGlhLXZzLXdlc3QtaW5kaWVzLTNyZC10MjBpLWxhdGVzdC11cGRhdGVzLWluZC12cy13aS1saXZlLXN0cmVhbWluZy10b2RheS1tYXRjaC1jb3ZlcmFnZS1oaWdobGlnaHRzLXdhcm5lci1wYXJrLXN0LWtpdHRzLW5ldmlzLWxpdmVuZXdzLTU2NzYwNjEuaHRtbNIBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Live Cricket Score India vs West Indies 3rd T20I Latest Updates: India Chase 165 For 2-1 Lead In St Kitts  News18India vs West Indies Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update- India Tour of West Indies, 3rd T20I  Cricket AddictorStart of third West Indies vs India T20I pushed back by 90 minutes  ESPNcricinfo#WIvIND | West Indies v India, 3rd T20I: Preview  CricbuzzIndia vs West Indies 3rd T20 Live Score: Mayers fifty takes WI to 164/5  Hindustan TimesView Full coverage on Google News","content":null,"pubDate":"2022-08-02 17:59:11","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Edgbaston Birmingham pitch report today match: Edgbaston batting or bowling pitch India Women vs Barbados Women Commonwealth Games 2022 T20","link":"https://thesportsrush.com/cricket-news-edgbaston-birmingham-pitch-report-today-match-edgbaston-batting-or-bowling-pitch-india-women-vs-barbados-women-commonwealth-games-2022-t20/","keywords":["Cricket","commonwealth games 2022","CWG 2022","Edgbaston"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Edgbaston Birmingham pitch report today match: Team India will lock horns against Barbados in the last group stage match tomorrow. After being humbled by Australia despite having the upper hand during majority phases of the match, team India defeated arch-rivals Pakistan in a one-sided contest by 8 wickets the previous Sunday. In what would be… The post Edgbaston Birmingham pitch report today match: Edgbaston batting or bowling pitch India Women vs Barbados Women Commonwealth Games 2022 T20 appeared first on The SportsRush.","content":"Edgbaston Birmingham pitch report today match: Team India will lock horns against Barbados in the last group stage match tomorrow. After being humbled by Australia despite having the upper hand during majority phases of the match, team India defeated arch-rivals Pakistan in a one-sided contest by 8 wickets the previous Sunday. In what would be a virtual quarter-final tomorrow, the Harmanpreet Kaur-led side will lock horns against Barbados at Edgbaston in Birmingham, with the loser of the fixture set to be eliminated from the highly renowned event. With one win and a loss in two games, tomorrow’s winner will also guarantee a place in the knock-out stage alongside Australia, who are firmly placed at the top in Group A. Barbados, on the other hand, are heavily reliant on their top-3 batters to pile on more than enough runs, as the entire bowling department has not been up to the task so far in the competition. Virtual Quarter-Final – India vs Barbados on 3rd August. Whoever wins, joins Australia in the Semi-Final.#CWG2022 #CricketTwitter — Female Cricket #B2022 (@imfemalecricket) July 31, 2022 Edgbaston Birmingham pitch report today match Four of the top-5 wicket-takers in the Commonwealth Games so far are spinners, as batters have found it difficult to score off them at the Games so far. However, batting heavy sides like Australia, England, New Zealand, and even India during their previous match against Pakistan, have not found run-scoring an uphill task so far. Also, the pitch has offered decent bounce and movement off the deck for the new ball bowlers, as was on display during the opening match between India and Australia, when India’s Renuka Singh breathed fire with the new ball, getting rid of each of the four top-order Aussie batters in her spell. Having said that, it is the batters who would enjoy their time the most at the venue tomorrow, after spending some time out in the middle, while batting with intent against the spinners. The post Edgbaston Birmingham pitch report today match: Edgbaston batting or bowling pitch India Women vs Barbados Women Commonwealth Games 2022 T20 appeared first on The SportsRush.","pubDate":"2022-08-02 17:05:10","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Why is Harshal not playing today: Why is Ravindra Jadeja not playing today’s 3rd T20I between West Indies and India in St Kitts?","link":"https://thesportsrush.com/cricket-news-why-is-harshal-not-playing-today-why-is-ravindra-jadeja-not-playing-todays-3rd-t20i-between-west-indies-and-india-in-st-kitts/","keywords":["Cricket","Deepak Hooda","India","India tour of West Indies 2022","Ravindra Jadeja","West Indies"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Why Ravindra Jadeja not playing today: Both the teams have made a solitary change to their Playing XI for this match. During the third T20I of India’s tour of West Indies 2022 in Basseterre, India captain Rohit Sharma has won the toss and chose to field in a bid to chase a target tonight. “We… The post Why is Harshal not playing today: Why is Ravindra Jadeja not playing today’s 3rd T20I between West Indies and India in St Kitts? appeared first on The SportsRush.","content":"Why Ravindra Jadeja not playing today: Both the teams have made a solitary change to their Playing XI for this match. During the third T20I of India’s tour of West Indies 2022 in Basseterre, India captain Rohit Sharma has won the toss and chose to field in a bid to chase a target tonight. “We will field first not because of the conditions but this is what we wanted to do as a team. We want to capitalize on the powerplay, this is a small ground, a six-hitting ground, but the average score isn’t high so we need to keep that in mind as well,” Sharma told ESPN Caribbean at the toss. Wanting to bat first at the Warner Park on Tuesday, West Indies captain Nicholas Pooran got what he wanted in spite of losing the coin toss. “We wanted to bat first as well. This is a ground where chasing is the preferred option. But now we need to put up a good score on the board and defend it. Credit to the bowling group [for bowling out India for 138 yesterday]. They performed well as a unit,” Pooran told ESPN Caribbean at the toss. Playing back-to-back matches, India have rested all-rounder Ravindra Jadeja for this match. With Jadeja recently recovering from a knee injury , perhaps India didn’t want to burden him with two matches within 24 hours. Batter Deepak Hooda, who has it in him to contribute with the ball as well, has been included into the XI in place of Jadeja. With Hooda scoring a maiden T20I century at No. 3 just about a month ago, his batting position will be interesting to see in this match. Here is the @windiescricket playing XI in 🇰🇳 for game 3 of @goldmedalindia T20I Cup, powered by Kent Water Purifiers, with the series levelled 1-1. One change – Dominic Drakes in for Odean Smith #WIvIND #MenInMaroon pic.twitter.com/MnTH1UIQEc — Windies Cricket (@windiescricket) August 2, 2022 Much like India, West Indies have also made a change to their combination as all-rounder Dominic Drakes has replaced Odean Smith in a like-for-like replacement.","pubDate":"2022-08-02 16:00:08","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Asia Cup 2022 tickets: India vs Pakistan Asia Cup 2022 tickets how to book","link":"https://thesportsrush.com/cricket-news-asia-cup-2022-tickets-india-vs-pakistan-asia-cup-2022-tickets-how-to-book/","keywords":["Cricket","asia cup"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Asia Cup 2022 tickets: The all-important Asia Cup will be played after an elongated four-year gap later this month. The upcoming 15th season of the Asia Cup will be cherished by fans across the world primarily due to the reality that the prestigious tournament will be conducted after as many as four years. As confirmed… The post Asia Cup 2022 tickets: India vs Pakistan Asia Cup 2022 tickets how to book appeared first on The SportsRush.","content":"Asia Cup 2022 tickets: The all-important Asia Cup will be played after an elongated four-year gap later this month. The upcoming 15th season of the Asia Cup will be cherished by fans across the world primarily due to the reality that the prestigious tournament will be conducted after as many as four years. As confirmed by multiple reports over the last month or so, Asia Cup 2022 will be played between August 27 – September 11. The same was confirmed after the official fixtures were announced this afternoon. As far as the venue is concerned, UAE has been yet again entrusted to act as a replacement to host a multi-team tournament. Originally scheduled to be played in Pakistan in 2020, it was subsequently decided that the tournament would be played in Sri Lanka after PCB (Pakistan Cricket Board) and SLC (Sri Lanka Cricket) swapped the hosting rights over a couple of years ago. However, it was within a month that the tournament had to be canceled due to COVID-19 pandemic. With Sri Lanka undergoing a political turmoil, UAE was decided as a potential replacement. Readers must note that 13 matches of Asia Cup 2022 will be played in Dubai and Sharjah across 16 days. 2 India v Pak games in Asia Cup. Meanwhile broadcasters: #INDvPAK pic.twitter.com/2Uf9pkL53d — Wasim Jaffer (@WasimJaffer14) August 2, 2022 A tournament comprising of one guaranteed India-Pakistan clash with the potential of encompassing two more depending on the results is bound to work well with respect to both the broadcaster and ticket sales. Hence, it is no surprise that queries for tickets of Asia Cup 2022 have already started to do the rounds among Asian cricket fans. Having said that, it is worth mentioning that no official update regarding tickets has been provided by the ACC (Asian Cricket Council) for now. With 25 days remaining till the start of the tournament, expect ticket sales to begin really soon. We will share with you the detailed steps to book Asia Cup 2022 tickets once they are put on sale for general public.","pubDate":"2022-08-02 15:26:56","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"CWG 2022: A Delhi school looks forward to welcoming their champ, cricket coach and Lawn Bowls gold medallist Pinki Singh","link":"https://indianexpress.com/article/sports/sport-others/cwg-2022-a-delhi-school-looks-forward-to-welcoming-lawn-bowls-gold-medallist-pinki-singh-8066447/","keywords":["Sport Others","Sports"],"creator":["Namit Kumar"],"video_url":null,"description":null,"content":null,"pubDate":"2022-08-02 14:48:08","image_url":null,"source_id":"indianexpress","country":["india"],"category":["sports"],"language":"english"},{"title":"IND vs PAK: भारत और पाकिस्तान 15 दिन में 3 बार भिड़ेंगे! वर्ल्ड कप की हार का बदला लेना बाकी","link":"https://hindi.news18.com/photogallery/sports/cricket-ind-vs-pak-india-and-pakistan-may-meet-3-times-in-asia-cup-rohit-sharma-babar-azam-4439413.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"Asia Cup Cricket: एशियन क्रिकेट काउंसिल ने टी20 एशिया कप का शेड्यूल जारी कर दिया है. भारत और पाकिस्तान (IND vs PAK) को एक ही ग्रुप में रखा गया है. 28 अगस्त को दोनों टीमों के बीच मुकाबला होना है.","content":null,"pubDate":"2022-08-02 14:33:55","image_url":"https://images.news18.com/ibnkhabar/uploads/2022/08/cricket-1-16594497053x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","country":["india"],"category":["sports"],"language":"hindi"},{"title":"CWG 2022: IND-W vs BAR-W Dream11 prediction - Fantasy cricket tips for India Women vs Barbados Women","link":"https://www.dnaindia.com/commonwealth-games-2022/report-cwg-2022-indw-vs-barw-dream11-prediction-fantasy-cricket-tips-for-india-women-vs-barbados-women-sonyliv-2973406","keywords":["Sports","Commonwealth Games 2022"],"creator":["DNA Web Team"],"video_url":null,"description":"Cricket in Commonwealth Games 2022: IND-W vs BAR-W Dream 11 Team - Check My Dream11 Team, Best Player's list for India Women vs Barbados Women","content":null,"pubDate":"2022-08-02 13:42:43","image_url":null,"source_id":"dnaindia","country":["india"],"category":["sports"],"language":"english"},{"title":"Robinson in England's squad of 14 for first two Tests against South Africa - ESPNcricinfo","link":"https://news.google.com/__i/rss/rd/articles/CBMilQFodHRwczovL3d3dy5lc3BuY3JpY2luZm8uY29tL3N0b3J5L2VuZy12cy1zYS0yMDIyLXRlc3Qtc2VyaWVzLW9sbGllLXJvYmluc29uLWluLWVuZ2xhbmRzLXNxdWFkLW9mLTE0LWZvci1maXJzdC10d28tdGVzdHMtYWdhaW5zdC1zb3V0aC1hZnJpY2EtMTMyNzI0ONIBogFodHRwczovL3d3dy5lc3BuY3JpY2luZm8uY29tL3N0b3J5L2VuZy12cy1zYS0yMDIyLXRlc3Qtc2VyaWVzLW9sbGllLXJvYmluc29uLWluLWVuZ2xhbmRzLXNxdWFkLW9mLTE0LWZvci1maXJzdC10d28tdGVzdHMtYWdhaW5zdC1zb3V0aC1hZnJpY2EtMTMyNzI0OD9wbGF0Zm9ybT1hbXA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Robinson in England's squad of 14 for first two Tests against South Africa  ESPNcricinfoThe Official Website of the ECB  ECB.co.ukFit-again Ollie Robinson recalled by England for South Africa Tests  The GuardianEngland name Ollie Robinson in 14-man squad for first two Test matches against South Africa  Sky SportsNCCC News : Broad set for Home of Cricket return  Trent BridgeView Full coverage on Google News","content":null,"pubDate":"2022-08-02 13:32:32","image_url":null,"source_id":"google","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"India vs Pakistan cricket returns on August 28th as Asia Cup 2022 schedule announced; final on 11th September in Dubai","link":"https://www.sportskeeda.com/cricket/news-india-vs-pakistan-cricket-returns-august-28th-asia-cup-2022-schedule-announced-final-11th-september-dubai?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Cricket"],"creator":["Renin Wilben Albert"],"video_url":null,"description":null,"content":null,"pubDate":"2022-08-02 13:13:41","image_url":"https://static.sportskeeda.com/editor/2022/08/c5754-16594409117259-1920.jpg","source_id":"sportskeeda","country":["india"],"category":["sports"],"language":"english"},{"title":"Maharaja Trophy T20 Tournament: Karun Nair to lead Mysore Warriors","link":"https://starofmysore.com/maharaja-trophy-t20-tournament-karun-nair-to-lead-mysore-warriors/","keywords":["News","Sports","Cycle Pure Agarbathies","Maharaja Trophy","Mysore Warriors"],"creator":["Author"],"video_url":null,"description":"Tournament to take place in Mysuru from Aug. 7 to Aug. 15 and in Bengaluru from Aug. 17 to 26 Mysore/Mysuru: Mysore Warriors, sponsored by Cycle Pure Agarbathi, announced Karun Nair as its team captain who will be leading Mysore Warriors team for Maharaja Trophy T20 Tournament. Karun Nair was proposed as the team captain... The post Maharaja Trophy T20 Tournament: Karun Nair to lead Mysore Warriors appeared first on Star of Mysore.","content":"Tournament to take place in Mysuru from Aug. 7 to Aug. 15 and in Bengaluru from Aug. 17 to 26 Mysore/Mysuru: Mysore Warriors, sponsored by Cycle Pure Agarbathi, announced Karun Nair as its team captain who will be leading Mysore Warriors team for Maharaja Trophy T20 Tournament. Karun Nair was proposed as the team captain by Mysore Warriors management following selection process. The announcement took place on July 30, during the team selection ceremony held at The Karnataka State Cricket Association, M. Chinnaswamy Stadium, Bengaluru. The competition, which will begin in Mysuru (Aug. 7 to 15) and move to Bengaluru (Aug. 17 to 26), will replace Karnataka Premier League (KPL) that ran for eight seasons till 2019 before a match-fixing and betting scandal grounded it. The 30-year-old prolific batsman began his batting career with his international debut on India’s limited-overs tour of Zimbabwe where he featured in a couple of ODIs. After Virender Sehwag, Karun Nair became only India’s second triple-centurion when he accomplished the feat against England in his second Test match in 2016. Speaking on the captain selection, Arjun Ranga, Managing Director, Cycle Pure Agarbathi, said: “The captaincy will bring a challenging opportunity for Nair and his dedication and efforts will only add value to the team. His leadership role will strengthen the team position in the game and as we have immense hope for the team this year, his captaincy will only take the team to new heights.” Speaking on his captaincy, Karun Nair, Team Captain, Mysore Warriors, said: “I am humbled with this responsibility, I have played for the country and now it is time for me to bring the experience to the team and nurture some good players. This is my second year of captaincy with the Mysore Warriors, and I am positive that we are going to make everyone proud.” Squad: Karun Nair, Shreyas Gopal, Pavan Deshpande, Vidhyadhar Patil, Nihal Ullal, Prateek Jain, Bharat Dhuri, Cheeranjivi, Shubang Hegde, Lochan Appanna, Shivaraj, Monish Reddy, Varun Rao, Rahul Prasanna, Nithin Bille, Aditya Goyal, Abhishek Alawat, Naga Bharath, K. Arun and H. Tushar; Head Coach: P.V. Shashikant; Assistant Coach: K.L. Akshay; Selector: K.L. Ashwath; Physiotherapist: T. Manjunath; Trainer: Irfanullah Khan; Video Analyst: K. Kiran. The post Maharaja Trophy T20 Tournament: Karun Nair to lead Mysore Warriors appeared first on Star of Mysore.","pubDate":"2022-08-02 13:13:00","image_url":null,"source_id":"starofmysore","country":["india"],"category":["sports"],"language":"english"},{"title":"England name Ollie Robinson in 14-man squad for first two Test matches against South Africa - Sky Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMikQFodHRwczovL3d3dy5za3lzcG9ydHMuY29tL2NyaWNrZXQvbmV3cy8xMjE3My8xMjY2NDAzOC9lbmdsYW5kLW5hbWUtb2xsaWUtcm9iaW5zb24taW4tMTQtbWFuLXNxdWFkLWZvci1maXJzdC10d28tdGVzdC1tYXRjaGVzLWFnYWluc3Qtc291dGgtYWZyaWNh0gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"England name Ollie Robinson in 14-man squad for first two Test matches against South Africa  Sky SportsEngland and Wales Cricket Board (ECB) - The Official Website of the ECB  ECB.co.ukFit-again Ollie Robinson recalled by England for South Africa Tests  The GuardianRobinson in England's squad of 14 for first two Tests against South Africa  ESPNcricinfoFoakes and Pope named in Test squad against South Africa - Kia Oval  The Kia OvalView Full coverage on Google News","content":null,"pubDate":"2022-08-02 13:05:11","image_url":null,"source_id":"google","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"NZ-W vs SL-W Dream11 Team Prediction, Fantasy Cricket Hints: Captain, Probable Playing 11s, Team News; Injury Updates For Today’s NZ-W vs SL-W CWG 2022 Group B T20 match at Edgbaston, 10.30 PM IST, August 2","link":"https://zeenews.india.com/cricket/nz-w-vs-sl-w-dream11-team-prediction-fantasy-cricket-hints-captain-probable-playing-11s-team-news-injury-updates-for-today-s-nz-w-vs-sl-w-cwg-2022-group-b-t20-match-at-edgbaston-10-30-pm-ist-august-2-2492418.html","keywords":null,"creator":null,"video_url":null,"description":"New Zealand Women vs Sri Lanka Women Dream11 Team Prediction New Zealand Women vs Sri Lanka Women Commonwealth Games 2022 Group B T20 match - Check My Dream11 Team, Best players list of NZ-W vs SL-W, New Zealand Women Dream11 Team Player List, Sri Lanka Women Dream11 Team Player List, Dream11 Guru Tips, Fantasy Cricket Tips, Fantasy Cricket Tips, Fantasy Playing Tips.","content":null,"pubDate":"2022-08-02 13:02:00","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"Jonny Bairstow will sit out Hundred in fresh blow to ECB’s showpiece event","link":"https://www.theguardian.com/sport/2022/aug/02/ollie-robinson-recalled-england-south-africa-cricket-tests","keywords":["England v South Africa 2022","Jonny Bairstow","England cricket team","South Africa cricket team","The Hundred","Cricket","Sport"],"creator":["Simon Burnton"],"video_url":null,"description":"Bairstow joins Ben Stokes in resting before South Africa TestsOllie Robinson recalled to England squad after injury woesThe Hundred has been hit by the withdrawal of a second major English star after Jonny Bairstow decided to follow the example of his Test captain, Ben Stokes, in choosing to rest rather than play in the England and Wales Cricket Board’s showpiece tournament.In a hectic international summer, Bairstow has played in all four England Tests as well as nine of their 12 white-ball games, missing only the three Twenty20 matches against India. Having been named in the squad for the first two of three Tests against South Africa, which start at Lord’s on 17 August, he has decided that some time away from the game is required. Continue reading...","content":null,"pubDate":"2022-08-02 13:00:10","image_url":"https://i.guim.co.uk/img/media/f98eb57bb6011e7da35d711f5bb91ecca7c511ae/0_110_3480_2089/master/3480.jpg?width=460&quality=85&auto=format&fit=max&s=df5ebd89baf3ef0e86e24086ac882dc3","source_id":"theguardian","country":["united kingdom","india","singapore","canada"],"category":["sports"],"language":"english"},{"title":"Asia Cup 2022 schedule announced, India to face Pakistan on August 28","link":"https://telanganatoday.com/asia-cup-2022-schedule-announced-india-to-face-pakistan-on-august-28","keywords":["Cricket","News","Sport","Asia Cup","India","Pakistan"],"creator":["IANS"],"video_url":null,"description":"New Delhi: The schedule of the 2022 Asia Cup has been announced with Sri Lanka taking on Afghanistan in the tournament opener on August 27 in Dubai, which will be followed by the high-profile clash between arch-rivals India and Pakistan on the next day. The schedule for the 15th edition of the Asian tournament was […]","content":"New Delhi: The schedule of the 2022 Asia Cup has been announced with Sri Lanka taking on Afghanistan in the tournament opener on August 27 in Dubai, which will be followed by the high-profile clash between arch-rivals India and Pakistan on the next day. The schedule for the 15th edition of the Asian tournament was officially announced by Jay Shah, chairman of the Asian Cricket Council (ACC) on Twitter. Ten out of the thirteen games including the final on September 11 are set to be played in Dubai, with the rest to take place in Sharjah. UAE, Kuwait, Singapore and Hong Kong will play a qualifying round with the winner joining India, Pakistan, Sri Lanka, Afghanistan and Bangladesh in the main tournament. The main tournament will feature six teams divided into two groups. India, Pakistan and the qualifier are in Group A while Sri Lanka, Bangladesh and Afghanistan form Group B. Each team plays within the group once. The top-two teams from each group will further play in a ”Super 4” round, meaning there is a high probability of at least another India – Pakistan game in the second round before the final where the top two would feature. The tournament, originally to be played in Sri Lanka was moved to the United Arab Emirates (UAE) a few days back following the political and economic crisis in the island nation. The Asia Cup, which was last played in 2018, will be played in the T20 format and India, who are the defending champions, will enter the 2022 edition of the competition as favourites.","pubDate":"2022-08-02 12:56:58","image_url":null,"source_id":"telanganatoday","country":["india"],"category":["sports"],"language":"english"},{"title":"NZ-W vs SL-W Group B Commonwealth Games 2022 LIVE Streaming Details: When and Where to Watch free online live streaming in India, check schedule date and time in IST","link":"https://zeenews.india.com/cricket/nz-w-vs-sl-w-group-b-commonwealth-games-2022-live-streaming-details-when-and-where-to-watch-free-online-live-streaming-in-india-check-schedule-date-and-time-in-ist-2492410.html","keywords":null,"creator":null,"video_url":null,"description":"NZ-W vs SL-W Group B CWG 2022 LIVE Streaming Details: Check When and Where to watch Sophie Devine-led New Zealand face Chamari Athapaththu's Sri Lanka Cricket Match LIVE.","content":null,"pubDate":"2022-08-02 12:48:00","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"IND vs PAK Mens Asia Cup match: IND vs PAK next match date and time","link":"https://thesportsrush.com/cricket-news-ind-vs-pak-mens-asia-cup-match-ind-vs-pak-next-match-date-and-time/","keywords":["Cricket","Asia Cup 2022","India vs Pakistan"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"IND vs PAK Mens Asia Cup match: The arch-rivals India and Pakistan will face each other in the Asia Cup 2022 match in Dubai. Asia Cup is one of the most prestigious cricket tournaments for Asian teams, and the tournament is finally back after a spell of four long years. The last edition of the… The post IND vs PAK Mens Asia Cup match: IND vs PAK next match date and time appeared first on The SportsRush.","content":"IND vs PAK Mens Asia Cup match: The arch-rivals India and Pakistan will face each other in the Asia Cup 2022 match in Dubai. Asia Cup is one of the most prestigious cricket tournaments for Asian teams, and the tournament is finally back after a spell of four long years. The last edition of the tournament was played in 2018 in UAE, where India won the title under the captaincy of Rohit Sharma. The schedule of the Asia Cup 2022 is finally out, and the tournament will officially start on 28 August 2022. A total of six teams will be playing in the tournament, and they are divided into two groups. India, Pakistan, Bangladesh, Pakistan and Afghanistan are already qualified, whereas the last team will be decided by the playoffs. India and Pakistan don’t play in bilateral series, so the only chance of them playing against each other is in the ICC Tournaments or the Asia Cup. The organizers also make sure that both teams are kept in the same group in order to have at least one game between the arch-rivals. The match between India and Pakistan guarantees a full house, and the revenue generated from that match cannot be compared to any other match around the world. India and Pakistan will be up against each other in the Asia Cup 2022 on 28 August 2022 at the Dubai International Stadium in Dubai. India vs Pakistan in Asia Cup in Dubai on August 28 (Sunday). Both highly likely to meet again the following Sunday (September 4) in the Super Four Round at the same venue. Final is on September 11 (Sunday) which could be another India vs Pakistan match. #AsiaCup2022 — Mazher Arshad (@MazherArshad) August 2, 2022 It is interesting that the last match between both sides was played at the Dubai International stadium only in the last year’s ICC T20 World Cup. Pakistan easily won that match, and the Indian team would be looking to take revenge of the same at the very same ground. A full crowd is yet again expected in this very match. Both teams have met each other a total of 14 times in the Asia Cup, where India have won eight matches and Pakistan have won five. One match ended in a no result in 1987.","pubDate":"2022-08-02 12:36:10","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Asia Cup 2022 schedule announced, India to face Pakistan August 28","link":"https://www.orissapost.com/asia-cup-2022-schedule-announced-india-to-face-pakistan-august-28/","keywords":["Sports","Asia Cup 2022","Jay Shah","Schedule"],"creator":["Post News Network"],"video_url":null,"description":"New Delhi: The schedule of the 2022 Asia Cup has been announced with Sri Lanka taking on Afghanistan in the tournament opener August 27 in Dubai, which will be followed by the high-profile clash between arch-rivals India and Pakistan on the next day. The schedule for the 15th edition of the Asian tournament was officially […]","content":"New Delhi: The schedule of the 2022 Asia Cup has been announced with Sri Lanka taking on Afghanistan in the tournament opener August 27 in Dubai, which will be followed by the high-profile clash between arch-rivals India and Pakistan on the next day. The schedule for the 15th edition of the Asian tournament was officially announced by Jay Shah, chairman of the Asian Cricket Council (ACC) on Twitter. The wait is finally over as the battle for Asian supremacy commences on 27th August with the all-important final on 11th September. The 15th edition of the Asia Cup will serve as ideal preparation ahead of the ICC T20 World Cup. pic.twitter.com/QfTskWX6RD — Jay Shah (@JayShah) August 2, 2022 Ten out of the thirteen games including the final on September 11 are set to be played in Dubai, with the rest to take place in Sharjah. UAE, Kuwait, Singapore and Hong Kong will play a qualifying round with the winner joining India, Pakistan, Sri Lanka, Afghanistan and Bangladesh in the main tournament. The main tournament will feature six teams divided into two groups. India, Pakistan and the qualifier are in Group A while Sri Lanka, Bangladesh and Afghanistan form Group B. Each team plays within the group once. The top two teams from each group will further play in a ‘Super 4’ round, meaning there is a high probability of at least another India – Pakistan game in the second round before the final where the top two would feature. The tournament, originally to be played in Sri Lanka was moved to the United Arab Emirates (UAE) a few days back following the political and economic crisis in the island nation. The Asia Cup, which was last played in 2018, will be played in the T20 format and India, who are the defending champions, will enter the 2022 edition of the competition as favourites. Full schedule: Aug 27 – Sri Lanka vs Afghanistan, Dubai Aug 28 – India vs Pakistan, Dubai Aug 30 – Bangladesh vs Afghanistan, Sharjah Aug 31 – India vs Qualifier, Dubai Sep 1 – Sri Lanka vs Bangladesh, Dubai Sep 2 – Pakistan vs Qualifier, Sharjah Sep 3 – B1 vs B2, Sharjah Sep 4 – A1 vs A2, Dubai Sep 6 – A1 vs B1, Dubai Sep 7 – A2 vs B2, Dubai Sep 8 – A1 vs B2, Dubai Sep 9 – B1 vs A2, Dubai Sep 11 – FINAL, Dubai IANS","pubDate":"2022-08-02 12:19:40","image_url":"https://www.orissapost.com/wp-content/uploads/2022/08/UPLOAD-ASIA-CUP-300x247.jpg","source_id":"orissapost","country":["india"],"category":["sports"],"language":"english"},{"title":"Cricket-India and Pakistan to clash in Aug 28 Asia Cup humdinger","link":"https://www.thestar.com.my/sport/cricket/2022/08/02/cricket-india-and-pakistan-to-clash-in-aug-28-asia-cup-humdinger","keywords":null,"creator":null,"video_url":null,"description":"NEW DELHI (Reuters) - Arch-rivals India and Pakistan will clash in an Asia Cup Sunday blockbuster in Dubai on Aug. 28, the organisers said on Tuesday. Read full story","content":"NEW DELHI (Reuters) - Arch-rivals India and Pakistan will clash in an Asia Cup Sunday blockbuster in Dubai on Aug. 28, the organisers said on Tuesday. Bilateral cricket remains suspended between the bitter neighbours who play each other only in multi-team tournaments. A day after Sri Lanka take on Afghanistan in the opener, India and Pakistan will lock horns in the tournament's most anticipated match. The nine-team Twenty20 tournament was shifted to the United Arab Emirates last month due to the political and economic crisis in Sri Lanka, who retain the hosts' honour. Pakistan beat India by 10 wickets in a T20 World Cup match in Dubai last year in their previous encounter. Dubai hosts 10 matches, including the Sept. 11 final, while three will be played in Sharjah, ACC president Jay Shah, who is also the secretary of the Indian cricket board, said on Twitter. (Reporting by Amlan Chakraborty in New Delhi; editing by Ken Ferris)","pubDate":"2022-08-02 12:19:00","image_url":"https://apicms.thestar.com.my/uploads/images/2022/08/02/1682217.jpg","source_id":"thestar_my","country":["malaysia"],"category":["sports"],"language":"english"},{"title":"Asia Cup 2022: Schedule announced, India to face Pakistan on 28 August","link":"https://www.firstpost.com/firstcricket/sports-news/asia-cup-2022-schedule-announced-india-to-face-pakistan-on-28-august-11000521.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"Asia Cup 2022: Schedule announced, India to face Pakistan on 28 August","content":"India will face arch-rivals Pakistan in the 2022 Asia Cup as the schedule for the tournament was announced on Tuesday evening.Asian Cricket Council President Jay Shah announced the schedule for the tournament, confirming that the mega event will start on 27 August and go on till 11 September.\"The wait is finally over as the battle for Asian supremacy commences on 27th August with the all-important final on 11th September,\" Shah wrote in his tweet.Sri Lanka and Afghanistan will clash on 27 August, to kick off of the multilateral event before India and Pakistan face off in the main event.The final of the tournament is scheduled for 11 September at Dubai International Stadium.All but three matches will be played at the Dubai International Stadium, with three fixtures being allotted to the Sharjah Cricket Stadium.The wait is finally over as the battle for Asian supremacy commences on 27th August with the all-important final on 11th September.The 15th edition of the Asia Cup will serve as ideal preparation ahead of the ICC T20 World Cup. pic.twitter.com/QfTskWX6RD— Jay Shah (@JayShah) August 2, 2022Six teams will participate in the tournament with one team yet to qualify. Group A consists of India, Pakistan, and the qualifying team. Whereas Group B comprises Sri Lanka, Bangladesh, and Afghanistan.The top two teams from each group will qualify for the super four stage and the four teams will each other before the top two teams clash for the title match.The India vs Pakistan match is the most anticipated match amongst the fans as the two teams only play during multi-national tournaments. Pakistan defeated India in their last encounter in the 2021 T20 World Cup at the same venue. India will be eager to even the scores after their first loss against Pakistan in a World Cup.India are the defending champions of the Asia Cup and will go in the tournament as favourites. They had won the 50-over format four years ago. The last T20 edition was played in 2016 which was also won by MS Dhoni-led India.However, India and Pakistan both have been in good T20 form in recent times and will make the tournament interesting.The teams will consider the event as an important tournament for the upcoming T20 World Cup in November and eye to finalise their combinations.Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-08-02 12:12:58","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2021/10/Pakistan-Cricket-Team-640-AP.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Premier League ‘plan to release in-match conversations between referees and VAR officials’ to fans this season","link":"https://www.thesun.ie/sport/football/9191789/premier-league-conversations-referees-var-officials-fans/","keywords":["Football","Sport","Premier League","Refereeing","VAR"],"creator":["Joshua Jones"],"video_url":null,"description":null,"content":"PREMIER LEAGUE fans will finally be able to hear the conversations between referees and VARs, according to reports. The League wants to have a more transparent approach and believes releasing the chats will help. Referees’ chats with their VARs will be released after matches this seasonGetty Supporters have so far been left in the dark regarding how officials reached their conclusions, relying on replays and pundit analysis. According to The Times, the idea is that the public would get to listen in and get a clearer understanding and explanation on how decisions are made this season. However, the recordings would only be released after full-time due to rules on live broadcasts. The suggestion is widely supported, claims Premier League chief Richard Masters. READ MORE FOOTBALL STORIES DISGRACE Thug footballer arrested after throwing punch at female referee after red card He said: “There is a general view that [releasing the audio] is a good thing. “There is a desire to be more open with fans about referees’ decision-making and how we do that precisely we need to work out.” The Premier League introduced VAR for the 2019-20 season. Similar talks between refs and their VARs are available in the MLS in the United States. Most read in Football RED DEVILS LATEST £71m De Jong 'meeting soon', Ronaldo admission, Tielemans latest KELL OF A WOMAN How Chloe Kelly went from getting no92 bus to Wembley to being England hero A LONGING My husband would love to start hurling after he retires, says Shane Long's wife STONE THE CROWS Man Utd in talks to sign Huddlestone in shock free transfer after Hull exit CRISSED OFF Man Utd unimpressed with Ronaldo after Ten Hag snub and quitting friendly early ALL GUNNED OUT Arsenal look to axe ELEVEN flops including record transfer Pepe and Leno FREE BETS AND SIGN UP DEALS – BEST NEW CUSTOMER OFFERS The audios are posted on YouTube, giving supporters the chance to hear the process of how the referees made the calls. In rugby and cricket, fans can already hear the conversations in real time during TV and radio broadcasts of matches. Former Fifa ref Howard Webb, who took charge of the 2010 World Cup final, is currently head of refereeing for the MLS. But he looks set to return to the Premier League as the new refs’ chief. It has been a summer of turnover for Mike Riley’s top officials. Kevin Friend became the latest to hang up his whistle, following fellow veterans Mike Dean, Jon Moss and Martin Atkinson into retirement. PGMOL had already announced Tom Bramall, who has only been a referee for three seasons, was being promoted to Select Group One and on to the Prem panel. ReutersFans were previously left in the dark regarding how officials reached their conclusions[/caption]","pubDate":"2022-08-02 12:07:10","image_url":null,"source_id":"thesun_ie","country":["ireland"],"category":["sports"],"language":"english"},{"title":"Asia Cup 2022 schedule announced, much-anticipated India-Pakistan clash on August 28","link":"https://www.tribuneindia.com/news/sports/asia-cup-2022-schedule-announced-much-anticipated-india-pakistan-clash-on-august-28-418135","keywords":null,"creator":null,"video_url":null,"description":"New Delhi, August 2 The much-anticipated Asia Cup cricket tournament will take place from August 27 onwards this year. The tournament will start with a match between Sri Lanka and Afghanistan on August 27. The high-octane clash between India and Pakistan will take place on the following day. The Super-four phase of the tournament will start from September 3. The final of the event will take place on September 11 this year. \"The wait is finally over as the battle for Asian supremacy commences on 27th August with the all-important final on 11th September. The 15th edition of the Asia Cup will serve as ideal preparation ahead of the ICC T20 World Cup,\" tweeted BCCI Secretary and President of Asian Cricket Council, Jay Shah. The wait is finally over as the battle for Asian supremacy commences on 27th August with the all-important final on 11th September.The 15th edition of the Asia Cup will serve as ideal preparation ahead of the ICC T20 World Cup. pic.twitter.com/QfTskWX6RD — Jay Shah (@JayShah) August 2, 2022 The Asian Cricket Council (ACC) announced in late July that the much-anticipated Asia Cup 2022 will take place in UAE instead of Sri Lanka on account of the prevailing situation in the island nation. India has not announced its squad for Asia Cup 2022 yet. The previous edition of the tournament was held in 2018 and was won by India, its seventh title. They had defeated Bangladesh by three wickets in the final. India is the most successful team in the history of the event, with seven titles under their belt. ANI","content":"New Delhi, August 2 The much-anticipated Asia Cup cricket tournament will take place from August 27 onwards this year. The tournament will start with a match between Sri Lanka and Afghanistan on August 27. The high-octane clash between India and Pakistan will take place on the following day. The Super-four phase of the tournament will start from September 3. The final of the event will take place on September 11 this year. “The wait is finally over as the battle for Asian supremacy commences on 27th August with the all-important final on 11th September. The 15th edition of the Asia Cup will serve as ideal preparation ahead of the ICC T20 World Cup,” tweeted BCCI Secretary and President of Asian Cricket Council, Jay Shah. The wait is finally over as the battle for Asian supremacy commences on 27th August with the all-important final on 11th September. The 15th edition of the Asia Cup will serve as ideal preparation ahead of the ICC T20 World Cup. pic.twitter.com/QfTskWX6RD The Asian Cricket Council (ACC) announced in late July that the much-anticipated Asia Cup 2022 will take place in UAE instead of Sri Lanka on account of the prevailing situation in the island nation. India has not announced its squad for Asia Cup 2022 yet. The previous edition of the tournament was held in 2018 and was won by India, its seventh title. They had defeated Bangladesh by three wickets in the final. India is the most successful team in the history of the event, with seven titles under their belt. ANI #Asia Cup","pubDate":"2022-08-02 11:38:11","image_url":"https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/8/2022_8$largeimg_243763935.jpg","source_id":"tribuneindia","country":["india"],"category":["sports"],"language":"english"}]}