{"newsArray":[{"title":"Forget 2005 comparisons, this was as dramatic as decade-old Durham | Geoff Lemon","link":"https://www.theguardian.com/sport/blog/2023/jun/20/usman-khawaja-pat-cummins-ashes-australia-england-first-test-day-five-cricket","keywords":["Ashes 2023","Australia cricket team","England cricket team","The Ashes","Cricket","Australia sport","Sport"],"creator":["Geoff Lemon at Edgbaston"],"video_url":null,"description":"First Test was reminiscent of 2013 as Warner gave Australia a flying start before Broad delivered one of his Ashes specialsSmoking Jesus. Take a moment to collect yourself. If you were watching that final day at Edgbaston, you deserve to let your nerves unspool. They must be clenched to raging little clusters of data. Do some deep breathing. Take your shoes off and walk on the lawn. Fists with your toes. Even if you’re not invested in either team, close Test cricket can make you sick, when awaiting each delivery feels like you’ve just chugged a large chocolate milk before jumping on Magic Mountain.If you’ve paid any attention to coverage over the past five days, you might have heard one or two comparisons to the Edgbaston Ashes Test of 2005. Run totals of 407 on the first day, fourth‑innings targets for Australia of 282 and 281 respectively, falling short both times under clouded skies, simmering in the fetid steambath of noise generated by the Hollies Stand. Continue reading...","content":"S moking Jesus. Take a moment to collect yourself. If you were watching that final day at Edgbaston, you deserve to let your nerves unspool. They must be clenched to raging little clusters of data. Do some deep breathing. Take your shoes off and walk on the lawn. Fists with your toes. Even if you’re not invested in either team, close Test cricket can make you sick, when awaiting each delivery feels like you’ve just chugged a large chocolate milk before jumping on Magic Mountain. If you’ve paid any attention to coverage over the past five days, you might have heard one or two comparisons to the Edgbaston Ashes Test of 2005. Run totals of 407 on the first day, fourth‑innings targets for Australia of 282 and 281 respectively, falling short both times under clouded skies, simmering in the fetid steambath of noise generated by the Hollies Stand. Australia hold off late England charge to win first Ashes Test in thrilling finale Read more Until the dramatic work of Australia’s lower order, though, this was more reminiscent of Durham in 2013. That time Australia were set a chase of 299. Both involved David Warner giving Australia a flying start in the company of a left‑handed opening partner enjoying a late-career revival at around the age of 36: Usman Khawaja now, Chris Rogers then. Khawaja was there in 2013, too, as was Steve Smith in the middle order and Nathan Lyon as the spinner. Both times Mitchell Starc was left out, and his pace was missed as England ran up a score in the third innings. Both involved a hulking blond all-rounder making useful runs at six, from Shane Watson to Cameron Green. And both involved a Stuart Broad spell, one of his Ashes specials. Durham was the more dramatic: a streak of six for 20 across 45 balls after the door had been prised open with the removal of the top three. Edgbaston had Broad apply the crowbar: removing Smith and Marnus Labuschagne in the space of 12 balls on the fourth evening. That spell more than anything was reminiscent of a decade earlier: the tall figure of Broad wading in on his heron legs, so elongated that his own shadow was jealous, his whites glowing a shade of gold in the late‑day sunshine. Cheered into his delivery stride each time by a liquored terrace of uncontained humanity, singing the same song about him being better than his dad. Chris Broad is a decent match referee but probably wouldn’t give much argument. Stuart Broad celebrates his dismissal of Shane Watson at Durham in 2013. Photograph: Tom Jenkins/The Guardian It was testament to Pat Cummins and Nathan Lyon, then, that Broad didn’t have the decisive influence on the fifth day. For a time it was England’s other talisman, Ben Stokes. As the captain leading their stated intention to set every game ablaze, he was set up opposite the approach of Khawaja. You could typify the contrast as fire and ice, but really it was fire and water. Whatever England tried to brandish, Khawaja doused. He faced 518 balls in the match, where the other five Australian specialists managed 393. England’s entire team, both times, faced 866. There was something cussedly specific about the way Khawaja stretched forward to defend, time and again, occasionally diverting a single, even more rarely finding the boundary. skip past newsletter promotion Sign up to Guardian Australia Sport Free newsletter Get a daily roundup of the latest sports news, features and comment from our Australian sports desk Privacy Notice: Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion England relied on vibes and sprites when Cummins went a little Bazball | Jonathan Liew Read more So after a long wait, 70 overs into the innings, Stokes dragged his bad knee into action. In his second over, a cross-seamer took the inside edge on to the stumps. The immovable Khawaja was gone for 65. Stokes was away, with his incredible knack for shaping a game. Ignoring the new ball, keeping Joe Root on with spin that claimed Alex Carey’s wicket the very next over. Then Stokes so nearly recreating his famous World Cup catch, running backwards after Lyon’s hook. But that particular miracle couldn’t repeat, and the extraordinary last stanza of this match took on an unexpected meter. In terms of playing style, the result owes its existence to England’s. Had they batted conventionally in either innings, there would not have been enough time for Australia to have played their own way and won, given the sessions lost to rain. But there would also not have been time for England to come so close to a win themselves. One more nick, and Josh Hazlewood at No 11 was every chance of offering a second. And when the game came down to its last fateful overs, Australia’s captain put an attacking philosophy just as firmly on display. Needing 72 when Khawaja was out, and 54 when Carey followed, Cummins hit twin sixes off Root, then charged Broad and hammered four through cover point. Australia could have looked to bunker down with 15 overs to go, but it turns out that they don’t do draws either. Which, much as you might like to avoid cliche, does take you back to 2005. Specifically to Australia’s lower order pulling a distant chase into the realms of possibility. Back then it was Brett Lee 43 not out, nearly getting home. This time it was Pat Cummins with one more run, with the opposite result, and with one of the best captain’s innings in an Ashes match. One thing is certain: in a couple of decades from now, people will still be talking about this one too.","pubDate":"2023-06-20 20:03:28","image_url":"https://i.guim.co.uk/img/media/bc63ec66f2f67175538e420c53e3bf1366f27035/0_38_3500_2101/master/3500.jpg?width=460&quality=85&auto=format&fit=max&s=5118dbee299a1e27eb3ac254664c3ef6","source_id":"theguardian","category":["sports"],"country":["australia"],"language":"english"},{"title":"BCCI sets Rs 350 cr base price for lead sponsorship rights","link":"https://economictimes.indiatimes.com/news/sports/bcci-sets-rs-350-cr-base-price-for-lead-sponsorship-rights/articleshow/101144170.cms","keywords":null,"creator":null,"video_url":null,"description":"The BCCI released the tender for national team lead sponsor rights on June 14. The tender document will be available for purchase until June 26. The base price is less than the amount paid by the edtech company Byju's, which was the lead sponsor until March. Byju's was paying ₹5.07 crore per match for domestic matches featuring Team India and ₹1.56 crore per match for ICC and ACC tournaments.","content":"Synopsis The BCCI released the tender for national team lead sponsor rights on June 14. The tender document will be available for purchase until June 26. The base price is less than the amount paid by the edtech company Byju's, which was the lead sponsor until March. Byju's was paying ₹5.07 crore per match for domestic matches featuring Team India and ₹1.56 crore per match for ICC and ACC tournaments. BCCI sets Rs 350 cr base price for lead sponsorship rights The Board of Control for Cricket in India ( BCCI ) has set a base price of ₹350 crore for the national lead sponsor rights , sources privy to the development told ET. One of the sources said that the base price for the bilateral matches featuring India is ₹3 crore per match and ₹1 crore per match for International Cricket Council (ICC) and Asian Cricket Council ( ACC ) tournaments. The BCCI released the tender for national team lead sponsor rights on June 14. The tender document will be available for purchase until June 26. The base price is less than the amount paid by the edtech company Byju's, which was the lead sponsor until March. Byju's was paying ₹5.07 crore per match for domestic matches featuring Team India and ₹1.56 crore per match for ICC and ACC tournaments. The BCCI has barred betting, crypto-currency, tobacco, and real-money gaming companies from bidding for the lead sponsor rights. BCCI did not respond to ET's request for comment. A sports business expert said that the BCCI has made the right decision by setting a lower base price than what it was getting from Byju's. \"BCCI has set a realistic base price for the lead sponsor rights. The ad market is tough, and the new-age sponsors who were spending large sums of money on cricket have cut their marketing budgets drastically due to the funding winter,\" the expert said on the condition of anonymity. The expert noted that lead sponsor rights are a great asset that can be used by brands to build long-term value. \"Byju's became a well-known brand due to its association with Team India. The lead sponsor asset is a powerful one to build brands,\" the expert added. In 2019, Byju's replaced mobile handset maker Oppo to become the jersey sponsor of the Indian cricket team. Having bagged the jersey sponsorship rights in March 2017 for a whopping ₹1079.3 crore, Oppo exited the deal by transferring its sponsorship rights to Byju's. Earlier, GroupM South Asia head of sports, esports, and entertainment Vinit Karnik had said that an estimated ₹2,000-2,500 crore worth of on-ground sponsorship inventory across the Indian Premier League (IPL) and bilateral matches will become available this year. According to the GroupM India Sports Sponsorship Report 2023, the Indian sports industry's advertising revenue surged 49% to ₹14,209 crore in 2022 and is expected to reach ₹16,000 crore in 2023. The agency believes that the sports industry's ad revenue could potentially reach ₹20,000 crore by 2025. Don’t miss out on ET Prime stories! Get your daily dose of business updates on WhatsApp. click here! Tuesday, 20 Jun, 2023 Experience Your Economic Times Newspaper, The Digital Way! Read Complete Print Edition » Front Page Pure Politics Companies & Economy ET Markets More PM Modi’s US Visit may Boost Semicon Supply Chain Pact Prime Minister Narendra Modi's visit to the US this week is likely to give a boost to the Indo-US technology partnership, especially on the establishment of a new semiconductor supply chain where major announcements are expected. Adani Looks to Rope in More Lenders to Refinance $3.8 b The Adani Group is in discussions to rope in at least five new international banks as it looks to refinance $3.8 billion of loans of varying tenors taken for the acquisition of ACC Limited and Ambuja Cement last year, said people aware of the ongoing discussions. IndiGo Gives Airbus Record 500-Plane Order IndiGo has placed an order for 500 Airbus A320 family of aircraft, worth $50 billion at list price and the largest in the history of global aviation. Read More News on bcci acc byju s Advertising Marketing Inventory Revenue Brands Rights team india (Catch all the Business News , Breaking News Events and Latest News Updates on The Economic Times .) Download The Economic Times News App to get Daily Market Updates & Live Business News. ... more less ETPrime stories of the day Investing Motilal Oswal launches low-cost micro-cap index fund. Will risk-averse investors go for it? 9 mins read 3 insights to kick-start your day: featuring Glenmark’s cancer drug 3 mins read Strategy Stock Radar: 20% rally so far in 2023! This cement stock is likely to touch record highs soon 3 mins read Subscribe to ETPrime","pubDate":"2023-06-20 19:23:20","image_url":"https://img.etimg.com/thumb/width-1200,imgsize-44388,resizemode-4,msid-101144170/bcci-sets-rs-350-cr-base-price-for-lead-sponsorship-rights.jpg","source_id":"economictimes_indiatimes","category":["sports"],"country":["india"],"language":"english"},{"title":"'He's one' - Andros Townsend makes claim over Liverpool player's on-field antics","link":"https://www.liverpoolecho.co.uk/sport/football/football-news/hes-one-andros-townsend-makes-27163397","keywords":["Sport"],"creator":null,"video_url":null,"description":"Liverpool captain Jordan Henderson has been a vocal member of the Reds' squad since being appointed captain in 2015","content":"Outgoing Everton midfielder Andros Townsend has named Jordan Henderson as the player who has gone to the most effort to distract him during games. This tactic of uttering phrases in the hope of provoking a reaction from an opponent is widely utilised not only in football but also in other sports, particularly cricket. Frowned upon by some, it has become a part of the game regardless. Townsend, who will leave the Blues once his current deal expires at the end of this month, has faced off against Henderson 16 times during his playing career and has come out on top on only one occasion. They last both took to the pitch during 4-1 win at Goodison Park in December 2021, a fixture which saw Henderson named man of the match after his all-action display. Reds fans will best remember their current captain for his impressive work ethic when the time comes for him to leave the club, though Townsend will share an alternative, overriding memory of the former Sunderland midfielder. Asked to name who has been the worst individual for putting him off during matches, Townsend talk talkSPORT: \"Probably [Jordan] Henderson. He’s always talking, he’s always at you. He’s one.\" The pair, so often going head-to-head against each other, have been team-mates when in action together on the international stage. Townsend is no longer a regular member of the England squad, though earned 13 caps between 2013 and 2016. His next club remains to be seen as he prepares to become a free agent after two years spent at Everton.","pubDate":"2023-06-20 19:13:46","image_url":"https://i2-prod.liverpoolecho.co.uk/incoming/article27163526.ece/ALTERNATES/s98/0_Townsend.jpg","source_id":"liverpoolecho","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"ENG Vs AUS: कप्तान पैट कमिंस ने ऑस्ट्रेलियाई को दिलाई ऐतिहासिक जीत, सांसे थामने वाले टेस्ट में इंग्लैंड को दो विकेट से हराया","link":"https://www.abplive.com/sports/cricket/ashes-2023-eng-vs-aus-1st-test-match-report-australia-won-by-2-wickets-pat-cummins-scored-44-runs-while-chasing-2436141","keywords":["Cricket"],"creator":["मोहम्मद अलफैज"],"video_url":null,"description":"Ashes 2023 ENG Vs AUS 1st test Report: ऑस्ट्रेलिया और इंग्लैंड के बीच खेली जा रही एशेज़ 2023 के पहले टेस्ट में ऑस्ट्रेलिया ने 2 विकेट से जीत दर्ज कर ली है. रनों का पीछा करते हुए ऑस्ट्रेलियाई कप्तान पैट कमिंस ने नाबाद रहते हुए 44* रनों की पारी खेली और आखिरी गेंद पर चौका लगाकर टीम को जीत दिलाई. वहीं उस्मान ख्वाजा ने टीम के लिए सबसे बड़ी 65 रनों की पारी खेली. इंग्लैंड की ओर से ब्रॉड ने सबसे ज़्यादा 3 विकेट लिए. बारिश के चलते आखिरी दिन का खेल दूसरे सेशन से शुरू हुआ था.  बारिश के बाद ऑस्ट्रेलिया को आखिरी यानी पांचवें दिन 67 ओवर में 174 रनों का टारगेट दिया गया था. चौथा दिन खत्म होने तक ऑस्ट्रेलिया की टीम 3 विकेट गंवा चुकी थी. लिहाजा ऑस्ट्रेलिया को आखिरी दिन 7 विकेट रहते हुए 174 रन बनाने थे. कंगारू टीम ने 2 विकेट रहते हुए टारगेट हासिल कर एशेज़ 2023 का पहला टेस्ट अपने नाम किया.  कमिंस और नाथन लियोन ने की अर्धशतकीय साझेदारी  ऑस्ट्रेलियाई कप्तान पैट कमिंस और नाथन लियोन ने इस मैच में अपनी बैटिंग से ऑस्ट्रेलिया को जीत दिलाने में अहम किरदार अदा किया. नंबर नौं पर बल्लेबाज़ी करते हुए ऑस्ट्रेलियाई कप्तान पैट कमिंस ने 4 चौके और 2 छक्कों की मदद से 44* और नंबर 10 पर बल्लेबाज़ी करते हुए नाथन लियोन ने 2 चौके लगाकर 16* रन बनाए. दोनों ने 9वें विकेट के लिए 55* रनों की साझेदारी की. ऐसा रहा पूरा मैच  इंग्लैंड ने टॉस जीतकर पहले बल्लेबाज़ी करने का फैसला किया और 8 विकेट पर 393 रन बनाकर पारी घोषित कर दी. टीम की ओर से पूर्व कप्तान जो रूट ने 118 रनों की पारी खेली. इस दौरान ऑस्ट्रेलियाई गेंदबाज़ नाथन लियोन ने 4 और जोश हेज़लवुड ने 2 विकेट चटकाए. इसके अलावा स्कॉट बोलैंड और कैमरून ग्रीन ने 1-1 विकेट अपने नाम किया.  इसके बाद अपनी पहली पारी में बल्लेबाज़ी करने उतरी ऑस्ट्रेलिया की टीम ने 386 रन बनाए. टीम की ओर से उस्मान ख्वाजा ने 14 चौके और 3 छक्कों की मदद से 141 रन जड़े. इस दौरान इंग्लिश गेंदबाज़ स्टुअर्ट ब्राड और रॉबिन्सन ने 3-3 विकेट झटके. इसके अलावा स्पिनर मोईन अली ने 2 विकेट लिए. वहीं कप्तान बेन स्टोक्स और जेम्स एंडरसन ने 1-1 विकेट चटकाया.  अपनी दूसरी पारी के लिए मैदान पर उतरी इंग्लैंड की टीम 273 रनों पर ही सिमट गई. इस पारी में ऑस्ट्रेलियाई गेंदबाज़ नाथन लियोन और कप्तान पैट कमिंस ने 4-4 विकेट झटके. वहीं जोश हेज़लवुड और स्कॉट बोलैंड को 1-1 सफलता मिली. इसके बाद 281 रनों का पीछा करते हुए ऑस्ट्रेलिया ने 2 विकेट से जीत अपने नाम की.    ये भी पढे़ं... Virat Kohli: टेस्ट में 12 साल पूरे होने पर विराट कोहली ने शेयर की खास पोस्ट, लिखी दिल छू लेने वाली बात","content":"Ashes 2023 ENG Vs AUS 1st test Report: ऑस्ट्रेलिया और इंग्लैंड के बीच खेली जा रही एशेज़ 2023 के पहले टेस्ट में ऑस्ट्रेलिया ने 2 विकेट से जीत दर्ज कर ली है. रनों का पीछा करते हुए ऑस्ट्रेलियाई कप्तान पैट कमिंस ने नाबाद रहते हुए 44* रनों की पारी खेली और आखिरी गेंद पर चौका लगाकर टीम को जीत दिलाई. वहीं उस्मान ख्वाजा ने टीम के लिए सबसे बड़ी 65 रनों की पारी खेली. इंग्लैंड की ओर से ब्रॉड ने सबसे ज़्यादा 3 विकेट लिए. बारिश के चलते आखिरी दिन का खेल दूसरे सेशन से शुरू हुआ था. बारिश के बाद ऑस्ट्रेलिया को आखिरी यानी पांचवें दिन 67 ओवर में 174 रनों का टारगेट दिया गया था. चौथा दिन खत्म होने तक ऑस्ट्रेलिया की टीम 3 विकेट गंवा चुकी थी. लिहाजा ऑस्ट्रेलिया को आखिरी दिन 7 विकेट रहते हुए 174 रन बनाने थे. कंगारू टीम ने 2 विकेट रहते हुए टारगेट हासिल कर एशेज़ 2023 का पहला टेस्ट अपने नाम किया. कमिंस और नाथन लियोन ने की अर्धशतकीय साझेदारी ऑस्ट्रेलियाई कप्तान पैट कमिंस और नाथन लियोन ने इस मैच में अपनी बैटिंग से ऑस्ट्रेलिया को जीत दिलाने में अहम किरदार अदा किया. नंबर नौं पर बल्लेबाज़ी करते हुए ऑस्ट्रेलियाई कप्तान पैट कमिंस ने 4 चौके और 2 छक्कों की मदद से 44* और नंबर 10 पर बल्लेबाज़ी करते हुए नाथन लियोन ने 2 चौके लगाकर 16* रन बनाए. दोनों ने 9वें विकेट के लिए 55* रनों की साझेदारी की. googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); ऐसा रहा पूरा मैच इंग्लैंड ने टॉस जीतकर पहले बल्लेबाज़ी करने का फैसला किया और 8 विकेट पर 393 रन बनाकर पारी घोषित कर दी. टीम की ओर से पूर्व कप्तान जो रूट ने 118 रनों की पारी खेली. इस दौरान ऑस्ट्रेलियाई गेंदबाज़ नाथन लियोन ने 4 और जोश हेज़लवुड ने 2 विकेट चटकाए. इसके अलावा स्कॉट बोलैंड और कैमरून ग्रीन ने 1-1 विकेट अपने नाम किया. इसके बाद अपनी पहली पारी में बल्लेबाज़ी करने उतरी ऑस्ट्रेलिया की टीम ने 386 रन बनाए. टीम की ओर से उस्मान ख्वाजा ने 14 चौके और 3 छक्कों की मदद से 141 रन जड़े. इस दौरान इंग्लिश गेंदबाज़ स्टुअर्ट ब्राड और रॉबिन्सन ने 3-3 विकेट झटके. इसके अलावा स्पिनर मोईन अली ने 2 विकेट लिए. वहीं कप्तान बेन स्टोक्स और जेम्स एंडरसन ने 1-1 विकेट चटकाया. अपनी दूसरी पारी के लिए मैदान पर उतरी इंग्लैंड की टीम 273 रनों पर ही सिमट गई. इस पारी में ऑस्ट्रेलियाई गेंदबाज़ नाथन लियोन और कप्तान पैट कमिंस ने 4-4 विकेट झटके. वहीं जोश हेज़लवुड और स्कॉट बोलैंड को 1-1 सफलता मिली. इसके बाद 281 रनों का पीछा करते हुए ऑस्ट्रेलिया ने 2 विकेट से जीत अपने नाम की. ये भी पढे़ं... Virat Kohli: टेस्ट में 12 साल पूरे होने पर विराट कोहली ने शेयर की खास पोस्ट, लिखी दिल छू लेने वाली बात","pubDate":"2023-06-20 18:47:24","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/06/21/c281e5019c0014ed468b032c6277eeb71687286280512582_original.jpg","source_id":"abplive","category":["sports"],"country":["india"],"language":"hindi"},{"title":"The Ashes: ऑस्ट्रेलिया ने नहीं दोहराई 2005 वाली गलती, एशेज के पहले टेस्ट में इंग्लैंड पर हासिल की रोमांचक जीत","link":"https://navbharattimes.indiatimes.com/sports/cricket/cricket-news/the-ashes-australia-defeats-england-by-2-wickets-in-first-test/articleshow/101143051.cms","keywords":null,"creator":null,"video_url":null,"description":"The Ashes: ऑस्ट्रेलिया ने इंग्लैंड के खिलाफ एशेज सीरीज का पहला टेस्ट जीत लिया है। एजबेस्टन में खेले गए मुकाबले को पैट कमिंस की टीम ने 2 विकेट से अपने नाम किया। 2005 में इसी मैदान पर ऑस्ट्रेलियाई टीम सिर्फ 2 रनों से एशेज सीरीज का पहला हार गई थी।","content":"ऑस्ट्रेलिया ने इंग्लैंड (ENG vs AUS) को हराकर एशेज सीरीज (The Ashes) का पहला टेस्ट अपने नाम कर लिया है। इंग्लिश टीम को वर्ल्ड चैंपियन के खिलाफ 2 विकेट से हार मिली। बर्मिंघम के एजबेस्टन मैदान पर ऑस्ट्रेलिया के सामने चौथी पारी में जीत के लिए 281 रनों का लक्ष्य था। ऑस्ट्रेलिया ने 8 विकेट खोकर लक्ष्य हासिल कर लिया। 227 के स्कोर पर ही टीम के 8 विकेट गिर गए थे। इसके बाद कप्तान पैट कमिंस और नाथन लायन ने टीम को लक्ष्य तक पहुंचा दिया। 2005 में इसी मैदान पर ऑस्ट्रेलिया के सामने चौथी पारी में 282 का लक्ष्य था। टीम वह मुकाबला 2 रन से हार गई थी। ऑस्ट्रेलिया के लिए पैट कमिंस और नाथन लायन ने 55 रनों की नाबाद साझेदारी बनाई। कप्तान कमिंस के बल्ले से 73 गेंदों पर 4 चौके और 2 छक्कों की मदद से 44 रन निकले। लायन ने 16 रनों का योगदान दिया। 227 रनों पर 8 विकेट गिरने के बाद ऑस्ट्रेलिया की हार पक्की दिख रही थी। लेकिन इन दोनों गेंदबाजों ने टीम को जीत तक पहुंचा दिया। मैच के आखिरी दिन ऑस्ट्रेलिया को जीत के लिए 174 रन और इंग्लैंड को 7 विकेट की जरूरत थी। सुबह का सत्र बारिश की भेंट चढ़ गया जिसके कारण लंच ब्रेक जल्दी लिया गया। मैच शुरू होने पर अंपायरों ने टीमों को 67 ओवर दिए। ऑस्ट्रेलिया ने दिन की शुरुआत तीन विकेट पर 107 रन से की। ख्वाजा और रात्रि प्रहरी स्कॉट बोलैंड ने पारी को आगे बढ़ाया। स्टुअर्ट ब्रॉड ने दिन के आठवें ओवर में बोलैंड को विकेटकीपर जॉनी बेयरस्टो के हाथों कैच कराके इस साझेदारी को तोड़ा। बोलैंड ने करियर की सर्वश्रेष्ठ 20 रन की पारी खेली। अच्छी फॉर्म में चल रहे ट्रेविस हेड भी अधिक देर नहीं टिक सके और 16 रन बनाकर ऑफ स्पिनर मोईन अली की गेंद पर स्लिप में जो रूट के कैच दे बैठे जिससे ऑस्ट्रेलिया का स्कोर पांच विकेट पर 143 रन हो गया। चाय ब्रेक के बाद ऑस्ट्रेलिया को तीन बड़े झटके लगे। कैमरून ग्रीन 28 रन बनाकर रॉबिंसन की गेंद पर बोल्ड हो गए। बेन स्टोक्स ने उस्मान ख्वाजा को आउट कर ऑस्ट्रेलिया का सबसे बड़ा विकेट झटका। पहली पारी में शतक बनाने वाले ख्वाजा ने दूसरी पारी में 65 रनों का योगदान दिया। एलेक्स कैरी (20) को जो रूट ने आउट किया। इंग्लैंड ने मैच की पहली पारी में 8 विकेट पर 393 रन बनाए थे। टीम के लिए जो रूट शतक बनाकर खेल रहे थे। इसके बाद भी कप्तान बेन स्टोक्स ने पहले ही दिन पारी घोषित कर दी। टीम के पास और बड़ा स्कोर बनाने का मौका था। ऑस्ट्रेलिया ने अपनी पहली पारी में 386 रन बनाए थे। इंग्लैंड की दूसरी पारी 273 रनों पर समेटने के बाद ऑस्ट्रेलिया को 281 रनों का लक्ष्य मिला था।","pubDate":"2023-06-20 18:45:26","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Ashes: Australia beat England by two wickets to win thrilling first Test","link":"https://www.standard.co.uk/sport/cricket/ashes-2023-first-test-result-england-vs-australia-b1089109.html","keywords":["Cricket","Sport"],"creator":["Malik Ouzia"],"video_url":null,"description":"For the most-hyped Ashes series in a generation, and an opener that from first ball had lived up to billing, here was a fitting finale, one sainted to rank alongside Edgbaston 2005 and Headingley 2019 as the century’s most dramatic.","content":"or the most-hyped Ashes series in a generation, and an opener that from first ball had lived up to billing, here was a fitting finale, one sainted to rank alongside Edgbaston 2005 and Headingley 2019 as the century’s most dramatic. These players were raised on the former series but many lived the second through its core, few more painfully than Nathan Lyon, who fumbled with the match at his mercy, and Pat Cummins, whose final ball was cut away, cut away for four. This then, was redemption, Australia’s two best bowlers in the middle refusing to lay down the bat as Ben Stokes, Headingley’s hero, at last ran out of ideas. Four years on from that agonising defeat, at 7:21pm on a warm Birmingham evening, they stood triumphant and unbeaten, a chase of 281 complete with just two tail-end wickets in hand. Of those, 54 were still required when Lyon and Cummins combined and Australia, you felt certain, would pay for their careful pursuit. Usman Khawaja, scorer of 201 runs in the match, was destined to be a bizarre scapegoat, having clearly resolved to be there at the end and, it seemed, left too much to do in the eventuality that he was not. As it turned out, though, this was a culture clash only until the second-last, caution thrown to the wind as Cummins hit two sixes in an over off Joe Root to turn the tide. SPONSORED Stokes, as ever did his best to hold it back, having dragged a rare spell from his ailing legs to end Khawaja’s second vigil of the match, then come agonisingly close to what would have been the catch of his career, a field in which the bar is set ludicrously high. If there is regret for the England skipper - and he will insist his team have no time for those - it must be in the runs left on the table by the first evening’s early declare. This is an Australian victory that ought to be far from a knockout blow, the tourists heading to Lord’s 1-0 up but the two teams, on five gripping days’ evidence, thrillingly well-matched. England though, to regain the Ashes, must do what no one side as since Michael Vaughan’s heroes and come from behind to claim the Urn. For Cummins, who hit the winning runs to finish unbeaten on 44, there was a sense of personal vindication, the Australian captain, in fashion so un-Australian, having consented to spend so much of these five days on the back foot. The acceptance was that on home turf and so buoyed by revolution, England were always bound to make the running. The morning of a day five so epically poised brought forecast storms and a 2:15pm start that, if anything, merely served to ensure the hues were just right for a knife-edge climax so late in the day. The first hour brought only 12 runs off the bat, the sole moment of excitement coming, predictably, from Stuart Broad, who bluffed nightwatchman Scott Boland with a short-ball field and rattled his stumps, the supposed bunny taking with him 20 important runs. Excitement and tension are two different things, though, and on days like these, even with 160 of them still required, few were in doubt as to the value of each run. They were hard to come by, Stokes’s field placement canny and Australia’s few shots of intent denied leave from the ring. Root stood on the fence, conducting the crowd like an Olympic long-jumper at the top of the runway, arms flapping and hands clapping as Broad thundered in through a seven-over spell. If pressure was to be means to a wicket then Moeen Ali’s introduction seemed to have bungled the plan, the spinner’s first three deliveries all pounced on by Travis Head to the tune of ten quick runs. Leakage, though, is factored into the Moeen bargain and two deliveries later Australia’s most aggressive batter was no more. England’s growing desperation, though, told you Australia had edged in front. Broad tried in vain to get a frigid ball changed, holding it up to the light for the umpire’s inspection as if it were a dodgy tenner. Root urged the Hollies for more as they rumbled his name, a rare act of narcissism from a selfless player, and certainly a bold one for a man about to twirl part-time spin. In fairness, Root rose to the sound with a valiant spell, including, later, the in-form Alex Carey’s wicket caught and bowled. Ollie Robinson, who has grown into this match like a teenager into new school shoes, again cracked the game open after tea, Green out chopping on with 89 still to get. Then came the break glass moment, spotted by the eagle-eyed before it happened: English hopes drifting, Aussie belief building and at mid-off Stokes, at last, getting loose. How many deliveries are left in those legs - in that knee - only he can guess, but here was a moment in which it had to be worth using up a few of them: If not now, then when? In the end, even the glazy-eyed got forewarning, for rarely can the sight of a man handing a cap to an umpire have been met with such a noise. The first over was nothing special, a trundling effort off a half-paced run, but the second changed all complexion: Khawaja gone, game on. It seemed ripe, as so many before it, for Stokes’s seizing but for once, in the face of Lyon and Cummins’ resilience, he was found clutching at air.","pubDate":"2023-06-20 18:43:00","image_url":"https://static.standard.co.uk/2023/06/20/19/newFile-1.jpg?width=1200&auto=webp","source_id":"standarduk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"1st Ashes Test: Khawaja, Cummins Star In Australia's Narrow Win vs England","link":"https://sports.ndtv.com/cricket/england-vs-australia-1st-ashes-test-usman-khawaja-pat-cummins-star-as-australia-edge-past-england-by-2-wickets-4138551","keywords":null,"creator":null,"video_url":null,"description":"Australia beat England by two wickets to win a thrilling first Ashes Test at Edgbaston on Tuesday.","content":"Australia beat England by two wickets to win a thrilling first Ashes Test at Edgbaston on Tuesday. Australia were struggling at 227-8, still 54 runs shy of a victory target of 281, when skipper Pat Cummins was joined in the middle by tailender Nathan Lyon. But the pair's unbroken stand of 55 saw Ashes holders Australia home, with Cummins hitting the winning boundary to finish on 44 not out after opener Usman Khawaja had made a painstaking 65 to follow his first-innings 141. Lyon was unbeaten on 16, with Australia now 1-0 up in this five-match series as they bid for a first Ashes campaign triumph on English soil in 22 years. (This story has not been edited by NDTV staff and is auto-generated from a syndicated feed.)","pubDate":"2023-06-20 18:42:34","image_url":null,"source_id":"ndtv","category":["sports"],"country":["india"],"language":"english"},{"title":"Ashes 2023 : थरारक सामन्यात कमिन्सने विजयी चौकार लगावला, पहिल्या कसोटी सामन्यात ऑस्ट्रेलियाचा इंग्लंडवर विजय","link":"https://marathi.abplive.com/sports/cricket/ashes-2023-edgbaston-test-australia-won-by-2-wickets-1185919","keywords":["क्रिकेट"],"creator":["एबीपी माझा ब्युरो"],"video_url":null,"description":"Ashes 2023, Edgbaston Test : कर्णधार पॅट कमिन्स याच्या झंझावती फलंदाजीच्या जोरावर ऑस्ट्रेलियाने पहिल्या कसोटीत थरारक विजय मिळवला. यासह कांगारुंनी अॅशेस मालिकेत विजयाने सुरुवात केली आहे. इंग्लंडने दिलेल्या 281 धावांच्या आव्हानाचा पाठलाग ऑस्ट्रेलियाने दोन विकेट राखून केला.  ऑस्ट्रेलियाकडून पॅट कमिन्स याने नाबाद 44 तर उस्मान ख्वाजा याने 65 धावांचे योगदान दिले.  ऑस्ट्रेलियाकडून उस्मान ख्वाजा याने दोन्ही डावात दमदार फलंदाजी केली. पहिल्या डावात उस्मान ख्वाजा याने 141 धावांची खेळी केली तर दुसऱ्या डावात निर्णायाक 65 धावांचे योगदान दिले. उस्मान ख्वाजाशिवाय दुसऱ्या डावात डेविड वॉर्नर याने 36 धावांची खेळी केली. मार्नस लाबुशेन 13, स्टिवन स्मिथ 06, स्कॉट बोलँड 20, ट्रेविस हेड 16,  कॅमरुन ग्रीन 28, अॅलेक्स कॅरी 20 धावांची खेळी केली.  281 धावांचा पाठलाग करताना ऑस्ट्रेलियाने दमदार सुरुवात केली. डेविड वॉर्नर आणि उस्मान ख्वाजा यांनी पहिल्या विकेटसाठी 61 धावांची भागिदारी केली. डेविड वॉर्नर याला ओली रॉबिसन याने तंबूत पाठवले. त्यानंतर ऑस्ट्रेलियाचा डाव ढेपाळला. एकापाठोपाठ एक फलंदाज तंबूत परतले. दुसऱ्या बाजूला उस्मान ख्वाजा याने एकेरी दुहेरी धावसंख्येवर भर दिला. एका बाजूला विकेट पडत असताना उस्मान ख्वाजा याने दुसरी बाजू लावून धरली.  उस्मान ख्वाजा येने बोलँड याच्यासोबत 32, हेडसोबत 22 आणि ग्रीनसोबत 49 धावांची भागिदारी करत धावसंख्येला आकार दिला. इंग्लंडचा कर्णधार बेन स्टोक्स याने ख्वाजा याला त्रिफाळाचित करत इंग्लंडच्या आशा उंचावल्या. उस्मान ख्वाजा बाद झाल्यानंतर इंग्लंडच्या आशा पल्लवीत झाल्या होत्या. पण कर्णधार पॅट कमिन्स याने नॅथन लायन याला हाताशी धरत ऑस्ट्रेलियाच्या धावसंख्येला आकार दिला. पॅट कमिन्स याने लायन याच्यासोबत नवव्या विकेटसाठी नाबाद 55 धावांची भागिदारी केली. पॅट कमिन्स याने नाबाद 44 तर नॅथन लायन याने नाबाद 16 धावांची खेळी केली.  Test cricket at its best 🤩Australia seal a mouth-watering win in Birmingham in the first #Ashes Test ✌️#WTC25 | 📝: https://t.co/ZNnKIn9jeq pic.twitter.com/K0lKH79ml4 — ICC (@ICC) June 20, 2023 पहिल्या कसोटीत काय झाले ? अॅशेस कसोटी मालिकेच्या पहिल्या सामन्यात इंग्लंडने नाणेफेक जिंकून प्रथम फलंदाजी करण्याचा निर्णय घेतला. यजमान इंग्लंडने पहिल्या डावात आठ विकेटच्या मोबदल्यात 393 धावांपर्यंत मजल मारली. इंग्लंडकडून जो रुट याने शतकी खेळी केली.  जो रुट याने 118 धावांचे योगदान दिले. त्याशिवाय जॉनी बेअस्टो याने 78 धावांचे योगदान दिले. ऑस्ट्रेलियाकडून नॅथन लायन याने सर्वाधिक 4 विकेट घेतल्या. इंग्लंडने दिलेल्या 393 धावांच्या आव्हानाचा पाठलाग ऑस्ट्रेलियाने प्रभावीपणे केला. कागांरुंनी पहिल्या डावात 386 धावांपर्यंत मजल मारली. उस्मान ख्वाजा याने ऑस्ट्रेलियाकडून शतकी खेळी केली. ख्वाजा याने 141 धावांचे योगदान दिले. त्याशिवाय ट्रेविस हेड आणि अॅलेक्स कॅरी यांनीही अर्धशतके झळकावली. हेड याने 50 तर अॅलेक्स कॅरी याने 66 धावांचे योगदान दिले. पहिल्या डावात ऑस्ट्रेलियाचा संघ अवघ्या 7 धावांनी पिछाडीवर होता. इंग्लंडचा संघ दुसऱ्या डावात 273 धावांत संपला.  एकाही फलंदाजाला अर्धशतकी खेळी करता आली नाही. इंग्लंडकडून जो रूट आणि हॅरी ब्रूक यांनी प्रत्येकी 46-46 धावांचे योगदान दिले. त्याशिवाय कर्णधार बेन स्टोक्स याने 43 धावांची खेळी केली. ऑस्ट्रेलियाचा कर्णधार पॅट कमिन्स आणि नॅथन लायन यांनी प्रत्येकी 4-4 विकेट घेतल्या आहेत. जोश हेजलवूड आणि स्कॉट बोलँड यांनी प्रत्येकी एक एक विकेट घेतली.","content":"Ashes 2023, Edgbaston Test : कर्णधार पॅट कमिन्स याच्या झंझावती फलंदाजीच्या जोरावर ऑस्ट्रेलियाने पहिल्या कसोटीत थरारक विजय मिळवला. यासह कांगारुंनी अॅशेस मालिकेत विजयाने सुरुवात केली आहे. इंग्लंडने दिलेल्या 281 धावांच्या आव्हानाचा पाठलाग ऑस्ट्रेलियाने दोन विकेट राखून केला. ऑस्ट्रेलियाकडून पॅट कमिन्स याने नाबाद 44 तर उस्मान ख्वाजा याने 65 धावांचे योगदान दिले. ऑस्ट्रेलियाकडून उस्मान ख्वाजा याने दोन्ही डावात दमदार फलंदाजी केली. पहिल्या डावात उस्मान ख्वाजा याने 141 धावांची खेळी केली तर दुसऱ्या डावात निर्णायाक 65 धावांचे योगदान दिले. उस्मान ख्वाजाशिवाय दुसऱ्या डावात डेविड वॉर्नर याने 36 धावांची खेळी केली. मार्नस लाबुशेन 13, स्टिवन स्मिथ 06, स्कॉट बोलँड 20, ट्रेविस हेड 16, कॅमरुन ग्रीन 28, अॅलेक्स कॅरी 20 धावांची खेळी केली. 281 धावांचा पाठलाग करताना ऑस्ट्रेलियाने दमदार सुरुवात केली. डेविड वॉर्नर आणि उस्मान ख्वाजा यांनी पहिल्या विकेटसाठी 61 धावांची भागिदारी केली. डेविड वॉर्नर याला ओली रॉबिसन याने तंबूत पाठवले. त्यानंतर ऑस्ट्रेलियाचा डाव ढेपाळला. एकापाठोपाठ एक फलंदाज तंबूत परतले. दुसऱ्या बाजूला उस्मान ख्वाजा याने एकेरी दुहेरी धावसंख्येवर भर दिला. एका बाजूला विकेट पडत असताना उस्मान ख्वाजा याने दुसरी बाजू लावून धरली. उस्मान ख्वाजा येने बोलँड याच्यासोबत 32, हेडसोबत 22 आणि ग्रीनसोबत 49 धावांची भागिदारी करत धावसंख्येला आकार दिला. इंग्लंडचा कर्णधार बेन स्टोक्स याने ख्वाजा याला त्रिफाळाचित करत इंग्लंडच्या आशा उंचावल्या. उस्मान ख्वाजा बाद झाल्यानंतर इंग्लंडच्या आशा पल्लवीत झाल्या होत्या. पण कर्णधार पॅट कमिन्स याने नॅथन लायन याला हाताशी धरत ऑस्ट्रेलियाच्या धावसंख्येला आकार दिला. पॅट कमिन्स याने लायन याच्यासोबत नवव्या विकेटसाठी नाबाद 55 धावांची भागिदारी केली. पॅट कमिन्स याने नाबाद 44 तर नॅथन लायन याने नाबाद 16 धावांची खेळी केली. Test cricket at its best 🤩 Australia seal a mouth-watering win in Birmingham in the first #Ashes Test ✌️ #WTC25 | 📝: https://t.co/ZNnKIn9jeq pic.twitter.com/K0lKH79ml4 googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); — ICC (@ICC) June 20, 2023 पहिल्या कसोटीत काय झाले ? अॅशेस कसोटी मालिकेच्या पहिल्या सामन्यात इंग्लंडने नाणेफेक जिंकून प्रथम फलंदाजी करण्याचा निर्णय घेतला. यजमान इंग्लंडने पहिल्या डावात आठ विकेटच्या मोबदल्यात 393 धावांपर्यंत मजल मारली. इंग्लंडकडून जो रुट याने शतकी खेळी केली. जो रुट याने 118 धावांचे योगदान दिले. त्याशिवाय जॉनी बेअस्टो याने 78 धावांचे योगदान दिले. ऑस्ट्रेलियाकडून नॅथन लायन याने सर्वाधिक 4 विकेट घेतल्या. इंग्लंडने दिलेल्या 393 धावांच्या आव्हानाचा पाठलाग ऑस्ट्रेलियाने प्रभावीपणे केला. कागांरुंनी पहिल्या डावात 386 धावांपर्यंत मजल मारली. उस्मान ख्वाजा याने ऑस्ट्रेलियाकडून शतकी खेळी केली. ख्वाजा याने 141 धावांचे योगदान दिले. त्याशिवाय ट्रेविस हेड आणि अॅलेक्स कॅरी यांनीही अर्धशतके झळकावली. हेड याने 50 तर अॅलेक्स कॅरी याने 66 धावांचे योगदान दिले. पहिल्या डावात ऑस्ट्रेलियाचा संघ अवघ्या 7 धावांनी पिछाडीवर होता. इंग्लंडचा संघ दुसऱ्या डावात 273 धावांत संपला. एकाही फलंदाजाला अर्धशतकी खेळी करता आली नाही. इंग्लंडकडून जो रूट आणि हॅरी ब्रूक यांनी प्रत्येकी 46-46 धावांचे योगदान दिले. त्याशिवाय कर्णधार बेन स्टोक्स याने 43 धावांची खेळी केली. ऑस्ट्रेलियाचा कर्णधार पॅट कमिन्स आणि नॅथन लायन यांनी प्रत्येकी 4-4 विकेट घेतल्या आहेत. जोश हेजलवूड आणि स्कॉट बोलँड यांनी प्रत्येकी एक एक विकेट घेतली.","pubDate":"2023-06-20 18:30:50","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/06/21/aec8589e1b584f166f5d1c21f93878411687285836847265_original.jpg","source_id":"abplive","category":["sports"],"country":["india"],"language":"Marathi"},{"title":"Ashes Series 2023: দাঁতে দাঁত চেপে কামিন্সের দুরন্ত লড়াই, ২ উইকেটে প্রথম অ্যাশেজ টেস্ট জিতল অস্ট্রেলিয়া","link":"https://bengali.abplive.com/sports/cricket/australian-captain-pat-cummins-guide-australia-to-a-2-wicket-victory-in-first-ashes-test-986994","keywords":["ক্রিকেট"],"creator":["ABP Ananda"],"video_url":null,"description":"বার্মিংহাম: অ্যাশেজ মানেই ক্রিকেটের সবথেকে পুরনো প্রতিদ্বন্দ্বিতা। দুই চিরপ্রতিদ্বন্দ্বী অস্ট্রেলিয়া ও ইংল্যান্ডের হাড্ডাহাড্ডি লড়াই। বার্মিংহামের এজবাস্টনে সেই হাড্ডাহাড্ডি লড়াইয়েরই সাক্ষী হয়ে থাকল ক্রিকেটবিশ্ব। এক রুদ্ধশ্বাস ম্যাচে পরিপক্কতার পরিচয় দিয়ে দলকে দুই উইকেট জেতালেন প্যাট কামিন্স। প্রবল চাপের মাথা ঠান্ডা রেখে তাঁর অপরাজিত ৪৪ রানের ইনিংসই অজিদের দুই উইকেটে জয় এনে দিল। নবম উইকেটে প্যাট কামিন্স ও নাথান লায়ন অস্ট্রেলিয়ার হয়ে ৫৫ রান যোগ করেন। এবিপি আনন্দ এখন টেলিগ্রামেও, ক্লিক করুন এই লিঙ্কেhttps://t.me/abpanandaofficial আরও পড়ুন: লেখার দক্ষতা বাড়াতে কোন কোন দিকে খেয়াল রাখতে হবে?","content":"বার্মিংহাম: অ্যাশেজ মানেই ক্রিকেটের সবথেকে পুরনো প্রতিদ্বন্দ্বিতা। দুই চিরপ্রতিদ্বন্দ্বী অস্ট্রেলিয়া ও ইংল্যান্ডের হাড্ডাহাড্ডি লড়াই। বার্মিংহামের এজবাস্টনে সেই হাড্ডাহাড্ডি লড়াইয়েরই সাক্ষী হয়ে থাকল ক্রিকেটবিশ্ব। এক রুদ্ধশ্বাস ম্যাচে পরিপক্কতার পরিচয় দিয়ে দলকে দুই উইকেট জেতালেন প্যাট কামিন্স। প্রবল চাপের মাথা ঠান্ডা রেখে তাঁর অপরাজিত ৪৪ রানের ইনিংসই অজিদের দুই উইকেটে জয় এনে দিল। নবম উইকেটে প্যাট কামিন্স ও নাথান লায়ন অস্ট্রেলিয়ার হয়ে ৫৫ রান যোগ করেন। এবিপি আনন্দ এখন টেলিগ্রামেও, ক্লিক করুন এই লিঙ্কে https://t.me/abpanandaofficial আরও পড়ুন: লেখার দক্ষতা বাড়াতে কোন কোন দিকে খেয়াল রাখতে হবে? var _fireSc=!0;document.addEventListener(\"scroll\",(e=>{if(_fireSc){var c=document.createElement(\"script\");c.src=\"//asset.fwpub1.com/js/storyblock.js\",c.async=!0,document.getElementsByTagName(\"head\")[0].appendChild(c),_fireSc=!1}}));","pubDate":"2023-06-20 18:29:11","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/06/20/81b0283dff1c0b903e99ad2faf99f65b1687285680179507_original.jpg","source_id":"abplive","category":["sports"],"country":["india"],"language":"Bengali"},{"title":"Australia hold off late England charge to win first Ashes Test in thrilling finale","link":"https://www.theguardian.com/sport/2023/jun/20/england-australia-ashes-first-test-day-five-match-report-cricket","keywords":["Ashes 2023","The Ashes","England cricket team","Australia cricket team","Australia sport","Cricket","Sport"],"creator":["Ali Martin at Edgbaston"],"video_url":null,"description":"First Test: England 393-8 & 273; Australia 386 & 282-8Pat Cummins and Nathan Lyon dig in for two-wicket winAt the end of a final day packed with pressure and palpitations it was Australia who emerged victorious. The old fable of the tortoise and the hare just about held firm as they chased down 281 to beat England by two wickets and secure a 1-0 lead in this red-hot Ashes series. Those numbers tell little of the drama.This was a famous victory for Pat Cummins and his world champions, the captain the hero when at 7.21pm and with four overs left – ice in his veins and a gutsy sidekick in Nathan Lyon – a guide to third man off Ollie Robinson was fumbled over the rope by Harry Brook. Reaching 282 for eight from 92.3 overs, it completed an epic chase that left nerves utterly shredded. Continue reading...","content":"At the end of a final day packed with pressure and palpitations it was Australia who emerged victorious. The old fable of the tortoise and the hare just about held firm as they chased down 281 to beat England by two wickets and secure a 1-0 lead in this red-hot Ashes series. Those numbers tell little of the drama. This was a famous victory for Pat Cummins and his world champions, the captain the hero when at 7.21pm and with four overs left – ice in his veins and a gutsy sidekick in Nathan Lyon – a guide to third man off Ollie Robinson was fumbled over the rope by Harry Brook. Reaching 282 for eight from 92.3 overs, it completed an epic chase that left nerves utterly shredded. Bold or brainless? Debate Ben Stokes’s tactics but don’t expect him to change | Andy Bull Read more Cummins and Lyon had come together an hour earlier with England in the ascendancy and Ben Stokes, a constant source of energy for his side, eyeing up his 12th win as captain. Joe Root had somehow clung on to a bullet return catch off Alex Carey’s bat that left Australia 227 for eight, 54 runs short of their goal. Edgbaston was in full voice at this stage, the Hollies Stand goading the tourists and their pockets of supporters with the kind of triumphalism that was positively ripe to turn red-faced. Not that the conclusion was sour. Far from it. This fifth sellout crowd left with memories galore and a final twist to digest as over the course of 11 gripping overs under lights Cummins and Lyon repelled the second new ball and worked the gaps like a couple of pros. They sealed their country’s highest successful run chase since Cummins struck the winning blow of 310-run target in Johannesburg on his debut 12 years ago. Fifty caps later, the blue-eyed Blue Mountains boy has done it again. The coup de grace this time was unreflective of a fielding display from England that was tigerish throughout; a contributing factor to the pressure cooker the ground had become. Once the valve was released with Brook’s fumble, Cummins enveloped Lyon in an almighty bear hug, the pair 44 and 16 not out respectively and the toast of an away dressing room that was bouncing. The two teams soon shared smiles and handshakes, all combatants seeing the bigger picture of this classic Test finish. Among them was Usman Khawaja, no doubt keen to raise a glass of ice-cold diet Coke to his lips once more. The opener was named player of the match, having followed his first innings 141 with a similarly adhesive 65 that kept Australia in the hunt. The 36-year-old, riding what has become a remarkable late crest in his career, batted on all five days, faced 518 balls and spent 796 minutes out in the middle. All in a thick cable-knit tank top. Usman Khawaja looks back after being dismissed by Ben Stokes. Photograph: Mike Egerton/PA On another day Khawaja’s demise might have been the moment that commanded the headlines. At 5.29pm, short of options before the second new ball’s arrival, Stokes brought himself on to bowl for the first time in the innings. Charging to the crease in defiance of that left knee injury, he sent down a smart slower ball that cannoned into the stumps off the inside edge. With Australia 209 for seven it appeared another case of Stokes bending the script to his will. skip past newsletter promotion Sign up to The Spin Free weekly newsletter Subscribe to our cricket newsletter for our writers' thoughts on the biggest stories and a review of the week’s action Privacy Notice: Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion England relied on vibes and sprites when Cummins went a little Bazball | Jonathan Liew Read more But that wickets column was deceptive all day, Australia’s deployment of a nightwatchman the previous evening – Scott Boland – creating the illusion. At 2.15pm, after morning rain, Boland had walked out alongside Khawaja, with the score 107 for three and needing 174 runs in 67 overs. It soon became clear Australia would be putting their supporters back home into a state of sleep-deprived delirium. In the first hour 21 runs were chiselled off the target – a mere 13 from the bat – and Stuart Broad removing Boland for his third wicket of the innings. When Moeen Ali was thrown the ball in the 15th over of this opening session, removing the typically aggressive Travis Head for 16 with a ball that gripped and found the left-hander’s edge, Australia’s 143 for five did not quite reflect the depth to come. It was a fine delivery in an otherwise forlorn showing from Moeen, that burst blister on his spinning finger leaving him a passenger in the main. Had the skin on that digit been hard and durable from regular first‑class cricket, not red and raw after a 33-over first innings straight out of Test retirement, Stokes would have been able to turn to a spinner with the best fourth‑innings strike-rate of any to claim more than 50 wickets. This England team do not appear to do regrets, so to claim they will rue the SOS to Moeen would be false. Similarly, come the second Test at Lord’s next Wednesday they will not be turning back on the decision to restore Jonny Bairstow behind the stumps, even if three missed chances in Australia’s first innings – and an edge off Khawaja that flew between keeper and first slip late on day four – proved costly. That day one declaration? All part of the entertainment, said an unrepentant Stokes. Pat Cummins celebrates with Nathan Lyon after their match-winning 55-run partnership. Photograph: Stu Forster/Getty Images This final day certainly had it in spades, be it Robinson’s dramatic removal of Cameron Green for 28, bowled off the inside edge, the tension that built as Australia declined to take on Root’s bowling or the spectacular one‑handed effort from Stokes in the deep off Lyon that popped out of his grasp. With 36 runs to get at that stage, and Josh Hazlewood next man in at No 11, it would have been telling. As it was, England met an Australian team prepared to meet fire with ice and a captain embodying this in Cummins. The tourists scored at 3.2 runs per over to the home side’s 4.61 and you have to go back to 1904, when England (2.30) beat Australia (3.81) at Melbourne, for the only time the difference was greater. The tortoises lead 1-0 and this culture clash Ashes series is off to an incredible start.","pubDate":"2023-06-20 18:23:39","image_url":"https://i.guim.co.uk/img/media/19aad83d6d05bd141846064e8811da6957a56e89/0_168_4000_2400/master/4000.jpg?width=460&quality=85&auto=format&fit=max&s=e9fad5fc8de00619a5f33a27dd6493c0","source_id":"theguardian","category":["sports"],"country":["australia"],"language":"english"},{"title":"Forget 2005 comparisons, this was as dramatic as decade-old Durham | Geoff Lemon","link":"https://www.theguardian.com/sport/blog/2023/jun/20/usman-khawaja-pat-cummins-ashes-australia-england-first-test-day-five-cricket","keywords":["Ashes 2023","Australia cricket team","England cricket team","The Ashes","Cricket","Australia sport","Sport"],"creator":["Geoff Lemon at Edgbaston"],"video_url":null,"description":"First Test was reminiscent of 2013 as Warner gave Australia a flying start before Broad delivered one of his Ashes specialsSmoking Jesus. Take a moment to collect yourself. If you were watching that final day at Edgbaston, you deserve to let your nerves unspool. They must be clenched to raging little clusters of data. Do some deep breathing. Take your shoes off and walk on the lawn. Fists with your toes. Even if you’re not invested in either team, close Test cricket can make you sick, when awaiting each delivery feels like you’ve just chugged a large chocolate milk before jumping on Magic Mountain.If you’ve paid any attention to coverage over the past five days, you might have heard one or two comparisons to the Edgbaston Ashes Test of 2005. Run totals of 407 on the first day, fourth‑innings targets for Australia of 282 and 281 respectively, falling short both times under clouded skies, simmering in the fetid steambath of noise generated by the Hollies Stand. Continue reading...","content":"S moking Jesus. Take a moment to collect yourself. If you were watching that final day at Edgbaston, you deserve to let your nerves unspool. They must be clenched to raging little clusters of data. Do some deep breathing. Take your shoes off and walk on the lawn. Fists with your toes. Even if you’re not invested in either team, close Test cricket can make you sick, when awaiting each delivery feels like you’ve just chugged a large chocolate milk before jumping on Magic Mountain. If you’ve paid any attention to coverage over the past five days, you might have heard one or two comparisons to the Edgbaston Ashes Test of 2005. Run totals of 407 on the first day, fourth‑innings targets for Australia of 282 and 281 respectively, falling short both times under clouded skies, simmering in the fetid steambath of noise generated by the Hollies Stand. Australia hold off late England charge to win first Ashes Test in thrilling finale Read more Until the dramatic work of Australia’s lower order, though, this was more reminiscent of Durham in 2013. That time Australia were set a chase of 299. Both involved David Warner giving Australia a flying start in the company of a left‑handed opening partner enjoying a late-career revival at around the age of 36: Usman Khawaja now, Chris Rogers then. Khawaja was there in 2013, too, as was Steve Smith in the middle order and Nathan Lyon as the spinner. Both times Mitchell Starc was left out, and his pace was missed as England ran up a score in the third innings. Both involved a hulking blond all-rounder making useful runs at six, from Shane Watson to Cameron Green. And both involved a Stuart Broad spell, one of his Ashes specials. Durham was the more dramatic: a streak of six for 20 across 45 balls after the door had been prised open with the removal of the top three. Edgbaston had Broad apply the crowbar: removing Smith and Marnus Labuschagne in the space of 12 balls on the fourth evening. That spell more than anything was reminiscent of a decade earlier: the tall figure of Broad wading in on his heron legs, so elongated that his own shadow was jealous, his whites glowing a shade of gold in the late‑day sunshine. Cheered into his delivery stride each time by a liquored terrace of uncontained humanity, singing the same song about him being better than his dad. Chris Broad is a decent match referee but probably wouldn’t give much argument. Stuart Broad celebrates his dismissal of Shane Watson at Durham in 2013. Photograph: Tom Jenkins/The Guardian It was testament to Pat Cummins and Nathan Lyon, then, that Broad didn’t have the decisive influence on the fifth day. For a time it was England’s other talisman, Ben Stokes. As the captain leading their stated intention to set every game ablaze, he was set up opposite the approach of Khawaja. You could typify the contrast as fire and ice, but really it was fire and water. Whatever England tried to brandish, Khawaja doused. He faced 518 balls in the match, where the other five Australian specialists managed 393. England’s entire team, both times, faced 866. There was something cussedly specific about the way Khawaja stretched forward to defend, time and again, occasionally diverting a single, even more rarely finding the boundary. skip past newsletter promotion Sign up to Guardian Australia Sport Free newsletter Get a daily roundup of the latest sports news, features and comment from our Australian sports desk Privacy Notice: Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion England relied on vibes and sprites when Cummins went a little Bazball | Jonathan Liew Read more So after a long wait, 70 overs into the innings, Stokes dragged his bad knee into action. In his second over, a cross-seamer took the inside edge on to the stumps. The immovable Khawaja was gone for 65. Stokes was away, with his incredible knack for shaping a game. Ignoring the new ball, keeping Joe Root on with spin that claimed Alex Carey’s wicket the very next over. Then Stokes so nearly recreating his famous World Cup catch, running backwards after Lyon’s hook. But that particular miracle couldn’t repeat, and the extraordinary last stanza of this match took on an unexpected meter. In terms of playing style, the result owes its existence to England’s. Had they batted conventionally in either innings, there would not have been enough time for Australia to have played their own way and won, given the sessions lost to rain. But there would also not have been time for England to come so close to a win themselves. One more nick, and Josh Hazlewood at No 11 was every chance of offering a second. And when the game came down to its last fateful overs, Australia’s captain put an attacking philosophy just as firmly on display. Needing 72 when Khawaja was out, and 54 when Carey followed, Cummins hit twin sixes off Root, then charged Broad and hammered four through cover point. Australia could have looked to bunker down with 15 overs to go, but it turns out that they don’t do draws either. Which, much as you might like to avoid cliche, does take you back to 2005. Specifically to Australia’s lower order pulling a distant chase into the realms of possibility. Back then it was Brett Lee 43 not out, nearly getting home. This time it was Pat Cummins with one more run, with the opposite result, and with one of the best captain’s innings in an Ashes match. One thing is certain: in a couple of decades from now, people will still be talking about this one too.","pubDate":"2023-06-20 20:03:28","image_url":"https://i.guim.co.uk/img/media/bc63ec66f2f67175538e420c53e3bf1366f27035/0_38_3500_2101/master/3500.jpg?width=460&quality=85&auto=format&fit=max&s=5118dbee299a1e27eb3ac254664c3ef6","source_id":"theguardian","category":["sports"],"country":["australia"],"language":"english"},{"title":"BCCI sets Rs 350 cr base price for lead sponsorship rights","link":"https://economictimes.indiatimes.com/news/sports/bcci-sets-rs-350-cr-base-price-for-lead-sponsorship-rights/articleshow/101144170.cms","keywords":null,"creator":null,"video_url":null,"description":"The BCCI released the tender for national team lead sponsor rights on June 14. The tender document will be available for purchase until June 26. The base price is less than the amount paid by the edtech company Byju's, which was the lead sponsor until March. Byju's was paying ₹5.07 crore per match for domestic matches featuring Team India and ₹1.56 crore per match for ICC and ACC tournaments.","content":"Synopsis The BCCI released the tender for national team lead sponsor rights on June 14. The tender document will be available for purchase until June 26. The base price is less than the amount paid by the edtech company Byju's, which was the lead sponsor until March. Byju's was paying ₹5.07 crore per match for domestic matches featuring Team India and ₹1.56 crore per match for ICC and ACC tournaments. BCCI sets Rs 350 cr base price for lead sponsorship rights The Board of Control for Cricket in India ( BCCI ) has set a base price of ₹350 crore for the national lead sponsor rights , sources privy to the development told ET. One of the sources said that the base price for the bilateral matches featuring India is ₹3 crore per match and ₹1 crore per match for International Cricket Council (ICC) and Asian Cricket Council ( ACC ) tournaments. The BCCI released the tender for national team lead sponsor rights on June 14. The tender document will be available for purchase until June 26. The base price is less than the amount paid by the edtech company Byju's, which was the lead sponsor until March. Byju's was paying ₹5.07 crore per match for domestic matches featuring Team India and ₹1.56 crore per match for ICC and ACC tournaments. The BCCI has barred betting, crypto-currency, tobacco, and real-money gaming companies from bidding for the lead sponsor rights. BCCI did not respond to ET's request for comment. A sports business expert said that the BCCI has made the right decision by setting a lower base price than what it was getting from Byju's. \"BCCI has set a realistic base price for the lead sponsor rights. The ad market is tough, and the new-age sponsors who were spending large sums of money on cricket have cut their marketing budgets drastically due to the funding winter,\" the expert said on the condition of anonymity. The expert noted that lead sponsor rights are a great asset that can be used by brands to build long-term value. \"Byju's became a well-known brand due to its association with Team India. The lead sponsor asset is a powerful one to build brands,\" the expert added. In 2019, Byju's replaced mobile handset maker Oppo to become the jersey sponsor of the Indian cricket team. Having bagged the jersey sponsorship rights in March 2017 for a whopping ₹1079.3 crore, Oppo exited the deal by transferring its sponsorship rights to Byju's. Earlier, GroupM South Asia head of sports, esports, and entertainment Vinit Karnik had said that an estimated ₹2,000-2,500 crore worth of on-ground sponsorship inventory across the Indian Premier League (IPL) and bilateral matches will become available this year. According to the GroupM India Sports Sponsorship Report 2023, the Indian sports industry's advertising revenue surged 49% to ₹14,209 crore in 2022 and is expected to reach ₹16,000 crore in 2023. The agency believes that the sports industry's ad revenue could potentially reach ₹20,000 crore by 2025. Don’t miss out on ET Prime stories! Get your daily dose of business updates on WhatsApp. click here! Tuesday, 20 Jun, 2023 Experience Your Economic Times Newspaper, The Digital Way! Read Complete Print Edition » Front Page Pure Politics Companies & Economy ET Markets More PM Modi’s US Visit may Boost Semicon Supply Chain Pact Prime Minister Narendra Modi's visit to the US this week is likely to give a boost to the Indo-US technology partnership, especially on the establishment of a new semiconductor supply chain where major announcements are expected. Adani Looks to Rope in More Lenders to Refinance $3.8 b The Adani Group is in discussions to rope in at least five new international banks as it looks to refinance $3.8 billion of loans of varying tenors taken for the acquisition of ACC Limited and Ambuja Cement last year, said people aware of the ongoing discussions. IndiGo Gives Airbus Record 500-Plane Order IndiGo has placed an order for 500 Airbus A320 family of aircraft, worth $50 billion at list price and the largest in the history of global aviation. Read More News on bcci acc byju s Advertising Marketing Inventory Revenue Brands Rights team india (Catch all the Business News , Breaking News Events and Latest News Updates on The Economic Times .) Download The Economic Times News App to get Daily Market Updates & Live Business News. ... more less ETPrime stories of the day Investing Motilal Oswal launches low-cost micro-cap index fund. Will risk-averse investors go for it? 9 mins read 3 insights to kick-start your day: featuring Glenmark’s cancer drug 3 mins read Strategy Stock Radar: 20% rally so far in 2023! This cement stock is likely to touch record highs soon 3 mins read Subscribe to ETPrime","pubDate":"2023-06-20 19:23:20","image_url":"https://img.etimg.com/thumb/width-1200,imgsize-44388,resizemode-4,msid-101144170/bcci-sets-rs-350-cr-base-price-for-lead-sponsorship-rights.jpg","source_id":"economictimes_indiatimes","category":["sports"],"country":["india"],"language":"english"},{"title":"'He's one' - Andros Townsend makes claim over Liverpool player's on-field antics","link":"https://www.liverpoolecho.co.uk/sport/football/football-news/hes-one-andros-townsend-makes-27163397","keywords":["Sport"],"creator":null,"video_url":null,"description":"Liverpool captain Jordan Henderson has been a vocal member of the Reds' squad since being appointed captain in 2015","content":"Outgoing Everton midfielder Andros Townsend has named Jordan Henderson as the player who has gone to the most effort to distract him during games. This tactic of uttering phrases in the hope of provoking a reaction from an opponent is widely utilised not only in football but also in other sports, particularly cricket. Frowned upon by some, it has become a part of the game regardless. Townsend, who will leave the Blues once his current deal expires at the end of this month, has faced off against Henderson 16 times during his playing career and has come out on top on only one occasion. They last both took to the pitch during 4-1 win at Goodison Park in December 2021, a fixture which saw Henderson named man of the match after his all-action display. Reds fans will best remember their current captain for his impressive work ethic when the time comes for him to leave the club, though Townsend will share an alternative, overriding memory of the former Sunderland midfielder. Asked to name who has been the worst individual for putting him off during matches, Townsend talk talkSPORT: \"Probably [Jordan] Henderson. He’s always talking, he’s always at you. He’s one.\" The pair, so often going head-to-head against each other, have been team-mates when in action together on the international stage. Townsend is no longer a regular member of the England squad, though earned 13 caps between 2013 and 2016. His next club remains to be seen as he prepares to become a free agent after two years spent at Everton.","pubDate":"2023-06-20 19:13:46","image_url":"https://i2-prod.liverpoolecho.co.uk/incoming/article27163526.ece/ALTERNATES/s98/0_Townsend.jpg","source_id":"liverpoolecho","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"ENG Vs AUS: कप्तान पैट कमिंस ने ऑस्ट्रेलियाई को दिलाई ऐतिहासिक जीत, सांसे थामने वाले टेस्ट में इंग्लैंड को दो विकेट से हराया","link":"https://www.abplive.com/sports/cricket/ashes-2023-eng-vs-aus-1st-test-match-report-australia-won-by-2-wickets-pat-cummins-scored-44-runs-while-chasing-2436141","keywords":["Cricket"],"creator":["मोहम्मद अलफैज"],"video_url":null,"description":"Ashes 2023 ENG Vs AUS 1st test Report: ऑस्ट्रेलिया और इंग्लैंड के बीच खेली जा रही एशेज़ 2023 के पहले टेस्ट में ऑस्ट्रेलिया ने 2 विकेट से जीत दर्ज कर ली है. रनों का पीछा करते हुए ऑस्ट्रेलियाई कप्तान पैट कमिंस ने नाबाद रहते हुए 44* रनों की पारी खेली और आखिरी गेंद पर चौका लगाकर टीम को जीत दिलाई. वहीं उस्मान ख्वाजा ने टीम के लिए सबसे बड़ी 65 रनों की पारी खेली. इंग्लैंड की ओर से ब्रॉड ने सबसे ज़्यादा 3 विकेट लिए. बारिश के चलते आखिरी दिन का खेल दूसरे सेशन से शुरू हुआ था.  बारिश के बाद ऑस्ट्रेलिया को आखिरी यानी पांचवें दिन 67 ओवर में 174 रनों का टारगेट दिया गया था. चौथा दिन खत्म होने तक ऑस्ट्रेलिया की टीम 3 विकेट गंवा चुकी थी. लिहाजा ऑस्ट्रेलिया को आखिरी दिन 7 विकेट रहते हुए 174 रन बनाने थे. कंगारू टीम ने 2 विकेट रहते हुए टारगेट हासिल कर एशेज़ 2023 का पहला टेस्ट अपने नाम किया.  कमिंस और नाथन लियोन ने की अर्धशतकीय साझेदारी  ऑस्ट्रेलियाई कप्तान पैट कमिंस और नाथन लियोन ने इस मैच में अपनी बैटिंग से ऑस्ट्रेलिया को जीत दिलाने में अहम किरदार अदा किया. नंबर नौं पर बल्लेबाज़ी करते हुए ऑस्ट्रेलियाई कप्तान पैट कमिंस ने 4 चौके और 2 छक्कों की मदद से 44* और नंबर 10 पर बल्लेबाज़ी करते हुए नाथन लियोन ने 2 चौके लगाकर 16* रन बनाए. दोनों ने 9वें विकेट के लिए 55* रनों की साझेदारी की. ऐसा रहा पूरा मैच  इंग्लैंड ने टॉस जीतकर पहले बल्लेबाज़ी करने का फैसला किया और 8 विकेट पर 393 रन बनाकर पारी घोषित कर दी. टीम की ओर से पूर्व कप्तान जो रूट ने 118 रनों की पारी खेली. इस दौरान ऑस्ट्रेलियाई गेंदबाज़ नाथन लियोन ने 4 और जोश हेज़लवुड ने 2 विकेट चटकाए. इसके अलावा स्कॉट बोलैंड और कैमरून ग्रीन ने 1-1 विकेट अपने नाम किया.  इसके बाद अपनी पहली पारी में बल्लेबाज़ी करने उतरी ऑस्ट्रेलिया की टीम ने 386 रन बनाए. टीम की ओर से उस्मान ख्वाजा ने 14 चौके और 3 छक्कों की मदद से 141 रन जड़े. इस दौरान इंग्लिश गेंदबाज़ स्टुअर्ट ब्राड और रॉबिन्सन ने 3-3 विकेट झटके. इसके अलावा स्पिनर मोईन अली ने 2 विकेट लिए. वहीं कप्तान बेन स्टोक्स और जेम्स एंडरसन ने 1-1 विकेट चटकाया.  अपनी दूसरी पारी के लिए मैदान पर उतरी इंग्लैंड की टीम 273 रनों पर ही सिमट गई. इस पारी में ऑस्ट्रेलियाई गेंदबाज़ नाथन लियोन और कप्तान पैट कमिंस ने 4-4 विकेट झटके. वहीं जोश हेज़लवुड और स्कॉट बोलैंड को 1-1 सफलता मिली. इसके बाद 281 रनों का पीछा करते हुए ऑस्ट्रेलिया ने 2 विकेट से जीत अपने नाम की.    ये भी पढे़ं... Virat Kohli: टेस्ट में 12 साल पूरे होने पर विराट कोहली ने शेयर की खास पोस्ट, लिखी दिल छू लेने वाली बात","content":"Ashes 2023 ENG Vs AUS 1st test Report: ऑस्ट्रेलिया और इंग्लैंड के बीच खेली जा रही एशेज़ 2023 के पहले टेस्ट में ऑस्ट्रेलिया ने 2 विकेट से जीत दर्ज कर ली है. रनों का पीछा करते हुए ऑस्ट्रेलियाई कप्तान पैट कमिंस ने नाबाद रहते हुए 44* रनों की पारी खेली और आखिरी गेंद पर चौका लगाकर टीम को जीत दिलाई. वहीं उस्मान ख्वाजा ने टीम के लिए सबसे बड़ी 65 रनों की पारी खेली. इंग्लैंड की ओर से ब्रॉड ने सबसे ज़्यादा 3 विकेट लिए. बारिश के चलते आखिरी दिन का खेल दूसरे सेशन से शुरू हुआ था. बारिश के बाद ऑस्ट्रेलिया को आखिरी यानी पांचवें दिन 67 ओवर में 174 रनों का टारगेट दिया गया था. चौथा दिन खत्म होने तक ऑस्ट्रेलिया की टीम 3 विकेट गंवा चुकी थी. लिहाजा ऑस्ट्रेलिया को आखिरी दिन 7 विकेट रहते हुए 174 रन बनाने थे. कंगारू टीम ने 2 विकेट रहते हुए टारगेट हासिल कर एशेज़ 2023 का पहला टेस्ट अपने नाम किया. कमिंस और नाथन लियोन ने की अर्धशतकीय साझेदारी ऑस्ट्रेलियाई कप्तान पैट कमिंस और नाथन लियोन ने इस मैच में अपनी बैटिंग से ऑस्ट्रेलिया को जीत दिलाने में अहम किरदार अदा किया. नंबर नौं पर बल्लेबाज़ी करते हुए ऑस्ट्रेलियाई कप्तान पैट कमिंस ने 4 चौके और 2 छक्कों की मदद से 44* और नंबर 10 पर बल्लेबाज़ी करते हुए नाथन लियोन ने 2 चौके लगाकर 16* रन बनाए. दोनों ने 9वें विकेट के लिए 55* रनों की साझेदारी की. googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); ऐसा रहा पूरा मैच इंग्लैंड ने टॉस जीतकर पहले बल्लेबाज़ी करने का फैसला किया और 8 विकेट पर 393 रन बनाकर पारी घोषित कर दी. टीम की ओर से पूर्व कप्तान जो रूट ने 118 रनों की पारी खेली. इस दौरान ऑस्ट्रेलियाई गेंदबाज़ नाथन लियोन ने 4 और जोश हेज़लवुड ने 2 विकेट चटकाए. इसके अलावा स्कॉट बोलैंड और कैमरून ग्रीन ने 1-1 विकेट अपने नाम किया. इसके बाद अपनी पहली पारी में बल्लेबाज़ी करने उतरी ऑस्ट्रेलिया की टीम ने 386 रन बनाए. टीम की ओर से उस्मान ख्वाजा ने 14 चौके और 3 छक्कों की मदद से 141 रन जड़े. इस दौरान इंग्लिश गेंदबाज़ स्टुअर्ट ब्राड और रॉबिन्सन ने 3-3 विकेट झटके. इसके अलावा स्पिनर मोईन अली ने 2 विकेट लिए. वहीं कप्तान बेन स्टोक्स और जेम्स एंडरसन ने 1-1 विकेट चटकाया. अपनी दूसरी पारी के लिए मैदान पर उतरी इंग्लैंड की टीम 273 रनों पर ही सिमट गई. इस पारी में ऑस्ट्रेलियाई गेंदबाज़ नाथन लियोन और कप्तान पैट कमिंस ने 4-4 विकेट झटके. वहीं जोश हेज़लवुड और स्कॉट बोलैंड को 1-1 सफलता मिली. इसके बाद 281 रनों का पीछा करते हुए ऑस्ट्रेलिया ने 2 विकेट से जीत अपने नाम की. ये भी पढे़ं... Virat Kohli: टेस्ट में 12 साल पूरे होने पर विराट कोहली ने शेयर की खास पोस्ट, लिखी दिल छू लेने वाली बात","pubDate":"2023-06-20 18:47:24","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/06/21/c281e5019c0014ed468b032c6277eeb71687286280512582_original.jpg","source_id":"abplive","category":["sports"],"country":["india"],"language":"hindi"},{"title":"The Ashes: ऑस्ट्रेलिया ने नहीं दोहराई 2005 वाली गलती, एशेज के पहले टेस्ट में इंग्लैंड पर हासिल की रोमांचक जीत","link":"https://navbharattimes.indiatimes.com/sports/cricket/cricket-news/the-ashes-australia-defeats-england-by-2-wickets-in-first-test/articleshow/101143051.cms","keywords":null,"creator":null,"video_url":null,"description":"The Ashes: ऑस्ट्रेलिया ने इंग्लैंड के खिलाफ एशेज सीरीज का पहला टेस्ट जीत लिया है। एजबेस्टन में खेले गए मुकाबले को पैट कमिंस की टीम ने 2 विकेट से अपने नाम किया। 2005 में इसी मैदान पर ऑस्ट्रेलियाई टीम सिर्फ 2 रनों से एशेज सीरीज का पहला हार गई थी।","content":"ऑस्ट्रेलिया ने इंग्लैंड (ENG vs AUS) को हराकर एशेज सीरीज (The Ashes) का पहला टेस्ट अपने नाम कर लिया है। इंग्लिश टीम को वर्ल्ड चैंपियन के खिलाफ 2 विकेट से हार मिली। बर्मिंघम के एजबेस्टन मैदान पर ऑस्ट्रेलिया के सामने चौथी पारी में जीत के लिए 281 रनों का लक्ष्य था। ऑस्ट्रेलिया ने 8 विकेट खोकर लक्ष्य हासिल कर लिया। 227 के स्कोर पर ही टीम के 8 विकेट गिर गए थे। इसके बाद कप्तान पैट कमिंस और नाथन लायन ने टीम को लक्ष्य तक पहुंचा दिया। 2005 में इसी मैदान पर ऑस्ट्रेलिया के सामने चौथी पारी में 282 का लक्ष्य था। टीम वह मुकाबला 2 रन से हार गई थी। ऑस्ट्रेलिया के लिए पैट कमिंस और नाथन लायन ने 55 रनों की नाबाद साझेदारी बनाई। कप्तान कमिंस के बल्ले से 73 गेंदों पर 4 चौके और 2 छक्कों की मदद से 44 रन निकले। लायन ने 16 रनों का योगदान दिया। 227 रनों पर 8 विकेट गिरने के बाद ऑस्ट्रेलिया की हार पक्की दिख रही थी। लेकिन इन दोनों गेंदबाजों ने टीम को जीत तक पहुंचा दिया। मैच के आखिरी दिन ऑस्ट्रेलिया को जीत के लिए 174 रन और इंग्लैंड को 7 विकेट की जरूरत थी। सुबह का सत्र बारिश की भेंट चढ़ गया जिसके कारण लंच ब्रेक जल्दी लिया गया। मैच शुरू होने पर अंपायरों ने टीमों को 67 ओवर दिए। ऑस्ट्रेलिया ने दिन की शुरुआत तीन विकेट पर 107 रन से की। ख्वाजा और रात्रि प्रहरी स्कॉट बोलैंड ने पारी को आगे बढ़ाया। स्टुअर्ट ब्रॉड ने दिन के आठवें ओवर में बोलैंड को विकेटकीपर जॉनी बेयरस्टो के हाथों कैच कराके इस साझेदारी को तोड़ा। बोलैंड ने करियर की सर्वश्रेष्ठ 20 रन की पारी खेली। अच्छी फॉर्म में चल रहे ट्रेविस हेड भी अधिक देर नहीं टिक सके और 16 रन बनाकर ऑफ स्पिनर मोईन अली की गेंद पर स्लिप में जो रूट के कैच दे बैठे जिससे ऑस्ट्रेलिया का स्कोर पांच विकेट पर 143 रन हो गया। चाय ब्रेक के बाद ऑस्ट्रेलिया को तीन बड़े झटके लगे। कैमरून ग्रीन 28 रन बनाकर रॉबिंसन की गेंद पर बोल्ड हो गए। बेन स्टोक्स ने उस्मान ख्वाजा को आउट कर ऑस्ट्रेलिया का सबसे बड़ा विकेट झटका। पहली पारी में शतक बनाने वाले ख्वाजा ने दूसरी पारी में 65 रनों का योगदान दिया। एलेक्स कैरी (20) को जो रूट ने आउट किया। इंग्लैंड ने मैच की पहली पारी में 8 विकेट पर 393 रन बनाए थे। टीम के लिए जो रूट शतक बनाकर खेल रहे थे। इसके बाद भी कप्तान बेन स्टोक्स ने पहले ही दिन पारी घोषित कर दी। टीम के पास और बड़ा स्कोर बनाने का मौका था। ऑस्ट्रेलिया ने अपनी पहली पारी में 386 रन बनाए थे। इंग्लैंड की दूसरी पारी 273 रनों पर समेटने के बाद ऑस्ट्रेलिया को 281 रनों का लक्ष्य मिला था।","pubDate":"2023-06-20 18:45:26","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Ashes: Australia beat England by two wickets to win thrilling first Test","link":"https://www.standard.co.uk/sport/cricket/ashes-2023-first-test-result-england-vs-australia-b1089109.html","keywords":["Cricket","Sport"],"creator":["Malik Ouzia"],"video_url":null,"description":"For the most-hyped Ashes series in a generation, and an opener that from first ball had lived up to billing, here was a fitting finale, one sainted to rank alongside Edgbaston 2005 and Headingley 2019 as the century’s most dramatic.","content":"or the most-hyped Ashes series in a generation, and an opener that from first ball had lived up to billing, here was a fitting finale, one sainted to rank alongside Edgbaston 2005 and Headingley 2019 as the century’s most dramatic. These players were raised on the former series but many lived the second through its core, few more painfully than Nathan Lyon, who fumbled with the match at his mercy, and Pat Cummins, whose final ball was cut away, cut away for four. This then, was redemption, Australia’s two best bowlers in the middle refusing to lay down the bat as Ben Stokes, Headingley’s hero, at last ran out of ideas. Four years on from that agonising defeat, at 7:21pm on a warm Birmingham evening, they stood triumphant and unbeaten, a chase of 281 complete with just two tail-end wickets in hand. Of those, 54 were still required when Lyon and Cummins combined and Australia, you felt certain, would pay for their careful pursuit. Usman Khawaja, scorer of 201 runs in the match, was destined to be a bizarre scapegoat, having clearly resolved to be there at the end and, it seemed, left too much to do in the eventuality that he was not. As it turned out, though, this was a culture clash only until the second-last, caution thrown to the wind as Cummins hit two sixes in an over off Joe Root to turn the tide. SPONSORED Stokes, as ever did his best to hold it back, having dragged a rare spell from his ailing legs to end Khawaja’s second vigil of the match, then come agonisingly close to what would have been the catch of his career, a field in which the bar is set ludicrously high. If there is regret for the England skipper - and he will insist his team have no time for those - it must be in the runs left on the table by the first evening’s early declare. This is an Australian victory that ought to be far from a knockout blow, the tourists heading to Lord’s 1-0 up but the two teams, on five gripping days’ evidence, thrillingly well-matched. England though, to regain the Ashes, must do what no one side as since Michael Vaughan’s heroes and come from behind to claim the Urn. For Cummins, who hit the winning runs to finish unbeaten on 44, there was a sense of personal vindication, the Australian captain, in fashion so un-Australian, having consented to spend so much of these five days on the back foot. The acceptance was that on home turf and so buoyed by revolution, England were always bound to make the running. The morning of a day five so epically poised brought forecast storms and a 2:15pm start that, if anything, merely served to ensure the hues were just right for a knife-edge climax so late in the day. The first hour brought only 12 runs off the bat, the sole moment of excitement coming, predictably, from Stuart Broad, who bluffed nightwatchman Scott Boland with a short-ball field and rattled his stumps, the supposed bunny taking with him 20 important runs. Excitement and tension are two different things, though, and on days like these, even with 160 of them still required, few were in doubt as to the value of each run. They were hard to come by, Stokes’s field placement canny and Australia’s few shots of intent denied leave from the ring. Root stood on the fence, conducting the crowd like an Olympic long-jumper at the top of the runway, arms flapping and hands clapping as Broad thundered in through a seven-over spell. If pressure was to be means to a wicket then Moeen Ali’s introduction seemed to have bungled the plan, the spinner’s first three deliveries all pounced on by Travis Head to the tune of ten quick runs. Leakage, though, is factored into the Moeen bargain and two deliveries later Australia’s most aggressive batter was no more. England’s growing desperation, though, told you Australia had edged in front. Broad tried in vain to get a frigid ball changed, holding it up to the light for the umpire’s inspection as if it were a dodgy tenner. Root urged the Hollies for more as they rumbled his name, a rare act of narcissism from a selfless player, and certainly a bold one for a man about to twirl part-time spin. In fairness, Root rose to the sound with a valiant spell, including, later, the in-form Alex Carey’s wicket caught and bowled. Ollie Robinson, who has grown into this match like a teenager into new school shoes, again cracked the game open after tea, Green out chopping on with 89 still to get. Then came the break glass moment, spotted by the eagle-eyed before it happened: English hopes drifting, Aussie belief building and at mid-off Stokes, at last, getting loose. How many deliveries are left in those legs - in that knee - only he can guess, but here was a moment in which it had to be worth using up a few of them: If not now, then when? In the end, even the glazy-eyed got forewarning, for rarely can the sight of a man handing a cap to an umpire have been met with such a noise. The first over was nothing special, a trundling effort off a half-paced run, but the second changed all complexion: Khawaja gone, game on. It seemed ripe, as so many before it, for Stokes’s seizing but for once, in the face of Lyon and Cummins’ resilience, he was found clutching at air.","pubDate":"2023-06-20 18:43:00","image_url":"https://static.standard.co.uk/2023/06/20/19/newFile-1.jpg?width=1200&auto=webp","source_id":"standarduk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"1st Ashes Test: Khawaja, Cummins Star In Australia's Narrow Win vs England","link":"https://sports.ndtv.com/cricket/england-vs-australia-1st-ashes-test-usman-khawaja-pat-cummins-star-as-australia-edge-past-england-by-2-wickets-4138551","keywords":null,"creator":null,"video_url":null,"description":"Australia beat England by two wickets to win a thrilling first Ashes Test at Edgbaston on Tuesday.","content":"Australia beat England by two wickets to win a thrilling first Ashes Test at Edgbaston on Tuesday. Australia were struggling at 227-8, still 54 runs shy of a victory target of 281, when skipper Pat Cummins was joined in the middle by tailender Nathan Lyon. But the pair's unbroken stand of 55 saw Ashes holders Australia home, with Cummins hitting the winning boundary to finish on 44 not out after opener Usman Khawaja had made a painstaking 65 to follow his first-innings 141. Lyon was unbeaten on 16, with Australia now 1-0 up in this five-match series as they bid for a first Ashes campaign triumph on English soil in 22 years. (This story has not been edited by NDTV staff and is auto-generated from a syndicated feed.)","pubDate":"2023-06-20 18:42:34","image_url":null,"source_id":"ndtv","category":["sports"],"country":["india"],"language":"english"},{"title":"Ashes 2023 : थरारक सामन्यात कमिन्सने विजयी चौकार लगावला, पहिल्या कसोटी सामन्यात ऑस्ट्रेलियाचा इंग्लंडवर विजय","link":"https://marathi.abplive.com/sports/cricket/ashes-2023-edgbaston-test-australia-won-by-2-wickets-1185919","keywords":["क्रिकेट"],"creator":["एबीपी माझा ब्युरो"],"video_url":null,"description":"Ashes 2023, Edgbaston Test : कर्णधार पॅट कमिन्स याच्या झंझावती फलंदाजीच्या जोरावर ऑस्ट्रेलियाने पहिल्या कसोटीत थरारक विजय मिळवला. यासह कांगारुंनी अॅशेस मालिकेत विजयाने सुरुवात केली आहे. इंग्लंडने दिलेल्या 281 धावांच्या आव्हानाचा पाठलाग ऑस्ट्रेलियाने दोन विकेट राखून केला.  ऑस्ट्रेलियाकडून पॅट कमिन्स याने नाबाद 44 तर उस्मान ख्वाजा याने 65 धावांचे योगदान दिले.  ऑस्ट्रेलियाकडून उस्मान ख्वाजा याने दोन्ही डावात दमदार फलंदाजी केली. पहिल्या डावात उस्मान ख्वाजा याने 141 धावांची खेळी केली तर दुसऱ्या डावात निर्णायाक 65 धावांचे योगदान दिले. उस्मान ख्वाजाशिवाय दुसऱ्या डावात डेविड वॉर्नर याने 36 धावांची खेळी केली. मार्नस लाबुशेन 13, स्टिवन स्मिथ 06, स्कॉट बोलँड 20, ट्रेविस हेड 16,  कॅमरुन ग्रीन 28, अॅलेक्स कॅरी 20 धावांची खेळी केली.  281 धावांचा पाठलाग करताना ऑस्ट्रेलियाने दमदार सुरुवात केली. डेविड वॉर्नर आणि उस्मान ख्वाजा यांनी पहिल्या विकेटसाठी 61 धावांची भागिदारी केली. डेविड वॉर्नर याला ओली रॉबिसन याने तंबूत पाठवले. त्यानंतर ऑस्ट्रेलियाचा डाव ढेपाळला. एकापाठोपाठ एक फलंदाज तंबूत परतले. दुसऱ्या बाजूला उस्मान ख्वाजा याने एकेरी दुहेरी धावसंख्येवर भर दिला. एका बाजूला विकेट पडत असताना उस्मान ख्वाजा याने दुसरी बाजू लावून धरली.  उस्मान ख्वाजा येने बोलँड याच्यासोबत 32, हेडसोबत 22 आणि ग्रीनसोबत 49 धावांची भागिदारी करत धावसंख्येला आकार दिला. इंग्लंडचा कर्णधार बेन स्टोक्स याने ख्वाजा याला त्रिफाळाचित करत इंग्लंडच्या आशा उंचावल्या. उस्मान ख्वाजा बाद झाल्यानंतर इंग्लंडच्या आशा पल्लवीत झाल्या होत्या. पण कर्णधार पॅट कमिन्स याने नॅथन लायन याला हाताशी धरत ऑस्ट्रेलियाच्या धावसंख्येला आकार दिला. पॅट कमिन्स याने लायन याच्यासोबत नवव्या विकेटसाठी नाबाद 55 धावांची भागिदारी केली. पॅट कमिन्स याने नाबाद 44 तर नॅथन लायन याने नाबाद 16 धावांची खेळी केली.  Test cricket at its best 🤩Australia seal a mouth-watering win in Birmingham in the first #Ashes Test ✌️#WTC25 | 📝: https://t.co/ZNnKIn9jeq pic.twitter.com/K0lKH79ml4 — ICC (@ICC) June 20, 2023 पहिल्या कसोटीत काय झाले ? अॅशेस कसोटी मालिकेच्या पहिल्या सामन्यात इंग्लंडने नाणेफेक जिंकून प्रथम फलंदाजी करण्याचा निर्णय घेतला. यजमान इंग्लंडने पहिल्या डावात आठ विकेटच्या मोबदल्यात 393 धावांपर्यंत मजल मारली. इंग्लंडकडून जो रुट याने शतकी खेळी केली.  जो रुट याने 118 धावांचे योगदान दिले. त्याशिवाय जॉनी बेअस्टो याने 78 धावांचे योगदान दिले. ऑस्ट्रेलियाकडून नॅथन लायन याने सर्वाधिक 4 विकेट घेतल्या. इंग्लंडने दिलेल्या 393 धावांच्या आव्हानाचा पाठलाग ऑस्ट्रेलियाने प्रभावीपणे केला. कागांरुंनी पहिल्या डावात 386 धावांपर्यंत मजल मारली. उस्मान ख्वाजा याने ऑस्ट्रेलियाकडून शतकी खेळी केली. ख्वाजा याने 141 धावांचे योगदान दिले. त्याशिवाय ट्रेविस हेड आणि अॅलेक्स कॅरी यांनीही अर्धशतके झळकावली. हेड याने 50 तर अॅलेक्स कॅरी याने 66 धावांचे योगदान दिले. पहिल्या डावात ऑस्ट्रेलियाचा संघ अवघ्या 7 धावांनी पिछाडीवर होता. इंग्लंडचा संघ दुसऱ्या डावात 273 धावांत संपला.  एकाही फलंदाजाला अर्धशतकी खेळी करता आली नाही. इंग्लंडकडून जो रूट आणि हॅरी ब्रूक यांनी प्रत्येकी 46-46 धावांचे योगदान दिले. त्याशिवाय कर्णधार बेन स्टोक्स याने 43 धावांची खेळी केली. ऑस्ट्रेलियाचा कर्णधार पॅट कमिन्स आणि नॅथन लायन यांनी प्रत्येकी 4-4 विकेट घेतल्या आहेत. जोश हेजलवूड आणि स्कॉट बोलँड यांनी प्रत्येकी एक एक विकेट घेतली.","content":"Ashes 2023, Edgbaston Test : कर्णधार पॅट कमिन्स याच्या झंझावती फलंदाजीच्या जोरावर ऑस्ट्रेलियाने पहिल्या कसोटीत थरारक विजय मिळवला. यासह कांगारुंनी अॅशेस मालिकेत विजयाने सुरुवात केली आहे. इंग्लंडने दिलेल्या 281 धावांच्या आव्हानाचा पाठलाग ऑस्ट्रेलियाने दोन विकेट राखून केला. ऑस्ट्रेलियाकडून पॅट कमिन्स याने नाबाद 44 तर उस्मान ख्वाजा याने 65 धावांचे योगदान दिले. ऑस्ट्रेलियाकडून उस्मान ख्वाजा याने दोन्ही डावात दमदार फलंदाजी केली. पहिल्या डावात उस्मान ख्वाजा याने 141 धावांची खेळी केली तर दुसऱ्या डावात निर्णायाक 65 धावांचे योगदान दिले. उस्मान ख्वाजाशिवाय दुसऱ्या डावात डेविड वॉर्नर याने 36 धावांची खेळी केली. मार्नस लाबुशेन 13, स्टिवन स्मिथ 06, स्कॉट बोलँड 20, ट्रेविस हेड 16, कॅमरुन ग्रीन 28, अॅलेक्स कॅरी 20 धावांची खेळी केली. 281 धावांचा पाठलाग करताना ऑस्ट्रेलियाने दमदार सुरुवात केली. डेविड वॉर्नर आणि उस्मान ख्वाजा यांनी पहिल्या विकेटसाठी 61 धावांची भागिदारी केली. डेविड वॉर्नर याला ओली रॉबिसन याने तंबूत पाठवले. त्यानंतर ऑस्ट्रेलियाचा डाव ढेपाळला. एकापाठोपाठ एक फलंदाज तंबूत परतले. दुसऱ्या बाजूला उस्मान ख्वाजा याने एकेरी दुहेरी धावसंख्येवर भर दिला. एका बाजूला विकेट पडत असताना उस्मान ख्वाजा याने दुसरी बाजू लावून धरली. उस्मान ख्वाजा येने बोलँड याच्यासोबत 32, हेडसोबत 22 आणि ग्रीनसोबत 49 धावांची भागिदारी करत धावसंख्येला आकार दिला. इंग्लंडचा कर्णधार बेन स्टोक्स याने ख्वाजा याला त्रिफाळाचित करत इंग्लंडच्या आशा उंचावल्या. उस्मान ख्वाजा बाद झाल्यानंतर इंग्लंडच्या आशा पल्लवीत झाल्या होत्या. पण कर्णधार पॅट कमिन्स याने नॅथन लायन याला हाताशी धरत ऑस्ट्रेलियाच्या धावसंख्येला आकार दिला. पॅट कमिन्स याने लायन याच्यासोबत नवव्या विकेटसाठी नाबाद 55 धावांची भागिदारी केली. पॅट कमिन्स याने नाबाद 44 तर नॅथन लायन याने नाबाद 16 धावांची खेळी केली. Test cricket at its best 🤩 Australia seal a mouth-watering win in Birmingham in the first #Ashes Test ✌️ #WTC25 | 📝: https://t.co/ZNnKIn9jeq pic.twitter.com/K0lKH79ml4 googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); — ICC (@ICC) June 20, 2023 पहिल्या कसोटीत काय झाले ? अॅशेस कसोटी मालिकेच्या पहिल्या सामन्यात इंग्लंडने नाणेफेक जिंकून प्रथम फलंदाजी करण्याचा निर्णय घेतला. यजमान इंग्लंडने पहिल्या डावात आठ विकेटच्या मोबदल्यात 393 धावांपर्यंत मजल मारली. इंग्लंडकडून जो रुट याने शतकी खेळी केली. जो रुट याने 118 धावांचे योगदान दिले. त्याशिवाय जॉनी बेअस्टो याने 78 धावांचे योगदान दिले. ऑस्ट्रेलियाकडून नॅथन लायन याने सर्वाधिक 4 विकेट घेतल्या. इंग्लंडने दिलेल्या 393 धावांच्या आव्हानाचा पाठलाग ऑस्ट्रेलियाने प्रभावीपणे केला. कागांरुंनी पहिल्या डावात 386 धावांपर्यंत मजल मारली. उस्मान ख्वाजा याने ऑस्ट्रेलियाकडून शतकी खेळी केली. ख्वाजा याने 141 धावांचे योगदान दिले. त्याशिवाय ट्रेविस हेड आणि अॅलेक्स कॅरी यांनीही अर्धशतके झळकावली. हेड याने 50 तर अॅलेक्स कॅरी याने 66 धावांचे योगदान दिले. पहिल्या डावात ऑस्ट्रेलियाचा संघ अवघ्या 7 धावांनी पिछाडीवर होता. इंग्लंडचा संघ दुसऱ्या डावात 273 धावांत संपला. एकाही फलंदाजाला अर्धशतकी खेळी करता आली नाही. इंग्लंडकडून जो रूट आणि हॅरी ब्रूक यांनी प्रत्येकी 46-46 धावांचे योगदान दिले. त्याशिवाय कर्णधार बेन स्टोक्स याने 43 धावांची खेळी केली. ऑस्ट्रेलियाचा कर्णधार पॅट कमिन्स आणि नॅथन लायन यांनी प्रत्येकी 4-4 विकेट घेतल्या आहेत. जोश हेजलवूड आणि स्कॉट बोलँड यांनी प्रत्येकी एक एक विकेट घेतली.","pubDate":"2023-06-20 18:30:50","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/06/21/aec8589e1b584f166f5d1c21f93878411687285836847265_original.jpg","source_id":"abplive","category":["sports"],"country":["india"],"language":"Marathi"},{"title":"Ashes Series 2023: দাঁতে দাঁত চেপে কামিন্সের দুরন্ত লড়াই, ২ উইকেটে প্রথম অ্যাশেজ টেস্ট জিতল অস্ট্রেলিয়া","link":"https://bengali.abplive.com/sports/cricket/australian-captain-pat-cummins-guide-australia-to-a-2-wicket-victory-in-first-ashes-test-986994","keywords":["ক্রিকেট"],"creator":["ABP Ananda"],"video_url":null,"description":"বার্মিংহাম: অ্যাশেজ মানেই ক্রিকেটের সবথেকে পুরনো প্রতিদ্বন্দ্বিতা। দুই চিরপ্রতিদ্বন্দ্বী অস্ট্রেলিয়া ও ইংল্যান্ডের হাড্ডাহাড্ডি লড়াই। বার্মিংহামের এজবাস্টনে সেই হাড্ডাহাড্ডি লড়াইয়েরই সাক্ষী হয়ে থাকল ক্রিকেটবিশ্ব। এক রুদ্ধশ্বাস ম্যাচে পরিপক্কতার পরিচয় দিয়ে দলকে দুই উইকেট জেতালেন প্যাট কামিন্স। প্রবল চাপের মাথা ঠান্ডা রেখে তাঁর অপরাজিত ৪৪ রানের ইনিংসই অজিদের দুই উইকেটে জয় এনে দিল। নবম উইকেটে প্যাট কামিন্স ও নাথান লায়ন অস্ট্রেলিয়ার হয়ে ৫৫ রান যোগ করেন। এবিপি আনন্দ এখন টেলিগ্রামেও, ক্লিক করুন এই লিঙ্কেhttps://t.me/abpanandaofficial আরও পড়ুন: লেখার দক্ষতা বাড়াতে কোন কোন দিকে খেয়াল রাখতে হবে?","content":"বার্মিংহাম: অ্যাশেজ মানেই ক্রিকেটের সবথেকে পুরনো প্রতিদ্বন্দ্বিতা। দুই চিরপ্রতিদ্বন্দ্বী অস্ট্রেলিয়া ও ইংল্যান্ডের হাড্ডাহাড্ডি লড়াই। বার্মিংহামের এজবাস্টনে সেই হাড্ডাহাড্ডি লড়াইয়েরই সাক্ষী হয়ে থাকল ক্রিকেটবিশ্ব। এক রুদ্ধশ্বাস ম্যাচে পরিপক্কতার পরিচয় দিয়ে দলকে দুই উইকেট জেতালেন প্যাট কামিন্স। প্রবল চাপের মাথা ঠান্ডা রেখে তাঁর অপরাজিত ৪৪ রানের ইনিংসই অজিদের দুই উইকেটে জয় এনে দিল। নবম উইকেটে প্যাট কামিন্স ও নাথান লায়ন অস্ট্রেলিয়ার হয়ে ৫৫ রান যোগ করেন। এবিপি আনন্দ এখন টেলিগ্রামেও, ক্লিক করুন এই লিঙ্কে https://t.me/abpanandaofficial আরও পড়ুন: লেখার দক্ষতা বাড়াতে কোন কোন দিকে খেয়াল রাখতে হবে? var _fireSc=!0;document.addEventListener(\"scroll\",(e=>{if(_fireSc){var c=document.createElement(\"script\");c.src=\"//asset.fwpub1.com/js/storyblock.js\",c.async=!0,document.getElementsByTagName(\"head\")[0].appendChild(c),_fireSc=!1}}));","pubDate":"2023-06-20 18:29:11","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/06/20/81b0283dff1c0b903e99ad2faf99f65b1687285680179507_original.jpg","source_id":"abplive","category":["sports"],"country":["india"],"language":"Bengali"},{"title":"Australia hold off late England charge to win first Ashes Test in thrilling finale","link":"https://www.theguardian.com/sport/2023/jun/20/england-australia-ashes-first-test-day-five-match-report-cricket","keywords":["Ashes 2023","The Ashes","England cricket team","Australia cricket team","Australia sport","Cricket","Sport"],"creator":["Ali Martin at Edgbaston"],"video_url":null,"description":"First Test: England 393-8 & 273; Australia 386 & 282-8Pat Cummins and Nathan Lyon dig in for two-wicket winAt the end of a final day packed with pressure and palpitations it was Australia who emerged victorious. The old fable of the tortoise and the hare just about held firm as they chased down 281 to beat England by two wickets and secure a 1-0 lead in this red-hot Ashes series. Those numbers tell little of the drama.This was a famous victory for Pat Cummins and his world champions, the captain the hero when at 7.21pm and with four overs left – ice in his veins and a gutsy sidekick in Nathan Lyon – a guide to third man off Ollie Robinson was fumbled over the rope by Harry Brook. Reaching 282 for eight from 92.3 overs, it completed an epic chase that left nerves utterly shredded. Continue reading...","content":"At the end of a final day packed with pressure and palpitations it was Australia who emerged victorious. The old fable of the tortoise and the hare just about held firm as they chased down 281 to beat England by two wickets and secure a 1-0 lead in this red-hot Ashes series. Those numbers tell little of the drama. This was a famous victory for Pat Cummins and his world champions, the captain the hero when at 7.21pm and with four overs left – ice in his veins and a gutsy sidekick in Nathan Lyon – a guide to third man off Ollie Robinson was fumbled over the rope by Harry Brook. Reaching 282 for eight from 92.3 overs, it completed an epic chase that left nerves utterly shredded. Bold or brainless? Debate Ben Stokes’s tactics but don’t expect him to change | Andy Bull Read more Cummins and Lyon had come together an hour earlier with England in the ascendancy and Ben Stokes, a constant source of energy for his side, eyeing up his 12th win as captain. Joe Root had somehow clung on to a bullet return catch off Alex Carey’s bat that left Australia 227 for eight, 54 runs short of their goal. Edgbaston was in full voice at this stage, the Hollies Stand goading the tourists and their pockets of supporters with the kind of triumphalism that was positively ripe to turn red-faced. Not that the conclusion was sour. Far from it. This fifth sellout crowd left with memories galore and a final twist to digest as over the course of 11 gripping overs under lights Cummins and Lyon repelled the second new ball and worked the gaps like a couple of pros. They sealed their country’s highest successful run chase since Cummins struck the winning blow of 310-run target in Johannesburg on his debut 12 years ago. Fifty caps later, the blue-eyed Blue Mountains boy has done it again. The coup de grace this time was unreflective of a fielding display from England that was tigerish throughout; a contributing factor to the pressure cooker the ground had become. Once the valve was released with Brook’s fumble, Cummins enveloped Lyon in an almighty bear hug, the pair 44 and 16 not out respectively and the toast of an away dressing room that was bouncing. The two teams soon shared smiles and handshakes, all combatants seeing the bigger picture of this classic Test finish. Among them was Usman Khawaja, no doubt keen to raise a glass of ice-cold diet Coke to his lips once more. The opener was named player of the match, having followed his first innings 141 with a similarly adhesive 65 that kept Australia in the hunt. The 36-year-old, riding what has become a remarkable late crest in his career, batted on all five days, faced 518 balls and spent 796 minutes out in the middle. All in a thick cable-knit tank top. Usman Khawaja looks back after being dismissed by Ben Stokes. Photograph: Mike Egerton/PA On another day Khawaja’s demise might have been the moment that commanded the headlines. At 5.29pm, short of options before the second new ball’s arrival, Stokes brought himself on to bowl for the first time in the innings. Charging to the crease in defiance of that left knee injury, he sent down a smart slower ball that cannoned into the stumps off the inside edge. With Australia 209 for seven it appeared another case of Stokes bending the script to his will. skip past newsletter promotion Sign up to The Spin Free weekly newsletter Subscribe to our cricket newsletter for our writers' thoughts on the biggest stories and a review of the week’s action Privacy Notice: Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion England relied on vibes and sprites when Cummins went a little Bazball | Jonathan Liew Read more But that wickets column was deceptive all day, Australia’s deployment of a nightwatchman the previous evening – Scott Boland – creating the illusion. At 2.15pm, after morning rain, Boland had walked out alongside Khawaja, with the score 107 for three and needing 174 runs in 67 overs. It soon became clear Australia would be putting their supporters back home into a state of sleep-deprived delirium. In the first hour 21 runs were chiselled off the target – a mere 13 from the bat – and Stuart Broad removing Boland for his third wicket of the innings. When Moeen Ali was thrown the ball in the 15th over of this opening session, removing the typically aggressive Travis Head for 16 with a ball that gripped and found the left-hander’s edge, Australia’s 143 for five did not quite reflect the depth to come. It was a fine delivery in an otherwise forlorn showing from Moeen, that burst blister on his spinning finger leaving him a passenger in the main. Had the skin on that digit been hard and durable from regular first‑class cricket, not red and raw after a 33-over first innings straight out of Test retirement, Stokes would have been able to turn to a spinner with the best fourth‑innings strike-rate of any to claim more than 50 wickets. This England team do not appear to do regrets, so to claim they will rue the SOS to Moeen would be false. Similarly, come the second Test at Lord’s next Wednesday they will not be turning back on the decision to restore Jonny Bairstow behind the stumps, even if three missed chances in Australia’s first innings – and an edge off Khawaja that flew between keeper and first slip late on day four – proved costly. That day one declaration? All part of the entertainment, said an unrepentant Stokes. Pat Cummins celebrates with Nathan Lyon after their match-winning 55-run partnership. Photograph: Stu Forster/Getty Images This final day certainly had it in spades, be it Robinson’s dramatic removal of Cameron Green for 28, bowled off the inside edge, the tension that built as Australia declined to take on Root’s bowling or the spectacular one‑handed effort from Stokes in the deep off Lyon that popped out of his grasp. With 36 runs to get at that stage, and Josh Hazlewood next man in at No 11, it would have been telling. As it was, England met an Australian team prepared to meet fire with ice and a captain embodying this in Cummins. The tourists scored at 3.2 runs per over to the home side’s 4.61 and you have to go back to 1904, when England (2.30) beat Australia (3.81) at Melbourne, for the only time the difference was greater. The tortoises lead 1-0 and this culture clash Ashes series is off to an incredible start.","pubDate":"2023-06-20 18:23:39","image_url":"https://i.guim.co.uk/img/media/19aad83d6d05bd141846064e8811da6957a56e89/0_168_4000_2400/master/4000.jpg?width=460&quality=85&auto=format&fit=max&s=e9fad5fc8de00619a5f33a27dd6493c0","source_id":"theguardian","category":["sports"],"country":["australia"],"language":"english"},{"title":"Forget 2005 comparisons, this was as dramatic as decade-old Durham | Geoff Lemon","link":"https://www.theguardian.com/sport/blog/2023/jun/20/usman-khawaja-pat-cummins-ashes-australia-england-first-test-day-five-cricket","keywords":["Ashes 2023","Australia cricket team","England cricket team","The Ashes","Cricket","Australia sport","Sport"],"creator":["Geoff Lemon at Edgbaston"],"video_url":null,"description":"First Test was reminiscent of 2013 as Warner gave Australia a flying start before Broad delivered one of his Ashes specialsSmoking Jesus. Take a moment to collect yourself. If you were watching that final day at Edgbaston, you deserve to let your nerves unspool. They must be clenched to raging little clusters of data. Do some deep breathing. Take your shoes off and walk on the lawn. Fists with your toes. Even if you’re not invested in either team, close Test cricket can make you sick, when awaiting each delivery feels like you’ve just chugged a large chocolate milk before jumping on Magic Mountain.If you’ve paid any attention to coverage over the past five days, you might have heard one or two comparisons to the Edgbaston Ashes Test of 2005. Run totals of 407 on the first day, fourth‑innings targets for Australia of 282 and 281 respectively, falling short both times under clouded skies, simmering in the fetid steambath of noise generated by the Hollies Stand. Continue reading...","content":"S moking Jesus. Take a moment to collect yourself. If you were watching that final day at Edgbaston, you deserve to let your nerves unspool. They must be clenched to raging little clusters of data. Do some deep breathing. Take your shoes off and walk on the lawn. Fists with your toes. Even if you’re not invested in either team, close Test cricket can make you sick, when awaiting each delivery feels like you’ve just chugged a large chocolate milk before jumping on Magic Mountain. If you’ve paid any attention to coverage over the past five days, you might have heard one or two comparisons to the Edgbaston Ashes Test of 2005. Run totals of 407 on the first day, fourth‑innings targets for Australia of 282 and 281 respectively, falling short both times under clouded skies, simmering in the fetid steambath of noise generated by the Hollies Stand. Australia hold off late England charge to win first Ashes Test in thrilling finale Read more Until the dramatic work of Australia’s lower order, though, this was more reminiscent of Durham in 2013. That time Australia were set a chase of 299. Both involved David Warner giving Australia a flying start in the company of a left‑handed opening partner enjoying a late-career revival at around the age of 36: Usman Khawaja now, Chris Rogers then. Khawaja was there in 2013, too, as was Steve Smith in the middle order and Nathan Lyon as the spinner. Both times Mitchell Starc was left out, and his pace was missed as England ran up a score in the third innings. Both involved a hulking blond all-rounder making useful runs at six, from Shane Watson to Cameron Green. And both involved a Stuart Broad spell, one of his Ashes specials. Durham was the more dramatic: a streak of six for 20 across 45 balls after the door had been prised open with the removal of the top three. Edgbaston had Broad apply the crowbar: removing Smith and Marnus Labuschagne in the space of 12 balls on the fourth evening. That spell more than anything was reminiscent of a decade earlier: the tall figure of Broad wading in on his heron legs, so elongated that his own shadow was jealous, his whites glowing a shade of gold in the late‑day sunshine. Cheered into his delivery stride each time by a liquored terrace of uncontained humanity, singing the same song about him being better than his dad. Chris Broad is a decent match referee but probably wouldn’t give much argument. Stuart Broad celebrates his dismissal of Shane Watson at Durham in 2013. Photograph: Tom Jenkins/The Guardian It was testament to Pat Cummins and Nathan Lyon, then, that Broad didn’t have the decisive influence on the fifth day. For a time it was England’s other talisman, Ben Stokes. As the captain leading their stated intention to set every game ablaze, he was set up opposite the approach of Khawaja. You could typify the contrast as fire and ice, but really it was fire and water. Whatever England tried to brandish, Khawaja doused. He faced 518 balls in the match, where the other five Australian specialists managed 393. England’s entire team, both times, faced 866. There was something cussedly specific about the way Khawaja stretched forward to defend, time and again, occasionally diverting a single, even more rarely finding the boundary. skip past newsletter promotion Sign up to Guardian Australia Sport Free newsletter Get a daily roundup of the latest sports news, features and comment from our Australian sports desk Privacy Notice: Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion England relied on vibes and sprites when Cummins went a little Bazball | Jonathan Liew Read more So after a long wait, 70 overs into the innings, Stokes dragged his bad knee into action. In his second over, a cross-seamer took the inside edge on to the stumps. The immovable Khawaja was gone for 65. Stokes was away, with his incredible knack for shaping a game. Ignoring the new ball, keeping Joe Root on with spin that claimed Alex Carey’s wicket the very next over. Then Stokes so nearly recreating his famous World Cup catch, running backwards after Lyon’s hook. But that particular miracle couldn’t repeat, and the extraordinary last stanza of this match took on an unexpected meter. In terms of playing style, the result owes its existence to England’s. Had they batted conventionally in either innings, there would not have been enough time for Australia to have played their own way and won, given the sessions lost to rain. But there would also not have been time for England to come so close to a win themselves. One more nick, and Josh Hazlewood at No 11 was every chance of offering a second. And when the game came down to its last fateful overs, Australia’s captain put an attacking philosophy just as firmly on display. Needing 72 when Khawaja was out, and 54 when Carey followed, Cummins hit twin sixes off Root, then charged Broad and hammered four through cover point. Australia could have looked to bunker down with 15 overs to go, but it turns out that they don’t do draws either. Which, much as you might like to avoid cliche, does take you back to 2005. Specifically to Australia’s lower order pulling a distant chase into the realms of possibility. Back then it was Brett Lee 43 not out, nearly getting home. This time it was Pat Cummins with one more run, with the opposite result, and with one of the best captain’s innings in an Ashes match. One thing is certain: in a couple of decades from now, people will still be talking about this one too.","pubDate":"2023-06-20 20:03:28","image_url":"https://i.guim.co.uk/img/media/bc63ec66f2f67175538e420c53e3bf1366f27035/0_38_3500_2101/master/3500.jpg?width=460&quality=85&auto=format&fit=max&s=5118dbee299a1e27eb3ac254664c3ef6","source_id":"theguardian","category":["sports"],"country":["australia"],"language":"english"},{"title":"BCCI sets Rs 350 cr base price for lead sponsorship rights","link":"https://economictimes.indiatimes.com/news/sports/bcci-sets-rs-350-cr-base-price-for-lead-sponsorship-rights/articleshow/101144170.cms","keywords":null,"creator":null,"video_url":null,"description":"The BCCI released the tender for national team lead sponsor rights on June 14. The tender document will be available for purchase until June 26. The base price is less than the amount paid by the edtech company Byju's, which was the lead sponsor until March. Byju's was paying ₹5.07 crore per match for domestic matches featuring Team India and ₹1.56 crore per match for ICC and ACC tournaments.","content":"Synopsis The BCCI released the tender for national team lead sponsor rights on June 14. The tender document will be available for purchase until June 26. The base price is less than the amount paid by the edtech company Byju's, which was the lead sponsor until March. Byju's was paying ₹5.07 crore per match for domestic matches featuring Team India and ₹1.56 crore per match for ICC and ACC tournaments. BCCI sets Rs 350 cr base price for lead sponsorship rights The Board of Control for Cricket in India ( BCCI ) has set a base price of ₹350 crore for the national lead sponsor rights , sources privy to the development told ET. One of the sources said that the base price for the bilateral matches featuring India is ₹3 crore per match and ₹1 crore per match for International Cricket Council (ICC) and Asian Cricket Council ( ACC ) tournaments. The BCCI released the tender for national team lead sponsor rights on June 14. The tender document will be available for purchase until June 26. The base price is less than the amount paid by the edtech company Byju's, which was the lead sponsor until March. Byju's was paying ₹5.07 crore per match for domestic matches featuring Team India and ₹1.56 crore per match for ICC and ACC tournaments. The BCCI has barred betting, crypto-currency, tobacco, and real-money gaming companies from bidding for the lead sponsor rights. BCCI did not respond to ET's request for comment. A sports business expert said that the BCCI has made the right decision by setting a lower base price than what it was getting from Byju's. \"BCCI has set a realistic base price for the lead sponsor rights. The ad market is tough, and the new-age sponsors who were spending large sums of money on cricket have cut their marketing budgets drastically due to the funding winter,\" the expert said on the condition of anonymity. The expert noted that lead sponsor rights are a great asset that can be used by brands to build long-term value. \"Byju's became a well-known brand due to its association with Team India. The lead sponsor asset is a powerful one to build brands,\" the expert added. In 2019, Byju's replaced mobile handset maker Oppo to become the jersey sponsor of the Indian cricket team. Having bagged the jersey sponsorship rights in March 2017 for a whopping ₹1079.3 crore, Oppo exited the deal by transferring its sponsorship rights to Byju's. Earlier, GroupM South Asia head of sports, esports, and entertainment Vinit Karnik had said that an estimated ₹2,000-2,500 crore worth of on-ground sponsorship inventory across the Indian Premier League (IPL) and bilateral matches will become available this year. According to the GroupM India Sports Sponsorship Report 2023, the Indian sports industry's advertising revenue surged 49% to ₹14,209 crore in 2022 and is expected to reach ₹16,000 crore in 2023. The agency believes that the sports industry's ad revenue could potentially reach ₹20,000 crore by 2025. Don’t miss out on ET Prime stories! Get your daily dose of business updates on WhatsApp. click here! Tuesday, 20 Jun, 2023 Experience Your Economic Times Newspaper, The Digital Way! Read Complete Print Edition » Front Page Pure Politics Companies & Economy ET Markets More PM Modi’s US Visit may Boost Semicon Supply Chain Pact Prime Minister Narendra Modi's visit to the US this week is likely to give a boost to the Indo-US technology partnership, especially on the establishment of a new semiconductor supply chain where major announcements are expected. Adani Looks to Rope in More Lenders to Refinance $3.8 b The Adani Group is in discussions to rope in at least five new international banks as it looks to refinance $3.8 billion of loans of varying tenors taken for the acquisition of ACC Limited and Ambuja Cement last year, said people aware of the ongoing discussions. IndiGo Gives Airbus Record 500-Plane Order IndiGo has placed an order for 500 Airbus A320 family of aircraft, worth $50 billion at list price and the largest in the history of global aviation. Read More News on bcci acc byju s Advertising Marketing Inventory Revenue Brands Rights team india (Catch all the Business News , Breaking News Events and Latest News Updates on The Economic Times .) Download The Economic Times News App to get Daily Market Updates & Live Business News. ... more less ETPrime stories of the day Investing Motilal Oswal launches low-cost micro-cap index fund. Will risk-averse investors go for it? 9 mins read 3 insights to kick-start your day: featuring Glenmark’s cancer drug 3 mins read Strategy Stock Radar: 20% rally so far in 2023! This cement stock is likely to touch record highs soon 3 mins read Subscribe to ETPrime","pubDate":"2023-06-20 19:23:20","image_url":"https://img.etimg.com/thumb/width-1200,imgsize-44388,resizemode-4,msid-101144170/bcci-sets-rs-350-cr-base-price-for-lead-sponsorship-rights.jpg","source_id":"economictimes_indiatimes","category":["sports"],"country":["india"],"language":"english"},{"title":"'He's one' - Andros Townsend makes claim over Liverpool player's on-field antics","link":"https://www.liverpoolecho.co.uk/sport/football/football-news/hes-one-andros-townsend-makes-27163397","keywords":["Sport"],"creator":null,"video_url":null,"description":"Liverpool captain Jordan Henderson has been a vocal member of the Reds' squad since being appointed captain in 2015","content":"Outgoing Everton midfielder Andros Townsend has named Jordan Henderson as the player who has gone to the most effort to distract him during games. This tactic of uttering phrases in the hope of provoking a reaction from an opponent is widely utilised not only in football but also in other sports, particularly cricket. Frowned upon by some, it has become a part of the game regardless. Townsend, who will leave the Blues once his current deal expires at the end of this month, has faced off against Henderson 16 times during his playing career and has come out on top on only one occasion. They last both took to the pitch during 4-1 win at Goodison Park in December 2021, a fixture which saw Henderson named man of the match after his all-action display. Reds fans will best remember their current captain for his impressive work ethic when the time comes for him to leave the club, though Townsend will share an alternative, overriding memory of the former Sunderland midfielder. Asked to name who has been the worst individual for putting him off during matches, Townsend talk talkSPORT: \"Probably [Jordan] Henderson. He’s always talking, he’s always at you. He’s one.\" The pair, so often going head-to-head against each other, have been team-mates when in action together on the international stage. Townsend is no longer a regular member of the England squad, though earned 13 caps between 2013 and 2016. His next club remains to be seen as he prepares to become a free agent after two years spent at Everton.","pubDate":"2023-06-20 19:13:46","image_url":"https://i2-prod.liverpoolecho.co.uk/incoming/article27163526.ece/ALTERNATES/s98/0_Townsend.jpg","source_id":"liverpoolecho","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"ENG Vs AUS: कप्तान पैट कमिंस ने ऑस्ट्रेलियाई को दिलाई ऐतिहासिक जीत, सांसे थामने वाले टेस्ट में इंग्लैंड को दो विकेट से हराया","link":"https://www.abplive.com/sports/cricket/ashes-2023-eng-vs-aus-1st-test-match-report-australia-won-by-2-wickets-pat-cummins-scored-44-runs-while-chasing-2436141","keywords":["Cricket"],"creator":["मोहम्मद अलफैज"],"video_url":null,"description":"Ashes 2023 ENG Vs AUS 1st test Report: ऑस्ट्रेलिया और इंग्लैंड के बीच खेली जा रही एशेज़ 2023 के पहले टेस्ट में ऑस्ट्रेलिया ने 2 विकेट से जीत दर्ज कर ली है. रनों का पीछा करते हुए ऑस्ट्रेलियाई कप्तान पैट कमिंस ने नाबाद रहते हुए 44* रनों की पारी खेली और आखिरी गेंद पर चौका लगाकर टीम को जीत दिलाई. वहीं उस्मान ख्वाजा ने टीम के लिए सबसे बड़ी 65 रनों की पारी खेली. इंग्लैंड की ओर से ब्रॉड ने सबसे ज़्यादा 3 विकेट लिए. बारिश के चलते आखिरी दिन का खेल दूसरे सेशन से शुरू हुआ था.  बारिश के बाद ऑस्ट्रेलिया को आखिरी यानी पांचवें दिन 67 ओवर में 174 रनों का टारगेट दिया गया था. चौथा दिन खत्म होने तक ऑस्ट्रेलिया की टीम 3 विकेट गंवा चुकी थी. लिहाजा ऑस्ट्रेलिया को आखिरी दिन 7 विकेट रहते हुए 174 रन बनाने थे. कंगारू टीम ने 2 विकेट रहते हुए टारगेट हासिल कर एशेज़ 2023 का पहला टेस्ट अपने नाम किया.  कमिंस और नाथन लियोन ने की अर्धशतकीय साझेदारी  ऑस्ट्रेलियाई कप्तान पैट कमिंस और नाथन लियोन ने इस मैच में अपनी बैटिंग से ऑस्ट्रेलिया को जीत दिलाने में अहम किरदार अदा किया. नंबर नौं पर बल्लेबाज़ी करते हुए ऑस्ट्रेलियाई कप्तान पैट कमिंस ने 4 चौके और 2 छक्कों की मदद से 44* और नंबर 10 पर बल्लेबाज़ी करते हुए नाथन लियोन ने 2 चौके लगाकर 16* रन बनाए. दोनों ने 9वें विकेट के लिए 55* रनों की साझेदारी की. ऐसा रहा पूरा मैच  इंग्लैंड ने टॉस जीतकर पहले बल्लेबाज़ी करने का फैसला किया और 8 विकेट पर 393 रन बनाकर पारी घोषित कर दी. टीम की ओर से पूर्व कप्तान जो रूट ने 118 रनों की पारी खेली. इस दौरान ऑस्ट्रेलियाई गेंदबाज़ नाथन लियोन ने 4 और जोश हेज़लवुड ने 2 विकेट चटकाए. इसके अलावा स्कॉट बोलैंड और कैमरून ग्रीन ने 1-1 विकेट अपने नाम किया.  इसके बाद अपनी पहली पारी में बल्लेबाज़ी करने उतरी ऑस्ट्रेलिया की टीम ने 386 रन बनाए. टीम की ओर से उस्मान ख्वाजा ने 14 चौके और 3 छक्कों की मदद से 141 रन जड़े. इस दौरान इंग्लिश गेंदबाज़ स्टुअर्ट ब्राड और रॉबिन्सन ने 3-3 विकेट झटके. इसके अलावा स्पिनर मोईन अली ने 2 विकेट लिए. वहीं कप्तान बेन स्टोक्स और जेम्स एंडरसन ने 1-1 विकेट चटकाया.  अपनी दूसरी पारी के लिए मैदान पर उतरी इंग्लैंड की टीम 273 रनों पर ही सिमट गई. इस पारी में ऑस्ट्रेलियाई गेंदबाज़ नाथन लियोन और कप्तान पैट कमिंस ने 4-4 विकेट झटके. वहीं जोश हेज़लवुड और स्कॉट बोलैंड को 1-1 सफलता मिली. इसके बाद 281 रनों का पीछा करते हुए ऑस्ट्रेलिया ने 2 विकेट से जीत अपने नाम की.    ये भी पढे़ं... Virat Kohli: टेस्ट में 12 साल पूरे होने पर विराट कोहली ने शेयर की खास पोस्ट, लिखी दिल छू लेने वाली बात","content":"Ashes 2023 ENG Vs AUS 1st test Report: ऑस्ट्रेलिया और इंग्लैंड के बीच खेली जा रही एशेज़ 2023 के पहले टेस्ट में ऑस्ट्रेलिया ने 2 विकेट से जीत दर्ज कर ली है. रनों का पीछा करते हुए ऑस्ट्रेलियाई कप्तान पैट कमिंस ने नाबाद रहते हुए 44* रनों की पारी खेली और आखिरी गेंद पर चौका लगाकर टीम को जीत दिलाई. वहीं उस्मान ख्वाजा ने टीम के लिए सबसे बड़ी 65 रनों की पारी खेली. इंग्लैंड की ओर से ब्रॉड ने सबसे ज़्यादा 3 विकेट लिए. बारिश के चलते आखिरी दिन का खेल दूसरे सेशन से शुरू हुआ था. बारिश के बाद ऑस्ट्रेलिया को आखिरी यानी पांचवें दिन 67 ओवर में 174 रनों का टारगेट दिया गया था. चौथा दिन खत्म होने तक ऑस्ट्रेलिया की टीम 3 विकेट गंवा चुकी थी. लिहाजा ऑस्ट्रेलिया को आखिरी दिन 7 विकेट रहते हुए 174 रन बनाने थे. कंगारू टीम ने 2 विकेट रहते हुए टारगेट हासिल कर एशेज़ 2023 का पहला टेस्ट अपने नाम किया. कमिंस और नाथन लियोन ने की अर्धशतकीय साझेदारी ऑस्ट्रेलियाई कप्तान पैट कमिंस और नाथन लियोन ने इस मैच में अपनी बैटिंग से ऑस्ट्रेलिया को जीत दिलाने में अहम किरदार अदा किया. नंबर नौं पर बल्लेबाज़ी करते हुए ऑस्ट्रेलियाई कप्तान पैट कमिंस ने 4 चौके और 2 छक्कों की मदद से 44* और नंबर 10 पर बल्लेबाज़ी करते हुए नाथन लियोन ने 2 चौके लगाकर 16* रन बनाए. दोनों ने 9वें विकेट के लिए 55* रनों की साझेदारी की. googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); ऐसा रहा पूरा मैच इंग्लैंड ने टॉस जीतकर पहले बल्लेबाज़ी करने का फैसला किया और 8 विकेट पर 393 रन बनाकर पारी घोषित कर दी. टीम की ओर से पूर्व कप्तान जो रूट ने 118 रनों की पारी खेली. इस दौरान ऑस्ट्रेलियाई गेंदबाज़ नाथन लियोन ने 4 और जोश हेज़लवुड ने 2 विकेट चटकाए. इसके अलावा स्कॉट बोलैंड और कैमरून ग्रीन ने 1-1 विकेट अपने नाम किया. इसके बाद अपनी पहली पारी में बल्लेबाज़ी करने उतरी ऑस्ट्रेलिया की टीम ने 386 रन बनाए. टीम की ओर से उस्मान ख्वाजा ने 14 चौके और 3 छक्कों की मदद से 141 रन जड़े. इस दौरान इंग्लिश गेंदबाज़ स्टुअर्ट ब्राड और रॉबिन्सन ने 3-3 विकेट झटके. इसके अलावा स्पिनर मोईन अली ने 2 विकेट लिए. वहीं कप्तान बेन स्टोक्स और जेम्स एंडरसन ने 1-1 विकेट चटकाया. अपनी दूसरी पारी के लिए मैदान पर उतरी इंग्लैंड की टीम 273 रनों पर ही सिमट गई. इस पारी में ऑस्ट्रेलियाई गेंदबाज़ नाथन लियोन और कप्तान पैट कमिंस ने 4-4 विकेट झटके. वहीं जोश हेज़लवुड और स्कॉट बोलैंड को 1-1 सफलता मिली. इसके बाद 281 रनों का पीछा करते हुए ऑस्ट्रेलिया ने 2 विकेट से जीत अपने नाम की. ये भी पढे़ं... Virat Kohli: टेस्ट में 12 साल पूरे होने पर विराट कोहली ने शेयर की खास पोस्ट, लिखी दिल छू लेने वाली बात","pubDate":"2023-06-20 18:47:24","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/06/21/c281e5019c0014ed468b032c6277eeb71687286280512582_original.jpg","source_id":"abplive","category":["sports"],"country":["india"],"language":"hindi"},{"title":"The Ashes: ऑस्ट्रेलिया ने नहीं दोहराई 2005 वाली गलती, एशेज के पहले टेस्ट में इंग्लैंड पर हासिल की रोमांचक जीत","link":"https://navbharattimes.indiatimes.com/sports/cricket/cricket-news/the-ashes-australia-defeats-england-by-2-wickets-in-first-test/articleshow/101143051.cms","keywords":null,"creator":null,"video_url":null,"description":"The Ashes: ऑस्ट्रेलिया ने इंग्लैंड के खिलाफ एशेज सीरीज का पहला टेस्ट जीत लिया है। एजबेस्टन में खेले गए मुकाबले को पैट कमिंस की टीम ने 2 विकेट से अपने नाम किया। 2005 में इसी मैदान पर ऑस्ट्रेलियाई टीम सिर्फ 2 रनों से एशेज सीरीज का पहला हार गई थी।","content":"ऑस्ट्रेलिया ने इंग्लैंड (ENG vs AUS) को हराकर एशेज सीरीज (The Ashes) का पहला टेस्ट अपने नाम कर लिया है। इंग्लिश टीम को वर्ल्ड चैंपियन के खिलाफ 2 विकेट से हार मिली। बर्मिंघम के एजबेस्टन मैदान पर ऑस्ट्रेलिया के सामने चौथी पारी में जीत के लिए 281 रनों का लक्ष्य था। ऑस्ट्रेलिया ने 8 विकेट खोकर लक्ष्य हासिल कर लिया। 227 के स्कोर पर ही टीम के 8 विकेट गिर गए थे। इसके बाद कप्तान पैट कमिंस और नाथन लायन ने टीम को लक्ष्य तक पहुंचा दिया। 2005 में इसी मैदान पर ऑस्ट्रेलिया के सामने चौथी पारी में 282 का लक्ष्य था। टीम वह मुकाबला 2 रन से हार गई थी। ऑस्ट्रेलिया के लिए पैट कमिंस और नाथन लायन ने 55 रनों की नाबाद साझेदारी बनाई। कप्तान कमिंस के बल्ले से 73 गेंदों पर 4 चौके और 2 छक्कों की मदद से 44 रन निकले। लायन ने 16 रनों का योगदान दिया। 227 रनों पर 8 विकेट गिरने के बाद ऑस्ट्रेलिया की हार पक्की दिख रही थी। लेकिन इन दोनों गेंदबाजों ने टीम को जीत तक पहुंचा दिया। मैच के आखिरी दिन ऑस्ट्रेलिया को जीत के लिए 174 रन और इंग्लैंड को 7 विकेट की जरूरत थी। सुबह का सत्र बारिश की भेंट चढ़ गया जिसके कारण लंच ब्रेक जल्दी लिया गया। मैच शुरू होने पर अंपायरों ने टीमों को 67 ओवर दिए। ऑस्ट्रेलिया ने दिन की शुरुआत तीन विकेट पर 107 रन से की। ख्वाजा और रात्रि प्रहरी स्कॉट बोलैंड ने पारी को आगे बढ़ाया। स्टुअर्ट ब्रॉड ने दिन के आठवें ओवर में बोलैंड को विकेटकीपर जॉनी बेयरस्टो के हाथों कैच कराके इस साझेदारी को तोड़ा। बोलैंड ने करियर की सर्वश्रेष्ठ 20 रन की पारी खेली। अच्छी फॉर्म में चल रहे ट्रेविस हेड भी अधिक देर नहीं टिक सके और 16 रन बनाकर ऑफ स्पिनर मोईन अली की गेंद पर स्लिप में जो रूट के कैच दे बैठे जिससे ऑस्ट्रेलिया का स्कोर पांच विकेट पर 143 रन हो गया। चाय ब्रेक के बाद ऑस्ट्रेलिया को तीन बड़े झटके लगे। कैमरून ग्रीन 28 रन बनाकर रॉबिंसन की गेंद पर बोल्ड हो गए। बेन स्टोक्स ने उस्मान ख्वाजा को आउट कर ऑस्ट्रेलिया का सबसे बड़ा विकेट झटका। पहली पारी में शतक बनाने वाले ख्वाजा ने दूसरी पारी में 65 रनों का योगदान दिया। एलेक्स कैरी (20) को जो रूट ने आउट किया। इंग्लैंड ने मैच की पहली पारी में 8 विकेट पर 393 रन बनाए थे। टीम के लिए जो रूट शतक बनाकर खेल रहे थे। इसके बाद भी कप्तान बेन स्टोक्स ने पहले ही दिन पारी घोषित कर दी। टीम के पास और बड़ा स्कोर बनाने का मौका था। ऑस्ट्रेलिया ने अपनी पहली पारी में 386 रन बनाए थे। इंग्लैंड की दूसरी पारी 273 रनों पर समेटने के बाद ऑस्ट्रेलिया को 281 रनों का लक्ष्य मिला था।","pubDate":"2023-06-20 18:45:26","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Ashes: Australia beat England by two wickets to win thrilling first Test","link":"https://www.standard.co.uk/sport/cricket/ashes-2023-first-test-result-england-vs-australia-b1089109.html","keywords":["Cricket","Sport"],"creator":["Malik Ouzia"],"video_url":null,"description":"For the most-hyped Ashes series in a generation, and an opener that from first ball had lived up to billing, here was a fitting finale, one sainted to rank alongside Edgbaston 2005 and Headingley 2019 as the century’s most dramatic.","content":"or the most-hyped Ashes series in a generation, and an opener that from first ball had lived up to billing, here was a fitting finale, one sainted to rank alongside Edgbaston 2005 and Headingley 2019 as the century’s most dramatic. These players were raised on the former series but many lived the second through its core, few more painfully than Nathan Lyon, who fumbled with the match at his mercy, and Pat Cummins, whose final ball was cut away, cut away for four. This then, was redemption, Australia’s two best bowlers in the middle refusing to lay down the bat as Ben Stokes, Headingley’s hero, at last ran out of ideas. Four years on from that agonising defeat, at 7:21pm on a warm Birmingham evening, they stood triumphant and unbeaten, a chase of 281 complete with just two tail-end wickets in hand. Of those, 54 were still required when Lyon and Cummins combined and Australia, you felt certain, would pay for their careful pursuit. Usman Khawaja, scorer of 201 runs in the match, was destined to be a bizarre scapegoat, having clearly resolved to be there at the end and, it seemed, left too much to do in the eventuality that he was not. As it turned out, though, this was a culture clash only until the second-last, caution thrown to the wind as Cummins hit two sixes in an over off Joe Root to turn the tide. SPONSORED Stokes, as ever did his best to hold it back, having dragged a rare spell from his ailing legs to end Khawaja’s second vigil of the match, then come agonisingly close to what would have been the catch of his career, a field in which the bar is set ludicrously high. If there is regret for the England skipper - and he will insist his team have no time for those - it must be in the runs left on the table by the first evening’s early declare. This is an Australian victory that ought to be far from a knockout blow, the tourists heading to Lord’s 1-0 up but the two teams, on five gripping days’ evidence, thrillingly well-matched. England though, to regain the Ashes, must do what no one side as since Michael Vaughan’s heroes and come from behind to claim the Urn. For Cummins, who hit the winning runs to finish unbeaten on 44, there was a sense of personal vindication, the Australian captain, in fashion so un-Australian, having consented to spend so much of these five days on the back foot. The acceptance was that on home turf and so buoyed by revolution, England were always bound to make the running. The morning of a day five so epically poised brought forecast storms and a 2:15pm start that, if anything, merely served to ensure the hues were just right for a knife-edge climax so late in the day. The first hour brought only 12 runs off the bat, the sole moment of excitement coming, predictably, from Stuart Broad, who bluffed nightwatchman Scott Boland with a short-ball field and rattled his stumps, the supposed bunny taking with him 20 important runs. Excitement and tension are two different things, though, and on days like these, even with 160 of them still required, few were in doubt as to the value of each run. They were hard to come by, Stokes’s field placement canny and Australia’s few shots of intent denied leave from the ring. Root stood on the fence, conducting the crowd like an Olympic long-jumper at the top of the runway, arms flapping and hands clapping as Broad thundered in through a seven-over spell. If pressure was to be means to a wicket then Moeen Ali’s introduction seemed to have bungled the plan, the spinner’s first three deliveries all pounced on by Travis Head to the tune of ten quick runs. Leakage, though, is factored into the Moeen bargain and two deliveries later Australia’s most aggressive batter was no more. England’s growing desperation, though, told you Australia had edged in front. Broad tried in vain to get a frigid ball changed, holding it up to the light for the umpire’s inspection as if it were a dodgy tenner. Root urged the Hollies for more as they rumbled his name, a rare act of narcissism from a selfless player, and certainly a bold one for a man about to twirl part-time spin. In fairness, Root rose to the sound with a valiant spell, including, later, the in-form Alex Carey’s wicket caught and bowled. Ollie Robinson, who has grown into this match like a teenager into new school shoes, again cracked the game open after tea, Green out chopping on with 89 still to get. Then came the break glass moment, spotted by the eagle-eyed before it happened: English hopes drifting, Aussie belief building and at mid-off Stokes, at last, getting loose. How many deliveries are left in those legs - in that knee - only he can guess, but here was a moment in which it had to be worth using up a few of them: If not now, then when? In the end, even the glazy-eyed got forewarning, for rarely can the sight of a man handing a cap to an umpire have been met with such a noise. The first over was nothing special, a trundling effort off a half-paced run, but the second changed all complexion: Khawaja gone, game on. It seemed ripe, as so many before it, for Stokes’s seizing but for once, in the face of Lyon and Cummins’ resilience, he was found clutching at air.","pubDate":"2023-06-20 18:43:00","image_url":"https://static.standard.co.uk/2023/06/20/19/newFile-1.jpg?width=1200&auto=webp","source_id":"standarduk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"1st Ashes Test: Khawaja, Cummins Star In Australia's Narrow Win vs England","link":"https://sports.ndtv.com/cricket/england-vs-australia-1st-ashes-test-usman-khawaja-pat-cummins-star-as-australia-edge-past-england-by-2-wickets-4138551","keywords":null,"creator":null,"video_url":null,"description":"Australia beat England by two wickets to win a thrilling first Ashes Test at Edgbaston on Tuesday.","content":"Australia beat England by two wickets to win a thrilling first Ashes Test at Edgbaston on Tuesday. Australia were struggling at 227-8, still 54 runs shy of a victory target of 281, when skipper Pat Cummins was joined in the middle by tailender Nathan Lyon. But the pair's unbroken stand of 55 saw Ashes holders Australia home, with Cummins hitting the winning boundary to finish on 44 not out after opener Usman Khawaja had made a painstaking 65 to follow his first-innings 141. Lyon was unbeaten on 16, with Australia now 1-0 up in this five-match series as they bid for a first Ashes campaign triumph on English soil in 22 years. (This story has not been edited by NDTV staff and is auto-generated from a syndicated feed.)","pubDate":"2023-06-20 18:42:34","image_url":null,"source_id":"ndtv","category":["sports"],"country":["india"],"language":"english"},{"title":"Ashes 2023 : थरारक सामन्यात कमिन्सने विजयी चौकार लगावला, पहिल्या कसोटी सामन्यात ऑस्ट्रेलियाचा इंग्लंडवर विजय","link":"https://marathi.abplive.com/sports/cricket/ashes-2023-edgbaston-test-australia-won-by-2-wickets-1185919","keywords":["क्रिकेट"],"creator":["एबीपी माझा ब्युरो"],"video_url":null,"description":"Ashes 2023, Edgbaston Test : कर्णधार पॅट कमिन्स याच्या झंझावती फलंदाजीच्या जोरावर ऑस्ट्रेलियाने पहिल्या कसोटीत थरारक विजय मिळवला. यासह कांगारुंनी अॅशेस मालिकेत विजयाने सुरुवात केली आहे. इंग्लंडने दिलेल्या 281 धावांच्या आव्हानाचा पाठलाग ऑस्ट्रेलियाने दोन विकेट राखून केला.  ऑस्ट्रेलियाकडून पॅट कमिन्स याने नाबाद 44 तर उस्मान ख्वाजा याने 65 धावांचे योगदान दिले.  ऑस्ट्रेलियाकडून उस्मान ख्वाजा याने दोन्ही डावात दमदार फलंदाजी केली. पहिल्या डावात उस्मान ख्वाजा याने 141 धावांची खेळी केली तर दुसऱ्या डावात निर्णायाक 65 धावांचे योगदान दिले. उस्मान ख्वाजाशिवाय दुसऱ्या डावात डेविड वॉर्नर याने 36 धावांची खेळी केली. मार्नस लाबुशेन 13, स्टिवन स्मिथ 06, स्कॉट बोलँड 20, ट्रेविस हेड 16,  कॅमरुन ग्रीन 28, अॅलेक्स कॅरी 20 धावांची खेळी केली.  281 धावांचा पाठलाग करताना ऑस्ट्रेलियाने दमदार सुरुवात केली. डेविड वॉर्नर आणि उस्मान ख्वाजा यांनी पहिल्या विकेटसाठी 61 धावांची भागिदारी केली. डेविड वॉर्नर याला ओली रॉबिसन याने तंबूत पाठवले. त्यानंतर ऑस्ट्रेलियाचा डाव ढेपाळला. एकापाठोपाठ एक फलंदाज तंबूत परतले. दुसऱ्या बाजूला उस्मान ख्वाजा याने एकेरी दुहेरी धावसंख्येवर भर दिला. एका बाजूला विकेट पडत असताना उस्मान ख्वाजा याने दुसरी बाजू लावून धरली.  उस्मान ख्वाजा येने बोलँड याच्यासोबत 32, हेडसोबत 22 आणि ग्रीनसोबत 49 धावांची भागिदारी करत धावसंख्येला आकार दिला. इंग्लंडचा कर्णधार बेन स्टोक्स याने ख्वाजा याला त्रिफाळाचित करत इंग्लंडच्या आशा उंचावल्या. उस्मान ख्वाजा बाद झाल्यानंतर इंग्लंडच्या आशा पल्लवीत झाल्या होत्या. पण कर्णधार पॅट कमिन्स याने नॅथन लायन याला हाताशी धरत ऑस्ट्रेलियाच्या धावसंख्येला आकार दिला. पॅट कमिन्स याने लायन याच्यासोबत नवव्या विकेटसाठी नाबाद 55 धावांची भागिदारी केली. पॅट कमिन्स याने नाबाद 44 तर नॅथन लायन याने नाबाद 16 धावांची खेळी केली.  Test cricket at its best 🤩Australia seal a mouth-watering win in Birmingham in the first #Ashes Test ✌️#WTC25 | 📝: https://t.co/ZNnKIn9jeq pic.twitter.com/K0lKH79ml4 — ICC (@ICC) June 20, 2023 पहिल्या कसोटीत काय झाले ? अॅशेस कसोटी मालिकेच्या पहिल्या सामन्यात इंग्लंडने नाणेफेक जिंकून प्रथम फलंदाजी करण्याचा निर्णय घेतला. यजमान इंग्लंडने पहिल्या डावात आठ विकेटच्या मोबदल्यात 393 धावांपर्यंत मजल मारली. इंग्लंडकडून जो रुट याने शतकी खेळी केली.  जो रुट याने 118 धावांचे योगदान दिले. त्याशिवाय जॉनी बेअस्टो याने 78 धावांचे योगदान दिले. ऑस्ट्रेलियाकडून नॅथन लायन याने सर्वाधिक 4 विकेट घेतल्या. इंग्लंडने दिलेल्या 393 धावांच्या आव्हानाचा पाठलाग ऑस्ट्रेलियाने प्रभावीपणे केला. कागांरुंनी पहिल्या डावात 386 धावांपर्यंत मजल मारली. उस्मान ख्वाजा याने ऑस्ट्रेलियाकडून शतकी खेळी केली. ख्वाजा याने 141 धावांचे योगदान दिले. त्याशिवाय ट्रेविस हेड आणि अॅलेक्स कॅरी यांनीही अर्धशतके झळकावली. हेड याने 50 तर अॅलेक्स कॅरी याने 66 धावांचे योगदान दिले. पहिल्या डावात ऑस्ट्रेलियाचा संघ अवघ्या 7 धावांनी पिछाडीवर होता. इंग्लंडचा संघ दुसऱ्या डावात 273 धावांत संपला.  एकाही फलंदाजाला अर्धशतकी खेळी करता आली नाही. इंग्लंडकडून जो रूट आणि हॅरी ब्रूक यांनी प्रत्येकी 46-46 धावांचे योगदान दिले. त्याशिवाय कर्णधार बेन स्टोक्स याने 43 धावांची खेळी केली. ऑस्ट्रेलियाचा कर्णधार पॅट कमिन्स आणि नॅथन लायन यांनी प्रत्येकी 4-4 विकेट घेतल्या आहेत. जोश हेजलवूड आणि स्कॉट बोलँड यांनी प्रत्येकी एक एक विकेट घेतली.","content":"Ashes 2023, Edgbaston Test : कर्णधार पॅट कमिन्स याच्या झंझावती फलंदाजीच्या जोरावर ऑस्ट्रेलियाने पहिल्या कसोटीत थरारक विजय मिळवला. यासह कांगारुंनी अॅशेस मालिकेत विजयाने सुरुवात केली आहे. इंग्लंडने दिलेल्या 281 धावांच्या आव्हानाचा पाठलाग ऑस्ट्रेलियाने दोन विकेट राखून केला. ऑस्ट्रेलियाकडून पॅट कमिन्स याने नाबाद 44 तर उस्मान ख्वाजा याने 65 धावांचे योगदान दिले. ऑस्ट्रेलियाकडून उस्मान ख्वाजा याने दोन्ही डावात दमदार फलंदाजी केली. पहिल्या डावात उस्मान ख्वाजा याने 141 धावांची खेळी केली तर दुसऱ्या डावात निर्णायाक 65 धावांचे योगदान दिले. उस्मान ख्वाजाशिवाय दुसऱ्या डावात डेविड वॉर्नर याने 36 धावांची खेळी केली. मार्नस लाबुशेन 13, स्टिवन स्मिथ 06, स्कॉट बोलँड 20, ट्रेविस हेड 16, कॅमरुन ग्रीन 28, अॅलेक्स कॅरी 20 धावांची खेळी केली. 281 धावांचा पाठलाग करताना ऑस्ट्रेलियाने दमदार सुरुवात केली. डेविड वॉर्नर आणि उस्मान ख्वाजा यांनी पहिल्या विकेटसाठी 61 धावांची भागिदारी केली. डेविड वॉर्नर याला ओली रॉबिसन याने तंबूत पाठवले. त्यानंतर ऑस्ट्रेलियाचा डाव ढेपाळला. एकापाठोपाठ एक फलंदाज तंबूत परतले. दुसऱ्या बाजूला उस्मान ख्वाजा याने एकेरी दुहेरी धावसंख्येवर भर दिला. एका बाजूला विकेट पडत असताना उस्मान ख्वाजा याने दुसरी बाजू लावून धरली. उस्मान ख्वाजा येने बोलँड याच्यासोबत 32, हेडसोबत 22 आणि ग्रीनसोबत 49 धावांची भागिदारी करत धावसंख्येला आकार दिला. इंग्लंडचा कर्णधार बेन स्टोक्स याने ख्वाजा याला त्रिफाळाचित करत इंग्लंडच्या आशा उंचावल्या. उस्मान ख्वाजा बाद झाल्यानंतर इंग्लंडच्या आशा पल्लवीत झाल्या होत्या. पण कर्णधार पॅट कमिन्स याने नॅथन लायन याला हाताशी धरत ऑस्ट्रेलियाच्या धावसंख्येला आकार दिला. पॅट कमिन्स याने लायन याच्यासोबत नवव्या विकेटसाठी नाबाद 55 धावांची भागिदारी केली. पॅट कमिन्स याने नाबाद 44 तर नॅथन लायन याने नाबाद 16 धावांची खेळी केली. Test cricket at its best 🤩 Australia seal a mouth-watering win in Birmingham in the first #Ashes Test ✌️ #WTC25 | 📝: https://t.co/ZNnKIn9jeq pic.twitter.com/K0lKH79ml4 googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); — ICC (@ICC) June 20, 2023 पहिल्या कसोटीत काय झाले ? अॅशेस कसोटी मालिकेच्या पहिल्या सामन्यात इंग्लंडने नाणेफेक जिंकून प्रथम फलंदाजी करण्याचा निर्णय घेतला. यजमान इंग्लंडने पहिल्या डावात आठ विकेटच्या मोबदल्यात 393 धावांपर्यंत मजल मारली. इंग्लंडकडून जो रुट याने शतकी खेळी केली. जो रुट याने 118 धावांचे योगदान दिले. त्याशिवाय जॉनी बेअस्टो याने 78 धावांचे योगदान दिले. ऑस्ट्रेलियाकडून नॅथन लायन याने सर्वाधिक 4 विकेट घेतल्या. इंग्लंडने दिलेल्या 393 धावांच्या आव्हानाचा पाठलाग ऑस्ट्रेलियाने प्रभावीपणे केला. कागांरुंनी पहिल्या डावात 386 धावांपर्यंत मजल मारली. उस्मान ख्वाजा याने ऑस्ट्रेलियाकडून शतकी खेळी केली. ख्वाजा याने 141 धावांचे योगदान दिले. त्याशिवाय ट्रेविस हेड आणि अॅलेक्स कॅरी यांनीही अर्धशतके झळकावली. हेड याने 50 तर अॅलेक्स कॅरी याने 66 धावांचे योगदान दिले. पहिल्या डावात ऑस्ट्रेलियाचा संघ अवघ्या 7 धावांनी पिछाडीवर होता. इंग्लंडचा संघ दुसऱ्या डावात 273 धावांत संपला. एकाही फलंदाजाला अर्धशतकी खेळी करता आली नाही. इंग्लंडकडून जो रूट आणि हॅरी ब्रूक यांनी प्रत्येकी 46-46 धावांचे योगदान दिले. त्याशिवाय कर्णधार बेन स्टोक्स याने 43 धावांची खेळी केली. ऑस्ट्रेलियाचा कर्णधार पॅट कमिन्स आणि नॅथन लायन यांनी प्रत्येकी 4-4 विकेट घेतल्या आहेत. जोश हेजलवूड आणि स्कॉट बोलँड यांनी प्रत्येकी एक एक विकेट घेतली.","pubDate":"2023-06-20 18:30:50","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/06/21/aec8589e1b584f166f5d1c21f93878411687285836847265_original.jpg","source_id":"abplive","category":["sports"],"country":["india"],"language":"Marathi"},{"title":"Ashes Series 2023: দাঁতে দাঁত চেপে কামিন্সের দুরন্ত লড়াই, ২ উইকেটে প্রথম অ্যাশেজ টেস্ট জিতল অস্ট্রেলিয়া","link":"https://bengali.abplive.com/sports/cricket/australian-captain-pat-cummins-guide-australia-to-a-2-wicket-victory-in-first-ashes-test-986994","keywords":["ক্রিকেট"],"creator":["ABP Ananda"],"video_url":null,"description":"বার্মিংহাম: অ্যাশেজ মানেই ক্রিকেটের সবথেকে পুরনো প্রতিদ্বন্দ্বিতা। দুই চিরপ্রতিদ্বন্দ্বী অস্ট্রেলিয়া ও ইংল্যান্ডের হাড্ডাহাড্ডি লড়াই। বার্মিংহামের এজবাস্টনে সেই হাড্ডাহাড্ডি লড়াইয়েরই সাক্ষী হয়ে থাকল ক্রিকেটবিশ্ব। এক রুদ্ধশ্বাস ম্যাচে পরিপক্কতার পরিচয় দিয়ে দলকে দুই উইকেট জেতালেন প্যাট কামিন্স। প্রবল চাপের মাথা ঠান্ডা রেখে তাঁর অপরাজিত ৪৪ রানের ইনিংসই অজিদের দুই উইকেটে জয় এনে দিল। নবম উইকেটে প্যাট কামিন্স ও নাথান লায়ন অস্ট্রেলিয়ার হয়ে ৫৫ রান যোগ করেন। এবিপি আনন্দ এখন টেলিগ্রামেও, ক্লিক করুন এই লিঙ্কেhttps://t.me/abpanandaofficial আরও পড়ুন: লেখার দক্ষতা বাড়াতে কোন কোন দিকে খেয়াল রাখতে হবে?","content":"বার্মিংহাম: অ্যাশেজ মানেই ক্রিকেটের সবথেকে পুরনো প্রতিদ্বন্দ্বিতা। দুই চিরপ্রতিদ্বন্দ্বী অস্ট্রেলিয়া ও ইংল্যান্ডের হাড্ডাহাড্ডি লড়াই। বার্মিংহামের এজবাস্টনে সেই হাড্ডাহাড্ডি লড়াইয়েরই সাক্ষী হয়ে থাকল ক্রিকেটবিশ্ব। এক রুদ্ধশ্বাস ম্যাচে পরিপক্কতার পরিচয় দিয়ে দলকে দুই উইকেট জেতালেন প্যাট কামিন্স। প্রবল চাপের মাথা ঠান্ডা রেখে তাঁর অপরাজিত ৪৪ রানের ইনিংসই অজিদের দুই উইকেটে জয় এনে দিল। নবম উইকেটে প্যাট কামিন্স ও নাথান লায়ন অস্ট্রেলিয়ার হয়ে ৫৫ রান যোগ করেন। এবিপি আনন্দ এখন টেলিগ্রামেও, ক্লিক করুন এই লিঙ্কে https://t.me/abpanandaofficial আরও পড়ুন: লেখার দক্ষতা বাড়াতে কোন কোন দিকে খেয়াল রাখতে হবে? var _fireSc=!0;document.addEventListener(\"scroll\",(e=>{if(_fireSc){var c=document.createElement(\"script\");c.src=\"//asset.fwpub1.com/js/storyblock.js\",c.async=!0,document.getElementsByTagName(\"head\")[0].appendChild(c),_fireSc=!1}}));","pubDate":"2023-06-20 18:29:11","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/06/20/81b0283dff1c0b903e99ad2faf99f65b1687285680179507_original.jpg","source_id":"abplive","category":["sports"],"country":["india"],"language":"Bengali"},{"title":"Australia hold off late England charge to win first Ashes Test in thrilling finale","link":"https://www.theguardian.com/sport/2023/jun/20/england-australia-ashes-first-test-day-five-match-report-cricket","keywords":["Ashes 2023","The Ashes","England cricket team","Australia cricket team","Australia sport","Cricket","Sport"],"creator":["Ali Martin at Edgbaston"],"video_url":null,"description":"First Test: England 393-8 & 273; Australia 386 & 282-8Pat Cummins and Nathan Lyon dig in for two-wicket winAt the end of a final day packed with pressure and palpitations it was Australia who emerged victorious. The old fable of the tortoise and the hare just about held firm as they chased down 281 to beat England by two wickets and secure a 1-0 lead in this red-hot Ashes series. Those numbers tell little of the drama.This was a famous victory for Pat Cummins and his world champions, the captain the hero when at 7.21pm and with four overs left – ice in his veins and a gutsy sidekick in Nathan Lyon – a guide to third man off Ollie Robinson was fumbled over the rope by Harry Brook. Reaching 282 for eight from 92.3 overs, it completed an epic chase that left nerves utterly shredded. Continue reading...","content":"At the end of a final day packed with pressure and palpitations it was Australia who emerged victorious. The old fable of the tortoise and the hare just about held firm as they chased down 281 to beat England by two wickets and secure a 1-0 lead in this red-hot Ashes series. Those numbers tell little of the drama. This was a famous victory for Pat Cummins and his world champions, the captain the hero when at 7.21pm and with four overs left – ice in his veins and a gutsy sidekick in Nathan Lyon – a guide to third man off Ollie Robinson was fumbled over the rope by Harry Brook. Reaching 282 for eight from 92.3 overs, it completed an epic chase that left nerves utterly shredded. Bold or brainless? Debate Ben Stokes’s tactics but don’t expect him to change | Andy Bull Read more Cummins and Lyon had come together an hour earlier with England in the ascendancy and Ben Stokes, a constant source of energy for his side, eyeing up his 12th win as captain. Joe Root had somehow clung on to a bullet return catch off Alex Carey’s bat that left Australia 227 for eight, 54 runs short of their goal. Edgbaston was in full voice at this stage, the Hollies Stand goading the tourists and their pockets of supporters with the kind of triumphalism that was positively ripe to turn red-faced. Not that the conclusion was sour. Far from it. This fifth sellout crowd left with memories galore and a final twist to digest as over the course of 11 gripping overs under lights Cummins and Lyon repelled the second new ball and worked the gaps like a couple of pros. They sealed their country’s highest successful run chase since Cummins struck the winning blow of 310-run target in Johannesburg on his debut 12 years ago. Fifty caps later, the blue-eyed Blue Mountains boy has done it again. The coup de grace this time was unreflective of a fielding display from England that was tigerish throughout; a contributing factor to the pressure cooker the ground had become. Once the valve was released with Brook’s fumble, Cummins enveloped Lyon in an almighty bear hug, the pair 44 and 16 not out respectively and the toast of an away dressing room that was bouncing. The two teams soon shared smiles and handshakes, all combatants seeing the bigger picture of this classic Test finish. Among them was Usman Khawaja, no doubt keen to raise a glass of ice-cold diet Coke to his lips once more. The opener was named player of the match, having followed his first innings 141 with a similarly adhesive 65 that kept Australia in the hunt. The 36-year-old, riding what has become a remarkable late crest in his career, batted on all five days, faced 518 balls and spent 796 minutes out in the middle. All in a thick cable-knit tank top. Usman Khawaja looks back after being dismissed by Ben Stokes. Photograph: Mike Egerton/PA On another day Khawaja’s demise might have been the moment that commanded the headlines. At 5.29pm, short of options before the second new ball’s arrival, Stokes brought himself on to bowl for the first time in the innings. Charging to the crease in defiance of that left knee injury, he sent down a smart slower ball that cannoned into the stumps off the inside edge. With Australia 209 for seven it appeared another case of Stokes bending the script to his will. skip past newsletter promotion Sign up to The Spin Free weekly newsletter Subscribe to our cricket newsletter for our writers' thoughts on the biggest stories and a review of the week’s action Privacy Notice: Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion England relied on vibes and sprites when Cummins went a little Bazball | Jonathan Liew Read more But that wickets column was deceptive all day, Australia’s deployment of a nightwatchman the previous evening – Scott Boland – creating the illusion. At 2.15pm, after morning rain, Boland had walked out alongside Khawaja, with the score 107 for three and needing 174 runs in 67 overs. It soon became clear Australia would be putting their supporters back home into a state of sleep-deprived delirium. In the first hour 21 runs were chiselled off the target – a mere 13 from the bat – and Stuart Broad removing Boland for his third wicket of the innings. When Moeen Ali was thrown the ball in the 15th over of this opening session, removing the typically aggressive Travis Head for 16 with a ball that gripped and found the left-hander’s edge, Australia’s 143 for five did not quite reflect the depth to come. It was a fine delivery in an otherwise forlorn showing from Moeen, that burst blister on his spinning finger leaving him a passenger in the main. Had the skin on that digit been hard and durable from regular first‑class cricket, not red and raw after a 33-over first innings straight out of Test retirement, Stokes would have been able to turn to a spinner with the best fourth‑innings strike-rate of any to claim more than 50 wickets. This England team do not appear to do regrets, so to claim they will rue the SOS to Moeen would be false. Similarly, come the second Test at Lord’s next Wednesday they will not be turning back on the decision to restore Jonny Bairstow behind the stumps, even if three missed chances in Australia’s first innings – and an edge off Khawaja that flew between keeper and first slip late on day four – proved costly. That day one declaration? All part of the entertainment, said an unrepentant Stokes. Pat Cummins celebrates with Nathan Lyon after their match-winning 55-run partnership. Photograph: Stu Forster/Getty Images This final day certainly had it in spades, be it Robinson’s dramatic removal of Cameron Green for 28, bowled off the inside edge, the tension that built as Australia declined to take on Root’s bowling or the spectacular one‑handed effort from Stokes in the deep off Lyon that popped out of his grasp. With 36 runs to get at that stage, and Josh Hazlewood next man in at No 11, it would have been telling. As it was, England met an Australian team prepared to meet fire with ice and a captain embodying this in Cummins. The tourists scored at 3.2 runs per over to the home side’s 4.61 and you have to go back to 1904, when England (2.30) beat Australia (3.81) at Melbourne, for the only time the difference was greater. The tortoises lead 1-0 and this culture clash Ashes series is off to an incredible start.","pubDate":"2023-06-20 18:23:39","image_url":"https://i.guim.co.uk/img/media/19aad83d6d05bd141846064e8811da6957a56e89/0_168_4000_2400/master/4000.jpg?width=460&quality=85&auto=format&fit=max&s=e9fad5fc8de00619a5f33a27dd6493c0","source_id":"theguardian","category":["sports"],"country":["australia"],"language":"english"}]}