{"newsArray":[{"title":"4 World Cups in 4 years: Aussie is ‘unstoppable’","link":"https://www.couriermail.com.au/sport/cricket/pretty-wild-england-coach-matthew-mott-wins-fourth-world-cup-title-in-four-years/news-story/a406896b5817e73261624732debefb8b","keywords":["Cricket news and galleries","Kayo","Sport news and galleries","World Twenty20"],"creator":null,"video_url":null,"description":"After winning his fourth World Cup title in four years on Sunday evening, Matthew Mott is quickly establishing himself as one of the most successful white-ball coaches in history.","content":"Less than six months after being appointed head coach of the England men’s one-day team, Mott has helped the Three Lions secure its second T20 World Cup title, becoming just the second nation to achieve the feat.England defeated Pakistan by five wickets in front of 80,462 fans at the MCG to become the first men’s team in history to possess the ODI and T20 World Cups simultaneously.Watch the Weber WBBL. Every game live and ad-break free during play on Fox Cricket, available on Kayo. New to Kayo? Start your free trial now >Three Australians have been pulling the strings in the background, with Mott, batting coach Michael Hussey and bowling coach David Saker guiding England to unprecedented World Cup glory.The T20 tournament was the first major challenge for Mott and newly-appointed captain Jos Buttler, and their partnership will be crucial ahead of next year’s World Cup in India.“With Matthew Mott we can hopefully shape the next era of English white-ball cricket,” Buttler told reporters at the MCG on Saturday.“We’re still reaping the rewards of (former captain) Eoin Morgan’s tenure and the changes that have happened in the white-ball game in England.“We’re very much right in the back of that wave, but there’s a bit of a new direction as well.”It was only this year that Mott was celebrating his previous World Cup triumph, leading the Australian women’s team to the 50-over title in New Zealand in April.During his seven-year tenure, the former Queensland and Victoria opener transformed a talented Australian squad into an unbeatable one, winning two T20 World Cup titles, three Ashes series and two ICC Women’s Championships.Under his guidance, Australia also broke the all-time record for most consecutive ODI victories, winning 26 straight matches between 2018 and 2021.But the undisputed highlight of Mott’s reign as Australian coach came in March 2020, when Meg Lanning and her teammates toppled India in front of a record-breaking crowd of 86,174 at the MCG.Remarkably, having achieved the same feat two years later, albeit with a different team, Mott is now the reigning champion coach for the men’s and women’s T20 World Cups.“It‘s very special,” Mott after Sunday’s victory.“You never like to compare any of them, they‘re all equally fun, and great but I’m going to really enjoy tonight with the boys.”Mott’s influence was evident leading into the tournament, backing Big Bash League alumni Alex Hales to replace the injured Jonny Bairstow.Hales had been black-listed from representing his country for three years after a series of off-field misdemeanours, but his inclusion proved a masterstroke.The 33-year-old plundered 212 runs at 42.40 with a strike rate of 147.22 in the tournament, booking England’s place in the finale with a record-breaking partnership alongside Buttler against India in the semi-final.Mott also threw his support behind Ben Stokes and Sam Curran, who many considered not to be in England’s best starting XI before the tournament, and his trust paid dividends on Sunday,Stokes scored an unbeaten half-century in the run chase and Curran conceded just 12 runs from four overs in the must-win final, with their performances proving the difference.“Over your coaching journey your learn off a lot of other people and reflect a lot,” Mott told SEN in the lead-up to Sunday’s final.“Being at the right place at the right time is a pretty good strategy.“I’ve worked with some outstanding players over my time with the Australian women’s team, and this is an incredible generation of white-ball cricketers here with England.”Mott’s next challenge in a three-match ODI series against Australia on foreign soil, which gets underway at Adelaide Oval on Thursday afternoon.","pubDate":"2022-11-14 01:50:00","image_url":null,"source_id":"couriermail","country":["australia"],"category":["sports"],"language":"english"},{"title":"Unheralded Aussie’s ‘obscene’ World Cup feat","link":"https://www.themercury.com.au/sport/cricket/pretty-wild-england-coach-matthew-mott-wins-fourth-world-cup-title-in-four-years/news-story/a406896b5817e73261624732debefb8b","keywords":["Cricket news and galleries","Kayo","Sport news and galleries"],"creator":null,"video_url":null,"description":"After winning his fourth World Cup title in four years on Sunday evening, Matthew Mott is quickly establishing himself as one of the most successful white-ball coaches in history.","content":"Less than six months after being appointed head coach of the England men’s one-day team, Mott has helped the Three Lions secure its second T20 World Cup title, becoming just the second nation to achieve the feat.England defeated Pakistan by five wickets in front of 80,462 fans at the MCG to become the first men’s team in history to possess the ODI and T20 World Cups simultaneously.Watch the Weber WBBL. Every game live and ad-break free during play on Fox Cricket, available on Kayo. New to Kayo? Start your free trial now >Three Australians have been pulling the strings in the background, with Mott, batting coach Michael Hussey and bowling coach David Saker guiding England to unprecedented World Cup glory.The T20 tournament was the first major challenge for Mott and newly-appointed captain Jos Buttler, and their partnership will be crucial ahead of next year’s World Cup in India.“With Matthew Mott we can hopefully shape the next era of English white-ball cricket,” Buttler told reporters at the MCG on Saturday.“We’re still reaping the rewards of (former captain) Eoin Morgan’s tenure and the changes that have happened in the white-ball game in England.“We’re very much right in the back of that wave, but there’s a bit of a new direction as well.”It was only this year that Mott was celebrating his previous World Cup triumph, leading the Australian women’s team to the 50-over title in New Zealand in April.During his seven-year tenure, the former Queensland and Victoria opener transformed a talented Australian squad into an unbeatable one, winning two T20 World Cup titles, three Ashes series and two ICC Women’s Championships.Under his guidance, Australia also broke the all-time record for most consecutive ODI victories, winning 26 straight matches between 2018 and 2021.But the undisputed highlight of Mott’s reign as Australian coach came in March 2020, when Meg Lanning and her teammates toppled India in front of a record-breaking crowd of 86,174 at the MCG.Remarkably, having achieved the same feat two years later, albeit with a different team, Mott is now the reigning champion coach for the men’s and women’s T20 World Cups.“It‘s very special,” Mott after Sunday’s victory.“You never like to compare any of them, they‘re all equally fun, and great but I’m going to really enjoy tonight with the boys.”Mott’s influence was evident leading into the tournament, backing Big Bash League alumni Alex Hales to replace the injured Jonny Bairstow.Hales had been black-listed from representing his country for three years after a series of off-field misdemeanours, but his inclusion proved a masterstroke.The 33-year-old plundered 212 runs at 42.40 with a strike rate of 147.22 in the tournament, booking England’s place in the finale with a record-breaking partnership alongside Buttler against India in the semi-final.Mott also threw his support behind Ben Stokes and Sam Curran, who many considered not to be in England’s best starting XI before the tournament, and his trust paid dividends on Sunday,Stokes scored an unbeaten half-century in the run chase and Curran conceded just 12 runs from four overs in the must-win final, with their performances proving the difference.“Over your coaching journey your learn off a lot of other people and reflect a lot,” Mott told SEN in the lead-up to Sunday’s final.“Being at the right place at the right time is a pretty good strategy.“I’ve worked with some outstanding players over my time with the Australian women’s team, and this is an incredible generation of white-ball cricketers here with England.”Mott’s next challenge in a three-match ODI series against Australia on foreign soil, which gets underway at Adelaide Oval on Thursday afternoon.","pubDate":"2022-11-14 01:17:00","image_url":null,"source_id":"mercury","country":["australia"],"category":["sports"],"language":"english"},{"title":"How Maxwell’s freak injury occurred at 50th birthday bash - Courier Mail","link":"https://news.google.com/__i/rss/rd/articles/CBMijwFodHRwczovL3d3dy5jb3VyaWVybWFpbC5jb20uYXUvc3BvcnQvY3JpY2tldC9nbGVubi1tYXh3ZWxsLWJyZWFrcy1sZWctYWZ0ZXItZnJlYWstaW5qdXJ5LWF0LWEtcGFydHkvbmV3cy1zdG9yeS9kNjZjOTY1ZjE5ZTk3YWIzNzg2ZGY0ZGZhNDk4NWM3MdIBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"How Maxwell’s freak injury occurred at 50th birthday bash  Courier Mail‘Freak accident’: Aussie cricketer breaks leg  news.com.auGlenn Maxwell to miss months of cricket after breaking leg in freak party accident  ABC NewsMaxwell breaks a leg in freak accident  Sydney Morning HeraldHuge Aussie blow as Maxwell breaks his leg in ‘freak’ injury at birthday party  Fox SportsView Full coverage on Google News","content":null,"pubDate":"2022-11-13 23:02:51","image_url":null,"source_id":"google","country":["australia"],"category":["sports"],"language":"english"},{"title":"England crowned the undisputed white ball champs","link":"https://www.themercury.com.au/sport/cricket/england-crowned-the-undisputed-white-ball-champs/video/f5b2c0f6e49dbacde7240f1e78b06c40","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket: England have cemented their status as the undisputed champions of white ball cricket after claiming the 2022 T20 World Cup following a 5-wicket win over Pakistan.","content":"Cricket: England have cemented their status as the undisputed champions of white ball cricket after claiming the 2022 T20 World Cup following a 5-wicket win over Pakistan.","pubDate":"2022-11-13 21:45:20","image_url":null,"source_id":"mercury","country":["australia"],"category":["sports"],"language":"english"},{"title":"Pakistan will win the World Cup in India, says Shoaib Akhtar","link":"https://www.firstpost.com/firstcricket/sports-news/pakistan-will-win-the-world-cup-in-india-says-shoaib-akhtar-11621691.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"Pakistan will win the World Cup in India, says Shoaib Akhtar","content":"Cricket Pakistan will win the World Cup in India, says Shoaib Akhtar Shoaib Akhtar was all praised of Pakistan despite their loss in the T20 World Cup final against England in Melbourne on Sunday. FirstCricket Staff November 14th, 2022 1:55:46 IST Shoaib Akhtar speaks in a video shared by him on his official Twitter handle after Pakistan's defeat against England during T20 World Cup final. Former Pakistan express pacer Shoaib Akhtar wished not to criticise the Babar Azam-led side after loss to England in T20 World Cup final in Melbourne on Sunday saying that he was pleased to see the way Pak bowlers fought back against England defending a low total and doing so consistently in the tournament as well. T20 World Cup Home | Schedule | Results | Points Table | T20 World Cup News | Photos “Well done Pakistan bowling. You have done well throughout the World Cup and got Pakistan to the final. There was luck involved but you have played well Pakistan,” Akhtar said in a video posted on his official Twitter handle. The 47-year-old ex-cricketer, who played 163 ODIs and 46 Tests for Pakistan, said the turning point while defending 138 was the injury to Shaheen Afridi which allowed England to take a sigh of relief. Akhtar asked the team to take inspiration from the fact that England’s batting hero Ben Stokes. “The turning point was Shaheen’s injury, but no worries, do not put your head down. Remember that Ben Stokes was hit also hit for 4 sixes in the 2016 World Cup and today he has won the World Cup,” Akhtar said. Dil dukha hai lekin, toota toh nahi hai. pic.twitter.com/E9fFbpECZe — Shoaib Akhtar (@shoaib100mph) November 13, 2022 Before ending the video Akhtar said if God is willing, they will lift the ODI World Cup in India. “Don’t worry Pakistan, I am standing with you, yes it hurts, but we as a nation are there by your side. Inshallah, we will win the World Cup in India,” Akhtar concluded. Read all the Latest News , Trending News , Cricket News , Bollywood News , India News and Entertainment News here. Follow us on Facebook , Twitter and Instagram . Updated Date: November 14, 2022 01:55:46 IST Tags: Cricket Pakistan Vs England Shoaib Akhtar T20 World Cup Find latest and upcoming tech gadgets online on Tech2 Gadgets. Get technology news, gadgets reviews & ratings. Popular gadgets including laptop, tablet and mobile specifications, features, prices, comparison.","pubDate":"2022-11-13 20:25:46","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/11/Shoaib-Akhtar.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"T20 WC | Harry Kane congratulated the England cricket team on winning the title","link":"https://thenewsglory.com/t20-wc-harry-kane-congratulated-the-england-cricket-team-on-winning-the-title/","keywords":["Sports","Cricket","England","India","T20 WC","T20 World Cup."],"creator":["The News Glory"],"video_url":null,"description":"England cricket team has won the title of champion in the ongoing T20 World Cup series. Football captain Harry Kane has congratulated his country’s cricket team for winning the World Cup. The Football World Cup series is going to be held in Qatar very soon. It is noteworthy that the English team is going to […]","content":"England cricket team has won the title of champion in the ongoing T20 World Cup series. Football captain Harry Kane has congratulated his country’s cricket team for winning the World Cup. The Football World Cup series is going to be held in Qatar very soon. It is noteworthy that the English team is going to participate in this. “Congratulations!!! You have done a great job. “You have made the country proud,” said Harry Kane. Earlier, Jos Buttler said, “If we win the title, it will give England football a boost in the FIFA World Cup.” As he said, now the England cricket team has won the trophy. In the last 2018 FIFA World Cup series, England led by Harry Kane advanced to the semi-finals. They lost the match 1-2 to Croatia. However, Harry Kane, who scored the goals, won the Golden Boot. England have been placed in ‘Group B’ of the Qatar World Cup. Iran, USA and Wales are in the same category. However, the team is expected to advance to the round of 16. The team made it to the finals of last year’s Euro Cup series.","pubDate":"2022-11-13 20:18:15","image_url":null,"source_id":"thenewsglory","country":["india"],"category":["sports"],"language":"english"},{"title":"T20 World Cup final: How Babar Azam fell into Adil Rashid's googly trap? Explain Misbah Ul-Haq, Shoaib Malik","link":"https://www.firstpost.com/firstcricket/sports-news/t20-world-cup-final-how-babar-azam-fell-into-badil-rashid-googly-trap-explain-misbah-ul-haq-shoaib-malik-11621571.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"T20 World Cup final: How Babar Azam fell into Adil Rashid's googly trap? Explain Misbah Ul-Haq, Shoaib Malik","content":"Cricket T20 World Cup final: How Babar Azam fell into Adil Rashid's googly trap? Explain Misbah Ul-Haq, Shoaib Malik Adil Rashid bowled a crucial 2/22 spell in the T20 World Cup final, claiming the big wickets of Babar Azam and Mohammad Harris as England defeated Pakistan by five wickets to win the final. FirstCricket Staff November 14th, 2022 1:39:52 IST Adil Rashid (far left) celebrates with teammate after dismissing Babar Azam (far right) during Pakistan vs England T20 World Cup final in Melbourne on Sunday. AP England defeated Pakistan by five wickets in the T20 World Cup final in Melbourne on Sunday. English spinner Adil Rashid’s 2/22 spell was considered crucial in turning the tide in England’s favour as the spinner dismissed a set Babar Azam. T20 World Cup Home | Schedule | Results | Points Table | T20 World Cup News | Photos The 34-year-old leg spinner bowled a wicket-maiden over in the 12th over of the match as he dismissed the Pakistan skipper, who scored 28-ball 32. The wicket came at a time when Pakistan’s innings gained momentum with 16 runs in the prior over bowled by Liam Livingstone. The dismissals spiral effect saw Pakistan go 84/2 in the 12th over to 137/8 in a dismal batting display. Azam was criticised by former India spinner Harbhajan Singh for getting out of a soft dismissal. It was a short-length googly that was lobbed by a dumbstruck Azam back to Rashid for a diving catch as the batter was too late to adjust his cut shot. View this post on Instagram A post shared by ICC (@icc) Former Pakistan captains Shoaib Malik and Misbah Ul-Haq explained how Azam fell into Rashid’s trap the moment he failed to read the googly. “Once you are not reading some from the hand, you must not play the bowler square of the wicket. It’s important to play the bowler with a straight bat. This is a discussion we often did while facing (Srilanka’s Wanindu) Hasaranga but somehow our batsmen still want to play square of the wicket every time the ball falls short. Ek to read nahi hota, upar se cut marne chale jate hain (They fail to read and then want to play the cut shot),” said Misbah, who coached the national team in 2019-21. Another former Pakistan captain Shoaib Malik felt Pakistan batters needed to be more aggressive against spinners or else they will get under their skin. “Boundaries at the front were smaller, Azam could have attacked Rashid if he balls in the air. Jahaan usne mujhe acchi jagah be ball kia me usko utha ke samne marunga. So that he is afraid to bowl me in the good areas. You have to force them to bowl in the areas where you get to rotate the strike. You have to instill fear inside the bowler or else they won’t even give you a single,” said Malik. Read all the Latest News , Trending News , Cricket News , Bollywood News , India News and Entertainment News here. Follow us on Facebook , Twitter and Instagram . Updated Date: November 14, 2022 01:39:52 IST Tags: Cricket Pakistan Vs England T20 World Cup T20 World Cup England Find latest and upcoming tech gadgets online on Tech2 Gadgets. Get technology news, gadgets reviews & ratings. Popular gadgets including laptop, tablet and mobile specifications, features, prices, comparison.","pubDate":"2022-11-13 20:09:52","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/11/Adil-Rashid-Pakistan-vs-England-T20-World-Cup-final.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"‘Heartbreaking’ moment decides WC Final","link":"https://www.couriermail.com.au/sport/cricket/brutal-shaheen-afridi-moment-ruins-pakistans-chances-in-t20-world-cup-final/news-story/063975d8c00a50894ebcfe346a9e67aa","keywords":["Cricket news and galleries","Kayo","World Twenty20"],"creator":null,"video_url":null,"description":"Pakistan can take pride in getting to the World Cup final but now their young team must take the next step – learning how to close out tight games, said batsman Shan Masood on Sunday.","content":"Babar Azam’s men pushed England all the way at the Melbourne Cricket Ground but fell to a five-wicket defeat with six balls remaining after setting a below-par 138-run target to win.Masood top-scored with 38 and said he took responsibility for not staying around longer to put together a bigger total.“There were stages especially with the bat that we could have finished things off really well,” he said.“Personally, I take blame for it. We were aiming for 170 and having looked at the way the innings ended, we could have used a batsman staying in and getting us to at least 155-160, which would have been good on that pitch.” Instead they fell short, leaving it up to their renowned pace attack to blunt England – but in the 13th over that plan was blown up by a brutal moment in the field. Watch the Weber WBBL. Every game live and ad-break free during play on Fox Cricket, available on Kayo. New to Kayo? Start your free trial now >The hearts of Pakistani fans sunk as strike bowler Shaheen Afridi injured his right knee while catching Harry Brook in the deep.The 22-year-old limped off the field before returning soon after, having popped a couple of painkillers, but gingerly hobbled back to the sheds one delivery into his second spell.“We could have done with his two overs at the end,” Masood said. “I hope he is OK. It’s his knee. From what I am hearing all his ligament tests are clear.”Onlookers knew straight away Pakistan’s chances of victory had been dashed by the setback.Against a limited bowling attack Ben Stokes’s unbeaten 52 was enough to see his team to a second T20 World Cup triumph following their 2010 victory.Despite the defeat, Pakistan’s performance in Australia exceeded expectations after they lost their first two matches in the Super 12 to India and Zimbabwe and scraped into the semi-finals courtesy of South Africa’s shock defeat to the Netherlands a week ago.Masood said the young team had a bright future, but needed to learn how to win the tight moments.“The games that we won, we won them quite comfortably,” he said. “The good sign is that when we lost, we lost close games. So you realise that these things are in your own hands.“The three games we lost to India, Zimbabwe and now England there were opportunities where we could have closed out those games.“I think the next step this young team has to take is finishing games, finishing out close moments.“But I just feel the way Babar is leading this team, the leadership group in Shadab (Khan) and (Mohammad) Rizwan, I’ve got no doubts that with future World Cups coming this side will be a constant threat and among the top teams.”- With news.com.au","pubDate":"2022-11-13 19:45:00","image_url":null,"source_id":"couriermail","country":["australia"],"category":["sports"],"language":"english"},{"title":"T20 World Cup: Stokes, Curran star as England beat Pakistan by 5 wickets to win T20 World Cup","link":"https://kashmirreader.com/2022/11/14/t20-world-cup-stokes-curran-star-as-england-beat-pakistan-by-5-wickets-to-win-t20-world-cup/","keywords":["SPORTS"],"creator":["Press Trust of India"],"video_url":null,"description":"MELBOURNE: Ben Stokes and Sam Curran starred as England edged Pakistan by five wickets to win the Twenty20 World Cup on Sunday and become the sport’s first dual white-ball champions, holding both the 50 and 20-over titles. Jos Buttler’s side held Pakistan to 137-8 in front of a partisan 80,462 fans at a heaving Melbourne […]","content":"MELBOURNE: Ben Stokes and Sam Curran starred as England edged Pakistan by five wickets to win the Twenty20 World Cup on Sunday and become the sport’s first dual white-ball champions, holding both the 50 and 20-over titles. Jos Buttler’s side held Pakistan to 137-8 in front of a partisan 80,462 fans at a heaving Melbourne Cricket Ground, with player-of-the-match Curran bagging 3-12 and Adil Rashid chipping with 2-22. In reply, England slumped to 49-3 in the sixth over as they struggled to get any momentum against a fiery pace attack, with boundaries hard to come by. But Stokes (52 not out) and Moeen Ali (19) used their experience and cool heads to guide England to 138-5 with six balls to spare, climaxing a riveting tournament that spanned 45 games over nearly a month. The victory added to the 50-over title England won in 2019, building on the legacy of former captain Eoin Morgan, who retired this year after transforming the team into a white-ball juggernaut. It was England’s second T20 crown after tasting success in 2010, joining the West Indies as the only two-time winners since the tournament’s inception in 2007. The game was billed as a showdown between Pakistan’s attack and England’s top order, and Shaheen Afridi bowled danger man Alex Hales in the first over of the run chase. But that only fired up Buttler who smashed two boundaries off Naseem Shah. Phil Salt, playing in place of the injured Dawid Malan, didn’t last, making just 10 before pulling Haris Rauf to Iftikhar Ahmed. The ball was swinging and seaming and the menacing Rauf claimed the key wicket of Buttler just as he was getting in, edging to wicketkeeper Mohammad Rizwan on 26 off 17 balls. The runs dried up and Harry Brook needed treatment for a blow to his elbow but he soldiered on as they reached 77-3 at the halfway point of the innings, compared to Pakistan’s 68-2. Brook came undone on 20 against the spin of Shadab Khan, holing out to Afridi as he tried to get the scoreboard moving. It came down to needing 41 runs off the final five overs. Stokes relieved the pressure with a four and a six off Ahmed and there was no stopping them with the England all-rounder hitting the winning runs. With forecast rain staying away, England produced disciplined and economical bowling to stymie 2009 champions Pakistan, with Shan Masood’s 38 the top score. Stokes was given the new ball after England won the toss and choise to field with Pakistan lucky to survive the over intact as opener Rizwan was almost run out going for a risky single. Rizwan and Babar Azam shared a century partnership in their semi-final against New Zealand, but another big stand wasn’t to be, with Rizwan dragging a delivery from Curran on to his stumps on 15. The introduction of Rashid soon after the six-over powerplay reaped an immediate reward with Mohammad Haris (8) attacking him on his first ball only to sky a simple catch to Stokes. Masood began swinging the bat in the second half of the innings, hitting a four and six off Liam Livingstone. But once again Rashid got the breakthrough, pulling off a diving catch from his own bowling to claim the vital wicket of Azam, whose 32 came off 28 balls. Ahmed only lasted six balls before Masood and Shadab Khan (20) fell in the space of two runs as Curran and Chris Jordan kept the lid on any hope Pakistan had of a late flurry. —Agencies T20 World Cup: Stokes, Curran star as England beat Pakistan by 5 wickets to win T20 World Cup added by Press Trust of India on 1:08 am November 14, 2022 View all posts by Press Trust of India → Press Trust of India Facebook Twitter WhatsApp Email Print Related","pubDate":"2022-11-13 19:38:19","image_url":null,"source_id":"kashmirreader","country":["india"],"category":["sports"],"language":"english"},{"title":"Afghanistan govt has in principle agreed to resume women’s cricket, says ICC","link":"https://kashmirreader.com/2022/11/14/afghanistan-govt-has-in-principle-agreed-to-resume-womens-cricket-says-icc/","keywords":["SPORTS"],"creator":["Press Trust of India"],"video_url":null,"description":"Dubai: The ICC on Sunday said the Afghanistan government supports the world body’s constitution and has “in principle” agreed to resuming women’s cricket in the country. Afghanistan cricket, especially the women’s game, had plunged into uncertainty last year due to the drastic changes in the political landscape following the takeover of the country by the […]","content":"Dubai: The ICC on Sunday said the Afghanistan government supports the world body’s constitution and has “in principle” agreed to resuming women’s cricket in the country. Afghanistan cricket, especially the women’s game, had plunged into uncertainty last year due to the drastic changes in the political landscape following the takeover of the country by the Taliban. There were reports that Afghan women, including the country’s women’s cricket team, were banned from playing sport under the Taliban administration. The ICC had then set up a Working Group to review the status of cricket in the country. The Board received an update from the Afghanistan Working Group detailing a recent meeting with a representative of the Afghanistan government and the Afghanistan Cricket Board in Doha. The government official reiterated their commitment to fully respect and comply with the ICC constitution, in particular the need for diversity and inclusivity and for the ACB to operate independent from government interference, the ICC said. “The meeting was positive and respectful and the government representative was clear in his support for the ICC constitution including in principle for women’s cricket in Afghanistan,” Working Group Chair Imran Khwaja said. “There are obviously challenges for it to resume but we will continue to work with the ACB to take this forward. “The Working Group will closely monitor the commitment undertaken by the Afghanistan government and will continue to report back to the ICC Board.” It is an ICC requirement for full members to also have a national women’s team, besides the men’s side. Afghanistan is one of the full members of the ICC. The Afghanistan’s men team took part in the 2021 and 2022 T20 World Cup. The Working Group also includes Ross McCollum (Ireland chair), Ramiz Raja (Pakistan chair) and Lawson Naidoo (SA chair). —PTI Afghanistan govt has in principle agreed to resume women’s cricket, says ICC added by Press Trust of India on 1:07 am November 14, 2022 View all posts by Press Trust of India → Press Trust of India Facebook Twitter WhatsApp Email Print Related","pubDate":"2022-11-13 19:37:44","image_url":null,"source_id":"kashmirreader","country":["india"],"category":["sports"],"language":"english"},{"title":"England crowned T20 World champions","link":"https://thenorthlines.com/england-crowned-t20-world-champions/","keywords":["Cricket","Sports"],"creator":["Northlines"],"video_url":null,"description":"Age ncies England&#39;s golden generation of white ball cricketers overcame a spirited Pakistan to lift the T20 World Cup trophy with a comfortable five-wicket victory in Melbourne on Sunday. The Pakistani fans were longing for an encore of 1992 when Imran Khan&#39;s team created history at this very venue but batting let Babar Azam&#39;s side […] The post England crowned T20 World champions appeared first on Northlines.","content":"Age ncies England's golden generation of white ball cricketers overcame a spirited Pakistan to lift the T20 World Cup trophy with a comfortable five-wicket victory in Melbourne on Sunday. The Pakistani fans were longing for an encore of 1992 when Imran Khan's team created history at this very venue but batting let Babar Azam's side down as 137 for 8 was never going to be good enough. The seasoned Ben Stokes (52 not out off 49 balls) just like the 2019 ODI World Cup, anchored the chase despite occasional scratchiness and had a calm Moeen Ali (19) as an ideal foil. They chased down the target in 19 overs to regain the title they had won in 2010 in the West Indies. Experienced Haris Rauf and young Nasim Shah bowled their hearts out to prevent it from becoming a one-sided game but Stokes soaked the pressure along with Ali as the duo put on a 48-run stand for the fifth wicket to nail the win that avenged England's loss to the same rivals in the '92 World Cup final. Shaheen Shah Afridi also could not bowl his full quota of overs after suffering a hamstring injury while fielding and that too helped England. But player of the evening certainly was left-arm seamer Sam Curran, whose couple of spells had heavily tilted the game in the favour England. Shane Warne had tormented Pakistan at the MCG in the 1999 final and it was turn of another leggie Adil Rashid to flummox them. Stokes took 30 balls to measure the Pakistani attack but with no scoreboard pressure, the southpaw pressed the accelerator just when needed to finish the match. England's depth in resources could be gauged from the fact that they became the champions despite not having Dawid Malan, Mark Wood in the knock-out games and Jonny Bairstow, a T20 superstar in the form of his life, was not available for the tournament. It was seven years back in this very country that England's limited overs cricket lay in tatters with a dated approach and lack of intent being pointed as the reason for a group league exit from the ODI World Cup. The core of the team was changed along with the mindset and in three years time, England now have both the white ball titles in their closet having identified match-winners in this format. The revolution was started by an Irishman who responded to the name of Eoin Morgan. He moulded the ODI team into a champion outfit and handed the T20 baton to an able Gen-Next leader in Jos Buttler. A champion T20 player in his own right, Buttler in the past few months, has proved to be a leader of men and in fact put Pakistan under immense pressure with his heart-warming humility. The MCG rooted for Pakistan but no one grudged when Stokes pumped his fists after what had been an incredibly difficult few years, battling depression and mental health issues. In front of an audience of 80,462, two highly-rated but not enough celebrated T20 bowlers Curran and Rashid scripted the win. The duo put relentless pressure on the Pakistan batting line-up to restrict the opposition to a below-par 137 for eight. Curran, who made comeback from an injury earlier this year, has been England's ‘go to' bowler in the competition and he proved that on the big stage with brilliant figures of 4-0-12-3. The wily Rashid (4-1-22-2) wasn't going to be left far behind as he choked the run-flow in the middle overs with as many as 25 dot balls between him and Curran. Rashid, with his stupendous effort, time and again showed how the Indian team management bungled its script by letting Yuzvendra Chahal cool his heels throughout the tournament. The MCG track had enough bounce and pace but Buttler's best performing bowling duo (Curran and Rashid) did exactly the opposite – take the pace off their deliveries. Rashid flighted and lowered his pace to 75 kmph while Curran bowled between 126 kmph to 130 kmph which made run scoring difficult for the Pakistani batters.","pubDate":"2022-11-13 19:05:42","image_url":null,"source_id":"thenorthlines","country":["india"],"category":["sports"],"language":"english"},{"title":"How born-again Khawaja finally found his place","link":"https://www.couriermail.com.au/sport/cricket/summer-of-cricket-202223-how-usman-khawaja-found-his-place-in-the-australian-test-team/news-story/2b135002d33bfd5962a559f1e33f905b","keywords":["Cricket news and galleries","Sport news and galleries"],"creator":null,"video_url":null,"description":"When Usman Khawaja returned from the 2013 Ashes tour, he thought he was done.","content":"Not only had he been dropped from the Australian team midway through a series the tourists lost 3-0, his desire to get back there had evaporated.“I came back to Queensland and I really didn’t want to play for Australia again,’’ said Khawaja. “I just didn’t enjoy my first nine Test matches.’’These are strong words. Imagine being 26-years-old, allegedly in the prime of your career, and hoping you DON’T get picked for Australia.But this was not a fun era. Trapped in the shadows of the great Australian teams who preceded them, the Michael Clarke led team was not a happy unit.And Khawaja’s batting average of 25 was below everyone’s expectations. He’d had eight scores between 20 and 40 which means he was getting out of the blocks – then faltering.SCBBL PROMOKhawaja knew one thing. If he chained his self-esteem to his cricket career, he would be in trouble. So he set it and himself free.“I have made a conscious effort not to let cricket dictate my happiness the last five, six or seven years.“Since I came back into the Australia team in 2015 I have had a different take on life and cricket. My performances after 2015 are two or three times what they were after my first nine Test matches.“In those early years even when I was scoring runs I wasn’t always happy so something wasn’t right. It wasn’t an easy time to be part of the Australian team. I just didn’t really feel liked I belonged.’’Born-again Khawaja was the Test match sensation of 2022 with 888 runs at 98 from seven Tests, after being recalled for the first time in three years a wiser, more relaxed man, who let the game come to him rather than snatching at it.“I have worked hard to ensure my satisfaction and gratitude does not come from me scoring runs. It comes from other things. Those things are not necessarily materialistic things or cricket itself. In the past if I was scoring runs I was happy. If I wasn’t I was kind of miserable.“Being in and out and in and out of the Australian team enables you develop a bit of resilience and learn a bit about life. You learn what you can control and what you can’t. You just enjoy the ride and realise there is going to be good and bad times.“The one thing you can control is how you react to certain situations.“There was a lot of water went under the bridge before I returned 2015 a better player with a tougher mindset. I wasn’t really expecting to play for Australia so I wasn’t holding on as tight as I was in the past. I still really love playing cricket but at the end of the day I am making sure I am going out and having fun with the boys.“I accept now that nothing lasts forever and you just have to enjoy the ride.’’“I am definitely less nervous at the crease. I think that comes with age. When you are young you are more nervous. You ride the highs and lows a bit. “I think it’s just perspective and having a family and things that happen in general life. As I am talking to you I am switching my daughter from one arm to the other. There is no one thing you can point your finger at. It is a lot of hard work over a long period of time.’’“I am a big believer in fate.’’","pubDate":"2022-11-13 19:00:00","image_url":null,"source_id":"couriermail","country":["australia"],"category":["sports"],"language":"english"},{"title":"T20 World Cup चैम्पियन इंग्लैंड के खिलाड़ियों ने MCG में मनाया जीत का जश्न, देखिए 8 यादगार तस्वीरें","link":"https://hindi.news18.com/photogallery/sports/cricket-after-becoming-t20-world-cup-champions-england-players-made-victory-celebration-at-mcg-memorable-4892899.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"PAK vs ENG Final England Cricket Team Wining Celebration: जॉस बटलर की अगुवाई में इंग्लैंड टीम ने पाकिस्तान को टी20 वर्ल्ड कप 2022 के फाइनल मुकाबले में करारी मात देकर खिताबी जीत हासिल की. पहली बार किसी ICC टूर्नामेंट में कप्तानी कर रहे बटलर के लिए इस जीत के मायने खास है. इंग्लिश टीम की इस जीत में बेन स्टोक्स की यादगार पारी का बड़ा योगदान रहा. मेलबर्न के ऐतिहासिक क्रिकेट ग्राउंड में इंग्लिश टीम की जीत के साथ ही मैदान पर जमकर जश्न मनाया. जैसे ही स्टोक्स ने विनिंग रन लिया, पूरी टीम बच्चों की तरह उछल पड़ी और स्टोक्स को गले लगाने की होड़ मच गई, इसके बाद खिलाड़ियों की फैमिली आई, बच्चे आए और सबने मिलकर जीत का इजहार किया. देखें जश्न की वायरल तस्वीरें...","content":null,"pubDate":"2022-11-13 18:38:29","image_url":"https://images.news18.com/ibnkhabar/uploads/2022/11/ben-stokes-world-champion11-16683644263x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","country":["india"],"category":["sports"],"language":"hindi"},{"title":"Indian billionaire wants to buy Liverpool FC","link":"https://thenewsglory.com/indian-billionaire-wants-to-buy-liverpool-fc/","keywords":["Sports"],"creator":["The News Glory"],"video_url":null,"description":"According to a media report, Indian billionaire Mukesh Ambani has expressed interest in buying Liverpool Football Club. Bloomberg news agency reported, quoting the British newspaper, The Mirror, that the chairman of the board of directors of Reliance Industries faces competition from other parties from the Middle East and the United States. The newspaper added that […]","content":"According to a media report, Indian billionaire Mukesh Ambani has expressed interest in buying Liverpool Football Club. Bloomberg news agency reported, quoting the British newspaper, The Mirror, that the chairman of the board of directors of Reliance Industries faces competition from other parties from the Middle East and the United States. The newspaper added that the “Fenway Sports” group, the current owner of Liverpool FC, had received several initial offers. According to the newspaper, which did not disclose its sources, the Fenway Sports Group wants to sell the club for 4 billion pounds. Ambani owns the Mumbai Indians cricket team, and also helped establish the Super League in India. Fenway Sports Group is working with Goldman Sachs and Morgan Stanley to assess buyer interest in the Premier League club. Fenway Sports Group bought Liverpool for 300 million pounds in 2010. Konrad Wiecek, an analyst at GlobalData, estimated that Liverpool could fetch more than $5 billion. Follow our latest local and sports news and the latest political and economic developments via Google news Share Print Facebook Twitter linkedin Pin interest Whats app","pubDate":"2022-11-13 18:22:42","image_url":null,"source_id":"thenewsglory","country":["india"],"category":["sports"],"language":"english"},{"title":"T20 WC | Karma will call it: Shami’s reply to Shoaib Akhtar’s tweet","link":"https://thenewsglory.com/t20-wc-karma-will-call-it-shamis-reply-to-shoaib-akhtars-tweet/","keywords":["Sports","Cricket","India","Pakistan","T20 WC","T20 World Cup."],"creator":["The News Glory"],"video_url":null,"description":"The England cricket team has won the trophy by defeating the Pakistan team by 5 wickets in the final match of the current T20 World Cup series. Former Pakistan player Shoaib Akhtar had tweeted about it. Indian player Mohammed Shami has given the answer. The Pakistan cricket team qualified for the semi-finals with a last-gasp […]","content":"The England cricket team has won the trophy by defeating the Pakistan team by 5 wickets in the final match of the current T20 World Cup series. Former Pakistan player Shoaib Akhtar had tweeted about it. Indian player Mohammed Shami has given the answer. The Pakistan cricket team qualified for the semi-finals with a last-gasp victory in the Super 12 round. Defeated New Zealand in the semi-final and progressed to the final. It is at this stage that Pakistan is facing defeat. So many fans and former players of that team are dissatisfied. That includes former Pakistan player Shoaib Akhtar. He shared a broken heart emoji and tweeted. ‘I’m sorry bro. This is called karma,’ Shami replied. It has gained attention among fans. It is reported that Akhtar criticized Shami when he was selected in the Indian team for the T20 World Cup series. Some fans commented that Shami said this in response. At the same time, Shami praised the England team who won the title of champion through a tweet. He also spoke about Ben Stokes and Pakistan’s amazing bowling.","pubDate":"2022-11-13 18:16:13","image_url":null,"source_id":"thenewsglory","country":["india"],"category":["sports"],"language":"english"},{"title":"English breakfast in Melbourne with second T20 title","link":"https://economictimes.indiatimes.com/news/sports/english-breakfast-in-melbourne-with-second-t20-title/articleshow/95494115.cms","keywords":null,"creator":null,"video_url":null,"description":"Not for the first time, Stokes had brought his big-match temperament and situational awareness to the fore when his team needed it the most. Cricket fans will remember the 2019 50-over World Cup final at Lord’s for the ball ricocheting off Stokes’ bat and running to the boundary, tying scores with New Zealand. The boundary count won it for England, said neutrals, but in fact, it was Stokes, with an unbeaten 84 off 98 balls who had taken his team home.","content":"Synopsis Not for the first time, Stokes had brought his big-match temperament and situational awareness to the fore when his team needed it the most. Cricket fans will remember the 2019 50-over World Cup final at Lord’s for the ball ricocheting off Stokes’ bat and running to the boundary, tying scores with New Zealand. The boundary count won it for England, said neutrals, but in fact, it was Stokes, with an unbeaten 84 off 98 balls who had taken his team home. PTI England's captain Jos Buttler celebrates with the trophy after England defeated Pakistan in the final of the T20 World Cup Cricket Ben Stokes began the final of the Twenty20 World Cup by bowling a no-ball in front of halfempty stands at the Melbourne Cricket Ground . When he sealed the deal with whip to leg that left him unbeaten on 52, his maiden T20 International half-century, 80,462 fans, were bowing to a man who had soaked up the pressure, sized up the opposition, lived up to the occasion and ended up being a worthy champion. Not for the first time, Stokes had brought his big-match temperament and situational awareness to the fore when his team needed it the most. Cricket fans will remember the 2019 50-over World Cup final at Lord’s for the ball ricocheting off Stokes’ bat and running to the boundary, tying scores with New Zealand. The boundary count won it for England , said neutrals, but in fact, it was Stokes, with an unbeaten 84 off 98 balls who had taken his team home. England needed to score at 4.84 then, and Stokes got his runs at the equivalent of 5.14 per six balls. In Melbourne, England wanted 6.9 an over across 20 overs. Stokes scored at 6.36 an over. Taken in isolation, these would be worrisome strike rates in key matches in white-ball cricket. But, these were invaluable contributions when you factor in the quality of the attack on both occasions and that the conditions offered some help for bowlers. When Stokes’ head hits the pillow, sleep will come easily, for he took responsibility for what his team needed and did not leave the crease till the job was done. But, Stokes did not play a lone hand. His is the name that will be remembered down the years when these grand finals are spoken of, but England did not deviate from the method of cricket that has powered their white-ball cricket in recent years. Jos Buttler committed to attacking the bowling, scoring 26 off only 17 balls, even after Alex Hales was dismissed in the first over. Mooen Ali, coming in at No. 6, was not at his best, but he did not shy away from taking on the bowling at a time when Pakistan put together a few tight overs and brought the required run rate up. At the innings break, there was an odd announcement ringing through the speakers at the MCG . “Rain has delayed the start of play. We will advise you shortly on the resumption.” This message, delivered by a robotic voice, came through well before a single drop of rain had fallen, like those fire drills that drag you out of office buildings even when there is no threat about. Eventually, a drizzle wet the players, and the Duckworth-LewisStern calculations were out in force, but England ensured they were not needed. If Stokes had help from his friends with the bat, the entire line-up had two bowlers, in particular, to thank for allowing them enough breathing room against an ever-threatening Pakistan attack. Adil Rashid looks like the most innocuous leg spinner in that he does not turn the ball square and refuses to send down mystery deliveries. Rashid varies his flight and pace, line and length, in combinations that ensure that his accuracy never suffers. He also deploys the googly with wisdom, picking his time and opponent carefully. In doing all this, Rashid controls the batsmen to the point that they could only score 22 off his four overs on the evening. On a day when the focus was mostly on Pakistan’s fast bowlers — and this was understandable given just how attractive they are, all raw pace and seam and swing — Sam Curran swooped in under the radar with his medium-fast left-armers. Curran does not push him- self to try and match h i s quicker teammates, or oppo- nents, but he has mast e r e d the most important aspect of bowling: finding a way to pick up wickets. Mohammad Rizwan was suckered into going hard at a ball that was floated outside off and dragged the ball back onto his stumps. Shan Masood tried to make room and manufacture a shot off Curran, but the bowler stuck to his guns and delivered one on off that shaped away, drawing the false shot. Mohammad Nawaz took on Curran, trying to whip one on the pads over the on side, but the big boundary meant there was a fielder in place, ready and waiting. Curran finished the game with figures of 4-0-12-3, something you might expect from Wasim Akram , rather than a 25-year-old still growing in the game, and was named player of the match and tournament. England became the first team to simultaneously hold the 50-over and 20-over World Cups, underscoring the importance of giving the white-ball game the respect it deserves. Read More News on england rashid curran jos buttler sam curran mcg melbourne cricket ground shan masood mohammad rizwan wasim akram (Catch all the Business News , Breaking News Events and Latest News Updates on The Economic Times .) Download The Economic Times News App to get Daily Market Updates & Live Business News. ... more less ETPrime stories of the day Economy There are many cracks in the UK economy that Sunak needs to fix. Slow growth is just one of them. 7 mins read Innovation How Web3 is democratising the Internet, and what it means for you and the Big Tech 10 mins read Investing Stock spotting: Are New Age retail investors able to decode the science of investing? 6 mins read Subscribe to ETPrime","pubDate":"2022-11-13 17:54:14","image_url":"https://img.etimg.com/thumb/width-1200,imgsize-117672,resizemode-4,msid-95494115/english-breakfast-in-melbourne-with-second-t20-title.jpg","source_id":"economictimes_indiatimes","country":["india"],"category":["sports"],"language":"english"},{"title":"T20 World Cup: Highest run-getters, top wicket-takers and other important numbers from the 2022 edition of marquee event","link":"https://www.firstpost.com/firstcricket/sports-news/t20-world-cup-top-run-getters-wicket-takers-and-all-big-numbers-11621331.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"T20 World Cup: Highest run-getters, top wicket-takers and other important numbers from the 2022 edition of marquee event","content":"Cricket T20 World Cup: Highest run-getters, top wicket-takers and other important numbers from the 2022 edition of marquee event England beat Pakistan by five wickets in the final of the 2022 T20 World Cup in Melbourne on Sunday to clinch their second title, joining West Indies as the only other team with two T20 World Cup titles. FirstCricket Staff November 13th, 2022 23:02:57 IST With 296 runs, Virat Kohli ended as the tournament's highest run-getter in Australia. AP The 2022 T20 World Cup in Australia came to a conclusion on Sunday, with Jos Buttler’s England defeating Babar Azam-led Pakistan by five wickets in the final at the Melbourne Cricket Ground (MCG). It was England’s second T20 World Cup title, and their first title since 2010, and with that they joined West Indies with most number of titles (two). While India were handed a semi-final exit against England, it was still a memorable tournament with the bat for Virat Kohli, who finished as the tournament’s highest run-getter with 296 runs. Kohli registered four half-centuries this tournament, and by finishing as the tournament’s top-scorer, the former India skipper became the first player to top the batting charts on multiple editions of the T20 World Cup. In the 2014 edition, Kohli had accumulated 319 runs from six matches. Elsewhere, Sri Lanka’s Wanindu Hasaranga ended up as the tournament’s top wicket-taker with 15 scalps, with the Player of the final and tournament Sam Curran behind the Sri Lankan with 13 wickets. Curran had finished with figures of 3/12 against Pakistan in the final, while he also collected a five-wicket haul earlier in the tournament (5/10 vs Afghanistan). Let’s now take a look at some important statistics from the tournament: Top five run-getters Virat Kohli (India) – 296 runs from 6 matches Max ODowd (Netherlands) – 242 runs from 8 matches Suryakumar Yadav (India) – 239 runs from 6 matches Jos Buttler (England) –225 runs from 6 matches Kusal Mendis (Sri Lanka) –223 runs from 8 matches Top five wicket-takers Wanindu Hasaranga (Sri Lanka) – 15 wickets from 8 matches Sam Curran (England) –13 wickets from 6 matches Bas de Leede (Netherlands) – 13 wickets from 8 matches Blessing Muzarabani (Zimbabwe) – 12 wickets from 8 matches Anrich Nortje (South Africa) –11 wickets from five matches Top five highest team totals South Africa – 205/5 against Bangladesh New Zealand – 200/3 against Australia India – 186/5 against Zimbabwe Pakistan – 185/9 against South Africa New Zealand – 185/6 against Ireland Top five highest individual scores Rilee Rossouw (South Africa) – 109 against Bangladesh Glenn Phillips (New Zealand) – 104 against Sri Lanka Devon Conway (New Zealand) – 92* against Australia Alex Hales (England) – 86* against India Michael Jones (Scotland) – 86 against Ireland Top five best bowling figures (Innings) Sam Curran (England) – 5/10 against Afghanistan Anrich Nortje (South Africa) – 4/10 against Bangladesh Trent Boult (New Zealand) – 4/13 against Sri Lanka Alzarri Joseph (West Indies) – 4/16 against Zimbabwe Shaheen Afridi (Pakistan) – 4/22 against Bangladesh Read all the Latest News , Trending News , Cricket News , Bollywood News , India News and Entertainment News here. Follow us on Facebook , Twitter and Instagram . Updated Date: November 13, 2022 23:02:57 IST Tags: Cricket T20 World Cup Find latest and upcoming tech gadgets online on Tech2 Gadgets. Get technology news, gadgets reviews & ratings. Popular gadgets including laptop, tablet and mobile specifications, features, prices, comparison.","pubDate":"2022-11-13 17:32:57","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/11/Virat-Kohli-640_AP.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"T20 WC | Fall in 2016; Rise in 2022: Match winner Ben Stokes","link":"https://thenewsglory.com/t20-wc-fall-in-2016-rise-in-2022-match-winner-ben-stokes/","keywords":["Sports","Cricket","England","India","T20 WC","T20 World Cup."],"creator":["The News Glory"],"video_url":null,"description":"Last Updated : 13 Nov, 2022 10:20 PM Published : 13 Nov 2022 10:20 PM Last Updated : 13 Nov 2022 10:20 PM Ben Stokes | file The England team has won the title of champion in the ongoing T20 World Cup series. With this, England became the first team to hold both the ODI […]","content":"Last Updated : 13 Nov, 2022 10:20 PM Published : 13 Nov 2022 10:20 PM Last Updated : 13 Nov 2022 10:20 PM Ben Stokes | file The England team has won the title of champion in the ongoing T20 World Cup series. With this, England became the first team to hold both the ODI World Cup and the T20 World Cup. It was all-rounder Ben Stokes who shone as the match-winner for England on both these occasions. It was Stokes who bowled the last over against West Indies in the final of the 2016 T20 World Cup series. Then the England team lost the game. He was on the field that fall. And here he is, six years later, the reason behind the team’s World Cup victory. He was also the man of the match in the 2019 ODI World Cup Final. The 31-year-old Stokes has been playing for England since 2011. A left-handed batsman and right-handed bowler, he has amassed a total of 8938 runs in Tests, ODIs and T20Is and has taken 292 wickets. Now he is also the captain of the England Test cricket team. At the same time, he announced his retirement from ODI cricket last July. He also took an indefinite leave in between. 2016 T20 World Cup: England and West Indies played in the final of the series held in India. The England team batted first and scored 155 runs. West Indies chased down the target of 156 to win. The team needed 19 runs to win in the last over. That over was bowled by Stokes on behalf of England. Brathwaite hits four consecutive sixes. So then the West Indies team became the champion. Stokes, on the other hand, sat down on the field. 2022 T20 World Cup: England and Pakistan played in the final of the T20 World Cup in Australia. England chased down the target of 138 runs. But lost 2 wickets for 32 runs and stumbled. Then Stokes came to the field. Stokes played calmly against the strong Pakistan bowling. On the other side, Captain Butler left. He put on a 39-run partnership with Harry Brook. He put on a 47-run partnership with Moeen Ali. He also scored his first half-century in T20 cricket. The winning runs that secured the trophy for England came from his bat. Through this, he has won what was lost six years ago. He scored a total of 52 runs off 49 balls in this match. “While chasing in the final we forget the hard work done on the field before. Both Rashid and Sam Curran bowled brilliantly. We wanted to restrict the opposition to 130 runs on this tricky wicket. It could be done. On the other hand when Ireland beat us we learned from our mistakes. We fixed it. That’s it,” Stokes said after the win. Don’t miss out!","pubDate":"2022-11-13 17:15:11","image_url":null,"source_id":"thenewsglory","country":["india"],"category":["sports"],"language":"english"},{"title":"England win T20 World Cup","link":"https://www.kuwaittimes.com/england-win-t20-world-cup/","keywords":["Cricket","Sports"],"creator":["kuwaittimes"],"video_url":null,"description":"MELBOURNE, Australia: Ben Stokes and Sam Curran starred as England edged Pakistan by five wickets to win the Twenty20 World Cup on Sunday and become the sport’s first dual white-ball champions, holding both the 50 and 20-over titles. Jos Buttler’s side held Pakistan to 137-8 in front of a partisan 80,462 fans at a heaving … The post England win T20 World Cup appeared first on Kuwait Times.","content":"Ben Stokes and Sam Curran starred as England edged Pakistan by five wickets to win the Twenty20 World Cup on Sunday and become the sport’s first dual white-ball champions, holding both the 50 and 20-over titles. Jos Buttler’s side held Pakistan to 137-8 in front of a partisan 80,462 fans at a heaving Melbourne Cricket Ground, with player-of-the-match and tournament Curran bagging 3-12 and Adil Rashid chipping with 2-22. In reply, England slumped to 49-3 in the sixth over as they struggled to get any momentum against a fiery pace attack, with boundaries hard to come by. But Stokes (52 not out) and Moeen Ali (19) used their experience and cool heads to guide England to 138-5 with six balls to spare, climaxing a riveting tournament that spanned 45 games over nearly a month. “In finals, especially when chasing, you probably forget all the hard work before that. To restrict them to 130, the bowlers have to take a lot of credit. Adil Rashid and Sam Curran won us the game,” said Stokes. “Pretty good evening. Representing your country in World Cups is amazing, it has been a good one.” Curran said Stokes should have been player of the match. “We all look up to him. People question him, but he’s incredible. He’s the man,” he said. “The way I bowl, I go into the wicket with my slower balls and keep the batsmen guessing. World champions, how good,” he added. The victory added to the 50-over title England won in 2019, building on the legacy of former captain Eoin Morgan, who retired this year after transforming the team into a white-ball juggernaut. It was England’s second T20 crown after tasting success in 2010, joining the West Indies as the only two-time winners since the tournament’s inception in 2007. The game was billed as a showdown between Pakistan’s attack and England’s top order, and Shaheen Afridi bowled danger man Alex Hales in the first over of the run chase. But that only fired up Buttler who smashed two boundaries off Naseem Shah. Phil Salt, playing in place of the injured Dawid Malan, didn’t last, making just 10 before pulling Haris Rauf to Iftikhar Ahmed. The ball was swinging and seaming and the menacing Rauf claimed the key wicket of Buttler just as he was getting in, edging to wicketkeeper Mohammad Rizwan on 26 off 17 balls. The runs dried up as they reached 77-3 at the halfway point of the innings, compared to Pakistan’s 68-2. Harry Brook came undone on 20 against the spin of Shadab Khan, holing out to Afridi and came down to needing 41 runs off the final five overs. Stokes relieved the pressure with a four and a six off Ahmed and there was no stopping them with the England all-rounder hitting the winning runs. With forecast rain staying away, England produced disciplined and economical bowling to stymie 2009 champions Pakistan, with Shan Masood’s 38 the top score. Stokes was given the new ball after England won the toss and chose to field with Pakistan lucky to survive the over intact as opener Rizwan was almost run out going for a risky single. Rizwan and Babar Azam shared a century partnership in their semi-final against New Zealand, but another big stand wasn’t to be, with Rizwan dragging a delivery from Curran on to his stumps on 15. The introduction of Rashid soon after the six-over powerplay reaped an immediate reward with Mohammad Haris (8) attacking him on his first ball only to sky a simple catch to Stokes. Masood began swinging the bat in the second half of the innings, hitting a four and six off Liam Livingstone. But once again Rashid got the breakthrough, pulling off a diving catch from his own bowling to claim the vital wicket of Azam, whose 32 came off 28 balls. Ahmed only lasted six balls before Masood and Shadab Khan (20) fell in the space of two runs as Curran and Chris Jordan kept the lid on any hope Pakistan had of a late flurry. – AFP","pubDate":"2022-11-13 17:12:13","image_url":null,"source_id":"kuwaittimes","country":["Kuwait"],"category":["sports"],"language":"arabic"},{"title":"T20 World Cup final: It could have been different if Shaheen had bowled that over: Babar Azam","link":"https://www.tribuneindia.com/news/sports/t20-world-cup-final-it-could-have-been-different-if-shaheen-had-bowled-that-over-babar-azam-450612","keywords":null,"creator":null,"video_url":null,"description":"Melbourne, November 13Pakistan could have seen a different result if pacer Shaheen Shah Afridi had not got injured during the T20 World Cup final, skipper Babar Azam said on Sunday after his team lost the title clash to England.Afridi had injured his knee while catching Harry Brooks. He was brought into the attack in the 16th over but he could bowl only one ball and Iftikhar Ahmed had to complete that over. It badly affected the bowling balance.Ahmed's friendly off-breaks were belted for 13 runs by England batters by Ben Stokes, who hit him for a six and a four, as pressure created by Pakistan eased after that.\"May be if Shaheen could have bowled that over, things would have been different. And since there were two left-handers (Stokes and Moeen Ali) and I thought of bowling an off-spinner,\" Babar reasoned.\"Since we did not build a partnership, we went on the backfoot. England bowlers were brilliant but that's not an excuse. We played according to the situation but pressure was on us till 20th over. Had Shaheen been there, it could have been different.\" Pakistan's middle-order didn't perform to its potential and they paid the price for scoring only 137 for 8, which was at least 20 runs short of a par score at the MCG.However, the skipper thought otherwise.\"I wouldn't blame the middle-order for our defeat. We win and lose as a team. After we were 85 (84) in 11 overs, we should have at least scored 150. But that is the beauty of cricket. Everyday isn't the same,\" the Pakistan skipper said.A week back, Pakistan wasn't even in contention of semifinals but South Africa lost to Netherlands and opened up an opportunity for Babar's team.The skipper lauded his teammates for their stupendous show at the back-end of the tournament.\"Yes, it hurts to lose a final but the manner in which we played our last four games (including final), the boys deserve credit,\" said Babar.Babar was not willing to talk much about the shortcomings.\"We have lost and I can understand that there will be questions raised. But it is too early to predict and we need to discuss a lot of things,\" he said when asked if some things need to change in their set up.","content":null,"pubDate":"2022-11-13 16:41:42","image_url":"https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/11/2022_11$largeimg_939922219.JPG","source_id":"tribuneindia","country":["india"],"category":["sports"],"language":"english"},{"title":"Cricket fraternity hails England's ICC T20 World Cup triumph over Pakistan","link":"https://www.business-standard.com/article/sports/cricket-fraternity-hails-england-s-icc-t20-world-cup-triumph-over-pakistan-122111300795_1.html","keywords":null,"creator":null,"video_url":null,"description":"Cricketing greats from all over the world took to social media platforms to congratulate England on clinching the ICC T20 World Cup title on Sunday.Top performances from Sam Curran and Ben Stokes powered England to their second ICC T20 World Cup title after 2010, as they defeated Pakistan by five wickets in a gripping low-scoring final at the Melbourne Cricket Ground (MCG) on Sunday.Cricket legend Sachin Tendulkar congratulated England on winning the \"closely fought final\".\"Congratulations England on winning your 2nd @T20WorldCup. Fantastic achievement. It was a closely fought final and would've been even more interesting had Afridi not been injured. What a roller coaster of a World Cup. #T20WorldCupFinal,\" tweeted Tendulkar.Star Indian batter Virat Kohli also took to Instagram to congratulate England on their title win.Indian all-rounder Hardik Pandya also took to Twitter to congratulate England on their second world title win. \"Congratulations England Well played!,\" tweeted ...","content":null,"pubDate":"2022-11-13 16:26:00","image_url":"https://bsmedia.business-standard.com/_media/bs/img/article/default/1221113/thumb-122111300795.jpg","source_id":"business-standard","country":["india"],"category":["sports"],"language":"english"},{"title":"England’s dramatic T20 World Cup winning journey: Heartbreak against Ireland to triumph vs Pakistan","link":"http://www.firstpost.com/firstcricket/sports-news/englands-dramatic-t20-world-cup-winning-journey-heartbreak-against-ireland-to-triumph-vs-pakistan-11621161.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"England’s dramatic T20 World Cup winning journey: Heartbreak against Ireland to triumph vs Pakistan","content":"Cricket England’s dramatic T20 World Cup winning journey: Heartbreak against Ireland to triumph vs Pakistan England’s dramatic turnaround in the T20 World Cup could only be beaten by Pakistan’s theatrics, but they ensured to beat them in the finals at least. FirstCricket Staff November 13th, 2022 21:40:16 IST England celebrates their second T20 World Cup win. AP If the 2022 T20 World Cup was scripted as a big-screen multi-movie saga, it would have definitely competed and probably overtaken the MCU or the Harry Potter series. The players and teams would have been nominated for a few Oscar awards. Fortunately, it wasn’t. But if it was, England and Pakistan would have won the most dramatic teams awards. Pakistan had no chance to qualify for the semi-finals, but somehow managed to play the finals, and lost it from a very short distance. View this post on Instagram A post shared by ICC (@icc) England, on the contrary, were one of the top favourites at the start of the tournament, but probably tried to induce opposition into their bait until the first few games of the group stage. This England team had no business competing with Australia and New Zealand in the league stage and should have ideally finished top of the group. But they managed to create the drama and toyed along until they faced India in the semi-final. We take a look at different phases that England passed through in the tournament. Shaky start in the league stage England had a nervy start in the group stage. They bundled out Afghanistan for 112 in their opening game. With the might of England’s batting, they were expected to chase the total down in 10 -12 overs but took 18 overs and a ball to chase the target. They also lost five wickets on the way. England who had humiliated Australia in a three-match series just before the T20 World Cup seemed to have lost the plot in the big tournament. If you think this was bad, they lost their next match to Ireland by five runs. Though rain and DLS played their part in the outcome, it was an absurd condition for England to be five runs behind the DLS par score with five wickets down, when the calling came. England’s irony with their neighbours continued. What luck England had? Could have beaten Ireland in full game Aus game wash out against whom they dominate Won must win games vs NZ & SL One side big win in SF vs IND A good win in Final vs PAK So which luck they had? https://t.co/OKa0VLiBmw — JSK (@imjsk27) November 13, 2022 The rain gods were definitely not on England’s side. After losing to Ireland, their third match against Australia – one of the most anticipated of the tournament – was washed out without a ball being bowled. With some other matches in their group as well being washed out, England’s qualification chances had narrowed down. Recovery against New Zealand and Sri Lanka England, however, made sure to recover from the slump and stand tall again. They first had to beat table toppers and strong-looking New Zealand. The Kiwis were looking a formidable side after defeating Australia and Sri Lanka. But the Three Lions roared all at once to remove the fighting power out of the Kiwis. The English openers had finally come to the fore. And after posting a healthy 179 on board, their bowling led by Sam Curran restricted New Zealand 21 runs short of the target. By the time they had to play their last match against the Lankan Lions, the group had settled down with all its suspense, and the only requirement for England was to beat Sri Lanka to qualify for the semi-finals. Which they did, although making the situation tense once again. The openers continued to fire at the top and Ben Stokes announced his arrival in crucial situations. India’s decimation in the semi-final Matches involving India are always hyped. And this one was specifically hyped because an Indian win would have set up a blockbuster climax – India vs Pakistan – to the already accolade-winning World Cup tourney. But Jos Buttler had already clarified that they will try to not let such a final happen. And he actually didn’t, to the dismay of all the cricket fans except their own. View this post on Instagram A post shared by ICC (@icc) The mighty Indians were restricted to 168 after putting them to bat first. Experts and fans thought the chase will be interesting if Indian bowlers start well. But it wasn’t to be. Jos Buttler and Alex Hales showed their might and humiliated the Indian bowlers, chasing the target in 16 overs. They didn’t lose their wickets either, winning the game by 10 wickets. The thrilling final against Pakistan So after all the drama, England were to face a more dramatic Pakistan in the final of the 2022 T20 World Cup. England would look strong on paper, but no team is a favourite against Pakistan. But England stood to their name and their heavily effective bowling attack restricted Pakistan to a below-par total of 137. View this post on Instagram A post shared by ICC (@icc) The chase was expected to be simple, but the drama that the World Cup had been, and with the two most dramatic teams competing, it would have been unfair if the match ended in 15 overs of the second innings. So the Pakistan bowlers fought back hard and didn’t let England cruise to the target. But in an anti-climactic situation, their prime bowler Shaheen Afridi had to leave the field with an injury in the leg, after bowling one ball of the 16 th over. Stokes smashed Iftikhar Ahmed for 13 runs in the remaining five balls, and the trophy had started to slip towards England. 18 deliveries later, Stokes hit the winning runs to end the drama for one last time and seal their second T20 World Cup win . England are now the undisputed white-ball champions after winning the 2019 ODI World Cup. Read all the Latest News , Trending News , Cricket News , Bollywood News , India News and Entertainment News here. Follow us on Facebook , Twitter and Instagram . Updated Date: November 13, 2022 21:40:16 IST Tags: Cricket England Vs Pakistan T20 World Cup T20 World Cup England Find latest and upcoming tech gadgets online on Tech2 Gadgets. Get technology news, gadgets reviews & ratings. Popular gadgets including laptop, tablet and mobile specifications, features, prices, comparison.","pubDate":"2022-11-13 16:10:16","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/11/England-World-Cup-journey-1.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Heartbroken Pakistani fans vent their disappointment after T20 World Cup final loss","link":"https://economictimes.indiatimes.com/news/sports/heartbroken-pakistani-fans-vent-their-disappointment-after-t20-world-cup-final-loss/articleshow/95493241.cms","keywords":null,"creator":null,"video_url":null,"description":"Top performances from Sam Curran and Ben Stokes powered England to their second ICC T20 World Cup title after 2010, as they defeated Pakistan by five wickets in a gripping low-scoring final at the Melbourne Cricket Ground (MCG) on Sunday","content":"Synopsis Top performances from Sam Curran and Ben Stokes powered England to their second ICC T20 World Cup title after 2010, as they defeated Pakistan by five wickets in a gripping low-scoring final at the Melbourne Cricket Ground (MCG) on Sunday IANS Haris Rauf (2/23) was the pick of the bowlers for Pakistan. Shaheen, Wasim and Shadab picked one each. Following their team's five-wicket loss to England in the final of ICC T20 World Cup 2022 , Pakistan fans , though proud of their side's journey to the final, expressed their heartbreak on Men in Green's loss and especially the slow knock played by their skipper Babar Azam in such a high-stakes match. Top performances from Sam Curran and Ben Stokes powered England to their second ICC T20 World Cup title after 2010, as they defeated Pakistan by five wickets in a gripping low-scoring final at the Melbourne Cricket Ground (MCG) on Sunday. \"The game was good. But the target was low as it was England they were playing against. The target should have been atleast 160-170. Well done Pakistan. They fought well. Wins and losses are part of the game. England has a stronger batting line up. Babar Azam should not have played like that, but there was pressure on him as a skipper,\" A fan Shehroz said told ANI. Another fan said that though Pakistan bowlers are world-class, their batting needs some fixes. \"There are problems in Pakistan's batting. Bowlers are world-class. Haris Rauf is a great player, he played well. I am a cricket lover, but Pakistan needs to change their batting order. There are issues with Babar, he does not want to come down. He and Shan Masood can stabilise the innings. You have to hit in powerplay, like 50 runs. Otherwise we are proud of our team,\" said the fan. Another fan Abdul also said that though he is happy that Pakistan reached the final, he is just as heartbroken for their loss. \"We are happy to reach finals but sad about losing. We played well. Bowlers tried to make a comeback. Hopefully, the next World Cup will be ours. Our captain Babar is coming back into the runs. He should have gone much longer and scored,\" he said. Another enthusiast Naim said that Shaheen Afridi's injury was a turning point for Pakistan psychologically. \"Pakistan played well, but England is a strong team. 138-140 runs were not enough. Having 170-180 would have been good. Shan tried his best to anchor the innings, but nobody else could perform. Bowling was outstanding. At one point we expected Pakistan to win. But Shaheen walking off due to injury was a turning point psychologically,\" he said. \"We are happy that we got to the finals, we were lucky. Babar is not performing the way he is known for. But everyone goes out of the form. We have Haris (Mohammad Haris) and Shan Masood who can open the innings. He (Babar) is more of an ODI and Test player. But he has got good starts in t20Is. Also, the pitch and weather were different. He (Babar) managed boys well. He brought in Mohammad Haris, which was a great decision,\" the fan concluded. Shaheen Afridi seemingly injured his knee after picking up Harry Brook's catch in the 13th over. He returned and tried to bowl, but could not continue. He could bowl for only 2.1 overs out of his four overs. Another fan Alvina lauded her side for performing well despite losing the first two matches, but felt that Babar led his side down a bit and the side should have started stronger with their willow. \"Runs were low, but they (Pakistan bowlers) gave England a run for their money. Haris Rauf was amazing. The crowd supported the team. We are proud of them,\" she added. Another Pakistan fan was critical of slow batting by Babar and Mohammad Rizwan, \"We are disappointed, our hopes were high to bring down England. We tried our best but. We did not make the best use of Powerplay. There is some issue with Babar Azam and Rizwan, they are playing quite slow.\" On the other hand, there were some England fans, who were extremely ecstatic about their team's title win and the fact that it holds 50-over and 20-over World Cups at the same time. James said, \"I am very ecstatic. I love England. I love Ben Stokes, I love Sam Curran. I am so happy right now. He is just so good, we can always count on Stokes to win us games.\" Another fan Will said, \"Overjoyed. I cannot say much. We have been waiting for England to get the job done. But now, we came here in Australia and won it, we are ecstatic. I am speechless.\" Some unnamed fans also shouted loudly with joy that they will celebrate the title win with some crumpets and tea. Coming to the match, put to bat first by England, Pakistan was reduced to 137/8 in 20 overs. Shan Masood (38) and skipper Babar Azam (32) scored most of their side's runs. Sam Curran (3/12) was the leading bowler for England in the finals. Spinner Adil Rashid (2/22) and pacer Chris Jordan (2/27) also got some crucial wickets. Ben Stokes got one wicket. Chasing 138, England was reduced to 45/3 in 5.3 overs. But a 48-run stand between Ben Stokes (52* off 49 balls with five fours and a six) and Moeen Ali (19 off 13 balls) swung the game in England's favour and they won their second title, their first since 2010. Haris Rauf (2/23) was the pick of the bowlers for Pakistan. Shaheen, Wasim and Shadab picked one each. Curran clinched the 'Man of the Match' for his match-winning spell in the finals. Brief score: Pakistan: 137/8 (Shan Masood 38, Babar Azam 32; Sam Curran 3-12) vs England: 138/5 (Ben Stokes 52*, Jos Buttler 26, Haris Rauf 2/23). Read More News on icc t20 world cup 2022 pakistan fans Babar Azam Melbourne Cricket Ground sam curran ben stokes skipper (Catch all the Business News , Breaking News Events and Latest News Updates on The Economic Times .) Download The Economic Times News App to get Daily Market Updates & Live Business News. ... more less ETPrime stories of the day Economy There are many cracks in the UK economy that Sunak needs to fix. Slow growth is just one of them. 7 mins read Innovation How Web3 is democratising the Internet, and what it means for you and the Big Tech 10 mins read Investing Stock spotting: Are New Age retail investors able to decode the science of investing? 6 mins read Subscribe to ETPrime","pubDate":"2022-11-13 16:02:30","image_url":"https://img.etimg.com/thumb/width-1200,imgsize-110760,resizemode-4,msid-95493241/heartbroken-pakistani-fans-vent-their-disappointment-after-t20-world-cup-final-loss.jpg","source_id":"economictimes_indiatimes","country":["india"],"category":["sports"],"language":"english"},{"title":"WATCH: World champion England's dressing room celebration after T20 World Cup triumph","link":"https://www.dnaindia.com/cricket/report-watch-world-champion-england-s-dressing-room-celebration-after-t20-world-cup-triumph-3001982","keywords":["Sports","Cricket"],"creator":["DNA Web Team"],"video_url":null,"description":"The 2010 champions repeated their feat in 2022 in Australia, lifting the ultimate title in men's T20I cricket after 12 long years.","content":"England celebrated their T20 World Cup 2022 victory with wild celebrations inside the dressing room on Sunday (November 13). Following the MCG victory against Pakistan, the three lions held the precious trophy and offered some beautiful behind-the-scenes experiences. The 2010 champions repeated their feat in 2022 in Australia, lifting the ultimate title in men's T20I cricket after 12 long years, and the celebrations mirrored the players from England and Wales' fulfillment of ambition and the emotions associated with it. Jos Buttler and his teammates sipped champagne as they lifted the T20 World Cup trophy, which had been elusive for more than a decade after Paul Collingwood and his team won it in the Caribbean, upsetting archrivals Australia in the final in Barbados. On the night of the final at the MCG, they turned the tables on Pakistan in a high-pressure game in which Sam Curran, Adil Rashid, and Ben Stokes played pivotal roles in a victory that cemented England's place as the world's premier white-ball side, also holding the 2019 ODI World Cup trophy. The thrill of the moment, as well as the magnificent articulation of the emotions that accompanied it, were both eloquently caught in a video shared by the International Cricket Council's (ICC) social media handle for the T20 World Cup 2022 in Australia. WATCH: View this post on Instagram A post shared by ICC (@icc) From losing to Ireland in the Super 12s stage and finding themselves in a situation where four consecutive victories were required to touch the trophy, England arrived with grace and flair, playing cricket of unrivaled brilliance towards the business end of the game. READ| How much prize money did each team receive at the end of T20 World Cup 2022? Complete list here","pubDate":"2022-11-13 16:02:00","image_url":null,"source_id":"dnaindia","country":["india"],"category":["sports"],"language":"english"},{"title":"VIDEO: बेन स्टोक्स के विनिंग रन लेते ही बच्चों की तरह की उछल पड़े इंग्लैंड के खिलाड़ी, MCG में कुछ यूं मनाया जश्न","link":"https://hindi.news18.com/news/sports/cricket-watch-video-pak-vs-eng-final-england-players-jumped-like-children-ben-stokes-took-the-winning-run-celebrated-in-mcg-4892077.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"PAK vs ENG Final England Cricket Team Video Viral: जॉस बटलर की अगुवाई वाली इंग्लैंड क्रिकेट टीम ने पाकिस्तान को टी20 वर्ल्ड कप 2022 के फाइनल मुकाबले में करारी मात देकर खिताब जीत हासिल की. पहली बार किसी ICC टूर्नामेंट में कप्तानी कर रहे बटलर के लिए इस जीत के मायने काफी खास है. इंग्लिश टीम की इस जीत में उनके सबसे अनुभवी खिलाड़ी बेन स्टोक्स ने अहम पारी खेलते हुए अपना योगदान दिया. मेलबर्न के ऐतिहासिक क्रिकेट ग्राउंड में इंग्लिश टीम की जीत के साथ ही मैदान पर जश्न मचा और जमकर का तरीका भी सभी का दिल जीत रहा है. बेन स्टोक्स के द्वारा विजयी रन बनाते ही पूरी इंग्लैंड टीम मैदान में उन्हें गले लगाने के लिए दौड़ पड़ी थी. वहीं, इसके बाद अपने कप्तान जॉस बटलर को भी कंधे पर उठा लिया, एक-दूसरे के गले लग गए और खुशी का इजहार किया....","content":null,"pubDate":"2022-11-13 16:01:24","image_url":"https://images.news18.com/ibnkhabar/uploads/2022/11/T20-world-cup-champion-16683549593x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","country":["india"],"category":["sports"],"language":"hindi"},{"title":"England win second T20 World Cup","link":"https://www.arabtimesonline.com/news/england-win-second-t20-world-cup/","keywords":["Sports","T20"],"creator":["Arab Times"],"video_url":null,"description":"Stokes steadies Poms through testing time vs Pakistan MELBOURNE, Australia, Nov 13, (AP): England confirmed their reputation as the masters of short-form cricket by claiming the Twenty20 World Cup with a stirring five-wicket triumph over Pakistan at the MCG on Sunday. A combination of miserly bowling and poised batting proved the difference as England claimed … The post England win second T20 World Cup appeared first on ARAB TIMES - KUWAIT NEWS.","content":"This post has been read 539 times! MELBOURNE, Australia, Nov 13, (AP): England confirmed their reputation as the masters of short-form cricket by claiming the Twenty20 World Cup with a stirring five-wicket triumph over Pakistan at the MCG on Sunday. A combination of miserly bowling and poised batting proved the difference as England claimed their second T20 World Cup following their win in the West Indies in 2010. After restricting Pakistan to 137-8, England struggled for a period in the middle of their pursuit before Ben Stokes lifted the tempo with five overs remaining in Melbourne. The all-rounder steadied England through a testing time and burnished his reputation for delivering in big matches by top-scoring with an unbeaten 52 runs off 49 balls. England had one over to spare when Stokes struck the winning runs through mid-wicket, with the left-handed batter jumping into the air in celebration after a superb innings. Largely dominant throughout the tournament, a shock loss to Ireland in a rain-affected match aside, England are the first nation to hold the T20 and 50- over World Cup titles in tandem. In his first year as English captain, Jos Buttler led his country superbly throughout the month-long tournament in Australia and was delighted by his nation’s performance in the decider. Sam Curran, who bowled superbly when taking 3-12 from four overs, was named both the player of the match and also of a tournament in which he finished with 13 wickets. “I don’t think I should be getting this, the way Stokesy played there (but) we’re going to enjoy this occasion. (It’s) very special,” he said. “The way I bowl, I go into the wicket with my slower balls and keep the batsmen guessing. (To be the) world champions, how good.” While heavy rain fell around Melbourne on Sunday night, concerns that the final would be interrupted were unfounded with only a few drops falling early in England’s pursuit. That was fortunate for England, which slipped behind the required run rate in the middle stages until Stokes’ settling innings, and also the 80,462 fans in attendance for the final. Pakistan will ponder what might have been after star pace bowler Shaheen Shah Afridi injured himself while taking a catch to remove Harry Brook with the final still in the balance. On returning to the field after treatment, Afridi was reintroduced into the attack with five overs remaining but lasted just one delivery before again limping from the MCG in despair. This proved a reprieve for England, which still required 41 runs from 30 balls when Afridi was brought back on to bowl. It was here that Stokes launched the winning attack with the bat. It is a deserved triumph for the tournament favorites – they were as methodical with both the ball and bat in hand in the final as they had been throughout the month in Australia. Curran and right-arm leg spinner Adil Rashid were superb in helping restrict Pakistan, vindicating Buttler’s decision to bowl first after winning the toss. Pakistan’s opening combination of Babar Azam and Mohammad Rizwan combined for 29 runs before the latter dragged a delivery from Curran on to his stumps in the fifth over. Azam, the Pakistan captain, batted with measured aggression until losing his wicket caught-and-bowled to Rashid for 32 runs off 28 balls in the 12th over. This post has been read 540 times! NEW DELHI, June15, (AP): U.S. media giant Walt … You must be to post a comment.","pubDate":"2022-11-13 15:23:00","image_url":null,"source_id":"arabtimesonline","country":["Kuwait"],"category":["sports"],"language":"arabic"},{"title":"England are the ‘undisputed kings’ of white-ball cricket","link":"https://www.theweek.co.uk/news/sport/cricket/958493/t20-world-cup-england-undisputed-kings-white-ball-cricket","keywords":null,"creator":null,"video_url":null,"description":"Ben Stokes scored the winning run as England beat Pakistan in the ICC Men’s T20 World Cup final","content":"Ben Stokes and Liam Livingstone celebrate England’s win over Pakistan Quinn Rooney/Getty Images England have become the first men’s team in cricket history to hold both the 50-over and 20-over World Cups simultaneously. Winners of the one-day tournament in 2019, they added the Twenty20 World Cup to their trophy cabinet following a five-wicket victory over Pakistan in Melbourne. Videos: England win the Cricket World Cup and fans go wild following Super Over drama In a “pulsating final” on Sunday, Jos Buttler’s England side were set a chase of 138 runs in front of a “raucous Pakistan-supporting crowd” at the iconic Melbourne Cricket Ground, said Matthew Henry on BBC Sport . And like the 2019 final, Ben Stokes “was there at the end” as he scored 52 not out to write himself “further into the folklore” of English cricket. “Strapping his team-mates to his broad shoulders”, Stokes carried his country to another World Cup triumph, said Andrew Wu in The Sydney Morning Herald . A “laughing stock in 2015”, when they crashed out of the World Cup at the group stage, England are now the “undisputed kings” of white-ball cricket. Redemption for Stokes Playing an “instrumental” role in two World Cup finals, all-rounder Stokes is “a champion under pressure”, said former New Zealand captain Stephen Fleming on ESPNcricinfo ’s T20 Time Out show. Scoring his first T20 international half-century, the 31-year-old is “forging a career where he is there at key moments”. Stokes is “a big presence”, “a big personality” and he’s “a big winner”, Fleming added. “And that’s pretty key ingredients when you talk about a good to great player.” An “irredeemable drama magnet”, England’s Test team captain is a man who “always manages to crowbar his way into a big occasion”, said Simon Burnton in The Guardian . However, back in the 2016 T20 World Cup final it was Stokes who bowled the “catastrophic final over that cost his side the title” against the West Indies. Six years later, it was “redemption” for Stokes as England got their hands on the T20 World Cup for a second time. England lifted the ICC Men’s T20 World Cup at the MCG Daniel Pockett/ICC via Getty Images Buttler is building his ‘own legacy’ This group of white-ball players are “extraordinary”, said former England Test captain Michael Vaughan in The Telegraph . And for once English cricket has “a trendsetting team the rest of the world should emulate”. Speaking about Buttler, Vaughan said that the victorious skipper has now “stepped out of Eoin Morgan’s shadow” and is “showing himself to be his own man”. A World Cup-winning captain at the first attempt, he has “the chance to build his own legacy” and can “take them even higher”. Skip advert Morgan, the 2019 World Cup -winning captain, retired from international cricket this summer and Buttler was appointed as his permanent replacement. With big shoes to fill, Buttler was hailed by Stokes as “incredible” and he said England were “lucky to have him”. “When the great man [Morgan] stepped down, you look at how quickly Jos has managed to take control of the team and progress it from the legacy Morgs has left,” Stokes told Sky Sports . “Jos has now created his own legacy. He’s a T20 World Cup-winning captain and he is incredible. It shouldn’t be taken for granted how hard it can be to make tactical decisions under pressure and 95% of his decision-making has been absolutely right.” Share on Facebook Share on Twitter Share via Email Sport Cricket England cricket team","pubDate":"2022-11-13 15:15:17","image_url":null,"source_id":"theweek","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"'Best white ball team': Cricket greats congratulate England on T20 World Cup victory","link":"https://economictimes.indiatimes.com/news/sports/best-white-ball-team-cricket-greats-congratulate-england-on-t20-world-cup-victory/articleshow/95492596.cms","keywords":null,"creator":null,"video_url":null,"description":"As soon as Jos Buttler-led team became the T20 champions, wishes started pouring in for ex-cricketers from across the world on social media. Indian master blaster Sachin Tendulkar called England's win a fantastic achievement and also pointed to the unfortunate timing of Shaheen Afridi's injury as a pivotal moment in Sunday's match.","content":"Synopsis As soon as Jos Buttler-led team became the T20 champions, wishes started pouring in for ex-cricketers from across the world on social media. Indian master blaster Sachin Tendulkar called England's win a fantastic achievement and also pointed to the unfortunate timing of Shaheen Afridi's injury as a pivotal moment in Sunday's match. IANS England beat Pakistan by 5 wickets after achieving the target of 138 run with one over to spare. Former cricketers have congratulated the English cricket team for winning the T20 world cup in Australia. This was the second T20 world cup title for England. England beat Pakistan by 5 wickets after achieving the target of 138 run with one over to spare. As soon as Jos Buttler-led team became the T20 champions, wishes started pouring in for ex-cricketers from across the world on social media. Indian master blaster Sachin Tendulkar called England's win a fantastic achievement and also pointed to the unfortunate timing of Shaheen Afridi's injury as a pivotal moment in Sunday's match. \"Congratulations England on winning your 2nd @T20WorldCup. Fantastic achievement. It was a closely fought final and would've been even more interesting had Afridi not been injured. What a roller coaster of a World Cup,\" said Tendulkar in a tweet. Congratulations England on winning your 2nd @T20WorldCup. 🏆Fantastic achievement. 👏🏻 It was a closely fought fin… https://t.co/M2YUtYd9iE — Sachin Tendulkar (@sachin_rt) 1668342415000 Indian star batsman Virat Kohli congratulated England on Instagram. \"Congratulations England, Well deserved,\" wrote Kohli along with the picture. Another Indian legend - VVS Laxman called the final a great game. \"Great final in front of 80,000-plus fans at the MCG. Congrats to England for their stirring title win and to Pakistan for putting up a brave fight. #T20WorldCup #T20WorldCupFinal,\" tweeted Laxman. Great final in front of 80,000-plus fans at the MCG. Congrats to England for their stirring title win and to Pakist… https://t.co/FSglTtvooK — VVS Laxman (@VVSLaxman281) 1668339757000 \"Congratulations to England for playing a strong entertaining brand of cricket. Well played Pakistan for never giving up! Cricket was the winner #T20WorldCupFinal,\" tweeted Sri Lankan great Sanath Jayasuriya. Congratulations to England for playing a strong entertaining brand of cricket. Well played Pakistan for never givin… https://t.co/dRJkUW532W — Sanath Jayasuriya (@Sanath07) 1668340532000 Meanwhile, former England captain Michael Vaughan hailed Ben Stokes, saying the all-rounder knows how to win the big moments. \"England are the best white ball team in the world. They have an incredible group of players, thoroughly deserve to now hold both white ball WCs... In Ben Stokes they have a player who just knows how to win the big moments... Great teams need Great individuals.. England have plenty,\" tweeted Vaughan. England are the best white ball team in the world.They have an incredible group of players,throughly deserve to now… https://t.co/3cxLmmXBa5 — Michael Vaughan (@MichaelVaughan) 1668339319000 \"Congratulations in laws!! @benstokes38 great knock in a big pressure game!! #PakistanVsEngland #T20WorldCupFinal,\" said former Indian all-rounder Yuvraj Singh in his tweet. Congratulations in laws !! @benstokes38 great knock in a big pressure game !! #PakistanVsEngland #T20WorldCupFinal — Yuvraj Singh (@YUVSTRONG12) 1668342167000 Former West Indies cricketer and noted commentator Ian Raphael Bishop feels England truly deserved to win. \"Well played England. Duly deserved for truly being outstanding in the white ball game for the last 5 years. Pakistan showed great spirit to get the final and will get even better,\" said Bishop in a tweet. Well played England. Duly deserved for truly being outstanding in the white ball game for the last 5 years 👑 👑👑. Pa… https://t.co/Qs0yOPcs2o — Ian Raphael Bishop (@irbishi) 1668341006000 \"Well done England! Undoubtedly the best team in the tourney,\" tweeted AB de Villiers. Well done England! Undoubtedly the best team in the tourney👏 — AB de Villiers (@ABdeVilliers17) 1668339534000 Read More News on england world cup virat kohli vvs laxman sachin tendulkar england virat (Catch all the Business News , Breaking News Events and Latest News Updates on The Economic Times .) Download The Economic Times News App to get Daily Market Updates & Live Business News. ... more less ETPrime stories of the day Economy There are many cracks in the UK economy that Sunak needs to fix. Slow growth is just one of them. 7 mins read Innovation How Web3 is democratising the Internet, and what it means for you and the Big Tech 10 mins read Investing Stock spotting: Are New Age retail investors able to decode the science of investing? 6 mins read Subscribe to ETPrime","pubDate":"2022-11-13 15:02:45","image_url":"https://img.etimg.com/thumb/width-1200,imgsize-164828,resizemode-4,msid-95492596/best-white-ball-team-cricket-greats-congratulate-england-on-t20-world-cup-victory.jpg","source_id":"economictimes_indiatimes","country":["india"],"category":["sports"],"language":"english"},{"title":"Mohammed Shami gives a befitting reply to Shoaib Akhtar after Pakistan's T20 World Cup final loss","link":"https://www.firstpost.com/firstcricket/sports-news/t20-world-cup-final-mohammed-shami-takes-a-dig-at-shoaib-akhtar-after-pakistans-heartbreak-11620931.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"Mohammed Shami gives a befitting reply to Shoaib Akhtar after Pakistan's T20 World Cup final loss","content":"Cricket Mohammed Shami gives a befitting reply to Shoaib Akhtar after Pakistan's T20 World Cup final loss Shoaib Akhtar earlier said that Mohammed Shami's inclusion in India's T20 World Cup squad was pointless as he was only picked in the team after injuries to Jasprit Bumrah and Deepak Chahar FirstCricket Staff November 13th, 2022 20:26:05 IST Mohammed Shami played all the games for India during T20 World Cup in Australia. AFP Mohammed Shami had no qualms in taking a dig at a heartbroken Shoaib Akhtar after his country Pakistan lost to England in the T20 World Cup final in Melbourne on Sunday. T20 World Cup Home | Schedule | Results | Points Table | T20 World Cup News | Photos England defeated Pakistan by five wickets in a low-scoring final where the losing side could only put a paltry 137/8 on the board on a surface that demanded a total beyond 160. Pakistan bowlers did put up a fight by taking five English wickets before Ben Stokes scored a half-century to dash Pakistan’s hopes of winning the title. Following the loss, retired pacer Akhtar took to social media to post a heartbroken emoji to express his emotions. His post came two days after the ‘Rawalpindi Express’ said on his YouTube channel that Indian cricket is going through it’s lowest point while adding that Mohammad Shami’s inclusion in the team was pointless. Shami exacted his revenge by Quote retweeting Akhtar’s post saying ‘it’s call Karma’ while posting heartbroken emojis beside it. Sorry brother It’s call karma 💔💔💔 https://t.co/DpaIliRYkd — Mohammad Shami (@MdShami11) November 13, 2022 To rejig readers’ minds, Shami was earlier ignored for World Cup selection while the likes of Deepak Chahar and Umran Malik were named as standbys. However, pacer Jasprit Bumrah and Chahar were ruled out of the tournament before India left for Australia, opening the doors for Shami into the team. Did you say best? https://t.co/dboAELlYKH pic.twitter.com/64sYkyuXEH — Amit Mishra (@MishiAmit) November 13, 2022 India’s veteran spinner Amit Mishra also took a dig at Pakistan’s former cricketers’ and fans’ claims of their country having the best bowling line-up by posting a photo of Virat Kohli hitting Haris Rauf for that famous six over long-on during his legendary 82 not out knock against Pakistan earlier in the Super 12 stages after India were reeling at 31/4 while chasing 159. Read all the Latest News , Trending News , Cricket News , Bollywood News , India News and Entertainment News here. Follow us on Facebook , Twitter and Instagram . Updated Date: November 13, 2022 20:26:05 IST Tags: Cricket Mohammad Shami Pakistan Vs England Shoaib Akhtar Find latest and upcoming tech gadgets online on Tech2 Gadgets. Get technology news, gadgets reviews & ratings. Popular gadgets including laptop, tablet and mobile specifications, features, prices, comparison.","pubDate":"2022-11-13 14:56:05","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/11/Mohammed-Shami-T20-World-Cup.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"England nail white-ball cricket winning T20 World Cup to go with the 2019 50-ball triumph","link":"https://indianexpress.com/article/sports/cricket/england-nail-white-ball-cricket-winning-t20-world-cup-to-go-with-the-2019-50-ball-triumph-8266445/","keywords":["Cricket","Sports"],"creator":["Abhishek Purohit"],"video_url":null,"description":null,"content":null,"pubDate":"2022-11-13 14:51:26","image_url":null,"source_id":"indianexpress","country":["india"],"category":["sports"],"language":"english"}]}