{"newsArray":[{"title":"Harare Sports Club T20 records: Harare Sports Club records and highest T20I innings total full list","link":"https://thesportsrush.com/cricket-news-harare-sports-club-t20-records-harare-sports-club-records-and-highest-t20i-innings-total-full-list/","keywords":["Cricket","Bangladesh","Bangladesh tour of Zimbabwe 2022","Zimbabwe"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Harare Sports Club T20 records: Harare will be hosting an international match after one and a half months today. The first T20I of Bangladesh’s tour of Zimbabwe 2022 will be played in Harare today. In fact, Harare Sports Club will be hosting Bangladesh for all the six white-ball matches of this tour in the next… The post Harare Sports Club T20 records: Harare Sports Club records and highest T20I innings total full list appeared first on The SportsRush.","content":"Harare Sports Club T20 records: Harare will be hosting an international match after one and a half months today. The first T20I of Bangladesh’s tour of Zimbabwe 2022 will be played in Harare today. In fact, Harare Sports Club will be hosting Bangladesh for all the six white-ball matches of this tour in the next 12 days. Having hosted Afghanistan across white-ball formats as recent as last month, Harare will be hosting an international match after one and a half months. Speaking particularly of T20Is, it will be the 33rd match to be played at this venue on a Saturday afternoon. Zimbabwe, who’ve played 29 T20Is here over the years, have won just four and lost 25 to have an abysmal venue record. Meanwhile, Bangladesh had won two and lost one out of their three Harare T20Is last year. Practice session at Harare Sports Club.#BCB #Cricket #ZIMvBAN pic.twitter.com/1B8Y7IhipS — Bangladesh Cricket (@BCBtigers) July 28, 2022 Harare Sports Club T20 records Highest run-scorers in Harare T20Is are Chamu Chibhabha (311), Aaron Finch (306), Elton Chigumbura (297), Fakhar Zaman (293) and Wessly Madhevere (293). A list of best T20I batters at this venue among active cricketers is mentioned below: Batter Matches Runs Highest Average SR Chamu Chibhabha (ZIM) 16 311 67 19.43 111.07 Aaron Finch (AUS) 5 306 172 76.5 201.31 Fakhar Zaman (PAK) 8 293 91 36.62 147.23 Wessly Madhevere (ZIM) 9 293 73 32.55 126.29 Mohammad Rizwan (PAK) 5 235 91* 117.5 125.66 While most of the Bangladeshi cricketers selected for this tour haven’t played a Harare T20I in the past, Zimbabwean batters taking part in this series with an impressive record at this venue are Sikandar Raza (186), Regis Chakabva (176) and Craig Ervine (139). ALSO READ: When and where to watch Bangladesh’s tour of Zimbabwe 2022 in India? Highest T20I wicket-takers at Harare Sports Club are Luke Jongwe (20), Mohammad Hafeez (14), Andrew Tye (12), Blessing Muzarabani (11) and Chibhabha (9). A list of best T20I bowlers at this venue among active cricketers is mentioned below: Bowler Matches Wickets Average Economy SR Luke Jongwe (ZIM) 11 20 14.3 8.25 10.4 Andrew Tye (AUS) 10 14 7.14 5.5 7.7 Blessing Muzarabani (ZIM) 11 11 30.81 7.85 23.5 Chamu Chibhabha (ZIM) 16 9 29.33 8 22 Hasan Ali (PAK) 5 8 16.25 8.12 12 Among bowlers taking part in this series, Ryan Burl (8), Wellington Masakadza (6), Shoriful Islam (6) and Sean Williams (5) have done well at this venue. Highest T20I innings total at Harare Sports Club Score Overs Team Opposition Year 229/2 20 Australia Zimbabwe 2018 198/4 20 Pakistan Zimbabwe 2011 198/5 20 New Zealand Zimbabwe 2015 194/5 19.2 Bangladesh Zimbabwe 2021 194/7 20 Pakistan Australia 2018 The aforementioned fourth-highest innings total in Harare is also the highest T20I run-chase at this stadium. Readers must note that 11 out of 32 T20Is at the Harare Sports Club have been won by teams batting second with 150+ run-chases sealed on six different occasions. The post Harare Sports Club T20 records: Harare Sports Club records and highest T20I innings total full list appeared first on The SportsRush.","pubDate":"2022-07-29 22:01:11","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"India at CWG 2022 Day 1 wrap: Defeat in cricket but Srihari Nataraj and hockey, table tennis teams impress","link":"https://www.indiatoday.in/sports/commonwealth-games-2022/story/india-at-cwg-2022-day-1-results-badminton-squash-table-tennis-swimming-cricket-1981654-2022-07-30?utm_source=rss","keywords":null,"creator":null,"video_url":null,"description":"India at CWG Day 1 wrap: Srihari makes a splash, hockey and table tennis teams shine","content":null,"pubDate":"2022-07-29 21:49:37","image_url":null,"source_id":"indiatoday","country":["india"],"category":["sports"],"language":"english"},{"title":"Zimbabwe vs Bangladesh 1st T20I Live Telecast Channel in India: When and where to watch ZIM vs BAN Harare T20I?","link":"https://thesportsrush.com/cricket-news-zimbabwe-vs-bangladesh-1st-t20i-live-telecast-channel-in-india-when-and-where-to-watch-zim-vs-ban-harare-t20i/","keywords":["Cricket","Bangladesh","Bangladesh tour of Zimbabwe 2022","Zimbabwe"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Zimbabwe vs Bangladesh 1st T20I Live Telecast Channel: The SportsRush presents before you the timing and live streaming details of the first ZIM vs BAN T20I. Bangladesh’s tour of Zimbabwe 2022 will get kick-started with the first T20I in Harare later in the day. A rare back-to-back home series against Test playing nations will witness… The post Zimbabwe vs Bangladesh 1st T20I Live Telecast Channel in India: When and where to watch ZIM vs BAN Harare T20I? appeared first on The SportsRush.","content":"Zimbabwe vs Bangladesh 1st T20I Live Telecast Channel: The SportsRush presents before you the timing and live streaming details of the first ZIM vs BAN T20I. Bangladesh’s tour of Zimbabwe 2022 will get kick-started with the first T20I in Harare later in the day. A rare back-to-back home series against Test playing nations will witness Zimbabwe hosting Bangladesh and India for white-ball series in the next one month. Fresh off a victory in the ICC Men’s T20 World Cup Qualifier in Bulawayo, an in-form Zimbabwean side couldn’t have asked for a better time to host two Asian teams. Bangladesh, on the other hand, will be playing this series with a second-string squad under a newly-elected captain in Nurul Hasan. Having won just one out of their last 12 T20Is since the ICC T20 World Cup 2021 Round 2, Bangladesh desperately need to find some winning momentum in this format. ALSO READ: Harare Sports Club pitch report for Zimbabwe vs Bangladesh 1st T20I Only the seventh bilateral T20I series between these two teams, it will be the third in Zimbabwe (second consecutive). Readers must note that Bangladesh have a 3-0 series lead in the previous six T20I series against Zimbabwe. An unwelcome practice of international cricket in West Indies, New Zealand, Bangladesh and some other nations not being available for television audiences in India will continue during Bangladesh’s tour of Zimbabwe 2022 as no channel has acquired the broadcasting rights for this series either. However, streaming platform Fan Code will be streaming the same at a nominal price. Indian fans, who wish to buy a pass for the whole tour (three T20Is and three ODI), will have to pay a 41% discounted price of INR 59 on the website or mobile application of FanCode. In the absence of an official confirmation with respect to the host broadcaster, fans in Zimbabwe can stream this series on ICC.tv with a paid subscription (USD 1.99 for Bangladesh and India’s tours of Zimbabwe 2022). In fact, this option is available for all the countries in the world apart from India and Bangladesh. Bangladesh Cricket team practice session at Harare Sports Club. #BCB #Cricket #ZIMvBAN pic.twitter.com/YXxVO6SRE0 — Bangladesh Cricket (@BCBtigers) July 29, 2022 Date – 30/07/2022 (Saturday). Match start Time – 01:00 PM (local) and 04:30 PM (India). TV Channel – Not available (India). Online platform – FanCode (India) and ICC.tv (All regions other than India and Bangladesh).","pubDate":"2022-07-29 21:22:26","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Huddersfield 0 Burnley 1: Chelsea loanee Maatsen curls superb early winner as Kompany’s Clarets launch season in style","link":"https://www.thesun.co.uk/sport/football/19366172/huddersfield-vs-burnley-championship-report-maatsen/","keywords":["Football"],"creator":["Ian Tuckey"],"video_url":null,"description":null,"content":"WAS this really Burnley we were watching? Ian Maatsen’s 18th-minute goal got their Championship season off to a winning start in West Yorkshire. ReutersVincent Kompany’s eyes were Burning as he saw his new team waste chances but still earn a deserved victory at Huddersfield[/caption] Burnley’s Ian Maatsen, the left-back on loan from Chelsea, celebrates his debut goal after his 18th minute breakthroughRex But what a transformation this was under Vincent Kompany to the last six years we have become accustomed to from the Clarets in the Premier League. This was more like watching Manchester City — the club where he was a legend. Where Burnley used to sit back, keep things tight, allow their opponents possession, last night they were popping the ball around with confidence, dominating play and opening up Huddersfield at will.  Burnley had SEVENTY per cent possession — completely unheard of … and this was away from home! READ MORE IN FOOTBALL TROY DEENEY Championship more enjoyable and unpredictable than Prem and there's no s*** VAR THE BIG KICK-OFF The Championship is BACK but who will get their £200m Prem payday? FREE BETS AND SIGN UP DEALS – BEST NEW CUSTOMER OFFERS They controlled the tempo. It was exhibition stuff. Surely Burnley have never passed the ball so much. And when they had to dig deep briefly after the break, they showed that steely defence we are more used to seeing. Sean Dyche must have been crying into his beer if he was watching. His Burnley blueprint has been ripped up. They even made history by bringing on the first-ever Brazilian to play for them when Vitinho came on with 16 minutes left.  It is fair to say they will get tougher examinations but if this is anything to go by the Turf Moor faithful are in for a treat. Most read in Football Arsenal news Tielemans deal AGREED, third kit RELEASED, Gunners CONFIRM Okonkwo Crewe exit FERGIE TIME Ferguson RETURNS to Man Utd as legendary manager handed official role on board RON HIS WAY Ronaldo tells Man Utd he DOES have offer from rival club and begs for transfer OFF & ON New offside rules introduced just days before start of new Premier League season SUA-MESS Arsenal flop Suarez blasted by Celta Vigo for 'wanting to harm club' PRIME TIME Fans say the same thing as Arsenal announce KSI and Logan Paul as new sponsors The only criticism is they would have wanted to score more goals, which could have cost them against a better side than Huddersfield. But even with the score only 1-0, it almost felt as though the Clarets were three goals to the good. July is a month normally reserved for Wimbledon, The Open and we are only halfway through the cricket season. So it seemed bizarre that the football season was back in full swing at The John Smith’s Stadium. Danny Schofield was also taking over at the Huddersfield helm after the departure of Carlos Corberan. Kompany looked sharp in an expensive designer suit but wore white trainers. The hot weather forced him to take off his jacket after a few minutes. Burnley had a great chance to open the scoring when Ashley Barnes got through on goal. He was offside but the assistant official kept his flag down and Tom Lees managed to make a superb last-ditch tackle. PAIan Maatsen fires the first goal of the Championship season with an early opener for relegated Burnley at play-off losers Huddersfield[/caption] Former West Ham kid Josh Cullen — making his Clarets debut and who followed Kompany from Anderlecht this summer — then saw a curling effort saved by Lee Nicholls after being teed up by Maatsen. Burnley were starting to dominate — picking up all the second ball and bossing possession. Dara Costelloe played in Barnes with a slide-rule pass and his effort was well saved by Nicholls. But Burnley moved in front when Josh Brownhill and Barnes played a one-two before Maatsen curled home a lovely low-struck effort from just inside the box with his right foot. And it could have been two when Connor Roberts was denied by a point-blank stop from Nicholls after a lovely lovely chipped pass from Jack Cork. Huddersfield were not laying a glove on the visitors and groans rang out when Josh Ruffles overhit a cross from the left. Costelloe should have doubled the lead when Maatsen set him up with a peach of a pass from the right — but scuffed his effort when unmarked from just eight yards. After the break Josh Korma frustratingly lost control of the ball and allowed it to run out of play when well positioned on the left edge of the Burnley box. Huddersfield had certainly improved but found the Burnley defence rock solid when it needed to. Ollie Turton managed to produce a quality cross that Danny Ward was set to pounce on — but it was headed clear before it reached him. With the score still 1-0, Burnley could never be completely comfortable. And when Sorba Thomas swung in a dangerous free-kick from the right, Kompany’s heart must have been racing when Barnes held on to Lees’ arm. But referee James Linington was not interested.  Scott Twine came on for his Burnley debut with 15 minutes left after making his move from MK Dons. The Clarets were denied a second when Taylor Harwood-Bellis saw a bullet effort held on the line by Nicholls. And Twine then saw a ferocious free-kick thump back off a post.","pubDate":"2022-07-29 20:58:29","image_url":null,"source_id":"thesun","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Huddersfield 0 Burnley 1: Vincent Kompany brings Man City flair to Clarets as they win Championship season opener","link":"https://www.thesun.ie/sport/football/9177811/huddersfield-vs-burnley-championship-report-maatsen/","keywords":["Football"],"creator":["Ian Tuckey"],"video_url":null,"description":null,"content":"WAS this really Burnley we were watching? Ian Maatsen’s 18th-minute goal got their Championship season off to a winning start in West Yorkshire. But what a transformation this was under Vincent Kompany to the last six years we have become accustomed to from the Clarets in the Premier League. This was more like watching Manchester City — the club where he was a legend. Where Burnley used to sit back, keep things tight, allow their opponents possession, last night they were popping the ball around with confidence, dominating play and opening up Huddersfield at will. The Clarets had SEVENTY per cent possession — completely unheard of ... and this was away from home! They controlled the tempo. It was exhibition stuff. Surely Burnley have never passed the ball so much. And when they had to dig deep briefly after the break, they showed that steely defence we are more used to seeing. Sean Dyche must have been crying into his beer if he was watching. His Burnley blueprint has been ripped up. They even made history by bringing on the first-ever Brazilian to play for them when Vitinho came on with 16 minutes left. It is fair to say they will get tougher examinations but if this is anything to go by the Turf Moor faithful are in for a treat. FREE BETS AND SIGN UP DEALS - BEST NEW CUSTOMER OFFERS The only criticism is they would have wanted to score more goals, which could have cost them against a better side than Huddersfield. But even with the score only 1-0, it almost felt as though the Clarets were three goals to the good. July is a month normally reserved for Wimbledon, The Open and we are only halfway through the cricket season. So it seemed bizarre that the football season was back in full swing at The John Smith’s Stadium. Danny Schofield was also taking over at the Huddersfield helm after the departure of Carlos Corberan. Kompany looked sharp in an expensive designer suit but wore white trainers. The hot weather forced him to take off his jacket after a few minutes. Burnley had a great chance to open the scoring when Ashley Barnes got through on goal. He was offside but the assistant official kept his flag down and Tom Lees managed to make a superb last-ditch tackle. Former West Ham kid Josh Cullen — making his Clarets debut and who followed Kompany from Anderlecht this summer — then saw a curling effort saved by Lee Nicholls after being teed up by Maatsen. Burnley were starting to dominate — picking up all the second ball and bossing possession. Dara Costelloe played in Barnes with a slide-rule pass and his effort was well saved by Nicholls. But Burnley moved in front when Josh Brownhill and Barnes played a one-two before Maatsen curled home a lovely low-struck effort from just inside the box with his right foot. And it could have been two when Connor Roberts was denied by a point-blank stop from Nicholls after a lovely lovely chipped pass from Jack Cork. Huddersfield were not laying a glove on the visitors and groans rang out when Josh Ruffles overhit a cross from the left. Costelloe should have doubled the lead when Maatsen set him up with a peach of a pass from the right — but scuffed his effort when unmarked from just eight yards. After the break Josh Korma frustratingly lost control of the ball and allowed it to run out of play when well positioned on the left edge of the Burnley box. Huddersfield had certainly improved but found the Burnley defence rock solid when it needed to. Ollie Turton managed to produce a quality cross that Danny Ward was set to pounce on — but it was headed clear before it reached him. With the score still 1-0, Burnley could never be completely comfortable. And when Sorba Thomas swung in a dangerous free-kick from the right, Kompany’s heart must have been racing when Barnes held on to Lees’ arm. But referee James Linington was not interested. Scott Twine came on for his Burnley debut with 15 minutes left after making his move from MK Dons. The Clarets were denied a second when Taylor Harwood-Bellis saw a bullet effort held on the line by Nicholls. And Twine then saw a ferocious free-kick thump back off a post.","pubDate":"2022-07-29 20:58:29","image_url":null,"source_id":"thesun_ie","country":["ireland"],"category":["sports"],"language":"english"},{"title":"Indian cricket dips its toes in the multi-sport ocean","link":"https://www.thehindu.com/sport/cricket/indian-cricket-dips-its-toes-in-the-multi-sport-ocean/article65700630.ece","keywords":null,"creator":["\n        Uthra Ganesan  \n    "],"video_url":null,"description":"At the Commonwealth Games, Harmanpreet Kaur’s side has the opportunity to break out of the shadow of the men’s team on a stage cricket does not frequent. A good showing will fuel the growing interest in the women’s game at home and strike a blow for gender parity","content":"Opportune moment: With talks of a women’s IPL gaining strength and the WBBL and The Hundred drawing top Indian names, the CWG couldn’t have come at a better time for the country’s female cricketers. | Photo Credit: PTI Cricket is unique. It’s a team game where individual excellence not only defines its players but often supersedes the team itself. It aspires to a global footprint without compromising on the privileges of its powerhouses. It’s a sport that basks in its adherence to tradition and yet has changed its form and format the most. And in India, it’s a sport that identifies as a lot more — religion, business, entertainment, celebration. For these reasons, and others, cricket has largely stayed away from multi-disciplinary events that celebrate sporting excellence — the Olympics, Asian Games, Commonwealth Games. While the Asian Games in 2010 and 2014 featured cricket, with a return scheduled in 2022 — minus India — the game’s maiden, modest appearance in the Commonwealth Games was in Malaysia, way back in 1998. The sport then was so far from its current avatar that current India captain Harmanpreet Kaur was a wee nine-year-old, Sachin Tendulkar and Anil Kumble were at the peak of their respective careers and Shafali Verma was still more than five years away from conception. And so, when India’s female players left for Birmingham earlier this week, they were in an enviable position: there was no history to be judged against, just the opportunity to be pioneers of a future where sharing facilities at a Games Village would no longer remain a curiosity for cricketers. “It will be a game-changer going ahead. This is the first time we are participating in an event of this magnitude. It’s a big platform for our girls to be with so many athletes across so many sports and it is also an opportunity for us to showcase our sport and our talent,” Harmanpreet said. It’s a first-time opportunity for the women’s team. In 1998, the 50-over version was played, only by the men, with the cricketing world divided on the event’s importance. The Board of Control for Cricket in India was initially reluctant and then wanted to send a B-team, prioritising the Sahara Cup against arch-rival Pakistan in Toronto. Participation was only guaranteed after a lot of cajoling and coercion from the Indian Olympic Association — particularly then president Suresh Kalmadi, who did not budge from his position on Tendulkar’s inclusion — and the government. There were 16 teams, with several West Indian nations participating independently. The Indian team was split into two — one competing in Kuala Lumpur, the other in Toronto — and the CWG outing ended disappointingly. The Ajay Jadeja-led unit won just one of three league games (there was one no-result) and failed to reach the knockouts, despite the presence of players such as Tendulkar, Kumble and V.V.S. Laxman. This time around, it’s a shorter, more competitive affair, with eight teams playing T20s. “All of us as cricketers have watched the Olympics and Asian Games and Commonwealth Games growing up, seen the national flag flying high and the national anthem played. This is a chance for us to do that as well and it’s a matter of pride,” coach Ramesh Powar insisted. It isn’t a cakewalk, though, for the team. India is clubbed with Australia, Pakistan and Barbados in Pool A, with the team starting favourite only against Pakistan. “This tournament is very important for us and we will definitely be playing for a medal. We have grown up watching such events and we are glad we are also getting this opportunity,” Harmanpreet said. The tone and tenor is a far cry from the reluctant, protesting participation 24 years ago. In a way, it’s also representative of the changing sporting scenario, across the world and at home. While cricket has clearly become a behemoth that dwarfs everything else in the country, the public interest in other sports, especially during multi-disciplinary events, has grown manifold. India’s consistent, if miniscule, successes have also played a part. Other cricketing powers, including Australia and New Zealand, too have been constantly backing and pushing for inclusion. And with existing markets, barring India, approaching or on the verge of stagnation, the powers-that-be are constantly on the lookout for newer markets. The spate of T20 leagues across the planet is only indicative of the same. What sets things apart this time is the opportunity it provides for India’s women cricketers to break out of the shadows of their male counterparts, on their own terms, on a stage that the men seemingly don’t value as much as the rest of the world does. And a good showing on that stage would only help hasten the achievement of gender parity, in opportunities and emoluments. It will also fuel the growing interest in women’s cricket at home. With talks of a women’s IPL gaining strength and the likes of the Big Bash League and The Hundred drawing top Indian names — unlike the men, the Indian women have been allowed to play in other franchise leagues — the CWG couldn’t have come at a better time for the Indian women. Which also explains the naming of a full-strength squad for the event. What is also different on this occasion is the venue. The 1998 edition was held in Kuala Lumpur, a city not big on cricket, on hastily laid, under-prepared pitches. The interest was mainly from the expats who knew about the sport and the players. This time around, with the games played at Edgbaston on proper pitches in a nation that knows its cricket, both the interest and competition levels are expected to be much higher. The shift, in some ways, is also reflective of the way perceptions have changed in the sport. Just as India has gone from being a country, in foreign minds, of dusty roads, stray cows and the infamous Delhi Belly to being the first stop for every professional cricketer, Indian cricket’s reluctance too has given way to excited, if cautious, curiosity for multi-disciplinary events. “This is something new not just for me but the entire team, we have never been part of an event where other sports are also involved. It’s pretty new and we don’t really know about the Games Village so we are not sure how much we will be able to go around and interact with other athletes. But I would love to have conversations with other athletes on the kind of training they do, trying to know their sports and share their experience,” vice-captain Smriti Mandhana said. It is a novelty, for sure. Smriti added that the team was still processing the shift from aiming for a trophy as the winner to aiming for a podium finish and a medal, imagining the subtle but substantial shifting of targets. A big role in this shifting of perception has been played by one man — Neeraj Chopra, and his Olympic gold. Although the Olympic champion has pulled out of CWG with a strain, he remains a favourite. Powar wanted to pick Neeraj and double Olympic medallist P.V. Sindhu’s brains to handle pressure — “both of them have set the bar high and I would love to go into their minds and their preparations and exchange notes on how they handle the pressure of an entire nation,” he said — and Smriti cited Neeraj’s winning moment as the motivation for doing well. “I literally had goosebumps when the national anthem was played and the flag went up after Neeraj got it in the Olympics. We have all watched these events and everyone knows the feeling when the Indian flag goes up and that’s what we are looking forward to here. We are clearly aiming for gold, not just a podium finish,” she revealed. And Harmanpreet is looking forward to cheering Indian athletes across other sports, something that a standalone cricket tournament can never provide. “I have actually been imagining that. Now it’s not only about cricket. We want to celebrate each and every medal that we win,” she declared. There is an apocryphal story of hockey legend Dhanraj Pillay being asked what he had that Sachin Tendulkar did not. Pillay presumably replied: “I am an Olympian, an Asian Games gold medallist. He can never be one.” The CWG may not be in the same league as the Olympics but the Indian women’s team now has a chance to get that elusive medal cricketers have never had. Our code of editorial values Printable version | Jul 30, 2022 2:19:47 am | https://www.thehindu.com/sport/cricket/indian-cricket-dips-its-toes-in-the-multi-sport-ocean/article65700630.ece © THG PUBLISHING PVT LTD.","pubDate":"2022-07-29 20:47:15","image_url":null,"source_id":"thehindu","country":["india"],"category":["sports"],"language":"english"},{"title":"Harare Sports Club pitch report: Harare pitch report ZIM vs BAN T20 batting or bowling","link":"https://thesportsrush.com/cricket-news-harare-sports-club-pitch-report-harare-pitch-report-zim-vs-ban-t20-batting-or-bowling/","keywords":["Cricket","Bangladesh tour of Zimbabwe 2022","Harare"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Harare Sports Club pitch report: Zimbabwe are set to play their first bilateral T20I series after qualifying for the upcoming T20 World Cup. It was just over a week ago, when Zimbabwe, along with Netherlands had qualified for the imminent ICC T20 World Cup in Australia, by defeating Papua New Guinea by 27 runs in… The post Harare Sports Club pitch report: Harare pitch report ZIM vs BAN T20 batting or bowling appeared first on The SportsRush.","content":"Harare Sports Club pitch report: Zimbabwe are set to play their first bilateral T20I series after qualifying for the upcoming T20 World Cup. It was just over a week ago, when Zimbabwe, along with Netherlands had qualified for the imminent ICC T20 World Cup in Australia, by defeating Papua New Guinea by 27 runs in the semi-final. Bangladesh, on the other hand, have arrived after suffering a 0-2 defeat in the three-match T2oI series against West Indies a few days ago. Moreover, they will be without the presence of some of their veteran players in Tamim Iqbal, who has retired from the format, Shakib-al-Hasan, wicket-keeper batter Mushfiqur Rahim, and Mahmadullah, with Narul Hasan Sohan set to lead the side. The above development might well act as a huge blow to the team, which has struggled in T20Is this year, having not won a series since the T20 World Cup last year. As for Zimbabwe, they would be led by the experienced Craig Ervine, with their eyes set on the best possible preparations for the upcoming T20 World Cup. The Harare Sports Club last hosted Afghanistan in June this year during a three-match T20I series which the hosts lost 0-3. Bangladesh Cricket team practice session at Harare Sports Club. #BCB #Cricket #ZIMvBAN pic.twitter.com/YXxVO6SRE0 — Bangladesh Cricket (@BCBtigers) July 29, 2022 The average score across 32 T20Is at the Harare Sports Club so far is 153. The relatively bigger boundaries at this venue has further meant that the batters have tended to sweat it out while scoring runs here. The pacers do get the desired purchase in the form of seam and bounce with the new ball, especially during the first innings, as the pitch tends to ease out for the batters as the match progresses. This is the same ground where Aaron Finch had, in 2018, smashed 172 runs off 76 deliveries, which still remains the highest individual score in the format history. Thus, the batters tend to feel easy after spending some time on the pitch at this venue. Teams chasing in Harare have won mere 11 of the 32 T20Is. Thus, one can expect the captain winning the Toss to bat first.","pubDate":"2022-07-29 18:36:49","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Sourav Ganguly to play in Legends Cricket League, begins training in gym - check PICS","link":"https://zeenews.india.com/cricket/sourav-ganguly-to-play-in-legends-cricket-league-begins-training-in-gym-check-pics-2490973.html","keywords":null,"creator":null,"video_url":null,"description":"Ganguly has been an inspiration for many young Cricketers who grew up watching him and made it big in the game of Cricket. Millions of fans vouch for his style and passion for Cricket. It would be very exciting for the fans to watch him back on the field.","content":"BCCI president and former India captain Sourav Ganguly will be back on the cricket league. He will take part in a special cricket match in Legends League Cricket. Ganguly confirmed the same through an Instagram LIVE that he is playing a special match in the Season 2 of Legends League Cricket. Recently LLC announced that the upcoming season would be hosted in India. Thus, Indian fans would be able to see Sourav Ganguly play once again, even for a special match for social causes. Raman Raheja, Co-Founder & CEO, Legends League Cricket said, “We thank legendary Sourav Ganguly for playing a match with other legends. Once a legend, always a legend, Dada is always there for Cricket. And he will play a special social cause match, which is going to be a spectacular view for our audience. We hope to see some iconic dada shots.” Ganguly took to Instagram and wrote: \"Enjoying the training to get ready to play for one off charity fund raising game for azadi ka mahatsov..75 years of Indian independence and also for women empowerment with the top legends of the legends league cricket @llct20 need to hit some cricket balls soon ..\" Dada, as he is populary called, has been an inspiration for many young cricketers who grew up watching him and made it big in the game of Cricket. Millions of fans vouch for his style and passion for Cricket. It would be very exciting for the fans to watch him back on the field. View this post on Instagram A post shared by SOURAV GANGULY (@souravganguly) Ganguly featured for India in more than 450 international matches. He played 113 Test matches, scoring 7212 runs at an average of 42.18, with 16 tons and 1 double ton. The former India captain was a successful opening batter for India who played quite a lot in the middle order as well. He played 311 ODIs for India, scoring 11,363 runs at an average of 40.73, with 22 hundreds. Ganguly also had a short IPL career. He played 59 matches, scoring 1349 runs at an average of 25.45 and with a strike rate of 106.81. He retired in 2008 after playing a Test match vs Australia at Nagpur. His last stint on the cricket field in a professional game came 4 years later when he played his last match in 2012 for Pune vs KKR.","pubDate":"2022-07-29 18:16:00","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"CWG: Cricket wins on debut but India lose; paddlers, shuttlers have it easy","link":"https://www.business-standard.com/article/sports/cwg-cricket-wins-on-debut-but-india-lose-paddlers-shuttlers-have-it-easy-122072901539_1.html","keywords":null,"creator":null,"video_url":null,"description":"The Indian women's hockey team was also off to a winning start but it was far from impressive in a 5-0 victory over Ghana in its Pool A game.","content":"The \"killer instinct\" was nowhere to be seen when Australia put the Indian women's cricket team under the pump but the country's shuttlers and paddlers steamrolled their hapless rivals on the opening day of Commonwealth Games competition here. The Indian women's hockey team was also off to a winning start but it was far from impressive in a 5-0 victory over Ghana in its Pool A game. It took some time for the Indian players to find a way in breaching the African nation's defence as the mid-field and forward line lacked cohesion. India's perennial problem of penalty corner conversion was highlighted again with the team utilising just one out of 10 chances. On the contrary, Ghana goalkeeper Abigail Boye made some phenomenal saves to make an impression and was well supported by her backline. Gurjit Kaur (3rd, 39th minutes) scored a brace, while Neha Goyal (28th), Sangita Kumari (36th) and Salima Tete (56th) struck a field goal each. Cricket Team Loses From Winning Position ========================== All-rounder Pooja Vastrakar had exhorted the team to imbibe \"killer instinct\" but it could not deliver the knockout punch even when the rival was staggering. It was always an onerous task for the Indian cricket team to challenge the mighty Australians but Harmanpreet Kaur's side put itself in a winning position before shooting itself in the foot. After scoring a decent 154 for eight, the Indians had them on the mat at 49 for five, but the reigning world champions eventually pulled off a three-wicket win with Ashleigh Gardner (52 not out off 35 balls) raising game-changing stands of 51 and 47 with Grace Harris (37) and Alana King (18 not out) respectively. It meant that Renuka Singh's dream spell went in vain. She broke the backbone of the Australian batting with figures of four for 18 in four overs, raising hopes of a comfortable win, but it was not to be. Easy Day For Shiva Thapa ================ Ace boxer Shiva Thapa outclassed Pakistan's Suleman Baloch in the first round of the 63.5kg category. Having lived with the disappointment of not making his second successive Olympics in Tokyo last year, the former Asian champion was far superior than his taller and aggressive rival to emerge 5-0 winner in his light welter weight category. Shuttlers Blank Pakistan =============== Packed with world class performers, India expectedly made mincemeat of Pakistan in a lop-sided 5-0 win in the mixed team event. World number 11 Kidmabi Srikanth, former world champion P V Sindhu cruised to singles win, while the three doubles pairs also strolled to victories to inflict a whitewash on the neighbouring nation. The gulf in class was evident as the Pakistanis struggled to match the high standards set by the Indians. \"We have come here to definitely win the gold. We will set our targets right and at the same time we are not really thinking about the negative sides of it like whom we are facing in the semifinals or final. \"We're just focused on doing well and winning the gold,\" Srikanth said. Smooth Start For Paddlers ================ India's men and women table tennis teams had easy starts to their respective campaigns with identical 3-0 victories over Barbados and South Africa. Later, the women crushed Fiji 3-0 in their second group match. In a group 3 match against minnows Barbados, the pair of Harmeet Desai and G Sathiyan steamrolled Kevin Farley and Tyrese Knight 11-9, 11-9, 11-4, while veteran Sharath Kamal made short work of Ramon Maxwell 11-5, 11-3, 11-3 in less than 15 minutes. Sathiyan hardly broke a sweat before disposing off Tyrese Knight 11-4, 11-4, 11-5 to seal the tie. In the women's event, the first on court was the doubles duo of Sreeja Akula and Reeth Tennison, who combined well to beat the South African pair of Lailaa Edwards and Danisha Patel 11-7 11-7 11-5 to hand India the lead. Then, reigning Commonwealth Games champion Manika Batra, who became the first Indian table tennis player to win a gold in the women's singles in the last edition, lived up to her billing and thrashed Musfique Kalam 11-5 11-3 11-2 in the first singles match. Akula then came back and scored a dominating 11-5 11-3 11-6 win over Patel in the second singles to seal the tie for India. Day 1 Success for Srihari Natraj, Other Swimmers Struggle ==================================== Srihari Nataraj clocked 54.68s to qualify for the semifinals of the men's 100m backstroke event. The 21-year-old from Bengaluru was the third fastest swimmer in his heat and fifth fastest overall. If he had clocked his personal best of 53.77s he would have topped the heats. The fastest swimmer in the field was South Africa's Pieter Coetze who clocked 53.91. However, the seasoned Sajan Prakash and debutant Kushagra Rawat failed to advance to the semifinal of their respective events. Prakash finished eighth in the heats with a timing of 25.01 in men's 50m butterfly event. The best 16 athletes progressed to the semis. Kushagra too finished last in the men's 400m freestyle event as he stopped the clock at 3:57.45s. Both Prakash and Kushagra are still alive in the competition as they will compete in other events. While Prakash will present his challenge in men's 100m and 200m butterfly, Kushagra will compete in men's 1500m freestyle and 200m freestyle. Cyclists Disappoint ============ The cyclists endured a tough day with the men's sprint team of Ronaldo Laitonjam, Y Rojit Singh, David Beckham Elkatohchoongo failing to make it to the medal round, finishing sixth in the qualification with a total time of 44.702 seconds at the Lee Valley VeloPark. They were 2.480 seconds behind the first place finishers Australia. The fastest two teams will race for gold while the third and fourth finishers in the qualifying round compete for bronze. The women's sprint team also did not do better than the men's side as it ended at seventh in the qualifying round with a total time of 51.433. The Indian men's 4000m pursuit team -- Venkappa Kengalagutti, Dinesh Kumar and Vishavjeet Singh -- finished sixth and last in the qualification with a total time of 4:12.865, which was 23.044 seconds more than the leader New Zealand. (Only the headline and picture of this report may have been reworked by the Business Standard staff; the rest of the content is auto-generated from a syndicated feed.)","pubDate":"2022-07-29 17:56:00","image_url":"https://bsmedia.business-standard.com/_media/bs/img/article/default/1220729/thumb-122072901539.jpg","source_id":"business-standard","country":["india"],"category":["sports"],"language":"english"},{"title":"Warner Park pitch report: Warner Park stadium pitch report IND vs WI 2nd T20 St Kitts","link":"https://thesportsrush.com/cricket-news-warner-park-pitch-report-warner-park-stadium-pitch-report-ind-vs-wi-2nd-t20-st-kitts/","keywords":["Cricket","India tour of West Indies 2022","St Kitts","Warner Park"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Warner Park pitch report: The second of the five-match T20I series between India and West Indies will take place at the Warner Park. After three ODIs and the first T20I at Trinidad, India and West Indies would head towards Basseterre, the capital city of St Kitts, where the second of the five-match T20I series is… The post Warner Park pitch report: Warner Park stadium pitch report IND vs WI 2nd T20 St Kitts appeared first on The SportsRush.","content":"Warner Park pitch report: The second of the five-match T20I series between India and West Indies will take place at the Warner Park. After three ODIs and the first T20I at Trinidad, India and West Indies would head towards Basseterre, the capital city of St Kitts, where the second of the five-match T20I series is scheduled to take place on Monday. The venue will host its first T20 international match after a gap of more than two-and-a-half-years, with the last one played in January 2020, when the Windies prevailed against Ireland in a one-sided contest by 9 wickets. All in all, at total of 10 T20Is (8 complete) have taken place at the St Kitts till date, with the West Indies having won six, and lost a couple (against England) so far. #SpiritofCricket ❤ #WIvIND pic.twitter.com/b9zNrTLT2I — Windies Cricket (@windiescricket) July 29, 2022 The average score at the Warner Park in St Kitts across 10 T20Is (19 batting innings) stands at 144.6 runs. Overall, across the 84 T20 matches played at this venue, the average score jumps up to 161.6. However, an average score of mere 120 for the teams batting first in T20Is at this venue is perhaps suggestive enough that the pitch offers more than enough purchase to the bowlers throughout the innings. This has also meant that the team batting second has won 6 of the 8 complete T20Is at this venue, after nearly complete bowling performances in each of these innings by the side fielding first. Having said that, the fresh pitch on which the match will be played on Monday, might well mean that the freshness of the track helps the bat come on to the bat at the expected pace, which might make run-scoring easier that what the history of T20Is at this venue suggests. All in all, traditionally the pitches at this venue has assisted the bowlers more often than not.","pubDate":"2022-07-29 17:38:38","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Harris 'froths' at Games cricket chance","link":"https://thewest.com.au/sport/cricket/harris-froths-at-games-cricket-chance-c-7692590","keywords":null,"creator":["Murray Wenzel"],"video_url":null,"description":"Grace Harris has made the most of it after forcing her way into Australia's world champion side for Twenty20 cricket's Commonwealth Games debut in Birmingham.","content":"Dean Boxall may have met his match in Australian spark plug Grace Harris. The energetic allrounder announced herself with a match-turning knock in Twenty20 cricket's Commonwealth Games debut in Birmingham on Friday. Fearless despite the world champions teetering at 5-49 in pursuit of 155 against India at Edgbaston, Harris blazed 14 off one over and finished with 37 off just 20 balls. Ash Gardner then took over, piloting the raging gold medal favourites out of trouble to a six-ball, three-wicket win. Starved of opportunities in the green and gold since debuting in 2015, Harris is lapping up the chance to be part of women's cricket history. Her zest for life may even have rattled swimming coach Boxall, who's exuberance when Ariarne Titmus won Tokyo gold captured the world's attention. \"I've been frothing getting around the other athletes and Dean Boxall's my new life hype coach I reckon,\" she said after Australia's win. \"He was great to chat to (at the welcome ceremony) but I probably annoyed him for a fair bit. \"I've grown up watching the Comm Games; mum and I like to critique athletes' outfits at the opening ceremony. \"To be part of the wider Australian team is fantastic, I'm really loving it, I really am.\" Harris only just pipped bowling allrounder Nicola Carey for the No.7 spot in a side strong enough to keep a fit Ellyse Perry on the bench. Bizarrely it was the first time the allrounder has batted or bowled in the five matches she's played since being recalled. \"Any opportunity I can get to shake this specialist fielder tag, I'm all for it,\" the 28-year-old laughed. \"It's always been a hard team to crack into and there's so many people back home that could be on this trip. \"I reached a point where it wasn't that I gave up, but it wasn't what drove me, to make the Australian team.\" Her positive energy has rubbed off on a side already brimming with confidence. \"She's a really bubbly character and takes the game on; she's not scared to get out. She got out there and said, 'C'mon let's do this',\" Gardner said. Captain Meg Lanning said her presence had added another layer to the all-conquering side. \"It's a great sign for the team that someone like Grace can come out and dominate on the world stage,\" she said. \"She is quite the character; very loud voice, lots of laughing. She's brought a great energy to the group and is properly embracing the Commonwealth Games and everything that goes with it.\" Sign up for our emails","pubDate":"2022-07-29 17:36:29","image_url":"https://images.thewest.com.au/publication/C-7692590/c35a6828e53e089ea51288f5d9c91d2c738c8795-16x9-x0y0w1280h720.jpg","source_id":"thewest","country":["australia"],"category":["sports"],"language":"english"},{"title":"“Chittar khaane se pehle runs banaa diye”: Yuvraj Singh compliments Shubman Gill for winning first Man of the Series award in international cricket","link":"https://thesportsrush.com/cricket-news-chittar-khaane-se-pehle-runs-banaa-diye-yuvraj-singh-compliments-shubman-gill-for-winning-first-man-of-the-series-award-in-international-cricket/","keywords":["Cricket","Abhishek Sharma","India","India tour of West Indies 2022","Punjab","Shubman Gill","West Indies","Yuvraj Singh"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Yuvraj Singh compliments Shubman Gill: The former Indian all-rounder expressed happiness for a rookie Indian batter. Former India all-rounder Yuvraj Singh took to social media platforms this evening to post a light-hearted video around the recent success of India batter Shubman Gill. Making an ODI comeback after more than 18 months without having played a… The post “Chittar khaane se pehle runs banaa diye”: Yuvraj Singh compliments Shubman Gill for winning first Man of the Series award in international cricket appeared first on The SportsRush.","content":"Yuvraj Singh compliments Shubman Gill: The former Indian all-rounder expressed happiness for a rookie Indian batter. Former India all-rounder Yuvraj Singh took to social media platforms this evening to post a light-hearted video around the recent success of India batter Shubman Gill. Making an ODI comeback after more than 18 months without having played a single List A match in between, Gill justified his selection in the Playing XI for three ODIs in West Indies by becoming the highest run-scorer. Gill, who scored 205 runs at an average and strike rate of 102.50 each, missed out on a maiden international century in the third ODI but managed to bag a maiden Player of the Series award earlier this week. Yuvraj’s 92-second video whilst working out featured Punjab and Sunrisers Hyderabad batter Abhishek Sharma. Been part of India’s U-19 World Cup-winning squad in 2018 alongside Gill, Sharma revealed having a telephonic conversation with him before the third ODI in Port of Spain. “I am very happy, bhaji [brother]. Had spoken to him a day before the match. He had said it would be great to score a maiden hundred [in international cricket]. All the practice sessions paid off well. Many congratulations to him for winning his first Man of the Series. Many more to come,” Sharma told Yuvraj in the video. Yuvraj Singh compliments Shubman Gill for winning first Man of the Series award in international cricket Seemingly joyous for Gill’s achievements, Yuvraj congratulated the 22-year old player although with a sarcastic message. “Acha hua [ki] chittar khaane se pehle usne runs banaa diye [Good for him that he made those runs before I beat him up]. Good start. Long way to go,” Yuvraj responded to Sharma’s congratulatory message in an amusing manner. Gill, who had made his List A (alongside Sharma) and first-class debut for Punjab under former India spinner Harbhajan Singh, has shared the dressing room with Yuvraj on a few occasions in domestic cricket. Yuvraj, who is more of a mentor-figure for both Gill and Sharma, has been both critical and supportive of these two players over the years. Perhaps keen to see them achieve success at the highest level, Yuvraj has publicly talked about Gill and Sharma in the past as well. Congrats @ShubmanGill on your first man of the series award Here are some kind words on your performance from your good friend Sir @IamAbhiSharma4 pic.twitter.com/6zDVxH9MMJ — Yuvraj Singh (@YUVSTRONG12) July 29, 2022 Gill commented under Yuvraj’s video on Instagram acknowledging that he was aware about the cuss words which would have come his way from him had he not scored in West Indies. Shubman Gill comments on Yuvraj Singh’s post on Instagram. Having grabbed an ODI opportunity with both hands, Gill’s next target should be to stand tall on his potential in Test cricket. A player of his ability is expected to do better than scoring 579 runs at an average of 30.47 in his first 11 Test matches. The post “Chittar khaane se pehle runs banaa diye”: Yuvraj Singh compliments Shubman Gill for winning first Man of the Series award in international cricket appeared first on The SportsRush.","pubDate":"2022-07-29 17:25:02","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Four Shpageeza Premier League spectators wounded in grenade blast","link":"https://sportstar.thehindu.com/cricket/four-sphageeza-premier-league-spectators-injured-grenade-blast-taliban-cricket/article65700331.ece","keywords":null,"creator":["\n        AFP  \n    "],"video_url":null,"description":"The explosion happened at a match between Pamir Zalmi and Band-e-Amir Dragons in the country's domestic T20 league, held at the Kabul International Cricket Stadium.","content":null,"pubDate":"2022-07-29 17:08:24","image_url":null,"source_id":"sportstar","country":["india"],"category":["sports"],"language":"english"},{"title":"LIVE IND vs WI 1st T20I Cricket Score and Updates: Brooks Perishes, India On Top - India.com","link":"https://news.google.com/__i/rss/rd/articles/CBMi6gFodHRwczovL3d3dy5pbmRpYS5jb20vc3BvcnRzL2xpdmUtaW5kLXZzLXdpLTFzdC10MjBpLWNyaWNrZXQtc2NvcmUtdHJpbmlkYWQtbWF0Y2gtdXBkYXRlcy1pbmRpYS12LXdlc3QtaW5kaWVzLWxpdmUtc3RyZWFtLWRkLWZhbmNvZGUtYmFsbC1ieS1iYWxsLWNvbW1lbnRhcnktdGFyZ2V0LTE5MS1tYXllcnMtaGV0bXllci1wb29yYW4tcm9oaXQta2FydGhpay1iaHV2aS1hc2h3aW4tYXJzaGRlZXAtNTU0MTc0NS_SAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"LIVE IND vs WI 1st T20I Cricket Score and Updates: Brooks Perishes, India On Top  India.comIndia vs West Indies 1st T20I LIVE CRICKET SCORE and UPDATES, ball by ball commentary: West Indies are 52/3 in 7 overs  FirstpostMatch Preview - India vs West Indies, India in West Indies 2022, 1st T20I  ESPNcricinfoRohit Sharma rejects claims of 'conservative cricket' in T20 WCs | Cricbuzz.com - Cricbuzz  Cricbuzz'Pragyan? Is He Doing Commentary Now'-Rohit Sharma Reacts To Former India Spinner's Remarks  News18View Full coverage on Google News","content":null,"pubDate":"2022-07-29 17:03:18","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"England begin Commonwealth Games cricket without captain Heather Knight","link":"https://www.theguardian.com/sport/2022/jul/29/england-begin-commonwealth-games-cricket-without-captain-heather-knight","keywords":["Commonwealth Games 2022","Commonwealth Games","England women's cricket team","Women's cricket","Cricket","Sport"],"creator":["Raf Nicholson"],"video_url":null,"description":"Lingering hip injury rules 31-year-old out of Sri Lanka matchWomen’s cricket making first appearance at the GamesThe England captain, Heather Knight, will miss her side’s opening fixture at the Commonwealth Games against Sri Lanka on Saturday due to a lingering hip injury.Women’s cricket is making its debut appearance at the Games, in a Twenty20 tournament at Edgbaston between 29 July and 7 August. Knight has received an injection in her hip in a bid to soothe some irritation in the joint, having missed the final two T20s of the multiformat series against South Africa, and hopes to be fit to return in the remaining matches. Meanwhile, Nat Sciver will deputise as skipper for the Sri Lanka fixture. Continue reading...","content":"The England captain, Heather Knight, will miss her side’s opening fixture at the Commonwealth Games against Sri Lanka on Saturday due to a lingering hip injury. Women’s cricket is making its debut appearance at the Games, in a Twenty20 tournament at Edgbaston between 29 July and 7 August. Knight has received an injection in her hip in a bid to soothe some irritation in the joint, having missed the final two T20s of the multiformat series against South Africa, and hopes to be fit to return in the remaining matches. Meanwhile, Nat Sciver will deputise as skipper for the Sri Lanka fixture. England begin Commonwealth Games netball title defence with easy victory Read more Missing out on the opening encounter will come as a blow for Knight with the 31-year-old describing its inclusion in the Commonwealth Games as “another gamechanger” for women’s cricket. Ticket sales are said to be flying and England are hopeful of success in front of a big home crowd – some of whom will never have watched live cricket before. “We want to try and bring it home,” Knight said. “Hopefully we can entertain some people and persuade them to come to cricket again.” The eight competing teams have been split into two groups – Group A (Australia, Barbados, India and Pakistan) and Group B (England, New Zealand, South Africa and Sri Lanka). England can be reasonably confident of securing a semi-final berth, but it is the gold medal match on 7 August which Knight has her heart set on. “When you’re a kid you watch the Olympics, you watch the Commonwealths, and you see the special moment that a podium medal ceremony is,” Knight said. “It would be super special to be a part of that.” While Australia are firm favourites to win gold at the Games, their preparations for the tournament have been disrupted by a series of washouts in their warmup series in Ireland. By contrast, England are fresh from beating South Africa 3-0 in the T20 leg of their series and appear to have regained some of the swagger that was missing from their winter Ashes campaign. “We’ll take a massive amount of confidence in,” Knight said. “The important thing is that we take the same mindset into a big world event and that we take what we’ve done so well and perform it under pressure.” “Hopefully we can continue the really good form we’ve had so far this summer, the dominant way we’ve played, and the aggressive intent that we’ve shown.” England gave debuts to 17-year-olds Alice Capsey and Freya Kemp during the South Africa series; Capsey in particular will have an important role to play in their batting lineup, especially in the absence of Knight. The 20-year-old seamer Issy Wong has also had an exciting summer to date, with eight wickets across the three formats, and may well be handed the new ball. Quick Guide England v Sri Lanka probable teams Show England: Sophia Dunkley, Danni Wyatt, Alice Capsey, Nat Sciver (capt), Amy Jones (wkt), Maia Bouchier, Bryony Smith, Katherine Brunt, Sophie Ecclestone, Issy Wong, Sarah Glenn Sri Lanka: Vishmi Gunaratne, Chamari Athapaththu (capt), Harshitha Samarawickrama, Nilakshi de Silva, Kavisha Dilhari, Ama Kanchana, Anushkha Sanjeewani (wkt), Malsha Shehani, Oshadi Ranasinghe, Sugandika Kumari, Inoka Ranaweera Was this helpful? Thank you for your feedback. Knight says the youngsters have added “energy, rawness and fearlessness” to her team. “For us older girls, it’s keeping us young and keeping us excited,” she said. “I’m loving being a part of the early stage of their career, and trying to help them as much as I can, and just let them loose and give them the confidence to go and do what they do and show off.” England will be optimistic of success on Saturday: Sri Lanka are ranked No 8 in the world in T20s and reached the Games only by virtue of beating Bangladesh in the qualifying tournament in Malaysia in January. However, England should take nothing for granted: they were beaten by the Sri Lankans during the 2013 World Cup, thanks to a Chamari Athapaththu masterclass. A repeat performance from the Sri Lanka captain, who hit 80 in 48 balls against India in her most recent T20 innings, is not out of the question.","pubDate":"2022-07-29 16:39:58","image_url":"https://i.guim.co.uk/img/media/efc1782d38351c3f9e87b9d5477dbeac65148a8f/0_53_4154_2492/master/4154.jpg?width=460&quality=85&auto=format&fit=max&s=6e7390b0621c3c5ff2ceb1dc3226a69b","source_id":"theguardian","country":["united kingdom","india","singapore","canada"],"category":["sports"],"language":"english"},{"title":"India vs West Indies, 1st T20I Highlights: Rohit Sharma, Dinesh Karthik And Bowlers Power India To B.. - NDTV Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMidGh0dHBzOi8vc3BvcnRzLm5kdHYuY29tL3dlc3QtaW5kaWVzLXZzLWluZGlhLTIwMjIvaW5kaWEtdnMtd2VzdC1pbmRpZXMtMXN0LXQyMGktaW5kLXZzLXdpLWxpdmUtc2NvcmUtdXBkYXRlcy0zMjA2Mzk10gF6aHR0cHM6Ly9zcG9ydHMubmR0di5jb20vd2VzdC1pbmRpZXMtdnMtaW5kaWEtMjAyMi9pbmRpYS12cy13ZXN0LWluZGllcy0xc3QtdDIwaS1pbmQtdnMtd2ktbGl2ZS1zY29yZS11cGRhdGVzLTMyMDYzOTUvYW1wLzE?oc=5","keywords":null,"creator":null,"video_url":null,"description":"India vs West Indies, 1st T20I Highlights: Rohit Sharma, Dinesh Karthik And Bowlers Power India To B..  NDTV SportsIndia vs West Indies 1st T20I HIGHLIGHTS: India win by 68 runs, go 1-0 up in the series  FirstpostMatch Preview - India vs West Indies, India in West Indies 2022, 1st T20I  ESPNcricinfoRohit Sharma rejects claims of 'conservative cricket' in T20 WCs | Cricbuzz.com - Cricbuzz  CricbuzzIND vs WI: Suryakumar Yadav's Flick, Dinesh Karthik's Switch Hit Steal the Show | WATCH  News18View Full coverage on Google News","content":null,"pubDate":"2022-07-29 16:20:14","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Renuka Singh husband: Renuka Singh Thakur hometown and family details","link":"https://thesportsrush.com/cricket-news-renuka-singh-husband-renuka-singh-thakur-hometown-and-family-details/","keywords":["Cricket","Commonwealth games","CWG 2022","Renuka Singh"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Renuka Singh husband: A valiant effort with the new ball from Renuka Singh went in vain during the Commonwealth Games opener. A 34-ball half-century from the Aussie all-rounder Ashleigh Gardner, and a couple of vital contributions from the lower-middle order helped Australia snatch victory from India’s grasp as the Commonwealth Games 2022 commences today in… The post Renuka Singh husband: Renuka Singh Thakur hometown and family details appeared first on The SportsRush.","content":"Renuka Singh husband: A valiant effort with the new ball from Renuka Singh went in vain during the Commonwealth Games opener. A 34-ball half-century from the Aussie all-rounder Ashleigh Gardner, and a couple of vital contributions from the lower-middle order helped Australia snatch victory from India’s grasp as the Commonwealth Games 2022 commences today in Birmingham. En route the target of 155, the imperious Australian top-order was rattled by a dream spell of swing bowling from Renuka Singh, who got rid of the top-4 inside the first four Overs of the chase, to almost puncture the spirits of the Australian camp. However, with Australia batting deep, Ashleigh Gardner (52* off 35), Grace Harris (37 off 20), and then Alana King (18* off 16) at no.9 in the order, nailed the chase by 3 wickets and with one Over to spare, to further stamp their authority before the Cricketing world as the undisputed world champions. Apart from Renuka, who returned with her career-best T20I figures of 4-0-18-4, opener batter Shafali Verma (48 off 33) and skipper Harmanpreet Kaur (52 off 34) were the other two standout performers for team India, although their efforts were just not enough before the mighty Aussies. The 26-year-old right-arm medium fast bowler soon made headlines after a top-notch bowling effort which saw the end of one of the most feared quartet in women’s Cricket – Alyssa Healy (0 off 2), Beth Mooney (10 off 9), Meg Lanning (8 off 5), and Tahlia McGrath (14 off 8). Renuka hails from the Parsa village (town Rohru) in the Shimla district of the state of Himachal Pradesh. The going was never easy for her ever since she lost her father Kehar Singh Thakur at the age of three. Thakur used to work at the Himachal Pradesh irrigation and public health department in Rohru, and was then replaced by Renuka’s mother Sunita in the job as a class IV employee, post his demise. Renuka’s elder brother Vinod Thakur also aimed at pursuing a career in Cricket, but had to sacrifice the same for his younger sister, as the family could not afford the huge cost involved with the sport. Renuka Singh Thakur’s has to be the greatest international spell by anyone born in Shimla. Robin Jackman, Neville Tufnell, or Shafaqat Rana never had a spell this good. — Abhishek Mukherjee (@ovshake42) July 29, 2022 The 26-year-old’s current marital status is unmarried, and she has not made her relationship (if any) with anyone public on any social media platform either.","pubDate":"2022-07-29 16:07:24","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Losing father at 3, leaving home at 13 for cricket, Renuka Singh Thakur grabs the spotlight","link":"https://sportstar.thehindu.com/commonwealth-games/news/renuka-thakur-india-australia-commonwealth-games-womens-cricket/article65700000.ece","keywords":null,"creator":["\n        Shayan Acharya  \n    "],"video_url":null,"description":"Renuka Singh Thakur bagged four wickets against in India’s Commonwealth Games opener against Australia.","content":null,"pubDate":"2022-07-29 16:05:21","image_url":null,"source_id":"sportstar","country":["india"],"category":["sports"],"language":"english"},{"title":"Jimmy Anderson, England’s cold-weather Warne, still the ultimate magician at 40 | Barney Ronay","link":"https://www.theguardian.com/sport/blog/2022/jul/29/as-jimmy-anderson-turns-40-we-fear-we-will-never-see-his-like-again","keywords":["Jimmy Anderson","England cricket team","Sport","Cricket"],"creator":["Barney Ronay"],"video_url":null,"description":"England’s greatest bowler has benefited from his country’s focus on Test cricket and the fear is we will not see his like againFor many years there was a Jimmy Anderson poster on the back of London buses advertising a well-known brand of bro-vitamins, the kind of everyday pill that makes men happy, toned, slabbed, thickly coiffured, good at sport, magnetic in social situations and frankly – if I can speak plainly here – stone cold model-handsome. The advert seems to have gone now which is a shame because it was very funny. What made it work was the strapline “I FEEL FANTASTIC”, pasted in throbbing alpha-dog script over a picture of Anderson staring balefully into the camera, looking chiselled and fit as ever, but wearing that familiar expression of a man marooned at a windswept rural bus stop in a pair of rain sodden plimsolls who has, just this moment, taken his first ever bite of celery.It was never really clear if Anderson was supposed to be saying I feel fantastic, which just doesn’t seem like the kind of thing that would happen, or overhearing someone else saying it and muttering and rolling his eyes, or if this was always intended as a highly sophisticated piece of double-take branding, like hiring Mark E Smith to scoot around in a Mini covered in stickers trying to sell you a portered new-build two-bed in Fulham. Continue reading...","content":"F or many years there was a Jimmy Anderson poster on the back of London buses advertising a well-known brand of bro-vitamins, the kind of everyday pill that makes men happy, toned, slabbed, thickly coiffured, good at sport, magnetic in social situations and frankly – if I can speak plainly here – stone cold model-handsome. The advert seems to have gone now which is a shame because it was very funny. What made it work was the strapline “I FEEL FANTASTIC”, pasted in throbbing alpha-dog script over a picture of Anderson staring balefully into the camera, looking chiselled and fit as ever, but wearing that familiar expression of a man marooned at a windswept rural bus stop in a pair of rain sodden plimsolls who has, just this moment, taken his first ever bite of celery. It was never really clear if Anderson was supposed to be saying I feel fantastic , which just doesn’t seem like the kind of thing that would happen, or overhearing someone else saying it and muttering and rolling his eyes, or if this was always intended as a highly sophisticated piece of double-take branding, like hiring Mark E Smith to scoot around in a Mini covered in stickers trying to sell you a portered new-build two-bed in Fulham. The Hundred could save England’s international teams, says Eoin Morgan Read more The real reason it seems timely now is that Anderson’s longevity, his basic refusal to yield, has passed from a useful tool for selling vitamins into something genuinely startling. Cricket loves its milestones. Here’s another one, a marker that really does deserve its own flag. Anderson, England’s greatest ever wicket-taker, currently the sixth-ranked men’s Test bowler in the world, turns 40 on Saturday. Yes! Forty! Anderson hates talking about his age. He says it’s irrelevant, which is true, but also not true once you take a step back and absorb how much of an outlier he has become. By the time the first Test against South Africa rolls around in mid-August England will have, for the first time ever, a 40-year-old opening bowler – and not some creaking old sage, but this miraculously lithe figure still snaking in and sending down the odd 87mph delivery, surely the oldest person ever to bowl at these speeds in an international game. Frankly the whole thing is fantastical, a feat of will and athletic brilliance that, as has often been the case with Anderson, feels as though it really does have to mean something. But what exactly? There is a tendency in English sport to overdo the fond fuzzy eulogy stuff. A few weeks back Ben Stokes retired from a format he has played 10 times in the past three years, games nobody can remember, which are literally just coloured shirts doing things, a mumbled speech in front of a TV board, and was hailed like a viking king being sent off in his flaming longboat watched by the spirits of the noble warrior dead. The English are good at this. We do send-offs and speeches. Three cheers. Ladies and gentleman, the Queen. It’s a kind of status brag, subtly pitched. This is different though. Trying to work out what Anderson means. This has been a constant refrain since his emergence as a skunk-haired prodigy through to his enthronement as an indestructible embodiment of high summer craft. The search for meaning usually centres on greatness. It’s the easiest thing. Look at the numbers. When Anderson got to 600 wickets two years ago he was hailed by some, in this country at least, as the greatest fast bowler of all time. But it is pretty hard to be the greatest. Malcolm Marshall, Dale Steyn, Wasim Akram, Curtly Ambrose, Pat Cummins, Richard Hadlee and Glenn McGrath all say hi. Eighteen pace bowlers have taken more than 200 wickets and averaged under 25 in the modern era, and Anderson is not one of them. Jimmy Anderson acknowledges the crowd after taking his fifth wicket against Pakistan at Trent Bridge in 2010. Since that summer he has taken over 500 Test wickets at an average of around 23. Photograph: Philip Brown/Reuters On the other hand Anderson’s body of work is such a vast data mine it isn’t hard to find outright greatness in there. The summer of 2010 is a Damascene moment in Anderson lore. Already 28 years old, scarred by injury and failure, Anderson was moved to trust his basic action, to focus on pressure and craft. Since then he has more than 500 wickets at around 23, evidence of absolute mastery of his skills, the ability to swing, wobble, reverse, bowl dry, to be more effective in the last three years overseas than in England. This is greatness, unarguable and hard-earned.But, it isn’t just that. Because people also love Anderson. There is something so fond and tender in his presence on an English field. Even the run-up feels intimate, with that reluctant first step, then a kind of shiver as he eases up into a sprint, feet splayed into the coil and whip, head still dipping like a maestro’s bow at the point of release. Anderson has sent down 68,970 deliveries this way, has run the length of Britain, with a ball in his hand. It feels significant too that he emerged outside the current closed world of age group systems and elite pathways, that his first incarnation was as an unskilled teenage tearaway, driven by the outsider’s curiosity to study and evolve and learn new forms. This is in part why people love Anderson. But it’s not just that either. Perhaps it’s about beauty, because if he does have claim on ultimacy it is this, that Anderson is the most aesthetically beautiful of all seam and swing bowlers. Even now there is something beguiling in the ease and grace of his movements, in the variations of wrist and fingertips. My own favourite bit of Anderson is still his five-fer on Test debut as a baggy-trousered kid, where he keeps on turning the Zimbabwe batters around the wrong way, making them chase ghosts, clipping to leg, then whirling back as off-stump clanks out of the ground, a street magician’s trick. Over time it became clear that he is basically English cricket’s Warne, all deception and control, but a Warne designed for cold days and cold fingers, softer English air. The Spin: sign up and get our weekly cricket email. And perhaps this is what Anderson means, if he means anything. Never mind the numbers, the beauty, the backstory. What he represents is a state of grace. There he is, still out there doing this thing in the dog days of a dying form. Let’s face it, one reason Anderson can do this is because only England really zeroes on Test cricket to this degree, because in the end the rest of the world has its eyes elsewhere. Another summer of Anderson: it is a kind of fever dream, with the promise that while he’s still running in we can pretend that this will always happen, that things will always feel fantastical, the last great silent movie actor cleaning up before the talkies wash all this away. There are many different reasons why. But we really will never see his like again.","pubDate":"2022-07-29 16:02:20","image_url":"https://i.guim.co.uk/img/media/cd45ffc98b89fd51661cab0d73a1292e1f6f427b/0_0_2560_1536/master/2560.jpg?width=460&quality=85&auto=format&fit=max&s=e20d793f0e15f82c3e11930b0db244dd","source_id":"theguardian","country":["united kingdom","india","singapore","canada"],"category":["sports"],"language":"english"},{"title":"West Indies vs India: West Indies vs India, 2022 Live Cricket Score, Live Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/west-indies-vs-india-live-score-over-1st-t20i-t20-16-20-updates-3206948","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between West Indies vs India from Brian Lara Stadium, Tarouba, Trinidad. Check commentary and full scoreboard of the match.","content":"Follow the West Indies vs India, 2022 live cricket score on Sports.NDTV.com . After 20.0 overs, India are 190/6. Get live score, ball by ball commentary and much more. Keep track of West Indies vs India, 2022 today match between West Indies and India. Everything related to West Indies and India match will be available on Sports.NDTV.com . Stay updated with West Indies vs India live score. Do check for West Indies vs India scorecard. You can get scorecard updates, match related facts. Get quick live updates with ads, Sports.NDTV.com , which is the perfect destination for live cricket score. We are back for the chase! ... The Run Chase ... West Indies were unable to end on a high. Their pacers were taken to the cleaners initially, but they did manage to take two wickets inside the Powerplay. India lost track in the middle but Dinesh Karthik, the veteran continues to impress in his new role. Rohit Sharma and Suryakumar Yadav started well against the pace, but the latter could not fare the same way against the spin of Akeal Hosein. Yadav almost got out twice but had the lady luck on his side. Although the third time he did slip out with a poor shot selection. Later, Rohit Sharma was unable to find a partner to control things at the other end, except Pant. The two stitched a stand of 43 runs the third best of this Indian innings. Once Pant fell, the visitors started losing wickets at regular intervals which put them in a spot of bother. Sharma could not bat till the end and slipped out on 64. If not for Karthik and Ashwin, things could've been worse for India. An incredible shift in momentum for India. Dinesh Karthik and Ravichandran Ashwin stitched the largest stand of the innings to get 190 runs on the scoreboard. West Indies would feel they missed a trick or two with the ball in the death overs and are in for a mammoth run chase. 19.6 overs (4 Runs) FOUR! Ends with a boundary! This is full and wide, Dinesh Karthik throws his hands at it and ends up slicing it high. The ball goes well over point and trickles away into the fence. India finish on 190/6! 19.5 overs (0 Run) Switches to around the wicket now and angles it into the body. Karthik looks to swing across the line but misses and gets hit on the body. 19.4 overs (4 Runs) FOUR! Not where he intended it to go but Dinesh Karthik will certainly take it. This is on a length and down leg, Karthik attempts the reverse hit but gets a thick outside edge that flies over short third man and into the fence. 19.3 overs (6 Runs) SIX! Pitches it up around off, Dinesh Karthik gets under it and launches it a long way over the long off fence. The boundaries are flowing here for India. 19.2 overs (0 Run) Missed opportunity! Length and down leg, Karthik fails to flick it away as the ball hits the thigh pad. 19.1 overs (1 Run) Back of a length, around the hips. Ravichandran Ashwin tries to play it off the back foot but gets a top edge over the point region. Just a single. Also, the five fielders are still inside the ring which means that it is a forced change due to being behind in terms of the over-rate. 18.6 overs (4 Runs) FOUR! Poor field placement and poor bowling as well. Pooran gets in all fielders inside the circle on the off side and Holder bowls it short and wide, from around the stumps. All Karthik has to do is get a decent connection and he does exactly that. The ball runs away for a boundary and 21 runs come off the over, a huge one for India. 18.5 overs (6 Runs) SIX! BANG! Pace on from Holder but serves it on a length, around middle and leg. Dinesh Karthik has a slight shuffle as he clobbers it over the mid-wicket fence for a second maximum in the over. 18.4 overs (2 Runs) This is banged in short and around off, slower in pace. Dinesh Karthik pulls it away behind square and picks up a couple of runs. 18.3 overs (1 Run) And again! Slower and shorter, this time over middle, Ashwin pulls it down to wide long on for one. 18.2 overs (0 Run) Well bowled! Goes slower and bowls kt into the pitch, pushing it wide outside off. Ashwin tries to swing across the line but fails to reach it. 18.2 overs (7 Runs) NO BALL AND SIX! Ravichandran Ashwin makes full use of the life gifted to him and dispatches it. A juicy full toss, around leg stump, Ashwin ships it away over the square leg fence for a maximum. To rub salt into the wound, Holder has overstepped and it will be a Free Hit to follow. 18.1 overs (1 Run) Pre-meditated and not so effective. Dinesh Karthik goes for the reverse sweep, Holder sees it early and serves a slower yorker on leg stump. Karthik can only manage to hit it towards cover-point for a single. Jason Holder to bowl the penultimate over. He continues his spell. 17.6 overs (1 Run) A touch fuller and angling across off, Dinesh Karthik plays it off the front foot and through extra cover for just a single. 17.5 overs (1 Run) Floats it up on the pads now, Ravichandran Ashwin flicks it uppishly through the vacant mid-wicket region and rotates the strike. 17.4 overs (0 Run) This is on a hard length and angling across, Ashwin tries to cut but misses. 17.4 overs (2 Runs) TWO WIDES! Another slower ball, spilled well down leg and Nicholas Pooran behind the sticks misses it too. The batters scamper through for a run as well. 17.3 overs (2 Runs) That is bizarre from Obed McCoy, Ashwin was a goner but McCoy doesn't whip off the bails. This is slower and fuller, on middle. Karthik pushes it down to long on and calls for two right away. Ashwin is struggling when the throw comes in at the bowler's end but McCoy inexplicably has no idea where Ashwin is and doesn't dislodge the bails. How much will this cost West Indies? 17.2 overs (2 Runs) In the air but safe! Good change of pace from Obed McCoy, slower and fuller, around middle. Dinesh Karthik looks to flick it away but is a bit early in his shot. The ball goes up high off the leading edge and falls safely over mid off. Two taken. 17.1 overs (1 Run) McCoy gets it in the blockhole around off, Ashwin digs it out on the off side and scampers through for a run. Change. Obed McCoy (2-0-6-1) is back into the attack now. 16.6 overs (1 Run) This is smart from Holder, giving the batter no pace to work with. Banged in short and outside off, Ravichandran Ashwin bends his back and ramps it down to third man for just a single. 16.5 overs (1 Run) Slower delivery, on a shorter length and outside off, Karthik just taps it towards cover-point and picks up a single. 16.4 overs (1 Run) Full and straight, this is drilled down to long on for a single by Ashwin. 16.3 overs (1 Run) Around off again, Karthik presses forward and plays it on the up towards deep cover for one more. 16.2 overs (1 Run) Fuller and around off, this is driven through covers for a run. 16.2 overs (1 Run) WIDE! Slower delivery, angling it in from wide of the crease. The attempted slower yorker just goes down leg and a wide is called. There is an appeal for LBW but the umpire turns it down. They have gone for the review though! The ball seems to be going down leg but the decision is sent upstairs. UltraEdge is checked first and it shows that there is no bat involved but there is no pad involved either, so it will stay as a wide. 16.1 overs (1 Run) Length, around off, this is pushed towards mid off for a single. Ravichandran Ashwin comes in at number 8. 15.6 overs (0 Run) OUT! CAUGHT! Straight to the man! This is shorter from Alzarri Joseph and angling across the left-hander. Ravindra Jadeja tries to be cute and opens the face of the bat to steer it past the man at short thirs man. jadeja though gets a bit hurried on by the pace and ends up giving catch practice to Keemo Paul over there. Joseph ends an expensive spell with an important wicket and India are now six down. 15.5 overs (1 Run) Back of a length and outside off, Karthik steers it down to third man for just a single. 15.4 overs (1 Run) The call is for two but they have to settle for one. This is slanted across off, Jadeja strokes it away through cover-point for one. 15.3 overs (1 Run) Excellent running! Around off again, Karthik pushes it towards covers and sets off for the run. 15.2 overs (4 Runs) FOUR! Delightful from Dinesh Karthik and he is off the mark! Length, around off, Karthik presses forward and drives it on the up through extra cover for a boundary. 15.1 overs (0 Run) Starts off with a good-length ball, angled into the body. Karthik dabs it leg side but can't get the single.","pubDate":"2022-07-29 16:01:46","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637947270980587206.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"LIVE IND vs WI 1st T20I Cricket Score and Updates: Karthik Joins Jadeja As Rohit Falls Before Final Flourish - India.com","link":"https://news.google.com/__i/rss/rd/articles/CBMi6wFodHRwczovL3d3dy5pbmRpYS5jb20vc3BvcnRzL2xpdmUtaW5kLXZzLXdpLTFzdC10MjBpLWNyaWNrZXQtc2NvcmUtdHJpbmlkYWQtYnJpYW4tbGFyYS1zdGFkaXVtLW1hdGNoLXVwZGF0ZXMtaW5kaWEtdi13ZXN0LWluZGllcy1saXZlLXN0cmVhbWluZy1kZC1mYW5jb2RlLWJhbGwtYnktYmFsbC1jb21tZW50YXJ5LXJvaGl0LWphZGVqYS1wYW50LWthcnRoaWstYXNod2luLWFsemFycmktbWF5ZXJzLTU1NDE3NDUv0gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"LIVE IND vs WI 1st T20I Cricket Score and Updates: Karthik Joins Jadeja As Rohit Falls Before Final Flourish  India.comIndia vs West Indies 1st T20I LIVE CRICKET SCORE and UPDATES, ball by ball commentary: India are 175/6 after 19 overs  FirstpostMatch Preview - India vs West Indies, India in West Indies 2022, 1st T20I  ESPNcricinfoRohit Sharma rejects claims of 'conservative cricket' in T20 WCs | Cricbuzz.com - Cricbuzz  CricbuzzIndia vs West Indies Live Streaming: When and Where to Watch first T20I Live Coverage on Live TV Online  News18View Full coverage on Google News","content":null,"pubDate":"2022-07-29 16:00:54","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"West Indies vs India Live Score Ball by Ball, West Indies vs India, 2022 Live Cricket Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/west-indies-vs-india-live-score-over-1st-t20i-t20-11-15-updates-3206833","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between West Indies vs India from Brian Lara Stadium, Tarouba, Trinidad. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-07-29 15:51:25","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637947264768208389.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Virat Kohli next match date: When will Virat Kohli play for India again?","link":"https://thesportsrush.com/cricket-news-virat-kohli-next-match-date-when-will-virat-kohli-play-for-india-again/","keywords":["Cricket","Virat Kohli"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Virat Kohli next match date: The former team India skipper opted to rest from the ongoing limited Overs away series versus West Indies. An ordinary outing to the tour of England a few days ago for former India skipper Virat Kohli remained yet again the topic of debates and discussions pertaining his extended slump in… The post Virat Kohli next match date: When will Virat Kohli play for India again? appeared first on The SportsRush.","content":"Virat Kohli next match date: The former team India skipper opted to rest from the ongoing limited Overs away series versus West Indies. An ordinary outing to the tour of England a few days ago for former India skipper Virat Kohli remained yet again the topic of debates and discussions pertaining his extended slump in form, especially in the Test format. Also, having played mere four T20Is since the T20 World Cup last year, coupled with a poor IPL 2022 with the bat, fans and experts have even started questioning his place in the squad for the T20 World Cup in Australia this October onwards. There was a time when you were out of form, you would be dropped irrespective of reputation. Sourav, Sehwag,Yuvraj,Zaheer, Bhajji all have been dropped when not in form. They have went back to domestic cricket, scored runs and staged a comeback. The yardsticks seem to have 1/2 — Venkatesh Prasad (@venkateshprasad) July 10, 2022 As for the England tour last month, Kohli returned with underwhelming scores across formats. He scored 31 runs across the two innings of the Edgbaston Test, followed it up with mere 12 runs in two T20Is and finally only 33 runs in the two ODIs. On top of it, with him also deciding to mark his unavailability for the eight White-ball matches of team India’s ongoing tour of West Indies, questions have further risen as to when will the champion batter play for India next and prove that he is still the indispensable force in the Indian Cricket team. As per a BCCI source, the 33-year-old will tour with the second-string Indian team to Zimbabwe next month for the three match ODI series. As per the source, the team management wishes to hand Kohli the required match practice to help him regain his lost form back before the kick-start of the Asia Cup 2022, scheduled to take place in August-September after the Zimbabwe tour. “There is still some time before the selectors meet. But the plan is to have Virat use the Zimbabwe series to regain batting touch in a format he is very good at,” a BCCI source was quoted as saying by the news media outlet Hindustan Times . If Kohli does travel to Zimbabwe next month, he would play the next match in Indian colours on August 18 in Harare during the first ODI.","pubDate":"2022-07-29 15:32:53","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Sourav Ganguly to feature in Legends League Cricket charity match","link":"https://sportstar.thehindu.com/cricket/sourav-ganguly-to-feature-in-legends-league-cricket-charity-match/article65699736.ece","keywords":null,"creator":["\n        Shayan Acharya  \n    "],"video_url":null,"description":"Though the dates of the second edition of the tournament haven’t been announced, the former Indian captain has confirmed that he has started training for it.","content":"The Indian cricket fans will get an opportunity to watch Sourav Ganguly in action again! The former India captain and the current president of the BCCI will be featuring in a special charity match in the Season 2 of the Legends League Cricket. While the dates are yet to be announced, Ganguly confirmed that he has already started training for the charity match, which will celebrate the 75 years of India’s independence. “Enjoying the training to get ready to play for a one-off charity fundraising game for Azadi ka Mahotsav… 75 years of Indian independence and also for women empowerment with the top legends of the legends league cricket,” Ganguly wrote on Instagram. After retiring from international cricket in 2008, Ganguly continued to feature in the IPL till 2013. Despite getting busy with cricket administration, Ganguly had also featured in the Legends tournament in 2015 involving Sachin Tendulkar and the late Shane Warne. Even though Ganguly played in a couple of friendly fixtures between the Board officials recently, those were closed-door affairs. Now, with the one-off match set to be played in India, the fans will get an opportunity to watch the ‘god of off side’ in action after years! Raman Raheja, Co-Founder & CEO, Legends League Cricket said, “We thank legendary Sourav Ganguly for playing a match with other legends. Once a legend, always a legend, Dada is always there for Cricket. And he will play a special social cause match, which is going to be a spectacular view for our audience. We hope to see some iconic dada shots.” Read more stories on Cricket.","pubDate":"2022-07-29 15:16:58","image_url":null,"source_id":"sportstar","country":["india"],"category":["sports"],"language":"english"},{"title":"Why Russell is not playing for West Indies: Why Ishan Kishan is not playing today vs WI at Brian Lara Stadium?","link":"https://thesportsrush.com/cricket-news-why-russell-is-not-playing-for-west-indies-why-ishan-kishan-is-not-playing-today-vs-wi-at-brian-lara-stadium/","keywords":["Cricket","Andre Russell","India","India tour of West Indies 2022","ishan kishan","West Indies"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Why Andre Russell is not playing today: The West Indian all-rounder hasn’t played in international cricket since ICC T20 World Cup 2021. Put in to bat first by West Indies captain Nicholas Pooran, India got off to a brisk start on the back of a 44-run opening partnership in the first T20I at the Brian… The post Why Russell is not playing for West Indies: Why Ishan Kishan is not playing today vs WI at Brian Lara Stadium? appeared first on The SportsRush.","content":"Why Andre Russell is not playing today: The West Indian all-rounder hasn’t played in international cricket since ICC T20 World Cup 2021. Put in to bat first by West Indies captain Nicholas Pooran, India got off to a brisk start on the back of a 44-run opening partnership in the first T20I at the Brian Lara Stadium. Having said that, the same didn’t happen without the visitors fielding yet another novel opening pair. While experts and fans were hoping for one out of Rishabh Pant or Ishan Kishan to partner captain Rohit Sharma at the top of the order, India surprised one and all by sending batter Suryakumar Yadav (24) as Sharma’s opening partner. While Kishan is among the seven Indian cricketers warming the bench in Tarouba today, Yadav opened the batting for the first time (barring an IPL season) in his 214th T20 spanning across a 12-year career. Readers must note that a breakout Indian Premier League season in 2018 had witnessed Yadav opening the batting for the first time in his career for Mumbai Indians. Why Andre Russell is not playing vs India today? Both West Indies and India have made four changes to their respective Playing XIs. It was earlier this month when West Indies and India had faced Bangladesh and England in a T20I series respectively. Despite the changes, West Indies have had to take the field without all-rounder Andre Russell. Russell, 34, hasn’t played competitive cricket since IPL 2022. As far as international cricket is concerned, Russell had last represented West Indies during the ICC T20 World Cup in the UAE last year. Following the world event, Russell had made himself unavailable to tour Pakistan due to personal reasons. While the exact reason behind Russell’s absence from the ongoing series remains unknown, he has missed a lot of international cricket due to injury and availability issues in the recent years. The post Why Russell is not playing for West Indies: Why Ishan Kishan is not playing today vs WI at Brian Lara Stadium? appeared first on The SportsRush.","pubDate":"2022-07-29 15:15:41","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Sourav Ganguly to feature in second season of Legends League Cricket","link":"https://sportstar.thehindu.com/cricket/sourav-ganguly-to-play-season-two-legends-league-cricket/article65699736.ece","keywords":null,"creator":["\n        Shayan Acharya  \n    "],"video_url":null,"description":"Though the dates of the second edition of the tournament haven’t been announced, the former Indian captain has confirmed that he has started training for it.","content":null,"pubDate":"2022-07-29 15:06:41","image_url":null,"source_id":"sportstar","country":["india"],"category":["sports"],"language":"english"},{"title":"IND vs WI 1st T20I Live Score Updates: Akeal Hosein gets Suryakumar Yadav, India lose first wicket - The Indian Express","link":"https://news.google.com/__i/rss/rd/articles/CBMiX2h0dHBzOi8vaW5kaWFuZXhwcmVzcy5jb20vYXJ0aWNsZS9zcG9ydHMvY3JpY2tldC9pbmQtdnMtd2ktMXN0LXQyMGktbGl2ZS1zY29yZS11cGRhdGVzLTgwNTkxMjcv0gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"IND vs WI 1st T20I Live Score Updates: Akeal Hosein gets Suryakumar Yadav, India lose first wicket  The Indian ExpressMatch Preview - India vs West Indies, India in West Indies 2022, 1st T20I  ESPNcricinfoRohit Sharma rejects claims of 'conservative cricket' in T20 WCs | Cricbuzz.com - Cricbuzz  CricbuzzIndia vs West Indies 1st T20I LIVE CRICKET SCORE and UPDATES, ball by ball commentary: India are 25/0 after 3 overs  FirstpostWill Pant continue to open in Rahul's absence?  ESPNcricinfoView Full coverage on Google News","content":null,"pubDate":"2022-07-29 14:54:29","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Games-Australia beat India as women&#039;s cricket makes Commonwealth debut","link":"https://www.thestar.com.my/sport/others/2022/07/29/games-australia-beat-india-as-women039s-cricket-makes-commonwealth-debut","keywords":null,"creator":null,"video_url":null,"description":"BIRMINGHAM, England (Reuters) - World Champions Australia won the first women's cricket match in Commonwealth Games history with a three-wicket victory over India thanks to Ashleigh Gardner's unbeaten half-century and Jess Jonassen's four-wicket haul in their T20 clash on Friday. Read full story","content":null,"pubDate":"2022-07-29 14:49:00","image_url":"https://apicms.thestar.com.my/uploads/images/2022/07/29/1677882.jpg","source_id":"thestar_my","country":["malaysia"],"category":["sports"],"language":"english"},{"title":"Commonwealth Games 2022: Indian women's cricket team face 3-wicket defeat against Australia in opening encounter","link":"https://zeenews.india.com/cricket/commonwealth-games-2022-indian-womens-cricket-team-face-3-wicket-defeat-against-australia-in-opening-encounter-2490900.html","keywords":null,"creator":null,"video_url":null,"description":"With this loss, India's medal hopes in cricket have taken a dent and they head into their match with arch-rivals Pakistan on July 31.","content":"A gutsy half-century by Ashleigh Gardner and a solid cameo from Grace Harris, backed by an outstanding spell by Jess Jonassen, helped Australia stage a comeback to register a three-wicket win over India in their campaign opener T20I match at the ongoing Commonwealth Games 2022 in Birmingham on Friday. That's that from our first game at #CWG2022 Australia win by 3 wickets. #TeamIndia will look to bounce back in the next game. Scorecard - https://t.co/cuQZ7NHmpB #AUSvIND #B2022 pic.twitter.com/p1sn3xS6kj — BCCI Women (@BCCIWomen) July 29, 2022 With this loss, India's medal hopes in cricket have taken a dent and they head into their match with arch-rivals Pakistan on July 31. India could not defeat the world champions despite great knocks from skipper Harmanpreet Kaur (52) and Shafali Verma (48) as Jonassen (4/22) crushed India's middle order. Australia pulled off a win from jaws of defeat. India's Renuka Singh (4/18) inflicted a lot of initial damage on Aussie batting. But her efforts could not take India to a win as Gardner (52*) and Harris (37) helped Australia muster the winning score. Electing to bat first, India had a shaky start as they lost their star opener Smriti Mandhana for 24 off 17 balls. She was looking good and had smashed five boundaries before Darcie Brown sent her back with catch taken by Alyssa Healy. Shafali Verma carried the innings forward and built a 43-run stand with Yastika Bhatia, the wicketkeeper batter. Bhatia was dismissed for 8 after an unfortunate run-out. Bhatia was also dismissed by Jess Jonassen for 48, two runs short of her fifty. Harmanpreet Kaur then bravely took on the Australian bowling attack, which kept taking wickets on the other end. Jemimah Rodrigues (11), Deepti Sharma (1), Harleen Deol (7) left without making an impact. Spinner Jonassen was breathing fire and ran through India's middle order effortlessly. Kaur scored the first-ever half-century of CWG 2022 and first by a women's player at the event and fell as the seventh wicket for 52 off 34 after being bowled by Megan Schutt. India posted a modest 154/8 on the board in their 20 overs. Schutt took two wickets while Brown took one. Chasing 155, Australia was off a terrible start as medium pacer Renuka Singh feasted on its top four batters. Alyssa Healy (0), Beth Mooney (10), captain Meg Lanning (8), Tahlia McGrath (14) fell to bowling prowess of Renuka. Deepti Sharma dismissed Rachael Haynes for just nine. Half of the Aussie lineup was back in the hut with the score at 49. Then duo of Ashleigh Gardner and Grace Harris started turning things back in favour of Australia. Their 51-run stand helped the side cross 100 runs. Meghna Singh delivered the breakthrough for India by dismissing Harris for 37 runs off 20 balls. Deepti dismissed Jonassen for just three, sinking Aussies to 110/7. Renuka Singh finished the match with amazing figures of 4/18, though not enough to secure a win. Deepti took two wickets while Meghna took one. Gardner and Alana King kept their composure and took their side to a victory. Gardner finished with an unbeaten 52 and King with 18. Australia scored 157/7 in 19 overs. The comeback by Australia left Indian fans disappointed who were expecting their team to cruise through after half of the Australian side dismissed below 50 runs. Brief Scores India: 154/8 (Harmanpreet Kaur 52, Shafali Kaur 48, Jess Jonassen 4/22) lost to Australia: 157/7 in 19 overs (Ashleigh Gardner 52*, Grace Harris 37, Renuka Singh 4/18).","pubDate":"2022-07-29 14:45:00","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"Games-Australia beat India as women's cricket makes Commonwealth debut","link":"https://www.channelnewsasia.com/sport/games-australia-beat-india-womens-cricket-makes-commonwealth-debut-2845541","keywords":null,"creator":null,"video_url":null,"description":null,"content":"BIRMINGHAM, England : World Champions Australia won the first women's cricket match in Commonwealth Games history with a three-wicket victory over India thanks to Ashleigh Gardner's unbeaten half-century and Jess Jonassen's four-wicket haul in their T20 clash on Friday. Chasing 155 to win in the 20-over game, Australia were in trouble at one stage having lost half their side for 49, but Gardner got them over the line in style with an over remaining. She smashed nine fours in her 52 not out off 35 balls while Grace Harris chipped in with 37 off 20 balls before Alana King (18 not out) helped finish the job. India bowler Renuka Singh took 4-18 in her four overs but the effort was in vain. India had opted to bat first after winning the toss and made 154-8 in their 20 overs thanks to skipper Harmanpreet Kaur's 52 off 34 balls - a knock that included eight fours and a six - as well as opening batter Shafali Verma's 48. But Jonassen's 4-22 meant that the lower order could not take them to a bigger total. Early Group A leaders Australia face Barbados on Sunday while Pakistan meet arch-rivals India. Cricket is returning to the Commonwealth Games after a 24-year absence with the women's tournament. South Africa's men's team won the gold medal in the 50-over competition in Kuala Lumpur in 1998.","pubDate":"2022-07-29 14:42:08","image_url":null,"source_id":"channelnewsasia","country":["singapore"],"category":["sports"],"language":"english"}]}