{"newsArray":[{"title":"Cricket: West Indian batsman's freak act goes viral","link":"https://www.nzherald.co.nz/sport/news/article.cfm?c_id=4&objectid=12556857&ref=rss","keywords":null,"creator":null,"video_url":null,"description":"Kyle Mayers, that was absolutely absurd.The West Indies opening batter sent the cricket world into a frenzy on Wednesday evening with a physics-defying stroke during the first T20 against Australia on the Gold Coast.The visitors...","content":null,"pubDate":"2022-10-05 20:56:21","image_url":null,"source_id":"nzherald","country":["new zealand"],"category":["sports"],"language":"english"},{"title":"The ultimate guide to SACA Premier Cricket season 2022/23","link":"https://www.themercury.com.au/sport/cricket/sa-premier-cricket-gears-up-for-most-competitive-season-in-202223-read-the-full-preview/news-story/cf69f2263a00f504d19c33c7161e3c46","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"The SACA Premier Cricket season is finally here and promises to be one of the most competitive in recent memory.","content":"With a new two-divisional format being introduced from 2023-24, wins and losses will be as meaningful as they ever have been as clubs aim to make the top div. There have been a host of player movements in and out of clubs around the competition, resulting in strong lineups across the board as two-day games get underway this Saturday. Following on from our list of the top 25 cricketers to watch, here is The Messenger’s analysis of how each club sits heading into the season. ADELAIDE Captain: Josh Pengelley Coach: Steven Crook Last season: 12th Major ins: Lakshmn Shivakumar (Fitzroy Doncaster, Vic), Ben Manenti (NSW), Thomas Draca (NSW)Major outs: Nil New Adelaide coach Steve Crook said his team was ready to bounce back after an underwhelming 2021-22 campaign. The Buffalos have added opening batter Lakshmn Shivakumar from Victoria as well as spin and pace bowlers Ben Manenti and Tom Draca from NSW. “We’re in good shape, we’ve recruited very well and we’ve got a very promising bunch of young guys,” Crook said. “It’s been a really good preseason despite not being able to play much turf – the group has put in a real good shift.” Despite bigger stakes this season, Crook believed his players were not feeling any pressure. He said the season would be about developing a strong brand of cricket. “Every game is important anyway and I don’t think the added pressure this year is really with us it’s with the teams who think they’re a big shot at the top division. “For us right now we just want to play a brand of cricket that we’re proud of and continue to develop what is a reasonably young group.” The Buffalos will play Southern District this weekend. ADELAIDE UNIVERSITY Captain: Will Bosisto Coach: Ben Hilliard Last season: 6th Major ins: Bailey Whightman (UK), Sam Elder (Darwin), Joel Logan (Darwin), Esan Rahman (Canberra), Ben Cooper (Netherlands)Major outs: Nick Winter (SA Redbacks), Kyle Brazell (Tea Tree Gully), Wes Agar (Northern District), Cooper Luke (East Torrens)Star Adelaide Uni captain Will Bosisto said the Blacks were anxious to get underway this season after a strong preseason and recruitment period. The club was proactive with signings after losing Nick Winter, youngster Kyle Brazell, Wes Agar and Cooper Luke, bringing in two overseas recruits and three from interstate. “Preseason has been pretty wet and cold but we’re certainly excited having fit in two practice games including against the Netherlands,” Bosisto said. “It’s as good a preparation as any club would have had and we’re raring to go.” It was a disappointing campaign for Uni last season, who finished outside of the finals and without any silverware over Twenty20, one-day and two-day formats. While the club still boasts a strong batting order – headed by Bosisto – and bowling attack, its captain said some adjustments to play style were still needed in order to attack the season and grab a win against two-day grand finalist Tea Tree Gully. “We’re absolutely capable of making finals. “We identified fielding as an area for improvement and we’ve done a lot of work around that. “We’re confident we can bounce back after what was a disappointing season by our standards and a win against Tea Tree Gully would be the perfect start for that.” EAST TORRENS Captain: Ryan King Coach: Andrew DuffieldLast season: 10th Major ins: Cooper Luke (Adelaide Uni), Ali Orr (UK)Major outs: NilThe return of Cooper Luke to East Torrens as well as the arrival of English batter Ali Orr has East Torrens ready to surprise according to coach Andrew Duffield. New Reds captain Ryan King should again star with the bat this year, while the continued development of fast bowler Campbell Thompson will benefit the side’s attack. “We lacked a bit of consistency last season but I think we’ve now got a squad which can do some proper damage if we remain focused and execute what we have to,” Duffield said. “We proved we have what it takes to be competitive in white ball cricket so now it’s about improving week by week in all formats and having a real crack at every game we play.” Duffield’s Reds will face Glenelg in the first of the two-day rounds this weekend. He remained confident his side could cause an upset. “We always seem to matchup really well with the Seahorses. “It’ll be cold and there’ll be a bit of unknown heading into the first game so I think we might be able to surprise a few.” GLENELG Captain: Jake WinterCoach: Sam McNallyLast season: 5thMajor ins: Harry Conway (NSW) (SA Redbacks contracted)Major outs: NilGlenelg coach Sam McNally said the Seahorses had put in the hard yards over the preseason after falling just short of silverware last campaign. The club was in the box seat of last season’s one-day cup final before falling away late against West Torrens, and just missed two-day finals after a thrilling final week of regular season play. “When you look at it we only lost four games of cricket last season so we’re really not far off winning some titles at all,” McNally said. “Our batting was pretty strong with guys like Winter and Higgins stepping up but we probably struggled to bowl teams out a bit in the back end of the year and made some questionable decisions in tight moments. “We’ve got Harry Conway in, who we won’t have much because of his shield commitments but he’s going to have a very positive influence on the group so we’re looking good at the moment.” McNally also said that while Glenelg’s aim was to win a two-day premiership, the season could be one of the most competitive in Premier Cricket history. “Our goal is to win a premiership but I think everyone is looking over their shoulder a bit with the new structure coming in from 2023. “We’re going to see a lot of competitive cricket this year, it’s probably going to be the most competitive season I can remember for the last 10 years – every team will have improved so we’ll need to be at our best each week.” KENSINGTON Captain: Josh DoyleCoach: Russell ThompsonLast season: 3rd Major ins: Tom Lawes (Surrey, UK), Henry Thornton (NSW)Major outs: Daniel Worrall (Surrey, UK), John Dalton Kensington was agonisingly close to more silverware in season 2021-22 but fell short against Tea Tree Gully in the two-day semi-finals after finishing third on the ladder. Rising superstar Josh Doyle will take the captaincy from Elliot Opie this year and he looks set for yet another big season after dominating with the bat and chipping in consistently with the ball in his previous campaign. Key player Daniel Worrall leaves to pursue a career back home in England, while John Dalton has departed the Browns to pursue work/life opportunities.The club has worked to replace both players however, adding exciting all rounder Tom Lawes from the UK and Redbacks recruit Henry Thornton out of NSW. The side will face a reinvigorated Port Adelaide this weekend in a clash which should be one of the best of the opening round. NORTHERN DISTRICT Captain: Gareth CoxCoach: Cam WilliamsLast season: 9thMajor ins: Josh Kann (Hobart Hurricanes), Aidan Cahill (Newcastle City, NSW), Wes Agar (Adelaide Uni, SA Redbacks contracted), Mitch ThomasMajor outs: NilAnything is possible for the Jets this season after a host of signings to add to a developing squad. Josh Kann has arrived at Northern District after completing his debut Big Bash season with Hobart, the tall all-rounder adding to the side’s order and bowling attack, while young gun Aidan Cahill will also provide blistering pace after an impressive showing at the U19 World Cup. “We’re really, really excited and we can’t wait to get out there and start playing games after what’s been a very promising preseason,” coach Cam Williams said. “We’ve made some great additions to the side and Kann is a serious player so we’re keen to see what we can do.” The Jets will take on Sturt first up this year, the Blues coming off a strong campaign and ready to go with both Tom and Corey Kelly back on deck. “The Kelly boys have really turned it on against us over recent years but we’re a slightly different team this year so the challenge really excites us,” Williams said. “I think we can take it to Sturt and it will be good to see how we go against them and gauge where we’re at.” PORT ADELAIDE Captain: Austin Umpherston Coach: Matthew WeeksLast season: 8th, Twenty20 championsMajor ins: Parwiz Malikzai (Afghanistan), Jack Wood (Brisbane Heat, QLD), Seamus Keogh (Vic), Matt Calder (NSW), Harry Massey (Vic), Cam Valente (Tasmania) Major outs: Joe Medew-Ewen (Vic) Port Adelaide is ready to contend in all three formats this season after a busy offseason of recruiting according to captain Austin Umpherston. The club finished eighth on the first grade ladder last year but enjoyed a successful Twenty20 campaign with star paceman Nick Benton also in good form. While spinner Joe Medew-Ewen leaves for Victoria, the inclusion of multiple gun batters and bowlers could now have the side ready to make some serious noise over the next few months. “It’s the most confident I’ve been in a while and with the pieces we’ve added and the way things have been going I think we should have a really good year,” Umpherston said. “Cam Valente is one of the best going around and to add him on top of the other guys we’ve brought in I think is very big and it gives us consistency through our batting order. “Our bowling attack was already strong so to work the batting side of things out has been important.” The side will meet Kensington this weekend, a good test at the start of the year. “They’re generally the team to beat each year and they’ll have a strong team so it’s going to be a big one,” Umpherston said. “If we can get a win it’d be massive.” PROSPECT Captain: Kyle ScrimegourCoach: Steven Broberg Last season: 11th Major ins: NilMajor outs: Peter Hatzoglou, Max HatzoglouProspect coach Steve Broberg said the club would be sticking with a five-year plan of development and improvement this season despite a two-divisional set up being implemented after the 2022-23 campaign. He said the development of SA talent and all-round skilful players was more important than wins and losses at this stage in the club’s progression. “We know full well what we’re doing as a club and nothing has changed – we want to invest in SA cricketers and in young juniors coming through the programs,” Broberg said. Star captain and batter Kyle Scrimegour and developing star Paul Wasiewicz should be among the Pirates’ best this year again as they aim to progress up the ladder. A test against reigning premier West Torrens will be presented to the side this weekend, an opportunity which excited Broberg. “We’re thrilled we get the chance to play the best straight away. “If we’re serious about becoming a good strong, vibrant cricket club then we need to be able to benchmark ourselves against teams like West Torrens.” SOUTHERN DISTRICT Captain: Josh Barrett Coach: Andrew ZesersLast season: 13thMajor ins: NilMajor outs: Brendan McCormack Continuity will be key for the Stingrays this season according to coach Andrew Zesers, confirming an almost completely unchanged lineup for the 2022-23 campaign after Brendan McCormack’s departure to pursue marathon running. While the club finished bottom of the first grade standings last season, the continued top drawer form of captain wicket keeper Josh Barrett and the development of youth could have the club in a position to upset bigger sides. “I definitely think we’re going to rattle some cages of the best teams this year,” Zesers said. “We’re going to get some good continuity with a lot of these guys, they’ve all spent a lot of time with the club and have developed well – we’ve got a lot of experience and some good youth coming through too.” Zesers also said Barrett would open the batting for the full season as the Stingrays gear up for two beatable opponents in Adelaide and Prospect over the first two rounds. “Josh will open the batting all year, that’s the first change I made when I arrived in the offseason – it’s where I believe he is most damaging in the order.“I think we have a really good opportunity this weekend against Adelaide to gain some momentum for the season. “We’ve done a lot of work so now it’s time to see if we can execute.” STURT Captain: Brad Davis Coach: Peter MuggletonLast season: 1st, semi-final lossMajor ins: Brad Fallins (Port Adelaide), Mackenzie Best (Port Adelaide)Major outs: Max Parker (retired), Daniel Clarke (retired), Jacob Dick (Alice Springs), Seb Young (West Torrens)An improvement in fielding through the preseason has Sturt ready to go one step further in 2022-23 after losing in the two-day semis last season according to captain Brad Davis. The side finished top of the ladder last year but could not capitalise as both West Torrens and Tea Tree Gully made the big dance. “We missed a couple opportunities in the field in those semi-finals early on and we’ve been working on our catching and fielding as a result,” Davis said. “Our bowling and batting is right up there with the best, with the Kelly brothers and Matty Spoors continuing to perform so I think if we can fix up a few little areas in the field we’ll be ready to go.”The Blues lose some experience in Max Parker and Daniel Clarke to retirement while Jacob Dick and Seb Young both depart the club for other opportunities. Despite the departures, Davis believed the signings of Fallins and Best as well as the star power of Spoors and the Kelly brothers held the club in good stead as it prepares for Northern District this weekend. “We’ve got a really balanced attack and one of the best batting orders there is so we’re not too concerned,” Davis said. “Northern Districts will be competitive again this year and they’ll be a bit stronger so we’re looking forward to the clash and hopefully we can start the season off right.”TEA TREE GULLY Captain: Joe Gatting Coach: Joe Gatting Last season: 2nd, grand final runner-upMajor ins: Kyle Brazell (Adelaide Uni)Major outs: NilTea Tree Gully remains relatively unchanged after a strong showing in season 2021-22. The Bulls charged home to end the campaign, a late push behind star bowler Tim Oakley and club coach-captain Joe Gatting with the bat seeing them into the grand final against West Torrens. The inclusion of rising Adelaide Uni star Kyle Brazell should prove to be a significant one for the side, the all-rounder doing damage with the bat and with the ball last year as he finished second to Will Bosisto for club champion. The Bulls will face Brazell’s old team this weekend in a match which should prove to be as entertaining as any this season. Both sides will be aiming for big things this year and a win would go a long way in proving the Bulls are still a threat. WEST TORRENS Captain: Daniel Drew Coach: Mark Harrity Last season: Fourth, one-day and two-day premierMajor ins: Seb Young (Sturt), Dan Mousley (UK), Jack Haynes (Worcestershire, UK), Tom Sibley (returning)Major outs: Ryan Gibson (Sydney), Warren Peters (retired), Pat Fischer (retired)West Torrens coach Mark Harrity remained confident his Eagles could defend their one-day and two-day titles despite the departure of multiple gun players. Star batter Ryan Gibson has moved to Sydney while Peters and Fischer retire, but the arrival of Seb Young from Sturt as well as Dan Mousley and Jack Haynes from the UK and Tom Sibley from a shoulder injury keeps the club’s attack and batting order in good shape. Superstar batters Daniel Drew and Kelvin Smith remain at the club and have not received any guarantees from the Redbacks despite state-best form at first grade level last year and crafty spinner Daniel Fallins remains one of the most dangerous bowlers in the competition. Bailey Capel also looks set to impress at the crease again this year and paceman Jordan Buckingham will be in and out of the side with state commitments. “There’s going to be a lot of chopping and changing with some moving pieces to start the season but we believe we have the best depth in the comp,” Harrity said. “It’s going to be a super competitive year with every club strengthening so we’ve got no clue how things will pan out but we back our guys in after the success we had last year. “Our players are as hungry as ever so I’m really excited to see if we can back last season up and go again this time around.”WOODVILLE Captain: Chadd SayersCoach: Jamie Rothall, Luke WellsLast season: 7thMajor ins: Ben Charlesworth (Gloucestershire, UK)Major outs: NilWoodville will be boosted by the full-time commitment of new captain Chadd Sayers in season 2022-23 according to co-coach Jamie Rothall. The former Australia and Redbacks gun – who can have an impact with both the ball and bat – arrived from Glenelg last season but missed multiple portions of the campaign. “He’ll play every game this year so he’ll basically be like a new recruit,” Rothall said. “With Sayers available and some guys, including younger players, continuing to develop I really think we can push for top four.” Rothall’s side experienced a solid season in 2021-22 but remained inconsistent in the attack. He said a long preseason followed by a rest this week with the upcoming bye would give his side a strong chance at achieving a division one spot next season. “We’ve focused a lot on our bowling areas as well as our fielding and fitness after last year,” Rothall said. “It’s been a long preseason for us but we’re getting the required rest and I feel we’re definitely ready to go. “Hopefully we’ve set ourselves up for a long and fruitful year.”","pubDate":"2022-10-05 19:30:00","image_url":null,"source_id":"mercury","country":["australia"],"category":["sports"],"language":"english"},{"title":"Cricket: White Ferns win Super Over thriller to claim series","link":"https://www.nzherald.co.nz/sport/news/article.cfm?c_id=4&objectid=12556798&ref=rss","keywords":null,"creator":null,"video_url":null,"description":"The White Ferns claimed a Twenty20 series win in the West Indies in thrilling style following a Super Over victory in the fourth match in Antigua.Captain Sophie Devine hit a six over deep mid-wicket on the final ball taking them...","content":null,"pubDate":"2022-10-05 18:50:37","image_url":null,"source_id":"nzherald","country":["new zealand"],"category":["sports"],"language":"english"},{"title":"Man of the Series Legends League Cricket final: Who won LLC 2022 Man of the series?","link":"https://thesportsrush.com/cricket-news-man-of-the-series-legends-league-cricket-final-who-won-llc-2022-man-of-the-series/","keywords":["Cricket","Legends League Cricket 2022","LLC 2022"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Man of the Series Legends League Cricket final: The grand finale of Legends Cricket League 2022 turned out to be a one-sided affair. Gautam Gambhir-led India Capitals have lifted the Legends League Cricket 2022 title, by defeating the Bhilwara Kings by a huge margin of 104 runs, in what turned out to be a one-sided… The post Man of the Series Legends League Cricket final: Who won LLC 2022 Man of the series? appeared first on The SportsRush.","content":"India Capitals have lifted the Legends League Cricket 2022 title, after defeating the Bhilwara Kings by a huge margin of 104 runs, in what turned out to be a one-sided contest at the Sawai Mansingh Stadium, in Jaipur. En route the massive target of 212 runs, the Bhilwara Kings simply succumbed to the scoreboard pressure, amidst some excellent bowling spells by the Capitals’ bowlers, as they only managed to huff-and-puff to the score of 107 in 18.2 Overs. Pawan Suyal (4-1-27-2), Pravin Tambe (4-0-19-2), and Pankaj Singh (3-0-14-2) were the pick of the bowlers for Gambhir, with none of his other bowlers too having had a bad outing while defending the total tonight. However, more than half the damage was done earlier off the bat of former Kiwi skipper Ross Taylor (82 off 41) and former Aussie pacer Mitchell Johnson (62 off 35), as the duo helped the India Capitals post a humongous total of 211/7 on the board, despite getting off to a poor start, with the scorecard reading 21/4 at one stage. A huge win for to clinch the trophy! — Legends League Cricket (@llct20) Bhilwara Kings allrounder and former India international was adjudged the ‘Legend of the tournament’ for his all-round show with both bat and ball throughout this season. While he ended the season as the fifth-highest run-getter with 228 runs off 8 innings at an average of 32.57, he also scalped 7 wickets as well in as many innings, at a strike rate of 10.5. Having said that, it was an ordinary day for Pathan in both these departments in the night of the final, as he leaked 34 runs in his two-Over spell, while returned scoring 6 (9), with his team chasing a stiff target.","pubDate":"2022-10-05 18:36:31","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Legends league cricket: इंडिया कैपिटल्स चैंपियन, भीलवाड़ा किंग्स को 104 रन से रौंदकर जीता खिताब","link":"https://navbharattimes.indiatimes.com/sports/cricket/cricket-news/legends-league-cricket-2022-india-capitals-champions-after-taylor-johnson-fireworks/articleshow/94667464.cms","keywords":null,"creator":null,"video_url":null,"description":"Legends league cricket: लीजेंड्स लीग क्रिकेट की चैंपियन अब इंडिया कैपिटल्स है। फाइनल में भीलवाड़ा किंग्स को मात मिली।","content":null,"pubDate":"2022-10-05 18:33:02","image_url":null,"source_id":"navbharattimes","country":["india"],"category":["sports"],"language":"hindi"},{"title":"Legends League Cricket: Ross Taylor, Mitchell Johnson star as India Capitals beat Bhilwara Kings in final","link":"https://www.indiatoday.in/sports/cricket/story/legends-league-cricket-ross-taylor-mitchell-johnson-star-as-india-capitals-beat-bhilwara-kings-in-final-2008743-2022-10-05?utm_source=rss","keywords":null,"creator":null,"video_url":null,"description":"Legends League Cricket: India Capitals beat Bhilwara Kings in final","content":null,"pubDate":"2022-10-05 18:17:59","image_url":null,"source_id":"indiatoday","country":["india"],"category":["sports"],"language":"english"},{"title":"Legends League Cricket 2022 Final: Gautam Gambhir's India Capitals thrash Irfan Pathan's Bhilwara Kings to become CHAMPIONS","link":"https://zeenews.india.com/cricket/legends-league-cricket-2022-final-gautam-gambhirs-india-capitals-thrash-irfan-pathans-bhilwara-kings-to-become-champions-2518339.html","keywords":null,"creator":null,"video_url":null,"description":"The Kings' openers, Morne van Wyk (5) and William Porterfield (12), were out inside the first four overs. A lot depended on the broad shoulders of Yusuf Pathan (6), but he did not last long. Shane Watson (27) was unfortunate to be run out, while Jesal Karia (22) showed promise but could not carry on for long.","content":"India Capitals were crowned the champions of the Legends League Cricket (LLC), which was being held in India for the first time. In an entertaining final, played at the Sawai Man Singh Stadium here on Wednesday, the Capitals beat Bhilwara Kings by 104 runs to lift the trophy. The Capitals, captained by Gautam Gambhir , made an excellent recovery after stumbling early to post 211/7 in 20 overs. The Kings crumbled under pressure of the tall target and were all out for just 107 in 18.2 overs. While Ross Taylor (82 off 41 balls) and Mitchell Johnson (62 off 35 balls) were the architects of the Capitals' innings, sharing a 126-run stand for the fifth wicket, the Kings did not manage to get any meaningful partnership from their batters. The Kings' openers, Morne van Wyk (5) and William Porterfield (12), were out inside the first four overs. A lot depended on the broad shoulders of Yusuf Pathan (6), but he did not last long. Shane Watson (27) was unfortunate to be run out, while Jesal Karia (22) showed promise but could not carry on for long. When Irfan Pathan (2), the Kings' captain, was out in the 12th over, the chase was as good as over for them. A huge win for @CapitalsIndia to clinch the #LLCT20 trophy! #BossLogonKaGame #LegendsLeagueCricket pic.twitter.com/hQHtmtcC3k — Legends League Cricket (@llct20) October 5, 2022 For the Capitals, three bowlers — Pawan Suyal (2/27), Pankaj Singh (2/14) and Pravin Tambe (2/19) — took two wickets each. It was a complete team effort which brought victory to the Capitals. Good batting was complemented by tight bowling and sharp fielding. The Kings, however, had actually got a dream start to the final after winning the toss and electing to field. Irfan's ploy to start with spin from both ends paid dividends as the Capitals found themselves four wickets down by the fifth over. Monty Panesar and Rahul Sharma cast their spin web to reduce the Capitals to 21/4. But then began the counterattack. Taylor and Johnson caught the Kings' bowlers by the scruff of their necks and thrashed them to all parts of the ground. The ninth over of the match was the turning point of the Capitals' innings. Former New Zealand captain Taylor crushed Yusuf's spin to take 30 runs from the over. He hit four sixes and a four in that over. Former England pacer Tim Bresnan finally broke the partnership, dismissing Johnson in the 15th over. But by then, Johnson had hit seven fours and three sixes. Taylor was out in the 17th over, after hitting eight monstrous sixes and four boundaries as well. Ashley Nurse (42 off 19 balls) then played a nice cameo in the death overs to take the Capitals past the 200-mark. That proved enough for them to emerge winners handsomely.","pubDate":"2022-10-05 18:14:00","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"Legends League Cricket 2022 Final Highlights: Ross Taylor, Mitchell Johnson Star As India Capitals T.. - NDTV Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMifWh0dHBzOi8vc3BvcnRzLm5kdHYuY29tL2NyaWNrZXQvaW5kaWEtY2FwaXRhbHMtdnMtYmhpbHdhcmEta2luZ3MtbGVnZW5kcy1sZWFndWUtY3JpY2tldC0yMDIyLWZpbmFsLWxpdmUtc2NvcmUtdXBkYXRlcy0zNDA1NTU30gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Legends League Cricket 2022 Final Highlights: Ross Taylor, Mitchell Johnson Star As India Capitals T..  NDTV SportsIndia Capitals vs Bhilwara Kings Final Highlights: INDCAP skittle out BK for 107 runs, win Legends League Cricket final  The Indian ExpressLegends League Cricket Final Live Score 2022: India Capitals vs Bhilwara Kings Live Score- Legends League Cricket 2022 Live Score, Live Streaming, Live Telecast Channel  Cricket AddictorLLC 2022, Final Review: India Capitals obliterate Bhilwara Kings to clinch summit clash  CricTrackerLegends League Cricket: Winner To Get Rs 2 Crore As Prize Money  NDTV SportsView Full coverage on Google News","content":null,"pubDate":"2022-10-05 18:06:00","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"New season to mark fresh era for EGCA","link":"https://thewest.com.au/news/kalgoorlie-miner/new-season-to-mark-fresh-era-for-egca-c-8454370","keywords":null,"creator":["Neale Harvey"],"video_url":null,"description":"Local cricket will operate under one banner for the first time.","content":null,"pubDate":"2022-10-05 18:00:00","image_url":"https://images.thewest.com.au/publication/C-8454370/855bddfbc1a16d6f81b1b4eafb80b8c96f6206c7-16x9-x0y209w4000h2250.jpg","source_id":"thewest","country":["australia"],"category":["sports"],"language":"english"},{"title":"Lucknow Cricket Stadium weather report: Weather Lucknow Uttar Pradesh Ekana Cricket Stadium for 1st IND vs SA ODI","link":"https://thesportsrush.com/cricket-news-lucknow-cricket-stadium-weather-report-weather-lucknow-uttar-pradesh-ekana-cricket-stadium-for-1st-ind-vs-sa-odi/","keywords":["Cricket","Ekana Cricket Stadium","Lucknow","South Africa tour of India 2022"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Lucknow Cricket Stadium weather report: The stadium is set to host its first One-Day International after two-and-a-half years. A second-string Indian team is all set to take on the mighty South Africans in the first of three match ODI series commencing Thursday, at the Atal Bihari Vajpayee Ekana Cricket Stadium, in Lucknow. Led by Shikhar… The post Lucknow Cricket Stadium weather report: Weather Lucknow Uttar Pradesh Ekana Cricket Stadium for 1st IND vs SA ODI appeared first on The SportsRush.","content":"Lucknow Cricket Stadium weather report: The stadium is set to host its first One-Day International after two-and-a-half years. A second-string Indian team is all set to take on the mighty South Africans in the first of three match ODI series commencing Thursday, at the Atal Bihari Vajpayee Ekana Cricket Stadium, in Lucknow. Led by Shikhar Dhawan, the squad comprises of a total of six uncapped players, including a couple of maiden India call-ups, as none of the players who are part of the 15-member World Cup squad, have been included for the ODI-leg of the limited Over matches. ALSO READ: Lucknow pitch report for 1st ODI between India and South Africa As for South Africa, who have had a couple of excellent games with the but during the recently concluded T20I series versus India, the Temba Bavuma-led side have made only a couple of changes to their T20I squad, for the ODI series as well. The likes of Tristan Stubbs and Rilee Rossouw have made way for Andile Phehlukwayo and Janneman Malan. Hello Lucknow #INDvSA #BePartOfIt pic.twitter.com/U2v2pkCNXP — Proteas Men (@ProteasMenCSA) October 5, 2022 Lucknow Cricket Stadium weather report Rains have made their appearance especially in the Eastern part of India consistently since the past couple of months. Even on Thursday, during the first ODI between India and South Africa, the rain Gods may play spoilsport, thus leading to some interruption in the match proceedings. As per Accuweather, while there are chances of rain initially between 10 am-11 am, there is a 57% forecast of rain during the Toss time at around 1:00 pm as well. There is a similar percentage of rain probability again at around 3:00 pm, which might well hamper the proceedings for some time. However, post this period, the conditions are only likely to remain overcast throughout the end of the match. All in all, while chances of continuous rain during match time remain low, it depends on the rain intensity which would dictate whether we lose out on any Overs or not. The post Lucknow Cricket Stadium weather report: Weather Lucknow Uttar Pradesh Ekana Cricket Stadium for 1st IND vs SA ODI appeared first on The SportsRush.","pubDate":"2022-10-05 17:30:28","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"India Capitals vs Bhilwara Kings Final Live Score Updates: Irfan Pathan, Shane Watson depart as BK go 6 down in Legends League Cricket final - The Indian Express","link":"https://news.google.com/__i/rss/rd/articles/CBMid2h0dHBzOi8vaW5kaWFuZXhwcmVzcy5jb20vYXJ0aWNsZS9zcG9ydHMvY3JpY2tldC9pbmRpYS1jYXBpdGFscy12cy1iaGlsd2FyYS1raW5ncy1sbGMtZmluYWwtbGl2ZS1zY29yZS11cGRhdGVzLTgxOTE1MTYv0gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"India Capitals vs Bhilwara Kings Final Live Score Updates: Irfan Pathan, Shane Watson depart as BK go 6 down in Legends League Cricket final  The Indian ExpressLegends League Cricket Final Live Score 2022: India Capitals vs Bhilwara Kings Live Score- Legends League Cricket 2022 Live Score, Live Streaming, Live Telecast Channel  Cricket AddictorIndia Capitals vs Bhilwara Kings Legends League Cricket 2022 Final Live Cricket score ic vs bhk latest updtaes and scorecard sawai man singh jaipur live news  News18Legends League Cricket 2022 Final Live Score: Shane Watson Departs As Bhilwara Kings Lose Fifth Wick..  NDTV SportsLegends League Cricket Final 2022 Prediction: India Capitals vs Bhilwara Kings- Match Prediction: Who Will Win The Match Between IC And BHK?  Cricket AddictorView Full coverage on Google News","content":null,"pubDate":"2022-10-05 17:23:46","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"IND vs PAK Records: All you need to know about India vs Pakistan clash and key stats","link":"https://www.indiatvnews.com/sports/cricket/ind-vs-pak-records-all-you-need-to-know-about-india-vs-pakistan-clash-and-key-stats-ind-vs-pak-ind-vs-pak-t20-world-cup-t20-world-cup-2022-2022-10-05-813983","keywords":null,"creator":null,"video_url":null,"description":"The India vs Pakistan clash is all set to take center stage as the epicenter of the cricketing world will be the Melbourne Cricket Ground (MCG) on Sunday, October 23. The two giants of the game will get ready for the latest installment of the rivalry and the World Cup stage will once again get glittered on Diwali eve. So, with a close eye on the rivalry and an intensifying battle over the years here is a look at all the records between India and Pakistan.","content":"The India vs Pakistan clash is all set to take center stage as the epicenter of the cricketing world will be the Melbourne Cricket Ground (MCG) on Sunday, October 23. The two giants of the game will get ready for the latest installment of the rivalry and the World Cup stage will once again get glittered on Diwali eve. So, with a close eye on the rivalry and an intensifying battle over the years here is a look at all the records between India and Pakistan. In the all-time records for most wins, it is Pakistan who stand superior as they have won 88 of the 202 matches between the sides. India however have won most T20I matches with 7 in 11. Despite Pakistan’s win in last T20 World Cup, India still have upper hand with 11 wins in 13 matches while the tie in 2007 World Cup also went India’s way.","pubDate":"2022-10-05 17:20:55","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"LLC Final: 6, 6, 6, 2, 4, 6... एक ओवर में 30 रन, फाइनल में टेलर ने की पठान की जमकर पिटाई","link":"https://navbharattimes.indiatimes.com/sports/cricket/cricket-news/ross-taylor-smashed-yusuf-pathan-for-30-runs-in-an-over-in-the-final-of-legends-league-cricket-2022/articleshow/94666606.cms","keywords":null,"creator":null,"video_url":null,"description":"Legends league cricket 2022: लीजेंड्स लीग क्रिकेट के फाइनल में पहली बैटिंग करते हुए इंडिया कैपिटल्स ने 211 रन बनाए। भीलवाड़ा किंग्स के सामने एक बड़ा लक्ष्य है।","content":null,"pubDate":"2022-10-05 17:16:23","image_url":null,"source_id":"navbharattimes","country":["india"],"category":["sports"],"language":"hindi"},{"title":"Lucknow Cricket Stadium records: Lucknow records ODI and highest innings total at Ekana Cricket Stadium","link":"https://thesportsrush.com/cricket-news-lucknow-cricket-stadium-records-lucknow-records-odi-and-highest-innings-total-at-ekana-cricket-stadium/","keywords":["Cricket","India","South Africa","South Africa tour of India 2022"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Lucknow Cricket Stadium records: One of the newly-built cricket stadiums in India will be hosting an international match on Thursday. The rivalry between India and South Africa in the year 2022 will receive one more chapter in the form of a three-match ODI series beginning in Lucknow from tomorrow. With both the teams scheduled to… The post Lucknow Cricket Stadium records: Lucknow records ODI and highest innings total at Ekana Cricket Stadium appeared first on The SportsRush.","content":"The rivalry between India and South Africa in the year 2022 will receive one more chapter in the form of a three-match ODI series beginning in Lucknow from tomorrow. With both the teams scheduled to play an ODI against each other in India for the first time since South Africa’s tour of India 2015, the first ODI will be the first-ever ODI for these teams at the Bharat Ratna Shri Atal Bihari Vajpayee Ekana Cricket Stadium. The 10th international match at this venue will be the visitors’ first-ever match here. India, on the contrary, have won both their Lucknow T20Is till date. 💬💬 ‘We have a good squad and it is great to see fresh energy and enthusiasm among the new players in the side’ – captain ahead of the ODI series 👍 — BCCI (@BCCI) All the three ODIs played at this venue had been played between Afghanistan and West Indies almost three years ago. Highest run-scorers in Lucknow ODIs are Shai Hope (229), Roston Chase (145), Asghar Afghan (124), Rahmat Shah (104) and Nicholas Pooran (96). Highest ODI wicket-takers at the Bharat Ratna Shri Atal Bihari Vajpayee Ekana Cricket Stadium are Roston Chase (6), Mujeeb Ur Rahman (5), Sheldon Cottrell (4), Naveen-ul-Haq (4) and Hayden Walsh (4). Although in a different format, India’s Ishan Kishan (89), Shreyas Iyer (57) and Shikhar Dhawan (43) had all played in their only T20I innings at this ground. Similarly, among bowlers taking part in this series, spinner Kuldeep Yadav had picked a couple of T20I wickets in his solitary outing here. A 250+ innings total has been registered only once in six completed ODI innings at this venue. Chasing a 250-run target, West Indies had scored 253/5 in 48.4 overs to bring up both the highest innings total and highest successful run-chase in Lucknow ODIs. West Indies, who had won all the three ODIs against Afghanistan back in the day, had won two while batting second and one while batting first.","pubDate":"2022-10-05 16:38:18","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"The next eight ODI games are important for Proteas’ World Cup qualification hopes","link":"https://www.iol.co.za/sport/cricket/proteas/the-next-eight-odi-games-are-important-for-proteas-world-cup-qualification-hopes-df1d89a0-5fca-414e-9fee-ea3b2cd91bb9","keywords":null,"creator":["Zaahier Adams"],"video_url":null,"description":"Proteas’ Janneman Malan acknowledged the next eight ODI games are important as the team hopes to qualify for next year’s Cricket World Cup in India.","content":null,"pubDate":"2022-10-05 16:01:12","image_url":"https://image-prod.iol.co.za/16x9/800?source=https://xlibris.public.prod.oc.inl.infomaker.io:8443/opencontent/objects/18a61e45-dcee-5e26-8027-78183f2ffdb4&operation=CROP&offset=0x111&resize=1213x682","source_id":"iol","country":["south africa"],"category":["sports"],"language":"english"},{"title":"IND vs SA, 1st ODI: Pitch report to records - Here's all about Ekana International Cricket Stadium, Lucknow","link":"https://www.indiatvnews.com/sports/cricket/ind-vs-sa-1st-odi-pitch-report-to-records-here-s-all-about-ekana-international-cricket-stadium-lucknow-2022-10-05-813973","keywords":null,"creator":null,"video_url":null,"description":"India and South Africa are all set to face each other in the 1st ODI at Bharat Ratna Shri Atal Bihari Vajpayee Ekana Cricket Stadium, Lucknow on Thursday.","content":null,"pubDate":"2022-10-05 15:58:37","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"India vs South Africa Head to Head in ODI: IND vs SA ODI records and head to head stats","link":"https://thesportsrush.com/cricket-news-india-vs-south-africa-head-to-head-in-odi-ind-vs-sa-odi-records-and-head-to-head-stats/","keywords":["Cricket","India","South Africa","South Africa tour of India 2022"],"creator":["Dixit Bhargav"],"video_url":null,"description":"India vs South Africa Head to Head in ODI: The SportsRush presents for you the Head to Head statistics for first IND vs SA ODI. In the form of first ODI, the second leg of South Africa’s second tour of India 2022 will begin only a day after the conclusion of a three-match T20I series… The post India vs South Africa Head to Head in ODI: IND vs SA ODI records and head to head stats appeared first on The SportsRush.","content":"India vs South Africa Head to Head in ODI: The SportsRush presents for you the Head to Head statistics for first IND vs SA ODI. In the form of first ODI, the second leg of South Africa’s second tour of India 2022 will begin only a day after the conclusion of a three-match T20I series between the two teams. Having already faced each other in three ODIs this year, India and South Africa will lock horns in another three-match ODI series with the first one to be played in Lucknow tomorrow. It is noteworthy that South Africa will be playing an ODI in India after as many as seven years. While the two teams were scheduled to play three ODIs in March 2022, sudden outbreak of COVID-19 pandemic had put a halt in front of the series after the first match was washed out due to rain in Dharamsala. ALSO READ: India vs South Africa 1st ODI pitch report in Lucknow The last India-South Africa ODI was played eight months ago in Cape Town when India had fallen short of a 288-run chase by a mere 5 runs. A close loss had found India getting whitewashed 3-0 under KL Rahul. India vs South Africa Head to Head in ODI Total number of matches played: 87 Matches won by IND: 35 Matches won by SA: 49 Matches played at Bharat Ratna Shri Atal Bihari Vajpayee Ekana Cricket Stadium: 0 (IND 0, SA 0) Matches played in India: 28 (IND 15, SA 13) Matches played in Asia: 37 (IND 17, SA 19) IND average score against SA: 245.5 SA average score against IND: 250.5 Most runs for IND: 967 (Shikhar Dhawan) Most runs for SA: 1,013 (Quinton de Kock) Most wickets for IND: 18 (Kuldeep Yadav) Most wickets for SA: 17 (Kagiso Rabada) Most catches for IND: 5 (Shikhar Dhawan) Most catches for SA: 21 (Quinton de Kock) Hello Lucknow #INDvSA #BePartOfIt pic.twitter.com/U2v2pkCNXP — Proteas Men (@ProteasMenCSA) October 5, 2022 NOTE: Only players part of current squads have been considered above (most runs, wickets and catches). The post India vs South Africa Head to Head in ODI: IND vs SA ODI records and head to head stats appeared first on The SportsRush.","pubDate":"2022-10-05 15:38:08","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Finch, Wade show nerve in tense chase against Windies | Australia v West Indies 2022 - cricket.com.au","link":"https://news.google.com/__i/rss/rd/articles/CBMiK2h0dHBzOi8vd3d3LnlvdXR1YmUuY29tL3dhdGNoP3Y9ZGVDM3dRb0tJc3fSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Finch, Wade show nerve in tense chase against Windies | Australia v West Indies 2022  cricket.com.auView Full coverage on Google News","content":null,"pubDate":"2022-10-05 15:30:14","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"BCCI President Sourav Ganguly's wife Dona hospitalised after contracting chikungunya","link":"https://www.indiatvnews.com/sports/cricket/bcci-president-sourav-ganguly-s-wife-dona-hospitalised-after-contracting-chikungunya-sourav-ganguly-dona-ganguly-2022-10-05-813968","keywords":null,"creator":null,"video_url":null,"description":"The Board of Control for Cricket in India (BCCI) President Sourav Ganguly’s wife Dona has been hospitalised after she contracted chikungunya late on Tuesday night. The former India captain’s wife was rushed to the hospital in Kolkata after she showed symptoms of the virus. Consistent coughing and throat pain were the symptoms noted while she was taken to emergency help. It is also reported that she is now fine and stable.","content":null,"pubDate":"2022-10-05 15:23:16","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"IND vs SA, 1st ODI: Weather report - What role will rain play in India vs South Africa match?","link":"https://www.indiatvnews.com/sports/cricket/ind-vs-sa-1st-odi-weather-report-what-role-will-rain-play-in-india-vs-south-africa-match-lucknow-rain-2022-10-05-813963","keywords":null,"creator":null,"video_url":null,"description":"The first match of the three-match ODI series between India and South Africa is scheduled to be played on Thursday. The game will begin at 1:30 PM and will be played at the Bharat Ratna Shri Atal Bihari Vajpayee Ekana Cricket Stadium, Lucknow.","content":null,"pubDate":"2022-10-05 15:09:25","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"Legends League Cricket: युसूफ पठान-जॉनसन दुश्मनी भूल गले मिले, ऑस्ट्रेलियाई पेसर ने मारा था धक्का, की थी बदतमीजी","link":"https://navbharattimes.indiatimes.com/sports/cricket/cricket-news/yusuf-pathan-mitchell-johnson-friendly-moment-in-legends-league-cricket-final/articleshow/94665631.cms","keywords":null,"creator":null,"video_url":null,"description":"Yusuf Pathan Mitchell Johnson Fight: भारतीय स्टार खिलाड़ी युसूफ पठान और मिशेल जॉनसन की 4 दिन पुरानी दुश्मनी खत्म हो गई है। लीजेंड्स लीग क्रिकेट के खिताबी मुकाबले से ठीक पहले दोनों गले मिलते और फ्रेंडली तरीके से बातचीत करते दिखाई दिए।","content":null,"pubDate":"2022-10-05 14:59:07","image_url":null,"source_id":"navbharattimes","country":["india"],"category":["sports"],"language":"hindi"},{"title":"Match Preview - India vs South Africa, South Africa in India 2022/23, 1st ODI - ESPNcricinfo","link":"https://news.google.com/__i/rss/rd/articles/CBMifWh0dHBzOi8vd3d3LmVzcG5jcmljaW5mby5jb20vc2VyaWVzL3NvdXRoLWFmcmljYS1pbi1pbmRpYS0yMDIyLTIzLTEzMjc0OTkvaW5kaWEtdnMtc291dGgtYWZyaWNhLTFzdC1vZGktMTMyNzUwOS9tYXRjaC1wcmV2aWV30gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Match Preview - India vs South Africa, South Africa in India 2022/23, 1st ODI  ESPNcricinfoIndia v South Africa, ODI Series: Preview  CricbuzzIndia Vs South Africa 1st ODI Weather Forecast And Pitch Report  ICC CRICKET SCHEDULE`Jo unhone team choose ki hai...`, Shikhar Dhawan BREAKS silence on his snub from India`s T20 World Cup squ...  Zee NewsIND vs SA LIVE Score: India vs South Africa 1st ODI starts 1:30, Check Indian Playing XI: Follow LIVE  InsideSportView Full coverage on Google News","content":null,"pubDate":"2022-10-05 14:30:00","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"India vs South Africa Delhi tickets: How to do India vs South Africa ODI tickets online booking 3rd ODI?","link":"https://thesportsrush.com/cricket-news-india-vs-south-africa-delhi-tickets-how-to-do-india-vs-south-africa-odi-tickets-online-booking-3rd-odi/","keywords":["Cricket","India","South Africa","South Africa tour of India 2022"],"creator":["Dixit Bhargav"],"video_url":null,"description":"India vs South Africa Delhi tickets: Arun Jaitley Stadium will be hosting the last match of South Africa’s second tour of India 2022. The last match of South Africa’s second tour of India 2022 will be played in Delhi on October 11. The sixth white-ball match and third ODI will be the last international match… The post India vs South Africa Delhi tickets: How to do India vs South Africa ODI tickets online booking 3rd ODI? appeared first on The SportsRush.","content":"India vs South Africa Delhi tickets: Arun Jaitley Stadium will be hosting the last match of South Africa’s second tour of India 2022. The last match of South Africa’s second tour of India 2022 will be played in Delhi on October 11. The sixth white-ball match and third ODI will be the last international match for both the teams before ICC T20 World Cup 2022. While India’s squads for the World Cup and a three-match ODI series against South Africa have been selected in such a way that no player will play both matches, some of the South African cricketers will have to play in both the competitions. Arun Jaitley Stadium, which had hosted South Africa for a T20I during their first tour of India this year, will be hosting them for an ODI next week as the format will return to this venue after more than three years. India vs South Africa Delhi tickets There wasn’t any specified date for ticket sales to start for general public for the third India vs South Africa ODI on Tuesday. It was only this morning that the same began on online platform Paytm Insider. In what isn’t surprising by any means, fans in the national capital have booked almost all the tickets of the first phase within the first day itself. At the time of publishing this story, only some tickets in two price categories (INR 1,500 – East Stand Ground Floor and INR 10,000 – Hill A) are up for grabs. As far as the second phase of ticket sales is concerned, DDCA (Delhi & District Cricket Association) haven’t provided any official information with respect to the same for now. How to do India vs South Africa ODI tickets online booking 3rd ODI? The booking process for India vs South Africa ODI tickets is pretty simple. All one has to do is search for “Mastercard Series” on the mobile application or website of Paytm Insider. After clicking on “Mastercard Series 3rd ODI”, click on “Buy Now” towards the right side of your computer screens. Subsequently, select the preferred price category of your choice. Confirm the number of tickets required and complete the online transaction like on any other platform. The post India vs South Africa Delhi tickets: How to do India vs South Africa ODI tickets online booking 3rd ODI? appeared first on The SportsRush.","pubDate":"2022-10-05 14:24:43","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Lucknow pitch report tomorrow match: Bharat Ratna Shri Atal Bihari Vajpayee Cricket Stadium pitch report IND vs SA 1st ODI","link":"https://thesportsrush.com/cricket-news-lucknow-pitch-report-tomorrow-match-bharat-ratna-shri-atal-bihari-vajpayee-cricket-stadium-pitch-report-ind-vs-sa-1st-odi/","keywords":["Cricket","India","South Africa","South Africa tour of India 2022"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"Lucknow pitch report tomorrow match: The SportsRush brings you the pitch report of the IND vs SA 1st ODI match. Lucknow’s Bharat Ratna Shri Atal Bihari Vajpayee Ekana Cricket Stadium is set to host the 1st ODI of the 3-match ODI series between India and South Africa on Thursday. After a win in the T20Is,… The post Lucknow pitch report tomorrow match: Bharat Ratna Shri Atal Bihari Vajpayee Cricket Stadium pitch report IND vs SA 1st ODI appeared first on The SportsRush.","content":"Lucknow pitch report tomorrow match: The SportsRush brings you the pitch report of the IND vs SA 1st ODI match. Lucknow’s Bharat Ratna Shri Atal Bihari Vajpayee Ekana Cricket Stadium is set to host the 1st ODI of the 3-match ODI series between India and South Africa on Thursday. After a win in the T20Is, a new look Indian team will go in the ODIs, whereas South Africa have chosen a strong squad. The major eyes from the Indian team will be on Shreyas Iyer, Deepak Chahar, Ravi Bishnoi and Mohammed Siraj, who are set to be on that plane to Australia for the T20 World Cup. Shubhman Gill will have yet another opportunity to seal his spot as the 3rd opener for the next year’s ODI World Cup in India. For South Africa, Janneman Malan and Andile Phehlukwayo are set to take part in the ODI series. Temba Bavuma was poor in the T20Is, but his record in ODIs is great, and he will bat at the number three spot. David Miller would want to continue his form in the 50-over format as well. Lucknow pitch report tomorrow match The Ekana Stadium in Lucknow has hosted a total of 3 ODIs so far, and all of them were played between West Indies and Afghanistan in 2019. India and South Africa were scheduled to play an ODI game here in 2020 as well, but it was cancelled due to the Covid pandemic. The average 1st innings score in the 3 ODIs played here has been 230 runs, which suggests that batting has been tough here, but it is usually a good batting track. A Black Soil surface will be used in this match which will give the pacers an extra amount of bounce, but the batters will also enjoy that to play their shots. Hello from Lucknow Preps for the #INDvSA ODI series begin. #TeamIndia | @mastercardindia pic.twitter.com/0y1qjtqmSU — BCCI (@BCCI) October 4, 2022 It was seen that the spinners of the Afghanistan side enjoyed bowling here, so this track will bring the spinners as well in the contest as the game will progress. The boundaries of this stadium are not that huge, whereas the outfield is quite fast as well. So, overall a decent batting track is on the cards yet again. This ground recently hosted some three games of the Legends League Cricket 2022, and the dew was visible. So both captains would want to chase upon winning the toss in this match. The post Lucknow pitch report tomorrow match: Bharat Ratna Shri Atal Bihari Vajpayee Cricket Stadium pitch report IND vs SA 1st ODI appeared first on The SportsRush.","pubDate":"2022-10-05 14:00:44","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"‘That was awful’: Crazy end to cricket thriller","link":"https://www.cairnspost.com.au/sport/cricket/australia-clinches-unconvincing-victory-as-series-opener-ends-in-chaotic-scenes/news-story/25a4ff038b7ea0a54b0c3fad779a11d1","keywords":["Cricket news and galleries","Kayo","Sport news and galleries"],"creator":null,"video_url":null,"description":"Matthew Wade was once again the hero as Australia clinched a thrilling, albeit unconvincing, three-wicket victory over the West Indies at Metricon Stadium on Wednesday evening.","content":null,"pubDate":"2022-10-05 13:34:00","image_url":null,"source_id":"cairnspost","country":["australia"],"category":["sports"],"language":"english"},{"title":"ICC Monthly Awards: Indian duo Harmanpreet Kaur & Smriti Mandhana nominated after impressing in England series","link":"https://www.indiatvnews.com/sports/cricket/icc-monthly-awards-indian-duo-harmanpreet-kaur-smriti-mandhana-nominated-after-impressing-in-england-series-ind-w-vs-eng-w-2022-10-05-813934","keywords":null,"creator":null,"video_url":null,"description":"The Indian duo of Harmanpreet Kaur and Smriti Mandhana have been nominated for the International Cricket Council (ICC) Player of the Month for September after impressing in the ODI series against England. The duo led India to a historic 3-0 whitewash of the hosts as they won their first series on English soil since 1999. Bangladesh’s Nigar Sultana is the third player to be nominated for the monthly awards after she impressed in the ICC Women's T20 World Cup Qualifier 2022 in UAE.","content":null,"pubDate":"2022-10-05 13:11:02","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"India Capitals vs Bhilwara Kings Final Live Score Updates: Legends League Cricket reaches its finale","link":"https://indianexpress.com/article/sports/cricket/india-capitals-vs-bhilwara-kings-llc-final-live-score-updates-8191516/","keywords":["Cricket","Sports"],"creator":null,"video_url":null,"description":null,"content":"Bhilwara Kings win the toss and opted to bowl first against the India Capitals in the final of the Legends League Cricket at the Sawai Mansingh Stadium in Jaipur on Wednesday. -led India Capitals and Irfan Pathan’s Bhilwara Kings finished the league stage in the Top-2 because of their consistent performances. Winner takes home a prize money of 2 crore. Gautam Gambhir (c), Dwayne Smith, Hamilton Masakadza, Ross Taylor, Dinesh Ramdin (wk), Ashley Nurse, , Praveen Gupta, Pravin Tambe, Pankaj Singh, Pawan Suyal William Porterfield, Morne van Wyk (wk), , , Irfan Pathan (c), Jesal Karia, Rahul Sharma, Monty Panesar, Tino Best, S , Dhammika Prasad Gautam Gambhir (c), Dwayne Smith, Hamilton Masakadza, Ross Taylor, Dinesh Ramdin (wk), Ashley Nurse, Mitchell Johnson, Praveen Gupta, Pravin Tambe, Pankaj Singh, Pawan Suyal William Porterfield, Morne van Wyk (wk), Shane Watson, Yusuf Pathan, Irfan Pathan (c), Jesal Karia, Rahul Sharma, Monty Panesar, Tino Best, S Sreesanth, Dhammika Prasad Dhammika Prasad comes into the side in place of Fidel Edwards, Bhilwara's captain Pathan confirms. He says that he wants to back his players to do what their players have been doing throughout this tournament under pressure. Gambhir admits he would have bowled first too. All set for the toss now and the Kings have won the toss. They opt to bowl first against the Capitals. Toss update: have won the toss and decided to bowl first! Ready for the grand finale! are all set to make a entry to the final battle! Catch them live on , and at 7:30 PM tonight. Celebration mode on! Squad: Gautam Gambhir(c), Dwayne Smith, Hamilton Masakadza, Ross Taylor, Denesh Ramdin(w), Ashley Nurse, John Mooney, Liam Plunkett, Mitchell Johnson, Pankaj Singh, Pravin Tambe, Pawan Suyal, Ishwar Pandey, Praveen Gupta, Solomon Mire, Suhail Sharma, Dishant Yagnik, Asghar Afghan, Rajat Bhatia, Ravi Bopara, Mashrafe Mortaza, Jacques Kallis, Prosper Utseya, Farveez Maharoof Squad: William Porterfield, Morne van Wyk(w), Shane Watson, Yusuf Pathan, Irfan Pathan(c), Rajesh Bishnoi, Jesal Karia, Monty Panesar, Fidel Edwards, S Sreesanth, Sudeep Tyagi, Nick Compton, Rahul Sharma, Matt Prior, Dinesh Salunkhe, Naman Ojha, Mayank Tehlan, Samit Patel, Tanmay Srivastava, Tim Bresnan, Owais Shah, Tino Best Grand departure of to the battle field! IT'S FINALE! Irrfan Pathan had a stellar Road Safety World Series where he represented the India Legends and won the title. Can e lead the Kings to another title tonight? interacting with fans and winning hearts! Watch him lead in tonight's mega clash! Action goes live on / / , 7.30 pm onwards. Tickets on . Gearing up for the final showdown ! India Capitals and Bhilwara Kings will face each other in the final of the Legends League Cricket at the Sawai Mansingh Stadium in Jaipur. Both teams have made it to the final on the back of some pretty consistent performances. Finals! A cracking contest awaits at Sawai Mansingh Stadium, 7.30 pm onwards as clash against . Watch live on . Tickets on -","pubDate":"2022-10-05 13:00:29","image_url":null,"source_id":"indianexpress","country":["india"],"category":["sports"],"language":"english"},{"title":"LLC Final Live: Ross Taylor Hits Fifty, Johnson Steady For Capitals","link":"https://sports.ndtv.com/cricket/india-capitals-vs-bhilwara-kings-legends-league-cricket-2022-final-live-score-updates-3405557","keywords":["Cricket"],"creator":["NDTV"],"video_url":null,"description":"Legends League Cricket Final Live Updates: Ross Taylor is on the charge for the India Capitals, following a top-order collapse","content":null,"pubDate":"2022-10-05 12:41:56","image_url":"https://c.ndtvimg.com/2022-10/e1gjmdqg_dwayne-smith-hamilton-masakadza-240_120x90_05_October_22.jpg","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"ICC Monthly Awards: Axar Patel makes 3-men shortlist alongside Cameroon Green & Mohammad Rizwan for September","link":"https://www.indiatvnews.com/sports/cricket/icc-monthly-awards-axar-patel-makes-3-men-shortlist-alongside-cameroon-green-mohammad-rizwan-for-september-ind-vs-aus-ind-vs-sa-mohammad-rizwan-2022-10-05-813919","keywords":null,"creator":null,"video_url":null,"description":"India’s Axar Patel has been nominated for the International Cricket Council (ICC) September ‘Player of the Month’ after impressing against Australia. The Indian star was adjourned ‘Player of the Series’ against the Aussies and eraned nomination ahead of Suryakumar Yadav. He is joined by Mohammad Rizwan who was impressive in the T20I series against England, having scored four fifties. Cameroon Green is also nominated for his excellent touch against India.","content":null,"pubDate":"2022-10-05 12:12:34","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"Deepak Sahar who gave mancut out warning: Netizens reaction","link":"https://thenewsglory.com/deepak-sahar-who-gave-mancut-out-warning-netizens-reaction/","keywords":["Sports","Cricket","Deepak Chahar","Deepak Sahar","game","India","Mankad"],"creator":["The News Glory"],"video_url":null,"description":"Indore: In the third T20 between India and South Africa, South African batsman Stubbs, who was at the non-striker’s end, was given a run-out warning by Indian bowler Deepak Sahar Mankat. Netizens have reacted to it on social media. The South African cricket team is touring India and playing in a cricket series. The tour […]","content":"Indore: In the third T20 between India and South Africa, South African batsman Stubbs, who was at the non-striker’s end, was given a run-out warning by Indian bowler Deepak Sahar Mankat. Netizens have reacted to it on social media. The South African cricket team is touring India and playing in a cricket series. The tour includes T20 and ODI series. The 3-match T20 series is over. The Indian team has won the series 2-1. The Indian team has lost in the last match. This incident happened in this match. The South African team batted first and scored 227 runs. Deepak Sahar bowled the 16th over of that innings. Before he bowled, Stubbs had moved a few feet away from the crease to take a single at the non-striker’s end. Noticing this, Sahar had gently warned him that there was a chance of a ‘run-out’. It kept the audience engaged in the game. Recently Indian player Deepti Sharma had run-out England player Charlie in this manner against England team. This is being debated. By then Sahar has done this. Netizens’ Reaction: “Mancut out rule will only be used against England players”, “Ashwin’s mind voice on the boundary line?”, “It’s not Deepak, it’s Deepak”. \r Deepak isn’t Deepti… #mankadingpic.twitter.com/p40OoEFZR3","pubDate":"2022-10-05 11:42:04","image_url":null,"source_id":"thenewsglory","country":["india"],"category":["sports"],"language":"english"}]}