{"newsArray":[{"title":"Mendis and Madushka receive plaudits from the captain","link":"https://www.ft.lk/sports/Mendis-and-Madushka-receive-plaudits-from-the-captain/23-747852","keywords":null,"creator":null,"video_url":null,"description":null,"content":"Following a tough two-Test series in New Zealand where Sri Lanka narrowly lost the first Test off the last ball of the match by two wickets and then the second Test by an innings, the recently concluded series against Test minnows at home was just the antidote they needed to inject some life into their cricket, especially the batting. There were no less than eight centuries scored in the two Tests played at Galle which included two double tons off the bats of Player of the Series Kusal Mendis and skipper Dimuth Karunaratne’s new opening partner Nishan Madushka. Mendis and Karunaratne were the recipients of back-to-back centuries having scored one in each of the two Tests. In the limited number of Tests Sri Lanka are scheduled to play for the entire year – six, this series was the best opportunity for the players to capitalise and make full use of the opportunities that came their way to enhance their career performances and like Karunaratne said “it was a good confidence booster”. Like we pointed out in an earlier article it seems that Kusal Mendis has arrived and a lot more runs can be expected off his bat in the near future. “Kusal has rendered yeoman service to Sri Lanka cricket. What was missing from him was big innings. He has shown it in the last two Test innings (scoring 140 and a career best 245),” said Karunaratne of his top batsman. “I hope he will make it a habit and continue to score regularly. It is not easy for a player who plays in all three formats to adjust to them immediately. He is now an experienced cricketer, and he is able to make the changes without much difficulty. I hope that he will be successful in the future.” Apart from Mendis the other batsman to impress was 23-year-old right-handed top order batsman Nishan Madushka. What a year it has been for this youngster from Moratuwa. He began the 2022-23 season by becoming the quickest to reach 1000 runs in a Sri Lankan first-class season, getting there in the least number of innings – nine. It included a century in each innings of a match for Ragama CC to start with and a further three hundreds that included a triple century. He followed this up with scores of 150*, 1 & 241, 22 & 100 against England Lions, performances that won him a place in the national side for the tour to New Zealand, where he broke into the Test ranks and made his Test debut in the second Test and wicket-keeper/batsman batting lower down the order at 8 and 7. Come the Ireland series and Madushka promoted to open the innings made maximum use of it to carve out a magnificent double century and establish himself as Karunaratne’s opening partner. They put on a record-breaking opening stand of 228 which was a ground record for Galle. While Karunaratne was dismissed for 15, Madushka went on to make a memorable 205. “I see Nishan Madushka as a very well-organised player. He knows what his game is, when to hit the ball, which ball to play and to what situations he must play. He has an uncomplicated and simple plan,” said Karunaratne. “I like it if he could keep it simple. He has made big scores before 300 and all that and he has the habit of doing that. It is only at international level he had not done so. From the start he went on to make big innings which I think will be good for his career. He knows how to compile a double century and from there learn how to make big scores. He is a player with a long career ahead of him.”","pubDate":"2023-05-01 20:16:53","image_url":null,"source_id":"ft_lk","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Watch: Virat Kohli and Gautam Gambhir in ugly verbal spat after LSG vs RCB","link":"https://www.firstpost.com/firstcricket/sports-news/watch-virat-kohli-and-gautam-gambhir-in-ugly-verbal-spat-after-lsg-vs-rcb-12534412.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"Watch: Virat Kohli and Gautam Gambhir in ugly verbal spat after LSG vs RCB","content":"Cricket Watch: Virat Kohli and Gautam Gambhir in ugly verbal spat after LSG vs RCB To put it into context, when RCB and LSG had clashed earlier in the season in Bengaluru, Gambhir could be seen gesturing towards the crowd with a 'shut up' sign, but it is still unclear if Virat was responding to that. FirstCricket Staff May 2nd, 2023 2:26:29 IST Virat Kohli and Gautam Gambhir were involved in a verbal spat after LSG vs RCB. Sportzpics Royal Challengers Bangalore’s Virat Kohli and Lucknow Super Giants mentor Gautam Gambhir were involved in a heated exchange after their IPL match in Lucknow on Monday. Kohli was quite animated throughout the match with LSG batters getting dismissed at regular intervals. IPL 2023: Full coverage | Points table | Schedule | Results | Orange Cap | Purple Cap​ To put it into context, when RCB and LSG had clashed earlier in the season in Bengaluru, Gambhir could be seen gesturing towards the crowd with a ‘shut up’ sign, but it is still unclear if Virat was responding to that. The calm before the storm – ft. Virat Kohli and Gautam Gambhir. pic.twitter.com/mxE6eTYzR7 Related Articles IPL 2023: KL Rahul leaves the field after sustaining an injury during LSG vs RCB match IPL 2023: 'The medical team will assess it,' Krunal Pandya provides update on LSG skipper KL Rahul's injury — Mufaddal Vohra (@mufaddal_vohra) May 1, 2023 For a while, things seemed perfectly fine between Kohli and Gambhir and had even shaken hands. Just soon after, LSG’s Kyle Mayers was seen walking upto Kohli and starting a conversation with the former skipper. Gambhir was quick to notice this and then took Mayers away. Watch this whole video It was gautam Gambhir who came in between mayers and Virat kohli and started crying pic.twitter.com/uaevYxuq5Y — M. (@IconicKohIi) May 1, 2023 Soon after the incident, more visuals showed Gambhir being animated and confronting Kohli, and at this point, KL Rahul and other support stuff were quick enough to intervene and separated the two. And following all this, KL Rahul was seen having a long chat with Kohli. In another video, Kohli and Naveen-ul-Haq were also seen involved in a war of words at the end of the contest, following an episode of sledging between the two when Naveen had walked out to bat during LSG’s chase. Lol he is showing aggression to the king of cricket #RCBVSLSG #ViratKohli #IPL2023 pic.twitter.com/DF0Empuwi5 — Haider Khan (@ind_iw0) May 1, 2023 RCB emerged victorious by 18 runs in a low-scoring contest. Naveen had picked three wickets to restrict RCB to 126/9, but none of the LSG batters managed a big score and they were bundled out for 108. Read all the Latest News , Trending News , Cricket News , Bollywood News , India News and Entertainment News here. Follow us on Facebook , Twitter and Instagram . Updated Date: May 02, 2023 02:26:29 IST Tags: Gautam Gambhir Ipl 2023 Ipl 2023 Lsg Ipl 2023 Rcb Find latest and upcoming tech gadgets online on Tech2 Gadgets. Get technology news, gadgets reviews & ratings. Popular gadgets including laptop, tablet and mobile specifications, features, prices, comparison.","pubDate":"2023-05-01 20:04:43","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/05/Kohli-and-Gambhir-640_Sportzpics.jpg","source_id":"firstpost","category":["sports"],"country":["india"],"language":"english"},{"title":"IPL 2023: 'The medical team will assess it,' Krunal Pandya provides update on LSG skipper KL Rahul's injury","link":"https://www.firstpost.com/firstcricket/sports-news/ipl-2023-the-medical-team-will-assess-it-krunal-pandya-provides-update-on-lsg-skipper-kl-rahuls-injury-12534372.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"IPL 2023: 'The medical team will assess it,' Krunal Pandya provides update on LSG skipper KL Rahul's injury","content":"Cricket IPL 2023: 'The medical team will assess it,' Krunal Pandya provides update on LSG skipper KL Rahul's injury LSG skipper KL Rahul got injured while fielding during their IPL game against RCB in Lucknow. FirstCricket Staff May 2nd, 2023 0:48:55 IST KL Rahul of Lucknow Super Giants with medical staff match 43 of the Tata Indian Premier League between the Lucknow Super Giants and the Royal Challengers Bangalore at the Bharat Ratna Shri Atal Bihari Vajpayee Ekana Cricket Stadium, Lucknow, on the 1st May 2023 Photo by: Arjun Singh / SPORTZPICS for IPL Lucknow Super Giants (LSG) succumbed to an 18-run defeat to Royal Challengers Bangalore (RCB) in the Indian Premier League (IPL) on Monday, and stand-in skipper Krunal Pandya said that KL Rahul had “pulled his hip-flexor” while adding that the medical team would assess his injury. IPL 2023: Full coverage | Points table | Schedule | Results | Orange Cap | Purple Cap​ KL Rahul seemed to have tweaked his right thigh muscle while fielding, in the final ball of the second over of RCB’s innings. Rahul was chasing the ball to stop the boundary after Faf du Plessis had punched through extra cover off Marcus Stoinis’ ball. Related Articles IPL 2023: KL Rahul leaves the field after sustaining an injury during LSG vs RCB match IPL 2023: RCB bowlers dominate powerplay as LSG restricted to 34/4 in first six overs The physio then had a look on Rahul, soon after which the captain was taken off the field in a stretcher. “It is a sad thing. He pulled his hip flexor, I guess. I do not know how bad it is. The medical team will assess it,” said Krunal Pandya after the match. Krunal lamented at LSG not being able to execute their batting plans. “We did pretty well, restricting them to 126 was a great bowling effort. Really happy with how we have bowled in this tournament. We would have taken 126 but batting-wise we did not execute our plans,” added Krunal. Faf du Plessis, RCB captain, was named Player of the Match for his contribution with the bat (44 runs). Du Plessis admitted that a total of 135 would have been a good total. “Would’ve liked 135 – in my mind that was a really good score. Before we went on the field, we said to the guys it’s a match-winning score. Felt if we get 2-3 in the powerplay, especially with KL not being there, it’s going to be difficult,” said the RCB skipper. Read all the Latest News , Trending News , Cricket News , Bollywood News , India News and Entertainment News here. Follow us on Facebook , Twitter and Instagram . Updated Date: May 02, 2023 00:48:55 IST Tags: Ipl 2023 Ipl 2023 Lsg Ipl 2023 Rcb Kl Rahul Find latest and upcoming tech gadgets online on Tech2 Gadgets. Get technology news, gadgets reviews & ratings. Popular gadgets including laptop, tablet and mobile specifications, features, prices, comparison.","pubDate":"2023-05-01 19:18:55","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/05/KL-Rahul-640_Sportzpics-2.jpg","source_id":"firstpost","category":["sports"],"country":["india"],"language":"english"},{"title":"रॉयल चैलेंजर्स बैंगलोर ने लखनऊ सुपर जाएंट्स को 18 रन से हराया","link":"https://www.khaskhabar.com/sports/cricket-news/sports-news-royal-challengers-bangalore-beat-lucknow-super-giants-by-18-runs-news-hindi-1-558112-KKN.html","keywords":null,"creator":null,"video_url":null,"description":"आईपीएल के 16वें सीजन का 43वां लीग मुकाबला लो स्कोरिंग जरूर रहा लेकिन मुकाबले में...","content":"आईपीएल के 16वें सीजन का 43वां लीग मुकाबला लो स्कोरिंग जरूर रहा लेकिन मुकाबले में रोमांच पूरी तरह से सभी फैंस को देखने को मिला। इस मैच में रॉयल चैलेंजर्स बैंगलोर ने लखनऊ सुपर जायंट्स से अपनी पिछली हार का हिसाब बराबर करते हुए 18 रनों से मैच को अपने नाम किया। 127 रनों के लक्ष्य का पीछा करने उतरी लखनऊ की टीम 19.5 ओवरों में 108 के स्कोर पर सिमट गई। आरसीबी के लिए गेंदबाजी में कर्ण शर्मा और हेजलवुड ने 2-2 अपने नाम किए। कप्तान केएल राहुल का फील्डिंग के समय चोटिल होने की वजह से लखनऊ की तरफ से लक्ष्य का पीछा करने काइल मेयर्स के साथ ओपनिंग में आयुष बडोनी को भेजा गया। आरसीबी ने लखनऊ को शून्य के स्कोर पर ही पहला झटका काइल मेयर्स के रूप में दिया जो बिना खाता खोले ही पवेलियन लौट गए। इसके बाद लखनऊ को 19 के स्कोर पर क्रुणाल पांड्या के रूप में दूसरा झटका लगा जो ग्लेन मैक्सवेल के खिलाफ बड़ा शॉट खेलने के प्रयास में 14 के निजी स्कोर पर कोहली को अपना कैच थमा बैठे। यहां से सभी को उम्मीद थी कि लखनऊ की टीम थोड़ा संभलकर बल्लेबाजी करेगी। लेकिन ऐसा देखने को नहीं मिला और टीम को अगला झटका 21 के स्कोर पर आयुष बडोनी और उसके बाद 27 के स्कोर पर दीपक हुड्डा के रूप में चौथा झटका लगा। लखनऊ की टीम पहले 6 ओवरों में 4 विकेट के नुकसान पर 34 रनों के स्कोर तक पहुंचने में कामयाब हो सकी। शुरुआती 4 विकेट जल्दी गंवाने के बाद लखनऊ की टीम के लिए इस मैच में वापसी करना काफी मुश्किल दिखाई देने लगा। टीम को 5वां झटका निकोलस पूरन के रूप में 38 के स्कोर पर लगा जो 9 रन बनाने के बाद पवेलियन लौट गए। इसके बाद मार्कस स्टोइनिस और कृष्णप्पा गौतम के बीच में छठे विकेट के लिए 22 गेंदों में 27 रनों की साझेदारी देखने को मिली। इस साझेदारी के दम पर लखनऊ की टीम ने मैच में थोड़ा वापसी की। लेकिन 65 के स्कोर पर मार्कस स्टोइनिस के पवेलियन लौटने के साथ आरसीबी ने मैच को पूरी तरह से अपनी तरफ मोड़ लिया। इसके बाद लखनऊ ने 66 के स्कोर पर कृष्णप्पा गौतम और उसके बाद 77 के स्कोर पर रवि बिश्नोई का विकेट भी गंवा दिया। लखनऊ की टीम इस मुकाबले में 108 रनों का स्कोर बनाकर सिमट गई और उसे 18 रनों से हार का सामना करना पड़ा। आरसीबी के लिए गेंदबाजी में कर्ण शर्मा और जोश हेजलवुड ने 2-2 जबकि हर्षल पटेल, मोहम्मद सिराज, वानिन्दु हसरंगा और ग्लेन मैक्सवेल ने 1-1 विकेट हासिल किया।","pubDate":"2023-05-01 18:29:37","image_url":null,"source_id":"khaskhabar","category":["sports"],"country":["india"],"language":"hindi"},{"title":"IPL 2023: Karn Sharma, Josh Hazlewood Star In RCB's 18-Run Win Over LSG","link":"https://sports.ndtv.com/cricket/lsg-vs-rcb-ipl-2023-karn-sharma-josh-hazlewood-star-in-royal-challengers-bangalores-18-run-win-over-lucknow-super-giants-3996399","keywords":null,"creator":null,"video_url":null,"description":"IPL 2023: Royal Challengers Bangalore defeated Lucknow Super Giants by 18 runs in their Indian Premier League match on Monday.","content":"Aided by KL Rahul's injury early in the match, Royal Challengers Bangalore did just enough to eke out an 18-run win over Lucknow Super Giants in a low-scoring Indian Premier League game at the Ekana Cricket Stadium on Monday. LSG skipper Rahul pulled his right thigh muscle in the second over of RCB innings while trying to stop a boundary and came out to bat only towards the end, which acted in favour of the visitors. LSG dished out a fine bowling display to restrict RCB to a below-par 126 after being asked to bowl first. RCB never had momentum in their innings despite the opening pair of skipper Faf du Plessis and Virat Kohli sharing a 62-run partnership. The spin duo of Ravi Bishnoi (2/21) and veteran Amit Mishra (2/21) shone bright with the ball in the middle overs to keep a check on RCB's scoring rate. Later, it turned out to be a nightmarish start for LSG while chasing a modest 127-run target, as they lost their first three wickets for just 21 runs in 4.1 overs. In Rahul's absence, Kyle Mayers and Ayush Badoni opened the innings but failed to live up to the expectations. While Mayers departed in the second delivery of the innings without troubling the scorers, stand-in captain Krunal Pandya played an 11-ball 14-run knock before being caught by Virat Kohli at long-off off Glenn Maxwell. Badoni followed suit in the next over while going for big shot, caught by Kohli off Josh Hazlewood (2/15). If that was not enough, Deepak Hooda was stumped by Dinesh Karthik off Wanindu Hasaranga de Silva, as LSG slumped to 27 for four in 5.1 overs. Leg-spinner Karn Sharma (2/20) then accounted for Nicholas Pooran (9) and Marcus Stoinis (13) in a span of four overs to make matters worse for LSG. Advertisement The asking rate was under control, but LSG kept losing wickets at regular intervals. Krishnappa Gowtham was the next to depart, run out after a 13-ball 23. Ravi Bishnoi then ran himself out as LSG collapsed to 77 for eight in 14.4 overs. Naveen-ul-Haq and Amit Mishra tried their best with a gutsy 26-run stand for the ninth wicket. An injured Rahul came out to bat last with LSG needing 24 off eight balls, but he looked in discomfort and failed to open his account. Earlier, Rahul failed to stop the boundary, looked in considerable pain, and limped off the field. In his absence, Pandya led the side. The duo of du Plessis and Kohli gave RCB another good start. Both the openers failed to get going but gave a platform for the rest of the batters to take RCB to a decent score. Kohli didn't look at his best as he managed just three boundaries during his 30-ball 31-run knock before being stumped by Pooran off the bowling of Bishnoi. New man in Anuj Rawat didn't last long as he gave a catch to Mayers in the deep off the bowling of Gowtham. Dangerman Glenn Maxwell followed suit, without troubling the scorers much, LBW to Bishnoi. After the initial partnership between du Plessis and Kohli, the LSG bowlers pulled back the game brilliantly. Suyash Prabhudesai didn't last long, caught by Gowtham at mid-off off the bowling of veteran Mishra, as RCB slumped to 90 for four in 14.3 overs. The match came to halt in the 16th over due to a steady drizzle. After a delay of nearly 26 minutes due to rain, the match restarted with no overs being reduced. While du Plessis batted deep he never got the desired momentum in his knock and struggled to find boundaries and sixes. He was eventually dismissed by Mishra in the 17th over, caught by Pandya as the South African tried to break the shackles. Thereafter, Dinesh Karthik (16 off 11) tried his best to up the ante but it wasn't enough. Towards the end, Afghan fast bowler Naveen-ul-Haq picked up two wickets in two deliveries in the 20th overs, to finish with figures of 3 for 30. (This story has not been edited by NDTV staff and is auto-generated from a syndicated feed.)","pubDate":"2023-05-01 18:28:56","image_url":null,"source_id":"ndtv","category":["sports"],"country":["india"],"language":"english"},{"title":"LSG vs RCB: टी20 में टेस्ट जैसी बैटिंग, एक-एक बाउंड्री के लिए तरसी RCB, शर्मनाक रिकॉर्ड बनाया","link":"https://hindi.news18.com/news/sports/cricket-virat-kohli-faf-du-plesis-royal-challengers-hit-only-8-boundaries-against-lsg-the-fewest-by-any-team-in-ipl-2023-6062185.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"LSG vs RCB: आईपीएल 2023 के 43 वें मैच में रॉयल चैलेंजर्स बैंगलोर ने पहले बैटिंग करते हुए 20 ओवर में महज 126 रन बनाए. आरसीबी की पूरी पारी में 6 चौके और 2 छक्के ही लगे. ये आईपीएल 2023 में किसी टीम की सबसे कम बाउंड्री है. विराट कोहली और फाफ डुप्लेसी ने ही 8 में से 5 बाउंड्री मारी.","content":"विराट कोहली और फाफ डुप्लेसी को छोड़ दें तो बैंगलोर का कोई बैटर LSG के खिलाफ टिक नहीं पाया. (IPL Instagram) नई दिल्ली. आईपीएल 2023 का 43वां मुकाबला रॉयल चैलेंजर्स बैंगलोर और लखनऊ सुपर जायंट्स के बीच खेला जा रहा. पहले बैटिंग करते हुए आरसीबी ने 20 ओवर में 9 विकेट पर 126 रन ही बना पाई. यानी टी20 में टेस्ट के अंदाज में बैटिंग हुई. मैच में टॉस आरसीबी के कप्तान फाफ डुप्लेसी ने ही जीता था और पहले बल्लेबाजी का फैसला किया था. विराट कोहली और कप्तान डुप्लेसी को छोड़ दें तो आरसीबी के बाकी बल्लेबाज लखनऊ की पिच की पहेली समझ ही नहीं पाए. इन दोनों ने पहले विकेट के लिए 62 रन जोड़े. विराट कोहली ने 30 गेंद में 31 और डुप्लेसी ने 40 गेंद में 44 रन की पारी खेली. इसके अलावा तीसरा सर्वश्रेष्ठ स्कोर दिनेश कार्तिक (16) ने बनाया. बाकी कोई भी बैटर दहाई के आंकड़े तक भी नहीं पहुंचा. इस मैच के दौरान आरसीबी के नाम एक शर्मनाक रिकॉर्ड दर्ज हुआ. पूरी पारी में बैंगलोर के बल्लेबाज सिर्फ 8 बाउंड्री लगा पाए. इसमें से पांच तो अकेले विराट-फाफ ने ठोके. कोहली ने सबसे अधिक 3 चौके मारे. फाफ के बल्ले से 1 चौका और 1 छक्का निकला. ये आईपीएल 2023 में किसी टीम सबसे कम बाउंड्री है. पूरी पारी में 6 चौके और 2 छक्के लगे हैं. इससे पहले, आईपीएल 2023 के किसी मैच में सबसे कम 13 बाउंड्री लगी थी. लेकिन, आरसीबी का हाल तो इससे भी बुरा रहा. LSG vs RCB: चौका बचा भी नहीं पाए और चोट खा बैठे कप्तान, पत्नी भी डर गई, साथी खिलाड़ियों के सहारे बाहर गए रॉयल चैलेंजर्स बैंगलोर 16 से 20 ओवर के बीच रन बनाने में लगातार संघर्ष कर रही है. लखनऊ सुपर जायंट्स के खिलाफ मैच में भी आरसीबी ने 5 विकेट खोकर 34 रन ही बनाए. इससे पहले, राजस्थान रॉयल्स के खिलाफ मैच में भी आरसीबी ने आखिरी 5 ओवर में 5 विकेट गंवाकर 33 रन बनाए थे. ब्रेकिंग न्यूज़ हिंदी में सबसे पहले पढ़ें News18 हिंदी| आज की ताजा खबर, लाइव न्यूज अपडेट, पढ़ें सबसे विश्वसनीय हिंदी न्यूज़ वेबसाइट News18 हिंदी| Tags: Faf du Plessis , IPL 2023 , Lucknow Super Giants , Rcb , Virat Kohli IAS अतहर आमिर की डॉ. पत्नी ने इंस्टाग्राम पर शेयर की फोटो, आने लगे ऐसे-ऐसे कमेंट दुनियाभर में हर महीने करीब 2.5 लाख नौकरियां खा जाएगा AI, 5 साल में 1.40 करोड़ युवाओं को कर देगा बेरोजगार टेंट में रात गुजारने से लेकर वानखेड़े में गदर मचाने तक... यशस्वी जायसवाल कितनी संपत्ति के हैं मालिक? जानिए सबकुछ","pubDate":"2023-05-01 16:47:14","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/05/Virat-kohli-faf-16829594693x2.jpeg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"LSG vs RCB, 1st Innings Highlights: आरसीबी ने लखनऊ को दिया 127 रनों का लक्ष्य, फाफ ने खेली 44 रनों की पारी, नवीन ने लिए 3 विकेट","link":"https://www.abplive.com/sports/ipl/ipl-2023-rcb-give-target-of-127-runs-against-lsg-in-match-43-at-ekana-cricket-stadium-2397510","keywords":["आईपीएल"],"creator":["ABP Live"],"video_url":null,"description":"IPL 2023 LSG vs RCB: आईपीएल के 16वें सीजन का 43वां लीग मुकाबला लखनऊ के इकाना स्टेडियम में लखनऊ सुपर जायंट्स (LSG) और रॉयल चैलेंजर्स बैंगलोर (RCB) के बीच में खेला जा रहा है. इस मैच में आरसीबी की टीम ने टॉस जीतने के बाद पहले बल्लेबाजी का फैसला लेते हुए 20 ओवरों में 9 विकेट के नुकसान पर 126 रनों का स्कोर बनाया है. आरसीबी की तरफ से कप्तान फाफ डू प्लेसिस ने 44 रनों की अहम पारी खेली. नवीन उल हक ने गेंदबाजी में फिर से सभी को प्रभावित करते हुए 3 विकेट हासिल किए. विराट और फाफ ने टीम को दी अच्छी शुरुआत टॉस जीतने के बाद पहले बल्लेबाजी करने उतरी रॉयल चैलेंजर्स बैंगलोर की तरफ से ओपनिंग में कप्तान फाफ डू प्लेसिस के साथ विराट कोहली मैदान में उतरे. दोनों ने लखनऊ के स्टेडियम की धीमी पिच पर शुरुआती ओवरों में संभलकर बल्लेबाजी करते हुए 3 ओवरों में स्कोर को 20 रनों तक पहुंचा दिया. इसके बाद पहले 6 ओवरों का खेल जब खत्म हुआ तो आरसीबी का स्कोर बिना किसी नुकसान के 42 रनों तक पहुंच चुका था. रवि बिश्नोई ने दिलाई लखनऊ को पहली सफलता, आरसीबी ने गंवाया विराट का विकेट विराट कोहली और फाफ डू प्लेसिस ने आरसीबी की पारी को स्पिन के लिए मददगार इस पिच पर संभलकर आगे बढ़ाना जारी रखा. दोनों ने 8वें ओवर के खत्म होने तक टीम का स्कोर 56 रन बिना किसी नुकसान के पहुंचा दिया था. इसके बाद आरसीबी को 9वें ओवर की आखिरी गेंद पर विराट कोहली के रूप में पहला झटका लगा. कोहली को 31 के निजी स्कोर पर रवि बिश्नोई ने स्टंप आउट कराते हुए उन्हें पवेलियन भेजने का काम किया. आरसीबी ने गंवाए जल्दी-जल्दी 3 विकेट आरसीबी की पारी के 10 ओवरों का खेल खत्म होने पर टीम का स्कोर 1 विकेट के नुकसान पर 65 रन था. इसके बाद सभी को उम्मीद थी रन गति में तेजी देखने को मिलेगी लेकिन 75 के स्कोर पर आरसीबी को दूसरा झटका अनुज रावत के रूप में लगा जो 9 रन बनाकर कृष्णप्पा गौतम का शिकार बने. इसके बाद 80 के स्कोर पर टीम को तीसरा झटका ग्लेन मैक्सवेल के रूप में लगा जिनको 4 के निजी स्कोर पर रवि बिश्नोई ने अपना शिकार बनाया. वहीं 90 के स्कोर पर टीम को चौथा झटका सुयश प्रभुदेसाई के रूप में लगा. इसके बाद 15.2 ओवरों में जब आरसीबी का स्कोर 4 विकेट के नुकसान पर 93 रन था तो उस समय बारिश के खलल की वजह से मैच को लगभग 25 मिनट तक रोक दिया गया. अंतिम 4 ओवरों में लखनऊ के गेंदबाजों ने नहीं दिया आरसीबी बल्लेबाजों को खुलकर खेलने का मौका बारिश रुकने के बाद जब मैच फिर से शुरू हुआ तो सभी को उम्मीद थी कि आरसीबी की पारी में तेजी देखने को मिलेगी. लेकिन लखनऊ के गेंदबाजों ने ऐसा बिल्कुल भी नहीं होने दिया. आरसीबी को इस मैच में 5वां झटका 109 के स्कोर पर कप्तान डू प्लेसिस के रूप में लगा जो 44 रनों की पारी खेलने के बाद पवेलियन लौटे. इसके बाद 114 के स्कोर पर टीम ने महिपाल लोमरोर और उसके बाद 117 के स्कोर पर दिनेश कार्तिक के रूप में 7वां विकेट गंवा दिया. आरसीबी की टीम इस मैच में 20 ओवरों का खेल खत्म होने के बाद 9 विकेट के नुकसान पर 126 के स्कोर तक ही पहुंचने में कामयाब हो सकी. लखनऊ के लिए गेंदबाजी में नवीन उल हक ने 3,  रवि बिश्नोई और अमित मिश्रा ने 2-2 विकेट अपने नाम किए. इसके अलावा कृष्णप्पा गौतम ने भी 1 विकेट हासिल किया.   यह भी पढ़ें... Watch: 'नेहरा जी' के बेटे ने पिता की कॉपी की, मजेदार वीडियो देख अपनी हंसी नहीं रोक पाएंगे आप...","content":"IPL 2023 LSG vs RCB: आईपीएल के 16वें सीजन का 43वां लीग मुकाबला लखनऊ के इकाना स्टेडियम में लखनऊ सुपर जायंट्स (LSG) और रॉयल चैलेंजर्स बैंगलोर (RCB) के बीच में खेला जा रहा है. इस मैच में आरसीबी की टीम ने टॉस जीतने के बाद पहले बल्लेबाजी का फैसला लेते हुए 20 ओवरों में 9 विकेट के नुकसान पर 126 रनों का स्कोर बनाया है. आरसीबी की तरफ से कप्तान फाफ डू प्लेसिस ने 44 रनों की अहम पारी खेली. नवीन उल हक ने गेंदबाजी में फिर से सभी को प्रभावित करते हुए 3 विकेट हासिल किए. विराट और फाफ ने टीम को दी अच्छी शुरुआत टॉस जीतने के बाद पहले बल्लेबाजी करने उतरी रॉयल चैलेंजर्स बैंगलोर की तरफ से ओपनिंग में कप्तान फाफ डू प्लेसिस के साथ विराट कोहली मैदान में उतरे. दोनों ने लखनऊ के स्टेडियम की धीमी पिच पर शुरुआती ओवरों में संभलकर बल्लेबाजी करते हुए 3 ओवरों में स्कोर को 20 रनों तक पहुंचा दिया. इसके बाद पहले 6 ओवरों का खेल जब खत्म हुआ तो आरसीबी का स्कोर बिना किसी नुकसान के 42 रनों तक पहुंच चुका था. रवि बिश्नोई ने दिलाई लखनऊ को पहली सफलता, आरसीबी ने गंवाया विराट का विकेट googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); विराट कोहली और फाफ डू प्लेसिस ने आरसीबी की पारी को स्पिन के लिए मददगार इस पिच पर संभलकर आगे बढ़ाना जारी रखा. दोनों ने 8वें ओवर के खत्म होने तक टीम का स्कोर 56 रन बिना किसी नुकसान के पहुंचा दिया था. इसके बाद आरसीबी को 9वें ओवर की आखिरी गेंद पर विराट कोहली के रूप में पहला झटका लगा. कोहली को 31 के निजी स्कोर पर रवि बिश्नोई ने स्टंप आउट कराते हुए उन्हें पवेलियन भेजने का काम किया. आरसीबी ने गंवाए जल्दी-जल्दी 3 विकेट आरसीबी की पारी के 10 ओवरों का खेल खत्म होने पर टीम का स्कोर 1 विकेट के नुकसान पर 65 रन था. इसके बाद सभी को उम्मीद थी रन गति में तेजी देखने को मिलेगी लेकिन 75 के स्कोर पर आरसीबी को दूसरा झटका अनुज रावत के रूप में लगा जो 9 रन बनाकर कृष्णप्पा गौतम का शिकार बने. इसके बाद 80 के स्कोर पर टीम को तीसरा झटका ग्लेन मैक्सवेल के रूप में लगा जिनको 4 के निजी स्कोर पर रवि बिश्नोई ने अपना शिकार बनाया. वहीं 90 के स्कोर पर टीम को चौथा झटका सुयश प्रभुदेसाई के रूप में लगा. इसके बाद 15.2 ओवरों में जब आरसीबी का स्कोर 4 विकेट के नुकसान पर 93 रन था तो उस समय बारिश के खलल की वजह से मैच को लगभग 25 मिनट तक रोक दिया गया. अंतिम 4 ओवरों में लखनऊ के गेंदबाजों ने नहीं दिया आरसीबी बल्लेबाजों को खुलकर खेलने का मौका बारिश रुकने के बाद जब मैच फिर से शुरू हुआ तो सभी को उम्मीद थी कि आरसीबी की पारी में तेजी देखने को मिलेगी. लेकिन लखनऊ के गेंदबाजों ने ऐसा बिल्कुल भी नहीं होने दिया. आरसीबी को इस मैच में 5वां झटका 109 के स्कोर पर कप्तान डू प्लेसिस के रूप में लगा जो 44 रनों की पारी खेलने के बाद पवेलियन लौटे. इसके बाद 114 के स्कोर पर टीम ने महिपाल लोमरोर और उसके बाद 117 के स्कोर पर दिनेश कार्तिक के रूप में 7वां विकेट गंवा दिया. आरसीबी की टीम इस मैच में 20 ओवरों का खेल खत्म होने के बाद 9 विकेट के नुकसान पर 126 के स्कोर तक ही पहुंचने में कामयाब हो सकी. लखनऊ के लिए गेंदबाजी में नवीन उल हक ने 3, रवि बिश्नोई और अमित मिश्रा ने 2-2 विकेट अपने नाम किए. इसके अलावा कृष्णप्पा गौतम ने भी 1 विकेट हासिल किया. यह भी पढ़ें... Watch: 'नेहरा जी' के बेटे ने पिता की कॉपी की, मजेदार वीडियो देख अपनी हंसी नहीं रोक पाएंगे आप...","pubDate":"2023-05-01 16:13:55","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/05/01/3809570302e77e6a755151e4f53913831682957288652582_original.jpg","source_id":"abplive","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Amit Mishra IPL Wickets: 40 की उम्र में अमित मिश्रा का धमाल, मलिंगा का &#039;महारिकॉर्ड&#039; तोड़ा, खतरे में चहल का कीर्तिमान","link":"https://hindi.news18.com/news/sports/cricket-amit-mishra-breaks-lasith-malinga-170-wicket-records-becomes-3rd-highest-wicket-taker-in-ipl-6062013.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"Amit Mishra IPL Wickets: अमित मिश्रा ने आरसीबी के खिलाफ मुकाबले में 2 विकेट अपने नाम किए. इस दौरान उन्होंने मुंबई इंडियंस के पूर्व पेसर लसिथ मलिंगा रिकॉर्ड तोड़ दिया. मलिंगा के नाम आईपीएल 170 विकेट हैं. मिश्रा आईपीएल में सबसे अधिक विकेट लेने वाले गेंदबाजों में तीसरे नंबर पर पहुंच गए हैं.","content":"अमित मिश्रा ने सुयश प्रभुदेसाई को आउट कर मलिंगा के रिकॉर्ड को ध्वस्त किया. (AP) नई दिल्ली. अनुभवी लेग स्पिनर अमित मिश्रा (Amit Mishra) की फिरकी का जादू आईपीएल 2023 (IPL 2023) में सिर चढ़कर बोल रहा है. लखनऊ सुपर जायंट्स की ओर से खेल रहे मिश्रा ने रॉयल चैलेंजर्स बैंगलोर के खिलाफ मुकाबले में अपने नाम बड़ी उपब्धि दर्ज की. मिश्रा ने आरसीबी के बैटर सुयश प्रभुदेशाई को कृष्णप्पा गौतम के हाथों कैच कराकर मुंबई इंडियंस के पूर्व तेज गेंदबाज लसिथ मलिंगा (Lasith Malinga) के महारिकॉर्ड को तोड़ दिया. मिश्रा के निशाने पर अब युजवेंद्र चहल (Yuzvendra Chahal) का रिकॉर्ड है. चहल आईपीएल में राजस्थान रॉयल्स की ओर से खेल रहे हैं. लखनऊ के ईकाना स्टेडियम में आरसीबी की पारी के 15वें ओवर की तीसरी गेंद पर मिश्रा ने सुयश भुदेशाई को पवेलियन भेज दिया. 40 वर्षीय अमित मिश्रा की आईपीएल में यह 171वीं विकेट है. इसके साथ मिश्रा ने लसिथ मलिंगा, पीयूष चावला और आर अश्विन के रिकॉर्ड को तोड़ दिया जिन्होंने एक समान 170 विकेट अपने नाम किए हैं. आईपीएल में सर्वाधिक विकेट झटकने के मामले में अमित मिश्रा तीसरे नंबर पर पहुंच गए हैं. इस लिस्ट में पहले नंबर पर ड्वेन ब्रावो हैं जबकि दूसरे नंबर पर युजवेंद्र चहल विराजमान हैं. ब्रावो के नाम 183 आईपीएल विकेट दर्ज हैं जबकि चहल अभी तक 178 विकेट ले चुके हैं. यह भी पढ़ें: टेंट में रात गुजारने से लेकर वानखेड़े में गदर मचाने तक… यशस्वी जायसवाल कितनी संपत्ति के हैं मालिक? जानिए सबकुछ यशस्वी जायसवाल से लेकर शिखर धवन तक, टीम की हार में चमके 5 खिलाड़ी, मिला खास सम्मान स्पिनर की लिस्ट में दूसरे नंबर पर पहुंचे मिश्रा आईपीएल में बतौर स्पिनर सबसे ज्यादा विकेट लेने के मामले में मिश्रा दूसरे नंबर पर पहुंच गए हैं. उनसे पहले चहल हैं. अमित मिश्रा 2 साल बाद आईपीएल में खेल रहे हैं. इससे पहले वह साल 2021 में खेले थे. मिश्रा ने आरसीबी के खिलाफ 2 विकेट चटकाए. उन्होंने अपना दूसरा शिकार आरसीबी के कप्तान फाफ डुप्लेसी को बनाया. डुप्लेसी को मिश्रा ने 44 के निजी स्कोर पर क्रुणाल पंड्या के हाथों लपकवाया. केएल राहुल हुए चोटिल इस मुकाबले में आरसीबी के कप्तान फाफ डुप्लेसी ने टॉस जीतकर पहले बैटिंग का फैसला लिया. लखनऊ सुपर जायंट्स को उस समय तगड़ा झटका लगा जब कप्तान केएल राहुल को मैच की शुरुआत में ही चोटिल होकर ग्राउंड से बाहर जाना पड़ा. राहुल फील्डिंग के दौरान चोटिल हो गए जिसके बाद वह फिजियो के सहारे मैदान से बाहर गए. ब्रेकिंग न्यूज़ हिंदी में सबसे पहले पढ़ें News18 हिंदी| आज की ताजा खबर, लाइव न्यूज अपडेट, पढ़ें सबसे विश्वसनीय हिंदी न्यूज़ वेबसाइट News18 हिंदी| Tags: Amit mishra , Dwayne Bravo , IPL 2023 , Lasith malinga , Piyush Chawla IAS अतहर आमिर की डॉ. पत्नी ने इंस्टाग्राम पर शेयर की फोटो, आने लगे ऐसे-ऐसे कमेंट दुनियाभर में हर महीने करीब 2.5 लाख नौकरियां खा जाएगा AI, 5 साल में 1.40 करोड़ युवाओं को कर देगा बेरोजगार टेंट में रात गुजारने से लेकर वानखेड़े में गदर मचाने तक... यशस्वी जायसवाल कितनी संपत्ति के हैं मालिक? जानिए सबकुछ","pubDate":"2023-05-01 16:11:53","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/05/Amit-Mishra-breaks-lasith-malinga-record-16829571103x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Asia Cup 2023 रद्द होगा? ACC की तरफ से आया अपडेट, 2 बड़ी बातें सामने आईं","link":"https://hindi.news18.com/news/sports/cricket-asian-cricket-council-not-floated-any-proposal-to-postpone-asia-cup-2023-acc-denies-pakistan-media-reports-of-cancellation-of-tournament-6061745.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"Asia Cup 2023 को लेकर विवाद जारी है. हाल ही में पाकिस्तान क्रिकेट बोर्ड ने टूर्नामेंट के लिए 'हाईब्रिड मॉडल' पेश किया था, जिसमें कहा गया था कि पाकिस्तान अपने सारे मुकाबले देश में ही खेलेगा. वहीं, टीम इंडिया यूएई, दुबई, ओमान या फिर श्रीलंका में खेल सकती है. हालांकि, इस बीच पाकिस्तानी मीडिया रिपोर्ट में ये दावा किया गया था कि टूर्नामेंट में रद्द होगा. अब एसीसी की तरफ से बड़ा अपडेट आया है.","content":"Asia Cup 2023 रद्द होगा या नहीं? इस पर बड़ी जानकारी आई है.(ICC/Twitter) नई दिल्ली. एशियाई क्रिकेट परिषद (एसीसी) के सूत्रों ने एशिया कप के स्थगित होने और उसी समय दुबई में पाकिस्तान के बिना टूर्नामेंट के आयोजन से जुड़ी मीडिया की खबरों का खंडन करते हुए कहा कि उन्होंने सदस्य देशों को ऐसा कोई प्रस्ताव नहीं भेजा है. पाकिस्तान की मीडिया की एक खबर में दावा किया गया है कि अगर पाकिस्तान क्रिकेट बोर्ड (पीसीबी) न्यूट्रल वेन्यू पर एशिया कप खेलने के लिए राजी नहीं होता है तो देश से टूर्नामेंट की मेजबानी वापस ली जा सकती है. वनडे फॉर्मेट में होने वाले 2023 एशिया कप की मेजबानी का अधिकार पीसीबी के पास है. लेकिन भारतीय क्रिकेट बोर्ड (बीसीसीआई) के सचिव और एसीसी अध्यक्ष जय शाह ने स्पष्ट किया है कि भारतीय क्रिकेट टीम पाकिस्तान नहीं जाएगी. भारत चाहता है कि टूर्नामेंट दुबई में हो पीसीबी ने एशिया कप की मेजबानी के लिए ‘हाइब्रिड मॉडल’ का प्रस्ताव रखा है, जहां पाकिस्तान अपने मुकाबले घरेलू सरजमीं पर खेलेगा जबकि भारत तटस्थ स्थल पर खेलेगा जो पूरी संभावना है कि दुबई होगा. पता चला है कि बीसीसीआई चाहता है कि पूरा टूर्नामेंट 2018 और 2022 की तरह यूएई में खेला जाए. जहां दुबई, शारजाह और अबुधाबी में तीन मैदान हैं. एशिया कप 2018 का मेजबान भारत जबकि 2022 के टूर्नामेंट का मेजबान श्रीलंका था. एसीसी ने एशिया कप स्थगित करने का प्रस्ताव नहीं रखा दुबई में अंतरराष्ट्रीय क्रिकेट परिषद (आईसीसी) की बैठक के इतर हुई चर्चा की जानकारी रखने वाले एसीसी बोर्ड के एक सदस्य ने पीटीआई को नाम जाहिर नहीं करने की शर्त पर बताया, “संदेशों का आदान-प्रदान हुआ. लेकिन एशिया कप को स्थगित करने पर कोई चर्चा या प्रस्ताव पेश नहीं किया गया.” सूत्र ने कहा, “दूसरी बात, अगर एशिया कप रद्द होता है तो पहले पीसीबी को सूचित किया जाएगा. अब तक ऐसा कुछ नहीं हुआ है. एसीसी अध्यक्ष (शाह) ने अब तक कोई भी आधिकारिक फैसला नहीं किया है. टूर्नामेंट को स्थगित या रद्द करने के लिए एसीसी को कार्यकारी बोर्ड की बैठक बुलानी होगी. अध्यक्ष सात दिन में बैठक (वचुअल या ऑफलाइन) बुला सकता है. अब तक ऐसी किसी बैठक के बारे में सूचित नहीं किया गया है.” एसीसी सूत्र ने कहा कि जहां तक उन्हें जानकारी है पीसीबी, एसीसी और बीसीसीआई के बीच पिछले आधिकारिक ईमेल में भारतीय टीम को आमंत्रण भेजा गया था, जिसमें सर्वश्रेष्ठ सुरक्षा और मेहमानवाजी का आश्वासन दिया गया है. उन्होंने कहा कि लेकिन बेशक, मौजूदा संवेदनशील माहौल में भारत के लिए पाकिस्तान की यात्रा करना मुश्किल है. एक अन्य मुद्दा आधिकारिक प्रसारणकर्ता द्वारा प्रसारण करार को लेकर पैसों का भुगतान है, जिसमें भारत और पाकिस्तान के बीच कम से कम दो मुकाबले भी शामिल हैं. दोनों टीम अगर फाइनल में पहुंचती हैं जो तीसरा मुकाबला भी खेला जाएगा. LSG vs RCB: चौका बचा भी नहीं पाए और चोट खा बैठे कप्तान, पत्नी भी डर गई, साथी खिलाड़ियों के सहारे बाहर गए सूत्र ने कहा कि हमें मीडिया अधिकार और स्टार स्पोर्ट्स के साथ करार को भी याद रखना चाहिए, जिसने एशिया कप में भारत और पाकिस्तान के बीच कम से कम दो मैच के लिए लाखों (डॉलर) दिए हैं. सूत्र ने पुष्टि की कि टूर्नामेंट के तटस्थ स्थल पर आयोजन को लेकर जब एसीसी सदस्यों के बीच अनौपचारिक चर्चा हुई तो बीसीसीआई को श्रीलंका क्रिकेट (एसएलसी) का समर्थन मिला. कैंसिल होगा एशिया कप 2023! जिद्दी पाकिस्तान की अक्ल आएगी ठिकाने, BCCI ने बनाया तगड़ा प्लान सूत्र ने कहा, “एसीसी अध्यक्ष के कार्यकारी बोर्ड की बैठक बुलाने के बाद अगर एशिया कप रद्द होता है तो इसका असर सिर्फ पाकिस्तान के विश्व कप प्रतिनिधित्व पर ही नहीं बल्कि पीसीबी के भविष्य दौरा कैलेंडर और श्रीलंका, अफगानिस्तान या बांग्लादेश के साथ द्विपक्षीय रिश्तों पर भी पड़ेगा. स्थिति काफी नाजुक है.” ब्रेकिंग न्यूज़ हिंदी में सबसे पहले पढ़ें News18 हिंदी| आज की ताजा खबर, लाइव न्यूज अपडेट, पढ़ें सबसे विश्वसनीय हिंदी न्यूज़ वेबसाइट News18 हिंदी| Tags: Asia cup , BCCI , India Vs Pakistan , Pcb IAS अतहर आमिर की डॉ. पत्नी ने इंस्टाग्राम पर शेयर की फोटो, आने लगे ऐसे-ऐसे कमेंट दुनियाभर में हर महीने करीब 2.5 लाख नौकरियां खा जाएगा AI, 5 साल में 1.40 करोड़ युवाओं को कर देगा बेरोजगार टेंट में रात गुजारने से लेकर वानखेड़े में गदर मचाने तक... यशस्वी जायसवाल कितनी संपत्ति के हैं मालिक? जानिए सबकुछ","pubDate":"2023-05-01 15:39:36","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/03/Rohit-Sharma-Babar-Azam-ICC-16801038883x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"RCB के खिलाफ बदला लखनऊ टीम का कप्तान, क्रुणाल पंड्या को मिली बड़ी जिम्मेदारी, केएल राहुल बाहर","link":"https://hindi.news18.com/news/sports/cricket-krunal-pandya-takes-captaincy-of-lsg-as-kl-rahul-got-injured-in-ipl-2023-against-rcb-6061777.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"सोमवार 1 मई को लखनऊ सुपर जायंट्स की टीम अपने घर पर रॉयल चैलेंजर्स बैंगलोर के खिलाफ मुकाबला खेलने उतरी. मुकाबले के दौरान बीच में ही लखनऊ की टीम का कप्तान बदल गया. नियमित कप्तान केएल राहुल दूसरे ही ओवर में मैदान से बाहर चले गए और उनकी जगह पर क्रुणाल पंड्या को कप्तानी का जिम्मा दिया गया.","content":"रॉयल चैलेंजर्स बैंगलोर के कप्तान फाफ डु प्लेसिस के साथ लखनऊ सुपर जायंटस के कप्तान केएल राहुल-AP नई दिल्ली. इंडियन प्रीमियर लीग में हर दिन कुछ ना कुछ नया देखने को मिल रहा है. सोमवार 1 मई को लखनऊ सुपर जायंट्स की टीम अपने घर पर रॉयल चैलेंजर्स बैंगलोर के खिलाफ मुकाबला खेलने उतरी. मुकाबले के दौरान बीच में ही लखनऊ की टीम का कप्तान बदल गया. नियमित कप्तान केएल राहुल दूसरे ही ओवर में मैदान से बाहर चले गए और उनकी जगह पर क्रुणाल पंड्या को कप्तानी का जिम्मा दिया गया. लखनऊ सुपर जायंट्स की टीम सीजन में दूसरी बार रॉयल चैलेंजर्स बैंगलोर के खिलाफ खेलने उतरी. अपने घरेलू मैदान पर टीम टॉस हारने के बाद बैंगलोर के खिलाफ फील्डिंग करने उतरी और दूसरे ही ओवर में कप्तान के साथ घटना घट गई. फाफ डु प्लेसिस द्वारा लगाए गए शॉट को रोकने के लिए टीम के कप्तान केएल राहुल ने दौड़ लगाई और पीछे भागे. अचानक ही उनके पैर में किसी तरह से परेशानी महसूस हुई और केएल राहुल असहज नजर आए. इसके बाद वो मैदान से बाहर जाकर बाउंड्री के पार जाकर लेट गए. कंधे का सहारा देकर उनको साथी और कोचिंग स्टाफ मैदान के बाहर ले गए. क्रुणाल पंड्या को मिला कप्तानी केएल राहुल फील्डिंग करने के दौरान चोटिल हुए और उनको मैदान से बाहर जाना पड़ा. दूसरे ओवर के बाद लखनऊ सुपर जायंट्स की कमान क्रुणाल पंड्या ने थामी. मैच को उन्होंने बेहद शानदार तरीके से चलाया और एक के बाद एक गेंदबाजी में बदलाव करते हुए बैंगलोर की रन बनाने के रोका. बैंगलोर की टीम को 126 रन पर रोका क्रुणाल ने मैच में महज दो ओवर के बाद ही कप्तानी का जिम्मा संभाल लिया था. बैंगलोर के खिलाफ पूरी पारी में उन्होंने बतौर कप्तान योजना बनाई और गेंदबाजों का सही इस्तेमाल बैटर्स को रन बनाने से रोका. बैंगलोर की टीम 20 ओवर में 9 विकेट के नुकसान पर 126 रन तक ही पहुंच पाई. ब्रेकिंग न्यूज़ हिंदी में सबसे पहले पढ़ें News18 हिंदी| आज की ताजा खबर, लाइव न्यूज अपडेट, पढ़ें सबसे विश्वसनीय हिंदी न्यूज़ वेबसाइट News18 हिंदी| Tags: IPL 2023 , KL Rahul , Krunal pandya IAS अतहर आमिर की डॉ. पत्नी ने इंस्टाग्राम पर शेयर की फोटो, आने लगे ऐसे-ऐसे कमेंट दुनियाभर में हर महीने करीब 2.5 लाख नौकरियां खा जाएगा AI, 5 साल में 1.40 करोड़ युवाओं को कर देगा बेरोजगार टेंट में रात गुजारने से लेकर वानखेड़े में गदर मचाने तक... यशस्वी जायसवाल कितनी संपत्ति के हैं मालिक? जानिए सबकुछ","pubDate":"2023-05-01 15:33:21","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/05/KL-Rahul-captain-lsg-16829551293x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Mendis and Madushka receive plaudits from the captain","link":"https://www.ft.lk/sports/Mendis-and-Madushka-receive-plaudits-from-the-captain/23-747852","keywords":null,"creator":null,"video_url":null,"description":null,"content":"Following a tough two-Test series in New Zealand where Sri Lanka narrowly lost the first Test off the last ball of the match by two wickets and then the second Test by an innings, the recently concluded series against Test minnows at home was just the antidote they needed to inject some life into their cricket, especially the batting. There were no less than eight centuries scored in the two Tests played at Galle which included two double tons off the bats of Player of the Series Kusal Mendis and skipper Dimuth Karunaratne’s new opening partner Nishan Madushka. Mendis and Karunaratne were the recipients of back-to-back centuries having scored one in each of the two Tests. In the limited number of Tests Sri Lanka are scheduled to play for the entire year – six, this series was the best opportunity for the players to capitalise and make full use of the opportunities that came their way to enhance their career performances and like Karunaratne said “it was a good confidence booster”. Like we pointed out in an earlier article it seems that Kusal Mendis has arrived and a lot more runs can be expected off his bat in the near future. “Kusal has rendered yeoman service to Sri Lanka cricket. What was missing from him was big innings. He has shown it in the last two Test innings (scoring 140 and a career best 245),” said Karunaratne of his top batsman. “I hope he will make it a habit and continue to score regularly. It is not easy for a player who plays in all three formats to adjust to them immediately. He is now an experienced cricketer, and he is able to make the changes without much difficulty. I hope that he will be successful in the future.” Apart from Mendis the other batsman to impress was 23-year-old right-handed top order batsman Nishan Madushka. What a year it has been for this youngster from Moratuwa. He began the 2022-23 season by becoming the quickest to reach 1000 runs in a Sri Lankan first-class season, getting there in the least number of innings – nine. It included a century in each innings of a match for Ragama CC to start with and a further three hundreds that included a triple century. He followed this up with scores of 150*, 1 & 241, 22 & 100 against England Lions, performances that won him a place in the national side for the tour to New Zealand, where he broke into the Test ranks and made his Test debut in the second Test and wicket-keeper/batsman batting lower down the order at 8 and 7. Come the Ireland series and Madushka promoted to open the innings made maximum use of it to carve out a magnificent double century and establish himself as Karunaratne’s opening partner. They put on a record-breaking opening stand of 228 which was a ground record for Galle. While Karunaratne was dismissed for 15, Madushka went on to make a memorable 205. “I see Nishan Madushka as a very well-organised player. He knows what his game is, when to hit the ball, which ball to play and to what situations he must play. He has an uncomplicated and simple plan,” said Karunaratne. “I like it if he could keep it simple. He has made big scores before 300 and all that and he has the habit of doing that. It is only at international level he had not done so. From the start he went on to make big innings which I think will be good for his career. He knows how to compile a double century and from there learn how to make big scores. He is a player with a long career ahead of him.”","pubDate":"2023-05-01 20:16:53","image_url":null,"source_id":"ft_lk","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Watch: Virat Kohli and Gautam Gambhir in ugly verbal spat after LSG vs RCB","link":"https://www.firstpost.com/firstcricket/sports-news/watch-virat-kohli-and-gautam-gambhir-in-ugly-verbal-spat-after-lsg-vs-rcb-12534412.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"Watch: Virat Kohli and Gautam Gambhir in ugly verbal spat after LSG vs RCB","content":"Cricket Watch: Virat Kohli and Gautam Gambhir in ugly verbal spat after LSG vs RCB To put it into context, when RCB and LSG had clashed earlier in the season in Bengaluru, Gambhir could be seen gesturing towards the crowd with a 'shut up' sign, but it is still unclear if Virat was responding to that. FirstCricket Staff May 2nd, 2023 2:26:29 IST Virat Kohli and Gautam Gambhir were involved in a verbal spat after LSG vs RCB. Sportzpics Royal Challengers Bangalore’s Virat Kohli and Lucknow Super Giants mentor Gautam Gambhir were involved in a heated exchange after their IPL match in Lucknow on Monday. Kohli was quite animated throughout the match with LSG batters getting dismissed at regular intervals. IPL 2023: Full coverage | Points table | Schedule | Results | Orange Cap | Purple Cap​ To put it into context, when RCB and LSG had clashed earlier in the season in Bengaluru, Gambhir could be seen gesturing towards the crowd with a ‘shut up’ sign, but it is still unclear if Virat was responding to that. The calm before the storm – ft. Virat Kohli and Gautam Gambhir. pic.twitter.com/mxE6eTYzR7 Related Articles IPL 2023: KL Rahul leaves the field after sustaining an injury during LSG vs RCB match IPL 2023: 'The medical team will assess it,' Krunal Pandya provides update on LSG skipper KL Rahul's injury — Mufaddal Vohra (@mufaddal_vohra) May 1, 2023 For a while, things seemed perfectly fine between Kohli and Gambhir and had even shaken hands. Just soon after, LSG’s Kyle Mayers was seen walking upto Kohli and starting a conversation with the former skipper. Gambhir was quick to notice this and then took Mayers away. Watch this whole video It was gautam Gambhir who came in between mayers and Virat kohli and started crying pic.twitter.com/uaevYxuq5Y — M. (@IconicKohIi) May 1, 2023 Soon after the incident, more visuals showed Gambhir being animated and confronting Kohli, and at this point, KL Rahul and other support stuff were quick enough to intervene and separated the two. And following all this, KL Rahul was seen having a long chat with Kohli. In another video, Kohli and Naveen-ul-Haq were also seen involved in a war of words at the end of the contest, following an episode of sledging between the two when Naveen had walked out to bat during LSG’s chase. Lol he is showing aggression to the king of cricket #RCBVSLSG #ViratKohli #IPL2023 pic.twitter.com/DF0Empuwi5 — Haider Khan (@ind_iw0) May 1, 2023 RCB emerged victorious by 18 runs in a low-scoring contest. Naveen had picked three wickets to restrict RCB to 126/9, but none of the LSG batters managed a big score and they were bundled out for 108. Read all the Latest News , Trending News , Cricket News , Bollywood News , India News and Entertainment News here. Follow us on Facebook , Twitter and Instagram . Updated Date: May 02, 2023 02:26:29 IST Tags: Gautam Gambhir Ipl 2023 Ipl 2023 Lsg Ipl 2023 Rcb Find latest and upcoming tech gadgets online on Tech2 Gadgets. Get technology news, gadgets reviews & ratings. Popular gadgets including laptop, tablet and mobile specifications, features, prices, comparison.","pubDate":"2023-05-01 20:04:43","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/05/Kohli-and-Gambhir-640_Sportzpics.jpg","source_id":"firstpost","category":["sports"],"country":["india"],"language":"english"},{"title":"IPL 2023: 'The medical team will assess it,' Krunal Pandya provides update on LSG skipper KL Rahul's injury","link":"https://www.firstpost.com/firstcricket/sports-news/ipl-2023-the-medical-team-will-assess-it-krunal-pandya-provides-update-on-lsg-skipper-kl-rahuls-injury-12534372.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"IPL 2023: 'The medical team will assess it,' Krunal Pandya provides update on LSG skipper KL Rahul's injury","content":"Cricket IPL 2023: 'The medical team will assess it,' Krunal Pandya provides update on LSG skipper KL Rahul's injury LSG skipper KL Rahul got injured while fielding during their IPL game against RCB in Lucknow. FirstCricket Staff May 2nd, 2023 0:48:55 IST KL Rahul of Lucknow Super Giants with medical staff match 43 of the Tata Indian Premier League between the Lucknow Super Giants and the Royal Challengers Bangalore at the Bharat Ratna Shri Atal Bihari Vajpayee Ekana Cricket Stadium, Lucknow, on the 1st May 2023 Photo by: Arjun Singh / SPORTZPICS for IPL Lucknow Super Giants (LSG) succumbed to an 18-run defeat to Royal Challengers Bangalore (RCB) in the Indian Premier League (IPL) on Monday, and stand-in skipper Krunal Pandya said that KL Rahul had “pulled his hip-flexor” while adding that the medical team would assess his injury. IPL 2023: Full coverage | Points table | Schedule | Results | Orange Cap | Purple Cap​ KL Rahul seemed to have tweaked his right thigh muscle while fielding, in the final ball of the second over of RCB’s innings. Rahul was chasing the ball to stop the boundary after Faf du Plessis had punched through extra cover off Marcus Stoinis’ ball. Related Articles IPL 2023: KL Rahul leaves the field after sustaining an injury during LSG vs RCB match IPL 2023: RCB bowlers dominate powerplay as LSG restricted to 34/4 in first six overs The physio then had a look on Rahul, soon after which the captain was taken off the field in a stretcher. “It is a sad thing. He pulled his hip flexor, I guess. I do not know how bad it is. The medical team will assess it,” said Krunal Pandya after the match. Krunal lamented at LSG not being able to execute their batting plans. “We did pretty well, restricting them to 126 was a great bowling effort. Really happy with how we have bowled in this tournament. We would have taken 126 but batting-wise we did not execute our plans,” added Krunal. Faf du Plessis, RCB captain, was named Player of the Match for his contribution with the bat (44 runs). Du Plessis admitted that a total of 135 would have been a good total. “Would’ve liked 135 – in my mind that was a really good score. Before we went on the field, we said to the guys it’s a match-winning score. Felt if we get 2-3 in the powerplay, especially with KL not being there, it’s going to be difficult,” said the RCB skipper. Read all the Latest News , Trending News , Cricket News , Bollywood News , India News and Entertainment News here. Follow us on Facebook , Twitter and Instagram . Updated Date: May 02, 2023 00:48:55 IST Tags: Ipl 2023 Ipl 2023 Lsg Ipl 2023 Rcb Kl Rahul Find latest and upcoming tech gadgets online on Tech2 Gadgets. Get technology news, gadgets reviews & ratings. Popular gadgets including laptop, tablet and mobile specifications, features, prices, comparison.","pubDate":"2023-05-01 19:18:55","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/05/KL-Rahul-640_Sportzpics-2.jpg","source_id":"firstpost","category":["sports"],"country":["india"],"language":"english"},{"title":"रॉयल चैलेंजर्स बैंगलोर ने लखनऊ सुपर जाएंट्स को 18 रन से हराया","link":"https://www.khaskhabar.com/sports/cricket-news/sports-news-royal-challengers-bangalore-beat-lucknow-super-giants-by-18-runs-news-hindi-1-558112-KKN.html","keywords":null,"creator":null,"video_url":null,"description":"आईपीएल के 16वें सीजन का 43वां लीग मुकाबला लो स्कोरिंग जरूर रहा लेकिन मुकाबले में...","content":"आईपीएल के 16वें सीजन का 43वां लीग मुकाबला लो स्कोरिंग जरूर रहा लेकिन मुकाबले में रोमांच पूरी तरह से सभी फैंस को देखने को मिला। इस मैच में रॉयल चैलेंजर्स बैंगलोर ने लखनऊ सुपर जायंट्स से अपनी पिछली हार का हिसाब बराबर करते हुए 18 रनों से मैच को अपने नाम किया। 127 रनों के लक्ष्य का पीछा करने उतरी लखनऊ की टीम 19.5 ओवरों में 108 के स्कोर पर सिमट गई। आरसीबी के लिए गेंदबाजी में कर्ण शर्मा और हेजलवुड ने 2-2 अपने नाम किए। कप्तान केएल राहुल का फील्डिंग के समय चोटिल होने की वजह से लखनऊ की तरफ से लक्ष्य का पीछा करने काइल मेयर्स के साथ ओपनिंग में आयुष बडोनी को भेजा गया। आरसीबी ने लखनऊ को शून्य के स्कोर पर ही पहला झटका काइल मेयर्स के रूप में दिया जो बिना खाता खोले ही पवेलियन लौट गए। इसके बाद लखनऊ को 19 के स्कोर पर क्रुणाल पांड्या के रूप में दूसरा झटका लगा जो ग्लेन मैक्सवेल के खिलाफ बड़ा शॉट खेलने के प्रयास में 14 के निजी स्कोर पर कोहली को अपना कैच थमा बैठे। यहां से सभी को उम्मीद थी कि लखनऊ की टीम थोड़ा संभलकर बल्लेबाजी करेगी। लेकिन ऐसा देखने को नहीं मिला और टीम को अगला झटका 21 के स्कोर पर आयुष बडोनी और उसके बाद 27 के स्कोर पर दीपक हुड्डा के रूप में चौथा झटका लगा। लखनऊ की टीम पहले 6 ओवरों में 4 विकेट के नुकसान पर 34 रनों के स्कोर तक पहुंचने में कामयाब हो सकी। शुरुआती 4 विकेट जल्दी गंवाने के बाद लखनऊ की टीम के लिए इस मैच में वापसी करना काफी मुश्किल दिखाई देने लगा। टीम को 5वां झटका निकोलस पूरन के रूप में 38 के स्कोर पर लगा जो 9 रन बनाने के बाद पवेलियन लौट गए। इसके बाद मार्कस स्टोइनिस और कृष्णप्पा गौतम के बीच में छठे विकेट के लिए 22 गेंदों में 27 रनों की साझेदारी देखने को मिली। इस साझेदारी के दम पर लखनऊ की टीम ने मैच में थोड़ा वापसी की। लेकिन 65 के स्कोर पर मार्कस स्टोइनिस के पवेलियन लौटने के साथ आरसीबी ने मैच को पूरी तरह से अपनी तरफ मोड़ लिया। इसके बाद लखनऊ ने 66 के स्कोर पर कृष्णप्पा गौतम और उसके बाद 77 के स्कोर पर रवि बिश्नोई का विकेट भी गंवा दिया। लखनऊ की टीम इस मुकाबले में 108 रनों का स्कोर बनाकर सिमट गई और उसे 18 रनों से हार का सामना करना पड़ा। आरसीबी के लिए गेंदबाजी में कर्ण शर्मा और जोश हेजलवुड ने 2-2 जबकि हर्षल पटेल, मोहम्मद सिराज, वानिन्दु हसरंगा और ग्लेन मैक्सवेल ने 1-1 विकेट हासिल किया।","pubDate":"2023-05-01 18:29:37","image_url":null,"source_id":"khaskhabar","category":["sports"],"country":["india"],"language":"hindi"},{"title":"IPL 2023: Karn Sharma, Josh Hazlewood Star In RCB's 18-Run Win Over LSG","link":"https://sports.ndtv.com/cricket/lsg-vs-rcb-ipl-2023-karn-sharma-josh-hazlewood-star-in-royal-challengers-bangalores-18-run-win-over-lucknow-super-giants-3996399","keywords":null,"creator":null,"video_url":null,"description":"IPL 2023: Royal Challengers Bangalore defeated Lucknow Super Giants by 18 runs in their Indian Premier League match on Monday.","content":"Aided by KL Rahul's injury early in the match, Royal Challengers Bangalore did just enough to eke out an 18-run win over Lucknow Super Giants in a low-scoring Indian Premier League game at the Ekana Cricket Stadium on Monday. LSG skipper Rahul pulled his right thigh muscle in the second over of RCB innings while trying to stop a boundary and came out to bat only towards the end, which acted in favour of the visitors. LSG dished out a fine bowling display to restrict RCB to a below-par 126 after being asked to bowl first. RCB never had momentum in their innings despite the opening pair of skipper Faf du Plessis and Virat Kohli sharing a 62-run partnership. The spin duo of Ravi Bishnoi (2/21) and veteran Amit Mishra (2/21) shone bright with the ball in the middle overs to keep a check on RCB's scoring rate. Later, it turned out to be a nightmarish start for LSG while chasing a modest 127-run target, as they lost their first three wickets for just 21 runs in 4.1 overs. In Rahul's absence, Kyle Mayers and Ayush Badoni opened the innings but failed to live up to the expectations. While Mayers departed in the second delivery of the innings without troubling the scorers, stand-in captain Krunal Pandya played an 11-ball 14-run knock before being caught by Virat Kohli at long-off off Glenn Maxwell. Badoni followed suit in the next over while going for big shot, caught by Kohli off Josh Hazlewood (2/15). If that was not enough, Deepak Hooda was stumped by Dinesh Karthik off Wanindu Hasaranga de Silva, as LSG slumped to 27 for four in 5.1 overs. Leg-spinner Karn Sharma (2/20) then accounted for Nicholas Pooran (9) and Marcus Stoinis (13) in a span of four overs to make matters worse for LSG. Advertisement The asking rate was under control, but LSG kept losing wickets at regular intervals. Krishnappa Gowtham was the next to depart, run out after a 13-ball 23. Ravi Bishnoi then ran himself out as LSG collapsed to 77 for eight in 14.4 overs. Naveen-ul-Haq and Amit Mishra tried their best with a gutsy 26-run stand for the ninth wicket. An injured Rahul came out to bat last with LSG needing 24 off eight balls, but he looked in discomfort and failed to open his account. Earlier, Rahul failed to stop the boundary, looked in considerable pain, and limped off the field. In his absence, Pandya led the side. The duo of du Plessis and Kohli gave RCB another good start. Both the openers failed to get going but gave a platform for the rest of the batters to take RCB to a decent score. Kohli didn't look at his best as he managed just three boundaries during his 30-ball 31-run knock before being stumped by Pooran off the bowling of Bishnoi. New man in Anuj Rawat didn't last long as he gave a catch to Mayers in the deep off the bowling of Gowtham. Dangerman Glenn Maxwell followed suit, without troubling the scorers much, LBW to Bishnoi. After the initial partnership between du Plessis and Kohli, the LSG bowlers pulled back the game brilliantly. Suyash Prabhudesai didn't last long, caught by Gowtham at mid-off off the bowling of veteran Mishra, as RCB slumped to 90 for four in 14.3 overs. The match came to halt in the 16th over due to a steady drizzle. After a delay of nearly 26 minutes due to rain, the match restarted with no overs being reduced. While du Plessis batted deep he never got the desired momentum in his knock and struggled to find boundaries and sixes. He was eventually dismissed by Mishra in the 17th over, caught by Pandya as the South African tried to break the shackles. Thereafter, Dinesh Karthik (16 off 11) tried his best to up the ante but it wasn't enough. Towards the end, Afghan fast bowler Naveen-ul-Haq picked up two wickets in two deliveries in the 20th overs, to finish with figures of 3 for 30. (This story has not been edited by NDTV staff and is auto-generated from a syndicated feed.)","pubDate":"2023-05-01 18:28:56","image_url":null,"source_id":"ndtv","category":["sports"],"country":["india"],"language":"english"},{"title":"LSG vs RCB: टी20 में टेस्ट जैसी बैटिंग, एक-एक बाउंड्री के लिए तरसी RCB, शर्मनाक रिकॉर्ड बनाया","link":"https://hindi.news18.com/news/sports/cricket-virat-kohli-faf-du-plesis-royal-challengers-hit-only-8-boundaries-against-lsg-the-fewest-by-any-team-in-ipl-2023-6062185.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"LSG vs RCB: आईपीएल 2023 के 43 वें मैच में रॉयल चैलेंजर्स बैंगलोर ने पहले बैटिंग करते हुए 20 ओवर में महज 126 रन बनाए. आरसीबी की पूरी पारी में 6 चौके और 2 छक्के ही लगे. ये आईपीएल 2023 में किसी टीम की सबसे कम बाउंड्री है. विराट कोहली और फाफ डुप्लेसी ने ही 8 में से 5 बाउंड्री मारी.","content":"विराट कोहली और फाफ डुप्लेसी को छोड़ दें तो बैंगलोर का कोई बैटर LSG के खिलाफ टिक नहीं पाया. (IPL Instagram) नई दिल्ली. आईपीएल 2023 का 43वां मुकाबला रॉयल चैलेंजर्स बैंगलोर और लखनऊ सुपर जायंट्स के बीच खेला जा रहा. पहले बैटिंग करते हुए आरसीबी ने 20 ओवर में 9 विकेट पर 126 रन ही बना पाई. यानी टी20 में टेस्ट के अंदाज में बैटिंग हुई. मैच में टॉस आरसीबी के कप्तान फाफ डुप्लेसी ने ही जीता था और पहले बल्लेबाजी का फैसला किया था. विराट कोहली और कप्तान डुप्लेसी को छोड़ दें तो आरसीबी के बाकी बल्लेबाज लखनऊ की पिच की पहेली समझ ही नहीं पाए. इन दोनों ने पहले विकेट के लिए 62 रन जोड़े. विराट कोहली ने 30 गेंद में 31 और डुप्लेसी ने 40 गेंद में 44 रन की पारी खेली. इसके अलावा तीसरा सर्वश्रेष्ठ स्कोर दिनेश कार्तिक (16) ने बनाया. बाकी कोई भी बैटर दहाई के आंकड़े तक भी नहीं पहुंचा. इस मैच के दौरान आरसीबी के नाम एक शर्मनाक रिकॉर्ड दर्ज हुआ. पूरी पारी में बैंगलोर के बल्लेबाज सिर्फ 8 बाउंड्री लगा पाए. इसमें से पांच तो अकेले विराट-फाफ ने ठोके. कोहली ने सबसे अधिक 3 चौके मारे. फाफ के बल्ले से 1 चौका और 1 छक्का निकला. ये आईपीएल 2023 में किसी टीम सबसे कम बाउंड्री है. पूरी पारी में 6 चौके और 2 छक्के लगे हैं. इससे पहले, आईपीएल 2023 के किसी मैच में सबसे कम 13 बाउंड्री लगी थी. लेकिन, आरसीबी का हाल तो इससे भी बुरा रहा. LSG vs RCB: चौका बचा भी नहीं पाए और चोट खा बैठे कप्तान, पत्नी भी डर गई, साथी खिलाड़ियों के सहारे बाहर गए रॉयल चैलेंजर्स बैंगलोर 16 से 20 ओवर के बीच रन बनाने में लगातार संघर्ष कर रही है. लखनऊ सुपर जायंट्स के खिलाफ मैच में भी आरसीबी ने 5 विकेट खोकर 34 रन ही बनाए. इससे पहले, राजस्थान रॉयल्स के खिलाफ मैच में भी आरसीबी ने आखिरी 5 ओवर में 5 विकेट गंवाकर 33 रन बनाए थे. ब्रेकिंग न्यूज़ हिंदी में सबसे पहले पढ़ें News18 हिंदी| आज की ताजा खबर, लाइव न्यूज अपडेट, पढ़ें सबसे विश्वसनीय हिंदी न्यूज़ वेबसाइट News18 हिंदी| Tags: Faf du Plessis , IPL 2023 , Lucknow Super Giants , Rcb , Virat Kohli IAS अतहर आमिर की डॉ. पत्नी ने इंस्टाग्राम पर शेयर की फोटो, आने लगे ऐसे-ऐसे कमेंट दुनियाभर में हर महीने करीब 2.5 लाख नौकरियां खा जाएगा AI, 5 साल में 1.40 करोड़ युवाओं को कर देगा बेरोजगार टेंट में रात गुजारने से लेकर वानखेड़े में गदर मचाने तक... यशस्वी जायसवाल कितनी संपत्ति के हैं मालिक? जानिए सबकुछ","pubDate":"2023-05-01 16:47:14","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/05/Virat-kohli-faf-16829594693x2.jpeg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"LSG vs RCB, 1st Innings Highlights: आरसीबी ने लखनऊ को दिया 127 रनों का लक्ष्य, फाफ ने खेली 44 रनों की पारी, नवीन ने लिए 3 विकेट","link":"https://www.abplive.com/sports/ipl/ipl-2023-rcb-give-target-of-127-runs-against-lsg-in-match-43-at-ekana-cricket-stadium-2397510","keywords":["आईपीएल"],"creator":["ABP Live"],"video_url":null,"description":"IPL 2023 LSG vs RCB: आईपीएल के 16वें सीजन का 43वां लीग मुकाबला लखनऊ के इकाना स्टेडियम में लखनऊ सुपर जायंट्स (LSG) और रॉयल चैलेंजर्स बैंगलोर (RCB) के बीच में खेला जा रहा है. इस मैच में आरसीबी की टीम ने टॉस जीतने के बाद पहले बल्लेबाजी का फैसला लेते हुए 20 ओवरों में 9 विकेट के नुकसान पर 126 रनों का स्कोर बनाया है. आरसीबी की तरफ से कप्तान फाफ डू प्लेसिस ने 44 रनों की अहम पारी खेली. नवीन उल हक ने गेंदबाजी में फिर से सभी को प्रभावित करते हुए 3 विकेट हासिल किए. विराट और फाफ ने टीम को दी अच्छी शुरुआत टॉस जीतने के बाद पहले बल्लेबाजी करने उतरी रॉयल चैलेंजर्स बैंगलोर की तरफ से ओपनिंग में कप्तान फाफ डू प्लेसिस के साथ विराट कोहली मैदान में उतरे. दोनों ने लखनऊ के स्टेडियम की धीमी पिच पर शुरुआती ओवरों में संभलकर बल्लेबाजी करते हुए 3 ओवरों में स्कोर को 20 रनों तक पहुंचा दिया. इसके बाद पहले 6 ओवरों का खेल जब खत्म हुआ तो आरसीबी का स्कोर बिना किसी नुकसान के 42 रनों तक पहुंच चुका था. रवि बिश्नोई ने दिलाई लखनऊ को पहली सफलता, आरसीबी ने गंवाया विराट का विकेट विराट कोहली और फाफ डू प्लेसिस ने आरसीबी की पारी को स्पिन के लिए मददगार इस पिच पर संभलकर आगे बढ़ाना जारी रखा. दोनों ने 8वें ओवर के खत्म होने तक टीम का स्कोर 56 रन बिना किसी नुकसान के पहुंचा दिया था. इसके बाद आरसीबी को 9वें ओवर की आखिरी गेंद पर विराट कोहली के रूप में पहला झटका लगा. कोहली को 31 के निजी स्कोर पर रवि बिश्नोई ने स्टंप आउट कराते हुए उन्हें पवेलियन भेजने का काम किया. आरसीबी ने गंवाए जल्दी-जल्दी 3 विकेट आरसीबी की पारी के 10 ओवरों का खेल खत्म होने पर टीम का स्कोर 1 विकेट के नुकसान पर 65 रन था. इसके बाद सभी को उम्मीद थी रन गति में तेजी देखने को मिलेगी लेकिन 75 के स्कोर पर आरसीबी को दूसरा झटका अनुज रावत के रूप में लगा जो 9 रन बनाकर कृष्णप्पा गौतम का शिकार बने. इसके बाद 80 के स्कोर पर टीम को तीसरा झटका ग्लेन मैक्सवेल के रूप में लगा जिनको 4 के निजी स्कोर पर रवि बिश्नोई ने अपना शिकार बनाया. वहीं 90 के स्कोर पर टीम को चौथा झटका सुयश प्रभुदेसाई के रूप में लगा. इसके बाद 15.2 ओवरों में जब आरसीबी का स्कोर 4 विकेट के नुकसान पर 93 रन था तो उस समय बारिश के खलल की वजह से मैच को लगभग 25 मिनट तक रोक दिया गया. अंतिम 4 ओवरों में लखनऊ के गेंदबाजों ने नहीं दिया आरसीबी बल्लेबाजों को खुलकर खेलने का मौका बारिश रुकने के बाद जब मैच फिर से शुरू हुआ तो सभी को उम्मीद थी कि आरसीबी की पारी में तेजी देखने को मिलेगी. लेकिन लखनऊ के गेंदबाजों ने ऐसा बिल्कुल भी नहीं होने दिया. आरसीबी को इस मैच में 5वां झटका 109 के स्कोर पर कप्तान डू प्लेसिस के रूप में लगा जो 44 रनों की पारी खेलने के बाद पवेलियन लौटे. इसके बाद 114 के स्कोर पर टीम ने महिपाल लोमरोर और उसके बाद 117 के स्कोर पर दिनेश कार्तिक के रूप में 7वां विकेट गंवा दिया. आरसीबी की टीम इस मैच में 20 ओवरों का खेल खत्म होने के बाद 9 विकेट के नुकसान पर 126 के स्कोर तक ही पहुंचने में कामयाब हो सकी. लखनऊ के लिए गेंदबाजी में नवीन उल हक ने 3,  रवि बिश्नोई और अमित मिश्रा ने 2-2 विकेट अपने नाम किए. इसके अलावा कृष्णप्पा गौतम ने भी 1 विकेट हासिल किया.   यह भी पढ़ें... Watch: 'नेहरा जी' के बेटे ने पिता की कॉपी की, मजेदार वीडियो देख अपनी हंसी नहीं रोक पाएंगे आप...","content":"IPL 2023 LSG vs RCB: आईपीएल के 16वें सीजन का 43वां लीग मुकाबला लखनऊ के इकाना स्टेडियम में लखनऊ सुपर जायंट्स (LSG) और रॉयल चैलेंजर्स बैंगलोर (RCB) के बीच में खेला जा रहा है. इस मैच में आरसीबी की टीम ने टॉस जीतने के बाद पहले बल्लेबाजी का फैसला लेते हुए 20 ओवरों में 9 विकेट के नुकसान पर 126 रनों का स्कोर बनाया है. आरसीबी की तरफ से कप्तान फाफ डू प्लेसिस ने 44 रनों की अहम पारी खेली. नवीन उल हक ने गेंदबाजी में फिर से सभी को प्रभावित करते हुए 3 विकेट हासिल किए. विराट और फाफ ने टीम को दी अच्छी शुरुआत टॉस जीतने के बाद पहले बल्लेबाजी करने उतरी रॉयल चैलेंजर्स बैंगलोर की तरफ से ओपनिंग में कप्तान फाफ डू प्लेसिस के साथ विराट कोहली मैदान में उतरे. दोनों ने लखनऊ के स्टेडियम की धीमी पिच पर शुरुआती ओवरों में संभलकर बल्लेबाजी करते हुए 3 ओवरों में स्कोर को 20 रनों तक पहुंचा दिया. इसके बाद पहले 6 ओवरों का खेल जब खत्म हुआ तो आरसीबी का स्कोर बिना किसी नुकसान के 42 रनों तक पहुंच चुका था. रवि बिश्नोई ने दिलाई लखनऊ को पहली सफलता, आरसीबी ने गंवाया विराट का विकेट googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); विराट कोहली और फाफ डू प्लेसिस ने आरसीबी की पारी को स्पिन के लिए मददगार इस पिच पर संभलकर आगे बढ़ाना जारी रखा. दोनों ने 8वें ओवर के खत्म होने तक टीम का स्कोर 56 रन बिना किसी नुकसान के पहुंचा दिया था. इसके बाद आरसीबी को 9वें ओवर की आखिरी गेंद पर विराट कोहली के रूप में पहला झटका लगा. कोहली को 31 के निजी स्कोर पर रवि बिश्नोई ने स्टंप आउट कराते हुए उन्हें पवेलियन भेजने का काम किया. आरसीबी ने गंवाए जल्दी-जल्दी 3 विकेट आरसीबी की पारी के 10 ओवरों का खेल खत्म होने पर टीम का स्कोर 1 विकेट के नुकसान पर 65 रन था. इसके बाद सभी को उम्मीद थी रन गति में तेजी देखने को मिलेगी लेकिन 75 के स्कोर पर आरसीबी को दूसरा झटका अनुज रावत के रूप में लगा जो 9 रन बनाकर कृष्णप्पा गौतम का शिकार बने. इसके बाद 80 के स्कोर पर टीम को तीसरा झटका ग्लेन मैक्सवेल के रूप में लगा जिनको 4 के निजी स्कोर पर रवि बिश्नोई ने अपना शिकार बनाया. वहीं 90 के स्कोर पर टीम को चौथा झटका सुयश प्रभुदेसाई के रूप में लगा. इसके बाद 15.2 ओवरों में जब आरसीबी का स्कोर 4 विकेट के नुकसान पर 93 रन था तो उस समय बारिश के खलल की वजह से मैच को लगभग 25 मिनट तक रोक दिया गया. अंतिम 4 ओवरों में लखनऊ के गेंदबाजों ने नहीं दिया आरसीबी बल्लेबाजों को खुलकर खेलने का मौका बारिश रुकने के बाद जब मैच फिर से शुरू हुआ तो सभी को उम्मीद थी कि आरसीबी की पारी में तेजी देखने को मिलेगी. लेकिन लखनऊ के गेंदबाजों ने ऐसा बिल्कुल भी नहीं होने दिया. आरसीबी को इस मैच में 5वां झटका 109 के स्कोर पर कप्तान डू प्लेसिस के रूप में लगा जो 44 रनों की पारी खेलने के बाद पवेलियन लौटे. इसके बाद 114 के स्कोर पर टीम ने महिपाल लोमरोर और उसके बाद 117 के स्कोर पर दिनेश कार्तिक के रूप में 7वां विकेट गंवा दिया. आरसीबी की टीम इस मैच में 20 ओवरों का खेल खत्म होने के बाद 9 विकेट के नुकसान पर 126 के स्कोर तक ही पहुंचने में कामयाब हो सकी. लखनऊ के लिए गेंदबाजी में नवीन उल हक ने 3, रवि बिश्नोई और अमित मिश्रा ने 2-2 विकेट अपने नाम किए. इसके अलावा कृष्णप्पा गौतम ने भी 1 विकेट हासिल किया. यह भी पढ़ें... Watch: 'नेहरा जी' के बेटे ने पिता की कॉपी की, मजेदार वीडियो देख अपनी हंसी नहीं रोक पाएंगे आप...","pubDate":"2023-05-01 16:13:55","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/05/01/3809570302e77e6a755151e4f53913831682957288652582_original.jpg","source_id":"abplive","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Amit Mishra IPL Wickets: 40 की उम्र में अमित मिश्रा का धमाल, मलिंगा का &#039;महारिकॉर्ड&#039; तोड़ा, खतरे में चहल का कीर्तिमान","link":"https://hindi.news18.com/news/sports/cricket-amit-mishra-breaks-lasith-malinga-170-wicket-records-becomes-3rd-highest-wicket-taker-in-ipl-6062013.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"Amit Mishra IPL Wickets: अमित मिश्रा ने आरसीबी के खिलाफ मुकाबले में 2 विकेट अपने नाम किए. इस दौरान उन्होंने मुंबई इंडियंस के पूर्व पेसर लसिथ मलिंगा रिकॉर्ड तोड़ दिया. मलिंगा के नाम आईपीएल 170 विकेट हैं. मिश्रा आईपीएल में सबसे अधिक विकेट लेने वाले गेंदबाजों में तीसरे नंबर पर पहुंच गए हैं.","content":"अमित मिश्रा ने सुयश प्रभुदेसाई को आउट कर मलिंगा के रिकॉर्ड को ध्वस्त किया. (AP) नई दिल्ली. अनुभवी लेग स्पिनर अमित मिश्रा (Amit Mishra) की फिरकी का जादू आईपीएल 2023 (IPL 2023) में सिर चढ़कर बोल रहा है. लखनऊ सुपर जायंट्स की ओर से खेल रहे मिश्रा ने रॉयल चैलेंजर्स बैंगलोर के खिलाफ मुकाबले में अपने नाम बड़ी उपब्धि दर्ज की. मिश्रा ने आरसीबी के बैटर सुयश प्रभुदेशाई को कृष्णप्पा गौतम के हाथों कैच कराकर मुंबई इंडियंस के पूर्व तेज गेंदबाज लसिथ मलिंगा (Lasith Malinga) के महारिकॉर्ड को तोड़ दिया. मिश्रा के निशाने पर अब युजवेंद्र चहल (Yuzvendra Chahal) का रिकॉर्ड है. चहल आईपीएल में राजस्थान रॉयल्स की ओर से खेल रहे हैं. लखनऊ के ईकाना स्टेडियम में आरसीबी की पारी के 15वें ओवर की तीसरी गेंद पर मिश्रा ने सुयश भुदेशाई को पवेलियन भेज दिया. 40 वर्षीय अमित मिश्रा की आईपीएल में यह 171वीं विकेट है. इसके साथ मिश्रा ने लसिथ मलिंगा, पीयूष चावला और आर अश्विन के रिकॉर्ड को तोड़ दिया जिन्होंने एक समान 170 विकेट अपने नाम किए हैं. आईपीएल में सर्वाधिक विकेट झटकने के मामले में अमित मिश्रा तीसरे नंबर पर पहुंच गए हैं. इस लिस्ट में पहले नंबर पर ड्वेन ब्रावो हैं जबकि दूसरे नंबर पर युजवेंद्र चहल विराजमान हैं. ब्रावो के नाम 183 आईपीएल विकेट दर्ज हैं जबकि चहल अभी तक 178 विकेट ले चुके हैं. यह भी पढ़ें: टेंट में रात गुजारने से लेकर वानखेड़े में गदर मचाने तक… यशस्वी जायसवाल कितनी संपत्ति के हैं मालिक? जानिए सबकुछ यशस्वी जायसवाल से लेकर शिखर धवन तक, टीम की हार में चमके 5 खिलाड़ी, मिला खास सम्मान स्पिनर की लिस्ट में दूसरे नंबर पर पहुंचे मिश्रा आईपीएल में बतौर स्पिनर सबसे ज्यादा विकेट लेने के मामले में मिश्रा दूसरे नंबर पर पहुंच गए हैं. उनसे पहले चहल हैं. अमित मिश्रा 2 साल बाद आईपीएल में खेल रहे हैं. इससे पहले वह साल 2021 में खेले थे. मिश्रा ने आरसीबी के खिलाफ 2 विकेट चटकाए. उन्होंने अपना दूसरा शिकार आरसीबी के कप्तान फाफ डुप्लेसी को बनाया. डुप्लेसी को मिश्रा ने 44 के निजी स्कोर पर क्रुणाल पंड्या के हाथों लपकवाया. केएल राहुल हुए चोटिल इस मुकाबले में आरसीबी के कप्तान फाफ डुप्लेसी ने टॉस जीतकर पहले बैटिंग का फैसला लिया. लखनऊ सुपर जायंट्स को उस समय तगड़ा झटका लगा जब कप्तान केएल राहुल को मैच की शुरुआत में ही चोटिल होकर ग्राउंड से बाहर जाना पड़ा. राहुल फील्डिंग के दौरान चोटिल हो गए जिसके बाद वह फिजियो के सहारे मैदान से बाहर गए. ब्रेकिंग न्यूज़ हिंदी में सबसे पहले पढ़ें News18 हिंदी| आज की ताजा खबर, लाइव न्यूज अपडेट, पढ़ें सबसे विश्वसनीय हिंदी न्यूज़ वेबसाइट News18 हिंदी| Tags: Amit mishra , Dwayne Bravo , IPL 2023 , Lasith malinga , Piyush Chawla IAS अतहर आमिर की डॉ. पत्नी ने इंस्टाग्राम पर शेयर की फोटो, आने लगे ऐसे-ऐसे कमेंट दुनियाभर में हर महीने करीब 2.5 लाख नौकरियां खा जाएगा AI, 5 साल में 1.40 करोड़ युवाओं को कर देगा बेरोजगार टेंट में रात गुजारने से लेकर वानखेड़े में गदर मचाने तक... यशस्वी जायसवाल कितनी संपत्ति के हैं मालिक? जानिए सबकुछ","pubDate":"2023-05-01 16:11:53","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/05/Amit-Mishra-breaks-lasith-malinga-record-16829571103x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Asia Cup 2023 रद्द होगा? ACC की तरफ से आया अपडेट, 2 बड़ी बातें सामने आईं","link":"https://hindi.news18.com/news/sports/cricket-asian-cricket-council-not-floated-any-proposal-to-postpone-asia-cup-2023-acc-denies-pakistan-media-reports-of-cancellation-of-tournament-6061745.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"Asia Cup 2023 को लेकर विवाद जारी है. हाल ही में पाकिस्तान क्रिकेट बोर्ड ने टूर्नामेंट के लिए 'हाईब्रिड मॉडल' पेश किया था, जिसमें कहा गया था कि पाकिस्तान अपने सारे मुकाबले देश में ही खेलेगा. वहीं, टीम इंडिया यूएई, दुबई, ओमान या फिर श्रीलंका में खेल सकती है. हालांकि, इस बीच पाकिस्तानी मीडिया रिपोर्ट में ये दावा किया गया था कि टूर्नामेंट में रद्द होगा. अब एसीसी की तरफ से बड़ा अपडेट आया है.","content":"Asia Cup 2023 रद्द होगा या नहीं? इस पर बड़ी जानकारी आई है.(ICC/Twitter) नई दिल्ली. एशियाई क्रिकेट परिषद (एसीसी) के सूत्रों ने एशिया कप के स्थगित होने और उसी समय दुबई में पाकिस्तान के बिना टूर्नामेंट के आयोजन से जुड़ी मीडिया की खबरों का खंडन करते हुए कहा कि उन्होंने सदस्य देशों को ऐसा कोई प्रस्ताव नहीं भेजा है. पाकिस्तान की मीडिया की एक खबर में दावा किया गया है कि अगर पाकिस्तान क्रिकेट बोर्ड (पीसीबी) न्यूट्रल वेन्यू पर एशिया कप खेलने के लिए राजी नहीं होता है तो देश से टूर्नामेंट की मेजबानी वापस ली जा सकती है. वनडे फॉर्मेट में होने वाले 2023 एशिया कप की मेजबानी का अधिकार पीसीबी के पास है. लेकिन भारतीय क्रिकेट बोर्ड (बीसीसीआई) के सचिव और एसीसी अध्यक्ष जय शाह ने स्पष्ट किया है कि भारतीय क्रिकेट टीम पाकिस्तान नहीं जाएगी. भारत चाहता है कि टूर्नामेंट दुबई में हो पीसीबी ने एशिया कप की मेजबानी के लिए ‘हाइब्रिड मॉडल’ का प्रस्ताव रखा है, जहां पाकिस्तान अपने मुकाबले घरेलू सरजमीं पर खेलेगा जबकि भारत तटस्थ स्थल पर खेलेगा जो पूरी संभावना है कि दुबई होगा. पता चला है कि बीसीसीआई चाहता है कि पूरा टूर्नामेंट 2018 और 2022 की तरह यूएई में खेला जाए. जहां दुबई, शारजाह और अबुधाबी में तीन मैदान हैं. एशिया कप 2018 का मेजबान भारत जबकि 2022 के टूर्नामेंट का मेजबान श्रीलंका था. एसीसी ने एशिया कप स्थगित करने का प्रस्ताव नहीं रखा दुबई में अंतरराष्ट्रीय क्रिकेट परिषद (आईसीसी) की बैठक के इतर हुई चर्चा की जानकारी रखने वाले एसीसी बोर्ड के एक सदस्य ने पीटीआई को नाम जाहिर नहीं करने की शर्त पर बताया, “संदेशों का आदान-प्रदान हुआ. लेकिन एशिया कप को स्थगित करने पर कोई चर्चा या प्रस्ताव पेश नहीं किया गया.” सूत्र ने कहा, “दूसरी बात, अगर एशिया कप रद्द होता है तो पहले पीसीबी को सूचित किया जाएगा. अब तक ऐसा कुछ नहीं हुआ है. एसीसी अध्यक्ष (शाह) ने अब तक कोई भी आधिकारिक फैसला नहीं किया है. टूर्नामेंट को स्थगित या रद्द करने के लिए एसीसी को कार्यकारी बोर्ड की बैठक बुलानी होगी. अध्यक्ष सात दिन में बैठक (वचुअल या ऑफलाइन) बुला सकता है. अब तक ऐसी किसी बैठक के बारे में सूचित नहीं किया गया है.” एसीसी सूत्र ने कहा कि जहां तक उन्हें जानकारी है पीसीबी, एसीसी और बीसीसीआई के बीच पिछले आधिकारिक ईमेल में भारतीय टीम को आमंत्रण भेजा गया था, जिसमें सर्वश्रेष्ठ सुरक्षा और मेहमानवाजी का आश्वासन दिया गया है. उन्होंने कहा कि लेकिन बेशक, मौजूदा संवेदनशील माहौल में भारत के लिए पाकिस्तान की यात्रा करना मुश्किल है. एक अन्य मुद्दा आधिकारिक प्रसारणकर्ता द्वारा प्रसारण करार को लेकर पैसों का भुगतान है, जिसमें भारत और पाकिस्तान के बीच कम से कम दो मुकाबले भी शामिल हैं. दोनों टीम अगर फाइनल में पहुंचती हैं जो तीसरा मुकाबला भी खेला जाएगा. LSG vs RCB: चौका बचा भी नहीं पाए और चोट खा बैठे कप्तान, पत्नी भी डर गई, साथी खिलाड़ियों के सहारे बाहर गए सूत्र ने कहा कि हमें मीडिया अधिकार और स्टार स्पोर्ट्स के साथ करार को भी याद रखना चाहिए, जिसने एशिया कप में भारत और पाकिस्तान के बीच कम से कम दो मैच के लिए लाखों (डॉलर) दिए हैं. सूत्र ने पुष्टि की कि टूर्नामेंट के तटस्थ स्थल पर आयोजन को लेकर जब एसीसी सदस्यों के बीच अनौपचारिक चर्चा हुई तो बीसीसीआई को श्रीलंका क्रिकेट (एसएलसी) का समर्थन मिला. कैंसिल होगा एशिया कप 2023! जिद्दी पाकिस्तान की अक्ल आएगी ठिकाने, BCCI ने बनाया तगड़ा प्लान सूत्र ने कहा, “एसीसी अध्यक्ष के कार्यकारी बोर्ड की बैठक बुलाने के बाद अगर एशिया कप रद्द होता है तो इसका असर सिर्फ पाकिस्तान के विश्व कप प्रतिनिधित्व पर ही नहीं बल्कि पीसीबी के भविष्य दौरा कैलेंडर और श्रीलंका, अफगानिस्तान या बांग्लादेश के साथ द्विपक्षीय रिश्तों पर भी पड़ेगा. स्थिति काफी नाजुक है.” ब्रेकिंग न्यूज़ हिंदी में सबसे पहले पढ़ें News18 हिंदी| आज की ताजा खबर, लाइव न्यूज अपडेट, पढ़ें सबसे विश्वसनीय हिंदी न्यूज़ वेबसाइट News18 हिंदी| Tags: Asia cup , BCCI , India Vs Pakistan , Pcb IAS अतहर आमिर की डॉ. पत्नी ने इंस्टाग्राम पर शेयर की फोटो, आने लगे ऐसे-ऐसे कमेंट दुनियाभर में हर महीने करीब 2.5 लाख नौकरियां खा जाएगा AI, 5 साल में 1.40 करोड़ युवाओं को कर देगा बेरोजगार टेंट में रात गुजारने से लेकर वानखेड़े में गदर मचाने तक... यशस्वी जायसवाल कितनी संपत्ति के हैं मालिक? जानिए सबकुछ","pubDate":"2023-05-01 15:39:36","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/03/Rohit-Sharma-Babar-Azam-ICC-16801038883x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"RCB के खिलाफ बदला लखनऊ टीम का कप्तान, क्रुणाल पंड्या को मिली बड़ी जिम्मेदारी, केएल राहुल बाहर","link":"https://hindi.news18.com/news/sports/cricket-krunal-pandya-takes-captaincy-of-lsg-as-kl-rahul-got-injured-in-ipl-2023-against-rcb-6061777.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"सोमवार 1 मई को लखनऊ सुपर जायंट्स की टीम अपने घर पर रॉयल चैलेंजर्स बैंगलोर के खिलाफ मुकाबला खेलने उतरी. मुकाबले के दौरान बीच में ही लखनऊ की टीम का कप्तान बदल गया. नियमित कप्तान केएल राहुल दूसरे ही ओवर में मैदान से बाहर चले गए और उनकी जगह पर क्रुणाल पंड्या को कप्तानी का जिम्मा दिया गया.","content":"रॉयल चैलेंजर्स बैंगलोर के कप्तान फाफ डु प्लेसिस के साथ लखनऊ सुपर जायंटस के कप्तान केएल राहुल-AP नई दिल्ली. इंडियन प्रीमियर लीग में हर दिन कुछ ना कुछ नया देखने को मिल रहा है. सोमवार 1 मई को लखनऊ सुपर जायंट्स की टीम अपने घर पर रॉयल चैलेंजर्स बैंगलोर के खिलाफ मुकाबला खेलने उतरी. मुकाबले के दौरान बीच में ही लखनऊ की टीम का कप्तान बदल गया. नियमित कप्तान केएल राहुल दूसरे ही ओवर में मैदान से बाहर चले गए और उनकी जगह पर क्रुणाल पंड्या को कप्तानी का जिम्मा दिया गया. लखनऊ सुपर जायंट्स की टीम सीजन में दूसरी बार रॉयल चैलेंजर्स बैंगलोर के खिलाफ खेलने उतरी. अपने घरेलू मैदान पर टीम टॉस हारने के बाद बैंगलोर के खिलाफ फील्डिंग करने उतरी और दूसरे ही ओवर में कप्तान के साथ घटना घट गई. फाफ डु प्लेसिस द्वारा लगाए गए शॉट को रोकने के लिए टीम के कप्तान केएल राहुल ने दौड़ लगाई और पीछे भागे. अचानक ही उनके पैर में किसी तरह से परेशानी महसूस हुई और केएल राहुल असहज नजर आए. इसके बाद वो मैदान से बाहर जाकर बाउंड्री के पार जाकर लेट गए. कंधे का सहारा देकर उनको साथी और कोचिंग स्टाफ मैदान के बाहर ले गए. क्रुणाल पंड्या को मिला कप्तानी केएल राहुल फील्डिंग करने के दौरान चोटिल हुए और उनको मैदान से बाहर जाना पड़ा. दूसरे ओवर के बाद लखनऊ सुपर जायंट्स की कमान क्रुणाल पंड्या ने थामी. मैच को उन्होंने बेहद शानदार तरीके से चलाया और एक के बाद एक गेंदबाजी में बदलाव करते हुए बैंगलोर की रन बनाने के रोका. बैंगलोर की टीम को 126 रन पर रोका क्रुणाल ने मैच में महज दो ओवर के बाद ही कप्तानी का जिम्मा संभाल लिया था. बैंगलोर के खिलाफ पूरी पारी में उन्होंने बतौर कप्तान योजना बनाई और गेंदबाजों का सही इस्तेमाल बैटर्स को रन बनाने से रोका. बैंगलोर की टीम 20 ओवर में 9 विकेट के नुकसान पर 126 रन तक ही पहुंच पाई. ब्रेकिंग न्यूज़ हिंदी में सबसे पहले पढ़ें News18 हिंदी| आज की ताजा खबर, लाइव न्यूज अपडेट, पढ़ें सबसे विश्वसनीय हिंदी न्यूज़ वेबसाइट News18 हिंदी| Tags: IPL 2023 , KL Rahul , Krunal pandya IAS अतहर आमिर की डॉ. पत्नी ने इंस्टाग्राम पर शेयर की फोटो, आने लगे ऐसे-ऐसे कमेंट दुनियाभर में हर महीने करीब 2.5 लाख नौकरियां खा जाएगा AI, 5 साल में 1.40 करोड़ युवाओं को कर देगा बेरोजगार टेंट में रात गुजारने से लेकर वानखेड़े में गदर मचाने तक... यशस्वी जायसवाल कितनी संपत्ति के हैं मालिक? जानिए सबकुछ","pubDate":"2023-05-01 15:33:21","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/05/KL-Rahul-captain-lsg-16829551293x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Mendis and Madushka receive plaudits from the captain","link":"https://www.ft.lk/sports/Mendis-and-Madushka-receive-plaudits-from-the-captain/23-747852","keywords":null,"creator":null,"video_url":null,"description":null,"content":"Following a tough two-Test series in New Zealand where Sri Lanka narrowly lost the first Test off the last ball of the match by two wickets and then the second Test by an innings, the recently concluded series against Test minnows at home was just the antidote they needed to inject some life into their cricket, especially the batting. There were no less than eight centuries scored in the two Tests played at Galle which included two double tons off the bats of Player of the Series Kusal Mendis and skipper Dimuth Karunaratne’s new opening partner Nishan Madushka. Mendis and Karunaratne were the recipients of back-to-back centuries having scored one in each of the two Tests. In the limited number of Tests Sri Lanka are scheduled to play for the entire year – six, this series was the best opportunity for the players to capitalise and make full use of the opportunities that came their way to enhance their career performances and like Karunaratne said “it was a good confidence booster”. Like we pointed out in an earlier article it seems that Kusal Mendis has arrived and a lot more runs can be expected off his bat in the near future. “Kusal has rendered yeoman service to Sri Lanka cricket. What was missing from him was big innings. He has shown it in the last two Test innings (scoring 140 and a career best 245),” said Karunaratne of his top batsman. “I hope he will make it a habit and continue to score regularly. It is not easy for a player who plays in all three formats to adjust to them immediately. He is now an experienced cricketer, and he is able to make the changes without much difficulty. I hope that he will be successful in the future.” Apart from Mendis the other batsman to impress was 23-year-old right-handed top order batsman Nishan Madushka. What a year it has been for this youngster from Moratuwa. He began the 2022-23 season by becoming the quickest to reach 1000 runs in a Sri Lankan first-class season, getting there in the least number of innings – nine. It included a century in each innings of a match for Ragama CC to start with and a further three hundreds that included a triple century. He followed this up with scores of 150*, 1 & 241, 22 & 100 against England Lions, performances that won him a place in the national side for the tour to New Zealand, where he broke into the Test ranks and made his Test debut in the second Test and wicket-keeper/batsman batting lower down the order at 8 and 7. Come the Ireland series and Madushka promoted to open the innings made maximum use of it to carve out a magnificent double century and establish himself as Karunaratne’s opening partner. They put on a record-breaking opening stand of 228 which was a ground record for Galle. While Karunaratne was dismissed for 15, Madushka went on to make a memorable 205. “I see Nishan Madushka as a very well-organised player. He knows what his game is, when to hit the ball, which ball to play and to what situations he must play. He has an uncomplicated and simple plan,” said Karunaratne. “I like it if he could keep it simple. He has made big scores before 300 and all that and he has the habit of doing that. It is only at international level he had not done so. From the start he went on to make big innings which I think will be good for his career. He knows how to compile a double century and from there learn how to make big scores. He is a player with a long career ahead of him.”","pubDate":"2023-05-01 20:16:53","image_url":null,"source_id":"ft_lk","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Watch: Virat Kohli and Gautam Gambhir in ugly verbal spat after LSG vs RCB","link":"https://www.firstpost.com/firstcricket/sports-news/watch-virat-kohli-and-gautam-gambhir-in-ugly-verbal-spat-after-lsg-vs-rcb-12534412.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"Watch: Virat Kohli and Gautam Gambhir in ugly verbal spat after LSG vs RCB","content":"Cricket Watch: Virat Kohli and Gautam Gambhir in ugly verbal spat after LSG vs RCB To put it into context, when RCB and LSG had clashed earlier in the season in Bengaluru, Gambhir could be seen gesturing towards the crowd with a 'shut up' sign, but it is still unclear if Virat was responding to that. FirstCricket Staff May 2nd, 2023 2:26:29 IST Virat Kohli and Gautam Gambhir were involved in a verbal spat after LSG vs RCB. Sportzpics Royal Challengers Bangalore’s Virat Kohli and Lucknow Super Giants mentor Gautam Gambhir were involved in a heated exchange after their IPL match in Lucknow on Monday. Kohli was quite animated throughout the match with LSG batters getting dismissed at regular intervals. IPL 2023: Full coverage | Points table | Schedule | Results | Orange Cap | Purple Cap​ To put it into context, when RCB and LSG had clashed earlier in the season in Bengaluru, Gambhir could be seen gesturing towards the crowd with a ‘shut up’ sign, but it is still unclear if Virat was responding to that. The calm before the storm – ft. Virat Kohli and Gautam Gambhir. pic.twitter.com/mxE6eTYzR7 Related Articles IPL 2023: KL Rahul leaves the field after sustaining an injury during LSG vs RCB match IPL 2023: 'The medical team will assess it,' Krunal Pandya provides update on LSG skipper KL Rahul's injury — Mufaddal Vohra (@mufaddal_vohra) May 1, 2023 For a while, things seemed perfectly fine between Kohli and Gambhir and had even shaken hands. Just soon after, LSG’s Kyle Mayers was seen walking upto Kohli and starting a conversation with the former skipper. Gambhir was quick to notice this and then took Mayers away. Watch this whole video It was gautam Gambhir who came in between mayers and Virat kohli and started crying pic.twitter.com/uaevYxuq5Y — M. (@IconicKohIi) May 1, 2023 Soon after the incident, more visuals showed Gambhir being animated and confronting Kohli, and at this point, KL Rahul and other support stuff were quick enough to intervene and separated the two. And following all this, KL Rahul was seen having a long chat with Kohli. In another video, Kohli and Naveen-ul-Haq were also seen involved in a war of words at the end of the contest, following an episode of sledging between the two when Naveen had walked out to bat during LSG’s chase. Lol he is showing aggression to the king of cricket #RCBVSLSG #ViratKohli #IPL2023 pic.twitter.com/DF0Empuwi5 — Haider Khan (@ind_iw0) May 1, 2023 RCB emerged victorious by 18 runs in a low-scoring contest. Naveen had picked three wickets to restrict RCB to 126/9, but none of the LSG batters managed a big score and they were bundled out for 108. Read all the Latest News , Trending News , Cricket News , Bollywood News , India News and Entertainment News here. Follow us on Facebook , Twitter and Instagram . Updated Date: May 02, 2023 02:26:29 IST Tags: Gautam Gambhir Ipl 2023 Ipl 2023 Lsg Ipl 2023 Rcb Find latest and upcoming tech gadgets online on Tech2 Gadgets. Get technology news, gadgets reviews & ratings. Popular gadgets including laptop, tablet and mobile specifications, features, prices, comparison.","pubDate":"2023-05-01 20:04:43","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/05/Kohli-and-Gambhir-640_Sportzpics.jpg","source_id":"firstpost","category":["sports"],"country":["india"],"language":"english"},{"title":"IPL 2023: 'The medical team will assess it,' Krunal Pandya provides update on LSG skipper KL Rahul's injury","link":"https://www.firstpost.com/firstcricket/sports-news/ipl-2023-the-medical-team-will-assess-it-krunal-pandya-provides-update-on-lsg-skipper-kl-rahuls-injury-12534372.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"IPL 2023: 'The medical team will assess it,' Krunal Pandya provides update on LSG skipper KL Rahul's injury","content":"Cricket IPL 2023: 'The medical team will assess it,' Krunal Pandya provides update on LSG skipper KL Rahul's injury LSG skipper KL Rahul got injured while fielding during their IPL game against RCB in Lucknow. FirstCricket Staff May 2nd, 2023 0:48:55 IST KL Rahul of Lucknow Super Giants with medical staff match 43 of the Tata Indian Premier League between the Lucknow Super Giants and the Royal Challengers Bangalore at the Bharat Ratna Shri Atal Bihari Vajpayee Ekana Cricket Stadium, Lucknow, on the 1st May 2023 Photo by: Arjun Singh / SPORTZPICS for IPL Lucknow Super Giants (LSG) succumbed to an 18-run defeat to Royal Challengers Bangalore (RCB) in the Indian Premier League (IPL) on Monday, and stand-in skipper Krunal Pandya said that KL Rahul had “pulled his hip-flexor” while adding that the medical team would assess his injury. IPL 2023: Full coverage | Points table | Schedule | Results | Orange Cap | Purple Cap​ KL Rahul seemed to have tweaked his right thigh muscle while fielding, in the final ball of the second over of RCB’s innings. Rahul was chasing the ball to stop the boundary after Faf du Plessis had punched through extra cover off Marcus Stoinis’ ball. Related Articles IPL 2023: KL Rahul leaves the field after sustaining an injury during LSG vs RCB match IPL 2023: RCB bowlers dominate powerplay as LSG restricted to 34/4 in first six overs The physio then had a look on Rahul, soon after which the captain was taken off the field in a stretcher. “It is a sad thing. He pulled his hip flexor, I guess. I do not know how bad it is. The medical team will assess it,” said Krunal Pandya after the match. Krunal lamented at LSG not being able to execute their batting plans. “We did pretty well, restricting them to 126 was a great bowling effort. Really happy with how we have bowled in this tournament. We would have taken 126 but batting-wise we did not execute our plans,” added Krunal. Faf du Plessis, RCB captain, was named Player of the Match for his contribution with the bat (44 runs). Du Plessis admitted that a total of 135 would have been a good total. “Would’ve liked 135 – in my mind that was a really good score. Before we went on the field, we said to the guys it’s a match-winning score. Felt if we get 2-3 in the powerplay, especially with KL not being there, it’s going to be difficult,” said the RCB skipper. Read all the Latest News , Trending News , Cricket News , Bollywood News , India News and Entertainment News here. Follow us on Facebook , Twitter and Instagram . Updated Date: May 02, 2023 00:48:55 IST Tags: Ipl 2023 Ipl 2023 Lsg Ipl 2023 Rcb Kl Rahul Find latest and upcoming tech gadgets online on Tech2 Gadgets. Get technology news, gadgets reviews & ratings. Popular gadgets including laptop, tablet and mobile specifications, features, prices, comparison.","pubDate":"2023-05-01 19:18:55","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/05/KL-Rahul-640_Sportzpics-2.jpg","source_id":"firstpost","category":["sports"],"country":["india"],"language":"english"},{"title":"रॉयल चैलेंजर्स बैंगलोर ने लखनऊ सुपर जाएंट्स को 18 रन से हराया","link":"https://www.khaskhabar.com/sports/cricket-news/sports-news-royal-challengers-bangalore-beat-lucknow-super-giants-by-18-runs-news-hindi-1-558112-KKN.html","keywords":null,"creator":null,"video_url":null,"description":"आईपीएल के 16वें सीजन का 43वां लीग मुकाबला लो स्कोरिंग जरूर रहा लेकिन मुकाबले में...","content":"आईपीएल के 16वें सीजन का 43वां लीग मुकाबला लो स्कोरिंग जरूर रहा लेकिन मुकाबले में रोमांच पूरी तरह से सभी फैंस को देखने को मिला। इस मैच में रॉयल चैलेंजर्स बैंगलोर ने लखनऊ सुपर जायंट्स से अपनी पिछली हार का हिसाब बराबर करते हुए 18 रनों से मैच को अपने नाम किया। 127 रनों के लक्ष्य का पीछा करने उतरी लखनऊ की टीम 19.5 ओवरों में 108 के स्कोर पर सिमट गई। आरसीबी के लिए गेंदबाजी में कर्ण शर्मा और हेजलवुड ने 2-2 अपने नाम किए। कप्तान केएल राहुल का फील्डिंग के समय चोटिल होने की वजह से लखनऊ की तरफ से लक्ष्य का पीछा करने काइल मेयर्स के साथ ओपनिंग में आयुष बडोनी को भेजा गया। आरसीबी ने लखनऊ को शून्य के स्कोर पर ही पहला झटका काइल मेयर्स के रूप में दिया जो बिना खाता खोले ही पवेलियन लौट गए। इसके बाद लखनऊ को 19 के स्कोर पर क्रुणाल पांड्या के रूप में दूसरा झटका लगा जो ग्लेन मैक्सवेल के खिलाफ बड़ा शॉट खेलने के प्रयास में 14 के निजी स्कोर पर कोहली को अपना कैच थमा बैठे। यहां से सभी को उम्मीद थी कि लखनऊ की टीम थोड़ा संभलकर बल्लेबाजी करेगी। लेकिन ऐसा देखने को नहीं मिला और टीम को अगला झटका 21 के स्कोर पर आयुष बडोनी और उसके बाद 27 के स्कोर पर दीपक हुड्डा के रूप में चौथा झटका लगा। लखनऊ की टीम पहले 6 ओवरों में 4 विकेट के नुकसान पर 34 रनों के स्कोर तक पहुंचने में कामयाब हो सकी। शुरुआती 4 विकेट जल्दी गंवाने के बाद लखनऊ की टीम के लिए इस मैच में वापसी करना काफी मुश्किल दिखाई देने लगा। टीम को 5वां झटका निकोलस पूरन के रूप में 38 के स्कोर पर लगा जो 9 रन बनाने के बाद पवेलियन लौट गए। इसके बाद मार्कस स्टोइनिस और कृष्णप्पा गौतम के बीच में छठे विकेट के लिए 22 गेंदों में 27 रनों की साझेदारी देखने को मिली। इस साझेदारी के दम पर लखनऊ की टीम ने मैच में थोड़ा वापसी की। लेकिन 65 के स्कोर पर मार्कस स्टोइनिस के पवेलियन लौटने के साथ आरसीबी ने मैच को पूरी तरह से अपनी तरफ मोड़ लिया। इसके बाद लखनऊ ने 66 के स्कोर पर कृष्णप्पा गौतम और उसके बाद 77 के स्कोर पर रवि बिश्नोई का विकेट भी गंवा दिया। लखनऊ की टीम इस मुकाबले में 108 रनों का स्कोर बनाकर सिमट गई और उसे 18 रनों से हार का सामना करना पड़ा। आरसीबी के लिए गेंदबाजी में कर्ण शर्मा और जोश हेजलवुड ने 2-2 जबकि हर्षल पटेल, मोहम्मद सिराज, वानिन्दु हसरंगा और ग्लेन मैक्सवेल ने 1-1 विकेट हासिल किया।","pubDate":"2023-05-01 18:29:37","image_url":null,"source_id":"khaskhabar","category":["sports"],"country":["india"],"language":"hindi"},{"title":"IPL 2023: Karn Sharma, Josh Hazlewood Star In RCB's 18-Run Win Over LSG","link":"https://sports.ndtv.com/cricket/lsg-vs-rcb-ipl-2023-karn-sharma-josh-hazlewood-star-in-royal-challengers-bangalores-18-run-win-over-lucknow-super-giants-3996399","keywords":null,"creator":null,"video_url":null,"description":"IPL 2023: Royal Challengers Bangalore defeated Lucknow Super Giants by 18 runs in their Indian Premier League match on Monday.","content":"Aided by KL Rahul's injury early in the match, Royal Challengers Bangalore did just enough to eke out an 18-run win over Lucknow Super Giants in a low-scoring Indian Premier League game at the Ekana Cricket Stadium on Monday. LSG skipper Rahul pulled his right thigh muscle in the second over of RCB innings while trying to stop a boundary and came out to bat only towards the end, which acted in favour of the visitors. LSG dished out a fine bowling display to restrict RCB to a below-par 126 after being asked to bowl first. RCB never had momentum in their innings despite the opening pair of skipper Faf du Plessis and Virat Kohli sharing a 62-run partnership. The spin duo of Ravi Bishnoi (2/21) and veteran Amit Mishra (2/21) shone bright with the ball in the middle overs to keep a check on RCB's scoring rate. Later, it turned out to be a nightmarish start for LSG while chasing a modest 127-run target, as they lost their first three wickets for just 21 runs in 4.1 overs. In Rahul's absence, Kyle Mayers and Ayush Badoni opened the innings but failed to live up to the expectations. While Mayers departed in the second delivery of the innings without troubling the scorers, stand-in captain Krunal Pandya played an 11-ball 14-run knock before being caught by Virat Kohli at long-off off Glenn Maxwell. Badoni followed suit in the next over while going for big shot, caught by Kohli off Josh Hazlewood (2/15). If that was not enough, Deepak Hooda was stumped by Dinesh Karthik off Wanindu Hasaranga de Silva, as LSG slumped to 27 for four in 5.1 overs. Leg-spinner Karn Sharma (2/20) then accounted for Nicholas Pooran (9) and Marcus Stoinis (13) in a span of four overs to make matters worse for LSG. Advertisement The asking rate was under control, but LSG kept losing wickets at regular intervals. Krishnappa Gowtham was the next to depart, run out after a 13-ball 23. Ravi Bishnoi then ran himself out as LSG collapsed to 77 for eight in 14.4 overs. Naveen-ul-Haq and Amit Mishra tried their best with a gutsy 26-run stand for the ninth wicket. An injured Rahul came out to bat last with LSG needing 24 off eight balls, but he looked in discomfort and failed to open his account. Earlier, Rahul failed to stop the boundary, looked in considerable pain, and limped off the field. In his absence, Pandya led the side. The duo of du Plessis and Kohli gave RCB another good start. Both the openers failed to get going but gave a platform for the rest of the batters to take RCB to a decent score. Kohli didn't look at his best as he managed just three boundaries during his 30-ball 31-run knock before being stumped by Pooran off the bowling of Bishnoi. New man in Anuj Rawat didn't last long as he gave a catch to Mayers in the deep off the bowling of Gowtham. Dangerman Glenn Maxwell followed suit, without troubling the scorers much, LBW to Bishnoi. After the initial partnership between du Plessis and Kohli, the LSG bowlers pulled back the game brilliantly. Suyash Prabhudesai didn't last long, caught by Gowtham at mid-off off the bowling of veteran Mishra, as RCB slumped to 90 for four in 14.3 overs. The match came to halt in the 16th over due to a steady drizzle. After a delay of nearly 26 minutes due to rain, the match restarted with no overs being reduced. While du Plessis batted deep he never got the desired momentum in his knock and struggled to find boundaries and sixes. He was eventually dismissed by Mishra in the 17th over, caught by Pandya as the South African tried to break the shackles. Thereafter, Dinesh Karthik (16 off 11) tried his best to up the ante but it wasn't enough. Towards the end, Afghan fast bowler Naveen-ul-Haq picked up two wickets in two deliveries in the 20th overs, to finish with figures of 3 for 30. (This story has not been edited by NDTV staff and is auto-generated from a syndicated feed.)","pubDate":"2023-05-01 18:28:56","image_url":null,"source_id":"ndtv","category":["sports"],"country":["india"],"language":"english"},{"title":"LSG vs RCB: टी20 में टेस्ट जैसी बैटिंग, एक-एक बाउंड्री के लिए तरसी RCB, शर्मनाक रिकॉर्ड बनाया","link":"https://hindi.news18.com/news/sports/cricket-virat-kohli-faf-du-plesis-royal-challengers-hit-only-8-boundaries-against-lsg-the-fewest-by-any-team-in-ipl-2023-6062185.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"LSG vs RCB: आईपीएल 2023 के 43 वें मैच में रॉयल चैलेंजर्स बैंगलोर ने पहले बैटिंग करते हुए 20 ओवर में महज 126 रन बनाए. आरसीबी की पूरी पारी में 6 चौके और 2 छक्के ही लगे. ये आईपीएल 2023 में किसी टीम की सबसे कम बाउंड्री है. विराट कोहली और फाफ डुप्लेसी ने ही 8 में से 5 बाउंड्री मारी.","content":"विराट कोहली और फाफ डुप्लेसी को छोड़ दें तो बैंगलोर का कोई बैटर LSG के खिलाफ टिक नहीं पाया. (IPL Instagram) नई दिल्ली. आईपीएल 2023 का 43वां मुकाबला रॉयल चैलेंजर्स बैंगलोर और लखनऊ सुपर जायंट्स के बीच खेला जा रहा. पहले बैटिंग करते हुए आरसीबी ने 20 ओवर में 9 विकेट पर 126 रन ही बना पाई. यानी टी20 में टेस्ट के अंदाज में बैटिंग हुई. मैच में टॉस आरसीबी के कप्तान फाफ डुप्लेसी ने ही जीता था और पहले बल्लेबाजी का फैसला किया था. विराट कोहली और कप्तान डुप्लेसी को छोड़ दें तो आरसीबी के बाकी बल्लेबाज लखनऊ की पिच की पहेली समझ ही नहीं पाए. इन दोनों ने पहले विकेट के लिए 62 रन जोड़े. विराट कोहली ने 30 गेंद में 31 और डुप्लेसी ने 40 गेंद में 44 रन की पारी खेली. इसके अलावा तीसरा सर्वश्रेष्ठ स्कोर दिनेश कार्तिक (16) ने बनाया. बाकी कोई भी बैटर दहाई के आंकड़े तक भी नहीं पहुंचा. इस मैच के दौरान आरसीबी के नाम एक शर्मनाक रिकॉर्ड दर्ज हुआ. पूरी पारी में बैंगलोर के बल्लेबाज सिर्फ 8 बाउंड्री लगा पाए. इसमें से पांच तो अकेले विराट-फाफ ने ठोके. कोहली ने सबसे अधिक 3 चौके मारे. फाफ के बल्ले से 1 चौका और 1 छक्का निकला. ये आईपीएल 2023 में किसी टीम सबसे कम बाउंड्री है. पूरी पारी में 6 चौके और 2 छक्के लगे हैं. इससे पहले, आईपीएल 2023 के किसी मैच में सबसे कम 13 बाउंड्री लगी थी. लेकिन, आरसीबी का हाल तो इससे भी बुरा रहा. LSG vs RCB: चौका बचा भी नहीं पाए और चोट खा बैठे कप्तान, पत्नी भी डर गई, साथी खिलाड़ियों के सहारे बाहर गए रॉयल चैलेंजर्स बैंगलोर 16 से 20 ओवर के बीच रन बनाने में लगातार संघर्ष कर रही है. लखनऊ सुपर जायंट्स के खिलाफ मैच में भी आरसीबी ने 5 विकेट खोकर 34 रन ही बनाए. इससे पहले, राजस्थान रॉयल्स के खिलाफ मैच में भी आरसीबी ने आखिरी 5 ओवर में 5 विकेट गंवाकर 33 रन बनाए थे. ब्रेकिंग न्यूज़ हिंदी में सबसे पहले पढ़ें News18 हिंदी| आज की ताजा खबर, लाइव न्यूज अपडेट, पढ़ें सबसे विश्वसनीय हिंदी न्यूज़ वेबसाइट News18 हिंदी| Tags: Faf du Plessis , IPL 2023 , Lucknow Super Giants , Rcb , Virat Kohli IAS अतहर आमिर की डॉ. पत्नी ने इंस्टाग्राम पर शेयर की फोटो, आने लगे ऐसे-ऐसे कमेंट दुनियाभर में हर महीने करीब 2.5 लाख नौकरियां खा जाएगा AI, 5 साल में 1.40 करोड़ युवाओं को कर देगा बेरोजगार टेंट में रात गुजारने से लेकर वानखेड़े में गदर मचाने तक... यशस्वी जायसवाल कितनी संपत्ति के हैं मालिक? जानिए सबकुछ","pubDate":"2023-05-01 16:47:14","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/05/Virat-kohli-faf-16829594693x2.jpeg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"LSG vs RCB, 1st Innings Highlights: आरसीबी ने लखनऊ को दिया 127 रनों का लक्ष्य, फाफ ने खेली 44 रनों की पारी, नवीन ने लिए 3 विकेट","link":"https://www.abplive.com/sports/ipl/ipl-2023-rcb-give-target-of-127-runs-against-lsg-in-match-43-at-ekana-cricket-stadium-2397510","keywords":["आईपीएल"],"creator":["ABP Live"],"video_url":null,"description":"IPL 2023 LSG vs RCB: आईपीएल के 16वें सीजन का 43वां लीग मुकाबला लखनऊ के इकाना स्टेडियम में लखनऊ सुपर जायंट्स (LSG) और रॉयल चैलेंजर्स बैंगलोर (RCB) के बीच में खेला जा रहा है. इस मैच में आरसीबी की टीम ने टॉस जीतने के बाद पहले बल्लेबाजी का फैसला लेते हुए 20 ओवरों में 9 विकेट के नुकसान पर 126 रनों का स्कोर बनाया है. आरसीबी की तरफ से कप्तान फाफ डू प्लेसिस ने 44 रनों की अहम पारी खेली. नवीन उल हक ने गेंदबाजी में फिर से सभी को प्रभावित करते हुए 3 विकेट हासिल किए. विराट और फाफ ने टीम को दी अच्छी शुरुआत टॉस जीतने के बाद पहले बल्लेबाजी करने उतरी रॉयल चैलेंजर्स बैंगलोर की तरफ से ओपनिंग में कप्तान फाफ डू प्लेसिस के साथ विराट कोहली मैदान में उतरे. दोनों ने लखनऊ के स्टेडियम की धीमी पिच पर शुरुआती ओवरों में संभलकर बल्लेबाजी करते हुए 3 ओवरों में स्कोर को 20 रनों तक पहुंचा दिया. इसके बाद पहले 6 ओवरों का खेल जब खत्म हुआ तो आरसीबी का स्कोर बिना किसी नुकसान के 42 रनों तक पहुंच चुका था. रवि बिश्नोई ने दिलाई लखनऊ को पहली सफलता, आरसीबी ने गंवाया विराट का विकेट विराट कोहली और फाफ डू प्लेसिस ने आरसीबी की पारी को स्पिन के लिए मददगार इस पिच पर संभलकर आगे बढ़ाना जारी रखा. दोनों ने 8वें ओवर के खत्म होने तक टीम का स्कोर 56 रन बिना किसी नुकसान के पहुंचा दिया था. इसके बाद आरसीबी को 9वें ओवर की आखिरी गेंद पर विराट कोहली के रूप में पहला झटका लगा. कोहली को 31 के निजी स्कोर पर रवि बिश्नोई ने स्टंप आउट कराते हुए उन्हें पवेलियन भेजने का काम किया. आरसीबी ने गंवाए जल्दी-जल्दी 3 विकेट आरसीबी की पारी के 10 ओवरों का खेल खत्म होने पर टीम का स्कोर 1 विकेट के नुकसान पर 65 रन था. इसके बाद सभी को उम्मीद थी रन गति में तेजी देखने को मिलेगी लेकिन 75 के स्कोर पर आरसीबी को दूसरा झटका अनुज रावत के रूप में लगा जो 9 रन बनाकर कृष्णप्पा गौतम का शिकार बने. इसके बाद 80 के स्कोर पर टीम को तीसरा झटका ग्लेन मैक्सवेल के रूप में लगा जिनको 4 के निजी स्कोर पर रवि बिश्नोई ने अपना शिकार बनाया. वहीं 90 के स्कोर पर टीम को चौथा झटका सुयश प्रभुदेसाई के रूप में लगा. इसके बाद 15.2 ओवरों में जब आरसीबी का स्कोर 4 विकेट के नुकसान पर 93 रन था तो उस समय बारिश के खलल की वजह से मैच को लगभग 25 मिनट तक रोक दिया गया. अंतिम 4 ओवरों में लखनऊ के गेंदबाजों ने नहीं दिया आरसीबी बल्लेबाजों को खुलकर खेलने का मौका बारिश रुकने के बाद जब मैच फिर से शुरू हुआ तो सभी को उम्मीद थी कि आरसीबी की पारी में तेजी देखने को मिलेगी. लेकिन लखनऊ के गेंदबाजों ने ऐसा बिल्कुल भी नहीं होने दिया. आरसीबी को इस मैच में 5वां झटका 109 के स्कोर पर कप्तान डू प्लेसिस के रूप में लगा जो 44 रनों की पारी खेलने के बाद पवेलियन लौटे. इसके बाद 114 के स्कोर पर टीम ने महिपाल लोमरोर और उसके बाद 117 के स्कोर पर दिनेश कार्तिक के रूप में 7वां विकेट गंवा दिया. आरसीबी की टीम इस मैच में 20 ओवरों का खेल खत्म होने के बाद 9 विकेट के नुकसान पर 126 के स्कोर तक ही पहुंचने में कामयाब हो सकी. लखनऊ के लिए गेंदबाजी में नवीन उल हक ने 3,  रवि बिश्नोई और अमित मिश्रा ने 2-2 विकेट अपने नाम किए. इसके अलावा कृष्णप्पा गौतम ने भी 1 विकेट हासिल किया.   यह भी पढ़ें... Watch: 'नेहरा जी' के बेटे ने पिता की कॉपी की, मजेदार वीडियो देख अपनी हंसी नहीं रोक पाएंगे आप...","content":"IPL 2023 LSG vs RCB: आईपीएल के 16वें सीजन का 43वां लीग मुकाबला लखनऊ के इकाना स्टेडियम में लखनऊ सुपर जायंट्स (LSG) और रॉयल चैलेंजर्स बैंगलोर (RCB) के बीच में खेला जा रहा है. इस मैच में आरसीबी की टीम ने टॉस जीतने के बाद पहले बल्लेबाजी का फैसला लेते हुए 20 ओवरों में 9 विकेट के नुकसान पर 126 रनों का स्कोर बनाया है. आरसीबी की तरफ से कप्तान फाफ डू प्लेसिस ने 44 रनों की अहम पारी खेली. नवीन उल हक ने गेंदबाजी में फिर से सभी को प्रभावित करते हुए 3 विकेट हासिल किए. विराट और फाफ ने टीम को दी अच्छी शुरुआत टॉस जीतने के बाद पहले बल्लेबाजी करने उतरी रॉयल चैलेंजर्स बैंगलोर की तरफ से ओपनिंग में कप्तान फाफ डू प्लेसिस के साथ विराट कोहली मैदान में उतरे. दोनों ने लखनऊ के स्टेडियम की धीमी पिच पर शुरुआती ओवरों में संभलकर बल्लेबाजी करते हुए 3 ओवरों में स्कोर को 20 रनों तक पहुंचा दिया. इसके बाद पहले 6 ओवरों का खेल जब खत्म हुआ तो आरसीबी का स्कोर बिना किसी नुकसान के 42 रनों तक पहुंच चुका था. रवि बिश्नोई ने दिलाई लखनऊ को पहली सफलता, आरसीबी ने गंवाया विराट का विकेट googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); विराट कोहली और फाफ डू प्लेसिस ने आरसीबी की पारी को स्पिन के लिए मददगार इस पिच पर संभलकर आगे बढ़ाना जारी रखा. दोनों ने 8वें ओवर के खत्म होने तक टीम का स्कोर 56 रन बिना किसी नुकसान के पहुंचा दिया था. इसके बाद आरसीबी को 9वें ओवर की आखिरी गेंद पर विराट कोहली के रूप में पहला झटका लगा. कोहली को 31 के निजी स्कोर पर रवि बिश्नोई ने स्टंप आउट कराते हुए उन्हें पवेलियन भेजने का काम किया. आरसीबी ने गंवाए जल्दी-जल्दी 3 विकेट आरसीबी की पारी के 10 ओवरों का खेल खत्म होने पर टीम का स्कोर 1 विकेट के नुकसान पर 65 रन था. इसके बाद सभी को उम्मीद थी रन गति में तेजी देखने को मिलेगी लेकिन 75 के स्कोर पर आरसीबी को दूसरा झटका अनुज रावत के रूप में लगा जो 9 रन बनाकर कृष्णप्पा गौतम का शिकार बने. इसके बाद 80 के स्कोर पर टीम को तीसरा झटका ग्लेन मैक्सवेल के रूप में लगा जिनको 4 के निजी स्कोर पर रवि बिश्नोई ने अपना शिकार बनाया. वहीं 90 के स्कोर पर टीम को चौथा झटका सुयश प्रभुदेसाई के रूप में लगा. इसके बाद 15.2 ओवरों में जब आरसीबी का स्कोर 4 विकेट के नुकसान पर 93 रन था तो उस समय बारिश के खलल की वजह से मैच को लगभग 25 मिनट तक रोक दिया गया. अंतिम 4 ओवरों में लखनऊ के गेंदबाजों ने नहीं दिया आरसीबी बल्लेबाजों को खुलकर खेलने का मौका बारिश रुकने के बाद जब मैच फिर से शुरू हुआ तो सभी को उम्मीद थी कि आरसीबी की पारी में तेजी देखने को मिलेगी. लेकिन लखनऊ के गेंदबाजों ने ऐसा बिल्कुल भी नहीं होने दिया. आरसीबी को इस मैच में 5वां झटका 109 के स्कोर पर कप्तान डू प्लेसिस के रूप में लगा जो 44 रनों की पारी खेलने के बाद पवेलियन लौटे. इसके बाद 114 के स्कोर पर टीम ने महिपाल लोमरोर और उसके बाद 117 के स्कोर पर दिनेश कार्तिक के रूप में 7वां विकेट गंवा दिया. आरसीबी की टीम इस मैच में 20 ओवरों का खेल खत्म होने के बाद 9 विकेट के नुकसान पर 126 के स्कोर तक ही पहुंचने में कामयाब हो सकी. लखनऊ के लिए गेंदबाजी में नवीन उल हक ने 3, रवि बिश्नोई और अमित मिश्रा ने 2-2 विकेट अपने नाम किए. इसके अलावा कृष्णप्पा गौतम ने भी 1 विकेट हासिल किया. यह भी पढ़ें... Watch: 'नेहरा जी' के बेटे ने पिता की कॉपी की, मजेदार वीडियो देख अपनी हंसी नहीं रोक पाएंगे आप...","pubDate":"2023-05-01 16:13:55","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/05/01/3809570302e77e6a755151e4f53913831682957288652582_original.jpg","source_id":"abplive","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Amit Mishra IPL Wickets: 40 की उम्र में अमित मिश्रा का धमाल, मलिंगा का &#039;महारिकॉर्ड&#039; तोड़ा, खतरे में चहल का कीर्तिमान","link":"https://hindi.news18.com/news/sports/cricket-amit-mishra-breaks-lasith-malinga-170-wicket-records-becomes-3rd-highest-wicket-taker-in-ipl-6062013.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"Amit Mishra IPL Wickets: अमित मिश्रा ने आरसीबी के खिलाफ मुकाबले में 2 विकेट अपने नाम किए. इस दौरान उन्होंने मुंबई इंडियंस के पूर्व पेसर लसिथ मलिंगा रिकॉर्ड तोड़ दिया. मलिंगा के नाम आईपीएल 170 विकेट हैं. मिश्रा आईपीएल में सबसे अधिक विकेट लेने वाले गेंदबाजों में तीसरे नंबर पर पहुंच गए हैं.","content":"अमित मिश्रा ने सुयश प्रभुदेसाई को आउट कर मलिंगा के रिकॉर्ड को ध्वस्त किया. (AP) नई दिल्ली. अनुभवी लेग स्पिनर अमित मिश्रा (Amit Mishra) की फिरकी का जादू आईपीएल 2023 (IPL 2023) में सिर चढ़कर बोल रहा है. लखनऊ सुपर जायंट्स की ओर से खेल रहे मिश्रा ने रॉयल चैलेंजर्स बैंगलोर के खिलाफ मुकाबले में अपने नाम बड़ी उपब्धि दर्ज की. मिश्रा ने आरसीबी के बैटर सुयश प्रभुदेशाई को कृष्णप्पा गौतम के हाथों कैच कराकर मुंबई इंडियंस के पूर्व तेज गेंदबाज लसिथ मलिंगा (Lasith Malinga) के महारिकॉर्ड को तोड़ दिया. मिश्रा के निशाने पर अब युजवेंद्र चहल (Yuzvendra Chahal) का रिकॉर्ड है. चहल आईपीएल में राजस्थान रॉयल्स की ओर से खेल रहे हैं. लखनऊ के ईकाना स्टेडियम में आरसीबी की पारी के 15वें ओवर की तीसरी गेंद पर मिश्रा ने सुयश भुदेशाई को पवेलियन भेज दिया. 40 वर्षीय अमित मिश्रा की आईपीएल में यह 171वीं विकेट है. इसके साथ मिश्रा ने लसिथ मलिंगा, पीयूष चावला और आर अश्विन के रिकॉर्ड को तोड़ दिया जिन्होंने एक समान 170 विकेट अपने नाम किए हैं. आईपीएल में सर्वाधिक विकेट झटकने के मामले में अमित मिश्रा तीसरे नंबर पर पहुंच गए हैं. इस लिस्ट में पहले नंबर पर ड्वेन ब्रावो हैं जबकि दूसरे नंबर पर युजवेंद्र चहल विराजमान हैं. ब्रावो के नाम 183 आईपीएल विकेट दर्ज हैं जबकि चहल अभी तक 178 विकेट ले चुके हैं. यह भी पढ़ें: टेंट में रात गुजारने से लेकर वानखेड़े में गदर मचाने तक… यशस्वी जायसवाल कितनी संपत्ति के हैं मालिक? जानिए सबकुछ यशस्वी जायसवाल से लेकर शिखर धवन तक, टीम की हार में चमके 5 खिलाड़ी, मिला खास सम्मान स्पिनर की लिस्ट में दूसरे नंबर पर पहुंचे मिश्रा आईपीएल में बतौर स्पिनर सबसे ज्यादा विकेट लेने के मामले में मिश्रा दूसरे नंबर पर पहुंच गए हैं. उनसे पहले चहल हैं. अमित मिश्रा 2 साल बाद आईपीएल में खेल रहे हैं. इससे पहले वह साल 2021 में खेले थे. मिश्रा ने आरसीबी के खिलाफ 2 विकेट चटकाए. उन्होंने अपना दूसरा शिकार आरसीबी के कप्तान फाफ डुप्लेसी को बनाया. डुप्लेसी को मिश्रा ने 44 के निजी स्कोर पर क्रुणाल पंड्या के हाथों लपकवाया. केएल राहुल हुए चोटिल इस मुकाबले में आरसीबी के कप्तान फाफ डुप्लेसी ने टॉस जीतकर पहले बैटिंग का फैसला लिया. लखनऊ सुपर जायंट्स को उस समय तगड़ा झटका लगा जब कप्तान केएल राहुल को मैच की शुरुआत में ही चोटिल होकर ग्राउंड से बाहर जाना पड़ा. राहुल फील्डिंग के दौरान चोटिल हो गए जिसके बाद वह फिजियो के सहारे मैदान से बाहर गए. ब्रेकिंग न्यूज़ हिंदी में सबसे पहले पढ़ें News18 हिंदी| आज की ताजा खबर, लाइव न्यूज अपडेट, पढ़ें सबसे विश्वसनीय हिंदी न्यूज़ वेबसाइट News18 हिंदी| Tags: Amit mishra , Dwayne Bravo , IPL 2023 , Lasith malinga , Piyush Chawla IAS अतहर आमिर की डॉ. पत्नी ने इंस्टाग्राम पर शेयर की फोटो, आने लगे ऐसे-ऐसे कमेंट दुनियाभर में हर महीने करीब 2.5 लाख नौकरियां खा जाएगा AI, 5 साल में 1.40 करोड़ युवाओं को कर देगा बेरोजगार टेंट में रात गुजारने से लेकर वानखेड़े में गदर मचाने तक... यशस्वी जायसवाल कितनी संपत्ति के हैं मालिक? जानिए सबकुछ","pubDate":"2023-05-01 16:11:53","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/05/Amit-Mishra-breaks-lasith-malinga-record-16829571103x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Asia Cup 2023 रद्द होगा? ACC की तरफ से आया अपडेट, 2 बड़ी बातें सामने आईं","link":"https://hindi.news18.com/news/sports/cricket-asian-cricket-council-not-floated-any-proposal-to-postpone-asia-cup-2023-acc-denies-pakistan-media-reports-of-cancellation-of-tournament-6061745.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"Asia Cup 2023 को लेकर विवाद जारी है. हाल ही में पाकिस्तान क्रिकेट बोर्ड ने टूर्नामेंट के लिए 'हाईब्रिड मॉडल' पेश किया था, जिसमें कहा गया था कि पाकिस्तान अपने सारे मुकाबले देश में ही खेलेगा. वहीं, टीम इंडिया यूएई, दुबई, ओमान या फिर श्रीलंका में खेल सकती है. हालांकि, इस बीच पाकिस्तानी मीडिया रिपोर्ट में ये दावा किया गया था कि टूर्नामेंट में रद्द होगा. अब एसीसी की तरफ से बड़ा अपडेट आया है.","content":"Asia Cup 2023 रद्द होगा या नहीं? इस पर बड़ी जानकारी आई है.(ICC/Twitter) नई दिल्ली. एशियाई क्रिकेट परिषद (एसीसी) के सूत्रों ने एशिया कप के स्थगित होने और उसी समय दुबई में पाकिस्तान के बिना टूर्नामेंट के आयोजन से जुड़ी मीडिया की खबरों का खंडन करते हुए कहा कि उन्होंने सदस्य देशों को ऐसा कोई प्रस्ताव नहीं भेजा है. पाकिस्तान की मीडिया की एक खबर में दावा किया गया है कि अगर पाकिस्तान क्रिकेट बोर्ड (पीसीबी) न्यूट्रल वेन्यू पर एशिया कप खेलने के लिए राजी नहीं होता है तो देश से टूर्नामेंट की मेजबानी वापस ली जा सकती है. वनडे फॉर्मेट में होने वाले 2023 एशिया कप की मेजबानी का अधिकार पीसीबी के पास है. लेकिन भारतीय क्रिकेट बोर्ड (बीसीसीआई) के सचिव और एसीसी अध्यक्ष जय शाह ने स्पष्ट किया है कि भारतीय क्रिकेट टीम पाकिस्तान नहीं जाएगी. भारत चाहता है कि टूर्नामेंट दुबई में हो पीसीबी ने एशिया कप की मेजबानी के लिए ‘हाइब्रिड मॉडल’ का प्रस्ताव रखा है, जहां पाकिस्तान अपने मुकाबले घरेलू सरजमीं पर खेलेगा जबकि भारत तटस्थ स्थल पर खेलेगा जो पूरी संभावना है कि दुबई होगा. पता चला है कि बीसीसीआई चाहता है कि पूरा टूर्नामेंट 2018 और 2022 की तरह यूएई में खेला जाए. जहां दुबई, शारजाह और अबुधाबी में तीन मैदान हैं. एशिया कप 2018 का मेजबान भारत जबकि 2022 के टूर्नामेंट का मेजबान श्रीलंका था. एसीसी ने एशिया कप स्थगित करने का प्रस्ताव नहीं रखा दुबई में अंतरराष्ट्रीय क्रिकेट परिषद (आईसीसी) की बैठक के इतर हुई चर्चा की जानकारी रखने वाले एसीसी बोर्ड के एक सदस्य ने पीटीआई को नाम जाहिर नहीं करने की शर्त पर बताया, “संदेशों का आदान-प्रदान हुआ. लेकिन एशिया कप को स्थगित करने पर कोई चर्चा या प्रस्ताव पेश नहीं किया गया.” सूत्र ने कहा, “दूसरी बात, अगर एशिया कप रद्द होता है तो पहले पीसीबी को सूचित किया जाएगा. अब तक ऐसा कुछ नहीं हुआ है. एसीसी अध्यक्ष (शाह) ने अब तक कोई भी आधिकारिक फैसला नहीं किया है. टूर्नामेंट को स्थगित या रद्द करने के लिए एसीसी को कार्यकारी बोर्ड की बैठक बुलानी होगी. अध्यक्ष सात दिन में बैठक (वचुअल या ऑफलाइन) बुला सकता है. अब तक ऐसी किसी बैठक के बारे में सूचित नहीं किया गया है.” एसीसी सूत्र ने कहा कि जहां तक उन्हें जानकारी है पीसीबी, एसीसी और बीसीसीआई के बीच पिछले आधिकारिक ईमेल में भारतीय टीम को आमंत्रण भेजा गया था, जिसमें सर्वश्रेष्ठ सुरक्षा और मेहमानवाजी का आश्वासन दिया गया है. उन्होंने कहा कि लेकिन बेशक, मौजूदा संवेदनशील माहौल में भारत के लिए पाकिस्तान की यात्रा करना मुश्किल है. एक अन्य मुद्दा आधिकारिक प्रसारणकर्ता द्वारा प्रसारण करार को लेकर पैसों का भुगतान है, जिसमें भारत और पाकिस्तान के बीच कम से कम दो मुकाबले भी शामिल हैं. दोनों टीम अगर फाइनल में पहुंचती हैं जो तीसरा मुकाबला भी खेला जाएगा. LSG vs RCB: चौका बचा भी नहीं पाए और चोट खा बैठे कप्तान, पत्नी भी डर गई, साथी खिलाड़ियों के सहारे बाहर गए सूत्र ने कहा कि हमें मीडिया अधिकार और स्टार स्पोर्ट्स के साथ करार को भी याद रखना चाहिए, जिसने एशिया कप में भारत और पाकिस्तान के बीच कम से कम दो मैच के लिए लाखों (डॉलर) दिए हैं. सूत्र ने पुष्टि की कि टूर्नामेंट के तटस्थ स्थल पर आयोजन को लेकर जब एसीसी सदस्यों के बीच अनौपचारिक चर्चा हुई तो बीसीसीआई को श्रीलंका क्रिकेट (एसएलसी) का समर्थन मिला. कैंसिल होगा एशिया कप 2023! जिद्दी पाकिस्तान की अक्ल आएगी ठिकाने, BCCI ने बनाया तगड़ा प्लान सूत्र ने कहा, “एसीसी अध्यक्ष के कार्यकारी बोर्ड की बैठक बुलाने के बाद अगर एशिया कप रद्द होता है तो इसका असर सिर्फ पाकिस्तान के विश्व कप प्रतिनिधित्व पर ही नहीं बल्कि पीसीबी के भविष्य दौरा कैलेंडर और श्रीलंका, अफगानिस्तान या बांग्लादेश के साथ द्विपक्षीय रिश्तों पर भी पड़ेगा. स्थिति काफी नाजुक है.” ब्रेकिंग न्यूज़ हिंदी में सबसे पहले पढ़ें News18 हिंदी| आज की ताजा खबर, लाइव न्यूज अपडेट, पढ़ें सबसे विश्वसनीय हिंदी न्यूज़ वेबसाइट News18 हिंदी| Tags: Asia cup , BCCI , India Vs Pakistan , Pcb IAS अतहर आमिर की डॉ. पत्नी ने इंस्टाग्राम पर शेयर की फोटो, आने लगे ऐसे-ऐसे कमेंट दुनियाभर में हर महीने करीब 2.5 लाख नौकरियां खा जाएगा AI, 5 साल में 1.40 करोड़ युवाओं को कर देगा बेरोजगार टेंट में रात गुजारने से लेकर वानखेड़े में गदर मचाने तक... यशस्वी जायसवाल कितनी संपत्ति के हैं मालिक? जानिए सबकुछ","pubDate":"2023-05-01 15:39:36","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/03/Rohit-Sharma-Babar-Azam-ICC-16801038883x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"RCB के खिलाफ बदला लखनऊ टीम का कप्तान, क्रुणाल पंड्या को मिली बड़ी जिम्मेदारी, केएल राहुल बाहर","link":"https://hindi.news18.com/news/sports/cricket-krunal-pandya-takes-captaincy-of-lsg-as-kl-rahul-got-injured-in-ipl-2023-against-rcb-6061777.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"सोमवार 1 मई को लखनऊ सुपर जायंट्स की टीम अपने घर पर रॉयल चैलेंजर्स बैंगलोर के खिलाफ मुकाबला खेलने उतरी. मुकाबले के दौरान बीच में ही लखनऊ की टीम का कप्तान बदल गया. नियमित कप्तान केएल राहुल दूसरे ही ओवर में मैदान से बाहर चले गए और उनकी जगह पर क्रुणाल पंड्या को कप्तानी का जिम्मा दिया गया.","content":"रॉयल चैलेंजर्स बैंगलोर के कप्तान फाफ डु प्लेसिस के साथ लखनऊ सुपर जायंटस के कप्तान केएल राहुल-AP नई दिल्ली. इंडियन प्रीमियर लीग में हर दिन कुछ ना कुछ नया देखने को मिल रहा है. सोमवार 1 मई को लखनऊ सुपर जायंट्स की टीम अपने घर पर रॉयल चैलेंजर्स बैंगलोर के खिलाफ मुकाबला खेलने उतरी. मुकाबले के दौरान बीच में ही लखनऊ की टीम का कप्तान बदल गया. नियमित कप्तान केएल राहुल दूसरे ही ओवर में मैदान से बाहर चले गए और उनकी जगह पर क्रुणाल पंड्या को कप्तानी का जिम्मा दिया गया. लखनऊ सुपर जायंट्स की टीम सीजन में दूसरी बार रॉयल चैलेंजर्स बैंगलोर के खिलाफ खेलने उतरी. अपने घरेलू मैदान पर टीम टॉस हारने के बाद बैंगलोर के खिलाफ फील्डिंग करने उतरी और दूसरे ही ओवर में कप्तान के साथ घटना घट गई. फाफ डु प्लेसिस द्वारा लगाए गए शॉट को रोकने के लिए टीम के कप्तान केएल राहुल ने दौड़ लगाई और पीछे भागे. अचानक ही उनके पैर में किसी तरह से परेशानी महसूस हुई और केएल राहुल असहज नजर आए. इसके बाद वो मैदान से बाहर जाकर बाउंड्री के पार जाकर लेट गए. कंधे का सहारा देकर उनको साथी और कोचिंग स्टाफ मैदान के बाहर ले गए. क्रुणाल पंड्या को मिला कप्तानी केएल राहुल फील्डिंग करने के दौरान चोटिल हुए और उनको मैदान से बाहर जाना पड़ा. दूसरे ओवर के बाद लखनऊ सुपर जायंट्स की कमान क्रुणाल पंड्या ने थामी. मैच को उन्होंने बेहद शानदार तरीके से चलाया और एक के बाद एक गेंदबाजी में बदलाव करते हुए बैंगलोर की रन बनाने के रोका. बैंगलोर की टीम को 126 रन पर रोका क्रुणाल ने मैच में महज दो ओवर के बाद ही कप्तानी का जिम्मा संभाल लिया था. बैंगलोर के खिलाफ पूरी पारी में उन्होंने बतौर कप्तान योजना बनाई और गेंदबाजों का सही इस्तेमाल बैटर्स को रन बनाने से रोका. बैंगलोर की टीम 20 ओवर में 9 विकेट के नुकसान पर 126 रन तक ही पहुंच पाई. ब्रेकिंग न्यूज़ हिंदी में सबसे पहले पढ़ें News18 हिंदी| आज की ताजा खबर, लाइव न्यूज अपडेट, पढ़ें सबसे विश्वसनीय हिंदी न्यूज़ वेबसाइट News18 हिंदी| Tags: IPL 2023 , KL Rahul , Krunal pandya IAS अतहर आमिर की डॉ. पत्नी ने इंस्टाग्राम पर शेयर की फोटो, आने लगे ऐसे-ऐसे कमेंट दुनियाभर में हर महीने करीब 2.5 लाख नौकरियां खा जाएगा AI, 5 साल में 1.40 करोड़ युवाओं को कर देगा बेरोजगार टेंट में रात गुजारने से लेकर वानखेड़े में गदर मचाने तक... यशस्वी जायसवाल कितनी संपत्ति के हैं मालिक? जानिए सबकुछ","pubDate":"2023-05-01 15:33:21","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/05/KL-Rahul-captain-lsg-16829551293x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"}]}