{"newsArray":[{"title":"Scott Morrison ‘understands’ criticism of minister who attended Ashes Test over Covid-19 meeting","link":"https://thewest.com.au/business/scott-morrison-understands-criticism-of-minister-who-attended-ashes-test-over-covid-19-meeting-c-5474453","keywords":null,"creator":["Courtney Gould"],"video_url":null,"description":"An embattled minister has been supported by the Prime Minister despite criticism over his decision to ditch a Covid-19 meeting for the cricket.","content":null,"pubDate":"2022-01-27 23:59:55","full_description":"Scott Morrison has backed an embattled minister who ditched a crucial Covid-19 meeting to attend the cricket, but acknowledged his actions didn’t pass the pub test. Aged Care Minister Richard Colbeck came under fire this week after it was revealed he attended an Ashes Test in Hobart on the same day he declined to front a Senate Covid-19 inquiry. Senator Colbeck has claimed he attended the match as part of his commitment as Sports Minister. Speaking with Nine Radio on Friday, Mr Morrison said he would cop the criticism but was adamant his minister was doing a good job. “Well, he has appeared, as you know, at that hearing on many, many occasions,” the Prime Minister said. “I mean, ministers have many responsibilities. I can understand the criticism and ... I think Richard has taken that on board. “Over the course of this pandemic ... there’s been a few knockers of him, but I know what he does each and every day for the welfare of people living in our residential aged care facilities. “He will take that criticism on the chin and he’ll get back to work.” His comments come after key crossbencher Jacqui Lambie questioned if the Prime Minister had any control over his frontbench. “Oh, who knows (why this was allowed). Maybe because the Prime Minister hasn’t got many powers left, I don’t know,” Senator Lambie told Nine on Thursday. Mr Morrison wasn’t the only frontbencher to receive a grilling about the issue on Friday. Government leader in the Senate Simon Birmingham was put through his paces on ABC News Breakfast when host Michael Rowland zeroed in on the issue. “It wasn’t a good look, was it?” Mr Rowland asked. “Well, Michael, I think it’s possible for many people to be able to walk and chew gum at the same time,” Senator Birmingham responded. He added Senator Colbeck had devoted “huge amounts of time” to his aged care portfolio, even on the days he was at the Test match. “This was a day/night test. I know that he, as I said, has reassured me, as he said publicly, that he was engaged in all of the different aged care meetings and leadership that he should be.”","image_url":"https://images.thewest.com.au/publication/C-5474453/0d0025407d96091b718db6b39f7089403bf48309-16x9-x0y0w2048h1152.jpg","source_id":"thewest"},{"title":"Scott Morrison ‘understands’ criticism of minister who attended Ashes Test over Covid-19 meeting","link":"https://www.perthnow.com.au/business/scott-morrison-understands-criticism-of-minister-who-attended-ashes-test-over-covid-19-meeting-c-5474451","keywords":null,"creator":["Courtney Gould"],"video_url":null,"description":"An embattled minister has been supported by the Prime Minister despite criticism over his decision to ditch a Covid-19 meeting for the cricket.","content":null,"pubDate":"2022-01-27 23:59:53","full_description":null,"image_url":"https://images.perthnow.com.au/publication/C-5474451/0d0025407d96091b718db6b39f7089403bf48309-16x9-x0y0w2048h1152.jpg","source_id":"perthnow"},{"title":"Aussies roast media for stoking Special K rivalry","link":"https://wwos.nine.com.au/tennis/matt-ebden-max-purcell-play-down-rivalry-with-nick-kyrgios-thanasi-kokkinakis/8e6783a6-3d1b-400c-8400-4f6ad0223516","keywords":null,"creator":["wwos"],"video_url":null,"description":"Two Aussie men's teams play in the doubles final but the media's fascination with who the crowd will support has been a turn off.","content":"Two Australian men's teams face off in the doubles final for the first time since 1980 but the media's fascination with who the crowd will support on Saturday has been a turn off for both teams.The men's doubles final will be an all-Aussie affair with Nick Kyrgios and Thanasi Kokkinakis winning through their semi-final match to set up an epic clash on Saturday against Max Purcell and Matthew Ebden.READ MORE: Sydney Sixers exploit rulebook to qualify for BBL finalREAD MORE: Ash Barty's coach takes swipe at rivalsIt is the first all-Australian men's doubles final since Mark Edmondson and Kim Warwick defeated Peter McNamara and Paul McNamee 42 years ago.But the celebratory tone turned a tad sour during the post-match press conferences for both teams, as both sets of players seemed frustrated with the line of questioning after qualifying for the final match.At the end of Thursday afternoon's press conference, Purcell and Ebden took issue with this question from a reporter.\"I don't know if you're aware in the '90s when Australia played Australia A in the cricket,\" the journalist began.\"The public ended up supporting Australia A instead of Australia.\"Purcell asked with a grin: \"Who is Australia and who is Australia A?\"\"Given the sort of support for them over the last,\" the journalist replied before Purcell interrupted.\"So we're the underdogs?\" he asked.That's when Ebden chimed in to answer the question.\"Let's look at it,\" he started.\"They have higher singles rankings right now. We have higher doubles rankings. They had big crowd support. We did also yesterday. The pressure is on them for sure. They've had pressure on them their whole lives.\"Both players kept a lid on their frustrations before Purcell addressed the question and left the press conference with a smile while telling the journalists in attendance \"silliest questions of all time\"\"They're playing big-time singles out there. We're bringing a bit more doubles to the court. They're not looking to beat us at our game,\" he said.\"We're not looking to beat them at their game. It's not like there --there's no A and B, I feel like. They're better at their game. \"We're better at our game. I don't feel there's any underdog or over pair.\"The suggestion the crowd will take sides also ticked off Kyrgios, when the idea was put to him during his post-match press conference.\"These questions are so depressing,\" he said.\"We have four Aussies in the final. Can we stop dividing which crowd is going to go for who? It's just amazing we got four Aussies in the final. Ash doing her thing. Dylan's last Australian Open. Can we up the energy a little bit?\"It's f---ing awesome. Can we have some hype questions? Because I'd rather just walk out.\"While none of the players have played in a Grand Slam final, Purcell has some experience.The 23-year-old has previously been in this same situation, having made the Australian Open doubles final two years ago.Back then he was playing alongside fellow Australian Luke Saville, in just their second tournament together.Amazingly, the 2022 Australian Open is only Purcell and Ebden's second tournament together. The pair boast a 8-1 win-loss record as a team, with their only loss against Ram and Salisbury in last year's US Open quarterfinals, the team they beat to qualify for the final.Like Kyrgios and Kokkinakis, they have sent four seeded teams packing on their way to Saturday's final.Ebden said they have regularly spoken to Kokkinakis and Kyrgios throughout the tournament and congratulated them for their win.\"We already just spoke to them, congratulated them, they congratulated us.\" Ebden said.\"It's awesome to have two Aussie teams playing off in the final. What could be better really?\"I've been talking to Thanasi these last few matches trying to help him beat the guys he's been beating actually. He's been asking how his opponents play. We know obviously some of the doubles guys pretty well.\"Today I didn't really know their opponents that well, to be honest. Couldn't help him that much. Yeah, wanting them to win so we could all win, play off in the final.\"It will be 34-year-old Ebden's first ever Grand Slam final after contesting 30 slams. His previous best efforts were quarterfinal appearances at Roland Garros 2012, Australian Open 2021 and US Open 2021.For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here!","pubDate":"2022-01-27 20:30:31","full_description":"Two Australian men's teams face off in the doubles final for the first time since 1980 but the media's fascination with who the crowd will support on Saturday has been a turn off for both teams. The men's doubles final will be an all-Aussie affair with Nick Kyrgios and Thanasi Kokkinakis winning through their semi-final match to set up an epic clash on Saturday against Max Purcell and Matthew Ebden. READ MORE: Sydney Sixers exploit rulebook to qualify for BBL final READ MORE: Ash Barty's coach takes swipe at rivals It is the first all-Australian men's doubles final since Mark Edmondson and Kim Warwick defeated Peter McNamara and Paul McNamee 42 years ago. But the celebratory tone turned a tad sour during the post-match press conferences for both teams, as both sets of players seemed frustrated with the line of questioning after qualifying for the final match. At the end of Thursday afternoon's presser, Purcell and Ebden took issue with this question from a reporter. \"I don't know if you're aware in the '90s when Australia played Australia A in the cricket,\" the journalist began. \"The public ended up supporting Australia A instead of Australia.\" Purcell asked with a grin: \"Who is Australia and who is Australia A?\" \"Given the sort of support for them over the last,\" the journalist replied before Purcell interrupted. \"So we're the underdogs?\" he asked. That's when Ebden chimed in to answer the question. \"Let's look at it,\" he started. \"They have higher singles rankings right now. We have higher doubles rankings. They had big crowd support. We did also yesterday. The pressure is on them for sure. They've had pressure on them their whole lives.\" Both players kept a lid on their frustrations before Purcell addressed the question and left the press conference with a smile while telling the journalists in attendance \"silliest questions of all time\" \"They're playing big-time singles out there. We're bringing a bit more doubles to the court. They're not looking to beat us at our game,\" he said. \"We're not looking to beat them at their game. It's not like there --there's no A and B, I feel like. They're better at their game. \"We're better at our game. I don't feel there's any underdog or over pair.\" The suggestion the crowd will take sides also ticked off Kyrgios, when the idea was put to him during his post-match press conference. \"These questions are so depressing,\" he said. \"We have four Aussies in the final. Can we stop dividing which crowd is going to go for who? It's just amazing we got four Aussies in the final. Ash doing her thing. Dylan's last Australian Open. Can we up the energy a little bit? \"It's f---ing awesome. Can we have some hype questions? Because I'd rather just walk out.\" While none of the players have played in a Grand Slam final, Purcell has some experience. The 23-year-old has previously been in this same situation, having made the Australian Open doubles final two years ago. Back then he was playing alongside fellow Australian Luke Saville, in just their second tournament together. Amazingly, the 2022 Australian Open is only Purcell and Ebden's second tournament together. The pair boast a 8-1 win-loss record as a team, with their only loss against Ram and Salisbury in last year's US Open quarterfinals, the team they beat to qualify for the final. Like Kyrgios and Kokkinakis, they have sent four seeded teams packing on their way to Saturday's final. Ebden said they have regularly spoken to Kokkinakis and Kyrgios throughout the tournament and congratulated them for their win. \"We already just spoke to them, congratulated them, they congratulated us.\" Ebden said. \"It's awesome to have two Aussie teams playing off in the final. What could be better really? \"I've been talking to Thanasi these last few matches trying to help him beat the guys he's been beating actually. He's been asking how his opponents play. We know obviously some of the doubles guys pretty well. \"Today I didn't really know their opponents that well, to be honest. Couldn't help him that much. Yeah, wanting them to win so we could all win, play off in the final.\" It will be 34-year-old Ebden's first ever Grand Slam final after contesting 30 slams. His previous best efforts were quarterfinal appearances at Roland Garros 2012, Australian Open 2021 and US Open 2021. For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here!","image_url":"https://vms-network-images-prod.s3-ap-southeast-2.amazonaws.com/2022/01/407882/pickerimage.jpg","source_id":"nine"},{"title":"Legends League Cricket: Ojha, Irfan knocks in vain as Giants deny Maharajas final berth","link":"https://sportstar.thehindu.com/cricket/world-giants-beat-india-maharajas-legends-league-cricket-2022-final-gibbs-irfan-yusuf-pathan-ojha/article38336117.ece","keywords":null,"creator":["Team Sportstar"],"video_url":null,"description":"The Maharajas end their campaign with three defeats to their tally while the Giants have won all but one of their four league encounters.","content":null,"pubDate":"2022-01-27 19:14:03","full_description":null,"image_url":null,"source_id":"sportstar"},{"title":"Morgan to miss rest of England's T20 series against West Indies","link":"https://www.skysports.com/cricket/news/12040/12526799/eoin-morgan-england-captain-to-miss-remainder-of-twenty20-series-against-west-indies-with-injury","keywords":null,"creator":null,"video_url":null,"description":"England captain Eoin Morgan will miss the final two matches of the Twenty20 series against the West Indies with a \"low-grade quadriceps injury\", the England and Wales Cricket Board has announced.","content":null,"pubDate":"2022-01-27 17:25:00","full_description":"Last Updated: 27/01/22 5:31pm England captain Eoin Morgan will miss the final two matches of the Twenty20 series against the West Indies with a \"low-grade quadriceps injury\", the England and Wales Cricket Board has announced. More to follow.... This is a breaking news story that is being updated and more details will be published shortly. Please refresh this page for the latest updates. Sky Sports brings you live updates as they happen. Get breaking sports news, analysis, exclusive interviews, replays and highlights. Sky Sports is your trusted source for breaking sports news headlines and live updates. Watch live coverage of your favourite sports: Football, F1, Boxing, Cricket, Golf, Tennis, Rugby League, Rugby Union, NFL, Darts, Netball and get the latest transfers news, results, scores and more. Visit skysports.com or the Sky Sports App for all the breaking sports news headlines . You can receive push notifications from the Sky Sports app for the latest news from your favourite sports and you can also follow @SkySportsNews on Twitter to get the latest updates.","image_url":"https://e2.365dm.com/21/11/1920x1080/skysports-eoin-morgan-england_5578137.jpg?20211110084650","source_id":"skysports"},{"title":"KKR announcement today: How to take part in KKR mock auction on KKR official website?","link":"https://thesportsrush.com/cricket-news-kkr-announcement-today-how-to-take-part-in-kkr-mock-auction-on-kkr-official-website/","keywords":["Cricket","IPL 2022","IPL","KKR","Kolkata Knight riders"],"creator":["Gurpreet Singh"],"video_url":null,"description":"KKR announcement today: KKR have introduced a unique mock auction wherein fans would be provided an opportunity to participate as well. A franchise’s overall performance on the field, is inarguably the biggest factor which determines its popularity amongst the followers of that particular sport. But, there are also certain off-the-filed elements which play an imperative… The post KKR announcement today: How to take part in KKR mock auction on KKR official website? appeared first on The SportsRush.","content":"KKR announcement today: KKR have introduced a unique mock auction wherein fans would be provided an opportunity to participate as well. A franchise’s overall performance on the field, is inarguably the biggest factor which determines its popularity amongst the followers of that particular sport. But, there are also certain off-the-filed elements which play an imperative role in determining the franchise’s financial success, and engagement with fans is one of them. The two-time Indian Premier League (IPL) champion team- Kolkata Knight Riders (KKR) have now placed a foot forward in this regard, providing an opportunity to its already massive fan base, to have a know-how of the way an IPL auction event unfolds. The ‘KKR mock auction’, as the name goes by, is a unique activity which would allow a few KKR fans to participate and experience the strategy and workings that take place during an actual IPL auction event. KKR announcement today: What is a mock auction? A mock auction is a process which would provide the fans an experience to get first-hand knowledge from the KKR franchise’s think-tank regarding the way they operate during an auction event. “The Mock Auction is yet another step towards our commitment of bringing the game closer to our fans. There is a lot of curiosity amongst the fans about the auction process, and it’s great that they get an opportunity to participate and engage with people who are a crucial part of the actual auction,” said Venky Mysore, CEO, and MD of KKR. “It would be amazing to see the suggestions shared by our fans, and I look forward to interacting with them during this process,” he added. Thus, for fans interested in partaking at the mock auction, they would first need to register themselves on the KKR website. Thereafter, 30 selected participants from there will receive customized KKR jerseys with their names on it, and 3 winners would get to virtually meet the KKR think-tank to give their ideas ahead of the mega auction. To prepare the fans for the Mock Auction, KKR’s think tank will be giving out two exclusive master class lessons (on January 29 and 31) via LIVE Sessions on the franchise’s Social Media Channels explaining the working dynamics of an IPL auction. Here’s how one can get themselves registered for the KKR mock auction: Got Auction advice? We are looking for YOU You can now win a chance to speak directly with our think tank before the #IPLAuction. Register yourself to #KKRMockAuction & follow the steps mentioned in the post! Link to register https://t.co/Dm2fzm5n2y#KKR #AmiKKR #IPL pic.twitter.com/qQq1V9hmY1 — KolkataKnightRiders (@KKRiders) January 27, 2022 For more Cricket related news, click here.         The post KKR announcement today: How to take part in KKR mock auction on KKR official website? appeared first on The SportsRush.","pubDate":"2022-01-27 16:40:27","full_description":null,"image_url":null,"source_id":"thesportsrush"},{"title":"Honours even after England let early advantage slip at Women’s Ashes Test - The Guardian","link":"https://news.google.com/__i/rss/rd/articles/CBMigQFodHRwczovL3d3dy50aGVndWFyZGlhbi5jb20vc3BvcnQvMjAyMi9qYW4vMjcvaG9ub3Vycy1ldmVuLWFmdGVyLWVuZ2xhbmQtbGV0LXNsaXAtZWFybHktYWR2YW50YWdlLW9uLWRheS1vbmUtb2Ytd29tZW5zLWFzaGVzLXRlc3TSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Honours even after England let early advantage slip at Women’s Ashes Test  The GuardianLanning, Haynes pave way for allrounders to cash in | Women's Ashes 2021-22  cricket.com.auAussies bat their way into box seat after day one of Women's Ashes Test  ABC NewsHaynes and Lanning put Australia in strong position in Women’s Ashes Test  Sydney Morning HeraldAussie legends make England pay  NEWS.com.auView Full coverage on Google News","content":null,"pubDate":"2022-01-27 16:12:00","image_url":null,"source_id":"google"},{"title":"Dorchester keep title after DCB investigation into late umpire reports","link":"https://www.dorsetecho.co.uk/sport/19880025.dorchester-keep-title-dcb-investigation-late-umpire-reports/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"DORCHESTER will retain their Dorset Funeral Plan Premier League title following a Dorset Cricket Board (DCB) investigation into late umpire reports last season.","content":null,"pubDate":"2022-01-27 16:11:33","full_description":"Last November, Echosport exclusively revealed how seven Premier League clubs had submitted late umpire reports last season. League rules state that teams are punished with a £30 fine for the first offence and five points for each subsequent rule break. Leaked documents showed that Dorchester had submitted three late reports, leading to a 10-point deduction - in theory. READ MORE : Dorchester title in jeopardy after leaked late umpire reports This would have been enough to demote them to second place behind Poole, who lost out on the title by just four points after the final match. How the 2021 table would have looked if penalties were applied Picture: DORSET ECHO Martinstown and Sherborne filed four late reports each and, had the sanctions been applied, would have dropped one place to fourth and sixth respectively after 15-point penalties. Wimborne & Colehill, Cattistock & Symene plus Christchurch also handed in late reports but would not have lost any positions if penalties were dished out. Bere Regis and Poole were the only teams to have a clean record. Leaked documents showed Dorchester filed three late umpire reports Picture: DORSET ECHO Echosport also obtained a leaked email written by the Dorset Association of Cricket Officials (DACO) showing a direct attempt to notify Dorset Cricket League chiefs after penalties were not applied. The DCB investigation, led by Tom Snape, concluded that no amendments should be made to the 2021 final table as the incident “was an administrative fault of the League committee and therefore potential mitigating circumstances were not considered and cannot be considered retrospectively”. In an official statement from the Dorset Cricket League management committee, the organisation \"sincerely\" apologised for not applying the penalties. It read: “The Dorset Cricket League (DCL) Management Committee accept and welcome the findings and conclusions in the investigation, conducted by Tom Snape of the Dorset Cricket Board, on the subject of late submission of umpires reports during the 2021 season. “DCL accept the finding that no suitable process for monitoring the timely submission of reports was in place, the consequence of which was that, following the resignation of the DCL Secretary in October 2020, no individual, or group of committee members, was responsible for spotting late reports and issuing the appropriate sanctions. “DCL welcome the recommendation that a robust process, automated where possible and agreed between the DCL management committee and the Dorset Association of Cricket Officials (DACO) committee, must be in place before the start of the 2022 season. “We appreciate that not applying sanctions retrospectively will disappoint and upset some players, officials and supporters of some clubs and we sincerely apologise to them for that, but we accept the reasons why it would not be appropriate to do so. “Once agreed, we will inform clubs of the new process for checking submission time of umpires reports and other administrative tasks undertaken by clubs to ensure the smooth running of the league.” Previously, the DCB had dismissed Echosport's report, which contained 10 leaked documents, as \"unsubstantiated\". However, the DCB now admits an \"administrative fault\" was to blame for the late reports. More to follow...","image_url":"https://www.dorsetecho.co.uk/resources/images/13418103/","source_id":"dorsetecho"},{"title":"Tamim Iqbal to stay away from T20 cricket for next six months","link":"https://www.business-standard.com/article/sports/tamim-iqbal-to-stay-away-from-t20-cricket-for-next-six-months-122012701560_1.html","keywords":null,"creator":null,"video_url":null,"description":"Tamim took the decision after discussions with top BCB officials","content":null,"pubDate":"2022-01-27 15:53:00","full_description":"Experienced Bangladesh opener Tamim Iqbal on Thursday said he will not play T20 cricket for the next six months to prolong his career and give youngsters a chance, a decision which rules him out of contention for the T20 World Cup in Australia later this year. Tamim's decision, however, comes with a rider as he said that he could reconsider the move if the Bangladesh Cricket Board (BCB) asks him again before the World Cup. Tamim took the decision after discussions with top BCB officials, including president Nazmul Hassan, who tried to convince him from not taking such a step in the best interest of Bangladesh cricket. \"There have been discussions about my T20I future. In the last few days, I have been doing meetings with the BCB president (Nazmul Hassan) and Jalal (Yunus) bhai and Kazi Inam (Ahmed). They wanted me to continue T20Is till the World Cup (this year). I had a different sort of thinking,\" Tamim told reporters in a press conference in Chattogram. \"I will not be considering T20Is for the next six months. My full focus will be on Tests and ODIs. We are preparing for the World Test Championship and qualification for the 2023 World Cup. I will not be thinking about T20Is in the next six months. \"I hope that those playing will do so well, that the team won't need me in T20Is. But if God forbid the team or cricket board needs me, and I am ready, I will possibly think about it,\" he added. Tamim has been mostly out of Bangladesh's T20 team for the past one year with his last appearance being against Zimbabwe in 2020. Tamim is Bangladesh's third highest run-getter in T20Is, garnering 1758 runs from 78 matches at an average of 24.08 and a strike-rate of 116.96. In fact, Tamim is Bangladesh's only centurion in the format, having smashed 103 off just 63 balls against Oman in the 2016 T20 World Cup in India. While announcing his decision, Tamim insisted that new players should be given a long run in the T20 squad. \"We handed chances to a number of youngsters in the last (T20I) series. We cannot lose hope in them quickly. We have to give them time. I think six months is a good enough time. I am pretty confident that I won't be needed in T20Is. Even then, if the team management or cricket board feels otherwise, I will be open for discussion. \"The team has to go forward. You know my stand ahead of the last T20 World Cup (of giving the young openers more opportunities), so it won't be wise to judge anyone after one or two series. Many of us seniors went through three or four bad series, and then bounced back with maybe three good series on the trot,\" he said. \"Considering those who will play in my place, I am sure they will find their feet and do well,\" he added. (Only the headline and picture of this report may have been reworked by the Business Standard staff; the rest of the content is auto-generated from a syndicated feed.)","image_url":"https://bsmedia.business-standard.com/_media/bs/img/article/default/1220127/thumb-122012701560.jpg","source_id":"business-standard"},{"title":"Tamim Iqbal to stay away from T20 cricket for next six months","link":"https://sportstar.thehindu.com/cricket/tamim-iqbal-to-stay-away-from-t20-cricket-for-next-six-months/article38334809.ece","keywords":null,"creator":["PTI"],"video_url":null,"description":"Tamim's decision, however, comes with a rider as he said that he could reconsider the move if the Bangladesh Cricket Board (BCB) asks him again before the World Cup.","content":null,"pubDate":"2022-01-27 15:48:28","full_description":null,"image_url":null,"source_id":"sportstar"},{"title":"Tamim Iqbal won't play T20s for next 6 months, may miss T20 World Cup 2022 for this reason","link":"https://zeenews.india.com/cricket/tamim-iqbal-wont-play-t20s-for-next-6-months-may-miss-t20-world-cup-2022-for-this-reason-2431310.html","keywords":null,"creator":null,"video_url":null,"description":"Experienced Bangladesh opener Tamim Iqbal on Thursday said he will not play T20 cricket for the next six months to prolong his career and give youngsters a chance, a decision which rules him out of contention for the T20 World Cup in Australia later this year.","content":null,"pubDate":"2022-01-27 14:57:00","full_description":null,"image_url":null,"source_id":"zeenews"},{"title":"\"Someone Who Can...\": Karthik On Young Pacer \"Dravid Should Invest In\"","link":"https://sports.ndtv.com/cricket/someone-who-can-dinesh-karthik-on-young-pacer-rahul-dravid-should-invest-in-2733527","keywords":null,"creator":null,"video_url":null,"description":"Rohit Sharma and Rahul Dravid will be looking to zero in on the players who can contribute in limited overs cricket, and Dinesh Karthik has suggested the name of a young pacer, who has impressed one...","content":null,"pubDate":"2022-01-27 14:43:42","full_description":"After India 0-3 loss in the one-day international series to South Africa, a lot has been spoken about the way India play and approach both the white-ball formats. The team's dependence on it's top order for the bulk of the runs and lack of wickets in the powerplay overs at the start of the innings are of concern as head coach Rahul Dravid tried to create a pool of players he could choose from for the T20 World Cup later this year and the 50-over World Cup in 2023. India's next assignment is at home against West Indies, where they will play a three-match ODI series, followed by a three-match T20I series. The squads for both these series were announced on Wednesday. Ravindra Jadeja is still unavailable as he recovers from injury while Hardik Pandya it seems is still not fit to bowl. In the pace department, both Jasprit Bumrah and Mohammed Shami have been rested. For the ODIs the selectors have gone in with Shardul Thakur, Deepak Chahar, Prasidh Krishna, Mohammed Siraj and Avesh Khan. While the impressive Harshal Patel has been included for the T20I series, along with Bhuvneshwar Kumar. Bhuvi has been axed from the ODI squad after two terrible outings in South Africa. White-ball captain Rohit Sharma and head coach Rahul Dravid will be looking to zero in on the players who can contribute in limited overs cricket, and Indian wicket-keeper batter Dinesh Karthik has suggested the name of a young pacer, who has impressed one and all with his performances in the Indian Premier League. Karthik, who has been part of the Kolkata Knight Riders team in IPL till last season, wants Dravid to invest in Shivam Mavi and explained his reasons during a conversation with eminent cricket commentator Harsha Bhogle and host Gaurav Kapur on Cricbuzz . \"Another name that will definitely help Indian cricket is Shivam Mavi...you need someone who can bring the ball back in and he bowls 140-plus. It is sad that he is playing for a state like UP where sometimes you have so many fast bowlers, they have Bhuvi, they have Yash Dayal, then there is Shivam Mavi and I can give the entire list. So, sometimes he (Mavi) bowls first change, but he is a proper new ball bowler who can pick wickets. Promoted \"He has the ability to swing the ball late and if you see in the IPL, he has got good batsmen out. He has a bit of pace, terrific fielder and can bat a bit. These are the kind of guys I would love for Rahul Dravid to invest in because he has seen him first up,\" Karthik opined. The ODI series between India and West Indies begin from February 6th.","image_url":"https://c.ndtvimg.com/2021-11/4spagboo_dinesh-karthik_625x300_10_November_21.jpg?im=FaceCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv"},{"title":"Ravindra Jadeja is not a 'reckless kid' anymore, can solve India's middle-order woes: Dinesh Karthik","link":"https://www.thehansindia.com/sports/cricket/ravindra-jadeja-is-not-a-reckless-kid-anymore-can-solve-indias-middle-order-woes-dinesh-karthik-726589","keywords":["Sports,Cricket"],"creator":["Ishka"],"video_url":null,"description":"Jadeja is currently recovering from a knee injuryHe is not a part of India’s upcoming series against WIJadeja has played 168 ODIs for India so far","content":"Ravindra Jadeja is currently recovering from a knee injuryRavindra Jadeja is currently recovering from a knee injuryDinesh Karthik has said Ravindra Jadeja is not a \"reckless kid\" anymore and can solve India's middle-order woes in the 50-over format. Jadeja is currently recovering from a knee injury and hence he has not been included in India's squad for a limited-over series against West Indies, starting next month. \"Jadeja is undergoing his final stage of recovery post his knee injury and will not be available for the ODIs and T20Is,\" the Indian cricket board said in an official release. Bowling all-rounder Jadeja, who made his One-Day International (ODI) debut in 2009, has represented India 168 times in the 50-over format. He has scored 2,411 runs at an average of 32.58. He has also picked up 188 wickets with 5 for 36 being his spell so far in an ODI. \"Jadeja is ready to bat at No.6. In fact, he is batting so well that he can play at No.5 as well. He is using his brain and is not that reckless kid anymore,\" Karthik said on Cricbuzz. Jadeja, who averages over 30 in both ODIs and Tests, in recent times has received praises for his improved performances with the bat in the lower middle order. \"He is someone who is winning games with the bat. In fact, in white-ball cricket, his stronger suit is his batting,\" added Karthik, who last played for India back in 2019 during the Cricket World Cup.👑⚡️ pic.twitter.com/sf1D8xJyNj— Ravindrasinh jadeja (@imjadeja) January 24, 2022 India sorely missed Jadeja's all-round skills in their recent tour to South Africa, where they lost both Test and ODI series. In the white-ball series, India tried Venkatesh Iyer at No. 6 but his lack of experience on the international level had more to say. As a result, the Madhya Pradesh cricketer was dropped from the upcoming home series against West Indies.India and West Indies are set to lock horns in a three-match ODI series followed by a three-T20I series. The ODIs are scheduled to be played at Narendra Modi Stadium, Ahmedabad and the T20Is at Kolkata's Eden Gardens.","pubDate":"2022-01-27 14:37:03","full_description":null,"image_url":"https://assets.thehansindia.com/h-upload/2022/01/27/500x300_1197350-ravindra-jadeja.jpg","source_id":"thehansindia"},{"title":"Bangladesh's Tamim Iqbal takes six-month break from T20I cricket","link":"https://www.indiatvnews.com/sports/cricket/icc-t20-world-cup-2022-in-australia-bangladesh-s-tamim-iqbal-takes-six-month-break-from-t20i-cricket-2022-01-27-756652","keywords":null,"creator":null,"video_url":null,"description":"Explosive Bangladesh opener Tamim Iqbal has expressed that he is taking a break from international T20 cricket for the next six months. The decision rose many eyebrows as this also put a question mark on Iqbal's participation in the upcoming ICC T20 World Cup 2022 in Australia.","content":null,"pubDate":"2022-01-27 14:03:08","full_description":"Explosive Bangladesh opener has expressed that he is taking a break from international T20 cricket for the next six months. The decision rose many eyebrows as this also put a question mark on Iqbal's participation in the upcoming ICC T20 World Cup 2022 in Australia. Tamim, however, said that he could reconsider this decision if the Bangladesh Cricket Board (BCB) asks him again before the World Cup. Though he doesn't believe it will be required. The 32-year-old made the announcement following his discussions with top BCB officials including president Nazmul Hassan, who tried to dissuade him from taking the decision. Tamim had been mostly away from Bangladesh's T20I side for the past 12 months. His last T20I was against Zimbabwe in 2020, after which he missed the rest of the three-match series due to a knee injury. He also voluntarily pulled out of the tournament of last year's T20 World Cup, in order to give the other openers like Litton Das, and Mohammad Naim opportunities. Tamim said at the time that since he missed the lead-up to the T20 World Cup, it was only fair for him to skip the tournament. In a press conference in Chattogram on Thursday, the opener said that it was a cricketing decision and that his focus is on Tests and ODIs this year, but he will only reconsider T20Is if circumstances get difficult for the team. \"There have been discussions about my T20I future. In the last few days, I have been doing meetings with the BCB president (Nazmul Hassan) Jalal (Yunus) Bhai and Kazi Inam (Ahmed). They wanted me to continue T20Is till the World Cup (this year). I had a different sort of thinking. I will not be considering T20Is for the next six months. My full focus will be on Tests and ODIs,\" ESPNcricinfo quoted Tamim as saying. \"We are preparing for the World Test Championship and qualification for the 2023 World Cup. I will not be thinking about T20Is in the next six months. I hope that those playing will do so well that the team won't need me in T20Is. But if God forbid the team or cricket board needs me, and I am ready, I will possibly think about it,\" he added. Tamim is Bangladesh's third-highest run-getter in T20Is. He has played 74 T20Is for Bangladesh and four for World XI teams - three in Pakistan in 2017 and one against West Indies at Lord's in 2018. He has 1701 runs for Bangladesh, at an average of 24.65 and a strike rate of 117.47, while his overall T20I record is 1758 runs at 24.08 and a strike rate of 116.96. The attacking batter, who is Bangladesh's only centurion in the T20 cricket, will continue to play in domestic T20 leagues, having already made two half-centuries for Minister Group Dhaka in the ongoing BPL. Tamim insisted that the new players who will be tried in his place should be given a long rope and he feels six months is a good enough time. \"We handed chances to a number of youngsters in the last (T20I) series. We cannot lose hope in them quickly. We have to give them time. I think six months is a good enough time. I am pretty confident that I won't be needed in T20Is. Even then, if the team management or cricket board feels otherwise, I will be open for discussion,'' he said. \"The team has to go forward. You know my stand ahead of the last T20 World Cup (of giving the young openers more opportunities), so it won't be wise to judge anyone after one or two series. Many of us seniors went through three or four bad series and then bounced back with maybe three good series on the trot. Considering those who will play in my place, I am sure they will find their feet and do well,\" he added.","image_url":null,"source_id":"indiatvnews"},{"title":"Brett Lee is all praise for Pat Cummins, the captain","link":"https://sportstar.thehindu.com/cricket/legends-league-cricket-brett-lee-pat-cummins-ashes-australia-cricket-news-sports/article38334343.ece","keywords":null,"creator":["P.K. Ajith Kumar"],"video_url":null,"description":"Lee, who joined the World Giants XI at Legends League Cricket after commentating on the Ashes series, is happy that Cummins proved that fast bowlers could be good captains","content":null,"pubDate":"2022-01-27 13:58:25","full_description":null,"image_url":null,"source_id":"sportstar"},{"title":"WOG vs INM Dream11 Prediction: Fantasy Cricket Tips, Today's Playing 11s and Pitch Report for Legends League Cricket 2022, Match 6","link":"https://www.sportskeeda.com/fantasy-cricket-mantra/wog-vs-inm-dream11-prediction-fantasy-cricket-tips-today-s-playing-11s-pitch-report-legends-league-cricket-2022-match-6?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Fantasy Cricket Mantra"],"creator":["Anjishnu Roy"],"video_url":null,"description":null,"content":null,"pubDate":"2022-01-27 13:22:30","full_description":"World Giants (WOG) will take on India Maharajas (INM) in the sixth match of the Legends League Cricket 2022 at the Al Amerat Cricket Ground in Oman on Thursday. World Giants have played three games this season. They have won two of them to sit atop the points table at the moment. Meanwhile, India Maharajas have won once in three games, and are placed at the bottom of the table. Kevin Pietersen, Herschelle Gibbs, Kevin O’Brien, Corey Anderson, Brad Haddin (wk), Albie Morkel, Daren Sammy (C), Brett Lee, Morne Morkel, Ryan Sidebottom, Monty Panesar. Naman Ojha (wk), Wasim Jaffer, Subramaniam Badrinath, Mohammad Kaif (C), Yusuf Pathan, Stuart Binny, Nikhil Chopra, Manpreet Gony, Amit Bhandari, Aavishkar Salvi, Munaf Patel. Match: WOG vs INM, Legends League Cricket 2022, Match 3. Date and Time: 22nd January, 2022; 8:00 PM IST. Venue: Al Amerat Cricket Ground, Oman. The track at the Al Amerat Ground is conducive for batters. The team batting second has won both games so far. So the team winning the toss should look to do the same here. Naman Ojha is the best bet for the wicketkeeper position in your Fantasy team. He was absolutely scintillating in his previous game against World Giants. Ojha scored 140 runs at a tremendous strike rate of 202.9, and his knock included 15 fours and nine sixes. Mohammed Kaif is expected to continue his good form. Besides being solid with the bat, he’s also excellent in the field, even at his age. Meanwhile, Kevin Pietersen is regarded as one of the best batters of his generation, having played with panache throughout his career. Pietersen scored 53 runs in his last game against India Maharajas. Kevin O’Brien was sensational in his last game, and was the protagonist with the bat for his side. The former Ireland international scored 31 runs, and also picked up a wicket. Meanwhile, Yusuf Pathan played a match-winning knock of 80 off 40 deliveries in the first game. The barrage of boundaries and sixes from his bat needs little introduction. Morne Morkel was an accomplished T20 bowler during his heydays. He has picked up five wickets thus far in the competition. Naman Ojha (INM) – 262 points. Kevin Pietersen (WOG) – 234 points. Kevin O’Brien (WOG) – 222 points. Morne Morkel (WOG) – 191 points. Stuart Binny (INM) – 176 points. Naman Ojha: 160 runs. Kevin Pietersen: 153 runs. Kevin O’Brien: 126 runs and 1 wicket. Morne Morkel: 5 wickets. Yusuf Pathan: 107 runs. Fantasy Suggestion #1: Naman Ojha, Mohammed Kaif, Kevin Pietersen, Darren Sammy, Kevin O’Brien, Yusuf Pathan, Stuart Binny, Morne Morkel, Ryan Sidebottom, Manpreet Gony, Brett Lee. Captain: Kevin O’Brien. Vice-Captain: Kevin Pietersen. Fantasy Suggestion #2: Naman Ojha, Mohammed Kaif, Herschelle Gibbs, Kevin Pietersen, Darren Sammy, Kevin O’Brien, Yusuf Pathan, Stuart Binny, Morne Morkel, Ryan Sidebottom, Manpreet Gony. Captain: Naman Ojha. Vice-Captain: Yusuf Pathan.","image_url":"https://static.sportskeeda.com/editor/2022/01/c8495-16432836148249-1920.jpg","source_id":"sportskeeda"},{"title":"3 players who are yet to retire but are part of Legends League Cricket 2022 squads","link":"https://www.sportskeeda.com/cricket/legends-league-cricket-2022-3-players-yet-retire-part-tournament?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Cricket"],"creator":["Vinay Chhabria"],"video_url":null,"description":null,"content":null,"pubDate":"2022-01-27 13:22:30","full_description":"Legends League Cricket 2022 is currently underway in Oman with the India Maharajas , Asia Lions and World Giants competing for the championship. The Asia Lions have played all four of their matches in the league round, earning four points by winning two games. The World Giants and the India Maharajas have played three games each. The Giants have recorded two wins, while the Maharajas have only one victory to their name. Thursday night's battle between the Giants and the Maharajas will decide the two finalists of Legends League Cricket 2022. Most of the cricketers participating in Legends League Cricket have retired, but the following three names have participated in this tournament without calling it a day on their international careers. Imran Tahir actively plays in T20 leagues across the world. He has registered himself for the IPL 2022 Auction and will be in action during the Pakistan Super League 2022 as well. If Cricket South Africa recall him to the national squad, Tahir is also ready to play international cricket. Interestingly, Tahir represented the World Giants in the first half of Legends League Cricket 2022. He played two matches, where he could not scalp a single wicket. However, he scored a match-winning half-century against the India Maharajas. Tahir slammed a 19-ball 52* and set a new record for the fastest fifty in the Legends League Cricket. The 42-year-old is likely to continue playing for another couple of years. Chris Gayle was named in the World Giants squad for Legends League tournament. However, the Universe Boss is yet to play a match in the tournament. He is currently in Bangladesh, playing for Fortune Barishal in the Bangladesh Premier League. With two more matches remaining in Legends League, it will be interesting to see if Gayle joins the World Giants squad soon. Like Imran Tahir, Gayle has not called it a day on his international career. Many fans feel the T20 World Cup 2021 was Gayle's last appearance for the West Indies, but the left-handed batter is yet to make an official statement. Former Pakistan captain Shoaib Malik won the Lanka Premier League last month with the Jaffna Kings squad. After the tournament, Malik found a place in the Asia Lions squad for the Legends League. It will be interesting to see if Malik gets a game in the tournament because the Asia Lions have played all of their group stage matches, but the all-rounder did not feature in their match squad. Malik is also part of the MGM Cricket Club squad for the Sharjah CBFS T20 2022, a tournament which is currently underway. However, he is yet to play any matches for his team. Malik may return to the cricket field in PSL 2022, where he is a member of the Peshawar Zalmi team.","image_url":"https://static.sportskeeda.com/editor/2022/01/41d20-16432840035802-1920.jpg","source_id":"sportskeeda"},{"title":"India Maharajas vs World Giants LIVE Score, Legends League 2022: Toss, Playing XI, Dream11 Fantasy team, Streaming info","link":"https://sportstar.thehindu.com/cricket/india-maharajas-vs-world-giants-live-score-legends-league-cricket-match-6-updates/article38334033.ece","keywords":null,"creator":["Team Sportstar"],"video_url":null,"description":"Legends League Cricket 2022, IMR vs WGS: Get the live cricket score, highlights commentary, updates and more from match 6 between India Maharajas and World Giants in Oman.","content":null,"pubDate":"2022-01-27 13:16:07","full_description":null,"image_url":null,"source_id":"sportstar"},{"title":"'With All Due Respect To Kohli': Harbhajan Names His Favourite Batter","link":"https://sports.ndtv.com/cricket/with-all-due-respect-to-virat-kohli-harbhajan-singh-names-his-favourite-batter-2733223","keywords":null,"creator":null,"video_url":null,"description":"Harbhajan Singh was recently asked to name his favourite batter at the moment. The Indian spin great named his choice, calling his pick \"probably the best batsman in world cricket\".","content":null,"pubDate":"2022-01-27 12:54:42","full_description":"Harbhajan Singh was recently asked to name his favourite batter at the moment. The Indian spin great named his choice, calling his pick \"probably the best batsman in world cricket\". The former India spinner made the comments when he was asked during an interview to name his favourite batter and bowler. Harbhajan replied saying his favourite batter is Rohit Sharma and his favourite bowler is Jasprit Bumrah . \"Favourite batsman: Rohit Sharma. Whether T20, one-day cricket, Test cricket, when Rohit is batting, he is unbelievable. He has got so much of time, he makes batting look very, very easy,\" Harbhajan told Sports Today . \"I think Rohit is probably the best batsman in world cricket, with all due respect to others like Virat Kohli and KL Rahul. They are equally good as well but when Rohit plays, he is different level altogether. So Rohit is my favourite batsman,\" he added. Harbhajan went on to term Bumrah as \"a class apart\". \"Coming to bowlers, Jasprit Bumrah I think is a class apart. Whether we talk about T20s, one-dayers or Test cricket, Jasprit Bumrah is a top-class bowler. These are my two favourite players,\" he said. Meanwhile, Rohit is back from an injury break and will lead the Indian team in the upcoming home series against West Indies. The Board of Control for Cricket in India (BCCI) announced on Wednesday 18-member squads each for the upcoming three-match one-day international series and the three-match T20I series at home against West Indies. Promoted Rohit, India's designated white-ball captain, will lead the team in ODIs for the first time as full-time captain as he missed the tour of South Africa due to a hamstring injury. Rohit's return will be a big boost for the team which is smarting from its shocking 0-3 whitewash at the hands of the South Africans.","image_url":"https://c.ndtvimg.com/2021-12/25t93s6g_harbhajansingh_640x480_26_December_21.jpg?im=FeatureCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv"},{"title":"Lanning, Haynes pave way for allrounders to cash in | Women's Ashes 2021-22 - cricket.com.au","link":"https://news.google.com/__i/rss/rd/articles/CBMiK2h0dHBzOi8vd3d3LnlvdXR1YmUuY29tL3dhdGNoP3Y9T1NvbER4VE0xdDDSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Lanning, Haynes pave way for allrounders to cash in | Women's Ashes 2021-22  cricket.com.auAussies bat their way into box seat after day one of Women's Ashes Test  ABC NewsAussie legends make England pay  NEWS.com.auHaynes and Lanning put Australia in strong position in Women’s Ashes Test  Sydney Morning HeraldHotspot sorely missed in women's Ashes  The West AustralianView Full coverage on Google News","content":null,"pubDate":"2022-01-27 12:30:28","image_url":null,"source_id":"google"},{"title":"“Too expensive”: Kevin Pietersen responds to IPL comeback post Legends League Cricket half-century vs Asia Lions","link":"https://thesportsrush.com/cricket-news-too-expensive-kevin-pietersen-responds-to-ipl-comeback-post-legends-league-cricket-half-century-vs-asia-lions/","keywords":["Cricket","Asia Lions","England","Indian Premier League","IPL 2022","kevin pietersen","Legends League Cricket","World Giants"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Kevin Pietersen responds to IPL comeback: The former English batter has quashed speculations about IPL 2022 comeback. During the fifth match of the ongoing inaugural season of Legends League Cricket between Asia Lions and World Giants in Al Amerat yesterday, World Giants opening batter Kevin Pietersen had scored a match-winning half-century at a strike rate… The post “Too expensive”: Kevin Pietersen responds to IPL comeback post Legends League Cricket half-century vs Asia Lions appeared first on The SportsRush.","content":"Kevin Pietersen responds to IPL comeback: The former English batter has quashed speculations about IPL 2022 comeback. During the fifth match of the ongoing inaugural season of Legends League Cricket between Asia Lions and World Giants in Al Amerat yesterday, World Giants opening batter Kevin Pietersen had scored a match-winning half-century at a strike rate of 226.32. Opening the batting with Herschelle Gibbs (12), Pietersen played a pivotal role in a 150-run chase. The extent of damage done by Pietersen can be observed from the fact that him getting out at the halfway mark had no impact on the rest of the innings as his team had needed only 22 runs off 56 deliveries to win the match. Pietersen, who primarily took the attack against the spinners, scored as many as 30 and 21 runs off Sanath Jayasuriya and Asghar Afghan respectively. Making a mockery of the chase, Pietersen departed after scoring 86 (38) with the help of nine fours and seven sixes. Kevin Pietersen responds to IPL comeback post Legends League Cricket half-century vs Asia Lions Videos of Pietersen’s outstanding innings have been doing the rounds across social media platforms since last night. Pietersen, 41, himself posted a 65-second video urging people to spend a minute on watching his batting from Wednesday. Reacting to a post which had asked about Pietersen’s Indian Premier League comeback, Pietersen joked around how he is “too expensive” for the IPL. Too expensive! — Kevin Pietersen (@KP24) January 27, 2022 Still got it bud . Death, taxes and a Kev Masterclass are givens — Rikki Clarke (@RikkiClarke81) January 27, 2022 Back in the day, Pietersen had represented Royal Challengers Bangalore, Delhi Capitals and Rising Pune Supergiants across five IPL seasons scoring 1,001 runs in 36 innings at an average and strike rate of 35.75 and 134.72 respectively including a century and four half-centuries. Having last played competitive cricket for Quetta Gladiators in Pakistan Super League 2018, Pietersen had returned to the field in the Road Safety World Series 2021 before taking part in Legends Cricket League. The post “Too expensive”: Kevin Pietersen responds to IPL comeback post Legends League Cricket half-century vs Asia Lions appeared first on The SportsRush.","pubDate":"2022-01-27 12:14:04","full_description":null,"image_url":null,"source_id":"thesportsrush"},{"title":"Langer, Thompson inducted into Australian cricket Hall of Fame","link":"https://sportstar.thehindu.com/cricket/justin-langer-australia-cricket-coach-hall-of-fame-thompson-hayden-gilchrist-hobart-pakistan/article38333603.ece","keywords":null,"creator":["PTI"],"video_url":null,"description":"During his successful career as a player, Langer had formed a formidable pairing with Matthew Hayden in Test cricket, playing a key role in Australia's dominance in the early and mid 2000s.","content":null,"pubDate":"2022-01-27 11:38:31","full_description":null,"image_url":null,"source_id":"sportstar"},{"title":"Justin Langer inducted into Australian cricket Hall of Fame","link":"https://www.indiatvnews.com/sports/cricket/justin-langer-inducted-into-australian-cricket-hall-of-fame-raelee-thompson-too-honoured-2022-01-27-756616","keywords":null,"creator":null,"video_url":null,"description":"Former opener and head coach of the senior men's side, Justin Langer has been inducted into the Australian Cricket Hall of Fame alongside Raelee Thompson, one of the pioneers of the women's game in the country.","content":null,"pubDate":"2022-01-27 11:34:34","full_description":"Former opener and head coach of the senior men's side, Justin Langer has been inducted into the Australian Cricket Hall of Fame alongside Raelee Thompson, one of the pioneers of the women's game in the country. During his successful career as a player, Langer had formed a formidable pairing with Matthew Hayden in Test cricket, playing a key role in Australia's dominance in the early and mid 2000s. Former fast bowler Thompson, 76, captained the Australian team on four occasions. Thompson and Langer become the 58th and 59th inductees respectively, since the Australian Cricket Hall of Fame was established in 1996. Langer took up coaching after his retirement from international cricket and following successful stints at Western Australian and Perth Scorchers, Langer was appointed coach of the Australian men's cricket team in May 2018, and led them to the ICC 2021 T20 World Cup title and helped the team retain in 2019 and 2021-2022. \"Justin's contribution to Australian cricket spans across four separate decades,\" Australian Cricket Hall of Fame Chairman Peter King said. \"First as a player, as part of one of the most successful teams that world cricket has ever seen. As a coach, he entered the role at a time of great need and leads the Australian Men's Cricket Team with great distinction, a team which the Australian public is very proud of.\" The duo of Langer and Hyaden amassed 6,081 runs together from 122 Test innings at an average of 51.53, including 14 century partnerships. The gritty Langer made his Test debut against the West Indies at the Adelaide Oval in 1993 with a gritty 54, an innings during which he was hit on the helmet by an Ian Bishop delivery. The 51-year-old Langer finished his career with 7696 runs at an average of 45.27. He also played in eight One Day Internationals in a career spanning 18 years and played first-class cricket for Western Australia, Middlesex and Somerset, scoring 28,382 runs at an average of 50.23. However, Langer spent the first years of his Test career at No. 3, which included his famous match-winning partnership with Adam Gilchrist to chase down 369 against Pakistan in Hobart in 1999. Thompson, hailing from Shepparton in Victoria, played 16 Tests and 23 One Day Internationals for Australia between 1972 and 1985. Thompson remains the oldest player - male or female - to take a maiden five-wicket haul in Test matches at 39 years and 175 days of age. About Thompson, King said, \"Raelee is similarly a deserved induction, given her outstanding contribution to the game at a time where there was little fanfare at the elite level. \"She is no doubt one of our great pioneering female cricketers and represented the Baggy Green with such distinction - she is a worthy recipient of this recognition.\" Todd Greenberg, the CEO of Australian Cricketers' Association and a member of the selection panel for the Hall of Fame, added,\" Raelee is an ambassador and ornament to the women's game and was part of a team of trailblazing women - including four games as captain - who can be credited for the success that the current-day Australian women's cricket team enjoys. Thompson took 57 Test wickets at an average of 18.24 and 24 One-Day International wickets at 18.66. She also represented Victoria on 45 occasions before serving as a selector for many years. \"Raelee's commitment to the betterment of women's cricket at all levels through mentoring and administration roles is inspiring. To this day she remains a prominent figure in cricket, particularly at Essendon Maribyrnong Park Ladies Cricket Club where she is a Life Member. She is hugely deserving of her induction,\" Greenberg said.","image_url":null,"source_id":"indiatvnews"},{"title":"Justin Langer inducted into Australian cricket Hall of Fame, Raelee Thompson too honoured","link":"https://indianexpress.com/article/sports/cricket/justin-langer-inducted-into-australia-cricket-hall-of-fame-7744340/","keywords":["Cricket","Sports"],"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2022-01-27 11:20:57","full_description":"Former opener and head coach of the senior men’s side, Justin Langer has been inducted into the Australian Cricket Hall of Fame alongside Raelee Thompson, one of the pioneers of the women’s game in the country. During his successful career as a player, Langer had formed a formidable pairing with Matthew Hayden in Test cricket, playing a key role in Australia’s dominance in the early and mid 2000s. Check Out Express Premium Recalling how Govt snatched away Tatas beloved child Air India The Congress story in UP: Party adrift, leaders head for exit Opinion: Looking back at the pandemic to plan ahead Click here for more Former fast bowler Thompson, 76, captained the Australian team on four occasions. https://images.indianexpress.com/2020/08/1x1.png Thompson and Langer become the 58th and 59th inductees respectively, since the Australian Cricket Hall of Fame was established in 1996. Langer took up coaching after his retirement from international cricket and following successful stints at Western Australian and Perth Scorchers, Langer was appointed coach of the Australian men’s cricket team in May 2018, and led them to the ICC 2021 T20 World Cup title and helped the team retain the Ashes in 2019 and 2021-2022. “Justin’s contribution to Australian cricket spans across four separate decades,” Australian Cricket Hall of Fame Chairman Peter King said. The 58th inductee into the Australian Cricket Hall of Fame! Congratulations, Justin Langer 👏 #AusCricketAwards pic.twitter.com/w8BroIBw3M — Cricket Australia (@CricketAus) January 27, 2022 “First as a player, as part of one of the most successful teams that world cricket has ever seen. As a coach, he entered the role at a time of great need and leads the Australian Men’s Cricket Team with great distinction, a team which the Australian public is very proud of.” The duo of Langer and Hyaden amassed 6,081 runs together from 122 Test innings at an average of 51.53, including 14 century partnerships. The gritty Langer made his Test debut against the West Indies at the Adelaide Oval in 1993 with a gritty 54, an innings during which he was hit on the helmet by an Ian Bishop delivery. The 51-year-old Langer finished his career with 7696 runs at an average of 45.27. He also played in eight One Day Internationals in a career spanning 18 years and played first-class cricket for Western Australia, Middlesex and Somerset, scoring 28,382 runs at an average of 50.23. However, Langer spent the first years of his Test career at No. 3, which included his famous match-winning partnership with Adam Gilchrist to chase down 369 against Pakistan in Hobart in 1999. Thompson, hailing from Shepparton in Victoria, played 16 Tests and 23 One Day Internationals for Australia between 1972 and 1985. Thompson remains the oldest player – male or female – to take a maiden five-wicket haul in Test matches at 39 years and 175 days of age. About Thompson, King said, “Raelee is similarly a deserved induction, given her outstanding contribution to the game at a time where there was little fanfare at the elite level. “She is no doubt one of our great pioneering female cricketers and represented the Baggy Green with such distinction – she is a worthy recipient of this recognition.” Todd Greenberg, the CEO of Australian Cricketers’ Association and a member of the selection panel for the Hall of Fame, added,” Raelee is an ambassador and ornament to the women’s game and was part of a team of trailblazing women – including four games as captain – who can be credited for the success that the current-day Australian women’s cricket team enjoys. Thompson took 57 Test wickets at an average of 18.24 and 24 One-Day International wickets at 18.66. She also represented Victoria on 45 occasions before serving as a selector for many years. “Raelee’s commitment to the betterment of women’s cricket at all levels through mentoring and administration roles is inspiring. “To this day she remains a prominent figure in cricket, particularly at Essendon Maribyrnong Park Ladies Cricket Club where she is a Life Member. She is hugely deserving of her induction,” Greenberg said.","image_url":null,"source_id":"indianexpress"},{"title":"Justin Langer Inducted Into Australian Cricket Hall Of Fame","link":"https://sports.ndtv.com/cricket/justin-langer-inducted-into-australian-cricket-hall-of-fame-raelee-thompson-too-honoured-2732807","keywords":null,"creator":null,"video_url":null,"description":"Former opener and head coach of the senior men's side, Justin Langer has been inducted into the Australian Cricket Hall of Fame alongside Raelee Thompson, one of the pioneers of the women's game in...","content":null,"pubDate":"2022-01-27 11:09:56","full_description":"Former opener and current head coach of the senior men's side, Justin Langer has been inducted into the Australian Cricket Hall of Fame alongside Raelee Thompson, one of the pioneers of the women's game in the country. During his successful career as a player, Langer had formed a formidable pairing with Matthew Hayden in Test cricket, playing a key role in Australia's dominance in the early and mid 2000s. Former fast bowler Thompson, 76, captained the Australian team on four occasions. Thompson and Langer become the 58th and 59th inductees respectively, since the Australian Cricket Hall of Fame was established in 1996. Langer took up coaching after his retirement from international cricket and following successful stints at Western Australian and Perth Scorchers, Langer was appointed coach of the Australian men's cricket team in May 2018, and led them to the ICC 2021 T20 World Cup title and helped the team retain the Ashes in 2019 and 2021-2022. \"Justin's contribution to Australian cricket spans across four separate decades,\" Australian Cricket Hall of Fame Chairman Peter King said. \"First as a player, as part of one of the most successful teams that world cricket has ever seen. As a coach, he entered the role at a time of great need and leads the Australian Men's Cricket Team with great distinction, a team which the Australian public is very proud of.\" The duo of Langer and Hyaden amassed 6,081 runs together from 122 Test innings at an average of 51.53, including 14 century partnerships. The gritty Langer made his Test debut against the West Indies at the Adelaide Oval in 1993 with a gritty 54, an innings during which he was hit on the helmet by an Ian Bishop delivery. The 51-year-old Langer finished his career with 7696 runs at an average of 45.27. He also played in eight One Day Internationals in a career spanning 18 years and played first-class cricket for Western Australia, Middlesex and Somerset, scoring 28,382 runs at an average of 50.23. However, Langer spent the first years of his Test career at No. 3, which included his famous match-winning partnership with Adam Gilchrist to chase down 369 against Pakistan in Hobart in 1999. Thompson, hailing from Shepparton in Victoria, played 16 Tests and 23 One Day Internationals for Australia between 1972 and 1985. Thompson remains the oldest player - male or female - to take a maiden five-wicket haul in Test matches at 39 years and 175 days of age. About Thompson, King said, \"Raelee is similarly a deserved induction, given her outstanding contribution to the game at a time where there was little fanfare at the elite level. \"She is no doubt one of our great pioneering female cricketers and represented the Baggy Green with such distinction - she is a worthy recipient of this recognition.\" Todd Greenberg, the CEO of Australian Cricketers' Association and a member of the selection panel for the Hall of Fame, added,\" Raelee is an ambassador and ornament to the women's game and was part of a team of trailblazing women - including four games as captain - who can be credited for the success that the current-day Australian women's cricket team enjoys. Thompson took 57 Test wickets at an average of 18.24 and 24 One-Day International wickets at 18.66. She also represented Victoria on 45 occasions before serving as a selector for many years. Promoted \"Raelee's commitment to the betterment of women's cricket at all levels through mentoring and administration roles is inspiring. \"To this day she remains a prominent figure in cricket, particularly at Essendon Maribyrnong Park Ladies Cricket Club where she is a Life Member. She is hugely deserving of her induction,\" Greenberg said.","image_url":"https://c.ndtvimg.com/2021-11/mbkmmj7_justin-langer-afp_625x300_07_November_21.jpg?im=FeatureCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv"},{"title":"BBL 11: Sydney Sixers star Dan Christian offers 'free beer' for help in final, takes dig at Cricket Australia","link":"https://www.indiatoday.in/sports/cricket/story/bbl-11-sydney-sixers-star-dan-christian-offers-free-beer-for-help-in-final-takes-dig-at-cricket-australia-1905255-2022-01-27?utm_source=rss","keywords":null,"creator":null,"video_url":null,"description":"Sydney Sixers star Dan Christian offers 'free beer' for help in BBL 11 final","content":null,"pubDate":"2022-01-27 11:07:13","full_description":"Australia all-rounder Dan Christian joked about Covid-hit Sydney Sixers situation ahead of the Big Bash League 2021-22 final, saying that he is willing to offer \"free beers\" to anyone in Melbourne who can turn up to play for the team on Friday against Perth Scorchers. Dan Christian took to social media to post a cheeky message even as Sixers are struggling to field a playing XI due to multiple injury setbacks and Covid-19 concerns. On Wednesday, the Sixers were forced to add their assistant coach Jay Lenton to the playing XI after wicketkeeper-batter Josh Philippe tested positive for Covid-19 ahead of their challenger match against Adelaide Strikers in Sydney. Australia's Test vice-captain Steve Smith had offered to play for the Sixers on Wednesday but Cricket Australia deemed him ineligible, saying replacements can only come from a Local Replacement Player pool, created due to Covid-19 concerns in early January. For the final on Friday, the Sixers could be missing a string of players for the decider. Allrounder Moises Henriques has a calf injury, Steve O'Keefe (calf) and Jordan Silk (hamstring) are doubts, and Dan Hughes (ankle) will have to prove his fitness after missing Wednesday's match. Adding to the Sixers woes, Josh Philippe and the Edwards brothers, Jack and Mickey, are out due to COVID-19 issues unless the Victorian state government relaxes its policy. \"Shout out to anyone in Melbourne that wants a game of cricket tomorrow night,\" Christian wrote on Twitter. I’m keen if u can guarantee me my 4 overs? — AB de Villiers (@ABdeVilliers17) January 27, 2022 \"My team is struggling to get 11 COVID free, fit players on the park. Warm up starts at 6.30pm at Marvel Stadium. \"Free beer afterwards, potentially out of a large cup.\" Christian ended his tweet with a dig at Cricket Australia for not allowing Smith to play, adding \"no test cricketers\". Meanwhile, former South Africa batter AB de Villiers responded to the tweet, saying he is interested only if he is allowed to bowl in the BBL 11 final on Friday. Live TV Also Read | Sri Lanka Cricket appoint Lasith Malinga as bowling strategy coach Also Read | PSL 7: Shahid Afridi tests Covid-19 positive, to be under home isolation","image_url":null,"source_id":"indiatoday"},{"title":"Watch: Afghanistan U-19 Players Show Off Their Dance Moves In Training","link":"https://sports.ndtv.com/cricket/icc-u-19-cricket-world-cup-afghanistan-u-19-players-show-off-their-dance-moves-in-training-watch-2732774","keywords":null,"creator":null,"video_url":null,"description":"ICC U-19 Cricket World Cup: In fine form in the ongoing tournament, the Afghanistan U-19 team caught the attention of fans with their unique training dance moves.","content":null,"pubDate":"2022-01-27 10:35:07","full_description":"With Afghanistan gearing up to face Sri Lanka in their Super League Quarter Final 4 fixture of the ongoing U-19 Cricket World Cup , the ICC took to social media to give fans an update about the team's preparations. In a video shared on social media, the youngsters could be seen doing their unique way of warming up with some dance moves. Posting the video on Instagram, the ICC captioned it as: \"The Afghanistan U19 squad has got some moves\". Here is the video: A post shared by ICC (@icc) One user explained that the dance being performed by the players is Attan, a dance form popular among Pashtuns. The Afghan team was in good form during the group stage and came second in Group C behind Pakistan. Led by Suliman Safi, they notched four points with a net run-rate of 1.467. In their previous game, they defeated Zimbabwe by 109 runs and will be hoping to build on some momentum. Against Zimbabwe, the Afghans posted 261 for six courtesy of a century by their skipper. The Afghanistan captain put on 111 from 118 balls, including 14 fours and three sixes, to move Afghanistan to 261 for six as he was dismissed on the final ball of the innings. Four other batters posted scores of over 20, with opener Nageyalia Kharote contributing an important half-century from 45 balls. Alex Falao was the pick of the bowlers for Zimbabwe as he took three for 54 from his ten overs to move on to eight wickets for the tournament so far. Meanwhile, left-arm spinner Nangeyalia Kharote ensured that they successfully defended their target of 262 runs and registered four wickets to bowl Zimbabwe out for 152 in 36.4 overs. Promoted Afghanistan's Super League Quarter Final 1 is scheduled to take place on Thursday and will be held at the Coolidge Cricket Ground in Osbourn, Antigua. (With ANI inputs)","image_url":"https://c.ndtvimg.com/2022-01/jgdmbe9o_afghanistan-dance-insta_120x90_27_January_22.jpg","source_id":"ndtv"},{"title":"The Hundred To Be Back For Second Edition, To Begin On August 3","link":"https://sports.ndtv.com/cricket/the-hundred-to-be-back-for-second-edition-to-begin-on-august-3-2732497","keywords":null,"creator":null,"video_url":null,"description":"Following rave reviews in its inaugural year, cricket's newest competition, The Hundred, will be back for a second season on August 3, 2022, to thrill crowds with an unrivalled line-up of...","content":null,"pubDate":"2022-01-27 10:00:51","full_description":"Following rave reviews in its inaugural year, cricket's newest competition, The Hundred, will be back for a second season on August 3, 2022, to thrill crowds with an unrivalled line-up of entertainment and adrenaline-pumping cricket for all. The Hundred will throw cricket's doors open once again, showcasing the competition's fast-paced on-field action, with women's and men's cricket performing on the same stage, accompanied by DJs, live music artists, and family-friendly activities, putting it firmly on the map as the must-attend event of the summer. Defending men's champions Southern Brave will welcome Welsh Fire to the Ageas Bowl, Southampton, on Wednesday, August 3 for the first match of this year's high-octane competition. The Hundred's women's competition will kick off at The Kia Oval, London, on Wednesday, August 11, following the England Women's team's first-ever year of participation in the Commonwealth Games. With a record-breaking 267,000 people attending the women's matches across The Hundred last year, 2022 promises to be an incredibly exciting summer for women's cricket. The second and third-placed teams will face each other at the Ageas Bowl in The Hundred Eliminator on Friday, September 2, with the winners facing the top-ranked team in The Hundred Final on Saturday, September 3 at Lord's. Alice Capsey, the 17-year-old Oval Invincibles player who set the 2021 competition alight and has since been recognized as a rising star within the women's game said: \"Last year was such an exciting year for the women's game. Playing in the opening match of the competition and winning the first-ever final of The Hundred are moments that I will never forget.\" Promoted \"I still remember seeing all the fans at The Oval for the first game, there were so many young girls, it was so special. I'm sure the second year of the women's competition is going to be even more exciting. Everyone involved will be desperate to get going again and hopefully we can bring even more fans to the game,\" she added.","image_url":"https://c.ndtvimg.com/2020-04/qfb8h0us_the-hundred-generic-twitter_625x300_24_April_20.jpg?im=FaceCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv"},{"title":"\"Unfortunate But Its The Truth\": Butt On Shastri's Remark On Virat Kohli","link":"https://sports.ndtv.com/cricket/unfortunate-but-its-the-truth-salman-butt-on-shastris-remark-on-virat-kohli-2732595","keywords":null,"creator":null,"video_url":null,"description":"Discussing Shastri's comment, former Pakistan captain SalmanButtsaid that ex-coach Shastri would have known the environment within the Indian cricket team better than anybody else.","content":null,"pubDate":"2022-01-27 09:24:41","full_description":"The position of India's Test captain stands vacant at the moment after Virat Kohli's resignation from the role at the end of the three-match series in South Africa. Kohli dropped a bombshell earlier this month with his decision to step down as captain after losing the three-match Test series 1-2. Since then, rumours have been doing the rounds over the replacement for Kohli. Recently, former India head coach Ravi Shastri said in an interview to Aaj Tak that Kohli could have stayed on as Test captain for couple of more years but “people wouldn't have digested his success”. Discussing Shastri's comment, former Pakistan captain Salman Butt said that ex-coach Shastri would have known the environment within the Indian cricket team better than anybody else. \"Obviously, Shastri knows the environment better than anybody else. We all know that the environment of India and Pakistan teams are almost similar but unfortunate that such a mindset still prevails and maybe this is the reason behind top-class athletes failing to give their best. There are many roadblocks on their path and they are their own people. It's unfortunate but (it's) the truth,\" said Butt on his YouTube channel. \"For sure, he could have led India for at least two years because next two years India would be playing at home and who is coming over - 9 and 10 jacks, if you see the rankings. He would have then probably made it to 50 wins under his captaincy and then a lot of people would have had difficulties in digesting that fact,\" Shastri had earlier told Sports Tak in an interview. Under Kohli's captaincy, India played 68 Tests and won 40 of them and he holds the record for the best win percentage by an Indian skipper.","image_url":"https://c.ndtvimg.com/2021-09/72oh9pi_ravi-shastri-afp_625x300_06_September_21.jpg?im=FaceCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv"},{"title":"WOG vs INM Dream11 Team Prediction, Fantasy Cricket Hints World Giants vs India Maharaja: Captain, Probable Playing 11s, Team News; Injury Updates For the Legends Cricket League 2022 at Al Amerat Cricket Ground, Oman, 8:00 PM IST January 27","link":"https://zeenews.india.com/cricket/wog-vs-inm-dream11-team-prediction-fantasy-cricket-hints-world-giants-vs-india-maharaja-captain-probable-playing-11s-team-news-injury-updates-for-the-legends-cricket-league-2022-at-al-amerat-cricket-ground-oman-800-pm-ist-january-27-2430882.html","keywords":null,"creator":null,"video_url":null,"description":"Check WOG vs INM Dream11 Team Prediction for World Giants vs India Maharaja Legends League Cricket match.","content":null,"pubDate":"2022-01-27 09:17:00","full_description":null,"image_url":null,"source_id":"zeenews"}]}